{
  "id": "30351",
  "name": "'Abdullah bin Muhammad al-Musandi عبد الله بن محمد المسندي",
  "full_name": "'Abdullah bin Muhammad al-Musandi عبد الله بن محمد المسندي",
  "grade": "3rd Century AH [10th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "229",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Bukhara"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ خ  ت  -  ثقة حافظ ]"
    ],
    "tags": [
      "al-Bukhari",
      "Hafiz"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20121",
      "name": "'Abdur-Razzaq عبد الرزاق بن همام",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20221",
      "name": "Harmy bin 'Umarah حرمي بن عمارة بن أبي حفصة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20411",
      "name": "Ishaq bin Yusuf bin Mrdas إسحاق بن يوسف بن مرداس",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "20033",
      "name": "'Abdur Rahman bin Mahdi عبد الرحمن بن مهدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20443",
      "name": "Abu 'Amir al-'Aqdi عبد الملك بن عمرو القيسي أبو عامر العقدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "28165",
      "name": "al-Khlyl bin Ahmed al-Mzny الخليل بن أحمد المزني",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20288",
      "name": "Ma'tmar bin Sulaiman-al-Taufayl معتمر بن سليمان - الطفيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20364",
      "name": "Yahya bin Aadm bin Sulaiman يحيى بن آدم بن سليمان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30023",
      "name": "Muhammad bin Yahya bin Faris al-Dhahli محمد بن يحيى بن فارس الذهلي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38607",
      "name": "Muhammad bin Nasr al-Mervazi محمد بن نصر المروزي الفقيه أبو عبد",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "38024",
      "name": "Ahmed bin Syar bin Ayoub أحمد بن سيار بن أيوب",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "36550",
      "name": "Hmdwn bin Amarh al-Bghdady حمدون بن عمارة البغدادي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "9",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الله بن محمد، قال حدثنا أبو عامر العقدي، قال حدثنا سليمان بن بلال، عن عبد الله بن دينار، عن أبي صالح، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ الإيمان بضع وستون شعبة، والحياء شعبة من الإيمان ‏\"‏‏.‏",
      "text_en": "      Narrated Abu Huraira:                          The Prophet said, \"Faith (Belief) consists of more than sixty branches     (i.e. parts). And Haya (This term \"Haya\" covers a large number of      concepts which are to be taken together; amongst them are self      respect, modesty, bashfulness, and scruple, etc.) is a part of      faith.\"",
      "chain": [
        "30351",
        "20443",
        "20160",
        "11183",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "25",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الله بن محمد المسندي، قال حدثنا أبو روح الحرمي بن عمارة، قال حدثنا شعبة، عن واقد بن محمد، قال سمعت أبي يحدث، عن ابن عمر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أمرت أن أقاتل الناس حتى يشهدوا أن لا إله إلا الله وأن محمدا رسول الله، ويقيموا الصلاة، ويؤتوا الزكاة، فإذا فعلوا ذلك عصموا مني دماءهم وأموالهم إلا بحق الإسلام، وحسابهم على الله ‏\"‏‏.‏",
      "text_en": "      Narrated Ibn 'Umar:                          Allah's Apostle said: \"I have been ordered (by Allah) to fight against     the people until they testify that none has the right to be worshipped     but Allah and that Muhammad is Allah's Apostle, and offer the prayers      perfectly and give the obligatory charity, so if they perform that,      then they save their lives and property from me except for Islamic laws     and then their reckoning (accounts) will be done by Allah.\"",
      "chain": [
        "30351",
        "20221",
        "20020",
        "11544",
        "11217",
        "18"
      ]
    },
    {
      "hadith_no": "91",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا عبد الله بن محمد، قال حدثنا أبو عامر، قال حدثنا سليمان بن بلال المديني، عن ربيعة بن أبي عبد الرحمن، عن يزيد، مولى المنبعث عن زيد بن خالد الجهني، أن النبي صلى الله عليه وسلم سأله رجل عن اللقطة فقال ‏\"‏ اعرف وكاءها  أو قال وعاءها  وعفاصها، ثم عرفها سنة، ثم استمتع بها، فإن جاء ربها فأدها إليه ‏\"‏‏.‏ قال فضالة الإبل فغضب حتى احمرت وجنتاه  أو قال احمر وجهه  فقال ‏\"‏ وما لك ولها معها سقاؤها وحذاؤها، ترد الماء، وترعى الشجر، فذرها حتى يلقاها ربها ‏\"‏‏.‏ قال فضالة الغنم قال ‏\"‏ لك أو لأخيك أو للذئب ‏\"‏‏.‏",
      "text_en": " Narrated Zaid bin Khalid Al-Juhani:                     A man asked the Prophet about the picking up of a \"Luqata\" (fallen lost thing). The Prophet replied, \"Recognize and remember its tying material and its container, and make public announcement (about it) for one year, then utilize it but give it to its owner if he comes.\" Then the person asked about the lost camel. On that, the Prophet got angry and his cheeks or his Face became red and he said, \"You have no concern with it as it has its water container, and its feet and it will reach water, and eat (the leaves) of trees till its owner finds it.\" The man then asked about the lost sheep. The Prophet replied, \"It is either for you, for your brother (another person) or for the wolf.\"",
      "chain": [
        "30351",
        "20443",
        "20160",
        "11162",
        "11238",
        "3625"
      ]
    },
    {
      "hadith_no": "122",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا عبد الله بن محمد، قال حدثنا سفيان، قال حدثنا عمرو، قال أخبرني سعيد بن جبير، قال قلت لابن عباس إن نوفا البكالي يزعم أن موسى ليس بموسى بني إسرائيل، إنما هو موسى آخر‏.‏ فقال كذب عدو الله، حدثنا أبى بن كعب عن النبي صلى الله عليه وسلم قال ‏\"‏ قام موسى النبي خطيبا في بني إسرائيل، فسئل أى الناس أعلم فقال أنا أعلم‏.‏ فعتب الله عليه، إذ لم يرد العلم إليه، فأوحى الله إليه أن عبدا من عبادي بمجمع البحرين هو أعلم منك‏.‏ قال يا رب وكيف به فقيل له احمل حوتا في مكتل فإذا فقدته فهو ثم، فانطلق وانطلق بفتاه يوشع بن نون، وحملا حوتا في مكتل، حتى كانا عند الصخرة وضعا رءوسهما وناما فانسل الحوت من المكتل فاتخذ سبيله في البحر سربا، وكان لموسى وفتاه عجبا، فانطلقا بقية ليلتهما ويومهما فلما أصبح قال موسى لفتاه آتنا غداءنا، لقد لقينا من سفرنا هذا نصبا، ولم يجد موسى مسا من النصب حتى جاوز المكان الذي أمر به‏.‏ فقال له فتاه أرأيت إذ أوينا إلى الصخرة فإني نسيت الحوت، قال موسى ذلك ما كنا نبغي، فارتدا على آثارهما قصصا، فلما انتهيا إلى الصخرة إذا رجل مسجى بثوب  أو قال تسجى بثوبه  فسلم موسى‏.‏ فقال الخضر وأنى بأرضك السلام فقال أنا موسى‏.‏ فقال موسى بني إسرائيل قال نعم‏.‏ قال هل أتبعك على أن تعلمني مما علمت رشدا قال إنك لن تستطيع معي صبرا، يا موسى إني على علم من علم الله علمنيه لا تعلمه أنت، وأنت على علم علمكه لا أعلمه‏.‏ قال ستجدني إن شاء الله صابرا، ولا أعصي لك أمرا، فانطلقا يمشيان على ساحل البحر ليس لهما سفينة، فمرت بهما سفينة، فكلموهم أن يحملوهما، فعرف الخضر، فحملوهما بغير نول، فجاء عصفور فوقع على حرف السفينة، فنقر نقرة أو نقرتين في البحر‏.‏ فقال الخضر يا موسى، ما نقص علمي وعلمك من علم الله إلا كنقرة هذا العصفور في البحر‏.‏ فعمد الخضر إلى لوح من ألواح السفينة فنزعه‏.‏ فقال موسى قوم حملونا بغير نول، عمدت إلى سفينتهم فخرقتها لتغرق أهلها قال ألم أقل إنك لن تستطيع معي صبرا قال لا تؤاخذني بما نسيت‏.‏ فكانت الأولى من موسى نسيانا‏.‏ فانطلقا فإذا غلام يلعب مع الغلمان، فأخذ الخضر برأسه من أعلاه فاقتلع رأسه بيده‏.‏ فقال موسى أقتلت نفسا زكية بغير نفس قال ألم أقل لك إنك لن تستطيع معي صبرا  قال ابن عيينة وهذا أوكد  فانطلقا حتى إذا أتيا أهل قرية استطعما أهلها، فأبوا أن يضيفوهما، فوجدا فيها جدارا يريد أن ينقض فأقامه‏.‏ قال الخضر بيده فأقامه‏.‏ فقال له موسى لو شئت لاتخذت عليه أجرا‏.‏ قال هذا فراق بيني وبينك ‏\"‏‏.‏ قال النبي صلى الله عليه وسلم ‏\"‏ يرحم الله موسى، لوددنا لو صبر حتى يقص علينا من أمرهما ‏\"‏‏.‏",
      "text_en": " Narrated Sa`id bin Jubair:                     I said to Ibn `Abbas, \"Nauf-Al-Bakali claims that Moses (the companion of Khadir) was not the Moses of Bani Israel but he was another Moses.\" Ibn `Abbas remarked that the enemy of Allah (Nauf) was a liar.Narrated Ubai bin Ka`b:The Prophet said, \"Once the Prophet Moses stood up and addressed Bani Israel. He was asked, \"Who is the most learned man amongst the people. He said, \"I am the most learned.\" Allah admonished Moses as he did not attribute absolute knowledge to Him (Allah). So Allah inspired to him \"At the junction of the two seas there is a slave amongst my slaves who is more learned than you.\" Moses said, \"O my Lord! How can I meet him?\" Allah said: Take a fish in a large basket (and proceed) and you will find him at the place where you will lose the fish. So Moses set out along with his (servant) boy, Yusha` bin Noon and carried a fish in a large basket till they reached a rock, where they laid their heads (i.e. lay down) and slept. The fish came out of the basket and it took its way into the sea as in a tunnel. So it was an amazing thing for both Moses and his (servant) boy. They proceeded for the rest of that night and the following day. When the day broke, Moses said to his (servant) boy: \"Bring us our early meal. No doubt, we have suffered much fatigue in this journey.\" Moses did not get tired till he passed the place about which he was told. There the (servant) boy told Moses, \"Do you remember when we betook ourselves to the rock, I indeed forgot the fish.\" Moses remarked, \"That is what we have been seeking. So they went back retracing their footsteps, till they reached the rock. There they saw a man covered with a garment (or covering himself with his own garment). Moses greeted him. Al-Khadir replied saying, \"How do people greet each other in your land?\" Moses said, \"I am Moses.\" He asked, \"The Moses of Bani Israel?\" Moses replied in the affirmative and added, \"May I follow you so that you teach me of that knowledge which you have been taught.\" Al-Khadir replied, \"Verily! You will not be able to remain patient with me, O Moses! I have some of the knowledge of Allah which He has taught me and which you do not know, while you have some knowledge which Allah has taught you which I do not know.\" Moses said, \"Allah willing, you will find me patient and I will disobey no order of yours. So both of them set out walking along the seashore, as they did not have a boat. In the meantime a boat passed by them and they requested the crew of the boat to take them on board. The crew recognized Al-Khadir and took them on board without fare. Then a sparrow came and stood on the edge of the boat and dipped its beak once or twice in the sea. Al-Khadir said: \"O Moses! My knowledge and your knowledge have not decreased Allah's knowledge except as much as this sparrow has decreased the water of the sea with its beak.\" Al- Khadir went to one of the planks of the boat and plucked it out. Moses said, \"These people gave us a free lift but you have broken their boat and scuttled it so as to drown its people.\" Al-Khadir replied, \"Didn't I tell you that you will not be able to remain patient with me.\" Moses said, \"Call me not to account for what I forgot.\" The first (excuse) of Moses was that he had forgotten. Then they proceeded further and found a boy playing with other boys. Al-Khadir took hold of the boy's head from the top and plucked it out with his hands (i.e. killed him). Moses said, \"Have you killed an innocent soul who has killed none.\" Al-Khadir replied, \"Did I not tell you that you cannot remain patient with me?\" Then they both proceeded till when they came to the people of a town, they asked them for food, but they refused to entertain them. Then they found there a wall on the point of collapsing. Al-Khadir repaired it with his own hands. Moses said, \"If you had wished, surely you could have taken wages for it.\" Al-Khadir replied, \"This is the parting between you and me.\" The Prophet added, \"May Allah be Merciful to Moses! Would that he could have been more patient to learn more about his story with Al-Khadir. \"",
      "chain": [
        "30351",
        "20005",
        "11081",
        "11050",
        "39"
      ]
    },
    {
      "hadith_no": "143",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا عبد الله بن محمد، قال حدثنا هاشم بن القاسم، قال حدثنا ورقاء، عن عبيد الله بن أبي يزيد، عن ابن عباس، أن النبي صلى الله عليه وسلم دخل الخلاء، فوضعت له وضوءا قال ‏\"‏ من وضع هذا ‏\"‏‏.‏ فأخبر فقال ‏\"‏ اللهم فقهه في الدين ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Once the Prophet entered a lavatory and I placed water for his ablution. He asked, \"Who placed it?\" He was informed accordingly and so he said, \"O Allah! Make him (Ibn `Abbas) a learned scholar in religion (Islam).",
      "chain": [
        "30351",
        "20390",
        "20363",
        "11258",
        "17"
      ]
    },
    {
      "hadith_no": "251",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الله بن محمد، قال حدثني عبد الصمد، قال حدثني شعبة، قال حدثني أبو بكر بن حفص، قال سمعت أبا سلمة، يقول دخلت أنا وأخو، عائشة على عائشة فسألها أخوها عن غسل النبي، صلى الله عليه وسلم فدعت بإناء نحوا من صاع، فاغتسلت وأفاضت على رأسها، وبيننا وبينها حجاب‏.‏ قال أبو عبد الله قال يزيد بن هارون وبهز والجدي عن شعبة قدر صاع‏.‏",
      "text_en": " Narrated Abu Salama:                     `Aisha's brother and I went to `Aisha and he asked her about the bath of the Prophet. She brought a pot containing about a Sa` of water and took a bath and poured it over her head and at what time there was a screen between her and us.",
      "chain": [
        "30351",
        "20250",
        "20020",
        "11180",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "252",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الله بن محمد، قال حدثنا يحيى بن آدم، قال حدثنا زهير، عن أبي إسحاق، قال حدثنا أبو جعفر، أنه كان عند جابر بن عبد الله هو وأبوه، وعنده قوم فسألوه عن الغسل،‏.‏ فقال يكفيك صاع‏.‏ فقال رجل ما يكفيني‏.‏ فقال جابر كان يكفي من هو أوفى منك شعرا، وخير منك، ثم أمنا في ثوب‏.‏",
      "text_en": " Narrated Abu Ja`far:                     While I and my father were with Jabir bin `Abdullah, some People asked him about taking a bath He replied, \"A Sa` of water is sufficient for you.\" A man said, \"A Sa` is not sufficient for me.\" Jabir said, \"A Sa was sufficient for one who had more hair than you and was better than you (meaning the Prophet).\" And then Jabir (put on) his garment and led the prayer.",
      "chain": [
        "30351",
        "20364",
        "20321",
        "11049",
        "11442",
        "34"
      ]
    },
    {
      "hadith_no": "275",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الله بن محمد، قال حدثنا عثمان بن عمر، قال أخبرنا يونس، عن الزهري، عن أبي سلمة، عن أبي هريرة، قال أقيمت الصلاة، وعدلت الصفوف قياما، فخرج إلينا رسول الله صلى الله عليه وسلم فلما قام في مصلاه ذكر أنه جنب فقال لنا ‏:‏ ‏\"‏ مكانكم ‏\"‏‏.‏ ثم رجع فاغتسل، ثم خرج إلينا ورأسه يقطر، فكبر فصلينا معه‏.‏ تابعه عبد الأعلى عن معمر عن الزهري‏.‏ ورواه الأوزاعي عن الزهري‏.‏",
      "text_en": " Narrated Abu Huraira:                     Once the call (Iqama) for the prayer was announced and the rows were straightened. Allah's Apostle came out; and when he stood up at his Musalla, he remembered that he was Junub. Then he ordered us to stay at our places and went to take a bath and then returned with water dropping from his head. He said, \"Allahu-Akbar\", and we all offered the prayer with him.",
      "chain": [
        "30351",
        "20262",
        "20475",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "320",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا عبد الله بن محمد، قال حدثنا سفيان، عن هشام، عن أبيه، عن عائشة، أن فاطمة بنت أبي حبيش، كانت تستحاض فسألت النبي صلى الله عليه وسلم فقال ‏\"‏ ذلك عرق، وليست بالحيضة، فإذا أقبلت الحيضة فدعي الصلاة، وإذا أدبرت فاغتسلي وصلي ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     Fatima bint Abi Hubaish used to have bleeding in between the periods, so she asked the Prophet about it . He replied, \"The bleeding is from a blood vessel and not the menses. So give up the prayers when the (real) menses begin and when it has finished, take a bath and start praying.\"",
      "chain": [
        "30351",
        "20005",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "457",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الله بن محمد، قال حدثنا عثمان بن عمر، قال أخبرنا يونس، عن الزهري، عن عبد الله بن كعب بن مالك، عن كعب، أنه تقاضى ابن أبي حدرد دينا كان له عليه في المسجد، فارتفعت أصواتهما حتى سمعها رسول الله صلى الله عليه وسلم وهو في بيته، فخرج إليهما حتى كشف سجف حجرته فنادى ‏\"‏ يا كعب ‏\"‏‏.‏ قال لبيك يا رسول الله‏.‏ قال ‏\"‏ ضع من دينك هذا ‏\"‏‏.‏ وأومأ إليه أى الشطر قال لقد فعلت يا رسول الله‏.‏ قال ‏\"‏ قم فاقضه ‏\"‏‏.‏",
      "text_en": " Narrated Ka`b:                     In the mosque l asked Ibn Abi Hadrad to pay the debts which he owed to me and our voices grew louder. Allah's Apostle heard that while he was in his house. So he came to us raising the curtain of his room and said, \"O Ka`b!\" I replied, \"Labaik, O Allah's Apostle!\" He said, \"O Ka`b! reduce your debt to one half,\" gesturing with his hand. I said, \"O Allah's Apostle! I have done so.\" Then Allah's Apostle said (to Ibn Abi Hadrad), \"Get up and pay the debt to him.\"",
      "chain": [
        "30351",
        "20262",
        "20475",
        "11013",
        "1131"
      ]
    },
    {
      "hadith_no": "467",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الله بن محمد الجعفي، قال حدثنا وهب بن جرير، قال حدثنا أبي قال، سمعت يعلى بن حكيم، عن عكرمة، عن ابن عباس، قال خرج رسول الله صلى الله عليه وسلم في مرضه الذي مات فيه عاصب رأسه بخرقة، فقعد على المنبر، فحمد الله وأثنى عليه ثم قال ‏\"‏ إنه ليس من الناس أحد أمن على في نفسه وماله من أبي بكر بن أبي قحافة، ولو كنت متخذا من الناس خليلا لاتخذت أبا بكر خليلا، ولكن خلة الإسلام أفضل، سدوا عني كل خوخة في هذا المسجد غير خوخة أبي بكر ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     \"Allah's Apostle in his fatal illness came out with a piece of cloth tied round his head and sat on the pulpit. After thanking and praising Allah he said, \"There is no one who had done more favor to me with life and property than Abu Bakr bin Abi Quhafa. If I were to take a Khalil, I would certainly have taken Abu- Bakr but the Islamic brotherhood is superior. Close all the small doors in this mosque except that of Abu Bakr.\"",
      "chain": [
        "30351",
        "20298",
        "11272",
        "11567",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "722",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد الله بن محمد، قال حدثنا عبد الرزاق، قال أخبرنا معمر، عن همام، عن أبي هريرة، عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ إنما جعل الإمام ليؤتم به فلا تختلفوا عليه، فإذا ركع فاركعوا، وإذا قال سمع الله لمن حمده‏.‏ فقولوا ربنا لك الحمد‏.‏ وإذا سجد فاسجدوا، وإذا صلى جالسا فصلوا جلوسا أجمعون، وأقيموا الصف في الصلاة، فإن إقامة الصف من حسن الصلاة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"The Imam is (appointed) to be followed. So do not differ from him, bow when he bows, and say, \"Rabbana-lakal hamd\" if he says \"Sami`a l-lahu liman hamidah\"; and if he prostrates, prostrate (after him), and if he prays sitting, pray sitting all together, and straighten the rows for the prayer, as the straightening of the rows is amongst those things which make your prayer a correct and perfect one. (See Hadith No. 657).",
      "chain": [
        "30351",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "727",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد الله بن محمد، قال حدثنا سفيان، عن إسحاق، عن أنس بن مالك، قال صليت أنا ويتيم، في بيتنا خلف النبي صلى الله عليه وسلم وأمي أم سليم خلفنا‏.‏",
      "text_en": " Narrated Anas bin Malik:                     One night an orphan and I offered the prayers behind the Prophet in my house and my mother (Um Sulaim) was standing behind us (by herself forming a row).",
      "chain": [
        "30351",
        "20005",
        "30312",
        "19"
      ]
    },
    {
      "hadith_no": "854",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد الله بن محمد، قال حدثنا أبو عاصم، قال أخبرنا ابن جريج، قال أخبرني عطاء، قال سمعت جابر بن عبد الله، قال قال النبي صلى الله عليه وسلم ‏\"‏ من أكل من هذه الشجرة  يريد الثوم  فلا يغشانا في مساجدنا ‏\"‏‏.‏ قلت ما يعني به قال ما أراه يعني إلا نيئه‏.‏ وقال مخلد بن يزيد عن ابن جريج إلا نتنه‏.‏",
      "text_en": " Narrated `Ata':                     I heard Jabir bin `Abdullah saying, \"The Prophet said, 'Whoever eats (from) this plant (he meant garlic) should keep away from our mosque.\" I said, \"What does he mean by that?\" He replied, \"I think he means only raw garlic.\"",
      "chain": [
        "30351",
        "20241",
        "11070",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "866",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا عثمان بن عمر، أخبرنا يونس، عن الزهري، قال حدثتني هند بنت الحارث، أن أم سلمة، زوج النبي صلى الله عليه وسلم أخبرتها أن النساء في عهد رسول الله صلى الله عليه وسلم كن إذا سلمن من المكتوبة قمن، وثبت رسول الله صلى الله عليه وسلم ومن صلى من الرجال ما شاء الله، فإذا قام رسول الله صلى الله عليه وسلم قام الرجال‏.‏",
      "text_en": " Narrated Um Salama:                     (the wife of the Prophet) In the lifetime of Allah's Apostle the women used to get up when they finished their compulsory prayers with Taslim. The Prophet and the men would stay on at their places as long as Allah will. When the Prophet got up, the men would then get up.",
      "chain": [
        "30351",
        "20262",
        "20475",
        "11013",
        "11734"
      ]
    },
    {
      "hadith_no": "899",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا شبابة، حدثنا ورقاء، عن عمرو بن دينار، عن مجاهد، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏\"‏ ائذنوا للنساء بالليل إلى المساجد ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet (p.b.u.h) said, \"Allow women to go to the Mosques at night.\"",
      "chain": [
        "30351",
        "20426",
        "20363",
        "11081",
        "11028",
        "18"
      ]
    },
    {
      "hadith_no": "1027",
      "source": " Sahih Bukhari ",
      "chapter": "Invoking Allah for Rain (Istisqaa) - كتاب الاستسقاء",
      "chapter_no": "15",
      "text_ar": "حدثنا عبد الله بن محمد، قال حدثنا سفيان، عن عبد الله بن أبي بكر، سمع عباد بن تميم، عن عمه، قال خرج النبي صلى الله عليه وسلم إلى المصلى يستسقي، واستقبل القبلة فصلى ركعتين، وقلب رداءه‏.‏ قال سفيان فأخبرني المسعودي عن أبي بكر قال جعل اليمين على الشمال‏.‏",
      "text_en": " Narrated `Abbas bin Tamim from his uncle who said:                     \"The Prophet went out to the Musalla to offer the Istisqa' prayer, faced the Qibla and offered a tworak` at prayer and turned his cloak inside out.\" Narrated Abu Bakr, \"The Prophet put the right side of his cloak on his left side.\"",
      "chain": [
        "30351",
        "20005",
        "11104",
        "639"
      ]
    },
    {
      "hadith_no": "1043",
      "source": " Sahih Bukhari ",
      "chapter": "Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "حدثنا عبد الله بن محمد، قال حدثنا هاشم بن القاسم، قال حدثنا شيبان أبو معاوية، عن زياد بن علاقة، عن المغيرة بن شعبة، قال كسفت الشمس على عهد رسول الله صلى الله عليه وسلم يوم مات إبراهيم، فقال الناس كسفت الشمس لموت إبراهيم‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن الشمس والقمر لا ينكسفان لموت أحد ولا لحياته، فإذا رأيتم فصلوا وادعوا الله ‏\"‏‏.‏",
      "text_en": " Narrated Al-Mughira bin Shu`ba:                     \"The sun eclipsed in the lifetime of Allah's Apostle on the day when (his son) Ibrahim died. So the people said that the sun had eclipsed because of the death of Ibrahim. Allah's Apostle said, \"The sun and the moon do not eclipse because of the death or life (i.e. birth) of someone. When you see the eclipse pray and invoke Allah.\"",
      "chain": [
        "30351",
        "20390",
        "20240",
        "11339",
        "166"
      ]
    },
    {
      "hadith_no": "1058",
      "source": " Sahih Bukhari ",
      "chapter": "Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "حدثنا عبد الله بن محمد، قال حدثنا هشام، أخبرنا معمر، عن الزهري، وهشام بن عروة، عن عروة، عن عائشة  رضى الله عنها  قالت كسفت الشمس على عهد رسول الله صلى الله عليه وسلم فقام النبي صلى الله عليه وسلم فصلى بالناس، فأطال القراءة، ثم ركع فأطال الركوع، ثم رفع رأسه فأطال القراءة، وهى دون قراءته الأولى، ثم ركع فأطال الركوع دون ركوعه الأول، ثم رفع رأسه فسجد سجدتين، ثم قام فصنع في الركعة الثانية مثل ذلك، ثم قام فقال ‏\"‏ إن الشمس والقمر لا يخسفان لموت أحد ولا لحياته، ولكنهما آيتان من آيات الله يريهما عباده، فإذا رأيتم ذلك فافزعوا إلى الصلاة ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     In the lifetime of the Prophet the sun eclipsed and the Prophet (p.b.u.h) stood up to offer the prayer with the people and recited a long recitation, then he performed a prolonged bowing, and then lifted his head and recited a prolonged recitation which was shorter than the first. Then he performed a prolonged bowing which was shorter than the first and then lifted his head and performed two prostrations. He then stood up for the second rak`a and offered it like the first. Then he stood up and said, \"The sun and the moon do not eclipse because of someone's life or death but they are two signs amongst the signs of Allah which He shows to His worshipers. So whenever you see them, make haste for the prayer.\"",
      "chain": [
        "30351",
        "20295",
        "20115",
        "11013",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1090",
      "source": " Sahih Bukhari ",
      "chapter": "Shortening the Prayers (At-Taqseer) - كتاب التقصير",
      "chapter_no": "18",
      "text_ar": "حدثنا عبد الله بن محمد، قال حدثنا سفيان، عن الزهري، عن عروة، عن عائشة  رضى الله عنها  قالت الصلاة أول ما فرضت ركعتين فأقرت صلاة السفر، وأتمت صلاة الحضر‏.‏ قال الزهري فقلت لعروة ما بال عائشة تتم قال تأولت ما تأول عثمان‏.‏",
      "text_en": " Narrated `Aisha:                     \"When the prayers were first enjoined they were of two rak`at each. Later the prayer in a journey was kept as it was but the prayers for non-travelers were completed.\" Az-Zuhri said, \"I asked `Urwa what made Aisha pray the full prayers (in journey).\" He replied, \"She did the same as `Uthman did.\"",
      "chain": [
        "30351",
        "20005",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1121",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا عبد الله بن محمد، قال حدثنا هشام، قال أخبرنا معمر،‏.‏ وحدثني محمود، قال حدثنا عبد الرزاق، قال أخبرنا معمر، عن الزهري، عن سالم، عن أبيه  رضى الله عنه  قال كان الرجل في حياة النبي صلى الله عليه وسلم إذا رأى رؤيا قصها على رسول الله صلى الله عليه وسلم فتمنيت أن أرى رؤيا فأقصها على رسول الله صلى الله عليه وسلم وكنت غلاما شابا، وكنت أنام في المسجد على عهد رسول الله صلى الله عليه وسلم فرأيت في النوم كأن ملكين أخذاني فذهبا بي إلى النار فإذا هي مطوية كطى البئر، وإذا لها قرنان، وإذا فيها أناس قد عرفتهم فجعلت أقول أعوذ بالله من النار  قال  فلقينا ملك آخر فقال لي لم ترع‏.‏ فقصصتها على حفصة فقصتها حفصة على رسول الله صلى الله عليه وسلم فقال ‏\"‏ نعم الرجل عبد الله، لو كان يصلي من الليل ‏\"‏‏.‏ فكان بعد لا ينام من الليل إلا قليلا‏.‏",
      "text_en": " Narrated Salim's father:                     In the lifetime of the Prophet whosoever saw a dream would narrate it to Allah's Apostle. I had a wish of seeing a dream to narrate it to Allah's Apostle (p.b.u.h) I was a grown up boy and used to sleep in the Mosque in the lifetime of the Prophet. I saw in the dream that two angels caught hold of me and took me to the Fire which was built all round like a built well and had two poles in it and the people in it were known to me. I started saying, \"I seek refuge with Allah from the Fire.\" Then I met another angel who told me not to be afraid. I narrated the dream to Hafsa who told it to Allah's Apostle. The Prophet said, \"Abdullah is a good man. I wish he prayed Tahajjud.\" After that `Abdullah (i.e. Salim's father) used to sleep but a little at night.",
      "chain": [
        "30351",
        "20295",
        "20115",
        "30277",
        "20121",
        "20115",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "1285",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا أبو عامر، حدثنا فليح بن سليمان، عن هلال بن علي، عن أنس بن مالك  رضى الله عنه  قال شهدنا بنتا لرسول الله صلى الله عليه وسلم قال ورسول الله صلى الله عليه وسلم جالس على القبر  قال فرأيت عينيه تدمعان قال  فقال ‏\"‏ هل منكم رجل لم يقارف الليلة ‏\"‏‏.‏ فقال أبو طلحة أنا‏.‏ قال ‏\"‏ فانزل ‏\"‏‏.‏ قال فنزل في قبرها‏.‏",
      "text_en": " Narrated Anas bin Malik:                     We were (in the funeral procession) of one of the daughters of the Prophet and he was sitting by the side of the grave. I saw his eyes shedding tears. He said, \"Is there anyone among you who did not have sexual relations with his wife last night?\" Abu Talha replied in the affirmative. And so the Prophet told him to get down in the grave. And so he got down in her grave.",
      "chain": [
        "30351",
        "20443",
        "20169",
        "11229",
        "19"
      ]
    },
    {
      "hadith_no": "1371",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا سفيان، عن هشام بن عروة، عن أبيه، عن عائشة  رضى الله عنها  قالت إنما قال النبي صلى الله عليه وسلم ‏\"‏ إنهم ليعلمون الآن أن ما كنت أقول حق وقد قال الله تعالى ‏{‏إنك لا تسمع الموتى‏}‏‏\"‏",
      "text_en": " Narrated `Aisha:                     The Prophet said, \"They now realize that what I used to tell them was the truth. \"And Allah said, 'Verily! You cannot make the dead to hear (i.e. benefit them, and similarly the disbelievers) nor can you make the deaf hear. (27.80).",
      "chain": [
        "30351",
        "20005",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1434",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا أبو عاصم النبيل، أخبرنا سعدان بن بشر، حدثنا أبو مجاهد، حدثنا محل بن خليفة الطائي، قال سمعت عدي بن حاتم  رضى الله عنه  يقول كنت عند رسول الله صلى الله عليه وسلم فجاءه رجلان أحدهما يشكو العيلة، والآخر يشكو قطع السبيل، فقال رسول الله صلى الله عليه وسلم ‏\"‏ أما قطع السبيل فإنه لا يأتي عليك إلا قليل حتى تخرج العير إلى مكة بغير خفير، وأما العيلة فإن الساعة لا تقوم حتى يطوف أحدكم بصدقته لا يجد من يقبلها منه، ثم ليقفن أحدكم بين يدى الله ليس بينه وبينه حجاب ولا ترجمان يترجم له، ثم ليقولن له ألم أوتك مالا فليقولن بلى‏.‏ ثم ليقولن ألم أرسل إليك رسولا فليقولن بلى‏.‏ فينظر عن يمينه فلا يرى إلا النار، ثم ينظر عن شماله فلا يرى إلا النار، فليتقين أحدكم النار ولو بشق تمرة، فإن لم يجد فبكلمة طيبة ‏\"‏‏.‏",
      "text_en": " Narrated `Adi bin Hatim:                     While I was sitting with Allah's Apostle (p.b.u.h) two person came to him; one of them complained about his poverty and the other complained about the prevalence of robberies. Allah's Apostle said, \"As regards stealing and robberies, there will shortly come a time when a caravan will go to Mecca (from Medina) without any guard. And regarding poverty, The Hour (Day of Judgment) will not be established till one of you wanders about with his object of charity and will not find anybody to accept it And (no doubt) each one of you will stand in front of Allah and there will be neither a curtain nor an interpreter between him and Allah, and Allah will ask him, 'Did not I give you wealth?' He will reply in the affirmative. Allah will further ask, 'Didn't send a messenger to you?' And again that person will reply in the affirmative Then he will look to his right and he will see nothing but Hell-fire, and then he will look to his left and will see nothing but Hell-fire. And so, any (each one) of you should save himself from the fire even by giving half of a date-fruit (in charity). And if you do not find a hall datefruit, then (you can do it through saying) a good pleasant word (to your brethren). (See Hadith No. 793 Vol. 4).",
      "chain": [
        "30351",
        "20241",
        "11651",
        "212"
      ]
    },
    {
      "hadith_no": "1458",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا هشام، حدثنا معمر، عن الزهري، عن عروة، عن حكيم بن حزام  رضى الله عنه  قال قلت يا رسول الله أرأيت أشياء كنت أتحنث بها في الجاهلية من صدقة أو عتاقة وصلة رحم فهل فيها من أجر فقال النبي صلى الله عليه وسلم ‏\"‏ أسلمت على ما سلف من خير ‏\"‏‏.‏",
      "text_en": " Narrated Hakim bin Hizam:                     I said to Allah's Apostle, \"Before embracing Islam I used to do good deeds like giving in charity, slave-manumitting, and the keeping of good relations with Kith and kin. Shall I be rewarded for those deeds?\" The Prophet replied, \"You became Muslim with all those good deeds (Without losing their reward).\"",
      "chain": [
        "30351",
        "20295",
        "20115",
        "11013",
        "10511",
        "423"
      ]
    },
    {
      "hadith_no": "1568",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا وهب بن جرير، حدثنا أبي، عن يونس الأيلي، عن الزهري، عن عبيد الله بن عبد الله، عن ابن عباس  رضى الله عنهما  أن أسامة  رضى الله عنه  كان ردف النبي صلى الله عليه وسلم من عرفة إلى المزدلفة، ثم أردف الفضل من المزدلفة إلى منى‏.‏ قال فكلاهما قال لم يزل النبي صلى الله عليه وسلم يلبي، حتى رمى جمرة العقبة‏.‏",
      "text_en": " Narrated 'Ubaidullah bin `Abdullah:                     Ibn `Abbas' said, \"Usama rode behind Allah's Apostle from `Arafat to Al-Muzdalifa; and then Al-Fadl rode behind Allah's Apostle from Al-Muzdalifa to Mina.\" Ibn `Abbas added, \"Both of them said, 'The Prophet kept on reciting Talbiya till he did the Rami of Jamrat-Al-`Aqaba.' \"",
      "chain": [
        "30351",
        "20298",
        "11272",
        "20475",
        "11013",
        "11004",
        "17"
      ]
    },
    {
      "hadith_no": "1570",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثني عبد الله بن محمد، حدثنا هشام بن يوسف، أخبرنا ابن جريج، حدثنا محمد بن المنكدر، عن أنس بن مالك  رضى الله عنه  قال صلى النبي صلى الله عليه وسلم بالمدينة أربعا، وبذي الحليفة ركعتين، ثم بات حتى أصبح بذي الحليفة، فلما ركب راحلته واستوت به أهل‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet offered four rak`at in Medina and then two rak`at at Dhul Hulaifa and then passed the night at Dhul-Hulaifa till it was morning and when he mounted his Mount and it stood up, he started to recite Talbiya.",
      "chain": [
        "30351",
        "20467",
        "11070",
        "11048",
        "19"
      ]
    },
    {
      "hadith_no": "1607",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا أبو عاصم، قال أخبرني ابن جريج، قال أخبرني عمرو بن دينار، قال سمعت جابر بن عبد الله  رضى الله عنهما  قال لما بنيت الكعبة ذهب النبي صلى الله عليه وسلم وعباس ينقلان الحجارة فقال العباس للنبي صلى الله عليه وسلم اجعل إزارك على رقبتك‏.‏ فخر إلى الأرض، وطمحت عيناه إلى السماء فقال ‏\"‏ أرني إزاري ‏\"‏‏.‏ فشده عليه‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     When the Ka`ba was built, the Prophet and `Abbas went to bring stones (for its construction). Al `Abbas said to the Prophet, \"Take off your waist sheet and put it on your neck.\" (When the Prophet took it off) he fell on the ground with his eyes open towards the sky and said, \"Give me my waist sheet.\" And he covered himself with it.",
      "chain": [
        "30351",
        "20241",
        "11070",
        "11081",
        "34"
      ]
    },
    {
      "hadith_no": "1679",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثني عبد الله بن محمد، حدثنا إسحاق الأزرق، حدثنا سفيان، عن عبد العزيز بن رفيع، قال سألت أنس بن مالك  رضى الله عنه  قلت أخبرني بشىء، عقلته عن النبي صلى الله عليه وسلم أين صلى الظهر والعصر يوم التروية قال بمنى‏.‏ قلت فأين صلى العصر يوم النفر قال بالأبطح‏.‏ ثم قال افعل كما يفعل أمراؤك‏.‏",
      "text_en": " Narrated `Abdul `Aziz bin Rufai:                     I asked Anas bin Malik, \"Tell me what you remember from Allah's Apostle (regarding these questions): Where did he offer the Zuhr and `Asr prayers on the day of Tarwiya (8th day of Dhul- Hijja)?\" He relied, \"(He offered these prayers) at Mina.\" I asked, \"Where did he offer the `Asr prayer on the day of Nafr (i.e. departure from Mina on the 12th or 13th of Dhul-Hijja)?\" He replied, \"At Al- Abtah,\" and then added, \"You should do as your chiefs do.\"",
      "chain": [
        "30351",
        "20411",
        "20012",
        "11257",
        "19"
      ]
    },
    {
      "hadith_no": "1768",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثني عبد الله بن محمد، حدثنا أبو عامر، حدثنا قرة، عن محمد بن سيرين، قال أخبرني عبد الرحمن بن أبي بكرة، عن أبي بكرة،، ورجل، أفضل في نفسي من عبد الرحمن حميد بن عبد الرحمن عن أبي بكرة  رضى الله عنه  قال خطبنا النبي صلى الله عليه وسلم يوم النحر، قال ‏\"‏ أتدرون أى يوم هذا ‏\"‏‏.‏ قلنا الله ورسوله أعلم‏.‏ فسكت حتى ظننا أنه سيسميه بغير اسمه‏.‏ قال ‏\"‏ أليس يوم النحر ‏\"‏‏.‏ قلنا بلى‏.‏ قال ‏\"‏ أى شهر هذا ‏\"‏‏.‏ قلنا الله ورسوله أعلم‏.‏ فسكت حتى ظننا أنه سيسميه بغير اسمه‏.‏ فقال ‏\"‏ أليس ذو الحجة ‏\"‏‏.‏ قلنا بلى‏.‏ قال ‏\"‏ أى بلد هذا ‏\"‏‏.‏ قلنا الله ورسوله أعلم‏.‏ فسكت حتى ظننا أنه سيسميه بغير اسمه‏.‏ قال ‏\"‏ أليست بالبلدة الحرام ‏\"‏‏.‏ قلنا بلى‏.‏ قال ‏\"‏ فإن دماءكم وأموالكم عليكم حرام، كحرمة يومكم هذا، في شهركم هذا، في بلدكم هذا، إلى يوم تلقون ربكم‏.‏ ألا هل بلغت ‏\"‏‏.‏ قالوا نعم‏.‏ قال ‏\"‏ اللهم اشهد، فليبلغ الشاهد الغائب، فرب مبلغ أوعى من سامع، فلا ترجعوا بعدي كفارا يضرب بعضكم رقاب بعض ‏\"‏‏.‏",
      "text_en": " Narrated Abu Bakra:                     The Prophet delivered to us a sermon on the Day of Nahr. He said, \"Do you know what is the day today?\" We said, \"Allah and His Apostle know better.\" He remained silent till we thought that he might give that day another name. He said, \"Isn't it the Day of Nahr?\" We said, \"It is.\" He further asked, \"Which month is this?\" We said, \"Allah and His Apostle know better.\" He remained silent till we thought that he might give it another name. He then said, \"Isn't it the month of Dhul-Hijja?\" We replied: \"Yes! It is.\" He further asked, \"What town is this?\" We replied, \"Allah and His Apostle know it better.\" He remained silent till we thought that he might give it another name. He then said, \"Isn't it the forbidden (Sacred) town (of Mecca)?\" We said, \"Yes. It is.\" He said, \"No doubt, your blood and your properties are sacred to one another like the sanctity of this day of yours, in this month of yours, in this town of yours, till the day you meet your Lord. No doubt! Haven't I conveyed Allah's message to you? They said, \"Yes.\" He said, \"O Allah! Be witness. So it is incumbent upon those who are present to convey it (this information) to those who are absent because the informed one might comprehend it (what I have said) better than the present audience, who will convey it to him. Beware! Do not renegade (as) disbelievers after me by striking the necks (cutting the throats) of one another.\"",
      "chain": [
        "30351",
        "20443",
        "11301",
        "11035",
        "11294",
        "3229"
      ]
    },
    {
      "hadith_no": "1854",
      "source": " Sahih Bukhari ",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا سفيان، حدثنا صالح بن كيسان، عن أبي محمد، نافع مولى أبي قتادة سمع أبا قتادة  رضى الله عنه  قال كنا مع النبي صلى الله عليه وسلم بالقاحة من المدينة على ثلاث ح‏.‏ وحدثنا علي بن عبد الله حدثنا سفيان حدثنا صالح بن كيسان عن أبي محمد عن أبي قتادة  رضى الله عنه  قال كنا مع النبي صلى الله عليه وسلم بالقاحة، ومنا المحرم، ومنا غير المحرم، فرأيت أصحابي يتراءون شيئا فنظرت، فإذا حمار وحش  يعني وقع سوطه  فقالوا لا نعينك عليه بشىء، إنا محرمون‏.‏ فتناولته فأخذته، ثم أتيت الحمار من وراء أكمة، فعقرته، فأتيت به أصحابي، فقال بعضهم كلوا‏.‏ وقال بعضهم لا تأكلوا‏.‏ فأتيت النبي صلى الله عليه وسلم وهو أمامنا، فسألته فقال ‏\"‏ كلوه حلال ‏\"‏‏.‏ قال لنا عمرو اذهبوا إلى صالح فسلوه عن هذا وغيره، وقدم علينا ها هنا‏.‏",
      "text_en": " Narrated Abu Qatada:                     We were in the company of the Prophet at a place called Al-Qaha (which is at a distance of three stages of journey from Medina). Abu Qatada narrated through another group of narrators: We were in the company of the Prophet at a place called Al-Qaha and some of us had assumed Ihram while the others had not. I noticed that some of my companions were watching something, so I looked up and saw an onager. (I rode my horse and took the spear and whip) but my whip fell down (and I asked them to pick it up for me) but they said, \"We will not help you by any means as we are in a state of Ihram.\" So, I picked up the whip myself and attacked the onager from behind a hillock and slaughtered it and brought it to my companions. Some of them said, \"Eat it.\" While some others said, \"Do not eat it.\" So, I went to the Prophet who was ahead of us and asked him about it, He replied, \"Eat it as it is Halal (i.e. it is legal to eat it).",
      "chain": [
        "30351",
        "20005",
        "11176",
        "11224",
        "391"
      ]
    },
    {
      "hadith_no": "1918",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of Madinah - كتاب فضائل المدينة",
      "chapter_no": "29",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا وهب بن جرير، حدثنا أبي، سمعت يونس، عن ابن شهاب، عن أنس  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ اللهم اجعل بالمدينة ضعفى ما جعلت بمكة من البركة ‏\"‏‏.‏ تابعه عثمان بن عمر عن يونس‏.‏",
      "text_en": " Narrated Anas:                     The Prophet said, \"O Allah! Bestow on Medina twice the blessings You bestowed on Mecca.\"",
      "chain": [
        "30351",
        "20298",
        "11272",
        "20475",
        "11013",
        "19"
      ]
    },
    {
      "hadith_no": "2046",
      "source": " Sahih Bukhari ",
      "chapter": "Retiring to a Mosque for Remembrance of Allah (I'tikaf) - كتاب الاعتكاف",
      "chapter_no": "33",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا هشام، أخبرنا معمر، عن الزهري، عن عروة، عن عائشة  رضى الله عنها  أنها كانت ترجل النبي صلى الله عليه وسلم وهي حائض وهو معتكف في المسجد وهى في حجرتها، يناولها رأسه‏.‏",
      "text_en": " Narrated `Urwa:                     Aisha during her menses used to comb and oil the hair of the Prophet while he used to be in I`tikaf in the mosque. He would stretch out his head towards her while she was in her chamber.",
      "chain": [
        "30351",
        "20295",
        "20115",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2050",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا سفيان، عن عمرو، عن ابن عباس  رضى الله عنهما  قال كانت عكاظ ومجنة وذو المجاز أسواقا في الجاهلية، فلما كان الإسلام فكأنهم تأثموا فيه فنزلت ‏{‏ليس عليكم جناح أن تبتغوا فضلا من ربكم ‏}‏ في مواسم الحج، قرأها ابن عباس‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     `Ukaz, Majanna and Dhul-Majaz were marketplaces in the Pre-Islamic period of ignorance. When Islam came, Muslims felt that marketing there might be a sin. So, the Divine Inspiration came: \"There is no harm for you to seek the bounty of your Lord (in the seasons of Hajj).\" (2.198) Ibn `Abbas recited the Verse in this way.",
      "chain": [
        "30351",
        "20005",
        "11081",
        "17"
      ]
    },
    {
      "hadith_no": "2348",
      "source": " Sahih Bukhari ",
      "chapter": "Agriculture - كتاب المزارعة",
      "chapter_no": "41",
      "text_ar": "حدثنا محمد بن سنان، حدثنا فليح، حدثنا هلال، وحدثنا عبد الله بن محمد، حدثنا أبو عامر، حدثنا فليح، عن هلال بن علي، عن عطاء بن يسار، عن أبي هريرة  رضى الله عنه  أن النبي صلى الله عليه وسلم كان يوما يحدث وعنده رجل من أهل البادية ‏\"‏ أن رجلا من أهل الجنة استأذن ربه في الزرع فقال له ألست فيما شئت قال بلى ولكني أحب أن أزرع‏.‏ قال فبذر فبادر الطرف نباته واستواؤه واستحصاده، فكان أمثال الجبال فيقول الله دونك يا ابن آدم، فإنه لا يشبعك شىء ‏\"‏‏.‏ فقال الأعرابي والله لا تجده إلا قرشيا أو أنصاريا، فإنهم أصحاب زرع، وأما نحن فلسنا بأصحاب زرع‏.‏ فضحك النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Abu Huraira:                     Once the Prophet was narrating (a story), while a bedouin was sitting with him. \"One of the inhabitants of Paradise will ask Allah to allow him to cultivate the land. Allah will ask him, 'Are you not living in the pleasures you like?' He will say, 'Yes, but I like to cultivate the land.' \" The Prophet added, \"When the man (will be permitted he) will sow the seeds and the plants will grow up and get ripe, ready for reaping and so on till it will be as huge as mountains within a wink. Allah will then say to him, 'O son of Adam! Take here you are, gather (the yield); nothing satisfies you.' \" On that, the bedouin said, \"The man must be either from Quraish (i.e. an emigrant) or an Ansari, for they are farmers, whereas we are not farmers.\" The Prophet smiled (at this).",
      "chain": [
        "34207",
        "20169",
        "11229",
        "30351",
        "20443",
        "20169",
        "11229",
        "11020",
        "13"
      ]
    },
    {
      "hadith_no": "2368",
      "source": " Sahih Bukhari ",
      "chapter": "Distribution of Water - كتاب المساقاة",
      "chapter_no": "42",
      "text_ar": "حدثنا عبد الله بن محمد، أخبرنا عبد الرزاق، أخبرنا معمر، عن أيوب، وكثير بن كثير  يزيد أحدهما على الآخر  عن سعيد بن جبير، قال قال ابن عباس  رضى الله عنهما  قال النبي صلى الله عليه وسلم ‏\"‏ يرحم الله أم إسماعيل، لو تركت زمزم  أو قال لو لم تغرف من الماء  لكانت عينا معينا، وأقبل جرهم فقالوا أتأذنين أن ننزل عندك قالت نعم ولا حق لكم في الماء‏.‏ قالوا نعم ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet said, \"May Allah be merciful to the mother of Ishmael! If she had left the water of Zamzam (fountain) as it was, (without constructing a basin for keeping the water), (or said, \"If she had not taken handfuls of its water\"), it would have been a flowing stream. Jurhum (an Arab tribe) came and asked her, 'May we settle at your dwelling?' She said, 'Yes, but you have no right to possess the water.' They agreed.\"",
      "chain": [
        "30351",
        "20121",
        "20115",
        "11015",
        "11563",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "2369",
      "source": " Sahih Bukhari ",
      "chapter": "Distribution of Water - كتاب المساقاة",
      "chapter_no": "42",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا سفيان، عن عمرو، عن أبي صالح السمان، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ ثلاثة لا يكلمهم الله يوم القيامة، ولا ينظر إليهم رجل حلف على سلعة لقد أعطى بها أكثر مما أعطى وهو كاذب، ورجل حلف على يمين كاذبة بعد العصر ليقتطع بها مال رجل مسلم، ورجل منع فضل ماء، فيقول الله اليوم أمنعك فضلي، كما منعت فضل ما لم تعمل يداك ‏\"‏‏.‏ قال علي حدثنا سفيان غير مرة عن عمرو سمع أبا صالح يبلغ به النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"There are three types of people whom Allah will neither talk to, nor look at, on the Day of Resurrection. (They are): -1. A man who takes an oath falsely that he has been offered for his goods so much more than what he is given, -2. a man who takes a false oath after the `Asr prayer in order to grab a Muslim's property, and -3. a man who withholds his superfluous water. Allah will say to him, \"Today I will withhold My Grace from you as you withheld the superfluity of what you had not created.\"",
      "chain": [
        "30351",
        "20005",
        "11081",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "2381",
      "source": " Sahih Bukhari ",
      "chapter": "Distribution of Water - كتاب المساقاة",
      "chapter_no": "42",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا ابن عيينة، عن ابن جريج، عن عطاء، سمع جابر بن عبد الله  رضى الله عنهما  نهى النبي صلى الله عليه وسلم عن المخابرة، والمحاقلة، وعن المزابنة، وعن بيع الثمر حتى يبدو صلاحها، وأن لا تباع إلا بالدينار والدرهم، إلا العرايا‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     The Prophet forbade the sales called Al-Mukhabara, Al-Muhaqala and Al-Muzabana and the selling of fruits till they are free from blights. He forbade the selling of the fruits except for money, except the 'Araya.",
      "chain": [
        "30351",
        "20005",
        "11070",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "2399",
      "source": " Sahih Bukhari ",
      "chapter": "Loans; Payment of Loans; Freezing of Property; Bankruptcy - كتاب فى الاستقراض",
      "chapter_no": "43",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا أبو عامر، حدثنا فليح، عن هلال بن علي، عن عبد الرحمن بن أبي عمرة، عن أبي هريرة  رضى الله عنه  أن النبي صلى الله عليه وسلم قال ‏\"‏ ما من مؤمن إلا وأنا أولى به في الدنيا والآخرة اقرءوا إن شئتم ‏{‏النبي أولى بالمؤمنين من أنفسهم‏}‏ فأيما مؤمن مات وترك مالا فليرثه عصبته من كانوا، ومن ترك دينا أو ضياعا فليأتني فأنا مولاه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"I am closer to the believers than their selves in this world and in the Hereafter, and if you like, you can read Allah's Statement: \"The Prophet is closer to the believers than their own selves.\" (33.6) So, if a true believer dies and leaves behind some property, it will be for his inheritors (from the father's side), and if he leaves behind some debt to be paid or needy offspring, then they should come to me as I am the guardian of the deceased.\"",
      "chain": [
        "30351",
        "20443",
        "20169",
        "11229",
        "1238",
        "13"
      ]
    },
    {
      "hadith_no": "2418",
      "source": " Sahih Bukhari ",
      "chapter": "Khusoomaat - كتاب الخصومات",
      "chapter_no": "44",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا عثمان بن عمر، أخبرنا يونس، عن الزهري، عن عبد الله بن كعب بن مالك، عن كعب  رضى الله عنه  أنه تقاضى ابن أبي حدرد دينا كان له عليه في المسجد، فارتفعت أصواتهما حتى سمعها رسول الله صلى الله عليه وسلم وهو في بيته، فخرج إليهما، حتى كشف سجف حجرته فنادى ‏\"‏ يا كعب ‏\"‏‏.‏ قال لبيك يا رسول الله‏.‏ قال ‏\"‏ ضع من دينك هذا ‏\"‏‏.‏ فأومأ إليه، أى الشطر‏.‏ قال لقد فعلت يا رسول الله‏.‏ قال ‏\"‏ قم فاقضه ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Ka`b bin Malik:                     Ka`b demanded his debt back from Ibn Abi Hadrad in the Mosque and their voices grew louder till Allah's Apostle heard them while he was in his house. He came out to them raising the curtain of his room and addressed Ka`b, \"O Ka`b!\" Ka`b replied, \"Labaik, O Allah's Apostle.\" (He said to him), \"Reduce your debt to one half,\" gesturing with his hand. Ka`b said, \"I have done so, O Allah's Apostle!\" On that the Prophet said to Ibn Abi Hadrad, \"Get up and repay the debt, to him.\"",
      "chain": [
        "30351",
        "20262",
        "20475",
        "11013",
        "1131"
      ]
    },
    {
      "hadith_no": "2421",
      "source": " Sahih Bukhari ",
      "chapter": "Khusoomaat - كتاب الخصومات",
      "chapter_no": "44",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا سفيان، عن الزهري، عن عروة، عن عائشة  رضى الله عنها  أن عبد بن زمعة، وسعد بن أبي وقاص، اختصما إلى النبي صلى الله عليه وسلم في ابن أمة زمعة فقال سعد يا رسول الله أوصاني أخي إذا قدمت أن أنظر ابن أمة زمعة فأقبضه، فإنه ابني‏.‏ وقال عبد بن زمعة أخي وابن أمة أبي، ولد على فراش أبي‏.‏ فرأى النبي صلى الله عليه وسلم شبها بينا فقال ‏\"‏ هو لك يا عبد بن زمعة، الولد للفراش، واحتجبي منه يا سودة ‏\"‏‏.‏",
      "text_en": " Narrated Aisha:                     Abu bin Zam`a and Sa`d bin Abi Waqqas carried the case of their claim of the (ownership) of the son of a slave-girl of Zam`a before the Prophet. Sa`d said, \"O Allah's Apostle! My brother, before his death, told me that when I would return (to Mecca), I should search for the son of the slave-girl of Zam`a and take him into my custody as he was his son.\" 'Abu bin Zam`a said, 'the is my brother and the son of the slave-girl of my father, and was born or my father's bed.\" The Prophet noticed a resemblance between `Utba and the boy but he said, \"O 'Abu bin Zam`a! You will get this boy, as the son goes to the owner of the bed. You, Sauda, screen yourself from the boy.\"",
      "chain": [
        "30351",
        "20005",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2467",
      "source": " Sahih Bukhari ",
      "chapter": "Oppressions - كتاب المظالم",
      "chapter_no": "46",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا ابن عيينة، عن الزهري، عن عروة، عن أسامة بن زيد  رضى الله عنهما  قال أشرف النبي صلى الله عليه وسلم على أطم من آطام المدينة ثم قال ‏\"‏ هل ترون ما أرى إني أرى مواقع الفتن خلال بيوتكم كمواقع القطر ‏\"‏‏.‏",
      "text_en": " Narrated Usama bin Zaid:                     Once the Prophet stood at the top of one of the castles (or higher buildings) of Medina and said, \"Do you see what I see? No doubt I am seeing the spots of afflictions amongst your houses as numerous as the spots where raindrops fall (during a heavy rain). (See Hadith No. 102)",
      "chain": [
        "30351",
        "20005",
        "11013",
        "10511",
        "50"
      ]
    },
    {
      "hadith_no": "2495",
      "source": " Sahih Bukhari ",
      "chapter": "Partnership - كتاب الشركة",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا هشام، أخبرنا معمر، عن الزهري، عن أبي سلمة، عن جابر بن عبد الله  رضى الله عنهما  قال إنما جعل النبي صلى الله عليه وسلم الشفعة في كل ما لم يقسم، فإذا وقعت الحدود وصرفت الطرق فلا شفعة‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     The Prophet established the right of Shu'fa (i.e. Preemption) in joint properties; but when the land is divided and the ways are demarcated, then there is no pre-emption.",
      "chain": [
        "30351",
        "20295",
        "20115",
        "11013",
        "10567",
        "34"
      ]
    },
    {
      "hadith_no": "2597",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا سفيان، عن الزهري، عن عروة بن الزبير، عن أبي حميد الساعدي  رضى الله عنه  قال استعمل النبي صلى الله عليه وسلم رجلا من الأزد يقال له ابن اللتبية على الصدقة، فلما قدم قال هذا لكم، وهذا أهدي لي‏.‏ قال ‏\"‏ فهلا جلس في بيت أبيه أو بيت أمه، فينظر يهدى له أم لا والذي نفسي بيده لا يأخذ أحد منه شيئا إلا جاء به يوم القيامة يحمله على رقبته، إن كان بعيرا له رغاء أو بقرة لها خوار أو شاة تيعر  ثم رفع بيده، حتى رأينا عفرة إبطيه  اللهم هل بلغت اللهم هل بلغت ثلاثا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Humaid Al-Sa`idi:                     The Prophet appointed a man from the tribe of Al-Azd, called Ibn 'Utbiyya for collecting the Zakat. When he returned he said, \"This (i.e. the Zakat) is for you and this has been given to my as a present.\" The Prophet said, \"Why hadn't he stayed in his father's or mother's house to see whether he would be given presents or not? By Him in Whose Hands my life is, whoever takes something from the resources of the Zakat (unlawfully) will be carrying it on his neck on the Day of Resurrection; if it be a camel, it will be grunting; if a cow, it will be mooing; and if a sheep, it will be bleating.\" The Prophet then raised his hands till we saw the whiteness of his armpits, and he said thrice, \"O Allah! Haven't I conveyed Your Message (to them)?\"",
      "chain": [
        "30351",
        "20005",
        "11013",
        "10511",
        "1457"
      ]
    },
    {
      "hadith_no": "2610",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا ابن عيينة، عن عمرو، عن ابن عمر  رضى الله عنهما  أنه كان مع النبي صلى الله عليه وسلم في سفر فكان على بكر لعمر صعب، فكان يتقدم النبي صلى الله عليه وسلم فيقول أبوه يا عبد الله لا يتقدم النبي صلى الله عليه وسلم أحد‏.‏ فقال له النبي صلى الله عليه وسلم ‏\"‏ بعنيه ‏\"‏‏.‏ فقال عمر هو لك‏.‏ فاشتراه ثم قال ‏\"‏ هو لك يا عبد الله، فاصنع به ما شئت ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     That he was in the company of the Prophet on a journey, riding a troublesome camel belonging to `Umar. The camel used to go ahead of the Prophet, so Ibn `Umar's father would say, \"O `Abdullah! No one should go ahead of the Prophet.\" The Prophet said to him, \"Sell it to me.\" `Umar said to the Prophet \"It is for you.\" So, he bought it and said, \"O `Abdullah! It is for you, and you can do with it what you like.\"",
      "chain": [
        "30351",
        "20005",
        "11081",
        "18"
      ]
    },
    {
      "hadith_no": "2615",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا يونس بن محمد، حدثنا شيبان، عن قتادة، حدثنا أنس  رضى الله عنه  قال أهدي للنبي صلى الله عليه وسلم جبة سندس، وكان ينهى عن الحرير، فعجب الناس منها فقال ‏\"‏ والذي نفس محمد بيده لمناديل سعد بن معاذ في الجنة أحسن من هذا ‏\"‏‏.‏ وقال سعيد عن قتادة، عن أنس، إن أكيدر دومة أهدى إلى النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Anas:                     A Jubba (i.e. cloak) made of thick silken cloth was presented to the Prophet. The Prophet used to forbid people to wear silk. So, the people were pleased to see it. The Prophet said, \"By Him in Whose Hands Muhammad's soul is, the handkerchiefs of Sa`d bin Mu`adh in Paradise are better than this.\" Anas added, \"The present was sent to the Prophet by Ukaidir (a Christian) from Dauma.\"",
      "chain": [
        "30351",
        "20393",
        "20240",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "2639",
      "source": " Sahih Bukhari ",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا سفيان، عن الزهري، عن عروة، عن عائشة  رضى الله عنها  جاءت امرأة رفاعة القرظي النبي صلى الله عليه وسلم فقالت كنت عند رفاعة فطلقني فأبت طلاقي، فتزوجت عبد الرحمن بن الزبير، إنما معه مثل هدبة الثوب‏.‏ فقال ‏\"‏ أتريدين أن ترجعي إلى رفاعة لا حتى تذوقي عسيلته ويذوق عسيلتك ‏\"‏‏.‏ وأبو بكر جالس عنده وخالد بن سعيد بن العاص بالباب ينتظر أن يؤذن له، فقال يا أبا بكر، ألا تسمع إلى هذه ما تجهر به عند النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Aisha:                     The wife of Rifa`a Al-Qurazi came to the Prophet and said, \"I was Rifa`a's wife, but he divorced me and it was a final irrevocable divorce. Then I married `Abdur-Rahman bin Az-Zubair but he is impotent.\" The Prophet asked her 'Do you want to remarry Rifa`a? You cannot unless you had a complete sexual relation with your present husband.\" Abu Bakr was sitting with Allah's Apostle and Khalid bin Sa`id bin Al-`As was at the door waiting to be admitted. He said, \"O Abu Bakr! Do you hear what this (woman) is revealing frankly before the Prophet ?\"",
      "chain": [
        "30351",
        "20005",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2704",
      "source": " Sahih Bukhari ",
      "chapter": "Peacemaking - كتاب الصلح",
      "chapter_no": "53",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا سفيان، عن أبي موسى، قال سمعت الحسن، يقول استقبل والله الحسن بن علي معاوية بكتائب أمثال الجبال فقال عمرو بن العاص إني لأرى كتائب لا تولي حتى تقتل أقرانها‏.‏ فقال له معاوية  وكان والله خير الرجلين  أى عمرو إن قتل هؤلاء هؤلاء وهؤلاء هؤلاء من لي بأمور الناس من لي بنسائهم، من لي بضيعتهم فبعث إليه رجلين من قريش من بني عبد شمس عبد الرحمن بن سمرة وعبد الله بن عامر بن كريز، فقال اذهبا إلى هذا الرجل فاعرضا عليه، وقولا له، واطلبا إليه‏.‏ فأتياه، فدخلا عليه فتكلما، وقالا له، فطلبا إليه، فقال لهما الحسن بن علي إنا بنو عبد المطلب، قد أصبنا من هذا المال، وإن هذه الأمة قد عاثت في دمائها‏.‏ قالا فإنه يعرض عليك كذا وكذا ويطلب إليك ويسألك‏.‏ قال فمن لي بهذا قالا نحن لك به‏.‏ فما سألهما شيئا إلا قالا نحن لك به‏.‏ فصالحه، فقال الحسن ولقد سمعت أبا بكرة يقول رأيت رسول الله صلى الله عليه وسلم على المنبر والحسن بن علي إلى جنبه، وهو يقبل على الناس مرة وعليه أخرى ويقول ‏\"‏ إن ابني هذا سيد، ولعل الله أن يصلح به بين فئتين عظيمتين من المسلمين ‏\"‏‏.‏ قال لي علي بن عبد الله إنما ثبت لنا سماع الحسن من أبي بكرة بهذا الحديث‏.‏",
      "text_en": " Narrated Al-Hasan Al-Basri:                     By Allah, Al-Hasan bin `Ali led large battalions like mountains against Muawiya. `Amr bin Al-As said (to Muawiya), \"I surely see battalions which will not turn back before killing their opponents.\" Muawiya who was really the best of the two men said to him, \"O `Amr! If these killed those and those killed these, who would be left with me for the jobs of the public, who would be left with me for their women, who would be left with me for their children?\" Then Muawiya sent two Quraishi men from the tribe of `Abd-i-Shams called `Abdur Rahman bin Sumura and `Abdullah bin 'Amir bin Kuraiz to Al-Hasan saying to them, \"Go to this man (i.e. Al-Hasan) and negotiate peace with him and talk and appeal to him.\" So, they went to Al-Hasan and talked and appealed to him to accept peace. Al-Hasan said, \"We, the offspring of `Abdul Muttalib, have got wealth and people have indulged in killing and corruption (and money only will appease them).\" They said to Al-Hasan, \"Muawiya offers you so and so, and appeals to you and entreats you to accept peace.\" Al-Hasan said to them, \"But who will be responsible for what you have said?\" They said, \"We will be responsible for it.\" So, whatever Al- Hasan asked they said, \"We will be responsible for it for you.\" So, Al-Hasan concluded a peace treaty with Muawiya. Al-Hasan (Al-Basri) said: I heard Abu Bakr saying, \"I saw Allah's Apostle on the pulpit and Al-Hasan bin `Ali was by his side. The Prophet was looking once at the people and once at Al-Hasan bin `Ali saying, 'This son of mine is a Saiyid (i.e. a noble) and may Allah make peace between two big groups of Muslims through him.\"",
      "chain": [
        "30351",
        "20005",
        "30170",
        "11016"
      ]
    },
    {
      "hadith_no": "2710",
      "source": " Sahih Bukhari ",
      "chapter": "Peacemaking - كتاب الصلح",
      "chapter_no": "53",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا عثمان بن عمر، أخبرنا يونس،‏.‏ وقال الليث حدثني يونس، عن ابن شهاب، أخبرني عبد الله بن كعب، أن كعب بن مالك، أخبره أنه، تقاضى ابن أبي حدرد دينا كان له عليه في عهد رسول الله صلى الله عليه وسلم في المسجد، فارتفعت أصواتهما حتى سمعها رسول الله صلى الله عليه وسلم وهو في بيت، فخرج رسول الله صلى الله عليه وسلم إليهما حتى كشف سجف حجرته، فنادى كعب بن مالك فقال ‏\"‏ يا كعب ‏\"‏‏.‏ فقال لبيك يا رسول الله‏.‏ فأشار بيده أن ضع الشطر‏.‏ فقال كعب قد فعلت يا رسول الله‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ قم فاقضه ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Ka`b:                     That Ka`b bin Malik told him that in the lifetime of Allah's Apostle he demanded his debt from Ibn Abu Hadrad in the Mosque. Their voices grew louder till Allah's Apostle heard them while he was in his house. So he lifted the curtain of his room and called Ka`b bin Malik saying, \"O Ka`b!\" He replied, \"Labbaik! O Allah's Apostle!\" He beckoned to him with his hand suggesting that he deduct half the debt. Ka`b said, \"I agree, O Allah's Apostle!\" Allah's Apostle then said (to Ibn Abu Hadrad), \"Get up and pay him the rest.\"",
      "chain": [
        "30351",
        "20262",
        "20023",
        "20475",
        "11013",
        "1131",
        "390"
      ]
    },
    {
      "hadith_no": "2732",
      "source": " Sahih Bukhari ",
      "chapter": "Conditions - كتاب الشروط",
      "chapter_no": "54",
      "text_ar": "حدثني عبد الله بن محمد، حدثنا عبد الرزاق، أخبرنا معمر، قال أخبرني الزهري، قال أخبرني عروة بن الزبير، عن المسور بن مخرمة، ومروان، يصدق كل واحد منهما حديث صاحبه قال خرج رسول الله صلى الله عليه وسلم زمن الحديبية، حتى كانوا ببعض الطريق قال النبي صلى الله عليه وسلم ‏\"‏ إن خالد بن الوليد بالغميم في خيل لقريش طليعة فخذوا ذات اليمين ‏\"‏‏.‏ فوالله ما شعر بهم خالد حتى إذا هم بقترة الجيش، فانطلق يركض نذيرا لقريش، وسار النبي صلى الله عليه وسلم حتى إذا كان بالثنية التي يهبط عليهم منها، بركت به راحلته‏.‏ فقال الناس حل حل‏.‏ فألحت، فقالوا خلأت القصواء، خلأت القصواء‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ ما خلأت القصواء، وما ذاك لها بخلق، ولكن حبسها حابس الفيل، ثم قال والذي نفسي بيده لا يسألوني خطة يعظمون فيها حرمات الله إلا أعطيتهم إياها ‏\"‏‏.‏ ثم زجرها فوثبت، قال فعدل عنهم حتى نزل بأقصى الحديبية، على ثمد قليل الماء يتبرضه الناس تبرضا، فلم يلبثه الناس حتى نزحوه، وشكي إلى رسول الله صلى الله عليه وسلم العطش، فانتزع سهما من كنانته، ثم أمرهم أن يجعلوه فيه، فوالله ما زال يجيش لهم بالري حتى صدروا عنه، فبينما هم كذلك، إذ جاء بديل بن ورقاء الخزاعي في نفر من قومه من خزاعة، وكانوا عيبة نصح رسول الله صلى الله عليه وسلم من أهل تهامة، فقال إني تركت كعب بن لؤى وعامر بن لؤى نزلوا أعداد مياه الحديبية، ومعهم العوذ المطافيل، وهم مقاتلوك وصادوك عن البيت‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إنا لم نجئ لقتال أحد، ولكنا جئنا معتمرين، وإن قريشا قد نهكتهم الحرب، وأضرت بهم، فإن شاءوا ماددتهم مدة، ويخلوا بيني وبين الناس، فإن أظهر فإن شاءوا أن يدخلوا فيما دخل فيه الناس فعلوا، وإلا فقد جموا، وإن هم أبوا فوالذي نفسي بيده، لأقاتلنهم على أمري هذا حتى تنفرد سالفتي، ولينفذن الله أمره ‏\"‏‏.‏ فقال بديل سأبلغهم ما تقول‏.‏ قال فانطلق حتى أتى قريشا قال إنا قد جئناكم من هذا الرجل، وسمعناه يقول قولا، فإن شئتم أن نعرضه عليكم فعلنا، فقال سفهاؤهم لا حاجة لنا أن تخبرنا عنه بشىء‏.‏ وقال ذوو الرأى منهم هات ما سمعته يقول‏.‏ قال سمعته يقول كذا وكذا، فحدثهم بما قال النبي صلى الله عليه وسلم‏.‏ فقام عروة بن مسعود فقال أى قوم ألستم بالوالد قالوا بلى‏.‏ قال أولست بالولد قالوا بلى‏.‏ قال فهل تتهموني‏.‏ قالوا لا‏.‏ قال ألستم تعلمون أني استنفرت أهل عكاظ، فلما بلحوا على جئتكم بأهلي وولدي ومن أطاعني قالوا بلى‏.‏ قال فإن هذا قد عرض لكم خطة رشد، اقبلوها ودعوني آته‏.‏ قالوا ائته‏.‏ فأتاه فجعل يكلم النبي صلى الله عليه وسلم فقال النبي صلى الله عليه وسلم نحوا من قوله لبديل، فقال عروة عند ذلك أى محمد، أرأيت إن استأصلت أمر قومك هل سمعت بأحد من العرب اجتاح أهله قبلك وإن تكن الأخرى، فإني والله لأرى وجوها، وإني لأرى أوشابا من الناس خليقا أن يفروا ويدعوك‏.‏ فقال له أبو بكر امصص بظر اللات، أنحن نفر عنه وندعه فقال من ذا قالوا أبو بكر‏.‏ قال أما والذي نفسي بيده لولا يد كانت لك عندي لم أجزك بها لأجبتك‏.‏ قال وجعل يكلم النبي صلى الله عليه وسلم فكلما تكلم أخذ بلحيته، والمغيرة بن شعبة قائم على رأس النبي صلى الله عليه وسلم ومعه السيف وعليه المغفر، فكلما أهوى عروة بيده إلى لحية النبي صلى الله عليه وسلم ضرب يده بنعل السيف، وقال له أخر يدك عن لحية رسول الله صلى الله عليه وسلم‏.‏ فرفع عروة رأسه فقال من هذا قالوا المغيرة بن شعبة‏.‏ فقال أى غدر، ألست أسعى في غدرتك وكان المغيرة صحب قوما في الجاهلية، فقتلهم، وأخذ أموالهم، ثم جاء فأسلم فقال النبي صلى الله عليه وسلم ‏\"‏ أما الإسلام فأقبل، وأما المال فلست منه في شىء ‏\"‏‏.‏ ثم إن عروة جعل يرمق أصحاب النبي صلى الله عليه وسلم بعينيه‏.‏ قال فوالله ما تنخم رسول الله صلى الله عليه وسلم نخامة إلا وقعت في كف رجل منهم فدلك بها وجهه وجلده، وإذا أمرهم ابتدروا أمره، وإذا توضأ كادوا يقتتلون على وضوئه، وإذا تكلم خفضوا أصواتهم عنده، وما يحدون إليه النظر تعظيما له، فرجع عروة إلى أصحابه، فقال أى قوم، والله لقد وفدت على الملوك، ووفدت على قيصر وكسرى والنجاشي والله إن رأيت ملكا قط، يعظمه أصحابه ما يعظم أصحاب محمد صلى الله عليه وسلم محمدا، والله إن تنخم نخامة إلا وقعت في كف رجل منهم، فدلك بها وجهه وجلده، وإذا أمرهم ابتدروا أمره وإذا توضأ كادوا يقتتلون على وضوئه، وإذا تكلم خفضوا أصواتهم عنده، وما يحدون إليه النظر تعظيما له، وإنه قد عرض عليكم خطة رشد، فاقبلوها‏.‏ فقال رجل من بني كنانة دعوني آته‏.‏ فقالوا ائته‏.‏ فلما أشرف على النبي صلى الله عليه وسلم وأصحابه، قال رسول الله صلى الله عليه وسلم ‏\"‏ هذا فلان، وهو من قوم يعظمون البدن فابعثوها له ‏\"‏‏.‏ فبعثت له واستقبله الناس يلبون، فلما رأى ذلك قال سبحان الله ما ينبغي لهؤلاء أن يصدوا عن البيت، فلما رجع إلى أصحابه قال رأيت البدن قد قلدت وأشعرت، فما أرى أن يصدوا عن البيت‏.‏ فقام رجل منهم يقال له مكرز بن حفص‏.‏ فقال دعوني آته‏.‏ فقالوا ائته‏.‏ فلما أشرف عليهم قال النبي صلى الله عليه وسلم ‏\"‏ هذا مكرز وهو رجل فاجر ‏\"‏‏.‏ فجعل يكلم النبي صلى الله عليه وسلم، فبينما هو يكلمه إذ جاء سهيل بن عمرو‏.‏ قال معمر فأخبرني أيوب عن عكرمة، أنه لما جاء سهيل بن عمرو قال النبي صلى الله عليه وسلم ‏\"‏ لقد سهل لكم من أمركم ‏\"‏‏.‏ قال معمر قال الزهري في حديثه فجاء سهيل بن عمرو فقال هات، اكتب بيننا وبينكم كتابا، فدعا النبي صلى الله عليه وسلم الكاتب، فقال النبي صلى الله عليه وسلم ‏\"‏ بسم الله الرحمن الرحيم ‏\"‏‏.‏ قال سهيل أما الرحمن فوالله ما أدري ما هو ولكن اكتب باسمك اللهم‏.‏ كما كنت تكتب‏.‏ فقال المسلمون والله لا نكتبها إلا بسم الله الرحمن الرحيم‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ اكتب باسمك اللهم ‏\"‏‏.‏ ثم قال ‏\"‏ هذا ما قاضى عليه محمد رسول الله ‏\"‏‏.‏ فقال سهيل والله لو كنا نعلم أنك رسول الله ما صددناك عن البيت ولا قاتلناك، ولكن اكتب محمد بن عبد الله‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ والله إني لرسول الله وإن كذبتموني‏.‏ اكتب محمد بن عبد الله ‏\"‏‏.‏ قال الزهري وذلك لقوله ‏\"‏ لا يسألوني خطة يعظمون فيها حرمات الله إلا أعطيتهم إياها ‏\"‏‏.‏ فقال له النبي صلى الله عليه وسلم ‏\"‏ على أن تخلوا بيننا وبين البيت فنطوف به ‏\"‏‏.‏ فقال سهيل والله لا تتحدث العرب أنا أخذنا ضغطة ولكن ذلك من العام المقبل فكتب‏.‏ فقال سهيل وعلى أنه لا يأتيك منا رجل، وإن كان على دينك، إلا رددته إلينا‏.‏ قال المسلمون سبحان الله كيف يرد إلى المشركين وقد جاء مسلما فبينما هم كذلك إذ دخل أبو جندل بن سهيل بن عمرو يرسف في قيوده، وقد خرج من أسفل مكة، حتى رمى بنفسه بين أظهر المسلمين‏.‏ فقال سهيل هذا يا محمد أول ما أقاضيك عليه أن ترده إلى‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ إنا لم نقض الكتاب بعد ‏\"‏‏.‏ قال فوالله إذا لم أصالحك على شىء أبدا‏.‏ قال النبي صلى الله عليه وسلم ‏\"‏ فأجزه لي ‏\"‏‏.‏ قال ما أنا بمجيزه لك‏.‏ قال ‏\"‏ بلى، فافعل ‏\"‏‏.‏ قال ما أنا بفاعل‏.‏ قال مكرز بل قد أجزناه لك‏.‏ قال أبو جندل أى معشر المسلمين، أرد إلى المشركين وقد جئت مسلما ألا ترون ما قد لقيت وكان قد عذب عذابا شديدا في الله‏.‏ قال فقال عمر بن الخطاب فأتيت نبي الله صلى الله عليه وسلم فقلت ألست نبي الله حقا قال ‏\"‏ بلى ‏\"‏‏.‏ قلت ألسنا على الحق وعدونا على الباطل قال ‏\"‏ بلى ‏\"‏‏.‏ قلت فلم نعطي الدنية في ديننا إذا قال ‏\"‏ إني رسول الله، ولست أعصيه وهو ناصري ‏\"‏‏.‏ قلت أوليس كنت تحدثنا أنا سنأتي البيت فنطوف به قال ‏\"‏ بلى، فأخبرتك أنا نأتيه العام ‏\"‏‏.‏ قال قلت لا‏.‏ قال ‏\"‏ فإنك آتيه ومطوف به ‏\"‏‏.‏ قال فأتيت أبا بكر فقلت يا أبا بكر، أليس هذا نبي الله حقا قال بلى‏.‏ قلت ألسنا على الحق وعدونا على الباطل قال بلى‏.‏ قلت فلم نعطي الدنية في ديننا إذا قال أيها الرجل، إنه لرسول الله صلى الله عليه وسلم وليس يعصي ربه وهو ناصره، فاستمسك بغرزه، فوالله إنه على الحق‏.‏ قلت أليس كان يحدثنا أنا سنأتي البيت ونطوف به قال بلى، أفأخبرك أنك تأتيه العام قلت لا‏.‏ قال فإنك آتيه ومطوف به‏.‏ قال الزهري قال عمر فعملت لذلك أعمالا‏.‏ قال فلما فرغ من قضية الكتاب قال رسول الله صلى الله عليه وسلم لأصحابه ‏\"‏ قوموا فانحروا، ثم احلقوا ‏\"‏‏.‏ قال فوالله ما قام منهم رجل حتى قال ذلك ثلاث مرات، فلما لم يقم منهم أحد دخل على أم سلمة، فذكر لها ما لقي من الناس‏.‏ فقالت أم سلمة يا نبي الله، أتحب ذلك اخرج ثم لا تكلم أحدا منهم كلمة حتى تنحر بدنك، وتدعو حالقك فيحلقك‏.‏ فخرج فلم يكلم أحدا منهم، حتى فعل ذلك نحر بدنه، ودعا حالقه فحلقه‏.‏ فلما رأوا ذلك، قاموا فنحروا، وجعل بعضهم يحلق بعضا، حتى كاد بعضهم يقتل بعضا غما، ثم جاءه نسوة مؤمنات فأنزل الله تعالى ‏{‏يا أيها الذين آمنوا إذا جاءكم المؤمنات مهاجرات فامتحنوهن‏}‏ حتى بلغ ‏{‏بعصم الكوافر‏}‏ فطلق عمر يومئذ امرأتين كانتا له في الشرك، فتزوج إحداهما معاوية بن أبي سفيان، والأخرى صفوان بن أمية، ثم رجع النبي صلى الله عليه وسلم إلى المدينة، فجاءه أبو بصير  رجل من قريش  وهو مسلم فأرسلوا في طلبه رجلين، فقالوا العهد الذي جعلت لنا‏.‏ فدفعه إلى الرجلين، فخرجا به حتى بلغا ذا الحليفة، فنزلوا يأكلون من تمر لهم، فقال أبو بصير لأحد الرجلين والله إني لأرى سيفك هذا يا فلان جيدا‏.‏ فاستله الآخر فقال أجل، والله إنه لجيد، لقد جربت به ثم جربت‏.‏ فقال أبو بصير أرني أنظر إليه، فأمكنه منه، فضربه حتى برد، وفر الآخر، حتى أتى المدينة، فدخل المسجد يعدو‏.‏ فقال رسول الله صلى الله عليه وسلم حين رآه ‏\"‏ لقد رأى هذا ذعرا ‏\"‏‏.‏ فلما انتهى إلى النبي صلى الله عليه وسلم قال قتل والله صاحبي وإني لمقتول، فجاء أبو بصير فقال يا نبي الله، قد والله أوفى الله ذمتك، قد رددتني إليهم ثم أنجاني الله منهم‏.‏ قال النبي صلى الله عليه وسلم ‏\"‏ ويل أمه مسعر حرب، لو كان له أحد ‏\"‏‏.‏ فلما سمع ذلك عرف أنه سيرده إليهم، فخرج حتى أتى سيف البحر‏.‏ قال وينفلت منهم أبو جندل بن سهيل، فلحق بأبي بصير، فجعل لا يخرج من قريش رجل قد أسلم إلا لحق بأبي بصير، حتى اجتمعت منهم عصابة، فوالله ما يسمعون بعير خرجت لقريش إلى الشأم إلا اعترضوا لها، فقتلوهم، وأخذوا أموالهم، فأرسلت قريش إلى النبي صلى الله عليه وسلم تناشده بالله والرحم لما أرسل، فمن أتاه فهو آمن، فأرسل النبي صلى الله عليه وسلم إليهم، فأنزل الله تعالى ‏{‏وهو الذي كف أيديهم عنكم وأيديكم عنهم ببطن مكة من بعد أن أظفركم عليهم‏}‏ حتى بلغ ‏{‏الحمية حمية الجاهلية‏}‏ وكانت حميتهم أنهم لم يقروا أنه نبي الله، ولم يقروا ببسم الله الرحمن الرحيم، وحالوا بينهم وبين البيت‏.‏",
      "text_en": " Narrated Al-Miswar bin Makhrama and Marwan:                     (whose narrations attest each other) Allah's Apostle set out at the time of Al-Hudaibiya (treaty), and when they proceeded for a distance, he said, \"Khalid bin Al-Walid leading the cavalry of Quraish constituting the front of the army, is at a place called Al-Ghamim, so take the way on the right.\" By Allah, Khalid did not perceive the arrival of the Muslims till the dust arising from the march of the Muslim army reached him, and then he turned back hurriedly to inform Quraish. The Prophet went on advancing till he reached the Thaniya (i.e. a mountainous way) through which one would go to them (i.e. people of Quraish). The she-camel of the Prophet sat down. The people tried their best to cause the she-camel to get up but in vain, so they said, \"Al-Qaswa' (i.e. the she-camel's name) has become stubborn! Al-Qaswa' has become stubborn!\" The Prophet said, \"Al-Qaswa' has not become stubborn, for stubbornness is not her habit, but she was stopped by Him Who stopped the elephant.\" Then he said, \"By the Name of Him in Whose Hands my soul is, if they (i.e. the Quraish infidels) ask me anything which will respect the ordinances of Allah, I will grant it to them.\" The Prophet then rebuked the she-camel and she got up. The Prophet changed his way till he dismounted at the farthest end of Al-Hudaibiya at a pit (i.e. well) containing a little water which the people used in small amounts, and in a short while the people used up all its water and complained to Allah's Apostle; of thirst. The Prophet took an arrow out of his arrow-case and ordered them to put the arrow in that pit. By Allah, the water started and continued sprouting out till all the people quenched their thirst and returned with satisfaction. While they were still in that state, Budail bin Warqa-al- Khuza`i came with some persons from his tribe Khuza`a and they were the advisers of Allah's Apostle who would keep no secret from him and were from the people of Tihama. Budail said, \"I left Ka`b bin Luai and 'Amir bin Luai residing at the profuse water of Al-Hudaibiya and they had milch camels (or their women and children) with them, and will wage war against you, and will prevent you from visiting the Ka`ba.\" Allah's Apostle said, \"We have not come to fight anyone, but to perform the `Umra. No doubt, the war has weakened Quraish and they have suffered great losses, so if they wish, I will conclude a truce with them, during which they should refrain from interfering between me and the people (i.e. the 'Arab infidels other than Quraish), and if I have victory over those infidels, Quraish will have the option to embrace Islam as the other people do, if they wish; they will at least get strong enough to fight. But if they do not accept the truce, by Allah in Whose Hands my life is, I will fight with them defending my Cause till I get killed, but (I am sure) Allah will definitely make His Cause victorious.\" Budail said, \"I will inform them of what you have said.\" So, he set off till he reached Quraish and said, \"We have come from that man (i.e. Muhammad) whom we heard saying something which we will disclose to you if you should like.\" Some of the fools among Quraish shouted that they were not in need of this information, but the wiser among them said, \"Relate what you heard him saying.\" Budail said, \"I heard him saying so-and-so,\" relating what the Prophet had told him. `Urwa bin Mas`ud got up and said, \"O people! Aren't you the sons? They said, \"Yes.\" He added, \"Am I not the father?\" They said, \"Yes.\" He said, \"Do you mistrust me?\" They said, \"No.\" He said, \"Don't you know that I invited the people of `Ukaz for your help, and when they refused I brought my relatives and children and those who obeyed me (to help you)?\" They said, \"Yes.\" He said, \"Well, this man (i.e. the Prophet) has offered you a reasonable proposal, you'd better accept it and allow me to meet him.\" They said, \"You may meet him.\" So, he went to the Prophet and started talking to him. The Prophet told him almost the same as he had told Budail. Then `Urwa said, \"O Muhammad! Won't you feel any scruple in extirpating your relations? Have you ever heard of anyone amongst the Arabs extirpating his relatives before you? On the other hand, if the reverse should happen, (nobody will aid you, for) by Allah, I do not see (with you) dignified people, but people from various tribes who would run away leaving you alone.\" Hearing that, Abu Bakr abused him and said, \"Do you say we would run and leave the Prophet alone?\" `Urwa said, \"Who is that man?\" They said, \"He is Abu Bakr.\" `Urwa said to Abu Bakr, \"By Him in Whose Hands my life is, were it not for the favor which you did to me and which I did not compensate, I would retort on you.\" `Urwa kept on talking to the Prophet and seizing the Prophet's beard as he was talking while Al-Mughira bin Shu`ba was standing near the head of the Prophet, holding a sword and wearing a helmet. Whenever `Urwa stretched his hand towards the beard of the Prophet, Al-Mughira would hit his hand with the handle of the sword and say (to `Urwa), \"Remove your hand from the beard of Allah's Apostle.\" `Urwa raised his head and asked, \"Who is that?\" The people said, \"He is Al-Mughira bin Shu`ba.\" `Urwa said, \"O treacherous! Am I not doing my best to prevent evil consequences of your treachery?\" Before embracing Islam Al-Mughira was in the company of some people. He killed them and took their property and came (to Medina) to embrace Islam. The Prophet said (to him, \"As regards your Islam, I accept it, but as for the property I do not take anything of it. (As it was taken through treason). `Urwa then started looking at the Companions of the Prophet. By Allah, whenever Allah's Apostle spat, the spittle would fall in the hand of one of them (i.e. the Prophet's companions) who would rub it on his face and skin; if he ordered them they would carry his orders immediately; if he performed ablution, they would struggle to take the remaining water; and when they spoke to him, they would lower their voices and would not look at his face constantly out of respect. `Urwa returned to his people and said, \"O people! By Allah, I have been to the kings and to Caesar, Khosrau and An- Najashi, yet I have never seen any of them respected by his courtiers as much as Muhammad is respected by his companions. By Allah, if he spat, the spittle would fall in the hand of one of them (i.e. the Prophet's companions) who would rub it on his face and skin; if he ordered them, they would carry out his order immediately; if he performed ablution, they would struggle to take the remaining water; and when they spoke, they would lower their voices and would not look at his face constantly out of respect.\" `Urwa added, \"No doubt, he has presented to you a good reasonable offer, so please accept it.\" A man from the tribe of Bani Kinana said, \"Allow me to go to him,\" and they allowed him, and when he approached the Prophet and his companions, Allah's Apostle said, \"He is so-and-so who belongs to the tribe that respects the Budn (i.e. camels of the sacrifice). So, bring the Budn in front of him.\" So, the Budn were brought before him and the people received him while they were reciting Talbiya. When he saw that scene, he said, \"Glorified be Allah! It is not fair to prevent these people from visiting the Ka`ba.\" When he returned to his people, he said, 'I saw the Budn garlanded (with colored knotted ropes) and marked (with stabs on their backs). I do not think it is advisable to prevent them from visiting the Ka`ba.\" Another person called Mikraz bin Hafs got up and sought their permission to go to Muhammad, and they allowed him, too. When he approached the Muslims, the Prophet said, \"Here is Mikraz and he is a vicious man.\" Mikraz started talking to the Prophet and as he was talking, Suhail bin `Amr came. When Suhail bin `Amr came, the Prophet said, \"Now the matter has become easy.\" Suhail said to the Prophet \"Please conclude a peace treaty with us.\" So, the Prophet called the clerk and said to him, \"Write: By the Name of Allah, the most Beneficent, the most Merciful.\" Suhail said, \"As for 'Beneficent,' by Allah, I do not know what it means. So write: By Your Name O Allah, as you used to write previously.\" The Muslims said, \"By Allah, we will not write except: By the Name of Allah, the most Beneficent, the most Merciful.\" The Prophet said, \"Write: By Your Name O Allah.\" Then he dictated, \"This is the peace treaty which Muhammad, Allah's Apostle has concluded.\" Suhail said, \"By Allah, if we knew that you are Allah's Apostle we would not prevent you from visiting the Ka`ba, and would not fight with you. So, write: \"Muhammad bin `Abdullah.\" The Prophet said, \"By Allah! I am Apostle of Allah even if you people do not believe me. Write: Muhammad bin `Abdullah.\" (Az-Zuhri said, \"The Prophet accepted all those things, as he had already said that he would accept everything they would demand if it respects the ordinance of Allah, (i.e. by letting him and his companions perform `Umra.)\" The Prophet said to Suhail, \"On the condition that you allow us to visit the House (i.e. Ka`ba) so that we may perform Tawaf around it.\" Suhail said, \"By Allah, we will not (allow you this year) so as not to give chance to the 'Arabs to say that we have yielded to you, but we will allow you next year.\" So, the Prophet got that written. Then Suhail said, \"We also stipulate that you should return to us whoever comes to you from us, even if he embraced your religion.\" The Muslims said, \"Glorified be Allah! How will such a person be returned to the pagans after he has become a Muslim? While they were in this state Abu- Jandal bin Suhail bin `Amr came from the valley of Mecca staggering with his fetters and fell down amongst the Muslims. Suhail said, \"O Muhammad! This is the very first term with which we make peace with you, i.e. you shall return Abu Jandal to me.\" The Prophet said, \"The peace treaty has not been written yet.\" Suhail said, \"I will never allow you to keep him.\" The Prophet said, \"Yes, do.\" He said, \"I won't do.: Mikraz said, \"We allow you (to keep him).\" Abu Jandal said, \"O Muslims! Will I be returned to the pagans though I have come as a Muslim? Don't you see how much I have suffered?\" (continued...) (continuing... 1): -3.891:... ... Abu Jandal had been tortured severely for the Cause of Allah. `Umar bin Al-Khattab said, \"I went to the Prophet and said, 'Aren't you truly the Apostle of Allah?' The Prophet said, 'Yes, indeed.' I said, 'Isn't our Cause just and the cause of the enemy unjust?' He said, 'Yes.' I said, 'Then why should we be humble in our religion?' He said, 'I am Allah's Apostle and I do not disobey Him, and He will make me victorious.' I said, 'Didn't you tell us that we would go to the Ka`ba and perform Tawaf around it?' He said, 'Yes, but did I tell you that we would visit the Ka`ba this year?' I said, 'No.' He said, 'So you will visit it and perform Tawaf around it?' \" `Umar further said, \"I went to Abu Bakr and said, 'O Abu Bakr! Isn't he truly Allah's Prophet?' He replied, 'Yes.' I said, 'Then why should we be humble in our religion?' He said, 'Indeed, he is Allah's Apostle and he does not disobey his Lord, and He will make him victorious. Adhere to him as, by Allah, he is on the right.' I said, 'Was he not telling us that we would go to the Ka`ba and perform Tawaf around it?' He said, 'Yes, but did he tell you that you would go to the Ka`ba this year?' I said, 'No.' He said, \"You will go to Ka`ba and perform Tawaf around it.\" (Az-Zuhri said, \" `Umar said, 'I performed many good deeds as expiation for the improper questions I asked them.' \") When the writing of the peace treaty was concluded, Allah's Apostle said to his companions, \"Get up and' slaughter your sacrifices and get your head shaved.\" By Allah none of them got up, and the Prophet repeated his order thrice. When none of them got up, he left them and went to Um Salama and told her of the people's attitudes towards him. Um Salama said, \"O the Prophet of Allah! Do you want your order to be carried out? Go out and don't say a word to anybody till you have slaughtered your sacrifice and call your barber to shave your head.\" So, the Prophet went out and did not talk to anyone of them till he did that, i.e. slaughtered the sacrifice and called his barber who shaved his head. Seeing that, the companions of the Prophet got up, slaughtered their sacrifices, and started shaving the heads of one another, and there was so much rush that there was a danger of killing each other. Then some believing women came (to the Prophet ); and Allah revealed the following Divine Verses:-- \"O you who believe, when the believing women come to you as emigrants examine them . . .\" (60.10) `Umar then divorced two wives of his who were infidels. Later on Muawiya bin Abu Sufyan married one of them, and Safwan bin Umaiya married the other. When the Prophet returned to Medina, Abu Basir, a new Muslim convert from Quraish came to him. The Infidels sent in his pursuit two men who said (to the Prophet ), \"Abide by the promise you gave us.\" So, the Prophet handed him over to them. They took him out (of the City) till they reached Dhul-Hulaifa where they dismounted to eat some dates they had with them. Abu Basir said to one of them, \"By Allah, O so-and-so, I see you have a fine sword.\" The other drew it out (of the scabbard) and said, \"By Allah, it is very fine and I have tried it many times.\" Abu Basir said, \"Let me have a look at it.\" When the other gave it to him, he hit him with it till he died, and his companion ran away till he came to Medina and entered the Mosque running. When Allah's Apostle saw him he said, \"This man appears to have been frightened.\" When he reached the Prophet he said, \"My companion has been murdered and I would have been murdered too.\" Abu Basir came and said, \"O Allah's Apostle, by Allah, Allah has made you fulfill your obligations by your returning me to them (i.e. the Infidels), but Allah has saved me from them.\" The Prophet said, \"Woe to his mother! what excellent war kindler he would be, should he only have supporters.\" When Abu Basir heard that he understood that the Prophet would return him to them again, so he set off till he reached the seashore. Abu Jandal bin Suhail got himself released from them (i.e. infidels) and joined Abu Basir. So, whenever a man from Quraish embraced Islam he would follow Abu Basir till they formed a strong group. By Allah, whenever they heard about a caravan of Quraish heading towards Sham, they stopped it and attacked and killed them (i.e. infidels) and took their properties. The people of Quraish sent a message to the Prophet requesting him for the Sake of Allah and Kith and kin to send for (i.e. Abu Basir and his companions) promising that whoever (amongst them) came to the Prophet would be secure. So the Prophet sent for them (i.e. Abu Basir's companions) and Allah I revealed the following Divine Verses: \"And it is He Who Has withheld their hands from you and your hands From them in the midst of Mecca, After He made you the victorious over them. ... the unbelievers had pride and haughtiness, in their hearts ... the pride and haughtiness of the time of ignorance.\" (48.24-26) And their pride and haughtiness was that they did not confess (write in the treaty) that he (i.e. Muhammad) was the Prophet of Allah and refused to write: \"In the Name of Allah, the most Beneficent, the Most Merciful,\" and they (the mushriks) prevented them (the Muslims) from visiting the House (the Ka`bah).",
      "chain": [
        "30351",
        "20121",
        "20115",
        "11013",
        "10511",
        "2201"
      ]
    }
  ],
  "total_hadiths": 196
}