{
  "id": "30352",
  "name": "Abu Ja'far al-Nafaili عبد الله بن محمد أبو جعفر النفيلي الحران",
  "full_name": "Abu Ja'far al-Nafaili عبد الله بن محمد أبو جعفر النفيلي الحران",
  "grade": "3rd Century AH [10th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "234",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Hiran"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ خ  4  -  ثقة حافظ ]"
    ],
    "tags": [
      "al-Hirani",
      "al-Nafaili"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "28102",
      "name": "al-Hasan bin 'Umar/'Amr الحسن بن عمر - أبو المليح الرقي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "28161",
      "name": "Khtab bin al-Qasim al-Hrany خطاب بن القاسم الحراني",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "20192",
      "name": "Da'ud bin 'Abdur Rahman al-'Atar داود بن عبد الرحمن العطار",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "23002",
      "name": "Ibrahim bin 'Abdul 'Aziz bin 'bdul Malik إبراهيم بن عبد العزيز بن عبد الملك",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20321",
      "name": "Zuhayr bin Mua'wiya bin Hudayj زهير بن معاوية بن حديج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20167",
      "name": "'Abdul 'Aziz bin Muhammad al-Daruradi عبد العزيز بن محمد الدراوردي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20468",
      "name": "Hashaym bin Bashayr bin al-Qasim هشيم بن بشير بن القاسم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20248",
      "name": "'Abdul Salam bin Harb bin Salm al-Mala'i عبد السلام بن حرب بن سلم النهدي الملائي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20431",
      "name": "'Aabad bin al-Wam bin عباد بن العوام",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20463",
      "name": "Mskyn bin Bkyr al-Hrany مسكين بن بكير الحراني أبو عبد الرحمن",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20677",
      "name": "Ma'ql bin 'Ubaidullah معقل بن عبيد الله الجزري أبو عبد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "13552",
      "name": "Muhammad bin 'Imran al-Hjby محمد بن عمران الحجبي حجازي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "28408",
      "name": "'Ali bin Thabit al-Jzry علي بن ثابت الجزري أبو أحمد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20509",
      "name": "'Abdur Rahman bin Abi al-Zanad عبد الرحمن بن أبي الزناد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "30020",
      "name": "Yahya bin Ma'in يحيى بن معين",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30554",
      "name": "Abu Zara' al-Razi أبو زرعة الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38088",
      "name": "Ibrahim bin Y'aqub bin Ishaq إبراهيم بن يعقوب بن إسحاق",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38433",
      "name": "'Amr bin Mnswr al-Nsa'iy عمرو بن منصور النسائي أبو سعيد",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38247",
      "name": "Sulaiman bin Syf bin Yahya سليمان بن سيف بن يحيى",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38022",
      "name": "Ahmed bin Suliaman أحمد بن سليمان",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38653",
      "name": "Musa bin Sa'id bin al-N'man موسى بن سعيد بن النعمان بن بسام",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38684",
      "name": "Hilal bin al-'Ala' bin Hilal bin 'Umar هلال بن العلاء بن هلال بن عمر",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "4587",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد، حدثنا النفيلي، حدثنا مسكين، عن شعبة، عن خالد الحذاء، عن مروان الأصفر، عن رجل، من أصحاب النبي صلى الله عليه وسلم وهو ابن عمر أنها قد نسخت ‏{‏وإن تبدوا ما في أنفسكم أو تخفوه‏}‏ الآية‏.‏",
      "text_en": " Narrated Ibn `Umar:                     This Verse:--\"Whether you show what is in your minds or conceal it..\" (2.284) was abrogated.",
      "chain": [
        "30213",
        "30352",
        "20463",
        "20020",
        "11282",
        "11611"
      ]
    },
    {
      "hadith_no": "8",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا ابن المبارك، عن محمد بن عجلان، عن القعقاع بن حكيم، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إنما أنا لكم بمنزلة الوالد أعلمكم فإذا أتى أحدكم الغائط فلا يستقبل القبلة ولا يستدبرها ولا يستطب بيمينه ‏\"‏ ‏.‏ وكان يأمر بثلاثة أحجار وينهى عن الروث والرمة ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     The Apostle of Allaah ( sal Allaahu alayhi wa sallam ) as saying: I am like father to you. When any of you goes to privy, he should not face or turn his back towards the qiblah. He should not cleanse with his right hand. He (the Prophet, sal Allaahu alayhi wa sallam) also commanded the Muslims to use three stones and forbade them to use dung or decayed bone.",
      "chain": [
        "30352",
        "20025",
        "10616",
        "10612",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "41",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا أبو معاوية، عن هشام بن عروة، عن عمرو بن خزيمة، عن عمارة بن خزيمة، عن خزيمة بن ثابت، قال سئل رسول الله صلى الله عليه وسلم عن الاستطابة فقال ‏\"‏ بثلاثة أحجار ليس فيها رجيع ‏\"‏ ‏.‏ قال أبو داود كذا رواه أبو أسامة وابن نمير عن هشام يعني ابن عروة ‏.‏",
      "text_en": " Narrated Khuzaymah ibn Thabit:                     The Prophet (ﷺ) was asked about cleansing (after relieving oneself). He said: (One should cleanse oneself) with three stones which should be free from dung.Abu Dawud said: A similar tradition has been narrated by Abu Usamah and Ibn Numair from Hisham.",
      "chain": [
        "30352",
        "20354",
        "11065",
        "18791",
        "19817",
        "410"
      ]
    },
    {
      "hadith_no": "78",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا وكيع، عن أسامة بن زيد، عن ابن خربوذ، عن أم صبية الجهنية، قالت اختلفت يدي ويد رسول الله صلى الله عليه وسلم في الوضوء من إناء واحد ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     My hands and the hands of the Messenger of Allah (ﷺ) alternated into one vessel while we performed ablution.",
      "chain": [
        "30352",
        "20032",
        "50"
      ]
    },
    {
      "hadith_no": "239",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا زهير، حدثنا أبو إسحاق، أخبرني سليمان بن صرد، عن جبير بن مطعم، أنهم ذكروا عند رسول الله صلى الله عليه وسلم الغسل من الجنابة فقال رسول الله صلى الله عليه وسلم ‏\"‏ أما أنا فأفيض على رأسي ثلاثا ‏\"‏ ‏.‏ وأشار بيديه كلتيهما ‏.‏",
      "text_en": " Jubair b. Mut’im reported :                      People made a mention of washing because of sexual defilement before the Messenger of Allah (May peace be upon him). The Messenger of Allah (May peace be upon him) said: I pour (water) on my head three times. And he made a sign with both his hands.",
      "chain": [
        "30352",
        "20321",
        "11049",
        "383"
      ]
    },
    {
      "hadith_no": "250",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا زهير، حدثنا أبو إسحاق، عن الأسود، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يغتسل ويصلي الركعتين وصلاة الغداة ولا أراه يحدث وضوءا بعد الغسل ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     The Messenger of Allah (ﷺ) took a bath and offered two rak'ahs of prayer and said the dawn prayer. I do not think he performed ablution afresh after taking a bath.",
      "chain": [
        "30352",
        "20321",
        "11049",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "282",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن يونس، وعبد الله بن محمد النفيلي، قالا حدثنا زهير، حدثنا هشام بن عروة، عن عروة، عن عائشة، أن فاطمة بنت أبي حبيش، جاءت رسول الله صلى الله عليه وسلم فقالت إني امرأة أستحاض فلا أطهر أفأدع الصلاة قال ‏\"‏ إنما ذلك عرق وليست بالحيضة فإذا أقبلت الحيضة فدعي الصلاة وإذا أدبرت فاغسلي عنك الدم ثم صلي ‏\"‏ ‏.‏",
      "text_en": " 'Urwah reported on the authority of 'Aishah:                      Fatimah daughter of Abu Hubaish came to the Messenger of Allah (ﷺ) and said: I am a woman who has prolonged flow of blood; I am never purified ; should I abandon prayer ? He replied: This is (due to) a vein, and not menstruation. When the menstruation begins, you should abandon prayer ; when it is finished, you should wash away the blood and pray.",
      "chain": [
        "30184",
        "30352",
        "20321",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "317",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، أخبرنا أبو معاوية، ح وحدثنا عثمان بن أبي شيبة، أخبرنا عبدة، - المعنى واحد - عن هشام بن عروة، عن أبيه، عن عائشة، قالت بعث رسول الله صلى الله عليه وسلم أسيد بن حضير وأناسا معه في طلب قلادة أضلتها عائشة فحضرت الصلاة فصلوا بغير وضوء فأتوا النبي صلى الله عليه وسلم فذكروا ذلك له فأنزلت آية التيمم زاد ابن نفيل فقال لها أسيد بن حضير يرحمك الله ما نزل بك أمر تكرهينه إلا جعل الله للمسلمين ولك فيه فرجا ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     The Messenger of Allah (ﷺ) sent Usayd ibn Hudayr and some people with him to search the necklace lost by Aisha. The time of prayer came and they prayed without ablution. When they returned to the Prophet (ﷺ) and related the fact to him, the verse concerning tayammum was revealed. Ibn Nufayl added: Usayd said to her: May Allah have mercy upon you! Never has there been an occasion when you were beset with an unpleasant matter but Allah made the Muslims and you come out of that.",
      "chain": [
        "30352",
        "20354",
        "30203",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "360",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا محمد بن سلمة، عن محمد بن إسحاق، عن فاطمة بنت المنذر، عن أسماء بنت أبي بكر، قالت سمعت امرأة، تسأل رسول الله صلى الله عليه وسلم كيف تصنع إحدانا بثوبها إذا رأت الطهر أتصلي فيه قال ‏\"‏ تنظر فإن رأت فيه دما فلتقرصه بشىء من ماء ولتنضح ما لم تر ولتصل فيه ‏\"‏ ‏.‏",
      "text_en": " Asma' daughter of Abu Bakr said:                      I heard a woman asking the Messenger of Allah (ﷺ): What should any of us to with her clothe (in which she menstruated) when she becomes purified ? Can she pray in that (clothe) ? He said: She should see; if she finds blood in it, she should scratch it with some water and (in case of doubt) sprinkle upon it (some water) and pray so long as she does not find (any blood).",
      "chain": [
        "30352",
        "20672",
        "11107",
        "10526",
        "70"
      ]
    },
    {
      "hadith_no": "364",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا النفيلي، حدثنا سفيان، عن ابن أبي نجيح، عن عطاء، عن عائشة، قالت قد كان يكون لإحدانا الدرع فيه تحيض وفيه تصيبها الجنابة ثم ترى فيه قطرة من دم فتقصعه بريقها ‏.‏",
      "text_en": " 'Aishah said:                      One of us would have a shirt in which she would menstruate and in it she became sexually defiled. Then if she ever saw any drop of blood in it, she would rub it off by applying her saliva.",
      "chain": [
        "30352",
        "20012",
        "11254",
        "11029",
        "53"
      ]
    },
    {
      "hadith_no": "373",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا زهير، ح حدثنا محمد بن عبيد بن حساب البصري، حدثنا سليم، - يعني ابن أخضر المعنى والإخبار في حديث سليم - قالا حدثنا عمرو بن ميمون بن مهران سمعت سليمان بن يسار يقول سمعت عائشة تقول إنها كانت تغسل المني من ثوب رسول الله صلى الله عليه وسلم ‏.‏ قالت ثم أرى فيه بقعة أو بقعا ‏.‏",
      "text_en": " Sulaiman b. Yasar reported:                      I heard 'Aishah say that she would wash semen from the clothe of the Messenger of Allah (ﷺ). She added: Then I would see a mark or marks (after washing).",
      "chain": [
        "30352",
        "20321",
        "30213",
        "20546",
        "11439",
        "11005"
      ]
    },
    {
      "hadith_no": "384",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، وأحمد بن يونس، قالا حدثنا زهير، حدثنا عبد الله بن عيسى، عن موسى بن عبد الله بن يزيد، عن امرأة، من بني عبد الأشهل قالت قلت يا رسول الله إن لنا طريقا إلى المسجد منتنة فكيف نفعل إذا مطرنا قال ‏\"‏ أليس بعدها طريق هي أطيب منها ‏\"‏ ‏.‏ قالت قلت بلى ‏.‏ قال ‏\"‏ فهذه بهذه ‏\"‏ ‏.‏",
      "text_en": " Narrated A woman of the Banu AbdulAshhal:                     She reported: I said Messenger of Allah, our road to the mosque has an unpleasant stench; what should we do when it is raining? He asked: Is there not a cleaner part after the filthy part of the road? She replied: Why not (there is one)! He said: It makes up for the other.",
      "chain": [
        "30352",
        "30184",
        "20321",
        "11361",
        "10832"
      ]
    },
    {
      "hadith_no": "457",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا النفيلي، حدثنا مسكين، عن سعيد بن عبد العزيز، عن زياد بن أبي سودة، عن ميمونة، مولاة النبي صلى الله عليه وسلم أنها قالت يا رسول الله أفتنا في بيت المقدس فقال ‏\"‏ ائتوه فصلوا فيه ‏\"‏ ‏.‏ - وكانت البلاد إذ ذاك حربا - فإن لم تأتوه وتصلوا فيه فابعثوا بزيت يسرج في قناديله ‏\"‏ ‏.‏",
      "text_en": " Narrated Maymunah ibn Sa'd:                     I said: Messenger of Allah, tell us the legal injunction about (visiting) Bayt al-Muqaddas (the dome of the Rock at Jerusalem). The Messenger of Allah (ﷺ) said: go and pray there. All the cities at that time were effected by war. If you cannot visit it and pray there, then send some oil to be used in the lamps.",
      "chain": [
        "30352",
        "20463",
        "20638",
        "18312"
      ]
    },
    {
      "hadith_no": "504",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا النفيلي، حدثنا إبراهيم بن إسماعيل بن عبد الملك بن أبي محذورة، قال سمعت جدي عبد الملك بن أبي محذورة، يذكر أنه سمع أبا محذورة، يقول ألقى على رسول الله صلى الله عليه وسلم الأذان حرفا حرفا ‏\"‏ الله أكبر الله أكبر الله أكبر الله أكبر أشهد أن لا إله إلا الله أشهد أن لا إله إلا الله أشهد أن محمدا رسول الله أشهد أن محمدا رسول الله أشهد أن لا إله إلا الله أشهد أن لا إله إلا الله أشهد أن محمدا رسول الله أشهد أن محمدا رسول الله حى على الصلاة حى على الصلاة حى على الفلاح حى على الفلاح ‏\"‏ ‏.‏ قال وكان يقول في الفجر الصلاة خير من النوم ‏.‏",
      "text_en": " Abu Mahdhurah reported:                      The Messenger of Allah (May peace be upon him) taught me the call to prayer (adhan) verbatim; Allah is most great, Allah is most great, Allah is most great, Allah is most great; I testify that there is no god but Allah, I testify that there is no god but Allah; I testify that Muhammad is the Messenger of Allah; I testify that Muhammad is the Messenger of Allah; I testify that there is no god but Allah. I testify that there is no god but Allah; I testify that Muhammad is the Messenger of Allah, I testify that Muhammad is the Messenger of Allah; come to prayer, come to prayer; come to salvation, come to salvation. He used to pronounce “prayer is better than sleep” in the dawn prayer.",
      "chain": [
        "30352",
        "26500"
      ]
    },
    {
      "hadith_no": "549",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا النفيلي، حدثنا أبو المليح، حدثني يزيد بن يزيد، حدثني يزيد بن الأصم، سمعت أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ لقد هممت أن آمر فتيتي فيجمعوا حزما من حطب ثم آتي قوما يصلون في بيوتهم ليست بهم علة فأحرقها عليهم ‏\"‏ ‏.‏ قلت ليزيد بن الأصم يا أبا عوف الجمعة عنى أو غيرها قال صمتا أذناى إن لم أكن سمعت أبا هريرة يأثره عن رسول الله صلى الله عليه وسلم ما ذكر جمعة ولا غيرها ‏.‏",
      "text_en": " Abu Hurairah reported the Messenger of Allah (ﷺ) as saying:                      I thought about giving orders to some youths for gathering a bundle of firewood, then going off to some people who their prayers in their homes without any excuse, and burning down their houses over them.I (Yazid b. Yazid) said: I asked Yazid b. al-Asamm: Abu ‘Awf did he mean Friday (prayer) or any other? He replied: may my ears become deaf if I have not heard Abu Hurairah narrating it from the Messenger of Allah (May peace be upon him); He did not mention Friday (prayer) or any other.",
      "chain": [
        "30352",
        "11453",
        "10842",
        "13"
      ]
    },
    {
      "hadith_no": "557",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا زهير، حدثنا سليمان التيمي، أن أبا عثمان، حدثه عن أبى بن كعب، قال كان رجل لا أعلم أحدا من الناس ممن يصلي القبلة من أهل المدينة أبعد منزلا من المسجد من ذلك الرجل وكان لا تخطئه صلاة في المسجد فقلت لو اشتريت حمارا تركبه في الرمضاء والظلمة ‏.‏ فقال ما أحب أن منزلي إلى جنب المسجد فنمي الحديث إلى رسول الله صلى الله عليه وسلم فسأله عن قوله ذلك فقال أردت يا رسول الله أن يكتب لي إقبالي إلى المسجد ورجوعي إلى أهلي إذا رجعت ‏.‏ فقال ‏\"‏ أعطاك الله ذلك كله أنطاك الله جل وعز ما احتسبت كله أجمع ‏\"‏ ‏.‏",
      "text_en": " Ubayy b. Ka’b said:                      There was a certain person, out of all people of Medina, who used to pray in the mosque. I do not know that any one of them lived at a farther distance than that man. Still he never missed the prayer in congregation in the mosque. I said: it would be better if you buy a donkey and ride it in heat and darkness. He said: I do not like that my house be by the side of the mosque. The discourse reached the Messenger of Allah (ﷺ). He said him about it. He said: I did it so that my walking to the mosque and return to my home when I return be recorded. He said: Allah has granted all this to you; Allah has granted all that you reckoned.",
      "chain": [
        "30352",
        "20321",
        "11289",
        "11113",
        "39"
      ]
    },
    {
      "hadith_no": "586",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا النفيلي، حدثنا زهير، حدثنا عاصم الأحول، عن عمرو بن سلمة، بهذا الخبر قال فكنت أؤمهم في بردة موصلة فيها فتق فكنت إذا سجدت خرجت استي ‏.‏",
      "text_en": " This tradition has also been transmitted through a different chain by ‘Amr b. Salamah. This version says:                      “I used to lead them in prayer with a sheet of cloth on me that was patched and torn. When I prostrated myself, my buttocks were disclosed.",
      "chain": [
        "30352",
        "20321",
        "11080",
        "5206"
      ]
    },
    {
      "hadith_no": "661",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا زهير، قال سألت سليمان الأعمش عن جابر بن سمرة، في الصفوف المقدمة فحدثنا عن المسيب بن رافع، عن تميم بن طرفة، عن جابر بن سمرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ألا تصفون كما تصف الملائكة عند ربهم جل وعز ‏\"‏ ‏.‏ قلنا وكيف تصف الملائكة عند ربهم قال ‏\"‏ يتمون الصفوف المقدمة ويتراصون في الصف ‏\"‏ ‏.‏",
      "text_en": " jabir b. Samurah reported the Messenger of Allah (ﷺ) as saying:                      Why do you stand in rows as the angels do in the presence of their Lord? We asked: how do the angles stand in rows in the presence of their Lord? He replied: they make the first row complete and keep close together in the row.",
      "chain": [
        "30352",
        "20321",
        "11060",
        "393",
        "11394",
        "10894",
        "393"
      ]
    },
    {
      "hadith_no": "696",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا القعنبي، والنفيلي، قالا حدثنا عبد العزيز بن أبي حازم، قال أخبرني أبي، عن سهل، قال وكان بين مقام النبي صلى الله عليه وسلم وبين القبلة ممر عنز ‏.‏ قال أبو داود الخبر للنفيلي ‏.‏",
      "text_en": " Sahl said:                      The distance between the place where the Prophet (ﷺ) stood and the qiblah (i.e. the sutrah or the wall of the mosque) was as much as to allow a goat to pass.",
      "chain": [
        "20164",
        "30352",
        "20165",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "804",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الله بن محمد، - يعني النفيلي - حدثنا هشيم، أخبرنا منصور، عن الوليد بن مسلم الهجيمي، عن أبي الصديق الناجي، عن أبي سعيد الخدري، قال حزرنا قيام رسول الله صلى الله عليه وسلم في الظهر والعصر فحزرنا قيامه في الركعتين الأوليين من الظهر قدر ثلاثين آية قدر ‏{‏ الم * تنزيل ‏}‏ السجدة وحزرنا قيامه في الأخريين على النصف من ذلك وحزرنا قيامه في الأوليين من العصر على قدر الأخريين من الظهر وحزرنا قيامه في الأخريين من العصر على النصف من ذلك ‏.‏",
      "text_en": " Abu sa’id al Khudri said:                      We used to estimate how long the Messenger of Allah (ﷺ) stood in the noon and the afternoon prayer, and we estimated that he stood in the first two rak’ahs of the noon prayer as long as it takes to recite thirty verses (of the Qur’an), such as A-L-M Tanzil al-Sajdah. And we estimated that he stood in the last two rak’ahs half the time he stood in the first two rak’ahs. We estimated that he stood in the first two rak’ahs of the afternoon prayer as long as he did in the last two at noon; and we estimated that he stood in the last two rak’ahs of the afternoon prayer half the time he did in first two.",
      "chain": [
        "30352",
        "20468",
        "11067",
        "10725",
        "11268",
        "38"
      ]
    },
    {
      "hadith_no": "823",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا محمد بن سلمة، عن محمد بن إسحاق، عن مكحول، عن محمود بن الربيع، عن عبادة بن الصامت، قال كنا خلف رسول الله صلى الله عليه وسلم في صلاة الفجر فقرأ رسول الله صلى الله عليه وسلم فثقلت عليه القراءة فلما فرغ قال ‏\"‏ لعلكم تقرءون خلف إمامكم ‏\"‏ ‏.‏ قلنا نعم هذا يا رسول الله ‏.‏ قال ‏\"‏ لا تفعلوا إلا بفاتحة الكتاب فإنه لا صلاة لمن لم يقرأ بها ‏\"‏ ‏.‏",
      "text_en": " Narrated Ubadah ibn as-Samit:                     We were behind the Messenger of Allah (ﷺ) at the dawn prayer, and he recited (the passage), but the recitation became difficult for him. Then when he finished, he said: Perhaps you recite behind your imam? We replied: Yes, it is so, Messenger of Allah. He said: Do not do so except when it is Fatihat al-Kitab, for he who does not recite it is not credited with having prayed.",
      "chain": [
        "30352",
        "20672",
        "11107",
        "11066",
        "5278",
        "40"
      ]
    },
    {
      "hadith_no": "899",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا زهير، حدثنا أبو إسحاق، عن التميمي الذي، يحدث بالتفسير عن ابن عباس، قال أتيت النبي صلى الله عليه وسلم من خلفه فرأيت بياض إبطيه وهو مجخ قد فرج بين يديه ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     I came to the Prophet (ﷺ) from behind. I saw the whiteness of his armpits and he kept his arms away from his sides and raised his stomach (from the ground).",
      "chain": [
        "30352",
        "20321",
        "11049",
        "17"
      ]
    },
    {
      "hadith_no": "926",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا زهير، حدثنا أبو الزبير، عن جابر، قال أرسلني نبي الله صلى الله عليه وسلم إلى بني المصطلق فأتيته وهو يصلي على بعيره فكلمته فقال لي بيده هكذا ثم كلمته فقال لي بيده هكذا وأنا أسمعه يقرأ ويومئ برأسه فلما فرغ قال ‏\"‏ ما فعلت في الذي أرسلتك فإنه لم يمنعني أن أكلمك إلا أني كنت أصلي ‏\"‏ ‏.‏",
      "text_en": " jabir said:                      The prophet of Allah(ﷺ) sent me to Banu al-Mustaliq. When I returned to him, he was praying on his camel. I talked to him; he made a sign to me with his hand like this. I again talked to him; he made a sign to me with his hand like this. I was hearing him reciting the Qur’an and he was making a sign with his head. When he finished his prayer, he said; what did you do about the mission for which I had sent you; nothing prevented me from talking to you except that I was praying.",
      "chain": [
        "30352",
        "20321",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "970",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا زهير، حدثنا الحسن بن الحر، عن القاسم بن مخيمرة، قال أخذ علقمة بيدي فحدثني أن عبد الله بن مسعود أخذ بيده وأن رسول الله صلى الله عليه وسلم أخذ بيد عبد الله فعلمه التشهد في الصلاة فذكر مثل دعاء حديث الأعمش ‏\"‏ إذا قلت هذا أو قضيت هذا فقد قضيت صلاتك إن شئت أن تقوم فقم وإن شئت أن تقعد فاقعد ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     Alqamah said that Abdullah ibn Mas'ud caught hold of his hand saying that the Messenger of Allah (ﷺ) caught hold of his (Ibn Mas'ud's) hand and taught him the tashahhud during prayer.  He then narrated the (well known ) tradition (of tashahhud). This version adds: When you say this or finish this, then you have completed your prayer. If you want to stand up, then stand, and if you want to remain sitting, then remain sitting.",
      "chain": [
        "30352",
        "20321",
        "15088",
        "10812"
      ]
    },
    {
      "hadith_no": "991",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا عثمان، - يعني ابن عبد الرحمن - حدثنا عصام بن قدامة، - من بني بجيلة - عن مالك بن نمير الخزاعي، عن أبيه، قال رأيت النبي صلى الله عليه وسلم واضعا ذراعه اليمنى على فخذه اليمنى رافعا أصبعه السبابة قد حناها شيئا ‏.‏",
      "text_en": " Narrated AbuMalik Numayr al-Khuza'i:                     I saw the Prophet (peace be upon him placing his right hand on his right thigh and raising his forefinger curving it a little.",
      "chain": [
        "30352",
        "28389",
        "15370",
        "14351"
      ]
    },
    {
      "hadith_no": "1000",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا زهير، حدثنا الأعمش، عن المسيب بن رافع، عن تميم الطائي، عن جابر بن سمرة، قال دخل علينا رسول الله صلى الله عليه وسلم والناس رافعو أيديهم - قال زهير أراه قال - في الصلاة فقال ‏\"‏ ما لي أراكم رافعي أيديكم كأنها أذناب خيل شمس اسكنوا في الصلاة ‏\"‏ ‏.‏",
      "text_en": " Jabir b. Samurah said:                      The Messenger of Allah (ﷺ) entered upon us while the people were raising their hands. The narrator Zubair said: I think( they were raising the hands) during prayer. He (the prophet) said: What is the matter, I see you raising your hands as if they are the tails of restive horses! Maintain tranquility during prayer.",
      "chain": [
        "30352",
        "20321",
        "11060",
        "11394",
        "393"
      ]
    },
    {
      "hadith_no": "1028",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا النفيلي، حدثنا محمد بن سلمة، عن خصيف، عن أبي عبيدة بن عبد الله، عن أبيه، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا كنت في صلاة فشككت في ثلاث أو أربع وأكبر ظنك على أربع تشهدت ثم سجدت سجدتين وأنت جالس قبل أن تسلم ثم تشهدت أيضا ثم تسلم ‏\"‏ ‏.‏ قال أبو داود رواه عبد الواحد عن خصيف ولم يرفعه ووافق عبد الواحد أيضا سفيان وشريك وإسرائيل واختلفوا في الكلام في متن الحديث ولم يسندوه ‏.‏",
      "text_en": " AbuUbaydah reported, on the authority of his father Abdullah (ibn Mas'ud), the Messenger of Allah (ﷺ) as saying:                      When you offer the prayer, and you are in doubt about the number of rak'ahs whether offered three or four, and you have prayed four rak'ahs in all probability in your opinion, you should recite tashahhud and make two prostrations while you are sitting before giving the salutation. afterwards you should recite the tashahhud and give the salutation again.Abu Dawud said: This tradition has been narrated by 'Abd al-Wahid from Khusaif, but he did not report it as a statement of the Prophet (ﷺ). The version of 'Abd al-Wahid has been corroborated by Sufyan, Sharik, and Isra'il. They differed amongst themselves about the text of the tradition and they did not narrate it with the continuous chain up to the Prophet (ﷺ).",
      "chain": [
        "30352",
        "20672",
        "19908"
      ]
    },
    {
      "hadith_no": "1064",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا محمد بن سلمة، عن محمد بن إسحاق، عن نافع، عن ابن عمر، قال نادى منادي رسول الله صلى الله عليه وسلم بذلك في المدينة في الليلة المطيرة والغداة القرة ‏.‏ قال أبو داود وروى هذا الخبر يحيى بن سعيد الأنصاري عن القاسم عن ابن عمر عن النبي صلى الله عليه وسلم قال فيه في السفر ‏.‏",
      "text_en": " Ibn ‘Umar said:                      The announcer of the Messenger of Allah(ﷺ) announced for that (to pray at homes) at Medina on a rainy night or a cold morning.Abu Dawud said: This tradition has also been narrated by Yahya b. Sa’id al-Ansari from al-Qasim from Ibn ‘Umar from the Prophet (ﷺ). This version adds the words “During the journey.”",
      "chain": [
        "30352",
        "20672",
        "11107",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1088",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا النفيلي، حدثنا محمد بن سلمة، عن محمد بن إسحاق، عن الزهري، عن السائب بن يزيد، قال كان يؤذن بين يدى رسول الله صلى الله عليه وسلم إذا جلس على المنبر يوم الجمعة على باب المسجد وأبي بكر وعمر ‏.‏ ثم ساق نحو حديث يونس ‏.‏",
      "text_en": " Sa'id b. Yazid said:                      The call to the (Friday) prayer was made at the gate of the mosque in front of the Messenger of Allah (ﷺ) when he sat on the pulpit, and of Abu Bakr and 'Umar. The narrator then repeated the same tradition as reported by Yunus.",
      "chain": [
        "30352",
        "20672",
        "11107",
        "11013",
        "3048"
      ]
    },
    {
      "hadith_no": "1138",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا النفيلي، حدثنا زهير، حدثنا عاصم الأحول، عن حفصة بنت سيرين، عن أم عطية، قالت كنا نؤمر بهذا الخبر قالت والحيض يكن خلف الناس فيكبرن مع الناس ‏.‏",
      "text_en": " This tradition has also been narrated by Umm 'Atiyyah though a different chain of transmitters. She said:                      We were commanded to go out (for offering the 'Id prayer). She further said: The menstruating women stood behind the people and they uttered the takbir (Allah is most great) along with the people.",
      "chain": [
        "30352",
        "20321",
        "11080",
        "11039",
        "71"
      ]
    },
    {
      "hadith_no": "1165",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book Of The Prayer For Rain (Kitab al-Istisqa') - كتاب الاستسقاء",
      "chapter_no": "3",
      "text_ar": "حدثنا النفيلي، وعثمان بن أبي شيبة، نحوه قالا حدثنا حاتم بن إسماعيل، حدثنا هشام بن إسحاق بن عبد الله بن كنانة، قال أخبرني أبي قال، أرسلني الوليد بن عتبة - قال عثمان ابن عقبة وكان أمير المدينة - إلى ابن عباس أسأله عن صلاة، رسول الله صلى الله عليه وسلم في الاستسقاء فقال خرج رسول الله صلى الله عليه وسلم متبذلا متواضعا متضرعا حتى أتى المصلى - زاد عثمان فرقي على المنبر ثم اتفقا - ولم يخطب خطبكم هذه ولكن لم يزل في الدعاء والتضرع والتكبير ثم صلى ركعتين كما يصلي في العيد ‏.‏ قال أبو داود والإخبار للنفيلي والصواب ابن عتبة ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     Ishaq ibn Abdullah ibn Kinanah reported: Al-Walid ibn Utbah or (according to the version of Uthman) al-Walid ibn Uqbah, the then governor of Medina, sent me to Ibn Abbas to ask him about the prayer for rain offered by the Messenger of Allah (ﷺ). He said: The Messenger of Allah (ﷺ) went out wearing old clothes in a humble and lowly manner until he reached the place of prayer. He then ascended the pulpit, but he did not deliver the sermon as you deliver (usually).  He remained engaged in making supplication, showing humbleness (to Allah) and uttering the takbir (Allah is most great). He then offered two rak'ahs of prayer as done on the 'Id (festival).Abu Dawud said: This is the version of al-Nufail. What is correct is Ibn Utbah's",
      "chain": [
        "30352",
        "30203",
        "20159",
        "20707",
        "19898",
        "17"
      ]
    },
    {
      "hadith_no": "1231",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Rules of Law about the Prayer during Journey - كتاب صلاة السفر",
      "chapter_no": "4",
      "text_ar": "حدثنا النفيلي، حدثنا محمد بن سلمة، عن محمد بن إسحاق، عن الزهري، عن عبيد الله بن عبد الله، عن ابن عباس، قال أقام رسول الله صلى الله عليه وسلم بمكة عام الفتح خمس عشرة يقصر الصلاة ‏.‏ قال أبو داود روى هذا الحديث عبدة بن سليمان وأحمد بن خالد الوهبي وسلمة بن الفضل عن ابن إسحاق لم يذكروا فيه ابن عباس ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Messenger of Allah (ﷺ) stayed fifteen days in Mecca in the year  of Conquest. Shortening the prayer.Abu Dawud said: This tradition has also been transmitted by 'Abdah b. Sulaiman, Ahmad b. Khalid al-Wahbi, and Salamah b. Fadli on the authority of Ibn Ishaq ; but they did not mention the name of Ibn 'Abbas.",
      "chain": [
        "30352",
        "20672",
        "11107",
        "11013",
        "11004",
        "17"
      ]
    },
    {
      "hadith_no": "1283",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا ابن علية، عن الجريري، عن عبد الله بن بريدة، عن عبد الله بن مغفل، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ بين كل أذانين صلاة بين كل أذانين صلاة لمن شاء ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Abd Allah b. Mughaffal:                     The Messenger of Allah (ﷺ) as saying: Between the two adhans there is a prayer, between the two adhans there is prayer for one who desires (to offer).",
      "chain": [
        "30352",
        "20208",
        "11286",
        "11432",
        "3242"
      ]
    },
    {
      "hadith_no": "1426",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا زهير، حدثنا أبو إسحاق، بإسناده ومعناه قال في آخره قال هذا يقول في الوتر في القنوت ولم يذكر أقولهن في الوتر ‏.‏ قال أبو داود أبو الحوراء ربيعة بن شيبان ‏.‏",
      "text_en": " The aforesaid tradition has been transmitted by Abu Ishaq with the same chain and to the same effect. In the last of this tradition he said:                      The version has the words: \"He would recite the supplication of the with.\" He did not mention the words: \"I say them in the with.\"Abu Dawud said: The name of Abu al-Hawra' is Rabi'ah b. Shaiban.",
      "chain": [
        "30352",
        "20321"
      ]
    },
    {
      "hadith_no": "1463",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا محمد بن سلمة، عن محمد بن إسحاق، عن سعيد بن أبي سعيد المقبري، عن أبيه، عن عقبة بن عامر، قال بينا أنا أسير، مع رسول الله صلى الله عليه وسلم بين الجحفة والأبواء إذ غشيتنا ريح وظلمة شديدة فجعل رسول الله صلى الله عليه وسلم يتعوذ ب ‏{‏ أعوذ برب الفلق ‏}‏ و ‏{‏ أعوذ برب الناس ‏}‏ ويقول ‏\"‏ يا عقبة تعوذ بهما فما تعوذ متعوذ بمثلهما ‏\"‏ ‏.‏ قال وسمعته يؤمنا بهما في الصلاة ‏.‏",
      "text_en": " Narrated Uqbah ibn Amir:                     White I was travelling with the Messenger of Allah (ﷺ) between al-Juhfah and al-Abwa', a wind and intense darkness enveloped us, whereupon the Messenger of Allah (ﷺ) began to seek refuge in Allah, reciting: \"I seek  refuge in the Lord of the dawn,\" and \"I seek refuge in the Lord of men.\" He then said: Uqbah, use them when seeking refuge in Allah, for no one can use anything to compare with them for the purpose. Uqbah added: I heard him reciting them when he led the people in prayer.",
      "chain": [
        "30352",
        "20672",
        "11107",
        "11168",
        "11212",
        "189"
      ]
    },
    {
      "hadith_no": "1514",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا النفيلي، حدثنا مخلد بن يزيد، حدثنا عثمان بن واقد العمري، عن أبي نصيرة، عن مولى، لأبي بكر الصديق عن أبي بكر الصديق، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما أصر من استغفر وإن عاد في اليوم سبعين مرة ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuBakr as-Siddiq:                     The Prophet (ﷺ) said: He who asks pardon is not a  confirmed sinner, even if he returns to his sin seventy times a day.",
      "chain": [
        "30352",
        "20462",
        "22147",
        "2"
      ]
    },
    {
      "hadith_no": "1568",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا عباد بن العوام، عن سفيان بن حسين، عن الزهري، عن سالم، عن أبيه، قال كتب رسول الله صلى الله عليه وسلم كتاب الصدقة فلم يخرجه إلى عماله حتى قبض فقرنه بسيفه فعمل به أبو بكر حتى قبض ثم عمل به عمر حتى قبض فكان فيه ‏\"‏ في خمس من الإبل شاة وفي عشر شاتان وفي خمس عشرة ثلاث شياه وفي عشرين أربع شياه وفي خمس وعشرين ابنة مخاض إلى خمس وثلاثين فإن زادت واحدة ففيها ابنة لبون إلى خمس وأربعين فإذا زادت واحدة ففيها حقة إلى ستين فإذا زادت واحدة ففيها جذعة إلى خمس وسبعين فإذا زادت واحدة ففيها ابنتا لبون إلى تسعين فإذا زادت واحدة ففيها حقتان إلى عشرين ومائة فإن كانت الإبل أكثر من ذلك ففي كل خمسين حقة وفي كل أربعين ابنة لبون وفي الغنم في كل أربعين شاة شاة إلى عشرين ومائة فإن زادت واحدة فشاتان إلى مائتين فإن زادت واحدة على المائتين ففيها ثلاث شياه إلى ثلاثمائة فإن كانت الغنم أكثر من ذلك ففي كل مائة شاة شاة وليس فيها شىء حتى تبلغ المائة ولا يفرق بين مجتمع ولا يجمع بين متفرق مخافة الصدقة وما كان من خليطين فإنهما يتراجعان بينهما بالسوية ولا يؤخذ في الصدقة هرمة ولا ذات عيب ‏\"‏ ‏.‏ قال وقال الزهري إذا جاء المصدق قسمت الشاء أثلاثا ثلثا شرارا وثلثا خيارا وثلثا وسطا فأخذ المصدق من الوسط ولم يذكر الزهري البقر ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     The Messenger of Allah (ﷺ) wrote a letter about sadaqah (zakat) but he died before he could send it to his governors. He had kept it  with his sword. So AbuBakr acted upon it till he died, and then Umar acted upon it till he died.  It contained: \"For five camels one goat is to be given; for ten camels two goats are to be given; for fifteen camels three goats are to be given; for twenty camels four goats are to be given; for twenty-five to thirty-five camels a she-camel in her second year is to be given. If the number exceeds by one up to seventy camels, a she-camel in her fourth year is to be given; if they exceed by one up to seventy-five camels, a she-camel in her fifth year is to be given; if they exceed by one up to ninety camels, two she-camels in their third year are to be given; if they exceed by one up to one hundred and twenty, two she-camels in their fourth year are to be given. If the camels are more than this, a she-camel in her fourth year is to be given for every fifty camels, and a she-camel in her third year is to be given for every forty camels.  For forty to one hundred and twenty goats one goat is to be given; if they exceed by one up to two hundred, two goats are to be given. If they exceed by one up to three hundred, three goats are to be given; if the goats are more than this, one goat for every hundred goats is to be given. Nothing is payable until they reach one hundred. Those which are in one flock are not to be separated, and those which are in separate flocks are not be brought together from fear of sadaqah (zakat). Regarding that which belongs to two partners, they can make claims for restitution from each other with equity. An old goat and a defective one are not to be accepted as sadaqah (zakat).\"  Az-Zuhri said: When the collector comes, the goats will be apportioned into three flocks: one containing bad, the second good, and the third moderate. The collector will take zakat from the moderate. Az-Zuhri did not mention the cows (to be apportioned in three flocks).",
      "chain": [
        "30352",
        "20431",
        "20655",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "1572",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا زهير، حدثنا أبو إسحاق، عن عاصم بن ضمرة، وعن الحارث الأعور، عن علي، - رضى الله عنه - قال زهير أحسبه عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ هاتوا ربع العشور من كل أربعين درهما درهم وليس عليكم شىء حتى تتم مائتى درهم فإذا كانت مائتى درهم ففيها خمسة دراهم فما زاد فعلى حساب ذلك وفي الغنم في كل أربعين شاة شاة فإن لم يكن إلا تسعا وثلاثين فليس عليك فيها شىء ‏\"‏ ‏.‏ وساق صدقة الغنم مثل الزهري قال ‏\"‏ وفي البقر في كل ثلاثين تبيع وفي الأربعين مسنة وليس على العوامل شىء وفي الإبل ‏\"‏ ‏.‏ فذكر صدقتها كما ذكر الزهري قال ‏\"‏ وفي خمس وعشرين خمسة من الغنم فإذا زادت واحدة ففيها ابنة مخاض فإن لم تكن بنت مخاض فابن لبون ذكر إلى خمس وثلاثين فإذا زادت واحدة ففيها بنت لبون إلى خمس وأربعين فإذا زادت واحدة ففيها حقة طروقة الجمل إلى ستين ‏\"‏ ‏.‏ ثم ساق مثل حديث الزهري قال ‏\"‏ فإذا زادت واحدة - يعني واحدة وتسعين - ففيها حقتان طروقتا الجمل إلى عشرين ومائة فإن كانت الإبل أكثر من ذلك ففي كل خمسين حقة ولا يفرق بين مجتمع ولا يجمع بين مفترق خشية الصدقة ولا تؤخذ في الصدقة هرمة ولا ذات عوار ولا تيس إلا أن يشاء المصدق وفي النبات ما سقته الأنهار أو سقت السماء العشر وما سقى الغرب ففيه نصف العشر ‏\"‏ ‏.‏ وفي حديث عاصم والحارث ‏\"‏ الصدقة في كل عام ‏\"‏ ‏.‏ قال زهير أحسبه قال ‏\"‏ مرة ‏\"‏ ‏.‏ وفي حديث عاصم ‏\"‏ إذا لم يكن في الإبل ابنة مخاض ولا ابن لبون فعشرة دراهم أو شاتان ‏\"‏ ‏.‏",
      "text_en": " Al-Harith al-A'war reported from Ali. Zuhayr said:                      I think, the Prophet (ﷺ) said: \"Pay a fortieth. A dirham is payable on every forty, but you are not liable for payment until you have accumulated two hundred dirhams. When you have two hundred dirhams, five dirhams are payable, and that proportion is applicable to larger amounts.  \"Regarding sheep, for every forty sheep up to one hundred and twenty, one sheep is due. But if you possess only thirty-nine, nothing is payable on them.\" He further narrated the tradition about the sadaqah (zakat) on sheep like that of az-Zuhri.  \"Regarding cattle, a yearling bull calf is payable for every thirty, and a cow in her third year for forty, and nothing is payable on working animals.  Regarding (the zakat on) camels, he mentioned the rates that az-Zuhri mentioned in his tradition. He said: \"For twenty-five camels, five sheep are to be paid. If they exceed by one, a she-camel in her second year is to be given. If there is no she-camel in her second year, a male camel in its third year is to be given, up to thirty-five. If they exceed by one a she-camel in her third year is to be given, up to forty-five. If they exceed by one, a she-camel in her fourth year which is ready to be covered by a bull-camel is to be given.\" He then transmitted the rest of the tradition like that of az-Zuhri.  He continued: If they exceed by one, i.e. they are ninety-one to hundred and twenty, two she-camels in their fourth year, which are ready to be covered by a bull-camel, are to be given. If there are more camels than that, a she-camel in her fourth year is to be given for every fifty. Those which are in one flock are not to be separated, and those which are separate are not to be brought together. An old sheep, one with a defect in the eye, or a billy goat is not to be accepted as a sadaqah unless the collector is willing.  As regards agricultural produce, a tenth is payable on that which is watered by rivers or rain, and a twentieth on that which is watered by draught camels.\"  The version of Asim and al-Harith says: \"Sadaqah (zakat) is payable every year.\" Zuhayr said: I think he said \"Once a year\".  The version of Asim has the words: \"If a she-camel in her second year is not available among the camels, nor is there a bull-camel in its third year, ten dirhams or two goats are to be given.\"",
      "chain": [
        "30352",
        "20321",
        "11049",
        "19871",
        "19865",
        "5"
      ]
    },
    {
      "hadith_no": "1576",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا النفيلي، حدثنا أبو معاوية، عن الأعمش، عن أبي وائل، عن معاذ، أن النبي صلى الله عليه وسلم لما وجهه إلى اليمن أمره أن يأخذ من البقر من كل ثلاثين تبيعا أو تبيعة ومن كل أربعين مسنة ومن كل حالم - يعني محتلما - دينارا أو عدله من المعافر ثياب تكون باليمن ‏.‏",
      "text_en": " Narrated Mu'adh ibn Jabal:                     When the Prophet (ﷺ) sent him to the Yemen, he ordered him to take a male or a female calf a year old for every thirty cattle and a cow in its third year for every forty, and one dinar for every adult (unbeliever as a poll-tax) or cloths of equivalent value manufactured in the Yemen.",
      "chain": [
        "30352",
        "20354",
        "11060",
        "11353",
        "32"
      ]
    },
    {
      "hadith_no": "1577",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا عثمان بن أبي شيبة، والنفيلي، وابن المثنى، قالوا حدثنا أبو معاوية، حدثنا الأعمش، عن إبراهيم، عن مسروق، عن معاذ، عن النبي صلى الله عليه وسلم مثله ‏.‏",
      "text_en": " This tradition has also been transmitted by Mu’adh through a different chain of narrators to the same effect.",
      "chain": [
        "30203",
        "30352",
        "30170",
        "20354",
        "11060",
        "11051",
        "11018",
        "32"
      ]
    },
    {
      "hadith_no": "1610",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا زهير، حدثنا موسى بن عقبة، عن نافع، عن ابن عمر، قال أمرنا رسول الله صلى الله عليه وسلم بزكاة الفطر أن تؤدى قبل خروج الناس إلى الصلاة ‏.‏ قال فكان ابن عمر يؤديها قبل ذلك باليوم واليومين ‏.‏",
      "text_en": " Ibn ‘Umar said :                      The Messenger of Allah(ﷺ) commanded us that the end of Ramadan when the fasting is closed sadaqah(alms) should be paid before the people went to prayer. ‘Abd Allah b. ‘Umar used to pay it one or two days before.",
      "chain": [
        "30352",
        "20321",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1629",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا مسكين، حدثنا محمد بن المهاجر، عن ربيعة بن يزيد، عن أبي كبشة السلولي، حدثنا سهل ابن الحنظلية، قال قدم على رسول الله عيينة بن حصن والأقرع بن حابس فسألاه فأمر لهما بما سألا وأمر معاوية فكتب لهما بما سألا فأما الأقرع فأخذ كتابه فلفه في عمامته وانطلق وأما عيينة فأخذ كتابه وأتى النبي صلى الله عليه وسلم مكانه فقال يا محمد أتراني حاملا إلى قومي كتابا لا أدري ما فيه كصحيفة المتلمس ‏.‏ فأخبر معاوية بقوله رسول الله صلى الله عليه وسلم فقال رسول الله صلى الله عليه وسلم ‏\"‏ من سأل وعنده ما يغنيه فإنما يستكثر من النار ‏\"‏ ‏.‏ وقال النفيلي في موضع آخر ‏\"‏ من جمر جهنم ‏\"‏ ‏.‏ فقالوا يا رسول الله وما يغنيه وقال النفيلي في موضع آخر وما الغنى الذي لا تنبغي معه المسألة قال ‏\"‏ قدر ما يغديه ويعشيه ‏\"‏ ‏.‏ وقال النفيلي في موضع آخر ‏\"‏ أن يكون له شبع يوم وليلة أو ليلة ويوم ‏\"‏ ‏.‏ وكان حدثنا به مختصرا على هذه الألفاظ التي ذكرت ‏.‏",
      "text_en": " Narrated Sahl ibn Hanzaliyyah:                     Uyaynah ibn Hisn and Aqra' ibn Habis came to the Messenger of Allah (ﷺ). They begged from him. He commanded to give them what they begged. He ordered Mu'awiyah to write a document to give what they begged. Aqra' took his document, wrapped it in his turban, and went away.  As for Uyaynah, he took his document and came to the Prophet (ﷺ) at his home, and said to him: Muhammad, do you see me? I am taking a document to my people, but I do not know what it contains, just like the document of al-Mutalammis. Mu'awiyah informed the Messenger of Allah (ﷺ) of his statement.  Thereupon the Messenger of Allah (ﷺ) said: He who begs (from people) when he has sufficient is simply asking for a large amount of Hell-fire. (An-Nufayl (a transmitter) said elsewhere: \"embers of Hell\".)  They asked: Messenger of Allah, what is a sufficiency? (Elsewhere an-Nufayl said: What is a sufficiency which makes begging unfitting?)  He replied: It is that which would provide a morning and an evening meal. (Elsewhere an-Nufayl said: It is when one has enough for a day and night, or for a night and a day.) He (an-Nufayl) narrated to us this tradition briefly in the words that I have mentioned.",
      "chain": [
        "30352",
        "20463",
        "11414",
        "11669",
        "1824"
      ]
    },
    {
      "hadith_no": "1722",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا النفيلي، حدثنا عبد العزيز بن محمد، عن زيد بن أسلم، عن ابن لأبي، واقد الليثي، عن أبيه، قال سمعت رسول الله صلى الله عليه وسلم يقول لأزواجه في حجة الوداع ‏\"‏ هذه ثم ظهور الحصر ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Waqid al-Laythi:                     I heard the Messenger of Allah (ﷺ) saying to his wives during the Farewell Pilgrimage: This (is the pilgrimage for you); afterwards stick to the surface of the mats (i.e. should stay at home).",
      "chain": [
        "30352",
        "20167",
        "11163",
        "4044"
      ]
    },
    {
      "hadith_no": "1724",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا عبد الله بن مسلمة، والنفيلي، عن مالك، ح وحدثنا الحسن بن علي، حدثنا بشر بن عمر، حدثني مالك، عن سعيد بن أبي سعيد، - قال الحسن في حديثه عن أبيه، ثم اتفقوا - عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يحل لامرأة تؤمن بالله واليوم الآخر أن تسافر يوما وليلة ‏\"‏ ‏.‏ فذكر معناه ‏.‏ قال أبو داود ولم يذكر القعنبي والنفيلي عن أبيه رواه ابن وهب وعثمان بن عمر عن مالك كما قال القعنبي ‏.‏",
      "text_en": " Abu Hurairah reported the Prophet (SWAS) as saying :                      A woman who believes in Allah and the last Day must not make a journey of a day and a night.  He then narrated the rest of the tradition to the same effect (as above).  The narrator al-Nufaili said : Malik narrated us.  Abu Dawud said : The narrators al-Nufail and al_Qa’nabi did not mention the words “from his father”.  Ibn Wahb and ‘Uthman bin ‘Umr narrated from Malik the same words as narrated by al-Qa’nabi (i.e. omitted the words “from his father”).",
      "chain": [
        "20164",
        "30352",
        "20001",
        "30",
        "20211",
        "20001",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "1749",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا النفيلي، حدثنا محمد بن سلمة، حدثنا محمد بن إسحاق، ح وحدثنا محمد بن المنهال، حدثنا يزيد بن زريع، عن ابن إسحاق، - المعنى - قال قال عبد الله - يعني ابن أبي نجيح - حدثني مجاهد عن ابن عباس أن رسول الله صلى الله عليه وسلم أهدى عام الحديبية في هدايا رسول الله صلى الله عليه وسلم جملا كان لأبي جهل في رأسه برة فضة ‏.‏ قال ابن منهال برة من ذهب زاد النفيلي يغيظ بذلك المشركين ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     In the year of al-Hudaybiyyah, the Messenger of Allah (ﷺ) included among his sacrificial animals a camel with a silver nose-ring (Ibn Minhal's version has gold) which had belonged to AbuJahl (the version of an-Nufayli added) \"thereby enraging the polytheists\".",
      "chain": [
        "30352",
        "20672",
        "11107",
        "30173",
        "20304",
        "11254",
        "11028",
        "17"
      ]
    },
    {
      "hadith_no": "1756",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا النفيلي، حدثنا محمد بن سلمة، عن أبي عبد الرحيم، - قال أبو داود أبو عبد الرحيم خالد بن أبي يزيد خال محمد بن سلمة روى عنه، حجاج بن محمد - عن جهم بن الجارود، عن سالم بن عبد الله، عن أبيه، قال أهدى عمر بن الخطاب نجيبا فأعطي بها ثلاثمائة دينار فأتى النبي صلى الله عليه وسلم فقال يا رسول الله إني أهديت نجيبا فأعطيت بها ثلاثمائة دينار أفأبيعها وأشتري بثمنها بدنا قال ‏\"‏ لا انحرها إياها ‏\"‏ ‏.‏ قال أبو داود هذا لأنه كان أشعرها ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     Umar ibn al-Khattab named a bukhti camel for sacrifice (at hajj). He was offered three hundred dinars for it (as its price). He came to the Prophet (ﷺ) and said: Messenger of Allah, I named a bukhti camel for sacrifice and I was offered for it three hundred dinars. May I sell it and purchase another one for its price? No, sacrifice it.Abu Dawud said: This was due to the fact that 'Umar had made an incision in hump.",
      "chain": [
        "30352",
        "20672",
        "18135",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "1800",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا النفيلي، حدثنا مسكين، عن الأوزاعي، عن يحيى بن أبي كثير، عن عكرمة، قال سمعت ابن عباس، يقول حدثني عمر بن الخطاب، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ أتاني الليلة آت من عند ربي عز وجل ‏\"‏ ‏.‏ قال وهو بالعقيق ‏\"‏ وقال صل في هذا الوادي المبارك وقال عمرة في حجة ‏\"‏ ‏.‏ قال أبو داود رواه الوليد بن مسلم وعمر بن عبد الواحد في هذا الحديث عن الأوزاعي ‏\"‏ وقل عمرة في حجة ‏\"‏ ‏.‏ قال أبو داود وكذا رواه علي بن المبارك عن يحيى بن أبي كثير في هذا الحديث وقال ‏\"‏ وقل عمرة في حجة ‏\"‏ ‏.‏",
      "text_en": " Umar bin Al Khattab heard the Apostle of Allaah(ﷺ) say Someone came to me at night from Allaah the Exalted. The narrator said When he was staying at ‘Aqiq said Pray in his blessed valley. Then he said ‘Umrah has been included in Hajj.Abu Dawud said Al Walid bin Musilm and ‘Umar bin Abd Al Wahid narrated in this version from Al Auza’I the words “And say An ‘Umrah included in Hajj”.Abu Dawud said Ali bin Al Mubarak has also narrated similarly from Yahya bin said Abi Kathir in this version “And say An ‘Umrah included in Hajj”.",
      "chain": [
        "30352",
        "20463",
        "20024",
        "11449",
        "11023",
        "17",
        "3"
      ]
    },
    {
      "hadith_no": "1808",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا النفيلي، حدثنا عبد العزيز، - يعني ابن محمد - أخبرني ربيعة بن أبي عبد الرحمن، عن الحارث بن بلال بن الحارث، عن أبيه، قال قلت يا رسول الله فسخ الحج لنا خاصة أو لمن بعدنا قال ‏\"‏ بل لكم خاصة ‏\"‏ ‏.‏",
      "text_en": " Narrated Bilal ibn al-Harith al-Muzani:                     I asked: Messenger of Allah, is the (command of) cancelling hajj meant exclusively for us, or for others too? He replied: No, this is meant exclusively for you.",
      "chain": [
        "30352",
        "20167",
        "11162"
      ]
    },
    {
      "hadith_no": "1864",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا النفيلي، حدثنا محمد بن سلمة، عن محمد بن إسحاق، عن عمرو بن ميمون، قال سمعت أبا حاضر الحميري، يحدث أبي ميمون بن مهران قال خرجت معتمرا عام حاصر أهل الشأم ابن الزبير بمكة وبعث معي رجال من قومي بهدى فلما انتهينا إلى أهل الشأم منعونا أن ندخل الحرم فنحرت الهدى مكاني ثم أحللت ثم رجعت فلما كان من العام المقبل خرجت لأقضي عمرتي فأتيت ابن عباس فسألته فقال أبدل الهدى فإن رسول الله صلى الله عليه وسلم أمر أصحابه أن يبدلوا الهدى الذي نحروا عام الحديبية في عمرة القضاء ‏.‏",
      "text_en": " Maymun ibn Mahran said:                      I came out to perform umrah in the year when the people of Syria besieged Ibn az-Zubayr at Mecca. Some people of my tribe sent sacrificial animals with me as an offering. When we reached the people of Syria, they stopped us from entering the sacred territory. I, therefore, sacrificed the animals at the same spot. I then took off ihram and returned. Next year I came out to make an atonement for my umrah. I came to Ibn Abbas and asked him (about it). He said: Bring a new sacrificial animal, for the Messenger of Allah (ﷺ) ordered his companions to bring fresh sacrificial animals for the umrah of atonement in lieu of the animals they had sacrificed in the year of al-Hudaybiyyah.",
      "chain": [
        "30352",
        "20672",
        "11107",
        "11382"
      ]
    },
    {
      "hadith_no": "1904",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا النفيلي، حدثنا زهير، حدثنا عطاء بن السائب، عن كثير بن جمهان، أن رجلا، قال لعبد الله بن عمر بين الصفا والمروة يا أبا عبد الرحمن إني أراك تمشي والناس يسعون قال إن أمش فقد رأيت رسول الله صلى الله عليه وسلم يمشي وإن أسع فقد رأيت رسول الله صلى الله عليه وسلم يسعى وأنا شيخ كبير ‏.‏",
      "text_en": " Kathir ibn Jamhan said:                      A man asked Abdullah ibn Umar between as-Safa and al-Marwah: AbdurRahman, I see you walking while the people are running (between as-Safa and al-Marwah)? He replied: If I walk, I saw the Messenger of Allah (ﷺ) running. I am too old.",
      "chain": [
        "30352",
        "20321",
        "11068",
        "19939"
      ]
    }
  ],
  "total_hadiths": 136
}