{
  "id": "30359",
  "name": "'Ubaidullah bin Sa'id عبيد الله بن سعيد أبو قدامة السرخسي",
  "full_name": "'Ubaidullah bin Sa'id عبيد الله بن سعيد أبو قدامة السرخسي",
  "grade": "3rd Century AH [10th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "241",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Nisapur"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  م  س  -  ثقة ]"
    ],
    "tags": [
      "Nisapur",
      "al-Sarkhasi",
      "Hafiz"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20331",
      "name": "'Abdullah bin Numayr عبد الله بن نمير",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20022",
      "name": "Hammad bin Zayd حماد بن زيد بن درهم الأزدي الأزرق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20031",
      "name": "Yahya bin Sa'id bin Farroukh al-Qatan يحيى بن سعيد بن فروخ القطان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20033",
      "name": "'Abdur Rahman bin Mahdi عبد الرحمن بن مهدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20032",
      "name": "Waki' bin al-Jarrah وكيع بن الجراح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20733",
      "name": "al-Walid bin Muslim al-Quraishi الوليد بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20223",
      "name": "al-Hakam bin 'Abdullah الحكم بن عبد الله",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20318",
      "name": "Hammad bin Usamah حماد بن أسامة - أبو أسامة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20229",
      "name": "Ruh bin 'Ubada bin al-'Ala' روح بن عبادة بن العلاء",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "23033",
      "name": "'Abdullah bin Yazid al-'Advi عبد الله بن يزيد العدوي المقري القصير",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30106",
      "name": "'Affan bin Muslim عفان بن مسلم بن عبد الله الصفار",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20277",
      "name": "Muhammad bin Bakr bin 'Uthman al-Barsani محمد بن بكر بن عثمان البرساني",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20287",
      "name": "Mua'dh bin Hisham bin Aby معاذ بن هشام بن أبي عبد الله",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20291",
      "name": "al-Nadr bin Shumayl al-Maazni النضر بن شميل المازني أبو الحسن النحوي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20472",
      "name": "Yazid bin Harun يزيد بن هارون",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20298",
      "name": "Wahb bin Jarir bin Hazim bin Zayd وهب بن جرير بن حازم بن زيد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30006",
      "name": "Imam Nasa'i أحمد بن شعيب بن علي بن سنان النسائي",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30554",
      "name": "Abu Zara' al-Razi أبو زرعة الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30023",
      "name": "Muhammad bin Yahya bin Faris al-Dhahli محمد بن يحيى بن فارس الذهلي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30534",
      "name": "Ahmed bin Mnswr bin Rashid أحمد بن منصور بن راشد",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30327",
      "name": "al-Husain bin Muhammad bin Ziyad الحسين بن محمد بن زياد",
      "grade": "3rd Century AH [12th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1436",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا عبيد الله بن سعيد، حدثنا أبو النعمان الحكم  هو ابن عبد الله البصري  حدثنا شعبة، عن سليمان، عن أبي وائل، عن أبي مسعود  رضى الله عنه  قال لما نزلت آية الصدقة كنا نحامل، فجاء رجل فتصدق بشىء كثير فقالوا مرائي‏.‏ وجاء رجل فتصدق بصاع فقالوا إن الله لغني عن صاع هذا‏.‏ فنزلت ‏{‏الذين يلمزون المطوعين من المؤمنين في الصدقات والذين لا يجدون إلا جهدهم‏}‏ الآية‏.‏",
      "text_en": " Narrated Abu Mas`ud:                     When the verses of charity were revealed, we used to work as porters. A man came and distributed objects of charity in abundance. And they (the people) said, \"He is showing off.\" And another man came and gave a Sa (a small measure of food grains); they said, \"Allah is not in need of this small amount of charity.\" And then the Divine Inspiration came: \"Those who criticize such of the believers who give in charity voluntarily and those who could not find to give in charity except what is available to them.\" (9.79).",
      "chain": [
        "30359",
        "20020",
        "11060",
        "11353",
        "402"
      ]
    },
    {
      "hadith_no": "2531",
      "source": " Sahih Bukhari ",
      "chapter": "Manumission of Slaves - كتاب العتق",
      "chapter_no": "49",
      "text_ar": "حدثنا عبيد الله بن سعيد، حدثنا أبو أسامة، حدثنا إسماعيل، عن قيس، عن أبي هريرة  رضى الله عنه  قال لما قدمت على النبي صلى الله عليه وسلم قلت في الطريق يا ليلة من طولها وعنائها على أنها من دارة الكفر نجت قال وأبق مني غلام لي في الطريق  قال  فلما قدمت على النبي صلى الله عليه وسلم بايعته، فبينا أنا عنده إذ طلع الغلام، فقال لي رسول الله صلى الله عليه وسلم ‏\"‏ يا أبا هريرة، هذا غلامك ‏\"‏‏.‏ فقلت هو حر لوجه الله‏.‏ فأعتقته‏.‏ لم يقل أبو كريب عن أبي أسامة حر‏.‏",
      "text_en": " Narrated Abu Huraira:                     On my way to the Prophet I was reciting:-- 'What a long tedious tiresome night! Nevertheless, it has saved us From the land of Kufr (disbelief).' I had a slave who ran away from me on the way. When I went to the Prophet and gave the pledge of allegiance for embracing Islam, the slave showed up while I was still with the Prophet who remarked, \"O Abu Huraira! Here is your slave!\" I said, \"I manumit him for Allah's Sake,\" and so I freed him.",
      "chain": [
        "30359",
        "20318",
        "11418",
        "11046",
        "13"
      ]
    },
    {
      "hadith_no": "2591",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا عبيد الله بن سعيد، حدثنا عبد الله بن نمير، حدثنا هشام بن عروة، عن فاطمة، عن أسماء، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أنفقي ولا تحصي فيحصي الله عليك، ولا توعي فيوعي الله عليك ‏\"‏‏.‏",
      "text_en": " Narrated Asma:                     Allah's Apostle said, \"Give (in charity) and do not give reluctantly lest Allah should give you in a limited amount; and do not withhold your money lest Allah should withhold it from you.\"",
      "chain": [
        "30359",
        "20331",
        "11065",
        "10526",
        "70"
      ]
    },
    {
      "hadith_no": "2664",
      "source": " Sahih Bukhari ",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا عبيد الله بن سعيد، حدثنا أبو أسامة، قال حدثني عبيد الله، قال حدثني نافع، قال حدثني ابن عمر  رضى الله عنهما  أن رسول الله صلى الله عليه وسلم عرضه يوم أحد وهو ابن أربع عشرة سنة، فلم يجزني، ثم عرضني يوم الخندق وأنا ابن خمس عشرة فأجازني‏.‏ قال نافع فقدمت على عمر بن عبد العزيز وهو خليفة، فحدثته هذا الحديث، فقال إن هذا لحد بين الصغير والكبير‏.‏ وكتب إلى عماله أن يفرضوا لمن بلغ خمس عشرة‏.‏",
      "text_en": " Narrated Ibn `Umar:                     Allah's Apostle called me to present myself in front of him or the eve of the battle of Uhud, while I was fourteen years of age at that time, and he did not allow me to take part in that battle, but he called me in front of him on the eve of the battle of the Trench when I was fifteen years old, and he allowed me (to join the battle).\" Nafi` said, \"I went to `Umar bin `Abdul `Aziz who was Caliph at that time and related the above narration to him, He said, \"This age (fifteen) is the limit between childhood and manhood,\" and wrote to his governors to give salaries to those who reached the age of fifteen.",
      "chain": [
        "30359",
        "20318",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3907",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثني عبيد الله بن سعيد، حدثنا أبو أسامة، حدثنا مسعر، عن معن بن عبد الرحمن، قال سمعت أبي قال، سألت مسروقا من آذن النبي صلى الله عليه وسلم بالجن ليلة استمعوا القرآن‏.‏ فقال حدثني أبوك  يعني عبد الله  أنه آذنت بهم شجرة‏.‏",
      "text_en": " Narrated `Abdur-Rahman:                     \"I asked Masruq, 'Who informed the Prophet about the Jinns at the night when they heard the Qur'an?' He said, 'Your father `Abdullah informed me that a tree informed the Prophet about them.' \"",
      "chain": [
        "30359",
        "20318",
        "20359"
      ]
    },
    {
      "hadith_no": "3978",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا عبيد الله بن سعيد، حدثنا أبو أسامة، عن هشام، عن أبيه، عن عائشة  رضى الله عنها  قالت كان يوم بعاث يوما قدمه الله عز وجل لرسوله صلى الله عليه وسلم، فقدم رسول الله صلى الله عليه وسلم المدينة وقد افترق ملؤهم، وقتلت سراتهم في دخولهم في الإسلام‏.‏",
      "text_en": " Narrated `Aisha:                     The day of Bu'ath was a day (i.e. battle) which Allah caused to take place just before the mission of His Apostle so that when Allah's Apostle came to Medina, they (the tribes) had divided (into hostile groups) and their nobles had been killed; and all that facilitated their conversion to Islam.",
      "chain": [
        "30359",
        "20318",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "4114",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبيد الله بن سعيد، حدثنا أبو أسامة، عن هشام بن عروة، عن أبيه، عن عائشة  رضى الله عنها  قالت لما كان يوم أحد هزم المشركون، فصرخ إبليس لعنة الله عليه أى عباد الله أخراكم‏.‏ فرجعت أولاهم فاجتلدت هي وأخراهم فبصر حذيفة فإذا هو بأبيه اليمان فقال أى عباد الله أبي أبي‏.‏ قال قالت فوالله ما احتجزوا حتى قتلوه فقال حذيفة يغفر الله لكم‏.‏ قال عروة فوالله ما زالت في حذيفة بقية خير حتى لحق بالله‏.‏ بصرت علمت، من البصيرة في الأمر، وأبصرت من بصر العين ويقال بصرت وأبصرت واحد‏.‏",
      "text_en": " Narrated `Aisha:                     When it was the day of Uhud, the pagans were defeated. Then Satan, Allah's Curse be upon him, cried loudly, \"O Allah's Worshippers, beware of what is behind!\" On that, the front files of the (Muslim) forces turned their backs and started fighting with the back files. Hudhaifa looked, and on seeing his father Al-Yaman, he shouted, \"O Allah's Worshippers, my father, my father!\" But by Allah, they did not stop till they killed him. Hudhaifa said, \"May Allah forgive you.\" (The sub-narrator, `Urwa, said, \"By Allah, Hudhaifa continued asking Allah's Forgiveness for the killers of his father till he departed to Allah (i.e. died).\")",
      "chain": [
        "30359",
        "20318",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "4455",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبيد الله بن سعيد، حدثنا محمد بن بكر، حدثنا ابن جريج، أخبرني موسى بن عقبة، عن نافع، أخبره ابن عمر، أن النبي صلى الله عليه وسلم حلق في حجة الوداع وأناس من أصحابه وقصر بعضهم‏.‏",
      "text_en": " Narrated Ibn `Umar:                     During Hajjat-ul-Wada`, the Prophet and some of his companions got their heads shaved while some of his companions got their head-hair cut short.",
      "chain": [
        "30359",
        "20277",
        "11070",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "4461",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبيد الله بن سعيد، حدثنا محمد بن بكر، أخبرنا ابن جريج، قال سمعت عطاء، يخبر قال أخبرني صفوان بن يعلى بن أمية، عن أبيه، قال غزوت مع النبي صلى الله عليه وسلم العسرة قال كان يعلى يقول تلك الغزوة أوثق أعمالي عندي‏.‏ قال عطاء فقال صفوان قال يعلى فكان لي أجير فقاتل إنسانا فعض أحدهما يد الآخر، قال عطاء فلقد أخبرني صفوان أيهما عض الآخر فنسيته، قال فانتزع المعضوض يده من في العاض، فانتزع إحدى ثنيتيه، فأتيا النبي صلى الله عليه وسلم فأهدر ثنيته‏.‏ قال عطاء وحسبت أنه قال قال النبي صلى الله عليه وسلم ‏\"‏ أفيدع يده في فيك تقضمها، كأنها في في فحل يقضمها ‏\"‏‏.‏",
      "text_en": " Narrated Safwan bin Ya`la bin Umaiya:                     that his father said, \"I participated in Al-Usra (i.e. Tabuk) along with the Prophet.\" Ya`la added, \"(My participation in) that Ghazwa was the best of my deeds to me.\" Ya`la said, \"I had a laborer who quarrelled with somebody, and one of the two bit the hand of the other (`Ata', the sub-narrator, said, \"Safwan told me who bit whom but I forgot it\"), and the one who was bitten, pulled his hand out of the mouth of the biter, so one of the incisors of the biter was broken. So we came to the Prophet and he considered the biter's claim as invalid (i.e. the biter did not get a recompense for his broken incisor). The Prophet said, \"Should he leave his hand in your mouth so that you might snap it as if it were in the mouth of a male camel to snap it?\"",
      "chain": [
        "30359",
        "20277",
        "11070",
        "11248",
        "897"
      ]
    },
    {
      "hadith_no": "4571",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عبيد الله بن سعيد، حدثنا أبو عامر العقدي، حدثنا عباد بن راشد، حدثنا الحسن، قال حدثني معقل بن يسار، قال كانت لي أخت تخطب إلى‏.‏ وقال إبراهيم عن يونس، عن الحسن، حدثني معقل بن يسار،‏.‏ حدثنا أبو معمر، حدثنا عبد الوارث، حدثنا يونس، عن الحسن، أن أخت، معقل بن يسار طلقها زوجها، فتركها حتى انقضت عدتها، فخطبها فأبى معقل، فنزلت ‏{‏فلا تعضلوهن أن ينكحن أزواجهن‏}‏‏.‏",
      "text_en": " Narrated Al-Hasan:                     The sister of Ma'qal bin Yasar was divorced by her husband who left her till she had fulfilled her term of 'Iddat (i.e. the period which should elapse before she can Remarry) and then he wanted to remarry her but Maqal refused, so this Verse was revealed:-- \"Do not prevent them from marrying their (former) husbands.\" (2.232)",
      "chain": [
        "30359",
        "20443",
        "20242",
        "11016",
        "3120",
        "20150",
        "20475",
        "11016",
        "30315",
        "20258",
        "20475",
        "11016"
      ]
    },
    {
      "hadith_no": "7114",
      "source": " Sahih Bukhari ",
      "chapter": "Interpretation of Dreams - كتاب التعبير",
      "chapter_no": "92",
      "text_ar": "حدثني عبيد الله بن سعيد، حدثنا عفان بن مسلم، حدثنا صخر بن جويرية، حدثنا نافع، أن ابن عمر، قال إن رجالا من أصحاب رسول الله صلى الله عليه وسلم كانوا يرون الرؤيا على عهد رسول الله صلى الله عليه وسلم فيقصونها على رسول الله صلى الله عليه وسلم فيقول فيها رسول الله صلى الله عليه وسلم ما شاء الله، وأنا غلام حديث السن وبيتي المسجد قبل أن أنكح، فقلت في نفسي لو كان فيك خير لرأيت مثل ما يرى هؤلاء‏.‏ فلما اضطجعت ليلة قلت اللهم إن كنت تعلم في خيرا فأرني رؤيا‏.‏ فبينما أنا كذلك إذ جاءني ملكان في يد كل واحد منهما مقمعة من حديد، يقبلا بي إلى جهنم، وأنا بينهما أدعو الله اللهم أعوذ بك من جهنم‏.‏ ثم أراني لقيني ملك في يده مقمعة من حديد فقال لن تراع، نعم الرجل أنت لو تكثر الصلاة‏.‏ فانطلقوا بي حتى وقفوا بي على شفير جهنم فإذا هي مطوية كطى البئر، له قرون كقرن البئر، بين كل قرنين ملك بيده مقمعة من حديد، وأرى فيها رجالا معلقين بالسلاسل، رءوسهم أسفلهم، عرفت فيها رجالا من قريش، فانصرفوا بي عن ذات اليمين‏.‏",
      "text_en": " Narrated Ibn `Umar:                     Men from the companions of Allah's Apostle used to see dreams during the lifetime of Allah's Apostle and they used to narrate those dreams to Allah's Apostle. Allah's Apostle would interpret them as Allah wished. I was a young man and used to stay in the mosque before my wedlock. I said to myself, \"If there were any good in myself, I too would see what these people see.\" So when I went to bed one night, I said, \"O Allah! If you see any good in me, show me a good dream.\" So while I was in that state, there came to me (in a dream) two angels. In the hand of each of them, there was a mace of iron, and both of them were taking me to Hell, and I was between them, invoking Allah, \"O Allah! I seek refuge with You from Hell.\" Then I saw myself being confronted by another angel holding a mace of iron in his hand. He said to me, \"Do not be afraid, you will be an excellent man if you only pray more often.\" So they took me till they stopped me at the edge of Hell, and behold, it was built inside like a well and it had side posts like those of a well, and beside each post there was an angel carrying an iron mace. I saw therein many people hanging upside down with iron chains, and I recognized therein some men from the Quraish. Then (the angels) took me to the right side. I narrated this dream to (my sister) Hafsa and she told it to Allah's Apostle. Allah's Apostle said, \"No doubt, `Abdullah is a good man.\" (Nafi` said, \"Since then `Abdullah bin `Umar used to pray much.)",
      "chain": [
        "30359",
        "30106",
        "20429",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "39",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "وحدثنا عبيد الله بن سعيد، قال سمعت النضر، يقول سئل ابن عون عن حديث، لشهر وهو قائم على أسكفة الباب فقال إن شهرا نزكوه إن شهرا نزكوه ‏.‏ قال مسلم رحمه الله يقول أخذته ألسنة الناس تكلموا فيه ‏.‏",
      "text_en": "",
      "chain": [
        "30359",
        "20291"
      ]
    },
    {
      "hadith_no": "57",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "وحدثني عبيد الله بن سعيد، حدثنا عبد الرحمن، - يعني ابن مهدي - حدثنا حماد بن زيد، عن ابن عون، قال قال لنا إبراهيم إياكم والمغيرة بن سعيد وأبا عبد الرحيم فإنهما كذابان ‏.‏",
      "text_en": "",
      "chain": [
        "30359",
        "20033",
        "20022",
        "11071"
      ]
    },
    {
      "hadith_no": "161",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا عبيد الله بن سعيد، وعبد بن حميد، قالا حدثنا أبو عامر العقدي، حدثنا سليمان بن بلال، عن عبد الله بن دينار، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ الإيمان بضع وسبعون شعبة والحياء شعبة من الإيمان ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Huraira that the Prophet (may peace be upon him) said:                      Iman has over seventy branches, and modesty is a branch of Iman.",
      "chain": [
        "30359",
        "30553",
        "20443",
        "20160",
        "11183",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "489",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثني عبيد الله بن سعيد، وإسحاق بن منصور، كلاهما عن روح، قال عبيد الله حدثنا روح بن عبادة القيسي، حدثنا ابن جريج، قال أخبرني أبو الزبير، أنه سمع جابر بن عبد الله، يسأل عن الورود، فقال نجيء نحن يوم القيامة عن كذا، وكذا، انظر أى ذلك فوق الناس - قال - فتدعى الأمم بأوثانها وما كانت تعبد الأول فالأول ثم يأتينا ربنا بعد ذلك فيقول من تنظرون فيقولون ننظر ربنا ‏.‏ فيقول أنا ربكم ‏.‏ فيقولون حتى ننظر إليك ‏.‏ فيتجلى لهم يضحك - قال - فينطلق بهم ويتبعونه ويعطى كل إنسان منهم - منافق أو مؤمن - نورا ثم يتبعونه وعلى جسر جهنم كلاليب وحسك تأخذ من شاء الله ثم يطفأ نور المنافقين ثم ينجو المؤمنون فتنجو أول زمرة وجوههم كالقمر ليلة البدر سبعون ألفا لا يحاسبون ثم الذين يلونهم كأضوإ نجم في السماء ثم كذلك ثم تحل الشفاعة ويشفعون حتى يخرج من النار من قال لا إله إلا الله وكان في قلبه من الخير ما يزن شعيرة فيجعلون بفناء الجنة ويجعل أهل الجنة يرشون عليهم الماء حتى ينبتوا نبات الشىء في السيل ويذهب حراقه ثم يسأل حتى تجعل له الدنيا وعشرة أمثالها معها ‏.‏",
      "text_en": " It is reported on the authority of Abu Zubair that he heard from Jabir b 'Abdullah, who was asked about the arrival (of people on the Day of Resurrection). He said. We would come on the Day of Resurrection like this, like this, and see. carefully. that which concerns\" elevated people\". He (the narrator) said:                      Then the people would be summoned along with their idols whom they worshipped, one after another. Then our Lord would come to us and say: Whom are you waiting for? They would say: We are waiting for our Lord. He would say: I am your Lord. They would say: (We are not sure) till we gaze at Thee, and He would manifest Himself to them smilingly, and would go along with them and they would follow Him; and every person, whether a hypocrite or a believer, would be endowed with a light, and there would be spikes and hooks on the bridge of the Hell, which would catch hold of those whom Allah willed. Then the light of the hypocrites would be extinguished, and the believers would secure salvation. and the first group to achieve it would comprise seventy thousand men who would have the brightness of full moon on their faces, and they would not be called to account. Then the people immediately following them would have their faces as the brightest stars in the heaven. This is how (the groups would follow one after another). Then the stage of intercession would come, and they (who are permitted to intercede) would intercede, till he who had declared:\" There is no god but Allah\" and had in his heart virtue of the weight of a barley grain would come out of the Fire. They would be then brought in the courtyard of Paradise and the inhabitants of Paradise would begin to sprinkle water over them till they would sprout like the sprouting of a thing in flood water, and their burns would disappear. They would ask their Lord till they would be granted (the bounties) of the world and with it ten more besides it.",
      "chain": [
        "30359",
        "30313",
        "20229",
        "11201",
        "20229",
        "11070",
        "11263"
      ]
    },
    {
      "hadith_no": "450",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا سعيد بن محمد الجرمي، وعبيد الله بن سعيد، قالا حدثنا أبو أسامة، عن مسعر، عن معن، قال سمعت أبي قال، سألت مسروقا من آذن النبي صلى الله عليه وسلم بالجن ليلة استمعوا القرآن فقال حدثني أبوك - يعني ابن مسعود - أنه آذنته بهم شجرة ‏.‏",
      "text_en": " Ma'n reported.. I heard it from my father who said:                      I asked Masruq who informed the Messenger of Allah (may peace be upon him) about the night when they heard the Qur'an. He said: Your father, Ibn Mas'ud, narrated it to me that a tree informed him about that.",
      "chain": [
        "30195",
        "30359",
        "20318",
        "20359",
        "30112"
      ]
    },
    {
      "hadith_no": "1323",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثني زهير بن حرب، وعبيد الله بن سعيد، ومحمد بن المثنى، كلهم عن يحيى القطان، - قال زهير حدثنا يحيى بن سعيد، - عن عبيد الله، قال أخبرني نافع، عن ابن عمر، أن النبي صلى الله عليه وسلم كان يقرأ القرآن فيقرأ سورة فيها سجدة فيسجد ونسجد معه حتى ما يجد بعضنا موضعا لمكان جبهته ‏.‏",
      "text_en": " Ibn 'Umar reported:                      The Messenger of Allah (may peace be upon him) while reciting the Qur'an recited its scarab containing sajda, and he performed prostration and we also prostrated along with him (but we were so overcrowded) that some of us could not find a place for our forehead (when prostrating ourselves).",
      "chain": [
        "30022",
        "30359",
        "30170",
        "20031",
        "20321",
        "11062",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1395",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني محمد بن حاتم، وعبيد الله بن سعيد، قالا حدثنا يحيى بن سعيد، عن حجاج الصواف، حدثنا يحيى بن أبي كثير، عن أبي سلمة، وعبد الله بن أبي قتادة، عن أبي قتادة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا أقيمت الصلاة فلا تقوموا حتى تروني ‏\"‏ ‏.‏ وقال ابن حاتم ‏\"‏ إذا أقيمت أو نودي ‏\"‏ ‏.‏  وحدثنا أبو بكر بن أبي شيبة، حدثنا سفيان بن عيينة، عن معمر، قال أبو بكر وحدثنا ابن علية، عن حجاج بن أبي عثمان، ح قال وحدثنا إسحاق بن إبراهيم، أخبرنا عيسى بن يونس، وعبد الرزاق، عن معمر، وقال، إسحاق أخبرنا الوليد بن مسلم، عن شيبان، كلهم عن يحيى بن أبي كثير، عن عبد الله بن أبي قتادة، عن أبيه، عن النبي صلى الله عليه وسلم ‏.‏ وزاد إسحاق في روايته حديث معمر وشيبان ‏\"‏ حتى تروني قد خرجت ‏\"‏ ‏.‏",
      "text_en": " Abu Qatada reported:                      The Messenger of Allah (may peace be upon him) said: When the Iqama is pronounced do not get up till you see me Ibn Hatim was in doubt whether it was said:\" When the Iqama is pronounced\" or\" When call is made\".",
      "chain": [
        "38487",
        "30359",
        "20031",
        "11449",
        "10567",
        "11804",
        "391"
      ]
    },
    {
      "hadith_no": "1625",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثناه ابن المثنى، وعبيد الله بن سعيد، قالا حدثنا يحيى، وهو القطان ح وحدثناه أبو كريب، أخبرنا ابن أبي زائدة، ح وحدثناه ابن نمير، حدثنا عقبة بن خالد، كلهم عن عبيد الله، بهذا الإسناد نحوه ‏.‏",
      "text_en": " A hadith like this has been narrated by the same chain of transmitters.",
      "chain": [
        "30359",
        "20031",
        "20031",
        "30216",
        "20366",
        "30212",
        "20344"
      ]
    },
    {
      "hadith_no": "1710",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا يحيى بن يحيى، وقتيبة، وابن، رمح عن الليث بن سعد، ح وحدثني زهير بن حرب، وعبيد الله بن سعيد، قالا حدثنا يحيى، عن عبيد الله، ح وحدثني زهير بن حرب، حدثنا إسماعيل، عن أيوب، كلهم عن نافع، بهذا الإسناد كما قال مالك ‏.‏",
      "text_en": " This hadith has been transmitted by Nafi' with the same chain of narrators.",
      "chain": [
        "30399",
        "30367",
        "30490",
        "20023",
        "30022",
        "30359",
        "20031",
        "11201",
        "30022",
        "20208"
      ]
    },
    {
      "hadith_no": "1731",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني زهير بن حرب، وعبيد الله بن سعيد، قالا حدثنا يحيى، - وهو ابن سعيد - عن عبيد الله، قال أخبرني نافع، عن ابن عمر، ح",
      "text_en": "",
      "chain": [
        "30022",
        "30359",
        "20031",
        "11201",
        "11014"
      ]
    },
    {
      "hadith_no": "1731",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني زهير بن حرب، وعبيد الله بن سعيد، قالا حدثنا يحيى، - وهو ابن سعيد - عن عبيد الله، قال أخبرني نافع، عن ابن عمر، ح  وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، حدثنا عبيد الله، عن نافع، عن ابن عمر، قال صليت مع رسول الله صلى الله عليه وسلم قبل الظهر سجدتين وبعدها سجدتين وبعد المغرب سجدتين وبعد العشاء سجدتين وبعد الجمعة سجدتين فأما المغرب والعشاء والجمعة فصليت مع النبي صلى الله عليه وسلم في بيته ‏.‏",
      "text_en": " Ibn 'Umar reported:                      I prayed along with Allah's Messenger (may peace be upon him) two rak'ahs before and two rak'ahs after the noon prayer, two rak'ahs after the sunset prayer and two rak'ahs after the 'Isha' prayer and two rak'ahs after the Friday prayer; and so far as the sunset, 'Isha' and Friday prayers are concerned, I observed (them) along with the Apostle of Allah (may peace be upon him) in his house.",
      "chain": [
        "30022",
        "30359",
        "20031",
        "11201",
        "11014",
        "18",
        "30201",
        "20318",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1876",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا زهير بن حرب، ومحمد بن المثنى، وعبيد الله بن سعيد، قالوا حدثنا يحيى، وهو القطان ح وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو خالد الأحمر، ح وحدثنا ابن نمير، حدثنا أبي كلهم، عن عبيد الله، ح وحدثنا ابن أبي عمر، حدثنا عبد الرزاق، أخبرنا معمر، عن أيوب، ح وحدثنا قتيبة بن سعيد، حدثنا يعقوب يعني ابن عبد الرحمن، ح وحدثنا محمد بن إسحاق المسيبي حدثنا أنس، - يعني ابن عياض - جميعا عن موسى بن عقبة، كل هؤلاء عن نافع، عن ابن عمر، عن النبي ‏.‏ بمعنى حديث مالك وزاد في حديث موسى بن عقبة ‏\"‏ وإذا قام صاحب القرآن فقرأه بالليل والنهار ذكره وإذا لم يقم به نسيه ‏\"‏",
      "text_en": " 'Abdullah reported Allah's Messenger (may peace be upon him) as saying:                      What a wretched person is he amongst them who says: I have forgotten such and such a verse. (He should instead of using this expression say): I have been made to forget it. Try to remember the Qur'an for it is more apt to escape from men's minds than a hobbled camel.",
      "chain": [
        "30022",
        "30170",
        "30359",
        "20031",
        "20031",
        "30201",
        "20326",
        "30212",
        "11201",
        "30421",
        "20121",
        "20115",
        "11015",
        "30367"
      ]
    },
    {
      "hadith_no": "2275",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثناه محمد بن أبي بكر المقدمي، وعبيد الله بن سعيد، قالا حدثنا يحيى، - وهو القطان - عن شعبة، بهذا الإسناد ‏.‏",
      "text_en": " This hadith has been narrated by Shu'ba with the same chain of transmitters.",
      "chain": [
        "30161",
        "30359",
        "20031"
      ]
    },
    {
      "hadith_no": "2553",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا عبيد الله بن سعيد، حدثنا يحيى بن سعيد، عن عبيد الله، بهذا الإسناد وقال ذكر رسول الله صلى الله عليه وسلم رمضان فقال ‏\"‏ الشهر تسع وعشرون الشهر هكذا وهكذا وهكذا ‏\"‏ ‏.‏ وقال ‏\"‏ فاقدروا له ‏\"‏ ‏.‏ ولم يقل ‏\"‏ ثلاثين ‏\"‏ ‏.‏",
      "text_en": " 'Ubaidullah narrated on the authority of the same chain of transmitters that the Messenger of Allah (may peace be upon him) made a mention of Ramadan and said:                      The month may consist of twenty-nine days, and it may be thus, thus and thus, and (he further) said: Calculate it, but he did not say thirty.",
      "chain": [
        "30359",
        "20031"
      ]
    },
    {
      "hadith_no": "3103",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثني زهير بن حرب، وعبيد الله بن سعيد، قالا حدثنا يحيى، - وهو القطان - عن عبيد الله، أخبرني نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم بات بذي طوى حتى أصبح ثم دخل مكة ‏.‏ قال وكان عبد الله يفعل ذلك ‏.‏ وفي رواية ابن سعيد حتى صلى الصبح ‏.‏ قال يحيى أو قال حتى أصبح ‏.‏",
      "text_en": " Ibn Umar (Allah be pleased with him) reported that Allah's Messenger may peace be upon him) spent the night at Dhi Tuwa till it was dawn and then entered Mecca. 'Abdullah (b. 'Umar) himself did like it. And in the narration transmitted by Ibn Sa'ld (the words are):                      Until he obrerved the dawn prayer. Yahya (another narrator) said: Until it was dawn.",
      "chain": [
        "30022",
        "30359",
        "20031",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3444",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنيه زهير بن حرب، وعبيد الله بن سعيد، ومحمد بن حاتم، قالوا حدثنا يحيى، القطان عن يحيى بن سعيد، بهذا الإسناد ‏.‏",
      "text_en": "  This hadith has been narrated by Yabya b. Sa'id with the same chain of transmitters.",
      "chain": [
        "30359",
        "38487",
        "20031"
      ]
    },
    {
      "hadith_no": "3531",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثني زهير بن حرب، ومحمد بن المثنى، وعبيد الله بن سعيد، قالوا حدثنا يحيى، عن عبيد الله، عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم ‏.‏ بمثله غير أن في حديث عبيد الله قال قلت لنافع ما الشغار.",
      "text_en": " A hadith like this has been narrated on the authority of\" Abdullah b. 'Umar (Allah be pleased with them) but with a slight variation of words.",
      "chain": [
        "30022",
        "30170",
        "30359",
        "20031",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3638",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "حدثنا عبيد الله بن سعيد، ومحمد بن أبي عمر، قالا حدثنا المقرئ، حدثنا سعيد، بن أبي أيوب حدثني أبو الأسود، عن عروة، عن عائشة، عن جدامة بنت وهب، أخت عكاشة قالت حضرت رسول الله صلى الله عليه وسلم في أناس وهو يقول ‏\"‏ لقد هممت أن أنهى عن الغيلة فنظرت في الروم وفارس فإذا هم يغيلون أولادهم فلا يضر أولادهم ذلك شيئا ‏\"‏ ‏.‏ ثم سألوه عن العزل فقال رسول الله صلى الله عليه وسلم ‏\"‏ ذلك الوأد الخفي ‏\"‏ ‏.‏ زاد عبيد الله في حديثه عن المقرئ وهى ‏{‏ وإذا الموءودة سئلت‏}‏",
      "text_en": " Judama daughter of Wahb, sister of Ukkasha (Allah be pleased with her). reported:                      I went to Allah's Messenger (may peace be upon him) along with some persons and he was saying: I intended to prohibit cohabitation with the suckling women, but I considered the Greeks and Persians, and saw that they suckle their children and this thing (cohabitation) does not do any harm to them (to the suckling women). Then they asked him about 'azl, whereupon he said. That is the secret (way of) burying alive, and Ubaidullah has made this addition in the hadith transmitted by al-Muqri and that is:\" When the one buried alive is asked.\"",
      "chain": [
        "30359",
        "20375",
        "11114",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "3708",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "حدثنا زهير بن حرب، ومحمد بن المثنى، وعبيد الله بن سعيد، قالوا حدثنا يحيى، بن سعيد عن عبيد الله، أخبرني سعيد بن أبي سعيد، عن أبيه، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ تنكح المرأة لأربع لمالها ولحسبها ولجمالها ولدينها فاظفر بذات الدين تربت يداك ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      A woman may be married for four reasons: for her property, her status. her beauty and her religion, so try to get one who is religious, may your hand be besmeared with dust.",
      "chain": [
        "30022",
        "30170",
        "30359",
        "20031",
        "11201",
        "11168",
        "11212",
        "13"
      ]
    },
    {
      "hadith_no": "3827",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Invoking Curses - كتاب اللعان",
      "chapter_no": "20",
      "text_ar": "وحدثناه محمد بن المثنى، وعبيد الله بن سعيد، قالا حدثنا يحيى، - وهو القطان - عن عبيد الله، بهذا الإسناد ‏.‏",
      "text_en": " A hadith like this has been narrated on the authority of 'Ubaidulah with the same chain of transmitters.",
      "chain": [
        "30170",
        "30359",
        "20031"
      ]
    },
    {
      "hadith_no": "4625",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، عن أبي التياح، عن أنس، ح. وحدثنا أبو بكر بن أبي شيبة، حدثنا عبيد الله بن سعيد، ح وحدثنا محمد بن، الوليد حدثنا محمد بن جعفر، كلاهما عن شعبة، عن أبي التياح، قال سمعت أنس بن مالك، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ يسروا ولا تعسروا وسكنوا ولا تنفروا ‏\"‏.",
      "text_en": " The Messenger of Allah (may peace he upon him) has been reported by Anas b. Malik to have said:                      Show leniency; do not be hard; give solace and do not create aversion.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11317",
        "19",
        "30201",
        "30359",
        "30174",
        "20173",
        "20020",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "4632",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "وحدثناه إسحاق بن إبراهيم، أخبرنا النضر بن شميل، ح وحدثني عبيد الله، بن سعيد حدثنا عبد الرحمن، جميعا عن شعبة، في هذا الإسناد ‏.‏ وليس في حديث عبد الرحمن ‏\"‏ يقال هذه غدرة فلان ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Shu'ba with a slight variation of wording.",
      "chain": [
        "30123",
        "20291",
        "30359"
      ]
    },
    {
      "hadith_no": "4634",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا محمد بن المثنى، وعبيد الله بن سعيد، قالا حدثنا عبد الرحمن بن مهدي، عن شعبة، عن ثابت، عن أنس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لكل غادر لواء يوم القيامة يعرف به ‏\"‏ ‏.‏",
      "text_en": " Anas reported Allah's Messenger (may peace be upon him) having said this:                      There would be a flag for every perfidious person on the Day of Judgment by which he will be recognised.",
      "chain": [
        "30170",
        "30359",
        "20033",
        "20020",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "4635",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا محمد بن المثنى، وعبيد الله بن سعيد، قالا حدثنا عبد الرحمن، حدثنا شعبة، عن خليد، عن أبي نضرة، عن أبي سعيد، عن النبي صلى الله عليه وسلم قال ‏\"‏ لكل غادر لواء عند استه يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Sa'id that the Messenger of Allah (may peace be upon him) said:                      On the Day of Judgment there will be a flag fixed behind the buttocks of every person guilty of the breach of faith.",
      "chain": [
        "30170",
        "30359",
        "20033",
        "20020",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "4822",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا عبيد الله بن سعيد، ومحمد بن حاتم، - واللفظ لابن حاتم - قالا حدثنا يحيى بن سعيد القطان، حدثنا قرة بن خالد، حدثنا حميد بن هلال، حدثني أبو بردة، قال قال أبو موسى أقبلت إلى النبي صلى الله عليه وسلم ومعي رجلان من الأشعريين أحدهما عن يميني والآخر عن يساري فكلاهما سأل العمل والنبي صلى الله عليه وسلم يستاك فقال ‏\"‏ ما تقول يا أبا موسى أو يا عبد الله بن قيس ‏\"‏ ‏.‏ قال فقلت والذي بعثك بالحق ما أطلعاني على ما في أنفسهما وما شعرت أنهما يطلبان العمل ‏.‏ قال وكأني أنظر إلى سواكه تحت شفته وقد قلصت فقال ‏\"‏ لن أو لا نستعمل على عملنا من أراده ولكن اذهب أنت يا أبا موسى أو يا عبد الله بن قيس ‏\"‏ ‏.‏ فبعثه على اليمن ثم أتبعه معاذ بن جبل فلما قدم عليه قال انزل وألقى له وسادة وإذا رجل عنده موثق قال ما هذا قال هذا كان يهوديا فأسلم ثم راجع دينه دين السوء فتهود قال لا أجلس حتى يقتل قضاء الله ورسوله فقال اجلس نعم ‏.‏ قال لا أجلس حتى يقتل قضاء الله ورسوله ثلاث مرات ‏.‏ فأمر به فقتل ثم تذاكرا القيام من الليل فقال أحدهما معاذ أما أنا فأنام وأقوم وأرجو في نومتي ما أرجو في قومتي ‏.‏",
      "text_en": " It has been reported on the authority of Abu Musa who said:                      I went to the Holy Prophet (may peace be upon him) and with me were two men from the Ash'ari tribe. One of them was on my right hand and the other on my left. Both of them made a request for a position (of authority) while the Holy Prophet (may peace be upon him) was brushing his teeth with a tooth-stick. He said (to me): Abu Musa (or 'Abdullah b. Qais), what do you say (about the request they have made)? I said: By God Who sent thee on thy mission with truth, they did not disclose to me what they had in their minds, and I did not know that they would ask for a position. The narrator says (while recalling this hadith): I visualise as if I were looking at the miswak of the Holy Prophet (may peace be upon him) between his lips. He (the Holy Prophet) said: We shall not or shall never appoint to the public offices (in our State) those who with to have them, but you may go, Abu Musa (or Abdullah b. Qais) (to take up your assignment). He sent him to Yemen as governor. then he sent Mu'adh b. jabal in his wake (to help him in the discharge of duties). When Mu'adh reached the camp of Abu Musa, the latter (received him and) said: Please get yourself down; and he spread for him a mattress, while there was a man bound hand and foot as a prisoner. Mu'adh said: Who is this? Abu Musa said: He was a Jew. He embraced Islam. Then he reverted to his false religion and became a Jew. Mu'adh said: I won't sit until he is killed according to the decree of Allah and His Apostle (may peace be upon him) (in this case). Abu Musa said: Be seated. It will be done. He said: I won't sit unless he is killed in accordance with the decree of Allah and His Apostle (may peace be upon him). He repeated these words thrice. Then Abu Musa ordered him (to be killed) and he was kilied. Then the two talked of standing in prayer at night. One of them, i. e. Mu'adh, said: I sleep (for a part of the night) and stand in prayer (for a part) and I hope that I shall get the same reward for steeping as I shall get for standing (in prayer).",
      "chain": [
        "30359",
        "38487",
        "20031",
        "11301",
        "11281",
        "1820"
      ]
    },
    {
      "hadith_no": "4829",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، ح وحدثنا ابن نمير، حدثنا أبي ح، وحدثنا ابن المثنى، حدثنا خالد يعني ابن الحارث، ح وحدثنا عبيد الله بن سعيد، حدثنا يحيى، - يعني القطان - كلهم عن عبيد الله بن عمر، ح وحدثنا أبو الربيع، وأبو كامل قالا حدثنا حماد بن زيد، ح وحدثني زهير بن حرب، حدثنا إسماعيل، جميعا عن أيوب، ح وحدثني محمد بن رافع، حدثنا ابن أبي فديك، أخبرنا الضحاك، - يعني ابن عثمان - ح وحدثنا هارون بن سعيد الأيلي، حدثنا ابن وهب، حدثني أسامة، كل هؤلاء عن نافع، عن ابن عمر، مثل حديث الليث عن نافع، ‏.‏",
      "text_en": " This tradition has been narrated through more; than one chain of transmitters.",
      "chain": [
        "30201",
        "20352",
        "30212",
        "20331",
        "20226",
        "30359",
        "11201",
        "30137",
        "20022"
      ]
    },
    {
      "hadith_no": "4952",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا محمد بن المثنى، وعبيد الله بن سعيد، قالا حدثنا يحيى، - وهو القطان - جميعا عن عبيد الله، ح وحدثني علي بن حجر، وأحمد بن عبدة، وابن أبي عمر، قالوا حدثنا سفيان، عن إسماعيل بن أمية، ح وحدثني محمد بن رافع، حدثنا عبد الرزاق، أخبرنا  ابن جريج، أخبرني موسى بن عقبة، ح وحدثنا هارون بن سعيد الأيلي، حدثنا ابن وهب، أخبرني أسامة، - يعني ابن زيد - كل هؤلاء عن نافع، عن ابن عمر، بمعنى حديث مالك عن نافع، ‏.‏ وزاد في حديث أيوب من رواية حماد وابن علية قال عبد الله فجئت سابقا فطفف بي الفرس المسجد ‏.‏",
      "text_en": "",
      "chain": [
        "30170",
        "30359",
        "11201",
        "20387",
        "30423",
        "30421",
        "20005",
        "11417",
        "30375",
        "20121",
        "11070",
        "11106"
      ]
    },
    {
      "hadith_no": "4954",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا قتيبة، وابن، رمح عن الليث بن سعد، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، وعبد الله بن نمير، ح وحدثنا ابن نمير، حدثنا أبي ح، وحدثنا عبيد، الله بن سعيد حدثنا يحيى، كلهم عن عبيد الله، ح وحدثنا هارون بن سعيد الأيلي، حدثنا  ابن وهب، حدثني أسامة، كلهم عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم ‏.‏ بمثل حديث مالك عن نافع ‏.‏",
      "text_en": " The same tradition has been handed down through a different chain of transmitters.",
      "chain": [
        "30367",
        "30490",
        "20023",
        "30201",
        "20345",
        "20331",
        "30212",
        "20331",
        "30359",
        "11201",
        "30492",
        "20029"
      ]
    },
    {
      "hadith_no": "5142",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثنا عبيد الله بن سعيد، حدثنا يحيى، عن عبيد الله، بمثله في هذا الإسناد ‏.‏",
      "text_en": " This hadith has been narrated on the authority of 'Ubaidullah with the same chain of transmitters.",
      "chain": [
        "30359",
        "20031"
      ]
    },
    {
      "hadith_no": "5493",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا زهير بن حرب، ومحمد بن المثنى، وعبيد الله بن سعيد، قالوا أخبرنا يحيى، - وهو القطان - عن عبيد الله، أخبرني نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏\"‏ الكافر يأكل في سبعة أمعاء والمؤمن يأكل في معى واحد ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Umar reported Allah's Messenger (may peace be upon him) as saying that a non-Muslim eats in seven intestines whereas a Muslim eats in one intestine.",
      "chain": [
        "30022",
        "30170",
        "30359",
        "20031",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "5575",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن نمير، وأبو أسامة ح وحدثنا ابن نمير، حدثنا أبي ح، وحدثنا محمد بن المثنى، وعبيد الله بن سعيد، قالا حدثنا يحيى،- وهو القطان - كلهم عن عبيد الله، ح وحدثنا أبو الربيع، وأبو كامل قالا حدثنا حماد،ح وحدثني زهير بن حرب، حدثنا إسماعيل، كلاهما عن أيوب، ح وحدثنا قتيبة، وابن، رمحعن الليث بن سعد، ح وحدثنا هارون الأيلي، حدثنا ابن وهب، حدثني أسامة، كل هؤلاءعن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم بمثل حديث مالك وزادوا فيه ‏\"‏يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Ibn 'Umar through other chains of transmitters also with the addition of these words:                     \" On the Day of Resurrection.\"",
      "chain": [
        "30201",
        "20331",
        "20318",
        "30212",
        "20331",
        "30170",
        "30359",
        "11201",
        "30137",
        "30022"
      ]
    },
    {
      "hadith_no": "5824",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، وابن، نمير ح وحدثنا ابن، نمير حدثنا أبي ح، وحدثنا محمد بن المثنى، وعبيد الله بن سعيد، قالا حدثنا يحيى، - وهو ابن سعيد - كلهم عن عبيد الله، ح وحدثنا قتيبة، وابن، رمح عن الليث بن سعد، ح وحدثنا  أبو الربيع، وأبو كامل قالا حدثنا حماد، عن أيوب، ح وحدثنا ابن المثنى، حدثنا محمد، بن جعفر حدثنا شعبة، قال سمعت أيوب بن موسى، كل هؤلاء عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم بمعنى حديث مالك ‏.‏",
      "text_en": " This hadith has been reported on the authority of lbn 'Umar through two different chains of transmitters.",
      "chain": [
        "30201",
        "20352",
        "30212",
        "30212",
        "20331",
        "30170",
        "30359",
        "20031",
        "11201",
        "30367",
        "30490",
        "20023",
        "30137"
      ]
    },
    {
      "hadith_no": "6054",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Vision - كتاب الرؤيا",
      "chapter_no": "43",
      "text_ar": "وحدثناه ابن المثنى، وعبيد الله بن سعيد، قالا حدثنا يحيى، عن عبيد الله، بهذا الإسناد ‏.‏",
      "text_en": " This hadith has been reported on tile authority of 'Ubaidullah with the same chain of transmitters.",
      "chain": [
        "30359",
        "20031"
      ]
    },
    {
      "hadith_no": "6125",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا زهير بن حرب، ومحمد بن المثنى، وعبيد الله بن سعيد، قالوا حدثنا يحيى، - وهو القطان - عن عبيد الله، أخبرني نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن أمامكم حوضا كما بين جربا وأذرح ‏\"‏ ‏.‏ وفي رواية ابن المثنى ‏\"‏ حوضي ‏\"‏ ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Ibn 'Umar and the words are:                      That he said there would be before you a Cistern extending from jarba' and Adhruh and the same has been transmitted on the authority of Ibn Muthanna and the wording is:\" My Cistern.\"",
      "chain": [
        "30022",
        "30170",
        "30359",
        "20031",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "6311",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا زهير بن حرب، ومحمد بن المثنى، وعبيد الله بن سعيد، قالوا حدثنا يحيى، بن سعيد عن عبيد الله، أخبرني سعيد بن أبي سعيد، عن أبيه، عن أبي هريرة، قال قيل يا رسول الله من أكرم الناس قال ‏\"‏ أتقاهم ‏\"‏ ‏.‏ قالوا ليس عن هذا نسألك ‏.‏ قال ‏\"‏ فيوسف نبي الله ابن نبي الله ابن نبي الله ابن خليل الله ‏\"‏ ‏.‏ قالوا ليس عن هذا نسألك ‏.‏ قال ‏\"‏ فعن معادن العرب تسألوني خيارهم في الجاهلية خيارهم في الإسلام إذا فقهوا ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      It was said to Allah's Messenger (may peace be upon him) as to who was the most worthy of respect amongst people. He said: The most God-conscious amongst you They said: It is not this that we are asking about, whereupon he said: Then he is Yusuf, the Apostle of Aliah and the son of Allah's Apostle, Ya'qub, who was also the son of Allah's Apostle, the friend of Allah (Ibrahim) They said: This is not what we are asking you. He said: You mean the tribes of Arabia? Those who are good in pre-Islamic days are good in Islam (after embracing Islam) when they get an understanding of it.",
      "chain": [
        "30022",
        "30170",
        "30359",
        "20031",
        "11201",
        "11168",
        "11212",
        "13"
      ]
    },
    {
      "hadith_no": "6332",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا عبيد الله بن سعيد، حدثنا يزيد بن هارون، أخبرنا إبراهيم بن سعد، حدثنا  صالح بن كيسان، عن الزهري، عن عروة، عن عائشة، قالت قال لي رسول الله صلى الله عليه وسلم في مرضه ‏\"‏ ادعي لي أبا بكر وأخاك حتى أكتب كتابا فإني أخاف أن يتمنى متمن ويقول قائل أنا أولى ‏.‏ ويأبى الله والمؤمنون إلا أبا بكر ‏\"‏ ‏.‏",
      "text_en": " A'isha reported that Allah's Messenger (may peace be upon him) in his (last) illness asked me to call Abu Bakr, her father, and her brother too, so that he might write a document, for he feared that someone else might be desirous (of succeeding him) and that some claimant may say:                      I have better claim to it, whereas Allah and the Faithful do not substantiate the claim of anyone but that of Abu Bakr.",
      "chain": [
        "30359",
        "20472",
        "20150",
        "11176",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "6361",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "وحدثناه محمد بن المثنى، وعبيد الله بن سعيد، قالا حدثنا يحيى، - وهو القطان - عن عبيد الله، بهذا الإسناد في معنى حديث أبي أسامة وزاد قال فترك الصلاة عليهم ‏.‏",
      "text_en": " This hadith has been narrated on the authority of 'Ubaidullah with the same chain of transmitter but with the addition of the words:                     \" He abandoned saying prayer over the hypocrites who had died.\"",
      "chain": [
        "30170",
        "30359",
        "20031"
      ]
    },
    {
      "hadith_no": "6658",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثني زهير بن حرب، وعبيد الله بن سعيد، قالا حدثنا وهب بن جرير، حدثنا  أبي، سمعت حرملة المصري، يحدث عن عبد الرحمن بن شماسة، عن أبي بصرة، عن أبي، ذر قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إنكم ستفتحون مصر وهي أرض يسمى فيها القيراط فإذا فتحتموها فأحسنوا إلى أهلها فإن لهم ذمة ورحما ‏\"‏ ‏.‏ أو قال ‏\"‏ ذمة وصهرا فإذا رأيت رجلين يختصمان فيها في موضع لبنة فاخرج منها ‏\"‏ ‏.‏ قال فرأيت عبد الرحمن بن شرحبيل بن حسنة وأخاه ربيعة يختصمان في موضع لبنة فخرجت منها ‏.‏",
      "text_en": " Abu Dharr reported Allah's Messenger (may peace be upon him) as saying:                      You would soon conquer Egypt and that is a land which is known (as the land of al-qirat). So when you conquer it, treat its inhabitants well. For there lies upon you the responsibility because of blood-tie or relationship of marriage (with them). And when you see two persons falling into dispute amongst themselves for the space of a brick, than get out of that. He (Abu Dharr) said: I saw Abd al-Rahman b. Shurahbil b. Hasana and his brother Rabi'a disputing with one another for the space of a brick. So I left that (land).",
      "chain": [
        "30022",
        "30359",
        "20298",
        "11272",
        "10867",
        "23"
      ]
    },
    {
      "hadith_no": "6772",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا محمد بن عبد الأعلى، حدثنا المعتمر، ح وحدثني عبيد الله بن سعيد، حدثنا  يحيى، - يعني ابن سعيد - جميعا عن سليمان التيمي، بهذا الإسناد وزاد في حديث المعتمر ‏\"‏ لا ايم الله لا تصاحبنا راحلة عليها لعنة من الله ‏\"‏ ‏.‏ أو كما قال ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Sulaiman Taimi with the same chain of transmitters but with a variation of words (and that is):                     \" By Allah, let that accompany us not which has been damned, or he said like it.\"",
      "chain": [
        "30449",
        "20288",
        "30359"
      ]
    },
    {
      "hadith_no": "7204",
      "source": " Sahih Muslim ",
      "chapter": "Pertaining To The Charateristics Of The Hypocrites And Command Concerning Them - كتاب صفات المنافقين وأحكامهم",
      "chapter_no": "52",
      "text_ar": "حدثنا محمد بن المثنى، وعبيد الله بن سعيد، قالا حدثنا يحيى، - وهو القطان - عن عبيد الله، بهذا الإسناد نحوه وزاد قال فترك الصلاة عليهم ‏.‏",
      "text_en": " This hadith has been narrated on the authority of 'Abdullah with the same chain of transmitters but with this addition:                     \" He then abandoned offering (funeral) prayer for them.\"",
      "chain": [
        "30170",
        "30359",
        "20031"
      ]
    },
    {
      "hadith_no": "7260",
      "source": " Sahih Muslim ",
      "chapter": "The Book Giving Description of the Day of Judgement; Paradise and Hell - كتاب صفة القيامة والجنة والنار",
      "chapter_no": "53",
      "text_ar": "وحدثني عبيد الله بن سعيد، حدثنا أبو أسامة، عن الأعمش، حدثنا سعيد بن، جبير عن أبي عبد الرحمن السلمي، قال قال عبد الله بن قيس قال رسول الله صلى الله عليه وسلم ‏\"‏ ما أحد أصبر على أذى يسمعه من الله تعالى إنهم يجعلون له ندا ويجعلون له ولدا وهو مع ذلك يرزقهم ويعافيهم ويعطيهم ‏\"‏ ‏.‏",
      "text_en": " Abdullah b. Qais reported from Allah's Messenger (may peace be upon him) that none is more forbearing in listening to the most irksome things than Allah, the Exalted. They associate rivals with him, attribute sonhood to Him, but in spite of this He provides them sustenance, grants them safety, confers upon them so many things.",
      "chain": [
        "30359",
        "20318",
        "11060",
        "11050",
        "11359"
      ]
    },
    {
      "hadith_no": "7375",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "حدثنا عبيد الله بن سعيد، وأبو بكر بن نافع وعبد بن حميد قالوا حدثنا أبو عامر العقدي حدثنا أفلح بن سعيد، حدثني عبد الله بن رافع، مولى أم سلمة قال سمعت  أبا هريرة، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن طالت بك مدة أوشكت أن ترى قوما يغدون في سخط الله ويروحون في لعنته في أيديهم مثل أذناب البقر ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      If you live for a time, you would certainly see people get up (in the morning) in the wrath of Allah and getting into the evening under the curse of Allah, and there would be in their hands (whips) like the tail of an ox.",
      "chain": [
        "30359",
        "20443",
        "20501",
        "11864",
        "13"
      ]
    },
    {
      "hadith_no": "7382",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "حدثنا زهير بن حرب، ومحمد بن المثنى، وعبيد الله بن سعيد، قالوا حدثنا يحيى، - يعنون ابن سعيد - عن عبيد الله، أخبرني نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم ‏{‏ يوم يقوم الناس لرب العالمين‏}‏ قال ‏\"‏ يقوم أحدهم في رشحه إلى أنصاف أذنيه ‏\"‏ ‏.‏ وفي رواية ابن المثنى قال ‏\"‏ يقوم الناس ‏\"‏ ‏.‏ لم يذكر يوم ‏.‏",
      "text_en": " Ibn 'Umar reported Allah's Apostle (may peace be upon him) as saying:                      When the people would stand before Allah. the Lord of the worlds, each one of them would stand submerged into perspiration up to half of his ears, and there is no mention of the\" day\" in the badlth transmitted on the authority of Ibn Muthanni.",
      "chain": [
        "30022",
        "30170",
        "30359",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "7520",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "وحدثناه محمد بن المثنى، وعبيد الله بن سعيد، قالا حدثنا يحيى، عن عبيد الله، بهذا الإسناد ‏.‏ وقال في حديثه ‏\"‏ هذا يهودي ورائي ‏\"‏ ‏.‏",
      "text_en": " Ubaidullah has reported this hadith with this chain of transmitters (and the Words are):                     \" There is a Jew behind me.\"",
      "chain": [
        "30170",
        "30359",
        "20031"
      ]
    },
    {
      "hadith_no": "15",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا يحيى، - هو ابن سعيد - عن عبيد الله، أخبرني نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏\"‏ أحفوا الشوارب وأعفوا اللحى ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that the Prophet (ﷺ) said:                      \"Trim the mustache and let the beard grow.\"",
      "chain": [
        "30359",
        "20031",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "34",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال أنبأنا معاذ بن هشام، قال حدثني أبي، عن قتادة، عن عبد الله بن سرجس، أن نبي الله صلى الله عليه وسلم قال ‏\"‏ لا يبولن أحدكم في جحر ‏\"‏ ‏.‏ قالوا لقتادة وما يكره من البول في الجحر قال يقال إنها مساكن الجن ‏.‏",
      "text_en": " It was narrated from Qatadah, from 'Abdullah bin Sarjis, that the Prophet of Allah (ﷺ) said:                      \"None of you should urinate into a burrow in the ground.\" They said to Qatadah: \"Why is it disliked to urinate into a burrow in the ground?\" He said: \"It is said that these are dwelling-places of the jinn.\"",
      "chain": [
        "30359",
        "20287",
        "20295",
        "11019",
        "3245"
      ]
    },
    {
      "hadith_no": "134",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا يحيى، عن سفيان، قال حدثنا علقمة بن مرثد، عن ابن بريدة، عن أبيه، قال كان رسول الله صلى الله عليه وسلم يتوضأ لكل صلاة فلما كان يوم الفتح صلى الصلوات بوضوء واحد فقال له عمر فعلت شيئا لم تكن تفعله ‏.‏ قال ‏\"‏ عمدا فعلته يا عمر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn Buraidah that his father said:                      \"The Messenger of Allah (ﷺ) used to perform Wudu' for every prayer. One the day of the Conquest (of Makkah), he offered all the prayers with one Wudu'. 'Umar said to him: 'You have done something that you never did before.' He said: 'I did that deliberately, O 'Umar.'\"",
      "chain": [
        "30359",
        "20031",
        "20012",
        "11374",
        "11432",
        "3131"
      ]
    },
    {
      "hadith_no": "178",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا عبيد الله بن سعيد، وهارون بن عبد الله، قالا حدثنا حرمي، - وهو ابن عمارة بن أبي حفصة - قال حدثنا شعبة، عن عمرو بن دينار، قال سمعت يحيى بن جعدة، يحدث عن عبد الله بن عمرو القاري، عن أبي طلحة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ توضئوا مما غيرت النار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Talhah that the Messenger of Allah (ﷺ) said:                      \"Perform Wudu' from that which has been altered by fire.\"",
      "chain": [
        "30359",
        "30524",
        "20221",
        "20020",
        "11081",
        "229"
      ]
    },
    {
      "hadith_no": "195",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال أنبأنا عبد الرحمن، عن زائدة، ح وأخبرنا إسحاق بن إبراهيم، - واللفظ له - أنبأنا أبو الوليد، حدثنا زائدة، عن الركين بن الربيع بن عميلة الفزاري، عن حصين بن قبيصة، عن علي، - رضى الله عنه - قال كنت رجلا مذاء فسألت النبي صلى الله عليه وسلم فقال ‏\"‏ إذا رأيت المذى فتوضأ واغسل ذكرك وإذا رأيت فضخ الماء فاغتسل ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Ali said:                      \"I was one who had a lot of prostatic discharge, so I asked the Prophet (ﷺ) and he said: 'If you see Madhi (prostatic fluid) then perform Wudu' and wash your penis, but if you see semen ejaculated, then perform Ghusl.'\"",
      "chain": [
        "30359",
        "20033",
        "20320",
        "30123",
        "20296",
        "20320",
        "10763",
        "15100",
        "5"
      ]
    },
    {
      "hadith_no": "261",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا يحيى، عن عبيد الله، قال أخبرني نافع، عن عبد الله بن عمر، أن عمر، قال يا رسول الله أينام أحدنا وهو جنب قال ‏\"‏ إذا توضأ ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin 'Umar that 'Umar said:                      \"O Messenger of Allah! May any one of us sleep while he is Junub?\" He said: \"When he performs Wudu'.\"",
      "chain": [
        "30359",
        "20031",
        "11201",
        "11014",
        "18",
        "3"
      ]
    },
    {
      "hadith_no": "263",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال حدثنا هشام بن عبد الملك، قال أنبأنا شعبة، ح وأنبأنا عبيد الله بن سعيد، قال حدثنا يحيى، عن شعبة، - واللفظ له - عن علي بن مدرك، عن أبي زرعة، عن عبد الله بن نجى، عن أبيه، عن علي، - رضى الله عنه - عن النبي صلى الله عليه وسلم قال ‏\"‏ لا تدخل الملائكة بيتا فيه صورة ولا كلب ولا جنب ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Ali that the Prophet (ﷺ) said:                      \"The angels do not enter a house where there is an image, a dog or a Junub person.\"",
      "chain": [
        "30123",
        "20020",
        "30359",
        "20031",
        "11377",
        "11406",
        "5"
      ]
    },
    {
      "hadith_no": "285",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، قال حدثنا هشام، ح وأنبأنا عبيد الله بن سعيد، وإسحاق بن إبراهيم، قالا حدثنا معاذ بن هشام، - واللفظ له - قال حدثني أبي، عن يحيى، قال حدثنا أبو سلمة، أن زينب بنت أبي سلمة، حدثته أن أم سلمة حدثتها قالت، بينما أنا مضطجعة، مع رسول الله صلى الله عليه وسلم في الخميلة إذ حضت فانسللت فأخذت ثياب حيضتي فقال رسول الله صلى الله عليه وسلم ‏\"‏ أنفست ‏\"‏ ‏.‏ قلت نعم فدعاني فاضطجعت معه في الخميلة ‏.‏",
      "text_en": " Umm Salamah narrated:                      \"While I was lying down with the Messenger of Allah (ﷺ) under a blanket, my period came, so I slipped away and put on the clothes I used to wear when I was menstruating. The Messenger of Allah (ﷺ) said: 'Are you menstruating?' I said: 'Yes.' Then he called me and I lied down with him under the blanket.\"",
      "chain": [
        "34033",
        "20423",
        "20295",
        "30359",
        "30123",
        "20287",
        "20295",
        "11449",
        "10567",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "294",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا يحيى بن سعيد، عن سفيان، قال حدثني أبو المقدام، ثابت الحداد عن عدي بن دينار، قال سمعت أم قيس بنت محصن، أنها سألت رسول الله صلى الله عليه وسلم عن دم الحيض يصيب الثوب قال ‏\"‏ حكيه بضلع واغسليه بماء وسدر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Adi bin Dinar said:                      \"I heard Umm Qais bint Mihsan say that she asked the Messenger of Allah (ﷺ) about menstrual blood that gets on one's clothes. He said: 'Scratch it with a stick and wash it with water and lotus leaves.'\"",
      "chain": [
        "30359",
        "20031",
        "20012",
        "12357",
        "827"
      ]
    },
    {
      "hadith_no": "371",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Menstruation and Istihadah - كتاب الحيض والاستحاضة",
      "chapter_no": "3",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا معاذ بن هشام، ح وأنبأنا إسحاق بن إبراهيم، قال أنبأنا معاذ بن هشام، قال حدثني أبي ح، وأنبأنا إسماعيل بن مسعود، قال حدثنا خالد، - وهو ابن الحارث - قال حدثنا هشام، عن يحيى بن أبي كثير، قال حدثني أبو سلمة، أن زينب بنت أبي سلمة، حدثته أن أم سلمة حدثتها قالت، بينما أنا مضطجعة، مع رسول الله صلى الله عليه وسلم إذ حضت فانسللت فأخذت ثياب حيضتي فقال رسول الله صلى الله عليه وسلم ‏\"‏ أنفست ‏\"‏ ‏.‏ قلت نعم فدعاني فاضطجعت معه في الخميلة ‏.‏ واللفظ لعبيد الله بن سعيد ‏.‏",
      "text_en": " Umm Salamah narrated:                      \"While I was lying down with the Messenger of Allah (ﷺ) under a blanket, my period came so I slipped away and put on the clothes I used to wear when I was menstruating. The Messenger of Allah (ﷺ) said: 'Are you menstruating?' I said: 'Yes.' Then he called me to lie down with him under the blanket.\" This is the wording of 'Ubaidullah bin Sa'eed.[1][1] That is, one of the narrators in one of the chains, as the author reported it throughdifferent chains, as he did when it preceded, see No. 284.",
      "chain": [
        "30359",
        "20287",
        "30123",
        "20287",
        "20295",
        "34033",
        "20226",
        "11065",
        "11449",
        "10567",
        "244"
      ]
    },
    {
      "hadith_no": "395",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Menstruation and Istihadah - كتاب الحيض والاستحاضة",
      "chapter_no": "3",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا يحيى، عن سفيان، قال حدثني أبو المقدام، ثابت الحداد عن عدي بن دينار، قال سمعت أم قيس بنت محصن، أنها سألت رسول الله صلى الله عليه وسلم عن دم الحيضة يصيب الثوب قال ‏\"‏ حكيه بضلع واغسليه بماء وسدر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Adi bin Dinar said:                      \"I heard Umm Qais bint Mihsan say that she asked the Messenger of Allah (ﷺ) about menstrual blood that gets on one's clothes. He said: 'Scratch it with a stick and wash it with water and lotus leaves.'\"",
      "chain": [
        "30359",
        "20031",
        "20012",
        "12357",
        "827"
      ]
    },
    {
      "hadith_no": "425",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Ghusl and Tayammum - كتاب الغسل والتيمم",
      "chapter_no": "4",
      "text_ar": "أخبرنا عبيد الله بن سعيد، عن يحيى، عن شعبة، قال حدثنا أبو إسحاق، ح وأنبأنا سويد بن نصر، قال حدثنا عبد الله، عن شعبة، عن أبي إسحاق، قال سمعت سليمان بن صرد، يحدث عن جبير بن مطعم، أن النبي صلى الله عليه وسلم ذكر عنده الغسل فقال ‏\"‏ أما أنا فأفرغ على رأسي ثلاثا ‏\"‏ ‏.‏ لفظ سويد ‏.‏",
      "text_en": " It was narrated from Jubair bin Mut'im that mention of Ghusl was made in the presence of the Prophet (ﷺ) and he said:                      \"As for me, I pour water on my head three times.\"",
      "chain": [
        "30359",
        "20031",
        "20020",
        "11049",
        "38265",
        "20025",
        "20020",
        "11049",
        "383",
        "871"
      ]
    },
    {
      "hadith_no": "474",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Salah - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثني يحيى، عن هشام، قال حدثني يحيى بن أبي كثير، عن أبي قلابة، قال حدثني أبو المليح، قال كنا مع بريدة في يوم ذي غيم فقال بكروا بالصلاة فإن رسول الله صلى الله عليه وسلم قال ‏\"‏ من ترك صلاة العصر فقد حبط عمله ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Qilabah said:                      \"Abu Al-Malih narrated to me: 'We were with Buraidah on a cloudy day and he said: \"Pray early, for the Messenger of Allah (ﷺ) said: 'Whoever abandons Salat Al-'Asr, his good deeds will perish.'\"",
      "chain": [
        "30359",
        "20031",
        "11065",
        "11449",
        "11047",
        "11453"
      ]
    },
    {
      "hadith_no": "502",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا عبيد الله بن سعيد، حدثنا يحيى بن سعيد، عن شعبة، قال حدثني حمزة العائذي، قال سمعت أنس بن مالك، يقول كان النبي صلى الله عليه وسلم إذا نزل منزلا لم يرتحل منه حتى يصلي الظهر ‏.‏ فقال رجل وإن كانت بنصف النهار قال وإن كانت بنصف النهار ‏.‏",
      "text_en": " Hamzah Al-'A'idhi said:                      \"I heard Anas bin Malik say: 'When the Prophet (ﷺ) halted, he would not move on until he had prayed Zuhr.' A man said: 'Even if it was the middle of the day?' He said: 'Even if it was the middle of the day.'\"",
      "chain": [
        "30359",
        "20031",
        "20020",
        "19"
      ]
    },
    {
      "hadith_no": "503",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا أبو سعيد، مولى بني هاشم قال حدثنا خالد بن دينار أبو خلدة، قال سمعت أنس بن مالك، قال كان رسول الله صلى الله عليه وسلم إذا كان الحر أبرد بالصلاة وإذا كان البرد عجل ‏.‏",
      "text_en": " Khalid bin Dinar Abu Khaldah said:                      \"I heard Anas bin Malik say: 'When it was hot, the Messenger of Allah (ﷺ) would wait until it cooled down to pray, and when it was cold he would hasten to pray.'\"",
      "chain": [
        "30359",
        "20195",
        "11583",
        "19"
      ]
    },
    {
      "hadith_no": "508",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا عبد الله بن الحارث، قال حدثنا ثور، حدثني سليمان بن موسى، عن عطاء بن أبي رباح، عن جابر، قال سأل رجل رسول الله صلى الله عليه وسلم عن مواقيت الصلاة فقال ‏\"‏ صل معي ‏\"‏ ‏.‏ فصلى الظهر حين زاغت الشمس والعصر حين كان فىء كل شىء مثله والمغرب حين غابت الشمس والعشاء حين غاب الشفق قال ثم صلى الظهر حين كان فىء الإنسان مثله والعصر حين كان فىء الإنسان مثليه والمغرب حين كان قبيل غيبوبة الشفق ‏.‏ قال عبد الله بن الحارث ثم قال في العشاء أرى إلى ثلث الليل ‏.‏",
      "text_en": " It was narrated that Jabir said:                      \"A man asked the Messenger of Allah (ﷺ) about the times of prayer. He said: 'Pray with me.' So he prayed Zuhr when the sun had passsed its zenith, 'Asr when the shadow of a thing was equal to its height, Maghrib when the sun had set and 'Isha' when the twilight had disappeared.\" He said: \"Then he prayed Zuhr when the shadow of a man was equal in length to his height, 'Asr when the length of a man's shadow was twice his height, and Maghrib just before the twilight disappeared.\" (One of the narrators) 'Abdullah bin Al-Harith said: \"then he said: 'With regard to 'Isha' I think it is up to one-third of the night.'\" [1][1] The speaker there is Thawr, who narrated it from 'Ata' from Jabir.",
      "chain": [
        "30359",
        "912",
        "11155",
        "10880",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "553",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا يحيى، عن ابن عجلان، قال حدثني عاصم بن عمر بن قتادة، عن محمود بن لبيد، عن رافع بن خديج، عن النبي صلى الله عليه وسلم قال ‏\"‏ أسفروا بالفجر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Rafi' bin Khadij that the Prophet (ﷺ) said:                      \"Pray Fajr when the dawn shines.\"",
      "chain": [
        "30359",
        "20031",
        "10616",
        "11103",
        "1830",
        "1986"
      ]
    },
    {
      "hadith_no": "581",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا يحيى، عن هشام، قال أخبرني أبي قال، قالت عائشة ما ترك رسول الله صلى الله عليه وسلم السجدتين بعد العصر عندي قط ‏.‏",
      "text_en": " It was narrated that Hisham said:                      \"My father told me: 'Aishah said: 'The Messenger of Allah (ﷺ) never neglected to pray two Rak'ahs after 'Asr in my house.'\"",
      "chain": [
        "30359",
        "20031",
        "11065",
        "10511"
      ]
    },
    {
      "hadith_no": "614",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا عبد الرحمن، عن مالك، عن الزهري، عن سالم، عن ابن عمر، أن النبي صلى الله عليه وسلم صلى المغرب والعشاء بالمزدلفة ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that the Prophet (ﷺ) prayed Maghrib and 'Isha' at Al-Muzdalifah.",
      "chain": [
        "30359",
        "20033",
        "20001",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "689",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Adhan (The Call to Prayer) - كتاب الأذان",
      "chapter_no": "7",
      "text_ar": "أخبرنا عبيد الله بن سعيد، عن يحيى، عن كهمس، قال حدثنا عبد الله بن بريدة، عن عبد الله بن مغفل، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ بين كل أذانين صلاة بين كل أذانين صلاة بين كل أذانين صلاة لمن شاء ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Mughaffal said:                      \"The Messenger of Allah (ﷺ) said: 'Between each two Adhans [1] there is a prayer, between each two Adhans there is a prayer, between each two Adhans there is a prayer, for whoever wants to do it.\"[1]Meaning, between the Adhan and Iqamah.",
      "chain": [
        "30359",
        "20031",
        "11303",
        "11432",
        "3242"
      ]
    },
    {
      "hadith_no": "710",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Masjids - كتاب المساجد",
      "chapter_no": "8",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا عبد الله بن نمير، قال حدثنا هشام بن عروة، عن أبيه، عن عائشة، قالت أصيب سعد يوم الخندق رماه رجل من قريش رمية في الأكحل فضرب عليه رسول الله صلى الله عليه وسلم خيمة في المسجد ليعوده من قريب ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                      \"Sa'd was wounded on the day of Al-Khandaq [1] when a man of Quraish shot him in the medial arm vein. The Messenger of Allah (ﷺ) pitched a tent (Khaimah) for him in the Masjid so that he could visit him close at hand.\"[1] Al-Khandaq means the trench. This indicates the battle of the trench which took place during the fifth year after Hijrah.",
      "chain": [
        "30359",
        "20331",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "722",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Masjids - كتاب المساجد",
      "chapter_no": "8",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا يحيى، عن عبيد الله، قال أخبرني نافع، عن ابن عمر، أنه كان ينام وهو شاب عزب لا أهل له على عهد رسول الله صلى الله عليه وسلم في مسجد النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar, that when he was young and single, with no family, at the time of the Messenger of Allah (ﷺ), he used to sleep in the Masjid of the Prophet (ﷺ).",
      "chain": [
        "30359",
        "20031",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "726",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Masjids - كتاب المساجد",
      "chapter_no": "8",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا يحيى، عن سفيان، قال حدثني منصور، عن ربعي، عن طارق بن عبد الله المحاربي، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا كنت تصلي فلا تبزقن بين يديك ولا عن يمينك وابصق خلفك أو تلقاء شمالك إن كان فارغا وإلا فهكذا ‏\"‏ ‏.‏ وبزق تحت رجله ودلكه ‏.‏",
      "text_en": " It was narrated that Tariq bin 'Abdullah Al-Muharibi said:                      'When you are praying, do not spit to the front or to your right. Spit behind you or to your left if there is no one there, otherwise do this.' And he spat beneath his foot and rubbed it.'\"",
      "chain": [
        "30359",
        "20031",
        "20012",
        "11067",
        "11334",
        "5100"
      ]
    },
    {
      "hadith_no": "747",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Qiblah - كتاب القبلة",
      "chapter_no": "9",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا يحيى، عن عبيد الله، قال أنبأنا نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم قال كان يركز الحربة ثم يصلي إليها ‏.‏",
      "text_en": " Narrated Ibn Umar:                     It was narrated from Ibn Umar concerning the Messenger of Allah (ﷺ) he said: \"He used to set up a short spear then pray facing toward it.\"",
      "chain": [
        "30359",
        "20031",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "759",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Qiblah - كتاب القبلة",
      "chapter_no": "9",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا يحيى، عن هشام، قال حدثنا أبي، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يصلي من الليل وأنا راقدة معترضة بينه وبين القبلة على فراشه فإذا أراد أن يوتر أيقظني فأوترت ‏.‏",
      "text_en": " It was narrated that Aisha said:                      \"The Messenger of Allah(ﷺ)used to pray at night while I was lying down sleeping between him and the Qibla on his bed. When he wanted to pray witr he would wake me up and I would pray witr\"",
      "chain": [
        "30359",
        "20031",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "766",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Qiblah - كتاب القبلة",
      "chapter_no": "9",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا يحيى، عن سفيان، قال حدثني أبو حازم، عن سهل بن سعد، قال كان رجال يصلون مع رسول الله صلى الله عليه وسلم عاقدين أزرهم كهيئة الصبيان فقيل للنساء لا ترفعن رءوسكن حتى يستوي الرجال جلوسا ‏.‏",
      "text_en": " It was narrated that Sahl bin Sa'd said:                      \"Some men used to pray with Messenger of Allah(ﷺ) tying their lower garments tight like children, it was said to the women: 'Do not raise your heads until the men have sat up completely.'\"",
      "chain": [
        "30359",
        "20031",
        "20012",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "776",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Qiblah - كتاب القبلة",
      "chapter_no": "9",
      "text_ar": "أخبرنا عبيد الله بن سعيد، وشعيب بن يوسف، عن يحيى، عن ابن جريج، قال أخبرني محمد بن عباد، عن عبد الله بن سفيان، عن عبد الله بن السائب، أن رسول الله صلى الله عليه وسلم صلى يوم الفتح فوضع نعليه عن يساره ‏.‏",
      "text_en": " It was narrated from Abdullah bin As Saib that the Messenger of Allah(ﷺ) prayed on the day of Conquest (of Makkah), and he put his sandals to his left.",
      "chain": [
        "30359",
        "20031",
        "11070",
        "30377",
        "2065"
      ]
    },
    {
      "hadith_no": "779",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا أبو بكر بن عياش، عن عاصم، عن زر، عن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لعلكم ستدركون أقواما يصلون الصلاة لغير وقتها فإن أدركتموهم فصلوا الصلاة لوقتها وصلوا معهم واجعلوها سبحة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullih said:                      \"The Messenger of Allah (ﷺ) said: 'You may live to meet people who will be offering the prayer outside its (prayer) time. If you meet them, then offer the prayer on time, then pray with them and make that a voluntary prayer.\"'",
      "chain": [
        "30359",
        "20373",
        "11080",
        "11337",
        "16"
      ]
    },
    {
      "hadith_no": "782",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا عبيد الله بن سعيد، عن يحيى، عن هشام، قال حدثنا قتادة، عن أبي نضرة، عن أبي سعيد، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا كانوا ثلاثة فليؤمهم أحدهم وأحقهم بالإمامة أقرؤهم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Sa'eed that the Prophet (ﷺ) said:                     \"when there are three people let one of them lead the prayer, and the one who is most entitled to lead the prayer is the one who has most knowledge of the Qur'an.\"",
      "chain": [
        "30359",
        "20031",
        "11065",
        "11019",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "839",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا يحيى بن سعيد، عن عبد الرحمن بن عمار، قال حدثني القاسم بن محمد، عن عائشة، عن النبي صلى الله عليه وسلم قال ‏\"‏ صلاة الجماعة تزيد على صلاة الفذ خمسا وعشرين درجة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from that the Prophet (ﷺ) said:                      \"Prayer in congregation is twenty-five levels better than a prayer offered on one's own.\"",
      "chain": [
        "30359",
        "20031",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "976",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا معاذ بن هشام، قال حدثني أبي، عن يحيى بن أبي كثير، قال حدثني عبد الله بن أبي قتادة، أن أباه، أخبره قال كان رسول الله صلى الله عليه وسلم يقرأ بنا في الركعتين الأوليين من صلاة الظهر ويسمعنا الآية أحيانا ويطول في الأولى ويقصر في الثانية وكان يفعل ذلك في صلاة الصبح يطول في الأولى ويقصر في الثانية وكان يقرأ بنا في الركعتين الأوليين من صلاة العصر يطول الأولى ويقصر الثانية ‏.‏",
      "text_en": " Abdullah bin Abi Qatadah narrated that:                     His father told him: \"The Messenger of Allah (ﷺ) used to recite for us in the first two rak'ahs of Zuhr prayer, and he would make us hear a verse sometimes. He would make the first rak'ah longer and the second shorter. And he used to do that in Subh too, make the first rak'ah longer and the second shorter. And he used to recite in the first two rak'ahs of 'Asr prayer, making the first rak'ah longer and the second shorter.\"",
      "chain": [
        "30359",
        "20287",
        "20295",
        "11449",
        "11804",
        "391"
      ]
    },
    {
      "hadith_no": "983",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا عبد الله بن الحارث، عن الضحاك بن عثمان، عن بكير بن عبد الله بن الأشج، عن سليمان بن يسار، عن أبي هريرة، قال ما صليت وراء أحد أشبه صلاة برسول الله صلى الله عليه وسلم من فلان ‏.‏ فصلينا وراء ذلك الإنسان وكان يطيل الأوليين من الظهر ويخفف في الأخريين ويخفف في العصر ويقرأ في المغرب بقصار المفصل ويقرأ في العشاء بالشمس وضحاها وأشباهها ويقرأ في الصبح بسورتين طويلتين ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"I have never prayed behind anyone whose prayer more closely resembled that of the Messenger of Allah (ﷺ) than so-and-so. We prayed behind that person and he used to make the first two rak'ahs of Zuhr lengthy and the last two shorter, and he would make 'Asr shorter; in Maghrib he would recite the short Mufassal surahs. In Isha' he recited: 'By the sun and its brightness and similar surahs, and in subh he recited two lengthy surahs.\"",
      "chain": [
        "30359",
        "912",
        "20504",
        "11154",
        "11005",
        "13"
      ]
    },
    {
      "hadith_no": "1040",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا عبيد الله بن سعيد، حدثنا حماد بن مسعدة، عن أشعث، عن محمد، عن عبيدة، عن علي، قال نهاني النبي صلى الله عليه وسلم عن القسي والحرير وخاتم الذهب وأن أقرأ وأنا راكع وقال مرة أخرى وأن أقرأ راكعا ‏.‏",
      "text_en": " It was narrated that 'Ali said:                     \"The Prophet (ﷺ) forbade me from wearing A-Qassi and silk, and gold rings, and from reciting Qur'an when bowing.\"",
      "chain": [
        "30359",
        "20224",
        "11324",
        "20278",
        "11370",
        "5"
      ]
    },
    {
      "hadith_no": "1041",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا يحيى بن سعيد، عن ابن عجلان، عن إبراهيم بن عبد الله بن حنين، عن أبيه، عن ابن عباس، عن علي، قال نهاني النبي صلى الله عليه وسلم عن خاتم الذهب وعن القراءة راكعا وعن القسي والمعصفر ‏.‏",
      "text_en": " It was narrated that 'Ali said:                     \"The Prophet (ﷺ) forbade me from wearing gold rings, from reciting the Qur'an when bowing, and from wearing Al-Qassi, and clothes dyed with safflower.\"",
      "chain": [
        "30359",
        "20031",
        "10616",
        "11150",
        "11181",
        "17",
        "5"
      ]
    },
    {
      "hadith_no": "1076",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا عبيد الله بن سعيد، عن عبد الرحمن، عن سفيان، وشعبة، عن عمرو بن مرة، ح وأخبرنا عمرو بن علي، قال حدثنا يحيى، عن شعبة، وسفيان، قالا حدثنا عمرو بن مرة، عن ابن أبي ليلى، عن البراء بن عازب، أن النبي صلى الله عليه وسلم كان يقنت في الصبح والمغرب ‏.‏ وقال عبيد الله أن رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated from Al-Bara' bin 'Azib that:                     The Prophet (ﷺ) used to say the Qunut in Subh and Maghrib. (One of the narrators) 'Ubaidullah said: \"Allah's Messenger (ﷺ) used to.\"",
      "chain": [
        "30359",
        "20033",
        "20012",
        "20020",
        "11381",
        "30153",
        "20031",
        "20020",
        "20005",
        "11381",
        "11196",
        "400"
      ]
    },
    {
      "hadith_no": "1193",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا عبيد الله بن سعيد، وشعيب بن يوسف، عن يحيى، - وهو ابن سعيد القطان - عن ابن أبي عروبة، عن قتادة، عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ما بال أقوام يرفعون أبصارهم إلى السماء في صلاتهم ‏\"‏ ‏.‏ فاشتد قوله في ذلك حتى قال ‏\"‏ لينتهن عن ذلك أو لتخطفن أبصارهم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Anas bin Malik that:                     The Messenger of Allah (ﷺ) said: \"What is the matter with people who lift their gaze to the sky when praying?\" And he spoke sternly concerning that until he said: \"They must stop that or they will certainly lose their eyesight.\"",
      "chain": [
        "30359",
        "20031",
        "11073",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "1210",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا عبيد الله بن سعيد، حدثنا يحيى بن سعيد، عن عوف، قال حدثني محمد، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ التسبيح للرجال والتصفيق للنساء ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     The Prophet (ﷺ) said: \"The tasbih is for men and clapping is for women.\"",
      "chain": [
        "30359",
        "20031",
        "11298",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "1450",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Shortening the Prayer When Traveling - كتاب تقصير الصلاة فى السفر",
      "chapter_no": "15",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال أنبأنا يحيى، عن عبيد الله، عن نافع، عن ابن عمر، قال صليت مع النبي صلى الله عليه وسلم بمنى ركعتين ومع أبي بكر - رضى الله عنه - ركعتين ومع عمر - رضى الله عنه - ركعتين ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                     \"I prayed two rak'ahs with the Messenger of Allah (ﷺ) in Mina, and two rak'ahs with Abu Bakr, may Allah (SWT) be pleased with him, and two rak'ahs with Umar, may Allah (ﷺ) be pleased with him.\"",
      "chain": [
        "30359",
        "20031",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1605",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا محمد بن الفضيل، عن داود بن أبي هند، عن الوليد بن عبد الرحمن، عن جبير بن نفير، عن أبي ذر، قال صمنا مع رسول الله صلى الله عليه وسلم في رمضان فلم يقم بنا حتى بقي سبع من الشهر فقام بنا حتى ذهب ثلث الليل ثم لم يقم بنا في السادسة فقام بنا في الخامسة حتى ذهب شطر الليل فقلت يا رسول الله لو نفلتنا بقية ليلتنا هذه ‏.‏ قال ‏\"‏ إنه من قام مع الإمام حتى ينصرف كتب الله له قيام ليلة ‏\"‏ ‏.‏ ثم لم يصل بنا ولم يقم حتى بقي ثلاث من الشهر فقام بنا في الثالثة وجمع أهله ونساءه حتى تخوفنا أن يفوتنا الفلاح ‏.‏ قلت وما الفلاح قال السحور ‏.‏",
      "text_en": " It was narrated that Abu Dharr said:                     \"We fasted with the Messenger of Allah (ﷺ) in Ramadan and he did not lead us in praying Qiyam until there were seven days left in the month, when he led us in praying Qiyam until one-third of the night had passed. Then he did not lead us in praying Qiyam when there were six days left. Then he led us praying Qiyam when there were five days left until one-half of the night had passed. I said: \"O Messenger of Allah! What if we spend the rest of this night praying Nafl?\" He said: \"Whoever prays Qiyam with the Imam until he finishes, Allah (SWT) will record for him the Qiyam of a (whole) night.\" Then he did not lead us in prayer or pray Qiyam until there were three days of the month left. Then he led us in praying Qiyam when there were three days left. He gathered his family and wives (and led us in prayer) until we feared that we would miss Al-Falah. I (one of the narrators) said: \"What is Al-Falah?\" He said: \"The suhur\".",
      "chain": [
        "30359",
        "11585",
        "10975",
        "4097",
        "23"
      ]
    },
    {
      "hadith_no": "1659",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا يحيى، عن سفيان، قال حدثنا منصور، عن هلال بن يساف، عن أبي يحيى، عن عبد الله بن عمرو، قال رأيت النبي صلى الله عليه وسلم يصلي جالسا فقلت حدثت أنك قلت ‏\"‏ إن صلاة القاعد على النصف من صلاة القائم ‏\"‏ ‏.‏ وأنت تصلي قاعدا ‏.‏ قال ‏\"‏ أجل ولكني لست كأحد منكم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin 'Amr said:                     \"I saw the Prophet (ﷺ) praying sitting down and I said: 'I was told that you said that the prayer of one who is sitting down is worth half of the prayer of the one who is standing up.' He said: 'Yes indeed, but I am not like any one of you.'\"",
      "chain": [
        "30359",
        "20031",
        "20012",
        "11067",
        "10835",
        "29"
      ]
    },
    {
      "hadith_no": "1686",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا يحيى بن سعيد، عن عبيد الله بن الأخنس، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم كان يوتر على الراحلة ‏.‏",
      "text_en": " It was narrated from Ibn Umar that:                     The Messenger of Allah (ﷺ) used to pray witr on his mount.",
      "chain": [
        "30359",
        "20031",
        "20444",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1833",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا معاذ بن هشام، قال حدثني أبي، عن قتادة، عن قسامة بن زهير، عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏\"‏ إذا حضر المؤمن أتته ملائكة الرحمة بحريرة بيضاء فيقولون اخرجي راضية مرضيا عنك إلى روح الله وريحان ورب غير غضبان ‏.‏ فتخرج كأطيب ريح المسك حتى أنه ليناوله بعضهم بعضا حتى يأتون به باب السماء فيقولون ما أطيب هذه الريح التي جاءتكم من الأرض ‏.‏ فيأتون به أرواح المؤمنين فلهم أشد فرحا به من أحدكم بغائبه يقدم عليه فيسألونه ماذا فعل فلان ماذا فعل فلان فيقولون دعوه فإنه كان في غم الدنيا فإذا قال أما أتاكم قالوا ذهب به إلى أمه الهاوية وإن الكافر إذا احتضر أتته ملائكة العذاب بمسح فيقولون اخرجي ساخطة مسخوطا $$عليك إلى عذاب الله عز وجل ‏.‏ فتخرج كأنتن ريح جيفة حتى يأتون به باب الأرض فيقولون ما أنتن هذه الريح حتى يأتون به أرواح الكفار ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Prophet said:                     \"When the believer is dying, the angels of mercy come to him with white silk and sya: 'Come out content and with the pleasure of Allah upon you to the mercy of Allah, fragrance and a Lord Who is not angry; So it comes out like the best fragrance of musk. They pass him from one to another until they bring him to the gate of heaven, where they say: '; How good is this fragrance that has come to you from the Earth! Then the souls of the believers come to him and they rejoice more over him than any one of you rejoices when his absent loved one comes to him. They ask him: 'What happened to so-and-so, what happened to so-and-so?' They say: 'Let him be, for he was in the hardship of the world. When he says, 'Did he not come here?' They say: 'He was taken to the pit (of Hell).' Come out discontent, subject of Divine wrath, to the punishment of Allah, the Mighty and Sublime; So it comes out like the foulest stench of a corpse. They bring him to the gates of the Earth, where they say: 'How foul is this stench!' Then they bring him to the souls of the disbelievers.\"",
      "chain": [
        "30359",
        "20287",
        "20295",
        "11019",
        "14326",
        "13"
      ]
    },
    {
      "hadith_no": "1848",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا يحيى، عن عبيد الله، عن نافع، عن ابن عمر، عن عمر، عن النبي صلى الله عليه وسلم قال ‏\"‏ الميت يعذب ببكاء أهله عليه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar, from 'Umar, that the Prophet said:                     \"The deceased is punished due to the weeping of his family for him.\"",
      "chain": [
        "30359",
        "20031",
        "11201",
        "11014",
        "18",
        "3"
      ]
    },
    {
      "hadith_no": "1903",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا يحيى، عن الأعمش، ح وأخبرنا إسماعيل بن مسعود، قال حدثنا يحيى بن سعيد القطان، قال سمعت الأعمش، قال سمعت شقيقا، قال حدثنا خباب، قال هاجرنا مع رسول الله صلى الله عليه وسلم نبتغي وجه الله تعالى فوجب أجرنا على الله فمنا من مات لم يأكل من أجره شيئا منهم مصعب بن عمير قتل يوم أحد فلم نجد شيئا نكفنه فيه إلا نمرة كنا إذا غطينا رأسه خرجت رجلاه وإذا غطينا بها رجليه خرجت رأسه فأمرنا رسول الله صلى الله عليه وسلم أن نغطي بها رأسه ونجعل على رجليه إذخرا ومنا من أينعت له ثمرته فهو يهدبها ‏.‏ واللفظ لإسماعيل ‏.‏",
      "text_en": " Khabbab said:                     \"We emigrated with the Messenger of Allah, seeking the Face of Allah, the Most High, so our reward became due from Allah. Some of us died without enjoying anything of his reward (in this world) among them is Mus'ab bin Umair. He was matyred on the day of Uhud and we could not find anything to shroud him in except a Namirah; if we covered his head with it, his feet were uncovered, and if we covered his feet with it, his head became uncovered. The Messenger of Allah told us to cover his head with it and to put Idhkhir over his feet. And for some of us, the fruits of our labor have ripened and we are gathering them.\" This is the wording of Isma'il",
      "chain": [
        "30359",
        "20031",
        "11060",
        "34033",
        "20031",
        "11060",
        "11353",
        "149"
      ]
    },
    {
      "hadith_no": "1959",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا يحيى بن سعيد، عن يحيى بن سعيد الأنصاري، عن محمد بن يحيى بن حبان، عن أبي عمرة، عن زيد بن خالد، قال مات رجل بخيبر فقال رسول الله صلى الله عليه وسلم ‏\"‏ صلوا على صاحبكم إنه غل في سبيل الله ‏\"‏ ‏.‏ ففتشنا متاعه فوجدنا فيه خرزا من خرز يهود ما يساوي درهمين ‏.‏",
      "text_en": " It was narrated that Zaid bin Khalid said:                     \"A man died at Khaibar and the Messenger of Allah said: 'Pray for your companion; he stole from the spoils war.' We inspected his luggage and fund some of the beads of the Jews that were not even worth two Dirhams.\"",
      "chain": [
        "30359",
        "20031",
        "11062",
        "11222",
        "3625"
      ]
    },
    {
      "hadith_no": "2006",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا يحيى، عن سفيان، قال حدثني أبو إسحاق، عن ناجية بن كعب، عن علي، قال قلت للنبي صلى الله عليه وسلم، إن عمك الشيخ الضال مات، فمن يواريه قال ‏:‏ ‏\"‏ اذهب فوار أباك ولا تحدثن حدثا حتى تأتيني ‏\"‏ ‏.‏ فواريته ثم جئت فأمرني فاغتسلت ودعا لي، وذكر دعاء لم أحفظه ‏.‏",
      "text_en": " It was narrated that 'Ali said:                     \"I said to the Prophet: 'Your paternal uncle, the old misguided man has died. Who will bury him?' He said: 'Go and bury your father, then do not do anything until you come to me.' So I buried him then I came, and he told me to perform Ghusl and he prayed for me, and he mentioned a supplication that I do not remember.\"'",
      "chain": [
        "30359",
        "20031",
        "20012",
        "11049",
        "19064",
        "5"
      ]
    },
    {
      "hadith_no": "2040",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا حرمي بن عمارة، قال حدثنا شعبة، عن علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، ‏:‏ أن رسول الله صلى الله عليه وسلم كان إذا أتى على المقابر فقال ‏:‏ ‏\"‏ السلام عليكم أهل الديار من المؤمنين والمسلمين، وإنا إن شاء الله بكم لاحقون، أنتم لنا فرط ونحن لكم تبع، أسأل الله العافية لنا ولكم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Sulaiman bin Buraidah, from his father, that:                     when the Messenger of Allah came to the graveyard he would say: \"As-salamu 'alaykum ahli ad-diyari min al-mu'minin wal-muslimin wa inna I sha' Allahu bikum lana faratun wa nahnu lakum taba'un, as'alullahal-'afiyata lana wa lakum. (Peace by upon the inhabitants of this place among the believers and Muslims. Soon we will join you, if Allah willing. You have gone on ahead of us and we will follow you. I ask Allah to keep us and you safe and sound.)\"",
      "chain": [
        "30359",
        "20221",
        "20020",
        "11374",
        "10916"
      ]
    },
    {
      "hadith_no": "2054",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا يحيى، عن التيمي، عن أبي عثمان، عن عامر بن مالك، عن صفوان بن أمية، قال الطاعون والمبطون والغريق والنفساء شهادة ‏.‏ قال وحدثنا أبو عثمان مرارا ورفعه مرة إلى النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated that Safwan bin Umayyah said:                     \"The plague, abdominal illness, drowning and dying in childbirth are martyrdom.\" (One of the narrators) said: Abu 'Uthman narrated this to us several times, and on one occasion he attributed it to the Prophet.",
      "chain": [
        "30359",
        "20031",
        "11289",
        "11113",
        "449"
      ]
    },
    {
      "hadith_no": "2059",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا يحيى، عن شعبة، قال أخبرني عون بن أبي جحيفة، عن أبيه، عن البراء بن عازب، عن أبي أيوب، قال خرج رسول الله صلى الله عليه وسلم بعد ما غربت الشمس فسمع صوتا فقال ‏\"‏ يهود تعذب في قبورها ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Ayyub said:                     \"The Messenger of Allah went out after the sun had set, and heard a sound. He said '(It is ) Jews being tormented in their graves.",
      "chain": [
        "30359",
        "20031",
        "20020",
        "11383",
        "4047",
        "400",
        "33"
      ]
    },
    {
      "hadith_no": "2109",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا يحيى بن سعيد، قال أنبأنا المهلب بن أبي حبيبة، ح وأنبأنا عبيد الله بن سعيد، قال حدثنا يحيى، عن المهلب بن أبي حبيبة، قال أخبرني الحسن، عن أبي بكرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يقولن أحدكم صمت رمضان ولا قمته كله ‏\"‏ ‏.‏ ولا أدري كره التزكية أو قال لا بد من غفلة ورقدة اللفظ لعبيد الله ‏.‏",
      "text_en": " It was narrated from abu Bakrah that the Prophet said;'None of you should say:                      'I fasted Ramadan' or 'I prayed Qiyam throughout the whole month.\"' I do not know whether he dislike self-praise or he said: \"Inevitably there will be heedlessness and sleep.\" (Da 'if)",
      "chain": [
        "30123",
        "20031",
        "30359",
        "20031",
        "11016",
        "3229"
      ]
    },
    {
      "hadith_no": "2145",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا عبد الرحمن، عن أبي بكر بن عياش، عن عاصم، عن زر، عن عبد الله، قال تسحروا ‏.‏ قال عبيد الله لا أدري كيف لفظه ‏.‏",
      "text_en": " It was narrated that 'Abdullah said:                     \"Take Sahur.\" 'Ubaidullah said: \"I do not know how he said it.\"",
      "chain": [
        "30359",
        "20033",
        "20373",
        "11080",
        "11337",
        "16"
      ]
    },
    {
      "hadith_no": "2445",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا سفيان، قال حدثني عمرو بن يحيى، ح وأخبرنا محمد بن المثنى، ومحمد بن بشار، عن عبد الرحمن، عن سفيان، وشعبة، ومالك، عن عمرو بن يحيى، عن أبيه، عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ليس فيما دون خمسة أوسق صدقة ولا فيما دون خمس ذود صدقة ولا فيما دون خمسة أواق صدقة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Sa'eed Al-Khudri that the Messenger of Allah said:                     \"No Sadaqah is due on less than five Awsuq,[1] and no Sadaqah is due on less than five Dhawd (head of camel), and no Sadaqah is due on less than five Awaq.\"[2]",
      "chain": [
        "30359",
        "20005",
        "11210",
        "30170",
        "30160",
        "20033",
        "20005",
        "20020",
        "20001",
        "11210",
        "11232",
        "38"
      ]
    },
    {
      "hadith_no": "2470",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا يحيى، عن خثيم، قال حدثنا أبي، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ ليس على المرء في فرسه ولا في مملوكه صدقة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Prophet said:                     \"A person does not have to pay Sadaqah on his horse or his slave.\"",
      "chain": [
        "30359",
        "20031",
        "13"
      ]
    },
    {
      "hadith_no": "2528",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا صفوان بن عيسى، قال حدثنا ابن عجلان، عن زيد بن أسلم، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ سبق درهم مائة ألف ‏\"‏ ‏.‏ قالوا يا رسول الله وكيف قال ‏\"‏ رجل له درهمان فأخذ أحدهما فتصدق به ورجل له مال كثير فأخذ من عرض ماله مائة ألف فتصدق بها ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah said: 'A Dirham was better than a hundred thousand Dirhams.' They said: 'O Messenger of Allah, how?' He said: 'A man had two Dirhams and gave one in charity, and another man went to part of his wealth and took out a hundred thousand Dirhams and gave them in charity.\"'",
      "chain": [
        "30359",
        "20553",
        "10616",
        "11163",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "2682",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا يحيى، عن عبيد الله، قال أخبرني نافع، عن عبد الله بن عمر، عن أخته، حفصة قالت قلت للنبي صلى الله عليه وسلم يا رسول الله ما شأن الناس حلوا ولم تحل من عمرتك قال ‏\"‏ إني لبدت رأسي وقلدت هديي فلا أحل حتى أحل من الحج ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin 'Umar that his sister, Hafsah, said;\"I said to the Prophet;'O Messenger of Allah! Why is it that the people have exited Ihram and you have not exited Ihram following your 'Umrah?'He said:                      'I have matted my hair and garlanded my Hadi (sacrificial animal), so I will not exit Ihram until I exit Ihram after Hajj.'''",
      "chain": [
        "30359",
        "20031",
        "11201",
        "11014",
        "18",
        "54"
      ]
    },
    {
      "hadith_no": "2715",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا عبيد الله بن سعيد، وإسحاق بن منصور، عن عبد الرحمن، عن مالك، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، أن رسول الله صلى الله عليه وسلم أفرد الحج ‏.‏",
      "text_en": " It was narrated from 'Aishah that:                     the Messenger of Allah performed Hajj only (Ifrad)",
      "chain": [
        "30359",
        "30313",
        "20033",
        "20001",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "2782",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا معاذ، قال حدثنا أبي، عن قتادة، عن أبي حسان الأعرج، عن ابن عباس، أن نبي الله صلى الله عليه وسلم لما أتى ذا الحليفة أشعر الهدى في جانب السنام الأيمن ثم أماط عنه الدم وقلده نعلين ثم ركب ناقته فلما استوت به البيداء لبى وأحرم عند الظهر وأهل بالحج ‏.‏",
      "text_en": " It was narrated from Ibn Abbas:                     That when the Prophet of Allah came to Dhul-Hulaifah he marked the Hadi on the right side of its hump, the he removed the blood and garlanded it with two shoes, then he mounted his she-camel and when it stood up with him Al-Baida, he recited the Talbiyah and entered Ihram at noon and enter Ihram for Hajj.",
      "chain": [
        "30359",
        "32",
        "11019",
        "10730",
        "17"
      ]
    },
    {
      "hadith_no": "2843",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا يحيى، عن مالك، أخبرني نافع، عن نبيه بن وهب، عن أبان بن عثمان، عن أبيه، عن النبي صلى الله عليه وسلم أنه نهى أن ينكح المحرم أو ينكح أو يخطب ‏.‏",
      "text_en": " It was narrated from Aban bin Uthamn, from his father:                     That the Prophet forbade the Muhrim to get married, arrange a marriage for anyone else, or propose marriage.",
      "chain": [
        "30359",
        "20031",
        "20001",
        "11014",
        "19965",
        "10582",
        "4"
      ]
    },
    {
      "hadith_no": "2927",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا عبد الرحمن، عن مالك، عن أبي الأسود، عن عروة، عن زينب بنت أم سلمة، عن أم سلمة، أنها قدمت مكة وهي مريضة فذكرت ذلك لرسول الله صلى الله عليه وسلم فقال ‏\"‏ طوفي من وراء المصلين وأنت راكبة ‏\"‏ ‏.‏ قالت فسمعت رسول الله صلى الله عليه وسلم وهو عند الكعبة يقرأ ‏{‏ والطور ‏}‏ ‏.‏",
      "text_en": " It was narrated from Urwah from Zainab bint Umm Salamab, from Umm Salamah, that:                     she came to Makkah when she was sick. She mentioned that to the Messenger of Allah and he said: \"Perform Tawaf behind those who are praying while you are riding.\" She said: \"And I heard the Messenger of Allah, at the Kabah, reciting 'By the Tur (Mount).\"",
      "chain": [
        "30359",
        "20033",
        "20001",
        "11105",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "2940",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا يحيى، عن عبيد الله، عن نافع، أن عبد الله بن عمر، كان يرمل الثلاث ويمشي الأربع ويزعم أن رسول الله صلى الله عليه وسلم كان يفعل ذلك ‏.‏",
      "text_en": " It was narrated from Nafi that:                     Abdulla bin Umar used to walk rapidly for three (rounds), and walk for four, and he said that the Messenger of Allah used to do that.",
      "chain": [
        "30359",
        "20031",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2952",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا يحيى، عن عبيد الله، عن نافع، قال قال عبد الله رضي الله عنه ما تركت استلام هذين الركنين منذ رأيت رسول الله صلى الله عليه وسلم يستلمهما اليماني والحجر في شدة ولا رخاء ‏.‏",
      "text_en": " It was narrated that Nafi said:                     \"Abdullah, may Allah be pleased with him, said: \"I have not failed to touch these two corners since I saw the Messenger of Allah touching them, the Yemeni Corner and Black Stone, either when it is difficult or when it is easy.'\"",
      "chain": [
        "30359",
        "20031",
        "11201",
        "11014"
      ]
    },
    {
      "hadith_no": "3052",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا يحيى، عن ابن جريج، قال أخبرني أبو الزبير، عن أبي معبد، عن عبد الله بن عباس، عن الفضل بن عباس، قال قال رسول الله صلى الله عليه وسلم للناس حين دفعوا عشية عرفة وغداة جمع ‏\"‏ عليكم بالسكينة ‏\"‏ ‏.‏ وهو كاف ناقته حتى إذا دخل منى فهبط حين هبط محسرا قال ‏\"‏ عليكم بحصى الخذف الذي يرمى به الجمرة ‏\"‏ ‏.‏ وقال قال النبي صلى الله عليه وسلم يشير بيده كما يخذف الإنسان ‏.‏",
      "text_en": " It was narrated that Al-Fadl bin Abbas said:                      \"The Messenger of Allah said to the people when they moved on the evening of Arafat and the morning of Jam' (assembly at Al-Muzdalifah): 'You must have tranquility.' He was reining in his camel, and when he entered Mina, he came down to Muhassir and said: 'You have to pick up pebbles the size of date stones of fingertips with which to stone the Jamrat.' And he (Al-Fadl) said: 'And the Prophet gestured with his hand like a man throwing a pebble.'\"",
      "chain": [
        "30359",
        "20031",
        "11070",
        "11263",
        "13127",
        "17",
        "135"
      ]
    },
    {
      "hadith_no": "3058",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا يحيى، عن ابن جريج، قال أخبرني أبو الزبير، عن أبي معبد، عن عبد الله بن عباس، عن الفضل بن عباس، قال قال رسول الله صلى الله عليه وسلم للناس حين دفعوا عشية عرفة وغداة جمع ‏\"‏ عليكم بالسكينة ‏\"‏ ‏.‏ وهو كاف ناقته حتى إذا دخل منى فهبط حين هبط محسرا قال ‏\"‏ عليكم بحصى الخذف الذي ترمى به الجمرة ‏\"‏ ‏.‏ قال والنبي صلى الله عليه وسلم يشير بيده كما يخذف الإنسان ‏.‏",
      "text_en": " It was narrated that Al-Fadl bin Abbas said:                     \"The Messenger of Allah said to the people when they moved on the evening of Arafat and the morning of Jam' (assembly at Al-Muzdalifah): 'You must have tranquility.' He was reining in his camel, and when he entered Mina, he came down to Muhassir and said: 'You have to pick up pebbles the size of date stones of fingertips with which to stone the Jamrat.' And he (Al-Fadl) said: 'And the Prophet gestured with his hand like a man throwing a pebble.'\"",
      "chain": [
        "30359",
        "20031",
        "11070",
        "11263",
        "13127",
        "17",
        "135"
      ]
    },
    {
      "hadith_no": "3059",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا يحيى، قال حدثنا عوف، قال حدثنا زياد بن حصين، عن أبي العالية، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم غداة العقبة وهو واقف على راحلته ‏\"‏ هات القط لي ‏\"‏ ‏.‏ فلقطت له حصيات هن حصى الخذف فوضعتهن في يده وجعل يقول بهن في يده ووصف يحيى تحريكهن في يده بأمثال هؤلاء ‏.‏",
      "text_en": " It was narrated that Ibn Abbas said:                     \"On the morning of Al-Aqabah, while he was on his mount, the Messenger of Allh said: 'Pick up (some pebbles) for me.' So P picked up some pebbles for him that were the size of date stones of fingertips, and placed them in his hand. He started to do this with his hand.\" Yahya described him shaking them in his hand like this.",
      "chain": [
        "30359",
        "20031",
        "11298",
        "11618",
        "17"
      ]
    },
    {
      "hadith_no": "3128",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا عفان، قال حدثنا همام، قال حدثنا محمد بن جحادة، قال حدثني أبو حصين، أن ذكوان، حدثه أن أبا هريرة حدثه قال جاء رجل إلى رسول الله صلى الله عليه وسلم فقال دلني على عمل يعدل الجهاد قال ‏\"‏ لا أجده هل تستطيع إذا خرج المجاهد تدخل مسجدا فتقوم لا تفتر وتصوم لا تفطر ‏\"‏ ‏.‏ قال من يستطيع ذلك",
      "text_en": " Abu Hurairah said:                      \"A man came to the Messenger of Allah (ﷺ) and said: 'Tell me of an action that is equal to Jihad.' He said: 'I cannot. When the Mujahid goes out, can you enter the Masjid and stand in prayer and never rest, and fast and never break your fast?' He said: 'Who can do that?'\"",
      "chain": [
        "30359",
        "30106",
        "20297",
        "18897",
        "11371",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "3151",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا يحيى، - يعني ابن سعيد القطان - عن يحيى، - يعني ابن سعيد الأنصاري - قال حدثني ذكوان أبو صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لولا أن أشق على أمتي لم أتخلف عن سرية ولكن لا يجدون حمولة ولا أجد ما أحملهم عليه ويشق عليهم أن يتخلفوا عني ولوددت أني قتلت في سبيل الله ثم أحييت ثم قتلت ثم أحييت ثم قتلت ‏\"‏ ‏.‏ ثلاثا ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Prophet (ﷺ) said:                      \"Were it not that it would be too difficult for my Ummah, I would not have stayed behind from any expedition. But they could not find mounts, and I could not find any mounts for them, and it would be too hard for them to stay behind when I went out. And I wish that I could be killed in the cause of Allah, then brought back to life, then killed, then brought back to life, then killed,\" three times.",
      "chain": [
        "30359",
        "20031",
        "11062",
        "13"
      ]
    },
    {
      "hadith_no": "3230",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا يحيى، عن عبيد الله، عن سعيد بن أبي سعيد، عن أبيه، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ تنكح النساء لأربعة لمالها ولحسبها ولجمالها ولدينها فاظفر بذات الدين تربت يداك ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     It was narrated from Abu Hurairah that the Prophet said: \"Women are married for four things: their wealth, their nobility, their beauty and their religious commitment. Choose the one who is religiously committed, may your hands be rubbed with dust.\"",
      "chain": [
        "30359",
        "20031",
        "11201",
        "11168",
        "11212",
        "13"
      ]
    },
    {
      "hadith_no": "3236",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا يحيى، عن سفيان، قال حدثنا إسماعيل بن أمية، عن عبد الله بن عروة، عن عروة، عن عائشة، قالت تزوجني رسول الله صلى الله عليه وسلم في شوال وأدخلت عليه في شوال وكانت عائشة تحب أن تدخل نساءها في شوال فأى نسائه كانت أحظى عنده مني",
      "text_en": " Narrated 'Urwah:                     It was narrated from 'Urwah, that 'Aishah said: \"The Messenger of Allah married me in Shawwal and my marriage was consummated in Shawwal.\" --'Aishah liked for her women's marriages to be consummated in Shawwal --\"and which of his wives was more beloved to him than me?\"",
      "chain": [
        "30359",
        "20031",
        "20012",
        "11417",
        "11699",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "3295",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا يحيى، قال حدثنا هشام، قال حدثنا محمد، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا تنكح المرأة على عمتها ولا على خالتها ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah said:                      \"A woman should not be taken as a co-wife to her paternal aunt or her maternal aunt.\"",
      "chain": [
        "30359",
        "20031",
        "11065",
        "20278",
        "13"
      ]
    },
    {
      "hadith_no": "3300",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا يحيى، قال أنبأنا مالك، قال حدثني عبد الله بن دينار، عن سليمان بن يسار، عن عروة، عن عائشة، عن النبي صلى الله عليه وسلم قال ‏\"‏ ما حرمته الولادة حرمه الرضاع ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Aishah that the Prophet said:                      \"What becomes unlawful (for marriage) through birth becomes unlawful through breast-feeding.\"",
      "chain": [
        "30359",
        "20031",
        "20001",
        "11183",
        "11005",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "3334",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا يحيى، عن عبيد الله، قال أخبرني نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم نهى عن الشغار ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that the Messenger of Allah forbade Ash-Shighar.",
      "chain": [
        "30359",
        "20031",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3418",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا عبد الرحمن، عن سفيان، عن أبي بكر، - وهو ابن أبي الجهم - قال سمعت فاطمة بنت قيس، تقول أرسل إلى زوجي بطلاقي فشددت على ثيابي ثم أتيت النبي صلى الله عليه وسلم فقال ‏\"‏ كم طلقك ‏\"‏ ‏.‏ فقلت ثلاثا ‏.‏ قال ‏\"‏ ليس لك نفقة واعتدي في بيت ابن عمك ابن أم مكتوم فإنه ضرير البصر تلقين ثيابك عنده فإذا انقضت عدتك فآذنيني ‏\"‏ ‏.‏ مختصر ‏.‏",
      "text_en": " It was narrated that Abu Bakr -the son of Abu Al-Jahm- said:                      \"I heard Fatimah bint Qais say: 'My husband sent word to me that I was divorced, so I put on my garments and went to the Prophet. He said: 'How many times did he divorce you?' I said: 'Three.' He said: 'You are not entitled to maintenance. Observe your 'Iddah in the house of your paternal cousin Ibn Umm Maktum, for he is blind and you can take off your garments there. And when your 'Iddah is over let me know.'\" This is an abridgment.",
      "chain": [
        "30359",
        "20033",
        "20012",
        "10988"
      ]
    },
    {
      "hadith_no": "3419",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا عبد الرحمن، عن سفيان، عن منصور، عن مجاهد، عن تميم، مولى فاطمة عن فاطمة، نحوه ‏.‏",
      "text_en": " A similar report was narrated from Tamim, the freed slave of Fatimah, from Fatimah.",
      "chain": [
        "30359",
        "20033",
        "20012",
        "11067",
        "11028",
        "63"
      ]
    },
    {
      "hadith_no": "3431",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا يحيى، عن عبيد الله، قال أخبرني نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم عرضه يوم أحد وهو ابن أربع عشرة سنة فلم يجزه وعرضه يوم الخندق وهو ابن خمس عشرة سنة فأجازه ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that he presented himself to the Messenger of Allah on the Day of Uhud when he was fourteen years old, but he did not permit him (to join the army). He presented himself on the Day of Al-Khandaq when he was fifteen years old, and he permitted him (to join the army).",
      "chain": [
        "30359",
        "20031",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3434",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا ابن إدريس، عن مسعر، عن قتادة، عن زرارة بن أوفى، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله عز وجل تجاوز لأمتي ما وسوست به وحدثت به أنفسها ما لم تعمل أو تتكلم به ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                      \"The Messenger of Allah said: 'Allah, the Mighty and Sublime, has forgiven my Ummah for what is whispered to them or what enters their minds, so long as they do not act upon it or speak of it.'\"",
      "chain": [
        "30359",
        "20102",
        "20359",
        "11019",
        "11284",
        "13"
      ]
    },
    {
      "hadith_no": "3685",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Presents - كتاب النحل",
      "chapter_no": "31",
      "text_ar": "أخبرنا عبيد الله بن سعيد، عن يحيى، عن فطر، قال حدثني مسلم بن صبيح، قال سمعت النعمان بن بشير، يقول ذهب بي أبي إلى النبي صلى الله عليه وسلم يشهده على شىء أعطانيه فقال ‏\"‏ ألك ولد غيره ‏\"‏ ‏.‏ قال نعم ‏.‏ وصف بيده بكفه أجمع كذا ألا سويت بينهم ‏.‏",
      "text_en": " An-Nu'man bin Bashir said:                      \"My father took me to the Prophet to ask him to bear witness to something that he had given to me. He said: 'Do you have any other children?' He said: 'Yes.' He gestured with his hand held horizontally like this, (saying): 'Why don't you treat them all equally?'\"",
      "chain": [
        "30359",
        "20031",
        "11392",
        "274"
      ]
    },
    {
      "hadith_no": "3733",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of 'Umra - كتاب العمرى",
      "chapter_no": "34",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا محمد بن بكر، ‏{‏ قال أنبأنا ابن جريج، ‏}‏ قال أخبرني عطاء، عن حبيب بن أبي ثابت، عن ابن عمر، ولم يسمعه منه قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا عمرى ولا رقبى فمن أعمر شيئا أو أرقبه فهو له حياته ومماته ‏\"‏ ‏.‏ قال عطاء هو للآخر ‏.‏",
      "text_en": " Ibn Juraij said:                      'Ata' informed me, from Habib bin Abi Thabit, from Ibn 'Umar -and he did not hear it from him- he said: 'Allah's Messenger said: \"There is no 'Umra and no Ruqba. Whoever is given something on the basis of 'Umra or Ruqba, it belongs to him for the rest of his life and after he dies.\"' 'Ata' said: \"It belongs to the other.\"",
      "chain": [
        "30359",
        "20277",
        "11029",
        "11331",
        "18"
      ]
    },
    {
      "hadith_no": "3766",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا عبيد الله بن سعيد، وقتيبة بن سعيد، واللفظ، له قالا حدثنا سفيان، عن الزهري، عن سالم، عن أبيه، أنه سمع النبي صلى الله عليه وسلم عمر مرة وهو يقول وأبي وأبي ‏.‏ فقال ‏\"‏ إن الله ينهاكم أن تحلفوا بآبائكم ‏\"‏ ‏.‏ فوالله ما حلفت بها بعد ذاكرا ولا آثرا ‏.‏",
      "text_en": " It was narrated from Salim, from his father, that on one occasion the Prophet heard 'Umar saying:                      \"By my father and by my mother.\" He said: \"Allah forbids you to swear by your forefathers.\" 'Umar said: \"By Allah, I never swore by them again, whether saying it for myself or reporting it of others.\"",
      "chain": [
        "30359",
        "30367",
        "20005",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "4140",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Distribution of Al-Fay' - كتاب قسم الفىء",
      "chapter_no": "38",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا سفيان، عن عمرو، - يعني ابن دينار - عن الزهري، عن مالك بن أوس بن الحدثان، عن عمر، قال كانت أموال بني النضير مما أفاء الله على رسوله مما لم يوجف المسلمون عليه بخيل ولا ركاب فكان ينفق على نفسه منها قوت سنة وما بقي جعله في الكراع والسلاح عدة في سبيل الله ‏.‏",
      "text_en": " It was narrated that 'Umar said:                     \"The wealth of Banu An-Nadir was among the Fay' that Allah bestowed upon His Messenger, in cases where the Muslims did not go out on and expedition with horses and camels. From it he kept for himself food for one year, and what was left he spent on cavalry and weapons equipment for the cause of Allah.\"",
      "chain": [
        "30359",
        "20005",
        "11081",
        "11013",
        "5030",
        "3"
      ]
    },
    {
      "hadith_no": "4216",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of al-'Aqiqah - كتاب العقيقة",
      "chapter_no": "40",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا سفيان، قال قال عمرو عن عطاء، عن حبيبة بنت ميسرة، عن أم كرز، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ عن الغلام شاتان مكافأتان وعن الجارية شاة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Umm Kurz that the Messenger of Allah said:                     \"For a boy two sheep, Mukafaatan (of equal age), and for a girl, one sheep,",
      "chain": [
        "30359",
        "20005",
        "11081",
        "11029"
      ]
    },
    {
      "hadith_no": "4243",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of al-Fara' and al-'Atirah - كتاب الفرع والعتيرة",
      "chapter_no": "41",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا معاذ بن هشام، قال حدثني أبي، عن قتادة، عن الحسن، عن جون بن قتادة، عن سلمة بن المحبق، أن نبي الله صلى الله عليه وسلم في غزوة تبوك دعا بماء من عند امرأة قالت ما عندي إلا في قربة لي ميتة ‏.‏ قال ‏\"‏ أليس قد دبغتها ‏\"‏ ‏.‏ قالت بلى ‏.‏ قال ‏\"‏ فإن دباغها ذكاتها ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Salamah bin Al-Muhabbaq that:                     during the campaign of Tabuk, the Prophet of Allah called for water from a woman. She said: \"I only have a waterskin of mine made from a dead animal.\" He said: \"Didn't you tan it?\" She said: \"Of course.\" He said: \"Tanning it purifies it.\" (Daif)",
      "chain": [
        "30359",
        "20287",
        "20295",
        "11019",
        "11016",
        "14062",
        "5071"
      ]
    },
    {
      "hadith_no": "4253",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of al-Fara' and al-'Atirah - كتاب الفرع والعتيرة",
      "chapter_no": "41",
      "text_ar": "أخبرنا عبيد الله بن سعيد، عن يحيى، عن ابن أبي عروبة، عن قتادة، عن أبي المليح، عن أبيه، أن النبي صلى الله عليه وسلم نهى عن جلود السباع ‏.‏",
      "text_en": " It was narrated from Abu Al-Malih, from his father, that:                     the Prophet forbade (the use of) the hides of Predators. (Hassan)",
      "chain": [
        "30359",
        "20031",
        "11073",
        "11019",
        "11453",
        "4001"
      ]
    },
    {
      "hadith_no": "4397",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا يحيى، عن يحيى، ح وأنبأنا عمرو بن علي، قال حدثنا يحيى، عن يحيى بن سعيد، عن بشير بن يسار، عن أبي بردة بن نيار، أنه ذبح قبل النبي صلى الله عليه وسلم فأمره النبي صلى الله عليه وسلم أن يعيد ‏.‏ قال عندي عناق جذعة هي أحب إلى من مسنتين ‏.‏ قال ‏\"‏ اذبحها ‏\"‏ ‏.‏ في حديث عبيد الله فقال إني لا أجد إلا جذعة ‏.‏ فأمره أن يذبح ‏.‏",
      "text_en": " It was narrated from Abu Burdah bin Niyar that he slaughtered (his sacrifice) before the Prophet and the Prophet told him to repeat it. He said:                     \"I have a Jadh'ah she-goat that is dearer to me than two Muslinnahs.\"  He said: \"Sacrifice it,\" According to the Hadith of: Ubaidullah, he said: \"I cannot find anything but a Jadh'ah,\" and he told him to slaughter it. (Sahih )",
      "chain": [
        "30359",
        "20031",
        "20031",
        "30153",
        "20031",
        "11062",
        "11810",
        "1820"
      ]
    },
    {
      "hadith_no": "4428",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا يحيى، عن سعد بن إسحاق، قال حدثتني زينب، عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم نهى عن لحوم الأضاحي فوق ثلاثة أيام فقدم قتادة بن النعمان - وكان أخا أبي سعيد لأمه وكان بدريا - فقدموا إليه فقال أليس قد نهى عنه رسول الله صلى الله عليه وسلم قال أبو سعيد إنه قد حدث فيه أمر إن رسول الله صلى الله عليه وسلم نهانا أن نأكله فوق ثلاثة أيام ثم رخص لنا أن نأكله وندخره ‏.‏",
      "text_en": " It was narrated from Abu Sa'eed Al-Khudri that:                     the Messenger of Alllah forbade (Eating) the meat of sacrificial animals after three days. Then Qatadh bin An-Nu' man, who was brother of Abu Sa'eed through his mo0ther, and had been present at Badr, came and they offered him (some of the meat) .He said: \"Didn't the Messenger of Allah forbid it?\" Abu Sa eed said: \"Something happened later. The Messenger of Allah forbade us to eat it for more than three days, then he allowed us to eat it and store it.\" (Sahih )",
      "chain": [
        "30359",
        "20031",
        "57",
        "38"
      ]
    },
    {
      "hadith_no": "4431",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا يحيى، عن مالك، قال حدثني عبد الله بن أبي بكر، عن عمرة، عن عائشة، قالت دفت دافة من أهل البادية حضرة الأضحى فقال رسول الله صلى الله عليه وسلم ‏\"‏ كلوا وادخروا ثلاثا ‏\"‏ ‏.‏ فلما كان بعد ذلك قالوا يا رسول الله إن الناس كانوا ينتفعون من أضاحيهم يجملون منها الودك ويتخذون منها الأسقية ‏.‏ قال ‏\"‏ وما ذاك ‏\"‏ ‏.‏ قال الذي نهيت من إمساك لحوم الأضاحي ‏.‏ قال ‏\"‏ إنما نهيت للدافة التي دفت كلوا وادخروا وتصدقوا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \" \"Some Bedouins came to Al-Madinah at the time of (Eid) Al-Adha and the Messenger of Allah said: 'Eat, and store (the meat) for three days.' After that they said: 'O Messenger of Allah, the people used to benefit form their sacrifices by melting down the fat, and (also) making water skins from them.' He said: 'Why are you asking?' He said: 'Because you forbade us form keeping the meat of the sacrificial animals.' He said: 'I only forbade that because of the Bedouins who came. (Now) eat it, store it and give it in charity,\" (Sahih )",
      "chain": [
        "30359",
        "20031",
        "20001",
        "11104",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "4498",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا يحيى، عن عبيد الله، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم نهى عن التلقي ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that:                     the Messenger of Allah forbade meeting traders on the way.",
      "chain": [
        "30359",
        "20031",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "4518",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا يحيى، عن عبيد الله، قال أخبرني أبو الزناد، عن الأعرج، عن أبي هريرة، قال نهى رسول الله صلى الله عليه وسلم عن بيع الحصاة وعن بيع الغرر ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah forbade Gharar transaction and Hasah transactions.\"",
      "chain": [
        "30359",
        "20031",
        "11201",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "4538",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا يحيى، عن عبيد الله، قال أخبرني نافع، عن عبد الله، عن زيد بن ثابت، أن رسول الله صلى الله عليه وسلم رخص في بيع العرايا تباع بخرصها ‏.‏",
      "text_en": " It was narrated from Zaid bin Thabit that:                     the Messenger of Allah granted a concession allowing Araya sales by estimation.",
      "chain": [
        "30359",
        "20031",
        "11201",
        "11014",
        "18",
        "49"
      ]
    },
    {
      "hadith_no": "4606",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا يحيى، عن عبيد الله، قال أخبرني نافع، عن ابن عمر، أنهم كانوا يبتاعون على عهد رسول الله صلى الله عليه وسلم في أعلى السوق جزافا فنهاهم رسول الله صلى الله عليه وسلم أن يبيعوه في مكانه حتى ينقلوه ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that:                     they used to buy and sell during the time of the Messenger of Allah at the top of the marketplace without measuring. The Messenger of Allah forbade them to sell it in the place where they had bought it until they moved it.",
      "chain": [
        "30359",
        "20031",
        "11201",
        "11014"
      ]
    },
    {
      "hadith_no": "4614",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا يحيى، عن شعبة، عن عبد الله بن أبي المجالد، قال سألت ابن أبي أوفى عن السلف، قال كنا نسلف على عهد رسول الله صلى الله عليه وسلم وأبي بكر وعمر في البر والشعير والتمر إلى قوم لا أدري أعندهم أم لا ‏.‏ وابن أبزى قال مثل ذلك ‏.‏",
      "text_en": " It was narrated that 'Abdullah Ibn Abi Awfa about paying in advance. He said:                     'We used to pay in advance during the time of the Messenger of Allah and Abu Bakr and 'Umar, for wheat, barley and dates, paying people whom we did not know if they had those things or not.'''Ibn Abza said meaning, similarly.",
      "chain": [
        "30359",
        "20031",
        "20020",
        "11701",
        "5115"
      ]
    },
    {
      "hadith_no": "5139",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا معاذ بن هشام، قال حدثني أبي، عن يحيى بن أبي كثير، قال حدثني محمود بن عمرو، أن أسماء بنت يزيد، حدثته أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أيما امرأة تحلت - يعني - بقلادة من ذهب جعل في عنقها مثلها من النار وأيما امرأة جعلت في أذنها خرصا من ذهب جعل الله عز وجل في أذنها مثله خرصا من النار يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " Asma' bint Yazid narrated that:                     The Messenger of Allah [SAW] said: \"Any woman who puts on a necklace of gold, Allah will put something similar of fire around her neck. Any woman who puts earrings of gold on her ears, Allah, the Mighty and Sublime, will put earrings of fire on her ears on the Day of Resurrection.\"",
      "chain": [
        "30359",
        "20287",
        "20295",
        "11449",
        "84"
      ]
    },
    {
      "hadith_no": "5140",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا معاذ بن هشام، قال حدثني أبي، عن يحيى بن أبي كثير، قال حدثني زيد، عن أبي سلام، عن أبي أسماء الرحبي، أن ثوبان، مولى رسول الله صلى الله عليه وسلم حدثه قال جاءت بنت هبيرة إلى رسول الله صلى الله عليه وسلم وفي يدها فتخ - فقال كذا في كتاب أبي أى خواتيم ضخام - فجعل رسول الله صلى الله عليه وسلم يضرب يدها فدخلت على فاطمة بنت رسول الله صلى الله عليه وسلم تشكو إليها الذي صنع بها رسول الله صلى الله عليه وسلم فانتزعت فاطمة سلسلة في عنقها من ذهب وقالت هذه أهداها إلى أبو حسن فدخل رسول الله صلى الله عليه وسلم والسلسلة في يدها فقال ‏\"‏ يا فاطمة أيغرك أن يقول الناس ابنة رسول الله وفي يدها سلسلة من نار ‏\"‏ ‏.‏ ثم خرج ولم يقعد فأرسلت فاطمة بالسلسلة إلى السوق فباعتها واشترت بثمنها غلاما - وقال مرة عبدا - وذكر كلمة معناها فأعتقته فحدث بذلك فقال ‏\"‏ الحمد لله الذي أنجى فاطمة من النار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Asma' Ar-Rahabi that Thawban, the freed slave of the Messenger of Allah [SAW], told him:                     \"Fatimah bint Hubairah came to the Messenger of Allah [SAW] with a big ring on her hand.\" He (the narrator) said: \"This is what I found in the book of my father, a huge ring.\"- \"The Messenger of Allah [SAW] started hitting her hand, so she entered upon Fatimah, the daughter of the Messenger of Allah [SAW], and complained to her about what the Messenger of Allah [SAW] had done. Fatimah took off a gold chain from her neck and said: 'This was given to me by Abu Hasan.' The Messenger of Allah [SAW] came in and (ﷺ) the chain in her hand. He said: 'O Fatimah, would you like the people to say that the daughter of the Messenger of Allah [SAW] has a chain of fire in her hand?' Then he went out, without sitting down. Fatimah sent the chain to the market and sold it, and she bought a slave with the money, and set him free. He was told of that and he said: 'Praise be to Allah, Who has saved Fatimah from the Fire.'\"",
      "chain": [
        "30359",
        "20287",
        "20295",
        "11449",
        "15",
        "10883"
      ]
    },
    {
      "hadith_no": "5183",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا حماد بن مسعدة، عن أشعث، عن محمد، عن عبيدة، عن علي، قال نهاني النبي صلى الله عليه وسلم عن القسي والحرير وخاتم الذهب وأن أقرأ راكعا ‏.‏ خالفه هشام ولم يرفعه ‏.‏",
      "text_en": " It was narrated that 'Ali said:                     \"The Prophet [SAW] forbade me from Al-Qassi, silk, gold rings, and that I recite Qur'an while bowing.\" Hisham contradicted him, he did not narrate it in Marfu' form.",
      "chain": [
        "30359",
        "20224",
        "11324",
        "20278",
        "11370",
        "5"
      ]
    },
    {
      "hadith_no": "5226",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا يحيى، عن عبيد الله، قال أخبرني نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏\"‏ أحفوا الشوارب وأعفوا اللحى ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that:                     The Prophet [SAW] said: \"Trim the mustache and let the beard grow.\"",
      "chain": [
        "30359",
        "20031",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "5249",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا يحيى، عن عبيد الله، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم لعن الواصلة ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that:                     The Messenger of Allah [SAW] cursed the woman who affixes hair extensions.",
      "chain": [
        "30359",
        "20031",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "5260",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا جرير، عن ابن عجلان، عن بكير، ح وأنبأنا عبيد الله بن سعيد، قال حدثنا يحيى، عن ابن عجلان، قال حدثني بكير بن عبد الله بن الأشج، عن بسر بن سعيد، عن زينب، امرأة عبد الله قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا شهدت إحداكن العشاء فلا تمس طيبا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Zainab, the wife of 'Abdullah, said:                     \"The Messenger of Allah [SAW] said: 'If one of you (women) wants to attend 'Isha' (prayer). Let her not touch any perfume.'\"",
      "chain": [
        "30123",
        "20028",
        "10616",
        "11154",
        "30359",
        "20031",
        "10616",
        "11154",
        "11153"
      ]
    },
    {
      "hadith_no": "5607",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا يحيى، - يعني ابن سعيد - عن عبيد الله، قال حدثنا عمرو بن شعيب، عن أبيه، عن جده، عن النبي صلى الله عليه وسلم قال ‏\"‏ ما أسكر كثيره فقليله حرام ‏\"‏ ‏.‏",
      "text_en": " 'Amr bin Shu'aib narrated from his father, from his grandfather, that:                     The Prophet [SAW] said: \"What intoxicates in large amounts, a small amount of it is unlawful.\"",
      "chain": [
        "30359",
        "20031",
        "11201",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "5631",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا يحيى، عن عبيد الله، قال أخبرني نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم نهى عن المزفت والقرع ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that :                     The Messenger of Allah [SAW] forbade Al-Muzaffat and squashes.",
      "chain": [
        "30359",
        "20031",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "5751",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "حدثنا عبيد الله بن سعيد، عن أبي أسامة، قال سمعت ابن المبارك، يقول ما وجدت الرخصة في المسكر عن أحد صحيحا إلا عن إبراهيم ‏.‏",
      "text_en": " Ibn Al-Mubarak said:                     \"I have never found any sound report, giving a concession on intoxicants, except the report narrated from Ibrahim.\"",
      "chain": [
        "30359",
        "20318",
        "20025"
      ]
    },
    {
      "hadith_no": "5752",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال سمعت أبا أسامة، يقول ما رأيت رجلا أطلب للعلم من عبد الله بن المبارك الشامات ومصر واليمن والحجاز ‏.‏",
      "text_en": " 'Ubaidullah bin Sa'eed said:                     \"I heard Abu Usamah say: 'I never saw any man more assiduous in seeking knowledge than 'Abdullah bin Al-Mubarak, not in Ash-Sham, Egypt, Yemen or the Hijaz.'\"",
      "chain": [
        "30359",
        "20318"
      ]
    }
  ],
  "total_hadiths": 155
}