{
  "id": "30360",
  "name": "'Ubaid bin Isma'il al-Quraishi عبيد بن إسماعيل القرشي الهباري",
  "full_name": "'Ubaid bin Isma'il al-Quraishi عبيد بن إسماعيل القرشي الهباري",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "250",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  -  ثقة ]"
    ],
    "tags": [
      "Quraish",
      "Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20347",
      "name": "'Isa bin Yonus bin Abi Ishaq عيسى بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20318",
      "name": "Hammad bin Usamah حماد بن أسامة - أبو أسامة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20333",
      "name": "'Abdur Rahman bin Muhammad al-Maharbi عبد الرحمن بن محمد بن زياد المحاربي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "11027",
      "name": "Abu Idrees al-Khulani أبو إدريس الخولاني",
      "grade": "Follower(Tabi') [2nd Generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "33023",
      "name": "Muhammad bin al-'Abbas bin 'Uthman محمد بن العباس بن عثمان بن شافع",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "317",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا عبيد بن إسماعيل، قال حدثنا أبو أسامة، عن هشام، عن أبيه، عن عائشة، قالت خرجنا موافين لهلال ذي الحجة، فقال رسول الله صلى الله عليه وسلم ‏\"‏ من أحب أن يهل بعمرة فليهلل، فإني لولا أني أهديت لأهللت بعمرة ‏\"‏‏.‏ فأهل بعضهم بعمرة، وأهل بعضهم بحج، وكنت أنا ممن أهل بعمرة، فأدركني يوم عرفة وأنا حائض، فشكوت إلى النبي صلى الله عليه وسلم فقال ‏\"‏ دعي عمرتك، وانقضي رأسك وامتشطي، وأهلي بحج ‏\"‏‏.‏ ففعلت حتى إذا كان ليلة الحصبة أرسل معي أخي عبد الرحمن بن أبي بكر، فخرجت إلى التنعيم، فأهللت بعمرة مكان عمرتي‏.‏ قال هشام ولم يكن في شىء من ذلك هدى ولا صوم ولا صدقة‏.‏",
      "text_en": " Narrated `Aisha:                     On the 1st of Dhul-Hijja we set out with the intention of performing Hajj. Allah's Apostle said, \"Any one who likes to assume the Ihram for `Umra he can do so. Had I not brought the Hadi with me, I would have assumed the Ihram for `Umra. \"Some of us assumed the Ihram for `Umra while the others assumed the Ihram for Hajj. I was one of those who assumed the Ihram for `Umra. I got menses and kept on menstruating until the day of `Arafat and complained of that to the Prophet . He told me to postpone my `Umra, undo and comb my hair, and to assure the Ihram of Hajj and I did so. On the right of Hasba, he sent my brother `Abdur-Rahman bin Abi Bakr with me to at-Tan`im, where I assumed the Ihram for `Umra in lieu of the previous one. Hisham said, \"For that (`Umra) no Hadi, fasting or alms were required.",
      "chain": [
        "30360",
        "20318",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "356",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عبيد بن إسماعيل، قال حدثنا أبو أسامة، عن هشام، عن أبيه، أن عمر بن أبي سلمة، أخبره قال رأيت رسول الله صلى الله عليه وسلم يصلي في ثوب واحد مشتملا به في بيت أم سلمة، واضعا طرفيه على عاتقيه‏.‏",
      "text_en": " Narrated `Umar bin Abi Salama:                     In the house of Um-Salama I saw Allah's Apostle offering prayers, wrapped in a single garment around his body with its ends crossed round his shoulders.",
      "chain": [
        "30360",
        "20318",
        "11065",
        "10511",
        "246"
      ]
    },
    {
      "hadith_no": "439",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عبيد بن إسماعيل، قال حدثنا أبو أسامة، عن هشام، عن أبيه، عن عائشة، أن وليدة، كانت سوداء لحى من العرب، فأعتقوها، فكانت معهم قالت فخرجت صبية لهم عليها وشاح أحمر من سيور قالت فوضعته أو وقع منها، فمرت به حدياة وهو ملقى، فحسبته لحما فخطفته قالت فالتمسوه فلم يجدوه قالت فاتهموني به قالت فطفقوا يفتشون حتى فتشوا قبلها قالت والله إني لقائمة معهم، إذ مرت الحدياة فألقته قالت فوقع بينهم قالت فقلت هذا الذي اتهمتموني به  زعمتم  وأنا منه بريئة، وهو ذا هو قالت فجاءت إلى رسول الله صلى الله عليه وسلم فأسلمت‏.‏ قالت عائشة فكان لها خباء في المسجد أو حفش قالت فكانت تأتيني فتحدث عندي قالت فلا تجلس عندي مجلسا إلا قالت ويوم الوشاح من أعاجيب ربنا ألا إنه من بلدة الكفر أنجاني قالت عائشة فقلت لها ما شأنك لا تقعدين معي مقعدا إلا قلت هذا قالت فحدثتني بهذا الحديث‏.‏",
      "text_en": " Narrated `Aisha:                     There was a black slave girl belonging to an 'Arab tribe and they manumitted her but she remained with them. The slave girl said, \"Once one of their girls (of that tribe) came out wearing a red leather scarf decorated with precious stones. It fell from her or she placed it somewhere. A kite passed by that place, saw it Lying there and mistaking it for a piece of meat, flew away with it. Those people searched for it but they did not find it. So they accused me of stealing it and started searching me and even searched my private parts.\" The slave girl further said, \"By Allah! while I was standing (in that state) with those people, the same kite passed by them and dropped the red scarf and it fell amongst them. I told them, 'This is what you accused me of and I was innocent and now this is it.' \" `Aisha added: That slave girl came to Allah's Apostle and embraced Islam. She had a tent or a small room with a low roof in the mosque. Whenever she called on me, she had a talk with me and whenever she sat with me, she would recite the following: \"The day of the scarf (band) was one of the wonders of our Lord, verily He rescued me from the disbelievers' town. `Aisha added: \"Once I asked her, 'What is the matter with you? Whenever you sit with me, you always recite these poetic verses.' On that she told me the whole story. \"",
      "chain": [
        "30360",
        "20318",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "584",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا عبيد بن إسماعيل، عن أبي أسامة، عن عبيد الله، عن خبيب بن عبد الرحمن، عن حفص بن عاصم، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم نهى عن بيعتين وعن لبستين وعن صلاتين نهى عن الصلاة بعد الفجر حتى تطلع الشمس، وبعد العصر حتى تغرب الشمس، وعن اشتمال الصماء وعن الاحتباء في ثوب واحد يفضي بفرجه إلى السماء، وعن المنابذة والملامسة‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle forbade two kinds of sales, two kinds of dresses, and two prayers. He forbade offering prayers after the Fajr prayer till the rising of the sun and after the `Asr prayer till its setting. He also forbade \"Ishtimal-Assama [??] \" and \"al-Ihtiba\" in one garment in such a way that one's private parts are exposed towards the sky. He also forbade the sales called \"Munabadha\" and \"Mulamasa.\" (See Hadith No. 354 and 355 Vol. 3).",
      "chain": [
        "30360",
        "20318",
        "11201",
        "11159",
        "11420",
        "13"
      ]
    },
    {
      "hadith_no": "673",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبيد بن إسماعيل، عن أبي أسامة، عن عبيد الله، عن نافع، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا وضع عشاء أحدكم وأقيمت الصلاة فابدءوا بالعشاء، ولا يعجل حتى يفرغ منه ‏\"‏‏.‏ وكان ابن عمر يوضع له الطعام وتقام الصلاة فلا يأتيها حتى يفرغ، وإنه ليسمع قراءة الإمام‏.‏",
      "text_en": " Narrated Nafi`:                     Ibn `Umar said, \"Allah's Apostle said, 'If the supper is served for anyone of you and the Iqama is pronounced, start with the supper and don't be in haste (and carry on eating) till you finish it.\" If food was served for Ibn `Umar and Iqama was pronounced, he never came to the prayer till he finished it (i.e. food) in spite of the fact that he heard the recitation (of the Qur'an) by the Imam (in the prayer).",
      "chain": [
        "30360",
        "20318",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "952",
      "source": " Sahih Bukhari ",
      "chapter": "The Two Festivals (Eids) - كتاب العيدين",
      "chapter_no": "13",
      "text_ar": "حدثنا عبيد بن إسماعيل، قال حدثنا أبو أسامة، عن هشام، عن أبيه، عن عائشة  رضى الله عنها  قالت دخل أبو بكر وعندي جاريتان من جواري الأنصار تغنيان بما تقاولت الأنصار يوم بعاث  قالت وليستا بمغنيتين  فقال أبو بكر أمزامير الشيطان في بيت رسول الله صلى الله عليه وسلم وذلك في يوم عيد‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ يا أبا بكر إن لكل قوم عيدا، وهذا عيدنا ‏\"‏‏.‏",
      "text_en": " Narrated Aisha:                     Abu Bakr came to my house while two small Ansari girls were singing beside me the stories of the Ansar concerning the Day of Buath. And they were not singers. Abu Bakr said protestingly, \"Musical instruments of Satan in the house of Allah's Apostle !\" It happened on the `Id day and Allah's Apostle said, \"O Abu Bakr! There is an `Id for every nation and this is our `Id.\"",
      "chain": [
        "30360",
        "20318",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1610",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عبيد بن إسماعيل، حدثنا أبو أسامة، عن هشام، عن أبيه، عن عائشة  رضى الله عنها  قالت قال لي رسول الله صلى الله عليه وسلم ‏\"‏ لولا حداثة قومك بالكفر لنقضت البيت ثم لبنيته على أساس إبراهيم  عليه السلام  فإن قريشا استقصرت بناءه  وجعلت له خلفا ‏\"‏‏.‏ قال أبو معاوية حدثنا هشام خلفا يعني بابا‏.‏",
      "text_en": " Narrated `Aisha:                     Allah's Apostle said to me, \"Were your people not close to the Pre-Islamic period of ignorance, I would have demolished the Ka`ba and would have rebuilt it on its original foundations laid by Abraham (for Quraish had curtailed its building), and I would have built a back door (too).\"",
      "chain": [
        "30360",
        "20318",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1922",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of Madinah - كتاب فضائل المدينة",
      "chapter_no": "29",
      "text_ar": "حدثنا عبيد بن إسماعيل، حدثنا أبو أسامة، عن هشام، عن أبيه، عن عائشة  رضى الله عنها  قالت لما قدم رسول الله صلى الله عليه وسلم المدينة وعك أبو بكر وبلال، فكان أبو بكر إذا أخذته الحمى يقول كل امرئ مصبح في أهله والموت أدنى من شراك نعله وكان بلال إذا أقلع عنه الحمى يرفع عقيرته يقول ألا ليت شعري هل أبيتن ليلة بواد وحولي إذخر وجليل وهل أردن يوما مياه مجنة وهل يبدون لي شامة وطفيل قال اللهم العن شيبة بن ربيعة، وعتبة بن ربيعة، وأمية بن خلف، كما أخرجونا من أرضنا إلى أرض الوباء ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ اللهم حبب إلينا المدينة كحبنا مكة أو أشد، اللهم بارك لنا في صاعنا، وفي مدنا، وصححها لنا وانقل حماها إلى الجحفة ‏\"‏‏.‏ قالت وقدمنا المدينة، وهى أوبأ أرض الله‏.‏ قالت فكان بطحان يجري نجلا‏.‏ تعني ماء آجنا‏.‏",
      "text_en": " Narrated `Aisha:                     When Allah's Apostle reached Medina, Abu Bakr and Bilal became ill. When Abu Bakr's fever got worse, he would recite (this poetic verse): \"Everybody is staying alive with his People, yet Death is nearer to him than His shoe laces.\" And Bilal, when his fever deserted him, would recite: \"Would that I could stay overnight in A valley wherein I would be Surrounded by Idhkhir and Jalil (kinds of goodsmelling grass). Would that one day I could Drink the water of the Majanna, and Would that (The two mountains) Shama and Tafil would appear to me!\" The Prophet said, \"O Allah! Curse Shaiba bin Rabi`a and `Utba bin Rabi`a and Umaiya bin Khalaf as they turned us out of our land to the land of epidemics.\" Allah's Apostle then said, \"O Allah! Make us love Medina as we love Mecca or even more than that. O Allah! Give blessings in our Sa and our Mudd (measures symbolizing food) and make the climate of Medina suitable for us, and divert its fever towards Aljuhfa.\" Aisha added: When we reached Medina, it was the most unhealthy of Allah's lands, and the valley of Bathan (the valley of Medina) used to flow with impure colored water.",
      "chain": [
        "30360",
        "20318",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1919",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا عبيد بن إسماعيل، عن أبي أسامة، عن عبيد الله، عن نافع، عن ابن عمر‏.‏والقاسم بن محمد عن عائشة  رضى الله عنها  أن بلالا، كان يؤذن بليل فقال رسول الله صلى الله عليه وسلم ‏\"‏ كلوا واشربوا حتى يؤذن ابن أم مكتوم، فإنه لا يؤذن حتى يطلع الفجر ‏\"‏‏.‏ قال القاسم ولم يكن بين أذانهما إلا أن يرقى ذا وينزل ذا‏.‏",
      "text_en": " Narrated `Aisha:                     Bilal used to pronounce the Adhan at night, so Allah's Apostle? said, \"Carry on taking your meals (eat and drink) till Ibn Um Maktum pronounces the Adhan, for he does not pronounce it till it is dawn.",
      "chain": [
        "30360",
        "20318",
        "11201",
        "11014",
        "53"
      ]
    },
    {
      "hadith_no": "2043",
      "source": " Sahih Bukhari ",
      "chapter": "Retiring to a Mosque for Remembrance of Allah (I'tikaf) - كتاب الاعتكاف",
      "chapter_no": "33",
      "text_ar": "حدثنا عبيد بن إسماعيل، حدثنا أبو أسامة، عن عبيد الله، عن نافع، عن ابن عمر، أن عمر  رضى الله عنه  نذر في الجاهلية أن يعتكف في المسجد الحرام  قال أراه قال  ليلة قال له رسول الله صلى الله عليه وسلم ‏\"‏ أوف بنذرك ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     that `Umar had vowed in the Pre-Islamic period to perform I`tikaf in Al-Masjid-al-Haram. (A subnarrator thinks that `Umar vowed to perform I`tikaf for one night.) Allah's Apostle said to `Umar, \"Fulfill your vow.\"",
      "chain": [
        "30360",
        "20318",
        "11201",
        "11014",
        "18",
        "3"
      ]
    },
    {
      "hadith_no": "2523",
      "source": " Sahih Bukhari ",
      "chapter": "Manumission of Slaves - كتاب العتق",
      "chapter_no": "49",
      "text_ar": "حدثنا عبيد بن إسماعيل، عن أبي أسامة، عن عبيد الله، عن نافع، عن ابن عمر  رضى الله عنهما  قال رسول الله صلى الله عليه وسلم ‏\"‏ من أعتق شركا له في مملوك فعليه عتقه كله، إن كان له مال يبلغ ثمنه، فإن لم يكن له يقوم عليه قيمة عدل، فأعتق منه ما أعتق ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     Allah's Apostle said, \"Whoever manumits his share of a slave, then it is essential for him to get that slave manumitted' completely as long as he has the money to do so. If he has not sufficient money to pay the price of the other shares (after the price of the slave is evaluated justly), the manumitted manumits the slave partially in proportion to his share.",
      "chain": [
        "30360",
        "20318",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2538",
      "source": " Sahih Bukhari ",
      "chapter": "Manumission of Slaves - كتاب العتق",
      "chapter_no": "49",
      "text_ar": "حدثنا عبيد بن إسماعيل، حدثنا أبو أسامة، عن هشام، أخبرني أبي أن حكيم بن حزام  رضى الله عنه  أعتق في الجاهلية مائة رقبة، وحمل على مائة بعير، فلما أسلم حمل على مائة بعير وأعتق مائة رقبة، قال فسألت رسول الله صلى الله عليه وسلم فقلت يا رسول الله، أرأيت أشياء كنت أصنعها في الجاهلية، كنت أتحنث بها، يعني أتبرر بها، قال فقال رسول الله صلى الله عليه وسلم ‏\"‏ أسلمت على ما سلف لك من خير ‏\"‏‏.‏",
      "text_en": " Narrated Hisham:                     My father told me that Hakim bin Hizam manumitted one-hundred slaves in the Pre-Islamic period of ignorance and slaughtered one-hundred camels (and distributed them in charity). When he embraced Islam he again slaughtered one-hundred camels and manumitted one-hundred slaves. Hakim said, \"I asked Allah's Apostle, 'O Allah's Apostle! What do you think about some good deeds I used to practice in the Pre-Islamic period of ignorance regarding them as deeds of righteousness?' Allah's Apostle said, \"You have embraced Islam along with all those good deeds you did.\"",
      "chain": [
        "30360",
        "20318",
        "11065",
        "10511",
        "423"
      ]
    },
    {
      "hadith_no": "2563",
      "source": " Sahih Bukhari ",
      "chapter": "Makaatib - كتاب المكاتب",
      "chapter_no": "50",
      "text_ar": "حدثنا عبيد بن إسماعيل، حدثنا أبو أسامة، عن هشام، عن أبيه، عن عائشة  رضى الله عنها  قالت جاءت بريرة فقالت إني كاتبت أهلي على تسع أواق، في كل عام وقية، فأعينيني‏.‏ فقالت عائشة إن أحب أهلك أن أعدها لهم عدة واحدة، وأعتقك فعلت، ويكون ولاؤك لي‏.‏ فذهبت إلى أهلها، فأبوا ذلك عليها، فقالت إني قد عرضت ذلك عليهم، فأبوا إلا أن يكون الولاء لهم‏.‏ فسمع بذلك رسول الله صلى الله عليه وسلم فسألني فأخبرته، فقال ‏\"‏ خذيها، فأعتقيها، واشترطي لهم الولاء، فإنما الولاء لمن أعتق ‏\"‏‏.‏ قالت عائشة فقام رسول الله صلى الله عليه وسلم في الناس، فحمد الله، وأثنى عليه، ثم قال ‏\"‏ أما بعد، فما بال رجال منكم يشترطون شروطا ليست في كتاب الله فأيما شرط ليس في كتاب الله فهو باطل، وإن كان مائة شرط، فقضاء الله أحق، وشرط الله أوثق، ما بال رجال منكم يقول أحدهم أعتق يا فلان ولي الولاء إنما الولاء لمن أعتق ‏\"‏‏.‏",
      "text_en": " Narrated Aisha:                     Buraira came (to `Aisha) and said, \"I have made a contract of emancipation with my masters for nine Uqiyas (of gold) to be paid in yearly installments. Therefore, I seek your help.\" `Aisha said, \"If your masters agree, I will pay them the sum at once and free you on condition that your Wala' will be for me.\" Buraira went to her masters but they refused that offer. She (came back) and said, \"I presented to them the offer but they refused, unless the Wala' was for them.\" Allah's Apostle heard of that and asked me about it, and I told him about it. On that he said, \"Buy and manumit her and stipulate that the Wala' should be for you, as Wala' is for the liberator.\" `Aisha added, \"Allah's Apostle then got up amongst the people, Glorified and Praised Allah, and said, 'Then after: What about some people who impose conditions which are not present in Allah's Laws? So, any condition which is not present in Allah's Laws is invalid even if they were one-hundred conditions. Allah's ordinance is the truth, and Allah's condition is stronger and more solid. Why do some men from you say, O so-and-so! manumit the slave but the Wala will be for me? Verily, the Wala is for the liberator.\"",
      "chain": [
        "30360",
        "20318",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2620",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا عبيد بن إسماعيل، حدثنا أبو أسامة، عن هشام، عن أبيه، عن أسماء بنت أبي بكر  رضى الله عنهما  قالت قدمت على أمي وهى مشركة، في عهد رسول الله صلى الله عليه وسلم، فاستفتيت رسول الله صلى الله عليه وسلم قلت ‏{‏إن أمي قدمت‏}‏ وهى راغبة، أفأصل أمي قال ‏\"‏ نعم صلي أمك ‏\"‏‏.‏",
      "text_en": " Narrated Asma' bint Abu Bakr:                     My mother came to me during the lifetime of Allah's Apostle and she was a pagan. I said to Allah's Apostle (seeking his verdict), \"My mother has come to me and she desires to receive a reward from me, shall I keep good relations with her?\" The Prophet said, \"Yes, keep good relation with her. \"",
      "chain": [
        "30360",
        "20318",
        "11065",
        "10511",
        "70"
      ]
    },
    {
      "hadith_no": "2765",
      "source": " Sahih Bukhari ",
      "chapter": "Wills and Testaments (Wasaayaa) - كتاب الوصايا",
      "chapter_no": "55",
      "text_ar": "حدثنا عبيد بن إسماعيل، حدثنا أبو أسامة، عن هشام، عن أبيه، عن عائشة  رضى الله عنها – ‏{‏ومن كان غنيا فليستعفف ومن كان فقيرا فليأكل بالمعروف‏}‏‏.‏ قالت أنزلت في والي اليتيم أن يصيب من ماله إذا كان محتاجا بقدر ماله بالمعروف‏.‏",
      "text_en": " Narrated `Aisha:                     The following Verse:-- \"If a guardian is well-off, let him claim no remuneration (i.e. wages), but if he is poor, let him have for himself what is just and reasonable.\" (4.6) was revealed in connection with the guardian of an orphan, and it means that if he is poor he can have for himself (from the orphan's wealth) what is just and reasonable according to the orphan's share of the inheritance.",
      "chain": [
        "30360",
        "20318",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2863",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عبيد بن إسماعيل، عن أبي أسامة، عن عبيد الله، عن نافع، عن ابن عمر  رضى الله عنهما أن رسول الله صلى الله عليه وسلم جعل للفرس سهمين ولصاحبه سهما‏.‏ وقال مالك يسهم للخيل والبراذين منها لقوله ‏{‏والخيل والبغال والحمير لتركبوها‏}‏ ولا يسهم لأكثر من فرس‏.‏",
      "text_en": " Narrated Ibn `Umar:                     Allah's Apostle fixed two shares for the horse and one share for its rider (from the war booty).",
      "chain": [
        "30360",
        "20318",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2865",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثني عبيد بن إسماعيل، عن أبي أسامة، عن عبيد الله، عن نافع، عن ابن عمر  رضى الله عنهما  عن النبي صلى الله عليه وسلم‏.‏ أنه كان إذا أدخل رجله في الغرز واستوت به ناقته قائمة، أهل من عند مسجد ذي الحليفة‏.‏",
      "text_en": " Narrated Ibn'`Umar:                     When the Prophet put his feet in the stirrup and the she-camel got up carrying him he would start reciting Talbiya at the mosque of Dhul-Hulaifa.",
      "chain": [
        "30360",
        "20318",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2979",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عبيد بن إسماعيل، حدثنا أبو أسامة، عن هشام، قال أخبرني أبي و، حدثتني أيضا، فاطمة عن أسماء  رضى الله عنها  قالت صنعت سفرة رسول الله صلى الله عليه وسلم في بيت أبي بكر حين أراد أن يهاجر إلى المدينة، قالت فلم نجد لسفرته ولا لسقائه ما نربطهما به، فقلت لأبي بكر والله ما أجد شيئا أربط به إلا نطاقي‏.‏ قال فشقيه باثنين، فاربطيه بواحد السقاء وبالآخر السفرة‏.‏ ففعلت، فلذلك سميت ذات النطاقين‏.‏",
      "text_en": " Narrated Asma:                     I prepared the journey-food for Allah's Apostle in Abu Bakr's house when he intended to emigrate to Medina. I could not find anything to tie the food-container and the water skin with. So, I said to Abu Bakr, \"By Allah, I do not find anything to tie (these things) with except my waist belt.\" He said, \"Cut it into two pieces and tie the water-skin with one piece and the food-container with the other (the subnarrator added, \"She did accordingly and that was the reason for calling her Dhatun-Nitaqain (i.e. twobelted woman)).",
      "chain": [
        "30360",
        "20318",
        "11065",
        "70"
      ]
    },
    {
      "hadith_no": "3198",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثني عبيد بن إسماعيل، حدثنا أبو أسامة، عن هشام، عن أبيه، عن سعيد بن زيد بن عمرو بن نفيل، أنه خاصمته أروى في حق زعمت أنه انتقصه لها إلى مروان، فقال سعيد أنا أنتقص من حقها شيئا، أشهد لسمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من أخذ شبرا من الأرض ظلما، فإنه يطوقه يوم القيامة من سبع أرضين ‏\"‏‏.‏ قال ابن أبي الزناد عن هشام عن أبيه قال قال لي سعيد بن زيد دخلت على النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Sa`id bin Zaid bin `Amr bin Nufail:                     That Arwa sued him before Marwan for a right, which she claimed, he had deprived her of. On that Sa`id said, \"How should I deprive her of her right? I testify that I heard Allah's Apostle saying, 'If anyone takes a span of land unjustly, his neck will be encircled with it down seven earths on the Day of Resurrection.\"",
      "chain": [
        "30360",
        "20318",
        "11065",
        "10511",
        "11"
      ]
    },
    {
      "hadith_no": "3308",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا عبيد بن إسماعيل، حدثنا أبو أسامة، عن هشام، عن أبيه، عن عائشة  رضى الله عنها  قالت قال النبي صلى الله عليه وسلم ‏\"‏ اقتلوا ذا الطفيتين، فإنه يلتمس البصر، ويصيب الحبل ‏\"‏‏.‏ تابعه حماد بن سلمة أبا أسامة",
      "text_en": " Narrated `Aisha:                     The Prophet said, \"Kill the snake with two white lines on its back, for it blinds the on-looker and causes abortion.\"",
      "chain": [
        "30360",
        "20318",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "3383",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثني عبيد بن إسماعيل، عن أبي أسامة، عن عبيد الله، قال أخبرني سعيد بن أبي سعيد، عن أبي هريرة  رضى الله عنه  سئل رسول الله صلى الله عليه وسلم من أكرم الناس قال ‏\"‏ أتقاهم لله ‏\"‏‏.‏ قالوا ليس عن هذا نسألك‏.‏ قال ‏\"‏ فأكرم الناس يوسف نبي الله ابن نبي الله ابن نبي الله ابن خليل الله ‏\"‏‏.‏ قالوا ليس عن هذا نسألك‏.‏ قال ‏\"‏ فعن معادن العرب تسألوني، الناس معادن خيارهم في الجاهلية خيارهم في الإسلام إذا فقهوا ‏\"‏‏.‏   حدثني محمد بن سلام أخبرنا عبدة عن عبيد الله عن سعيد عن أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم بهذا",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle was asked, \"Who is the most honorable amongst the people?\" He replied, \"The most Allah fearing.\" The people said, \"We do not want to ask you about this.\" He said, \"The most honorable person is Joseph, Allah's Prophet, the son of Allah's Prophet, the son of Allah's Prophet, the son of Allah's Khalil\" The people said, 'We do not want to ask you about this.\" He said,\" Then you want to ask me about the origins of the Arabs? People are of various origins. The best in the prelslamic period are the best in Islam, provided they comprehend (the religious knowledge).",
      "chain": [
        "30360",
        "20318",
        "11201",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "3765",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثني عبيد بن إسماعيل، حدثنا أبو أسامة، عن هشام، أخبرني أبي، سمعت مروان، كنت عند عثمان، أتاه رجل فقال استخلف‏.‏ قال وقيل ذاك قال نعم، الزبير‏.‏ قال أما والله إنكم لتعلمون أنه خيركم‏.‏ ثلاثا‏.‏",
      "text_en": " Narrated Marwan bin Al-Hakam:                     While I was with `Uthman, a man came to him and said, \"Appoint your successor.\" `Uthman said, \"Has such successor been named?\" He replied, \"Yes, Az-Zubair.\" `Uthman said, thrice, \"By Allah! Indeed you know that he is the best of you.\"",
      "chain": [
        "30360",
        "20318",
        "11065",
        "10511"
      ]
    },
    {
      "hadith_no": "3819",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا عبيد بن إسماعيل، حدثنا أبو أسامة، عن هشام، عن أبيه، عن عائشة  رضى الله عنها أنها استعارت من أسماء قلادة فهلكت، فأرسل رسول الله صلى الله عليه وسلم ناسا من أصحابه في طلبها، فأدركتهم الصلاة، فصلوا بغير وضوء، فلما أتوا النبي صلى الله عليه وسلم شكوا ذلك إليه، فنزلت آية التيمم‏.‏ فقال أسيد بن حضير جزاك الله خيرا، فوالله ما نزل بك أمر قط إلا جعل الله لك منه مخرجا، وجعل للمسلمين فيه بركة‏.‏",
      "text_en": " Narrated `Aisha:                     That she borrowed a necklace from Asma' and it was lost. Allah's Apostle sent some of his companions to look for it. During their journey the time of prayer was due and they prayed without ablution. When they returned to the Prophet they complained about it. So the Divine Verse of Tayammum was revealed. Usaid bin Hudair said (to `Aisha), \"May Allah reward you handsomely. By Allah, whenever you have a difficulty, Allah took you out of it and brought with it, a Blessing for the Muslims.\"",
      "chain": [
        "30360",
        "20318",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "3820",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثني عبيد بن إسماعيل، حدثنا أبو أسامة، عن هشام، عن أبيه، أن رسول الله صلى الله عليه وسلم لما كان في مرضه، جعل يدور في نسائه ويقول ‏\"‏ أين أنا غدا أين أنا غدا ‏\"‏‏.‏ حرصا على بيت عائشة، قالت عائشة فلما كان يومي سكن‏.‏",
      "text_en": " Narrated Hisham's father:                     When Allah's Apostle was in his fatal illness, he started visiting his wives and saying, \"Where will I be tomorrow?\" He was anxious to be in `Aisha's home. `Aisha said, \"So when it was my day, the Prophet became silent (no longer asked the question).",
      "chain": [
        "30360",
        "20318",
        "11065",
        "10511"
      ]
    },
    {
      "hadith_no": "3823",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثني عبيد بن إسماعيل، حدثنا أبو أسامة، عن هشام، عن أبيه، عن عائشة  رضى الله عنها  قالت كان يوم بعاث يوما قدمه الله لرسوله صلى الله عليه وسلم فقدم رسول الله صلى الله عليه وسلم وقد افترق ملؤهم، وقتلت سرواتهم، وجرحوا، فقدمه الله لرسوله صلى الله عليه وسلم في دخولهم في الإسلام‏.‏",
      "text_en": " Narrated `Aisha:                     The day of Bu'ath (i.e. Day of fighting between the two tribes of the Ansar, the Aus and Khazraj) was brought about by Allah for the good of His Apostle so that when Allah's Apostle reached (Medina), the tribes of Medina had already divided and their chiefs had been killed and wounded. So Allah had brought about the battle for the good of H is Apostle in order that they (i.e. the Ansar) might embrace Islam.",
      "chain": [
        "30360",
        "20318",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "3894",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثني عبيد بن إسماعيل، حدثنا أبو أسامة، عن هشام، عن أبيه، عن عائشة  رضى الله عنها  قالت كان يوم بعاث يوما قدمه الله لرسوله صلى الله عليه وسلم، فقدم رسول الله صلى الله عليه وسلم وقد افترق ملؤهم، وقتلت سرواتهم وجرحوا، قدمه الله لرسوله صلى الله عليه وسلم في دخولهم في الإسلام‏.‏",
      "text_en": "     Narrated 'Aisha:                          Allah caused the day of Buath to take place before Allah's Apostle was sent (as an Apostle) so that when Allah's Apostle reached Medina, those people had already divided (in different groups) and their chiefs had been killed or wounded. So Allah made that day precede Allah's Apostle so that they (i.e. the Ansar) might embrace Islam.",
      "chain": [
        "30360",
        "20318",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "3944",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثني عبيد بن إسماعيل، حدثنا أبو أسامة، عن هشام، عن أبيه، قال توفيت خديجة قبل مخرج النبي صلى الله عليه وسلم إلى المدينة بثلاث سنين، فلبث سنتين أو قريبا من ذلك، ونكح عائشة وهى بنت ست سنين، ثم بنى بها وهى بنت تسع سنين‏.‏",
      "text_en": " Narrated Hisham's father:                     Khadija died three years before the Prophet departed to Medina. He stayed there for two years or so and then he married `Aisha when she was a girl of six years of age, and he consumed that marriage when she was nine years old.",
      "chain": [
        "30360",
        "20318",
        "11065",
        "10511"
      ]
    },
    {
      "hadith_no": "4027",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني عبيد بن إسماعيل، حدثنا أبو أسامة، عن هشام، عن أبيه، قال ذكر عند عائشة  رضى الله عنها  أن ابن عمر رفع إلى النبي صلى الله عليه وسلم ‏\"‏ إن الميت يعذب في قبره ببكاء أهله ‏\"‏‏.‏ فقالت إنما قال رسول الله صلى الله عليه وسلم ‏\"‏ إنه ليعذب بخطيئته وذنبه، وإن أهله ليبكون عليه الآن ‏\"‏‏.‏   قالت وذاك مثل قوله إن رسول الله صلى الله عليه وسلم قام على القليب وفيه قتلى بدر من المشركين، فقال لهم ما قال إنهم ليسمعون ما أقول‏.‏ إنما قال ‏\"‏ إنهم الآن ليعلمون أن ما كنت أقول لهم حق ‏\"‏‏.‏ ثم قرأت ‏{‏إنك لا تسمع الموتى‏}‏ ‏{‏وما أنت بمسمع من في القبور‏}‏ تقول حين تبوءوا مقاعدهم من النار‏.‏",
      "text_en": " Narrated Hisham's father:                     It was mentioned before `Aisha that Ibn `Umar attributed the following statement to the Prophet \"The dead person is punished in the grave because of the crying and lamentation Of his family.\" On that, `Aisha said, \"But Allah's Apostle said, 'The dead person is punished for his crimes and sins while his family cry over him then.\" She added, \"And this is similar to the statement of Allah's Apostle when he stood by the (edge of the) well which contained the corpses of the pagans killed at Badr, 'They hear what I say.' She added, \"But he said now they know very well what I used to tell them was the truth.\" `Aisha then recited: 'You cannot make the dead hear.' (30.52) and 'You cannot make those who are in their Graves, hear you.' (35.22) that is, when they had taken their places in the (Hell) Fire.",
      "chain": [
        "30360",
        "20318",
        "11065",
        "10511"
      ]
    },
    {
      "hadith_no": "4048",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني عبيد بن إسماعيل، حدثنا أبو أسامة، عن هشام بن عروة، عن أبيه، قال قال الزبير لقيت يوم بدر عبيدة بن سعيد بن العاص وهو مدجج لا يرى منه إلا عيناه، وهو يكنى أبو ذات الكرش، فقال أنا أبو ذات الكرش‏.‏ فحملت عليه بالعنزة، فطعنته في عينه فمات‏.‏ قال هشام فأخبرت أن الزبير قال لقد وضعت رجلي عليه ثم تمطأت، فكان الجهد أن نزعتها وقد انثنى طرفاها‏.‏ قال عروة فسأله إياها رسول الله صلى الله عليه وسلم فأعطاه، فلما قبض رسول الله صلى الله عليه وسلم أخذها، ثم طلبها أبو بكر فأعطاه، فلما قبض أبو بكر سألها إياه عمر فأعطاه إياها، فلما قبض عمر أخذها، ثم طلبها عثمان منه فأعطاه إياها، فلما قتل عثمان وقعت عند آل علي، فطلبها عبد الله بن الزبير، فكانت عنده حتى قتل‏.‏",
      "text_en": " Narrated `Urwa:                     Az-Zubair said, \"I met Ubaida bin Sa`id bin Al-As on the day (of the battle) of Badr and he was covered with armor; so much that only his eyes were visible. He was surnamed Abu Dhat-al-Karish. He said (proudly), 'I am Abu-al-Karish.' I attacked him with the spear and pierced his eye and he died. I put my foot over his body to pull (that spear) out, but even then I had to use a great force to take it out as its both ends were bent.\" `Urwa said, \"Later on Allah's Apostle asked Az-Zubair for the spear and he gave it to him. When Allah's Apostle died, Az-Zubair took it back. After that Abu Bakr demanded it and he gave it to him, and when Abu Bakr died, Az-Zubair took it back. `Umar then demanded it from him and he gave it to him. When `Umar died, Az-Zubair took it back, and then `Uthman demanded it from him and he gave it to him. When `Uthman was martyred, the spear remained with `Ali's offspring. Then `Abdullah bin Az-Zubair demanded it back, and it remained with him till he was martyred.",
      "chain": [
        "30360",
        "20318",
        "11065",
        "10511",
        "7"
      ]
    },
    {
      "hadith_no": "4143",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبيد بن إسماعيل، حدثنا أبو أسامة، عن هشام، عن أبيه، عن عائشة  رضى الله عنها  قالت استأذن النبي صلى الله عليه وسلم أبو بكر في الخروج حين اشتد عليه الأذى، فقال له ‏\"‏ أقم ‏\"‏‏.‏ فقال يا رسول الله أتطمع أن يؤذن لك، فكان رسول الله صلى الله عليه وسلم يقول ‏\"‏ إني لأرجو ذلك ‏\"‏ قالت فانتظره أبو بكر فأتاه رسول الله صلى الله عليه وسلم ذات يوم ظهرا فناداه فقال ‏\"‏ أخرج من عندك ‏\"‏‏.‏ فقال أبو بكر إنما هما ابنتاى‏.‏ فقال ‏\"‏ أشعرت أنه قد أذن لي في الخروج ‏\"‏‏.‏ فقال يا رسول الله الصحبة‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ الصحبة ‏\"‏‏.‏ قال يا رسول الله عندي ناقتان قد كنت أعددتهما للخروج‏.‏ فأعطى النبي صلى الله عليه وسلم إحداهما وهى الجدعاء، فركبا فانطلقا حتى أتيا الغار، وهو بثور، فتواريا فيه، فكان عامر بن فهيرة غلاما لعبد الله بن الطفيل بن سخبرة أخو عائشة لأمها، وكانت لأبي بكر منحة، فكان يروح بها ويغدو عليهم، ويصبح فيدلج إليهما ثم يسرح، فلا يفطن به أحد من الرعاء، فلما خرج خرج معهما يعقبانه حتى قدما المدينة، فقتل عامر بن فهيرة يوم بئر معونة‏.‏ وعن أبي أسامة قال قال هشام بن عروة فأخبرني أبي قال لما قتل الذين ببئر معونة وأسر عمرو بن أمية الضمري قال له عامر بن الطفيل من هذا فأشار إلى قتيل، فقال له عمرو بن أمية هذا عامر بن فهيرة‏.‏ فقال لقد رأيته بعد ما قتل رفع إلى السماء حتى إني لأنظر إلى السماء بينه وبين الأرض، ثم وضع‏.‏ فأتى النبي صلى الله عليه وسلم خبرهم فنعاهم فقال ‏\"‏ إن أصحابكم قد أصيبوا، وإنهم قد سألوا ربهم، فقالوا ربنا أخبر عنا إخواننا بما رضينا عنك ورضيت عنا‏.‏ فأخبرهم عنهم ‏\"‏‏.‏ وأصيب يومئذ فيهم عروة بن أسماء بن الصلت، فسمي عروة به، ومنذر بن عمرو سمي به منذرا‏.‏",
      "text_en": " Narrated `Aisha:                     Abu Bakr asked the Prophet to allow him to go out (of Mecca) when he was greatly annoyed (by the infidels). But the Prophet said to him, ''Wait.\" Abu Bakr said, O Allah's Apostle! Do you hope that you will be allowed (to migrate)?\" Allah's Apostle replied, \"I hope so.\" So Abu Bakr waited for him till one day Allah's Apostle came at noon time and addressed him saying \"Let whoever is present with you, now leave you.\" Abu Bakr said, \"None is present but my two daughters.\" The Prophet said, \"Have you noticed that I have been allowed to go out (to migrate)?\" Abu Bakr said, \"O Allah's Apostle, I would like to accompany you.\" The Prophet said, \"You will accompany me.\" Abu Bakr said, \"O Allah's Apostle! I have got two she-camels which I had prepared and kept ready for (our) going out.\" So he gave one of the two (she-camels) to the Prophet and it was Al-Jad`a . They both rode and proceeded till they reached the Cave at the mountain of Thaur where they hid themselves. Amir bin Fuhaira was the slave of `Abdullah bin at-Tufail bin Sakhbara `Aisha's brother from her mother's side. Abu Bakr had a milch she-camel. Amir used to go with it (i.e. the milch she-camel) in the afternoon and come back to them before noon by setting out towards them in the early morning when it was still dark and then he would take it to the pasture so that none of the shepherds would be aware of his job. When the Prophet (and Abu Bakr) went away (from the Cave), he (i.e. 'Amir) too went along with them and they both used to make him ride at the back of their camels in turns till they reached Medina. 'Amir bin Fuhaira was martyred on the day of Bir Ma'una. Narrated `Urwa: When those (Muslims) at Bir Ma'una were martyred and `Amr bin Umaiya Ad- Damri was taken prisoner, 'Amir bin at-Tufail, pointing at a killed person, asked `Amr, \"Who is this?\" `Amr bin Umaiya said to him, \"He is 'Amir bin Fuhaira.\" 'Amir bin at-Tufail said, \"I saw him lifted to the sky after he was killed till I saw the sky between him and the earth, and then he was brought down upon the earth. Then the news of the killed Muslims reached the Prophet and he announced the news of their death saying, \"Your companions (of Bir Ma'una) have been killed, and they have asked their Lord saying, 'O our Lord! Inform our brothers about us as we are pleased with You and You are pleased with us.\" So Allah informed them (i.e. the Prophet and his companions) about them (i.e. martyrs of Bir Mauna). On that day, `Urwa bin Asma bin As-Salt who was one of them, was killed, and `Urwa (bin Az- Zubair) was named after `Urwa bin Asma and Mundhir (bin AzZubair) was named after Mundhir bin `Amr (who had also been martyred on that day).",
      "chain": [
        "30360",
        "20318",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "4264",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني عبيد بن إسماعيل، عن أبي أسامة، عن عبيد الله، عن نافع، وسالم، عن ابن عمر  رضى الله عنهما  أن رسول الله صلى الله عليه وسلم نهى يوم خيبر عن أكل الثوم، وعن لحوم الحمر الأهلية‏.‏ نهى عن أكل الثوم هو عن نافع وحده‏.‏ ولحوم الحمر الأهلية عن سالم‏.‏",
      "text_en": " Narrated Ibn `Umar:                     On the day of Khaiber, Allah's Apostle forbade the eating of garlic and the meat of donkeys.",
      "chain": [
        "30360",
        "20318",
        "11201",
        "11014",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "4325",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبيد بن إسماعيل، حدثنا أبو أسامة، عن هشام، عن أبيه، قال لما سار رسول الله صلى الله عليه وسلم عام الفتح فبلغ ذلك قريشا، خرج أبو سفيان بن حرب وحكيم بن حزام وبديل بن ورقاء يلتمسون الخبر عن رسول الله صلى الله عليه وسلم فأقبلوا يسيرون حتى أتوا مر الظهران، فإذا هم بنيران كأنها نيران عرفة، فقال أبو سفيان ما هذه لكأنها نيران عرفة‏.‏ فقال بديل بن ورقاء نيران بني عمرو‏.‏ فقال أبو سفيان عمرو أقل من ذلك‏.‏ فرآهم ناس من حرس رسول الله صلى الله عليه وسلم فأدركوهم فأخذوهم، فأتوا بهم رسول الله صلى الله عليه وسلم فأسلم أبو سفيان، فلما سار قال للعباس ‏\"‏ احبس أبا سفيان عند حطم الخيل حتى ينظر إلى المسلمين ‏\"‏‏.‏ فحبسه العباس، فجعلت القبائل تمر مع النبي صلى الله عليه وسلم تمر كتيبة كتيبة على أبي سفيان، فمرت كتيبة قال يا عباس من هذه قال هذه غفار‏.‏ قال ما لي ولغفار ثم مرت جهينة، قال مثل ذلك، ثم مرت سعد بن هذيم، فقال مثل ذلك، ومرت سليم، فقال مثل ذلك، حتى أقبلت كتيبة لم ير مثلها، قال من هذه قال هؤلاء الأنصار عليهم سعد بن عبادة معه الراية‏.‏ فقال سعد بن عبادة يا أبا سفيان اليوم يوم الملحمة، اليوم تستحل الكعبة‏.‏ فقال أبو سفيان يا عباس حبذا يوم الذمار‏.‏ ثم جاءت كتيبة، وهى أقل الكتائب، فيهم رسول الله صلى الله عليه وسلم وأصحابه، وراية النبي صلى الله عليه وسلم مع الزبير بن العوام، فلما مر رسول الله صلى الله عليه وسلم بأبي سفيان قال ألم تعلم ما قال سعد بن عبادة قال ‏\"‏ ما قال ‏\"‏‏.‏ قال كذا وكذا‏.‏ فقال ‏\"‏ كذب سعد، ولكن هذا يوم يعظم الله فيه الكعبة، ويوم تكسى فيه الكعبة ‏\"‏‏.‏ قال وأمر رسول الله صلى الله عليه وسلم أن تركز رايته بالحجون‏.‏ قال عروة وأخبرني نافع بن جبير بن مطعم قال سمعت العباس يقول للزبير بن العوام يا أبا عبد الله، ها هنا أمرك رسول الله صلى الله عليه وسلم أن تركز الراية، قال وأمر رسول الله صلى الله عليه وسلم يومئذ خالد بن الوليد أن يدخل من أعلى مكة من كداء، ودخل النبي صلى الله عليه وسلم من كدا، فقتل من خيل خالد يومئذ رجلان حبيش بن الأشعر وكرز بن جابر الفهري‏.‏",
      "text_en": " Narrated Hisham's father:                     When Allah's Apostle set out (towards Mecca) during the year of the Conquest (of Mecca) and this news reached (the infidels of Quraish), Abu Sufyan, Hakim bin Hizam and Budail bin Warqa came out to gather information about Allah's Apostle , They proceeded on their way till they reached a place called Marr-az-Zahran (which is near Mecca). Behold! There they saw many fires as if they were the fires of `Arafat. Abu Sufyan said, \"What is this? It looked like the fires of `Arafat.\" Budail bin Warqa' said, \"Banu `Amr are less in number than that.\" Some of the guards of Allah's Apostle saw them and took them over, caught them and brought them to Allah's Apostle. Abu Sufyan embraced Islam. When the Prophet proceeded, he said to Al-Abbas, \"Keep Abu Sufyan standing at the top of the mountain so that he would look at the Muslims. So Al-`Abbas kept him standing (at that place) and the tribes with the Prophet started passing in front of Abu Sufyan in military batches. A batch passed and Abu Sufyan said, \"O `Abbas Who are these?\" `Abbas said, \"They are (Banu) Ghifar.\" Abu Sufyan said, I have got nothing to do with Ghifar.\" Then (a batch of the tribe of) Juhaina passed by and he said similarly as above. Then (a batch of the tribe of) Sa`d bin Huzaim passed by and he said similarly as above. then (Banu) Sulaim passed by and he said similarly as above. Then came a batch, the like of which Abu Sufyan had not seen. He said, \"Who are these?\" `Abbas said, \"They are the Ansar headed by Sa`d bin Ubada, the one holding the flag.\" Sa`d bin Ubada said, \"O Abu Sufyan! Today is the day of a great battle and today (what is prohibited in) the Ka`ba will be permissible.\" Abu Sufyan said., \"O `Abbas! How excellent the day of destruction is! \"Then came another batch (of warriors) which was the smallest of all the batches, and in it there was Allah's Apostle and his companions and the flag of the Prophet was carried by Az-Zubair bin Al Awwam. When Allah's Apostle passed by Abu Sufyan, the latter said, (to the Prophet), \"Do you know what Sa`d bin 'Ubada said?\" The Prophet said, \"What did he say?\" Abu Sufyan said, \"He said so-and-so.\" The Prophet said, \"Sa`d told a lie, but today Allah will give superiority to the Ka`ba and today the Ka`ba will be covered with a (cloth) covering.\" Allah's Apostle ordered that his flag be fixed at Al-Hajun. Narrated `Urwa: Nafi` bin Jubair bin Mut`im said, \"I heard Al-Abbas saying to Az-Zubair bin Al- `Awwam, 'O Abu `Abdullah ! Did Allah's Apostle order you to fix the flag here?' \" Allah's Apostle ordered Khalid bin Al-Walid to enter Mecca from its upper part from Ka'da while the Prophet himself entered from Kuda. Two men from the cavalry of Khalid bin Al-Wahd named Hubaish bin Al-Ash'ar and Kurz bin Jabir Al-Fihri were martyred on that day.",
      "chain": [
        "30360",
        "20318",
        "11065",
        "10511"
      ]
    },
    {
      "hadith_no": "4336",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبيد بن إسماعيل، حدثنا أبو أسامة، عن هشام، عن أبيه، دخل النبي صلى الله عليه وسلم عام الفتح من أعلى مكة من كداء‏.‏",
      "text_en": " Narrated Hisham's father:                     During the year of the Conquest (of Mecca), the Prophet entered Mecca through its upper part through Kada.",
      "chain": [
        "30360",
        "20318",
        "11065"
      ]
    },
    {
      "hadith_no": "4643",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عبيد بن إسماعيل، حدثنا أبو أسامة، حدثنا هشام بن عروة، عن أبيه، عن عائشة  رضى الله عنها  ‏{‏ويستفتونك في النساء قل الله يفتيكم فيهن‏}‏ إلى قوله ‏{‏وترغبون أن تنكحوهن‏}‏‏.‏ قالت هو الرجل تكون عنده اليتيمة، هو وليها ووارثها، فأشركته في ماله حتى في العذق، فيرغب أن ينكحها، ويكره أن يزوجها رجلا، فيشركه في ماله بما شركته فيعضلها فنزلت هذه الآية‏.‏",
      "text_en": " Narrated `Aisha:                     Regarding the Verse:--\"They ask your instruction concerning the women. Say: Allah instructs you about them and yet whom you desire to marry.\" (4.127) (has been revealed regarding the case of) a man who has an orphan girl, and he is her guardian and her heir. The girl shares with him all his property, even a date-palm (garden), but he dislikes to marry her and dislikes to give her in marriage to somebody else who would share with him the property she is sharing with him, and for this reason that guardian prevents that orphan girl from marrying. So, this Verse was revealed: (And Allah's statement:) \"If a woman fears cruelty or desertion on her husband's part.\" (4.128)",
      "chain": [
        "30360",
        "20318",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "4716",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عبيد بن إسماعيل، عن أبي أسامة، عن عبيد الله، عن نافع، عن ابن عمر  رضى الله عنهما  قال لما توفي عبد الله جاء ابنه عبد الله بن عبد الله إلى رسول الله صلى الله عليه وسلم فسأله أن يعطيه قميصه يكفن فيه أباه فأعطاه، ثم سأله أن يصلي عليه، فقام رسول الله صلى الله عليه وسلم ليصلي فقام عمر فأخذ بثوب رسول الله صلى الله عليه وسلم فقال يا رسول الله تصلي عليه وقد نهاك ربك أن تصلي عليه فقال رسول الله صلى الله عليه وسلم ‏\"‏ إنما خيرني الله فقال ‏{‏استغفر لهم أو لا تستغفر لهم إن تستغفر لهم سبعين مرة‏}‏ وسأزيده على السبعين ‏\"‏‏.‏ قال إنه منافق‏.‏ قال فصلى عليه رسول الله صلى الله عليه وسلم فأنزل الله ‏{‏ولا تصل على أحد منهم مات أبدا ولا تقم على قبره‏}‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     When `Abdullah bin 'Ubai died, his son `Abdullah bin `Abdullah came to Allah's Apostle and asked him to give him his shirt in order to shroud his father in it. He gave it to him and then `Abdullah asked the Prophet to offer the funeral prayer for him (his father). Allah's Apostle got up to offer the funeral prayer for him, but `Umar got up too and got hold of the garment of Allah's Apostle and said, \"O Allah's Apostle Will you offer the funeral prayer for him though your Lord has forbidden you to offer the prayer for him\" Allah's Apostle said, \"But Allah has given me the choice by saying: '(Whether you) ask forgiveness for them, or do not ask forgiveness for them; even if you ask forgiveness for them seventy times..' (9.80) so I will ask more than seventy times.\" `Umar said, \"But he (`Abdullah bin 'Ubai) is a hypocrite!\" However, Allah's Apostle did offer the funeral prayer for him whereupon Allah revealed: 'And never (O Muhammad) pray for anyone of them that dies, nor stand at his grave.' (9.84)",
      "chain": [
        "30360",
        "20318",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "4744",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني عبيد بن إسماعيل، عن أبي أسامة، عن عبيد الله، عن نافع، عن ابن عمر  رضى الله عنهما  قال كنا عند رسول الله صلى الله عليه وسلم فقال ‏\"‏ أخبروني بشجرة تشبه أو كالرجل المسلم لا يتحات ورقها ولا ولا ولا، تؤتي أكلها كل حين ‏\"‏‏.‏ قال ابن عمر فوقع في نفسي أنها النخلة، ورأيت أبا بكر وعمر لا يتكلمان، فكرهت أن أتكلم، فلما لم يقولوا شيئا قال رسول الله صلى الله عليه وسلم ‏\"‏ هي النخلة ‏\"‏‏.‏ فلما قمنا قلت لعمر يا أبتاه والله لقد كان وقع في نفسي أنها النخلة فقال ما منعك أن تكلم قال لم أركم تكلمون، فكرهت أن أتكلم أو أقول شيئا‏.‏ قال عمر لأن تكون قلتها أحب إلى من كذا وكذا‏.‏",
      "text_en": " Narrated Ibn `Umar:                     While we were with Allah's Apostle he said, \"Tell me of a tree which resembles a Muslim man. Its leaves do not fall and it does not, and does not, and does not, and it gives its fruits every now and then.\" It came to my mind that such a tree must be the date palm, but seeing Abu Bakr and `Umar saying nothing, I disliked to speak. So when they did not say anything, Allah's Apostle said, \"It is the date-palm tree.\" When we got up (from that place), I said to `Umar, \"O my father! By Allah, it came to my mind that it must be the date palm tree.\" `Umar said, \"What prevented you from speaking\" I replied, \"I did not see you speaking, so I misliked to speak or say anything.\" `Umar then said, \"If you had said it, it would have been dearer to me than so-and-so.\"",
      "chain": [
        "30360",
        "20318",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "5134",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا عبيد بن إسماعيل، حدثنا أبو أسامة، عن هشام، عن أبيه، عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ أريتك في المنام مرتين، إذا رجل يحملك في سرقة حرير فيقول هذه امرأتك، فأكشفها فإذا هي أنت، فأقول إن يكن هذا من عند الله يمضه ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     Allah's Apostle said (to me), \"You have been shown to me twice in (my) dreams. A man was carrying you in a silken cloth and said to me, 'This is your wife.' I uncovered it; and behold, it was you. I said to myself, 'If this dream is from Allah, He will cause it to come true.' \"",
      "chain": [
        "30360",
        "20318",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "5145",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا عبيد بن إسماعيل، حدثنا أبو أسامة، عن هشام، عن أبيه، عن عائشة، قالت دخل رسول الله صلى الله عليه وسلم على ضباعة بنت الزبير فقال لها ‏\"‏ لعلك أردت الحج ‏\"‏‏.‏ قالت والله لا أجدني إلا وجعة‏.‏ فقال لها ‏\"‏ حجي واشترطي، قولي اللهم محلي حيث حبستني ‏\"‏‏.‏ وكانت تحت المقداد بن الأسود‏.‏",
      "text_en": " Narrated `Aisha:                     Allah's Apostle entered upon Dubaa bint Az-Zubair and said to her, \"Do you have a desire to perform the Hajj?\" She replied, \"By Allah, I feel sick.\" He said to her, \"Intend to perform Hajj and stipulate something by saying, 'O Allah, I will finish my Ihram at any place where You stop me (i.e. I am unable to go further).\" She was the wife of Al-Miqdad bin Al-Aswad.",
      "chain": [
        "30360",
        "20318",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "5219",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثني عبيد بن إسماعيل، حدثنا أبو أسامة، عن هشام، عن أبيه، عن عائشة  رضى الله عنها  أنها استعارت من أسماء قلادة، فهلكت، فأرسل رسول الله صلى الله عليه وسلم ناسا من أصحابه في طلبها، فأدركتهم الصلاة فصلوا بغير وضوء، فلما أتوا النبي صلى الله عليه وسلم شكوا ذلك إليه، فنزلت آية التيمم‏.‏ فقال أسيد بن حضير جزاك الله خيرا، فوالله ما نزل بك أمر قط، إلا جعل لك منه مخرجا، وجعل للمسلمين فيه بركة‏.‏",
      "text_en": " Narrated `Aisha:                     That she borrowed a necklace from Asma' and then it got lost. So Allah's Apostle sent some people from his companions in search of it. In the meantime the stated time for the prayer became due and they offered their prayer without ablution. When they came to the Prophet, they complained about it to him, so the Verse regarding Tayammum was revealed . Usaid bin Hudair said, \"(O `Aisha!) may Allah bless you with a good reward, for by Allah, never did a difficulty happen in connection with you, but Allah made an escape from it for you, and brought Allah's Blessings for the Muslims.\"",
      "chain": [
        "30360",
        "20318",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "5283",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا عبيد بن إسماعيل، حدثنا أبو أسامة، عن هشام، عن أبيه، عن عائشة  رضى الله عنها  قالت قال لي رسول الله صلى الله عليه وسلم ‏\"‏ إني لأعلم إذا كنت عني راضية، وإذا كنت على غضبى ‏\"‏‏.‏ قالت فقلت من أين تعرف ذلك فقال ‏\"‏ أما إذا كنت عني راضية فإنك تقولين لا ورب محمد، وإذا كنت غضبى قلت لا ورب إبراهيم ‏\"‏‏.‏ قالت قلت أجل والله يا رسول الله، ما أهجر إلا اسمك‏.‏",
      "text_en": " Narrated Aisha:                     That Allah's Apostle said to her, \"I you are pleased with me or angry with me.\" I said, \"Whence do you know that?\" He said, \"When you are pleased with me, you say, 'No, by the Lord of Muhammad,' but when you are angry with me, then you say, 'No, by the Lord of Abraham.' \" Thereupon I said, \"Yes (you are right), but by Allah, O Allah's Apostle, I leave nothing but your name.\"",
      "chain": [
        "30360",
        "20318",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "5825",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا عبيد بن إسماعيل، حدثنا أبو أسامة، عن هشام، عن أبيه، عن عائشة، قالت سحر النبي صلى الله عليه وسلم حتى إنه ليخيل إليه أنه يفعل الشىء وما فعله، حتى إذا كان ذات يوم وهو عندي دعا الله ودعاه، ثم قال ‏\"‏ أشعرت يا عائشة أن الله قد أفتاني فيما استفتيته فيه ‏\"‏‏.‏ قلت وما ذاك يا رسول الله قال ‏\"‏ جاءني رجلان، فجلس أحدهما عند رأسي والآخر عند رجلى، ثم قال أحدهما لصاحبه ما وجع الرجل قال مطبوب‏.‏ قال ومن طبه قال لبيد بن الأعصم، اليهودي من بني زريق‏.‏ قال فيما ذا قال في مشط ومشاطة، وجف طلعة ذكر‏.‏ قال فأين هو قال في بئر ذي أروان ‏\"‏‏.‏ قال فذهب النبي صلى الله عليه وسلم في أناس من أصحابه إلى البئر، فنظر إليها وعليها نخل، ثم رجع إلى عائشة فقال ‏\"‏ والله لكأن ماءها نقاعة الحناء، ولكأن نخلها رءوس الشياطين ‏\"‏‏.‏ قلت يا رسول الله أفأخرجته قال ‏\"‏ لا، أما أنا فقد عافاني الله وشفاني، وخشيت أن أثور على الناس منه شرا ‏\"‏‏.‏ وأمر بها فدفنت‏.‏",
      "text_en": " Narrated `Aisha:                     Magic was worked on Allah's Apostle so that he began to imagine that he had done something although he had not. One day while he was with me, he invoked Allah and invoked for a long period and then said, \"O `Aisha! Do you know that Allah has instructed me regarding the matter I asked Him about?\" I asked, \"What is that, O Allah's Apostle?\" He said, \"Two men came to me; one of them sat near my head and the other sat near my feet. One of them asked his companion, 'What is the disease of this man?' The other replied, 'He is under the effect of magic.' The first one asked, 'Who has worked magic on him?\" The other replied, 'Labid bin A'sam, a Jew from the tribe of Bani Zuraiq.' The (first one asked), 'With what has it been done?' The other replied, 'With a a comb and the hair stuck to it and a skin of the pollen of a male datepalm tree.' The first one asked, 'Where is it?' The other replied, 'In the well of Dharwan.' Then the Prophet went along with some of his companions to that well and looked at that and there were date palms near to it. Then he returned to me and said, 'By Allah the water of that well was (red) like the infusion of Henna leaves and its date-palms were like the heads of devils\" I said, O Allah's Apostle! Did you take those materials out of the pollen skin?\" He said, 'No! As for me Allah has healed me and cured me and I was afraid that (by Showing that to the people) I would spread evil among them when he ordered that the well be filled up with earth, and it was filled up with earth \"",
      "chain": [
        "30360",
        "20318",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "6071",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا عبيد بن إسماعيل، حدثنا أبو أسامة، عن هشام، عن أبيه، عن عائشة  رضى الله عنها  قالت ما غرت على امرأة ما غرت على خديجة، ولقد هلكت قبل أن يتزوجني بثلاث سنين، لما كنت أسمعه يذكرها، ولقد أمره ربه أن يبشرها ببيت في الجنة من قصب، وإن كان ليذبح الشاة ثم يهدي في خلتها منها‏.‏",
      "text_en": " Narrated `Aisha:                     I never felt so jealous of any woman as I did of Khadija, though she had died three years before the Prophet married me, and that was because I heard him mentioning her too often, and because his Lord had ordered him to give her the glad tidings that she would have a palace in Paradise, made of Qasab and because he used to slaughter a sheep and distribute its meat among her friends.",
      "chain": [
        "30360",
        "20318",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "7058",
      "source": " Sahih Bukhari ",
      "chapter": "Tricks - كتاب الحيل",
      "chapter_no": "91",
      "text_ar": "حدثنا عبيد بن إسماعيل، حدثنا أبو أسامة، عن هشام، عن أبيه، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يحب الحلواء، ويحب العسل، وكان إذا صلى العصر أجاز على نسائه فيدنو منهن، فدخل على حفصة، فاحتبس عندها أكثر مما كان يحتبس، فسألت عن ذلك فقيل لي أهدت امرأة من قومها عكة عسل، فسقت رسول الله صلى الله عليه وسلم منه شربة‏.‏ فقلت أما والله لنحتالن له‏.‏ فذكرت ذلك لسودة قلت إذا دخل عليك فإنه سيدنو منك فقولي له يا رسول الله أكلت مغافير فإنه سيقول لا‏.‏ فقولي له ما هذه الريح وكان رسول الله صلى الله عليه وسلم يشتد عليه أن توجد منه الريح، فإنه سيقول سقتني حفصة شربة عسل‏.‏ فقولي له جرست نحله العرفط‏.‏ وسأقول ذلك، وقوليه أنت يا صفية‏.‏ فلما دخل على سودة، قلت تقول سودة والذي لا إله إلا هو لقد كدت أن أبادره بالذي قلت لي، وإنه لعلى الباب فرقا منك، فلما دنا رسول الله صلى الله عليه وسلم قلت يا رسول الله أكلت مغافير قال ‏\"‏ لا ‏\"‏‏.‏ قلت فما هذه الريح قال ‏\"‏ سقتني حفصة شربة عسل ‏\"‏‏.‏ قلت جرست نحله العرفط‏.‏ فلما دخل على قلت له مثل ذلك‏.‏ ودخل على صفية فقالت له مثل ذلك‏.‏ فلما دخل على حفصة قالت له يا رسول الله ألا أسقيك منه قال ‏\"‏ لا حاجة لي به ‏\"‏‏.‏ قالت تقول سودة سبحان الله لقد حرمناه‏.‏ قالت قلت لها اسكتي‏.‏",
      "text_en": " Narrated `Aisha:                     Allah's Apostle used to like sweets and also used to like honey, and whenever he finished the `Asr prayer, he used to visit his wives and stay with them. Once he visited Hafsa and remained with her longer than the period he used to stay, so I enquired about it. It was said to me, \"A woman from her tribe gave her a leather skin containing honey as a present, and she gave some of it to Allah's Apostle to drink.\" I said, \"By Allah, we will play a trick on him.\" So I mentioned the story to Sauda (the wife of the Prophet) and said to her, \"When he enters upon you, he will come near to you whereupon you should say to him, 'O Allah's Apostle! Have you eaten Maghafir?' He will say, 'No.' Then you say to him, 'What is this bad smell? ' And it would be very hard on Allah's Apostle that a bad smell should be found on his body. He will say, 'Hafsa has given me a drink of honey.' Then you should say to him, 'Its bees must have sucked from the Al-`Urfut (a foul smelling flower).' I too, will tell him the same. And you, O Saifya, say the same.\" So when the Prophet entered upon Sauda (the following happened). Sauda said, \"By Him except Whom none has the right to be worshipped, I was about to say to him what you had told me to say while he was still at the gate because of fear from you. But when Allah 's Apostle came near to me, I said to him, 'O Allah's Apostle! Have you eaten Maghafir?' He replied, 'No.' I said, 'What about this smell?' He said, 'Hafsa has given me a drink of honey.' I said, 'Its bees must have sucked Al-`Urfut.' \" When he entered upon me, I told him the same as that, and when he entered upon Safiya, she too told him the same. So when he visited Hafsa again, she said to him, \"O Allah's Apostle! Shall I give you a drink of it (honey)?\" He said, \"I have no desire for it.\" Sauda said, Subhan Allah! We have deprived him of it (honey).\" I said to her, \"Be quiet!\"",
      "chain": [
        "30360",
        "20318",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "7065",
      "source": " Sahih Bukhari ",
      "chapter": "Tricks - كتاب الحيل",
      "chapter_no": "91",
      "text_ar": "حدثنا عبيد بن إسماعيل، حدثنا أبو أسامة، عن هشام، عن أبيه، عن أبي حميد الساعدي، قال استعمل رسول الله صلى الله عليه وسلم رجلا على صدقات بني سليم يدعى ابن اللتبية، فلما جاء حاسبه قال هذا مالكم وهذا هدية‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ فهلا جلست في بيت أبيك وأمك، حتى تأتيك هديتك إن كنت صادقا ‏\"‏‏.‏ ثم خطبنا فحمد الله وأثنى عليه ثم قال ‏\"‏ أما بعد، فإني أستعمل الرجل منكم على العمل مما ولاني الله، فيأتي فيقول هذا مالكم وهذا هدية أهديت لي‏.‏ أفلا جلس في بيت أبيه وأمه حتى تأتيه هديته، والله لا يأخذ أحد منكم شيئا بغير حقه، إلا لقي الله يحمله يوم القيامة، فلأعرفن أحدا منكم لقي الله يحمل بعيرا له رغاء، أو بقرة لها خوار، أو شاة تيعر ‏\"‏‏.‏ ثم رفع يده حتى رئي بياض إبطه يقول ‏\"‏ اللهم هل بلغت ‏\"‏‏.‏ بصر عيني وسمع أذني‏.‏",
      "text_en": " Narrated Abu Humaid As-Sa`idi:                     Allah's Apostle appointed a man called Ibn Al-Lutabiyya to collect the Zakat from Bani Sulaim's tribe. When he returned, the Prophet called him to account. He said (to the Prophet, 'This is your money, and this has been given to me as a gift.\" On that, Allah's Apostle said, \"Why didn't you stay in your father's and mother's house to see whether you will be given gifts or not if you are telling the truth?\" Then the Prophet addressed us, and after praising and glorifying Allah, he said: \"Amma Ba'du\", I employ a man from among you to manage some affair of what Allah has put under my custody, and then he comes to me and says, 'This is your money and this has been given to me as a gift. Why didn't he stay in his father's and mother's home to see whether he will be given gifts or not? By Allah, not anyone of you takes a thing unlawfully but he will meet Allah on the Day of Resurrection, carrying that thing. I do not want to see any of you carrying a grunting camel or a mooing cow or a bleating sheep on meeting Allah.\" Then the Prophet raised both his hands till the whiteness of his armpits became visible, and he said, \"O Allah! Haven't I have conveyed (Your Message)?\" The narrator added: My eyes witnessed and my ears heard (that Hadith).",
      "chain": [
        "30360",
        "20318",
        "11065",
        "10511",
        "1457"
      ]
    },
    {
      "hadith_no": "7097",
      "source": " Sahih Bukhari ",
      "chapter": "Interpretation of Dreams - كتاب التعبير",
      "chapter_no": "92",
      "text_ar": "حدثنا عبيد بن إسماعيل، حدثنا أبو أسامة، عن هشام، عن أبيه، عن عائشة  رضى الله عنها  قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ أريتك في المنام مرتين، إذا رجل يحملك في سرقة حرير فيقول هذه امرأتك‏.‏ فأكشفها فإذا هي أنت فأقول إن يكن هذا من عند الله يمضه ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     Allah's Apostle said (to me), \"You were shown to me twice in (my) dream. Behold, a man was carrying you in a silken piece of cloth and said to me, \"She is your wife, so uncover her,' and behold, it was you. I would then say (to myself), 'If this is from Allah, then it must happen.' \"",
      "chain": [
        "30360",
        "20318",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "7413",
      "source": " Sahih Bukhari ",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا عبيد بن إسماعيل، حدثنا أبو أسامة، عن هشام، عن أبيه، عن عائشة، قالت لعبد الله بن الزبير ادفني مع صواحبي ولا تدفني مع النبي صلى الله عليه وسلم في البيت، فإني أكره أن أزكى‏.‏ وعن هشام، عن أبيه، أن عمر، أرسل إلى عائشة ائذني لي أن أدفن مع صاحبى فقالت إي والله‏.‏ قال وكان الرجل إذا أرسل إليها من الصحابة قالت لا والله لا أوثرهم بأحد أبدا‏.‏",
      "text_en": " Narrated Hisham's father:                     `Aisha said to `Abdullah bin Az-Zubair, \"Bury me with my female companions (i.e. the wives of the Prophet) and do not bury me with the Prophet in the house, for I do not like to be regarded as sanctified (just for being buried there).'' Narrated Hisham's father: `Umar sent a message to `Aisha, saying, \"Will you allow me to be buried with my two companions (the Prophet and Abu Bakr) ?\" She said, \"Yes, by Allah.\" though it was her habit that if a man from among the companions (of the Prophet ) sent her a message asking her to allow him to be buried there, she would say, \"No, by Allah, I will never give permission to anyone to be buried with them.\"",
      "chain": [
        "30360",
        "20318",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "7575",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا عبيد بن إسماعيل، حدثنا أبو أسامة، عن هشام، عن أبيه، عن عائشة  رضى الله عنها  قالت ما غرت على امرأة ما غرت على خديجة، ولقد أمره ربه أن يبشرها ببيت في الجنة‏.‏",
      "text_en": " Narrated `Aisha:                     I never felt so jealous of any woman as I felt of Khadija, for Allah ordered him (the Prophet ) to give Khadija the glad tidings of a palace in Paradise (for her).",
      "chain": [
        "30360",
        "20318",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "7620",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا عبيد بن إسماعيل، حدثنا أبو أسامة، عن هشام، عن أبيه، عن عائشة  رضى الله عنها  قالت نزلت هذه الآية ‏{‏ولا تجهر بصلاتك ولا تخافت بها‏}‏ في الدعاء‏.‏",
      "text_en": " Narrated `Aisha:                     The Verse:-- '(O Muhammad!) Neither say your prayer aloud nor say it in a low tone.' (17.110) was revealed in connection with the invocations.",
      "chain": [
        "30360",
        "20318",
        "11065",
        "10511",
        "53"
      ]
    }
  ],
  "total_hadiths": 48
}