{
  "id": "30369",
  "name": "Muhammad bin Aban bin Wzyr محمد بن أبان بن وزير البلخي",
  "full_name": "Muhammad bin Aban bin Wzyr محمد بن أبان بن وزير البلخي",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Thiqah Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "244",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Bulkh"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ خ  4  -  ثقة حافظ ]"
    ],
    "tags": [
      "al-Bulki"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "587",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن أبان، قال حدثنا غندر، قال حدثنا شعبة، عن أبي التياح، قال سمعت حمران بن أبان، يحدث عن معاوية، قال إنكم لتصلون صلاة، لقد صحبنا رسول الله صلى الله عليه وسلم فما رأيناه يصليها، ولقد نهى عنهما، يعني الركعتين بعد العصر‏.‏",
      "text_en": " Narrated Muawiya:                     You offer a prayer which I did not see being offered by Allah's Apostle when we were in his company and he certainly had forbidden it (i.e. two rak`at after the `Asr prayer).",
      "chain": [
        "30369",
        "20278",
        "20020",
        "11317",
        "11421",
        "27"
      ]
    },
    {
      "hadith_no": "696",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن أبان، حدثنا غندر، عن شعبة، عن أبي التياح، أنه سمع أنس بن مالك، قال النبي صلى الله عليه وسلم لأبي ذر ‏\"‏ اسمع وأطع، ولو لحبشي كأن رأسه زبيبة ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet said to Abu-Dhar, \"Listen and obey (your chief) even if he is an Ethiopian with a head like a raisin.\"",
      "chain": [
        "30369",
        "20278",
        "20020",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "740",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة بن سعيد، ومحمد بن أبان، - المعنى - قالا حدثنا النضر بن كثير، - يعني السعدي - قال صلى إلى جنبي عبد الله بن طاوس في مسجد الخيف فكان إذا سجد السجدة الأولى فرفع رأسه منها رفع يديه تلقاء وجهه فأنكرت ذلك فقلت لوهيب بن خالد فقال له وهيب بن خالد تصنع شيئا لم أر أحدا يصنعه فقال ابن طاوس رأيت أبي يصنعه وقال أبي رأيت ابن عباس يصنعه ولا أعلم إلا أنه قال كان النبي صلى الله عليه وسلم يصنعه ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     Nadr ibn Kathir as-Sa'di said: Abdullah ibn Tawus prayed at my side in the mosque of al-Khayf. When he made the first prostration, he raised his head after it and raised his hands opposite to his face. This came as something strange for me. I, therefore, said it to Wuhayb ibn Khalid. Then Wuhayb ibn Khalid said to him: You are doing a thing that I did not see anyone do. Ibn Tawus then replied: I saw my father doing it, and my father said: I saw Ibn Abbas doing it. I do not know but he said: The Prophet (ﷺ) used to do it.",
      "chain": [
        "30367",
        "30369",
        "24459"
      ]
    },
    {
      "hadith_no": "166",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر، محمد بن أبان حدثنا عبد الرحمن بن مهدي، عن أبي عوانة، بهذا الإسناد نحوه ‏.‏ قال أبو عيسى روى هذا الحديث، هشيم عن أبي بشر، عن حبيب بن سالم، عن النعمان بن بشير، ‏.‏ ولم يذكر فيه هشيم عن بشير بن ثابت، ‏.‏ وحديث أبي عوانة أصح عندنا لأن يزيد بن هارون روى عن شعبة، عن أبي بشر، نحو رواية أبي عوانة ‏.‏",
      "text_en": " An-Nu'man bin Bashir said:                     A similar narration (from another chain linking to) this chain is also reported.",
      "chain": [
        "30369",
        "20033",
        "20469",
        "20468",
        "11419",
        "11837",
        "274",
        "14038"
      ]
    },
    {
      "hadith_no": "249",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "قال أبو عيسى حدثنا أبو بكر، محمد بن أبان حدثنا عبد الله بن نمير، حدثنا العلاء بن صالح الأسدي، عن سلمة بن كهيل، عن حجر بن عنبس، عن وائل بن حجر، عن النبي صلى الله عليه وسلم نحو حديث سفيان عن سلمة بن كهيل ‏.‏",
      "text_en": " (Another chain) from Wa'il bin Hujr who narrated it from :                     the Prophet, and it is similar to the narrations of Sufyan from Salamah bin Kuhail",
      "chain": [
        "30369",
        "20331",
        "25224",
        "11350",
        "15084",
        "3045"
      ]
    },
    {
      "hadith_no": "563",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Traveling - أَبْوَابُ السَّفَرِ",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر، محمد بن أبان حدثنا إبراهيم بن صدقة، عن سفيان بن حسين، عن الزهري، عن عروة، عن عائشة، أن النبي صلى الله عليه وسلم صلى صلاة الكسوف وجهر بالقراءة فيها ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ ورواه أبو إسحاق الفزاري عن سفيان بن حسين نحوه ‏.‏ وبهذا الحديث يقول مالك بن أنس وأحمد وإسحاق ‏.‏",
      "text_en": " Aishah narrated:                     \"The Prophet prayed the eclipse payer, and he recited aloud in it.\"",
      "chain": [
        "30369",
        "24006",
        "20655",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "881",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا يوسف بن عيسى، ومحمد بن أبان، قالا حدثنا وكيع، عن إسرائيل، عن إبراهيم بن مهاجر، عن يوسف بن ماهك، عن أمه، مسيكة عن عائشة، قالت قلنا يا رسول الله ألا نبني لك بيتا يظلك بمنى قال ‏\"‏ لا منى مناخ من سبق ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏",
      "text_en": " Aishah said:                     \"We said: 'O Messenger of Allah! Shall we build a structure to shade you at Mina? He said: 'No., Mina is a resting place for whoever arrives.'\"",
      "chain": [
        "30401",
        "30369",
        "20032",
        "20311",
        "10739",
        "11264",
        "53"
      ]
    },
    {
      "hadith_no": "1344",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Chapters On Judgements From The Messenger of Allah - كتاب الأحكام عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن بشار، ومحمد بن أبان، قالا حدثنا عبد الوهاب الثقفي، عن جعفر بن محمد، عن أبيه، عن جابر، أن النبي صلى الله عليه وسلم قضى باليمين مع الشاهد ‏.‏",
      "text_en": " Jabir narrated:                      \"The Prophet (ﷺ) passed judgement based on oath along with a witness.\"",
      "chain": [
        "30160",
        "30369",
        "20259",
        "10898",
        "11442",
        "34"
      ]
    },
    {
      "hadith_no": "1858",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر، محمد بن أبان حدثنا وكيع، حدثنا هشام الدستوائي، عن بديل بن ميسرة العقيلي، عن عبد الله بن عبيد بن عمير، عن أم كلثوم، عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا أكل أحدكم طعاما فليقل بسم الله فإن نسي في أوله فليقل بسم الله في أوله وآخره ‏\"‏ ‏.‏",
      "text_en": " Narrated Umm Kulthum:                     From 'Aishah that the Messenger of Allah (ﷺ) said: \"When one of you eats food, then let him say: 'Bismillah.' If he forgets in the beginning, then let him say: 'Bismillah Fi Awwalihi Wa Akhirih (In the Name of Allah in its beginning and its end.)\"",
      "chain": [
        "30369",
        "20032",
        "20295",
        "10672",
        "10643",
        "10500",
        "53"
      ]
    },
    {
      "hadith_no": "2044",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا أبو بكر، محمد بن أبان حدثنا محمد بن فضيل، عن محمد بن إسحاق، عن عمرو بن شعيب، عن أبيه، عن جده، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ليس منا من لم يرحم صغيرنا ويعرف شرف كبيرنا ‏\"‏ ‏.‏",
      "text_en": " Amr bin Shu'aib  narrated that his father, from his grandfather, who said that the Messenger of Allah said:                     'He is not one of us who does not have mercy upon our young, nor knows the honor of our elders.\"",
      "chain": [
        "30369",
        "20356",
        "11107",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2046",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا أبو بكر، محمد بن أبان حدثنا يزيد بن هارون، عن شريك، عن ليث، عن عكرمة، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ليس منا من لم يرحم صغيرنا ويوقر كبيرنا ويأمر بالمعروف وينه عن المنكر ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ وحديث محمد بن إسحاق عن عمرو بن شعيب حديث حسن صحيح وقد روي عن عبد الله بن عمرو من غير هذا الوجه أيضا ‏.‏ - قال بعض أهل العلم معنى قول النبي صلى الله عليه وسلم ‏\"‏ ليس منا ‏\"‏ ‏.‏ يقول ليس من سنتنا يقول ليس من أدبنا ‏.‏ وقال علي بن المديني قال يحيى بن سعيد كان سفيان الثوري ينكر هذا التفسير ليس منا يقول ليس مثلنا ‏.‏",
      "text_en": " Ibn Abbas narrated that the Messenger of Allah said:                     \" He is not one of us who does not have mercy upon our young, respect our elders, and command good and forbid evil.\"",
      "chain": [
        "30369",
        "20472",
        "20587",
        "20023",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "3178",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Recitation - كتاب القراءات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "46",
      "text_ar": "حدثنا أبو بكر، محمد بن أبان حدثنا أيوب بن سويد الرملي، عن يونس بن يزيد، عن الزهري، عن أنس، أن النبي صلى الله عليه وسلم وأبا بكر وعمر - وأراه قال - وعثمان كانوا يقرءون ‏(‏ملك يوم الدين ‏)‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه من حديث الزهري عن أنس بن مالك إلا من حديث هذا الشيخ أيوب بن سويد الرملي ‏.‏ وقد روى بعض أصحاب الزهري هذا الحديث عن الزهري أن النبي صلى الله عليه وسلم وأبا بكر وعمر كانوا يقرءون ‏(‏ملك يوم الدين ‏)‏ ‏.‏ وقد روى عبد الرزاق عن معمر عن الزهري عن سعيد بن المسيب أن النبي صلى الله عليه وسلم وأبا بكر وعمر كانوا يقرءون ‏(‏ملك يوم الدين ‏)‏‏.‏",
      "text_en": " Narrated Anas:                     that the Prophet (ﷺ), Abu Bakr, and 'Umar - and I think he said - and 'Uthman would recite: \"Maaliki Yawmid-Din (1:4).'\"",
      "chain": [
        "30369",
        "28053",
        "20475",
        "11013",
        "19"
      ]
    },
    {
      "hadith_no": "3473",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمد بن أبان، حدثنا عبد الرزاق، عن يونس بن سليم، عن يونس بن يزيد، عن الزهري، بهذا الإسناد نحوه بمعناه ‏.‏ قال أبو عيسى هذا أصح من الحديث الأول سمعت إسحاق بن منصور، يقول روى أحمد بن حنبل، وعلي بن المديني، وإسحاق بن إبراهيم، عن عبد الرزاق، عن يونس بن سليم، عن يونس بن يزيد، عن الزهري، هذا الحديث ‏.‏ قال أبو عيسى ومن سمع من عبد الرزاق، قديما فإنهم إنما يذكرون فيه عن يونس بن يزيد وبعضهم لا يذكر فيه عن يونس بن يزيد ومن ذكر فيه يونس بن يزيد فهو أصح وكان عبد الرزاق ربما ذكر في هذا الحديث يونس بن يزيد وربما لم يذكره وإذا لم يذكر فيه يونس فهو مرسل ‏.‏",
      "text_en": "",
      "chain": [
        "30369",
        "20121",
        "20475",
        "11013",
        "30313",
        "30026",
        "30123",
        "20121",
        "20475"
      ]
    },
    {
      "hadith_no": "3514",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمد بن أبان، حدثنا ابن أبي عدي، عن داود بن أبي هند، عن الشعبي، عن مسروق، عن عائشة، رضى الله عنها قالت لو كان النبي صلى الله عليه وسلم كاتما شيئا من الوحى لكتم هذه الآية ‏:‏ ‏(‏ إذ تقول للذي أنعم الله عليه وأنعمت عليه ‏)‏ الآية ‏.‏ قال هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated 'Aishah [may Allah be pleased with her]:                     \"If the Prophet (ﷺ) was to have hidden anything from the Revelation, then he would have hidden this Ayah: 'When you said to him on whom Allah has bestowed grace and you have done a favor (33:37).'\"",
      "chain": [
        "30369",
        "20276",
        "11585",
        "11052",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "3659",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمد بن أبان، وغير، واحد، قالوا حدثنا عبد الوهاب الثقفي، عن أيوب، عن ابن أبي مليكة، عن عائشة، عن النبي صلى الله عليه وسلم نحوه ‏.‏",
      "text_en": "",
      "chain": [
        "30369",
        "20259",
        "11015",
        "11090",
        "53"
      ]
    },
    {
      "hadith_no": "951",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا محمد بن أبان البلخي، قال حدثنا وكيع بن الجراح، عن مسعر، والمسعودي، عن الوليد بن سريع، عن عمرو بن حريث، قال سمعت النبي صلى الله عليه وسلم يقرأ في الفجر ‏{‏ إذا الشمس كورت ‏}‏ ‏.‏",
      "text_en": " It was narrated that Amr bin Huraith said:                     \"I heard the Prophet (ﷺ) reciting: 'When the sun is wound round.' in fajr. \"",
      "chain": [
        "30369",
        "20032",
        "20359",
        "20724",
        "10837",
        "5202"
      ]
    },
    {
      "hadith_no": "2284",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن أبان البلخي، قال حدثنا معن، عن ابن أبي ذئب، عن الزهري، عن أبي سلمة بن عبد الرحمن، عن عبد الرحمن بن عوف، قال يقال الصيام في السفر كالإفطار في الحضر ‏.‏",
      "text_en": " It was narrated that 'Abdur-Rahman bin 'Awf said:                     \"It is said that fasting while traveling is like not fasting while a resident.\" (Daif)",
      "chain": [
        "30369",
        "30112",
        "20177",
        "11013",
        "10567",
        "8"
      ]
    },
    {
      "hadith_no": "5346",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا محمد بن أبان، قال حدثنا أبو أسامة، عن مساور الوراق، عن جعفر بن عمرو بن أمية، عن أبيه، قال كأني أنظر الساعة إلى رسول الله صلى الله عليه وسلم على المنبر وعليه عمامة سوداء قد أرخى طرفها بين كتفيه ‏.‏",
      "text_en": " It was narrated from Ja'far bin 'Amr bin Umayyah that his father said:                     \"It is as if I am looking now at the Messenger of Allah [SAW] on the Minbar, wearing a black turban, the end of which he has let hang down between his shoulders.\"",
      "chain": [
        "30369",
        "20318",
        "20607",
        "11501"
      ]
    },
    {
      "hadith_no": "5628",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا محمد بن أبان، قال حدثنا شبابة بن سوار، قال حدثنا شعبة، عن بكير بن عطاء، عن عبد الرحمن بن يعمر، عن النبي صلى الله عليه وسلم نهى عن الدباء، والمزفت، ‏.‏",
      "text_en": " It was narrated from 'Abdur-Rahman bin Ya'mar that:                     The Prophet [SAW] forbade Ad-Dubba' and Al-Muzaffat.",
      "chain": [
        "30369",
        "20426",
        "20020",
        "19862"
      ]
    },
    {
      "hadith_no": "5711",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا محمد بن أبان، قال حدثنا عبد الله بن إدريس، قال أنبأنا شعبة، عن بريد بن أبي مريم، عن أبي الحوراء السعدي، قال قلت للحسن بن علي رضى الله عنهما ما حفظت من رسول الله صلى الله عليه وسلم قال حفظت منه ‏\"‏ دع ما يريبك إلى ما لا يريبك ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Al-Hawra' As-Sa'di said:                     \"I said to Al-Hasan bin 'Ali, may Allah be pleased with him: 'What did you memorize from the Messenger of Allah [SAW]?' He said: I memorized from him: 'Leave that which makes you doubt for that which does not make you doubt.'\"",
      "chain": [
        "30369",
        "20102",
        "20020",
        "19840",
        "19845"
      ]
    },
    {
      "hadith_no": "701",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن أبان البلخي، حدثنا عبد الرزاق، أنبأنا إسرائيل، عن عمرو بن خالد، عن زيد بن علي، عن أبيه، عن جده، عن علي بن أبي طالب، قال انكسرت إحدى زندى فسألت النبي  صلى الله عليه وسلم  فأمرني أن أمسح على الجبائر ‏.‏",
      "text_en": " It was narrated that 'Ali bin Abu Talib said:                     \"I broke one of my forearms and I asked the Prophet about that. He told me to wipe over the bandages.\" (Maudu')Another chain with similar meaning.",
      "chain": [
        "30369",
        "20121",
        "20311",
        "30237",
        "5"
      ]
    },
    {
      "hadith_no": "2286",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا محمد بن أبان البلخي أبو بكر، حدثنا إسماعيل ابن علية، عن يونس بن عبيد، عن عطاء بن فروخ، قال قال عثمان بن عفان قال رسول الله  صلى الله عليه وسلم  ‏\"‏ أدخل الله رجلا الجنة كان سهلا بائعا ومشتريا ‏\"‏ ‏.‏",
      "text_en": " 'Uthman bin 'Affan narrated that the Messenger of Allah (ﷺ) said:                     “Allah will admit to Paradise a man who was lenient when he sold and when he bought. \"",
      "chain": [
        "30369",
        "20208",
        "11075",
        "12360",
        "4"
      ]
    }
  ],
  "total_hadiths": 22
}