{
  "id": "30378",
  "name": "Muhammad bin ''Aabadh محمد بن عبادة",
  "full_name": "Muhammad bin ''Aabadh محمد بن عبادة",
  "grade": "3rd Century AH [11th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Wasit"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ خ  د  ق  -  صدوق ]"
    ],
    "tags": [
      "al-Wasti"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20355",
      "name": "Muhammad bin 'Abdullah bin al-Zubair محمد بن عبد الله أبو أحمد الزبيري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20318",
      "name": "Hammad bin Usamah حماد بن أسامة - أبو أسامة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20411",
      "name": "Ishaq bin Yusuf bin Mrdas إسحاق بن يوسف بن مرداس",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20472",
      "name": "Yazid bin Harun يزيد بن هارون",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20679",
      "name": "Y'aqub bin Ishaq bin Zayd يعقوب بن إسحاق بن زيد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20556",
      "name": "'Abdul Malik bin Qarib - al-Asma'i عبد الملك بن قريب بن عبد الملك - الأصمعي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "30004",
      "name": "Ibn Maja ابن ماجة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-6174",
      "hadith_no": "6174",
      "source": "Sahih Bukhari",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا محمد بن عبادة، أخبرنا يزيد، أخبرنا سليم، حدثنا عمرو بن دينار، حدثنا جابر بن عبد الله، أن معاذ بن جبل  رضى الله عنه  كان يصلي مع النبي صلى الله عليه وسلم ثم يأتي قومه فيصلي بهم الصلاة، فقرأ بهم البقرة  قال  فتجوز رجل فصلى صلاة خفيفة، فبلغ ذلك معاذا فقال إنه منافق‏.‏ فبلغ ذلك الرجل، فأتى النبي صلى الله عليه وسلم فقال يا رسول الله إنا قوم نعمل بأيدينا، ونسقي بنواضحنا، وإن معاذا صلى بنا البارحة، فقرأ البقرة فتجوزت، فزعم أني منافق‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ يا معاذ أفتان أنت  ثلاثا  اقرأ ‏{‏والشمس وضحاها‏}‏ و‏{‏سبح اسم ربك الأعلى‏}‏ ونحوها ‏\"‏‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     Mu`adh bin Jabal used to pray with the Prophet and then go to lead his people in prayer. Once he led the people in prayer and recited Surat-al-Baqara. A man left (the row of the praying people) and offered (light) prayer (separately) and went away. When Mu`adh came to know about it, he said. \"He (that man) is a hypocrite.\" Later that man heard what Mu`adh said about him, so he came to the Prophet and said, \"O Allah's Apostle! We are people who work with our own hands and irrigate (our farms) with our camels. Last night Mu`adh led us in the (night) prayer and he recited Sura-al-Baqara, so I offered my prayer separately, and because of that, he accused me of being a hypocrite.\" The Prophet called Mu`adh and said thrice, \"O Mu`adh! You are putting the people to trials? Recite 'Washshamsi wad-uhaha' (91) or'Sabbih isma Rabbi ka-l-A'la' (87) or the like.\"",
      "usc_msa_ref": "127",
      "chain": [
        "30378",
        "20472",
        "20234",
        "11081",
        "34",
        "32"
      ]
    },
    {
      "id": "sahih-bukhari-7366",
      "hadith_no": "7366",
      "source": "Sahih Bukhari",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا محمد بن عبادة، أخبرنا يزيد، حدثنا سليم بن حيان  وأثنى عليه  حدثنا سعيد بن ميناء، حدثنا أو، سمعت جابر بن عبد الله، يقول جاءت ملائكة إلى النبي صلى الله عليه وسلم وهو نائم فقال بعضهم إنه نائم‏.‏ وقال بعضهم إن العين نائمة والقلب يقظان‏.‏ فقالوا إن لصاحبكم هذا مثلا فاضربوا له مثلا‏.‏ فقال بعضهم إنه نائم‏.‏ وقال بعضهم إن العين نائمة والقلب يقظان‏.‏ فقالوا مثله كمثل رجل بنى دارا، وجعل فيها مأدبة وبعث داعيا، فمن أجاب الداعي دخل الدار وأكل من المأدبة، ومن لم يجب الداعي لم يدخل الدار ولم يأكل من المأدبة‏.‏ فقالوا أولوها له يفقهها فقال بعضهم إنه نائم‏.‏ وقال بعضهم إن العين نائمة والقلب يقظان‏.‏ فقالوا فالدار الجنة، والداعي محمد صلى الله عليه وسلم فمن أطاع محمدا صلى الله عليه وسلم فقد أطاع الله، ومن عصى محمدا صلى الله عليه وسلم فقد عصى الله، ومحمد صلى الله عليه وسلم فرق بين الناس‏.‏ تابعه قتيبة عن ليث، عن خالد، عن سعيد بن أبي هلال، عن جابر، خرج علينا النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     Some angels came to the Prophet while he was sleeping. Some of them said, \"He is sleeping.\" Others said, \"His eyes are sleeping but his heart is awake.\" Then they said, \"There is an example for this companion of yours.\" One of them said, \"Then set forth an example for him.\" Some of them said, \"He is sleeping.\" The others said, \"His eyes are sleeping but his heart is awake.\" Then they said, \"His example is that of a man who has built a house and then offered therein a banquet and sent an inviter (messenger) to invite the people. So whoever accepted the invitation of the inviter, entered the house and ate of the banquet, and whoever did not accept the invitation of the inviter, did not enter the house, nor did he eat of the banquet.\" Then the angels said, \"Interpret this example to him so that he may understand it.\" Some of them said, \"He is sleeping.'' The others said, \"His eyes are sleeping but his heart is awake.\" And then they said, \"The houses stands for Paradise and the call maker is Muhammad; and whoever obeys Muhammad, obeys Allah; and whoever disobeys Muhammad, disobeys Allah. Muhammad separated the people (i.e., through his message, the good is distinguished from the bad, and the believers from the disbelievers).",
      "usc_msa_ref": "385",
      "chain": [
        "30378",
        "20472",
        "20234",
        "11510",
        "34"
      ]
    },
    {
      "id": "sunan-abi-daud-3874",
      "hadith_no": "3874",
      "source": "Sunan Abi Da'ud",
      "chapter": "Medicine (Kitab Al-Tibb) - كتاب الطب",
      "chapter_no": "29",
      "text_ar": "حدثنا محمد بن عبادة الواسطي، حدثنا يزيد بن هارون، أخبرنا إسماعيل بن عياش، عن ثعلبة بن مسلم، عن أبي عمران الأنصاري، عن أم الدرداء، عن أبي الدرداء، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله أنزل الداء والدواء وجعل لكل داء دواء فتداووا ولا تداووا بحرام ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu al-Darda:                     The Prophet (ﷺ) said: Allah has sent down both the disease and the cure, and He has appointed a cure for every disease, so treat yourselves medically, but use nothing unlawful.",
      "usc_msa_ref": "",
      "chain": [
        "30378",
        "20472",
        "20736",
        "17010",
        "17096",
        "11457",
        "37"
      ]
    },
    {
      "id": "sunan-abi-daud-4344",
      "hadith_no": "4344",
      "source": "Sunan Abi Da'ud",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا محمد بن عبادة الواسطي، حدثنا يزيد، - يعني ابن هارون - أخبرنا إسرائيل، حدثنا محمد بن جحادة، عن عطية العوفي، عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أفضل الجهاد كلمة عدل عند سلطان جائر ‏\"‏ ‏.‏ أو ‏\"‏ أمير جائر ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuSa'id al-Khudri:                     The Prophet (ﷺ) said: The best fighting (jihad) in the path of Allah is (to speak) a word of justice to an oppressive ruler.",
      "usc_msa_ref": "",
      "chain": [
        "30378",
        "20472",
        "20311",
        "18897",
        "15373",
        "38"
      ]
    },
    {
      "id": "sunan-ibn-majah-1203",
      "hadith_no": "1203",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أحمد بن سنان، ومحمد بن عبادة الواسطيان، قالا حدثنا أبو أحمد، حدثنا سفيان، عن أبي إسحاق، عن مجاهد، عن ابن عمر، قال رمقت النبي  صلى الله عليه وسلم  شهرا فكان يقرأ في الركعتين قبل الفجر ‏{قل يا أيها الكافرون}‏ و ‏{قل هو الله أحد}‏ ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Umar said:                      “I watched the Prophet (ﷺ) foramonth, and in the two Rak’ah before Fajr he used to recite: “Say:Oyou disbelievers!” [Al-Kafirun (109)] and “Say: Allah is One.”[Al-Ikhlas (112)]",
      "usc_msa_ref": "",
      "chain": [
        "30297",
        "30378",
        "20355",
        "20012",
        "11049",
        "11028",
        "18"
      ]
    },
    {
      "id": "sunan-ibn-majah-1990",
      "hadith_no": "1990",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن عبادة الواسطي، حدثنا يزيد بن هارون، حدثنا عبد الملك بن حسين أبو مالك النخعي، عن منصور، عن أبي حازم، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ الوليمة أول يوم حق والثاني معروف والثالث رياء وسمعة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah:                     that the Messenger of Allah said: 'The wedding feast on the first day is an obligation, on the second day is a custom and on the third day is showing off.”",
      "usc_msa_ref": "",
      "chain": [
        "30378",
        "20472",
        "11067",
        "11349",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-2247",
      "hadith_no": "2247",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا عمرو بن علي أبو حفص الصيرفي، حدثنا أبو داود، ح وحدثنا محمد بن عبادة الواسطي، حدثنا يزيد بن هارون، قالا حدثنا ورقاء، عن عبد الأعلى، عن أبي جميلة عن علي، قال احتجم رسول الله  صلى الله عليه وسلم  وأمرني فأعطيت الحجام أجره ‏.‏",
      "text_en": " It was narrated that 'Ali said:                     \"The Messenger of Allah (ﷺ) was treated with cupping and he told me to give the cupper his wages.\"",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20547",
        "30378",
        "20472",
        "20246",
        "5"
      ]
    },
    {
      "id": "sunan-ibn-majah-3737",
      "hadith_no": "3737",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا محمد بن عبادة، ومحمد بن عبد الملك الواسطيان، قالا حدثنا يزيد بن هارون، أنبأنا شريك، عن عثمان بن أبي زرعة، عن مهاجر، عن ابن عمر، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من لبس ثوب شهرة ألبسه الله يوم القيامة ثوب مذلة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Umar said:                      “The Messenger of Allah (ﷺ)said:‘Whoever wears a garment of pride and vanity, Allah will clothehim, on the Day of Resurrection, in a garment of humiliation.’”",
      "usc_msa_ref": "",
      "chain": [
        "30378",
        "20472",
        "11858",
        "21619",
        "18"
      ]
    },
    {
      "id": "sunan-ibn-majah-4147",
      "hadith_no": "4147",
      "source": "Sunan Ibn Majah",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا القاسم بن زكريا بن دينار، حدثنا عبد الرحمن بن مصعب، ح وحدثنا محمد بن عبادة الواسطي، حدثنا يزيد بن هارون، قالا حدثنا إسرائيل، أنبأنا محمد بن جحادة، عن عطية العوفي، عن أبي سعيد الخدري، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ أفضل الجهاد كلمة عدل عند سلطان جائر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Sa’eed Al-Khudri that the Messenger ofAllah(ﷺ) said:                      “The best of jihad is a just word spoken to anunjustruler.”",
      "usc_msa_ref": "",
      "chain": [
        "30475",
        "30378",
        "20472",
        "20311",
        "18897",
        "15373",
        "38"
      ]
    }
  ],
  "total_hadiths": 9
}