{
  "id": "30373",
  "name": "Muhammad bin Harb al-Wasti محمد بن حرب بن حرمان النشائي",
  "full_name": "Muhammad bin Harb al-Wasti محمد بن حرب بن حرمان النشائي",
  "grade": "3rd Century AH [10th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "255",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Wasit"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ خ  م  د  -  صدوق ]"
    ],
    "tags": [
      "al-Wasti"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20354",
      "name": "Muhammad bin Khazim al-Darir محمد بن خازم أبو معاوية الضرير",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "27036",
      "name": "Muhammad bin Yazid al-Kula'i محمد بن يزيد الكلاعي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20411",
      "name": "Ishaq bin Yusuf bin Mrdas إسحاق بن يوسف بن مرداس",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20557",
      "name": "Abd al-Whab bin Ata'a عبد الوهاب بن عطاء الخفاف أبو نصر",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "25206",
      "name": "'Umar bin Shbyb عمر بن شبيب",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20563",
      "name": "'Amr bin al-Hythm bin Qtn عمرو بن الهيثم بن قطن",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "28413",
      "name": "'Ali bin 'Asim bin S'hyb علي بن عاصم بن صهيب الواسطي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20328",
      "name": "Shuja' bin al-Walid bin Qays al-Sakuni شجاع بن الوليد بن قيس",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20426",
      "name": "Shababa bin Sawar شبابة بن سوار الفزاري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20650",
      "name": "Zayd bin al-Habab al-'Akli زيد بن الحباب أبو الحسين العكلي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "39765",
      "name": "'Ali bin Yazid al-Sadali al-Akfani علي بن يزيد الصدائي",
      "grade": "3rd Century AH"
    },
    {
      "id": "20397",
      "name": "Yahya bin Abi Zakaria يحيى بن أبي زكريا",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20537",
      "name": "Hmad bin Khalid al-Khyat حماد بن خالد الخياط القرشي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20472",
      "name": "Yazid bin Harun يزيد بن هارون",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]"
    },
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30554",
      "name": "Abu Zara' al-Razi أبو زرعة الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "24344",
      "name": "'Amr bin Muhammad bin Abi Razayn عمرو بن محمد بن أبي رزين",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "77",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثني محمد بن يوسف، قال حدثنا أبو مسهر، قال حدثني محمد بن حرب، حدثني الزبيدي، عن الزهري، عن محمود بن الربيع، قال عقلت من النبي صلى الله عليه وسلم مجة مجها في وجهي وأنا ابن خمس سنين من دلو‏.‏",
      "text_en": " Narrated Mahmud bin Rabi`a:                     When I was a boy of five, I remember, the Prophet took water from a bucket (used far getting water out of a well) with his mouth and threw it on my face.",
      "chain": [
        "30388",
        "30284",
        "30373",
        "20459",
        "11013",
        "5278"
      ]
    },
    {
      "hadith_no": "78",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا أبو القاسم، خالد بن خلي قال حدثنا محمد بن حرب، قال قال الأوزاعي أخبرنا الزهري، عن عبيد الله بن عبد الله بن عتبة بن مسعود، عن ابن عباس، أنه تمارى هو والحر بن قيس بن حصن الفزاري في صاحب موسى، فمر بهما أبى بن كعب، فدعاه ابن عباس فقال إني تماريت أنا وصاحبي هذا في صاحب موسى الذي سأل السبيل إلى لقيه، هل سمعت رسول الله صلى الله عليه وسلم يذكر شأنه فقال أبى نعم، سمعت النبي صلى الله عليه وسلم يذكر شأنه يقول ‏\"‏ بينما موسى في ملإ من بني إسرائيل، إذ جاءه رجل فقال أتعلم أحدا أعلم منك قال موسى لا‏.‏ فأوحى الله عز وجل إلى موسى بلى، عبدنا خضر، فسأل السبيل إلى لقيه، فجعل الله له الحوت آية، وقيل له إذا فقدت الحوت فارجع، فإنك ستلقاه، فكان موسى صلى الله عليه وسلم يتبع أثر الحوت في البحر‏.‏ فقال فتى موسى لموسى أرأيت إذ أوينا إلى الصخرة فإني نسيت الحوت، وما أنسانيه إلا الشيطان أن أذكره‏.‏ قال موسى ذلك ما كنا نبغي‏.‏ فارتدا على آثارهما قصصا، فوجدا خضرا، فكان من شأنهما ما قص الله في كتابه ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     that he differed with Hur bin Qais bin Hisn Al-Fazari regarding the companion of the Prophet Moses. Meanwhile, Ubai bin Ka`b passed by them and Ibn `Abbas called him saying, \"My friend (Hur) and I have differed regarding Moses' companion whom Moses asked the way to meet. Have you heard Allah's Apostle mentioning something about him? Ubai bin Ka`b said: \"Yes, I heard the Prophet mentioning something about him (saying) while Moses was sitting in the company of some Israelites, a man came and asked him: \"Do you know anyone who is more learned than you? Moses replied: \"No.\" So Allah sent the Divine Inspiration to Moses: '--Yes, Our slave Khadir is more learned than you. Moses asked Allah how to meet him (Al-Khadir). So Allah made the fish a sign for him and he was told when the fish was lost, he should return (to the place where he had lost it) and there he would meet him (Al-Khadir). So Moses went on looking for the sign of the fish in the sea. The servant-boy of Moses said: 'Do you remember when we betook ourselves to the rock, I indeed forgot the fish, none but Satan made me forget to remember it. On that Moses said, 'That is what we have been seeking.' So they went back retracing their footsteps, and found Khadir. (and) what happened further about them is narrated in the Holy Qur'an by Allah.\" (18.54 up to 18.82)",
      "chain": [
        "30333",
        "30373",
        "20024",
        "11013",
        "11004",
        "17"
      ]
    },
    {
      "hadith_no": "944",
      "source": " Sahih Bukhari ",
      "chapter": "Fear Prayer - كتاب صلاة الخوف",
      "chapter_no": "12",
      "text_ar": "حدثنا حيوة بن شريح، قال حدثنا محمد بن حرب، عن الزبيدي، عن الزهري، عن عبيد الله بن عبد الله بن عتبة، عن ابن عباس  رضى الله عنهما  قال قام النبي صلى الله عليه وسلم وقام الناس معه، فكبر وكبروا معه، وركع وركع ناس منهم، ثم سجد وسجدوا معه، ثم قام للثانية فقام الذين سجدوا وحرسوا إخوانهم، وأتت الطائفة الأخرى فركعوا وسجدوا معه، والناس كلهم في صلاة، ولكن يحرس بعضهم بعضا‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Once the Prophet (p.b.u.h) led the fear prayer and the people stood behind him. He said Takbir (Allahu-Akbar) and the people said the same. He bowed and some of them bowed. Then he prostrated and they also prostrated. Then he stood for the second rak`a and those who had prayed the first rak`a left and guarded their brothers. The second party joined him and performed bowing and prostration with him. All the people were in prayer but they were guarding one another during the prayer.",
      "chain": [
        "26010",
        "30373",
        "20459",
        "11013",
        "11004",
        "17"
      ]
    },
    {
      "hadith_no": "1389",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا إسماعيل، حدثني سليمان، عن هشام، وحدثني محمد بن حرب، حدثنا أبو مروان، يحيى بن أبي زكرياء عن هشام، عن عروة، عن عائشة، قالت إن كان رسول الله صلى الله عليه وسلم ليتعذر في مرضه ‏\"‏ أين أنا اليوم أين أنا غدا ‏\"‏ استبطاء ليوم عائشة، فلما كان يومي قبضه الله بين سحري ونحري، ودفن في بيتي‏.‏",
      "text_en": " Narrated `Aisha:                     During his sickness, Allah's Apostle was asking repeatedly, \"Where am I today? Where will I be tomorrow?\" And I was waiting for the day of my turn (impatiently). Then, when my turn came, Allah took his soul away (in my lap) between my chest and arms and he was buried in my house.",
      "chain": [
        "30103",
        "20160",
        "11065",
        "30373",
        "20397",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "5798",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثني محمد بن خالد، حدثنا محمد بن وهب بن عطية الدمشقي، حدثنا محمد بن حرب، حدثنا محمد بن الوليد الزبيدي، أخبرنا الزهري، عن عروة بن الزبير، عن زينب ابنة أبي سلمة، عن أم سلمة  رضى الله عنها  أن النبي صلى الله عليه وسلم رأى في بيتها جارية في وجهها سفعة فقال ‏\"‏ استرقوا لها، فإن بها النظرة ‏\"‏‏.‏ وقال عقيل عن الزهري أخبرني عروة عن النبي صلى الله عليه وسلم‏.‏ تابعه عبد الله بن سالم عن الزبيدي‏.‏",
      "text_en": " Narrated Um Salama:                     that the Prophet saw in her house a girl whose face had a black spot. He said. \"She is under the effect of an evil eye; so treat her with a Ruqya.\"",
      "chain": [
        "38496",
        "30287",
        "30373",
        "20459",
        "11013",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "6967",
      "source": " Sahih Bukhari ",
      "chapter": "Blood Money (Ad-Diyat) - كتاب الديات",
      "chapter_no": "88",
      "text_ar": "حدثنا فروة، حدثنا علي بن مسهر، عن هشام، عن أبيه، عن عائشة، هزم المشركون يوم أحد‏.‏ وحدثني محمد بن حرب، حدثنا أبو مروان، يحيى بن أبي زكرياء عن هشام، عن عروة، عن عائشة  رضى الله عنها  قالت صرخ إبليس يوم أحد في الناس يا عباد الله أخراكم‏.‏ فرجعت أولاهم على أخراهم حتى قتلوا اليمان فقال حذيفة أبي أبي‏.‏ فقتلوه، فقال حذيفة غفر الله لكم‏.‏ قال وقد كان انهزم منهم قوم حتى لحقوا بالطائف‏.‏",
      "text_en": " Narrated `Aisha:                     The pagans were defeated on the day (of the battle) of Uhud. Satan shouted among the people on the day of Uhud, \"O Allah's worshippers! Beware of what is behind you!\" So the front file of the army attacked the back files (mistaking them for the enemy) till they killed Al-Yaman. Hudhaifa (bin Al- Yaman) shouted, \"My father!\" My father! But they killed him. Hudhaifa said, \"May Allah forgive you.\" (The narrator added: Some of the defeated pagans fled till they reached Taif.)",
      "chain": [
        "30207",
        "20345",
        "11065",
        "10511",
        "30373",
        "20397",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "7082",
      "source": " Sahih Bukhari ",
      "chapter": "Interpretation of Dreams - كتاب التعبير",
      "chapter_no": "92",
      "text_ar": "حدثنا خالد بن خلي، حدثنا محمد بن حرب، حدثني الزبيدي، عن الزهري، قال أبو سلمة قال أبو قتادة  رضى الله عنه  قال النبي صلى الله عليه وسلم ‏\"‏ من رآني فقد رأى الحق ‏\"‏‏.‏ تابعه يونس وابن أخي الزهري",
      "text_en": " Narrated Abu Qatada:                     The Prophet said, \"Whoever sees me (in a dream) then he indeed has seen the truth .\"",
      "chain": [
        "30333",
        "30373",
        "20459",
        "11013",
        "10567",
        "391"
      ]
    },
    {
      "hadith_no": "7458",
      "source": " Sahih Bukhari ",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثني محمد بن حرب، حدثنا يحيى بن أبي زكرياء الغساني، عن هشام، عن عروة، عن عائشة، أن رسول الله صلى الله عليه وسلم خطب الناس فحمد الله وأثنى عليه وقال ‏\"‏ ما تشيرون على في قوم يسبون أهلي ما علمت عليهم من سوء قط ‏\"‏‏.‏ وعن عروة قال لما أخبرت عائشة بالأمر قالت يا رسول الله أتأذن لي أن أنطلق إلى أهلي‏.‏ فأذن لها وأرسل معها الغلام‏.‏ وقال رجل من الأنصار سبحانك ما يكون لنا أن نتكلم بهذا، سبحانك هذا بهتان عظيم‏.‏",
      "text_en": " Narrated Aisha:                     Allah's Apostle addressed the people, and after praising and glorifying Allah, he said, \"What do you suggest me regarding those people who are abusing my wife? I have never known anything bad about her.\" The sub-narrator, `Urwa, said: When `Aisha was told of the slander, she said, \"O Allah's Apostle! Will you allow me to go to my parents' home?\" He allowed her and sent a slave along with her. An Ansari man said, \"Subhanaka! It is not right for us to speak about this. Subhanaka! This is a great lie!\"",
      "chain": [
        "30373",
        "20397",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "439",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا إبراهيم بن دينار، ومحمد بن حرب الواسطي، قالا حدثنا عمرو بن الهيثم أبو قطن، حدثنا شعبة، عن قتادة، عن خلاس، عن أبي رافع، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لو تعلمون - أو يعلمون - ما في الصف المقدم لكانت قرعة ‏\"‏ ‏.‏ وقال ابن حرب ‏\"‏ الصف الأول ما كانت إلا قرعة ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      The Messenger of Allah (may peace be upon him) said: If you were to know, or if they were to know, what (excellence) lies in the first rows, there would have been drawing of lots (for filling them) ; and Ibn Harb said: For (occupying) the first row there would have been drawing of lots.",
      "chain": [
        "30496",
        "30373",
        "20020",
        "11019",
        "11283",
        "479",
        "13"
      ]
    },
    {
      "hadith_no": "1197",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا حاجب بن الوليد، حدثنا محمد بن حرب، عن الزبيدي، عن الزهري، أخبرني سعيد بن المسيب، وأبو سلمة بن عبد الرحمن أن أبا هريرة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏.‏ مثل حديث يونس ‏.‏",
      "text_en": " Abu Huraira reported:                      I heard the Messenger of Allah (may peace be upon him) saying a hadith like that of Yunus.",
      "chain": [
        "30373",
        "20459",
        "11013",
        "11002",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "2133",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Eclipse) - كتاب الكسوف",
      "chapter_no": "11",
      "text_ar": "وحدثنا حاجب بن الوليد، حدثنا محمد بن حرب، حدثنا محمد بن الوليد الزبيدي، عن الزهري، قال كان كثير بن عباس يحدث أن ابن عباس، كان يحدث عن صلاة، رسول الله صلى الله عليه وسلم يوم كسفت الشمس بمثل ما حدث عروة عن عائشة ‏.‏",
      "text_en": " Zuhri said:                      Kathir b. Abbas used to narrate that Ibn 'Abbas used to relate about the prayer of the Messenger of Allah (may peace be upon him) in regard to the eclipse of the sun like that what was narrated by 'Urwa on the authority of 'A'isha.",
      "chain": [
        "30373",
        "20459",
        "11013",
        "17"
      ]
    },
    {
      "hadith_no": "3442",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثني إسحاق بن منصور، حدثنا عيسى بن المنذر الحمصي، حدثنا محمد بن، حرب حدثنا الزبيدي، عن الزهري، عن أبي سلمة بن عبد الرحمن، وأبي عبد الله الأغر، مولى الجهنيين - وكان من أصحاب أبي هريرة - أنهما سمعا أبا هريرة يقول صلاة في مسجد رسول الله صلى الله عليه وسلم أفضل من ألف صلاة فيما سواه من المساجد إلا المسجد الحرام فإن رسول الله صلى الله عليه وسلم آخر الأنبياء وإن مسجده آخر المساجد ‏.‏ قال أبو سلمة وأبو عبد الله لم نشك أن أبا هريرة كان يقول عن حديث رسول الله صلى الله عليه وسلم فمنعنا ذلك أن نستثبت أبا هريرة عن ذلك الحديث حتى إذا توفي أبو هريرة تذاكرنا ذلك وتلاومنا أن لا نكون كلمنا أبا هريرة في ذلك حتى يسنده إلى رسول الله صلى الله عليه وسلم إن كان سمعه منه فبينا نحن على ذلك جالسنا عبد الله بن إبراهيم بن قارظ فذكرنا ذلك الحديث والذي فرطنا فيه من نص أبي هريرة عنه فقال لنا عبد الله بن إبراهيم أشهد أني سمعت أبا هريرة يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ فإني آخر الأنبياء وإن مسجدي آخر المساجد ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported:                      Prayer in the mosque of Allah's Messenger (may peace be upon him) is more excellent than a thousand prayers in other mosques except the Masjid al-Haram, for Allah's Messenger (may peace be upon him) is the last of the Apostles, and his mosque is the last of the mosques. Abu Salama and Abu Abdullah (two of the narrators in this chain of narrations said: We had no doubt that what Abu Haraira (Allah be pleased with him) had said was from Allah's Messenger (may peace be upon him), and so we did not like to get an attestation from Abu Huraira about this hadith until Abu Huraira (Allah be pleased with him) died. We discussed it (the issue of getting attestation from Abu Huraira) amongst ourselves and blamed one another as to why we did not talk about it to Abu Huraira regarding it so that he could attribute its transmission to Allah's Messenger (may peace be upon him) in case he had heard It from him. While we were discussing it as we sat with 'Abdullah b. Ibrahlm b. Qariz; we made a mention of this hadith, and our omission (in getting its attestation) about its direct transmission by Abu Huraira from him (the Holy Proohet) ; thereupon Abdullah b. Ibrahim said to us: I bear witness to the fact that I heard Abu Huraira (Allah be pleased with him) say that Allah's Messenger (may peace be upon him) said: I am the last of the Apostles and my mosque is the last of the mosques.",
      "chain": [
        "30313",
        "30558",
        "30373",
        "20459",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "3731",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "وحدثنيه إسحاق بن منصور، أخبرنا يزيد بن عبد ربه، حدثنا محمد بن حرب، حدثني الزبيدي، عن الزهري، بهذا الإسناد غير أنه قال قال ابن عمر فراجعتها وحسبت لها التطليقة التي طلقتها ‏.‏",
      "text_en": "  A hadith like this was reported on the authority of Zuhri with the same chain of narrators. Ibn Umar (Allah be pleased with them), however, said:                      I took her back, and counted this pronouncement of divorce (as valid) with which I divorced her.",
      "chain": [
        "30572",
        "30373",
        "20459"
      ]
    },
    {
      "hadith_no": "5854",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثني أبو الربيع، سليمان بن داود حدثنا محمد بن حرب، حدثني محمد بن الوليد، الزبيدي عن الزهري، عن عروة بن الزبير، عن زينب بنت أم سلمة، عن أم سلمة، زوج النبي صلى الله عليه وسلم أن رسول الله صلى الله عليه وسلم قال لجارية في بيت أم سلمة زوج النبي صلى الله عليه وسلم رأى بوجهها سفعة فقال ‏\"‏ بها نظرة فاسترقوا لها ‏\"‏ ‏.‏ يعني بوجهها صفرة ‏.‏",
      "text_en": " Umm Salama, the wife of Allah's Apostle (may peace be upon him), reported that Allah's Messenger (may peace be upon him) said to a small girl in the house of Umm Salama that he had been seeing on her face black stains and told her that that was due to the infiluence of an evil eye, and he asked that she should be cured with the help of incantation (hoping) that her face should become spotles.",
      "chain": [
        "30137",
        "30373",
        "20459",
        "11013",
        "10511",
        "244"
      ]
    },
    {
      "hadith_no": "5962",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "وحدثنا حاجب بن الوليد، حدثنا محمد بن حرب، عن الزبيدي، عن الزهري، أخبرني  سالم بن عبد الله، عن ابن عمر، قال سمعت رسول الله صلى الله عليه وسلم يأمر بقتل الكلاب يقول ‏\"‏ اقتلوا الحيات والكلاب واقتلوا ذا الطفيتين والأبتر فإنهما يلتمسان البصر ويستسقطان الحبالى ‏\"‏ ‏.‏ قال الزهري ونرى ذلك من سميهما والله أعلم ‏.‏ قال سالم قال عبد الله بن عمر فلبثت لا أترك حية أراها إلا قتلتها فبينا أنا أطارد حية يوما من ذوات البيوت مر بي زيد بن الخطاب أو أبو لبابة وأنا أطاردها فقال مهلا يا عبد الله ‏.‏ فقلت إن رسول الله صلى الله عليه وسلم أمر بقتلهن ‏.‏ قال إن رسول الله صلى الله عليه وسلم قد نهى عن ذوات البيوت ‏.‏  وحدثنيه حرملة بن يحيى، أخبرنا ابن وهب، أخبرني يونس، ح وحدثنا عبد بن، حميد أخبرنا عبد الرزاق، أخبرنا معمر، ح وحدثنا حسن الحلواني، حدثنا يعقوب، حدثنا  أبي، عن صالح، كلهم عن الزهري، بهذا الإسناد غير أن صالحا، قال حتى رآني أبو لبابة بن عبد المنذر وزيد بن الخطاب فقالا إنه قد نهى عن ذوات البيوت ‏.‏ وفي حديث يونس ‏\"‏ اقتلوا الحيات ‏\"‏ ‏.‏ ولم يقل ‏\"‏ ذا الطفيتين والأبتر ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Umar reported:                      I heard Allah's Messenger (may peace be upon him) commanding the killing of dogs and the killing of the striped and the short-tailed snakes, for both of them affect the eyesight adversely and cause miscarriage. Zuhri said: We thought of their poison (the pernicious effects of these two). Allah, however, knows best. 'Abdullah b. 'Umar said: I did not spare any snake. I rather killed everyone that I saw. One day as I was pursuing a snake from amongst the snakes of the house, Zaid b. Khattab or Abu Lubaba happened to pass by me and found me pursuing it. He said: 'Abdullah, wait. I said: Allah's Messenger (may peace be upon him) commanded (us) to kill them, whereupon he said that Allah's Messenger (may peace be upon him) forbade the killing of the snakes of the houses. This hadith has been narrated on the authority of Zuhri with the same chain of transmitters but with a slight variation of wording.",
      "chain": [
        "30373",
        "20459",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "6065",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Vision - كتاب الرؤيا",
      "chapter_no": "43",
      "text_ar": "حدثنا حاجب بن الوليد، حدثنا محمد بن حرب، عن الزبيدي، أخبرني الزهري، عن عبيد الله بن عبد الله، أن ابن عباس، أو أبا هريرة كان يحدث أن رجلا، أتى رسول الله صلى الله عليه وسلم ح",
      "text_en": "",
      "chain": [
        "30373",
        "20459",
        "11013",
        "11004"
      ]
    },
    {
      "hadith_no": "6691",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا حاجب بن الوليد، حدثنا محمد بن حرب، حدثنا محمد بن الوليد الزبيدي، عن الزهري، أخبرني أنس بن مالك، أن رسول الله صلى الله عليه وسلم قال ح",
      "text_en": " Anas b. Malik reported Allah's Messenger (may peace be upon him) as saying like this. This hadith has been narrated through another chain of transmitters.",
      "chain": [
        "30373",
        "20459",
        "11013",
        "19"
      ]
    },
    {
      "hadith_no": "6698",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا قتيبة بن سعيد، وأبو بكر بن أبي شيبة وزهير بن حرب قالوا حدثنا  سفيان، ح وحدثني حرملة بن يحيى، أخبرنا ابن وهب، أخبرني يونس، ح وحدثنا حاجب، بن الوليد حدثنا محمد بن حرب، عن الزبيدي، ح وحدثنا إسحاق بن إبراهيم الحنظلي، ومحمد، بن رافع وعبد بن حميد عن عبد الرزاق، عن معمر، كلهم عن الزهري، بإسناد مالك ومثل حديثه إلا قوله ‏\"‏ فيعرض هذا ويعرض هذا ‏\"‏ ‏.‏ فإنهم جميعا قالوا في حديثهم غير مالك ‏\"‏ فيصد هذا ويصد هذا ‏\"‏ ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Zuhri with a slight variation of wording (and the words are):                     \" The one turning away and the other turning away when they meet and one avoids the other and the other also avoids him.\"",
      "chain": [
        "30367",
        "20005",
        "30487",
        "20029",
        "20475",
        "30373",
        "20459",
        "30021",
        "30375",
        "20121"
      ]
    },
    {
      "hadith_no": "6810",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا حاجب بن الوليد، حدثنا محمد بن حرب، عن الزبيدي، عن الزهري، أخبرني  حميد بن عبد الرحمن، أن أبا هريرة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ليس الشديد بالصرعة ‏\"‏ ‏.‏ قالوا فالشديد أيم هو يا رسول الله قال ‏\"‏ الذي يملك نفسه عند الغضب ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      I heard Allah's Messenger (may peace be upon him) as saying: One is not strong because of one's wrestling skillfully. They said: Allah's Messenger, then who is strong? He said: He who controls his anger when he is in a fit of rage.",
      "chain": [
        "30373",
        "20459",
        "11013",
        "10561",
        "13"
      ]
    },
    {
      "hadith_no": "6926",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Destiny - كتاب القدر",
      "chapter_no": "47",
      "text_ar": "حدثنا حاجب بن الوليد، حدثنا محمد بن حرب، عن الزبيدي، عن الزهري، أخبرني  سعيد بن المسيب، عن أبي هريرة، أنه كان يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ ما من مولود إلا يولد على الفطرة فأبواه يهودانه وينصرانه ويمجسانه كما تنتج البهيمة بهيمة جمعاء هل تحسون فيها من جدعاء ‏\"‏ ‏.‏ ثم يقول أبو هريرة واقرءوا إن شئتم ‏{‏ فطرة الله التي فطر الناس عليها لا تبديل لخلق الله‏}‏ الآية ‏.‏",
      "text_en": " There is none born but is created to his true nature (Islam). It is his parents who make him a Jew or a Christian or a Magian quite as beasts produce their young with their limbs perfect. Do you see anything deficient in them? Then he quoted the Qur'an., The nature made by Allah in which He has created men there is no altering of Allah's creation; that is the right religion\" (xxx. 33)",
      "chain": [
        "30373",
        "20459",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "7159",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Repentance and Exhortation to Repentance - كتاب التوبة",
      "chapter_no": "51",
      "text_ar": "حدثني أبو الربيع، سليمان بن داود حدثنا محمد بن حرب، حدثني الزبيدي، قال الزهري حدثني حميد بن عبد الرحمن بن عوف، عن أبي هريرة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ أسرف عبد على نفسه ‏\"‏ ‏.‏ بنحو حديث معمر إلى قوله ‏\"‏ فغفر الله له ‏\"‏ ‏.‏ ولم يذكر حديث المرأة في قصة الهرة وفي حديث الزبيدي قال ‏\"‏ فقال الله عز وجل لكل شىء أخذ منه شيئا أد ما أخذت منه ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying that a servant transgressed the litnit in committing sins. The rest of the hadith is the same but there is no mention of the story of the cat in it and in the hadith transmitted on the authority of Ziibaidl (the words are):                     \" Allah, the Exalted and Glorious, said to everything which had taken a part of lies ashes to return what it had taken.\"",
      "chain": [
        "30137",
        "30373",
        "20459",
        "11013",
        "10561",
        "13"
      ]
    },
    {
      "hadith_no": "235",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عمرو بن عثمان، حدثنا محمد بن حرب، حدثنا الزبيدي، ح وحدثنا عياش بن الأزرق، أخبرنا ابن وهب، عن يونس، ح وحدثنا مخلد بن خالد، حدثنا إبراهيم بن خالد، - إمام مسجد صنعاء - حدثنا رباح، عن معمر، ح وحدثنا مؤمل بن الفضل، حدثنا الوليد، عن الأوزاعي، كلهم عن الزهري، عن أبي سلمة، عن أبي هريرة، قال أقيمت الصلاة وصف الناس صفوفهم فخرج رسول الله صلى الله عليه وسلم حتى إذا قام في مقامه ذكر أنه لم يغتسل فقال للناس ‏\"‏ مكانكم ‏\"‏ ‏.‏ ثم رجع إلى بيته فخرج علينا ينطف رأسه وقد اغتسل ونحن صفوف ‏.‏ وهذا لفظ ابن حرب وقال عياش في حديثه فلم نزل قياما ننتظره حتى خرج علينا وقد اغتسل ‏.‏",
      "text_en": " Abu Hurairah reported:                      The prayer (in congregation) began and people stood in their rows. The Messenger of Allah (May peace be upon him) came out (from his residence). When he stood at his proper place he recalled that he did not take a bath. He then said to the people: (Remain standing) at your places. Then he returned to his house and came out upon us after taking a bath while the drops of water were coming down from his head. We were standing in the rows (of prayer). This is the version of Ibn Harb. ‘Ayyash reported in his version: we kept on waiting for him while we were standing until he came upon us after he had taken a bath.",
      "chain": [
        "10581",
        "30373",
        "20459",
        "20029",
        "20475",
        "30567",
        "38072",
        "20115",
        "38659",
        "20733",
        "20024",
        "11013",
        "10567"
      ]
    },
    {
      "hadith_no": "425",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن حرب الواسطي، حدثنا يزيد، - يعني ابن هارون - حدثنا محمد بن مطرف، عن زيد بن أسلم، عن عطاء بن يسار، عن عبد الله بن الصنابحي، قال زعم أبو محمد أن الوتر، واجب، فقال عبادة بن الصامت كذب أبو محمد أشهد أني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ خمس صلوات افترضهن الله تعالى من أحسن وضوءهن وصلاهن لوقتهن وأتم ركوعهن وخشوعهن كان له على الله عهد أن يغفر له ومن لم يفعل فليس له على الله عهد إن شاء غفر له وإن شاء عذبه ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Sunabihi:                     AbuMuhammad fancies that witr prayer is essential. (Hearing this) Ubadah ibn as-Samit said: AbuMuhammad was wrong. I bear witness that I heard the Messenger of Allah (ﷺ) say: Allah, the Exalted, has made five prayers obligatory. If anyone performs ablution for them well, offers them at their (right) time, and observes perfectly their bowing and submissiveness in them, it is the guarantee of Allah that He will pardon him; if anyone does not do so, there is no guarantee for him on the part of Allah; He may pardon him if He wills, and punish him if He wills.",
      "chain": [
        "30373",
        "20472",
        "20179",
        "11163",
        "11020"
      ]
    },
    {
      "hadith_no": "2525",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا إبراهيم بن موسى الرازي، أخبرنا ح، وحدثنا عمرو بن عثمان، حدثنا محمد بن حرب، - المعنى وأنا لحديثه، أتقن - عن أبي سلمة، ‏:‏ سليمان بن سليم عن يحيى بن جابر الطائي، عن ابن أخي أبي أيوب الأنصاري، عن أبي أيوب، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏:‏ ‏\"‏ ستفتح عليكم الأمصار، وستكون جنود مجندة تقطع عليكم فيها بعوث فيكره الرجل منكم البعث فيها فيتخلص من قومه ثم يتصفح القبائل يعرض نفسه عليهم يقول ‏:‏ من أكفيه بعث كذا، من أكفيه بعث كذا ألا وذلك الأجير إلى آخر قطرة من دمه ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuAyyub al-Ansari:                     AbuAyyub heard the Messenger of Allah (ﷺ) say: Capitals will be conquered at your hands, and you will have to raise companies in large armies. A man will be unwilling to join a company, so he will escape from his people and go round the tribes offering himself to them, saying: Whose place may I take in such and such expedition? Whose place may I take in such and such expedition? Beware: That man is a hireling to the last drop of his blood.",
      "chain": [
        "30309",
        "10581",
        "30373",
        "10978",
        "33"
      ]
    },
    {
      "hadith_no": "2856",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Game (Kitab Al-Said) - كتاب الصيد",
      "chapter_no": "17",
      "text_ar": "حدثنا محمد بن المصفى، حدثنا محمد بن حرب، ح وحدثنا محمد بن المصفى، حدثنا بقية، عن الزبيدي، حدثنا يونس بن سيف، حدثنا أبو إدريس الخولاني، حدثني أبو ثعلبة الخشني، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ يا أبا ثعلبة كل ما ردت عليك قوسك وكلبك ‏\"‏ ‏.‏ زاد عن ابن حرب ‏\"‏ المعلم ويدك فكل ذكيا وغير ذكي ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuTha'labah al-Khushani:                     The Messenger of Allah (ﷺ) said to me: AbuTha'labah, eat what returns to you by your bow and your dog.  Ibn Harb's version adds: \"The trained (dog), and your hand, then eat, whether it has been slaughtered or not slaughtered\".",
      "chain": [
        "30373",
        "20644",
        "20459",
        "19199",
        "11027"
      ]
    },
    {
      "hadith_no": "2906",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Shares of Inheritance (Kitab Al-Fara'id) - كتاب الفرائض",
      "chapter_no": "19",
      "text_ar": "حدثنا إبراهيم بن موسى الرازي، حدثنا محمد بن حرب، حدثني عمر بن رؤبة التغلبي، عن عبد الواحد بن عبد الله النصري، عن واثلة بن الأسقع، عن النبي صلى الله عليه وسلم قال ‏\"‏ المرأة تحرز ثلاثة مواريث عتيقها ولقيطها وولدها الذي لاعنت عنه ‏\"‏ ‏.‏",
      "text_en": " Narrated Wathilah ibn al-Asqa':                     The Prophet (ﷺ) said: A woman gets inheritance from the three following: one she has set free, a foundling, and her child about whom she has invoked a curse on herself if she was untrue in declaring he was not born out of wedlock.",
      "chain": [
        "30309",
        "30373",
        "11672",
        "4049"
      ]
    },
    {
      "hadith_no": "2933",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا عمرو بن عثمان، حدثنا محمد بن حرب، عن أبي سلمة، سليمان بن سليم عن يحيى بن جابر، عن صالح بن يحيى بن المقدام، عن جده المقدام بن معديكرب، أن رسول الله صلى الله عليه وسلم ضرب على منكبه ثم قال له ‏\"‏ أفلحت يا قديم إن مت ولم تكن أميرا ولا كاتبا ولا عريفا ‏\"‏ ‏.‏",
      "text_en": " Narrated Al-Miqdam ibn Ma'dikarib:                     The Messenger of Allah (ﷺ) struck him on his shoulders and then said: You will attain success, Qudaym, if you die without having been a ruler, a secretary, or a chief.",
      "chain": [
        "10581",
        "30373",
        "10978",
        "17038"
      ]
    },
    {
      "hadith_no": "3804",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا محمد بن المصفى الحمصي، حدثنا محمد بن حرب، عن الزبيدي، عن مروان بن رؤبة التغلبي، عن عبد الرحمن بن أبي عوف، عن المقدام بن معديكرب، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ ألا لا يحل ذو ناب من السباع ولا الحمار الأهلي ولا اللقطة من مال معاهد إلا أن يستغني عنها وأيما رجل ضاف قوما فلم يقروه فإن له أن يعقبهم بمثل قراه ‏\"‏ ‏.‏",
      "text_en": " Narrated Al-Miqdam ibn Ma'dikarib:                     The Prophet (ﷺ) said: Beware, the fanged beast of prey is not lawful, nor the domestic asses, nor the find from the property of a man with whom treaty has been concluded, except that he did not need it. If anyone is a guest of people who provide no hospitality for him, he is entitled to take from them the equivalent of the hospitality due to him.",
      "chain": [
        "30373",
        "20459",
        "18639"
      ]
    },
    {
      "hadith_no": "3806",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا عمرو بن عثمان، حدثنا محمد بن حرب، حدثني أبو سلمة، سليمان بن سليم عن صالح بن يحيى بن المقدام، عن جده المقدام بن معديكرب، عن خالد بن الوليد، قال غزوت مع رسول الله صلى الله عليه وسلم خيبر فأتت اليهود فشكوا أن الناس قد أسرعوا إلى حظائرهم فقال رسول الله صلى الله عليه وسلم ‏\"‏ ألا لا تحل أموال المعاهدين إلا بحقها وحرام عليكم حمر الأهلية وخيلها وبغالها وكل ذي ناب من السباع وكل ذي مخلب من الطير ‏\"‏ ‏.‏",
      "text_en": " Narrated Khalid ibn al-Walid:                     I went with the Messenger of Allah (ﷺ) to fight at the battle of Khaybar, and the Jews came and complained that the people had hastened to take their protected property (as a booty), so the Messenger of Allah (ﷺ) said: The property of those who have been given a mules, every fanged beast of prey, and every bird with a talon are forbidden for you.",
      "chain": [
        "10581",
        "30373",
        "17038",
        "22"
      ]
    },
    {
      "hadith_no": "4636",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا عمرو بن عثمان، حدثنا محمد بن حرب، عن الزبيدي، عن ابن شهاب، عن عمرو بن أبان بن عثمان، عن جابر بن عبد الله، أنه كان يحدث أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أري الليلة رجل صالح أن أبا بكر نيط برسول الله صلى الله عليه وسلم ونيط عمر بأبي بكر ونيط عثمان بعمر ‏\"‏ ‏.‏ قال جابر فلما قمنا من عند رسول الله صلى الله عليه وسلم قلنا أما الرجل الصالح فرسول الله صلى الله عليه وسلم وأما تنوط بعضهم ببعض فهم ولاة هذا الأمر الذي بعث الله به نبيه صلى الله عليه وسلم ‏.‏ قال أبو داود ورواه يونس وشعيب لم يذكرا عمرا ‏.‏",
      "text_en": " Jabir b. ‘Abd Allah reported the Messenger of Allah (ﷺ) as saying:                      Last night a good man had a vision in which Abu Bakr seemed to be joined to the Messenger of Allah (ﷺ). ‘Umar to Abu Bakr, and ‘Uthman to ‘Umar. Jabir said: When we got up and left the Messenger of Allah (ﷺ), we said: The good man is the Messenger of Allah (ﷺ), and that their being joined together means that they are the rulers over this matter with which Allah has sent His Prophet (ﷺ).Abu Dawud said: It has been transmitted by Yunus and Shu’aib, but they did not mention ‘Amr b. Aban.",
      "chain": [
        "10581",
        "30373",
        "20459",
        "11013",
        "34"
      ]
    },
    {
      "hadith_no": "4712",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا عبد الوهاب بن نجدة، حدثنا بقية، ح وحدثنا موسى بن مروان الرقي، وكثير بن عبيد المذحجي، قالا حدثنا محمد بن حرب، - المعنى - عن محمد بن زياد، عن عبد الله بن أبي قيس، عن عائشة، قالت قلت يا رسول الله ذراري المؤمنين فقال ‏\"‏ هم من آبائهم ‏\"‏ ‏.‏ فقلت يا رسول الله بلا عمل قال ‏\"‏ الله أعلم بما كانوا عاملين ‏\"‏ ‏.‏ قلت يا رسول الله فذراري المشركين قال ‏\"‏ من آبائهم ‏\"‏ ‏.‏ قلت بلا عمل قال ‏\"‏ الله أعلم بما كانوا عاملين ‏\"‏ ‏.‏",
      "text_en": " ‘A’ishah said :                      I said : Messenger of Allah (May peace be upon him) what happens to the offspring of believers ? He replied : They are joined to their parents. I asked : Messenger of Allah! Although they have done nothing ? He replied : Allah knows best what they were doing. I asked : what happens to the offspring of polytheists, Messenger of Allah ? he replied! They are joined to their parents. I asked : Although they have done nothing? He replied : Allah knows best what they were doing.",
      "chain": [
        "38363",
        "20644",
        "35154",
        "38462",
        "30373",
        "11216",
        "11515",
        "53"
      ]
    },
    {
      "hadith_no": "2261",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Inheritance - كتاب الفرائض عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "29",
      "text_ar": "حدثنا هارون أبو موسى المستملي البغدادي، حدثنا محمد بن حرب، حدثنا عمر بن رؤبة التغلبي، عن عبد الواحد بن عبد الله أبي بسر النصري، عن واثلة بن الأسقع، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ المرأة تحوز ثلاثة مواريث عتيقها ولقيطها وولدها الذي لاعنت عليه ‏\"‏ ‏.‏ هذا حديث حسن غريب لا يعرف إلا من هذا الوجه من حديث محمد بن حرب ‏.‏",
      "text_en": " Wathilah bin Al-Asqa' narrated  that the Messenger of Allah(S.A.W) said:                     \"The woman collects three inheritance: Whomever she freed, whomever she found, and the child for which she made Li'an.\"",
      "chain": [
        "30373",
        "4049"
      ]
    },
    {
      "hadith_no": "173",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا هشام بن عبد الملك، قال حدثنا محمد، - يعني ابن حرب - قال حدثني الزبيدي، عن الزهري، أن عمر بن عبد العزيز، أخبره أن عبد الله بن قارظ أخبره أن أبا هريرة قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ توضئوا مما مست النار ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah said:                      \"I heard the Messenger of Allah (ﷺ) say: 'Perform Wudu' from that which has been touched by fire.'\"",
      "chain": [
        "30373",
        "20459",
        "11013",
        "11010",
        "13"
      ]
    },
    {
      "hadith_no": "197",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا كثير بن عبيد، عن محمد بن حرب، عن الزبيدي، عن الزهري، عن عروة، أن عائشة، أخبرته أن أم سليم كلمت رسول الله صلى الله عليه وسلم وعائشة جالسة فقالت له يا رسول الله إن الله لا يستحيي من الحق أرأيت المرأة ترى في النوم ما يرى الرجل أفتغتسل من ذلك فقال لها رسول الله صلى الله عليه وسلم ‏\"‏ نعم ‏\"‏ ‏.‏ قالت عائشة فقلت لها أف لك أوترى المرأة ذلك فالتفت إلى رسول الله صلى الله عليه وسلم فقال ‏\"‏ تربت يمينك فمن أين يكون الشبه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Urwah that 'Aishah told him that Umm Sulaim spoke to the Messenger of Allah (ﷺ) when 'Aishah was sitting there. She said to him:                      \"O Messenger of Allah! Allah is not shy to tell the truth. Inform me: if a women sees in a dream what men see should she perform Ghusl from that?\" The Messenger of Allah (ﷺ) said to her: \"Yes.\" 'Aishah said: \"I expressed my displeasure and said: 'Does a woman see that?' The Messenger of Allah (ﷺ) turned to me and said: 'May your right hand be covered with dust! How else would (her child) resemble her?'\"",
      "chain": [
        "38462",
        "30373",
        "20459",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "486",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Salah - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "أخبرنا كثير بن عبيد، قال حدثنا محمد بن حرب، عن الزبيدي، عن الزهري، عن سعيد بن المسيب، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ تفضل صلاة الجمع على صلاة أحدكم وحده بخمسة وعشرين جزءا ويجتمع ملائكة الليل والنهار في صلاة الفجر واقرءوا إن شئتم ‏{‏ وقرآن الفجر إن قرآن الفجر كان مشهودا ‏}‏ ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:                      \"Prayer in congregation is twenty-five times more virtuous than the prayer of any one of you offered on his own. The angels of the night and the day meet at Fajr prayer. Recite if you wish: Verily, the recitation of the Qur'an in the early dawn is ever witnessed.\"[1][1]Al-Isra' 17:78.",
      "chain": [
        "38462",
        "30373",
        "20459",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "500",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا كثير بن عبيد، قال حدثنا محمد بن حرب، عن الزبيدي، عن الزهري، قال أخبرني أنس، أن رسول الله صلى الله عليه وسلم خرج حين زاغت الشمس فصلى بهم صلاة الظهر ‏.‏",
      "text_en": " It was narrated from Az-Zuhri he said:                      \"Anas told me that the Messenger of Allah (ﷺ) went out when the sun had passed its zenith, and led them in Zuhr prayer.\"",
      "chain": [
        "38462",
        "30373",
        "20459",
        "11013",
        "19"
      ]
    },
    {
      "hadith_no": "694",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Masjids - كتاب المساجد",
      "chapter_no": "8",
      "text_ar": "أخبرنا كثير بن عبيد، قال حدثنا محمد بن حرب، عن الزبيدي، عن الزهري، عن أبي سلمة بن عبد الرحمن، وأبي عبد الله الأغر، مولى الجهنيين وكانا من أصحاب أبي هريرة أنهما سمعا أبا هريرة يقول صلاة في مسجد رسول الله صلى الله عليه وسلم أفضل من ألف صلاة فيما سواه من المساجد إلا المسجد الحرام فإن رسول الله صلى الله عليه وسلم آخر الأنبياء ومسجده آخر المساجد ‏.‏ قال أبو سلمة وأبو عبد الله لم نشك أن أبا هريرة كان يقول عن حديث رسول الله صلى الله عليه وسلم فمنعنا أن نستثبت أبا هريرة في ذلك الحديث حتى إذا توفي أبو هريرة ذكرنا ذلك وتلاومنا أن لا نكون كلمنا أبا هريرة في ذلك حتى يسنده إلى رسول الله صلى الله عليه وسلم إن كان سمعه منه فبينا نحن على ذلك جالسنا عبد الله بن إبراهيم بن قارظ فذكرنا ذلك الحديث والذي فرطنا فيه من نص أبي هريرة فقال لنا عبد الله بن إبراهيم أشهد أني سمعت أبا هريرة يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ فإني آخر الأنبياء وإنه آخر المساجد ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Salamah bin 'Abdur-Rahman and Abu 'Abdullah Al-Agharr, the freed slave of the Juhanis - better of whom were companions of Abu Hurairah - that they heard Abu Hurairah say:                      \"One prayer in the Masjid of the  Messenger of Allah (ﷺ) is better than one thousand prayers offered in other mosques, except Al-Masjid Al-Haram, for the Messenger of Allah (ﷺ) was the last of the prophets and his Masjid was the last of the Masjids.\" Abu Salamah and Abu 'Abdullah said: \"We do not doubt that Abu Hurairah was speaking on the basis of the Hadith of the Messenger of Allah (ﷺ), but we could not verify that Hadith with Abu Hurairah before he died. Then we remembered that and we blamed one another for not having spoken to Abu Hurairah about that, so that he could attribute it to the Messenger of Allah (ﷺ) if he had indeed heard it from him. While we were arguing, we went and sat down with 'Abdullah bin Ibrahim bin Qariz, and we told him about the Hadith and how we had been negligent in not checking it with Abu Hurairah. 'Abdullah bin Ibrahim said to us: 'I bear witness that I heard Abu Hurairah say: The Messenger of Allah (ﷺ) said: I am the last of the prophets and it is the last of the Masjids.'\"",
      "chain": [
        "38462",
        "30373",
        "20459",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "792",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا عمرو بن عثمان بن سعيد بن كثير، قال حدثنا محمد بن حرب، عن الزبيدي، عن الزهري، والوليد، عن الأوزاعي، عن الزهري، عن أبي سلمة، عن أبي هريرة، قال أقيمت الصلاة فصف الناس صفوفهم وخرج رسول الله صلى الله عليه وسلم حتى إذا قام في مصلاه ذكر أنه لم يغتسل فقال للناس ‏\"‏ مكانكم ‏\"‏ ‏.‏ ثم رجع إلى بيته فخرج علينا ينطف رأسه فاغتسل ونحن صفوف ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                      \"The Iqamah for prayer was said and the people stood in rows, and the Messenger of Allah (ﷺ) came out. Then when he stood in the place where he prayed, he remembered that he had not performed Ghusl. He said to the people: 'Stay where you are.' Then he went back to his house, then he came out with his head dripping with water. He performed Ghusl while we were standing in our rows.\"",
      "chain": [
        "38429",
        "30373",
        "20459",
        "11013",
        "20733",
        "20024",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1216",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا كثير بن عبيد، قال حدثنا محمد بن حرب، عن الزبيدي، عن الزهري، عن أبي سلمة، أن أبا هريرة، قال قام رسول الله صلى الله عليه وسلم إلى الصلاة وقمنا معه فقال أعرابي وهو في الصلاة اللهم ارحمني ومحمدا ولا ترحم معنا أحدا ‏.‏ فلما سلم رسول الله صلى الله عليه وسلم قال للأعرابي ‏\"‏ لقد تحجرت واسعا ‏\"‏ ‏.‏ يريد رحمة الله عز وجل ‏.‏",
      "text_en": " It was narrated from Abu Salamah that :                     Abu Hurairah said: \"The Messenger of Allah (ﷺ) stood up to pray and we stood up with him. A Bedouin said- while he was praying- 'O Allah, have mercy on me and Muhammad and do not have mercy on anyone else.' When the Messenger of Allah (ﷺ) said the Salam, he said to the Bedouin: 'You have limited something vast,\" meaning the mercy of Allah (SWT).\"",
      "chain": [
        "38462",
        "30373",
        "20459",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1668",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا عمرو بن عثمان، ومحمد بن صدقة، قالا حدثنا محمد بن حرب، عن الزبيدي، عن الزهري، عن سالم، عن أبيه، عن النبي صلى الله عليه وسلم قال ‏\"‏ صلاة الليل مثنى مثنى فإذا خفت الصبح فأوتر بواحدة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Salim, from his father, that :                     The Prophet (ﷺ) said: \"Prayers at night are two by two, then if you fear that dawn will come, pray witr with one rak'ah.\"",
      "chain": [
        "10581",
        "30373",
        "20459",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "2079",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا كثير بن عبيد، قال حدثنا محمد بن حرب، عن الزبيدي، عن الزهري، عن حميد بن عبد الرحمن، عن أبي هريرة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ أسرف عبد على نفسه حتى حضرته الوفاة قال لأهله إذا أنا مت فأحرقوني ثم اسحقوني ثم اذروني في الريح في البحر فوالله لئن قدر الله على ليعذبني عذابا لا يعذبه أحدا من خلقه قال ففعل أهله ذلك قال الله عز وجل لكل شىء أخذ منه شيئا أد ما أخذت فإذا هو قائم قال الله عز وجل ما حملك على ما صنعت قال خشيتك ‏.‏ فغفر الله له ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"I heard the Messenger of Allah say: 'There was a man who wronged himself greatly, and when he was dying he said to his family: When I am dead, burn my body then grind my bones and scatter me in the wind and at sea, for by Allah , if Allah gets hold of me, he will punish me in a way that He will not punish anyone else. So his family did that, but Allah, the Mighty and Sublime, said to everything that had taken any part of him to give up what it had taken. Then there he was, standing Allah, the Mighty and Sublime, said: What made you do what you did? He said: Fear of You. So Allah forgave him.\"'",
      "chain": [
        "38462",
        "30373",
        "20459",
        "11013",
        "10561",
        "13"
      ]
    },
    {
      "hadith_no": "2270",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا موسى بن مروان، قال حدثنا محمد بن حرب، عن الأوزاعي، قال أخبرني يحيى، قال حدثني أبو قلابة، قال حدثني أبو المهاجر، قال حدثني أبو أمية يعني الضمري، أنه قدم على النبي صلى الله عليه وسلم فذكر نحوه ‏.‏",
      "text_en": " Abu Umayyah Ad-Damri narrated:                     That he came to Prophet, and he mentioned something similar.",
      "chain": [
        "38022",
        "35154",
        "30373",
        "20024",
        "11449",
        "11047"
      ]
    },
    {
      "hadith_no": "2606",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا كثير بن عبيد، قال حدثنا محمد بن حرب، عن الزبيدي، عن الزهري، عن السائب بن يزيد، أن حويطب بن عبد العزى، أخبره أن عبد الله بن السعدي أخبره أنه، قدم على عمر بن الخطاب في خلافته فقال له عمر ألم أحدث أنك تلي من أعمال الناس أعمالا فإذا أعطيت العمالة رددتها فقلت بلى ‏.‏ فقال عمر رضى الله عنه فما تريد إلى ذلك فقلت لي أفراس وأعبد وأنا بخير وأريد أن يكون عملي صدقة على المسلمين ‏.‏ فقال له عمر فلا تفعل فإني كنت أردت مثل الذي أردت كان رسول الله صلى الله عليه وسلم يعطيني العطاء فأقول أعطه أفقر إليه مني ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ خذه فتموله أو تصدق به ما جاءك من هذا المال وأنت غير مشرف ولا سائل فخذه وما لا فلا تتبعه نفسك ‏\"‏ ‏.‏",
      "text_en": " Abdullah bin As-Sa'di narrated that he came to 'Umar bin Al-Khattab during his Caliphate and 'Umar said to him:                     \"I heard that you do some jobs for the people but when payment is given to you, you refuse it.\" I said: \"(that is so).\" 'Umar, may Allah be pleased with him, said: \"Why do you do that? I said: \"I have horses and slaves and am well off, and I wanted my work to be an act of charity toward the Muslims.\" 'Umar said to him: \"Do not do that. I used to want the same thing as you. The Messenger of Allah used to give me payment and I would say, 'Give it to someone who is more in need of it that I am.' But the Messenger of Allah said: \"Take it and keep it or give it in charity. Whatever comes to you of this wealth when you are not hoping for it and not asking for it, take it, and whatever does not, then do not wish for it. \"'",
      "chain": [
        "38462",
        "30373",
        "20459",
        "11013",
        "3048",
        "2600",
        "2605"
      ]
    },
    {
      "hadith_no": "3089",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا كثير بن عبيد، قال حدثنا محمد بن حرب، عن الزبيدي، عن الزهري، عن سعيد بن المسيب، وأبي، سلمة بن عبد الرحمن أن أبا هريرة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ بعثت بجوامع الكلم ونصرت بالرعب وبينا أنا نائم أتيت بمفاتيح خزائن الأرض فوضعت في يدي ‏\"‏ ‏.‏ فقال أبو هريرة فقد ذهب رسول الله صلى الله عليه وسلم وأنتم تنتثلونها ‏.‏",
      "text_en": " Narrated It was narrated from Sa’eed bin Al-Musayyab and Salamah bin Abdur-Rahman that Abu Hurairah said:                      :“I heard the Messenger of Allah said: ‘I have been sent with concise speech,  and I have been supported with fear. While I was sleeping, the keys to the treasures of the Earth were brought to me and placed in my hands.’ Abu Hurairah said: The Messenger of Allah has gone and you are acquiring them.”",
      "chain": [
        "38462",
        "30373",
        "20459",
        "11013",
        "11002",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "3091",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا كثير بن عبيد، عن محمد بن حرب، عن الزبيدي، عن الزهري، عن عبيد الله بن عبد الله، عن أبي هريرة، قال لما توفي رسول الله صلى الله عليه وسلم واستخلف أبو بكر وكفر من كفر من العرب قال عمر يا أبا بكر كيف تقاتل الناس وقد قال رسول الله صلى الله عليه وسلم ‏\"‏ أمرت أن أقاتل الناس حتى يقولوا لا إله إلا الله فمن قال لا إله إلا الله عصم مني نفسه وماله إلا بحقه وحسابه على الله ‏\"‏ ‏.‏ قال أبو بكر رضى الله عنه والله لأقاتلن من فرق بين الصلاة والزكاة فإن الزكاة حق المال والله لو منعوني عناقا كانوا يؤدونها إلى رسول الله صلى الله عليه وسلم لقاتلتهم على منعها فوالله ما هو إلا أن رأيت الله عز وجل قد شرح صدر أبي بكر للقتال وعرفت أنه الحق ‏.‏",
      "text_en": " Narrated It was narrated that Abu Hurairah said:                     :“When the Messenger of Allah died and Abu Bakr was appointed as Khalifah, and some of the Arab’s disbelieved, Umar said: ‘O Abu Bakr! How can you fight the people when the Messenger of Allah said: I have been commanded to fight the people until they say La ilaha illallah (there is none worthy of worship except Allah). Whoever says La ilaha illallah, his life and his property are safe from me, except for its right, and his reckoning will be with Allah?’ Abu Bakr, may Allah be pleased with him, said: ‘By Allah, I will surely fight those who separate prayer and Zakah, for Zakah is what is due on wealth. By Allah, if they withhold from me a small she-goat that they used to give to the Messenger of Allah I will fight them for withholding it.’ (Umar said) ‘By Allah, when I realized that Allah, the Mighty and Sublime, had opened the chest of Abu Bakr to fighting, then I knew that it was the truth.’”",
      "chain": [
        "38462",
        "30373",
        "20459",
        "11013",
        "11004",
        "13"
      ]
    },
    {
      "hadith_no": "3222",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا كثير بن عبيد، قال حدثنا محمد بن حرب، عن الزبيدي، عن الزهري، عن عبيد الله بن عبد الله بن عتبة، أن عبد الله بن عمرو بن عثمان، طلق وهو غلام شاب في إمارة مروان ابنة سعيد بن زيد وأمها بنت قيس البتة فأرسلت إليها خالتها فاطمة بنت قيس تأمرها بالانتقال من بيت عبد الله بن عمرو وسمع بذلك مروان فأرسل إلى ابنة سعيد فأمرها أن ترجع إلى مسكنها وسألها ما حملها على الانتقال من قبل أن تعتد في مسكنها حتى تنقضي عدتها فأرسلت إليه تخبره أن خالتها أمرتها بذلك فزعمت فاطمة بنت قيس أنها كانت تحت أبي عمرو بن حفص فلما أمر رسول الله صلى الله عليه وسلم علي بن أبي طالب على اليمن خرج معه وأرسل إليها بتطليقة هي بقية طلاقها وأمر لها الحارث بن هشام وعياش بن أبي ربيعة بنفقتها فأرسلت - زعمت - إلى الحارث وعياش تسألهما الذي أمر لها به زوجها فقالا والله ما لها عندنا نفقة إلا أن تكون حاملا وما لها أن تكون في مسكننا إلا بإذننا فزعمت أنها أتت رسول الله صلى الله عليه وسلم فذكرت ذلك له فصدقهما ‏.‏ قالت فاطمة فأين أنتقل يا رسول الله قال ‏\"‏ انتقلي عند ابن أم مكتوم الأعمى الذي سماه الله عز وجل في كتابه ‏\"‏ ‏.‏ قالت فاطمة فاعتددت عنده وكان رجلا قد ذهب بصره فكنت أضع ثيابي عنده حتى أنكحها رسول الله صلى الله عليه وسلم أسامة بن زيد فأنكر ذلك عليها مروان وقال لم أسمع هذا الحديث من أحد قبلك وسآخذ بالقضية التي وجدنا الناس عليها ‏.‏ مختصر ‏.‏",
      "text_en": " Narrated 'Ubaidullah bin 'Abdullah bin 'Utbah:                     It was narrated from 'Ubaidullah bin 'Abdullah bin 'Utbah that during the reign of Marwan, 'Abdullah bin 'Amr bin 'Uthman, who was a young man, issued a final divorce to the daughter of Sa'eed bin Zaid, whose mother was Bint Qais.  Her maternal aunt, Fatimah bint Qais, sent word to her telling her to move from the house of 'Abdullah bin 'Amr. Marwan heard of that and he sent word to the daughter of Sa'eed, telling her to go back to her home, and asking her why she had moved from her home before her 'Iddah was over? She sent word to him telling him that her maternal aunt had told her to do that. Fatimah bint Qais said that she had been married to Abu 'Amr bin Hafs, and when the Messenger of Allah appointed 'Ali bin Abi Talib as governor of Yemen, he went out with him and sent word to her that she was divorced with the third Talaq.  He told Al-Harith bin Hisham and 'Ayyash bin Abi Rai'ah to spend on her.  She sent word to Al-Harith and 'Ayyash asking them what her husband had told them to spend on her, and they said: 'By Allah, she has no right to any maintenance from us, unless she is pregnant, and she cannot come into our home without our permission.' She said that she came to the Messenger of Allah and told him about that, and he stated that they were correct. Fatimah said: 'Where should I move to, O Messenger of Allah?' He said: 'Move to the home of Ibn Umm Maktum, the blind man whom Allah, the Mighty and Sublime, named in His Book.' Fatimah said: 'So I observed my 'Iddah there.  He was a man who has lost his sight, so I used to take off my garments in his house, until the Messenger of Allah married me to Usamah bin Zaid.' Marwan criticized her for that and said: 'I have never heard this Hadith from anyone before you. I will continue to follow the ruling that the people have been following.'\"",
      "chain": [
        "38462",
        "30373",
        "20459",
        "11013",
        "11004"
      ]
    },
    {
      "hadith_no": "3391",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرني كثير بن عبيد، عن محمد بن حرب، قال حدثنا الزبيدي، قال سئل الزهري كيف الطلاق للعدة فقال أخبرني سالم بن عبد الله بن عمر أن عبد الله بن عمر قال طلقت امرأتي في حياة رسول الله صلى الله عليه وسلم وهي حائض ‏.‏ فذكر ذلك عمر لرسول الله صلى الله عليه وسلم فتغيظ رسول الله صلى الله عليه وسلم في ذلك فقال ‏\"‏ ليراجعها ثم يمسكها حتى تحيض حيضة وتطهر فإن بدا له أن يطلقها طاهرا قبل أن يمسها فذاك الطلاق للعدة كما أنزل الله عز وجل ‏\"‏ ‏.‏ قال عبد الله بن عمر فراجعتها وحسبت لها التطليقة التي طلقتها ‏.‏",
      "text_en": " Salim bin 'Abdullah bin 'Umar narrated that 'Abdullah bin 'Umar said:                      \"I divorced my wife during the lifetime of the Messenger of Allah while she was menstruating. 'Umar mentioned that to the Messenger of Allah, and the Messenger of Allah got angry about that and said: 'Let him take her back, then keep her until she has menstruated again and become pure again. Then if he wants to divorce her when she is pure and before he touches her (has intercourse with her), then that is divorce at the prescribed time as Allah, the Mighty and Sublime, has revealed.'\" 'Abdullah bin 'Umar said: \"So I took her back, but I still counted the divorce that I had issued to her.\"",
      "chain": [
        "38462",
        "30373",
        "20459",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "3520",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا كثير بن عبيد، قال حدثنا محمد بن حرب، عن الزبيدي، عن الزهري، عن عبيد الله بن عبد الله، أن عبد الله بن عتبة، كتب إلى عمر بن عبد الله بن الأرقم الزهري أن ادخل، على سبيعة بنت الحارث الأسلمية فاسألها عما أفتاها به رسول الله صلى الله عليه وسلم في حملها ‏.‏ قال فدخل عليها عمر بن عبد الله فسألها فأخبرته أنها كانت تحت سعد ابن خولة - وكان من أصحاب رسول الله صلى الله عليه وسلم ممن شهد بدرا - فتوفي عنها في حجة الوداع فولدت قبل أن تمضي لها أربعة أشهر وعشرا من وفاة زوجها فلما تعلت من نفاسها دخل عليها أبو السنابل - رجل من بني عبد الدار - فرآها متجملة فقال لعلك تريدين النكاح قبل أن تمر عليك أربعة أشهر وعشرا ‏.‏ قالت فلما سمعت ذلك من أبي السنابل جئت رسول الله صلى الله عليه وسلم فحدثته حديثي ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ قد حللت حين وضعت حملك ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Ubaidullah bin 'Abdullah that 'Abdullah bin 'Utbah wrote to 'Umar bin 'Abdullah bin Al-Arqam Az-Zuhri, telling him:                      \"Go to Subai'ah bint Al-Harith Al-Aslamiyyah, and ask her about the ruling of the Messenger of Allah concerning her pregnancy.\" He said: \"So 'Umar bin 'Abdullah went to her and asked her. She told him that she was married to Sa'd bin Khawlah, who was one of the Companions of the Messenger of Allah who had been present at Badr. He died during the Farewell Pilgrimage, and she gave birth before four months and ten days had passed since her husband's death. When her Nifas ended, Abu As-Sanabil -a man from Banu 'Abd Ad-Dar- went to her and saw that she had adorned herself. He said: 'Perhaps you want to get married before four months and ten days has passed?' She said: 'When I heard that from Abu As-Sanabil, I went to the Messenger of Allah and told him my story. The Messenger of Allah said: 'It is permissible for you to marry when you gave birth.''\"",
      "chain": [
        "38462",
        "30373",
        "20459",
        "11013",
        "11004"
      ]
    },
    {
      "hadith_no": "3768",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا عمرو بن عثمان بن سعيد، قال أنبأنا محمد، - وهو ابن حرب - عن الزبيدي، عن الزهري، عن سالم، عن أبيه، أنه أخبره عن عمر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن الله ينهاكم أن تحلفوا بآبائكم ‏\"‏ ‏.‏ قال عمر فوالله ما حلفت بها بعد ذاكرا ولا آثرا ‏.‏",
      "text_en": " It was narrated from Salim, from his father, that he told him from 'Umar:                      \"The Messenger of Allah said: 'Allah forbids you to swear by your forefathers.'\" 'Umar said: \"By Allah, I never swore by them again, whether saying it for myself or reporting it of others.\"",
      "chain": [
        "10581",
        "30373",
        "20459",
        "11013",
        "11011",
        "18",
        "3"
      ]
    },
    {
      "hadith_no": "3775",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا كثير بن عبيد، قال حدثنا محمد بن حرب، عن الزبيدي، عن الزهري، عن حميد بن عبد الرحمن، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من حلف منكم فقال باللات فليقل لا إله إلا الله ومن قال لصاحبه تعال أقامرك فليتصدق ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                      \"The Messenger of Allah said: 'Whoever among you swears and says: By Al-Lat, let him say: La ilaha illallah (There is none worthy of worship except Allah). And whoever says to his companion: Come, let us gamble, then let him give in charity.'\"",
      "chain": [
        "38462",
        "30373",
        "20459",
        "11013",
        "10561",
        "13"
      ]
    }
  ],
  "total_hadiths": 60
}