{
  "id": "30377",
  "name": "Muhammad bin 'Aabad bin Musa محمد بن عباد بن موسى",
  "full_name": "Muhammad bin 'Aabad bin Musa محمد بن عباد بن موسى",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Sadooq/Delusion",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq/Delusion] [ خ  -  صدوق يخطئ ]"
    ],
    "tags": []
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20248",
      "name": "'Abdul Salam bin Harb bin Salm al-Mala'i عبد السلام بن حرب بن سلم النهدي الملائي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20167",
      "name": "'Abdul 'Aziz bin Muhammad al-Daruradi عبد العزيز بن محمد الدراوردي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20102",
      "name": "'Abdullah bin Idris bin Yazid al-Audi عبد الله بن إدريس بن يزيد الأودي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20259",
      "name": "'Abdul Wahab bin 'Abdul Majeed al-Thaqaf عبد الوهاب بن عبد المجيد الثقفي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20468",
      "name": "Hashaym bin Bashayr bin al-Qasim هشيم بن بشير بن القاسم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "27363",
      "name": "Hisham bin Muhammad bin al-Sa'ib هشام بن محمد بن السائب أبو المنذر الكلبي",
      "grade": "Succ. (Taba' Tabi')"
    }
  ],
  "students": [
    {
      "id": "30013",
      "name": "Ibn Abi Dunya ابن أبي الدنيا",
      "grade": "3rd Century AH [12th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1984",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا أبو عاصم، عن ابن جريج، عن عبد الحميد بن جبير، عن محمد بن عباد، قال سألت جابرا  رضى الله عنه  نهى النبي صلى الله عليه وسلم عن صوم يوم الجمعة قال نعم‏.‏ زاد غير أبي عاصم أن ينفرد بصوم‏.‏",
      "text_en": " Narrated Muhammad bin `Abbas:                     I asked Jabir \"Did the Prophet forbid fasting on Fridays?\" He replied, \"Yes.\" (Other narrators added, \"If he intends to fast only that day.\")",
      "chain": [
        "20241",
        "11070",
        "11255",
        "30377",
        "34"
      ]
    },
    {
      "hadith_no": "4054",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني محمد بن عباد، أخبرنا ابن عيينة، قال أنفذه لنا ابن الأصبهاني سمعه من ابن معقل، أن عليا  رضى الله عنه  كبر على سهل بن حنيف فقال إنه شهد بدرا‏.‏",
      "text_en": " Narrated Ibn Maqal:                     `Ali led the funeral prayer of Sahl bin Hunaif and said, \"He was one of the warriors of Badr.\"",
      "chain": [
        "30377",
        "20005",
        "11364",
        "5"
      ]
    },
    {
      "hadith_no": "19",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "وحدثني محمد بن عباد، وسعيد بن عمرو الأشعثي، جميعا عن ابن عيينة، - قال سعيد أخبرنا سفيان، - عن هشام بن حجير، عن طاوس، قال جاء هذا إلى ابن عباس - يعني بشير بن كعب - فجعل يحدثه فقال له ابن عباس عد لحديث كذا وكذا ‏.‏ فعاد له ثم حدثه فقال له عد لحديث كذا وكذا ‏.‏ فعاد له فقال له ما أدري أعرفت حديثي كله وأنكرت هذا أم أنكرت حديثي كله وعرفت هذا فقال له ابن عباس إنا كنا نحدث عن رسول الله صلى الله عليه وسلم إذ لم يكن يكذب عليه فلما ركب الناس الصعب والذلول تركنا الحديث عنه ‏.‏",
      "text_en": "",
      "chain": [
        "30377",
        "11509",
        "20005",
        "11168",
        "20012",
        "11566",
        "11053"
      ]
    },
    {
      "hadith_no": "143",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن عباد، وابن أبي عمر، قالا حدثنا مروان، عن يزيد، - وهو ابن كيسان - عن أبي حازم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم لعمه عند الموت ‏\"‏ قل لا إله إلا الله أشهد لك بها يوم القيامة ‏\"‏ ‏.‏ فأبى فأنزل الله ‏{‏ إنك لا تهدي من أحببت‏}‏ الآية ‏.‏",
      "text_en": " It is narrated on the authority of Abu Huraira that the Messenger of Allah said to his uncle at the time of his death:                      Make a profession of it that there is no god but Allah and I will bear testimony (of your being a Muslim) on the Day of judgment. But he (Abu Talib) refused to do so. Then Allah revealed this verse: \" Verily thou canst not guide to the right path whom thou lovest. And it is Allah Who guideth whom He will and He knoweth best who are the guided\" (xxviii. 56).",
      "chain": [
        "30377",
        "30421",
        "20201",
        "10845",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "360",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا هارون بن معروف، ومحمد بن عباد، - واللفظ لهارون - قالا حدثنا سفيان، عن هشام، عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يزال الناس يتساءلون حتى يقال هذا خلق الله الخلق فمن خلق الله فمن وجد من ذلك شيئا فليقل آمنت بالله ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Huraira that the Messenger of Allah (may peace be upon him) said:                      Men will continue to question one another till this is propounded: Allah created all things but who created Allah? He who found himself confronted with such a situation should say: I affirm my faith in Allah.",
      "chain": [
        "30280",
        "30377",
        "20005",
        "11065",
        "10511",
        "13"
      ]
    },
    {
      "hadith_no": "389",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن عباد، وابن أبي عمر، جميعا عن مروان الفزاري، قال ابن عباد حدثنا مروان، عن يزيد، - يعني ابن كيسان - عن أبي حازم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ بدأ الإسلام غريبا وسيعود كما بدأ غريبا فطوبى للغرباء ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Huraira that the Messenger of Allah (may peace be upon him) said:                      Islam initiated as something strange, and it would revert to its (old position) of being strange. so good tidings for the stranger.",
      "chain": [
        "30377",
        "30421",
        "20201",
        "10845",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "465",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثني محمد بن عباد، حدثنا سفيان، عن عمرو، عن جابر، قال كان معاذ يصلي مع النبي صلى الله عليه وسلم ثم يأتي فيؤم قومه فصلى ليلة مع النبي صلى الله عليه وسلم العشاء ثم أتى قومه فأمهم فافتتح بسورة البقرة فانحرف رجل فسلم ثم صلى وحده وانصرف فقالوا له أنافقت يا فلان قال لا والله ولآتين رسول الله صلى الله عليه وسلم فلأخبرنه ‏.‏ فأتى رسول الله صلى الله عليه وسلم فقال يا رسول الله إنا أصحاب نواضح نعمل بالنهار وإن معاذا صلى معك العشاء ثم أتى فافتتح بسورة البقرة ‏.‏ فأقبل رسول الله صلى الله عليه وسلم على معاذ فقال ‏\"‏ يا معاذ أفتان أنت اقرأ بكذا واقرأ بكذا ‏\"‏ ‏.‏ قال سفيان فقلت لعمرو إن أبا الزبير حدثنا عن جابر أنه قال ‏\"‏ اقرأ والشمس وضحاها ‏.‏ والضحى ‏.‏ والليل إذا يغشى ‏.‏ وسبح اسم ربك الأعلى ‏\"‏ ‏.‏ فقال عمرو نحو هذا ‏.‏",
      "text_en": " Jabir reported that Mu'adh b. jabal used to pray with the Apostle (may peace be upon him), then came and led his people in prayer. One night he said the night prayer with the Apostle of Allah (may peace be upon him). He then came to his people and led them in prayer beginning with Surat al-Baqara. A man turned aside, pronounced the taslim (salutation for concluding the prayer), then prayed alone and departed. The people said to him:                      Have you become a hypocrite, so and so? He said: I swear by Allah that I have not, but I will certainly go to Allah's Messenger (may peace be upon him) and will inform (him) about this. He then came to the Messenger of Allah (may peace be upon him) and said: Messenger of Allah, we look after camels used for watering and work by day. Mu'idh said the night prayer with you. He then came and began with Surat al-Baqara. Allah's Messenger (may peace be upon him) then turned to Mu'adh and said: Are you there to (put the people) to trial? Recite such and recite such (and such a surah). It is transmitted on the authority of Jabir, as told by Sufyan, that he (the Holy Prophet) had said:\" By the Sun and its morning brightness\" (Sarah xci.),\" By brightness\" (Surah xciii)\" By the night when it spreads\" (Surah xcii.), and\" Glorify the name of thy most high Lord\" (Surah lxxxii.).",
      "chain": [
        "30377",
        "20005",
        "11081",
        "34"
      ]
    },
    {
      "hadith_no": "1274",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن عباد، حدثنا حاتم، - هو ابن إسماعيل - عن يعقوب بن مجاهد، عن ابن أبي عتيق، قال تحدثت أنا والقاسم، عند عائشة - رضى الله عنها - حديثا وكان القاسم رجلا لحانة وكان لأم ولد فقالت له عائشة ما لك لا تحدث كما يتحدث ابن أخي هذا أما إني قد علمت من أين أتيت ‏.‏ هذا أدبته أمه وأنت أدبتك أمك - قال - فغضب القاسم وأضب عليها فلما رأى مائدة عائشة قد أتي بها قام ‏.‏ قالت أين قال أصلي ‏.‏ قالت اجلس ‏.‏ قال إني أصلي ‏.‏ قالت اجلس غدر إني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا صلاة بحضرة الطعام ولا وهو يدافعه الأخبثان ‏\"‏ ‏.‏",
      "text_en": " Ibn Atiq reported:                      Al-Qasim was in the presence of 'A'isha (Allah be pleased with her) that I narrated a hadith and Qasim was a man who committed errors in (pronouncing words) and his mother was a freed slave-girl. 'A'isha said to him: What is the matter with you that you do not narrate as this son of my brother narrated (the ahaditb)? Well I know from where you picked it up. This is how his mother brought him up and how your mother brought you up. Qasim felt angry (on this remark of Hadrat 'A'isha) and showed bitterness towards her. When he saw that the table had been spread for 'A'isha, he stood up, 'A'isha, said: Where are you going? He said: (I am going) to say prayer. She said: Sit down (to take the food). He said: I must say prayer. She said: Sit down, ) faithless, for I have heard the Messenger of Allah (may peace be upon him) say: No prayer can be (rightly said) when the food is there (before the worshipper), or when he is prompted by the call of nature.",
      "chain": [
        "30377",
        "20159"
      ]
    },
    {
      "hadith_no": "1357",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا محمد بن عباد، حدثنا سفيان، عن عمرو، عن طاوس، قال سمعت أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ عوذوا بالله من عذاب الله عوذوا بالله من عذاب القبر عوذوا بالله من فتنة المسيح الدجال عوذوا بالله من فتنة المحيا والممات ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported the Messenger of Allah (may peace be upon him) as saying:                      Seek refuge with Allah from the torment of Hell, seek refuge with Allah from the torment of the grave, and seek refuge with Allah from the trial of Masih al-Dajjal and seek refuge with Allah from the trial of life and death.",
      "chain": [
        "30377",
        "20005",
        "11081",
        "11053",
        "13"
      ]
    },
    {
      "hadith_no": "1358",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن عباد، حدثنا سفيان، عن ابن طاوس، عن أبيه، عن أبي هريرة، عن النبي صلى الله عليه وسلم مثله ‏.‏",
      "text_en": " A hadith like this has been transmitted by Ibn Tawus from his father on the authority of AbuHuraira.",
      "chain": [
        "30377",
        "20005",
        "11433",
        "11053",
        "13"
      ]
    },
    {
      "hadith_no": "1359",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا محمد بن عباد، وأبو بكر بن أبي شيبة وزهير بن حرب قالوا حدثنا سفيان، عن أبي الزناد، عن الأعرج، عن أبي هريرة، عن النبي صلى الله عليه وسلم مثله ‏.‏",
      "text_en": " A hadith like this has been transmitted by A'raj on the authority of Abu Huraira.",
      "chain": [
        "30377",
        "20005",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "1713",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا محمد بن عباد، حدثنا سفيان، عن عمرو، عن الزهري، عن سالم، عن أبيه، أخبرتني حفصة، أن النبي صلى الله عليه وسلم كان إذا أضاء له الفجر صلى ركعتين ‏.‏",
      "text_en": " Hafsa reported:                      When the dawn appeared, the Apostle of Allah (may peace be upon him) observed two rak'ahs (of Sunnah prayers).",
      "chain": [
        "30377",
        "20005",
        "11081",
        "11013",
        "11011",
        "18",
        "54"
      ]
    },
    {
      "hadith_no": "1723",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثني محمد بن عباد، وابن أبي عمر، قالا حدثنا مروان بن معاوية، عن يزيد، - هو ابن كيسان - عن أبي حازم، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قرأ في ركعتى الفجر ‏{‏ قل يا أيها الكافرون‏}‏ و ‏{‏ قل هو الله أحد‏}‏",
      "text_en": " Abu Huraira reported that the Messenger of Allah (may peace be upon him) recited in the two (supererogatory) rak'ahs of the dawn (prayer):                     \" Say: O unbelievers,\" (Qur'an, cix.) and\" Say: Allah is one\" (cxii.).",
      "chain": [
        "30377",
        "30421",
        "20201",
        "10845",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "1784",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا محمد بن عباد، - واللفظ له - حدثنا سفيان، حدثنا عمرو، عن طاوس، عن ابن عمر، ح وحدثنا الزهري، عن سالم، عن أبيه، أن رجلا، سأل النبي صلى الله عليه وسلم عن صلاة الليل فقال ‏\"‏ مثنى مثنى فإذا خشيت الصبح فأوتر بركعة ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. 'Umar reported:                      A man stood up and said. Messenger of Allah, how is the night prayer? The Messenger of Allah (may peace be upon him) said: The night prayer consists of pair, but if you apprehend the rise of dawn, make it odd number by observing one rak'ah.",
      "chain": [
        "30377",
        "20005",
        "11081",
        "11053",
        "18",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "2303",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "حدثنا يحيى بن أيوب، ومحمد بن عباد، - واللفظ ليحيى - قالا حدثنا مروان، بن معاوية عن يزيد، - يعني ابن كيسان - عن أبي حازم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ استأذنت ربي أن أستغفر لأمي فلم يأذن لي واستأذنته أن أزور قبرها فأذن لي ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger, (may peace be upon him) as saying:                      I sought permission to beg forgiveness for my mother, but He did not grant it to me. I sought permission from Him to visit her grave, and He granted it (permission) to me.",
      "chain": [
        "20379",
        "30377",
        "20201",
        "10845",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "2836",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا محمد بن عباد، وابن أبي عمر، قالا حدثنا مروان، - وهو الفزاري - عن يزيد، - وهو ابن كيسان - عن أبي حازم، عن أبي هريرة، - رضى الله عنه - قال تذاكرنا ليلة القدر عند رسول الله صلى الله عليه وسلم فقال ‏\"‏ أيكم يذكر حين طلع القمر وهو مثل شق جفنة ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported:                      We were talking about Lailat-ul-Qadr in the presence of the Messenger of Allah (may peace be upon him) and he said: He who amongst you remembers (the night) when the moon arose and it was like a piece of plate (at the fag end of the month in a state of waning).",
      "chain": [
        "30377",
        "30421",
        "20201",
        "10845",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "2869",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا محمد بن عباد، حدثنا حاتم، - يعني ابن إسماعيل - عن موسى بن عقبة، عن سالم بن عبد الله بن عمر، ونافع، مولى عبد الله وحمزة بن عبد الله عن عبد الله، بن عمر - رضى الله عنهما - أن رسول الله صلى الله عليه وسلم كان إذا استوت به راحلته قائمة عند مسجد ذي الحليفة أهل فقال ‏\"‏ لبيك اللهم لبيك لبيك لا شريك لك لبيك إن الحمد والنعمة لك والملك لا شريك لك ‏\"‏ ‏.‏ قالوا وكان عبد الله بن عمر - رضى الله عنهما - يقول هذه تلبية رسول الله صلى الله عليه وسلم ‏.‏ قال نافع كان عبد الله - رضى الله عنه - يزيد مع هذا لبيك لبيك وسعديك والخير بيديك لبيك والرغباء إليك والعمل ‏.‏",
      "text_en": " 'Abdullah b. 'Umar (Allah be pleased with them) reported that the Mes- senger of Allah (may peace be upon him) entered upon the state of Ihram near the mosque at Dhu'l-Hulaifa as his camel stood by it and he said:                      Here I am at Thy service, O Lord; here I am at Thy service: here I am at Thy service. There is no associate with Thee. Here I am at Thy service. All praise and grace is due to Thee and the sovereignty (too). There is no associate with Thee. They (the people) said that 'Abdullah b. 'Umar said that that was the Talbiya of the Messenger of Allah (may peace be upon him). Nafi' said: 'Abdullah (Allah be pleased with him) made this addition to it: Here I am at Thy service; here I am at Thy service; ready to obey Thee. The Good is in Thy Hand. Here I am at Thy service. Unto Thee is the petition and deed (is also for Thee).",
      "chain": [
        "30377",
        "20159",
        "11106",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "2881",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا محمد بن عباد، أخبرنا سفيان، عن الزهري، عن عروة، عن عائشة، - رضى الله عنها - قالت طيبت رسول الله صلى الله عليه وسلم لحرمه حين أحرم ولحله قبل أن يطوف بالبيت ‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her) reported:                      I applied perfume to the Messenger of Allah (may peace be upon him) before he entered upon the state of lhram and (concluding) before circumambulating the (sacred) House.",
      "chain": [
        "30377",
        "20005",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "3108",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا محمد بن عباد، حدثنا حاتم، - يعني ابن إسماعيل - عن موسى بن، عقبة عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم كان إذا طاف في الحج والعمرة أول ما يقدم فإنه يسعى ثلاثة أطواف بالبيت ثم يمشي أربعة ثم يصلي سجدتين ثم يطوف بين الصفا والمروة ‏.‏",
      "text_en": " Ibn'Umar (Allah be pleased with them) reported that when Allah's messenger (may peace be upon him) circumambulated in Hajj and Umra he walked swiftly in the first three circuit about the House, and then walked in four circuits, and then observed two rak'ahs of prayer, and then ran between al-Safa and al-Marwa.",
      "chain": [
        "30377",
        "20159",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3350",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا محمد بن عباد، حدثنا حاتم، - وهو ابن إسماعيل - عن موسى، - وهو ابن عقبة - عن سالم، عن أبيه، أن رسول الله صلى الله عليه وسلم أتي في معرسه بذي الحليفة فقيل له إنك ببطحاء مباركة ‏.‏",
      "text_en": " Salim (b. Abdullah b. 'Umar) reported on the authority of his father (Allah be pleased with them) that Allah's Apostle (may peace be upon him) was visited by (someone, i. e. an angel) during the fag end of the night at Dhu'l-Hulaifa, and it was said to him:                      Verily it is a blessed stony-ground.",
      "chain": [
        "30377",
        "20159",
        "11106",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "4062",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثني محمد بن عباد، حدثنا عبد العزيز بن محمد، عن حميد، عن أنس، أن النبي صلى الله عليه وسلم قال ‏\"‏ إن لم يثمرها الله فبم يستحل أحدكم مال أخيه ‏\"‏ ‏.‏",
      "text_en": " Anas (Allah be pleased with him) reported Allah's Apostle (may peace be upon him) as saying:                      If Allah does not fructify them, then what is permissible for one of you to take the wealth of his brother?",
      "chain": [
        "30377",
        "20167",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "4172",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثني محمد بن عباد، ومحمد بن حاتم، وابن أبي عمر، جميعا عن سفيان بن، عيينة - واللفظ لابن عباد - قال حدثنا سفيان، عن عمرو، عن أبي صالح، قال سمعت أبا سعيد الخدري، يقول الدينار بالدينار والدرهم بالدرهم مثلا بمثل من زاد أو ازداد فقد أربى ‏.‏ فقلت له إن ابن عباس يقول غير هذا ‏.‏ فقال لقد لقيت ابن عباس فقلت أرأيت هذا الذي تقول أشىء سمعته من رسول الله صلى الله عليه وسلم أو وجدته في كتاب الله عز وجل فقال لم أسمعه من رسول الله صلى الله عليه وسلم ولم أجده في كتاب الله ولكن حدثني أسامة بن زيد أن النبي صلى الله عليه وسلم قال ‏\"‏ الربا في النسيئة ‏\"‏ ‏.‏",
      "text_en": " Abu Salih reported:                      I heard Abu Sa'id al-Khudri (Allah be pleased with him) said: Dinar (gold) for gold and dirham for dirham can be (exchanged) with equal for equal; but he who gives more or demands more in fact deals in interest. I sald to him: Ibn 'Abbas (Allah be pleased with them) says otherwise, whereupon he said: I met Ibn 'Abbas (Allah be pleased with them) and said: Do you see what you say; have you heard it from Allah's Messenger (may peace be upon him), or found it in the Book of Allah, the Glorious and Majestic? He said: I did not hear it from Allah's Messenger (may peace be upon him). and I did not find it in the Book of Allah (Glorious and Majestic), but Usama b. Zaid narrated it to me that Allah's Apostle (may peace be upon him) said: There can be an element of interest in credit.",
      "chain": [
        "30377",
        "38487",
        "30421",
        "20005",
        "20005",
        "11081",
        "11161",
        "38",
        "17"
      ]
    },
    {
      "hadith_no": "4376",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "وحدثنا محمد بن عباد، وابن أبي عمر، - واللفظ لابن أبي عمر - قالا حدثنا سفيان، عن هشام بن حجير، عن طاوس، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ قال سليمان بن داود نبي الله لأطوفن الليلة على سبعين امرأة كلهن تأتي بغلام يقاتل في سبيل الله ‏.‏ فقال له صاحبه أو الملك قل إن شاء الله ‏.‏ فلم يقل ونسي ‏.‏ فلم تأت واحدة من نسائه إلا واحدة جاءت بشق غلام ‏\"‏ ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ ولو قال إن شاء الله ‏.‏ لم يحنث وكان دركا له في حاجته ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Prophet (may peace be upon him) as saying that Sulaiman b. Dawud, the Apostle of Allah, observed:                      I will have an intercourse with seventy wives during the night; all of them will give birth to a male child who will fight in the cause of Allah. His companion or the ang I said to him: Say,\" If God wills.\" But he (Hadrat Sulaimin) did not say so, and he forgot it. And none of his wives gave birth to a child, but one who gave birth to a premature child. Allah's Messenger (may peace be upon him) said: Had he said Insha' Allah (if God so will). he would not have failed and his desire would have been materialised.",
      "chain": [
        "30377",
        "30421",
        "20005",
        "11566",
        "11053",
        "13"
      ]
    },
    {
      "hadith_no": "4624",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "وحدثنا محمد بن عباد، حدثنا سفيان، عن عمرو، ح وحدثنا إسحاق بن إبراهيم، وابن أبي خلف عن زكرياء بن عدي، أخبرنا عبيد الله، عن زيد بن أبي أنيسة، كلاهما عن سعيد بن أبي بردة، عن أبيه، عن جده، عن النبي صلى الله عليه وسلم ‏.‏ نحو حديث شعبة وليس في حديث زيد بن أبي أنيسة ‏\"‏ وتطاوعا ولا تختلفا ‏\"‏ ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Buraida but for the last two words.",
      "chain": [
        "30377",
        "20005",
        "11081",
        "30123",
        "30464",
        "11201",
        "11345",
        "11901"
      ]
    },
    {
      "hadith_no": "4674",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا قتيبة بن سعيد، ومحمد بن عباد، وأبو بكر بن أبي شيبة وإسحاق بن إبراهيم - واللفظ لابن أبي شيبة - قال إسحاق أخبرنا وقال الآخرون، حدثنا سفيان، عن عمرو، عن الزهري، عن مالك بن أوس، عن عمر، قال كانت أموال بني النضير مما أفاء الله على رسوله مما لم يوجف عليه المسلمون بخيل ولا ركاب فكانت للنبي صلى الله عليه وسلم خاصة فكان ينفق على أهله نفقة سنة وما بقي يجعله في الكراع والسلاح عدة في سبيل الله ‏.‏",
      "text_en": " It has been narrated on the authority of Umar, who said:                      The properties abandoned by Banu Nadir were the ones which Allah bestowed upon His Apostle for which no expedition was undertaken either with cavalry or camelry. These properties were particularly meant for the Holy Prophet (may peace be upon him). He would meet the annual expenditure of his family from the income thereof, and would spend what remained for purchasing horses and weapons as preparation for Jihad.",
      "chain": [
        "30367",
        "30377",
        "30312",
        "20005",
        "11081",
        "11013",
        "3"
      ]
    },
    {
      "hadith_no": "4769",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا قتيبة بن سعيد، ومحمد بن عباد، - واللفظ لابن عباد - قالا حدثنا حاتم، - وهو ابن إسماعيل - عن يزيد بن أبي عبيد، مولى سلمة بن الأكوع عن سلمة بن الأكوع، قال خرجنا مع رسول الله صلى الله عليه وسلم إلى خيبر فتسيرنا ليلا فقال رجل من القوم لعامر بن الأكوع ألا تسمعنا من هنيهاتك وكان عامر رجلا شاعرا فنزل يحدو بالقوم يقول اللهم لولا أنت ما اهتدينا ولا تصدقنا ولا صلينا فاغفر فداء لك ما اقتفينا وثبت الأقدام إن لاقينا وألقين سكينة علينا إنا إذا صيح بنا أتينا وبالصياح عولوا علينا فقال رسول الله صلى الله عليه وسلم ‏\"‏ من هذا السائق ‏\"‏ ‏.‏ قالوا عامر ‏.‏ قال ‏\"‏ يرحمه الله ‏\"‏ ‏.‏ فقال رجل من القوم وجبت يا رسول الله لولا أمتعتنا به ‏.‏ قال فأتينا خيبر فحصرناهم حتى أصابتنا مخمصة شديدة ثم قال ‏\"‏ إن الله فتحها عليكم ‏\"‏ ‏.‏ قال فلما أمسى الناس مساء اليوم الذي فتحت عليهم أوقدوا نيرانا كثيرة فقال رسول الله صلى الله عليه وسلم ‏\"‏ ما هذه النيران على أى شىء توقدون ‏\"‏ ‏.‏ فقالوا على لحم ‏.‏ قال ‏\"‏ أى لحم ‏\"‏ ‏.‏ قالوا لحم حمر الإنسية ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أهريقوها واكسروها ‏\"‏ ‏.‏ فقال رجل أو يهريقوها ويغسلوها فقال ‏\"‏ أو ذاك ‏\"‏ ‏.‏ قال فلما تصاف القوم كان سيف عامر فيه قصر فتناول به ساق يهودي ليضربه ويرجع ذباب سيفه فأصاب ركبة عامر فمات منه قال فلما قفلوا قال سلمة وهو آخذ بيدي قال فلما رآني رسول الله صلى الله عليه وسلم ساكتا قال ‏\"‏ ما لك ‏\"‏ ‏.‏ قلت له فداك أبي وأمي زعموا أن عامرا حبط عمله قال ‏\"‏ من قاله ‏\"‏ ‏.‏ قلت فلان وفلان وأسيد بن حضير الأنصاري فقال ‏\"‏ كذب من قاله إن له لأجرين ‏\"‏ ‏.‏ وجمع بين إصبعيه ‏\"‏ إنه لجاهد مجاهد قل عربي مشى بها مثله ‏\"‏ ‏.‏ وخالف قتيبة محمدا في الحديث في حرفين وفي رواية ابن عباد وألق سكينة علينا ‏.‏",
      "text_en": " It has been narrated on the authority of Salama b. al-Akwa' who said:                      We marched upon Khaibar with the Messenger of Allah (may peace be upon him). We journeyed during the night. One of the people said to (my brother) 'Amir b. al-Akwa': Won't you recite to us some of your verses? Amir was a poet. So he began to chant his verses to urge the camels, reciting: O God, if Thou hadst not guided us We would have neither been guided rightly nor practised charity, Nor offered prayers. We wish to lay down our lives for Thee; so forgive Thou our lapses, And keep us steadfast when we encounter (our enemies). Bestow upon us peace and tranquillity. Behold, when with a cry they called upon us to help. The Messenger of Allah (may peace be upon him) said: Who is this driver (of the camels)? They said: It is 'Amir. He said: God will show mercy to him. A man said: Martyrdom is reserved for him. Messenger of Allah, would that you had allowed us to benefit ourselves from his life. (The narrator says): We reached Khaibar and besieged them, and (we continued the siege) until extreme hunger afflicted us. Then the Messenger of Allah (may peace be upon him) said: Behold, God has conquered it for you. When it was evening of the day on which the city was conquered. the Muslims lit many fires. The Messenger of Allah (may peace be upon him) said: What are these fires? And what are they cooking? They said: They are cooking meat. He asked. Which meat? They said: That of domestic asses. He said: Let them throw it away and break the pots (in which it is being cooked). A man said: Or should they throw it away and wash the pots? He said: They may do that. When the people drew themselves up in battle array 'Amir caught hold of his sword that was rather short He drove a Jew before him to strike him with it. (As he struck him), his sword recoiled and struck his own knee, and 'Amir died of the wound. When the people returned (after the conquest of Kliaibar) and he (Salama) had caught hold of my hand, and said: The Messenger of Allah (may peace be upon him) saw that I was silent (and dejected) ; he said: What's the matter with thee? I said to him: My father and my mother be thy ransom, people presume that 'Amir's sacrifice has been in vain. He asked: Who has said that? I said: So and so and Usaid b. Hudair al-Ansari. He said: Who has said that has lied. For him (for 'Amir) there is a double reward. (He indicated this by putting two of his fingers together.) He was a devotee of God and a warrior fighting for His cause. There will be hardly any Arab who can fight as bravely as he did. Qutaiba has differed in a few words.",
      "chain": [
        "30367",
        "30377",
        "20159",
        "237"
      ]
    },
    {
      "hadith_no": "4800",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا محمد بن عباد، حدثنا حاتم، - يعني ابن إسماعيل - عن يزيد، - وهو ابن أبي عبيد قال سمعت سلمة، يقول غزوت مع رسول الله صلى الله عليه وسلم سبع غزوات وخرجت فيما يبعث من البعوث تسع غزوات مرة علينا أبو بكر ومرة علينا أسامة بن زيد ‏.‏",
      "text_en": " It has been narrated on the authority of Salama who said:                      I joined seven military expeditions led by the Messenger of Allah himself (may peace be upon him), and nine expeditions which he sent out once under Abu Bakr and once under Usama b. Zaid.",
      "chain": [
        "30377",
        "20159",
        "11450",
        "237"
      ]
    },
    {
      "hadith_no": "5130",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثنا محمد بن عباد، وقتيبة بن سعيد، قالا حدثنا حاتم، - وهو ابن إسماعيل - عن يزيد بن أبي عبيد، عن سلمة بن الأكوع، قال خرجنا مع رسول الله صلى الله عليه وسلم إلى خيبر ثم إن الله فتحها عليهم فلما أمسى الناس اليوم الذي فتحت عليهم أوقدوا نيرانا كثيرة فقال رسول الله صلى الله عليه وسلم ‏\"‏ ما هذه النيران على أى شىء توقدون ‏\"‏ قالوا على لحم ‏.‏ قال ‏\"‏ على أى لحم ‏\"‏ ‏.‏ قالوا على لحم حمر إنسية ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أهريقوها واكسروها ‏\"‏ ‏.‏ فقال رجل يا رسول الله أو نهريقها ونغسلها قال ‏\"‏ أو ذاك ‏\"‏ ‏.‏",
      "text_en": " Salama b. Akwa' reported:                      We went to Khaibar with Allah's Messenger (may peace be upon him). Then Allah granted (us) victory over them. On that very evening of the day when they had been granted victory, they lit many fires. Thereupon Allah's Messenger (may peace be upon him) said: What are those fires and what for those have been lit? They said: (These have been lit) for (cooking) the flesh. Thereupon he said: Of what flesh? They said: For the flesh of the domestic asses. Thereupon Allah's Messenger (may peace bo upon him) said: Throw that away and break them (the earthen pots in which the fiesa was being cooked). A person said: Messenger of Allah, should we throw it away and wash them (the cooking pots)? He said: You may do so.",
      "chain": [
        "30377",
        "30367",
        "20159",
        "11450",
        "237"
      ]
    },
    {
      "hadith_no": "5333",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا محمد بن عباد، حدثنا سفيان، عن عمرو، سمعه من، سعيد بن أبي بردة عن أبيه، عن جده، أن النبي صلى الله عليه وسلم بعثه ومعاذا إلى اليمن فقال لهما ‏\"‏ بشرا ويسرا وعلما ولا تنفرا ‏\"‏ ‏.‏ وأراه قال ‏\"‏ وتطاوعا ‏\"‏ ‏.‏ قال فلما ولى رجع أبو موسى فقال يا رسول الله إن لهم شرابا من العسل يطبخ حتى يعقد والمزر يصنع من الشعير فقال رسول الله صلى الله عليه وسلم ‏\"‏ كل ما أسكر عن الصلاة فهو حرام ‏\"‏ ‏.‏",
      "text_en": " Abu Burda reported on the authority of his grandfather that Allah's Messenger (may peace be upon him) sent him and Mu'adh b. Jabal to Yemen and said to them:                      Give good tidings to the (people). and make things easy (for them), teach (them), and do not repel (them) ; and I think he also said: Cooperate cheerfully with each other. When he (the Holy Prophet) turned his back, Abu Musa returned to him and said: Allah's Messenger, they (the people of Yemen) have a drink which is (made) from honey and which is prepared by cooking it until it coagulates, and Mizr is prepared from barley, whereupon Allah's Messenger (may peace be upon him) said: Every intoxicant that detains you from prayer is forbidden.",
      "chain": [
        "30377",
        "20005",
        "11081"
      ]
    },
    {
      "hadith_no": "5358",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا محمد بن عباد، وزهير بن حرب، - واللفظ لابن عباد - قالا حدثنا أبو صفوان أخبرنا يونس، عن الزهري، قال قال ابن المسيب قال أبو هريرة إن النبي صلى الله عليه وسلم أتي ليلة أسري به بإيلياء بقدحين من خمر ولبن فنظر إليهما فأخذ اللبن ‏.‏ فقال له جبريل عليه السلام الحمد لله الذي هداك للفطرة لو أخذت الخمر غوت أمتك ‏.‏",
      "text_en": " Abu Huraira reported that Allah's Messenger (may peace be upon him) was presented two cups at Bait al-Maqdis on the night of Heavenly Journey, one containing wine and the other containing milk. He looked at both of them, and be took the one containing milk, whereupon Gabriel (peace be upon him) said:                      Praise is due to Allah Who guided you to the true nature; had you taken the one containing wine, Your Umma would have gone astray.",
      "chain": [
        "30377",
        "30022",
        "20525",
        "20475",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "5582",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "وحدثني محمد بن حاتم، وهارون بن عبد الله، وابن أبي خلف، وألفاظهم، متقاربةقالوا حدثنا روح بن عبادة، حدثنا ابن جريج، قال سمعت محمد بن عباد بن جعفر، يقولأمرت مسلم بن يسار مولى نافع بن عبد الحارث أن يسأل ابن عمر، - قال - وأنا جالس،بينهما أسمعت من النبي صلى الله عليه وسلم في الذي يجر إزاره من الخيلاء شيئا قالسمعته يقول ‏\"‏ لا ينظر الله إليه يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " Mubammad b. 'Abbad b. ja'far reported:                      I ordered Muslim b. Yasar, the freed slave of Nafi' b. 'Abd al-Harith, while I was sitting between them, that he should ask Ibn 'Umar if he had heard anything from Allah's Messenger (may peace be upon him) pertaining to one who trails his lower garment out of pride. He said: I heard him (the Holy Prophet) as saying: Allah will not look toward him on the Day of Resurrection.",
      "chain": [
        "38487",
        "30524",
        "20229",
        "11070",
        "30377"
      ]
    },
    {
      "hadith_no": "5598",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعمرو الناقد، ومحمد بن عباد، وابن أبي عمر، -واللفظ لأبي بكر - قالوا حدثنا سفيان بن عيينة، عن أيوب بن موسى، عن نافع، عن ابن،عمر قال اتخذ النبي صلى الله عليه وسلم خاتما من ذهب ثم ألقاه ثم اتخذ خاتما منورق ونقش فيه محمد رسول الله ‏.‏ وقال ‏\"‏ لا ينقش أحد على نقش خاتمي هذا ‏\"‏ ‏.‏وكان إذا لبسه جعل فصه مما يلي بطن كفه وهو الذي سقط من معيقيب في بئر أريس‏.‏",
      "text_en": " Ibn Umar reported that Allah's Apostle (may peace be upon hirn) had made for himself a gold ring; then lie discarded it. and then made for himself a silver ring. and had these words engraved upon it (Mubamrnad, Messenger of Allah), and said:                      No one should engrave anything like the engraving of this signet ring of mine. and when he Wore it. he kept its stone towards the inside of his palm, and it was this which fell down (from the hands) of Mu'ayqib into the well of Aris.",
      "chain": [
        "30201",
        "30263",
        "30377",
        "30421",
        "20005",
        "11241",
        "11014"
      ]
    },
    {
      "hadith_no": "6233",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثنا قتيبة بن سعيد، ومحمد بن عباد، قالا حدثنا حاتم، - وهو ابن إسماعيل - عن الجعد بن عبد الرحمن، قال سمعت السائب بن يزيد، يقول ذهبت بي خالتي إلى رسول الله صلى الله عليه وسلم فقالت يا رسول الله إن ابن أختي وجع ‏.‏ فمسح رأسي ودعا لي بالبركة ثم توضأ فشربت من وضوئه ثم قمت خلف ظهره فنظرت إلى خاتمه بين كتفيه مثل زر الحجلة ‏.‏",
      "text_en": " As-Sa'ib b. Yazid reported:                      My mother's sister took me to Allah's Messenger (may peace be upon him) and said: Allah's Messenger, here is the son of my sister and he is ailing. He touched my head and invoked blessings upon me. He then performed ablution and I drank the water left from his ablution; then I stood behind him and I saw the seal between his shoulders.",
      "chain": [
        "30367",
        "30377",
        "20159",
        "11679",
        "3048"
      ]
    },
    {
      "hadith_no": "6266",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثناه أبو بكر بن أبي شيبة، وابن أبي عمر، قالا حدثنا سفيان بن عيينة، عن الزهري، ح وحدثنا محمد بن عباد، حدثنا سفيان، قال - أحفظه كما أحفظ بسم الله الرحمن الرحيم - الزهري عن عامر بن سعد عن أبيه قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أعظم المسلمين في المسلمين جرما من سأل عن أمر لم يحرم فحرم على الناس من أجل مسألته ‏\"‏ ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of 'Amir b. Sa'd and the words are. Allah's Messenger (may peace be upon him) said:                      The greatest sinner of the Muslims amongst Muslims is one who asked about a certain thing which had not been prohibited and it was prohibited because of his asking about it. This hadith has been narrated on the authority of Zuhri with the same chain of transmitters and with this addition:\" A person asked about a thing from Allah's Apostle (may peace be upon him) and he indulged in hair-splitting.\"",
      "chain": [
        "30201",
        "30421",
        "20005",
        "11013",
        "30377",
        "20005",
        "10554",
        "9"
      ]
    },
    {
      "hadith_no": "6336",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "وحدثنا محمد بن عباد، حدثنا سفيان بن عيينة، ح وحدثني محمد بن رافع، حدثنا  أبو داود الحفري، عن سفيان، كلاهما عن أبي الزناد، عن الأعرج، عن أبي سلمة، عن أبي، هريرة عن النبي صلى الله عليه وسلم ‏.‏ بمعنى حديث يونس عن الزهري وفي حديثهما ذكر البقرة والشاة معا وقالا في حديثهما ‏\"‏ فإني أومن به أنا وأبو بكر وعمر ‏\"‏ ‏.‏ وما هما ثم ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Zuhri, and there is a clear mention of the stories of ox and goat (and the words are):                      I believe in it and so do Abu Bakr and Umar, but they were not at that time present there.",
      "chain": [
        "30377",
        "20005",
        "30375",
        "20668",
        "11061",
        "11197",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "6337",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "وحدثناه محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، ح وحدثنا محمد بن عباد، حدثنا سفيان بن عيينة، عن مسعر، كلاهما عن سعد بن إبراهيم، عن أبي سلمة، عن أبي هريرة، عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Abu Huraira through another chain of transrritters.",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "30377",
        "20005",
        "11063",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "6373",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا قتيبة بن سعيد، ومحمد بن عباد، - وتقاربا في اللفظ - قالا حدثنا حاتم، - وهو ابن إسماعيل - عن بكير بن مسمار، عن عامر بن سعد بن أبي وقاص، عن أبيه، قال أمر معاوية بن أبي سفيان سعدا فقال ما منعك أن تسب أبا التراب فقال أما ما ذكرت ثلاثا قالهن له رسول الله صلى الله عليه وسلم فلن أسبه لأن تكون لي واحدة منهن أحب إلى من حمر النعم سمعت رسول الله صلى الله عليه وسلم يقول له خلفه في بعض مغازيه فقال له علي يا رسول الله خلفتني مع النساء والصبيان فقال له رسول الله صلى الله عليه وسلم ‏\"‏ أما ترضى أن تكون مني بمنزلة هارون من موسى إلا أنه لا نبوة بعدي ‏\"‏ ‏.‏ وسمعته يقول يوم خيبر ‏\"‏ لأعطين الراية رجلا يحب الله ورسوله ويحبه الله ورسوله ‏\"‏ ‏.‏ قال فتطاولنا لها فقال ‏\"‏ ادعوا لي عليا ‏\"‏ ‏.‏ فأتي به أرمد فبصق في عينه ودفع الراية إليه ففتح الله عليه ولما نزلت هذه الآية ‏{‏ فقل تعالوا ندع أبناءنا وأبناءكم‏}‏ دعا رسول الله صلى الله عليه وسلم عليا وفاطمة وحسنا وحسينا فقال ‏\"‏ اللهم هؤلاء أهلي ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated. on the authority of Shu'ba with the same chain of transmitters. Amir b. Sa'd b. Abi Waqqas reported on the authority of his father that Muawiya b. Abi Sufyin appointed Sa'd as the Governor and said:                      What prevents you from abusing Abu Turab (Hadrat 'Ali), whereupon be said: It is because of three things which I remember Allah's Messenger (may peace be upon him) having said about him that I would not abuse him and even if I find one of those three things for me, it would be more dear to me than the red camelg. I heard Allah's Messenger (may peace be upon him) say about 'Ali as he left behind hrin in one of his campaigns (that was Tabuk). 'All said to him: Allah's Messenger, you leave me behind along with women and children. Thereupon Allah's Messenger (may peace be upon him) said to him: Aren't you satisfied with being unto me what Aaron was unto Moses but with this exception that there is no prophethood after me. And I (also) heard him say on the Day of Khaibar: I would certainly give this standard to a person who loves Allah and his Messenger and Allah and his Messenger love him too. He (the narrator) said: We have been anxiously waiting for it, when he (the Holy Prophet) said: Call 'Ali. He was called and his eyes were inflamed. He applied saliva to his eyes and handed over the standard to him, and Allah gave him victory. (The third occasion is this) when the (following) verse was revealed:\" Let us summon our children and your children.\" Allah's Messenger (may peace be upon him) called 'Ali, Fitima, Hasan and Husain and said: O Allah, they are my family.",
      "chain": [
        "30367",
        "30377",
        "20159",
        "11832",
        "10554",
        "9"
      ]
    },
    {
      "hadith_no": "6390",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمد بن عباد، حدثنا حاتم، - يعني ابن إسماعيل - عن بكير بن مسمار، عن عامر بن سعد، عن أبيه، أن النبي صلى الله عليه وسلم جمع له أبويه يوم أحد ‏.‏ قال كان رجل من المشركين قد أحرق المسلمين فقال له النبي صلى الله عليه وسلم ‏\"‏ ارم فداك أبي وأمي ‏\"‏ ‏.‏ قال فنزعت له بسهم ليس فيه نصل فأصبت جنبه فسقط فانكشفت عورته فضحك رسول الله صلى الله عليه وسلم حتى نظرت إلى نواجذه ‏.‏",
      "text_en": " 'Amir b. Sa'd reported oLi the authority of his father that Allah's Apostle (may peace be upon him) gathered for him on the Day of Uhud his parents when a polytheist had set fire to (i. e. attacked fiercely) the Muslims. Thereupon Allah's Apostle (may peace be upon him) said to him:                      (Sa'd), shoot an arrow, (Sa'd), may my mother and father be taken as ransom for you. I drew an arrow and I shot a featherless arrow at him aiming his side that lie fell down and his private parts were exposed. Allah's Messenger (may peace be upon him) laughed that I saw his front teeth.",
      "chain": [
        "30377",
        "20159",
        "11832",
        "10554",
        "9"
      ]
    },
    {
      "hadith_no": "6522",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، ح وحدثنا ابن نمير، حدثنا أبي ح، وحدثنا محمد بن عباد، حدثنا سفيان، ح وحدثنا ابن أبي عمر، حدثنا مروان، - يعني الفزاري ح وحدثني محمد بن رافع، حدثنا أبو أسامة، كلهم عن إسماعيل، بهذا الإسناد وقال في حديث مروان فجاء بشير جرير أبو أرطاة حصين بن ربيعة يبشر النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Ismail with different chains of transmitters and in the badith transmitted on the authority of Marwan (the words are):                     \" A person giving the glad tidings on behalf of Jarir came or Abu Husain b. Rabi'a came in order to give glad tidings to Allah's Apostle (may peace be upon him).",
      "chain": [
        "30201",
        "20032",
        "30212",
        "20331",
        "30377",
        "20005",
        "30421",
        "30375"
      ]
    },
    {
      "hadith_no": "6580",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمد بن عباد، ومحمد بن مهران الرازي، - واللفظ لابن عباد - حدثنا  حاتم، - وهو ابن إسماعيل - عن عبد الرحمن بن حميد، عن إبراهيم بن محمد بن طلحة، قال سمعت أبا أسيد، خطيبا عند ابن عتبة فقال قال رسول الله صلى الله عليه وسلم ‏\"‏ خير دور الأنصار دار بني النجار ودار بني عبد الأشهل ودار بني الحارث بن الخزرج ودار بني ساعدة ‏\"‏ ‏.‏ والله لو كنت مؤثرا بها أحدا لآثرت بها عشيرتي ‏.‏",
      "text_en": " Ibrahim b. Muhammad b. Talha reported:                      I heard Abu Sa'ld delivering an address in the presence of Abu 'Utba that the Messenger of Allah (may peace be upon him) said: The worthiest settlements of the Ansar are those of Banu Najjar, then of Banu 'Abu al-Ashhal and then of Banu Harith and then of Banu Khazraj and then of the clan of Banu Sa'idah, and if I were to give preference to anyone besides them I would have given preference to my relatives.",
      "chain": [
        "30377",
        "30383",
        "20159",
        "11193",
        "11827"
      ]
    },
    {
      "hadith_no": "6682",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا قتيبة بن سعيد بن جميل بن طريف بن عبد الله الثقفي، ومحمد بن عباد، قالا حدثنا حاتم، - وهو ابن إسماعيل - عن معاوية، - وهو ابن أبي مزرد مولى بني هاشم - حدثني عمي أبو الحباب، سعيد بن يسار عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله خلق الخلق حتى إذا فرغ منهم قامت الرحم فقالت هذا مقام العائذ من القطيعة ‏.‏ قال نعم أما ترضين أن أصل من وصلك وأقطع من قطعك قالت بلى ‏.‏ قال فذاك لك ‏\"‏ ‏.‏ ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ اقرءوا إن شئتم ‏{‏ فهل عسيتم إن توليتم أن تفسدوا في الأرض وتقطعوا أرحامكم * أولئك الذين لعنهم الله فأصمهم وأعمى أبصارهم * أفلا يتدبرون القرآن أم على قلوب أقفالها‏}‏ ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported that Allah's Messenger (may peace be upon him) said:                      Verily Allah created the universe and when He had finished that, ties of relationship came forward and said This is the place for him who seeks refuge from severing (of blood-relationship). He said: Yes. Are you not satisfied that I should keep relationship with one who joins your ties of relationship and sever it with one who severs your (ties of relationship)? They (the ties of blood) said: Certainly so. Thereupon He said: Well, that is how things are for you. Allah's Messenger (may peace be upon him) then said: Recite if you like:\" But if you turn away you are sure to make mischief in the land and cut off the ties of kinship. Those it is whom Allah has cursed, so He has made them deaf and blinded their eyes. Do they not reflect on the Qur'an? Or, are there locks on their hearts?\".",
      "chain": [
        "30367",
        "30377",
        "20159",
        "13"
      ]
    },
    {
      "hadith_no": "6778",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا محمد بن عباد، وابن أبي عمر، قالا حدثنا مروان، - يعنيان الفزاري - عن يزيد، - وهو ابن كيسان - عن أبي حازم، عن أبي هريرة، قال قيل يا رسول الله ادع على المشركين قال ‏\"‏ إني لم أبعث لعانا وإنما بعثت رحمة ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported it was said to Allah's Messenger (may peace be upon him):                      Invoke curse upon the polytheists, whereupon he said: I have not been sent as the invoker of curse, but\" I have been sent as mercy.\"",
      "chain": [
        "30377",
        "30421",
        "20201",
        "10845",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "6923",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Destiny - كتاب القدر",
      "chapter_no": "47",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا وكيع، عن سفيان، عن زياد، بن إسماعيل عن محمد بن عباد بن جعفر المخزومي، عن أبي هريرة، قال جاء مشركو قريش يخاصمون رسول الله صلى الله عليه وسلم في القدر فنزلت ‏{‏ يوم يسحبون في النار على وجوههم ذوقوا مس سقر* إنا كل شىء خلقناه بقدر‏}‏",
      "text_en": " Abu Huraira reported that the polytheists of the Quraish came to have an argument with Allah's Messenger (may peace be upon him) in regard to Destiny and then this verse was revealed:                     \" On the day when they are dragged into the Fire upon their faces, taste the touch of Fire. Surely, We have created everything according to a measure\" (liv. 48).",
      "chain": [
        "30201",
        "30216",
        "20032",
        "20012",
        "10637",
        "30377",
        "13"
      ]
    },
    {
      "hadith_no": "7347",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "وحدثناه محمد بن عباد، وابن أبي عمر، قالا حدثنا مروان، عن يزيد بن كيسان، عن أبي حازم، عن أبي هريرة، بهذا الإسناد وقال ‏\"‏ هذا وقع في أسفلها فسمعتم وجبتها ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Abfi Huraira with the same chain of transmitters but with this change of wording that the Holy Prophet (may. peace be upon him) said:                      It reached at its base and you heard its sound.",
      "chain": [
        "30377",
        "30421",
        "20201",
        "10845",
        "11172"
      ]
    },
    {
      "hadith_no": "7547",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثني أبو الربيع، وأبو كامل قالا حدثنا حماد، - وهو ابن زيد - عن أيوب، ح وحدثنا محمد بن عباد، حدثنا حاتم، - يعني ابن إسماعيل - عن موسى بن عقبة، كلاهما عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Ibn 'Umar through another chain of transmitters.",
      "chain": [
        "30137",
        "20022",
        "11015",
        "30377",
        "20159",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "7648",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "حدثنا محمد بن عباد، وابن أبي عمر، قالا حدثنا مروان، - يعنيان الفزاري - عن يزيد، - وهو ابن كيسان - عن أبي حازم، عن أبي هريرة، قال والذي نفسي بيده - وقال ابن عباد والذي نفس أبي هريرة بيده - ما أشبع رسول الله صلى الله عليه وسلم أهله ثلاثة أيام تباعا من خبز حنطة حتى فارق الدنيا ‏.‏",
      "text_en": " Abu Huraira reported:                      By Him in Whose Hand is my life and Ibn 'Abbad also said: By One in Whose hand is the life of Abu Huraira, Allah's Messenger (may peace be upon him) could not afford to provide adequate food to his family which could (fill their bellies) with bread and wheat for three days successively until he left the world.",
      "chain": [
        "30377",
        "30421",
        "20201",
        "10845",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "7704",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "حدثنا هارون بن معروف، ومحمد بن عباد، - وتقاربا في لفظ الحديث - والسياق لهارون قالا حدثنا حاتم بن إسماعيل عن يعقوب بن مجاهد أبي حزرة عن عبادة بن الوليد بن عبادة بن الصامت قال خرجت أنا وأبي نطلب العلم في هذا الحى من الأنصار قبل أن يهلكوا فكان أول من لقينا أبا اليسر صاحب رسول الله صلى الله عليه وسلم ومعه غلام له معه ضمامة من صحف وعلى أبي اليسر بردة ومعافري وعلى غلامه بردة ومعافري فقال له أبي يا عم إني أرى في وجهك سفعة من غضب ‏.‏ قال أجل كان لي على فلان بن فلان الحرامي مال فأتيت أهله فسلمت فقلت ثم هو قالوا لا ‏.‏ فخرج على ابن له جفر فقلت له أين أبوك قال سمع صوتك فدخل أريكة أمي ‏.‏ فقلت اخرج إلى فقد علمت أين أنت ‏.‏ فخرج فقلت ما حملك على أن اختبأت مني قال أنا والله أحدثك ثم لا أكذبك خشيت والله أن أحدثك فأكذبك وأن أعدك فأخلفك وكنت صاحب رسول الله صلى الله عليه وسلم وكنت والله معسرا ‏.‏ قال قلت آلله ‏.‏ قال الله ‏.‏ قلت آلله ‏.‏ قال الله ‏.‏ قلت آلله ‏.‏ قال الله ‏.‏ قال فأتى بصحيفته فمحاها بيده فقال إن وجدت قضاء فاقضني وإلا أنت في حل فأشهد بصر عينى هاتين - ووضع إصبعيه على عينيه - وسمع أذنى هاتين ووعاه قلبي هذا - وأشار إلى مناط قلبه - رسول الله صلى الله عليه وسلم وهو يقول ‏\"‏ من أنظر معسرا أو وضع عنه أظله الله في ظله ‏\"‏ ‏.‏ قال فقلت له أنا يا عم لو أنك أخذت بردة غلامك وأعطيته معافريك وأخذت معافريه وأعطيته بردتك فكانت عليك حلة وعليه حلة ‏.‏ فمسح رأسي وقال اللهم بارك فيه يا ابن أخي بصر عينى هاتين وسمع أذنى هاتين ووعاه قلبي هذا - وأشار إلى مناط قلبه - رسول الله صلى الله عليه وسلم وهو يقول ‏\"‏ أطعموهم مما تأكلون وألبسوهم مما تلبسون ‏\"‏ ‏.‏ وكان أن أعطيته من متاع الدنيا أهون على من أن يأخذ من حسناتي يوم القيامة ‏.‏   ثم مضينا حتى أتينا جابر بن عبد الله في مسجده وهو يصلي في ثوب واحد مشتملا به فتخطيت القوم حتى جلست بينه وبين القبلة فقلت يرحمك الله أتصلي في ثوب واحد ورداؤك إلى جنبك قال فقال بيده في صدري هكذا وفرق بين أصابعه وقوسها أردت أن يدخل على الأحمق مثلك فيراني كيف أصنع فيصنع مثله ‏.‏ أتانا رسول الله صلى الله عليه وسلم في مسجدنا هذا وفي يده عرجون ابن طاب فرأى في قبلة المسجد نخامة فحكها بالعرجون ثم أقبل علينا فقال ‏\"‏ أيكم يحب أن يعرض الله عنه ‏\"‏ ‏.‏ قال فخشعنا ثم قال ‏\"‏ أيكم يحب أن يعرض الله عنه ‏\"‏ ‏.‏ قال فخشعنا ثم قال ‏\"‏ أيكم يحب أن يعرض الله عنه ‏\"‏ ‏.‏ قلنا لا أينا يا رسول الله ‏.‏ قال ‏\"‏ فإن أحدكم إذا قام يصلي فإن الله تبارك وتعالى قبل وجهه فلا يبصقن قبل وجهه ولا عن يمينه وليبصق عن يساره تحت رجله اليسرى فإن عجلت به بادرة فليقل بثوبه هكذا ‏\"‏ ‏.‏ ثم طوى ثوبه بعضه على بعض فقال ‏\"‏ أروني عبيرا ‏\"‏ ‏.‏ فقام فتى من الحى يشتد إلى أهله فجاء بخلوق في راحته فأخذه رسول الله صلى الله عليه وسلم فجعله على رأس العرجون ثم لطخ به على أثر النخامة ‏.‏ فقال جابر فمن هناك جعلتم الخلوق في مساجدكم ‏.‏ سرنا مع رسول الله صلى الله عليه وسلم في غزوة بطن بواط وهو يطلب المجدي بن عمرو الجهني وكان الناضح يعتقبه منا الخمسة والستة والسبعة فدارت عقبة رجل من الأنصار على ناضح له فأناخه فركبه ثم بعثه فتلدن عليه بعض التلدن فقال له شأ لعنك الله ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ من هذا اللاعن بعيره ‏\"‏ ‏.‏ قال أنا يا رسول الله ‏.‏ قال ‏\"‏ انزل عنه فلا تصحبنا بملعون لا تدعوا على أنفسكم ولا تدعوا على أولادكم ولا تدعوا على أموالكم لا توافقوا من الله ساعة يسأل فيها عطاء فيستجيب لكم ‏\"‏ ‏.‏ سرنا مع رسول الله صلى الله عليه وسلم حتى إذا كانت عشيشية ودنونا ماء من مياه العرب قال رسول الله صلى الله عليه وسلم ‏\"‏ من رجل يتقدمنا فيمدر الحوض فيشرب ويسقينا ‏\"‏ ‏.‏ قال جابر فقمت فقلت هذا رجل يا رسول الله ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أى رجل مع جابر ‏\"‏ ‏.‏ فقام جبار بن صخر فانطلقنا إلى البئر فنزعنا في الحوض سجلا أو سجلين ثم مدرناه ثم نزعنا فيه حتى أفهقناه فكان أول طالع علينا رسول الله صلى الله عليه وسلم فقال ‏\"‏ أتأذنان ‏\"‏ ‏.‏ قلنا نعم يا رسول الله ‏.‏ فأشرع ناقته فشربت شنق لها فشجت فبالت ثم عدل بها فأناخها ثم جاء رسول الله صلى الله عليه وسلم إلى الحوض فتوضأ منه ثم قمت فتوضأت من متوضإ رسول الله صلى الله عليه وسلم فذهب جبار بن صخر يقضي حاجته فقام رسول الله صلى الله عليه وسلم ليصلي وكانت على بردة ذهبت أن أخالف بين طرفيها فلم تبلغ لي وكانت لها ذباذب فنكستها ثم خالفت بين طرفيها ثم تواقصت عليها ثم جئت حتى قمت عن يسار رسول الله صلى الله عليه وسلم فأخذ بيدي فأدارني حتى أقامني عن يمينه ثم جاء جبار بن صخر فتوضأ ثم جاء فقام عن يسار رسول الله صلى الله عليه وسلم فأخذ رسول الله صلى الله عليه وسلم بيدينا جميعا فدفعنا حتى أقامنا خلفه فجعل رسول الله صلى الله عليه وسلم يرمقني وأنا لا أشعر ثم فطنت به فقال هكذا بيده يعني شد وسطك فلما فرغ رسول الله صلى الله عليه وسلم قال ‏\"‏ يا جابر ‏\"‏ ‏.‏ قلت لبيك يا رسول الله ‏.‏ قال ‏\"‏ إذا كان واسعا فخالف بين طرفيه وإذا كان ضيقا فاشدده على حقوك ‏\"‏ ‏.‏ سرنا مع رسول الله صلى الله عليه وسلم وكان قوت كل رجل منا في كل يوم تمرة فكان يمصها ثم يصرها في ثوبه وكنا نختبط بقسينا ونأكل حتى قرحت أشداقنا فأقسم أخطئها رجل منا يوما فانطلقنا به ننعشه فشهدنا أنه لم يعطها فأعطيها فقام فأخذها ‏.‏ سرنا مع رسول الله صلى الله عليه وسلم حتى نزلنا واديا أفيح فذهب رسول الله صلى الله عليه وسلم يقضي حاجته فاتبعته بإداوة من ماء فنظر رسول الله صلى الله عليه وسلم فلم ير شيئا يستتر به فإذا شجرتان بشاطئ الوادي فانطلق رسول الله صلى الله عليه وسلم إلى إحداهما فأخذ بغصن من أغصانها فقال ‏\"‏ انقادي على بإذن الله ‏\"‏ ‏.‏ فانقادت معه كالبعير المخشوش الذي يصانع قائده حتى أتى الشجرة الأخرى فأخذ بغصن من أغصانها فقال ‏\"‏ انقادي على بإذن الله ‏\"‏ ‏.‏ فانقادت معه كذلك حتى إذا كان بالمنصف مما بينهما لأم بينهما - يعني جمعهما - فقال ‏\"‏ التئما على بإذن الله ‏\"‏ ‏.‏ فالتأمتا قال جابر فخرجت أحضر مخافة أن يحس رسول الله صلى الله عليه وسلم بقربي فيبتعد - وقال محمد بن عباد فيتبعد - فجلست أحدث نفسي فحانت مني لفتة فإذا أنا برسول الله صلى الله عليه وسلم مقبلا وإذا الشجرتان قد افترقتا فقامت كل واحدة منهما على ساق فرأيت رسول الله صلى الله عليه وسلم وقف وقفة فقال برأسه هكذا - وأشار أبو إسماعيل برأسه يمينا وشمالا - ثم أقبل فلما انتهى إلى قال ‏\"‏ يا جابر هل رأيت مقامي ‏\"‏ ‏.‏ قلت نعم يا رسول الله ‏.‏ قال ‏\"‏ فانطلق إلى الشجرتين فاقطع من كل واحدة منهما غصنا فأقبل بهما حتى إذا قمت مقامي فأرسل غصنا عن يمينك وغصنا عن يسارك ‏\"‏ ‏.‏ قال جابر فقمت فأخذت حجرا فكسرته وحسرته فانذلق لي فأتيت الشجرتين فقطعت من كل واحدة منهما غصنا ثم أقبلت أجرهما حتى قمت مقام رسول الله صلى الله عليه وسلم أرسلت غصنا عن يميني وغصنا عن يساري ثم لحقته فقلت قد فعلت يا رسول الله فعم ذاك قال ‏\"‏ إني مررت بقبرين يعذبان فأحببت بشفاعتي أن يرفه عنهما ما دام الغصنان رطبين ‏\"‏ ‏.‏ قال فأتينا العسكر فقال رسول الله صلى الله عليه وسلم ‏\"‏ يا جابر ناد بوضوء ‏\"‏ ‏.‏ فقلت ألا وضوء ألا وضوء ألا وضوء قال قلت يا رسول الله ما وجدت في الركب من قطرة وكان رجل من الأنصار يبرد لرسول الله صلى الله عليه وسلم الماء في أشجاب له على حمارة من جريد قال فقال لي ‏\"‏ انطلق إلى فلان بن فلان الأنصاري فانظر هل في أشجابه من شىء ‏\"‏ ‏.‏ قال فانطلقت إليه فنظرت فيها فلم أجد فيها إلا قطرة في عزلاء شجب منها لو أني أفرغه لشربه يابسه ‏.‏ فأتيت رسول الله صلى الله عليه وسلم فقلت يا رسول الله إني لم أجد فيها إلا قطرة في عزلاء شجب منها لو أني أفرغه لشربه يابسه قال ‏\"‏ اذهب فأتني به ‏\"‏ ‏.‏ فأتيته به فأخذه بيده فجعل يتكلم بشىء لا أدري ما هو ويغمزه بيديه ثم أعطانيه فقال ‏\"‏ يا جابر ناد بجفنة ‏\"‏ ‏.‏ فقلت يا جفنة الركب ‏.‏ فأتيت بها تحمل فوضعتها بين يديه فقال رسول الله صلى الله عليه وسلم بيده في الجفنة هكذا فبسطها وفرق بين أصابعه ثم وضعها في قعر الجفنة وقال ‏\"‏ خذ يا جابر فصب على وقل باسم الله ‏\"‏ ‏.‏ فصببت عليه وقلت باسم الله ‏.‏ فرأيت الماء يتفور من بين أصابع رسول الله صلى الله عليه وسلم ثم فارت الجفنة ودارت حتى امتلأت فقال ‏\"‏ يا جابر ناد من كان له حاجة بماء ‏\"‏ ‏.‏ قال فأتى الناس فاستقوا حتى رووا قال فقلت هل بقي أحد له حاجة فرفع رسول الله صلى الله عليه وسلم يده من الجفنة وهي ملأى ‏.‏ وشكا الناس إلى رسول الله صلى الله عليه وسلم الجوع فقال ‏\"‏ عسى الله أن يطعمكم ‏\"‏ ‏.‏ فأتينا سيف البحر فزخر البحر زخرة فألقى دابة فأورينا على شقها النار فاطبخنا واشتوينا وأكلنا حتى شبعنا ‏.‏ قال جابر فدخلت أنا وفلان وفلان حتى عد خمسة في حجاج عينها ما يرانا أحد حتى خرجنا فأخذنا ضلعا من أضلاعه فقوسناه ثم دعونا بأعظم رجل في الركب وأعظم جمل في الركب وأعظم كفل في الركب فدخل تحته ما يطأطئ رأسه ‏.‏",
      "text_en": " 'Ubadah b. Walid b. Samit reported:                      I and my father set out in search of knowledge to a tribe of the Ansar before their death (i. e. before the Companions of the Holy Prophet left the world) and I was the first to meet Abu Yasar, a Companion of Allah's Messenger (may peace be upon him) and there was a young man with him who carried the record of letters with him and there was a mantle prepared by the tribe of Ma'afiri upon him. And his servant too had a Ma'afiri mantle over him. My father said to him: My uncle, I see the signs of anger or that of agony on your face. He said: Yes, such and such person, the son of so and so, of the tribe of Harami owed me a debt. I went to his family, extended salutations and said: Where is he? They said: He is not here. Then came out to me his son who was at the threshold of his youth. I said to him: Where is your father? He said: No sooner did he hear your sound than he hid himself behind my mother's bedstead. I said to him: Walk out to me, for I know where you are. He came out. I said to him: What prompted you to hide yourself from me? He said: By God, whatever I would say to you would not be a lie. By Allah, I fear that I should tell a lie to you and in case of making promise with you I should break it, as you are the Companion of Allah's Messenger (may peace be upon him). The fact is that I was hard up in regard to money. I said: Do you adjure by Allah? He said: I adjure by Allah. I said: Do you adjure by Allah? He said: I adjure by Allah. I said: Do you adjure by Allah? He said: I adjure by Allah. Then he brought his promissory note and he wrote off (the debt) with his hand and said: Make payment when you find yourself solvent enough to pay me back; if you are not, then there is no liability upon you. These two eyes of mine saw, and he (Abu'I-Yasar) placed his fingers upon his eyes and these two ears of mine heard and my heart retained, and he pointed towards his heart that Allah's Messenger (may peace be upon him) said: He who gives time to one who is financially hard up (in the payment of debt) or writes off his debt, Allah will provide him His shadow. I said to him: My uncle, if you get the cloak of your servant and you give him your two clothes, or take his two clothes of Ma'afir and give him your cloak, then there would be one dress for you and one for him. He wiped my head and said: O Allah, bless the son of my brother. O, son of my brother, these two very eyes of mine saw and these two ears of mine listened to and this heart of mine retained this, and he pointed towards the heart that Allah's Messenger (may peace be upon him) said: Feed them (the servants) and clothe them (the servants) what you wear, and if I give him the goods of the world, it is easy for me than this that he should take my virtues on the Day of Resurrection. We went on till we came to Jabir b. Abdullah in the mosque and he was busy in observing prayer in one cloth which he had joined at its opposite ends. I made my way through the people till I sat between him and the Qibla and I said: May Allah have mercy upon you. Do you observe prayer with one cloth on your body whereas your mantle is lying at your side? He pointed me with his hand towards my breast just like this and he separated his fingers and bent them in the shape of a bow. And (he said): I thought that a fool like you should come to me so that he should see me as I do and he should then also do like it. Allah's Messenger (may peace be upon him) came to us in this very mosque and he had in his hand the twig of the palm-tree and he saw mucus towards the Qibla of the mosque and he erased it with the help of the twig. He then came to us and said: Who amongst you likes that Allah should turn His face away from him? We were afraid. He then again said: Who amongst you likes that Allah should turn His face away from him? We were afraid. He again said: Who amongst you likes that Allah should turn His face away from him? We said: Allah's Messenger, none of us likes it. And he said: If one amongst you stands for prayer, Allah, the Exalted and Glorious, is before him he should not spit in front of him, or on his right side, but should spit on his left side beneath his left foot and if he is impelled to do so all of a sudden (in spite of himself) he should then spit in his cloth and fold it in some part of it. (and he further said: ) Bring some sweet-smelling thing. A young man who belonged to our tribe stood up, went and brought scent in his palm. Allah's Messenger (may peace be upon him) took that and applied it to the end of that twig and then touched the place where there had been mucus. Jabir said: This is why you should apply scent to your mosques. It is reported on the same authority: We set out along with Allah's Messenger (may peace be upon him) on an expedition of Batn Buwat. He (the Holy Prophet) was in search of al-Majdi b. 'Amr al-Juhani. (We had so meagre equipment) that five. six or seven of us had one camel to ride and so we mounted it turn by turn. Once there wan. the turn of an Ansari to ride upon the camel. He made it kneel down to ride over it (and after having. mounted it), he tried to raise it up but it hesitated. So he said. May there be curse of Allah upon you! Thereupon Allah's Messenger (may peace be upon him) said: Who is there to curse his camel? He said: Allah's Messenger, it' is I. Thereupon he said: Get down from the camel and let us not have in our company the cursed one. Don't curse your own selves, nor your children. nor your belongings. There is the possibility that your curse may synchronies with the time when Allah is about to confer upon you what you demand and thus your prayer may be readily responded. It is reported on the same authority: We set out on an expedition along with Allah's Messenger (may peace be upon him) until it was evening, and we had been near a. water reservoir of Arabia. Allah's Messenger (may peace be upon him) said: Who would be the person who would go ahead and set right the reservoir and drink water himself and serve us with it? Jabir said: I stood up and said: Allah's Messenger, it is I who am ready to do that. Thereupon Allah's Messenger (may peace be upon him) said: Who is the person to accompany Jabir? And then Jabbar b. Sakhr stood up. So we went to that well and poured in that tank a bucket or two of water and plastered it with clay and then began to fill it (with water) until it was filled to the brim. Allah's Messenger (may peace be upon him) was the first who appeared before us, and he said: Do you (both) permit me to drink water out of it? We said: Yea, Allah's Messenger. He led his camel to drink water and it drank. He then pulled its rein and it stretched its legs and began to urinate. He then took it aside and made it kneel down at another place and then came to the tank and performed ablution. I then got up and performed ablution like the ablution of Allah's Messenger (may peace be upon him), and Jabbar b. Sakhr went in order to relieve himself and Allah's Messenger (may peace be upon him) got up to observe prayer and there was a mantle over me. I tried to invert its ends but it was too short (to cover my body easily). It had its borders. I then inverted it (the mantle) and drew its opposite ends and then tied them at my neck. I then came and stood upon the left side of Allah's Messenger (may peace be upon him). He caught hold of me and made me go round behind him, until he made me stand on his right side. Then Jabbar b. Sakhr came. He performed ablution and then came and stood on the left side of Allah's Messenger (may peace be upon him). Then Allah's Messenger (may peace be upon him) caught hold of our hands together, pushed us back and made us stand behind him. Then Allah's Messenger (may peace be upon him) began to look upon me with darting looks, but I did not perceive that. After that I became aware of it and he pointed with the gesture of his hand that I should wrap my loin-cloth. When Allah's Messenger (may peace be upon him) had finished the prayer, he said: Jabir! I said: Allah's Messenger, at thy beck and call. He said: When the cloth around you is inadequate, then tie the opposite ends but when it is small, tie it over the lower body. Jabir reported: We set out on an expedition with Allah's Messenger (may peace be upon him) and the only means of sustenance for every person amongst us was only one date for a day and we used to chew it. And we struck the leaves with the help of our bow and ate them until the sides of our mouths were injured. It so happened one day that a person was overlooked and not given a date. We carried that person and bore witness to the fact that he had not been given that date so he was offered that and he got up and received that. Jabir reported: We set out on an expedition along with Allah's Messenger (may peace be upon him) until we got down at a spacious valley and Allah's Messenger (may peace be upon him) went to relieve himself. I followed him with a bucket full of water and Allah's Messenger (may peace be upon him) looked about and he found no privacy but two trees at the end of the valley and Allah's Messenger (may. peace be upon him) went to one of them and took hold of one of its twigs and said: Be thou under my control by the permission of Allah, and so it came under his control like the camel who has its nosestring in the hand of its rider, and then he came to the second tree and took hold of a twig and said: Be thou under my control with the permission of Allah, and it came under his control, and when he came in the middle of the two trees he joined together the two twigs and said: join with the permission of Allah. Jabir said: I was afraid lest Allah's Messenger (may peace be upon him) should be aware of my nearness and go still farther. And Muhammad b. Abbad has used the word\" faitab'd\" and I began to talk to myself. And as I saw, I suddenly found Allah's Messenger (may peace be upon him) before me and the two trees were separated and each one of them was standing at its place. I saw Allah's Messenger (may peace be upon him) standing for a short time, nodding his head towards right and left. Isma'il pointed towards the right and left with the help of his head (in order to demonstrate how the Holy Prophet had pointed). Then he (the Holy Prophet) came to me and said: Jabir did you see my place where I was standing? I said: Allah's Messenger, yes. He then said: Then you should go to those two trees and cut a twig from each of them and go to that place with them where I was standing and stand there where I was standing and place a twig on the right and a twig on the left. Jabir said: I set out and took hold of a stone and broke it and sharpened it and then I came to those trees and cut a twig from each one of them. I then came dragging them until I stood at the place where Allah's Messenger (may peace be upon him) had been standing and placed a twig on the right and a twig on the left. Then I met him and said: Allah's Messenger, I have done that, but (kindly) explain to me the reason for it. Thereupon he said: I passed by two graves the occupants of which had been undergoing torment. I liked to make intercession for them so that the might be relieved of this torment y as long as these twigs remain fresh. Jabir said: We came back to the (camp of the) army and Allah's Messenger (may peace be upon him) said: Jabir, call people for per- forming wudu. I cried: Come and perform wudu, come and perform wudu, come and perform wudu. I said: Allah's Messenger, there is not even a drop of water in the army camp, and there. was a person who used to cool the water for Allah's Messenger (may peace be upon him) in the old water-skin which kept hanging by the twig. He asked me to go to such and such Ansari and ask him to see if there was any water in that skin. I went to him and cast a glance in it but did not find anything but a drop in the mouth of that water-skin and if I were to draw that, the water-skin's,. dried part would suck it up. I came to Allah's Messenger (may peace be upon him) and said: Allah's Messenger, I have not found anything in it but a drop of water in the mouth of the water-skin and now if I were to draw that, it would be absorbed. He said: Go and bring that to me. I brought that to him. He took hold of it -and began to utter something which I could not understand and then pressed it with his hand and gave that to me and said: Jabir, announce for the tub to be brought. So I announced that the tub of the army (be brought). It was brought accordingly and I placed it before him (the Holy Prophet). Thereupon Allah's Messenger (may peace be upon him) placed his hands in the tub like this: with his fingers stretched out, and then he placed his fingers at the bottom of the tub and said: Jabir, take it (that waters-skin) and pour water over me, by reciting Bismillah, and I poured water and I said: Bismillah, and found water sprouting out between the fingers of Allah's Messenger (may peace be upon him). Then that tub gushed forth until it was filled up and the Messenger (may peace be upon him) said: Jabir, make an announcement to the effect: He who needs water should take that. Jabir said: The people came and got water until they were all satiated. I said: Is there anyone left who wants to get it? And Allah's Messenger (may peace be upon him) then lifted up his hand from that tub and it was still full. Then the people made a complaint to Allah's Messenger (may peace be upon him) about hunger and he said: May Allah provide you food! We came to the bank of the ocean and the ocean was tossing and it threw out a big animal and we lit fire and cooked it and took it until we had eaten to our heart's content. Jabir said: I and such and such five persons entered Its socket and nobody could see us until we had come out, and we took hold of one of its ribs and twisted it into a sort of arch, then we called the tallest of the persons of the army and the hugest of the camels of the army and it had the big saddle over it, and it could easily pass through it without the rider having need to bend down.",
      "chain": [
        "30280",
        "30377",
        "20159",
        "12201"
      ]
    },
    {
      "hadith_no": "2310",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Qadar - كتاب القدر عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو كريب، محمد بن العلاء ومحمد بن بشار قالا حدثنا وكيع، عن سفيان الثوري، عن زياد بن إسماعيل، عن محمد بن عباد بن جعفر المخزومي، عن أبي هريرة، قال جاء مشركو قريش إلى رسول الله صلى الله عليه وسلم يخاصمون في القدر فنزلت هذه الآية ‏:‏ ‏(‏يوم يسحبون في النار على وجوههم ذوقوا مس سقر * إنا كل شيء خلقناه بقدر ‏)‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Abu Hurairah said:                      \"Idolaters from the Quraish came to the Messenger of Allah (s.a.w) quarreling about Al-Qadar. So this Ayah was revealed:\"The day they will be dragged on their faces into the Fire (it will be said to them): \"Taste you the touch of Hell.\" Verily we have created all things with Qadar.",
      "chain": [
        "20032",
        "20012",
        "10637",
        "30377",
        "13"
      ]
    },
    {
      "hadith_no": "2405",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا أحمد بن سعيد الدارمي، حدثنا محمد بن عباد، أخبرنا حاتم بن إسماعيل، أخبرنا حمزة بن أبي محمد، عن عبد الله بن دينار، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن الله تعالى قال لقد خلقت خلقا ألسنتهم أحلى من العسل وقلوبهم أمر من الصبر فبي حلفت لأتيحنهم فتنة تدع الحليم منهم حيرانا فبي يغترون أم على يجترءون ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب من حديث ابن عمر لا نعرفه إلا من هذا الوجه.",
      "text_en": " Ibn 'Umar narrated that the Prophet(s.a.w) said:                     \"Indeed Allah, Most High, said:'I have created creatures whose tongues are sweeter than honey and their hearts are more bitter than aloes. So by Me, I swear to abase them with a Fitnah, leaving them utterly devoid of reason. Is it Me whom they try to delude, or it is  against Me whom they conspire?'\"",
      "chain": [
        "30296",
        "30377",
        "20159",
        "11183",
        "18"
      ]
    },
    {
      "hadith_no": "3268",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، أخبرنا عبد الرزاق، أخبرنا إبراهيم بن يزيد، قال سمعت محمد بن عباد بن جعفر المخزومي، يحدث عن ابن عمر، قال قام رجل إلى النبي صلى الله عليه وسلم فقال من الحاج يا رسول الله قال ‏\"‏ الشعث التفل ‏\"‏ ‏.‏ فقام رجل آخر فقال أى الحج أفضل قال ‏\"‏ العج والثج ‏\"‏ ‏.‏ فقام رجل آخر فقال ما السبيل يا رسول الله قال ‏\"‏ الزاد والراحلة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث لا نعرفه من حديث ابن عمر إلا من حديث إبراهيم بن يزيد الخوزي المكي ‏.‏ وقد تكلم بعض أهل الحديث في إبراهيم بن يزيد من قبل حفظه ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     \"A man stood before the Prophet (ﷺ) and said: 'Who is the (real) Hajj pilgrim, O Messenger of Allah!' He said: 'The one with dishevelled hair who smells bad.' So another man stood and said: 'Which Hajj is most virtuous, O Messenger of Allah?' He said: 'The one with loud voices and blood (of the sacrifice).' Another man stood and said: 'What is 'the means', O Messenger of Allah?' He said: 'Provisions and a mount.'\"",
      "chain": [
        "30553",
        "20121",
        "11322",
        "30377",
        "18"
      ]
    },
    {
      "hadith_no": "3601",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا أبو كريب، وأبو بكر بندار قالا حدثنا وكيع، عن سفيان، عن زياد بن إسماعيل، عن محمد بن عباد بن جعفر المخزومي، عن أبي هريرة، قال جاء مشركو قريش يخاصمون النبي صلى الله عليه وسلم في القدر فنزلت ‏:‏ ‏(‏ يوم يسحبون في النار على وجوههم ذوقوا مس سقر * إنا كل شيء خلقناه بقدر ‏)‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     \"The idolaters of the Quraish came to the Messenger of Allah (ﷺ) arguing about Qadar, so the following was revealed: The day they will be dragged on their faces into the Fire. Taste you the touch of Hell! Verily, We have created all things with Qadar (54:48 & 49).\"",
      "chain": [
        "30216",
        "20032",
        "20012",
        "10637",
        "30377",
        "13"
      ]
    },
    {
      "hadith_no": "776",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Qiblah - كتاب القبلة",
      "chapter_no": "9",
      "text_ar": "أخبرنا عبيد الله بن سعيد، وشعيب بن يوسف، عن يحيى، عن ابن جريج، قال أخبرني محمد بن عباد، عن عبد الله بن سفيان، عن عبد الله بن السائب، أن رسول الله صلى الله عليه وسلم صلى يوم الفتح فوضع نعليه عن يساره ‏.‏",
      "text_en": " It was narrated from Abdullah bin As Saib that the Messenger of Allah(ﷺ) prayed on the day of Conquest (of Makkah), and he put his sandals to his left.",
      "chain": [
        "30359",
        "20031",
        "11070",
        "30377",
        "2065"
      ]
    },
    {
      "hadith_no": "1007",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا خالد، قال حدثنا ابن جريج، قال أخبرني محمد بن عباد، حديثا رفعه إلى ابن سفيان عن عبد الله بن السائب، قال حضرت رسول الله صلى الله عليه وسلم يوم الفتح فصلى في قبل الكعبة فخلع نعليه فوضعهما عن يساره فافتتح بسورة المؤمنين فلما جاء ذكر موسى أو عيسى - عليهما السلام - أخذته سعلة فركع ‏.‏",
      "text_en": " It was narrated that Abdullah bin As-Sa'ib said:                     \"I was with the Messenger of Allah (ﷺ) on the day of the Conquest (of Makkah). He prayed in front of the Ka'bah. He took off his shoes and placed them to his left, and he started to recite Surat Al-Mu'minun. When he reached the passage that mentions Musa and 'Eisa, peace be upon them both, he started coughing, then he bowed.\"",
      "chain": [
        "30449",
        "20423",
        "11070",
        "30377",
        "2065"
      ]
    },
    {
      "hadith_no": "1259",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو داود، سليمان بن توبة أنبأنا محمد بن عباد، حدثنا يحيى بن سليم، عن عبيد الله، عن نافع، عن ابن عمر، أن النبي  صلى الله عليه وسلم  قال لأبي بكر ‏.‏ فذكر نحوه ‏.‏",
      "text_en": "",
      "chain": [
        "30377",
        "20204",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1498",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يحيى بن سعيد، عن ابن جريج، عن محمد بن عباد، عن عبد الله بن سفيان، عن عبد الله بن السائب، قال رأيت رسول الله  صلى الله عليه وسلم  صلى يوم الفتح فجعل نعليه عن يساره ‏.‏",
      "text_en": " It wasnarrated that ‘Abdullah bin Sa’ib said:                      “I saw the MessengerofAllah (ﷺ) praying on the Day of the Conquest, and he put hisshowson his left.”",
      "chain": [
        "30201",
        "20031",
        "11070",
        "30377",
        "2065"
      ]
    },
    {
      "hadith_no": "3008",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا هشام بن عمار، حدثنا مروان بن معاوية، ح وحدثنا علي بن محمد، وعمرو بن عبد الله، قالا حدثنا وكيع، حدثنا إبراهيم بن يزيد المكي، عن محمد بن عباد بن جعفر المخزومي، عن ابن عمر، قال قام رجل إلى النبي  صلى الله عليه وسلم  فقال يا رسول الله ما يوجب الحج قال ‏\"‏ الزاد والراحلة ‏\"‏ ‏.‏ قال يا رسول الله فما الحاج قال ‏\"‏ الشعث التفل ‏\"‏ ‏.‏ وقام آخر فقال يا رسول الله وما الحج قال ‏\"‏ العج والثج ‏\"‏ ‏.‏ قال وكيع يعني بالعج العجيج بالتلبية والثج نحر البدن ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Umar said:                      “A man stood up and said to theProphet (ﷺ): ‘O Messenger of Allah! What makes Hajj obligatory?’Hesaid: ‘Provision and a mount.’ He said: ‘O Messenger ofAllah, what isthe (real) Hajj?’ He said: ‘The one withdishevelled hair and noperfume.’ Another (man) stood up and said:‘O Messenger of Allah, whatis the (real) Hajj?’ He said:‘Raising one’s voice and slaughteringthe sacrificial animal.’”",
      "chain": [
        "30288",
        "20201",
        "38409",
        "20032",
        "11322",
        "30377",
        "18"
      ]
    }
  ],
  "total_hadiths": 56
}