{
  "id": "30375",
  "name": "Muhammad bin Rafa'i محمد بن رافع",
  "full_name": "Muhammad bin Rafa'i محمد بن رافع",
  "grade": "3rd Century AH [11th generation]",
  "biography": {
    "birth": {
      "date_hijri": "170",
      "date_gregorian": "NA",
      "date_display": [
        "170 AH"
      ],
      "place": ""
    },
    "death": {
      "date_hijri": "245",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Nisapur"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  م  د  ت  س  -  ثقة ]"
    ],
    "tags": [
      "al-Qushayri",
      "Client",
      "al-Nisapuri",
      "Zahid"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20354",
      "name": "Muhammad bin Khazim al-Darir محمد بن خازم أبو معاوية الضرير",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20355",
      "name": "Muhammad bin 'Abdullah bin al-Zubair محمد بن عبد الله أبو أحمد الزبيري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20547",
      "name": "Sulaiman bin Da'ud bin al-Jarud سليمان بن داود أبو داود الطيالسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20318",
      "name": "Hammad bin Usamah حماد بن أسامة - أبو أسامة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20443",
      "name": "Abu 'Amir al-'Aqdi عبد الملك بن عمرو القيسي أبو عامر العقدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20650",
      "name": "Zayd bin al-Habab al-'Akli زيد بن الحباب أبو الحسين العكلي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20121",
      "name": "'Abdur-Razzaq عبد الرزاق بن همام",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "28276",
      "name": "'Abdullah bin Ibrahim عبد الله بن إبراهيم بن عمر",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "28015",
      "name": "Ibrahim bin 'Amr إبراهيم بن عمرو ويقال",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20310",
      "name": "Ishaq bin Sulaiman al-Razi إسحاق بن سليمان الرازي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "38114",
      "name": "Isma'il bin 'Umar إسماعيل بن عمر",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "20630",
      "name": "Ishaq bin 'Isa bin Njyh إسحاق بن عيسى بن نجيح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20382",
      "name": "Hajayn bin al-Muthna حجين بن المثني",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30464",
      "name": "Zakaria bin 'Ady bin Zarayn زكريا بن عدي بن زريق",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30250",
      "name": "Surayj bin al-Nu'man al-Juhari سريج بن النعمان الجوهري اللؤلؤي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20426",
      "name": "Shababa bin Sawar شبابة بن سوار الفزاري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20440",
      "name": "'Abdur Rahman bin Ghazwan,Qard Abu Nuh عبد الرحمن بن غزوان - قراد أبو نوح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20608",
      "name": "Mus'ab bin al-Mqdam al-Khth'my مصعب بن المقدام الخثعمي مولاهم أبو عبد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "26529",
      "name": "Hisham bin Sa'id al-Talaqani هشام بن سعيد الطالقاني أبو أحمد البزاز",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20364",
      "name": "Yahya bin Aadm bin Sulaiman يحيى بن آدم بن سليمان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30525",
      "name": "Yahya bin Ishaq يحيى بن إسحاق",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20254",
      "name": "Abu Bakr al-Hanfi عبد الكبير بن عبد المجيد- أبو بكر الحنفي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "18063",
      "name": "Awys bin Abi Awys Adyd أويس بن أبي أويس عديد",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]"
    },
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "30005",
      "name": "Imam Tirmidhi الترمذي محمد بن عيسى بن سورة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30006",
      "name": "Imam Nasa'i أحمد بن شعيب بن علي بن سنان النسائي",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30554",
      "name": "Abu Zara' al-Razi أبو زرعة الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38552",
      "name": "Muhammad bin 'Aqeel محمد بن عقيل",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30023",
      "name": "Muhammad bin Yahya bin Faris al-Dhahli محمد بن يحيى بن فارس الذهلي",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "2701",
      "source": " Sahih Bukhari ",
      "chapter": "Peacemaking - كتاب الصلح",
      "chapter_no": "53",
      "text_ar": "حدثنا محمد بن رافع، حدثنا سريج بن النعمان، حدثنا فليح، عن نافع، عن ابن عمر، رضى الله عنهما أن رسول الله صلى الله عليه وسلم خرج معتمرا، فحال كفار قريش بينه وبين البيت، فنحر هديه، وحلق رأسه بالحديبية، وقاضاهم على أن يعتمر العام المقبل، ولا يحمل سلاحا عليهم إلا سيوفا، ولا يقيم بها إلا ما أحبوا، فاعتمر من العام المقبل فدخلها كما كان صالحهم، فلما أقام بها ثلاثا أمروه أن يخرج فخرج‏.‏",
      "text_en": " Narrated Ibn `Umar:                     Allah's Apostle set out for the `Umra but the pagans of Quraish prevented him from reaching the Ka`ba. So, he slaughtered his sacrifice and got his head shaved at Al-Hudaibiya, and agreed with them that he would perform `Umra the following year and would not carry weapons except swords and would not stay in Mecca except for the period they allowed. So, the Prophet performed the `Umra in the following year and entered Mecca according to the treaty, and when he stayed for three days, the pagans ordered him to depart, and he departed.",
      "chain": [
        "30375",
        "30250",
        "20169",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3751",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا محمد بن رافع، حدثنا حسين، عن زائدة، عن أبي حصين، عن سعد بن عبيدة، قال جاء رجل إلى ابن عمر، فسأله عن عثمان،، فذكر عن محاسن، عمله، قال لعل ذاك يسوؤك‏.‏ قال نعم‏.‏ قال فأرغم الله بأنفك‏.‏ ثم سأله عن علي، فذكر محاسن عمله قال هو ذاك، بيته أوسط بيوت النبي صلى الله عليه وسلم‏.‏ ثم قال لعل ذاك يسوؤك‏.‏ قال أجل‏.‏ قال فأرغم الله بأنفك، انطلق فاجهد على جهدك‏.‏",
      "text_en": " Narrated Sa`d bin 'Ubaida:                     A man came to Ibn `Umar and asked about `Uthman and Ibn `Umar mentioned his good deeds and said to the questioner. \"Perhaps these facts annoy you?\" The other said, \"Yes.\" Ibn `Umar said, \"May Allah stick your nose in the dust (i.e. degrade you)!' Then the man asked him about `Ali. Ibn `Umar mentioned his good deeds and said, \"It is all true, and that is his house in the midst of the houses of the Prophet. Perhaps these facts have hurt you?\" The questioner said, \"Yes.\" Ibn `Umar said, \"May Allah stick your nose in the dust (i.e. degrade you or make you do things which you hate) ! Go away and do whatever you can against me.\"",
      "chain": [
        "30375",
        "11278",
        "20320",
        "11371",
        "11344"
      ]
    },
    {
      "hadith_no": "4213",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني محمد بن رافع، حدثنا شبابة بن سوار أبو عمرو الفزاري، حدثنا شعبة، عن قتادة، عن سعيد بن المسيب، عن أبيه، قال لقد رأيت الشجرة، ثم أتيتها بعد فلم أعرفها‏.‏ قال محمود ثم أنسيتها بعد‏.‏",
      "text_en": " Narrated Sa`id bin Al-Musaiyab:                     That his father said, \"I saw the Tree (of the Ar-Ridwan Pledge of allegiance and when I returned to it later, I was not able to recognize it. (The sub--narrator MahmiJd said, Al-Musaiyab said, 'Then; forgot it (i.e., the Tree).)\"",
      "chain": [
        "30375",
        "20426",
        "20020",
        "11019",
        "11002",
        "2070"
      ]
    },
    {
      "hadith_no": "4297",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني محمد بن رافع، حدثنا سريج، حدثنا فليح، ح وحدثني محمد بن الحسين بن إبراهيم، قال حدثني أبي، حدثنا فليح بن سليمان، عن نافع، عن ابن عمر  رضى الله عنهما أن رسول الله صلى الله عليه وسلم خرج معتمرا، فحال كفار قريش بينه وبين البيت، فنحر هديه، وحلق رأسه بالحديبية، وقاضاهم على أن يعتمر العام المقبل، ولا يحمل سلاحا عليهم إلا سيوفا، ولا يقيم بها إلا ما أحبوا، فاعتمر من العام المقبل، فدخلها كما كان صالحهم، فلما أن أقام بها ثلاثا أمروه أن يخرج، فخرج‏.‏",
      "text_en": " Narrated Ibn `Umar:                     Allah's Apostle set out with the intention of performing `Umra, but the infidels of Quraish intervened between him and the Ka`ba, so the Prophet slaughtered his Hadi (i.e. sacrificing animals and shaved his head at Al-Hudaibiya and concluded a peace treaty with them (i.e. the infidels) on condition that he would perform the `Umra the next year and that he would not carry arms against them except swords, and would not stay (in Mecca) more than what they would allow. So the Prophet performed the `Umra in the following year and according to the peace treaty, he entered Mecca, and when he had stayed there for three days, the infidels ordered him to leave, and he left.",
      "chain": [
        "30375",
        "20169",
        "30267",
        "30247",
        "20169",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "18",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "وحدثني محمد بن رافع، حدثنا عبد الرزاق، أخبرنا معمر، عن ابن طاوس، عن أبيه، عن عبد الله بن عمرو بن العاص، قال إن في البحر شياطين مسجونة أوثقها سليمان يوشك أن تخرج فتقرأ على الناس قرآنا ‏.‏",
      "text_en": "",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11433",
        "11053",
        "29"
      ]
    },
    {
      "hadith_no": "20",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "وحدثني محمد بن رافع، حدثنا عبد الرزاق، أخبرنا معمر، عن ابن طاوس، عن أبيه، عن ابن عباس، قال إنما كنا نحفظ الحديث والحديث يحفظ عن رسول الله صلى الله عليه وسلم فأما إذ ركبتم كل صعب وذلول فهيهات ‏.‏",
      "text_en": "",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "70",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "وحدثني محمد بن رافع، وحجاج بن الشاعر، قالا حدثنا عبد الرزاق، قال قال معمر ما رأيت أيوب اغتاب أحدا قط إلا عبد الكريم - يعني أبا أمية - فإنه ذكره فقال رحمه الله كان غير ثقة لقد سألني عن حديث لعكرمة ثم قال سمعت عكرمة ‏.‏",
      "text_en": "",
      "chain": [
        "30375",
        "38834",
        "20121"
      ]
    },
    {
      "hadith_no": "129",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثني محمد بن بكار البصري، حدثنا أبو عاصم، عن ابن جريج، ح وحدثني محمد بن رافع، - واللفظ له - حدثنا عبد الرزاق، أخبرنا ابن جريج، قال أخبرني أبو قزعة، أن أبا نضرة، أخبره وحسنا، أخبرهما أن أبا سعيد الخدري أخبره أن وفد عبد القيس لما أتوا نبي الله صلى الله عليه وسلم قالوا يا نبي الله جعلنا الله فداءك ماذا يصلح لنا من الأشربة فقال ‏\"‏ لا تشربوا في النقير ‏\"‏ ‏.‏ قالوا يا نبي الله جعلنا الله فداءك أوتدري ما النقير قال ‏\"‏ نعم الجذع ينقر وسطه ولا في الدباء ولا في الحنتمة وعليكم بالموكى ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Said al-Khudri that when the delegation of the tribe of Abdul-Qais came to the Prophet of Allah (may peace be upon him), (its members) said:                      Apostle of Allah, may God enable us to lay down our lives for you, which beverage is good for us? He (the Prophet) said: (Not to speak of beverages, I would lay stress) that you should not drink in the wine jars. They said: Apostle of Allah, may God enable us to lay down our lives for you, do you know what al-naqir is? He (the Holy Prophet) replied: Yes, it is a stump which you hollow out in the middle, and added: Do not use gourd or receptacle (for drink). Use water-skin the mouth of which is tied with a thong (for this purpose).",
      "chain": [
        "30512",
        "20241",
        "11070",
        "30375",
        "20121",
        "11070",
        "10689",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "215",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا محمد بن رافع، حدثنا عبد الرزاق، أخبرنا معمر، عن همام بن منبه، عن أبي هريرة، عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": "",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "218",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثني محمد بن رافع، حدثنا عبد الرزاق، أخبرنا سفيان، عن الأعمش، عن ذكوان، عن أبي هريرة، رفعه قال ‏\"‏ لا يزني الزاني ‏\"‏ ‏.‏ ثم ذكر بمثل حديث شعبة ‏.‏",
      "text_en": " Muhammad b. Rafi', Abdur-Razzaq, Sufyan, A'mash narrated this hadith like one narrated by Shu'ba, on the authority of Abu Huraira tracing, it (right to the Holy Prophet).",
      "chain": [
        "30375",
        "20121",
        "20012",
        "11060",
        "11161"
      ]
    },
    {
      "hadith_no": "261",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن رافع، وعبد بن حميد، قال عبد أخبرنا وقال ابن رافع، حدثنا عبد الرزاق، أخبرنا معمر، عن الزهري، عن حبيب، مولى عروة بن الزبير عن عروة بن الزبير، عن أبي مراوح، عن أبي ذر، عن النبي صلى الله عليه وسلم بنحوه غير أنه قال ‏\"‏ فتعين الصانع أو تصنع لأخرق ‏\"‏ ‏.‏",
      "text_en": " Muhammad b. Abu Rafi' narrated the hadith on the authority of Abu Dharr with a slight difference.",
      "chain": [
        "30375",
        "30553",
        "20121",
        "20115",
        "11013",
        "10511",
        "23"
      ]
    },
    {
      "hadith_no": "285",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا إسحاق بن إبراهيم، وعبد بن حميد، قالا أخبرنا عبد الرزاق، قال أخبرنا معمر، ح وحدثنا إسحاق بن موسى الأنصاري، حدثنا الوليد بن مسلم، عن الأوزاعي، ح وحدثنا محمد بن رافع، حدثنا عبد الرزاق، أخبرنا ابن جريج، جميعا عن الزهري، بهذا الإسناد أما الأوزاعي وابن جريج ففي حديثهما قال أسلمت لله ‏.‏ كما قال الليث في حديثه ‏.‏ وأما معمر ففي حديثه فلما أهويت لأقتله قال لا إله إلا الله ‏.‏",
      "text_en": " The same hadith has been transmitted by the same chain of narrators. The hadith transmitted by Auza'i and Ibn Juraij contains these words:                      I embraced Islam for Allah's sake. and in the hadith narrated by Ma'mar the words are: I knelt down to kill him, that he said; There is no god but Allah.",
      "chain": [
        "30123",
        "30553",
        "20121",
        "20115",
        "30410",
        "20733",
        "20024",
        "30375",
        "20121"
      ]
    },
    {
      "hadith_no": "318",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا محمد بن رافع، عن عبد الرزاق، عن الثوري، عن خالد الحذاء، عن أبي قلابة، عن ثابت بن الضحاك، قال قال النبي صلى الله عليه وسلم ‏\"‏ من حلف بملة سوى الإسلام كاذبا متعمدا فهو كما قال ومن قتل نفسه بشىء عذبه الله به في نار جهنم ‏\"‏ ‏.‏ هذا حديث سفيان ‏.‏ وأما شعبة فحديثه أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من حلف بملة سوى الإسلام كاذبا فهو كما قال ومن ذبح نفسه بشىء ذبح به يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " In the hadith narrated by Shu'ba the words are:                      Verily the Messenger of Allah (may peace be upon him) said: He who took an oath on a religion other than Islam as a liar would become so as he said, and he who slaughtered himself with a thing would be slaughtered with that on the Day of Resurrection.",
      "chain": [
        "30375",
        "20121",
        "20012",
        "11282",
        "11047",
        "1902"
      ]
    },
    {
      "hadith_no": "319",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا محمد بن رافع، وعبد بن حميد، جميعا عن عبد الرزاق، - قال ابن رافع حدثنا عبد الرزاق، - أخبرنا معمر، عن الزهري، عن ابن المسيب، عن أبي هريرة، قال شهدنا مع رسول الله صلى الله عليه وسلم حنينا فقال لرجل ممن يدعى بالإسلام ‏\"‏ هذا من أهل النار ‏\"‏ فلما حضرنا القتال قاتل الرجل قتالا شديدا فأصابته جراحة فقيل يا رسول الله الرجل الذي قلت له آنفا ‏\"‏ إنه من أهل النار ‏\"‏ فإنه قاتل اليوم قتالا شديدا وقد مات ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ إلى النار ‏\"‏ فكاد بعض المسلمين أن يرتاب فبينما هم على ذلك إذ قيل إنه لم يمت ولكن به جراحا شديدا فلما كان من الليل لم يصبر على الجراح فقتل نفسه فأخبر النبي صلى الله عليه وسلم بذلك فقال ‏\"‏ الله أكبر أشهد أني عبد الله ورسوله ‏\"‏ ‏.‏ ثم أمر بلالا فنادى في الناس ‏\"‏ إنه لا يدخل الجنة إلا نفس مسلمة وإن الله يؤيد هذا الدين بالرجل الفاجر ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Huraira:                      We participated in the Battle of Hunain along with the Messenger of Allah (may peace be upon him). He (the Holy Prophet) said about a man who claimed to be a Muslim that he was one of the denizens of the Fire (of Hell). When we were in the thick of the battle that man fought desperately and was wounded. It was said: Messenger of Allah, the person whom you at first called as the denizen of Fire fought desperately and died. Upon this the Apostle of Allah (may peace be upon him) remarked: He was doomed to the Fire (of Hell). Some men were on the verge of doubt (about his fate) when it was said that he was not dead but fatally wounded. When it was night he could not stand the (pain of his) wound and killed himself. The Apostle (may peace be upon him) was informed of that. He (the Holy Prophet) observed: Allah is Great, I bear testimony to the fact that I am the servant of Allah and His messenger. He then commanded Bilal to announce to the people that none but a Muslim would enter Paradise. Verily Allah helps this faith even by a sinful person.",
      "chain": [
        "30375",
        "30553",
        "20121",
        "20121",
        "20115",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "321",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثني محمد بن رافع، حدثنا الزبيري، - وهو محمد بن عبد الله بن الزبير - حدثنا شيبان، قال سمعت الحسن، يقول ‏\"‏ إن رجلا ممن كان قبلكم خرجت به قرحة فلما آذته انتزع سهما من كنانته فنكأها فلم يرقإ الدم حتى مات ‏.‏ قال ربكم قد حرمت عليه الجنة ‏\"‏ ‏.‏ ثم مد يده إلى المسجد فقال إي والله لقد حدثني بهذا الحديث جندب عن رسول الله صلى الله عليه وسلم في هذا المسجد ‏.‏",
      "text_en": " It is reported on the authority of Hasan:                      A person belonging to the people of the past suffered from a boil, when it pained him, he drew out an arrow from the quiver and pierced it. And the bleeding did not stop till he died. Your Lord said: I forbade his entrance into Paradise. Then he (Hasan) stretched his hand towards the mosque and said: By God, Jundab transmitted this hadith to me from the Messenger of Allah (may peace be upon him) in this very mosque.",
      "chain": [
        "30375",
        "20240",
        "11016"
      ]
    },
    {
      "hadith_no": "351",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا محمد بن رافع، حدثنا عبد الرزاق، أخبرنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن محمد، رسول الله صلى الله عليه وسلم فذكر أحاديث منها قال قال رسول الله صلى الله عليه وسلم ‏\"‏ قال الله عز وجل إذا تحدث عبدي بأن يعمل حسنة فأنا أكتبها له حسنة ما لم يعمل فإذا عملها فأنا أكتبها بعشر أمثالها وإذا تحدث بأن يعمل سيئة فأنا أغفرها له ما لم يعملها فإذا عملها فأنا أكتبها له بمثلها ‏\"‏ ‏.‏  وقال رسول الله صلى الله عليه وسلم ‏\"‏ قالت الملائكة رب ذاك عبدك يريد أن يعمل سيئة - وهو أبصر به - فقال ارقبوه فإن عملها فاكتبوها له بمثلها ‏.‏ وإن تركها فاكتبوها له حسنة - إنما تركها من جراى ‏\"‏ ‏.‏  وقال رسول الله صلى الله عليه وسلم ‏\"‏ إذا أحسن أحدكم إسلامه فكل حسنة يعملها تكتب بعشر أمثالها إلى سبعمائة ضعف وكل سيئة يعملها تكتب بمثلها حتى يلقى الله ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported that Muhammad, the Messenger of Allah (may peace be upon him), said:                      When it occurs to my bondsman that he should do a good deed but he actually does not do it, record one good to him, but if he puts it into practice, I make an entry of ten good acts in his favour. When it occurs to him to do evil, but he does not commit it, I forgive that. But if he commits it, I record one evil against his name. The Messenger of Allah (may peace be upon him) observed. The angels said: That bondsman of Yours intends to commit evil. though His Lord is more Vigilant than he. Upon this He (the Lord) said: Watch him; if he commits (evil), write it against his name but if he refrains from doing it, write one good deed or him, for he desisted from doing it for My sake. The Messenger of Allah said: He who amongst you is good of faith, all his good acts are multiplied from ten to seven hundred times (and are recorded in his name) and all the evils that he commits are recorded as such (i, e. without increase) till he meets Allah.",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "378",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثني الحسن بن علي الحلواني، وإسحاق بن منصور، ومحمد بن رافع، - وألفاظهم متقاربة - قال إسحاق أخبرنا وقال الآخران، حدثنا عبد الرزاق، أخبرنا ابن جريج، قال أخبرني سليمان الأحول، أن ثابتا، مولى عمر بن عبد الرحمن أخبره أنه، لما كان بين عبد الله بن عمرو وبين عنبسة بن أبي سفيان ما كان تيسروا للقتال فركب خالد بن العاص إلى عبد الله بن عمرو فوعظه خالد فقال عبد الله بن عمرو أما علمت أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من قتل دون ماله فهو شهيد ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Thabit, that when 'Abdullah b. 'Amr and 'Anbasa b. Abi Sufyan were about to fight against each other, Khalid b. 'As rode to 'Abdullah b. 'Amr and persuaded him (not to do so). Upon this Abdullah b. 'Amr said:                      Are you not aware that the Messenger of Allah (may peace be upon him) had observed:\" He who died in protecting his property is a martyr.\" This hadith has been narrated by Muhammad b. Hatim, Muhammad b. Bakr, Ahmad b. 'Uthman Naufali, Abu 'Asim, Ibn Juraij.",
      "chain": [
        "30115",
        "30313",
        "30375",
        "30312",
        "20121",
        "11070",
        "11247"
      ]
    },
    {
      "hadith_no": "390",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني محمد بن رافع، والفضل بن سهل الأعرج، قالا حدثنا شبابة بن سوار، حدثنا عاصم، - وهو ابن محمد العمري - عن أبيه، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن الإسلام بدأ غريبا وسيعود غريبا كما بدأ وهو يأرز بين المسجدين كما تأرز الحية في جحرها ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Ibn 'Umar ('Abdullah b. 'Umar) that the Messenger of Allah (may peace be upon him) observed:                      Verily Islam started as something strange and it would again revert (to its old position) of being strange just as it started, and it would recede between the two mosques just as the serpent crawls back into its hole.",
      "chain": [
        "30375",
        "30264",
        "20426",
        "20163",
        "11217",
        "18"
      ]
    },
    {
      "hadith_no": "416",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا محمد بن رافع، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، عن أبي هريرة، عن النبي صلى الله عليه وسلم بمثل حديث العلاء عن أبيه عن أبي هريرة عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": "",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "423",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني محمد بن رافع، حدثنا عبد الرزاق، أخبرنا معمر، قال قال الزهري وأخبرني عروة، عن عائشة، أنها قالت أول ما بدئ به رسول الله صلى الله عليه وسلم من الوحى ‏.‏ وساق الحديث بمثل حديث يونس ‏.‏ غير أنه قال فوالله لا يحزنك الله أبدا ‏.‏ وقال قالت خديجة أى ابن عم اسمع من ابن أخيك ‏.‏",
      "text_en": " This hadith has been narrated on the authority of 'A'isha with another chain of narrators like one transmitted by Yunus, i. e. the first thing with which the revelation was initiated with the Messenger of Allah (may peace be upon him) except the words:                      By Allah, Allah would never humiliate you, and Khadija said: O son of my uncle! Listen to the son of your brother.",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "426",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني محمد بن رافع حدثنا عبد الرزاق أخبرنا معمر عن الزهري بهذا الإسناد نحو حديث يونس وقال فأنزل الله تبارك وتعالى ‏{‏ يا أيها المدثر‏}‏ إلى قوله ‏{‏ والرجز فاهجر‏}‏ قبل أن تفرض الصلاة - وهي الأوثان - وقال ‏\"‏ فجثثت منه ‏\"‏ ‏.‏ كما قال عقيل",
      "text_en": " This hadith, the like of one narrated by Yunus has also been transmitted by Ma'mar on the authority of al-Zuhri who narrated:                      Allah the Most Glorious and Exalted revealed this:\" You who are shrouded, arise and deliver warning, your Lord magnify, your clothes cleanse and defilement shun,\" before making the prayer obligatory. I felt terror-stricken as narrated by Uqail.",
      "chain": [
        "30375",
        "20121",
        "20115"
      ]
    },
    {
      "hadith_no": "442",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني محمد بن رافع، وعبد بن حميد، - وتقاربا في اللفظ - قال ابن رافع حدثنا وقال عبد، أخبرنا عبد الرزاق، أخبرنا معمر، عن الزهري، قال أخبرني سعيد بن المسيب، عن أبي هريرة، قال قال النبي صلى الله عليه وسلم ‏\"‏ حين أسري بي لقيت موسى - عليه السلام - ‏\"‏ ‏.‏ فنعته النبي صلى الله عليه وسلم ‏\"‏ فإذا رجل - حسبته قال - مضطرب رجل الرأس كأنه من رجال شنوءة - قال - ولقيت عيسى ‏\"‏ ‏.‏ فنعته النبي صلى الله عليه وسلم ‏\"‏ فإذا ربعة أحمر كأنما خرج من ديماس ‏\"‏ ‏.‏ - يعني حماما - قال ‏\"‏ ورأيت إبراهيم - صلوات الله عليه - وأنا أشبه ولده به - قال - فأتيت بإناءين في أحدهما لبن وفي الآخر خمر فقيل لي خذ أيهما شئت ‏.‏ فأخذت اللبن فشربته ‏.‏ فقال هديت الفطرة أو أصبت الفطرة أما إنك لو أخذت الخمر غوت أمتك ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Huraira that the Apostle of Allah (may peace be upon him) said:                      When I was taken for the night journey I met Moses peace be upon him). The Apostle of Allah (may peace be upon him) gave his description thus: He was a man, I suppose-and he (the narrator) was somewhat doubtful (that the Holy Prophet observed): (Moses) was a man erect in stature with straight hair on his head as it he was one of the men of the Shanu'a; and I met Jesus and the Apostle of Allah (may peace be upon him) described him as one having a medium stature and a red complexion as if he had (just) come out of the bath He observed: I saw Ibrahim (peace be upon him) and amongst his children I have the greatest resemblance with him. He said: There were brought to me two vessels. In one of them was milk and in the other one there was wine. And it was said to me: Select any one you like. So I selected the vessel containing milk and drank it. He (the angel) said: You have been guided on al-fitra or you have attained al-fitra. Had you selected wine, your Ummah would have been misled.",
      "chain": [
        "30375",
        "30553",
        "20121",
        "20115",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "471",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا محمد بن رافع، حدثنا عبد الرزاق، أخبرنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن رسول الله صلى الله عليه وسلم ‏.‏ فذكر أحاديث منها وقال رسول الله صلى الله عليه وسلم ‏\"‏ إن أدنى مقعد أحدكم من الجنة أن يقول له تمن ‏.‏ فيتمنى ويتمنى فيقول له هل تمنيت فيقول نعم ‏.‏ فيقول له فإن لك ما تمنيت ومثله معه ‏\"‏ ‏.‏",
      "text_en": " Hammam b. Munabbih said:                      This is what Abu Huraira transmitted to us from the Messenger of Allah (may peace be upon him), and he narrated many of them;- one of them was: The Messenger of Allah (may peace be upon him) said: The lowest in rank among you in Paradise would be asked: Desire (whatever you like). And he would express his desire and again and again express a desire. tHe would be asked: Have you expressed your desire? He would say: Yes. Then He (Allah) would say: For thee is (granted) what thou desirest, and the like of it along with it.",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "225",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن رافع، حدثنا عبد الرزاق بن همام، حدثنا معمر بن راشد، عن همام بن منبه، أخي وهب بن منبه قال هذا ما حدثنا أبو هريرة، عن محمد، رسول الله صلى الله عليه وسلم ‏.‏ فذكر أحاديث منها وقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تقبل صلاة أحدكم إذا أحدث حتى يتوضأ ‏\"‏ ‏.‏",
      "text_en": " Hammam b. Munabbih who is the brother of Wahb b. Munabbih said:                      This is what has been transmitted to us by Abu Huraira from Muhammad, the Messenger of Allah (may peace be upon him) and then narrated a hadith out of them and observed that the Messenger of Allah (may peace be upon him) said: The prayer of none amongst you would be accepted in a state of impurity until he performs ablution.",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "237",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثني محمد بن رافع، حدثنا عبد الرزاق بن همام، أخبرنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن محمد، رسول الله صلى الله عليه وسلم فذكر أحاديث منها وقال رسول الله صلى الله عليه وسلم ‏\"‏ إذا توضأ أحدكم فليستنشق بمنخريه من الماء ثم لينتثر ‏\"‏ ‏.‏",
      "text_en": " Hammam b. Munabbih reported:                      This is what Abu Huraira transmitted to us from Muhammad, the Messenger of Allah (may peace be upon him), and he mentioned a number of a hadith, of which this is one: that the Messenger of Allah (may peace be upon him) said: When anyone amongst you (performs ablution) he must snuff his nostrils with water and then clean them.",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "239",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا إسحاق بن إبراهيم، ومحمد بن رافع، قال ابن رافع حدثنا عبد الرزاق، أخبرنا ابن جريج، أخبرني أبو الزبير، أنه سمع جابر بن عبد الله، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا استجمر أحدكم فليوتر ‏\"‏ ‏.‏",
      "text_en": " Jabir b. 'Abdullah reported that he heard the Messenger of Allah (may peace be upon him) say:                      When anyone wipes himself with pebbles (after answering the call of nature) he should do this odd number of times.",
      "chain": [
        "30123",
        "30375",
        "20121",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "279",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن رافع، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن محمد، رسول الله صلى الله عليه وسلم ‏.‏ فذكر أحاديث منها وقال رسول الله صلى الله عليه وسلم ‏\"‏ طهور إناء أحدكم إذا ولغ الكلب فيه أن يغسله سبع مرات ‏\"‏ ‏.‏",
      "text_en": " Hammam b. Munabbih reported:                      Of the a hadith narrated by Abu Huraira from Muhammad, the Messenger of Allah (may peace be upon him), one is this: The Messenger of Allah (may peace be upon him) said: The purification of the utensil belonging to one amongst you, after it is licked by a dog, lies in washing it seven times.",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "282",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثنا محمد بن رافع، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن محمد، رسول الله صلى الله عليه وسلم ‏.‏ فذكر أحاديث منها وقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تبل في الماء الدائم الذي لا يجري ثم تغتسل منه ‏\"‏ ‏.‏",
      "text_en": " Hammam b. Munabbih said:                      Of the ahadith narrated to us by Abfi Huraira from Muhammad the Messenger of Allah (may peace be upon him) one is this: The Messenger or Allah (may peace be upon him) said: You should not urinate in standing water, that is not flowing, then wash in it.",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "306",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثنا محمد بن رافع، حدثنا عبد الرزاق، عن ابن جريج، أخبرني نافع، عن ابن عمر، أن عمر، استفتى النبي صلى الله عليه وسلم فقال هل ينام أحدنا وهو جنب قال ‏\"‏ نعم ليتوضأ ثم لينم حتى يغتسل إذا شاء ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Umar said:                      'Umar asked the verdict of the Shari'ah from the Apostle (may peace be upon him) thus: Is it permissible for any one of us to sleep in a state of impurity? He (the Holy Prophet said: Yes, he must perform ablution and then sleep and take a bath when he desires.",
      "chain": [
        "30375",
        "20121",
        "11070",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "321",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثني محمد بن رافع، حدثنا شبابة، حدثنا ليث، عن يزيد، عن عراك، عن حفصة بنت عبد الرحمن بن أبي بكر، - وكانت تحت المنذر بن الزبير - أن عائشة، أخبرتها أنها، كانت تغتسل هي والنبي صلى الله عليه وسلم في إناء واحد يسع ثلاثة أمداد أو قريبا من ذلك ‏.‏",
      "text_en": " Hafsa, daughter of 'Abd al-Rahman b. Abu Bakr, reported that 'A'isha narrated to her that she and the Apostle of Allah (may peace be upon him) took a bath from the same vessel which contained water equal to three Mudds or thereabout.",
      "chain": [
        "30375",
        "20426",
        "20023",
        "20304",
        "11204",
        "53"
      ]
    },
    {
      "hadith_no": "338",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثنيه هارون بن عبد الله، ومحمد بن رافع، قالا حدثنا ابن أبي فديك، أخبرنا الضحاك بن عثمان، بهذا الإسناد وقالا - مكان عورة - عرية الرجل وعرية المرأة ‏.‏",
      "text_en": " This hadith has been narrated by Ibn Abu Fudaik and Dabbik b. 'Uthman with the same chain of transmitters and they observed:                      Private parts of man are the nakedness (which is concealed).",
      "chain": [
        "30375",
        "20172"
      ]
    },
    {
      "hadith_no": "339",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثنا محمد بن رافع، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن محمد، رسول الله صلى الله عليه وسلم فذكر أحاديث منها وقال رسول الله صلى الله عليه وسلم ‏\"‏ كانت بنو إسرائيل يغتسلون عراة ينظر بعضهم إلى سوأة بعض وكان موسى - عليه السلام - يغتسل وحده فقالوا والله ما يمنع موسى أن يغتسل معنا إلا أنه آدر - قال - فذهب مرة يغتسل فوضع ثوبه على حجر ففر الحجر بثوبه - قال - فجمح موسى بإثره يقول ثوبي حجر ثوبي حجر ‏.‏ حتى نظرت بنو إسرائيل إلى سوأة موسى قالوا والله ما بموسى من بأس ‏.‏ فقام الحجر حتى نظر إليه - قال - فأخذ ثوبه فطفق بالحجر ضربا ‏\"‏ ‏.‏ قال أبو هريرة والله إنه بالحجر ندب ستة أو سبعة ضرب موسى بالحجر ‏.‏",
      "text_en": " Amongst the traditions narrated from Muhammad, the Messenger of Allah (may peace be upon him) on the authority of Abu Huraira, the one is that Banu Isra'il used to take a bath naked, and they looked at the private parts of one another. Moses (peace be upon him), however, took a bath alone (in privacy) ; and they said (tauntingly):                      By Allah, nothing prohibits Moses to take a bath along with us, but sacrotal hernia. He (Moses) once went for a bath and placed his clothes on a stone and the stone moved on with his clothes. Moses ran after it saying: 0 stone, my clothes,0 stone, my clothes, and Banu Isra'il had the chance to see the private parts of Moses, and said: By Allah, Moses does not suffer from any ailment. The stone then stopped, till Moses had been seen by them, and he then took hold of his clothes and struck the stone. Abu Huraira said: By Allah, there are the marks of six or seven strokes made by Moses on the stone.",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "340",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثنا إسحاق بن إبراهيم الحنظلي، ومحمد بن حاتم بن ميمون، جميعا عن محمد بن بكر، قال أخبرنا ابن جريج، ح وحدثني إسحاق بن منصور، ومحمد بن رافع، واللفظ، لهما - قال إسحاق أخبرنا وقال ابن رافع، حدثنا عبد الرزاق، - أخبرنا ابن جريج، أخبرني عمرو بن دينار، أنه سمع جابر بن عبد الله، يقول لما بنيت الكعبة ذهب النبي صلى الله عليه وسلم وعباس ينقلان حجارة فقال العباس للنبي صلى الله عليه وسلم اجعل إزارك على عاتقك من الحجارة ‏.‏ ففعل فخر إلى الأرض وطمحت عيناه إلى السماء ثم قام فقال ‏\"‏ إزاري إزاري ‏\"‏ ‏.‏ فشد عليه إزاره ‏.‏ قال ابن رافع في روايته على رقبتك ‏.‏ ولم يقل على عاتقك ‏.‏",
      "text_en": " Jabir b. 'Abdullah reported:                      When the Ka'ba was constructed the Apostle of Allah (may peace be upon him) and Abbas went and lifted stones. Abbas said to the Messenger of Allah (may peace be upon him): Place your lower garment on your shoulder (so that you may protect yourself from the roughness and hardness of stones). He (the Holy Prophet) did this, but fell down upon the ground in a state of unconciousness and his eyes were turned towards the sky. He then stood up and said: My lower garment, my lower garment; and this wrapper was tied around him. In the hadith transmitted by Ibn Rafi', there is the word:\" On his neck\" and he did not say:\" Upon his shoulder.\"",
      "chain": [
        "30021",
        "38487",
        "20277",
        "11070",
        "30313",
        "30375",
        "30312",
        "20121",
        "11070",
        "11081",
        "34"
      ]
    },
    {
      "hadith_no": "377",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا إسحاق بن إبراهيم الحنظلي، حدثنا محمد بن بكر، ح وحدثنا محمد بن رافع، حدثنا عبد الرزاق، قالا أخبرنا ابن جريج، ح وحدثني هارون بن عبد الله، - واللفظ له - قال حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني نافع، مولى ابن عمر عن عبد الله بن عمر، أنه قال كان المسلمون حين قدموا المدينة يجتمعون فيتحينون الصلوات وليس ينادي بها أحد فتكلموا يوما في ذلك فقال بعضهم اتخذوا ناقوسا مثل ناقوس النصارى وقال بعضهم قرنا مثل قرن اليهود فقال عمر أولا تبعثون رجلا ينادي بالصلاة قال رسول الله صلى الله عليه وسلم ‏\"‏ يا بلال قم فناد بالصلاة ‏\"‏ ‏.‏",
      "text_en": " Ibn Umar reported:                      When the Muslims came to Medina, they gathered and sought to know the time of prayer but no one summoned them. One day they discussed the matter, and some of them said: Use something like the bell of the Christians and some of them said: Use horn like that of the Jews. Umar said: Why may not a be appointed who should call (people) to prayer? The Messenger of Allah (may peace be upon him) said: O Bilal, get up and summon (the people) to prayer.",
      "chain": [
        "30021",
        "20277",
        "30375",
        "20121",
        "11070",
        "20381",
        "11070",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "389",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن رافع، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، عن أبي هريرة، عن النبي صلى الله عليه وسلم بمثله غير أنه قال ‏\"‏ حتى يظل الرجل إن يدري كيف صلى ‏\"‏ ‏.‏",
      "text_en": " A hadith like it has been narrated by Abu Huraira but for these words:                     \" He (the man saying the prayer) does not know how much he has prayed.",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "390",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثني محمد بن رافع، حدثنا عبد الرزاق، أخبرنا ابن جريج، حدثني ابن شهاب، عن سالم بن عبد الله، أن ابن عمر، قال كان رسول الله صلى الله عليه وسلم إذا قام للصلاة رفع يديه حتى تكونا حذو منكبيه ثم كبر فإذا أراد أن يركع فعل مثل ذلك وإذا رفع من الركوع فعل مثل ذلك ولا يفعله حين يرفع رأسه من السجود ‏.‏",
      "text_en": " Ibn Umar reported that the Messenger of Allah (may peace be upon him), when he stood up for prayer, used to raise his hands apposite the shoulders and then recited takbir (Allah-o-Akbar), and when he was about to bow he again did like it and when he raised himself from the ruku' (bowing posture) he again did like it, but he did not do it at the time of raising his head from prostration.",
      "chain": [
        "30375",
        "20121",
        "11070",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "390",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثني محمد بن رافع، حدثنا حجين، - وهو ابن المثنى - حدثنا الليث، عن عقيل، ح وحدثني محمد بن عبد الله بن قهزاذ، حدثنا سلمة بن سليمان، أخبرنا يونس، كلاهما عن الزهري، بهذا الإسناد كما قال ابن جريج كان رسول الله صلى الله عليه وسلم إذا قام للصلاة رفع يديه حتى تكونا حذو منكبيه ثم كبر ‏.‏",
      "text_en": " This hadith has been transmitted with the same chain of transmitters by al. Zuhri as narrated by Ibn Juraij (who) said. When the Messenger of Allah (may peace be upon him) stood up for prayer, he raised hands (to the height) apposite the shoulders and then recited takbir.",
      "chain": [
        "30375",
        "20382",
        "20023",
        "11207",
        "30561",
        "30340",
        "11070"
      ]
    },
    {
      "hadith_no": "392",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن رافع، حدثنا عبد الرزاق، أخبرنا ابن جريج، أخبرني ابن شهاب، عن أبي بكر بن عبد الرحمن، أنه سمع أبا هريرة، يقول كان رسول الله صلى الله عليه وسلم إذا قام إلى الصلاة يكبر حين يقوم ثم يكبر حين يركع ثم يقول ‏\"‏ سمع الله لمن حمده ‏\"‏ ‏.‏ حين يرفع صلبه من الركوع ثم يقول وهو قائم ‏\"‏ ربنا ولك الحمد ‏\"‏ ‏.‏ ثم يكبر حين يهوي ساجدا ثم يكبر حين يرفع رأسه ثم يكبر حين يسجد ثم يكبر حين يرفع رأسه ثم يفعل مثل ذلك في الصلاة كلها حتى يقضيها ويكبر حين يقوم من المثنى بعد الجلوس ثم يقول أبو هريرة إني لأشبهكم صلاة برسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Abu Huraira reported:                      When the Messenger of Allah (may peace be upon him) got up for prayer, he would say the takbir (Allah-o-Akbar) when standing, then say the takbir when bowing. then say:\" Allah listened to him who praised him,\" when coming to the erect position after bowing, then say while standing:\" To Thee, our Lord, be the praise\", then recite the takbir when getting down for prostration, then say the takbir on raising his head, then say the takbir on prostrating himself, then say the takbir on raising his head. He would do that throughout the whole prayer till he would complete it, and he would say the takbir when he would get up at the end of two rak'as after adopting the sitting posture. Abu Huraira said: My prayer has the best resemblance amongst you with the prayer of the Messenger of Allah (may peace be upon him).",
      "chain": [
        "30375",
        "20121",
        "11070",
        "11013",
        "11003",
        "13"
      ]
    },
    {
      "hadith_no": "392",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثني محمد بن رافع، حدثنا حجين، حدثنا الليث، عن عقيل، عن ابن شهاب، أخبرني أبو بكر بن عبد الرحمن بن الحارث، أنه سمع أبا هريرة، يقول كان رسول الله صلى الله عليه وسلم إذا قام إلى الصلاة يكبر حين يقوم بمثل حديث ابن جريج ولم يذكر قول أبي هريرة ‏.‏ إني أشبهكم صلاة برسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Ibn al-Harith reported:                      He had heard Abu Huraira say: The Messenger of Allah (may peace be upon him) recited takbir on standing for prayer, and the rest of the hadith is like that transmitted by Ibn Juraij (recorded above), but he did not mention Abu Huraira as saying:\" My prayer has the best resemblance amongst you with the prayer of the Messenger of Allah (may peace be upon him).\"",
      "chain": [
        "30375",
        "20023",
        "11207",
        "11013",
        "11003",
        "13"
      ]
    },
    {
      "hadith_no": "410",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن رافع، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، عن أبي هريرة، عن النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " 'A hadith like this is transmitted by Ma'mar from Hammam b. Munabbih on the authority of Abu Huraira who reported it from the Apostle of Allah (may peace be upon him).",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "414",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن رافع، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، عن أبي هريرة، عن النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " A hadith like this has been transmitted by Hammam b. Munabbih from the Apostle of Allah (may peace be upon him) on the authority of Abu Huraira.",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "418",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن رافع، وعبد بن حميد، - واللفظ لابن رافع - قالا حدثنا عبد الرزاق، أخبرنا معمر، قال قال الزهري وأخبرني عبيد الله بن عبد الله بن عتبة، أن عائشة، أخبرته قالت، أول ما اشتكى رسول الله صلى الله عليه وسلم في بيت ميمونة فاستأذن أزواجه أن يمرض في بيتها وأذن له - قالت - فخرج ويد له على الفضل بن عباس ويد له على رجل آخر وهو يخط برجليه في الأرض ‏.‏ فقال عبيد الله فحدثت به ابن عباس فقال أتدري من الرجل الذي لم تسم عائشة هو علي ‏.‏",
      "text_en": " 'A'isha reported:                      It was in the house ofMaimuna that the Messenger of Allah (may peace be upon him) first fell ill. He asked permission from his wives to stay in her ('A'isha's) house during his illness. They granted him permission. She ('A'isha) narrated: He (the Holy Prophet) went out (for prayer) with his hand over al-Fadl b. 'Abbas and on the other hand there was another person and (due to weakness) his feet dragged on the earth. 'Ubaidullah said: I narrated this hadith to the son of 'Abbas ('Abdullah b. 'Abbas) and he said: Do you know who the man was whose name 'A'isha did not mention? It was 'Ali.",
      "chain": [
        "30375",
        "30553",
        "20121",
        "20115",
        "11013",
        "11004",
        "53"
      ]
    },
    {
      "hadith_no": "418",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن رافع، وعبد بن حميد، - واللفظ لابن رافع - قال عبد أخبرنا وقال ابن رافع، حدثنا عبد الرزاق، - أخبرنا معمر، قال الزهري وأخبرني حمزة بن عبد الله بن عمر، عن عائشة، قالت لما دخل رسول الله صلى الله عليه وسلم بيتي قال ‏\"‏ مروا أبا بكر فليصل بالناس ‏\"‏ ‏.‏ قالت فقلت يا رسول الله إن أبا بكر رجل رقيق إذا قرأ القرآن لا يملك دمعه فلو أمرت غير أبي بكر ‏.‏ قالت والله ما بي إلا كراهية أن يتشاءم الناس بأول من يقوم في مقام رسول الله صلى الله عليه وسلم قالت فراجعته مرتين أو ثلاثا فقال ‏\"‏ ليصل بالناس أبو بكر فإنكن صواحب يوسف ‏\"‏ ‏.‏",
      "text_en": " 'A'isha reported:                      When the Messenger of Allah (may peace be upon him) came to my house, he said: Ask Abu Bakr to lead people in prayer. 'A'isha narrated: I said, Messenger of Allah, Abu Bakr is a man of tenderly feelings; as he recites the Qur'an, he cannot help shedding tears: so better command anyone else to lead the prayer. By Allah, there is nothing disturbing in it for me but the idea that the people may not takeevil omen with regard to one who is the first to occupy the place of the Messenger of Allah (may peace be upon him). I tried to dissuade him (the Holy Prophet) twice or thrice (from appointing my father as an Imam in prayer), but he ordered Abu Bakr to lead the people in prayer and said: You women are like those (who had) surrounded Yusuf.",
      "chain": [
        "30375",
        "30553",
        "20121",
        "20115",
        "11013",
        "11818",
        "53"
      ]
    },
    {
      "hadith_no": "419",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "وحدثني محمد بن رافع، وعبد بن حميد، جميعا عن عبد الرزاق، أخبرنا معمر، عن الزهري، قال أخبرني أنس بن مالك، قال لما كان يوم الاثنين ‏.‏ بنحو حديثهما ‏.‏",
      "text_en": " This hadith is narrated on the authority of Anas b. Malik by another chain of transmitters.",
      "chain": [
        "30375",
        "30553",
        "20121",
        "20115",
        "11013",
        "19"
      ]
    },
    {
      "hadith_no": "274",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثني محمد بن رافع، وحسن بن علي الحلواني، جميعا عن عبد الرزاق، قال ابن رافع حدثنا عبد الرزاق، أخبرنا ابن جريج، حدثني ابن شهاب، عن حديث، عباد بن زياد أن عروة بن المغيرة بن شعبة، أخبره أن المغيرة بن شعبة أخبره أنه، غزا مع رسول الله صلى الله عليه وسلم تبوك - قال المغيرة - فتبرز رسول الله صلى الله عليه وسلم قبل الغائط فحملت معه إداوة قبل صلاة الفجر فلما رجع رسول الله صلى الله عليه وسلم إلى أخذت أهريق على يديه من الإداوة وغسل يديه ثلاث مرات ثم غسل وجهه ثم ذهب يخرج جبته عن ذراعيه فضاق كما جبته فأدخل يديه في الجبة حتى أخرج ذراعيه من أسفل الجبة ‏.‏ وغسل ذراعيه إلى المرفقين ثم توضأ على خفيه ثم أقبل - قال المغيرة - فأقبلت معه حتى نجد الناس قد قدموا عبد الرحمن بن عوف فصلى لهم فأدرك رسول الله صلى الله عليه وسلم إحدى الركعتين فصلى مع الناس الركعة الآخرة فلما سلم عبد الرحمن بن عوف قام رسول الله صلى الله عليه وسلم يتم صلاته فأفزع ذلك المسلمين فأكثروا التسبيح فلما قضى النبي صلى الله عليه وسلم صلاته أقبل عليهم ثم قال ‏\"‏ أحسنتم ‏\"‏ ‏.‏ أو قال ‏\"‏ قد أصبتم ‏\"‏ ‏.‏ يغبطهم أن صلوا الصلاة لوقتها ‏.‏",
      "text_en": " Mughira b. Shu'ba reported that he participated In the expedition of Tabuk along with the Messenger of Allah (may peace be upon him). The Messenger of Allah (may peace be upon him) went out to answer the call of nature before the morning prayer. and I carried along with him a jar (full of water). When the Messenger of Allah (may peace be upon him) came back to me (after relieving himself). I began to pour water upon his hands out of the jar and he washed his hands three times, then washed his face three times. He then tried to tuck up the sleeves of his cloak upon his forearms but since the sleeves were tight he inserted his hands in the cloak and then brought out his forearms up to the elbow below the cloak, and then wiped over his shoes and then moved on. Mughira said:                      I also moved along with him till he came to the people and (he found) that they had been saying their prayer under the Imamah of 'Abd al-Rahman b. 'Auf. The Messenger of Allah (may peace be upon him) could get one rak ah out of two and said (this) last rak'ah along with the people. When Abd al-Rahman b. 'Auf pronounced the salutation, the Messenger of Allah (may peace be upon him) got up to complete the prayer. This made the Muslims terrified and most of them began to recite the glory of the Lord. When the Apostle of Allah (may peace be upon him) finished his prayer, he turned towards them and then said: You did well, or said with a sense of joy: You did the right thing that you said prayer at the appointed hour.",
      "chain": [
        "30375",
        "20121",
        "20121",
        "11070",
        "11013",
        "11373",
        "166"
      ]
    },
    {
      "hadith_no": "274",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن رافع، والحلواني، قالا حدثنا عبد الرزاق، عن ابن جريج، حدثني ابن شهاب، عن إسماعيل بن محمد بن سعد، عن حمزة بن المغيرة، نحو حديث عباد قال المغيرة فأردت تأخير عبد الرحمن فقال النبي صلى الله عليه وسلم ‏\"‏ دعه ‏\"‏ ‏.‏",
      "text_en": " This hadith is narrated by Hamza b. Mughira by another chain of trans- mitters (but with the addition of these words):                      I made up my mind to hold Abd al-Rahman b. 'Auf back, but the Messenger of Allah (may peace be upon him) said: Leave him.\"",
      "chain": [
        "30375",
        "30115",
        "20121",
        "11070",
        "11013",
        "11500",
        "25075"
      ]
    },
    {
      "hadith_no": "422",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن رافع، حدثنا عبد الرزاق، أخبرنا معمر، عن همام، عن أبي هريرة، عن النبي صلى الله عليه وسلم ‏.‏ بمثله وزاد ‏\"‏ في الصلاة ‏\"‏ ‏.‏",
      "text_en": " This hadith is transmitted by Muhammad b. Rafi', Abu'I-Razzaq. Ma'mar, Hammam on the authority of Abu Huraira with the addition of (the word)\" prayer\".",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "435",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن رافع، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، قال هذا ما حدثنا أبو هريرة، عن رسول الله صلى الله عليه وسلم فذكر أحاديث منها وقال ‏\"‏ أقيموا الصف في الصلاة فإن إقامة الصف من حسن الصلاة ‏\"‏ ‏.‏",
      "text_en": " Hammam b. Munabbih reported:                      This is what was transmitted to us by Abu Huraira from the Messenger of Allah (may peace be upon him) and, while making a mention of a few ahadith, said: (The Messengerof Allah directed us thus): Establish rows in prayer, for the making of a row (straight) is one of the merits of prayer.",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "455",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "وحدثنا هارون بن عبد الله، حدثنا حجاج بن محمد، عن ابن جريج، ح قال وحدثني محمد بن رافع، - وتقاربا في اللفظ - حدثنا عبد الرزاق، أخبرنا ابن جريج، قال سمعت محمد بن عباد بن جعفر، يقول أخبرني أبو سلمة بن سفيان، وعبد الله بن عمرو بن العاص، وعبد الله بن المسيب العابدي، عن عبد الله بن السائب، قال صلى لنا النبي صلى الله عليه وسلم الصبح بمكة فاستفتح سورة المؤمنين حتى جاء ذكر موسى وهارون أو ذكر عيسى - محمد بن عباد يشك أو اختلفوا عليه - أخذت النبي صلى الله عليه وسلم سعلة فركع وعبد الله بن السائب حاضر ذلك ‏.‏ وفي حديث عبد الرزاق فحذف فركع ‏.‏ وفي حديثه وعبد الله بن عمرو ‏.‏ ولم يقل ابن العاص ‏.‏",
      "text_en": " Abdullah b. Sa'id reported:                      The Apostle of Allah (may peace be upon him) led us in the morning prayer in Mecca and began Sarat al-Mu'minin (xxiii ) but when he came to the mention of Moses and Aaron (verse. 45) or to the mention of Jesus (verse 50), a cough got the better of him, and he bowed. 'Abdullah b. Sa'ib was present there, and in the hadith narrated by Abd al-Razzaq (the words are): He cut short (the recitation) and bowed.",
      "chain": [
        "30524",
        "20381",
        "11070",
        "30375",
        "20121",
        "11070",
        "11262",
        "29"
      ]
    },
    {
      "hadith_no": "458",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، ومحمد بن رافع، - واللفظ لابن رافع - قالا حدثنا يحيى بن آدم، حدثنا زهير، عن سماك، قال سألت جابر بن سمرة عن صلاة النبي، صلى الله عليه وسلم فقال كان يخفف الصلاة ولا يصلي صلاة هؤلاء ‏.‏ قال وأنبأني أن رسول الله صلى الله عليه وسلم كان يقرأ في الفجر ب ‏{‏ ق والقرآن‏}‏ ونحوها ‏.‏",
      "text_en": " Simak asked Jabir b. Samura about the prayer of the Apostle (may peace be upon him). He said:                      He (the Holy Prophet) shortened the prayer and he did not pray like these people then, and he informed me that the Messenger of Allah (may peace be upon him) used to recite\" Qaf. By the (Glorious) Qur'an,\" and a passage of similar length.",
      "chain": [
        "30201",
        "30375",
        "20364",
        "20321",
        "10770",
        "393"
      ]
    }
  ],
  "total_hadiths": 389
}