{
  "id": "30384",
  "name": "Muhammad bin Musa bin A'yn محمد بن موسى بن أعين الجزري",
  "full_name": "Muhammad bin Musa bin A'yn محمد بن موسى بن أعين الجزري",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "223",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ خ  س  -  صدوق ]"
    ],
    "tags": []
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20321",
      "name": "Zuhayr bin Mua'wiya bin Hudayj زهير بن معاوية بن حديج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20102",
      "name": "'Abdullah bin Idris bin Yazid al-Audi عبد الله بن إدريس بن يزيد الأودي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20347",
      "name": "'Isa bin Yonus bin Abi Ishaq عيسى بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "28021",
      "name": "Ibrahim bin Yazid bin Mardanba إبراهيم بن يزيد بن مردانبه",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "28161",
      "name": "Khtab bin al-Qasim al-Hrany خطاب بن القاسم الحراني",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "students": [
    {
      "id": "30023",
      "name": "Muhammad bin Yahya bin Faris al-Dhahli محمد بن يحيى بن فارس الذهلي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38117",
      "name": "Isma'il bin Y'aqub bin Isma'il إسماعيل بن يعقوب بن إسماعيل",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38405",
      "name": "'Ali bin 'Uthman bin Muhammad علي بن عثمان بن محمد بن سعيد النفيلي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38485",
      "name": "Muhammad bin Jabla محمد بن جبلة / بن خالد بن جبلة",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38620",
      "name": "Muhammad bin Yahya bin Muhammad bin Kath محمد بن يحيى بن محمد بن كثير",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38588",
      "name": "Muhammad bin Muslim bin al-Wara محمد بن مسلم بن عثمان - بن وارة",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38496",
      "name": "Muhammad bin Khalid bin محمد بن خالد",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1952",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا محمد بن خالد، حدثنا محمد بن موسى بن أعين، حدثنا أبي، عن عمرو بن الحارث، عن عبيد الله بن أبي جعفر، أن محمد بن جعفر، حدثه عن عروة، عن عائشة  رضى الله عنها  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من مات وعليه صيام صام عنه وليه ‏\"‏‏.‏ تابعه ابن وهب عن عمرو‏.‏ ورواه يحيى بن أيوب عن ابن أبي جعفر‏.‏",
      "text_en": " Narrated `Aisha:                     Allah's Apostle said, \"Whoever died and he ought to have fasted (the missed days of Ramadan) then his guardians must fast on his behalf.\"",
      "chain": [
        "38496",
        "30384",
        "20377",
        "11409",
        "20173",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "415",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Ghusl and Tayammum - كتاب الغسل والتيمم",
      "chapter_no": "4",
      "text_ar": "أخبرنا محمد بن يحيى بن محمد، قال حدثنا محمد بن موسى بن أعين، قال حدثنا أبي، عن عبد الملك بن أبي سليمان، عن عطاء، قال حدثتني أم هانئ، أنها دخلت على النبي صلى الله عليه وسلم يوم فتح مكة وهو يغتسل قد سترته بثوب دونه في قصعة فيها أثر العجين ‏‏.‏‏ قالت فصلى الضحى فما أدري كم صلى حين قضى غسله ‏‏.‏‏",
      "text_en": " Umm Hani' narrated that she entered upon the Prophet (ﷺ) on the day of the Conquest of Makkah, when he was performing Ghusl - while a garment was screening him - from a vessel in which were traces of dough. She said:                      He prayed Ad-Duha - but I do not know how many Rak'ahs he prayed - after he finished Ghusl.'\"",
      "chain": [
        "11222",
        "30384",
        "10945",
        "11029",
        "198"
      ]
    },
    {
      "hadith_no": "3201",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا محمد بن يحيى بن عبد الله بن خالد النيسابوري، قال حدثنا محمد بن موسى بن أعين، قال حدثنا أبي، عن معمر، عن الزهري، قال حدثنا أبو سلمة بن عبد الرحمن، عن عائشة، زوج النبي صلى الله عليه وسلم أنها أخبرته أن رسول الله صلى الله عليه وسلم جاءها حين أمره الله أن يخير أزواجه - قالت عائشة - فبدأ بي رسول الله صلى الله عليه وسلم فقال ‏\"‏ إني ذاكر لك أمرا فلا عليك أن لا تعجلي حتى تستأمري أبويك ‏\"‏ ‏.‏ قالت وقد علم أن أبوى لا يأمراني بفراقه ثم قال رسول الله صلى الله عليه وسلم ‏{‏ يا أيها النبي قل لأزواجك إن كنتن تردن الحياة الدنيا وزينتها فتعالين أمتعكن ‏}‏ فقلت في هذا أستأمر أبوى فإني أريد الله ورسوله والدار الآخرة ‏.‏",
      "text_en": " Narrated 'Aishah:                     It was narrated from 'Aishah, the wife of the Prophet, that the Messenger of Allah came to her when Allah commanded him to give his wives the choice.  'Aishah said: \"The Messenger of Allah started with me and said: 'I am going to tell you something, but you do not have to rush until you consult your parents.'\" She said: \"He knew that my parents would not tell me to leave him.\" Then the Messenger of Allah said: 'O Prophet! Say to your wives: If you desire the life of this world, and its glitter, then come! I will make a provision for you and set you free in a handsome manner.' \"I said: 'Do I need to consult my parents about this? I choose Allah and His Messenger, and the abode of the Hereafter.'\"",
      "chain": [
        "11222",
        "30384",
        "20115",
        "11013",
        "10567"
      ]
    },
    {
      "hadith_no": "3423",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرني محمد بن جبلة، ومحمد بن يحيى بن محمد، قالا حدثنا محمد بن موسى بن أعين، قال حدثنا أبي، عن إسحاق بن راشد، عن الزهري، أخبرني عبد الرحمن بن عبد الله بن كعب بن مالك، عن أبيه، قال سمعت أبي كعب بن مالك، - قال وهو أحد الثلاثة الذين تيب عليهم - يحدث قال أرسل إلى رسول الله صلى الله عليه وسلم وإلى صاحبى أن رسول الله صلى الله عليه وسلم يأمركم أن تعتزلوا نساءكم ‏.‏ فقلت للرسول أطلق امرأتي أم ماذا أفعل قال لا بل تعتزلها فلا تقربها ‏.‏ فقلت لامرأتي الحقي بأهلك فكوني فيهم فلحقت بهم ‏.‏",
      "text_en": " 'Abdur-Rahman bin 'Abdullah bin Ka'b bin Malik narrated that his father said:                      \"I heard my father Ka'b bin Malik -who was one of the three whose repentance was accepted- say: 'The Messenger of Allah sent word to me and to my two companions saying: The Messenger of Allah commands you to keep away from your wives. I said to his envoy: Shall I divorce my wife, or what should I do? He said: No, just keep away from her, and do not approach her. I said to my wife: Go to your family and stay with them. So she went to them.'\"",
      "chain": [
        "38485",
        "11222",
        "30384",
        "20409",
        "11013",
        "11519",
        "1131"
      ]
    },
    {
      "hadith_no": "4901",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرنا محمد بن جبلة، قال حدثنا محمد بن موسى بن أعين، قال حدثنا أبي، عن إسحاق بن راشد، عن الزهري، عن عروة، عن عائشة، أن قريشا، أهمهم شأن المخزومية التي سرقت فقالوا من يكلم فيها قالوا من يجترئ عليه إلا أسامة بن زيد حب رسول الله صلى الله عليه وسلم ‏.‏ فكلمه أسامة فقال رسول الله صلى الله عليه وسلم ‏\"‏ إنما هلك الذين من قبلكم أنهم كانوا إذا سرق فيهم الشريف تركوه وإذا سرق فيهم الضعيف أقاموا عليه الحد وايم الله لو سرقت فاطمة بنت محمد لقطعت يدها ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Aishah the Quraish were worried about the case of the Makhzumi woman who stole, and they said:                     \"Who will speak concerning her?\" They said: \"Who would dare to do that except Usamah bin Zaid, the beloved of the Messenger of Allah?\" said: \"Those who came before you were destroyed because whenever a noble person among them stole they would let him go. But if a person who was weak stole, they would carry out the Hadd punishment. By Allah, if Fatimah, the daughter of Muhammad, were to steal, I would ct off her hand.\"",
      "chain": [
        "38485",
        "30384",
        "20409",
        "11013",
        "10511",
        "53"
      ]
    }
  ],
  "total_hadiths": 5
}