{
  "id": "30380",
  "name": "Muhammad bin 'Abdul 'Aziz bin al-Wasti محمد بن عبد العزيز العمري الرملي بن الوا",
  "full_name": "Muhammad bin 'Abdul 'Aziz bin al-Wasti محمد بن عبد العزيز العمري الرملي بن الوا",
  "grade": "3rd Century AH [10th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Ramla",
      "al-Wasit"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq/Delusion] [ خ  تم  س  -  صدوق له أوهام ]"
    ],
    "tags": [
      "al-Ramli",
      "al-Wasti"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20421",
      "name": "Hafs bin Mysrh al-Qyly حفص بن ميسرة العقيلي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "25246",
      "name": "Qays bin al-Rabi' al-'Asady Abu قيس بن الربيع الأسدي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "38400",
      "name": "'Ali bin Da'ud bin Yazid علي بن داود بن يزيد",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38655",
      "name": "Musa bin Sahl bin Qadim موسى بن سهل بن قادم",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "4624",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني محمد بن عبد العزيز، حدثنا أبو عمر، حفص بن ميسرة عن زيد بن أسلم، عن عطاء بن يسار، عن أبي سعيد الخدري  رضى الله عنه  أن أناسا في زمن النبي صلى الله عليه وسلم قالوا يا رسول الله، هل نرى ربنا يوم القيامة قال النبي صلى الله عليه وسلم ‏\"‏ نعم، هل تضارون في رؤية الشمس بالظهيرة، ضوء ليس فيها سحاب ‏\"‏‏.‏ قالوا لا‏.‏ قال ‏\"‏ وهل تضارون في رؤية القمر ليلة البدر، ضوء ليس فيها سحاب ‏\"‏‏.‏ قالوا لا‏.‏ قال النبي صلى الله عليه وسلم ‏\"‏ ما تضارون في رؤية الله عز وجل يوم القيامة، إلا كما تضارون في رؤية أحدهما، إذا كان يوم القيامة أذن مؤذن تتبع كل أمة ما كانت تعبد‏.‏ فلا يبقى من كان يعبد غير الله من الأصنام والأنصاب إلا يتساقطون في النار، حتى إذا لم يبق إلا من كان يعبد الله، بر أو فاجر وغبرات أهل الكتاب، فيدعى اليهود فيقال لهم من كنتم تعبدون قالوا كنا نعبد عزير ابن الله‏.‏ فيقال لهم كذبتم، ما اتخذ الله من صاحبة ولا ولد، فماذا تبغون فقالوا عطشنا ربنا فاسقنا‏.‏ فيشار ألا تردون، فيحشرون إلى النار كأنها سراب، يحطم بعضها بعضا فيتساقطون في النار، ثم يدعى النصارى، فيقال لهم من كنتم تعبدون قالوا كنا نعبد المسيح ابن الله‏.‏ فيقال لهم كذبتم، ما اتخذ الله من صاحبة ولا ولد‏.‏ فيقال لهم ماذا تبغون فكذلك مثل الأول، حتى إذا لم يبق إلا من كان يعبد الله من بر أو فاجر، أتاهم رب العالمين في أدنى صورة من التي رأوه فيها، فيقال ماذا تنتظرون تتبع كل أمة ما كانت تعبد‏.‏ قالوا فارقنا الناس في الدنيا على أفقر ما كنا إليهم، ولم نصاحبهم، ونحن ننتظر ربنا الذي كنا نعبد‏.‏ فيقول أنا ربكم، فيقولون لا نشرك بالله شيئا‏.‏ مرتين أو ثلاثا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     During the lifetime of the Prophet some people said, : O Allah's Apostle! Shall we see our Lord on the Day of Resurrection?\" The Prophet said, \"Yes; do you have any difficulty in seeing the sun at midday when it is bright and there is no cloud in the sky?\" They replied, \"No.\" He said, \"Do you have any difficulty in seeing the moon on a full moon night when it is bright and there is no cloud in the sky?\" They replied, \"No.\" The Prophet said, \"(Similarly) you will have no difficulty in seeing Allah on the Day of Resurrection as you have no difficulty in seeing either of them. On the Day of Resurrection, a call-maker will announce, \"Let every nation follow that which they used to worship.\" Then none of those who used to worship anything other than Allah like idols and other deities but will fall in Hell (Fire), till there will remain none but those who used to worship Allah, both those who were obedient (i.e. good) and those who were disobedient (i.e. bad) and the remaining party of the people of the Scripture. Then the Jews will be called upon and it will be said to them, 'Who do you use to worship?' They will say, 'We used to worship Ezra, the son of Allah.' It will be said to them, 'You are liars, for Allah has never taken anyone as a wife or a son. What do you want now?' They will say, 'O our Lord! We are thirsty, so give us something to drink.' They will be directed and addressed thus, 'Will you drink,' whereupon they will be gathered unto Hell (Fire) which will look like a mirage whose different sides will be destroying each other. Then they will fall into the Fire. Afterwards the Christians will be called upon and it will be said to them, 'Who do you use to worship?' They will say, 'We used to worship Jesus, the son of Allah.' It will be said to them, 'You are liars, for Allah has never taken anyone as a wife or a son,' Then it will be said to them, 'What do you want?' They will say what the former people have said. Then, when there remain (in the gathering) none but those who used to worship Allah (Alone, the real Lord of the Worlds) whether they were obedient or disobedient. Then (Allah) the Lord of the worlds will come to them in a shape nearest to the picture they had in their minds about Him. It will be said, 'What are you waiting for?' Every nation have followed what they used to worship.' They will reply, 'We left the people in the world when we were in great need of them and we did not take them as friends. Now we are waiting for our Lord Whom we used to worship.' Allah will say, 'I am your Lord.' They will say twice or thrice, 'We do not worship any besides Allah.' \"",
      "chain": [
        "30380",
        "11163",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "7406",
      "source": " Sahih Bukhari ",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا محمد بن عبد العزيز، حدثنا أبو عمر الصنعاني  من اليمن  عن زيد بن أسلم، عن عطاء بن يسار، عن أبي سعيد الخدري، عن النبي صلى الله عليه وسلم قال ‏\"‏ لتتبعن سنن من كان قبلكم شبرا شبرا وذراعا بذراع، حتى لو دخلوا جحر ضب تبعتموهم ‏\"‏‏.‏ قلنا يا رسول الله اليهود والنصارى قال ‏\"‏ فمن ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     The Prophet said, \"You will follow the ways of those nations who were before you, span by span and cubit by cubit (i.e., inch by inch) so much so that even if they entered a hole of a mastigure, you would follow them.\" We said, \"O Allah's Apostle! (Do you mean) the Jews and the Christians?\" He said, \"Whom else?\"",
      "chain": [
        "30380",
        "11163",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "6864",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثني عمرو الناقد، حدثنا أبو أحمد الزبيري، حدثنا محمد بن عبد العزيز، عن  عبيد الله بن أبي بكر بن أنس، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من عال جاريتين حتى تبلغا جاء يوم القيامة أنا وهو ‏\"‏ ‏.‏ وضم أصابعه ‏.‏",
      "text_en": " Malik reported Allah's Messenger (may peace be upon him) as saying:                      He, who brought up two girls properly till they grew up, he and I would come (together) (very closely) on the Day of Resurrection, and he interlaced his fingers (for explaining the point of nearness between him and that person).",
      "chain": [
        "30263",
        "20355",
        "30380",
        "11436",
        "19"
      ]
    },
    {
      "hadith_no": "Grade",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرنا محمد بن عبد العزيز، قال حدثنا الفضل بن موسى، عن حسين بن واقد، عن عبد الله بن بريدة، عن أبيه، قال كان النبي صلى الله عليه وسلم يخطب فجاء الحسن والحسين - رضى الله عنهما - وعليهما قميصان أحمران يعثران فيهما فنزل النبي صلى الله عليه وسلم فقطع كلامه فحملهما ثم عاد إلى المنبر ثم قال ‏\"‏ صدق الله ‏{‏ إنما أموالكم وأولادكم فتنة ‏}‏ رأيت هذين يعثران في قميصيهما فلم أصبر حتى قطعت كلامي فحملتهما ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin Buraidah that:                     His father said: \"The Prophet (ﷺ) was preaching, then Al-Hasan and Al-Husain came, wearing red shirts and stumbling in them. The Prophet (ﷺ) came down, interrupting himself, and picked them up, then he went back to the minbar and said: 'Allah has spoken the truth: Your wealth and your children are only a trial. I saw these two stumbling in their shirts and I could not continue until I had interrupted myself and picked them up.'\"",
      "chain": [
        "30380",
        "20452",
        "20648",
        "11432",
        "3131"
      ]
    },
    {
      "hadith_no": "2422",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن عبد العزيز، قال أنبأنا الفضل بن موسى، عن فطر، عن يحيى بن سام، عن موسى بن طلحة، عن أبي ذر، قال أمرنا رسول الله صلى الله عليه وسلم أن نصوم من الشهر ثلاثة أيام البيض ثلاث عشرة وأربع عشرة وخمس عشرة ‏.‏",
      "text_en": " It was narrated that Abu Dharr said:                     \"The Messenger of Allah commanded us to fast the three days of Al-Bid, the thirteenth, fourteenth and fifteenth.\"",
      "chain": [
        "30380",
        "20452",
        "19145",
        "579",
        "23"
      ]
    },
    {
      "hadith_no": "5446",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا محمد بن عبد العزيز، قال حدثنا الفضل بن موسى، عن زكريا، عن أبي إسحاق، عن عمرو بن ميمون، عن ابن مسعود، قال كان النبي صلى الله عليه وسلم يتعوذ من خمس من البخل والجبن وسوء العمر وفتنة الصدر وعذاب القبر ‏.‏",
      "text_en": " It was narrated that Ibn Mas'ud said:                     \"The Prophet [SAW] used to seek refuge (with Allah) from five things: From miserliness, cowardice, reaching the age of second childhood, the tribulation of the heart and the torment of the grave.\"",
      "chain": [
        "30380",
        "20452",
        "11338",
        "11049",
        "11382",
        "16"
      ]
    },
    {
      "hadith_no": "306",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن عبد العزيز، حدثنا مسلم بن إبراهيم، حدثنا بحر بن كنيز، عن عثمان بن ساج، عن سعيد بن جبير، عن علي بن أبي طالب، قال إن أفواهكم طرق للقرآن فطيبوها بالسواك ‏.‏",
      "text_en": " It was narrated that 'Ali bin Abu Talib said:                     \"Your mouths are the paths of the Qur'an, so perfume them with the tooth stick.\"",
      "chain": [
        "30380",
        "20285",
        "24028",
        "28392",
        "11050",
        "5"
      ]
    }
  ],
  "total_hadiths": 7
}