{
  "id": "30388",
  "name": "Muhammad bin Yusuf al-Baykandi محمد بن يوسف البيكندي البخاري",
  "full_name": "Muhammad bin Yusuf al-Baykandi محمد بن يوسف البيكندي البخاري",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Maqbool",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Maqbool] [ خ  -  ثقة ]"
    ],
    "tags": [
      "Quraish",
      "Client",
      "Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20318",
      "name": "Hammad bin Usamah حماد بن أسامة - أبو أسامة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20291",
      "name": "al-Nadr bin Shumayl al-Maazni النضر بن شميل المازني أبو الحسن النحوي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20032",
      "name": "Waki' bin al-Jarrah وكيع بن الجراح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30284",
      "name": "'Abdul A'ala bin Mushir al-Ghasani عبد الأعلى بن مسهر أبو مسهر الغساني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "26529",
      "name": "Hisham bin Sa'id al-Talaqani هشام بن سعيد الطالقاني أبو أحمد البزاز",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "36036",
      "name": "'Abdullah bin Salah عبد الله بن صالح بن محمد أبو صالح المصري",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30352",
      "name": "Abu Ja'far al-Nafaili عبد الله بن محمد أبو جعفر النفيلي الحران",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "38024",
      "name": "Ahmed bin Syar bin Ayoub أحمد بن سيار بن أيوب",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "68",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن يوسف، قال أخبرنا سفيان، عن الأعمش، عن أبي وائل، عن ابن مسعود، قال كان النبي صلى الله عليه وسلم يتخولنا بالموعظة في الأيام، كراهة السآمة علينا‏.‏",
      "text_en": " Narrated Ibn Mas`ud:                     The Prophet used to take care of us in preaching by selecting a suitable time, so that we might not get bored. (He abstained from pestering us with sermons and knowledge all the time).",
      "chain": [
        "30388",
        "20005",
        "11060",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "77",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثني محمد بن يوسف، قال حدثنا أبو مسهر، قال حدثني محمد بن حرب، حدثني الزبيدي، عن الزهري، عن محمود بن الربيع، قال عقلت من النبي صلى الله عليه وسلم مجة مجها في وجهي وأنا ابن خمس سنين من دلو‏.‏",
      "text_en": " Narrated Mahmud bin Rabi`a:                     When I was a boy of five, I remember, the Prophet took water from a bucket (used far getting water out of a well) with his mouth and threw it on my face.",
      "chain": [
        "30388",
        "30284",
        "30373",
        "20459",
        "11013",
        "5278"
      ]
    },
    {
      "hadith_no": "154",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا محمد بن يوسف، قال حدثنا الأوزاعي، عن يحيى بن أبي كثير، عن عبد الله بن أبي قتادة، عن أبيه، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا بال أحدكم فلا يأخذن ذكره بيمينه، ولا يستنجي بيمينه، ولا يتنفس في الإناء ‏\"‏‏.‏",
      "text_en": " Narrated Abu Qatada:                     The Prophet said, \"Whenever anyone of you makes water he should not hold his penis or clean his private parts with his right hand. (And while drinking) one should not breathe in the drinking utensil .\"",
      "chain": [
        "30388",
        "20024",
        "11449",
        "11804",
        "391"
      ]
    },
    {
      "hadith_no": "157",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا محمد بن يوسف، قال حدثنا سفيان، عن زيد بن أسلم، عن عطاء بن يسار، عن ابن عباس، قال توضأ النبي صلى الله عليه وسلم مرة مرة‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet performed ablution by washing the body parts only once.",
      "chain": [
        "30388",
        "20005",
        "11163",
        "11020",
        "17"
      ]
    },
    {
      "hadith_no": "214",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا محمد بن يوسف، قال حدثنا سفيان، عن عمرو بن عامر، قال سمعت أنسا، ح قال وحدثنا مسدد، قال حدثنا يحيى، عن سفيان، قال حدثني عمرو بن عامر، عن أنس، قال كان النبي صلى الله عليه وسلم يتوضأ عند كل صلاة‏.‏ قلت كيف كنتم تصنعون قال يجزئ أحدنا الوضوء ما لم يحدث‏.‏",
      "text_en": " Narrated `Amr bin `Amir:                     Anas said, \"The Prophet used to perform ablution for every prayer.\" I asked Anas, \"What did you used to do?' Anas replied, \"We used to pray with the same ablution until we break it with Hadath.\"",
      "chain": [
        "30388",
        "20005",
        "15406",
        "19",
        "30175",
        "20031",
        "20012",
        "15406",
        "19"
      ]
    },
    {
      "hadith_no": "241",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا محمد بن يوسف، قال حدثنا سفيان، عن حميد، عن أنس، قال بزق النبي صلى الله عليه وسلم في ثوبه‏.‏ طوله ابن أبي مريم قال أخبرنا يحيى بن أيوب حدثني حميد قال سمعت أنسا عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Anas:                     The Prophet once spat in his clothes.",
      "chain": [
        "30388",
        "20005",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "249",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن يوسف، قال حدثنا سفيان، عن الأعمش، عن سالم بن أبي الجعد، عن كريب، عن ابن عباس، عن ميمونة، زوج النبي صلى الله عليه وسلم قالت توضأ رسول الله صلى الله عليه وسلم وضوءه للصلاة غير رجليه، وغسل فرجه، وما أصابه من الأذى، ثم أفاض عليه الماء، ثم نحى رجليه فغسلهما، هذه غسله من الجنابة‏.‏",
      "text_en": " Narrated Maimuna:                     (the wife of the Prophet) Allah's Apostle performed ablution like that for the prayer but did not wash his feet. He washed off the discharge from his private parts and then poured water over his body. He withdrew his feet from that place (the place where he took the bath) and then washed them. And that was his way of taking the bath of Janaba.",
      "chain": [
        "30388",
        "20005",
        "11060",
        "11342",
        "11211",
        "17"
      ]
    },
    {
      "hadith_no": "630",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن يوسف، قال حدثنا سفيان، عن خالد الحذاء، عن أبي قلابة، عن مالك بن الحويرث، قال أتى رجلان النبي صلى الله عليه وسلم يريدان السفر فقال النبي صلى الله عليه وسلم ‏\"‏ إذا أنتما خرجتما فأذنا ثم أقيما ثم ليؤمكما أكبركما ‏\"‏‏.‏",
      "text_en": " Narrated Malik bin Huwairith:                     Two men came to the Prophet with the intention of a journey. The Prophet said, \"When (both of) you set out, pronounce Adhan and then Iqama and the oldest of you should lead the prayer.\"",
      "chain": [
        "30388",
        "20005",
        "11282",
        "11047",
        "5265"
      ]
    },
    {
      "hadith_no": "634",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن يوسف، قال حدثنا سفيان، عن عون بن أبي جحيفة، عن أبيه، أنه رأى بلالا يؤذن فجعلت أتتبع فاه ها هنا وها هنا بالأذان‏.‏",
      "text_en": " Narrated `Aun bin Abi Juhaifa:                     My father said, \"I saw Bilal turning his face from side to side while pronouncing the Adhan for the prayer.\"",
      "chain": [
        "30388",
        "20005",
        "11383",
        "4047"
      ]
    },
    {
      "hadith_no": "640",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا إسحاق، قال حدثنا محمد بن يوسف، قال حدثنا الأوزاعي، عن الزهري، عن أبي سلمة بن عبد الرحمن، عن أبي هريرة، قال أقيمت الصلاة فسوى الناس صفوفهم، فخرج رسول الله صلى الله عليه وسلم فتقدم وهو جنب ثم قال ‏\"‏ على مكانكم ‏\"‏‏.‏ فرجع فاغتسل ثم خرج ورأسه يقطر ماء فصلى بهم‏.‏",
      "text_en": " Narrated Abu Huraira:                     Once Iqama was pronounced and the people had straightened the rows, Allah's Apostle went forward (to lead the prayer) but he was Junub, so he said, \"Remain in your places.\" And he went out, took a bath and returned with water trickling from his head. Then he led the prayer.",
      "chain": [
        "30312",
        "30388",
        "20024",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "695",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "قال أبو عبد الله وقال لنا محمد بن يوسف حدثنا الأوزاعي، حدثنا الزهري، عن حميد بن عبد الرحمن، عن عبيد الله بن عدي بن خيار، أنه دخل على عثمان بن عفان  رضى الله عنه  وهو محصور فقال إنك إمام عامة، ونزل بك ما ترى ويصلي لنا إمام فتنة ونتحرج‏.‏ فقال الصلاة أحسن ما يعمل الناس، فإذا أحسن الناس فأحسن معهم، وإذا أساءوا فاجتنب إساءتهم‏.‏ وقال الزبيدي قال الزهري لا نرى أن يصلى خلف المخنث إلا من ضرورة لا بد منها‏.‏",
      "text_en": " Narrated 'Ubaid-Ullah bin Adi bin Khiyar:                      I went to 'Uthman bin Affan while he was besieged, and said to him, \"You are the chief of all Muslims in general and you see what has befallen you. We are led in the Salat (prayer) by a leader of Al-Fitan (trials and afflictions etc.) and we are afraid of being sinful in following him.\" 'Uthman said. \"As-Salat (the prayers) is the best of all deeds so when the people do good deeds do the same with them and when they do bad deeds, avoid those bad deeds.\" Az-Zuhri said, \"In our opinion one should not offer Salat behind an effeminate person unless there is no alternative.\"",
      "chain": [
        "30184",
        "30388",
        "20024",
        "11013",
        "10561",
        "880"
      ]
    },
    {
      "hadith_no": "704",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن إسماعيل بن أبي خالد، عن قيس بن أبي حازم، عن أبي مسعود، قال قال رجل يا رسول الله إني لأتأخر عن الصلاة في الفجر مما يطيل بنا فلان فيها‏.‏ فغضب رسول الله صلى الله عليه وسلم ما رأيته غضب في موضع كان أشد غضبا منه يومئذ ثم قال ‏\"‏ يا أيها الناس إن منكم منفرين، فمن أم الناس فليتجوز، فإن خلفه الضعيف والكبير وذا الحاجة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Mas`ud:                     A man came and said, \"O Allah's Apostle! I keep away from the morning prayer because so-and-so (Imam) prolongs it too much.\" Allah's Apostle became furious and I had never seen him more furious than he was on that day. The Prophet said, \"O people! Some of you make others dislike the prayer, so whoever becomes an Imam he should shorten the prayer, as behind him are the weak, the old and the needy.''",
      "chain": [
        "30388",
        "20005",
        "11418",
        "11046",
        "402"
      ]
    },
    {
      "hadith_no": "761",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن يوسف، قال حدثنا سفيان، عن الأعمش، عن عمارة بن عمير، عن أبي معمر، قال قلت لخباب بن الأرت أكان النبي صلى الله عليه وسلم يقرأ في الظهر والعصر قال نعم‏.‏ قال قلت بأى شىء كنتم تعلمون قراءته قال باضطراب لحيته‏.‏",
      "text_en": " Narrated Abu Ma`mar:                     I asked Khabbab bin Al-Art whether the Prophet used to recite the Qur'an in the Zuhr and the `Asr prayers. He replied in the affirmative. I said, \"How did you come to know that?\" He replied, \"From the movement of his beard.\"",
      "chain": [
        "30388",
        "20005",
        "11060",
        "11378",
        "11360"
      ]
    },
    {
      "hadith_no": "778",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا الأوزاعي، حدثني يحيى بن أبي كثير، حدثني عبد الله بن أبي قتادة، عن أبيه، أن النبي صلى الله عليه وسلم كان يقرأ بأم الكتاب وسورة معها في الركعتين الأوليين من صلاة الظهر وصلاة العصر، ويسمعنا الآية أحيانا، وكان يطيل في الركعة الأولى‏.‏",
      "text_en": " Narrated `Abdullah bin Abi Qatada:                     My father said, \"The Prophet used to recite Al-Fatiha along with another Sura in the first two rak`at of the Zuhr and `Asr prayers. A verse or so was audible at times and he used to prolong the first rak`a.\"",
      "chain": [
        "30388",
        "20024",
        "11449",
        "11804",
        "391"
      ]
    },
    {
      "hadith_no": "844",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن يوسف، قال حدثنا سفيان، عن عبد الملك بن عمير، عن وراد، كاتب المغيرة بن شعبة قال أملى على المغيرة بن شعبة في كتاب إلى معاوية أن النبي صلى الله عليه وسلم كان يقول في دبر كل صلاة مكتوبة ‏\"‏ لا إله إلا الله وحده لا شريك له، له الملك، وله الحمد، وهو على كل شىء قدير، اللهم لا مانع لما أعطيت، ولا معطي لما منعت، ولا ينفع ذا الجد منك الجد ‏\"‏‏.‏ وقال شعبة عن عبد الملك بهذا، وعن الحكم عن القاسم بن مخيمرة عن وراد بهذا‏.‏ وقال الحسن الجد غنى‏.‏",
      "text_en": " Narrated Warrad:                     (the clerk of Al-Mughira bin Shu`ba) Once Al-Mughira dictated to me in a letter addressed to Muawiya that the Prophet used to say after every compulsory prayer, \"La ilaha illa l-lahu wahdahu la sharika lahu, lahu l-mulku wa lahu l-hamdu, wa huwa `ala kulli shay'in qadir. Allahumma la mani`a lima a`taita, wa la mu`tiya lima mana`ta, wa la yanfa`u dhal-jaddi minka l-jadd. [There is no Deity but Allah, Alone, no Partner to Him. His is the Kingdom and all praise, and Omnipotent is he. O Allah! Nobody can hold back what you gave, nobody can give what You held back, and no struggler's effort can benefit against You].\" And Al-Hasan said, \"Al-jadd' means prosperity [??].\"",
      "chain": [
        "30388",
        "20005",
        "11368",
        "11402"
      ]
    },
    {
      "hadith_no": "1039",
      "source": " Sahih Bukhari ",
      "chapter": "Invoking Allah for Rain (Istisqaa) - كتاب الاستسقاء",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن يوسف، قال حدثنا سفيان، عن عبد الله بن دينار، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ مفتاح الغيب خمس لا يعلمها إلا الله لا يعلم أحد ما يكون في غد، ولا يعلم أحد ما يكون في الأرحام، ولا تعلم نفس ماذا تكسب غدا، وما تدري نفس بأى أرض تموت، وما يدري أحد متى يجيء المطر ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     Allah's Apostle (p.b.u.h) said, \"Keys of the unseen knowledge are five which nobody knows but Allah . . . nobody knows what will happen tomorrow; nobody knows what is in the womb; nobody knows what he will gain tomorrow; nobody knows at what place he will die; and nobody knows when it will rain.\"",
      "chain": [
        "30388",
        "20005",
        "11183",
        "18"
      ]
    },
    {
      "hadith_no": "1068",
      "source": " Sahih Bukhari ",
      "chapter": "Prostration During Recital of Qur'an - كتاب سجود القرآن",
      "chapter_no": "17",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن سعد بن إبراهيم، عن عبد الرحمن، عن أبي هريرة  رضى الله عنه  قال كان النبي صلى الله عليه وسلم يقرأ في الجمعة في صلاة الفجر ‏{‏الم * تنزيل‏}‏ السجدة و‏{‏هل أتى على الإنسان‏}‏",
      "text_en": " Narrated Abu Huraira:                     On Fridays the Prophet used to recite Alf Lam Mim Tanzil-As-Sajda (in the first rak`a) and Hal ata'alal-lnsani i.e. Suratad-Dahr (LXXVI) (in the second rak`a), in the Fajr prayer.",
      "chain": [
        "30388",
        "20005",
        "11063",
        "10530",
        "13"
      ]
    },
    {
      "hadith_no": "1443",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا إسرائيل، حدثنا أبو الجويرية، أن معن بن يزيد  رضى الله عنه  حدثه قال بايعت رسول الله صلى الله عليه وسلم أنا وأبي وجدي وخطب على فأنكحني وخاصمت إليه  و كان أبي يزيد أخرج دنانير يتصدق بها فوضعها عند رجل في المسجد، فجئت فأخذتها فأتيته بها فقال والله ما إياك أردت‏.‏ فخاصمته إلى رسول الله صلى الله عليه وسلم فقال ‏\"‏ لك ما نويت يا يزيد، ولك ما أخذت يا معن ‏\"‏‏.‏",
      "text_en": " Narrated Ma'n bin Yazid:                     My grandfather, my father and I gave the pledge of allegiance to Allah's Apostle. The Prophet got me engaged and then got me married. One day I went to the Prophet with a complaint. My father Yazid had taken some gold coins for charity and kept them with a man in the mosque (to give them to the poor) But I went and took them and brought them to him (my father). My father said, \"By Allah! I did not intend to give them to you. \" I took (the case) to Allah's Apostle . On that Allah's Apostle said, \"O Yazid! You will be rewarded for what you intended. O Man! Whatever you have taken is yours.\"",
      "chain": [
        "30388",
        "20311",
        "11685",
        "3691"
      ]
    },
    {
      "hadith_no": "1562",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن منصور، عن سعيد بن جبير، قال كان ابن عمر  رضى الله عنهما  يدهن بالزيت‏.‏   فذكرته لإبراهيم قال ما تصنع بقوله حدثني الأسود عن عائشة  رضى الله عنها  قالت كأني أنظر إلى وبيص الطيب في مفارق رسول الله صلى الله عليه وسلم وهو محرم‏.‏",
      "text_en": " Narrated Sa`id bin Jubair:                     Ibn `Umar used to oil his hair. I told that to Ibrahim who said, \"What do you think about this statement: Narrated Aswad from `Aisha: As if I were now observing the glitter of the scent in the parting of the hair of the Prophet while he was Muhrim?\"",
      "chain": [
        "30388",
        "20005",
        "11067",
        "11050",
        "18"
      ]
    },
    {
      "hadith_no": "1574",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن الأعمش، عن عمارة، عن أبي عطية، عن عائشة  رضى الله عنها  قالت إني لأعلم كيف كان النبي صلى الله عليه وسلم يلبي لبيك اللهم لبيك، لبيك لا شريك لك لبيك، إن الحمد والنعمة لك‏.‏ تابعه أبو معاوية عن الأعمش‏.‏   وقال شعبة أخبرنا سليمان، سمعت خيثمة، عن أبي عطية، سمعت عائشة  رضى الله عنها ‏.‏",
      "text_en": " Narrated `Aisha:                     I know how the Prophet used to say (Talbiya) and it was: 'Labbaika Allahumma Labbaik, Labbaika la sharika Laka labbaik, Inna-l-hamda wan-ni'mata Laka walmu Lk, La sharika Laka'.",
      "chain": [
        "30388",
        "20005",
        "11060",
        "11379",
        "53"
      ]
    },
    {
      "hadith_no": "1584",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن قيس بن مسلم، عن طارق بن شهاب، عن أبي موسى  رضى الله عنه  قال بعثني النبي صلى الله عليه وسلم إلى قوم باليمن فجئت وهو بالبطحاء فقال ‏\"‏ بما أهللت ‏\"‏‏.‏ قلت أهللت كإهلال النبي صلى الله عليه وسلم قال ‏\"‏ هل معك من هدى ‏\"‏‏.‏ قلت لا‏.‏ فأمرني فطفت بالبيت وبالصفا والمروة ثم أمرني فأحللت فأتيت امرأة من قومي فمشطتني، أو غسلت رأسي، فقدم عمر  رضى الله عنه  فقال إن نأخذ بكتاب الله فإنه يأمرنا بالتمام قال الله ‏{‏وأتموا الحج والعمرة‏}‏ وإن نأخذ بسنة النبي صلى الله عليه وسلم فإنه لم يحل حتى نحر الهدى‏.‏",
      "text_en": " Narrated Abu Musa:                     The Prophet sent me to some people in Yemen and when I returned, I found him at Al-Batha. He asked me, \"With what intention have you assumed Ihram (i.e. for Hajj or for Umra or for both?\") I replied, \"I have assumed Ihram with an intention like that of the Prophet.\" He asked, \"Have you a Hadi with you?\" I replied in the negative. He ordered me to perform Tawaf round the Ka`ba and between Safa and Marwa and then to finish my Ihram. I did so and went to a woman from my tribe who combed my hair or washed my head. Then, when `Umar came (i.e. became Caliph) he said, \"If we follow Allah's Book, it orders us to complete Hajj and Umra; as Allah says: \"Perform the Hajj and Umra for Allah.\" (2.196). And if we follow the tradition of the Prophet who did not finish his Ihram till he sacrificed his Hadi.\"",
      "chain": [
        "30388",
        "20005",
        "11386",
        "3680",
        "41"
      ]
    },
    {
      "hadith_no": "1849",
      "source": " Sahih Bukhari ",
      "chapter": "Pilgrims Prevented from Completing the Pilgrimage - كتاب المحصر",
      "chapter_no": "27",
      "text_ar": "وعن محمد بن يوسف، حدثنا ورقاء، عن ابن أبي نجيح، عن مجاهد، أخبرنا عبد الرحمن بن أبي ليلى، عن كعب بن عجرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم رآه، وقمله يسقط على وجهه‏.‏ مثله‏.‏",
      "text_en": " Narrated Ka'b bin 'Ujra (ra):                      Allah's Messenger () saw him (i.e. Ka'b) while the lice were falling on his face.",
      "chain": [
        "30388",
        "20363",
        "11254",
        "11028",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "1851",
      "source": " Sahih Bukhari ",
      "chapter": "Pilgrims Prevented from Completing the Pilgrimage - كتاب المحصر",
      "chapter_no": "27",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن منصور، عن أبي حازم، عن أبي هريرة  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ من حج هذا البيت، فلم يرفث، ولم يفسق، رجع كيوم ولدته أمه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Whoever performs Hajj to this Ka`ba and does not approach his wife for sexual relations nor commit sins (while performing Hajj), he will come out as sinless as a newborn child, (just delivered by his mother).",
      "chain": [
        "30388",
        "20005",
        "11067",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "1889",
      "source": " Sahih Bukhari ",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا عبد الرحمن بن يونس، حدثنا حاتم بن إسماعيل، عن محمد بن يوسف، عن السائب بن يزيد، قال حج بي مع رسول الله صلى الله عليه وسلم وأنا ابن سبع سنين‏.‏",
      "text_en": " Narrated As-Sa'ib bin Yazid:                     (While in the company of my parents) I was made to perform Hajj with Allah's Apostle and I was a seven-year-old boy then. (Fath-ul-Bari, p.443, Vol.4)",
      "chain": [
        "30256",
        "20159",
        "30388",
        "3048"
      ]
    },
    {
      "hadith_no": "2030",
      "source": " Sahih Bukhari ",
      "chapter": "Retiring to a Mosque for Remembrance of Allah (I'tikaf) - كتاب الاعتكاف",
      "chapter_no": "33",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن منصور، عن إبراهيم، عن الأسود، عن عائشة  رضى الله عنها  قالت كان النبي صلى الله عليه وسلم يباشرني وأنا حائض‏.‏ وكان يخرج رأسه من المسجد وهو معتكف فأغسله وأنا حائض‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet used to embrace me during my menses. He also used to put his head out of the mosque while he was in I`tikaf, and I would wash it during my menses.",
      "chain": [
        "30388",
        "20005",
        "11067",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "2113",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن عبد الله بن دينار، عن ابن عمر  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ كل بيعين لا بيع بينهما حتى يتفرقا، إلا بيع الخيار ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet said, \"No deal is settled and finalized unless the buyer and the seller separate, except if the deal is optional (whereby the validity of the bargain depends on the stipulations agreed upon).",
      "chain": [
        "30388",
        "20005",
        "11183",
        "18"
      ]
    },
    {
      "hadith_no": "2260",
      "source": " Sahih Bukhari ",
      "chapter": "Hiring - كتاب الإجارة",
      "chapter_no": "37",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن أبي بردة، قال أخبرني جدي أبو بردة، عن أبيه أبي موسى الأشعري  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ الخازن الأمين الذي يؤدي ما أمر به طيبة نفسه أحد المتصدقين ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa Al-Ash`ari:                     The Prophet said, \"The honest treasurer who gives willingly what he is ordered to give, is one of the two charitable persons, (the second being the owner).",
      "chain": [
        "30388",
        "20005",
        "11901"
      ]
    },
    {
      "hadith_no": "2277",
      "source": " Sahih Bukhari ",
      "chapter": "Hiring - كتاب الإجارة",
      "chapter_no": "37",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن حميد الطويل، عن أنس بن مالك  رضى الله عنه  قال حجم أبو طيبة النبي صلى الله عليه وسلم، فأمر له بصاع أو صاعين من طعام، وكلم مواليه فخفف عن غلته أو ضريبته‏.‏",
      "text_en": " Narrated Anas bin Malik:                     When Abu Taiba cupped the Prophet and the Prophet ordered that he be paid one or two Sas of foodstuff and he interceded with his masters to reduce his taxes.",
      "chain": [
        "30388",
        "20005",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "2288",
      "source": " Sahih Bukhari ",
      "chapter": "Transferance of a Debt from One Person to Another (Al-Hawaala) - كتاب الحوالات",
      "chapter_no": "38",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن ابن ذكوان، عن الأعرج، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ مطل الغني ظلم، ومن أتبع على ملي فليتبع ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Procrastination (delay) in paying debts by a wealthy person is injustice. So, if your debt is transferred from your debtor to a rich debtor, you should agree.\"",
      "chain": [
        "30388",
        "20005",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "2380",
      "source": " Sahih Bukhari ",
      "chapter": "Distribution of Water - كتاب المساقاة",
      "chapter_no": "42",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن يحيى بن سعيد، عن نافع، عن ابن عمر، عن زيد بن ثابت  رضى الله عنهم  قال رخص النبي صلى الله عليه وسلم أن تباع العرايا بخرصها تمرا‏.‏",
      "text_en": " Narrated Zaid bin Thabit:                     The Prophet permitted selling the dates of the 'Araya for ready dates by estimating the amount of the former (as they are still on the trees).",
      "chain": [
        "30388",
        "20005",
        "11062",
        "11014",
        "18",
        "49"
      ]
    },
    {
      "hadith_no": "2431",
      "source": " Sahih Bukhari ",
      "chapter": "Lost Things Picked up by Someone (Luqatah) - كتاب فى اللقطة",
      "chapter_no": "45",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن منصور، عن طلحة، عن أنس  رضى الله عنه  قال مر النبي صلى الله عليه وسلم بتمرة في الطريق قال ‏\"‏ لولا أني أخاف أن تكون من الصدقة لأكلتها ‏\"‏‏.‏ وقال يحيى حدثنا سفيان حدثني منصور وقال زائدة عن منصور عن طلحة حدثنا أنس‏.‏",
      "text_en": " Narrated Anas:                     The Prophet passed a date fallen on the way and said, \"Were I not afraid that it may be from a Sadaqa (charitable gifts), I would have eaten it.\"",
      "chain": [
        "30388",
        "20005",
        "11067",
        "11356",
        "19"
      ]
    },
    {
      "hadith_no": "2438",
      "source": " Sahih Bukhari ",
      "chapter": "Lost Things Picked up by Someone (Luqatah) - كتاب فى اللقطة",
      "chapter_no": "45",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن ربيعة، عن يزيد، مولى المنبعث عن زيد بن خالد  رضى الله عنه  أن أعرابيا، سأل النبي صلى الله عليه وسلم عن اللقطة قال ‏\"‏ عرفها سنة، فإن جاء أحد يخبرك بعفاصها ووكائها، وإلا فاستنفق بها ‏\"‏‏.‏ وسأله عن ضالة الإبل فتمعر وجهه، قال ‏\"‏ ما لك ولها معها سقاؤها وحذاؤها، ترد الماء وتأكل الشجر، دعها حتى يجدها ربها ‏\"‏‏.‏ وسأله عن ضالة الغنم‏.‏ فقال ‏\"‏ هي لك أو لأخيك، أو للذئب ‏\"‏‏.‏",
      "text_en": " Narrated Zaid bin Khalid:                     A bedouin asked the Prophet about the Luqata. The Prophet said, \"Make public announcement about it for one year and if then somebody comes and describes the container of the Luqata and the string it was tied with, (give it to him); otherwise, spend it.\" He then asked the Prophet about a lost camel. The face of the Prophet become red and he said, \"You have o concern with it as it has its water reservoir and feet and it will reach water and drink and eat trees. Leave it till its owner finds it.\" He then asked the Prophet about a lost sheep. The Prophet said, \"It is for you, for your brother, or for the wolf.\"",
      "chain": [
        "30388",
        "20005",
        "11162",
        "11238",
        "3625"
      ]
    },
    {
      "hadith_no": "2485",
      "source": " Sahih Bukhari ",
      "chapter": "Partnership - كتاب الشركة",
      "chapter_no": "47",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا الأوزاعي، حدثنا أبو النجاشي، قال سمعت رافع بن خديج  رضى الله عنه  قال كنا نصلي مع النبي صلى الله عليه وسلم العصر فننحر جزورا، فتقسم عشر قسم، فنأكل لحما نضيجا قبل أن تغرب الشمس‏.‏",
      "text_en": " Narrated Rafi` bin Khadij:                     We used to offer the `Asr prayer with the Prophet and slaughter a camel, the meat of which would be divided in ten parts. We would eat the cooked meat before sunset.",
      "chain": [
        "30388",
        "20024",
        "1986"
      ]
    },
    {
      "hadith_no": "2632",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا الأوزاعي، قال حدثني عطاء، عن جابر  رضى الله عنه  قال كانت لرجال منا فضول أرضين فقالوا نؤاجرها بالثلث والربع والنصف‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ من كانت له أرض فليزرعها أو ليمنحها أخاه، فإن أبى فليمسك أرضه ‏\"‏‏.‏",
      "text_en": " Narrated Jabir:                     Some men had superfluous land and they said that they would give it to others to cultivate on the condition that they would get one-third or one-fourth or one half of its yield. The Prophet said, \"Whoever has land should cultivate it himself or give it to his brother or keep it uncultivated.\"",
      "chain": [
        "30388",
        "20024",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "2633",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "وقال محمد بن يوسف حدثنا الأوزاعي، حدثني الزهري، حدثني عطاء بن يزيد، حدثني أبو سعيد، قال جاء أعرابي إلى النبي صلى الله عليه وسلم فسأله عن الهجرة، فقال ‏\"‏ ويحك إن الهجرة شأنها شديد فهل لك من إبل ‏\"‏ قال نعم‏.‏ قال ‏\"‏ فتعطي صدقتها ‏\"‏‏.‏ قال نعم‏.‏ قال ‏\"‏ فهل تمنح منها شيئا ‏\"‏‏.‏ قال نعم‏.‏ قال ‏\"‏ فتحلبها يوم وردها ‏\"‏‏.‏ قال نعم‏.‏ قال ‏\"‏ فاعمل من وراء البحار، فإن الله لن يترك من عملك شيئا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id:                      A bedouin came to the Prophet and asked him about emigration. The Prophet said to him, \"May Allah be merciful to you. The matter of emigration is difficult. Have you got some camels?\" He replied in the affirmative. The Prophet asked him, \"Do you pay their Zakat?\" He replied in the affirmative. He asked, \"Do you lend them so that their milk may be utilized by others?\" The bedouin said, \"Yes.\" The Prophet asked, \"Do you milk them on the day off watering them?\" He replied, \"Yes.\" The Prophet said, \"Do good deeds beyond the merchants (or the sea) and Allah will never disregard any of your deeds.\" (See Hadith No. 260, Vol. 5)",
      "chain": [
        "30388",
        "20024",
        "11013",
        "11206",
        "38"
      ]
    },
    {
      "hadith_no": "2747",
      "source": " Sahih Bukhari ",
      "chapter": "Wills and Testaments (Wasaayaa) - كتاب الوصايا",
      "chapter_no": "55",
      "text_ar": "حدثنا محمد بن يوسف، عن ورقاء، عن ابن أبي نجيح، عن عطاء، عن ابن عباس  رضى الله عنهما  قال كان المال للولد، وكانت الوصية للوالدين، فنسخ الله من ذلك ما أحب، فجعل للذكر مثل حظ الأنثيين، وجعل للأبوين لكل واحد منهما السدس، وجعل للمرأة الثمن والربع، وللزوج الشطر والربع‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The custom (in old days) was that the property of the deceased would be inherited by his offspring; as for the parents (of the deceased), they would inherit by the will of the deceased. Then Allah cancelled from that custom whatever He wished and fixed for the male double the amount inherited by the female, and for each parent a sixth (of the whole legacy) and for the wife an eighth or a fourth and for the husband a half or a fourth.",
      "chain": [
        "30388",
        "20363",
        "11254",
        "11029",
        "17"
      ]
    },
    {
      "hadith_no": "2750",
      "source": " Sahih Bukhari ",
      "chapter": "Wills and Testaments (Wasaayaa) - كتاب الوصايا",
      "chapter_no": "55",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا الأوزاعي، عن الزهري، عن سعيد بن المسيب، وعروة بن الزبير، أن حكيم بن حزام  رضى الله عنه  قال سألت رسول الله صلى الله عليه وسلم فأعطاني، ثم سألته فأعطاني ثم قال لي ‏\"‏ يا حكيم، إن هذا المال خضر حلو، فمن أخذه بسخاوة نفس بورك له فيه، ومن أخذه بإشراف نفس لم يبارك له فيه، وكان كالذي يأكل ولا يشبع، واليد العليا خير من اليد السفلى ‏\"‏‏.‏ قال حكيم فقلت يا رسول الله، والذي بعثك بالحق لا أرزأ أحدا بعدك شيئا حتى أفارق الدنيا‏.‏ فكان أبو بكر يدعو حكيما ليعطيه العطاء فيأبى أن يقبل منه شيئا، ثم إن عمر دعاه ليعطيه فيأبى أن يقبله فقال يا معشر المسلمين، إني أعرض عليه حقه الذي قسم الله له من هذا الفىء فيأبى أن يأخذه‏.‏ فلم يرزأ حكيم أحدا من الناس بعد النبي صلى الله عليه وسلم حتى توفي رحمه الله‏.‏",
      "text_en": " Narrated `Urwa bin Az-Zubair:                     Hakim bin Hizam said, \"I asked Allah's Apostle for something, and he gave me, and I asked him again and he gave me and said, 'O Hakim! This wealth is green and sweet (i.e. as tempting as fruits), and whoever takes it without greed then he is blessed in it, and whoever takes it with greediness, he is not blessed in it and he is like one who eats and never gets satisfied. The upper (i.e. giving) hand is better than the lower (i.e. taking) hand.\" Hakim added, \"I said, O Allah's Apostle! By Him Who has sent you with the Truth I will never demand anything from anybody after you till I die.\" Afterwards Abu Bakr used to call Hakim to give him something but he refused to accept anything from him. Then `Umar called him to give him (something) but he refused. Then `Umar said, \"O Muslims! I offered to him (i.e. Hakim) his share which Allah has ordained for him from this booty and he refuses to take it.\" Thus Hakim did not ask anybody for anything after the Prophet, till he died--may Allah bestow His mercy upon him.",
      "chain": [
        "30388",
        "20024",
        "11013",
        "11002",
        "10511",
        "423"
      ]
    },
    {
      "hadith_no": "2824",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا حاتم، عن محمد بن يوسف، عن السائب بن يزيد، قال صحبت طلحة بن عبيد الله وسعدا والمقداد بن الأسود وعبد الرحمن بن عوف  رضى الله عنهم  فما سمعت أحدا، منهم يحدث عن رسول الله صلى الله عليه وسلم، إلا أني سمعت طلحة يحدث عن يوم أحد‏.‏",
      "text_en": " Narrated As-Sa'-ib bin Yazid:                     I was in the company of Talha bin 'Ubaidullah, Sa`d, Al-Miqdad bin Al-Aswad and `Abdur Rahman bin `Auf and I heard none of them narrating anything from Allah's Apostle but Talha was talking about the day (of the battle) of Uhud.",
      "chain": [
        "30367",
        "20159",
        "30388",
        "3048"
      ]
    },
    {
      "hadith_no": "2992",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن عاصم، عن أبي عثمان، عن أبي موسى الأشعري  رضى الله عنه  قال كنا مع رسول الله صلى الله عليه وسلم، فكنا إذا أشرفنا على واد هللنا وكبرنا ارتفعت أصواتنا، فقال النبي صلى الله عليه وسلم ‏\"‏ يا أيها الناس، اربعوا على أنفسكم، فإنكم لا تدعون أصم ولا غائبا، إنه معكم، إنه سميع قريب، تبارك اسمه وتعالى جده ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa Al-Ash`ari:                     We were in the company of Allah's Apostle (during Hajj). Whenever we went up a high place we used to say: \"None has the right to be worshipped but Allah, and Allah is Greater,\" and our voices used to rise, so the Prophet said, \"O people! Be merciful to yourselves (i.e. don't raise your voice), for you are not calling a deaf or an absent one, but One Who is with you, no doubt He is All-Hearer, ever Near (to all things).",
      "chain": [
        "30388",
        "20005",
        "11080",
        "11113",
        "41"
      ]
    },
    {
      "hadith_no": "2993",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن حصين بن عبد الرحمن، عن سالم بن أبي الجعد، عن جابر بن عبد الله  رضى الله عنهما  قال كنا إذا صعدنا كبرنا، وإذا نزلنا سبحنا‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     Whenever we went up a place we would say, \"Allahu--Akbar (i.e. Allah is Greater)\", and whenever we went down a place we would say, \"Subhan Allah.\"",
      "chain": [
        "30388",
        "20005",
        "15097",
        "11342",
        "34"
      ]
    },
    {
      "hadith_no": "3060",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن الأعمش، عن أبي وائل، عن حذيفة  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ اكتبوا لي من تلفظ بالإسلام من الناس ‏\"‏‏.‏ فكتبنا له ألفا وخمسمائة رجل، فقلنا نخاف ونحن ألف وخمسمائة فلقد رأيتنا ابتلينا حتى إن الرجل ليصلي وحده وهو خائف‏.‏",
      "text_en": " Narrated Hudhaifa:                     The Prophet said (to us), \" List the names of those people who have announced that they are Muslims.\" So, we listed one thousand and five hundred men. Then we wondered, \"Should we be afraid (of infidels) although we are one thousand and five hundred in number?\" No doubt, we witnessed ourselves being afflicted with such bad trials that one would have to offer the prayer alone in fear.",
      "chain": [
        "30388",
        "20005",
        "11060",
        "11353",
        "145"
      ]
    },
    {
      "hadith_no": "3115",
      "source": " Sahih Bukhari ",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن الأعمش، عن سالم بن أبي الجعد، عن جابر بن عبد الله الأنصاري، قال ولد لرجل منا غلام فسماه القاسم فقالت الأنصار لا نكنيك أبا القاسم ولا ننعمك عينا، فأتى النبي صلى الله عليه وسلم فقال يا رسول الله ولد لي غلام، فسميته القاسم فقالت الأنصار لا نكنيك أبا القاسم ولا ننعمك عينا‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ أحسنت الأنصار، سموا باسمي، ولا تكنوا بكنيتي، فإنما أنا قاسم ‏\"‏‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah Al-Ansari:                     A man amongst us begot a boy whom he named Al-Qasim. On that the Ansar said, (to the man), \"We will never call you Abu-al-Qasim and will never please you with this blessed title.\" So, he went to the Prophet and said, \"O Allah's Apostle! I have begotten a boy whom I named Al-Qasim and the Ansar said, 'We will never call you Abu-al-Qasim, nor will we please you with this title.' \" The Prophet said, \"The Ansar have done well. Name by my name, but do not name by my Kunya, for I am Qasim.\"",
      "chain": [
        "30388",
        "20005",
        "11060",
        "11342",
        "34"
      ]
    },
    {
      "hadith_no": "3143",
      "source": " Sahih Bukhari ",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا الأوزاعي، عن الزهري، عن سعيد بن المسيب، وعروة بن الزبير، أن حكيم بن حزام  رضى الله عنه  قال سألت رسول الله صلى الله عليه وسلم فأعطاني، ثم سألته فأعطاني، ثم قال لي ‏\"‏ يا حكيم، إن هذا المال خضر حلو، فمن أخذه بسخاوة نفس بورك له فيه، ومن أخذه بإشراف نفس لم يبارك له فيه، وكان كالذي يأكل ولا يشبع، واليد العليا خير من اليد السفلى ‏\"‏‏.‏ قال حكيم فقلت يا رسول الله، والذي بعثك بالحق لا أرزأ أحدا بعدك شيئا حتى أفارق الدنيا‏.‏ فكان أبو بكر يدعو حكيما ليعطيه العطاء، فيأبى أن يقبل منه شيئا، ثم إن عمر دعاه ليعطيه فأبى أن يقبل فقال يا معشر المسلمين، إني أعرض عليه حقه الذي قسم الله له من هذا الفىء، فيأبى أن يأخذه‏.‏ فلم يرزأ حكيم أحدا من الناس بعد النبي صلى الله عليه وسلم حتى توفي‏.‏",
      "text_en": " Narrated `Urwa bin Az-Zubair:                     Hakim bin Hizam said, \"I asked Allah's Apostle for something, and he gave me. I asked him again, and he gave me, and said to me. 'O Hakim! This wealth is like green sweet (i.e. fruit), and if one takes it without greed, then one is blessed in it, and if one takes it with greediness, then one is not blessed in it, and will be like the one who eats without satisfaction. And an upper (i.e. giving) hand is better than a lower (i.e. taking) hand,' I said, 'O Allah's Apostle! By Him Who has sent you with the Truth. I will not ask anyone for anything after you till I leave this world.\" So, when Abu Bakr during his Caliphate, called Hakim to give him (some money), Hakim refused to accept anything from him. Once `Umar called him (during his Caliphate) in order to give him something, but Hakim refused to accept it, whereupon `Umar said, \"O Muslims! I give him (i.e. Haklm) his right which Allah has assigned to him) from this Fai '(booty), but he refuses to take it.\" So Haklm never took anything from anybody after the Prophet till he died.",
      "chain": [
        "30388",
        "20024",
        "11013",
        "11002",
        "10511",
        "423"
      ]
    },
    {
      "hadith_no": "3199",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن الأعمش، عن إبراهيم التيمي، عن أبيه، عن أبي ذر  رضى الله عنه  قال قال النبي صلى الله عليه وسلم لأبي ذر حين غربت الشمس ‏\"‏ تدري أين تذهب ‏\"‏‏.‏ قلت الله ورسوله أعلم‏.‏ قال ‏\"‏ فإنها تذهب حتى تسجد تحت العرش، فتستأذن فيؤذن لها، ويوشك أن تسجد فلا يقبل منها، وتستأذن فلا يؤذن لها، يقال لها ارجعي من حيث جئت‏.‏ فتطلع من مغربها، فذلك قوله تعالى ‏{‏والشمس تجري لمستقر لها ذلك تقدير العزيز العليم ‏}‏‏\"‏‏.‏",
      "text_en": " Narrated Abu Dhar:                     The Prophet asked me at sunset, \"Do you know where the sun goes (at the time of sunset)?\" I replied, \"Allah and His Apostle know better.\" He said, \"It goes (i.e. travels) till it prostrates Itself underneath the Throne and takes the permission to rise again, and it is permitted and then (a time will come when) it will be about to prostrate itself but its prostration will not be accepted, and it will ask permission to go on its course but it will not be permitted, but it will be ordered to return whence it has come and so it will rise in the west. And that is the interpretation of the Statement of Allah: \"And the sun Runs its fixed course For a term (decreed). that is The Decree of (Allah) The Exalted in Might, The All- Knowing.\" (36.38)",
      "chain": [
        "30388",
        "20005",
        "11060",
        "11322",
        "11405",
        "23"
      ]
    },
    {
      "hadith_no": "3235",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثني محمد بن يوسف، حدثنا أبو أسامة، حدثنا زكرياء بن أبي زائدة، عن ابن الأشوع، عن الشعبي، عن مسروق، قال قلت لعائشة  رضى الله عنها  فأين قوله ‏{‏ثم دنا فتدلى * فكان قاب قوسين أو أدنى‏}‏ قالت ذاك جبريل كان يأتيه في صورة الرجل، وإنه أتاه هذه المرة في صورته التي هي صورته، فسد الأفق‏.‏",
      "text_en": " Narrated Masruq:                     I asked Aisha \"What about His Statement:-- \"Then he (Gabriel) approached And came closer, And was at a distance Of but two bow-lengths Or (even) nearer?\" (53.8-9) She replied, \"It was Gabriel who used to come to the Prophet in the figure of a man, but on that occasion, he came in his actual and real figure and (he was so huge) that he covered the whole horizon.\"",
      "chain": [
        "30388",
        "20318",
        "11338",
        "11052",
        "11018"
      ]
    },
    {
      "hadith_no": "3259",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن الأعمش، عن ذكوان، عن أبي سعيد، رضى الله عنه قال قال النبي صلى الله عليه وسلم ‏\"‏ أبردوا بالصلاة فإن شدة الحر من فيح جهنم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`d:                     The Prophet said, \"Delay the (Zuhr) Prayer till it gets cooler, for the severity of heat is from the increase in the heat of Hell (fire).",
      "chain": [
        "30388",
        "20005",
        "11060",
        "11161",
        "38"
      ]
    },
    {
      "hadith_no": "3285",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا الأوزاعي، عن يحيى بن أبي كثير، عن أبي سلمة، عن أبي هريرة  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ إذا نودي بالصلاة أدبر الشيطان وله ضراط، فإذا قضي أقبل، فإذا ثوب بها أدبر، فإذا قضي أقبل، حتى يخطر بين الإنسان وقلبه، فيقول اذكر كذا وكذا‏.‏ حتى لا يدري أثلاثا صلى أم أربعا فإذا لم يدر ثلاثا صلى أو أربعا سجد سجدتى السهو ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"When the call for the prayer is pronounced, Satan takes to his heels, passing wind with noise, When the call for the prayer is finished, he comes back. And when the Iqama is pronounced, he again takes to his heels, and after its completion, he returns again to interfere between the (praying) person and his heart, saying to him. 'Remember this or that thing.' till the person forgets whether he has offered three or four rak`at: so if one forgets whether he has prayed three or four rak`at, he should perform two prostrations of Sahu (i.e. forgetfulness).",
      "chain": [
        "30388",
        "20024",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "3398",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن عمرو بن يحيى، عن أبيه، عن أبي سعيد  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ الناس يصعقون يوم القيامة، فأكون أول من يفيق، فإذا أنا بموسى آخذ بقائمة من قوائم العرش، فلا أدري أفاق قبلي، أم جوزي بصعقة الطور ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id:                     The Prophet said, 'People will be struck unconscious on the Day of Resurrection and I will be the first to regain consciousness, and behold! There I will see Moses holding one of the pillars of Allah's Throne. I will wonder whether he has become conscious before me of he has been exempted, because of his unconsciousness at the Tur (mountain) which he received (on the earth).",
      "chain": [
        "30388",
        "20005",
        "11210",
        "11232",
        "38"
      ]
    },
    {
      "hadith_no": "3447",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن المغيرة بن النعمان، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ تحشرون حفاة عراة غرلا، ثم قرأ ‏{‏كما بدأنا أول خلق نعيده وعدا علينا إنا كنا فاعلين‏}‏ فأول من يكسى إبراهيم، ثم يؤخذ برجال من أصحابي ذات اليمين وذات الشمال فأقول أصحابي فيقال إنهم لم يزالوا مرتدين على أعقابهم منذ فارقتهم، فأقول كما قال العبد الصالح عيسى ابن مريم ‏{‏وكنت عليهم شهيدا ما دمت فيهم فلما توفيتني كنت أنت الرقيب عليهم وأنت على كل شىء شهيد‏}‏ إلى قوله ‏{‏العزيز الحكيم‏}‏‏\"‏‏.‏ قال محمد بن يوسف ذكر عن أبي عبد الله عن قبيصة قال هم المرتدون الذين ارتدوا على عهد أبي بكر، فقاتلهم أبو بكر  رضى الله عنه‏.‏",
      "text_en": " Narrted Ibn `Abbas:                     Allah's Apostle said, \"You will be resurrected (and assembled) bare-footed, naked and uncircumcised.\" The Prophet then recited the Divine Verse:-- \"As We began the first creation, We shall repeat it: A promise We have undertaken. Truly we shall do it.\" (21.104) He added, \"The first to be dressed will be Abraham. Then some of my companions will take to the right and to the left. I will say: 'My companions! 'It will be said, 'They had been renegades since you left them.' I will then say what the Pious Slave Jesus, the son of Mary said: 'And I was a witness over them while I dwelt amongst them; when You did take me up, You were the Watcher over them, and You are a Witness to all things. If You punish them, they are Your slaves, and if you forgive them, You, only You are the All-Mighty the All-Wise.' \" (5.117-118) Narrated Quaggas, \"Those were the apostates who renegade from Islam during the Caliphate of Abu Bakr who fought them\".",
      "chain": [
        "30388",
        "20005",
        "11655",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "3458",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن الأعمش، عن أبي الضحى، عن مسروق، عن عائشة  رضى الله عنها كانت تكره أن يجعل ‏{‏المصلي‏}‏ يده في خاصرته وتقول إن اليهود تفعله‏.‏ تابعه شعبة عن الأعمش‏.‏",
      "text_en": " Narrated `Aisha:                     That she used to hate that one should keep his hands on his flanks while praying. She said that the Jew used to do so.",
      "chain": [
        "30388",
        "20005",
        "11060",
        "11392",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "3658",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا أحمد بن يزيد بن إبراهيم أبو الحسن الحراني، حدثنا زهير بن معاوية، حدثنا أبو إسحاق، سمعت البراء بن عازب، يقول جاء أبو بكر  رضى الله عنه  إلى أبي في منزله، فاشترى منه رحلا فقال لعازب ابعث ابنك يحمله معي‏.‏ قال فحملته معه، وخرج أبي ينتقد ثمنه، فقال له أبي يا أبا بكر حدثني كيف صنعتما حين سريت مع رسول الله صلى الله عليه وسلم قال نعم أسرينا ليلتنا، ومن الغد حتى قام قائم الظهيرة، وخلا الطريق لا يمر فيه أحد، فرفعت لنا صخرة طويلة، لها ظل لم تأت عليه الشمس فنزلنا عنده، وسويت للنبي صلى الله عليه وسلم مكانا بيدي ينام عليه، وبسطت فيه فروة، وقلت نم يا رسول الله، وأنا أنفض لك ما حولك‏.‏ فنام وخرجت أنفض ما حوله، فإذا أنا براع مقبل بغنمه إلى الصخرة يريد منها مثل الذي أردنا فقلت لمن أنت يا غلام فقال لرجل من أهل المدينة أو مكة‏.‏ قلت أفي غنمك لبن قال نعم‏.‏ قلت أفتحلب قال نعم‏.‏ فأخذ شاة‏.‏ فقلت انفض الضرع من التراب والشعر والقذى‏.‏ قال فرأيت البراء يضرب إحدى يديه على الأخرى ينفض، فحلب في قعب كثبة من لبن، ومعي إداوة حملتها للنبي صلى الله عليه وسلم يرتوي منها، يشرب ويتوضأ، فأتيت النبي صلى الله عليه وسلم فكرهت أن أوقظه، فوافقته حين استيقظ، فصببت من الماء على اللبن حتى برد أسفله، فقلت اشرب يا رسول الله  قال  فشرب، حتى رضيت ثم قال ‏\"‏ ألم يأن للرحيل ‏\"‏‏.‏ قلت بلى  قال  فارتحلنا بعد ما مالت الشمش، واتبعنا سراقة بن مالك، فقلت أتينا يا رسول الله‏.‏ فقال ‏\"‏ لا تحزن، إن الله معنا ‏\"‏‏.‏ فدعا عليه النبي صلى الله عليه وسلم فارتطمت به فرسه إلى بطنها  أرى في جلد من الأرض، شك زهير  فقال إني أراكما قد دعوتما على فادعوا لي، فالله لكما أن أرد عنكما الطلب‏.‏ فدعا له النبي صلى الله عليه وسلم فنجا فجعل لا يلقى أحدا إلا قال كفيتكم ما هنا‏.‏ فلا يلقى أحدا إلا رده‏.‏ قال ووفى لنا‏.‏",
      "text_en": " Narrated Al-Bara' bin `Azib:                     Abu Bakr came to my father who was at home and purchased a saddle from him. He said to `Azib. \"Tell your son to carry it with me.\" So I carried it with him and my father followed us so as to take the price (of the saddle). My father said, \"O Abu Bakr! Tell me what happened to you on your night journey with Allah's Apostle (during Migration).\" He said, \"Yes, we travelled the whole night and also the next day till midday. when nobody could be seen on the way ( because of the severe heat) . Then there appeared a long rock having shade beneath it, and the sunshine had not come to it yet. So we dismounted there and I levelled a place and covered it with an animal hide or dry grass for the Prophet to sleep on (for a while). I then said, 'Sleep, O Allah's Apostle, and I will guard you.' So he slept and I went out to guard him. Suddenly I saw a shepherd coming with his sheep to that rock with the same intention we had when we came to it. I asked (him). 'To whom do you belong, O boy?' He replied, 'I belong to a man from Medina or Mecca.' I said, 'Do your sheep have milk?' He said, 'Yes.' I said, 'Will you milk for us?' He said, 'Yes.' He caught hold of a sheep and I asked him to clean its teat from dust, hairs and dirt. (The sub-narrator said that he saw Al-Bara' striking one of his hands with the other, demonstrating how the shepherd removed the dust.) The shepherd milked a little milk in a wooden container and I had a leather container which I carried for the Prophet to drink and perform the ablution from. I went to the Prophet, hating to wake him up, but when I reached there, the Prophet had already awakened; so I poured water over the middle part of the milk container, till the milk was cold. Then I said, 'Drink, O Allah's Apostle!' He drank till I was pleased. Then he asked, 'Has the time for our departure come?' I said, 'Yes.' So we departed after midday. Suraqa bin Malik followed us and I said, 'We have been discovered, O Allah's Apostle!' He said, Don't grieve for Allah is with us.' The Prophet invoked evil on him (i.e. Suraqa) and so the legs of his horse sank into the earth up to its belly. (The subnarrator, Zuhair is not sure whether Abu Bakr said, \"(It sank) into solid earth.\") Suraqa said, 'I see that you have invoked evil on me. Please invoke good on me, and by Allah, I will cause those who are seeking after you to return.' The Prophet invoked good on him and he was saved. Then, whenever he met somebody on the way, he would say, 'I have looked for him here in vain.' So he caused whomever he met to return. Thus Suraqa fulfilled his promise.\"",
      "chain": [
        "30388",
        "20321",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "3971",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا الوليد بن مسلم، حدثنا الأوزاعي،‏.‏ وقال محمد بن يوسف حدثنا الأوزاعي، حدثنا الزهري، قال حدثني عطاء بن يزيد الليثي، قال حدثني أبو سعيد  رضى الله عنه  قال جاء أعرابي إلى النبي صلى الله عليه وسلم فسأله عن الهجرة فقال ‏\"‏ ويحك إن الهجرة شأنها شديد، فهل لك من إبل ‏\"‏‏.‏ قال نعم‏.‏ قال ‏\"‏ فتعطي صدقتها ‏\"‏‏.‏ قال نعم‏.‏ قال ‏\"‏ فهل تمنح منها ‏\"‏‏.‏ قال نعم‏.‏ قال ‏\"‏ فتحلبها يوم ورودها ‏\"‏‏.‏ قال نعم‏.‏ قال ‏\"‏ فاعمل من وراء البحار، فإن الله لن يترك من عملك شيئا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id:                     Once a bedouin came to the Prophet and asked him about the migration. The Prophet said, \"Mercy of Allah be on you! The migration is a quite difficult matter. Have you got some camels?\" He replied in the affirmative. Then the Prophet said, \"Do you give their Zakat?\" He replied in the affirmative. The Prophet said, \"Do you let others benefit by their milk gratis?\" He replied in the affirmative. Then the Prophet asked, \"Do you milk them on their watering days and give their milk to the poor and needy?\" He replied in the affirmative. The Prophet, said, \"Go on doing like this from beyond the seas, and there is no doubt that Allah will not overlook any of your good deeds.\"",
      "chain": [
        "30026",
        "20733",
        "20024",
        "30388",
        "20024",
        "11013",
        "11206",
        "38"
      ]
    },
    {
      "hadith_no": "3985",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن حميد، عن أنس  رضى الله عنه  قال قدم عبد الرحمن بن عوف، فآخى النبي صلى الله عليه وسلم بينه وبين سعد بن الربيع الأنصاري، فعرض عليه أن يناصفه أهله وماله، فقال عبد الرحمن بارك الله لك في أهلك ومالك، دلني على السوق‏.‏ فربح شيئا من أقط وسمن، فرآه النبي صلى الله عليه وسلم بعد أيام وعليه وضر من صفرة، فقال النبي صلى الله عليه وسلم ‏\"‏ مهيم يا عبد الرحمن ‏\"‏‏.‏ قال يا رسول الله، تزوجت امرأة من الأنصار‏.‏ قال ‏\"‏ فما سقت فيها ‏\"‏‏.‏ فقال وزن نواة من ذهب‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ أولم ولو بشاة ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     When `Abdur-Rahman bin `Auf came to Medina and the Prophet established the bond of brotherhood between him and Sa`d bin Ar-Rabi-al-Ansari, Saud suggested that `Abdur-Rahman should accept half of his property and family. `Abdur Rahman said, \"May Allah bless you in your family and property; guide me to the market.\" So `Abdur-Rahman (while doing business in the market) made some profit of some condensed dry yoghurt and butter. After a few days the Prophet saw him wearing clothes stained with yellow perfume. The Prophet asked, \"What is this, O `Abdur-Rahman?\" He said, \"O Allah's Apostle! I have married an Ansar' woman.\" The Prophet asked, \"What have you given her as Mahr?\" He (i.e. `Abdur-Rahman) said, \"A piece of gold, about the weight of a date stone.\" Then the Prophet said, Give a banquet, even though of a sheep.\"",
      "chain": [
        "30388",
        "20005",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "3995",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن عوف، عن أبي عثمان، قال سمعت سلمان  رضى الله عنه  يقول أنا من، رام هرمز‏.‏",
      "text_en": " Narrated Salman:                     I am from Ram-Hurmuz (i.e. a Persian town).",
      "chain": [
        "30388",
        "20005",
        "11298",
        "11113"
      ]
    },
    {
      "hadith_no": "4101",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا محمد بن يوسف، عن ابن عيينة، عن عمرو، عن جابر  رضى الله عنه  قال نزلت هذه الآية فينا ‏{‏إذ همت طائفتان منكم أن تفشلا‏}‏ بني سلمة وبني حارثة، وما أحب أنها لم تنزل، والله يقول ‏{‏والله وليهما‏}‏",
      "text_en": " Narrated Jabir:                     This Verse: \"When two of your parties almost Decided to fall away...\" was revealed in our connection, i.e. Bani Salama and Bani Haritha and I would not have liked that, if it was not revealed, for Allah said:-- But Allah was their Protector.....(3.122)",
      "chain": [
        "30388",
        "20005",
        "11081",
        "34"
      ]
    },
    {
      "hadith_no": "4111",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبد الله بن أبي الأسود، حدثنا حاتم بن إسماعيل، عن محمد بن يوسف، قال سمعت السائب بن يزيد، قال صحبت عبد الرحمن بن عوف وطلحة بن عبيد الله والمقداد وسعدا رضى الله عنهم فما سمعت أحدا منهم يحدث عن النبي صلى الله عليه وسلم، إلا أني سمعت طلحة يحدث عن يوم أحد",
      "text_en": " Narrated As-Saib bin Yazid:                     I have been in the company of `AbdurRahman bin `Auf, Talha bin 'Ubaidullah, Al-Miqdad and Sa`d, and I heard none of them narrating anything from the Prophet excepting the fact that I heard Talha narrating about the day of Uhud (battle) .",
      "chain": [
        "30145",
        "20159",
        "30388",
        "3048"
      ]
    },
    {
      "hadith_no": "4443",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا أبو اليمان، قال حدثني شعيب، عن الزهري، وقال، محمد بن يوسف حدثنا الأوزاعي، قال أخبرني ابن شهاب، عن سليمان بن يسار، عن ابن عباس  رضى الله عنهما  أن امرأة، من خثعم استفتت رسول الله صلى الله عليه وسلم في حجة الوداع والفضل بن عباس رديف رسول الله صلى الله عليه وسلم فقالت يا رسول الله إن فريضة الله على عباده أدركت أبي شيخا كبيرا لا يستطيع أن يستوي على الراحلة، فهل يقضي أن أحج عنه قال ‏\"‏ نعم ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     A woman from the tribe of Khath'am asked for the verdict of Allah's Apostle (regarding something) during Hajjat-ul-Wada` while Al-Fadl bin `Abbas was the companion-rider behind Allah's Apostle. She asked, \"Allah's ordained obligation (i.e. compulsory Hajj) enjoined on His slaves has become due on my old father who cannot sit firmly on the riding animal. Will it be sufficient if I perform the Hajj on his behalf?\" He said, \"Yes.\"",
      "chain": [
        "30330",
        "20428",
        "11013",
        "30388",
        "20024",
        "11013",
        "11005",
        "17"
      ]
    },
    {
      "hadith_no": "4451",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان الثوري، عن قيس بن مسلم، عن طارق بن شهاب، أن أناسا، من اليهود قالوا لو نزلت هذه الآية فينا لاتخذنا ذلك اليوم عيدا‏.‏ فقال عمر أية آية فقالوا ‏{‏اليوم أكملت لكم دينكم وأتممت عليكم نعمتي‏}‏‏.‏ فقال عمر إني لأعلم أى مكان أنزلت، أنزلت ورسول الله صلى الله عليه وسلم واقف بعرفة‏.‏",
      "text_en": " Narrated Tariq bin Shibab:                     Some Jews said, \"Had this Verse been revealed to us, we would have taken that day as `Id (festival).\" `Umar said, \"What Verse?\" They said:-- \"This day I have Perfected your religion for you, Completed My Favor upon you And have chosen for you Islam as your religion\" (5.3) `Umar said, \"I know the place where it was revealed; It was revealed while Allah's Apostle was staying at `Arafat.\"",
      "chain": [
        "30388",
        "20012",
        "11386",
        "3680"
      ]
    },
    {
      "hadith_no": "4537",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن عاصم بن سليمان، قال سألت أنس بن مالك  رضى الله عنه  عن الصفا، والمروة،‏.‏ فقال كنا نرى أنهما من أمر الجاهلية، فلما كان الإسلام أمسكنا عنهما، فأنزل الله تعالى ‏{‏إن الصفا والمروة ‏}‏ إلى قوله ‏{‏أن يطوف بهما‏}‏‏.‏",
      "text_en": " Narrated `Asim bin Sulaiman:                     I asked Anas bin Malik about Safa and Marwa. Anas replied, \"We used to consider (i.e. going around) them a custom of the Pre-islamic period of Ignorance, so when Islam came, we gave up going around them. Then Allah revealed\" \"Verily, Safa and Marwa (i.e. two mountains at Mecca) are among the Symbols of Allah. So it is not harmful of those who perform the Hajj of the House (of Allah) or perform the Umra to ambulate (Tawaf) between them.\" (2.158)",
      "chain": [
        "30388",
        "20005",
        "11080",
        "19"
      ]
    },
    {
      "hadith_no": "4585",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "وقال لنا محمد بن يوسف عن سفيان، عن منصور، والأعمش، عن أبي الضحى، عن مسروق، عن عائشة، قالت لما أنزلت الآيات من آخر سورة البقرة قام رسول الله صلى الله عليه وسلم فقرأهن علينا، ثم حرم التجارة في الخمر‏.‏",
      "text_en": "",
      "chain": [
        "30388",
        "20005",
        "11067",
        "11060",
        "11392",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "4599",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن يوسف، عن سفيان، عن ميسرة، عن أبي حازم، عن أبي هريرة   رضى الله عنه  ‏{‏كنتم خير أمة أخرجت للناس‏}‏ قال خير الناس للناس، تأتون بهم في السلاسل في أعناقهم حتى يدخلوا في الإسلام‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Verse:--\"You (true Muslims) are the best of peoples ever raised up for mankind.\" means, the best of peoples for the people, as you bring them with chains on their necks till they embrace Islam.",
      "chain": [
        "30388",
        "20005",
        "11658",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "4621",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن يوسف، عن ورقاء، عن ابن أبي نجيح، عن عطاء، عن ابن عباس  رضى الله عنهما  قال كان المال للولد، وكانت الوصية للوالدين، فنسخ الله من ذلك ما أحب، فجعل للذكر مثل حظ الأنثيين، وجعل للأبوين لكل واحد منهما السدس والثلث، وجعل للمرأة الثمن والربع، وللزوج الشطر والربع‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     (In the Pre-Islamic Period ) the children used to inherit all the property but the parents used to inherit only through a will. So Allah cancelled that which He liked to cancel and put decreed that the share of a son was to be twice the share of a daughter, and for the parents one-sixth for each one of them, or one third, and for the wife one-eighth or one-fourth, and for the husband one-half, or one-fourth.",
      "chain": [
        "30388",
        "20363",
        "11254",
        "11029",
        "17"
      ]
    },
    {
      "hadith_no": "4637",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن يوسف، عن إسرائيل، عن أبي إسحاق، عن البراء، قال لما نزلت ‏{‏لا يستوي القاعدون من المؤمنين‏}‏ قال النبي صلى الله عليه وسلم ‏\"‏ ادعوا فلانا ‏\"‏‏.‏ فجاءه ومعه الدواة واللوح أو الكتف فقال ‏\"‏ اكتب لا يستوي القاعدون من المؤمنين والمجاهدون في سبيل الله ‏\"‏‏.‏ وخلف النبي صلى الله عليه وسلم ابن أم مكتوم فقال يا رسول الله أنا ضرير‏.‏ فنزلت مكانها ‏{‏لا يستوي القاعدون من المؤمنين غير أولي الضرر والمجاهدون في سبيل الله ‏}‏",
      "text_en": " Narrated Al-Bara:                     When the Verse:--\"Not equal are those of the believers who sit (at home),\" (4.95) was revealed, the Prophet said, \"Call so-and-so.\" That person came to him with an ink-pot and a wooden board or a shoulder scapula bone. The Prophet said (to him), \"Write: 'Not equal are those believers who sit (at home) and those who strive and fight in the Cause of Allah.\" Ibn Um Maktum who was sitting behind the Prophet then said, \"O Allah's Apostle! I am a blind man.\" So there was revealed in the place of that Verse, the Verse:--\"Not equal are those of the believers who sit (at home) except those who are disabled (by injury, or are blind or lame etc.) and those who strive and fight in the Cause of Allah.\" (4.95)",
      "chain": [
        "30388",
        "20311",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "4655",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن إسماعيل، عن الشعبي، عن مسروق، عن عائشة  رضى الله عنها  قالت من حدثك أن محمدا صلى الله عليه وسلم كتم شيئا مما أنزل عليه، فقد كذب، والله يقول ‏{‏يا أيها الرسول بلغ ما أنزل إليك‏}‏ الآية‏.‏",
      "text_en": " Narrated `Aisha:                     Whoever tells that Muhammad concealed part of what was revealed to him, is a liar, for Allah says:-- \"O Apostle (Muhammad)! Proclaim (the Message) which has been sent down to you from your Lord.\" (5.67)",
      "chain": [
        "30388",
        "20005",
        "11418",
        "11052",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "4683",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن عمرو بن يحيى المازني، عن أبيه، عن أبي سعيد الخدري  رضى الله عنه  قال جاء رجل من اليهود إلى النبي صلى الله عليه وسلم قد لطم وجهه وقال يا محمد إن رجلا من أصحابك من الأنصار لطم وجهي‏.‏ قال ‏\"‏ ادعوه ‏\"‏‏.‏ فدعوه قال ‏\"‏ لم لطمت وجهه ‏\"‏‏.‏ قال يا رسول الله، إني مررت باليهود فسمعته يقول والذي اصطفى موسى على البشر‏.‏ فقلت وعلى محمد وأخذتني غضبة فلطمته‏.‏ قال ‏\"‏ لا تخيروني من بين الأنبياء، فإن الناس يصعقون يوم القيامة فأكون أول من يفيق، فإذا أنا بموسى آخذ بقائمة من قوائم العرش، فلا أدري أفاق قبلي أم جزي بصعقة الطور ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     A man from the Jews, having been slapped on his face, came to the Prophet and said, \"O Muhammad! A man from your companions from the Ansar has slapped me on my face!\" The Prophet said, \"Call him.\" When they called him, the Prophet said, \"Why did you slap him?\" He said, \"O Allah's Apostle! While I was passing by the Jews, I heard him saying, 'By Him Who selected Moses above the human beings,' I said, 'Even above Muhammad?' I became furious and slapped him on the face.\" The Prophet said, \"Do not give me superiority over the other prophets, for on the Day of Resurrection the people will become unconscious and I will be the first to regain consciousness. Then I will see Moses holding one of the legs of the Throne. I will not know whether he has come to his senses before me or that the shock he had received at the Mountain, (during his worldly life) was sufficient for him.\"",
      "chain": [
        "30388",
        "20005",
        "11210",
        "11232",
        "38"
      ]
    },
    {
      "hadith_no": "4691",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا ورقاء، عن ابن أبي نجيح، عن مجاهد، عن ابن عباس، ‏{‏إن شر الدواب عند الله الصم البكم الذين لا يعقلون‏}‏ قال هم نفر من بني عبد الدار‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Regarding the Verse: \"Verily! The worst of beasts in the Sight of Allah are the deaf and the dumb---- those who understand not.\" (8.22) (The people referred to here) were some persons from the tribe of Bani `Abd-Addar.",
      "chain": [
        "30388",
        "20363",
        "11254",
        "11028"
      ]
    },
    {
      "hadith_no": "4792",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا إسحاق، حدثنا محمد بن يوسف، حدثنا الأوزاعي، قال حدثني الزهري، عن سهل بن سعد، أن عويمرا، أتى عاصم بن عدي وكان سيد بني عجلان فقال كيف تقولون في رجل وجد مع امرأته رجلا، أيقتله فتقتلونه أم كيف يصنع سل لي رسول الله صلى الله عليه وسلم عن ذلك فأتى عاصم النبي صلى الله عليه وسلم فقال يا رسول الله، فكره رسول الله صلى الله عليه وسلم المسائل، فسأله عويمر فقال إن رسول الله صلى الله عليه وسلم كره المسائل وعابها، قال عويمر والله لا أنتهي حتى أسأل رسول الله صلى الله عليه وسلم عن ذلك فجاء عويمر فقال يا رسول الله رجل وجد مع امرأته رجلا، أيقتله فتقتلونه أم كيف يصنع فقال رسول الله صلى الله عليه وسلم ‏\"‏ قد أنزل الله القرآن فيك وفي صاحبتك ‏\"‏‏.‏ فأمرهما رسول الله صلى الله عليه وسلم بالملاعنة بما سمى الله في كتابه، فلاعنها ثم قال يا رسول الله، إن حبستها فقد ظلمتها، فطلقها، فكانت سنة لمن كان بعدهما في المتلاعنين، ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ انظروا فإن جاءت به أسحم أدعج العينين عظيم الأليتين خدلج الساقين فلا أحسب عويمرا إلا قد صدق عليها، وإن جاءت به أحيمر كأنه وحرة فلا أحسب عويمرا، إلا قد كذب عليها ‏\"‏‏.‏ فجاءت به على النعت الذي نعت به رسول الله صلى الله عليه وسلم من تصديق عويمر، فكان بعد ينسب إلى أمه‏.‏",
      "text_en": " Narrated Sahl bin Saud:                     'Uwaimir came to `Asim bin `Adi who was the chief of Bani Ajlan and said, \"What do you say about a man who has found another man with his wife? Should he kill him whereupon you would kill him (i.e. the husband), or what should he do? Please ask Allah's Apostle about this matter on my behalf.\" `Asim then went to the Prophet and said, \"O Allah's Apostle! (And asked him that question) but Allah's Apostle disliked the question,\" When 'Uwaimir asked `Asim (about the Prophet's answer) `Asim replied that Allah's Apostle disliked such questions and considered it shameful. \"Uwaimir then said, \"By Allah, I will not give up asking unless I ask Allah's Apostle about it.\" Uwaimir came (to the Prophet ) and said, \"O Allah's Apostle! A man has found another man with his wife! Should he kill him whereupon you would kill him (the husband, in Qisas) or what should he do?\" Allah's Apostle said, \"Allah has revealed regarding you and your wife's case in the Qur'an \"So Allah's Apostle ordered them to perform the measures of Mula'ana according to what Allah had mentioned in His Book. So 'Uwaimir did Mula'ana with her and said, \"O Allah's Apostle! If I kept her I would oppress her.\" So 'Uwaimir divorced her and so divorce became a tradition after them for those who happened to be involved in a case of Mula'ana. Allah's Apostle then said, \"Look! If she (Uwaimir's wife) delivers a black child with deep black large eyes, big hips and fat legs, then I will be of the opinion that 'Uwaimir has spoken the truth; but if she delivers a red child looking like a Wahra then we will consider that 'Uwaimir has told a lie against her.\" Later on she delivered a child carrying the qualities which Allah's Apostle had mentioned as a proof for 'Uwaimir's claim; therefore the child was ascribed to its mother henceforth.",
      "chain": [
        "30312",
        "30388",
        "20024",
        "11013",
        "399"
      ]
    },
    {
      "hadith_no": "4802",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن الأعمش، عن أبي الضحى، عن مسروق، عن عائشة  رضى الله عنها  قالت جاء حسان بن ثابت يستأذن عليها قلت أتأذنين لهذا قالت أوليس قد أصابه عذاب عظيم‏.‏ قال سفيان تعني ذهاب بصره‏.‏ فقال حصان رزان ما تزن بريبة وتصبح غرثى من لحوم الغوافل قالت لكن أنت‏.‏ ‏.‏‏.‏ ‏.‏",
      "text_en": " Narrated Masruq:                     `Aisha said that Hassan bin Thabit came and asked permission to visit her. I said, \"How do you permit such a person?\" She said, \"Hasn't he received a severely penalty?\" (Sufyan, the subnarrator, said: She meant the loss of his sight.) Thereupon Hassan said the following poetic verse: \"A chaste pious woman who arouses no suspicion. She never talks about chaste heedless women behind their backs.' On that she said, \"But you are not so.\"",
      "chain": [
        "30388",
        "20005",
        "11060",
        "11392",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "4935",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن منصور، عن إبراهيم، عن علقمة، عن عبد الله، قال لعن الله الواشمات والموتشمات والمتنمصات والمتفلجات للحسن المغيرات خلق الله‏.‏ فبلغ ذلك امرأة من بني أسد يقال لها أم يعقوب، فجاءت فقالت إنه بلغني أنك لعنت كيت وكيت‏.‏ فقال وما لي لا ألعن من لعن رسول الله صلى الله عليه وسلم ومن هو في كتاب الله فقالت لقد قرأت ما بين اللوحين فما وجدت فيه ما تقول‏.‏ قال لئن كنت قرأتيه لقد وجدتيه، أما قرأت ‏{‏وما آتاكم الرسول فخذوه وما نهاكم عنه فانتهوا‏}‏‏.‏ قالت بلى‏.‏ قال فإنه قد نهى عنه‏.‏ قالت فإني أرى أهلك يفعلونه‏.‏ قال فاذهبي فانظري‏.‏ فذهبت فنظرت فلم تر من حاجتها شيئا، فقال لو كانت كذلك ما جامعتنا‏.‏",
      "text_en": " Narrated Alqama:                     `Abdullah (bin Masud) said. \"Allah curses those ladies who practice tattooing and those who get themselves tattooed, and those ladies who remove the hair from their faces and those who make artificial spaces between their teeth in order to look more beautiful whereby they change Allah's creation.\" His saying reached a lady from Bani Asd called Um Yaqub who came (to `Abdullah) and said, \"I have come to know that you have cursed such-and-such (ladies)?\" He replied, \"Why should I not curse these whom Allah's Apostle has cursed and who are (cursed) in Allah's Book!\" Um Yaqub said, \"I have read the whole Qur'an, but I did not find in it what you say.\" He said, \"Verily, if you have read it (i.e. the Qur'an), you have found it. Didn't you read: 'And whatsoever the Apostle gives you take it and whatsoever he forbids you, you abstain (from it). (59.7) She replied, \"Yes, I did,\" He said, \"Verily, Allah's Apostle forbade such things.\" \"She said, \"But I see your wife doing these things?\" He said, \"Go and watch her.\" She went and watched her but could not see anything in support of her statement. On that he said, \"If my wife was as you thought, I would not keep her in my company.\"",
      "chain": [
        "30388",
        "20005",
        "11067",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "5074",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا مالك بن مغول، حدثنا طلحة، قال سألت عبد الله بن أبي أوفى أوصى النبي صلى الله عليه وسلم فقال لا‏.‏ فقلت كيف كتب على الناس الوصية، أمروا بها ولم يوص قال أوصى بكتاب الله‏.‏",
      "text_en": " Narrated Talha:                     I asked `Abdullah bin Abi `Aufa, \"Did the Prophet make a will (to appoint his successor or bequeath wealth)?\" He replied, \"No.\" I said, \"How is it prescribed then for the people to make wills, and they are ordered to do so while the Prophet did not make any will?\" He said, \"He made a will wherein he recommended Allah's Book.\"",
      "chain": [
        "30388",
        "20358",
        "11356"
      ]
    },
    {
      "hadith_no": "5104",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن الأعمش، عن إبراهيم، عن عبيدة، عن عبد الله بن مسعود، قال قال لي النبي صلى الله عليه وسلم ‏\"‏ اقرأ على ‏\"‏‏.‏ قلت يا رسول الله آقرأ عليك وعليك أنزل قال ‏\"‏ نعم ‏\"‏‏.‏ فقرأت سورة النساء حتى أتيت إلى هذه الآية ‏{‏فكيف إذا جئنا من كل أمة بشهيد وجئنا بك على هؤلاء شهيدا‏}‏ قال ‏\"‏ حسبك الآن ‏\"‏‏.‏ فالتفت إليه فإذا عيناه تذرفان‏.‏",
      "text_en": " Narrated `Abdullah bin Mas`ud:                     The Prophet said to me, \"Recite (the Qur'an) to me.\" I said, \"O Allah's Apostle Shall I recite (the Qur'an) to you while it has been revealed to you?\" He said, \"Yes.\" So I recited Surat-An-Nisa' (The Women), but when I recited the Verse: 'How (will it be) then when We bring from each nation a witness and We bring you (O Muhammad) as a witness against these people.' (4.41) He said, \"Enough for the present,\" I looked at him and behold! His eyes were overflowing with tears",
      "chain": [
        "30388",
        "20005",
        "11060",
        "11051",
        "11370",
        "16"
      ]
    },
    {
      "hadith_no": "5188",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن هشام، عن أبيه، عن عائشة  رضى الله عنها  أن النبي صلى الله عليه وسلم تزوجها وهى بنت ست سنين، وأدخلت عليه وهى بنت تسع، ومكثت عنده تسعا‏.‏",
      "text_en": " Narrated `Aisha:                     that the Prophet married her when she was six years old and he consummated his marriage when she was nine years old, and then she remained with him for nine years (i.e., till his death).",
      "chain": [
        "30388",
        "20005",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "5227",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن منصور ابن صفية، عن أمه، صفية بنت شيبة قالت أولم النبي صلى الله عليه وسلم على بعض نسائه بمدين من شعير‏.‏",
      "text_en": " Narrated Safiyya bint Shaiba:                     The Prophet gave a banquet with two Mudds of barley on marrying some of his wives. (1 Mudd= 1 3/4 of a kilogram) .",
      "chain": [
        "30388",
        "20005",
        "11565",
        "2802"
      ]
    },
    {
      "hadith_no": "5259",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن هشام، عن أبيه، عن عبد الله بن زمعة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يجلد أحدكم امرأته جلد العبد، ثم يجامعها في آخر اليوم ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Zam`a:                     The Prophet said, \"None of you should flog his wife as he flogs a slave and then have sexual intercourse with her in the last part of the day.\"",
      "chain": [
        "30388",
        "20005",
        "11065",
        "10511",
        "192"
      ]
    },
    {
      "hadith_no": "5295",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن منصور، عن أبي وائل، عن عبد الله بن مسعود  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ لا تباشر المرأة المرأة فتنعتها لزوجها، كأنه ينظر إليها ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Mas`ud:                     The Prophet said, \"A woman should not look at or touch another woman to describe her to her husband in such a way as if he was actually looking at her.\"",
      "chain": [
        "30388",
        "20005",
        "11067",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "5424",
      "source": " Sahih Bukhari ",
      "chapter": "Supporting the Family - كتاب النفقات",
      "chapter_no": "69",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن هشام بن عروة، عن أبيه، عن عائشة  رضى الله عنها  قالت هند يا رسول الله إن أبا سفيان رجل شحيح فهل على جناح أن آخذ من ماله ما يكفيني وبني قال ‏\"‏ خذي بالمعروف ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     Hind (bint `Utba) said, \"O Allah's Apostle! Abu Sufyan is a miser. Is there any harm if I take of his property what will cover me and my children's needs?\" The Prophet said, \"Take (according to your needs) in a reasonable manner.\"",
      "chain": [
        "30388",
        "20005",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "5489",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن الأعمش، عن أبي وائل، عن أبي مسعود الأنصاري، قال كان من الأنصار رجل يقال له أبو شعيب، وكان له غلام لحام فقال اصنع لي طعاما أدعو رسول الله صلى الله عليه وسلم خامس خمسة، فدعا رسول الله صلى الله عليه وسلم خامس خمسة، فتبعهم رجل فقال النبي صلى الله عليه وسلم ‏\"‏ إنك دعوتنا خامس خمسة وهذا رجل قد تبعنا، فإن شئت أذنت له، وإن شئت تركته ‏\"‏‏.‏ قال بل أذنت له‏.‏",
      "text_en": " Narrated Abu Mas`ud Al-Ansari:                     There was a man called Abu Shu'aib, and he had a slave who was a butcher. He said (to his slave), \"Prepare a meal to which I may invite Allah's Apostle along with four other men.\" So he invited Allah's Apostle and four other men, but another man followed them whereupon the Prophet said, \"You have invited me as one of five guests, but now another man has followed us. If you wish you can admit him, and if you wish you can refuse him.\" On that the host said, \"But I admit him.\" Narrated Muhammad bin Isma`il: If guests are sitting at a dining table, they do not have the right to carry food from other tables to theirs, but they can pass on food from their own table to each other; otherwise they should leave it.",
      "chain": [
        "30388",
        "20005",
        "11060",
        "11353",
        "402"
      ]
    },
    {
      "hadith_no": "5498",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "وقال محمد بن يوسف عن سفيان، عن منصور ابن صفية، حدثتني أمي، عن عائشة  رضى الله عنها  قالت توفي رسول الله صلى الله عليه وسلم وقد شبعنا من الأسودين التمر والماء‏.‏",
      "text_en": "",
      "chain": [
        "30388",
        "20005",
        "11565",
        "2802",
        "53"
      ]
    },
    {
      "hadith_no": "5521",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن هشام بن عروة، عن أبيه، عن عائشة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا أقيمت الصلاة وحضر العشاء فابدءوا بالعشاء ‏\"‏‏.‏ قال وهيب ويحيى بن سعيد عن هشام ‏\"‏ إذا وضع العشاء ‏\"‏‏.‏",
      "text_en": " Narrated Aisha:                     The Prophet said, \"If the Iqama for (`Isha') prayer is proclaimed and supper is served, take your supper first.\"",
      "chain": [
        "30388",
        "20005",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "5707",
      "source": " Sahih Bukhari ",
      "chapter": "Patients - كتاب المرضى",
      "chapter_no": "75",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن الأعمش، عن إبراهيم التيمي، عن الحارث بن سويد، عن عبد الله  رضى الله عنه  أتيت النبي صلى الله عليه وسلم في مرضه وهو يوعك وعكا شديدا، وقلت إنك لتوعك وعكا شديدا‏.‏ قلت إن ذاك بأن لك أجرين‏.‏ قال ‏\"‏ أجل ما من مسلم يصيبه أذى، إلا حات الله عنه خطاياه، كما تحات ورق الشجر ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     I visited the Prophet during his ailments and he was suffering from a high fever. I said, \"You have a high fever. Is it because you will have a double reward for it?\" He said, \"Yes, for no Muslim is afflicted with any harm but that Allah will remove his sins as the leaves of a tree fall down.\"",
      "chain": [
        "30388",
        "20005",
        "11060",
        "11322",
        "11330",
        "16"
      ]
    },
    {
      "hadith_no": "5914",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن عمرو بن دينار، عن جابر بن زيد، عن ابن عباس  رضى الله عنهما  قال قال النبي صلى الله عليه وسلم ‏\"‏ من لم يكن له إزار فليلبس السراويل، ومن لم يكن له نعلان فليلبس خفين ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet said, \"Whoever has no Izar (waist sheet), can wear trousers; and whoever has no sandals, can wear Khuffs (socks made from thick fabric or leather, but cut them short below the ankles).\"",
      "chain": [
        "30388",
        "20005",
        "11081",
        "11271",
        "17"
      ]
    },
    {
      "hadith_no": "6064",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن هشام، عن عروة، عن عائشة  رضى الله عنها  قالت جاء أعرابي إلى النبي صلى الله عليه وسلم فقال تقبلون الصبيان فما نقبلهم‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ أو أملك لك أن نزع الله من قلبك الرحمة ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     A bedouin came to the Prophet and said, \"You (people) kiss the boys! We don't kiss them.\" The Prophet said, \"I cannot put mercy in your heart after Allah has taken it away from it.\"",
      "chain": [
        "30388",
        "20005",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "6095",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن أبي بردة، بريد بن أبي بردة قال أخبرني جدي أبو بردة، عن أبيه أبي موسى، عن النبي صلى الله عليه وسلم قال ‏\"‏ المؤمن للمؤمن كالبنيان، يشد بعضه بعضا ‏\"‏‏.‏ ثم شبك بين أصابعه‏.‏   وكان النبي صلى الله عليه وسلم جالسا إذ جاء رجل يسأل أو طالب حاجة أقبل علينا بوجهه فقال ‏\"‏ اشفعوا فلتؤجروا، وليقض الله على لسان نبيه ما شاء ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa:                     The Prophet said, \"A believer to another believer is like a building whose different parts enforce each other.\" The Prophet then clasped his hands with the fingers interlaced. (At that time) the Prophet was sitting and a man came and begged or asked for something. The Prophet faced us and said, \"Help and recommend him and you will receive the reward for it, and Allah will bring about what He will through His Prophet's tongue.\"",
      "chain": [
        "30388",
        "20005"
      ]
    },
    {
      "hadith_no": "6128",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا محمد بن يوسف، أخبرنا سفيان، عن الأعمش، عن أبي وائل، عن ابن مسعود  رضى الله عنه  قال قسم رسول الله صلى الله عليه وسلم قسمة، فقال رجل من الأنصار والله ما أراد محمد بهذا وجه الله‏.‏ فأتيت رسول الله صلى الله عليه وسلم فأخبرته، فتمعر وجهه وقال ‏\"‏ رحم الله موسى، لقد أوذي بأكثر من هذا فصبر ‏\"‏‏.‏",
      "text_en": " Narrated Ibn Mas`ud:                     Once Allah's Apostle divided and distributed (the war booty). An Ansar man said, \"By Allah ! Muhammad, by this distribution, did not intend to please Allah.\" So I came to Allah's Apostle and informed him about it whereupon his face became changed with anger and he said, \"May Allah bestow His Mercy on Moses for he was hurt with more than this, yet he remained patient.\"",
      "chain": [
        "30388",
        "20005",
        "11060",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "6249",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن هشام، عن أبيه، عن عائشة  رضى الله عنها  عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يقولن أحدكم خبثت نفسي‏.‏ ولكن ليقل لقست نفسي ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet said, \"None of you should say Khabuthat Nafsi, but he is recommended to say 'Laqisat Nafsi.\"",
      "chain": [
        "30388",
        "20005",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "6446",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن هشام بن عروة، عن أبيه، عن عائشة  رضى الله عنها  قالت قال النبي صلى الله عليه وسلم ‏\"‏ اللهم حبب إلينا المدينة، كما حببت إلينا مكة أو أشد، وانقل حماها إلى الجحفة، اللهم بارك لنا في مدنا وصاعنا ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet said, \"O Allah! Make us love Medina as You made us love Mecca, or more, and transfer the fever that is in it, to Al-Juhfa. O Allah! Bless our Mudd and our Sam' (kinds of measures).",
      "chain": [
        "30388",
        "20005",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "6710",
      "source": " Sahih Bukhari ",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا محمد بن يوسف، عن سفيان، عن موسى بن عقبة، عن سالم، عن ابن عمر، قال كانت يمين النبي صلى الله عليه وسلم ‏\"‏ لا ومقلب القلوب ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The oath of the Prophet used to be: \"No, by Him who turns the hearts.\"",
      "chain": [
        "30388",
        "20005",
        "11106",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "6768",
      "source": " Sahih Bukhari ",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن عبد الرحمن بن عابس، عن أبيه، عن عائشة  رضى الله عنها  قالت ما شبع آل محمد صلى الله عليه وسلم من خبز بر مأدوم ثلاثة أيام حتى لحق بالله‏.‏",
      "text_en": " Narrated `Aisha:                     The family of (the Prophet) Muhammad never ate wheat-bread with meat for three consecutive days to their fill, till he met Allah.",
      "chain": [
        "30388",
        "20005",
        "11638",
        "11357",
        "53"
      ]
    },
    {
      "hadith_no": "6825",
      "source": " Sahih Bukhari ",
      "chapter": "Laws of Inheritance (Al-Faraa'id) - كتاب الفرائض",
      "chapter_no": "85",
      "text_ar": "حدثنا محمد بن يوسف، عن ورقاء، عن ابن أبي نجيح، عن عطاء، عن ابن عباس  رضى الله عنهما  قال كان المال للولد، وكانت الوصية للوالدين، فنسخ الله من ذلك ما أحب، فجعل للذكر مثل حظ الأنثيين، وجعل للأبوين لكل واحد منهما السدس، وجعل للمرأة الثمن والربع، وللزوج الشطر والربع‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     (During the early days of Islam), the inheritance used to be given to one's offspring and legacy used to be bequeathed to the parents, then Allah cancelled what He wished from that order and decreed that the male should be given the equivalent of the portion of two females, and for the parents one-sixth for each of them, and for one's wife one-eighth (if the deceased has children) and one-fourth (if he has no children), for one's husband one-half (if the deceased has no children) and one-fourth (if she has children).",
      "chain": [
        "30388",
        "20363",
        "11254",
        "11029",
        "17"
      ]
    },
    {
      "hadith_no": "6871",
      "source": " Sahih Bukhari ",
      "chapter": "Limits and Punishments set by Allah (Hudood) - كتاب الحدود",
      "chapter_no": "86",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا ابن عيينة، عن الزهري، عن أبي إدريس الخولاني، عن عبادة بن الصامت  رضى الله عنه  قال كنا عند النبي صلى الله عليه وسلم في مجلس فقال ‏\"‏ بايعوني على أن لا تشركوا بالله شيئا ولا تسرقوا، ولا تزنوا ‏\"‏‏.‏ وقرأ هذه الآية كلها ‏\"‏ فمن وفى منكم فأجره على الله ومن أصاب من ذلك شيئا فعوقب به، فهو كفارته، ومن أصاب من ذلك شيئا، فستره الله عليه، إن شاء غفر له، وإن شاء عذبه ‏\"‏‏.‏",
      "text_en": " Narrated 'Ubada bin As-Samit:                     We were with the Prophet in a gathering and he said, 'Swear allegiance to me that you will not worship anything besides Allah, Will not steal, and will not commit illegal sexual intercourse.\" And then (the Prophet) recited the whole Verse (i.e. 60:12). The Prophet added, 'And whoever among you fulfills his pledge, his reward is with Allah; and whoever commits something of such sins and receives the legal punishment for it, that will be considered as the expiation for that sin, and whoever commits something of such sins and Allah screens him, it is up to Allah whether to excuse or punish him.\"",
      "chain": [
        "30388",
        "20005",
        "11013",
        "11027",
        "40"
      ]
    },
    {
      "hadith_no": "6944",
      "source": " Sahih Bukhari ",
      "chapter": "Punishment of Disbelievers at War with Allah and His Apostle - كتاب المحاربين من أهل الكفر والردة",
      "chapter_no": "87",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا ابن عيينة، عن الزهري، عن عبيد الله بن عبد الله بن عتبة، عن أبي هريرة، وزيد بن خالد الجهني، قالا جاء رجل إلى النبي صلى الله عليه وسلم فقال أنشدك الله إلا قضيت بيننا بكتاب الله‏.‏ فقام خصمه وكان أفقه منه فقال صدق، اقض بيننا بكتاب الله، وأذن لي يا رسول الله‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ قل ‏\"‏‏.‏ فقال إن ابني كان عسيفا في أهل، هذا فزنى بامرأته، فافتديت منه بمائة شاة وخادم وإني سألت رجالا من أهل العلم فأخبروني أن على ابني جلد مائة وتغريب عام، وأن على امرأة هذا الرجم‏.‏ فقال ‏\"‏ والذي نفسي بيده لأقضين بينكما بكتاب الله، المائة والخادم رد عليك، وعلى ابنك جلد مائة وتغريب عام، ويا أنيس اغد على امرأة هذا فسلها، فإن اعترفت فارجمها ‏\"‏‏.‏ فاعترفت فرجمها‏.‏",
      "text_en": " Narrated Abu Huraira and Zaid bin Khalid Al-Juhani:                     A man came to the Prophet and said, \"I beseech you to judge us according to Allah's Laws.\" Then his opponent who was wiser than he, got up and said, \"He has spoken the truth. So judge us according to Allah's Laws and please allow me (to speak), O Allah's Apostle.\" The Prophet said, \"Speak.\" He said, \"My son was a laborer for the family of this man and he committed illegal sexual intercourse with his wife, and I gave one-hundred sheep and a slave as a ransom (for my son), but I asked the religious learned people (regarding this case), and they informed me that my son should be flogged onehundred stripes, and be exiled for one year, and the wife of this man should be stoned (to death).\"The Prophet said, \"By Him in Whose Hand my soul is, I will Judge you (in this case) according to Allah's Laws. The one-hundred (sheep) and the slave shall be returned to you and your son shall be flogged one-hundred stripes and be exiled for one year. And O Unais! Go in the morning to the wife of this man and ask her, and if she confesses, stone her to death.\" She confessed and he stoned her to death.",
      "chain": [
        "30388",
        "20005",
        "11013",
        "11004",
        "13",
        "3625"
      ]
    },
    {
      "hadith_no": "7003",
      "source": " Sahih Bukhari ",
      "chapter": "Blood Money (Ad-Diyat) - كتاب الديات",
      "chapter_no": "88",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن عمرو بن يحيى المازني، عن أبيه، عن أبي سعيد الخدري، قال جاء رجل من اليهود إلى النبي صلى الله عليه وسلم قد لطم وجهه فقال يا محمد إن رجلا من أصحابك من الأنصار لطم في وجهي‏.‏ قال ‏\"‏ ادعوه ‏\"‏‏.‏ فدعوه‏.‏ قال ‏\"‏ لم لطمت وجهه ‏\"‏‏.‏ قال يا رسول الله إني مررت باليهود فسمعته يقول والذي اصطفى موسى على البشر‏.‏ قال قلت وعلى محمد صلى الله عليه وسلم قال فأخذتني غضبة فلطمته‏.‏ قال ‏\"‏ لا تخيروني من بين الأنبياء فإن الناس يصعقون يوم القيامة فأكون أول من يفيق، فإذا أنا بموسى آخذ بقائمة من قوائم العرش، فلا أدري أفاق قبلي أم جزي بصعقة الطور ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     A Jew whose face had been slapped (by someone), came to the Prophet and said, \"O Muhammad! A man from your Ansari companions slapped me. \" The Prophet said, \"Call him\". They called him and the Prophet asked him, \"Why did you slap his face?\" He said, \"O Allah's Apostle! While I was passing by the Jews, I heard him saying, 'By Him Who chose Moses above all the human beings.' I said (protestingly), 'Even above Muhammad?' So I became furious and slapped him.\" The Prophet said, \"Do not give me preference to other prophets, for the people will become unconscious on the Day of Resurrection and I will be the first to gain conscious, and behold, I will Find Moses holding one of the pillars of the Throne (of Allah). Then I will not know whether he has become conscious before me or he has been exempted because of his unconsciousness at the mountain (during his worldly life) which he received.\"",
      "chain": [
        "30388",
        "20005",
        "11210",
        "11232",
        "38"
      ]
    },
    {
      "hadith_no": "7032",
      "source": " Sahih Bukhari ",
      "chapter": "Saying Something under Compulsion (Ikraah) - كتاب الإكراه",
      "chapter_no": "90",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن ابن جريج، عن ابن أبي مليكة، عن أبي عمرو  هو ذكوان  عن عائشة  رضى الله عنها  قالت قلت يا رسول الله يستأمر النساء في أبضاعهن قال ‏\"‏ نعم ‏\"‏‏.‏ قلت فإن البكر تستأمر فتستحي فتسكت‏.‏ قال ‏\"‏ سكاتها إذنها ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     I asked the Prophet, \"O Allah's Apostle! Should the women be asked for their consent to their marriage?\" He said, \"Yes.\" I said, \"A virgin, if asked, feels shy and keeps quiet.\" He said, \"Her silence means her consent.\"",
      "chain": [
        "30388",
        "20005",
        "11070",
        "11090",
        "53"
      ]
    },
    {
      "hadith_no": "7064",
      "source": " Sahih Bukhari ",
      "chapter": "Tricks - كتاب الحيل",
      "chapter_no": "91",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن إبراهيم بن ميسرة، عن عمرو بن الشريد، عن أبي رافع، أن سعدا، ساومه بيتا بأربعمائة مثقال فقال لولا أني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ الجار أحق بصقبه ‏\"‏‏.‏ لما أعطيتك‏.‏ وقال بعض الناس إن اشترى نصيب دار، فأراد أن يبطل الشفعة، وهب لابنه الصغير ولا يكون عليه يمين‏.‏",
      "text_en": "      Narrated 'Amr bin Ash-Sharid:                     Abu Rafi' said that Sa'd offered him      four hundred Mithqal of gold for a house. Abu Rafi ' said, \"If I had      not heard Allah's Apostle saying, 'A neighbor has more right to be      taken care of by his neighbor,' then I would not have given it to      you.\" Some people said, \"If one has bought a portion of a house and      wants to cancel the right of preemption, he may give it as a present      to his little son and he will not be obliged to take an oath.\"",
      "chain": [
        "30388",
        "20005",
        "11240",
        "10952",
        "479"
      ]
    },
    {
      "hadith_no": "7155",
      "source": " Sahih Bukhari ",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن الزبير بن عدي، قال أتينا أنس بن مالك فشكونا إليه ما نلقى من الحجاج فقال ‏\"‏ اصبروا، فإنه لا يأتي عليكم زمان إلا الذي بعده شر منه، حتى تلقوا ربكم ‏\"‏‏.‏ سمعته من نبيكم صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Az-Zubair bin `Adi:                     We went to Anas bin Malik and complained about the wrong we were suffering at the hand of Al- Hajjaj. Anas bin Malik said, \"Be patient till you meet your Lord, for no time will come upon you but the time following it will be worse than it. I heard that from the Prophet.\"",
      "chain": [
        "30388",
        "20005",
        "11336"
      ]
    },
    {
      "hadith_no": "7304",
      "source": " Sahih Bukhari ",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثنا محمد بن يوسف، أخبرنا سفيان، عن هشام بن عروة، عن أبيه، عن عبد الله بن عمر  رضى الله عنهما  قال قيل لعمر ألا تستخلف قال إن أستخلف فقد استخلف من هو خير مني أبو بكر، وإن أترك فقد ترك من هو خير مني رسول الله صلى الله عليه وسلم فأثنوا عليه فقال راغب راهب، وددت أني نجوت منها كفافا لا لي ولا على لا أتحملها حيا وميتا‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     It was said to `Umar, \"Will you appoint your successor?\" `Umar said, \"If I appoint a Caliph (as my successor) it is true that somebody who was better than I (i.e., Abu Bakr) did so, and if I leave the matter undecided, it is true that somebody who was better than I (i.e., Allah's Apostle) did so.\" On this, the people praised him. `Umar said, \"People are of two kinds: Either one who is keen to take over the Caliphate or one who is afraid of assuming such a responsibility. I wish I could be free from its responsibility in that I would receive neither reward nor retribution I won't bear the burden of the caliphate in my death as I do in my life.\"",
      "chain": [
        "30388",
        "20005",
        "11065",
        "10511",
        "18"
      ]
    },
    {
      "hadith_no": "7430",
      "source": " Sahih Bukhari ",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن عبد الله بن دينار، عن ابن عمر، وقت النبي صلى الله عليه وسلم قرنا لأهل نجد، والجحفة لأهل الشأم، وذا الحليفة لأهل المدينة‏.‏ قال سمعت هذا من النبي صلى الله عليه وسلم وبلغني أن النبي صلى الله عليه وسلم قال ‏\"‏ ولأهل اليمن يلملم ‏\"‏‏.‏ وذكر العراق فقال لم يكن عراق يومئذ‏.‏",
      "text_en": " Narrated `Abdullah bin Dinar:                     Ibn `Umar said, \"The Prophet fixed Qarn as the Miqat (for assuming the Ihram) for the people of Najd, and Al-Juhfa for the people of Sham, and Dhul-Hulaifa for the people of Medina.\" Ibn `Umar added, \"I heard this from the Prophet, and I have been informed that the Prophet said, 'The Miqat for the Yemenites is Yalamlam.' \"When Iraq was mentioned, he said, \"At that time it was not a Muslim country.\"",
      "chain": [
        "30388",
        "20005",
        "11183",
        "18"
      ]
    },
    {
      "hadith_no": "7469",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن إسماعيل، عن الشعبي، عن مسروق، عن عائشة  رضى الله عنها  قالت من حدثك أن محمدا صلى الله عليه وسلم رأى ربه فقد كذب وهو يقول ‏{‏لا تدركه الأبصار‏}‏ ومن حدثك أنه يعلم الغيب فقد كذب، وهو يقول لا يعلم الغيب إلا الله‏.‏",
      "text_en": " Narrated Masruq:                     `Aisha said, \"If anyone tells you that Muhammad has seen his Lord, he is a liar, for Allah says: 'No vision can grasp Him.' (6.103) And if anyone tells you that Muhammad has seen the Unseen, he is a liar, for Allah says: \"None has the knowledge of the Unseen but Allah.\"",
      "chain": [
        "30388",
        "20005",
        "11418",
        "11052",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "7517",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن عمرو بن يحيى، عن أبيه، عن أبي سعيد الخدري، عن النبي صلى الله عليه وسلم قال النبي صلى الله عليه وسلم ‏\"‏ الناس يصعقون يوم القيامة فإذا أنا بموسى آخذ بقائمة من قوائم العرش ‏\"‏‏.‏ وقال الماجشون عن عبد الله بن الفضل، عن أبي سلمة، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ فأكون أول من بعث فإذا موسى آخذ بالعرش ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     The Prophet said, \"The people will fall unconscious on the Day of Resurrection, then suddenly I will see Moses holding one of the pillars of the Throne.\" Abu Huraira said: The Prophet said, \"I will be the first person to be resurrected and will see Moses holding the Throne.\"",
      "chain": [
        "30388",
        "20005",
        "11210",
        "11232",
        "38"
      ]
    },
    {
      "hadith_no": "7625",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن إسماعيل، عن الشعبي، عن مسروق، عن عائشة  رضى الله عنها  قالت من حدثك أن محمدا صلى الله عليه وسلم كتم شيئا وقال محمد حدثنا أبو عامر العقدي حدثنا شعبة عن إسماعيل بن أبي خالد عن الشعبي عن مسروق عن عائشة قالت من حدثك أن النبي صلى الله عليه وسلم كتم شيئا من الوحى، فلا تصدقه، إن الله تعالى يقول ‏{‏يا أيها الرسول بلغ ما أنزل إليك من ربك وإن لم تفعل فما بلغت رسالته‏}‏",
      "text_en": " Narrated `Aisha:                     Whoever tells you that the Prophet concealed something of the Divine Inspiration, do not believe him, for Allah said: 'O Apostle Muhammad! Proclaim (the Message) which has been sent down to you from your Lord, and if you do it not, then you have not conveyed His Message.' (5.67)",
      "chain": [
        "30388",
        "20005",
        "11418",
        "11052",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "2650",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا أحمد بن عثمان النوفلي، حدثنا أبو عاصم، حدثنا ابن جريج، أخبرني محمد بن يوسف، عن سليمان بن يسار، أنه سأل أم سلمة - رضى الله عنها - عن الرجل يصبح جنبا أيصوم قالت كان رسول الله صلى الله عليه وسلم يصبح جنبا من غير احتلام ثم يصوم ‏.‏",
      "text_en": " Sulaiman b. Yasar reported that he asked Umm Salama whether a person (who gets up) in the morning in a state of junub should observe fast. She said:                      The Messenger of Allah (may peace be upon him) (at times) got up in the morning in a state of junub, not because of sexual dreams (but on account of intercourse at night), and then observed fast.",
      "chain": [
        "30185",
        "20241",
        "11070",
        "30388",
        "11005",
        "56"
      ]
    },
    {
      "hadith_no": "4094",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "وحدثني محمد بن حاتم، حدثنا يحيى بن سعيد القطان، عن محمد بن يوسف، قال سمعت السائب بن يزيد، يحدث عن رافع بن خديج، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ شر الكسب مهر البغي وثمن الكلب وكسب الحجام ‏\"‏ ‏.‏",
      "text_en": " Rafi b. Khadij (Allah be pleased with him) reported:                      I heard Allah's Apostle (may peace be upon him) as saying: The worst earning is the earning of a prostitute, the price of a dog and the earning of a cupper.",
      "chain": [
        "38487",
        "20031",
        "30388",
        "3048",
        "1986"
      ]
    },
    {
      "hadith_no": "4449",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Oath; for Establishing the Responsibility of Murders; Fighting; Requital - كتاب القسامة والمحاربين والقصاص والديات",
      "chapter_no": "29",
      "text_ar": "وحدثنا الحسن بن أبي شعيب الحراني، حدثنا مسكين، - وهو ابن بكير الحراني - أخبرنا الأوزاعي، ح وحدثنا عبد الله بن عبد الرحمن الدارمي، أخبرنا محمد بن يوسف، عن الأوزاعي، عن يحيى بن أبي كثير، عن أبي قلابة، عن أنس بن مالك، قال قدم على رسول الله صلى الله عليه وسلم ثمانية نفر من عكل ‏.‏ بنحو حديثهم ‏.‏ وزاد في الحديث ولم يحسمهم ‏.‏",
      "text_en": " Anas b. Malik reported:                      There came to Allah's Messenger (may peace be upon him) eight persons from the tribe of 'Ukl, but with this addition that he did not cauterise (the wounds which hid been inflicted upon them while punishing them).",
      "chain": [
        "20463",
        "20024",
        "30025",
        "30388",
        "20024",
        "11449",
        "11047",
        "19"
      ]
    },
    {
      "hadith_no": "4940",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثناه عبد الله بن عبد الرحمن الدارمي، حدثنا محمد بن يوسف، عن الأوزاعي، بهذا الإسناد ‏.‏ مثله غير أنه قال ‏\"‏ إن الله لن يترك من عملك شيئا ‏\"‏ ‏.‏ وزاد في الحديث قال ‏\"‏ فهل تحلبها يوم وردها ‏\"‏ ‏.‏ قال نعم ‏.‏",
      "text_en": " This tradition has been handed down through a different chain of transmitter with the addition of the following words at the end:                     \" Do you milk them on the day they arrive at the water? He replied: Yes.\"",
      "chain": [
        "30025",
        "30388"
      ]
    },
    {
      "hadith_no": "4996",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا عبد الله بن عبد الرحمن الدارمي، أخبرنا محمد بن يوسف، عن الأوزاعي، عن ابن شهاب، بهذا الإسناد فقال ‏\"‏ ورجل في شعب ‏\"‏ ‏.‏ ولم يقل ‏\"‏ ثم رجل ‏\"‏ ‏.‏",
      "text_en": " A version of the tradition narrated on the authority of Ibn Shihab has a little differently worded ending. i. e.\" A man in a mountain valley.\" but did not mention\" next to him a man who....\"",
      "chain": [
        "30025",
        "30388",
        "20024"
      ]
    },
    {
      "hadith_no": "5168",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثناه يحيى بن يحيى، حدثنا هشيم، ح وحدثنا إسحاق بن إبراهيم، أخبرنا  عبد الوهاب الثقفي، ح وحدثنا أبو بكر بن نافع، حدثنا غندر، حدثنا شعبة، ح وحدثنا  عبد الله بن عبد الرحمن الدارمي، أخبرنا محمد بن يوسف، عن سفيان، ح وحدثنا إسحاق، بن إبراهيم أخبرنا جرير، عن منصور، كل هؤلاء عن خالد الحذاء، بإسناد حديث ابن علية ومعنى حديثه ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Khalid al-Hadhdha' through different chains o transmitters.",
      "chain": [
        "30399",
        "20468",
        "30123",
        "20259",
        "20523",
        "20278",
        "20020",
        "30025",
        "30388",
        "20005",
        "30123",
        "4057"
      ]
    },
    {
      "hadith_no": "5430",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثناه أبو بكر بن أبي شيبة، وإسحاق بن إبراهيم، جميعا عن أبي معاوية، ح وحدثناه نصر بن علي الجهضمي، وأبو سعيد الأشج قالا حدثنا أبو أسامة، ح وحدثنا  عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، ح وحدثني عبد الله بن عبد الرحمن الدارمي، حدثنا محمد بن يوسف، عن سفيان، كلهم عن الأعمش، عن أبي وائل، عن أبي مسعود، بهذا الحديث عن النبي صلى الله عليه وسلم بنحو حديث جرير ‏.‏ قال نصر بن علي في روايته لهذا الحديث حدثنا أبو أسامة، حدثنا الأعمش، حدثنا شقيق بن سلمة، حدثنا أبو مسعود، الأنصاري ‏.‏ وساق الحديث ‏.‏",
      "text_en": " This hadith has been reported on the authority of Abu Mas'ud Ansari through another chain of transmitters.",
      "chain": [
        "30201",
        "30123",
        "20354",
        "30395",
        "30200",
        "20318",
        "30150",
        "20286",
        "20020",
        "30025",
        "30388",
        "11060"
      ]
    },
    {
      "hadith_no": "6316",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثنا عبد الله بن عبد الرحمن الدارمي، أخبرنا محمد بن يوسف، ح وحدثنا  عبد بن حميد، أخبرنا عبيد الله بن موسى، كلاهما عن إسرائيل، عن أبي إسحاق، بإسناد التيمي عن أبي إسحاق، نحو حديثه ‏.‏",
      "text_en": "",
      "chain": [
        "30025",
        "30388",
        "30553",
        "20311"
      ]
    },
    {
      "hadith_no": "5048",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن عبد الملك الغزال، حدثنا محمد بن يوسف، حدثنا سفيان، عن الأعمش، ومنصور، عن سعد بن عبيدة، عن البراء بن عازب، عن النبي صلى الله عليه وسلم بهذا قال سفيان قال أحدهما ‏\"‏ إذا أتيت فراشك طاهرا ‏\"‏ ‏.‏ وقال الآخر ‏\"‏ توضأ وضوءك للصلاة ‏\"‏ ‏.‏ وساق معنى معتمر ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by al-Bara b. Azil from the prophet (May peace be upon him) to the same effect through a different chain of narrators. One transmitter said:                      when you go to your bed while you are in the state of purification. The other said: Perform ablution like the ablution for prayer. He then transmitted the tradition to the effect as Mu’tamir transmitted.",
      "chain": [
        "30388",
        "20005",
        "11060",
        "11067",
        "11344",
        "400"
      ]
    },
    {
      "hadith_no": "925",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا حاتم بن إسماعيل، عن محمد بن يوسف، عن السائب بن يزيد، قال حج بي أبي مع رسول الله صلى الله عليه وسلم في حجة الوداع وأنا ابن سبع سنين ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " As-Sa'ib bin Yazid narrated:                     \"My father took me for Hajj with the Messenger of Allah during the Farewell Hajj, and I was seven years old.\"",
      "chain": [
        "30367",
        "20159",
        "30388",
        "3048"
      ]
    },
    {
      "hadith_no": "1107",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Marriage - كتاب النكاح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "11",
      "text_ar": "حدثنا إسحاق بن منصور، أخبرنا محمد بن يوسف، حدثنا الأوزاعي، عن يحيى بن أبي كثير، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تنكح الثيب حتى تستأمر ولا تنكح البكر حتى تستأذن وإذنها الصموت ‏\"‏ ‏.‏ قال وفي الباب عن عمر وابن عباس وعائشة والعرس بن عميرة ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن صحيح ‏.‏ والعمل على هذا عند أهل العلم أن الثيب لا تزوج حتى تستأمر وإن زوجها الأب من غير أن يستأمرها فكرهت ذلك فالنكاح مفسوخ عند عامة أهل العلم ‏.‏ واختلف أهل العلم في تزويج الأبكار إذا زوجهن الآباء فرأى أكثر أهل العلم من أهل الكوفة وغيرهم أن الأب إذا زوج البكر وهي بالغة بغير أمرها فلم ترض بتزويج الأب فالنكاح مفسوخ ‏.‏ وقال بعض أهل المدينة تزويج الأب على البكر جائز وإن كرهت ذلك ‏.‏ وهو قول مالك بن أنس والشافعي وأحمد وإسحاق ‏.‏",
      "text_en": " Abu Hurairah narrated that:                     The Prophet said: \"A matron should not be given in marriage until she is consulted, and a virgin should not be given in marriage until her permission is sought, and her silence is her permission.\"",
      "chain": [
        "30313",
        "30388",
        "20024",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1342",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Chapters On Judgements From The Messenger of Allah - كتاب الأحكام عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن سهل بن عسكر البغدادي، حدثنا محمد بن يوسف، حدثنا نافع بن عمر الجمحي، عن عبد الله بن أبي مليكة، عن ابن عباس، أن رسول الله صلى الله عليه وسلم قضى أن اليمين على المدعى عليه ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ والعمل على هذا عند أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم أن البينة على المدعي واليمين على المدعى عليه ‏.‏",
      "text_en": " Ibn 'Abbas narrated that the Messenger of Allah (ﷺ) judged that the oath is due from the one the claim is made against.",
      "chain": [
        "30516",
        "30388",
        "20203",
        "11090",
        "17"
      ]
    },
    {
      "hadith_no": "1454",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Legal Punishments (Al-Hudud) - كتاب الحدود عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "17",
      "text_ar": "حدثنا محمد بن يحيى النيسابوري، حدثنا محمد بن يوسف، عن إسرائيل، حدثنا سماك بن حرب، عن علقمة بن وائل الكندي، عن أبيه، أن امرأة، خرجت على عهد رسول الله صلى الله عليه وسلم تريد الصلاة فتلقاها رجل فتجللها فقضى حاجته منها فصاحت فانطلق ومر عليها رجل فقالت إن ذاك الرجل فعل بي كذا وكذا ‏.‏ ومرت بعصابة من المهاجرين فقالت إن ذاك الرجل فعل بي كذا وكذا ‏.‏ فانطلقوا فأخذوا الرجل الذي ظنت أنه وقع عليها وأتوها فقالت نعم هو هذا ‏.‏ فأتوا به رسول الله صلى الله عليه وسلم فلما أمر به ليرجم قام صاحبها الذي وقع عليها فقال يا رسول الله أنا صاحبها ‏.‏ فقال لها ‏\"‏ اذهبي فقد غفر الله لك ‏\"‏ ‏.‏ وقال للرجل قولا حسنا وقال للرجل الذي وقع عليها ‏\"‏ ارجموه ‏\"‏ ‏.‏ وقال ‏\"‏ لقد تاب توبة لو تابها أهل المدينة لقبل منهم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب صحيح ‏.‏ وعلقمة بن وائل بن حجر سمع من أبيه وهو أكبر من عبد الجبار بن وائل وعبد الجبار بن وائل لم يسمع من أبيه ‏.‏",
      "text_en": " Narrated 'Alqamah bin Wa'il Al-Kindi:                     From his father: \"A women went out during the time of the Prophet (ﷺ) to go to Salat, but she was caught by a man and he had relations with her, so she screamed and he left. Then a man came across her and she said: 'That man has done this and that to me', then she came across a group of Emigrants (Muhajirin) and she said: 'That man did this and that to me.' They went to get the man she thought had relations with her, and they brought him to her. She said: 'Yes, that's him.' So they brought him to the Messenger of Allah (ﷺ), and when he ordered that he be stoned, the man who had relations with her, said: 'O Messenger of Allah, I am the one who had relations with her.' So he said to her: 'Go, for Allah has forgiven you.' Then he said some nice words to the man (who was brought). And he said to the man who had relations with her: 'Stone him.' Then he said: 'He has repented a repentance that, if the inhabitants of Al-Madinah had repented with, it would have been accepted from them.'\"",
      "chain": [
        "11222",
        "30388",
        "20311",
        "10770",
        "10801"
      ]
    },
    {
      "hadith_no": "1465",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hunting - كتاب الصيد والذبائح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "18",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا محمد بن يوسف، حدثنا سفيان، عن منصور، نحوه إلا أنه قال وسئل عن المعراض، ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " (Another Chain) except that he said:                      \"And he was asked about the Mir'ad.\"",
      "chain": [
        "11222",
        "30388",
        "20005",
        "11067"
      ]
    },
    {
      "hadith_no": "1706",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jihad - كتاب الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن يحيى النيسابوري، حدثنا محمد بن يوسف، حدثنا يونس بن أبي إسحاق، عن العيزار بن حريث، عن أم الحصين الأحمسية، قالت سمعت رسول الله صلى الله عليه وسلم يخطب في حجة الوداع وعليه برد قد التفع به من تحت إبطه قالت فأنا أنظر إلى عضلة عضده ترتج سمعته يقول ‏\"‏ يا أيها الناس اتقوا الله وإن أمر عليكم عبد حبشي مجدع فاسمعوا له وأطيعوا ما أقام لكم كتاب الله ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن أبي هريرة وعرباض بن سارية ‏.‏ وهذا حديث حسن صحيح وقد روي من غير وجه عن أم حصين ‏.‏",
      "text_en": " Narrated Umm Al-Husain Al-Ahmasiyyah:                     I heard the Messenger of Allah (ﷺ) delivering Khutbah during the farewell Hajj, and he was wearing a Burd which he had wrapped from under his armpit.\" She said: \"I was look at muscle of his upper arm quivering and I heard him saying: O you people! Have Taqwa of Allah. If a mutilated Ethiopian slave is put in command over you, then listen to him and obey him, as long as he upholds the Book of Allah among you.'\"[Abu 'Eisa said:] There are narrations on this topic from Abu Hurairah and 'Irbad bin Sariyah. This Hadith is Hasan Sahih, it has been reported through other routes from Umm Husain.",
      "chain": [
        "11222",
        "30388",
        "10846",
        "10808",
        "4018"
      ]
    },
    {
      "hadith_no": "1829",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا الحسن بن محمد الزعفراني، حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني محمد بن يوسف، أن عطاء بن يسار، أخبره أن أم سلمة أخبرته أنها، قربت إلى رسول الله صلى الله عليه وسلم جنبا مشويا فأكل منه ثم قام إلى الصلاة وما توضأ ‏.‏ قال وفي الباب عن عبد الله بن الحارث والمغيرة وأبي رافع ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه ‏.‏",
      "text_en": " Narrated Umm Salamah:                     That she brought a side of roasted meat to the Messenger of Allah (ﷺ), so he ate it from it and stood for Salat, and did not perform Wudu'He said: There are narrations on this topic from 'Abdullah bin Al-Harith, Al-Mughirah, and Abu Rafi'[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib from this route.",
      "chain": [
        "30245",
        "20381",
        "11070",
        "30388",
        "11020",
        "56"
      ]
    },
    {
      "hadith_no": "1872",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Drinks - كتاب الأشربة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "26",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا محمد بن يوسف، حدثنا إسرائيل، حدثنا إبراهيم بن مهاجر، عن عامر الشعبي، عن النعمان بن بشير، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن من الحنطة خمرا ومن الشعير خمرا ومن التمر خمرا ومن الزبيب خمرا ومن العسل خمرا ‏\"‏ ‏.‏ قال وفي الباب عن أبي هريرة ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Narrated An-Nu'man bin Bashir:                     That the Messenger of Allah (ﷺ) said: \"Indeed Khamr comes from wheat, Khamr comes from barely, Khamr comes from dates, Khamr comes from rasins, and Khamr comes from honey.\"He said: There are narrations on this topic from Abu Hurairah.[Abu 'Eisa said:] This Hadith is Gharib.",
      "chain": [
        "11222",
        "30388",
        "20311",
        "10739",
        "11052",
        "274"
      ]
    },
    {
      "hadith_no": "2161",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": ".‏ حدثنا قتيبة حدثنا حاتم بن إسماعيل عن محمد بن يوسف عن السائب بن يزيد قال حج يزيد مع النبي صلى الله عليه وسلم حجة الوداع وأنا ابن سبع سنين ‏.‏ فقال علي بن المديني عن يحيى بن سعيد القطان كان محمد بن يوسف ثبتا صاحب حديث وكان السائب بن يزيد جده وكان محمد بن يوسف يقول حدثني السائب بن يزيد وهو جدي من قبل أمي ‏.‏",
      "text_en": " Muhammad bin Yusuf narrated that As-Sa'ib bin Yazid said:                     \"Yazid performed Hajj in the Farewell Pilgrimage with the Prophet (s.a.w) when I was seven years old.\" So 'Ali bin Al-Madini narrated from Yahya bin Sa'eed Al-Qattan: \"Muhammad bin Yusuf was a very reliable narrator of Hadith, and As-Sa'ib bin Yazid was his grandfather, and Muhammad bin Yusuf would say: 'As-Sa'ib bin Yazid narrated to me- and he is my grandfather from my mother's side.\"'",
      "chain": [
        "20159",
        "30388",
        "3048"
      ]
    },
    {
      "hadith_no": "2669",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Knowledge - كتاب العلم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "41",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا محمد بن يوسف، عن ابن ثوبان، هو عبد الرحمن بن ثابت بن ثوبان عن حسان بن عطية، عن أبي كبشة السلولي، عن عبد الله بن عمرو، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ بلغوا عني ولو آية وحدثوا عن بني إسرائيل ولا حرج ومن كذب على متعمدا فليتبوأ مقعده من النار ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ حدثنا محمد بن بشار، حدثنا أبو عاصم، عن الأوزاعي، عن حسان بن عطية، عن أبي كبشة السلولي، عن عبد الله بن عمرو، عن النبي صلى الله عليه وسلم نحوه ‏.‏ وهذا حديث صحيح ‏.‏",
      "text_en": " Narrated 'Abdullah bin 'Amr:                     that the Messenger of Allah (ﷺ) said: \"Convey from me, even if it be an Ayah, and narrate from the Children of Isra'il, and there is no harm, And whoever lies upon me purposely, then let him take his seat in the Fire.\"",
      "chain": [
        "11222",
        "30388",
        "11413",
        "11669",
        "29"
      ]
    },
    {
      "hadith_no": "3325",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن، أخبرنا محمد بن يوسف، أخبرنا إسرائيل، حدثنا أبو إسحاق، عن عمر بن شرحبيل أبي ميسرة، عن عمر بن الخطاب، أنه قال اللهم بين لنا في الخمر بيان شفاء فنزلت التي في البقرة ‏:‏ ‏(‏ يسألونك عن الخمر والميسر ‏)‏ الآية فدعي عمر فقرئت عليه فقال اللهم بين لنا في الخمر بيان شفاء فنزلت التي في النساءأيها الذين آمنوا لا تقربوا الصلاة وأنتم سكارى ‏)‏ فدعي عمر فقرئت عليه فقال اللهم بين لنا في الخمر بيان شفاء فنزلت التي في المائدة ‏:‏ ‏(‏ إنما يريد الشيطان أن يوقع بينكم العداوة والبغضاء في الخمر والميسر ‏)‏ إلى قولهل أنتم منتهون ‏)‏ فدعي عمر فقرئت عليه فقال انتهينا انتهينا ‏.‏ قال أبو عيسى وقد روي عن إسرائيل هذا الحديث مرسل ‏.‏",
      "text_en": " Narrated 'Amr bin Shurahbil [Abu Maisarah]:                     from 'Umar bin Al-Khattab, that he said: \"O Allah! Make the verdict concerning Khamr sufficiently clear for us!\" So (the Ayah) in Al-Baqarah was revealed: They ask you concerning Khamr and gambling. Say: \"In them is a great sin (2:219).\" So 'Umar was called, and it was recited to him, so he said: \"O Allah! Make the verdict concerning Khamr sufficiently clear for us!\" So (the Ayah) in An-Nisa was revealed: 'O you who believe! Approach not As-Salat while you are in a drunken state (4:43).' So 'Umar was called and it was recited him, so he said \"O Allah! Make the verdict concerning Khamr sufficiently clear for us!\" So (the Ayah) in Al-Ma'idah was revealed: Shaitan only wants to excite enmity and hatred between you with Khamr and gambling...' up to His saying: 'So will you not then abstain (5:91).' So 'Umar was called and it was recited to him, so he said: 'We abstained, we abstained.'\"",
      "chain": [
        "30025",
        "30388",
        "20311",
        "11049",
        "3"
      ]
    },
    {
      "hadith_no": "3399",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمد بن يحيى النيسابوري، حدثنا محمد بن يوسف، عن سفيان، عن الأعمش، وسماك، عن إبراهيم، عن عبد الرحمن بن يزيد، عن عبد الله، عن النبي صلى الله عليه وسلم نحوه بمعناه ‏.‏",
      "text_en": "",
      "chain": [
        "11222",
        "30388",
        "20005",
        "11060",
        "10770",
        "11051",
        "11055",
        "16"
      ]
    },
    {
      "hadith_no": "3634",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا محمد بن يوسف، حدثنا إسرائيل، حدثنا سماك بن حرب، عن عكرمة، عن ابن عباس، وسأله، رجل عن هذه الآية، ‏(‏ يا أيها الذين آمنوا إن من أزواجكم وأولادكم عدوا لكم فاحذروهم ‏)‏ قال هؤلاء رجال أسلموا من أهل مكة وأرادوا أن يأتوا النبي صلى الله عليه وسلم فأبى أزواجهم وأولادهم أن يدعوهم أن يأتوا رسول الله صلى الله عليه وسلم فلما أتوا رسول الله صلى الله عليه وسلم رأوا الناس قد فقهوا في الدين هموا أن يعاقبوهم فأنزل الله عز وجل ‏:‏ ‏(‏ يا أيها الذين آمنوا إن من أزواجكم وأولادكم عدوا لكم فاحذروهم ‏)‏ الآية ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Ikrimah narrated that :                     Ibn Abbas was asked by a man about this Ayah: O you who believe! Verity, among your wives and your children there are enemies for you; therefore beware of them! He said: “These are men who submitted (to Islam) in Makkah, and they wanted to come to the Prophet but their wives and children refused to allow them to come to the Messenger of Allah. So when they came to the Messenger of Allah, they saw that the people had gained such understanding in the religion that they wanted to punish them (their families). So Allah revealed the Ayah: O you who believe! Verily, among your wives and your children there are enemies for you; therefore beware of them!”",
      "chain": [
        "11222",
        "30388",
        "20311",
        "10770",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "3643",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا محمد بن يوسف، حدثنا إسرائيل، حدثنا أبو إسحاق، عن سعيد بن جبير، عن ابن عباس، قال كان الجن يصعدون إلى السماء يستمعون الوحى فإذا سمعوا الكلمة زادوا فيها تسعا فأما الكلمة فتكون حقا وأما ما زادوه فيكون باطلا فلما بعث رسول الله صلى الله عليه وسلم منعوا مقاعدهم فذكروا ذلك لإبليس ولم تكن النجوم يرمى بها قبل ذلك فقال لهم إبليس ما هذا إلا من أمر قد حدث في الأرض فبعث جنوده فوجدوا رسول الله صلى الله عليه وسلم قائما يصلي بين جبلين أراه قال بمكة فأتوه فأخبروه فقال هذا الذي حدث في الأرض ‏.‏ قال هذا حديث حسن صحيح ‏.‏",
      "text_en": " Ibn Abbas said:                     “The jinns used to ascent through the heavens, trying to listen about the Revealation. So when they heard a statement, they would add nine to it. The statement that they heard would be true, while what they added was false. So it was with the advent of the Messenger of Allah that they were prevented from their places. So they mentioned that to Iblis – and the stars were not shot at them before that. So Iblis said to them: ‘This is naught but an event that has occurred in the earth.’ So he sent out his armies, and they found the Messenger of Allah standing in Salat between two mountains” – I think he said “in Makkah” – “So they (returned) to meet with him (Iblis), and informed him. He said: ‘This is the event that has happened on the earth.’”",
      "chain": [
        "11222",
        "30388",
        "20311",
        "11049",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "3505",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا محمد بن يوسف، حدثنا يونس بن أبي إسحاق، عن إبراهيم بن محمد بن سعد، عن أبيه، عن سعد، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ دعوة ذي النون إذ دعا وهو في بطن الحوت لا إله إلا أنت سبحانك إني كنت من الظالمين ‏.‏ فإنه لم يدع بها رجل مسلم في شيء قط إلا استجاب الله له ‏\"‏ ‏.‏ قال محمد بن يحيى قال محمد بن يوسف مرة عن إبراهيم بن محمد بن سعد، عن سعد، ‏.‏ قال أبو عيسى وقد روى غير، واحد، هذا الحديث عن يونس بن أبي إسحاق، عن إبراهيم بن محمد بن سعد، عن سعد، ولم يذكروا فيه عن أبيه، ‏.‏ وروى بعضهم، عن يونس بن أبي إسحاق، فقالوا عن إبراهيم بن محمد بن سعد، عن أبيه، عن سعد، وكان، يونس بن أبي إسحاق ربما ذكر في هذا الحديث عن أبيه، وربما، لم يذكره ‏.‏",
      "text_en": " Ibrahim bin Muhammad bin Sa’d narrated from his father, from Sa’d that the Messenger of Allah said:                     “The supplication of Dhun-Nun (Prophet Yunus) when he supplicated, while in the belly of the whale was: ‘There is none worthy of worship except You, Glory to You, Indeed, I have been of the transgressors. (La Ilaha Illa Anta Subhanaka Inni Kuntu Minaz-Zalimin)’ So indeed, no Muslim man supplicated with it for anything, ever, except Allah responds to him.”",
      "chain": [
        "11222",
        "30388",
        "10846",
        "12005",
        "10553",
        "9"
      ]
    },
    {
      "hadith_no": "3573",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن الدارمي، أخبرنا محمد بن يوسف، عن ابن ثوبان، عن أبيه، عن مكحول، عن جبير بن نفير، أن عبادة بن الصامت، حدثهم أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ما على الأرض مسلم يدعو الله بدعوة إلا آتاه الله إياها أو صرف عنه من السوء مثلها ما لم يدع بمأثم أو قطيعة رحم ‏\"‏ ‏.‏ فقال رجل من القوم إذا نكثر ‏.‏ قال ‏\"‏ الله أكثر ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه وابن ثوبان هو عبد الرحمن بن ثابت بن ثوبان العابد الشامي ‏.‏",
      "text_en": " Jubair bin Nufair narrated that Ubadah bin As-Samit narrated to them that, the Messenger of Allah said:                     “There is not a Muslim upon the earth who calls upon Allah with any supplication, except that Allah grants it to him, or he turns away from him the like of it in evil; as long as he does not supplicate for something sinful, or the severing of the ties of kinship.” So a man from the people said: “What if we should increase (in it)” He said: “(With) Allah is more.”",
      "chain": [
        "30025",
        "30388",
        "11066",
        "4097",
        "40"
      ]
    },
    {
      "hadith_no": "4150",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن، وإسحاق بن منصور، قالا أخبرنا محمد بن يوسف، عن إسرائيل، عن ميسرة بن حبيب، عن المنهال بن عمرو، عن زر بن حبيش، عن حذيفة، قال سألتني أمي متى عهدك - تعني - بالنبي صلى الله عليه وسلم ‏.‏ فقلت ما لي به عهد منذ كذا وكذا ‏.‏ فنالت مني فقلت لها دعيني آتي النبي صلى الله عليه وسلم فأصلي معه المغرب وأسأله أن يستغفر لي ولك ‏.‏ فأتيت النبي صلى الله عليه وسلم فصليت معه المغرب فصلى حتى صلى العشاء ثم انفتل فتبعته فسمع صوتي فقال ‏\"‏ من هذا حذيفة ‏\"‏ ‏.‏ قلت نعم ‏.‏ قال ‏\"‏ ما حاجتك غفر الله لك ولأمك ‏\"‏ ‏.‏ قال ‏\"‏ إن هذا ملك لم ينزل الأرض قط قبل هذه الليلة استأذن ربه أن يسلم على ويبشرني بأن فاطمة سيدة نساء أهل الجنة وأن الحسن والحسين سيدا شباب أهل الجنة ‏\"‏ ‏.‏ قال هذا حديث حسن غريب من هذا الوجه لا نعرفه إلا من حديث إسرائيل ‏.‏",
      "text_en": " Narrated Hudhaifah :                     \"My mother asked me: 'When is your planned time - meaning with the Prophet (ﷺ)?' So I said: 'I have not had a planned time to see him since such and such time.' She rebuked me, so I said to her: 'Let me go to the Prophet (ﷺ) so that I may perform Maghrib (prayer) with him, and ask him to seek forgiveness for you and I.' So I came to the Prophet (ﷺ), and I prayed Maghrib with him, then he prayed until he prayed Al-'Isha. Then he turned, and I followed him, and he heard my voice, and said: 'Who is this? Hudhaifah?' I said: 'Yes.' He said: \"What is your need, may Allah forgive you and your mother?' He said: 'Indeed, this is an angel that never descended to the earth ever before tonight. He sought permission from his Lord to greet me with peace and to give me the glad tidings that Fatimah is the chief of the women of Paradise, and that Al-Hasan and Al-Husain are the chiefs of the youths of the people of Paradise.'\"",
      "chain": [
        "30025",
        "30313",
        "30388",
        "20311",
        "25322",
        "11656",
        "11337",
        "145"
      ]
    },
    {
      "hadith_no": "4269",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا محمد بن يوسف، حدثنا سفيان، عن هشام بن عروة، عن أبيه، عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ خيركم خيركم لأهله وأنا خيركم لأهلي وإذا مات صاحبكم فدعوه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب صحيح من حديث الثوري ما أقل من رواه عن الثوري ‏.‏ وروي هذا عن هشام بن عروة عن أبيه عن النبي صلى الله عليه وسلم مرسل ‏.‏",
      "text_en": " Narrated 'Aishah:                     that the Messenger of Allah (ﷺ) said: \"The best of you is the best to his wives, and I am the best of you to my wives, and when your companion dies, leave him alone.\"",
      "chain": [
        "11222",
        "30388",
        "20005",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "4270",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا محمد بن يوسف، عن إسرائيل، عن الوليد، عن زيد بن زائدة، عن عبد الله بن مسعود، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يبلغني أحد عن أحد من أصحابي شيئا فإني أحب أن أخرج إليهم وأنا سليم الصدر ‏\"‏ ‏.‏ قال عبد الله فأتي رسول الله صلى الله عليه وسلم بمال فقسمه فانتهيت إلى رجلين جالسين وهما يقولان والله ما أراد محمد بقسمته التي قسمها وجه الله ولا الدار الآخرة ‏.‏ فتثبت حين سمعتهما فأتيت رسول الله صلى الله عليه وسلم وأخبرته فاحمر وجهه وقال ‏\"‏ دعني عنك فقد أوذي موسى بأكثر من هذا فصبر ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب من هذا الوجه وقد زيد في هذا الإسناد رجل ‏.‏",
      "text_en": " Narrated 'Abdullah bin Mas'ud:                     that the Messenger of Allah (ﷺ) said: \"No one should convey to me anything regarding any of my Companions, for I love that I should go out to them while my breast is at peace.\" 'Abdullah said: \"The Messenger of Allah (ﷺ) was brought some wealth, so the Prophet (ﷺ) distributed it. Then I came across two men that were sitting saying: 'By Allah! Muhammad (ﷺ) did not intend the Face of Allah in his distribution, nor the abode of the Hereafter.' So I spread this when I heard them, and I went to the Messenger of Allah (ﷺ) and I informed him. So his face became red and he said: 'Do not bother me with this, for indeed Musa was afflicted by more than this and he was patient.'\"",
      "chain": [
        "11222",
        "30388",
        "20311",
        "20733",
        "18322",
        "16"
      ]
    },
    {
      "hadith_no": "184",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا خالد، قال حدثنا ابن جريج، عن محمد بن يوسف، عن سليمان بن يسار، قال دخلت على أم سلمة فحدثتني أن رسول الله صلى الله عليه وسلم كان يصبح جنبا من غير احتلام ثم يصوم ‏.‏ وحدثنا مع هذا الحديث أنها حدثته أنها قربت إلى النبي صلى الله عليه وسلم جنبا مشويا فأكل منه ثم قام إلى الصلاة ولم يتوضأ ‏.‏",
      "text_en": " It was narrated that Sulaiman bin Yasar said:                      \"I entered upon Umm Salamah and she told me that the Messenger of Allah (ﷺ) used to wake up in a state of Janabah without having had a wet dream, then he would fast.\" And she told him that she brought the Prophet (ﷺ) some grilled ribs and he ate from that, then he got up and prayed, and did not perform Wudu'.",
      "chain": [
        "30449",
        "20423",
        "11070",
        "30388",
        "11005"
      ]
    },
    {
      "hadith_no": "185",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا خالد، قال حدثنا ابن جريج، قال حدثني محمد بن يوسف، عن ابن يسار، عن ابن عباس، قال شهدت رسول الله صلى الله عليه وسلم أكل خبزا ولحما ثم قام إلى الصلاة ولم يتوضأ ‏.‏",
      "text_en": "",
      "chain": [
        "30449",
        "20423",
        "11070",
        "30388",
        "17"
      ]
    },
    {
      "hadith_no": "418",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Ghusl and Tayammum - كتاب الغسل والتيمم",
      "chapter_no": "4",
      "text_ar": "أخبرنا محمد بن علي، قال حدثنا محمد بن يوسف، قال حدثنا سفيان، عن الأعمش، عن سالم، عن كريب، عن ابن عباس، عن ميمونة، قالت توضأ رسول الله صلى الله عليه وسلم وضوءه للصلاة غير رجليه وغسل فرجه وما أصابه ثم أفاض عليه الماء ثم نحى رجليه فغسلهما ‏‏.‏‏ قالت هذه غسلة للجنابة ‏‏.‏‏",
      "text_en": " It was narrated that Maimunah said:                      \"The Messenger of Allah (ﷺ) performed Wudu' as for prayer, but did not wash his feet, and he washed his private part and whatever had got onto it, then he poured water over himself, then he moved his feet and washed them.\" She said: \"This is Ghusl from Janabah.\"",
      "chain": [
        "11442",
        "30388",
        "20005",
        "11060",
        "11011",
        "11211",
        "17",
        "61"
      ]
    },
    {
      "hadith_no": "1218",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا إسحاق بن منصور، قال حدثنا محمد بن يوسف، قال حدثنا الأوزاعي، قال حدثني يحيى بن أبي كثير، عن هلال بن أبي ميمونة، قال حدثني عطاء بن يسار، عن معاوية بن الحكم السلمي، قال قلت يا رسول الله إنا حديث عهد بجاهلية فجاء الله بالإسلام وإن رجالا منا يتطيرون ‏.‏ قال ‏\"‏ ذاك شىء يجدونه في صدورهم فلا يصدنهم ‏\"‏ ‏.‏ ورجال منا يأتون الكهان ‏.‏ قال ‏\"‏ فلا تأتوهم ‏\"‏ ‏.‏ قال يا رسول الله ورجال منا يخطون ‏.‏ قال ‏\"‏ كان نبي من الأنبياء يخط فمن وافق خطه فذاك ‏\"‏ ‏.‏ قال وبينا أنا مع رسول الله صلى الله عليه وسلم في الصلاة إذ عطس رجل من القوم فقلت يرحمك الله فحدقني القوم بأبصارهم فقلت واثكل أمياه ما لكم تنظرون إلى قال فضرب القوم بأيديهم على أفخاذهم فلما رأيتهم يسكتوني لكني سكت فلما انصرف رسول الله صلى الله عليه وسلم دعاني بأبي وأمي هو ما ضربني ولا كهرني ولا سبني ما رأيت معلما قبله ولا بعده أحسن تعليما منه قال ‏\"‏ إن صلاتنا هذه لا يصلح فيها شىء من كلام الناس إنما هو التسبيح والتكبير وتلاوة القرآن ‏\"‏ ‏.‏ قال ثم اطلعت إلى غنيمة لي ترعاها جارية لي في قبل أحد والجوانية وإني اطلعت فوجدت الذئب قد ذهب منها بشاة وأنا رجل من بني آدم آسف كما يأسفون فصككتها صكة ثم انصرفت إلى رسول الله صلى الله عليه وسلم فأخبرته فعظم ذلك على فقلت يا رسول الله أفلا أعتقها قال ‏\"‏ ادعها ‏\"‏ ‏.‏ فقال لها رسول الله صلى الله عليه وسلم ‏\"‏ أين الله عز وجل ‏\"‏ ‏.‏ قالت في السماء ‏.‏ قال ‏\"‏ فمن أنا ‏\"‏ ‏.‏ قالت أنت رسول الله صلى الله عليه وسلم ‏.‏ قال ‏\"‏ إنها مؤمنة فاعتقها ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Mu'awiyah bin Al-Hakam As-Sulami said:                     \"I said: 'O Messenger of Allah (ﷺ), we were recently in a state of ignorance, then Allah (SWT) brought Islam. Some men among us follow omens.' He said: 'That is something that they find in their own hearts; it should not deter them from going ahead.' I said: 'And some men among us go to fortune tellers.' He said: 'Do not go to them.' He said: 'Some men among us draw lines.' He said: 'One of the Prophets used to draw lines. So whoever is in accord with his drawing of lines, then so it is.'\" He said: \"While I was praying with the Messenger of Allah (ﷺ), a man sneezed and I said: 'Yarhamuk-Allah (May Allah have mercy on you).' The people glared at me and I said: 'May my mother be bereft of me, why are you looking at me?' The people struck their hands against their thighs, and when I saw that they were telling me to be quiet, I fell silent. When the Messenger of Allah (ﷺ) finished, he called me. May my father and mother be ransomed for him, he neither did hit me nor rebuke me nor revile me. I have never seen a better teacher than him, before or after. He said: 'This prayer of ours is not the place for ordinary human speech, rather it is glorification and magnification of Allah (SWT), and reciting Qur'an.' Then I went out to a flock of sheep of mine that was tended by a slave woman of mine beside Uhud and Al-Jawwaniyyah, and I found that the wolf had taken one of the sheep. I am a man from the sons of Adam and I get upset as they get upset. So I slapped her. Then I came to the Messenger of Allah (ﷺ) and told him what happened. He regarded that as a serious action on my part. I said: 'O Messenger of Allah (ﷺ), should I set her free?' He said: 'Call her.' The Messenger of Allah (ﷺ) said to her: 'Where is Allah (SWT), the Mighty and Sublime?' She said: 'Above the heavens.' He said: 'And who am I?' She said: 'The Messenger of Allah (ﷺ).' He said: 'She is a believer, set her free.'\"",
      "chain": [
        "30313",
        "30388",
        "20024",
        "11449",
        "11229",
        "11020",
        "5300"
      ]
    },
    {
      "hadith_no": "1260",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا الربيع بن سليمان، قال حدثنا شعيب بن الليث، قال حدثنا الليث، عن محمد بن عجلان، عن محمد بن يوسف، مولى عثمان عن أبيه، يوسف أن معاوية، صلى إمامهم فقام في الصلاة وعليه جلوس فسبح الناس فتم على قيامه ثم سجد سجدتين وهو جالس بعد أن أتم الصلاة ثم قعد على المنبر فقال إني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من نسي شيئا من صلاته فليسجد مثل هاتين السجدتين ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Muhammad bin Yusuf, the freed slave of Uthman, from his father Yusuf, that:                     Mu'awiyah prayed in front of them, and he stood up during the prayer when he should have sat. The people said tasbih, but he remained standing, then he prostrated twice while he was sitting, after he completed the prayer. Then he sat on the Minbar and said: 'I heard the Messenger of Allah (ﷺ) say: 'Whoever forgets something in his prayer, let him prostrate twice like this.'",
      "chain": [
        "30583",
        "36033",
        "20023",
        "10616",
        "30388"
      ]
    },
    {
      "hadith_no": "1297",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا إسحاق بن منصور، قال حدثنا محمد بن يوسف، قال حدثنا يونس بن أبي إسحاق، عن بريد بن أبي مريم، قال حدثنا أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من صلى على صلاة واحدة صلى الله عليه عشر صلوات وحطت عنه عشر خطيئات ورفعت له عشر درجات ‏\"‏ ‏.‏",
      "text_en": " Anas bin Malik said:                     \"The Messenger of Allah (ﷺ) said: \"Whoever sends salah upon me once, Allah (SWT) will send salah upon him tenfold, and will erase ten sins from him, and will raise him ten degrees in status.\"",
      "chain": [
        "30313",
        "30388",
        "10846",
        "19840",
        "19"
      ]
    },
    {
      "hadith_no": "2558",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا إسحاق بن منصور، قال حدثنا محمد بن يوسف، قال حدثنا الأوزاعي، عن يحيى بن أبي كثير، قال حدثني محمد بن إبراهيم بن الحارث التيمي، عن ابن جابر، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن من الغيرة ما يحب الله عز وجل ومنها ما يبغض الله عز وجل ومن الخيلاء ما يحب الله عز وجل ومنها ما يبغض الله عز وجل فأما الغيرة التي يحب الله عز وجل فالغيرة في الريبة وأما الغيرة التي يبغض الله عز وجل فالغيرة في غير ريبة والاختيال الذي يحب الله عز وجل اختيال الرجل بنفسه عند القتال وعند الصدقة والاختيال الذي يبغض الله عز وجل الخيلاء في الباطل ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn Jabir, from his father, that the Messenger of Allah said:                     \"There is a kind of protective Jealousy that Allah, the Mighty and Sublime, loves anda kind that Allah, the Mighty and Sublime, hates, and a kind of pride that Allah, the Mighty and Sublime, loves and a kind that Allah, the Mighty and Sublime, hates, As for the protective jealousy that Allah, the Mighty and Sublime, loves, it is protective jealousy when there are grounds for suspicion. As for the protective jealousy that Allah, the Mighty and Sublime, hates, it is protective jealousy when there are no grounds for suspicion. As for the pride that Allah, the Mighty and Sublime, loves, it is when a man feels proud of himself when fighting and when giving charity. And as for the kind of pride that Allah, the Mighty and Sublime, hates, it is pride in doing wrong.\"",
      "chain": [
        "30313",
        "30388",
        "20024",
        "11449",
        "11213"
      ]
    },
    {
      "hadith_no": "3707",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of ar-Ruqba - كتاب الرقبى",
      "chapter_no": "33",
      "text_ar": "أخبرني محمد بن علي بن ميمون، قال حدثنا محمد، - وهو ابن يوسف - قال حدثنا سفيان، عن ابن أبي نجيح، عن طاوس، عن رجل، عن زيد بن ثابت، أن النبي صلى الله عليه وسلم جعل الرقبى للذي أرقبها ‏.‏",
      "text_en": " Muhammad bin 'Ali bin Maimun informed us, he said:                      \"Muhammad -he is, Ibn Yusuf- narrated to us, he said: 'Sufyan narrated to us from Ibn Abi Najih, from Tawus, from a man, from Zaid bin Thabit that the Prophet ruled that the Ruqba belongs to the one to whom it is given.'\"",
      "chain": [
        "38556",
        "30388",
        "20005",
        "11254",
        "11053",
        "49"
      ]
    },
    {
      "hadith_no": "4026",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا إسحاق بن منصور، قال حدثنا محمد بن يوسف، قال حدثنا الأوزاعي، قال حدثني يحيى بن أبي كثير، قال حدثني أبو قلابة، عن أنس، قال قدم على رسول الله صلى الله عليه وسلم ثمانية نفر من عكل فذكر نحوه إلى قوله لم يحسمهم وقال قتلوا الراعي ‏.‏",
      "text_en": " It was narrated that Anas said:                     \"Eighty men from 'Ukl came to the Messenger of Allah [SAW]\" and he (the narrator) mentioned a similar report up to the words: \"And he did not have (their wounds) cauterized.\" And he said: \"They killed the herdsman.\"",
      "chain": [
        "30313",
        "30388",
        "20024",
        "11449",
        "11047",
        "19"
      ]
    },
    {
      "hadith_no": "4294",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا شعيب بن يوسف، عن يحيى، عن محمد بن يوسف، عن السائب بن يزيد، عن رافع بن خديج، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ شر الكسب مهر البغي وثمن الكلب وكسب الحجام ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Waqi bin Khadij said:                     \"The Messenger of Allah said: 'The worst of earnings arte the gift of a female fornicator, the price of a dog and the earnings of a cupper.\"\"",
      "chain": [
        "30020",
        "30388",
        "3048",
        "1986"
      ]
    },
    {
      "hadith_no": "4945",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرنا أبو الأزهر النيسابوري، قال حدثنا محمد بن يوسف، قال حدثنا سفيان، عن منصور، عن الحكم، عن مجاهد، عن أيمن، قال لم تقطع اليد في زمن رسول الله صلى الله عليه وسلم إلا في ثمن المجن وقيمة المجن يومئذ دينار ‏.‏",
      "text_en": " It was narrated that Ayman said:                     \"The hand of a thief was not be cut off during the time of the Messenger of Allah except for the value of a shield, and the value of a shield in those days was a Dinar.\" (Daif)",
      "chain": [
        "38001",
        "30388",
        "20005",
        "11067",
        "11069",
        "11028"
      ]
    },
    {
      "hadith_no": "76",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا أحمد بن الأزهر، حدثنا محمد بن يوسف، حدثنا عبد الحميد بن بهرام، عن شهر بن حوشب، عن عبد الرحمن بن غنم، عن معاذ بن جبل، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ أمرت أن أقاتل الناس حتى يشهدوا أن لا إله إلا الله وأني رسول الله ويقيموا الصلاة ويؤتوا الزكاة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Mu'adh bin Jabal said:                     \"The Messenger of Allah (ﷺ) said: 'I have been commanded to fight the people until they testify to La ilaha ill-allah (none has the right to be worshipped but Allah) and that I am the Messenger of Allah, and establish regular prayers and pay Zakat.'\"",
      "chain": [
        "38001",
        "30388",
        "18598",
        "11044",
        "5152",
        "32"
      ]
    },
    {
      "hadith_no": "452",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا محمد بن يوسف، عن سفيان، عن ليث، عن شهر بن حوشب، عن أبي مالك الأشعري، قال كان رسول الله  صلى الله عليه وسلم  يتوضأ ثلاثا ثلاثا ‏.‏",
      "text_en": " It was narrated that Abu Malik Ash'ari said:                     \"The Messenger of Allah used to perform ablution washing each part three times.\"",
      "chain": [
        "11222",
        "30388",
        "20005",
        "20023",
        "11044",
        "5372"
      ]
    },
    {
      "hadith_no": "734",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Adhan and the Sunnah Regarding It - كتاب الأذان والسنة فيها",
      "chapter_no": "3",
      "text_ar": "حدثنا حرملة بن يحيى، حدثنا عبد الله بن وهب، أنبأنا عبد الجبار بن عمر، عن ابن أبي فروة، عن محمد بن يوسف، مولى عثمان بن عفان عن أبيه، عن عثمان، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من أدركه الأذان في المسجد ثم خرج لم يخرج لحاجة وهو لا يريد الرجعة فهو منافق ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Uthman said:                     \"The Messenger of Allah said: 'Whoever hears the Adhan when he is in the mosque, then goes out and does not go out for any (legitimate) need and does not intend to return, is a hypocrite.'\"",
      "chain": [
        "30487",
        "20029",
        "28317",
        "30388",
        "4"
      ]
    },
    {
      "hadith_no": "1265",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا محمد بن يوسف، حدثنا سفيان، عن جابر، عن المغيرة بن شبيل، عن قيس بن أبي حازم، عن المغيرة بن شعبة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إذا قام أحدكم من الركعتين فلم يستتم قائما فليجلس فإذا استتم قائما فلا يجلس ويسجد سجدتى السهو ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Mughirah bin Shu’bah said:                      “The Messenger ofAllah(ﷺ) said: ‘If anyone of you stands after two Rak’ah, if he hasnot yet stood up fully, let him sit down again, but if he has stoodupfully, then let him not sit down, and let him perform twoprostrationsfor forgetfulness (Sahw).’”",
      "chain": [
        "11222",
        "30388",
        "20005",
        "34",
        "19880",
        "11046",
        "166"
      ]
    },
    {
      "hadith_no": "1649",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا محمد بن يوسف، حدثنا عمر بن راشد اليمامي، عن يحيى بن أبي كثير، عن عكرمة، عن ابن عباس، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ النياحة على الميت من أمر الجاهلية فإن النائحة إن لم تتب قبل أن تموت فإنها تبعث يوم القيامة عليها سرابيل من قطران ثم يعلى عليها بدروع من لهب النار ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Abbas that the Messenger of Allah (ﷺ)said:                     “Wailing over the dead is one of the affairs of the Days ofIgnorance and if the woman who wails does not repent before she dies,she will be resurrected on the Day of Resurrection wearing a shirt ofpitch (tar), over which she will wear a shirt of flaming fire.”",
      "chain": [
        "11222",
        "30388",
        "28427",
        "11449",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2350",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Rulings - كتاب الأحكام",
      "chapter_no": "13",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا محمد بن يوسف، حدثنا إسرائيل، حدثنا سماك بن حرب، عن عكرمة، عن ابن عباس، أن قريشا، أتوا امرأة كاهنة فقالوا لها أخبرينا أشبهنا أثرا بصاحب المقام ‏.‏ فقالت إن أنتم جررتم كساء على هذه السهلة ثم مشيتم عليها أنبأتكم ‏.‏ قال فجروا كساء ثم مشى الناس عليها فأبصرت أثر رسول الله صلى الله عليه وسلم ‏.‏ فقالت هذا أقربكم إليه شبها ‏.‏ ثم مكثوا بعد ذلك عشرين سنة أو ما شاء الله ثم بعث الله محمدا صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that :                     the Quraish went to a sorceress and they said to her: “Tell us whose footprints most resemble those of the owner of Al-Maqam (the station of Ibrahim).” She said: “If you spread a piece of cloth over this soft earth and walk over it, I will tell you.” So they spread out a piece of cloth and the people walked over it. She saw the footprints of the Messenger of Allah (ﷺ) and said: “This one most closely resembles him among you.”  After that twenty years passed, of as long as Allah willed, then Allah sent Muhammad (ﷺ) (i.e., missioned him as the Prophet).",
      "chain": [
        "11222",
        "30388",
        "20311",
        "10770",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "3067",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا محمد بن يوسف، وقبيصة، قالا حدثنا سفيان، عن ابن جريج، عن عبد الحميد، عن ابن يعلى بن أمية، عن أبيه، يعلى أن النبي  صلى الله عليه وسلم  طاف مضطبعا ‏.‏ قال قبيصة وعليه برد ‏.‏",
      "text_en": " It wasnarrated from Ibn Ya’la bin Umayyah that his father Ya’lasaid:                     “The Prophet (ﷺ) performed Tawaf while doing Idtiba’.”* (Inhis narration, one of the narrators) Qabisah said: “While wearing aYemenite cloth.”",
      "chain": [
        "11222",
        "30388",
        "20351",
        "20012",
        "11070",
        "11703"
      ]
    },
    {
      "hadith_no": "3268",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Sacrifices - كتاب الأضاحي",
      "chapter_no": "26",
      "text_ar": "حدثنا إسحاق بن منصور، أنبأنا عبد الرحمن بن مهدي، ومحمد بن يوسف، ح وحدثنا محمد بن يحيى، حدثنا عبد الرزاق، جميعا عن سفيان الثوري، عن بيان، عن الشعبي، عن أبي سريحة، قال حملني أهلي على الجفاء بعدما علمت من السنة كان أهل البيت يضحون بالشاة والشاتين والآن يبخلنا جيراننا ‏.‏",
      "text_en": " It wasnarrated that Abu Sarihah said:                      “My family started to putpressureon me after I came to know the Sunnah. People used tosacrifice oneor two sheep, but now our neighbors call us stingy.”",
      "chain": [
        "30313",
        "20033",
        "30388",
        "11222",
        "20121",
        "20012",
        "11326",
        "11052"
      ]
    },
    {
      "hadith_no": "3438",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا محمد بن يوسف، حدثنا سفيان، عن عبد الرحمن بن عابس، أخبرني أبي، عن عائشة، قالت لقد كنا نرفع الكراع فيأكله رسول الله  صلى الله عليه وسلم  بعد خمس عشرة من الأضاحي ‏.‏",
      "text_en": " It wasnarrated that ‘Aishah said:                      “We used to store trotters and theMessenger of Allah (ﷺ) would eat them fifteen days after thesacrifice.”",
      "chain": [
        "11222",
        "30388",
        "20005",
        "11638",
        "11357",
        "53"
      ]
    }
  ],
  "total_hadiths": 148
}