{
  "id": "30386",
  "name": "Muhammad bin al-Nadr محمد بن النضر بن عبد الوهاب",
  "full_name": "Muhammad bin al-Nadr محمد بن النضر بن عبد الوهاب",
  "grade": "3rd Century AH [12th generation]",
  "reliability_grade": "Maqbool",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Maqbool] [ خ  -  مقبول ]"
    ],
    "tags": [],
    "area_of_interest_display": [
      {
        "en": "Narrator[Grade:Maqbool] [ خ  -  مقبول ]",
        "ar": "Narrator[Grade:Maqbool] [ خ  -  مقبول ]",
        "ckb": "Narrator[Grade:Maqbool] [ خ  -  مقبول ]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "NA",
        "ar": "NA",
        "ckb": "NA"
      }
    ],
    "tags_display": []
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "id": "sahih-bukhari-4695",
      "hadith_no": "4695",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن النضر، حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن عبد الحميد، صاحب الزيادي سمع أنس بن مالك، قال قال أبو جهل ‏{‏اللهم إن كان هذا هو الحق من عندك فأمطر علينا حجارة من السماء أو ائتنا بعذاب أليم‏}‏ فنزلت ‏{‏وما كان الله ليعذبهم وأنت فيهم وما كان الله معذبهم وهم يستغفرون * وما لهم أن لا يعذبهم الله وهم يصدون عن المسجد الحرام‏}‏ الآية‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Abu Jahl said, \"O Allah! If this (Qur'an) is indeed the Truth from You), then rain down on us a shower of stones from the sky or bring on us a painful punishment.\" So there was revealed:-- 'But Allah would not punish them while you (Muhammad) were amongst them, nor will He punish them while they seek (Allah's) Forgiveness. And why Allah should not punish them while they stop (men) from Al-Masjid-al-Haram ..' (8.33-34)",
      "usc_msa_ref": "172",
      "chain": [
        "30386",
        "30150",
        "20286",
        "20020",
        "11703",
        "19"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sunan-abi-daud-3063",
      "hadith_no": "3063",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا محمد بن النضر، قال سمعت الحنيني، قال قرأته غير مرة يعني كتاب قطيعة النبي صلى الله عليه وسلم ‏.‏ قال أبو داود وحدثنا غير واحد عن حسين بن محمد أخبرنا أبو أويس حدثني كثير بن عبد الله عن أبيه عن جده أن النبي صلى الله عليه وسلم أقطع بلال بن الحارث المزني معادن القبلية جلسيها وغوريها - قال ابن النضر وجرسها وذات النصب ثم اتفقا - وحيث يصلح الزرع من قدس ‏.‏ ولم يعط بلال بن الحارث حق مسلم وكتب له النبي صلى الله عليه وسلم ‏\"‏ هذا ما أعطى رسول الله صلى الله عليه وسلم بلال بن الحارث المزني أعطاه معادن القبلية جلسها وغورها وحيث يصلح الزرع من قدس ولم يعطه حق مسلم ‏\"‏ ‏.‏ قال أبو أويس حدثني ثور بن زيد عن عكرمة عن ابن عباس عن النبي صلى الله عليه وسلم مثله زاد ابن النضر وكتب أبى بن كعب ‏.‏",
      "text_en": " Narrated Amr ibn Awf al-Muzani:                     The Prophet (ﷺ) assigned as a fief to Bilal ibn Harith al-Muzani the mines of al-Qabaliyyah, both those which lay on the upper side those and which lay on the lower side. The narrator, Ibn an-Nadr, added: \"also Jars and Dhat an-Nusub.\" The agreed version reads: \"and (the land) which is suitable for cultivation at Quds\". He did not assign to Bilal ibn al-Harith the right of any Muslim. The Prophet (ﷺ) wrote a document to him:  \"This is what the Messenger of Allah (ﷺ) assigned to Bilal ibn al-Harith al-Muzani. He gave him the mines of al-Qabaliyyah both those which lay on the upper and lower side, and that which is fit for cultivation at Quds. He did not give him the right of any Muslim.\"  The narrator AbuUways said: A similar tradition has been transmitted to me by Thawr ibn Zayd from Ikrimah on the authority of Ibn Abbas from the Prophet (ﷺ). Ibn an-Nadr added: Ubayy ibn Ka'b wrote it.",
      "usc_msa_ref": "",
      "chain": [
        "30386",
        "22016"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-an-nasai-2347",
      "hadith_no": "2347",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن النضر بن مساور المروزي، قال حدثنا حماد، عن مروان أبي لبابة، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يصوم حتى نقول ما يريد أن يفطر ويفطر حتى نقول ما يريد أن يصوم ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"The Messenger of Allah used to fast until we said: 'He does not want to break his fast.' And he used not to fast until we said: 'He does not want to fast.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30386",
        "20022",
        "53"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    }
  ],
  "total_hadiths": 3,
  "grade_display": {
    "en": "3rd Century AH [12th Generation]",
    "ar": "القرن الثالث الهجري [الجيل الثاني عشر]",
    "ckb": "سەدەی سێیەمی كۆچی [نەوەی دوازدەیەم]"
  }
}