{
  "id": "30397",
  "name": "Yahya bin Ja'far bin A'yn al-Baykandi يحيى بن جعفر بن أعين الأزدي - البيكندي",
  "full_name": "Yahya bin Ja'far bin A'yn al-Baykandi يحيى بن جعفر بن أعين الأزدي - البيكندي",
  "grade": "3rd Century AH [10th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "243",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  -  ثقة ]"
    ],
    "tags": [
      "al-Azdi",
      "al-Baykandi",
      "al-Bukhari",
      "Imam",
      "Hafiz"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20354",
      "name": "Muhammad bin Khazim al-Darir محمد بن خازم أبو معاوية الضرير",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20032",
      "name": "Waki' bin al-Jarrah وكيع بن الجراح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20472",
      "name": "Yazid bin Harun يزيد بن هارون",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20121",
      "name": "'Abdur-Razzaq عبد الرزاق بن همام",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20287",
      "name": "Mua'dh bin Hisham bin Aby معاذ بن هشام بن أبي عبد الله",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20280",
      "name": "Muhammad bin 'Abdullah al-Ansari محمد بن عبد الله بن المثني - الأنصاري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30328",
      "name": "al-Husain bin Yahya bin Ja'far الحسين بن يحيى بن جعفر",
      "grade": "3rd Century AH [12th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "2066",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثني يحيى بن جعفر، حدثنا عبد الرزاق، عن معمر، عن همام، قال سمعت أبا هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا أنفقت المرأة من كسب زوجها عن غير أمره، فله نصف أجره ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"If a woman gives something (i.e. in charity) from her husband's earnings without his permission, she will get half his reward.\"",
      "chain": [
        "30397",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "3218",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا أبو نعيم، حدثنا عمر بن ذر، ح قال حدثني يحيى بن جعفر، حدثنا وكيع، عن عمر بن ذر، عن أبيه، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال قال رسول الله صلى الله عليه وسلم لجبريل ‏\"‏ ألا تزورنا أكثر مما تزورنا ‏\"‏ قال فنزلت ‏{‏وما نتنزل إلا بأمر ربك له ما بين أيدينا وما خلفنا‏}‏ الآية‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Allah's Apostle asked Gabriel, \"Why don't you visit us more often than you do?\" Then the following Holy Verse was revealed (in this respect):-- \"And we (angels) descend not but by the order of your Lord. To Him belong what is before us and what is behind us, and what is between those two and your Lord was never forgetful.\" (19.64)",
      "chain": [
        "20348",
        "11642",
        "30397",
        "20032",
        "11642",
        "11423",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "3280",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا يحيى بن جعفر، حدثنا محمد بن عبد الله الأنصاري، حدثنا ابن جريج، قال أخبرني عطاء، عن جابر  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا استجنح ‏{‏الليل‏}‏  أو كان جنح الليل  فكفوا صبيانكم، فإن الشياطين تنتشر حينئذ، فإذا ذهب ساعة من العشاء فحلوهم وأغلق بابك، واذكر اسم الله، وأطفئ مصباحك، واذكر اسم الله، وأوك سقاءك، واذكر اسم الله، وخمر إناءك، واذكر اسم الله، ولو تعرض عليه شيئا ‏\"‏‏.‏",
      "text_en": " Narrated Jabir:                     The Prophet said, \"When nightfalls, then keep your children close to you, for the devil spread out then. An hour later you can let them free; and close the gates of your house (at night), and mention Allah's Name thereupon, and cover your utensils, and mention Allah's Name thereupon, (and if you don't have something to cover your utensil) you may put across it something (e.g. a piece of wood etc.).",
      "chain": [
        "30397",
        "20280",
        "11070",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "3411",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا يحيى بن جعفر، حدثنا وكيع، عن شعبة، عن عمرو بن مرة، عن مرة الهمداني، عن أبي موسى  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ كمل من الرجال كثير، ولم يكمل من النساء إلا آسية امرأة فرعون، ومريم بنت عمران، وإن فضل عائشة على النساء كفضل الثريد على سائر الطعام ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa:                     Allah's Apostle said, \"Many amongst men reached (the level of) perfection but none amongst the women reached this level except Asia, Pharaoh's wife, and Mary, the daughter of `Imran. And no doubt, the superiority of `Aisha to other women is like the superiority of Tharid (i.e. a meat and bread dish) to other meals.\"",
      "chain": [
        "30397",
        "20032",
        "20020",
        "11381",
        "9759",
        "41"
      ]
    },
    {
      "hadith_no": "4017",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا يحيى بن جعفر، أخبرنا وكيع، عن سفيان، عن أبي هاشم، عن أبي مجلز، عن قيس بن عباد، سمعت أبا ذر  رضى الله عنه  يقسم لنزلت هؤلاء الآيات في هؤلاء الرهط الستة يوم بدر‏.‏ نحوه‏.‏",
      "text_en": " Narrated Qais bin Ubad:                     I heard Abu Dhar swearing that these Holy Verses were revealed in connection with those six persons on the day of Badr.",
      "chain": [
        "30397",
        "20032",
        "20012",
        "11454",
        "11313",
        "11609",
        "23"
      ]
    },
    {
      "hadith_no": "6299",
      "source": " Sahih Bukhari ",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا يحيى بن جعفر، حدثنا عبد الرزاق، عن معمر، عن همام، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ خلق الله آدم على صورته، طوله ستون ذراعا، فلما خلقه قال اذهب فسلم على أولئك النفر من الملائكة جلوس، فاستمع ما يحيونك، فإنها تحيتك وتحية ذريتك‏.‏ فقال السلام عليكم‏.‏ فقالوا السلام عليك ورحمة الله‏.‏ فزادوه ورحمة الله، فكل من يدخل الجنة على صورة آدم، فلم يزل الخلق ينقص بعد حتى الآن ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Allah created Adam in His picture, sixty cubits (about 30 meters) in height. When He created him, He said (to him), \"Go and greet that group of angels sitting there, and listen what they will say in reply to you, for that will be your greeting and the greeting of your offspring.\" Adam (went and) said, 'As-Salamu alaikum (Peace be upon you).' They replied, 'AsSalamu-'Alaika wa Rahmatullah (Peace and Allah's Mercy be on you) So they increased 'Wa Rahmatullah' The Prophet added 'So whoever will enter Paradise, will be of the shape and picture of Adam Since then the creation of Adam's (offspring) (i.e. stature of human beings is being diminished continuously) to the present time.\"",
      "chain": [
        "30397",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "6352",
      "source": " Sahih Bukhari ",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا يحيى بن جعفر، حدثنا يزيد، عن شعبة، عن مغيرة، عن إبراهيم، عن علقمة، أنه قدم الشأم‏.‏ وحدثنا أبو الوليد، حدثنا شعبة، عن مغيرة، عن إبراهيم، قال ذهب علقمة إلى الشأم، فأتى المسجد فصلى ركعتين فقال اللهم ارزقني جليسا‏.‏ فقعد إلى أبي الدرداء فقال ممن أنت قال من أهل الكوفة‏.‏ قال أليس فيكم صاحب السر الذي كان لا يعلمه غيره  يعني حذيفة  أليس فيكم  أو كان فيكم  الذي أجاره الله على لسان رسوله صلى الله عليه وسلم من الشيطان  يعني عمارا  أوليس فيكم صاحب السواك والوساد  يعني ابن مسعود  كيف كان عبد الله يقرأ ‏{‏والليل إذا يغشى‏}‏‏.‏ قال ‏{‏والذكر والأنثى‏}‏‏.‏ فقال ما زال هؤلاء حتى كادوا يشككوني، وقد سمعتها من رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Ibrahim:                     'Alaqama went to Sham and came to the mosque and offered a two-rak`at prayer, and invoked Allah: \"O Allah! Bless me with a (pious) good companion.\" So he sat beside Abu Ad-Darda' who asked, \"From where are you?\" He said, \"From the people of Kufa.\" Abu Darda' said, \"Wasn't there among you the person who keeps the secrets (of the Prophet ) which nobody knew except him (i.e., Hudhaifa (bin Al-Yaman)). And isn't there among you the person whom Allah gave refuge from Satan through the request (tongue) of Allah's Apostle? (i.e., `Ammar). Isn't there among you the one who used to carry the Siwak and the cushion (or pillows (of the Prophets)? (i.e., Ibn Mas`ud). How did Ibn Mas`ud use to recite 'By the night as it conceals (the light)?\" (Sura 92). 'Alqama said, \"Wadhdhakari Wal Untha' (And by male and female.\") Abu Ad-Darda added. 'These people continued to argue with me regarding it till they were about to cause me to have doubts although I heard it from Allah's Apostle.\"",
      "chain": [
        "30397",
        "20472",
        "20020",
        "11072",
        "11051",
        "11017",
        "20296",
        "20020",
        "11072",
        "11051"
      ]
    },
    {
      "hadith_no": "7513",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا يحيى بن جعفر، حدثنا أبو معاوية، عن الأعمش، عن إبراهيم  هو التيمي  عن أبيه، عن أبي ذر، قال دخلت المسجد ورسول الله صلى الله عليه وسلم جالس، فلما غربت الشمس قال ‏\"‏ يا أبا ذر هل تدري أين تذهب هذه ‏\"‏‏.‏ قال قلت الله ورسوله أعلم‏.‏ قال ‏\"‏ فإنها تذهب تستأذن في السجود فيؤذن لها، وكأنها قد قيل لها ارجعي من حيث جئت‏.‏ فتطلع من مغربها ‏\"‏‏.‏ ثم قرأ ‏{‏ذلك مستقر لها‏}‏ في قراءة عبد الله‏.‏",
      "text_en": " Narrated Abu Dharr:                     I entered the mosque while Allah's Apostle was sitting there. When the sun had set, the Prophet said, \"O Abu Dharr! Do you know where this (sun) goes?\" I said, \"Allah and His Apostle know best.\" He said, \"It goes and asks permission to prostrate, and it is allowed, and (one day) it, as if being ordered to return whence it came, then it will rise from the west.\" Then the Prophet recited, \"That: \"And the sun runs on its fixed course (for a term decreed),\" (36.38) as it is recited by `Abdullah.",
      "chain": [
        "30397",
        "20354",
        "11060",
        "11322",
        "11405",
        "23"
      ]
    }
  ],
  "total_hadiths": 8
}