{
  "id": "30394",
  "name": "Musa bin Hzam موسى بن حزام",
  "full_name": "Musa bin Hzam موسى بن حزام",
  "grade": "3rd Century AH [11th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "250",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Bulkh"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  ت  س  -  ثقة ]"
    ],
    "tags": [
      "Bulkh"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20315",
      "name": "al-Husain bin 'Ali bin al-Walid al-Ja'fi الحسين بن علي بن الوليد الجعفي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20650",
      "name": "Zayd bin al-Habab al-'Akli زيد بن الحباب أبو الحسين العكلي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20318",
      "name": "Hammad bin Usamah حماد بن أسامة - أبو أسامة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20348",
      "name": "al-Fadl bin Dakayn, Abu Na'eem الفضل بن دكين أبو نعيم الملائي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20472",
      "name": "Yazid bin Harun يزيد بن هارون",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20364",
      "name": "Yahya bin Aadm bin Sulaiman يحيى بن آدم بن سليمان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20556",
      "name": "'Abdul Malik bin Qarib - al-Asma'i عبد الملك بن قريب بن عبد الملك - الأصمعي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "38384",
      "name": "'Ali bin Ishaq al-Salmi علي بن إسحاق السلمي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20352",
      "name": "Muhammad bin Bashr bin al-Farafsa محمد بن بشر بن الفرافصة العبدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    }
  ],
  "students": [
    {
      "id": "30005",
      "name": "Imam Tirmidhi الترمذي محمد بن عيسى بن سورة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30006",
      "name": "Imam Nasa'i أحمد بن شعيب بن علي بن سنان النسائي",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "38024",
      "name": "Ahmed bin Syar bin Ayoub أحمد بن سيار بن أيوب",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38347",
      "name": "'Abdul 'Aziz bin Mnyb عبد العزيز بن منيب",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "3331",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا أبو كريب، وموسى بن حزام، قالا حدثنا حسين بن علي، عن زائدة، عن ميسرة الأشجعي، عن أبي حازم، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ استوصوا بالنساء، فإن المرأة خلقت من ضلع، وإن أعوج شىء في الضلع أعلاه، فإن ذهبت تقيمه كسرته، وإن تركته لم يزل أعوج، فاستوصوا بالنساء ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah 's Apostle said, \"Treat women nicely, for a women is created from a rib, and the most curved portion of the rib is its upper portion, so, if you should try to straighten it, it will break, but if you leave it as it is, it will remain crooked. So treat women nicely.\"",
      "chain": [
        "30216",
        "30394",
        "20315",
        "20320",
        "11658",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "2702",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "أخبرنا موسى بن حزام الرجل الصالح، حدثنا علي بن إسحاق، أخبرنا عبد الله بن المبارك، أخبرنا المثنى بن الصباح، عن عمرو بن شعيب، عن أبيه، عن جده، عن النبي صلى الله عليه وسلم نحوه ‏.‏ قال هذا حديث حسن غريب ولم يذكر سويد بن نصر في حديثه عن أبيه ‏.‏",
      "text_en": "",
      "chain": [
        "30394",
        "20025",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "3583",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا موسى بن حزام، وعبد بن حميد، وغير، واحد، قالوا حدثنا محمد بن بشر، فقال سمعت هانئ بن عثمان، عن أمه، حميضة بنت ياسر عن جدتها، يسيرة وكانت من المهاجرات قالت قال لنا رسول الله صلى الله عليه وسلم ‏\"‏ عليكن بالتسبيح والتهليل والتقديس واعقدن بالأنامل فإنهن مسئولات مستنطقات ولا تغفلن فتنسين الرحمة ‏\"‏ ‏.‏ قال هذا حديث غريب إنما نعرفه من حديث هانئ بن عثمان وقد روى محمد بن ربيعة عن هانئ بن عثمان ‏.‏",
      "text_en": " Humaidah bint Yasir narrated from her grandmother Yusairah - and she was one of those who emigrated - she said:                     “The Messenger of Allah said to us: ‘Hold fast to At-Tasbih, At-Tahlil, and At-Taqdis,  and count them upon the fingertips, for indeed they shall be questioned, and they will be made to speak. And do not become heedless, so that you forget about the Mercy (of Allah).”",
      "chain": [
        "30394",
        "30553",
        "20352"
      ]
    },
    {
      "hadith_no": "952",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا موسى بن حزام الترمذي، وهارون بن عبد الله، - واللفظ له - قالا حدثنا أبو أسامة، قال أخبرني سفيان، عن معاوية بن صالح، عن عبد الرحمن بن جبير بن نفير، عن أبيه، عن عقبة بن عامر، أنه سأل النبي صلى الله عليه وسلم عن المعوذتين قال عقبة فأمنا بهما رسول الله صلى الله عليه وسلم في صلاة الفجر ‏.‏",
      "text_en": " It was narrated from Uqbah bin Amr that:                     He asked the Prophet (ﷺ) about Al-Mua'awwidhatain. Uqbah said: \"The Messenger of Allah (ﷺ) led us in praying Fajr and recited them.\"",
      "chain": [
        "30394",
        "20318",
        "20012",
        "20675",
        "10942",
        "189"
      ]
    },
    {
      "hadith_no": "1350",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا موسى بن حزام الترمذي، قال حدثنا يحيى بن آدم، عن ابن إدريس، عن هشام بن حسان، عن محمد بن سيرين، عن كثير بن أفلح، عن زيد بن ثابت، قال أمروا أن يسبحوا، دبر كل صلاة ثلاثا وثلاثين ويحمدوا ثلاثا وثلاثين ويكبروا أربعا وثلاثين فأتي رجل من الأنصار في منامه فقيل له أمركم رسول الله صلى الله عليه وسلم أن تسبحوا دبر كل صلاة ثلاثا وثلاثين وتحمدوا ثلاثا وثلاثين وتكبروا أربعا وثلاثين قال نعم ‏.‏ قال فاجعلوها خمسا وعشرين واجعلوا فيها التهليل فلما أصبح أتى النبي صلى الله عليه وسلم فذكر ذلك له فقال ‏\"‏ اجعلوها كذلك ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Zaid bin Thabit said:                     \"They were commanded to say the tasbih thirty-three times following the prayer, and to say the tahmid thirty-three times, and to say the takbir thirty-four times, then a man from among the Ansar was told in a dream: 'Did the Messenger of Allah (ﷺ) command you to say the tasbih thirty-three times following the prayer, and to say the tahmid thirty-three times, and to say the takbir thirty-four times?' He said: 'Yes.' 'Instead of that, say each one twenty-five times, and include the tahlil among them.' The next morning he came to the Messenger of Allah (ﷺ) and told him about that, and he said: 'Do that.'\"",
      "chain": [
        "30394",
        "20364",
        "20102",
        "11311",
        "11035",
        "12438",
        "49"
      ]
    },
    {
      "hadith_no": "5434",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا موسى بن حزام الترمذي، قال أنبأنا أبو أسامة، عن سفيان، عن معاوية بن صالح، عن عبد الرحمن بن جبير بن نفير، عن أبيه، عن عقبة بن عامر، أنه سأل رسول الله صلى الله عليه وسلم عن المعوذتين ‏.‏ قال عقبة فأمنا رسول الله صلى الله عليه وسلم بهما في صلاة الغداة ‏.‏",
      "text_en": " It was narrated from 'Uqbah bin 'Amir that :                     He asked the Messenger of Allah [SAW] about Al-Mu'awwidhatain. 'Uqbah said: \"The Messenger of Allah [SAW] recited them when he led us in Salah Al-Ghadah (As-Subh).\"",
      "chain": [
        "30394",
        "20318",
        "20012",
        "20675",
        "10942",
        "189"
      ]
    }
  ],
  "total_hadiths": 6
}