{
  "id": "30400",
  "name": "Y'aqub bin Ibrahim bin Kathir يعقوب بن إبراهيم بن كثير بن زيد الدورقي",
  "full_name": "Y'aqub bin Ibrahim bin Kathir يعقوب بن إبراهيم بن كثير بن زيد الدورقي",
  "grade": "3rd Century AH [10th generation]",
  "biography": {
    "birth": {
      "date_hijri": "160",
      "date_gregorian": "NA",
      "date_display": [
        "160 AH"
      ],
      "place": ""
    },
    "death": {
      "date_hijri": "252",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Baghdad"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-'Abdi",
      "Client",
      "Baghdadi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [
    {
      "id": "30494",
      "name": "Ahmed bin Ibrahim bin Kathir أحمد بن إبراهيم بن كثير",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "20167",
      "name": "'Abdul 'Aziz bin Muhammad al-Daruradi عبد العزيز بن محمد الدراوردي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20165",
      "name": "'Abdul 'Aziz bin Abi Hazim عبد العزيز بن أبي حازم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20354",
      "name": "Muhammad bin Khazim al-Darir محمد بن خازم أبو معاوية الضرير",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20317",
      "name": "Hafs bin Ghyath حفص بن غياث",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20468",
      "name": "Hashaym bin Bashayr bin al-Qasim هشيم بن بشير بن القاسم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20031",
      "name": "Yahya bin Sa'id bin Farroukh al-Qatan يحيى بن سعيد بن فروخ القطان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20033",
      "name": "'Abdur Rahman bin Mahdi عبد الرحمن بن مهدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20201",
      "name": "Marwan bin Mua'wiya al-Fazari مروان بن معاوية الفزاري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20288",
      "name": "Ma'tmar bin Sulaiman-al-Taufayl معتمر بن سليمان - الطفيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20366",
      "name": "Yahya bin Zakaria bin Abi Zaida يحيى بن زكريا بن أبي زائدة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20365",
      "name": "Yahya bin Abi Bkyr يحيى بن أبي بكير واسمه نسر",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20318",
      "name": "Hammad bin Usamah حماد بن أسامة - أبو أسامة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20229",
      "name": "Ruh bin 'Ubada bin al-'Ala' روح بن عبادة بن العلاء",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20194",
      "name": "Suh'aib bin Harb شعيب بن حرب",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20472",
      "name": "Yazid bin Harun يزيد بن هارون",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20241",
      "name": "al-Dahhak bin Mukhlad Abu 'Asim al-Nabil الضحاك بن مخلد أبو عاصم النبيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]"
    },
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "30005",
      "name": "Imam Tirmidhi الترمذي محمد بن عيسى بن سورة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30006",
      "name": "Imam Nasa'i أحمد بن شعيب بن علي بن سنان النسائي",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30004",
      "name": "Ibn Maja ابن ماجة",
      "grade": "3rd Century AH [12th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1191",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of Prayer at Masjid Makkah and Madinah - كتاب فضل الصلاة فى مسجد مكة والمدينة",
      "chapter_no": "20",
      "text_ar": "حدثنا يعقوب بن إبراهيم  هو الدورقي  حدثنا ابن علية، أخبرنا أيوب، عن نافع، أن ابن عمر  رضى الله عنهما  كان لا يصلي من الضحى إلا في يومين يوم يقدم بمكة، فإنه كان يقدمها ضحى، فيطوف بالبيت، ثم يصلي ركعتين خلف المقام، ويوم يأتي مسجد قباء، فإنه كان يأتيه كل سبت، فإذا دخل المسجد كره أن يخرج منه حتى يصلي فيه‏.‏ قال وكان يحدث أن رسول الله صلى الله عليه وسلم كان يزوره راكبا وماشيا‏.‏ قال وكان يقول إنما أصنع كما رأيت أصحابي يصنعون، ولا أمنع أحدا أن يصلي في أى ساعة شاء من ليل أو نهار، غير أن لا تتحروا طلوع الشمس ولا غروبها‏.‏",
      "text_en": " Narrated Nafi`:                     Ibn `Umar never offered the Duha prayer except on two occasions: (1) Whenever he reached Mecca; and he always used to reach Mecca in the forenoon. He would perform Tawaf round the Ka`ba and then offer two rak`at at the rear of Maqam Ibrahim. (2) Whenever he visited Quba, for he used to visit it every Saturday. When he entered the Mosque, he disliked to leave it without offering a prayer. Ibn `Umar narrated that Allah's Apostle used to visit the Mosque of Quba (sometime) walking and (sometime) riding. And he (i.e. Ibn `Umar) used to say, \"I do only what my companions used to do and I don't forbid anybody to pray at any time during the day or night except that one should not intend to pray at sunrise or sunset.\"",
      "chain": [
        "30400",
        "20208",
        "11015",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "210",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا سريج بن يونس، ويعقوب الدورقي، قالا حدثنا هشيم، عن سيار، عن الشعبي، عن جرير، قال بايعت النبي صلى الله عليه وسلم على السمع والطاعة فلقنني ‏\"‏ فيما استطعت ‏\"‏ ‏.‏ والنصح لكل مسلم ‏.‏ قال يعقوب في روايته قال حدثنا سيار ‏.‏",
      "text_en": " It is narrated on the authority of Jarir that he observed:                      I owed allegiance to the Apostle of Allah (may peace and blessings be upon him) on hearing ( is commands) and obeying (them) and the Prophet) instructed me (to act) as lay in my power, and sincerity and goodwill for every Muslim.",
      "chain": [
        "30251",
        "30400",
        "20468",
        "11429",
        "11052",
        "4057"
      ]
    },
    {
      "hadith_no": "288",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا يعقوب الدورقي، حدثنا هشيم، أخبرنا حصين، حدثنا أبو ظبيان، قال سمعت أسامة بن زيد بن حارثة، يحدث قال بعثنا رسول الله صلى الله عليه وسلم إلى الحرقة من جهينة فصبحنا القوم فهزمناهم ولحقت أنا ورجل من الأنصار رجلا منهم فلما غشيناه قال لا إله إلا الله ‏.‏ فكف عنه الأنصاري وطعنته برمحي حتى قتلته ‏.‏ قال فلما قدمنا بلغ ذلك النبي صلى الله عليه وسلم فقال لي ‏\"‏ يا أسامة أقتلته بعد ما قال لا إله إلا الله ‏\"‏ ‏.‏ قال قلت يا رسول الله إنما كان متعوذا ‏.‏ قال فقال ‏\"‏ أقتلته بعد ما قال لا إله إلا الله ‏\"‏ ‏.‏ قال فمازال يكررها على حتى تمنيت أني لم أكن أسلمت قبل ذلك اليوم ‏.‏",
      "text_en": " It is narrated on the authority of Usama b. Zaid:                      The Messenger of Allah may peace be upon him) sent us to Huraqat, a tribe of Juhaina. We attacked that tribe early in the morning and defeated them and I and a man from the Ansar caught hold of a person (of the defeated tribe). When we overcame him, he said: There is no god but Allah. At that moment the Ansari spared him, but I attacked him with my spear and killed him. The news had already reached the Apostle (peace be upon him), so when we came back he (the Apostle) said to me: Usama, did you kill him after he had made the profession: There is no god but Allah? I said. Messenger of Allah, he did it only as a shelter. The Holy Prophet observed: Did you kill him after he had made the profession that there is no god but Allah? He (the Holy Prophet) went on repeating this to me till I wished I had not embraced Islam before that day.",
      "chain": [
        "30400",
        "20468",
        "15097",
        "50"
      ]
    },
    {
      "hadith_no": "365",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنيه زهير بن حرب، ويعقوب الدورقي، قالا حدثنا إسماعيل، وهو ابن علية عن أيوب، عن محمد، قال قال أبو هريرة ‏\"‏ لا يزال الناس ‏\"‏ ‏.‏ بمثل حديث عبد الوارث غير أنه لم يذكر النبي صلى الله عليه وسلم في الإسناد ولكن قد قال في آخر الحديث صدق الله ورسوله ‏.‏",
      "text_en": " It is narrated on the authority of Abu Huraira that he said:                      The people will constantly, and the rest of the hadith is the same as that transmitted by 'Abdul-Warith with the exception that there is no mention of the Apostle of Allah in that, but he observed at the end of the hadith: Allah and His Messenger told the truth.",
      "chain": [
        "30400",
        "20208",
        "20208",
        "11015",
        "11035"
      ]
    },
    {
      "hadith_no": "508",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثني يعقوب بن إبراهيم الدورقي، حدثنا ابن أبي حازم، حدثني أبي، عن سهل بن سعد الساعدي، قال كان بين مصلى رسول الله صلى الله عليه وسلم وبين الجدار ممر الشاة ‏.‏",
      "text_en": " Sahl b. Sa'd al-Si'idi reported:                      Between the place of worship where the Messenger of Allah (may peace be upon him) prayed and the wall, there was a gap through which a goat could pass.",
      "chain": [
        "30400",
        "20165",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "1373",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني يعقوب بن إبراهيم الدورقي، حدثنا ابن علية، حدثنا الحجاج بن أبي عثمان، حدثني أبو الزبير، قال سمعت عبد الله بن الزبير، يخطب على هذا المنبر وهو يقول كان رسول الله صلى الله عليه وسلم يقول إذا سلم في دبر الصلاة أو الصلوات ‏.‏ فذكر بمثل حديث هشام بن عروة ‏.‏",
      "text_en": " Abu Zubair reported:                      I heard Abdullah b. Zubair addressing (people) on the pulpit and saying: When the Messenger of Allah (may peace be upon him) pronounced salutation at the end of the prayer or prayers, and then he made a mention of the hadith as transmitted by Hisham b. 'Urwa.",
      "chain": [
        "30400",
        "20208",
        "11263"
      ]
    },
    {
      "hadith_no": "1469",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني يعقوب بن إبراهيم الدورقي، حدثنا يحيى بن أبي بكير، حدثنا شيبان، عن عبد الملك بن عمير، عن ابن عمارة بن رؤيبة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يلج النار من صلى قبل طلوع الشمس وقبل غروبها ‏\"‏ ‏.‏ وعنده رجل من أهل البصرة فقال آنت سمعت هذا من النبي صلى الله عليه وسلم قال نعم أشهد به عليه ‏.‏ قال وأنا أشهد لقد سمعت النبي صلى الله عليه وسلم يقوله بالمكان الذي سمعته منه ‏.‏",
      "text_en": " Umara b. Ruwaiba reported on the authority of his father that the Messenger of Allah (may peace be upon him) said:                      He who said prayer before the rising of the sun and its setting would not enter the fire (of Hell), and there was a man from Basra (sitting) beside him who said: Did you hear it from the Apostle of Allah (way peace be upon him)? He said: Yes, I bear witness to it. The man from Basra said: I bear witness that I did hear from the Apostle of Allah (may peace be upon him) saying it from the place that you heard from him.",
      "chain": [
        "30400",
        "20365",
        "20240",
        "11368"
      ]
    },
    {
      "hadith_no": "2056",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، ويعقوب الدورقي، عن ابن علية، عن أيوب، عن عمرو، عن جابر، عن النبي صلى الله عليه وسلم كما قال حماد ولم يذكر الركعتين ‏.‏",
      "text_en": " This hadith is narrated by Jabir through another chain of transmitters but Hammad (one of the narrators) made no mention of the two rak'ahs.",
      "chain": [
        "30201",
        "30400",
        "20208",
        "11015",
        "11081",
        "34"
      ]
    },
    {
      "hadith_no": "2138",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Eclipse) - كتاب الكسوف",
      "chapter_no": "11",
      "text_ar": "وحدثني يعقوب بن إبراهيم الدورقي، حدثنا إسماعيل ابن علية، عن هشام الدستوائي، قال حدثنا أبو الزبير، عن جابر بن عبد الله، قال كسفت الشمس على عهد رسول الله صلى الله عليه وسلم في يوم شديد الحر فصلى رسول الله صلى الله عليه وسلم بأصحابه فأطال القيام حتى جعلوا يخرون ثم ركع فأطال ثم رفع فأطال ثم ركع فأطال ثم رفع فأطال ثم سجد سجدتين ثم قام فصنع نحوا من ذاك فكانت أربع ركعات وأربع سجدات ثم قال ‏\"‏ إنه عرض على كل شىء تولجونه فعرضت على الجنة حتى لو تناولت منها قطفا أخذته - أو قال تناولت منها قطفا - فقصرت يدي عنه وعرضت على النار فرأيت فيها امرأة من بني إسرائيل تعذب في هرة لها ربطتها فلم تطعمها ولم تدعها تأكل من خشاش الأرض ورأيت أبا ثمامة عمرو بن مالك يجر قصبه في النار ‏.‏ وإنهم كانوا يقولون إن الشمس والقمر لا يخسفان إلا لموت عظيم وإنهما آيتان من آيات الله يريكموهما فإذا خسفا فصلوا حتى تنجلي ‏\"‏ ‏.‏  وحدثنيه أبو غسان المسمعي، حدثنا عبد الملك بن الصباح، عن هشام، بهذا الإسناد مثله إلا أنه قال ‏\"‏ ورأيت في النار امرأة حميرية سوداء طويلة ‏\"‏ ‏.‏ ولم يقل ‏\"‏ من بني إسرائيل ‏\"‏ ‏.",
      "text_en": " Jabir b. 'Abdullah reported:                      The sun eclipsed on one extremely hot day during the lifetime of the Messenger of Allah (may peace be upon him). The Messenger of Allah (may peace be upon him) prayed along with his Companions. He prolonged his qiyam (standing posture in prayer) till they (his Companions) began to fall down. He then observed a long ruku'. He raised his head (and stood up for long) and then observed a long ruku'. He then raised (his head and stood up) for a long time and then made two prostrations. He then stood up and did like this and thus he observed four ruku's and four prostrations (in two rak'ahs) and then said: All these things were brought to me in which you will be made to enter. Paradise was brought to me till (I was so close to it) that if I (had intended) to pluck a bunch (of grapes) out of it. I would have got it, or he (the Holy Prophet) said: I intended to get a bunch (out of that) but my hand could not reach it. Hell was also brought to me and I saw in it a woman belonging to the tribe of Israel who was tormented for a cat whom she had tied, but did not give it food nor set it free to eat the creatures of the earth; and I saw Abu Thumama 'Amr b. Malik who was dragging his intestines in Hell. They (the Arabs) used to say that the sun and the moon do not eclipse but on the death of some great person; but (in reality) both these (the sun and the moon) are among the signs of Allah which are shown to you; so when there is an eclipse, observe prayer till it (the sun or the moon) brightens. This hadith has been narrated by Hisham with the same chain of transmitters except this\" I saw a dark woman with a tail stature and loud voice,\" but he made no mention of\" from among Bani Israel\".",
      "chain": [
        "30400",
        "20208",
        "20295",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "2361",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثني يعقوب بن إبراهيم الدورقي، حدثنا إسماعيل، - يعني ابن علية - عن أيوب، عن أبي الزبير، عن جابر، أن رجلا، من الأنصار - يقال له أبو مذكور - أعتق غلاما له عن دبر يقال له يعقوب وساق الحديث بمعنى حديث الليث ‏.‏",
      "text_en": " Jabir reported that a person among the Ansar who was called Abu Madhkur granted posthumous freedom to his slave who was called Ya'qub. The rest of the hadith is the same.",
      "chain": [
        "30400",
        "20208",
        "11015",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "2898",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني أحمد بن منيع، ويعقوب الدورقي، قالا حدثنا هشيم، أخبرنا منصور، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، - رضى الله عنها - قالت كنت أطيب النبي صلى الله عليه وسلم قبل أن يحرم ويوم النحر قبل أن يطوف بالبيت بطيب فيه مسك ‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her) reported:                      I used to perfume the Apostle of Allah (may peace be upon him) with a perfume containing musk before entering upon the state of Ihram and on the day of sacrifice (10th of Dhu'l-Hijja) and (at the conclusion of Ihram) before circumambulating the House (for Tawaf-i-Ifada).",
      "chain": [
        "30242",
        "30400",
        "20468",
        "11067",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "3156",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني محمد بن حاتم، وهارون بن عبد الله، ويعقوب الدورقي، قالوا أخبرنا يزيد بن هارون، أخبرنا عبد العزيز بن أبي سلمة، عن عمر بن حسين، عن عبد الله بن، أبي سلمة عن عبد الله بن عبد الله بن عمر، عن أبيه، قال كنا مع رسول الله صلى الله عليه وسلم في غداة عرفة فمنا المكبر ومنا المهلل فأما نحن فنكبر قال قلت والله لعجبا منكم كيف لم تقولوا له ماذا رأيت رسول الله صلى الله عليه وسلم يصنع.",
      "text_en": " Abdullah b. 'Umar reported on the authority of his father (Allah be pleased with them):                      We were along with Allah's Messenger (way peace he upon him) in the morning of 'Arafa (9th of Dhu'l-Hijja). Some of us pronounced Takbir and some of us Tahlil La ilaha ill-Allah). And to those of us who pronounced Takbir, I said: By Allah, how strange it is that you did not care to ask him: What did you see Allah's Messenger (may peace be upon him) doing (on this occasion)?",
      "chain": [
        "38487",
        "30524",
        "30400",
        "20472",
        "32017",
        "10929",
        "11814",
        "18"
      ]
    },
    {
      "hadith_no": "3193",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني يعقوب الدورقي، حدثنا ابن أبي زائدة، ح وحدثنا ابن أبي عمر، حدثنا سفيان، كلاهما عن الأعمش، قال سمعت الحجاج، يقول لا تقولوا سورة البقرة ‏.‏ واقتصا الحديث بمثل حديث ابن مسهر ‏.‏",
      "text_en": " A'mash reported:                      I heard Hajjaj saying I Do not say Surah al-Baqara. The rest of the hadith is the same.",
      "chain": [
        "30400",
        "20366",
        "30421",
        "11060",
        "20381"
      ]
    },
    {
      "hadith_no": "3262",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا علي بن حجر السعدي، ويعقوب بن إبراهيم الدورقي، قال ابن حجر حدثنا إسماعيل بن إبراهيم، عن أيوب، عن القاسم، وأبي، قلابة عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يبعث بالهدى أفتل قلائدها بيدى ثم لا يمسك عن شىء لا يمسك عنه الحلال ‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her) reported:                      Allah's Messenger (may peace be upon him) sent the sacrificial animals and I wove garlands for them with my own 'hands, and he did not refrain from doing anything which he did not avoid in the state of non-Muhrim.",
      "chain": [
        "20387",
        "30400",
        "20208",
        "11015",
        "10535",
        "11047",
        "53"
      ]
    },
    {
      "hadith_no": "3737",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "وحدثني يعقوب بن إبراهيم الدورقي، عن ابن علية، عن يونس، عن محمد بن، سيرين عن يونس بن جبير، قال قلت لابن عمر رجل طلق امرأته وهى حائض فقال أتعرف عبد الله بن عمر فإنه طلق امرأته وهى حائض فأتى عمر النبي صلى الله عليه وسلم فسأله فأمره أن يرجعها ثم تستقبل عدتها ‏.‏ قال فقلت له إذا طلق الرجل امرأته وهى حائض أتعتد بتلك التطليقة فقال فمه أوإن عجز واستحمق.",
      "text_en": " Yunus b. Jubair reported:                      I said to Ibn'Umar (Allah be pleased with them): A person divorcedhis wife while she was in the state of menses, whereupon he said: Do you know 'Abdullah b. Umar (Allah be pleased with them), for he divorced his wife in the state of menses. 'Umar (Allah be pleased with him) came to Allah's Apostle (may peace be upon him) and asked him, and he (the Holy Prophet) commanded him that he should take her back, and she started her 'Idda. I said to him: When a person divorces his wife, and she is in the state of menses, should that pronouncement of divorce be counted? He said: Why not, was he hopless or foolish?",
      "chain": [
        "30400",
        "20208",
        "20475",
        "11035",
        "11320"
      ]
    },
    {
      "hadith_no": "5136",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثنيه أبو الطاهر، أخبرنا ابن وهب، ح وحدثني يعقوب الدورقي، وأحمد بن، عثمان النوفلي قالا حدثنا أبو عاصم، كلاهما عن ابن جريج، بهذا الإسناد ‏.‏",
      "text_en": "",
      "chain": [
        "20029",
        "30400",
        "30185"
      ]
    },
    {
      "hadith_no": "5474",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثني يعقوب بن إبراهيم الدورقي، حدثنا إسماعيل، - يعني ابن علية - عن  المثنى بن سعيد، حدثني طلحة بن نافع، أنه سمع جابر بن عبد الله، يقول أخذ رسول الله صلى الله عليه وسلم بيدي ذات يوم إلى منزله فأخرج إليه فلقا من خبز فقال ‏\"‏ ما من أدم ‏\"‏ ‏.‏ فقالوا لا إلا شىء من خل ‏.‏ قال ‏\"‏ فإن الخل نعم الأدم ‏\"‏ ‏.‏ قال جابر فما زلت أحب الخل منذ سمعتها من نبي الله صلى الله عليه وسلم ‏.‏ وقال طلحة ما زلت أحب الخل منذ سمعتها من جابر ‏.‏",
      "text_en": " Jabir b. 'Abdullah reported:                      Allah's Messenger (may peace be upon him) took hold of my hand one day (and led me) to his residence. There was presented to him some pieces of bread, whereupon he said: Is there no condiment? They (the members of his household) said: No, except some vinegar. He (the Holy Prophet) said: Vinegar is a good condiment. Jabir said: I have always loved vinegar since I heard it trom Allah's Apostle (may peace be upon him). Talha said: I have always loved vinegar since I heard about it from Jabir.",
      "chain": [
        "30400",
        "20208",
        "34"
      ]
    },
    {
      "hadith_no": "6604",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثني زهير بن حرب، ويعقوب الدورقي، قالا حدثنا إسماعيل، - يعنيان ابن علية - حدثنا أيوب، عن محمد، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لأسلم وغفار وشىء من مزينة وجهينة أو شىء من جهينة ومزينة خير عند الله - قال أحسبه قال - يوم القيامة من أسد وغطفان وهوازن وتميم ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      Aslam, Ghifar or some people from Muzaina, Juhaina (with the variation of words) are better in the eye of Allah than Asad, Ghatfan, Hawizin and Tamim. The narrator said: I think he also said:\" On the Day of Resurrection.\"",
      "chain": [
        "30022",
        "30400",
        "11015",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "7449",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "وحدثني يعقوب بن إبراهيم الدورقي، وحجاج بن الشاعر، جميعا عن أبي عاصم، - قال حجاج حدثنا أبو عاصم، - أخبرنا عزرة بن ثابت، أخبرنا علباء بن أحمر، حدثني  أبو زيد، - يعني عمرو بن أخطب - قال صلى بنا رسول الله صلى الله عليه وسلم الفجر وصعد المنبر فخطبنا حتى حضرت الظهر فنزل فصلى ثم صعد المنبر فخطبنا حتى حضرت العصر ثم نزل فصلى ثم صعد المنبر فخطبنا حتى غربت الشمس فأخبرنا بما كان وبما هو كائن فأعلمنا أحفظنا ‏.‏",
      "text_en": " Abu Zaid (viz. Amr b. Akhtab) reported:                      Allah's Messenger (may peace be upon him) led us in the dawn prayer and then mounted the pulpit and addressed us until it was (time for the) noon prayer. He then came down the pulpit and observed prayer and then again mounted the pulpit and again addressed us until it was time for the 'Asr prayer. He then again came down and observed the prayer and again mointed the pulpit and addressed us until the sun was set and he informed (about) everything (pertaining to turmoil) that lay hidden in the past and what lies in (the womb) of) the future and the most learned amongst us is one who remembers them well",
      "chain": [
        "30400",
        "38834",
        "20241",
        "20219",
        "20241",
        "20561",
        "10705"
      ]
    },
    {
      "hadith_no": "2302",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا يعقوب بن إبراهيم الدورقي، حدثنا يحيى بن أبي بكير، حدثنا إبراهيم بن طهمان، حدثني هشام بن حسان، ح وحدثنا عبد الله بن الجراح القهستاني، عن عبد الله، - يعني ابن بكر - السهمي عن هشام، - وهذا لفظ ابن الجراح - عن حفصة، عن أم عطية، أن النبي صلى الله عليه وسلم قال ‏\"‏ لا تحد المرأة فوق ثلاث إلا على زوج فإنها تحد عليه أربعة أشهر وعشرا لا تلبس ثوبا مصبوغا إلا ثوب عصب ولا تكتحل ولا تمس طيبا إلا أدنى طهرتها إذا طهرت من محيضها بنبذة من قسط أو أظفار ‏\"‏ ‏.‏ قال يعقوب مكان عصب ‏\"‏ إلا مغسولا ‏\"‏ ‏.‏ وزاد يعقوب ‏\"‏ ولا تختضب ‏\"‏ ‏.‏",
      "text_en": " ‘Umm Athiyah reported the Prophet(ﷺ) as saying “A woman must not observe mourning for more than three (days) except for four months and ten days in the case of a husband  and she must not wear a dyed garment except one of the types made of dyed yarn or apply collyrium or touch perfume except for a little costus or azfar when she has been purified after her menstrual courses.The narrator Ya’qub mentioned the words “except washed clothes” instead of the words “one of the types made of dyed yarn”. Ya’qub also added “She must not apply Henna”",
      "chain": [
        "30400",
        "20365",
        "20187",
        "11311",
        "38293",
        "20244",
        "11065",
        "54",
        "71"
      ]
    },
    {
      "hadith_no": "289",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا يعقوب بن إبراهيم الدورقي، حدثنا عبيد الله الأشجعي، عن سفيان الثوري، عن أبي إسحاق، عن الأسود بن يزيد، عن عبد الله بن مسعود، قال علمنا رسول الله صلى الله عليه وسلم إذا قعدنا في الركعتين أن نقول التحيات لله والصلوات والطيبات السلام عليك أيها النبي ورحمة الله وبركاته السلام علينا وعلى عباد الله الصالحين أشهد أن لا إله إلا الله وأشهد أن محمدا عبده ورسوله ‏.‏ قال وفي الباب عن ابن عمر وجابر وأبي موسى وعائشة ‏.‏ قال أبو عيسى حديث ابن مسعود قد روي عنه من غير وجه ‏.‏ وهو أصح حديث روي عن النبي صلى الله عليه وسلم في التشهد ‏.‏ والعمل عليه عند أكثر أهل العلم من أصحاب النبي صلى الله عليه وسلم ومن بعدهم من التابعين ‏.‏ وهو قول سفيان الثوري وابن المبارك وأحمد وإسحاق ‏.‏ حدثنا أحمد بن محمد بن موسى أخبرنا عبد الله بن المبارك عن معمر عن خصيف قال رأيت النبي صلى الله عليه وسلم في المنام فقلت يا رسول الله إن الناس قد اختلفوا في التشهد فقال ‏\"‏ عليك بتشهد ابن مسعود ‏\"‏ ‏.‏",
      "text_en": " Abdullah bin Mas'ud narrated:                     \"Allah's Messenger taught us, that when we sit for every two Rak'ah we should say: (At-Tahyyatulillah, was-salawatu wattayybaat. As-salamu alaika ayyuhannabiyyu wa rahmatullahi wa barakatuhu, as-salamu alaina wa ala ibadillahis-salihin. Ashhadu an la ilaha illallah wa ashadu anna Muhammadan abduhu wa Rasuluh.) 'All greetings, prayers, and pure words are Allah. Peace be upon you O Prophet, and Allah's mercy and His blessings. Peace be upon us and all of the righteous worshippers of Allah. I testify that nne has the right to be worshipped but Allah, and I testify that Muhammad is Allah's servant and Messenger.'\"",
      "chain": [
        "30400",
        "20338",
        "20012",
        "11049",
        "11054",
        "16"
      ]
    },
    {
      "hadith_no": "1212",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا يعقوب بن إبراهيم الدورقي، حدثنا هشيم، حدثنا يعلى بن عطاء، عن عمارة بن حديد، عن صخر الغامدي، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ اللهم بارك لأمتي في بكورها ‏\"‏ ‏.‏ قال وكان إذا بعث سرية أو جيشا بعثهم أول النهار وكان صخر رجلا تاجرا وكان إذا بعث تجارة بعثهم أول النهار فأثرى وكثر ماله ‏.‏ قال وفي الباب عن علي وابن مسعود وبريدة وأنس وابن عمر وابن عباس وجابر ‏.‏ قال أبو عيسى حديث صخر الغامدي حديث حسن ‏.‏ ولا نعرف لصخر الغامدي عن النبي صلى الله عليه وسلم غير هذا الحديث ‏.‏ وقد روى سفيان الثوري عن شعبة عن يعلى بن عطاء هذا الحديث ‏.‏",
      "text_en": " Narrated 'Umarah bin Hadid:                     From Shakr Al-Ghamidi that the Messenger of Allah (ﷺ) said: \"O Allah bless my Ummah in what they do early (in the day).\" He said: \"Whenever he (ﷺ) would dispatch a military expedition or an army, he would send them in the first part of the day.\"And Sakhr, a man who was a merchant, used to send his goods for trade during the beginning of the day, so he became rich, and his wealth increased.[He said:] There are narrations on this topic from 'Ali, Buraidah, Ibn Mas'ud, Anas, Ibn 'Umar, Ibn 'Abbas, and Jabir.[Abu 'Eisa said:] The Hadith is Sakhr Al-Ghamidi is a Hasan Hadith. We do not know of a narration that Sakhr Al-Ghamidi reported from the Prophet (ﷺ) other than this Hadith. Sufyan Ath-Thawri reported this Hadith from Shu'bah, from Ya'la bin 'Ata.",
      "chain": [
        "30400",
        "20468",
        "10986",
        "19930"
      ]
    },
    {
      "hadith_no": "1343",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Chapters On Judgements From The Messenger of Allah - كتاب الأحكام عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "15",
      "text_ar": "حدثنا يعقوب بن إبراهيم الدورقي، حدثنا عبد العزيز بن محمد، قال حدثني ربيعة بن أبي عبد الرحمن، عن سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، قال قضى رسول الله صلى الله عليه وسلم باليمين مع الشاهد الواحد ‏.‏ قال ربيعة وأخبرني ابن لسعد بن عبادة قال وجدنا في كتاب سعد أن النبي صلى الله عليه وسلم قضى باليمين مع الشاهد ‏.‏ قال وفي الباب عن علي وجابر وابن عباس وسرق ‏.‏ قال أبو عيسى حديث أبي هريرة أن النبي صلى الله عليه وسلم قضى باليمين مع الشاهد الواحد حديث حسن غريب ‏.‏",
      "text_en": " Abu Hurairah narrated:                      \"The Messenger of Allah (ﷺ) passed judgement based on an oath along with one witness.\" Rabi'ah (one of the narrators) said: \"A son of Ibn Sa'd bin 'Ubadah informed me saying: 'We found in a book of Sa'd that the Prophet (ﷺ) passed judgement based on an oath along with a witness.'\"",
      "chain": [
        "30400",
        "20167",
        "11162",
        "11173",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "3072",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا يعقوب بن إبراهيم الدورقي، وأبو بكر محمد بن بشار وغير واحد قالوا حدثنا يحيى بن سعيد القطان، عن عبيد الله بن عمر، عن نافع، عن ابن عمر، أن النبي صلى الله عليه وسلم غير اسم عاصية وقال ‏\"‏ أنت جميلة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ وإنما أسنده يحيى بن سعيد القطان عن عبيد الله عن نافع عن ابن عمر وروى بعضهم هذا عن عبيد الله عن نافع أن عمر ‏.‏ وفي الباب عن عبد الرحمن بن عوف وعبد الله بن سلام وعبد الله بن مطيع وعائشة والحكم بن سعد ومسلم وأسامة بن أخدري وشريح بن هانئ عن أبيه وخيثمة بن عبد الرحمن عن أبيه ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     that the Prophet (ﷺ) changed the name of 'Asiyah, he said: \"You are Jamilah.\"",
      "chain": [
        "30400",
        "20031",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3424",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا يعقوب بن إبراهيم الدورقي، حدثنا أبو تميلة، عن الزبير بن جنادة، عن ابن بريدة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لما انتهينا إلى بيت المقدس قال جبريل بإصبعه فخرق به الحجر وشد به البراق ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Narrated Ibn Buraidah:                     from his father that the Messenger of Allah (ﷺ) said: \"When we reached Bait Al-Maqdis, Jibra'il pointed with his finger causing a crack in the rock, and he tied Al-Buraq to it.\"",
      "chain": [
        "30400",
        "20183",
        "11432",
        "3131"
      ]
    },
    {
      "hadith_no": "4011",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا أحمد بن منيع، ويعقوب بن إبراهيم الدورقي، قالا حدثنا إسماعيل ابن علية، عن خالد الحذاء، حدثني عمار، مولى بني هاشم قال سمعت ابن عباس، يقول توفي رسول الله صلى الله عليه وسلم وهو ابن خمس وستين ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     \"The Prophet (ﷺ) died when he was sixty-five years old.\"",
      "chain": [
        "30242",
        "30400",
        "20208",
        "11282",
        "17"
      ]
    },
    {
      "hadith_no": "4028",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا يعقوب بن إبراهيم الدورقي، حدثنا سفيان بن عيينة، قال ذكر داود عن الشعبي، عن الحارث، عن علي، عن النبي صلى الله عليه وسلم قال ‏\"‏ أبو بكر وعمر سيدا كهول أهل الجنة من الأولين والآخرين ما خلا النبيين والمرسلين لا تخبرهما يا علي ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Ali:                     that the Prophet (ﷺ) said: \"Abu Bakr and 'Umar are the masters of the elder people among the inhabitants of Paradise, from the first ones and the last ones, not including the Prophets and the Messengers. Do not inform them O 'Ali.\"",
      "chain": [
        "30400",
        "20005",
        "11052",
        "5"
      ]
    },
    {
      "hadith_no": "1011",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا أحمد بن منيع، ويعقوب بن إبراهيم الدورقي، قالا حدثنا هشيم، قال حدثنا أبو بشر، جعفر بن أبي وحشية - وهو ابن إياس - عن سعيد بن جبير، عن ابن عباس، في قوله عز وجل ‏{‏ ولا تجهر بصلاتك ولا تخافت بها ‏}‏ قال نزلت ورسول الله صلى الله عليه وسلم مختف بمكة فكان إذا صلى بأصحابه رفع صوته - وقال ابن منيع يجهر بالقرآن - وكان المشركون إذا سمعوا صوته سبوا القرآن ومن أنزله ومن جاء به فقال الله عز وجل لنبيه صلى الله عليه وسلم ‏{‏ ولا تجهر بصلاتك ‏}‏ أى بقراءتك فيسمع المشركون فيسبوا القرآن ‏{‏ ولا تخافت بها ‏}‏ عن أصحابك فلا يسمعوا ‏{‏ وابتغ بين ذلك سبيلا ‏}‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     Concerning the saying of Allah, the Mighty and Sublime: \"And offer your salah (prayer) neither aloud nor in a low voice\"- It was revealed when the Messenger of Allah (ﷺ) was still (preaching) in secret in Makkah. When he led his companions in prayer, he would raise his voice\" -(One of the narrators) Ibn Mani' said: He would recite the Quran out loud\"- \"And when the idolators heard his voice they would insult the Quran, and the One Who revealed it, and the one who brought it. So Allah, the Mighty and Sublime, said to His Prophet (ﷺ): And offer your salah (prayer) neither aloud that is, such that the idolators can hear your recitation and insult the Quran; nor in a low voice, so that your companions cannot hear; but follow a way between.\"",
      "chain": [
        "30242",
        "30400",
        "20468",
        "11050"
      ]
    },
    {
      "hadith_no": "1013",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا يعقوب بن إبراهيم الدورقي، عن وكيع، قال حدثنا مسعر، عن أبي العلاء، عن يحيى بن جعدة، عن أم هانئ، قالت كنت أسمع قراءة النبي صلى الله عليه وسلم وأنا على عريشي ‏.‏",
      "text_en": " Umm Hani said:                     \"I used to listen to the Prophet (ﷺ) reciting Quran when I was on my roof.\"",
      "chain": [
        "30400",
        "20032",
        "20359",
        "198"
      ]
    },
    {
      "hadith_no": "1162",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا يعقوب بن إبراهيم الدورقي، عن الأشجعي، عن سفيان، عن أبي إسحاق، عن الأسود، عن عبد الله، قال علمنا رسول الله صلى الله عليه وسلم أن نقول إذا جلسنا في الركعتين ‏\"‏ التحيات لله والصلوات والطيبات السلام عليك أيها النبي ورحمة الله وبركاته السلام علينا وعلى عباد الله الصالحين أشهد أن لا إله إلا الله وأشهد أن محمدا عبده ورسوله ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah said:                     \"The Messenger of Allah (ﷺ) taught us to say when we sat following two rak'ahs: 'At-tahiyyatu lillahi was-salawatu wat-tayyibat, as-salamu 'alaika ayyuhan-Nabiyyu wa rahmatAllahi wa baraktuhu. As-salamu 'alaina wa 'ala 'ibad illahis-salihin, ashahdu an la illaha ill-Allah wa ashhadu anna Muhammadan 'abduhu wa rasuluhu (Allah compliments, prayers and pure words are due to Allah. Peace be upon you, O Prophet, and the mercy of Allah (SWT) and his blessings. Peace be upon us and upon the righteous slaves of Allah (SWT). I bear witness that none has the right to be worshipped except Allah and I bear witness that Muhammad is His slave and Messenger).'\"",
      "chain": [
        "30400",
        "20338",
        "20012",
        "11049",
        "11054",
        "16"
      ]
    },
    {
      "hadith_no": "1181",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا يعقوب بن إبراهيم الدورقي، ومحمد بن بشار، - واللفظ له - قالا حدثنا يحيى بن سعيد، قال حدثنا عبد الحميد بن جعفر، قال حدثني محمد بن عمرو بن عطاء، عن أبي حميد الساعدي، قال سمعته يحدث، قال كان النبي صلى الله عليه وسلم إذا قام من السجدتين كبر ورفع يديه حتى يحاذي بهما منكبيه كما صنع حين افتتح الصلاة ‏.‏",
      "text_en": " It was narrated from Abu Humaid As-Sa'idi that:                     When the Prophet (ﷺ) stood up following two prostrations, he would say the takbir and raise his hands until they were level with his shoulders, as he had done at the beginning of the prayer.",
      "chain": [
        "30400",
        "30160",
        "20031",
        "11875",
        "11220",
        "1457"
      ]
    },
    {
      "hadith_no": "1262",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا يعقوب بن إبراهيم الدورقي، ومحمد بن بشار، بندار - واللفظ له - قالا حدثنا يحيى بن سعيد، قال حدثنا عبد الحميد بن جعفر، قال حدثني محمد بن عمرو بن عطاء، عن أبي حميد الساعدي، قال كان النبي صلى الله عليه وسلم إذا كان في الركعتين اللتين تنقضي فيهما الصلاة أخر رجله اليسرى وقعد على شقه متوركا ثم سلم ‏.‏",
      "text_en": " It was narrated that Abu Humaid As-Sa'idi said:                     \"At the end of the last two rak'ahs of the prayer, the Prophet (ﷺ) would move his left foot forward and sit on his left buttock, Mutawarrikan, then he would say the taslim.",
      "chain": [
        "30400",
        "30160",
        "20031",
        "11875",
        "11220",
        "1457"
      ]
    },
    {
      "hadith_no": "1298",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا يعقوب بن إبراهيم الدورقي، وعمرو بن علي، - واللفظ له - قالا حدثنا يحيى، قال حدثنا سليمان الأعمش، قال حدثني شقيق، عن عبد الله، قال كنا إذا جلسنا مع رسول الله صلى الله عليه وسلم في الصلاة قلنا السلام على الله من عباده السلام على فلان وفلان ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تقولوا السلام على الله فإن الله هو السلام ولكن إذا جلس أحدكم فليقل التحيات لله والصلوات والطيبات السلام عليك أيها النبي ورحمة الله وبركاته السلام علينا وعلى عباد الله الصالحين فإنكم إذا قلتم ذلك أصابت كل عبد صالح في السماء والأرض أشهد أن لا إله إلا الله وأشهد أن محمدا عبده ورسوله ثم ليتخير من الدعاء بعد أعجبه إليه يدعو به ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah said:                     \"When we sat during the prayer with the Messenger of Allah (ﷺ), we used to say: 'Peace (salam) be upon Allah(SWT), peace be upon so-and-so and so-and-so.' The Messenger of Allah (ﷺ) said: 'Do not say peace (salam) be upon Allah (SWT), for Allah (SWT) is As-Salam (the Source of peace; the One free from all faults). Rather say: At-tahiyyatu lillahi wasalawatu wat-tayibaat, as-salamu 'alaika ayah-Nabiyyu wa rahmatAllahi wa baraktuhu. As-salamu 'alaina a 'ala ibad illahis-salihin (All compliments, prayers and pure words are due to Allah. Peace be upon you O Prophet, and the mercy of Allah and His blessings. Peace be upon us and upon the righteous slaves of Allah.) If you say that, it will be for every righteous slave in the heavens and on earth, \"ashadu an la ilaha ill Allah, wa ashhadu anna Muhammadan 'abduhu wa rasuluhu (I bear witness that that none has the right to be worshipped except Allah, and I bear witness that Muhammad is His slave and messenger.) Then let him choose any supplication that he likes to say after that.'\"",
      "chain": [
        "30400",
        "30153",
        "20031",
        "11060",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "2644",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا يعقوب بن إبراهيم الدورقي، قال حدثنا عبد الرحمن، عن سفيان، عن منصور، عن مجاهد، عن يوسف، عن ابن الزبير، أن النبي صلى الله عليه وسلم قال لرجل ‏\"‏ أنت أكبر ولد أبيك فحج عنه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn Az-Zubair that the Prophet said to a man:                     \"You are the oldest son of your father, so perform Hajj on his behalf.\"",
      "chain": [
        "30400",
        "20033",
        "20012",
        "11067",
        "11028",
        "106"
      ]
    },
    {
      "hadith_no": "2657",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا يعقوب بن إبراهيم الدورقي، عن محمد بن جعفر، قال حدثنا معمر، قال أخبرني عبد الله بن طاوس، عن أبيه، عن ابن عباس، قال وقت رسول الله صلى الله عليه وسلم لأهل المدينة ذا الحليفة ولأهل الشام الجحفة ولأهل نجد قرنا ولأهل اليمن يلملم قال ‏\"‏ هن لهم ولمن أتى عليهن ممن سواهن لمن أراد الحج والعمرة ومن كان دون ذلك من حيث بدأ حتى يبلغ ذلك أهل مكة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                      \"The Messenger of 'Allah designated Dhul-Hulaifah as the Miqat for the people of Al-Madinah, Al-Juhfah for the people of Ash-sham, Qarn for the people of Najd, and Yalamalam for the people of Yemen. He aid: \"They are for them and for those who pass by them who are not of their people who intend to perform Hajj and 'Umrah. If a person's place of residence is within the boundary of the Miqat, then (he should enter into Ihram) from where he starts his journey, and this also applies to the people of Makkah.''",
      "chain": [
        "30400",
        "20173",
        "20115",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "2999",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا يعقوب بن إبراهيم الدورقي، قال حدثنا هشيم، قال حدثنا يحيى، عن عبد الله بن أبي سلمة، عن ابن عمر، قال غدونا مع رسول الله صلى الله عليه وسلم إلى عرفات فمنا الملبي ومنا المكبر ‏.‏",
      "text_en": " It was narrated that Ibn Umar said:                     \"We left for Arafat with the Messenger of Allah, and some of us were reciting the Talbiyah and some reciting the Takbir.\"",
      "chain": [
        "30400",
        "20468",
        "20031",
        "10929",
        "18"
      ]
    },
    {
      "hadith_no": "3057",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا يعقوب بن إبراهيم الدورقي، قال حدثنا ابن علية، قال حدثنا عوف، قال حدثنا زياد بن حصين، عن أبي العالية، قال قال ابن عباس قال لي رسول الله صلى الله عليه وسلم غداة العقبة وهو على راحلته ‏\"‏ هات القط لي ‏\"‏ ‏.‏ فلقطت له حصيات هن حصى الخذف فلما وضعتهن في يده قال بأمثال هؤلاء ‏\"‏ وإياكم والغلو في الدين فإنما أهلك من كان قبلكم الغلو في الدين ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Al-Aliyah said:                     \"Ibn Abbas said: \"On the morning of Al-Aqabah, while he was on his mount, the Messenger of Allah said to me: \"Pick up (some pebbles) for me.\" So I picked up some pebbles for him that were the size of date stones or fingertips, and when I placed them in his hand he said: \"Like these. And beware of going to extremes in religious matters, for those who came before you were destroyed because of going to extremes in religious matters.\"",
      "chain": [
        "30400",
        "20208",
        "11298",
        "11618",
        "17"
      ]
    },
    {
      "hadith_no": "4259",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of al-Fara' and al-'Atirah - كتاب الفرع والعتيرة",
      "chapter_no": "41",
      "text_ar": "أخبرنا يعقوب بن إبراهيم الدورقي، ومحمد بن يحيى بن عبد الله النيسابوري، عن عبد الرحمن، عن مالك، عن الزهري، عن عبيد الله بن عبد الله، عن ابن عباس، عن ميمونة، أن النبي صلى الله عليه وسلم سئل عن فأرة وقعت في سمن جامد فقال ‏\"‏ خذوها وما حولها فألقوه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn' Abbas, from Maimunah, that:                     the Prophet was asked about a mouse that had fallen into some solid cooking fat. He said. \"Take it, and whatever is around it, and throw it away.\"",
      "chain": [
        "30400",
        "11222",
        "11055",
        "20001",
        "11013",
        "11004",
        "17",
        "61"
      ]
    },
    {
      "hadith_no": "1219",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا يعقوب بن إبراهيم الدورقي، حدثنا هشيم، عن خالد الحذاء، عن عبد الله بن شقيق، عن عائشة، قالت كان النبي  صلى الله عليه وسلم  يصلي المغرب ثم يرجع إلى بيتي فيصلي ركعتين ‏.‏",
      "text_en": " It wasnarrated that ‘Aishah said:                      “The Prophet (ﷺ) used to praytheMaghrib, then he would come back to my house and pray two Rak’ah.”",
      "chain": [
        "30400",
        "20468",
        "11282",
        "10694",
        "53"
      ]
    },
    {
      "hadith_no": "2512",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Charity - كتاب الصدقات",
      "chapter_no": "15",
      "text_ar": "حدثنا يعقوب بن إبراهيم الدورقي، حدثنا إسماعيل بن إبراهيم، عن عبد الرحمن بن إسحاق، عن عبد الرحمن بن معاوية، عن حنظلة بن قيس، عن أبي اليسر، صاحب النبي صلى الله عليه وسلم قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أحب أن يظله الله في ظله - فلينظر معسرا أو ليضع له ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Yasar, the Companion of the Prophet (ﷺ) that :                     the Messenger of Allah (ﷺ) said: “Whoever would like Allah to shade him with His shade, let him give respite to one in difficulty, or waive repayment of the loan.”",
      "chain": [
        "30400",
        "20208",
        "11876",
        "11503"
      ]
    },
    {
      "hadith_no": "2555",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Pawning - كتاب الرهون",
      "chapter_no": "16",
      "text_ar": "حدثنا يعقوب بن إبراهيم الدورقي، حدثنا إسماعيل ابن علية، حدثنا عبد الرحمن بن إسحاق، حدثني أبو عبيدة بن محمد بن عمار بن ياسر، عن الوليد بن أبي الوليد، عن عروة بن الزبير، قال قال زيد بن ثابت يغفر الله لرافع بن خديج أنا والله، أعلم بالحديث منه إنما أتى رجلان النبي صلى الله عليه وسلم وقد اقتتلا فقال ‏\"‏ إن كان هذا شأنكم فلا تكروا المزارع ‏\"‏ ‏.‏ قال فسمع رافع بن خديج قوله ‏\"‏ فلا تكروا المزارع ‏\"‏ ‏.‏",
      "text_en": " Zaid bin Thabit said:                     “May Allah (SWT) forgive Rafi' bin Khadij. By Allah (SWT)! I have more knowledge of Ahadith than  he does. Two men who had quarreled came to the Prophet (ﷺ) and he said: 'If this is your situation, do not lease farms,' and what Rafi' bin khadij heard was 'Do not lease farms.'  ”",
      "chain": [
        "30400",
        "20208",
        "11876",
        "19954",
        "10623",
        "10511"
      ]
    },
    {
      "hadith_no": "2783",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا يعقوب بن إبراهيم الدورقي، حدثنا هشيم، عن مغيرة، عن شباك، عن إبراهيم، عن علقمة، قال قال عبد الله قال رسول الله صلى الله عليه وسلم ‏\"‏ إن من أعف الناس قتلة أهل الإيمان ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah said that the Messenger of Allah (ﷺ) said:                     “The most decent of the people in killing are the people of faith.”",
      "chain": [
        "30400",
        "20468",
        "11072",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "2997",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا يعقوب بن إبراهيم الدورقي، حدثنا يزيد بن هارون، أنبأنا سفيان بن حسين، عن الزهري، عن أبي سنان، عن ابن عباس، أن الأقرع بن حابس، سأل النبي صلى الله عليه وسلم فقال يا رسول الله الحج في كل سنة أو مرة واحدة قال ‏\"‏ بل مرة واحدة فمن استطاع فتطوع ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Abbas that Aqra’ bin Habis asked theProphet(ﷺ):                      “O Messenger of Allah, is Hajj (required) every year,orjust once” He said: “Rather it is just once. And whoever canperform Hajj voluntarily, let him do so.”",
      "chain": [
        "30400",
        "20472",
        "20655",
        "11013",
        "17"
      ]
    },
    {
      "hadith_no": "3706",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا يعقوب بن إبراهيم الدورقي، حدثنا أبو تميلة، عن عبد المؤمن بن خالد، عن ابن بريدة، عن أمه، عن أم سلمة، قالت لم يكن ثوب أحب إلى رسول الله  صلى الله عليه وسلم  من القميص ‏.‏",
      "text_en": " It wasnarrated that Umm Salamah said:                      There was no garment morebeloved tothe Messenger of Allah (ﷺ) than the shirt.”",
      "chain": [
        "30400",
        "20183",
        "28375",
        "11432",
        "56"
      ]
    },
    {
      "hadith_no": "3832",
      "source": " Sunan Ibn Majah ",
      "chapter": "Supplication - كتاب الدعاء",
      "chapter_no": "34",
      "text_ar": "حدثنا يعقوب بن إبراهيم الدورقي، ومحمد بن بشار، قالا حدثنا عبد الرحمن بن مهدي، حدثنا سفيان، عن أبي إسحاق، عن أبي الأحوص، عن عبد الله، عن النبي  صلى الله عليه وسلم  أنه كان يقول ‏\"‏ اللهم إني أسألك الهدى والتقى والعفاف والغنى ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah that :                     the Prophet (saas) used to say: \"Allahumma inni as'alukal-huda wat-tuqa wal-'afaf wal-ghina (O Allah, I ask You for guidance, piety, chastity and affluence).\"",
      "chain": [
        "30400",
        "30160",
        "20033",
        "20012",
        "11049",
        "20327",
        "18"
      ]
    }
  ],
  "total_hadiths": 45
}