{
  "id": "30411",
  "name": "'Abdullah bin Nafi' al-Sa'agh عبد الله بن نافع الصائغ المخزومي",
  "full_name": "'Abdullah bin Nafi' al-Sa'agh عبد الله بن نافع الصائغ المخزومي",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "206",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ بخ  م  4  -  ثقة ]"
    ],
    "tags": [
      "B.Makhzum",
      "Client",
      "al-Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "20023",
      "name": "al-Laith bin Sa'd الليث بن سعد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20507",
      "name": "'Abdullah bin 'Umar bin Hafs bin 'Asim عبد الله بن عمر بن حفص بن عاصم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "22109",
      "name": "'Abdullah bin Nafi' al-'Advi عبد الله بن نافع العدوي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20509",
      "name": "'Abdur Rahman bin Abi al-Zanad عبد الرحمن بن أبي الزناد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "22139",
      "name": "'Abdul Mahaymun bin 'Abbas عبد المهيمن بن عباس بن سهل بن سعد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "21279",
      "name": "Sulaiman bin Yazid Abu al-Mthna سليمان بن يزيد",
      "grade": "Succ. (Taba' Tabi')"
    },
    {
      "id": "11845",
      "name": "Da'ud bin Qays al-Fra'a داود بن قيس الفراء الدباغ",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20500",
      "name": "Usamah bin Zayd al-Lythy أسامة بن زيد الليثي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20174",
      "name": "Muhammad bin 'Abdullah bin Hasan محمد بن عبد الله بن حسن بن حسن",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20177",
      "name": "Muhammad bin 'Abdur Rahman b. Abi Dh'ab محمد بن عبد الرحمن بن أبي ذئب",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20519",
      "name": "Hisham bin Sa'd al-Madni هشام بن سعد المدني أبو عباد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "30367",
      "name": "Qutayba bin Sa'id bin Jamil قتيبة بن سعيد بن جميل",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30212",
      "name": "Muhammad bin 'Abdullah bin Numayr محمد بن عبد الله بن نمير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30417",
      "name": "Salmah bin Shbyb سلمة بن شبيب",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30115",
      "name": "al-Hasan bin 'Ali al-Halwani الحسن بن علي الخلال الحلواني",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30226",
      "name": "Ahmed bin Salah al-Masri أحمد بن صالح المصري",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30485",
      "name": "Ahmed bin 'Amr bin al-Sarh أحمد بن عمرو بن السرح أبو الطاهر",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30285",
      "name": "'Abdur Rahman bin Ibrahim عبد الرحمن بن إبراهيم - دحيم",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "32009",
      "name": "al-Zubair bin Bkar الزبير بن بكار",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30308",
      "name": "Ibrahim bin al-Mandhir bin 'Abdullah إبراهيم بن المنذر بن عبد الله",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30292",
      "name": "Ahmed bin al-Hasan bin Junaydab أحمد بن الحسن بن جنيدب",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30023",
      "name": "Muhammad bin Yahya bin Faris al-Dhahli محمد بن يحيى بن فارس الذهلي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30493",
      "name": "Yonus bin 'Abdul A'la al-Sadfi يونس بن عبد الأعلى بن ميسرة الصدفي",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "407",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا روح، وعبد الله بن نافع، ح وحدثنا إسحاق بن إبراهيم، - واللفظ له - قال أخبرنا روح، عن مالك بن أنس، عن عبد الله بن أبي بكر، عن أبيه، عن عمرو بن سليم، أخبرني أبو حميد الساعدي، أنهم قالوا يا رسول الله كيف نصلي عليك قال ‏\"‏ قولوا اللهم صل على محمد وعلى أزواجه وذريته كما صليت على آل إبراهيم وبارك على محمد وعلى أزواجه وذريته كما باركت على آل إبراهيم إنك حميد مجيد ‏\"‏ ‏.‏",
      "text_en": " Abu Humaid as-Sa'idi reported:                      They (the Companions of the Holy Prophet) said: Apostle of Allah, how should we bless you? He (the Holy Prophet) observed: Say:\" O Allah! bless Muhammad, his wives and his offspring as Thou didst bless Ibrahim, and grant favours to Muhammad, and his wives and his offspring as Thou didst grant favours to the family of Ibrahim; Thou art Praiseworthy and Glorious.\"",
      "chain": [
        "30212",
        "20229",
        "30411",
        "30123",
        "20229",
        "20001",
        "11104",
        "11239",
        "1544",
        "1457"
      ]
    },
    {
      "hadith_no": "338",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن إسحاق المسيبي، أخبرنا عبد الله بن نافع، عن الليث بن سعد، عن بكر بن سوادة، عن عطاء بن يسار، عن أبي سعيد الخدري، قال خرج رجلان في سفر فحضرت الصلاة وليس معهما ماء فتيمما صعيدا طيبا فصليا ثم وجدا الماء في الوقت فأعاد أحدهما الصلاة والوضوء ولم يعد الآخر ثم أتيا رسول الله صلى الله عليه وسلم فذكرا ذلك له فقال للذي لم يعد ‏\"‏ أصبت السنة وأجزأتك صلاتك ‏\"‏ ‏.‏ وقال للذي توضأ وأعاد ‏\"‏ لك الأجر مرتين ‏\"‏ ‏.‏ قال أبو داود وغير ابن نافع يرويه عن الليث عن عميرة بن أبي ناجية عن بكر بن سوادة عن عطاء بن يسار عن النبي صلى الله عليه وسلم ‏.‏ قال أبو داود وذكر أبي سعيد الخدري في هذا الحديث ليس بمحفوظ وهو مرسل ‏.‏",
      "text_en": " \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAbu Sa'id al-Khudri said:                      Two persons set out on a journey. Meanwhile the time of prayer came and they had no water. They performed tayammum with clean earth and prayed. Later on they found water within the time of the prayer. One of them repeated the prayer and ablution but the other did not repeat. Then they came to the Messenger of Allah (ﷺ) and related the matter to him. Addressing himself to the one who did not repeat, he said: You followed the sunnah (model behavior of the Prophet) and your (first) prayer was enough for you. He said to the one who performed ablution and repeated: For you there is the double reward.Abu Dawud said: Besides Ibn Nafi' this is transmitted by al-Laith from 'Umairah b. Abi Najiyyah from Bakr b. Sawadah on the authority of 'Ata b. Yasar from the Prophet (ﷺ).Abu Dawud said: The mention of (the name of the Companion) Abu Sa'id in this tradition is not guarded. This is a mural tradition (i.e. the Successor 'Ata b. Yasar directly narrates it from the Prophet, leaving the name of the Companion in the chain.)",
      "chain": [
        "30413",
        "30411",
        "20023",
        "10849",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "841",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا عبد الله بن نافع، عن محمد بن عبد الله بن حسن، عن أبي الزناد، عن الأعرج، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يعمد أحدكم في صلاته فيبرك كما يبرك الجمل ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: (Does) one of you kneel down in his prayer as a camel kneels down (i.e. put his knees before his hands).",
      "chain": [
        "30367",
        "30411",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "1209",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Rules of Law about the Prayer during Journey - كتاب صلاة السفر",
      "chapter_no": "4",
      "text_ar": "حدثنا قتيبة، حدثنا عبد الله بن نافع، عن أبي مودود، عن سليمان بن أبي يحيى، عن ابن عمر، قال ما جمع رسول الله صلى الله عليه وسلم بين المغرب والعشاء قط في السفر إلا مرة ‏.‏ قال أبو داود وهذا يروى عن أيوب عن نافع عن ابن عمر موقوفا على ابن عمر أنه لم ير ابن عمر جمع بينهما قط إلا تلك الليلة يعني ليلة استصرخ على صفية وروي من حديث مكحول عن نافع أنه رأى ابن عمر فعل ذلك مرة أو مرتين ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     The Messenger of Allah (ﷺ) never combined the sunset and night prayers while on a journey except once.Abu Dawud said: This has been narrated by Ayyub from Nafi' from Ibn 'Umar as a statement of Ibn 'Umar. Ibn 'Umar was never seen combining these two prayers except on the night he was informed about the death of Safiyyah. The tradition narrated by Makhul from Nafi' indicates that he (Nafi') saw Ibn 'Umar doing so once or twice.",
      "chain": [
        "30367",
        "30411",
        "13516",
        "18"
      ]
    },
    {
      "hadith_no": "1296",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا ابن المثنى، حدثنا معاذ بن معاذ، حدثنا شعبة، حدثني عبد ربه بن سعيد، عن أنس بن أبي أنس، عن عبد الله بن نافع، عن عبد الله بن الحارث، عن المطلب، عن النبي صلى الله عليه وسلم قال ‏\"‏ الصلاة مثنى مثنى أن تشهد في كل ركعتين وأن تباءس وتمسكن وتقنع بيديك وتقول اللهم اللهم فمن لم يفعل ذلك فهي خداج ‏\"‏ ‏.‏ سئل أبو داود عن صلاة الليل مثنى قال إن شئت مثنى وإن شئت أربعا ‏.‏",
      "text_en": " Narrated Muttalib:                     The Prophet (ﷺ) said: Prayer is to be offered in two rak'ahs; and you should recite the tashahhud at the end of two rak'ahs, and express your distress and humility and raise your hands and say praying: O Allah, O Allah. He who does not do so does not offer a perfect prayer.Abu Dawud was asked about offering prayer at night in two rak'ahs. He said: They may be two if you like and four if you like.",
      "chain": [
        "30170",
        "20286",
        "20020",
        "11191",
        "30411",
        "912"
      ]
    },
    {
      "hadith_no": "1604",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن إسحاق المسيبي، حدثنا عبد الله بن نافع، عن محمد بن صالح التمار، عن ابن شهاب، بإسناده ومعناه ‏.‏ قال أبو داود وسعيد لم يسمع من عتاب شيئا ‏.‏",
      "text_en": " The Above-mentioned tradition has also been narrated by Ibn Shihab through a different chain of narrators to the same effects.",
      "chain": [
        "30413",
        "30411",
        "20703"
      ]
    },
    {
      "hadith_no": "3098",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا شعبة، عن الحكم، عن عبد الله بن نافع، عن علي، قال ما من رجل يعود مريضا ممسيا إلا خرج معه سبعون ألف ملك يستغفرون له حتى يصبح وكان له خريف في الجنة ومن أتاه مصبحا خرج معه سبعون ألف ملك يستغفرون له حتى يمسي وكان له خريف في الجنة ‏.‏",
      "text_en": " Narrated 'Ali:                     If a man visits a patient in the evening, seventy thousand angels come along with him seeking forgiveness from Allah for him till the morning, and he will have a garden in the Paradise.",
      "chain": [
        "28531",
        "20020",
        "11069",
        "30411",
        "5"
      ]
    },
    {
      "hadith_no": "269",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة، حدثنا عبد الله بن نافع، عن محمد بن عبد الله بن حسن، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏\"‏ يعمد أحدكم فيبرك في صلاته برك الجمل ‏\"‏ ‏.‏ قال أبو عيسى حديث أبي هريرة حديث غريب لا نعرفه من حديث أبي الزناد إلا من هذا الوجه ‏.‏ وقد روي هذا الحديث عن عبد الله بن سعيد المقبري عن أبيه عن أبي هريرة عن النبي صلى الله عليه وسلم ‏.‏ وعبد الله بن سعيد المقبري ضعفه يحيى بن سعيد القطان وغيره ‏.‏",
      "text_en": " Abu Hurairah narrated that :                     the Prophet said; \"Is it that one of you intends to kneel in his Salat with the kneeling of the camel?\"",
      "chain": [
        "30367",
        "30411",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "536",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on the Two Eids - أَبْوَابُ الْعِيدَيْنِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
      "chapter_no": "5",
      "text_ar": "حدثنا مسلم بن عمرو أبو عمرو الحذاء المديني، حدثنا عبد الله بن نافع الصائغ، عن كثير بن عبد الله، عن أبيه، عن جده، أن النبي صلى الله عليه وسلم كبر في العيدين في الأولى سبعا قبل القراءة وفي الآخرة خمسا قبل القراءة ‏.‏ قال وفي الباب عن عائشة وابن عمر وعبد الله بن عمرو ‏.‏ قال أبو عيسى حديث جد كثير حديث حسن وهو أحسن شيء روي في هذا الباب عن النبي عليه السلام واسمه عمرو بن عوف المزني ‏.‏ والعمل على هذا عند بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم ‏.‏ وهكذا روي عن أبي هريرة أنه صلى بالمدينة نحو هذه الصلاة وهو قول أهل المدينة ‏.‏ وبه يقول مالك بن أنس والشافعي وأحمد وإسحاق ‏.‏ وروي عن عبد الله بن مسعود أنه قال في التكبير في العيدين تسع تكبيرات في الركعة الأولى خمسا قبل القراءة وفي الركعة الثانية يبدأ بالقراءة ثم يكبر أربعا مع تكبيرة الركوع ‏.‏ وقد روي عن غير واحد من أصحاب النبي صلى الله عليه وسلم نحو هذا وهو قول أهل الكوفة وبه يقول سفيان الثوري ‏.‏",
      "text_en": " Kathir bin Abdullah narrated from this father, from his grandfather:                     \"The Prophet said the Takbir in the first (Rak'ah) sever (times) before the recitation, and in the last, five (times) before the recitation.\"",
      "chain": [
        "30411",
        "22172"
      ]
    },
    {
      "hadith_no": "644",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Zakat - كتاب الزكاة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "7",
      "text_ar": "حدثنا أبو عمرو، مسلم بن عمرو الحذاء المدني حدثنا عبد الله بن نافع الصائغ، عن محمد بن صالح التمار، عن ابن شهاب، عن سعيد بن المسيب، عن عتاب بن أسيد، أن النبي صلى الله عليه وسلم كان يبعث على الناس من يخرص عليهم كرومهم وثمارهم ‏.‏  وبهذا الإسناد أن النبي صلى الله عليه وسلم قال في زكاة الكروم ‏\"‏ إنها تخرص كما يخرص النخل ثم تؤدى زكاته زبيبا كما تؤدى زكاة النخل تمرا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ وقد روى ابن جريج هذا الحديث عن ابن شهاب عن عروة عن عائشة ‏.‏ وسألت محمدا عن هذا الحديث فقال حديث ابن جريج غير محفوظ وحديث ابن المسيب عن عتاب بن أسيد أثبت وأصح ‏.‏",
      "text_en": " Attab bin Asid narrated that :                     the Prophet said about Zakat on grapevines: \"They are to be assessed just as the date-palm is assessed. Then its Zakat is paid in raisins just as the Zakat for the date-palm is paid in dried dates.\"",
      "chain": [
        "30411",
        "20703",
        "11013",
        "11002",
        "994"
      ]
    },
    {
      "hadith_no": "677",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Zakat - كتاب الزكاة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "7",
      "text_ar": "حدثنا مسلم بن عمرو بن مسلم أبو عمرو الحذاء المدني، حدثني عبد الله بن نافع الصائغ، عن ابن أبي الزناد، عن موسى بن عقبة، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم كان يأمر بإخراج الزكاة قبل الغدو للصلاة يوم الفطر ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏ وهو الذي يستحبه أهل العلم أن يخرج الرجل صدقة الفطر قبل الغدو إلى الصلاة ‏.‏",
      "text_en": " Ibn Umar narrated that :                     the Messenger of Allah would order paying the Zakat before going to the Salat on the day of Fitr.",
      "chain": [
        "30411",
        "20509",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1114",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Marriage - كتاب النكاح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "11",
      "text_ar": "حدثنا الحسن بن علي الخلال، حدثنا إسحاق بن عيسى، وعبد الله بن نافع الصائغ، قالا أخبرنا مالك بن أنس، عن أبي حازم بن دينار، عن سهل بن سعد الساعدي، أن رسول الله صلى الله عليه وسلم جاءته امرأة فقالت إني وهبت نفسي لك ‏.‏ فقامت طويلا فقال رجل يا رسول الله فزوجنيها إن لم تكن لك بها حاجة ‏.‏ فقال ‏\"‏ هل عندك من شيء تصدقها ‏\"‏ ‏.‏ فقال ما عندي إلا إزاري هذا ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إزارك إن أعطيتها جلست ولا إزار لك فالتمس شيئا ‏\"‏ قال ما أجد ‏.‏ قال ‏\"‏ فالتمس ولو خاتما من حديد ‏\"‏ ‏.‏ قال فالتمس فلم يجد شيئا فقال رسول الله صلى الله عليه وسلم ‏\"‏ هل معك من القرآن شيء ‏\"‏ ‏.‏ قال نعم سورة كذا وسورة كذا ‏.‏ لسور سماها فقال رسول الله صلى الله عليه وسلم ‏\"‏ زوجتكها بما معك من القرآن ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وقد ذهب الشافعي إلى هذا الحديث فقال إن لم يكن له شيء يصدقها وتزوجها على سورة من القرآن فالنكاح جائز ويعلمها سورة من القرآن ‏.‏ وقال بعض أهل العلم النكاح جائز ويجعل لها صداق مثلها ‏.‏ وهو قول أهل الكوفة وأحمد وإسحاق",
      "text_en": " Sahl bin Sa'd As-Sa'idi narrated that:                     A woman came to the Messenger of Allah and said: \"I present myself to you (for marriage).\" So she stood for a long time. Then a man said: \"O Messenger of Allah! Marry her to me if you have no need of her.\" So he said: \"Do you have anything to give her as a dowry?\"  He said: \"I have nothing except this Izar.\" So the Messenger of Allah said: \"If you give her your Izar then you will have no Izar, so search for something.\" He said: \"I did not find anything.\" He said: \"Search for something, even if it just an iron ring.\" He said: So he searched but he did not find anything. The Messenger of Allah said: \"Do you have any Qur'an (memorized)?\" He said: \"Yes. This Surat and that Surat.\" And he named the Surat. So the Messenger of Allah said: \"I marry her to you for what you have (memorized) of the Qur'an.\"",
      "chain": [
        "30115",
        "30411",
        "20001",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "3585",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا أبو عمرو، مسلم بن عمرو الحذاء المديني حدثني عبد الله بن نافع، عن حماد بن أبي حميد، عن عمرو بن شعيب، عن أبيه، عن جده، أن النبي صلى الله عليه وسلم قال ‏\"‏ خير الدعاء دعاء يوم عرفة وخير ما قلت أنا والنبيون من قبلي لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شيء قدير ‏\"‏ ‏.‏ قال هذا حديث حسن غريب من هذا الوجه ‏.‏ وحماد بن أبي حميد هو محمد بن أبي حميد وهو أبو إبراهيم الأنصاري المدني وليس هو بالقوي عند أهل الحديث ‏.‏",
      "text_en": " Amr bin Shu’aib narrated from his father, from his grandfather, that the Prophet said:                     “The best of supplication is the supplication of the Day of Arafah. and the best of what I and the Prophet before me have said is: None has the right to be worshipped but Allah, Alone, without partner, to Him belongs all that exists, and to Him belongs the Praise, and He is powerful over all things. (La Ilaha Illallah, Wahdahu La Sharika Lahu, Lahul-Mulku Wa Lahul-Hamdu, Wa Huwa Ala Kulli Shai’in Qadir).’”",
      "chain": [
        "30411",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "4056",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا سلمة بن شبيب، حدثنا عبد الله بن نافع الصائغ، حدثنا عاصم بن عمر العمري، عن عبد الله بن دينار، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أنا أول من تنشق عنه الأرض ثم أبو بكر ثم عمر ثم آتي أهل البقيع فيحشرون معي ثم أنتظر أهل مكة حتى أحشر بين الحرمين ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب وعاصم بن عمر العمري ليس بالحافظ عند أهل الحديث ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     that the Messenger of Allah (ﷺ) said: \"I am the first for whom the earth will split, then Abu Bakr, then 'Umar. Then the people of Al-Baqi; they will be gathered with me. Then I will await the people of Makkah until they are resurrected between the Two Sacred areas.\"",
      "chain": [
        "30417",
        "30411",
        "22085",
        "11183",
        "18"
      ]
    },
    {
      "hadith_no": "1090",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا قتيبة، قال حدثنا عبد الله بن نافع، عن محمد بن عبد الله بن حسن، عن أبي الزناد، عن الأعرج، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يعمد أحدكم في صلاته فيبرك كما يبرك الجمل ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah (ﷺ) said: 'Is there any one of you who kneel as a camel kneels when praying?'\"",
      "chain": [
        "30367",
        "30411",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "518",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا إبراهيم بن المنذر الحزامي، حدثنا معن بن عيسى، ح وحدثنا عبد الرحمن بن إبراهيم الدمشقي، حدثنا عبد الله بن نافع، جميعا عن ابن أبي ذئب، عن عقبة بن عبد الرحمن، عن محمد بن عبد الرحمن بن ثوبان، عن جابر بن عبد الله، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إذا مس أحدكم ذكره فعليه الوضوء ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Jabir bin 'Abdullah said:                     \"The Messenger of Allah said: 'If anyone of you touches his penis, then he has to perform ablution.'\"",
      "chain": [
        "30308",
        "30112",
        "30285",
        "30411",
        "20177",
        "11218",
        "34"
      ]
    },
    {
      "hadith_no": "1300",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا حاتم بن بكر الضبي، حدثنا محمد بن يعلى، زنبور حدثنا عنبسة بن عبد الرحمن، عن عبد الله بن نافع، عن أبيه، عن أم سلمة، قالت نهى رسول الله  صلى الله عليه وسلم  عن القنوت في الفجر ‏.‏",
      "text_en": " It wasnarrated that Umm Salamah said:                      “The Messenger of Allah (ﷺ)wasforbidden to recite Qunut in Fajr.”",
      "chain": [
        "28459",
        "30411",
        "56"
      ]
    },
    {
      "hadith_no": "1952",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا عبد الرحمن بن إبراهيم الدمشقي، حدثنا عبد الله بن نافع الصائغ، حدثني عبد الله بن نافع، عن أبيه، عن ابن عمر، ‏.‏ أنه حين هلك عثمان بن مظعون ترك ابنة له ‏.‏ قال ابن عمر فزوجنيها خالي قدامة وهو عمها ولم يشاورها وذلك بعد ما هلك أبوها فكرهت نكاحه وأحبت الجارية أن يزوجها المغيرة بن شعبة فزوجها إياه ‏.‏",
      "text_en": " It was narrated from Ibn Umar that:                     when Uthman bin Mazun dies, he left behind a daughter. Ibn Umar said: “My maternal uncle Qudamah, who was her paternal uncle, married me to her, but he did not consult her. That was after her father had died. She did not like this marriage, and the girl wanted to marry Mughirah bin Shubah, so she married him.”",
      "chain": [
        "30285",
        "30411",
        "30411"
      ]
    },
    {
      "hadith_no": "2071",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا عبد السلام بن عاصم، حدثنا عبد الله بن نافع، حدثنا مالك بن أنس، عن أبي حازم، عن سهل بن سعد، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ إن كان ففي الفرس والمرأة والمسكن ‏\"‏ ‏.‏ يعني الشؤم ‏.‏",
      "text_en": " It was narrated from Sahl bin Sa'd that:                     the Messenger of Allah said: \"If  it exists, it is in three things: a horse, and woman and a house,\" meaning omens.",
      "chain": [
        "30411",
        "20001",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "2659",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا يونس بن عبد الأعلى، أخبرني عبد الله بن نافع، أخبرني عاصم بن عمر، عن سهيل، عن أبيه، عن أبي هريرة، عن النبي صلى الله عليه وسلم في الذي يعمل عمل قوم لوط قال ‏\"‏ ارجموا الأعلى والأسفل ارجموهما جميعا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Prophet (ﷺ) said concerning those who do the action of the people of Lut:                     “Stone the upper and the lower, stone them both.”",
      "chain": [
        "30493",
        "30411",
        "13"
      ]
    },
    {
      "hadith_no": "3037",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا إبراهيم بن المنذر الحزامي، حدثنا عبد الله بن نافع، وعبد الله بن وهب، ومحمد بن فليح، قالوا حدثنا عاصم بن عمر بن حفص، عن عاصم بن عبيد الله، عن عبد الله بن عامر بن ربيعة، عن جابر بن عبد الله، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ ما من محرم يضحى لله يومه يلبي حتى تغيب الشمس إلا غابت بذنوبه فعاد كما ولدته أمه ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Jabir bin ‘Abdullah that the Messenger of Allah(ﷺ)said:                      “There is no Muhrim (pilgrim in Ihram) who exposes himselftothe sun all day for the sake of Allah, reciting the Talbiyah untilthe sun goes down, but his sins will disappear and he will go backlike on the day his mother bore him.”",
      "chain": [
        "30308",
        "30411",
        "20029",
        "20178",
        "19808",
        "709",
        "34"
      ]
    },
    {
      "hadith_no": "3198",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد الرحمن بن إبراهيم، حدثنا عبد الله بن نافع، عن أسامة بن زيد، عن محمد بن كعب، عن كعب بن عجرة، قال أمرني النبي  صلى الله عليه وسلم  حين آذاني القمل أن أحلق رأسي وأصوم ثلاثة أيام أو أطعم ستة مساكين وقد علم أن ليس عندي ما أنسك ‏.‏",
      "text_en": " It wasnarrated that Ka’b bin ‘Ujrah said:                      “The Prophet (ﷺ)commanded me, when I was suffering, from live, to shave my head andfast for three days or feed six poor persons. He knew that I did nothave an animal I could sacrifice.”",
      "chain": [
        "30285",
        "30411",
        "50",
        "11221",
        "4052"
      ]
    },
    {
      "hadith_no": "3246",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Sacrifices - كتاب الأضاحي",
      "chapter_no": "26",
      "text_ar": "حدثنا عبد الرحمن بن إبراهيم الدمشقي، حدثنا عبد الله بن نافع، حدثني أبو المثنى، عن هشام بن عروة، عن أبيه، عن عائشة، أن النبي  صلى الله عليه وسلم  قال ‏\"‏ ما عمل ابن آدم يوم النحر عملا أحب إلى الله عز وجل من هراقة دم وإنه ليأتي يوم القيامة بقرونها وأظلافها وأشعارها وإن الدم ليقع من الله عز وجل بمكان قبل أن يقع على الأرض فطيبوا بها نفسا ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ’Aishah that the Prophet (ﷺ) said:                      “The son ofAdam does not do any deed on the Day of Sacrifice that is dearer toAllah than shedding blood. It will come on the Day of Resurrectionwith its horns and cloven hoofs and hair. Its blood is accepted byAllah before it reaches the ground. So be content when you do it.”",
      "chain": [
        "30285",
        "30411",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "3672",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا عبد الرحمن بن إبراهيم، حدثنا عبد الله بن نافع، عن ابن أبي الزناد، ح وحدثنا علي بن أبي الخصيب، حدثنا وكيع، عن عبد الله بن سعيد بن أبي هند، جميعا عن محمد بن عبد الله بن عمرو بن عثمان، عن أمه، فاطمة بنت الحسين عن ابن عباس، أن النبي  صلى الله عليه وسلم  قال ‏\"‏ لا تديموا النظر إلى المجذومين ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Abbas that the Prophet (ﷺ) said:                      “Do notkeep looking at those who have leprosy.”",
      "chain": [
        "30285",
        "30411",
        "20509",
        "20032",
        "11184",
        "22187",
        "17"
      ]
    },
    {
      "hadith_no": "4068",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا بكر بن عبد الوهاب، حدثنا عبد الله بن نافع، ويونس بن يحيى، جميعا عن داود بن قيس، عن أبي سعيد، مولى عبد الله بن عامر بن كريز عن أبي هريرة، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ كل المسلم على المسلم حرام دمه وماله وعرضه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                      “The whole of the Muslim is sacred to his fellow Muslim, hisblood, his wealth and his honor.”",
      "chain": [
        "32006",
        "30411",
        "11845",
        "13"
      ]
    }
  ],
  "total_hadiths": 25
}