{
  "id": "30413",
  "name": "Muhammad bin Ishaq bin Muhammad محمد بن إسحاق بن محمد بن عبد الرحمن",
  "full_name": "Muhammad bin Ishaq bin Muhammad محمد بن إسحاق بن محمد بن عبد الرحمن",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "236",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina",
      "Baghdad"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ م  د  -  صدوق ]"
    ],
    "tags": [
      "B.Makhzum",
      "al-Madni"
    ]
  },
  "parents": [
    {
      "id": "28035",
      "name": "Ishaq bin Muhammad bin 'Abdur Rahman إسحاق بن محمد بن عبد الرحمن",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "28035",
      "name": "Ishaq bin Muhammad bin 'Abdur Rahman إسحاق بن محمد بن عبد الرحمن",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20157",
      "name": "Abu Damra, Anas bin 'Ayyad أنس بن عياض الليثي - أبو ضمرة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "30411",
      "name": "'Abdullah bin Nafi' al-Sa'agh عبد الله بن نافع الصائغ المخزومي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20472",
      "name": "Yazid bin Harun يزيد بن هارون",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20178",
      "name": "Muhammad bin Flyh bin Sulaiman محمد بن فليح بن سليمان الأسلمي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30112",
      "name": "Ma'n bin 'Isa bin Yahya معن بن عيسى بن يحيى",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "students": [
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]"
    },
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "30511",
      "name": "Muhammad bin Ishaq al-Saghani محمد بن إسحاق الصغاني",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30554",
      "name": "Abu Zara' al-Razi أبو زرعة الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30467",
      "name": "'Abdullah bin 'Amir عبد الله بن عامر بن زرارة الحضرمي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30013",
      "name": "Ibn Abi Dunya ابن أبي الدنيا",
      "grade": "3rd Century AH [12th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-muslim-444",
      "hadith_no": "444",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن إسحاق المسيبي، حدثنا أنس، - يعني ابن عياض - عن موسى، - وهو ابن عقبة - عن نافع، قال قال عبد الله بن عمر ذكر رسول الله صلى الله عليه وسلم يوما بين ظهرانى الناس المسيح الدجال فقال ‏\"‏ إن الله تبارك وتعالى ليس بأعور ألا إن المسيح الدجال أعور عين اليمنى كأن عينه عنبة طافية ‏\"‏ ‏.‏ قال وقال رسول الله صلى الله عليه وسلم ‏\"‏ أراني الليلة في المنام عند الكعبة فإذا رجل آدم كأحسن ما ترى من أدم الرجال تضرب لمته بين منكبيه رجل الشعر يقطر رأسه ماء ‏.‏ واضعا يديه على منكبى رجلين وهو بينهما يطوف بالبيت فقلت من هذا فقالوا المسيح ابن مريم ‏.‏ ورأيت وراءه رجلا جعدا قططا أعور عين اليمنى كأشبه من رأيت من الناس بابن قطن واضعا يديه على منكبى رجلين يطوف بالبيت فقلت من هذا قالوا هذا المسيح الدجال ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of 'Abdulldh b. Umar that one day the Messenger of Allah (may peace be upon him) mentioned in the presence of people about al-Masih al-Dajjal. He said:                      Verily Allah (hallowed be He and High) is not blind of one eye. Behold, but the Masih al-Dajjal is blind of right eye as if his eye is like a swollen grape, and the Messenger of Allah (may peace be upon him) said: I was shown in a dream in the night that near the Ka'bah there was a man fair-complexioned, fine amongst the white-complexioned men that you ever saw, his locks of hair were falling on his shoulders. He was a man whose hair were neither too curly nor too straight, and water trickled down from his head. He was placing his bands on the shoulders of two persons and amidst them was making a circuit around the Ka'bah. I said: Who is he? They replied: Al-Masih son of Mary. And I saw behind him a man with intensely curly hair, blind of right eye. Amongst the persons I have ever seen Ibn Qatan has the greatest resemblance with him. He was making a circuit around the Ka'bah by placing both his hands on the shoulders of two persons. I said: Who is he? They said; It is al-Masih al-Dajjal.",
      "usc_msa_ref": "",
      "chain": [
        "30413",
        "20157",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-1273",
      "hadith_no": "1273",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا محمد بن إسحاق المسيبي، حدثني أنس، - يعني ابن عياض - عن موسى بن عقبة، ح وحدثنا هارون بن عبد الله، حدثنا حماد بن مسعدة، عن ابن جريج، ح قال وحدثنا الصلت بن مسعود، حدثنا سفيان بن موسى، عن أيوب، كلهم عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم بنحوه ‏.‏",
      "text_en": " A hadith like this has been narrated from the Apostle of Allah (may peace be upon him) on the authority of Ibn 'Umar with another chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30413",
        "20157",
        "11106",
        "30524",
        "20224",
        "11070",
        "30435",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-3105",
      "hadith_no": "3105",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا محمد بن إسحاق المسيبي، حدثني أنس، - يعني ابن عياض - عن موسى بن عقبة، عن نافع، أن عبد الله، حدثه أن رسول الله صلى الله عليه وسلم كان ينزل بذي طوى ويبيت به حتى يصلي الصبح حين يقدم مكة ومصلى رسول الله صلى الله عليه وسلم ذلك على أكمة غليظة ليس في المسجد الذي بني ثم ولكن أسفل من ذلك على أكمة غليظة ‏.‏",
      "text_en": " Abdullah (b. 'Umar) reported that whenever Allah's Messenger (may peace be upon him) entered Mecca, he got down at Dhi Tuwa and spend the night there until he observed the dawn prayer. And Allah's Messenger (may peace be upon him) observed this prayer on a rough hillock, and not in the mosque which had been then built there, but to the lower side of it (the mosque) on a hillock.",
      "usc_msa_ref": "",
      "chain": [
        "30413",
        "20157",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-3106",
      "hadith_no": "3106",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا محمد بن إسحاق المسيبي، حدثني أنس، - يعني ابن عياض - عن موسى، بن عقبة عن نافع، أن عبد الله، أخبره أن رسول الله صلى الله عليه وسلم استقبل فرضتى الجبل الذي بينه وبين الجبل الطويل نحو الكعبة يجعل المسجد الذي بني ثم يسار المسجد الذي بطرف الأكمة ومصلى رسول الله صلى الله عليه وسلم أسفل منه على الأكمة السوداء يدع من الأكمة عشر أذرع أو نحوها ثم يصلي مستقبل الفرضتين من الجبل الطويل الذي بينك وبين الكعبة صلى الله عليه وسلم ‏.‏",
      "text_en": " Nafi' reported that Abdullah (b. 'Umar) informed him that Allah's Messenger (may peace be upon him) turned his face to the two hillocks which intervened between him and the long mountain by the side of the Ka'ba, and the mosque which had been built there was thus on the left of the hillock. Allah's Messenger's (may peace be upon him) place of prayer was lower than the black hillock, at a distance of ten cubits or near it. He (may peace be upon him) would then observe prayer facing these two hillocks of the long mountain that is intervening between you and the Ka'ba.",
      "usc_msa_ref": "",
      "chain": [
        "30413",
        "20157",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-3349",
      "hadith_no": "3349",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا محمد بن إسحاق المسيبي، حدثني أنس، - يعني أبا ضمرة - عن موسى، بن عقبة عن نافع، أن عبد الله بن عمر، كان إذا صدر من الحج أو العمرة أناخ بالبطحاء التي بذي الحليفة التي كان ينيخ بها رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Nafi' reported that when 'Abdullah b. 'Umar returned from Hajj or 'Umra he made his camel kneel down (i. e. halted) in the stony ground of Dhu'l-Hulaifa where Allah's Messenger (may peace be upon him) had made his camel halt.",
      "usc_msa_ref": "",
      "chain": [
        "30413",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-7125",
      "hadith_no": "7125",
      "source": "Sahih Muslim",
      "chapter": "The Book of Heart-Melting Traditions - كتاب الرقاق",
      "chapter_no": "50",
      "text_ar": "حدثني محمد بن إسحاق المسيبي، حدثني أنس، - يعني ابن عياض أبا ضمرة - عن موسى بن عقبة، عن نافع، عن عبد الله بن عمر، عن رسول الله صلى الله عليه وسلم أنه قال ‏\"‏ بينما ثلاثة نفر يتمشون أخذهم المطر فأووا إلى غار في جبل فانحطت على فم غارهم صخرة من الجبل فانطبقت عليهم فقال بعضهم لبعض انظروا أعمالا عملتموها صالحة لله فادعوا الله تعالى بها لعل الله يفرجها عنكم ‏.‏ فقال أحدهم اللهم إنه كان لي والدان شيخان كبيران وامرأتي ولي صبية صغار أرعى عليهم فإذا أرحت عليهم حلبت فبدأت بوالدى فسقيتهما قبل بني وأنه نأى بي ذات يوم الشجر فلم آت حتى أمسيت فوجدتهما قد ناما فحلبت كما كنت أحلب فجئت بالحلاب فقمت عند رءوسهما أكره أن أوقظهما من نومهما وأكره أن أسقي الصبية قبلهما والصبية يتضاغون عند قدمى فلم يزل ذلك دأبي ودأبهم حتى طلع الفجر فإن كنت تعلم أني فعلت ذلك ابتغاء وجهك فافرج لنا منها فرجة نرى منها السماء ‏.‏ ففرج الله منها فرجة فرأوا منها السماء ‏.‏ وقال الآخر اللهم إنه كانت لي ابنة عم أحببتها كأشد ما يحب الرجال النساء وطلبت إليها نفسها فأبت حتى آتيها بمائة دينار فتعبت حتى جمعت مائة دينار فجئتها بها فلما وقعت بين رجليها قالت يا عبد الله اتق الله ولا تفتح الخاتم إلا بحقه ‏.‏ فقمت عنها فإن كنت تعلم أني فعلت ذلك ابتغاء وجهك فافرج لنا منها فرجة ‏.‏ ففرج لهم ‏.‏ وقال الآخر اللهم إني كنت استأجرت أجيرا بفرق أرز فلما قضى عمله قال أعطني حقي ‏.‏ فعرضت عليه فرقه فرغب عنه فلم أزل أزرعه حتى جمعت منه بقرا ورعاءها فجاءني فقال اتق الله ولا تظلمني حقي ‏.‏ قلت اذهب إلى تلك البقر ورعائها فخذها ‏.‏ فقال اتق الله ولا تستهزئ بي ‏.‏ فقلت إني لا أستهزئ بك خذ ذلك البقر ورعاءها ‏.‏ فأخذه فذهب به فإن كنت تعلم أني فعلت ذلك ابتغاء وجهك فافرج لنا ما بقي ‏.‏ ففرج الله ما بقي ‏.‏",
      "text_en": " 'Abdullah b. 'Umar reported that Allah's Messenger (may peace be upon him) said:                      Three persons set out on a journey. They were overtaken by rain and they had to find protection in a mountain cave where at its mouth there fell a rock of that mountain and thus blocked them altogether. One of them said to the others: Look to your good deeds that you performed for the sake of Allah and then supplicate Allah, the Exalted, that He might rescue you (from this trouble). One of them said: 0 Allah, I had my parents who were old and my wife and my small children also. I tended the flock and when I came back to them in the evening, I milked them (the sheep, goats, cows, etc.) and first served that milk to my parents. One day I was obliged to go out to a distant place in search of fodder and I could not come back before evening and found them (the parents) asleep. I milked the animals as I used to milk and brought milk to them and stood by their heads avoiding to disturb them from sleep and I did not deem it advisable to serve milk to my children before serving them. My children wept near my feet. I remained there in that very state and my parents too until it was morning. And (0 Allah) if Thou art aware that I did this in order to seek Thine pleasure, grant us riddance from this trouble. (The rock slipped a bit) that they could see the sky. The second one said: 0 Allah, I had a female cousin whom I loved more than the men love the women. I wanted to have sexual intercourse with her; she refused but on the condition of getting one hundred dinirs. It was with very great difficulty that I could collect one hundred dinirs and then paid them to her and when I was going to have a sexual intercourse with her, that she said: Servant of Allah, fear Allah and do not break the seal (of chastity) but by lawful means. I got up. 0 Allah, if Thou art aware that I did this in order to seek Thine pleasure, rid us from this trouble. The situation was somewhat eased for them. The third one said: Allah, I employed a workman for a measure of rice. After he had finished his work I gave him his dues (in the form of) a measure of rice, but he did not accept them. I used these rice as seeds, and that gave a bumper crop and I became rich enough to have cows and flocks (in my possession). He came to me and said: Fear Allah, and commit no crueltv upon me in regard to my dues. I said to him: Takeaway this flock of cows and sheep. He said: Fear Allah and do not make a fun of me. I said: I am not making a fun of you. You take the cows and the flocks. So he took them. 0 Allah, if Thou art aware that I did it for Thine pleasure, case the situation for us. And Allah relieved them from the rest of the trouble.",
      "usc_msa_ref": "",
      "chain": [
        "30413",
        "20157",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-7383",
      "hadith_no": "7383",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "حدثنا محمد بن إسحاق المسيبي، حدثنا أنس يعني ابن عياض، ح وحدثني  سويد بن سعيد، حدثنا حفص بن ميسرة، كلاهما عن موسى بن عقبة، ح وحدثنا أبو بكر، بن أبي شيبة حدثنا أبو خالد الأحمر، وعيسى بن يونس، عن ابن عون، ح وحدثني عبد، الله بن جعفر بن يحيى حدثنا معن، حدثنا مالك، ح وحدثني أبو نصر التمار، حدثنا حماد، بن سلمة عن أيوب، ح وحدثنا الحلواني، وعبد بن حميد، عن يعقوب بن إبراهيم بن سعد، حدثنا أبي، عن صالح، كل هؤلاء عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم ‏.‏ بمعنى حديث عبيد الله عن نافع ‏.‏ غير أن في حديث موسى بن عقبة وصالح ‏\"‏ حتى يغيب أحدهم في رشحه إلى أنصاف أذنيه ‏\"‏ ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Ibn 'Umar but with a slight variation of wording (and the words are):                     \" One of them would be completely submerged in perspiration up to half of his ears.\"",
      "usc_msa_ref": "",
      "chain": [
        "30413",
        "20157",
        "30547",
        "20421",
        "11106",
        "30201",
        "20326",
        "20347",
        "11071",
        "30112",
        "20001"
      ]
    },
    {
      "id": "sunan-abi-daud-291",
      "hadith_no": "291",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن إسحاق المسيبي، حدثني أبي، عن ابن أبي ذئب، عن ابن شهاب، عن عروة، وعمرة بنت عبد الرحمن، عن عائشة، أن أم حبيبة، استحيضت سبع سنين فأمرها رسول الله صلى الله عليه وسلم أن تغتسل فكانت تغتسل لكل صلاة ‏.‏",
      "text_en": " 'Aishah said:                      Umm Habibah had a prolonged flow of blood for seven years. The Messenger of Allah (ﷺ) commanded her to take bath; so shed used to take bath for every prayer.",
      "usc_msa_ref": "",
      "chain": [
        "30413",
        "28035",
        "20177",
        "11013",
        "10511",
        "11455",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-338",
      "hadith_no": "338",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن إسحاق المسيبي، أخبرنا عبد الله بن نافع، عن الليث بن سعد، عن بكر بن سوادة، عن عطاء بن يسار، عن أبي سعيد الخدري، قال خرج رجلان في سفر فحضرت الصلاة وليس معهما ماء فتيمما صعيدا طيبا فصليا ثم وجدا الماء في الوقت فأعاد أحدهما الصلاة والوضوء ولم يعد الآخر ثم أتيا رسول الله صلى الله عليه وسلم فذكرا ذلك له فقال للذي لم يعد ‏\"‏ أصبت السنة وأجزأتك صلاتك ‏\"‏ ‏.‏ وقال للذي توضأ وأعاد ‏\"‏ لك الأجر مرتين ‏\"‏ ‏.‏ قال أبو داود وغير ابن نافع يرويه عن الليث عن عميرة بن أبي ناجية عن بكر بن سوادة عن عطاء بن يسار عن النبي صلى الله عليه وسلم ‏.‏ قال أبو داود وذكر أبي سعيد الخدري في هذا الحديث ليس بمحفوظ وهو مرسل ‏.‏",
      "text_en": " \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAbu Sa'id al-Khudri said:                      Two persons set out on a journey. Meanwhile the time of prayer came and they had no water. They performed tayammum with clean earth and prayed. Later on they found water within the time of the prayer. One of them repeated the prayer and ablution but the other did not repeat. Then they came to the Messenger of Allah (ﷺ) and related the matter to him. Addressing himself to the one who did not repeat, he said: You followed the sunnah (model behavior of the Prophet) and your (first) prayer was enough for you. He said to the one who performed ablution and repeated: For you there is the double reward.Abu Dawud said: Besides Ibn Nafi' this is transmitted by al-Laith from 'Umairah b. Abi Najiyyah from Bakr b. Sawadah on the authority of 'Ata b. Yasar from the Prophet (ﷺ).Abu Dawud said: The mention of (the name of the Companion) Abu Sa'id in this tradition is not guarded. This is a mural tradition (i.e. the Successor 'Ata b. Yasar directly narrates it from the Prophet, leaving the name of the Companion in the chain.)",
      "usc_msa_ref": "",
      "chain": [
        "30413",
        "30411",
        "20023",
        "10849",
        "11020",
        "38"
      ]
    },
    {
      "id": "sunan-abi-daud-1604",
      "hadith_no": "1604",
      "source": "Sunan Abi Da'ud",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن إسحاق المسيبي، حدثنا عبد الله بن نافع، عن محمد بن صالح التمار، عن ابن شهاب، بإسناده ومعناه ‏.‏ قال أبو داود وسعيد لم يسمع من عتاب شيئا ‏.‏",
      "text_en": " The Above-mentioned tradition has also been narrated by Ibn Shihab through a different chain of narrators to the same effects.",
      "usc_msa_ref": "",
      "chain": [
        "30413",
        "30411",
        "20703"
      ]
    }
  ],
  "total_hadiths": 10
}