{
  "id": "30414",
  "name": "Ahmed bin Ja'far al-Ma'qry أحمد بن جعفر المعقري",
  "full_name": "Ahmed bin Ja'far al-Ma'qry أحمد بن جعفر المعقري",
  "grade": "3rd Century AH [11th generation]",
  "reliability_grade": "Maqbool",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "255",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah"
    ],
    "area_of_interest": [
      "Narrator[Grade:Maqbool] [ م  -  مقبول ]"
    ],
    "tags": [
      "Makkah"
    ],
    "area_of_interest_display": [
      {
        "en": "Narrator[Grade:Maqbool] [ م  -  مقبول ]",
        "ar": "Narrator[Grade:Maqbool] [ م  -  مقبول ]",
        "ckb": "Narrator[Grade:Maqbool] [ م  -  مقبول ]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "Makkah",
        "ar": "مكة المكرمة",
        "ckb": "مەككە"
      }
    ],
    "tags_display": [
      {
        "en": "Makkah",
        "ar": "Makkah",
        "ckb": "Makkah"
      }
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "28603",
      "name": "al-Nadr bin Muhammad النضر بن محمد",
      "grade": "Succ. (Taba' Tabi') [8th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [8th Generation]",
        "ar": "تابع التابعين [الجيل الثامن]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی هەشتەم]"
      }
    },
    {
      "id": "28043",
      "name": "Isma'il bin 'Abdul Karim bin Ma'qal إسماعيل بن عبد الكريم بن معقل بن منبه",
      "grade": "Succ. (Taba' Tabi') [9th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [9th Generation]",
        "ar": "تابع التابعين [الجيل التاسع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی نۆیەم]"
      }
    }
  ],
  "students": [
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]",
      "grade_display": {
        "en": "3rd Century AH [Shafi'i]",
        "ar": "القرن الثالث الهجري [شافعي]",
        "ckb": "سەدەی سێیەمی كۆچی [شافیعی]"
      }
    }
  ],
  "hadiths": [
    {
      "id": "sahih-muslim-395-4",
      "hadith_no": "395",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثني أحمد بن جعفر المعقري، حدثنا النضر بن محمد، حدثنا أبو أويس، أخبرني العلاء، قال سمعت من أبي ومن أبي السائب، وكانا، جليسى أبي هريرة قالا قال أبو هريرة قال رسول الله صلى الله عليه وسلم ‏\"‏ من صلى صلاة لم يقرأ فيها بفاتحة الكتاب فهى خداج ‏\"‏ ‏.‏ يقولها ثلاثا بمثل حديثهم ‏.‏",
      "text_en": " Abu Huraira reported:                      The Messenger of Allah (may peace be upon him) said: He who said his prayer, but did not recite the opening chapter of al-Kitab, his prayer is incomplete. He repeated it thrice.",
      "usc_msa_ref": "",
      "chain": [
        "30414",
        "28603",
        "20506",
        "10606",
        "13"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-1967",
      "hadith_no": "1967",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثني أحمد بن جعفر المعقري، حدثنا النضر بن محمد، حدثنا عكرمة بن عمار، حدثنا شداد بن عبد الله أبو عمار، ويحيى بن أبي كثير، عن أبي أمامة، - قال عكرمة ولقي شداد أبا أمامة وواثلة وصحب أنسا إلى الشام وأثنى عليه فضلا وخيرا - عن أبي أمامة قال قال عمرو بن عبسة السلمي كنت وأنا في الجاهلية أظن أن الناس على ضلالة وأنهم ليسوا على شىء وهم يعبدون الأوثان فسمعت برجل بمكة يخبر أخبارا فقعدت على راحلتي فقدمت عليه فإذا رسول الله صلى الله عليه وسلم مستخفيا جرءاء عليه قومه فتلطفت حتى دخلت عليه بمكة فقلت له ما أنت قال ‏\"‏ أنا نبي ‏\"‏ ‏.‏ فقلت وما نبي قال ‏\"‏ أرسلني الله ‏\"‏ ‏.‏ فقلت وبأى شىء أرسلك قال ‏\"‏ أرسلني بصلة الأرحام وكسر الأوثان وأن يوحد الله لا يشرك به شىء ‏\"‏ ‏.‏ قلت له فمن معك على هذا قال ‏\"‏ حر وعبد ‏\"‏ ‏.‏ قال ومعه يومئذ أبو بكر وبلال ممن آمن به ‏.‏ فقلت إني متبعك ‏.‏ قال ‏\"‏ إنك لا تستطيع ذلك يومك هذا ألا ترى حالي وحال الناس ولكن ارجع إلى أهلك فإذا سمعت بي قد ظهرت فأتني ‏\"‏ ‏.‏ قال فذهبت إلى أهلي وقدم رسول الله صلى الله عليه وسلم المدينة وكنت في أهلي فجعلت أتخبر الأخبار وأسأل الناس حين قدم المدينة حتى قدم على نفر من أهل يثرب من أهل المدينة فقلت ما فعل هذا الرجل الذي قدم المدينة فقالوا الناس إليه سراع وقد أراد قومه قتله فلم يستطيعوا ذلك ‏.‏ فقدمت المدينة فدخلت عليه فقلت يا رسول الله أتعرفني قال ‏\"‏ نعم أنت الذي لقيتني بمكة ‏\"‏ ‏.‏ قال فقلت بلى ‏.‏ فقلت يا نبي الله أخبرني عما علمك الله وأجهله ‏.‏ أخبرني عن الصلاة قال ‏\"‏ صل صلاة الصبح ثم أقصر عن الصلاة حتى تطلع الشمس حتى ترتفع فإنها تطلع حين تطلع بين قرنى شيطان وحينئذ يسجد لها الكفار ثم صل فإن الصلاة مشهودة محضورة حتى يستقل الظل بالرمح ثم أقصر عن الصلاة فإن حينئذ تسجر جهنم فإذا أقبل الفىء فصل فإن الصلاة مشهودة محضورة حتى تصلي العصر ثم أقصر عن الصلاة حتى تغرب الشمس فإنها تغرب بين قرنى شيطان وحينئذ يسجد لها الكفار ‏\"‏ ‏.‏ قال فقلت يا نبي الله فالوضوء حدثني عنه قال ‏\"‏ ما منكم رجل يقرب وضوءه فيتمضمض ويستنشق فينتثر إلا خرت خطايا وجهه وفيه وخياشيمه ثم إذا غسل وجهه كما أمره الله إلا خرت خطايا وجهه من أطراف لحيته مع الماء ثم يغسل يديه إلى المرفقين إلا خرت خطايا يديه من أنامله مع الماء ثم يمسح رأسه إلا خرت خطايا رأسه من أطراف شعره مع الماء ثم يغسل قدميه إلى الكعبين إلا خرت خطايا رجليه من أنامله مع الماء فإن هو قام فصلى فحمد الله وأثنى عليه ومجده بالذي هو له أهل وفرغ قلبه لله إلا انصرف من خطيئته كهيئته يوم ولدته أمه ‏\"‏ ‏.‏ فحدث عمرو بن عبسة بهذا الحديث أبا أمامة صاحب رسول الله صلى الله عليه وسلم فقال له أبو أمامة يا عمرو بن عبسة انظر ما تقول في مقام واحد يعطى هذا الرجل فقال عمرو يا أبا أمامة لقد كبرت سني ورق عظمي واقترب أجلي وما بي حاجة أن أكذب على الله ولا على رسول الله لو لم أسمعه من رسول الله صلى الله عليه وسلم إلا مرة أو مرتين أو ثلاثا - حتى عد سبع مرات - ما حدثت به أبدا ولكني سمعته أكثر من ذلك ‏.‏",
      "text_en": " 'A'isha reported that 'Umar misconstrued the fact that the Messenger of Allah (may peace be upon him) had prohibited the observance of prayer at the time of the rising sun and at the time of its setting.",
      "usc_msa_ref": "",
      "chain": [
        "30414",
        "28603",
        "10704",
        "11449",
        "405",
        "405"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-6276",
      "hadith_no": "6276",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا عبد الله بن الرومي اليمامي، وعباس بن عبد العظيم العنبري، وأحمد بن، جعفر المعقري قالوا حدثنا النضر بن محمد، حدثنا عكرمة، - وهو ابن عمار - حدثنا  أبو النجاشي، حدثني رافع بن خديج، قال قدم نبي الله صلى الله عليه وسلم المدينة وهم يأبرون النخل يقولون يلقحون النخل فقال ‏\"‏ ما تصنعون ‏\"‏ ‏.‏ قالوا كنا نصنعه قال ‏\"‏ لعلكم لو لم تفعلوا كان خيرا ‏\"‏ ‏.‏ فتركوه فنفضت أو فنقصت - قال - فذكروا ذلك له فقال ‏\"‏ إنما أنا بشر إذا أمرتكم بشىء من دينكم فخذوا به وإذا أمرتكم بشىء من رأى فإنما أنا بشر ‏\"‏ ‏.‏ قال عكرمة أو نحو هذا ‏.‏ قال المعقري فنفضت ‏.‏ ولم يشك ‏.‏",
      "text_en": " Rafi' b. Khadij reported that Allah's Messenger (may peace be upon him) came to Medina and the people had been grafting the trees. He said:                      What are you doing? They said: We are grafting them, whereupon he said: It may perhaps be good for you if you do not do that, so they abandoned this practice (and the date-palms) began to yield less fruit. They made a mention of it (to the Holy Prophet), whereupon he said: I am a human being, so when I command you about a thing pertaining to religion, do accept it, and when I command you about a thing out of my personal opinion, keep it in mind that I am a human being. 'Ikrima reported that he said something like this.",
      "usc_msa_ref": "",
      "chain": [
        "30437",
        "30414",
        "28603",
        "10704",
        "1986"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-6565",
      "hadith_no": "6565",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثني عباس بن عبد العظيم العنبري، وأحمد بن جعفر المعقري، قالا حدثنا  النضر، - وهو ابن محمد اليمامي - حدثنا عكرمة، حدثنا أبو زميل، حدثني ابن عباس، قال كان المسلمون لا ينظرون إلى أبي سفيان ولا يقاعدونه فقال للنبي صلى الله عليه وسلم يا نبي الله ثلاث أعطنيهن قال ‏\"‏ نعم ‏\"‏ ‏.‏ قال عندي أحسن العرب وأجمله أم حبيبة بنت أبي سفيان أزوجكها قال ‏\"‏ نعم ‏\"‏ ‏.‏ قال ومعاوية تجعله كاتبا بين يديك ‏.‏ قال ‏\"‏ نعم ‏\"‏ ‏.‏ قال وتؤمرني حتى أقاتل الكفار كما كنت أقاتل المسلمين ‏.‏ قال ‏\"‏ نعم ‏\"‏ ‏.‏ قال أبو زميل ولولا أنه طلب ذلك من النبي صلى الله عليه وسلم ما أعطاه ذلك لأنه لم يكن يسئل شيئا إلا قال ‏\"‏ نعم ‏\"‏ ‏.‏",
      "text_en": " Ibn Abbas reported that the Muslims neither looked to Abu Sufyan (with respect) nor did they sit in his company. he (Abu Sufyan) said to Allah's Apostle (may peace be upon him):                      Allah's Apostle, confer upon me three things. He replied in the affirmative. He (further) said: I have with me the most handsome and the best (woman) Umm Habiba, daughter of Abu Sufyan; marry her, whereupon he said: Yes. And he again said: Accept Mu'awiya to serve as your scribe. He said: Yes. He again said: Make me the commander (of the Muslim army) so that I should fight against the unbelievers as I fought against the Muslims. He said: Yes. Abu Zumnail said: If he had not asked for these three things from Allah's Apostle (may peace be upon him), he would have never conferred them upon him, for it was (his habit) to accede to everybody's (earnest) request.",
      "usc_msa_ref": "",
      "chain": [
        "30437",
        "30414",
        "20466",
        "11023",
        "17"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    }
  ],
  "total_hadiths": 4,
  "grade_display": {
    "en": "3rd Century AH [11th Generation]",
    "ar": "القرن الثالث الهجري [الجيل الحادي عشر]",
    "ckb": "سەدەی سێیەمی كۆچی [نەوەی یازدەیەم]"
  }
}