{
  "id": "30410",
  "name": "Ishaq bin Musa bin 'Abdullah bin Musa إسحاق بن موسى بن عبد الله بن موسى",
  "full_name": "Ishaq bin Musa bin 'Abdullah bin Musa إسحاق بن موسى بن عبد الله بن موسى",
  "grade": "3rd Century AH [10th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medina"
    },
    "death": {
      "date_hijri": "244",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina",
      "Nisapur"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  ت  س  ق  -  ثقة ]"
    ],
    "tags": [
      "B.Khutama",
      "Ansar",
      "Judge",
      "al-Madni",
      "Nisapur"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20733",
      "name": "al-Walid bin Muslim al-Quraishi الوليد بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20028",
      "name": "Jarir bin 'Abdul Hameed al-Razi جرير بن عبد الحميد أبو عبد الله الضبي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20157",
      "name": "Abu Damra, Anas bin 'Ayyad أنس بن عياض الليثي - أبو ضمرة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20029",
      "name": "'Abdullah bin Wahb عبد الله بن وهب بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20286",
      "name": "Mua'dh bin Mua'dh bin Nsr معاذ بن معاذ بن نصر",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30112",
      "name": "Ma'n bin 'Isa bin Yahya معن بن عيسى بن يحيى",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "students": [
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]"
    },
    {
      "id": "30005",
      "name": "Imam Tirmidhi الترمذي محمد بن عيسى بن سورة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30006",
      "name": "Imam Nasa'i أحمد بن شعيب بن علي بن سنان النسائي",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30004",
      "name": "Ibn Maja ابن ماجة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30554",
      "name": "Abu Zara' al-Razi أبو زرعة الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30218",
      "name": "Musa bin Harun bin Bashyr موسى بن هارون بن بشير",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "285",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا إسحاق بن إبراهيم، وعبد بن حميد، قالا أخبرنا عبد الرزاق، قال أخبرنا معمر، ح وحدثنا إسحاق بن موسى الأنصاري، حدثنا الوليد بن مسلم، عن الأوزاعي، ح وحدثنا محمد بن رافع، حدثنا عبد الرزاق، أخبرنا ابن جريج، جميعا عن الزهري، بهذا الإسناد أما الأوزاعي وابن جريج ففي حديثهما قال أسلمت لله ‏.‏ كما قال الليث في حديثه ‏.‏ وأما معمر ففي حديثه فلما أهويت لأقتله قال لا إله إلا الله ‏.‏",
      "text_en": " The same hadith has been transmitted by the same chain of narrators. The hadith transmitted by Auza'i and Ibn Juraij contains these words:                      I embraced Islam for Allah's sake. and in the hadith narrated by Ma'mar the words are: I knelt down to kill him, that he said; There is no god but Allah.",
      "chain": [
        "30123",
        "30553",
        "20121",
        "20115",
        "30410",
        "20733",
        "20024",
        "30375",
        "20121"
      ]
    },
    {
      "hadith_no": "235",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثني إسحاق بن موسى الأنصاري، حدثنا معن، حدثنا مالك بن أنس، عن عمرو بن يحيى، بهذا الإسناد وقال مضمض واستنثر ثلاثا ‏.‏ ولم يقل من كف واحدة ‏.‏ وزاد بعد قوله فأقبل بهما وأدبر بدأ بمقدم رأسه ثم ذهب بهما إلى قفاه ثم ردهما حتى رجع إلى المكان الذي بدأ منه وغسل رجليه ‏.‏",
      "text_en": " Malik b. Anas narrated it from 'Amr b. Yahya with the same chain of transmitters, transmitters and mentioned the rinsing (of mouth) and snuffing (of water into the nostrils) three times, but he did not mention\" from one palm,\" and made this addition:                      He moved them (his hands) for wiping to the front of his head and then the nape of his neck, then bringing them back till he reached the place from which he had begun, after which he washed his feet.",
      "chain": [
        "30410",
        "30112",
        "20001",
        "11210"
      ]
    },
    {
      "hadith_no": "249",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا عبد العزيز، - يعني الدراوردي ح وحدثني إسحاق بن موسى الأنصاري، حدثنا معن، حدثنا مالك، جميعا عن العلاء بن عبد الرحمن، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم خرج إلى المقبرة فقال ‏\"‏ السلام عليكم دار قوم مؤمنين وإنا إن شاء الله بكم لاحقون ‏\"‏ ‏.‏ بمثل حديث إسماعيل بن جعفر غير أن حديث مالك ‏\"‏ فليذادن رجال عن حوضي ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      The Messenger of Allah (may peace The upon him) went out to the graveyard and said: Peace be upon you, the abode of the believing people. and If Allah so wills we shall join you.... (and so on and so forth) like the hadith narrated by Isma'il b. Ja'far except the words of Malik: Then some persons would be driven away from my Cistern.",
      "chain": [
        "30367",
        "20167",
        "30410",
        "30112",
        "20001",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "251",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثني إسحاق بن موسى الأنصاري، حدثنا معن، حدثنا مالك، ح وحدثنا محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، جميعا عن العلاء بن عبد الرحمن، بهذا الإسناد وليس في حديث شعبة ذكر الرباط وفي حديث مالك ثنتين ‏\"‏ فذلكم الرباط فذلكم الرباط ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Ali' b. 'Abd al-Rahman with the same chain of transmitters and there is no mention of the word of al-Ribat in the hadith transmitted by Shu'ba and in the badith narrated by Malik\" Ribat\" has been mentioned twice. This is the\" Ribat\" for you, this is the\" Ribat\" for you.",
      "chain": [
        "30410",
        "30112",
        "20001",
        "30170",
        "20173",
        "20020",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "1433",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني إسحاق بن موسى الأنصاري، حدثنا معن، حدثنا مالك، عن عبد الله بن يزيد، مولى الأسود بن سفيان عن أبي سلمة بن عبد الرحمن، ومحمد بن عبد الرحمن بن ثوبان، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا كان الحر فأبردوا عن الصلاة فإن شدة الحر من فيح جهنم ‏\"‏ ‏.‏ وذكر ‏\"‏ أن النار اشتكت إلى ربها فأذن لها في كل عام بنفسين نفس في الشتاء ونفس في الصيف ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      The Messenger of Allah (may peace be upon him) said: When it is hot, make delay (in the noon prayer) till it cools down, for the intensity of beat is from the Exhalation of Hell; and lie also mentioned that the Hellfire complained to the Lord (about the congested atmosphere) and so it was permitted to take two exhalation during the whole year, one exhalation during the winter and one exhalation during the summer.",
      "chain": [
        "30410",
        "30112",
        "20001",
        "11189",
        "10567",
        "11218",
        "13"
      ]
    },
    {
      "hadith_no": "1491",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا نصر بن علي الجهضمي، وإسحاق بن موسى الأنصاري، قالا حدثنا معن، عن مالك، عن يحيى بن سعيد، عن عمرة، عن عائشة، قالت إن كان رسول الله صلى الله عليه وسلم ليصلي الصبح فينصرف النساء متلفعات بمروطهن ما يعرفن من الغلس ‏.‏ وقال الأنصاري في روايته متلففات ‏.‏",
      "text_en": " 'A'isha reported:                      The Messenger of Allah (may peace be upon him) used to observe the morning prayer, and the women would go back wrapped in their mantles being unrecognisable because of the darkness before dawn. (Ishaq b. Musa) al-Ansari (one of the transmitters in this chain of narration) narrated\" wrapped\" (only) in his narration. (No mention was made of mantles.)",
      "chain": [
        "30395",
        "30410",
        "30112",
        "20001",
        "11062",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "1560",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا هارون بن معروف، وإسحاق بن موسى الأنصاري، قالا حدثنا أنس بن عياض، - حدثني ابن أبي ذباب، في رواية هارون - وفي حديث الأنصاري حدثني الحارث - عن عبد الرحمن بن مهران مولى أبي هريرة عن أبي هريرة أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أحب البلاد إلى الله مساجدها وأبغض البلاد إلى الله أسواقها ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported that the Messenger of Allah (may peace be upon him) said:                      The parts of land dearest to Allah are its mosques, and the parts most hateful to Allah are markets.",
      "chain": [
        "30280",
        "30410",
        "20157",
        "13"
      ]
    },
    {
      "hadith_no": "4912",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا إسحاق بن موسى الأنصاري، حدثنا الوليد بن مسلم، حدثنا ابن جابر، بهذا الإسناد وقال رزيق مولى بني فزارة ‏.‏",
      "text_en": " The above tradition has been narrated through a different chain of transmitters.",
      "chain": [
        "30410",
        "20733"
      ]
    },
    {
      "hadith_no": "6081",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثني إسحاق بن موسى الأنصاري، حدثنا معن، حدثنا مالك، ح وحدثني أبو الطاهر أخبرنا ابن وهب، عن مالك بن أنس، عن إسحاق بن عبد الله بن أبي طلحة، عن  أنس بن مالك، أنه قال رأيت رسول الله صلى الله عليه وسلم وحانت صلاة العصر فالتمس الناس الوضوء فلم يجدوه فأتي رسول الله صلى الله عليه وسلم بوضوء فوضع رسول الله صلى الله عليه وسلم في ذلك الإناء يده وأمر الناس أن يتوضئوا منه - قال - فرأيت الماء ينبع من تحت أصابعه فتوضأ الناس حتى توضئوا من عند آخرهم ‏.‏",
      "text_en": " Anas b. Malik reported:                      I saw Allah's Messenger (may peace be upon him) during the time of the afternoon prayer and the people asking for water for performing ablution which they did not find. (A small quantity) of water was brought to Allah's Messenger (may peace be upon him) and he placed his hand in that vessel and commanded people to perform ablution. I saw water spouting from his fingers and the people performing ablution until the last amongst them performed it.",
      "chain": [
        "30410",
        "30112",
        "20001",
        "20029",
        "20001",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "6914",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Destiny - كتاب القدر",
      "chapter_no": "47",
      "text_ar": "حدثنا إسحاق بن موسى بن عبد الله بن موسى بن عبد الله بن يزيد الأنصاري، حدثنا أنس بن عياض، حدثني الحارث بن أبي ذباب، عن يزيد، - وهو ابن هرمز - وعبد الرحمن الأعرج قالا سمعنا أبا هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ احتج آدم وموسى عليهما السلام عند ربهما فحج آدم موسى قال موسى أنت آدم الذي خلقك الله بيده ونفخ فيك من روحه وأسجد لك ملائكته وأسكنك في جنته ثم أهبطت الناس بخطيئتك إلى الأرض فقال آدم أنت موسى الذي اصطفاك الله برسالته وبكلامه وأعطاك الألواح فيها تبيان كل شىء وقربك نجيا فبكم وجدت الله كتب التوراة قبل أن أخلق قال موسى بأربعين عاما ‏.‏ قال آدم فهل وجدت فيها ‏{‏ وعصى آدم ربه فغوى‏}‏ قال نعم ‏.‏ قال أفتلومني على أن عملت عملا كتبه الله على أن أعمله قبل أن يخلقني بأربعين سنة قال رسول الله صلى الله عليه وسلم ‏\"‏ فحج آدم موسى ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      There was an argument between Adam and Moses (peace be upon both of them) in the presence of their Lord. Adam came the better of Moses. Moses said: Are you that Adam whom Allah created with His Hand and breathed into himHis sprit, and commanded angels to fall in prostration before him and He made you live in Paradise with comfort and ease. Then you caused the people to get down to the earth because of your lapse. Adam said: Are you that Moses whom Allah selected for His Messengership and for His conversation with him and conferred upon you the tablets, in which everything was clearly explained and granted you the audience in order to have confidential talk with you. What is your opinion, how long Torah would haye been written before I was created? Moses said: Forty years before. Adam said: Did you not see these words: Adam committed an error and he was enticed to (do so). He (Moses) said: Yes. Whereupon, he (Adam) said: Do you then blame me for an act which Allah had ordained for me forty years before He created me? Allah's Messenger (may peace be upon him) said: This is how Adam came the better of Moses.",
      "chain": [
        "30410",
        "20157",
        "11834",
        "10627"
      ]
    },
    {
      "hadith_no": "6989",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا إسحاق بن موسى الأنصاري، حدثنا أنس بن عياض، حدثنا الحارث، - وهو ابن عبد الرحمن بن أبي ذباب - عن عطاء بن ميناء، عن أبي هريرة، قال قال النبي صلى الله عليه وسلم ‏\"‏ لا يقولن أحدكم اللهم اغفر لي إن شئت اللهم ارحمني إن شئت ‏.‏ ليعزم في الدعاء فإن الله صانع ما شاء لا مكره له ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      None of you should say to Allah (like this): O Allah, grant me mercy, if thou so likest. The supplication (of his) should (be permeated with) conviction (that it would be accepted by the Lord), for Allah is the Doer of (everything) He likes to do, and there is none to force Him (to do or not to do this or that).",
      "chain": [
        "30410",
        "20157",
        "11834",
        "11205",
        "13"
      ]
    },
    {
      "hadith_no": "7067",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "وحدثنا إسحاق بن موسى الأنصاري، حدثنا أنس بن عياض، حدثنا عبيد الله، حدثني سعيد بن أبي سعيد المقبري، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا أوى أحدكم إلى فراشه فليأخذ داخلة إزاره فلينفض بها فراشه وليسم الله فإنه لا يعلم ما خلفه بعده على فراشه فإذا أراد أن يضطجع فليضطجع على شقه الأيمن وليقل سبحانك اللهم ربي بك وضعت جنبي وبك أرفعه إن أمسكت نفسي فاغفر لها وإن أرسلتها فاحفظها بما تحفظ به عبادك الصالحين ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as say- ing:                      When any one of you goes to bed, he should take hold of the hem of his lower garment and then should clean (his bed) with the help of that and then should recite the name of Allah for he himself does tiot know what he left behind him on his bed, and when he intends to lie on bed, he should lie on his right side and utter these words:\" Hallowed be Allah, my Lord. It is with Thine (grace) that I place my side (upon the bed) and it is with Thee that I take it up (after sleep), and in case Thou withholdst my being (if thou causest me to die), then grant pardon to my being, and if Thou keepst (this process of breathing on), then protect it with that with which Thou protected Thine pious servants.\"",
      "chain": [
        "30410",
        "20157",
        "11201",
        "11168",
        "11212",
        "13"
      ]
    },
    {
      "hadith_no": "7658",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "وحدثنا إسحاق بن موسى الأنصاري، حدثنا أنس بن عياض، حدثني عبيد الله، بهذا الإسناد ‏.‏ مثله غير أنه قال فاستقوا من بئارها واعتجنوا به ‏.‏",
      "text_en": " This hadith has been narrated on the authority of 'Abdullah with the same chain of transmitters but with a slight variation of wording.",
      "chain": [
        "30410",
        "20157",
        "11201"
      ]
    },
    {
      "hadith_no": "2",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا إسحاق بن موسى الأنصاري، حدثنا معن بن عيسى القزاز، حدثنا مالك بن أنس، ح وحدثنا قتيبة، عن مالك، عن سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا توضأ العبد المسلم أو المؤمن فغسل وجهه خرجت من وجهه كل خطيئة نظر إليها بعينيه مع الماء أو مع آخر قطر الماء أو نحو هذا وإذا غسل يديه خرجت من يديه كل خطيئة بطشتها يداه مع الماء أو مع آخر قطر الماء حتى يخرج نقيا من الذنوب ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح وهو حديث مالك عن سهيل عن أبيه عن أبي هريرة ‏.‏ وأبو صالح والد سهيل هو أبو صالح السمان واسمه ذكوان ‏.‏ وأبو هريرة اختلف في اسمه فقالوا عبد شمس وقالوا عبد الله بن عمرو وهكذا قال محمد بن إسماعيل وهو الأصح ‏.‏ قال أبو عيسى وفي الباب عن عثمان بن عفان وثوبان والصنابحي وعمرو بن عبسة وسلمان وعبد الله بن عمرو ‏.‏ والصنابحي الذي روى عن أبي بكر الصديق ليس له سماع من رسول الله صلى الله عليه وسلم واسمه عبد الرحمن بن عسيلة ويكنى أبا عبد الله رحل إلى النبي صلى الله عليه وسلم فقبض النبي صلى الله عليه وسلم وهو في الطريق وقد روى عن النبي صلى الله عليه وسلم أحاديث ‏.‏ والصنابح بن الأعسر الأحمسي صاحب النبي صلى الله عليه وسلم يقال له الصنابحي أيضا وإنما حديثه قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ إني مكاثر بكم الأمم فلا تقتتلن بعدي ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah narrated that :                     Allah's Messenger said: \"When a Muslim, or believer, performs Wudu', washing his face, every evil that he looked at with his eyes leaves with the water - or with the last drop of water, or an expression similar to that - and when he washes his hands, every evil he did with his hands leaves with the water - or with the last drop of water - until he becomes free of sin.\"",
      "chain": [
        "30410",
        "30112",
        "20001",
        "30367",
        "20001",
        "11173",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "32",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا إسحاق بن موسى الأنصاري، حدثنا معن بن عيسى القزاز، حدثنا مالك بن أنس، عن عمرو بن يحيى، عن أبيه، عن عبد الله بن زيد، أن رسول الله صلى الله عليه وسلم مسح رأسه بيديه فأقبل بهما وأدبر بدأ بمقدم رأسه ثم ذهب بهما إلى قفاه ثم ردهما حتى رجع إلى المكان الذي بدأ منه ثم غسل رجليه ‏.‏ قال أبو عيسى وفي الباب عن معاوية والمقدام بن معديكرب وعائشة ‏.‏ قال أبو عيسى حديث عبد الله بن زيد أصح شيء في هذا الباب وأحسن وبه يقول الشافعي وأحمد وإسحاق ‏.‏",
      "text_en": " Abdullah bin Zaid narrated that:                     \"Allah's Messenger wiped over his head with his hands, going over the front with them and the rear. He began with the front of his head until they went to the nape of his neck. Then he brought them back again to the place where he began. Then he washed his feet.\"",
      "chain": [
        "30410",
        "30112",
        "20001",
        "11210",
        "11232",
        "605"
      ]
    },
    {
      "hadith_no": "92",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا إسحاق بن موسى الأنصاري، حدثنا معن، حدثنا مالك بن أنس، عن إسحاق بن عبد الله بن أبي طلحة، عن حميدة بنت عبيد بن رفاعة، عن كبشة بنت كعب بن مالك، وكانت، عند ابن أبي قتادة أن أبا قتادة، دخل عليها ‏.‏ قالت فسكبت له وضوءا قالت فجاءت هرة تشرب فأصغى لها الإناء حتى شربت قالت كبشة فرآني أنظر إليه فقال أتعجبين يا بنت أخي فقلت نعم ‏.‏ قال إن رسول الله صلى الله عليه وسلم قال ‏\"‏ إنها ليست بنجس إنما هي من الطوافين عليكم أو الطوافات ‏\"‏ ‏.‏ وهو قول أكثر العلماء من أصحاب النبي صلى الله عليه وسلم والتابعين ومن بعدهم مثل الشافعي وأحمد وإسحاق لم يروا بسؤر الهرة بأسا ‏.‏ وهذا أحسن شيء روي في هذا الباب ‏.‏ وقد جود مالك هذا الحديث عن إسحاق بن عبد الله بن أبي طلحة ولم يأت به أحد أتم من مالك ‏.‏",
      "text_en": " Humaidah bint Ubaid bin Rifa'ah narrated:                     \"Kabshah bint Ka'b bin Malik - she was (married) with Ibn Abi Qatadah - narrated \"That Abu Qatadah visited her, [so she said:] 'So I poured water for him to use for Wudu.' She said: 'A cat came to drink, so he lowered he container until it drank.' Kabshah said: 'So he saw me looking at it and said, \"O my niece! Are you surprised at that?\" So I said yes. He said: \"Indeed Allah's  Messenger said 'It is not impure, it is only one of those roam around among you.'\"",
      "chain": [
        "30410",
        "30112",
        "20001",
        "11151",
        "19957",
        "1155"
      ]
    },
    {
      "hadith_no": "186",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا إسحاق بن موسى الأنصاري، حدثنا معن، حدثنا مالك بن أنس، عن زيد بن أسلم، عن عطاء بن يسار، وعن بسر بن سعيد، وعن الأعرج، يحدثونه عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏\"‏ من أدرك من الصبح ركعة قبل أن تطلع الشمس فقد أدرك الصبح ومن أدرك من العصر ركعة قبل أن تغرب الشمس فقد أدرك العصر ‏\"‏ ‏.‏ وفي الباب عن عائشة ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن صحيح ‏.‏ وبه يقول أصحابنا والشافعي وأحمد وإسحاق ‏.‏ ومعنى هذا الحديث عندهم لصاحب العذر مثل الرجل ينام عن الصلاة أو ينساها فيستيقظ ويذكر عند طلوع الشمس وعند غروبها ‏.‏",
      "text_en": " Abu Hurairah narrated that :                     the Prophet said: \"Whoever catches a Rak'ah of Subh before the sun has risen, then he has caught Subh. Whoever catches a Rak'ah of Asr before the sun has set, then he has caught Asr.\"",
      "chain": [
        "30410",
        "30112",
        "20001",
        "11163",
        "11020",
        "11153",
        "13"
      ]
    },
    {
      "hadith_no": "208",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا إسحاق بن موسى الأنصاري، حدثنا معن، حدثنا مالك، ‏.‏ قال وحدثنا قتيبة، عن مالك، عن الزهري، عن عطاء بن يزيد الليثي، عن أبي سعيد، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا سمعتم النداء فقولوا مثل ما يقول المؤذن ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن أبي رافع وأبي هريرة وأم حبيبة وعبد الله بن عمرو وعبد الله بن ربيعة وعائشة ومعاذ بن أنس ومعاوية ‏.‏ قال أبو عيسى حديث أبي سعيد حديث حسن صحيح ‏.‏ وهكذا روى معمر وغير واحد عن الزهري مثل حديث مالك ‏.‏ وروى عبد الرحمن بن إسحاق عن الزهري هذا الحديث عن سعيد بن المسيب عن أبي هريرة عن النبي صلى الله عليه وسلم ‏.‏ ورواية مالك أصح ‏.‏",
      "text_en": " Abu Sa'eed narrated that :                     Allah's Messenger said: \"Whenyou hear the call (to prayer) then say the similar to what the Mu'adh-dhin says\"",
      "chain": [
        "30410",
        "30112",
        "30367",
        "20001",
        "11013",
        "11206",
        "38"
      ]
    },
    {
      "hadith_no": "216",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا إسحاق بن موسى الأنصاري، حدثنا معن، حدثنا مالك، عن ابن شهاب، عن سعيد بن المسيب، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن صلاة الرجل في الجماعة تزيد على صلاته وحده بخمسة وعشرين جزءا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Abu Hurairah narrated that :                     Allah's Messenger said: \"Indeed a man's Salat in the congregation is increased by twenty five rewards over his Salat alone.\"",
      "chain": [
        "30410",
        "30112",
        "20001",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "264",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا إسحاق بن موسى الأنصاري، حدثنا معن، حدثنا مالك بن أنس، ح وحدثنا قتيبة، عن مالك، عن نافع، عن إبراهيم بن عبد الله بن حنين، عن أبيه، عن علي بن أبي طالب، أن النبي صلى الله عليه وسلم نهى عن لبس القسي والمعصفر وعن تختم الذهب وعن قراءة القرآن في الركوع ‏.‏ قال وفي الباب عن ابن عباس ‏.‏ قال أبو عيسى حديث علي حديث حسن صحيح ‏.‏ وهو قول أهل العلم من أصحاب النبي صلى الله عليه وسلم والتابعين ومن بعدهم كرهوا القراءة في الركوع والسجود ‏.‏",
      "text_en": " Ali bin Abi Talib narrated:                     \"The Prophet prohibited wearing Qassi, and that which is dyed with safflower, and from the gold ring, and from reciting the Quran while bowing.\"",
      "chain": [
        "30410",
        "30112",
        "20001",
        "30367",
        "20001",
        "11014",
        "11150",
        "11181",
        "5"
      ]
    },
    {
      "hadith_no": "267",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا إسحاق بن موسى الأنصاري، حدثنا معن، حدثنا مالك، عن سمى، عن أبي صالح، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا قال الإمام سمع الله لمن حمده ‏.‏ فقولوا ربنا ولك الحمد فإنه من وافق قوله قول الملائكة غفر له ما تقدم من ذنبه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ والعمل عليه عند بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم ومن بعدهم أن يقول الإمام سمع الله لمن حمده ربنا ولك الحمد ‏.‏ ويقول من خلف الإمام ربنا ولك الحمد ‏.‏ وبه يقول أحمد ‏.‏ وقال ابن سيرين وغيره يقول من خلف الإمام سمع الله لمن حمده ربنا ولك الحمد ‏.‏ مثل ما يقول الإمام ‏.‏ وبه يقول الشافعي وإسحاق ‏.‏",
      "text_en": " Abu Hurairah narrated that :                     Allah's Messenger said: \"When the Imam says:  (Sami Allahu liman hamidah) 'Allah listens to those who praise Him. Then (all of you) say: (Rabbana wa lakal-hamd) 'O our Lord! And to You is the praise for whoever's saying concurs with the saying of the angels, then his past sins will be forgiven.\"",
      "chain": [
        "30410",
        "30112",
        "20001",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "313",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا إسحاق بن موسى الأنصاري، حدثنا معن، حدثنا مالك، عن أبي نعيم، وهب بن كيسان أنه سمع جابر بن عبد الله، يقول من صلى ركعة لم يقرأ فيها بأم القرآن فلم يصل إلا أن يكون وراء الإمام ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Abu Nu'aim Wahb bin Kaisan narated that he heard Jabir bin  'Abdullah saying:                      \"Whoever prayed a Rak'ah in which he did not recite Umm Al-Qur'an, then he did not pray except if he was behind an Imam.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.",
      "chain": [
        "30410",
        "30112",
        "20001",
        "20348",
        "11231",
        "34"
      ]
    },
    {
      "hadith_no": "336",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا إسحاق بن موسى الأنصاري، حدثنا معن، حدثنا مالك بن أنس، عن أبي النضر، عن بسر بن سعيد، أن زيد بن خالد الجهني، أرسله إلى أبي جهيم يسأله ماذا سمع من، رسول الله صلى الله عليه وسلم في المار بين يدى المصلي فقال أبو جهيم قال رسول الله صلى الله عليه وسلم ‏\"‏ لو يعلم المار بين يدى المصلي ماذا عليه لكان أن يقف أربعين خير له من أن يمر بين يديه ‏\"‏ ‏.‏ قال أبو النضر لا أدري قال أربعين يوما أو شهرا أو سنة قال أبو عيسى وفي الباب عن أبي سعيد الخدري وأبي هريرة وابن عمر وعبد الله بن عمرو ‏.‏ قال أبو عيسى وحديث أبي جهيم حديث حسن صحيح ‏.‏ وقد روي عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ لأن يقف أحدكم مائة عام خير له من أن يمر بين يدى أخيه وهو يصلي ‏\"‏ ‏.‏ والعمل عليه عند أهل العلم كرهوا المرور بين يدى المصلي ولم يروا أن ذلك يقطع صلاة الرجل ‏.‏ واسم أبي النضر سالم مولى عمر بن عبيد الله المديني ‏.‏",
      "text_en": " Zaid bin Khalid Al-Juhni sent a message to Abu Juhaim asking him what he had heard from Allah's Messenger about passing in front of a person who was performing Salat. Abu Juhaim said :                     that Allah's Messenger said: \"If the one who passed in front of the person performing Salat knew what he was doing, then for him to stop (and wait for forty) would be better for him than to pass in front of him.\"",
      "chain": [
        "30410",
        "30112",
        "20001",
        "11164",
        "11153",
        "3625"
      ]
    },
    {
      "hadith_no": "439",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا إسحاق بن موسى الأنصاري، حدثنا معن، حدثنا مالك، عن سعيد بن أبي سعيد المقبري، عن أبي سلمة، أنه أخبره أنه، سأل عائشة كيف كانت صلاة رسول الله صلى الله عليه وسلم بالليل في رمضان فقالت ما كان رسول الله صلى الله عليه وسلم يزيد في رمضان ولا في غيره على إحدى عشرة ركعة يصلي أربعا فلا تسأل عن حسنهن وطولهن ثم يصلي أربعا فلا تسأل عن حسنهن وطولهن ثم يصلي ثلاثا ‏.‏ فقالت عائشة فقلت يا رسول الله أتنام قبل أن توتر فقال ‏\"‏ يا عائشة إن عينى تنامان ولا ينام قلبي ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Sa'eed bin Abi Sa'eed Al-Maqburi narrated that:                     Sa'eed bin Abi Sa'eed Al-Maqburi narrated that Abu Salamah informed him that he had asked Aishah: \"How was the Salat of Allah's Messenger (A) [at night] during Ramadan?\" She said: \"Allah's Messenger (S) would pray - neither in Ramadan nor in any other month - more than eleven Rak'ah. He would pray four, and do not ask about their excellence or length, then he would pray four, and do not ask about their excellence or length, then he would pray three.\" Aishah said: \"I asked: 'O Messenger of Allah! Do you sleep before having performed Witr?\" He said: 'O Aishah! Indeed my eyes sleep but my heart does not sleep.'\"",
      "chain": [
        "30410",
        "30112",
        "20001",
        "11168",
        "10567"
      ]
    },
    {
      "hadith_no": "440",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا إسحاق بن موسى الأنصاري، حدثنا معن بن عيسى، حدثنا مالك، عن ابن شهاب، عن عروة، عن عائشة، أن رسول الله صلى الله عليه وسلم كان يصلي من الليل إحدى عشرة ركعة يوتر منها بواحدة فإذا فرغ منها اضطجع على شقه الأيمن ‏.‏",
      "text_en": " Aishah narrated:                     \"Allah's Messenger (S) would pray eleven Rak'ah at night, making them off with one. When he finished them he would lay down on his right side.\"",
      "chain": [
        "30410",
        "30112",
        "20001",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "491",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on the Day of Friday - كِتَاب الْجُمُعَةِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
      "chapter_no": "4",
      "text_ar": "حدثنا إسحاق بن موسى الأنصاري، حدثنا معن، حدثنا مالك بن أنس، عن يزيد بن عبد الله بن الهاد، عن محمد بن إبراهيم، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ خير يوم طلعت فيه الشمس يوم الجمعة فيه خلق آدم وفيه أدخل الجنة وفيه أهبط منها وفيه ساعة لا يوافقها عبد مسلم يصلي فيسأل الله فيها شيئا إلا أعطاه إياه ‏\"‏ ‏.‏ قال أبو هريرة فلقيت عبد الله بن سلام فذكرت له هذا الحديث فقال أنا أعلم بتلك الساعة ‏.‏ فقلت أخبرني بها ولا تضنن بها على قال هي بعد العصر إلى أن تغرب الشمس ‏.‏ فقلت كيف تكون بعد العصر وقد قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يوافقها عبد مسلم وهو يصلي ‏\"‏ ‏.‏ وتلك الساعة لا يصلى فيها فقال عبد الله بن سلام أليس قد قال رسول الله صلى الله عليه وسلم ‏\"‏ من جلس مجلسا ينتظر الصلاة فهو في صلاة ‏\"‏ ‏.‏ قلت بلى ‏.‏ قال فهو ذاك ‏.‏ قال أبو عيسى وفي الحديث قصة طويلة ‏.‏ قال أبو عيسى وهذا حديث حسن صحيح ‏.‏ قال ومعنى قوله ‏\"‏ أخبرني بها ولا تضنن بها على ‏\"‏ ‏.‏ لا تبخل بها على والضن البخل والظنين المتهم ‏.‏",
      "text_en": " Abu Hurairah narrated:                     \"Allah's Messenger said: The best day that the sun has risen upon is Friday. On it Adam was created, on it he entered Paradise, and on it, he was sent down from it. And in it there is an hour in which the Muslim worshipper would not stand in Salat, asking Allah for anything except that He would give it to him.'\" Abu Hurairah said: \"I met Abdullah bin Salam, and I mentioned this Hadith to him. He said: 'I am more knowledgeable about that hour.' So I said: 'Inform me about it, and do not keep any of it from me.' He said: 'It is after al-Asr until the sun has set.' I said: 'How can it be after Al-Asr when Allah's Messenger said: ' the Muslim worshipper would not stand in Salat.' And that is a time that prayer is not performed in?\" So Abdullah bin Salam said: 'Didn't Allah's Messenger say: \"Whoever sat in a gathering awaiting the Salat then he is in Salat\"? I said: 'Of course.' He said: 'Then that is it.'\"",
      "chain": [
        "30410",
        "30112",
        "20001",
        "11234",
        "11213",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "499",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on the Day of Friday - كِتَاب الْجُمُعَةِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
      "chapter_no": "4",
      "text_ar": "حدثنا إسحاق بن موسى الأنصاري، حدثنا معن، حدثنا مالك، عن سمى، عن أبي صالح، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من اغتسل يوم الجمعة غسل الجنابة ثم راح فكأنما قرب بدنة ومن راح في الساعة الثانية فكأنما قرب بقرة ومن راح في الساعة الثالثة فكأنما قرب كبشا أقرن ومن راح في الساعة الرابعة فكأنما قرب دجاجة ومن راح في الساعة الخامسة فكأنما قرب بيضة فإذا خرج الإمام حضرت الملائكة يستمعون الذكر ‏\"‏ ‏.‏ قال وفي الباب عن عبد الله بن عمرو وسمرة ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن صحيح ‏.‏",
      "text_en": " Abu Hurairah narrated that :                     Allah's Messenger said: \"Whoever performs Ghusl on Friday - the Ghusl for Janabah - then he goes, he is like one who gave a camel in charity. Whoever goes in the second hour then he is like one who gave a cow in charity. Whoever goes in the third hour then he is like the one who have a ram in charity. Whoever goes in the fourth hour then he is like the one who gave a chicken in charity. Whoever goes in the fifth hour, then he is like one who gave an egg in charity. When the Imam comes out, the angels are present listening to the remembrance.\"",
      "chain": [
        "30410",
        "30112",
        "20001",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "534",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on the Two Eids - أَبْوَابُ الْعِيدَيْنِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
      "chapter_no": "5",
      "text_ar": "حدثنا إسحاق بن موسى الأنصاري، حدثنا معن بن عيسى، حدثنا مالك بن أنس، عن ضمرة بن سعيد المازني، عن عبيد الله بن عبد الله بن عتبة، أن عمر بن الخطاب، سأل أبا واقد الليثي ما كان رسول الله صلى الله عليه وسلم يقرأ به في الفطر والأضحى قال كان يقرأ ب‏(‏ق والقرآن المجيد ‏)‏ ‏(‏اقتربت الساعة وانشق القمر ‏)‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Ubaidullah bin Abdullah bin Utbah narrated:                     \"Umar bin Al-Khattab asked Abu Waqid Al-Laithi what Allah's Messenger would recite during Al-Fitr and Al-Adha, so he said: 'He would recite: Qaf, By the Glorious Quran and the Hour has drawn near, and the moon has been cleft asunder.'\"",
      "chain": [
        "30410",
        "30112",
        "20001",
        "11861",
        "11004",
        "3",
        "4044"
      ]
    },
    {
      "hadith_no": "676",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Zakat - كتاب الزكاة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "7",
      "text_ar": "حدثنا إسحاق بن موسى الأنصاري، حدثنا معن، حدثنا مالك، عن نافع، عن عبد الله بن عمر، أن رسول الله صلى الله عليه وسلم فرض زكاة الفطر من رمضان صاعا من تمر أو صاعا من شعير على كل حر أو عبد ذكر أو أنثى من المسلمين ‏.‏ قال أبو عيسى حديث ابن عمر حديث حسن صحيح ‏.‏ وروى مالك عن نافع عن ابن عمر عن النبي صلى الله عليه وسلم نحو حديث أيوب وزاد فيه من المسلمين ‏.‏ ورواه غير واحد عن نافع ولم يذكر فيه من المسلمين ‏.‏ واختلف أهل العلم في هذا فقال بعضهم إذا كان للرجل عبيد غير مسلمين لم يؤد عنهم صدقة الفطر ‏.‏ وهو قول مالك والشافعي وأحمد ‏.‏ وقال بعضهم يؤدي عنهم وإن كانوا غير مسلمين ‏.‏ وهو قول الثوري وابن المبارك وإسحاق ‏.‏",
      "text_en": " Ibn Umar narrated:                     \"The Messenger of Allah made Sadaqatul-Fitr of Ramadan an obligation - a Sa of dried dates or a Sa of barley - required upon every free person and slave, male and female among the Muslims.\"",
      "chain": [
        "30410",
        "30112",
        "20001",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "700",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا إسحاق بن موسى الأنصاري، حدثنا الوليد بن مسلم، عن الأوزاعي، عن قرة بن عبد الرحمن، عن الزهري، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ قال الله عز وجل أحب عبادي إلى أعجلهم فطرا ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah narrated that :                     the Messenger of Allah said: \"Allah, Mighty and Sublime is He, said: 'Those of My worshippers who are most beloved to me are the quickest to break their fast.'\"",
      "chain": [
        "30410",
        "20733",
        "20024",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1006",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا قتيبة، عن مالك، قال وحدثنا إسحاق بن موسى، حدثنا معن، حدثنا مالك، عن عبد الله بن أبي بكر بن محمد بن عمرو بن حزم، عن أبيه، عن عمرة، أنها أخبرته أنها، سمعت عائشة، وذكر، لها أن ابن عمر، يقول إن الميت ليعذب ببكاء الحى عليه ‏.‏ فقالت عائشة غفر الله لأبي عبد الرحمن أما إنه لم يكذب ولكنه نسي أو أخطأ إنما مر رسول الله صلى الله عليه وسلم على يهودية يبكى عليها فقال ‏\"‏ إنهم ليبكون عليها وإنها لتعذب في قبرها ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث صحيح ‏.‏",
      "text_en": " Abdullah bin Abi Bakr - and he is Ibn Muhammad bin Amr bin Hazm - narrated from his father, that:                     Amrah informed him that she heard Aishah, while it was being mentioned to her that Ibn Umar had said that the deceased would be punished for the crying of the living (over him). So Aishah said: 'May Allah forgive Abu Abdur-Rahman. He has not lied, but he is mistaken in the understanding. Rather, the Messenger of Allah passed by a Jewish woman who was being cried over, so he said: 'They are crying over her and she is being punished in her grave.'\"",
      "chain": [
        "30367",
        "20001",
        "30410",
        "30112",
        "20001",
        "11104",
        "11239",
        "11455",
        "53",
        "18"
      ]
    },
    {
      "hadith_no": "1124",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Marriage - كتاب النكاح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "11",
      "text_ar": "حدثنا إسحاق بن موسى الأنصاري، حدثنا معن، حدثنا مالك، عن نافع، عن ابن عمر، أن النبي صلى الله عليه وسلم نهى عن الشغار ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ والعمل على هذا عند عامة أهل العلم لا يرون نكاح الشغار ‏.‏ والشغار أن يزوج الرجل ابنته على أن يزوجه الآخر ابنته أو أخته ولا صداق بينهما ‏.‏ وقال بعض أهل العلم نكاح الشغار مفسوخ ولا يحل وإن جعل لهما صداقا ‏.‏ وهو قول الشافعي وأحمد وإسحاق ‏.‏ وروي عن عطاء بن أبي رباح أنه قال يقران على نكاحهما ويجعل لهما صداق المثل ‏.‏ وهو قول أهل الكوفة ‏.‏",
      "text_en": " Ibn Umar narrated:                     \"The Prophet prohibited Shighar.\"",
      "chain": [
        "30410",
        "30112",
        "20001",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1179",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Suckling - كتاب الرضاع",
      "chapter_no": "12",
      "text_ar": "حدثنا بندار، حدثنا يحيى بن سعيد القطان، حدثنا مالك، ح وحدثنا إسحاق بن موسى الأنصاري، قال حدثنا معن، قال حدثنا مالك، عن عبد الله بن دينار، عن سليمان بن يسار، عن عروة بن الزبير، عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله حرم من الرضاعة ما حرم من الولادة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ والعمل على هذا عند أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم لا نعلم بينهم في ذلك اختلافا ‏.‏",
      "text_en": " Aishah narrated that the Messenger of Allah said:                      “Indeed Allah has made unlawful through suckling whatever He made unlawful through birth.”",
      "chain": [
        "30160",
        "20031",
        "20001",
        "30410",
        "30112",
        "20001",
        "11183",
        "11005",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1433",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Legal Punishments (Al-Hudud) - كتاب الحدود عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "17",
      "text_ar": "حدثنا إسحاق بن موسى الأنصاري، حدثنا معن، حدثنا مالك، عن ابن شهاب، عن عبيد الله بن عبد الله، عن أبي هريرة، وزيد بن خالد الجهني، عن النبي صلى الله عليه وسلم نحوه بمعناه ‏.‏",
      "text_en": " (Another chain) with similar.",
      "chain": [
        "30410",
        "30112",
        "20001",
        "11013",
        "11004",
        "13",
        "3625"
      ]
    },
    {
      "hadith_no": "1436",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Legal Punishments (Al-Hudud) - كتاب الحدود عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "17",
      "text_ar": "حدثنا إسحاق بن موسى الأنصاري، حدثنا معن، حدثنا مالك بن أنس، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم رجم يهوديا ويهودية ‏.‏ قال أبو عيسى وفي الحديث قصة وهذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     That the Messenger of Allah (ﷺ) stoned a Jew and Jewess.",
      "chain": [
        "30410",
        "30112",
        "20001",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1645",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Virtues of Jihad - كتاب فضائل الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "22",
      "text_ar": "حدثنا إسحاق بن موسى الأنصاري، حدثنا معن، حدثنا مالك، عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك، أنه سمعه يقول كان رسول الله صلى الله عليه وسلم يدخل على أم حرام بنت ملحان فتطعمه وكانت أم حرام تحت عبادة بن الصامت فدخل عليها رسول الله صلى الله عليه وسلم يوما فأطعمته وجلست تفلي رأسه فنام رسول الله صلى الله عليه وسلم ثم استيقظ وهو يضحك قالت فقلت ما يضحكك يا رسول الله قال ‏\"‏ ناس من أمتي عرضوا على غزاة في سبيل الله يركبون ثبج هذا البحر ملوك على الأسرة أو مثل الملوك على الأسرة ‏\"‏ ‏.‏ قلت يا رسول الله ادع الله أن يجعلني منهم ‏.‏ فدعا لها ثم وضع رأسه فنام ثم استيقظ وهو يضحك قالت فقلت له ما يضحكك يا رسول الله قال ‏\"‏ ناس من أمتي عرضوا على غزاة في سبيل الله ‏\"‏ ‏.‏ نحو ما قال في الأول قالت فقلت يا رسول الله ادع الله أن يجعلني منهم ‏.‏ قال ‏\"‏ أنت من الأولين ‏\"‏ ‏.‏ قال فركبت أم حرام البحر في زمان معاوية بن أبي سفيان فصرعت عن دابتها حين خرجت من البحر فهلكت ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وأم حرام بنت ملحان هي أخت أم سليم وهي خالة أنس بن مالك ‏.‏",
      "text_en": " Narrated Ishaq bin 'Abdullah bin Abi Talhah:                     That he heard Anas [bin Malik] saying: \"The Messenger of Allah (ﷺ) used to visit Umm Haram bint Milhan, who would offer him meals. Umm Haram was the wife of 'Ubadah bin As-Samit. Once the Messenger of Allah (ﷺ) visited her and she provide him with some food and started inspecting this head for lice. Then the Messenger of Allah (ﷺ) slept and afterwards he awoke smiling. She said: 'I said: \"What causes you to smile, O the Messenger of Allah (ﷺ) ?\" He said: \"Some of my followers who were displayed before me )in a dream) as fighters in Allah's cause, riding on a ship this ocean who were kings upon thrones, or like kings upon thrones.\" I said: \"O Messenger of Allah! Supplicate to Allah to make me among them.'\" So he supplicated for her. Then he lay down his head to sleep. Then he woke up and he was smiling. She said: 'So I said to him: \"What causes you to smile, O the Messenger of Allah (ﷺ)?\" He said: \"Some of my followers who were displayed before me (in a dream) as fighters in Allah's cause,\" and he said similar to what he said earlier. She said: 'I said: \"O Messenger of Allah! Supplicate to Allah to make me among them.\" He said: \"You are the earlier ones.'\" He said: \"So Umm Haram rode on the sea during the time of Mu'awiyah bin Abu Sufyan. She was thrown from the riding animal after she arrived from the ocean voyage, and she died.\" [Abu 'Eisa said:] This Hadith is Hasan Sahih. Umm Haram bint Milhan is the daughter of Umm Sulaim, the maternal aunt of Anas bin Malik.",
      "chain": [
        "30410",
        "30112",
        "20001",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "1674",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jihad - كتاب الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "23",
      "text_ar": "حدثنا إسحاق بن موسى الأنصاري، حدثنا معن، حدثنا مالك، عن عبد الرحمن بن حرملة، عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ الراكب شيطان والراكبان شيطانان والثلاثة ركب ‏\"‏ ‏.‏ قال أبو عيسى حديث ابن عمر حديث حسن صحيح لا نعرفه إلا من هذا الوجه من حديث عاصم وهو ابن محمد بن زيد بن عبد الله بن عمر وحديث عبد الله بن عمرو حديث حسن ‏.‏ قال محمد هو ثقة صدوق وعاصم بن عمر العمري ضعيف في الحديث لا أروي عنه شيئا ‏.‏ وحديث عبد الله بن عمرو حديث حسن",
      "text_en": " Narrated 'Amr bin Shu'aib:                     From his father, from his grandfather that the Messenger of Allah (ﷺ) said: \"The (lone) rider is a Shaitan, and two raiders are two Shaitan. Three is a travelling party.[Abu 'Eisa said:] The Hadith of Ibn 'Umar (no, 1673) is  Hasan Sahih. We do not know of it except from this route ; as a narration of 'Asim. And he is Ibn Muhammad bin Zaid bin 'Abdullah bin 'Umar. Muhammad said: \"He is trustworthy, truthful. And 'Asim bin 'Umar Al-'Umari is weak in Hadith, I do not report anything from him.\" The Hadith of 'Abdullah bin 'Amr (no. 1674) is better.",
      "chain": [
        "30410",
        "30112",
        "20001",
        "11878",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "1750",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Clothing - كتاب اللباس",
      "chapter_no": "24",
      "text_ar": "حدثنا إسحاق بن موسى الأنصاري، حدثنا معن، حدثنا مالك، عن أبي النضر، عن عبيد الله بن عتبة، أنه دخل على أبي طلحة الأنصاري يعوده ‏.‏ قال فوجدت عنده سهل بن حنيف ‏.‏ قال فدعا أبو طلحة إنسانا ينزع نمطا تحته فقال له سهل لم تنزعه فقال لأن فيه تصاوير وقد قال النبي صلى الله عليه وسلم ما قد علمت ‏.‏ قال سهل أولم يقل ‏\"‏ إلا ما كان رقما في ثوب ‏\"‏ فقال بلى ولكنه أطيب لنفسي ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Abu An-Nadr:                     From 'Ubaidullah bin 'Abdullah bin 'Utbah, that he entered upon Abu Talhah Al-Ansari to pay him a visit (while he was ill), and he found Sahl bin Hunaif with him. He said: \"Abu Talhah called for someone to remove a sheet that was under him. Sahl said to him: 'Why did you remove it?' He replied: 'Because it contains images on it, and the Prophet (ﷺ) said about them what you know.' Sahl said: 'Do he not say: Except for markings on a garment?' He said: 'Yes, but this is better to me.'\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.",
      "chain": [
        "30410",
        "30112",
        "20001",
        "11164"
      ]
    },
    {
      "hadith_no": "1819",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا إسحاق بن موسى الأنصاري، حدثنا معن، حدثنا مالك، عن سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم ضافه ضيف كافر فأمر له رسول الله صلى الله عليه وسلم بشاة فحلبت فشرب ثم أخرى فشربه ثم أخرى فشربه حتى شرب حلاب سبع شياه ثم أصبح من الغد فأسلم فأمر له رسول الله صلى الله عليه وسلم بشاة فحلبت فشرب حلابها ثم أمر له بأخرى فلم يستتمها فقال رسول الله صلى الله عليه وسلم ‏\"‏ المؤمن يشرب في معى واحد والكافر يشرب في سبعة أمعاء ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من حديث سهيل ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     \"The Messenger of Allah (ﷺ) had a disbeliever as a guest. So the Messenger of Allah (ﷺ) ordered that a sheep be milked so he could drink. Then another was milked so he could drink, then another, so he drank until he had drank the milk of seven sheep. The he awoke the next morning and accepted Islam.  The Messenger of Allah (ﷺ) ordered that a sheep be milked so he could drink its milk, then he ordered for another but he could not finish it. So the Messenger of Allah (ﷺ) said: 'The believer drinks with one intestine and the disbeliever drinks with seven.'\"[Abu 'Eisa said:] This Hadith is Sahih Hasan Gharib as a narration of Suhail.",
      "chain": [
        "30410",
        "30112",
        "20001",
        "11173",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "1863",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Drinks - كتاب الأشربة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "26",
      "text_ar": "حدثنا إسحاق بن موسى الأنصاري، حدثنا معن، حدثنا مالك بن أنس، عن ابن شهاب، عن أبي سلمة، عن عائشة، أن النبي صلى الله عليه وسلم سئل عن البتع فقال ‏\"‏ كل شراب أسكر فهو حرام ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated 'Aishah:                     That the Prophet (ﷺ) was asked about Bit' so he said: \"All drinks that intoxicate are unlawful.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.",
      "chain": [
        "30410",
        "30112",
        "20001",
        "11013",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "2224",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Medicine - كتاب الطب عن رسول اللَّهِ صلى الله عليه وسلم",
      "chapter_no": "28",
      "text_ar": "حدثنا إسحاق بن موسى الأنصاري، حدثنا معن، حدثنا مالك، عن يزيد بن خصيفة، عن عمرو بن عبد الله بن كعب السلمي، أن نافع بن جبير بن مطعم، أخبره عن عثمان بن أبي العاصي، أنه قال أتاني رسول الله صلى الله عليه وسلم وبي وجع قد كان يهلكني فقال رسول الله صلى الله عليه وسلم ‏\"‏ امسح بيمينك سبع مرات وقل أعوذ بعزة الله وقوته من شر ما أجد ‏\"‏ ‏.‏ قال ففعلت فأذهب الله ما كان بي فلم أزل آمر به أهلي وغيرهم ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " 'Uthman bin Abi Al-'As narrated:                     \"The Messenger of Allah (S.A.W) came to me while I had a pain that almost ruined me. So,the Messenger of Allah(S.A.W) said: 'Rub it with your right hand seven times and say A'udhu bi 'Izzatillah Wa Qudratihi wa Sultanihi min sharri ma ajid.\" (\"I seek refuge in Allah's might, power, an authority, from the evil of what I suffer.)\"He said: \"So I did it, and Allah removed what I had, and I never seized telling my family and others to do it.\"",
      "chain": [
        "30410",
        "30112",
        "20001",
        "11235",
        "11059"
      ]
    },
    {
      "hadith_no": "2674",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا إسحاق بن موسى الأنصاري، حدثنا محمد بن معن المدني الغفاري، حدثني أبي، عن سعيد المقبري، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ الطاعم الشاكر بمنزلة الصائم الصابر ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Abu Hurairah narrated that the Prophet(s.a.w) said:                     \"The one who eats and is grateful is like the status of the patient fasting person.\"",
      "chain": [
        "30410",
        "20180",
        "11724",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "2680",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Knowledge - كتاب العلم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "41",
      "text_ar": "حدثنا الحسن بن الصباح البزار، وإسحاق بن موسى الأنصاري، قالا حدثنا سفيان بن عيينة، عن ابن جريج، عن أبي الزبير، عن أبي صالح، عن أبي هريرة، رواية ‏\"‏ يوشك أن يضرب الناس، أكباد الإبل يطلبون العلم فلا يجدون أحدا أعلم من عالم المدينة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن وهو حديث ابن عيينة ‏.‏ وقد روي عن ابن عيينة أنه قال في هذا سئل من عالم المدينة فقال إنه مالك بن أنس ‏.‏ وقال إسحاق بن موسى سمعت ابن عيينة يقول هو العمري عبد الله بن عبد العزيز الزاهد ‏.‏ وسمعت يحيى بن موسى يقول قال عبد الرزاق هو مالك بن أنس ‏.‏ والعمري هو عبد الله بن عبد العزيز من ولد عمر بن الخطاب ‏.‏",
      "text_en": " Narrated Abu Salih reported a narration from Abu Hurairah:                     \"It shall soon be that people are beating the livers of camels (meaning that they are hastening and traveling upon them) seeking knowledge. But they will not find anyone more knowledgeable than a scholar of Al-Madinah.\"",
      "chain": [
        "30244",
        "30410",
        "20005",
        "11070",
        "11263",
        "11161"
      ]
    },
    {
      "hadith_no": "2734",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Seeking Permission - كتاب الاستئذان والآداب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "42",
      "text_ar": "حدثنا إسحاق بن موسى الأنصاري، حدثنا معن، حدثنا مالك، عن أبي النضر، أن أبا مرة، مولى أم هانئ بنت أبي طالب أخبره أنه، سمع أم هانئ، تقول ذهبت إلى رسول الله صلى الله عليه وسلم عام الفتح فوجدته يغتسل وفاطمة تستره بثوب قالت فسلمت فقال ‏\"‏ من هذه ‏\"‏ ‏.‏ قلت أنا أم هانئ فقال ‏\"‏ مرحبا بأم هانئ ‏\"‏ ‏.‏ قال فذكر في الحديث قصة طويلة هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Umm Hani:                     \"I went to the Messenger of Allah (ﷺ) during the Year of the Conquest, and I found him performing Ghusl, while Fatimah was screening him with a garment. She said: \"So I gave Salam and he said: 'Who is this?' I said: 'I am Umm Hani.' He said: 'Welcome Umm Hani'\"",
      "chain": [
        "30410",
        "30112",
        "20001",
        "11164",
        "11237"
      ]
    },
    {
      "hadith_no": "3091",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا إسحاق بن موسى الأنصاري، حدثنا عبد الله بن وهب، عن عبد الجبار بن عمر، عن محمد بن المنكدر، عن جابر، قال نهى رسول الله صلى الله عليه وسلم أن ينام الرجل على سطح ليس بمحجور عليه ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه من حديث محمد بن المنكدر عن جابر إلا من هذا الوجه ‏.‏ وعبد الجبار بن عمر الأيلي يضعف ‏.‏",
      "text_en": " Narrated Jabir:                     \"The Messenger of Allah (ﷺ) prohibited that a man sleep on a terrace without something to obstruct him (so that he will not roll off and fall).\"",
      "chain": [
        "30410",
        "20029",
        "28317",
        "11048",
        "34"
      ]
    },
    {
      "hadith_no": "3106",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Parables - كتاب الأمثال عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "44",
      "text_ar": "حدثنا إسحاق بن موسى الأنصاري، حدثنا معن، حدثنا مالك، عن عبد الله بن دينار، عن ابن عمر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن من الشجر شجرة لا يسقط ورقها وهي مثل المؤمن حدثوني ما هي ‏\"‏ ‏.‏ قال عبد الله فوقع الناس في شجر البوادي ووقع في نفسي أنها النخلة ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ هي النخلة ‏\"‏ ‏.‏ فاستحييت أن أقول قال عبد الله فحدثت عمر بالذي وقع في نفسي ‏.‏ فقال لأن تكون قلتها أحب إلى من أن يكون لي كذا وكذا ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وفي الباب عن أبي هريرة رضى الله عنه ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     that the Messenger of Allah (ﷺ) said: \"Indeed there is a tree that does not shed its foilage, and it is is similar to the believer. Can any of you tell me what it is?\" 'Abdullah said: \"The people started thinking about the trees of the desert. And it occurred to me that it may be the date-palm.\" Then the Prophet (ﷺ) said: \"It is the date-palm.\" But I was shy - meaning to say anything.\" 'Abdullah said: \"So I informed 'Umar about what I had thought of, and he said: 'If you had said it, that would be more beloved to me than this or that.'\"",
      "chain": [
        "30410",
        "30112",
        "20001",
        "11183",
        "18"
      ]
    },
    {
      "hadith_no": "3111",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Parables - كتاب الأمثال عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "44",
      "text_ar": "حدثنا إسحاق بن موسى، حدثنا معن، حدثنا مالك، عن عبد الله بن دينار، عن ابن عمر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إنما أجلكم فيما خلا من الأمم كما بين صلاة العصر إلى مغارب الشمس وإنما مثلكم ومثل اليهود والنصارى كرجل استعمل عمالا فقال من يعمل لي إلى نصف النهار على قيراط قيراط فعملت اليهود على قيراط قيراط فقال من يعمل لي من نصف النهار إلى العصر على قيراط قيراط فعملت النصارى على قيراط قيراط ثم أنتم تعملون من صلاة العصر إلى مغارب الشمس على قيراطين قيراطين فغضبت اليهود والنصارى وقالوا نحن أكثر عملا وأقل عطاء ‏.‏ قال هل ظلمتكم من حقكم شيئا قالوا لا ‏.‏ قال فإنه فضلي أوتيه من أشاء ‏\"‏ ‏.‏ هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     that the Messenger of Allah (ﷺ) said: \"Your period in comparison to the periods of the previous nations, is like the period between Salat Al-'Asr until sunset. And you are in comparison to the Jews and Christians, like a man who employeed some workers and he said: 'Who will work for me until Midday for a Qirat each?' So the Jews worked for half a day for a Qirat each. Then he said: 'Who will work for me from the middle of the day until Salat Al-'Asr for a Qirat each?' So the Christians worked for a Qirat each. Then it is you who are doing the work from Salat Al-'Asr until the setting of the sun for two Qirats each. So the Jews and the Christians got angry and said: 'We did more work but were given less?' So He (Allah) says: 'Have I wronged you in any of your rights?' They said: 'No.' He says: 'Then it is my blessing that I give to whomever I wish.'\"",
      "chain": [
        "30410",
        "30112",
        "20001",
        "11183",
        "18"
      ]
    },
    {
      "hadith_no": "3526",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا إسحاق بن موسى الأنصاري، حدثنا معن، حدثنا مالك بن أنس، عن نعيم بن عبد الله المجمر، أن محمد بن عبد الله بن زيد الأنصاري، وعبد الله بن زيد الذي، كان أري النداء بالصلاة أخبره عن أبي مسعود الأنصاري، أنه قال أتانا رسول الله صلى الله عليه وسلم ونحن في مجلس سعد بن عبادة فقال له بشير بن سعد أمرنا الله أن نصلي عليك فكيف نصلي عليك قال فسكت رسول الله صلى الله عليه وسلم حتى تمنينا أنه لم يسأله ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ قولوا اللهم صل على محمد وعلى آل محمد كما صليت على آل إبراهيم وبارك على محمد وعلى آل محمد كما باركت على آل إبراهيم في العالمين إنك حميد مجيد والسلام كما قد علمتم ‏\"‏ ‏.‏ قال وفي الباب عن علي وأبي حميد وكعب بن عجرة وطلحة بن عبيد الله وأبي سعيد وزيد بن خارجة ويقال ابن جارية وبريدة ‏.‏ قال هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Abu Mas'ud Al-Ansari:                     \"The Messenger of Allah (ﷺ) came to us while we were sitting in a gathering of Sa'd bin 'Ubadah. Bashir bin Sa'd said: 'Allah ordered us to say Salat upon you, so how do we say Salat upon you?'\" The Messenger of Allah (ﷺ) was silent, until we thought that we had not even asked him. Then the Messenger of Allah (ﷺ) said: 'Say: O Allah! Send Salat upon Muhammad and upon Muhammad's family just as you have sent [upon Ibrahim and] upon Ibrahim's family. And bless Muhammad and Muhammad's family just as you have blessed [Ibrahim and] Ibrahim's family among the nations. Indeed you are praised, the glorious.' And the Salam is as you have learned.'\"",
      "chain": [
        "30410",
        "30112",
        "20001",
        "11225",
        "10615",
        "402"
      ]
    },
    {
      "hadith_no": "3468",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا إسحاق بن موسى الأنصاري، حدثنا معن، حدثنا مالك، عن سمى، عن أبي صالح، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من قال لا إله إلا الله وحده لا شريك له له الملك وله الحمد يحيي ويميت وهو على كل شيء قدير في يوم مائة مرة كانت له عدل عشر رقاب وكتبت له مائة حسنة ومحيت عنه مائة سيئة وكان له حرزا من الشيطان يومه ذلك حتى يمسي ولم يأت أحد بأفضل مما جاء به إلا أحد عمل أكثر من ذلك ‏\"‏ ‏.‏ وبهذا الإسناد عن النبي صلى الله عليه وسلم قال ‏\"‏ من قال سبحان الله وبحمده مائة مرة حطت خطاياه وإن كانت أكثر من زبد البحر ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح.",
      "text_en": " Abu Hurairah narrates that:                     The Mesenger of Allah said: “Whoever says: ‘There is none worthy of worship except Allah, Alone, without partner, to Him belongs all that exists and to Him belongs the praise, He gives life and causes death, and He is Powerful over all things, (La Ilaha Illallah, Wahdahu La Sharika Lahi, Lahul-Mulku Wa Lahul-Hamdu, Yuhyi Wa Yumitu, Wa Huwa Ala Kulli Shai’in Qadir)’ a hundred times in a day, it will be for him the quivalent of freeing ten slaves, and there shall be written for him a hundred good deeds, and a hundred bad deeds shall be wiped out for him, and it will be a protection for him from Shaitan on that day, until he reaches the evening. And none has brought better than it, except for one who has done more than that.”And with this chain, from the Prophet, that he said: “Whoever says: ‘Glory is to Allah, and with His Praise (Subhan Allah, Wa Bihamdih)’ a hundred times, his sins are forgiven, even if they were like the foam of the sea.”",
      "chain": [
        "30410",
        "30112",
        "20001",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "3990",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا إسحاق بن موسى الأنصاري، حدثنا معن، قال عرضت على مالك بن أنس عن إسحاق بن عبد الله بن أبي طلحة، أنه سمع أنس بن مالك، يقول قال أبو طلحة لأم سليم لقد سمعت صوت، رسول الله صلى الله عليه وسلم - يعني ضعيفا - أعرف فيه الجوع فهل عندك من شيء فقالت نعم ‏.‏ فأخرجت أقراصا من شعير ثم أخرجت خمارا لها فلفت الخبز ببعضه ثم دسته في يدي وردتني ببعضه ثم أرسلتني إلى رسول الله صلى الله عليه وسلم قال فذهبت به إليه فوجدت رسول الله صلى الله عليه وسلم جالسا في المسجد ومعه الناس قال فقمت عليهم فقال رسول الله صلى الله عليه وسلم ‏\"‏ أرسلك أبو طلحة ‏\"‏ ‏.‏ فقلت نعم ‏.‏ قال ‏\"‏ بطعام ‏\"‏ ‏.‏ فقلت نعم ‏.‏ فقال رسول الله صلى الله عليه وسلم لمن معه ‏\"‏ قوموا ‏\"‏ ‏.‏ قال فانطلقوا فانطلقت بين أيديهم حتى جئت أبا طلحة فأخبرته فقال أبو طلحة يا أم سليم قد جاء رسول الله صلى الله عليه وسلم والناس معه وليس عندنا ما نطعمهم ‏.‏ قالت أم سليم الله ورسوله أعلم ‏.‏ قال فانطلق أبو طلحة حتى لقي رسول الله صلى الله عليه وسلم فأقبل رسول الله صلى الله عليه وسلم وأبو طلحة معه حتى دخلا فقال رسول الله صلى الله عليه وسلم ‏\"‏ هلمي يا أم سليم ما عندك ‏\"‏ ‏.‏ فأتت بذلك الخبز فأمر به رسول الله صلى الله عليه وسلم ففت وعصرت أم سليم عكة لها فآدمته ثم قال فيه رسول الله صلى الله عليه وسلم ما شاء الله أن يقول ثم قال ‏\"‏ ائذن لعشرة ‏\"‏ ‏.‏ فأذن لهم فأكلوا حتى شبعوا ثم خرجوا ثم قال ‏\"‏ ائذن لعشرة ‏\"‏ ‏.‏ فأذن لهم فأكلوا حتى شبعوا ثم خرجوا فأكل القوم كلهم وشبعوا والقوم سبعون أو ثمانون رجلا ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Anas bin Malik:                     \"Abu Talhah said to Umm Sulaim: 'I heard the voice of the Messenger of Allah (ﷺ) sounding weak and I sensed some hunger in it. Do you have anything? She said: 'Yes.' So she got some loaves of wheat bread, then she took out a Khimar of hers, and put the bread in it. Then she put it under my arm, and wrapped my upper body with part of it, and she sent me to the Messenger of Allah (ﷺ).\" He said: \"So I brought it to him, and I found the Messenger of Allah (ﷺ) sitting in the Masjid, and there were people with him. So I stood among them, and the Messenger of Allah (ﷺ) said: 'Has Abu Talhah sent you?' I said: 'Yes.' He said: 'With food?' I said: 'Yes.' So the Messenger of Allah (ﷺ) said to those with him: 'Stand up.'\" So they left, and I left in front of them, until I came to Abu Talhah, and I told him (that they were coming). Abu Talhah said: 'O Umm Sulaim! The Messenger of Allah (ﷺ) is coming with people, and we don't have anything to feed them.' Umm Sulaim said: 'Allah and His Messenger know best.'\" He said: \"So Abu Talhah departed until he met up with the Messenger of Allah (ﷺ). The Messenger of Allah came, while Abu Talhah was with him, until they entered, when the Messenger of Allah (ﷺ) said: 'Come O Umm Sulaim! What do you have?' So she brought him that bread, and he (ﷺ) ordered that it be broken into pieces. Umm Sulaim poured some butter from an oil-skin upon them, then the Messenger of Allah (ﷺ) recited whatever Allah willed for him to say over it. Then he said: 'Let ten come.' So ten were admitted, and they ate until they were full, and then they left. Then he said: 'Let ten come.' So ten were admitted, and they ate until they were full, and they left. Then he said: 'Let ten come.' So ten were admitted, and they ate until they were full, and there were seventy or eighty men.\"",
      "chain": [
        "30410",
        "30112",
        "11151",
        "19"
      ]
    }
  ],
  "total_hadiths": 58
}