{
  "id": "30418",
  "name": "'Abdullah bin al-Zubair bin 'Isa عبد الله بن الزبير بن عيسى الحميدي",
  "full_name": "'Abdullah bin al-Zubair bin 'Isa عبد الله بن الزبير بن عيسى الحميدي",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Thiqah Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "219",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ م  د  ت  س  فق  -  ثقة حافظ ]"
    ],
    "tags": [
      "Quraish",
      "B.Asad",
      "al-Makki"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20150",
      "name": "Ibrahim bin Sa'd bin Ibrahim إبراهيم بن سعد بن إبراهيم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20002",
      "name": "Imam Shafi'ee ابو عبد الله محمد بن إدريس الشافعي",
      "grade": "Succ. (Taba' Tabi') [9th generation] [Shafi'ee]"
    },
    {
      "id": "20733",
      "name": "al-Walid bin Muslim al-Quraishi الوليد بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20032",
      "name": "Waki' bin al-Jarrah وكيع بن الجراح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20201",
      "name": "Marwan bin Mua'wiya al-Fazari مروان بن معاوية الفزاري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20165",
      "name": "'Abdul 'Aziz bin Abi Hazim عبد العزيز بن أبي حازم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20167",
      "name": "'Abdul 'Aziz bin Muhammad al-Daruradi عبد العزيز بن محمد الدراوردي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20413",
      "name": "Bashr bin Bakr al-Tunisi بشر بن بكر التنيسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "30005",
      "name": "Imam Tirmidhi الترمذي محمد بن عيسى بن سورة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30006",
      "name": "Imam Nasa'i أحمد بن شعيب بن علي بن سنان النسائي",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "38623",
      "name": "Muhammad bin Yonus al-Nsa'iy محمد بن يونس النسائي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30524",
      "name": "Harun bin 'Abdullah al-Hamal هارون بن عبد الله بن مروان الحمال",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30023",
      "name": "Muhammad bin Yahya bin Faris al-Dhahli محمد بن يحيى بن فارس الذهلي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "32026",
      "name": "Muhammad bin Ahmed al-Quraishi محمد بن أحمد القرشي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "36057",
      "name": "Muhammad bin 'Abdullah bin 'Abdul Rahim محمد بن عبد الله بن عبد الرحيم",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38001",
      "name": "Ahmed bin al-Azhar bin Mny' أحمد بن الأزهر بن منيع",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30554",
      "name": "Abu Zara' al-Razi أبو زرعة الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38719",
      "name": "Y'aqub bin Sufyan يعقوب بن سفيان",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30224",
      "name": "Yusuf bin Musa bin Rashid al-Qatan يوسف بن موسى بن راشد القطان",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "34255",
      "name": "Muhammad bin Yonus al-Kadaymi محمد بن يونس بن موسى الكديمي",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-1",
      "hadith_no": "1",
      "source": "Sahih Bukhari",
      "chapter": "Revelation - كتاب بدء الوحى",
      "chapter_no": "1",
      "text_ar": "حدثنا الحميدي عبد الله بن الزبير، قال حدثنا سفيان، قال حدثنا يحيى بن سعيد الأنصاري، قال أخبرني محمد بن إبراهيم التيمي، أنه سمع علقمة بن وقاص الليثي، يقول سمعت عمر بن الخطاب  رضى الله عنه  على المنبر قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إنما الأعمال بالنيات، وإنما لكل امرئ ما نوى، فمن كانت هجرته إلى دنيا يصيبها أو إلى امرأة ينكحها فهجرته إلى ما هاجر إليه ‏\"‏‏.‏",
      "text_en": "      Narrated 'Umar bin Al-Khattab:                          I heard Allah's Apostle saying, \"The reward of deeds depends upon the      intentions and every person will get the reward according to what he      has intended. So whoever emigrated for worldly benefits or for a woman     to marry, his emigration was for what he emigrated for.\"",
      "usc_msa_ref": "1",
      "chain": [
        "30418",
        "20005",
        "11062",
        "11213",
        "11042",
        "3"
      ]
    },
    {
      "id": "sahih-bukhari-73",
      "hadith_no": "73",
      "source": "Sahih Bukhari",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا الحميدي، قال حدثنا سفيان، قال حدثني إسماعيل بن أبي خالد، على غير ما حدثناه الزهري، قال سمعت قيس بن أبي حازم، قال سمعت عبد الله بن مسعود، قال قال النبي صلى الله عليه وسلم ‏\"‏ لا حسد إلا في اثنتين رجل آتاه الله مالا فسلط على هلكته في الحق، ورجل آتاه الله الحكمة، فهو يقضي بها ويعلمها ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Mas`ud:                     The Prophet said, \"Do not wish to be like anyone except in two cases. (The first is) A person, whom Allah has given wealth and he spends it righteously; (the second is) the one whom Allah has given wisdom (the Holy Qur'an) and he acts according to it and teaches it to others.\" (Fath-al-Bari page 177 Vol. 1)",
      "usc_msa_ref": "",
      "chain": [
        "30418",
        "20005",
        "11418",
        "11046",
        "16"
      ]
    },
    {
      "id": "sahih-bukhari-260",
      "hadith_no": "260",
      "source": "Sahih Bukhari",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا الحميدي، قال حدثنا سفيان، قال حدثنا الأعمش، عن سالم بن أبي الجعد، عن كريب، عن ابن عباس، عن ميمونة، أن النبي صلى الله عليه وسلم اغتسل من الجنابة، فغسل فرجه بيده، ثم دلك بها الحائط ثم غسلها، ثم توضأ وضوءه للصلاة، فلما فرغ من غسله غسل رجليه‏.‏",
      "text_en": " Narrated Maimuna:                     The Prophet took the bath of Janaba. (sexual relation or wet dream). He first cleaned his private parts with his hand, and then rubbed it (that hand) on the wall (earth) and washed it. Then he performed ablution like that for the prayer, and after the bath he washed his feet.",
      "usc_msa_ref": "",
      "chain": [
        "30418",
        "20005",
        "11060",
        "11342",
        "11211",
        "17",
        "61"
      ]
    },
    {
      "id": "sahih-bukhari-395",
      "hadith_no": "395",
      "source": "Sahih Bukhari",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا الحميدي، قال حدثنا سفيان، قال حدثنا عمرو بن دينار، قال سألنا ابن عمر عن رجل، طاف بالبيت العمرة، ولم يطف بين الصفا والمروة، أيأتي امرأته فقال قدم النبي صلى الله عليه وسلم فطاف بالبيت سبعا، وصلى خلف المقام ركعتين، وطاف بين الصفا والمروة، وقد كان لكم في رسول الله أسوة حسنة‏.‏ وسألنا جابر بن عبد الله فقال لا يقربنها حتى يطوف بين الصفا والمروة‏.‏",
      "text_en": " Narrated `Amr bin Dinar:                     I asked Ibn `Umar, \"Can a person who has performed the Tawaf around the Ka`ba for `Umra but has not performed the (Sa`i) Tawaf of Safa and Marwa, have a sexual relation with his wife?\" Ibn `Umar replied \"When the Prophet reached Mecca he performed the Tawaf around the Ka`ba (circumambulated it seven times) and offered a two-rak`at prayer (at the place) behind the station (of Abraham) and then performed the Tawaf (Sa`i) of Safa and Marwa, and verily in Allah's Apostle you have a good example.\" Then we put the same question to Jabir bin `Abdullah and he too replied, \"He should not go near his wife (for sexual relation) till he has finished the Tawaf of Safa and Marwa.\"",
      "usc_msa_ref": "389",
      "chain": [
        "30418",
        "20005",
        "11081",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-554",
      "hadith_no": "554",
      "source": "Sahih Bukhari",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا الحميدي، قال حدثنا مروان بن معاوية، قال حدثنا إسماعيل، عن قيس، عن جرير، قال كنا عند النبي صلى الله عليه وسلم فنظر إلى القمر ليلة  يعني البدر  فقال ‏\"‏ إنكم سترون ربكم كما ترون هذا القمر لا تضامون في رؤيته، فإن استطعتم أن لا تغلبوا على صلاة قبل طلوع الشمس وقبل غروبها فافعلوا ‏\"‏‏.‏ ثم قرأ ‏{‏وسبح بحمد ربك قبل طلوع الشمس وقبل الغروب‏}‏‏.‏ قال إسماعيل افعلوا لا تفوتنكم‏.‏",
      "text_en": " Narrated Qais:                     Jarir said, \"We were with the Prophet and he looked at the moon--full-moon--and said, 'Certainly you will see your Lord as you see this moon and you will have no trouble in seeing Him. So if you can avoid missing (through sleep or business, etc.) a prayer before the sunrise (Fajr) and a prayer before sunset (`Asr), you must do so.' He then recited Allah's Statement: And celebrate the praises Of your Lord before the rising of the sun and before (its) setting.\" (50.39) Isma`il said, \"Offer those prayers and do not miss them.\"",
      "usc_msa_ref": "529",
      "chain": [
        "30418",
        "20201",
        "11418",
        "11046",
        "4057"
      ]
    },
    {
      "id": "sahih-bukhari-1280",
      "hadith_no": "1280",
      "source": "Sahih Bukhari",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، حدثنا أيوب بن موسى، قال أخبرني حميد بن نافع، عن زينب ابنة أبي سلمة، قالت لما جاء نعى أبي سفيان من الشأم دعت أم حبيبة  رضى الله عنها  بصفرة في اليوم الثالث، فمسحت عارضيها وذراعيها وقالت إني كنت عن هذا لغنية، لولا أني سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ لا يحل لامرأة تؤمن بالله واليوم الآخر أن تحد على ميت فوق ثلاث، إلا على زوج، فإنها تحد عليه أربعة أشهر وعشرا ‏\"‏‏.‏",
      "text_en": " Narrated Zainab bint Abi Salama:                     When the news of the death of Abu Sufyan reached from Sham, Um Habiba on the third day, asked for a yellow perfume and scented her cheeks and forearms and said, \"No doubt, I would not have been in need of this, had I not heard the Prophet saying: \"It is not legal for a woman who believes in Allah and the Last Day to mourn for more than three days for any dead person except her husband, for whom she should mourn for four months and ten days.\"",
      "usc_msa_ref": "370",
      "chain": [
        "30418",
        "20005",
        "11241",
        "11157",
        "244"
      ]
    },
    {
      "id": "sahih-bukhari-1559",
      "hadith_no": "1559",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا الحميدي، حدثنا الوليد، وبشر بن بكر التنيسي، قالا حدثنا الأوزاعي، قال حدثني يحيى، قال حدثني عكرمة، أنه سمع ابن عباس  رضى الله عنهما  يقول إنه سمع عمر  رضى الله عنه  يقول سمعت النبي صلى الله عليه وسلم بوادي العقيق يقول ‏\"‏ أتاني الليلة آت من ربي فقال صل في هذا الوادي المبارك وقل عمرة في حجة ‏\"‏‏.‏",
      "text_en": " Narrated `Umar:                     In the valley of Al-`Aqiq I heard Allah's Apostle saying, \"To night a messenger came to me from my Lord and asked me to pray in this blessed valley and to assume Ihram for Hajj and `Umra together. \"",
      "usc_msa_ref": "609",
      "chain": [
        "30418",
        "20733",
        "20413",
        "20024",
        "11449",
        "11023",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-1602",
      "hadith_no": "1602",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا الحميدي، ومحمد بن المثنى، قالا حدثنا سفيان بن عيينة، عن هشام بن عروة، عن أبيه، عن عائشة  رضى الله عنها  أن النبي صلى الله عليه وسلم لما جاء إلى مكة دخل من أعلاها وخرج من أسفلها‏.‏",
      "text_en": " Narrated `Aisha:                     When the Prophet came to Mecca he entered from its higher side and left from its lower side.",
      "usc_msa_ref": "647",
      "chain": [
        "30418",
        "30170",
        "20005",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-1615",
      "hadith_no": "1615",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا الحميدي، حدثنا الوليد، حدثنا الأوزاعي، قال حدثني الزهري، عن أبي سلمة، عن أبي هريرة  رضى الله عنه  قال قال النبي صلى الله عليه وسلم من الغد يوم النحر وهو بمنى ‏\"‏ نحن نازلون غدا بخيف بني كنانة حيث تقاسموا على الكفر ‏\"‏‏.‏ يعني ذلك المحصب، وذلك أن قريشا وكنانة تحالفت على بني هاشم وبني عبد المطلب، أو بني المطلب أن لا يناكحوهم، ولا يبايعوهم حتى يسلموا إليهم النبي صلى الله عليه وسلم‏.‏ وقال سلامة عن عقيل ويحيى بن الضحاك عن الأوزاعي أخبرني ابن شهاب وقالا بني هاشم وبني المطلب‏.‏ قال أبو عبد الله بني المطلب أشبه‏.‏",
      "text_en": " Narrated Abu Huraira:                     On the Day of Nahr at Mina, the Prophet said, \"Tomorrow we shall stay at Khaif Bani Kinana where the pagans had taken the oath of Kufr (heathenism).\" He meant (by that place) Al-Muhassab where the Quraish tribe and Bani Kinana concluded a contract against Bani Hashim and Bani `Abdul-Muttalib or Bani Al-Muttalib that they would not intermarry with them or deal with them in business until they handed over the Prophet to them.",
      "usc_msa_ref": "660",
      "chain": [
        "30418",
        "20733",
        "20024",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-1821",
      "hadith_no": "1821",
      "source": "Sahih Bukhari",
      "chapter": "`Umrah (Minor pilgrimage) - كتاب العمرة",
      "chapter_no": "26",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، عن عمرو بن دينار، قال سألنا ابن عمر  رضى الله عنهما  عن رجل، طاف بالبيت في عمرة، ولم يطف بين الصفا والمروة، أيأتي امرأته فقال قدم النبي صلى الله عليه وسلم فطاف بالبيت سبعا، وصلى خلف المقام ركعتين، وطاف بين الصفا والمروة سبعا، وقد كان لكم في رسول الله أسوة حسنة‏.‏ قال وسألنا جابر بن عبد الله  رضى الله عنهما  فقال لا يقربنها حتى يطوف بين الصفا والمروة‏.‏",
      "text_en": " Narrated `Amr bin Dinar:                     We asked Ibn `Umar whether a man who had performed the Tawaf of the Ka`ba but had not performed the Tawaf between As-Safa and Al-Marwa yet, was permitted to have sexual relation with his wife. He replied, \"The Prophet arrived (at Mecca) and circumambulated the Ka`ba seven times and then offered a two rak`at prayer behind Maqam-lbrahim and then performed the going (Tawaf) between As-Safa and Al-Marwa (seven times) (and verily, in Allah's Apostle you have a good example.\" And we asked Jabir bin `Abdullah (the same question) and he replied, \"He should not go near her till he has finished the going (Tawaf) between As-Safa and Al-Marwa.\"",
      "usc_msa_ref": "20",
      "chain": [
        "30418",
        "20005",
        "11081",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-2115",
      "hadith_no": "2115",
      "source": "Sahih Bukhari",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "وقال الحميدي حدثنا سفيان، حدثنا عمرو، عن ابن عمر  رضى الله عنهما  قال كنا مع النبي صلى الله عليه وسلم في سفر فكنت على بكر صعب لعمر، فكان يغلبني فيتقدم أمام القوم، فيزجره عمر ويرده، ثم يتقدم فيزجره عمر ويرده فقال النبي صلى الله عليه وسلم لعمر ‏\"‏ بعنيه ‏\"‏‏.‏ قال هو لك يا رسول الله‏.‏ قال ‏\"‏ بعنيه ‏\"‏‏.‏ فباعه من رسول الله صلى الله عليه وسلم فقال النبي صلى الله عليه وسلم ‏\"‏ هو لك يا عبد الله بن عمر تصنع به ما شئت ‏\"‏‏.‏",
      "text_en": " Narrated Ibn 'Umar (ra) :                      We were accompanying the Prophet () on a journey and I was riding an unmanageable camel belonging to 'Umar (ra), and I could not bring it under my control. So, it used to go ahead of the party and 'Umar would check it and force it to retreat, and again it went ahead and again 'Umar forced it to retreat. The Prophet () asked 'Umar to sell that camel to him. 'Umar replied, \"It is for you O Allah's Messenger !\" Allah's Messenger () told 'Umar to sell that camel to him (not to give it as gift). So, 'Umar sold it to  Allah's Messenger (). Then the Prophet () said to 'Abdullah bin 'Umar \"This camel is for you O 'Abdullah (as a present) and you could do with it whatever you like.\"",
      "usc_msa_ref": "",
      "chain": [
        "30418",
        "20005",
        "11081",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-2223",
      "hadith_no": "2223",
      "source": "Sahih Bukhari",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، حدثنا عمرو بن دينار، قال أخبرني طاوس، أنه سمع ابن عباس  رضى الله عنهما  يقول بلغ عمر أن فلانا باع خمرا فقال قاتل الله فلانا، ألم يعلم أن رسول الله صلى الله عليه وسلم قال ‏\"‏ قاتل الله اليهود، حرمت عليهم الشحوم فجملوها فباعوها ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Once `Umar was informed that a certain man sold alcohol. `Umar said, \"May Allah curse him! Doesn't he know that Allah's Apostle said, 'May Allah curse the Jews, for Allah had forbidden them to eat the fat of animals but they melted it and sold it.\"",
      "usc_msa_ref": "426",
      "chain": [
        "30418",
        "20005",
        "11081",
        "11053",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-2528",
      "hadith_no": "2528",
      "source": "Sahih Bukhari",
      "chapter": "Manumission of Slaves - كتاب العتق",
      "chapter_no": "49",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، حدثنا مسعر، عن قتادة، عن زرارة بن أوفى، عن أبي هريرة  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ إن الله تجاوز لي عن أمتي ما وسوست به صدورها، ما لم تعمل أو تكلم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Allah has accepted my invocation to forgive what whispers in the hearts of my followers, unless they put it to action or utter it.\" (See Hadith No. 657 Vol. 8)",
      "usc_msa_ref": "705",
      "chain": [
        "30418",
        "20005",
        "20359",
        "11019",
        "11284",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-2611",
      "hadith_no": "2611",
      "source": "Sahih Bukhari",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "وقال الحميدي حدثنا سفيان، حدثنا عمرو، عن ابن عمر  رضى الله عنهما  قال كنا مع النبي صلى الله عليه وسلم في سفر، وكنت على بكر صعب فقال النبي صلى الله عليه وسلم لعمر ‏\"‏ بعنيه ‏\"‏‏.‏ فابتاعه فقال النبي صلى الله عليه وسلم ‏\"‏ هو لك يا عبد الله ‏\"‏‏.‏",
      "text_en": " Narrated Ibn 'Umar (ra):                      We were in the company of the Prophet () on a journey, and I was riding a troublesome camel. The Prophet () asked 'Umar to sell that camel to him. So, 'Umar sold it to him. The Prophet () then said, \"O 'Abdullah! The camel is for you.\"",
      "usc_msa_ref": "",
      "chain": [
        "30418",
        "20005",
        "11081",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-2636",
      "hadith_no": "2636",
      "source": "Sahih Bukhari",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا الحميدي، أخبرنا سفيان، قال سمعت مالكا، يسأل زيد بن أسلم قال سمعت أبي يقول، قال عمر  رضى الله عنه  حملت على فرس في سبيل الله، فرأيته يباع، فسألت رسول الله صلى الله عليه وسلم فقال ‏\"‏ لا تشتر، ولا تعد في صدقتك ‏\"‏‏.‏",
      "text_en": " Narrated `Umar bin Al-Khattab:                     Once I gave a horse (for riding) in Allah's Cause. Later I saw it being sold. I asked Allah's Apostle (whether I could buy it). He said, \"Don't buy it, for you should not get back what you have given in charity.\"",
      "usc_msa_ref": "804",
      "chain": [
        "30418",
        "20005",
        "3"
      ]
    },
    {
      "id": "sahih-bukhari-2827",
      "hadith_no": "2827",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، حدثنا الزهري، قال أخبرني عنبسة بن سعيد، عن أبي هريرة  رضى الله عنه  قال أتيت رسول الله صلى الله عليه وسلم وهو بخيبر بعد ما افتتحوها، فقلت يا رسول الله أسهم لي‏.‏ فقال بعض بني سعيد بن العاص لا تسهم له يا رسول الله‏.‏ فقال أبو هريرة هذا قاتل ابن قوقل‏.‏ فقال ابن سعيد بن العاص واعجبا لوبر تدلى علينا من قدوم ضأن، ينعى على قتل رجل مسلم أكرمه الله على يدى ولم يهني على يديه‏.‏ قال فلا أدري أسهم له أم لم يسهم له‏.‏ قال سفيان وحدثنيه السعيدي عن جده عن أبي هريرة‏.‏ قال أبو عبد الله السعيدي عمرو بن يحيى بن سعيد بن عمرو بن سعيد بن العاص‏.‏",
      "text_en": "      Narrated Abu Huraira:                          I went to Allah's Apostle while he was at Khaibar after it had fallen      in the Muslims' hands. I said, \"O Allah's Apostle! Give me a share      (from the land of Khaibar).\"     One of the sons of Sa'id bin Al-'As said, \"O Allah's Apostle! Do not      give him a share.\" I said, \"This is the murderer of Ibn Qauqal.\" The      son of Said bin Al-As said, \"Strange! A Wabr (i.e. guinea pig) who has     come down to us from the mountain of Qaduim (i.e. grazing place of      sheep) blames me for killing a Muslim who was given superiority by      Allah because of me, and Allah did not disgrace me at his hands (i.e.      was not killed as an infidel).\" (The sub-narrator said \"I do not know      whether the Prophet gave him a share or not.\")",
      "usc_msa_ref": "80",
      "chain": [
        "30418",
        "20005",
        "11013",
        "25221",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-2970",
      "hadith_no": "2970",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، قال سمعت مالك بن أنس، سأل زيد بن أسلم، فقال زيد سمعت أبي يقول، قال عمر بن الخطاب  رضى الله عنه  حملت على فرس في سبيل الله، فرأيته يباع، فسألت النبي صلى الله عليه وسلم آشتريه فقال ‏\"‏ لا تشتره، ولا تعد في صدقتك ‏\"‏‏.‏",
      "text_en": " Narrated `Umar bin Al-Khattab:                     I gave a horse to be used in Allah's Cause, but later on I saw it being sold. I asked the Prophet whether I could buy it. He said, \"Don't buy it and don't take back your gift of charity.\"",
      "usc_msa_ref": "214",
      "chain": [
        "30418",
        "20005",
        "20001",
        "11163",
        "11416",
        "3"
      ]
    },
    {
      "id": "sahih-bukhari-2997",
      "hadith_no": "2997",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، حدثنا محمد بن المنكدر، قال سمعت جابر بن عبد الله  رضى الله عنهما  يقول ندب النبي صلى الله عليه وسلم الناس يوم الخندق، فانتدب الزبير، ثم ندبهم فانتدب الزبير، ثم ندبهم فانتدب الزبير، قال النبي صلى الله عليه وسلم ‏\"‏ إن لكل نبي حواريا، وحواري الزبير ‏\"‏‏.‏ قال سفيان الحواري الناصر‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     On the day of the battle of the Trench, the Prophet wanted somebody from amongst the people to volunteer to be a reconnoitre. Az-Zubair volunteered. He demanded the same again and Az-Zubair volunteered again. Then he repeated the same demand (thrice) and AzZubair volunteered once more. The Prophet then said, \" Every prophet has a disciple and my disciple is Az-Zubair.\"",
      "usc_msa_ref": "240",
      "chain": [
        "30418",
        "20005",
        "11048",
        "34"
      ]
    },
    {
      "id": "sahih-bukhari-3112",
      "hadith_no": "3112",
      "source": "Sahih Bukhari",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "قال الحميدي حدثنا سفيان، حدثنا محمد بن سوقة، قال سمعت منذرا الثوري، عن ابن الحنفية، قال أرسلني أبي، خذ هذا الكتاب فاذهب به إلى عثمان، فإن فيه أمر النبي صلى الله عليه وسلم في الصدقة‏.‏",
      "text_en": "  Muhammad bin Suqa:                      I heard Mundhir at-Tuzi reporting Ibn Hanafiya who said, \"My father sent me saying, 'Take this letter to `Uthman for it contains the orders of the Prophet concerning the Sadaqa.' \"",
      "usc_msa_ref": "",
      "chain": [
        "30418",
        "20005",
        "11387",
        "10600"
      ]
    },
    {
      "id": "sahih-bukhari-3176",
      "hadith_no": "3176",
      "source": "Sahih Bukhari",
      "chapter": "Jizyah and Mawaada'ah - كتاب الجزية والموادعة",
      "chapter_no": "58",
      "text_ar": "حدثنا الحميدي، حدثنا الوليد بن مسلم، حدثنا عبد الله بن العلاء بن زبر، قال سمعت بسر بن عبيد الله، أنه سمع أبا إدريس، قال سمعت عوف بن مالك، قال أتيت النبي صلى الله عليه وسلم في غزوة تبوك، وهو في قبة من أدم فقال ‏\"‏ اعدد ستا بين يدى الساعة، موتي، ثم فتح بيت المقدس، ثم موتان يأخذ فيكم كقعاص الغنم، ثم استفاضة المال حتى يعطى الرجل مائة دينار فيظل ساخطا، ثم فتنة لا يبقى بيت من العرب إلا دخلته، ثم هدنة تكون بينكم وبين بني الأصفر فيغدرون، فيأتونكم تحت ثمانين غاية، تحت كل غاية اثنا عشر ألفا ‏\"‏‏.‏",
      "text_en": " Narrated `Auf bin Mali:                     I went to the Prophet during the Ghazwa of Tabuk while he was sitting in a leather tent. He said, \"Count six signs that indicate the approach of the Hour: my death, the conquest of Jerusalem, a plague that will afflict you (and kill you in great numbers) as the plague that afflicts sheep, the increase of wealth to such an extent that even if one is given one hundred Dinars, he will not be satisfied; then an affliction which no Arab house will escape, and then a truce between you and Bani Al-Asfar (i.e. the Byzantines) who will betray you and attack you under eighty flags. Under each flag will be twelve thousand soldiers.",
      "usc_msa_ref": "401",
      "chain": [
        "30418",
        "20733",
        "20399",
        "11412",
        "11027",
        "10805"
      ]
    },
    {
      "id": "sahih-bukhari-3244",
      "hadith_no": "3244",
      "source": "Sahih Bukhari",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، حدثنا أبو الزناد، عن الأعرج، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ قال الله أعددت لعبادي الصالحين ما لا عين رأت، ولا أذن سمعت، ولا خطر على قلب بشر، فاقرءوا إن شئتم ‏{‏فلا تعلم نفس ما أخفي لهم من قرة أعين ‏}‏‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Allah said, \"I have prepared for My Pious slaves things which have never been seen by an eye, or heard by an ear, or imagined by a human being.\" If you wish, you can recite this Verse from the Holy Qur'an:--\"No soul knows what is kept hidden for them, of joy as a reward for what they used to do.\" (32.17)",
      "usc_msa_ref": "467",
      "chain": [
        "30418",
        "20005",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-3278",
      "hadith_no": "3278",
      "source": "Sahih Bukhari",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، حدثنا عمرو، قال أخبرني سعيد بن جبير، قال قلت لابن عباس فقال حدثنا أبى بن كعب، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن موسى قال لفتاه آتنا غداءنا، قال أرأيت إذ أوينا إلى الصخرة، فإني نسيت الحوت، وما أنسانيه إلا الشيطان أن أذكره، ولم يجد موسى النصب حتى جاوز المكان الذي أمر الله به ‏\"‏‏.‏",
      "text_en": " Narrated Ubai bin Ka`b:                     That he heard Allah's Apostle saying, \"(The prophet) Moses said to his attendant, \"Bring us our early meal' (18.62). The latter said, 'Did you remember when we betook ourselves to the rock? I indeed forgot the fish and none but Satan made me forget to remember it.\" (18.63) Moses did not feel tired till he had crossed the place which Allah ordered him to go to.\"",
      "usc_msa_ref": "498",
      "chain": [
        "30418",
        "20005",
        "11081",
        "11050",
        "39"
      ]
    },
    {
      "id": "sahih-bukhari-3377",
      "hadith_no": "3377",
      "source": "Sahih Bukhari",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، حدثنا هشام بن عروة، عن أبيه، عن عبد الله بن زمعة، قال سمعت النبي صلى الله عليه وسلم‏.‏ وذكر الذي عقر الناقة قال ‏\"‏ انتدب لها رجل ذو عز ومنعة في قوة كأبي زمعة ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Zam`a:                     I heard the Prophet while referring to the person who had cut the legs of the she-camel (of the Prophet Salih), saying, \"The man who was appointed for doing this job, was a man of honor and power in his nation like Abu Zam`a.\"",
      "usc_msa_ref": "560",
      "chain": [
        "30418",
        "20005",
        "11065",
        "10511",
        "192"
      ]
    },
    {
      "id": "sahih-bukhari-3445",
      "hadith_no": "3445",
      "source": "Sahih Bukhari",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، قال سمعت الزهري، يقول أخبرني عبيد الله بن عبد الله، عن ابن عباس، سمع عمر  رضى الله عنه  يقول على المنبر سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ لا تطروني كما أطرت النصارى ابن مريم، فإنما أنا عبده، فقولوا عبد الله ورسوله ‏\"‏‏.‏",
      "text_en": " Narrated `Umar:                     I heard the Prophet saying, \"Do not exaggerate in praising me as the Christians praised the son of Mary, for I am only a Slave. So, call me the Slave of Allah and His Apostle.\"",
      "usc_msa_ref": "654",
      "chain": [
        "30418",
        "20005",
        "11013",
        "11004",
        "17",
        "3"
      ]
    },
    {
      "id": "sahih-bukhari-3684",
      "hadith_no": "3684",
      "source": "Sahih Bukhari",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا الحميدي، حدثنا الوليد، قال حدثني ابن جابر، قال حدثني عمير بن هانئ، أنه سمع معاوية، يقول سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ لا يزال من أمتي أمة قائمة بأمر الله، لا يضرهم من خذلهم ولا من خالفهم حتى يأتيهم أمر الله وهم على ذلك ‏\"‏‏.‏ قال عمير فقال مالك بن يخامر قال معاذ وهم بالشأم‏.‏ فقال معاوية هذا مالك يزعم أنه سمع معاذا يقول وهم بالشام‏.‏",
      "text_en": " Narrated Muawiya:                     I heard the Prophet saying, \"A group of people amongst my followers will remain obedient to Allah's orders and they will not be harmed by anyone who will not help them or who will oppose them, till Allah's Order (the Last Day) comes upon them while they are still on the right path.\"",
      "usc_msa_ref": "835",
      "chain": [
        "30418",
        "20733",
        "11415",
        "27"
      ]
    },
    {
      "id": "sahih-bukhari-3703",
      "hadith_no": "3703",
      "source": "Sahih Bukhari",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا الحميدي، ومحمد بن عبد الله، قالا حدثنا إبراهيم بن سعد، عن أبيه، عن محمد بن جبير بن مطعم، عن أبيه، قال أتت امرأة النبي صلى الله عليه وسلم فأمرها أن ترجع إليه‏.‏ قالت أرأيت إن جئت ولم أجدك كأنها تقول الموت‏.‏ قال عليه السلام ‏\"‏ إن لم تجديني فأتي أبا بكر ‏\"‏‏.‏",
      "text_en": " Narrated Jubair bin Mut`im:                     A woman came to the Prophet who ordered her to return to him again. She said, \"What if I came and did not find you?\" as if she wanted to say, \"If I found you dead?\" The Prophet said, \"If you should not find me, go to Abu Bakr.\"",
      "usc_msa_ref": "11",
      "chain": [
        "30418",
        "30561",
        "20150",
        "11063",
        "11058",
        "871"
      ]
    },
    {
      "id": "sahih-bukhari-3900",
      "hadith_no": "3900",
      "source": "Sahih Bukhari",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، حدثنا بيان، وإسماعيل، قالا سمعنا قيسا، يقول سمعت خبابا، يقول أتيت النبي صلى الله عليه وسلم وهو متوسد بردة، وهو في ظل الكعبة، وقد لقينا من المشركين شدة فقلت ألا تدعو الله فقعد وهو محمر وجهه فقال ‏\"‏ لقد كان من قبلكم ليمشط بمشاط الحديد ما دون عظامه من لحم أو عصب ما يصرفه ذلك عن دينه، ويوضع المنشار على مفرق رأسه، فيشق باثنين، ما يصرفه ذلك عن دينه، وليتمن الله هذا الأمر حتى يسير الراكب من صنعاء إلى حضرموت ما يخاف إلا الله ‏\"‏‏.‏ زاد بيان والذئب على غنمه‏.‏",
      "text_en": " Narrated Khabbaba:                     I came to the Prophet while he was leaning against his sheet cloak in the shade of the Ka`ba. We were suffering greatly from the pagans in those days. i said (to him). \"Will you invoke Allah (to help us)?\" He sat down with a red face and said, \"(A believer among) those who were before you used to be combed with iron combs so that nothing of his flesh or nerves would remain on his bones; yet that would never make him desert his religion. A saw might be put over the parting of his head which would be split into two parts, yet all that would never make him abandon his religion. Allah will surely complete this religion (i.e. Islam) so that a traveler from Sana to Hadra-maut will not be afraid of anybody except Allah.\" (The sub-narrator, Baiyan added, \"Or the wolf, lest it should harm his sheep.\")",
      "usc_msa_ref": "191",
      "chain": [
        "30418",
        "20005",
        "11326",
        "20208",
        "149"
      ]
    },
    {
      "id": "sahih-bukhari-3922",
      "hadith_no": "3922",
      "source": "Sahih Bukhari",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، حدثنا إسحاق بن سعيد السعيدي، عن أبيه، عن أم خالد بنت خالد، قالت قدمت من أرض الحبشة وأنا جويرية، فكساني رسول الله صلى الله عليه وسلم خميصة لها أعلام، فجعل رسول الله صلى الله عليه وسلم يمسح الأعلام بيده ويقول ‏\"‏ سناه، سناه ‏\"‏‏.‏ قال الحميدي يعني حسن حسن‏.‏",
      "text_en": " Narrated Um Khalid bint Khalid:                     When I came from Ethiopia (to Medina), I was a young girl. Allah's Apostle made me wear a sheet having marks on it. Allah's Apostle was rubbing those marks with his hands saying, \"Sanah! Sanah!\" (i.e. good, good).",
      "usc_msa_ref": "214",
      "chain": [
        "30418",
        "20005",
        "20309",
        "11509",
        "740"
      ]
    },
    {
      "id": "sahih-bukhari-3936",
      "hadith_no": "3936",
      "source": "Sahih Bukhari",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، حدثنا عمرو، عن عكرمة، عن ابن عباس  رضى الله عنهما  في قوله تعالى ‏{‏وما جعلنا الرؤيا التي أريناك إلا فتنة للناس‏}‏ قال هي رؤيا عين، أريها رسول الله صلى الله عليه وسلم ليلة أسري به إلى بيت المقدس‏.‏ قال والشجرة الملعونة في القرآن قال هي شجرة الزقوم‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Regarding the Statement of Allah\" \"And We granted the vision (Ascension to the heavens) which We made you see (as an actual eye witness) was only made as a trial for the people.\" (17.60) Ibn `Abbas added: The sights which Allah's Apostle was shown on the Night Journey when he was taken to Bait-ulMaqdis (i.e. Jerusalem) were actual sights, (not dreams). And the Cursed Tree (mentioned) in the Qur'an is the tree of Zaqqum (itself) .",
      "usc_msa_ref": "228",
      "chain": [
        "30418",
        "20005",
        "11081",
        "11023",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-3945",
      "hadith_no": "3945",
      "source": "Sahih Bukhari",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، حدثنا الأعمش، قال سمعت أبا وائل، يقول عدنا خبابا فقال هاجرنا مع النبي صلى الله عليه وسلم نريد وجه الله، فوقع أجرنا على الله، فمنا من مضى، لم يأخذ من أجره شيئا، منهم مصعب بن عمير قتل يوم أحد، وترك نمرة، فكنا إذا غطينا بها رأسه بدت رجلاه، وإذا غطينا رجليه بدا رأسه، فأمرنا رسول الله صلى الله عليه وسلم أن نغطي رأسه، ونجعل على رجليه شيئا من إذخر‏.‏ ومنا من أينعت له ثمرته فهو يهدبها‏.‏",
      "text_en": " Narrated Abu Wail:                     We visited Khabbaba who said, \"We migrated with the Prophet for Allah's Sake, so our reward became due and sure with Allah. Some of us passed away without taking anything of their rewards (in this world) and one of them was Mus`ab bin `Umar who was martyred on the day (of the battle) of Uhud leaving a striped woolen cloak. When we covered his head with it, his feet became naked, and when covered his feet, his head became naked. So Allah's Apostle ordered us to cover his head and put some Idhkhir (i.e. a special kind of grass) on his feet. (On the other hand) some of us have had their fruits ripened (in this world) and they are collecting them.\"",
      "usc_msa_ref": "237",
      "chain": [
        "30418",
        "20005",
        "11060",
        "11353"
      ]
    },
    {
      "id": "sahih-bukhari-4026",
      "hadith_no": "4026",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، حدثنا عمرو، عن عطاء، عن ابن عباس  رضى الله عنهما ‏{‏الذين بدلوا نعمة الله كفرا‏}‏ قال هم والله كفار قريش‏.‏ قال عمرو هم قريش ومحمد صلى الله عليه وسلم نعمة الله ‏{‏وأحلوا قومهم دار البوار ‏}‏ قال النار يوم بدر‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     regarding the Statement of Allah:--\"Those who have changed Allah's Blessings for disbelief...\" (14.28) The people meant here by Allah, are the infidels of Quraish. (`Amr, a sub-narrator said, \"Those are (the infidels of) Quraish and Muhammad is Allah's Blessing. Regarding Allah's Statement:\"..and have led their people Into the house of destruction? (14.29) Ibn `Abbas said, \"It means the Fire they will suffer from (after their death) on the day of Badr.\"",
      "usc_msa_ref": "",
      "chain": [
        "30418",
        "20005",
        "11081",
        "11029",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-4368",
      "hadith_no": "4368",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا الحميدي، سمع سفيان، حدثنا هشام، عن أبيه، عن زينب ابنة أبي سلمة، عن أمها أم سلمة  رضى الله عنها  دخل على النبي صلى الله عليه وسلم وعندي مخنث فسمعته يقول لعبد الله بن أبي أمية يا عبد الله أرأيت إن فتح الله عليكم الطائف غدا فعليك بابنة غيلان، فإنها تقبل بأربع وتدبر بثمان‏.‏ وقال النبي صلى الله عليه وسلم ‏\"‏ لا يدخلن هؤلاء عليكن ‏\"‏‏.‏ قال ابن عيينة وقال ابن جريج المخنث هيت‏.‏ حدثنا محمود حدثنا أبو أسامة عن هشام بهذا، وزاد وهو محاصر الطائف يومئذ‏.‏",
      "text_en": " Narrated Um Salama:                     The Prophet came to me while there was an effeminate man sitting with me, and I heard him (i.e. the effeminate man) saying to `Abdullah bin Abi Umaiya, \"O `Abdullah! See if Allah should make you conquer Ta'if tomorrow, then take the daughter of Ghailan (in marriage) as (she is so beautiful and fat that) she shows four folds of flesh when facing you, and eight when she turns her back.\" The Prophet then said, \"These (effeminate men) should never enter upon you (O women!).\" Ibn Juraij said, \"That effeminate man was called Hit.\"",
      "usc_msa_ref": "613",
      "chain": [
        "30418",
        "20005",
        "11065",
        "10511",
        "244"
      ]
    },
    {
      "id": "sahih-bukhari-4539",
      "hadith_no": "4539",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، حدثنا عمرو، قال سمعت مجاهدا، قال سمعت ابن عباس  رضى الله عنهما  يقول كان في بني إسرائيل القصاص، ولم تكن فيهم الدية فقال الله تعالى لهذه الأمة ‏{‏كتب عليكم القصاص في القتلى الحر بالحر والعبد بالعبد والأنثى بالأنثى فمن عفي له من أخيه شىء‏}‏ فالعفو أن يقبل الدية في العمد ‏{‏فاتباع بالمعروف وأداء إليه بإحسان‏}‏ يتبع بالمعروف ويؤدي بإحسان، ‏{‏ذلك تخفيف من ربكم‏}‏ ورحمة مما كتب على من كان قبلكم‏.‏ ‏{‏فمن اعتدى بعد ذلك فله عذاب أليم‏}‏ قتل بعد قبول الدية‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The law of Qisas (i.e. equality in punishment) was prescribed for the children of Israel, but the Diya (i.e. blood money was not ordained for them). So Allah said to this Nation (i.e. Muslims): \"O you who believe! The law of Al-Qisas (i.e. equality in punishment) is prescribed for you in cases of murder: The free for the free, the slave for the slave, and the female for the female. But if the relatives (or one of them) of the killed (person) forgive their brother (i.e. the killers something of Qisas (i.e. not to kill the killer by accepting blood money in the case of intentional murder)----then the relatives (of the killed person) should demand blood-money in a reasonable manner and the killer must pay with handsome gratitude. This is an allevitation and a Mercy from your Lord, (in comparison to what was prescribed for the nations before you). So after this, whoever transgresses the limits (i.e. to kill the killer after taking the blood-money) shall have a painful torment.\" (2.178)",
      "usc_msa_ref": "25",
      "chain": [
        "30418",
        "20005",
        "11081",
        "11028",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-4729",
      "hadith_no": "4729",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، حدثنا عمرو، قال قرأ ابن عباس ‏{‏ألا إنهم يثنون صدورهم ليستخفوا منه ألا حين يستغشون ثيابهم‏}‏ وقال غيره عن ابن عباس ‏{‏يستغشون‏}‏ يغطون رءوسهم ‏{‏سيء بهم‏}‏ ساء ظنه بقومه‏.‏ ‏{‏وضاق بهم‏}‏ بأضيافه ‏{‏بقطع من الليل‏}‏ بسواد‏.‏ وقال مجاهد ‏{‏أنيب‏}‏ أرجع‏.‏",
      "text_en": " Narrated `Amr:                     Ibn `Abbas recited:-- \"No doubt! They fold up their breasts in order to hide from Him. Surely! Even when they cover themselves with their garments..\" (11.5)",
      "usc_msa_ref": "205",
      "chain": [
        "30418",
        "20005",
        "11081"
      ]
    },
    {
      "id": "sahih-bukhari-4739",
      "hadith_no": "4739",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، عن الأعمش، عن مسلم، عن مسروق، عن عبد الله  رضى الله عنه  أن قريشا لما أبطئوا عن النبي صلى الله عليه وسلم بالإسلام قال ‏\"‏ اللهم اكفنيهم بسبع كسبع يوسف ‏\"‏ فأصابتهم سنة حصت كل شىء حتى أكلوا العظام حتى جعل الرجل ينظر إلى السماء فيرى بينه وبينها مثل الدخان قال الله ‏{‏فارتقب يوم تأتي السماء بدخان مبين‏}‏ قال الله ‏{‏إنا كاشفو العذاب قليلا إنكم عائدون‏}‏ أفيكشف عنهم العذاب يوم القيامة، وقد مضى الدخان ومضت البطشة‏.‏",
      "text_en": " Narrated `Abdullah (bin Mas`ud):                     When the Prophet realized that the Quraish had delayed in embracing Islam, he said, \"O Allah! Protect me against their evil by afflicting them with seven (years of famine) like the seven years of (Prophet) Joseph.\" So they were struck with a year of famine that destroyed everything till they had to eat bones, and till a man would look towards the sky and see something like smoke between him and it. Allah said:-- \"Then watch you (O Muhammad) for the day when the sky will produce a kind of smoke plainly visible.\" (44.10) And Allah further said:-- \"Verily! We shall withdraw the punishment a little, Verily you will return (to disbelief).\" (44.15) (Will Allah relieve them from torture on the Day of Resurrection?) (The punishment of) the smoke had passed and Al-Baltsha (the destruction of the pagans in the Badr battle) had passed too.",
      "usc_msa_ref": "215",
      "chain": [
        "30418",
        "20005",
        "11060",
        "20285",
        "11018",
        "16"
      ]
    },
    {
      "id": "sahih-bukhari-4758",
      "hadith_no": "4758",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، أخبرنا منصور، عن أبي وائل، عن عبد الله، قال كنا نقول للحى إذا كثروا في الجاهلية أمر بنو فلان‏.‏ حدثنا الحميدي حدثنا سفيان وقال أمر‏.‏",
      "text_en": " Narrated `Abdullah:                     During the Pre-lslamic period of ignorance if any tribe became great in number, we used to say, \"Amira the children of so-and-so.\"",
      "usc_msa_ref": "234",
      "chain": [
        "30026",
        "20005",
        "11067",
        "11353",
        "16",
        "30418",
        "20005"
      ]
    },
    {
      "id": "sahih-bukhari-4767",
      "hadith_no": "4767",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، عن ابن أبي نجيح، عن مجاهد، عن أبي معمر، عن عبد الله بن مسعود  رضى الله عنه  قال دخل النبي صلى الله عليه وسلم مكة وحول البيت ستون وثلاثمائة نصب فجعل يطعنها بعود في يده ويقول ‏{‏جاء الحق وزهق الباطل إن الباطل كان زهوقا‏}‏ ‏{‏جاء الحق وما يبدئ الباطل وما يعيد‏}‏",
      "text_en": " Narrated `Abdullah bin Masud:                     Allah's Apostle entered Mecca (in the year of the Conquest) and there were three-hundred and sixty idols around the Ka`ba. He then started hitting them with a stick in his hand and say: 'Truth (i.e. Islam) has come and falsehood (disbelief) vanished. Truly falsehood (disbelief) is ever bound to vanish.' (17.81) 'Truth has come and falsehood (Iblis) can not create anything.' (34.49)",
      "usc_msa_ref": "244",
      "chain": [
        "30418",
        "20005",
        "11254",
        "11028",
        "11360",
        "16"
      ]
    },
    {
      "id": "sahih-bukhari-4772",
      "hadith_no": "4772",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، حدثنا عمرو بن دينار، قال أخبرني سعيد بن جبير، قال قلت لابن عباس إن نوفا البكالي يزعم أن موسى صاحب الخضر ليس هو موسى صاحب بني إسرائيل‏.‏ فقال ابن عباس كذب عدو الله حدثني أبى بن كعب أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن موسى قام خطيبا في بني إسرائيل فسئل أى الناس أعلم فقال أنا فعتب الله عليه، إذ لم يرد العلم إليه فأوحى الله إليه إن لي عبدا بمجمع البحرين، هو أعلم منك قال موسى يا رب فكيف لي به قال تأخذ معك حوتا فتجعله في مكتل، فحيثما فقدت الحوت فهو ثم، فأخذ حوتا فجعله في مكتل ثم انطلق، وانطلق معه بفتاه يوشع بن نون، حتى إذا أتيا الصخرة وضعا رءوسهما فناما، واضطرب الحوت في المكتل، فخرج منه، فسقط في البحر فاتخذ سبيله في البحر سربا، وأمسك الله عن الحوت جرية الماء فصار عليه مثل الطاق فلما استيقظ، نسي صاحبه أن يخبره بالحوت، فانطلقا بقية يومهما وليلتهما، حتى إذا كان من الغد قال موسى لفتاه آتنا غداءنا لقد لقينا من سفرنا هذا نصبا قال ولم يجد موسى النصب حتى جاوز المكان الذي أمر الله به فقال له فتاه أرأيت إذ أوينا إلى الصخرة فإني نسيت الحوت وما أنسانيه إلا الشيطان أن أذكره، واتخذ سبيله في البحر عجبا قال فكان للحوت سربا ولموسى ولفتاه عجبا فقال موسى ذلك ما كنا نبغي فارتدا على آثارهما قصصا قال رجعا يقصان آثارهما حتى انتهيا إلى الصخرة، فإذا رجل مسجى ثوبا، فسلم عليه موسى‏.‏ فقال الخضر وأنى بأرضك السلام قال أنا موسى‏.‏ قال موسى بني إسرائيل قال نعم أتيتك لتعلمني مما علمت رشدا‏.‏ قال إنك لن تستطيع معي صبرا، يا موسى إني على علم من علم الله علمنيه لا تعلمه أنت وأنت على علم من علم الله علمك الله لا أعلمه‏.‏ فقال موسى ستجدني إن شاء الله صابرا، ولا أعصي لك أمرا‏.‏ فقال له الخضر، فإن اتبعتني فلا تسألني عن شىء حتى أحدث لك منه ذكرا، فانطلقا يمشيان على ساحل البحر، فمرت سفينة فكلموهم أن يحملوهم، فعرفوا الخضر، فحملوه بغير نول فلما ركبا في السفينة، لم يفجأ إلا والخضر قد قلع لوحا من ألواح السفينة بالقدوم‏.‏ فقال له موسى قوم حملونا بغير نول، عمدت إلى سفينتهم فخرقتها لتغرق أهلها لقد جئت شيئا إمرا‏.‏ قال ألم أقل إنك لن تستطيع معي صبرا‏.‏ قال لا تؤاخذني بما نسيت ولا ترهقني من أمري عسرا ‏\"‏‏.‏ قال وقال رسول الله صلى الله عليه وسلم ‏\"‏ وكانت الأولى من موسى نسيانا قال وجاء عصفور فوقع على حرف السفينة فنقر في البحر نقرة، فقال له الخضر ما علمي وعلمك من علم الله إلا مثل ما نقص هذا العصفور من هذا البحر ثم خرجا من السفينة، فبينا هما يمشيان على الساحل، إذ أبصر الخضر غلاما يلعب مع الغلمان، فأخذ الخضر رأسه بيده فاقتلعه بيده فقتله‏.‏ فقال له موسى أقتلت نفسا زاكية بغير نفس لقد جئت شيئا نكرا‏.‏ قال ألم أقل لك إنك لن تستطيع معي صبرا قال وهذا أشد من الأولى، قال إن سألتك عن شىء بعدها فلا تصاحبني قد بلغت من لدني عذرا فانطلقا حتى إذا أتيا أهل قرية استطعما أهلها فأبوا أن يضيفوهما فوجدا فيها جدارا يريد أن ينقض  قال مائل  فقام الخضر فأقامه بيده فقال موسى قوم أتيناهم فلم يطعمونا، ولم يضيفونا، لو شئت لاتخذت عليه أجرا‏.‏ قال ‏{‏هذا فراق بيني وبينك‏}‏ إلى قوله ‏{‏ذلك تأويل ما لم تسطع عليه صبرا‏}‏‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ وددنا أن موسى كان صبر حتى يقص الله علينا من خبرهما ‏\"‏‏.‏ قال سعيد بن جبير فكان ابن عباس يقرأ وكان أمامهم ملك يأخذ كل سفينة صالحة غصبا، وكان يقرأ وأما الغلام فكان كافرا وكان أبواه مؤمنين‏.‏",
      "text_en": " Narrated Sa`id bin Jubair:                     I said to Ibn `Abbas, \"Nauf Al-Bikali claims that Moses, the companion of Al-Khadir was not the Moses of the children of Israel\" Ibn `Abbas said, \"The enemy of Allah (Nauf) told a lie.\" Narrated Ubai bin Ka`b that he heard Allah's Apostle saying, \"Moses got up to deliver a speech before the children of Israel and he was asked, Who is the most learned person among the people?' Moses replied, 'I (am the most learned).' Allah admonished him for he did not ascribe knowledge to Allah alone. So Allah revealed to him: 'At the junction of the two seas there is a slave of Ours who is more learned than you.' Moses asked, 'O my Lord, how can I meet him?' Allah said, 'Take a fish and put it in a basket (and set out), and where you, will lose the fish, you will find him.' So Moses (took a fish and put it in a basket and) set out, along with his boy-servant Yusha` bin Noon, till they reached a rock (on which) they both lay their heads and slept. The fish moved vigorously in the basket and got out of it and fell into the sea and there it took its way through the sea (straight) as in a tunnel). (18.61) Allah stopped the current of water on both sides of the way created by the fish, and so that way was like a tunnel. When Moses got up, his companion forgot to tell him about the fish, and so they carried on their journey during the rest of the day and the whole night. The next morning Moses asked his boy-servant 'Bring us our early meal; no doubt, we have suffered much fatigue in this journey of ours.' (18.62) Moses did not get tired till he had passed the place which Allah had ordered him to seek after. His boy-servant then said to him,' 'Do you remember when we be-took ourselves to the rock I indeed forgot the fish, none but Satan made me forget to remember it. It took its course into the sea in a marvelous way.' (18.63) There was a tunnel for the fish and for Moses and his boy-servant there was astonishment. Moses said, 'That is what we have been seeking'. So they went back retracing their footsteps. (18.64) They both returned, retracing their steps till they reached the rock. Behold ! There they found a man covered with a garment. Moses greeted him. Al-Khadir said astonishingly. 'Is there such a greeting in your land?' Moses said, 'I am Moses.' He said, 'Are you the Moses of the children of Israel?' Moses said, 'I have come to you so that you may teach me of what you have been taught. Al-Khadir said, 'You will not be able to have patience with me. (18.66) O Moses! I have some of Allah's knowledge which He has bestowed upon me but you do not know it; and you too, have some of Allah's knowledge which He has bestowed upon you, but I do not know it.\" Moses said, \"Allah willing, you will find me patient, and I will not disobey you in anything.' (18.6) Al-Khadir said to him. 'If you then follow me, do not ask me about anything until I myself speak to you concerning it.' (18.70), After that both of them proceeded along the sea coast, till a boat passed by and they requested the crew to let them go on board. The crew recognized Al-Khadir and allowed them to get on board free of charge. When they got on board suddenly Moses saw that Al-Khadir had pulled out one of the planks of the boat with an adze. Moses said to him.' These people gave us a free lift, yet you have scuttled their boat so as to drown its people! Truly, you have done a dreadful thing.' (18.71) Al-Khadir said, 'Didn't I say that you can have no patience with me ?' (18.72) Moses said, 'Call me not to account for what I forgot and be not hard upon me for my affair (with you.)\" (18.73) Allah's Apostle said, \"The first excuse given by Moses, was that he had forgotten. Then a sparrow came and sat over the edge of the boat and dipped its beak once in the sea. Al-Khadir said to Moses, 'My knowledge and your knowledge, compared to Allah's knowledge is like what this sparrow has taken out of the sea.' Then they both got out of the boat, and while they were walking on the sea shore, Al-Khadir saw a boy playing with other boys. Al-Khadir got hold of the head of that boy and pulled it out with his hands and killed him. Moses said, 'Have you killed an innocent soul who has killed nobody! Truly, you have done an illegal thing.' (18.74) He said, \"Didn't I tell you that you can have no patience with me?' (18.75) (The sub narrator said, the second blame was stronger than the first one.) Moses said, 'If I ask you about anything after this, keep me not in your company, you have received an excuse from me.' (18.76) Then they both proceeded until they came to the inhabitants of a town. They asked them food but they refused to entertain them. (In that town) they found there a wall on the point of falling down. (18.77) Al-Khadir set it up straight with his own hands. Moses said, 'These are people to whom we came, but they neither fed us nor received us as guests. If you had wished, you could surely have exacted some recompense for it. Al-Khadir said, 'This is the parting between me and you ..that is the interpretation of (those things) over which you were unable to hold patience.' (18.78-82) Allah's Apostle said, \"We wished that Moses could have been more patient so that Allah might have described to us more about their story.\"",
      "usc_msa_ref": "",
      "chain": [
        "30418",
        "20005",
        "11081",
        "11050",
        "39"
      ]
    },
    {
      "id": "sahih-bukhari-4779",
      "hadith_no": "4779",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، عن الأعمش، عن أبي الضحى، عن مسروق، قال سمعت خبابا، قال جئت العاصي بن وائل السهمي أتقاضاه حقا لي عنده، فقال لا أعطيك حتى تكفر بمحمد فقلت لا حتى تموت ثم تبعث‏.‏ قال وإني لميت ثم مبعوث قلت نعم‏.‏ قال إن لي هناك مالا وولدا فأقضيكه، فنزلت هذه الآية ‏{‏أفرأيت الذي كفر بآياتنا وقال لأوتين مالا وولدا‏}‏ رواه الثوري وشعبة وحفص وأبو معاوية ووكيع عن الأعمش‏.‏",
      "text_en": " Narrated Khabbab:                     I came to Al-`Asi bin Wail As-Sahmi and demanded something which he owed me. He said, \"I will not give you (your money) till you disbelieve in Muhammad.\" I said, \"No, I shall not disbelieve in Muhammad till you die and then be resurrected.\" He said, \"Will I die and then be resurrected?\" I said, 'Yes'. He said', \"Then I will have wealth and children there, and I will pay you (there).\" So this Verse was revealed:-- 'Have you then seen him who disbelieved in Our Signs and (yet) says: I shall certainly be given wealth and children? (19.77)",
      "usc_msa_ref": "",
      "chain": [
        "30418",
        "20005",
        "11060",
        "11392",
        "11018",
        "149"
      ]
    },
    {
      "id": "sahih-bukhari-4848",
      "hadith_no": "4848",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، حدثنا عمرو، قال سمعت عكرمة، يقول سمعت أبا هريرة، يقول إن نبي الله صلى الله عليه وسلم قال ‏\"‏ إذا قضى الله الأمر في السماء ضربت الملائكة بأجنحتها خضعانا لقوله كأنه سلسلة على صفوان فإذا فزع عن قلوبهم قالوا ماذا قال ربكم، قالوا للذي قال الحق وهو العلي الكبير فيسمعها مسترق السمع، ومسترق السمع هكذا بعضه فوق بعض  ووصف سفيان بكفه فحرفها وبدد بين أصابعه  فيسمع الكلمة، فيلقيها إلى من تحته ثم يلقيها الآخر إلى من تحته، حتى يلقيها على لسان الساحر أو الكاهن، فربما أدرك الشهاب قبل أن يلقيها، وربما ألقاها قبل أن يدركه، فيكذب معها مائة كذبة، فيقال أليس قد قال لنا يوم كذا وكذا كذا وكذا فيصدق بتلك الكلمة التي سمع من السماء ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Prophet said, \"When Allah decrees some order in the heaven, the angels flutter their wings indicating complete surrender to His saying which sounds like chains being dragged on rock. And when the state of fear disappears, they ask each other, \"What has your Lord ordered? They say that He has said that which is true and just, and He is the Most High, the Most Great.\" (34.23). Then the stealthy listeners (devils) hear this order, and these stealthy listeners are like this, one over the other.\" (Sufyan, a sub-narrator demonstrated that by holding his hand upright and separating the fingers.) A stealthy listener hears a word which he will convey to that which is below him and the second will convey it to that which is below him till the last of them will convey it to the wizard or foreteller. Sometimes a flame (fire) may strike the devil before he can convey it, and sometimes he may convey it before the flame (fire) strikes him, whereupon the wizard adds to that word a hundred lies. The people will then say, 'Didn't he (i.e. magician) tell such-and-such a thing on such-and-such date?' So that magician is said to have told the truth because of the Statement which has been heard from the heavens.\"",
      "usc_msa_ref": "324",
      "chain": [
        "30418",
        "20005",
        "11081",
        "11023",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-4851",
      "hadith_no": "4851",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا الحميدي، حدثنا وكيع، حدثنا الأعمش، عن إبراهيم التيمي، عن أبيه، عن أبي ذر، قال سألت النبي صلى الله عليه وسلم عن قوله تعالى ‏{‏والشمس تجري لمستقر لها‏}‏ قال ‏\"‏ مستقرها تحت العرش ‏\"‏‏.‏",
      "text_en": " Narrated Abu Dharr:                     I asked the Prophet about the Statement of Allah:-- 'And the sun runs on fixed course for a term (decreed), ' (36.38) He said, \"Its course is underneath \"Allah's Throne.\" (Prostration of Sun trees, stars. mentioned in Qur'an and Hadith does not mean like our prostration but it means that these objects are obedient to their Creator (Allah) and they obey for what they have been created for).",
      "usc_msa_ref": "",
      "chain": [
        "30418",
        "20032",
        "11060",
        "11322",
        "11405",
        "23"
      ]
    },
    {
      "id": "sahih-bukhari-4865",
      "hadith_no": "4865",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، حدثنا منصور، عن مجاهد، عن أبي معمر، عن عبد الله  رضى الله عنه  قال اجتمع عند البيت قرشيان وثقفي  أو ثقفيان وقرشي  كثيرة شحم بطونهم قليلة فقه قلوبهم فقال أحدهم أترون أن الله يسمع ما نقول قال الآخر يسمع إن جهرنا ولا يسمع إن أخفينا‏.‏ وقال الآخر إن كان يسمع إذا جهرنا فإنه يسمع إذا أخفينا فأنزل الله عز وجل ‏{‏وما كنتم تستترون أن يشهد عليكم سمعكم ولا أبصاركم ولا جلودكم‏}‏ الآية‏.‏ وكان سفيان يحدثنا بهذا فيقول حدثنا منصور أو ابن أبي نجيح أو حميد أحدهم أو اثنان منهم، ثم ثبت على منصور، وترك ذلك مرارا غير واحدة‏.‏",
      "text_en": " Narrated `Abdullah:                     There gathered near the House (i.e. the Ka`ba) two Quraishi persons and a person from Thaqif (or two persons from Thaqif and one from Quraish), and all of them with very fat bellies but very little intelligence. One of them said, \"Do you think that Allah hears what we say?\" Another said, \"He hears us when we talk in a loud voice, but He doesn't hear us when we talk in a low tone.\" The third said, \"If He can hear when we talk in a loud tone, then He can also hear when we speak in a low tone.\" Then Allah, the Honorable, the Majestic revealed: 'And you have not been screening against yourself lest your ears, and eyes and your skins should testify against you....' (41.22-23)",
      "usc_msa_ref": "341",
      "chain": [
        "30418",
        "20005",
        "11067",
        "11028",
        "11360",
        "16"
      ]
    },
    {
      "id": "sahih-bukhari-4875",
      "hadith_no": "4875",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، حدثنا الزهري، عن سعيد بن المسيب، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ قال الله عز وجل يؤذيني ابن آدم، يسب الدهر وأنا الدهر، بيدي الأمر، أقلب الليل والنهار ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Allah said, 'The son of Adam hurts me for he abuses Time though I am Time: in My Hands are all things, and I cause the revolution of day and night.'",
      "usc_msa_ref": "",
      "chain": [
        "30418",
        "20005",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-4903",
      "hadith_no": "4903",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، قال حدثوني عن الزهري، عن محمد بن جبير بن مطعم، عن أبيه  رضى الله عنه  قال سمعت النبي صلى الله عليه وسلم يقرأ في المغرب بالطور فلما بلغ هذه الآية ‏{‏أم خلقوا من غير شىء أم هم الخالقون * أم خلقوا السموات والأرض بل لا يوقنون * أم عندهم خزائن ربك أم هم المسيطرون‏}‏ كاد قلبي أن يطير‏.‏ قال سفيان فأما أنا فإنما سمعت الزهري يحدث عن محمد بن جبير بن مطعم عن أبيه سمعت النبي صلى الله عليه وسلم يقرأ في المغرب بالطور‏.‏ لم أسمعه زاد الذي قالوا لي‏.‏",
      "text_en": " Narrated Jubair bin Mut`im:                     I heard the Prophet reciting Surat at-Tur in the Maghrib prayer, and when he reached the Verse: 'Were they created by nothing, Or were they themselves the creators, Or did they create the Heavens and the Earth? Nay, but they have no firm belief Or do they own the treasures of Your Lord? Or have they been given the authority to do as they like...' (52.35-37) my heart was about to fly (when I realized this firm argument).",
      "usc_msa_ref": "377",
      "chain": [
        "30418",
        "20005",
        "11013",
        "11058",
        "871"
      ]
    },
    {
      "id": "sahih-bukhari-4910",
      "hadith_no": "4910",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، حدثنا الزهري، سمعت عروة، قلت لعائشة  رضى الله عنها  فقالت إنما كان من أهل بمناة الطاغية التي بالمشلل لا يطوفون بين الصفا والمروة، فأنزل الله تعالى ‏{‏إن الصفا والمروة من شعائر الله‏}‏ فطاف رسول الله صلى الله عليه وسلم والمسلمون‏.‏ قال سفيان مناة بالمشلل من قديد‏.‏ وقال عبد الرحمن بن خالد عن ابن شهاب قال عروة قالت عائشة نزلت في الأنصار كانوا هم وغسان قبل أن يسلموا يهلون لمناة‏.‏ مثله‏.‏ وقال معمر عن الزهري عن عروة عن عائشة كان رجال من الأنصار ممن كان يهل لمناة  ومناة صنم بين مكة والمدينة  قالوا يا نبي الله كنا لا نطوف بين الصفا والمروة تعظيما لمناة‏.‏ نحوه‏.‏",
      "text_en": " Narrated `Urwa:                     I asked `Aisha (regarding the Sai between As Safa and Al-Marwa). She said, \"Out of reverence to the idol Manat which was placed in Al-Mushailal, those who used to assume Ihram in its name, used not to perform Sai between As-Safa and Al-Marwa, so Allah revealed: 'Verily! The As-Safa and Al-Marwa (two mountains at Mecca) are among the symbols of Allah.' (2.158). Thereupon, Allah's Apostle and the Muslims used to perform Sai (between them).\" Sufyan said: The (idol) Manat was at Al-Mushailal in Qudaid. `Aisha added, \"The Verse was revealed in connection with the Ansar. They and (the tribe of) Ghassan used to assume lhram in the name of Manat before they embraced Islam.\" `Aisha added, \"There were men from the Ansar who used to assume lhram in the name of Manat which was an idol between Mecca and Medina. They said, \"O Allah's Apostle! We used not to perform the Tawaf (Sai) between As-Safa and Al-Marwa out of reverence to Manat.\"",
      "usc_msa_ref": "384",
      "chain": [
        "30418",
        "20005",
        "11013",
        "10511"
      ]
    },
    {
      "id": "sahih-bukhari-4939",
      "hadith_no": "4939",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، حدثنا عمرو بن دينار، قال حدثني الحسن بن محمد بن علي، أنه سمع عبيد الله بن أبي رافع، كاتب علي يقول سمعت عليا  رضى الله عنه  يقول بعثني رسول الله صلى الله عليه وسلم أنا والزبير والمقداد فقال ‏\"‏ انطلقوا حتى تأتوا روضة خاخ فإن بها ظعينة معها كتاب فخذوه منها ‏\"‏‏.‏ فذهبنا تعادى بنا خيلنا حتى أتينا الروضة فإذا نحن بالظعينة فقلنا أخرجي الكتاب فقالت ما معي من كتاب‏.‏ فقلنا لتخرجن الكتاب أو لنلقين الثياب‏.‏ فأخرجته من عقاصها فأتينا به النبي صلى الله عليه وسلم فإذا فيه من حاطب بن أبي بلتعة إلى أناس من المشركين ممن بمكة يخبرهم ببعض أمر النبي صلى الله عليه وسلم فقال النبي صلى الله عليه وسلم ‏\"‏ ما هذا يا حاطب ‏\"‏‏.‏ قال لا تعجل على يا رسول الله إني كنت امرأ من قريش ولم أكن من أنفسهم وكان من معك من المهاجرين لهم قرابات يحمون بها أهليهم وأموالهم بمكة فأحببت إذ فاتني من النسب فيهم أن أصطنع إليهم يدا يحمون قرابتي وما فعلت ذلك كفرا ولا ارتدادا عن ديني‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ إنه قد صدقكم ‏\"‏‏.‏ فقال عمر دعني يا رسول الله فأضرب عنقه‏.‏ فقال ‏\"‏ إنه شهد بدرا وما يدريك لعل الله  عز وجل  اطلع على أهل بدر فقال اعملوا ما شئتم فقد غفرت لكم ‏\"‏‏.‏ قال عمرو ونزلت فيه ‏{‏يا أيها الذين آمنوا لا تتخذوا عدوي وعدوكم‏}‏ قال لا أدري الآية في الحديث أو قول عمرو‏.‏ حدثنا علي قيل لسفيان في هذا فنزلت ‏{‏لا تتخذوا عدوي‏}‏ قال سفيان هذا في حديث الناس حفظته من عمرو وما تركت منه حرفا وما أرى أحدا حفظه غيري‏.‏",
      "text_en": " Narrated `Ali:                     Allah's Apostle sent me along with AzZubair and Al-Miqdad and said, \"Proceed till you reach a place called Raudat-Khakh where there is a lady travelling in a howda on a camel. She has a letter. Take the letter from her.\" So we set out, and our horses ran at full pace till we reached Raudat Khakh, and behold, we saw the lady and said (to her), \"Take out the letter!\" She said, \"I have no letter with me.\" We said, \"Either you take out the letter or we will strip you of your clothes.\" So she took the letter out of her hair braid. We brought the letter to the Prophet and behold, it was addressed by Hatib bin Abi Balta'a to some pagans at Mecca, informing them of some of the affairs of the Prophet. The Prophet said, \"What is this, O Hatib?\" Hatib replied, \"Do not be hasty with me, O Allah's Apostle! I am an Ansari man and do not belong to them (Quraish infidels) while the emigrants who were with you had their relatives who used to protect their families and properties at Mecca. So, to compensate for not having blood relation with them.' I intended to do them some favor so that they might protect my relatives (at Mecca), and I did not do this out of disbelief or an inclination to desert my religion.\" The Prophet then said (to his companions), \"He (Hatib) has told you the truth.\" `Umar said, \"O Allah's Apostle! Allow me to chop his head off?\" The Apostle said, \"He is one of those who witnessed (fought in) the Battle of Badr, and what do you know, perhaps Allah looked upon the people of Badr (Badr warriors) and said, 'Do what you want as I have forgiven you.' \" (`Amr, a sub-narrator, said,: This Verse was revealed about him (Hatib): 'O you who believe! Take not My enemies and your enemies as friends or protectors.' (60.1)",
      "usc_msa_ref": "412",
      "chain": [
        "30418",
        "20005",
        "11081",
        "11156",
        "5"
      ]
    },
    {
      "id": "sahih-bukhari-4956",
      "hadith_no": "4956",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، قال حفظناه من عمرو بن دينار قال سمعت جابر بن عبد الله  رضى الله عنهما  يقول كنا في غزاة فكسع رجل من المهاجرين رجلا من الأنصار فقال الأنصاري يا للأنصار‏.‏ وقال المهاجري يا للمهاجرين‏.‏ فسمعها الله رسوله صلى الله عليه وسلم قال ‏\"‏ ما هذا ‏\"‏‏.‏ فقالوا كسع رجل من المهاجرين رجلا من الأنصار فقال الأنصاري يا للأنصار‏.‏ وقال المهاجري ياللمهاجرين‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ دعوها فإنها منتنة ‏\"‏‏.‏ قال جابر وكانت الأنصار حين قدم النبي صلى الله عليه وسلم أكثر، ثم كثر المهاجرون بعد، فقال عبد الله بن أبى أوقد فعلوا، والله لئن رجعنا إلى المدينة ليخرجن الأعز منها الأذل‏.‏ فقال عمر بن الخطاب رضى الله عنه دعني يا رسول الله أضرب عنق هذا المنافق‏.‏ قال النبي صلى الله عليه وسلم ‏\"‏ دعه لا يتحدث الناس أن محمدا يقتل أصحابه ‏\"‏‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     We were in a Ghazwa and a man from the emigrants kicked an Ansari (on the buttocks with his foot). The Ansari man said, \"O the Ansari! (Help!)\" The emigrant said, \"O the emigrants! (Help).\" When Allah's Apostle heard that, he said, \"What is that?\" They said, \"A man from the emigrants kicked a man from the Ansar (on the buttocks his foot). On that the Ansar said, 'O the Ansar!' and the emigrant said, 'O the emigrants!\" The Prophet said' \"Leave it (that call) for it Is a detestable thing.\" The number of Ansar was larger (than that of the emigrants) at the time when the Prophet came to Medina, but later the number of emigrants increased. `Abdullah bin Ubai said, \"Have they, (the emigrants) done so? By Allah, if we return to Medina, surely, the more honorable will expel therefrom the meaner,\" `Umar bin Al-Khattab said, \"O Allah's Apostle! Let me chop off the head of this hypocrite!\" The Prophet said, \"Leave him, lest the people say Muhammad kills his companions:\"",
      "usc_msa_ref": "430",
      "chain": [
        "30418",
        "20005",
        "34"
      ]
    },
    {
      "id": "sahih-bukhari-4964",
      "hadith_no": "4964",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، حدثنا يحيى بن سعيد، قال سمعت عبيد بن حنين، يقول سمعت ابن عباس، يقول أردت أن أسأل، عمر عن المرأتين اللتين، تظاهرتا على رسول الله صلى الله عليه وسلم فمكثت سنة فلم أجد له موضعا، حتى خرجت معه حاجا، فلما كنا بظهران ذهب عمر لحاجته فقال أدركني بالوضوء فأدركته بالإداوة، فجعلت أسكب عليه ورأيت موضعا فقلت يا أمير المؤمنين من المرأتان اللتان تظاهرتا قال ابن عباس فما أتممت كلامي حتى قال عائشة وحفصة‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     I intended to ask `Umar about those two ladies who back each other against 'Allah's Apostle . For one year I was seeking the opportunity to ask this question, but in vain, until once when I accompanied him for Hajj. While we were in Zahran, `Umar went to answer the call of nature and told me to follow him with some water for ablution. So I followed him with a container of water and started pouring water for him. I found it a good opportunity to ask him, so I said, \"O chief of the Believers! Who were those two ladies who had backed each other (against the Prophet)?\" Before I could complete my question, he replied, \"They were `Aisha and Hafsa.\"",
      "usc_msa_ref": "437",
      "chain": [
        "30418",
        "20005",
        "11062",
        "11202",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-4976",
      "hadith_no": "4976",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، حدثنا موسى بن أبي عائشة  وكان ثقة  عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال كان النبي صلى الله عليه وسلم إذا نزل عليه الوحى حرك به لسانه  ووصف سفيان  يريد أن يحفظه فأنزل الله ‏{‏لا تحرك به لسانك لتعجل به‏}‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet used to move his tongue when the divine Inspiration was being revealed to him. (Sufyan, a subnarrator, demonstrated (how the Prophet used to move his lips) and added. \"In order to memorize it.\" So Allah revealed: \"Move not your tongue concerning (the Qur'an) to make haste therewith.\" (75.16)",
      "usc_msa_ref": "449",
      "chain": [
        "30418",
        "20005",
        "11399",
        "11050",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-5162",
      "hadith_no": "5162",
      "source": "Sahih Bukhari",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، حدثنا هشام، عن أبيه، عن زينب، عن أم حبيبة، قالت قلت يا رسول الله هل لك في بنت أبي سفيان قال ‏\"‏ فأفعل ماذا ‏\"‏‏.‏ قلت تنكح‏.‏ قال ‏\"‏ أتحبين ‏\"‏‏.‏ قلت لست لك بمخلية، وأحب من شركني فيك أختي‏.‏ قال ‏\"‏ إنها لا تحل لي ‏\"‏‏.‏ قلت بلغني أنك تخطب‏.‏ قال ‏\"‏ ابنة أم سلمة ‏\"‏‏.‏ قلت نعم‏.‏ قال ‏\"‏ لو لم تكن ربيبتي ما حلت لي، أرضعتني وأباها ثويبة، فلا تعرضن على بناتكن ولا أخواتكن ‏\"‏‏.‏ وقال الليث حدثنا هشام درة بنت أبي سلمة‏.‏",
      "text_en": " Narrated Um Habiba:                     I said, \"O Allah's Apostle! Do you like to have (my sister) the daughter of Abu Sufyan?\" The Prophet said, \"What shall I do (with her)?\" I said, \"Marry her.\" He said, \"Do you like that?\" I said, \"(Yes), for even now I am not your only wife, so I like that my sister should share you with me.\" He said, \"She is not lawful for me (to marry).\" I said, \"We have heard that you want to marry.\" He said, \"The daughter of Um Salama?\" I said, \"Yes.\" He said, \"Even if she were not my stepdaughter, she should be unlawful for me to marry, for Thuwaiba suckled me and her father (Abu Salama). So you should neither present your daughters, nor your sisters, to me.\"",
      "usc_msa_ref": "42",
      "chain": [
        "30418",
        "20005",
        "11065",
        "10511",
        "57",
        "59"
      ]
    },
    {
      "id": "sahih-bukhari-5309",
      "hadith_no": "5309",
      "source": "Sahih Bukhari",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا الحميدي، حدثنا الوليد، حدثنا الأوزاعي، قال سألت الزهري أى أزواج النبي صلى الله عليه وسلم استعاذت منه قال أخبرني عروة عن عائشة  رضى الله عنها  أن ابنة الجون لما أدخلت على رسول الله صلى الله عليه وسلم ودنا منها قالت أعوذ بالله منك‏.‏ فقال لها ‏\"‏ لقد عذت بعظيم، الحقي بأهلك ‏\"‏‏.‏ قال أبو عبد الله رواه حجاج بن أبي منيع عن جده عن الزهري أن عروة أخبره أن عائشة قالت‏.‏",
      "text_en": " Narrated Al-Awza:                     I asked Az-Zuhri, \"Which of the wives of the Prophet sought refuge with Allah from him?\" He said \"I was told by 'Ursa that `Aisha said, 'When the daughter of Al-Jaun was brought to Allah's Apostle (as his bride) and he went near her, she said, \"I seek refuge with Allah from you.\" He said, \"You have sought refuge with The Great; return to your family.\"",
      "usc_msa_ref": "181",
      "chain": [
        "30418",
        "20733",
        "20024"
      ]
    },
    {
      "id": "sahih-bukhari-5416",
      "hadith_no": "5416",
      "source": "Sahih Bukhari",
      "chapter": "Supporting the Family - كتاب النفقات",
      "chapter_no": "69",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، حدثنا عبيد الله بن أبي يزيد، سمع مجاهدا، سمعت عبد الرحمن بن أبي ليلى، يحدث عن علي بن أبي طالب، أن فاطمة  عليها السلام  أتت النبي صلى الله عليه وسلم تسأله خادما فقال ‏\"‏ ألا أخبرك ما هو خير لك منه، تسبحين الله عند منامك ثلاثا وثلاثين، وتحمدين الله ثلاثا وثلاثين، وتكبرين الله أربعا وثلاثين ‏\"‏‏.‏  ثم قال سفيان إحداهن أربع وثلاثون  فما تركتها بعد، قيل ولا ليلة صفين قال ولا ليلة صفين‏.‏",
      "text_en": " Narrated `Ali bin Abi Talib:                     Fatima came to the Prophet asking for a servant. He said, \"May I inform you of something better than that? When you go to bed, recite \"Subhan Allah' thirty three times, 'Al hamduli l-lah' thirty three times, and 'Allahu Akbar' thirty four times. 'All added, 'I have never failed to recite it ever since.\" Somebody asked, \"Even on the night of the battle of Siffin?\" He said, \"No, even on the night of the battle of Siffin.\"",
      "usc_msa_ref": "",
      "chain": [
        "30418",
        "20005",
        "11258",
        "11028",
        "11196",
        "5"
      ]
    },
    {
      "id": "sahih-bukhari-5578",
      "hadith_no": "5578",
      "source": "Sahih Bukhari",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، حدثنا هشام، عن فاطمة، عن أسماء، قالت نحرنا فرسا على عهد رسول الله صلى الله عليه وسلم فأكلناه‏.‏",
      "text_en": " Narrated Asma':                     We slaughtered a horse during the lifetime of Allah's Apostle and ate it.",
      "usc_msa_ref": "428",
      "chain": [
        "30418",
        "20005",
        "11065",
        "10526",
        "70"
      ]
    },
    {
      "id": "sahih-bukhari-5596",
      "hadith_no": "5596",
      "source": "Sahih Bukhari",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، حدثنا الزهري، قال أخبرني عبيد الله بن عبد الله بن عتبة، أنه سمع ابن عباس، يحدثه عن ميمونة، أن فأرة، وقعت، في سمن فماتت، فسئل النبي صلى الله عليه وسلم عنها فقال ‏\"‏ ألقوها وما حولها وكلوه ‏\"‏‏.‏ قيل لسفيان فإن معمرا يحدثه عن الزهري عن سعيد بن المسيب عن أبي هريرة‏.‏ قال ما سمعت الزهري يقول إلا عن عبيد الله عن ابن عباس عن ميمونة عن النبي صلى الله عليه وسلم ولقد سمعته منه مرارا‏.‏",
      "text_en": " Narrated Maimuna:                     A mouse fell into the butter-fat and died. The Prophet was asked about that. He said, \"Throw away the mouse and the butter-fat that surrounded it, and eat the rest of the butter-fat (As-Samn).",
      "usc_msa_ref": "446",
      "chain": [
        "30418",
        "20005",
        "11013",
        "11004",
        "61"
      ]
    },
    {
      "id": "sahih-bukhari-5664",
      "hadith_no": "5664",
      "source": "Sahih Bukhari",
      "chapter": "Drinks - كتاب الأشربة",
      "chapter_no": "74",
      "text_ar": "حدثنا الحميدي، سمع سفيان، أخبرنا سالم أبو النضر، أنه سمع عميرا، مولى أم الفضل يحدث عن أم الفضل، قالت شك الناس في صيام رسول الله صلى الله عليه وسلم يوم عرفة، فأرسلت إليه بإناء فيه لبن فشرب‏.‏ فكان سفيان ربما قال شك الناس في صيام رسول الله صلى الله عليه وسلم يوم عرفة فأرسلت إليه أم الفضل‏.‏ فإذا وقف عليه قال هو عن أم الفضل‏.‏",
      "text_en": " Narrated Um Al-Fadl:                     The people doubted whether Allah's Apostle was fasting or the Day of `Arafat or not. So I sent a cup containing milk to him and he drank it.",
      "usc_msa_ref": "509",
      "chain": [
        "30418",
        "20005",
        "11164"
      ]
    },
    {
      "id": "sahih-bukhari-5960",
      "hadith_no": "5960",
      "source": "Sahih Bukhari",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، حدثنا الزهري، عن أبي سلمة، وسليمان بن يسار، عن أبي هريرة  رضى الله عنه  قال النبي صلى الله عليه وسلم ‏\"‏ إن اليهود والنصارى لا يصبغون فخالفوهم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Jews and Christians do not dye their hair so you should do the opposite of what they do.",
      "usc_msa_ref": "786",
      "chain": [
        "30418",
        "20005",
        "11013",
        "10567",
        "11005",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-6004",
      "hadith_no": "6004",
      "source": "Sahih Bukhari",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، حدثنا هشام، أنه سمع فاطمة بنت المنذر، تقول سمعت أسماء، قالت سألت امرأة النبي صلى الله عليه وسلم فقالت يا رسول الله إن ابنتي أصابتها الحصبة، فامرق شعرها، وإني زوجتها أفأصل فيه فقال ‏\"‏ لعن الله الواصلة والموصولة ‏\"‏‏.‏",
      "text_en": " Narrated Asma':                     A woman asked the Prophet saying, \"0 Allah's Apostle! My daughter got measles and her hair fell out. Now that I got her married, may I let her use false hair?\" He said (to her), \"Allah has cursed the lady who lengthens hair artificially and the one who gets her hair lengthened artificially.\"",
      "usc_msa_ref": "824",
      "chain": [
        "30418",
        "20005",
        "11065",
        "10526",
        "70"
      ]
    },
    {
      "id": "sahih-bukhari-6015",
      "hadith_no": "6015",
      "source": "Sahih Bukhari",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، حدثنا الأعمش، عن مسلم، قال كنا مع مسروق في دار يسار بن نمير، فرأى في صفته تماثيل فقال سمعت عبد الله قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ إن أشد الناس عذابا عند الله يوم القيامة المصورون ‏\"‏‏.‏",
      "text_en": " Narrated Muslim:                     We were with Masruq at the house of Yasar bin Numair. Masruq saw pictures on his terrace and said, \"I heard `Abdullah saying that he heard the Prophet saying, \"The people who will receive the severest punishment from Allah will be the picture makers.'\"",
      "usc_msa_ref": "834",
      "chain": [
        "30418",
        "20005",
        "11060",
        "20285",
        "20025"
      ]
    },
    {
      "id": "sahih-bukhari-6044",
      "hadith_no": "6044",
      "source": "Sahih Bukhari",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، حدثنا هشام بن عروة، أخبرني أبي، أخبرتني أسماء ابنة أبي بكر  رضى الله عنهما  قالت أتتني أمي راغبة في عهد النبي صلى الله عليه وسلم فسألت النبي صلى الله عليه وسلم آصلها قال ‏\"‏ نعم ‏\"‏‏.‏ قال ابن عيينة فأنزل الله تعالى فيها ‏{‏لا ينهاكم الله عن الذين لم يقاتلوكم في الدين‏}‏",
      "text_en": " Narrated Asma' bint Abu Bakr:                     My mother came to me, hoping (for my favor) during the lifetime of the Prophet asked the Prophet, \"May I treat her kindly?\" He replied, \"Yes.\" Ibn 'Uyaina said, \"Then Allah revealed: 'Allah forbids you not with regards to those who fought not against you because of religion, and drove you not out from your homes, that you should show them kindness and deal justly with them.'.......(60.8)",
      "usc_msa_ref": "9",
      "chain": [
        "30418",
        "20005",
        "11065",
        "10511",
        "70"
      ]
    },
    {
      "id": "sahih-bukhari-6132",
      "hadith_no": "6132",
      "source": "Sahih Bukhari",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، حدثنا هشام بن عروة، عن أبيه، عن عائشة  رضى الله عنها  قالت مكث النبي صلى الله عليه وسلم كذا وكذا يخيل إليه أنه يأتي أهله ولا يأتي، قالت عائشة فقال لي ذات يوم ‏\"‏ يا عائشة إن الله أفتاني في أمر استفتيته فيه، أتاني رجلان، فجلس أحدهما عند رجلى والآخر عند رأسي، فقال الذي عند رجلى للذي عند رأسي ما بال الرجل قال مطبوب‏.‏ يعني مسحورا‏.‏ قال ومن طبه قال لبيد بن أعصم‏.‏ قال وفيم قال في جف طلعة ذكر في مشط ومشاقة، تحت رعوفة في بئر ذروان ‏\"‏‏.‏ فجاء النبي صلى الله عليه وسلم فقال ‏\"‏ هذه البئر التي أريتها كأن رءوس نخلها رءوس الشياطين، وكأن ماءها نقاعة الحناء ‏\"‏‏.‏ فأمر به النبي صلى الله عليه وسلم فأخرج‏.‏ قالت عائشة فقلت يا رسول الله فهلا  تعني  تنشرت فقال النبي صلى الله عليه وسلم ‏\"‏ أما الله فقد شفاني، وأما أنا فأكره أن أثير على الناس شرا ‏\"‏‏.‏ قالت ولبيد بن أعصم رجل من بني زريق حليف ليهود‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet continued for such-and-such period imagining that he has slept (had sexual relations) with his wives, and in fact he did not. One day he said, to me, \"O `Aisha! Allah has instructed me regarding a matter about which I had asked Him. There came to me two men, one of them sat near my feet and the other near my head. The one near my feet, asked the one near my head (pointing at me), 'What is wrong with this man? The latter replied, 'He is under the effect of magic.' The first one asked, 'Who had worked magic on him?' The other replied, 'Lubaid bin Asam.' The first one asked, 'What material (did he use)?' The other replied, 'The skin of the pollen of a male date tree with a comb and the hair stuck to it, kept under a stone in the well of Dharwan.\"' Then the Prophet went to that well and said, \"This is the same well which was shown to me in the dream. The tops of its date-palm trees look like the heads of the devils, and its water looks like the Henna infusion.\" Then the Prophet ordered that those things be taken out. I said, \"O Allah's Apostle! Won't you disclose (the magic object)?\" The Prophet said, \"Allah has cured me and I hate to circulate the evil among the people.\" `Aisha added, \"(The magician) Lubaid bin Asam was a man from Bani Zuraiq, an ally of the Jews.\"",
      "usc_msa_ref": "89",
      "chain": [
        "30418",
        "20005",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-6315",
      "hadith_no": "6315",
      "source": "Sahih Bukhari",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، عن ابن طاوس، عن أبيه، عن ابن عباس  رضى الله عنهما  قال لم أر شيئا أشبه باللمم من قول أبي هريرة‏.‏ حدثني محمود أخبرنا عبد الرزاق أخبرنا معمر عن ابن طاوس عن أبيه عن ابن عباس قال ما رأيت شيئا أشبه باللمم مما قال أبو هريرة عن النبي صلى الله عليه وسلم ‏\"‏ إن الله كتب على ابن آدم حظه من الزنا، أدرك ذلك لا محالة، فزنا العين النظر، وزنا اللسان المنطق، والنفس تمنى وتشتهي، والفرج يصدق ذلك كله ويكذبه ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     I have not seen a thing resembling 'lamam' (minor sins) than what Abu Huraira 'narrated from the Prophet who said \"Allah has written for Adam's son his share of adultery which he commits inevitably. The adultery of the eyes is the sight (to gaze at a forbidden thing), the adultery of the tongue is the talk, and the inner self wishes and desires and the private parts testify all this or deny it.\"",
      "usc_msa_ref": "260",
      "chain": [
        "30418",
        "20005",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-6438",
      "hadith_no": "6438",
      "source": "Sahih Bukhari",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، حدثنا موسى بن عقبة، قال سمعت أم خالد بنت خالد  قال ولم أسمع أحدا سمع من النبي، صلى الله عليه وسلم غيرها  قالت سمعت النبي صلى الله عليه وسلم يتعوذ من عذاب القبر‏.‏",
      "text_en": " Narrated Um Khalid bint Khalid:                     I heard the Prophet seeking refuge with Allah from the punishment of the grave.",
      "usc_msa_ref": "375",
      "chain": [
        "30418",
        "20005",
        "11106",
        "740"
      ]
    },
    {
      "id": "sahih-bukhari-6525",
      "hadith_no": "6525",
      "source": "Sahih Bukhari",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، حدثنا الأعمش، قال سمعت أبا وائل، قال عدنا خبابا فقال هاجرنا مع النبي صلى الله عليه وسلم نريد وجه الله، فوقع أجرنا على الله، فمنا من مضى لم يأخذ من أجره، منهم مصعب بن عمير قتل يوم أحد، وترك نمرة فإذا غطينا رأسه بدت رجلاه، وإذا غطينا رجليه بدا رأسه، فأمرنا النبي صلى الله عليه وسلم أن نغطي رأسه، ونجعل على رجليه من الإذخر، ومنا من أينعت له ثمرته فهو يهدبها‏.‏",
      "text_en": " Narrated Abu Wail:                     We paid a visit to Khabbab who was sick, and he said, \"We migrated with the Prophet for Allah's Sake and our wages became due on Allah. Some of us died without having received anything of the wages, and one of them was Mus`ab bin `Umar, who was martyred on the day of the battle of Uhud, leaving only one sheet (to shroud him in). If we covered his head with it, his feet became uncovered, and if we covered his feet with it, his head became uncovered. So the Prophet ordered us to cover his head with it and put some Idhkhir (a kind of grass) over his feet. On the other hand, some of us have had the fruits (of our good deed) and are plucking them (in this world).",
      "usc_msa_ref": "455",
      "chain": [
        "30418",
        "20005",
        "11060",
        "11353"
      ]
    },
    {
      "id": "sahih-bukhari-6593",
      "hadith_no": "6593",
      "source": "Sahih Bukhari",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، حدثنا عبد الله بن أبي بكر بن عمرو بن حزم، سمع أنس بن مالك، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ يتبع الميت ثلاثة، فيرجع اثنان ويبقى معه واحد، يتبعه أهله وماله وعمله، فيرجع أهله وماله، ويبقى عمله ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Allah's Apostle said, \"When carried to his grave, a dead person is followed by three, two of which return (after his burial) and one remains with him: his relative, his property, and his deeds follow him; relatives and his property go back while his deeds remain with him.\"",
      "usc_msa_ref": "521",
      "chain": [
        "30418",
        "20005",
        "11104",
        "19"
      ]
    },
    {
      "id": "sahih-bukhari-6694",
      "hadith_no": "6694",
      "source": "Sahih Bukhari",
      "chapter": "Divine Will (Al-Qadar) - كتاب القدر",
      "chapter_no": "82",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، حدثنا عمرو، عن عكرمة، عن ابن عباس  رضى الله عنهما  ‏{‏وما جعلنا الرؤيا التي أريناك إلا فتنة للناس‏}‏ قال هي رؤيا عين أريها رسول الله صلى الله عليه وسلم ليلة أسري به إلى بيت المقدس‏.‏ قال ‏{‏والشجرة الملعونة في القرآن‏}‏ قال هي شجرة الزقوم‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     (regarding the Verse) \"And We granted the vision (Ascension to the heavens \"Miraj\") which We showed you (O Muhammad as an actual eye witness) but as a trial for mankind.' (17.60): Allah's Apostle actually saw with his own eyes the vision (all the things which were shown to him) on the night of his Night Journey to Jerusalem (and then to the heavens). The cursed tree which is mentioned in the Qur'an is the tree of Az-Zaqqum.",
      "usc_msa_ref": "610",
      "chain": [
        "30418",
        "20005",
        "11081",
        "11023",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-6753",
      "hadith_no": "6753",
      "source": "Sahih Bukhari",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، حدثنا عمرو بن دينار، أخبرني سعيد بن جبير، قال قلت لابن عباس فقال حدثنا أبى بن كعب، أنه سمع رسول الله صلى الله عليه وسلم ‏{‏لا تؤاخذني بما نسيت ولا ترهقني من أمري عسرا‏}‏ قال ‏\"‏ كانت الأولى من موسى نسيانا ‏\"‏‏.‏",
      "text_en": "      Narrated Ubai bin Ka'b:                          that he heard Allah's Apostle saying, \"(Moses) said, 'Call me not to      account for what I forget and be not hard upon me for my affair (with      you)' (18.73) the first excuse of Moses was his forgetfulness.\"",
      "usc_msa_ref": "",
      "chain": [
        "30418",
        "20005",
        "11081",
        "11050",
        "39"
      ]
    },
    {
      "id": "sahih-bukhari-6819",
      "hadith_no": "6819",
      "source": "Sahih Bukhari",
      "chapter": "Laws of Inheritance (Al-Faraa'id) - كتاب الفرائض",
      "chapter_no": "85",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، حدثنا الزهري، قال أخبرني عامر بن سعد بن أبي وقاص، عن أبيه، قال مرضت بمكة مرضا، فأشفيت منه على الموت، فأتاني النبي صلى الله عليه وسلم يعودني فقلت يا رسول الله إن لي مالا كثيرا، وليس يرثني إلا ابنتي، أفأتصدق بثلثى مالي قال ‏\"‏ لا ‏\"‏‏.‏ قال قلت فالشطر قال ‏\"‏ لا ‏\"‏‏.‏ قلت الثلث قال ‏\"‏ الثلث كبير إنك إن تركت ولدك أغنياء خير من أن تتركهم عالة يتكففون الناس، وإنك لن تنفق نفقة إلا أجرت عليها، حتى اللقمة ترفعها إلى في امرأتك ‏\"‏‏.‏ فقلت يا رسول الله أأخلف عن هجرتي فقال ‏\"‏ لن تخلف بعدي فتعمل عملا تريد به وجه الله، إلا ازددت به رفعة ودرجة، ولعل أن تخلف بعدي حتى ينتفع بك أقوام ويضر بك آخرون، لكن البائس سعد ابن خولة يرثي له رسول الله صلى الله عليه وسلم أن مات بمكة ‏\"‏‏.‏ قال سفيان وسعد بن خولة رجل من بني عامر بن لؤى‏.‏",
      "text_en": " Narrated Sa`d bin Abi Waqqas:                     I was stricken by an ailment that led me to the verge of death. The Prophet came to pay me a visit. I said, \"O Allah's Apostle! I have much property and no heir except my single daughter. Shall I give two-thirds of my property in charity?\" He said, \"No.\" I said, \"Half of it?\" He said, \"No.\" I said, \"Onethird of it?\" He said, \"You may do so) though one-third is also to a much, for it is better for you to leave your off-spring wealthy than to leave them poor, asking others for help. And whatever you spend (for Allah's sake) you will be rewarded for it, even for a morsel of food which you may put in the mouth of your wife.\" I said, \"O Allah's Apostle! Will I remain behind and fail to complete my emigration?\" The Prophet said, \"If you are left behind after me, whatever good deeds you will do for Allah's sake, that will upgrade you and raise you high. May be you will have long life so that some people may benefit by you and others (the enemies) be harmed by you.\" But Allah's Apostle felt sorry for Sa`d bin Khaula as he died in Mecca. (Sufyan, a sub-narrator said that Sa`d bin Khaula was a man from the tribe of Bani 'Amir bin Lu'ai.)",
      "usc_msa_ref": "725",
      "chain": [
        "30418",
        "20005",
        "11013",
        "10554",
        "9"
      ]
    },
    {
      "id": "sahih-bukhari-7354",
      "hadith_no": "7354",
      "source": "Sahih Bukhari",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، عن مسعر، وغيره، عن قيس بن مسلم، عن طارق بن شهاب، قال قال رجل من اليهود لعمر يا أمير المؤمنين لو أن علينا نزلت هذه الآية ‏{‏ اليوم أكملت لكم دينكم وأتممت عليكم نعمتي ورضيت لكم الإسلام دينا‏}‏ لاتخذنا ذلك اليوم عيدا‏.‏ فقال عمر إني لأعلم أى يوم نزلت هذه الآية، نزلت يوم عرفة في يوم جمعة‏.‏ سمع سفيان من مسعر ومسعر قيسا وقيس طارقا‏.‏",
      "text_en": " Narrated Tariq bin Shihab:                     A Jew said to `Umar, \"O Chief of the Believers, if this verse: 'This day I have perfected your religion for you, completed My favors upon you, and have chosen for you, Islam as your religion.' (5.3) had been revealed upon us, we would have taken that day as an `Id (festival) day.\" `Umar said, \"I know definitely on what day this Verse was revealed; it was revealed on the day of `Arafat, on a Friday.\"",
      "usc_msa_ref": "373",
      "chain": [
        "30418",
        "20005",
        "20359",
        "11386",
        "3680"
      ]
    },
    {
      "id": "sahih-bukhari-7407",
      "hadith_no": "7407",
      "source": "Sahih Bukhari",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، حدثنا الأعمش، عن عبد الله بن مرة، عن مسروق، عن عبد الله، قال قال النبي صلى الله عليه وسلم ‏\"‏ ليس من نفس تقتل ظلما إلا كان على ابن آدم الأول كفل منها  وربما قال سفيان من دمها  لأنه أول من سن القتل أولا ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     The Prophet said, \"None is killed unjustly, but the first son of Adam will have a part of its burden.\" Sufyan said, \"..a part of its blood because he was the first to establish the tradition of murdering\"",
      "usc_msa_ref": "423",
      "chain": [
        "30418",
        "20005",
        "11060",
        "11362",
        "11018",
        "16"
      ]
    },
    {
      "id": "sahih-bukhari-7535",
      "hadith_no": "7535",
      "source": "Sahih Bukhari",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، حدثنا عبد الملك بن أعين، وجامع بن أبي راشد، عن أبي وائل، عن عبد الله  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من اقتطع مال امرئ مسلم بيمين كاذبة، لقي الله وهو عليه غضبان ‏\"‏‏.‏ قال عبد الله ثم قرأ رسول الله صلى الله عليه وسلم مصداقه من كتاب الله جل ذكره ‏{‏إن الذين يشترون بعهد الله وأيمانهم ثمنا قليلا أولئك لا خلاق لهم في الآخرة ولا يكلمهم الله‏}‏ الآية‏.‏",
      "text_en": " Narrated `Abdullah:                     The Prophet said, \"Whoever takes the property of a Muslim by taking a false oath, will meet Allah Who will be angry with him.\" Then the Prophet recited the Verse:-- 'Verily those who purchase a small gain at the cost of Allah's Covenant and their oaths, they shall have no portion in the Hereafter, neither will Allah speak to them, nor look at them.' (3.77)",
      "usc_msa_ref": "537",
      "chain": [
        "30418",
        "20005",
        "11367",
        "11327",
        "11353",
        "16"
      ]
    },
    {
      "id": "sahih-bukhari-7550",
      "hadith_no": "7550",
      "source": "Sahih Bukhari",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا الحميدي، حدثنا الوليد بن مسلم، حدثنا ابن جابر، حدثني عمير بن هانئ، أنه سمع معاوية، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ لا يزال من أمتي أمة قائمة بأمر الله، ما يضرهم من كذبهم، ولا من خالفهم، حتى يأتي أمر الله وهم على ذلك ‏\"‏‏.‏ فقال مالك بن يخامر سمعت معاذا يقول وهم بالشأم‏.‏ فقال معاوية هذا مالك يزعم أنه سمع معاذا يقول وهم بالشأم‏.‏",
      "text_en": " Narrated Muawiya:                     I heard the Prophet saying, \"A group of my followers will keep on following Allah's Laws strictly and they will not be harmed by those who will disbelieve them or stand against them till Allah's Order (The Hour) will come while they will be in that state.\"",
      "usc_msa_ref": "552",
      "chain": [
        "30418",
        "20733",
        "11415",
        "27"
      ]
    },
    {
      "id": "sahih-bukhari-7583",
      "hadith_no": "7583",
      "source": "Sahih Bukhari",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، حدثنا الزهري، عن سعيد بن المسيب، عن أبي هريرة، قال قال النبي صلى الله عليه وسلم ‏\"‏ قال الله تعالى يؤذيني ابن آدم، يسب الدهر وأنا الدهر، بيدي الأمر، أقلب الليل والنهار ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Allah said: \"The son of Adam hurts Me by abusing Time, for I am Time; in My Hands are all things and I cause the revolution of night and day.' \" (See Hadith No. 351, Vol. 6)",
      "usc_msa_ref": "583",
      "chain": [
        "30418",
        "20005",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-7615",
      "hadith_no": "7615",
      "source": "Sahih Bukhari",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، حدثنا منصور، عن مجاهد، عن أبي معمر، عن عبد الله  رضى الله عنه  قال اجتمع عند البيت ثقفيان وقرشي، أو قرشيان وثقفي، كثيرة شحم بطونهم قليلة فقه قلوبهم فقال أحدهم أترون أن الله يسمع ما نقول قال الآخر يسمع إن جهرنا ولا يسمع إن أخفينا وقال الآخر إن كان يسمع إذا جهرنا فإنه يسمع إذا أخفينا‏.‏ فأنزل الله تعالى ‏{‏وما كنتم تستترون أن يشهد عليكم سمعكم ولا أبصاركم ولا جلودكم‏}‏ الآية‏.‏",
      "text_en": " Narrated `Abdullah:                     Two person of Bani Thaqif and one from Quarish (or two persons from Quraish and one from Bani Thaqif) who had fat bellies but little wisdom, met near the Ka`ba. One of them said, \"Did you see that Allah hears what we say? \" The other said, \"He hears us if we speak aloud, but He does not hear if we speak in stealthy quietness (softly).\" The third fellow said, \"If He hears when we speak aloud, then He surely hears us if we speak in stealthy quietness (softly).\" So Allah revealed the Verse:-- 'And you have not been screening against yourselves, lest your ears, and your eyes and your skins should testify against you...\" (41.22)",
      "usc_msa_ref": "612",
      "chain": [
        "30418",
        "20005",
        "11067",
        "11028",
        "11360",
        "16"
      ]
    },
    {
      "id": "sahih-muslim-61",
      "hadith_no": "61",
      "source": "Sahih Muslim",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "وحدثني سلمة بن شبيب، حدثنا الحميدي، حدثنا سفيان، قال كان الناس يحملون عن جابر، قبل أن يظهر، ما أظهر فلما أظهر ما أظهر اتهمه الناس في حديثه وتركه بعض الناس فقيل له وما أظهر قال الإيمان بالرجعة ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30417",
        "30418",
        "20005"
      ]
    },
    {
      "id": "sahih-muslim-65",
      "hadith_no": "65",
      "source": "Sahih Muslim",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "وحدثني سلمة بن شبيب، حدثنا الحميدي، حدثنا سفيان، قال سمعت رجلا، سأل جابرا عن قوله عز وجل ‏{‏ فلن أبرح الأرض حتى يأذن لي أبي أو يحكم الله لي وهو خير الحاكمين‏}‏ فقال جابر لم يجئ تأويل هذه ‏.‏ قال سفيان وكذب ‏.‏ فقلنا لسفيان وما أراد بهذا فقال إن الرافضة تقول إن عليا في السحاب فلا نخرج مع من خرج من ولده حتى ينادي مناد من السماء ‏.‏ يريد عليا أنه ينادي اخرجوا مع فلان ‏.‏ يقول جابر فذا تأويل هذه الآية وكذب كانت في إخوة يوسف صلى الله عليه وسلم ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30417",
        "30418",
        "20005",
        "34"
      ]
    },
    {
      "id": "sahih-muslim-66",
      "hadith_no": "66",
      "source": "Sahih Muslim",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "وحدثني سلمة، حدثنا الحميدي، حدثنا سفيان، قال سمعت جابرا، يحدث بنحو من ثلاثين ألف حديث ما أستحل أن أذكر منها شيئا وأن لي كذا وكذا ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "237",
        "30418",
        "20005",
        "34"
      ]
    },
    {
      "id": "sahih-muslim-79",
      "hadith_no": "79",
      "source": "Sahih Muslim",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "وحدثني سلمة بن شبيب، حدثنا الحميدي، حدثنا سفيان، قال سمعت أبا موسى، يقول حدثنا عمرو بن عبيد، قبل أن يحدث، ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30417",
        "30418",
        "20005",
        "30170",
        "24341"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1096",
      "hadith_no": "1096",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Marriage - كتاب النكاح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا الحميدي، عن سفيان، نحو هذا ‏.‏ وقد روى غير، واحد، هذا الحديث عن ابن عيينة، عن الزهري، عن أنس، ولم يذكروا فيه عن وائل، عن ابنه، ‏.‏ قال أبو عيسى وكان سفيان بن عيينة يدلس في هذا الحديث فربما لم يذكر فيه عن وائل عن ابنه وربما ذكره ‏.‏",
      "text_en": " (Another chain similar to the narration as no. 1095) :                     Others have reported this Hadith from Ibn Uyainah, from Az-Zuhri, from Anas, and they did not mention \"from Wa'il, from his son Nawf\" in it.",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "30418",
        "20005",
        "11013",
        "19",
        "20005"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3122",
      "hadith_no": "3122",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on The Virtues of the Qur'an - كتاب فضائل القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمد بن إسماعيل، قال حدثنا الحميدي، حدثنا سفيان بن عيينة، في تفسير حديث عبد الله بن مسعود قال ما خلق الله من سماء ولا أرض أعظم من آية الكرسي ‏.‏ قال سفيان لأن آية الكرسي هو كلام الله وكلام الله أعظم من خلق الله من السماء والأرض ‏.‏",
      "text_en": " Narrated 'Abdullah bin Mas'ud:                     \"Allah has not created in the heavens nor in the earth what is more magnificent than Ayat Al-Kursi.\" Sufyan said: \"Because Ayat Al-Kursi is the Speech of Allah, and Allah's Speech is greater than Allah's creation of the heavens and the earth.\"",
      "usc_msa_ref": "",
      "chain": [
        "34188",
        "30418",
        "20005"
      ]
    }
  ],
  "total_hadiths": 79
}