{
  "id": "30417",
  "name": "Salmah bin Shbyb سلمة بن شبيب",
  "full_name": "Salmah bin Shbyb سلمة بن شبيب",
  "grade": "3rd Century AH [11th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "240",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Nisapur",
      "Makkah"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  4  -  ثقة ]"
    ],
    "tags": [
      "al-Nisapuri",
      "Makkah"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20121",
      "name": "'Abdur-Razzaq عبد الرزاق بن همام",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20318",
      "name": "Hammad bin Usamah حماد بن أسامة - أبو أسامة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20650",
      "name": "Zayd bin al-Habab al-'Akli زيد بن الحباب أبو الحسين العكلي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "28280",
      "name": "'Abdullah bin Ja'far عبد الله بن جعفر الرقي المعيطي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20472",
      "name": "Yazid bin Harun يزيد بن هارون",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20442",
      "name": "'Abdul Quddus bin al-Hajjaj al-Khulani عبد القدوس بن الحجاج الخولاني",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20418",
      "name": "al-Hasan bin Muhammad bin A'yn الحسن بن محمد بن أعين",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "23033",
      "name": "'Abdullah bin Yazid al-'Advi عبد الله بن يزيد العدوي المقري القصير",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "28010",
      "name": "Ibrahim bin Khalid bin 'Ubaid إبراهيم بن خالد بن عبيد القرشي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20547",
      "name": "Sulaiman bin Da'ud bin al-Jarud سليمان بن داود أبو داود الطيالسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20640",
      "name": "Mrwan bin Muhammad bin Hsan مروان بن محمد بن حسان الأسدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "32012",
      "name": "'Abdullah bin Ibrahim عبد الله بن إبراهيم بن أبي عمرو",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "students": [
    {
      "id": "30004",
      "name": "Ibn Maja ابن ماجة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]"
    },
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "30005",
      "name": "Imam Tirmidhi الترمذي محمد بن عيسى بن سورة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30006",
      "name": "Imam Nasa'i أحمد بن شعيب بن علي بن سنان النسائي",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    },
    {
      "id": "38044",
      "name": "Ahmed bin al-Frat bin Khalid أحمد بن الفرات بن خالد",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30554",
      "name": "Abu Zara' al-Razi أبو زرعة الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "36659",
      "name": "Muhammad bin Harun bin Ibrahim محمد بن هارون البزاز أبو نشيط",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30218",
      "name": "Musa bin Harun bin Bashyr موسى بن هارون بن بشير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "35116",
      "name": "Muhammad bin Ahmed bin Ja'far محمد بن أحمد بن جعفر بن الحسن",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "61",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "وحدثني سلمة بن شبيب، حدثنا الحميدي، حدثنا سفيان، قال كان الناس يحملون عن جابر، قبل أن يظهر، ما أظهر فلما أظهر ما أظهر اتهمه الناس في حديثه وتركه بعض الناس فقيل له وما أظهر قال الإيمان بالرجعة ‏.‏",
      "text_en": "",
      "chain": [
        "30417",
        "30418",
        "20005"
      ]
    },
    {
      "hadith_no": "65",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "وحدثني سلمة بن شبيب، حدثنا الحميدي، حدثنا سفيان، قال سمعت رجلا، سأل جابرا عن قوله عز وجل ‏{‏ فلن أبرح الأرض حتى يأذن لي أبي أو يحكم الله لي وهو خير الحاكمين‏}‏ فقال جابر لم يجئ تأويل هذه ‏.‏ قال سفيان وكذب ‏.‏ فقلنا لسفيان وما أراد بهذا فقال إن الرافضة تقول إن عليا في السحاب فلا نخرج مع من خرج من ولده حتى ينادي مناد من السماء ‏.‏ يريد عليا أنه ينادي اخرجوا مع فلان ‏.‏ يقول جابر فذا تأويل هذه الآية وكذب كانت في إخوة يوسف صلى الله عليه وسلم ‏.‏",
      "text_en": "",
      "chain": [
        "30417",
        "30418",
        "20005",
        "34"
      ]
    },
    {
      "hadith_no": "79",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "وحدثني سلمة بن شبيب، حدثنا الحميدي، حدثنا سفيان، قال سمعت أبا موسى، يقول حدثنا عمرو بن عبيد، قبل أن يحدث، ‏.‏",
      "text_en": "",
      "chain": [
        "30417",
        "30418",
        "20005",
        "30170",
        "24341"
      ]
    },
    {
      "hadith_no": "119",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني سلمة بن شبيب، حدثنا الحسن بن أعين، حدثنا معقل، - وهو ابن عبيد الله - عن أبي الزبير، عن جابر، أن رجلا، سأل رسول الله صلى الله عليه وسلم فقال أرأيت إذا صليت الصلوات المكتوبات وصمت رمضان وأحللت الحلال وحرمت الحرام ولم أزد على ذلك شيئا أأدخل الجنة قال ‏\"‏ نعم ‏\"‏ ‏.‏ قال والله لا أزيد على ذلك شيئا ‏.‏",
      "text_en": " It is narrated on the authority of Jabir that a man once said to the Messenger of Allah (may peace be upon him):                      Shall I enter Paradise in case I say the obligatory prayers, observe the (fasts) of Ramadan and treat that as lawful which has been made permissible (by the Shari'ah) and deny myself that what is forbidden, and make no addition to it? He (the Holy Prophet) replied in the affirmative. He (the inquirer) said: By Allah, I would add nothing to it.",
      "chain": [
        "30417",
        "20418",
        "20677",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "240",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثني سلمة بن شبيب، حدثنا الحسن بن أعين، حدثنا فليح، حدثني نعيم بن عبد الله، عن سالم، مولى شداد بن الهاد قال كنت أنا مع، عائشة - رضى الله عنها - فذكر عنها عن النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " Salim, the freed slave of Shaddad b. al-Had said:                      I was in the presence of 'A'isha, and then narrated on her authority a hadith like this from the Holy Prophet (way peace be upon him).",
      "chain": [
        "30417",
        "20418",
        "20169",
        "11852"
      ]
    },
    {
      "hadith_no": "243",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثني سلمة بن شبيب، حدثنا الحسن بن محمد بن أعين، حدثنا معقل، عن أبي الزبير، عن جابر، أخبرني عمر بن الخطاب، أن رجلا، توضأ فترك موضع ظفر على قدمه فأبصره النبي صلى الله عليه وسلم فقال ‏\"‏ ارجع فأحسن وضوءك ‏\"‏ ‏.‏ فرجع ثم صلى ‏.‏",
      "text_en": " Jabir reported:                      'Umar b. Khattab said that a person performed ablution and left a small part equal to the space of a nail (unwashed). The Apostle of Allah (may peace be upon him) saw that and said: Go back and perform ablution well. He then went back (performed ablution well) and offered the prayer.",
      "chain": [
        "30417",
        "20418",
        "20677",
        "11263",
        "34",
        "3"
      ]
    },
    {
      "hadith_no": "278",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثني سلمة بن شبيب، قال حدثنا الحسن بن أعين، حدثنا معقل، عن أبي الزبير، عن جابر، عن أبي هريرة، أنه أخبره أن النبي صلى الله عليه وسلم قال ‏\"‏ إذا استيقظ أحدكم فليفرغ على يده ثلاث مرات قبل أن يدخل يده في إنائه فإنه لا يدري فيم باتت يده ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      The Apostle of Allah (may peace be upon him) said: When anyone amongst you wakes up from sleep, he should wash his hands three times before putting it in the utensil, for he does not know where his hand was during the night.",
      "chain": [
        "30417",
        "20418",
        "20677",
        "11263",
        "34",
        "13"
      ]
    },
    {
      "hadith_no": "1400",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني سلمة بن شبيب، حدثنا الحسن بن أعين، حدثنا زهير، حدثنا سماك بن حرب، عن جابر بن سمرة، قال كان بلال يؤذن إذا دحضت فلا يقيم حتى يخرج النبي صلى الله عليه وسلم فإذا خرج أقام الصلاة حين يراه ‏.‏",
      "text_en": " Jabir b. Samura reported:                      Bilal summoned to prayer as the sun declined but did not pronounce Iqama till the Apostle of Allah (may peace be upon him) came out and the Iqama was pronounced on seeing him.",
      "chain": [
        "30417",
        "20418",
        "20321",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "1803",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني سلمة بن شبيب، حدثنا الحسن بن أعين، حدثنا معقل، - وهو ابن عبيد الله - عن أبي الزبير، عن جابر، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ أيكم خاف أن لا يقوم من آخر الليل فليوتر ثم ليرقد ومن وثق بقيام من الليل فليوتر من آخره فإن قراءة آخر الليل محضورة وذلك أفضل ‏\"‏ ‏.‏",
      "text_en": " Jabir reported Allah's Messenger (may peace be upon him) as saying:                      The most excellent prayer is that in which the duration of standing is longer.",
      "chain": [
        "30417",
        "20418",
        "20677",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "1807",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني سلمة بن شبيب، حدثنا الحسن بن أعين، حدثنا معقل، عن أبي الزبير، عن جابر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن من الليل ساعة لا يوافقها عبد مسلم يسأل الله خيرا إلا أعطاه إياه ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      Our Lord, the Blessed and the Exalted, descends every night to the lowest heaven when one-third of the latter part of the night is left, and says: Who supplicates Me so that I may answer him? Who asks Me so that I may give to him? Who asks Me forgiveness so that I may forgive him?",
      "chain": [
        "30417",
        "20418",
        "20677",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "2450",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثني عبد الله بن عبد الرحمن الدارمي، وسلمة بن شبيب، - قال سلمة حدثنا وقال الدارمي، أخبرنا مروان، وهو ابن محمد الدمشقي - حدثنا سعيد، - وهو ابن عبد العزيز - عن ربيعة بن يزيد، عن أبي إدريس الخولاني، عن أبي مسلم الخولاني، قال حدثني الحبيب الأمين، أما هو فحبيب إلى وأما هو عندي فأمين عوف بن مالك الأشجعي قال كنا عند رسول الله صلى الله عليه وسلم تسعة أو ثمانية أو سبعة فقال ‏\"‏ ألا تبايعون رسول الله ‏\"‏ وكنا حديث عهد ببيعة فقلنا قد بايعناك يا رسول الله ‏.‏ ثم قال ‏\"‏ ألا تبايعون رسول الله ‏\"‏ ‏.‏ فقلنا قد بايعناك يا رسول الله ‏.‏ ثم قال ‏\"‏ ألا تبايعون رسول الله ‏\"‏ ‏.‏ قال فبسطنا أيدينا وقلنا قد بايعناك يا رسول الله فعلام نبايعك قال ‏\"‏ على أن تعبدوا الله ولا تشركوا به شيئا والصلوات الخمس وتطيعوا - وأسر كلمة خفية - ولا تسألوا الناس شيئا ‏\"‏ ‏.‏ فلقد رأيت بعض أولئك النفر يسقط سوط أحدهم فما يسأل أحدا يناوله إياه ‏.‏",
      "text_en": " Malik al-Ashja'i reported:                      We, nine, eight or seven men, were in the company of the Messenger of Allah (may peace be upon him) and he said: Why don't you pledge allegiance to the Messenger of Allah? -while we had recently pledged allegiance. So we said: Messenger of Allah, we have already pledged allegiance to you. He again said: Why don't you pledge allegiance to the Messenger of Allah? And we said: Messenger of Allah, we have already pledged allegiance to you. He again said: Why don't you pledge allegiance to the Messenger of Allah? We stretched our hands and said: Messenger of Allah. we have already pledged allegiance to you. Now tell (on what things) should we pledge allegiance to you. He said I (You must pledge allegiance) that you would worship Allah only and would not associate with Him anything, (and observe) five prayers, and obey- (and he said onething in an undertone) -that you would not beg people of anything. (And as a consequence of that) I saw that some of these people did not ask anyone to pick up the whip for them if it fell down.",
      "chain": [
        "30025",
        "30417",
        "237",
        "30025",
        "20201",
        "20638",
        "11414",
        "11027",
        "11026"
      ]
    },
    {
      "hadith_no": "2477",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا زهير بن حرب، حدثنا عبد الصمد بن عبد الوارث، حدثنا همام، ح وحدثني زهير بن حرب، حدثنا عمر بن يونس، حدثنا عكرمة بن عمار، ح وحدثني سلمة بن شبيب، حدثنا أبو المغيرة، حدثنا الأوزاعي، كلهم عن إسحاق بن عبد الله بن أبي طلحة، عن أنس، بن مالك عن النبي صلى الله عليه وسلم بهذا الحديث ‏.‏ وفي حديث عكرمة بن عمار من الزيادة قال ثم جبذه إليه جبذة رجع نبي الله صلى الله عليه وسلم في نحر الأعرابي ‏.‏ وفي حديث همام فجاذبه حتى انشق البرد وحتى بقيت حاشيته في عنق رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Anas b. Malik through another chain of transmitters. And In the hadith transmitted by Ikrima b. 'Ammir there is an addition:                     \" He (the bedouin) pulled his (mantle) so violently that the Apostle of Allah (may peace be upon him) was drifted very close to the bedouin.\" And in the hadith transmitted by Hammam, (the words are):\" He pulled it so violently that the mantle was torn and the border was left around the neck of the Messenger of Allah (may peace be upon him).\"",
      "chain": [
        "30022",
        "20250",
        "20297",
        "30022",
        "20450",
        "10704",
        "30417",
        "20442",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "2843",
      "source": " Sahih Muslim ",
      "chapter": "The Book of I'tikaf - كتاب الاعتكاف",
      "chapter_no": "15",
      "text_ar": "وحدثناه ابن أبي عمر، حدثنا سفيان، ح وحدثني عمرو بن سواد، أخبرنا ابن، وهب أخبرنا عمرو بن الحارث، ح وحدثني محمد بن رافع، حدثنا أبو أحمد، حدثنا سفيان، ح وحدثني سلمة بن شبيب، حدثنا أبو المغيرة، حدثنا الأوزاعي، ح وحدثني زهير بن حرب، حدثنا يعقوب بن إبراهيم بن سعد، حدثنا أبي، عن ابن إسحاق، كل هؤلاء عن يحيى بن، سعيد عن عمرة، عن عائشة، - رضى الله عنها - عن النبي صلى الله عليه وسلم ‏.‏ بمعنى حديث أبي معاوية ‏.‏ وفي حديث ابن عيينة وعمرو بن الحارث وابن إسحاق ذكر عائشة وحفصة وزينب - رضى الله عنهن - أنهن ضربن الأخبية للاعتكاف ‏.‏",
      "text_en": " This hadith has been reported through another chain of transmitters, and there it is mentioned that. 'A'isha, Hafsa and Zainab (Allah be pleased with them) pitched the tents for i'tikaf.",
      "chain": [
        "30421",
        "20005",
        "30443",
        "20377",
        "30375",
        "20355",
        "20012",
        "30417",
        "20442",
        "20024",
        "30022",
        "20184",
        "20150"
      ]
    },
    {
      "hadith_no": "3198",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني سلمة بن شبيب، حدثنا الحسن بن أعين، حدثنا معقل، عن زيد بن أبي، أنيسة عن يحيى بن حصين، عن جدته أم الحصين، قال سمعتها تقول، حججت مع رسول الله صلى الله عليه وسلم حجة الوداع فرأيته حين رمى جمرة العقبة وانصرف وهو على راحلته ومعه بلال وأسامة أحدهما يقود به راحلته والآخر رافع ثوبه على رأس رسول الله صلى الله عليه وسلم من الشمس - قالت - فقال رسول الله صلى الله عليه وسلم قولا كثيرا ثم سمعته يقول ‏\"‏ إن أمر عليكم عبد مجدع - حسبتها قالت - أسود يقودكم بكتاب الله تعالى فاسمعوا له وأطيعوا ‏\"‏ ‏.‏",
      "text_en": " Umm al-Husain (Allah be pleased with her) reported:                      I performed Hajj along with Allah's Messenger (may peace be upon him) on the occasion of the Farewell Pilgrimage and saw him when he flung pebbles at Jamrat al-'Aqaba and returned while he was riding the camel, and Bilal and Usama were with him. One of them was leading his camel, while the other was raising his cloth over the head of Allah's Messenger (may peace be upon him) to protect him from the sun. She (further) said: Allah's Messenger (may peace be upon him) said so many things, and I heard him saying: If a slave having some limb of his missing and having dark complexion is appointed to govern you according to the Book of Allah the Exalted. listen to him and obey him.",
      "chain": [
        "30417",
        "20418",
        "20677",
        "11340"
      ]
    },
    {
      "hadith_no": "3203",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني سلمة بن شبيب، حدثنا الحسن بن أعين، حدثنا معقل، - وهو ابن عبيد الله الجزري - عن أبي الزبير، عن جابر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الاستجمار تو ورمى الجمار تو والسعى بين الصفا والمروة تو والطواف تو وإذا استجمر أحدكم فليستجمر بتو ‏\"‏ ‏.‏",
      "text_en": " Jabir (b. Abdullab) (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      Odd number of stones are to be used for cleaning (the private parts after answering the call of nature), and casting of pebbles at the Jamras is to be done by odd numbers (seven), and (the number) of circuits between al-Safa' and al-Marwa is also odd (seven), and the number of circuits (around the Ka'ba) is also odd (seven). Whenever any one of you is required to use stones (for cleaning the private parts) he should use odd number of stones (three, five or seven).",
      "chain": [
        "30417",
        "20418",
        "20677",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "3279",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني سلمة بن شبيب، حدثنا الحسن بن أعين، حدثنا معقل، عن أبي الزبير، قال سألت جابرا عن ركوب الهدى، فقال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ اركبها بالمعروف حتى تجد ظهرا ‏\"‏ ‏.‏",
      "text_en": " Abu Zubair reported:                      I asked Jabir (Allah be pleased with him) about riding on the sacrificial animal, to which he replied: I heard Allah's Apostle (may peace be upon him) as saying: Ride on them gently until you find another mount.",
      "chain": [
        "30417",
        "20418",
        "20677",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "3373",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثني سلمة بن شبيب، حدثنا ابن أعين، حدثنا معقل، عن أبي الزبير، عن جابر، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ لا يحل لأحدكم أن يحمل بمكة السلاح‏\"‏ ‏.‏",
      "text_en": " Jabir (Allah be pleased with him) reported:                      I heard Allah's Apostle (may peace be upon him) say: It is not permissible for any one of you to carry weapons in Mecca.",
      "chain": [
        "30417",
        "20677",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "3475",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثني سلمة بن شبيب، حدثنا الحسن بن أعين، حدثنا معقل، عن أبي الزبير، قال قال جابر سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ إذا أحدكم أعجبته المرأة فوقعت في قلبه فليعمد إلى امرأته فليواقعها فإن ذلك يرد ما في نفسه ‏\"‏ ‏.‏",
      "text_en": " Jabir heard Allah's Apostle (may peace be upon him) say:                      When a woman fascinates any one of you and she captivates his heart, he should go to his wife and have an intercourse with her, for it would repel what he feels.",
      "chain": [
        "30417",
        "20418",
        "20677",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "3496",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثني سلمة بن شبيب، حدثنا الحسن بن أعين، حدثنا معقل، عن ابن أبي عبلة، عن عمر بن عبد العزيز، قال حدثنا الربيع بن سبرة الجهني، عن أبيه، أن رسول الله صلى الله عليه وسلم نهى عن المتعة وقال ‏\"‏ ألا إنها حرام من يومكم هذا إلى يوم القيامة ومن كان أعطى شيئا فلا يأخذه ‏\"‏ ‏.‏",
      "text_en": " Sabra al-Juhanni reported on the authority of his father:                      Allah's Messenger (may peace be upon him) prohibited the contracting of temporary marriage and said: Behold, it is forbidden from this very day of yours to the Day of Resurrection, and he who has given something (as a dower) should not take it back.",
      "chain": [
        "30417",
        "20418",
        "20677",
        "11010",
        "11847"
      ]
    },
    {
      "hadith_no": "3633",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثني سلمة بن شبيب، حدثنا الحسن بن أعين، حدثنا معقل، عن عطاء، قال سمعت جابرا، يقول لقد كنا نعزل على عهد رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Jabir (Allah be pleased with him) reported:                      We used to practise 'azl during the life of Allah's Messenger (may peace be upon him).",
      "chain": [
        "30417",
        "20418",
        "20677",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "4098",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثني سلمة بن شبيب، حدثنا الحسن بن أعين، حدثنا معقل، عن أبي الزبير، قال سألت جابرا عن ثمن الكلب، والسنور، قال زجر النبي صلى الله عليه وسلم عن ذلك ‏.‏",
      "text_en": " Abu Zubair said:                      I asked Jabir about the price of a dog and a cat; he said: Allah's Messenger (may peace be upon him) disapproved of that.",
      "chain": [
        "30417",
        "20418",
        "20677",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "4168",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "وحدثنا سلمة بن شبيب، حدثنا الحسن بن أعين، حدثنا معقل، عن أبي قزعة، الباهلي عن أبي نضرة، عن أبي سعيد، قال أتي رسول الله صلى الله عليه وسلم بتمر فقال ‏\"‏ ما هذا التمر من تمرنا ‏\"‏ ‏.‏ فقال الرجل يا رسول الله بعنا تمرنا صاعين بصاع من هذا ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ هذا الربا فردوه ثم بيعوا تمرنا واشتروا لنا من هذا ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id (Allah be pleased with him) reported:                      Dates were brought to Allah's Messenger (may peace be upon him), and he said: These dates are not like our dates, whereupon a man said: We sold two sa's of our dates (in order to get) one sa', of these (fine dates), whereupon Allah's Messenger (may peace be upon him) said: That is interest; so return (these dates of fine quality), and get your (inferior dates) ; then sell our dates (for money) and buy for us (with the help of money) such (fine dates).",
      "chain": [
        "30417",
        "20418",
        "20677",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "4508",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Punishments Prescribed by Islam - كتاب الحدود",
      "chapter_no": "30",
      "text_ar": "وحدثني سلمة بن شبيب، حدثنا الحسن بن أعين، حدثنا معقل، عن أبي الزبير، عن جابر، أن امرأة، من بني مخزوم سرقت فأتي بها النبي صلى الله عليه وسلم فعاذت بأم سلمة زوج النبي صلى الله عليه وسلم فقال النبي صلى الله عليه وسلم ‏\"‏ والله لو كانت فاطمة لقطعت يدها ‏\"‏ ‏.‏ فقطعت ‏.‏",
      "text_en": " Jaibir reported that a woman from the tribe of Makhzum committed theft. She was brought to Allah's Apostle (may peace be upon him) and she sought refuge (intercession) from Umm Salama, the wife of Allah's Apostle (may peace be upon him). Thereupon Allah's Apostle (may peace be upon him) said:                      By Allah, even if she were Fatima, I would have her hand cut off. And thus her hand was cut off.",
      "chain": [
        "30417",
        "20418",
        "20677",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "4694",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "وحدثني زهير بن حرب، حدثنا روح بن عبادة، أخبرنا سفيان الثوري، ح وحدثني سلمة بن شبيب، حدثنا الحسن بن أعين، حدثنا معقل، - وهو ابن عبيد الله - كلاهما عن أبي الزبير، بهذا الإسناد مثله ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Zubair with the same chain of transmitters.",
      "chain": [
        "30022",
        "20229",
        "20012",
        "30417",
        "20418"
      ]
    },
    {
      "hadith_no": "4753",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "وحدثني سلمة بن شبيب، حدثنا الحسن بن أعين، حدثنا زهير، حدثنا أبو إسحاق، عن عمرو بن ميمون، عن عبد الله، قال استقبل رسول الله صلى الله عليه وسلم البيت فدعا على ستة نفر من قريش ‏.‏ فيهم أبو جهل وأمية بن خلف وعتبة بن ربيعة وشيبة بن ربيعة وعقبة بن أبي معيط فأقسم بالله لقد رأيتهم صرعى على بدر ‏.‏ قد غيرتهم الشمس وكان يوما حارا ‏.‏",
      "text_en": " It has been narrated on the authority of 'Abdullah that, the Messenger of Allah (may peace be upon him) turned his face towards the Ka'ba and invoked God's imprecations upon six men of the Quraish, amorig whom were Abu Jahl. Umayya b. Khalaf, Utba b. Rabi'a, Shaiba b. Rabi'a and 'Uqba b. Abu Mu'ait I swear by God that I saw them lying slain in the battlefield of Badr. It being a hot day, their complexion had changed (showing signs of decay).",
      "chain": [
        "30417",
        "20418",
        "20321",
        "11049",
        "11382",
        "16"
      ]
    },
    {
      "hadith_no": "4868",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثني سلمة بن شبيب، حدثنا الحسن بن أعين، حدثنا معقل، عن زيد بن أبي، أنيسة عن يحيى بن حصين، عن جدته أم الحصين، قال سمعتها تقول، حججت مع رسول الله صلى الله عليه وسلم حجة الوداع - قالت - فقال رسول الله صلى الله عليه وسلم قولا كثيرا ثم سمعته يقول ‏\"‏ إن أمر عليكم عبد مجدع - حسبتها قالت - أسود يقودكم بكتاب الله فاسمعوا له وأطيعوا ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Yahya b. Husain who learnt the tradition from his grandmother. Umm Husain. He said':                      I heard her say: I performed Hajjat-ul-Wada' in the company of the Messenger of Allah (may peace be upon him). He said a lot of things (on this occasion). Then I heard him say: If a maimed slave is appointed a commander over you the narrator says: I think she said:\" a black stave\" who leads you according to the Book of Allah, then listen to him and obey him.",
      "chain": [
        "30417",
        "20418",
        "20677",
        "11340"
      ]
    },
    {
      "hadith_no": "5154",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثني سلمة بن شبيب، حدثنا الحسن بن أعين، حدثنا معقل، عن أبي الزبير، قال سألت جابرا عن الضب، فقال لا تطعموه ‏.‏ وقذره وقال قال عمر بن الخطاب إن النبي صلى الله عليه وسلم لم يحرمه ‏.‏ إن الله عز وجل ينفع به غير واحد فإنما طعام عامة الرعاء منه ولو كان عندي طعمته ‏.‏",
      "text_en": " Abu Zubair reported:                      I asked Jabir about ithe eating) of the lizard, whereupon he said: Don't eat that as he (the Holy Prophet) felt disgust. He (the narrator) said that Umar b. al-Khattab reminded: Allah's Apostle (may peace be upon him) did not declare it to be unlawful. Allah, the Exalted and Majestic, has (made it a source) of benefit for more than one (persons). It is a common diet of the shepherds. Had it been with me, I would have eaten that.",
      "chain": [
        "30417",
        "20418",
        "20677",
        "11263",
        "34",
        "3"
      ]
    },
    {
      "hadith_no": "5359",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثني سلمة بن شبيب، حدثنا الحسن بن أعين، حدثنا معقل، عن الزهري، عن  سعيد بن المسيب، أنه سمع أبا هريرة، يقول أتي رسول الله صلى الله عليه وسلم ‏.‏ بمثله ولم يذكر بإيلياء ‏.‏",
      "text_en": " This hadith is narrated on the authority of Abu Huraira through another chain of transmitters, but he did not mention Aelia (Capitolina. i. e. Bait al-Maqdis).",
      "chain": [
        "30417",
        "20418",
        "20677",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "5432",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثني سلمة بن شبيب، حدثنا الحسن بن أعين، حدثنا زهير، حدثنا الأعمش، عن شقيق، عن أبي مسعود، عن النبي صلى الله عليه وسلم وعن الأعمش، عن أبي سفيان، عن جابر، بهذا الحديث ‏.‏",
      "text_en": "",
      "chain": [
        "30417",
        "20418",
        "20321",
        "11060",
        "11353",
        "402"
      ]
    },
    {
      "hadith_no": "5615",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "حدثني سلمة بن شبيب، حدثنا الحسن بن أعين، حدثنا معقل، عن أبي الزبير، عن جابر، قال سمعت النبي صلى الله عليه وسلم يقول في غزوة غزوناها ‏\"‏ استكثروا منالنعال فإن الرجل لا يزال راكبا ما انتعل ‏\"‏ ‏.‏",
      "text_en": " Jabir reported:                      I heard Allah's Apostle (may peace be upon him) saying during an expedition in which we also participated: Make a general practice of wearing sandals, for a man is riding as it were when he wears sandals.",
      "chain": [
        "30417",
        "20418",
        "20677",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "5674",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "وحدثني سلمة بن شبيب، حدثنا الحسن بن أعين، حدثنا معقل، عن أبي الزبير، عن جابر، أن النبي صلى الله عليه وسلم مر عليه حمار قد وسم في وجهه فقال ‏\"‏ لعن الله الذي وسمه ‏\"‏ ‏.‏",
      "text_en": " Jabir reported that there happened to pass before Allah's Apostle (may peace be upon him) an ass the face of which had been cauterised, whereupon he said:                      Allah has cursed one who has cauterised it (on the face).",
      "chain": [
        "30417",
        "20418",
        "20677",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "5817",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "وحدثنا سلمة بن شبيب، حدثنا الحسن بن أعين، حدثنا معقل، - وهو ابن عبيد الله - عن أبي الزبير، عن جابر، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يقيمن أحدكم أخاه يوم الجمعة ثم ليخالف إلى مقعده فيقعد فيه ولكن يقول افسحوا ‏\"‏ ‏.‏",
      "text_en": " Jabir reported Allah's Apostle (may peace he upon him) as saying:                      None amongst you should make his brother stand on Friday (during the congregational prayer) and then occupy his-place. but he should only say to him (Accommodate me).",
      "chain": [
        "30417",
        "20418",
        "20677",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "5953",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثني سلمة بن شبيب، حدثنا الحسن بن أعين، حدثنا معقل، - وهو ابن عبيد الله - عن الزهري، أخبرني يحيى بن عروة، أنه سمع عروة، يقول قالت عائشة سأل أناس رسول الله صلى الله عليه وسلم عن الكهان فقال لهم رسول الله صلى الله عليه وسلم ‏\"‏ ليسوا بشىء ‏\"‏ ‏.‏ قالوا يا رسول الله فإنهم يحدثون أحيانا الشىء يكون حقا ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ تلك الكلمة من الجن يخطفها الجني فيقرها في أذن وليه قر الدجاجة فيخلطون فيها أكثر من مائة كذبة ‏\"‏ ‏.‏",
      "text_en": " 'Urwa reported from 'A'isha that she said that people asked Allah's Messenger (may peace be upon him) about the kahins. Allah's Messenger (may peace be upon him) said to them:                      It is nothing (i. e. it is a mere superstition). They said: Allah's Messenger, they at times narrate to us things which we find true. Thereupon Allah's Messenger (may peace be upon him) said: That is a word pertaining to truth which a jinn snatches away and then cackles into the ear of his friend as the hen does. And then they mix in it more than one hundred lies.",
      "chain": [
        "30417",
        "20418",
        "20677",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "5956",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "وحدثنا زهير بن حرب، حدثنا الوليد بن مسلم، حدثنا أبو عمرو الأوزاعي، ح وحدثنا أبو الطاهر، وحرملة، قالا أخبرنا ابن وهب، أخبرني يونس، ح وحدثني سلمة بن، شبيب حدثنا الحسن بن أعين، حدثنا معقل، - يعني ابن عبيد الله - كلهم عن الزهري، بهذا الإسناد غير أن يونس، قال عن عبد الله بن عباس أخبرني رجال من أصحاب رسول الله من الأنصار وفي حديث الأوزاعي ‏\"‏ ولكن يقرفون فيه ويزيدون ‏\"‏ ‏.‏ وفي حديث يونس ‏\"‏ ولكنهم يرقون فيه ويزيدون ‏\"‏ ‏.‏ وزاد في حديث يونس وقال الله ‏\"‏ حتى إذا فزع عن قلوبهم قالوا ماذا قال ربكم قالوا الحق ‏\"‏ ‏.‏ وفي حديث معقل كما قال الأوزاعي ‏\"‏ ولكنهم يقرفون فيه ويزيدون ‏\"‏ ‏.‏",
      "text_en": " The hadith has been narrated on the authority of Zuhri through the same chain of transmitters but with a slight variation of wording.",
      "chain": [
        "30022",
        "20733",
        "20024",
        "30487",
        "20029",
        "20475",
        "30417",
        "20418",
        "20475",
        "17"
      ]
    },
    {
      "hadith_no": "6084",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثني سلمة بن شبيب، حدثنا الحسن بن أعين، حدثنا معقل، عن أبي الزبير، عن جابر، أن أم مالك، كانت تهدي للنبي صلى الله عليه وسلم في عكة لها سمنا فيأتيها بنوها فيسألون الأدم وليس عندهم شىء فتعمد إلى الذي كانت تهدي فيه للنبي صلى الله عليه وسلم فتجد فيه سمنا فما زال يقيم لها أدم بيتها حتى عصرته فأتت النبي صلى الله عليه وسلم فقال ‏\"‏ عصرتيها ‏\"‏ ‏.‏ قالت نعم ‏.‏ قال ‏\"‏ لو تركتيها ما زال قائما ‏\"‏ ‏.‏",
      "text_en": " Jabir reported that Umm Malik used to send clarified butter in a small skin to the Apostle of Allah (may peace be upon him). Her sons would come to her and ask for seasoning when they had nothing with them (in the form of condiments) and she would go to that (skin) in which she offered (clarified butter) to Allah's Apostle (may peace be upon him), and she would find in that clarified butter and it kept providing her with seasoning for her household until she had (completely) squeezed it. She came to Allah's Apostle (may peace be upon him) and (informed him about it). Thereupon, he (the Holy Prophet) said:                      Did you squeeze it? She said: Yes. Thereupon he said: If you had left it in that very state, it would have kept on provid- ing you (the clarified butter) on end.",
      "chain": [
        "30417",
        "20418",
        "20677",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "6085",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثني سلمة بن شبيب، حدثنا الحسن بن أعين، حدثنا معقل، عن أبي الزبير، عن جابر، أن رجلا، أتى النبي صلى الله عليه وسلم يستطعمه فأطعمه شطر وسق شعير فما زال الرجل يأكل منه وامرأته وضيفهما حتى كاله فأتى النبي صلى الله عليه وسلم فقال ‏\"‏ لو لم تكله لأكلتم منه ولقام لكم ‏\"‏ ‏.‏",
      "text_en": " Jabir reported that a person came to Allah's Apostle (may peace be upon him) and asked for food. And he gave him half a wasq of barley, and the person and his wife and their guests kept on making use of it (as a food) until he weighed it (in order to find out the actual quantity, and it was no more). He came to Allah's Apostle (may peace be upon him) (and informed him about it). He said:                      Had you not weighed it, you would be eating out of it and it would have remained intact for you.",
      "chain": [
        "30417",
        "20418",
        "20677",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "6592",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "وحدثني سلمة بن شبيب، حدثنا الحسن بن أعين، حدثنا معقل، عن أبي الزبير، عن جابر، كلهم قال عن النبي صلى الله عليه وسلم قال ‏\"‏ أسلم سالمها الله وغفار غفر الله لها ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated through other chains of transmitters but all of them narrated on the authority of Jabir that Allah's Apostle (may peace be upon him) said:                      To the tribe of Aslam Allah has granted safety and to the tribe of Ghifar Allah has granted pardon.",
      "chain": [
        "30417",
        "20418",
        "20677",
        "11263"
      ]
    },
    {
      "hadith_no": "6934",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Destiny - كتاب القدر",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، أخبرنا عبد الرزاق، أخبرنا معمر، ح وحدثنا عبد الله بن، عبد الرحمن بن بهرام أخبرنا أبو اليمان، أخبرنا شعيب، ح وحدثنا سلمة بن شبيب، حدثنا  الحسن بن أعين، حدثنا معقل، - وهو ابن عبيد الله - كلهم عن الزهري، بإسناد يونس وابن أبي ذئب ‏.‏ مثل حديثهما غير أن في، حديث شعيب ومعقل سئل عن ذراري المشركين ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Shu'aib and Ma'qil with a slight variation of wording.",
      "chain": [
        "30553",
        "20121",
        "20115",
        "30330",
        "20428",
        "30417",
        "20418"
      ]
    },
    {
      "hadith_no": "7195",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Repentance and Exhortation to Repentance - كتاب التوبة",
      "chapter_no": "51",
      "text_ar": "وحدثني سلمة بن شبيب، حدثنا الحسن بن أعين، حدثنا معقل، - وهو ابن عبيد الله - عن الزهري، أخبرني عبد الرحمن بن عبد الله بن كعب بن مالك، عن عمه، عبيد الله بن كعب وكان قائد كعب حين أصيب بصره وكان أعلم قومه وأوعاهم لأحاديث أصحاب رسول الله صلى الله عليه وسلم قال سمعت أبي كعب بن مالك وهو أحد الثلاثة الذين تيب عليهم يحدث أنه لم يتخلف عن رسول الله صلى الله عليه وسلم في غزوة غزاها قط غير غزوتين ‏.‏ وساق الحديث وقال فيه وغزا رسول الله صلى الله عليه وسلم بناس كثير يزيدون على عشرة آلاف ولا يجمعهم ديوان حافظ ‏.‏",
      "text_en": " It is reported on the authority of Abdullah b. K'ab and he was the guide of Ka'b as he lost his eyesight and he was the greatest scholar amongst his people and he retained in his mind many ahadith of the Companions of Allah's Messenger (may peace be upon him). He said:                      I heard my father Ka'b b. Malik, and he fas one of those three whose repentance was accepted (by Allah). He transmitted that He never lagged behind Allah's Messenger (may peace be upon him) from any expedition that he undertook except two expeditions; the rest of the hadith is the same, and in the tradition narrated through another chain of transmitters the words are:\" That Allah's Messenger (may peace be upon him) set out on an expedition with a large number of persons more than ten thousand and this could not be recorded in the census register.\"",
      "chain": [
        "30417",
        "20418",
        "20677",
        "11013",
        "11519"
      ]
    },
    {
      "hadith_no": "7285",
      "source": " Sahih Muslim ",
      "chapter": "The Book Giving Description of the Day of Judgement; Paradise and Hell - كتاب صفة القيامة والجنة والنار",
      "chapter_no": "53",
      "text_ar": "حدثني سلمة بن شبيب، حدثنا الحسن بن أعين، حدثنا معقل، عن أبي الزبير، عن  جابر، أنه سمع النبي صلى الله عليه وسلم يقول ‏\"‏ يبعث الشيطان سراياه فيفتنون الناس فأعظمهم عنده منزلة أعظمهم فتنة ‏\"‏ ‏.‏",
      "text_en": " Jabir reported that Allah's Apostle (may peace be upqn him) said:                      The Satan sends detachments of his own in order to put people to trial and the highest in rank, in his eyes, is one who is most notorious in sowing the seed of dissension.",
      "chain": [
        "30417",
        "20418",
        "20677",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "7299",
      "source": " Sahih Muslim ",
      "chapter": "The Book Giving Description of the Day of Judgement; Paradise and Hell - كتاب صفة القيامة والجنة والنار",
      "chapter_no": "53",
      "text_ar": "حدثني سلمة بن شبيب، حدثنا الحسن بن أعين، حدثنا معقل، عن أبي الزبير، عن  جابر، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ لا يدخل أحدا منكم عمله الجنة ولا يجيره من النار ولا أنا إلا برحمة من الله ‏\"‏ ‏.‏",
      "text_en": " Jabir reported:                      I heard Allah's Apoetle (may peace be upon him) as saying: None of you would get into Paradise because of his good deeds alone, and he would not be rescued from Fire, not even I, but because of the Mercy of Allah.",
      "chain": [
        "30417",
        "20418",
        "20677",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "7542",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "وحدثنا عبد بن حميد، وسلمة بن شبيب، جميعا عن عبد الرزاق، أخبرنا معمر، عن الزهري، عن سالم، عن ابن عمر، أن رسول الله صلى الله عليه وسلم مر بابن صياد في نفر من أصحابه فيهم عمر بن الخطاب وهو يلعب مع الغلمان عند أطم بني مغالة وهو غلام ‏.‏ بمعنى حديث يونس وصالح غير أن عبد بن حميد لم يذكر حديث ابن عمر في انطلاق النبي صلى الله عليه وسلم مع أبى بن كعب إلى النخل ‏.‏",
      "text_en": " Ibn 'Umar reported that Allah's Messenger (may peace be upon him) happened to pass by Ibn Sayyad along with his Companions including 'Umar b. Khattab as he was playing with children near the battlement of Bani Maghala and he was also a child by that time. The rest of the hadith is the same as narrated by Ibn Umar (in which there is a mention of) setting out of Allah's Apostle (may peace be upon him) along with Ubayy b. Ka'b towards the date-palm trees.",
      "chain": [
        "30553",
        "30417",
        "20121",
        "20115",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "7706",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "حدثني سلمة بن شبيب، حدثنا الحسن بن أعين، حدثنا زهير، حدثنا أبو إسحاق، قال سمعت البراء بن عازب، يقول جاء أبو بكر الصديق إلى أبي في منزله فاشترى منه رحلا فقال لعازب ابعث معي ابنك يحمله معي إلى منزلي فقال لي أبي احمله ‏.‏ فحملته وخرج أبي معه ينتقد ثمنه فقال له أبي يا أبا بكر حدثني كيف صنعتما ليلة سريت مع رسول الله صلى الله عليه وسلم قال نعم أسرينا ليلتنا كلها حتى قام قائم الظهيرة وخلا الطريق فلا يمر فيه أحد حتى رفعت لنا صخرة طويلة لها ظل لم تأت عليه الشمس بعد فنزلنا عندها فأتيت الصخرة فسويت بيدي مكانا ينام فيه النبي صلى الله عليه وسلم في ظلها ثم بسطت عليه فروة ثم قلت نم يا رسول الله وأنا أنفض لك ما حولك فنام وخرجت أنفض ما حوله فإذا أنا براعي غنم مقبل بغنمه إلى الصخرة يريد منها الذي أردنا فلقيته فقلت لمن أنت يا غلام فقال لرجل من أهل المدينة قلت أفي غنمك لبن قال نعم ‏.‏ قلت أفتحلب لي قال نعم ‏.‏ فأخذ شاة فقلت له انفض الضرع من الشعر والتراب والقذى - قال فرأيت البراء يضرب بيده على الأخرى ينفض - فحلب لي في قعب معه كثبة من لبن قال ومعي إداوة أرتوي فيها للنبي صلى الله عليه وسلم ليشرب منها ويتوضأ - قال - فأتيت النبي صلى الله عليه وسلم وكرهت أن أوقظه من نومه فوافقته استيقظ فصببت على اللبن من الماء حتى برد أسفله فقلت يا رسول الله اشرب من هذا اللبن - قال - فشرب حتى رضيت ثم قال ‏\"‏ ألم يأن للرحيل ‏\"‏ ‏.‏ قلت بلى ‏.‏ قال فارتحلنا بعد ما زالت الشمس واتبعنا سراقة بن مالك - قال - ونحن في جلد من الأرض فقلت يا رسول الله أتينا فقال ‏\"‏ لا تحزن إن الله معنا ‏\"‏ ‏.‏ فدعا عليه رسول الله صلى الله عليه وسلم فارتطمت فرسه إلى بطنها أرى فقال إني قد علمت أنكما قد دعوتما على فادعوا لي فالله لكما أن أرد عنكما الطلب ‏.‏ فدعا الله فنجى فرجع لا يلقى أحدا إلا قال قد كفيتكم ما ها هنا فلا يلقى أحدا إلا رده - قال - ووفى لنا ‏.‏   وحدثنيه زهير بن حرب، حدثنا عثمان بن عمر، ح وحدثناه إسحاق بن إبراهيم، أخبرنا النضر بن شميل، كلاهما عن إسرائيل، عن أبي إسحاق، عن البراء، قال اشترى أبو بكر من أبي رحلا بثلاثة عشر درهما وساق الحديث بمعنى حديث زهير عن أبي إسحاق وقال في حديثه من رواية عثمان بن عمر فلما دنا دعا عليه رسول الله صلى الله عليه وسلم فساخ فرسه في الأرض إلى بطنه ووثب عنه وقال يا محمد قد علمت أن هذا عملك فادع الله أن يخلصني مما أنا فيه ولك على لأعمين على من ورائي وهذه كنانتي فخذ سهما منها فإنك ستمر على إبلي وغلماني بمكان كذا وكذا فخذ منها حاجتك قال ‏\"‏ لا حاجة لي في إبلك ‏\"‏ ‏.‏ فقدمنا المدينة ليلا فتنازعوا أيهم ينزل عليه رسول الله صلى الله عليه وسلم فقال ‏\"‏ أنزل على بني النجار أخوال عبد المطلب أكرمهم بذلك ‏\"‏ ‏.‏ فصعد الرجال والنساء فوق البيوت وتفرق الغلمان والخدم في الطرق ينادون يا محمد يا رسول الله يا محمد يا رسول الله ‏.‏",
      "text_en": " Al-Bara' b. 'Azib reported that Abu Bakr Siddiq came to the residence of my father ('Azib) and bought a haudaj from him and said to 'Azib:                      Send your son to my residence (to carry this haudaj), and my father said to me: Carry it (for him). So I carried it and there went along with him (with Abu Bakr) my father in order to fetch its price and he ('Azib) said to Abu Bakr: Abu Bakr, narrate to me what you both did on the night when you set out on a journey along with Allah's Messenger (may peace be upon him). He said: We set out during the night and went on walking until it was noon, and the path was vacant and so none passed by that (until) there appeared prominently before us a large rock. It had its shade and the rays of the sun did not reach that place. So we got down at that place. I then went to the rock and levelled the ground with my hands at the place where the Holy Prophet (may peace be upon him) would take rest under its shade. I then set the bedding and said: Allah's Messenger, go to sleep and I shall keep a watch around you. I went out and watched around him. There we saw a shepherd moving towards that rock with his flock and he intended what we intended (i. e. taking rest). I met him and said to him: Young boy, to which place do you belong? He said: I am a person from Medina. I said, is there any milk in the udders of your sheep and goats? He said: Yes. He took hold of a goat, and I said to him: Clean the udder well so that it should be free from hair, dust and impurity. I saw al-Bara' striking his hand upon the other (to give an indication) how he did that. He milked the goat for me in a wooden cup which he had with him and I had with me a bucket in which I kept water for drinking and for performing ablution. I came to Allah's Apostle (may peace be upon him) and did not like to awaken him from sleep but he was accidentally startled from the sleep. I poured water upon the milk (till It was cold) and I said: Allah's Messenger, take this milk. He then took It and I was delighted and he (the Holy Prophet) said: Is now not the time to march on? I said: Of course. So he marched on after the sun had passed the meridian and Suraqa b. Malik pursued us and we had been walking on soft, level ground. I said: Allah's Messenger, we are about to be overtaken by them. Thereupon he said: Be not grieved. Verily, Allah is with us. Then Allah's Messenger (may peace be upon him) cursed him and his horse sank into the earth. I think he also said: I know you have hurled curse upon me. So supplicate Allah for me and I take an oath that I shall turn everyone away who would come in search of you. So he (Allah's Messenger) supplicated Allah and he was rescued and he came back and to everyone he met, he said: I have combed all this side. In short, he diverted everyone whom he met and he in fact fulfilled his promise. Al-Bara' reported: Abu Bakr purchased a saddle from me for thirteen dirhams; the rest of the hadith is the same, and in the narration of Uthman b. 'Umar, the words are: He (Suraqa b. Malik) drew near Allah's Messenger (may peace be upon him), and he (the Holy Prophet) cursed him and his camel sank in the earth up to the belly and he jumped from that and said: Muhammad, I am fully aware of It that it is your doing. Supplicate Allah that He should rescue me from it in which I am (pitchforked) and I give you a solemn pledge that I shall keep this as a secret from all those who are coming after me. Take hold of an arrow out of it (quiver) for you will find my camels and my slaves at such and such place and you can get whatever you need (on showing this arrow). He (the Holy Prophet) said: I don't need your camels. And we (the Holy Prophet and Abu Bakr) came to Medina during the night and the people began to contend as to where Allah's Messenger (may peace be upon him) should reside and he encamped in the tribe of Najjar who were related to 'Abd ul-Muttalib from the side of mother. Allah's Messenger (may peace be upon him) honoured them, then people climbed upon house-top and women also and boys scattered in the way, and they were all crying: Muhammad, Messenger of Allah, Muhammad, Messenger of Allah.",
      "chain": [
        "30417",
        "20418",
        "20321",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "2949",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا سلمة بن شبيب، حدثنا عبد الرزاق، أخبرنا معمر، عن همام بن منبه، قال هذا ما حدثنا به أبو هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما أوتيكم من شىء وما أمنعكموه إن أنا إلا خازن أضع حيث أمرت ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: It is not on my own that I give you or withhold from you: I am just a treasure, putting it where I have been commanded.",
      "chain": [
        "30417",
        "20121",
        "20115",
        "11447"
      ]
    },
    {
      "hadith_no": "3562",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا الحسن بن محمد، وسلمة بن شبيب، قالا حدثنا يزيد بن هارون، حدثنا شريك، عن عبد العزيز بن رفيع، عن أمية بن صفوان بن أمية، عن أبيه، أن رسول الله صلى الله عليه وسلم استعار منه أدراعا يوم حنين فقال أغصب يا محمد فقال ‏\"‏ لا بل عارية مضمونة ‏\"‏ ‏.‏ قال أبو داود وهذه رواية يزيد ببغداد وفي روايته بواسط تغير على غير هذا ‏.‏",
      "text_en": " Narrated Safwan ibn Umayyah:                     The Messenger of Allah (ﷺ) borrowed coats of mail from him on the day of (the battle of) Hunayn. He asked: Are you taking them by force. Muhammad? He replied: No, it is a loan with a guarantee of their return.Abu Dawud said: This tradition narrated by Yazid (b. Harun) at Baghdad. There is some change in the tradition narrated by him at Wasit, which is something different.",
      "chain": [
        "30245",
        "30417",
        "20472",
        "11858",
        "11257",
        "13005",
        "449"
      ]
    },
    {
      "hadith_no": "3609",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن يحيى، وسلمة بن شبيب، قالا حدثنا عبد الرزاق، أخبرنا محمد بن مسلم، عن عمرو بن دينار، بإسناده ومعناه ‏.‏ قال سلمة في حديثه قال عمرو في الحقوق ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by 'Amr bin Dinar through a different chain of narrators and to the same effect. Salamah has in his version:                      'Amr said: In the rights (of the people).",
      "chain": [
        "11222",
        "30417",
        "20121",
        "167",
        "11081"
      ]
    },
    {
      "hadith_no": "3617",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا أحمد بن حنبل، وسلمة بن شبيب، قالا حدثنا عبد الرزاق، - قال أحمد قال - حدثنا معمر، عن همام بن منبه، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا كره الاثنان اليمين أو استحباها فليستهما عليها ‏\"‏ ‏.‏ قال سلمة قال أخبرنا معمر وقال إذا أكره الاثنان على اليمين ‏.‏",
      "text_en": " Abu hurairah reported the holy prophet (peace be upon him) as saying:                      When two men dislike the oath or like it,lots will be cost about it. Salamah said on the authority of Ma’mar who said: when the two are compelled to take an oath.",
      "chain": [
        "30007",
        "30417",
        "20121",
        "30007",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "4846",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا سلمة بن شبيب، حدثنا عبد الله بن إبراهيم، قال حدثني إسحاق بن محمد الأنصاري، عن ربيح بن عبد الرحمن، عن أبيه، عن جده أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم كان إذا جلس احتبى بيده ‏.‏ قال أبو داود عبد الله بن إبراهيم شيخ منكر الحديث ‏.‏",
      "text_en": " Narrated AbuSa'id al-Khudri:                     When the Messenger of Allah (ﷺ) sat, he had his knees drawn up supported by his hands.Abu Dawud said: 'And Allah b. Ibrahim was an old man and his traditions were rejected.",
      "chain": [
        "30417",
        "32012",
        "22020",
        "22055",
        "11879",
        "38"
      ]
    },
    {
      "hadith_no": "5097",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن محمد المروزي، وسلمة، - يعني ابن شبيب - قالا حدثنا عبد الرزاق، أخبرنا معمر، عن الزهري، قال حدثني ثابت بن قيس، أن أبا هريرة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ الريح من روح الله ‏\"‏ ‏.‏ قال سلمة فروح الله تأتي بالرحمة وتأتي بالعذاب فإذا رأيتموها فلا تسبوها وسلوا الله خيرها واستعيذوا بالله من شرها ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     I heard the Messenger of Allah (ﷺ) say: The wind comes from Allah's mercy. Salamah's version has: It is Allah's mercy; it (sometimes) brings blessing and (sometimes) brings punishment. So when you see it, do not revile it, but ask Allah for some of its good, and seek refuge in Allah from its evil.",
      "chain": [
        "30304",
        "30417",
        "20121",
        "20115",
        "11013",
        "239",
        "13"
      ]
    },
    {
      "hadith_no": "5227",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا سلمة بن شبيب، حدثنا عبد الرزاق، أخبرنا معمر، عن قتادة، أو غيره أن عمران بن حصين، قال كنا نقول في الجاهلية أنعم الله بك عينا وأنعم صباحا فلما كان الإسلام نهينا عن ذلك ‏.‏ قال عبد الرزاق قال معمر يكره أن يقول الرجل أنعم الله بك عينا ولا بأس أن يقول أنعم الله عينك ‏.‏",
      "text_en": " Narrated Imran ibn Husayn:                     In the pre-Islamic period we used to say: \"May Allah make the eye happy for you,\" and \"Good morning\" but when Islam came, we were forbidden to say that. AbdurRazzaq said on the authority of Ma'mar: It is disapproved that a man should say: \"May Allah make the eye happy for you,\" but there is no harm in saying: \"May Allah make your eye happy.",
      "chain": [
        "30417",
        "20121",
        "20115",
        "123",
        "20121"
      ]
    }
  ],
  "total_hadiths": 69
}