{
  "id": "30423",
  "name": "Ahmed bin 'Ubda bin Musa أحمد بن عبدة بن موسى",
  "full_name": "Ahmed bin 'Ubda bin Musa أحمد بن عبدة بن موسى",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "245",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  4  -  ثقة ]"
    ],
    "tags": [
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20022",
      "name": "Hammad bin Zayd حماد بن زيد بن درهم الأزدي الأزرق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20200",
      "name": "Fadayl bin 'Iyyad bin Mas'ud فضيل بن عياض بن مسعود",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "students": [
    {
      "id": "38383",
      "name": "'Uthman bin 'Abdullah عثمان بن عبد الله بن محمد بن خرزاذ",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30013",
      "name": "Ibn Abi Dunya ابن أبي الدنيا",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30554",
      "name": "Abu Zara' al-Razi أبو زرعة الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "135",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن عبدة الضبي، أخبرنا عبد العزيز، - يعني الدراوردي - عن العلاء، ح وحدثنا أمية بن بسطام، - واللفظ له - حدثنا يزيد بن زريع، حدثنا روح، عن العلاء بن عبد الرحمن بن يعقوب، عن أبيه، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ أمرت أن أقاتل الناس حتى يشهدوا أن لا إله إلا الله ويؤمنوا بي وبما جئت به فإذا فعلوا ذلك عصموا مني دماءهم وأموالهم إلا بحقها وحسابهم على الله ‏\"‏ ‏.‏",
      "text_en": " It is reported on the authority of Abu Huraira that he heard the Messenger of Allah say:                      I have been commanded to fight against people, till they testify to the fact that there is no god but Allah, and believe in me (that) I am the messenger (from the Lord) and in all that I have brought. And when they do it, their blood and riches are guaranteed protection on my behalf except where it is justified by law, and their affairs rest with Allah.",
      "chain": [
        "30423",
        "20167",
        "10606",
        "30124",
        "20304",
        "20229",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "327",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن عبدة الضبي، حدثنا عبد العزيز بن محمد، وأبو علقمة الفروي قالا حدثنا صفوان بن سليم، عن عبد الله بن سلمان، عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله يبعث ريحا من اليمن ألين من الحرير فلا تدع أحدا في قلبه - قال أبو علقمة مثقال حبة وقال عبد العزيز مثقال ذرة - من إيمان إلا قبضته ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Huraira that the Messenger of Allah (may peace be upon him) said:                      Verily Allah would make a wind to blow from the side of the Yemen more delicate than silk and would spare none but cause him to die who, in the words of Abu 'Alqama, has faith equal to the weight of a grain; while Abdul-'Aziz said: having faith equal to the weight of a dust particle.",
      "chain": [
        "30423",
        "20167",
        "11177",
        "13"
      ]
    },
    {
      "hadith_no": "229",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا قتيبة بن سعيد، وأحمد بن عبدة الضبي، قالا حدثنا عبد العزيز، - وهو الدراوردي - عن زيد بن أسلم، عن حمران، مولى عثمان قال أتيت عثمان بن عفان بوضوء فتوضأ ثم قال إن ناسا يتحدثون عن رسول الله صلى الله عليه وسلم أحاديث لا أدري ما هي إلا أني رأيت رسول الله صلى الله عليه وسلم توضأ مثل وضوئي هذا ثم قال ‏\"‏ من توضأ هكذا غفر له ما تقدم من ذنبه وكانت صلاته ومشيه إلى المسجد نافلة ‏\"‏ ‏.‏ وفي رواية ابن عبدة أتيت عثمان فتوضأ ‏.‏",
      "text_en": " Humran, the freed slave of 'Uthman reported:                      I brought for Uthman b. 'Affan the ablution water. He performed ablution and then said: Verily the people narrate from the Messenger of Allah (may peace be upon him) a hadith. I do not know what these are. but (I know this fact) that I saw the Messenger of Allah (may peace be upon him) perform ablution like this ablution of mine and then he said: He who performed ablution like this, all his previous sins would be expiated and his prayer and going towards the mosque would have an extra reward. In the tradition narrated by Ibn 'Abda (the words are):\" I came to Uthman and he performed ablution.\"",
      "chain": [
        "30367",
        "30423",
        "20167",
        "11163",
        "11421",
        "4"
      ]
    },
    {
      "hadith_no": "1333",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثني عمرو الناقد، حدثنا عيسى بن يونس، ح قال وحدثنا أبو كامل، حدثنا يزيد، - يعني ابن زريع - ح قال وحدثنا أحمد بن عبدة، حدثنا سليم بن أخضر، كلهم عن التيمي، بهذا الإسناد ‏.‏ غير أنهم لم يقولوا خلف أبي القاسم صلى الله عليه وسلم ‏.‏",
      "text_en": " This hadith has been narrated by Tamimi with the same chain of transmitters except for this that they made no mention of:                     \" Behind Abu'l-Qasim\" (may peace be upon him).",
      "chain": [
        "30263",
        "20347",
        "20304",
        "30423",
        "20546"
      ]
    },
    {
      "hadith_no": "2433",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا محمد بن بشار، ومحمد بن حاتم، وأحمد بن عبدة، جميعا عن يحيى القطان، - قال ابن بشار حدثنا يحيى، - حدثنا عمرو بن عثمان، قال سمعت موسى بن طلحة، يحدث أن حكيم بن حزام، حدثه أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أفضل الصدقة - أو خير الصدقة - عن ظهر غنى واليد العليا خير من اليد السفلى وابدأ بمن تعول ‏\"‏‏.‏",
      "text_en": " Hakim b. Hizam reported Allah's Messenger (may peace be upon him) having said this:                      The most excellent Sadaqa or the best of Sadaqa is that after giving which the (giver) remains rich and the upper hand is better than the lower hand, and begin from the members of your household.",
      "chain": [
        "30160",
        "38487",
        "30423",
        "20031",
        "30160",
        "20031",
        "10581",
        "579",
        "423"
      ]
    },
    {
      "hadith_no": "2491",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثنا أحمد بن عبدة الضبي، أخبرنا ابن عيينة، عن عمر بن سعيد بن مسروق، بهذا الإسناد أن النبي صلى الله عليه وسلم قسم غنائم حنين فأعطى أبا سفيان بن حرب مائة من الإبل ‏.‏ وساق الحديث بنحوه وزاد وأعطى علقمة بن علاثة مائة ‏.‏",
      "text_en": " This hadith has been narrated by Sa'id b. Masruq with the same chain of transmitters (with the words):                     \" The Apostle of Allah (may peace be upon him) distributed the spoils of Hunain, and he (the Holy Prophet) gave one hundred camels to Abu Sufyan b. Harb. The rest of the hadith is the same, but with this addition:\" He bestowed upon\" Alqama b. 'Ulatha one hundred (camels).\"",
      "chain": [
        "30423",
        "20005",
        "10652"
      ]
    },
    {
      "hadith_no": "2915",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا أحمد بن عبدة الضبي، حدثنا فضيل بن سليمان النميري، حدثنا أبو حازم، عن عبد الله بن أبي قتادة، عن أبيه، - رضى الله عنه - أنهم خرجوا مع رسول الله صلى الله عليه وسلم وهم محرمون وأبو قتادة محل ‏.‏ وساق الحديث وفيه فقال ‏\"‏ هل معكم منه شىء ‏\"‏ ‏.‏ قالوا معنا رجله ‏.‏ قال فأخذها رسول الله صلى الله عليه وسلم فأكلها ‏.‏",
      "text_en": " 'Abdullah b. Abu Qatada reported on the authority of his father (Allah be pleased with him) that they went out with the Messenger of Allah (may peace be upon him) and they were Muhrim except Abu Qatada. The rest of the hadith Is the same (but with the exception of these words):                     \" He (the Holy Prophet) said: 15 there any- thing out of it? They said: We have its leg with us. The Messenger of Allah (may peace be upon him) took it and ate it.\"",
      "chain": [
        "30423",
        "20271",
        "11172",
        "11804",
        "391"
      ]
    },
    {
      "hadith_no": "3098",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا أحمد بن عبدة الضبي، حدثنا يزيد، - يعني ابن زريع - حدثنا حبيب، المعلم عن عطاء، عن ابن عباس، أن النبي صلى الله عليه وسلم قال لامرأة من الأنصار يقال لها أم سنان ‏\"‏ ما منعك أن تكوني حججت معنا ‏\"‏ ‏.‏ قالت ناضحان كانا لأبي فلان - زوجها - حج هو وابنه على أحدهما وكان الآخر يسقي عليه غلامنا ‏.‏ قال ‏\"‏ فعمرة في رمضان تقضي حجة ‏.‏ أو حجة معي ‏\"‏ ‏.‏",
      "text_en": " Ibn Abbis reported that Allah's Apostle (may peace be upon him) said to a woman of the Ansar who was called Umm Sinan:                      What has prevented you that you did not perform Hajj with us? She said: The father of so and so (i. e. her husband) had only two camels. One of them had been taken away by him (my busbard) and his son for Hajj, whereas the other one is used by our boy to carry water. Upon this he (the Holy Prophet) said: Umra during the month of Rawadin would suffice for Hajj or Hajj along with me.",
      "chain": [
        "30423",
        "20304",
        "11276",
        "11029",
        "17"
      ]
    },
    {
      "hadith_no": "3119",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني عمرو الناقد، وابن أبي عمر، وأحمد بن عبدة، جميعا عن ابن عيينة، - قال ابن عبدة حدثنا سفيان، - عن عمرو، عن عطاء، عن ابن عباس، قال إنما سعى رسول الله صلى الله عليه وسلم ورمل بالبيت ليري المشركين قوته ‏.‏",
      "text_en": " Ibn Abbas (Allah be pleased with them) reported:                      Allah. 's Messenger (peace be upon him) observed Sa'i and walked quickly round the House with a view to showing his strength to the polytheists.",
      "chain": [
        "30263",
        "30421",
        "30423",
        "20005",
        "20005",
        "11081",
        "11029",
        "17"
      ]
    },
    {
      "hadith_no": "3232",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وإسحاق بن إبراهيم، وابن أبي عمر، وأحمد بن، عبدة - واللفظ لأبي بكر - حدثنا سفيان بن عيينة، عن عمرو، عن عطاء، عن ابن عباس، قال ليس التحصيب بشىء إنما هو منزل نزله رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Ibn 'Abbas (Allah be pleased with them) reported:                      Halt at Muhassab is not something (significant from the point of view of the Shari'ah). It is a place of halt where Allah's Messenger (way peace be upon him) halted.",
      "chain": [
        "30201",
        "30123",
        "30421",
        "30423",
        "20005",
        "11081",
        "11029",
        "17"
      ]
    },
    {
      "hadith_no": "3626",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "حدثنا عبيد الله بن عمر القواريري، وأحمد بن عبدة، قال ابن عبدة أخبرنا وقال، عبيد الله حدثنا سفيان بن عيينة، عن ابن أبي نجيح، عن مجاهد، عن قزعة، عن أبي سعيد، الخدري قال ذكر العزل عند رسول الله صلى الله عليه وسلم فقال ‏\"‏ ولم يفعل ذلك أحدكم - ولم يقل فلا يفعل ذلك أحدكم - فإنه ليست نفس مخلوقة إلا الله خالقها ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id al-Khudri (Allah be pleased with him) reported:                      Mention was made about al-'azl in the presence of Allah's Messenger (may peace be upon him), whereupon he said: Why any one of you practises it? (He did not say: One of you should not do it), for there is no created soul, whose creator is not Allah.",
      "chain": [
        "30024",
        "30423",
        "11201",
        "20005",
        "11254",
        "11028",
        "38"
      ]
    },
    {
      "hadith_no": "3784",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "وحدثنا أحمد بن عبدة الضبي، حدثنا أبو داود، حدثنا سليمان بن معاذ، عن أبي، إسحاق بهذا الإسناد نحو حديث أبي أحمد عن عمار بن رزيق، بقصته ‏.‏",
      "text_en": " A hadith like this has been narrated on the authority of Ishaq with the same chain of transmitters.",
      "chain": [
        "30423",
        "30002"
      ]
    },
    {
      "hadith_no": "3914",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "حدثنا ابن أبي عمر، وأحمد بن عبدة، قالا حدثنا سفيان، ح وحدثنا أبو بكر بن، أبي شيبة وأبو كريب قالا حدثنا وكيع، عن سفيان، - وهو الثوري - كلاهما عن عمرو، بن دينار بهذا الإسناد نحوه ‏.‏",
      "text_en": " A hadith like this has been narrated through the same chain of transmitters.",
      "chain": [
        "30421",
        "30423",
        "20005",
        "20032",
        "11081"
      ]
    },
    {
      "hadith_no": "4386",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "وحدثنا أحمد بن عبدة الضبي، حدثنا حماد بن زيد، حدثنا أيوب، عن نافع، قال ذكر عند ابن عمر عمرة رسول الله صلى الله عليه وسلم من الجعرانة فقال لم يعتمر منها - قال - وكان عمر نذر اعتكاف ليلة في الجاهلية ‏.‏ ثم ذكر نحو حديث جرير بن حازم ومعمر عن أيوب ‏.‏",
      "text_en": " Nafi' reported:                      A mention of Allah's Messenger (may peace be upon him) observing 'Umra from ja'rina was made before Ibn 'Umar. He said: He did not enter into the state of Ihram from that (place), and Umar had taken a vow of observing I'tikaf for a night during the days of Ignorance. The rest of the hadith is the same.",
      "chain": [
        "30423",
        "20022",
        "11015",
        "11014"
      ]
    },
    {
      "hadith_no": "4427",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "وحدثنا محمد بن منهال الضرير، وأحمد بن عبدة، قالا حدثنا يزيد بن زريع، حدثنا هشام بن حسان، عن محمد بن سيرين، عن عمران بن حصين، عن النبي صلى الله عليه وسلم بمثل حديث ابن علية وحماد ‏.‏",
      "text_en": " This hadith has been reported on the authority of Imran b. Husain through another chain of narrators.",
      "chain": [
        "30173",
        "30423",
        "20304",
        "11311",
        "11035",
        "123"
      ]
    },
    {
      "hadith_no": "4918",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا سعيد بن عمرو الأشعثي، وسويد بن سعيد، وإسحاق بن إبراهيم، وأحمد، بن عبدة - واللفظ لسعيد قال سعيد وإسحاق أخبرنا وقال الآخران، حدثنا سفيان، عن عمرو، عن جابر، قال كنا يوم الحديبية ألفا وأربعمائة فقال لنا النبي صلى الله عليه وسلم ‏\"‏ أنتم اليوم خير أهل الأرض ‏\"‏ ‏.‏ وقال جابر لو كنت أبصر لأريتكم موضع الشجرة.",
      "text_en": " It has been narrated (through a different chain of transmitters) on the authority of Jabir who said:                      We were one thousand and four hundred on the Day of Hudaibiya when the Holy Prophet (may peace be upon him) said to us: Today you are the best people on the earth. And Jabir said: If I had the eyesight, I could show you the place of the tree.",
      "chain": [
        "30465",
        "30547",
        "30123",
        "30423",
        "20005",
        "11081",
        "34"
      ]
    },
    {
      "hadith_no": "4952",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا محمد بن المثنى، وعبيد الله بن سعيد، قالا حدثنا يحيى، - وهو القطان - جميعا عن عبيد الله، ح وحدثني علي بن حجر، وأحمد بن عبدة، وابن أبي عمر، قالوا حدثنا سفيان، عن إسماعيل بن أمية، ح وحدثني محمد بن رافع، حدثنا عبد الرزاق، أخبرنا  ابن جريج، أخبرني موسى بن عقبة، ح وحدثنا هارون بن سعيد الأيلي، حدثنا ابن وهب، أخبرني أسامة، - يعني ابن زيد - كل هؤلاء عن نافع، عن ابن عمر، بمعنى حديث مالك عن نافع، ‏.‏ وزاد في حديث أيوب من رواية حماد وابن علية قال عبد الله فجئت سابقا فطفف بي الفرس المسجد ‏.‏",
      "text_en": "",
      "chain": [
        "30170",
        "30359",
        "11201",
        "20387",
        "30423",
        "30421",
        "20005",
        "11417",
        "30375",
        "20121",
        "11070",
        "11106"
      ]
    },
    {
      "hadith_no": "6174",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وابن أبي عمر، وأحمد بن عبدة، قالوا حدثنا سفيان، عن عمرو، عن نافع بن جبير، عن جرير، عن النبي صلى الله عليه وسلم بمثل حديث الأعمش ‏.‏",
      "text_en": "",
      "chain": [
        "30201",
        "30421",
        "30423",
        "20005",
        "11081",
        "11059",
        "4057"
      ]
    },
    {
      "hadith_no": "6191",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثنا زهير بن حرب، وإسحاق بن إبراهيم، جميعا عن جرير، ح وحدثنا أحمد، بن عبدة حدثنا فضيل بن عياض، كلاهما عن منصور، عن محمد، في رواية فضيل بن شهاب وفي رواية جرير محمد الزهري عن عروة، عن عائشة، ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Ibn Shibab through another chain of transmitters.",
      "chain": [
        "30022",
        "30123",
        "20028",
        "30423",
        "20200",
        "11067",
        "10511"
      ]
    },
    {
      "hadith_no": "6503",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا أحمد بن عبدة الضبي، حدثنا أبو داود، حدثنا شعبة، أنبأني أبو إسحاق، قال سمعت البراء بن عازب، يقول أتي رسول الله صلى الله عليه وسلم بثوب حرير ‏.‏ فذكر الحديث ثم قال ابن عبدة أخبرنا أبو داود حدثنا شعبة حدثني قتادة عن أنس بن مالك عن النبي صلى الله عليه وسلم بنحو هذا أو بمثله ‏.‏",
      "text_en": "",
      "chain": [
        "30423",
        "30002",
        "400"
      ]
    },
    {
      "hadith_no": "6569",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا إسحاق بن إبراهيم الحنظلي، وأحمد بن عبدة، - واللفظ لإسحاق - قالا أخبرنا سفيان، عن عمرو، عن جابر بن عبد الله، قال فينا نزلت ‏{‏ إذ همت طائفتان منكم أن تفشلا والله وليهما‏}‏ بنو سلمة وبنو حارثة وما نحب أنها لم تنزل لقول الله عز وجل ‏{‏ والله وليهما‏}‏ ‏.‏",
      "text_en": " Jabir b. Abdullah reported that it was concerning them (the Ansar) that this verse was revealed, that when the two groups amongst you were about to lose heart and Allah was the Guardian of them both. This concerned Banu Salama and Banu Haritha and we did not like that Allah, the Exalted and Glorious, should not have revealed this verse for the fact that Allah (gave an assurance) of being the Guardian of both.",
      "chain": [
        "30021",
        "30423",
        "20005",
        "11081",
        "34"
      ]
    },
    {
      "hadith_no": "6748",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، وأحمد بن عبدة الضبي، وابن أبي، عمر - واللفظ لابن أبي شيبة - قال ابن عبدة أخبرنا وقال الآخرون، حدثنا سفيان بن، عيينة قال سمع عمرو، جابر بن عبد الله يقول كنا مع النبي صلى الله عليه وسلم في غزاة فكسع رجل من المهاجرين رجلا من الأنصار فقال الأنصاري يا للأنصار وقال المهاجري يا للمهاجرين ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ ما بال دعوى الجاهلية ‏\"‏ ‏.‏ قالوا يا رسول الله كسع رجل من المهاجرين رجلا من الأنصار ‏.‏ فقال ‏\"‏ دعوها فإنها منتنة ‏\"‏ ‏.‏ فسمعها عبد الله بن أبى فقال قد فعلوها والله لئن رجعنا إلى المدينة ليخرجن الأعز منها الأذل ‏.‏ قال عمر دعني أضرب عنق هذا المنافق فقال ‏\"‏ دعه لا يتحدث الناس أن محمدا يقتل أصحابه ‏\"‏ ‏.‏",
      "text_en": " Jabir b. Abdullah reported:                      We were along with Allah's Messenger (may peace be upon him) in an expedition that a person from amongst the emigrants struck at the back of a person from the Ansir. The Ansiri said: O Ansar! And the Muhijir said: O Emigrants! Thereupon Allah's Messenger (may peace be upon him) said: What are these proclamations of the Days of Ignorance? They said: Allah's Messenger, a person from the emigrants struck at the back of an Ansari, whereupon he said: It is something disgusting. 'Abdullah b. Ubayy heard it and said: They have indeed done it. By Allah, when we would return to Medina the respectable amongst them (the Ansar) would turn away the mean (the emigrants). Thereupon 'Umar said: Permit me so that I should strike the neck of this hypocrite. But he (the Holy Prophet) said: Leave him, the people may not say that Muhammad kills his companions.",
      "chain": [
        "30201",
        "30022",
        "30423",
        "30421",
        "20005"
      ]
    },
    {
      "hadith_no": "6912",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Destiny - كتاب القدر",
      "chapter_no": "47",
      "text_ar": "حدثني محمد بن حاتم، وإبراهيم بن دينار، وابن أبي عمر المكي، وأحمد بن عبدة، الضبي جميعا عن ابن عيينة، - واللفظ لابن حاتم وابن دينار - قالا حدثنا سفيان بن، عيينة عن عمرو، عن طاوس، قال سمعت أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ احتج آدم وموسى فقال موسى يا آدم أنت أبونا خيبتنا وأخرجتنا من الجنة فقال له آدم أنت موسى اصطفاك الله بكلامه وخط لك بيده أتلومني على أمر قدره الله على قبل أن يخلقني بأربعين سنة ‏\"‏ ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ فحج آدم موسى فحج آدم موسى ‏\"‏ ‏.‏ وفي حديث ابن أبي عمر وابن عبدة قال أحدهما خط ‏.‏ وقال الآخر كتب لك التوراة بيده ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (way peace be upon him) as saying:                      There was argument between Adam and Moses. Moses said to Adam: You are our father. You did us harm and caused us to get out of Paradise. Adam said to him: You are Moses. Allah selected you (for direct conversation with you) and wrote with His own Hand the Book (Torah) for you. Despite this you blame me for an act which Allah had ordained for me forty years before He created me. Allah's Apostle (may peace be upon him) said:. This is how Adam came the better of Moses and Adam came the better of Moses.",
      "chain": [
        "38487",
        "30496",
        "30421",
        "30423",
        "20005",
        "11081",
        "11053",
        "13"
      ]
    },
    {
      "hadith_no": "7201",
      "source": " Sahih Muslim ",
      "chapter": "Pertaining To The Charateristics Of The Hypocrites And Command Concerning Them - كتاب صفات المنافقين وأحكامهم",
      "chapter_no": "52",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، وأحمد بن عبدة الضبي، - واللفظ لابن أبي شيبة - قال ابن عبدة أخبرنا وقال الآخران، حدثنا سفيان بن عيينة، عن عمرو، أنه سمع جابرا، يقول أتى النبي صلى الله عليه وسلم قبر عبد الله بن أبى فأخرجه من قبره فوضعه على ركبتيه ونفث عليه من ريقه وألبسه قميصه فالله أعلم ‏.‏",
      "text_en": " Jabir reported Allah's Apostle (may peace be upon him) came to the grave of 'Abdullah b. Ubayy, brought him out from that, placed him on his knee and put his saliva in his mouth and shrouded him in his own shirt and Allah knows best.",
      "chain": [
        "30201",
        "30022",
        "30423",
        "20005",
        "11081",
        "34"
      ]
    },
    {
      "hadith_no": "7435",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "وحدثناه أحمد بن عبدة الضبي، حدثنا حماد، عن أيوب، ويونس، والمعلى بن زياد، عن الحسن، عن الأحنف بن قيس، عن أبي بكرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا التقى المسلمان بسيفيهما فالقاتل والمقتول في النار ‏\"‏ ‏.‏",
      "text_en": " Ahnaf b. Qais reported on the authority of Abu Bakra that Allah's Messenger (may peace be upon him) said:                      When two Muslims confront each other with their swords, both the slayer and the slain are doomed to Hell-Fire.",
      "chain": [
        "30423",
        "20022",
        "11015",
        "20475",
        "11016",
        "11112",
        "3229"
      ]
    },
    {
      "hadith_no": "7665",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "وحدثناه أحمد بن عبدة الضبي، أخبرنا أبو داود، حدثنا عبد العزيز بن أبي سلمة، حدثنا وهب بن كيسان، بهذا الإسناد غير أنه قال ‏\"‏ وأجعل ثلثه في المساكين والسائلين وابن السبيل ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Wahb b. Kaisan with the same chain of transmitters but with this change that he said:                     \" I earmark one-third for the poor, the needy and the wayfarers.\"",
      "chain": [
        "30423",
        "30002",
        "32017",
        "11231"
      ]
    },
    {
      "hadith_no": "7733",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Commentary - كتاب التفسير",
      "chapter_no": "57",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وإسحاق بن إبراهيم، وأحمد بن عبدة الضبي، - واللفظ لابن أبي شيبة - قال حدثنا وقال الآخران، أخبرنا سفيان، عن عمرو، عن عطاء، عن ابن عباس، قال لقي ناس من المسلمين رجلا في غنيمة له فقال السلام عليكم ‏.‏ فأخذوه فقتلوه وأخذوا تلك الغنيمة فنزلت ‏{‏ ولا تقولوا لمن ألقى إليكم السلم لست مؤمنا‏}‏ وقرأها ابن عباس السلام ‏.‏",
      "text_en": " Ibn Abbas reported that some Muslims met a person with a small flock of sheep. He said:                      As-Salam-o-'Alaikum. They caught hold of him and killed him and took possession of his flock. Then this verse was revealed:\" He who meets you and extends you salutations, don't say: You are not a Muslim\" (iv. 94). Ibn 'Abbas, however, recited the word as-Salam instead of\" as-Salam\".",
      "chain": [
        "30201",
        "30123",
        "30423",
        "20005",
        "11081",
        "11029",
        "17"
      ]
    },
    {
      "hadith_no": "1002",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن عبدة، أخبرنا سفيان، عن عمرو، عن أبي معبد، عن ابن عباس، قال كان يعلم انقضاء صلاة رسول الله صلى الله عليه وسلم بالتكبير ‏.‏",
      "text_en": " Ibn ‘Abbas said:                      The end of the prayer of the Messenger of Allah (ﷺ) was known by the takbir (pronounced aloud).",
      "chain": [
        "30423",
        "20005",
        "11081",
        "13127",
        "17"
      ]
    },
    {
      "hadith_no": "1601",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا أحمد بن عبدة الضبي، حدثنا المغيرة، - ونسبه إلى عبد الرحمن بن الحارث المخزومي - قال حدثني أبي، عن عمرو بن شعيب، عن أبيه، عن جده، أن شبابة، - بطن من فهم - فذكر نحوه قال من كل عشر قرب قربة وقال سفيان بن عبد الله الثقفي قال وكان يحمي لهم واديين زاد فأدوا إليه ما كانوا يؤدون إلى رسول الله صلى الله عليه وسلم وحمى لهم وادييهم ‏.‏",
      "text_en": " 'Amr bin Shu'aib, on his father's authority, said that his grandfather reported:                      That was Banu Shababah, a sub-clan of the tribe Fahm. The narrator then transmitted the tradition something similar. He added:(They used to pay) one bag (of honey) out of ten bags. Sufyan ibn Abdullah ath-Thaqafi gave them two woods as protected lands. They used to give as much honey (as zakat) as they gave to the Messenger of Allah (ﷺ). He (Sufyan) used to protect their woods.",
      "chain": [
        "30423",
        "19934",
        "19911",
        "5066"
      ]
    },
    {
      "hadith_no": "2831",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Sacrifice (Kitab Al-Dahaya) - كتاب الضحايا",
      "chapter_no": "16",
      "text_ar": "حدثنا أحمد بن عبدة، أخبرنا سفيان، عن الزهري، عن سعيد، عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏\"‏ لا فرع ولا عتيرة ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     Prophet (ﷺ) sa saying: There is no fara' and 'atirah.",
      "chain": [
        "30423",
        "20005",
        "11013",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "2965",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا عثمان بن أبي شيبة، وأحمد بن عبدة، - المعنى - أن سفيان بن عيينة، أخبرهم عن عمرو بن دينار، عن الزهري، عن مالك بن أوس بن الحدثان، عن عمر، قال كانت أموال بني النضير مما أفاء الله على رسوله مما لم يوجف المسلمون عليه بخيل ولا ركاب كانت لرسول الله صلى الله عليه وسلم خالصا ينفق على أهل بيته - قال ابن عبدة ينفق على أهله قوت سنة - فما بقي جعل في الكراع وعدة في سبيل الله عز وجل قال ابن عبدة في الكراع والسلاح ‏.‏",
      "text_en": " Narrated 'Umar:                     The properties of Banu al-Nadir were part of what Allah bestowed on His Apostle from what the Muslims has not ridden on horses or camels to get; so they belonged specially to the Messenger of Allah (ﷺ) who gave his family their annual contribution.Ibn 'Abdah said: His family (ahlihi) and not the members of his houses (ahl baitihi) ; then applied what remained for horses and weapons in Allah's path.",
      "chain": [
        "30203",
        "30423",
        "20005",
        "11081",
        "11013",
        "5030",
        "3"
      ]
    },
    {
      "hadith_no": "3143",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا أحمد بن عبدة، وأبو كامل - بمعنى الإسناد - أن يزيد بن زريع، حدثهم حدثنا أيوب، عن محمد بن سيرين، عن حفصة، أخته عن أم عطية، قالت مشطناها ثلاثة قرون ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Umm 'Atiyyah through a different chain of narrators to the same effect. This version adds:                      We braided her hair in three plaits.",
      "chain": [
        "30423",
        "20304",
        "11015",
        "11035",
        "71"
      ]
    },
    {
      "hadith_no": "3273",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا أحمد بن عبدة الضبي، حدثنا المغيرة بن عبد الرحمن، حدثني أبي عبد الرحمن، عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم قال ‏:‏ ‏\"‏ لا نذر إلا فيما يبتغى به وجه الله، ولا يمين في قطيعة رحم ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     The Messenger of Allah (ﷺ) said: A vow is binding in those things by which the pleasure of Allah is sought, and an oath to break ties of relationship is not binding.",
      "chain": [
        "30423",
        "20182",
        "11359",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "3587",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا أحمد بن عبدة الضبي، أخبرنا معاذ بن معاذ، قال أخبرني أبو عثمان الشامي، ولا إخالني رأيت شاميا أفضل منه يعني حريز بن عثمان ‏.‏",
      "text_en": " Mu'adh bin Mu'adh said:                      Abu 'Uthman al-Shami, whose name is Hariz bin 'Uthman, told me. I think I did not see anyone from Syria better than him.",
      "chain": [
        "30423",
        "20286"
      ]
    },
    {
      "hadith_no": "3612",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا أحمد بن عبدة، حدثنا عمار بن شعيب بن عبد الله بن الزبيب العنبري، حدثني أبي قال، سمعت جدي الزبيب، يقول بعث نبي الله صلى الله عليه وسلم جيشا إلى بني العنبر فأخذوهم بركبة من ناحية الطائف فاستاقوهم إلى نبي الله صلى الله عليه وسلم فركبت فسبقتهم إلى النبي صلى الله عليه وسلم فقلت السلام عليك يا نبي الله ورحمة الله وبركاته أتانا جندك فأخذونا وقد كنا أسلمنا وخضرمنا آذان النعم فلما قدم بلعنبر قال لي نبي الله صلى الله عليه وسلم ‏\"‏ هل لكم بينة على أنكم أسلمتم قبل أن تؤخذوا في هذه الأيام ‏\"‏ ‏.‏ قلت نعم ‏.‏ قال ‏\"‏ من بينتك ‏\"‏ ‏.‏ قلت سمرة رجل من بني العنبر ورجل آخر سماه له فشهد الرجل وأبى سمرة أن يشهد فقال نبي الله صلى الله عليه وسلم ‏\"‏ قد أبى أن يشهد لك فتحلف مع شاهدك الآخر ‏\"‏ ‏.‏ قلت نعم ‏.‏ فاستحلفني فحلفت بالله لقد أسلمنا يوم كذا وكذا وخضرمنا آذان النعم ‏.‏ فقال نبي الله صلى الله عليه وسلم ‏\"‏ اذهبوا فقاسموهم أنصاف الأموال ولا تمسوا ذراريهم لولا أن الله لا يحب ضلالة العمل ما رزيناكم عقالا ‏\"‏ ‏.‏ قال الزبيب فدعتني أمي فقالت هذا الرجل أخذ زربيتي فانصرفت إلى النبي صلى الله عليه وسلم - يعني فأخبرته - فقال لي ‏\"‏ احبسه ‏\"‏ ‏.‏ فأخذت بتلبيبه وقمت معه مكاننا ثم نظر إلينا نبي الله صلى الله عليه وسلم قائمين فقال ‏\"‏ ما تريد بأسيرك ‏\"‏ ‏.‏ فأرسلته من يدي فقام نبي الله صلى الله عليه وسلم فقال للرجل ‏\"‏ رد على هذا زربية أمه التي أخذت منها ‏\"‏ ‏.‏ فقال يا نبي الله إنها خرجت من يدي ‏.‏ قال فاختلع نبي الله صلى الله عليه وسلم سيف الرجل فأعطانيه ‏.‏ وقال للرجل ‏\"‏ اذهب فزده آصعا من طعام ‏\"‏ ‏.‏ قال فزادني آصعا من شعير ‏.‏",
      "text_en": " Narrated Zubayb ibn Tha'labah al-Anbari:                     The Messenger of Allah (ﷺ) sent an army to Banu al-Anbar. They captured them at Rukbah in the suburbs of at-Ta'if and drove them to the Holy Prophet (ﷺ).  I rode hurriedly to the Holy Prophet (ﷺ) and said: Peace be on you, Messenger of Allah, and the mercy of Allah and His blessings. Your contingent came to us and arrested us, but we had already embraced Islam and cut the sides of the ears of our cattle.  When Banu al-Anbar arrived, the Holy Prophet (ﷺ) said to me: Have you any evidence that you had embraced Islam before you were captured today?  I said: Yes.  He said: Who is your witness? I said: Samurah, a man from Banu al-Anbar, and another man whom he named. The man testified but Samurah refused to testify.  The Holy Prophet (ﷺ) said: He (Samurah) has refused to testify for you, so take an oath with your other witness.  I said: Yes. He then dictated an oath to me and I swore to the effect that we had embraced Islam on a certain day, and that we had cut the sides of the ears of the cattle.  The Holy Prophet (ﷺ) said: Go and divide half of their property, but do not touch their children. Had Allah not disliked the wastage of action, we should not have taxed you even a rope.  Zubayb said: My mother called me and said: This man has taken my mattress. I then went to the Holy Prophet (ﷺ) and informed him.  He said to me: Detain him. So I caught him with a garment around his neck, and stood there with him . Then the Holy Prophet (ﷺ) looked at us standing there. He asked: What do you intend (doing) with your captive?  I said: I shall let him go free if he returns to this (man) the mattress of his mother which he has taken from her.  He said: Prophet of Allah (ﷺ), I no longer have it.  He said: The Holy Prophet (ﷺ) took the sword of the man and gave it to me, and said to him: Go and give him some sa's of cereal. So he gave me some sa's of barley.",
      "chain": [
        "30423"
      ]
    },
    {
      "hadith_no": "3639",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا أحمد بن عبدة، حدثنا المغيرة بن عبد الرحمن، حدثني أبي عبد الرحمن بن الحارث، عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم قضى في السيل المهزور أن يمسك حتى يبلغ الكعبين ثم يرسل الأعلى على الأسفل ‏.‏",
      "text_en": " 'Amr bin Shu'aib on his father's authority said that his grandfather told that the Messenger of Allah (ﷺ) decided regarding the stream al-Mahzur that its water should be held back till it reached the ankles, and that the upper waters should then be allowed to flow to the lower.",
      "chain": [
        "30423",
        "20182",
        "11359",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "3815",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا أحمد بن عبدة، حدثنا يحيى بن سليم الطائفي، حدثنا إسماعيل بن أمية، عن أبي الزبير، عن جابر بن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما ألقى البحر أو جزر عنه فكلوه وما مات فيه وطفا فلا تأكلوه ‏\"‏ ‏.‏ قال أبو داود روى هذا الحديث سفيان الثوري وأيوب وحماد عن أبي الزبير أوقفوه على جابر وقد أسند هذا الحديث أيضا من وجه ضعيف عن ابن أبي ذئب عن أبي الزبير عن جابر عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     The Prophet (ﷺ) said: What the sea throws up and is left by the tide you may eat, but what dies in the sea and floats you must not eat.Abu Dawud said: This tradition has been transmitted by Sufyan al-Thawri, Ayyub and Hammad from Abu al-Zubair as the statement of Jabor himself (and not from the Prophet). It has been also transmitted direct from the Prophet (ﷺ) through a weak chain by Abu Dhi'b, from Abu al-Zubair on the authority if Jabir from the Prophet (ﷺ).",
      "chain": [
        "30423",
        "20204",
        "11417",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "3989",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Dialects and Readings of the Qur'an (Kitab Al-Huruf Wa Al-Qira'at) - كتاب الحروف والقراءات",
      "chapter_no": "32",
      "text_ar": "حدثنا أحمد بن عبدة، وإسماعيل بن إبراهيم أبو معمر الهذلي، عن سفيان، عن عمرو، عن عكرمة، قال حدثنا أبو هريرة، عن النبي صلى الله عليه وسلم - قال إسماعيل عن أبي هريرة رواية - فذكر حديث الوحى قال فذلك قوله تعالى ‏{‏ حتى إذا فزع عن قلوبهم ‏}‏ ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     The Prophet (ﷺ) as saying - the narrator Isma'il transmitted it from Abu Hurairah, and mentioned the tradition about the coming down of revelation-: \"So far (is this the case) that when terror is removed from their hearts.\"",
      "chain": [
        "30423",
        "20208",
        "20012",
        "11081",
        "11023",
        "13"
      ]
    },
    {
      "hadith_no": "3992",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Dialects and Readings of the Qur'an (Kitab Al-Huruf Wa Al-Qira'at) - كتاب الحروف والقراءات",
      "chapter_no": "32",
      "text_ar": "حدثنا أحمد بن حنبل، وأحمد بن عبدة، قالا حدثنا سفيان، عن عمرو، عن عطاء، - قال ابن حنبل لم أفهمه جيدا - عن صفوان، - قال ابن عبدة ابن يعلى - عن أبيه، قال سمعت النبي صلى الله عليه وسلم على المنبر يقرأ ‏{‏ ونادوا يا مالك ‏}‏ ‏.‏ قال أبو داود يعني بلا ترخيم ‏.‏",
      "text_en": " Safwan b. Ya'la quoting his father said:                      I heard the Prophet (ﷺ) read on the pulpit the verse: \"They will cry: O Malik.\"Abu Dawud said: That is, without shortening the name (Malik).",
      "chain": [
        "30007",
        "30423",
        "20005",
        "11081",
        "11029",
        "10921"
      ]
    },
    {
      "hadith_no": "4485",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا أحمد بن عبدة الضبي، حدثنا سفيان، قال الزهري أخبرنا عن قبيصة بن ذؤيب، أن النبي صلى الله عليه وسلم قال ‏\"‏ من شرب الخمر فاجلدوه فإن عاد فاجلدوه فإن عاد فاجلدوه فإن عاد في الثالثة أو الرابعة فاقتلوه ‏\"‏ ‏.‏ فأتي برجل قد شرب فجلده ثم أتي به فجلده ثم أتي به فجلده ثم أتي به فجلده ورفع القتل فكانت رخصة ‏.‏ قال سفيان حدث الزهري بهذا الحديث وعنده منصور بن المعتمر ومخول بن راشد فقال لهما كونا وافدى أهل العراق بهذا الحديث ‏.‏ قال أبو داود روى هذا الحديث الشريد بن سويد وشرحبيل بن أوس وعبد الله بن عمرو وعبد الله بن عمر وأبو غطيف الكندي وأبو سلمة بن عبد الرحمن عن أبي هريرة ‏.‏",
      "text_en": " Narrated Qabisah ibn Dhuwayb:                     The Prophet (ﷺ) said: If anyone drinks wine, flog him; if he repeats it, flog him, and if he repeats it, flog him. If he does it again a third or a fourth time, kill him. A man who had drunk wine was brought (to him) and he gave him lashes. He was again brought to him, and he flogged him. He was again brought to him and he flogged him. He was again brought to him and he flogged him. The punishment of killing (for drinking) was  repealed, and a concession was allowed.Sufyan said: Al-Zuhri transmitted this tradition when Mansur b. al-Mu'tamir amd Mukhawwal b. Rashid were present with him. He said to them: Take this tradition as a present to the people of Iraq.Abu Dawud said: This tradition has been transmitted by al-Sharid b. Suwaid, Sharahbil b. Aws, 'Abd Allah b. 'Amr, 'Abd Allah b. 'Umar, Abu Ghutaif al-Kindi, and Abu Salamah b. 'Abd al-Rahman from Abu Hurairah.",
      "chain": [
        "30423",
        "20005",
        "11013"
      ]
    },
    {
      "hadith_no": "5013",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا ابن أبي خلف، وأحمد بن عبدة، - المعنى - قالا حدثنا سفيان بن عيينة، عن الزهري، عن سعيد، قال مر عمر بحسان وهو ينشد في المسجد فلحظ إليه فقال قد كنت أنشد وفيه من هو خير منك ‏.‏",
      "text_en": " Sa'id said:                      Umar passed by Hassan when he was reciting verses in the mosque. He looked at him. Thereupon he said: I used to recite verses when there was present in it the one who was better than you (i.e. the Prophet).",
      "chain": [
        "30423",
        "20005",
        "11013",
        "11168"
      ]
    },
    {
      "hadith_no": "5180",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن عبدة، أخبرنا سفيان، عن يزيد بن خصيفة، عن بسر بن سعيد، عن أبي سعيد الخدري، قال كنت جالسا في مجلس من مجالس الأنصار فجاء أبو موسى فزعا فقلنا له ما أفزعك قال أمرني عمر أن آتيه فأتيته فاستأذنت ثلاثا فلم يؤذن لي فرجعت فقال ما منعك أن تأتيني قلت قد جئت فاستأذنت ثلاثا فلم يؤذن لي وقد قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا استأذن أحدكم ثلاثا فلم يؤذن له فليرجع ‏\"‏ ‏.‏ قال لتأتيني على هذا بالبينة قال فقال أبو سعيد لا يقوم معك إلا أصغر القوم ‏.‏ قال فقام أبو سعيد معه فشهد له ‏.‏",
      "text_en": " Abu Sa’id al-Khudri said:                      I was sitting in one of the meeting of the Ansar. Abu Musa came terrified. We asked him; what makes you terrified? He replied: ‘Umar sent for me; so I went to him and asked his permission three times, but he did not permit me (to enter), so I came back. He asked; what has prevented you from coming to me? I replied: I came and asked permission three times, but it was not granted to me (so I returned). The Messenger of Allah (May peace be upon him) has said: When one of you asks permission three times and it is not granted to him, he should go away. He (‘Umar’) said; establish the proof of it. So Abu Sa’id said: the youngest of the people will accompany you. So Abu Sa’id got up with him and testified.",
      "chain": [
        "30423",
        "20005",
        "11235",
        "11153",
        "38"
      ]
    },
    {
      "hadith_no": "6",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "أخبرنا أحمد بن عبدة الضبي البصري، حدثنا حماد بن زيد، عن عبد العزيز بن صهيب، عن أنس بن مالك، أن النبي صلى الله عليه وسلم كان إذا دخل الخلاء قال ‏\"‏ اللهم إني أعوذ بك من الخبث والخبائث ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Anas bin Malik said:                     \"When the Prophet would enter the toilet 'He said: \"O Allah! Indeed I seek refuge in You from Al-Khubith and Al- Khaba'ith.\"",
      "chain": [
        "30423",
        "20022",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "245",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن عبدة الضبي، حدثنا المعتمر بن سليمان، قال حدثني إسماعيل بن حماد، عن أبي خالد، عن ابن عباس، قال كان النبي صلى الله عليه وسلم يفتتح صلاته ب  ‏(‏بسم الله الرحمن الرحيم ‏)‏ ‏.‏ قال أبو عيسى هذا حديث ليس إسناده بذاك ‏.‏ وقد قال بهذا عدة من أهل العلم من أصحاب النبي صلى الله عليه وسلم منهم أبو هريرة وابن عمر وابن عباس وابن الزبير ومن بعدهم من التابعين رأوا الجهر ب  ‏(‏بسم الله الرحمن الرحيم ‏)‏ وبه يقول الشافعي ‏.‏ وإسماعيل بن حماد هو ابن أبي سليمان ‏.‏ وأبو خالد يقال هو أبو خالد الوالبي واسمه هرمز وهو كوفي ‏.‏",
      "text_en": " Ibn Abbas narrated:                     \"The Prophet would open his Salat with (Bismillahir-Rahmanir-Rahim).\"",
      "chain": [
        "30423",
        "20288",
        "17"
      ]
    },
    {
      "hadith_no": "382",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن عبدة الضبي، حدثنا حماد بن زيد، عن ميمون أبي حمزة، بهذا الإسناد نحوه وقال غلام لنا يقال له رباح ‏.‏ قال أبو عيسى وحديث أم سلمة إسناده ليس بذاك ‏.‏ وميمون أبو حمزة قد ضعفه بعض أهل العلم ‏.‏ واختلف أهل العلم في النفخ في الصلاة فقال بعضهم إن نفخ في الصلاة استقبل الصلاة ‏.‏ وهو قول سفيان الثوري وأهل الكوفة ‏.‏ وقال بعضهم يكره النفخ في الصلاة وإن نفخ في صلاته لم تفسد صلاته ‏.‏ وهو قول أحمد وإسحاق ‏.‏",
      "text_en": " (Another chain) in which Abu Hamzah narrated:                     \"A boy of ours named Rabah.\"",
      "chain": [
        "30423",
        "20022"
      ]
    },
    {
      "hadith_no": "419",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن عبدة الضبي، حدثنا عبد العزيز بن محمد، عن قدامة بن موسى، عن محمد بن الحصين، عن أبي علقمة، عن يسار، مولى ابن عمر عن ابن عمر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا صلاة بعد الفجر إلا سجدتين ‏\"‏ ‏.‏ ومعنى هذا الحديث إنما يقول لا صلاة بعد طلوع الفجر إلا ركعتى الفجر ‏.‏ قال وفي الباب عن عبد الله بن عمرو وحفصة ‏.‏ قال أبو عيسى حديث ابن عمر حديث غريب لا نعرفه إلا من حديث قدامة بن موسى وروى عنه غير واحد ‏.‏ وهو ما اجتمع عليه أهل العلم كرهوا أن يصلي الرجل بعد طلوع الفجر إلا ركعتى الفجر ‏.‏",
      "text_en": " Ibn Umar narrated that:                     Allah's Messenger (S) said: \"There is no Salat after Al-Fajr (begins) except two prostrations.\"",
      "chain": [
        "30423",
        "20167",
        "10610",
        "18"
      ]
    },
    {
      "hadith_no": "749",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا قتيبة، وأحمد بن عبدة الضبي، قالا حدثنا حماد بن زيد، عن غيلان بن جرير، عن عبد الله بن معبد الزماني، عن أبي قتادة، أن النبي صلى الله عليه وسلم قال ‏\"‏ صيام يوم عرفة إني أحتسب على الله أن يكفر السنة التي قبله والسنة التي بعده ‏\"‏ ‏.‏ قال وفي الباب عن أبي سعيد ‏.‏ قال أبو عيسى حديث أبي قتادة حديث حسن ‏.‏ وقد استحب أهل العلم صيام يوم عرفة إلا بعرفة ‏.‏",
      "text_en": " Abu Qatadah narrated that :                     the Prophet said: \"Fast the Day of Arafah, for indeed I anticipate that Allah will forgive (the sins) of the year after it, and the year before it.\"",
      "chain": [
        "30367",
        "30423",
        "20022",
        "11300",
        "10697",
        "391"
      ]
    },
    {
      "hadith_no": "752",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا قتيبة، وأحمد بن عبدة الضبي، قالا حدثنا حماد بن زيد، عن غيلان بن جرير، عن عبد الله بن معبد الزماني، عن أبي قتادة، أن النبي صلى الله عليه وسلم قال ‏\"‏ صيام يوم عاشوراء إني أحتسب على الله أن يكفر السنة التي قبله ‏\"‏ ‏.‏ وفي الباب عن علي ومحمد بن صيفي وسلمة بن الأكوع وهند بن أسماء وابن عباس والربيع بنت معوذ بن عفراء وعبد الرحمن بن سلمة الخزاعي عن عمه وعبد الله بن الزبير ذكروا عن رسول الله صلى الله عليه وسلم أنه حث على صيام يوم عاشوراء ‏.‏ قال أبو عيسى لا نعلم في شيء من الروايات أنه قال ‏\"‏ صيام يوم عاشوراء كفارة سنة ‏\"‏ ‏.‏ إلا في حديث أبي قتادة ‏.‏ وبحديث أبي قتادة يقول أحمد وإسحاق ‏.‏",
      "text_en": " Abu Qatadah narrated that :                     the Prophet said: \"Fast the Day of Ashura, for indeed I anticipate that Allah will forgive (the sins of) the year before it.\"",
      "chain": [
        "30367",
        "30423",
        "20022",
        "11300",
        "10697",
        "391"
      ]
    },
    {
      "hadith_no": "767",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا قتيبة، وأحمد بن عبدة الضبي، قالا حدثنا حماد بن زيد، عن غيلان بن جرير، عن عبد الله بن معبد، عن أبي قتادة، قال قيل يا رسول الله كيف بمن صام الدهر قال ‏\"‏ لا صام ولا أفطر ‏\"‏ ‏.‏ أو ‏\"‏ لم يصم ولم يفطر ‏\"‏ ‏.‏ وفي الباب عن عبد الله بن عمرو وعبد الله بن الشخير وعمران بن حصين وأبي موسى ‏.‏ قال أبو عيسى حديث أبي قتادة حديث حسن ‏.‏ وقد كره قوم من أهل العلم صيام الدهر وأجازه قوم آخرون وقالوا إنما يكون صيام الدهر إذا لم يفطر يوم الفطر ويوم الأضحى وأيام التشريق فمن أفطر هذه الأيام فقد خرج من حد الكراهية ولا يكون قد صام الدهر كله ‏.‏ هكذا روي عن مالك بن أنس وهو قول الشافعي ‏.‏ وقال أحمد وإسحاق نحوا من هذا وقالا لا يجب أن يفطر أياما غير هذه الخمسة الأيام التي نهى رسول الله صلى الله عليه وسلم عنها يوم الفطر ويوم الأضحى وأيام التشريق ‏.‏",
      "text_en": " Abu Qatadah said:                     \"It was said: 'O Messenger of Allah! What is the case of the one who fasts daily?' He said: 'He did not fast nor break (the fast).'\" Or, he said: \"He never fasted nor broke (his fast).\"",
      "chain": [
        "30367",
        "30423",
        "20022",
        "11300",
        "391"
      ]
    },
    {
      "hadith_no": "834",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا أحمد بن عبدة الضبي البصري، حدثنا يزيد بن زريع، حدثنا أيوب، حدثنا عمرو بن دينار، عن جابر بن زيد، عن ابن عباس، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ المحرم إذا لم يجد الإزار فليلبس السراويل وإذا لم يجد النعلين فليلبس الخفين ‏\"‏ ‏.‏ حدثنا قتيبة، حدثنا حماد بن زيد، عن عمرو، نحوه ‏.‏ قال وفي الباب عن ابن عمر، وجابر، ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ والعمل على هذا عند بعض أهل العلم قالوا إذا لم يجد المحرم الإزار لبس السراويل وإذا لم يجد النعلين لبس الخفين ‏.‏ وهو قول أحمد ‏.‏ وقال بعضهم على حديث ابن عمر عن النبي صلى الله عليه وسلم ‏\"‏ إذا لم يجد نعلين فليلبس الخفين وليقطعهما أسفل من الكعبين ‏\"‏ ‏.‏ وهو قول سفيان الثوري والشافعي وبه يقول مالك ‏.‏",
      "text_en": " Ibn Abbas narrated that:                     He heard the Messenger of Allah say: \"If the Muhrim cannot find an Izar, then let him wear pants, and if he cannot find sandals, them let him wear Khuff.\"",
      "chain": [
        "30423",
        "20304",
        "11015",
        "11081",
        "11271",
        "17"
      ]
    },
    {
      "hadith_no": "898",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا أحمد بن عبدة الضبي البصري، حدثنا زياد بن عبد الله، عن الحجاج، عن الحكم، عن مقسم، عن ابن عباس، قال كان رسول الله صلى الله عليه وسلم يرمي الجمار إذا زالت الشمس ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏",
      "text_en": " Ibn Abbas narrated:                     \"The Messenger of Allah stoned the Jimar when the sun had passed the zenith.\"",
      "chain": [
        "30423",
        "20381",
        "11069",
        "11725",
        "17"
      ]
    },
    {
      "hadith_no": "932",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا أحمد بن عبدة الضبي، حدثنا زياد بن عبد الله، عن يزيد بن أبي زياد، عن مجاهد، عن ابن عباس، عن النبي صلى الله عليه وسلم قال ‏\"‏ دخلت العمرة في الحج إلى يوم القيامة ‏\"‏ ‏.‏ قال وفي الباب عن سراقة بن مالك بن جعشم وجابر بن عبد الله ‏.‏ قال أبو عيسى حديث ابن عباس حديث حسن ‏.‏ ومعنى هذا الحديث أن لا بأس بالعمرة في أشهر الحج ‏.‏ وهكذا قال الشافعي وأحمد وإسحاق ‏.‏ ومعنى هذا الحديث أن أهل الجاهلية كانوا لا يعتمرون في أشهر الحج فلما جاء الإسلام رخص النبي صلى الله عليه وسلم في ذلك فقال ‏\"‏ دخلت العمرة في الحج إلى يوم القيامة ‏\"‏ ‏.‏ يعني لا بأس بالعمرة في أشهر الحج ‏.‏ وأشهر الحج شوال وذو القعدة وعشر من ذي الحجة لا ينبغي للرجل أن يهل بالحج إلا في أشهر الحج ‏.‏ وأشهر الحرم رجب وذو القعدة وذو الحجة والمحرم ‏.‏ هكذا قال غير واحد من أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم ‏.‏",
      "text_en": " Ibn Abbas narrated:                     That the Prophet said: \"Umrah has been entered into Hajj until the Day of Resurrection.\"",
      "chain": [
        "30423",
        "10844",
        "11028",
        "17"
      ]
    },
    {
      "hadith_no": "1298",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا أحمد بن عبدة الضبي، حدثنا عبد الوهاب الثقفي، حدثنا أيوب، عن عكرمة، عن ابن عباس، رضى الله عنهما أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ليس لنا مثل السوء العائد في هبته كالكلب يعود في قيئه ‏\"‏ ‏. قال وفي الباب عن ابن عمر، عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ لا يحل لأحد أن يعطي عطية فيرجع فيها إلا الوالد فيما يعطي ولده ‏\"‏ ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     That the Messenger of Allah (ﷺ) said: \"Ours is not a bad example: The one who takes back his gift is like the dog who takes back his vomit.\"[He said:] On this topic, there is the narration from Ibn 'Umar from the Prophet (ﷺ) that he said: \"It is not lawful for anyone that has given a gift to take it back, except for a father who gives something to his son.\"",
      "chain": [
        "30423",
        "20259",
        "11015",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "1458",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Legal Punishments (Al-Hudud) - كتاب الحدود عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "17",
      "text_ar": "حدثنا أحمد بن عبدة الضبي البصري، حدثنا عبد الوهاب الثقفي، حدثنا أيوب، عن عكرمة، أن عليا، حرق قوما ارتدوا عن الإسلام، فبلغ ذلك ابن عباس فقال لو كنت أنا لقتلتهم، لقول رسول الله صلى الله عليه وسلم ‏\"‏ من بدل دينه فاقتلوه ‏\"‏ ‏.‏ ولم أكن لأحرقهم لقول رسول الله صلى الله عليه وسلم ‏\"‏ لا تعذبوا بعذاب الله ‏\"‏ ‏.‏ فبلغ ذلك عليا فقال صدق ابن عباس ‏.‏ قال أبو عيسى هذا حديث صحيح حسن ‏.‏ والعمل على هذا عند أهل العلم في المرتد ‏.‏ واختلفوا في المرأة إذا ارتدت عن الإسلام فقالت طائفة من أهل العلم تقتل وهو قول الأوزاعي وأحمد وإسحاق ‏.‏ وقالت طائفة منهم تحبس ولا تقتل وهو قول سفيان الثوري وغيره من أهل الكوفة ‏.‏",
      "text_en": " Narrated 'Ikrimah:                     That 'Ali burnt some people who apostasized from Islam. This news reached Ibn 'Abbas, so he said: \"If it were me I would have killed them according to the statement of Messenger of Allah (ﷺ). The Messenger of Allah (ﷺ) said: 'Whoever changes his religion then kill him.' And I would not have burned them because the Messenger of Allah (ﷺ) said: 'Do not punish with the punishment of Allah.' So this reached 'Ali, and he said: \"Ibn 'Abbas has told the truth.\"",
      "chain": [
        "30423",
        "20259",
        "11015",
        "11023"
      ]
    },
    {
      "hadith_no": "1554",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Military Expeditions - كتاب السير عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "21",
      "text_ar": "حدثنا أحمد بن عبدة الضبي، وحميد بن مسعدة، قالا حدثنا سليم بن أخضر، عن عبيد الله بن عمر، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم قسم في النفل للفرس بسهمين وللرجل بسهم ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     \"The Messenger of Allah (ﷺ) divided the spoils as two shares for the horse and one share for the man.\"",
      "chain": [
        "30423",
        "30430",
        "20546",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1590",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Military Expeditions - كتاب السير عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "21",
      "text_ar": "حدثنا أحمد بن عبدة الضبي، حدثنا زياد بن عبد الله، حدثنا منصور بن المعتمر، عن مجاهد، عن طاوس، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم يوم فتح مكة ‏\"‏ لا هجرة بعد الفتح ولكن جهاد ونية وإذا استنفرتم فانفروا ‏\"‏ ‏.‏ قال وفي الباب عن أبي سعيد وعبد الله بن عمرو وعبد الله بن حبشي ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وقد رواه سفيان الثوري عن منصور بن المعتمر نحو هذا ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     That on the day of Conquest of Makkah, the Messenger of Allah (ﷺ) said: \"There is no Hijrah after the conquest, there is only Jihad and intention, and when you are called to go forth (for battle), then go.\"[He said:] There are narrations on this topic from Abu Sa'eed, 'Abdullah bin 'Amr, and 'Abdullah bin Hubshi.[Abu 'Eisa said:] This Hadith is Hasan Sahih. Sufyan Ath-Thawri reported it similarly from Mansur bin Al-Mu'tamir.",
      "chain": [
        "30423",
        "11067",
        "11028",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "1673",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jihad - كتاب الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "23",
      "text_ar": "حدثنا أحمد بن عبدة الضبي البصري، حدثنا سفيان بن عيينة، عن عاصم بن محمد، عن أبيه، عن ابن عمر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لو أن الناس يعلمون ما أعلم من الوحدة ما سرى راكب بليل ‏\"‏ ‏.‏ يعني وحده ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     That the Messenger of Allah (ﷺ) said: \"If the people knew what I know about being alone, then a rider would not journey at night.\" - meaning alone.",
      "chain": [
        "30423",
        "20005",
        "20163",
        "11217",
        "18"
      ]
    },
    {
      "hadith_no": "2136",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا أحمد بن عبدة الضبي، حدثنا أبو وهب، عن عبد الله بن المبارك، أنه وصف حسن الخلق فقال هو بسط الوجه وبذل المعروف وكف الأذى ‏.‏",
      "text_en": " Abu Wahb narrated that  :                     'Abdullah bin Al-Mubarak explained good character, and then he said: \"It is a smiling face, doing one's best in good, and refraining from harm.\"",
      "chain": [
        "30423",
        "20025"
      ]
    },
    {
      "hadith_no": "2158",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا أحمد بن عبدة الضبي، حدثنا حماد بن زيد، عن يحيى بن سعيد، عن أبي أمامة بن سهل بن حنيف، أن عثمان بن عفان، أشرف يوم الدار فقال أنشدكم الله أتعلمون أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يحل دم امرئ مسلم إلا بإحدى ثلاث زنا بعد إحصان أو ارتداد بعد إسلام أو قتل نفس بغير حق فقتل به ‏\"‏ ‏.‏ فوالله ما زنيت في جاهلية ولا في إسلام ولا ارتددت منذ بايعت رسول الله صلى الله عليه وسلم ولا قتلت النفس التي حرم الله فبم تقتلونني قال أبو عيسى وفي الباب عن ابن مسعود وعائشة وابن عباس ‏.‏ وهذا حديث حسن ‏.‏ ورواه حماد بن سلمة عن يحيى بن سعيد فرفعه ‏.‏ وروى يحيى بن سعيد القطان وغير واحد عن يحيى بن سعيد هذا الحديث فأوقفوه ولم يرفعوه وقد روي هذا الحديث من غير وجه عن عثمان عن النبي صلى الله عليه وسلم مرفوعا ‏.",
      "text_en": " Abu Umamah bin Sahl bin Hunaif narrated that on the day of siege, 'Uthman bin 'Affan stood overlooking the people, and he said:                     \"I swear to you by Allah! You know that the Messenger of Allah (s.a.w) said:'The blood of a Muslim man is not lawful, except for one of three (cases):Illegitimate sexual relations after Ihsan (having been married), or apostasy after Islam, or taking a life without right, for which he is killed.'\tBy Allah! I have never committed illegitimate sexual relations, not during Jahiliyyah nor during Islam, and I have not committed apostasy since I gave my pledge to the Messenger of Allah (s.a.w), and I have not taken a life that Allah had made unlawful. So for what do you fight me?\"'",
      "chain": [
        "30423",
        "20022",
        "20031",
        "405",
        "4"
      ]
    },
    {
      "hadith_no": "2722",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of Paradise - كتاب صفة الجنة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "38",
      "text_ar": "حدثنا قتيبة، وأحمد بن عبدة الضبي البصري، قالا حدثنا عبد العزيز بن محمد، عن زيد بن أسلم، عن عطاء بن يسار، عن معاذ بن جبل، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من صام رمضان وصلى الصلوات وحج البيت لا أدري أذكر الزكاة أم لا إلا كان حقا على الله أن يغفر له إن هاجر في سبيل الله أو مكث بأرضه التي ولد بها ‏\"‏ ‏.‏ قال معاذ ألا أخبر بهذا الناس فقال رسول الله صلى الله عليه وسلم ‏\"‏ ذر الناس يعملون فإن في الجنة مائة درجة ما بين كل درجتين كما بين السماء والأرض والفردوس أعلى الجنة وأوسطها وفوق ذلك عرش الرحمن ومنها تفجر أنهار الجنة فإذا سألتم الله فسلوه الفردوس ‏\"‏ ‏.‏ قال أبو عيسى هكذا روي هذا الحديث عن هشام بن سعد عن زيد بن أسلم عن عطاء بن يسار عن معاذ بن جبل وهذا عندي أصح من حديث همام عن زيد بن أسلم عن عطاء بن يسار عن عبادة بن الصامت ‏.‏ وعطاء لم يدرك معاذ بن جبل ومعاذ قديم الموت مات في خلافة عمر ‏.‏",
      "text_en": " Mu'adh bin Jabal narrated that the Messenger of Allah (s.a.w) said:                     \"Whoever fasts Ramadan, performs the Salat, performs hajj to the House\"- I do not know whether he mentioned Zakat or not- \"except tat it is binding on Allah that He forgive him, whether he emigrated in the cause of Allah, or remained in his land in which he was born.\" Mu'adh said: \"Should I not inform the people of this?\" the Messenger of Allah said, \"Leave the people to do deeds, for verily in Paradise there are a hundred levels, what is between every two levels is like what is between the heavens and the earth. Al-Firdaus is the highet of Paradise and its most expansive, and above that is the Throne of Ar-Rahman(the Most Merciful), and from it the rivers of Paradise are  made to flow forth. So when you ask Allah, ask Him for Al-Firdaus.\"",
      "chain": [
        "30367",
        "30423",
        "20167",
        "11163",
        "11020",
        "32"
      ]
    },
    {
      "hadith_no": "2730",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Seeking Permission - كتاب الاستئذان والآداب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "42",
      "text_ar": "حدثنا أحمد بن عبدة الضبي، حدثنا يحيى بن سليم الطائفي، عن سفيان، عن منصور، عن خيثمة، عن رجل، عن ابن مسعود، عن النبي صلى الله عليه وسلم قال ‏\"‏ من تمام التحية الأخذ باليد ‏\"‏ ‏.‏ وفي الباب عن البراء وابن عمر ‏.‏ قال أبو عيسى هذا حديث غريب ولا نعرفه إلا من حديث يحيى بن سليم عن سفيان ‏.‏ قال سألت محمد بن إسماعيل عن هذا الحديث فلم يعده محفوظا وقال إنما أراد عندي حديث سفيان عن منصور عن خيثمة عمن سمع ابن مسعود عن النبي صلى الله عليه وسلم قال ‏\"‏ لا سمر إلا لمصل أو مسافر ‏\"‏ ‏.‏ قال محمد وإنما يروى عن منصور عن أبي إسحاق عن عبد الرحمن بن يزيد أو غيره قال من تمام التحية الأخذ باليد ‏.‏",
      "text_en": " Narrated Ibn Mas'ud:                     that the Prophet (ﷺ) said: \"taking hold of the hand is from the completeness of the greeting.\"",
      "chain": [
        "30423",
        "20204",
        "20012",
        "11067",
        "11332",
        "16"
      ]
    },
    {
      "hadith_no": "3391",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا أحمد بن عبدة الضبي، حدثنا حماد بن زيد، عن عاصم بن بهدلة، عن أبي صالح، عن أبي الدرداء، عن النبي صلى الله عليه وسلم نحوه وليس فيه عن عطاء بن يسار ‏.‏ قال وفي الباب عن عبادة بن الصامت ‏.‏",
      "text_en": "",
      "chain": [
        "30423",
        "20022",
        "11358",
        "11161",
        "37"
      ]
    },
    {
      "hadith_no": "3410",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا أحمد بن عبدة الضبي، حدثنا حماد بن زيد، عن شعيب بن الحبحاب، عن أنس بن مالك، نحو حديث قتيبة ولم يرفعه ‏.‏",
      "text_en": "",
      "chain": [
        "30423",
        "20022",
        "11596"
      ]
    },
    {
      "hadith_no": "3418",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا أحمد بن عبدة الضبي، حدثنا معتمر بن سليمان، عن ليث بن أبي سليم، عن بشر، عن أنس بن مالك، عن النبي صلى الله عليه وسلم في قوله ‏:‏ ‏(‏ولنسألنهم أجمعين * عما كانوا يعملون ‏)‏ قال ‏\"‏ عن قول لا إله إلا الله ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب إنما نعرفه من حديث ليث بن أبي سليم ‏.‏ وقد روى عبد الله بن إدريس عن ليث بن أبي سليم عن بشر عن أنس بن مالك نحوه ولم يرفعه ‏.‏",
      "text_en": " Narrated Anas bin Malik:                     that regarding Allah's saying: We shall certainly call all of them to account. For all that they used to do (15:92 & 93). The Prophet (ﷺ) said: \"About saying La Ilaha Illallah.\"",
      "chain": [
        "30423",
        "20288",
        "10957",
        "20212",
        "19"
      ]
    },
    {
      "hadith_no": "3494",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا أحمد بن عبدة الضبي، حدثنا سليم بن أخضر، عن حاتم بن أبي صغيرة، بهذا الإسناد نحوه ‏.‏",
      "text_en": "",
      "chain": [
        "30423",
        "20546",
        "11274"
      ]
    },
    {
      "hadith_no": "3518",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا أحمد بن عبدة الضبي، حدثنا حماد بن زيد، عن ثابت، عن أنس، قال نزلت هذه الآية ‏:‏ ‏(‏وتخفي في نفسك ما الله مبديه وتخشى الناس ‏)‏ في شأن زينب بنت جحش جاء زيد يشكو فهم بطلاقها فاستأمر النبي صلى الله عليه وسلم فقال النبي صلى الله عليه وسلم ‏\"‏ أمسك عليك زوجك واتق الله ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Anas:                     \"When this Ayah was revealed: 'But you did hide in yourself that which Allah will make manifest... (33:37)' about Zainab bint Jahsh, Zaid had come to the Prophet (ﷺ) complaining, and he wanted to divorce her, so he consulted with the Prophet (ﷺ). The Prophet (ﷺ) said: 'Keep your wife to yourself, and have Taqwa of Allah (33:37).'\"",
      "chain": [
        "30423",
        "20022",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "3535",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا أحمد بن عبدة الضبي، حدثنا معتمر بن سليمان، حدثنا ليث بن أبي سليم، عن بشر، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما من داع دعا إلى شيء إلا كان موقوفا يوم القيامة لازما له لا يفارقه وإن دعا رجل رجلا ‏\"‏ ‏.‏ ثم قرأ قول الله ‏:‏ ‏(‏ وقفوهم إنهم مسئولون * ما لكم لا تناصرون ‏)‏ ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏",
      "text_en": " Narrated Anas bin Malik:                     that the Messenger of Allah (ﷺ) said: \"No caller invites to anything except that he is detained along with, on the Day of Resurrection, without parting from it, even if a man invites another man.\" Then he recited the saying of Allah, the Mighty and Sublime: 'But stop them, verily they are to be questioned. What is the matter with you? Why do you not help one another (37:24 & 25).'\"",
      "chain": [
        "30423",
        "20288",
        "10957",
        "20212",
        "19"
      ]
    },
    {
      "hadith_no": "3439",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا أحمد بن عبدة الضبي، حدثنا حماد بن زيد، عن عاصم الأحول، عن عبد الله بن سرجس، قال كان النبي صلى الله عليه وسلم إذا سافر يقول ‏\"‏ اللهم أنت الصاحب في السفر والخليفة في الأهل اللهم اصحبنا في سفرنا واخلفنا في أهلنا اللهم إني أعوذ بك من وعثاء السفر وكآبة المنقلب ومن الحور بعد الكون ومن دعوة المظلوم ومن سوء المنظر في الأهل والمال ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح ‏.‏ قال ويروى الحور بعد الكور أيضا قال ومعنى قوله الحور بعد الكون أو الكور وكلاهما له وجه يقال إنما هو الرجوع من الإيمان إلى الكفر أو من الطاعة إلى المعصية إنما يعني الرجوع من شيء إلى شيء من الشر ‏.‏",
      "text_en": " Abdullah bin Sarjis narrated that:                     When the Prophet wanted to travel, he would say: “O Allah, You are the companion on the journey, and the caretaker for the family, O Allah, accompany us in our journey, and watch over our families, O Allah, I seek refuge in You from the difficulties of the journey, and from returning in great sadness, and from loss after increase, and from the supplication of the oppressed, and from someone looking with evil at our families and wealth (Allahumma Antas-Sahibu Fis-Safari Wal-Khalifatu Fil-Ahli Allahumma Ashabna Fi Safarina Wakhlufna Fi Ahlina. Allahumma Inni A’udhu Bika Min Wa’tha’is-Safari Wa Ka’abatil-Munqalab, Wa Minal-Hawri Ba’dal-Kawri, Wa Min Da’watil-Mazlum, Wa Min Su’il-Manzari Fil-Ahli Wal-Mal).”",
      "chain": [
        "30423",
        "20022",
        "11080",
        "3245"
      ]
    },
    {
      "hadith_no": "3536",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا أحمد بن عبدة الضبي، حدثنا حماد بن زيد، عن عاصم، عن زر بن حبيش، قال أتيت صفوان بن عسال المرادي فقال لي ما جاء بك قلت ابتغاء العلم ‏.‏ قال بلغني أن الملائكة تضع أجنحتها لطالب العلم رضا بما يفعل ‏.‏ قال قلت إنه حاك أو قال حك في نفسي شيء من المسح على الخفين فهل حفظت من رسول الله صلى الله عليه وسلم فيه شيئا قال نعم كنا إذا كنا سفرا أو مسافرين أمرنا أن لا نخلع خفافنا ثلاثا إلا من جنابة ولكن من غائط وبول ونوم ‏.‏ قال فقلت فهل حفظت من رسول الله صلى الله عليه وسلم في الهوى شيئا قال نعم كنا مع رسول الله صلى الله عليه وسلم في بعض أسفاره فناداه رجل كان في آخر القوم بصوت جهوري أعرابي جلف جاف فقال يا محمد يا محمد ‏.‏ فقال له القوم مه إنك قد نهيت عن هذا ‏.‏ فأجابه رسول الله صلى الله عليه وسلم نحوا من صوته هاؤم فقال الرجل يحب القوم ولما يلحق بهم ‏.‏ قال فقال رسول الله صلى الله عليه وسلم ‏\"‏ المرء مع من أحب ‏\"‏ ‏.‏ قال زر فما برح يحدثني حتى حدثني أن الله جعل بالمغرب بابا عرضه مسيرة سبعين عاما للتوبة لا يغلق حتى تطلع الشمس من قبله وذلك قول الله عز وجل ‏:‏ ‏(‏ يوم يأتي بعض آيات ربك لا ينفع نفسا إيمانها ‏)‏ الآية ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Zirr bin Hubaish said:                     “I came to Safwan bin Assal Al-Muradi so he said to me: ‘What has brought you, O Zirr?’ So I said: ‘The desire for knowledge.’ So he said: ‘It has been conveyed to me that the angels lower their wings for the seeker of knowledge, out of pleasure with what he is doing.’” He said: “So I said to him: ‘Indeed there is something wavering’” - or - “some doubt in my chest concerning wiping over the Khuff after defecation. So have you retained anything from the Messenger of Allah concerning that?’ He said: ‘Yes, when we were travelers, he (ﷺ) used to order us not to remove our Khuff for three days and nights, except from sexual impurity, but not from defecation, urination, and sleep.’”He said: “So I said: ‘So have you memorized anything from the Messenger of Allah concerning love?’ He said: ‘Yes, we were in one of our journeys with the Messenger of Allah when a man, a harsh, foolish Bedouin, who had been at the end of the group, called him with a loud voice, saying:”O Muhammad! O Muhammad!” So the people said to him “Mah! Indeed, you have been prohibited from this.” So the Messenger of Allah responded to him with similar to his voice: “Come.” So he said: “A man loves a people but he has not reached them?’” He said: ‘So the Messenger of Allah said: “A man is with whomever he loves.”Zirr said: “He did not cease reporting to me until he had reported that Allah, the Mighty and Sublime, has appointed a gate in the west - its width is the distance of a seventy-year journey - for repentance: it shall not be locked until the sun rises from its direction, and that is the Statement of Allah, Blessed be He and Most High, of the Ayah: The Day some of the signs of your Lord come, no soul shall be benefited by its believing.”",
      "chain": [
        "30423",
        "20022",
        "11080",
        "11337"
      ]
    },
    {
      "hadith_no": "4075",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا أحمد بن عبدة الضبي، حدثنا حماد بن زيد، عن أيوب، عن أبي عثمان النهدي، عن أبي موسى الأشعري، قال انطلقت مع النبي صلى الله عليه وسلم فدخل حائطا للأنصار فقضى حاجته فقال لي ‏\"‏ يا أبا موسى أملك على الباب فلا يدخلن على أحد إلا بإذن ‏\"‏ ‏.‏ فجاء رجل يضرب الباب فقلت من هذا فقال أبو بكر ‏.‏ فقلت يا رسول الله هذا أبو بكر يستأذن ‏.‏ قال ‏\"‏ ائذن له وبشره بالجنة ‏\"‏ ‏.‏ فدخل وبشرته بالجنة وجاء رجل آخر فضرب الباب فقلت من هذا فقال عمر ‏.‏ فقلت يا رسول الله هذا عمر يستأذن ‏.‏ قال ‏\"‏ افتح له وبشره بالجنة ‏\"‏ ‏.‏ ففتحت الباب ودخل وبشرته بالجنة فجاء رجل آخر فضرب الباب فقلت من هذا قال عثمان ‏.‏ فقلت يا رسول الله هذا عثمان يستأذن ‏.‏ قال ‏\"‏ افتح له وبشره بالجنة على بلوى تصيبه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وقد روي من غير وجه عن أبي عثمان النهدي ‏.‏ وفي الباب عن جابر وابن عمر ‏.‏",
      "text_en": " Narrated Abu Musa Al-Ash'ari:                     \"I went with the Prophet (ﷺ) and he entered a garden of the Ansar, and he relieved himself. He said to me: 'O Abu Musa! Watch the gate for me, and do not let anyone enter except with permission.' Then a man came and knocked at the gate, so I said: 'Who is it?' He said: 'Abu Bakr.' So I said: 'O Messenger of Allah (ﷺ)! It is Abu Bakr asking permission?' He said: 'Give him permission and give him the glad tidings of Paradise.' So he entered, and I gave him the glad tidings of Paradise. Another man came and knocked at the gate. I said: 'Who is it?' He said: \"'Umar.' So I said: 'O Messenger of Allah (ﷺ)! It is 'Umar asking permission?' He said: 'Open it for him, and give him the glad tidings of Paradise.' I opened [the gate], he entered, and I gave him the glad tidings of Paradise. Then another man knocked at the gate. I said: 'Who is it?' So he said: ''Uthman.' I said: 'O Messenger of Allah! It is 'Uthman asking permission.' He said: 'Open it for him, and give him the glad tidings of Paradise due to a calamity that will befall him.'\"",
      "chain": [
        "30423",
        "20022",
        "11015",
        "11113",
        "41"
      ]
    },
    {
      "hadith_no": "4264",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا أحمد بن عبدة الضبي، حدثنا المعتمر بن سليمان، عن حميد، عن أنس، رضى الله عنه قال قيل يا رسول الله من أحب الناس إليك قال ‏\"‏ عائشة ‏\"‏ ‏.‏ قيل من الرجال قال ‏\"‏ أبوها ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح غريب من هذا الوجه من حديث أنس ‏.‏",
      "text_en": " Narrated Anas [May Allah be pleased with him]:                     \"It was said: 'O Messenger of Allah! Who is the most beloved of the people to you?' He said: ''Aishah.' It was said: 'From the men?' He said: 'Her father.'\"",
      "chain": [
        "30423",
        "20288",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "3",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا أحمد بن عبدة، قال حدثنا حماد بن زيد، قال أخبرنا غيلان بن جرير، عن أبي بردة، عن أبي موسى، قال دخلت على رسول الله صلى الله عليه وسلم وهو يستن وطرف السواك على لسانه وهو يقول ‏\"‏ عأعأ ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Musa said:                      \"I came to the Messenger of Allah (ﷺ) when he was using the Siwak, and the end of the Siwak was on his toungue, and he was saying, \"'A','a'.\"",
      "chain": [
        "30423",
        "20022",
        "11300",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "793",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا أحمد بن عبدة، عن حماد بن زيد، ثم ذكر كلمة معناها قال حدثنا أبو حازم، قال سهل بن سعد كان قتال بين بني عمرو بن عوف فبلغ ذلك النبي صلى الله عليه وسلم فصلى الظهر ثم أتاهم ليصلح بينهم ثم قال لبلال ‏\"‏ يا بلال إذا حضر العصر ولم آت فمر أبا بكر فليصل بالناس ‏\"‏ ‏.‏ فلما حضرت أذن بلال ثم أقام فقال لأبي بكر رضى الله عنه تقدم ‏.‏ فتقدم أبو بكر فدخل في الصلاة ثم جاء رسول الله صلى الله عليه وسلم فجعل يشق الناس حتى قام خلف أبي بكر وصفح القوم وكان أبو بكر إذا دخل في الصلاة لم يلتفت فلما رأى أبو بكر التصفيح لا يمسك عنه التفت فأومأ إليه رسول الله صلى الله عليه وسلم بيده فحمد الله عز وجل على قول رسول الله صلى الله عليه وسلم له امضه ثم مشى أبو بكر القهقرى على عقبيه فتأخر فلما رأى ذلك رسول الله صلى الله عليه وسلم تقدم فصلى بالناس فلما قضى صلاته قال ‏\"‏ يا أبا بكر ما منعك إذ أومأت إليك أن لا تكون مضيت ‏\"‏ ‏.‏ فقال لم يكن لابن أبي قحافة أن يؤم رسول الله صلى الله عليه وسلم ‏.‏ وقال للناس ‏\"‏ إذا نابكم شىء فليسبح الرجال وليصفح النساء ‏\"‏ ‏.‏",
      "text_en": " Sahl bin Sa'd said:                      \"There was some fighting among Banu 'Amr bin 'Ad, and news of that reached the Prophet (ﷺ). He prayed Zuhr, then he went to them to reconcile between them. Then he said to Bilal: '0 Bilal, if the time for Asr comes and I have not come back, then tell Abu Bakr to lead the people in prayer.' When thetime (for Asr) came, Bilil called the A&Bn, then the Iqimh, then he said to Abu Bakr: 'Go forward. So Abu Bakr went forward and started to pray. Then the Messenger of Allah (ﷺ) came and started passing through the rows of people until he stood behind Abu Bakr, and the people clapped. Abu Bakr was such that whenever he started praying, he would never glance sideways, but when he noticed that the clapping persisted he turned around. The Messenger of Allah(ﷺ) gestured to him to carry on praying. Abu Bakr praised Allah the Mighty and Sublime for the Messenger of Allah (ﷺ) having told him to continue. Then Abu Bakr moved backward on his heels, and when the Messenger of Allah(ﷺ) saw that, he came foiward and led the people in prayer. When he completed the prayer he said: '0Abu Bakr, when I gestured to you, what kept you from continuing (to lead the people)?' He said: 'It does not befit the son of Abu Quhafah to lead the Messenger of Alliah (ﷺ) in prayer.' And he (the Prophet) said to the people: 'If you notice something (during the prayer), men should say Subhan Allah and women should clap.\"'",
      "chain": [
        "30423",
        "20022",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "2487",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا أحمد بن عبدة، قال حدثنا حماد، عن يحيى بن سعيد، وعبيد الله بن عمر، عن عمرو بن يحيى، عن أبيه، عن أبي سعيد الخدري، عن النبي صلى الله عليه وسلم قال ‏\"‏ ليس فيما دون خمس أواق صدقة ولا فيما دون خمس ذود صدقة وليس فيما دون خمسة أوسق صدقة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Sa'eed  Al_khudri that the Prophet said:                     \"No sadaqah is due on less than five Awaq, no Sadaqah is due on less than five Dhawd, no Sadaqah is due on less than  five Awsuq.\"",
      "chain": [
        "30423",
        "20022",
        "20031",
        "11201",
        "11210",
        "11232",
        "38"
      ]
    },
    {
      "hadith_no": "2751",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا أحمد بن عبدة، قال حدثنا حماد بن زيد، عن أبان بن تغلب، عن أبي إسحاق، عن عبد الرحمن بن يزيد، عن عبد الله بن مسعود، قال كان من تلبية النبي صلى الله عليه وسلم ‏\"‏ لبيك اللهم لبيك لبيك لا شريك لك لبيك إن الحمد والنعمة لك ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Masud said:                     \"Part of the Talbiyah of the Messenger of Allah was 'Labbaika Allahumma labbbaik, Labbaika la sharika laka labbaik, Innal-hamda wan-ni'mata laka wal-mulk, (Here I am, O Allah, here I am. Here I am, You have no partner, here I am. Verily all praise and blessings are Yours)\"",
      "chain": [
        "30423",
        "20022",
        "20577",
        "11049",
        "11055",
        "16"
      ]
    },
    {
      "hadith_no": "2891",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا أحمد بن عبدة، قال أنبأنا حماد، قال حدثنا هشام، - وهو ابن عروة - عن أبيه، عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ خمس فواسق يقتلن في الحرم العقرب والفأرة والغراب والكلب العقور والحدأة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Aishah said:                     \"The Messenger of Allah said: 'There are five kinds of vermin that may be killed in the Haram: Scorpions, mice, crows, vicious dogs, and kites.\" (Sahih)Chaper 120. The Prohibition Of Disturbing The Game Of The Haram",
      "chain": [
        "30423",
        "20022",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "4123",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا أحمد بن عبدة، عن حماد، عن أيوب، ويونس، والعلاء بن زياد، عن الحسن، عن الأحنف بن قيس، عن أبي بكرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا التقى المسلمان بسيفيهما فقتل أحدهما صاحبه فالقاتل والمقتول في النار ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Bakrah said:                     \"The Messenger of Allah [SAW] said: 'If two Muslims fight with swords, and one of them kills the other, then the killer and the slain will both be in Hell.'\"",
      "chain": [
        "30423",
        "20022",
        "11015",
        "20475",
        "14303",
        "11016",
        "11112",
        "3229"
      ]
    },
    {
      "hadith_no": "4327",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا قتيبة، وأحمد بن عبدة، قالا حدثنا حماد، عن عمرو، - وهو ابن دينار - عن محمد بن علي، عن جابر، قال نهى - وذكر رسول الله صلى الله عليه وسلم - يوم خيبر عن لحوم الحمر وأذن في الخيل ‏.‏",
      "text_en": " It was narrated that Jabir said:                     \"On the Day of Khaibar, the Messenger of Allah forbade the flesh of donkeys but he permitted the flesh of horses.\"",
      "chain": [
        "30367",
        "30423",
        "20022",
        "11081",
        "11442",
        "34"
      ]
    },
    {
      "hadith_no": "4713",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا أحمد بن عبدة، قال أنبأنا حماد، قال حدثنا يحيى بن سعيد، عن بشير بن يسار، عن سهل بن أبي حثمة، ورافع بن خديج، أنهما حدثاه أن محيصة بن مسعود وعبد الله بن سهل أتيا خيبر في حاجة لهما فتفرقا في النخل فقتل عبد الله بن سهل فجاء أخوه عبد الرحمن بن سهل وحويصة ومحيصة ابنا عمه إلى رسول الله صلى الله عليه وسلم فتكلم عبد الرحمن في أمر أخيه - وهو أصغر منهم - فقال رسول الله صلى الله عليه وسلم ‏\"‏ الكبر ليبدأ الأكبر ‏\"‏ ‏.‏ فتكلما في أمر صاحبهما فقال رسول الله صلى الله عليه وسلم وذكر كلمة معناها ‏\"‏ يقسم خمسون منكم ‏\"‏ ‏.‏ فقالوا يا رسول الله أمر لم نشهده كيف نحلف قال ‏\"‏ فتبرئكم يهود بأيمان خمسين منهم ‏\"‏ ‏.‏ قالوا يا رسول الله قوم كفار ‏.‏ فوداه رسول الله صلى الله عليه وسلم من قبله ‏.‏ قال سهل فدخلت مربدا لهم فركضتني ناقة من تلك الإبل ‏.‏",
      "text_en": " It was narrated from Sahl bin Ab Hathmah and Rafi bin Khadij that:                     Muhayysah bin Mas'ud and 'Abdullah bin Sahl went to Khaibar for some need they had there, and they parted among the palm trees. 'Abdullah bin Sahl was killed, and 'Abdullah bin Sahl was killed, and his brother 'Abdur-Rahman bin Shl, and Huwayysah, and Musayysah, his paternal cousins, came to the Messenger of Allah. 'Abdur-Rahan spoke about his brother's case, but he was the youngest of them, so the Messenger of Allah said: \"Let the elders speak first.\" So they spoke about their companions, and the Messenger of Allah said: Let fifty of your swear an oath.\" The said: \"O Messenger of Allah, it is something that we did not witness: how can we swear an oath?\" He said: \"Then let the Jews swear fifty oaths to their innocence.\" They said: \"O Messenger of Allah, they area) a disbelieving people,\" So the Messenger of Allah paid the blood money himself Sahl said: \"I entered a Mirbad of theirs, and one of those camels kicked me.\"",
      "chain": [
        "30423",
        "20022",
        "20031",
        "11810",
        "1822",
        "1986"
      ]
    },
    {
      "hadith_no": "5228",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا أحمد بن عبدة، قال أنبأنا حماد، قال حدثنا عبيد الله، عن نافع، عن ابن عمر، أن النبي صلى الله عليه وسلم نهى عن القزع ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that:                     The Prophet [SAW] forbade Al-Qaza' (shaving part of the head and leaving part).",
      "chain": [
        "30423",
        "20022",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "29",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا أحمد بن عبدة، حدثنا حماد بن زيد، عن مجالد، عن الشعبي، عن قرظة بن كعب، قال بعثنا عمر بن الخطاب إلى الكوفة وشيعنا فمشى معنا إلى موضع يقال له صرار ‏.‏ فقال أتدرون لم مشيت معكم قال قلنا لحق صحبة رسول الله  صلى الله عليه وسلم  ولحق الأنصار ‏.‏ قال لكني مشيت معكم لحديث أردت أن أحدثكم به فأردت أن تحفظوه لممشاى معكم إنكم تقدمون على قوم للقرآن في صدورهم هزيز كهزيز المرجل فإذا رأوكم مدوا إليكم أعناقهم وقالوا أصحاب محمد ‏.‏ فأقلوا الرواية عن رسول الله  صلى الله عليه وسلم  وأنا شريككم ‏.‏",
      "text_en": " It was narrated that Qarazah bin Ka'b said:                     \"Umar bin Al-Khattab sent us to Kufah, and he accompanied us as far as a place called Sirar. He said: 'Do you know why I walked with you?' We said: 'Because of the rights of the Messenger of Allah (ﷺ) and because of the rights of the Ansar.' He said: 'No, rather it is because of words that I wanted to say to you. I wanted you to memorize it due to my walking with you. You are going to people in whose hearts the Qur'an bubbles like water in a copper cauldron. When they see you, they will look up at you, saying: \"The Companions of Muhammad!\" But do not recite many reports from the Messenger of Allah (ﷺ), then I will be your partner.\"",
      "chain": [
        "30423",
        "20022",
        "10820",
        "11052",
        "5237"
      ]
    },
    {
      "hadith_no": "106",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا أحمد بن عبدة، والحسين بن الحسن المروزي، قالا حدثنا المعتمر بن سليمان، عن حميد، عن أنس، قال قيل يا رسول الله أى الناس أحب إليك قال ‏\"‏ عائشة ‏\"‏ ‏.‏ قيل من الرجال قال ‏\"‏ أبوها ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Anas said:                     \"It was said: 'O Messenger of Allah, which of the people is most beloved to you?' He said: \"Aishah.' It was asked, 'And among men?' He said: 'Her father.'\"",
      "chain": [
        "30423",
        "20288",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "147",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا أحمد بن عبدة، حدثنا سفيان بن عيينة، عن عبيد الله بن أبي يزيد، عن نافع بن جبير، عن أبي هريرة، أن النبي  صلى الله عليه وسلم  قال للحسن ‏\"‏ اللهم إني أحبه فأحبه وأحب من يحبه ‏\"‏ ‏.‏ قال وضمه إلى صدره ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     The Prophet said to Hasan: \"O Allah, I love him, so love him and love those who love him.\" He said: \"And he hugged him to his chest.\"",
      "chain": [
        "30423",
        "20005",
        "11258",
        "11059",
        "13"
      ]
    },
    {
      "hadith_no": "241",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا أحمد بن عبدة، أنبأنا عبد العزيز بن محمد الدراوردي، حدثني قدامة بن موسى، عن محمد بن الحصين التميمي، عن أبي علقمة، مولى ابن عباس عن يسار، مولى ابن عمر عن ابن عمر، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ ليبلغ شاهدكم غائبكم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that:                     The Messenger of Allah said: \"Let those of you who are present convey it to those of you who are absent.\"",
      "chain": [
        "30423",
        "20167",
        "10610",
        "13429",
        "18"
      ]
    },
    {
      "hadith_no": "440",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن عبدة، حدثنا حماد بن زيد، عن منصور، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو الأحوص، عن منصور، عن هلال بن يساف، عن سلمة بن قيس، قال قال لي رسول الله  صلى الله عليه وسلم  ‏\"‏ إذا توضأت فانثر وإذا استجمرت فأوتر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Salamah bin Qais said to me:                     The Messenger of Allah said to me: 'When you perform ablution, clean your nose, and when you use pebbles to clean yourself after defecating, use an odd number.'\"",
      "chain": [
        "30423",
        "20022",
        "11067",
        "30201",
        "20327",
        "11067",
        "10835",
        "5070"
      ]
    },
    {
      "hadith_no": "461",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن عبدة، حدثنا حماد بن زيد، حدثنا موسى بن سالم أبو جهضم، حدثنا عبد الله بن عبيد الله بن عباس، عن ابن عباس، قال أمرنا رسول الله  صلى الله عليه وسلم  بإسباغ الوضوء ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"The Messenger of Allah commanded us to perform ablution properly.\"",
      "chain": [
        "30423",
        "20022",
        "17"
      ]
    },
    {
      "hadith_no": "571",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن عبدة، أنبأنا حماد بن زيد، حدثنا ثابت، عن أنس، أن أعرابيا، بال في المسجد فوثب إليه بعض القوم فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا تزرموه ‏\"‏ ‏.‏ ثم دعا بدلو من ماء فصب عليه ‏.‏",
      "text_en": " It was narrated from Anas bin Malik that:                     A Bedouin urinated in the mosque, and some of the people rushed at him. The Messenger of Allah said: \"Do not interrupt him.\" Then he called for a bucket of water and poured it over (the urine).",
      "chain": [
        "30423",
        "20022",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "684",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Prayer - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن عبدة، حدثنا حماد بن زيد، عن عاصم بن بهدلة، عن زر بن حبيش، عن علي بن أبي طالب، أن رسول الله  صلى الله عليه وسلم  قال يوم الخندق ‏\"‏ ملأ الله بيوتهم وقبورهم نارا كما شغلونا عن الصلاة الوسطى ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Ali bin Abu Talib that,:                     On the Day of Khandaq, the Messenger of Allah said: \"May Allah fill their houses and graves with fire, just as they distracted us from the middle prayer.\"",
      "chain": [
        "30423",
        "20022",
        "11358",
        "11337",
        "5"
      ]
    },
    {
      "hadith_no": "698",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Prayer - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن عبدة، حدثنا حماد بن زيد، عن ثابت، عن عبد الله بن رباح، عن أبي قتادة، قال ذكروا تفريطهم في النوم فقال ناموا حتى طلعت الشمس ‏.‏ فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ ليس في النوم تفريط إنما التفريط في اليقظة فإذا نسي أحدكم صلاة أو نام عنها فليصلها إذا ذكرها ولوقتها من الغد ‏\"‏ ‏.‏ قال عبد الله بن رباح فسمعني عمران بن الحصين، وأنا أحدث، بالحديث فقال يا فتى انظر كيف تحدث فإني شاهد للحديث مع رسول الله  صلى الله عليه وسلم  ‏.‏ قال فما أنكر من حديثه شيئا ‏.‏",
      "text_en": " 'Abdullah bin Rabah narrated that Abu Qatadah said:                     \"They mentioned negligence because of sleeping too much, and he said: 'They slept until the sun had risen. The Messenger of Allah said: \"There is no negligence when oneis sleeping, rather there is negligence when one is awake. If anyone of you forgets to pray, or sleeps and misses a prayer, then let him pray when he remembers, and during its time if it is a day after. (Sahih)'Abdullah bin Rabah said: \"Imran bin Husain heard me when I was narrating this Hadith and said: 'O young man, look at how you are narrating the Hadith. I was present at the time of this Hadith with the Messenger of Allah.' And he did not deny anything of the Hadith.\"",
      "chain": [
        "30423",
        "20022",
        "11269",
        "11865",
        "391"
      ]
    },
    {
      "hadith_no": "783",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book On The Mosques And The Congregations - كتاب المساجد والجماعات",
      "chapter_no": "4",
      "text_ar": "حدثنا أحمد بن عبدة، حدثنا عباد بن عباد المهلبي، حدثنا عاصم الأحول، عن أبي عثمان النهدي، عن أبى بن كعب، قال كان رجل من الأنصار بيته أقصى بيت بالمدينة وكان لا تخطئه الصلاة مع رسول الله  صلى الله عليه وسلم  ‏.‏ قال فتوجعت له فقلت يا فلان لو أنك اشتريت حمارا يقيك الرمض ويرفعك من الوقع ويقيك هوام الأرض ‏.‏ فقال والله ما أحب أن بيتي بطنب بيت محمد  صلى الله عليه وسلم  ‏.‏ قال فحملت به حملا حتى أتيت بيت النبي  صلى الله عليه وسلم  فذكرت ذلك له فدعاه فسأله فذكر له مثل ذلك وذكر أنه يرجو في أثره فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن لك ما احتسبت ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ubayy bin Ka'b said:                     \"There was a man among the Ansar whose house was the furthest house in Al-Madinah, yet he never missed prayer with the Messenger of Allah. I felt sorry for him and said: 'O so-and-so, why do you not buy a donkey to spare yourself the heat of the scorching sand, to carry over the stony ground, and to keep you away from the vermin on the ground?' He said: 'By Allah! I do not want to live so close to Muhammed.' This troubled me until I came to the house of the Prophet and mentioned that to him. He called (the man) and asked him, and he said something similar, and said that he was hoping for the reward for his steps. The Messenger of Allah said, 'You will have that (reward) that you sought.'\"",
      "chain": [
        "30423",
        "20243",
        "11080",
        "11113",
        "39"
      ]
    },
    {
      "hadith_no": "992",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أحمد بن عبدة، حدثنا عباد بن عباد المهلبي، حدثنا عاصم الأحول، عن عبد الله بن الحارث بن نوفل، أن ابن عباس، أمر المؤذن أن يؤذن، يوم الجمعة وذلك يوم مطير فقال الله أكبر الله أكبر أشهد أن لا إله إلا الله أشهد أن محمدا رسول الله ‏.‏ ثم قال ناد في الناس فليصلوا في بيوتهم ‏.‏ فقال له الناس ما هذا الذي صنعت قال قد فعل هذا من هو خير مني تأمرني أن أخرج الناس من بيوتهم فيأتوني يدوسون الطين إلى ركبهم ‏.‏",
      "text_en": " It wasnarrated from ‘Abdullah bin Harith bin Nawfal that Ibn ‘Abbascommanded the Mu’adh-dhin to call the Adhan one Friday, which was arainy day. He said:                      “Allahu Akbar, Allahu Akbar, Ashhadu an lailahaillallah, Ashhadu anna Muhammadan Rasulullah (Allah is the MostGreat,Allah is Most Great, I bear witness that none has the right tobeworshipped but Allah, I bear witness that Muhammad is theMessenger ofAllah).” Then he (Ibn ‘Abbas) said: “Proclaim tothe people that theyshould pray in their houses.” The people saidto him: “What is thisthat you have done?” He said: “One who isbetter than me did that. Areyou telling me that I should bring thepeople out of their houses andmake them come to me wading throughthe mud up to their knees?”",
      "chain": [
        "30423",
        "20243",
        "11080",
        "912"
      ]
    },
    {
      "hadith_no": "1006",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أحمد بن عبدة، أنبأنا حماد بن زيد، حدثنا يحيى أبو المعلى، عن الحسن العرني، قال ذكر عند ابن عباس ما يقطع الصلاة فذكروا الكلب والحمار والمرأة فقال ما تقولون في الجدى إن رسول الله  صلى الله عليه وسلم  كان يصلي يوما فذهب جدى يمر بين يديه فبادره رسول الله  صلى الله عليه وسلم  القبلة ‏.‏",
      "text_en": " It wasnarrated that Hasan Al-‘Urani said:                      ‘Mention was made in thepresence of Ibn ‘Abbas about what severs the prayer. They mentionedadog, a donkey and a woman. He said: ‘What do you say about kids(younggoats)? The Messenger of Allah (ﷺ) was performing prayer oneday,when a kid came and wanted to pass in front of him. TheMessenger ofAllah (ﷺ) preceded it toward the Qiblah. (to tightenthe space andprevent it from passing in front of him).’”",
      "chain": [
        "30423",
        "20022",
        "11623"
      ]
    },
    {
      "hadith_no": "1038",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أحمد بن عبدة، وحميد بن مسعدة، قالا حدثنا حماد بن زيد، أنبأنا عبد العزيز بن صهيب، عن أنس بن مالك، قال كان رسول الله  صلى الله عليه وسلم  يوجز ويتم الصلاة ‏.‏",
      "text_en": " It wasnarrated that Anas bin Malik said:                      “The Messenger of Allah(ﷺ)used to make his prayer brief but perfect.”",
      "chain": [
        "30423",
        "30430",
        "20022",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "1053",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أحمد بن عبدة، حدثنا عبد العزيز بن محمد، عن العلاء، عن أبيه، عن أبي هريرة، وعن سهيل، عن أبيه، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ خير صفوف النساء آخرها وشرها أولها وخير صفوف الرجال أولها وشرها آخرها ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Hurairah said:                      “The Messenger of Allah (ﷺ)said: ‘The best rows for women are the back rows, and the worst arethe front rows, and the best rows for men are the front rows, and theworst are the back rows.’”",
      "chain": [
        "30423",
        "20167",
        "10606",
        "11884",
        "13",
        "13"
      ]
    },
    {
      "hadith_no": "1120",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أحمد بن عبدة، أنبأنا حماد بن زيد، عن بشر بن حرب، عن ابن عمر، قال كان رسول الله  صلى الله عليه وسلم  إذا خرج من هذه المدينة لم يزد على ركعتين حتى يرجع إليها ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Umar said:                      “When the Messenger of Allah(ﷺ)went out from this city (Al-Madinah) he did not perform morethan twoRak’ah for prayer until he returned.”",
      "chain": [
        "30423",
        "20022",
        "14035",
        "18"
      ]
    },
    {
      "hadith_no": "1156",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أحمد بن عبدة، حدثنا المعتمر بن سليمان، حدثنا حميد، عن أنس، قال كنا نجمع ثم نرجع فنقيل ‏.‏",
      "text_en": " It wasnarrated that Anas said:                      “We used to perform the Friday(prayer),then we would return for a nap (Qailulah).”",
      "chain": [
        "30423",
        "20288",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "1198",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أحمد بن عبدة، أنبأنا حماد بن زيد، عن أنس بن سيرين، عن ابن عمر، قال كان رسول الله  صلى الله عليه وسلم  يصلي الركعتين قبل الغداة كأن الأذان بأذنيه ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Umar said:                      “The Messenger of Allah (ﷺ)usedto pray two Rak’ah before the morning (prayer), as if the Adhanwere in his ears. (i.e., he would pray them briefly).",
      "chain": [
        "30423",
        "20022",
        "11038",
        "18"
      ]
    },
    {
      "hadith_no": "1230",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أحمد بن عبدة، حدثنا حماد بن زيد، عن أنس بن سيرين، عن ابن عمر، قال كان رسول الله  صلى الله عليه وسلم  يصلي من الليل مثنى مثنى ويوتر بركعة ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Umar said:                      “The Messenger of Allah (ﷺ)usedto pray (voluntary prayers) at night two by two, and he wouldprayone Rak’ah of Witr.”",
      "chain": [
        "30423",
        "20022",
        "11038",
        "18"
      ]
    },
    {
      "hadith_no": "1318",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أحمد بن عبدة، حدثنا عبد الوارث بن سعيد، حدثنا أيوب، عن أبي الزبير، عن جابر بن عبد الله، أن النبي  صلى الله عليه وسلم  صلى بأصحابه صلاة الخوف فركع بهم جميعا ثم سجد رسول الله  صلى الله عليه وسلم  والصف الذين يلونه والآخرون قيام حتى إذا نهض سجد أولئك بأنفسهم سجدتين ثم تأخر الصف المقدم حتى قاموا مقام أولئك وتخلل أولئك حتى قاموا مقام الصف المقدم فركع بهم النبي  صلى الله عليه وسلم  جميعا ثم سجد رسول الله  صلى الله عليه وسلم  والصف الذي يلونه فلما رفعوا رءوسهم سجد أولئك سجدتين فكلهم قد ركع مع النبي  صلى الله عليه وسلم  وسجدت طائفة بأنفسهم سجدتين وكان العدو مما يلي القبلة ‏.‏",
      "text_en": " It wasnarrated from Jabir bin ‘Abdullah that the Prophet (ﷺ) ledhisCompanions in the fear prayer. He led them all in bowing, then theMessenger of Allah (ﷺ) and the row nearest him prostrated, and theothers stood up, then when he stood up, they prostrated twice bythemselves. Then the front row moved back and took their place, andthey moved forward until they formed the front row. Then the Prophet(ﷺ) led them all in bowing, then the Messenger of Allah (ﷺ) andthe row nearest to him prostrated, and when they raised their heads,the others prostrated twice. So all of them bowed with the Prophet(ﷺ) and some of them prostrated by themselves, and the enemy was inthe direction of the Qiblah.",
      "chain": [
        "30423",
        "20258",
        "11015",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "1379",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أحمد بن عبدة، أنبأنا حماد بن زيد، عن أنس بن سيرين، عن ابن عمر، قال كان رسول الله  صلى الله عليه وسلم  يصلي من الليل مثنى مثنى ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Umar said:                      “The Messenger of Allah (ﷺ)usedto offer the night prayers two by two.”",
      "chain": [
        "30423",
        "20022",
        "11038",
        "18"
      ]
    },
    {
      "hadith_no": "1551",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا أحمد بن عبدة، أنبأنا عبد الواحد بن زياد، عن يحيى بن عبد الله التيمي، عن أبي ماجدة الحنفي، عن عبد الله بن مسعود، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ الجنازة متبوعة وليست بتابعة ليس منها من تقدمها ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Abdullah bin Mas’ud that the Messenger of Allah(ﷺ) said:                      ‘The funeral should be followed and should not follow.There should be no one with it who walks ahead of it.”",
      "chain": [
        "30423",
        "20256",
        "23072",
        "16"
      ]
    },
    {
      "hadith_no": "1552",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا أحمد بن عبدة، أخبرني عمرو بن النعمان، حدثنا علي بن الحزور، عن نفيع، عن عمران بن الحصين، وأبي، برزة قالا خرجنا مع رسول الله  صلى الله عليه وسلم  في جنازة فرأى قوما قد طرحوا أرديتهم يمشون في قمص فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ أبفعل الجاهلية تأخذون - أو بصنع الجاهلية تشبهون - لقد هممت أن أدعو عليكم دعوة ترجعون في غير صوركم ‏\"‏ ‏.‏ قال فأخذوا أرديتهم ولم يعودوا لذلك ‏.‏",
      "text_en": " It wasnarrated that ‘Imran bin Husain and Abu Barzah said:                      “We wentoutwith the Messenger of Allah (ﷺ) to attend a funeral, and he sawsome people who had cast aside their upper sheets and were walking intheir shirts only. The Messenger of Allah (ﷺ) said: ‘Are youadopting the practice of the days of ignorance?’ or; ‘Are youimitating the behaviour of the days of ignorance? I was about tosupplicate against you that you would return in a different form.’Sothey put their sheets back on and never did that again.”",
      "chain": [
        "30423",
        "15383",
        "227"
      ]
    },
    {
      "hadith_no": "1558",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا أحمد بن عبدة، حدثنا حماد بن زيد، عن ثابت، عن أنس بن مالك، قال مر على النبي  صلى الله عليه وسلم  بجنازة فأثني عليها خيرا فقال ‏\"‏ وجبت ‏\"‏ ‏.‏ ثم مر عليه بجنازة فأثني عليها شرا فقال ‏\"‏ وجبت ‏\"‏ ‏.‏ فقيل يا رسول الله قلت لهذه وجبت ولهذه وجبت فقال ‏\"‏ شهادة القوم والمؤمنون شهود الله في الأرض ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Anas bin Malik said:                      “A funeral (procession)passedby the Prophet (ﷺ) and they praised (the deceased) and spokewellof him. He said: ‘(Paradise is) guaranteed for him.’ Then anotherfuneral passed by and they spoke badly of him, and he (the Prophet(ﷺ)) said: ‘(Hell is) guaranteed for him.’ It was said: ‘OMessengerof Allah, you said that (Paradise was) guaranteed for thisone andthat (Hell was) guaranteed for the other one.’ He said: ‘Itis thetestimony of the people, and the believers are the witnessesof Allahon earth.’”",
      "chain": [
        "30423",
        "20022",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "1594",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا أحمد بن عبدة، أنبأنا حماد بن زيد، حدثنا ثابت، عن أبي رافع، عن أبي هريرة، ‏.‏ أن امرأة، سوداء كانت تقم المسجد ففقدها رسول الله  صلى الله عليه وسلم  فسأل عنها بعد أيام فقيل له إنها ماتت ‏.‏ قال ‏\"‏ فهلا آذنتموني ‏\"‏ ‏.‏ فأتى قبرها فصلى عليها ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that a black woman used to sweepthemosque. The Messenger of Allah (ﷺ) noticed she was missing andheasked about her after a few days. He was told that she had died. Hesaid:                      “Why did you not tell me?” Then he went to her grave andofferedthe funeral prayer for her.",
      "chain": [
        "30423",
        "20022",
        "11269",
        "479"
      ]
    },
    {
      "hadith_no": "1720",
      "source": " Sunan Ibn Majah ",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا أحمد بن عبدة، حدثنا عبد العزيز بن محمد، ح وحدثنا هشام بن عمار، حدثنا مسلم بن خالد، قالا حدثنا العلاء بن عبد الرحمن، عن أبيه، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إذا كان النصف من شعبان فلا صوم حتى يجيء رمضان ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                     ‘When it is the middle of Sha’ban, do not fast until Ramadancomes.”",
      "chain": [
        "30423",
        "20167",
        "30288",
        "23063",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "1762",
      "source": " Sunan Ibn Majah ",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا أحمد بن عبدة، أنبأنا حماد بن زيد، عن عبد العزيز بن صهيب، عن أنس بن مالك، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ تسحروا فإن في السحور بركة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Anas bin Malik that the Messenger of Allah (ﷺ)said:                     “Eat Suhur, for in Suhur there is a blessing.”",
      "chain": [
        "30423",
        "20022",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "1784",
      "source": " Sunan Ibn Majah ",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا أحمد بن عبدة، حدثنا حماد بن زيد، حدثنا غيلان بن جرير، عن عبد الله بن معبد الزماني، عن أبي قتادة، قال قال عمر بن الخطاب يا رسول الله كيف بمن يصوم يومين ويفطر يوما قال ‏\"‏ ويطيق ذلك أحد ‏\"‏ ‏.‏ قال يا رسول الله كيف بمن يصوم يوما ويفطر يوما قال ‏\"‏ ذلك صوم داود ‏\"‏ ‏.‏ قال كيف بمن يصوم يوما ويفطر يومين قال ‏\"‏ وددت أني طوقت ذلك ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Qatadah said:                      “Umar bin Khattab said: ‘OMessenger of Allah! What about a person who fasts two days and doesnot fast one day?’ He said: ‘Is anyone able to do that?’ Hesaid: ‘OMessenger of Allah! What about a person who fasts one dayand not thenext?’ He said: ‘That is the fast of Dawud.’ Hesaid: ‘What about aman who fasts one day and does not fast thenext two days?’ He said:‘I wish that I were given the ability todo that.’”",
      "chain": [
        "30423",
        "20022",
        "11300",
        "10697",
        "391"
      ]
    },
    {
      "hadith_no": "1802",
      "source": " Sunan Ibn Majah ",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا أحمد بن عبدة، أنبأنا حماد بن زيد، حدثنا غيلان بن جرير، عن عبد الله بن معبد الزماني، عن أبي قتادة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ صيام يوم عرفة إني أحتسب على الله أن يكفر السنة التي قبله والتي بعده ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Qatadah that the Messenger of Allah (ﷺ)said:                     “Fasting on the Day of ‘Arafah, I hope from Allah, expiates forthe sins of the year before and the year after.”",
      "chain": [
        "30423",
        "20022",
        "11300",
        "10697",
        "391"
      ]
    },
    {
      "hadith_no": "1810",
      "source": " Sunan Ibn Majah ",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا أحمد بن عبدة، أنبأنا حماد بن زيد، حدثنا غيلان بن جرير، عن عبد الله بن معبد الزماني، عن أبي قتادة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ صيام يوم عاشوراء إني أحتسب على الله أن يكفر السنة التي قبله ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Qatadah that the Messenger of Allah (ﷺ)said:                     “Fasting the day of ‘Ashura’, I hope, will expiate for the sinsof the previous year.”",
      "chain": [
        "30423",
        "20022",
        "11300",
        "10697",
        "391"
      ]
    },
    {
      "hadith_no": "1982",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا أحمد بن عبدة، حدثنا حماد بن زيد، حدثنا ثابت البناني، عن أنس بن مالك، أن النبي  صلى الله عليه وسلم  رأى على عبد الرحمن بن عوف أثر صفرة فقال ‏\"‏ ما هذا أو مه ‏\"‏ ‏.‏ فقال يا رسول الله إني تزوجت امرأة على وزن نواة من ذهب ‏.‏ فقال ‏\"‏ بارك الله لك أولم ولو بشاة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Anas bin Malik:                     the Prophet saw traces of yellow perfume on 'Abdur-Rahmaan bin 'Awf, and he asked him “What is this?” He said: “ O Messenger of Allah I married a women for the weight of a Nawah (Stone) of gold. He said: “May Allah bless you. Give a feast even if is is only with one sheep.”",
      "chain": [
        "30423",
        "20022",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "1983",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا أحمد بن عبدة، حدثنا حماد بن زيد، عن ثابت البناني، عن أنس بن مالك، قال ما رأيت رسول الله  صلى الله عليه وسلم  أولم على شىء من نسائه ما أولم على زينب فإنه ذبح شاة ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                     “I never saw the Messenger of Allah give a wedding feast for any of his wives like the feast he gave for Zainab, for which he slaughtered a sheep.”",
      "chain": [
        "30423",
        "20022",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "1999",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا أحمد بن عبدة، أنبأنا عبد الواحد بن زياد، عن حجاج بن أرطاة، عن عمرو بن شعيب، عن عبد الله بن هرمي، عن خزيمة بن ثابت، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن الله لا يستحيي من الحق ‏\"‏ ‏.‏ ثلاث مرات لا تأتوا النساء في أدبارهن ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Khuzaimah bin Thabit:                     that the Messenger of Allah said: “Allah is not too shy to tell the truth,” three times. ” Do not have intercourse with women in their buttocks.”",
      "chain": [
        "30423",
        "20256",
        "20580",
        "19934",
        "410"
      ]
    },
    {
      "hadith_no": "2033",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا أحمد بن عبدة، حدثنا حماد بن زيد، حدثنا ثابت، وعبد العزيز، عن أنس، قال صارت صفية لدحية الكلبي ثم صارت لرسول الله  صلى الله عليه وسلم  بعد فتزوجها وجعل عتقها صداقها ‏.‏ قال حماد فقال عبد العزيز لثابت يا أبا محمد أنت سألت أنسا ما أمهرها قال أمهرها نفسها ‏.‏",
      "text_en": " It was narrated that Anas said:                     “Safiyyah was given to Dihyah Al-Kalbi (as his share of the war booty), then she was given to the Messenger of Allah after that. He married her, and made her ransom (i.e., freedom from slavery) her dowry.” (Sahih)Hammad said: “Abdul-'Aziz said to Thabit: 'O Abu Muhammad! Did you ask Anas what her bridal-money was?' He said: 'Her bridal-money was her freedom.' ”",
      "chain": [
        "30423",
        "20022",
        "11269",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "2086",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا أحمد بن عبدة، حدثنا حفص بن جميع، حدثنا سماك، عن عكرمة، عن ابن عباس، أن امرأة، جاءت إلى النبي  صلى الله عليه وسلم  فأسلمت ‏.‏ فتزوجها رجل ‏.‏ قال فجاء زوجها الأول فقال يا رسول الله إني قد كنت أسلمت معها وعلمت بإسلامي ‏.‏ قال فانتزعها رسول الله  صلى الله عليه وسلم  من زوجها الآخر وردها إلى زوجها الأول ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that:                     a woman came to the Prophet and became Muslim, and a man married her. Then her first husband carne and said: \"O Messenger of Allah, I became Muslim with her, and she knew that I was Muslim.\" So the Messenger of Allah took her away from her second husband and returned her to her first husband.",
      "chain": [
        "30423",
        "10770",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2185",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Expiation - كتاب الكفارات",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن عبدة، أنبأنا حماد بن زيد، حدثنا غيلان بن جرير، عن أبي بردة، عن أبيه أبي موسى، قال أتيت رسول الله  صلى الله عليه وسلم  في رهط من الأشعريين نستحمله فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ والله ما أحملكم وما عندي ما أحملكم عليه ‏\"‏ ‏.‏ قال فلبثنا ما شاء الله ثم أتي بإبل فأمر لنا بثلاثة إبل ذود غر الذرى فلما انطلقنا قال بعضنا لبعض أتينا رسول الله  صلى الله عليه وسلم  نستحمله فحلف ألا يحملنا ثم حملنا ارجعوا بنا ‏.‏ فأتيناه فقلنا يا رسول الله إنا أتيناك نستحملك فحلفت أن لا تحملنا ‏.‏ ثم حملتنا فقال ‏\"‏ والله ما أنا حملتكم فإن الله حملكم والله ما أنا حملتكم بل الله حملكم إني والله إن شاء الله لا أحلف على يمين فأرى غيرها خيرا منها إلا كفرت عن يميني وأتيت الذي هو خير ‏\"‏ ‏.‏ أو قال ‏\"‏ أتيت الذي هو خير وكفرت عن يميني ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Burdah that his father Abu Musa said:                     \"I came to the Messenger of Allah (ﷺ) with a group of Asharites and asked him to give us animals to ride. He said: 'By Allah, I cannot give you anything to ride, and I have nothing to give you to ride.' We stayed as long as Allah willed, then some camels were brought to him. He ordered that we be given three she-camels with fine humps. When we left, we said to one another: 'We came to the Messenger of Allah (ﷺ) to ask him for animals to ride, and he swore by Allah that he would not give us anything to ride, then he gave us something. Let us go back.' So we went to him and we said: 'O Messenger of Allah! We came to you seeking mounts, and you took an oath that you would not give us mounts, then you gave us some mounts.' He said: 'By Allah, I did not give you animals to ride, rather Allah gave you them to ride. I, by Allah, if Allah wills, do not swear and then see something better than it, but I offer expiation for what I swore about, and do that which is better.' Or he said: 'I do that which is better and offer expiation for what I swore about.'\"",
      "chain": [
        "30423",
        "20022",
        "11300",
        "11901"
      ]
    },
    {
      "hadith_no": "2266",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا أحمد بن عبدة، وأحمد بن المقدام، قالا حدثنا حماد بن زيد، عن جميل بن مرة، عن أبي الوضيء، عن أبي برزة الأسلمي، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ البيعان بالخيار ما لم يتفرقا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Barzah Al-Aslami that the Messenger of Allah (ﷺ) said:                     ”The two parties to a transaction have the choice (of annulling it) so long as they have not yet parted.\"",
      "chain": [
        "30423",
        "30121",
        "20022",
        "227"
      ]
    },
    {
      "hadith_no": "2343",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا أحمد بن عبدة، أنبأنا حماد بن زيد، عن سليمان بن علي الربعي، عن أبي الجوزاء، قال سمعته يأمر، بالصرف - يعني ابن عباس - ويحدث ذلك عنه ثم بلغني أنه رجع عن ذلك فلقيته بمكة فقلت إنه بلغني أنك رجعت ‏.‏ قال نعم إنما كان ذلك رأيا مني وهذا أبو سعيد يحدث عن رسول الله  صلى الله عليه وسلم  أنه نهى عن الصرف ‏.‏",
      "text_en": " It was narrated that Abu Jawza' said:                     \"I heard him meaning Ibn 'Abbas allowing exchange (of Dirhams for Dirham etc., if extra was given) and that was narrated from him. Then I heard that he has taken back this opinion. I met him in Makkah and said: 'I heard that you had taken back (your opinion).' He said: 'Yes. That was just my own opinion, but Abu Sa'eed narrated from the Messenger of Allah (ﷺ) that he forbade exchange (of like items if extra is given).\"'",
      "chain": [
        "30423",
        "20022",
        "10685",
        "11265",
        "38"
      ]
    },
    {
      "hadith_no": "2576",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Pawning - كتاب الرهون",
      "chapter_no": "16",
      "text_ar": "حدثنا أحمد بن عبدة، أنبأنا المغيرة بن عبد الرحمن، حدثني أبي، عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم قضى في سيل مهزور أن يمسك حتى يبلغ الكعبين ثم يرسل الماء ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu`aib, from his father, from his grandfather, that :                     the Messenger of Allah (ﷺ) ruled concerning the stream of Mahzur that the water should be retained until it reached the ankles, then released.",
      "chain": [
        "30423",
        "20182",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2630",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا أحمد بن عبدة، أنبأنا حماد بن زيد، عن يحيى بن سعيد، عن أبي أمامة بن سهل بن حنيف، أن عثمان بن عفان، أشرف عليهم فسمعهم وهم، يذكرون القتل فقال إنهم ليتواعدوني بالقتل فلم يقتلوني وقد سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يحل دم امرئ مسلم إلا في إحدى ثلاث رجل زنى وهو محصن فرجم أو رجل قتل نفسا بغير نفس أو رجل ارتد بعد إسلامه ‏\"‏ ‏.‏ فوالله ما زنيت في جاهلية ولا في إسلام ولا قتلت نفسا مسلمة ولا ارتددت منذ أسلمت ‏.‏",
      "text_en": " It was narrated from Abu Umamah bin Sahl bin Hunaif that:                     `Uthman bin 'Affan looked at them when they spoke of killing. He said: “Are they kill threatening to kill me? Why would they kill me? I heard the Messenger of Allah (ﷺ) say: “It is not lawful to shed the blood of a Muslim except in one of three (cases): a man who commits adultery when he is a married person, then he should be stoned; a man who kills a soul not in retaliation for murder; and a man who apostatizes after becoming Muslim.' By Allah (SWT), I never committed adultery either during Ignorance days nor in Islam, and I have never killed a Muslim soul, and I have not apostatized since I became Muslim.”",
      "chain": [
        "30423",
        "20022",
        "20031",
        "405",
        "4"
      ]
    },
    {
      "hadith_no": "2703",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا أحمد بن عبدة، ومحمد بن عبيد المديني أبو عبيد، قالا حدثنا عبد العزيز بن محمد الدراوردي، عن سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، أن سعد بن عبادة الأنصاري، قال يا رسول الله الرجل يجد مع امرأته رجلا أيقتله قال رسول الله صلى الله عليه وسلم ‏\"‏ لا ‏\"‏ ‏.‏ قال سعد بلى والذي أكرمك بالحق ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ اسمعوا ما يقول سيدكم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that Sa'd bin Ubadah Al-Ansari said:                     “O Messenger of Allah (ﷺ) if a man finds another man with his wife, should he kill him?” The Messenger of Allah (ﷺ) said: “No.” Sa'd said: “Yes he should, by the one who honored you with the Truth!” The Messenger of Allah (ﷺ) said: “Listen to what your leader says!”",
      "chain": [
        "30423",
        "30213",
        "20167",
        "11173",
        "11161",
        "13",
        "35"
      ]
    },
    {
      "hadith_no": "2877",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا أحمد بن عبدة، أنبأنا حماد بن زيد، عن ثابت، عن أنس بن مالك، قال ذكر النبي صلى الله عليه وسلم فقال كان أحسن الناس وكان أجود الناس وكان أشجع الناس ولقد فزع أهل المدينة ليلة فانطلقوا قبل الصوت فتلقاهم رسول الله صلى الله عليه وسلم وقد سبقهم إلى الصوت وهو على فرس لأبي طلحة عرى ما عليه سرج في عنقه السيف وهو يقول ‏\"‏ يا أيها الناس لن تراعوا ‏\"‏ ‏.‏ يردهم ثم قال للفرس ‏\"‏ وجدناه بحرا ‏\"‏ ‏.‏ أو ‏\"‏ إنه لبحر ‏\"‏ ‏.‏ قال حماد وحدثني ثابت أو غيره قال كان فرسا لأبي طلحة يبطأ فما سبق بعد ذلك اليوم ‏.‏",
      "text_en": " It wasnarrated from Hammad bin Zaid from Thabit, that the Prophet(ﷺ) wasmentioned before Anas bin Malik and he said:                      “He was thebest ofpeople, the most generous of people, the most courageous ofpeople.The people of Al-Madinah became alarmed one night, and he wasthefirst of them to investigate the noise and din. He was riding ahorsebelonging to Abu Talhah, bareback, with no saddle. His sword washanging from his neck and he was saying: ‘O people, do not beafraid,’sending them back to their houses. Then he said of thehorse, ‘Wefound it like a sea,’ or, ‘It is a sea.’”*",
      "chain": [
        "30423",
        "20022",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "3370",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hunting - كتاب الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا أحمد بن عبدة، حدثنا يحيى بن سليم الطائفي، حدثنا إسماعيل بن أمية، عن أبي الزبير، عن جابر بن عبد الله، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ ما ألقى البحر أو جزر عنه فكلوه وما مات فيه فطفا فلا تأكلوه ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Jabir bin ‘Abdullah that the Messenger of Allah(ﷺ)said:                      “Whatever the sea throws out or is left behind when thetideebbs, eat it, but whatever rises to its surface, do not eat it.’”",
      "chain": [
        "30423",
        "20204",
        "11417",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "3467",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا أحمد بن عبدة، حدثنا عثمان بن عبد الرحمن، حدثنا حميد الطويل، عن أنس بن مالك، قال صنعت أم سليم للنبي  صلى الله عليه وسلم  خبزة وضعت فيها شيئا من سمن ثم قالت اذهب إلى النبي  صلى الله عليه وسلم  فادعه قال فأتيته فقلت أمي تدعوك ‏.‏ قال فقام وقال لمن كان عنده من الناس ‏\"‏ قوموا ‏\"‏ ‏.‏ قال فسبقتهم إليها فأخبرتها فجاء النبي  صلى الله عليه وسلم  فقال ‏\"‏ هاتي ما صنعت ‏\"‏ ‏.‏ فقالت إنما صنعته لك وحدك ‏.‏ فقال ‏\"‏ هاتيه ‏\"‏ ‏.‏ فقال ‏\"‏ يا أنس أدخل على عشرة عشرة ‏\"‏ ‏.‏ قال فما زلت أدخل عليه عشرة عشرة فأكلوا حتى شبعوا وكانوا ثمانين ‏.‏",
      "text_en": " It wasnarrated that Anas bin Malik said:                      “Umm Sulaim made some breadforthe Prophet (ﷺ), and she put a little ghee on it. Then she said:‘Go to the Prophet (ﷺ) and invite him (to come and eat).’ So Iwentand told him: ‘My mother is inviting you (to come and eat).’So hestood up, and said to the people who were with him: ‘Get up.’I wentahead of him and told her. Then the Prophet (ﷺ) came andsaid:‘Bring what you have made.’ She said: ‘I only made it foryou alone.’He said: ‘Bring it.’ Then he said: ‘O Anas, bring(them) in to me tenby ten.’ So I kept bringing them in ten by ten,and they ate theirfill, and there were eighty of them.”",
      "chain": [
        "30423",
        "28389",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "3560",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Drinks - كتاب الأشربة",
      "chapter_no": "30",
      "text_ar": "حدثنا أحمد بن عبدة، وسويد بن سعيد، قالا حدثنا حماد بن زيد، عن ثابت البناني، عن عبد الله بن رباح، عن أبي قتادة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ ساقي القوم آخرهم شربا ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Qatadah that the Messenger of Allah (ﷺ) said:                     “The oen who serves water to others should be the last one to drinkfrom it.”",
      "chain": [
        "30423",
        "30547",
        "20022",
        "11269",
        "11865",
        "391"
      ]
    },
    {
      "hadith_no": "4093",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا أحمد بن عبدة، حدثنا حماد بن زيد، عن أبي عمران الجوني، عن المشعث بن طريف، عن عبد الله بن الصامت، عن أبي ذر، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ كيف أنت يا أبا ذر وموتا يصيب الناس حتى يقوم البيت بالوصيف ‏\"‏ ‏.‏ يعني القبر قلت ما خار الله لي ورسوله - أو قال الله ورسوله أعلم - قال ‏\"‏ تصبر ‏\"‏ ‏.‏ قال ‏\"‏ كيف أنت وجوعا يصيب الناس حتى تأتي مسجدك فلا تستطيع أن ترجع إلى فراشك ولا تستطيع أن تقوم من فراشك إلى مسجدك ‏\"‏ ‏.‏ قال قلت الله ورسوله أعلم أو - ما خار الله لي ورسوله - قال ‏\"‏ عليك بالعفة ‏\"‏ ‏.‏ ثم قال ‏\"‏ كيف أنت وقتلا يصيب الناس حتى تغرق حجارة الزيت بالدم ‏\"‏ ‏.‏ قلت ما خار الله لي ورسوله ‏.‏ قال ‏\"‏ الحق بمن أنت منه ‏\"‏ ‏.‏ قال قلت يا رسول الله أفلا آخذ بسيفي فأضرب به من فعل ذلك قال ‏\"‏ شاركت القوم إذا ولكن ادخل بيتك ‏\"‏ ‏.‏ قلت يا رسول الله فإن دخل بيتي قال ‏\"‏ إن خشيت أن يبهرك شعاع السيف فألق طرف ردائك على وجهك فيبوء بإثمه وإثمك فيكون من أصحاب النار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Dharr that the Messenger of Allah (ﷺ)said:                      “What will you do, O Abu Dharr, when death overwhelms thepeopleto such an extent that a grave will be equal in value to aslave?” Isaid: “Whatever Allah and His Messenger choose for me,or Allah andHis Messenger know best.” He said “Be patient.” Hesaid: ‘What willyou do when famine strikes the people so that youwill go to the placewhere you pray and will not be able to return toyour bed, or you willnot be able to get up from your bed to go tothe place where youpray?” He said: “I said: ‘Allah and HisMessenger know best, orwhatever Allah and His Messenger choose forme.” He said: “You mustrefrain from forbidden things.” Hesaid: “What will you do whenkilling befalls the people so thatHijaratuz-Zait*is covered withblood?” I said: “Whatever Allahand His Messenger choose for me.” Hesaid: “Stay with those whomyou belong to.” He said: “I said: ‘OMessenger of Allah, shouldI not take my sword and strike those who dothat?’” He said:“Then you will be just like the people. Rather enteryour house.”I said: “O Messenger of Allah, what if they enter myhouse?” Hesaid: “If you are afraid that the flashing of the swordwill dazzleyou, then put the edge of your garment over your face, andlet himcarry his own sin and your sin, and he will be one of thepeople ofthe Hellfire.”",
      "chain": [
        "30423",
        "20022",
        "11296",
        "10695",
        "23"
      ]
    }
  ],
  "total_hadiths": 125
}