{
  "id": "30432",
  "name": "Zayd bin Yazid al-Thqfy زيد بن يزيد الثقفي",
  "full_name": "Zayd bin Yazid al-Thqfy زيد بن يزيد الثقفي",
  "grade": "3rd Century AH [11th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  -  ثقة ]"
    ],
    "tags": [
      "al-Thaqifi",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20443",
      "name": "Abu 'Amir al-'Aqdi عبد الملك بن عمرو القيسي أبو عامر العقدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20355",
      "name": "Muhammad bin 'Abdullah bin al-Zubair محمد بن عبد الله أبو أحمد الزبيري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20287",
      "name": "Mua'dh bin Hisham bin Aby معاذ بن هشام بن أبي عبد الله",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20472",
      "name": "Yazid bin Harun يزيد بن هارون",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20450",
      "name": "'Umar bin Yonus bin al-Qasim عمر بن يونس بن القاسم",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20033",
      "name": "'Abdur Rahman bin Mahdi عبد الرحمن بن مهدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20226",
      "name": "Khalid bin al-Harith bin 'Ubaid خالد بن الحارث بن عبيد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20298",
      "name": "Wahb bin Jarir bin Hazim bin Zayd وهب بن جرير بن حازم بن زيد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20547",
      "name": "Sulaiman bin Da'ud bin al-Jarud سليمان بن داود أبو داود الطيالسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20241",
      "name": "al-Dahhak bin Mukhlad Abu 'Asim al-Nabil الضحاك بن مخلد أبو عاصم النبيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]"
    },
    {
      "id": "38164",
      "name": "al-Husain bin Ishaq al-Wasty الحسين بن إسحاق الواسطي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "20286",
      "name": "Mua'dh bin Mua'dh bin Nsr معاذ بن معاذ بن نصر",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "336",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن المثنى العنزي، وأبو معن الرقاشي وإسحاق بن منصور كلهم عن أبي عاصم، - واللفظ لابن المثنى - حدثنا الضحاك، - يعني أبا عاصم - قال أخبرنا حيوة بن شريح، قال حدثني يزيد بن أبي حبيب، عن ابن شماسة المهري، قال حضرنا عمرو بن العاص وهو في سياقة الموت ‏.‏ فبكى طويلا وحول وجهه إلى الجدار فجعل ابنه يقول يا أبتاه أما بشرك رسول الله صلى الله عليه وسلم بكذا أما بشرك رسول الله صلى الله عليه وسلم بكذا قال فأقبل بوجهه ‏.‏ فقال إن أفضل ما نعد شهادة أن لا إله إلا الله وأن محمدا رسول الله إني قد كنت على أطباق ثلاث لقد رأيتني وما أحد أشد بغضا لرسول الله صلى الله عليه وسلم مني ولا أحب إلى أن أكون قد استمكنت منه فقتلته فلو مت على تلك الحال لكنت من أهل النار فلما جعل الله الإسلام في قلبي أتيت النبي صلى الله عليه وسلم فقلت ابسط يمينك فلأبايعك ‏.‏ فبسط يمينه - قال - فقبضت يدي ‏.‏ قال ‏\"‏ ما لك يا عمرو ‏\"‏ ‏.‏ قال قلت أردت أن أشترط ‏.‏ قال ‏\"‏ تشترط بماذا ‏\"‏ ‏.‏ قلت أن يغفر لي ‏.‏ قال ‏\"‏ أما علمت أن الإسلام يهدم ما كان قبله وأن الهجرة تهدم ما كان قبلها وأن الحج يهدم ما كان قبله ‏\"‏ ‏.‏ وما كان أحد أحب إلى من رسول الله صلى الله عليه وسلم ولا أجل في عيني منه وما كنت أطيق أن أملأ عينى منه إجلالا له ولو سئلت أن أصفه ما أطقت لأني لم أكن أملأ عينى منه ولو مت على تلك الحال لرجوت أن أكون من أهل الجنة ثم ولينا أشياء ما أدري ما حالي فيها فإذا أنا مت فلا تصحبني نائحة ولا نار فإذا دفنتموني فشنوا على التراب شنا ثم أقيموا حول قبري قدر ما تنحر جزور ويقسم لحمها حتى أستأنس بكم وأنظر ماذا أراجع به رسل ربي ‏.‏",
      "text_en": " It is narrated on the authority of Ibn Shamasa Mahri that he said:                      We went to Amr b. al-As and he was about to die. He wept for a long time and turned his face towards the wall. His son said: Did the Messenger of Allah (may peace be upon him not give you tidings of this? Did the Messenger of Allah (may peace be upon him) not give you tidings of this? He (the narrator) said: He turned his face (towards the audience) and said: The best thing which we can count upon is the testimony that there is no god but Allah and that Muhammad is the Apostle of Allah. Verily I have passed through three phases. (The first one) in which I found myself averse to none else more than I was averse to the Messenger of Allah (may peace be upon him) and there was no other desire stronger in me than the one that I should overpower him and kill him. Had I died in this state, I would have been definitely one of the denizens of Fire. When Allah instilled the love of Islam in my heart, I came to the Apostle (may peace be upon him) and said: Stretch out your right hand so that may pledge my allegiance to you. He stretched out his right hand, I withdrew my hand, He (the Holy Prophet) said: What has happened to you, O 'Amr? replied: I intend to lay down some condition. He asked: What condition do you intend to put forward? I said: should be granted pardon. He (the Holy Prophet) observed: Are you not aware of the fact that Islam wipes out all the previous (misdeeds)? Verily migration wipes out all the previous (misdeeds), and verily the pilgrimage wipes out all the (previous) misdeeds. And then no one as or dear to me than the Messenger of Allah and none was more sublime in my eyes than he, Never could I, pluck courage to catch a full glimpse of his face due to its splendour. So if I am asked to describe his features, I cannot do that for I have not eyed him fully. Had I died in this state had every reason to hope that I would have bee among the dwellers of Paradise. Then we were responsible for certain things (in the light of which) I am unable to know what is in store for me. When I die, let neither female mourner nor fire accompany me. When you bury me, fill my grave well with earth, then stand around it for the time within which a camel is slaughtered and its meat is distributed so that I may enjoy your intimacy and (in your company) ascertain what answer I can give to the messengers (angels) of Allah.",
      "chain": [
        "30170",
        "30432",
        "26010",
        "11411"
      ]
    },
    {
      "hadith_no": "240",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثني محمد بن حاتم، وأبو معن الرقاشي قالا حدثنا عمر بن يونس، حدثنا عكرمة بن عمار، حدثني يحيى بن أبي كثير، قال حدثني - أو، حدثنا - أبو سلمة بن عبد الرحمن، حدثني سالم، مولى المهري قال خرجت أنا وعبد الرحمن بن أبي بكر، في جنازة سعد بن أبي وقاص فمررنا على باب حجرة عائشة فذكر عنها عن النبي صلى الله عليه وسلم مثله ‏.‏",
      "text_en": " Salim, the freed slave of Mahri, reported:                      I and 'Abd al-Rahman b. Abu Bakr went out (in order to join) the funeral procession of Sa'd b. Abi Waqqas and passed by the door of the residence of 'A'isha, and then he transmitted a hadith like this from her who (narrated it) from the Holy Prophet (may peace be upon him).",
      "chain": [
        "38487",
        "30432",
        "20450",
        "10704",
        "11449",
        "10567"
      ]
    },
    {
      "hadith_no": "1847",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا محمد بن المثنى، ومحمد بن حاتم، وعبد بن حميد، وأبو معن الرقاشي قالوا حدثنا عمر بن يونس، حدثنا عكرمة بن عمار، حدثنا يحيى بن أبي كثير، حدثني أبو سلمة، بن عبد الرحمن بن عوف قال سألت عائشة أم المؤمنين بأى شىء كان نبي الله صلى الله عليه وسلم يفتتح صلاته إذا قام من الليل قالت كان إذا قام من الليل افتتح صلاته ‏\"‏ اللهم رب جبرائيل وميكائيل وإسرافيل فاطر السموات والأرض عالم الغيب والشهادة أنت تحكم بين عبادك فيما كانوا فيه يختلفون اهدني لما اختلف فيه من الحق بإذنك إنك تهدي من تشاء إلى صراط مستقيم ‏\"‏ ‏.‏",
      "text_en": " 'Ali b. Abu Talib reported that when the Messenger of Allah (may peace be upon him) got up at night for prayer he would say:                      I turn my face in complete devotion to One Who is the Originator of the heaven and the earth and I am not of the polytheists. Verily my prayer, my sacrifice, my living and my dying are for Allah, the Lord of the worlds; There is no partner with Him and this is what I have been commanded (to profess and believe) and I am of the believers. O Allah, Thou art the King, there is no god but Thee, Thou art my Lord, and I am Thy bondman. I wronged myself and make a confession of my Sin. Forgive all my sins, for no one forgives the sins but Thee, and guide me in the best of conduct for none but Thee guideth anyone (in) good conduct. Remove sins from me, for none else but Thou can remove sins from me. Here I am at Thy service, and Grace is to Thee and the whole of good is in Thine hand, and one cannot get nearneststo Thee through evil. My (power as well as existence) is due to Thee (Thine grace) and I turn to Thee (for supplication). Thou art blessed and Thou art exalted. I seek forgiveness from Thee and turn to Thee in repentance: and when he would bow, he would say: O Allah, it is for Thee that I bowed. I affirm my faith in Thee and I submit to Thee, and submit humbly before Thee my hearing, my eyesight, my marrow, my bone, my sinew; and when he would raise his head, he would say: O Allah, our Lord, praise is due to Thee, (the praise) with which is filled the heavens and the earth, and with which is filled that (space) which exists between them, and filled with anything that Thou desireth afterward. And when he prostrated himself, he (the Holy Prophet) would say: O Allah, it is to Thee that I prostrate myself and it is in Thee that I affirm my faith, and I submit to Thee. My face is submitted before One Who created it, and shaped it, and opened his faculties of hearing and seeing. Blessed is Allah, the best of Creators; and he would then say between Tashahhud and the pronouncing of salutation: Forgive me of the earlier and later open and secret (sins) and that where I made transgression and that Thou knowest better than I. Thou art the First and the Last. There is no god, but Thee.",
      "chain": [
        "30170",
        "38487",
        "30553",
        "30432",
        "20450",
        "10704",
        "11449",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "3458",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني أبو معن الرقاشي، زيد بن يزيد الثقفي - بصري ثقة - حدثنا خالد، - يعني ابن الحارث - عن ابن عجلان، عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم بمثل حديث يحيى القطان ‏.",
      "text_en": " This hadith has been reported on the authority of Ibn Umar (Allah be pleased with them) with another chain of transmitters.",
      "chain": [
        "30432",
        "20226",
        "10616",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3506",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثني أبو معن الرقاشي، حدثنا خالد بن الحارث، حدثنا هشام، عن يحيى، أنه كتب إليه عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تنكح المرأة على عمتها ولا على خالتها ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      One should not combine in marriage a woman with her father's sister, or her mother's sister.",
      "chain": [
        "30432",
        "20226",
        "20295",
        "20031",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "6115",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثني أبو معن الرقاشي، وأبو بكر بن نافع وعبد بن حميد قالوا حدثنا أبو عامر - وهو عبد الملك بن عمرو - حدثنا أفلح بن سعيد، حدثنا عبد الله بن رافع، قال كانت أم سلمة تحدث أنها سمعت النبي صلى الله عليه وسلم يقول على المنبر وهي تمتشط ‏\"‏ أيها الناس ‏\"‏ ‏.‏ فقالت لماشطتها كفي رأسي ‏.‏ بنحو حديث بكير عن القاسم بن عباس ‏.‏",
      "text_en": " Umm Salama reported that she heard Allah's Apostle (may peace be upon him) saying this as he was sitting on the pulpit and she was getting her hair combed. (He uttered these words):                     \" O people.\" And she said to one who was combing: Leave my head; the rest of the hadith is the same.",
      "chain": [
        "30432",
        "20443",
        "20501",
        "11864"
      ]
    },
    {
      "hadith_no": "6155",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثني أبو معن الرقاشي، زيد بن يزيد أخبرنا عمر بن يونس، حدثنا عكرمة، - وهو ابن عمار - قال قال إسحاق قال أنس كان رسول الله صلى الله عليه وسلم من أحسن الناس خلقا فأرسلني يوما لحاجة فقلت والله لا أذهب ‏.‏ وفي نفسي أن أذهب لما أمرني به نبي الله صلى الله عليه وسلم فخرجت حتى أمر على صبيان وهم يلعبون في السوق فإذا رسول الله صلى الله عليه وسلم قد قبض بقفاى من ورائي - قال - فنظرت إليه وهو يضحك فقال ‏\"‏ يا أنيس أذهبت حيث أمرتك ‏\"‏ ‏.‏ قال قلت نعم أنا أذهب يا رسول الله ‏.‏  قال أنس والله لقد خدمته تسع سنين ما علمته قال لشىء صنعته لم فعلت كذا وكذا أو لشىء تركته هلا فعلت كذا وكذا ‏.‏",
      "text_en": " Anas reported that Allah's Messenger (may peace be upon him) had the best disposition amongst people. He sent me on an errand one day, and I said:                      By Allah, I would not go. I had, however, this idea in my mind that I would do as Allah's Apostle (may peace be upon him) had commanded me to do. I went out until I happened to come across children who had been playing in the street. In the meanwhile, Allah's Messenger (may peace be upon him) came there and he caught me by the back of my neck from behind me. As I looked towards him I found him smiling and he said: Unais, did you go where I commanded you to go? I said: Allah's Messenger, yes, I am going. Anas further said: I served him for nine years but I know not that he ever said to me about a thing which I had done why I did that, or about a thing I had left as to why I had not done that.",
      "chain": [
        "30432",
        "20450",
        "10704",
        "30312",
        "19"
      ]
    },
    {
      "hadith_no": "6531",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثني أبو معن الرقاشي، حدثنا عمر بن يونس، حدثنا عكرمة، حدثنا إسحاق، حدثنا أنس، قال جاءت بي أمي أم أنس إلى رسول الله صلى الله عليه وسلم وقد أزرتني بنصف خمارها وردتني بنصفه فقالت يا رسول الله هذا أنيس ابني أتيتك به يخدمك فادع الله له ‏.‏ فقال ‏\"‏ اللهم أكثر ماله وولده ‏\"‏ ‏.‏ قال أنس فوالله إن مالي لكثير وإن ولدي وولد ولدي ليتعادون على نحو المائة اليوم ‏.‏",
      "text_en": " Anas reported:                      My mother Umm Anas came to Allah's Messenger (may peace be upon him). And she prepared my lower garment out of the half of her headdress and (with the other half) she covered my upper body and said: Allah's Messenger, here is my son Unais; I have brought him to you for serving you. Invoke blessings of Allah upon him. Thereupon he (the Holy Prophet) said: O Allah, make an increase in his wealth, and progeny. Anas said: By Allah, my fortune is huge and my children, and grand-children are now more than one hundred.",
      "chain": [
        "30432",
        "20450",
        "11023",
        "30312",
        "19"
      ]
    },
    {
      "hadith_no": "6572",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثني أبو معن الرقاشي، حدثنا عمر بن يونس، حدثنا عكرمة، - وهو ابن عمار - حدثنا إسحاق، - وهو ابن عبد الله بن أبي طلحة - أن أنسا، حدثه أن رسول الله صلى الله عليه وسلم استغفر للأنصار - قال - وأحسبه قال ‏\"‏ ولذراري الأنصار ولموالي الأنصار ‏\"‏ ‏.‏ لا أشك فيه ‏.‏",
      "text_en": " Anas reported that Allah's Messenger (may peace be upon him) sought forgiveness for the Ansar and he said:                      I think (he also sought forgiveness) for the children of the Ansar and the slaves and the freed men of the Ansar. I have no doubt about it.",
      "chain": [
        "30432",
        "20450",
        "10704",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "6792",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثني زهير بن حرب، وأبو معن الرقاشي - واللفظ لزهير - قالا حدثنا عمر، بن يونس حدثنا عكرمة بن عمار، حدثنا إسحاق بن أبي طلحة، حدثني أنس بن مالك، قال كانت عند أم سليم يتيمة وهي أم أنس فرأى رسول الله صلى الله عليه وسلم اليتيمة فقال ‏\"‏ آنت هيه لقد كبرت لا كبر سنك ‏\"‏ ‏.‏ فرجعت اليتيمة إلى أم سليم تبكي فقالت أم سليم ما لك يا بنية قالت الجارية دعا على نبي الله صلى الله عليه وسلم أن لا يكبر سني فالآن لا يكبر سني أبدا - أو قالت قرني - فخرجت أم سليم مستعجلة تلوث خمارها حتى لقيت رسول الله صلى الله عليه وسلم فقال لها رسول الله صلى الله عليه وسلم ‏\"‏ ما لك يا أم سليم ‏\"‏ ‏.‏ فقالت يا نبي الله أدعوت على يتيمتي قال ‏\"‏ وما ذاك يا أم سليم ‏\"‏ ‏.‏ قالت زعمت أنك دعوت أن لا يكبر سنها ولا يكبر قرنها - قال - فضحك رسول الله صلى الله عليه وسلم ثم قال ‏\"‏ يا أم سليم أما تعلمين أن شرطي على ربي أني اشترطت على ربي فقلت إنما أنا بشر أرضى كما يرضى البشر وأغضب كما يغضب البشر فأيما أحد دعوت عليه من أمتي بدعوة ليس لها بأهل أن تجعلها له طهورا وزكاة وقربة يقربه بها منه يوم القيامة ‏\"‏ ‏.‏ وقال أبو معن يتيمة ‏.‏ بالتصغير في المواضع الثلاثة من الحديث ‏.‏",
      "text_en": " Anas b. Malik reported that there was an orphan girl with Umm Sulaim (who was the mother of Anas). Allah's Messenger (may peace be upon him) saw that orphan girl and said:                      O, it is you; you have grown young. May you not advance in years! That slave-girl returned to Umm Sulaim weeping. Umm Sulaim said: O daughter, what is the matter with you? She said: Allah's Apostle (may peace be upon him) has invoked curse upon me that I should not grow in age and thus I would never grow in age, or she said, in my (length) of life. Umm Sulaim went out wrapping her head-dress hurriedly until she met Allah's Messenger (may peace be upon him). He said to her: Umm Sulaim, what is the matter with you? She said: Allah's Apostle, you invoked curse upon my orphan girl. He said: Umm Sulaim, what is that? She said: She (the orphan girl) states you have cursed her saying that she might not grow in age or grow in life. Allah's Messenger (may peace be upon him) smiled and then said: Umm Sulaim, don't you know that I have made this term with my Lord. And the term with my Lord is that I said to Him: 1 am a human being and I am pleased just as a human being is pleased and I lose temper just as a human being loses temper, so for any person from amongst my Ummah whom I curse and he in no way deserves it, let that, O Lord, be made a source of purification and purity and nearness to (Allah) on the Day of Resurrection.",
      "chain": [
        "30022",
        "30432",
        "20450",
        "10704",
        "11151",
        "19"
      ]
    }
  ],
  "total_hadiths": 10
}