{
  "id": "30443",
  "name": "'Amr bin Sawad عمرو بن سواد",
  "full_name": "'Amr bin Sawad عمرو بن سواد",
  "grade": "3rd Century AH [11th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "245",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  د  س  ق  -  ثقة ]"
    ],
    "tags": [
      "B.'Amir",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20029",
      "name": "'Abdullah bin Wahb عبد الله بن وهب بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20002",
      "name": "Imam Shafi'ee ابو عبد الله محمد بن إدريس الشافعي",
      "grade": "Succ. (Taba' Tabi') [9th generation] [Shafi'ee]"
    },
    {
      "id": "36012",
      "name": "Ashhb bin 'Abdul 'Aziz أشهب بن عبد العزيز بن داود",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "26020",
      "name": "'Abdullah bin Kulayb al-Muradi عبد الله بن كليب المرادي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "24451",
      "name": "Mu'mal bin 'Abdur Rahman مؤمل بن عبد الرحمن الثقفي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "students": [
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]"
    },
    {
      "id": "30006",
      "name": "Imam Nasa'i أحمد بن شعيب بن علي بن سنان النسائي",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30004",
      "name": "Ibn Maja ابن ماجة",
      "grade": "3rd Century AH [12th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-muslim-241",
      "hadith_no": "241",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثني حرملة بن يحيى، وعمرو بن سواد العامري، ومحمد بن سلمة المرادي، قال المرادي حدثنا عبد الله بن وهب، عن يونس، وقال الآخران، أخبرنا ابن وهب، قال أخبرني يونس، عن ابن شهاب، قال حدثني عبيد الله بن عبد الله بن عتبة، أن أبا هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ألم تروا إلى ما قال ربكم قال ما أنعمت على عبادي من نعمة إلا أصبح فريق منهم بها كافرين ‏.‏ يقولون الكواكب وبالكواكب ‏\"‏ ‏.‏",
      "text_en": " It is reported on the authority of Abu Huraira that the Messenger of Allah (may peace and blessings be upon him) said:                      Don't you know what your Lord said? He observed: I have never endowed My bondsmen with a favor, but a section amongst them disbelieved it and said: Stars, it was due to the stars.",
      "usc_msa_ref": "",
      "chain": [
        "30487",
        "30443",
        "30491",
        "20029",
        "20475",
        "20029",
        "20475",
        "11013",
        "11004",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-242",
      "hadith_no": "242",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني محمد بن سلمة المرادي، حدثنا عبد الله بن وهب، عن عمرو بن الحارث، ح وحدثني عمرو بن سواد، أخبرنا عبد الله بن وهب، أخبرنا عمرو بن الحارث، أن أبا يونس، مولى أبي هريرة حدثه عن أبي هريرة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ ما أنزل الله من السماء من بركة إلا أصبح فريق من الناس بها كافرين ينزل الله الغيث فيقولون الكوكب كذا وكذا ‏\"‏ وفي حديث المرادي ‏\"‏ بكوكب كذا وكذا ‏\"‏ ‏.‏",
      "text_en": " It is reported on the authority of Abu Huraira that the Messenger of Allah (may peace and blessing be upon him) observed:                      Allah does not shower His blessings from the heaven that in the morning a group of men disbelieve it (to be a blessing from Allah). Allah sends down rain, but they (the disbelievers) say: Such and such star (is responsible for that).",
      "usc_msa_ref": "",
      "chain": [
        "30491",
        "20029",
        "20377",
        "30443",
        "20029",
        "20377",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-429-2",
      "hadith_no": "429",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثني أبو الطاهر، وعمرو بن سواد، قالا أخبرنا ابن وهب، حدثني الليث بن سعد، عن جعفر بن ربيعة، عن عبد الرحمن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لينتهين أقوام عن رفعهم أبصارهم عند الدعاء في الصلاة إلى السماء أو لتخطفن أبصارهم ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      People should avoid lifting their eyes towards the sky while supplicating in prayer, otherwise their eyes would be snatched away.",
      "usc_msa_ref": "",
      "chain": [
        "30443",
        "20029",
        "20023",
        "11407",
        "11197",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-482-2",
      "hadith_no": "482",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "وحدثنا هارون بن معروف، وعمرو بن سواد، قالا حدثنا عبد الله بن وهب، عن عمرو بن الحارث، عن عمارة بن غزية، عن سمى، مولى أبي بكر أنه سمع أبا صالح، ذكوان يحدث عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أقرب ما يكون العبد من ربه وهو ساجد فأكثروا الدعاء ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      The Messenger of Allah (may peace be upon him) said: The nearest a servant comes to his Lord is when he is prostrating himself, so make supplication (in this state).",
      "usc_msa_ref": "",
      "chain": [
        "30280",
        "30443",
        "20029",
        "20377",
        "11894",
        "11161",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-492-2",
      "hadith_no": "492",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا عمرو بن سواد العامري، أخبرنا عبد الله بن وهب، أخبرنا عمرو بن الحارث، أن بكيرا، حدثه أن كريبا مولى ابن عباس حدثه عن عبد الله بن عباس، أنه رأى عبد الله بن الحارث يصلي ورأسه معقوص من ورائه فقام فجعل يحله فلما انصرف أقبل إلى ابن عباس فقال ما لك ورأسي فقال إني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إنما مثل هذا مثل الذي يصلي وهو مكتوف ‏\"‏ ‏.‏",
      "text_en": " Abdullah b. Abbas reported that he saw 'Abdullah b. al-Harith observing the prayer and (his hair) was plaited behind his head. He ('Abdullah b. 'Abbas) stood up and unfolded them. While going back (from the prayer) he met Ibn 'Abbas and said to him:                      Why is it that you touched my head? He (Ibn 'Abbas) replied: (The man who observes prayer with plaited hair) is like one who prays with his hands tied behind.",
      "usc_msa_ref": "",
      "chain": [
        "30443",
        "20029",
        "20377",
        "11154",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-495-3",
      "hadith_no": "495",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا عمرو بن سواد، أخبرنا عبد الله بن وهب، أخبرنا عمرو بن الحارث، والليث بن سعد، كلاهما عن جعفر بن ربيعة، بهذا الإسناد ‏.‏ وفي رواية عمرو بن الحارث كان رسول الله صلى الله عليه وسلم إذا سجد يجنح في سجوده حتى يرى وضح إبطيه ‏.‏ وفي رواية الليث أن رسول الله صلى الله عليه وسلم كان إذا سجد فرج يديه عن إبطيه حتى إني لأرى بياض إبطيه ‏.‏",
      "text_en": " This hadith has been narrated by Ja'far b. Rabi' with the same chain of transmitters. And in the narration transmitted by 'Amr b. al-Harith (the words are):                     \" When the Messenger of Allah (rtiay peace be upon him) prostrated, he spread out his arms so that the whiteness of his armpits was visible.\" And in the narration transmitted by al-Laith (the words are:\" When the Messenger of Allah (may peace be upon him) prostrated. he spread his hands from the armpits so that I saw their whiteness.\"",
      "usc_msa_ref": "",
      "chain": [
        "30443",
        "20029",
        "20377",
        "20023",
        "11407"
      ]
    },
    {
      "id": "sahih-muslim-1348",
      "hadith_no": "1348",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني هارون بن سعيد، وحرملة بن يحيى، وعمرو بن سواد، قال حرملة أخبرنا وقال الآخران، حدثنا ابن وهب، أخبرني يونس، عن ابن شهاب، عن حميد بن عبد الرحمن، عن أبي هريرة، قال سمعت رسول الله صلى الله عليه وسلم بعد ذلك يستعيذ من عذاب القبر ‏.‏",
      "text_en": " Abu Huraira reported. I heard the Messenger of Allah (may peace be upon him) seeking refuge from the torment of the grave after this (after the revelation).",
      "usc_msa_ref": "",
      "chain": [
        "30487",
        "30443",
        "30487",
        "20029",
        "20475",
        "11013",
        "10561",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-1428",
      "hadith_no": "1428",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني هارون بن سعيد الأيلي، وعمرو بن سواد، وأحمد بن عيسى، قال عمرو أخبرنا وقال الآخران، حدثنا ابن وهب، قال أخبرني عمرو، أن بكيرا، حدثه عن بسر بن سعيد، وسلمان الأغر، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا كان اليوم الحار فأبردوا بالصلاة فإن شدة الحر من فيح جهنم ‏\"‏ ‏.",
      "text_en": " Abu Huraira reported:                      The Messenger of Allah (may peace be upon him) said: When it is a hot day, (delay) the prayer till the extreme heat passes away, for the intensity of heat is from the exhalation of Hell.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "30443",
        "30227",
        "11439",
        "20029",
        "20377",
        "11154",
        "11153",
        "11171",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-1432",
      "hadith_no": "1432",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني عمرو بن سواد، وحرملة بن يحيى، - واللفظ لحرملة - أخبرنا ابن وهب، أخبرني يونس، عن ابن شهاب، قال حدثني أبو سلمة بن عبد الرحمن، أنه سمع أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ اشتكت النار إلى ربها فقالت يا رب أكل بعضي بعضا ‏.‏ فأذن لها بنفسين نفس في الشتاء ونفس في الصيف فهو أشد ما تجدون من الحر وأشد ما تجدون من الزمهرير ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      The Messenger of Allah (may peace be upon him) said: The Fire made a complaint before the Lord saying.\" O Lord, some parts of mine have consumed the others.\" So it was allowed to take two exhalations, one exhalation in winter and the other exhalation in summer. That is why you find extreme heat (in summer) and extreme cold (in winter).",
      "usc_msa_ref": "",
      "chain": [
        "30443",
        "30487",
        "20029",
        "20475",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-1445",
      "hadith_no": "1445",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا عمرو بن سواد العامري، ومحمد بن سلمة المرادي، وأحمد بن عيسى، - وألفاظهم متقاربة - قال عمرو أخبرنا وقال الآخران، حدثنا ابن وهب، أخبرني عمرو بن الحارث، عن يزيد بن أبي حبيب، أن موسى بن سعد الأنصاري، حدثه عن حفص بن عبيد الله، عن أنس بن مالك، أنه قال صلى لنا رسول الله صلى الله عليه وسلم العصر فلما انصرف أتاه رجل من بني سلمة فقال يا رسول الله إنا نريد أن ننحر جزورا لنا ونحن نحب أن تحضرها ‏.‏ قال ‏\"‏ نعم ‏\"‏ ‏.‏ فانطلق وانطلقنا معه فوجدنا الجزور لم تنحر فنحرت ثم قطعت ثم طبخ منها ثم أكلنا قبل أن تغيب الشمس ‏.‏ وقال المرادي حدثنا ابن وهب عن ابن لهيعة وعمرو بن الحارث في هذا الحديث ‏.‏",
      "text_en": " Anas b. Malik reported:                      The Messenger of Allah (may peace be upon him) led us in the afternoon prayer. When he completed it, a person from Bani Salama came to him and said: Messenger of Allah, we intend to slaughter our came and we are desirous that you should also be present there (on this occasion). He (the Holy Prophet) said: Yes. He (the person) went and we also went along with him and we found that the camel had not been slaughtered yet. Then it was slaughtered, and it was cut into pieces and then some of those were cooked, and then we ate (them) before the setting of the sun. This hadith has also been narrated by another chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30443",
        "30491",
        "30227",
        "11439",
        "20029",
        "20377",
        "11411",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-1475",
      "hadith_no": "1475",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا عمرو بن سواد العامري، وحرملة بن يحيى، قالا أخبرنا ابن وهب، أخبرني يونس، أن ابن شهاب، أخبره قال أخبرني عروة بن الزبير، أن عائشة، زوج النبي صلى الله عليه وسلم قالت أعتم رسول الله صلى الله عليه وسلم ليلة من الليالي بصلاة العشاء وهي التي تدعى العتمة فلم يخرج رسول الله صلى الله عليه وسلم حتى قال عمر بن الخطاب نام النساء والصبيان فخرج رسول الله صلى الله عليه وسلم فقال لأهل المسجد حين خرج عليهم ‏\"‏ ما ينتظرها أحد من أهل الأرض غيركم ‏\"‏ ‏.‏ وذلك قبل أن يفشو الإسلام في الناس ‏.‏ زاد حرملة في روايته قال ابن شهاب وذكر لي أن رسول الله صلى الله عليه وسلم قال ‏\"‏ وما كان لكم أن تنزروا رسول الله صلى الله عليه وسلم على الصلاة ‏\"‏ ‏.‏ وذاك حين صاح عمر بن الخطاب ‏.‏",
      "text_en": " 'A'isha. the wife of the Apostle of Allah (may peace be upon him), reported:                      The Messenger of Allah (may peace be upon him) deferred one night the 'Isya' prayer. And this is called 'Atama. And the Messenger of Allah (may peace be upon him) did not come out till Umar b. Khattab told (him) that the women and children had gone to sleep. So the Messenger of Allah (may peace be upon him) came out towards them and said to the people of the mosque: None except you from the people of the earth waits for it (for the night prayer at this late hour), and it was before Islam had spread amongst people. And in the narration transmitted by Ibn Shihab the Messenger of Allah (may peace be upon him) is reported to have said: It is not meant that you should compel the Messenger of Allah (may peace be upon him) for prayer. And (this he said) when 'Umar b. Khattab called (the Holy Prophet) in a loud voice.",
      "usc_msa_ref": "",
      "chain": [
        "30443",
        "30487",
        "20029",
        "20475",
        "11013",
        "10511"
      ]
    },
    {
      "id": "sahih-muslim-1653",
      "hadith_no": "1653",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا عمرو بن سواد، وحرملة، قالا أخبرنا ابن وهب، أخبرني يونس، عن ابن شهاب، عن عبد الله بن عامر بن ربيعة، أخبره أن أباه أخبره أنه، رأى رسول الله صلى الله عليه وسلم يصلي السبحة بالليل في السفر على ظهر راحلته حيث توجهت ‏.‏",
      "text_en": " 'Abdullah b. 'Amir b. Rabi'a has reported on the authority of his father that he had seen the Messenger of Allah (may peace be upon him) observing Nafl player at night on a journey on the back of his ride in whichever direction it turned its face.",
      "usc_msa_ref": "",
      "chain": [
        "30443",
        "30487",
        "20029",
        "20475",
        "11013",
        "709",
        "708"
      ]
    },
    {
      "id": "sahih-muslim-1661",
      "hadith_no": "1661",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني أبو الطاهر، وعمرو بن سواد، قالا أخبرنا ابن وهب، حدثني جابر بن إسماعيل، عن عقيل، عن ابن شهاب، عن أنس، عن النبي صلى الله عليه وسلم إذا عجل عليه السفر يؤخر الظهر إلى أول وقت العصر فيجمع بينهما ويؤخر المغرب حتى يجمع بينها وبين العشاء حين يغيب الشفق ‏.‏",
      "text_en": " Anas reported that when the Apostle of Allah (may peace be upon him) had to set out on a journey hurriedly, he delayed the noon prayer to the earlier time for the afternoon prayer, and then he would combine them, and he would delay the sunset prayer to the time when the twilight would disappear and then combine it with the 'Isha' prayer.",
      "usc_msa_ref": "",
      "chain": [
        "30443",
        "20029",
        "20621",
        "11207",
        "11013",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-1997",
      "hadith_no": "1997",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "وحدثنا عمرو بن سواد العامري، حدثنا عبد الله بن وهب، أخبرنا عمرو بن، الحارث أن سعيد بن أبي هلال، وبكير بن الأشج، حدثاه عن أبي بكر بن المنكدر، عن عمرو، بن سليم عن عبد الرحمن بن أبي سعيد الخدري، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ غسل يوم الجمعة على كل محتلم وسواك ويمس من الطيب ما قدر عليه ‏\"‏ ‏.‏ إلا أن بكيرا لم يذكر عبد الرحمن وقال في الطيب ولو من طيب المرأة ‏.‏",
      "text_en": " 'Abd al-Rahman son of Abd Sa'id al-Khudri reported on the authority of his father that the Messenger of Allah (may peace be upon him) said:                      Bathing on Friday for every adult, using of Miswak and applying some perfume, that is available-these are essential. So far as the perfume is concerned, it may be that used by a lady.",
      "usc_msa_ref": "",
      "chain": [
        "30443",
        "20029",
        "20377",
        "11169",
        "11154",
        "1544",
        "11879",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-2021",
      "hadith_no": "2021",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "وحدثني أبو الطاهر، وحرملة، وعمرو بن سواد العامري، قال أبو الطاهر حدثنا وقال الآخران، أخبرنا ابن وهب، أخبرني يونس، عن ابن شهاب، أخبرني أبو عبد الله، الأغر أنه سمع أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا كان يوم الجمعة",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      When it is Friday, the angels stand at every door of the mosque and record the people in the order of their arrival, and when the Imam sits (on the pulpit for delivering the sermon) they fold up their sheets (manuscripts of the Qur'an) and listen to the mention (of Allah). And he who comes early is like one who offers a she-camel as a sacrifice, the next like one who offers a cow, the next a ram, the next a hen, the next an egg.",
      "usc_msa_ref": "",
      "chain": [
        "30487",
        "30443",
        "20029",
        "20475",
        "11013",
        "11171",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-2176",
      "hadith_no": "2176",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "حدثنا يونس بن عبد الأعلى الصدفي، وعمرو بن سواد العامري، قالا أخبرنا عبد الله بن وهب، أخبرني عمرو بن الحارث، عن سعيد بن الحارث الأنصاري، عن عبد، الله بن عمر قال اشتكى سعد بن عبادة شكوى له فأتى رسول الله صلى الله عليه وسلم يعوده مع عبد الرحمن بن عوف وسعد بن أبي وقاص وعبد الله بن مسعود فلما دخل عليه وجده في غشية فقال ‏\"‏ أقد قضى ‏\"‏ ‏.‏ قالوا لا يا رسول الله ‏.‏ فبكى رسول الله صلى الله عليه وسلم فلما رأى القوم بكاء رسول الله صلى الله عليه وسلم بكوا فقال ‏\"‏ ألا تسمعون إن الله لا يعذب بدمع العين ولا بحزن القلب ولكن يعذب بهذا - وأشار إلى لسانه - أو يرحم ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. 'Umar said that Sa'd b. Ubada complained of illness. The Messenger of Allah (may peace be upon him) came to visit him accompanied by 'Abd al-Rahman b. 'Auf, Sa'd b. Abi Waqqas and 'Abdullah b. Mas'ud. As he entered (his room) he found him in a swoon. Upon this he said:                      Has he died? They said: Messenger of Allah, it is not so. The Messenger of Allah (may peace be upon him) wept. When the people saw Allah's Messenger (may peace be upon him) weeping, they also began to weep. He said. Listen, Allah does not punish for the tears that the eye sheds or the grief the heart feels, but He punishes for this (pointing to his tongue), or He may show mercy.",
      "usc_msa_ref": "",
      "chain": [
        "30443",
        "20029",
        "20377",
        "11167",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-2742",
      "hadith_no": "2742",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثني عمرو بن سواد العامري، أخبرنا عبد الله بن وهب، أخبرنا عمرو بن، الحارث عن بكير بن الأشج، عن يزيد، مولى سلمة بن الأكوع عن سلمة بن الأكوع، - رضى الله عنه - أنه قال كنا في رمضان على عهد رسول الله صلى الله عليه وسلم من شاء صام ومن شاء أفطر فافتدى بطعام مسكين حتى أنزلت هذه الآية ‏{‏ فمن شهد منكم الشهر فليصمه‏}‏",
      "text_en": " Salama b. Akwa' reported:                      We, during the lifetime of the Messenger of Allah (may peace be upon him), in one month of Ramadan (observed fast according to our liking). He who wished to fast lasted and he who wished to break broke it and fed a needy person as an expiation 1544 till this verse was revealed:\" He who witnesses among you the month (of Ramadan) he should observe fast during it\" (ii. 184).",
      "usc_msa_ref": "",
      "chain": [
        "30443",
        "20029",
        "20377",
        "11154",
        "237"
      ]
    },
    {
      "id": "sahih-muslim-2843",
      "hadith_no": "2843",
      "source": "Sahih Muslim",
      "chapter": "The Book of I'tikaf - كتاب الاعتكاف",
      "chapter_no": "15",
      "text_ar": "وحدثناه ابن أبي عمر، حدثنا سفيان، ح وحدثني عمرو بن سواد، أخبرنا ابن، وهب أخبرنا عمرو بن الحارث، ح وحدثني محمد بن رافع، حدثنا أبو أحمد، حدثنا سفيان، ح وحدثني سلمة بن شبيب، حدثنا أبو المغيرة، حدثنا الأوزاعي، ح وحدثني زهير بن حرب، حدثنا يعقوب بن إبراهيم بن سعد، حدثنا أبي، عن ابن إسحاق، كل هؤلاء عن يحيى بن، سعيد عن عمرة، عن عائشة، - رضى الله عنها - عن النبي صلى الله عليه وسلم ‏.‏ بمعنى حديث أبي معاوية ‏.‏ وفي حديث ابن عيينة وعمرو بن الحارث وابن إسحاق ذكر عائشة وحفصة وزينب - رضى الله عنهن - أنهن ضربن الأخبية للاعتكاف ‏.‏",
      "text_en": " This hadith has been reported through another chain of transmitters, and there it is mentioned that. 'A'isha, Hafsa and Zainab (Allah be pleased with them) pitched the tents for i'tikaf.",
      "usc_msa_ref": "",
      "chain": [
        "30421",
        "20005",
        "30443",
        "20377",
        "30375",
        "20355",
        "20012",
        "30417",
        "20442",
        "20024",
        "30022",
        "20184",
        "20150"
      ]
    },
    {
      "id": "sahih-muslim-4745",
      "hadith_no": "4745",
      "source": "Sahih Muslim",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "وحدثناه أبو بكر بن أبي شيبة، وزهير بن حرب، وإسحاق بن إبراهيم، وابن، أبي عمر جميعا عن ابن عيينة، ح وحدثنا عمرو بن سواد العامري، أخبرنا عبد الله بن، وهب أخبرني عمرو بن الحارث، عن سعيد بن أبي هلال، ح وحدثني محمد بن سهل التميمي، حدثني ابن أبي مريم، حدثنا محمد، - يعني ابن مطرف - كلهم عن أبي حازم، عن سهل، بن سعد ‏.‏ بهذا الحديث عن النبي صلى الله عليه وسلم ‏.‏ في حديث ابن أبي هلال أصيب وجهه ‏.‏ وفي حديث ابن مطرف جرح وجهه ‏.‏",
      "text_en": " The same tradition has been narrated on the authority of Sahl b. Sa'd through a different chain of transmitters with a slight difference in the wording.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30022",
        "30123",
        "30421",
        "20005",
        "30443",
        "20377",
        "11169",
        "30232"
      ]
    },
    {
      "id": "sahih-muslim-6596",
      "hadith_no": "6596",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا ابن المثنى، حدثنا عبد الوهاب، حدثنا عبيد الله، ح وحدثنا عمرو بن سواد، أخبرنا ابن وهب، أخبرني أسامة، ح وحدثني زهير بن حرب، والحلواني، وعبد بن حميد، عن يعقوب بن إبراهيم بن سعد، حدثنا أبي، عن صالح، كلهم عن نافع، عن ابن عمر، عن  النبي صلى الله عليه وسلم ‏.‏ بمثله وفي حديث صالح وأسامة أن رسول الله صلى الله عليه وسلم قال ذلك على المنبر ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Ibn Umar with a slight variation of wording (and the wording) that Allah's Messenger (may peace be upon him) said this on the pulpit. This hadith has been reported on the authority of Ibn Umar but through another chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "20259",
        "11201",
        "30443",
        "20029",
        "50",
        "30022",
        "30115",
        "30553",
        "20184",
        "20150",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-6712",
      "hadith_no": "6712",
      "source": "Sahih Muslim",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا أبو الطاهر، وعمرو بن سواد، قالا أخبرنا ابن وهب، أخبرنا مالك بن، أنس عن مسلم بن أبي مريم، عن أبي صالح، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ تعرض أعمال الناس في كل جمعة مرتين يوم الاثنين ويوم الخميس فيغفر لكل عبد مؤمن إلا عبدا بينه وبين أخيه شحناء فيقال اتركوا - أو اركوا - هذين حتى يفيئا ‏\"‏ ‏.‏",
      "text_en": " Abu Huraim reported Allah's Messenger (may peace be upon him) as saying The deeds of people would be presented every week on two days, viz. Monday and Thursday, and every believing servant would be granted pardon except the one in whose (heart) there is rancour against his brother and it would he said:                      Leave them and put them off until they are turned to reconciliation.",
      "usc_msa_ref": "",
      "chain": [
        "30443",
        "20029",
        "20001",
        "11540",
        "11161",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-7616",
      "hadith_no": "7616",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "حدثنا عمرو بن سواد العامري، أخبرنا عبد الله بن وهب، أخبرني عمرو بن، الحارث أن بكر بن سوادة، حدثه أن يزيد بن رباح - هو أبو فراس مولى عبد الله بن عمرو بن العاص - حدثه عن عبد الله بن عمرو بن العاص، عن رسول الله صلى الله عليه وسلم أنه قال ‏\"‏ إذا فتحت عليكم فارس والروم أى قوم أنتم ‏\"‏ ‏.‏ قال عبد الرحمن بن عوف نقول كما أمرنا الله قال رسول الله صلى الله عليه وسلم ‏\"‏ أو غير ذلك تتنافسون ثم تتحاسدون ثم تتدابرون ثم تتباغضون أو نحو ذلك ثم تنطلقون في مساكين المهاجرين فتجعلون بعضهم على رقاب بعض ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. 'Amr b. al-As reported that Allah's Messenger (may peace be upon him) said:                      How would you be,0 people. when Persia and Rome would be conquered for you? 'Abd at-Rahman b Auf said: We would say as Allah has commanded us and we would express our gratitude to Allah Thereupon Allah's Messenger (may peace be upon him) said: Nothing else besides it? You would (in fact) vie with one another, then you would feel jealous. then your relations would be estranged and then you will bear enmity against one another. or something to the same effect. Then you would go to the poor emigrants and would make some the masters of the others.",
      "usc_msa_ref": "",
      "chain": [
        "30443",
        "20029",
        "20377",
        "10849",
        "29"
      ]
    },
    {
      "id": "sunan-an-nasai-601",
      "hadith_no": "601",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرني عمرو بن سواد بن الأسود بن عمرو، قال أنبأنا ابن وهب، قال حدثنا جابر بن إسماعيل، عن عقيل، عن ابن شهاب، عن أنس، عن رسول الله صلى الله عليه وسلم أنه كان إذا عجل به السير يؤخر الظهر إلى وقت العصر فيجمع بينهما ويؤخر المغرب حتى يجمع بينها وبين العشاء حين يغيب الشفق ‏.‏",
      "text_en": " It was narrated from Anas that the Messenger of Allah (ﷺ) said:                      \"If the Messenger of Allah (ﷺ) wanted to travel quickly, he would delay Zuhr until the time of 'Asr and combine them, and he would delay Maghrib until he combined it with 'Isha' when the twilight had disappeared.\"",
      "usc_msa_ref": "",
      "chain": [
        "30443",
        "20029",
        "20621",
        "11207",
        "11013",
        "19"
      ]
    },
    {
      "id": "sunan-an-nasai-626",
      "hadith_no": "626",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا عمرو بن سواد بن الأسود بن عمرو، قال أنبأنا ابن وهب، قال أنبأنا يونس، عن ابن شهاب، عن سعيد بن المسيب، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من نسي صلاة فليصلها إذا ذكرها فإن الله تعالى قال ‏{‏ أقم الصلاة لذكري ‏}‏ ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:                      \"Whoever forgets a prayer, let him pray it when he remembers it, for Allah says: and perform the Salah for My remembrance.\" [1][1] Ta-Ha 20:14.",
      "usc_msa_ref": "",
      "chain": [
        "30443",
        "20029",
        "20475",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-862",
      "hadith_no": "862",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا عمرو بن سواد بن الأسود بن عمرو، قال أنبأنا ابن وهب، قال أنبأنا ابن جريج، عن منبوذ، عن الفضل بن عبيد الله، عن أبي رافع، قال كان رسول الله صلى الله عليه وسلم إذا صلى العصر ذهب إلى بني عبد الأشهل فيتحدث عندهم حتى ينحدر للمغرب ‏.‏ قال أبو رافع فبينما النبي صلى الله عليه وسلم يسرع إلى المغرب مررنا بالبقيع فقال ‏\"‏ أف لك أف لك ‏\"‏ ‏.‏ قال فكبر ذلك في ذرعي فاستأخرت وظننت أنه يريدني فقال ‏\"‏ ما لك امش ‏\"‏ ‏.‏ فقلت أحدثت حدثا ‏.‏ قال ‏\"‏ ما ذاك ‏\"‏ ‏.‏ قلت أففت بي ‏.‏ قال ‏\"‏ لا ولكن هذا فلان بعثته ساعيا على بني فلان فغل نمرة فدرع الآن مثلها من نار ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Rafi said:                       \"After the Messenger of Allah (ﷺ) had prayed Asr, he would go to Banu 'Abdul-Ashhal to speak to them, until the time for Maghrib came.\" Abu Rafi said: \"While the Prophet (ﷺ) was hastening to prayMaghrib, we passed by and he said: 'Fie on you, fie on you!' That upset me so I slowed down because I thought hat he meant me. He said: 'What is the matter with you? Keep up!' I said: 'Is there something wrong?' Hesaid: 'Why are you asking that? I said: 'Because you said: \"Fie on you\" to me.' He said: 'No, that was so-and-so whom I had sent to collect Zakat from the tribe of so-and-so, and he stole a Namirah and nowhe is clothed with something similarmade of Fire.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30443",
        "20029",
        "11070",
        "479"
      ]
    },
    {
      "id": "sunan-an-nasai-1114",
      "hadith_no": "1114",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا عمرو بن سواد بن الأسود بن عمرو السرحي، - من ولد عبد الله بن سعد بن أبي سرح - قال أنبأنا ابن وهب، قال أنبأنا عمرو بن الحارث، أن بكيرا، حدثه أن كريبا مولى ابن عباس حدثه عن عبد الله بن عباس، أنه رأى عبد الله بن الحارث يصلي ورأسه معقوص من ورائه فقام فجعل يحله فلما انصرف أقبل إلى ابن عباس فقال ما لك ورأسي قال إني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إنما مثل هذا مثل الذي يصلي وهو مكتوف ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin 'Abbas that:                     He saw 'Abdullah bin Al-Harith praying with his hair bound behind him. He stopped and started to undo it. When he finished he turned to Ibn 'Abbas and said: \"What were you doing to my head?\" He said: \"I heard the Messenger of Allah (ﷺ) say: 'The likeness of this is that of one who prays with his hands tie behind his neck.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30443",
        "20029",
        "20377",
        "11154",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-1233",
      "hadith_no": "1233",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا عمرو بن سواد بن الأسود بن عمرو، قال حدثنا عبد الله بن وهب، قال أنبأنا الليث بن سعد، عن يزيد بن أبي حبيب، عن جعفر بن ربيعة، عن عراك بن مالك، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم سجد يوم ذي اليدين سجدتين بعد السلام ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     The Messenger of Allah (ﷺ) prostrated twice after the salam on the day of Dhul-Yadain.",
      "usc_msa_ref": "",
      "chain": [
        "30443",
        "20029",
        "20023",
        "11411",
        "11407",
        "11204",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-1234",
      "hadith_no": "1234",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا عمرو بن سواد بن الأسود، قال أخبرنا ابن وهب، قال أنبأنا عمرو بن الحارث، قال حدثنا قتادة، عن محمد بن سيرين، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " Narrated from Abu Hurairah:                     A similar report was narrated from Abu Hurairah from the Messenger of Allah (ﷺ).",
      "usc_msa_ref": "",
      "chain": [
        "30443",
        "20029",
        "20377",
        "11019",
        "11035",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-1346",
      "hadith_no": "1346",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا عمرو بن سواد بن الأسود بن عمرو، قال حدثنا ابن وهب، قال أخبرني حفص بن ميسرة، عن موسى بن عقبة، عن عطاء بن أبي مروان، عن أبيه، أن كعبا، حلف له بالله الذي فلق البحر لموسى إنا لنجد في التوراة أن داود نبي الله صلى الله عليه وسلم كان إذا انصرف من صلاته قال ‏\"‏ اللهم أصلح لي ديني الذي جعلته لي عصمة وأصلح لي دنياى التي جعلت فيها معاشي اللهم إني أعوذ برضاك من سخطك وأعوذ بعفوك من نقمتك وأعوذ بك منك لا مانع لما أعطيت ولا معطي لما منعت ولا ينفع ذا الجد منك الجد ‏.‏ قال وحدثني كعب أن صهيبا حدثه أن محمدا صلى الله عليه وسلم كان يقولهن عند انصرافه من صلاته ‏.‏",
      "text_en": " It was narrated from 'Ata bin Abi Marwan, from his father, that:                     Ka'b swore to him: \"By Allah (SWT) Who parted the sea for Musa, we find in the Tawrah that when Dawud, the Prophet of Allah, finished his prayer, he would say: 'Allahumma Aslih li dinya-lladhi ja'altahu li ismatan wa aslih li dunyaya-llati ja'alta fiha ma'ashi, Allahumma inni a-udhu biridaka min sakhatik wa a-udhu bi'afwika min naqmatika wa a-udhu bika mink, la mani' lima a'taita wa la mu'tia lima mana'ta wa la yanfa'u dhal-jaddi minka al-jadd (O Allah, set straight my religious commitment that You have made a protection for me, and set straight my worldly affairs which You have made a means of my livelihood. O Allah, I seek refuge in Your pleasure from Your wrath, and I seek refuge in Your forgiveness from Your punishment, and I seek refuge in You from You. None can withhold what you have given and none can give what you have withheld, and no wealth or fortune can avail the man of wealth and fortune before You.)'\" He said: \"And Ka'b told me that Suhaib told him that Muhammad (ﷺ) used to say (these words) when he had finished praying.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30443",
        "20029",
        "20421",
        "11106",
        "12361"
      ]
    },
    {
      "id": "sunan-an-nasai-Grade-5",
      "hadith_no": "Grade",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرنا عمرو بن سواد، قال أنبأنا ابن وهب، قال أنبأنا ابن أبي ذئب، عن أسيد بن أبي أسيد، عن عبد الله بن أبي قتادة، عن جابر بن عبد الله، - رضى الله عنه - أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من ترك الجمعة ثلاثا من غير ضرورة طبع الله على قلبه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Jabir bin 'Abdullah that:                     The Messenger of Allah (ﷺ) said: \"Whoever misses jumu'ah three times with no cogent excuse, Allah (SWT) will place a seal on his heart.\"",
      "usc_msa_ref": "",
      "chain": [
        "30443",
        "20029",
        "20177",
        "19800",
        "11804",
        "34"
      ]
    },
    {
      "id": "sunan-an-nasai-Grade-26",
      "hadith_no": "Grade",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرنا عمرو بن سواد بن الأسود بن عمرو، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن وهب، عن عمرو بن الحارث، عن الجلاح، مولى عبد العزيز أن أبا سلمة بن عبد الرحمن، حدثه عن جابر بن عبد الله، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ يوم الجمعة اثنتا عشرة ساعة لا يوجد فيها عبد مسلم يسأل الله شيئا إلا آتاه إياه فالتمسوها آخر ساعة بعد العصر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Jabir bin 'Abdullah that:                     The Messenger of Allah (ﷺ) said: \"Friday is twelve hours in which there is no Muslim slave who asks Allah (SWT) for something but He will give it to him, so seek it in the last hour after 'Asr.\"",
      "usc_msa_ref": "",
      "chain": [
        "30443",
        "36017",
        "20029",
        "20377",
        "10567",
        "34"
      ]
    },
    {
      "id": "sunan-an-nasai-Grade-33",
      "hadith_no": "Grade",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرنا عمرو بن سواد بن الأسود، قال أنبأنا ابن وهب، قال أنبأنا ابن جريج، أن أبا الزبير، أخبره أنه، سمع جابر بن عبد الله، يقول كان رسول الله صلى الله عليه وسلم إذا خطب يستند إلى جذع نخلة من سواري المسجد فلما صنع المنبر واستوى عليه اضطربت تلك السارية كحنين الناقة حتى سمعها أهل المسجد حتى نزل إليها رسول الله صلى الله عليه وسلم فاعتنقها فسكتت ‏.‏",
      "text_en": " Jabir bin 'Abdullah said:                     \"When the Messenger of Allah (ﷺ) delivered the khutbah, he used to lean against a palm tree trunk that formed one of the pillars of the masjid. When the minbar was made and he sat down on it, that pillar made a sound like the groaning of a camel, which the people of the masjid heard, until the Messenger of Allah (ﷺ) came down and embraced it, then it fell silent.\"",
      "usc_msa_ref": "",
      "chain": [
        "30443",
        "20029",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "id": "sunan-an-nasai-1524",
      "hadith_no": "1524",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Praying for Rain (Al-Istisqa') - كتاب الاستسقاء",
      "chapter_no": "17",
      "text_ar": "أخبرنا عمرو بن سواد بن الأسود بن عمرو، قال أنبأنا ابن وهب، قال أخبرني يونس، عن ابن شهاب، قال أخبرني عبيد الله بن عبد الله بن عتبة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ قال الله عز وجل ما أنعمت على عبادي من نعمة إلا أصبح فريق منهم بها كافرين يقولون الكوكب وبالكوكب ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah (ﷺ) said: \"Allah, the Mighty and Sublime, said: I have never sent down My favor to My slaves but a group of them became disbelievers who say; \"The stars and by stars.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30443",
        "20029",
        "20475",
        "11013",
        "11004",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-2061",
      "hadith_no": "2061",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا عمرو بن سواد بن الأسود بن عمرو، عن ابن وهب، قال حدثنا يونس بن يزيد، عن ابن شهاب، عن حميد بن عبد الرحمن، عن أبي هريرة، قال سمعت رسول الله صلى الله عليه وسلم بعد ذلك يستعيذ من عذاب القبر ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"I heard the Messenger of Allah after that seeking refuge with Allah from the torment of the grave.\"",
      "usc_msa_ref": "",
      "chain": [
        "30443",
        "20029",
        "20475",
        "11013",
        "10561",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-2489",
      "hadith_no": "2489",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرني عمرو بن سواد بن الأسود بن عمرو، وأحمد بن عمرو، والحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن وهب، قال حدثنا عمرو بن الحارث، أن أبا الزبير، حدثه أنه، سمع جابر بن عبد الله، يقول أن رسول الله صلى الله عليه وسلم قال ‏\"‏ فيما سقت السماء والأنهار والعيون العشر وفيما سقي بالسانية نصف العشر ‏\"‏ ‏.‏",
      "text_en": " Jabir bin 'Abdullah said:                     \"The Messenger of Allah said:'For that which is watered by the sky, rivers and springs, one-tenth. For whatever is irrigated by animals, one-half of one-tenth.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30443",
        "36017",
        "20029",
        "20377",
        "11263",
        "34"
      ]
    },
    {
      "id": "sunan-an-nasai-2544",
      "hadith_no": "2544",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا عمرو بن سواد بن الأسود بن عمرو، عن ابن وهب، قال أنبأنا يونس، عن ابن شهاب، قال حدثنا سعيد بن المسيب، أنه سمع أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ خير الصدقة ما كان عن ظهر غنى وابدأ بمن تعول ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah said:                     \"The Messenger of Allah said: \"The best of charity is that which is given when you are self-sufficient, and start with those for whom you are responsible.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30443",
        "20029",
        "20475",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-2609",
      "hadith_no": "2609",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا عمرو بن سواد بن الأسود بن عمرو، عن ابن وهب، قال حدثنا يونس، عن ابن شهاب، عن عبد الله بن الحارث بن نوفل الهاشمي، أن عبد المطلب بن ربيعة بن الحارث بن عبد المطلب، أخبره أن أباه ربيعة بن الحارث قال لعبد المطلب بن ربيعة بن الحارث والفضل بن العباس بن عبد المطلب ائتيا رسول الله صلى الله عليه وسلم فقولا له استعملنا يا رسول الله على الصدقات ‏.‏ فأتى علي بن أبي طالب ونحن على تلك الحال فقال لهما إن رسول الله صلى الله عليه وسلم لا يستعمل منكم أحدا على الصدقة قال عبد المطلب فانطلقت أنا والفضل حتى أتينا رسول الله صلى الله عليه وسلم فقال لنا ‏\"‏ إن هذه الصدقة إنما هي أوساخ الناس وإنها لا تحل لمحمد ولا لآل محمد صلى الله عليه وسلم ‏\"‏ ‏.‏",
      "text_en": " Abu Rabiah binAl-Harith said to 'Abdul-Muttalib bin Rabi'ah bin Al-Harith and Al-Fadl bin 'Abbas bin 'Abdul-Muttalib:                     \"Go to the Messenger of Allah and say to him:  'O Messenger of Allah, appoint us to collect the Sadaqat!' 'Ali bin Abi Talib came along when we were like that, and he said to them: \"The Messenger of Allah will not appoint any of you to collect the Sadaqah.\"' 'Abdul-Muttalib said: \"So I went with Al-Fadl until we came to the Messenger of Allah and he said to us: \"This Zakah is the dirt of the people, and it is not permissible for Muhammad or for the family of Muhammad.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30443",
        "20029",
        "20475",
        "11013",
        "906"
      ]
    },
    {
      "id": "sunan-an-nasai-3149",
      "hadith_no": "3149",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا عمرو بن سواد، قال أنبأنا ابن وهب، قال أخبرني يحيى بن أيوب، وذكر، آخر قبله عن عمارة بن غزية، عن أبي الزبير، عن جابر بن عبد الله، قال لما كان يوم أحد وولى الناس كان رسول الله صلى الله عليه وسلم في ناحية في اثنى عشر رجلا من الأنصار وفيهم طلحة بن عبيد الله فأدركهم المشركون فالتفت رسول الله صلى الله عليه وسلم وقال ‏\"‏ من للقوم ‏\"‏ ‏.‏ فقال طلحة أنا ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ كما أنت ‏\"‏ ‏.‏ فقال رجل من الأنصار أنا يا رسول الله ‏.‏ فقال ‏\"‏ أنت ‏\"‏ ‏.‏ فقاتل حتى قتل ثم التفت فإذا المشركون فقال ‏\"‏ من للقوم ‏\"‏ ‏.‏ فقال طلحة أنا ‏.‏ قال ‏\"‏ كما أنت ‏\"‏ ‏.‏ فقال رجل من الأنصار أنا ‏.‏ فقال ‏\"‏ أنت ‏\"‏ ‏.‏ فقاتل حتى قتل ثم لم يزل يقول ذلك ويخرج إليهم رجل من الأنصار فيقاتل قتال من قبله حتى يقتل حتى بقي رسول الله صلى الله عليه وسلم وطلحة بن عبيد الله فقال رسول الله صلى الله عليه وسلم ‏\"‏ من للقوم ‏\"‏ ‏.‏ فقال طلحة أنا ‏.‏ فقاتل طلحة قتال الأحد عشر حتى ضربت يده فقطعت أصابعه فقال حس ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لو قلت بسم الله لرفعتك الملائكة والناس ينظرون ‏\"‏ ‏.‏ ثم رد الله المشركين ‏.‏",
      "text_en": " It was narrated that Jabir bin 'Abdullah said:                      \"On the day of Uhud, the people ran away, and the Messenger of Allah (ﷺ) was in one position among twelve men of the Ansar, one of whom was Talhah bin 'Ubaidullah. He said: 'Who will face the people?' Talhah said: 'I will.' The Messenger of Allah (ﷺ) said: 'Stay where you are.' One of the Ansar said: 'I will, O Messenger of Allah (ﷺ).' He said: 'You (go ahead).' So he fought until he was killed. Then he turned and saw the idolators. He said: 'Who will face the people?' Talhah said: 'I will'. The Messenger of Allah (ﷺ) said: 'Stay where you are.' One of the Ansar said: 'I will, O Messenger of Allah (ﷺ).' He said: 'You (go ahead).' So he fought until he was killed. This carried on, and each man of the Ansar went out to face them and fought like the one before him, and was killed, until only the Messenger of Allah (ﷺ) and Talhah bin 'Ubaidullah were left. The Messenger of Allah (ﷺ) said: 'Who will face the people?' Talhah said: 'I will.' So Talhah fought like the eleven before him, until his hand was struck, and his fingers were cut off, and he exclaimed in pain. The Messenger of Allah (ﷺ) said: 'If you had said Bismillah (in the Name of Allah), the angels would have lifted you up with the people looking on.' Then Allah drove back the idolators.\"",
      "usc_msa_ref": "",
      "chain": [
        "30443",
        "20029",
        "20379",
        "11894",
        "11263",
        "34"
      ]
    },
    {
      "id": "sunan-an-nasai-3150",
      "hadith_no": "3150",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا عمرو بن سواد، قال أنبأنا ابن وهب، قال أخبرنا يونس، عن ابن شهاب، قال أخبرني عبد الرحمن، وعبد الله، ابنا كعب بن مالك أن سلمة بن الأكوع، قال لما كان يوم خيبر قاتل أخي قتالا شديدا مع رسول الله صلى الله عليه وسلم فارتد عليه سيفه فقتله فقال أصحاب رسول الله صلى الله عليه وسلم في ذلك وشكوا فيه رجل مات بسلاحه قال سلمة فقفل رسول الله صلى الله عليه وسلم من خيبر فقلت يا رسول الله أتأذن لي أن أرتجز بك فأذن له رسول الله صلى الله عليه وسلم فقال عمر بن الخطاب رضى الله عنه اعلم ما تقول فقلت والله لولا الله ما اهتدينا ولا تصدقنا ولا صلينا فقال رسول الله صلى الله عليه وسلم ‏\"‏ صدقت ‏\"‏ ‏.‏ فأنزلن سكينة علينا وثبت الأقدام إن لاقينا والمشركون قد بغوا علينا فلما قضيت رجزي قال رسول الله صلى الله عليه وسلم ‏\"‏ من قال هذا ‏\"‏ ‏.‏ قلت أخي ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ يرحمه الله ‏\"‏ ‏.‏ فقلت يا رسول الله والله إن ناسا ليهابون الصلاة عليه يقولون رجل مات بسلاحه ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ مات جاهدا مجاهدا ‏\"‏ ‏.‏ قال ابن شهاب ثم سألت ابنا لسلمة بن الأكوع فحدثني عن أبيه مثل ذلك غير أنه قال حين قلت إن ناسا ليهابون الصلاة عليه ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ كذبوا مات جاهدا مجاهدا فله أجره مرتين ‏\"‏ ‏.‏ وأشار بأصبعيه ‏.‏",
      "text_en": " Salamah bin Al-Akwa' said:                      \"On the day of Khaibar, my brother fought fiercely alongside the Messenger of Allah (ﷺ), then his sword recoiled upon him and killed him. The Companions of the Messenger of Allah (ﷺ), complaining about that, said: 'A man has died by his own weapon.'\" Salamah said: \"The Messenger of Allah (ﷺ) returned from Khaibar and I said: 'O Messenger of Allah, do you permit me to recite some lines of Rajaz verse to you?' The Messenger of Allah (ﷺ) gave him permission but 'Umar bin Al-Khattab, may Allah be pleased with him, said: \"Think what you are saying.\" \"I said:'By Allah, if Allah had not guided us we would not have been guided We would not have given in charity nor prayed' The Messenger of Allah (ﷺ) said: 'You have spoken the truth.' (I continued:) 'Send down tranquility upon us, And make us steadfast when we meet the enemy. For the idolators have transgressed against us.' When I completed my Rajaz verse, the Messenger of Allah (ﷺ) said: 'Who said that?' I said: 'My brother.' The Messenger of Allah (ﷺ) said: 'May Allah have mercy on him.' I said: 'O Messenger of Allah, some people are afraid to offer the (funeral) prayer for him, and they are saying that he is a man who died by his own weapon.' The Messenger of Allah (ﷺ) said: 'He died striving as a Mujahid.'\" Ibn Shihab said: \"Then I asked a son of Salamah bin Al-Akwa', and he narrated a similar report to me from his father, except that he said: 'When I said: Some people are afraid to offer the (funeral) prayer for him, the Messenger of Allah (ﷺ) said: They lied. He died striving as Mujahid, and he will have a twofold reward, and he gestured with two of his fingers.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30443",
        "20029",
        "20475",
        "11013",
        "10530",
        "1131",
        "237"
      ]
    },
    {
      "id": "sunan-an-nasai-5520",
      "hadith_no": "5520",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا عمرو بن سواد، قال حدثنا ابن وهب، قال حدثنا عمرو بن الحارث، عن يزيد بن أبي حبيب، عن سليمان بن سنان المزني، أنه سمع أبا هريرة، يقول سمعت أبا القاسم، صلى الله عليه وسلم يقول في صلاته ‏\"‏ اللهم إني أعوذ بك من فتنة القبر ومن فتنة الدجال ومن فتنة المحيا والممات ومن حر جهنم ‏\"‏ ‏.‏ قال أبو عبد الرحمن هذا الصواب ‏.‏",
      "text_en": " It was narrated from Sulaiman bin Sinan Al-Muzani that he heard Abu Hurairah say:                     \"I heard Abu Al-Qasim [SAW] say, during his prayer: 'Allahumma, inni a'udhu bika min fitnatil-qabri, wa fitnatid-dajjali, wa min fitnatil-mahya wal-mamati, wa min harri jahannam (O Allah, I seek refuge with You from the trial of the grave, and from the tribulation of the Dajjal, and from the trials of life and death, and from the heat of Hell.)'\"",
      "usc_msa_ref": "",
      "chain": [
        "30443",
        "20029",
        "20377",
        "11411",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-600",
      "hadith_no": "600",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا حرملة بن يحيى، وعمرو بن سواد المصريان، قالا حدثنا عبد الله بن وهب، أنبأنا يحيى بن أيوب، عن عبد الرحمن بن رزين، عن محمد بن يزيد بن أبي زياد، عن أيوب بن قطن، عن عبادة بن نسى، عن أبى بن عمارة، - وكان رسول الله  صلى الله عليه وسلم  قد صلى في بيته القبلتين كلتيهما - أنه قال لرسول الله  صلى الله عليه وسلم  أمسح على الخفين قال ‏\"‏ نعم ‏\"‏ ‏.‏ قال يوما قال ‏\"‏ ويومين ‏\"‏ ‏.‏ قال وثلاثا حتى بلغ سبعا قال له ‏\"‏ وما بدا لك ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ubayy bin 'Imarah, in whose house the Messenger of Allah performed prayer facing both prayer direction, that :                     He said to the Messenger of Allah: \"Can I wipe over my leather socks?\" He said: \"Yes.\" He said: \"For one day?\" He said: \"For two days?\" He said: \"For three?\" And so on, until the number reached seven. He (the Prophet) said: \"For as long as you see fit.\"",
      "usc_msa_ref": "",
      "chain": [
        "30487",
        "30443",
        "20029",
        "20379",
        "28545",
        "18069"
      ]
    },
    {
      "id": "sunan-ibn-majah-1706",
      "hadith_no": "1706",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا عمرو بن سواد المصري، حدثنا عبد الله بن وهب، عن عمرو بن الحارث، عن سعيد بن أبي هلال، عن زيد بن أيمن، عن عبادة بن نسى، عن أبي الدرداء، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ أكثروا الصلاة على يوم الجمعة فإنه مشهود تشهده الملائكة وإن أحدا لن يصلي على إلا عرضت على صلاته حتى يفرغ منها ‏\"‏ ‏.‏ قال قلت وبعد الموت قال ‏\"‏ وبعد الموت إن الله حرم على الأرض أن تأكل أجساد الأنبياء ‏\"‏ ‏.‏ فنبي الله حى يرزق ‏.‏",
      "text_en": " It wasnarrated from Abu Darda’ that the Messenger of Allah (ﷺ)said:                     “Send a great deal of blessing upon me on Fridays, for it iswitnessed by the angels. No one sends blessing upon me but hisblessing will be presented to me, until he finishes them.” A mansaid:“Even after death?” He said: “Even after death, for Allahhasforbidden the earth to consume the bodies of the Prophets, so theProphet of Allah is alive and receives provision.’”",
      "usc_msa_ref": "",
      "chain": [
        "30443",
        "20029",
        "20377",
        "11169",
        "18320",
        "37"
      ]
    },
    {
      "id": "sunan-ibn-majah-1859",
      "hadith_no": "1859",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters Regarding Zakat - كتاب الزكاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عمرو بن سواد المصري، حدثنا عبد الله بن وهب، عن ابن لهيعة، عن عقيل، عن ابن شهاب، حدثني خالد بن أسلم، مولى عمر بن الخطاب قال خرجت مع عبد الله بن عمر فلحقه أعرابي فقال له قول الله ‏{والذين يكنزون الذهب والفضة ولا ينفقونها في سبيل الله}‏ قال له ابن عمر من كنزها فلم يؤد زكاتها فويل له إنما كان هذا قبل أن تنزل الزكاة فلما أنزلت جعلها الله طهورا للأموال ‏.‏ ثم التفت فقال ما أبالي لو كان لي أحد ذهبا أعلم عدده وأزكيه وأعمل فيه بطاعة الله عز وجل ‏.‏",
      "text_en": " Khalid bin Aslam, the freed slave of Umar bin Khattab, said:                     “I went out with Abdullah bin Umar, and a Bedouin met him and recited to him the words of Allah: 'And those who hoard up gold and silver (the money, the Zakah of which has not been paid) and spend them not in the way of Allah.' Ibn Umar Said to him: 'The one who hoards it and does not pay Zakat due on it, woe to him. But this was before the (ruling on) Zakat was revealed. When it was revealed, Allah made it a purification of wealth.' Then he turned away and said: 'I do not mind if I have the (the equivalent of) Uhud in gold, provided that I know how much it is and I pay Zakat on it, and I use it in obedience of Allah, the Mighty and Sublime'”",
      "usc_msa_ref": "",
      "chain": [
        "30443",
        "20029",
        "20624",
        "11207",
        "11013"
      ]
    },
    {
      "id": "sunan-ibn-majah-1882",
      "hadith_no": "1882",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters Regarding Zakat - كتاب الزكاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عمرو بن سواد المصري، حدثنا ابن وهب، أخبرني عمرو بن الحارث، أن موسى بن جبير، حدثه أن عبد الله بن عبد الرحمن بن الحباب الأنصاري حدثه أن عبد الله بن أنيس حدثه أنه، تذاكر هو وعمر بن الخطاب يوما الصدقة فقال عمر ألم تسمع رسول الله  صلى الله عليه وسلم  حين يذكر غلول الصدقة ‏\"‏ أنه من غل منها بعيرا أو شاة أتي به يوم القيامة يحمله ‏\"‏ ‏.‏ قال فقال عبد الله بن أنيس بلى ‏.‏",
      "text_en": " Abdullah bin Unais said that he and Umar bin Khattab were speaking about Sadaqah one day, and:                     Umar bin Khattab said: “Did you not hear the Messenger of Allah when he mentioned Ghulul with the Sadaqah (and said): 'Whoever steals a camel or a sheep from it, he will be brought carrying it on the Day of Resurrection?' ” Abdullah bin Unais said: “Yes.”",
      "usc_msa_ref": "",
      "chain": [
        "30443",
        "20029",
        "20377",
        "21181",
        "1048"
      ]
    },
    {
      "id": "sunan-ibn-majah-1886",
      "hadith_no": "1886",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters Regarding Zakat - كتاب الزكاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عمرو بن سواد المصري، حدثنا عبد الله بن وهب، أخبرني سليمان بن بلال، عن شريك بن أبي نمر، عن عطاء بن يسار، عن معاذ بن جبل، أن رسول الله  صلى الله عليه وسلم  بعثه إلى اليمن وقال له ‏\"‏ خذ الحب من الحب والشاة من الغنم والبعير من الإبل والبقرة من البقر ‏\"‏ ‏.‏",
      "text_en": " Mu'adh bin Jabal narrated that:                     the Messenger of Allah sent him to Yemen and said to him: “Take grains from grains, sheep from sheep, camels from camels and cows from cows”",
      "usc_msa_ref": "",
      "chain": [
        "30443",
        "20029",
        "20160",
        "11858",
        "11020",
        "32"
      ]
    },
    {
      "id": "sunan-ibn-majah-4131",
      "hadith_no": "4131",
      "source": "Sunan Ibn Majah",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا عمرو بن سواد المصري، أخبرني عبد الله بن وهب، أنبأنا عمرو بن الحارث، أن بكر بن سوادة، حدثه أن يزيد بن رباح حدثه عن عبد الله بن عمرو بن العاص، عن رسول الله  صلى الله عليه وسلم  أنه قال ‏\"‏ إذا فتحت عليكم خزائن فارس والروم أى قوم أنتم ‏\"‏ ‏.‏ قال عبد الرحمن بن عوف نقول كما أمرنا الله ‏.‏ قال رسول الله  صلى الله عليه وسلم  ‏\"‏ أو غير ذلك تتنافسون ثم تتحاسدون ثم تتدابرون ثم تتباغضون أو نحو ذلك ثم تنطلقون في مساكين المهاجرين فتجعلون بعضهم على رقاب بعض ‏\"‏ ‏.‏",
      "text_en": " It was narrated from ‘Abdullah bin ‘Amr bin ‘As that theMessenger ofAllah (ﷺ) said:                      “When the treasures of Persia andRome are openedfor you, what kind of people will you be?”‘Abdur-Rahman bin ‘Awfsaid: “We will say what Allah hascommanded us to say.” The Messengerof Allah (ﷺ) said: “Orsomething other than that. You will competewith one another, thenyou will envy one another, then you will turnyour backs on oneanother, then you will hate one another, orsomething like that. Thenyou will go to the poor among the Muhajirunand appoint some of themas leaders of others.”",
      "usc_msa_ref": "",
      "chain": [
        "30443",
        "20029",
        "20377",
        "10849",
        "29"
      ]
    }
  ],
  "total_hadiths": 46
}