{
  "id": "30448",
  "name": "Muhammad bin 'Abdullah محمد بن عبد الله بن بزيع",
  "full_name": "Muhammad bin 'Abdullah محمد بن عبد الله بن بزيع",
  "grade": "3rd Century AH [10th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "247",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  ت  س  -  ثقة ]"
    ],
    "tags": [
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20258",
      "name": "'Abdul Warith bin Sa'id bin Dhakwan عبد الوارث بن سعيد بن ذكوان",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20271",
      "name": "Fdyl bin Sulaiman al-Nmyry فضيل بن سليمان النميري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20259",
      "name": "'Abdul Wahab bin 'Abdul Majeed al-Thaqaf عبد الوهاب بن عبد المجيد الثقفي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20246",
      "name": "'Abdul A'ala bin 'Abdul A'ala al-Sami عبد الأعلى بن عبد الأعلى البصري السامي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20288",
      "name": "Ma'tmar bin Sulaiman-al-Taufayl معتمر بن سليمان - الطفيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20276",
      "name": "Muhammad bin Abi 'Adi محمد بن أبي عدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20304",
      "name": "Yazid bin Zari' يزيد بن زريع",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20212",
      "name": "Bashr bin Muhammad al-Sakhtiyani بشر بن محمد السختياني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20230",
      "name": "Ziyad bin al-Rabi' al-Yhmdy زياد بن الربيع اليحمدي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "students": [
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]"
    },
    {
      "id": "30005",
      "name": "Imam Tirmidhi الترمذي محمد بن عيسى بن سورة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30006",
      "name": "Imam Nasa'i أحمد بن شعيب بن علي بن سنان النسائي",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30218",
      "name": "Musa bin Harun bin Bashyr موسى بن هارون بن بشير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30013",
      "name": "Ibn Abi Dunya ابن أبي الدنيا",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30349",
      "name": "'Abdullah bin 'Uthman - ''Aabadan عبد الله بن عثمان - عبدان",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "40010",
      "name": "Muhammad bin Jarir At-Tabari أبو جعفر محمد بن جرير الطبري",
      "grade": "4th Century AH [Other]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "274",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثني محمد بن عبد الله بن بزيع، حدثنا يزيد، - يعني ابن زريع - حدثنا حميد الطويل، حدثنا بكر بن عبد الله المزني، عن عروة بن المغيرة بن شعبة، عن أبيه، قال تخلف رسول الله صلى الله عليه وسلم وتخلفت معه فلما قضى حاجته قال ‏\"‏ أمعك ماء ‏\"‏ ‏.‏ فأتيته بمطهرة فغسل كفيه ووجهه ثم ذهب يحسر عن ذراعيه فضاق كم الجبة فأخرج يده من تحت الجبة وألقى الجبة على منكبيه وغسل ذراعيه ومسح بناصيته وعلى العمامة وعلى خفيه ثم ركب وركبت فانتهينا إلى القوم وقد قاموا في الصلاة يصلي بهم عبد الرحمن بن عوف وقد ركع بهم ركعة فلما أحس بالنبي صلى الله عليه وسلم ذهب يتأخر فأومأ إليه فصلى بهم فلما سلم قام النبي صلى الله عليه وسلم وقمت فركعنا الركعة التي سبقتنا ‏.‏",
      "text_en": " 'Urwa b. al Mughira b. Shu'ba reported it on the authority of his father that he said:                      The Messenger of Allah (may peace be upon him) lagged behind (in a journey) and I also lagged behind along with him. After having relieved himself he said: Have you any water with you? I brought to him a jar of water; he washed his palms, and face, and when he tried to get his forearms out (he could not) for the sleeve of the gown was tight. He, therefore, brought them out from under the gown and, throwing it over his shoulders, he washed his forearm. He then wiped his forelock and his turban and his socks. He then mounted and I also mounted (the ride) and came to the people. They had begun the prayer with 'Abd ar-Rabmin b. 'Anf leading them and had completed a rak'a. When he perceived the presence of the Apostle of Allah (may peace be upon him) he began to retire. He (the Holy Prophet) signed to him to continue and offered prayer along with them. Then when he had pronounced the salutation, the Apostle (may peace be upon him) got up and I also got up with him, and we offered the rak'a which had been finished before we came.",
      "chain": [
        "30448",
        "20304",
        "11279",
        "11267",
        "11373",
        "166"
      ]
    },
    {
      "hadith_no": "421",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن عبد الله بن بزيع، أخبرنا عبد الأعلى، حدثنا عبيد الله، عن أبي حازم، عن سهل بن سعد الساعدي، قال ذهب نبي الله صلى الله عليه وسلم يصلح بين بني عمرو بن عوف ‏.‏ بمثل حديثهم وزاد فجاء رسول الله صلى الله عليه وسلم فخرق الصفوف حتى قام عند الصف المقدم ‏.‏ وفيه أن أبا بكر رجع القهقرى ‏.‏",
      "text_en": " Sahl b. Sa'd al-Sa'idi reported:                      The Apostle of Allah (may peace be upon him) went to Bani Amr b. 'Auf in order to bring about reconciliation amongst them. The rest of the hadith is the same but with (the addition of these words):\" The Messenger of Allah (may peace be upon him) came and made his way through the rows till he came to the first row and Abu Bakr retraced his steps.\"",
      "chain": [
        "30448",
        "20246",
        "11201",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "6122",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثني محمد بن عبد الله بن بزيع، حدثنا ابن أبي عدي، عن شعبة، عن معبد، بن خالد عن حارثة، أنه سمع النبي صلى الله عليه وسلم قال ‏\"‏ حوضه ما بين صنعاء والمدينة ‏\"‏ ‏.‏ فقال له المستورد ألم تسمعه قال ‏\"‏ الأواني ‏\"‏ ‏.‏ قال لا ‏.‏ فقال المستورد ‏\"‏ ترى فيه الآنية مثل الكواكب ‏\"‏ ‏.‏",
      "text_en": " Haritha reported that he heard Allah's Messenger (may peace be upon him) as saying:                      His Cistern would be as extensive as the distance between San'a' and Medina. Mustaurid (one of the narrators) said: Did you not hear anything about the utensils? Thereupon he said. No. Mustaurid said: You would find that the utensils would be like stars.",
      "chain": [
        "30448",
        "20276",
        "20020",
        "11396",
        "4109"
      ]
    },
    {
      "hadith_no": "1620",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Virtues of Jihad - كتاب فضائل الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "22",
      "text_ar": "حدثنا محمد بن عبد الله بن بزيع، حدثنا المعتمر بن سليمان، حدثني مرزوق أبو بكر، عن قتادة، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم يعني ‏\"‏ يقول الله عز وجل المجاهد في سبيل الله هو على ضامن إن قبضته أورثته الجنة وإن رجعته رجعته بأجر أو غنيمة ‏\"‏ ‏.‏ قال هو صحيح غريب من هذا الوجه ‏.",
      "text_en": " Narrated Anas bin Malik:                     \"The Messenger of Allah (ﷺ) said: meaning: Allah Mighty and Sublime is He says: 'The Mujahid in My cause, he has guarantee fro Me. If I I seize him, I cause him to inherit Paradise, and if I return him, I return him with a reward or spoils of war.'\"[He said:] This Hadith is Gharib Sahih from this route.",
      "chain": [
        "30448",
        "20288",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "2143",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا محمد بن عبد الله بن بزيع، حدثنا بشر بن المفضل، عن قرة بن خالد، عن أبي جمرة، عن ابن عباس، أن النبي صلى الله عليه وسلم قال لأشج عبد القيس ‏\"‏ إن فيك خصلتين يحبهما الله الحلم والأناة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏ وفي الباب عن الأشج العصري ‏.‏",
      "text_en": " Ibn 'Abbas narrated that the Messenger of Allah said to the Ashajj 'Abdul-Qais:                     \"Indeed there are two traits in you that Allah loves: Forbearance, and deliberateness.\"",
      "chain": [
        "30448",
        "20212",
        "11301",
        "11309",
        "17"
      ]
    },
    {
      "hadith_no": "2635",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا محمد بن عبد الله بن بزيع، حدثنا زياد بن الربيع، حدثنا أبو عمران الجوني، عن أنس بن مالك، قال ما أعرف شيئا مما كنا عليه على عهد النبي صلى الله عليه وسلم ‏.‏ فقلت أين الصلاة قال أولم تصنعوا في صلاتكم ما قد علمتم ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه من حديث أبي عمران الجوني وقد روي من غير وجه عن أنس ‏.‏",
      "text_en": " Abu 'Imaran Al-Jawni narrated :                     \"From Anas bin Malik who said : 'I do not recognize anything (today) from what we were upon during the time of The Messenger of Allah (s.a.w).' So I said : 'What about the Salat?' He said: 'Have you (people) not done what you know (you have done)?'\"",
      "chain": [
        "30448",
        "20230",
        "11296",
        "19"
      ]
    },
    {
      "hadith_no": "2634",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Faith - كتاب الإيمان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "40",
      "text_ar": "حدثنا محمد بن عبد الله بن بزيع، حدثنا عبد الحكيم بن منصور الواسطي، عن عبد الملك بن عمير، عن عبد الرحمن بن عبد الله بن مسعود، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ قتال المسلم أخاه كفر وسبابه فسوق ‏\"‏ ‏.‏ وفي الباب عن سعد وعبد الله بن مغفل ‏.‏ قال أبو عيسى حديث ابن مسعود حديث حسن صحيح ‏.‏ وقد روي عن عبد الله بن مسعود من غير وجه ‏.‏",
      "text_en": " Narrated Ibn Mas'ud:                     that the Messenger of Allah (ﷺ) said: \"A Muslim's fighting his brother is disbelief, and verbally abusing him is disobedience.\"",
      "chain": [
        "30448",
        "11368",
        "11363",
        "16"
      ]
    },
    {
      "hadith_no": "3431",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا محمد بن عبد الله بن بزيع، حدثنا عبد الوارث بن سعيد، عن عمرو بن دينار، مولى آل الزبير عن سالم بن عبد الله بن عمر، عن ابن عمر، عن عمر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من رأى صاحب بلاء فقال الحمد لله الذي عافاني مما ابتلاك به وفضلني على كثير ممن خلق تفضيلا إلا عوفي من ذلك البلاء كائنا ما كان ما عاش ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏ وفي الباب عن أبي هريرة ‏.‏ وعمرو بن دينار قهرمان آل الزبير هو شيخ بصري وليس هو بالقوي في الحديث ‏.‏ وقد تفرد بأحاديث عن سالم بن عبد الله بن عمر ‏.‏ وقد روي عن أبي جعفر محمد بن علي أنه قال إذا رأى صاحب بلاء فتعوذ منه يقول ذلك في نفسه ولا يسمع صاحب البلاء ‏.‏",
      "text_en": " Umar narrated that:                     The Messenger of Allah said: “Whoever sees a person afflicted and say: ‘All praise is due to Allah Who saved me from that which He has afflicted you with, and blessed me greatly over many of those whom He has created, (Al-Hamdulillahi Alladhi Afani Mimmabtalaka Bihi Wa Faddalani Ala Kathirin Mimman Khalaqa Tafdila)’ then he shall be saved from that affliction for as long as he lives.”",
      "chain": [
        "30448",
        "20258",
        "11081",
        "11011",
        "18",
        "3"
      ]
    },
    {
      "hadith_no": "4229",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن عبد الله بن بزيع، حدثنا الفضيل بن سليمان، حدثنا أبو حازم، عن سهل بن سعد، قال كنا مع رسول الله صلى الله عليه وسلم وهو يحفر الخندق ونحن ننقل التراب فيمر بنا فقال ‏\"‏ اللهم لا عيش إلا عيش الآخرة فاغفر للأنصار والمهاجرة ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح غريب من هذا الوجه ‏.‏ وأبو حازم اسمه سلمة بن دينار الأعرج الزاهد ‏.‏ قال وفي الباب عن أنس بن مالك ‏.‏",
      "text_en": " Narrated Sahl bin Sa'd:                     \"We were with the Messenger of Allah (ﷺ) while he was excavating the trench, and we were transporting the soil. He passed by us and said: 'O Allah! There is no life but the life of the Hereafter! So forgive the Ansar and the Emigrants.'\"",
      "chain": [
        "30448",
        "20271",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "595",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا محمد بن عبد الله بن بزيع، قال حدثنا يزيد بن زريع، قال حدثنا كثير بن قاروندا، قال سألت سالم بن عبد الله عن صلاة، أبيه في السفر وسألناه هل كان يجمع بين شىء من صلاته في سفره فذكر أن صفية بنت أبي عبيد كانت تحته فكتبت إليه وهو في زراعة له أني في آخر يوم من أيام الدنيا وأول يوم من الآخرة ‏.‏ فركب فأسرع السير إليها حتى إذا حانت صلاة الظهر قال له المؤذن الصلاة يا أبا عبد الرحمن ‏.‏ فلم يلتفت حتى إذا كان بين الصلاتين نزل فقال أقم فإذا سلمت فأقم ‏.‏ فصلى ثم ركب حتى غابت الشمس قال له المؤذن الصلاة ‏.‏ فقال كفعلك في صلاة الظهر والعصر ‏.‏ ثم سار حتى إذا اشتبكت النجوم نزل ثم قال للمؤذن أقم فإذا سلمت فأقم ‏.‏ فصلى ثم انصرف فالتفت إلينا فقال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا حضر أحدكم الأمر الذي يخاف فوته فليصل هذه الصلاة ‏\"‏ ‏.‏",
      "text_en": " Kathir bin Qarawanda said:                      \"I asked Salim bin 'Abdullah about how his father prayed when traveling. We asked him: 'Did he combine any of his prayers when traveling?' He said that Safiyyah bint Abi 'Ubaid was married to him, and she wrote to him, when he was at some farmland of his, saying: 'This is the last of my days in this world, and the first day of the Hereafter.\" [1] He rode quickly to go to her, and when the time for Zuhr came, the Mu'adhdhin said to him: \"The prayer, O Abu 'Abdur-Rahman!\" But he paid no attention to him until it was between the time for the two prayers, then he stopped and said: \"Say the Iqamah and when I say the Taslim, say the Iqamah.\" Then he rode on again, and when the sun set the Mu'adhdhin said to him; \"The prayer!\" He said: \"Do as you did for Zuhr and 'Asr.\" When the stars had appeared, he stopped and said to the Mu'adhdhin: \"Say the Iqamah and when I say the Taslim, say the Iqamah.\" He prayed, then when he had finished he turned to us and said: \"The Messenger of Allah (ﷺ) said: 'If any one of you has an urgent need that he fears he may miss, let him pray like this.'\"[1] Meaning that she was dying.",
      "chain": [
        "30448",
        "20304",
        "11011"
      ]
    },
    {
      "hadith_no": "1107",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا محمد بن عبد الله بن بزيع، قال حدثنا معتمر بن سليمان، عن عمران، عن أبي مجلز، عن بشير بن نهيك، عن أبي هريرة، قال لو كنت بين يدى رسول الله صلى الله عليه وسلم لأبصرت إبطيه ‏.‏ قال أبو مجلز كأنه قال ذلك لأنه في صلاة ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"If I were in front of the Messenger of Allah (ﷺ) I would be able to see the whiteness of his armpits.\" (One of the narrators) Abu Mijlaz said: \"It is as if he said that because he was praying.\"",
      "chain": [
        "30448",
        "20288",
        "123",
        "11313",
        "11266",
        "13"
      ]
    },
    {
      "hadith_no": "1183",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا محمد بن عبد الله بن بزيع، قال حدثنا عبد الأعلى بن عبد الأعلى، قال حدثنا عبيد الله، - وهو ابن عمر - عن أبي حازم، عن سهل بن سعد، قال انطلق رسول الله صلى الله عليه وسلم يصلح بين بني عمرو بن عوف فحضرت الصلاة فجاء المؤذن إلى أبي بكر فأمره أن يجمع الناس ويؤمهم فجاء رسول الله صلى الله عليه وسلم فخرق الصفوف حتى قام في الصف المقدم وصفح الناس بأبي بكر ليؤذنوه برسول الله صلى الله عليه وسلم وكان أبو بكر لا يلتفت في الصلاة فلما أكثروا علم أنه قد نابهم شىء في صلاتهم فالتفت فإذا هو برسول الله صلى الله عليه وسلم فأومأ إليه رسول الله صلى الله عليه وسلم أى كما أنت فرفع أبو بكر يديه فحمد الله وأثنى عليه لقول رسول الله صلى الله عليه وسلم ثم رجع القهقرى وتقدم رسول الله صلى الله عليه وسلم فصلى فلما انصرف قال لأبي بكر ‏\"‏ ما منعك إذ أومأت إليك أن تصلي ‏\"‏ ‏.‏ فقال أبو بكر رضى الله عنه ما كان ينبغي لابن أبي قحافة أن يؤم رسول الله صلى الله عليه وسلم ‏.‏ ثم قال للناس ‏\"‏ ما بالكم صفحتم إنما التصفيح للنساء ‏\"‏ ‏.‏ ثم قال ‏\"‏ إذا نابكم شىء في صلاتكم فسبحوا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Sahl bin Sa'd said:                     \"The Messenger of Allah (ﷺ) set out to bring about reconciliation among Banu 'Amr bin 'Awf. The time for prayer came, and the Mu'adhdhin went to Abu Bakr to tell him to gather the people and lead them in prayer. Then the Messenger of Allah (ﷺ) came and passed though the rows until he stood in the first row. The people started clapping to let Abu Bakr know that the Messenger of Allah (ﷺ) had come. Abu Bakr never used to turn around when he prayed, but when they clapped consistently he realized something must have happened while they were praying. So he turned around and saw the Messenger of Allah (ﷺ). The Messenger of Allah (ﷺ) gestured to him to stay where he was. Abu Bakr raised his hands and praised and thanked Allah (SWT) for what the Messenger of Allah (ﷺ) had said. Then, he moved backwards, and the Messenger of Allah (ﷺ) went forward and prayed. When he finished, he said to Abu Bakr: 'What stopped you from continuing to pray when I gestured to you?' Abu Bakr, may Allah (SWT) be pleased with him, said: 'It was not appropriate for the son of Abu Quhafah to lead the Messenger of Allah (ﷺ) in prayer.' Then he said to the people: 'Why did you clap?' Clapping is for women.' Then he said: 'If you notice something when you are praying, say \"SubhanAllah.'\"",
      "chain": [
        "30448",
        "20246",
        "11201",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "Grade",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرنا محمد بن عبد الله بن بزيع، قال حدثنا يزيد، - يعني ابن زريع - قال حدثنا إسرائيل، قال حدثنا سماك، عن جابر بن سمرة، قال رأيت رسول الله صلى الله عليه وسلم يخطب يوم الجمعة قائما ثم يقعد قعدة لا يتكلم ثم يقوم فيخطب خطبة أخرى فمن حدثكم أن رسول الله صلى الله عليه وسلم كان يخطب قاعدا فقد كذب ‏.‏",
      "text_en": " It was narrated that Jabir bin Samurah said:                     \"I saw the Messenger of Allah (ﷺ) delivering the khutbah on Friday standing, then he sat briefly and did not speak, then he stood up and delivered a second khutbah. So whoever tells you that the Messenger of Allah (ﷺ) used to deliver the khutbah seated, he has lied.\"",
      "chain": [
        "30448",
        "20304",
        "20311",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "2521",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا محمد بن معدان بن عيسى، قال حدثنا الحسن، حدثنا زهير، حدثنا موسى، ح قال وأنبأنا محمد بن عبد الله بن بزيع، قال حدثنا الفضيل، قال حدثنا موسى، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم أمر بصدقة الفطر أن تؤدى قبل خروج الناس إلى الصلاة ‏.‏ قال ابن بزيع بزكاة الفطر ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that:                     the Messenger of Allah enjoined that Sadaqatul Fitr should be given before the people go out to pray. (One of the narratorsP: Ibn Bazi'said: \"Zakatul-Fitr.\"",
      "chain": [
        "38591",
        "11016",
        "20321",
        "20040",
        "30448",
        "20271",
        "20040",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3067",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن عبد الله بن بزيع، قال حدثنا يزيد، - وهو ابن زريع - قال حدثنا خالد، عن عكرمة، عن ابن عباس، قال كان رسول الله صلى الله عليه وسلم يسأل أيام منى فيقول ‏\"‏ لا حرج ‏\"‏ ‏.‏ فسأله رجل فقال حلقت قبل أن أذبح ‏.‏ قال ‏\"‏ لا حرج ‏\"‏ ‏.‏ فقال رجل رميت بعد ما أمسيت ‏.‏ قال ‏\"‏ لا حرج ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn abbas said:                     \"The Mesenger of Allah was asked questions during the days of Mina and he said: 'There is no harm.' A man said: 'I shaved my head before offering the sacrifice.' He said: 'There is no harm.' Another man said: 'I stoned (the Majarat) after evening came.' He said: \"There is no harm.'\"",
      "chain": [
        "30448",
        "20304",
        "11282",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "3099",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا محمد بن عبد الله بن بزيع، قال حدثنا بشر، - يعني ابن المفضل - قال أنبأنا عبد الرحمن بن إسحاق، عن الزهري، عن سهل بن سعد، قال رأيت مروان بن الحكم جالسا فجئت حتى جلست إليه فحدثنا أن زيد بن ثابت حدثه أن رسول الله صلى الله عليه وسلم أنزل عليه لا يستوي القاعدون من المؤمنين والمجاهدون في سبيل الله ‏.‏ فجاء ابن أم مكتوم وهو يملها على فقال يا رسول الله لو أستطيع الجهاد لجاهدت فأنزل الله عز وجل وفخذه على فخذي فثقلت على حتى ظننت أن سترض فخذي ثم سري عنه ‏{‏ غير أولي الضرر ‏}‏ قال أبو عبد الرحمن عبد الرحمن بن إسحاق هذا ليس به بأس وعبد الرحمن بن إسحاق يروي عنه علي بن مسهر وأبو معاوية وعبد الواحد بن زياد عن النعمان بن سعد ليس بثقة ‏.‏",
      "text_en": " It was narrated that Sahl bin Sa'd said:                      \"I saw Marwan bin Al-Hakam sitting and I came and sat with him. He told us that Zaid bin Thabit told him, that the following was revealed to Allah's Messenger (ﷺ): (Not equal are those of the believers who sit (at home) and those who strive hard and fight in the cause of Allah), then Ibn Umm Maktum came when he was dictating it to me (Zaid), and said: 'O Messenger of Allah! If I were able to go for Jihad I would go out for Jihad.' Then Allah, the Mighty and Sublime, revealed to him - while his thigh was against mine, and became so heavy that I thought my thigh would break, until (the revelation) stopped -: 'Except those who are disabled (by injury or are blind or lame).'\" [1]Abu 'Abdur-Rahman (An-Nasa'i) said: This 'Abdur-Rahman bin Ishaq is tolerable, while 'Abdur-Rahman bin IShaq, from whom reports 'Ali bin Mushir, abu Mu'awiyah, and 'Abdul-Wahid bin Ziyad from An-Nu'man bin Sa'd - he is not trustworthy.[1] An-Nisa' 4:95.",
      "chain": [
        "30448",
        "20212",
        "11876",
        "11013",
        "399",
        "49"
      ]
    },
    {
      "hadith_no": "3311",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا محمد بن عبد الله بن بزيع، قال حدثنا يزيد، - يعني ابن زريع - قال حدثنا سعيد، عن قتادة، قال كتبنا إلى إبراهيم بن يزيد النخعي نسأله عن الرضاع، فكتب أن شريحا، حدثنا أن عليا وابن مسعود كانا يقولان يحرم من الرضاع قليله وكثيره ‏.‏ وكان في كتابه أن أبا الشعثاء المحاربي حدثنا أن عائشة حدثته أن نبي الله صلى الله عليه وسلم كان يقول ‏\"‏ لا تحرم الخطفة والخطفتان ‏\"‏ ‏.‏",
      "text_en": " Sa'eed narrated from Qatadah:                      \"We wrote to Ibrahim bin Yazid An-Nakha'i asking him about breast-feeding. He wrote back saying that Shuraih had narrated that 'Ali and Ibn Mas'ud used to say: 'A little or a lot of breast-feeding makes marriage prohibited.'\" In his book, it said that Abu Ash-Sha'tha' Al-Muharibi narrated that 'Aishah had told him that the Prophet of Allah used to say: \"Suckling (Al-Khatfah) once or twice does not make (marriage) prohibited.\"",
      "chain": [
        "30448",
        "20304",
        "11168",
        "11019",
        "11351"
      ]
    },
    {
      "hadith_no": "3364",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا محمد بن عبد الله بن بزيع، قال حدثنا يزيد، قال حدثنا سعيد، عن قتادة، عن الحسن، عن سلمة بن المحبق، أن رجلا، غشي جارية لامرأته فرفع ذلك إلى رسول الله صلى الله عليه وسلم فقال ‏\"‏ إن كان استكرهها فهي حرة من ماله وعليه الشروى لسيدتها وإن كانت طاوعته فهي لسيدتها ومثلها من ماله ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Salamah bin Al-Muhabbaq that a man had intercourse with a slave woman belonging to his wife, and was brought to the Messenger of Allah. He said:                      \"If he forced her, then she is free at his expense and he has to give her mistress a similar slave as a replacement. If she obeyed him in that, then she belongs to her mistress, and he has to give her mistress a similar slave as well.\"",
      "chain": [
        "30448",
        "20304",
        "11168",
        "11019",
        "11016",
        "5071"
      ]
    },
    {
      "hadith_no": "3479",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا محمد بن عبد الله بن بزيع، قال حدثنا يزيد بن زريع، قال حدثنا معمر، عن الزهري، عن سعيد بن المسيب، عن أبي هريرة، قال جاء رجل من بني فزارة إلى النبي صلى الله عليه وسلم فقال إن امرأتي ولدت غلاما أسود ‏.‏ وهو يريد الانتفاء منه ‏.‏ فقال ‏\"‏ هل لك من إبل ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ ما ألوانها ‏\"‏ ‏.‏ قال حمر ‏.‏ قال ‏\"‏ هل فيها من أورق ‏\"‏ ‏.‏ قال فيها ذود ورق ‏.‏ قال ‏\"‏ فما ذاك ترى ‏\"‏ ‏.‏ قال لعله أن يكون نزعها عرق ‏.‏ قال ‏\"‏ فلعل هذا أن يكون نزعه عرق ‏\"‏ ‏.‏ قال فلم يرخص له في الانتفاء منه ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                      \"A man from Banu Fazarah came to the Prophet and said: 'My wife has given birth to a black boy' -and he wanted to disown him. He said: 'Do you have camels?' He said: 'Yes.' He said: 'What color are they?' He said: 'Red.' He said: 'Are there any gray ones among them?' He said: 'There are some gray camels among them.' He said: 'Why is that do you think?' He said: 'Perhaps it is hereditary.' He said: 'Perhaps this is hereditary.' And he did not permit him to disown him.\"",
      "chain": [
        "30448",
        "20304",
        "20115",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "3511",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرني محمد بن عبد الله بن بزيع، قال حدثنا يزيد، - وهو ابن زريع - قال حدثنا حجاج، قال حدثنا يحيى بن أبي كثير، قال حدثني أبو سلمة بن عبد الرحمن، قال قيل لابن عباس في امرأة وضعت بعد وفاة زوجها بعشرين ليلة أيصلح لها أن تزوج قال لا إلا آخر الأجلين ‏.‏ قال قلت قال الله تبارك وتعالى ‏{‏ وأولات الأحمال أجلهن أن يضعن حملهن ‏}‏ فقال إنما ذلك في الطلاق ‏.‏ فقال أبو هريرة أنا مع ابن أخي ‏.‏ يعني أبا سلمة ‏.‏ فأرسل غلامه كريبا فقال ائت أم سلمة فسلها هل كان هذا سنة من رسول الله صلى الله عليه وسلم فجاء فقال قالت نعم سبيعة الأسلمية وضعت بعد وفاة زوجها بعشرين ليلة فأمرها رسول الله صلى الله عليه وسلم أن تزوج فكان أبو السنابل فيمن يخطبها ‏.‏",
      "text_en": " Abu Salamah bin 'Abdur-Rahman said:                      \"It was said to Ibn 'Abbas concerning a woman who gives birth one day after her husband died: 'Can she get married?' He said: 'No, not until the longer of the two periods has ended.' He said: 'Allah says: And for those who are pregnant (whether they are divorced or their husbands are dead), their 'Iddah (prescribed period) is until they lay down their burden.' He said: 'That only applies in the case of divorce.' Abu Hurairah said: 'I agree with my brother's son' --meaning, Abu Salamah. He sent his slave Kuraib and told him: 'Go to Umm Salamah and ask her: Was this the Sunnah of the Messenger of Allah?' He came back and said: 'Yes, Subai'ah Al-Aslamiyyah gave birth twenty days after her husband died, and the Messenger of Allah told her to get married, and Abu As-Sanabil was one of those who proposed marriage to her.'\"",
      "chain": [
        "30448",
        "20304",
        "20219",
        "11449",
        "10567"
      ]
    },
    {
      "hadith_no": "3590",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Horses, Races and Shooting - كتاب الخيل",
      "chapter_no": "28",
      "text_ar": "أخبرنا محمد بن عبد الله بن بزيع، قال حدثنا يزيد، - وهو ابن زريع - قال حدثنا حميد، قال حدثنا الحسن، عن عمران بن حصين، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا جلب ولا جنب ولا شغار في الإسلام ومن انتهب نهبة فليس منا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Imran bin Husain that the Messenger of Allah said:                      \"There is no 'bringing', no 'avoidance' and no Shighar in Islam, and whoever robs is not one of us.\"",
      "chain": [
        "30448",
        "20304",
        "11279",
        "11016",
        "123"
      ]
    },
    {
      "hadith_no": "3770",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا قتيبة، قال حدثنا ابن أبي عدي، عن خالد، ح وأنبأنا محمد بن عبد الله بن بزيع، قال حدثنا يزيد، قال حدثنا خالد، عن أبي قلابة، عن ثابت بن الضحاك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من حلف بملة سوى الإسلام كاذبا فهو كما قال ‏\"‏ ‏.‏ قال قتيبة في حديثه متعمدا وقال يزيد ‏\"‏ كاذبا فهو كما قال ومن قتل نفسه بشىء عذبه الله به في نار جهنم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Thabit bin Ad-Dahhak said:                      \"The Messenger of Allah said: 'Whoever swears by a religion other than Islam, telling a lie, will be as he said.'\"  In his narration, Qutaibah said: \"Intentionally.\" Yazid said: \"Telling a lie will be as he said, and whoever kills himself with something. Allah will punish him with it in the Fire of Hell.\"",
      "chain": [
        "30367",
        "20276",
        "11282",
        "30448",
        "20304",
        "11282",
        "11047",
        "1902"
      ]
    },
    {
      "hadith_no": "3908",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا محمد بن عبد الله بن بزيع، قال حدثنا فضيل، قال حدثنا موسى بن عقبة، قال أخبرني نافع، أن رافع بن خديج، أخبر عبد الله بن عمر، أن عمومته، جاءوا إلى رسول الله صلى الله عليه وسلم ثم رجعوا فأخبروا أن رسول الله صلى الله عليه وسلم نهى عن كراء المزارع‏.‏‏ فقال عبد الله قد علمنا أنه كان كل صاحب مزرعة يكريها على عهد رسول الله صلى الله عليه وسلم على أن له ما على الربيع الساقي الذي يتفجر منه الماء وطائفة من التبن لا أدري كم هي‏.‏‏ رواه ابن عون عن نافع فقال عن بعض عمومته‏.‏‏",
      "text_en": " Rafi bin Khadij told Abdullah bin Umar that his paternal uncles went to the Messenger of Allah, then they came back and told them that the Messenger of Allah had forbidden leasing arable land. Abdullah said:                      \"We knew that he owned some arable land that he leased at the time of the Messenger of Allah in return for whatever grew on the banks of the streams of water, and for a certain amount of straw, I do not know how much it was.\" Ibn Awn reported it from Nafi but he said: \"From some of his paternal uncles.\"",
      "chain": [
        "30448",
        "20271",
        "11106",
        "11014",
        "1986",
        "18"
      ]
    },
    {
      "hadith_no": "3911",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا محمد بن عبد الله بن بزيع، قال حدثنا يزيد، - وهو ابن زريع - قال حدثنا أيوب، عن نافع، أن ابن عمر، كان يكري مزارعه حتى بلغه في آخر خلافة معاوية أن رافع بن خديج يخبر فيها بنهى رسول الله صلى الله عليه وسلم فأتاه وأنا معه فسأله فقال كان رسول الله صلى الله عليه وسلم ينهى عن كراء المزارع فتركها ابن عمر بعد فكان إذا سئل عنها قال زعم رافع بن خديج أن النبي صلى الله عليه وسلم نهى عنها‏.‏‏ وافقه عبيد الله بن عمر وكثير بن فرقد وجويرية بن أسماء‏.‏‏",
      "text_en": " It was narrated from Nafi' that Ibn 'Umar used to lease out his arable land until he heard at the end of Mu'awiyah's Khilafah, that Rafi' bin Khadij used to narrate, that the Messenger of Allah had forbidden that. He went to him -and I (Nafi') was with him- and asked him (about that). He said:                      \"The Messenger of Allah used to forbid leasing arable land.\" So Ibn 'Umar stopped (doing that) afterward. When he was asked about it he said: \"Rafi' bin Khadij said that the Prophet forbade that.\"",
      "chain": [
        "30448",
        "20304",
        "11015",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "4068",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا محمد بن عبد الله بن بزيع، قال حدثنا يزيد، - وهو ابن زريع - قال أنبأنا داود، عن عكرمة، عن ابن عباس، قال كان رجل من الأنصار أسلم ثم ارتد ولحق بالشرك ثم تندم فأرسل إلى قومه سلوا لي رسول الله صلى الله عليه وسلم هل لي من توبة فجاء قومه إلى رسول الله صلى الله عليه وسلم فقالوا إن فلانا قد ندم وإنه أمرنا أن نسألك هل له من توبة فنزلت ‏{‏ كيف يهدي الله قوما كفروا بعد إيمانهم ‏}‏ إلى قوله ‏{‏ غفور رحيم ‏}‏ ‏\"‏ ‏.‏ فأرسل إليه فأسلم ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"A man from among the Ansar accepted Islam, then he apostatized and went back to Shirk. Then he regretted that, and sent word to his people (saying): 'Ask the Messenger of Allah [SAW], is there any repentance for me?' His people came to the Messenger of Allah [SAW] and said: 'So and so regrets (what he did), and he has told us to ask you if there is any repentance for him?' Then the Verses: 'How shall Allah guide a people who disbelieved after their Belief up to His saying: Verily, Allah is Oft-Forgiving, Most Merciful' was revealed. So he sent word to him, and he accepted Islam.\"",
      "chain": [
        "30448",
        "20304",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "4085",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا محمد بن عبد الله بن بزيع، قال حدثنا بشر بن المفضل، عن أبي يونس القشيري، عن عمرو بن دينار، عن عبد الله بن صفوان، عن عبد الله بن عمرو، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من قاتل دون ماله فقتل فهو شهيد ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin 'Amr said:                     \"I heard the Messenger of Allah [SAW] say: 'Whoever fights to protect his wealth and is killed, he is a martyr.'\"",
      "chain": [
        "30448",
        "20212",
        "11081",
        "487",
        "29"
      ]
    },
    {
      "hadith_no": "4414",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا محمد بن عبد الله بن بزيع، قال حدثنا يزيد، - وهو ابن زريع - قال حدثنا خالد، ح وأنبأنا عبد الله بن محمد بن عبد الرحمن، قال حدثنا غندر، عن شعبة، عن خالد، عن أبي قلابة، عن أبي الأشعث، عن شداد بن أوس، قال ثنتان حفظتهما من رسول الله صلى الله عليه وسلم ‏\"‏ إن الله عز وجل كتب الإحسان على كل شىء فإذا قتلتم فأحسنوا القتلة وإذا ذبحتم فأحسنوا الذبحة ليحد أحدكم شفرته وليرح ذبيحته ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Shaddad bin Aws said:                     \"Two things that I memorized form the Messenger of Allah; 'Allah, the Mighty and Sublime, has decreed proficiency in all things, so when you kill, kill well, and when you slaughter, slaughter well. Let one of you sharpen his blade and spare suffering to the animal he slaughter,\"\" (Sahih )",
      "chain": [
        "30448",
        "20304",
        "11282",
        "20278",
        "20020",
        "11282",
        "11047",
        "30121",
        "389"
      ]
    },
    {
      "hadith_no": "4560",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا محمد بن عبد الله بن بزيع، قال حدثنا يزيد، قال حدثنا سلمة، - وهو ابن علقمة - عن محمد بن سيرين، عن مسلم بن يسار، وعبد الله بن عتيك، قالا جمع المنزل بين عبادة بن الصامت ومعاوية حدثهم عبادة، قال نهانا رسول الله صلى الله عليه وسلم عن بيع الذهب بالذهب والورق بالورق والبر بالبر والشعير بالشعير والتمر بالتمر - قال أحدهما والملح بالملح ولم يقله الآخر - إلا مثلا بمثل يدا بيد وأمرنا أن نبيع الذهب بالورق والورق بالذهب والبر بالشعير والشعير بالبر يدا بيد كيف شئنا قال أحدهما فمن زاد أو ازداد فقد أربى ‏.‏",
      "text_en": " It was narrated that Muslim bin Yasar and 'Abdullah bin 'Atik said:                     \"Ubadah bin As-Samit and Muawiyah met at a stopping place on the road. 'Ubadah told them: 'The Messenger of Allah forbade selling gold for gold, silver for silver, wheat for wheat, barley for barley, dates for dates\"'- one of them said: 'salt for salt,\"' but the other did not say it-\"unless it was like for like, hand to hand. And he commanded us to sell gold for silver and silver for gold, and wheat for barley and barley for wheat, and to hand, however we wanted.\"' And one of them said: \"Whoever gives more or ask for more has engaged in Riba.\"'",
      "chain": [
        "30448",
        "20304",
        "11593",
        "11035",
        "13118"
      ]
    },
    {
      "hadith_no": "4797",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا محمد بن عبد الله بن بزيع، قال حدثنا يزيد، قال حدثنا خالد، عن القاسم بن ربيعة، عن يعقوب بن أوس، أن رجلا، من أصحاب النبي صلى الله عليه وسلم حدثه أن رسول الله صلى الله عليه وسلم لما قدم مكة عام الفتح قال ‏\"‏ ألا وإن قتيل الخطإ العمد قتيل السوط والعصا منها أربعون في بطونها أولادها ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ya'qub bin Aws that:                     a man from among the Companions of the Prophet told him, that when the Messenger of Allah came to Makkah, in the Year of the Conquest, he said: \"Indeed, accidental killing on purpose, is killing with a whip or stick, for which forty (she-camels) with their young in their wombs.\"",
      "chain": [
        "30448",
        "20304",
        "11282",
        "14317"
      ]
    },
    {
      "hadith_no": "4798",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا محمد بن عبد الله بن بزيع، قال أنبأنا يزيد، عن خالد، عن القاسم بن ربيعة، عن يعقوب بن أوس، أن رجلا، من أصحاب النبي صلى الله عليه وسلم حدثه أن النبي صلى الله عليه وسلم دخل مكة عام الفتح قال ‏\"‏ ألا وإن قتيل الخطإ العمد قتيل السوط والعصا منها أربعون في بطونها أولادها ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ya'qub bin Aws that:                     a man from among the Companions of the Prophet narrated to him that the Prophet entered Makkah during the Year of the Conquest, and said: 'Indeed, accidental killing on purpose, is killing with a whip or stick, for which forty (she-camels) with their young in their wombs.\"",
      "chain": [
        "30448",
        "20304",
        "11282",
        "14317"
      ]
    },
    {
      "hadith_no": "5353",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا محمد بن عبد الله بن بزيع، قال حدثنا يزيد بن زريع، قال حدثنا داود بن أبي هند، قال حدثنا عزرة، عن حميد بن عبد الرحمن، عن سعد بن هشام، عن عائشة، زوج النبي صلى الله عليه وسلم قالت كان لنا ستر فيه تمثال طير مستقبل البيت إذا دخل الداخل فقال رسول الله صلى الله عليه وسلم ‏\"‏ يا عائشة حوليه فإني كلما دخلت فرأيته ذكرت الدنيا ‏\"‏ ‏.‏ قالت وكان لنا قطيفة لها علم فكنا نلبسها فلم نقطعه ‏.‏",
      "text_en": " It was narrated that 'Aishah, the wife of the Prophet [SAW], said:                     \"We had a curtain on which there were images of birds, at the entrance to the house. The Messenger of Allah [SAW] said: 'O 'Aishah, remove it, for ever time I come in and see it, I remember this world.'\" She said: \"We had a plush wrap, with a border on it, that we would wear, and it was not cut off.\"",
      "chain": [
        "30448",
        "20304",
        "11585",
        "10799",
        "10561",
        "11166"
      ]
    }
  ],
  "total_hadiths": 31
}