{
  "id": "30452",
  "name": "Muhammad bin 'Amr bin 'Ubada bin Jabla محمد بن عمرو بن عبادة بن جبلة",
  "full_name": "Muhammad bin 'Amr bin 'Ubada bin Jabla محمد بن عمرو بن عبادة بن جبلة",
  "grade": "3rd Century AH [11th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "234",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ م  د  -  صدوق ]"
    ],
    "tags": [
      "al-'Atki",
      "al-Basri",
      "Client"
    ],
    "area_of_interest_display": [
      {
        "en": "Narrator[Grade:Sadooq] [ م  د  -  صدوق ]",
        "ar": "Narrator[Grade:Sadooq] [ م  د  -  صدوق ]",
        "ckb": "Narrator[Grade:Sadooq] [ م  د  -  صدوق ]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "Basra",
        "ar": "البصرة",
        "ckb": "بەسرە"
      }
    ],
    "tags_display": [
      {
        "en": "al-'Atki",
        "ar": "al-'Atki",
        "ckb": "al-'Atki"
      },
      {
        "en": "al-Basri",
        "ar": "al-Basri",
        "ckb": "al-Basri"
      },
      {
        "en": "Client (Mawla)",
        "ar": "مولى",
        "ckb": "مەولا"
      }
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20276",
      "name": "Muhammad bin Abi 'Adi محمد بن أبي عدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [9th Generation]",
        "ar": "تابع التابعين [الجيل التاسع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی نۆیەم]"
      }
    },
    {
      "id": "20278",
      "name": "Muhammad bin Ja'far Ghandar محمد بن جعفر غندر صاحب الكرابيس",
      "grade": "Succ. (Taba' Tabi') [9th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [9th Generation]",
        "ar": "تابع التابعين [الجيل التاسع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی نۆیەم]"
      }
    },
    {
      "id": "20443",
      "name": "Abu 'Amir al-'Aqdi عبد الملك بن عمرو القيسي أبو عامر العقدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [9th Generation]",
        "ar": "تابع التابعين [الجيل التاسع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی نۆیەم]"
      }
    },
    {
      "id": "20355",
      "name": "Muhammad bin 'Abdullah bin al-Zubair محمد بن عبد الله أبو أحمد الزبيري",
      "grade": "Succ. (Taba' Tabi') [9th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [9th Generation]",
        "ar": "تابع التابعين [الجيل التاسع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی نۆیەم]"
      }
    },
    {
      "id": "20221",
      "name": "Harmy bin 'Umarah حرمي بن عمارة بن أبي حفصة",
      "grade": "Succ. (Taba' Tabi') [9th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [9th Generation]",
        "ar": "تابع التابعين [الجيل التاسع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی نۆیەم]"
      }
    },
    {
      "id": "20233",
      "name": "Salm bin Qutayba, Abu Qutayba سلم بن قتيبة الشعيري - أبو قتيبة",
      "grade": "Succ. (Taba' Tabi') [9th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [9th Generation]",
        "ar": "تابع التابعين [الجيل التاسع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی نۆیەم]"
      }
    },
    {
      "id": "20530",
      "name": "Umayya bin Khalid bin al-'Aswad أمية بن خالد بن الأسود",
      "grade": "Succ. (Taba' Tabi') [9th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [9th Generation]",
        "ar": "تابع التابعين [الجيل التاسع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی نۆیەم]"
      }
    },
    {
      "id": "20578",
      "name": "al-Ahwas bin Jawab الأحوص بن جواب",
      "grade": "Succ. (Taba' Tabi') [9th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [9th Generation]",
        "ar": "تابع التابعين [الجيل التاسع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی نۆیەم]"
      }
    }
  ],
  "students": [
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]",
      "grade_display": {
        "en": "3rd Century AH [Shafi'i]",
        "ar": "القرن الثالث الهجري [شافعي]",
        "ckb": "سەدەی سێیەمی كۆچی [شافیعی]"
      }
    },
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]",
      "grade_display": {
        "en": "3rd Century AH [11th Generation]",
        "ar": "القرن الثالث الهجري [الجيل الحادي عشر]",
        "ckb": "سەدەی سێیەمی كۆچی [نەوەی یازدەیەم]"
      }
    }
  ],
  "hadiths": [
    {
      "id": "sahih-muslim-358",
      "hadith_no": "358",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا محمد بن بشار، حدثنا ابن أبي عدي، عن شعبة، ح وحدثني محمد بن عمرو بن جبلة بن أبي رواد، وأبو بكر بن إسحاق قالا حدثنا أبو الجواب، عن عمار بن رزيق، كلاهما عن الأعمش، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم بهذا الحديث ‏.‏",
      "text_en": " The same hadith has been transmitted by Muhammad b. 'Amr, Abu Baker b. Ishaq, Abu'l-Jawwab, A'mash and Abu Huraira.",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20276",
        "20020",
        "30452",
        "11108",
        "20578",
        "20595",
        "11060",
        "11161",
        "13"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-3577",
      "hadith_no": "3577",
      "source": "Sahih Muslim",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "حدثنا محمد بن عمرو بن عباد بن جبلة بن أبي رواد، ومحمد بن بشار، قالا حدثنا محمد، - وهو ابن جعفر - حدثنا شعبة، عن عبد العزيز بن صهيب، قال سمعت أنس بن مالك، يقول ما أولم رسول الله صلى الله عليه وسلم على امرأة من نسائه أكثر أو أفضل مما أولم على زينب ‏.‏ فقال ثابت البناني بما أولم قال أطعمهم خبزا ولحما حتى تركوه ‏.‏",
      "text_en": " Anas b. Malik (Allah be pleased with him) reported:                      Allah's Messenger (may peace be upon him) gave no better wedding feast than the one he did (on the occasion of his marriage with) Zainab. Thabit al-Bunani (one of the narrators) said: What did he serve in the wedding feast? He (Anas) said: He fed them bread and meat (so lavishly) that they (the guests) abandoned it (of their own accord after having taken them to their hearts' content).",
      "usc_msa_ref": "",
      "chain": [
        "30452",
        "30160",
        "20173",
        "20020",
        "11295",
        "19"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-3909",
      "hadith_no": "3909",
      "source": "Sahih Muslim",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "حدثنا محمد بن عمرو بن جبلة بن أبي رواد، حدثنا أبو عامر، - يعني العقدي - حدثنا قرة، عن محمد، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من اشترى شاة مصراة فهو بالخيار ثلاثة أيام فإن ردها رد معها صاعا من طعام لا سمراء ‏\"‏‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported Allah's Apostle (may peace be upon him) as saying:                      lie who buys a goat having its udder tied up has the option to return it within three days. If he returns it he should pay a sa' of dates. Wheat is not essential.",
      "usc_msa_ref": "",
      "chain": [
        "30452",
        "20443",
        "11301",
        "11035",
        "13"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-4383",
      "hadith_no": "4383",
      "source": "Sahih Muslim",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "وحدثنا أبو سعيد الأشج، حدثنا أبو أسامة، ح وحدثنا محمد بن المثنى، حدثنا عبد الوهاب يعني الثقفي، ح وحدثنا أبو بكر بن أبي شيبة، ومحمد بن العلاء، وإسحاق، بن إبراهيم جميعا عن حفص بن غياث، ح وحدثنا محمد بن عمرو بن جبلة بن أبي رواد، حدثنا محمد بن جعفر، حدثنا شعبة، كلهم عن عبيد الله، عن نافع، عن ابن عمر، وقال، حفص من بينهم عن عمر، بهذا الحديث أما أبو أسامة والثقفي ففي حديثهما اعتكاف ليلة ‏.‏ وأما في حديث شعبة فقال جعل عليه يوما يعتكفه ‏.‏ وليس في حديث حفص ذكر يوم ولا ليلة ‏.‏",
      "text_en": " This hadith is transmitted on the authority of Ibn Umar with a slight variation of words.",
      "usc_msa_ref": "",
      "chain": [
        "30200",
        "20318",
        "30170",
        "20259",
        "30201",
        "30216",
        "30123",
        "20317",
        "30452",
        "20173",
        "11201"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-5431",
      "hadith_no": "5431",
      "source": "Sahih Muslim",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثني محمد بن عمرو بن جبلة بن أبي رواد، حدثنا أبو الجواب، حدثنا عمار، - وهو ابن رزيق - عن الأعمش، عن أبي سفيان، عن جابر، ح",
      "text_en": " This hadith has been transmitted on the authority of Jabir also.",
      "usc_msa_ref": "",
      "chain": [
        "30452",
        "20578",
        "20595",
        "11060",
        "116"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-6537",
      "hadith_no": "6537",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمد بن عمرو بن عباد بن جبلة بن أبي رواد، حدثنا حرمي بن عمارة، حدثنا قرة بن خالد، عن محمد بن سيرين، قال قال قيس بن عباد كنت في حلقة فيها سعد بن مالك وابن عمر فمر عبد الله بن سلام فقالوا هذا رجل من أهل الجنة ‏.‏ فقمت فقلت له إنهم قالوا كذا وكذا ‏.‏ قال سبحان الله ما كان ينبغي لهم أن يقولوا ما ليس لهم به علم إنما رأيت كأن عمودا وضع في روضة خضراء فنصب فيها وفي رأسها عروة وفي أسفلها منصف - والمنصف الوصيف - فقيل لي ارقه ‏.‏ فرقيت حتى أخذت بالعروة فقصصتها على رسول الله صلى الله عليه وسلم فقال رسول الله صلى الله عليه وسلم ‏\"‏ يموت عبد الله وهو آخذ بالعروة الوثقى ‏\"‏ ‏.‏",
      "text_en": " Qais b. 'Ubaida reported:                      I was (sitting) in a company in which there were (besides others) Sa'd b. Malik and Ibn 'Umar that 'Abdullah b. Saliim happened to pass (by that side). They (the people sitting in that company) said: He is a person from amongst the dwellers of Paradise. I stood up and said to him: They say such and such (thing about you), whereupon he said: Hallowed be Allah, it is not meet for them to say (anything) of which They have no knowledge. Verily I saw as if a pillar had been raised in a green garden and there had been fixed at its (upper) end a handhold and there was a helper at its base. It was said to me: Climb up. So I climbed up and caught hold of the haildhold. I narrated (the contents of this dream) to Allah's Messenger (may peace be upon him), whereupon he said: 'Abdullah would die in a state that he would be catching hold of the firmest handhold (he would die holding fast to the faith).",
      "usc_msa_ref": "",
      "chain": [
        "30452",
        "20221",
        "11301",
        "11035",
        "11609"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-7190",
      "hadith_no": "7190",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Repentance and Exhortation to Repentance - كتاب التوبة",
      "chapter_no": "51",
      "text_ar": "حدثنا محمد بن عمرو بن عباد بن جبلة بن أبي رواد، حدثنا حرمي بن عمارة، حدثنا شداد أبو طلحة الراسبي، عن غيلان بن جرير، عن أبي بردة، عن أبيه، عن النبي صلى الله عليه وسلم قال ‏\"‏ يجيء يوم القيامة ناس من المسلمين بذنوب أمثال الجبال فيغفرها الله لهم ويضعها على اليهود والنصارى ‏\"‏ ‏.‏ فيما أحسب أنا ‏.‏ قال أبو روح لا أدري ممن الشك ‏.‏ قال أبو بردة فحدثت به عمر بن عبد العزيز فقال أبوك حدثك هذا عن النبي صلى الله عليه وسلم قلت نعم ‏.‏",
      "text_en": " Abu Burda reported Allah's Messenger (may peace be upon him) as saying:                      There would come people amongst the Muslims on the Day of Resurrection with as heavy sins as a mountain, and Allah would forgive them and He would place in their stead the Jews and the Christians. (As far as I think), Abu Raub said: I do not know as to who is in doubt. Abu Burda said: I narrated it to 'Umar b. 'Abd al-'Aziz, whereupon he said: Was it your father who narrated it to you from Allah's Apostle (may peace be upon him)? I said: Yes.",
      "usc_msa_ref": "",
      "chain": [
        "30452",
        "20221",
        "11300",
        "11901",
        "41"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-7694",
      "hadith_no": "7694",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "وحدثني محمد بن عمرو بن عباد بن جبلة بن أبي رواد، حدثنا محمد بن جعفر، ح وحدثني أبو بكر بن نافع، أخبرنا غندر، قال شعبة حدثنا عن خالد الحذاء، عن عبد، الرحمن بن أبي بكرة عن أبيه، عن النبي صلى الله عليه وسلم أنه ذكر عنده رجل فقال رجل يا رسول الله ما من رجل بعد رسول الله صلى الله عليه وسلم أفضل منه في كذا وكذا ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ ويحك قطعت عنق صاحبك ‏\"‏ ‏.‏ مرارا يقول ذلك ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ إن كان أحدكم مادحا أخاه لا محالة فليقل أحسب فلانا إن كان يرى أنه كذلك ولا أزكي على الله أحدا ‏\"‏ ‏.‏",
      "text_en": " Abd al-Rahman b. Abu Bakra reported on the authority of his father that a person was mentioned in the presence of Allah's Apostle (may peace be upon him), and a person said:                      Allah's Messenger, no person is more excellent than he after Allah's Messenger (may peace be upon him). Thereupon Allah's Apostle (may peace be upon him) said: Woe be to thee, you have broken the neck of your friend, and he said this twice. Then Allah's Messenger (may peace be upon him) said: If anyone has to praise his brother at all, he should say: I think him to be so and so, and even on this he should say: I do not consider anyone purer than Allah (considers). This hadith has been transmitted on the authority of Shu'ba with a slight variation of wording.",
      "usc_msa_ref": "",
      "chain": [
        "30452",
        "20173",
        "20523",
        "20278",
        "20020",
        "11282",
        "11294",
        "3229"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sunan-abi-daud-1196",
      "hadith_no": "1196",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Book Of The Prayer For Rain (Kitab al-Istisqa') - كتاب الاستسقاء",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن عمرو بن جبلة بن أبي رواد، حدثني حرمي بن عمارة، عن عبيد الله بن النضر، حدثني أبي قال، كانت ظلمة على عهد أنس بن مالك - قال - فأتيت أنسا فقلت يا أبا حمزة هل كان يصيبكم مثل هذا على عهد رسول الله صلى الله عليه وسلم قال معاذ الله إن كانت الريح لتشتد فنبادر المسجد مخافة القيامة ‏.‏",
      "text_en": " Narrated Anas ibn Malik:                     Ubaydullah ibn an-Nadr reported on the authority of his father: Darkness prevailed in the time of Anas ibn Malik, I came to Anas and said (to him): AbuHamzah, did anything like this happen to you in the time of the Messenger of Allah (ﷺ)? He replied: Take refuge in Allah. If the wind blew violently, we would run quickly towards the mosque for fear of the coming of the Day of Judgment.",
      "usc_msa_ref": "",
      "chain": [
        "30452",
        "20221",
        "24295",
        "14397",
        "19"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    }
  ],
  "total_hadiths": 9,
  "grade_display": {
    "en": "3rd Century AH [11th Generation]",
    "ar": "القرن الثالث الهجري [الجيل الحادي عشر]",
    "ckb": "سەدەی سێیەمی كۆچی [نەوەی یازدەیەم]"
  }
}