{
  "id": "30459",
  "name": "Yahya bin Habib bin Arby يحيى بن حبيب بن عربي",
  "full_name": "Yahya bin Habib bin Arby يحيى بن حبيب بن عربي",
  "grade": "3rd Century AH [10th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "248",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  4  -  ثقة ]"
    ],
    "tags": [
      "al-Harithi",
      "al-Shaybani",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20304",
      "name": "Yazid bin Zari' يزيد بن زريع",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20022",
      "name": "Hammad bin Zayd حماد بن زيد بن درهم الأزدي الأزرق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20226",
      "name": "Khalid bin al-Harith bin 'Ubaid خالد بن الحارث بن عبيد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20259",
      "name": "'Abdul Wahab bin 'Abdul Majeed al-Thaqaf عبد الوهاب بن عبد المجيد الثقفي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20288",
      "name": "Ma'tmar bin Sulaiman-al-Taufayl معتمر بن سليمان - الطفيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20284",
      "name": "Marhum bin 'Abdul 'Aziz bin Mahran مرحوم بن عبد العزيز بن مهران العطار",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "28337",
      "name": "'Abdur Rahman bin 'Uthman al-Thaqifi عبد الرحمن بن عثمان الثقفي أبو بحر البكر",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "22215",
      "name": "Musa bin Ibrahim bin Kathir موسى بن إبراهيم بن كثير",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20229",
      "name": "Ruh bin 'Ubada bin al-'Ala' روح بن عبادة بن العلاء",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30004",
      "name": "Ibn Maja ابن ماجة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]"
    },
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "30005",
      "name": "Imam Tirmidhi الترمذي محمد بن عيسى بن سورة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30006",
      "name": "Imam Nasa'i أحمد بن شعيب بن علي بن سنان النسائي",
      "grade": "3rd Century AH [12th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "303",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثنا يحيى بن حبيب الحارثي، حدثنا خالد، - يعني ابن الحارث - حدثنا شعبة، أخبرني سليمان، قال سمعت منذرا، عن محمد بن علي، عن علي، أنه قال استحييت أن أسأل، النبي صلى الله عليه وسلم عن المذى من أجل فاطمة فأمرت المقداد فسأله فقال ‏\"‏ منه الوضوء ‏\"‏ ‏.‏",
      "text_en": " 'Ali reported:                      I felt shy of asking about prostatic fluid from the Apostle (may peace be upon him) because of Fatimah. I, therefore, asked al-Miqdad (to ask on my behalf) and he asked. He (the Holy Prophet) said: Ablution is obligatory in such a case.",
      "chain": [
        "30459",
        "20226",
        "20020",
        "11060",
        "11398",
        "11442",
        "5"
      ]
    },
    {
      "hadith_no": "5075",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنيه يحيى بن حبيب، حدثنا روح بن عبادة، حدثنا شعبة، حدثنا سيار، بهذا الإسناد مثله ‏.‏",
      "text_en": " This tradition has been handed down through another chain of transmitters.",
      "chain": [
        "30459",
        "20229",
        "20020",
        "11429"
      ]
    },
    {
      "hadith_no": "5077",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنيه يحيى بن حبيب، حدثنا روح، حدثنا شعبة، بهذا الإسناد ‏.‏",
      "text_en": "",
      "chain": [
        "30459",
        "20229",
        "20020"
      ]
    },
    {
      "hadith_no": "5161",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثنيه زهير بن حرب، حدثنا يحيى بن سعيد، ح وحدثني يحيى بن حبيب، حدثنا  خالد، - يعني ابن الحارث - كلاهما عن شعبة، بهذا الإسناد وفي حديث يحيى بوركها أو فخذيها ‏.‏",
      "text_en": "",
      "chain": [
        "30022",
        "20031",
        "30459",
        "20226",
        "20020"
      ]
    },
    {
      "hadith_no": "480",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا يحيى بن حبيب بن عربي، حدثنا خالد، - يعني ابن الحارث - عن محمد بن عجلان، عن عياض بن عبد الله، عن أبي سعيد الخدري، أن النبي صلى الله عليه وسلم كان يحب العراجين ولا يزال في يده منها فدخل المسجد فرأى نخامة في قبلة المسجد فحكها ثم أقبل على الناس مغضبا فقال ‏\"‏ أيسر أحدكم أن يبصق في وجهه إن أحدكم إذا استقبل القبلة فإنما يستقبل ربه جل وعز والملك عن يمينه فلا يتفل عن يمينه ولا في قبلته وليبصق عن يساره أو تحت قدمه فإن عجل به أمر فليقل هكذا ‏\"‏ ‏.‏ ووصف لنا ابن عجلان ذلك أن يتفل في ثوبه ثم يرد بعضه على بعض ‏.‏",
      "text_en": " Abu Sa’id al-khudri said:                      The Prophet(ﷺ) liked the twigs of the date-palm, and he often had one of them in his hand. He entered the mosque and saw phlegm in the wall towards qiblah and he scraped it. He then turned towards people in anger and said: Is any one of you is pleased to spit in his face? When any of you faces qiblah, he indeed faces his Lord, the Majestic the Glorious: the angels are at right side. Therefore, he should not spit on his right side or before him towards qiblah. He should spit towards his left side or beneath his foot. If he is in a hurry, he should do so-and-so. Describing it Ibn ‘Ajlan said: He should spit in his cloth and fold a part of it over the other.",
      "chain": [
        "30459",
        "20226",
        "10616",
        "11260",
        "38"
      ]
    },
    {
      "hadith_no": "793",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا يحيى بن حبيب، حدثنا خالد بن الحارث، حدثنا محمد بن عجلان، عن عبيد الله بن مقسم، عن جابر، ذكر قصة معاذ قال وقال - يعني النبي صلى الله عليه وسلم للفتى - ‏\"‏ كيف تصنع يا ابن أخي إذا صليت ‏\"‏ ‏.‏ قال أقرأ بفاتحة الكتاب وأسأل الله الجنة وأعوذ به من النار وإني لا أدري ما دندنتك ولا دندنة معاذ ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إني ومعاذ حول هاتين ‏\"‏ ‏.‏ أو نحو هذا ‏.‏",
      "text_en": " Jabir narrated the story of mu’adh and said:                      The prophet (ﷺ) said to a youth: My nephew, what do you do in prayer? He replied: I recited fatihat al-katab and I ask Allah for paradise and seek his refuge from hell-fire I do not understand well your sound and the sound of mu’adh. The prophet (ﷺ) said: I and Mu’adh go around both (paradise and Hell-fire), or he said something similar.",
      "chain": [
        "30459",
        "20226",
        "10616",
        "11521",
        "34"
      ]
    },
    {
      "hadith_no": "4050",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا يحيى بن حبيب، حدثنا روح، حدثنا هشام، عن محمد، عن عبيدة، عن علي، - رضى الله عنه - أنه قال نهى عن مياثر الأرجوان ‏.‏",
      "text_en": " 'Ali said:                      It is forbidden to use purple saddle-clothes.",
      "chain": [
        "30459",
        "20229",
        "20295",
        "20278",
        "11370",
        "5"
      ]
    },
    {
      "hadith_no": "4508",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا يحيى بن حبيب بن عربي، حدثنا خالد بن الحارث، حدثنا شعبة، عن هشام بن زيد، عن أنس بن مالك، أن امرأة، يهودية أتت رسول الله صلى الله عليه وسلم بشاة مسمومة فأكل منها فجيء بها إلى رسول الله صلى الله عليه وسلم فسألها عن ذلك فقالت أردت لأقتلك ‏.‏ فقال ‏\"‏ ما كان الله ليسلطك على ذلك ‏\"‏ ‏.‏ أو قال ‏\"‏ على ‏\"‏ ‏.‏ قال فقالوا ألا نقتلها قال ‏\"‏ لا ‏\"‏ ‏.‏ فما زلت أعرفها في لهوات رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Anas bin Malik:                     A Jewess brought a poisoned sheep to the Messenger of Allah (ﷺ), and he ate of it. She was then brought to the Messenger of Allah (ﷺ) who asked her about it. She said: I intended to kill you. He said: Allah will not give you control over it ; or he said : over me. They (the Companions) said: Should we not kill her ? He said: No. He (Anas) said: I always found it in the uvula of the Messenger of Allah (ﷺ)",
      "chain": [
        "30459",
        "20226",
        "20020",
        "11228",
        "19"
      ]
    },
    {
      "hadith_no": "5176",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا ابن بشار، حدثنا أبو عاصم، حدثنا ابن جريج، ح حدثنا يحيى بن حبيب، حدثنا روح، عن ابن جريج، قال أخبرني عمرو بن أبي سفيان، أن عمرو بن عبد الله بن صفوان، أخبره عن كلدة بن حنبل، أن صفوان بن أمية، بعثه إلى رسول الله صلى الله عليه وسلم بلبن وجداية وضغابيس - والنبي صلى الله عليه وسلم بأعلى مكة - فدخلت ولم أسلم فقال ‏\"‏ ارجع فقل السلام عليكم ‏\"‏ ‏.‏ وذاك بعد ما أسلم صفوان بن أمية ‏.‏ قال عمرو وأخبرني ابن صفوان بهذا أجمع عن كلدة بن حنبل ولم يقل سمعته منه ‏.‏ قال أبو داود قال يحيى بن حبيب أمية بن صفوان ولم يقل سمعته من كلدة بن حنبل وقال يحيى أيضا عمرو بن عبد الله بن صفوان أخبره أن كلدة بن الحنبل أخبره ‏.‏",
      "text_en": " Narrated Kaladah ibn Hanbal:                     Safwan ibn Umayyah sent him with some milk, a young gazelle and some small cucumbers to the Messenger of Allah (ﷺ) when he was in the upper part of Mecca. I entered but I did not give a salutation. He said: Go back and say: \"Peace be upon you\"! This happened after Safwan ibn Umayyah and embraced Islam. Amr said: Ibn Safwan told me all this on the authority of Kaladah ibn Hanbal, and he did not say: I heard it from him.Abu Dawud said: Yahya b. Habib said: Umayyah b. Safwan. He did not say: I heard from Kaladah b. Hanbal. Yahya also said: 'Amr b. 'Abd Allah b. Safwan told him that Kaladah b. al-Hanbal told him.",
      "chain": [
        "30160",
        "20241",
        "11070",
        "30459",
        "20229",
        "11070",
        "18797",
        "19833",
        "2415"
      ]
    },
    {
      "hadith_no": "5182",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا يحيى بن حبيب، حدثنا روح، حدثنا ابن جريج، قال أخبرني عطاء، عن عبيد بن عمير، أن أبا موسى، استأذن على عمر بهذه القصة ‏.‏ قال فيه فانطلق بأبي سعيد فشهد له فقال أخفي على هذا من أمر رسول الله صلى الله عليه وسلم ألهاني السفق بالأسواق ولكن سلم ما شئت ولا تستأذن ‏.‏",
      "text_en": " ’Ubaid b. ‘Umair said :                      Abu Musa asked ‘Umar for permission to enter the house. This version has: he went with Abu sa’ld who testified to it. He said Did this practice of the Messenger of Allah (May peace be upon him) remain hidden from me? My engagement in the transaction in the market made me oblivious of it. Now give me salutation as you wish; and do not ask permission.",
      "chain": [
        "30459",
        "20229",
        "11070",
        "11029",
        "11259"
      ]
    },
    {
      "hadith_no": "5199",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا يحيى بن حبيب بن عربي، أخبرنا روح، حدثنا ابن جريج، قال أخبرنا زياد، أن ثابتا، مولى عبد الرحمن بن زيد أخبره أنه، سمع أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ يسلم الراكب على الماشي ‏\"‏ ‏.‏ ثم ذكر الحديث ‏.‏",
      "text_en": " Abu Hurairah reported the Messenger of Allah (May peace be upon him) as saying:                      one who is riding should salute one who is walking. He then mentioned the rest of the tradition.",
      "chain": [
        "30459",
        "20229",
        "11070",
        "11339",
        "13"
      ]
    },
    {
      "hadith_no": "2281",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Qadar - كتاب القدر عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "32",
      "text_ar": "حدثنا يحيى بن حبيب بن عربي، حدثنا المعتمر بن سليمان، حدثنا أبي، عن سليمان الأعمش، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ احتج آدم وموسى فقال موسى يا آدم أنت الذي خلقك الله بيده ونفخ فيك من روحه أغويت الناس وأخرجتهم من الجنة ‏.‏ قال فقال آدم وأنت موسى الذي اصطفاك الله بكلامه أتلومني على عمل عملته كتبه الله على قبل أن يخلق السموات والأرض قال فحج آدم موسى ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن عمر وجندب ‏.‏ وهذا حديث حسن صحيح غريب من هذا الوجه من حديث سليمان التيمي عن الأعمش ‏.‏ وقد روى بعض أصحاب الأعمش عن الأعمش عن أبي صالح عن أبي هريرة عن النبي صلى الله عليه وسلم نحوه ‏.‏ وقال بعضهم عن الأعمش عن أبي صالح عن أبي سعيد عن النبي صلى الله عليه وسلم ‏.‏ وقد روي هذا الحديث من غير وجه عن أبي هريرة عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Abu Hurairah narrated that the Prophet(S.A.W) said:                     \"Adam and Musa argued, Musa said: \"O Adam! You are the one that Allah created with His Hand, and blew into you of His Spirit, and you misled the people  and caused them  to be expelled from Paradise.'  So Adam said: 'You are Musa, the one Allah selected with His Speech! Are you blaming me for something I did which Allah had decreed for me, before creating the heavens and the earth?'\" He said: \" So Adam confuted Musa.\"",
      "chain": [
        "30459",
        "20288",
        "11289",
        "11060",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "3275",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا يحيى بن حبيب بن عربي البصري، حدثنا خالد بن الحارث، عن محمد بن عجلان، عن نافع، عن عبد الله بن عمر، أن رسول الله صلى الله عليه وسلم كان يدعو على أربعة نفر فأنزل الله ‏:‏ ‏(‏ليس لك من الأمر شيء أو يتوب عليهم أو يعذبهم فإنهم ظالمون ‏)‏ فهداهم الله للإسلام ‏.‏ قال أبو عيسى هذا حديث حسن غريب صحيح يستغرب من هذا الوجه من حديث نافع عن ابن عمر ورواه يحيى بن أيوب عن ابن عجلان ‏.‏",
      "text_en": " Narrated 'Abdullah bin 'Umar:                     \"The Messenger of Allah (ﷺ) was supplicating against four people, so Allah, Blessed and Most High, revealed: Not for you is the decision; whether He turns in mercy towards them or punishes them; verily they are the wrongdoers (3:128). So Allah guided them to Islam.\"",
      "chain": [
        "30459",
        "20226",
        "10616",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3281",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا يحيى بن حبيب بن عربي، حدثنا موسى بن إبراهيم بن كثير الأنصاري، قال سمعت طلحة بن خراش، قال سمعت جابر بن عبد الله، يقول لقيني رسول الله صلى الله عليه وسلم فقال لي ‏\"‏ يا جابر ما لي أراك منكسرا ‏\"‏ ‏.‏ قلت يا رسول الله استشهد أبي قتل يوم أحد وترك عيالا ودينا ‏.‏ قال ‏\"‏ أفلا أبشرك بما لقي الله به أباك ‏\"‏ ‏.‏ قال قلت بلى يا رسول الله ‏.‏ قال ‏\"‏ ما كلم الله أحدا قط إلا من وراء حجاب وأحيا أباك فكلمه كفاحا فقال يا عبدي تمن على أعطك ‏.‏ قال يا رب تحييني فأقتل فيك ثانية ‏.‏ قال الرب عز وجل إنه قد سبق مني أنهم إليها لا يرجعون ‏\"‏ ‏.‏ قال وأنزلت هذه الآية ‏:‏ ‏(‏ولا تحسبن الذين قتلوا في سبيل الله أمواتا ‏)‏ الآية ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه ولا نعرفه إلا من حديث موسى بن إبراهيم ورواه علي بن عبد الله بن المديني وغير واحد من كبار أهل الحديث هكذا عن موسى بن إبراهيم ‏.‏ وقد روى عبد الله بن محمد بن عقيل عن جابر شيئا من هذا ‏.‏",
      "text_en": " Narrated Musa bin Ibrahim bin Kathir Al-Ansari:                     \"I heard Talhah bin Khirash say: 'I heard Jabir bin 'Abdullah saying: \"The Messenger of Allah (ﷺ) met me and said to me: 'O Jabir! Why do I see you upset?' I said: 'O Messenger of Allah! My father was martyred (on the Day of Uhud) leaving my family and debt behind.'\" \"He (ﷺ) said: 'Shall I give you news of what your father met Allah with?'\" He said: \"But of course O Messenger of Allah!\" He said: 'Allah does not speak to anyone except from behind a veil, but He brought your father to speak to Him directly. He said: \"[O My slave!] Do you wish that I give you anything?\" He said: 'O Lord! Give me life so that I may fight for You a second time.' So the Lord [Blessed and Most High] said: 'It has been decreed by Me that they shall not return (21:95).' He said: \"So this Ayah was revealed: Think not of those as dead who are killed in the way of Allah (3:169).\"",
      "chain": [
        "30459",
        "19046",
        "12192",
        "34"
      ]
    },
    {
      "hadith_no": "3383",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا يحيى بن حبيب بن عربي، حدثنا موسى بن إبراهيم بن كثير الأنصاري، قال سمعت طلحة بن خراش، قال سمعت جابر بن عبد الله، رضى الله عنهما يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ أفضل الذكر لا إله إلا الله وأفضل الدعاء الحمد لله ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من حديث موسى بن إبراهيم ‏.‏ وقد روى علي بن المديني وغير واحد عن موسى بن إبراهيم هذا الحديث ‏.‏",
      "text_en": " Jabir bin Abdullah [may Allah be pleased with him] narrated that :                     the Messenger of Allah said: “The best remembrance is: ‘there is none worthy of worship except Allah (La ilaha Illallah)’ and the best supplication is: ‘All praise is due to Allah (Al-Hamdulillah).’”",
      "chain": [
        "30459",
        "19046",
        "12192",
        "34"
      ]
    },
    {
      "hadith_no": "4231",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا يحيى بن حبيب بن عربي، حدثنا موسى بن إبراهيم بن كثير الأنصاري، قال سمعت طلحة بن خراش، يقول سمعت جابر بن عبد الله، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا تمس النار مسلما رآني أو رأى من رآني ‏\"‏ ‏.‏ قال طلحة فقد رأيت جابر بن عبد الله ‏.‏ وقال موسى وقد رأيت طلحة ‏.‏ قال يحيى وقال لي موسى وقد رأيتني ونحن نرجو الله ‏.‏ قال هذا حديث حسن غريب لا نعرفه إلا من حديث موسى بن إبراهيم الأنصاري ‏.‏ وروى علي بن المديني وغير واحد من أهل الحديث عن موسى هذا الحديث ‏.‏",
      "text_en": " Narrated Talhah bin Khirash:                     \"I heard Jabir bin 'Abdullah saying: 'I heard the Prophet (ﷺ) saying: \"The Fire shall not touch the Muslim who saw me, or saw one who saw me.\"",
      "chain": [
        "30459",
        "19046",
        "12192",
        "34"
      ]
    },
    {
      "hadith_no": "75",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا يحيى بن حبيب بن عربي، عن حماد، والحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن القاسم، حدثني مالك، ح وأخبرنا سليمان بن منصور، قال أنبأنا عبد الله بن المبارك، - واللفظ له - عن يحيى بن سعيد، عن محمد بن إبراهيم، عن علقمة بن وقاص، عن عمر بن الخطاب، - رضى الله عنه - قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إنما الأعمال بالنية وإنما لامرئ ما نوى فمن كانت هجرته إلى الله وإلى رسوله فهجرته إلى الله وإلى رسوله ومن كانت هجرته إلى دنيا يصيبها أو امرأة ينكحها فهجرته إلى ما هاجر إليه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Umar bin Al-Khattab (may Allah be pleased with him) said:                      \"The Messenger of Allah said: 'Actions are only done with intentions, and every man shall have what he intended. Thus he whose emigration was for Allah and His Messenger, his emigration was for Allah and His Messenger, and he whose emigration was to achieve some worldly benefit or to take some woman in marriage, his emigration was for that which he intended.\"",
      "chain": [
        "30459",
        "20022",
        "36017",
        "30234",
        "20001",
        "11062",
        "11213",
        "3"
      ]
    },
    {
      "hadith_no": "142",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا يحيى بن حبيب بن عربي، قال حدثنا حماد، قال حدثنا أبو جهضم، قال حدثني عبد الله بن عبيد الله بن عباس، قال كنا جلوسا إلى عبد الله بن عباس فقال والله ما خصنا رسول الله صلى الله عليه وسلم بشىء دون الناس إلا بثلاثة أشياء فإنه أمرنا أن نسبغ الوضوء ولا نأكل الصدقة ولا ننزي الحمر على الخيل ‏.‏",
      "text_en": " 'Abdullah bin 'Ubaidullah bin 'Abbas said:                      \"We were sitting with 'Abdullah bin 'Abbas and he said: 'By Allah, the Messenger of Allah (ﷺ) did not say specifically anything for us above the people, except for three things: He commanded us to do Wudu' properly, [2] not to consume charity, and not to mate donkeys with horses.'\"[1] Isbagh Al-Wudu'[2] An Nusbig Al-Wudu'",
      "chain": [
        "30459",
        "20022"
      ]
    },
    {
      "hadith_no": "219",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا يحيى بن حبيب بن عربي، قال حدثنا حماد، - وهو ابن زيد - عن هشام بن عروة، عن أبيه، عن عائشة، - رضى الله عنها - قالت استحيضت فاطمة بنت أبي حبيش فسألت النبي صلى الله عليه وسلم فقالت يا رسول الله إني أستحاض فلا أطهر أفأدع الصلاة قال رسول الله صلى الله عليه وسلم ‏\"‏ إنما ذلك عرق وليست بالحيضة فإذا أقبلت الحيضة فدعي الصلاة وإذا أدبرت فاغسلي عنك أثر الدم وتوضئي فإنما ذلك عرق وليست بالحيضة ‏\"‏ ‏.‏ قيل له فالغسل قال ‏\"‏ ذلك لا يشك فيه أحد ‏\"‏ ‏.‏ قال أبو عبد الرحمن لا أعلم أحدا ذكر في هذا الحديث ‏\"‏ وتوضئي ‏\"‏ ‏.‏ غير حماد بن زيد وقد روى غير واحد عن هشام ولم يذكر فيه ‏\"‏ وتوضئي ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                      \"Fatimah bint Abi Hubaish suffered from Istihadah and she asked the Prophet (ﷺ): 'O Messenger of Allah, I suffer from Istihadah and I do not become pure; should I stop praying?' The Messenger of Allah (ﷺ) said: 'That is a vein and is not menstruation. When your period comes, stop praying, and when it goes wash the traces of blood from yourself and perform Wudu'. That is a vein and is not menstruation.'\" It was said to him: \"What about Ghusl?' He (ﷺ) said: \"no one doubts that.\"Abu 'Abdur-Rahman said: \"I do not know anyone who mentioned 'and perform Wudu' in this Hadith except Hammad bin Zaid, for some others have reported it from Hisham, and they did not mention 'and perform Wudu' in it.\"",
      "chain": [
        "30459",
        "20022",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "225",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا يحيى بن حبيب بن عربي، قال حدثنا حماد، عن برد، عن عبادة بن نسى، عن غضيف بن الحارث، قال دخلت على عائشة رضى الله عنها فسألتها قلت أكان رسول الله صلى الله عليه وسلم يغتسل من أول الليل أو من آخره قالت كل ذلك ربما اغتسل من أوله وربما اغتسل من آخره ‏.‏ قلت الحمد لله الذي جعل في الأمر سعة ‏.‏",
      "text_en": " It was narrated that Ghudaif bin Al-Harith said:                      \"I entered upon 'Aishah and asked her: 'Did the Messenger of Allah (ﷺ) perform Ghusl at the beginning of the night or at the end?' She said: 'Both. Sometimes he performed Ghusl at the beginning and sometimes at the end.' I said: 'Praise be to Allah who has made the matter flexible.'\"",
      "chain": [
        "30459",
        "20022"
      ]
    },
    {
      "hadith_no": "295",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا يحيى بن حبيب بن عربي، عن حماد بن زيد، عن هشام بن عروة، عن فاطمة بنت المنذر، عن أسماء بنت أبي بكر، وكانت، تكون في حجرها أن امرأة استفتت النبي صلى الله عليه وسلم عن دم الحيض يصيب الثوب فقال ‏\"‏ حتيه ثم اقرصيه بالماء ثم انضحيه وصلي فيه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Asma' bint Abi Bakr taht a woman asked the Messenger of Allah (ﷺ) about menstrual blood that gets on clothes. He said:                      \"Scratch it, then rub it with water, then sprinkle water over it, and pray in it.\"",
      "chain": [
        "30459",
        "20022",
        "11065",
        "10526",
        "70"
      ]
    },
    {
      "hadith_no": "364",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Menstruation and Istihadah - كتاب الحيض والاستحاضة",
      "chapter_no": "3",
      "text_ar": "أخبرنا يحيى بن حبيب بن عربي، عن حماد، عن هشام بن عروة، عن أبيه، عن عائشة، قالت استحيضت فاطمة بنت أبي حبيش فسألت النبي صلى الله عليه وسلم فقالت يا رسول الله إني أستحاض فلا أطهر أفأدع الصلاة قال رسول الله صلى الله عليه وسلم ‏\"‏ إنما ذلك عرق وليست بالحيضة فإذا أقبلت الحيضة فدعي الصلاة وإذا أدبرت فاغسلي عنك الدم وتوضئي وصلي فإنما ذلك عرق وليست بالحيضة ‏\"‏ ‏.‏ قيل له فالغسل قال ‏\"‏ وذلك لا يشك فيه أحد ‏\"‏ ‏.‏ قال أبو عبد الرحمن قد روى هذا الحديث غير واحد عن هشام بن عروة ولم يذكر فيه ‏\"‏ وتوضئي ‏\"‏ ‏.‏ غير حماد والله تعالى أعلم ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                      \"Fatimah bint Abi Hubaish suffered from Istihadah and she asked the Prophet (ﷺ): 'O Messenger of Allah, I suffer from Istihadah and I do not become pure; should I stop praying?' The Messenger of Allah (ﷺ) said: 'That is a vein and is not menstruation. When your period comes, stop praying, and when it goes wash the traces of blood from yourself and do Wudu'. That is a vein and is not menstruation.'\"It was said to him (one of the narrators): \"What about Ghusl?\" He said: \"No one is in doubt about that.\"",
      "chain": [
        "30459",
        "20022",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "394",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Menstruation and Istihadah - كتاب الحيض والاستحاضة",
      "chapter_no": "3",
      "text_ar": "أخبرنا يحيى بن حبيب بن عربي، قال حدثنا حماد، عن هشام بن عروة، عن فاطمة بنت المنذر، عن أسماء بنت أبي بكر، - وكانت تكون في حجرها - أن امرأة استفتت النبي صلى الله عليه وسلم عن دم الحيض يصيب الثوب فقال ‏\"‏ حتيه واقرصيه وانضحيه وصلي فيه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Asma' bint Abi Bakr that a woman asked the Messenger of Allah (ﷺ) about menstrual blood that gets on clothes. He said:                      \"Scratch it, then rub it with water, then sprinkle water over it, and pray in it.\"",
      "chain": [
        "30459",
        "20022",
        "11065",
        "10526"
      ]
    },
    {
      "hadith_no": "405",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Ghusl and Tayammum - كتاب الغسل والتيمم",
      "chapter_no": "4",
      "text_ar": "أخبرنا يحيى بن حبيب بن عربي، قال حدثنا حماد، عن برد، عن عبادة بن نسى، عن غضيف بن الحارث، قال دخلت على عائشة فسألتها فقلت أكان رسول الله صلى الله عليه وسلم يغتسل من أول الليل أو من آخره قالت كل ذلك كان ربما اغتسل من أوله وربما اغتسل من آخره ‏‏.‏‏ قلت الحمد لله الذي جعل في الأمر سعة ‏‏.‏‏",
      "text_en": " It was narrated that Ghudaif bin Al-Harith said:                      \"I entered upon 'Aishah and asked her: 'Did the Messenger of Allah (ﷺ) perform Ghusl at the beginning of the night or at the end?' She said: 'Both. Sometimes he performed Ghusl at the beginning and sometimes at the end.' I said: 'Praise be to Allah who has made the matter flexible.'\"",
      "chain": [
        "30459",
        "20022"
      ]
    },
    {
      "hadith_no": "868",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا يحيى بن حبيب بن عربي، قال حدثنا حماد، قال حدثنا عاصم، عن عبد الله بن سرجس، قال جاء رجل ورسول الله صلى الله عليه وسلم في صلاة الصبح فركع الركعتين ثم دخل فلما قضى رسول الله صلى الله عليه وسلم صلاته قال ‏\"‏ يا فلان أيهما صلاتك التي صليت معنا أو التي صليت لنفسك ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Sarjis said:                      \"A man came while the Messenger of Allah (ﷺ) was praying Subh, and he prayed two Rak'ahs then joined the prayer. When the Messenger of Allah (ﷺ) had finished praying he said: O so-and-so, which of them is your prayer - the one you prayed withus or the one you prayed on your own?\"'",
      "chain": [
        "30459",
        "20022",
        "11080",
        "3245"
      ]
    },
    {
      "hadith_no": "1082",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا يحيى بن حبيب بن عربي، قال حدثنا حماد، عن غيلان بن جرير، عن مطرف، قال صليت أنا وعمران بن حصين، خلف علي بن أبي طالب فكان إذا سجد كبر وإذا رفع رأسه من السجود كبر وإذا نهض من الركعتين كبر فلما قضى صلاته أخذ عمران بيدي فقال لقد ذكرني هذا - قال كلمة يعني - صلاة محمد صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated that Mutarrif said:                     \"Imran bin Husain and I prayed behind Ali bin Abi Talib. When he prostrated he said the Takbir, and when he raised his head from prostration he said the takbir, and when he stood up following two rak'ahs he said the takbir, and when he had finished praying, 'Imran took my hand and said: 'This reminded me of- he said a word meaning- the prayer of Muhammad (ﷺ).'\"",
      "chain": [
        "30459",
        "20022",
        "11300",
        "11395"
      ]
    },
    {
      "hadith_no": "1177",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرني يحيى بن حبيب بن عربي البصري، قال حدثنا حماد بن زيد، عن يحيى، عن عبد الرحمن الأعرج، عن ابن بحينة، أن النبي صلى الله عليه وسلم صلى فقام في الشفع الذي كان يريد أن يجلس فيه فمضى في صلاته حتى إذا كان في آخر صلاته سجد سجدتين قبل أن يسلم ثم سلم ‏.‏",
      "text_en": " It was narrated from Ibn Buhainah that:                     The Prophet (ﷺ) prayed, then he stood up after two rak'ahs while he was supposed to sit, and he continued his prayer. Then at the end of his prayer, he performed two prostrations before the Salam, then he said the Salam.",
      "chain": [
        "30459",
        "20022",
        "20031",
        "11197",
        "932"
      ]
    },
    {
      "hadith_no": "1238",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا يحيى بن حبيب بن عربي، قال حدثنا خالد، عن ابن عجلان، عن زيد بن أسلم، عن عطاء بن يسار، عن أبي سعيد، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا شك أحدكم في صلاته فليلغ الشك وليبن على اليقين فإذا استيقن بالتمام فليسجد سجدتين وهو قاعد فإن كان صلى خمسا شفعتا له صلاته وإن صلى أربعا كانتا ترغيما للشيطان ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Sa'eed that:                     The Prophet (ﷺ) said: \"If one of you is not sure about his prayer, let him forget about what he is unsure of and complete his prayer on the basis of what he is sure of. When he is sure that he has completed it, let him prostrate twice while he is sitting. Then if he has prayed five (rak'ahs), they (the two prostrations) will make his prayer even-numbered, and if he had prayed four, they will annoy and humiliate the shaitan.\"",
      "chain": [
        "30459",
        "20423",
        "10616",
        "11163",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "1305",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا يحيى بن حبيب بن عربي، قال حدثنا حماد، قال حدثنا عطاء بن السائب، عن أبيه، قال صلى بنا عمار بن ياسر صلاة فأوجز فيها فقال له بعض القوم لقد خففت أو أوجزت الصلاة ‏.‏ فقال أما على ذلك فقد دعوت فيها بدعوات سمعتهن من رسول الله صلى الله عليه وسلم فلما قام تبعه رجل من القوم هو أبي غير أنه كنى عن نفسه فسأله عن الدعاء ثم جاء فأخبر به القوم ‏\"‏ اللهم بعلمك الغيب وقدرتك على الخلق أحيني ما علمت الحياة خيرا لي وتوفني إذا علمت الوفاة خيرا لي اللهم وأسألك خشيتك في الغيب والشهادة وأسألك كلمة الحق في الرضا والغضب وأسألك القصد في الفقر والغنى وأسألك نعيما لا ينفد وأسألك قرة عين لا تنقطع وأسألك الرضاء بعد القضاء وأسألك برد العيش بعد الموت وأسألك لذة النظر إلى وجهك والشوق إلى لقائك في غير ضراء مضرة ولا فتنة مضلة اللهم زينا بزينة الإيمان واجعلنا هداة مهتدين ‏\"‏ ‏.‏",
      "text_en": " Ata bn As-Sa'ib narrated that his father said:                     \"Ammar bin Yasir led us in prayer and he made it brief. Some of the people said to him: 'You made the prayer sort (or brief).' He said: 'Nevertheless I still recited supplications that I heard from the Messenger of Allah (ﷺ).' When he got up and left,  a man- he was my father but he did not name himself- followed him and asked him about that supplication, then he came and told the people. \"Allahumma bi 'ilmikal-ghaiba wa qudratika 'alal-khalqi ahini ma 'alimtal-hayata khairan li, wa tawaffani idha 'alimtal-wafata khairan li. Allahumma as'aluka khashyataka fil-ghaibi wash-shahadati wa as'aluka kalimatul-aqua fir-rida'i wal ghadab, wa as'alukal-qasda fil faqr wal-ghina, wa as'aluka na'iman la yanfadu wa as'aluka qurrata ainan la tanqati'u wa as'alukar-rida'i ba'dal-qada'i wa as'aluka bardal 'aishi ba'dal-mawti, wa as'aluka ladhatan-nazari ila wajhika wash-shawqa ila liqa'ika fi fitnatin mudillatin, Allahumma zayyina dizinatil-imani waj'alna hudatan muhtadin (O Alah, by Your knowledge of the unseen and Your power over creation, keep me alive so long as You know that living is good for me and cause me to die when You know that death is better for me. O Allah, cause me to fear You in secret and in public. I ask You to make me true in speech in times of pleasure and of anger. I ask You to make me moderate in times of wealth and poverty. And I ask You for everlasting delight and joy that will never cease. I ask You to make me pleased with that which You have decreed and for an easy life after death. I askYou for the sweetness of looking upon Your face and a longing to meet You in a manner that does not entail a calamity that will bring about harm or a trial that will cause deviation. O Allah, beautify us with the adornment of faith and make us among those who guide and are rightly guided.\"",
      "chain": [
        "30459",
        "20022",
        "11068",
        "19867"
      ]
    },
    {
      "hadith_no": "1331",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا يحيى بن حبيب بن عربي، قال حدثنا حماد، قال حدثنا خالد، عن أبي قلابة، عن أبي المهلب، عن عمران بن حصين، أن النبي صلى الله عليه وسلم صلى ثلاثا ثم سلم فقال الخرباق إنك صليت ثلاثا ‏.‏ فصلى بهم الركعة الباقية ثم سلم ثم سجد سجدتى السهو ثم سلم ‏.‏",
      "text_en": " It was narrated from 'Imran bin Husain that:                     The Prophet (ﷺ) prayed three (rak'ahs) then said the taslim. Al-Khirbaq said: \"You prayed three.\" So he led them in praying the remaining rak'ah, then he said the taslim, then he did the two prostrations of forgetfulness, then he said the taslim (again).",
      "chain": [
        "30459",
        "20022",
        "20423",
        "11047",
        "123"
      ]
    },
    {
      "hadith_no": "1348",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا يحيى بن حبيب بن عربي، قال حدثنا حماد، عن عطاء بن السائب، عن أبيه، عن عبد الله بن عمرو، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ خلتان لا يحصيهما رجل مسلم إلا دخل الجنة وهما يسير ومن يعمل بهما قليل ‏\"‏ ‏.‏ قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الصلوات الخمس يسبح أحدكم في دبر كل صلاة عشرا ويحمد عشرا ويكبر عشرا فهي خمسون ومائة في اللسان وألف وخمسمائة في الميزان ‏\"‏ ‏.‏ وأنا رأيت رسول الله صلى الله عليه وسلم يعقدهن بيده ‏\"‏ وإذا أوى أحدكم إلى فراشه أو مضجعه سبح ثلاثا وثلاثين وحمد ثلاثا وثلاثين وكبر أربعا وثلاثين فهي مائة على اللسان وألف في الميزان ‏\"‏ ‏.‏ قال قال رسول الله صلى الله عليه وسلم ‏\"‏ فأيكم يعمل في كل يوم وليلة ألفين وخمسمائة سيئة ‏\"‏ ‏.‏ قيل يا رسول الله وكيف لا نحصيهما فقال ‏\"‏ إن الشيطان يأتي أحدكم وهو في صلاته فيقول اذكر كذا اذكر كذا ويأتيه عند منامه فينيمه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abdullah in 'Umar said:                     \"The Messenger of Allah (ﷺ) said: 'There are two qualities which no Muslim person attains but he will enter Paradise, and they are easy, but those who do them are few.' The Messenger of Allah (ﷺ) said: 'The five daily prayers: After each prayer one of you glorifies Allah (SWT) ten times and praises Him ten times and magnifies him ten times, which makes one hundred and fifty on the tongue and one thousand five hundred in the balance.' And I saw the Messenger of Allah (ﷺ) counting them on his hands. 'And when one of you retires to his bed he says the tasbih thirty-three times and the tahmid thirty-three times and the takbir thirty-four times, that is one hundred on the tongue and one thousand in the balance.' The Messenger of Allah (ﷺ) said: \"So which of you does two thousand five hundred bad deeds in a day and a night?\" It was said: \"O Messenger of Allah (ﷺ), how can a person not persist in doing that?\" He said: \"The Shaitan comes to one of you when he is praying and says: 'Remember such and such, remember such and such,\" or he comes to him when he is in bed and makes him fall asleep.\"",
      "chain": [
        "30459",
        "20022",
        "11068",
        "19867",
        "29"
      ]
    },
    {
      "hadith_no": "1636",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا يحيى بن حبيب بن عربي، وإسماعيل بن مسعود، قالا حدثنا معتمر، قال سمعت أبي قال، سمعت أنسا، يقول أخبرني بعض، أصحاب النبي صلى الله عليه وسلم أن النبي صلى الله عليه وسلم ليلة أسري به مر على موسى عليه السلام وهو يصلي في قبره ‏.‏",
      "text_en": " Mu'tamir said:                     \"I heard my father say: I heard Anas say: 'One of the companions of the Prophet (ﷺ) told me that on the Night Journey, the Prophet (ﷺ) passed by Musa, peace be upon him, and he was praying in his grave.'\"",
      "chain": [
        "30459",
        "34033",
        "20288",
        "11289",
        "19"
      ]
    },
    {
      "hadith_no": "1808",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا يحيى بن حبيب، قال حدثنا حماد، عن عاصم، عن أبي صالح، عن أم حبيبة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ من صلى في يوم ثنتى عشرة ركعة سوى الفريضة بنى الله له أو بني له بيت في الجنة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Umm Habibah said:                     \"The Messenger of Allah (ﷺ) said: 'Whoever prays twelve rak'ahs in a day apart from the obligatory prayers, Allah (SWT) will build for him, or there will be built for him, a house in Paradise.'\"",
      "chain": [
        "30459",
        "20022",
        "11080",
        "11161",
        "59"
      ]
    },
    {
      "hadith_no": "2233",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا يحيى بن حبيب بن عربي، قال حدثنا حماد، قال حدثنا واصل، عن بشار بن أبي سيف، عن الوليد بن عبد الرحمن، عن عياض بن غطيف، قال أبو عبيدة سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ الصوم جنة ما لم يخرقها ‏\"‏ ‏.‏",
      "text_en": " Abu 'Ubaidah said:                     \"I heard the Messenger of Allah say: 'Fasting is a shield, so long as you do not damage it.\"'",
      "chain": [
        "30459",
        "20022",
        "14034",
        "10975",
        "18842"
      ]
    },
    {
      "hadith_no": "2309",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا يحيى بن حبيب بن عربي، قال حدثنا حماد، عن سعيد الجريري، عن أبي نضرة، قال حدثنا أبو سعيد، قال كنا نسافر في رمضان فمنا الصائم ومنا المفطر لا يعيب الصائم على المفطر ولا يعيب المفطر على الصائم ‏.‏",
      "text_en": " Abu Saeed said:                     \"We were traveling in Ramadan and among us were some who were fasting and some who were not. Those who were fasting did not criticize those who were not, and those who were not fasting did not criticize those who were.\"",
      "chain": [
        "30459",
        "20022",
        "11286",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "2384",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا يحيى بن حبيب بن عربي، قال حدثنا حماد، عن هشام، عن أبيه، عن عائشة، أن حمزة بن عمرو الأسلمي، سأل رسول الله صلى الله عليه وسلم فقال يا رسول الله إني رجل أسرد الصوم أفأصوم في السفر قال ‏\"‏ صم إن شئت أو أفطر إن شئت ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Aishah that Hamzah bin 'Amr Al-Aslami asked the Messenger of Allah:                     \"O Messenger of Allah, I am a man who fasts continually: shoud I fast when traveling?\" He said: \"Fast if you wish and break you fast if you wish.\" 'Ata said: \"someone who heard him told me that Ibn 'Umar (said) that the Prophet said: 'Whoever fasts every day of his life, and then he has not fasted.\"",
      "chain": [
        "30459",
        "20022",
        "11065",
        "10511",
        "53",
        "4123"
      ]
    },
    {
      "hadith_no": "2473",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا يحيى بن حبيب بن عربي، عن حماد، قال حدثنا يحيى، - وهو ابن سعيد - عن عمرو بن يحيى، عن أبيه، عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ليس فيما دون خمسة أواق صدقة ولا فيما دون خمس ذود صدقة وليس فيما دون خمس أوسق صدقة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Saeed Al-Khudri said:                     \"The Messenger of Allah said: 'No Sadaqah is due on anything less than five Awaq, no Sadaqah is due on less than five Dhawh (head of camel), and no Sadaqah is due on less than five Awsuq.\"[1] 2476. It was narrated from Abu Sa 'eed Al-Khudri that the Messenger of Allah said: \"No Sadaqah is due on lessthan five Awsuq of dates, no Sadaqah is due on less than five Awaq of silver, and no Sadaqah is due on less than five Dhawd (head) of camels.",
      "chain": [
        "30459",
        "20022",
        "20031",
        "11210",
        "11232",
        "38"
      ]
    },
    {
      "hadith_no": "2579",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا يحيى بن حبيب بن عربي، عن حماد، عن هارون بن رئاب، قال حدثني كنانة بن نعيم، ح وأخبرنا علي بن حجر، - واللفظ له - قال حدثنا إسماعيل، عن أيوب، عن هارون، عن كنانة بن نعيم، عن قبيصة بن مخارق، قال تحملت حمالة فأتيت النبي صلى الله عليه وسلم فسألته فيها فقال ‏\"‏ إن المسألة لا تحل إلا لثلاثة رجل تحمل بحمالة بين قوم فسأل فيها حتى يؤديها ثم يمسك ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Qubaisah bin Mukhariq said:                     \"I undertook a financial responsibility. [1] Then I came to the Prophet and asked him (for help) concerning that. He said: 'Asking (for money) is not permissible except for three: A man who undertakes a financial responsibility between people; he may ask for help with that until the matter is settled, then he should refrain (from asking).\"'",
      "chain": [
        "30459",
        "20022",
        "10974",
        "10713",
        "20387",
        "20208",
        "11015",
        "10713"
      ]
    },
    {
      "hadith_no": "2717",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا يحيى بن حبيب بن عربي، عن حماد، عن هشام، عن أبيه، عن عائشة، قالت خرجنا مع رسول الله صلى الله عليه وسلم موافين لهلال ذي الحجة فقال رسول الله صلى الله عليه وسلم ‏\"‏ من شاء أن يهل بحج فليهل ومن شاء أن يهل بعمرة فليهل بعمرة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                      \"We went out with the Messenger of Allah around the time of the new moon of Dhul-Hijjah, and the Messenger of Allah said: 'Whoever wishes to enter Ihram for Hajj, let him do so , and whoever wishes to enter Ihram for 'Umrah, let him do so'\"",
      "chain": [
        "30459",
        "20022",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2998",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا يحيى بن حبيب بن عربي، قال حدثنا حماد، عن يحيى بن سعيد الأنصاري، عن عبد الله بن أبي سلمة، عن ابن عمر، قال غدونا مع رسول الله صلى الله عليه وسلم من منى إلى عرفة فمنا الملبي ومنا المكبر ‏.‏",
      "text_en": " It was narrated that Ibn Umar said:                     \"We left Mina with the Messenger of Allah for AArafat, and some of us were reciting the Talbiyah and some reciting the Takbir.\"",
      "chain": [
        "30459",
        "20022",
        "11062",
        "10929",
        "18"
      ]
    },
    {
      "hadith_no": "3026",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا يحيى بن حبيب بن عربي، عن حماد، عن يحيى، عن عدي بن ثابت، عن عبد الله بن يزيد، عن أبي أيوب، أن رسول الله صلى الله عليه وسلم جمع بين المغرب والعشاء بجمع ‏.‏",
      "text_en": " It was narrated from Abu Ayyub that:                     the Messenger of Allah joined Maghrib and Isha in Jam (Al-Muzdalifah).",
      "chain": [
        "30459",
        "20022",
        "20031",
        "11372",
        "1945",
        "33"
      ]
    },
    {
      "hadith_no": "3172",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا يحيى بن حبيب بن عربي، قال حدثنا حماد، عن يحيى بن سعيد، عن محمد بن يحيى بن حبان، عن أنس بن مالك، عن أم حرام بنت ملحان، قالت أتانا رسول الله صلى الله عليه وسلم وقال عندنا فاستيقظ وهو يضحك فقلت يا رسول الله بأبي وأمي ما أضحكك قال ‏\"‏ رأيت قوما من أمتي يركبون هذا البحر كالملوك على الأسرة ‏\"‏ ‏.‏ قلت ادع الله أن يجعلني منهم ‏.‏ قال ‏\"‏ فإنك منهم ‏\"‏ ‏.‏ ثم نام ثم استيقظ وهو يضحك فسألته فقال يعني مثل مقالته قلت ادع الله أن يجعلني منهم ‏.‏ قال ‏\"‏ أنت من الأولين ‏\"‏ ‏.‏ فتزوجها عبادة بن الصامت فركب البحر وركبت معه فلما خرجت قدمت لها بغلة فركبتها فصرعتها فاندقت عنقها ‏.‏",
      "text_en": " It was narrated from Anas bin Malik that Umm Haram bint Milhan said:                      \"The Messenger of Allah (ﷺ) came to us and took a nap in our house, then he woke up smiling. I said: 'O Messenger of Allah, may my father and mother be ransomed for you, what has made you smile?' He said: 'I saw some people of my Ummah riding on the sea like kings on thrones.' I said: 'Pray to Allah to make me one of them.' He said: 'You will be one of them.' Then he slept again, and woke up smiling. I asked him and he said the same thing. I said: 'Pray to Allah to make me one of them.' He said: 'You will be one of the first.' Then 'Ubadah bin As-Samit married her, and he traveled by sea, and she traveled with him, but when she came ashore a mule was brought to her and she mounted it, and it threw her off and broke her neck.\"",
      "chain": [
        "30459",
        "20022",
        "20031",
        "11222",
        "19",
        "209"
      ]
    },
    {
      "hadith_no": "3541",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا يحيى بن حبيب بن عربي، قال حدثنا حماد، عن يحيى بن سعيد، عن حميد بن نافع، عن زينب، أن امرأة، سألت أم سلمة وأم حبيبة أتكتحل في عدتها من وفاة زوجها فقالت أتت امرأة إلى النبي صلى الله عليه وسلم فسألته عن ذلك فقال ‏\"‏ قد كانت إحداكن في الجاهلية إذا توفي عنها زوجها أقامت سنة ثم قذفت خلفها ببعرة ثم خرجت وإنما هي أربعة أشهر وعشرا حتى ينقضي الأجل ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Zainab that a woman asked Umm Salamah and Umm Habibah whether she could put on kohl during her 'Iddah following her husband's death. She said:                      \"A woman came to the Prophet and asked him about that, and he said: 'During the Jahiliyyah, if her husband died, one of you would stay (in mourning) for a year, then she would throw a piece of dung then come out. Rather it (the mourning period) is four months and ten days, until the term prescribed is fulfilled.'\"",
      "chain": [
        "30459",
        "20022",
        "20031",
        "11157",
        "57"
      ]
    },
    {
      "hadith_no": "3902",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا يحيى بن حبيب بن عربي، في حديثه عن حماد بن زيد، عن يحيى بن سعيد، عن حنظلة بن قيس، عن رافع بن خديج، قال نهانا رسول الله صلى الله عليه وسلم عن كراء أرضنا ولم يكن يومئذ ذهب ولا فضة فكان الرجل يكري أرضه بما على الربيع والأقبال وأشياء معلومة وساقه‏.‏‏ رواه سالم بن عبد الله بن عمر عن رافع بن خديج واختلف على الزهري فيه‏.‏‏",
      "text_en": " It was narrated that Rafi' bin Khadij said:                      \"The Messenger of Allah forbade us to lease our land. At that time there was no gold nor silver. A man would lease his land in return for what grew on the banks of streams and where the springs emerged, and in return for something specific.\"",
      "chain": [
        "30459",
        "20022",
        "20031",
        "11503",
        "1986"
      ]
    },
    {
      "hadith_no": "3919",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا يحيى بن حبيب بن عربي، عن حماد بن زيد، عن عمرو بن دينار، قال سمعت ابن عمر، يقول كنا لا نرى بالخبر بأسا حتى كان عام الأول فزعم رافع أن نبي الله صلى الله عليه وسلم نهى عنه‏.‏‏ خالفه عارم فقال عن حماد عن عمرو عن جابر‏.‏‏",
      "text_en": " It was narrated that 'Amr bin Dinar said:                      \"I heard Ibn 'Umar say: 'We did not see anything wrong with Al-Khibr until last year, when Rafi' said that the Prophet of Allah forbade it.'\"",
      "chain": [
        "30459",
        "20022",
        "11081",
        "18"
      ]
    },
    {
      "hadith_no": "4163",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of al-Bay'ah - كتاب البيعة",
      "chapter_no": "39",
      "text_ar": "أخبرنا يحيى بن حبيب بن عربي، قال حدثنا حماد بن زيد، عن عطاء بن السائب، عن أبيه، عن عبد الله بن عمرو، أن رجلا، أتى النبي صلى الله عليه وسلم فقال إني جئت أبايعك على الهجرة ولقد تركت أبوى يبكيان ‏.‏ قال ‏\"‏ ارجع إليهما فأضحكهما كما أبكيتهما ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin 'Amr that a man came to the Prophet and said:                     \"I have come pledging to emigrate (Hijrah), and I have left my parents weeping.\" He said: \"Go back to them, and make them smile as you made them weep.\"",
      "chain": [
        "30459",
        "20022",
        "11068",
        "19867",
        "29"
      ]
    },
    {
      "hadith_no": "4793",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرني يحيى بن حبيب بن عربي، قال أنبأنا حماد، عن خالد، - يعني الحذاء - عن القاسم بن ربيعة، عن عقبة بن أوس، عن عبد الله، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ألا وإن قتيل الخطإ شبه العمد ما كان بالسوط والعصا مائة من الإبل أربعون في بطونها أولادها ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abdullah bin 'Amr that the prophet said:                     \"Indeed the accidental killing, which seems intentional, with a whip or a stick, (the Diyah) is one hundred camels, of which forty should be (she-camels) with their young in their wombs.\"",
      "chain": [
        "30459",
        "20022",
        "11282",
        "14317",
        "5186",
        "16"
      ]
    },
    {
      "hadith_no": "4962",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرني يحيى بن حبيب بن عربي، قال حدثنا حماد، عن يحيى، عن محمد بن يحيى بن حبان، عن رافع بن خديج، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا قطع في ثمر ولا كثر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Rafi bin Khadij said:                     \"I heard the Messenger of Allah say: 'The hand is not to be cut off for (stealing) produce or the spadix of palm trees.\"'",
      "chain": [
        "30459",
        "20022",
        "20031",
        "11222",
        "1986"
      ]
    },
    {
      "hadith_no": "5006",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book Of Faith and its Signs - كتاب الإيمان وشرائعه",
      "chapter_no": "47",
      "text_ar": "حدثنا يحيى بن حبيب بن عربي، قال حدثنا خالد، - يعني ابن الحارث - عن ابن عجلان، عن عبد الله بن دينار، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ الحياء شعبة من الإيمان ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     The Prophet [SAW] said: \"Modesty (Al-Haya') is a branch of Faith.\"",
      "chain": [
        "30459",
        "20226",
        "10616",
        "11183",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "195",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا إبراهيم بن المنذر الحزامي، ويحيى بن حبيب بن عربي، قالا حدثنا موسى بن إبراهيم بن كثير الأنصاري الحرامي، قال سمعت طلحة بن خراش، قال سمعت جابر بن عبد الله، يقول لما قتل عبد الله بن عمرو بن حرام يوم أحد لقيني رسول الله  صلى الله عليه وسلم  فقال ‏\"‏ يا جابر ألا أخبرك ما قال الله لأبيك ‏\"‏ ‏.‏ وقال يحيى في حديثه فقال ‏\"‏ يا جابر مالي أراك منكسرا ‏\"‏ ‏.‏ قال قلت يا رسول الله استشهد أبي وترك عيالا ودينا ‏.‏ قال ‏\"‏ أفلا أبشرك بما لقي الله به أباك ‏\"‏ ‏.‏ قال بلى يا رسول الله ‏.‏ قال ‏\"‏ ما كلم الله أحدا قط إلا من وراء حجاب وكلم أباك كفاحا ‏.‏ فقال يا عبدي تمن على أعطك ‏.‏ قال يا رب تحييني فأقتل فيك ثانية ‏.‏ فقال الرب سبحانه إنه سبق مني أنهم إليها لا يرجعون ‏.‏ قال يا رب فأبلغ من ورائي ‏.‏ قال فأنزل الله تعالى ‏{ولا تحسبن الذين قتلوا في سبيل الله أمواتا بل أحياء عند ربهم يرزقون}‏ ‏\"‏ ‏.‏",
      "text_en": " Talhah bin Khirash said:                     \"I head Jabir bin 'Abdullah say\" 'When 'Abdullah bin 'Amr bin )Haram) was killed on the Day of Uhud, the Messenger of Allah met me, and said: \"O Jabir, shall I not tell you what Allah has said to your father?\" Yahya said in his Hadith: \"And he said: 'O Jabir, why do I see you broken-hearted?' I (Jabir) said: 'O Messenger of Allah, my father has been martyred and he has left behind dependents and debts.' He said: 'Shall I not give you the glad tidings of that with which Allah met your father?' I said: 'Yes, O Messenger of Allah.' He said: 'Allah never spoke to anyone except from behind a screen, but He spoke to your father directly, and He said: \"O My slave! Ask something from Me and I shall give it to you.\" He said: \"O Lord, bring me back to life so that I may be killed in Your cause a second time.\" The Lord, Glorified is He, said: \"I have already decreed that they will not return to life.\" He said: \"My Lord, then convey (this news) to those whom I have left behind.\" Allah said: \"Think not of those as dead who are killed in the way of Allah, Nay, they are alive, with their Lord, and they have provision.\"",
      "chain": [
        "30308",
        "30459",
        "19046",
        "12192",
        "34"
      ]
    }
  ],
  "total_hadiths": 50
}