{
  "id": "30450",
  "name": "Ibn Abi al-Shuwarab محمد بن عبد الملك بن أبي الشوارب",
  "full_name": "Ibn Abi al-Shuwarab محمد بن عبد الملك بن أبي الشوارب",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "244",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ م  ت  س  ق  -  صدوق ]"
    ],
    "tags": [
      "Quraish",
      "B.Umayya",
      "al-Abli",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "18873",
      "name": "Kathir bin Slym al-Dby كثير بن سليم الضبي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20252",
      "name": "'Abdul 'Aziz bin al-Mukhtar عبد العزيز بن المختار",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20469",
      "name": "Wadah bin 'Abdullah al-Yashkari وضاح بن عبد الله اليشكري أبو عوانة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20027",
      "name": "Yusuf bin Y'aqub bin Abi Salma يوسف بن يعقوب بن أبي سلمة الماجشون",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20304",
      "name": "Yazid bin Zari' يزيد بن زريع",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20256",
      "name": "'Abdul Wahid bin Ziyad عبد الواحد بن زياد العبدي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20258",
      "name": "'Abdul Warith bin Sa'id bin Dhakwan عبد الوارث بن سعيد بن ذكوان",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "24515",
      "name": "Abu 'Asim al-'Abdani أبو عاصم العباداني",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "students": [
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]"
    },
    {
      "id": "30005",
      "name": "Imam Tirmidhi الترمذي محمد بن عيسى بن سورة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30006",
      "name": "Imam Nasa'i أحمد بن شعيب بن علي بن سنان النسائي",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30004",
      "name": "Ibn Maja ابن ماجة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "36621",
      "name": "Muhammad bin Isma'il bin Yusuf محمد بن إسماعيل بن يوسف",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30013",
      "name": "Ibn Abi Dunya ابن أبي الدنيا",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "40010",
      "name": "Muhammad bin Jarir At-Tabari أبو جعفر محمد بن جرير الطبري",
      "grade": "4th Century AH [Other]"
    }
  ],
  "hadiths": [
    {
      "id": "jami-al-tirmidhi-19",
      "hadith_no": "19",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا قتيبة، ومحمد بن عبد الملك بن أبي الشوارب البصري، قالا حدثنا أبو عوانة، عن قتادة، عن معاذة، عن عائشة، قالت مرن أزواجكن أن يستطيبوا، بالماء فإني أستحييهم فإن رسول الله صلى الله عليه وسلم كان يفعله ‏\"‏ ‏.‏ وفي الباب عن جرير بن عبد الله البجلي وأنس وأبي هريرة ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وعليه العمل عند أهل العلم يختارون الاستنجاء بالماء وإن كان الاستنجاء بالحجارة يجزئ عندهم فإنهم استحبوا الاستنجاء بالماء ورأوه أفضل ‏.‏ وبه يقول سفيان الثوري وابن المبارك والشافعي وأحمد وإسحاق ‏.‏",
      "text_en": " Aishah said:                     \"Encourage your Husbands to clean themselves with water, for I am too shy of them, and Allah's Messenger would do that.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "30450",
        "20469",
        "11019",
        "11456",
        "53"
      ]
    },
    {
      "id": "jami-al-tirmidhi-165",
      "hadith_no": "165",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن عبد الملك بن أبي الشوارب، حدثنا أبو عوانة، عن أبي بشر، عن بشير بن ثابت، عن حبيب بن سالم، عن النعمان بن بشير، قال أنا أعلم الناس، بوقت هذه الصلاة كان رسول الله صلى الله عليه وسلم يصليها لسقوط القمر لثالثة ‏\"‏ ‏.‏",
      "text_en": " An-Nu'man bin Bashir said:                     \"I am the most knowledgeable among the people about the prescribed time of this prayer: Allah's Messenger would pray it when the moon set on the third (of the month).\"",
      "usc_msa_ref": "",
      "chain": [
        "30450",
        "20469",
        "11419",
        "14038",
        "11837",
        "274"
      ]
    },
    {
      "id": "jami-al-tirmidhi-327",
      "hadith_no": "327",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن عبد الملك بن أبي الشوارب، حدثنا يزيد بن زريع، حدثنا معمر، عن الزهري، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا أقيمت الصلاة فلا تأتوها وأنتم تسعون ولكن ائتوها وأنتم تمشون وعليكم السكينة فما أدركتم فصلوا وما فاتكم فأتموا ‏\"‏ ‏.‏ وفي الباب عن أبي قتادة وأبى بن كعب وأبي سعيد وزيد بن ثابت وجابر وأنس ‏.‏ قال أبو عيسى اختلف أهل العلم في المشى إلى المسجد فمنهم من رأى الإسراع إذا خاف فوت التكبيرة الأولى حتى ذكر عن بعضهم أنه كان يهرول إلى الصلاة ‏.‏ ومنهم من كره الإسراع واختار أن يمشي على تؤدة ووقار وبه يقول أحمد وإسحاق وقالا العمل على حديث أبي هريرة ‏.‏ وقال إسحاق إن خاف فوت التكبيرة الأولى فلا بأس أن يسرع في المشى ‏.‏",
      "text_en": " Abu Hurairah narrated that :                     Allah's Messenger said: \"When the Iqamah is called for Salat do not come to it rushing, rather come to it walking, and while you have tranquility. What you catch of it then pray it, and what you missed of it, then complete it.\"",
      "usc_msa_ref": "",
      "chain": [
        "30450",
        "20304",
        "20115",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-337",
      "hadith_no": "337",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن عبد الملك بن أبي الشوارب، حدثنا يزيد بن زريع، حدثنا معمر، عن الزهري، عن عبيد الله بن عبد الله بن عتبة، عن ابن عباس، قال كنت رديف الفضل على أتان فجئنا والنبي صلى الله عليه وسلم يصلي بأصحابه بمنى ‏.‏ قال فنزلنا عنها فوصلنا الصف فمرت بين أيديهم فلم تقطع صلاتهم ‏.‏ قال أبو عيسى وفي الباب عن عائشة والفضل بن عباس وابن عمر ‏.‏ قال أبو عيسى وحديث ابن عباس حديث حسن صحيح ‏.‏ والعمل عليه عند أكثر أهل العلم من أصحاب النبي صلى الله عليه وسلم ومن بعدهم من التابعين قالوا لا يقطع الصلاة شيء ‏.‏ وبه يقول سفيان الثوري والشافعي ‏.‏",
      "text_en": " Ibn Abbas narrated:                     \"I was a companion rider on a female donkey with Al-Fadl. We came while the Prophet and his Companions were performing Salat at Mina.\" He said: \"We dismounted from it and joined the row. The donkey then passed in front of them, and this did not invalidate their Salat.\"",
      "usc_msa_ref": "",
      "chain": [
        "30450",
        "20304",
        "20115",
        "11013",
        "11004",
        "17"
      ]
    },
    {
      "id": "jami-al-tirmidhi-561",
      "hadith_no": "561",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Traveling - أَبْوَابُ السَّفَرِ",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن عبد الملك بن أبي الشوارب، حدثنا يزيد بن زريع، حدثنا معمر، عن الزهري، عن عروة، عن عائشة، أنها قالت خسفت الشمس على عهد رسول الله صلى الله عليه وسلم فصلى رسول الله صلى الله عليه وسلم بالناس فأطال القراءة ثم ركع فأطال الركوع ثم رفع رأسه فأطال القراءة وهي دون الأولى ثم ركع فأطال الركوع وهو دون الأول ثم رفع رأسه فسجد ثم فعل مثل ذلك في الركعة الثانية ‏.‏ قال أبو عيسى وهذا حديث حسن صحيح ‏.‏ وبهذا الحديث يقول الشافعي وأحمد وإسحاق يرون صلاة الكسوف أربع ركعات في أربع سجدات ‏.‏ قال الشافعي يقرأ في الركعة الأولى بأم القرآن ونحوا من سورة البقرة سرا إن كان بالنهار ثم ركع ركوعا طويلا نحوا من قراءته ثم رفع رأسه بتكبير وثبت قائما كما هو وقرأ أيضا بأم القرآن ونحوا من آل عمران ثم ركع ركوعا طويلا نحوا من قراءته ثم رفع رأسه ثم قال ‏\"‏ سمع الله لمن حمده ‏\"‏ ‏.‏ ثم سجد سجدتين تامتين ويقيم في كل سجدة نحوا مما أقام في ركوعه ثم قام فقرأ بأم القرآن ونحوا من سورة النساء ثم ركع ركوعا طويلا نحوا من قراءته ثم رفع رأسه بتكبير وثبت قائما ثم قرأ نحوا من سورة المائدة ثم ركع ركوعا طويلا نحوا من قراءته ثم رفع فقال ‏\"‏ سمع الله لمن حمده ‏\"‏ ‏.‏ ثم سجد سجدتين ثم تشهد وسلم ‏.‏",
      "text_en": " Aishah narrated:                     \"The sun was eclipsed during the time of the Messenger of Allah, so the Messenger of Allah led the people in prayer. He recited a lengthy recitation, then he bowed a lengthy bowing, then he raised his head and recited a lengthy recitation that was less than the first. Then he bowed a lengthy bowing that was less than the first. Then he raised his head and prostrated. Then he did (similar to) that in the second Rak'ah.\"",
      "usc_msa_ref": "",
      "chain": [
        "30450",
        "20304",
        "20115",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "id": "jami-al-tirmidhi-564",
      "hadith_no": "564",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Traveling - أَبْوَابُ السَّفَرِ",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن عبد الملك بن أبي الشوارب، حدثنا يزيد بن زريع، حدثنا معمر، عن الزهري، عن سالم، عن أبيه، أن النبي صلى الله عليه وسلم صلى صلاة الخوف بإحدى الطائفتين ركعة والطائفة الأخرى مواجهة العدو ثم انصرفوا فقاموا في مقام أولئك وجاء أولئك فصلى بهم ركعة أخرى ثم سلم عليهم فقام هؤلاء فقضوا ركعتهم وقام هؤلاء فقضوا ركعتهم ‏.‏ قال أبو عيسى هذا حديث صحيح ‏.‏ وقد روى موسى بن عقبة عن نافع عن ابن عمر مثل هذا ‏.‏ قال وفي الباب عن جابر وحذيفة وزيد بن ثابت وابن عباس وأبي هريرة وابن مسعود وسهل بن أبي حثمة وأبي عياش الزرقي واسمه زيد بن صامت وأبي بكرة ‏.‏ قال أبو عيسى وقد ذهب مالك بن أنس في صلاة الخوف إلى حديث سهل بن أبي حثمة وهو قول الشافعي ‏.‏ وقال أحمد قد روي عن النبي صلى الله عليه وسلم صلاة الخوف على أوجه وما أعلم في هذا الباب إلا حديثا صحيحا وأختار حديث سهل بن أبي حثمة ‏.‏ وهكذا قال إسحاق بن إبراهيم قال ثبتت الروايات عن النبي صلى الله عليه وسلم في صلاة الخوف ‏.‏ ورأى أن كل ما روي عن النبي صلى الله عليه وسلم في صلاة الخوف فهو جائز وهذا على قدر الخوف ‏.‏ قال إسحاق ولسنا نختار حديث سهل بن أبي حثمة على غيره من الروايات ‏.‏",
      "text_en": " Salim narrated from his father:                     \"The Prophet prayed Salat Al-Khawf, praying one Rak'ah with one of the two groups, while the other group was facing the enemy. (When the first group finished they first Rak'ah with him), they went and took position (of the second group, facing the enemy). Then the second group came and he led them in another Rak'ah, then he said the Taslim to them, while the group proceeded to complete their (second) Rak'ah. Thereafter, the first group stood up to finish their (second) Rak'ah.\"",
      "usc_msa_ref": "",
      "chain": [
        "30450",
        "20304",
        "20115",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "id": "jami-al-tirmidhi-620",
      "hadith_no": "620",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Zakat - كتاب الزكاة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "7",
      "text_ar": "حدثنا محمد بن عبد الملك بن أبي الشوارب، حدثنا أبو عوانة، عن أبي إسحاق، عن عاصم بن ضمرة، عن علي، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ قد عفوت عن صدقة الخيل والرقيق فهاتوا صدقة الرقة من كل أربعين درهما درهما وليس في تسعين ومائة شيء فإذا بلغت مائتين ففيها خمسة الدراهم ‏\"‏ ‏.‏ وفي الباب عن أبي بكر الصديق وعمرو بن حزم ‏.‏ قال أبو عيسى روى هذا الحديث الأعمش وأبو عوانة وغيرهما عن أبي إسحاق عن عاصم بن ضمرة عن علي وروى سفيان الثوري وابن عيينة وغير واحد عن أبي إسحاق عن الحارث عن علي ‏.‏ قال وسألت محمدا عن هذا الحديث فقال كلاهما عندي صحيح عن أبي إسحاق يحتمل أن يكون روي عنهما جميعا ‏.‏",
      "text_en": " Ali narrated that :                     the Messenger of Allah said: \"I have exempted charity on horses and slaves. So bring charity for silver, one Dirham for every forty Dirham. There is nothing for me (to collect) on one hundred and ninety Dirham, so when it reaches two hundred, then five Dirham of it (are due).\"",
      "usc_msa_ref": "",
      "chain": [
        "30450",
        "20469",
        "11049",
        "19871",
        "5"
      ]
    },
    {
      "id": "jami-al-tirmidhi-771",
      "hadith_no": "771",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا محمد بن عبد الملك بن أبي الشوارب، حدثنا يزيد بن زريع، حدثنا معمر، عن الزهري، عن أبي عبيد، مولى عبد الرحمن بن عوف قال شهدت عمر بن الخطاب في يوم النحر بدأ بالصلاة قبل الخطبة ثم قال سمعت رسول الله صلى الله عليه وسلم ينهى عن صوم هذين اليومين أما يوم الفطر ففطركم من صومكم وعيد للمسلمين وأما يوم الأضحى فكلوا من لحوم نسككم ‏.‏ قال هذا حديث صحيح ‏.‏ وأبو عبيد مولى عبد الرحمن بن عوف اسمه سعد ويقال له مولى عبد الرحمن بن أزهر أيضا وعبد الرحمن بن أزهر هو ابن عم عبد الرحمن بن عوف ‏.‏",
      "text_en": " Abu Ubaid, the freed slave of Abdur-Rahman bin Awf narrated:                     \"I witnessed Umar bin Al-Khattab on the Day of Nahr beginning with the Salat before the Khutbah. Then he said: 'I heard the Messenger of Allah prohibit fasting on these two days. As for the Day of Fitr, then it is for you to take a break from your fasting, and a celebration for the Muslims. As for the Day of Adha, then eat from the flesh that you have sacrificed.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30450",
        "20304",
        "20115",
        "11013"
      ]
    },
    {
      "id": "jami-al-tirmidhi-837",
      "hadith_no": "837",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن عبد الملك بن أبي الشوارب، حدثنا يزيد بن زريع، حدثنا معمر، عن الزهري، عن عروة، عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ خمس فواسق يقتلن في الحرم الفأرة والعقرب والغراب والحديا والكلب العقور ‏\"‏ ‏.‏ قال وفي الباب عن ابن مسعود وابن عمر وأبي هريرة وأبي سعيد وابن عباس ‏.‏ قال أبو عيسى حديث عائشة حديث حسن صحيح ‏.‏",
      "text_en": " Aishah narrated that :                     the Messenger of Allah said: \"Five are Fawasiq which may be killed in the Haram: the mouse, the scorpion, the crow, the kite, and the barbed dog.\"",
      "usc_msa_ref": "",
      "chain": [
        "30450",
        "20304",
        "20115",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "id": "jami-al-tirmidhi-993",
      "hadith_no": "993",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن عبد الملك بن أبي الشوارب، حدثنا عبد العزيز بن المختار، عن سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من غسله الغسل ومن حمله الوضوء ‏\"‏ ‏.‏ يعني الميت ‏.‏ قال وفي الباب عن علي وعائشة ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن وقد روي عن أبي هريرة موقوفا ‏.‏ وقد اختلف أهل العلم في الذي يغسل الميت فقال بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم إذا غسل ميتا فعليه الغسل ‏.‏ وقال بعضهم عليه الوضوء ‏.‏ وقال مالك بن أنس أستحب الغسل من غسل الميت ولا أرى ذلك واجبا ‏.‏ وهكذا قال الشافعي ‏.‏ وقال أحمد من غسل ميتا أرجو أن لا يجب عليه الغسل وأما الوضوء فأقل ما قيل فيه ‏.‏ وقال إسحاق لا بد من الوضوء ‏.‏ قال وقد روي عن عبد الله بن المبارك أنه قال لا بأس أن لا يغتسل ولا يتوضأ من غسل الميت ‏.‏",
      "text_en": " Abu Hurairah narrated that:                     The Prophet said: \"Ghusl for one who washed him and Wudu for one who carried himm.\"",
      "usc_msa_ref": "",
      "chain": [
        "30450",
        "20252",
        "11173",
        "11161",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1123",
      "hadith_no": "1123",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Marriage - كتاب النكاح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن عبد الملك بن أبي الشوارب، حدثنا بشر بن المفضل، حدثنا حميد، وهو الطويل قال حدث الحسن، عن عمران بن حصين، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا جلب ولا جنب ولا شغار في الإسلام ومن انتهب نهبة فليس منا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ قال وفي الباب عن أنس وأبي ريحانة وابن عمر وجابر ومعاوية وأبي هريرة ووائل بن حجر ‏.‏",
      "text_en": " Imran bin Husain narrated that :                     The Prophet said: \"There is no Jalab, no Janab, and no Shighar in Islam. And whoever takes some property by force, then he is not from us.\"",
      "usc_msa_ref": "",
      "chain": [
        "30450",
        "20212",
        "11279",
        "11016",
        "123"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1136",
      "hadith_no": "1136",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Marriage - كتاب النكاح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن عبد الملك بن أبي الشوارب، حدثنا يزيد بن زريع، حدثنا معمر، عن يحيى بن أبي كثير، عن محمد بن عبد الرحمن بن ثوبان، عن جابر، قال قلنا يا رسول الله إنا كنا نعزل فزعمت اليهود أنها الموءودة الصغرى ‏.‏ فقال ‏\"‏ كذبت اليهود إن الله إذا أراد أن يخلقه لم يمنعه ‏\"‏ ‏.‏ قال وفي الباب عن عمر والبراء وأبي هريرة وأبي سعيد ‏.‏",
      "text_en": " Jabir narrated:                     \"We said: 'O Messenger of Allah! We practice Azl, but the Jews claim that it is minor infanticide.'  So he said: 'The Jews lie. When Allah wants to create it, nothing can prevent Him.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30450",
        "20304",
        "20115",
        "11449",
        "11218",
        "34"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1287",
      "hadith_no": "1287",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا محمد بن عبد الملك بن أبي الشوارب، حدثنا يحيى بن سليم، عن عبيد الله بن عمر، عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏\"‏ من دخل حائطا فليأكل ولا يتخذ خبنة ‏\"‏ ‏.‏ قال وفي الباب عن عبد الله بن عمرو وعباد بن شرحبيل ورافع بن عمرو وعمير مولى آبي اللحم وأبي هريرة ‏.‏ قال أبو عيسى حديث ابن عمر حديث غريب لا نعرفه من هذا الوجه إلا من حديث يحيى بن سليم ‏.‏ وقد رخص فيه بعض أهل العلم لابن السبيل في أكل الثمار وكرهه بعضهم إلا بالثمن ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     That the Prophet (ﷺ) said: \"Whoever enters an orchard then let him eat, but not take any in his garment.\"[He said:] There are narrations on this topic from 'Abdullah bin 'Amr, 'Abbad bin Shurahbil, Rafi' bin 'Amr, 'Umair the freed slave of Abi Al-Lahm, and Abu Hurairah.[Abu 'Eisa said:] The Hadith of Ibn 'Umar is Gharib Hadith. We do not know of it from this route except from Yahya bin Sulaim. Some of the people of knowledge have permitted the wayfarer to eat from the fruits, and some of them disliked it without paying.",
      "usc_msa_ref": "",
      "chain": [
        "30450",
        "20204",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1801",
      "hadith_no": "1801",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن عبد الملك بن أبي الشوارب، حدثنا عبد العزيز بن المختار، عن سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا أكل أحدكم فليلعق أصابعه فإنه لا يدري في أيتهن البركة ‏\"‏ ‏.‏ قال وفي الباب عن جابر ‏.‏ وكعب بن مالك وأنس ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من هذا الوجه من حديث سهيل ‏.‏ وسألت محمدا عن هذا الحديث فقال هذا حديث عبد العزيز من المختلف لا يعرف إلا من حديثه ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     That Messenger of Allah (ﷺ) said: \"When one of you eats, then let him lick his fingers, for indeed he does not know in which of them is the blessing.\"He said: There are narrations on this topic from Jabir, Ka'b bin Malik, and Anas.[Abu 'Eisa said:] This Hadith is Hasan Gharib, we do not know of it except from this route, as a narration of Suhail. I asked Muhammad about this Hadith, so he said: \"This is among the diverse narrations of 'Abdul-'Aziz, we do not know of it except from his narration.\"",
      "usc_msa_ref": "",
      "chain": [
        "30450",
        "20252",
        "11173",
        "11161",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3065",
      "hadith_no": "3065",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن عبد الملك بن أبي الشوارب، حدثنا أبو عوانة، حدثنا أبو عثمان، شيخ له عن أنس، أن النبي صلى الله عليه وسلم قال له ‏\"‏ يا بنى ‏\"‏ ‏.‏ وفي الباب عن المغيرة وعمر بن أبي سلمة ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه ‏.‏ وقد روي من غير هذا الوجه عن أنس ‏.‏ وأبو عثمان هذا شيخ ثقة وهو الجعد بن عثمان ويقال ابن دينار وهو بصري وقد روى عنه يونس بن عبيد وغير واحد من الأئمة ‏.‏",
      "text_en": " Narrated Anas:                     that the Prophet (ﷺ) said to him: \"O my little son.\"",
      "usc_msa_ref": "",
      "chain": [
        "30450",
        "20469",
        "19"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3133",
      "hadith_no": "3133",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on The Virtues of the Qur'an - كتاب فضائل القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمد بن عبد الملك بن أبي الشوارب، حدثنا يحيى بن عمرو بن مالك النكري، عن أبيه، عن أبي الجوزاء، عن ابن عباس، قال ضرب بعض أصحاب النبي صلى الله عليه وسلم خباءه على قبر وهو لا يحسب أنه قبر فإذا فيه إنسان يقرأ سورة تبارك الذي بيده الملك حتى ختمها فأتى النبي صلى الله عليه وسلم فقال يا رسول الله إني ضربت خبائي على قبر وأنا لا أحسب أنه قبر فإذا فيه إنسان يقرأ سورة تبارك الملك حتى ختمها ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ هي المانعة هي المنجية تنجيه من عذاب القبر ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه ‏.‏ وفي الباب عن أبي هريرة ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     \"One of the Companions of the Prophet (ﷺ) put up a tent upon a grave without knowing that it was a grave. When he realized that is was a person's grave, he recited Surat Al-Mulk until its completion. Then he went to the Prophet (ﷺ) and said: 'O Messenger of Allah (ﷺ) [Indeed] I erected my tent without realizing that it was upon a grave. So when I realized there was a person in it I recited Surat Al-Mulk until its completion.' So the Prophet (ﷺ) said: \"It is a prevention, it is a salvation delivering from the punishment of the grave.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30450",
        "24495",
        "24343",
        "11265",
        "17"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3421-2",
      "hadith_no": "3421",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا محمد بن عبد الملك بن أبي الشوارب، حدثنا يوسف بن الماجشون، حدثني أبي، عن عبد الرحمن الأعرج، عن عبيد الله بن أبي رافع، عن علي بن أبي طالب، أن رسول الله صلى الله عليه وسلم كان إذا قام إلى الصلاة قال ‏\"‏ وجهت وجهي للذي فطر السموات والأرض حنيفا وما أنا من المشركين إن صلاتي ونسكي ومحياى ومماتي لله رب العالمين لا شريك له وبذلك أمرت وأنا من المسلمين اللهم أنت الملك لا إله إلا أنت أنت ربي وأنا عبدك ظلمت نفسي واعترفت بذنبي فاغفر لي ذنوبي جميعا إنه لا يغفر الذنوب إلا أنت واهدني لأحسن الأخلاق لا يهدي لأحسنها إلا أنت واصرف عني سيئها إنه لا يصرف عني سيئها إلا أنت آمنت بك تباركت وتعاليت أستغفرك وأتوب إليك ‏\"‏ ‏.‏ فإذا ركع قال ‏\"‏ اللهم لك ركعت وبك آمنت ولك أسلمت خشع لك سمعي وبصري ومخي وعظامي وعصبي ‏\"‏ ‏.‏ فإذا رفع رأسه قال ‏\"‏ اللهم ربنا لك الحمد ملء السموات والأرضين وملء ما بينهما وملء ما شئت من شيء بعد ‏\"‏ ‏.‏ فإذا سجد قال ‏\"‏ اللهم لك سجدت وبك آمنت ولك أسلمت سجد وجهي للذي خلقه فصوره وشق سمعه وبصره فتبارك الله أحسن الخالقين ‏\"‏ ‏.‏ ثم يكون آخر ما يقول بين التشهد والسلام ‏\"‏ اللهم اغفر لي ما قدمت وما أخرت وما أسررت وما أعلنت وما أنت أعلم به مني أنت المقدم وأنت المؤخر لا إله إلا أنت ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Ali bin Abi Talib narrated that whenever the Messenger of Allah would stand for Salat, he would say:                     “I have directed my face towards the One who created the Heavens and the earth, as a Hanif, andI am not of the idolaters. Indeed, my Salat, my sacrifice, my living, and my dying is for Allah, the Lord of all that exists, there is no partner for Him, and with this have I been ordered, and I among the Muslims. O Allah, You are the King, there is none worthy of worship except You. You are My Lord, and I am Your slave, I have wronged myself, and I admit to my sin, so forgive me all my sins, verily, there is none who forgives sins but You. And guide me to the best of the manners, none guides to the best of them except You, and turn the evil of them away from me, [verily,] none can turn the evil of them away from me except You. I have believed in You. Blessed are You and Exalted are You, I seek Your forgiveness and I repent to you (Wajjahtu Wajhi Lilladhi Fataras-Samawati Wal-Arda Hanifan Wa Ma Ana Min Al-Mushrikin, Inna Salati Wa Nusuki Wa Mahyaya Wa Mamati Lillahi Rabbil-Alamin, La Sharika Lahu Wa Bidhalika Umirtu Wa Ana Min Al-Muslimin. Allahumma Antal-Maliku La Ilaha Illa Ant, Anta Rabbi, Wa Ana Abduka Zalamtu Nafsi Wa’taraftu Bidhanbi Faghfirli Dhunubi Jami’an, Innahu La Yaghfir Adh-Dhunuba Illa Ant. Wahdini Li-Ahsanil-Akhlaqi La Yahdi Li-Ahsaniha Illa Ant. Wasrif Anni Sayyi’aha [Innahu] La Yasrifu Anni Sayyi’aha Illa Ant. Amantu Bika Tabarakta Wa Ta’alaita Astaghfiruka Wa Atubu Ilaik).” And when he would bow in Ruku, he would say: “O Allah, to You I have bowed, and in You I believe, and to You have I submitted. My hearing, my sight, my brain, my bones and my sinew are humbled to you (Allahumma Laka Raka’tu Wa Bika Amantu Wa Laka Aslamtu Khasha’a Laka Sam’I Wa Basari Wa Mukhkhi Wa Azmi, Wa Asabi)” Then when he would raise his head, he would say: “O Allah, our Lord, to You is praise the fill of the Heavens and the earths and the fill of whatever You will of things. (Allahumma Rabbana Lakal-Hamdu Mil’as-Samawati Wal-Ardina Wa Ma Bainahuma, Wa Mil’a Ma Shi’ta Min Shai).” Then, when he prostrated, he would say: “O  Allah, to You have I prostrated, and in You have I believed, and to You have I submitted, my face has prostrated to the One Who created it and fashioned it, and gave it its hearing and its sight. So Blessed is Allah, the Best of creators (Allahumma Laka Sajadtu Wa Bika Amantu Wa Laka Aslamtu, Sajada Wajhi Lilladhi Khalaqahu Wa Suwwarahu Wa Shaqqa Sam’ahu Wa Basarahu Fatabarak Allahu Ahsanul-Khaliqin).” Then the last of what he would say between At-Tashah-hud and As-Salam would be: “O Allah, forgive me what I have done before and after, and what I have hidden and what I have done openly, and what You know more of it than I, You are the One who sends forth and the One who delays, there is none worthy of worship except You. (Allahummaghfirli Ma Qaddamtu Wa Ma Akhkhartu Wa Ma Asrartu Wa Ma A’lantu Wa Ma Anta A’lamu Bihi Minni Antal-Muqaddimu Wa Antal-Mu’akhkhiru, La Ilaha Illa Ant).”",
      "usc_msa_ref": "",
      "chain": [
        "30450",
        "20027",
        "10628",
        "11197",
        "11199",
        "5"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3469-2",
      "hadith_no": "3469",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا محمد بن عبد الملك بن أبي الشوارب، حدثنا عبد العزيز بن المختار، عن سهيل بن أبي صالح، عن سمى، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من قال حين يصبح وحين يمسي سبحان الله وبحمده مائة مرة لم يأت أحد يوم القيامة بأفضل مما جاء به إلا أحد قال مثل ما قال أو زاد عليه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏",
      "text_en": " Abu Hurairah narrated that:                     The Prophet said: “Whoever says in the morning and in the evening “Glory is to Allah and with His Praise (Subhan Allah, Wa Bihamdih)” a hundred times, none shall bring better than him on the Day of Judgment except one who did the same as him, or increased upon it.",
      "usc_msa_ref": "",
      "chain": [
        "30450",
        "20252",
        "11173",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4020",
      "hadith_no": "4020",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن عبد الملك بن أبي الشوارب، حدثنا أبو عوانة، عن عبد الملك بن عمير، عن ابن أبي المعلى، عن أبيه، أن رسول الله صلى الله عليه وسلم خطب يوما فقال ‏\"‏ إن رجلا خيره ربه بين أن يعيش في الدنيا ما شاء أن يعيش ويأكل في الدنيا ما شاء أن يأكل وبين لقاء ربه فاختار لقاء ربه ‏\"‏ ‏.‏ قال فبكى أبو بكر فقال أصحاب النبي صلى الله عليه وسلم ألا تعجبون من هذا الشيخ إذ ذكر رسول الله صلى الله عليه وسلم رجلا صالحا خيره ربه بين الدنيا وبين لقاء ربه فاختار لقاء ربه ‏.‏ قال فكان أبو بكر أعلمهم بما قال رسول الله صلى الله عليه وسلم فقال أبو بكر بل نفديك بآبائنا وأموالنا ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ ما من الناس أحد أمن إلينا في صحبته وذات يده من ابن أبي قحافة ولو كنت متخذا خليلا لاتخذت ابن أبي قحافة خليلا ولكن ود وإخاء إيمان ود وإخاء إيمان مرتين أو ثلاثا وإن صاحبكم خليل الله ‏\"‏ ‏.‏ قال وفي الباب عن أبي سعيد وهذا حديث حسن غريب ‏.‏ وقد روي هذا الحديث عن أبي عوانة عن عبد الملك بن عمير بإسناد غير هذا ‏.‏ ومعنى قوله أمن إلينا يعني أمن علينا ‏.‏",
      "text_en": " Narrated Ibn Abi Mu'alla:                     from his father: \"The Messenger of Allah (ﷺ) gave a Khutbah one day and said: 'Indeed there is a man whose Lord has given him the choice between living in this life as long as he wishes to live, and eating from this life as much as he wishes to eat, and between meeting his Lord.'\" He said: \"So Abu Bakr cried. The Companions of the Prophet (ﷺ) said: 'Are you not amazed at this old man, when the Messenger of Allah (ﷺ) mentioned a righteous man whose Lord gave him the choice between this life or meeting his Lord, and he chose meeting his Lord.'\" He said: \"But Abu Bakr was the most knowledgeable one of them regarding what the Messenger of Allah (ﷺ) had said. So Abu Bakr said: 'Rather we will ransom our fathers and wealth for you.; So the Messenger of Allah (ﷺ) said: 'There is no one among people more beneficial to us (Amanna Ilaina) in his companionship, or generous with his wealth than Ibn Abi Quhafah. And, if I were to take a Khalil, I would have taken Ibn Abi Quhafah as a Khalil. But rather love and the brotherhood of faith' - saying that two or three times - 'Indeed your companion is the Khalil of Allah.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30450",
        "20469",
        "11368"
      ]
    },
    {
      "id": "sunan-an-nasai-3679",
      "hadith_no": "3679",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Presents - كتاب النحل",
      "chapter_no": "31",
      "text_ar": "أخبرنا محمد بن عبد الملك بن أبي الشوارب، قال حدثنا يزيد، - وهو ابن زريع - قال حدثنا داود، عن الشعبي، عن النعمان، قال انطلق به أبوه يحمله إلى النبي صلى الله عليه وسلم قال اشهد أني قد نحلت النعمان من مالي كذا وكذا ‏.‏ قال ‏\"‏ كل بنيك نحلت مثل الذي نحلت النعمان ‏\"‏ ‏.‏",
      "text_en": " It was narrated that An-Nu'man said that his father took him to the Prophet and said:                      \"Bear witness that I have given An-Nu'man such and such of my wealth as a gift.\" He said: \"Have you given all your children a present like that which you have given to An-Nu'man?\"",
      "usc_msa_ref": "",
      "chain": [
        "30450",
        "20304",
        "11052",
        "274"
      ]
    },
    {
      "id": "sunan-an-nasai-5348",
      "hadith_no": "5348",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أنبأنا محمد بن عبد الملك بن أبي الشوارب، قال حدثنا يزيد، قال حدثنا معمر، عن الزهري، عن عبيد الله بن عبد الله، عن ابن عباس، عن أبي طلحة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا تدخل الملائكة بيتا فيه كلب ولا صورة تماثيل ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Talhah said:                     \"I heard the Messenger of Allah [SAW] say: 'The angels do not enter a house in which there is a dog or an image of an animate being.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30450",
        "20304",
        "20115",
        "11013",
        "11004",
        "17",
        "229"
      ]
    },
    {
      "id": "sunan-ibn-majah-189",
      "hadith_no": "189",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا محمد بن عبد الملك بن أبي الشوارب، حدثنا أبو عاصم العباداني، حدثنا الفضل الرقاشي، عن محمد بن المنكدر، عن جابر بن عبد الله، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ بينا أهل الجنة في نعيمهم إذ سطع لهم نور فرفعوا رءوسهم فإذا الرب قد أشرف عليهم من فوقهم فقال السلام عليكم يا أهل الجنة ‏.‏ قال وذلك قول الله ‏{سلام قولا من رب رحيم}‏ قال فينظر إليهم وينظرون إليه فلا يلتفتون إلى شىء من النعيم ما داموا ينظرون إليه حتى يحتجب عنهم ويبقى نوره وبركته عليهم في ديارهم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Jabor bin 'Abdullah said:                     \"The Messenger of Allah said: 'While the people of Paradise are enjoying their blessings, a light will shine upon them, and they will raise their heads, and they will see their Lord looking upon them from above. He will say: \"Peace be upon you, O people of Paradise.\" This is what Allah says in the Verse: \"Salam (peace be upon you) - a Word from the Lord (Allah), The Most Merciful.\" He will look at them, and they will look at Him, and they will not pay any attention to the delights (of Paradise) so long as they look at Him, until He will screen Himself from them. But His light and blessing will remain with them in their bodies.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30450",
        "24515",
        "11048",
        "34"
      ]
    },
    {
      "id": "sunan-ibn-majah-208",
      "hadith_no": "208",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا محمد بن عبد الملك بن أبي الشوارب، حدثنا أبو عوانة، حدثنا عبد الملك بن عمير، عن المنذر بن جرير، عن أبيه، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من سن سنة حسنة فعمل بها كان له أجرها ومثل أجر من عمل بها لا ينقص من أجورهم شيئا ومن سن سنة سيئة فعمل بها كان عليه وزرها ووزر من عمل بها من بعده لا ينقص من أوزارهم شيئا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Mundhir bin Jarir that his father said:                     \"The Messenger of Allah said: 'Whoever introduces a good practice that is followed, he will receive its reward and a reward equivalent to that of those who follow it, without that detracting from their reward in their slightest. And whoever introduces a bad practice that is followed, he will receive its sin and a burden of sin equivalent to that of those who follow it, without that detracting from their burden in the slightest.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30450",
        "20469",
        "11368",
        "10831"
      ]
    },
    {
      "id": "sunan-ibn-majah-489",
      "hadith_no": "489",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن عبد الملك بن أبي الشوارب، حدثنا عبد العزيز بن المختار، حدثنا سهيل، عن أبيه، عن أبي هريرة، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ ويل للأعقاب من النار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that :                     The Prophet said: \"Woe to the heels because of Hell-fire.\"",
      "usc_msa_ref": "",
      "chain": [
        "30450",
        "20252",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-532",
      "hadith_no": "532",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن عبد الملك بن أبي الشوارب، حدثنا عبد العزيز بن المختار، حدثنا سهيل، عن أبيه، عن أبي هريرة، أن رسول الله  صلى الله عليه وسلم  أكل كتف شاة فمضمض وغسل يديه وصلى ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     The Messenger of Allah ate meat from the shoulder of a sheep, then he rinsed his mouth and washed his hands, then he prayed.",
      "usc_msa_ref": "",
      "chain": [
        "30450",
        "20252",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-617",
      "hadith_no": "617",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن عبد الملك بن أبي الشوارب، حدثنا عبد الواحد بن زياد، حدثنا صدقة بن سعيد الحنفي، حدثنا جميع بن عمير التيمي، قال انطلقت مع عمتي وخالتي فدخلنا على عائشة فسألناها كيف كان يصنع رسول الله  صلى الله عليه وسلم  عند غسله من الجنابة قالت كان يفيض على كفيه ثلاث مرات ثم يدخلها في الإناء ثم يغسل رأسه ثلاث مرات ثم يفيض على جسده ثم يقوم إلى الصلاة وأما نحن فإنا نغسل رءوسنا خمس مرار من أجل الضفر ‏.‏",
      "text_en": " Jumai' bin 'Umair At-Taimi said:                     \"I went out with my paternal aunt and maternal aunt and we entered upon 'Aishah. We asked her: 'What did the Messenger of Allah do when he had the bath to cleanse himself from sexual impurity?' She said: 'He used to pour water on his hand three times, then he would put them in the vessel and wash his face three times, then he would pour water over his body, then he would get up and perform prayer. As for us, we would wash our heads five times because of our braided hair.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30450",
        "20256",
        "15242",
        "19864"
      ]
    },
    {
      "id": "sunan-ibn-majah-630",
      "hadith_no": "630",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن عبد الملك بن أبي الشوارب، حدثنا عبد الواحد بن زياد، حدثنا عاصم الأحول، عن أبي المتوكل، عن أبي سعيد الخدري، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إذا أتى أحدكم أهله ثم أراد أن يعود فليتوضأ ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Sa'eed said:                     \"The Messenger of Allah said: 'If anyone of you has intercourse with his wife, then he wants to do it again, let him perform ablution.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30450",
        "20256",
        "11080",
        "11297",
        "38"
      ]
    },
    {
      "id": "sunan-ibn-majah-977",
      "hadith_no": "977",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو معاوية، ح وحدثنا محمد بن عبد الملك بن أبي الشوارب، حدثنا عبد الواحد بن زياد، قال حدثنا عاصم الأحول، عن عبد الله بن الحارث، عن عائشة، قالت كان رسول الله  صلى الله عليه وسلم  إذا سلم لم يقعد إلا مقدار ما يقول ‏\"‏ اللهم أنت السلام ومنك السلام تباركت يا ذا الجلال والإكرام ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Aishah said:                      “When the Messenger of Allah (ﷺ)said the Salam, he would sit only for as long as it took to say:‘Allahumma Antas-Salam wa minkas-salam. Tabarakta ya Dhal-jalaliwal-ikram. (O Allah, You are As-Salam, From You is all peace, blessedareYou O Possessor of majesty and honour).’”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20354",
        "30450",
        "20256",
        "11080",
        "912",
        "53"
      ]
    },
    {
      "id": "sunan-ibn-majah-1026",
      "hadith_no": "1026",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن عبد الملك بن أبي الشوارب، حدثنا عبد الواحد بن زياد، حدثنا عاصم، عن الشعبي، عن ابن عباس، قال بت عند خالتي ميمونة فقام النبي  صلى الله عليه وسلم  يصلي من الليل فقمت عن يساره فأخذ بيدي فأقامني عن يمينه ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “I stayed overnight with mymaternal aunt Maimunah, and the Prophet (ﷺ) got up during the nightto perform prayer. So I got up and stood on his left. He took me bythe hand and made me stand on his right.”",
      "usc_msa_ref": "",
      "chain": [
        "30450",
        "20256",
        "11080",
        "11052",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-1121",
      "hadith_no": "1121",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن عبد الملك بن أبي الشوارب، وجبارة بن المغلس، قالا حدثنا أبو عوانة، عن بكير بن الأخنس، عن مجاهد، عن ابن عباس، قال افترض الله الصلاة على لسان نبيكم  صلى الله عليه وسلم  في الحضر أربعا وفي السفر ركعتين ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “Allah enjoined the prayer uponthe tongue of your Prophet (ﷺ): Four Rak’ah while a resident andtwoRak’ah when traveling.”",
      "usc_msa_ref": "",
      "chain": [
        "30450",
        "35021",
        "20469",
        "10748",
        "11028",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-1128",
      "hadith_no": "1128",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن عبد الملك بن أبي الشوارب، حدثنا عبد الواحد بن زياد، حدثنا عاصم الأحول، عن عكرمة، عن ابن عباس، قال أقام رسول الله  صلى الله عليه وسلم  تسعة عشر يوما يصلي ركعتين ركعتين فنحن إذا أقمنا تسعة عشر يوما نصلي ركعتين ركعتين فإذا أقمنا أكثر من ذلك صلينا أربعا ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “The Messenger of Allah (ﷺ)stayed for nineteen days in which he shortened his prayer to twoRak’ah. So, whenever we stayed for nineteen days we would shortenourprayer to two Rak’ah, but if we stayed more than that we wouldprayfour Rak’ah.”",
      "usc_msa_ref": "",
      "chain": [
        "30450",
        "20256",
        "11080",
        "11023",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-1231",
      "hadith_no": "1231",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن عبد الملك بن أبي الشوارب، حدثنا عبد الواحد بن زياد، حدثنا عاصم، عن أبي مجلز، عن ابن عمر، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ صلاة الليل مثنى مثنى والوتر ركعة ‏\"‏ قلت أرأيت إن غلبتني عيني أرأيت إن نمت قال اجعل أرأيت عند ذلك النجم ‏.‏ فرفعت رأسي فإذا السماك ثم أعاد فقال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ صلاة الليل مثنى مثنى والوتر ركعة قبل الصبح ‏\"‏ ‏.‏",
      "text_en": " AbuMijlaz narrated that Ibn ‘Umar said:                      “The Messenger of Allah(ﷺ) said: ‘Night prayers are to be offered two by two, and Witrisone Rak’ah.’ I said: ‘What do you think if I become drowsyand I wantto sleep?’ He said: ‘Put “what do you think” upthere with that star?(i.e., don’t think about it at all).’ Iraised my head and saw As-Simak.* He repeated that the Messenger ofAllah (ﷺ) said, ‘Nightprayers are to be offered two by two, andWitr is one Rak’ah, beforedawn.’”",
      "usc_msa_ref": "",
      "chain": [
        "30450",
        "20256",
        "11080",
        "11313",
        "18"
      ]
    },
    {
      "id": "sunan-ibn-majah-1388",
      "hadith_no": "1388",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن عبد الملك بن أبي الشوارب، حدثنا مسلمة بن علقمة، عن داود بن أبي هند، عن الوليد بن عبد الرحمن الجرشي، عن جبير بن نفير الحضرمي، عن أبي ذر، قال صمنا مع رسول الله  صلى الله عليه وسلم  رمضان فلم يقم بنا شيئا منه حتى بقي سبع ليال فقام بنا ليلة السابعة حتى مضى نحو من ثلث الليل ثم كانت الليلة السادسة التي تليها فلم يقمها حتى كانت الخامسة التي تليها ثم قام بنا حتى مضى نحو من شطر الليل فقلت يا رسول الله لو نفلتنا بقية ليلتنا هذه ‏.‏ فقال ‏\"‏ إنه من قام مع الإمام حتى ينصرف فإنه يعدل قيام ليلة ‏\"‏ ‏.‏ ثم كانت الرابعة التي تليها فلم يقمها حتى كانت الثالثة التي تليها ‏.‏ قال فجمع نساءه وأهله واجتمع الناس ‏.‏ قال فقام بنا حتى خشينا أن يفوتنا الفلاح ‏.‏ قيل وما الفلاح قال السحور ‏.‏ قال ثم لم يقم بنا شيئا من بقية الشهر ‏.‏",
      "text_en": " It wasnarrated that Abu Dharr said:                      “We fasted Ramadan with theMessengerof Allah (ﷺ) and he did not lead us in praying Qiyam(prayers atnight) during any part of it, until there were sevennights left. Heled us in praying Qiyam on the seventh night untilapproximately onethird of the night had passed. Then on the sixthnight which followedit he did not lead us in prayer. Then he led usin praying Qiyam onthe fifth night which followed it until almosthalf the night hadpassed. I said: ‘O Messenger of Allah, would thatwe had offeredvoluntary prayers throughout the whole night.’ He said:‘Whoeverstands with the Imam until he finishes, it is equivalent tospendingthe whole night in prayer.’ Then on the fourth night whichfollowedit, he did not lead us in prayer, until the third night thatfollowedit, when he gathered his wives and family, and he peoplegathered,and he led us in prayer until we feared that we would misstheFalah.” It was asked: “What is the Falah?” He said: “Suhur.”Hesaid: “Then he did not lead us in prayer at night for the restof themonth.”",
      "usc_msa_ref": "",
      "chain": [
        "30450",
        "20568",
        "11585",
        "10975",
        "4097",
        "23"
      ]
    },
    {
      "id": "sunan-ibn-majah-1530",
      "hadith_no": "1530",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن عبد الملك بن أبي الشوارب، حدثنا عبد العزيز بن المختار، عن سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من غسل ميتا فليغتسل ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                     “Whoever washes a dead person, let him take a bath.”",
      "usc_msa_ref": "",
      "chain": [
        "30450",
        "20252",
        "11173",
        "11161",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-1656",
      "hadith_no": "1656",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن عبد الملك بن أبي الشوارب، حدثنا عبد الواحد بن زياد، حدثنا عاصم الأحول، عن أبي عثمان، عن أسامة بن زيد، قال كان ابن لبعض بنات رسول الله  صلى الله عليه وسلم  يقضي فأرسلت إليه أن يأتيها فأرسل إليها أن ‏\"‏ لله ما أخذ وله ما أعطى وكل شىء عنده إلى أجل مسمى فلتصبر ولتحتسب ‏\"‏ ‏.‏ فأرسلت إليه فأقسمت عليه فقام رسول الله  صلى الله عليه وسلم  وقمت معه ومعه معاذ بن جبل وأبى بن كعب وعبادة بن الصامت فلما دخلنا ناولوا الصبي رسول الله  صلى الله عليه وسلم  وروحه تقلقل في صدره ‏.‏ قال حسبته قال كأنه شنة ‏.‏ قال فبكى رسول الله  صلى الله عليه وسلم  فقال له عبادة بن الصامت ما هذا يا رسول الله قال ‏\"‏ الرحمة التي جعلها الله في بني آدم وإنما يرحم الله من عباده الرحماء ‏\"‏ ‏.‏",
      "text_en": " Usamahbin Zaid said:                      “The son of one of the daughters of theMessenger ofAllah (ﷺ) was dying. She sent for him, asking him tocome to her,and he sent word to her, saying: ‘To Allah belongs whatHe hastaken and to Him belongs what He has given. Everything has anappointed time with Him, so be patient and seek reward.’ But shesentfor him again, adjuring him to come. So the Messenger of Allah(ﷺ)got up, and I got up with him, as did Mu’adh bin Jabal, Ubayybin Ka’band ‘Ubadah bin Samit. When we entered they handed thechild to theMessenger of Allah (ﷺ), and his soul was rattling inhis chest.” Ithink he was that it was like a water skin. “TheMessenger of Allah(ﷺ) wept, and ‘Ubadah bin Samit said to him:‘What is this, OMessenger of Allah?’ He said: ‘It iscompassion which Allah hascreated in the son of Adam. Allah onlyshows mercy to those of Hisslaves who are compassionate.’”",
      "usc_msa_ref": "",
      "chain": [
        "30450",
        "20256",
        "11080",
        "11113",
        "50"
      ]
    },
    {
      "id": "sunan-ibn-majah-1839",
      "hadith_no": "1839",
      "source": "Sunan Ibn Majah",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا محمد بن عبد الملك بن أبي الشوارب، وأبو إسحاق الهروي إبراهيم بن عبد الله بن حاتم قالا حدثنا عبد الواحد بن زياد، حدثنا الحسن بن عبيد الله، عن إبراهيم النخعي، عن الأسود، عن عائشة، قالت كان النبي  صلى الله عليه وسلم  يجتهد في العشر الأواخر ما لا يجتهد في غيره ‏.‏",
      "text_en": " It wasnarrated that ‘Aishah said:                      “The Prophet (ﷺ) used to strivehard (in worship) in the last ten nights of Ramadan as he never didatany other time.”",
      "usc_msa_ref": "",
      "chain": [
        "30450",
        "20256",
        "10755",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "id": "sunan-ibn-majah-1955",
      "hadith_no": "1955",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن عبد الملك بن أبي الشوارب، حدثنا أبو عوانة، حدثنا أبو إسحاق الهمداني، عن أبي بردة، عن أبي موسى، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا نكاح إلا بولي ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Musa that:                     the Messenger of Allah said: “There is no marriage except with a guardian.”",
      "usc_msa_ref": "",
      "chain": [
        "30450",
        "20469",
        "11049",
        "11901",
        "41"
      ]
    },
    {
      "id": "sunan-ibn-majah-1998",
      "hadith_no": "1998",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن عبد الملك بن أبي الشوارب، حدثنا عبد العزيز بن المختار، عن سهيل بن أبي صالح، عن الحارث بن مخلد، عن أبي هريرة، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ لا ينظر الله إلى رجل جامع امرأته في دبرها ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah:                     that the Prophet said: “Allah will not look at a man who has intercourse with his wife in her buttocks.”",
      "usc_msa_ref": "",
      "chain": [
        "30450",
        "20252",
        "11173",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-2199",
      "hadith_no": "2199",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Expiation - كتاب الكفارات",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن عبد الملك بن أبي الشوارب، حدثنا أبو عوانة، عن عبد الملك، عن ربعي بن حراش، عن الطفيل بن سخبرة، أخي عائشة لأمها عن النبي  صلى الله عليه وسلم  بنحوه ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30450",
        "20469",
        "11368",
        "11334"
      ]
    },
    {
      "id": "sunan-ibn-majah-2325",
      "hadith_no": "2325",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا محمد بن عبد الملك بن أبي الشوارب، حدثنا عبد الواحد بن زياد، حدثنا صدقة بن سعيد الحنفي، حدثنا جميع بن عمير التيمي، حدثنا عبد الله بن عمر، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ يا أيها الناس من باع محفلة فهو بالخيار ثلاثة أيام فإن ردها رد معها مثلى لبنها - أو قال مثل لبنها - قمحا ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah bin 'Umar said:                     \"The Messenger of Allah (ﷺ) said: 'Whoever buys a Muhaffalah, (1) he has the choice (of annulling the deal) for three days. If he returns it, then he must also give wheat equal to twice, the amount of its milk, or equal to the amount of its milk.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30450",
        "20256",
        "15242",
        "19864",
        "18"
      ]
    },
    {
      "id": "sunan-ibn-majah-2668",
      "hadith_no": "2668",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا ابن علية، عن سعيد بن أبي عروبة، عن عبد الله بن الداناج، سمعت حضين بن المنذر الرقاشي، ح وحدثنا محمد بن عبد الملك بن أبي الشوارب، حدثنا عبد العزيز بن المختار، حدثنا عبد الله بن فيروز الداناج، قال حدثني حضين بن المنذر، قال لما جيء بالوليد بن عقبة إلى عثمان قد شهدوا عليه قال لعلي دونك ابن عمك فأقم عليه الحد ‏.‏ فجلده علي وقال جلد رسول الله صلى الله عليه وسلم أربعين وجلد أبو بكر أربعين وجلد عمر ثمانين وكل سنة ‏.‏",
      "text_en": " Hudain bin Mundhir said:                     “When Walid bin `Uqbah was brought to `Uthman, they had testified against him. He said to 'Ali: 'You are close to your uncle's son, so carry out the legal punishment on him.'  So 'Ali whipped him. He said: 'The Messenger of Allah (ﷺ) gave forty lashes, and Abu Bakr gave forty lashes, and 'Umar gave eighty all are Sunnah.'”",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20208",
        "11073",
        "30450",
        "20252",
        "11700"
      ]
    },
    {
      "id": "sunan-ibn-majah-2790",
      "hadith_no": "2790",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا محمد بن عبد الملك بن أبي الشوارب، حدثنا أبو عوانة، عن عبد الملك بن عمير، عن رفاعة بن شداد القتباني، قال لولا كلمة سمعتها من، عمرو بن الحمق الخزاعي لمشيت فيما بين رأس المختار وجسده سمعته يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ من أمن رجلا على دمه فقتله فإنه يحمل لواء غدر يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Rifa'ah bin Shaddad Al-Qitbani said:                     “Were it not for a word that I heard from 'Amr bin Hamiq Khuza'i, I would have separated the head of Al-Mukhtar from his body. I heard him saying: “The Messenger of Allah (ﷺ) said: 'If a man trusts someone with his life then he kills him, he will carry a banner of treachery on the day of Resurrection.'”",
      "usc_msa_ref": "",
      "chain": [
        "30450",
        "20469",
        "11368",
        "15146"
      ]
    },
    {
      "id": "sunan-ibn-majah-2853",
      "hadith_no": "2853",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Shares of Inheritance - كتاب الفرائض",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن عبد الملك بن أبي الشوارب، حدثنا يحيى بن سليم الطائفي، عن عبيد الله بن عمر، عن نافع، عن ابن عمر، قال نهى رسول الله صلى الله عليه وسلم عن بيع الولاء وعن هبته ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Umar said:                      The Messenger of Allah (ﷺ)forbadeselling the right of inheritance, or giving it as a gift.",
      "usc_msa_ref": "",
      "chain": [
        "30450",
        "20204",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-ibn-majah-2894",
      "hadith_no": "2894",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن عبد الملك بن أبي الشوارب، حدثنا عبد العزيز بن المختار، حدثنا سهيل، عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الخيل في نواصيها الخير - أو قال الخيل معقود في نواصيها قال سهيل أنا أشك الخير - إلى يوم القيامة الخيل ثلاثة فهي لرجل أجر ولرجل ستر وعلى رجل وزر فأما الذي هي له أجر فالرجل يتخذها في سبيل الله ويعدها له فلا تغيب شيئا في بطونها إلا كتب له أجر ولو رعاها في مرج ما أكلت شيئا إلا كتب له بها أجر ولو سقاها من نهر جار كان له بكل قطرة تغيبها في بطونها أجر - حتى ذكر الأجر في أبوالها وأرواثها - ولو استنت شرفا أو شرفين كتب له بكل خطوة تخطوها أجر ‏.‏ وأما الذي هي له ستر فالرجل يتخذها تكرما وتجملا ولا ينسى حق ظهورها وبطونها في عسرها ويسرها ‏.‏ وأما الذي هي عليه وزر فالذي يتخذها أشرا وبطرا وبذخا ورياء للناس فذلك الذي هي عليه وزر ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                     “There is goodness in the forelocks of horses” – or he said:“There is goodness tied in the forelocks of horses.” Suhail (oneofthe narrators) said: “I am not certain of” – “until theDay ofResurrection. And horses are of three types: those that bringrewardto a man, those that are a means of protection for a man, andthosethat are a burden (of sin) for a man. As for those that bringreward,a man keeps them in the cause of Allah and keeps themconstantly ready(for Jihad), so they do not take any fodder intotheir stomachs but areward will be written for him, and if he putsthem out to pasture,they do not eat anything but reward will bewritten for him. If hegives them to drink from a flowing river, forevery drop that enterstheir stomachs there will be reward,”(continuing) until he mentionedreward in conjunction with theirurine and droppings, and even whenthey run here and there bythemselves, for each step they take areward will be written for him– ‘As for those that are a means ofprotection, a man keeps thembecause they are a source of dignity andadornment, but he does notforget the rights of their backs andstomachs (i.e., their right notto be overworked and their right to befed) whether at times of theirdifficulty or ease. As for those thatbring a burden (of sin), theone who keeps them for purposes ofwrongdoing or for pomp and showbefore people, is the one for whomthey bring a burden of sin.”",
      "usc_msa_ref": "",
      "chain": [
        "30450",
        "20252",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-2910",
      "hadith_no": "2910",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن عبد الملك بن أبي الشوارب، حدثنا عبد العزيز بن المختار، حدثنا سهيل، عن أبيه، عن أبي هريرة، عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ ما تقولون في الشهيد فيكم ‏\"‏ ‏.‏ قالوا القتل في سبيل الله ‏.‏ قال ‏\"‏ إن شهداء أمتي إذا لقليل من قتل في سبيل الله فهو شهيد ومن مات في سبيل الله فهو شهيد والمبطون شهيد والمطعون شهيد ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Prophet (ﷺ) said:                      “What doyou say among yourselves about the martyr?” They said: “The onewho is killed in the cause of Allah.” He said: “In that case themartyrs among my nation would be few. Whoever is killed in the causeof Allah is a martyr; whoever dies in the cause of Allah is a martyr;whoever dies of a stomach disease is a martyr; and whoever dies ofthe plague is a martyr.”",
      "usc_msa_ref": "",
      "chain": [
        "30450",
        "20252",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-3351",
      "hadith_no": "3351",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hunting - كتاب الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا محمد بن عبد الملك بن أبي الشوارب، حدثنا عبد العزيز بن المختار، حدثنا سهيل، عن أبيه، عن أبي هريرة، عن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ من قتل وزغا في أول ضربة فله كذا وكذا حسنة ومن قتلها في الثانية فله كذا وكذا - أدنى من الأولى - ومن قتلها في الضربة الثالثة فله كذا وكذا حسنة - أدنى من الذي ذكره في المرة الثانية ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                     “Whoever kills a house lizard with one blow will have such andsucha reward. Whoever kills it with two blows will have such and suchareward,” less than the first. “And whoever kills it with threeblowswill have such and such reward,” less than that mentioned thesecondtime.",
      "usc_msa_ref": "",
      "chain": [
        "30450",
        "20252",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-3422",
      "hadith_no": "3422",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا محمد بن عبد الملك بن أبي الشوارب، حدثنا عبد العزيز بن المختار، حدثنا سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ إذا نام أحدكم وفي يده ريح غمر فلم يغسل يده فأصابه شىء فلا يلومن إلا نفسه ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Prophet (ﷺ) said:                      “Ifanyoneof you goes to bed with a smell emanating from his hand, and hedoesnot wash his hand, and something happens to him, he should notblameanyone but himself.”",
      "usc_msa_ref": "",
      "chain": [
        "30450",
        "20252",
        "11173",
        "11161",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-3524",
      "hadith_no": "3524",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Drinks - كتاب الأشربة",
      "chapter_no": "30",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو معاوية، ح وحدثنا محمد بن عبد الملك بن أبي الشوارب، حدثنا عبد الواحد بن زياد، قالا حدثنا عاصم الأحول، حدثتنا بنانة بنت يزيد العبشمية، عن عائشة، قالت كنا ننبذ لرسول الله  صلى الله عليه وسلم  في سقاء فنأخذ قبضة من تمر أو قبضة من زبيب فنطرحها فيه ثم نصب عليه الماء فننبذه غدوة فيشربه عشية وننبذه عشية فيشربه غدوة ‏.‏ وقال أبو معاوية نهارا فيشربه ليلا أو ليلا فيشربه نهارا ‏.‏",
      "text_en": " It wasnarrated that ‘Aishah said:                      “We used to make Nabidh for theMessenger of Allah (ﷺ) in a water skin. We would take a handful ofdates or a handful of raisins, and put them in it, then pour waterover it. We would make that in the morning and he would rink it intheevening, or we would make it in the evening and he would drink itinthe morning.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20354",
        "30450",
        "20256",
        "11080",
        "53"
      ]
    },
    {
      "id": "sunan-ibn-majah-3526",
      "hadith_no": "3526",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Drinks - كتاب الأشربة",
      "chapter_no": "30",
      "text_ar": "حدثنا محمد بن عبد الملك بن أبي الشوارب، حدثنا أبو عوانة، عن أبي الزبير، عن جابر بن عبد الله، قال كان ينبذ لرسول الله  صلى الله عليه وسلم  في تور من حجارة ‏.‏",
      "text_en": " It wasnarrated that Jabir bin ‘Abdullah said:                      “Nabidh would be madeforthe Messenger of Allah (ﷺ) in a vessel of stone.”",
      "usc_msa_ref": "",
      "chain": [
        "30450",
        "20469",
        "11263",
        "34"
      ]
    },
    {
      "id": "sunan-ibn-majah-3540",
      "hadith_no": "3540",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Drinks - كتاب الأشربة",
      "chapter_no": "30",
      "text_ar": "حدثنا محمد بن عبد الملك بن أبي الشوارب، حدثنا أبو عوانة، عن أبي بشر، عن مجاهد، عن عبد الرحمن بن أبي ليلى، عن حذيفة، قال نهى رسول الله  صلى الله عليه وسلم  عن الشرب في آنية الذهب والفضة وقال ‏\"‏ هي لهم في الدنيا وهي لكم في الآخرة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Hudhaifah said:                      “The Messenger of Allah (ﷺ)forbadedrinking from vessels of gold and silver. He said: “They areforthem in this world and for you in the Hereafter.’”",
      "usc_msa_ref": "",
      "chain": [
        "30450",
        "20469",
        "11419",
        "11028",
        "11196",
        "145"
      ]
    },
    {
      "id": "sunan-ibn-majah-3738",
      "hadith_no": "3738",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا محمد بن عبد الملك بن أبي الشوارب، حدثنا أبو عوانة، عن عثمان بن المغيرة، عن المهاجر، عن عبد الله بن عمر، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من لبس ثوب شهرة في الدنيا ألبسه الله ثوب مذلة يوم القيامة ثم ألهب فيه نارا ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Abdullah bin ‘Umar said:                      “The Messenger ofAllah(ﷺ) said: ‘Whoever wears a garment of pride and vanity in thisworld, Allah will clothe him in a garment of humiliation on the DayofResurrection, then set it ablaze.’”",
      "usc_msa_ref": "",
      "chain": [
        "30450",
        "20469",
        "11640",
        "18"
      ]
    },
    {
      "id": "sunan-ibn-majah-3873",
      "hadith_no": "3873",
      "source": "Sunan Ibn Majah",
      "chapter": "Supplication - كتاب الدعاء",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد بن عبد الملك بن أبي الشوارب، حدثنا عبد العزيز بن المختار، حدثنا سهيل، عن أبيه، عن أبي هريرة، عن النبي  صلى الله عليه وسلم  أنه كان يقول إذا أوى إلى فراشه ‏\"‏ اللهم رب السموات ورب الأرض ورب كل شىء فالق الحب والنوى منزل التوراة والإنجيل والقرآن العظيم أعوذ بك من شر كل دابة أنت آخذ بناصيتها أنت الأول فليس قبلك شىء وأنت الآخر فليس بعدك شىء وأنت الظاهر فليس فوقك شىء وأنت الباطن فليس دونك شىء اقض عني الدين وأغنني من الفقر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that :                     when going to bed, the Prophet (saas) used to say: \"Allahumma Rabbas-samawati wa Rabbal-ardi, wa Rabba kulli shay'in, faliqal-habbi wan-nawa, munzilat-Tawrati wal-Injili wal-Qur'anil-'Azim. A'udhu bika min sharri kulli dabbatin Anta akhidhun binasiyatiha, Antal-Awwalu fa laysa qablaka shayun, wa Antal-Akhiru, fa laysa ba'daka shayun', Antaz-zahiru, fa laysa fawqaka shayun', wa antal-batinu fa laysa dunaka shay', aqdi 'annid-dayna waghnini minal-faqr (O Allah, Lord of the heavens and Lord of the earth and Lord of all things, Cleaver of the seed and the kernel, Revealer of the Tawrah, the Injil and the Magnificent Qur'an, I seek refuge with You from the evil of every creature You seize by the forelock. You are the First and there is nothing before You; You are the Last and there is nothing after You; You are the Most High (Az-Zahir) and there is nothing above You, and You are the Most Near (Al-Batin) and there is nothing nearer than You. Settle my debt for me and spare me from poverty).\"",
      "usc_msa_ref": "",
      "chain": [
        "30450",
        "20252",
        "13"
      ]
    }
  ],
  "total_hadiths": 52
}