{
  "id": "30456",
  "name": "Malik bin Abd al-Wahd مالك بن عبد الواحد أبو غسان المسمعي",
  "full_name": "Malik bin Abd al-Wahd مالك بن عبد الواحد أبو غسان المسمعي",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "230",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  د  -  ثقة ]"
    ],
    "tags": [
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20246",
      "name": "'Abdul A'ala bin 'Abdul A'ala al-Sami عبد الأعلى بن عبد الأعلى البصري السامي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20259",
      "name": "'Abdul Wahab bin 'Abdul Majeed al-Thaqaf عبد الوهاب بن عبد المجيد الثقفي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20288",
      "name": "Ma'tmar bin Sulaiman-al-Taufayl معتمر بن سليمان - الطفيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20276",
      "name": "Muhammad bin Abi 'Adi محمد بن أبي عدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20251",
      "name": "'Abdul 'Aziz bin 'Abdul Samad عبد العزيز بن عبد الصمد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20255",
      "name": "'Abdul Malik bin al-Sbah al-Msm'y عبد الملك بن الصباح المسمعي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20286",
      "name": "Mua'dh bin Mua'dh bin Nsr معاذ بن معاذ بن نصر",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20287",
      "name": "Mua'dh bin Hisham bin Aby معاذ بن هشام بن أبي عبد الله",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20472",
      "name": "Yazid bin Harun يزيد بن هارون",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "34255",
      "name": "Muhammad bin Yonus al-Kadaymi محمد بن يونس بن موسى الكديمي",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "students": [
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-muslim-138",
      "hadith_no": "138",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو غسان المسمعي، مالك بن عبد الواحد حدثنا عبد الملك بن الصباح، عن شعبة، عن واقد بن محمد بن زيد بن عبد الله بن عمر، عن أبيه، عن عبد الله بن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أمرت أن أقاتل الناس حتى يشهدوا أن لا إله إلا الله وأن محمدا رسول الله ويقيموا الصلاة ويؤتوا الزكاة فإذا فعلوا عصموا مني دماءهم وأموالهم إلا بحقها وحسابهم على الله ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Abdullah b. 'Umar that the Messenger of Allah said:                      I have been commanded to fight against people till they testify that there is no god but Allah, that Muhammad is the messenger of Allah, and they establish prayer, and pay Zakat and if they do it, their blood and property are guaranteed protection on my behalf except when justified by law, and their affairs rest with Allah.",
      "usc_msa_ref": "",
      "chain": [
        "30456",
        "20255",
        "20020",
        "11544",
        "11217",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-257",
      "hadith_no": "257",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو غسان المسمعي، حدثنا الضحاك بن مخلد، عن ابن جريج، قال أخبرني أبو الزبير، أنه سمع جابر بن عبد الله، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ بين الرجل وبين الشرك والكفر ترك الصلاة ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Zubair that he heard Jabir b. 'Abdullah saying. I heard the Messenger of Allah (may peace and blessings be upon him) observing this:                      Between man and polytheism and unbelief is the abandonment of salat.",
      "usc_msa_ref": "",
      "chain": [
        "30456",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "id": "sahih-muslim-316",
      "hadith_no": "316",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثني أبو غسان المسمعي، حدثنا معاذ، - وهو ابن هشام - قال حدثني أبي، عن يحيى بن أبي كثير، قال حدثني أبو قلابة، عن ثابت بن الضحاك، عن النبي صلى الله عليه وسلم قال ‏\"‏ ليس على رجل نذر فيما لا يملك ولعن المؤمن كقتله ومن قتل نفسه بشىء في الدنيا عذب به يوم القيامة ومن ادعى دعوى كاذبة ليتكثر بها لم يزده الله إلا قلة ومن حلف على يمين صبر فاجرة ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Thabit b. al-Dahhak that the Apostle of Allah (may peace be upon him) observes:                      None is obliged to give votive offering (of a thing) which is not in his possession and the cursing of a believer is tantamount to killing him, and he who killed himself with a thing in this world would be tormented with that (very thing) on the Day of Resurrection, and he who made a false claim to increase (his wealth), Allah would make no addition but that of paucity, and he who perjured would earn the wrath of God",
      "usc_msa_ref": "",
      "chain": [
        "30456",
        "20287",
        "20295",
        "11449",
        "11047",
        "1902"
      ]
    },
    {
      "id": "sahih-muslim-383",
      "hadith_no": "383",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا أبو غسان المسمعي، ومحمد بن المثنى، وإسحاق بن إبراهيم، قال إسحاق أخبرنا وقال الآخران، حدثنا معاذ بن هشام، قال حدثني أبي، عن قتادة، عن أبي المليح، أن عبيد الله بن زياد، عاد معقل بن يسار في مرضه فقال له معقل إني محدثك بحديث لولا أني في الموت لم أحدثك به سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ما من أمير يلي أمر المسلمين ثم لا يجهد لهم وينصح إلا لم يدخل معهم الجنة ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Malih that Ubaidullah b. Ziyad visited Ma'qil b. Yasar in his illness. Ma'qil said to him:                      I am narrating to you a hadith which I would have never narrated to you had I not been in death-bed. I heard Allah's apostle (may peace be upon him) say: A ruler who has been entrusted with the affairs of the Muslims but he makes no endeavors ( for the material and moral uplift) and does not sincerely mean (their welfare) would not enter Paradise along with them.",
      "usc_msa_ref": "",
      "chain": [
        "30456",
        "30170",
        "30123",
        "30312",
        "20287",
        "20295",
        "11019",
        "11453"
      ]
    },
    {
      "id": "sahih-muslim-466",
      "hadith_no": "466",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا نصر بن علي الجهضمي، وأبو غسان المسمعي وإسحاق بن إبراهيم جميعا عن عبد العزيز بن عبد الصمد، - واللفظ لأبي غسان قال حدثنا أبو عبد الصمد، - حدثنا أبو عمران الجوني، عن أبي بكر بن عبد الله بن قيس، عن أبيه، عن النبي صلى الله عليه وسلم قال ‏\"‏ جنتان من فضة آنيتهما وما فيهما وجنتان من ذهب آنيتهما وما فيهما وما بين القوم وبين أن ينظروا إلى ربهم إلا رداء الكبرياء على وجهه في جنة عدن ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. Qais transmitted on the authority of his father (Abu Musa Ash'ari) that the Apostle (may peace be upon him) said:                      There would be two gardens (in Paradise) the vessels and contents of which would be of silver, and two gardens whose vessels and contents would be of gold. The only thing intervening to hinder the people from looking at their Lord will be the mantle of Grandeur over His face in the Garden of Eden.",
      "usc_msa_ref": "",
      "chain": [
        "30395",
        "30456",
        "11296"
      ]
    },
    {
      "id": "sahih-muslim-499",
      "hadith_no": "499",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني أبو غسان المسمعي، ومحمد بن المثنى، قالا حدثنا معاذ، - وهو ابن هشام - قال حدثني أبي، عن قتادة، حدثنا أنس بن مالك، أن النبي صلى الله عليه وسلم قال ‏\"‏ يخرج من النار من قال لا إله إلا الله وكان في قلبه من الخير ما يزن شعيرة ثم يخرج من النار من قال لا إله إلا الله وكان في قلبه من الخير ما يزن برة ثم يخرج من النار من قال لا إله إلا الله وكان في قلبه من الخير ما يزن ذرة ‏\"‏ ‏.‏ زاد ابن منهال في روايته قال يزيد فلقيت شعبة فحدثته بالحديث فقال شعبة حدثنا به قتادة عن أنس بن مالك عن النبي صلى الله عليه وسلم بالحديث ‏.‏ إلا أن شعبة جعل مكان الذرة ذرة قال يزيد صحف فيها أبو بسطام ‏.‏",
      "text_en": " Anas b. Malik reported:                      Verily the Apostle (may peace be upon him) said: He who professed: There is no god but Allah, would be brought out of the Fire even though he has in his heart virtue equal to the weight of a barley grain. Then he who professed: There is no god but Allah, would come out of the Fire, even though he has in his heart virtue equal to the weight of a wheat grain. He would then bring out from the Fire he who professed: There is no god but Allah, even though he has in his heart virtue equal to the weight of an atom. Ibn Minhal has made an addition (of these words) in his narration: Yazid said: I met Shu'ba and narrated to him this hadith. Shu'ba said: Qatada transmitted to us this hadith from Anas b. Malik who heard it from the Apostle of Allah (may peace be upon him) with this alteration that he substituted the word Zurra (grain) in place of Zarra (atom). Yazid said: Abu Bistam has made a change in it.",
      "usc_msa_ref": "",
      "chain": [
        "30456",
        "30170",
        "20287",
        "20295",
        "11019",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-515",
      "hadith_no": "515",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثني أبو غسان المسمعي، ومحمد بن المثنى، وابن، بشار حدثانا - واللفظ، لأبي غسان - قالوا حدثنا معاذ، - يعنون ابن هشام - قال حدثني أبي، عن قتادة، حدثنا أنس بن مالك، أن نبي الله صلى الله عليه وسلم قال ‏\"‏ لكل نبي دعوة دعاها لأمته وإني اختبأت دعوتي شفاعة لأمتي يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik reported:                      Verily the Apostle of Allah (may peace be upon him) said: There is for every apostle a prayer with which he prays (to Allah) for his Ummah. I have reserved my prayer for the intercession of my Ummah on the Day of Resurrection.",
      "usc_msa_ref": "",
      "chain": [
        "30456",
        "30170",
        "11019",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-348-2",
      "hadith_no": "348",
      "source": "Sahih Muslim",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثني زهير بن حرب، وأبو غسان المسمعي ح وحدثناه محمد بن المثنى، وابن، بشار قالوا حدثنا معاذ بن هشام، قال حدثني أبي، عن قتادة، ومطر، عن الحسن، عن أبي رافع، عن أبي هريرة، أن نبي الله صلى الله عليه وسلم قال ‏\"‏ إذا جلس بين شعبها الأربع ثم جهدها فقد وجب عليه الغسل ‏\"‏ ‏.‏ وفي حديث مطر ‏\"‏ وإن لم ينزل ‏\"‏ ‏.‏ قال زهير من بينهم ‏\"‏ بين أشعبها الأربع ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      The Apostle of Allah (may peace be upon him) said: When a man has sexual intercourse, bathing becomes obligatory (both for the male and the female). In the hadith of Matar the words are: Even if there is no orgasm. Zuhair has narrated it with a minor alteration of words.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "30456",
        "30170",
        "30160",
        "20287",
        "20295",
        "11019",
        "11016",
        "479",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-379-2",
      "hadith_no": "379",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثني أبو غسان المسمعي، مالك بن عبد الواحد وإسحاق بن إبراهيم قال أبو غسان حدثنا معاذ، وقال، إسحاق أخبرنا معاذ بن هشام، صاحب الدستوائي وحدثني أبي، عن عامر الأحول، عن مكحول، عن عبد الله بن محيريز، عن أبي محذورة، أن نبي الله صلى الله عليه وسلم علمه هذا الأذان ‏\"‏ الله أكبر الله أكبر أشهد أن لا إله إلا الله أشهد أن لا إله إلا الله أشهد أن محمدا رسول الله أشهد أن محمدا رسول الله - ثم يعود فيقول - أشهد أن لا إله إلا الله أشهد أن لا إله إلا الله أشهد أن محمدا رسول الله أشهد أن محمدا رسول الله حى على الصلاة - مرتين - حى على الفلاح - مرتين ‏\"‏ ‏.‏ زاد إسحاق ‏\"‏ الله أكبر الله أكبر لا إله إلا الله ‏\"‏ ‏.‏",
      "text_en": " Abu Mahdhura said that the Apostle of Allah (may peace be upon him) taught him Adhan like this:                      Allah is the Greatest, Allah is the Greatest; I testify that there is no god but Allah, I testify that there is no god but Allah; I testify that Muhammad Is the Messenger of Allah, I testify that Muhammad is the Messenger of Allah, and it should be again repeated: I testify that there is no god but Allah, I testify that there is no god but Allah; I testify that Muhammad Is the Messenger of Allah, I testify that Muhammad is the Messenger of Allah. Come to the prayer (twice). Come to the prayer (twice). Ishaq added: Allah is the Greatest, Allah is the Greatest; there Is no god but Allah.",
      "usc_msa_ref": "",
      "chain": [
        "30456",
        "20179",
        "32",
        "30312",
        "20287",
        "20295",
        "10693",
        "11066",
        "11253",
        "2416"
      ]
    },
    {
      "id": "sahih-muslim-404-3",
      "hadith_no": "404",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، حدثنا سعيد بن أبي عروبة، ح وحدثنا أبو غسان المسمعي، حدثنا معاذ بن هشام، حدثنا أبي ح، وحدثنا إسحاق بن إبراهيم، أخبرنا جرير، عن سليمان التيمي، كل هؤلاء عن قتادة، في هذا الإسناد بمثله ‏.‏ وفي حديث جرير عن سليمان عن قتادة من الزيادة ‏\"‏ وإذا قرأ فأنصتوا ‏\"‏ ‏.‏ وليس في حديث أحد منهم ‏\"‏ فإن الله قال على لسان نبيه صلى الله عليه وسلم سمع الله لمن حمده ‏\"‏ ‏.‏ إلا في رواية أبي كامل وحده عن أبي عوانة ‏.‏ قال أبو إسحاق قال أبو بكر ابن أخت أبي النضر في هذا الحديث فقال مسلم تريد أحفظ من سليمان فقال له أبو بكر فحديث أبي هريرة فقال هو صحيح يعني وإذا قرأ فأنصتوا ‏.‏ فقال هو عندي صحيح ‏.‏ فقال لم لم تضعه ها هنا قال ليس كل شىء عندي صحيح وضعته ها هنا ‏.‏ إنما وضعت ها هنا ما أجمعوا عليه ‏.‏",
      "text_en": " Qatida has narrated a badith like this with another chain of transmitters. In the badith transmitted by Jarir on the authority of Sulaiman, Qatida's further words are:                      When (the Qur'in) is recited (in prayer), you should observe silence, and (the following words are) not found in the hadith narrated by anyone except by Abu Kamil who heard it from Abu 'Awina (and the words are): Verily Allah vouchsafed through the tongue of the Apostle of Allah (may peace be upon him) this: Allah listens to him who praises Him. Abu Ishaq (a student of Imam Muslim) said: Abu Bakr the son of Abu Nadr's sister has (critically) discussed this hadith. Imam Muslim said: Whom can you find a more authentic transmitter of badith than Sulaiman? Abu Bakr said to him (Imam Muslim): What about the hadith narrated by Abd Huraira, i. e. the hadith that when the Qur'in is recited (in pray er) observe silence? He (Abu Bakr again) said: Then, why. have you not included it (in your compilation)? He (Imam Muslim) said: I have not included in this every hadith which I deem authentic; I have recorded only such ahadith on which there is an agreement (amongst the Muhaddithin apart from their being authentic).",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20318",
        "11073",
        "30456",
        "20287",
        "20295",
        "30123",
        "4057",
        "11060"
      ]
    },
    {
      "id": "sahih-muslim-425-3",
      "hadith_no": "425",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثني أبو غسان المسمعي، حدثنا معاذ، - يعني ابن هشام - حدثني أبي ح، وحدثنا محمد بن المثنى، حدثنا ابن أبي عدي، عن سعيد، كلاهما عن قتادة، عن أنس، أن نبي الله صلى الله عليه وسلم قال ‏\"‏ أتموا الركوع والسجود فوالله إني لأراكم من بعد ظهري إذا ما ركعتم وإذا ما سجدتم ‏\"‏ ‏.‏ وفي حديث سعيد ‏\"‏ إذا ركعتم وإذا سجدتم ‏\"‏ ‏.‏",
      "text_en": " Anas reported:                      The Apostle of Allah (may peace be upon him) said: Complete the bowing and prostration well. By Allah, I see you behind my back as to how you bow and prostrate or when you bow and prostrate.",
      "usc_msa_ref": "",
      "chain": [
        "30456",
        "20287",
        "20295",
        "30170",
        "20276",
        "11019",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-1416",
      "hadith_no": "1416",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو غسان المسمعي، ومحمد بن المثنى، قالا حدثنا معاذ، - وهو ابن هشام - حدثني أبي، عن قتادة، عن أبي أيوب، عن عبد الله بن عمرو، أن نبي الله صلى الله عليه وسلم قال ‏\"‏ إذا صليتم الفجر فإنه وقت إلى أن يطلع قرن الشمس الأول ثم إذا صليتم الظهر فإنه وقت إلى أن يحضر العصر فإذا صليتم العصر فإنه وقت إلى أن تصفر الشمس فإذا صليتم المغرب فإنه وقت إلى أن يسقط الشفق فإذا صليتم العشاء فإنه وقت إلى نصف الليل ‏\"‏ ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30456",
        "30170",
        "20287",
        "20295",
        "11019",
        "33",
        "29"
      ]
    },
    {
      "id": "sahih-muslim-1462",
      "hadith_no": "1462",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني أبو غسان المسمعي، ومحمد بن المثنى، عن معاذ بن هشام، - قال أبو غسان حدثنا معاذ بن هشام، - حدثني أبي، عن يحيى بن أبي كثير، قال حدثنا أبو سلمة بن عبد الرحمن، عن جابر بن عبد الله، أن عمر بن الخطاب، يوم الخندق جعل يسب كفار قريش وقال يا رسول الله والله ما كدت أن أصلي العصر حتى كادت أن تغرب الشمس ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ فوالله إن صليتها ‏\"‏ ‏.‏ فنزلنا إلى بطحان فتوضأ رسول الله صلى الله عليه وسلم وتوضأنا فصلى رسول الله صلى الله عليه وسلم العصر بعد ما غربت الشمس ثم صلى بعدها المغرب ‏.‏",
      "text_en": " Jabir b. 'Abdullah reported that Umar b. al-Khattab had been cursing the pagans of the Quraish an the day (of the Battle) of Khandaq (Ditch). (He came to the Holy Prophet) and said:                      Messenger of Allah, by God, I could not say. the 'Asr prayer till the sun set. Upon this the Messenger (may peace be upon him) said: By Allah I, too, have not observed it. So we went to a valley. The Messenger of Allah (may peace be upon him) performed ablution and we too performed ablution, and then the Messenger of Allah (may peace be upon him) said the 'Asr prayer after the sun had set. and then said the evening prayer after it.",
      "usc_msa_ref": "",
      "chain": [
        "30456",
        "30170",
        "20287",
        "20179",
        "20287",
        "20295",
        "11449",
        "10567",
        "34",
        "3"
      ]
    },
    {
      "id": "sahih-muslim-1503",
      "hadith_no": "1503",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني أبو غسان المسمعي، حدثنا معاذ، - وهو ابن هشام - حدثني أبي، عن مطر، عن أبي العالية البراء، قال قلت لعبد الله بن الصامت نصلي يوم الجمعة خلف أمراء فيؤخرون الصلاة - قال - فضرب فخذي ضربة أوجعتني وقال سألت أبا ذر عن ذلك فضرب فخذي وقال سألت رسول الله صلى الله عليه وسلم عن ذلك فقال ‏\"‏ صلوا الصلاة لوقتها واجعلوا صلاتكم معهم نافلة ‏\"‏ ‏.‏ قال وقال عبد الله ذكر لي أن نبي الله صلى الله عليه وسلم ضرب فخذ أبي ذر ‏.‏",
      "text_en": " Abu'l-'Aliyat al-Bara' reported:                      I said to 'Abdullah b. Samit: We say our Jumu'a prayer behind those rulers who defer the prayer. He ('Abdullah b. Samit), struck. my thigh that I felt pain and said: I asked Abu Dharr about it, he struck my thigh and said: I asked the Messenger of Allah (may peace be upon him) about it. Upon this he said: Observe prayer at its prescribed time, and treat prayer along with them (along with those Imams who deter prayer) as Nafl. 'Abdullah said: It was narrated to me that the Messenger of Allah (may peace be upon him) struck the thigh of Abd Dharr.",
      "usc_msa_ref": "",
      "chain": [
        "30456",
        "20287",
        "20295",
        "11618",
        "23"
      ]
    },
    {
      "id": "sahih-muslim-1562",
      "hadith_no": "1562",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا محمد بن بشار، حدثنا يحيى بن سعيد، حدثنا شعبة، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو خالد الأحمر، عن سعيد بن أبي عروبة، ح وحدثني أبو غسان المسمعي، حدثنا معاذ، - وهو ابن هشام - حدثني أبي كلهم، عن قتادة، بهذا الإسناد مثله ‏.‏",
      "text_en": " A hadith like this has been narrated by Qatida with the same chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20031",
        "20020",
        "30201",
        "20326",
        "11073",
        "30456",
        "20287"
      ]
    },
    {
      "id": "sahih-muslim-1728",
      "hadith_no": "1728",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثني أبو غسان المسمعي، حدثنا بشر بن المفضل، حدثنا داود، عن النعمان بن سالم، بهذا الإسناد ‏\"‏ من صلى في يوم ثنتى عشرة سجدة تطوعا بني له بيت في الجنة ‏\"‏ ‏.‏",
      "text_en": " Nu'man b. Salim reported with the same chain of transmitters:                      He who observed twelve voluntary rak'ahs, a house will be built for him in Paradise.",
      "usc_msa_ref": "",
      "chain": [
        "30456",
        "20212"
      ]
    },
    {
      "id": "sahih-muslim-1959",
      "hadith_no": "1959",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنيه زهير بن حرب، حدثنا يحيى بن سعيد، عن شعبة، ح وحدثني أبو غسان، المسمعي حدثنا عبد الأعلى، حدثنا سعيد، ح وحدثنا إسحاق بن إبراهيم، أخبرنا معاذ، بن هشام حدثني أبي كلهم، عن قتادة، بهذا الإسناد غير أن في، حديث سعيد وهشام بعد الصبح حتى تشرق الشمس ‏.‏",
      "text_en": " Abu Sa'id al-Khudri reported Allah's Messenger (may peace be upon him) as saying:                      No prayer is valid after the 'Asr prayer till the sun sets and no prayer is valid after the dawn prayer till the sun rises.",
      "usc_msa_ref": "",
      "chain": [
        "20031",
        "20020",
        "30456",
        "20246",
        "11168",
        "30123",
        "20287"
      ]
    },
    {
      "id": "sahih-muslim-2135",
      "hadith_no": "2135",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Eclipse) - كتاب الكسوف",
      "chapter_no": "11",
      "text_ar": "وحدثني أبو غسان المسمعي، ومحمد بن المثنى، قالا حدثنا معاذ، - وهو ابن هشام - حدثني أبي، عن قتادة، عن عطاء بن أبي رباح، عن عبيد بن عمير، عن عائشة،",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30456",
        "30170",
        "20287",
        "20295",
        "11019",
        "11029",
        "11259"
      ]
    },
    {
      "id": "sahih-muslim-2460",
      "hadith_no": "2460",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثني أبو غسان المسمعي، ومحمد بن المثنى، قالا حدثنا معاذ بن هشام، حدثني أبي، عن قتادة، عن أنس، أن نبي الله صلى الله عليه وسلم قال بمثله ‏.‏",
      "text_en": " A hadith like this has been narrated by Anas through another chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30456",
        "30170",
        "20287",
        "20295",
        "11019",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-2998",
      "hadith_no": "2998",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني أبو غسان المسمعي، حدثنا معاذ، - يعني ابن هشام - حدثني أبي، عن مطر، عن أبي الزبير، عن جابر بن عبد الله، أن عائشة، - رضى الله عنها - في حجة النبي صلى الله عليه وسلم أهلت بعمرة ‏.‏ وساق الحديث بمعنى حديث الليث وزاد في الحديث قال وكان رسول الله صلى الله عليه وسلم رجلا سهلا إذا هويت الشىء تابعها عليه فأرسلها مع عبد الرحمن بن أبي بكر فأهلت بعمرة من التنعيم ‏.‏ قال مطر قال أبو الزبير فكانت عائشة إذا حجت صنعت كما صنعت مع نبي الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Jabir b. 'Abdullah reported that A'isha (Allah be pleased with her) enter- ed into the state of Ihram (separately) for 'Umra while the Prophet (may peace be upon him) was performing Hajj. The rest of the hadith is the same, but with this addi- tion:                      The Messenger of Allah (may peace be upon him) was a person of gentle disposi- tion, so when she (A'Isha) wished for a thing, he accepted it (provided it did not contravene the teachings of Islam). So he (in pursuance of her desire for a separate lhram for Umra) sent her with 'Abd al-Rahman b. Abu Bakr and she put on Ihram for 'Umra at al-Tan'im. Matar and Abu Zubair (the two narrators amongst the chain of transmitters) said: Whenever 'A'isha performed Hajj she did as she bad done along with Allah's Apostle (may peace be upon him).",
      "usc_msa_ref": "",
      "chain": [
        "30456",
        "20287",
        "20295",
        "11263",
        "34",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-3282",
      "hadith_no": "3282",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثني أبو غسان المسمعي، حدثنا عبد الأعلى، حدثنا سعيد، عن قتادة، عن سنان بن سلمة، عن ابن عباس، أن ذؤيبا أبا قبيصة، حدثه أن رسول الله صلى الله عليه وسلم كان يبعث معه بالبدن ثم يقول ‏\"‏ إن عطب منها شىء فخشيت عليه موتا فانحرها ثم اغمس نعلها في دمها ثم اضرب به صفحتها ولا تطعمها أنت ولا أحد من أهل رفقتك ‏\"‏ ‏.‏",
      "text_en": " Ibn Abbas (Allah be pleased with them) reported that Dhuwaib, father of Qabisa (Allah be pleased with him) narrated to him that Allah's Messenger (may peace be upon him) sent under his charge the sacrificial camels, and said:                      If any of these is completely exhausted and you apprehend its death, then slaughter it, then dip its hoofs in its blood and imprint it on its hump; but neither you nor any one of your comrades should eat it.",
      "usc_msa_ref": "",
      "chain": [
        "30456",
        "20246",
        "11168",
        "11019",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-3328",
      "hadith_no": "3328",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني أبو غسان المسمعي، ومحمد بن بشار، جميعا عن معاذ بن هشام، - قال أبو غسان حدثنا معاذ، - حدثني أبي، عن قتادة، عن قزعة، عن أبي سعيد الخدري، أن نبي الله صلى الله عليه وسلم قال ‏\"‏ لا تسافر امرأة فوق ثلاث ليال إلا مع ذي محرم ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id Khudri (Allah be pleased with him) reported Allah's Apostle (may peace be upon him) as saying:                      A woman should not set out on a journey extending beyond three nights but with a Mahram.",
      "usc_msa_ref": "",
      "chain": [
        "30456",
        "30160",
        "20287",
        "20179",
        "32",
        "11019",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-3514",
      "hadith_no": "3514",
      "source": "Sahih Muslim",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثني أبو غسان المسمعي، حدثنا عبد الأعلى، ح وحدثني أبو الخطاب، زياد بن يحيى حدثنا محمد بن سواء، قالا جميعا حدثنا سعيد، عن مطر، ويعلى بن حكيم، عن نافع، عن نبيه بن وهب، عن أبان بن عثمان، عن عثمان بن عفان، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا ينكح المحرم ولا ينكح ولا يخطب ‏\"‏ ‏.‏",
      "text_en": " Uthman b. 'Affan reported that Allah's Messenger (may peace be upon him) had said:                      A Muhrim should neither marry himself, nor should he be got married to anyone, nor should he make the proposal of marriage.",
      "usc_msa_ref": "",
      "chain": [
        "30456",
        "20246",
        "30135",
        "20565",
        "11168",
        "11567",
        "11014",
        "10582",
        "4"
      ]
    },
    {
      "id": "sahih-muslim-3634",
      "hadith_no": "3634",
      "source": "Sahih Muslim",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثني أبو غسان المسمعي، حدثنا معاذ، - يعني ابن هشام - حدثني أبي، عن أبي الزبير، عن جابر، قال كنا نعزل على عهد رسول الله صلى الله عليه وسلم فبلغ ذلك نبي الله صلى الله عليه وسلم فلم ينهنا ‏.‏",
      "text_en": " Jabir (Allah be pleased with him) reported:                      We used to practise 'azl during the lifetime of Allah's Messenger (may peace be upon him). This (the news of this practise) reached Allah's Apostle (may peace be upon him), and he did not forbid us.",
      "usc_msa_ref": "",
      "chain": [
        "30456",
        "20287",
        "20295",
        "11263",
        "34"
      ]
    },
    {
      "id": "sahih-muslim-3665",
      "hadith_no": "3665",
      "source": "Sahih Muslim",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "وحدثني أبو غسان المسمعي، حدثنا معاذ، ح وحدثنا ابن المثنى، وابن، بشار قالا حدثنا معاذ بن هشام، حدثني أبي، عن قتادة، عن صالح بن أبي مريم أبي الخليل، عن عبد الله بن الحارث، عن أم الفضل، أن رجلا، من بني عامر بن صعصعة قال يا نبي الله هل تحرم الرضعة الواحدة قال ‏\"‏ لا ‏\"‏ ‏.‏",
      "text_en": " Umm Fadl (Allah be pleased with her) reported that a person from Banu 'Amir b. Sa'sa said:                      Allah's Apostle, does one suckling make the (marriage) unlawful? He said: No.",
      "usc_msa_ref": "",
      "chain": [
        "30456",
        "32",
        "30160",
        "20287",
        "20295",
        "11019",
        "912"
      ]
    },
    {
      "id": "sahih-muslim-3810",
      "hadith_no": "3810",
      "source": "Sahih Muslim",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "وحدثناه أبو غسان المسمعي، ومحمد بن المثنى، قالا حدثنا عبد الوهاب، قال سمعت يحيى بن سعيد، يقول سمعت نافعا، يحدث عن صفية بنت أبي عبيد، أنها سمعت حفصة بنت عمر، زوج النبي صلى الله عليه وسلم تحدث عن النبي صلى الله عليه وسلم بمثل حديث الليث وابن دينار وزاد ‏\"‏ فإنها تحد عليه أربعة أشهر وعشرا ‏\"‏ ‏.‏",
      "text_en": " Safiyya bint Abu 'Ubaid reported that she heard Hafsa daughter of Umar (Allah be pleased with them), (and) wife of Allah's Prophet (may peace be upon him), narrating a hadith like this from Allah's Apostle (may peace be upon him), and she made this addition:                     \" She should abstain from adorning herself (in case of the death of her husband) for four months and ten days.\"",
      "usc_msa_ref": "",
      "chain": [
        "30456",
        "30170",
        "20259",
        "11062",
        "11014",
        "11811"
      ]
    },
    {
      "id": "sahih-muslim-3824",
      "hadith_no": "3824",
      "source": "Sahih Muslim",
      "chapter": "The Book of Invoking Curses - كتاب اللعان",
      "chapter_no": "20",
      "text_ar": "وحدثنا أبو غسان المسمعي، ومحمد بن المثنى، وابن، بشار - واللفظ للمسمعي وابن المثنى - قالوا حدثنا معاذ، - وهو ابن هشام - قال حدثني أبي، عن قتادة، عن عزرة، عن سعيد بن جبير، قال لم يفرق المصعب بين المتلاعنين ‏.‏ قال سعيد فذكر ذلك لعبد الله بن عمر ‏.‏ فقال فرق نبي الله صلى الله عليه وسلم بين أخوى بني العجلان ‏.‏",
      "text_en": " Sa'id b. Jubair reported that Mus'ab b. Zubair did not effect separation between the Mutala'inain (invokers of curses). Sa'id said:                      It was mentioned to 'Abdullah b. Umar (Allah be pleased with them) and he said: Allah's Apostle (may peace be upon him) effected separation between the two members of Banu al-'Ajlan.",
      "usc_msa_ref": "",
      "chain": [
        "30456",
        "30170",
        "20287",
        "20295",
        "11019",
        "10799",
        "11050"
      ]
    },
    {
      "id": "sahih-muslim-4461",
      "hadith_no": "4461",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Oath; for Establishing the Responsibility of Murders; Fighting; Requital - كتاب القسامة والمحاربين والقصاص والديات",
      "chapter_no": "29",
      "text_ar": "حدثني أبو غسان المسمعي، حدثنا معاذ، - يعني ابن هشام - حدثني أبي، عن قتادة، عن زرارة بن أوفى، عن عمران بن حصين، أن رجلا، عض ذراع رجل فجذبه فسقطت ثنيته فرفع إلى النبي صلى الله عليه وسلم فأبطله وقال ‏\"‏ أردت أن تأكل لحمه ‏\"‏ ‏.‏",
      "text_en": " 'Imran b. Husain reported that a person bit the arm of another person; he pulled it out and his foretooth fell down. This matter was taken to Allah's Apostle (may peace be upon him), and he turned it down saying:                      Did you want to eat his flesh?",
      "usc_msa_ref": "",
      "chain": [
        "30456",
        "20287",
        "20295",
        "11019",
        "11284",
        "123"
      ]
    },
    {
      "id": "sahih-muslim-4462",
      "hadith_no": "4462",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Oath; for Establishing the Responsibility of Murders; Fighting; Requital - كتاب القسامة والمحاربين والقصاص والديات",
      "chapter_no": "29",
      "text_ar": "حدثني أبو غسان المسمعي، حدثنا معاذ بن هشام، حدثني أبي، عن قتادة، عن بديل، عن عطاء بن أبي رباح، عن صفوان بن يعلى، أن أجيرا، ليعلى ابن منية عض رجل ذراعه فجذبها فسقطت ثنيته فرفع إلى النبي صلى الله عليه وسلم فأبطلها وقال ‏\" أردت أن تقضمها كما يقضم الفحل ‏\"‏ ‏.‏",
      "text_en": " Safwan b. Ya'la reported that a person bit the arm of the servant of Ya'la b. Munya. He pulled it and his foretooth fell. The matter was referred to Allah's Apostle (may peace be upon him) and he turned it down and said:                      Did you intend to bite his hand, as the camel bites?",
      "usc_msa_ref": "",
      "chain": [
        "30456",
        "20287",
        "20295",
        "11019",
        "11029",
        "11248"
      ]
    },
    {
      "id": "sahih-muslim-4836",
      "hadith_no": "4836",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا أبو غسان المسمعي، وإسحاق بن إبراهيم، ومحمد بن المثنى، قال إسحاق أخبرنا وقال الآخران، حدثنا معاذ بن هشام، حدثني أبي، عن قتادة، عن أبي المليح، أنإني محدثك بحديث لولا أني في الموت لم أحدثك به سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ما من أمير يلي أمر المسلمين ثم لا يجهد لهم وينصح إلا لم يدخل معهم الجنة ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Abu Malik that Ubaidullah b. Ziyad visited Ma'qil b. Yaser in the latter's illness. Ma'qil said to him:                      I am narrating to you a tradition. If I were not at death's door, I would not narrate it to you. I heard the Messenger of Allah (may peace he upon him) say: A ruler who, having obtained control over the affairs of the Muslims, does not strive for their betterment and does not serve them sincerely shall not enter Paradise with them.",
      "usc_msa_ref": "",
      "chain": [
        "30456",
        "30123",
        "30170",
        "30312",
        "20287",
        "20295",
        "11019"
      ]
    },
    {
      "id": "sahih-muslim-4907",
      "hadith_no": "4907",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثني أبو غسان المسمعي، ومحمد بن بشار، جميعا عن معاذ، - واللفظ لأبي غسان - حدثنا معاذ، - وهو ابن هشام الدستوائي - حدثني أبي، عن قتادة، حدثنا الحسن، عن ضبة بن محصن العنزي، عن أم سلمة، زوج النبي صلى الله عليه وسلم عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ إنه يستعمل عليكم أمراء فتعرفون وتنكرون فمن كره فقد برئ ومن أنكر فقد سلم ولكن من رضي وتابع ‏\"‏ ‏.‏ قالوا يا رسول الله ألا نقاتلهم قال ‏\"‏ لا ما صلوا ‏\"‏ ‏.‏ أى من كره بقلبه وأنكر بقلبه ‏.‏",
      "text_en": " It has been narrated (through a different chain of tmnamitters) on the authority of Umm Salama (wife of the Holy Prophet) that he said:                      Amirs will be appointed over you, and you will find them doing good as well as bad deeds. One who hates their bad deeds is absolved from blame. One who disapproves of their bad deeds is (also) safe (so far as Divine wrath is concerned). But one who approves of their bad deeds and imitates them (is doomed). People asked: Messenger of Allah, shouldn't we fight against them? He replied: No, as long as they say their prayer. (\" Hating and disapproving\" refers to liking and disliking from the heart.)",
      "usc_msa_ref": "",
      "chain": [
        "30456",
        "30160",
        "20287",
        "20295",
        "11019",
        "11016"
      ]
    },
    {
      "id": "sahih-muslim-5251",
      "hadith_no": "5251",
      "source": "Sahih Muslim",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثنا أبو غسان المسمعي، ومحمد بن المثنى، وابن، بشار قالوا أخبرنا معاذ، بن هشام حدثني أبي، عن قتادة، عن أنس بن مالك، قال إني لأسقي أبا طلحة وأبا دجانة وسهيل ابن بيضاء من مزادة فيها خليط بسر وتمر ‏.‏ بنحو حديث سعيد ‏.‏",
      "text_en": " Anas b. Malik said:                      I was serving wine to Abu Talha, Abu Dujana, and Suhail b. Baida' from a waterskin which contained the mixture of unripe dates and fresh dates. The rest of the hadith is the same.",
      "usc_msa_ref": "",
      "chain": [
        "30456",
        "30170",
        "30160",
        "20287",
        "20295",
        "11019",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-5537",
      "hadith_no": "5537",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "وحدثنا أبو غسان المسمعي، ومحمد بن المثنى، قالا حدثنا معاذ، - وهو ابن هشام - حدثني أبي، عن قتادة، بهذا الإسناد مثله ولم يذكر قول أبي عثمان ‏.‏",
      "text_en": " This hadith has been reported on the authority of Qatada but there is no mention of the words of Abd Uthman.",
      "usc_msa_ref": "",
      "chain": [
        "30456",
        "30170",
        "20287",
        "20295"
      ]
    },
    {
      "id": "sahih-muslim-5538",
      "hadith_no": "5538",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "حدثنا عبيد الله بن عمر القواريري، وأبو غسان المسمعي وزهير بن حرب وإسحاق بن إبراهيم ومحمد بن المثنى وابن بشار - قال إسحاق أخبرنا وقال الآخرون، حدثنا - معاذ بن هشام، حدثني أبي، عن قتادة، عن عامر الشعبي، عن سويد بن غفلة، أن عمر، بن الخطاب خطب بالجابية فقال نهى نبي الله صلى الله عليه وسلم عن لبس الحرير إلا موضع إصبعين أو ثلاث أو أربع ‏.‏",
      "text_en": " Suwaid b. Ghafala said:                      'Umar addressed us at a place known as Jabiya (Syria) and he said: Allah's Apostle (may peace be upon him) forbade us the wearing of silk but to the extent of two or three fingers or four fingers.",
      "usc_msa_ref": "",
      "chain": [
        "30024",
        "30456",
        "30312",
        "20287",
        "20295",
        "11019",
        "11052",
        "11174"
      ]
    },
    {
      "id": "sahih-muslim-5664",
      "hadith_no": "5664",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "حدثنا أبو غسان المسمعي، ومحمد بن المثنى، قالا حدثنا معاذ بن هشام، حدثنا  أبي، عن قتادة، عن النضر بن أنس، أن رجلا، أتى ابن عباس ‏.‏ فذكر عن النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " Nadr b. Anas reported that a person came to Ibn 'Abbas and he narrated (the above menlioned hadith) from Allah's Apostle (may peace be upon him).",
      "usc_msa_ref": "",
      "chain": [
        "30456",
        "30170",
        "20287",
        "20295",
        "11019",
        "11310"
      ]
    },
    {
      "id": "sahih-muslim-5703",
      "hadith_no": "5703",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "وحدثني أبو غسان المسمعي، ومحمد بن المثنى، قالا أخبرنا معاذ، - وهو ابن هشام - حدثني أبي، عن قتادة، عن سعيد بن المسيب، أن معاوية، قال ذات يوم إنكم قد أحدثتم زي سوء وإن نبي الله صلى الله عليه وسلم نهى عن الزور ‏.‏ قال وجاء رجل بعصا على رأسها خرقة قال معاوية ألا وهذا الزور ‏.‏ قال قتادة يعني ما يكثر به النساء أشعارهن من الخرق ‏.‏",
      "text_en": " Sa, id b. Musayyib reported that Mu'awiya said one day:                      Should I narrate to you the evil make-up. Allah's Apostle (may peace be upon him) forbade cheating. It was during that time that a person came with a staff and there was a cloth on its head, whereupon Mu, awiya said: Behold, that is cheating. Qatada said: This implies how women artificially increase their hair with the help of rags.",
      "usc_msa_ref": "",
      "chain": [
        "30456",
        "30170",
        "20287",
        "20295",
        "11019",
        "11002",
        "27"
      ]
    },
    {
      "id": "sahih-muslim-6082",
      "hadith_no": "6082",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثني أبو غسان المسمعي، حدثنا معاذ، - يعني ابن هشام - حدثني أبي، عن  قتادة، حدثنا أنس بن مالك، أن نبي الله صلى الله عليه وسلم وأصحابه بالزوراء - قال والزوراء بالمدينة عند السوق والمسجد فيما ثمه - دعا بقدح فيه ماء فوضع كفه فيه فجعل ينبع من بين أصابعه فتوضأ جميع أصحابه ‏.‏ قال قلت كم كانوا يا أبا حمزة قال كانوا زهاء الثلاثمائة ‏.‏",
      "text_en": " Anas b. Malik reported that Allah's Apostle (may peace be upon him) and his Companions were at a place known as az-Zaura' (az-Zaurd' is a place in the bazar of Medina near the mosque) that he called for a vessel containing water. He put his hand in that. And there began to spout (water) between his fingers and all the Companions performed ablution. Qatada, one of the narrators in the chain of narrators, said:                      Abu Hamza (the kunya of Hadrat Anas b. Malik), how many people were they? He said: They were about three hundred.",
      "usc_msa_ref": "",
      "chain": [
        "30456",
        "20287",
        "20295",
        "11019",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-6130",
      "hadith_no": "6130",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا أبو غسان المسمعي، ومحمد بن المثنى، وابن، بشار - وألفاظهم متقاربة - قالوا حدثنا معاذ، - وهو ابن هشام - حدثني أبي، عن قتادة، عن سالم بن أبي الجعد، عن معدان بن أبي طلحة اليعمري، عن ثوبان، أن نبي الله صلى الله عليه وسلم قال ‏\"‏ إني لبعقر حوضي أذود الناس لأهل اليمن أضرب بعصاى حتى يرفض عليهم ‏\"‏ ‏.‏ فسئل عن عرضه فقال ‏\"‏ من مقامي إلى عمان ‏\"‏ ‏.‏ وسئل عن شرابه فقال ‏\"‏ أشد بياضا من اللبن وأحلى من العسل يغت فيه ميزابان يمدانه من الجنة أحدهما من ذهب والآخر من ورق ‏\"‏ ‏.‏  وحدثنيه زهير بن حرب، حدثنا الحسن بن موسى، حدثنا شيبان، عن قتادة، بإسناد هشام ‏.‏ بمثل حديثه غير أنه قال ‏\"‏ أنا يوم القيامة عند عقر الحوض ‏\"‏ ‏.‏",
      "text_en": " Thauban reported Allah's Apostle (may peace be upon him) as saying:                      I would be pushing back from my Cistern the crowd of people. I would strike away from it (the Cistern) with my staff the people of Yemen until the water (of the Haud) would spout forth upon them. He was asked about its breadth. He said: From this place of mine to 'Amman, and he was asked about the drink and he said: It is whiter than milk and sweeter than honey. There would spout into it two streamlets having their sources in Paradise. the one is from gold and the other is from silver. This hadith has been narrated on the authority of Hisham with the same chain of transmitters and the words are:\" I would be on the Day of Resurrection near the bank of the Cistern.\"",
      "usc_msa_ref": "",
      "chain": [
        "30456",
        "30170",
        "20287",
        "20295",
        "11019",
        "11342",
        "10878",
        "130"
      ]
    },
    {
      "id": "sahih-muslim-6776",
      "hadith_no": "6776",
      "source": "Sahih Muslim",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو غسان المسمعي وعاصم بن النضر التيمي قالوا حدثنا معتمر بن سليمان، ح وحدثنا إسحاق بن إبراهيم، أخبرنا عبد الرزاق، كلاهما عن معمر، عن زيد بن أسلم، في هذا الإسناد بمثل معنى حديث حفص بن ميسرة ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Zaid b. Aslam with the same chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30456",
        "20288",
        "30123",
        "20115",
        "11163"
      ]
    },
    {
      "id": "sahih-muslim-6857",
      "hadith_no": "6857",
      "source": "Sahih Muslim",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثني أبو غسان المسمعي، حدثنا عثمان بن عمر، حدثنا أبو عامر، - يعني الخزاز - عن أبي عمران الجوني، عن عبد الله بن الصامت، عن أبي ذر، قال قال لي النبي صلى الله عليه وسلم ‏\"‏ لا تحقرن من المعروف شيئا ولو أن تلقى أخاك بوجه طلق ‏\"‏ ‏.‏",
      "text_en": " Abu Dharr reported:                      Allah's Apostle (may peace be upon him) said to me: Don't consider anything insignificant out of good things even if it is that you meet your brother with a cheerful countenance.",
      "usc_msa_ref": "",
      "chain": [
        "30456",
        "20262",
        "10690",
        "11296",
        "10695",
        "23"
      ]
    },
    {
      "id": "sahih-muslim-6887",
      "hadith_no": "6887",
      "source": "Sahih Muslim",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "وحدثنا أبو غسان المسمعي، ومحمد بن المثنى، قالا حدثنا معاذ، - يعني ابن هشام - حدثني أبي، عن قتادة، عن أنس، عن النبي صلى الله عليه وسلم بهذا الحديث ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30456",
        "30170",
        "20287",
        "20295",
        "11019",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-7338",
      "hadith_no": "7338",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "وحدثني أبو غسان المسمعي، حدثنا أبو عبد الصمد، حدثنا أبو عمران الجوني، عن أبي بكر بن عبد الله بن قيس، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ في الجنة خيمة من لؤلؤة مجوفة عرضها ستون ميلا في كل زاوية منها أهل ما يرون الآخرين يطوف عليهم المؤمن ‏\"‏ ‏.‏",
      "text_en": " Abu Bakr b. Abdullah b. Qais reported on the authority of his father that Allah's Messenger (may peace be upon him) said that in Paradise there would be a tent made of a single hollowed pearl, the breadth of which would be sixty miles from all sides and there would live a family in each corner and the other would not be able to see the believer who goes around them.",
      "usc_msa_ref": "",
      "chain": [
        "30456",
        "11296"
      ]
    },
    {
      "id": "sahih-muslim-7386",
      "hadith_no": "7386",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "حدثني أبو غسان المسمعي، ومحمد بن المثنى، ومحمد بن بشار بن عثمان، - واللفظ لأبي غسان وابن المثنى - قالا حدثنا معاذ بن هشام، حدثني أبي، عن قتادة، عن  مطرف بن عبد الله بن الشخير، عن عياض بن حمار المجاشعي، أن رسول الله صلى الله عليه وسلم قال ذات يوم في خطبته ‏\"‏ ألا إن ربي أمرني أن أعلمكم ما جهلتم مما علمني يومي هذا كل مال نحلته عبدا حلال وإني خلقت عبادي حنفاء كلهم وإنهم أتتهم الشياطين فاجتالتهم عن دينهم وحرمت عليهم ما أحللت لهم وأمرتهم أن يشركوا بي ما لم أنزل به سلطانا وإن الله نظر إلى أهل الأرض فمقتهم عربهم وعجمهم إلا بقايا من أهل الكتاب وقال إنما بعثتك لأبتليك وأبتلي بك وأنزلت عليك كتابا لا يغسله الماء تقرؤه نائما ويقظان وإن الله أمرني أن أحرق قريشا فقلت رب إذا يثلغوا رأسي فيدعوه خبزة قال استخرجهم كما استخرجوك واغزهم نغزك وأنفق فسننفق عليك وابعث جيشا نبعث خمسة مثله وقاتل بمن أطاعك من عصاك ‏.‏ قال وأهل الجنة ثلاثة ذو سلطان مقسط متصدق موفق ورجل رحيم رقيق القلب لكل ذي قربى ومسلم وعفيف متعفف ذو عيال - قال - وأهل النار خمسة الضعيف الذي لا زبر له الذين هم فيكم تبعا لا يتبعون أهلا ولا مالا والخائن الذي لا يخفى له طمع وإن دق إلا خانه ورجل لا يصبح ولا يمسي إلا وهو يخادعك عن أهلك ومالك ‏\"‏ ‏.‏ وذكر البخل أو الكذب ‏\"‏ والشنظير الفحاش ‏\"‏ ‏.‏ ولم يذكر أبو غسان في حديثه ‏\"‏ وأنفق فسننفق عليك ‏\"‏ ‏.‏",
      "text_en": " 'Iyad b. Him-ar reported that Allah's Messenger (may peace be upon him), while delivering a sermon one day, said:                      Behold, my Lord commanded me that I should teach you which you do not know and which He has taught me today. (He has instructed thus): The property which I have conferred upon them is lawful for them. I have created My servants as one having a natural inclination to the worship of Allah but it is Satan who turns them away from the right religion and he makes unlawful what has been declared lawful for them and he commands them to ascribe partnership with Re, although he has no justification for that. And verily, Allah looked towards the people of the world and He showed hatred for the Arabs and the non-Arabs, but with the exception of some remnants from the People of the Book. And He (further) said: I have sent thee (the Holy Prophet) in order to put you to test and put (those to test) through you. And I sent the Book to you which cannot be washed away by water, so that you may recite it while in the state of wakefulness or sleep. Verily, Allah commanded me to burn (kill) the Quraish. I said: My Lord, they would break my head (like the tearing) of bread, and Allah said: You turn them out as they turned you out, you fight against them and We shall help you in this, you should spend and you would be conferred upon. You send an army and I would send an army five times greater than that. Fight against those who disobey you along with those who obey you. The inmates of Paradise are three: One who wields authority and is just and fair, one who Is truthful and has been endowed with power to do good deeds. And the person who is merciful and kind hearted towards his relatives and to every pious Muslim, and one who does not stretch his hand in spite of having a large family to support. And He said: The inmates of Hell are five: the weak who lack power to (avoid evil), the (carefree) who pursue (everything irrespective of the fact that it is good or evil) and who do not have any care for their family or for their wealth. And those dishonest whose greed cannot be concealed even in the case of minor things. And the third. who betray you. morning and evening, in regard to your family and your property. He also made a mention of the miser and the liar and those who are in the habit of abusing people and using obscene and foul language. Abu Ghassan in his narration did not make mention of\" Spend and there would be spent for you.\"",
      "usc_msa_ref": "",
      "chain": [
        "30456",
        "30170",
        "30160",
        "20287",
        "20295",
        "11019",
        "11305",
        "5217"
      ]
    },
    {
      "id": "sahih-muslim-7597",
      "hadith_no": "7597",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "وحدثنا أبو غسان المسمعي، حدثنا معتمر، عن أبيه، عن معبد، عن أنس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ بعثت أنا والساعة كهاتين ‏\"‏ ‏.‏ قال وضم السبابة والوسطى ‏.‏",
      "text_en": " Anas reported Allah's Messenger (may peace be upon him) as saying:                      I and the Last Hour have been sent like this and (he while doing it) joined the forefinger with the middle finger.",
      "usc_msa_ref": "",
      "chain": [
        "30456",
        "20288",
        "11289",
        "19"
      ]
    }
  ],
  "total_hadiths": 44
}