{
  "id": "30465",
  "name": "Sa'id bin 'Amr bin Sahl al-Kundi سعيد بن عمرو بن سهل الكندي الأشعثي",
  "full_name": "Sa'id bin 'Amr bin Sahl al-Kundi سعيد بن عمرو بن سهل الكندي الأشعثي",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "230",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  س  -  ثقة ]"
    ],
    "tags": [
      "al-Kundi",
      "al-Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20329",
      "name": "Abthr bin al-Qasim al-Zbydy Abu عبثر بن القاسم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20317",
      "name": "Hafs bin Ghyath حفص بن غياث",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20022",
      "name": "Hammad bin Zayd حماد بن زيد بن درهم الأزدي الأزرق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20201",
      "name": "Marwan bin Mua'wiya al-Fazari مروان بن معاوية الفزاري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20157",
      "name": "Abu Damra, Anas bin 'Ayyad أنس بن عياض الليثي - أبو ضمرة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "students": [
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]"
    },
    {
      "id": "30475",
      "name": "al-Qasim bin Zakaria bin Dinar القاسم بن زكريا بن دينار القرشي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "35133",
      "name": "Muhammad bin 'Ubaid bin 'Utba محمد بن عبيد بن عتبة",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "311",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني زهير بن حرب، حدثنا جرير، ح وحدثنا سعيد بن عمرو الأشعثي، أخبرنا عبثر، كلاهما عن الأعمش، بهذا الإسناد مثله غير أن في حديث جرير ‏\"‏ ورجل ساوم رجلا بسلعة ‏\"‏ ‏.‏",
      "text_en": " The same hadith has been transmitted by another chain of transmitters with the exception of these words:                      He offered for sale a commodity to another person.",
      "chain": [
        "30022",
        "20028",
        "30465"
      ]
    },
    {
      "hadith_no": "314",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني زهير بن حرب، حدثنا جرير، ح وحدثنا سعيد بن عمرو الأشعثي، حدثنا عبثر، ح وحدثني يحيى بن حبيب الحارثي، حدثنا خالد، - يعني ابن الحارث - حدثنا شعبة، كلهم بهذا الإسناد مثله ‏.‏ وفي رواية شعبة عن سليمان قال سمعت ذكوان ‏.‏",
      "text_en": " This hadith has been narrated by another chain of transmitters.",
      "chain": [
        "30022",
        "20028",
        "30465",
        "20226",
        "11005"
      ]
    },
    {
      "hadith_no": "483",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا سعيد بن عمرو الأشعثي، حدثنا سفيان بن عيينة، عن مطرف، وابن، أبجر عن الشعبي، قال سمعت المغيرة بن شعبة، رواية إن شاء الله ح",
      "text_en": "",
      "chain": [
        "30465",
        "20005",
        "11395",
        "10792",
        "11052",
        "166"
      ]
    },
    {
      "hadith_no": "1539",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا سعيد بن عمرو الأشعثي، أخبرنا عبثر، ح وحدثني محمد بن بكار بن الريان، قال حدثنا إسماعيل بن زكرياء، ح وحدثنا ابن المثنى، قال حدثنا ابن أبي عدي، عن شعبة، كلهم عن الأعمش، في هذا الإسناد بمثل معناه ‏.‏",
      "text_en": " A hadith having the same meaning (as mentioned above) has been transmitted by A'mash.",
      "chain": [
        "30465",
        "30512",
        "20313",
        "20276"
      ]
    },
    {
      "hadith_no": "1549",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا سعيد بن عمرو الأشعثي، ومحمد بن أبي عمر، كلاهما عن ابن عيينة، ح وحدثنا سعيد بن أزهر الواسطي، قال حدثنا وكيع، حدثنا أبي كلهم، عن عاصم، بهذا الإسناد نحوه ‏.‏",
      "text_en": " A hadith like this has been narrated by 'Asim with the same chain of transmitters.",
      "chain": [
        "30465",
        "20005",
        "20032"
      ]
    },
    {
      "hadith_no": "2675",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا سعيد بن عمرو الأشعثي، وسهل بن عثمان، وسويد بن سعيد، وحسين، بن حريث كلهم عن مروان، - قال سعيد أخبرنا مروان بن معاوية، - عن عاصم، قال سمعت أبا نضرة، يحدث عن أبي سعيد الخدري، وجابر بن عبد الله، - رضى الله عنهم - قالا سافرنا مع رسول الله صلى الله عليه وسلم فيصوم الصائم ويفطر المفطر فلا يعيب بعضهم على بعض ‏.‏",
      "text_en": " Abu Nadra reported Abu Sa'id al. Khudri and Jabir b. Abdullah as saying:                      We travelled with the Messenger of Allah (may peace be upon him). The observer of the fast observed it, and the breaker of the fast broke it, but none of them found fault with each other.",
      "chain": [
        "30465",
        "30546",
        "30547",
        "30325",
        "20201",
        "11168",
        "20201",
        "11080",
        "10721",
        "38",
        "34"
      ]
    },
    {
      "hadith_no": "2832",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا سعيد بن عمرو بن سهل بن إسحاق بن محمد بن الأشعث بن قيس، الكندي وعلي بن خشرم قالا حدثنا أبو ضمرة، حدثني الضحاك بن عثمان، - وقال ابن خشرم عن الضحاك بن عثمان، - عن أبي النضر، مولى عمر بن عبيد الله عن بسر بن، سعيد عن عبد الله بن أنيس، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أريت ليلة القدر ثم أنسيتها وأراني صبحها أسجد في ماء وطين ‏\"‏ ‏.‏ قال فمطرنا ليلة ثلاث وعشرين فصلى بنا رسول الله صلى الله عليه وسلم فانصرف وإن أثر الماء والطين على جبهته وأنفه ‏.‏ قال وكان عبد الله بن أنيس يقول ثلاث وعشرين ‏.‏",
      "text_en": " 'Abdullah b. Unais reported Allah's Messenger (may peace beupon him) as saying:                      I was shown Lailat-ul-Qadr; then I was made to forget it, and saw that I was prostrating in water and clay in the morning of that (night). He (the narrator) said: There was a downpour on the twenty-third night and the Messenger of Allah (may peace be upon him) led us in prayer, and as he went back, there was a trace of water and clay on his forehead and on his nose. He (the narrator) said: 'Abdullah b. Unais used to say that it was the twenty-third (night).",
      "chain": [
        "30465",
        "30556",
        "20157",
        "20504",
        "30556",
        "20504",
        "11164",
        "11153",
        "1048"
      ]
    },
    {
      "hadith_no": "3454",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وسعيد بن عمرو الأشعثي، قال سعيد أخبرنا وقال أبو بكر، حدثنا حاتم بن إسماعيل، عن حميد، عن أبي سلمة، عن أبي سعيد، عن النبي صلى الله عليه وسلم بمثله ولم يذكر عبد الرحمن بن أبي سعيد في الإسناد ‏.‏",
      "text_en": " Abu Sa'id reported from Allah's Apostle (may peace be upon him) a hadlth like this, but in the chain of transmitters no mention was made of Abd al- Rahman b. Abu Sa'id.",
      "chain": [
        "30201",
        "30465",
        "11168",
        "20436",
        "20159",
        "11279",
        "10567",
        "38"
      ]
    },
    {
      "hadith_no": "3630",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "حدثنا سعيد بن عمرو الأشعثي، حدثنا سفيان بن عيينة، عن سعيد بن حسان، عن عروة بن عياض، عن جابر بن عبد الله، قال سأل رجل النبي صلى الله عليه وسلم فقال إن عندي جارية لي وأنا أعزل عنها ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن ذلك لن يمنع شيئا أراده الله ‏\"‏ ‏.‏ قال فجاء الرجل فقال يا رسول الله إن الجارية التي كنت ذكرتها لك حملت ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أنا عبد الله ورسوله‏\"‏ ‏.‏",
      "text_en": " Jabir b. 'Abdullah (Allah be pleased with them) reported that a person asked Allah's Apostle (may peace be upon him) saying:                      I have a slave-girl and I practise 'azl with her, whereupon Allah's Messenger (may peace be upon him) said: This cannot prevent that which Allah has decreed. The person then came (after some time) and said: Messenger of Allah, the slave-girl about whom I talked to you has conceived, whereupon Allah's Messeuger (may peace be upon him) said: I am the servant of Allah and His Messenger.",
      "chain": [
        "30465",
        "20005",
        "10639",
        "10650",
        "34"
      ]
    },
    {
      "hadith_no": "4207",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا سعيد بن عمرو الأشعثي، حدثنا حاتم بن إسماعيل، عن محمد بن عجلان، عن محمد بن عمرو بن عطاء، عن سعيد بن المسيب، عن معمر بن عبد الله، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يحتكر إلا خاطئ ‏\"‏ ‏.‏",
      "text_en": " Ma'mar b. Abdullah reported Allah's Messenger (may peace be upon him) as saying:                      No one hoards but the sinner.",
      "chain": [
        "30465",
        "20159",
        "10616",
        "11220",
        "11002"
      ]
    },
    {
      "hadith_no": "4918",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا سعيد بن عمرو الأشعثي، وسويد بن سعيد، وإسحاق بن إبراهيم، وأحمد، بن عبدة - واللفظ لسعيد قال سعيد وإسحاق أخبرنا وقال الآخران، حدثنا سفيان، عن عمرو، عن جابر، قال كنا يوم الحديبية ألفا وأربعمائة فقال لنا النبي صلى الله عليه وسلم ‏\"‏ أنتم اليوم خير أهل الأرض ‏\"‏ ‏.‏ وقال جابر لو كنت أبصر لأريتكم موضع الشجرة.",
      "text_en": " It has been narrated (through a different chain of transmitters) on the authority of Jabir who said:                      We were one thousand and four hundred on the Day of Hudaibiya when the Holy Prophet (may peace be upon him) said to us: Today you are the best people on the earth. And Jabir said: If I had the eyesight, I could show you the place of the tree.",
      "chain": [
        "30465",
        "30547",
        "30123",
        "30423",
        "20005",
        "11081",
        "34"
      ]
    },
    {
      "hadith_no": "5022",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا سعيد بن عمرو الأشعثي، وسويد بن سعيد، - واللفظ لسعيد - أخبرنا  سفيان، عن عمرو، سمع جابرا، يقول قال رجل أين أنا يا، رسول الله إن قتلت قال ‏\"‏ في الجنة ‏\"‏ ‏.‏ فألقى تمرات كن في يده ثم قاتل حتى قتل ‏.‏ وفي حديث سويد قال رجل للنبي صلى الله عليه وسلم يوم أحد ‏.‏",
      "text_en": " It has been reported on the authority of Jabir that a man said:                      Messenger of Allah, where shall I be if I am killed? He replied: In Paradise. The man threw away the dates he had in his hand and fought until he was killed (i. e. he did not wait until he could finish the dates). In the version of the tradition narrated by Suwaid we have the words:\" A man said to the Holy Prophet (may peace be upon him). on the day of Uhud......\"",
      "chain": [
        "30465",
        "30547",
        "20005",
        "11081",
        "34"
      ]
    },
    {
      "hadith_no": "5286",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا سعيد بن عمرو الأشعثي، أخبرنا عبثر، ح وحدثني زهير بن حرب، حدثنا  جرير، ح وحدثني بشر بن خالد، أخبرنا محمد، - يعني ابن جعفر - عن شعبة، كلهم عن  الأعمش، عن إبراهيم التيمي، عن الحارث بن سويد، عن علي، قال نهى رسول الله صلى الله عليه وسلم أن ينتبذ في الدباء والمزفت ‏.‏ هذا حديث جرير ‏.‏ وفي حديث عبثر وشعبة أن النبي صلى الله عليه وسلم نهى عن الدباء والمزفت ‏.‏",
      "text_en": " 'Ali reported that Allah's Messenger (may peace be upon him) forbade to prepare Nabidh in gourd and varnished jar. This hadith has been narrated through another chain of transmitters with a slight variation of wording.",
      "chain": [
        "30465",
        "30022",
        "20028",
        "30126",
        "20173",
        "11060",
        "11322",
        "11330",
        "5"
      ]
    },
    {
      "hadith_no": "5288",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثنا سعيد بن عمرو الأشعثي، أخبرنا عبثر، عن الأعمش، عن إبراهيم، عن  الأسود، عن عائشة، أن النبي صلى الله عليه وسلم نهى عن الدباء والمزفت ‏.‏",
      "text_en": " 'A'isha reported that Allah's Apostle (may peace be upon him) forbade (the preparation) of Nabidh in gourd and varnished jar.",
      "chain": [
        "30465",
        "11060",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "5312",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثنا سعيد بن عمرو الأشعثي، أخبرنا عبثر، عن الشيباني، عن محارب بن، دثار عن ابن عمر، عن النبي صلى الله عليه وسلم ‏.‏ بمثله ‏.‏ قال وأراه قال والنقير ‏.‏",
      "text_en": " Muharib b. Dithar reported a hadith like this on the authority of Ibn 'Umar through a different chain of transmitters. He (the narrator) said:                      I think he also made a mention of hollow stump.",
      "chain": [
        "30465",
        "11352",
        "11389",
        "18"
      ]
    },
    {
      "hadith_no": "5377",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا سعيد بن عمرو الأشعثي، وأبو بكر بن أبي شيبة ومحمد بن عبد الله بن نمير وأبو عامر الأشعري وأبو كريب - واللفظ لأبي عامر - قالوا حدثنا أبو أسامة، عن بريد، عن أبي بردة، عن أبي موسى، قال احترق بيت على أهله بالمدينة من الليل فلما حدث رسول الله صلى الله عليه وسلم بشأنهم قال ‏\"‏ إن هذه النار إنما هي عدو لكم فإذا نمتم فأطفئوها عنكم ‏\"‏ ‏.‏",
      "text_en": " Abu Musa reported that a house was burnt down in Medina during the night over its inhabitants. When their matter was reported to Allah's Messenger (may peace be upon him), he said; This fire is an enemy of yours. So when you go to sleep, extinguish it.",
      "chain": [
        "30465",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "5466",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا سعيد بن عمرو الأشعثي، أخبرنا عبثر، عن مطرف، عن الحكم، عن الحسن، عن عمرو بن حريث، عن سعيد بن زيد بن عمرو بن نفيل، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الكمأة من المن الذي أنزل الله تبارك وتعالى على بني إسرائيل وماؤها شفاء للعين ‏\"‏ ‏.‏",
      "text_en": " Sa'id b. Zaid b. 'Amr b. Nufail reported Allah's Messenger (may peace be upon him) as saying:                      Truffles are a kind of 'Manna' which Allah the Glorious and Exalted, sent down upon the people of Israil, and its juice is a medicine for the eyes.",
      "chain": [
        "30465",
        "11395",
        "11069",
        "11016",
        "5202",
        "11"
      ]
    },
    {
      "hadith_no": "5734",
      "source": " Sahih Muslim ",
      "chapter": "The Book on General Behaviour - كتاب الآداب",
      "chapter_no": "39",
      "text_ar": "حدثنا سعيد بن عمرو الأشعثي، وأحمد بن حنبل، وأبو بكر بن أبي شيبة - واللفظ لأحمد - قال الأشعثي أخبرنا وقال الآخران، حدثنا سفيان بن عيينة، عن أبي الزناد، عن الأعرج، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن أخنع اسم عند الله رجل تسمى ملك الأملاك ‏\"‏ ‏.‏ زاد ابن أبي شيبة في روايته ‏\"‏ لا مالك إلا الله عز وجل ‏\"‏ ‏.‏ قال الأشعثي قال سفيان مثل شاهان شاه ‏.‏ وقال أحمد بن حنبل سألت أبا عمرو عن أخنع فقال أوضع ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      The vilest name in Allah's sight is Malik al-Amidh (King of Kings). The narration transmitted on the authority of Shaiba (contains these words): There is no king but Allah, the Exalted and Glorious. Sufyan said: Similarly, the word Shahinshah (is also the vilest appellation). Ahmad b. Hanbal said: I asked Abu 'Amr about the meaning of Akhna. He said: The vilest.",
      "chain": [
        "30465",
        "30007",
        "20005",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "6121",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثناه سعيد بن عمرو الأشعثي، أخبرنا عبثر، ح وحدثنا أبو بكر بن أبي، شيبة حدثنا ابن فضيل، كلاهما عن حصين، عن أبي وائل، عن حذيفة، عن النبي صلى الله عليه وسلم نحو حديث الأعمش ومغيرة ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Hudhaifa through another chain of transmitters.",
      "chain": [
        "30465",
        "30201",
        "15097",
        "11353",
        "145"
      ]
    },
    {
      "hadith_no": "6338",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا سعيد بن عمرو الأشعثي، وأبو الربيع العتكي، وأبو كريب محمد بن العلاء - واللفظ لأبي كريب - قال أبو الربيع حدثنا وقال الآخران، أخبرنا ابن المبارك، عن  عمر بن سعيد بن أبي حسين، عن ابن أبي مليكة، قال سمعت ابن عباس، يقول وضع عمر بن الخطاب على سريره فتكنفه الناس يدعون ويثنون ويصلون عليه قبل أن يرفع وأنا فيهم - قال - فلم يرعني إلا برجل قد أخذ بمنكبي من ورائي فالتفت إليه فإذا هو علي فترحم على عمر وقال ما خلفت أحدا أحب إلى أن ألقى الله بمثل عمله منك وايم الله إن كنت لأظن أن يجعلك الله مع صاحبيك وذاك أني كنت أكثر أسمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ جئت أنا وأبو بكر وعمر ودخلت أنا وأبو بكر وعمر وخرجت أنا وأبو بكر وعمر ‏\"‏ ‏.‏ فإن كنت لأرجو أو لأظن أن يجعلك الله معهما ‏.‏",
      "text_en": " Ibn Abu Mulaika reported:                      I heard Ibn 'Abbas as saying: Wlien 'Umar b. Khatab was placed in the coffin the people gathered around him. They praised him and supplicated for him before the bier was lifted up, and I was one amongst them. Nothing attracted my attention but a person who gripped my shoulder from behind. I saw towards him and found that he was 'All. He invoked Allah's mercy upon 'Umar and said: You have left none behind you (whose) deeds (are so enviable) that I love to meet Allah with them. By Allah, I hoped that Allah would keep you and your two associates together. I had often heard Allah's Messenger (may peace be upon him) as saying: I came and there came too Abu Bakr and 'Umar; I entered and there entered too Abu Bakr and 'Umar; I went out and there went out too Abu Bakr and 'Umar, and I hope and think that Allah will keep you along with them.",
      "chain": [
        "30465",
        "30137",
        "20025",
        "10652",
        "11090",
        "17"
      ]
    },
    {
      "hadith_no": "6874",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا يعقوب، - يعني ابن عبد الرحمن القاري - وقال قتيبة حدثنا عبد العزيز يعني الدراوردي، ح وحدثناه سعيد بن عمرو الأشعثي، أخبرنا  عبثر، عن العلاء بن المسيب، ح وحدثني هارون بن سعيد الأيلي، حدثنا ابن وهب، حدثني  مالك، - وهو ابن أنس - كلهم عن سهيل، بهذا الإسناد غير أن حديث، العلاء بن المسيب ليس فيه ذكر البغض ‏.‏",
      "text_en": " This hadith has been reported on the authority of Suhail with the same chain of transmitters except with this variation that in the hadith transmitted on the authority of 'Ali' b. Musayyib, there is no mention of (the word)\" Anger\".",
      "chain": [
        "30367",
        "20185",
        "30367",
        "20167",
        "30465",
        "11647",
        "30492",
        "20029"
      ]
    },
    {
      "hadith_no": "7002",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا سعيد بن عمرو الأشعثي، أخبرنا عبثر، عن مطرف، عن عامر، عن شريح، بن هانئ عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أحب لقاء الله أحب الله لقاءه ومن كره لقاء الله كره الله لقاءه ‏\"‏ ‏.‏ قال فأتيت عائشة فقلت يا أم المؤمنين سمعت أبا هريرة يذكر عن رسول الله صلى الله عليه وسلم حديثا إن كان كذلك فقد هلكنا ‏.‏ فقالت إن الهالك من هلك بقول رسول الله صلى الله عليه وسلم وما ذاك قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أحب لقاء الله أحب الله لقاءه ومن كره لقاء الله كره الله لقاءه ‏\"‏ ‏.‏ وليس منا أحد إلا وهو يكره الموت ‏.‏ فقالت قد قاله رسول الله صلى الله عليه وسلم وليس بالذي تذهب إليه ولكن إذا شخص البصر وحشرج الصدر واقشعر الجلد وتشنجت الأصابع فعند ذلك من أحب لقاء الله أحب الله لقاءه ومن كره لقاء الله كره الله لقاءه ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      He who loves meeting Allah, Allah loves to meet him, and he who dislikes to meet Allah, Allah abhors to meet him. I (Shuraih b. Hani, one of the narrators) came to A'isha and said to her: Mother of the faithful, I heard Abu Huraira narrate from Allah's Messenger (may peace be upon him) which, if it is actually so, is a destruction to us. Thereupon she said: Those are in fact ruined who are ruined at the words of Allah's Messenger (may peace be upon him). What are (the words which in your opinion would cause your destruction)? He said that Allah's Messenger (may peace be upon him) had stated: He who loves to meet Allah, Allah too loves to meet him, and he who dislikes to meet Allah, Allah too abhors to meet him, and there is none amongst us who dons not hate death. Thereupon she said: Allah's Messenger (may peace be upon him) has in fact stated this, but it does not mean what you construe, but it implies (the time) when one loses the lustre of the eye, and there is rattling in the throat, shudder in the body and convulsion in fingers (at the time of death). (It is about this time) that it has been said: He who loves to meet Allah, Allah would love to meet him, and he who dislikes to meet Allah, Allah would abhor to meet him",
      "chain": [
        "30465",
        "11395",
        "11052",
        "10774",
        "13"
      ]
    },
    {
      "hadith_no": "7310",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "حدثنا سعيد بن عمرو الأشعثي، وزهير بن حرب، قال زهير حدثنا وقال، سعيد أخبرنا سفيان، عن أبي الزناد، عن الأعرج، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ قال الله عز وجل أعددت لعبادي الصالحين ما لا عين رأت ولا أذن سمعت ولا خطر على قلب بشر ‏\"‏ ‏.‏ مصداق ذلك في كتاب الله ‏{‏ فلا تعلم نفس ما أخفي لهم من قرة أعين جزاء بما كانوا يعملون‏}‏",
      "text_en": " Abu Huraira reported Allah's Apostle (may peace be upon him) as saying that:                      Allah the Exalted and Glorious, said: I have prepared for My pious servants which no eye has ever seen, and no ear has ever heard, and no human heart has ever perceived but it is testified by the Book of Allah. He then recited:\" No soul knows what comfort has been concealed from them, as a reward for what they did\". (xxxii. 17)",
      "chain": [
        "30465",
        "30022",
        "20321",
        "11168",
        "20012",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "7417",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وسعيد بن عمرو الأشعثي، وزهير بن حرب، وابن، أبي عمر قالوا حدثنا سفيان، عن الزهري، بهذا الإسناد ‏.‏ وزادوا في الإسناد عن سفيان، فقالوا عن زينب بنت أبي سلمة، عن حبيبة، عن أم حبيبة، عن زينب بنت جحش، ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Zainab bint Jahsh with a slight variation in the chain of transmitters.",
      "chain": [
        "30201",
        "30465",
        "30022",
        "30421",
        "20005",
        "244",
        "59"
      ]
    },
    {
      "hadith_no": "7670",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "حدثنا سعيد بن عمرو الأشعثي، أخبرنا سفيان، عن الوليد بن حرب، - قال سعيد أظنه قال ابن الحارث بن أبي موسى - قال سمعت سلمة بن كهيل، قال سمعت جندبا، - ولم أسمع أحدا يقول سمعت رسول الله صلى الله عليه وسلم غيره - يقول سمعت رسول الله صلى الله عليه وسلم يقول بمثل حديث الثوري ‏.‏",
      "text_en": " Salama b. Kuhail reported:                      I heard from Jundub but I did not hear him say like this:\" I heard Allah's Messenger (way peace be upon him) as saying this.\"",
      "chain": [
        "30465",
        "20005",
        "11350"
      ]
    },
    {
      "hadith_no": "4096",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا القاسم بن زكريا بن دينار، قال حدثنا سعيد بن عمرو الأشعثي، قال حدثنا عبثر، عن مطرف، عن سوادة بن أبي الجعد، عن أبي جعفر، قال كنت جالسا عند سويد بن مقرن فقال قال رسول الله صلى الله عليه وسلم ‏\"‏ من قتل دون مظلمته فهو شهيد ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Ja'far said:                     \"I was sitting with Suwaid bin Muqarrin, and he said: The Messenger of Allah [SAW] said: \"Whoever is killed defending himself against injustice, he is a martyr.\"",
      "chain": [
        "30475",
        "30465",
        "11395"
      ]
    },
    {
      "hadith_no": "4812",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا القاسم بن زكريا بن دينار، قال حدثنا سعيد بن عمرو الأشعثي، قال حدثنا حماد بن زيد، عن أيوب، عن عكرمة، وعن يحيى بن أبي كثير، عن عكرمة، عن ابن عباس، أن مكاتبا، قتل على عهد رسول الله صلى الله عليه وسلم فأمر أن يودى ما أدى دية الحر وما لا دية المملوك ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that:                     a Mukatab was killed at the time of the Messenger of Allah and he commanded that the Diyah be paid (equivalent) to the Diyah for a free man, (proportionate to the amount he had paid off towards buying his freedom).",
      "chain": [
        "30475",
        "30465",
        "20022",
        "11015",
        "11023",
        "11449",
        "11023",
        "17"
      ]
    }
  ],
  "total_hadiths": 27
}