{
  "id": "30462",
  "name": "Ja'far bin Hmyd جعفر بن حميد",
  "full_name": "Ja'far bin Hmyd جعفر بن حميد",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "240",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  -  ثقة ]"
    ],
    "tags": [
      "al-'Absi",
      "al-Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "25177",
      "name": "'Ubaidullah bin Iyad bin Laqayt عبيد الله بن إياد بن لقيط السدوسي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "27362",
      "name": "al-Walid bin Abi Thwr Sm' الوليد بن أبي ثور",
      "grade": "Succ. (Taba' Tabi')"
    },
    {
      "id": "20618",
      "name": "Yonus bin Abi Y'fwr يونس بن أبي يعفور",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "25067",
      "name": "Hafs bin Sulaiman al-Asadi حفص بن سليمان الأسدي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "students": [
    {
      "id": "11016",
      "name": "al-Hasan al-Basri الحسن البصري",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "7135",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Repentance and Exhortation to Repentance - كتاب التوبة",
      "chapter_no": "51",
      "text_ar": "حدثنا يحيى بن يحيى، وجعفر بن حميد، قال جعفر حدثنا وقال، يحيى أخبرنا  عبيد الله بن إياد بن لقيط، عن إياد، عن البراء بن عازب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ كيف تقولون بفرح رجل انفلتت منه راحلته تجر زمامها بأرض قفر ليس بها طعام ولا شراب وعليها له طعام وشراب فطلبها حتى شق عليه ثم مرت بجذل شجرة فتعلق زمامها فوجدها متعلقة به ‏\"‏ ‏.‏ قلنا شديدا يا رسول الله ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أما والله لله أشد فرحا بتوبة عبده من الرجل براحلته ‏\"‏ ‏.‏ قال جعفر حدثنا عبيد الله بن إياد عن أبيه ‏.‏",
      "text_en": " Al-Bara' b. 'Azib reported Allah's Messenger (may peace be upon him) as saying that Allah's Messenger (may peace be upon him) said:                      What is your opinion about the delight of a person whose camel loaded with the provisions of food and drink is lost and that moves about with its nosestring trailing upon the waterless desert in which there is neither food nor drink, and lie wanders about in search of that until he is completely exhausted and then accidentally it happens to pass by the trunk of a tree and its nosestring gets entangled in that and he finds it entangled therein? He (in response to the question of the Holy Prophet) said: Allah's Messenger, he would feel highly delighted. Thereupon Allah's Messenger (may peace be upon him) said. By Allah, Allah is more delighted at the repentance of His servant than that person (as he finds his lost) camel.",
      "chain": [
        "30399",
        "30462",
        "11407",
        "20031",
        "25177",
        "400"
      ]
    }
  ],
  "total_hadiths": 1
}