{
  "id": "30464",
  "name": "Zakaria bin 'Ady bin Zarayn زكريا بن عدي بن زريق",
  "full_name": "Zakaria bin 'Ady bin Zarayn زكريا بن عدي بن زريق",
  "grade": "3rd Century AH [10th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "212",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa",
      "Baghdad"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  ت  س  ق  -  ثقة ]"
    ],
    "tags": [
      "Ally B.Taym",
      "Client",
      "al-Kufi",
      "Baghdad"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20405",
      "name": "Ibrahim bin Muhammad bin al-Harith إبراهيم بن محمد أبو اسحاق الفزاري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20445",
      "name": "'Ubaidullah bin 'Amr bin Abi Walid عبيد الله بن عمرو بن أبي الوليد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20022",
      "name": "Hammad bin Zayd حماد بن زيد بن درهم الأزدي الأزرق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20468",
      "name": "Hashaym bin Bashayr bin al-Qasim هشيم بن بشير بن القاسم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20304",
      "name": "Yazid bin Zari' يزيد بن زريع",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20317",
      "name": "Hafs bin Ghyath حفص بن غياث",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20587",
      "name": "Sharayk bin 'Abdullah شريك بن عبد الله النخعي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20150",
      "name": "Ibrahim bin Sa'd bin Ibrahim إبراهيم بن سعد بن إبراهيم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "students": [
    {
      "id": "30021",
      "name": "Ishaq bin Rahwaya إسحاق بن راهويه",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30025",
      "name": "'Abdullah bin 'Abdur Rahman al-Daarimi عبد الله بن عبد الرحمن الدارمي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38834",
      "name": "Hajjaj bin Yusuf bin al-Sha'ir حجاج بن يوسف الشاعر",
      "grade": "3rd Century AH"
    },
    {
      "id": "30375",
      "name": "Muhammad bin Rafa'i محمد بن رافع",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30475",
      "name": "al-Qasim bin Zakaria bin Dinar القاسم بن زكريا بن دينار القرشي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30216",
      "name": "Abu Karayb, Muhammad bin al-'Ala' محمد بن العلاء - أبو كريب",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "31513",
      "name": "al-Harith bin Muhammad bin Abi Usama الحارث بن محمد بن أبي أسامة",
      "grade": "3rd Century AH"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "2744",
      "source": " Sahih Bukhari ",
      "chapter": "Wills and Testaments (Wasaayaa) - كتاب الوصايا",
      "chapter_no": "55",
      "text_ar": "حدثنا محمد بن عبد الرحيم، حدثنا زكرياء بن عدي، حدثنا مروان، عن هاشم بن هاشم، عن عامر بن سعد، عن أبيه  رضى الله عنه  قال مرضت فعادني النبي صلى الله عليه وسلم فقلت يا رسول الله ادع الله أن لا يردني على عقبي‏.‏ قال ‏\"‏ لعل الله يرفعك وينفع بك ناسا ‏\"‏‏.‏ قلت أريد أن أوصي، وإنما لي ابنة  قلت  أوصي بالنصف قال ‏\"‏ النصف كثير ‏\"‏‏.‏ قلت فالثلث‏.‏ قال ‏\"‏ الثلث، والثلث كثير أو كبير ‏\"‏‏.‏ قال فأوصى الناس بالثلث، وجاز ذلك لهم‏.‏",
      "text_en": " Narrated Sa`d:                     I fell sick and the Prophet paid me a visit. I said to him, \"O Allah's Apostle! I invoke Allah that He may not let me expire in the land whence I migrated (i.e. Mecca).\" He said, \"May Allah give you health and let the people benefit by you.\" I said, \"I want to will my property, and I have only one daughter and I want to will half of my property (to be given in charity).\" He said,\" Half is too much.\" I said, \"Then I will one third.\" He said, \"One-third, yet even one-third is too much.\" (The narrator added, \"So the people started to will one third of their property and that was Permitted for them.\")",
      "chain": [
        "30272",
        "30464",
        "20201",
        "11227",
        "10554",
        "9"
      ]
    },
    {
      "hadith_no": "4092",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا محمد بن عبد الرحيم، أخبرنا زكرياء بن عدي، أخبرنا ابن المبارك، عن حيوة، عن يزيد بن أبي حبيب، عن أبي الخير، عن عقبة بن عامر، قال صلى رسول الله صلى الله عليه وسلم على قتلى أحد بعد ثماني سنين، كالمودع للأحياء والأموات، ثم طلع المنبر فقال ‏\"‏ إني بين أيديكم فرط، وأنا عليكم شهيد، وإن موعدكم الحوض، وإني لأنظر إليه من مقامي هذا، وإني لست أخشى عليكم أن تشركوا، ولكني أخشى عليكم الدنيا أن تنافسوها ‏\"‏‏.‏ قال فكانت آخر نظرة نظرتها إلى رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated `Uqba bin Amir:                     Allah's Apostle offered the funeral prayers of the martyrs of Uhud eight years after (their death), as if bidding farewell to the living and the dead, then he ascended the pulpit and said, \"I am your predecessor before you, and I am a witness on you, and your promised place to meet me will be Al- Haud (i.e. the Tank) (on the Day of Resurrection), and I am (now) looking at it from this place of mine. I am not afraid that you will worship others besides Allah, but I am afraid that worldly life will tempt you and cause you to compete with each other for it.\" That was the last look which I cast on Allah's Apostle.",
      "chain": [
        "30272",
        "30464",
        "20025",
        "26010",
        "11411",
        "11410",
        "189"
      ]
    },
    {
      "hadith_no": "89",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن الدارمي، أخبرنا زكرياء بن عدي، قال قال لي أبو إسحاق الفزاري اكتب عن بقية، ما روى عن المعروفين، ولا تكتب عنه ما روى عن غير المعروفين، ولا تكتب عن إسماعيل بن عياش، ما روى عن المعروفين، ولا عن غيرهم، ‏.‏",
      "text_en": "",
      "chain": [
        "30025",
        "30464",
        "20405",
        "20736"
      ]
    },
    {
      "hadith_no": "276",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثنا إسحاق، أخبرنا زكرياء بن عدي، عن عبيد الله بن عمرو، عن زيد بن أبي أنيسة، عن الحكم، بهذا الإسناد مثله ‏.‏",
      "text_en": " This hadith is narrated by Ubaidullah b. 'Amr and Zaid b. Abu Unaisa with the same chain of transmitters.",
      "chain": [
        "30312",
        "30464",
        "30024",
        "11340"
      ]
    },
    {
      "hadith_no": "330",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثنيه أحمد الدارمي، حدثنا زكرياء بن عدي، حدثنا يزيد، - يعني ابن زريع - عن روح بن القاسم، حدثنا أيوب بن موسى، بهذا الإسناد وقال أفأحله فأغسله من الجنابة ‏.‏ ولم يذكر الحيضة ‏.‏",
      "text_en": " This hadith is narrated by the same chain of transmitters by Ahmad al. Darimi, Zakariya b. 'Adi, Yazid, i. e. ' Ibn Zurai', Rauh b. al-Qasim, Ayyub b. Musa with the same chain of transmitters, and there is a mention of these words:                     \" Should I undo the plait and wash it, because of sexual intercourse?\" and there is no mention of menstruation.",
      "chain": [
        "30464",
        "20304",
        "11586",
        "11241"
      ]
    },
    {
      "hadith_no": "1216",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وإسحاق بن إبراهيم، - واللفظ لأبي بكر - قال إسحاق أخبرنا وقال أبو بكر، حدثنا زكرياء بن عدي، عن عبيد الله بن عمرو، عن زيد بن أبي أنيسة، عن عمرو بن مرة، عن عبد الله بن الحارث النجراني، قال حدثني جندب، قال سمعت النبي صلى الله عليه وسلم قبل أن يموت بخمس وهو يقول ‏\"‏ إني أبرأ إلى الله أن يكون لي منكم خليل فإن الله تعالى قد اتخذني خليلا كما اتخذ إبراهيم خليلا ولو كنت متخذا من أمتي خليلا لاتخذت أبا بكر خليلا ألا وإن من كان قبلكم كانوا يتخذون قبور أنبيائهم وصالحيهم مساجد ألا فلا تتخذوا القبور مساجد إني أنهاكم عن ذلك ‏\"‏ ‏.‏",
      "text_en": " Jundub reported:                      I heard from the Apostle of Allah (may peace be upon him) five days before his death and he said: I stand acquitted before Allah that I took any one of you as friend, for Allah has taken me as His friend, as he took Ibrahim as His friend. Had I taken any one of my Ummah as a friend, I would have taken Abu Bakr as a friend. Beware of those who preceded you and used to take the graves of their prophets and righteous men as places of worship, but you must not take graves as mosques; I forbid you to do that.",
      "chain": [
        "30201",
        "30123",
        "30312",
        "20436",
        "30464",
        "30024",
        "11340",
        "11381",
        "10780",
        "4053"
      ]
    },
    {
      "hadith_no": "1553",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثني إسحاق بن منصور، أخبرنا زكرياء بن عدي، أخبرنا عبيد الله، - يعني ابن عمرو - عن زيد بن أبي أنيسة، عن عدي بن ثابت، عن أبي حازم الأشجعي، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من تطهر في بيته ثم مشى إلى بيت من بيوت الله ليقضي فريضة من فرائض الله كانت خطوتاه إحداهما تحط خطيئة والأخرى ترفع درجة ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      The Messenger of Allah (may peace be' upon him) said: He who purified himself in his house, and then he walked to one of the houses of Allah for the sake of performing a Fard (obligatory act) out of the Fara'id (obligatory acts) of Allah, both his steps (would be significant) as one of them would obliterate his sin and the second one would raise his status.",
      "chain": [
        "30313",
        "30464",
        "30024",
        "11340",
        "11372",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "2405",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثني محمد بن أحمد بن أبي خلف، حدثنا زكرياء بن عدي، أخبرنا عبيد الله، بن عمرو عن زيد، عن عدي بن ثابت، عن أبي حازم، عن أبي هريرة، عن النبي صلى الله عليه وسلم أنه نهى فذكر خصالا وقال ‏\"‏ من منح منيحة غدت بصدقة وراحت بصدقة صبوحها وغبوقها ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported that the Apostle of Allah (may peace be upon him) forbade (to do certain things) and then he made a mention of certain habits and said:                      He who gives a she-camel as a gift, for him is the reward (of the gift) both morn- ing and evening-a reward for drinking milk in the morning and a reward for drinking milk in the evening.",
      "chain": [
        "30560",
        "30464",
        "30024",
        "15",
        "11372",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "2752",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا إسحاق بن منصور، وابن أبي خلف، وعبد بن حميد، جميعا عن زكرياء، بن عدي - قال عبد حدثني زكرياء بن عدي، - أخبرنا عبيد الله بن عمرو، عن زيد، بن أبي أنيسة حدثنا الحكم بن عتيبة، عن سعيد بن جبير، عن ابن عباس، - رضى الله عنهما - قال جاءت امرأة إلى رسول الله صلى الله عليه وسلم فقالت يا رسول الله إن أمي ماتت وعليها صوم نذر أفأصوم عنها قال ‏\"‏ أرأيت لو كان على أمك دين فقضيتيه أكان يؤدي ذلك عنها ‏\"‏ ‏.‏ قالت نعم ‏.‏ قال ‏\"‏ فصومي عن أمك ‏\"‏ ‏.‏",
      "text_en": " Ibn Abbas (Allah be pleased with them) reported:                      A woman came to the Messenger of Allah (may peace be upon him) and said: Messenger of Allah, my mother has died and there is due from her a fast of vow; should I fast on her behalf? Thereupon he said: You see that if your mother had died in debt, would it not have been paid on her behalf? She said: Yes. He (the Holy Prophet) said: Then observe fast on behalf of your mother.",
      "chain": [
        "30313",
        "30553",
        "30464",
        "30464",
        "30024",
        "11340",
        "11069",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "3992",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "حدثنا إسحاق بن إبراهيم، ومحمد بن أحمد بن أبي خلف، كلاهما عن زكرياء، قال ابن أبي خلف حدثنا زكرياء بن عدي، أخبرنا عبيد الله، عن زيد بن أبي أنيسة، حدثنا  أبو الوليد المكي، وهو جالس عند عطاء بن أبي رباح عن جابر بن عبد الله، أن رسول الله صلى الله عليه وسلم نهى عن المحاقلة والمزابنة والمخابرة وأن تشترى النخل حتى تشقه - والإشقاه أن يحمر أو يصفر أو يؤكل منه شىء - والمحاقلة أن يباع الحقل بكيل من الطعام معلوم والمزابنة أن يباع النخل بأوساق من التمر والمخابرة الثلث والربع وأشباه ذلك ‏.‏ قال زيد قلت لعطاء بن أبي رباح أسمعت جابر بن عبد الله يذكر هذا عن رسول الله صلى الله عليه وسلم قال نعم ‏.‏",
      "text_en": " Jabir b. Abdullah (Allah be pleased with them) reported Allah's Messenger (may peace be upon him) forbidding Muhaqala, and Muzabana, and Mukhabara, and the buying of date-palm until its fruit is ripened (ripening means that its colour becomes red or yellow, or it is fit for being eaten). And Muhaqala implies that crops in the field are bought for grains according to a customary measure. Muzabana implies that date-palm should be sold for dry dates by measuring them with wisqs, and al-Mukhabara is (a share), maybe one-third or one-fourth (in produce) or something like it. Zaid (one of the narrators) said to Ata' b. Abu Rabah (the other narrator):                      Did You bear Jabir b. Abdullah (Allah be pleased with them) making a mention of it that he had heard it directly from Allah's Messenger (may peace be upon him)? He said: Yes.",
      "chain": [
        "30123",
        "11338",
        "30464",
        "11201",
        "11340",
        "20296",
        "34"
      ]
    },
    {
      "hadith_no": "4023",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "وحدثني ابن أبي خلف، وحجاج بن الشاعر، قالا حدثنا زكرياء بن عدي، أخبرنا عبيد الله بن عمرو، عن زيد، عن الحكم، عن نافع، عن ابن عمر، أنه أتى رافعا فذكر هذا الحديث عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Nafi, reported from Ibn Umar (Allah be pleated with them) that he came to Rafi and he narrated this hadith from Allah's Apostle (may peace be upon him).",
      "chain": [
        "38834",
        "30464",
        "30024",
        "15",
        "11069",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "4624",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "وحدثنا محمد بن عباد، حدثنا سفيان، عن عمرو، ح وحدثنا إسحاق بن إبراهيم، وابن أبي خلف عن زكرياء بن عدي، أخبرنا عبيد الله، عن زيد بن أبي أنيسة، كلاهما عن سعيد بن أبي بردة، عن أبيه، عن جده، عن النبي صلى الله عليه وسلم ‏.‏ نحو حديث شعبة وليس في حديث زيد بن أبي أنيسة ‏\"‏ وتطاوعا ولا تختلفا ‏\"‏ ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Buraida but for the last two words.",
      "chain": [
        "30377",
        "20005",
        "11081",
        "30123",
        "30464",
        "11201",
        "11345",
        "11901"
      ]
    },
    {
      "hadith_no": "4684",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "وحدثني ابن أبي خلف، حدثنا زكرياء بن عدي، أخبرنا ابن المبارك، عن يونس، عن الزهري، عن الأعرج، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا نورث ما تركنا صدقة ‏\"‏ ‏.‏",
      "text_en": " It his been narrated on the authority of Abu Huraira that the Messenger of Allah (may peace be upon him) said:                     \" We do not have any heirs; what we leave behind is a charitable endowment.\"",
      "chain": [
        "30464",
        "20025",
        "20475",
        "11013",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "5218",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "حدثنا إسحاق بن إبراهيم، أخبرنا زكرياء بن عدي، عن عبيد الله بن عمرو، عن زيد بن أبي أنيسة، عن عطاء بن أبي رباح، عن جابر بن عبد الله، قال كنا لا نمسك لحوم الأضاحي فوق ثلاث فأمرنا رسول الله صلى الله عليه وسلم أن نتزود منها ونأكل منها ‏.‏ يعني فوق ثلاث ‏.‏",
      "text_en": " Jabir b. 'Abdullah reported:                      We did not eat the flesh of sacrificed animals beyond three (days), but then Allah's Messenger (may peace be upon him) commanded us to make it a provision for journey and cat it (beyond three days).",
      "chain": [
        "30123",
        "30464",
        "30024",
        "11340",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "5334",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثنا إسحاق بن إبراهيم، ومحمد بن أحمد بن أبي خلف، - واللفظ لابن أبي خلف - قالا حدثنا زكرياء بن عدي، حدثنا عبيد الله، - وهو ابن عمرو - عن زيد بن، أبي أنيسة عن سعيد بن أبي بردة، حدثنا أبو بردة، عن أبيه، قال بعثني رسول الله صلى الله عليه وسلم ومعاذا إلى اليمن فقال ‏\"‏ ادعوا الناس وبشرا ولا تنفرا ويسرا ولا تعسرا ‏\"‏ ‏.‏ قال فقلت يا رسول الله أفتنا في شرابين كنا نصنعهما باليمن البتع وهو من العسل ينبذ حتى يشتد والمزر وهو من الذرة والشعير ينبذ حتى يشتد قال وكان رسول الله صلى الله عليه وسلم قد أعطي جوامع الكلم بخواتمه فقال ‏\"‏ أنهى عن كل مسكر أسكر عن الصلاة ‏\"‏ ‏.‏",
      "text_en": " Abu Burda reported on the authority of his father:                      Allah's Messenger (may peace be upon him) sent me and Mu'adh to Yemen saying: Call people (to the path of righteousness) and give good tidings to the (people), and do not repel them, make things easy for them and do not make things difficult. I (Burda) said: Allah's Messenger, give us a religious verdict about two kinds of drinks which we prepare in Yemen. One is Bit' which is prepared from honey; it is a fermented Nabidh and is strong and turns into wine, and (the second is) Mizr which is prepared from millet and barley. Thereupon, Allah's Messenger (may peace be upon him), who had been gifted with the most eloquent and pithy expressions, said: I forbid you from every intoxicant that keeps you away from prayer.",
      "chain": [
        "30123",
        "30464",
        "30024",
        "11340",
        "11345",
        "1820"
      ]
    },
    {
      "hadith_no": "5348",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثني محمد بن أحمد بن أبي خلف، حدثنا زكرياء بن عدي، حدثنا عبيد الله، عن زيد، عن يحيى أبي عمر النخعي، قال سأل قوم ابن عباس عن بيع الخمر، وشرائها، والتجارة فيها فقال أمسلمون أنتم قالوا نعم ‏.‏ قال فإنه لا يصلح بيعها ولا شراؤها ولا التجارة فيها ‏.‏ قال فسألوه عن النبيذ فقال خرج رسول الله صلى الله عليه وسلم في سفر ثم رجع وقد نبذ ناس من أصحابه في حناتم ونقير ودباء فأمر به فأهريق ثم أمر بسقاء فجعل فيه زبيب وماء فجعل من الليل فأصبح فشرب منه يومه ذلك وليلته المستقبلة ومن الغد حتى أمسى فشرب وسقى فلما أصبح أمر بما بقي منه فأهريق ‏.‏",
      "text_en": " Yahya Abu 'Umar al-Nakhai reported that some people asked Ibn Abbas about the sale and purchase of wine and its commerce. He asked (them):                      Are you Muslims? They said, Yes. Thereupon he said: Its sale and purchase and its trade are not permissible. They then asked him about Nabidh and he said: Allah's Messenger (may peace be upon him) went out on a journey and then came back and some persons amongst his Companions prepared Nabidh for him in green pitcher, hollow stump and gourd. He commanded it to be thrown away, and it was done accordingly. He then ordered them (to prepare it.) in a waterskin and it was prepared in that by steeping raisins in water, and it was prepared in the night. In the morning he drank out of that and on that day and then the next night, and then on the next day until the evening. He drank and gave others to drink. When it was morning (of the third night) he commanded what was left of that to be thrown away.",
      "chain": [
        "30560",
        "30464",
        "11201",
        "15"
      ]
    },
    {
      "hadith_no": "6511",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمد بن أحمد بن أبي خلف، حدثنا زكرياء بن عدي، أخبرنا عبيد الله، بن عمرو عن عبد الكريم، عن محمد بن المنكدر، عن جابر، قال جيء بأبي يوم أحد مجدعا فوضع بين يدى النبي صلى الله عليه وسلم ‏.‏ فذكر نحو حديثهم ‏.‏",
      "text_en": " Jabir reported:                      My father was brought in a state that his ears had been cut off and (his dead body) was placed before Allah's Apostle (may peace be upon him), the rest of the hadith is the same.",
      "chain": [
        "30560",
        "30464",
        "30024",
        "18655",
        "11048",
        "34"
      ]
    },
    {
      "hadith_no": "2236",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Inheritance - كتاب الفرائض عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "29",
      "text_ar": "حدثنا عبد بن حميد، حدثني زكرياء بن عدي، أخبرنا عبيد الله بن عمرو، عن عبد الله بن محمد بن عقيل، عن جابر بن عبد الله، قال جاءت امرأة سعد بن الربيع بابنتيها من سعد إلى رسول الله صلى الله عليه وسلم فقالت يا رسول الله هاتان ابنتا سعد بن الربيع قتل أبوهما معك يوم أحد شهيدا وإن عمهما أخذ مالهما فلم يدع لهما مالا ولا تنكحان إلا ولهما مال ‏.‏ قال ‏\"‏ يقضي الله في ذلك ‏\"‏ ‏.‏ فنزلت آية الميراث فبعث رسول الله صلى الله عليه وسلم إلى عمهما فقال ‏\"‏ أعط ابنتى سعد الثلثين وأعط أمهما الثمن وما بقي فهو لك ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح لا نعرفه إلا من حديث عبد الله بن محمد بن عقيل وقد رواه شريك أيضا عن عبد الله بن محمد بن عقيل ‏.‏",
      "text_en": " Jabir bin 'Abdullah said:                     \"The wife of Sa'd bin Ar-Rabi came with her two daughters from Sa'd to he Messenger of Allah(S.A.W)and said; O Messenger of Allah(S.A.W)! these two are daughters of Sa'd bin Ar-Rabi who fought along with you on the day of Uhud and was martyred. Their uncle took their wealth, without leaving any wealth for them, and they will not be married unless they have wealth.' He said: 'Allah will decide on that matter.' The ayah about inheritance was revealed, so the Messenger of Allah(S.A.W) sent  (word) to their Uncle saying: Give the two daughters of Sa'd two thirds, and give their mother one eighth, and whatever remains,; then it is for you.''",
      "chain": [
        "30553",
        "30464",
        "30024",
        "12246",
        "34"
      ]
    },
    {
      "hadith_no": "3487",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، حدثنا زكريا بن عدي، حدثنا عبيد الله بن عمرو الرقي، عن عبد الملك بن عمير، عن موسى بن طلحة، عن أبي هريرة، قال لما نزلت  ‏:‏ ‏(‏ وأنذر عشيرتك الأقربين ‏)‏ جمع رسول الله صلى الله عليه وسلم قريشا فخص وعم فقال ‏\"‏ يا معشر قريش أنقذوا أنفسكم من النار فإني لا أملك لكم من الله ضرا ولا نفعا يا معشر بني عبد مناف أنقذوا أنفسكم من النار فإني لا أملك لكم من الله ضرا ولا نفعا يا معشر بني قصى أنقذوا أنفسكم من النار فإني لا أملك لكم ضرا ولا نفعا يا معشر بني عبد المطلب أنقذوا أنفسكم من النار فإني لا أملك لكم ضرا ولا نفعا يا فاطمة بنت محمد أنقذي نفسك من النار فإني لا أملك لك ضرا ولا نفعا إن لك رحما سأبلها ببلالها ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه يعرف من حديث موسى بن طلحة ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     \"When (the following) was revealed: 'And warn your tribe of near kindred (26:214)' the Messenger of Allah (ﷺ) gathered the (families) of the Quraish (calling them) one and all, he said: 'O people of the Quraish! Ransom yourselves from the Fire! I have no power to prevent harm or bring benefit to you before Allah! O people of Banu 'Abd Manaf! Ransom yourselves from the Fire! I have no power to prevent harm or bring benefit to you before Allah! O people of Banu Qusayy! Ransom yourselves from the Fire! I have no power to prevent harm or bring benefit to you! O people of Banu 'Abdul-Muttalib! Ransom yourselves from the Fire! I have no power to prevent harm or bring benefit to you! O Fatimah bint Muhammad! Ransom yourself from the Fire! I have no power to prevent harm or bring benefit to you before Allah! All you have is the womb, and the kind relations that shall come of it.\"",
      "chain": [
        "30553",
        "30464",
        "20445",
        "11368",
        "579",
        "13"
      ]
    },
    {
      "hadith_no": "3567",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن، أخبرنا زكريا بن عدي، حدثنا عبيد الله، هو ابن عمرو الرقي عن عبد الملك بن عمير، عن مصعب بن سعد، وعمرو بن ميمون، قال كان سعد يعلم بنيه هؤلاء الكلمات كما يعلم المكتب الغلمان ويقول إن رسول الله صلى الله عليه وسلم كان يتعوذ بهن دبر الصلاة ‏\"‏ اللهم إني أعوذ بك من الجبن وأعوذ بك من البخل وأعوذ بك من أرذل العمر وأعوذ بك من فتنة الدنيا وعذاب القبر ‏\"‏ ‏.‏ قال عبد الله بن عبد الرحمن أبو إسحاق الهمداني مضطرب في هذا الحديث يقول عن عمرو بن ميمون عن عمر ويقول عن غيره ويضطرب فيه قال أبو عيسى هذا حديث حسن صحيح من هذا الوجه ‏.‏",
      "text_en": " Mus’ab bin Sa’d and Amr bin Maimun narrated:                     “Sa’d used to teach his children these words just as the Muktib teaches children, he would say: ‘Indeed, the Messenger of Allah used to seek refuge by saying them at the end of (every) Salat: O Allah I seek refuge in You from miserliness, I seek refuge in You from feeble old age, and I seek refuge in You from the trial of the world, and the punishment of the grave (Allahumma Inni A’udhu Bika Minal-Jubn, Wa A’udhu Bika Minal-Bukhl, Wa A’udhu Bika Min Ardhalil-Umur, Wa A’udhu Bika Min Fitnatid-Dunya Wa Adhabil Qabr).’”",
      "chain": [
        "30025",
        "30464",
        "20445",
        "11368",
        "10556",
        "11382"
      ]
    },
    {
      "hadith_no": "556",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا محمد بن رافع، قال حدثنا زكريا بن عدي، قال أنبأنا ابن المبارك، عن يونس بن يزيد، عن الزهري، عن عروة، عن عائشة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من أدرك ركعة من الفجر قبل أن تطلع الشمس فقد أدركها ومن أدرك ركعة من العصر قبل أن تغرب الشمس فقد أدركها ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Aishah that the Prophet (ﷺ) said:                      \"Whoever catches up with a Rak'ah of Fajr before the sun rises, then he has caught up with it; and whoever catches up with a Rak'ah of 'Asr before the sun sets, then he has caught up with it.\"",
      "chain": [
        "30375",
        "30464",
        "20025",
        "20475",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "3173",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرني أحمد بن عثمان بن حكيم، قال حدثنا زكريا بن عدي، قال حدثنا عبيد الله بن عمرو، عن زيد بن أبي أنيسة، عن سيار، ح قال وأنبأنا هشيم، عن سيار، عن جبر بن عبيدة، - وقال عبيد الله عن جبير، - عن أبي هريرة، قال وعدنا رسول الله صلى الله عليه وسلم غزوة الهند فإن أدركتها أنفق فيها نفسي ومالي فإن أقتل كنت من أفضل الشهداء وإن أرجع فأنا أبو هريرة المحرر ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                      \"The Messenger of Allah (ﷺ) promised us that we would invade India. If I live to see that, I will sacrifice myself and my wealth. If I am killed, I will be one of the best of the martyrs, and if I come back, I will be Abu Hurairah Al-Muharrar.\" [1][1] Al-Muharrar: The one freed (from the Fire).",
      "chain": [
        "30185",
        "30464",
        "30024",
        "11340",
        "11429",
        "20468",
        "11429",
        "18115",
        "11201",
        "13"
      ]
    },
    {
      "hadith_no": "3873",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرني محمد بن عبد الله بن المبارك، قال حدثنا زكريا بن عدي، قال حدثنا حماد بن زيد، عن عمرو بن دينار، قال كان طاوس يكره أن يؤاجر أرضه بالذهب والفضة ولا يرى بالثلث والربع بأسا فقال له مجاهد اذهب إلى ابن رافع بن خديج فاسمع منه حديثه‏.‏‏ فقال إني والله لو أعلم أن رسول الله صلى الله عليه وسلم نهى عنه ما فعلته ولكن حدثني من هو أعلم منه‏.‏‏ ابن عباس أن رسول الله صلى الله عليه وسلم إنما قال ‏‏\"‏‏ لأن يمنح أحدكم أخاه أرضه خير من أن يأخذ عليها خراجا معلوما ‏‏\"‏‏‏.‏‏ وقد اختلف على عطاء في هذا الحديث فقال عبد الملك بن ميسرة عن عطاء عن رافع وقد تقدم ذكرنا له‏.‏‏ وقال عبد الملك بن أبي سليمان عن عطاء عن جابر‏.‏‏",
      "text_en": " It was narrated that 'Amr bin Dinar said:                      \"Tawus regarded it disliked renting out land for gold and silver, but he did not see anything wrong with leasing it in return for one-third or one-quarter (of the yield). Mujahid said to him: 'Go to Ibn Rafi' bin Khadij and listen to his Hadith.' He said: 'By Allah, if I knew that the Messenger of Allah had forbidden that I would not have done it. But my Hadith comes from one who is more knowledgeable than him. Ibn 'Abbas (said) that the Messenger of Allah said: \"If one of you were to give his land to his brother (to cultivate it), that would be better than taking an agreed portion of the yield.\"'\"",
      "chain": [
        "30464",
        "20022",
        "11081"
      ]
    },
    {
      "hadith_no": "4",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا زكريا بن عدي، عن ابن المبارك، عن محمد بن سوقة، عن أبي جعفر، قال كان ابن عمر إذا سمع من، رسول الله  صلى الله عليه وسلم  حديثا لم يعده ولم يقصر دونه ‏.‏",
      "text_en": " Abu Ja'far said:                     \"Whenever Ibn 'Umar heard a Hadith from the Messanger of Allah (ﷺ), he would not do more than it said, and he would not do less.\"",
      "chain": [
        "30212",
        "30464",
        "20025",
        "11387"
      ]
    },
    {
      "hadith_no": "1471",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا إسماعيل بن أسد، حدثنا زكريا بن عدي، أنبأنا عبيد الله بن عمرو، عن عبد الكريم، عن عطاء، عن جابر، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ صلاة في مسجدي أفضل من ألف صلاة فيما سواه إلا المسجد الحرام وصلاة في المسجد الحرام أفضل من مائة ألف صلاة فيما سواه ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Jabir that the Messenger of Allah (ﷺ) said:                     “Oneprayer in my mosque is better than one thousand prayerselsewhere,except the Sacred Mosque, and one prayer in the SacredMosque isbetter than one hundred thousand prayers elsewhere.”",
      "chain": [
        "30464",
        "30024",
        "18655",
        "11029",
        "34"
      ]
    }
  ],
  "total_hadiths": 25
}