{
  "id": "30461",
  "name": "Ahmed bin Jwas أحمد بن جواس",
  "full_name": "Ahmed bin Jwas أحمد بن جواس",
  "grade": "3rd Century AH [10th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "238",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  د  -  ثقة ]"
    ],
    "tags": [
      "al-Hanfi",
      "al-Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20327",
      "name": "Abu al-Ahwus, Salam bin Sulaym al-Hanafi أبو الأحوص سلام بن سليم الحنفي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20102",
      "name": "'Abdullah bin Idris bin Yazid al-Audi عبد الله بن إدريس بن يزيد الأودي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20354",
      "name": "Muhammad bin Khazim al-Darir محمد بن خازم أبو معاوية الضرير",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20373",
      "name": "Abu Bakr bin 'Ayyash al-Asadi أبو بكر بن عياش بن سالم الأسدي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]"
    },
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "30554",
      "name": "Abu Zara' al-Razi أبو زرعة الرازي",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "290",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثنا أحمد بن جواس الحنفي أبو عاصم، حدثنا أبو الأحوص، عن شبيب بن غرقدة، عن عبد الله بن شهاب الخولاني، قال كنت نازلا على عائشة فاحتلمت في ثوبى فغمستهما في الماء فرأتني جارية لعائشة فأخبرتها فبعثت إلى عائشة فقالت ما حملك على ما صنعت بثوبيك قال قلت رأيت ما يرى النائم في منامه ‏.‏ قالت هل رأيت فيهما شيئا ‏.‏ قلت لا ‏.‏ قالت فلو رأيت شيئا غسلته لقد رأيتني وإني لأحكه من ثوب رسول الله صلى الله عليه وسلم يابسا بظفري ‏.‏",
      "text_en": " Abdullah b. Shihab al-Khaulani reported:                      I stayed in the house of 'A'isha and had a wet dream (and perceived its effect on my garment), so (in the morning) I dipped both (the clothes) in water. This (act of mine) was watched by a maid-servant of A'isha and she informed her. She (Hadrat A'isha) sent me a message: Whatprompted you to act like this with your clothes? He (the narrator) said: I told that I saw in a dream what a sleeper sees. She said: Did you find (any mark of the fluid) on your clothes? I said: No. She said: Had you found anything you should have washed it. Incase I found that (semen) on the garment of the Messenger of Allah (may peace be upon him) dried up, I scraped it off with my nails.",
      "chain": [
        "30461",
        "20327",
        "11430",
        "10784"
      ]
    },
    {
      "hadith_no": "1689",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا أحمد بن جواس الحنفي أبو عاصم، حدثنا عبيد الله الأشجعي، عن سفيان، عن محارب بن دثار، عن جابر بن عبد الله، قال كان لي على النبي صلى الله عليه وسلم دين فقضاني وزادني ودخلت عليه المسجد فقال لي ‏\"‏ صل ركعتين ‏\"‏ ‏.‏",
      "text_en": " Jabir b. 'Abdullah reported:                      The Apostle of Allah (may peace be upon him) owed me a debt; he paid me back and made an addition (of this). I entered the mosque and he (the Holy Prophet) said to me: Observe two rak'ahs of prayer.",
      "chain": [
        "30461",
        "20338",
        "20012",
        "11389",
        "34"
      ]
    },
    {
      "hadith_no": "1913",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا حسن بن الربيع، وأحمد بن جواس الحنفي، قالا حدثنا أبو الأحوص، عن عمار بن رزيق، عن عبد الله بن عيسى، عن سعيد بن جبير، عن ابن عباس، قال بينما جبريل قاعد عند النبي صلى الله عليه وسلم سمع نقيضا من فوقه فرفع رأسه فقال هذا باب من السماء فتح اليوم لم يفتح قط إلا اليوم فنزل منه ملك فقال هذا ملك نزل إلى الأرض لم ينزل قط إلا اليوم فسلم وقال أبشر بنورين أوتيتهما لم يؤتهما نبي قبلك فاتحة الكتاب وخواتيم سورة البقرة لن تقرأ بحرف منهما إلا أعطيته ‏.‏",
      "text_en": " 'Abd al-Rahman b. Yazid reported:                      I met Abu Mas'ud near the House (Ka'ba) and said to him: A hadith has been conveyed to me on your authority about the two (concluding verses of Surah al-Baqara. He said: Yes. The Messenger of Allah (may peace be upon him) (in fact) said: Anyone who recites the two verses at the end of Surah al-Baqara at night, they would suffice for him.",
      "chain": [
        "30461",
        "20327",
        "20595",
        "11361",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "1425",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا قتيبة بن سعيد، وأحمد بن جواس الحنفي، قالا حدثنا أبو الأحوص، عن أبي إسحاق، عن بريد بن أبي مريم، عن أبي الحوراء، قال قال الحسن بن علي رضى الله عنهما علمني رسول الله صلى الله عليه وسلم كلمات أقولهن في الوتر قال ابن جواس في قنوت الوتر ‏\"‏ اللهم اهدني فيمن هديت وعافني فيمن عافيت وتولني فيمن توليت وبارك لي فيما أعطيت وقني شر ما قضيت إنك تقضي ولا يقضى عليك وإنه لا يذل من واليت ولا يعز من عاديت تباركت ربنا وتعاليت ‏\"‏ ‏.‏",
      "text_en": " Narrated Al-Hasan ibn Ali:                     The Messenger of Allah (ﷺ) taught me some words that I say during the witr. (The version of Ibn Jawwas has: I say them in the supplication of the witr.) They were: \"O Allah, guide me among those Thou hast guided, grant me security among those Thou hast granted security, take me into Thy charge among those Thou hast taken into Thy charge, bless me in what Thou hast given, guard me from the evil of what Thou hast decreed, for Thou dost decree, and nothing is decreed for Thee. He whom Thou befriendest is not humbled. Blessed and Exalted art Thou, our Lord.\"",
      "chain": [
        "30367",
        "30461",
        "20327",
        "11049",
        "19840",
        "30"
      ]
    }
  ],
  "total_hadiths": 4
}