{
  "id": "30460",
  "name": "Yahya bin Khlf al-Bahly يحيى بن خلف الباهلي أبو سلمة البصري",
  "full_name": "Yahya bin Khlf al-Bahly يحيى بن خلف الباهلي أبو سلمة البصري",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "242",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ م  ت  ق  -  صدوق ]"
    ],
    "tags": [
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20246",
      "name": "'Abdul A'ala bin 'Abdul A'ala al-Sami عبد الأعلى بن عبد الأعلى البصري السامي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20259",
      "name": "'Abdul Wahab bin 'Abdul Majeed al-Thaqaf عبد الوهاب بن عبد المجيد الثقفي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20288",
      "name": "Ma'tmar bin Sulaiman-al-Taufayl معتمر بن سليمان - الطفيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20276",
      "name": "Muhammad bin Abi 'Adi محمد بن أبي عدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "11872",
      "name": "'Abdullah bin Muslim bin 'Ubaidullah عبد الله بن مسلم بن عبيد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "20265",
      "name": "'Umar bin 'Ali bin Ata'a bin Maqaddam عمر بن علي بن عطاء بن مقدم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20229",
      "name": "Ruh bin 'Ubada bin al-'Ala' روح بن عبادة بن العلاء",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20241",
      "name": "al-Dahhak bin Mukhlad Abu 'Asim al-Nabil الضحاك بن مخلد أبو عاصم النبيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]"
    },
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "30005",
      "name": "Imam Tirmidhi الترمذي محمد بن عيسى بن سورة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30004",
      "name": "Ibn Maja ابن ماجة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30013",
      "name": "Ibn Abi Dunya ابن أبي الدنيا",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "31378",
      "name": "al-Fadl bin al-Habab bin Muhammad الفضل بن الحباب",
      "grade": "3rd Century AH"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "546",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا يحيى بن خلف الباهلي، حدثنا المعتمر، عن هشام بن حسان، عن محمد، - يعني ابن سيرين - قال حدثني عمران، قال قال نبي الله صلى الله عليه وسلم ‏\"‏ يدخل الجنة من أمتي سبعون ألفا بغير حساب ‏\"‏ ‏.‏ قالوا ومن هم يا رسول الله قال ‏\"‏ هم الذين لا يكتوون ولا يسترقون وعلى ربهم يتوكلون ‏\"‏ ‏.‏ فقام عكاشة فقال ادع الله أن يجعلني منهم ‏.‏ قال ‏\"‏ أنت منهم ‏\"‏ ‏.‏ قال فقام رجل فقال يا نبي الله ادع الله أن يجعلني منهم ‏.‏ قال ‏\"‏ سبقك بها عكاشة ‏\"‏ ‏.‏",
      "text_en": " It is reported on the authority of 'Imran that the Apostle of Allah (may peace be upon him) said:                      Seventy thousand people of my Ummah would be admitted into Paradise without rendering any account. They (the companions) said: Who would be of those (fortunate persons)? He (the Holy Prophet) said: Those who do not cauterise and practise charm, but repose trust in their Lord, 'Ukkasha then stood up and said: Supplicate (before) Allah that He should make me one among them. He (the Holy Prophet) said: Thou art one among them He (the narrator) said: A man stood up and said: Apostle of Allah, supplicate (before) Allah that He should make me one among them. He (the Holy Prophet said: 'Ukkasha has preceded you (in this matter).",
      "chain": [
        "30460",
        "20288",
        "11311",
        "11035",
        "123"
      ]
    },
    {
      "hadith_no": "4387",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "وحدثني عبد الله بن عبد الرحمن الدارمي، حدثنا حجاج بن المنهال، حدثنا حماد، عن أيوب، ح وحدثنا يحيى بن خلف، حدثنا عبد الأعلى، عن محمد بن إسحاق، كلاهما عن نافع، عن ابن عمر، ‏.‏ بهذا الحديث في النذر وفي حديثهما جميعا اعتكاف يوم ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Ibn Umar through another chain of transmitters but with a slight variation of words.",
      "chain": [
        "30025",
        "20219",
        "20022",
        "11015",
        "30460",
        "20246",
        "11107",
        "11014"
      ]
    },
    {
      "hadith_no": "5868",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثنا يحيى بن خلف الباهلي، حدثنا عبد الأعلى، عن سعيد الجريري، عن أبي، العلاء أن عثمان بن أبي العاص، أتى النبي صلى الله عليه وسلم فقال يا رسول الله إن الشيطان قد حال بيني وبين صلاتي وقراءتي يلبسها على ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ ذاك شيطان يقال له خنزب فإذا أحسسته فتعوذ بالله منه واتفل على يسارك ثلاثا ‏\"‏ ‏.‏ قال ففعلت ذلك فأذهبه الله عني ‏.‏",
      "text_en": " Uthman b. Abu al-'As reported that he came to Allah's Messenger (may peace be upon him) and said:                      Allah's Messenger, the Satan intervenes between me and my prayer and my reciting of the Qur'an and he confounds me. Thereupon Allah's Messenger (may peace be upon him) said:, That is (the doing of the Satan) who is known as Khinzab, and when you perceive its effect, seek refuge with Allah from it and spit three times to your left. I did that and Allah dispelled that from me.",
      "chain": [
        "30460",
        "20246",
        "11286"
      ]
    },
    {
      "hadith_no": "920",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا يحيى بن خلف، حدثنا عبد الأعلى، حدثنا محمد، - يعني ابن إسحاق - عن سعيد بن أبي سعيد المقبري، عن عمرو بن سليم الزرقي، عن أبي قتادة، صاحب رسول الله صلى الله عليه وسلم قال بينما نحن ننتظر رسول الله صلى الله عليه وسلم للصلاة في الظهر أو العصر وقد دعاه بلال للصلاة إذ خرج إلينا وأمامة بنت أبي العاص بنت ابنته على عنقه فقام رسول الله صلى الله عليه وسلم في مصلاه وقمنا خلفه وهي في مكانها الذي هي فيه قال فكبر فكبرنا قال حتى إذا أراد رسول الله صلى الله عليه وسلم أن يركع أخذها فوضعها ثم ركع وسجد حتى إذا فرغ من سجوده ثم قام أخذها فردها في مكانها فما زال رسول الله صلى الله عليه وسلم يصنع بها ذلك في كل ركعة حتى فرغ من صلاته ‏.‏",
      "text_en": " Abu Qatadah, a Companion of the Messenger of Allah(ﷺ), said:                      While we were waiting for the Messenger of Allah(ﷺ) for the noon or afternoon prayer, and Bilal had already called him for prayer, he came upon us with Umamah daughter of Abu al-As and daughter of his daughter on his neck. The Messenger of Allah (ﷺ) stood at the place of prayer and we stood behind him and she(Umamah) (all this time) was in her place. He uttered the takbir and we also uttered. When the Messenger of Allah(ﷺ) intended to bow, he took her and put her down, and then he bowed and prostrated till he finished his prostration. He then got up and took her and returned he to her place. The Messenger of Allah(ﷺ) kept on doing that in every rak’ah until he finished his prayer. May peace be upon him.",
      "chain": [
        "30460",
        "20246",
        "11107",
        "11168",
        "1544"
      ]
    },
    {
      "hadith_no": "1072",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا يحيى بن خلف، حدثنا أبو عاصم، عن ابن جريج، قال قال عطاء اجتمع يوم جمعة ويوم فطر على عهد ابن الزبير فقال عيدان اجتمعا في يوم واحد فجمعهما جميعا فصلاهما ركعتين بكرة لم يزد عليهما حتى صلى العصر ‏.‏",
      "text_en": " ‘Ata’ said:                      The Friday and the ‘id prayers synchronized during the time of Ibn al-Zubair. He said: Two festivals (‘id and Friday) synchronized on the same day. He combined them and offered two rak’ahs in the morning and did not add anything to them until he offered the afternoon prayer.",
      "chain": [
        "30460",
        "20241",
        "11070"
      ]
    },
    {
      "hadith_no": "1661",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا يحيى بن خلف، حدثنا أبو عاصم، عن ابن جريج، قال قال أبو الزبير سمعت عبيد بن عمير، قال قال رجل يا رسول الله ما حق الإبل فذكر نحوه زاد ‏\"‏ وإعارة دلوها ‏\"‏ ‏.‏",
      "text_en": " The aforesaid tradition has also been transmitted by ‘Ubaid bin ‘ Umair through a different chain of narrators. This version goes:                      A man asked: Messenger of Allah (ﷺ), what is due on camels? He replied in a similar way.  This version adds \"and to lend its udders.”",
      "chain": [
        "30460",
        "20241",
        "11070",
        "11263",
        "11259"
      ]
    },
    {
      "hadith_no": "2581",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا يحيى بن خلف، حدثنا عبد الوهاب بن عبد المجيد، حدثنا عنبسة، ح وحدثنا مسدد، حدثنا بشر بن المفضل، عن حميد الطويل، جميعا عن الحسن، عن عمران بن حصين، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا جلب ولا جنب ‏\"‏ ‏.‏ زاد يحيى في حديثه ‏\"‏ في الرهان ‏\"‏ ‏.‏",
      "text_en": " Narrated Imran ibn Husayn:                     The Prophet (ﷺ) said: There must be no shouting or leading another horse at one's side. Yahya added in his tradition: When racing for a wager.",
      "chain": [
        "30460",
        "20259",
        "11716",
        "30175",
        "20212",
        "11279",
        "11016",
        "123"
      ]
    },
    {
      "hadith_no": "2840",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Sacrifice (Kitab Al-Dahaya) - كتاب الضحايا",
      "chapter_no": "16",
      "text_ar": "حدثنا يحيى بن خلف، حدثنا عبد الأعلى، حدثنا هشام، عن الحسن، أنه كان يقول إماطة الأذى حلق الرأس ‏.‏",
      "text_en": " Narrated Al-Hasan:                     To remove the injury is the shaving of the head.",
      "chain": [
        "30460",
        "20246",
        "20295",
        "11016"
      ]
    },
    {
      "hadith_no": "2846",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Game (Kitab Al-Said) - كتاب الصيد",
      "chapter_no": "17",
      "text_ar": "حدثنا يحيى بن خلف، حدثنا أبو عاصم، عن ابن جريج، قال أخبرني أبو الزبير، عن جابر، قال أمر نبي الله صلى الله عليه وسلم بقتل الكلاب حتى إن كانت المرأة تقدم من البادية - يعني بالكلب - فنقتله ثم نهانا عن قتلها وقال ‏\"‏ عليكم بالأسود ‏\"‏ ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     The Prophet of Allah (ﷺ) ordered to kill dogs, and we were even killing a dog which a woman brought with her from the desert. Afterwards he forbade to kill them, saying: Confine yourselves to the type which is black.",
      "chain": [
        "30460",
        "20241",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "2988",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا يحيى بن خلف، حدثنا عبد الأعلى، عن سعيد، - يعني الجريري - عن أبي الورد، عن ابن أعبد، قال قال لي علي رضى الله عنه ألا أحدثك عني وعن فاطمة بنت رسول الله صلى الله عليه وسلم وكانت من أحب أهله إليه قلت بلى ‏.‏ قال إنها جرت بالرحى حتى أثر في يدها واستقت بالقربة حتى أثر في نحرها وكنست البيت حتى اغبرت ثيابها فأتى النبي صلى الله عليه وسلم خدم فقلت لو أتيت أباك فسألتيه خادما فأتته فوجدت عنده حداثا فرجعت فأتاها من الغد فقال ‏\"‏ ما كان حاجتك ‏\"‏ ‏.‏ فسكتت فقلت أنا أحدثك يا رسول الله جرت بالرحى حتى أثرت في يدها وحملت بالقربة حتى أثرت في نحرها فلما أن جاءك الخدم أمرتها أن تأتيك فتستخدمك خادما يقيها حر ما هي فيه ‏.‏ قال ‏\"‏ اتقي الله يا فاطمة وأدي فريضة ربك واعملي عمل أهلك فإذا أخذت مضجعك فسبحي ثلاثا وثلاثين واحمدي ثلاثا وثلاثين وكبري أربعا وثلاثين فتلك مائة فهي خير لك من خادم ‏\"‏ ‏.‏ قالت رضيت عن الله عز وجل وعن رسوله صلى الله عليه وسلم ‏.‏",
      "text_en": " Ibn A’bud said, ‘Ali said to me “May I not narrate you about me and Fathimah daughter of the Apostle of Allaah(ﷺ)? She was most favorite to him of his family.” I said “Yes”. He said “She pulled the grinding stone with her hand so much that it affected her hand, she carried water in a water bag so much so that it affected the upper portion of her chest, she swept the house so much so that her clothes became dirty. The Prophet (ﷺ) acquired some slaves”. So I said “Would that you go to your father and ask him for a slave. She then came to him and found some people with him talking to him. She therefore returned. Next day she came again. He asked (her), what was your need? But she kept silence. So I said, I inform you, Apostle of Allaah(ﷺ). She pulled grinding stone so much that it affected her hand, she carried water bag so much so that it affected the upper portion of her chest. When the slaves were brought to you I asked her to come to you and to ask you for a slave to save her from the exertion she is suffering.” He said “Fear Allaah, Fathimah and perform the duty of your Lord and do the work of your family.”  When you go to bed say “Glory be to Allaah” thirty three times, “Praise be to Allaah” thirty three times, “Allaah is Most Great” thirty four times. This is hundred times. That will be better for you than a servant. She said “I am pleased with Allaah, Most High and with his Apostle (ﷺ).”",
      "chain": [
        "30460",
        "20246",
        "11286",
        "5"
      ]
    },
    {
      "hadith_no": "3278",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا يحيى بن خلف، حدثنا عبد الأعلى، حدثنا سعيد، عن قتادة، عن الحسن، عن عبد الرحمن بن سمرة، نحوه قال ‏:‏ ‏\"‏ فكفر عن يمينك، ثم ائت الذي هو خير ‏\"‏ ‏.‏ قال أبو داود ‏:‏ أحاديث أبي موسى الأشعري وعدي بن حاتم وأبي هريرة في هذا الحديث روي عن كل واحد منهم في بعض الرواية الحنث قبل الكفارة وفي بعض الرواية الكفارة قبل الحنث ‏.‏",
      "text_en": " A similar tradition has been transmitted by 'Abd al-Rahman b. Samurah through a different chain if narrators. This version has:                      \"Make atonement for your oath and then do the thing that is better.\" Abu Dawud said: The version of this tradition transmitted by Abu Musa al-Ash'ari, 'Adi b. Hatim and Abu Hurairah are variant. Some of them indicate breaking the oath before making atonement, and other making atonement before breaking the oath.",
      "chain": [
        "30460",
        "20246",
        "11168",
        "11019",
        "11016",
        "955"
      ]
    },
    {
      "hadith_no": "3765",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا يحيى بن خلف، حدثنا أبو عاصم، عن ابن جريج، قال أخبرني أبو الزبير، عن جابر بن عبد الله، سمع النبي صلى الله عليه وسلم يقول ‏\"‏ إذا دخل الرجل بيته فذكر الله عند دخوله وعند طعامه قال الشيطان لا مبيت لكم ولا عشاء وإذا دخل فلم يذكر الله عند دخوله قال الشيطان أدركتم المبيت فإذا لم يذكر الله عند طعامه قال أدركتم المبيت والعشاء ‏\"‏ ‏.‏",
      "text_en": " Jabir bin ‘Abd Allah said that he heard the Prophet(ﷺ) say:                      When a man enters his house and mention Allah’s name on entering and on his food, the devil says: You have no place to spend the night and no evening meal; but when he enters without mentioning Allah’s name on entering, the devil says: You have found a place to spend the night, and when he does not mention Allah’s name at his food, he says: You have found a place to spend the night and an evening meal.",
      "chain": [
        "30460",
        "20241",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "3792",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا يحيى بن خلف، حدثنا روح بن عبادة، حدثنا محمد بن خالد، قال سمعت أبي خالد بن الحويرث، يقول إن عبد الله بن عمرو كان بالصفاح - قال محمد مكان بمكة - وإن رجلا جاء بأرنب قد صادها فقال يا عبد الله بن عمرو ما تقول قال قد جيء بها إلى رسول الله صلى الله عليه وسلم وأنا جالس فلم يأكلها ولم ينه عن أكلها وزعم أنها تحيض ‏.‏",
      "text_en": " Abu Khalid b. al-Huwairith said :                      ‘Abd Allah b. ‘Amar was in al-safah. The narrator Muhammed (b. Khalid) said: it is a place in Mecca. A man brought a hare which he had haunted. He said: ‘Abd Allah b. ‘Amr, what do you say ? He said: It was brought to the Messenger of Allah (ﷺ) when I was sitting (with him). He did not eat it, nor did he prohibit to eat it. He thought that it menstruated.",
      "chain": [
        "30460",
        "20229",
        "38496",
        "29"
      ]
    },
    {
      "hadith_no": "3918",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divination and Omens (Kitab Al-Kahanah Wa Al-Tatayyur) - كتاب الكهانة و التطير",
      "chapter_no": "30",
      "text_ar": "حدثنا يحيى بن خلف، حدثنا أبو عاصم، حدثنا ابن جريج، عن عطاء، قال يقول الناس الصفر وجع يأخذ في البطن ‏.‏ قلت فما الهامة قال يقول الناس الهامة التي تصرخ هامة الناس وليست بهامة الإنسان إنما هي دابة ‏.‏",
      "text_en": " Narrated 'Ata:                     People said: safar is a pain within the belly. I asked: What is hamah ? He said: People said (believed) that hamah which is an owl or a nightbird and which shrieks is the spirit of men. It is not the spirit of men. It is an animal.",
      "chain": [
        "30460",
        "20241",
        "11070",
        "11029"
      ]
    },
    {
      "hadith_no": "4189",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Combing the Hair (Kitab Al-Tarajjul) - كتاب الترجل",
      "chapter_no": "35",
      "text_ar": "حدثنا يحيى بن خلف، حدثنا عبد الأعلى، عن محمد، - يعني ابن إسحاق - قال حدثني محمد بن جعفر بن الزبير، عن عروة، عن عائشة، رضى الله عنها قالت كنت إذا أردت أن أفرق رأس رسول الله صلى الله عليه وسلم صدعت الفرق من يافوخه وأرسل ناصيته بين عينيه ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     When I parted the hair of the Messenger of Allah (ﷺ) I made a parting from the crow of his head and let his forelock hang between his eyes.",
      "chain": [
        "30460",
        "20246",
        "11107",
        "11215",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "188",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو سلمة، يحيى بن خلف البصري حدثنا المعتمر بن سليمان، عن أبيه، عن حنش، عن عكرمة، عن ابن عباس، عن النبي صلى الله عليه وسلم قال ‏\"‏ من جمع بين الصلاتين من غير عذر فقد أتى بابا من أبواب الكبائر ‏\"‏ ‏.‏ قال أبو عيسى وحنش هذا هو أبو علي الرحبي وهو حسين بن قيس وهو ضعيف عند أهل الحديث ضعفه أحمد وغيره ‏.‏ والعمل على هذا عند أهل العلم أن لا يجمع بين الصلاتين إلا في السفر أو بعرفة ‏.‏ ورخص بعض أهل العلم من التابعين في الجمع بين الصلاتين للمريض وبه يقول أحمد وإسحاق ‏.‏ وقال بعض أهل العلم يجمع بين الصلاتين في المطر وبه يقول الشافعي وأحمد وإسحاق ‏.‏ ولم ير الشافعي للمريض أن يجمع بين الصلاتين ‏.‏",
      "text_en": " Ibn Abbas narrated that :                     the Prophet said: \"Whoever combines two prayers without any excuse then he has committed something from the major sins.\"",
      "chain": [
        "30460",
        "20288",
        "11289",
        "15113",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "692",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا أبو سلمة، يحيى بن خلف البصري حدثنا بشر بن المفضل، عن خالد الحذاء، عن عبد الرحمن بن أبي بكرة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ شهرا عيد لا ينقصان رمضان وذو الحجة ‏\"‏ ‏.‏ قال أبو عيسى حديث أبي بكرة حديث حسن ‏.‏ وقد روي هذا الحديث عن عبد الرحمن بن أبي بكرة عن النبي صلى الله عليه وسلم مرسلا ‏.‏ قال أحمد معنى هذا الحديث ‏\"‏ شهرا عيد لا ينقصان ‏\"‏ ‏.‏ يقول لا ينقصان معا في سنة واحدة شهر رمضان وذو الحجة إن نقص أحدهما تم الآخر ‏.‏ وقال إسحاق معناه ‏\"‏ لا ينقصان ‏\"‏ يقول وإن كان تسعا وعشرين فهو تمام غير نقصان ‏.‏ وعلى مذهب إسحاق يكون ينقص الشهران معا في سنة واحدة ‏.‏",
      "text_en": " Abdur-Rahman bin Abi Bakrah narrated from his father that :                     the Messenger of Allah said: \"The two months of Eid will not both be deficient: Ramadn and Dhul-Hijjah.\"",
      "chain": [
        "30460",
        "20212",
        "11282",
        "11294",
        "3229"
      ]
    },
    {
      "hadith_no": "976",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو سلمة، يحيى بن خلف البصري حدثنا بشر بن المفضل، عن عمارة بن غزية، عن يحيى بن عمارة، عن أبي سعيد الخدري، عن النبي صلى الله عليه وسلم قال ‏\"‏ لقنوا موتاكم لا إله إلا الله ‏\"‏ ‏.‏ قال وفي الباب عن أبي هريرة وأم سلمة وعائشة وجابر وسعدى المرية وهي امرأة طلحة بن عبيد الله ‏.‏ قال أبو عيسى حديث أبي سعيد حديث حسن غريب صحيح ‏.‏",
      "text_en": " Abu Sa'eed Al-Khudri narrated that:                     The Prophet said: \"Instruct your dying to say: (La illaha illallah) 'None has the right to be worshipped but Allah'",
      "chain": [
        "30460",
        "20212",
        "11894",
        "11232",
        "38"
      ]
    },
    {
      "hadith_no": "1513",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Sacrifices - كتاب الأضاحى عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "19",
      "text_ar": "حدثنا أبو سلمة، يحيى بن خلف البصري حدثنا بشر بن المفضل، أخبرنا عبد الله بن عثمان بن خثيم، عن يوسف بن ماهك، أنهم دخلوا على حفصة بنت عبد الرحمن فسألوها عن العقيقة، فأخبرتهم أن عائشة أخبرتها أن رسول الله صلى الله عليه وسلم أمرهم عن الغلام شاتان مكافئتان وعن الجارية شاة ‏.‏ قال وفي الباب عن علي وأم كرز وبريدة وسمرة وأبي هريرة وعبد الله بن عمرو وأنس وسلمان بن عامر وابن عباس ‏.‏ قال أبو عيسى حديث عائشة حديث حسن صحيح ‏.‏ وحفصة هي بنت عبد الرحمن بن أبي بكر الصديق ‏.‏",
      "text_en": " Narrated Yusuf bin Mahak:                     They entered upon Hafsah bint 'Abdur-Rahman to ask her about the 'Aqiqah. She informed them that 'Aishah had informed her, that the Messenger of Allah (ﷺ) ordered them that for a boy, two sheep were sufficient, and for a girl one sheep.",
      "chain": [
        "30460",
        "20212",
        "10644",
        "11264",
        "53"
      ]
    },
    {
      "hadith_no": "3413",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا يحيى بن خلف، حدثنا ابن أبي عدي، عن هشام بن حسان، عن محمد بن سيرين، عن كثير بن أفلح، عن زيد بن ثابت، رضى الله عنه قال أمرنا أن نسبح دبر كل صلاة ثلاثا وثلاثين ونحمده ثلاثا وثلاثين ونكبره أربعا وثلاثين ‏.‏ قال فرأى رجل من الأنصار في المنام فقال أمركم رسول الله صلى الله عليه وسلم أن تسبحوا في دبر كل صلاة ثلاثا وثلاثين وتحمدوا الله ثلاثا وثلاثين وتكبروا أربعا وثلاثين قال نعم ‏.‏ قال فاجعلوا خمسا وعشرين واجعلوا التهليل معهن فغدا على النبي صلى الله عليه وسلم فحدثه فقال ‏\"‏ افعلوا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث صحيح ‏.‏",
      "text_en": " [Zaid bin Thabit [may Allah be pleased with him] said:                     “We were ordered to say the Tasbih at the end of every Salat thirty-three times, and to say the Takbir thirty-four times.” He said: “Then a man from the Ansar had a dream in which someone said: ‘The Messenger of Allah ordered you to say the Tasbih  at the end of every Salat thirty-three times, and to say the Tahmid thirty-three times, and to say the Takbir thirty-four times?’ He said: ‘Yes.’ He said: ‘Then make them twenty-five and add the Tahlil (Saying La Ilaha Illallah) to them.’ The next day he went to the Prophet and informed him, so he said: “Do it.”]",
      "chain": [
        "30460",
        "20276",
        "11311",
        "11035",
        "12438",
        "49"
      ]
    },
    {
      "hadith_no": "1135",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا يحيى بن خلف أبو سلمة، حدثنا عبد الأعلى، عن محمد بن إسحاق، عن محمد بن أبي أمامة بن سهل بن حنيف، عن أبيه أبي أمامة، عن عبد الرحمن بن كعب بن مالك، قال كنت قائد أبي حين ذهب بصره وكنت إذا خرجت به إلى الجمعة فسمع الأذان استغفر لأبي أمامة أسعد بن زرارة ودعا له فمكثت حينا أسمع ذلك منه ثم قلت في نفسي والله إن ذا لعجز إني أسمعه كلما سمع أذان الجمعة يستغفر لأبي أمامة ويصلي عليه ولا أسأله عن ذلك لم هو فخرجت به كما كنت أخرج به إلى الجمعة فلما سمع الأذان استغفر كما كان يفعل فقلت له يا أبتاه أرأيتك صلاتك على أسعد بن زرارة كلما سمعت النداء بالجمعة لم هو قال أى بنى كان أول من صلى بنا صلاة الجمعة قبل مقدم رسول الله  صلى الله عليه وسلم  من مكة في نقيع الخضمات في هزم من حرة بني بياضة ‏.‏ قلت كم كنتم يومئذ قال أربعين رجلا ‏.‏",
      "text_en": " It wasnarrated that ‘Abdur-Rahman bin Ka’b bin Malik said:                      “I usedtoguide my father after he lost his sight, and when I took him outforthe Friday (prayer), when he heard the Adhan he would pray forforgiveness for Abu Umamah As’ad bin Zurarah, and supplicate forhim.I heard that from him for a while, then I said to myself: ‘ByAllah!What is this weakness? Every time he heard the Adhan forFriday(prayer) I hear him praying for forgiveness for Abu Umamah andsupplicate for him, and I do not ask him about why he does that.’ThenI took him out for Friday (prayer), as I used to take him out,andwhen he heard the Adhan he prayed for forgiveness as he used todo. Isaid to him: ‘O my father! I see you supplicating for As’adbinZurarah every time you hear the call for Friday; why is that?’Hesaud: ‘O my son, he was the first one who led us for the Fridayprayerbefore the Messenger of Allah (ﷺ) came from Makkah, in Naqi’Al-Khadamat (a place near Al-Madinah), in the plain of Harrah BanuBayadah.’ I asked: ‘How many of you were there at that time?’He said:‘Forty men.’”",
      "chain": [
        "30460",
        "20246",
        "11107",
        "1134"
      ]
    },
    {
      "hadith_no": "1157",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا عبد الرزاق، أنبأنا معمر، عن عبيد الله بن عمر، عن نافع، عن ابن عمر، ح وحدثنا يحيى بن خلف أبو سلمة، حدثنا بشر بن المفضل، عن عبيد الله، عن نافع، عن ابن عمر، أن النبي  صلى الله عليه وسلم  كان يخطب خطبتين يجلس بينهما جلسة ‏.‏ زاد بشر وهو قائم ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Umar that the Prophet (ﷺ) used to delivertwosermons, and he would sit briefly between the two. (One of thenarrators) Bishr added:                      “While he was standing.”",
      "chain": [
        "30277",
        "20121",
        "20115",
        "11201",
        "11014",
        "18",
        "30460",
        "20212",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1602",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا يحيى بن خلف، ومحمد بن زياد، قالا حدثنا بشر بن المفضل، ح وحدثنا عمرو بن رافع، حدثنا هشيم، جميعا عن يونس، عن أبي قلابة، عن أبي المهلب، عن عمران بن الحصين، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ إن أخاكم النجاشي قد مات فصلوا عليه ‏\"‏ ‏.‏ قال فقام فصلينا خلفه وإني لفي الصف الثاني فصلى عليه ‏.‏",
      "text_en": " It wasnarrated from ‘Imran bin Husain:                      “The Messenger of Allah (ﷺ)said: ‘Your brother Najashi has died, so offer the funeral prayerforhim.” Then he stood and we prayed behind him. I was in thesecond rowand two rows prayed for him.”",
      "chain": [
        "30460",
        "11216",
        "20212",
        "18792",
        "20468",
        "20475",
        "11047"
      ]
    },
    {
      "hadith_no": "1679",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا يحيى بن خلف أبو سلمة، قال حدثنا عبد الأعلى، عن محمد بن إسحاق، حدثني عبد الله بن أبي بكر، عن أم عيسى الجزار، قالت حدثتني أم عون ابنة محمد بن جعفر، عن جدتها، أسماء بنت عميس قالت لما أصيب جعفر رجع رسول الله  صلى الله عليه وسلم  إلى أهله فقال ‏\"‏ إن آل جعفر قد شغلوا بشأن ميتهم فاصنعوا لهم طعاما ‏\"‏ ‏.‏ قال عبد الله فما زالت سنة حتى كان حديثا فترك ‏.‏",
      "text_en": " Asma’bint ‘Umais said:                      “When Ja’far was killed, the Messenger ofAllah (ﷺ) went to his family and said: ‘The family of Ja’fararebusy with the matter of their deceased, so prepare food forthem.’”",
      "chain": [
        "30460",
        "20246",
        "11107",
        "11104",
        "19556",
        "69"
      ]
    },
    {
      "hadith_no": "2072",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا يحيى بن خلف أبو سلمة، حدثنا بشر بن المفضل، عن عبد الرحمن بن إسحاق، عن الزهري، عن سالم، عن أبيه، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ الشؤم في ثلاثة في الفرس والمرأة والدار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Salim, from his father, that:                     the Messenger of Allah said: \"Omens are only to be found in three things: a horse, a woman and a house.\" (Sahih)(One of the narrators) Az-Zuhri said: \" Abu 'Ubaidah bin 'Abdullah bin Zam'ah said that his mother, Zainab, narrated to him, from Umm Salamah, that she used to list these three, and add to them \"the sword.\"",
      "chain": [
        "30460",
        "20212",
        "11876",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "2293",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا يحيى بن خلف، حدثنا عبد الأعلى، ح وحدثنا هشام بن عمار، حدثنا إسماعيل بن عياش، قالا حدثنا محمد بن إسحاق، عن معبد بن كعب بن مالك، عن أبي قتادة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إياكم والحلف في البيع فإنه ينفق ثم يمحق ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Qatadah that the Messenger of Allah (ﷺ), said:                     \"Beware of swearing oaths when selling, for it may help you to make a sale but it destroys the blessing.\"'",
      "chain": [
        "30460",
        "20246",
        "30288",
        "20736",
        "11107",
        "1134",
        "391"
      ]
    }
  ],
  "total_hadiths": 26
}