{
  "id": "30469",
  "name": "'Ubaid bin Y'ysh al-Mhamly عبيد بن يعيش المحاملي أبو محمد الكوفي",
  "full_name": "'Ubaid bin Y'ysh al-Mhamly عبيد بن يعيش المحاملي أبو محمد الكوفي",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "228",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ي  م  س  -  ثقة ]"
    ],
    "tags": [
      "al-Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20331",
      "name": "'Abdullah bin Numayr عبد الله بن نمير",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20118",
      "name": "Yunus bin Bukayr al-Shaybani يونس بن بكير بن واصل الشيباني",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20318",
      "name": "Hammad bin Usamah حماد بن أسامة - أبو أسامة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20333",
      "name": "'Abdur Rahman bin Muhammad al-Maharbi عبد الرحمن بن محمد بن زياد المحاربي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20356",
      "name": "Muhammad bin Fadayl bin Ghazwan محمد بن فضيل بن غزوان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30464",
      "name": "Zakaria bin 'Ady bin Zarayn زكريا بن عدي بن زريق",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "students": [
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]"
    },
    {
      "id": "35010",
      "name": "Ibrahim bin Abi Bakr bin Muhammad إبراهيم بن أبي بكر",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30554",
      "name": "Abu Zara' al-Razi أبو زرعة الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38383",
      "name": "'Uthman bin 'Abdullah عثمان بن عبد الله بن محمد بن خرزاذ",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38420",
      "name": "'Umar bin al-Khtab al-Sjstany عمر بن الخطاب السجستاني",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "11371",
      "name": "'Uthman bin 'Asim bin Husayn عثمان بن عاصم بن حصين أبو حصين",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "6478",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا عبيد بن يعيش، ومحمد بن العلاء الهمداني، قالا حدثنا أبو أسامة، عن  أبي حيان، ح وحدثنا محمد بن عبد الله بن نمير، - واللفظ له - حدثنا أبي، حدثنا أبو حيان التيمي يحيى بن سعيد عن أبي زرعة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم لبلال عند صلاة الغداة ‏\"‏ يا بلال حدثني بأرجى عمل عملته عندك في الإسلام منفعة فإني سمعت الليلة خشف نعليك بين يدى في الجنة ‏\"‏ ‏.‏ قال بلال ما عملت عملا في الإسلام أرجى عندي منفعة من أني لا أتطهر طهورا تاما في ساعة من ليل ولا نهار إلا صليت بذلك الطهور ما كتب الله لي أن أصلي ‏.‏",
      "text_en": " Abu Huraira reported that Allah's Messenger (may peace be upon him) said to Bilal:                      Bilal, narrate to me which act at the time of morning prayer you did in Islam for which you hope to receive good reward, for I heard during the night the sound of your steps before me in Paradise. Bilal said: I did not do any act in Islam for which I hope to get any benefit but this that when I perform complete ablution during the night or day I observe prayer with that purification what Allah has ordained for me to pray.",
      "chain": [
        "30469",
        "30216",
        "20318",
        "11404",
        "15184",
        "11404",
        "11406",
        "13"
      ]
    },
    {
      "hadith_no": "7092",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "وحدثني زهير بن حرب، حدثنا سفيان بن عيينة، عن عبيد الله بن أبي يزيد، عن مجاهد، عن ابن أبي ليلى، عن علي بن أبي طالب، ح  وحدثنا محمد بن عبد الله بن نمير، وعبيد بن يعيش، عن عبد الله بن نمير، حدثنا  عبد الملك، عن عطاء بن أبي رباح، عن مجاهد، عن ابن أبي ليلى، عن علي، عن النبي صلى الله عليه وسلم ‏.‏ بنحو حديث الحكم عن ابن أبي ليلى، وزاد، في الحديث قال علي ما تركته منذ سمعته من النبي صلى الله عليه وسلم ‏.‏ قيل له ولا ليلة صفين قال ولا ليلة صفين ‏.‏ وفي حديث عطاء عن مجاهد عن ابن أبي ليلى قال قلت له ولا ليلة صفين",
      "text_en": " This hadith has been transmitted on the authority of Ibn Abi Laili but with this addition:                     \" Ali said: Ever since I heard this (supplication) from Allah's Apostle (may peace be upon him), I never abandoned it. It was said to him, Not even in the night of Siffin (battle of Siffin)? He sad: Yes, not even in the night of Siffin,\"",
      "chain": [
        "30022",
        "20005",
        "11258",
        "11028",
        "11196",
        "5",
        "30212",
        "30469",
        "20331",
        "11368",
        "11029",
        "11028",
        "11196"
      ]
    },
    {
      "hadith_no": "7459",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا عبيد بن يعيش، وإسحاق بن إبراهيم، - واللفظ لعبيد - قالا حدثنا يحيى، بن آدم بن سليمان مولى خالد بن خالد حدثنا زهير، عن سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ منعت العراق درهمها وقفيزها ومنعت الشأم مديها ودينارها ومنعت مصر إردبها ودينارها وعدتم من حيث بدأتم وعدتم من حيث بدأتم وعدتم من حيث بدأتم ‏\"‏ ‏.‏ شهد على ذلك لحم أبي هريرة ودمه ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      Iraq would withhold its dirhams and qafiz; Syria would withhold its mudd and dinar and Egypt would withhold its irdab and dinar and you would recoil to that position from where you started and you would recoil to that position from where you started and you would recoil to that position from where you started, the bones and the flesh of Abu Huraira would bear testimony to it.",
      "chain": [
        "30469",
        "30123",
        "20364",
        "20321",
        "11173",
        "11161",
        "13"
      ]
    }
  ],
  "total_hadiths": 3
}