{
  "id": "30474",
  "name": "Awn bin Salam عون بن سلام",
  "full_name": "Awn bin Salam عون بن سلام",
  "grade": "3rd Century AH [10th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "230",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  -  ثقة ]"
    ],
    "tags": [
      "Client",
      "al-Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20604",
      "name": "Muhammad bin Talha bin Masraf محمد بن طلحة بن مصرف",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20321",
      "name": "Zuhayr bin Mua'wiya bin Hudayj زهير بن معاوية بن حديج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20619",
      "name": "Abu Bakr al-Nhshly al-Kwfy أبو بكر النهشلي الكوفي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20329",
      "name": "Abthr bin al-Qasim al-Zbydy Abu عبثر بن القاسم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20311",
      "name": "Isra'il bin Yonus bin Abi Ishaq إسرائيل بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "25246",
      "name": "Qays bin al-Rabi' al-'Asady Abu قيس بن الربيع الأسدي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "25314",
      "name": "Mandal bin 'Ali al-'Anzi مندل بن علي العنزي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20647",
      "name": "al-Hasan bin Salah bin Salah الحسن بن صالح بن صالح",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]"
    },
    {
      "id": "30218",
      "name": "Musa bin Harun bin Bashyr موسى بن هارون بن بشير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30554",
      "name": "Abu Zara' al-Razi أبو زرعة الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "34196",
      "name": "Muhammad bin al-Husain bin Abi Halima محمد بن الحسين بن أبي حليمة",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38549",
      "name": "Muhammad bin 'Uthman bin Abi Safwan محمد بن عثمان بن أبي صفوان",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38805",
      "name": "Ahmed bin Musa bin Ishaq أحمد بن موسى بن إسحاق",
      "grade": "3rd Century AH"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "230",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن بكار بن الريان، وعون بن سلام، قالا حدثنا محمد بن طلحة، ح وحدثنا محمد بن المثنى، حدثنا عبد الرحمن بن مهدي، حدثنا سفيان، ح وحدثنا محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، كلهم عن زبيد، عن أبي وائل، عن عبد الله بن مسعود، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ سباب المسلم فسوق وقتاله كفر ‏\"‏ ‏.‏ قال زبيد فقلت لأبي وائل أنت سمعته من عبد الله يرويه عن رسول الله صلى الله عليه وسلم قال نعم ‏.‏ وليس في حديث شعبة قول زبيد لأبي وائل ‏.‏",
      "text_en": " It is narrated on the authority of 'Abdullah b. Mas'ud that the Messenger of Allah (may peace and blessings be upon him) observed:                      Abusing a Muslim is an outrage and fighting against him is unbelief. Zubaid said: I asked Abu Wa'il: Did you hear it from Abdullah narrating if from the Messenger of Allah (may peace and blessings be upon him)? He replied: Yes. But there is mention of the talk between Zubaid and Abu Wa'il in the hadith narrated by Shu'ba.",
      "chain": [
        "30512",
        "30474",
        "20604",
        "30170",
        "20033",
        "20005",
        "30170",
        "20173",
        "11335",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "1312",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثناه عون بن سلام الكوفي، أخبرنا أبو بكر النهشلي، عن عبد الرحمن بن الأسود، عن أبيه، عن عبد الله، قال صلى بنا رسول الله صلى الله عليه وسلم خمسا فقلنا يا رسول الله أزيد في الصلاة قال ‏\"‏ وما ذاك ‏\"‏ ‏.‏ قالوا صليت خمسا ‏.‏ قال ‏\"‏ إنما أنا بشر مثلكم أذكر كما تذكرون وأنسى كما تنسون ‏\"‏ ‏.‏ ثم سجد سجدتى السهو ‏.‏",
      "text_en": " 'Abdullah (b. Mas'ud) reported:                      The Messenger of Allah (may peace be upon him) led us five (rak'ahs in prayer). We said: Messenger of Allah, has the prayer been extended? He said: What is the matter? They said: You have said five (rak'ahs). He (the Holy Prophet) said: Verily I am a human being like you. I remember as you remember and I forget just as you forget. He then performed two prostrations as (compensation of) forgetfulness.",
      "chain": [
        "30474",
        "20619",
        "11056",
        "11054",
        "16"
      ]
    },
    {
      "hadith_no": "1437",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا أحمد بن يونس، وعون بن سلام، - قال عون أخبرنا وقال ابن يونس، واللفظ، له حدثنا زهير، - قال حدثنا أبو إسحاق، عن سعيد بن وهب، عن خباب، قال أتينا رسول الله صلى الله عليه وسلم فشكونا إليه حر الرمضاء فلم يشكنا ‏.‏ قال زهير قلت لأبي إسحاق أفي الظهر قال نعم ‏.‏ قلت أفي تعجيلها قال نعم ‏.‏",
      "text_en": " Khabbab reported:                      We came to the Messenger of Allah (may peace be upon him) and we complained to the Messenger of Allah (may peace be upon him) about (saying prayer) on the extremely heated ground (or sand), but he paid no heed to us. Zuhair said: I asked Abu Ishaq whether it was about the noon prayer. He said: Yes. I again said whether it concerned the (offering) of the noon (prayer) in earlier hours. He said: Yes. I said: Did it concern expediting it? He said: Yes.",
      "chain": [
        "30184",
        "30474",
        "20321",
        "11049",
        "10768",
        "149"
      ]
    },
    {
      "hadith_no": "1458",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا عون بن سلام الكوفي، أخبرنا محمد بن طلحة اليامي، عن زبيد، عن مرة، عن عبد الله، قال حبس المشركون رسول الله صلى الله عليه وسلم عن صلاة العصر حتى احمرت الشمس أو اصفرت فقال رسول الله صلى الله عليه وسلم ‏\"‏ شغلونا عن الصلاة الوسطى صلاة العصر ملأ الله أجوافهم وقبورهم نارا ‏\"‏ ‏.‏ أو قال ‏\"‏ حشا الله أجوافهم وقبورهم نارا ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah (b. Mas'ud) reported that the polytheists detained the Messenger of Allah (may peace be upon him) from observing the afternoon prayer till the sun became red or it became yellow. Upon this the Messenger of Allah (may peace be upon him) said:                      They have diverted us from (offering) the middle prayer. i. e. the 'Asr prayer. May Allah fill their bellies and their graves with fire, or he said: May Allah stuff their bellies and their graves with fire.",
      "chain": [
        "30474",
        "20604",
        "11335",
        "16"
      ]
    },
    {
      "hadith_no": "1663",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا أحمد بن يونس، وعون بن سلام، جميعا عن زهير، - قال ابن يونس حدثنا زهير، - حدثنا أبو الزبير، عن سعيد بن جبير، عن ابن عباس، قال صلى رسول الله صلى الله عليه وسلم الظهر والعصر جميعا بالمدينة في غير خوف ولا سفر ‏.‏ قال أبو الزبير فسألت سعيدا لم فعل ذلك فقال سألت ابن عباس كما سألتني فقال أراد أن لا يحرج أحدا من أمته ‏.‏",
      "text_en": " Ibn 'Abbas reported:                      The Messenger of Allah (may peace be upon him) observed the noon and afternoon prayers together in Medina without being in a state of fear or in a state of journey. (Abu Zubair said: I asked Sa'id [one of the narrators] why he did that. He said: I asked Ibn 'Abbas as you have asked me, and he replied that he [the Holy Prophet] wanted that no one among his Ummah should be put to [unnecessary] hardship.)",
      "chain": [
        "30184",
        "30474",
        "20321",
        "20321",
        "11263",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "2309",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "حدثنا عون بن سلام الكوفي، أخبرنا زهير، عن سماك، عن جابر بن سمرة، قال أتي النبي صلى الله عليه وسلم برجل قتل نفسه بمشاقص فلم يصل عليه ‏.‏",
      "text_en": " Jabir b. Samura reported:                      (The dead body) of a person who had killed himself with a broad-headed arrow was brought before the Apostle of Allah (may peace be upon him), but he did not offer prayers for him.",
      "chain": [
        "30474",
        "20321",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "2394",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا عون بن سلام الكوفي، حدثنا زهير بن معاوية الجعفي، عن أبي إسحاق، عن عبد الله بن معقل، عن عدي بن حاتم، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ من استطاع منكم أن يستتر من النار ولو بشق تمرة فليفعل ‏\"‏ ‏.‏",
      "text_en": " 'Adi b. Hatim reported that he heard Allah's Messenger (way peace be upon him) as saying:                      He who among you can protect himself against Fire, he should do so, even if it should be with half a date.",
      "chain": [
        "30474",
        "20321",
        "11049",
        "18580",
        "212"
      ]
    }
  ],
  "total_hadiths": 7
}