{
  "id": "3047",
  "name": "Yazid bin Sa'id bin Thamama ( يزيد بن سعيد بن ثمامة ( رضي الله عنه",
  "full_name": "Yazid bin Sa'id bin Thamama ( يزيد بن سعيد بن ثمامة ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Yemen"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Yemen",
      "Medina"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ بخ  د  ت  -  صحابي ]",
      "Qadhi(Judge)"
    ],
    "tags": [
      "al-Kundi",
      "Late Muslim"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "3048",
      "name": "al-Sa'ib bin Yazid bin Akht Namr ( السائب بن يزيد بن أخت النمر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "students": [
    {
      "id": "3048",
      "name": "al-Sa'ib bin Yazid bin Akht Namr ( السائب بن يزيد بن أخت النمر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1492",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا ابن لهيعة، عن حفص بن هاشم بن عتبة بن أبي وقاص، عن السائب بن يزيد، عن أبيه، أن النبي صلى الله عليه وسلم كان إذا دعا فرفع يديه مسح وجهه بيديه ‏.‏",
      "text_en": " Narrated Yazid ibn Sa'id al-Kindi:                     When the Prophet (ﷺ) made supplication (to Allah) he would raise his hands and wipe his face with his hands.",
      "chain": [
        "30367",
        "20624",
        "18203",
        "3048",
        "3047"
      ]
    },
    {
      "hadith_no": "5003",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى، عن ابن أبي ذئب، ح وحدثنا سليمان بن عبد الرحمن الدمشقي، حدثنا شعيب بن إسحاق، عن ابن أبي ذئب، عن عبد الله بن السائب بن يزيد، عن أبيه، عن جده، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يأخذن أحدكم متاع أخيه لاعبا ولا جادا ‏\"‏ ‏.‏ وقال سليمان ‏\"‏ لعبا ولا جدا ‏\"‏ ‏.‏ ‏\"‏ ومن أخذ عصا أخيه فليردها ‏\"‏ ‏.‏ لم يقل ابن بشار ابن يزيد وقال قال رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Abdullah ibn as-Sa'ib ibn Yazid:                     The Messenger of Allah (ﷺ) said: None of you should take the property of his brother in amusement (i.e. jest), nor in earnest. The narrator Sulayman said: Out of amusement and out of earnest. If anyone takes the staff of his brother, he should return it. The transmitter Ibn Bashshar did not say \"Ibn Yazid, and he said: The Messenger of Allah (ﷺ) said.",
      "chain": [
        "30160",
        "20031",
        "20177",
        "30587",
        "20239",
        "20177",
        "12216",
        "3047"
      ]
    },
    {
      "hadith_no": "2160",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا بندار، حدثنا يحيى بن سعيد، حدثنا ابن أبي ذئب، حدثنا عبد الله بن السائب بن يزيد، عن أبيه، عن جده، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يأخذ أحدكم عصا أخيه لاعبا أو جادا فمن أخذ عصا أخيه فليردها إليه ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن ابن عمر وسليمان بن صرد وجعدة وأبي هريرة ‏.‏ وهذا حديث حسن غريب لا نعرفه إلا من حديث ابن أبي ذئب ‏.‏ والسائب بن يزيد له صحبة قد سمع من النبي صلى الله عليه وسلم أحاديث وهو غلام وقبض النبي صلى الله عليه وسلم وهو ابن سبع سنين ووالده يزيد بن السائب له أحاديث هو من أصحاب النبي صلى الله عليه وسلم وقد روى عن النبي صلى الله عليه وسلم والسائب بن يزيد هو ابن أخت نمر",
      "text_en": " 'Abdullah bin As-Sa'ib bin Yazid narrated from his father, from his grandfather who said:                      \"The Messenger of Allah (s.a.w) said:'Let one of you not take his brother's staff, neither in play nor seriousness. Whoever took his brother's staff, then let him return it to him.\"'",
      "chain": [
        "30160",
        "20031",
        "20177",
        "12216",
        "3047"
      ]
    }
  ],
  "total_hadiths": 3
}