{
  "id": "30479",
  "name": "Mnjab bin al-Harith منجاب بن الحارث",
  "full_name": "Mnjab bin al-Harith منجاب بن الحارث",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "231",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  فق  -  ثقة ]"
    ],
    "tags": [
      "al-Tamimi",
      "al-Kufa"
    ],
    "area_of_interest_display": [
      {
        "en": "Narrator[Grade:Thiqah] [ م  فق  -  ثقة ]",
        "ar": "Narrator[Grade:Thiqah] [ م  فق  -  ثقة ]",
        "ckb": "Narrator[Grade:Thiqah] [ م  فق  -  ثقة ]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "Kufa",
        "ar": "الكوفة",
        "ckb": "كوفە"
      }
    ],
    "tags_display": [
      {
        "en": "al-Tamimi",
        "ar": "al-Tamimi",
        "ckb": "al-Tamimi"
      },
      {
        "en": "al-Kufa",
        "ar": "al-Kufa",
        "ckb": "al-Kufa"
      }
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20345",
      "name": "'Ali bin Ms'hr علي بن مسهر",
      "grade": "Succ. (Taba' Tabi') [8th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [8th Generation]",
        "ar": "تابع التابعين [الجيل الثامن]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی هەشتەم]"
      }
    },
    {
      "id": "25030",
      "name": "Bashr bin Amarh al-Khth'my بشر بن عمارة الخثعمي المكتب",
      "grade": "Succ. (Taba' Tabi') [7th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [7th Generation]",
        "ar": "تابع التابعين [الجيل السابع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی حەوتەم]"
      }
    },
    {
      "id": "15646",
      "name": "Yazid bin al-Mqdam bin Shryh يزيد بن المقدام بن شريح",
      "grade": "Follower(Tabi') [5th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [5th Generation]",
        "ar": "تابعي [الجيل الخامس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی پێنجەم]"
      }
    },
    {
      "id": "20159",
      "name": "Hatm bin Isma'il al-Madni حاتم بن إسماعيل المدني",
      "grade": "Succ. (Taba' Tabi') [8th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [8th Generation]",
        "ar": "تابع التابعين [الجيل الثامن]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی هەشتەم]"
      }
    },
    {
      "id": "20327",
      "name": "Abu al-Ahwus, Salam bin Sulaym al-Hanafi أبو الأحوص سلام بن سليم الحنفي",
      "grade": "Succ. (Taba' Tabi') [7th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [7th Generation]",
        "ar": "تابع التابعين [الجيل السابع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی حەوتەم]"
      }
    },
    {
      "id": "20587",
      "name": "Sharayk bin 'Abdullah شريك بن عبد الله النخعي",
      "grade": "Succ. (Taba' Tabi') [8th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [8th Generation]",
        "ar": "تابع التابعين [الجيل الثامن]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی هەشتەم]"
      }
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [8th Generation]",
        "ar": "تابع التابعين [الجيل الثامن]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی هەشتەم]"
      }
    },
    {
      "id": "20443",
      "name": "Abu 'Amir al-'Aqdi عبد الملك بن عمرو القيسي أبو عامر العقدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [9th Generation]",
        "ar": "تابع التابعين [الجيل التاسع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی نۆیەم]"
      }
    }
  ],
  "students": [
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]",
      "grade_display": {
        "en": "3rd Century AH [Shafi'i]",
        "ar": "القرن الثالث الهجري [شافعي]",
        "ckb": "سەدەی سێیەمی كۆچی [شافیعی]"
      }
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]",
      "grade_display": {
        "en": "3rd Century AH [11th Generation]",
        "ar": "القرن الثالث الهجري [الجيل الحادي عشر]",
        "ckb": "سەدەی سێیەمی كۆچی [نەوەی یازدەیەم]"
      }
    },
    {
      "id": "30023",
      "name": "Muhammad bin Yahya bin Faris al-Dhahli محمد بن يحيى بن فارس الذهلي",
      "grade": "3rd Century AH [11th generation]",
      "grade_display": {
        "en": "3rd Century AH [11th Generation]",
        "ar": "القرن الثالث الهجري [الجيل الحادي عشر]",
        "ckb": "سەدەی سێیەمی كۆچی [نەوەی یازدەیەم]"
      }
    },
    {
      "id": "30022",
      "name": "Zuhayr bin Harb زهير بن حرب بن شداد أبو خثيمة",
      "grade": "3rd Century AH [10th generation]",
      "grade_display": {
        "en": "3rd Century AH [10th Generation]",
        "ar": "القرن الثالث الهجري [الجيل العاشر]",
        "ckb": "سەدەی سێیەمی كۆچی [نەوەی دەیەم]"
      }
    },
    {
      "id": "38549",
      "name": "Muhammad bin 'Uthman bin Abi Safwan محمد بن عثمان بن أبي صفوان",
      "grade": "3rd Century AH [11th generation]",
      "grade_display": {
        "en": "3rd Century AH [11th Generation]",
        "ar": "القرن الثالث الهجري [الجيل الحادي عشر]",
        "ckb": "سەدەی سێیەمی كۆچی [نەوەی یازدەیەم]"
      }
    }
  ],
  "hadiths": [
    {
      "id": "sahih-muslim-276",
      "hadith_no": "276",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا منجاب بن الحارث التميمي، وسويد بن سعيد، كلاهما عن علي بن مسهر، - قال منجاب أخبرنا ابن مسهر، - عن الأعمش، عن إبراهيم، عن علقمة، عن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يدخل النار أحد في قلبه مثقال حبة خردل من إيمان ولا يدخل الجنة أحد في قلبه مثقال حبة خردل من كبرياء ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of 'Abdullah b. Mas'ud that the Messenger of Allah (may peace be upon him) observed:                      None shall enter the Fire (of Hell) who has in his heart the weight of a mustard seed of Iman and none shall enter Paradise who has in his heart the weight of a mustard seed of pride.",
      "usc_msa_ref": "",
      "chain": [
        "30479",
        "30547",
        "20345",
        "11060",
        "11051",
        "11017",
        "16"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-305",
      "hadith_no": "305",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو معاوية، ووكيع، عن الأعمش، ح وحدثنا منجاب بن الحارث التميمي، - واللفظ له - أخبرنا ابن مسهر، عن الأعمش، عن إبراهيم، عن همام بن الحارث، قال كنا جلوسا مع حذيفة في المسجد فجاء رجل حتى جلس إلينا فقيل لحذيفة إن هذا يرفع إلى السلطان أشياء ‏.‏ فقال حذيفة - إرادة أن يسمعه - سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يدخل الجنة قتات ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Hammam b. al-Harith:                      We were sitting with Hudhaifa in the mosque. A man came and sat along with us. It was said to Hudhaifa that he was the man who carried tales to the ruler. Hudhaifa remarked with the intention of conveying to him: I have heard the Messenger of Allah (may peace be upon him) saying: The tale-bearer will not enter Paradise.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20354",
        "20032",
        "11060",
        "30479",
        "11060",
        "11051",
        "11400"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-335",
      "hadith_no": "335",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا منجاب بن الحارث التميمي، أخبرنا علي بن مسهر، عن الأعمش، بهذا الإسناد مثله ‏.‏",
      "text_en": " This hadith has been transmitted by Minjab b. al-Harith Tamimi with the same chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30479",
        "20345"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-343",
      "hadith_no": "343",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا إسحاق بن إبراهيم، وعلي بن خشرم، قالا أخبرنا عيسى، - وهو ابن يونس ح وحدثنا منجاب بن الحارث التميمي، أخبرنا ابن مسهر، ح وحدثنا أبو كريب، أخبرنا ابن إدريس، كلهم عن الأعمش، بهذا الإسناد قال أبو كريب قال ابن إدريس حدثنيه أولا أبي، عن أبان بن تغلب، عن الأعمش، ثم سمعته منه، ‏.‏",
      "text_en": " This hadith is narrated by another chain of transmitters, (namely) lshaq b. Ibrahim. Ibn Idris says:                      My father transmitted it from Aban b. Taghlib who heard it from A'mash; then I heard it also from him (A'mash).",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "30556",
        "20347",
        "30479",
        "30216",
        "30216",
        "20577"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-272-3",
      "hadith_no": "272",
      "source": "Sahih Muslim",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثناه إسحاق بن إبراهيم، وعلي بن خشرم، قالا أخبرنا عيسى بن يونس، ح وحدثناه محمد بن أبي عمر، قال حدثنا سفيان، ح وحدثنا منجاب بن الحارث التميمي، أخبرنا ابن مسهر، كلهم عن الأعمش، في هذا الإسناد بمعنى حديث أبي معاوية غير أن في، حديث عيسى وسفيان قال فكان أصحاب عبد الله يعجبهم هذا الحديث لأن إسلام جرير كان بعد نزول المائدة ‏.‏",
      "text_en": " This hadith is narrated on the same authority from A'mash by another chain of transmitters like one transmitted by Abu Mu'awyia. The hadith reported by 'Isa and Sufyan has these words also:                     \" This hadith surprised the friends of Abdullab'\" for Jarir had embraced Islam after the revelation of al-Ma'ida.",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "30556",
        "20347",
        "20012",
        "30479"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-418-8",
      "hadith_no": "418",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا منجاب بن الحارث التميمي، أخبرنا ابن مسهر، ح وحدثنا إسحاق بن إبراهيم، أخبرنا عيسى بن يونس، كلاهما عن الأعمش، بهذا الإسناد نحوه وفي حديثهما لما مرض رسول الله صلى الله عليه وسلم مرضه الذي توفي فيه ‏.‏ وفي حديث ابن مسهر فأتي برسول الله صلى الله عليه وسلم حتى أجلس إلى جنبه وكان النبي صلى الله عليه وسلم يصلي بالناس وأبو بكر يسمعهم التكبير ‏.‏ وفي حديث عيسى فجلس رسول الله صلى الله عليه وسلم يصلي وأبو بكر إلى جنبه وأبو بكر يسمع الناس ‏.‏",
      "text_en": " A'mash reported:                      When the Messenger of Allah (may peace be upon him) suffered from illness of which he died, and in the hadith transmitted by Ibn Mus-hir, the words are: The Messenger of Allah (may peace be upon him) was brought till he was seated by his (Abu Bakr's) side and the Apostle (may peace be upon him) led the people in prayer and Abu Bakr was making takbir audible to them, and in the hadith transmitted by 'Isa the (words are):\" The Messenger of Allah (may peace be upon him) sat and led the people in prayer and Abu Bakr was by his side and he was making (takbir) audible to the people.\"",
      "usc_msa_ref": "",
      "chain": [
        "30479",
        "30123",
        "20347"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-1220",
      "hadith_no": "1220",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا منجاب بن الحارث التميمي، أخبرنا ابن مسهر، ح قال وحدثنا عثمان بن أبي شيبة، حدثنا جرير، ح قال وحدثني محمد بن رافع، حدثنا يحيى بن آدم، حدثنا مفضل، كلهم عن الأعمش، عن إبراهيم، عن علقمة، والأسود، أنهما دخلا على عبد الله ‏.‏ بمعنى حديث أبي معاوية ‏.‏ وفي حديث ابن مسهر وجرير فلكأني أنظر إلى اختلاف أصابع رسول الله صلى الله عليه وسلم وهو راكع ‏.‏",
      "text_en": " This hadith is narrated on the authority of Alqama and Aswad by another chain of transmitters and in the hadith transmitted by Ibn Mus-hir and Jabir the words are:                     \" I perceive as if I am seeing the gap between the fingers of the Messenger of Allah (may peace be upon him) as he was bowing.\"",
      "usc_msa_ref": "",
      "chain": [
        "30479",
        "30203",
        "20028",
        "30375",
        "20364",
        "11060",
        "11051",
        "11017"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-1313",
      "hadith_no": "1313",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا منجاب بن الحارث التميمي، أخبرنا ابن مسهر، عن الأعمش، عن إبراهيم، عن علقمة، عن عبد الله، قال صلى رسول الله صلى الله عليه وسلم فزاد أو نقص - قال إبراهيم والوهم مني - فقيل يا رسول الله أزيد في الصلاة شىء فقال ‏\"‏ إنما أنا بشر مثلكم أنسى كما تنسون فإذا نسي أحدكم فليسجد سجدتين وهو جالس ‏\"‏ ‏.‏ ثم تحول رسول الله صلى الله عليه وسلم فسجد سجدتين ‏.‏",
      "text_en": " 'Abdullah (b. Mas'ud) reported:                      The Messenger of Allah (may peace be upon him) said prayer and he omitted or committed (something). Ibrahim (one of the narrators of this hadith) said: It is my doubt, and it was said: Messenger of Allah, has there been any addition to the prayer? He (the Holy Prophet) said: Verily I am a human being like you. I forget just as you forget so when any one of you forgets, he must perform two prostrations, and he (the Holy Prophet) was sitting and then the Messenger of Allah (may peace be upon him) turned (his face towards the Qibla) and performed two prostrations.",
      "usc_msa_ref": "",
      "chain": [
        "30479",
        "11060",
        "11051",
        "11017",
        "16"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-1904",
      "hadith_no": "1904",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا هناد بن السري، ومنجاب بن الحارث التميمي، جميعا عن علي بن مسهر، عن الأعمش، بهذا الإسناد ‏.‏ وزاد هناد في روايته قال لي رسول الله صلى الله عليه وسلم وهو على المنبر ‏\"‏ اقرأ على ‏\"‏ ‏.‏",
      "text_en": " Ibrahim reported that the Apostle of Allah (may peace be upon him) asked 'Abdullah b. Mas'ud to recite to him (the Qur'an). He said:                      Should I recite it to you while it has been sent down or revealed to you? He (the Holy Prophet) said: I love to hear it from someone else. So he ('Abdullah b. Mas'ud) recited to him (from the beginning of Surat al Nisa' up to the verse:\" How shall then it be when We bring from every people a witness and bring you as a witness against them?\" He (the Holy Prophet) wept (on listening to it). It is narrated on the authority of Ibn Mas'ud through another chain of transmitters that the Apostle of Allah (may peace be upon him) also said that he had been a witness to his people as long as (said he): I lived among them or I had been among them.",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "30479",
        "20345"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-1916",
      "hadith_no": "1916",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا منجاب بن الحارث التميمي، أخبرنا ابن مسهر، عن الأعمش، عن إبراهيم، عن عبد الرحمن بن يزيد، عن علقمة بن قيس، عن أبي مسعود الأنصاري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من قرأ هاتين الآيتين من آخر سورة البقرة في ليلة كفتاه ‏\"‏ ‏.‏ قال عبد الرحمن فلقيت أبا مسعود وهو يطوف بالبيت فسألته فحدثني به عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " A hadith like this has been narrated by Abu Mas'ud from the Apostle of Allah (may peace be upon him) through another chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30479",
        "11060",
        "11051",
        "20395",
        "11017",
        "402"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-2221",
      "hadith_no": "2221",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثنا عثمان بن أبي شيبة، حدثنا جرير، ح وحدثنا إسحاق بن إبراهيم، أخبرنا عيسى بن يونس، ح وحدثنا منجاب بن الحارث التميمي، أخبرنا علي بن مسهر، ح وحدثنا إسحاق بن إبراهيم، وابن أبي عمر، جميعا عن ابن عيينة، عن الأعمش، بهذا الإسناد ‏.‏ نحوه ‏.‏",
      "text_en": " A hadith like this has been narrated by 'Uyaina on the authority of A'mash with the same chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20028",
        "30123",
        "20347",
        "30479",
        "20345",
        "30123",
        "30421",
        "20005"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-3192",
      "hadith_no": "3192",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا منجاب بن الحارث التميمي، أخبرنا ابن مسهر، عن الأعمش، قال سمعت الحجاج بن يوسف، يقول وهو يخطب على المنبر ألفوا القرآن كما ألفه جبريل السورة التي يذكر فيها البقرة والسورة التي يذكر فيها النساء والسورة التي يذكر فيها آل عمران ‏.‏ قال فلقيت إبراهيم فأخبرته بقوله فسبه وقال حدثني عبد الرحمن بن يزيد أنه كان مع عبد الله بن مسعود فأتى جمرة العقبة فاستبطن الوادي فاستعرضها فرماها من بطن الوادي بسبع حصيات يكبر مع كل حصاة - قال - فقلت يا أبا عبد الرحمن إن الناس يرمونها من فوقها ‏.‏ فقال هذا والذي لا إله غيره مقام الذي أنزلت عليه سورة البقرة ‏.‏",
      "text_en": " A'mash reported:                      I heard Hajjaj b. Yusuf saying as he was delivering sermon on the pulpit: Observe the order of the (Holy) Qur'an which has been observed by Gabriel. (Thus state the surahs in this manner)\" one in which mention has been made of al-Baqara,\"\" one in which mention has been made of women (Surah al-Nisa')\" and then the surah in which mention has been made of the Family of 'Imrin. He (the (narrator) said: I met Ibrahim and informed him about these words of his (the statement of Hajjaj b. Yusuf). He cursed him and said: Abd al-Rahman b. Yazid has narrated to me that when he was in the company of 'Abdullah b. Mas'udd (Allah be pleased with them) he came to Jamrat al-'Aqaba and then entered the heart of the valley and faced towards it (the Jamra) and then flung seven pebbles at it from the heart of the valley pronouncing Takbir with every pebble. I said: Abu 'Abd al-Rahman, people fling pebbles at it (Jamra) from the upper side, whereupon he said: By Him besides Whom there is no god, that is the place (of flinging pebbles of one) upon whom Surah al-Baqara was revealed;",
      "usc_msa_ref": "",
      "chain": [
        "30479",
        "11060",
        "20395"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-6479",
      "hadith_no": "6479",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا منجاب بن الحارث التميمي، وسهل بن عثمان، وعبد الله بن عامر بن، زرارة الحضرمي وسويد بن سعيد والوليد بن شجاع قال سهل ومنجاب أخبرنا وقال، الآخرون حدثنا علي بن مسهر، عن الأعمش، عن إبراهيم، عن علقمة، عن عبد الله، قال لما نزلت هذه الآية ‏{‏ ليس على الذين آمنوا وعملوا الصالحات جناح فيما طعموا إذا ما اتقوا وآمنوا‏}‏ إلى آخر الآية قال لي رسول الله صلى الله عليه وسلم ‏\"‏ قيل لي أنت منهم ‏\"‏ ‏.‏",
      "text_en": " Abdullah reported that when this verse was revealed:                     \" There is no harm on persons who believe and perform good acts, what they had eaten (formerly) when they avoided it (now) and they affirmed their faith\" (v. 93) up to the end. Allah's Messenger (may peace be upon him) said to me: You are one amongst them.",
      "usc_msa_ref": "",
      "chain": [
        "30479",
        "30546",
        "20345",
        "11060",
        "11051",
        "11017",
        "16"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-6806",
      "hadith_no": "6806",
      "source": "Sahih Muslim",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا منجاب بن الحارث التميمي، أخبرنا ابن مسهر، ح وحدثنا إسحاق بن، إبراهيم الحنظلي أخبرنا عيسى بن يونس، كلاهما عن الأعمش، بهذا الإسناد ‏.‏ ولم يذكر في حديث عيسى ‏\"‏ ويتحرى الصدق ويتحرى الكذب ‏\"‏ ‏.‏ وفي حديث ابن مسهر ‏\"‏ حتى يكتبه الله ‏\"‏ ‏.‏",
      "text_en": " This hadith has been reported on the authority of A'mash with the same chain of transmitters and no mention is made in the hadith transmitted on the authority of 'Isa (of these words):                     \" He who endeavours to tell the truth and endeavours to tell a lie,\" and in the hadith transmitted on the authority of Mushir (the words are):\" Until Allah records it\".",
      "usc_msa_ref": "",
      "chain": [
        "30479",
        "30021",
        "20347"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-7306",
      "hadith_no": "7306",
      "source": "Sahih Muslim",
      "chapter": "The Book Giving Description of the Day of Judgement; Paradise and Hell - كتاب صفة القيامة والجنة والنار",
      "chapter_no": "53",
      "text_ar": "حدثنا أبو سعيد الأشج، حدثنا ابن إدريس، ح وحدثنا منجاب بن الحارث التميمي، حدثنا ابن مسهر، ح وحدثنا إسحاق بن إبراهيم، وعلي بن خشرم، قالا أخبرنا عيسى، بن يونس ح وحدثنا ابن أبي عمر، حدثنا سفيان، كلهم عن الأعمش، بهذا الإسناد ‏.‏ نحوه ‏.‏ وزاد منجاب في روايته عن ابن مسهر قال الأعمش وحدثني عمرو بن مرة عن شقيق عن عبد الله مثله ‏.‏",
      "text_en": " This hadith has been narrated on the authority of 'Abdullah through other chains of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30200",
        "20102",
        "30479",
        "30123",
        "30556",
        "20347",
        "30421",
        "11060",
        "11381"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    }
  ],
  "total_hadiths": 15,
  "grade_display": {
    "en": "3rd Century AH [10th Generation]",
    "ar": "القرن الثالث الهجري [الجيل العاشر]",
    "ckb": "سەدەی سێیەمی كۆچی [نەوەی دەیەم]"
  }
}