{
  "id": "30485",
  "name": "Ahmed bin 'Amr bin al-Sarh أحمد بن عمرو بن السرح أبو الطاهر",
  "full_name": "Ahmed bin 'Amr bin al-Sarh أحمد بن عمرو  بن السرح أبو الطاهر",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "250",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Egypt"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  د  س  ق  -  ثقة ]"
    ],
    "tags": [
      "al-Masri",
      "Client",
      "B. Umayya"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20029",
      "name": "'Abdullah bin Wahb عبد الله بن وهب بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20002",
      "name": "Imam Shafi'ee ابو عبد الله محمد بن إدريس الشافعي",
      "grade": "Succ. (Taba' Tabi') [9th generation] [Shafi'ee]"
    },
    {
      "id": "20733",
      "name": "al-Walid bin Muslim al-Quraishi الوليد بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "28156",
      "name": "Khalid bin Nzar خالد بن نزار",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30411",
      "name": "'Abdullah bin Nafi' al-Sa'agh عبد الله بن نافع الصائغ المخزومي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20413",
      "name": "Bashr bin Bakr al-Tunisi بشر بن بكر التنيسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "26027",
      "name": "'Abdur Rahman bin 'Abdul Hameed bin Salm عبد الرحمن بن عبد الحميد بن سالم",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]"
    },
    {
      "id": "30006",
      "name": "Imam Nasa'i أحمد بن شعيب بن علي بن سنان النسائي",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30004",
      "name": "Ibn Maja ابن ماجة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30554",
      "name": "Abu Zara' al-Razi أبو زرعة الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-muslim-232-3",
      "hadith_no": "232",
      "source": "Sahih Muslim",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثني أبو الطاهر، ويونس بن عبد الأعلى، قالا أخبرنا عبد الله بن وهب، عن عمرو بن الحارث، أن الحكيم بن عبد الله القرشي، حدثه أن نافع بن جبير وعبد الله بن أبي سلمة حدثاه أن معاذ بن عبد الرحمن حدثهما عن حمران، مولى عثمان بن عفان عن عثمان بن عفان، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من توضأ للصلاة فأسبغ الوضوء ثم مشى إلى الصلاة المكتوبة فصلاها مع الناس أو مع الجماعة أو في المسجد غفر الله له ذنوبه ‏\"‏ ‏.‏",
      "text_en": " Humran, the freed slave of 'Uthman b. 'Affan, reported on the authority of 'Uthman b. 'Affan that he heard Allah's Messenger (may peace be upon him) say:                      He who performed ablution for prayer and performed it properly and then went (to observe) obligatory prayer and offered it along with people or with the congregation or in the mosque, Allah would pardon his sins.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "30493",
        "20029",
        "20377",
        "11059",
        "10929",
        "11421",
        "4"
      ]
    },
    {
      "id": "sunan-abi-daud-102",
      "hadith_no": "102",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن عمرو بن السرح، حدثنا ابن وهب، عن الدراوردي، قال وذكر ربيعة أن تفسير، حديث النبي صلى الله عليه وسلم ‏\"‏ لا وضوء لمن لم يذكر اسم الله عليه ‏\"‏ ‏.‏ أنه الذي يتوضأ ويغتسل ولا ينوي وضوءا للصلاة ولا غسلا للجنابة ‏.‏",
      "text_en": " Explaining the tradition of the Prophet (ﷺ) that the ablution of a person who does not mention the name of Allah is valid, Rabi’ah said:                      This tradition means that if a person performs ablution and takes a bath but does not have the intention to perform ablution for prayer and purify himself from sexual defilement, his ablution or bath is not valid.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "20167",
        "11162"
      ]
    },
    {
      "id": "sunan-abi-daud-105",
      "hadith_no": "105",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن عمرو بن السرح، ومحمد بن سلمة المرادي، قالا حدثنا ابن وهب، عن معاوية بن صالح، عن أبي مريم، قال سمعت أبا هريرة، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إذا استيقظ أحدكم من نومه فلا يدخل يده في الإناء حتى يغسلها ثلاث مرات فإن أحدكم لا يدري أين باتت يده أو أين كانت تطوف يده ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported :                      I heard the Messenger of Allah (May Peace be upon him) say: When any of you wakes up from sleep, he should not put his hand in the utensil until he washes it three times, for none of you knows where his hand remained during the night or where it went round.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "30491",
        "20029",
        "20675",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-120",
      "hadith_no": "120",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن عمرو بن السرح، حدثنا ابن وهب، عن عمرو بن الحارث، أن حبان بن واسع، حدثه أن أباه حدثه أنه، سمع عبد الله بن زيد بن عاصم المازني، يذكر أنه رأى رسول الله صلى الله عليه وسلم فذكر وضوءه وقال ومسح رأسه بماء غير فضل يديه وغسل رجليه حتى أنقاهما ‏.‏",
      "text_en": " Habban b. Wasi’ reported on the authority of his father who heard ‘Abd Allah b. Zaid al-Asim al-Mazini say that he saw the Messenger of Allah (ﷺ) performing ablution. He then described his ablution saying:                      He wiped his head with water which was not what was left over after washing his hands (i.e. he wiped his head with clean water); then he washed his feet until he cleansed them.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "20377",
        "10854"
      ]
    },
    {
      "id": "sunan-abi-daud-193",
      "hadith_no": "193",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن عمرو بن السرح، حدثنا عبد الملك بن أبي كريمة، - قال ابن السرح ابن أبي كريمة من خيار المسلمين - قال حدثني عبيد بن ثمامة المرادي، قال قدم علينا مصر عبد الله بن الحارث بن جزء من أصحاب النبي صلى الله عليه وسلم فسمعته يحدث في مسجد مصر قال لقد رأيتني سابع سبعة أو سادس ستة مع رسول الله صلى الله عليه وسلم في دار رجل فمر بلال فناداه بالصلاة فخرجنا فمررنا برجل وبرمته على النار فقال له رسول الله صلى الله عليه وسلم ‏\"‏ أطابت برمتك ‏\"‏ ‏.‏ قال نعم بأبي أنت وأمي ‏.‏ فتناول منها بضعة فلم يزل يعلكها حتى أحرم بالصلاة وأنا أنظر إليه ‏.‏",
      "text_en": " Narrated Abdullah ibn Harith ibn Jaz':                     One of the Companions of the Prophet (may peace be upon), came upon us in Egypt. When he was narrating traditions in the Mosque of Egypt, I heard him say: I was the seventh or the sixth person in the company of the Messenger of Allah ( peace be upon him) in the house of a person.  In the meantime Bilal came and called him for prayer. He came out and passed by a person who had his fire-pan on the fire. The Messenger of Allah (ﷺ) said to him: Has the food in the fire-pan been cooked?  He replied: Yes, my parents be sacrificed upon you. He then took a piece out of it and continued to chew it until he uttered the first takbir (AllahuAkbar)  of the prayer. All this time I was looking at him.",
      "usc_msa_ref": "",
      "chain": [
        "30485"
      ]
    },
    {
      "id": "sunan-abi-daud-251",
      "hadith_no": "251",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا زهير بن حرب، وابن السرح، قالا حدثنا سفيان بن عيينة، عن أيوب بن موسى، عن سعيد بن أبي سعيد، عن عبد الله بن رافع، مولى أم سلمة عن أم سلمة، أن امرأة، من المسلمين - وقال زهير إنها - قالت يا رسول الله إني امرأة أشد ضفر رأسي أفأنقضه للجنابة قال ‏\"‏ إنما يكفيك أن تحفني عليه ثلاثا ‏\"‏ ‏.‏ وقال زهير ‏\"‏ تحثي عليه ثلاث حثياث من ماء ثم تفيضي على سائر جسدك فإذا أنت قد طهرت ‏\"‏ ‏.‏",
      "text_en": " Umm Salamah said:                      one of the Muslims asked, and Zubair reported: Umm Salamah (herself) asked: Messenger of Allah. I am a women who keeps her hair closely plaited; should I undo it when I wash after sexual defilement? He replied (no), it is enough for you to throw three handfuls over it. Then pour water over all your body and will be purified.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "30485",
        "20005",
        "11241",
        "11168",
        "11864",
        "56"
      ]
    },
    {
      "id": "sunan-abi-daud-252",
      "hadith_no": "252",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن عمرو بن السرح، حدثنا ابن نافع، - يعني الصائغ - عن أسامة، عن المقبري، عن أم سلمة، أن امرأة، جاءت إلى أم سلمة بهذا الحديث ‏.‏ قالت فسألت لها النبي صلى الله عليه وسلم بمعناه قال فيه ‏\"‏ واغمزي قرونك عند كل حفنة ‏\"‏ ‏.‏",
      "text_en": " Umm Salamah said:                      A women came to her, this is according to the version of the former tradition. I asked the Prophet (May peace be upon him) a similar question (as in the former tradition). But this version adds: “And wring out your locks after every handful of water”.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "50",
        "11168",
        "56"
      ]
    },
    {
      "id": "sunan-abi-daud-380",
      "hadith_no": "380",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن عمرو بن السرح، وابن، عبدة - في آخرين وهذا لفظ ابن عبدة - أخبرنا سفيان، عن الزهري، عن سعيد بن المسيب، عن أبي هريرة، أن أعرابيا، دخل المسجد ورسول الله صلى الله عليه وسلم جالس فصلى - قال ابن عبدة - ركعتين ثم قال اللهم ارحمني ومحمدا ولا ترحم معنا أحدا ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ لقد تحجرت واسعا ‏\"‏ ‏.‏ ثم لم يلبث أن بال في ناحية المسجد فأسرع الناس إليه فنهاهم النبي صلى الله عليه وسلم وقال ‏\"‏ إنما بعثتم ميسرين ولم تبعثوا معسرين صبوا عليه سجلا من ماء ‏\"‏ ‏.‏ أو قال ‏\"‏ ذنوبا من ماء ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported:                      A bedouin entered the\tmosque while the Messenger of Allah (ﷺ) was sitting. He offered two rak'ahs of prayer, according to the version of Ibn 'Abdah. He then said: O Allah, have mercy on me and on Muhammad and do not have mercy on anyone along with us. The Prophet (ﷺ) said: You have narrowed down (a thing) that was broader. After a short while he passed a water in the corner of the mosque. The people rushed towards him. The Prophet (ﷺ) prevented them and said: You have been sent to facilitate and not create difficulties. Pour a bucket of water upon it.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20005",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-524",
      "hadith_no": "524",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا ابن السرح، ومحمد بن سلمة، قالا حدثنا ابن وهب، عن حيى، عن أبي عبد الرحمن، - يعني الحبلي - عن عبد الله بن عمرو، أن رجلا، قال يا رسول الله إن المؤذنين يفضلوننا ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ قل كما يقولون فإذا انتهيت فسل تعطه ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     A man said: Messenger of Allah, the mu'adhdhins excel us. The Messenger of Allah (ﷺ) said: Say (the same words) as they say, and when you come to the end, make a petition and that will be granted to you.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20672",
        "20029",
        "10938",
        "29"
      ]
    },
    {
      "id": "sunan-abi-daud-695",
      "hadith_no": "695",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن الصباح بن سفيان، أخبرنا سفيان، ح وحدثنا عثمان بن أبي شيبة، وحامد بن يحيى، وابن السرح، قالوا حدثنا سفيان، عن صفوان بن سليم، عن نافع بن جبير، عن سهل بن أبي حثمة، يبلغ به النبي صلى الله عليه وسلم قال ‏\"‏ إذا صلى أحدكم إلى سترة فليدن منها لا يقطع الشيطان عليه صلاته ‏\"‏ ‏.‏ قال أبو داود رواه واقد بن محمد عن صفوان عن محمد بن سهل عن أبيه أو عن محمد بن سهل عن النبي صلى الله عليه وسلم قال بعضهم عن نافع بن جبير عن سهل بن سعد واختلف في إسناده ‏.‏",
      "text_en": " Narrated Sahl ibn AbuHathmah:                     The Prophet (ﷺ) said: When one of you prays facing a sutrah he should keep close to it, and not let the devil interrupt his prayer.Abu Dawud said: This tradition has also been narrated by Waqid b. Muhammad from Safwan from Muhammad b. Sahl on the authority of his father, or on the authority of Muhammad b. Sahl from the Prophet (ﷺ). Some have narrated it from Nafi' b. Jubair on the authority of Sahl b. Sa'd. There is a variation in the chain of its narrators.",
      "usc_msa_ref": "",
      "chain": [
        "30269",
        "20005",
        "30203",
        "30485",
        "20005",
        "11177",
        "11059"
      ]
    },
    {
      "id": "sunan-abi-daud-788",
      "hadith_no": "788",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة بن سعيد، وأحمد بن محمد المروزي، وابن السرح، قالوا حدثنا سفيان، عن عمرو، عن سعيد بن جبير، - قال قتيبة فيه - عن ابن عباس، قال كان النبي صلى الله عليه وسلم لا يعرف فصل السورة حتى تنزل عليه ‏{‏ بسم الله الرحمن الرحيم ‏}‏ ‏.‏ وهذا لفظ ابن السرح ‏.‏",
      "text_en": " Ibn Abbas said:                      The prophet (ﷺ) did not distinguish between the two surahs until the words “In the name of Allah, the Compassionate, the merciful” was revealed to him. These are the words of Ibn al-sarh.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "30304",
        "30485",
        "20005",
        "11081",
        "11050",
        "17"
      ]
    },
    {
      "id": "sunan-abi-daud-822",
      "hadith_no": "822",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة بن سعيد، وابن السرح، قالا حدثنا سفيان، عن الزهري، عن محمود بن الربيع، عن عبادة بن الصامت، يبلغ به النبي صلى الله عليه وسلم قال ‏\"‏ لا صلاة لمن لم يقرأ بفاتحة الكتاب فصاعدا ‏\"‏ ‏.‏ قال سفيان لمن يصلي وحده ‏.‏",
      "text_en": " 'Ubadah b. al-Samit reported the Messenger of Allah (ﷺ) as saying :                      the prayer is not valid I one does not recite fatihat al-kitab and something more, sufyan( the narrator) said: This applies to a man who prays alone.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "30485",
        "20005",
        "11013",
        "5278"
      ]
    },
    {
      "id": "sunan-abi-daud-827",
      "hadith_no": "827",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، وأحمد بن محمد المروزي، ومحمد بن أحمد بن أبي خلف، وعبد الله بن محمد الزهري، وابن السرح، قالوا حدثنا سفيان، عن الزهري، سمعت ابن أكيمة، يحدث سعيد بن المسيب قال سمعت أبا هريرة، يقول صلى بنا رسول الله صلى الله عليه وسلم صلاة نظن أنها الصبح بمعناه إلى قوله ‏\"‏ ما لي أنازع القرآن ‏\"‏ ‏.‏ قال أبو داود قال مسدد في حديثه قال معمر فانتهى الناس عن القراءة فيما جهر به رسول الله صلى الله عليه وسلم وقال ابن السرح في حديثه قال معمر عن الزهري قال أبو هريرة فانتهى الناس ‏.‏ وقال عبد الله بن محمد الزهري من بينهم قال سفيان وتكلم الزهري بكلمة لم أسمعها فقال معمر إنه قال فانتهى الناس ‏.‏ قال أبو داود ورواه عبد الرحمن بن إسحاق عن الزهري وانتهى حديثه إلى قوله ‏\"‏ ما لي أنازع القرآن ‏\"‏ ‏.‏ ورواه الأوزاعي عن الزهري قال فيه قال الزهري فاتعظ المسلمون بذلك فلم يكونوا يقرءون معه فيما يجهر به صلى الله عليه وسلم ‏.‏ قال أبو داود سمعت محمد بن يحيى بن فارس قال قوله فانتهى الناس ‏.‏ من كلام الزهري ‏.‏",
      "text_en": " Abu Hurairah said:                      The Messenger of Allah(May peace be upon him) led us in prayer, that was, we think, the dawn prayer, He further narrated this tradition up to the words “what is the matter with me that I have been contended with in (the recitation of ) the Qur’an.”Abu Dawud said: Musaddad in his tradition said that Ma’mar said: The people ceased to recit (the Qur’an) at the prayer in which the Messenger of Allah(May peace be upon him) recited aloud. Ibn al-Sarh said in his version that Ma’mar reported from al-Zuhrl on the authority of Ab Hurairah. Then the people ceased (to recite behind the imam).Another version says: Sufyan said: Al-Zuhrl spoke a word that I could not hear. Then Ma’mar said; He said: Then people ceased (to recite the Qur’an)Abu Dawud said: This tradition has been narrated by ‘Abd al-Raman b. Ishaq on the authority of al-Zuhrl. This version ends at the words: “What is the matter with me that I am contended with in (the recitation of ) the Qur’an. Al-Awza’ I also narrated it on the authority of al-Zuhri. This version has: Al-Zuhrl said: The Muslims took lesson from that and thenceforth they did not recite (the Qur’an) at the prayer in which he (the Prophet) recited a loud.Abu Dawud said: I heard Muhammad b. Yaya b. Faris say: The words “ the people ceased to recite (the Qur’an)” is a statement of al-zuhri.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "30304",
        "30560",
        "30485",
        "20005",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-847",
      "hadith_no": "847",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مؤمل بن الفضل الحراني، حدثنا الوليد، ح وحدثنا محمود بن خالد، حدثنا أبو مسهر، ح وحدثنا ابن السرح، حدثنا بشر بن بكر، ح وحدثنا محمد بن مصعب، حدثنا عبد الله بن يوسف، كلهم عن سعيد بن عبد العزيز، عن عطية بن قيس، عن قزعة بن يحيى، عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم كان يقول حين يقول سمع الله لمن حمده ‏\"‏ اللهم ربنا لك الحمد ملء السماء ‏\"‏ ‏.‏ قال مؤمل ملء السموات وملء الأرض وملء ما شئت من شىء بعد أهل الثناء والمجد أحق ما قال العبد وكلنا لك عبد لا مانع لما أعطيت ‏\"‏ ‏.‏ زاد محمود ‏\"‏ ولا معطي لما منعت ‏\"‏ ‏.‏ ثم اتفقوا - ‏\"‏ ولا ينفع ذا الجد منك الجد ‏\"‏ ‏.‏ قال بشر ‏\"‏ ربنا لك الحمد ‏\"‏ ‏.‏ لم يقل محمود ‏\"‏ اللهم ‏\"‏ ‏.‏ قال ‏\"‏ ربنا ولك الحمد ‏\"‏ ‏.‏",
      "text_en": " Abu sa’id al-Khuri said:                      When the Messenger of Allah (ﷺ) said: “ Allah listens to him who praises Him,” he also said: O Allah, our Lord, to thee be the praise in all heavens. Mu’ammil said( in his version); “ In all the heavens, and in all the earth, and in all that it pleases Thee to create afterwards. O thou Who art worthy of praise and glory, most worthy of what a servant says, and we are all thy servants, no one can withhold what thou givest or give what Thou withholdest. “The narrators then were agreed on the words: “And riches cannot avail a wealthy person with Thee.”",
      "usc_msa_ref": "",
      "chain": [
        "38659",
        "20733",
        "37534",
        "30284",
        "30485",
        "20413",
        "28536",
        "30355",
        "20638",
        "10877",
        "11302",
        "38"
      ]
    },
    {
      "id": "sunan-abi-daud-875",
      "hadith_no": "875",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن صالح، وأحمد بن عمرو بن السرح، ومحمد بن سلمة، قالوا حدثنا ابن وهب، أخبرنا عمرو، - يعني ابن الحارث - عن عمارة بن غزية، عن سمى، مولى أبي بكر أنه سمع أبا صالح، ذكوان يحدث عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أقرب ما يكون العبد من ربه وهو ساجد فأكثروا الدعاء ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the Messenger of Allah (ﷺ) as saying:                      The nearest a servant come to his Lord is when he is prostrating himself, so make supplication often.",
      "usc_msa_ref": "",
      "chain": [
        "30226",
        "30485",
        "20672",
        "20029",
        "20377",
        "11894",
        "11161",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-979",
      "hadith_no": "979",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا القعنبي، عن مالك، ح وحدثنا ابن السرح، أخبرنا ابن وهب، أخبرني مالك، عن عبد الله بن أبي بكر بن محمد بن عمرو بن حزم، عن أبيه، عن عمرو بن سليم الزرقي، أنه قال أخبرني أبو حميد الساعدي، أنهم قالوا يا رسول الله كيف نصلي عليك قال ‏\"‏ قولوا اللهم صل على محمد وأزواجه وذريته كما صليت على آل إبراهيم وبارك على محمد وأزواجه وذريته كما باركت على آل إبراهيم إنك حميد مجيد ‏\"‏ ‏.‏",
      "text_en": " Abu Humaid al-Said said:                      Some people asked: Messenger of Allah, how should we invoke blessings on you? He said: Say,” O Allah, bless Muhammad, his wives and his off springs, as Thou didst bless Abraham’s family, and grant favours to Muhammad’s family, his wives and off springs, as Thou didst grant favours to Abraham’s family. Thou art indeed praiseworthy and glorious.",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "20001",
        "30485",
        "20029",
        "20001",
        "11104",
        "11239",
        "1544",
        "1457"
      ]
    },
    {
      "id": "sunan-abi-daud-1103",
      "hadith_no": "1103",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا ابن السرح، حدثنا ابن وهب، أخبرني يحيى بن أيوب، عن يحيى بن سعيد، عن عمرة، عن أخت، لعمرة بنت عبد الرحمن كانت أكبر منها بمعناه ‏.‏",
      "text_en": " This tradition has also been transmitted to the same effect through a different chain of narrators by 'Umrah from her sister 'Umrah daughter of 'Abd al-Rahman who was older than her.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "20379",
        "11062",
        "11455"
      ]
    },
    {
      "id": "sunan-abi-daud-1150",
      "hadith_no": "1150",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا ابن السرح، أخبرنا ابن وهب، أخبرني ابن لهيعة، عن خالد بن يزيد، عن ابن شهاب، بإسناده ومعناه قال سوى تكبيرتى الركوع ‏.‏",
      "text_en": " The above mentioned tradition has also been narrated by Ibn Shihab through a different chain of transmitters to the same effect. This version adds:                      \"Except the two takers pronounced at the time of the bowing.\"",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "20624",
        "11408"
      ]
    },
    {
      "id": "sunan-abi-daud-1162",
      "hadith_no": "1162",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Book Of The Prayer For Rain (Kitab al-Istisqa') - كتاب الاستسقاء",
      "chapter_no": "3",
      "text_ar": "حدثنا ابن السرح، وسليمان بن داود، قالا أخبرنا ابن وهب، قال أخبرني ابن أبي ذئب، ويونس، عن ابن شهاب، قال أخبرني عباد بن تميم المازني، أنه سمع عمه، - وكان من أصحاب رسول الله صلى الله عليه وسلم يقول خرج رسول الله صلى الله عليه وسلم يوما يستسقي فحول إلى الناس ظهره يدعو الله عز وجل - قال سليمان بن داود واستقبل القبلة وحول رداءه ثم صلى ركعتين - قال ابن أبي ذئب - وقرأ فيهما زاد ابن السرح يريد الجهر ‏.‏",
      "text_en": " Abbad b. Tamim al Mazini said on the authority of his uncle (Abd Allah b. Zaid b Asim) who was a Companion of the Messenger of Allah (ﷺ):                      One day the Messenger of Allah (ﷺ) went out to make supplication for rain.  He turned his back towards the people praying to Allah, the Exalted.  The narrator Sulaiman b. Dawud said: He faced the qiblah and turned around his cloak and then offered two rak'ahs of prayer.  The narrator Ibn Abi Dhi'b said: He recited from the Qur'an in both of them.  The version of Ibn al-Sarh adds: By it he means in a loud voice.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "30584",
        "20029",
        "20177",
        "20475",
        "11013",
        "639",
        "605"
      ]
    },
    {
      "id": "sunan-abi-daud-1180",
      "hadith_no": "1180",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Book Of The Prayer For Rain (Kitab al-Istisqa') - كتاب الاستسقاء",
      "chapter_no": "3",
      "text_ar": "حدثنا ابن السرح، أخبرنا ابن وهب، ح وحدثنا محمد بن سلمة المرادي، حدثنا ابن وهب، عن يونس، عن ابن شهاب، أخبرني عروة بن الزبير، عن عائشة، زوج النبي صلى الله عليه وسلم قالت خسفت الشمس في حياة رسول الله صلى الله عليه وسلم فخرج رسول الله صلى الله عليه وسلم إلى المسجد فقام فكبر وصف الناس وراءه فاقترأ رسول الله صلى الله عليه وسلم قراءة طويلة ثم كبر فركع ركوعا طويلا ثم رفع رأسه فقال ‏\"‏ سمع الله لمن حمده ربنا ولك الحمد ‏\"‏ ‏.‏ ثم قام فاقترأ قراءة طويلة هي أدنى من القراءة الأولى ثم كبر فركع ركوعا طويلا هو أدنى من الركوع الأول ثم قال ‏\"‏ سمع الله لمن حمده ربنا ولك الحمد ‏\"‏ ‏.‏ ثم فعل في الركعة الأخرى مثل ذلك فاستكمل أربع ركعات وأربع سجدات وانجلت الشمس قبل أن ينصرف ‏.‏",
      "text_en": " Narrated A'ishah (May Allah be pleased with her):                     There was an eclipse of the sun during the lifetime of the Messenger of Allah (ﷺ)came tot he mosque; he stood up and uttered the takbir (Allah is great); the people stood in rows behind him; the Messenger of Allah (ﷺ) recited from the Quran for a long time; then he uttered the takbir (Allah is most great) and performed bowing for a long time, then he raised his head and said: Allah listens to him who praises Him; our Lord, and to Thee be praise; then he stood up and recited from the Qur'an for a long time, but it was less than the first (recitation); he then bowed for a long time, but it was less than the first bowing; he then said, Allah listens to him who praises Him; our Lord, and to Thee be praise.  he then did so in the second rak'ah.  he thus completed four bowings and four prostrations.  The sun had become bright before he departed.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "30491",
        "20029",
        "20475",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-1290",
      "hadith_no": "1290",
      "source": "Sunan Abi Da'ud",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا أحمد بن صالح، وأحمد بن عمرو بن السرح، قالا حدثنا ابن وهب، حدثني عياض بن عبد الله، عن مخرمة بن سليمان، عن كريب، مولى ابن عباس عن أم هانئ بنت أبي طالب، أن رسول الله صلى الله عليه وسلم يوم الفتح صلى سبحة الضحى ثماني ركعات يسلم من كل ركعتين ‏.‏ قال أبو داود قال أحمد بن صالح إن رسول الله صلى الله عليه وسلم يوم الفتح صلى سبحة الضحى فذكر مثله ‏.‏ قال ابن السرح إن أم هانئ قالت دخل على رسول الله صلى الله عليه وسلم ولم يذكر سبحة الضحى بمعناه ‏.‏",
      "text_en": " Narrated Umm Hani ibn AbuTalib:                     The Messenger of Allah (ﷺ) prayed on the day of the Conquest (of Mecca) eight rak'ahs saluting after every two rak'ahs.Abu Dawud said: Ahmad b. Salih said that the Messenger of Allah offered prayer in the forenoon on the day of the Conquest of Mecca, and he narrated something similar. Ibn al-Sarh reported that Umm Hani said: The Messenger of Allah (ﷺ) entered upon me. This version does not mention the prayer in the forenoon.",
      "usc_msa_ref": "",
      "chain": [
        "30226",
        "30485",
        "20029",
        "20514",
        "11223",
        "11211",
        "198"
      ]
    },
    {
      "id": "sunan-abi-daud-1402",
      "hadith_no": "1402",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prostration while reciting the Qur'an - كتاب سجود القرآن",
      "chapter_no": "7",
      "text_ar": "حدثنا أحمد بن عمرو بن السرح، أخبرنا ابن وهب، أخبرني ابن لهيعة، أن مشرح بن هاعان أبا المصعب، حدثه أن عقبة بن عامر حدثه قال قلت لرسول الله صلى الله عليه وسلم أفي سورة الحج سجدتان قال ‏\"‏ نعم ومن لم يسجدهما فلا يقرأهما ‏\"‏ ‏.‏",
      "text_en": " Narrated Uqbah ibn Amir:                     I said to the Messenger of Allah (ﷺ): Are there two prostrations in Surah al-Hajj? He replied: Yes; if anyone does not make two prostrations, he should not recite them.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "20624",
        "16099",
        "189"
      ]
    },
    {
      "id": "sunan-abi-daud-1405",
      "hadith_no": "1405",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prostration while reciting the Qur'an - كتاب سجود القرآن",
      "chapter_no": "7",
      "text_ar": "حدثنا ابن السرح، أخبرنا ابن وهب، حدثنا أبو صخر، عن ابن قسيط، عن خارجة بن زيد بن ثابت، عن أبيه، عن النبي صلى الله عليه وسلم بمعناه ‏.‏ قال أبو داود كان زيد الإمام فلم يسجد فيها ‏.‏",
      "text_en": " This tradition has also been transmitted by Zaid b. Thabit through a different chain of narrators to the same effect.Abu Dawud said:                      Zaid was imam (in a prayer) and he did not make prostration.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "11236",
        "11006",
        "49"
      ]
    },
    {
      "id": "sunan-abi-daud-1453",
      "hadith_no": "1453",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا أحمد بن عمرو بن السرح، أخبرنا ابن وهب، أخبرني يحيى بن أيوب، عن زبان بن فائد، عن سهل بن معاذ الجهني، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من قرأ القرآن وعمل بما فيه ألبس والداه تاجا يوم القيامة ضوؤه أحسن من ضوء الشمس في بيوت الدنيا لو كانت فيكم فما ظنكم بالذي عمل بهذا ‏\"‏ ‏.‏",
      "text_en": " Mu'adh al-Juhani reported the Messenger of Allah (ﷺ) as saying:                      If anyone recites the Qur'an and acts according to its content, on the Day of Judgement his parents will be given to wear a crown whose light is better than the light of the sun in the dwellings of this world if it were among you. So what do you think of him who acts according to this ?",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "20379",
        "16031",
        "16045",
        "5296"
      ]
    },
    {
      "id": "sunan-abi-daud-1462",
      "hadith_no": "1462",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا أحمد بن عمرو بن السرح، أخبرنا ابن وهب، أخبرني معاوية، عن العلاء بن الحارث، عن القاسم، مولى معاوية عن عقبة بن عامر، قال كنت أقود برسول الله صلى الله عليه وسلم ناقته في السفر فقال لي ‏\"‏ يا عقبة ألا أعلمك خير سورتين قرئتا ‏\"‏ ‏.‏ فعلمني ‏{‏ قل أعوذ برب الفلق ‏}‏ و ‏{‏ قل أعوذ برب الناس ‏}‏ قال فلم يرني سررت بهما جدا فلما نزل لصلاة الصبح صلى بهما صلاة الصبح للناس فلما فرغ رسول الله صلى الله عليه وسلم من الصلاة التفت إلى فقال ‏\"‏ يا عقبة كيف رأيت ‏\"‏ ‏.‏",
      "text_en": " Narrated Uqbah ibn Amir:                     I was driving the she-camel of the Messenger of Allah (ﷺ) during a journey. He said to me: Uqbah, should I not teach you two best surahs ever recited? He then taught me: \"Say, I seek refuge in the Lord of the dawn,\" and \"Say, I seek refuge in the Lord of men.\" He did not see me much pleased (by these two surahs). When he alighted for prayer, he led the people in the morning prayer and recited them in prayer. When the Messenger of Allah (ﷺ) finished his prayer, he turned to me and said: O Uqbah, how did you see.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "27",
        "10884",
        "189"
      ]
    },
    {
      "id": "sunan-abi-daud-1535",
      "hadith_no": "1535",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا أحمد بن عمرو بن السرح، حدثنا ابن وهب، حدثني عبد الرحمن بن زياد، عن أبي عبد الرحمن، عن عبد الله بن عمرو بن العاص، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن أسرع الدعاء إجابة دعوة غائب لغائب ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     The Prophet (ﷺ) said: The supplication which gets the quickest answer is that made by one distant Muslim for another.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "28326",
        "11359",
        "29"
      ]
    },
    {
      "id": "sunan-abi-daud-1557",
      "hadith_no": "1557",
      "source": "Sunan Abi Da'ud",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا ابن السرح، وسليمان بن داود، قالا أخبرنا ابن وهب، أخبرني يونس، عن الزهري، قال قال أبو بكر إن حقه أداء الزكاة وقال عقالا ‏.‏",
      "text_en": " This tradition has also been transmitted by Al Zuhri through a different chain of narrators. This version has “Abu Bakr said its due is the payment of zakat.” He used the word “a rope of a Camel”",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "30584",
        "20029",
        "20475",
        "11013",
        "20436"
      ]
    },
    {
      "id": "sunan-abi-daud-1705",
      "hadith_no": "1705",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Book of Lost and Found Items - كتاب اللقطة",
      "chapter_no": "10",
      "text_ar": "حدثنا ابن السرح، حدثنا ابن وهب، أخبرني مالك، بإسناده ومعناه زاد ‏\"‏ سقاؤها ترد الماء وتأكل الشجر ‏\"‏ ‏.‏ ولم يقل ‏\"‏ خذها ‏\"‏ ‏.‏ في ضالة الشاء وقال في اللقطة ‏\"‏ عرفها سنة فإن جاء صاحبها وإلا فشأنك بها ‏\"‏ ‏.‏ ولم يذكر ‏\"‏ استنفق ‏\"‏ ‏.‏ قال أبو داود رواه الثوري وسليمان بن بلال وحماد بن سلمة عن ربيعة مثله لم يقولوا ‏\"‏ خذها ‏\"‏ ‏.‏",
      "text_en": " The above mentioned tradition has also been transmitted by Malik through a different chain of narrators to the same effect.  This version adds:                      They have their stomachs:  They can go down to water and eat trees.  He did not say about the stray sheep:  take it.  About a find he said : Make it known for a year; if it’s owner comes, (give it to him), otherwise use it yourself.  This version has not the word : “ spend it”.  Abu Dawud said : This tradition has been narrated by al-Thawri, Sulaiman bin Bilal, and Hammad bin Salamah on the authority of Rabi ‘ ah in a similar manner.  They did not mention the word “take it”.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "30002"
      ]
    },
    {
      "id": "sunan-abi-daud-1750",
      "hadith_no": "1750",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا ابن السرح، حدثنا ابن وهب، أخبرني يونس، عن ابن شهاب، عن عمرة بنت عبد الرحمن، عن عائشة، زوج النبي صلى الله عليه وسلم أن رسول الله صلى الله عليه وسلم نحر عن آل محمد في حجة الوداع بقرة واحدة ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     The Messenger of Allah (ﷺ) sacrificed a cow for his wives at the Farewell Pilgrimage.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "20475",
        "11013",
        "11455"
      ]
    },
    {
      "id": "sunan-abi-daud-1780",
      "hadith_no": "1780",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا ابن السرح، أخبرنا ابن وهب، أخبرني مالك، عن أبي الأسود، بإسناده مثله زاد فأما من أهل بعمرة فأحل ‏.‏",
      "text_en": " The aforesaid tradition has also been narrated by Abu al-Aswad through a different chain of narrators. This version adds he who raises his voice in talbiyah for `Umrah (and wearing Ihram for it) should put off Ihram after performing `Umrah.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "20001"
      ]
    },
    {
      "id": "sunan-abi-daud-1894",
      "hadith_no": "1894",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا ابن السرح، والفضل بن يعقوب، - وهذا لفظه - قالا حدثنا سفيان، عن أبي الزبير، عن عبد الله بن باباه، عن جبير بن مطعم، يبلغ به النبي صلى الله عليه وسلم قال ‏\"‏ لا تمنعوا أحدا يطوف بهذا البيت ويصلي أى ساعة شاء من ليل أو نهار ‏\"‏ ‏.‏ قال الفضل إن رسول الله صلى الله عليه وسلم قال ‏\"‏ يا بني عبد مناف لا تمنعوا أحدا ‏\"‏ ‏.‏",
      "text_en": " Narrated Jubayr ibn Mut'im:                     The Prophet (ﷺ) said: Do not prevent anyone from going round this House (the Ka'bah) and from praying any moment he desires by day or by night. The narrator Fadl (ibn Ya'qub) said: The Messenger of Allah (ﷺ) said: Banu Abdu Munaf, do not stop anyone.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "30265",
        "20005",
        "11263",
        "10642"
      ]
    },
    {
      "id": "sunan-abi-daud-1901",
      "hadith_no": "1901",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا القعنبي، عن مالك، عن هشام بن عروة، ح وحدثنا ابن السرح، حدثنا ابن وهب، عن مالك، عن هشام بن عروة، عن أبيه، أنه قال قلت لعائشة زوج النبي صلى الله عليه وسلم وأنا يومئذ حديث السن أرأيت قول الله تعالى ‏{‏ إن الصفا والمروة من شعائر الله ‏}‏ فما أرى على أحد شيئا أن لا يطوف بهما ‏.‏ قالت عائشة كلا لو كان كما تقول كانت فلا جناح عليه أن لا يطوف بهما إنما أنزلت هذه الآية في الأنصار كانوا يهلون لمناة وكانت مناة حذو قديد وكانوا يتحرجون أن يطوفوا بين الصفا والمروة فلما جاء الإسلام سألوا رسول الله صلى الله عليه وسلم عن ذلك فأنزل الله تعالى ‏{‏ إن الصفا والمروة من شعائر الله ‏}‏ ‏.‏",
      "text_en": " ‘Urwa bin Al Zubair said I said to A’ishah, wife of the Prophet(ﷺ) while I was a boy. What do you think about the pronouncement of Allaah, the Exalted “Lo! (The Mountains) Al Safa’ and Al Marwah are among the indications of Allaah. “I think there is no harm for anyone if he does not run between them. A’ishah(may Allah be pleased with her) said Nay, had it been so as you said, it would have been thus. It is no sin on him not to go around them. This verse was revealed about the Ansaar, they used to perform hajj for Manat. Manat was erected in front of Qudaid. Hence they used to avoid going around Al Safa and Al Marwah. When Islam came, they asked the Apostle of Allaah(ﷺ) about it. Allaah, the Exalted therefore revealed the verse “Lo! (The Mountains) Al Safa’ and Al Marwah are among the indications of Allaah.",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "20001",
        "11065",
        "30485",
        "20029",
        "20001",
        "11065",
        "10511"
      ]
    },
    {
      "id": "sunan-abi-daud-1975",
      "hadith_no": "1975",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا عبد الله بن مسلمة القعنبي، عن مالك، ح وحدثنا ابن السرح، أخبرنا ابن وهب، أخبرني مالك، عن عبد الله بن أبي بكر بن محمد بن عمرو بن حزم، عن أبيه، عن أبي البداح بن عاصم، عن أبيه، أن رسول الله صلى الله عليه وسلم رخص لرعاء الإبل في البيتوتة يرمون يوم النحر ثم يرمون الغد ومن بعد الغد بيومين ويرمون يوم النفر ‏.‏",
      "text_en": " Narrated Abu al-Baddah b. 'Asim:                     On the authority of his father 'Asim: The Messenger of Allah (ﷺ) gave permission to the herdsmen of the camels not to pass night at Mina and asked them to throw pebbles on the day of sacrifice, and to throw pebbles at the jamrahs the next day and the following two days, and on the day of their return.",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "20001",
        "30485",
        "20029",
        "20001",
        "11104",
        "11239",
        "19953",
        "1722"
      ]
    },
    {
      "id": "sunan-abi-daud-2030",
      "hadith_no": "2030",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا ابن السرح، وسعيد بن منصور، ومسدد، قالوا حدثنا سفيان، عن منصور الحجبي، حدثني خالي، عن أمي، صفية بنت شيبة قالت سمعت الأسلمية، تقول قلت لعثمان ما قال لك رسول الله صلى الله عليه وسلم حين دعاك قال ‏\"‏ إني نسيت أن آمرك أن تخمر القرنين فإنه ليس ينبغي أن يكون في البيت شىء يشغل المصلي ‏\"‏ ‏.‏ قال ابن السرح خالي مسافع بن شيبة ‏.‏",
      "text_en": " Al-Aslamiyyah said:                      I said to Uthman ibn Talhah al-Hajabi): What did the Messenger of Allah (ﷺ) say to you when he called you? He said: (The Prophet said:) I forgot to order you to cover the two horns (of the lamb), for it is not advisable that there should be anything in the House (the Ka'bah) which diverts the attention of the man at prayer. Ibn as-Sarh said: The name of my maternal uncle is Musafi' ibn Shaybah.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "30116",
        "30175",
        "20005"
      ]
    },
    {
      "id": "sunan-abi-daud-2080",
      "hadith_no": "2080",
      "source": "Sunan Abi Da'ud",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا أحمد بن عمرو بن السرح، حدثنا سفيان، عن الزهري، عن سعيد بن المسيب، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يخطب الرجل على خطبة أخيه ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the Apostle of Allaah(ﷺ) as saying “ A man should not seek the hand of a woman in marriage when his brother has already sought her hand.”",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20005",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-2138",
      "hadith_no": "2138",
      "source": "Sunan Abi Da'ud",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا أحمد بن عمرو بن السرح، أخبرنا ابن وهب، عن يونس، عن ابن شهاب، أن عروة بن الزبير، حدثه أن عائشة زوج النبي صلى الله عليه وسلم قالت كان رسول الله صلى الله عليه وسلم إذا أراد سفرا أقرع بين نسائه فأيتهن خرج سهمها خرج بها معه وكان يقسم لكل امرأة منهن يومها وليلتها غير أن سودة بنت زمعة وهبت يومها لعائشة ‏.‏",
      "text_en": " A’ishah wife of the Prophet (ﷺ) reported “When the Apostle of Allaah(ﷺ) intended to go on a journey he cast lots amongst his wives and the one who was chosen by lot went on it with him. He divided his time, day and night (equally) for each of his wives except that Saudah daughter of Zam’ah gave her day to A’ishah.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "20475",
        "11013",
        "10511"
      ]
    },
    {
      "id": "sunan-abi-daud-2146",
      "hadith_no": "2146",
      "source": "Sunan Abi Da'ud",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا أحمد بن أبي خلف، وأحمد بن عمرو بن السرح، قالا حدثنا سفيان، عن الزهري، عن عبد الله بن عبد الله، - قال ابن السرح عبيد الله بن عبد الله - عن إياس بن عبد الله بن أبي ذباب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تضربوا إماء الله ‏\"‏ ‏.‏ فجاء عمر إلى رسول الله صلى الله عليه وسلم فقال ذئرن النساء على أزواجهن ‏.‏ فرخص في ضربهن فأطاف بآل رسول الله صلى الله عليه وسلم نساء كثير يشكون أزواجهن فقال النبي صلى الله عليه وسلم ‏\"‏ لقد طاف بآل محمد نساء كثير يشكون أزواجهن ليس أولئك بخياركم ‏\"‏ ‏.‏",
      "text_en": " Iyas ibn Abdullah ibn Abu Dhubab reported the Messenger of Allah (ﷺ) as saying:                      Do not beat Allah's handmaidens, but when Umar came to the Messenger of Allah (ﷺ) and said: Women have become emboldened towards their husbands, he (the Prophet) gave permission to beat them. Then many women came round the family of the Messenger of Allah (ﷺ) complaining against their husbands. So the Messenger of Allah (ﷺ) said: Many women have gone round Muhammad's family complaining against their husbands. They are not the best among you.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20005",
        "11013",
        "4078"
      ]
    },
    {
      "id": "sunan-abi-daud-2192",
      "hadith_no": "2192",
      "source": "Sunan Abi Da'ud",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا ابن السرح، حدثنا ابن وهب، عن يحيى بن عبد الله بن سالم، عن عبد الرحمن بن الحارث المخزومي، عن عمرو بن شعيب، عن أبيه، عن جده، أن النبي صلى الله عليه وسلم قال في هذا الخبر زاد ‏\"‏ ولا نذر إلا فيما ابتغي به وجه الله تعالى ذكره ‏\"‏ ‏.‏",
      "text_en": " The above tradition has also been transmitted by ‘Amr bin Shu’aib through a different chain of narrators. This version adds The Prophet (ﷺ) said “There is no vow except in an act which seeks the pleasure of Allah, the Exalted.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "19934",
        "19911"
      ]
    },
    {
      "id": "sunan-abi-daud-2202",
      "hadith_no": "2202",
      "source": "Sunan Abi Da'ud",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا أحمد بن عمرو بن السرح، وسليمان بن داود، قالا أخبرنا ابن وهب، أخبرني يونس، عن ابن شهاب، أخبرني عبد الرحمن بن عبد الله بن كعب بن مالك، أن عبد الله بن كعب، - وكان قائد كعب من بنيه حين عمي - قال سمعت كعب بن مالكفساق قصته في تبوك قال حتى إذا مضت أربعون من الخمسين إذا رسول رسول الله صلى الله عليه وسلم يأتي فقال إن رسول الله صلى الله عليه وسلم يأمرك أن تعتزل امرأتك ‏.‏ قال فقلت أطلقها أم ماذا أفعل قال لا بل اعتزلها فلا تقربنها ‏.‏ فقلت لامرأتي الحقي بأهلك فكوني عندهم حتى يقضي الله سبحانه في هذا الأمر ‏.‏",
      "text_en": " ‘Abd Allah bin Ka’b reported “I heard Ka’ab bin Malik. He then narrated his story about the battle of Tabuk.(Narrating the story) he added “When forty out of fifty days passed”, the messenger of the Apostle of Allaah(ﷺ) came and said “The Apostle of Allaah(ﷺ) has commanded you to keep away from your wife. He said “So, I (Ka’b bin Malik)” said “Should I divorce her or what should I do? He said “No, but only keep away from her and do not go near her”. So, I said to my wife “Go to your people and live with them until Allaah, the exalted makes a decision in this matter.”",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "30584",
        "20029",
        "20475",
        "11013",
        "11519",
        "1131"
      ]
    },
    {
      "id": "sunan-abi-daud-2206",
      "hadith_no": "2206",
      "source": "Sunan Abi Da'ud",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا ابن السرح، وإبراهيم بن خالد الكلبي أبو ثور، - في آخرين - قالوا حدثنا محمد بن إدريس الشافعي، حدثني عمي، محمد بن علي بن شافع عن عبد الله بن علي بن السائب، عن نافع بن عجير بن عبد يزيد بن ركانة، أن ركانة بن عبد يزيد، طلق امرأته سهيمة البتة فأخبر النبي صلى الله عليه وسلم بذلك وقال والله ما أردت إلا واحدة ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ والله ما أردت إلا واحدة ‏\"‏ ‏.‏ فقال ركانة والله ما أردت إلا واحدة ‏.‏ فردها إليه رسول الله صلى الله عليه وسلم فطلقها الثانية في زمان عمر والثالثة في زمان عثمان ‏.‏ قال أبو داود أوله لفظ إبراهيم وآخره لفظ ابن السرح ‏.‏",
      "text_en": " Nafi' bun Ujair bin Abd Yazid bin Ruknah reported Ruknah bin ‘Abd Yazid divorced his wife Suhaimah absolutely. The Prophet (ﷺ) was informed about this matter. He said to him (the Prophet) I swear by Allaah that I meant it to be only a single utterance of divorce. The Apostle of Allaah(ﷺ) said “I swear by Allaah that I meant it to be only a single divorce. The Apostle of Allaah(ﷺ) restored her to him, Then he divorced her the second time in the time of ‘Umar and the third time of ‘Uthman.Abu Dawud said “This tradition contains the words of Ibrahim in its beginning and the words of Ibn Al Sarh in the end.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "38072",
        "20002",
        "18548",
        "947"
      ]
    },
    {
      "id": "sunan-abi-daud-2217",
      "hadith_no": "2217",
      "source": "Sunan Abi Da'ud",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا ابن السرح، حدثنا ابن وهب، أخبرني ابن لهيعة، وعمرو بن الحارث، عن بكير بن الأشج، عن سليمان بن يسار، بهذا الخبر قال فأتي رسول الله صلى الله عليه وسلم بتمر فأعطاه إياه وهو قريب من خمسة عشر صاعا قال ‏\"‏ تصدق بهذا ‏\"‏ ‏.‏ قال فقال يا رسول الله على أفقر مني ومن أهلي فقال رسول الله صلى الله عليه وسلم ‏\"‏ كله أنت وأهلك ‏\"‏ ‏.‏",
      "text_en": " The tradition mentioned above has been transmitted by Sulaiman bin Yasar. This version has “Then some dates were brought to the Apostle of Allaah(ﷺ) and he gave it him. They measured about fifteen sa’s “. He said “Give them in alms”. He said “Is there anyone needier than I and my family. Apostle of Allaah(ﷺ)?” The Apostle of Allaah(ﷺ) said “Eat them, you and your family.”",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "20624",
        "20377",
        "11154",
        "11005"
      ]
    },
    {
      "id": "sunan-abi-daud-2250",
      "hadith_no": "2250",
      "source": "Sunan Abi Da'ud",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا أحمد بن عمرو بن السرح، حدثنا ابن وهب، عن عياض بن عبد الله الفهري، وغيره، عن ابن شهاب، عن سهل بن سعد، في هذا الخبر قال فطلقها ثلاث تطليقات عند رسول الله صلى الله عليه وسلم فأنفذه رسول الله صلى الله عليه وسلم وكان ما صنع عند النبي صلى الله عليه وسلم سنة ‏.‏ قال سهل حضرت هذا عند رسول الله صلى الله عليه وسلم فمضت السنة بعد في المتلاعنين أن يفرق بينهما ثم لا يجتمعان أبدا ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Sahl bin Sa’d Al Sa’idi through a different chain of narrators. This version has “He divorced her three times before the Messenger of Allah (ﷺ). The Messenger of Allah (ﷺ) implemented it and what is done before the Prophet (ﷺ) is sunnah(model behavior of the Prophet).Sahl said “I attended this before the Messenger of Allah(ﷺ). Afterwards the sunnah about those who invoked curses on each other was established that they (the spouses) were separated from each other and they would never be united.”",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "20514",
        "11013",
        "399"
      ]
    },
    {
      "id": "sunan-abi-daud-2251",
      "hadith_no": "2251",
      "source": "Sunan Abi Da'ud",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا مسدد، ووهب بن بيان، وأحمد بن عمرو بن السرح، وعمرو بن عثمان، قالوا حدثنا سفيان، عن الزهري، عن سهل بن سعد، قال مسدد قال شهدت المتلاعنين على عهد رسول الله صلى الله عليه وسلم وأنا ابن خمس عشرة ففرق بينهما رسول الله صلى الله عليه وسلم حين تلاعنا ‏.‏ وتم حديث مسدد ‏.‏ وقال الآخرون إنه شهد النبي صلى الله عليه وسلم فرق بين المتلاعنين فقال الرجل كذبت عليها يا رسول الله إن أمسكتها - لم يقل بعضهم عليها - قال أبو داود لم يتابع ابن عيينة أحد على أنه فرق بين المتلاعنين ‏.‏",
      "text_en": " Sahl bin Sa’ad said “The version of Musaddad has “I witnessed the invoking of curses by the two spouses during the life time of the Apostle of Allaah(ﷺ) when I was fifteen years old. When they finished invoking curses, the Apostle of Allaah(ﷺ) separated them from each other. Here ends the version of Musaddad. Others said “He was present when the Prophet (ﷺ) separated the spouses who invoked curses on each other. The man (Sahl) said “I shall have lied against her, Apostle of Allaah(ﷺ) if I keep her.Abu Dawud said “Some narrators did not mention the word ‘alaiha(against her).”Abu Dawud said “No one supported Ibn ‘Uyainah that he separated the spouses who invoked curses.”",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "36063",
        "30485",
        "10581",
        "20012",
        "11013",
        "399",
        "30175"
      ]
    },
    {
      "id": "sunan-abi-daud-2498",
      "hadith_no": "2498",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا أحمد بن عمرو بن السرح، حدثنا ابن وهب، عن يحيى بن أيوب، وسعيد بن أبي أيوب، عن زبان بن فائد، عن سهل بن معاذ، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الصلاة والصيام والذكر تضاعف على النفقة في سبيل الله بسبعمائة ضعف ‏\"‏ ‏.‏",
      "text_en": " Narrated Mu'adh ibn Jabal:                     The Messenger of Allah (ﷺ) said: (The reward of) prayer, fasting and remembrance of Allah is enhanced seven hundred times over (the reward of) spending in Allah's path.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "20379",
        "20375",
        "16031"
      ]
    },
    {
      "id": "sunan-abi-daud-2512",
      "hadith_no": "2512",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا أحمد بن عمرو بن السرح، حدثنا ابن وهب، عن حيوة بن شريح، وابن، لهيعة عن يزيد بن أبي حبيب، عن أسلم أبي عمران، قال ‏:‏ غزونا من المدينة نريد القسطنطينية، وعلى الجماعة عبد الرحمن بن خالد بن الوليد والروم ملصقو ظهورهم بحائط المدينة، فحمل رجل على العدو فقال الناس ‏:‏ مه، مه، لا إله إلا الله، يلقي بيديه إلى التهلكة ‏.‏ فقال أبو أيوب ‏:‏ إنما نزلت هذه الآية فينا معشر الأنصار لما نصر الله نبيه وأظهر الإسلام، قلنا ‏:‏ هلم نقيم في أموالنا ونصلحها، فأنزل الله تعالى ‏{‏ وأنفقوا في سبيل الله ولا تلقوا بأيديكم إلى التهلكة ‏}‏ فالإلقاء بالأيدي إلى التهلكة أن نقيم في أموالنا ونصلحها وندع الجهاد ‏.‏ قال أبو عمران ‏:‏ فلم يزل أبو أيوب يجاهد في سبيل الله حتى دفن بالقسطنطينية ‏.‏",
      "text_en": " Narrated AbuAyyub:                     AbuImran said: We went out on an expedition from Medina with the intention of (attacking) Constantinople. AbdurRahman ibn Khalid ibn al-Walid was the leader of the company. The Romans were just keeping their backs to the walls of the city. A man (suddenly) attacked the enemy.  Thereupon the people said: Stop! Stop! There is no god but Allah. He is putting himself into danger.  AbuAyyub said: This verse was revealed about us, the group of the Ansar (the Helpers). When Allah helped His Prophet (ﷺ) and gave Islam dominance, we said (i.e. thought): Come on! Let us stay in our property and improve it.  Thereupon Allah, the Exalted, revealed, \"And spend of your substance in the cause of Allah, and make not your hands contribute to (your destruction)\". To put oneself into danger means that we stay in our property and commit ourselves to its improvement, and abandon fighting (i.e. jihad).  AbuImran said: AbuAyyub continued to strive in the cause of Allah until he (died and) was buried in Constantinople.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "26010",
        "20624",
        "11411"
      ]
    },
    {
      "id": "sunan-abi-daud-2672",
      "hadith_no": "2672",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا أحمد بن عمرو بن السرح، حدثنا سفيان، عن الزهري، عن عبيد الله، - يعني ابن عبد الله - عن ابن عباس، عن الصعب بن جثامة، أنه سأل النبي صلى الله عليه وسلم عن الدار من المشركين يبيتون فيصاب من ذراريهم ونسائهم ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ هم منهم ‏\"‏ ‏.‏ وكان عمرو - يعني ابن دينار - يقول هم من آبائهم ‏.‏ قال الزهري ثم نهى رسول الله صلى الله عليه وسلم بعد ذلك عن قتل النساء والولدان ‏.‏",
      "text_en": " Al Sa’b bin Jaththamah said that he asked the Apostle of Allaah(ﷺ) about the polytheists whose settlemnst were attacked at night when some of their offspring and women were smitten. The Prophet(ﷺ) “They are of them. ‘Amr bin Dinar used to say “they are regarded in the same way as their parents.”Al-Zuhri said:                      Thereafter the Messenger of Allah (ﷺ) prohibited to kill women and children.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20005",
        "11013",
        "11004",
        "17",
        "3661"
      ]
    },
    {
      "id": "sunan-abi-daud-2773",
      "hadith_no": "2773",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا ابن السرح، أخبرنا ابن وهب، أخبرني يونس، عن ابن شهاب، قال أخبرني عبد الرحمن بن عبد الله بن كعب بن مالك، أن عبد الله بن كعب، قال سمعت كعب بن مالك، قال كان النبي صلى الله عليه وسلم إذا قدم من سفر بدأ بالمسجد فركع فيه ركعتين ثم جلس للناس ‏.‏ وقص ابن السرح الحديث قال ونهى رسول الله صلى الله عليه وسلم المسلمين عن كلامنا أيها الثلاثة حتى إذا طال على تسورت جدار حائط أبي قتادة وهو ابن عمي فسلمت عليه فوالله ما رد على السلام ثم صليت الصبح صباح خمسين ليلة على ظهر بيت من بيوتنا فسمعت صارخا يا كعب بن مالك أبشر ‏.‏ فلما جاءني الذي سمعت صوته يبشرني نزعت له ثوبى فكسوتهما إياه فانطلقت حتى إذا دخلت المسجد فإذا رسول الله صلى الله عليه وسلم جالس فقام إلى طلحة بن عبيد الله يهرول حتى صافحني وهنأني ‏.‏",
      "text_en": " Ka’ab bin Malik said “When the Prophet(ﷺ) arrived from a journey, he first went to a mosque where he prayed two rak’ahs after which he sat in it and gave audience to the people. The narrator Ibn Al Sarh then narrated the rest of the tradition. He said “The Apostle of Allaah(ﷺ) forbade the Muslims to speak to any three of us. When considerable time had passed on me, I ascended the wall of Abu Qatadah who was my cousin. I saluted him, but, I swear by Allaah he did not return my salutation. I then offered the dawn prayer on the fiftieth day on the roof of one of our houses. I then hear d a crier say “Ka’ab bin Mailk, have good news”. When the man whose voice I heard came to me giving me good news, I took off my garments and clothed him. I went on till I entered the mosque. The Apostle of Allaah(ﷺ) was sitting there. Talhah bin ‘Ubaid Allaah stood up and hastened to me till he shook hands with me and greeted me.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "20475",
        "11013",
        "11519",
        "1131",
        "390"
      ]
    },
    {
      "id": "sunan-abi-daud-2779",
      "hadith_no": "2779",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا ابن السرح، حدثنا سفيان، عن الزهري، عن السائب بن يزيد، قال لما قدم النبي صلى الله عليه وسلم المدينة من غزوة تبوك تلقاه الناس فلقيته مع الصبيان على ثنية الوداع ‏.‏",
      "text_en": " Al Sai’ib bin Yazid said “When the Prophet(ﷺ) turned from the battle of Tabuk to Madeenah, the people received him, I met him along with the children at Thaniyyat Al Wada’.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20005",
        "11013",
        "3048"
      ]
    },
    {
      "id": "sunan-abi-daud-2885",
      "hadith_no": "2885",
      "source": "Sunan Abi Da'ud",
      "chapter": "Shares of Inheritance (Kitab Al-Fara'id) - كتاب الفرائض",
      "chapter_no": "19",
      "text_ar": "حدثنا أحمد بن عمرو بن السرح، أخبرنا ابن وهب، حدثني عبد الرحمن بن زياد، عن عبد الرحمن بن رافع التنوخي، عن عبد الله بن عمرو بن العاص، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ العلم ثلاثة وما سوى ذلك فهو فضل آية محكمة أو سنة قائمة أو فريضة عادلة ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     The Prophet (ﷺ) said: Knowledge has three categories; anything else is extra; a precise verse, or an established sunnah (practice), or a firm obligatory duty.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "28326",
        "16064",
        "29"
      ]
    },
    {
      "id": "sunan-abi-daud-2892",
      "hadith_no": "2892",
      "source": "Sunan Abi Da'ud",
      "chapter": "Shares of Inheritance (Kitab Al-Fara'id) - كتاب الفرائض",
      "chapter_no": "19",
      "text_ar": "حدثنا ابن السرح، حدثنا ابن وهب، أخبرني داود بن قيس، وغيره، من أهل العلم عن عبد الله بن محمد بن عقيل، عن جابر بن عبد الله، أن امرأة، سعد بن الربيع قالت يا رسول الله إن سعدا هلك وترك ابنتين ‏.‏ وساق نحوه قال أبو داود وهذا هو الصواب ‏.‏",
      "text_en": " Narrated Jabir bin ‘Abdullah :                     The wife of Sa'd b. al-Rabi said: Messenger of Allah, Sa'd died and left two daughters. He then narrated the rest of the tradition in a similar way.Abu Dawud said: This is the most correct tradition.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "11845",
        "12246",
        "34"
      ]
    },
    {
      "id": "sunan-abi-daud-2946",
      "hadith_no": "2946",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا ابن السرح، وابن أبي خلف، - لفظه - قالا حدثنا سفيان، عن الزهري، عن عروة، عن أبي حميد الساعدي، أن النبي صلى الله عليه وسلم استعمل رجلا من الأزد يقال له ابن اللتبية - قال ابن السرح ابن الأتبية - على الصدقة فجاء فقال هذا لكم وهذا أهدي لي ‏.‏ فقام النبي صلى الله عليه وسلم على المنبر فحمد الله وأثنى عليه وقال ‏\"‏ ما بال العامل نبعثه فيجيء فيقول هذا لكم وهذا أهدي لي ‏.‏ ألا جلس في بيت أمه أو أبيه فينظر أيهدى له أم لا لا يأتي أحد منكم بشىء من ذلك إلا جاء به يوم القيامة إن كان بعيرا فله رغاء أو بقرة فلها خوار أو شاة تيعر ‏\"‏ ‏.‏ ثم رفع يديه حتى رأينا عفرة إبطيه ثم قال ‏\"‏ اللهم هل بلغت اللهم هل بلغت ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Humaid al-Sa'idi:                     The Prophet (ﷺ) appointed a man of Azd called Ibn al-Lutbiyayah (to collect sadaqah). The narrator Ibn al-Sarh said: (He appointed) Ibn al-Utbiyyah to collect the sadaqah. When he returned he said: This is for you and this was given to me as present. So the Prophet (ﷺ) stood on the pulpit, and after praising and extolling Allah he said: What is the matter with a collector of sadaqah. We send him (to collect sadaqah), and when he return he says: This is for you and this is a present which was given to me. Why did he not sit in his father's or mother's house and see whether it would be given to him or not ? Whoever takes any of it will inevitably bring it on the Day of Resurrection, be it a camel which rumbles, an ox which bellows, or sheep which-bleats. Then raising his arms so that we could see where the hair grow under his armpits, he said: O Allah,  have I given full information ? O Allah, have I given full information ?",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20005",
        "11013",
        "10511",
        "1457"
      ]
    },
    {
      "id": "sunan-abi-daud-3018",
      "hadith_no": "3018",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا ابن السرح، حدثنا ابن وهب، أخبرني يونس بن يزيد، عن ابن شهاب، قال بلغني أن رسول الله صلى الله عليه وسلم افتتح خيبر عنوة بعد القتال ونزل من نزل من أهلها على الجلاء بعد القتال ‏.‏",
      "text_en": " Ibn Shihab said “It has reached me that the Apostle of Allaah(ﷺ) conquered Khaibar by force. Its inhabitants who came down (from their fortress) for expulsion came down after fighting.”",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "20475",
        "11013"
      ]
    },
    {
      "id": "sunan-abi-daud-3019",
      "hadith_no": "3019",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا ابن السرح، حدثنا ابن وهب، أخبرني يونس بن يزيد، عن ابن شهاب، قال خمس رسول الله صلى الله عليه وسلم خيبر ثم قسم سائرها على من شهدها ومن غاب عنها من أهل الحديبية ‏.‏",
      "text_en": " Narrated Ibn Shihab:                     The Messenger of Allah (ﷺ) took out his fifth from the booty of Khaybar, and divided the rest of it among those who attended the battle and among those who were away from it but attend the expedition of al-Hudaybiyyah.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "20475",
        "11013"
      ]
    },
    {
      "id": "sunan-abi-daud-3034",
      "hadith_no": "3034",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا ابن السرح، حدثنا ابن وهب، قال قال مالك قد أجلى عمر رحمه الله يهود نجران وفدك ‏.‏",
      "text_en": " Malik said “’Umar expelled the Jews of Najran and Fadak.”",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029"
      ]
    },
    {
      "id": "sunan-abi-daud-3078",
      "hadith_no": "3078",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا أحمد بن عمرو بن السرح، أخبرنا ابن وهب، أخبرني مالك، قال هشام العرق الظالم أن يغرس الرجل في أرض غيره فيستحقها بذلك ‏.‏ قال مالك والعرق الظالم كل ما أخذ واحتفر وغرس بغير حق ‏.‏",
      "text_en": " Hisham said “The unjust vein means that a man implants a tree in the land of another man so that they may be entitled to it. Malik said “The unjust vein means that a man takes (a thing) digs a pit and implants a tree without (his) right.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "20001"
      ]
    },
    {
      "id": "sunan-abi-daud-3083",
      "hadith_no": "3083",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا ابن السرح، أخبرنا ابن وهب، أخبرني يونس، عن ابن شهاب، عن عبيد الله بن عبد الله، عن ابن عباس، عن الصعب بن جثامة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا حمى إلا لله ولرسوله ‏\"‏ ‏.‏ قال ابن شهاب وبلغني أن رسول الله صلى الله عليه وسلم حمى النقيع ‏.‏",
      "text_en": " Al Sa’b bin Jaththamah reported the Apostle of Allaah(ﷺ) as saying “There is no (permission for) protected land except for Allaah and His Prophet. Ibn Shihab said “It has reached me that the Apostle of Allaah(ﷺ) protected Naqi’.”",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "20475",
        "11013",
        "11004",
        "17",
        "3661"
      ]
    },
    {
      "id": "sunan-abi-daud-3219",
      "hadith_no": "3219",
      "source": "Sunan Abi Da'ud",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا أحمد بن عمرو بن السرح، حدثنا ابن وهب، حدثني عمرو بن الحارث، أن أبا علي الهمداني، حدثه قال كنا مع فضالة بن عبيد برودس من أرض الروم فتوفي صاحب لنا فأمر فضالة بقبره فسوي ثم قال سمعت رسول الله صلى الله عليه وسلم يأمر بتسويتها ‏.‏ قال أبو داود رودس جزيرة في البحر ‏.‏",
      "text_en": " Narrated Abu 'Ali al-Hamdani:                     We were with Fudalah b. 'Ubaid at Rudis in the land of Rome. One of our Companions dies, Fudalah commanded us to dig his grave; it was (dug and) levelled. He then said: I heard the Messenger of Allah (ﷺ) commanding to level them.Abu Dawud said: Rudis is an island, in the sea.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "20377"
      ]
    },
    {
      "id": "sunan-abi-daud-3291",
      "hadith_no": "3291",
      "source": "Sunan Abi Da'ud",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا ابن السرح، قال حدثنا ابن وهب، عن يونس، عن ابن شهاب، بمعناه وإسناده ‏.‏ قال أبو داود سمعت أحمد بن شبوية، يقول قال ابن المبارك - يعني في هذا الحديث - حدث أبو سلمة، فدل ذلك على أن الزهري، لم يسمعه من أبي سلمة، وقال أحمد بن محمد ‏:‏ وتصديق ذلك ما حدثنا أيوب - يعني ابن سليمان - قال أبو داود سمعت أحمد بن حنبل يقول ‏:‏ أفسدوا علينا هذا الحديث ‏.‏ قيل له ‏:‏ وصح إفساده عندك وهل رواه غير ابن أبي أويس قال ‏:‏ أيوب كان أمثل منه ‏.‏ يعني أيوب بن سليمان بن بلال، وقد رواه أيوب ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by al-Zuhri through a different chain of narrators to the same effect.Abu Dawud said:                      I heard Ahmad b. Shabbuyah say: Ibn al-Mubarak said about this tradition that Abu Salamah had transmitted it. This indicates that al-Zuhri did not hear it from Abu Salamah. Ahmad b. Muhammad said: This is verified by what Ayyub b. Sulaiman narrated to us.Abu Dawud said: I heard Ahmad b. Hanbal say: I have corrupted this tradition for us. He was asked: Do you think that it is correct that this tradition has been corrupted? Has any person other than Ibn Abi Uwais transmitted it ? He replied: Ayyub was similar to him in respect of reliability, and Ayyub transmitted it.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "20475",
        "30002",
        "30304"
      ]
    },
    {
      "id": "sunan-abi-daud-3317",
      "hadith_no": "3317",
      "source": "Sunan Abi Da'ud",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا سليمان بن داود، وابن السرح، قالا حدثنا ابن وهب، أخبرني يونس، قال قال ابن شهاب فأخبرني عبد الرحمن بن عبد الله بن كعب بن مالك، أن عبد الله بن كعب، - وكان قائد كعب من بنيه حين عمي - عن كعب بن مالك، قال قلت ‏:‏ يا رسول الله إن من توبتي أن أنخلع من مالي صدقة إلى الله وإلى رسوله ‏.‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏ أمسك عليك بعض مالك فهو خير لك ‏\"‏ ‏.‏ قال فقلت ‏:‏ إني أمسك سهمي الذي بخيبر ‏.‏",
      "text_en": " Narrated Ka'b ibn Malik:                     I said: Messenger of Allah, to make my repentance complete I should divest myself of my property as sadaqah (alms) for Allah and His Apostle. The Messenger of Allah (ﷺ) said: Retain some of your property, for that will be better for you. So he said: I shall retain the portion I have at Khaybar.",
      "usc_msa_ref": "",
      "chain": [
        "30584",
        "30485",
        "20029",
        "20475",
        "11013",
        "11519",
        "1131",
        "390"
      ]
    },
    {
      "id": "sunan-abi-daud-3335",
      "hadith_no": "3335",
      "source": "Sunan Abi Da'ud",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا أحمد بن عمرو بن السرح، حدثنا ابن وهب، ح وحدثنا أحمد بن صالح، حدثنا عنبسة، عن يونس، عن ابن شهاب، قال قال ابن المسيب إن أبا هريرة قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ الحلف منفقة للسلعة ممحقة للبركة ‏\"‏ ‏.‏ قال ابن السرح ‏\"‏ للكسب ‏\"‏ ‏.‏ وقال عن سعيد بن المسيب عن أبي هريرة عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     I heard Messenger of Allah (ﷺ) say: Swearing produces a ready sale for a commodity but blots out the blessing. The narrator Ibn al-Sarh said: \"for earning\". He also narrated this tradition from Sa'id b. al-Musayyab on the authority of Abu Hurairah from the Prophet (ﷺ).",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "30226",
        "11716",
        "20475",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-3377",
      "hadith_no": "3377",
      "source": "Sunan Abi Da'ud",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا قتيبة بن سعيد، وأحمد بن عمرو بن السرح، - وهذا لفظه - قالا حدثنا سفيان، عن الزهري، عن عطاء بن يزيد الليثي، عن أبي سعيد الخدري، أن النبي صلى الله عليه وسلم نهى عن بيعتين وعن لبستين أما البيعتان فالملامسة والمنابذة وأما اللبستان فاشتمال الصماء وأن يحتبي الرجل في ثوب واحد كاشفا عن فرجه أو ليس على فرجه منه شىء ‏.‏",
      "text_en": " Narrated Abu Sa’id Al Khudri :                     The Prophet (ﷺ) forbade two types of business transactions and two ways of dressing. The two types of business transactions are mulamasah and munabadhah. As regards the two ways of dressing, they are the wrapping of the samma', and that when a man wraps himself up in a single garment while sitting in such a way that he does not cover his private parts or there is no garment on his private parts.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "30485",
        "20005",
        "11013",
        "11206",
        "38"
      ]
    },
    {
      "id": "sunan-abi-daud-3438",
      "hadith_no": "3438",
      "source": "Sunan Abi Da'ud",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا أحمد بن عمرو بن السرح، حدثنا سفيان، عن الزهري، عن سعيد بن المسيب، عن أبي هريرة، قال قال النبي صلى الله عليه وسلم ‏\"‏ لا تناجشوا ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     The Prophet (ﷺ) forbade to bid against one another.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20005",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-3541",
      "hadith_no": "3541",
      "source": "Sunan Abi Da'ud",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا أحمد بن عمرو بن السرح، حدثنا ابن وهب، عن عمر بن مالك، عن عبيد الله بن أبي جعفر، عن خالد بن أبي عمران، عن القاسم، عن أبي أمامة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من شفع لأخيه بشفاعة فأهدى له هدية عليها فقبلها فقد أتى بابا عظيما من أبواب الربا ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuUmamah:                     The Prophet (ﷺ) said: If anyone intercedes for his brother and he presents a gift to him for it and he accepts it, he approaches a great door of the doors of usury.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "11409",
        "10906",
        "10535",
        "405"
      ]
    },
    {
      "id": "sunan-abi-daud-3885",
      "hadith_no": "3885",
      "source": "Sunan Abi Da'ud",
      "chapter": "Medicine (Kitab Al-Tibb) - كتاب الطب",
      "chapter_no": "29",
      "text_ar": "حدثنا أحمد بن صالح، وابن السرح، - قال أحمد حدثنا ابن وهب، وقال ابن السرح، - أخبرنا ابن وهب، حدثنا داود بن عبد الرحمن، عن عمرو بن يحيى، عن يوسف بن محمد، - وقال ابن صالح محمد بن يوسف بن ثابت بن قيس بن شماس - عن أبيه، عن جده، عن رسول الله صلى الله عليه وسلم أنه دخل على ثابت بن قيس - قال أحمد - وهو مريض فقال ‏\"‏ اكشف الباس رب الناس ‏\"‏ ‏.‏ عن ثابت بن قيس ثم أخذ ترابا من بطحان فجعله في قدح ثم نفث عليه بماء وصبه عليه ‏.‏ قال أبو داود قال ابن السرح يوسف بن محمد وهو الصواب ‏.‏",
      "text_en": " Narrated Thabit ibn Qays ibn Shammas:                     The Messenger of Allah (ﷺ) entered upon Thabit ibn Qays. The version of Ahmad (ibn Salih) has: When he was ill He (the Prophet) said: Remove the harm, O Lord of men, from Thabit ibn Qays ibn Shammas. He then took some dust of Bathan, and put it in a bowel, and then mixed it with water and blew in it, and poured it on him.Abu Dawud said: Ibn al-Sarh said: Yusuf bin Muhammad is correct (and not Muhammad bin Yusuf)",
      "usc_msa_ref": "",
      "chain": [
        "30226",
        "30485",
        "30007",
        "20029",
        "30485",
        "20029",
        "20192",
        "11210",
        "11232"
      ]
    },
    {
      "id": "sunan-abi-daud-4102",
      "hadith_no": "4102",
      "source": "Sunan Abi Da'ud",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا أحمد بن صالح، ح وحدثنا سليمان بن داود المهري، وابن السرح، وأحمد بن سعيد الهمداني، قالوا أخبرنا ابن وهب، قال أخبرني قرة بن عبد الرحمن المعافري، عن ابن شهاب، عن عروة بن الزبير، عن عائشة، - رضى الله عنها - أنها قالت يرحم الله نساء المهاجرات الأول لما أنزل الله ‏{‏ وليضربن بخمرهن على جيوبهن ‏}‏ شققن أكنف - قال ابن صالح أكثف - مروطهن فاختمرن بها ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     May Allah have mercy on the early immigrant women. When the verse \"That they should draw their veils over their bosoms\" was revealed, they tore their thick outer garments and made veils from them.",
      "usc_msa_ref": "",
      "chain": [
        "30226",
        "30584",
        "30485",
        "30296",
        "20029",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-4103",
      "hadith_no": "4103",
      "source": "Sunan Abi Da'ud",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا ابن السرح، قال رأيت في كتاب خالي عن عقيل، عن ابن شهاب، بإسناده ومعناه ‏.‏",
      "text_en": " Ibn al-Sarh said:                      I saw (this tradition) in the writing of my maternal uncle from 'Aqil, from Ibn Shihab through a different chain of narrators and to the same effect.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "11207"
      ]
    },
    {
      "id": "sunan-abi-daud-4116",
      "hadith_no": "4116",
      "source": "Sunan Abi Da'ud",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا أحمد بن عمرو بن السرح، وأحمد بن سعيد الهمداني، قالا أخبرنا ابن وهب، أخبرنا ابن لهيعة، عن موسى بن جبير، أن عبيد الله بن عباس، حدثه عن خالد بن يزيد بن معاوية، عن دحية بن خليفة الكلبي، أنه قال أتي رسول الله صلى الله عليه وسلم بقباطي فأعطاني منها قبطية فقال ‏\"‏ اصدعها صدعين فاقطع أحدهما قميصا وأعط الآخر امرأتك تختمر به ‏\"‏ ‏.‏ فلما أدبر قال ‏\"‏ وأمر امرأتك أن تجعل تحته ثوبا لا يصفها ‏\"‏ ‏.‏ قال أبو داود رواه يحيى بن أيوب فقال عباس بن عبيد الله بن عباس ‏.‏",
      "text_en": " Narrated Dihyah ibn Khalifah al-Kalbi:                     The Messenger of Allah (ﷺ) was brought some pieces of fine Egyptian linen and he gave me one and said: Divide it into two; cut one of the pieces into a shirt and give the other to your wife for veil. Then when he turned away, he said: And order your wife to wear a garment below it and not show her figure.Abu Dawud said: Yahya b. Ayyub transmitted it and said: 'Abbas b. 'Ubaid Allah b. 'Abbas",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "30296",
        "20029",
        "20624",
        "21181",
        "17506"
      ]
    },
    {
      "id": "sunan-abi-daud-4145",
      "hadith_no": "4145",
      "source": "Sunan Abi Da'ud",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا ابن السرح، حدثنا سفيان، عن ابن المنكدر، عن جابر، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ أتخذتم أنماطا ‏\"‏ ‏.‏ قلت وأنى لنا الأنماط قال ‏\"‏ أما إنها ستكون لكم أنماط ‏\"‏ ‏.‏",
      "text_en": " Narrated Jabir:                     The Messenger of Allah (ﷺ) said to me: Have you made cushions ? I said: How can we afford cushions ? He said: Soon you will have cushions.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20005",
        "11048",
        "34"
      ]
    },
    {
      "id": "sunan-abi-daud-4170",
      "hadith_no": "4170",
      "source": "Sunan Abi Da'ud",
      "chapter": "Combing the Hair (Kitab Al-Tarajjul) - كتاب الترجل",
      "chapter_no": "35",
      "text_ar": "حدثنا ابن السرح، حدثنا ابن وهب، عن أسامة، عن أبان بن صالح، عن مجاهد بن جبر، عن ابن عباس، قال لعنت الواصلة والمستوصلة والنامصة والمتنمصة والواشمة والمستوشمة من غير داء ‏.‏ قال أبو داود وتفسير الواصلة التي تصل الشعر بشعر النساء والمستوصلة المعمول بها والنامصة التي تنقش الحاجب حتى ترقه والمتنمصة المعمول بها والواشمة التي تجعل الخيلان في وجهها بكحل أو مداد والمستوشمة المعمول بها ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     The woman who supplies fake hair and the one who asks for it, the woman who pulls out hair for other people and the woman who depilates herself, the woman who tattoos and the one who has it done when there is no disease to justify it have been cursed.Abu Dawud said: Wasilah means the woman who adds false hair to the hair of women. Mustawsilah means the one who asks for adding the hair to her hair. namisah means a woman who plucks hair from the brow until she makes it thin; mutanammisah means the woman who depilates herself ; washimah is a woman who tattoos in the face with antimony or ink ; mustawshimah is a woman with whom it is done.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "50",
        "19897",
        "11028",
        "17"
      ]
    },
    {
      "id": "sunan-abi-daud-4204",
      "hadith_no": "4204",
      "source": "Sunan Abi Da'ud",
      "chapter": "Combing the Hair (Kitab Al-Tarajjul) - كتاب الترجل",
      "chapter_no": "35",
      "text_ar": "حدثنا أحمد بن عمرو بن السرح، وأحمد بن سعيد الهمداني، قالا حدثنا ابن وهب، حدثنا ابن جريج، عن أبي الزبير، عن جابر بن عبد الله، قال أتي بأبي قحافة يوم فتح مكة ورأسه ولحيته كالثغامة بياضا فقال رسول الله صلى الله عليه وسلم ‏\"‏ غيروا هذا بشىء واجتنبوا السواد ‏\"‏ ‏.‏",
      "text_en": " Narrated Jabir bin ‘Abdullah :                     Abu Quhafah was brought on the day of the conquest of Mecca with head and beard while like hyssop. The Messenger of Allah (ﷺ) said: Change this something, but avoid black.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "30296",
        "20029",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "id": "sunan-abi-daud-4304",
      "hadith_no": "4304",
      "source": "Sunan Abi Da'ud",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا قتيبة، وابن السرح، وغيرهما، قالوا حدثنا سفيان، عن الزهري، عن سعيد بن المسيب، عن أبي هريرة، رواية - قال ابن السرح - أن النبي صلى الله عليه وسلم قال ‏\"‏ لا تقوم الساعة حتى تقاتلوا قوما نعالهم الشعر ولا تقوم الساعة حتى تقاتلوا قوما صغار الأعين ذلف الآنف كأن وجوههم المجان المطرقة ‏\"‏ ‏.‏",
      "text_en": " Abu hurairah reported the Prophet (ﷺ) as saying:                      The last hour will not come before you fight with a people whose sandals are of hair, and the Last hour will not come before you fight with a people who have small eyes, short noses, and whose faces look as if they were shields covered with skin.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "30485",
        "20005",
        "11013",
        "11002",
        "30485"
      ]
    },
    {
      "id": "sunan-abi-daud-4370",
      "hadith_no": "4370",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا أحمد بن عمرو بن السرح، أخبرنا ابن وهب، أخبرني الليث بن سعد، عن محمد بن العجلان، عن أبي الزناد، أن رسول الله صلى الله عليه وسلم لما قطع الذين سرقوا لقاحه وسمل أعينهم بالنار عاتبه الله تعالى في ذلك فأنزل الله تعالى ‏{‏ إنما جزاء الذين يحاربون الله ورسوله ويسعون في الأرض فسادا أن يقتلوا أو يصلبوا ‏}‏ الآية ‏.‏",
      "text_en": " Narrated AbuzZinad:                     When the Messenger of Allah (ﷺ) cut off (the hands and feet of) those who had stolen his camels and he had their eyes put out by fire (heated nails), Allah reprimanded him on that (action), and Allah, the Exalted, revealed: \"The punishment of those who wage war against Allah and His Apostle  and strive with might and main for mischief through the land is execution or crucifixion.\"",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "20023",
        "11061"
      ]
    },
    {
      "id": "sunan-abi-daud-4384",
      "hadith_no": "4384",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا أحمد بن صالح، ووهب بن بيان، قالا حدثنا ح، وحدثنا ابن السرح، قال أخبرنا ابن وهب، أخبرني يونس، عن ابن شهاب، عن عروة، وعمرة، عن عائشة، رضى الله عنها عن النبي صلى الله عليه وسلم قال ‏\"‏ تقطع يد السارق في ربع دينار فصاعدا ‏\"‏ ‏.‏ قال أحمد بن صالح القطع في ربع دينار فصاعدا ‏.‏",
      "text_en": " ‘A’ishah reported the prophet (ﷺ) as saying :                      A thief’s hand should be cut off for a quarter of a dinar and upwards.Ahmed b. Salih said: The amputation (of a thief’s hand) is for a quarter of a dinar and upwards.",
      "usc_msa_ref": "",
      "chain": [
        "30226",
        "36063",
        "30485",
        "20029",
        "20475",
        "11013",
        "10511",
        "11455",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-4401",
      "hadith_no": "4401",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا ابن السرح، أخبرنا ابن وهب، أخبرني جرير بن حازم، عن سليمان بن مهران، عن أبي ظبيان، عن ابن عباس، قال مر على علي بن أبي طالب رضى الله عنه بمعنى عثمان ‏.‏ قال أوما تذكر أن رسول الله صلى الله عليه وسلم قال ‏\"‏ رفع القلم عن ثلاثة عن المجنون المغلوب على عقله حتى يفيق وعن النائم حتى يستيقظ وعن الصبي حتى يحتلم ‏\"‏ ‏.‏ قال صدقت قال فخلى عنها سبيلها ‏.‏",
      "text_en": " Narrated Ali ibn AbuTalib:                     Ibn Abbas said: A lunatic woman passed by Ali ibn AbuTalib. He then mentioned the rest of the tradition to the same effect as Uthman mentioned. This version has: Do you not remember that the Messenger of Allah (ﷺ) has said: There are three whose actions are not recorded: a lunatic whose mind is deranged till he is restored to consciousness, a sleeper till he awakes, and a boy till he reaches puberty?",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "11272",
        "19301",
        "17"
      ]
    },
    {
      "id": "sunan-abi-daud-4488",
      "hadith_no": "4488",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا ابن السرح، قال وجدت في كتاب خالي عبد الرحمن بن عبد الحميد عن عقيل أن ابن شهاب أخبره أن عبد الله بن عبد الرحمن بن الأزهر أخبره عن أبيه قال أتي النبي صلى الله عليه وسلم بشارب وهو بحنين فحثى في وجهه التراب ثم أمر أصحابه فضربوه بنعالهم وما كان في أيديهم حتى قال لهم ‏\"‏ ارفعوا ‏\"‏ ‏.‏ فرفعوا فتوفي رسول الله صلى الله عليه وسلم ثم جلد أبو بكر في الخمر أربعين ثم جلد عمر أربعين صدرا من إمارته ثم جلد ثمانين في آخر خلافته ثم جلد عثمان الحدين كليهما ثمانين وأربعين ثم أثبت معاوية الحد ثمانين ‏.‏",
      "text_en": " Narrated AbdurRahman ibn al-Azhar:                     A man who had drunk wine was brought before the Prophet (ﷺ) when he was in Hunayn. He threw some dust on his face. He then ordered his Companions and they beat him with their sandals and whatever they had in their hands. He then said to them: Leave him,  and they left him. The Messenger of Allah (ﷺ) then died, and AbuBakr gave forty lashes for drinking wine, and then Umar in the beginning of his Caliphate inflicted forty stripes and at the end of his Caliphate he inflicted eighty stripes. Uthman (after him) inflicted both punishments, eighty and forty stripes, and finally Mu'awiyah established eighty stripes.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "11207",
        "11013"
      ]
    },
    {
      "id": "sunan-abi-daud-4521",
      "hadith_no": "4521",
      "source": "Sunan Abi Da'ud",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا أحمد بن عمرو بن السرح، أخبرنا ابن وهب، أخبرني مالك، عن أبي ليلى بن عبد الله بن عبد الرحمن بن سهل، عن سهل بن أبي حثمة، أنه أخبره هو، ورجال، من كبراء قومه أن عبد الله بن سهل ومحيصة خرجا إلى خيبر من جهد أصابهم فأتي محيصة فأخبر أن عبد الله بن سهل قد قتل وطرح في فقير أو عين فأتى يهود فقال أنتم والله قتلتموه ‏.‏ قالوا والله ما قتلناه ‏.‏ فأقبل حتى قدم على قومه فذكر لهم ذلك ثم أقبل هو وأخوه حويصة - وهو أكبر منه - وعبد الرحمن بن سهل فذهب محيصة ليتكلم وهو الذي كان بخيبر فقال له رسول الله صلى الله عليه وسلم ‏\"‏ كبر كبر ‏\"‏ ‏.‏ يريد السن فتكلم حويصة ثم تكلم محيصة فقال رسول الله صلى الله عليه وسلم ‏\"‏ إما أن يدوا صاحبكم وإما أن يؤذنوا بحرب ‏\"‏ ‏.‏ فكتب إليهم رسول الله صلى الله عليه وسلم بذلك فكتبوا إنا والله ما قتلناه ‏.‏ فقال رسول الله صلى الله عليه وسلم لحويصة ومحيصة وعبد الرحمن ‏\"‏ أتحلفون وتستحقون دم صاحبكم ‏\"‏ ‏.‏ قالوا لا ‏.‏ قال ‏\"‏ فتحلف لكم يهود ‏\"‏ ‏.‏ قالوا ليسوا مسلمين فوداه رسول الله صلى الله عليه وسلم من عنده فبعث إليهم مائة ناقة حتى أدخلت عليهم الدار ‏.‏ قال سهل لقد ركضتني منها ناقة حمراء ‏.‏",
      "text_en": " Sahl b. Abi Hathmah and some senior men of the tribe told that 'Abd Allah b. Abi Sahl and Muhayyasah came to Khaibar on account of the calamity (i.e. famine) that befall them. Muhayyasah came and told the 'Abd Allah b. Sahl had been killed and thrown in a well or stream. He hen came to the Jews and said:                      I swear by Allah, you have killed him. They said: We swear by Allah, we have not killed him. He then proceeded and came to his tribe  and mentioned this to them. Then he, his brother Huwayyasah, who was older to him, and 'Abd al-Rahman b. Sahl came forward (to the Prophet). Muhayyasah began to speak. It was he who was at Khaibar. The Messenger of Allah (ﷺ) then said to him: Let the eldest (speak), let the eldest (speak), meaning age. So Huwayyasah spoke, and after him Muhayyasah spoke. The Messenger of Allah (ﷺ) then said: They should either pay the bloodwit for you friend or they should be prepared for war. So the Messenger of Allah (ﷺ) wrote to them about it. They wrote (in reply): We swear by Allah, we have not killed him. The Messenger of Allah (ﷺ) then said to Huwayyasah, Muhayyasah and 'Abd al-Rahman: Will you take an oath and thus have the claim to the blood of your friend ? They said: No. He (the Prophet) said: The Jews will then take an oath. They said: They are not Muslims. Then the Messenger of Allah (ﷺ) himself paid the bloodwit. The Messenger of Allah (ﷺ) then sent on one hundred she-camels and they were entered in their house. Sahl said: A red she-camel of them gave me a kick.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "20001",
        "1822"
      ]
    },
    {
      "id": "sunan-abi-daud-4539",
      "hadith_no": "4539",
      "source": "Sunan Abi Da'ud",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا محمد بن عبيد، حدثنا حماد، ح وحدثنا ابن السرح، حدثنا سفيان، - وهذا حديثه - عن عمرو، عن طاوس، قال من قتل ‏.‏ وقال ابن عبيد قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من قتل في عميا في رمى يكون بينهم بحجارة أو ضرب بالسياط أو ضرب بعصا فهو خطأ وعقله عقل الخطإ ومن قتل عمدا فهو قود ‏\"‏ ‏.‏ وقال ابن عبيد ‏\"‏ قود يد ‏\"‏ ‏.‏ ثم اتفقا ‏\"‏ ومن حال دونه فعليه لعنة الله وغضبه لا يقبل منه صرف ولا عدل ‏\"‏ ‏.‏ وحديث سفيان أتم ‏.‏",
      "text_en": " Tawus, in his version said:                      If anyone is killed. Ibn 'Ubaid in his version said: The Messenger of Allah (ﷺ) said: If anyone is killed in error (blindly) when people are throwing stones, or by beating with whips, or striking with a stick, it is accidental and the compensation for accidental death is due. But if anyone is killed deliberately, retaliation is due. Ibn 'Ubaid in his version: Retaliation of the man is due. The agreed version then goes: If anyone comes in (between the two parties) to prevent it, Allah's curse and anger will rest on him, and neither supererogatory nor obligatory acts will be accepted from him. The version of the tradition of Sufyan is more perfect.",
      "usc_msa_ref": "",
      "chain": [
        "30213",
        "20022",
        "30485",
        "20005",
        "11081",
        "11053"
      ]
    },
    {
      "id": "sunan-abi-daud-4576",
      "hadith_no": "4576",
      "source": "Sunan Abi Da'ud",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا وهب بن بيان، وابن السرح، قالا حدثنا ابن وهب، أخبرني يونس، عن ابن شهاب، عن سعيد بن المسيب، وأبي، سلمة عن أبي هريرة، قال اقتتلت امرأتان من هذيل فرمت إحداهما الأخرى بحجر فقتلتها فاختصموا إلى رسول الله صلى الله عليه وسلم فقضى رسول الله صلى الله عليه وسلم دية جنينها غرة عبد أو وليدة وقضى بدية المرأة على عاقلتها وورثها ولدها ومن معهم فقال حمل بن مالك بن النابغة الهذلي يا رسول الله كيف أغرم دية من لا شرب ولا أكل ولا نطق ولا استهل فمثل ذلك يطل فقال رسول الله صلى الله عليه وسلم ‏\"‏ إنما هذا من إخوان الكهان ‏\"‏ ‏.‏ من أجل سجعه الذي سجع ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     Two women of Hudhail fought together and one of them threw a stone at the other and killed her. They brought their dispute to the Messenger of Allah (ﷺ) who gave judgement that a male or female slave of the best quality should be given as compensation for her unborn child, and he fixed it to be paid by the woman's relatives on the father's side. He made her sons and those who were with them her heirs. Hamal b. Malik b. al-Nabighah al-Hudhali said: Messenger of Allah ! how should I be fined for one who has not drunk, or eaten or spoken, or raised his voice? - adding that compensation is not to be paid for such (an offense). The Messenger of Allah (ﷺ) said: This man simply belong to the soothsayers on account of his rhymed prose which he has used.",
      "usc_msa_ref": "",
      "chain": [
        "36063",
        "30485",
        "20029",
        "20475",
        "11013",
        "11002",
        "10567",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-4600",
      "hadith_no": "4600",
      "source": "Sunan Abi Da'ud",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا ابن السرح، أخبرنا ابن وهب، قال أخبرنا يونس، عن ابن شهاب، قال فأخبرني عبد الرحمن بن عبد الله بن كعب بن مالك، أن عبد الله بن كعب، - وكان قائد كعب من بنيه حين عمي - قال سمعت كعب بن مالك، - وذكر ابن السرح قصة تخلفه عن النبي صلى الله عليه وسلم في غزوة تبوك - قال ونهى رسول الله صلى الله عليه وسلم المسلمين عن كلامنا أيها الثلاثة حتى إذا طال على تسورت جدار حائط أبي قتادة وهو ابن عمي فسلمت عليه فوالله ما رد على السلام ‏.‏ ثم ساق خبر تنزيل توبته ‏.‏",
      "text_en": " ‘Abd Allah b. Ka;b b. Malik who used to lead his father from among his sons when he became blind, said:                      I heard Ka’b b. Malik say: The transmitter Ibn al-sarh then narrated the story of his remaining behind from the prophet (ﷺ) forbade the Muslims to speak to any of us three. When ( in this state) abundant time passed on me, I ascended the wall of the garden of Abu Qatadah who was my cousin. I saluted him, but, I swear by Allah, he did not return salute to me. He then narrated the story of the revelation of the Qur’anic verses relating to his repentance.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "20475",
        "11013",
        "11519",
        "1131",
        "390"
      ]
    },
    {
      "id": "sunan-abi-daud-4679",
      "hadith_no": "4679",
      "source": "Sunan Abi Da'ud",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا أحمد بن عمرو بن السرح، حدثنا ابن وهب، عن بكر بن مضر، عن ابن الهاد، عن عبد الله بن دينار، عن عبد الله بن عمر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ما رأيت من ناقصات عقل ولا دين أغلب لذي لب منكن ‏\"‏ ‏.‏ قالت وما نقصان العقل والدين قال ‏\"‏ أما نقصان العقل فشهادة امرأتين شهادة رجل وأما نقصان الدين فإن إحداكن تفطر رمضان وتقيم أياما لا تصلي ‏\"‏ ‏.‏",
      "text_en": " 'Abd Allah b. 'Umar reported the Messenger of Allah (ﷺ) as saying:                      I did not see more defective in respect of reason and religion than the wise of you (women). A woman asked: What is the defect of reason and religion ? He replied: The defect of reason is the testimony of two women for one man, and the defect of faith is that one of you does not fast during Ramadan (when one is menstruating), and keep away from prayer for some days.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "20374",
        "11234",
        "11183",
        "18"
      ]
    },
    {
      "id": "sunan-abi-daud-4777",
      "hadith_no": "4777",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا ابن السرح، حدثنا ابن وهب، عن سعيد، - يعني ابن أبي أيوب - عن أبي مرحوم، عن سهل بن معاذ، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من كظم غيظا - وهو قادر على أن ينفذه - دعاه الله عز وجل على رءوس الخلائق يوم القيامة حتى يخيره الله من الحور ما شاء ‏\"‏ ‏.‏ قال أبو داود اسم أبي مرحوم عبد الرحمن بن ميمون ‏.‏",
      "text_en": " Narrated Mu'adh ibn Jabal:                     The Messenger of Allah (ﷺ) said: if anyone suppresses anger when he is in a position to give vent to it, Allah, the Exalted, will call him on the Day of Resurrection over the heads of all creatures, and ask him to choose any of the bright and large eyed maidens he wishes.Abu Dawud said: The name if the transmitter Abu Marhum is 'Abd al-Rahman b. Maimun",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "20375",
        "19814"
      ]
    },
    {
      "id": "sunan-abi-daud-4821",
      "hadith_no": "4821",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا ابن السرح، ومخلد بن خالد، قالا حدثنا سفيان، عن محمد بن المنكدر، قال حدثني من، سمع أبا هريرة، يقول قال أبو القاسم صلى الله عليه وسلم ‏\"‏ إذا كان أحدكم في الشمس ‏\"‏ ‏.‏ وقال مخلد ‏\"‏ في الفىء ‏\"‏ ‏.‏ ‏\"‏ فقلص عنه الظل وصار بعضه في الشمس وبعضه في الظل فليقم ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     AbulQasim (ﷺ) said: When one of you is in the sun (Shams)--Makhlad's version has \"fay'\"--and the shadow withdraws from him so that he is partly in sun and partly in shade, he should get up.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "30567",
        "20005",
        "11048",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-4915",
      "hadith_no": "4915",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا ابن السرح، حدثنا ابن وهب، عن حيوة، عن أبي عثمان الوليد بن أبي الوليد، عن عمران بن أبي أنس، عن أبي خراش السلمي، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ من هجر أخاه سنة فهو كسفك دمه ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuKhirash as-Sulami:                     AbuKhirash heard the Messenger of Allah (ﷺ) say: If one keeps apart from his brother for a year, it is like shedding his blood.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "26010",
        "10605"
      ]
    },
    {
      "id": "sunan-abi-daud-4943",
      "hadith_no": "4943",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وابن السرح، قالا حدثنا سفيان، عن ابن أبي نجيح، عن ابن عامر، عن عبد الله بن عمرو، يرويه - قال ابن السرح - عن النبي صلى الله عليه وسلم قال ‏\"‏ من لم يرحم صغيرنا ويعرف حق كبيرنا فليس منا ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     The Prophet (ﷺ) said: Those who do not show mercy to our young ones and do not realise the right of our elders are not from us.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30485",
        "20005",
        "11254",
        "30485"
      ]
    },
    {
      "id": "sunan-abi-daud-4976",
      "hadith_no": "4976",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا ابن السرح، أخبرنا ابن وهب، قال أخبرني عمرو بن الحارث، أن أبا يونس، حدثه عن أبي هريرة، في هذا الخبر ولم يذكر النبي صلى الله عليه وسلم قال ‏\"‏ وليقل سيدي ومولاى ‏\"‏ ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Abu Hurairah through a different chain of narrators. This version does not mention the Prophet (May peace be upon him) i.e, it does not go back to him. It has :                      He must  say: “My master” (sayyidi) and “My patron” (mawlaya).",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "20377"
      ]
    },
    {
      "id": "sunan-abi-daud-5006",
      "hadith_no": "5006",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا ابن السرح، حدثنا وهب، عن عبد الله بن المسيب، عن الضحاك بن شرحبيل، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من تعلم صرف الكلام ليسبي به قلوب الرجال أو الناس لم يقبل الله منه يوم القيامة صرفا ولا عدلا ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: On the Day of resurrection Allah will not accept repentance or ransom from him who learns excellence of speech to captivate thereby the hearts of men, or of people.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20298",
        "16052",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-5120",
      "hadith_no": "5120",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن عمرو بن السرح، حدثنا أيوب بن سويد، عن أسامة بن زيد، أنه سمع سعيد بن المسيب، يحدث عن سراقة بن مالك بن جعشم المدلجي، قال خطبنا رسول الله صلى الله عليه وسلم فقال ‏\"‏ خيركم المدافع عن عشيرته ما لم يأثم ‏\"‏ ‏.‏ قال أبو داود أيوب بن سويد ضعيف ‏.‏",
      "text_en": " Narrated Suraqah ibn Malik ibn Ju'sham al-Mudlaji:                     The Messenger of Allah (ﷺ) gave us an address and said: The best of you is the one who defends his tribe, so long as he commits no sin.Abu Dawud said: Abu Ayyub b. Suwaid is weak.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "28053",
        "50",
        "11002",
        "471"
      ]
    },
    {
      "id": "sunan-abi-daud-5121",
      "hadith_no": "5121",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا ابن السرح، حدثنا ابن وهب، عن سعيد بن أبي أيوب، عن محمد بن عبد الرحمن المكي، - يعني ابن أبي لبيبة - عن عبد الله بن أبي سليمان، عن جبير بن مطعم، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ليس منا من دعا إلى عصبية وليس منا من قاتل على عصبية وليس منا من مات على عصبية ‏\"‏ ‏.‏",
      "text_en": " Jubair b. Mut’im reported the Messenger of Allah (May peace be upon him) as saying:                      he who summons others to party-spirit does not belong to us; and he who dies upholding party spirit does not belong to us.’",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "20375",
        "18524",
        "871"
      ]
    },
    {
      "id": "sunan-abi-daud-5132",
      "hadith_no": "5132",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن صالح، وأحمد بن عمرو بن السرح، قالا حدثنا سفيان بن عيينة، عن عمرو بن دينار، عن وهب بن منبه، عن أخيه، عن معاوية، اشفعوا تؤجروا فإني لأريد الأمر فأؤخره كيما تشفعوا فتؤجروا فإن رسول الله صلى الله عليه وسلم قال ‏\"‏ اشفعوا تؤجروا ‏\"‏ ‏.‏",
      "text_en": " Narrated Mu'awiyah:                     Make intercession, you will be rewarded, for I purposely delay a matter so that you intercede and then you are rewarded. The Messenger of Allah (ﷺ) said: If you make intercession, you will be rewarded.",
      "usc_msa_ref": "",
      "chain": [
        "30226",
        "30485",
        "20005",
        "11081",
        "11102",
        "11447"
      ]
    },
    {
      "id": "sunan-abi-daud-5164",
      "hadith_no": "5164",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن سعيد الهمداني، وأحمد بن عمرو بن السرح، - وهذا حديث الهمداني وهو أتم - قالا حدثنا ابن وهب قال أخبرني أبو هانئ الخولاني عن العباس بن جليد الحجري قال سمعت عبد الله بن عمرو يقول جاء رجل إلى النبي صلى الله عليه وسلم فقال يا رسول الله كم نعفو عن الخادم فصمت ثم أعاد عليه الكلام فصمت فلما كان في الثالثة قال ‏\"‏ اعفوا عنه في كل يوم سبعين مرة ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     A man came to the Prophet (ﷺ) and asked: Messenger of Allah! how often shall I forgive a servant? He gave no reply, so the man repeated what he had said, but he still kept silence. When he asked a third time, he replied: Forgive him seventy times daily.",
      "usc_msa_ref": "",
      "chain": [
        "30296",
        "30485",
        "20029",
        "10856",
        "29"
      ]
    },
    {
      "id": "sunan-abi-daud-5191",
      "hadith_no": "5191",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا ابن السرح، قال حدثنا ح، وحدثنا ابن الصباح بن سفيان، وابن، عبدة - وهذا حديثه - قالا أخبرنا سفيان، عن عبيد الله بن أبي يزيد، سمع ابن عباس، يقول لم يؤمر بها أكثر الناس آية الإذن وإني لآمر جاريتي هذه تستأذن على ‏.‏ قال أبو داود وكذلك رواه عطاء عن ابن عباس يأمر به ‏.‏",
      "text_en": " Ibn ‘Abbas said :                      Most of the people did not act upon the verse about asking permission to enter the house. I have commanded this slave-girl of mine to ask my permission to enter.Abu Dawud said: 'Ata also transmitted it from Ibn 'Abbas in a similar way. He commanded to act upon this.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20005",
        "11258",
        "17",
        "11029"
      ]
    },
    {
      "id": "sunan-abi-daud-5255",
      "hadith_no": "5255",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا ابن السرح، وأحمد بن سعيد الهمداني، قالا أخبرنا ابن وهب، قال أخبرني أسامة، عن نافع، في هذا الحديث قال نافع ثم رأيتها بعد في بيته ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Nafi through a different chain of transmitters. In this version Nafi said:                      After that I saw it again in his house.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "30296",
        "20029",
        "50"
      ]
    },
    {
      "id": "sunan-abi-daud-5274",
      "hadith_no": "5274",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن الصباح بن سفيان، وابن السرح، قالا حدثنا سفيان، عن الزهري، عن سعيد، عن أبي هريرة، عن النبي صلى الله عليه وسلم ‏\"‏ يقول الله عز وجل يؤذيني ابن آدم يسب الدهر وأنا الدهر بيدي الأمر أقلب الليل والنهار ‏\"‏ ‏.‏ قال ابن السرح عن ابن المسيب مكان سعيد ‏.‏ والله أعلم ‏.‏",
      "text_en": " Abu Hurairah reported the prophet (ﷺ) as saying:                      Allah most high says : “The son of Adam injures me by abusing time, whereas I am time. Authority is in my hand. I alternate the night and the day”.Ibn al-Sarh said: “on the authority of Ibn al-Musayyab instead of Sa’id’.",
      "usc_msa_ref": "",
      "chain": [
        "30269",
        "30485",
        "20005",
        "11013",
        "11168",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-39",
      "hadith_no": "39",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا أحمد بن عمرو بن السرح، قال أنبأنا ابن وهب، قال أخبرني يونس، عن ابن شهاب، عن أبي عثمان بن سنة الخزاعي، عن عبد الله بن مسعود، أن رسول الله صلى الله عليه وسلم نهى أن يستطيب أحدكم بعظم أو روث ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin Mas'ud, that the Messenger of Allah (ﷺ) forbade cleaning oneself with bones or dung.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "20475",
        "11013",
        "16"
      ]
    },
    {
      "id": "sunan-an-nasai-116",
      "hadith_no": "116",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا أحمد بن عمرو بن السرح، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن وهب، عن يونس، عن ابن شهاب، أن عطاء بن يزيد الليثي، أخبره أن حمران مولى عثمان أخبره أن عثمان دعا بوضوء فتوضأ فغسل كفيه ثلاث مرات ثم مضمض واستنشق ثم غسل وجهه ثلاث مرات ثم غسل يده اليمنى إلى المرفق ثلاث مرات ثم غسل يده اليسرى مثل ذلك ثم مسح برأسه ثم غسل رجله اليمنى إلى الكعبين ثلاث مرات ثم غسل رجله اليسرى مثل ذلك ثم قال رأيت رسول الله صلى الله عليه وسلم توضأ نحو وضوئي هذا ثم قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من توضأ نحو وضوئي هذا ثم قام فركع ركعتين لا يحدث فيهما نفسه غفر له ما تقدم من ذنبه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Humran the freed slave of 'Uthman said:                      \"Uthman called for water for Wudu'. He washed his hands three times, then he rinsed his mouth and nose, then he washed his face three times, then washed his right hand up to the elbow three times. Then he washed his left hand likewise. Then he washed his left hand likewise. Then he wiped his head, then he washed his right foot up to the ankle three times, and he washed his left foot likewise, and he washed his left foot likewise. Then he said: 'I saw the Messenger of Allah (ﷺ) performing Wudu' as I have just done.' Then he said: \"The Messenger of Allah (ﷺ) said: 'Whoever performs Wudu' as I have just done, then prayes two Rak'ahs without letting his thoughts wander, his previous sins will be forgiven.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "36017",
        "20029",
        "20475",
        "11013",
        "11206",
        "11421"
      ]
    },
    {
      "id": "sunan-an-nasai-693",
      "hadith_no": "693",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Adhan (The Call to Prayer) - كتاب الأذان",
      "chapter_no": "7",
      "text_ar": "أخبرنا أحمد بن عمرو بن السرح، قال أنبأنا ابن وهب، قال أخبرني ابن أبي ذئب، ويونس، وعمرو بن الحارث، أن ابن شهاب، أخبرهم عن عروة، عن عائشة، قالت كان النبي صلى الله عليه وسلم يصلي فيما بين أن يفرغ من صلاة العشاء إلى الفجر إحدى عشرة ركعة يسلم بين كل ركعتين ويوتر بواحدة ويسجد سجدة قدر ما يقرأ أحدكم خمسين آية ثم يرفع رأسه فإذا سكت المؤذن من صلاة الفجر وتبين له الفجر ركع ركعتين خفيفتين ثم اضطجع على شقه الأيمن حتى يأتيه المؤذن بالإقامة فيخرج معه وبعضهم يزيد على بعض في الحديث ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                      \"Between the time when he finished 'Isha' prayer and Fajr, the Prophet (ﷺ) used to pray eleven Rak'ahs, saying the Taslim after each two Rak'ahs, then praying Witr as one Rak'ah. He would prostrate for as long as it takes one of you to recite fifty verses, then he would raise his head. When the Mu'adhdhin finished the call to Fajr prayer and he could see the dawn, he would pray two brief Rak'ahs, then he would go out with him.\" Some of these narrators (Ibn Abi Dhi'b, Yunus and 'Amr bin Al-Harith) added some phrases not mentioned by the others in the Hadith.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "20177",
        "20475",
        "20377",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-1096",
      "hadith_no": "1096",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا أحمد بن عمرو بن السرح، ويونس بن عبد الأعلى، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن وهب، عن ابن جريج، عن عبد الله بن طاوس، عن أبيه، عن ابن عباس، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أمرت أن أسجد على سبعة - لا أكف الشعر ولا الثياب - الجبهة والأنف واليدين والركبتين والقدمين ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that :                     The Messenger of Allah (ﷺ) said: \"I have been commanded to prostrate on seven, and not to tuck up my hair nor my garment: the forehead, the nose, the hands, the knees and the feet.\"",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "30493",
        "36017",
        "20029",
        "11070",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-1119",
      "hadith_no": "1119",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا أحمد بن عمرو بن السرح، قال أنبأنا ابن وهب، عن يونس، ح والحارث بن مسكين قراءة عليه وأنا أسمع، عن ابن وهب، عن يونس، عن ابن شهاب، قال أخبرني إبراهيم بن عبد الله، أن أباه، حدثه أنه، سمع عليا، قال نهاني رسول الله صلى الله عليه وسلم أن أقرأ راكعا أو ساجدا ‏.‏",
      "text_en": " 'Ali said:                     \"The Messenger of Allah (ﷺ) forbade me from reciting the Quran when bowing or prostrating.\"",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "20475",
        "36017",
        "20029",
        "20475",
        "11013",
        "5"
      ]
    },
    {
      "id": "sunan-an-nasai-1166",
      "hadith_no": "1166",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا أحمد بن عمرو بن السرح، قال حدثنا ابن وهب، قال أخبرني عمرو بن الحارث، أن زيد بن أبي أنيسة الجزري، حدثه أن أبا إسحاق حدثه عن الأسود، وعلقمة، عن عبد الله بن مسعود، قال كنا مع رسول الله صلى الله عليه وسلم لا نعلم شيئا فقال لنا رسول الله صلى الله عليه وسلم ‏\"‏ قولوا في كل جلسة التحيات لله والصلوات والطيبات السلام عليك أيها النبي ورحمة الله وبركاته السلام علينا وعلى عباد الله الصالحين أشهد أن لا إله إلا الله وأشهد أن محمدا عبده ورسوله ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Al-Aswad and 'Alqamah, that Abdullah bin Mas'ud said:                     \"We were with the Messenger of Allah (ﷺ) and we did not know anything, then the Messenger of Allah (ﷺ) said to us: \"Every time you sit (in prayer), say: At-tahiyyatu lillahi was-salawatu wat-tayyibat, as-salamu 'alaika ayyuhan-Nabiyyu wa rahmatAllahi wa baraktuhu. As-salamu 'alaina wa 'ala 'ibad illahis-salihin, ashahdu an la illaha ill-Allah wa ashhadu anna Muhammadan 'abduhu wa rasuluhu (Allah compliments, prayers and pure words are due to Allah. Peace be upon you, O Prophet, and the mercy of Allah (SWT) and his blessings. Peace be upon us and upon the righteous slaves of Allah (SWT). I bear witness that none has the right to be worshipped except Allah and I bear witness that Muhammad is His slave and Messenger).\"",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "20377",
        "11049",
        "11054",
        "11017",
        "16"
      ]
    },
    {
      "id": "sunan-an-nasai-1261",
      "hadith_no": "1261",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا أحمد بن عمرو بن السرح، قال أنبأنا ابن وهب، قال أخبرني عمرو، ويونس، والليث، أن ابن شهاب، أخبرهم عن عبد الرحمن الأعرج، أن عبد الله ابن بحينة، حدثه أن رسول الله صلى الله عليه وسلم قام في الثنتين من الظهر فلم يجلس فلما قضى صلاته سجد سجدتين كبر في كل سجدة وهو جالس قبل أن يسلم وسجدهما الناس معه مكان ما نسي من الجلوس ‏.‏",
      "text_en": " It was narrated from 'Abdur-Rahman Al A'raj that:                     Abdullah bin Buhainah told him that the Messenger of Allah (ﷺ) stood up following two rak'ahs of Zuhr and did not sit down (for tashahhud). When he finished the prayer he prostrated twice, saying Takbir for each prostration, while he was sitting, before he said the taslim, and the people prostrated with him. (He did that) in place of the sitting that he had forgotten.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "20377",
        "20475",
        "20023",
        "11013",
        "11197",
        "932"
      ]
    },
    {
      "id": "sunan-an-nasai-1276",
      "hadith_no": "1276",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا أحمد بن عمرو بن السرح، عن ابن وهب، قال أخبرني الليث، عن جعفر بن ربيعة، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لينتهين أقوام عن رفع أبصارهم عند الدعاء في الصلاة إلى السماء أو لتخطفن أبصارهم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     The Messenger of Allah (ﷺ) said: \"People should certainly stop lifting their gaze to the sky when they supplicate during the prayer, or they will lose their eyesight.\"",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "20023",
        "11407",
        "11197",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-1872",
      "hadith_no": "1872",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا أحمد بن عمرو بن السرح، قال حدثنا ابن وهب، حدثني عمرو، قال حدثني بكير بن عبد الله، عن عمران بن نافع، عن حفص بن عبيد الله، عن أنس، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من احتسب ثلاثة من صلبه دخل الجنة ‏\"‏ ‏.‏ فقامت امرأة فقالت أو اثنان قال ‏\"‏ أو اثنان ‏\"‏ ‏.‏ قالت المرأة يا ليتني قلت واحدا ‏.‏",
      "text_en": " It was narrated from Anas that the Messenger of Allah said:                     \"Whoever seeks reward for (the loss of) three of his own children, he will enter Paradise.\" A woman stood up and said: \"Or two?\" He said: \"Or two.\" The woman said: \"I wish that I had said, 'or one.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "20377",
        "11154",
        "19"
      ]
    },
    {
      "id": "sunan-an-nasai-1983",
      "hadith_no": "1983",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا أحمد بن عمرو بن السرح، عن ابن وهب، قال أخبرني عمرو بن الحارث، عن أبي حمزة بن سليم، عن عبد الرحمن بن جبير، عن أبيه، عن عوف بن مالك، قال سمعت رسول الله صلى الله عليه وسلم صلى على جنازة يقول ‏\"‏ اللهم اغفر له وارحمه واعف عنه وعافه وأكرم نزله ووسع مدخله واغسله بماء وثلج وبرد ونقه من الخطايا كما ينقى الثوب الأبيض من الدنس وأبدله دارا خيرا من داره وأهلا خيرا من أهله وزوجا خيرا من زوجه وقه عذاب القبر وعذاب النار ‏\"‏ ‏.‏ قال عوف فتمنيت أن لو كنت الميت لدعاء رسول الله صلى الله عليه وسلم لذلك الميت ‏.‏",
      "text_en": " It was narrated that 'Awf bin Malik said:                     \"I heard the Messenger of Allah offer the funeral prayer and say: Allahumma ighfir lahu warhamhu wa`fu `anhu wa `afihi, wa akrim nuzulahu wa wassi` mudkhalahu waghsilhu bi-ma'in wa thaljin wa-barad, wa naqqihi min al-khataya kama yanaqqa ath-thawb al-abyad min ad-danas. Wa abdilhu daran khairan min darihi wa ahlan khayran min ahlihi, wa zawjan khayran min zawjihi, wa qihi 'adhab al-qabri wa 'adhab an-nar (O Allah, forgive him and have mercy on him, forgive him and keep him safe and sound, honor the place where he settles and make his entrance wide; wash him with water and snow and hail, and cleanse him of his sin as a white garment is cleansed of dirt. Give him a house better than his house and a family better than his house and a family better than his family and a spouse better than his spouse. Protect him from the torment of the grave and the torment of Hell-fire).\" 'Awf said: \"I wished that I was that deceased person because of the supplication that the Messenger of Allah said for that deceased person.\"",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "20377",
        "10865",
        "10805"
      ]
    },
    {
      "id": "sunan-an-nasai-2238",
      "hadith_no": "2238",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا أحمد بن عمرو بن السرح، والحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن وهب، قال أخبرني مالك، ويونس، عن ابن شهاب، عن حميد بن عبد الرحمن، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ من أنفق زوجين في سبيل الله عز وجل نودي في الجنة يا عبد الله هذا خير فمن كان من أهل الصلاة يدعى من باب الصلاة ومن كان من أهل الجهاد يدعى من باب الجهاد ومن كان من أهل الصدقة يدعى من باب الصدقة ومن كان من أهل الصيام دعي من باب الريان ‏\"‏ ‏.‏ قال أبو بكر الصديق يا رسول الله ما على أحد يدعى من تلك الأبواب من ضرورة فهل يدعى أحد من تلك الأبواب كلها قال رسول الله صلى الله عليه وسلم ‏\"‏ نعم وأرجو أن تكون منهم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah said:                     \"Whoever spends on a pair (of things) in the cause of Allah, the Mighty and Sublime, he will be called in Paradise: 'O slave of Allah, here is prosperity, Whoever is one of the people of Salah, he will be called from the gate of salah. Whoever is on of the people of charity, he will be called from the gate of Ar-Rayyan.' Abu Bakr As-Siddiq said: 'O Messenger of Allah, no distress or need will befall the one who is called from those gates. Will there be anyone who will be called from all these gates?' The Messenger of Allah said: 'Yes, and I hope that you will be one of them.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "36017",
        "20029",
        "20001",
        "20475",
        "11013",
        "10561",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-2683",
      "hadith_no": "2683",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا أحمد بن عمرو بن السرح، والحارث بن مسكين، قراءة عليه وأنا أسمع، واللفظ، له عن ابن وهب، أخبرني يونس، عن ابن شهاب، عن سالم، عن أبيه، قال رأيت رسول الله صلى الله عليه وسلم يهل ملبدا ‏.‏",
      "text_en": " It was narrated from Salim that his father said:                     \"I saw the Messenger of Allah entering Ihram with his hair matted.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "36017",
        "20029",
        "20475",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-2769",
      "hadith_no": "2769",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا أحمد بن عمرو بن السرح، والحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن وهب، قال أخبرني يونس، عن ابن شهاب، عن سالم، قال كان ابن عمر ينكر الاشتراط في الحج ويقول أليس حسبكم سنة رسول الله صلى الله عليه وسلم إن حبس أحدكم عن الحج طاف بالبيت وبالصفا والمروة ثم حل من كل شىء حتى يحج عاما قابلا ويهدي ويصوم إن لم يجد هديا ‏.‏",
      "text_en": " It was narrated that Salim said:                     \"Ibn 'Umar used to denounce stipulating conditions in Hajj, and said: 'Is not the Sunnah of the Messenger of Allah sufficient for you? If one of you is prevented from performing (finishing) Hajj let him circumambulate the House and (perform Sai) between As-Safa and al-Marwah, then exit Ihram completely until he performs Hajj the following year. And let him offer a Hadi or fast if he con not find a Hadi.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "36017",
        "20029",
        "20475",
        "11013",
        "11011"
      ]
    },
    {
      "id": "sunan-an-nasai-3009",
      "hadith_no": "3009",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا أحمد بن عمرو بن السرح، قال حدثنا ابن وهب، أخبرني مالك، عن ابن شهاب، عن سالم بن عبد الله، أن عبد الله بن عمر، جاء إلى الحجاج بن يوسف يوم عرفة حين زالت الشمس وأنا معه، فقال الرواح إن كنت تريد السنة ‏.‏ فقال هذه الساعة قال نعم ‏.‏ قال سالم فقلت للحجاج إن كنت تريد أن تصيب اليوم السنة فاقصر الخطبة وعجل الصلاة ‏.‏ فقال عبد الله بن عمر صدق ‏.‏",
      "text_en": " It was narrated from Salim bin Abdullah that:                     Abdullah bin Umar came to Al-Hajjaj bin Yusuf on the day of Arafat when the sun has passed its zenith, and I was with him. He said: \"We have to move on if you want to follow Sunnah.\" He said to him: \"At this hours?\" He said: Yes.\" Salim said: \"I said to Al-Hajjaj: 'If you want to follow the Sunnah, then deliver a short Khutbah and hasten to pray.' Abdullah bin Umar said: 'He is telling the truth.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "20001",
        "11013",
        "11011"
      ]
    },
    {
      "id": "sunan-an-nasai-3087",
      "hadith_no": "3087",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا معتمر، قال سمعت معمرا، عن الزهري، قال قلت عن سعيد، قال نعم عن أبي هريرة، ح وأنبأنا أحمد بن عمرو بن السرح، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ لأحمد - قالا حدثنا ابن وهب، عن يونس، عن ابن شهاب، عن ابن المسيب، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ بعثت بجوامع الكلم ونصرت بالرعب وبينا أنا نائم أتيت بمفاتيح خزائن الأرض فوضعت في يدي ‏\"‏ ‏.‏ قال أبو هريرة فذهب رسول الله صلى الله عليه وسلم وأنتم تنتثلونها ‏.‏",
      "text_en": " Narrated It was narrated that Abu Hurairah said:                     :“The Messenger of Allah said: ‘I have been sent with concise speech and I have been supported with fear. While I was sleeping, the keys to the treasures of the Earth were brought to me and placed in my hands.’” Abu Hurairah said: “The Messenger of Allah has gone and you are acquiring them.”",
      "usc_msa_ref": "",
      "chain": [
        "30449",
        "20288",
        "20115",
        "11013",
        "11168",
        "13",
        "30485",
        "36017",
        "20029",
        "20475",
        "11013",
        "11002"
      ]
    },
    {
      "id": "sunan-an-nasai-3537",
      "hadith_no": "3537",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا أحمد بن عمرو بن السرح، قال حدثنا ابن وهب، قال أخبرني مخرمة، عن أبيه، قال سمعت المغيرة بن الضحاك، يقول حدثتني أم حكيم بنت أسيد، عن أمها، أن زوجها، توفي وكانت تشتكي عينها فتكتحل الجلاء فأرسلت مولاة لها إلى أم سلمة فسألتها عن كحل الجلاء فقالت لا تكتحل إلا من أمر لا بد منه دخل على رسول الله صلى الله عليه وسلم حين توفي أبو سلمة وقد جعلت على عيني صبرا فقال ‏\"‏ ما هذا يا أم سلمة ‏\"‏ ‏.‏ قلت إنما هو صبر يا رسول الله ليس فيه طيب ‏.‏ قال ‏\"‏ إنه يشب الوجه فلا تجعليه إلا بالليل ولا تمتشطي بالطيب ولا بالحناء فإنه خضاب ‏\"‏ ‏.‏ قلت بأى شىء أمتشط يا رسول الله قال ‏\"‏ بالسدر تغلفين به رأسك ‏\"‏ ‏.‏",
      "text_en": " Umm Hakim bint Asid narrated from her mother that her husband died and she had a problem in her eye, so she applied kohl to clear her eyes. She sent a freed slave woman of hers to Umm Salamah to ask her about using kohl to clear her eyes. She said:                      \"Do not use kohl unless it cannot be avoided. The Messenger of Allah entered upon me when Abu Salamah died and I had put some aloe juice on my eyes. He said: 'What is this, O Umm Salamah?' I said: 'It is aloe juice, O Messenger of Allah, there is no perfume in it.' He said: 'It makes the face look bright, so only use it at night, and do not comb your hair with perfume or henna, for it is a dye.' I said: 'With what can I comb it, O Messenger of Allah?' He said: 'With lote leaves -cover your head with them.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029"
      ]
    },
    {
      "id": "sunan-an-nasai-4028",
      "hadith_no": "4028",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا أحمد بن عمرو بن السرح، قال أخبرني ابن وهب، قال أخبرني عبد الله بن عمر، وغيره، عن حميد الطويل، عن أنس بن مالك، أن ناسا، من عرينة قدموا على رسول الله صلى الله عليه وسلم فاجتووا المدينة فبعثهم النبي صلى الله عليه وسلم إلى ذود له فشربوا من ألبانها وأبوالها فلما صحوا ارتدوا عن الإسلام وقتلوا راعي رسول الله صلى الله عليه وسلم مؤمنا واستاقوا الإبل فبعث رسول الله صلى الله عليه وسلم في آثارهم فأخذوا فقطع أيديهم وأرجلهم وسمل أعينهم وصلبهم ‏.‏",
      "text_en": " It was narrated from Anas bin Malik that:                     Some people from 'Uraynah came to the Messenger of Allah [SAW], but the climate of Al-Madinah did not suit them. The Prophet [SAW] sent them to some camels of his, and he drank some of their milk and urine. When they recovered, they apostatized from Islam and killed the herdsman of the Messenger of Allah [SAW], who was a believer, and drove the camels off. The Messenger of Allah [SAW] sent (men) after them, and they were caught. He had their hands and feet cut off, their eyes gouged out, and had them crucified.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "20507",
        "11279",
        "19"
      ]
    },
    {
      "id": "sunan-an-nasai-4036",
      "hadith_no": "4036",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا أحمد بن عمرو بن السرح، قال أنبأنا ابن وهب، قال وأخبرني يحيى بن أيوب، ومعاوية بن صالح، عن يحيى بن سعيد، عن سعيد بن المسيب، قال قدم ناس من العرب على رسول الله صلى الله عليه وسلم فأسلموا ثم مرضوا فبعث بهم رسول الله صلى الله عليه وسلم إلى لقاح ليشربوا من ألبانها فكانوا فيها ثم عمدوا إلى الراعي غلام رسول الله صلى الله عليه وسلم فقتلوه واستاقوا اللقاح فزعموا أن رسول الله صلى الله عليه وسلم قال ‏\"‏ اللهم عطش من عطش آل محمد الليلة ‏\"‏ ‏.‏ فبعث رسول الله صلى الله عليه وسلم في طلبهم فأخذوا فقطع أيديهم وأرجلهم وسمل أعينهم ‏.‏ وبعضهم يزيد على بعض إلا أن معاوية قال في هذا الحديث استاقوا إلى أرض الشرك ‏.‏",
      "text_en": " It was narrated that Sa'eed bin Al-Musayyab said:                     \"Some 'Arab people came to the Messenger of Allah [SAW] and accepted Islam, then they became sick. The Messenger of Allah [SAW] sent them to some milk camels to drink their milk. While they were with them, they attacked the herdsman, who was a slave of the Messenger of Allah [SAW], and killed him. They drove off the camels, and claimed that the Messenger of Allah [SAW] had said: 'O Allah, make thirsty the one who makes the family of Muhammad thirsty tonight.' The Messenger of Allah [SAW] sent (men) after them, and they were caught. Then he had their hands and feet cut off, and their eyes gouged out.\" Some of them (the narrators) added more than others, except that in his narration of this Hadith, Mu'awiyah said: \"They drove them off to the land of Shirk.\"",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "20379",
        "20675",
        "11062",
        "11002"
      ]
    },
    {
      "id": "sunan-an-nasai-4040",
      "hadith_no": "4040",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا أحمد بن عمرو بن السرح، قال أنبأنا ابن وهب، قال وأخبرني يحيى بن عبد الله بن سالم، وسعيد بن عبد الرحمن، وذكر، آخر عن هشام بن عروة، عن عروة بن الزبير، أنه قال أغار ناس من عرينة على لقاح رسول الله صلى الله عليه وسلم واستاقوها وقتلوا غلاما له فبعث رسول الله صلى الله عليه وسلم في آثارهم فأخذوا فقطع أيديهم وأرجلهم وسمل أعينهم ‏.‏",
      "text_en": " It was narrated that 'Urwah bin Az-Zubair said:                     \"Some people from 'Uraynah raided the milk camels of the Messenger of Allah [SAW] and drove them off, and killed a slave of his. The Messenger of Allah [SAW] sent (men) after them, and they were caught, and he had their hands and feet cut off, and their eyes gouged out.\"",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "11065",
        "10511"
      ]
    },
    {
      "id": "sunan-an-nasai-4041",
      "hadith_no": "4041",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا أحمد بن عمرو بن السرح، قال أخبرني ابن وهب، قال أخبرني عمرو بن الحارث، عن سعيد بن أبي هلال، عن أبي الزناد، عن عبد الله بن عبيد الله، عن عبد الله بن عمر، عن رسول الله صلى الله عليه وسلم ونزلت فيهم آية المحاربة ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin 'Umar:                     From the Messenger of Allah [SAW]: \"The Verse about Al-Muharabah was revealed concerning them.\"",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "20377",
        "11169",
        "11061",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-4042",
      "hadith_no": "4042",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا أحمد بن عمرو بن السرح، قال أنبأنا ابن وهب، قال أخبرني الليث، عن ابن عجلان، عن أبي الزناد، أن رسول الله صلى الله عليه وسلم لما قطع الذين سرقوا لقاحه وسمل أعينهم بالنار عاتبه الله في ذلك فأنزل الله تعالى ‏{‏ إنما جزاء الذين يحاربون الله ورسوله ‏}‏ الآية كلها ‏.‏",
      "text_en": " It was narrated from Abu Az-Zinad that:                     The Messenger of Allah [SAW] had the (hands and feet) of those who drove off his camels cut off, and their eyes gouged out with fire. Allah rebuked him for that, and Allah, Most High, revealed the entire verse: \"The recompense of those who wage war against Allah and His Messenger.\"",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "20023",
        "10616",
        "11061"
      ]
    },
    {
      "id": "sunan-an-nasai-4044",
      "hadith_no": "4044",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا أحمد بن عمرو بن السرح، والحارث بن مسكين، قراءة عليه وأنا أسمع، قال حدثنا ابن وهب، قال أخبرني محمد بن عمرو، عن ابن جريج، عن أيوب، عن أبي قلابة، عن أنس بن مالك، أن رجلا، من اليهود قتل جارية من الأنصار على حلي لها وألقاها في قليب ورضخ رأسها بالحجارة فأخذ فأمر به رسول الله صلى الله عليه وسلم أن يرجم حتى يموت ‏.‏",
      "text_en": " It was narrated from Anas bin Malik that:                     A Jewish man killed an Ansari girl for her jewelry, and threw her in an empty well, and crushed her head with a rock. He was caught and the Messenger of Allah [SAW] ordered that he be stoned to death.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "36017",
        "20029",
        "11220",
        "11070",
        "11015",
        "11047",
        "19"
      ]
    },
    {
      "id": "sunan-an-nasai-4100",
      "hadith_no": "4100",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا أحمد بن عمرو بن السرح، قال أنبأنا ابن وهب، قال أخبرني مالك، وعبد الله بن عمر، وأسامة بن زيد، ويونس بن يزيد، أن نافعا، أخبرهم عن عبد الله بن عمر، أن النبي صلى الله عليه وسلم قال ‏\"‏ من حمل علينا السلاح فليس منا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin 'Umar that :                     The Prophet [SAW] said: \"Whoever bears weapons against us, he is not one of us.\"",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "20001",
        "18",
        "50",
        "20475",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-4160",
      "hadith_no": "4160",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of al-Bay'ah - كتاب البيعة",
      "chapter_no": "39",
      "text_ar": "أخبرنا أحمد بن عمرو بن السرح، قال حدثنا ابن وهب، قال أخبرني عمرو بن الحارث، عن ابن شهاب، أن عمرو بن عبد الرحمن بن أمية بن أخي، يعلى بن أمية حدثه أن أباه أخبره أن يعلى بن أمية قال جئت رسول الله صلى الله عليه وسلم بأبي أمية يوم الفتح فقلت يا رسول الله بايع أبي على الهجرة ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أبايعه على الجهاد وقد انقطعت الهجرة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ya'la bin Umayyah said:                     \"I came to the Messenger of Allah with my father Umayyah on the Day of the Conquest (of Makkah) and said: 'O Messenger of Allah, accept my father's pledge for emigration (Al-Hijrah).' The Messenger of Allah said: 'I will accept his pledge to fight in Jihad, for the emigration (Al-Hijrah) has ceased.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "20377",
        "11013"
      ]
    },
    {
      "id": "sunan-an-nasai-4461",
      "hadith_no": "4461",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا أحمد بن عمرو بن السرح، قال حدثنا ابن وهب، عن يونس، عن ابن شهاب، عن سعيد بن المسيب، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ الحلف منفقة للسلعة ممحقة للكسب ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Prophet said:                     \"Taking oaths may help you to make a sale but it takes (blessing) away from the earnings \"(Sahih )",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "20475",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-4678",
      "hadith_no": "4678",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا أحمد بن عمرو بن السرح، قال أنبأنا ابن وهب، قال حدثني الليث بن سعد، وعمرو بن الحارث، عن بكير بن الأشج، عن عياض بن عبد الله، عن أبي سعيد الخدري، قال أصيب رجل في عهد رسول الله صلى الله عليه وسلم في ثمار ابتاعها وكثر دينه فقال رسول الله صلى الله عليه وسلم ‏\"‏ تصدقوا عليه ‏\"‏ ‏.‏ فتصدقوا عليه ولم يبلغ ذلك وفاء دينه فقال رسول الله صلى الله عليه وسلم ‏\"‏ خذوا ما وجدتم وليس لكم إلا ذلك ‏\"‏ ‏.‏",
      "text_en": " It was narrated the Abu Sa'eed Al-Khudri said:                     \"At the time of the Messenger of Allah, a man suffered loss of some fruit that he had purchased, and his debts increased. \"The Messenger of Allah said: 'Give him charity.' So the people gave him charity, but that was not enough to pay off his debts. 'The Messenger of Allah said: 'Take what you find, but you have no right to more than that.\"' (meaning his creditors).",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "20023",
        "20377",
        "11154",
        "11260",
        "38"
      ]
    },
    {
      "id": "sunan-an-nasai-4707",
      "hadith_no": "4707",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا أحمد بن عمرو بن السرح، ويونس بن عبد الأعلى، قال أنبأنا ابن وهب، قال أخبرني يونس، عن ابن شهاب، - قال أحمد بن عمرو - قال أخبرني أبو سلمة، وسليمان بن يسار، عن رجل، من أصحاب رسول الله صلى الله عليه وسلم من الأنصار أن رسول الله صلى الله عليه وسلم أقر القسامة على ما كانت عليه في الجاهلية ‏.‏",
      "text_en": " Abu Salamah and Sulaiman bin Yasar narrated from one of the Companions of the Messenger of Allah, one of the Ansar, that:                     the Messenger or Allah approved of Qasamah as it had been during the Jahiliyyah.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "30493",
        "20029",
        "20475",
        "11013",
        "10567",
        "11005"
      ]
    },
    {
      "id": "sunan-an-nasai-4710",
      "hadith_no": "4710",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا أحمد بن عمرو بن السرح، قال أنبأنا ابن وهب، قال أخبرني مالك بن أنس، عن أبي ليلى بن عبد الله بن عبد الرحمن الأنصاري، أن سهل بن أبي حثمة، أخبره أن عبد الله بن سهل ومحيصة خرجا إلى خيبر من جهد أصابهما فأتي محيصة فأخبر أن عبد الله بن سهل قد قتل وطرح في فقير أو عين فأتى يهود فقال أنتم والله قتلتموه ‏.‏ فقالوا والله ما قتلناه ‏.‏ ثم أقبل حتى قدم على رسول الله صلى الله عليه وسلم فذكر ذلك له ثم أقبل هو وحويصة وهو أخوه أكبر منه وعبد الرحمن بن سهل فذهب محيصة ليتكلم وهو الذي كان بخيبر فقال رسول الله صلى الله عليه وسلم ‏\"‏ كبر كبر ‏\"‏ ‏.‏ وتكلم حويصة ثم تكلم محيصة فقال رسول الله صلى الله عليه وسلم ‏\"‏ إما أن يدوا صاحبكم وإما أن يؤذنوا بحرب ‏\"‏ ‏.‏ فكتب النبي صلى الله عليه وسلم في ذلك فكتبوا إنا والله ما قتلناه ‏.‏ فقال رسول الله صلى الله عليه وسلم لحويصة ومحيصة وعبد الرحمن ‏\"‏ تحلفون وتستحقون دم صاحبكم ‏\"‏ ‏.‏ قالوا لا ‏.‏ قال ‏\"‏ فتحلف لكم يهود ‏\"‏ ‏.‏ قالوا ليسوا مسلمين ‏.‏ فوداه رسول الله صلى الله عليه وسلم من عنده فبعث إليهم بمائة ناقة حتى أدخلت عليهم الدار ‏.‏ قال سهل لقد ركضتني منها ناقة حمراء ‏.‏",
      "text_en": " It was narrated from Sahl bin Abi Hathmah that:                     'Abdullah bin Sahl and Muhayysah set out for Khaibar because of some problem that had arisen. Someone came to Muhayysah and he told him that 'Abdullah bin Sahl had been Killed and thrown into a pit, or a well. He came to the Jews and said: \"By Allah, you killed him. \" They said: \"By Allah, we did not kill him.\"Then he went back to the Messenger of Allah and told him about that. Then he and Huwayysah  - his brother who was older than him - and 'Abdur-Rahman bin Sahl, came (to the Prophet). Muhayysah, who was the one who had been at Khaibar, began to speak, but the messenger of Allah said: \"Let the elder speak first,\" So Huwayysah elder speaks first.\" So Huwayysah spoke, then Muhayysah spoke. The Messenger of Allah said: \"Either (the Jews) will pay the Diyah for your comanion, or war will be declared on them.\" The Messenger of Allah sent a letter to that effect (to the Jews) and they wrote back saying: \"By Allah, we did not kill him.\" The Messenger of Allah said to Huwayysah. Muhayysah and 'Abdur-Rahman: \"Will you swear an oath establishing your claim to the blood money of your companion?\" They said: \"No.\" He said: \"Should the jews swear an oath for you? They said: \"They are not Muslims.\" So the Messenger of Allah paid (the Diyah) himself, and he sent one hundred she-camels to their abodes. Sahl said: \"A red she-camel from among them kicked me.\"",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "20001",
        "1822"
      ]
    },
    {
      "id": "sunan-an-nasai-4807",
      "hadith_no": "4807",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا أحمد بن عمرو بن السرح، قال أنبأنا ابن وهب، قال أخبرني أسامة بن زيد، عن عمرو بن شعيب، عن أبيه، عن عبد الله بن عمرو، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ عقل الكافر نصف عقل المؤمن ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from his father, from 'Abdullah bin 'Amr, that the Messenger of Allah said:                     \"The blood money for a disbeliever is half the blood money for the believer.\" (Hassan)",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "50",
        "19934",
        "19911",
        "29"
      ]
    },
    {
      "id": "sunan-an-nasai-4818",
      "hadith_no": "4818",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا أحمد بن عمرو بن السرح، قال حدثنا عبد الله بن وهب، قال أخبرني يونس، عن ابن شهاب، عن أبي سلمة، وسعيد بن المسيب، عن أبي هريرة، أنه قال اقتتلت امرأتان من هذيل فرمت إحداهما الأخرى بحجر وذكر كلمة معناها فقتلتها وما في بطنها فاختصموا إلى رسول الله صلى الله عليه وسلم فقضى رسول الله صلى الله عليه وسلم أن دية جنينها غرة عبد أو وليدة وقضى بدية المرأة على عاقلتها وورثها ولدها ومن معهم ‏.‏ فقال حمل بن مالك بن النابغة الهذلي يا رسول الله كيف أغرم من لا شرب ولا أكل ولا نطق ولا استهل فمثل ذلك يطل فقال رسول الله صلى الله عليه وسلم ‏\"‏ إنما هذا من إخوان الكهان ‏\"‏ ‏.‏ من أجل سجعه الذي سجع ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"Two women of Hudhail had a fight, and one of them threw a rock at the other and killed her and the child in her womb. They referred the dispute to the Messenger of Allah, and the Messenger of Allah ruled that the Diyah for her fetus was a male or female slave, and that the Diyah of the woman be paid by her 'Aqilah (male relatives on the father's side). And he made her children and those who were with them her heirs. Hamal bin Malik bin An-Nabighah Al-Hudhali said: \"O Messenger of Allah, how can I pay blood money for one who neither ate nor drank, or shouted such a one should be over looked.\" The Messenger of Allah said: \"This is one of the brothers of the soothsayers\" because of the rhyming way in which he spoke.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "20475",
        "11013",
        "10567",
        "11002",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-4819",
      "hadith_no": "4819",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا أحمد بن عمرو بن السرح، قال حدثنا ابن وهب، قال أخبرني مالك، عن ابن شهاب، عن أبي سلمة بن عبد الرحمن، عن أبي هريرة، أن امرأتين، من هذيل في زمان رسول الله صلى الله عليه وسلم رمت إحداهما الأخرى فطرحت جنينها فقضى فيه رسول الله صلى الله عليه وسلم بغرة عبد أو وليدة ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     there were two women of Hudhail during the time of the Messenger of Allah, one of whom threw something at the other and caused her to miscarry. The Messenger of Allah ruled that (Diyah of ) a male or female slave be paid for that.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "20001",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-4855",
      "hadith_no": "4855",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا أحمد بن عمرو بن السرح، قال حدثنا ابن وهب، قال أخبرني يونس بن يزيد، عن ابن شهاب، قال قرأت كتاب رسول الله صلى الله عليه وسلم الذي كتب لعمرو بن حزم حين بعثه على نجران - وكان الكتاب عند أبي بكر بن حزم - فكتب رسول الله صلى الله عليه وسلم ‏\"‏ هذا بيان من الله ورسوله ‏{‏ يا أيها الذين آمنوا أوفوا بالعقود ‏}‏ ‏\"‏ ‏.‏ وكتب الآيات منها حتى بلغ ‏{‏ إن الله سريع الحساب ‏}‏ ثم كتب ‏\"‏ هذا كتاب الجراح في النفس مائة من الإبل ‏\"‏ ‏.‏ نحوه ‏.‏",
      "text_en": " It was narrated that Ibn shihab said:                     \"I read the letter of the Messenger of allah which he wrote for 'Amr bin Hazm when he sent him to govern Najran. The letter was with Abu Bakr bin Hazm. The Messenger of Allah wrote this; 'A statement from Allah and His Messenger; O you who believe! Fulfill (your) obligations, and he wrote the Verses until he reached. Verily, Allah is Swift in reckoning. Then he wrote: 'this is the book if retaliation: For a soul, one hundred camels, '''' and so on",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "20475",
        "11013"
      ]
    },
    {
      "id": "sunan-an-nasai-4929",
      "hadith_no": "4929",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرنا أحمد بن عمرو بن السرح، قال حدثنا ابن وهب، قال أخبرني عبد الرحمن بن سلمان، ‏{‏ عن ابن الهاد، ‏}‏ عن أبي بكر بن محمد بن حزم، عن عمرة، عن عائشة، عن رسول الله صلى الله عليه وسلم مثل الأول ‏.‏",
      "text_en": " Narrator mentioned in hadith:                     A similar report was narrated from 'Aishah from the Messenger of Allah.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "11455",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-4936",
      "hadith_no": "4936",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرني أحمد بن عمرو بن السرح، قال حدثنا ابن وهب، قال أخبرني مخرمة، عن أبيه، عن سليمان بن يسار، عن عمرة، عن عائشة، أنها سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا تقطع يد السارق إلا في ربع دينار فصاعدا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Aishah that she heard the Messenger of Allah say:                     \"The hand of a thief is not to be cut off except for one-quarter of a Dinar or more.\"",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "11005",
        "11455",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-5093",
      "hadith_no": "5093",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا أحمد بن عمرو بن السرح، قال أنبأنا ابن وهب، قال أخبرني مخرمة بن بكير، عن أبيه، عن سعيد المقبري، قال رأيت معاوية بن أبي سفيان على المنبر ومعه في يده كبة من كبب النساء من شعر فقال ما بال المسلمات يصنعن مثل هذا إني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ أيما امرأة زادت في رأسها شعرا ليس منه فإنه زور تزيد فيه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Sa'eed Al-Maqburi said:                     \"I saw Mu'awiyah bin Abi Sufyan on the Minbar, holding a ball of hair such as women use. He said: \"What is wrong with Muslim women who put such things (on their heads)? I heard the Messenger of Allah [SAW] say: \"Any woman who adds hair to her head that is not hers, it is something false, that she is adding to her head.\"",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "20517",
        "11154",
        "11168"
      ]
    },
    {
      "id": "sunan-an-nasai-5111",
      "hadith_no": "5111",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا أحمد بن عمرو بن السرح، قال حدثنا ابن وهب، قال أخبرني الليث، عن يزيد بن أبي حبيب، عن أبي الحصين الحميري، عن أبي ريحانة، قال بلغنا أن رسول الله صلى الله عليه وسلم نهى عن الوشر والوشم ‏.‏",
      "text_en": " It was narrated that Abu Raihanah said:                     \"We heard that the Messenger of Allah [SAW] forbade filing (the teeth) and tattoos.\"",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "20023",
        "11411",
        "16107",
        "10696"
      ]
    },
    {
      "id": "sunan-an-nasai-5188",
      "hadith_no": "5188",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا أحمد بن عمرو بن السرح، قال أنبأنا ابن وهب، قال أخبرني عمرو بن الحارث، عن بكر بن سوادة، أن أبا النجيب، حدثه أن أبا سعيد الخدري حدثه أن رجلا قدم من نجران إلى رسول الله صلى الله عليه وسلم وعليه خاتم من ذهب فأعرض عنه رسول الله صلى الله عليه وسلم وقال ‏\"‏ إنك جئتني وفي يدك جمرة من نار ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'eed Al-Khudri narrated that:                     A man came from Najran to the Messenger of Allah [SAW]. He was wearing a gold ring, and the Messenger of Allah [SAW] turned away from him, and said: \"You have come to me with a coal of fire on your hand.\"",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "20377",
        "10849",
        "38"
      ]
    },
    {
      "id": "sunan-an-nasai-5191",
      "hadith_no": "5191",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا أحمد بن عمرو بن السرح، قال حدثنا ابن وهب، قال أخبرني يونس، عن ابن شهاب، قال أخبرني أبو إدريس الخولاني، أن رجلا، ممن أدرك النبي صلى الله عليه وسلم لبس خاتما من ذهب نحوه ‏.‏ قال أبو عبد الرحمن وحديث يونس أولى بالصواب من حديث النعمان ‏.‏",
      "text_en": " Abu Idris Al-Khawlani narrated that:                     A man, among those who met the Prophet [SAW], wore a gold ring. A similar report.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "20475",
        "11013",
        "11027"
      ]
    },
    {
      "id": "sunan-an-nasai-5475",
      "hadith_no": "5475",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا أحمد بن عمرو بن السرح، قال أنبأنا ابن وهب، قال حدثني حيى بن عبد الله، قال حدثني أبو عبد الرحمن الحبلي، عن عبد الله بن عمرو بن العاص، أن رسول الله صلى الله عليه وسلم كان يدعو بهؤلاء الكلمات ‏\"‏ اللهم إني أعوذ بك من غلبة الدين وغلبة العدو وشماتة الأعداء ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin 'Amr bin Al-'As that:                     The Messenger of Allah [SAW] used to say these words in his supplication: \"Allahumma inni a'udhu bika min ghalabatid-dain, wa ghalabatil-'aduwwi, wa shamatatil-a'da'. (O Allah, I seek refuge with You from being overwhelmed with debt, from being overpowered by the enemy and from the enemy rejoicing over my misfortunes.)'\"",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "10938",
        "29"
      ]
    },
    {
      "id": "sunan-an-nasai-5485",
      "hadith_no": "5485",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا أحمد بن عمرو بن السرح، قال حدثنا ابن وهب، قال أخبرني سالم بن غيلان، عن دراج أبي السمح، عن أبي الهيثم، عن أبي سعيد الخدري، عن رسول الله صلى الله عليه وسلم أنه كان يقول ‏\"‏ اللهم إني أعوذ بك من الكفر والفقر ‏\"‏ ‏.‏ فقال رجل ويعدلان قال ‏\"‏ نعم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Sa'eed Al-Khudri that:                     The Messenger of Allah [SAW] used to say: \"A'udhu billahi minal-kufri wal-faqr. (O Allah, I seek refuge with You from Kufr and poverty.)\" A man said: \"Are they equal?\" He said: \"Yes.\"",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "26013",
        "19891",
        "38"
      ]
    },
    {
      "id": "sunan-an-nasai-5487",
      "hadith_no": "5487",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا أحمد بن عمرو بن السرح، قال حدثني ابن وهب، قال أخبرني حيى بن عبد الله، قال حدثني أبو عبد الرحمن الحبلي، عن عبد الله بن عمرو بن العاص، أن رسول الله صلى الله عليه وسلم كان يدعو بهؤلاء الكلمات ‏\"‏ اللهم إني أعوذ بك من غلبة الدين وغلبة العدو وشماتة الأعداء ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin 'Amr bin Al-'As that:                     The Messenger of Allah [SAW] used to say supplication in these words: \"Allahumma inni a'udhu bika min ghalabatid-dain, wa ghalabatil-'aduwwi, wa shamatatil-a'da'. (O Allah, I seek refuge with You from being overwhelmed by debt and from being overpowered by the enemy, and from the enemy rejoicing at my misfortune.)\"",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "10938",
        "29"
      ]
    },
    {
      "id": "sunan-ibn-majah-700-2",
      "hadith_no": "700",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Prayer - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن عمرو بن السرح، وحرملة بن يحيى المصريان، قالا حدثنا عبد الله بن وهب، قال أخبرني يونس، عن ابن شهاب، عن عروة، عن عائشة، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ من أدرك من الصبح ركعة قبل أن تطلع الشمس فقد أدركها ومن أدرك من العصر ركعة قبل أن تغيب الشمس فقد أدركها ‏\"‏ ‏.‏ حدثنا جميل بن الحسن، حدثنا عبد الأعلى، حدثنا معمر، عن الزهري، عن أبي سلمة، عن أبي هريرة، أن رسول الله  صلى الله عليه وسلم  قال فذكر نحوه ‏.‏",
      "text_en": " It was narrated from 'Aishah that:                     The Messeenger of Allah said: \"Whoever catches one Rak'ah of the Subh before the sun rises, then he has caught it, and whoever catches one Rak'ah of the 'Asr before the sun sets, then he has caught it.\" (Sahih)Another chain with similar wording.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "30487",
        "20029",
        "20475",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "id": "sunan-ibn-majah-1845",
      "hadith_no": "1845",
      "source": "Sunan Ibn Majah",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا أحمد بن عمرو بن السرح، حدثنا عبد الله بن وهب، أنبأنا يونس، أن نافعا، حدثه عن عبد الله بن عمر، أن رسول الله  صلى الله عليه وسلم  كان يعتكف العشر الأواخر من رمضان ‏.‏ قال نافع وقد أراني عبد الله بن عمر المكان الذي كان يعتكف فيه رسول الله  صلى الله عليه وسلم  ‏.‏",
      "text_en": " It wasnarrated from ‘Abdullah bin ‘Umar that:                      The Messenger of Allah(ﷺ) used to spend the last ten days of Ramadan in I’tikaf.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "20475",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-ibn-majah-2834",
      "hadith_no": "2834",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Shares of Inheritance - كتاب الفرائض",
      "chapter_no": "23",
      "text_ar": "حدثنا أحمد بن عمرو بن السرح، حدثنا عبد الله بن وهب، أنبأنا يونس، عن ابن شهاب، عن علي بن الحسين، أنه حدثه أن عمرو بن عثمان أخبره عن أسامة بن زيد، أنه قال يا رسول الله أتنزل في دارك بمكة قال ‏\"‏ وهل ترك لنا عقيل من رباع أو دور ‏\"‏ ‏.‏ وكان عقيل ورث أبا طالب هو وطالب ولم يرث جعفر ولا علي شيئا لأنهما كانا مسلمين وكان عقيل وطالب كافرين ‏.‏ فكان عمر من أجل ذلك يقول لا يرث المؤمن الكافر ‏.‏",
      "text_en": " It wasnarrated from Usamah bin Zaid that he said:                      “O Messenger of Allah,will you stay in your house in Makkah?” He said: “Has ‘Aqeelleft us any houses?”",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "20475",
        "11013",
        "11045",
        "10581",
        "50"
      ]
    },
    {
      "id": "sunan-ibn-majah-3061",
      "hadith_no": "3061",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أحمد بن عمرو بن السرح، أنبأنا عبد الله بن وهب، عن يونس، عن ابن شهاب، عن عبيد الله بن عبد الله، عن ابن عباس، أن النبي  صلى الله عليه وسلم  طاف في حجة الوداع على بعير يستلم الركن بمحجن ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Abbas that the Prophet (ﷺ) performedTawaf ona camel during the Farewell Pilgrimage, touching the cornerwith astaff.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "20475",
        "11013",
        "11004",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-3346",
      "hadith_no": "3346",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hunting - كتاب الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا أحمد بن عمرو بن السرح، وأحمد بن عيسى المصريان، قالا حدثنا عبد الله بن وهب، أخبرني يونس، عن ابن شهاب، عن سعيد بن المسيب، وأبي، سلمة بن عبد الرحمن عن أبي هريرة، عن نبي الله  صلى الله عليه وسلم  قال ‏\"‏ إن نبيا من الأنبياء قرصته نملة فأمر بقرية النمل فأحرقت فأوحى الله عز وجل إليه في أن قرصتك نملة أهلكت أمة من الأمم تسبح ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Prophet of Allah (ﷺ)said:                      “Oneof the Prophets was bitten by an ant, so he ordered thatthe antcolony be burned. Then Allah revealed to him: ‘Becauseone antbityou, you destroy one of the nations that glorify Allah?’”",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "30227",
        "20029",
        "20475",
        "11013",
        "11002",
        "10567",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-3352",
      "hadith_no": "3352",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hunting - كتاب الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا أحمد بن عمرو بن السرح، حدثنا عبد الله بن وهب، أخبرني يونس، عن ابن شهاب، عن عروة بن الزبير، عن عائشة، أن رسول الله  صلى الله عليه وسلم  قال للوزغ ‏\"‏ الفويسقة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Aishah that the Messenger of Allah (ﷺ) saidconcerning house lizards:                      “Vermin.”",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "20475",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "id": "sunan-ibn-majah-3544",
      "hadith_no": "3544",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Drinks - كتاب الأشربة",
      "chapter_no": "30",
      "text_ar": "حدثنا أحمد بن عمرو بن السرح، حدثنا ابن وهب، عن يونس، عن ابن شهاب، عن عبيد الله بن عبد الله بن عتبة، عن أبي سعيد الخدري، قال نهى رسول الله  صلى الله عليه وسلم  عن اختناث الأسقية أن يشرب من أفواهها ‏.‏",
      "text_en": " It wasnarrated that Abu Sa’eed Al-Khudri said:                      “The Messenger ofAllah(ﷺ) forbade tipping up water skins in order to drink fromtheirmouths.”",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "20475",
        "11013",
        "11004",
        "38"
      ]
    },
    {
      "id": "sunan-ibn-majah-3664",
      "hadith_no": "3664",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا أحمد بن عمرو بن السرح، حدثنا عبد الله بن وهب، أخبرني يونس، عن ابن شهاب، عن سالم، عن أبيه، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ اقتلوا الحيات واقتلوا ذا الطفيتين والأبتر فإنهما يلتمسان البصر ويسقطان الحبل ‏\"‏ ‏.‏",
      "text_en": " it wasnarrated from Salim, from his father, that the Messenger ofAllah(ﷺ) said:                      “Kill snakes, and kill Dhit-Tufytain and the Abtar,*for they take away the sight and cause miscarriage.”",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "20475",
        "11013",
        "11011",
        "18"
      ]
    }
  ],
  "total_hadiths": 142
}