{
  "id": "3048",
  "name": "al-Sa'ib bin Yazid bin Akht Namr ( السائب بن يزيد بن أخت النمر ( رضي الله عنه",
  "full_name": "al-Sa'ib bin Yazid bin Akht Namr ( السائب بن يزيد بن أخت النمر ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Yemen"
    },
    "death": {
      "date_hijri": "91",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Medina",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Yemen",
      "Medina"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ ع  -  صحابة ]"
    ],
    "tags": [
      "al-Kundi",
      "Child",
      "Farewell Hajj"
    ]
  },
  "parents": [
    {
      "id": "3047",
      "name": "Yazid bin Sa'id bin Thamama ( يزيد بن سعيد بن ثمامة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "12216",
      "name": "'Abdullah bin al-Sa'ib عبد الله بن السائب بن يزيد الكندي",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "2600",
      "name": "Huwaytib bin 'Abdul 'Uzza ( حويطب بن عبد العزى القرشي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3",
      "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4",
      "name": "'Uthman ibn 'Affaan ( عثمان بن عفان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "2605",
      "name": "'Abdullah bin al-Sa'di ( عبد الله بن السعدي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3047",
      "name": "Yazid bin Sa'id bin Thamama ( يزيد بن سعيد بن ثمامة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "586",
      "name": "al-'Ala' bin al-Hadrami ( العلاء بن الحضرمي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "6",
      "name": "Talha ibn 'Ubaidullah ( طلحة بن عبيد الله ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "9",
      "name": "Sa'd ibn Abi Waqqas ( سعد بن أبي وقاص ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5065",
      "name": "Sufyan bin Abi Zuhyr ( سفيان بن أبي زهير الأزدي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3195",
      "name": "'Abdur Rahman bin 'Abd al-Qari ( عبد الرحمن بن عبد القاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "27",
      "name": "Mu'awiya ibn Abu Sufyan ( معاوية بن أبي سفيان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "12216",
      "name": "'Abdullah bin al-Sa'ib عبد الله بن السائب بن يزيد الكندي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10888",
      "name": "Ibrahim bin 'Abdullah bin Qariz إبراهيم بن عبد الله بن قارظ",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10561",
      "name": "Humaid bin 'Abdur Rahman حميد بن عبد الرحمن بن عوف الزهرى",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11193",
      "name": "'Abdur Rahman bin Humaid bin 'AR عبد الرحمن بن حميد بن عبد الرحمن",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "14091",
      "name": "Hamza bin Sfynh al-'Abbassri حمزة بن سفينة البصري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10654",
      "name": "'Umar bin 'Ata'a bin Abi al-Khawar عمر بن عطاء بن أبي الخوار",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11539",
      "name": "Muhammad bin Yusuf B. 'Abdullah al-Kundi محمد بن يوسف بن عبد الله الكندي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11062",
      "name": "Yahya bin Sa'id al-Ansari يحيى بن سعيد الأنصاري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11235",
      "name": "Yazid bin 'Abdullah bin Khusayfa يزيد بن عبد الله بن خصيفة",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "190",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا عبد الرحمن بن يونس، قال حدثنا حاتم بن إسماعيل، عن الجعد، قال سمعت السائب بن يزيد، يقول ذهبت بي خالتي إلى النبي صلى الله عليه وسلم فقالت يا رسول الله، إن ابن أختي وجع‏.‏ فمسح رأسي ودعا لي بالبركة، ثم توضأ فشربت من وضوئه، ثم قمت خلف ظهره، فنظرت إلى خاتم النبوة بين كتفيه مثل زر الحجلة‏.‏",
      "text_en": " Narrated As-Sa'ib bin Yazid:                     My aunt took me to the Prophet and said, \"O Allah's Apostle! This son of my sister has got a disease in his legs.\" So he passed his hands on my head and prayed for Allah's blessings for me; then he performed ablution and I drank from the remaining water. I stood behind him and saw the seal of Prophethood between his shoulders, and it was like the \"Zir-al-Hijla\" (means the button of a small tent, but some said 'egg of a partridge.' etc.)",
      "chain": [
        "30256",
        "20159",
        "11580",
        "3048"
      ]
    },
    {
      "hadith_no": "470",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا علي بن عبد الله، قال حدثنا يحيى بن سعيد، قال حدثنا الجعيد بن عبد الرحمن، قال حدثني يزيد بن خصيفة، عن السائب بن يزيد، قال كنت قائما في المسجد فحصبني رجل، فنظرت فإذا عمر بن الخطاب فقال اذهب فأتني بهذين‏.‏ فجئته بهما‏.‏ قال من أنتما  أو من أين أنتما قالا من أهل الطائف‏.‏ قال لو كنتما من أهل البلد لأوجعتكما، ترفعان أصواتكما في مسجد رسول الله صلى الله عليه وسلم",
      "text_en": " Narrated Al-Sa'ib bin Yazid:                     I was standing in the mosque and somebody threw a gravel at me. I looked and found that he was `Umar bin Al-Khattab. He said to me, \"Fetch those two men to me.\" When I did, he said to them, \"Who are you? (Or) where do you come from?\" They replied, \"We are from Ta'if.\" `Umar said, \"Were you from this city (Medina) I would have punished you for raising your voices in the mosque of Allah's Apostle.\"",
      "chain": [
        "30026",
        "20031",
        "11679",
        "11235",
        "3048"
      ]
    },
    {
      "hadith_no": "912",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا آدم، قال حدثنا ابن أبي ذئب، عن الزهري، عن السائب بن يزيد، قال كان النداء يوم الجمعة أوله إذا جلس الإمام على المنبر على عهد النبي صلى الله عليه وسلم وأبي بكر وعمر  رضى الله عنهما  فلما كان عثمان  رضى الله عنه  وكثر الناس زاد النداء الثالث على الزوراء‏.‏",
      "text_en": " Narrated As-Saib bin Yazid:                     In the lifetime of the Prophet, Abu Bakr and `Umar, the Adhan for the Jumua prayer used to be pronounced when the Imam sat on the pulpit. But during the Caliphate of `Uthman when the Muslims increased in number, a third Adhan at Az-Zaura' was added. Abu `Abdullah said, \"Az-Zaura' is a place in the market of Medina.\"",
      "chain": [
        "20404",
        "20177",
        "11013",
        "3048"
      ]
    },
    {
      "hadith_no": "913",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا أبو نعيم، قال حدثنا عبد العزيز بن أبي سلمة الماجشون، عن الزهري، عن السائب بن يزيد، أن الذي، زاد التأذين الثالث يوم الجمعة عثمان بن عفان  رضى الله عنه  حين كثر أهل المدينة، ولم يكن للنبي صلى الله عليه وسلم مؤذن غير واحد، وكان التأذين يوم الجمعة حين يجلس الإمام، يعني على المنبر‏.‏",
      "text_en": " Narrated As-Saib bin Yazid:                     The person who increased the number of Adhans for the Jumua prayers to three was `Uthman bin `Affan and it was when the number of the (Muslim) people of Medina had increased. In the lifetime of the Prophet there was only one Mu'adh-dhin and the Adhan used to be pronounced only after the Imam had taken his seat (i.e. on the pulpit).",
      "chain": [
        "20348",
        "20026",
        "11013",
        "3048"
      ]
    },
    {
      "hadith_no": "915",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا يحيى بن بكير، قال حدثنا الليث، عن عقيل، عن ابن شهاب، أن السائب بن يزيد، أخبره أن التأذين الثاني يوم الجمعة أمر به عثمان حين كثر أهل المسجد، وكان التأذين يوم الجمعة حين يجلس الإمام‏.‏",
      "text_en": " Narrated As-Sa'ib bin Yazid I:                     `Uthman bin `Affan introduced the second Adhan on Fridays when the number of the people in the mosque increased. Previously the Adhan on Fridays used to be pronounced only after the Imam had taken his seat (on the pulpit).",
      "chain": [
        "30399",
        "20023",
        "11207",
        "11013",
        "3048"
      ]
    },
    {
      "hadith_no": "916",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن مقاتل، قال أخبرنا عبد الله، قال أخبرنا يونس، عن الزهري، قال سمعت السائب بن يزيد، يقول إن الأذان يوم الجمعة كان أوله حين يجلس الإمام يوم الجمعة على المنبر في عهد رسول الله صلى الله عليه وسلم وأبي بكر وعمر  رضى الله عنهما  فلما كان في خلافة عثمان  رضى الله عنه  وكثروا، أمر عثمان يوم الجمعة بالأذان الثالث، فأذن به على الزوراء، فثبت الأمر على ذلك‏.‏",
      "text_en": " Narrated Az-Zuhri:                     I heard As-Saib bin Yazid, saying, \"In the lifetime of Allah's Apostle, and Abu Bakr and `Umar, the Adhan for the Jumua prayer used to be pronounced after the Imam had taken his seat on the pulpit. But when the people increased in number during the caliphate of `Uthman, he introduced a third Adhan (on Friday for the Jumua prayer) and it was pronounced at Az-Zaura' and that new state of affairs remained so in the succeeding years.",
      "chain": [
        "30118",
        "20025",
        "20475",
        "11013",
        "3048"
      ]
    },
    {
      "hadith_no": "1889",
      "source": " Sahih Bukhari ",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا عبد الرحمن بن يونس، حدثنا حاتم بن إسماعيل، عن محمد بن يوسف، عن السائب بن يزيد، قال حج بي مع رسول الله صلى الله عليه وسلم وأنا ابن سبع سنين‏.‏",
      "text_en": " Narrated As-Sa'ib bin Yazid:                     (While in the company of my parents) I was made to perform Hajj with Allah's Apostle and I was a seven-year-old boy then. (Fath-ul-Bari, p.443, Vol.4)",
      "chain": [
        "30256",
        "20159",
        "30388",
        "3048"
      ]
    },
    {
      "hadith_no": "2323",
      "source": " Sahih Bukhari ",
      "chapter": "Agriculture - كتاب المزارعة",
      "chapter_no": "41",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن يزيد بن خصيفة، أن السائب بن يزيد، حدثه أنه، سمع سفيان بن أبي زهير  رجلا من أزد شنوءة  وكان من أصحاب النبي صلى الله عليه وسلم قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من اقتنى كلبا لا يغني عنه زرعا ولا ضرعا، نقص كل يوم من عمله قيراط ‏\"‏‏.‏ قلت أنت سمعت هذا من رسول الله صلى الله عليه وسلم قال إي ورب هذا المسجد‏.‏",
      "text_en": " Narrated As-Sa'ib bin Yazid:                     Abu Sufyan bin Abu Zuhair, a man from Azd Shanu'a and one of the companions of the Prophet said, \"I heard Allah's Apostle saying, 'If one keeps a dog which is meant for guarding neither a farm nor cattle, one Qirat of the reward of his good deeds is deducted daily.\" I said, \"Did you hear this from Allah's Apostle?\" He said, \"Yes, by the Lord of this Mosque.\"",
      "chain": [
        "30355",
        "20001",
        "11235",
        "3048"
      ]
    },
    {
      "hadith_no": "2824",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا حاتم، عن محمد بن يوسف، عن السائب بن يزيد، قال صحبت طلحة بن عبيد الله وسعدا والمقداد بن الأسود وعبد الرحمن بن عوف  رضى الله عنهم  فما سمعت أحدا، منهم يحدث عن رسول الله صلى الله عليه وسلم، إلا أني سمعت طلحة يحدث عن يوم أحد‏.‏",
      "text_en": " Narrated As-Sa'-ib bin Yazid:                     I was in the company of Talha bin 'Ubaidullah, Sa`d, Al-Miqdad bin Al-Aswad and `Abdur Rahman bin `Auf and I heard none of them narrating anything from Allah's Apostle but Talha was talking about the day (of the battle) of Uhud.",
      "chain": [
        "30367",
        "20159",
        "30388",
        "3048"
      ]
    },
    {
      "hadith_no": "3083",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا مالك بن إسماعيل، حدثنا ابن عيينة، عن الزهري، قال قال السائب بن يزيد  رضى الله عنه ذهبنا نتلقى رسول الله صلى الله عليه وسلم مع الصبيان إلى ثنية الوداع‏.‏",
      "text_en": " Narrated As-Sa'ib bin Yazid:                     I along with some boys went out to receive Allah's Apostle at Thaniyatal-Wada`.",
      "chain": [
        "20357",
        "20005",
        "11013",
        "3048"
      ]
    },
    {
      "hadith_no": "3325",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا عبد الله بن مسلمة، حدثنا سليمان، قال أخبرني يزيد بن خصيفة، قال أخبرني السائب بن يزيد، سمع سفيان بن أبي زهير الشنئي، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ من اقتنى كلبا لا يغني عنه زرعا ولا ضرعا، نقص من عمله كل يوم قيراط ‏\"‏‏.‏ فقال السائب أنت سمعت هذا من رسول الله صلى الله عليه وسلم قال إي ورب هذه القبلة‏.‏",
      "text_en": " Narrated Sufyan bin Abi Zuhair Ash-Shani:                     That he heard Allah's Apostle saying, \"If somebody keeps a dog that is neither used for farm work nor for guarding the livestock, he will lose one Qirat (of the reward) of his good deeds everyday.\"",
      "chain": [
        "20164",
        "20160",
        "11235",
        "3048"
      ]
    },
    {
      "hadith_no": "3581",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا محمد بن عبيد الله، حدثنا حاتم، عن الجعيد بن عبد الرحمن، قال سمعت السائب بن يزيد، قال ذهبت بي خالتي إلى رسول الله صلى الله عليه وسلم فقالت يا رسول الله إن ابن أختي‏.‏ وقع فمسح رأسي ودعا لي بالبركة، وتوضأ فشربت من وضوئه، ثم قمت خلف ظهره فنظرت إلى خاتم بين كتفيه‏.‏ قال ابن عبيد الله الحجلة من حجل الفرس الذي بين عينيه‏.‏ قال إبراهيم بن حمزة مثل زر الحجلة",
      "text_en": " Narrated As- Scab bin Yazid:                     My aunt took me to Allah's Apostle and said, \"O Allah's Apostle! My nephew is sick\"' The Prophet passed his hands over my head and blessed me. Then he performed ablution and I drank the remaining water, and standing behind him. A saw the seal in between his shoulders.\"",
      "chain": [
        "30213",
        "20159",
        "11679",
        "3048"
      ]
    },
    {
      "hadith_no": "4111",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبد الله بن أبي الأسود، حدثنا حاتم بن إسماعيل، عن محمد بن يوسف، قال سمعت السائب بن يزيد، قال صحبت عبد الرحمن بن عوف وطلحة بن عبيد الله والمقداد وسعدا رضى الله عنهم فما سمعت أحدا منهم يحدث عن النبي صلى الله عليه وسلم، إلا أني سمعت طلحة يحدث عن يوم أحد",
      "text_en": " Narrated As-Saib bin Yazid:                     I have been in the company of `AbdurRahman bin `Auf, Talha bin 'Ubaidullah, Al-Miqdad and Sa`d, and I heard none of them narrating anything from the Prophet excepting the fact that I heard Talha narrating about the day of Uhud (battle) .",
      "chain": [
        "30145",
        "20159",
        "30388",
        "3048"
      ]
    },
    {
      "hadith_no": "4470",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، قال سمعت الزهري، عن السائب بن يزيد، يقول أذكر أني خرجت مع الغلمان إلى ثنية الوداع نتلقى رسول الله صلى الله عليه وسلم‏.‏ وقال سفيان مرة مع الصبيان‏.‏",
      "text_en": " Narrated As-Sa'ib bin Yazid:                     I remember that I went out with the boys to (the place called) Thaniyat-ul-Wada` to receive Allah's Apostle .",
      "chain": [
        "30026",
        "20005",
        "11013",
        "3048"
      ]
    },
    {
      "hadith_no": "5732",
      "source": " Sahih Bukhari ",
      "chapter": "Patients - كتاب المرضى",
      "chapter_no": "75",
      "text_ar": "حدثنا إبراهيم بن حمزة، حدثنا حاتم  هو ابن إسماعيل  عن الجعيد، قال سمعت السائب، يقول ذهبت بي خالتي إلى رسول الله صلى الله عليه وسلم فقالت يا رسول الله إن ابن أختي وجع فمسح رأسي ودعا لي بالبركة، ثم توضأ فشربت من وضوئه وقمت خلف ظهره فنظرت إلى خاتم النبوة بين كتفيه مثل زر الحجلة‏.‏",
      "text_en": " Narrated As-Sa'ib:                     My aunt took me to Allah's Apostle and said, \"O Allah's Apostle! My nephew is- ill.\" The Prophet touched my head with his hand and invoked Allah to bless me. He then performed ablution and I drank of the remaining water of his ablution and then stood behind his back and saw \"Khatam An- Nubuwwa\" (The Seal of Prophethood) between his shoulders like a button of a tent.",
      "chain": [
        "30101",
        "20159",
        "11679",
        "3048"
      ]
    },
    {
      "hadith_no": "6426",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا حاتم، عن الجعد بن عبد الرحمن، قال سمعت السائب بن يزيد، يقول ذهبت بي خالتي إلى رسول الله صلى الله عليه وسلم فقالت يا رسول الله إن ابن أختي وجع‏.‏ فمسح رأسي، ودعا لي بالبركة، ثم توضأ فشربت من وضوئه، ثم قمت خلف ظهره، فنظرت إلى خاتمه بين كتفيه مثل زر الحجلة‏.‏",
      "text_en": " Narrated As-Sa'ib bin Yazid:                     My aunt took me to Allah's Apostle and said, \"O Allah's Apostle! My sister's son is sick.\" So he passed his hand over my head and invoked for Allah's blessing upon me and then performed the ablution. I drank from the water of his ablution and I stood behind him and looked at his Khatam (the seal of Prophethood) between his shoulders (and its size was) like the button of a tent.",
      "chain": [
        "30367",
        "20159",
        "11679",
        "3048"
      ]
    },
    {
      "hadith_no": "6797",
      "source": " Sahih Bukhari ",
      "chapter": "Expiation for Unfulfilled Oaths - كتاب كفارات الأيمان",
      "chapter_no": "84",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا القاسم بن مالك المزني، حدثنا الجعيد بن عبد الرحمن، عن السائب بن يزيد، قال كان الصاع على عهد النبي صلى الله عليه وسلم مدا وثلثا بمدكم اليوم فزيد فيه في زمن عمر بن عبد العزيز‏.‏",
      "text_en": " Narrated Al-Ju'aid bin `Abdur-Rahman:                     As-Sa'ib bin Yazid said, \"The Sa' at the time of the Prophet was equal to one Mudd plus one-third of a Mudd of your time, and then it was increased in the time of Caliph `Umar bin `Abdul `Aziz.\"",
      "chain": [
        "30203",
        "20350",
        "11679",
        "3048"
      ]
    },
    {
      "hadith_no": "6866",
      "source": " Sahih Bukhari ",
      "chapter": "Limits and Punishments set by Allah (Hudood) - كتاب الحدود",
      "chapter_no": "86",
      "text_ar": "حدثنا مكي بن إبراهيم، عن الجعيد، عن يزيد بن خصيفة، عن السائب بن يزيد، قال كنا نؤتى بالشارب على عهد رسول الله صلى الله عليه وسلم وإمرة أبي بكر وصدرا من خلافة عمر، فنقوم إليه بأيدينا ونعالنا وأرديتنا، حتى كان آخر إمرة عمر، فجلد أربعين، حتى إذا عتوا وفسقوا جلد ثمانين‏.‏",
      "text_en": " Narrated As-Sa'ib bin Yazid:                     We used to strike the drunks with our hands, shoes, clothes (by twisting it into the shape of lashes) during the lifetime of the Prophet, Abu Bakr and the early part of `Umar's caliphate. But during the last period of `Umar's caliphate, he used to give the drunk forty lashes; and when drunks became mischievous and disobedient, he used to scourge them eighty lashes.",
      "chain": [
        "20202",
        "11679",
        "11235",
        "3048"
      ]
    },
    {
      "hadith_no": "7251",
      "source": " Sahih Bukhari ",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، أخبرني السائب بن يزيد ابن أخت، نمر أن حويطب بن عبد العزى، أخبره أن عبد الله بن السعدي أخبره أنه، قدم على عمر في خلافته فقال له عمر ألم أحدث أنك تلي من أعمال الناس أعمالا، فإذا أعطيت العمالة كرهتها‏.‏ فقلت بلى‏.‏ فقال عمر ما تريد إلى ذلك قلت إن لي أفراسا وأعبدا، وأنا بخير، وأريد أن تكون عمالتي صدقة على المسلمين‏.‏ قال عمر لا تفعل فإني كنت أردت الذي أردت فكان رسول الله صلى الله عليه وسلم يعطيني العطاء فأقول أعطه أفقر إليه مني‏.‏ حتى أعطاني مرة مالا فقلت أعطه أفقر إليه مني‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ خذه فتموله وتصدق به، فما جاءك من هذا المال وأنت غير مشرف ولا سائل فخذه، وإلا فلا تتبعه نفسك ‏\"‏",
      "text_en": "      Narrated 'Abdullah bin As-Sa'di:                          That when he went to 'Umar during his Caliphate. 'Umar said to him,      \"Haven't I been told that you do certain jobs for the people but when      you are given payment you refuse to take it?\" 'Abdullah added: I said,     \"Yes.\" 'Umar said, \"Why do you do so?\" I said, \"I have horses and      slaves and I am living in prosperity and I wish that my payment should     be kept as a charitable gift for the Muslims.\" 'Umar said, \"Do not do      so, for I intended to do the same as you do. Allah's Apostles used to      give me gifts and I used to say to him, 'Give it to a more needy one      than me.' Once he gave me some money and I said, 'Give it to a more      needy person than me,' whereupon the Prophet said, 'Take it and keep      it in your possession and then give it in charity. Take what ever      comes to you of this money if you are not keen to have it and not      asking for it; otherwise (i.e., if it does not come to you) do not      seek to have it yourself.' \"",
      "chain": [
        "30330",
        "20428",
        "11013",
        "3048",
        "2600",
        "2605"
      ]
    },
    {
      "hadith_no": "7416",
      "source": " Sahih Bukhari ",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا عمرو بن زرارة، حدثنا القاسم بن مالك، عن الجعيد، سمعت السائب بن يزيد، يقول كان الصاع على عهد النبي صلى الله عليه وسلم مدا وثلثا بمدكم اليوم، وقد زيد فيه‏.‏",
      "text_en": " Narrated As-Sa'ib bin Yazid:                     The Sa' (a kind of measure) during the lifetime of the Prophet used to be equal to the one Mudd (another kind of measure) and one third of a Mudd which we use today, but the Sa' of today has become large.",
      "chain": [
        "30365",
        "20350",
        "11679",
        "3048"
      ]
    },
    {
      "hadith_no": "7424",
      "source": " Sahih Bukhari ",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، أخبرني السائب بن يزيد، سمع عثمان بن عفان، خطبنا على منبر النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated As-Sa'ib bin Yazid:                     That he heard `Uthman bin `Affan delivering a sermon on the pulpit of the Prophet",
      "chain": [
        "30330",
        "20428",
        "11013",
        "3048"
      ]
    },
    {
      "hadith_no": "1746",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن ابن شهاب، عن السائب بن يزيد، عن المطلب بن أبي وداعة السهمي، عن حفصة، أنها قالت ما رأيت رسول الله صلى الله عليه وسلم صلى في سبحته قاعدا حتى كان قبل وفاته بعام فكان يصلي في سبحته قاعدا وكان يقرأ بالسورة فيرتلها حتى تكون أطول من أطول منها ‏.‏",
      "text_en": " Zuhri reported this hadith with the same chain of transmitters, except this that he made a mention of one year or two years.",
      "chain": [
        "30399",
        "11013",
        "3048",
        "5295",
        "54"
      ]
    },
    {
      "hadith_no": "1779",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا هارون بن معروف، حدثنا عبد الله بن وهب، ح وحدثني أبو الطاهر، وحرملة، قالا أخبرنا ابن وهب، عن يونس بن يزيد، عن ابن شهاب، عن السائب بن يزيد، وعبيد الله بن عبد الله، أخبراه عن عبد الرحمن بن عبد القاري، قال سمعت عمر بن الخطاب، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ من نام عن حزبه أو عن شىء منه فقرأه فيما بين صلاة الفجر وصلاة الظهر كتب له كأنما قرأه من الليل ‏\"‏ ‏.‏",
      "text_en": " Zaid b. Arqam, on seeing some people praying in the forenoon, said:                      They well know that prayer at another time than this is more excellent, for Allah's Messenger (may peace be upon him) said: The prayer of those who are penitent is observed when your weaned camels feel the heat of the sun.",
      "chain": [
        "30280",
        "20029",
        "30487",
        "20029",
        "20475",
        "11013",
        "3048",
        "3195",
        "3"
      ]
    },
    {
      "hadith_no": "2454",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثني أبو الطاهر، أخبرنا ابن وهب، قال عمرو وحدثني ابن شهاب، بمثل ذلك عن السائب بن يزيد، عن عبد الله بن السعدي، عن عمر بن الخطاب، - رضى الله عنه - عن رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " This hadith has been narrated by Abdullah b. al-Sa'di from 'Umar b. al-Khattab who heard it from the Messenger of Allah (may peace be upon him).",
      "chain": [
        "20029",
        "20377",
        "3048",
        "2605",
        "3"
      ]
    },
    {
      "hadith_no": "3366",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا إسحاق بن إبراهيم، أخبرنا عبد الرزاق، أخبرنا ابن جريج، وأملاه، علينا إملاء أخبرني إسماعيل بن محمد بن سعد، أن حميد بن عبد الرحمن بن عوف، أخبره أن السائب بن يزيد أخبره أن العلاء بن الحضرمي أخبره عن رسول الله صلى الله عليه وسلم قال ‏\"‏ مكث المهاجر بمكة بعد قضاء نسكه ثلاث ‏\"‏ ‏.‏",
      "text_en": " Al-\" Ala' b. al-Hadrami reported Allah's Messenger (may peace be upon him) as saying:                      The stay at Mecca after the completion of his rituals (of Hajj) is only for three days.",
      "chain": [
        "30123",
        "20121",
        "11070",
        "11500",
        "10561",
        "3048",
        "586"
      ]
    },
    {
      "hadith_no": "4094",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "وحدثني محمد بن حاتم، حدثنا يحيى بن سعيد القطان، عن محمد بن يوسف، قال سمعت السائب بن يزيد، يحدث عن رافع بن خديج، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ شر الكسب مهر البغي وثمن الكلب وكسب الحجام ‏\"‏ ‏.‏",
      "text_en": " Rafi b. Khadij (Allah be pleased with him) reported:                      I heard Allah's Apostle (may peace be upon him) as saying: The worst earning is the earning of a prostitute, the price of a dog and the earning of a cupper.",
      "chain": [
        "38487",
        "20031",
        "30388",
        "3048",
        "1986"
      ]
    },
    {
      "hadith_no": "4095",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا إسحاق بن إبراهيم، أخبرنا الوليد بن مسلم، عن الأوزاعي، عن يحيى، بن أبي كثير حدثني إبراهيم بن قارظ، عن السائب بن يزيد، حدثني رافع بن خديج، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ ثمن الكلب خبيث ومهر البغي خبيث وكسب الحجام خبيث ‏\"‏ ‏.‏",
      "text_en": " Rafi b. Khadij reported Allah'& Messenger (may peace be upon him) as saying:                      The price of a dog is evil, the earning of a prostitute is evil and the earning of a cupper is evil.",
      "chain": [
        "30123",
        "20733",
        "20024",
        "11449",
        "3048",
        "1986"
      ]
    },
    {
      "hadith_no": "4097",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "وحدثنا إسحاق بن إبراهيم، أخبرنا النضر بن شميل، حدثنا هشام، عن يحيى، بن أبي كثير حدثني إبراهيم بن عبد الله، عن السائب بن يزيد، حدثنا رافع بن خديج، عن  رسول الله صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " A hadith like this has been narrated on the authority of Rifi' b. Khadlj through another chain of transmitters.",
      "chain": [
        "30123",
        "20291",
        "11065",
        "11449",
        "3048",
        "1986"
      ]
    },
    {
      "hadith_no": "4119",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن يزيد بن خصيفة، أن السائب، بن يزيد أخبره أنه، سمع سفيان بن أبي زهير، - وهو رجل من شنوءة من أصحاب رسول الله صلى الله عليه وسلم - قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من اقتنى كلبا لا يغني عنه زرعا ولا ضرعا نقص من عمله كل يوم قيراط ‏\"‏ ‏.‏ قال آنت سمعت هذا من رسول الله صلى الله عليه وسلم قال إي ورب هذا المسجد ‏.‏",
      "text_en": " Sufyan b. Abu Zuhair (he was a person belonging to the tribe of Shanu'a and was amongst the Conpanions of Allah's Messenger [may peace be upon him ) said:                      I heard Messenger of Allah (may peace be upon him) as saying: He who kept a dog (other than that) which is indispensable for watching the field or the animals would lose one qirat out of his deeds every day. As-Sa'ib b Yazid (one of the narrators) said: Did you hear it from Allah's Messenger (may peace be upon him)? He said: Yes. by the Lord of this mosque.",
      "chain": [
        "30399",
        "11235",
        "3048"
      ]
    },
    {
      "hadith_no": "4120",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا يحيى بن أيوب، وقتيبة، وابن، حجر قالوا حدثنا إسماعيل، عن يزيد بن، خصيفة أخبرني السائب بن يزيد، أنه وفد عليهم سفيان بن أبي زهير الشنئي فقال قال رسول الله صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Sufyan b. Abu Zuhair al-Shana'i.",
      "chain": [
        "20379",
        "30367",
        "20208",
        "11235",
        "3048"
      ]
    },
    {
      "hadith_no": "6233",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثنا قتيبة بن سعيد، ومحمد بن عباد، قالا حدثنا حاتم، - وهو ابن إسماعيل - عن الجعد بن عبد الرحمن، قال سمعت السائب بن يزيد، يقول ذهبت بي خالتي إلى رسول الله صلى الله عليه وسلم فقالت يا رسول الله إن ابن أختي وجع ‏.‏ فمسح رأسي ودعا لي بالبركة ثم توضأ فشربت من وضوئه ثم قمت خلف ظهره فنظرت إلى خاتمه بين كتفيه مثل زر الحجلة ‏.‏",
      "text_en": " As-Sa'ib b. Yazid reported:                      My mother's sister took me to Allah's Messenger (may peace be upon him) and said: Allah's Messenger, here is the son of my sister and he is ailing. He touched my head and invoked blessings upon me. He then performed ablution and I drank the water left from his ablution; then I stood behind him and I saw the seal between his shoulders.",
      "chain": [
        "30367",
        "30377",
        "20159",
        "11679",
        "3048"
      ]
    },
    {
      "hadith_no": "1087",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن سلمة المرادي، حدثنا ابن وهب، عن يونس، عن ابن شهاب، أخبرني السائب بن يزيد، أن الأذان، كان أوله حين يجلس الإمام على المنبر يوم الجمعة في عهد النبي صلى الله عليه وسلم وأبي بكر وعمر - رضى الله عنهما - فلما كان خلافة عثمان وكثر الناس أمر عثمان يوم الجمعة بالأذان الثالث فأذن به على الزوراء فثبت الأمر على ذلك ‏.‏",
      "text_en": " Al-Sa'ib b. Yazid said:                      During the time of the Prophet (ﷺ) and Abu Bakr and 'Umar the call to the Friday prayer was first made at the time when the imam was seated on the pulpit (for giving the sermon). When the time of 'Uthman came, and the people became abundant, 'Uthman ordered to make a third call to the Friday prayer. It was made on al-Zaura' (a house in Medina). The rule of action continued to the same effect.",
      "chain": [
        "30491",
        "20029",
        "20475",
        "11013",
        "3048"
      ]
    },
    {
      "hadith_no": "1088",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا النفيلي، حدثنا محمد بن سلمة، عن محمد بن إسحاق، عن الزهري، عن السائب بن يزيد، قال كان يؤذن بين يدى رسول الله صلى الله عليه وسلم إذا جلس على المنبر يوم الجمعة على باب المسجد وأبي بكر وعمر ‏.‏ ثم ساق نحو حديث يونس ‏.‏",
      "text_en": " Sa'id b. Yazid said:                      The call to the (Friday) prayer was made at the gate of the mosque in front of the Messenger of Allah (ﷺ) when he sat on the pulpit, and of Abu Bakr and 'Umar. The narrator then repeated the same tradition as reported by Yunus.",
      "chain": [
        "30352",
        "20672",
        "11107",
        "11013",
        "3048"
      ]
    },
    {
      "hadith_no": "1089",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا هناد بن السري، حدثنا عبدة، عن محمد، - يعني ابن إسحاق - عن الزهري، عن السائب، قال لم يكن لرسول الله صلى الله عليه وسلم إلا مؤذن واحد بلال ثم ذكر معناه ‏.‏",
      "text_en": " Sa'ib said:                      There was no other mu'adhdhin (pronouncer) of the Messenger of Allah (ﷺ) except Bilal.The narrator then reported the tradition to the same effect.",
      "chain": [
        "30480",
        "20337",
        "11107",
        "11013",
        "3048"
      ]
    },
    {
      "hadith_no": "1090",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن يحيى بن فارس، حدثنا يعقوب بن إبراهيم بن سعد، حدثنا أبي، عن صالح، عن ابن شهاب، أن السائب بن يزيد ابن أخت، نمر أخبره قال ولم يكن لرسول الله صلى الله عليه وسلم غير مؤذن واحد ‏.‏ وساق هذا الحديث وليس بتمامه ‏.‏",
      "text_en": " Sa'ib said:                      There was no other mu'adhdhin of the Messenger of Allah (ﷺ). He then narrated the tradition which is incomplete.",
      "chain": [
        "11222",
        "20184",
        "20150",
        "11176",
        "11013",
        "3048"
      ]
    },
    {
      "hadith_no": "1313",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا أبو صفوان عبد الله بن سعيد بن عبد الملك بن مروان، ح وحدثنا سليمان بن داود، ومحمد بن سلمة المرادي، قالا حدثنا ابن وهب، - المعنى - عن يونس، عن ابن شهاب، أن السائب بن يزيد، وعبيد الله، أخبراه أن عبد الرحمن بن عبد قالا عن ابن وهب بن عبد القاري، قال سمعت عمر بن الخطاب، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ من نام عن حزبه أو عن شىء منه فقرأه ما بين صلاة الفجر وصلاة الظهر كتب له كأنما قرأه من الليل ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Umar bin Al-Khattab:                     The Messenger of Allah (ﷺ) as saying: He who misses him daily round of recital or part of it due to sleep and he recites it between the dawn and the noon prayers, will be reckoned as if he recited it at night.",
      "chain": [
        "30367",
        "30584",
        "30491",
        "20475",
        "11013",
        "3048"
      ]
    },
    {
      "hadith_no": "1492",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا ابن لهيعة، عن حفص بن هاشم بن عتبة بن أبي وقاص، عن السائب بن يزيد، عن أبيه، أن النبي صلى الله عليه وسلم كان إذا دعا فرفع يديه مسح وجهه بيديه ‏.‏",
      "text_en": " Narrated Yazid ibn Sa'id al-Kindi:                     When the Prophet (ﷺ) made supplication (to Allah) he would raise his hands and wipe his face with his hands.",
      "chain": [
        "30367",
        "20624",
        "18203",
        "3048",
        "3047"
      ]
    },
    {
      "hadith_no": "2590",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا مسدد، حدثنا سفيان، قال حسبت أني سمعت يزيد بن خصيفة، يذكر عن السائب بن يزيد، عن رجل، قد سماه أن رسول الله صلى الله عليه وسلم ظاهر يوم أحد بين درعين أو لبس درعين ‏.‏",
      "text_en": " Narrated As-Sa'ib ibn Yazid:                     As-Sa'ib reported on the authority of a man whom he named: The Messenger of Allah (ﷺ) put on two coats of mail during the battle of Uhud as a double protection. (The narrator is doubtful about the word zahara or labisa.)",
      "chain": [
        "30175",
        "20012",
        "11235",
        "3048"
      ]
    },
    {
      "hadith_no": "2779",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا ابن السرح، حدثنا سفيان، عن الزهري، عن السائب بن يزيد، قال لما قدم النبي صلى الله عليه وسلم المدينة من غزوة تبوك تلقاه الناس فلقيته مع الصبيان على ثنية الوداع ‏.‏",
      "text_en": " Al Sai’ib bin Yazid said “When the Prophet(ﷺ) turned from the battle of Tabuk to Madeenah, the people received him, I met him along with the children at Thaniyyat Al Wada’.",
      "chain": [
        "30485",
        "20005",
        "11013",
        "3048"
      ]
    },
    {
      "hadith_no": "3421",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا موسى بن إسماعيل، أخبرنا أبان، عن يحيى، عن إبراهيم بن عبد الله، - يعني ابن قارظ - عن السائب بن يزيد، عن رافع بن خديج، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ كسب الحجام خبيث وثمن الكلب خبيث ومهر البغي خبيث ‏\"‏ ‏.‏",
      "text_en": " Narrated Rafi' ibn Khadij:                     The Prophet (ﷺ) said: The earnings of a cupper are impure, the price paid for a dog is impure, and the hire paid to a prostitute is impure.",
      "chain": [
        "20040",
        "20577",
        "20031",
        "10888",
        "3048",
        "1986"
      ]
    },
    {
      "hadith_no": "4836",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن سفيان، قال حدثني إبراهيم بن المهاجر، عن مجاهد، عن قائد السائب، عن السائب، قال أتيت النبي صلى الله عليه وسلم فجعلوا يثنون على ويذكروني فقال رسول الله صلى الله عليه وسلم ‏\"‏ أنا أعلمكم ‏\"‏ ‏.‏ يعني به ‏.‏ قلت صدقت بأبي أنت وأمي كنت شريكي فنعم الشريك كنت لا تداري ولا تماري ‏.‏",
      "text_en": " Narrated As-Sa'ib:                     I came to the Prophet (ﷺ). The people began to praise me and make a mention of me. The Messenger of Allah (ﷺ) said: I know you, that is, he knew him. I said: My father and mother be sacrificed for you! you were my partner and how good a partner ; you neither disputed nor quarrelled.",
      "chain": [
        "30175",
        "20031",
        "20012",
        "11028",
        "3048"
      ]
    },
    {
      "hadith_no": "373",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا الأنصاري، حدثنا معن، حدثنا مالك بن أنس، عن ابن شهاب، عن السائب بن يزيد، عن المطلب بن أبي وداعة السهمي، عن حفصة، زوج النبي صلى الله عليه وسلم أنها قالت ما رأيت رسول الله صلى الله عليه وسلم صلى في سبحته قاعدا حتى كان قبل وفاته صلى الله عليه وسلم بعام فإنه كان يصلي في سبحته قاعدا ويقرأ بالسورة ويرتلها حتى تكون أطول من أطول منها ‏.‏ وفي الباب عن أم سلمة وأنس بن مالك ‏.‏ قال أبو عيسى حديث حفصة حديث حسن صحيح ‏.‏ وقد روي عن النبي صلى الله عليه وسلم أنه كان يصلي من الليل جالسا فإذا بقي من قراءته قدر ثلاثين أو أربعين آية قام فقرأ ثم ركع ثم صنع في الركعة الثانية مثل ذلك ‏.‏ وروي عنه أنه كان يصلي قاعدا فإذا قرأ وهو قائم ركع وسجد وهو قائم وإذا قرأ وهو قاعد ركع وسجد وهو قاعد ‏.‏ قال أحمد وإسحاق والعمل على كلا الحديثين ‏.‏ كأنهما رأيا كلا الحديثين صحيحا معمولا بهما ‏.‏",
      "text_en": " Hafsah, the wife of the Prophet (S), narrated:                     \"I did not see Allah's Messenger (S) praying voluntary prayers sitting until the year before he died. Then he would perform Salat for the voluntary prayers sitting, and he would recite a Surah and prolong it such that it would be longer than the longest of them.\"",
      "chain": [
        "20280",
        "30112",
        "20001",
        "11013",
        "3048",
        "5295"
      ]
    },
    {
      "hadith_no": "516",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on the Day of Friday - كِتَاب الْجُمُعَةِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
      "chapter_no": "4",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا حماد بن خالد الخياط، عن ابن أبي ذئب، عن الزهري، عن السائب بن يزيد، قال كان الأذان على عهد رسول الله صلى الله عليه وسلم وأبي بكر وعمر إذا خرج الإمام وإذا أقيمت الصلاة فلما كان عثمان رضى الله عنه زاد النداء الثالث على الزوراء ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " As-Sa'ib bin Yazid narrated:                     \"The Adhan during the time of Allah's Messenger, Abu Bakr, and Umar was when the Imam came out, [and when] the Iqamah was called for the Salat. Then Uthman [may Allah be pleased with him] added a third call at Az-Zawra.\"",
      "chain": [
        "30242",
        "20537",
        "20177",
        "11013",
        "3048"
      ]
    },
    {
      "hadith_no": "581",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Traveling - أَبْوَابُ السَّفَرِ",
      "chapter_no": "6",
      "text_ar": "حدثنا قتيبة، حدثنا أبو صفوان، عن يونس بن يزيد، عن ابن شهاب الزهري، أن السائب بن يزيد، وعبيد الله بن عبد الله بن عتبة بن مسعود، أخبراه عن عبد الرحمن بن عبد القاري، قال سمعت عمر بن الخطاب، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ من نام عن حزبه أو عن شيء منه فقرأه ما بين صلاة الفجر وصلاة الظهر كتب له كأنما قرأه من الليل ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ قال وأبو صفوان اسمه عبد الله بن سعيد المكي وروى عنه الحميدي وكبار الناس ‏.‏",
      "text_en": " Umar bin Al-Khattab narrated that :                     the Messenger of Allah said: \"Whoever slept, (missing) his section or some of it, then he recited it between the Fajr prayer and the Zuhr prayer, it is written for him as if he had recited it in the night.\"",
      "chain": [
        "30367",
        "20525",
        "20475",
        "3048",
        "3195",
        "3"
      ]
    },
    {
      "hadith_no": "774",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا محمد بن يحيى، ومحمد بن رافع النيسابوري، ومحمود بن غيلان، ويحيى بن موسى، قالوا حدثنا عبد الرزاق، عن معمر، عن يحيى بن أبي كثير، عن إبراهيم بن عبد الله بن قارظ، عن السائب بن يزيد، عن رافع بن خديج، عن النبي صلى الله عليه وسلم قال ‏\"‏ أفطر الحاجم والمحجوم ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن علي وسعد وشداد بن أوس وثوبان وأسامة بن زيد وعائشة ومعقل بن سنان ويقال ابن يسار وأبي هريرة وابن عباس وأبي موسى وبلال ‏.‏ قال أبو عيسى وحديث رافع بن خديج حديث حسن ‏.‏ وذكر عن أحمد بن حنبل أنه قال أصح شيء في هذا الباب حديث رافع بن خديج ‏.‏ وذكر عن علي بن عبد الله أنه قال أصح شيء في هذا الباب حديث ثوبان وشداد بن أوس لأن يحيى بن أبي كثير روى عن أبي قلابة الحديثين جميعا حديث ثوبان وحديث شداد بن أوس ‏.‏ وقد كره قوم من أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم الحجامة للصائم حتى أن بعض أصحاب النبي صلى الله عليه وسلم احتجم بالليل منهم أبو موسى الأشعري وابن عمر وبهذا يقول ابن المبارك ‏.‏ قال أبو عيسى سمعت إسحاق بن منصور يقول قال عبد الرحمن بن مهدي من احتجم وهو صائم فعليه القضاء ‏.‏ قال إسحاق بن منصور وهكذا قال أحمد بن حنبل وإسحاق بن إبراهيم ‏.‏ وقال أبو عيسى وأخبرني الحسن بن محمد الزعفراني قال قال الشافعي قد روي عن النبي صلى الله عليه وسلم أنه احتجم وهو صائم وروي عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ أفطر الحاجم والمحجوم ‏\"‏ ‏.‏ ولا أعلم واحدا من هذين الحديثين ثابتا ولو توقى رجل الحجامة وهو صائم كان أحب إلى ولو احتجم صائم لم أر ذلك أن يفطره ‏.‏ قال أبو عيسى هكذا كان قول الشافعي ببغداد وأما بمصر فمال إلى الرخصة ولم ير بالحجامة للصائم بأسا واحتج بأن النبي صلى الله عليه وسلم احتجم في حجة الوداع وهو محرم صائم ‏.‏",
      "text_en": " Rafi bin Khadi narrated that:                     The Prophet said: \"The cupper and the one cupped have broke the fast.\"",
      "chain": [
        "11222",
        "30375",
        "30277",
        "30221",
        "20121",
        "20115",
        "11449",
        "10888",
        "3048",
        "1986"
      ]
    },
    {
      "hadith_no": "925",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا حاتم بن إسماعيل، عن محمد بن يوسف، عن السائب بن يزيد، قال حج بي أبي مع رسول الله صلى الله عليه وسلم في حجة الوداع وأنا ابن سبع سنين ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " As-Sa'ib bin Yazid narrated:                     \"My father took me for Hajj with the Messenger of Allah during the Farewell Hajj, and I was seven years old.\"",
      "chain": [
        "30367",
        "20159",
        "30388",
        "3048"
      ]
    },
    {
      "hadith_no": "949",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا سفيان بن عيينة، عن عبد الرحمن بن حميد، سمع السائب بن يزيد، عن العلاء بن الحضرمي يعني مرفوعا، قال ‏\"‏ يمكث المهاجر بعد قضاء نسكه بمكة ثلاثا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح وقد روي من غير هذا الوجه بهذا الإسناد مرفوعا ‏.‏",
      "text_en": " Al-Ala bin Al-Hadrami narrated :                     (that the Prophet said): \"The Muhajir may stay for three (days) in Makkah after carrying out his rites.\"",
      "chain": [
        "30242",
        "20005",
        "11193",
        "3048",
        "586"
      ]
    },
    {
      "hadith_no": "1275",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا محمد بن رافع، حدثنا عبد الرزاق، أخبرنا معمر، عن يحيى بن أبي كثير، عن إبراهيم بن عبد الله بن قارظ، عن السائب بن يزيد، عن رافع بن خديج، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ كسب الحجام خبيث ومهر البغي خبيث وثمن الكلب خبيث ‏\"‏ ‏.‏ قال وفي الباب عن عمر وعلي وابن مسعود وأبي مسعود وجابر وأبي هريرة وابن عباس وابن عمر وعبد الله بن جعفر ‏.‏ قال أبو عيسى حديث رافع حديث حسن صحيح ‏.‏ والعمل على هذا عند أكثر أهل العلم كرهوا ثمن الكلب ‏.‏ وهو قول الشافعي وأحمد وإسحاق ‏.‏ وقد رخص بعض أهل العلم في ثمن كلب الصيد ‏.‏",
      "text_en": " Narrated Rafi' b. Khadij:                     That the Messenger of Allah (ﷺ) said: \"The earnings of the cupper is filth, the earnings of the fornicator (from harlotry) is filth, and the price of a dog is filth.\"[He said:] There are narrations on this topic from 'Umar, 'Ali, Ibn Mas'ud, Abu Masu'd, Jabir, Abu Hurairah, Ibn 'Abbas, Ibn 'Umar, and 'Abdullah bin Ja'far.[Abu 'Eisa said:] The Hadith is Rafi' is a Hasan Sahih Hadith. This is acted upon according to most of the people of knowledge, they disliked the price of a dog. This the view of Ash-Shafi'i, Ahmad, and Ishaq. Some of the people of knowledge permitted the price of the hunting dog.",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11449",
        "10888",
        "3048",
        "1986"
      ]
    },
    {
      "hadith_no": "1718",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jihad - كتاب الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "23",
      "text_ar": "حدثنا ابن أبي عمر، وسعيد بن عبد الرحمن المخزومي، قالا حدثنا سفيان بن عيينة، عن الزهري، عن السائب بن يزيد، قال لما قدم رسول الله صلى الله عليه وسلم من تبوك خرج الناس يتلقونه إلى ثنية الوداع ‏.‏ قال السائب فخرجت مع الناس وأنا غلام ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated As-Sa'ib bin Yazid:                     \"When the Messenger of Allah (ﷺ) arrived from Tabuk, the people went out to Thaniyyah Al-Wada' to meet him.\" As-Sa'ib said: \"I went out with the people, and I was a boy.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.",
      "chain": [
        "30421",
        "38231",
        "20005",
        "11013",
        "3048"
      ]
    },
    {
      "hadith_no": "2161",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": ".‏ حدثنا قتيبة حدثنا حاتم بن إسماعيل عن محمد بن يوسف عن السائب بن يزيد قال حج يزيد مع النبي صلى الله عليه وسلم حجة الوداع وأنا ابن سبع سنين ‏.‏ فقال علي بن المديني عن يحيى بن سعيد القطان كان محمد بن يوسف ثبتا صاحب حديث وكان السائب بن يزيد جده وكان محمد بن يوسف يقول حدثني السائب بن يزيد وهو جدي من قبل أمي ‏.‏",
      "text_en": " Muhammad bin Yusuf narrated that As-Sa'ib bin Yazid said:                     \"Yazid performed Hajj in the Farewell Pilgrimage with the Prophet (s.a.w) when I was seven years old.\" So 'Ali bin Al-Madini narrated from Yahya bin Sa'eed Al-Qattan: \"Muhammad bin Yusuf was a very reliable narrator of Hadith, and As-Sa'ib bin Yazid was his grandfather, and Muhammad bin Yusuf would say: 'As-Sa'ib bin Yazid narrated to me- and he is my grandfather from my mother's side.\"'",
      "chain": [
        "20159",
        "30388",
        "3048"
      ]
    }
  ],
  "total_hadiths": 73
}