{
  "id": "30480",
  "name": "Hanad bin al-Sari bin Mus'ab هناد بن السري بن مصعب",
  "full_name": "Hanad bin al-Sari bin Mus'ab هناد بن السري بن مصعب",
  "grade": "3rd Century AH [10th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "243",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ عخ  م  4  -  ثقة ]"
    ],
    "tags": [
      "al-Tamimi",
      "al-Darmi",
      "al-Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20509",
      "name": "'Abdur Rahman bin Abi al-Zanad عبد الرحمن بن أبي الزناد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20468",
      "name": "Hashaym bin Bashayr bin al-Qasim هشيم بن بشير بن القاسم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20373",
      "name": "Abu Bakr bin 'Ayyash al-Asadi أبو بكر بن عياش بن سالم الأسدي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20102",
      "name": "'Abdullah bin Idris bin Yazid al-Audi عبد الله بن إدريس بن يزيد الأودي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20327",
      "name": "Abu al-Ahwus, Salam bin Sulaym al-Hanafi أبو الأحوص سلام بن سليم الحنفي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20317",
      "name": "Hafs bin Ghyath حفص بن غياث",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20366",
      "name": "Yahya bin Zakaria bin Abi Zaida يحيى بن زكريا بن أبي زائدة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20354",
      "name": "Muhammad bin Khazim al-Darir محمد بن خازم أبو معاوية الضرير",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20736",
      "name": "Isma'il bin Ayyash bin Saleem إسماعيل بن عياش بن سليم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20587",
      "name": "Sharayk bin 'Abdullah شريك بن عبد الله النخعي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20329",
      "name": "Abthr bin al-Qasim al-Zbydy Abu عبثر بن القاسم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20248",
      "name": "'Abdul Salam bin Harb bin Salm al-Mala'i عبد السلام بن حرب بن سلم النهدي الملائي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20345",
      "name": "'Ali bin Ms'hr علي بن مسهر",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20337",
      "name": "'Abdah bin Sulaiman al-Klabi عبدة بن سليمان الكلابي أبو محمد الكوفي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20200",
      "name": "Fadayl bin 'Iyyad bin Mas'ud فضيل بن عياض بن مسعود",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20032",
      "name": "Waki' bin al-Jarrah وكيع بن الجراح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30554",
      "name": "Abu Zara' al-Razi أبو زرعة الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "36514",
      "name": "Ahmed bin Mansur al-Ramadi أحمد بن منصور الرمادي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38544",
      "name": "Muhammad bin 'Abdul Malik bin Marwan محمد بن عبد الملك بن مروان الدقيقي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30013",
      "name": "Ibn Abi Dunya ابن أبي الدنيا",
      "grade": "3rd Century AH [12th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "551",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا هناد بن السري، حدثنا أبو الأحوص، عن أبي إسحاق، عن عمرو بن ميمون، عن عبد الله، قال قال لنا رسول الله صلى الله عليه وسلم ‏\"‏ أما ترضون أن تكونوا ربع أهل الجنة ‏\"‏ قال فكبرنا ‏.‏ ثم قال ‏\"‏ أما ترضون أن تكونوا ثلث أهل الجنة ‏\"‏ قال فكبرنا ‏.‏ ثم قال ‏\"‏ إني لأرجو أن تكونوا شطر أهل الجنة وسأخبركم عن ذلك ما المسلمون في الكفار إلا كشعرة بيضاء في ثور أسود أو كشعرة سوداء في ثور أبيض ‏\"‏ ‏.‏",
      "text_en": " Abdullah b. Mas'ud reported:                      The Messenger of Allah (may peace be upon him) addressing us said: Aren't you pleased that you should constitute one-fourth of the inhabitants of Paradise? He (the narrator) said: We glorified (our Lord, i. e. we called aloud Allah-o Akbar, Allah is the Greatest). He, then, again said: Aren't you pleased that you should constitute one-third of the inhabitants of Paradise? He (the narrator) said: We glorified (our Lord) and he (the Holy Prophet) then again said: I hope that you would constitute half of the inhabitants of Paradise and I shall explain to you its (reason). The believers among the unbelievers would not be more than a white hair on (the body of a) black ox or a black hair on (the body of a) white ox.",
      "chain": [
        "30480",
        "20327",
        "11049",
        "11382",
        "16"
      ]
    },
    {
      "hadith_no": "1350",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا هناد بن السري، حدثنا أبو الأحوص، عن أشعث، عن أبيه، عن مسروق، عن عائشة، بهذا الحديث وفيه قالت وما صلى صلاة بعد ذلك إلا سمعته يتعوذ من عذاب القبر ‏.‏",
      "text_en": " Masruq reported this hadith on the authority of 'A'isha who said:                      Never did he (the Holy Prophet) say prayer after this in which I did not hear him seeking refuge from the torment of the grave.",
      "chain": [
        "30480",
        "20327",
        "11324",
        "11351",
        "11018"
      ]
    },
    {
      "hadith_no": "1764",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثني هناد بن السري، حدثنا أبو الأحوص، عن أشعث، عن أبيه، عن مسروق، قال سألت عائشة عن عمل، رسول الله صلى الله عليه وسلم فقالت كان يحب الدائم ‏.‏ قال قلت أى حين كان يصلي فقالت كان إذا سمع الصارخ قام فصلى ‏.‏",
      "text_en": " 'A'isha reported:                      Never did the earlier part of the dawn find the Messenger of Allah (may peace be upon him) but sleeping in my house or near me.",
      "chain": [
        "30480",
        "20327",
        "11324",
        "11351",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "1832",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وهناد بن السري، قالا حدثنا أبو الأحوص، عن سعيد بن مسروق، عن سلمة بن كهيل، عن أبي رشدين، مولى ابن عباس عن ابن عباس، قال بت عند خالتي ميمونة ‏.‏ واقتص الحديث ولم يذكر غسل الوجه والكفين غير أنه قال ثم أتى القربة فحل شناقها فتوضأ وضوءا بين الوضوءين ثم أتى فراشه فنام ثم قام قومة أخرى فأتى القربة فحل شناقها ثم توضأ وضوءا هو الوضوء وقال ‏\"‏ أعظم لي نورا ‏\"‏ ‏.‏ ولم يذكر ‏\"‏ واجعلني نورا ‏\"‏ ‏.‏",
      "text_en": " Kuraib reported that Ibn 'Abbas spent a night in the house of the Messenger of Allah (may peace be upon him) and he said:                      The Messenger of Allah may peace be upon him) stood near the water-skin and poured water out of that and performed ablution in which he neither used excess of water nor too little of it, and the rest of the hadith is the same, and in this mention is also made (of the fact) that on that night the Messenger of Allah (may peace be upon him) made supplication before Allah in nineteen words. Kuraib reported: I remember twelve words out of these, bux have forgotten the rest. The Messenger of Allah said:\" Place light in my heart, light in my tongue, light in my hearing, light in my sight, light above me, light below me, light on my right, light on my left, light in front of me, light behind me, place light in my soul, and make light abundant for me.\"",
      "chain": [
        "30201",
        "30480",
        "20327",
        "20016",
        "11350",
        "17"
      ]
    },
    {
      "hadith_no": "1904",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا هناد بن السري، ومنجاب بن الحارث التميمي، جميعا عن علي بن مسهر، عن الأعمش، بهذا الإسناد ‏.‏ وزاد هناد في روايته قال لي رسول الله صلى الله عليه وسلم وهو على المنبر ‏\"‏ اقرأ على ‏\"‏ ‏.‏",
      "text_en": " Ibrahim reported that the Apostle of Allah (may peace be upon him) asked 'Abdullah b. Mas'ud to recite to him (the Qur'an). He said:                      Should I recite it to you while it has been sent down or revealed to you? He (the Holy Prophet) said: I love to hear it from someone else. So he ('Abdullah b. Mas'ud) recited to him (from the beginning of Surat al Nisa' up to the verse:\" How shall then it be when We bring from every people a witness and bring you as a witness against them?\" He (the Holy Prophet) wept (on listening to it). It is narrated on the authority of Ibn Mas'ud through another chain of transmitters that the Apostle of Allah (may peace be upon him) also said that he had been a witness to his people as long as (said he): I lived among them or I had been among them.",
      "chain": [
        "30480",
        "30479",
        "20345"
      ]
    },
    {
      "hadith_no": "2447",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثني هناد بن السري، حدثنا أبو الأحوص، عن بيان أبي بشر، عن قيس بن، أبي حازم عن أبي هريرة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لأن يغدو أحدكم فيحطب على ظهره فيتصدق به ويستغني به من الناس خير له من أن يسأل رجلا أعطاه أو منعه ذلك فإن اليد العليا أفضل من اليد السفلى وابدأ بمن تعول ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira is reported to have heard the Messenger of Allah (may peace be upon him) as saying:                      It is letter for one among you to bring a load of firewood on his back and give charity out of it (and satisfy his own need) and be independent of people, than that he should beg from people, whether they give him anything or refuse him. Verily the upper hand is better than the lower hand, and begin (charity) with your dependants.",
      "chain": [
        "30480",
        "20327",
        "11046",
        "13"
      ]
    },
    {
      "hadith_no": "2499",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا هناد بن السري، حدثنا أبو الأحوص، عن سعيد بن مسروق، عن عبد الرحمن، بن أبي نعم عن أبي سعيد الخدري، قال بعث علي - رضى الله عنه - وهو باليمن بذهبة في تربتها إلى رسول الله صلى الله عليه وسلم فقسمها رسول الله صلى الله عليه وسلم بين أربعة نفر الأقرع بن حابس الحنظلي وعيينة بن بدر الفزاري وعلقمة بن علاثة العامري ثم أحد بني كلاب وزيد الخير الطائي ثم أحد بني نبهان - قال - فغضبت قريش فقالوا أتعطي صناديد نجد وتدعنا فقال رسول الله صلى الله عليه وسلم ‏\"‏ إني إنما فعلت ذلك لأتألفهم ‏\"‏ فجاء رجل كث اللحية مشرف الوجنتين غائر العينين ناتئ الجبين محلوق الرأس فقال اتق الله يا محمد ‏.‏ - قال - فقال رسول الله صلى الله عليه وسلم ‏\"‏ فمن يطع الله إن عصيته أيأمنني على أهل الأرض ولا تأمنوني ‏\"‏ قال ثم أدبر الرجل فاستأذن رجل من القوم في قتله - يرون أنه خالد بن الوليد - فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن من ضئضئ هذا قوما يقرءون القرآن لا يجاوز حناجرهم يقتلون أهل الإسلام ويدعون أهل الأوثان يمرقون من الإسلام كما يمرق السهم من الرمية لئن أدركتهم لأقتلنهم قتل عاد ‏\"‏ ‏.‏",
      "text_en": " Abu Said Khudri reported that 'Ali (Allah be pleased with him) sent some gold alloyed with dust to the Messenger of Allah (may peace be upon him), and the Messenger of Allah (may peace be upon him) distributed that among four men, al-Aqra b. Habis Hanzali and Uyaina b. Badr al-Fazari and 'Alqama b. 'Ulatha al-'Amiri, then to one person of the tribe of Kilab and to Zaid al-Khair al-Ta'l, and then to one person of the tribe of Nabhan. Upon this the people of Quraish felt angry and said:                      He (the Holy Prophet) gave to the chiefs of Najd and ignored us. Upon this the Messenger of Allah (may peace be upon him) said: I have done it with a view to con- cillating them. Then there came a person with thick beard, prominent cheeks, deep sunken eyes and protruding forehead and shaven head. He said: Muhammad, fear Allah. Upon this the Messenger of Allah (may peace be upon him) said: If I disobey Allah, who would then obey Him? Have I not been (sent as the) most trustworthy among the people of the-world? -but you do not repose trust in me. That person then went back. A person among the people then sought permission (from the Holy Prophet) for his murder. According to some, it was Khalid b. Walid who sought the permission. Upon this the Messenger of Allah (may peace be upon him), said: From this very person's posterity there would arise people who would recite the Qur'an, but it would not go beyond their throat; they would kill the followers of Islam and would spare the idol-worshippers. They would glance through the teachings of Islam so hurriedly just as the arrow passes through the pray. If I were to ever find them I would kill them like 'Ad.",
      "chain": [
        "30480",
        "20327",
        "20016",
        "11366",
        "38"
      ]
    },
    {
      "hadith_no": "2966",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا هناد بن السري، وزهير بن حرب، وعثمان بن أبي شيبة، كلهم عن عبدة، - قال زهير حدثنا عبدة بن سليمان، - عن عبيد الله بن عمر، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، - رضى الله عنها - قالت نفست أسماء بنت عميس بمحمد بن أبي بكر بالشجرة فأمر رسول الله صلى الله عليه وسلم أبا بكر يأمرها أن تغتسل وتهل ‏.‏",
      "text_en": " A'isha (Allah be pleased with her) reported that Asma' hint 'Umais gave birth to Muhammad b Abu Bakr near Dhu'I-Hulaifa. The Messenger of Allah (may peace be upon him) commanded Abu Bakr to convey to her that she should take a bath and then enter into the state of Ihram.",
      "chain": [
        "30480",
        "30022",
        "20337",
        "20321",
        "20337",
        "11201",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "3309",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا هناد بن السري، حدثنا ابن أبي زائدة، أخبرني ابن أبي سليمان، عن عطاء، قال لما احترق البيت زمن يزيد بن معاوية حين غزاها أهل الشام فكان من أمره ما كان تركه ابن الزبير حتى قدم الناس الموسم يريد أن يجرئهم - أو يحربهم - على أهل الشام فلما صدر الناس قال يا أيها الناس أشيروا على في الكعبة أنقضها ثم أبني بناءها أو أصلح ما وهى منها قال ابن عباس فإني قد فرق لي رأى فيها أرى أن تصلح ما وهى منها وتدع بيتا أسلم الناس عليه وأحجارا أسلم الناس عليها وبعث عليها النبي صلى الله عليه وسلم ‏.‏ فقال ابن الزبير لو كان أحدكم احترق بيته ما رضي حتى يجده فكيف بيت ربكم إني مستخير ربي ثلاثا ثم عازم على أمري فلما مضى الثلاث أجمع رأيه على أن ينقضها فتحاماه الناس أن ينزل بأول الناس يصعد فيه أمر من السماء حتى صعده رجل فألقى منه حجارة فلما لم يره الناس أصابه شىء تتابعوا فنقضوه حتى بلغوا به الأرض فجعل ابن الزبير أعمدة فستر عليها الستور حتى ارتفع بناؤه ‏.‏ وقال ابن الزبير إني سمعت عائشة تقول إن النبي صلى الله عليه وسلم قال ‏\"‏ لولا أن الناس حديث عهدهم بكفر وليس عندي من النفقة ما يقوي على بنائه لكنت أدخلت فيه من الحجر خمس أذرع ولجعلت لها بابا يدخل الناس منه وبابا يخرجون منه ‏\"‏ ‏.‏ قال فأنا اليوم أجد ما أنفق ولست أخاف الناس - قال - فزاد فيه خمس أذرع من الحجر حتى أبدى أسا نظر الناس إليه فبنى عليه البناء وكان طول الكعبة ثماني عشرة ذراعا فلما زاد فيه استقصره فزاد في طوله عشر أذرع وجعل له بابين أحدهما يدخل منه والآخر يخرج منه ‏.‏ فلما قتل ابن الزبير كتب الحجاج إلى عبد الملك بن مروان يخبره بذلك ويخبره أن ابن الزبير قد وضع البناء على أس نظر إليه العدول من أهل مكة ‏.‏ فكتب إليه عبد الملك إنا لسنا من تلطيخ ابن الزبير في شىء أما ما زاد في طوله فأقره وأما ما زاد فيه من الحجر فرده إلى بنائه وسد الباب الذي فتحه ‏.‏ فنقضه وأعاده إلى بنائه ‏.‏",
      "text_en": " 'Ata' reported:                      The House was burnt during the time of Yazid b. Muawiya when the people of Syria had fought (in Mecca). And it happened with it (the Ka'ba) what was (in store for it). Ibn Zubair (Allah be pleased with him) felt it (in the same state) until the people came in the season (of Hajj). (The idea behind was) that he wanted to exhort them or incite them (to war) against the people of Syria. When the people had arrived he said to them: O people, advise me about the Ka'ba. Should I demolish it and then build it from its very foundation, or should I repair whatever has been damaged of it? Ibn 'Abbas said: An idea has occurred to me according to which I think that you should only repair (the portion which has been) damaged, and leave the House (in that very state in which) people embraced Islam (and leave those very stones in the same state) when people embraced Islam, and over which Allah's Apostle (may peace be upon him) had raised it. Thereupon Ibn Zubair said: It the house of any one of you is burnt, he would not be contented until he had reconstructed it, then what about the House of your Lord (which is far more Important than your house)? I would seek good advice from my Lord thrice and then I would make up (my mind) about this affair. After seeking good advice thrice, he made up his mind to demolish it. The people apprehended that calamity might fall from heaven on those persons who would be first to climb (over the building for the purpose of demolishing it), till one (took up courage, and ascended the roof), and threw down one of its stones. When the people saw no calamity befalling him, they followed him, demolished it until it was razed to the ground. Then Ibn Zubair erected pillars and hung cartains on them (in order to provide facilities to the people for observing the time of its construction). And the walls were raised; and Ibn Zubair said: I heard 'A'isha (Allah be pleased with her) say that Allah's Apostle (may peace be upon him) had observed: If the people had Rot recently (abandoned) unbelief, find I had means enough to reconstruct it, which I had not, I would have definitely excompassed in it five cubits of area from Hijr. And I would also have constructed a door for the people to enter, and a door for their exit. I today have (the means to spend) and I entertain no fearfrom the side of people (that they would protest against this change). So he added five cubits of area from the side of Hatim to it that there appeared (the old) foundation (upon which Hadrat Ibrahim had built the Ka'ba). and the people saw that and it was upon this foundation that the wall was raised. The length of the Ka'ba was eighteen cubits. when addition was made to it (which was in its breadth), then naturally the length appears to be) small (as compared with its breadth). Then addition of ten cubits (of area) was made in its length (also). Two doors were also constructed, one of which (was meant) for entrance and the other one for exit. When Ibn Zubair (Allah be pleased with him) was killed, Hajjaj wrote to 'Abd al-Malik (b. Marwan) informing him about it, and telling him that Ibn Zubair (Allah be pleased with him) had built (the Ka'ba) on those very foundations (which were laid by Ibrahim) and which reliable persons among the Meccans had seen. 'Abd al-Malik wrote to him: We are not concerned with the censuring of Ibn Zubair in anything. Keep intact the addition made by him in the side of length, and whatever he has added frem the side of Hijr revert to (its previous) foundation, and wall up the door which he had opened. Thus Hajjaj at the command of Abd al-Malik) demolished it (that portion) and rebuilt it on (its previous) foundations.",
      "chain": [
        "30480",
        "20366",
        "11029"
      ]
    },
    {
      "hadith_no": "3423",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا قتيبة بن سعيد، وهناد بن السري، وأبو بكر بن أبي شيبة قالوا حدثنا أبو الأحوص، عن سماك، عن جابر بن سمرة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن الله تعالى سمى المدينة طابة ‏\"‏ ‏.‏",
      "text_en": " Jabir b. Samura (Allah be pleased with him) reported that he heard Allah's Messenger (may peace be upon him) say:                      Allah named Medina as Tabba.",
      "chain": [
        "30367",
        "30480",
        "30201",
        "20327",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "3679",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "حدثنا هناد بن السري، حدثنا أبو الأحوص، عن أشعث بن أبي الشعثاء، عن أبيه، عن مسروق، قال قالت عائشة دخل على رسول الله صلى الله عليه وسلم وعندي رجل قاعد فاشتد ذلك عليه ورأيت الغضب في وجهه قالت فقلت يا رسول الله إنه أخي من الرضاعة ‏.‏ قالت فقال ‏\"‏ انظرن إخوتكن من الرضاعة فإنما الرضاعة من المجاعة‏\".",
      "text_en": " 'A'isha (Allah be pleased with her) reported:                      Allah's Messenger (may peace be upon him) visited me when a man was sitting near me, and he seemed to disapprove of that. And I saw signs of anger on his face and I said: Messenger of Allah, he is my brother by forsterage, whereupon he said: Consider who your brothers are because of fosterage since fosterage is through hunger (i. e. in infancy).",
      "chain": [
        "30480",
        "20327",
        "11324",
        "11351",
        "11018"
      ]
    },
    {
      "hadith_no": "4651",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا سعيد بن منصور، وهناد بن السري، قالا حدثنا ابن المبارك، عن موسى، بن عقبة عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم قطع نخل بني النضير وحرق ولها يقول حسان وهان على سراة بني لؤى حريق بالبويرة مستطير وفي ذلك نزلت ‏{‏ ما قطعتم من لينة أو تركتموها قائمة على أصولها‏}‏ الآية ‏.‏",
      "text_en": " It is narrated on the authority of Ibn Umar that the Messenger of Allah (may peace be upon him) caused the date-palms of Banu Nadir to be cut down and burnt. It is in this connection that Hassan (the poet) said:                      It was easy for the nobles of Quraish to burn Buwaira whose sparks were flying in all directions, in the same connection was revealed the Qur'anic verse:\" Whatever trees you have cut down or left standing on their trunks.\"",
      "chain": [
        "30116",
        "30480",
        "20025",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "4663",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "وحدثنا هناد بن السري، حدثنا ابن المبارك، ح وحدثني حرملة بن يحيى، أخبرنا ابن وهب، كلاهما عن يونس، عن ابن شهاب، قال بلغني عن ابن عمر، قال نفل رسول الله صلى الله عليه وسلم سرية بنحو حديث ابن رجاء ‏.‏",
      "text_en": " Ibn Shihab reported:                      It reached me through Ibn Umar that Allah's Messenger (may peace be upon him) gave a share of spoils to the troop. The rest of the hadith is the same.",
      "chain": [
        "30480",
        "20025",
        "30487",
        "20475",
        "11013",
        "18"
      ]
    },
    {
      "hadith_no": "4687",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا هناد بن السري، حدثنا ابن المبارك، عن عكرمة بن عمار، حدثني سماك، الحنفي قال سمعت ابن عباس، يقول حدثني عمر بن الخطاب، قال لما كان يوم بدر ح وحدثنا زهير بن حرب - واللفظ له - حدثنا عمر بن يونس الحنفي حدثنا عكرمة بن عمار حدثني أبو زميل - هو سماك الحنفي - حدثني عبد الله بن عباس قال حدثني عمر بن الخطاب قال لما كان يوم بدر نظر رسول الله صلى الله عليه وسلم إلى المشركين وهم ألف وأصحابه ثلاثمائة وتسعة عشر رجلا فاستقبل نبي الله صلى الله عليه وسلم القبلة ثم مد يديه فجعل يهتف بربه ‏\"‏ اللهم أنجز لي ما وعدتني اللهم آت ما وعدتني اللهم إن تهلك هذه العصابة من أهل الإسلام لا تعبد في الأرض ‏\"‏ ‏.‏ فمازال يهتف بربه مادا يديه مستقبل القبلة حتى سقط رداؤه عن منكبيه فأتاه أبو بكر فأخذ رداءه فألقاه على منكبيه ثم التزمه من ورائه ‏.‏ وقال يا نبي الله كذاك مناشدتك ربك فإنه سينجز لك ما وعدك فأنزل الله عز وجل ‏{‏ إذ تستغيثون ربكم فاستجاب لكم أني ممدكم بألف من الملائكة مردفين‏}‏ فأمده الله بالملائكة ‏.‏ قال أبو زميل فحدثني ابن عباس قال بينما رجل من المسلمين يومئذ يشتد في أثر رجل من المشركين أمامه إذ سمع ضربة بالسوط فوقه وصوت الفارس يقول أقدم حيزوم ‏.‏ فنظر إلى المشرك أمامه فخر مستلقيا فنظر إليه فإذا هو قد خطم أنفه وشق وجهه كضربة السوط فاخضر ذلك أجمع ‏.‏ فجاء الأنصاري فحدث بذلك رسول الله صلى الله عليه وسلم فقال ‏\"‏ صدقت ذلك من مدد السماء الثالثة ‏\"‏ ‏.‏ فقتلوا يومئذ سبعين وأسروا سبعين ‏.‏ قال أبو زميل قال ابن عباس فلما أسروا الأسارى قال رسول الله صلى الله عليه وسلم لأبي بكر وعمر ‏\"‏ ما ترون في هؤلاء الأسارى ‏\"‏ ‏.‏ فقال أبو بكر يا نبي الله هم بنو العم والعشيرة أرى أن تأخذ منهم فدية فتكون لنا قوة على الكفار فعسى الله أن يهديهم للإسلام ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ ما ترى يا ابن الخطاب ‏\"‏ ‏.‏ قلت لا والله يا رسول الله ما أرى الذي رأى أبو بكر ولكني أرى أن تمكنا فنضرب أعناقهم فتمكن عليا من عقيل فيضرب عنقه وتمكني من فلان - نسيبا لعمر - فأضرب عنقه فإن هؤلاء أئمة الكفر وصناديدها فهوي رسول الله صلى الله عليه وسلم ما قال أبو بكر ولم يهو ما قلت فلما كان من الغد جئت فإذا رسول الله صلى الله عليه وسلم وأبو بكر قاعدين يبكيان قلت يا رسول الله أخبرني من أى شىء تبكي أنت وصاحبك فإن وجدت بكاء بكيت وإن لم أجد بكاء تباكيت لبكائكما ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أبكي للذي عرض على أصحابك من أخذهم الفداء لقد عرض على عذابهم أدنى من هذه الشجرة ‏\"‏ ‏.‏ شجرة قريبة من نبي الله صلى الله عليه وسلم ‏.‏ وأنزل الله عز وجل ‏{‏ ما كان لنبي أن يكون له أسرى حتى يثخن في الأرض‏}‏ إلى قوله ‏{‏ فكلوا مما غنمتم حلالا طيبا‏}‏ فأحل الله الغنيمة لهم ‏.‏",
      "text_en": " It has been narrated on the authority of 'Umar b. al-Khattab who said:                      When it was the day on which the Battle of Badr was fought, the Messenger of Allah (may peace be upon him) cast a glance at the infidels, and they were one thousand while his own Companions were three hundred and nineteen. The Holy Prophet (may peace be upon him) turned (his face) towards the Qibla Then he stretched his hands and began his supplication to his Lord:\" O Allah, accomplish for me what Thou hast promised to me. O Allah, bring about what Thou hast promised to me. O Allah, if this small band of Muslims is destroyed. Thou will not be worshipped on this earth.\" He continued his supplication to his Lord, stretching his hands, facing the Qibla, until his mantle slipped down from his shoulders. So Abu Bakr came to him, picked up his mantle and put it on his shoulders. Then he embraced him from behind and said:. Prophet of Allah, this prayer of yours to your Lord will suffice you, and He will fulfil for you what He has promised you. So Allah, the Glorious and Exalted, revealed (the Qur'anic verse):\" When ye appealed to your Lord for help, He responded to your call (saying): I will help you with one thousand angels coming in succession.\" So Allah helped him with angels. Abu Zumail said that the badith was narrated to him by Ibn 'Abbas who said: While on that day a Muslim was chasing a disbeliever who was going ahead of him, he heard over him' the swishing of the whip and the voice of the rider saying: Go ahead, Haizi'm! He glanced at the polytheist who had (now) fallen down on his back. When he looked at him (carefully he found that) there was a scar on his nose and his face was torn as if it had been lashed with a whip, and had turned green with its poison. An Ansari came to the Messenger of Allah (may peace be upon him) and related this (event) to him. He said: You have told the truth. This was the help from the third heaven. The Muslims that day (i. e. the day of the Battle of Badr) killed seventy persons and captured seventy. The Messenger of Allah (may peace be upon him) said to Abu Bakr and 'Umar (Allah be pleased with them): What is your opinion about these captives? Abu Bakr said: They are our kith and kin. I think you should release them after getting from them a ransom. This will be a source of strength to us against the infidels. It is quite possible that Allah may guide them to Islam. Then the Messenger of Allah (may peace be upon him) said: What is your opinion. Ibn Khattab? He said: Messenger of Allah. I do not hold the same opinion as Abu Bakr. I am of the opinion that you should hand them over to us so that we may cut off their heads. Hand over 'Aqil to 'Ali that he may cut off his head, and hand over such and such relative to me that I may but off his head. They are leaders of the disbelievers and veterans among them. The Messenger of Allah (may peace be upon him) approved the opinion of Abu Bakr and did not approve what I said The next day when I came to the Messenger of Allah (may peace be upon him), I found that both he and Abu Bakr were sitting shedding tears. I said: Messenger of Allah, why are you and your Companion shedding tears? Tell me the reason. For I will weep ate, if not, I will at least pretend to weep in sympathy with you. The Messenger of Allah (may peace be upon him) said: I weep for what has happened to your companions for taking ransom (from the prisoners). I was shown the torture to which they were subjected. It was brought to me as close as this tree. (He pointed to a tree close to him.) Then God revealed the verse:\" It is not befitting for a prophet that he should take prisoners until the force of the disbelievers has been crushed...\" to the end of the verse:\" so eat ye the spoils of war, (it is) lawful and pure. So Allah made booty lawful for them.\"",
      "chain": [
        "30480",
        "20025",
        "10704",
        "17",
        "3",
        "30022",
        "20450",
        "10704"
      ]
    },
    {
      "hadith_no": "5092",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "حدثنا هناد بن السري، حدثنا ابن المبارك، عن حيوة بن شريح، قال سمعت  ربيعة بن يزيد الدمشقي، يقول أخبرني أبو إدريس، عائذ الله قال سمعت أبا ثعلبة الخشني، يقول أتيت رسول الله صلى الله عليه وسلم فقلت يا رسول الله إنا بأرض قوم من أهل الكتاب نأكل في آنيتهم وأرض صيد أصيد بقوسي وأصيد بكلبي المعلم أو بكلبي الذي ليس بمعلم فأخبرني ما الذي يحل لنا من ذلك قال ‏\"‏ أما ما ذكرت أنكم بأرض قوم من أهل الكتاب تأكلون في آنيتهم فإن وجدتم غير آنيتهم فلا تأكلوا فيها وإن لم تجدوا فاغسلوها ثم كلوا فيها وأما ما ذكرت أنك بأرض صيد فما أصبت بقوسك فاذكر اسم الله ثم كل وما أصبت بكلبك المعلم فاذكر اسم الله ثم كل وما أصبت بكلبك الذي ليس بمعلم فأدركت ذكاته فكل ‏\"‏ ‏.‏",
      "text_en": " Abu Tha'laba al-Khushani reported:                      I came to Allah's Messenger (may peace be upon him) and said: Allah's Messenger, we are in the land of the People of the Book, (so) we eat in their utensils, and (live) in a hunting region. where I hunt with, the help of my bow, and hunt with my trained dog, or with my dog which is not trained. So inform me what is lawful (Halal) for us out of that. He (the Holy Prophet) said: Regarding what you have mentioned of the fact that you live in the land belonging to the People of the Book and so you eat in their utensils, but if you can get utensils other than theirs, then don't eat in them; but if you do not find any, then wash them and eat in them. And regarding what you have mentioned about (your living) in a hunting region, what you hunt, (strike) with the help of your bow, recite the name of Allah (while shooting an arrow) and then eat; and what you catch with the help of your trained dog, recite the name of Allah (while letting oil) the dog and then eat it, and what you get with the help of your untrained dog, (if you find it alive) and slaughter it (according to the law of the Shari'ah), eat it.",
      "chain": [
        "30480",
        "20025",
        "26010",
        "11414"
      ]
    },
    {
      "hadith_no": "5187",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "وحدثنا قتيبة بن سعيد، وهناد بن السري، قالا حدثنا أبو الأحوص، ح وحدثنا  عثمان بن أبي شيبة، وإسحاق بن إبراهيم، جميعا عن جرير، كلاهما عن منصور، عن الشعبي، عن البراء بن عازب، قال خطبنا رسول الله صلى الله عليه وسلم في يوم النحر بعد الصلاة ‏.‏ ثم ذكر نحو حديثهم ‏.‏",
      "text_en": " al-Bara' b. 'Azib reported:                      Allah's Messenger (may peace be upon him) addressed us on the day of Nahr after the ('Id) prayer. The rest of the hadith is the same.",
      "chain": [
        "30367",
        "30480",
        "20327",
        "30203",
        "30123",
        "11067",
        "11052",
        "400"
      ]
    },
    {
      "hadith_no": "5711",
      "source": " Sahih Muslim ",
      "chapter": "The Book on General Behaviour - كتاب الآداب",
      "chapter_no": "39",
      "text_ar": "حدثنا هناد بن السري، حدثنا عبثر، عن حصين، عن سالم بن أبي الجعد، عن  جابر بن عبد الله، قال ولد لرجل منا غلام فسماه محمدا فقلنا لا نكنيك برسول الله صلى الله عليه وسلم حتى تستأمره ‏.‏ قال فأتاه فقال إنه ولد لي غلام فسميته برسول الله وإن قومي أبوا أن يكنوني به حتى تستأذن النبي صلى الله عليه وسلم فقال ‏\"‏ سموا باسمي ولا تكنوا بكنيتي فإنما بعثت قاسما أقسم بينكم ‏\"‏ ‏.‏",
      "text_en": " Jabir b. 'Abdullah reported that a child was born to one of the persons amongst us and he decided to give him the name of Muhammad We said:                      We will not allow you to give the name after the name of Allah's Messenger (may peace be upon him) until you ask him (the Holy Prophet). So he (that person) came and said (to the Holy Prophet): A child was born in my house and I wanted to give him the name (of Muhammad) after the name of Allah's Messenger, whereas my people did not allow me that I should name him after that (sacred) name until I have asked Allah's Apostle (may peace be upon him) in this connection, whereupon he said: Give him the name after my name, but do not call him by my kunya, for I have been sent as a Qasim as I distribute amongst you.",
      "chain": [
        "30480",
        "15097",
        "11342",
        "34"
      ]
    },
    {
      "hadith_no": "5825",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وهناد بن السري، قالا حدثنا أبو الأحوص، عن  منصور، ح وحدثنا زهير بن حرب، وعثمان بن أبي شيبة، وإسحاق بن إبراهيم، - واللفظ لزهير - قال إسحاق أخبرنا وقال الآخران، حدثنا - جرير، عن منصور، عن أبي وائل، عن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا كنتم ثلاثة فلا يتناجى اثنان دون الآخر حتى تختلطوا بالناس من أجل أن يحزنه ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah reported Allah's Messenger (may peace be upon him) as saying:                      If you are three, two amongst you should not converse secretly between yourselves to the exclusion of the other (third one), unti some other people join him (and dispel his loneliness), for it may hurt his feelings.",
      "chain": [
        "30201",
        "30480",
        "20327",
        "11067",
        "30022",
        "30203",
        "30123",
        "30312",
        "4057",
        "11067",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "5889",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثنا هناد بن السري، حدثنا أبو الأحوص، عن سعيد بن مسروق، عن عباية، بن رفاعة عن جده، رافع بن خديج قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن الحمى فور من جهنم فابردوها بالماء ‏\"‏ ‏.‏",
      "text_en": " Rafi' b. Khadij reported:                      I heard Allah's messenger (may peace be upon him) as saying: The fever is due to the intense heat of the Hell, so cool it with water.",
      "chain": [
        "30480",
        "20327",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "hadith_no": "6632",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا قتيبة بن سعيد، وهناد بن السري، قالا حدثنا أبو الأحوص، عن منصور، عن إبراهيم بن يزيد، عن عبيدة السلماني، عن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ خير أمتي القرن الذين يلوني ثم الذين يلونهم ثم الذين يلونهم ثم يجيء قوم تسبق شهادة أحدهم يمينه ويمينه شهادته ‏\"‏ ‏.‏ لم يذكر هناد القرن في حديثه وقال قتيبة ‏\"‏ ثم يجيء أقوام ‏\"‏ ‏.‏",
      "text_en": " Abdullah reported Allah's Messenger (may peace be upon him) as saying:                      The best of my Umma would be those of the generation nearest to mine. Then those nearest to them, then those nearest to them, then people would come whose witness would precede the oath and the oath will precede the witness. Hannad has not made the mention of Qarn in his narration. Qutaiba said that, instead of the word Qaum, the word Aqwam has been used.",
      "chain": [
        "30367",
        "30480",
        "20327",
        "11067",
        "11322",
        "16"
      ]
    },
    {
      "hadith_no": "6804",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وهناد بن السري، قالا حدثنا أبو الأحوص، عن  منصور، عن أبي وائل، عن عبد الله بن مسعود، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الصدق بر وإن البر يهدي إلى الجنة وإن العبد ليتحرى الصدق حتى يكتب عند الله صديقا وإن الكذب فجور وإن الفجور يهدي إلى النار وإن العبد ليتحرى الكذب حتى يكتب كذابا ‏\"‏ ‏.‏ قال ابن أبي شيبة في روايته عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " 'Abdullah b. Mas'ud reported Allah's Messenger (may peace be upon him) as saying:                      Telling of truth is a virtue and virtue leads to Paradise and the servant who endeavours to tell the truth is recorded as truthful, and lie is obscenity and obscenity leads to Hell-Fire, and the servant who endeavours to tell a lie is recorded as a liar. Ibn Abu Shaiba reported this from Allah's Apostle (may peace be upon him).",
      "chain": [
        "30201",
        "30480",
        "20327",
        "11067",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "6902",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Destiny - كتاب القدر",
      "chapter_no": "47",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وهناد بن السري، قالا حدثنا أبو الأحوص، عن  منصور، بهذا الإسناد في معناه وقال فأخذ عودا ‏.‏ ولم يقل مخصرة ‏.‏ وقال ابن أبي شيبة في حديثه عن أبي الأحوص ثم قرأ رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Mansur with the same chain of transmitters but with a slight variation of wording.",
      "chain": [
        "30201",
        "30480",
        "20327",
        "30201"
      ]
    },
    {
      "hadith_no": "20",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا زهير بن حرب، وهناد بن السري، قالا حدثنا وكيع، حدثنا الأعمش، قال سمعت مجاهدا، يحدث عن طاوس، عن ابن عباس، قال مر رسول الله صلى الله عليه وسلم على قبرين فقال ‏\"‏ إنهما يعذبان وما يعذبان في كبير أما هذا فكان لا يستنزه من البول وأما هذا فكان يمشي بالنميمة ‏\"‏ ‏.‏ ثم دعا بعسيب رطب فشقه باثنين ثم غرس على هذا واحدا وعلى هذا واحدا وقال ‏\"‏ لعله يخفف عنهما ما لم ييبسا ‏\"‏ ‏.‏ قال هناد ‏\"‏ يستتر ‏\"‏ ‏.‏ مكان ‏\"‏ يستنزه ‏\"‏ ‏.‏",
      "text_en": " Narrated Ibn 'Abbas :                     The Prophet (sal Allaahu alayhi wa sallam ) passed by two graves. He said : Both (the dead) are being punished, but they are not being punished for a major (sin). One did not safeguard himself from urine. The other carriedtales. He then called for a fresh twig and split it into two parts  and planted one part on each grave and said: Perhaps their punishment may be mitigated as long as the twigs remain fresh.Another version of Hannad has: \"One of them did not cover himself while urinating.\" This version does not have the words: \"He did not safeguard himself from urine.\"",
      "chain": [
        "30022",
        "30480",
        "20032",
        "11060",
        "11028",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "84",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا هناد، وسليمان بن داود العتكي، قالا حدثنا شريك، عن أبي فزارة، عن أبي زيد، عن عبد الله بن مسعود، أن النبي صلى الله عليه وسلم قال له ليلة الجن ‏\"‏ ما في إداوتك ‏\"‏ ‏.‏ قال نبيذ ‏.‏ قال ‏\"‏ تمرة طيبة وماء طهور ‏\"‏ ‏.‏ قال أبو داود وقال سليمان بن داود عن أبي زيد أو زيد كذا قال شريك ولم يذكر هناد ليلة الجن ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     AbuZayd quoted Abdullah ibn Mas'ud as saying that on the night when the jinn listened to the Qur'an the Prophet (ﷺ) said: What is in your skin vessel? He said: I have some nabidh. He (the Holy Prophet) said: It consists of fresh dates and pure water. Sulayman ibn Dawud reported the same version of this tradition on the authority of AbuZayd or Zayd. But Sharik said that Hammad did not mention the words \"night of the jinn\".",
      "chain": [
        "30480",
        "30584",
        "20587",
        "16"
      ]
    },
    {
      "hadith_no": "202",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا يحيى بن معين، وهناد بن السري، وعثمان بن أبي شيبة، عن عبد السلام بن حرب، - وهذا لفظ حديث يحيى - عن أبي خالد الدالاني، عن قتادة، عن أبي العالية، عن ابن عباس، أن رسول الله صلى الله عليه وسلم كان يسجد وينام وينفخ ثم يقوم فيصلي ولا يتوضأ ‏.‏ قال فقلت له صليت ولم تتوضأ وقد نمت فقال ‏\"‏ إنما الوضوء على من نام مضطجعا ‏\"‏ ‏.‏ زاد عثمان وهناد ‏\"‏ فإنه إذا اضطجع استرخت مفاصله ‏\"‏ ‏.‏ قال أبو داود قوله ‏\"‏ الوضوء على من نام مضطجعا ‏\"‏ ‏.‏ هو حديث منكر لم يروه إلا يزيد أبو خالد الدالاني عن قتادة وروى أوله جماعة عن ابن عباس ولم يذكروا شيئا من هذا وقال كان النبي صلى الله عليه وسلم محفوظا وقالت عائشة - رضى الله عنها - قال النبي صلى الله عليه وسلم ‏\"‏ تنام عيناى ولا ينام قلبي ‏\"‏ ‏.‏ وقال شعبة إنما سمع قتادة من أبي العالية أربعة أحاديث حديث يونس بن متى وحديث ابن عمر في الصلاة وحديث القضاة ثلاثة وحديث ابن عباس حدثني رجال مرضيون منهم عمر وأرضاهم عندي عمر ‏.‏ قال أبو داود وذكرت حديث يزيد الدالاني لأحمد بن حنبل فانتهرني استعظاما له وقال ما ليزيد الدالاني يدخل على أصحاب قتادة ولم يعبأ بالحديث ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Messenger of Allah (ﷺ) used to prostrate and sleep (in prostration) and produce puffing sounds (during sleep). Then he would stand and pray and would not perform ablution. I said to him: you prayed but did not perform ablution though you slept (in prostration). He replied: Ablution is necessary for one who sleeps while he is lying down. Uthman and Hannad added: For when he lies down, his joints are relaxed.Abu Dawud said: The statement \"ablution is necessary for one who sleeps while one is lying down\" is a munkar (rejected) tradition. It has been narrated only by Yazid Abu Khalid al-Dalani, on the authority of Qatadah. And its earlier part has been narrated by a group (of narrators) from Ibn 'Abbas; they did not mention anything about it. He (Ibn 'Abbas) said: The Prophet (ﷺ) was protected (during his sleep). 'Aishah reported: The Prophet (ﷺ) said: My eyes sleep, but my heart does not sleep. Shu'bah said: Qatadah heard from Abu'l-'Aliyah only four traditions: the tradition about Jonah son of Matthew, the tradition reported by Ibn 'Umar about prayer, the tradition stating that the judges are three, and the tradition narrated by Ibn 'Abbas saying: (This tradition) has been narrated to me by reliable persons ; 'Umar is one of them, and the most reliable of them in my opinion is 'Umar. Abu Dawud said: I asked Ahmad b. Hanbal about the tradition narrated by Yazid al-Dalani. He rebuked me out of respect for him. Then he said: Yazid al-Dalani does not add anything to what has been narrated by the teachers of Qatadah. He did not care of this tradition (due to its weakness).",
      "chain": [
        "30020",
        "30480",
        "30203",
        "20248",
        "20728",
        "11019",
        "11618",
        "17"
      ]
    },
    {
      "hadith_no": "204",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا هناد بن السري، وإبراهيم بن أبي معاوية، عن أبي معاوية، ح وحدثنا عثمان بن أبي شيبة، حدثني شريك، وجرير، وابن، إدريس عن الأعمش، عن شقيق، قال قال عبد الله كنا لا نتوضأ من موطئ ولا نكف شعرا ولا ثوبا ‏.‏ قال أبو داود قال إبراهيم بن أبي معاوية فيه عن الأعمش عن شقيق عن مسروق أو حدثه عنه قال قال عبد الله وقال هناد عن شقيق أو حدثه عنه ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     We would not wash our feet after treading on something unclean, nor would we hold our hair and garments (during prayer).Abu Dawud said: The tradition has been reported by Ibrahim b. Abi Mu'awiyah through a different chain of narrators: A'mash - Shaqiq - Masruq - 'Abd Allah (b. Mas'ud). And Hannad reported from Shaqiq, or reported on his authority saying: 'Abd Allah (b. Mas'ud) said.",
      "chain": [
        "30480",
        "20354",
        "30203",
        "20587",
        "4057",
        "20102",
        "11060",
        "11353",
        "30002",
        "11060"
      ]
    },
    {
      "hadith_no": "292",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا هناد بن السري، عن عبدة، عن ابن إسحاق، عن الزهري، عن عروة، عن عائشة، أن أم حبيبة بنت جحش، استحيضت في عهد رسول الله صلى الله عليه وسلم فأمرها بالغسل لكل صلاة وساق الحديث ‏.‏ قال أبو داود ورواه أبو الوليد الطيالسي ولم أسمعه منه عن سليمان بن كثير عن الزهري عن عروة عن عائشة قالت استحيضت زينب بنت جحش فقال لها النبي صلى الله عليه وسلم ‏\"‏ اغتسلي لكل صلاة ‏\"‏ ‏.‏ وساق الحديث ‏.‏ قال أبو داود ورواه عبد الصمد عن سليمان بن كثير قال ‏\"‏ توضئي لكل صلاة ‏\"‏ ‏.‏ قال أبو داود وهذا وهم من عبد الصمد والقول فيه قول أبي الوليد ‏.‏",
      "text_en": " 'Aishah said:                      Umm Habibah had a prolonged flow of blood during the time of Messenger of Allah (ﷺ). He commanded her to take bath for every prayer. The narrator then transmitted the tradition (in full).Abu Dawud said: It has also been narrated by Abu al-Walid al-Tayalisi, but I did not hear him. He reported it from 'Aishah through a different chain of narrators. 'Aishah said: Zainab daughter of Jahsh had a prolonged flow of blood. The Prophet (ﷺ) said to her: Take bath for every prayer. The narrator then reported the tradition (in full).Abu Dawud said: The version transmitted by 'Abd al-Samad from Sulaiman b. Kathir has: \"Perform ablution for every prayer.\" This is a misunderstanding on the part of 'Abd al-Samad. The correct version is the one narrated by Abu al-Walid.",
      "chain": [
        "30480",
        "20337",
        "11107",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "440",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا هناد، حدثنا عبثر، عن حصين، عن عبد الله بن أبي قتادة، عن أبيه، عن النبي صلى الله عليه وسلم بمعناه قال فتوضأ حين ارتفعت الشمس فصلى بهم ‏.‏",
      "text_en": " This tradition has been transmitted through a different chain by Abu Qatadah to the same effect. This version adds:                      \"He performed ablution when the sun had arisen high and led them in prayer.\"",
      "chain": [
        "30480",
        "15097",
        "11804",
        "391"
      ]
    },
    {
      "hadith_no": "478",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا هناد بن السري، عن أبي الأحوص، عن منصور، عن ربعي، عن طارق بن عبد الله المحاربي، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا قام الرجل إلى الصلاة - أو إذا صلى أحدكم فلا يبزق أمامه ولا عن يمينه ولكن عن تلقاء يساره إن كان فارغا أو تحت قدمه اليسرى ثم ليقل به ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah al-Muharibi:                     The Messenger of Allah (ﷺ) said: When a man stands with the intention of saying prayer, or if any of you says prayer, he should not spit before him, nor at his right side; but he should do so at his left side, if there is a place for it; or he should spit under his left foot and then rub it off.",
      "chain": [
        "30480",
        "20327",
        "11067",
        "11334",
        "5100"
      ]
    },
    {
      "hadith_no": "664",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا هناد بن السري، وأبو عاصم بن جواس الحنفي عن أبي الأحوص، عن منصور، عن طلحة اليامي، عن عبد الرحمن بن عوسجة، عن البراء بن عازب، قال كان رسول الله صلى الله عليه وسلم يتخلل الصف من ناحية إلى ناحية يمسح صدورنا ومناكبنا ويقول ‏\"‏ لا تختلفوا فتختلف قلوبكم ‏\"‏ ‏.‏ وكان يقول ‏\"‏ إن الله وملائكته يصلون على الصفوف الأول ‏\"‏ ‏.‏",
      "text_en": " Narrated Al-Bara' ibn Azib:                     The Messenger of Allah (ﷺ) used to pass through the row from one side to the other; he used to set out chests and shoulders in order, and say: Do not be irregular. And he would say: Allah and His angels bless those who are near the first rows.",
      "chain": [
        "30480",
        "20327",
        "11067",
        "19875",
        "400"
      ]
    },
    {
      "hadith_no": "784",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا هناد بن السري، حدثنا ابن فضيل، عن المختار بن فلفل، قال سمعت أنس بن مالك، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ أنزلت على آنفا سورة ‏\"‏ ‏.‏ فقرأ بسم الله الرحمن الرحيم ‏{‏ إنا أعطيناك الكوثر ‏}‏ حتى ختمها ‏.‏ قال ‏\"‏ هل تدرون ما الكوثر ‏\"‏ ‏.‏ قالوا الله ورسوله أعلم ‏.‏ قال ‏\"‏ فإنه نهر وعدنيه ربي في الجنة ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik said:                      The Messenger of Allah (ﷺ) said: A surah has just been revealed to me. He then recited:”In the name of Allah, the Compassionate, the Merciful. Lo! We have given thee Abundance” until he finished it. Then he asked: Do you know what Abundance (al-Kawthar) is? They replied: Allah and His Apostle know it better. He said: It is a river of which my Lord, the Exalted, the Majestic has promised me to give in Paradise.",
      "chain": [
        "30480",
        "20356",
        "10962",
        "19"
      ]
    },
    {
      "hadith_no": "903",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا هناد بن السري، عن وكيع، عن سعيد بن زياد، عن زياد بن صبيح الحنفي، قال صليت إلى جنب ابن عمر فوضعت يدى على خاصرتى فلما صلى قال هذا الصلب في الصلاة وكان رسول الله صلى الله عليه وسلم ينهى عنه ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     Sa'id ibn Ziyad ibn Subayh al-Hanafi said: I prayed by the side of Ibn Umar and I put my hands on my waist. When he finished his prayer, He said: This is a cross in prayer; the Messenger of Allah (ﷺ) used to forbid it.",
      "chain": [
        "30480",
        "20032",
        "13028"
      ]
    },
    {
      "hadith_no": "962",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا هناد بن السري، عن وكيع، عن سفيان، عن الزبير بن عدي، عن إبراهيم، قال كان النبي صلى الله عليه وسلم إذا جلس في الصلاة افترش رجله اليسرى حتى اسود ظهر قدمه ‏.‏",
      "text_en": " It was reported from Ibrahim that he said:                      \"When the Prophet (ﷺ) would sit in the prayer, he would place his left foot horizontally - so much so that the upper-part of his foot became black.\"",
      "chain": [
        "30480",
        "20032",
        "20012",
        "11336",
        "11051"
      ]
    },
    {
      "hadith_no": "1089",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا هناد بن السري، حدثنا عبدة، عن محمد، - يعني ابن إسحاق - عن الزهري، عن السائب، قال لم يكن لرسول الله صلى الله عليه وسلم إلا مؤذن واحد بلال ثم ذكر معناه ‏.‏",
      "text_en": " Sa'ib said:                      There was no other mu'adhdhin (pronouncer) of the Messenger of Allah (ﷺ) except Bilal.The narrator then reported the tradition to the same effect.",
      "chain": [
        "30480",
        "20337",
        "11107",
        "11013",
        "3048"
      ]
    },
    {
      "hadith_no": "1119",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا هناد بن السري، عن عبدة، عن ابن إسحاق، عن نافع، عن ابن عمر، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إذا نعس أحدكم وهو في المسجد فليتحول من مجلسه ذلك إلى غيره ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     The Prophet (ﷺ) said: When any of you dozes in the mosque (on Friday), he should change his place.",
      "chain": [
        "30480",
        "20337",
        "11107",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1148",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عثمان بن أبي شيبة، وهناد، - وهذا لفظه - قالا حدثنا أبو الأحوص، عن سماك، - يعني ابن حرب - عن جابر بن سمرة، قال صليت مع النبي صلى الله عليه وسلم غير مرة ولا مرتين العيدين بغير أذان ولا إقامة ‏.‏",
      "text_en": " Jabir b. Samurah said:                      I prayed the 'Id prayer with the Prophet (ﷺ) not once or twice (but many times) without the adhan and the iqamah.",
      "chain": [
        "30203",
        "30480",
        "20327",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "1317",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا إبراهيم بن موسى، حدثنا أبو الأحوص، ح وحدثنا هناد، عن أبي الأحوص، - وهذا حديث إبراهيم - عن أشعث، عن أبيه، عن مسروق، قال سألت عائشة - رضى الله عنها - عن صلاة رسول الله صلى الله عليه وسلم فقلت لها أى حين كان يصلي قالت كان إذا سمع الصراخ قام فصلى ‏.‏",
      "text_en": " Masruq said:                      I asked 'Aishah about the prayer of the Messenger of Allah (ﷺ), and I said to her: At what time he prayed at night ? She said: When he heard the cock crow, he got up and prayed.",
      "chain": [
        "30309",
        "20327",
        "30480",
        "20327",
        "11324",
        "11351",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "1374",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Ramadan - كتاب شهر رمضان",
      "chapter_no": "6",
      "text_ar": "حدثنا هناد بن السري، حدثنا عبدة، عن محمد بن عمرو، عن محمد بن إبراهيم، عن أبي سلمة بن عبد الرحمن، عن عائشة، قالت كان الناس يصلون في المسجد في رمضان أوزاعا فأمرني رسول الله صلى الله عليه وسلم فضربت له حصيرا فصلى عليه بهذه القصة قالت فيه قال - تعني النبي صلى الله عليه وسلم - ‏\"‏ أيها الناس أما والله ما بت ليلتي هذه بحمد الله غافلا ولا خفي على مكانكم ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Aishah:                     The people used to pray (tarawih prayer) in the mosque during Ramadan severally. The Messenger of Allah (ﷺ) commanded me (to spread a mat). I spread a mat for him and he prayed upon it. The narrator then transmitted the same story. The Prophet (ﷺ) said: O People, praise be to Allah, I did not pass my night carelessly, nor did your position remain hidden from me.",
      "chain": [
        "30480",
        "20337",
        "11220",
        "11213",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "1404",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prostration while reciting the Qur'an - كتاب سجود القرآن",
      "chapter_no": "7",
      "text_ar": "حدثنا هناد بن السري، حدثنا وكيع، عن ابن أبي ذئب، عن يزيد بن عبد الله بن قسيط، عن عطاء بن يسار، عن زيد بن ثابت، قال قرأت على رسول الله صلى الله عليه وسلم النجم فلم يسجد فيها ‏.‏",
      "text_en": " On the authority of Zaid bin Thabit, he said:                      \"I recited to the Messenger of Allah (ﷺ) (Surat) An-Najm and he did not prostrate in it.\"",
      "chain": [
        "30480",
        "20032",
        "20177",
        "11236",
        "11020",
        "49"
      ]
    },
    {
      "hadith_no": "1690",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا هناد بن السري، عن عبدة، عن محمد بن إسحاق، عن بكير بن عبد الله بن الأشج، عن سليمان بن يسار، عن ميمونة، زوج النبي صلى الله عليه وسلم قالت كانت لي جارية فأعتقتها فدخل على النبي صلى الله عليه وسلم فأخبرته فقال ‏\"‏ آجرك الله أما إنك لو كنت أعطيتها أخوالك كان أعظم لأجرك ‏\"‏ ‏.‏",
      "text_en": " Maimunah, wife of the Probhet (ﷺ) said :                      I had a slave girl and I set her free. When the Prophet (ﷺ) entered upon me, I informed him (of this). He said : May Allah give reward for it; if you had given her to your maternal uncles, it would have increased your reward",
      "chain": [
        "30480",
        "20337",
        "11107",
        "11154",
        "11005"
      ]
    },
    {
      "hadith_no": "1726",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا عثمان بن أبي شيبة، وهناد، أن أبا معاوية، ووكيعا، حدثاهم عن الأعمش، عن أبي صالح، عن أبي سعيد، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يحل لامرأة تؤمن بالله واليوم الآخر أن تسافر سفرا فوق ثلاثة أيام فصاعدا إلا ومعها أبوها أو أخوها أو زوجها أو ابنها أو ذو محرم منها ‏\"‏ ‏.‏",
      "text_en": " Abu Sa’id reported The Apostel of Allah (SWAS) as saying:                      A woman who believes in Allah and the Last Day must not make a journey of more than three days unless she is accompanied by her father or her brother, or her husband or her son or her relative who is within the prohibited degree.",
      "chain": [
        "30203",
        "30480",
        "20354",
        "11060",
        "11161",
        "38"
      ]
    },
    {
      "hadith_no": "1755",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا هناد، حدثنا وكيع، عن سفيان، عن منصور، والأعمش، عن إبراهيم، عن الأسود، عن عائشة، أن رسول الله صلى الله عليه وسلم أهدى غنما مقلدة ‏.‏",
      "text_en": " Ai’shah said :                      The Messenger of Allah (SWAS) once brought sheep (or goats) for sacrifice to the house (at the Ka’bah) and garlanded them.",
      "chain": [
        "30480",
        "20032",
        "20012",
        "11067",
        "11060",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "1801",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا هناد بن السري، حدثنا ابن أبي زائدة، أخبرنا عبد العزيز، حدثني الربيع بن سبرة، عن أبيه، قال خرجنا مع رسول الله صلى الله عليه وسلم حتى إذا كان بعسفان قال له سراقة بن مالك المدلجي يا رسول الله اقض لنا قضاء قوم كأنما ولدوا اليوم ‏.‏ فقال ‏\"‏ إن الله تعالى قد أدخل عليكم في حجكم هذا عمرة فإذا قدمتم فمن تطوف بالبيت وبين الصفا والمروة فقد حل إلا من كان معه هدى ‏\"‏ ‏.‏",
      "text_en": " Narrated Saburah:                     Ar-Rabi' ibn Saburah said on the authority of his father (Saburah): We went out along with the Messenger of Allah (ﷺ) till we reached Usfan, Suraqah ibn Malik al-Mudlaji said to him: Messenger of Allah, explain to us like the people as if they were born today. He said: Allah, the Exalted, has included this umrah in your hajj. When you come (to Mecca), and he who goes round the House (the Ka'bah), and runs between as-Safa and al-Marwah, is allowed to take off ihram except he who has brought the sacrificial animals with him.",
      "chain": [
        "30480",
        "20366",
        "20167",
        "11847"
      ]
    },
    {
      "hadith_no": "1807",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا هناد، - يعني ابن السري - عن ابن أبي زائدة، أخبرنا محمد بن إسحاق، عن عبد الرحمن بن الأسود، عن سليم بن الأسود، أن أبا ذر، كان يقول فيمن حج ثم فسخها بعمرة لم يكن ذلك إلا للركب الذين كانوا مع رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Abu Dharr used to say about a person who makes the intention of Hajj but he repeal it for the ‘Umrah (that will not be valid). This cancellation of hajj for ‘Umrah was specially meant for the people who accompanied the Apostle of Allaah(ﷺ).",
      "chain": [
        "30480",
        "20366",
        "11107",
        "11056",
        "23"
      ]
    },
    {
      "hadith_no": "1811",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا إسحاق بن إسماعيل الطالقاني، وهناد بن السري، - المعنى واحد - قال إسحاق - حدثنا عبدة بن سليمان، عن ابن أبي عروبة، عن قتادة، عن عزرة، عن سعيد بن جبير، عن ابن عباس، أن النبي صلى الله عليه وسلم سمع رجلا يقول لبيك عن شبرمة ‏.‏ قال ‏\"‏ من شبرمة ‏\"‏ ‏.‏ قال أخ لي أو قريب لي ‏.‏ قال ‏\"‏ حججت عن نفسك ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ حج عن نفسك ثم حج عن شبرمة ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Prophet (ﷺ) heard a man say: Labbayk (always ready to obey) on behalf of Shubrumah. He asked: Who is Shubrumah? He replied: A brother or relative of mine. He asked: Have you performed hajj on your own behalf? He said: No. He said: perform hajj on your own behalf, then perform it on behalf of Shubrumah.",
      "chain": [
        "30480",
        "30021",
        "20337",
        "11073",
        "11019",
        "10799",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "1910",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا هناد، عن أبي معاوية، عن هشام بن عروة، عن أبيه، عن عائشة، قالت كانت قريش ومن دان دينها يقفون بالمزدلفة وكانوا يسمون الحمس وكان سائر العرب يقفون بعرفة قالت فلما جاء الإسلام أمر الله تعالى نبيه صلى الله عليه وسلم أن يأتي عرفات فيقف بها ثم يفيض منها فذلك قوله تعالى ‏{‏ ثم أفيضوا من حيث أفاض الناس ‏}‏ ‏.‏",
      "text_en": " A’ishah said “Quraish and those who followed their religion used to station at Al Muzdalifah and they were called Al Hums and the rest of Arabs used to station at ‘Arafah. When Islam came, Allaah the most High commanded His Prophet (ﷺ) to go to ‘Arafah and station there then go quickly from it. That is in accordance with the words of Him Who is exalted “Then go quickly from where the people went quickly.”",
      "chain": [
        "30480",
        "20354",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1915",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا هناد، عن ابن أبي زائدة، حدثنا سفيان بن عيينة، عن زيد بن أسلم، عن رجل، من بني ضمرة عن أبيه، أو عمه قال رأيت رسول الله صلى الله عليه وسلم وهو على المنبر بعرفة ‏.‏",
      "text_en": " A man from banu Damrah reported on the authority of his father or his uncle “ I saw the Apostle of Allaah(ﷺ) on the pulpit in ‘Arafah.”",
      "chain": [
        "30480",
        "20366",
        "20005",
        "11163"
      ]
    },
    {
      "hadith_no": "1917",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا هناد بن السري، وعثمان بن أبي شيبة، قالا حدثنا وكيع، عن عبد المجيد، قال حدثني العداء بن خالد بن هوذة، - قال هناد عن عبد المجيد أبي عمرو، - قال حدثني خالد بن العداء بن هوذة، قال رأيت رسول الله صلى الله عليه وسلم يخطب الناس يوم عرفة على بعير قائم في الركابين ‏.‏ قال أبو داود رواه ابن العلاء عن وكيع كما قال هناد ‏.‏",
      "text_en": " Al-Adda' ibn Khalid ibn Hudhah said:                      I saw the Messenger of Allah (ﷺ) on 9 Dhul-Hijjah on a camel standing at the stirrups.Abu Dawud said: Ibn al-'Ala has reported this tradition from Waki' as narrated by Hammad.",
      "chain": [
        "30480",
        "30203",
        "20032",
        "3701",
        "30480"
      ]
    },
    {
      "hadith_no": "1962",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا هناد بن السري، عن أبي الأحوص، عن المغيرة، عن إبراهيم، قال إن عثمان صلى أربعا لأنه اتخذها وطنا ‏.‏",
      "text_en": " Narrated Ibrahim:                     Uthman prayed four rak'ahs (at Mina) for he made it his home (for settlement).",
      "chain": [
        "30480",
        "20327",
        "166",
        "11051"
      ]
    },
    {
      "hadith_no": "1987",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا هناد بن السري، عن ابن أبي زائدة، حدثنا ابن جريج، ومحمد بن إسحاق، عن عبد الله بن طاوس، عن أبيه، عن ابن عباس، قال والله ما أعمر رسول الله صلى الله عليه وسلم عائشة في ذي الحجة إلا ليقطع بذلك أمر أهل الشرك فإن هذا الحى من قريش ومن دان دينهم كانوا يقولون إذا عفا الوبر وبرأ الدبر ودخل صفر فقد حلت العمرة لمن اعتمر ‏.‏ فكانوا يحرمون العمرة حتى ينسلخ ذو الحجة والمحرم ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     By Allah, the Messenger of Allah (ﷺ) did not make Aisha perform umrah during Dhul-Hijjah but to discontinue the practice of the idolaters (in Arabia before Islam), for this clan of Quraysh and those who followed them used to say: When the fur of the camel abounds, and the wounds on the back of the camels are recovered and the month of Safar begins, umrah becomes lawful for one who performs umrah. They considered performing umrah unlawful till the months of Dhul-Hijjah and al-Muharram passed away.",
      "chain": [
        "30480",
        "20366",
        "11070",
        "11107",
        "11433",
        "11053",
        "17"
      ]
    }
  ],
  "total_hadiths": 472
}