{
  "id": "30484",
  "name": "Ahmed bin 'Abdur Rahman أحمد بن عبد الرحمن بن وهب",
  "full_name": "Ahmed bin 'Abdur Rahman أحمد بن عبد الرحمن بن وهب",
  "grade": "3rd Century AH [11th generation]",
  "reliability_grade": "Sadooq/Delusion",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "264",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Egypt"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq/Delusion] [ م  -  صدوق له أوهام ]"
    ],
    "tags": [
      "al-Masri"
    ],
    "area_of_interest_display": [
      {
        "en": "Narrator[Grade:Sadooq/Delusion] [ م  -  صدوق له أوهام ]",
        "ar": "Narrator[Grade:Sadooq/Delusion] [ م  -  صدوق له أوهام ]",
        "ckb": "Narrator[Grade:Sadooq/Delusion] [ م  -  صدوق له أوهام ]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "Egypt",
        "ar": "مصر",
        "ckb": "میسر"
      }
    ],
    "tags_display": [
      {
        "en": "al-Masri",
        "ar": "al-Masri",
        "ckb": "al-Masri"
      }
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20002",
      "name": "Imam Shafi'ee ابو عبد الله محمد بن إدريس الشافعي",
      "grade": "Succ. (Taba' Tabi') [9th generation] [Shafi'ee]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [9th Generation]",
        "ar": "تابع التابعين [الجيل التاسع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی نۆیەم]"
      }
    },
    {
      "id": "26001",
      "name": "Ishaq bin al-Frat bin al-J'd إسحاق بن الفرات بن الجعد",
      "grade": "Succ. (Taba' Tabi') [9th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [9th Generation]",
        "ar": "تابع التابعين [الجيل التاسع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی نۆیەم]"
      }
    },
    {
      "id": "20413",
      "name": "Bashr bin Bakr al-Tunisi بشر بن بكر التنيسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [9th Generation]",
        "ar": "تابع التابعين [الجيل التاسع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی نۆیەم]"
      }
    }
  ],
  "students": [
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]",
      "grade_display": {
        "en": "3rd Century AH [Shafi'i]",
        "ar": "القرن الثالث الهجري [شافعي]",
        "ckb": "سەدەی سێیەمی كۆچی [شافیعی]"
      }
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]",
      "grade_display": {
        "en": "3rd Century AH [11th Generation]",
        "ar": "القرن الثالث الهجري [الجيل الحادي عشر]",
        "ckb": "سەدەی سێیەمی كۆچی [نەوەی یازدەیەم]"
      }
    },
    {
      "id": "31170",
      "name": "Muhammad bin Sulaiman al-Baghandi محمد بن سليمان بن الحارث الباغندي",
      "grade": "3rd Century AH",
      "grade_display": {
        "en": "3rd Century AH",
        "ar": "القرن الثالث الهجري",
        "ckb": "سەدەی سێیەمی كۆچی"
      }
    }
  ],
  "hadiths": [
    {
      "id": "sahih-muslim-1301",
      "hadith_no": "1301",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثني أحمد بن عبد الرحمن بن وهب، حدثني عمي عبد الله، حدثني داود بن قيس، عن زيد بن أسلم، بهذا الإسناد وفي معناه قال ‏\"‏ يسجد سجدتين قبل السلام ‏\"‏ ‏.‏ كما قال سليمان بن بلال ‏.‏",
      "text_en": " This hadith has been narrated by Zaid b. Aslam with the same chain of transmitters and he said:                      He should perform two prostrations before the salutation, as it was mentioned by Sulaiman b. Bilal.",
      "usc_msa_ref": "",
      "chain": [
        "30484",
        "11845",
        "11163"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-1926",
      "hadith_no": "1926",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا أحمد بن عبد الرحمن بن وهب، حدثنا عمي عبد الله بن وهب، حدثنا عمرو بن الحارث، عن سعيد بن أبي هلال، أن أبا الرجال، محمد بن عبد الرحمن حدثه عن أمه، عمرة بنت عبد الرحمن وكانت في حجر عائشة زوج النبي صلى الله عليه وسلم عن عائشة أن رسول الله صلى الله عليه وسلم بعث رجلا على سرية وكان يقرأ لأصحابه في صلاتهم فيختم ب ‏{‏ قل هو الله أحد‏}‏ فلما رجعوا ذكر ذلك لرسول الله صلى الله عليه وسلم فقال ‏\"‏ سلوه لأى شىء يصنع ذلك ‏\"‏ ‏.‏ فسألوه فقال لأنها صفة الرحمن فأنا أحب أن أقرأ بها ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أخبروه أن الله يحبه \".",
      "text_en": " 'Uqba b. 'Amir reported Allah's Messenger (may peace be upon him) as saying:                      What wonderful verses have been sent down today. the like of which has never been seen! They are:\" Say: I seek refuge with the Lord of the dawn,\" and\" Say: I seek refuge with the Lord of men.\"",
      "usc_msa_ref": "",
      "chain": [
        "30484",
        "20377",
        "11169",
        "10959"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-4833",
      "hadith_no": "4833",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثني أحمد بن عبد الرحمن بن وهب، أخبرني عمي عبد الله بن وهب، أخبرني رجل، سماه وعمرو بن الحارث عن بكير، عن بسر بن سعيد، حدثه عن عبد الله بن عمر، عن النبي صلى الله عليه وسلم بهذا المعنى ‏.‏",
      "text_en": " A hadith having the same meaning has been transmitted on the authority of 'Abdullah b. 'Umar.",
      "usc_msa_ref": "",
      "chain": [
        "30484",
        "11154",
        "11153",
        "18"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-5066",
      "hadith_no": "5066",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثني أحمد بن عبد الرحمن بن وهب، حدثنا عمي عبد الله بن وهب، حدثنا  عمرو بن الحارث، حدثني يزيد بن أبي حبيب، حدثني عبد الرحمن بن شماسة المهري، قال كنت عند مسلمة بن مخلد وعنده عبد الله بن عمرو بن العاص فقال عبد الله لا تقوم الساعة إلا على شرار الخلق هم شر من أهل الجاهلية لا يدعون الله بشىء إلا رده عليهم ‏.‏ فبينما هم على ذلك أقبل عقبة بن عامر فقال له مسلمة يا عقبة اسمع ما يقول عبد الله ‏.‏ فقال عقبة هو أعلم وأما أنا فسمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا تزال عصابة من أمتي يقاتلون على أمر الله قاهرين لعدوهم لا يضرهم من خالفهم حتى تأتيهم الساعة وهم على ذلك ‏\"‏ ‏.‏ فقال عبد الله أجل ‏.‏ ثم يبعث الله ريحا كريح المسك مسها مس الحرير فلا تترك نفسا في قلبه مثقال حبة من الإيمان إلا قبضته ثم يبقى شرار الناس عليهم تقوم الساعة ‏.‏",
      "text_en": " It has been narrated on the authority of 'Abd al-Rahman b. Shamasa al- Mahri who said:                      I was in the company of Maslama b. Mukhallad, and 'Abdullah b. 'Amr b. 'As was with him. 'Abdullah said: The Hour shall some oniy when the worst type of people are left on the earth. They will be worse than the people of pre-Islamic days. They will get whatever they ask of Allah. While we were yet sitting when 'Uqba b. 'Amir came, and Maslama said to him: 'Uqba, listen to what 'Abdullah says. 'Uqba said: He knows better; so far as I am concerned, I heard the Messenger of Allah (may peace be upon him) say: A group of people from my Umma will continue to fight in obedience to the Command of Allah, remaining dominant over their enemies. Those who will oppose them shall not do them any harm. They will remain ill this condition until the Hour overtakes them. (At this) 'Abdullah said: Yes. Then Allah will raise a wild which will be fragrant like musk and whose touch will be like the touch of silk; (but) it will cause the death of all (faithful) persons, not leaving behind a single person with an iota of faith in his heart. Then only the worst of men will remain to be overwhelmed by the Hour.",
      "usc_msa_ref": "",
      "chain": [
        "30484",
        "20377",
        "11411",
        "10867"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-6346",
      "hadith_no": "6346",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثني أحمد بن عبد الرحمن بن وهب، حدثنا عمي عبد الله بن وهب، أخبرني  عمرو بن الحارث، أن أبا يونس، مولى أبي هريرة حدثه عن أبي هريرة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ بينا أنا نائم أريت أني أنزع على حوضي أسقي الناس فجاءني أبو بكر فأخذ الدلو من يدي ليروحني فنزع دلوين وفي نزعه ضعف والله يغفر له فجاء ابن الخطاب فأخذ منه فلم أر نزع رجل قط أقوى منه حتى تولى الناس والحوض ملآن يتفجر ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      While I was asleep I saw myself drawing water from my tank in order to quench the thirst of the people that there came to me Abu Bakr. He took hold of the leathern bucket from my hand so that he should serve water to the people. He drew two bucketfuls and there was some weakness in his drawing (Allah may forgive him). Then there came Ibn Khattab and he took hold of that, and I did not see a person stronger than he (drawing water) until the people went away with their thirst quenched and the tank filled with water.",
      "usc_msa_ref": "",
      "chain": [
        "30484",
        "20377",
        "13"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    }
  ],
  "total_hadiths": 5,
  "grade_display": {
    "en": "3rd Century AH [11th Generation]",
    "ar": "القرن الثالث الهجري [الجيل الحادي عشر]",
    "ckb": "سەدەی سێیەمی كۆچی [نەوەی یازدەیەم]"
  }
}