{
  "id": "30481",
  "name": "Wasl bin Abd al-A'la واصل بن عبد الأعلى بن هلال الأسدي",
  "full_name": "Wasl bin Abd al-A'la واصل بن عبد الأعلى بن هلال الأسدي",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "244",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  4  -  ثقة ]"
    ],
    "tags": [
      "B.Asad",
      "al-Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20373",
      "name": "Abu Bakr bin 'Ayyash al-Asadi أبو بكر بن عياش بن سالم الأسدي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20032",
      "name": "Waki' bin al-Jarrah وكيع بن الجراح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20408",
      "name": "Asbat bin Muhammad أسباط بن محمد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20318",
      "name": "Hammad bin Usamah حماد بن أسامة - أبو أسامة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20356",
      "name": "Muhammad bin Fadayl bin Ghazwan محمد بن فضيل بن غزوان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20364",
      "name": "Yahya bin Aadm bin Sulaiman يحيى بن آدم بن سليمان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30004",
      "name": "Ibn Maja ابن ماجة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]"
    },
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "30005",
      "name": "Imam Tirmidhi الترمذي محمد بن عيسى بن سورة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30006",
      "name": "Imam Nasa'i أحمد بن شعيب بن علي بن سنان النسائي",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30554",
      "name": "Abu Zara' al-Razi أبو زرعة الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38549",
      "name": "Muhammad bin 'Uthman bin Abi Safwan محمد بن عثمان بن أبي صفوان",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-muslim-247-3",
      "hadith_no": "247",
      "source": "Sahih Muslim",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا أبو كريب، وواصل بن عبد الأعلى، - واللفظ لواصل - قالا حدثنا ابن فضيل، عن أبي مالك الأشجعي، عن أبي حازم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ترد على أمتي الحوض وأنا أذود الناس عنه كما يذود الرجل إبل الرجل عن إبله ‏\"‏ ‏.‏ قالوا يا نبي الله أتعرفنا قال ‏\"‏ نعم لكم سيما ليست لأحد غيركم تردون على غرا محجلين من آثار الوضوء وليصدن عني طائفة منكم فلا يصلون فأقول يا رب هؤلاء من أصحابي فيجيبني ملك فيقول وهل تدري ما أحدثوا بعدك ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported the Messenger of Allah (may peace be upon him) said:                      My people would come to me on the Cistern and I would drive away persons (from it) just as a person drives away other people's camels from his camels. They (the hearers) said: Apostle of Allah, would you recognize us? He replied: Yea, you would have a mark which other people will not have. You would come to me with a white blaze on your foreheads and white marks on your feet because of the traces of ablution. A group among you would be prevented from coming to me, and they would not meet me, and I would say: O my Lord, they are my companions. Upon this an angel would reply to me saying: Do you know what these people did after you.",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "30481",
        "20356",
        "10766",
        "11349",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-1835",
      "hadith_no": "1835",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا واصل بن عبد الأعلى، حدثنا محمد بن فضيل، عن حصين بن عبد الرحمن، عن حبيب بن أبي ثابت، عن محمد بن علي بن عبد الله بن عباس، عن أبيه، عن عبد الله بن عباس، أنه رقد عند رسول الله صلى الله عليه وسلم فاستيقظ فتسوك وتوضأ وهو يقول ‏{‏ إن في خلق السموات والأرض واختلاف الليل والنهار لآيات لأولي الألباب‏}‏ فقرأ هؤلاء الآيات حتى ختم السورة ثم قام فصلى ركعتين فأطال فيهما القيام والركوع والسجود ثم انصرف فنام حتى نفخ ثم فعل ذلك ثلاث مرات ست ركعات كل ذلك يستاك ويتوضأ ويقرأ هؤلاء الآيات ثم أوتر بثلاث فأذن المؤذن فخرج إلى الصلاة وهو يقول ‏\"‏ اللهم اجعل في قلبي نورا وفي لساني نورا واجعل في سمعي نورا واجعل في بصري نورا واجعل من خلفي نورا ومن أمامي نورا واجعل من فوقي نورا ومن تحتي نورا ‏.‏ اللهم أعطني نورا ‏\"‏",
      "text_en": " Ibn Abbas reported:                      I spent a night in the house of my mother's sister Maimuna. The Apostle of Allah (way peace be upon him) got up for observing voluntary prayer (Tahajjud) at night. The Apostle of Allah (may peace be upon him) stood by the water-skin and performed ablution and then stood up and prayed. I also got up when I saw him doing that. I also performed ablution from the water-skin and then stood at his left side. He took hold of my hand from behind his back and then turned me from his back to his right side. I ('Ata', one of the narrators) said: Did it concern the voluntary prayer (at night)? He ('Ibn 'Abbas) said: Yes.",
      "usc_msa_ref": "",
      "chain": [
        "30481",
        "20356",
        "15097",
        "11331",
        "10961",
        "10949",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-1925",
      "hadith_no": "1925",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا واصل بن عبد الأعلى، حدثنا ابن فضيل، عن بشير أبي إسماعيل، عن أبي حازم، عن أبي هريرة، قال خرج إلينا رسول الله صلى الله عليه وسلم فقال ‏\"‏ أقرأ عليكم ثلث القرآن ‏\"‏ ‏.‏ فقرأ ‏{‏ قل هو الله أحد * الله الصمد‏}‏ حتى ختمها ‏.‏",
      "text_en": " 'A'isha reported:                      The Messenger of Allah (may peace be upon him) sent a man in charge of an expedition and he would recite for his Companions during their prayer, ending (recitation) with:\" Say, He is God, One.\" When they returned mention was made of it to the Messenger of Allah (may peace be upon him). He (the Holy Prophet) told them to ask him why he had done like that. So they asked him and he said: Verily, it is an attribute of the Compassionate One, and (for this reason) I love to recite it. The Messenger of Allah (may peace be upon him) thereupon said: Inform him that Allah loves him.",
      "usc_msa_ref": "",
      "chain": [
        "30481",
        "20356",
        "11172",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-2019",
      "hadith_no": "2019",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "وحدثنا أبو كريب، وواصل بن عبد الأعلى، قالا حدثنا ابن فضيل، عن أبي مالك، الأشجعي عن أبي حازم، عن أبي هريرة، وعن ربعي بن حراش، عن حذيفة، قالا قال رسول الله صلى الله عليه وسلم ‏\"‏ أضل الله عن الجمعة من كان قبلنا فكان لليهود يوم السبت وكان للنصارى يوم الأحد فجاء الله بنا فهدانا الله ليوم الجمعة فجعل الجمعة والسبت والأحد وكذلك هم تبع لنا يوم القيامة نحن الآخرون من أهل الدنيا والأولون يوم القيامة المقضي لهم قبل الخلائق ‏\"‏ ‏.‏ وفي رواية واصل المقضي بينهم ‏.‏",
      "text_en": " It is narrated by Abu Huraira and Huraira that the Messenger of Allah (may peace be upon him) said:                      It was Friday from which Allah diverted those who were before us. For the Jews (the day set aside for prayer) was Sabt (Saturday), and for the Christians it was Sunday. And Allah turned towards us and guided us to Friday (as the day of prayer) for us. In fact, He (Allah) made Friday, Saturday and Sunday (as days of prayer). In this order would they (Jews and Christians) come after us on the Day of Resurrection. We are the last of (the Ummahs) among the people in this world and the first among the created to be judged on the Day of Resurrection. In one narration it is: ', to be judged among them\".",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "30481",
        "20356",
        "10766",
        "11349",
        "13",
        "11334",
        "145"
      ]
    },
    {
      "id": "sahih-muslim-2388",
      "hadith_no": "2388",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثنا واصل بن عبد الأعلى، وأبو كريب ومحمد بن يزيد الرفاعي - واللفظ لواصل - قالوا حدثنا محمد بن فضيل، عن أبيه، عن أبي حازم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ تقيء الأرض أفلاذ كبدها أمثال الأسطوان من الذهب والفضة فيجيء القاتل فيقول في هذا قتلت ‏.‏ ويجيء القاطع فيقول في هذا قطعت رحمي ‏.‏ ويجيء السارق فيقول في هذا قطعت يدي ثم يدعونه فلا يأخذون منه شيئا ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenaer (may peace be upon him) as saying:                      The earth will vomit long pieces of its liver like columns of gold and silver, and the murderer will come and say: It was for this that I committed murder. The breaker of family ties will come and say: It was for this that I broke the family ties; and the thief will come and say: It is for this that my hands were cut off. They will then leave it and will not take anything out of it.",
      "usc_msa_ref": "",
      "chain": [
        "30481",
        "20356",
        "20349",
        "11172",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-2446",
      "hadith_no": "2446",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا أبو كريب، وواصل بن عبد الأعلى، قالا حدثنا ابن فضيل، عن عمارة بن، القعقاع عن أبي زرعة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من سأل الناس أموالهم تكثرا فإنما يسأل جمرا فليستقل أو ليستكثر ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      He who begs the riches of others to increase his own is asking only for live coals, so let him ask a little or much.",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "30481",
        "20356",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-4152",
      "hadith_no": "4152",
      "source": "Sahih Muslim",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا أبو كريب، وواصل بن عبد الأعلى، قالا حدثنا ابن فضيل، عن أبيه، عن ابن أبي نعم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الذهب بالذهب وزنا بوزن مثلا بمثل والفضة بالفضة وزنا بوزن مثلا بمثل فمن زاد أو استزاد فهو ربا‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported Allah's Mess-., nger (may peace be upon him) as saying:                      Gold is to be paid for by gold with equal weight, like for like, and silver is to be paid for by silver with equal weight, like for like. He who made an addition to it or demanded an addition dealt in usury.",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "30481",
        "20356",
        "20349",
        "11366",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-6227",
      "hadith_no": "6227",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا واصل بن عبد الأعلى، حدثنا محمد بن فضيل، عن إسماعيل بن أبي خالد، عن أبي جحيفة، قال رأيت رسول الله صلى الله عليه وسلم أبيض قد شاب كان الحسن بن علي يشبهه ‏.‏",
      "text_en": " Abu Juhaifa reported:                      I saw Allah's Messenger (may peace be upon him) that he had white complexion and had some white hair, and Hasan b. 'Ali resembled him.",
      "usc_msa_ref": "",
      "chain": [
        "30481",
        "20356",
        "11418",
        "4047"
      ]
    },
    {
      "id": "sahih-muslim-7481",
      "hadith_no": "7481",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا عبد الله بن عمر بن أبان، وواصل بن عبد الأعلى، وأحمد بن عمر الوكيعي، - واللفظ لابن أبان - قالوا حدثنا ابن فضيل، عن أبيه، قال سمعت سالم بن عبد الله، بن عمر يقول يا أهل العراق ما أسألكم عن الصغيرة وأركبكم للكبيرة سمعت أبي عبد الله بن عمر يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن الفتنة تجيء من ها هنا ‏\"‏ ‏.‏ وأومأ بيده نحو المشرق ‏\"‏ من حيث يطلع قرنا الشيطان ‏\"‏ ‏.‏ وأنتم يضرب بعضكم رقاب بعض وإنما قتل موسى الذي قتل من آل فرعون خطأ فقال الله عز وجل له ‏{‏ وقتلت نفسا فنجيناك من الغم وفتناك فتونا‏}‏ قال أحمد بن عمر في روايته عن سالم لم يقل سمعت ‏.‏",
      "text_en": " Ibn Fudail reported on the authority of his father that he heard Salim b. 'Abdullah b. 'Umar as saying:                      O people of Iraq, how strange it is that you ask about the minor sins but commit major sins? I heard from my father 'Abdullah b. 'Umar, narrating that he heard Allah's Messenger (may peace be upon him) as saying while pointing his hand towards the east: Verily. the turmoil would come from this side, from where appear the horns of Satan and you would strike the necks of one another; and Moses killed a person from among the people of Pharaoh unintentionally and Allah, the Exalted and Glorious, said:\" You killed a person but We relieved you from the grief and tried you with (many a) trial\" (xx. 40). Ahmad b. Umar reported this hadith from Salim, but he did not make a mention of the words:\" I heard\".",
      "usc_msa_ref": "",
      "chain": [
        "30468",
        "30481",
        "20356",
        "20349",
        "11011"
      ]
    },
    {
      "id": "sahih-muslim-7488",
      "hadith_no": "7488",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "وحدثنا عبد الله بن عمر بن أبان، وواصل بن عبد الأعلى، قالا حدثنا محمد، بن فضيل عن أبي إسماعيل الأسلمي، عن أبي حازم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ والذي نفسي بيده لا تذهب الدنيا حتى يأتي على الناس يوم لا يدري القاتل فيم قتل ولا المقتول فيم قتل ‏\"‏ ‏.‏ فقيل كيف يكون ذلك قال ‏\"‏ الهرج ‏.‏ القاتل والمقتول في النار ‏\"‏ ‏.‏ وفي رواية ابن أبان قال هو يزيد بن كيسان عن أبي إسماعيل ‏.‏ لم يذكر الأسلمي ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      The world would not come to an end until a day would come to the people on which the murderer would not know as to why he has killed and the slain would not know as to why he has been murdered. It would be said: Why would It happen? To which he replied: It would be because of general massacre and bloodshed. And the slaughterers and the slain would be in Fire, and in the narration of Ibn Aban, the name of Abu Isma'il has been mentioned.",
      "usc_msa_ref": "",
      "chain": [
        "30468",
        "30481",
        "20356",
        "11172",
        "13"
      ]
    }
  ],
  "total_hadiths": 10
}