{
  "id": "30483",
  "name": "Yahya bin Bashr bin Kathir al-Harayri يحيى بن بشر بن كثير الحريري",
  "full_name": "Yahya bin Bashr bin Kathir al-Harayri يحيى بن بشر بن كثير الحريري",
  "grade": "3rd Century AH [10th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "227",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ م  -  صدوق ]"
    ],
    "tags": [
      "al-Asadi",
      "al-Harayri",
      "al-Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "17542",
      "name": "Ma'ruf bin 'Abdullah al-Khiyat معروف بن عبد الله الخياط أبو الخطاب",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20710",
      "name": "Sa'id bin Basahyr al-Azdi سعيد بن بشير الأزدي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20638",
      "name": "Sa'id bin 'Abdul 'Aziz al-Tanuqi سعيد بن عبد العزيز التنوخي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "25041",
      "name": "Ja'far bin Ziyad al-Ahmr جعفر بن زياد الأحمر",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20733",
      "name": "al-Walid bin Muslim al-Quraishi الوليد بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "students": [
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]"
    },
    {
      "id": "30025",
      "name": "'Abdullah bin 'Abdur Rahman al-Daarimi عبد الله بن عبد الرحمن الدارمي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38383",
      "name": "'Uthman bin 'Abdullah عثمان بن عبد الله بن محمد بن خرزاذ",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1548",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا يحيى بن بشر، حدثنا شبابة، عن ورقاء، عن عمرو بن دينار، عن عكرمة، عن ابن عباس  رضى الله عنهما  قال كان أهل اليمن يحجون ولا يتزودون ويقولون نحن المتوكلون، فإذا قدموا مكة سألوا الناس، فأنزل الله تعالى ‏{‏وتزودوا فإن خير الزاد التقوى‏}‏‏.‏ رواه ابن عيينة عن عمرو عن عكرمة مرسلا‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The people of Yemen used to come for Hajj and used not to bring enough provisions with them and used to say that they depend on Allah. On their arrival in Medina they used to beg the people, and so Allah revealed, \"And take a provision (with you) for the journey, but the best provision is the fear of Allah.\" (2.197).",
      "chain": [
        "30483",
        "20426",
        "20363",
        "11081",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "3963",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا يحيى بن بشر، حدثنا روح، حدثنا عوف، عن معاوية بن قرة، قال حدثني أبو بردة بن أبي موسى الأشعري، قال قال لي عبد الله بن عمر هل تدري ما قال أبي لأبيك قال قلت لا‏.‏ قال فإن أبي قال لأبيك يا أبا موسى، هل يسرك إسلامنا مع رسول الله صلى الله عليه وسلم وهجرتنا معه، وجهادنا معه، وعملنا كله معه، برد لنا، وأن كل عمل عملناه بعده نجونا منه كفافا رأسا برأس فقال أبي لا والله، قد جاهدنا بعد رسول الله صلى الله عليه وسلم وصلينا، وصمنا، وعملنا خيرا كثيرا، وأسلم على أيدينا بشر كثير، وإنا لنرجو ذلك‏.‏ فقال أبي لكني أنا والذي نفس عمر بيده لوددت أن ذلك برد لنا، وأن كل شىء عملناه بعد نجونا منه كفافا رأسا برأس‏.‏ فقلت إن أباك والله خير من أبي‏.‏",
      "text_en": " Narrated Abu Burda Bin Abi Musa Al-Ash`ari:                     `Abdullah bin `Umar said to me, \"Do you know what my father said to your father once?\" I said, \"No.\" He said, \"My father said to your father, 'O Abu Musa, will it please you that we will be rewarded for our conversion to Islam with Allah's Apostle and our migration with him, and our Jihad with him and all our good deeds which we did, with him, and that all the deeds we did after his death will be disregarded whether good or bad?' Your father (i.e. Abu Musa) said, 'No, by Allah, we took part in Jihad after Allah's Apostle , prayed and did plenty of good deeds, and many people have embraced Islam at our hands, and no doubt, we expect rewards from Allah for these good deeds.' On that my father (i.e. `Umar) said, 'As for myself, By Him in Whose Hand `Umar's soul is, I wish that the deeds done by us at the time of the Prophet remain rewardable while whatsoever we did after the death of the Prophet be enough to save us from Punishment in that the good deeds compensate for the bad ones.' \" On that I said (to Ibn `Umar), \"By Allah, your father was better than my father!\"",
      "chain": [
        "30483",
        "20229",
        "11298",
        "11306",
        "11901"
      ]
    },
    {
      "hadith_no": "1759",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني زهير بن حرب، حدثنا حسين بن محمد، حدثنا شيبان، عن يحيى، قال سمعت أبا سلمة، ح وحدثني يحيى بن بشر الحريري، حدثنا معاوية، - يعني ابن سلام - عن يحيى بن أبي كثير، قال أخبرني أبو سلمة، أنه سأل عائشة عن صلاة، رسول الله صلى الله عليه وسلم ‏.‏ بمثله غير أن في حديثهما تسع ركعات قائما يوتر منهن ‏.‏",
      "text_en": " Abu Salama is reported to have said. I came to 'A'isha. I said:                      O mother, inform me about the prayer of the Messenger of Allah (may peace be upon him). She said: His (night prayer) in Ramadan and (during other months) was thirteen rak'ahs at night including two rak'ahs of fajr.",
      "chain": [
        "30022",
        "20384",
        "20240",
        "11449",
        "10567",
        "30483",
        "20401",
        "11449",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "2571",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثناه يحيى بن بشر الحريري، حدثنا معاوية، - يعني ابن سلام ح وحدثنا ابن المثنى، حدثنا أبو عامر، حدثنا هشام، ح وحدثنا ابن المثنى، وابن أبي عمر، قالا حدثنا عبد الوهاب بن عبد المجيد، حدثنا أيوب، ح وحدثني زهير بن حرب، حدثنا حسين بن، محمد حدثنا شيبان، كلهم عن يحيى بن أبي كثير، بهذا الإسناد نحوه ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Yahya b. Abi Kathir with the same chain of transmitters.",
      "chain": [
        "30483",
        "20401",
        "20443",
        "20295",
        "30421",
        "20259",
        "11015",
        "30022",
        "20384"
      ]
    },
    {
      "hadith_no": "2638",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا يحيى بن بشر الحريري، حدثنا معاوية، - يعني ابن سلام - عن يحيى، بن أبي كثير بهذا الإسناد مثله ‏.‏",
      "text_en": " A hadith like this has been narrated by Yahya b. Abu Kathir with the same chain of transmitters.",
      "chain": [
        "30483",
        "20401"
      ]
    },
    {
      "hadith_no": "3750",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "حدثنا يحيى بن بشر الحريري، حدثنا معاوية، - يعني ابن سلام - عن يحيى، بن أبي كثير أن يعلى بن حكيم، أخبره أن سعيد بن جبير أخبره أنه، سمع ابن عباس، قال إذا حرم الرجل عليه امرأته فهى يمين يكفرها وقال ‏{‏ لقد كان لكم في رسول الله أسوة حسنة‏}‏",
      "text_en": " Ibn Abbas (Allah be pleased with them) reported:                      When a man declares his wife unlawful for himself that is an oath which must be atoned, and he said: There is in the Messenger of Allah (may peace be upon him) a noble pattern for you.",
      "chain": [
        "30483",
        "20401",
        "11449",
        "11567",
        "11050",
        "17"
      ]
    }
  ],
  "total_hadiths": 6
}