{
  "id": "30495",
  "name": "Ahmed bin al-Hasan bin Khrash أحمد بن الحسن بن خراش",
  "full_name": "Ahmed bin al-Hasan bin Khrash أحمد بن الحسن بن خراش",
  "grade": "3rd Century AH [11th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "242",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Baghdad"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ م  ت  -  صدوق ]"
    ],
    "tags": [
      "al-Baghdadi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20426",
      "name": "Shababa bin Sawar شبابة بن سوار الفزاري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20443",
      "name": "Abu 'Amir al-'Aqdi عبد الملك بن عمرو القيسي أبو عامر العقدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20033",
      "name": "'Abdur Rahman bin Mahdi عبد الرحمن بن مهدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20250",
      "name": "'Abdul Samad bin 'Abdul Warith bin Sa'id عبد الصمد بن عبد الوارث بن سعيد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]"
    },
    {
      "id": "30005",
      "name": "Imam Tirmidhi الترمذي محمد بن عيسى بن سورة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30467",
      "name": "'Abdullah bin 'Amir عبد الله بن عامر بن زرارة الحضرمي",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-muslim-289",
      "hadith_no": "289",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن الحسن بن خراش، حدثنا عمرو بن عاصم، حدثنا معتمر، قال سمعت أبي يحدث، أن خالدا الأثبج ابن أخي، صفوان بن محرز حدث عن صفوان بن محرز، أنه حدث أن جندب بن عبد الله البجلي بعث إلى عسعس بن سلامة زمن فتنة ابن الزبير فقال اجمع لي نفرا من إخوانك حتى أحدثهم ‏.‏ فبعث رسولا إليهم فلما اجتمعوا جاء جندب وعليه برنس أصفر فقال تحدثوا بما كنتم تحدثون به ‏.‏ حتى دار الحديث فلما دار الحديث إليه حسر البرنس عن رأسه فقال إني أتيتكم ولا أريد أن أخبركم عن نبيكم إن رسول الله صلى الله عليه وسلم بعث بعثا من المسلمين إلى قوم من المشركين وإنهم التقوا فكان رجل من المشركين إذا شاء أن يقصد إلى رجل من المسلمين قصد له فقتله وإن رجلا من المسلمين قصد غفلته قال وكنا نحدث أنه أسامة بن زيد فلما رفع عليه السيف قال لا إله إلا الله ‏.‏ فقتله فجاء البشير إلى النبي صلى الله عليه وسلم فسأله فأخبره حتى أخبره خبر الرجل كيف صنع فدعاه فسأله فقال ‏\"‏ لم قتلته ‏\"‏ ‏.‏ قال يا رسول الله أوجع في المسلمين وقتل فلانا وفلانا - وسمى له نفرا - وإني حملت عليه فلما رأى السيف قال لا إله إلا الله ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ أقتلته ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ فكيف تصنع بلا إله إلا الله إذا جاءت يوم القيامة ‏\"‏ ‏.‏ قال يا رسول الله استغفر لي ‏.‏ قال ‏\"‏ وكيف تصنع بلا إله إلا الله إذا جاءت يوم القيامة ‏\"‏ ‏.‏ قال فجعل لا يزيده على أن يقول ‏\"‏ كيف تصنع بلا إله إلا الله إذا جاءت يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " It is narrated by Safwan b. Muhriz that Jundab b. 'Abdullah al-Bajali during the stormy days of Ibn Zubair sent a message to 'As'as b. Salama:                      Gather some men of your family so that I should talk to them. He ('As'as) sent a messenger to them (to the members of his family). When they had assembled, Jundab came there with a yellow hooded cloak on him, He said: Talk what you were busy in talking. The talk went on by turns, till there came his (Jundab's) turn. He took off the hooded cloak from his head and said: I have come to you with no other intention but to narrate to you a hadith of your Apostle: Verily the Messenger of Allah (may peace be upon him) sent a squad of the Muslims to a tribe of the polytheists. Both the armies confronted one another. There was a man among the army of polytheists who (was so dashing that), whenever he intended to kill a man from among the Muslims, he killed him. Amongst the Muslims too was a man looking forward to (an opportunity of) his (the polytheist's) unmindfulness. He (the narrator) said: We talked that he was Usama b, Zaid. When he raised his sword, he (the soldier of the polytheists) uttered:\" There is no god but Allah,\" but he (Usama b. Zaid) killed him. When the messenger of the glad tidings came to the Apostle (may peace be upon him) he asked him (about the events of the battle) and he informed him about the man (Usama) and what he had done He (the Prophet of Allah) called for him and asked him why he had killed him. He (Usama) said: Messenger of Allah, he struck the Muslims and killed such and such of them. And he even named some of them. (He continued): I attacked him and when he saw the sword he said: There is no god but Allah. The Messenger of Allah (may peace be upon him) said: Did you kill him? He (Usama) replied in the affirmative. He (the Holy Prophet) remarked: What would you do with:\" There is no god but Allah,\" when he would come (before you) on the Day of Judgment? He (Usama) said: Messenger of Allah, beg pardon for me (from your Lord). He (the Holy Prophet) said: What would you do with:\" There is no god but Allah\" when he would come (before you) on the Day of Judgment? He (the Holy Prophet) added nothing to it but kept saying: What would you do with:\" There is no god but Allah,\" when he would come (before you) on the Day of Judgment?",
      "usc_msa_ref": "",
      "chain": [
        "30495",
        "20267",
        "20288",
        "11289",
        "11693"
      ]
    },
    {
      "id": "sahih-muslim-265-2",
      "hadith_no": "265",
      "source": "Sahih Muslim",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثنا أحمد بن الحسن بن خراش، حدثنا عمر بن عبد الوهاب، حدثنا يزيد، - يعني ابن زريع - حدثنا روح، عن سهيل، عن القعقاع، عن أبي صالح، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا جلس أحدكم على حاجته فلا يستقبل القبلة ولا يستدبرها ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira said:                      When any one amongst you squats for answering the call of nature, he should neither turn his face towards the Qibla nor turn his back towards it.",
      "usc_msa_ref": "",
      "chain": [
        "30495",
        "20304",
        "20229",
        "11161",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-4123",
      "hadith_no": "4123",
      "source": "Sahih Muslim",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا أحمد بن الحسن بن خراش، حدثنا شبابة، حدثنا شعبة، عن حميد، قال سمعت أنسا، يقول دعا النبي صلى الله عليه وسلم غلاما لنا حجاما فحجمه فأمر له بصاع أو مد أو مدين وكلم فيه فخفف عن ضريبته ‏.‏",
      "text_en": " Humaid reported Anas (Allah be pleased with him) having said this:                      Allah's Apostle (may peace be upon him) called for young cupper belonging to us. He capped him and he (the Holy Prophet) commanded that he should be paid one sa' or one mudd or two mudds (of wheat). It was said (that charges were high) and a reduction was made in the charges.",
      "usc_msa_ref": "",
      "chain": [
        "30495",
        "20426",
        "20020",
        "11279",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-4842",
      "hadith_no": "4842",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثني أحمد بن الحسن بن خراش، حدثنا أبو معمر، حدثنا عبد الوارث، حدثنا أيوب، عن يحيى بن سعيد بن حيان، عن أبي زرعة، عن أبي هريرة، عن النبي صلى الله عليه وسلم ‏.‏ بنحو حديثهم ‏.‏",
      "text_en": " Abu Huraira has narrated this hadith similar to the above mentioned hadith.",
      "usc_msa_ref": "",
      "chain": [
        "30495",
        "30315",
        "20258",
        "11015",
        "11062",
        "11406",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-5755",
      "hadith_no": "5755",
      "source": "Sahih Muslim",
      "chapter": "The Book on General Behaviour - كتاب الآداب",
      "chapter_no": "39",
      "text_ar": "حدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن  أبي مسلمة، عن أبي نضرة، عن أبي سعيد، ح  وحدثنا أحمد بن الحسن بن خراش، حدثنا شبابة، حدثنا شعبة، عن الجريري، وسعيد بن يزيد كلاهما عن أبي نضرة، قالا سمعناه يحدث، عن أبي سعيد الخدري، ‏.‏ بمعنى حديث بشر بن مفضل عن أبي مسلمة، ‏.‏",
      "text_en": " This hadith bu been narrated on the authority of Abu Sa'id Khudri through another chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "10721",
        "38",
        "30495",
        "20426",
        "20020",
        "10721",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-6477",
      "hadith_no": "6477",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا أحمد بن الحسن بن خراش، حدثنا عمرو بن عاصم، حدثنا سليمان بن، المغيرة حدثنا ثابت، حدثني أنس بن مالك، قال مات ابن لأبي طلحة ‏.‏ واقتص الحديث بمثله ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Anas b. Malik through another chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30495",
        "20267",
        "20236",
        "11269",
        "19"
      ]
    }
  ],
  "total_hadiths": 6
}