{
  "id": "30496",
  "name": "Ibrahim bin Dinar al-Bghdady إبراهيم بن دينار البغدادي",
  "full_name": "Ibrahim bin Dinar al-Bghdady إبراهيم بن دينار البغدادي",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "232",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Baghdad"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  -  ثقة ]"
    ],
    "tags": [
      "al-Baghdadi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20468",
      "name": "Hashaym bin Bashayr bin al-Qasim هشيم بن بشير بن القاسم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]"
    },
    {
      "id": "30554",
      "name": "Abu Zara' al-Razi أبو زرعة الرازي",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-muslim-275",
      "hadith_no": "275",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا محمد بن المثنى، ومحمد بن بشار، وإبراهيم بن دينار، جميعا عن يحيى بن حماد، - قال ابن المثنى حدثني يحيى بن حماد، - أخبرنا شعبة، عن أبان بن تغلب، عن فضيل الفقيمي، عن إبراهيم النخعي، عن علقمة، عن عبد الله بن مسعود، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يدخل الجنة من كان في قلبه مثقال ذرة من كبر ‏\"‏ ‏.‏ قال رجل إن الرجل يحب أن يكون ثوبه حسنا ونعله حسنة ‏.‏ قال ‏\"‏ إن الله جميل يحب الجمال الكبر بطر الحق وغمط الناس ‏\"‏ ‏.‏",
      "text_en": " It Is narrated on the authority of Abdullah b. Mas'ud that the Apostle of Allah (may peace be upon him), observed:                      He who has in his heart the weight of a mustard seed of pride shall not enter Paradise. A person (amongst his hearers) said: Verily a person loves that his dress should be fine, and his shoes should be fine. He (the Holy Prophet) remarked: Verily, Allah is Graceful and He loves Grace. Pride is disdaining the truth (out of self-conceit) and contempt for the people.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "30160",
        "30496",
        "20574",
        "20574",
        "20020",
        "20577",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "id": "sahih-muslim-337",
      "hadith_no": "337",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثني محمد بن حاتم بن ميمون، وإبراهيم بن دينار، - واللفظ لإبراهيم - قالا حدثنا حجاج، - وهو ابن محمد - عن ابن جريج، قال أخبرني يعلى بن مسلم، أنه سمع سعيد بن جبير، يحدث عن ابن عباس، أن ناسا، من أهل الشرك قتلوا فأكثروا وزنوا فأكثروا ثم أتوا محمدا صلى الله عليه وسلم فقالوا إن الذي تقول وتدعو لحسن ولو تخبرنا أن لما عملنا كفارة فنزل ‏{‏ والذين لا يدعون مع الله إلها آخر ولا يقتلون النفس التي حرم الله إلا بالحق ولا يزنون ومن يفعل ذلك يلق أثاما‏}‏ ونزل ‏{‏ يا عبادي الذين أسرفوا على أنفسهم لا تقنطوا من رحمة الله‏{‏ ‏.‏",
      "text_en": " It is narrated on the authority of Ibn 'Abbas that some persons amongst the polytheist had committed a large number of murders and had excessively indulged in fornication. Then they came to Muhammad (may peace be upon him) and said:                      Whatever you assert and whatever you call to is indeed good. But if you inform us that there is atonement of our past deeds (then we would embrace Islam). Then it was revealed: And those who call not unto another god along with Allah and slay not any soul which Allah has forbidden except in the cause of justice, nor commit fornication; and he who does this shall meet the requital of sin. Multiplied for him shall be the torment on the Day of Resurrection, and he shall therein abide disgraced, except him who repents a believes and does good deeds. Then these! for the Allah shall change their vices into virtues. Verily Allah is Ever Forgiving, Merciful (xxv. 68-70). Say thou: O my bondsmen woo have committed extravagance against themselves despair not of the Mercy of Allah I Verily Allah will forgive the sins altogether. He is indeed the Forgiving, the Merciful (xxxix. 53).",
      "usc_msa_ref": "",
      "chain": [
        "30514",
        "30496",
        "20381",
        "11070",
        "11568",
        "11050",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-439-2",
      "hadith_no": "439",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا إبراهيم بن دينار، ومحمد بن حرب الواسطي، قالا حدثنا عمرو بن الهيثم أبو قطن، حدثنا شعبة، عن قتادة، عن خلاس، عن أبي رافع، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لو تعلمون - أو يعلمون - ما في الصف المقدم لكانت قرعة ‏\"‏ ‏.‏ وقال ابن حرب ‏\"‏ الصف الأول ما كانت إلا قرعة ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      The Messenger of Allah (may peace be upon him) said: If you were to know, or if they were to know, what (excellence) lies in the first rows, there would have been drawing of lots (for filling them) ; and Ibn Harb said: For (occupying) the first row there would have been drawing of lots.",
      "usc_msa_ref": "",
      "chain": [
        "30496",
        "30373",
        "20020",
        "11019",
        "11283",
        "479",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-2105",
      "hadith_no": "2105",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Two Eids) - كتاب صلاة العيدين",
      "chapter_no": "9",
      "text_ar": "وحدثني إبراهيم بن دينار، وعقبة بن مكرم العمي، وعبد بن حميد، كلهم عن أبي، عاصم - واللفظ لعقبة - قال حدثنا أبو عاصم، عن ابن جريج، قال أخبرني عطاء، أخبرني عبيد بن عمير، أخبرتني عائشة، أنها قالت للعابين وددت أني أراهم قالت فقام رسول الله صلى الله عليه وسلم وقمت على الباب أنظر بين أذنيه وعاتقه وهم يلعبون في المسجد ‏.‏ قال عطاء فرس أو حبش ‏.‏ قال وقال لي ابن عتيق بل حبش ‏.‏",
      "text_en": " 'A'isha said that she sent a message to the players (of this armed fight) saying:                      I like to see them (fighting). She further said: The Messenger of Allah (may peace be upon him) stood up and I stood at the door (behind him) and saw (this fight) between his ears and his shoulders they played in the mosque. 'Ata' (one of the narra- tors) said: Were they persians or Abyssinians? Ibn 'Atiq told me they were Abyssinians.",
      "usc_msa_ref": "",
      "chain": [
        "30496",
        "30441",
        "30553",
        "20241",
        "11070",
        "11029",
        "11259",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-3070",
      "hadith_no": "3070",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثناه إبراهيم بن دينار، حدثنا روح، ح وحدثنا أبو داود المباركي، حدثنا أبو شهاب، ح وحدثنا محمد بن المثنى، حدثنا يحيى بن كثير، كلهم عن شعبة، في هذا الإسناد أما روح ويحيى بن كثير فقالا كما قال نصر أهل رسول الله صلى الله عليه وسلم بالحج ‏.‏ وأما أبو شهاب ففي روايته خرجنا مع رسول الله صلى الله عليه وسلم نهل بالحج ‏.‏ وفي حديثهم جميعا فصلى الصبح بالبطحاء ‏.‏ خلا الجهضمي فإنه لم يقله ‏.‏",
      "text_en": " Rauh and Yahya b. Kathir narrated as Nasr reported that the Messenger of Allah (may peace be upon him) entered into the state of Ihram for Hajj. And in the narration of Abu Shihab (the words are):                      We went out with the Messenger of Allah (may peace be upon him) pronouncing Talbiya for Hajj, And in an the ahadith (narrated in this connection the words are): He led the morning prayer at al-Batha', except al- jahdami who did not make mention of it.",
      "usc_msa_ref": "",
      "chain": [
        "30496",
        "20229",
        "30544",
        "11613",
        "30170",
        "20302"
      ]
    },
    {
      "id": "sahih-muslim-3424",
      "hadith_no": "3424",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثني محمد بن حاتم، وإبراهيم بن دينار، قالا حدثنا حجاج بن محمد، ح وحدثني محمد بن رافع، حدثنا عبد الرزاق، كلاهما عن ابن جريج، أخبرني عبد الله بن عبد الرحمن، بن يحنس عن أبي عبد الله القراظ، أنه قال أشهد على أبي هريرة أنه قال قال أبو القاسم صلى الله عليه وسلم ‏\"‏ من أراد أهل هذه البلدة بسوء - يعني المدينة - أذابه الله كما يذوب الملح في الماء ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported that Abu'I-Qasim (Mubammad, may peace be upon him) said:                      He who intends to do harm to the people of this city (that is, Medina). Allah would efface him as salt is dissolved in water.",
      "usc_msa_ref": "",
      "chain": [
        "38487",
        "30496",
        "20381",
        "30375",
        "11070",
        "10663",
        "11846"
      ]
    },
    {
      "id": "sahih-muslim-3425",
      "hadith_no": "3425",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني محمد بن حاتم، وإبراهيم بن دينار، قالا حدثنا حجاج، ح وحدثنيه محمد، بن رافع حدثنا عبد الرزاق، جميعا عن ابن جريج، قال أخبرني عمرو بن يحيى بن عمارة، أنه سمع القراظ، - وكان من أصحاب أبي هريرة - يزعم أنه سمع أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ من أراد أهلها بسوء - يريد المدينة - أذابه الله كما يذوب الملح في الماء ‏\"‏ ‏.‏ قال ابن حاتم في حديث ابن يحنس بدل قوله بسوء شرا‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      He who intends to do harm to its people (he meant Medina), Allah would efface him as salt is dissolved in water. Ibn Hatim (one of the narrators) substituted the word\" harm\" for\" mischief\".",
      "usc_msa_ref": "",
      "chain": [
        "38487",
        "30496",
        "20219",
        "11070",
        "11210",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-4018",
      "hadith_no": "4018",
      "source": "Sahih Muslim",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا سفيان، ح وحدثني علي بن حجر، وإبراهيم، بن دينار قالا حدثنا إسماعيل، - وهو ابن علية - عن أيوب، ح وحدثنا إسحاق بن إبراهيم، أخبرنا وكيع، حدثنا سفيان، كلهم عن عمرو بن دينار، بهذا الإسناد ‏.‏ مثله وزاد في حديث ابن عيينة فتركناه من أجله ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Amr b. Dinar with the same chain of transmitters but (in) the hadith transmitted on the authority of 'Uyainah (the words are):                     \" We abandoned it (renting) on account of that.\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20005",
        "20387",
        "30496",
        "20208",
        "11015",
        "30123",
        "20032"
      ]
    },
    {
      "id": "sahih-muslim-4063",
      "hadith_no": "4063",
      "source": "Sahih Muslim",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا بشر بن الحكم، وإبراهيم بن دينار، وعبد الجبار بن العلاء، - واللفظ لبشر - قالوا حدثنا سفيان بن عيينة، عن حميد الأعرج، عن سليمان بن عتيق، عن جابر، أنوسلم أمر بوضع الجوائح ‏.‏ قال أبو إسحاق - وهو صاحب مسلم - حدثنا عبد الرحمن بن بشر عن سفيان بهذا ‏.‏",
      "text_en": " Jabir (Allah be pleased with him) reported that Allah's Apostle (may peace be upon him) commanded to make deductions in the payment of that stricken with a Calamity.",
      "usc_msa_ref": "",
      "chain": [
        "30316",
        "30496",
        "30419",
        "20005",
        "11856",
        "30356"
      ]
    },
    {
      "id": "sahih-muslim-4917",
      "hadith_no": "4917",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثني إبراهيم بن دينار، حدثنا حجاج بن محمد الأعور، مولى سليمان بن مجالد قال قال ابن جريج وأخبرني أبو الزبير، أنه سمع جابرا، يسأل هل بايع النبي صلى الله عليه وسلم بذي الحليفة فقال لا ولكن صلى بها ولم يبايع عند شجرة إلا الشجرة التي بالحديبية ‏.‏ قال ابن جريج وأخبرني أبو الزبير أنه سمع جابر بن عبد الله يقول دعا النبي صلى الله عليه وسلم على بئر الحديبية ‏.‏",
      "text_en": " It has been narrated (through a different chain of transmitters) on the authority of Abu Zubair who heard Jabir being questioned as to whether the Holy Prophet (may peace be upon him) took the oath of fealty at Dhu'l-Hulaifa. He said:                      No! But he offered his prayers at that place, and he administered the oath of fealty nowhere except near the tree in (the plain oo Hudaibiya. Ibn Juraij said that he was informed by Abu Zabair who heard Jabir b. Abdullah say: The Holy Prophet (may peace be upon him) prayed over the well at Hudaibiya (as a result of which its scanty water rose up and increased so as to be sufficient for the 1400 or 1500 men who had encamped at the place).",
      "usc_msa_ref": "",
      "chain": [
        "30496",
        "20381",
        "11070",
        "11263"
      ]
    },
    {
      "id": "sahih-muslim-5361",
      "hadith_no": "5361",
      "source": "Sahih Muslim",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثني إبراهيم بن دينار، حدثنا روح بن عبادة، حدثنا ابن جريج، وزكرياء، بن إسحاق قالا أخبرنا أبو الزبير، أنه سمع جابر بن عبد الله، يقول أخبرني أبو حميد، الساعدي أنه أتى النبي صلى الله عليه وسلم بقدح لبن ‏.‏ بمثله ‏.‏ قال ولم يذكر زكرياء قول أبي حميد بالليل ‏.‏",
      "text_en": " Abu Humaid Sa'idi reported through another chain of transmitters that he brought to Allah's Messenger (may peace be upon him) a cup containing milk, but there is no mention of the word\" in the night",
      "usc_msa_ref": "",
      "chain": [
        "30496",
        "20229",
        "11070",
        "11244",
        "11263",
        "34",
        "1457"
      ]
    },
    {
      "id": "sahih-muslim-6912",
      "hadith_no": "6912",
      "source": "Sahih Muslim",
      "chapter": "The Book of Destiny - كتاب القدر",
      "chapter_no": "47",
      "text_ar": "حدثني محمد بن حاتم، وإبراهيم بن دينار، وابن أبي عمر المكي، وأحمد بن عبدة، الضبي جميعا عن ابن عيينة، - واللفظ لابن حاتم وابن دينار - قالا حدثنا سفيان بن، عيينة عن عمرو، عن طاوس، قال سمعت أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ احتج آدم وموسى فقال موسى يا آدم أنت أبونا خيبتنا وأخرجتنا من الجنة فقال له آدم أنت موسى اصطفاك الله بكلامه وخط لك بيده أتلومني على أمر قدره الله على قبل أن يخلقني بأربعين سنة ‏\"‏ ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ فحج آدم موسى فحج آدم موسى ‏\"‏ ‏.‏ وفي حديث ابن أبي عمر وابن عبدة قال أحدهما خط ‏.‏ وقال الآخر كتب لك التوراة بيده ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (way peace be upon him) as saying:                      There was argument between Adam and Moses. Moses said to Adam: You are our father. You did us harm and caused us to get out of Paradise. Adam said to him: You are Moses. Allah selected you (for direct conversation with you) and wrote with His own Hand the Book (Torah) for you. Despite this you blame me for an act which Allah had ordained for me forty years before He created me. Allah's Apostle (may peace be upon him) said:. This is how Adam came the better of Moses and Adam came the better of Moses.",
      "usc_msa_ref": "",
      "chain": [
        "38487",
        "30496",
        "30421",
        "30423",
        "20005",
        "11081",
        "11053",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-7078",
      "hadith_no": "7078",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا إبراهيم بن دينار، حدثنا أبو قطن، عمرو بن الهيثم القطعي عن عبد العزيز، بن عبد الله بن أبي سلمة الماجشون عن قدامة بن موسى، عن أبي صالح السمان، عن  أبي هريرة، قال كان رسول الله صلى الله عليه وسلم يقول ‏\"‏ اللهم أصلح لي ديني الذي هو عصمة أمري وأصلح لي دنياى التي فيها معاشي وأصلح لي آخرتي التي فيها معادي واجعل الحياة زيادة لي في كل خير واجعل الموت راحة لي من كل شر ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported that Allah's Messenger (may peace be upon him) used to supplicate (in these words):                     \" O Allah, set right for me my religion which is the safeguard of my affairs. And set right for me the affairs of my world wherein is my living. And set right for me my Hereafter on which depends my after-life. And make the life for me (a source) of abundance for every good and make my death a source of comfort for me protecting me against every evil.\"",
      "usc_msa_ref": "",
      "chain": [
        "30496",
        "10610",
        "11161",
        "13"
      ]
    }
  ],
  "total_hadiths": 13
}