{
  "id": "30493",
  "name": "Yonus bin 'Abdul A'la al-Sadfi يونس بن عبد الأعلى بن ميسرة الصدفي",
  "full_name": "Yonus bin 'Abdul A'la al-Sadfi يونس بن عبد الأعلى بن ميسرة الصدفي",
  "grade": "3rd Century AH [10th generation]",
  "biography": {
    "birth": {
      "date_hijri": "170",
      "date_gregorian": "NA",
      "date_display": [
        "170 AH"
      ],
      "place": ""
    },
    "death": {
      "date_hijri": "264",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Egypt"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  س  ق  -  ثقة ]",
      "Recitation/Quran"
    ],
    "tags": [
      "al-Sadfi",
      "al-Masri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20733",
      "name": "al-Walid bin Muslim al-Quraishi الوليد بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20029",
      "name": "'Abdullah bin Wahb عبد الله بن وهب بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20157",
      "name": "Abu Damra, Anas bin 'Ayyad أنس بن عياض الليثي - أبو ضمرة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20002",
      "name": "Imam Shafi'ee ابو عبد الله محمد بن إدريس الشافعي",
      "grade": "Succ. (Taba' Tabi') [9th generation] [Shafi'ee]"
    },
    {
      "id": "36012",
      "name": "Ashhb bin 'Abdul 'Aziz أشهب بن عبد العزيز بن داود",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30112",
      "name": "Ma'n bin 'Isa bin Yahya معن بن عيسى بن يحيى",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30411",
      "name": "'Abdullah bin Nafi' al-Sa'agh عبد الله بن نافع الصائغ المخزومي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20300",
      "name": "Yahya bin Hsan يحيى بن حسان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]"
    },
    {
      "id": "30006",
      "name": "Imam Nasa'i أحمد بن شعيب بن علي بن سنان النسائي",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30004",
      "name": "Ibn Maja ابن ماجة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30554",
      "name": "Abu Zara' al-Razi أبو زرعة الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "20469",
      "name": "Wadah bin 'Abdullah al-Yashkari وضاح بن عبد الله اليشكري أبو عوانة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "232",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثني أبو الطاهر، ويونس بن عبد الأعلى، قالا أخبرنا عبد الله بن وهب، عن عمرو بن الحارث، أن الحكيم بن عبد الله القرشي، حدثه أن نافع بن جبير وعبد الله بن أبي سلمة حدثاه أن معاذ بن عبد الرحمن حدثهما عن حمران، مولى عثمان بن عفان عن عثمان بن عفان، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من توضأ للصلاة فأسبغ الوضوء ثم مشى إلى الصلاة المكتوبة فصلاها مع الناس أو مع الجماعة أو في المسجد غفر الله له ذنوبه ‏\"‏ ‏.‏",
      "text_en": " Humran, the freed slave of 'Uthman b. 'Affan, reported on the authority of 'Uthman b. 'Affan that he heard Allah's Messenger (may peace be upon him) say:                      He who performed ablution for prayer and performed it properly and then went (to observe) obligatory prayer and offered it along with people or with the congregation or in the mosque, Allah would pardon his sins.",
      "chain": [
        "30485",
        "30493",
        "20029",
        "20377",
        "11059",
        "10929",
        "11421",
        "4"
      ]
    },
    {
      "hadith_no": "244",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا يونس بن عبد الأعلى، قال حدثنا أشهب، عن مالك، أن ابن شهاب، وهشام بن عروة، حدثاه عن عروة، عن عائشة، - رضى الله عنها - قالت خرجنا مع رسول الله صلى الله عليه وسلم عام حجة الوداع فأهللت بالعمرة فقدمت مكة وأنا حائض فلم أطف بالبيت ولا بين الصفا والمروة فشكوت ذلك إلى رسول الله صلى الله عليه وسلم فقال ‏\"‏ انقضي رأسك وامتشطي وأهلي بالحج ودعي العمرة ‏\"‏ ‏.‏ ففعلت فلما قضينا الحج أرسلني مع عبد الرحمن بن أبي بكر إلى التنعيم فاعتمرت فقال ‏\"‏ هذه مكان عمرتك ‏\"‏ ‏.‏ قال أبو عبد الرحمن هذا حديث غريب من حديث مالك عن هشام بن عروة لم يروه أحد إلا أشهب ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                      \"We went out with the Messenger of Allah (ﷺ) in the year of the Farewell Pilgrimage. I (said the Talbiyah) for 'Umrah and I arrived in Makkah while I was menstruating, so I did not perform Tawaf around the House nor between As-Safa and Al-Marwah. I complained about that to the Messenger of Allah (ﷺ), and he said: 'Undo your braids and comb your hair, and enter (begin the Talbiyah) for Hajj, and leave the 'Umrah.' So I did that, and then when we had completed Hajj, he sent me with 'Abdur-Rahman bin Abi Bakr to At-Tan'im, and I performed 'Umrah. He said: 'This is in place of your 'Umrah.'\"Abu 'Abdur-Rahman said: This Hadith is Gharib as a narration of Malik from Hisham, from 'Urwah. No one except Asshab reported it.",
      "chain": [
        "30493",
        "36012",
        "20001",
        "11013",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "449",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Salah - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "أخبرنا يونس بن عبد الأعلى، قال حدثنا ابن وهب، قال أخبرني يونس، عن ابن شهاب، قال أنس بن مالك وابن حزم قال رسول الله صلى الله عليه وسلم ‏\"‏ فرض الله عز وجل على أمتي خمسين صلاة فرجعت بذلك حتى أمر بموسى عليه السلام فقال ما فرض ربك على أمتك قلت فرض عليهم خمسين صلاة ‏.‏ قال لي موسى فراجع ربك عز وجل فإن أمتك لا تطيق ذلك ‏.‏ فراجعت ربي عز وجل فوضع شطرها فرجعت إلى موسى فأخبرته فقال راجع ربك فإن أمتك لا تطيق ذلك ‏.‏ فراجعت ربي عز وجل فقال هي خمس وهي خمسون لا يبدل القول لدى ‏.‏ فرجعت إلى موسى فقال راجع ربك فقلت قد استحييت من ربي عز وجل ‏\"‏ ‏.‏",
      "text_en": " Anas bin Malik and Ibn Hazm said:                      \"The Messenger of Allah (ﷺ) said: 'Allah, the Mighty and Sublime, enjoined fifty prayers upon my Ummah, and I came back with that until I passed by Musa, peace be upon him, who said: 'What has your Lord enjoined upon your Ummah?' I said: 'He has enjoined fifty prayers on them.' Musa said to me: 'Go back to your Lord, the Mighty and Sublime, for your Ummah will not be able to do that.' So I went back to my Lord, the Mighty and Sublime, and He reduced a portion of it. Then I came back to Musa and told him, and he said: 'Go back to you Lord, for your Ummah will not be able to do that.' So I went back to my Lord, the Mighty and Sublime, and He said: 'They are five (prayers) but they are fifty (in reward), and the Word that comes from Me cannot be changed.' [1] I came back to Musa and he said: 'Go back to your Lord.' I said: 'I feel too shy before my Lord, the Mighty and Sublime.'\"[1]See Surah Qaf 50:29.",
      "chain": [
        "30493",
        "20029",
        "20475",
        "11013",
        "19"
      ]
    },
    {
      "hadith_no": "938",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا يونس بن عبد الأعلى، قال حدثنا ابن وهب، قال أخبرني يونس، عن ابن شهاب، قال أخبرني عروة بن الزبير، أن المسور بن مخرمة، وعبد الرحمن بن عبد القاري، أخبراه أنهما، سمعا عمر بن الخطاب، يقول سمعت هشام بن حكيم، يقرأ سورة الفرقان في حياة رسول الله صلى الله عليه وسلم فاستمعت لقراءته فإذا هو يقرؤها على حروف كثيرة لم يقرئنيها رسول الله صلى الله عليه وسلم فكدت أساوره في الصلاة فتصبرت حتى سلم فلما سلم لببته بردائه فقلت من أقرأك هذه السورة التي سمعتك تقرؤها فقال أقرأنيها رسول الله صلى الله عليه وسلم ‏.‏ فقلت كذبت ‏.‏ فوالله إن رسول الله صلى الله عليه وسلم هو أقرأني هذه السورة التي سمعتك تقرؤها فانطلقت به أقوده إلى رسول الله صلى الله عليه وسلم فقلت يا رسول الله إني سمعت هذا يقرأ سورة الفرقان على حروف لم تقرئنيها وأنت أقرأتني سورة الفرقان ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أرسله يا عمر اقرأ يا هشام ‏\"‏ ‏.‏ فقرأ عليه القراءة التي سمعته يقرؤها قال رسول الله صلى الله عليه وسلم ‏\"‏ هكذا أنزلت ‏\"‏ ‏.‏ ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ اقرأ يا عمر ‏\"‏ ‏.‏ فقرأت القراءة التي أقرأني قال رسول الله صلى الله عليه وسلم ‏\"‏ هكذا أنزلت ‏\"‏ ‏.‏ ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ إن هذا القرآن أنزل على سبعة أحرف ‏{‏ فاقرءوا ما تيسر منه ‏}‏ ‏\"‏ ‏.‏",
      "text_en": " Urwah bin Az-Zubair narrated that Al-Miswar bin Makhramah and AbdurRahman bin Abdul-Qari told him that:                     They heard Umar bin Al-Khattab say: \"I heard Hisham bin Hakim bin Hizam reciting Surat Al-Furqan during the lifetime of the Messenger of Allah (ﷺ), so I listened to his recitation and he was reciting it in a way that the Messenger of Allah (ﷺ) had not taught me. I was about to jump on him while he was praying, but I waited patiently until he said the Salam (at the end of the prayer). When he had said the Salam I grabbed him by his garment and said: 'Who taught you this Surah that I heard you reciting?' He said: 'The Messenger of Allah (ﷺ) taught me it. I said: 'You are lying, by Allah! The Messenger of Allah (ﷺ) is the one who taught me this Surah that I heard you reciting.' I took him to the Messenger of Allah (ﷺ) and said: 'O Messenger of Allah, I heard this man reciting Surat Al-Furqan in a way that you did not teach me, but you taught me Surat Al-Furqan.' The Messenger of Allah (ﷺ) said:' Let him go, O Umar. Recite, O Hisham.' So I recited it to him in the way that I had heard him recite. The Messenger of Allah (ﷺ) said: 'It was revealed like this.' Then the Messenger of Allah (ﷺ) said: 'Recite, O Umar.' So I recited it in the way that he had taught me. The Messenger of Allah (ﷺ) said: 'It was revealed like this.' Then the Messenger of Allah (ﷺ) said: 'This Quran has been revealed to be recited in seven different modes, so recite as much of the Quran as may be easy for you.'\"",
      "chain": [
        "30493",
        "20029",
        "20475",
        "11013",
        "10511",
        "2201",
        "3"
      ]
    },
    {
      "hadith_no": "1096",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا أحمد بن عمرو بن السرح، ويونس بن عبد الأعلى، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن وهب، عن ابن جريج، عن عبد الله بن طاوس، عن أبيه، عن ابن عباس، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أمرت أن أسجد على سبعة - لا أكف الشعر ولا الثياب - الجبهة والأنف واليدين والركبتين والقدمين ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that :                     The Messenger of Allah (ﷺ) said: \"I have been commanded to prostrate on seven, and not to tuck up my hair nor my garment: the forehead, the nose, the hands, the knees and the feet.\"",
      "chain": [
        "30485",
        "30493",
        "36017",
        "20029",
        "11070",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "1303",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا يونس بن عبد الأعلى، قال حدثنا ابن وهب، قال سمعت حيوة، يحدث عن عقبة بن مسلم، عن أبي عبد الرحمن الحبلي، عن الصنابحي، عن معاذ بن جبل، قال أخذ بيدي رسول الله صلى الله عليه وسلم فقال ‏\"‏ إني لأحبك يا معاذ ‏\"‏ ‏.‏ فقلت وأنا أحبك يا رسول الله ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ فلا تدع أن تقول في كل صلاة رب أعني على ذكرك وشكرك وحسن عبادتك ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Mu'adhbin Jabal said:                     \"The Messenger of Allah (ﷺ) took my hand and said: 'I love you, O Mu'adh!' I said: 'And I love you, O Messenger of Allah (ﷺ).' Then the Messenger of Allah (ﷺ) said: 'Never forget to say in every prayer: Rabbi a'inni 'ala dhikrika wa shukrika wa husni 'ibadatik (My Lord, help me to remember You, give thanks to You and worship You well.)\"",
      "chain": [
        "30493",
        "20029",
        "26010",
        "16076",
        "10938",
        "5144",
        "32"
      ]
    },
    {
      "hadith_no": "1832",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا يونس بن عبد الأعلى، قال أنبأنا ابن وهب، قال أخبرني حيى بن عبد الله، عن أبي عبد الرحمن الحبلي، عن عبد الله بن عمرو، قال مات رجل بالمدينة ممن ولد بها فصلى عليه رسول الله صلى الله عليه وسلم ثم قال ‏\"‏ يا ليته مات بغير مولده ‏\"‏ ‏.‏ قالوا ولم ذاك يا رسول الله قال ‏\"‏ إن الرجل إذا مات بغير مولده قيس له من مولده إلى منقطع أثره في الجنة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin 'Amr said:                     \"A man who had been born in Al-Madinah died there, and the Messenger of Allah prayed for him, then he said: 'Would that he had died somewhere other than the place where he was born.' They said: 'Why is that, O Messenger of Allah?' He said: If a man dies somewhere other than the place where he was born, a space in him equal to the distance between the place where he was born and the place where he died.\"",
      "chain": [
        "30493",
        "20029",
        "10938",
        "29"
      ]
    },
    {
      "hadith_no": "1847",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا يونس بن عبد الأعلى، قال حدثنا عبد الله بن وهب، قال قال معاوية بن صالح وحدثني يحيى بن سعيد، عن عمرة، عن عائشة، قالت لما أتى نعى زيد بن حارثة وجعفر بن أبي طالب وعبد الله بن رواحة جلس رسول الله صلى الله عليه وسلم يعرف فيه الحزن وأنا أنظر من صئر الباب فجاءه رجل فقال إن نساء جعفر يبكين ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ انطلق فانههن ‏\"‏ ‏.‏ فانطلق ثم جاء فقال قد نهيتهن فأبين أن ينتهين ‏.‏ فقال ‏\"‏ انطلق فانههن ‏\"‏ ‏.‏ فانطلق ثم جاء فقال قد نهيتهن فأبين أن ينتهين ‏.‏ قال ‏\"‏ فانطلق فاحث في أفواههن التراب ‏\"‏ ‏.‏ فقالت عائشة فقلت أرغم الله أنف الأبعد إنك والله ما تركت رسول الله صلى الله عليه وسلم وما أنت بفاعل ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     'When news of the death of Zaid bin Harithah, Ja'far bin Abi Talib and 'Abdullah bin Rawahah was announced, the Messenger of Allah sat down and it could be seen that he was grieving. I was looking through a crack in the door, and a man came and said: 'Ja'far's womenfolk are weeping.' The Messenger of Allah said: 'Go and prevent them.' He went away, then he came back, and said: I told them not to do that, but they refused to stop; He said: Go and prevent them; He went away then he came back, and said: I told them not to do that, but they refused to stop. He said: 'Throw dust in their mouths.'\" Aishah said: \"I said: 'May Allah rub his nose in the dust, the one who is over there! You did not leave the Messenger of Allah alone but you were not going to do (what he told you to do).\"\"",
      "chain": [
        "30493",
        "20029",
        "20675",
        "11062",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "1963",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا يونس بن عبد الأعلى، قال أنبأنا ابن وهب، قال أخبرني يونس، وابن أبي ذئب، عن ابن شهاب، عن أبي سلمة، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم كان إذا توفي المؤمن وعليه دين سأل ‏\"‏ هل ترك لدينه من قضاء ‏\"‏ ‏.‏ فإن قالوا نعم صلى عليه وإن قالوا لا قال ‏\"‏ صلوا على صاحبكم ‏\"‏ ‏.‏ فلما فتح الله عز وجل على رسوله صلى الله عليه وسلم قال ‏\"‏ أنا أولى بالمؤمنين من أنفسهم فمن توفي وعليه دين فعلى قضاؤه ومن ترك مالا فهو لورثته ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     if a believer died with debts outstanding, the Messenger of Allah would ask whether he had left behind anything to pay off his debts. If they said yes, he would pray for him, but if they said no, he would say: \"Pray for your companion.\" Then, when Allah made His Messenger rich through conquest, he said: \"I am closer to the believers than their own selves. Whoever dies and leaves behind a debt, I will pay it, and whoever leavers behind wealth, it is for his heirs.\"",
      "chain": [
        "30493",
        "20029",
        "20475",
        "20177",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1969",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا يونس بن عبد الأعلى، قال أنبأنا ابن وهب، قال حدثني يونس، عن ابن شهاب، قال أخبرني أبو أمامة بن سهل بن حنيف، أنه قال اشتكت امرأة بالعوالي مسكينة فكان النبي صلى الله عليه وسلم يسألهم عنها وقال ‏\"‏ إن ماتت فلا تدفنوها حتى أصلي عليها ‏\"‏ ‏.‏ فتوفيت فجاءوا بها إلى المدينة بعد العتمة فوجدوا رسول الله صلى الله عليه وسلم قد نام فكرهوا أن يوقظوه فصلوا عليها ودفنوها ببقيع الغرقد فلما أصبح رسول الله صلى الله عليه وسلم جاءوا فسألهم عنها فقالوا قد دفنت يا رسول الله وقد جئناك فوجدناك نائما فكرهنا أن نوقظك ‏.‏ قال ‏\"‏ فانطلقوا ‏\"‏ ‏.‏ فانطلق يمشي ومشوا معه حتى أروه قبرها فقام رسول الله صلى الله عليه وسلم وصفوا وراءه فصلى عليها وكبر أربعا ‏.‏",
      "text_en": " Abu Umamah bin Sahl bin Hunaif said:                     \"A poor woman in Al-Awali fell sick and the Prophet used to ask them about her. He said: 'If she dies, do not bury her until I have offered the funeral prayer for her. She died and they brought her to Al-Madinah after dark, and they found that the Messenger of Allah had gone to sleep. They did not like to wake him up, so they offered the funeral prayer for her and buried her in Baqi' Al-Gharqab. The next morning they came and the Messenger of Allah asked them about her. They said: 'She has been buried, O Messenger of Allah. We came to you and found you sleeping, and we did not like to wake you up.' He said: 'let's go.' He set out walking and they went with him and showed him her grave. The Messenger of Allah stood and they formed rows behind him, and he offered the funeral prayer for her, saying the Takbir four times.\"",
      "chain": [
        "30493",
        "20029",
        "20475",
        "11013",
        "405"
      ]
    },
    {
      "hadith_no": "2244",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا يونس بن عبد الأعلى، قال أخبرني أنس، عن سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ من صام يوما في سبيل الله عز وجل زحزح الله وجهه عن النار بذلك اليوم سبعين خريفا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah said:                     \"Whoever fasts one day in  the cause of Allah, the Mighty and sublime, Allah will remove his face away from the fire in return for the day (the distance of) seventy autumns.",
      "chain": [
        "30493",
        "19",
        "11173",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "2492",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا يونس بن عبد الأعلى، والحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن وهب، قال حدثني عبد الجليل بن حميد اليحصبي، أن ابن شهاب، حدثه قال حدثني أبو أمامة بن سهل بن حنيف، في الآية التي قال الله عز وجل ‏{‏ ولا تيمموا الخبيث منه تنفقون ‏}‏ قال هو الجعرور ولون حبيق فنهى رسول الله صلى الله عليه وسلم أن تؤخذ في الصدقة الرذالة ‏.‏",
      "text_en": " Abu Umamah bin Sahl bin Hunaif said:                     concerning the Verse in which Allah, the Mighty and Subline, says: And do not aim at that which is bad to spend from it.\" [2] This refers to had quality dates. The Messenger of Allah forbade taking bad quality dates as Sadaqah.",
      "chain": [
        "30493",
        "36017",
        "20029",
        "26024",
        "11013"
      ]
    },
    {
      "hadith_no": "2496",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا يونس بن عبد الأعلى، قال حدثنا ابن وهب، قال أخبرني يونس، عن ابن شهاب، عن سعيد، وعبيد الله بن عبد الله، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " It was narrated from Abu Hurairah:                     A similar report was narrated from Abu Hurairah from the Messenger of Allah.",
      "chain": [
        "30493",
        "20029",
        "20475",
        "11013",
        "11168",
        "11004",
        "13"
      ]
    },
    {
      "hadith_no": "2888",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا يونس بن عبد الأعلى، قال أنبأنا ابن وهب، قال أخبرني يونس، عن ابن شهاب، عن عروة، أن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ خمس من الدواب كلها فاسق يقتلن في الحرم الغراب والحدأة والكلب العقور والفأرة والعقرب ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Urwah that Aishah said:                     \"The Messenger of Allah said: \"There are five animals all of which are vermin and may be killed inside the sanctuary: Crow, kites, vicious dogs, mice and scorpions.'\"",
      "chain": [
        "30493",
        "20029",
        "20475",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2954",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا يونس بن عبد الأعلى، وسليمان بن داود، عن ابن وهب، قال أخبرني يونس، عن ابن شهاب، عن عبيد الله بن عبد الله، عن عبد الله بن عباس، أن رسول الله صلى الله عليه وسلم طاف في حجة الوداع على بعير يستلم الركن بمحجن ‏.‏",
      "text_en": " It was narrated from Abdullah bin Abbas that:                     the Messenger of Allah circumambulated (the Kabah) during the Farewell Pilgrimage on a camel, touching the Corner with a crook-ended stick.",
      "chain": [
        "30493",
        "30584",
        "20029",
        "20475",
        "11013",
        "11004",
        "17"
      ]
    },
    {
      "hadith_no": "3005",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا يونس بن عبد الأعلى، قال أخبرني أشهب، قال أخبرني مالك، أن ابن شهاب، حدثه عن سالم بن عبد الله، قال كتب عبد الملك بن مروان إلى الحجاج بن يوسف يأمره أن لا، يخالف ابن عمر في أمر الحج فلما كان يوم عرفة جاءه ابن عمر حين زالت الشمس وأنا معه فصاح عند سرادقه أين هذا فخرج إليه الحجاج وعليه ملحفة معصفرة فقال له ما لك يا أبا عبد الرحمن قال الرواح إن كنت تريد السنة ‏.‏ فقال له هذه الساعة فقال له نعم ‏.‏ فقال أفيض على ماء ثم أخرج إليك ‏.‏ فانتظره حتى خرج فسار بيني وبين أبي فقلت إن كنت تريد أن تصيب السنة فاقصر الخطبة وعجل الوقوف ‏.‏ فجعل ينظر إلى ابن عمر كيما يسمع ذلك منه فلما رأى ذلك ابن عمر قال صدق ‏.‏",
      "text_en": " It was narrated that Salim Bin Abdullah said:                     \"Abdul Malik bin Marwan wrote to Al-Hajjaj bin Yusuf telling him not to go against Ibn Umar with regard to the Hajj. On the day of Arafat, Ibn Umar came to him when the sun had passed its zenith, and I was with him, and shouted near his cotton tent: 'Where is he?' Al-Hajjaj came out to him, wearing a wrap dyed with safflower. He said: 'What is the matter, O Abu Abdur Rahman?' He said: 'We have to move on if you want to follow Sunnah.' He said to him: 'At this hour?' He said: 'Yes.' He said: 'I will pour some water over my self (have a bath) then I will come out to you.' So he waited until he came, then he walked between my father and me, I said: 'If you want to follow the Sunnah, then deliver a short Khutbah and hasten to stand (in Arafat).' He started to look at Ibn Umar so that he could hear that, and when Ibn Umar noticed that he said: 'He is speaking the truth.'\"",
      "chain": [
        "30493",
        "36012",
        "20001",
        "11013",
        "11011"
      ]
    },
    {
      "hadith_no": "3090",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا يونس بن عبد الأعلى، والحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن وهب، قال أخبرني يونس، عن ابن شهاب، قال حدثني سعيد بن المسيب، أن أبا هريرة، أخبره أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أمرت أن أقاتل الناس حتى يقولوا لا إله إلا الله فمن قال لا إله إلا الله عصم مني ماله ونفسه إلا بحقه وحسابه على الله ‏\"‏ ‏.‏",
      "text_en": " Narrated Sa'eed bin Al-Musayyab narrated that:                     Abu Hurairah told him that the Messenger of Allah said: “I have been commanded to fight the people until they say La ilaha illallah (there is none worthy of worship except Allah). Whoever says La ilaha illallah, his life and his property are safe from me, except by its right (in cases where Islamic laws apply), and his reckoning will be with Allah.”",
      "chain": [
        "30493",
        "36017",
        "20029",
        "20475",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "3162",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا يونس بن عبد الأعلى، قال حدثنا ابن وهب، قال حدثني عبد الرحمن بن شريح، أن سهل بن أبي أمامة بن سهل بن حنيف، حدثه عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من سأل الله عز وجل الشهادة بصدق بلغه الله منازل الشهداء وإن مات على فراشه ‏\"‏ ‏.‏",
      "text_en": " Sahl bin Abi Umamah bin Sahl bin Hunaif narrated from his father, from his grandfather, that the Messenger of Allah (ﷺ) said:                      \"Whoever asks Allah, the mighty and Sublime, sincerely for martyrdom, Allah will cause him to reach the status of the martyrs even of he dies in his bed.\"",
      "chain": [
        "30493",
        "20029",
        "20438",
        "11857",
        "405"
      ]
    },
    {
      "hadith_no": "3163",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا يونس بن عبد الأعلى، قال حدثنا ابن وهب، قال حدثني عبد الرحمن بن شريح، عن عبد الله بن ثعلبة الحضرمي، أنه سمع ابن حجيرة، يخبر عن عقبة بن عامر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ خمس من قبض في شىء منهن فهو شهيد المقتول في سبيل الله شهيد والغرق في سبيل الله شهيد والمبطون في سبيل الله شهيد والمطعون في سبيل الله شهيد والنفساء في سبيل الله شهيد ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Uqbah bin 'Amir that the Messenger of Allah (ﷺ) said:                      \"There are five things, whoever dies of any of them is a martyr. The one who is killed in the cause of Allah is a martyr; the one who dies of an abdominal complaint in the cause of Allah is a martyr; the one who dies of the plague in the cause of Allah is a martyr; and the woman who dies in childbirth in the cause of Allah is a martyr.\"",
      "chain": [
        "30493",
        "20029",
        "20438",
        "16053",
        "189"
      ]
    },
    {
      "hadith_no": "3241",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرني يونس بن عبد الأعلى، قال حدثنا ابن وهب، قال أخبرني يونس، عن ابن شهاب، قال أخبرني سعيد بن المسيب، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يخطب أحدكم على خطبة أخيه حتى ينكح أو يترك ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah said:                      \"None of you should propose marriage to a woman when someone else has already proposed to her, unless he marries (and he gives up the idea), or gives him permission.\"",
      "chain": [
        "30493",
        "20029",
        "20475",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "3319",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا يونس بن عبد الأعلى، قال حدثنا ابن وهب، قال أخبرني مخرمة بن بكير، عن أبيه، قال سمعت حميد بن نافع، يقول سمعت زينب بنت أبي سلمة، تقول سمعت عائشة، زوج النبي صلى الله عليه وسلم تقول جاءت سهلة بنت سهيل إلى رسول الله صلى الله عليه وسلم فقالت يا رسول الله إني لأرى في وجه أبي حذيفة من دخول سالم على ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ أرضعيه ‏\"‏ ‏.‏ قلت إنه لذو لحية ‏.‏ فقال ‏\"‏ أرضعيه يذهب ما في وجه أبي حذيفة ‏\"‏ ‏.‏ قالت والله ما عرفته في وجه أبي حذيفة بعد ‏.‏",
      "text_en": " Zainab bint Abi Salamah said:                      \"I heard 'Aisha, the wife of the Prophet say: 'Sahlah bint Suhail came to the Messenger of Allah and said: 'O Messenger of Allah, I see (displeasure) in the face of Abu Hudhaifah when Salim enters upon me.' The Messenger of Allah said: 'Breast-feed him.' She said: 'He has a beard.' He said: 'Breast-feed him, and that will take away (the displeasure) in the face of Abu Hudhaifah.' She said: 'By Allah, I never saw that on the face of Abu Hudhaifah after that.'\"",
      "chain": [
        "30493",
        "20029",
        "20517",
        "11154",
        "11157"
      ]
    },
    {
      "hadith_no": "3324",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا يونس بن عبد الأعلى، قال أنبأنا ابن وهب، قال أخبرني يونس، ومالك، عن ابن شهاب، عن عروة، قال أبى سائر أزواج النبي صلى الله عليه وسلم أن يدخل عليهن بتلك الرضعة أحد من الناس - يريد رضاعة الكبير - وقلن لعائشة والله ما نرى الذي أمر رسول الله صلى الله عليه وسلم سهلة بنت سهيل إلا رخصة في رضاعة سالم وحده من رسول الله صلى الله عليه وسلم والله لا يدخل علينا أحد بهذه الرضعة ولا يرانا ‏.‏",
      "text_en": " It was narrated that 'Urwah said:                      \"The rest of the wives of the Prophet refused for anyone to enter upon them on the basis of that type of breast-feeding, meaning breast-feeding of an adult. They said to 'Aishah: 'By Allah, we think that what the Messenger of Allah told Sahlah bint Suhail to do was a concession which was granted by the Messenger of Allah only with regard to breast-feeding Salim. By Allah, no one will enter upon us, nor see us on the basis of this type of breast-feeding.'\"",
      "chain": [
        "30493",
        "20029",
        "20475",
        "20001",
        "11013",
        "10511"
      ]
    },
    {
      "hadith_no": "3346",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا يونس بن عبد الأعلى، وسليمان بن داود، عن ابن وهب، أخبرني يونس، عن ابن شهاب، قال أخبرني عروة بن الزبير، أنه سأل عائشة عن قول الله، عز وجل ‏{‏ وإن خفتم أن لا تقسطوا في اليتامى فانكحوا ما طاب لكم من النساء ‏}‏ قالت يا ابن أختي هي اليتيمة تكون في حجر وليها فتشاركه في ماله فيعجبه مالها وجمالها فيريد وليها أن يتزوجها بغير أن يقسط في صداقها فيعطيها مثل ما يعطيها غيره فنهوا أن ينكحوهن إلا أن يقسطوا لهن ويبلغوا بهن أعلى سنتهن من الصداق فأمروا أن ينكحوا ما طاب لهم من النساء سواهن قال عروة قالت عائشة ثم إن الناس استفتوا رسول الله صلى الله عليه وسلم بعد فيهن فأنزل الله عز وجل ‏{‏ ويستفتونك في النساء قل الله يفتيكم فيهن ‏}‏ إلى قوله ‏{‏ وترغبون أن تنكحوهن ‏}‏ قالت عائشة والذي ذكر الله تعالى أنه يتلى في الكتاب الآية الأولى التي فيها ‏{‏ وإن خفتم أن لا تقسطوا في اليتامى فانكحوا ما طاب لكم من النساء ‏}‏ قالت عائشة وقول الله في الآية الأخرى ‏{‏ وترغبون أن تنكحوهن ‏}‏ رغبة أحدكم عن يتيمته التي تكون في حجره حين تكون قليلة المال والجمال فنهوا أن ينكحوا ما رغبوا فى مالها من يتامى النساء إلا بالقسط من أجل رغبتهم عنهن ‏.‏",
      "text_en": " 'Urwah bin Az-Zubair narrated that he asked 'Aishah about the saying of Allah, the Mighty and Sublime:                      \"And if you fear that you shall not be able to deal justly with the orphan girls then marry (other) women of your choice.\" She said: \"O son of my sister, this refers to a female orphan who is in the care of her guardian, and her wealth is joined to his, and he is attracted to her wealth and her beauty. So her guardian wants to marry her without being fair with regard to her dowry, and without giving her what someone else would give her. So they were forbidden to marry them unless they were fair to them and gave them the highest possible dowry that is customarily given, and they were commanded to marry other women of their choice.\" 'Urwah said: \"'Aishah said: 'Then later on, Allah, the Mighty and Sublime, revealed concerning them: 'They ask your legal instruction concerning women, say: Allah instructs you about them, and about what is recited unto you in the Book concerning the orphan girls whom you give not the prescribed portions and yet whom you desire to marry.' 'Aishah said: 'What Allah, Most High, mentioned here that is recited in the Book is the first Verse in which it says: And if you fear that you shall not be able to deal justly with orphan girls then marry (other) women of your choice.' 'Aishah said: 'What is referred to in the other Verse -and yet whom you desire to marry- is the desire of one of you not to marry orphan girl who is under his care if she is lacking in wealth and beauty. So they were forbidden to marry those orphan women to whose wealth they were attracted unless they were fair, because of their desire not to marry (those who were lacking in wealth and beauty.)'\"",
      "chain": [
        "30493",
        "30584",
        "20029",
        "20475",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "3385",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا يونس بن عبد الأعلى، قال أنبأنا ابن وهب، قال أخبرني أبو هانئ الخولاني، أنه سمع أبا عبد الرحمن الحبلي، يقول عن جابر بن عبد الله، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ فراش للرجل وفراش لأهله والثالث للضيف والرابع للشيطان ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Jabir bin 'Abdullah that the Messenger of Allah said:                      \"A bed for a man, a bed for his wife, a third for his guest and the fourth is for the Shaitan.\"",
      "chain": [
        "30493",
        "20029",
        "10856",
        "10938",
        "34"
      ]
    },
    {
      "hadith_no": "3439",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا يونس بن عبد الأعلى، قال حدثنا ابن وهب، قال أنبأنا يونس بن يزيد، وموسى بن على، عن ابن شهاب، قال أخبرني أبو سلمة بن عبد الرحمن، أن عائشة، زوج النبي صلى الله عليه وسلم قالت لما أمر رسول الله بتخيير أزواجه بدأ بي فقال ‏\"‏ إني ذاكر لك أمرا فلا عليك أن لا تعجلي حتى تستأمري أبويك ‏\"‏ ‏.‏ قالت قد علم أن أبواى لم يكونا ليأمراني بفراقه - قالت - ثم تلا هذه الآية ‏{‏ يا أيها النبي قل لأزواجك إن كنتن تردن الحياة الدنيا ‏}‏ إلى قوله ‏{‏ جميلا ‏}‏ فقلت أفي هذا أستأمر أبوى فإني أريد الله عز وجل ورسوله والدار الآخرة - قالت عائشة - ثم فعل أزواج النبي صلى الله عليه وسلم مثل ما فعلت ولم يكن ذلك حين قال لهن رسول الله صلى الله عليه وسلم واخترنه طلاقا من أجل أنهن اخترنه ‏.‏",
      "text_en": " It was narrated that 'Aishah, the wife of the Prophet, said:                      \"When the Messenger of Allah was commanded to give his wives the choice, he started with me and said: 'I am going to say something to you and you do not have to rush (to make a decision) until you consult your parents.'\" She said: \"He knew that my parents would never tell me to leave him.\" She said: \"Then he recited this Verse: 'O Prophet! Say to your wives: If you desire the life of this world, and its glitter, then come! I will make a provision for you and set you free in a handsome manner.' I said: 'Do I need to consult my parents concerning this? I desire Allah, the Mighty and Sublime, and His Messenger, and the home of the Hereafter.'\" 'Aishah said: \"Then the wives of the Prophet all did the same as I did, and that was not counted as a divorce, when the Messenger of Allah gave them the choice and they chose him.\"",
      "chain": [
        "30493",
        "20029",
        "20475",
        "11013",
        "10567"
      ]
    },
    {
      "hadith_no": "3518",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا يونس بن عبد الأعلى، قال حدثنا ابن وهب، قال أخبرني يونس، عن ابن شهاب، أن عبيد الله بن عبد الله، حدثه أن أباه كتب إلى عمر بن عبد الله بن أرقم الزهري يأمره أن يدخل على سبيعة بنت الحارث الأسلمية فيسألها حديثها وعما قال لها رسول الله صلى الله عليه وسلم حين استفتته فكتب عمر بن عبد الله إلى عبد الله بن عتبة يخبره أن سبيعة أخبرته أنها كانت تحت سعد ابن خولة - وهو من بني عامر بن لؤى وكان ممن شهد بدرا فتوفي عنها زوجها في حجة الوداع وهي حامل - فلم تنشب أن وضعت حملها بعد وفاته فلما تعلت من نفاسها تجملت للخطاب فدخل عليها أبو السنابل بن بعكك - رجل من بني عبد الدار - فقال لها ما لي أراك متجملة لعلك تريدين النكاح إنك والله ما أنت بناكح حتى تمر عليك أربعة أشهر وعشرا ‏.‏ قالت سبيعة فلما قال لي ذلك جمعت على ثيابي حين أمسيت فأتيت رسول الله صلى الله عليه وسلم فسألته عن ذلك فأفتاني بأني قد حللت حين وضعت حملي وأمرني بالتزويج إن بدا لي ‏.‏",
      "text_en": " 'Ubaidullah bin 'Abdullah narrated that his father wrote to 'Umar bin 'Abdullah bin Arqam Az-Zuhri, telling him to go to Subai'ah bint Al-Harith Al-Aslamiyyah and ask her about her Hadith and what the Messenger of Allah had said to her when she consulted him. 'Umar bin 'Abdullah wrote back to 'Abdullah bin 'Utbah telling him that Subai'ah told him, that she was married to Sahl bin Khawlah -who was from Banu 'Amir bin Lu-ayy and was one of those who had been present at Badr- and her husband died during the Farewell Pilgrimage while she was pregnant. She gave birth soon after he died, and when her Nifas ended she adorned herself to receive proposals of marriage. Abu As-Sanabil bin Ba'kak -a man from Banu 'Abd Ad-Dar- went to her and said to her:                      'Why do I see you adorned? Perhaps you want to get married, but by Allah you will not get married until four months and ten days have passed.' Subai'ah said: 'When he said that to me, I put on my clothes in the evening and went to the Messenger of Allah and asked him about that. He ruled that it had become permissible for me to marry when I gave birth, and he told me to get married if I wanted to.'\"",
      "chain": [
        "30493",
        "20029",
        "20475",
        "11013",
        "11004"
      ]
    },
    {
      "hadith_no": "3618",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Wills - كتاب الوصايا",
      "chapter_no": "30",
      "text_ar": "أخبرنا يونس بن عبد الأعلى، قال أنبأنا ابن وهب، قال أخبرني يونس، عن ابن شهاب، قال فإن سالما أخبرني عن عبد الله بن عمر، أن النبي صلى الله عليه وسلم قال ‏\"‏ ما حق امرئ مسلم تمر عليه ثلاث ليال إلا وعنده وصيته ‏\"‏‏.‏ قال عبد الله بن عمر ما مرت على منذ سمعت رسول الله صلى الله عليه وسلم قال ذلك إلا وعندي وصيتي‏.‏",
      "text_en": " It was narrated from 'Abdullah bin 'Umar that the Prophet said:                      \"It is not befitting for a Muslim to abide for three nights without having his will with him.\" 'Abdullah bin 'Umar said: \"Since I heard this from the Messenger of Allah, I have always had my will with me.\"",
      "chain": [
        "30493",
        "20029",
        "20475",
        "11013",
        "18"
      ]
    },
    {
      "hadith_no": "3823",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "حدثنا يونس بن عبد الأعلى، قال حدثنا ابن وهب، قال أخبرني يونس، عن ابن شهاب، قال أخبرني عبد الله بن كعب بن مالك، عن أبيه، أنه قال لرسول الله صلى الله عليه وسلم حين تيب عليه يا رسول الله إني أنخلع من مالي صدقة إلى الله ورسوله ‏.‏ فقال له رسول الله صلى الله عليه وسلم ‏\"‏ أمسك عليك بعض مالك فهو خير لك ‏\"‏ ‏.‏ قال أبو عبد الرحمن يشبه أن يكون الزهري سمع هذا الحديث من عبد الله بن كعب ومن عبد الرحمن عنه في هذا الحديث الطويل توبة كعب ‏.‏",
      "text_en": " 'Abdullah bin Ka'b bin Malik narrated from his father, that he said to the Messenger of Allah -when his repentance was accepted:                      \"O Messenger of Allah! I want to give all my wealth in charity for Allah and His Messenger.\" The Messenger of Allah said to him: \"Keep some of your wealth for yourself; that is better for you.\"",
      "chain": [
        "30493",
        "20029",
        "20475",
        "11013",
        "1131",
        "390"
      ]
    },
    {
      "hadith_no": "3828",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا يونس بن عبد الأعلى، قال حدثنا ابن وهب، قال أخبرني عمرو بن الحارث، أن كثير بن فرقد، حدثه أن نافعا حدثهم عن عبد الله بن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من حلف فقال إن شاء الله فقد استثنى ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah bin 'Umar said:                      \"The Messenger of Allah said: 'Whoever swears an oath and says: If Allah wills, then he has made an exception.'\"",
      "chain": [
        "30493",
        "20029",
        "20377",
        "20170",
        "20507"
      ]
    },
    {
      "hadith_no": "3834",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا يونس بن عبد الأعلى، قال حدثنا ابن وهب، قال أخبرني يونس، عن ابن شهاب، عن أبي سلمة، عن عائشة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا نذر في معصية وكفارته كفارة اليمين ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Aishah that the Messenger of Allah said:                      \"There is no vow to commit an act of disobedience and its expiation is the expiation for an oath.\"",
      "chain": [
        "30493",
        "20029",
        "20475",
        "11013",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "4202",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of al-Bay'ah - كتاب البيعة",
      "chapter_no": "39",
      "text_ar": "أخبرنا يونس بن عبد الأعلى، قال حدثنا ابن وهب، قال أخبرني يونس، عن ابن شهاب، عن أبي سلمة بن عبد الرحمن، عن أبي سعيد، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ ما بعث الله من نبي ولا استخلف من خليفة إلا كانت له بطانتان بطانة تأمره بالخير وبطانة تأمره بالشر وتحضه عليه والمعصوم من عصم الله عز وجل ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Saeed tht the Messenger of Allah said:                     \"Allah never sends a prophet or appoints a Khalifah but he has two groups of advisers: A group that tells him to do good and a group that tells him to do evil and urges him to do it. And the one who is truly protected is the one who is protected by Allah, the Mighty and Sublime.\"",
      "chain": [
        "30493",
        "20029",
        "20475",
        "11013",
        "10567",
        "38"
      ]
    },
    {
      "hadith_no": "4293",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا يونس بن عبد الأعلى، قال حدثنا ابن وهب، قال أنبأنا معروف بن سويد الجذامي، أن على بن رباح اللخمي، حدثه أنه، سمع أبا هريرة، يقول قال النبي صلى الله عليه وسلم ‏\"‏ لا يحل ثمن الكلب ولا حلوان الكاهن ولا مهر البغي ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah said:                     \"The Prophet said: 'The price of a dog, the fees of a fortuneteller and the gift of a female fornicator are not permissible.\"'",
      "chain": [
        "30493",
        "20029",
        "26040",
        "13"
      ]
    },
    {
      "hadith_no": "4365",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا يونس بن عبد الأعلى، قال حدثنا ابن وهب، قال أخبرني سعيد بن أبي أيوب، وذكر، آخرين عن عياش بن عباس القتباني، عن عيسى بن هلال الصدفي، عن عبد الله بن عمرو بن العاص، أن رسول الله صلى الله عليه وسلم قال لرجل ‏\"‏ أمرت بيوم الأضحى عيدا جعله الله عز وجل لهذه الأمة ‏\"‏ ‏.‏ فقال الرجل أرأيت إن لم أجد إلا منيحة أنثى أفأضحي بها قال ‏\"‏ لا ولكن تأخذ من شعرك وتقلم أظفارك وتقص شاربك وتحلق عانتك فذلك تمام أضحيتك عند الله عز وجل ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin 'Amr bin al-As that the Messenger of Allah said to a man:                     \"I have been instructed to take the Day of Sacrifice as an 'Id which Allah, the Might and Sublime, has ordained for this Ummah.\" The man said: \"What do you think if I cannot find anything but a female sheep that has been loaned to me so that I may benefit from its milk - should I sacrifice it?\" He said: \"No. Rather cut something from your hair and your nails, trim your mustache and shave your pubic hairs, and you will have a complete reward with Allah, the Might and Sublime, as if you had offered the sacrifice.\"",
      "chain": [
        "30493",
        "20029",
        "20375",
        "10871",
        "16083",
        "29"
      ]
    },
    {
      "hadith_no": "4511",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا يونس بن عبد الأعلى، والحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن وهب، قال أخبرني يونس، عن ابن شهاب، عن عامر بن سعد، عن أبي سعيد الخدري، قال نهى رسول الله صلى الله عليه وسلم عن الملامسة والمنابذة في البيع ‏.‏",
      "text_en": " It was narrated that Abu Sa'eed al-Khudri said:                     \"The Messenger of Allah forbade two kinds of transactions: Mulamash and Munabddhah \"",
      "chain": [
        "30493",
        "36017",
        "20029",
        "20475",
        "11013",
        "10554",
        "38"
      ]
    },
    {
      "hadith_no": "4521",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرني يونس بن عبد الأعلى، والحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن وهب، أخبرني يونس، عن ابن شهاب، قال حدثني سعيد، وأبو سلمة أن أبا هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تبيعوا الثمر حتى يبدو صلاحه ولا تبتاعوا الثمر بالتمر ‏\"‏ ‏.‏ قال ابن شهاب حدثني سالم بن عبد الله عن أبيه أن رسول الله صلى الله عليه وسلم نهى عن مثله سواء ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah said: 'Do not sell fruits until their condition is know, and do not sell fresh dates (still on the tree) fro dried dates.\"' Ib Shihab said: \"Salim bin 'Abdullah narrated to me, form his father: 'That Allah's Messenger forbade from  ...\"similarly.",
      "chain": [
        "30493",
        "36017",
        "20029",
        "20475",
        "11013",
        "11168",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "4656",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا يونس بن عبد الأعلى، قال أنبأنا ابن وهب، قال أخبرني رجال، من أهل العلم منهم يونس والليث أن ابن شهاب أخبرهم عن عروة عن عائشة أنها قالت جاءت بريرة إلى فقالت يا عائشة إني كاتبت أهلي على تسع أواق في كل عام أوقية فأعينيني ‏.‏ ولم تكن قضت من كتابتها شيئا فقالت لها عائشة ونفست فيها ارجعي إلى أهلك فإن أحبوا أن أعطيهم ذلك جميعا ويكون ولاؤك لي فعلت ‏.‏ فذهبت بريرة إلى أهلها فعرضت ذلك عليهم فأبوا وقالوا إن شاءت أن تحتسب عليك فلتفعل ويكون ذلك لنا ‏.‏ فذكرت ذلك عائشة لرسول الله صلى الله عليه وسلم فقال ‏\"‏ لا يمنعك ذلك منها ابتاعي وأعتقي فإن الولاء لمن أعتق ‏\"‏ ‏.‏ ففعلت وقام رسول الله صلى الله عليه وسلم في الناس فحمد الله تعالى ثم قال ‏\"‏ أما بعد فما بال الناس يشترطون شروطا ليست في كتاب الله من اشترط شرطا ليس في كتاب الله فهو باطل وإن كان مائة شرط قضاء الله أحق وشرط الله أوثق وإنما الولاء لمن أعتق ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"Barirah came to me and said: 'O 'Sishah, I have drawn up a contract of manumission with my master, (to buy my freedom) in return for nine Uwqiyah, one Uwqiyah to be paid each year; help me,' she had not yet paid anything toward her contract of manumission.' 'Aishah, who liked her and wanted to help her, said: 'Go back to your masters and if they agree to let me pay the whole sum and that your loyalty will be to me, I will do it.' So Barirah went to her masters and suggested that to them, but they refused and said: 'if she wants to seek reward (with Allah) by freeing you, let her do so, but (you loyalty) will be to us, 'Aishah told the Messenger of Allah about that and he said: 'Do not let that stop you. Buy her and set her free, and loyalty belongs to the one who sets the slave free.; so she did that, then the Messenger of Allah stood up before the people, praised and glorified Allah, then said: 'What is the matter with people who stipulate conditions that are not in the Book of Allah? Whoever stipulates conditions that are not in even if there are a hundred conditions? The decree of Allah takes priority, and the conditions of Allah binding. And loyalty belongs to the one who sets the slaves free.'",
      "chain": [
        "30493",
        "20029",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "4707",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا أحمد بن عمرو بن السرح، ويونس بن عبد الأعلى، قال أنبأنا ابن وهب، قال أخبرني يونس، عن ابن شهاب، - قال أحمد بن عمرو - قال أخبرني أبو سلمة، وسليمان بن يسار، عن رجل، من أصحاب رسول الله صلى الله عليه وسلم من الأنصار أن رسول الله صلى الله عليه وسلم أقر القسامة على ما كانت عليه في الجاهلية ‏.‏",
      "text_en": " Abu Salamah and Sulaiman bin Yasar narrated from one of the Companions of the Messenger of Allah, one of the Ansar, that:                     the Messenger or Allah approved of Qasamah as it had been during the Jahiliyyah.",
      "chain": [
        "30485",
        "30493",
        "20029",
        "20475",
        "11013",
        "10567",
        "11005"
      ]
    },
    {
      "hadith_no": "4907",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرنا يونس بن عبد الأعلى، قال حدثنا ابن وهب، قال حدثنا حنظلة، أن نافعا، حدثهم أن عبد الله بن عمر قال قطع رسول الله صلى الله عليه وسلم في مجن ثمنه ثلاثة دراهم ‏.‏ قال أبو عبد الرحمن هذا الصواب ‏.‏",
      "text_en": " 'Abdullah bin 'Umar said:                     \"The Messenger of Allah cut off (a thief's hand) for a shield which was worth three Dirham.\" (Sahih) Abu 'Abdur-Rahman (An-Nasai) said: This is correct.",
      "chain": [
        "30493",
        "20029",
        "11243",
        "18"
      ]
    },
    {
      "hadith_no": "5076",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا يونس بن عبد الأعلى، قال حدثنا ابن وهب، قال أخبرني ابن جريج، عن أبي الزبير، عن جابر، قال أتي بأبي قحافة يوم فتح مكة ورأسه ولحيته كالثغامة بياضا فقال رسول الله صلى الله عليه وسلم ‏\"‏ غيروا هذا بشىء واجتنبوا السواد ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Jabir said:                     \"Abu Quhafah was brought on the Day of the Conquest of Makkah, and his hair and beard were white like the Thaghamah. The Messenger of Allah [SAW] said: 'Change this with something, but avoid black.'\"",
      "chain": [
        "30493",
        "20029",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "5407",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Etiquette of Judges - كتاب آداب القضاة",
      "chapter_no": "49",
      "text_ar": "أخبرنا يونس بن عبد الأعلى، والحارث بن مسكين، عن ابن وهب، قال أخبرني يونس بن يزيد، والليث بن سعد، عن ابن شهاب، أن عروة بن الزبير، حدثه أن عبد الله بن الزبير حدثه عن الزبير بن العوام، أنه خاصم رجلا من الأنصار قد شهد بدرا مع رسول الله صلى الله عليه وسلم في شراج الحرة كانا يسقيان به كلاهما النخل فقال الأنصاري سرح الماء يمر عليه ‏.‏ فأبى عليه فقال رسول الله صلى الله عليه وسلم ‏\"‏ اسق يا زبير ثم أرسل الماء إلى جارك ‏\"‏ ‏.‏ فغضب الأنصاري وقال يا رسول الله أن كان ابن عمتك فتلون وجه رسول الله صلى الله عليه وسلم ثم قال ‏\"‏ يا زبير اسق ثم احبس الماء حتى يرجع إلى الجدر ‏\"‏ ‏.‏ فاستوفى رسول الله صلى الله عليه وسلم للزبير حقه وكان رسول الله صلى الله عليه وسلم قبل ذلك أشار على الزبير برأى فيه السعة له وللأنصاري فلما أحفظ رسول الله صلى الله عليه وسلم الأنصاري استوفى للزبير حقه في صريح الحكم ‏.‏ قال الزبير لا أحسب هذه الآية أنزلت إلا في ذلك ‏{‏ فلا وربك لا يؤمنون حتى يحكموك فيما شجر بينهم ‏}‏ وأحدهما يزيد على صاحبه في القصة ‏.‏",
      "text_en": " It was narrated from Az-Zubair bin Al-'Awwam that:                     He disputed with a man among Ansar who had been present at Badr with the Messenger of Allah [SAW], concerning a stream in Al-Harrah from which they both used to water their date palm trees. The Ansari said: \"Let the water flow.\" But he (Az-Zubair) refused. The Messenger of Allah [SAW] said: \"Irrigate (your land), O Zubair! Then let the water flow to your neighbor.\" The Ansari became angry and said, \"O Messenger of Allah, is it because he is your cousin?\" The face of the Messenger of Allah [SAW] changed color (because of anger) and he said: \"O Zubair! Irrigate (your land) then block the water, until it flows back to the walls.\" So the Messenger of Allah [SAW] allowed Az-Zubair to take his rights in full, although before that he had suggested to Az-Zubair a middle way that benefited both him and the Ansari. But when the Ansari made the Messenger of Allah [SAW] angry, he gave Az-Zubair his rights in full, as stated clearly in his ruling. Az-Zubair said: \"I think that this Verse was revealed concerning this matter: 'But no, by your Lord, they can have no faith, until they make you (O Muhammad) judge in all disputes between them.'\"",
      "chain": [
        "30493",
        "36017",
        "20029",
        "20475",
        "20023",
        "11013",
        "10511",
        "106",
        "7"
      ]
    },
    {
      "hadith_no": "5429",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا يونس بن عبد الأعلى، قال حدثنا ابن وهب، قال أخبرني حفص بن ميسرة، عن زيد بن أسلم، عن معاذ بن عبد الله بن خبيب، عن أبيه، قال كنت مع رسول الله صلى الله عليه وسلم في طريق مكة فأصبت خلوة من رسول الله صلى الله عليه وسلم فدنوت منه فقال ‏\"‏ قل ‏\"‏ ‏.‏ فقلت ما أقول قال ‏\"‏ قل ‏\"‏ ‏.‏ قلت ما أقول قال ‏\"‏ ‏{‏ قل أعوذ برب الفلق ‏}‏ ‏\"‏ ‏.‏ حتى ختمها ثم قال ‏\"‏ ‏{‏ قل أعوذ برب الناس ‏}‏ ‏\"‏ ‏.‏ حتى ختمها ثم قال ‏\"‏ ما تعوذ الناس بأفضل منهما ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Mu'adh bin 'Abdullah bin Khubaib that his father said:                     \"I was with the Messenger of Allah [SAW] on the road to Makkah when I found myself alone with the Messenger of Allah [SAW]. I drew close to him and he said: 'Say.' I said: 'What should I say?' He said: 'Say.' I said: 'What should I say?' He said: 'Say: I seek refuge with (Allah) the Lord of the daybreak...' until he finished (the Surah), then he said: 'Say: I seek refuge with (Allah) the Lord of mankind...' until he finished it. Then he said: 'The people cannot seek refuge with Allah by means of anything better than these two.'\"",
      "chain": [
        "30493",
        "20029",
        "20421",
        "11163",
        "19822",
        "5123"
      ]
    },
    {
      "hadith_no": "5464",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا يونس بن عبد الأعلى، قال حدثنا ابن وهب، قال حدثني موسى بن شيبة، عن الأوزاعي، عن إسحاق بن عبد الله بن أبي طلحة، قال حدثني جعفر بن عياض، أن أبا هريرة، حدثه عن رسول الله صلى الله عليه وسلم قال ‏\"‏ تعوذوا بالله من الفقر والقلة والذلة وأن تظلم أو تظلم ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah narrated that:                     The Messenger of Allah [SAW] said: \"Seek refuge with Allah from poverty, want and humiliation, and from wronging others or being wronged.\"",
      "chain": [
        "30493",
        "20029",
        "20024",
        "11151",
        "13"
      ]
    },
    {
      "hadith_no": "5488",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا يونس بن عبد الأعلى، قال أنبأنا ابن وهب، قال قال حيى حدثني أبو عبد الرحمن الحبلي، عن عبد الله بن عمرو، أن رسول الله صلى الله عليه وسلم كان يدعو بهؤلاء الكلمات ‏\"‏ اللهم إني أعوذ بك من غلبة الدين وشماتة الأعداء ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin 'Amr that :                     The Messenger of Allah [SAW] used to say supplication in these words: \"Allahumma inni a'udhu bika min ghalabatid-dain, wa ghalabatil-'aduwwi, wa shamatatil-a'da' (O Allah, I seek refuge with You from being overwhelmed by debt and from being overpowered by the enemy, and from the enemy rejoicing at my misfortune.)\"",
      "chain": [
        "30493",
        "20029",
        "10938",
        "29"
      ]
    },
    {
      "hadith_no": "5523",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا يونس بن عبد الأعلى، عن ابن وهب، قال أخبرني موسى بن شيبة، عن الأوزاعي، عن عبدة بن أبي لبابة، أن ابن يساف، حدثه أنه، سأل عائشة زوج النبي صلى الله عليه وسلم ما كان أكثر ما يدعو به رسول الله صلى الله عليه وسلم قبل موته قالت كان أكثر ما كان يدعو به ‏\"‏ اللهم إني أعوذ بك من شر ما عملت ومن شر ما لم أعمل ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdah bin Abi Lubabah that Ibn Yasaf told him that he asked 'Aishah, the wife of the Prophet [SAW], :                     What supplication did the Messenger of Allah [SAW] say the most before he died? She said: \"The supplication that he said the most was: 'Allahumma, inni a'udhu bika min sharri ma 'amiltu wa min sharri ma lam a'mal ba'd (O Allah, I seek refuge with You from the evil of what I have done, and from the evil of what I have not done yet.)'\"",
      "chain": [
        "30493",
        "20029",
        "20024",
        "10793"
      ]
    },
    {
      "hadith_no": "5532",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا يونس بن عبد الأعلى، قال أخبرني أنس بن عياض، عن عبد الله بن سعيد، عن صيفي، عن أبي اليسر، أن رسول الله صلى الله عليه وسلم كان يدعو فيقول ‏\"‏ اللهم إني أعوذ بك من الهرم والتردي والهدم والغم والحريق والغرق وأعوذ بك أن يتخبطني الشيطان عند الموت وأن أقتل في سبيلك مدبرا وأعوذ بك أن أموت لديغا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Al-Yasar that :                     The Messenger of Allah [SAW] used to supplicate and say: \"Allahumma inni a'udhu bika min al-harami, wat-taraddi, wal-hadmi, wal-ghammi, wal-hariqi, wal-gharaqi, wa a'udhu bika, an yatakhabbatanish-shaitanu 'indal-mawti, wa an uqtala fi sabilika mudbiran, wa a'udhu bika wa an amuta ladigha (O Allah, I seek refuge with You from old age, being thrown from a high place, being crushed by a falling wall, distress, burning and drowning. I seek refuge with You from being led astray by the Shaitan at the time of death and from being killed in Your cause while fleeing from the battlefield. I seek refuge with You from dying of a scorpion sting.)\"",
      "chain": [
        "30493",
        "20157",
        "11184",
        "1040"
      ]
    },
    {
      "hadith_no": "197",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا حرملة بن يحيى، ويونس بن عبد الأعلى، قالا حدثنا عبد الله بن وهب، أخبرني يونس، عن ابن شهاب، حدثني سعيد بن المسيب، أن أبا هريرة، كان يقول قال رسول الله  صلى الله عليه وسلم  ‏\"‏ يقبض الله الأرض يوم القيامة ويطوي السماء بيمينه ثم يقول أنا الملك أين ملوك الأرض ‏\"‏ ‏.‏",
      "text_en": " Sa'eed bin Musayyab narrated that Abu Hurairah used to say:                     \"The Messenger of Allah said: Allah will seize the earth on the Day of Ressurection, and He will roll up the heavens in his Right Hand, then He will say, \"I am the Sovereign. Where are the kings of the earth?'\"",
      "chain": [
        "30487",
        "30493",
        "20029",
        "20475",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "738",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book On The Mosques And The Congregations - كتاب المساجد والجماعات",
      "chapter_no": "4",
      "text_ar": "حدثنا يونس بن عبد الأعلى، حدثنا عبد الله بن وهب، عن إبراهيم بن نشيط، عن عبد الله بن عبد الرحمن بن أبي حسين النوفلي، عن عطاء بن أبي رباح، عن جابر بن عبد الله، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ من بنى مسجدا لله كمفحص قطاة أو أصغر بنى الله له بيتا في الجنة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Jabir bin 'Abdullah that:                     The Messenger of Allah said: \"Whoever builds a mosque for the sake of Allah, like a sparrow's nest for Allah or even smaller, Allah will build for him a house in Paradise.\"",
      "chain": [
        "30493",
        "20029",
        "16000",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "1540",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا يونس بن عبد الأعلى، حدثنا ابن وهب، أنبأنا هشام بن سعد، عن حاتم بن أبي نصر، عن عبادة بن نسى، عن أبيه، عن عبادة بن الصامت، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ خير الكفن الحلة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Ubadah bin Samit that the Messenger of Allah(ﷺ)said:                      “The best of shrouds is the Hullah (two-piecer).”",
      "chain": [
        "30493",
        "20029",
        "20519",
        "40"
      ]
    },
    {
      "hadith_no": "1638",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا يونس بن عبد الأعلى، حدثنا ابن وهب، أنبأنا ابن جريج، عن أيوب بن هانئ، عن مسروق بن الأجدع، عن ابن مسعود، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ كنت نهيتكم عن زيارة القبور فزوروا القبور فإنها تزهد في الدنيا وتذكر الآخرة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Ibn Mas’ud that the Messenger of Allah (ﷺ)said, “Iused to forbid you to visit the graves, but now visit them,for theywill draw your attention away from this world and remind youof theHereafter.”",
      "chain": [
        "30493",
        "20029",
        "11070",
        "11018",
        "16"
      ]
    },
    {
      "hadith_no": "2027",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا يونس بن عبد الأعلى، حدثنا ابن وهب، أخبرني ابن لهيعة، عن أبي وهب الجيشاني، حدثه أنه، سمع الضحاك بن فيروز الديلمي، يحدث عن أبيه، قال أتيت النبي  صلى الله عليه وسلم  فقلت يا رسول الله إني أسلمت وتحتي أختان ‏.‏ قال رسول الله  صلى الله عليه وسلم  لي ‏\"‏ طلق أيتهما شئت ‏\"‏ ‏.‏",
      "text_en": " Dahhak bin Fairuz Dailami narrated that his father said:                     'I came to the Prophet and said: 'O Messenger of Allah! I have become Muslim and I am married to two sisters.' The Messenger of Allah said: 'Divorce whichever of them you want.'  ”",
      "chain": [
        "30493",
        "20029",
        "20624",
        "18453"
      ]
    },
    {
      "hadith_no": "2659",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا يونس بن عبد الأعلى، أخبرني عبد الله بن نافع، أخبرني عاصم بن عمر، عن سهيل، عن أبيه، عن أبي هريرة، عن النبي صلى الله عليه وسلم في الذي يعمل عمل قوم لوط قال ‏\"‏ ارجموا الأعلى والأسفل ارجموهما جميعا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Prophet (ﷺ) said concerning those who do the action of the people of Lut:                     “Stone the upper and the lower, stone them both.”",
      "chain": [
        "30493",
        "30411",
        "13"
      ]
    },
    {
      "hadith_no": "2872",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا يونس بن عبد الأعلى، حدثنا عبد الله بن وهب، أخبرني الليث، عن زهرة بن معبد، عن أبيه، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ من مات مرابطا في سبيل الله أجرى عليه أجر عمله الصالح الذي كان يعمل وأجرى عليه رزقه وأمن من الفتان وبعثه الله يوم القيامة آمنا من الفزع ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                     “Whoever dies being prepared in the cause of Allah, will begivencontinuously the reward for the good deeds that he used to do,and hewill be rewarded with provision, and he will be kept safe fromFattan,* and Allah will raise him on the Day of Resurrection free offright.”",
      "chain": [
        "30493",
        "20029",
        "20023",
        "11507",
        "19020",
        "13"
      ]
    },
    {
      "hadith_no": "2919",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا يونس بن عبد الأعلى، حدثنا عبد الله بن وهب، أخبرني عمرو بن الحارث، عن سليمان بن عبد الرحمن، عن القاسم بن عبد الرحمن، عن عمرو بن عبسة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من رمى العدو بسهم فبلغ سهمه العدو أصاب أو أخطأ فيعدل رقبة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Amr bin ‘Abasah said:                      “I heard the Messenger ofAllah (ﷺ) say: ‘Whoever shoots an arrow at the enemy and hisarrowreaches the enemy, whether it hits him or not, that isequivalent tohim freeing a slave.’”",
      "chain": [
        "30493",
        "20029",
        "20377",
        "30587",
        "19896",
        "4002"
      ]
    },
    {
      "hadith_no": "2920",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا يونس بن عبد الأعلى، أنبأنا عبد الله بن وهب، أخبرني عمرو بن الحارث، عن أبي علي الهمداني، أنه سمع عقبة بن عامر الجهني، يقول سمعت رسول الله صلى الله عليه وسلم يقرأ على المنبر ‏\"‏ ‏{وأعدوا لهم ما استطعتم من قوة}‏ ألا وإن القوة الرمى ‏\"‏ ثلاث مرات ‏.‏",
      "text_en": " It wasnarrated that ‘Uqbah bin ‘Amir Al-Juhani said:                      “I heard theMessenger of Allah (ﷺ) reciting on the pulpit: ‘And make readyagainst them all you can of power.’[8:60] (And saying that) threetimes – ‘Power means shooting.”",
      "chain": [
        "30493",
        "20029",
        "20377",
        "189"
      ]
    },
    {
      "hadith_no": "2991",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا يونس بن عبد الأعلى، حدثنا أيوب بن سويد، عن يونس بن يزيد، عن ابن شهاب، عن سعيد بن المسيب، أن جبير بن مطعم، أخبره أنه، جاء هو وعثمان بن عفان إلى رسول الله صلى الله عليه وسلم يكلمانه فيما قسم من خمس خيبر لبني هاشم وبني المطلب فقالا قسمت لإخواننا بني هاشم وبني المطلب وقرابتنا واحدة فقال رسول الله صلى الله عليه وسلم ‏\"‏ إنما أرى بني هاشم وبني المطلب شيئا واحدا ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Sa’eed bin Musayyab that Jubair bin Mut’im toldhimthat he and ‘Uthman bin ‘Affan came to the Messenger of Allah(ﷺ) to speak to him about the way in which the one fifth fromKhaibar had been distributed to Banu Hashim and Banu Muttalib. Theysaid:                      “You have distributed it to our brothers Banu Hashim and BanuMuttalib, but we are related to you (to Banu Hashim) in the same way(as Banu Muttalib).” The Messenger of Allah (ﷺ) said: “Rather Ithink that Banu Hashim and Banu Muttalib are the same.”*",
      "chain": [
        "30493",
        "28053",
        "20475",
        "11013",
        "11002",
        "871"
      ]
    },
    {
      "hadith_no": "3513",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Drinks - كتاب الأشربة",
      "chapter_no": "30",
      "text_ar": "حدثنا يونس بن عبد الأعلى، حدثنا ابن وهب، أخبرنا ابن جريج، عن أيوب بن هانئ، عن مسروق، عن ابن مسعود، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ كل مسكر حرام ‏\"‏ ‏.‏ قال ابن ماجه هذا حديث المصريين ‏.‏",
      "text_en": " It wasnarrated from Ibn Mas’ud that the Messenger of Allah (ﷺ)said:                     “Every intoxicant is unlawful.”",
      "chain": [
        "30493",
        "20029",
        "11070",
        "11018",
        "16"
      ]
    },
    {
      "hadith_no": "3532",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Drinks - كتاب الأشربة",
      "chapter_no": "30",
      "text_ar": "حدثنا يونس بن عبد الأعلى، حدثنا عبد الله بن وهب، أنبأنا ابن جريج، عن أيوب بن هانئ، عن مسروق بن الأجدع، عن ابن مسعود، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ إني كنت نهيتكم عن نبيذ الأوعية ألا وإن وعاء لا يحرم شيئا كل مسكر حرام ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Ibn Mas’ud that the Messenger of Allah (ﷺ)said:                      “Iused to forbid you from making Nabidh in certain vessels, butavessel does not make something unlawful. All intoxicants areunlawful.”",
      "chain": [
        "30493",
        "20029",
        "11070",
        "11018",
        "16"
      ]
    },
    {
      "hadith_no": "3682",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا يونس بن عبد الأعلى، حدثنا ابن وهب، حدثنا مالك، عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك، قال كنت مع النبي  صلى الله عليه وسلم  وعليه رداء نجراني غليظ الحاشية ‏.‏",
      "text_en": " It wasnarrated that Anas bin Malik said:                      “I was with the MessengerofAllah (ﷺ) and over him was a Najrani upper wrap with a thickborder.”",
      "chain": [
        "30493",
        "20029",
        "20001",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "4162",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا حرملة بن يحيى، ويونس بن عبد الأعلى، قالا حدثنا عبد الله بن وهب، أخبرني يونس بن يزيد، عن ابن شهاب، عن أبي سلمة بن عبد الرحمن بن عوف، وسعيد بن المسيب، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ نحن أحق بالشك من إبراهيم إذ قال ‏{رب أرني كيف تحيي الموتى قال أو لم تؤمن قال بلى ولكن ليطمئن قلبي}‏ ويرحم الله لوطا لقد كان يأوي إلى ركن شديد ولو لبثت في السجن طول ما لبث يوسف لأجبت الداعي ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                      “We are more likely to express doubt than Ibrahim when hesaid:“My Lord! Show me how You give life to the dead.’ He(Allah) said: ‘Doyou not believe?’ He (Ibrahim) said: ‘Yes (Ibelieve), but to bestronger in Faith.’[2:260] And may Allah havemercy on Lut. He wishedto have a powerful support. And if i were tostay in prison as long asYusuf stayed, I would have accepted theoffer.’”",
      "chain": [
        "30487",
        "30493",
        "20029",
        "20475",
        "11013",
        "10567",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "4175",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا يونس بن عبد الأعلى، حدثنا محمد بن إدريس الشافعي، حدثني محمد بن خالد الجندي، عن أبان بن صالح، عن الحسن، عن أنس بن مالك، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ لا يزداد الأمر إلا شدة ولا الدنيا إلا إدبارا ولا الناس إلا شحا ولا تقوم الساعة إلا على شرار الناس ولا المهدي إلا عيسى ابن مريم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Anas bin Malik that the Messenger of Allah (ﷺ)said:                      “Adhering to religion will only become harder and worldlyaffairs will only become more difficult, and people will only becomemore stingy, and the Hour will only come upon the worst of people,andthe only Mahdi (after Muhammad (ﷺ)) is ‘Eisa bin Maryam.”",
      "chain": [
        "30493",
        "20002",
        "28507",
        "19897",
        "11016",
        "19"
      ]
    }
  ],
  "total_hadiths": 60
}