{
  "id": "30492",
  "name": "Harun bin Sa'id هارون بن سعيد",
  "full_name": "Harun bin Sa'id هارون بن سعيد",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "253",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Egypt"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  د  س  ق  -  ثقة ]"
    ],
    "tags": [
      "al-Sa'di",
      "Client",
      "Egypt"
    ],
    "area_of_interest_display": [
      {
        "en": "Narrator[Grade:Thiqah] [ م  د  س  ق  -  ثقة ]",
        "ar": "Narrator[Grade:Thiqah] [ م  د  س  ق  -  ثقة ]",
        "ckb": "Narrator[Grade:Thiqah] [ م  د  س  ق  -  ثقة ]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "Egypt",
        "ar": "مصر",
        "ckb": "میسر"
      }
    ],
    "tags_display": [
      {
        "en": "al-Sa'di",
        "ar": "al-Sa'di",
        "ckb": "al-Sa'di"
      },
      {
        "en": "Client (Mawla)",
        "ar": "مولى",
        "ckb": "مەولا"
      },
      {
        "en": "Egypt",
        "ar": "Egypt",
        "ckb": "Egypt"
      }
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [8th Generation]",
        "ar": "تابع التابعين [الجيل الثامن]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی هەشتەم]"
      }
    },
    {
      "id": "20029",
      "name": "'Abdullah bin Wahb عبد الله بن وهب بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [9th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [9th Generation]",
        "ar": "تابع التابعين [الجيل التاسع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی نۆیەم]"
      }
    },
    {
      "id": "20157",
      "name": "Abu Damra, Anas bin 'Ayyad أنس بن عياض الليثي - أبو ضمرة",
      "grade": "Succ. (Taba' Tabi') [8th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [8th Generation]",
        "ar": "تابع التابعين [الجيل الثامن]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی هەشتەم]"
      }
    },
    {
      "id": "23066",
      "name": "Mu'ml bin Isma'il al-Dwy Mwla مؤمل بن إسماعيل العدوي",
      "grade": "Succ. (Taba' Tabi') [9th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [9th Generation]",
        "ar": "تابع التابعين [الجيل التاسع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی نۆیەم]"
      }
    },
    {
      "id": "20413",
      "name": "Bashr bin Bakr al-Tunisi بشر بن بكر التنيسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [9th Generation]",
        "ar": "تابع التابعين [الجيل التاسع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی نۆیەم]"
      }
    }
  ],
  "students": [
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]",
      "grade_display": {
        "en": "3rd Century AH [Shafi'i]",
        "ar": "القرن الثالث الهجري [شافعي]",
        "ckb": "سەدەی سێیەمی كۆچی [شافیعی]"
      }
    },
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]",
      "grade_display": {
        "en": "3rd Century AH [11th Generation]",
        "ar": "القرن الثالث الهجري [الجيل الحادي عشر]",
        "ckb": "سەدەی سێیەمی كۆچی [نەوەی یازدەیەم]"
      }
    },
    {
      "id": "30006",
      "name": "Imam Nasa'i أحمد بن شعيب بن علي بن سنان النسائي",
      "grade": "3rd Century AH [12th generation]",
      "grade_display": {
        "en": "3rd Century AH [12th Generation]",
        "ar": "القرن الثالث الهجري [الجيل الثاني عشر]",
        "ckb": "سەدەی سێیەمی كۆچی [نەوەی دوازدەیەم]"
      }
    },
    {
      "id": "30004",
      "name": "Ibn Maja ابن ماجة",
      "grade": "3rd Century AH [12th generation]",
      "grade_display": {
        "en": "3rd Century AH [12th Generation]",
        "ar": "القرن الثالث الهجري [الجيل الثاني عشر]",
        "ckb": "سەدەی سێیەمی كۆچی [نەوەی دوازدەیەم]"
      }
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]",
      "grade_display": {
        "en": "3rd Century AH [11th Generation]",
        "ar": "القرن الثالث الهجري [الجيل الحادي عشر]",
        "ckb": "سەدەی سێیەمی كۆچی [نەوەی یازدەیەم]"
      }
    }
  ],
  "hadiths": [
    {
      "id": "sahih-muslim-227",
      "hadith_no": "227",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثني هارون بن سعيد الأيلي، حدثنا ابن وهب، قال أخبرني عمرو، عن جعفر بن ربيعة، عن عراك بن مالك، أنه سمع أبا هريرة، يقول إن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا ترغبوا عن آبائكم فمن رغب عن أبيه فهو كفر ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Huraira that the Messenger of Allah (may peace and blessings be upon him) observed:                      Do not detest your fathers; he who detested his father committed infidelity.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "20029",
        "20377",
        "11407",
        "11204",
        "13"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-272",
      "hadith_no": "272",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثني هارون بن سعيد الأيلي، حدثنا ابن وهب، قال حدثني سليمان بن بلال، عن ثور بن زيد، عن أبي الغيث، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ اجتنبوا السبع الموبقات ‏\"‏ ‏.‏ قيل يا رسول الله وما هن قال ‏\"‏ الشرك بالله والسحر وقتل النفس التي حرم الله إلا بالحق وأكل مال اليتيم وأكل الربا والتولي يوم الزحف وقذف المحصنات الغافلات المؤمنات ‏\"‏ ‏.‏",
      "text_en": " It is reported on the authority of Abu Huraira that the Messenger of Allah (may peace be upon him) observed:                      Avoid the seven noxious things. It was said (by the hearers): What are they, Messenger of Allah? He (the Holy Prophet) replied: Associating anything with Allah, magic, killing of one whom God has declared inviolate without a just cause, consuming the property of an orphan, and consuming of usury, turning back when the army advances, and slandering chaste women who are believers, but unwary.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "20029",
        "20160",
        "11155",
        "11165",
        "13"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-432",
      "hadith_no": "432",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا هارون بن سعيد الأيلي، حدثنا ابن وهب، قال أخبرني سليمان، - وهو ابن بلال - قال حدثني شريك بن عبد الله بن أبي نمر، قال سمعت أنس بن مالك، يحدثنا عن ليلة، أسري برسول الله صلى الله عليه وسلم من مسجد الكعبة أنه جاءه ثلاثة نفر قبل أن يوحى إليه وهو نائم في المسجد الحرام وساق الحديث بقصته نحو حديث ثابت البناني وقدم فيه شيئا وأخر وزاد ونقص ‏.‏",
      "text_en": " Anas b. Malik, while recounting the Night journey of the Holy Prophet (may peace be upon him), from the mosque of Ka'bah, reported:                      Three beings (angels) came to him in the mosque of the Ka'bah, while he was sleeping in the sacred mosque before it (the Command of Night Journey and Accension) was revealed to him. The rest of the hadith is narrated like that of Thabit. However, some portions have occurred before and some of them have occurred after; some have been added and some deleted.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "20029",
        "20160",
        "11858",
        "19"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-475",
      "hadith_no": "475",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني هارون بن سعيد الأيلي، حدثنا ابن وهب، قال أخبرني مالك بن أنس، عن عمرو بن يحيى بن عمارة، قال حدثني أبي، عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ يدخل الله أهل الجنة الجنة يدخل من يشاء برحمته ويدخل أهل النار النار ثم يقول انظروا من وجدتم في قلبه مثقال حبة من خردل من إيمان فأخرجوه ‏.‏ فيخرجون منها حمما قد امتحشوا ‏.‏ فيلقون في نهر الحياة أو الحيا فينبتون فيه كما تنبت الحبة إلى جانب السيل ألم تروها كيف تخرج صفراء ملتوية ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id al-Khudri reported:                      Verily the Messenger of Allah (may peace be upon him) said: Allah will admit into Paradise those deserving of Paradise, and He will admit whom He wishes out of His Mercy, and admit those condemned to Hell into the Fire (of Hell). He would then say: See, he whom you find having as much faith in his heart as a grain of mustard, bring him out. They will then be brought out burned and turned to charcoal, and would be cast into the river of life, and they would sprout aj does a seed in the silt carried away by flood. Have you not seen that it comes out yellow (fresh) and intertwined?",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "20029",
        "20001",
        "11210",
        "11232",
        "38"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-232-2",
      "hadith_no": "232",
      "source": "Sahih Muslim",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا هارون بن سعيد الأيلي، حدثنا ابن وهب، قال وأخبرني مخرمة بن بكير، عن أبيه، عن حمران، مولى عثمان قال توضأ عثمان بن عفان يوما وضوءا حسنا ثم قال رأيت رسول الله صلى الله عليه وسلم توضأ فأحسن الوضوء ثم قال ‏\"‏ من توضأ هكذا ثم خرج إلى المسجد لا ينهزه إلا الصلاة غفر له ما خلا من ذنبه ‏\"‏ ‏.‏",
      "text_en": " Humran, the freed slave of Uthman reported:                      One day Uthman b. Affan performed the ablution well, and then said: I saw Allah's Messenger (may peace be upon him) perform ablution, the best ablution, and then observed: He who performed ablution like this and then went towards the mosque and nothing (but the love of) prayer urged him (to do so), all his previous (minor) sins would be expiated.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "20029",
        "20517",
        "11154",
        "11421",
        "4"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-233-4",
      "hadith_no": "233",
      "source": "Sahih Muslim",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثني أبو الطاهر، وهارون بن سعيد الأيلي، قالا أخبرنا ابن وهب، عن أبي صخر، أن عمر بن إسحاق، مولى زائدة حدثه عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم كان يقول ‏\"‏ الصلوات الخمس والجمعة إلى الجمعة ورمضان إلى رمضان مكفرات ما بينهن إذا اجتنب الكبائر ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      Verily the Messenger of Allah (may peace be upon him) said: Five (daily) prayers and from one Friday prayer to the (next) Friday prayer, and from Ramadhan to Ramadhan are expiatious for the (sins) committed in between (their intervals) provided one shuns the major sins.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "20029",
        "11895",
        "13"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-236-2",
      "hadith_no": "236",
      "source": "Sahih Muslim",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا هارون بن معروف، ح وحدثني هارون بن سعيد الأيلي، وأبو الطاهر، قالوا حدثنا ابن وهب، أخبرني عمرو بن الحارث، أن حبان بن واسع، حدثه أن أباه حدثه أنه، سمع عبد الله بن زيد بن عاصم المازني، يذكر أنه رأى رسول الله صلى الله عليه وسلم توضأ فمضمض ثم استنثر ثم غسل وجهه ثلاثا ويده اليمنى ثلاثا والأخرى ثلاثا ومسح برأسه بماء غير فضل يده وغسل رجليه حتى أنقاهما ‏.‏ قال أبو الطاهر حدثنا ابن وهب عن عمرو بن الحارث ‏.‏",
      "text_en": " 'Abdullah b. Zaid b. 'Asim al-Mazini reported:                      He saw Allah's Messenger (may peace be upon him) perform the ablution. He rinsed his mouth then cleaned his nose, then washed his face three times, then washed his right hand thrice and then the other one, thrice. He then took fresh water and wiped his head and then washed his feet till he cleaned them.",
      "usc_msa_ref": "",
      "chain": [
        "30280",
        "30492",
        "20029",
        "20377",
        "11836"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-240-2",
      "hadith_no": "240",
      "source": "Sahih Muslim",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا هارون بن سعيد الأيلي، وأبو الطاهر، وأحمد بن عيسى، قالوا أخبرنا عبد الله بن وهب، عن مخرمة بن بكير، عن أبيه، عن سالم، مولى شداد قال دخلت على عائشة زوج النبي صلى الله عليه وسلم يوم توفي سعد بن أبي وقاص فدخل عبد الرحمن بن أبي بكر فتوضأ عندها فقالت يا عبد الرحمن أسبغ الوضوء فإني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ويل للأعقاب من النار ‏\"‏ ‏.‏",
      "text_en": " Salim, the freed slave of Shaddad, said:                      I came to 'A'isha, the wife of the Holy Prophet (may peace be upon him), on the day when Sa'db. Abi Waqqas died. 'Abd al-Rahman b. Abu Bakr also came there and he performed ablution in her presence. She (Hadrat 'A'isha) said: Abd al-Rahman, complete the ablution as I heard the Allah's Messenger (may peace be upon him) say: Woe to the heels because of hell-fire.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "30227",
        "20029",
        "20517",
        "11154",
        "11852"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-246-3",
      "hadith_no": "246",
      "source": "Sahih Muslim",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثني هارون بن سعيد الأيلي، حدثني ابن وهب، أخبرني عمرو بن الحارث، عن سعيد بن أبي هلال، عن نعيم بن عبد الله، أنه رأى أبا هريرة يتوضأ فغسل وجهه ويديه حتى كاد يبلغ المنكبين ثم غسل رجليه حتى رفع إلى الساقين ثم قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن أمتي يأتون يوم القيامة غرا محجلين من أثر الوضوء فمن استطاع منكم أن يطيل غرته فليفعل ‏\"‏ ‏.‏",
      "text_en": " Nu'aim b. 'Abdallah reported:                      He saw Abu Huraira perform ablution. He washed his face and washed his hands up to the arms. He then washed his feet and reached up to the shanks and then said: I heard Allah's Messenger (may peace be upon him) say: My people would come with bright faces and bright hands and feet on account of the marks of ablution, so he who can increase the lustre of his forehead (and that of his hands and legs) should do so.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "20029",
        "20377",
        "11169"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-283-2",
      "hadith_no": "283",
      "source": "Sahih Muslim",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثنا هارون بن سعيد الأيلي، وأبو الطاهر، وأحمد بن عيسى، جميعا عن ابن وهب، - قال هارون حدثنا ابن وهب، - أخبرني عمرو بن الحارث، عن بكير بن الأشج، أن أبا السائب، مولى هشام بن زهرة حدثه أنه، سمع أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يغتسل أحدكم في الماء الدائم وهو جنب ‏\"‏ ‏.‏ فقال كيف يفعل يا أبا هريرة قال يتناوله تناولا ‏.‏",
      "text_en": " Abu Huraira reported the Messenger of Allah (may peace be upon him) saying:                      None of you must wash in standing water when he is in a state of Junub. And Abu Huraira was asked how it was to be done; he said: It was to be taken out in handfuls.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "30227",
        "20029",
        "20029",
        "20377",
        "11154",
        "13"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-295-2",
      "hadith_no": "295",
      "source": "Sahih Muslim",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثني أبو الطاهر، أخبرنا ابن وهب، عن مخرمة، ح وحدثنا هارون بن سعيد الأيلي، وأحمد بن عيسى، قالا حدثنا ابن وهب، أخبرني مخرمة، عن أبيه، عن كريب، مولى ابن عباس قال سمعت ميمونة، زوج النبي صلى الله عليه وسلم قالت كان رسول الله صلى الله عليه وسلم يضطجع معي وأنا حائض وبيني وبينه ثوب ‏.‏",
      "text_en": " Kuraibthe freed slave of Ibn Abbas, reported:                      I heard it from Maimuna, the wife of the Apostle of Allah (way peace be upon him): The Messenger of Allah (may peace be upon him) used to lie with me when I menstruated, and there was a cloth between me and him.",
      "usc_msa_ref": "",
      "chain": [
        "20029",
        "30492",
        "30227",
        "20029",
        "11211"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-297-4",
      "hadith_no": "297",
      "source": "Sahih Muslim",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثني هارون بن سعيد الأيلي، حدثنا ابن وهب، أخبرني عمرو بن الحارث، عن محمد بن عبد الرحمن بن نوفل، عن عروة بن الزبير، عن عائشة، زوج النبي صلى الله عليه وسلم أنها قالت كان رسول الله صلى الله عليه وسلم يخرج إلى رأسه من المسجد وهو مجاور فأغسله وأنا حائض ‏.‏",
      "text_en": " 'A'isha, the wife of the Apostle (may peace he upon him), reported:                      The Messenger of Allah (may peace be upon him) put out from the mosque his head for me as he was in I'tikaf, and I washed it in the state that I was menstruating.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "20029",
        "20377",
        "11105",
        "10511"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-303-4",
      "hadith_no": "303",
      "source": "Sahih Muslim",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثني هارون بن سعيد الأيلي، وأحمد بن عيسى، قالا حدثنا ابن وهب، أخبرني مخرمة بن بكير، عن أبيه، عن سليمان بن يسار، عن ابن عباس، قال قال علي بن أبي طالب أرسلنا المقداد بن الأسود إلى رسول الله صلى الله عليه وسلم فسأله عن المذى يخرج من الإنسان كيف يفعل به فقال رسول الله صلى الله عليه وسلم ‏\"‏ توضأ وانضح فرجك ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Abbas reported it from 'Ali:                      We sent al-Miqdad b. al-Aswad to the Messenger of Allah (may peace be upon him) to ask him what must be done about prostatic fluid which flows from (the private part of) a person. The Messenger of Allah (may peace be upon him) said: Perform ablution and wash your sexual organ.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "30227",
        "20029",
        "20517",
        "11154",
        "11005",
        "17"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-321-2",
      "hadith_no": "321",
      "source": "Sahih Muslim",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثنا هارون بن سعيد الأيلي، حدثنا ابن وهب، أخبرني مخرمة بن بكير، عن أبيه، عن أبي سلمة بن عبد الرحمن، قال قالت عائشة كان رسول الله صلى الله عليه وسلم إذا اغتسل بدأ بيمينه فصب عليها من الماء فغسلها ثم صب الماء على الأذى الذي به بيمينه وغسل عنه بشماله حتى إذا فرغ من ذلك صب على رأسه ‏.‏ قالت عائشة كنت أغتسل أنا ورسول الله صلى الله عليه وسلم من إناء واحد ونحن جنبان ‏.‏",
      "text_en": " Salama b. Abd al-Rahman narrated it on the authority of A'isha that when the Messenger of Allah (may peace be upon him) took a bath, he started from the right hand and poured water over it and washed it, and then poured water on the impurity with the right band and washed it away with the help of the left hand. and after having removed it, he poured water on his head. A'isha said:                      I and the Messenger of Allah (may peace be upon him) took a bath from the same vessel, after sexual intercourse.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "20029",
        "20517",
        "11154",
        "10567",
        "53"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-343-3",
      "hadith_no": "343",
      "source": "Sahih Muslim",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثنا هارون بن سعيد الأيلي، حدثنا ابن وهب، أخبرني عمرو بن الحارث، عن ابن شهاب، حدثه أن أبا سلمة بن عبد الرحمن حدثه عن أبي سعيد الخدري، عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ إنما الماء من الماء ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id al-Khudri reported:                      The Apostle of Allah (may peace be upon him) observed: Bathing is obligatory in case of seminal emission.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "20029",
        "20377",
        "11013",
        "10567",
        "38"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-350-2",
      "hadith_no": "350",
      "source": "Sahih Muslim",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثنا هارون بن معروف، وهارون بن سعيد الأيلي، قالا حدثنا ابن وهب، أخبرني عياض بن عبد الله، عن أبي الزبير، عن جابر بن عبد الله، عن أم كلثوم، عن عائشة، زوج النبي صلى الله عليه وسلم قالت إن رجلا سأل رسول الله صلى الله عليه وسلم عن الرجل يجامع أهله ثم يكسل هل عليهما الغسل وعائشة جالسة ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إني لأفعل ذلك أنا وهذه ثم نغتسل ‏\"‏ ‏.‏",
      "text_en": " 'A'isha the wife of the Apostle of Allah (may peace be upon him) reported. A person asked the Messenger of Allah (may peace be upon him) about one who has sexual intercourse with his wife and parts away (without orgasm) whether bathing is obligatory for him. 'A'isha was sitting by him. The Messenger of Allah (may peace be upon him) said:                      I and she (the Mother of the Faithful) do it and then take a bath.",
      "usc_msa_ref": "",
      "chain": [
        "30280",
        "30492",
        "20029",
        "20514",
        "11263",
        "34",
        "10500"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-443-2",
      "hadith_no": "443",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا هارون بن سعيد الأيلي، حدثنا ابن وهب، أخبرني مخرمة، عن أبيه، عن بسر بن سعيد، أن زينب الثقفية، كانت تحدث عن رسول الله صلى الله عليه وسلم أنه قال ‏\"‏ إذا شهدت إحداكن العشاء فلا تطيب تلك الليلة ‏\"‏ ‏.‏",
      "text_en": " Zainab Thaqafiya reported:                      The Messenger of Allah (may peace be upon him) said: When any one of you (women) participates in the 'Isha' prayer, she should not perfume herself that night.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "20029",
        "11153"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-480-6",
      "hadith_no": "480",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن نافع، ح وحدثني عيسى بن حماد المصري، أخبرنا الليث، عن يزيد بن أبي حبيب، ح قال وحدثني هارون بن عبد الله، حدثنا ابن أبي فديك، حدثنا الضحاك بن عثمان، ح قال وحدثنا المقدمي، حدثنا يحيى، - وهو القطان - عن ابن عجلان، ح وحدثني هارون بن سعيد الأيلي، حدثنا ابن وهب، حدثني أسامة بن زيد، ح قال وحدثنا يحيى بن أيوب، وقتيبة، وابن، حجر قالوا حدثنا إسماعيل، - يعنون ابن جعفر - أخبرني محمد، وهو ابن عمرو ح قال وحدثني هناد بن السري، حدثنا عبدة، عن محمد بن إسحاق، كل هؤلاء عن إبراهيم بن عبد الله بن حنين، عن أبيه، عن علي، - إلا الضحاك وابن عجلان فإنهما زادا عن ابن عباس، عن علي، - عن النبي صلى الله عليه وسلم كلهم قالوا نهاني عن قراءة القرآن وأنا راكع ولم يذكروا في روايتهم النهى عنها في السجود كما ذكر الزهري وزيد بن أسلم والوليد بن كثير وداود بن قيس ‏.‏",
      "text_en": " This hadith has been narrated by some other narrators, Ibn 'Abbas and others, and they all reported that 'Ali said:                      The Apostle of Allah (may peace be upon him) forbade me to recite the Qur'an while I am in a state of bowing and prostration, and in their narration (there is a mention of) forbiddance from that (recital) in the state of prostration as it has been transmitted by Zuhri, Zaid b. Aslam, al-Wahid b. Kathir, and Dawud b. Qais.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "11014",
        "20023",
        "11411",
        "30524",
        "20172",
        "20504",
        "20031",
        "10616",
        "30492"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-1213",
      "hadith_no": "1213",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا هارون بن سعيد الأيلي، حدثنا ابن وهب، أخبرني يونس، ومالك، عن ابن شهاب، حدثني سعيد بن المسيب، أن أبا هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ قاتل الله اليهود اتخذوا قبور أنبيائهم مساجد ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      The Messenger of Allah (may peace be upon him) said: Let Allah destroy the Jews for they have taken the graves of their apostles as places of worship.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "20029",
        "20475",
        "20001",
        "11013",
        "11002",
        "13"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-1215",
      "hadith_no": "1215",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني هارون بن سعيد الأيلي، وحرملة بن يحيى، قال حرملة أخبرنا وقال، هارون حدثنا ابن وهب، أخبرني يونس، عن ابن شهاب، أخبرني عبيد الله بن عبد الله، أن عائشة، وعبد الله بن عباس، قالا لما نزلت برسول الله صلى الله عليه وسلم طفق يطرح خميصة له على وجهه فإذا اغتم كشفها عن وجهه فقال وهو كذلك ‏\"‏ لعنة الله على اليهود والنصارى اتخذوا قبور أنبيائهم مساجد ‏\"‏ ‏.‏ يحذر مثل ما صنعوا ‏.‏",
      "text_en": " 'A'isha and Abdullah reported:                      As the Messenger of Allah (may peace be upon him) was about to breathe his last, he drew his sheet upon his face and when he felt uneasy, he uncovered his face and said in that very state: Let there be curse upon the Jews and the Christians that they have taken the graves of their apostles as places of worship. He in fact warned (his men) against what they (the Jews and the Christians) did.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "30487",
        "30487",
        "20029",
        "20475",
        "11013",
        "11004",
        "53",
        "17"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-1217",
      "hadith_no": "1217",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثني هارون بن سعيد الأيلي، وأحمد بن عيسى، قالا حدثنا ابن وهب، أخبرني عمرو، أن بكيرا، حدثه أن عاصم بن عمر بن قتادة حدثه أنه، سمع عبيد الله الخولاني، يذكر أنه سمع عثمان بن عفان، عند قول الناس فيه حين بنى مسجد الرسول صلى الله عليه وسلم ‏.‏ إنكم قد أكثرتم وإني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من بنى مسجدا لله تعالى - قال بكير حسبت أنه قال - يبتغي به وجه الله - بنى الله له بيتا في الجنة ‏\"‏ ‏.‏ وقال ابن عيسى في روايته ‏\"‏ مثله في الجنة ‏\"‏ ‏.‏",
      "text_en": " Ubaidullah al-Khaulini reported:                      'Uthman b. 'Affan listened to the opinion of the people (which was not favourable) when he rebuilt the mosque of the Messenger of Allah (may peace be upon him). Thereupon he said: You have not been fair to me for I have heard from the Messenger of Allah (may peace be upon him) saying: He who built a mosque for Allah, the Exalted, Allah would build for him a house in Paradise. Bukair said: I think he (the Holy Prophet) said: While he seeks the pleasure of Allah (by building the mosque). And in the narration of Ibn 'Isa (the words are):\" (a house) like that (mosque) in Paradise.\"",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "30227",
        "20029",
        "20377",
        "11154",
        "11103",
        "11706"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-1242",
      "hadith_no": "1242",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثني أبو الطاهر، أخبرنا ابن وهب، عن مخرمة بن بكير، ح قال وحدثنا هارون بن سعيد الأيلي، حدثنا ابن وهب، أخبرني مخرمة، عن أبيه، عن عمرو بن سليم الزرقي، قال سمعت أبا قتادة الأنصاري، يقول رأيت رسول الله صلى الله عليه وسلم يصلي للناس وأمامة بنت أبي العاص على عنقه فإذا سجد وضعها ‏.‏",
      "text_en": " Abu Qatada reported:                      I saw the Messenger of Allah (may peace be upon him) leading the people in prayer with Umama daughter of Abu'l-'As on his neck; and when he prostrated he put her down.",
      "usc_msa_ref": "",
      "chain": [
        "20029",
        "20517",
        "30492",
        "20029",
        "1544",
        "391"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-1270",
      "hadith_no": "1270",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا هارون بن سعيد الأيلي، حدثنا ابن وهب، أخبرني عمرو، عن ابن شهاب، قال حدثني أنس بن مالك، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا قرب العشاء وحضرت الصلاة فابدءوا به قبل أن تصلوا صلاة المغرب ولا تعجلوا عن عشائكم ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik reported:                      The Messenger of Allah (may peace be upon him) said: When the supper is brought before you, and it is also the time to say prayer, first take food before saying evening prayer and do not hasten (to prayer, leaving aside the food).",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "20029",
        "20377",
        "11013",
        "19"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-1285",
      "hadith_no": "1285",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا هارون بن سعيد الأيلي، وأحمد بن عيسى، قالا حدثنا ابن وهب، أخبرني عمرو، عن بكير بن الأشج، عن ابن خباب، عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم مر على زراعة بصل هو وأصحابه فنزل ناس منهم فأكلوا منه ولم يأكل آخرون فرحنا إليه فدعا الذين لم يأكلوا البصل وأخر الآخرين حتى ذهب ريحها ‏.‏",
      "text_en": " Abu Sa'id al-Khudri reported:                      The Messenger of Allah (may peace be upon him) along with his Companions happened to pass by a field in which onions were sown. The people stopped there and ate out of that, but some of them did not eat. Then they (Propbet's Companions) went to him. He (first) called those who had not eaten the onions and kept the others (who had taken onions) waiting till its odour vanished.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "30227",
        "20029",
        "20377",
        "11154",
        "38"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-1428",
      "hadith_no": "1428",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني هارون بن سعيد الأيلي، وعمرو بن سواد، وأحمد بن عيسى، قال عمرو أخبرنا وقال الآخران، حدثنا ابن وهب، قال أخبرني عمرو، أن بكيرا، حدثه عن بسر بن سعيد، وسلمان الأغر، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا كان اليوم الحار فأبردوا بالصلاة فإن شدة الحر من فيح جهنم ‏\"‏ ‏.",
      "text_en": " Abu Huraira reported:                      The Messenger of Allah (may peace be upon him) said: When it is a hot day, (delay) the prayer till the extreme heat passes away, for the intensity of heat is from the exhalation of Hell.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "30443",
        "30227",
        "11439",
        "20029",
        "20377",
        "11154",
        "11153",
        "11171",
        "13"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-1440",
      "hadith_no": "1440",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني هارون بن سعيد الأيلي، حدثنا ابن وهب، أخبرني عمرو، عن ابن شهاب، عن أنس، ‏.‏ أن رسول الله صلى الله عليه وسلم كان يصلي العصر بمثله سواء ‏.‏",
      "text_en": " This hadith that the Messenger of Allah (may peace be upon him) used to offer the afternoon prayer like the one narrated above has been transmitted by Anas b. Malik by another chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "20029",
        "20377",
        "11013"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-1769",
      "hadith_no": "1769",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني هارون بن سعيد الأيلي، حدثنا ابن وهب، أخبرني سليمان بن بلال، عن ربيعة بن أبي عبد الرحمن، عن القاسم بن محمد، عن عائشة، أن رسول الله صلى الله عليه وسلم كان يصلي صلاته بالليل وهي معترضة بين يديه فإذا بقي الوتر أيقظها فأوترت ‏.‏",
      "text_en": " 'A'isha reported:                      The Messenger of Allah (may peace be upon him) observed the Witr prayer every night and he completed Witr at the time of dawn.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "20029",
        "20160",
        "11162",
        "10535",
        "53"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-1827",
      "hadith_no": "1827",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثني هارون بن سعيد الأيلي، حدثنا ابن وهب، حدثنا عمرو، عن عبد ربه بن سعيد، عن مخرمة بن سليمان، عن كريب، مولى ابن عباس عن ابن عباس، أنه قال نمت عند ميمونة زوج النبي صلى الله عليه وسلم ورسول الله صلى الله عليه وسلم عندها تلك الليلة فتوضأ رسول الله صلى الله عليه وسلم ثم قام فصلى فقمت عن يساره فأخذني فجعلني عن يمينه فصلى في تلك الليلة ثلاث عشرة ركعة ثم نام رسول الله صلى الله عليه وسلم حتى نفخ وكان إذا نام نفخ ثم أتاه المؤذن فخرج فصلى ولم يتوضأ ‏.‏ قال عمرو فحدثت به بكير بن الأشج فقال حدثني كريب بذلك ‏.‏",
      "text_en": " Ibn 'Abbas reported:                      I spent one night in the house of my mother's sister Maimuna, daughter of Harith, and said to her: Awake me when the Messenger of Allah (may peace be upon him) stands to pray (at night). (She woke me up when) the Messenger of Allah (may peace be upon him) stood up for prayer. I stood on his left side. He took hold of my hand and made me stand on his right side, and whenever I dozed off he took hold of my earlobe (and made me alert). He (the narrator) said: He (the Holy Prophet) observed eleven rak'ahs. He then sat with his legs drawn and wrapped in his garment and slept so that I could bear his breathing while asleep. And when the dawn appeared, he observed two short rak'ahs of (Sunnah) prayer.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "20029",
        "20377",
        "11191",
        "11223",
        "11211",
        "17"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-1995",
      "hadith_no": "1995",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "حدثني هارون بن سعيد الأيلي، وأحمد بن عيسى، قالا حدثنا ابن وهب، أخبرني عمرو، عن عبيد الله بن أبي جعفر، أن محمد بن جعفر، حدثه عن عروة بن الزبير، عن عائشة، أنها قالت كان الناس ينتابون الجمعة من منازلهم من العوالي فيأتون في العباء ويصيبهم الغبار فتخرج منهم الريح فأتى رسول الله صلى الله عليه وسلم إنسان منهم وهو عندي فقال رسول الله صلى الله عليه وسلم ‏\"‏ لو أنكم تطهرتم ليومكم هذا ‏\"‏ ‏.‏",
      "text_en": " 'Aisha reported:                      The people came for Jumu'a prayer from their houses in the neighbouring villages dressed in woollen garments on which dust was settled and this emitted a foal smell. A person among them (those who were dressed so) came to the Messenger of Allah (may peace be upon him) while he was in my house. The Messenger of Allah (may peace he upon him) said to him: Were you to cleanse yourselves on this day.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "30227",
        "20029",
        "20377",
        "11409",
        "20173",
        "10511",
        "53"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-2012",
      "hadith_no": "2012",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "وحدثني أبو الطاهر، وعلي بن خشرم، قالا أخبرنا ابن وهب، عن مخرمة بن، بكير ح وحدثنا هارون بن سعيد الأيلي، وأحمد بن عيسى، قالا حدثنا ابن وهب، أخبرنا مخرمة، عن أبيه، عن أبي بردة بن أبي موسى الأشعري، قال قال لي عبد الله بن عمر",
      "text_en": " Abu Burda b. Abu Musa al-Ash'ari reported:                      'Abdullah b. Umar said to me: Did you hear anything from your father narrating something from the messenger of Allah (may peace be upon him) about the time on Friday? I said: Yes, I heard him say from the Messenger of Allah (may peace be upon him) (these words):\" It is between the time when the Imam sits down and the end of the prayer.\"",
      "usc_msa_ref": "",
      "chain": [
        "30556",
        "20029",
        "20517",
        "30492",
        "30227",
        "20029",
        "11901"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-2100",
      "hadith_no": "2100",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Two Eids) - كتاب صلاة العيدين",
      "chapter_no": "9",
      "text_ar": "حدثني هارون بن سعيد الأيلي، حدثنا ابن وهب، أخبرني عمرو، أن ابن شهاب، حدثه عن عروة، عن عائشة، أن أبا بكر، دخل عليها وعندها جاريتان في أيام منى تغنيان وتضربان ورسول الله صلى الله عليه وسلم مسجى بثوبه فانتهرهما أبو بكر فكشف رسول الله صلى الله عليه وسلم عنه وقال ‏\"‏ دعهما يا أبا بكر فإنها أيام عيد ‏\"‏ ‏.‏ وقالت رأيت رسول الله صلى الله عليه وسلم يسترني بردائه وأنا أنظر إلى الحبشة وهم يلعبون وأنا جارية فاقدروا قدر الجارية العربة الحديثة السن ‏.‏",
      "text_en": " 'A'isha reported that Abu Bakr came to her and there were with her two girls on Adha days who were singing and beating the tambourine and the Messenger of Allah (may peace be upon him) had wrapped himself with his mantle. Abu Bakr scolded them. The Messenger of Allah (may peace he upon him) uncovered (his face) and said:                      Abu Bakr, leave them alone for these are the days of 'Id. And 'A'isha said: I recapitulate to my mind the fact that once the Messenger of Allah (may peace be upon him) screened me with his mantle and I saw the sports of the Abyssinians, and I was only a girl, and so you can well imagine how a girl of tender age is fond of watching the sport.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "20029",
        "20377",
        "11013",
        "10511",
        "53"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-2102",
      "hadith_no": "2102",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Two Eids) - كتاب صلاة العيدين",
      "chapter_no": "9",
      "text_ar": "حدثني هارون بن سعيد الأيلي، ويونس بن عبد الأعلى، - واللفظ لهارون - قالا حدثنا ابن وهب، أخبرنا عمرو، أن محمد بن عبد الرحمن، حدثه عن عروة، عن عائشة، قالت دخل رسول الله صلى الله عليه وسلم وعندي جاريتان تغنيان بغناء بعاث فاضطجع على الفراش وحول وجهه فدخل أبو بكر فانتهرني وقال مزمار الشيطان عند رسول الله صلى الله عليه وسلم فأقبل عليه رسول الله صلى الله عليه وسلم فقال ‏\"‏ دعهما ‏\"‏ فلما غفل غمزتهما فخرجتا وكان يوم عيد يلعب السودان بالدرق والحراب فإما سألت رسول الله صلى الله عليه وسلم وإما قال ‏\"‏ تشتهين تنظرين ‏\"‏ ‏.‏ فقلت نعم فأقامني وراءه خدي على خده وهو يقول ‏\"‏ دونكم يا بني أرفدة ‏\"‏ ‏.‏ حتى إذا مللت قال ‏\"‏ حسبك ‏\"‏ ‏.‏ قلت نعم ‏.‏ قال ‏\"‏ فاذهبي ‏\"‏ ‏.‏",
      "text_en": " 'A'isha reported:                      The Messenger of Allah (way peace be upon him) came (in my apartment) while there were two girls with me singing the song of the Battle of Bu'ath. He lay down on the bed and turned away his face. Then came Abu Bakr and he scolded me and said: Oh! this musical instrument of the devil in the house of the Messenger of Allah (may peace be upon him)! The Messenger of Allah (may peace be upon him) turned towards him and said: Leave them alone. And when he (the Holy Prophet) became unattentive, I hinted them and they went out, and it was the day of 'Id and negroes were playing with shields and speare. (I do not remember) whether I asked the Messenger of Allah (may peace be upon him) or whether he said to me if I desired to see (that sport). I said: Yes. I stood behind him with his face parallel to my face, and he said: O Banu Arfada, be busy (in your sports) till I was satiated. He said (to me): Is that enough? I said: Yes. Upon this he asked me to go.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "20029",
        "20377",
        "11105",
        "10511",
        "53"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-2119",
      "hadith_no": "2119",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Rain) - كتاب صلاة الاستسقاء‏",
      "chapter_no": "10",
      "text_ar": "وحدثنا هارون بن سعيد الأيلي، حدثنا ابن وهب، حدثني أسامة، أن حفص بن، عبيد الله بن أنس بن مالك حدثه أنه، سمع أنس بن مالك، يقول جاء أعرابي إلى رسول الله صلى الله عليه وسلم يوم الجمعة وهو على المنبر ‏.‏ واقتص الحديث وزاد فرأيت السحاب يتمزق كأنه الملاء حين تطوى ‏.‏",
      "text_en": " 'Ubaidullah b. Anas b. Malik heard (his father) Anas b. Malik as saying:                      A bedouin came to the Messenger of Allah (may peace be upon him) on Friday as he was (delivering the sermon on his) pulpit; and the rest of the hadith is the same but with this addition:\" I saw the cloud clearing just as a sheet is folded.\"",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "20029",
        "50",
        "11686",
        "19"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-2160",
      "hadith_no": "2160",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Eclipse) - كتاب الكسوف",
      "chapter_no": "11",
      "text_ar": "وحدثني هارون بن سعيد الأيلي، حدثنا ابن وهب، أخبرني عمرو بن الحارث، أن عبد الرحمن بن القاسم، حدثه عن أبيه القاسم بن محمد بن أبي بكر الصديق، عن عبد، الله بن عمر أنه كان يخبر عن رسول الله صلى الله عليه وسلم أنه قال ‏\"‏ إن الشمس والقمر لا يخسفان لموت أحد ولا لحياته ولكنهما آية من آيات الله فإذا رأيتموهما فصلوا ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. 'Umar reported that the Messenger of Allah (may peace be upon him) observed:                      Verily the sun and the moon do not eclipse on account of the death or life of anyone. They are in fact the signs among the signs of Allah. So when you see them, observe prayer.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "20029",
        "20377",
        "10530",
        "18"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-2231",
      "hadith_no": "2231",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثني أبو الطاهر، وحرملة بن يحيى، وهارون بن سعيد الأيلي، قال هارون حدثنا وقال الآخران، أخبرنا ابن وهب، أخبرني يونس بن يزيد، عن ابن شهاب، قال حدثني أبو أمامة بن سهل بن حنيف، عن أبي هريرة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ أسرعوا بالجنازة فإن كانت صالحة قربتموها إلى الخير وإن كانت غير ذلك كان شرا تضعونه عن رقابكم ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger as saying:                      Hasten at a funeral, for if (the dead person) is good, you would (soon) bring him close to the good. And if it is otherwise, it is an evil of which you are ridding yourselves.",
      "usc_msa_ref": "",
      "chain": [
        "30487",
        "30492",
        "20029",
        "20475",
        "11013",
        "405",
        "13"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-2242",
      "hadith_no": "2242",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "حدثنا هارون بن معروف، وهارون بن سعيد الأيلي، والوليد بن شجاع السكوني، قال الوليد حدثني وقال الآخران، حدثنا ابن وهب، أخبرني أبو صخر، عن شريك بن عبد، الله بن أبي نمر عن كريب، مولى ابن عباس عن عبد الله بن عباس، أنه مات ابن له بقديد أو بعسفان فقال يا كريب انظر ما اجتمع له من الناس ‏.‏ قال فخرجت فإذا ناس قد اجتمعوا له فأخبرته فقال تقول هم أربعون قال نعم ‏.‏ قال أخرجوه فإني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ما من رجل مسلم يموت فيقوم على جنازته أربعون رجلا لا يشركون بالله شيئا إلا شفعهم الله فيه ‏\"‏ ‏.‏ وفي رواية ابن معروف عن شريك بن أبي نمر عن كريب عن ابن عباس ‏.‏",
      "text_en": " 'Abdullah b. 'Abbas reported that his son died in Qudaid or 'Usfan. He said to Kuraib to see as to how many people had gathered there for his (funeral). He (Kuraib) said:                      So I went out and I informed him about the people who had gathered there. He (Ibn 'Abbas) said: Do you think they are forty? He (Kuraib) said: Yes. Ibn 'Abbas then said to them: Bring him (the dead body) out for I have heard Allah's Messenger (may peace be upon him) as saying: If any Muslim dies and forty men who associate nothing with Allah stand over his prayer (they offer prayer over him), Allah will accept them as intercessors for him.",
      "usc_msa_ref": "",
      "chain": [
        "30280",
        "30492",
        "30482",
        "20733",
        "20029",
        "11858",
        "11211",
        "17"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-2276",
      "hadith_no": "2276",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثني هارون بن سعيد الأيلي، أخبرنا ابن وهب، أخبرني معاوية بن صالح، عن حبيب بن عبيد، عن جبير بن نفير، سمعه يقول سمعت عوف بن مالك، يقول صلى رسول الله صلى الله عليه وسلم على جنازة فحفظت من دعائه وهو يقول ‏\"‏ اللهم اغفر له وارحمه وعافه واعف عنه وأكرم نزله ووسع مدخله واغسله بالماء والثلج والبرد ونقه من الخطايا كما نقيت الثوب الأبيض من الدنس وأبدله دارا خيرا من داره وأهلا خيرا من أهله وزوجا خيرا من زوجه وأدخله الجنة وأعذه من عذاب القبر أو من عذاب النار ‏\"‏ ‏.‏ قال حتى تمنيت أن أكون أنا ذلك الميت ‏.‏ قال وحدثني عبد الرحمن بن جبير حدثه عن أبيه عن عوف بن مالك عن النبي صلى الله عليه وسلم بنحو هذا الحديث أيضا ‏.‏",
      "text_en": " Jubair b. Nufair says:                      I heard it from 'Auf b. Malik that the Holy Prophet (may peace be upon him) said prayer on the dead body, and I remembered his prayer:\" O Allah! forgive him, have mercy upon him, give him peace and absolve him. Receive him with honour and make his grave spacious; wash him with water, snow and hail. Cleanse him from faults as Thou wouldst cleanse a white garment from impurity. Requite him with an abode more excellent than his abode, with a family better than his family, and with a mate better than his mate. Admit him to the Garden, and protect him from the torment of the grave and the torment of the Fire.\" ('Auf bin Malik) said: I earnestly desired that I were this dead body.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "20029",
        "20675",
        "10899",
        "4097",
        "10805"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-2286",
      "hadith_no": "2286",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثني أبو الطاهر، أحمد بن عمرو حدثنا ابن وهب، أخبرني عمرو بن الحارث، ح وحدثني هارون بن سعيد الأيلي، حدثنا ابن وهب، حدثني عمرو بن الحارث، - في رواية أبي الطاهر - أن أبا علي الهمداني، حدثه - وفي، رواية هارون - أن ثمامة بن، شفى حدثه قال كنا مع فضالة بن عبيد بأرض الروم برودس فتوفي صاحب لنا فأمر فضالة بن عبيد بقبره فسوي ثم قال سمعت رسول الله صلى الله عليه وسلم يأمر بتسويتها ‏.‏",
      "text_en": " Thumama b. Shafayy reported:                      When we were with Fadala b. 'Ubaid in the country of the Romans at a place (known as) Rudis, a friend of ours died. Fadala b. 'Ubaid ordered to prepare a grave for him and then it was levelled; and then he said: I heard the Messenger of Allah (may peace be upon him) commanding (us) to level the grave.",
      "usc_msa_ref": "",
      "chain": [
        "20029",
        "20377",
        "30492",
        "20029",
        "20377"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-2300",
      "hadith_no": "2300",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثني هارون بن سعيد الأيلي، حدثنا عبد الله بن وهب، أخبرنا ابن جريج، عن عبد الله بن كثير بن المطلب، أنه سمع محمد بن قيس، يقول سمعت عائشة، تحدث فقالت ألا أحدثكم عن النبي صلى الله عليه وسلم وعني ‏.‏ قلنا بلى ح. وحدثني من، سمع حجاجا الأعور، - واللفظ له - قال حدثنا حجاج بن محمد، حدثنا ابن جريج، أخبرني عبد الله، - رجل من قريش - عن محمد بن قيس بن مخرمة، بن المطلب أنه قال يوما ألا أحدثكم عني وعن أمي قال فظننا أنه يريد أمه التي ولدته ‏.‏ قال قالت عائشة ألا أحدثكم عني وعن رسول الله صلى الله عليه وسلم ‏.‏ قلنا بلى ‏.‏ قال قالت لما كانت ليلتي التي كان النبي صلى الله عليه وسلم فيها عندي انقلب فوضع رداءه وخلع نعليه فوضعهما عند رجليه وبسط طرف إزاره على فراشه فاضطجع فلم يلبث إلا ريثما ظن أن قد رقدت فأخذ رداءه رويدا وانتعل رويدا وفتح الباب فخرج ثم أجافه رويدا فجعلت درعي في رأسي واختمرت وتقنعت إزاري ثم انطلقت على إثره حتى جاء البقيع فقام فأطال القيام ثم رفع يديه ثلاث مرات ثم انحرف فانحرفت فأسرع فأسرعت فهرول فهرولت فأحضر فأحضرت فسبقته فدخلت فليس إلا أن اضطجعت فدخل فقال ‏\"‏ ما لك يا عائش حشيا رابية ‏\"‏ ‏.‏ قالت قلت لا شىء ‏.‏ قال ‏\"‏ لتخبريني أو ليخبرني اللطيف الخبير ‏\"‏ ‏.‏ قالت قلت يا رسول الله بأبي أنت وأمي ‏.‏ فأخبرته قال ‏\"‏ فأنت السواد الذي رأيت أمامي ‏\"‏ ‏.‏ قلت نعم ‏.‏ فلهدني في صدري لهدة أوجعتني ثم قال ‏\"‏ أظننت أن يحيف الله عليك ورسوله ‏\"‏ ‏.‏ قالت مهما يكتم الناس يعلمه الله نعم ‏.‏ قال ‏\"‏ فإن جبريل أتاني حين رأيت فناداني فأخفاه منك فأجبته فأخفيته منك ولم يكن يدخل عليك وقد وضعت ثيابك وظننت أن قد رقدت فكرهت أن أوقظك وخشيت أن تستوحشي فقال إن ربك يأمرك أن تأتي أهل البقيع فتستغفر لهم ‏\"‏ ‏.‏ قالت قلت كيف أقول لهم يا رسول الله قال ‏\"‏ قولي السلام على أهل الديار من المؤمنين والمسلمين ويرحم الله المستقدمين منا والمستأخرين وإنا إن شاء الله بكم للاحقون ‏\"‏ ‏.‏",
      "text_en": " Muhammad b. Qais said (to the people):                      Should I not narrate to you (a hadith of the Holy Prophet) on my authority and on the authority of my mother? We thought that he meant the mother who had given him birth. He (Muhammad b. Qais) then reported that it was 'A'isha who had narrated this: Should I not narrate to you about myself and about the Messenger of Allah (may peace be upon him)? We said: Yes. She said: When it was my turn for Allah's Messenger (may peace be upon him) to spend the night with me, he turned his side, put on his mantle and took off his shoes and placed them near his feet, and spread the corner of his shawl on his bed and then lay down till he thought that I had gone to sleep. He took hold of his mantle slowly and put on the shoes slowly, and opened the door and went out and then closed it lightly. I covered my head, put on my veil and tightened my waist wrapper, and then went out following his steps till he reached Baqi'. He stood there and he stood for a long time. He then lifted his hands three times, and then returned and I also returned. He hastened his steps and I also hastened my steps. He ran and I too ran. He came (to the house) and I also came (to the house). I, however, preceded him and I entered (the house), and as I lay down in the bed, he (the Holy Prophet) entered the (house), and said: Why is it, O 'A'isha, that you are out of breath? I said: There is nothing. He said: Tell me or the Subtle and the Aware would inform me. I said: Messenger of Allah, may my father and mother be ransom for you, and then I told him (the whole story). He said: Was it the darkness (of your shadow) that I saw in front of me? I said: Yes. He gave me a nudge on the chest which I felt, and then said: Did you think that Allah and His Apostle would deal unjustly with you? She said: Whatsoever the people conceal, Allah will know it. He said: Gabriel came to me when you saw me. He called me and he concealed it from you. I responded to his call, but I too concealed it from you (for he did not come to you), as you were not fully dressed. I thought that you had gone to sleep, and I did not like to awaken you, fearing that you may be frightened. He (Gabriel) said: Your Lord has commanded you to go to the inhabitants of Baqi' (to those lying in the graves) and beg pardon for them. I said: Messenger of Allah, how should I pray for them (How should I beg forgiveness for them)? He said: Say, Peace be upon the inhabitants of this city (graveyard) from among the Believers and the Muslims, and may Allah have mercy on those who have gone ahead of us, and those who come later on, and we shall, God willing, join you.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "20029",
        "11070",
        "10936"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-2318",
      "hadith_no": "2318",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا هارون بن معروف، وهارون بن سعيد الأيلي، قالا حدثنا ابن وهب، أخبرني عياض بن عبد الله، عن أبي الزبير، عن جابر بن عبد الله، عن رسول الله صلى الله عليه وسلم أنه قال ‏\"‏ ليس فيما دون خمس أواق من الورق صدقة وليس فيما دون خمس ذود من الإبل صدقة وليس فيما دون خمسة أوسق من التمر صدقة ‏\"‏ ‏.‏",
      "text_en": " Jabir b. 'Abdullah reported Allah's Messenger (may peace be upon him) as saying:                      No Sadaqa is payable on less than five fiqiyas of silver, and on less than five heads of camels, and less than five wasqs of dates.",
      "usc_msa_ref": "",
      "chain": [
        "30280",
        "30492",
        "20029",
        "20514",
        "11263",
        "34"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-2323",
      "hadith_no": "2323",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثني أبو الطاهر، وهارون بن سعيد الأيلي، وأحمد بن عيسى، قالوا حدثنا ابن وهب، أخبرني مخرمة، عن أبيه، عن عراك بن مالك، قال سمعت أبا هريرة، يحدث عن رسول الله صلى الله عليه وسلم قال ‏\"‏ ليس في العبد صدقة إلا صدقة الفطر ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      There is no Sadaqa on a slave except Sadaqat-ul-Fitr.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "30227",
        "20029",
        "11204",
        "13"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-2342",
      "hadith_no": "2342",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثني هارون بن سعيد الأيلي، حدثنا ابن وهب، أخبرني عمرو بن الحارث، أن بكيرا، حدثه عن ذكوان، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم أنه قال ‏\"‏ إذا لم يؤد المرء حق الله أو الصدقة في إبله ‏\"‏ ‏.‏ وساق الحديث بنحو حديث سهيل عن أبيه ‏.‏",
      "text_en": " This hadith has been narrated by Abu Huraira through another chain of transmitters:                      The Messenger of Allah (may peace be upon him) said:\" When a person does not pay what is due to Allah or Sadaqa of his camels....\" The rest of the hadith is the same.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "20029",
        "20377",
        "11154",
        "11161",
        "13"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-2364",
      "hadith_no": "2364",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثني هارون بن سعيد الأيلي، حدثنا ابن وهب، أخبرني عمرو، عن بكير، عن كريب، عن ميمونة بنت الحارث، أنها أعتقت وليدة في زمان رسول الله صلى الله عليه وسلم فذكرت ذلك لرسول الله صلى الله عليه وسلم فقال ‏\"‏ لو أعطيتها أخوالك كان أعظم لأجرك ‏\"‏ ‏.‏",
      "text_en": " Maimuna bint Harith reported that she set free a slave-girl during the lifetime of the Messenger of Allah (may peace be upon him) and she made a mention of that to the Messenger of Allah (may peace be upon him) and he said:                      Had you gives her to your maternal uncles, you would have a greater reward.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "20029",
        "20377",
        "11154",
        "11211",
        "61"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-2456",
      "hadith_no": "2456",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثني هارون بن سعيد الأيلي، حدثنا ابن وهب، أخبرني عمرو بن الحارث، عن بكير بن الأشج، عن بسر بن سعيد، عن ابن السعدي، أنه قال استعملني عمر بن الخطاب - رضى الله عنه - على الصدقة ‏.‏ بمثل حديث الليث ‏.‏",
      "text_en": " Ibn al-Sa'di reported:                      'Umar b. Khattab (Allah be pleased with him) appointed me as a collector of Sadaqat. The rest of the hadith in the same.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "20029",
        "20377",
        "11154",
        "11153"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-2525",
      "hadith_no": "2525",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثني هارون بن سعيد الأيلي، حدثنا ابن وهب، أخبرني عمرو، أن أبا يونس، مولى أبي هريرة حدثه عن أبي هريرة، عن رسول الله صلى الله عليه وسلم أنه قال ‏\"‏ إني لأنقلب إلى أهلي فأجد التمرة ساقطة على فراشي ثم أرفعها لآكلها ثم أخشى أن تكون صدقة فألقيها ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      I go back to my family and I find a date lying on my bed. I then take it up to eat it, but then I throw it away fearing that it may be a Sadaqa.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "20029",
        "20377",
        "13"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-2644",
      "hadith_no": "2644",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثني هارون بن سعيد الأيلي، حدثنا ابن وهب، أخبرني عمرو، - وهو ابن الحارث - عن عبد ربه بن سعيد، عن عبد الله بن كعب الحميري، عن عمر بن أبي سلمة، أنه سأل رسول الله صلى الله عليه وسلم أيقبل الصائم فقال له رسول الله صلى الله عليه وسلم ‏\"‏ سل هذه ‏\"‏ ‏.‏ لأم سلمة فأخبرته أن رسول الله صلى الله عليه وسلم يصنع ذلك فقال يا رسول الله قد غفر الله لك ما تقدم من ذنبك وما تأخر ‏.‏ فقال له رسول الله صلى الله عليه وسلم ‏\"‏ أما والله إني لأتقاكم لله وأخشاكم له ‏\"‏ ‏.‏",
      "text_en": " Umar b Abu Salama reported that he asked the Messenger of Allah (may peace be upon him):                      Should one observing fast kiss (his wife)? The Messenger of Allah (may peace be upon him) said to him: Ask her (Umm Salama). She informed him that the Messenger of Allah (may peace be upon him) did that, where upon he said: Messenger of Allah, Allah pardoned thee all thy sins, the previous and the later ones. Upon this the Messenger of Allah (may peace be upon him) ) said: By Allah, I am the most God conscious among you and I fear Him most among you.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "20029",
        "20377",
        "11191",
        "11870",
        "246"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-2647",
      "hadith_no": "2647",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثني هارون بن سعيد الأيلي، حدثنا ابن وهب، أخبرني عمرو، - وهو ابن الحارث - عن عبد ربه، عن عبد الله بن كعب الحميري، أن أبا بكر، حدثه أن مروان أرسله إلى أم سلمة - رضى الله عنها - يسأل عن الرجل يصبح جنبا أيصوم فقالت كان رسول الله صلى الله عليه وسلم يصبح جنبا من جماع لا من حلم ثم لا يفطر ولا يقضي ‏.‏",
      "text_en": " Abu Bakr reported that Marwan sent him to Umm Salama to ask whether a person should observe fast who is in a state of junub and the dawn breaks upon him, whereupon she said that the Messenger of Allah (may peace be upon him) (was at times) junbi on account of intercourse and not due to sexual dream, and the dawn broke upon him, but he neither broke the fast nor recompensed.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "20029",
        "20377",
        "11870",
        "20436"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-2685",
      "hadith_no": "2685",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثني أبو الطاهر، وهارون بن سعيد الأيلي، - قال هارون حدثنا وقال أبو الطاهر أخبرنا ابن وهب، أخبرني عمرو بن الحارث، عن أبي الأسود، عن عروة بن الزبير، عن أبي مراوح، عن حمزة بن عمرو الأسلمي، - رضى الله عنه - أنه قال يا رسول الله أجد بي قوة على الصيام في السفر فهل على جناح فقال رسول الله صلى الله عليه وسلم ‏\"‏ هي رخصة من الله فمن أخذ بها فحسن ومن أحب أن يصوم فلا جناح عليه ‏\"‏ ‏.‏ قال هارون في حديثه ‏\"‏ هي رخصة ‏\"‏ ‏.‏ ولم يذكر من الله ‏.‏",
      "text_en": " Hamza b. 'Amr al-Aslami (Allah be pleased with him) said:                      Messenger of Allah, I find strength in me for fasting on a journey; is there any sin upon me (in doing it)? Thereupon the Messenger of Allah (may peace be upon him) said: It is a concession from Allah. He who took advantage of it, it is good for him, and he who preferred to observe fast, there is no sin upon him. Harun (one of the narrators) in his narration said: 'lt is a concession, and he made no mention of\" from Allah\".",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "20029",
        "20377",
        "11105",
        "10511",
        "4123"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-2691",
      "hadith_no": "2691",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثني هارون بن سعيد الأيلي، حدثنا ابن وهب، أخبرني عمرو، أن أبا النضر، حدثه أن عميرا مولى ابن عباس - رضى الله عنهما - حدثه أنه، سمع أم الفضل، - رضى الله عنها - تقول شك ناس من أصحاب رسول الله صلى الله عليه وسلم في صيام يوم عرفة ونحن بها مع رسول الله صلى الله عليه وسلم فأرسلت إليه بقعب فيه لبن وهو بعرفة فشربه ‏.‏",
      "text_en": " Umm al-Fadl (Allah be pleased with her) is reported to have said that some people among the Companions of the Messenger of Allah (may peace be upon him) were in doubt about fasting on the day of 'Arafa and we were with him on that day. I (Umm al-Fadl) sent him a cup of milk and he was halting at 'Arafa, and he drank that.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "20029",
        "20377",
        "20390",
        "11532"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-2692",
      "hadith_no": "2692",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثني هارون بن سعيد الأيلي، حدثنا ابن وهب، أخبرني عمرو، عن بكير بن، الأشج عن كريب، مولى ابن عباس - رضى الله عنهما - عن ميمونة، زوج النبي صلى الله عليه وسلم أنها قالت إن الناس شكوا في صيام رسول الله صلى الله عليه وسلم يوم عرفة فأرسلت إليه ميمونة بحلاب اللبن وهو واقف في الموقف فشرب منه والناس ينظرون إليه ‏.‏",
      "text_en": " Kuraib, the freed slave of Ibn 'Abbas (Allah be pleased with him), reported from Maimuna, the wife of the Apostle of Allah (may peace be upon him), that people had doubt about the fasting of Allah's Messenger (may peace be upon him) on the day of 'Arafa. Maimuna sent him a cup of milk and he was halting at a place and he drank it and the people were seeing him.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "20029",
        "20377",
        "11154",
        "11211"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-2748",
      "hadith_no": "2748",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثني هارون بن سعيد الأيلي، وأحمد بن عيسى، قالا حدثنا ابن وهب، أخبرنا عمرو بن الحارث، عن عبيد الله بن أبي جعفر، عن محمد بن جعفر بن الزبير، عن عروة، عن عائشة، - رضى الله عنها - أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من مات وعليه صيام صام عنه وليه ‏\"‏ ‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her) reported Allah's Messenger (may peace be upon him) as saying:                      If anyone dies in a state (that he had to complete) some fasts, his heir must fast on his behalf.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "30227",
        "20029",
        "20377",
        "11409",
        "11215",
        "10511",
        "53"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-2876",
      "hadith_no": "2876",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثني هارون بن سعيد الأيلي، حدثنا ابن وهب، حدثني أبو صخر، عن ابن قسيط، عن عبيد بن جريج، قال حججت مع عبد الله بن عمر بن الخطاب - رضى الله عنهما - بين حج وعمرة ثنتى عشرة مرة فقلت يا أبا عبد الرحمن لقد رأيت منك أربع خصال ‏.‏ وساق الحديث بهذا المعنى إلا في قصة الإهلال فإنه خالف رواية المقبري فذكره بمعنى سوى ذكره إياه ‏.‏",
      "text_en": " 'Ubaid b. Juraij reported:                      I remained in the company of 'Abdullah b. 'Umar b. al-Khattab (Allah be pleased with them) its twelve Hajjs and 'Umras and I said to him: I saw four characteristics (peculiar in you), and the rest of the hadith is the same except the case of Talbiya. There he offered the narration given by al-Maqburi and he stated the facts excepting the one given above.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "20029",
        "11236",
        "11887"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-2918",
      "hadith_no": "2918",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا هارون بن سعيد الأيلي، وأحمد بن عيسى، قالا أخبرنا ابن وهب، أخبرني مخرمة بن بكير، عن أبيه، قال سمعت عبيد الله بن مقسم، يقول سمعت القاسم بن محمد، يقول سمعت عائشة، زوج النبي صلى الله عليه وسلم تقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ أربع كلهن فاسق يقتلن في الحل والحرم الحدأة والغراب والفارة والكلب العقور ‏\"‏ ‏.‏ قال فقلت للقاسم أفرأيت الحية قال تقتل بصغر لها ‏.‏",
      "text_en": " A'isha, the wife of the Apostle of Allah (may peace be upon him). said:                      I heard Allah's Messenger (may peace be upon him) as saying: Four are the vicious (birds, beasts and reptiles) which should be killed in the state of Ihram or otherwise: kite (and vulture), crow, rat, and the voracious dog I (one of the narrators, 'Ubaid- ullah b. Miqsam) said to Qasim (the other narrator who beard it from 'A'isha): What about the snake? lie said: Let it be killed with disgrace.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "30227",
        "20029",
        "20517",
        "11154",
        "11521",
        "10535"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-3060",
      "hadith_no": "3060",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثني هارون بن سعيد الأيلي، حدثنا ابن وهب، أخبرني عمرو، - وهو ابن الحارث - عن محمد بن عبد الرحمن، أن رجلا، من أهل العراق قال له سل لي عروة بن الزبير عن رجل يهل بالحج فإذا طاف بالبيت أيحل أم لا فإن قال لك لا يحل ‏.‏ فقل له إن رجلا يقول ذلك - قال - فسألته فقال لا يحل من أهل بالحج إلا بالحج ‏.‏ قلت فإن رجلا كان يقول ذلك ‏.‏ قال بئس ما قال فتصداني الرجل فسألني فحدثته فقال فقل له فإن رجلا كان يخبر أن رسول الله صلى الله عليه وسلم قد فعل ذلك وما شأن أسماء والزبير فعلا ذلك ‏.‏ قال فجئته فذكرت له ذلك فقال من هذا فقلت لا أدري ‏.‏ قال فما باله لا يأتيني بنفسه يسألني أظنه عراقيا ‏.‏ قلت لا أدري ‏.‏ قال فإنه قد كذب قد حج رسول الله صلى الله عليه وسلم فأخبرتني عائشة - رضى الله عنها - أن أول شىء بدأ به حين قدم مكة أنه توضأ ثم طاف بالبيت ثم حج أبو بكر فكان أول شىء بدأ به الطواف بالبيت ثم لم يكن غيره ثم عمر مثل ذلك ثم حج عثمان فرأيته أول شىء بدأ به الطواف بالبيت ثم لم يكن غيره ثم معاوية وعبد الله بن عمر ثم حججت مع أبي الزبير بن العوام فكان أول شىء بدأ به الطواف بالبيت ثم لم يكن غيره ثم رأيت المهاجرين والأنصار يفعلون ذلك ثم لم يكن غيره ثم آخر من رأيت فعل ذلك ابن عمر ثم لم ينقضها بعمرة وهذا ابن عمر عندهم أفلا يسألونه ولا أحد ممن مضى ما كانوا يبدءون بشىء حين يضعون أقدامهم أول من الطواف بالبيت ثم لا يحلون وقد رأيت أمي وخالتي حين تقدمان لا تبدآن بشىء أول من البيت تطوفان به ثم لا تحلان وقد أخبرتني أمي أنها أقبلت هي وأختها والزبير وفلان وفلان بعمرة قط فلما مسحوا الركن حلوا وقد كذب فيما ذكر من ذلك ‏.‏",
      "text_en": " Muhammad b. 'Abd al-Rahman reported:                      A person from Iraq said to him to inquire from 'Urwa b. Zubair for him whether a person who puts on Ihram for Hajj is allowed to put it off or not as he circumambulates the House. And if he says:\" No, it can't be put off,\" then tell him that there is a person who makes such an assertion. He (Muhammad b. 'Abd al-Rahman) then said: I asked him ( Urwa b. Zubair), where- upon he said: The person who has entered into the state of Ihram for Hajj cannot get out of it unless he has, completed the Hajj I (further) said (to him): (What) if a person makes that assertion? Thereupon he said: It is indeed unfortunate that he makes such an assertion. That person ('Iraqi) then met me and he asked me and I narrated to him (the reply of 'Urwa), whereupon he (the Iraqi) said: Tell him ('Urwa) that a person had informed him that Allah's Messenger (may peace be upon him) had done that; and why is it that Asma' and Zubair have done like this? He (Muhammad b. 'Abd al-Rahman) said: I went to him and made a mention of that to him, whereupon he ('Urwa) said: Who is he (the 'Iraqi)? I said: I do not know, whereupon he said: What is the matter that he does not come to me himself and ask me? I suppose he is an 'Iraqi. I said: I do not know, whereupon he said: He has told a lie. Allah's Messenger (may peace be upon him) performed Hajj, and 'A'isha (Allah be pleased with her) has told me that the first thing with which he commenced (the rituals) when he arrived at Mecca was that he performed ablution and then circumambulated the Ka'ba. Then Abu Bakr performed Hajj and the first thing with which he commenced (the Hajj) as the circumambulation of the Ka'ba and nothing besides it. So did 'Umar. Then 'Uthman performed Hajj and I saw that the first thing with which he commenced the Hajj was the circumambulation of the Ka'ba and nothing besides it. Then Mu'awiya and Abdullah b. 'Umar did that. Then I performed Hajj with my father Zubair b. al-'Awwam, and the first thing with which he commenced (Hajj) was the circumambulation of the House. He then did nothing besides it. I then saw the emigrants (Muhajirin) and the helpers (Ansar) doing like this and nothing besides it. And the last one whom I saw doing like this was Ibn 'Umar. And he did not break it (the Hajj) after performing 'Umra. And Ibn 'Umar is with them. Why don't they ask him (to testify it)? And none amongst those who had passed away commenced (the rituals of Hajj) but by circumambulating the Ka'ba on their (first arrival) and they did not put off Ihram (without completing the Hajj), and I saw my mother and my aunt commencing (their Hajj) with the circumambulation of the House, and they did not put off Ihram. My mother informed me that she came and her sister, and Zubair and so and so for 'Umra, and when they had kissed the corner (the Black Stone, after Sa'i and circumambulation), they put off Ihram. And he (the 'Iraqi) has told a lie in this matter.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "20029",
        "20377",
        "11105",
        "10511"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-3063",
      "hadith_no": "3063",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني هارون بن سعيد الأيلي، وأحمد بن عيسى، قالا حدثنا ابن وهب، أخبرني عمرو، عن أبي الأسود، أن عبد الله، مولى أسماء بنت أبي بكر - رضى الله عنهما - حدثه أنه، كان يسمع أسماء كلما مرت بالحجون تقول صلى الله على رسوله وسلم لقد نزلنا معه ها هنا ونحن يومئذ خفاف الحقائب قليل ظهرنا قليلة أزوادنا فاعتمرت أنا وأختي عائشة والزبير وفلان وفلان فلما مسحنا البيت أحللنا ثم أهللنا من العشي بالحج ‏.‏ قال هارون في روايته أن مولى أسماء ‏.‏ ولم يسم عبد الله ‏.‏",
      "text_en": " Abdullah, the freed slave of Asma' bint Abu Bakr (Allah be pleased with them), narrated that he used to hear Asma, ' whenever she passed by Hajun, saying (these words):                     \" May there be peace and blessing of Allah upon His Messenger.\" We used to stay here along with him with light burdens. Few were our rides, and small were our provisions. I performed 'Umra and so did my sister 'A'isha, and Zubair and so and so. And as we touched the House (performed circumambulation and Sa'i) we put off Ihram, and then again put on Ihram in the afternoon for Hajj. Harun (one of the narrators) in one of the narrations said: The freed slave of Asma' and he did not mention 'Abdullah.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "30227",
        "20029",
        "20377",
        "11105",
        "11188"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-3126",
      "hadith_no": "3126",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني حرملة بن يحيى، أخبرنا ابن وهب، أخبرني يونس، وعمرو، ح وحدثني هارون بن سعيد الأيلي، حدثني ابن وهب، أخبرني عمرو، عن ابن شهاب، عن سالم، أنحدثه قال قبل عمر بن الخطاب الحجر ثم قال أم والله لقد علمت أنك حجر ولولا أني رأيت رسول الله صلى الله عليه وسلم يقبلك ما قبلتك ‏.‏ زاد هارون في روايته قال عمرو وحدثني بمثلها زيد بن أسلم عن أبيه أسلم ‏.‏",
      "text_en": " Salim narrated on the authority of his father (Allah be pleased with him) that 'Umar b. al-Khattib (Allah be pleased with him) kissed (the Black Stone) and then said:                      By Allah, I know that you are a stone and if I were not to see Allah's Messenger (may peace be upon him) kissing you, I would not have kissed you. Harun said in his narration: A hadith like this has been transmitted to me by Zaid b. Aslam on the authority of his father Aslam.",
      "usc_msa_ref": "",
      "chain": [
        "30487",
        "20029",
        "20475",
        "11439",
        "30492",
        "20029",
        "20377",
        "11013"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-3307",
      "hadith_no": "3307",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثني أبو الطاهر، أخبرنا عبد الله بن وهب، عن مخرمة، ح وحدثني هارون، بن سعيد الأيلي حدثنا ابن وهب، أخبرني مخرمة بن بكير، عن أبيه، قال سمعت نافعا، مولى ابن عمر يقول سمعت عبد الله بن أبي بكر بن أبي قحافة، يحدث عبد الله بن عمر عن عائشة، زوج النبي صلى الله عليه وسلم أنها قالت سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لولا أن قومك حديثو عهد بجاهلية - أو قال بكفر - لأنفقت كنز الكعبة في سبيل الله ولجعلت بابها بالأرض ولأدخلت فيها من الحجر ‏\"‏ ‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her), wife of Allah's Apostle (may peace be upon him), heard Allah's Messenger (may peace be upon him) as saying:                      If your people, had not been recent converts to Islam, I would have spent the treasure of the Ka'ba in the way of Allah and would have constructed its door just on the level of the ground and would have encompassed in it the space of Hijr.",
      "usc_msa_ref": "",
      "chain": [
        "20029",
        "30492",
        "20029",
        "20517",
        "11154",
        "18"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-3352",
      "hadith_no": "3352",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثني هارون بن سعيد الأيلي، حدثنا ابن وهب، أخبرني عمرو، عن ابن شهاب، عن حميد بن عبد الرحمن، عن أبي هريرة، ح . وحدثني حرملة بن يحيى التجيبي، أخبرنا ابن وهب، أخبرني يونس، أن ابن شهاب، أخبره عن حميد بن عبد الرحمن بن عوف، عن أبي هريرة، قال بعثني أبو بكر الصديق في الحجة التي أمره عليها رسول الله صلى الله عليه وسلم قبل حجة الوداع في رهط يؤذنون في الناس يوم النحر لا يحج بعد العام مشرك ولا يطوف بالبيت عريان ‏.‏ قال ابن شهاب فكان حميد بن عبد الرحمن يقول يوم النحر يوم الحج الأكبر ‏.‏ من أجل حديث أبي هريرة ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported:                      Abu Bakr Siddiq (Allah be pleased with him) sent me during Hajj before the Farewell Pilgrimage for which Allah's Messenger (may peace be upon him) had appointed him an Amir, among a group of people whom he had ordered to make announcement to the people on the Day of Nahr:\" After this year no polytheist may perform the Pilgrimage and no naked person may circumambulate the House.\" Ibn Shihab stated that Humaid b. Abd al-Rahman said that according to this narration of Abu Huraira (Allah be pleased with him) the day of Hajj al-Akbar (Great Hajj) is this Day of Nahr (10th of Dhu'l-Hijja).",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "20029",
        "20377",
        "11013",
        "10561",
        "13",
        "30487",
        "20029",
        "20475",
        "11013",
        "10561",
        "13"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-3354",
      "hadith_no": "3354",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا هارون بن سعيد الأيلي، وأحمد بن عيسى، قالا حدثنا ابن وهب، أخبرني مخرمة بن بكير، عن أبيه، قال سمعت يونس بن يوسف، يقول عن ابن المسيب، قال قالت عائشة إن رسول الله صلى الله عليه وسلم قال ‏\"‏ ما من يوم أكثر من أن يعتق الله فيه عبدا من النار من يوم عرفة وإنه ليدنو ثم يباهي بهم الملائكة فيقول ما أراد هؤلاء ‏\"‏‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her) reported Allah's Messenger (may peace be upon him) as saying:                      There is no day when God sets free more servants from Hell than the Day of 'Arafa. He draws near, then praises them to the angels, saying: What do these want?",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "30227",
        "20029",
        "20517",
        "11154",
        "10987",
        "11002",
        "53"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-3452",
      "hadith_no": "3452",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا هارون بن سعيد الأيلي، حدثنا ابن وهب، حدثني عبد الحميد بن جعفر، أن عمران بن أبي أنس، حدثه أن سلمان الأغر حدثه أنه، سمع أبا هريرة، يخبر أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إنما يسافر إلى ثلاثة مساجد مسجد الكعبة ومسجدي ومسجد إيلياء ‏\"‏ ‏.‏",
      "text_en": " Abu Haraira (Allah be pleased with him) reported Allah's Messenger (way peace be upon him) as saying:                      One should undertake journey to three mosques: the mosque of the Ka'ba, my mosque, and the mosque of Elia (Bait al-Maqdis).",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "20029",
        "11875",
        "10605",
        "11171"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-3627",
      "hadith_no": "3627",
      "source": "Sahih Muslim",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "حدثني هارون بن سعيد الأيلي، حدثنا عبد الله بن وهب، أخبرني معاوية، - يعني ابن صالح - عن علي بن أبي طلحة، عن أبي الوداك، عن أبي سعيد الخدري، سمعه يقول سئل رسول الله صلى الله عليه وسلم عن العزل فقال ‏\"‏ ما من كل الماء يكون الولد وإذا أراد الله خلق شىء لم يمنعه شىء ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id al-Khudri (Allah be pleased with him) reported that Allah's Messenger (may peace be upon him) was asked about 'azl, whereupon he said:                      The child does not come from all the liquid (sermen) and when Allah intends to create anything nothing can prevent it (from coming into existence).",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "20029",
        "20675",
        "10948",
        "10752",
        "38"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-3658",
      "hadith_no": "3658",
      "source": "Sahih Muslim",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "وحدثنا هارون بن سعيد الأيلي، وأحمد بن عيسى، قالا حدثنا ابن وهب، أخبرني مخرمة بن بكير، عن أبيه، قال سمعت عبد الله بن مسلم، يقول سمعت محمد بن مسلم، يقول سمعت حميد بن عبد الرحمن، يقول سمعت أم سلمة، زوج النبي صلى الله عليه وسلم تقول قيل لرسول الله صلى الله عليه وسلم أين أنت يا رسول الله عن ابنة حمزة ‏.‏ أو قيل ألا تخطب بنت حمزة بن عبد المطلب قال ‏\"‏ إن حمزة أخي من الرضاعة ‏\"‏ ‏.‏",
      "text_en": " Umm Salama (Allah be pleased with her), the wife of Allah's Apostle (may peace be upon him), said:                      It was said to the Messenger of Allah (may peace be upon him): Is not the daughter of Hamza a suitable match for you? Or it was said: Why don't you propose to marry the daughter of Hamza, the son of Abd al-Muttalib? Thereupon he said: Hamza is my brother by reason of fosterage.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "30227",
        "20029",
        "20517",
        "11154",
        "11872",
        "167",
        "10561"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-3765",
      "hadith_no": "3765",
      "source": "Sahih Muslim",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "حدثنا هارون بن سعيد الأيلي، حدثنا عبد الله بن وهب، أخبرني سليمان، - يعني ابن بلال - أخبرني يحيى، أخبرني عبيد بن حنين، أنه سمع عبد الله بن عباس، يحدث قال مكثت سنة وأنا أريد، أن أسأل، عمر بن الخطاب عن آية، فما أستطيع أنله حتى خرج حاجا فخرجت معه فلما رجع فكنا ببعض الطريق عدل إلى الأراك لحاجة له فوقفت له حتى فرغ ثم سرت معه فقلت يا أمير المؤمنين من اللتان تظاهرتا على رسول الله صلى الله عليه وسلم من أزواجه فقال تلك حفصة وعائشة ‏.‏ قال فقلت له والله إن كنت لأريد أن أسألك عن هذا منذ سنة فما أستطيع هيبة لك ‏.‏ قال فلا تفعل ما ظننت أن عندي من علم فسلني عنه فإن كنت أعلمه أخبرتك - قال - وقال عمر والله إن كنا في الجاهلية ما نعد للنساء أمرا حتى أنزل الله تعالى فيهن ما أنزل وقسم لهن ما قسم قال فبينما أنا في أمر أأتمره إذ قالت لي امرأتي لو صنعت كذا وكذا فقلت لها وما لك أنت ولما ها هنا وما تكلفك في أمر أريده فقالت لي عجبا لك يا ابن الخطاب ما تريد أن تراجع أنت وإن ابنتك لتراجع رسول الله صلى الله عليه وسلم حتى يظل يومه غضبان ‏.‏ قال عمر فآخذ ردائي ثم أخرج مكاني حتى أدخل على حفصة فقلت لها يا بنية إنك لتراجعين رسول الله صلى الله عليه وسلم حتى يظل يومه غضبان ‏.‏ فقالت حفصة والله إنا لنراجعه ‏.‏ فقلت تعلمين أني أحذرك عقوبة الله وغضب رسوله يا بنية لا يغرنك هذه التي قد أعجبها حسنها وحب رسول الله صلى الله عليه وسلم إياها ‏.‏ ثم خرجت حتى أدخل على أم سلمة لقرابتي منها فكلمتها فقالت لي أم سلمة عجبا لك يا ابن الخطاب قد دخلت في كل شىء حتى تبتغي أن تدخل بين رسول الله صلى الله عليه وسلم وأزواجه ‏.‏ قال فأخذتني أخذا كسرتني عن بعض ما كنت أجد فخرجت من عندها وكان لي صاحب من الأنصار إذا غبت أتاني بالخبر وإذا غاب كنت أنا آتيه بالخبر ونحن حينئذ نتخوف ملكا من ملوك غسان ذكر لنا أنه يريد أن يسير إلينا فقد امتلأت صدورنا منه فأتى صاحبي الأنصاري يدق الباب وقال افتح افتح ‏.‏ فقلت جاء الغساني فقال أشد من ذلك اعتزل رسول الله صلى الله عليه وسلم أزواجه ‏.‏ فقلت رغم أنف حفصة وعائشة ‏.‏ ثم آخذ ثوبي فأخرج حتى جئت فإذا رسول الله صلى الله عليه وسلم في مشربة له يرتقى إليها بعجلة وغلام لرسول الله صلى الله عليه وسلم أسود على رأس الدرجة فقلت هذا عمر ‏.‏ فأذن لي ‏.‏ قال عمر فقصصت على رسول الله صلى الله عليه وسلم هذا الحديث فلما بلغت حديث أم سلمة تبسم رسول الله صلى الله عليه وسلم وإنه لعلى حصير ما بينه وبينه شىء وتحت رأسه وسادة من أدم حشوها ليف وإن عند رجليه قرظا مضبورا وعند رأسه أهبا معلقة فرأيت أثر الحصير في جنب رسول الله صلى الله عليه وسلم فبكيت فقال ‏\"‏ ما يبكيك ‏\"‏ ‏.‏ فقلت يا رسول الله إن كسرى وقيصر فيما هما فيه وأنت رسول الله فقال رسول الله صلى الله عليه وسلم ‏\"‏ أما ترضى أن تكون لهما الدنيا ولك الآخرة ‏\"‏ ‏.‏",
      "text_en": " Abdullah b. Abbas (Allah be pleased with tlicm) reported:                      I intended to ask 'Umar b. al-Khattab (Allah be pleased with him) about a verse, but I waited for one year to ask him out of his fear, until he went out for Pilgrimage and I also accompanied him. As he came back and we were on the way he stepped aside towards an Arak tree to ease himself. I waited for him until he was free. I then walked along with him and said: Commander of the Faithful, who are the two among the wives of Allah's Messenger (may peace be upon him) who backed up one another (in their demand for extra money)? He said: They were Hafsa and 'A'isha (Allah be pleased with them). I said to him: It is for one year that I intended to ask you about this matter but I could not date so on account of the awe for you. He said: Don't do that. If you think that I have any knowledge, do ask me about that. And if I were to know that, I would inform you. He (the narrator) stated that 'Umar had said: By Allah, during the days of ignorance we had no regard for women until Allah the Exalt- ed revealed about them what He has revealed, and appointed (turn) for them what he appointed. He said: It so happened that I was thinking about some matter that my wife said: I wish you had done that and that. I said to her: It does not concern you and you should not feel disturbed in a matter which I intend to do. She said to me: How strange is it that you, O son of Khattab, do not like anyone to retort upon you, whereas your daughter retorts upon Allah's Messenger (may peace be upou him) until he spends the day in vexation. 'Umar said: I took hold of my cloak, then came out of my house until I visited Hafsa and said to her: O daughter, (I heard) that you retort upon Allah's Messenger (may peace be upon him) until he spends the day in vexation, whereupon Hafsa said: By Allah, we do retort upon him. I said: You should bear in mind, my daughter, that I warn you against the punishment of Allah and the wrath of His Messenger (may peace be upon him). You may not be misled by one whose beauty has fascinated her, and the love of Allah's Messenger (may peace be upon him) for her. I ('Umar) then visited Umm Salama because of my relationship with her and I talked to her. Umm Salama said to me: Umar b. al-Khattab, how strange is it that you meddle with every matter so much so that you are anxious to interfere between Allah's Messenger (may peace be upon him) and his wives, and this perturbed me so much that I refrained from saying what I had to say, so I came out of her apartment, and I had a friend from the Anar. When I had been absent (from the company of the Holy Prophet) he used to bring me the news and when he had been absent I used to bring him the news, and at that time we dreaded a king of Ghassan. It was mentioned to us that he intended to attack us, and our minds were haunted by him. My friend, the Ansari, came to me, and he knocked at the door and said: Open it, open it. I said: Has the Ghassani come? He said: (The matter is) more serious than that. The Messenger of Allah (may peace be upon him) has separated himself from his wives. I said: Let the nose of Hafsa and 'A'isha be besmeared with dust. I then took hold of my cloth and went out until I came and found Allah's Messenger (may peace be upon him) in his attic to which he climbed by means of a ladder made of date-palm, and the servant of Allah's Messenger (may peace be upon him) who was black had been sitting at the end of the ladder. I said: This is Umar. So permission was granted to me. I narrated this news to Allah's Messenger (may peace be upon him) and as I narrated the news concerning Umm Salama, Allah's Messenger (may peace be upon him) smiled. He was lying on the mat and there was nothing between him and that (mat), and under his head there was a pillow made of leather and it was stuffed with plam fibres and at his feet were lying a heap of sant tree (acacia niloctica, meant for dyeing) and near his head there was hanging a hide. And I saw the marks of the maton the side of Allah's Messenger (may peace be upon him), and so I wept. He said: What makes you weep? I said: Messenger of Allah, the Khusrau and the Ceasars (spendd their lives in) the midst of (luxuries), whereas you being Allah's Messenger (are leading your life in this poverty). Thereupon Allah's Messenger (may peace be upon him) said: Don't you like that they should have riches of their world, and you have the Hereafter.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "20029",
        "20160",
        "20031",
        "11202",
        "17"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-4009",
      "hadith_no": "4009",
      "source": "Sahih Muslim",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "وحدثني هارون بن سعيد الأيلي، حدثنا ابن وهب، أخبرني عمرو، - وهو ابن الحارث - أن بكيرا، حدثه أن عبد الله بن أبي سلمة حدثه عن النعمان بن أبي عياش، عن جابر بن عبد الله، أن رسول الله صلى الله عليه وسلم نهى عن كراء الأرض ‏.‏  قال بكير وحدثني نافع، أنه سمع ابن عمر، يقول كنا نكري أرضنا ثم تركنا ذلك حين سمعنا حديث رافع بن خديج ‏.‏",
      "text_en": " Jabir b. `Abdullah (Allah be pleased with them) reportedthat Allah's Messenger (may peace be upon him) had forbidden renting of land. Bukair (one of the narrators) said:                      Nafi` reported to me that he heard Ibn `Umar (Allah be pleased with them) saying: We usedto give land on rent; we then abandoned this practice when we heard the hadith of Rafi` b. Khadij.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "20029",
        "20377",
        "11154",
        "10929",
        "11542",
        "34"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-4142",
      "hadith_no": "4142",
      "source": "Sahih Muslim",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا أبو الطاهر، وهارون بن سعيد الأيلي، وأحمد بن عيسى، قالوا حدثنا ابن، وهب أخبرني مخرمة، عن أبيه، قال سمعت سليمان بن يسار، يقول إنه سمع مالك بن، أبي عامر يحدث عن عثمان بن عفان، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا تبيعوا الدينار بالدينارين ولا الدرهم بالدرهمين ‏\"‏ ‏.‏",
      "text_en": " 'Uthman b. 'Affan reported Allah's Messenger (may peace be upon him) as saying:                      Do not sell a dinar for two dinars and one dirham for two dirhams.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "30227",
        "11005",
        "4"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-4258",
      "hadith_no": "4258",
      "source": "Sahih Muslim",
      "chapter": "The Book of Gifts - كتاب الهبات",
      "chapter_no": "25",
      "text_ar": "وحدثني هارون بن سعيد الأيلي، وأحمد بن عيسى، قالا حدثنا ابن وهب، أخبرني عمرو، - وهو ابن الحارث - عن بكير، أنه سمع سعيد بن المسيب، يقول سمعت ابن عباس، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إنما مثل الذي يتصدق بصدقة ثم يعود في صدقته كمثل الكلب يقيء ثم يأكل قيأه ‏\"‏ ‏.‏",
      "text_en": " Ibn Abbas (Allah be pleased with them) reported:                      I heard Allah's Messenger (may peace be upon him) say: The similitude of one who gives a charity and then gets it back is like that of a dog which vomits and then eats its vomit.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "30227",
        "20029",
        "20377",
        "11154",
        "11002",
        "17"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-4293",
      "hadith_no": "4293",
      "source": "Sahih Muslim",
      "chapter": "The Book of Bequests - كتاب الوصية",
      "chapter_no": "26",
      "text_ar": "وحدثنا أبو كامل الجحدري، حدثنا حماد يعني ابن زيد، ح وحدثني زهير بن، حرب حدثنا إسماعيل، - يعني ابن علية - كلاهما عن أيوب، ح وحدثني أبو الطاهر، أخبرنا ابن وهب، أخبرني يونس، ح وحدثني هارون بن سعيد الأيلي، حدثنا ابن وهب، أخبرني أسامة بن زيد الليثي، ح وحدثنا محمد بن رافع، حدثنا ابن أبي فديك، أخبرنا هشام، - يعني ابن سعد - كلهم عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم ‏.‏ بمثل حديث عبيد الله وقالوا جميعا ‏\"‏ له شىء يوصي فيه ‏\"‏ ‏.‏ إلا في حديث أيوب فإنه قال ‏\"‏ يريد أن يوصي فيه ‏\"‏ ‏.‏ كرواية يحيى عن عبيد الله ‏.‏",
      "text_en": " A hadith like this have been narrated on the authority of Nafi', who based his narrations of the words of Ibn 'Umar but with a slight variation of words.",
      "usc_msa_ref": "",
      "chain": [
        "30559",
        "20022",
        "30022",
        "20208",
        "11015",
        "20029",
        "20475",
        "30492",
        "20029",
        "20500",
        "30375",
        "20172"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-4342",
      "hadith_no": "4342",
      "source": "Sahih Muslim",
      "chapter": "The Book of Vows - كتاب النذر",
      "chapter_no": "27",
      "text_ar": "وحدثني هارون بن سعيد الأيلي، ويونس بن عبد الأعلى، وأحمد بن عيسى، قال يونس أخبرنا وقال الآخران، حدثنا ابن وهب، أخبرني عمرو بن الحارث، عن كعب بن، علقمة عن عبد الرحمن بن شماسة، عن أبي الخير، عن عقبة بن عامر، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ كفارة النذر كفارة اليمين ‏\"‏ ‏.‏",
      "text_en": " 'Uqba. b. Amir reported Allah's Messenger (may peace be upon him) as saying:                      The expiation of the (breach of) a vow is the same as that of the (breach of an oath).",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "30227",
        "20475",
        "20029",
        "20377",
        "10872",
        "10867",
        "11410",
        "189"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-4409",
      "hadith_no": "4409",
      "source": "Sahih Muslim",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "وحدثني زهير بن حرب، ومحمد بن المثنى، قالا حدثنا يحيى، وهو القطان ح وحدثنا ابن نمير، حدثنا أبي ح، وحدثنا أبو بكر بن أبي شيبة، حدثنا ابن نمير، وأبو أسامة كلهم عن عبيد الله، ح وحدثنا هارون بن سعيد الأيلي، حدثنا ابن وهب، حدثني أسامة، جميعا عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم بمثل حديث مالك ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Ibn 'Umar through another chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "30170",
        "20031",
        "20031",
        "30212",
        "20331",
        "30201",
        "30212",
        "11201",
        "30492",
        "20029",
        "11014",
        "18"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-4495",
      "hadith_no": "4495",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Punishments Prescribed by Islam - كتاب الحدود",
      "chapter_no": "30",
      "text_ar": "وحدثني أبو الطاهر، وهارون بن سعيد الأيلي، وأحمد بن عيسى، - واللفظ لهارون وأحمد - قال أبو الطاهر أخبرنا وقال الآخران، حدثنا ابن وهب، أخبرني مخرمة، عن أبيه، عن سليمان بن يسار، عن عمرة، أنها سمعت عائشة، تحدث أنها سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا تقطع اليد إلا في ربع دينار فما فوقه ‏\"‏ ‏.‏",
      "text_en": " 'A'isha reported:                      I heard Allah's Messenger (may peace be upon him) as saying: The hand (of a thief) should not be cut off but for a quarter of a dinar and what is above that.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "30227",
        "20029",
        "11005",
        "11455"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-4543",
      "hadith_no": "4543",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Punishments Prescribed by Islam - كتاب الحدود",
      "chapter_no": "30",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وإسحاق بن إبراهيم، جميعا عن ابن عيينة، ح وحدثنا عبد بن حميد، أخبرنا محمد بن بكر البرساني، أخبرنا هشام بن حسان، كلاهما عن أيوب بن موسى، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، وابن، نمير عن عبيد الله بن عمر، ح وحدثني هارون بن سعيد الأيلي، حدثنا ابن وهب، حدثني أسامة، بن زيد ح وحدثنا هناد بن السري، وأبو كريب وإسحاق بن إبراهيم عن عبدة بن سليمان، عن محمد بن إسحاق، كل هؤلاء عن سعيد المقبري، عن أبي هريرة، عن النبي صلى الله عليه وسلم إلا أن ابن إسحاق قال في حديثه عن سعيد عن أبيه عن أبي هريرة عن النبي صلى الله عليه وسلم في جلد الأمة إذا زنت ثلاثا ‏\"‏ ثم ليبعها في الرابعة ‏\"‏ ‏.‏",
      "text_en": " This hadith his been narrated on the authority of Abu Huraira through another chain of transmitters with a slight variation of words.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30123",
        "20005",
        "30553",
        "20277",
        "11311",
        "11241",
        "30201",
        "20318",
        "30212",
        "11201",
        "30492"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-4660",
      "hadith_no": "4660",
      "source": "Sahih Muslim",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "وحدثناه أبو الربيع، وأبو كامل قالا حدثنا حماد، عن أيوب، ح وحدثنا ابن المثنى، حدثنا ابن أبي عدي، عن ابن عون، قال كتبت إلى نافع أسأله عن النفل، فكتب إلى أن4661 - وحدثنا ابن رافع، حدثنا عبد الرزاق، أخبرنا ابن جريج، أخبرني موسى، ح وحدثنا هارون بن سعيد الأيلي، حدثنا ابن وهب، أخبرني أسامة بن زيد، كلهم عن نافع، بهذا الإسناد نحو حديثهم ‏.‏",
      "text_en": " Ibn Aun said:                      I wrote to Nafi' asking him about Nafl (spoils of war) and be wrote to me that Ibn 'Umar was among that expedition. (The rest of the hadith is the same.)",
      "usc_msa_ref": "",
      "chain": [
        "30137",
        "20022",
        "11015",
        "20276",
        "11071",
        "20121",
        "11070",
        "20040",
        "30492",
        "20029",
        "50"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-4826",
      "hadith_no": "4826",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثني هارون بن سعيد الأيلي، حدثنا ابن وهب، حدثني حرملة، عن عبد الرحمن، بن شماسة قال أتيت عائشة أسألها عن شىء، فقالت ممن أنت فقلت رجل من أهل مصر ‏.‏ فقالت كيف كان صاحبكم لكم في غزاتكم هذه فقال ما نقمنا منه شيئا إن كان ليموت للرجل منا البعير فيعطيه البعير والعبد فيعطيه العبد ويحتاج إلى النفقة فيعطيه النفقة فقالت أما إنه لا يمنعني الذي فعل في محمد بن أبي بكر أخي أن أخبرك ما سمعت من رسول الله صلى الله عليه وسلم يقول في بيتي هذا ‏\"‏ اللهم من ولي من أمر أمتي شيئا فشق عليهم فاشقق عليه ومن ولي من أمر أمتي شيئا فرفق بهم فارفق به ‏\"‏ ‏.‏",
      "text_en": " It has been reported on the authority of Abd al-Rahman b. Shumasa who said:                      I came to A'isha to inquire something from her. She said: From which people art thou? I said: I am from the people of Egypt. She said: What was the behaviour of your governor towards you in this war of yours? I said: We did not experience anything bad from him. If the camel of a man from us died, he would bestow on him a camel. If any one of us lost his slave, he would give him a slave. If anybody was in need of the basic necessities of life, he would provide them with provisions. She said: Behold! the treatment that was meted out to my brother, Muhammad b. Abu Bakr, does not prevent me from telling you what I heard from the Messenger of Allah (may peace be upon him). He said in this house of mine: O God, who (happens to) acquire some kind of control over the affairs of my people and is hard upon them-be Thou hard upon him, and who (happens to) acquire some kind of control over the affairs of my people and is kind to them-be Thou kind to him.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "20029",
        "30487",
        "10867"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-4942",
      "hadith_no": "4942",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثني هارون بن سعيد الأيلي، وأبو الطاهر، قال أبو الطاهر أخبرنا وقال، هارون حدثنا ابن وهب، حدثني مالك، عن ابن شهاب، عن عروة، أن عائشة، أخبرته عن بيعة النساء، قالت ما مس رسول الله صلى الله عليه وسلم بيده امرأة قط إلا أن يأخذ عليها فإذا أخذ عليها فأعطته قال ‏\"‏ اذهبي فقد بايعتك ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of 'Urwa that 'A'isha described to him the way the Holy Prophet (may peace be upon him) took the oath of fealty from women. She said:                      The Messenger of Allah (may peace be upon him) never touched a woman with his hand. He would only take a vow from her and when he had taken the (verbal) vow, he would say: You may go. I have accepted your fealty.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "20029",
        "20001",
        "11013",
        "10511",
        "53"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-4954",
      "hadith_no": "4954",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا قتيبة، وابن، رمح عن الليث بن سعد، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، وعبد الله بن نمير، ح وحدثنا ابن نمير، حدثنا أبي ح، وحدثنا عبيد، الله بن سعيد حدثنا يحيى، كلهم عن عبيد الله، ح وحدثنا هارون بن سعيد الأيلي، حدثنا  ابن وهب، حدثني أسامة، كلهم عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم ‏.‏ بمثل حديث مالك عن نافع ‏.‏",
      "text_en": " The same tradition has been handed down through a different chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "30490",
        "20023",
        "30201",
        "20345",
        "20331",
        "30212",
        "20331",
        "30359",
        "11201",
        "30492",
        "20029"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-5099",
      "hadith_no": "5099",
      "source": "Sahih Muslim",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثني هارون بن سعيد الأيلي، حدثنا ابن وهب، أخبرنا عمرو، - يعني ابن الحارث - أن ابن شهاب، حدثه عن أبي إدريس الخولاني، عن أبي ثعلبة الخشني، أنالله عليه وسلم نهى عن أكل كل ذي ناب من السباع ‏.‏",
      "text_en": " Abu Tha'laba al-Khushani reported Allah's Messenger (may peace be upon him) having prohibited the eating of all fanged beasts of prey. This hadith has been narrated through another chain of transmitters, but with a slight variation of words.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "20029",
        "20377",
        "11013",
        "11027",
        "4056"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-5656",
      "hadith_no": "5656",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "وحدثناه قتيبة، وابن، رمح عن الليث بن سعد، ح وحدثنا إسحاق بن إبراهيم،أخبرنا الثقفي، حدثنا أيوب، ح وحدثنا عبد الوارث بن عبد الصمد، حدثنا أبي، عن جدي،عن أيوب، ح وحدثنا هارون بن سعيد الأيلي، حدثنا ابن وهب، أخبرني أسامة بن زيد،ح وحدثني أبو بكر بن إسحاق، حدثنا أبو سلمة الخزاعي، أخبرنا عبد العزيز بن أخي،الماجشون عن عبيد الله بن عمر، كلهم عن نافع، عن القاسم، عن عائشة، بهذا الحديثوبعضهم أتم حديثا له من بعض ‏.‏ وزاد في حديث ابن أخي الماجشون قالت فأخذتهفجعلته مرفقتين فكان يرتفق بهما في البيت ‏.‏",
      "text_en": " This hadith has been narrated on the authority of A'isha through another chain of transmitters also. Some of the other ahadith narrated through other chains of transmitters are more complete and there is an addition in them (transmitted through other chains of transmitters). In the hadith transmitted on the authority of the nephew of Majishun she (A'isha) is reported to have said:                      I took it and prepared two cushions out of that and he (the Holy Prophet) used to recline against them in the house.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "30490",
        "20023",
        "11015",
        "30492",
        "20029",
        "11108",
        "30279"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-5883",
      "hadith_no": "5883",
      "source": "Sahih Muslim",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "وحدثني هارون بن سعيد الأيلي، أخبرنا ابن وهب، حدثني مالك، ح وحدثنا محمد، بن رافع حدثنا ابن أبي فديك، أخبرنا الضحاك، - يعني ابن عثمان - كلاهما عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ الحمى من فيح جهنم فأطفئوها بالماء ‏\"‏ ‏.‏",
      "text_en": " Ibn Umar reported Allah's Messenger (may peace be upon him) as saying:                      Fever is from the vehement raging of the fire of Hell, so extinguish it with water.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "20029",
        "20001",
        "30375",
        "20172",
        "20504",
        "11014",
        "18"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-5971",
      "hadith_no": "5971",
      "source": "Sahih Muslim",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "وحدثنا هارون بن سعيد الأيلي، حدثنا ابن وهب، حدثني أسامة، أن نافعا، حدثه  أن أبا لبابة مر بابن عمر وهو عند الأطم الذي عند دار عمر بن الخطاب يرصد حية بنحو حديث الليث بن سعد ‏.‏",
      "text_en": " Nafi' reported that Abu Lubaba happened to pass by Ibn 'Umar who lived in the fortified place near the house of 'Umar b. Khattab and was busy in keeping his eyes upon a snake and killing it, the rest of the hadith is the same.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "20029",
        "50",
        "11014"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-6021",
      "hadith_no": "6021",
      "source": "Sahih Muslim",
      "chapter": "The Book Concerning the Use of Correct Words - كتاب الألفاظ من الأدب وغيرها",
      "chapter_no": "41",
      "text_ar": "حدثني هارون بن سعيد الأيلي، وأبو طاهر وأحمد بن عيسى قال أحمد حدثنا  وقال الآخران، أخبرنا ابن وهب، أخبرني مخرمة، عن أبيه، عن نافع، قال كان ابن عمر إذا استجمر استجمر بالألوة غير مطراة وبكافور يطرحه مع الألوة ثم قال هكذا كان يستجمر رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Nafi' reported that when Ibn Umar wanted fumigation he got it from aloeswood without mixing anything with it, or he put camphor along with aloeswood and then said:                      This is how Allah's Messenger (may peace be upon him) fumigated.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "30007",
        "20029",
        "11014"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-6110",
      "hadith_no": "6110",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثنا هارون بن سعيد الأيلي، حدثنا ابن وهب، أخبرني أسامة، عن أبي حازم، عن سهل، عن النبي صلى الله عليه وسلم وعن النعمان بن أبي عياش، عن أبي سعيد، الخدري عن النبي صلى الله عليه وسلم بمثل حديث يعقوب ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Abu Sa'id Khudri through another chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "20029",
        "50",
        "11172",
        "399"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-6657",
      "hadith_no": "6657",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثني أبو الطاهر، أخبرنا ابن وهب، أخبرني حرملة، ح وحدثني هارون بن، سعيد الأيلي حدثنا ابن وهب، حدثني حرملة، - وهو ابن عمران التجيبي - عن عبد الرحمن، بن شماسة المهري قال سمعت أبا ذر، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ إنكم ستفتحون أرضا يذكر فيها القيراط فاستوصوا بأهلها خيرا فإن لهم ذمة ورحما فإذا رأيتم رجلين يقتتلان في موضع لبنة فاخرج منها ‏\"‏ ‏.‏ قال فمر بربيعة وعبد الرحمن ابنى شرحبيل بن حسنة يتنازعان في موضع لبنة فخرج منها ‏.‏",
      "text_en": " Abu Dharr reported Allah's Messenger (may peace be upon him) as saying:                      You would soon conquer a land where people are in the habit of using foul language. They have a right of kinship upon you. And when you see two persons fighting for the space of a brick, then get out of that. He (Abu Dharr) then happened to pass by Rabila and 'Abd al-Rahman, the two sons of Shurahbil b. Hasana, and they had been disputing for the space of a brick. So he left the land.",
      "usc_msa_ref": "",
      "chain": [
        "20029",
        "30487",
        "30492",
        "20029",
        "20622",
        "10867",
        "23"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-6681",
      "hadith_no": "6681",
      "source": "Sahih Muslim",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثني هارون بن سعيد الأيلي، حدثنا عبد الله بن وهب، حدثني معاوية، - يعني ابن صالح - عن عبد الرحمن بن جبير بن نفير، عن أبيه، عن نواس بن سمعان، قال أقمت مع رسول الله صلى الله عليه وسلم بالمدينة سنة ما يمنعني من الهجرة إلا المسألة كان أحدنا إذا هاجر لم يسأل رسول الله صلى الله عليه وسلم عن شىء - قال - فسألته عن البر والإثم فقال رسول الله صلى الله عليه وسلم ‏\"‏ البر حسن الخلق والإثم ما حاك في نفسك وكرهت أن يطلع عليه الناس ‏\"‏ ‏.‏",
      "text_en": " Nawwas b. Sam'an reported:                      I stayed with Allah's Messenger (may peace be upon him) for one year. What obstructed me to migrate was (nothing) but (persistent) inquiries from him (about Islam). (It was a common observation) that when anyone of us migrated (to Medina) he ceased to ask (too many questions) from Allah's Messenger (may peace be upon him). So I asked him about virtue and vice. Thereupon Allah's Messenger (may peace be upon him) said: Virtue is a kind disposition and vice is what rankles in your mind and that you disapprove of its being known to the people.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "20029",
        "20675",
        "10942"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-6773",
      "hadith_no": "6773",
      "source": "Sahih Muslim",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا هارون بن سعيد الأيلي، حدثنا ابن وهب، أخبرني سليمان، - وهو ابن بلال - عن العلاء بن عبد الرحمن، حدثه عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا ينبغي لصديق أن يكون لعانا ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      It does not seem proper for Siddiq that he should be an invoker of curse. This hadith has been narrated on the authority of Abu Kuraib with the same chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "20029",
        "20160",
        "10606",
        "11884",
        "13"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-6874",
      "hadith_no": "6874",
      "source": "Sahih Muslim",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا يعقوب، - يعني ابن عبد الرحمن القاري - وقال قتيبة حدثنا عبد العزيز يعني الدراوردي، ح وحدثناه سعيد بن عمرو الأشعثي، أخبرنا  عبثر، عن العلاء بن المسيب، ح وحدثني هارون بن سعيد الأيلي، حدثنا ابن وهب، حدثني  مالك، - وهو ابن أنس - كلهم عن سهيل، بهذا الإسناد غير أن حديث، العلاء بن المسيب ليس فيه ذكر البغض ‏.‏",
      "text_en": " This hadith has been reported on the authority of Suhail with the same chain of transmitters except with this variation that in the hadith transmitted on the authority of 'Ali' b. Musayyib, there is no mention of (the word)\" Anger\".",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20185",
        "30367",
        "20167",
        "30465",
        "11647",
        "30492",
        "20029"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-7140",
      "hadith_no": "7140",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Repentance and Exhortation to Repentance - كتاب التوبة",
      "chapter_no": "51",
      "text_ar": "حدثنا هارون بن سعيد الأيلي، حدثنا ابن وهب، حدثني عياض، - وهو ابن عبد الله الفهري - حدثني إبراهيم بن عبيد بن رفاعة، عن محمد بن كعب القرظي، عن  أبي صرمة، عن أبي أيوب الأنصاري، عن رسول الله صلى الله عليه وسلم أنه قال ‏\"‏ لو أنكم لم تكن لكم ذنوب يغفرها الله لكم لجاء الله بقوم لهم ذنوب يغفرها لهم ‏\"‏ ‏.‏",
      "text_en": " Abu Ayyub Ansari reported that Allah's Messenger (may peace be upon him) said:                      If you were not to commit sins, Allah would have swept you out of existence and would have replaced you by another people who have committed sin, and then asked forgiveness from Allah, and He would have granted them pardon.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "20029",
        "20514",
        "11826",
        "11221",
        "33"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-7288",
      "hadith_no": "7288",
      "source": "Sahih Muslim",
      "chapter": "The Book Giving Description of the Day of Judgement; Paradise and Hell - كتاب صفة القيامة والجنة والنار",
      "chapter_no": "53",
      "text_ar": "حدثني هارون بن سعيد الأيلي، حدثنا ابن وهب، أخبرني أبو صخر، عن ابن، قسيط حدثه أن عروة حدثه أن عائشة زوج النبي صلى الله عليه وسلم حدثته أن رسول الله صلى الله عليه وسلم خرج من عندها ليلا ‏.‏ قالت فغرت عليه فجاء فرأى ما أصنع فقال ‏\"‏ ما لك يا عائشة أغرت ‏\"‏ ‏.‏ فقلت وما لي لا يغار مثلي على مثلك فقال رسول الله صلى الله عليه وسلم ‏\"‏ أقد جاءك شيطانك ‏\"‏ ‏.‏ قالت يا رسول الله أومعي شيطان قال ‏\"‏ نعم ‏\"‏ ‏.‏ قلت ومع كل إنسان قال ‏\"‏ نعم ‏\"‏ ‏.‏ قلت ومعك يا رسول الله قال ‏\"‏ نعم ولكن ربي أعانني عليه حتى أسلم ‏\"‏ ‏.‏",
      "text_en": " A'isha the wife of Allah's Apostle (may peace be upon him), reported that one day Allah's Messenger (may peace be upon him) came out of her (apartment) during the night and she felt jealous. Then he came and he saw me (in what agitated state of mind) I was. He said:                      A'isha, what has happened to you? Do you feel jealous? Thereupon she said: How can it he (that a woman like me) should not feel jealous in regard to a husband like you. Thereupon Allah's Messenger (may peace be upon him) said: It was your devil who had come to you, and she said: Allah's Mes- senger, is there along with me a devil? He said: Yes. I said: Is devil attached to everyone? He said: Yes. I (Aisha) again said: Allah's Messenger, is it with you also? He said: Yes, but my Lord has helped me against him and as such I am ab solutely safe from his mischief.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "20029",
        "11236",
        "10511"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-7304",
      "hadith_no": "7304",
      "source": "Sahih Muslim",
      "chapter": "The Book Giving Description of the Day of Judgement; Paradise and Hell - كتاب صفة القيامة والجنة والنار",
      "chapter_no": "53",
      "text_ar": "حدثنا هارون بن معروف، وهارون بن سعيد الأيلي، قالا حدثنا ابن وهب، أخبرني  أبو صخر، عن ابن قسيط، عن عروة بن الزبير، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم إذا صلى قام حتى تفطر رجلاه قالت عائشة يا رسول الله أتصنع هذا وقد غفر لك ما تقدم من ذنبك وما تأخر فقال ‏\"‏ يا عائشة أفلا أكون عبدا شكورا ‏\"‏ ‏.‏",
      "text_en": " A'isha reported that when Allah's Messenger (may peace be upon him) occupied himself in prayer, he observed such a (long) qiylm (posture of standing in prayer) that his feet were swollen. A'isha said:                      Allah's Messenger you do this (in spite of the fact) that your earlier and later sins have been pardoned for you? Thereupon, he said. A'isha should I not prove myself to be a thanksgiving servant (of Allah)?",
      "usc_msa_ref": "",
      "chain": [
        "30280",
        "30492",
        "20029",
        "11236",
        "10511",
        "53"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-7311",
      "hadith_no": "7311",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "حدثني هارون بن سعيد الأيلي، حدثنا ابن وهب، حدثنا مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏\"‏ قال الله عز وجل أعددت لعبادي الصالحين ما لا عين رأت ولا أذن سمعت ولا خطر على قلب بشر ذخرا بله ما أطلعكم الله عليه ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported that Allah's Apostle (may peace be upon him) said:                      Allah, the Exalted and Glorious, said: I have prepared for My pious servants which no eye (has ever) seen, no ear has (ever) heard and no human heart has ever perceived those bounties leaving apart (those bounties) about which Allah has informed you.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "20029",
        "20001",
        "11061",
        "11197",
        "13"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-7313",
      "hadith_no": "7313",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "حدثنا هارون بن معروف، وهارون بن سعيد الأيلي، قالا حدثنا ابن وهب، حدثني  أبو صخر، أن أبا حازم، حدثه قال سمعت سهل بن سعد الساعدي، يقول شهدت من رسول الله صلى الله عليه وسلم مجلسا وصف فيه الجنة حتى انتهى ثم قال صلى الله عليه وسلم في آخر حديثه ‏\"‏ فيها ما لا عين رأت ولا أذن سمعت ولا خطر على قلب بشر ‏\"‏ ‏.‏ ثم اقترأ هذه الآية ‏{‏ تتجافى جنوبهم عن المضاجع يدعون ربهم خوفا وطمعا ومما رزقناهم ينفقون * فلا تعلم نفس ما أخفي لهم من قرة أعين جزاء بما كانوا يعملون‏}‏ ‏.‏",
      "text_en": " Sahl b. Sa'd as-Sa'idi reported:                      I was in the company of Allah's Messenger (may peace be upon him) that he gave a description of Paradise and then Allah's Apostle (may peace be upon him) concluded with these words: There would be bounties which the eye has not seen and the ear has not heard and no human heart has ever perceived them. He then recited this verse:\" They forsake (their) beds, calling upon their Lord in fear and in hope, and spend out of what We have given them. So no soul knows what refreshment of the eyes is hidden for them: a reward for what they did\" (xxxii. 16-17)",
      "usc_msa_ref": "",
      "chain": [
        "30280",
        "30492",
        "20029",
        "11172",
        "399"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-7363",
      "hadith_no": "7363",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "حدثني هارون بن سعيد الأيلي، وحرملة بن يحيى، قالا حدثنا ابن وهب، حدثني  عمر بن محمد بن زيد بن عبد الله بن عمر بن الخطاب، أن أباه، حدثه عن عبد الله بن، عمر أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا صار أهل الجنة إلى الجنة وصار أهل النار إلى النار أتي بالموت حتى يجعل بين الجنة والنار ثم يذبح ثم ينادي مناد يا أهل الجنة لا موت ويا أهل النار لا موت ‏.‏ فيزداد أهل الجنة فرحا إلى فرحهم ويزداد أهل النار حزنا إلى حزنهم ‏\"‏ ‏.‏",
      "text_en": " Umar b. Muhammad b. Zaid b. 'Abdullah b. 'Umar b. al-Khattab reported on the authority of his father Abdullah b. Umar that Allah's Messenger (may peace big upon him) said:                      When the inmates of Paradise would go to Paradise and the inmates of Hell would go to Hell, death would be called and it would be placed between the Paradise and the Hell and then slaughtered and then the announcer would announce: 0 inmates of Paradise, no death 0 Inmates of Hell-Fire, no death. And it would in. crease the delight of the inmates of Paradise and it would increase the grief of the inmates of Hell-Fire.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "30487",
        "20029",
        "18"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-7661",
      "hadith_no": "7661",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "حدثني هارون بن سعيد الأيلي، وأحمد بن عيسى، قالا حدثنا ابن وهب، أخبرني  عمرو، - وهو ابن الحارث - أن بكيرا، حدثه أن عاصم بن عمر بن قتادة حدثه أنه، سمع  عبيد الله الخولاني، يذكر أنه سمع عثمان بن عفان، عند قول الناس فيه حين بنى مسجد رسول الله صلى الله عليه وسلم إنكم قد أكثرتم وإني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من بنى مسجدا - قال بكير حسبت أنه قال - يبتغي به وجه الله بنى الله له مثله في الجنة ‏\"‏ ‏.‏ وفي رواية هارون ‏\"‏ بنى الله له بيتا في الجنة ‏\"‏ ‏.‏",
      "text_en": " Abdullah al-Khaulani reported that when Uthman b. 'Affan tried to rebuild the mosque of Allah's Messenger (may peace be upon him) the people began to talk about this. Uthman b. 'Affan said:                      You discuss it very much whereas I have heard Allah's Messenger (may peace be upon him) as saying: He who builds a mosque-- and the narrator Bukair said: I think he also said: (for) seeking the pleasure of Allah- Allah would build (a similar house for him in Paradise). and in the narration of Harun (the words are):\" A house for him in Paradise.\"",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "30227",
        "20029",
        "20377",
        "11154",
        "11103",
        "11201"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sunan-abi-daud-1173",
      "hadith_no": "1173",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Book Of The Prayer For Rain (Kitab al-Istisqa') - كتاب الاستسقاء",
      "chapter_no": "3",
      "text_ar": "حدثنا هارون بن سعيد الأيلي، حدثنا خالد بن نزار، حدثني القاسم بن مبرور، عن يونس، عن هشام بن عروة، عن أبيه، عن عائشة، - رضى الله عنها - قالت شكى الناس إلى رسول الله صلى الله عليه وسلم قحوط المطر فأمر بمنبر فوضع له في المصلى ووعد الناس يوما يخرجون فيه قالت عائشة فخرج رسول الله صلى الله عليه وسلم حين بدا حاجب الشمس فقعد على المنبر فكبر صلى الله عليه وسلم وحمد الله عز وجل ثم قال ‏\"‏ إنكم شكوتم جدب دياركم واستئخار المطر عن إبان زمانه عنكم وقد أمركم الله عز وجل أن تدعوه ووعدكم أن يستجيب لكم ‏\"‏ ‏.‏ ثم قال ‏\"‏ ‏{‏ الحمد لله رب العالمين * الرحمن الرحيم * ملك يوم الدين ‏}‏ لا إله إلا الله يفعل ما يريد اللهم أنت الله لا إله إلا أنت الغني ونحن الفقراء أنزل علينا الغيث واجعل ما أنزلت لنا قوة وبلاغا إلى حين ‏\"‏ ‏.‏ ثم رفع يديه فلم يزل في الرفع حتى بدا بياض إبطيه ثم حول على الناس ظهره وقلب أو حول رداءه وهو رافع يديه ثم أقبل على الناس ونزل فصلى ركعتين فأنشأ الله سحابة فرعدت وبرقت ثم أمطرت بإذن الله فلم يأت مسجده حتى سالت السيول فلما رأى سرعتهم إلى الكن ضحك صلى الله عليه وسلم حتى بدت نواجذه فقال ‏\"‏ أشهد أن الله على كل شىء قدير وأني عبد الله ورسوله ‏\"‏ ‏.‏ قال أبو داود وهذا حديث غريب إسناده جيد أهل المدينة يقرءون ‏{‏ ملك يوم الدين ‏}‏ وإن هذا الحديث حجة لهم ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     The people complained to the Messenger of Allah (ﷺ) of the lack of rain, so he gave an order for a pulpit. It was then set up for him in the place of prayer. He fixed a day for the people on which they should come out.  Aisha said: The Messenger of Allah (ﷺ), when the rim of the sun appeared, sat down on the pulpit, and having pronounced the greatness of Allah and expressed His praise, he said: You have complained of drought in your homes, and of the delay in receiving rain at the beginning of its season. Allah has ordered you to supplicate Him has and promised that He will answer your prayer.  Then he said: Praise be to Allah, the Lord of the Universe, the Compassionate, the Merciful, the Master of the Day of Judgment. There is no god but Allah Who does what He wishes. O Allah, Thou art Allah, there is no deity but Thou, the Rich, while we are the poor. Send down the rain upon us and make what Thou sendest down a strength and satisfaction for a time.  He then raised his hands, and kept raising them till the whiteness under his armpits was visible. He then turned his back to the people and inverted or turned round his cloak while keeping his hands aloft. He then faced the people, descended and prayed two rak'ahs.  Allah then produced a cloud, and the storm of thunder and lightning came on. Then the rain fell by Allah's permission, and before he reached his mosque streams were flowing. When he saw the speed with which the people were seeking shelter, he (ﷺ) laughed till his back teeth were visible.  Then he said: I testify that Allah is Omnipotent and that I am Allah's servant and apostle.Abu Dawud said: This is a ghraib (rate) tradition, but its chain is sound. The people of Medina recite \"maliki\" (instead of maaliki) yawm al-din\" (the master of the Day of Judgement). But this tradition (in which the word maalik occurs) is an evidence for them.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "28156",
        "28488",
        "20475",
        "11065",
        "10511",
        "53"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-ibn-majah-1366",
      "hadith_no": "1366",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا هارون بن سعيد الأيلي، حدثنا عبد الله بن وهب، أخبرني سليمان بن بلال، عن يحيى بن سعيد، عن أنس بن مالك، أن رسول الله  صلى الله عليه وسلم  صلى العيد بالمصلى مستترا بحربة ‏.‏",
      "text_en": " It wasnarrated from Anas bin Malik that the Messenger of Allah (ﷺ)prayed‘Eid at the prayer place, using a small spear as a Sutrah.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "20029",
        "20160",
        "11062",
        "19"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    }
  ],
  "total_hadiths": 94,
  "grade_display": {
    "en": "3rd Century AH [10th Generation]",
    "ar": "القرن الثالث الهجري [الجيل العاشر]",
    "ckb": "سەدەی سێیەمی كۆچی [نەوەی دەیەم]"
  }
}