{
  "id": "30491",
  "name": "Muhammad bin Salmah bin محمد بن سلمة",
  "full_name": "Muhammad bin Salmah bin محمد بن سلمة",
  "grade": "3rd Century AH [11th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "248",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Egypt"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  د  س  ق  -  ثقة ثبت ]"
    ],
    "tags": [
      "al-Masri"
    ],
    "area_of_interest_display": [
      {
        "en": "Narrator[Grade:Thiqah] [ م  د  س  ق  -  ثقة ثبت ]",
        "ar": "Narrator[Grade:Thiqah] [ م  د  س  ق  -  ثقة ثبت ]",
        "ckb": "Narrator[Grade:Thiqah] [ م  د  س  ق  -  ثقة ثبت ]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "Egypt",
        "ar": "مصر",
        "ckb": "میسر"
      }
    ],
    "tags_display": [
      {
        "en": "al-Masri",
        "ar": "al-Masri",
        "ckb": "al-Masri"
      }
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "id": "sahih-muslim-241",
      "hadith_no": "241",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثني حرملة بن يحيى، وعمرو بن سواد العامري، ومحمد بن سلمة المرادي، قال المرادي حدثنا عبد الله بن وهب، عن يونس، وقال الآخران، أخبرنا ابن وهب، قال أخبرني يونس، عن ابن شهاب، قال حدثني عبيد الله بن عبد الله بن عتبة، أن أبا هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ألم تروا إلى ما قال ربكم قال ما أنعمت على عبادي من نعمة إلا أصبح فريق منهم بها كافرين ‏.‏ يقولون الكواكب وبالكواكب ‏\"‏ ‏.‏",
      "text_en": " It is reported on the authority of Abu Huraira that the Messenger of Allah (may peace and blessings be upon him) said:                      Don't you know what your Lord said? He observed: I have never endowed My bondsmen with a favor, but a section amongst them disbelieved it and said: Stars, it was due to the stars.",
      "usc_msa_ref": "",
      "chain": [
        "30487",
        "30443",
        "30491",
        "20029",
        "20475",
        "20029",
        "20475",
        "11013",
        "11004",
        "13"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-242",
      "hadith_no": "242",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني محمد بن سلمة المرادي، حدثنا عبد الله بن وهب، عن عمرو بن الحارث، ح وحدثني عمرو بن سواد، أخبرنا عبد الله بن وهب، أخبرنا عمرو بن الحارث، أن أبا يونس، مولى أبي هريرة حدثه عن أبي هريرة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ ما أنزل الله من السماء من بركة إلا أصبح فريق من الناس بها كافرين ينزل الله الغيث فيقولون الكوكب كذا وكذا ‏\"‏ وفي حديث المرادي ‏\"‏ بكوكب كذا وكذا ‏\"‏ ‏.‏",
      "text_en": " It is reported on the authority of Abu Huraira that the Messenger of Allah (may peace and blessing be upon him) observed:                      Allah does not shower His blessings from the heaven that in the morning a group of men disbelieve it (to be a blessing from Allah). Allah sends down rain, but they (the disbelievers) say: Such and such star (is responsible for that).",
      "usc_msa_ref": "",
      "chain": [
        "30491",
        "20029",
        "20377",
        "30443",
        "20029",
        "20377",
        "13"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-334-3",
      "hadith_no": "334",
      "source": "Sahih Muslim",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثنا محمد بن سلمة المرادي، حدثنا عبد الله بن وهب، عن عمرو بن الحارث، عن ابن شهاب، عن عروة بن الزبير، وعمرة بنت عبد الرحمن، عن عائشة، زوج النبي صلى الله عليه وسلم أن أم حبيبة بنت جحش - ختنة رسول الله صلى الله عليه وسلم وتحت عبد الرحمن بن عوف - استحيضت سبع سنين فاستفتت رسول الله صلى الله عليه وسلم في ذلك فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن هذه ليست بالحيضة ولكن هذا عرق فاغتسلي وصلي ‏\"‏ ‏.‏ قالت عائشة فكانت تغتسل في مركن في حجرة أختها زينب بنت جحش حتى تعلو حمرة الدم الماء ‏.‏ قال ابن شهاب فحدثت بذلك أبا بكر بن عبد الرحمن بن الحارث بن هشام فقال يرحم الله هندا لو سمعت بهذه الفتيا والله إن كانت لتبكي لأنها كانت لا تصلي ‏.‏",
      "text_en": " 'A'isha, the wife of the Messenger of Allah (may peace be upon him) reported:                      Umm Habiba b. Jahsh who was the sister-in-law of the Messenger of Allah (may peace be upon him) and the wife of 'Abd al-Rahman b. Auf, remained mustahada for seven years, and she, therefore, asked for the verdict of Shari'ah from the Messenger of Allah (may peace be upon him) about it The Messenger of Allah (may peace be upon him) said: This is not menstruation, but (blood from) a vein: so bathe yourself and offer prayer. 'A'isha said: She took a bath in the wash-tub placed in the apartment of her sister Zainab b. Jahsh, till the redness of the blood came over the water. Ibn Shihab said: I narrated it to Abu Bakr b. 'Abd al-Rahman b. al-Harith b. Hisham about it who observed: May Allah have mercy on Hinda! would that she listened to this verdict. By Lord, she wept for not offering prayer.",
      "usc_msa_ref": "",
      "chain": [
        "30491",
        "20029",
        "20377",
        "11013",
        "10511",
        "11455"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-381-3",
      "hadith_no": "381",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "وحدثنا محمد بن سلمة المرادي، حدثنا عبد الله بن وهب، عن يحيى بن عبد الله، وسعيد بن عبد الرحمن، عن هشام، بهذا الإسناد مثله ‏.‏",
      "text_en": " A hadith like this has been transmitted by Hisham.",
      "usc_msa_ref": "",
      "chain": [
        "30491",
        "20029"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-384-2",
      "hadith_no": "384",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن سلمة المرادي، حدثنا عبد الله بن وهب، عن حيوة، وسعيد بن أبي أيوب، وغيرهما، عن كعب بن علقمة، عن عبد الرحمن بن جبير، عن عبد الله بن عمرو بن العاص، أنه سمع النبي صلى الله عليه وسلم يقول ‏\"‏ إذا سمعتم المؤذن فقولوا مثل ما يقول ثم صلوا على فإنه من صلى على صلاة صلى الله عليه بها عشرا ثم سلوا الله لي الوسيلة فإنها منزلة في الجنة لا تنبغي إلا لعبد من عباد الله وأرجو أن أكون أنا هو فمن سأل لي الوسيلة حلت له الشفاعة ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. Amr b. al-As reported Allah's Messenger (may peace be upon him) as saying:                      When you hear the Mu'adhdhin, repeat what he says, then invoke a blessing on me, for everyone who invokes a blessing on me will receive ten blessings from Allah; then beg from Allah al-Wasila for me, which is a rank in Paradise fitting for only one of Allah's servants, and I hope that I may be that one. If anyone who asks that I be given the Wasila, he will be assured of my intercession.",
      "usc_msa_ref": "",
      "chain": [
        "30491",
        "20029",
        "26010",
        "20375",
        "10872",
        "10865",
        "29"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-1239",
      "hadith_no": "1239",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن سلمة المرادي، حدثنا عبد الله بن وهب، عن معاوية بن صالح، يقول حدثني ربيعة بن يزيد، عن أبي إدريس الخولاني، عن أبي الدرداء، قال قام رسول الله صلى الله عليه وسلم فسمعناه يقول ‏\"‏ أعوذ بالله منك ‏\"‏ ‏.‏ ثم قال ‏\"‏ ألعنك بلعنة الله ‏\"‏ ‏.‏ ثلاثا ‏.‏ وبسط يده كأنه يتناول شيئا فلما فرغ من الصلاة قلنا يا رسول الله قد سمعناك تقول في الصلاة شيئا لم نسمعك تقوله قبل ذلك ورأيناك بسطت يدك ‏.‏ قال ‏\"‏ إن عدو الله إبليس جاء بشهاب من نار ليجعله في وجهي فقلت أعوذ بالله منك ‏.‏ ثلاث مرات ثم قلت ألعنك بلعنة الله التامة فلم يستأخر ثلاث مرات ثم أردت أخذه والله لولا دعوة أخينا سليمان لأصبح موثقا يلعب به ولدان أهل المدينة ‏\"‏ ‏.‏",
      "text_en": " Abu Darda' reported:                      Allah's Messenger (may peace be upon him) stood up (to pray) and we heard him say:\" I seek refuge in Allah from thee.\" Then said:\" curse thee with Allah's curse\" three times, then he stretched out his hand as though he was taking hold of something. When he finished the prayer, we said: Messenger of Allah, we heard you say something during the prayer which we have not heard you say before, and we saw you stretch out your hand. He replied: Allah's enemy Iblis came with a flame of fire to put it in my face, so I said three times:\" I Seek refuge in Allah from thee.\" Then I said three times:\" I curse thee with Allah's full curse.\" But he did not retreat (on any one of these) three occasions. Thereafter I meant to seize him. I swear by Allah that had it not been for the supplication of my brother Sulaiman he would have been bound, and made an object of sport for the children of Medina.",
      "usc_msa_ref": "",
      "chain": [
        "30491",
        "20029",
        "20675",
        "11414",
        "11027",
        "37"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-1374",
      "hadith_no": "1374",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني محمد بن سلمة المرادي، حدثنا عبد الله بن وهب، عن يحيى بن عبد الله بن سالم، عن موسى بن عقبة، أن أبا الزبير المكي، حدثه أنه، سمع عبد الله بن الزبير، وهو يقول في إثر الصلاة إذا سلم ‏.‏ بمثل حديثهما وقال في آخره وكان يذكر ذلك عن رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Abu Zubair al-Makki reported that he had heard 'Abdullah b. Zubair uttering (the words) like that of the hadith (narrated above) at the end of the prayer after pronouncing salutation. He at the conclusion also said that he was making a mention of that from the Messenger of Allah (may peace be upon him).",
      "usc_msa_ref": "",
      "chain": [
        "30491",
        "20029",
        "11106",
        "11263",
        "106"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-1445",
      "hadith_no": "1445",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا عمرو بن سواد العامري، ومحمد بن سلمة المرادي، وأحمد بن عيسى، - وألفاظهم متقاربة - قال عمرو أخبرنا وقال الآخران، حدثنا ابن وهب، أخبرني عمرو بن الحارث، عن يزيد بن أبي حبيب، أن موسى بن سعد الأنصاري، حدثه عن حفص بن عبيد الله، عن أنس بن مالك، أنه قال صلى لنا رسول الله صلى الله عليه وسلم العصر فلما انصرف أتاه رجل من بني سلمة فقال يا رسول الله إنا نريد أن ننحر جزورا لنا ونحن نحب أن تحضرها ‏.‏ قال ‏\"‏ نعم ‏\"‏ ‏.‏ فانطلق وانطلقنا معه فوجدنا الجزور لم تنحر فنحرت ثم قطعت ثم طبخ منها ثم أكلنا قبل أن تغيب الشمس ‏.‏ وقال المرادي حدثنا ابن وهب عن ابن لهيعة وعمرو بن الحارث في هذا الحديث ‏.‏",
      "text_en": " Anas b. Malik reported:                      The Messenger of Allah (may peace be upon him) led us in the afternoon prayer. When he completed it, a person from Bani Salama came to him and said: Messenger of Allah, we intend to slaughter our came and we are desirous that you should also be present there (on this occasion). He (the Holy Prophet) said: Yes. He (the person) went and we also went along with him and we found that the camel had not been slaughtered yet. Then it was slaughtered, and it was cut into pieces and then some of those were cooked, and then we ate (them) before the setting of the sun. This hadith has also been narrated by another chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30443",
        "30491",
        "30227",
        "11439",
        "20029",
        "20377",
        "11411",
        "19"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-1543",
      "hadith_no": "1543",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثني حرملة بن يحيى، أخبرنا ابن وهب، أخبرني يونس، ح وحدثني محمد بن سلمة المرادي، حدثنا عبد الله بن وهب، عن يونس، عن ابن شهاب، عن ابن هرمز، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أحدكم ما قعد ينتظر الصلاة في صلاة ما لم يحدث تدعو له الملائكة اللهم اغفر له اللهم ارحمه ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      The Messenger of Allah (may peace be upon him) said: Anyone amongst you who sat in a place of worship waiting for the prayer is in prayer and his ablution is not broken, the angels invoke blessing upon him (in these words): O Allah! pardon him. O Allah! have mercy upon him.",
      "usc_msa_ref": "",
      "chain": [
        "30487",
        "20029",
        "20475",
        "30491",
        "20029",
        "20475",
        "11013",
        "11197",
        "13"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-1701",
      "hadith_no": "1701",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني حرملة بن يحيى، ومحمد بن سلمة المرادي، قالا أخبرنا عبد الله بن وهب، أخبرني يونس، عن ابن شهاب، قال حدثني ابن عبد الله بن الحارث، أن أباه عبد الله بن الحارث بن نوفل، قال سألت وحرصت على أن أجد أحدا من الناس يخبرني أن رسول الله صلى الله عليه وسلم سبح سبحة الضحى فلم أجد أحدا يحدثني ذلك غير أن أم هانئ بنت أبي طالب أخبرتني أن رسول الله صلى الله عليه وسلم أتى بعد ما ارتفع النهار يوم الفتح فأتي بثوب فستر عليه فاغتسل ثم قام فركع ثماني ركعات لا أدري أقيامه فيها أطول أم ركوعه أم سجوده كل ذلك منه متقارب - قالت - فلم أره سبحها قبل ولا بعد ‏.‏ قال المرادي عن يونس ‏.‏ ولم يقل أخبرني ‏.‏",
      "text_en": " 'Abdullah b. Harith b. Naufal reported:                      I had been asking about, as I was desirous to find one among people who should inform me, whether the Messenger of Allah (may peace be upon him) observed the forenoon prayer, but I found none to narrate that to me except Umm Hani, daughter of Abu Talib (the real sister of Hadrat 'Ali), who told me that on the day of the Conquest the Messenger of Allah (may peace be upon him) came (to our house) after the dawn had (sufficiently) arisen. A cloth was brought and privacy was provided for him (the Holy Prophet). He took a bath and then stood up and observed eight rak'ahs. I do not know whether his Qiyam (standing posture) was longer, or bending or prostration or all of them were of equal duration. She (Umm Hani) further said: I never saw him saying this Nafl prayer prior to it or subsequently. (Al-Muradi narrated on the authority of Yunus that he made no mention of the words:\" He informed me.\" )",
      "usc_msa_ref": "",
      "chain": [
        "30487",
        "30491",
        "20029",
        "20475",
        "11013"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-1826",
      "hadith_no": "1826",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني محمد بن سلمة المرادي، حدثنا عبد الله بن وهب، عن عياض بن عبد الله الفهري، عن مخرمة بن سليمان، بهذا الإسناد وزاد ثم عمد إلى شجب من ماء فتسوك وتوضأ وأسبغ الوضوء ولم يهرق من الماء إلا قليلا ثم حركني فقمت ‏.‏ وسائر الحديث نحو حديث مالك ‏.‏",
      "text_en": " Ibn Abbas reported:                      I slept (one night) in the house of Maimuna, the wife of the Apostle of Allah (may peace be upon him), and the Apostle of Allah (may peace be upon him) was with her that night. He (after sleeping for half of the night got up and) then performed ablution and then stood up and observed prayer. I too stood on his left side. He took hold of me and made me stand on his right side. He (the Holy Prophet) observed thirteen rak'ahs on that night. The Messenger of Allah (may peace be upon him) then slept and snored and it was a habit with him to snore while sleeping. The Mu'adhdbin then came to him (to inform him about the prayer). He then went out and observed prayer without performing ablution. ('Amr said: Bukair b. Ashajj had narrated it to me )",
      "usc_msa_ref": "",
      "chain": [
        "30491",
        "20029",
        "20514",
        "11223"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-1869",
      "hadith_no": "1869",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني حرملة بن يحيى، ومحمد بن سلمة المرادي، قالا حدثنا ابن وهب، عن يونس، عن ابن شهاب، قال أخبرني عروة بن الزبير، أن عائشة، زوج النبي صلى الله عليه وسلم أخبرته أن الحولاء بنت تويت بن حبيب بن أسد بن عبد العزى مرت بها وعندها رسول الله صلى الله عليه وسلم فقلت هذه الحولاء بنت تويت وزعموا أنها لا تنام الليل فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تنام الليل خذوا من العمل ما تطيقون فوالله لا يسأم الله حتى تسأموا ‏\"‏ ‏.‏",
      "text_en": " 'A'isha said:                      The Messenger of Allah (way peace be upon him) came to me when a woman was sitting with me. He said: Who is she? I said: She is a woman who does not sleep but prays. He said: Do such acts which you are capable of doing. By Allah, Allah does not grow weary but you will grow weary. The religious act most pleasing to Him is one the doer of which does it continuously. (And in the hadith transmitted by Abu Usama [the words are]:\" She was a woman from Banu Asad.\" )",
      "usc_msa_ref": "",
      "chain": [
        "30487",
        "30491",
        "20029",
        "20475",
        "11013",
        "10511"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-2129",
      "hadith_no": "2129",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Eclipse) - كتاب الكسوف",
      "chapter_no": "11",
      "text_ar": "حدثني حرملة بن يحيى، أخبرني ابن وهب، أخبرني يونس، ح وحدثني أبو الطاهر، ومحمد بن سلمة المرادي قالا حدثنا ابن وهب، عن يونس، عن ابن شهاب، قال أخبرني عروة بن الزبير، عن عائشة، زوج النبي صلى الله عليه وسلم قالت خسفت الشمس في حياة رسول الله صلى الله عليه وسلم فخرج رسول الله صلى الله عليه وسلم إلى المسجد فقام وكبر وصف الناس وراءه فاقترأ رسول الله صلى الله عليه وسلم قراءة طويلة ثم كبر فركع ركوعا طويلا ثم رفع رأسه فقال ‏\"‏ سمع الله لمن حمده ربنا ولك الحمد ‏\"‏ ‏.‏ ثم قام فاقترأ قراءة طويلة هي أدنى من القراءة الأولى ثم كبر فركع ركوعا طويلا هو أدنى من الركوع الأول ثم قال ‏\"‏ سمع الله لمن حمده ربنا ولك الحمد ‏\"‏ ‏.‏ ثم سجد - ولم يذكر أبو الطاهر ثم سجد - ثم فعل في الركعة الأخرى مثل ذلك حتى استكمل أربع ركعات وأربع سجدات وانجلت الشمس قبل أن ينصرف ثم قام فخطب الناس فأثنى على الله بما هو أهله ثم قال ‏\"‏ إن الشمس والقمر آيتان من آيات الله لا يخسفان لموت أحد ولا لحياته فإذا رأيتموها فافزعوا للصلاة ‏\"‏ ‏.‏ وقال أيضا ‏\"‏ فصلوا حتى يفرج الله عنكم ‏\"‏ ‏.‏ وقال رسول الله صلى الله عليه وسلم ‏\"‏ رأيت في مقامي هذا كل شىء وعدتم حتى لقد رأيتني أريد أن آخذ قطفا من الجنة حين رأيتموني جعلت أقدم - وقال المرادي أتقدم - ولقد رأيت جهنم يحطم بعضها بعضا حين رأيتموني تأخرت ورأيت فيها ابن لحى وهو الذي سيب السوائب ‏\"‏ ‏.‏ وانتهى حديث أبي الطاهر عند قوله ‏\"‏ فافزعوا للصلاة ‏\"‏ ‏.‏ ولم يذكر ما بعده ‏.‏",
      "text_en": " 'A'isha, the wife of the Apostle of Allah (may peace be upon him), reported There was an eclipse of the sun during the lifetime of the Messenger of Allah (may peace be upon him). So, the Messenger of Allah (may peace he upon him) went to the mosque and stood up and glorified Allah, and the people formed themselves in rows behind him. The Messenger of Allah (may peace be upon him) made a long recital (of the Qur'an) and then pronounced takbir and then observed a long ruku'. He then raised his head and said:                      Allah listened to him who praised Him: our Lord, praise is due to Thee. He then again stood up and made a long recital, which was less than the first recital. He pronounced takbir and observed a long ruku', and it was less than the first one. He again said: Allah listened to him who praised Him; our Lord, praise is due to Thee. (Abu Tahir, one of the narrators) made no mention of:\" He then prostrated himself.\" He did like this in the second rak'ah, till he completed four rak'ahs and four prostrations and the sun became bright before he deported. He then stood up and addressed people, after lauding Allah as He deserved, and then said: The sun and the moon are two signs among the signs of Allah These do not eclipse either on the death of anyone or on his birth. So when you see them, hasten to prayer. He also said this: Observe prayer till Allah dispels the anxiety (of this extraordinary phenomenon) from you. The Messenger of Allah (may peace be upon him) said: I saw in my place everything which you have been promised. I even saw myself desiring to pluck a bunch (of grapes) from Paradise (and it was at the time) when you saw me moving forward. And I saw Hell and some of its parts crushing the others, when you saw me moving back; and I saw in it Ibn Luhayy and he was the person who made the she-camels loiter about. In the hadith transmitted by Abu Tahir the words are:\" He hastened to prayer,\" and he made no mention of what follows.",
      "usc_msa_ref": "",
      "chain": [
        "30487",
        "20029",
        "20475",
        "30491",
        "20029",
        "20475",
        "11013",
        "10511"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sunan-abi-daud-105",
      "hadith_no": "105",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن عمرو بن السرح، ومحمد بن سلمة المرادي، قالا حدثنا ابن وهب، عن معاوية بن صالح، عن أبي مريم، قال سمعت أبا هريرة، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إذا استيقظ أحدكم من نومه فلا يدخل يده في الإناء حتى يغسلها ثلاث مرات فإن أحدكم لا يدري أين باتت يده أو أين كانت تطوف يده ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported :                      I heard the Messenger of Allah (May Peace be upon him) say: When any of you wakes up from sleep, he should not put his hand in the utensil until he washes it three times, for none of you knows where his hand remained during the night or where it went round.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "30491",
        "20029",
        "20675",
        "13"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-288",
      "hadith_no": "288",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا ابن أبي عقيل، ومحمد بن سلمة المرادي، قالا حدثنا ابن وهب، عن عمرو بن الحارث، عن ابن شهاب، عن عروة بن الزبير، وعمرة بنت عبد الرحمن، عن عائشة، زوج النبي صلى الله عليه وسلم أن أم حبيبة بنت جحش ختنة رسول الله صلى الله عليه وسلم وتحت عبد الرحمن بن عوف استحيضت سبع سنين فاستفتت رسول الله صلى الله عليه وسلم في ذلك فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن هذه ليست بالحيضة ولكن هذا عرق فاغتسلي وصلي ‏\"‏ ‏.‏ قالت عائشة فكانت تغتسل في مركن في حجرة أختها زينب بنت جحش حتى تعلو حمرة الدم الماء ‏.‏",
      "text_en": " 'Aishah, wife of Prophet (ﷺ), said:                      Umm Habibah, daughter of Jahsh, sister-in-law of Messenger of Allah (ﷺ) and wife of 'Abd al-Rahman b. 'Awf, had a flow of blood for seven years. She asked the Messenger of Allah (ﷺ) about it. The Messenger of Allah (ﷺ) said: This is not menstruation but only vein; so you should take a bath and pray. 'Aishah said: She used to take bath in a wash-tub in the apartment of her sister Zainab daughter of Jahsh ; the redness of (her) blood dominated the water.",
      "usc_msa_ref": "",
      "chain": [
        "30491",
        "20029",
        "20377",
        "11013",
        "10511",
        "11455"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-335",
      "hadith_no": "335",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن سلمة المرادي، أخبرنا ابن وهب، عن ابن لهيعة، وعمرو بن الحارث، عن يزيد بن أبي حبيب، عن عمران بن أبي أنس، عن عبد الرحمن بن جبير، عن أبي قيس، مولى عمرو بن العاص أن عمرو بن العاص، كان على سرية وذكر الحديث نحوه ‏.‏ قال فغسل مغابنه وتوضأ وضوءه للصلاة ثم صلى بهم فذكر نحوه ولم يذكر التيمم ‏.‏ قال أبو داود ورويت هذه القصة عن الأوزاعي عن حسان بن عطية قال فيه فتيمم ‏.‏",
      "text_en": " \t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAbu Qais, the freed slave of 'Amr b. al-'As, said 'Amr b. al-'As was in a battle. He then narrated the rest of the tradition. He then said:                      He washed his armpits and other joints where dirt was found, and he performed ablution like that for prayer. Then he led them in prayer. He then narrated the tradition in a similar way but did not mention of tayammum.Abu Dawud said: This incident has also been narrated by al-'Awza'i on the authority of Hassan b. 'Atiyyah. This version has the words: Then he performed tayammum.",
      "usc_msa_ref": "",
      "chain": [
        "30491",
        "20029",
        "20624",
        "20377",
        "11411",
        "10605",
        "10865",
        "11452",
        "28"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-344",
      "hadith_no": "344",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن سلمة المرادي، حدثنا ابن وهب، عن عمرو بن الحارث، أن سعيد بن أبي هلال، وبكير بن عبد الله بن الأشج، حدثاه عن أبي بكر بن المنكدر، عن عمرو بن سليم الزرقي، عن عبد الرحمن بن أبي سعيد الخدري، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ الغسل يوم الجمعة على كل محتلم والسواك ويمس من الطيب ما قدر له ‏\"‏ ‏.‏ إلا أن بكيرا لم يذكر عبد الرحمن وقال في الطيب ‏\"‏ ولو من طيب المرأة ‏\"‏ ‏.‏",
      "text_en": " 'Abd al-Rahman b. Abi Sa'id al-Khudri quotes his father as saying:                      The Prophet (ﷺ) said: Washing and the use of tooth-stick are necessary for every adult (person) on Friday; and everyone should apply perfume whatever one has. The narrator Bukair did not mention of 'Abd al-Rahman; and about perfume he said that even it might be of the kind used by women.",
      "usc_msa_ref": "",
      "chain": [
        "30491",
        "20029",
        "20377",
        "11169",
        "11154",
        "1544",
        "11879",
        "38"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-394",
      "hadith_no": "394",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن سلمة المرادي، حدثنا ابن وهب، عن أسامة بن زيد الليثي، أن ابن شهاب، أخبره أن عمر بن عبد العزيز كان قاعدا على المنبر فأخر العصر شيئا فقال له عروة بن الزبير أما إن جبريل صلى الله عليه وسلم قد أخبر محمدا صلى الله عليه وسلم بوقت الصلاة فقال له عمر اعلم ما تقول ‏.‏ فقال عروة سمعت بشير بن أبي مسعود يقول سمعت أبا مسعود الأنصاري يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ نزل جبريل صلى الله عليه وسلم فأخبرني بوقت الصلاة فصليت معه ثم صليت معه ثم صليت معه ثم صليت معه ثم صليت معه ‏\"‏ ‏.‏ يحسب بأصابعه خمس صلوات فرأيت رسول الله صلى الله عليه وسلم صلى الظهر حين تزول الشمس وربما أخرها حين يشتد الحر ورأيته يصلي العصر والشمس مرتفعة بيضاء قبل أن تدخلها الصفرة فينصرف الرجل من الصلاة فيأتي ذا الحليفة قبل غروب الشمس ويصلي المغرب حين تسقط الشمس ويصلي العشاء حين يسود الأفق وربما أخرها حتى يجتمع الناس وصلى الصبح مرة بغلس ثم صلى مرة أخرى فأسفر بها ثم كانت صلاته بعد ذلك التغليس حتى مات ولم يعد إلى أن يسفر ‏.‏ قال أبو داود وروى هذا الحديث عن الزهري معمر ومالك وابن عيينة وشعيب بن أبي حمزة والليث بن سعد وغيرهم لم يذكروا الوقت الذي صلى فيه ولم يفسروه وكذلك أيضا رواه هشام بن عروة وحبيب بن أبي مرزوق عن عروة نحو رواية معمر وأصحابه إلا أن حبيبا لم يذكر بشيرا وروى وهب بن كيسان عن جابر عن النبي صلى الله عليه وسلم وقت المغرب قال ثم جاءه للمغرب حين غابت الشمس - يعني من الغد - وقتا واحدا ‏.‏ قال أبو داود وكذلك روي عن أبي هريرة عن النبي صلى الله عليه وسلم قال ثم صلى بي المغرب يعني من الغد وقتا واحدا وكذلك روي عن عبد الله بن عمرو بن العاص من حديث حسان بن عطية عن عمرو بن شعيب عن أبيه عن جده عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " \t\t\t\t\t\t\t\t\t\t\tIbn Shihab said:                      'Umar b. 'Abdul 'Aziz was sitting on the pulpit and he somewhat postponed the afternoon prayer. 'Urwah b. al-Zubair said to him: \"Gabriel informed Muhammed (ﷺ) of the time of prayer\". So 'Umar said to him: \"Be sure of what you are saying\". 'Urwah then replied: \"I heard Bashir b. Abu Mas'ud say that he heard Abu Mas'ud al-Ansari say that he heard the Messenger of Allah (ﷺ)\tsay: 'Gabriel came down and informed me of the time of prayer, and I prayed along with him, then prayed along with him, then I prayed along with him,  then I prayed along with him, then I prayed along with him, reckoning with his fingers five times of the prayer.' I saw the Messenger of Allah (ﷺ) offering the Duhr prayer when the sun had passed the meridian. Sometimes he would delay it when it was sever heat ; and I witnessed that he prayer the 'Asr prayer when the sun was high and bright before the yellowness had overcome it; then a man could go off after the prayer and reach Dhu'l-Hulaifah before the sunset, and he would pray Maghrib when the sun had set ; and he would pray the 'Isha prayer when darkness prevailed over the horizon; sometime he would delay it until the people assembled; and once he prayer the fair prayer in the darkness of dawn and at another time he prayed it when it became fairly light; but later on he continued to pray in the darkness of dawn until his death; he never prayed it again in the light of the dawn.\"Abu Dawud said: This tradition has been transmitted from al-Zuhri by Ma'mar, Malik, Ibn 'Uyainah, Shu'aib b. Abi Hamzah, and al-Laith b. Sa'd and others; but they did not mention the time in which he (the Prophet) had prayer, nor did they explain it. And similarly it has been narrated by Hisham b. 'Urwah and Habib b. Abu Mazruq from 'Urwah like the report of Ma'mar and his companions. But Habib did not make a mention of Bashir. And Wahb b. Kaisan reported on the authority of Jabir from the Prophet (ﷺ) the time of the Maghrib prayer. He said: \"Next day he (Gabriel) came to him at the time of the Maghrib prayer when the sun had already set. (He came both days) at the same time.\"Abu Dawud said: Similarly, this tradition has been transmitted by Abu Hurairah from the Prophet (ﷺ). He said: \"Then he (Gabriel) led me in the sunset prayer next day at the same time.\"Similarly, this tradition has been narrated through a different chain by 'Abd Allah b. 'Amr b. al-'As, through a chain from Hassan b. 'Atiyyah, from 'Amr b. Shu'aib, from his father, on the authority from the Prophet (ﷺ).",
      "usc_msa_ref": "",
      "chain": [
        "30491",
        "20029",
        "20500",
        "11013",
        "11010"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-919",
      "hadith_no": "919",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن سلمة المرادي، حدثنا ابن وهب، عن مخرمة، عن أبيه، عن عمرو بن سليم الزرقي، قال سمعت أبا قتادة الأنصاري، يقول رأيت رسول الله صلى الله عليه وسلم يصلي للناس وأمامة بنت أبي العاص على عنقه فإذا سجد وضعها ‏.‏ قال أبو داود ولم يسمع مخرمة من أبيه إلا حديثا واحدا ‏.‏",
      "text_en": " Abu Qatadah al-Ansari said:                      I saw the Messenger of Allah(ﷺ) leading the people in prayer with Umamah daughter of Abu al-As on his neck (shoulder). When he prostrated, he put her down.Abu Dawud said: The narrator Makhramah did not hear from his father except one tradition.",
      "usc_msa_ref": "",
      "chain": [
        "30491",
        "20029",
        "1544",
        "391"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-1087",
      "hadith_no": "1087",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن سلمة المرادي، حدثنا ابن وهب، عن يونس، عن ابن شهاب، أخبرني السائب بن يزيد، أن الأذان، كان أوله حين يجلس الإمام على المنبر يوم الجمعة في عهد النبي صلى الله عليه وسلم وأبي بكر وعمر - رضى الله عنهما - فلما كان خلافة عثمان وكثر الناس أمر عثمان يوم الجمعة بالأذان الثالث فأذن به على الزوراء فثبت الأمر على ذلك ‏.‏",
      "text_en": " Al-Sa'ib b. Yazid said:                      During the time of the Prophet (ﷺ) and Abu Bakr and 'Umar the call to the Friday prayer was first made at the time when the imam was seated on the pulpit (for giving the sermon). When the time of 'Uthman came, and the people became abundant, 'Uthman ordered to make a third call to the Friday prayer. It was made on al-Zaura' (a house in Medina). The rule of action continued to the same effect.",
      "usc_msa_ref": "",
      "chain": [
        "30491",
        "20029",
        "20475",
        "11013",
        "3048"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-1098",
      "hadith_no": "1098",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن سلمة المرادي، أخبرنا ابن وهب، عن يونس، أنه سأل ابن شهاب عن تشهد، رسول الله صلى الله عليه وسلم يوم الجمعة فذكر نحوه قال ‏\"‏ ومن يعصهما فقد غوى ‏\"‏ ‏.‏ ونسأل الله ربنا أن يجعلنا ممن يطيعه ويطيع رسوله ويتبع رضوانه ويجتنب سخطه فإنما نحن به وله ‏.‏",
      "text_en": " Narrated Ibn Shihab:                     Yunus asked Ibn Shihab about the address of the Messenger of Allah (ﷺ) on Friday. He mentioned it in like manner. He added: Anyone who disobeys them (Allah and His Apostle) goes astray. We beseech Allah, our Lord, to make us from those who obey Him and obey His Apostle, and follow what He likes, and abstain from His anger; we are due to Him and we belong to Him.",
      "usc_msa_ref": "",
      "chain": [
        "30491",
        "20029",
        "20475",
        "11013"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-1168",
      "hadith_no": "1168",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Book Of The Prayer For Rain (Kitab al-Istisqa') - كتاب الاستسقاء",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن سلمة المرادي، أخبرنا ابن وهب، عن حيوة، وعمر بن مالك، عن ابن الهاد، عن محمد بن إبراهيم، عن عمير، مولى بني آبي اللحم أنه رأى النبي صلى الله عليه وسلم يستسقي عند أحجار الزيت قريبا من الزوراء قائما يدعو يستسقي رافعا يديه قبل وجهه لا يجاوز بهما رأسه ‏.‏",
      "text_en": " Narrated Umayr, the client of AbulLahm:                     Umayr saw the Prophet (ﷺ) praying for rain at Ahjar az-Zayt near az-Zawra', standing, making supplication, praying for rain and raising his hands in front of his face, but not lifting them above his head.",
      "usc_msa_ref": "",
      "chain": [
        "30491",
        "20029",
        "26010",
        "20626",
        "11234",
        "11213",
        "3141"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-1180",
      "hadith_no": "1180",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Book Of The Prayer For Rain (Kitab al-Istisqa') - كتاب الاستسقاء",
      "chapter_no": "3",
      "text_ar": "حدثنا ابن السرح، أخبرنا ابن وهب، ح وحدثنا محمد بن سلمة المرادي، حدثنا ابن وهب، عن يونس، عن ابن شهاب، أخبرني عروة بن الزبير، عن عائشة، زوج النبي صلى الله عليه وسلم قالت خسفت الشمس في حياة رسول الله صلى الله عليه وسلم فخرج رسول الله صلى الله عليه وسلم إلى المسجد فقام فكبر وصف الناس وراءه فاقترأ رسول الله صلى الله عليه وسلم قراءة طويلة ثم كبر فركع ركوعا طويلا ثم رفع رأسه فقال ‏\"‏ سمع الله لمن حمده ربنا ولك الحمد ‏\"‏ ‏.‏ ثم قام فاقترأ قراءة طويلة هي أدنى من القراءة الأولى ثم كبر فركع ركوعا طويلا هو أدنى من الركوع الأول ثم قال ‏\"‏ سمع الله لمن حمده ربنا ولك الحمد ‏\"‏ ‏.‏ ثم فعل في الركعة الأخرى مثل ذلك فاستكمل أربع ركعات وأربع سجدات وانجلت الشمس قبل أن ينصرف ‏.‏",
      "text_en": " Narrated A'ishah (May Allah be pleased with her):                     There was an eclipse of the sun during the lifetime of the Messenger of Allah (ﷺ)came tot he mosque; he stood up and uttered the takbir (Allah is great); the people stood in rows behind him; the Messenger of Allah (ﷺ) recited from the Quran for a long time; then he uttered the takbir (Allah is most great) and performed bowing for a long time, then he raised his head and said: Allah listens to him who praises Him; our Lord, and to Thee be praise; then he stood up and recited from the Qur'an for a long time, but it was less than the first (recitation); he then bowed for a long time, but it was less than the first bowing; he then said, Allah listens to him who praises Him; our Lord, and to Thee be praise.  he then did so in the second rak'ah.  he thus completed four bowings and four prostrations.  The sun had become bright before he departed.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "30491",
        "20029",
        "20475",
        "11013",
        "10511",
        "53"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-1287",
      "hadith_no": "1287",
      "source": "Sunan Abi Da'ud",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن سلمة المرادي، حدثنا ابن وهب، عن يحيى بن أيوب، عن زبان بن فائد، عن سهل بن معاذ بن أنس الجهني، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من قعد في مصلاه حين ينصرف من صلاة الصبح حتى يسبح ركعتى الضحى لا يقول إلا خيرا غفر له خطاياه وإن كانت أكثر من زبد البحر ‏\"‏ ‏.‏",
      "text_en": " Narrated Mu'adh ibn Anas al-Juhani:                     The Prophet (ﷺ) said: If anyone sits in his place of prayer when he finishes the dawn prayer till he prays the two rak'ahs of the forenoon, saying nothing but what is good, his sins will be forgiven even if they are more than the foam of the sea.",
      "usc_msa_ref": "",
      "chain": [
        "30491",
        "20029",
        "20379",
        "16031"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-1313",
      "hadith_no": "1313",
      "source": "Sunan Abi Da'ud",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا أبو صفوان عبد الله بن سعيد بن عبد الملك بن مروان، ح وحدثنا سليمان بن داود، ومحمد بن سلمة المرادي، قالا حدثنا ابن وهب، - المعنى - عن يونس، عن ابن شهاب، أن السائب بن يزيد، وعبيد الله، أخبراه أن عبد الرحمن بن عبد قالا عن ابن وهب بن عبد القاري، قال سمعت عمر بن الخطاب، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ من نام عن حزبه أو عن شىء منه فقرأه ما بين صلاة الفجر وصلاة الظهر كتب له كأنما قرأه من الليل ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Umar bin Al-Khattab:                     The Messenger of Allah (ﷺ) as saying: He who misses him daily round of recital or part of it due to sleep and he recites it between the dawn and the noon prayers, will be reckoned as if he recited it at night.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "30584",
        "30491",
        "20475",
        "11013",
        "3048"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-1362",
      "hadith_no": "1362",
      "source": "Sunan Abi Da'ud",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا أحمد بن صالح، ومحمد بن سلمة المرادي، قالا حدثنا ابن وهب، عن معاوية بن صالح، عن عبد الله بن أبي قيس، قال قلت لعائشة رضى الله عنها ‏:‏ بكم كان رسول الله صلى الله عليه وسلم يوتر قالت ‏:‏ كان يوتر بأربع وثلاث، وست وثلاث، وثمان وثلاث، وعشر وثلاث، ولم يكن يوتر بأنقص من سبع، ولا بأكثر من ثلاث عشرة ‏.‏ قال أبو داود زاد أحمد بن صالح ‏:‏ ولم يكن يوتر بركعتين قبل الفجر ‏.‏ قلت ‏:‏ ما يوتر قالت ‏:‏ لم يكن يدع ذلك ‏.‏ ولم يذكر أحمد ‏:‏ وست وثلاث ‏.‏",
      "text_en": " 'Abd Allah b. Abi Qais said that he asked 'Aishah:                      How many rak'ahs would the Messenger of Allah (ﷺ) pray observing the witr ? She said: He used to observe the witr with four and three, six and three, eight and three, and ten and three rak'ahs never observing less than seven or more than thirteen.The narrator Ahmad added in his version: He would not observe the witr with two rak'ahs before the dawn. I asked: With what would he observe the witr ? She said: He would never leave it. The version of Ahmad does not mention the words \"six and three (rak'ahs)\".",
      "usc_msa_ref": "",
      "chain": [
        "30226",
        "30491",
        "20029",
        "20675",
        "11515"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-1523",
      "hadith_no": "1523",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا محمد بن سلمة المرادي، حدثنا ابن وهب، عن الليث بن سعد، أن حنين بن أبي حكيم، حدثه عن على بن رباح اللخمي، عن عقبة بن عامر، قال أمرني رسول الله صلى الله عليه وسلم أن أقرأ بالمعوذات دبر كل صلاة ‏.‏",
      "text_en": " Narrated Uqbah ibn Amir:                     The Messenger of Allah (ﷺ) commanded me to recite Mu'awwidhatan (the last two surahs of the Qur'an) after every prayer.",
      "usc_msa_ref": "",
      "chain": [
        "30491",
        "20029",
        "20023",
        "18233",
        "189"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    }
  ],
  "total_hadiths": 27,
  "grade_display": {
    "en": "3rd Century AH [11th Generation]",
    "ar": "القرن الثالث الهجري [الجيل الحادي عشر]",
    "ckb": "سەدەی سێیەمی كۆچی [نەوەی یازدەیەم]"
  }
}