{
  "id": "30502",
  "name": "al-Hakm bin Musa الحكم بن موسى البزاز",
  "full_name": "al-Hakm bin Musa الحكم بن موسى البزاز",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "232",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Baghdad"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ خت  م  س  ق  -  صدوق ]"
    ],
    "tags": [
      "al-Baghdadi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20738",
      "name": "Dmrh bin Rabi'ya al-Flstyny ضمرة بن ربيعة الفلسطيني أبو عبد الله",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20736",
      "name": "Isma'il bin Ayyash bin Saleem إسماعيل بن عياش بن سليم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20239",
      "name": "Shu'aib bin Ishaq bin 'Abdur Rahman شعيب بن إسحاق بن عبد الرحمن",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20733",
      "name": "al-Walid bin Muslim al-Quraishi الوليد بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20402",
      "name": "Yahya bin Hamza bin Waqd يحيى بن حمزة بن واقد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20347",
      "name": "'Isa bin Yonus bin Abi Ishaq عيسى بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20641",
      "name": "Haql bin Ziyad هقل بن زياد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20286",
      "name": "Mua'dh bin Mua'dh bin Nsr معاذ بن معاذ بن نصر",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]"
    },
    {
      "id": "30554",
      "name": "Abu Zara' al-Razi أبو زرعة الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    },
    {
      "id": "30025",
      "name": "'Abdullah bin 'Abdur Rahman al-Daarimi عبد الله بن عبد الرحمن الدارمي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30359",
      "name": "'Ubaidullah bin Sa'id عبيد الله بن سعيد أبو قدامة السرخسي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30026",
      "name": "'Ali bin al-Madini علي بن المديني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30023",
      "name": "Muhammad bin Yahya bin Faris al-Dhahli محمد بن يحيى بن فارس الذهلي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30245",
      "name": "al-Hasan bin Muhammad al-Za'farani الحسن بن محمد الصباح الزعفراني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "37518",
      "name": "'Abdur Rahman bin 'Amr عبد الرحمن بن عمرو",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "36663",
      "name": "Muhammad bin Yahya bin Suliaman محمد بن يحيى بن سليمان",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "32250",
      "name": "'Ali bin 'Abdul 'Aziz al-Baghvi علي بن عبد العزيز البغوي",
      "grade": "3rd Century AH"
    },
    {
      "id": "30201",
      "name": "Abu Bakr bin Abi Shayba أبو بكر بن أبي شيبة",
      "grade": "3rd Century AH"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-1296",
      "hadith_no": "1296",
      "source": "Sahih Bukhari",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "وقال الحكم بن موسى حدثنا يحيى بن حمزة، عن عبد الرحمن بن جابر، أن القاسم بن مخيمرة، حدثه قال حدثني أبو بردة بن أبي موسى  رضى الله عنه  قال وجع أبو موسى وجعا فغشي عليه، ورأسه في حجر امرأة من أهله، فلم يستطع أن يرد عليها شيئا، فلما أفاق قال أنا بريء ممن برئ منه رسول الله صلى الله عليه وسلم، إن رسول الله صلى الله عليه وسلم برئ من الصالقة والحالقة والشاقة‏.‏",
      "text_en": " Narrated Abu Burda bin Abi Musa:                      Abu Musa got seriously ill, fainted and could not reply to his wife while he was lying with his head in her lap. When he came to his senses, he said, \"I am innocent of those, of whom Allah's Messenger () was innocent. Allah's Messenger () is innocent of a woman who cries aloud (or slaps her face) who shaves her head and who tear off her clothes (on the falling of a calamity)",
      "usc_msa_ref": "",
      "chain": [
        "30502",
        "20402",
        "11192",
        "10812",
        "11901"
      ]
    },
    {
      "id": "sahih-muslim-298",
      "hadith_no": "298",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا الحكم بن موسى القنطري، حدثنا يحيى بن حمزة، عن عبد الرحمن بن يزيد بن جابر، أن القاسم بن مخيمرة، حدثه قال حدثني أبو بردة بن أبي موسى، قال وجع أبو موسى وجعا فغشي عليه ورأسه في حجر امرأة من أهله فصاحت امرأة من أهله فلم يستطع أن يرد عليها شيئا فلما أفاق قال أنا بريء مما برئ منه رسول الله صلى الله عليه وسلم فإن رسول الله صلى الله عليه وسلم برئ من الصالقة والحالقة والشاقة ‏.‏",
      "text_en": " It is narrated on the authority of Abu Burda b. Abu Musa that Abu Musa was afflicted with grave pain and he became unconscious and his head was in the lap of a lady of his household. One of the women of his household walled. He (Abu Musa) was unable (because of weakness) to say anything to her. But when he was a bit recovered he said:                      I have no concern with one with whom the Messenger of Allah (may peace be upon him) has no concern, Verily the Messenger of Allah (may peace be upon him) has no concern with that woman who wails loudly, shaves her hair and tears (her garment in grief).",
      "usc_msa_ref": "",
      "chain": [
        "30502",
        "20402",
        "20395",
        "10812",
        "11901"
      ]
    },
    {
      "id": "sahih-muslim-489-2",
      "hadith_no": "489",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا الحكم بن موسى أبو صالح، حدثنا هقل بن زياد، قال سمعت الأوزاعي، قال حدثني يحيى بن أبي كثير، حدثني أبو سلمة، حدثني ربيعة بن كعب الأسلمي، قال كنت أبيت مع رسول الله صلى الله عليه وسلم فأتيته بوضوئه وحاجته فقال لي ‏\"‏ سل ‏\"‏ ‏.‏ فقلت أسألك مرافقتك في الجنة ‏.‏ قال ‏\"‏ أوغير ذلك ‏\"‏ ‏.‏ قلت هو ذاك ‏.‏ قال ‏\"‏ فأعني على نفسك بكثرة السجود ‏\"‏ ‏.‏",
      "text_en": " Rabi'a b. Ka'b said:                      I was with Allah's Messenger (may peace be upon him) one night. and I brought him water and what he required. He said to me: Ask (anything you like). I said: I ask your company in Paradise. He (the Holy Prophet) said: Or anything else besides it. I said: That is all (what I require). He said: Then help me to achieve this for you by deyoting yourself often to prostration.",
      "usc_msa_ref": "",
      "chain": [
        "30502",
        "20641",
        "20024",
        "11449",
        "10567",
        "464"
      ]
    },
    {
      "id": "sahih-muslim-1225",
      "hadith_no": "1225",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثني الحكم بن موسى، حدثنا عيسى بن يونس، حدثنا إسماعيل بن أبي خالد، عن الزبير بن عدي، عن مصعب بن سعد بن أبي وقاص، قال صليت إلى جنب أبي فلما ركعت شبكت أصابعي وجعلتهما بين ركبتى فضرب يدى فلما صلى قال قد كنا نفعل هذا ثم أمرنا أن نرفع إلى الركب ‏.‏",
      "text_en": " Mus'ab b. Sa'd b. Abu Waqqas reported:                      I said prayer by the side of my father. When I bowed I intertwined my fingers and placed them between my knees. He struck my hands. When he completed the prayer he said: We used to do that but then were commanded to lift (our palms) to the knees.",
      "usc_msa_ref": "",
      "chain": [
        "30502",
        "20347",
        "11418",
        "11336",
        "10556"
      ]
    },
    {
      "id": "sahih-muslim-1246",
      "hadith_no": "1246",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني الحكم بن موسى القنطري، حدثنا عبد الله بن المبارك، ح قال وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو خالد، وأبو أسامة جميعا عن هشام، عن محمد، عن أبي هريرة، عن النبي صلى الله عليه وسلم أنه نهى أن يصلي الرجل مختصرا ‏.‏ وفي رواية أبي بكر قال نهى رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Abu Huraira reported from the Apostle of Allah (may peace be upon him) that he forbade keeping one's hand on one's waist while praying, and in the narration of Abu Bakr (the words are):                      The Messenger of Allah (may peace be upon him) forbade to do so.",
      "usc_msa_ref": "",
      "chain": [
        "30502",
        "20025",
        "30201",
        "20295",
        "11035",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-1885",
      "hadith_no": "1885",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا الحكم بن موسى، حدثنا هقل، عن الأوزاعي، عن يحيى بن أبي كثير، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما أذن الله لشىء كأذنه لنبي يتغنى بالقرآن يجهر به ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated by another chain of transmitters but with a slight modification of words.",
      "usc_msa_ref": "",
      "chain": [
        "30502",
        "20024",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-2374",
      "hadith_no": "2374",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثنيه زهير بن حرب، حدثنا يحيى بن سعيد، ح وحدثنا أبو كريب، حدثنا أبو أسامة، ح وحدثني علي بن حجر، أخبرنا علي بن مسهر، ح حدثنا الحكم بن موسى، حدثنا شعيب بن إسحاق، كلهم عن هشام، بهذا الإسناد ‏.‏ وفي حديث أبي أسامة ولم توص ‏.‏ كما قال ابن بشر ولم يقل ذلك الباقون ‏.‏",
      "text_en": "  This hadith has been narrated on the authority of Hisham with the same chain of transmitters. And in the hadith transmitted by Abu Usama the words are:                     \" She did not make any will,\" as it has been reported by Ibn Bishr, but it was not reported by the rest of the narrators.",
      "usc_msa_ref": "",
      "chain": [
        "20031",
        "30216",
        "20318",
        "20387",
        "20345",
        "30502",
        "20239"
      ]
    },
    {
      "id": "sahih-muslim-3135",
      "hadith_no": "3135",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثني الحكم بن موسى القنطري، حدثنا شعيب بن إسحاق، عن هشام بن عروة، عن عروة، عن عائشة، قالت طاف النبي صلى الله عليه وسلم في حجة الوداع حول الكعبة على بعيره يستلم الركن كراهية أن يضرب عنه الناس ‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her) reported that Allah's Apostle (may peace be upon him) circumambulated the Ka'ba on the back of his camel on the occasion of the Farewell Pilgrimage and touched the corner and he did not like that the people should be pushed away from him.",
      "usc_msa_ref": "",
      "chain": [
        "30502",
        "20239",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-3291",
      "hadith_no": "3291",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثني الحكم بن موسى، حدثني يحيى بن حمزة، عن الأوزاعي، - لعله قال - عن يحيى بن أبي كثير، عن محمد بن إبراهيم التيمي، عن أبي سلمة، عن عائشة، أن رسول الله صلى الله عليه وسلم أراد من صفية بعض ما يريد الرجل من أهله ‏.‏ فقالوا إنها حائض يا رسول الله ‏.‏ قال ‏\"‏ وإنها لحابستنا ‏\"‏ ‏.‏ فقالوا يا رسول الله إنها قد زارت يوم النحر ‏.‏ قال ‏\"‏ فلتنفر معكم ‏\"‏ ‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her) reported that Allah's Messenger (may peace be upon him) inclined to do with Safiyyah what a man feels inclined to do with his wife. They said:                      Messenger of Allah, she has entered the state of menses, whereupon he said: (Well) she is going to detain us. They (his wives) said: Messenger of Allah, she performed Tawaf Ziyara (Tawaf Ifada) on the Day of Nahr. Thereupon he said: Then she should proceed along with you",
      "usc_msa_ref": "",
      "chain": [
        "30502",
        "20402",
        "11449",
        "11213",
        "10567",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-3999",
      "hadith_no": "3999",
      "source": "Sahih Muslim",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "حدثنا الحكم بن موسى، حدثنا هقل، - يعني ابن زياد - عن الأوزاعي، عن عطاء، عن جابر بن عبد الله، قال كان لرجال فضول أرضين من أصحاب رسول الله صلى الله عليه وسلم فقال رسول الله صلى الله عليه وسلم ‏\"‏ من كانت له فضل أرض فليزرعها أو ليمنحها أخاه فإن أبى فليمسك أرضه ‏\"‏ ‏.‏",
      "text_en": " Jabir b. Abdullah (Allah be pleased with them) reported some of the Companions of Allah's Messenger (may peace be upon him) had surplus of land. Thereupon Allah's Messenger (may peace be upon him) said:                      He, who has surplus land (in his possession) should cultivate it, or he should lend it to his brother for benefit, but if he refuses to accept it, he should retain it.",
      "usc_msa_ref": "",
      "chain": [
        "30502",
        "20641",
        "20024",
        "11029",
        "34"
      ]
    },
    {
      "id": "sahih-muslim-4175",
      "hadith_no": "4175",
      "source": "Sahih Muslim",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا الحكم بن موسى، حدثنا هقل، عن الأوزاعي، قال حدثني عطاء بن أبي، رباح أن أبا سعيد الخدري، لقي ابن عباس فقال له أرأيت قولك في الصرف أشيئا سمعته من رسول الله صلى الله عليه وسلم أم شيئا وجدته في كتاب الله عز وجل فقال ابن عباس كلا لا أقول أما رسول الله صلى الله عليه وسلم فأنتم أعلم به وأما كتاب الله فلا أعلمه ولكن حدثني أسامة بن زيد أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ألا إنما الربا في النسيئة ‏\"‏ ‏.‏",
      "text_en": " Ata' b. Abu Rabah reported:                      Abu Sa'id al-Khudri (Allah be pleased with them) met Ibn 'Abbas (Allah be pleased with them) and said to him: What do you say in regard to the conversion (of commodities or money) did you hear it from Allah's Messenger (may peace be upon him), or is it something which you found In Allah's Book, Majestic and Glorious? Thereupon Ibn Abbas (Allah be pleated with them) said: I don't say that. So far at Allah's Massenger (may peace be upon him) is concerned, you know him better, and to far as the Book of Allah to concerned, I do not know it (more than you do), but 'Usama b. Zaid (Allah be pleased with him) narrated to me Allah's Messenger (may peace be upon him) as having said this: Beware, there can be an element of interest in credit.",
      "usc_msa_ref": "",
      "chain": [
        "30502",
        "20024",
        "11029"
      ]
    },
    {
      "id": "sahih-muslim-4309",
      "hadith_no": "4309",
      "source": "Sahih Muslim",
      "chapter": "The Book of Bequests - كتاب الوصية",
      "chapter_no": "26",
      "text_ar": "وحدثناه أبو كريب، حدثنا أبو أسامة، ح وحدثني الحكم بن موسى، حدثنا شعيب، بن إسحاق ح وحدثني أمية بن بسطام، حدثنا يزيد، - يعني ابن زريع - حدثنا روح، - وهو ابن القاسم - ح وحدثنا أبو بكر بن أبي شيبة، حدثنا جعفر بن عون، كلهم عن هشام بن عروة، بهذا الإسناد أما أبو أسامة وروح ففي حديثهما فهل لي أجر كما قال يحيى بن سعيد ‏.‏ وأما شعيب وجعفر ففي حديثهما أفلها أجر كرواية ابن بشر ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Hisham b. 'Urwa with the same chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20318",
        "30502",
        "20239",
        "30124",
        "20304",
        "11586",
        "30201",
        "20416"
      ]
    },
    {
      "id": "sahih-muslim-4533",
      "hadith_no": "4533",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Punishments Prescribed by Islam - كتاب الحدود",
      "chapter_no": "30",
      "text_ar": "حدثني الحكم بن موسى أبو صالح، حدثنا شعيب بن إسحاق، أخبرنا عبيد الله، عن نافع، أن عبد الله بن عمر، أخبره أن رسول الله صلى الله عليه وسلم أتي بيهودي ويهودية قد زنيا فانطلق رسول الله صلى الله عليه وسلم حتى جاء يهود فقال ‏\"‏ ما تجدون في التوراة على من زنى ‏\"‏ ‏.‏ قالوا نسود وجوههما ونحملهما ونخالف بين وجوههما ويطاف بهما ‏.‏ قال ‏\"‏ فأتوا بالتوراة إن كنتم صادقين ‏\"‏ ‏.‏ فجاءوا بها فقرءوها حتى إذا مروا بآية الرجم وضع الفتى الذي يقرأ يده على آية الرجم وقرأ ما بين يديها وما وراءها فقال له عبد الله بن سلام وهو مع رسول الله صلى الله عليه وسلم مره فليرفع يده فرفعها فإذا تحتها آية الرجم فأمر بهما رسول الله صلى الله عليه وسلم فرجما ‏.‏ قال عبد الله بن عمر كنت فيمن رجمهما فلقد رأيته يقيها من الحجارة بنفسه ‏.‏",
      "text_en": " Abdullah b. 'Umar reported that a Jew and a Jewess were brought to Allah's Messenger (may peace be upon him) who had committed adultery. Allah's Messenger (may peace be upon him) came to the Jews and said:                      What do you find in Torah for one who commits adultery? They said: We darken their faces and make them ride on the donkey with their faces turned to the opposite direction (and their backs touching each other), and then they are taken round (the city). He said: Bring Torah if you are truthful. They brought it and recited it until when they came to the verse pertaining to stoning, the person who was reading placed his hand on the verse pertaining to stoning, and read (only that which was) between his hands and what was subsequent to that. Abdullah b. Salim who was at that time with the Messenger of Allah (may peace be upon him) said: Command him (the reciter) to lift his hand. He lifted it and there was, underneath that, the verse pertaining to stoning. Allah's Messenger (may peace be upon him) pronounced judgment about both of them and they were stoned. Abdullah b. 'Umar said: I was one of those who stoned them, and I saw him (the Jew) protecting her (the Jewess) with his body.",
      "usc_msa_ref": "",
      "chain": [
        "30502",
        "20239",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-5740",
      "hadith_no": "5740",
      "source": "Sahih Muslim",
      "chapter": "The Book on General Behaviour - كتاب الآداب",
      "chapter_no": "39",
      "text_ar": "حدثنا الحكم بن موسى أبو صالح، حدثنا شعيب، - يعني ابن إسحاق - أخبرني  هشام بن عروة، حدثني عروة بن الزبير، وفاطمة بنت المنذر بن الزبير، أنهما قالا خرجت أسماء بنت أبي بكر حين هاجرت وهي حبلى بعبد الله بن الزبير فقدمت قباء فنفست بعبد الله بقباء ثم خرجت حين نفست إلى رسول الله صلى الله عليه وسلم ليحنكه فأخذه رسول الله صلى الله عليه وسلم منها فوضعه في حجره ثم دعا بتمرة قال قالت عائشة فمكثنا ساعة نلتمسها قبل أن نجدها فمضغها ثم بصقها في فيه فإن أول شىء دخل بطنه لريق رسول الله صلى الله عليه وسلم ثم قالت أسماء ثم مسحه وصلى عليه وسماه عبد الله ثم جاء وهو ابن سبع سنين أو ثمان ليبايع رسول الله صلى الله عليه وسلم وأمره بذلك الزبير فتبسم رسول الله صلى الله عليه وسلم حين رآه مقبلا إليه ثم بايعه ‏.‏",
      "text_en": " 'Urwa b. Zubair and Fatima daughter of Mandhir b. Zubair, reported that Asma' daughter of Abu Bakr was at the time of migration in the family way with 'Abdullah b. Zubair (in her womb). She came to Quba' and gave birth to 'Abdullah at that place and then sent him to Allah's Messenger (may peace be upon him) so that he should rub his palate with chewed dates. Allah's Messenger (may peace he upon him) took hold of him (the child) and he placed him in his lap and then called for dates. 'A'isha said:                      Some time was spent before we were able to find them. He (the Holy Prophet) chewed them and then put his saliva in his mouth. The first thing that entered his stomach, was the saliva of Allah's Messenger (may peace be upon him). Asma' said: He then rubbed him and blessed him and gave him the name of Abdullah. He ('Abdullah) went to him (the Holy Prophet) when he had attained the age of seven or eight years in order to pledge allegiance to Allah's Messenger (may peace be upon him) as Zubair had commanded him to do. Allah's Messenger (may peace be upon him) smiled when he saw him coming towards him and then accepted his allegiance.",
      "usc_msa_ref": "",
      "chain": [
        "30502",
        "20239",
        "11065",
        "10511",
        "10526"
      ]
    },
    {
      "id": "sahih-muslim-6079",
      "hadith_no": "6079",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثني الحكم بن موسى أبو صالح، حدثنا هقل، - يعني ابن زياد - عن الأوزاعي، حدثني أبو عمار، حدثني عبد الله بن فروخ، حدثني أبو هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أنا سيد ولد آدم يوم القيامة وأول من ينشق عنه القبر وأول شافع وأول مشفع ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      I shall be pre-eminent arriongst the descendants of Adam on the Day of Resurrection and I will be the first intercessor and the first whose intercession will be accepted (by Allah).",
      "usc_msa_ref": "",
      "chain": [
        "30502",
        "20641",
        "20024",
        "24242",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-7151",
      "hadith_no": "7151",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Repentance and Exhortation to Repentance - كتاب التوبة",
      "chapter_no": "51",
      "text_ar": "حدثني الحكم بن موسى، حدثنا معاذ بن معاذ، حدثنا سليمان التيمي، حدثنا أبو عثمان النهدي عن سلمان الفارسي، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن لله مائة رحمة فمنها رحمة بها يتراحم الخلق بينهم وتسعة وتسعون ليوم القيامة ‏\"‏ ‏.‏",
      "text_en": " Salman Farisi reported Allah's Messenger (may peace be upon him) as saying:                      Verily, there are one hundred (parts of) mercy for Allah, and it is one part of this mercy by virtue of which there is mutual love between the people and ninety-nine reserved for the Day of Resurrection.",
      "usc_msa_ref": "",
      "chain": [
        "30502",
        "20286",
        "11289",
        "11113",
        "14"
      ]
    },
    {
      "id": "sahih-muslim-7385",
      "hadith_no": "7385",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "حدثنا الحكم بن موسى أبو صالح، حدثنا يحيى بن حمزة، عن عبد الرحمن بن، جابر حدثني سليم بن عامر، حدثني المقداد بن الأسود، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ تدنى الشمس يوم القيامة من الخلق حتى تكون منهم كمقدار ميل ‏\"‏ ‏.‏ قال سليم بن عامر فوالله ما أدري ما يعني بالميل أمسافة الأرض أم الميل الذي تكتحل به العين ‏.‏ قال ‏\"‏ فيكون الناس على قدر أعمالهم في العرق فمنهم من يكون إلى كعبيه ومنهم من يكون إلى ركبتيه ومنهم من يكون إلى حقويه ومنهم من يلجمه العرق إلجاما ‏\"‏ ‏.‏ قال وأشار رسول الله صلى الله عليه وسلم بيده إلى فيه ‏.‏",
      "text_en": " Miqdad b. Aswad reported:                      I heard Allah's Messenger (may peace he upon him) as saying: On the Day of Resurrection, the sun would draw so close to the people that there woum be left only a distance of one mile. Sulaim b. Amir said: By Allah, I do not know whether he meant by\" mile\" the mile of the (material) earth or dn instrument used for applying collyrium to the eye. (The Holy Prophet is, however, reported to have said): The people would be submerged in perspiration according to their deeds, some up to their. knees, Some up to the waist and some would have the bridle of perspiration and, while saying this, Allah's Apostle (may peace be upon him) pointed his hand towards his mouth.",
      "usc_msa_ref": "",
      "chain": [
        "30502",
        "20402",
        "11192",
        "10915",
        "163"
      ]
    },
    {
      "id": "sahih-muslim-7657",
      "hadith_no": "7657",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "حدثني الحكم بن موسى أبو صالح، حدثنا شعيب بن إسحاق، أخبرنا عبيد الله، عن نافع، أن عبد الله بن عمر، أخبره أن الناس نزلوا مع رسول الله صلى الله عليه وسلم على الحجر أرض ثمود فاستقوا من آبارها وعجنوا به العجين فأمرهم رسول الله صلى الله عليه وسلم أن يهريقوا ما استقوا ويعلفوا الإبل العجين وأمرهم أن يستقوا من البئر التي كانت تردها الناقة ‏.‏",
      "text_en": " Abdullah b. 'Umar reported that the people encamped along with Allah's Messenger (may peace be upon him) in the valley of Hijr, the habitations of Thamud, and they quenched their thirst from the wells thereof and kneaded the flour with it. Thereupon Allah's Messenger (may peace be upon him) commanded that the water collected for drinking should be spilt and the flour should be given to the camels and commanded them that the water for drinking should be taken from that well where the she-camel (of Hadrat Salih) used to come.",
      "usc_msa_ref": "",
      "chain": [
        "30502",
        "20239",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-4853",
      "hadith_no": "4853",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا عمرو بن منصور، قال حدثنا الحكم بن موسى، قال حدثنا يحيى بن حمزة، عن سليمان بن داود، قال حدثني الزهري، عن أبي بكر بن محمد بن عمرو بن حزم، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم كتب إلى أهل اليمن كتابا فيه الفرائض والسنن والديات وبعث به مع عمرو بن حزم فقرئت على أهل اليمن هذه نسختها ‏\"‏ من محمد النبي صلى الله عليه وسلم إلى شرحبيل بن عبد كلال ونعيم بن عبد كلال والحارث بن عبد كلال قيل ذي رعين ومعافر وهمدان أما بعد ‏\"‏ ‏.‏ وكان في كتابه ‏\"‏ أن من اعتبط مؤمنا قتلا عن بينة فإنه قود إلا أن يرضى أولياء المقتول وأن في النفس الدية مائة من الإبل وفي الأنف إذا أوعب جدعه الدية وفي اللسان الدية وفي الشفتين الدية وفي البيضتين الدية وفي الذكر الدية وفي الصلب الدية وفي العينين الدية وفي الرجل الواحدة نصف الدية وفي المأمومة ثلث الدية وفي الجائفة ثلث الدية وفي المنقلة خمس عشرة من الإبل وفي كل أصبع من أصابع اليد والرجل عشر من الإبل وفي السن خمس من الإبل وفي الموضحة خمس من الإبل وأن الرجل يقتل بالمرأة وعلى أهل الذهب ألف دينار ‏\"‏ ‏.‏ خالفه محمد بن بكار بن بلال ‏.‏",
      "text_en": " It was narrated from Abu Bakr bin Muhammad bin 'Amr bin Hazm, from his father from his grandfather, that:                     the Messenger of Allah wrote a letter to the people of Yemen, included in which were the rules of inheritance, the sunan and the (rules concerning) blood money. He sent it with 'Arm bin Hazm and it was read to the people of Yemen, Its contents were as follows: \"From Muhammad the Prophet to Shurahbil bin 'Abd Kulal, Nu'aim bin 'Abd Kulal, Al-Harith bin' Abd Kulal, Qail dhil-Ru'ain, Mu'afir and Hamdan. To precede\" - And in this letter it said that whoevewrkills a believer for no just reason is to be killed in return, unless the heirs of the victim agree to pardon him. For killing a person, the Diyah is one hundred camels. For the nose, if it is cut off completely, diyah must be paid, for the tongue, diyah must be paid; for the lips, Diyah must be paid; for the testicles, Diyah must be paid; for the ends, Diyah must be paid; for the backbone, Dynamist be paid; for the eyes, Diyah must be paid; for one leg, half the Diyah must be paid; for a blow to the head that reaches the brain, one-third of thediyah must be paid; for a stab wound that penetrates deeply into the body, one-third of the diyah must be paid; for a blow that breaks the bone, fifteen camels must be given; for every digit of the hands or feet, ten camels must be given; for a tooth five camels must be given; for an injury that exposes the bone, five camels must be given. A man may be killed in return for (killing) a woman and those who deal in gold must pay one thousand dinars. (Daif)",
      "usc_msa_ref": "",
      "chain": [
        "38433",
        "30502",
        "20402",
        "30584",
        "11013",
        "11239",
        "1209"
      ]
    },
    {
      "id": "sunan-ibn-majah-1746",
      "hadith_no": "1746",
      "source": "Sunan Ibn Majah",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا عبيد الله بن عبد الكريم، حدثنا الحكم بن موسى، حدثنا عيسى بن يونس، ح وحدثنا عبيد الله، حدثنا علي بن الحسن بن سليمان أبو الشعثاء، حدثنا حفص بن غياث، جميعا عن هشام، عن ابن سيرين، عن أبي هريرة، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ من ذرعه القىء فلا قضاء عليه ومن استقاء فعليه القضاء ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Prophet (ﷺ) said:                     “Whoeverunintentionally vomits, he does not have to make up for thefast, butwhoever makes himself vomit, has to make up for the fast.”",
      "usc_msa_ref": "",
      "chain": [
        "30502",
        "20347",
        "11201",
        "20317",
        "11065",
        "11035",
        "13"
      ]
    }
  ],
  "total_hadiths": 20
}