{
  "id": "30506",
  "name": "Shja' bin Mkhld al-Flas شجاع بن مخلد الفلاس أبو الفضل البغوي",
  "full_name": "Shja' bin Mkhld al-Flas شجاع بن مخلد الفلاس أبو الفضل البغوي",
  "grade": "3rd Century AH [10th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "235",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Baghdad"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ م  د  ق  -  صدوق ]"
    ],
    "tags": [
      "al-Aqayli",
      "Baghdad"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20736",
      "name": "Isma'il bin Ayyash bin Saleem إسماعيل بن عياش بن سليم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20208",
      "name": "Isma'il bin Ibrahim",
      "grade": "Thiqah (Trustworthy)"
    },
    {
      "id": "20468",
      "name": "Hashaym bin Bashayr bin al-Qasim هشيم بن بشير بن القاسم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20032",
      "name": "Waki' bin al-Jarrah وكيع بن الجراح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20366",
      "name": "Yahya bin Zakaria bin Abi Zaida يحيى بن زكريا بن أبي زائدة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20337",
      "name": "'Abdah bin Sulaiman al-Klabi عبدة بن سليمان الكلابي أبو محمد الكوفي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20315",
      "name": "al-Husain bin 'Ali bin al-Walid al-Ja'fi الحسين بن علي بن الوليد الجعفي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]"
    },
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "30004",
      "name": "Ibn Maja ابن ماجة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30218",
      "name": "Musa bin Harun bin Bashyr موسى بن هارون بن بشير",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "6378",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثني زهير بن حرب، وشجاع بن مخلد، جميعا عن ابن علية، قال زهير حدثنا  إسماعيل بن إبراهيم، حدثني أبو حيان، حدثني يزيد بن حيان، قال انطلقت أنا وحصين، بن سبرة وعمر بن مسلم إلى زيد بن أرقم فلما جلسنا إليه قال له حصين لقد لقيت يا زيد خيرا كثيرا رأيت رسول الله صلى الله عليه وسلم وسمعت حديثه وغزوت معه وصليت خلفه لقد لقيت يا زيد خيرا كثيرا حدثنا يا زيد ما سمعت من رسول الله صلى الله عليه وسلم - قال - يا ابن أخي والله لقد كبرت سني وقدم عهدي ونسيت بعض الذي كنت أعي من رسول الله صلى الله عليه وسلم فما حدثتكم فاقبلوا وما لا فلا تكلفونيه ‏.‏ ثم قال قام رسول الله صلى الله عليه وسلم يوما فينا خطيبا بماء يدعى خما بين مكة والمدينة فحمد الله وأثنى عليه ووعظ وذكر ثم قال ‏\"‏ أما بعد ألا أيها الناس فإنما أنا بشر يوشك أن يأتي رسول ربي فأجيب وأنا تارك فيكم ثقلين أولهما كتاب الله فيه الهدى والنور فخذوا بكتاب الله واستمسكوا به ‏\"‏ ‏.‏ فحث على كتاب الله ورغب فيه ثم قال ‏\"‏ وأهل بيتي أذكركم الله في أهل بيتي أذكركم الله في أهل بيتي أذكركم الله في أهل بيتي ‏\"‏ ‏.‏ فقال له حصين ومن أهل بيته يا زيد أليس نساؤه من أهل بيته قال نساؤه من أهل بيته ولكن أهل بيته من حرم الصدقة بعده ‏.‏ قال ومن هم قال هم آل علي وآل عقيل وآل جعفر وآل عباس ‏.‏ قال كل هؤلاء حرم الصدقة قال نعم ‏.‏",
      "text_en": " Yazid b. Hayyan reported, I went along with Husain b. Sabra and 'Umar b. Muslim to Zaid b. Arqam and, as we sat by his side, Husain said to him:                      Zaid. you have been able to acquire a great virtue that you saw Allah's Messenger (may peace be upon him) listened to his talk, fought by his side in (different) battles, offered prayer behind me. Zaid, you have in fact earned a great virtue. Zaid, narrate to us what you heard from Allah's Messenger (may peace be upon him). He said: I have grown old and have almost spent my age and I have forgotten some of the things which I remembered in connection with Allah's Messenger (may peace be upon him), so accept whatever I narrate to you, and which I do not narrate do not compel me to do that. He then said: One day Allah's Messenger (may peace be upon him) stood up to deliver sermon at a watering place known as Khumm situated between Mecca and Medina. He praised Allah, extolled Him and delivered the sermon and. exhorted (us) and said: Now to our purpose. O people, I am a human being. I am about to receive a messenger (the angel of death) from my Lord and I, in response to Allah's call, (would bid good-bye to you), but I am leaving among you two weighty things: the one being the Book of Allah in which there is right guidance and light, so hold fast to the Book of Allah and adhere to it. He exhorted (us) (to hold fast) to the Book of Allah and then said: The second are the members of my household I remind you (of your duties) to the members of my family. He (Husain) said to Zaid: Who are the members of his household? Aren't his wives the members of his family? Thereupon he said: His wives are the members of his family (but here) the members of his family are those for whom acceptance of Zakat is forbidden. And he said: Who are they? Thereupon he said: 'Ali and the offspring of 'Ali, 'Aqil and the offspring of 'Aqil and the offspring of Ja'far and the offspring of 'Abbas. Husain said: These are those for whom the acceptance of Zakat is forbidden. Zaid said: Yes.",
      "chain": [
        "30022",
        "30506",
        "20208",
        "20321",
        "20208",
        "11404",
        "28642"
      ]
    },
    {
      "hadith_no": "6641",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وشجاع بن مخلد، - واللفظ لأبي بكر - قالا حدثنا  حسين، - وهو ابن علي الجعفي - عن زائدة، عن السدي، عن عبد الله البهي، عن عائشة، قالت سأل رجل النبي صلى الله عليه وسلم أى الناس خير قال ‏\"‏ القرن الذي أنا فيه ثم الثاني ثم الثالث ‏\"‏ ‏.‏",
      "text_en": " 'A'isha reported that a person asked Allah's Apostle (may peace be upon him) as to who amongst the people were the best. He said:                      Of the generation to which I belong, then of the second generation (generation adjacent to my generation), then of the third generation (generation adjacent to the second generation).",
      "chain": [
        "30201",
        "30506",
        "20315",
        "20320",
        "10743",
        "10939",
        "53"
      ]
    },
    {
      "hadith_no": "1038",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عمرو بن عثمان، والربيع بن نافع، وعثمان بن أبي شيبة، وشجاع بن مخلد، - بمعنى الإسناد - أن ابن عياش، حدثهم عن عبيد الله بن عبيد الكلاعي، عن زهير، - يعني ابن سالم العنسي - عن عبد الرحمن بن جبير بن نفير، قال عمرو وحده عن أبيه، عن ثوبان، عن النبي صلى الله عليه وسلم قال ‏\"‏ لكل سهو سجدتان بعد ما يسلم ‏\"‏ ‏.‏ لم يذكر عن أبيه ‏.‏ غير عمرو ‏.‏",
      "text_en": " Narrated Thawban:                     The Prophet (ﷺ) said: For each forgetfulness there are two prostrations after giving the salutation. No one except Amr (ibn Uthman) mentioned the words \"from his father\" (in the chain AbdurRahman ibn Jubayr ibn Nufayr from Thawban).",
      "chain": [
        "10581",
        "30335",
        "30203",
        "30506",
        "17023",
        "10942",
        "130"
      ]
    },
    {
      "hadith_no": "1429",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا شجاع بن مخلد، حدثنا هشيم، أخبرنا يونس بن عبيد، عن الحسن، أن عمر بن الخطاب، جمع الناس على أبى بن كعب فكان يصلي لهم عشرين ليلة ولا يقنت بهم إلا في النصف الباقي فإذا كانت العشر الأواخر تخلف فصلى في بيته فكانوا يقولون أبق أبى ‏.‏ قال أبو داود وهذا يدل على أن الذي ذكر في القنوت ليس بشىء وهذان الحديثان يدلان على ضعف حديث أبى أن النبي صلى الله عليه وسلم قنت في الوتر ‏.‏",
      "text_en": " Narrated Ubayy ibn Ka'b:                     Al-Hasan reported: Umar ibn al-Khattab gathered the people (in tarawih prayer) behind Ubayy ibn Ka'b (who led them). He used to lead them for twenty days (during Ramadan, and would not recite the supplication except in the second half of it (i.e. Ramadan). When the last ten days remained, he kept away from them, and prayed in his house. They used to say: Ubayy ran away.Abu Dawud said: This tradition shows that whatever has been reported about the recitation of the supplication is not tenable. Moreover, these two traditions from Ubayy b. Ka'b indicate that another tradition which tells that the Prophet (ﷺ) recited the supplication in the witr is weak.",
      "chain": [
        "30506",
        "20468",
        "11075",
        "11016",
        "3"
      ]
    },
    {
      "hadith_no": "719",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Adhan and the Sunnah Regarding It - كتاب الأذان والسنة فيها",
      "chapter_no": "3",
      "text_ar": "حدثنا شجاع بن مخلد أبو الفضل، قال حدثنا هشيم، أنبأنا أبو بشر، عن أبي المليح بن أسامة، عن عبد الله بن عتبة بن أبي سفيان، حدثتني عمتي أم حبيبة، أنها سمعت رسول الله  صلى الله عليه وسلم  يقول إذا كان عندها في يومها وليلتها فسمع المؤذن يؤذن قال كما يقول المؤذن ‏.‏",
      "text_en": " Umm Habibah narrated that :                     When the Messenger of Allah was with her on her day and night, and heard the Mu'adh-dhin calling the Adhan, she heard him saying what he said.",
      "chain": [
        "30506",
        "20468",
        "11419",
        "11453",
        "12236"
      ]
    },
    {
      "hadith_no": "1680",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن يحيى، قال حدثنا سعيد بن منصور، حدثنا هشيم، ح وحدثنا شجاع بن مخلد أبو الفضل، قال حدثنا هشيم، عن إسماعيل بن أبي خالد، عن قيس بن أبي حازم، عن جرير بن عبد الله البجلي، قال كنا نرى الاجتماع إلى أهل الميت وصنعة الطعام من النياحة ‏.‏",
      "text_en": " It wasnarrated that Jarir bin ‘Abdullah Al-Bajali said:                      “We used tothink that gathering with the family of the deceased and preparingfood was a form of wailing.”",
      "chain": [
        "11222",
        "30116",
        "20468",
        "30506",
        "20468",
        "11418",
        "11046",
        "4057"
      ]
    }
  ],
  "total_hadiths": 6
}