{
  "id": "30503",
  "name": "Khlf bin Hisham bin Th'lb خلف بن هشام بن ثعلب",
  "full_name": "Khlf bin Hisham bin Th'lb خلف بن هشام بن ثعلب",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "229",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Baghdad"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  د  -  ثقة ]"
    ],
    "tags": [
      "al-Baghdadi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "20022",
      "name": "Hammad bin Zayd حماد بن زيد بن درهم الأزدي الأزرق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20468",
      "name": "Hashaym bin Bashayr bin al-Qasim هشيم بن بشير بن القاسم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20327",
      "name": "Abu al-Ahwus, Salam bin Sulaym al-Hanafi أبو الأحوص سلام بن سليم الحنفي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20469",
      "name": "Wadah bin 'Abdullah al-Yashkari وضاح بن عبد الله اليشكري أبو عوانة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]"
    },
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "31742",
      "name": "Abu Bakr bin Abi Khuthama أبو بكر بن أبي خيثمة",
      "grade": "3rd Century AH"
    },
    {
      "id": "30585",
      "name": "'Abbas bin Muhammad bin Hatm عباس بن محمد بن حاتم",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30554",
      "name": "Abu Zara' al-Razi أبو زرعة الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30218",
      "name": "Musa bin Harun bin Bashyr موسى بن هارون بن بشير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "36663",
      "name": "Muhammad bin Yahya bin Suliaman محمد بن يحيى بن سليمان",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-muslim-124",
      "hadith_no": "124",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا خلف بن هشام، حدثنا حماد بن زيد، عن أبي جمرة، قال سمعت ابن عباس، ح وحدثنا يحيى بن يحيى، - واللفظ له - أخبرنا عباد بن عباد، عن أبي جمرة، عن ابن عباس، قال قدم وفد عبد القيس على رسول الله صلى الله عليه وسلم فقالوا يا رسول الله إنا هذا الحى من ربيعة وقد حالت بيننا وبينك كفار مضر فلا نخلص إليك إلا في شهر الحرام فمرنا بأمر نعمل به وندعو إليه من وراءنا ‏.‏ قال ‏\"‏ آمركم بأربع وأنهاكم عن أربع الإيمان بالله - ثم فسرها لهم فقال - شهادة أن لا إله إلا الله وأن محمدا رسول الله وإقام الصلاة وإيتاء الزكاة وأن تؤدوا خمس ما غنمتم وأنهاكم عن الدباء والحنتم والنقير والمقير ‏\"‏ ‏.‏ زاد خلف في روايته ‏\"‏ شهادة أن لا إله إلا الله ‏\"‏ ‏.‏ وعقد واحدة ‏.‏",
      "text_en": " It is narrated on the authority of Ibn 'Abbas that a delegation of Abdul Qais came to the Messenger of Allah (may peace be upon him) and said:                      Messenger of Allah, verily ours is a tribe of Rabi'a and there stand between you and us the unbelievers of Mudar and we find no freedom to come to you except in the sacred month. Direct us to an act which we should ourselves perform and invite those who live beside us. Upon this the Prophet remarked: I command you to do four things and prohibit you against four acts. (The four deeds which you are commanded to do are): Faith in Allah, and then he explained it for them and said: Testifying the fact. that there is no god but Allah, that Muhammad is the messenger of Allah, performance of prayer, payment of Zakat, that you pay Khums (one-fifth) of the booty fallen to your lot, and I prohibit you to use round gourd, wine jars, wooden pots or skins for wine. Khalaf b. Hisham has made this addition in his narration: Testifying the fact that there is no god but Allah, and then he with his finger pointed out the oneness of the Lord.",
      "usc_msa_ref": "",
      "chain": [
        "30503",
        "20022",
        "11309",
        "17",
        "30399",
        "20243",
        "11309",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-260",
      "hadith_no": "260",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثني أبو الربيع الزهراني، حدثنا حماد بن زيد، حدثنا هشام بن عروة، ح وحدثنا خلف بن هشام، - واللفظ له - حدثنا حماد بن زيد، عن هشام بن عروة، عن أبيه، عن أبي مراوح الليثي، عن أبي ذر، قال قلت يا رسول الله أى الأعمال أفضل قال ‏\"‏ الإيمان بالله والجهاد في سبيله ‏\"‏ ‏.‏ قال قلت أى الرقاب أفضل قال ‏\"‏ أنفسها عند أهلها وأكثرها ثمنا ‏\"‏ ‏.‏ قال قلت فإن لم أفعل قال ‏\"‏ تعين صانعا أو تصنع لأخرق ‏\"‏ ‏.‏ قال قلت يا رسول الله أرأيت إن ضعفت عن بعض العمل قال ‏\"‏ تكف شرك عن الناس فإنها صدقة منك على نفسك ‏\"‏ ‏.‏",
      "text_en": " Abu Dharr reported:                      I said: Messenger of Allah, which of the deeds is the best? He (the Holy Prophet) replied: Belief in Allah and Jihad in His cause. I again asked: Who is the slave whose emancipation is the best? He (the Holy Prophet) replied: One who is valuable for his master and whose price is high. I said: If I can't afford to do it? He (the Holy Prophet) replied: Help an artisan or make anything for the unskilled (labourer). I (Abu Dharr) said: Messenger of Allah, you see that I am helpless in doing some of these deeds. He (the Holy Prophet) replied: Desist from doing mischief to the people. That is the charity of your person on your behalf.",
      "usc_msa_ref": "",
      "chain": [
        "30137",
        "20022",
        "11065",
        "30503",
        "20022",
        "11065",
        "10511",
        "23"
      ]
    },
    {
      "id": "sahih-muslim-333-3",
      "hadith_no": "333",
      "source": "Sahih Muslim",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا عبد العزيز بن محمد، وأبو معاوية ح وحدثنا قتيبة بن سعيد، حدثنا جرير، ح وحدثنا ابن نمير، حدثنا أبي ح، وحدثنا خلف بن هشام، حدثنا حماد بن زيد، كلهم عن هشام بن عروة، بمثل حديث وكيع وإسناده ‏.‏ وفي حديث قتيبة عن جرير جاءت فاطمة بنت أبي حبيش بن عبد المطلب بن أسد وهي امرأة منا ‏.‏ قال وفي حديث حماد بن زيد زيادة حرف تركنا ذكره ‏.‏",
      "text_en": " The hadith narrated by Waki' and with its chain of narrators has been transmitted on the authority of Hisham b. 'Urwa, but in the hadith narrated by Qutaiba on the authority of Jarir, the words are:                     \" There came Fatimah b. Abu Hubaish, b. 'Abd al-Muttalib b. Asad, and she was a woman amongst us,\" and in the hadith of Hammid b. Zaid there is an addition of these words:\" We abandoned mentioning him.\"",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20167",
        "20354",
        "30367",
        "20028",
        "30212",
        "20331",
        "30503",
        "20022",
        "11065"
      ]
    },
    {
      "id": "sahih-muslim-378-2",
      "hadith_no": "378",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا خلف بن هشام، حدثنا حماد بن زيد، ح وحدثنا يحيى بن يحيى، أخبرنا إسماعيل ابن علية، جميعا عن خالد الحذاء، عن أبي قلابة، عن أنس، قال أمر بلال أن يشفع، الأذان ويوتر الإقامة ‏.‏ زاد يحيى في حديثه عن ابن علية فحدثت به أيوب فقال إلا الإقامة ‏.‏",
      "text_en": " Anas reported:                      Bilal was commanded (by the Apostle of Allah) to repeat (the phrases of) Adhan twice and once in Iqama. The narrator said: I made a mention of it before Ayyub who said: Except for saying: Qamat-is-Salat [the time for prayer has come].",
      "usc_msa_ref": "",
      "chain": [
        "30503",
        "20022",
        "30399",
        "20208",
        "11282",
        "11047",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-393-2",
      "hadith_no": "393",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا يحيى بن يحيى، وخلف بن هشام، جميعا عن حماد، - قال يحيى أخبرنا حماد بن زيد، - عن غيلان، عن مطرف، قال صليت أنا وعمران بن حصين، خلف علي بن أبي طالب فكان إذا سجد كبر وإذا رفع رأسه كبر وإذا نهض من الركعتين كبر فلما انصرفنا من الصلاة - قال - أخذ عمران بيدي ثم قال لقد صلى بنا هذا صلاة محمد صلى الله عليه وسلم ‏.‏ أو قال قد ذكرني هذا صلاة محمد صلى الله عليه وسلم ‏.‏",
      "text_en": " Mutarrif reported:                      I and 'Imran b. Husain said prayer behind 'Ali b. Abu, Talib. He recited takbir when he prostrated, and he recited takbir when he raised his head and he recited takbir while rising up (from the sitting position at the end of two rak'ahs). When we had finished our prayer, 'Imran caught hold of my hand and said: He (Hadrat Ali) has led prayer like Muhammad (may peace be upon him) or he said: He in fact recalled to my mind the prayer of Muhammad (may peace be upon him.)",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "30503",
        "20022",
        "20031",
        "20022",
        "11300",
        "11395"
      ]
    },
    {
      "id": "sahih-muslim-427-2",
      "hadith_no": "427",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا خلف بن هشام، وأبو الربيع الزهراني، وقتيبة بن سعيد، كلهم عن حماد، - قال خلف حدثنا حماد بن زيد، - عن محمد بن زياد، حدثنا أبو هريرة، قال قال محمد صلى الله عليه وسلم ‏\"‏ أما يخشى الذي يرفع رأسه قبل الإمام أن يحول الله رأسه رأس حمار ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      The Messenger of Allah (may peace be upon him) said: Does the man who lifts his head ahead of the Imam (from prostration) not fear that Allah may change his head into the head of an ass?",
      "usc_msa_ref": "",
      "chain": [
        "30503",
        "30137",
        "30367",
        "20022",
        "20022",
        "11216",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-469-2",
      "hadith_no": "469",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "وحدثنا خلف بن هشام، وأبو الربيع الزهراني، قالا حدثنا حماد بن زيد، عن عبد العزيز بن صهيب، عن أنس، أن النبي صلى الله عليه وسلم كان يوجز في الصلاة ويتم ‏.‏",
      "text_en": " Anas reported:                      The Apostle of Allah (may peace be upon him) used to be brief and perfect in prayer.",
      "usc_msa_ref": "",
      "chain": [
        "30503",
        "30137",
        "20022",
        "11295",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-472-2",
      "hadith_no": "472",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا خلف بن هشام، حدثنا حماد بن زيد، عن ثابت، عن أنس، قال إني لا آلو أن أصلي بكم كما رأيت رسول الله صلى الله عليه وسلم يصلي بنا ‏.‏ قال فكان أنس يصنع شيئا لا أراكم تصنعونه كان إذا رفع رأسه من الركوع انتصب قائما حتى يقول القائل قد نسي ‏.‏ وإذا رفع رأسه من السجدة مكث حتى يقول القائل قد نسي ‏.‏",
      "text_en": " Thabit reported it on the authority of Anas:                      While leading you in prayer I do not shorten anything in the prayer. I pray as I saw the Messenger of Allah (may peace be upon him) leading us. He (Thabit) said: Anas used to do that which I do not see you doing; when he lifted his head from bowing he stood up (so long) that one would say: He has forgotten (to baw down in prostration). And when he lifted his head from prostration, he stayed in that position, till someone would say: He has forgotten (to bow down in prostration for the second sajda).",
      "usc_msa_ref": "",
      "chain": [
        "30503",
        "20022",
        "11269",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-1223",
      "hadith_no": "1223",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا خلف بن هشام، حدثنا أبو الأحوص، ح قال وحدثنا ابن أبي عمر، حدثنا سفيان، كلاهما عن أبي يعفور، بهذا الإسناد إلى قوله فنهينا عنه ‏.‏ ولم يذكرا ما بعده ‏.‏",
      "text_en": " This hadith has been narrated by Abu Ya'fur with the same chain of transmitters up to these words:                      We have been forbidden from it and no mention of that has been made what follows it.",
      "usc_msa_ref": "",
      "chain": [
        "30503",
        "20327",
        "30421"
      ]
    },
    {
      "id": "sahih-muslim-1497",
      "hadith_no": "1497",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا خلف بن هشام، حدثنا حماد بن زيد، ح قال وحدثني أبو الربيع الزهراني، وأبو كامل الجحدري قالا حدثنا حماد، عن أبي عمران الجوني، عن عبد الله بن الصامت، عن أبي ذر، قال قال لي رسول الله ‏\"‏ كيف أنت إذا كانت عليك أمراء يؤخرون الصلاة عن وقتها أو يميتون الصلاة عن وقتها ‏\"‏ ‏.‏ قال قلت فما تأمرني قال ‏\"‏ صل الصلاة لوقتها فإن أدركتها معهم فصل فإنها لك نافلة ‏\"‏ ‏.‏ ولم يذكر خلف عن وقتها ‏.‏",
      "text_en": " Abu Dharr reported:                      The Messenger of Allah (may peace be upon him) said to me: How would you act when you are under the rulers who would delay the prayer beyond its prescribed time, or they would make prayer a dead thing as far as its proper time is concerned? I said: What do you command? He (the Holy Prophet) said: Observe the prayer at Its proper time, and if you can say it along with them do so, for it would be a superetogatory prayer for you. Khalaf (one of the narrators in the above hadith) has not mentioned\" beyond their (prescribed) time\".",
      "usc_msa_ref": "",
      "chain": [
        "30503",
        "20022",
        "30137",
        "30559",
        "20022",
        "11296",
        "10695",
        "23"
      ]
    },
    {
      "id": "sahih-muslim-1568",
      "hadith_no": "1568",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا أبو الربيع الزهراني، وخلف بن هشام، قالا حدثنا حماد، عن أيوب، بهذا الإسناد ‏.‏",
      "text_en": " This hadith has been transmitted by Ayyub with the same chain of narrator.",
      "usc_msa_ref": "",
      "chain": [
        "30137",
        "30503",
        "20022"
      ]
    },
    {
      "id": "sahih-muslim-1613",
      "hadith_no": "1613",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا خلف بن هشام، وأبو الربيع الزهراني، وقتيبة بن سعيد، قالوا حدثنا حماد، وهو ابن زيد ح وحدثني زهير بن حرب، ويعقوب بن إبراهيم، قالا حدثنا إسماعيل، كلاهما عن أيوب، عن أبي قلابة، عن أنس، أن رسول الله صلى الله عليه وسلم صلى الظهر بالمدينة أربعا وصلى العصر بذي الحليفة ركعتين ‏.‏",
      "text_en": " Anas reported:                      The Messenger of Allah (may peace be upon him) said four rak'ahs in the noon prayer while at Medina, but he offered two rak'ahs in the afternoon prayer at Dhu'l-Hulaifa.",
      "usc_msa_ref": "",
      "chain": [
        "30503",
        "30137",
        "30367",
        "20022",
        "30022",
        "20184",
        "11015",
        "11047",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-1797",
      "hadith_no": "1797",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا خلف بن هشام، وأبو كامل قالا حدثنا حماد بن زيد، عن أنس بن سيرين، قال سألت ابن عمر قلت أرأيت الركعتين قبل صلاة الغداة أأطيل فيهما القراءة قال كان رسول الله صلى الله عليه وسلم يصلي من الليل مثنى مثنى ويوتر بركعة - قال - قلت إني لست عن هذا أسألك ‏.‏ قال إنك لضخم ألا تدعني أستقرئ لك الحديث كان رسول الله صلى الله عليه وسلم يصلي من الليل مثنى مثنى ويوتر بركعة ويصلي ركعتين قبل الغداة كأن الأذان بأذنيه ‏.‏ قال خلف أرأيت الركعتين قبل الغداة ولم يذكر صلاة ‏.‏",
      "text_en": " Anas b. Sirin reported:                      I asked Ibn 'Umar like this (as recorded in the previous hadith) and he made this addition:\" And he (the Holy Prophet) made the end of the night prayer as odd number by one rak'ah.\" And there is also (this addition):\" Stop, stop, you are bulky.\"",
      "usc_msa_ref": "",
      "chain": [
        "30503",
        "20022",
        "11038",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-2196",
      "hadith_no": "2196",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثنا خلف بن هشام، وأبو الربيع الزهراني، جميعا عن حماد، - قال خلف حدثنا حماد بن زيد، - عن هشام بن عروة، عن أبيه، قال ذكر عند عائشة قول ابن عمر الميت يعذب ببكاء أهله عليه ‏.‏ فقالت رحم الله أبا عبد الرحمن سمع شيئا فلم يحفظه إنما مرت على رسول الله صلى الله عليه وسلم جنازة يهودي وهم يبكون عليه فقال ‏\"‏ أنتم تبكون وإنه ليعذب ‏\"‏ ‏.‏",
      "text_en": " Hisham b. 'Urwa narrated on the authority of his father that the saying of Ibn 'Umar, viz.\" The dead would be punished because of the lamentation of his family over him\" was mentioned to 'A'isha. Upon this she said:                      May Allah have mercy upon Abu 'Abd al-Rahman (the kunya of Ibn 'Umar) that he heard something but could not retain it (well). (The fact is) that the bier of a Jew passed before the Messenger of Allah (may peace be upon him) and (the members of his family) were waiting over him. Upon this he said: You are wailing and he is being punished.",
      "usc_msa_ref": "",
      "chain": [
        "30503",
        "30137",
        "20022",
        "20022",
        "11065",
        "10511"
      ]
    },
    {
      "id": "sahih-muslim-2860",
      "hadith_no": "2860",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا يحيى بن يحيى، وخلف بن هشام، وأبو الربيع، وقتيبة، جميعا عن حماد، - قال يحيى أخبرنا حماد بن زيد، - عن عمرو بن دينار، عن طاوس، عن ابن عباس، - رضى الله عنهما - قال وقت رسول الله صلى الله عليه وسلم لأهل المدينة ذا الحليفة ولأهل الشام الجحفة ولأهل نجد قرن المنازل ولأهل اليمن يلملم ‏.‏ قال ‏\"‏ فهن لهن ولمن أتى عليهن من غير أهلهن ممن أراد الحج والعمرة فمن كان دونهن فمن أهله وكذا فكذلك حتى أهل مكة يهلون منها ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Abbas (Allah be pleased with them) reported that the Messenger of Allah (may peace be upon him) specified Dhu'l-Hulaifa, for the people of Medina; Juhfa for the people of Syria; Qarn al-Manazil, for the people of Najd; Yalamlam for the people of Yemen (the Mawaqit) and those (Mawaqit) are also meant for those who live at these (places) and for those too who come from without towards them for the sake of Hajj or 'Umra. And those who live within them (within the bounds of these places) or in the suburbs of Mecca or within Mecca, they should enter upon the state of Ihram at these very places.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "30503",
        "30137",
        "20022",
        "11449",
        "20022",
        "11081",
        "11053",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-2889",
      "hadith_no": "2889",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا يحيى بن يحيى، وسعيد بن منصور، وأبو الربيع، وخلف بن هشام، وقتيبة، بن سعيد قال يحيى أخبرنا وقال الآخرون، حدثنا حماد بن زيد، عن منصور، عن إبراهيم، عن الأسود، عن عائشة، - رضى الله عنها - قالت كأني أنظر إلى وبيص الطيب في مفرق رسول الله صلى الله عليه وسلم وهو محرم ‏.‏ ولم يقل خلف وهو محرم ‏.‏ ولكنه قال وذاك طيب إحرامه ‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her) reported:                      I still seem to see the glisten- ing of the perfume where the hair parted on Allah's Messenger's (may peace be upon him) head as he was in the state of Ihram, and Khalaf (one of the narrators) did not say: As he was in the state of Ihram, but said: That was the perfume of Ihram.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "30116",
        "30137",
        "30503",
        "30367",
        "20031",
        "20022",
        "11067",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-3008",
      "hadith_no": "3008",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا خلف بن هشام، وأبو الربيع، وقتيبة، جميعا عن حماد، - قال خلف حدثنا حماد بن زيد، - عن أيوب، قال سمعت مجاهدا، يحدث عن جابر بن عبد الله، - رضى الله عنهما - قال قدمنا مع رسول الله صلى الله عليه وسلم ونحن نقول لبيك بالحج ‏.‏ فأمرنا رسول الله صلى الله عليه وسلم أن نجعلها عمرة ‏.‏",
      "text_en": " Jabir b. 'Abdullah (Allah be pleased with them) reported:                      We came with the Messenger of Allah (May peace be upon him) pronouncing Talbiya for Hajj, and the Messenger of Allah (May peace be upon him) commanded us to make (our Ihram) into that of Umra.",
      "usc_msa_ref": "",
      "chain": [
        "30503",
        "30137",
        "20022",
        "20022",
        "11015",
        "11028",
        "34"
      ]
    },
    {
      "id": "sahih-muslim-3128",
      "hadith_no": "3128",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا خلف بن هشام، والمقدمي، وأبو كامل وقتيبة بن سعيد كلهم عن حماد، - قال خلف حدثنا حماد بن زيد، - عن عاصم الأحول، عن عبد الله بن سرجس، قال رأيت الأصلع - يعني عمر بن الخطاب - يقبل الحجر ويقول والله إني لأقبلك وإني أعلم أنك حجر وأنك لا تضر ولا تنفع ولولا أني رأيت رسول الله صلى الله عليه وسلم قبلك ما قبلتك ‏.‏ وفي رواية المقدمي وأبي كامل رأيت الأصيلع ‏.‏",
      "text_en": " Abdullah b. Sarjis reported:                      I saw the bald one, i. e. 'Umar b. Khattib (Allah be pleased with him). kissing the Stone and saying: By Allah. I am kissing with full consciousness of the fact that you are a stone and that you can neither do any harm nor good; and if I had not seen Allah's Messenger (may peace be upon him) kissing you. I would not have kissed you. The rest of the hadith is the same.",
      "usc_msa_ref": "",
      "chain": [
        "30503",
        "20022",
        "20022",
        "11080",
        "3245"
      ]
    },
    {
      "id": "sahih-muslim-3554",
      "hadith_no": "3554",
      "source": "Sahih Muslim",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثناه خلف بن هشام، حدثنا حماد بن زيد، ح وحدثنيه زهير بن حرب، حدثنا سفيان بن عيينة، ح وحدثنا إسحاق بن إبراهيم، عن الدراوردي، ح وحدثنا أبو بكر بن، أبي شيبة حدثنا حسين بن علي، عن زائدة، كلهم عن أبي حازم، عن سهل بن سعد، بهذا الحديث يزيد بعضهم على بعض غير أن في حديث زائدة قال ‏\"‏ انطلق فقد زوجتكها فعلمها من القرآن ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Sahl b. Sa'd with a minor alteration of words, but the hadith transmitted through Za'idah (the words are that the Holy Prophet) said:                      Go, I have married her to you, and you teach her something of the Qur'an.",
      "usc_msa_ref": "",
      "chain": [
        "30503",
        "20022",
        "20005",
        "30123",
        "20167",
        "30201",
        "20315",
        "11349",
        "399"
      ]
    },
    {
      "id": "sahih-muslim-3637",
      "hadith_no": "3637",
      "source": "Sahih Muslim",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثنا خلف بن هشام، حدثنا مالك بن أنس، ح وحدثنا يحيى بن يحيى، - واللفظ له - قال قرأت على مالك عن محمد بن عبد الرحمن بن نوفل عن عروة عن عائشة عن جدامة بنت وهب الأسدية أنها سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لقد هممت أن أنهى عن الغيلة حتى ذكرت أن الروم وفارس يصنعون ذلك فلا يضر أولادهم ‏\"‏ ‏.‏ قال مسلم وأما خلف فقال عن جذامة الأسدية ‏.‏ والصحيح ما قاله يحيى بالدال ‏.‏",
      "text_en": " Judaima daughter of Wahb al-Asadiyya (Allah be pleased with her) reported that she heard Allah's Messenger (may peace be upon him) assaying:                      I intended to prohibit cohabitation with a suckling woman until I considered that the Romans and the Persians do it without any injury being caused to their children thereby. (Imam Muslim said: Khalaf reported it from Judamat al-'Asadiyya, but the correct wording is what has been stated by Yahya.)",
      "usc_msa_ref": "",
      "chain": [
        "30503",
        "20001",
        "30399",
        "11105",
        "10511",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-4352",
      "hadith_no": "4352",
      "source": "Sahih Muslim",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "حدثنا خلف بن هشام، وقتيبة بن سعيد، ويحيى بن حبيب الحارثي، - واللفظ لخلف - قالوا حدثنا حماد بن زيد، عن غيلان بن جرير، عن أبي بردة، عن أبي موسى، الأشعري قال أتيت النبي صلى الله عليه وسلم في رهط من الأشعريين نستحمله فقال ‏\"‏ والله لا أحملكم وما عندي ما أحملكم عليه ‏\"‏ ‏.‏ قال فلبثنا ما شاء الله ثم أتي بإبل فأمر لنا بثلاث ذود غر الذرى فلما انطلقنا قلنا - أو قال بعضنا لبعض - لا يبارك الله لنا أتينا رسول الله صلى الله عليه وسلم نستحمله فحلف أن لا يحملنا ثم حملنا ‏.‏ فأتوه فأخبروه فقال ‏\"‏ ما أنا حملتكم ولكن الله حملكم وإني والله إن شاء الله لا أحلف على يمين ثم أرى خيرا منها إلا كفرت عن يميني وأتيت الذي هو خير ‏\"‏ ‏.‏",
      "text_en": " Abu Musa al-Ash'ari reported:                      I came to Allah's Apostle (may peace be upon him) along with a group of Ash'arites requesting to give us a mount. He (the Holy Prophet) said: By Allah, I cannot provide you with a mount, and there is nothing with me which I should give you as a ride. He (the narrator) said: We stayed there as long as Allah willed. Then there were brought to him (to the Holy Prophet) camels. He (the Holy Prophet) then ordered to give us three white humped camels, We started and said (or some of us said to the others): Allah will not bless us. We came to Allah's Messenger (may peace be upon him) begging him to provide us with riding camels. He swore that he could not provide us with a mount, but later on he provided us with that. They (some of the Prophet's Companions) came and informed him about this (rankling of theirs), whereupon he said: It was not I who provided you with a mount, but Allah has provided you with that. So far as I am concerned, by Allah, if He so wills, I would not swear, but if, later on, I would see better than it, I (would break the vow) and expiate it and do that which is better.",
      "usc_msa_ref": "",
      "chain": [
        "30503",
        "30367",
        "20022",
        "11300",
        "11901",
        "41"
      ]
    },
    {
      "id": "sahih-muslim-4951",
      "hadith_no": "4951",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا يحيى بن يحيى، ومحمد بن رمح، وقتيبة بن سعيد، عن الليث بن سعد، ح وحدثنا خلف بن هشام، وأبو الربيع، وأبو كامل قالوا حدثنا حماد، - وهو ابن زيد - عن أيوب، ح وحدثنا زهير بن حرب، حدثنا إسماعيل، عن أيوب، ح وحدثنا ابن نمير، حدثنا أبي ح، وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، ح",
      "text_en": " This tradition has been handed down through another chain of transmitters with the addition of the following words from Abdullah b. 'Umar:                     \" I came first in the race and my horse jumped into the mosque with me.\"",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "30490",
        "30367",
        "20023",
        "30503",
        "30137",
        "20022",
        "11015",
        "30022",
        "20208",
        "11015",
        "30212",
        "20331"
      ]
    },
    {
      "id": "sahih-muslim-4960",
      "hadith_no": "4960",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا يحيى بن يحيى، وخلف بن هشام، وأبو بكر بن أبي شيبة جميعا عن أبي، الأحوص ح وحدثنا إسحاق بن إبراهيم، وابن أبي عمر، كلاهما عن سفيان، جميعا عن  شبيب بن غرقدة، عن عروة البارقي، عن النبي صلى الله عليه وسلم ‏.‏ ولم يذكر الأجر والمغنم ‏.‏ وفي حديث سفيان سمع عروة البارقي سمع النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " A version of the tradition narrated on the authority of 'Urwat al-Bariqi does not mention (the words):                     \" reward and booty\".",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "30503",
        "20327",
        "30123",
        "30421",
        "11430",
        "5176"
      ]
    },
    {
      "id": "sahih-muslim-5044",
      "hadith_no": "5044",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا خلف بن هشام، حدثنا حماد بن زيد، عن يحيى بن سعيد، عن محمد بن، يحيى بن حبان عن أنس بن مالك، عن أم حرام، وهى خالة أنس قالت أتانا النبي صلى الله عليه وسلم يوما فقال عندنا فاستيقظ وهو يضحك فقلت ما يضحكك يا رسول الله بأبي أنت وأمي قال ‏\"‏ أريت قوما من أمتي يركبون ظهر البحر كالملوك على الأسرة ‏\"‏ ‏.‏ فقلت ادع الله أن يجعلني منهم قال ‏\"‏ فإنك منهم ‏\"‏ ‏.‏ قالت ثم نام فاستيقظ أيضا وهو يضحك فسألته فقال مثل مقالته فقلت ادع الله أن يجعلني منهم ‏.‏ قال ‏\"‏ أنت من الأولين ‏\"‏ ‏.‏ قال فتزوجها عبادة بن الصامت بعد فغزا في البحر فحملها معه فلما أن جاءت قربت لها بغلة فركبتها فصرعتها فاندقت عنقها ‏.‏",
      "text_en": " It has been narrated on the authority of Umm Haram (and she was the aunt of Anas) who said:                      The Holy Prophet (may peace be upon him) came to us one day and had a nap in our house. When he woke up, he was laughing. I said: Messenger of Allah, what made you laugh? He said: I saw a people from my followers sailing on the surface of the sea (looking) like kings (sitting) on their thrones. I said: Pray to Allah that He may include me among them. He said: You will hip among them. He had a (second) ntip, woke up and was laughing. I asked him (the reason for his laughter). He gave the same reply. I said: Pray to Allah that He may include me among them. He said: You are among the first ones. Anas said: 'Ubada b. Samit married her. He joined a naval expedition and took her along with him. When she returned, a mule was brought for her. While mounting it she fell down, broke her neck (and died).",
      "usc_msa_ref": "",
      "chain": [
        "30503",
        "20022",
        "20031",
        "11222",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-5293",
      "hadith_no": "5293",
      "source": "Sahih Muslim",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا عباد بن عباد، عن أبي جمرة، عن ابن عباس، ح وحدثنا خلف بن هشام، حدثنا حماد بن زيد، عن أبي جمرة، قال سمعت ابن عباس، يقول قدم وفد عبد القيس على رسول الله صلى الله عليه وسلم فقال النبي صلى الله عليه وسلم ‏\"‏ أنهاكم عن الدباء والحنتم والنقير والمقير ‏\"‏ ‏.‏ وفي حديث حماد جعل - مكان المقير - المزفت ‏.‏",
      "text_en": " Ishaq b. Suwaid reported through the same chain of transmitters but for the difference that he substituted the word\" gourd\" for\" waterskin\" (meant for preserving wine).",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20243",
        "11309",
        "17",
        "30503",
        "20022",
        "11309",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-5599",
      "hadith_no": "5599",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "حدثنا يحيى بن يحيى، وخلف بن هشام، وأبو الربيع العتكي، كلهم عن حماد،- قال يحيى أخبرنا حماد بن زيد، - عن عبد العزيز بن صهيب، عن أنس بن مالك، أنوسلم اتخذ خاتما من فضة ونقش فيه محمد رسول الله ‏.‏ وقالللناس ‏\"‏ إني اتخذت خاتما من فضة ونقشت فيه محمد رسول الله ‏.‏ فلا ينقش أحد علىنقشه ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik reported that Allah's Apostle (may peace be upon him) had made for him a silver ring. and got engraved on it (Mubamrnad, Messenger of Allah) and said to the people I have got made a ring of silver and engraved in it (these words) (Mubamrnad, Messenger of Allah). So none should engrave these (words) like this engravement.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "30503",
        "20031",
        "20022",
        "11295"
      ]
    },
    {
      "id": "sahih-muslim-6436",
      "hadith_no": "6436",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا خلف بن هشام، وأبو الربيع، جميعا عن حماد بن زيد، - واللفظ لأبي الربيع - حدثنا حماد، حدثنا هشام، عن أبيه، عن عائشة، أنها قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ أريتك في المنام ثلاث ليال جاءني بك الملك في سرقة من حرير فيقول هذه امرأتك ‏.‏ فأكشف عن وجهك فإذا أنت هي فأقول إن يك هذا من عند الله يمضه ‏\"‏ ‏.‏",
      "text_en": " 'A'isha reported Allah's Messenger (may peace be upon him) having said:                      I saw you in a dream for three nights when an angel brought you to me in a silk cloth and he said: Here is your wife, and when I removed (the cloth) from your face, lo, it was yourself, so I said: If this is from Allah, let Him carry it out.",
      "usc_msa_ref": "",
      "chain": [
        "30503",
        "20022",
        "20022",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-6524",
      "hadith_no": "6524",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا أبو الربيع العتكي، وخلف بن هشام، وأبو كامل الجحدري كلهم عن حماد، بن زيد - قال أبو الربيع حدثنا حماد بن زيد، - حدثنا أيوب، عن نافع، عن ابن عمر، قال رأيت في المنام كأن في يدي قطعة إستبرق وليس مكان أريد من الجنة إلا طارت إليه - قال - فقصصته على حفصة فقصته حفصة على النبي صلى الله عليه وسلم فقال النبي صلى الله عليه وسلم ‏\"‏ أرى عبد الله رجلا صالحا ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Umar reported:                      I saw in a state of sleep as if I have in my hand a piece of silk cloth and there is no place in the Paradise where I intend to reach but that piece of cloth does not fly towards it. I made a mention of it to Hafsa (the sister of Ibn 'Umar) and Hafsa made a mention of it to Allah's Apostle (may peace be upon him), whereupon Allah's Apostle (may peace be upon him) said: I find 'Abdullah b 'Umar a pious person.",
      "usc_msa_ref": "",
      "chain": [
        "30503",
        "30559",
        "20022",
        "30137",
        "20022",
        "11015",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-7041",
      "hadith_no": "7041",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا خلف بن هشام، وأبو الربيع، قالا حدثنا حماد بن زيد، عن أيوب، عن أبي، عثمان عن أبي موسى، قال كنا مع النبي صلى الله عليه وسلم في سفر ‏.‏ فذكر نحو حديث عاصم ‏.‏",
      "text_en": " Abu Musa reported:                      We were along with Allah's Apostle (may peace be upon him) on a journey; the rest of the hadith is the same as transmitted by A'sim.",
      "usc_msa_ref": "",
      "chain": [
        "30503",
        "30137",
        "20022",
        "11015",
        "11113",
        "41"
      ]
    },
    {
      "id": "sunan-abi-daud-42",
      "hadith_no": "42",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا قتيبة بن سعيد، وخلف بن هشام المقرئ، قالا حدثنا عبد الله بن يحيى التوأم، ح وحدثنا عمرو بن عون، قال أخبرنا أبو يعقوب التوأم، عن عبد الله بن أبي مليكة، عن أمه، عن عائشة، قالت بال رسول الله صلى الله عليه وسلم فقام عمر خلفه بكوز من ماء فقال ‏\"‏ ما هذا يا عمر ‏\"‏ ‏.‏ فقال هذا ماء تتوضأ به ‏.‏ قال ‏\"‏ ما أمرت كلما بلت أن أتوضأ ولو فعلت لكانت سنة ‏\"‏ ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     The Prophet (ﷺ) urinated and Umar was standing behind him with a jug of water. He said: What is this, Umar? He replied: Water for you to perform ablution with. He said: I have not been commanded to perform ablution every time I urinate. If I were to do so, it would become a sunnah.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "30503",
        "28315",
        "30154",
        "11090",
        "19528",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-2339",
      "hadith_no": "2339",
      "source": "Sunan Abi Da'ud",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا مسدد، وخلف بن هشام المقرئ، قالا حدثنا أبو عوانة، عن منصور، عن ربعي بن حراش، عن رجل، من أصحاب النبي صلى الله عليه وسلم قال اختلف الناس في آخر يوم من رمضان فقدم أعرابيان فشهدا عند رسول الله صلى الله عليه وسلم بالله لأهلا الهلال أمس عشية فأمر رسول الله صلى الله عليه وسلم الناس أن يفطروا زاد خلف في حديثه وأن يغدوا إلى مصلاهم ‏.‏",
      "text_en": " Narrated Rib'i b. Hirash:                     On the authority of a man from the Companions of the Prophet (ﷺ): People differed among themselves on the last day of Ramadan (about the appearance of the moon of Shawwal). Then two bedouins came and witnessed before the Prophet (ﷺ) swearing by Allah that they had sighted moon the previous evening. So the Messenger of Allah (ﷺ) commanded the people to break the fast. The narrator Khalaf has added in his version: \"and that they should proceed to the place of prayer (for 'Id)\".",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "30503",
        "20469",
        "11067",
        "11334"
      ]
    },
    {
      "id": "sunan-abi-daud-3750",
      "hadith_no": "3750",
      "source": "Sunan Abi Da'ud",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا مسدد، وخلف بن هشام، قالا حدثنا أبو عوانة، عن منصور، عن عامر، عن أبي كريمة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ليلة الضيف حق على كل مسلم فمن أصبح بفنائه فهو عليه دين إن شاء اقتضى وإن شاء ترك ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuKarimah:                     The Prophet (ﷺ) said: It is a duty of every Muslim (to provide hospitality) to a guest for a night. If anyone comes in the morning to his house, it is a debt due to him. If he wishes, he may fulfil it, and if he wishes he may leave it.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "30503",
        "20469",
        "11067",
        "11052"
      ]
    },
    {
      "id": "sunan-abi-daud-4337",
      "hadith_no": "4337",
      "source": "Sunan Abi Da'ud",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا خلف بن هشام، حدثنا أبو شهاب الحناط، عن العلاء بن المسيب، عن عمرو بن مرة، عن سالم، عن أبي عبيدة، عن ابن مسعود، عن النبي صلى الله عليه وسلم بنحوه زاد ‏\"‏ أو ليضربن الله بقلوب بعضكم على بعض ثم ليلعننكم كما لعنهم ‏\"‏ ‏.‏ قال أبو داود رواه المحاربي عن العلاء بن المسيب عن عبد الله بن عمرو بن مرة عن سالم الأفطس عن أبي عبيدة عن عبد الله رواه خالد الطحان عن العلاء عن عمرو بن مرة عن أبي عبيدة ‏.‏",
      "text_en": " A similar tradition (to the No. 4322) has also been transmitted by Ibn Mas'ud through a different chain of narrators to the same effect. This version adds:                      \"Or Allah will mingle your hearts together and curse you as He cursed them.\"Abu Dawud said: This tradition has been transmitted by al-Muharibi, from al-'Ala bin al-Musayyab, from 'Abd Allah bin 'Amr bin Murrah, from Salim al-Aftas, from Abu Ubaidah, from 'Abd Allah; and it is been transmitted by Khalid al-Tahhan, from al-'Ala, from 'Amr bin Murrah from Abu 'Ubaidah.",
      "usc_msa_ref": "",
      "chain": [
        "30503",
        "11613",
        "11647",
        "11381",
        "11011",
        "10",
        "16"
      ]
    }
  ],
  "total_hadiths": 33
}