{
  "id": "30512",
  "name": "Muhammad bin Bkar bin al-Ryan محمد بن بكار بن الريان الهاشمي مولاهم",
  "full_name": "Muhammad bin Bkar bin al-Ryan محمد بن بكار بن الريان الهاشمي مولاهم",
  "grade": "3rd Century AH [10th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "238",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Baghdad"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  د  -  ثقة ]"
    ],
    "tags": [
      "B.Hashim",
      "Client",
      "al-Baghdadi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20155",
      "name": "Isma'il bin Ja'far bin Abi Kathir إسماعيل بن جعفر بن أبي كثير الأنصاري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20169",
      "name": "Falayh bin Suliaman فليح بن سليمان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "25246",
      "name": "Qays bin al-Rabi' al-'Asady Abu قيس بن الربيع الأسدي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "27031",
      "name": "Frj bin Fdalh bin al-N'man فرج بن فضالة بن النعمان",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20532",
      "name": "Ja'far bin Sulaiman al-Daba'i جعفر بن سليمان الضبعي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20417",
      "name": "Hisan bin Ibrahim حسان بن إبراهيم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20313",
      "name": "Isma'il bin Zakaria bin Mrh إسماعيل بن زكريا بن مرة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20243",
      "name": "'Aabad bin 'Aabad bin Habib عباد بن عباد بن حبيب بن المهلب",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20509",
      "name": "'Abdur Rahman bin Abi al-Zanad عبد الرحمن بن أبي الزناد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20604",
      "name": "Muhammad bin Talha bin Masraf محمد بن طلحة بن مصرف",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "27362",
      "name": "al-Walid bin Abi Thwr Sm' الوليد بن أبي ثور",
      "grade": "Succ. (Taba' Tabi')"
    },
    {
      "id": "20468",
      "name": "Hashaym bin Bashayr bin al-Qasim هشيم بن بشير بن القاسم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20027",
      "name": "Yusuf bin Y'aqub bin Abi Salma يوسف بن يعقوب بن أبي سلمة الماجشون",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "students": [
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "30554",
      "name": "Abu Zara' al-Razi أبو زرعة الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30511",
      "name": "Muhammad bin Ishaq al-Saghani محمد بن إسحاق الصغاني",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30218",
      "name": "Musa bin Harun bin Bashyr موسى بن هارون بن بشير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30467",
      "name": "'Abdullah bin 'Amir عبد الله بن عامر بن زرارة الحضرمي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30013",
      "name": "Ibn Abi Dunya ابن أبي الدنيا",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "31742",
      "name": "Abu Bakr bin Abi Khuthama أبو بكر بن أبي خيثمة",
      "grade": "3rd Century AH"
    },
    {
      "id": "37535",
      "name": "Mua'wiya bin Salah bin al-Wazir معاوية بن صالح بن الوزير",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "129",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثني محمد بن بكار البصري، حدثنا أبو عاصم، عن ابن جريج، ح وحدثني محمد بن رافع، - واللفظ له - حدثنا عبد الرزاق، أخبرنا ابن جريج، قال أخبرني أبو قزعة، أن أبا نضرة، أخبره وحسنا، أخبرهما أن أبا سعيد الخدري أخبره أن وفد عبد القيس لما أتوا نبي الله صلى الله عليه وسلم قالوا يا نبي الله جعلنا الله فداءك ماذا يصلح لنا من الأشربة فقال ‏\"‏ لا تشربوا في النقير ‏\"‏ ‏.‏ قالوا يا نبي الله جعلنا الله فداءك أوتدري ما النقير قال ‏\"‏ نعم الجذع ينقر وسطه ولا في الدباء ولا في الحنتمة وعليكم بالموكى ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Said al-Khudri that when the delegation of the tribe of Abdul-Qais came to the Prophet of Allah (may peace be upon him), (its members) said:                      Apostle of Allah, may God enable us to lay down our lives for you, which beverage is good for us? He (the Prophet) said: (Not to speak of beverages, I would lay stress) that you should not drink in the wine jars. They said: Apostle of Allah, may God enable us to lay down our lives for you, do you know what al-naqir is? He (the Holy Prophet) replied: Yes, it is a stump which you hollow out in the middle, and added: Do not use gourd or receptacle (for drink). Use water-skin the mouth of which is tied with a thong (for this purpose).",
      "chain": [
        "30512",
        "20241",
        "11070",
        "30375",
        "20121",
        "11070",
        "10689",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "230",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن بكار بن الريان، وعون بن سلام، قالا حدثنا محمد بن طلحة، ح وحدثنا محمد بن المثنى، حدثنا عبد الرحمن بن مهدي، حدثنا سفيان، ح وحدثنا محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، كلهم عن زبيد، عن أبي وائل، عن عبد الله بن مسعود، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ سباب المسلم فسوق وقتاله كفر ‏\"‏ ‏.‏ قال زبيد فقلت لأبي وائل أنت سمعته من عبد الله يرويه عن رسول الله صلى الله عليه وسلم قال نعم ‏.‏ وليس في حديث شعبة قول زبيد لأبي وائل ‏.‏",
      "text_en": " It is narrated on the authority of 'Abdullah b. Mas'ud that the Messenger of Allah (may peace and blessings be upon him) observed:                      Abusing a Muslim is an outrage and fighting against him is unbelief. Zubaid said: I asked Abu Wa'il: Did you hear it from Abdullah narrating if from the Messenger of Allah (may peace and blessings be upon him)? He replied: Yes. But there is mention of the talk between Zubaid and Abu Wa'il in the hadith narrated by Shu'ba.",
      "chain": [
        "30512",
        "30474",
        "20604",
        "30170",
        "20033",
        "20005",
        "30170",
        "20173",
        "11335",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "406",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن بكار، حدثنا إسماعيل بن زكرياء، عن الأعمش، وعن مسعر، وعن مالك بن مغول، كلهم عن الحكم، بهذا الإسناد مثله غير أنه قال ‏\"‏ وبارك على محمد ‏\"‏ ‏.‏ ولم يقل اللهم ‏.‏",
      "text_en": " A hadith like this has been narrated by al-Hakam except that he said:                     \" Bless Muhammad (may peace be upon him)\" and he did not say:\" O Allah I",
      "chain": [
        "30512",
        "20313",
        "11060",
        "20359",
        "20358"
      ]
    },
    {
      "hadith_no": "1539",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا سعيد بن عمرو الأشعثي، أخبرنا عبثر، ح وحدثني محمد بن بكار بن الريان، قال حدثنا إسماعيل بن زكرياء، ح وحدثنا ابن المثنى، قال حدثنا ابن أبي عدي، عن شعبة، كلهم عن الأعمش، في هذا الإسناد بمثل معناه ‏.‏",
      "text_en": " A hadith having the same meaning (as mentioned above) has been transmitted by A'mash.",
      "chain": [
        "30465",
        "30512",
        "20313",
        "20276"
      ]
    },
    {
      "hadith_no": "3351",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا محمد بن بكار بن الريان، وسريج بن يونس، - واللفظ لسريج - قالا حدثنا إسماعيل بن جعفر، أخبرني موسى بن عقبة، عن سالم بن عبد الله بن عمر، عن أبيه، أن النبي صلى الله عليه وسلم أتي وهو في معرسه من ذي الحليفة في بطن الوادي فقيل إنك ببطحاء مباركة ‏.‏ قال موسى وقد أناخ بنا سالم بالمناخ من المسجد الذي كان عبد الله ينيخ به يتحرى معرس رسول الله صلى الله عليه وسلم وهو أسفل من المسجد الذي ببطن الوادي بينه وبين القبلة وسطا من ذلك ‏.‏",
      "text_en": " Salim b. Abdullah b. Umar reported on the authority of his father (Allah be pleased with them) that Allah's Apostle (may peace be upon him) came to Dhu'l- Hulaifa in the heart of the valley at the fag end of the night, and it was said to him:                      It is a blessed stony ground. Musa (one of the narrators) said: Salim made his came) halt at the mosque where 'Abdullah made his camel halt as seeking the place of stay of Allah's Messenger (may peace be upon him). It is, in fact, situated at a lower plain than the mosque, which stands in the heart of the valley, and it is between it (the mosque) (and Qibla) that that place (where Allah's Apostle used to get down for rest and prayer) is situated.",
      "chain": [
        "30512",
        "30251",
        "20155",
        "11106",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "6220",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا محمد بن بكار بن الريان، حدثنا إسماعيل بن زكرياء، عن عاصم الأحول، عن ابن سيرين، قال سألت أنس بن مالك هل كان رسول الله صلى الله عليه وسلم خضب فقال لم يبلغ الخضاب كان في لحيته شعرات بيض ‏.‏ قال قلت له أكان أبو بكر يخضب قال فقال نعم بالحناء والكتم ‏.‏",
      "text_en": " Ibn Sirin reported:                      I asked Anas b. Malik whether Allah's Messenger (may peace be upon him) dyed his hair. He said: He had not reached the stage when (he needed) dyeing (of his white hair). He had a few white hair in his beard. I said to him: Did Abu Bakr dye his hair? He said: Yes, with hina' (henna).",
      "chain": [
        "30512",
        "20313",
        "11080",
        "11035",
        "19"
      ]
    },
    {
      "hadith_no": "6379",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "وحدثنا محمد بن بكار بن الريان، حدثنا حسان، - يعني ابن إبراهيم - عن  سعيد بن مسروق، عن يزيد بن حيان، عن زيد بن أرقم، عن النبي صلى الله عليه وسلم ‏.‏ وساق الحديث بنحوه بمعنى حديث زهير ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Zaid b. Arqam through another chain of transmitters.",
      "chain": [
        "30512",
        "20417",
        "20016",
        "28642",
        "384"
      ]
    },
    {
      "hadith_no": "6381",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمد بن بكار بن الريان، حدثنا حسان، - يعني ابن إبراهيم - عن سعيد، - وهو ابن مسروق - عن يزيد بن حيان، عن زيد بن أرقم، قال دخلنا عليه فقلنا له لقد رأيت خيرا ‏.‏ لقد صاحبت رسول الله صلى الله عليه وسلم وصليت خلفه ‏.‏ وساق الحديث بنحو حديث أبي حيان غير أنه قال ‏\"‏ ألا وإني تارك فيكم ثقلين أحدهما كتاب الله عز وجل هو حبل الله من اتبعه كان على الهدى ومن تركه كان على ضلالة ‏\"‏ ‏.‏ وفيه فقلنا من أهل بيته نساؤه قال لا وايم الله إن المرأة تكون مع الرجل العصر من الدهر ثم يطلقها فترجع إلى أبيها وقومها أهل بيته أصله وعصبته الذين حرموا الصدقة بعده ‏.‏",
      "text_en": " Yazid b. Hayyan reported:                      We went to him (Zaid b. Arqam) and said to him. You have found goodness (for you had the honour) to live in the company of Allah's Messenger (may peace be upon him) and offered prayer behind him, and the rest of the hadith is the same but with this variation of wording that lie said: Behold, for I am leaving amongst you two weighty things, one of which is the Book of Allah, the Exalted and Glorious, and that is the rope of Allah. He who holds it fast would be on right guidance and he who abandons it would be in error, and in this (hadith) these words are also found: We said: Who are amongst the members of the household? Aren't the wives (of the Holy Prophet) included amongst the members of his house hold? Thereupon he said: No, by Allah, a woman lives with a man (as his wife) for a certain period; he then divorces her and she goes back to her parents and to her people; the members of his household include his ownself and his kith and kin (who are related to him by blood) and for him the acceptance of Zakat is prohibited.",
      "chain": [
        "30512",
        "20417",
        "20016",
        "28642",
        "384"
      ]
    },
    {
      "hadith_no": "755",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن بكار بن الريان، عن هشيم بن بشير، عن الحجاج بن أبي زينب، عن أبي عثمان النهدي، عن ابن مسعود، أنه كان يصلي فوضع يده اليسرى على اليمنى فرآه النبي صلى الله عليه وسلم فوضع يده اليمنى على اليسرى ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     AbuUthman an-Nahdi said: When Ibn Mas'ud prayed he placed his left hand on the right. The Prophet (ﷺ) saw him and placed his right hand on his left one.",
      "chain": [
        "30512",
        "20468",
        "11113",
        "16"
      ]
    },
    {
      "hadith_no": "1328",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن بكار بن الريان، حدثنا عبد الله بن المبارك، عن عمران بن زائدة، عن أبيه، عن أبي خالد الوالبي، عن أبي هريرة، أنه قال ‏:‏ كانت قراءة النبي صلى الله عليه وسلم بالليل يرفع طورا ويخفض طورا ‏.‏ قال أبو داود ‏:‏ أبو خالد الوالبي اسمه هرمز ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     The Prophet's (ﷺ) recitation at night was partly in a loud voice and partly in a low voice.Abu Dawud said: The name of Abu Khalid al-Walibi is Hurmuz.",
      "chain": [
        "30512",
        "20025",
        "25218",
        "15670",
        "13"
      ]
    },
    {
      "hadith_no": "2340",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا محمد بن بكار بن الريان، حدثنا الوليد، - يعني ابن أبي ثور ح وحدثنا الحسن بن علي، حدثنا الحسين، - يعني الجعفي - عن زائدة، - المعنى - عن سماك، عن عكرمة، عن ابن عباس، قال جاء أعرابي إلى النبي صلى الله عليه وسلم فقال إني رأيت الهلال - قال الحسن في حديثه يعني رمضان - فقال ‏\"‏ أتشهد أن لا إله إلا الله ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ أتشهد أن محمدا رسول الله ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ يا بلال أذن في الناس فليصوموا غدا ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     A bedouin came to the Prophet (ﷺ) and said: I have sighted the moon. Al-Hasan added in his version: that is, of Ramadan. He asked: Do you testify that there is no god but Allah? He replied: Yes. He again asked: Do you testify that Muhammad is the Messenger of Allah? He replied: Yes. and he testified that he had sighted the moon. He said: Bilal, announce to the people that they must fast tomorrow.",
      "chain": [
        "30512",
        "27362",
        "30",
        "20315",
        "10770",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2493",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن بكار العيشي، حدثنا مروان، ح حدثنا عبد الوهاب بن عبد الرحيم الجوبري الدمشقي، - المعنى - قال حدثنا مروان، أخبرنا هلال بن ميمون الرملي، عن يعلى بن شداد، عن أم حرام، عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ المائد في البحر الذي يصيبه القىء له أجر شهيد والغرق له أجر شهيدين ‏\"‏ ‏.‏",
      "text_en": " Umm Haram reported the Prophet(ﷺ) as saying “He who becomes sick on a stormy sea and vomits will have the reward of a martyr. And he who is drowned will have a reward of two martyrs.",
      "chain": [
        "30512",
        "20201",
        "20201",
        "15594"
      ]
    },
    {
      "hadith_no": "2631",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا أحمد بن محمد بن علي بن نيزك البغدادي، حدثنا محمد بن بكار الدمشقي، حدثنا سعيد بن بشير، عن قتادة، عن الحسن، عن سمرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن لكل نبي حوضا وإنهم يتباهون أيهم أكثر واردة وإني أرجو أن أكون أكثرهم واردة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏ وقد روى الأشعث بن عبد الملك هذا الحديث عن النبي صلى الله عليه وسلم مرسلا ولم يذكر فيه عن سمرة وهو أصح ‏.‏",
      "text_en": " Samurah narrated the Messenger of Allah (s.a.w)said:                     \"Indeed  there is a Hawd for every Prophet, and indeed they compete to see which of them has the most arriving at it. Indeed I hope that mine will be the one with the most arrival.\"",
      "chain": [
        "30304",
        "30512",
        "20710",
        "11019",
        "11016",
        "394"
      ]
    },
    {
      "hadith_no": "4647",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا الهيثم بن مروان بن الهيثم بن عمران، قال حدثنا محمد بن بكار، قال حدثنا يحيى، - وهو ابن حمزة - عن الزبيدي، أن الزهري، أخبره عن عمارة بن خزيمة، أن عمه، حدثه - وهو، من أصحاب النبي صلى الله عليه وسلم - أن النبي صلى الله عليه وسلم ابتاع فرسا من أعرابي واستتبعه ليقبض ثمن فرسه فأسرع النبي صلى الله عليه وسلم وأبطأ الأعرابي وطفق الرجال يتعرضون للأعرابي فيسومونه بالفرس وهم لا يشعرون أن النبي صلى الله عليه وسلم ابتاعه حتى زاد بعضهم في السوم على ما ابتاعه به منه فنادى الأعرابي النبي صلى الله عليه وسلم فقال إن كنت مبتاعا هذا الفرس وإلا بعته ‏.‏ فقام النبي صلى الله عليه وسلم حين سمع نداءه فقال ‏\"‏ أليس قد ابتعته منك ‏\"‏ ‏.‏ قال لا والله ما بعتكه ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ قد ابتعته منك ‏\"‏ ‏.‏ فطفق الناس يلوذون بالنبي صلى الله عليه وسلم وبالأعرابي وهما يتراجعان وطفق الأعرابي يقول هلم شاهدا يشهد أني قد بعتكه ‏.‏ قال خزيمة بن ثابت أنا أشهد أنك قد بعته ‏.‏ قال فأقبل النبي صلى الله عليه وسلم على خزيمة فقال ‏\"‏ لم تشهد ‏\"‏ ‏.‏ قال بتصديقك يا رسول الله ‏.‏ قال فجعل رسول الله صلى الله عليه وسلم شهادة خزيمة شهادة رجلين ‏.‏",
      "text_en": " It was narrated from 'Umarah bin Khuzaimah that his paternal uncle, who was one of the companions of the Prophet told him, that:                     the Prophet bought a horse from a Bedouin and asked him to follow him, so that he could pay him for the horse. The Prophet hastened but the Bedouin was slow. Men started to talk to the Bedouin and make offers for the horse, and they did not realize that the Prophet had bought it, until some of them offered more than the Prophet had bought it for. Then the Bedouin called out to the Prophet and said; \"Are you going to buy this horse or shall I sell it?\" The Prophet stood up when he heard him calling and said: \"Have I not bought it from you?\" He said: 'No, by Allah, I have not sold it to you, and the Prophet said \"I bought it from you.\" The people started to gaiter around the Prophet and the Bedouion as they were talking, and the Bedouin started to say: \"Bring a witness who will testify that you bought it. \" Khuzaimah bin habit said: \"I bear witness that you bought it\" The Prophet turned to Khunzimah and said: \"Why are you bearing witness?\" He said: \"Because I know that you are truthful, O Messenger of Allah\" made the testimony of Khuzaimah equivalent to the testimony of two men. (sahih)",
      "chain": [
        "37542",
        "30512",
        "20402",
        "20459",
        "11013",
        "19817"
      ]
    },
    {
      "hadith_no": "2851",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Shares of Inheritance - كتاب الفرائض",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا محمد بن بكار بن بلال الدمشقي، أنبأنا محمد بن راشد، عن سليمان بن موسى، عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ كل مستلحق استلحق بعد أبيه الذي يدعى له ادعاه ورثته من بعده فقضى أن من كان من أمة يملكها يوم أصابها فقد لحق بمن استلحقه وليس له فيما قسم قبله من الميراث شىء وما أدرك من ميراث لم يقسم فله نصيبه ولا يلحق إذا كان أبوه الذي يدعى له أنكره وإن كان من أمة لا يملكها أو من حرة عاهر بها فإنه لا يلحق ولا يورث وإن كان الذي يدعى له هو ادعاه فهو ولد زنا لأهل أمه من كانوا حرة أو أمة ‏\"‏ ‏.‏ قال محمد بن راشد يعني بذلك ما قسم في الجاهلية قبل الإسلام ‏.‏",
      "text_en": " It wasnarrated from ‘Amr bin Shu’aib, from his father, from hisgrandfather, that the Messenger of Allah (ﷺ) said:                      “Every childwhois attributed to his father after his father to whom he isattributedhas died, and his heirs attributed him to him after hedied, he ruledthat* whoever was born to a slave woman whom he ownedat the time whenhe had intercourse with her, he should be namedafter the one to whomhe was attributed, but he has no share of anyinheritance that wasdistributed previously. Whatever inheritance hefinds has not yet beendistributed, he will have a share of it. Buthe cannot be named afterhis father if the man whom he claimed as hisfather did notacknowledge him. If he as born to a slave woman whomhis father didnot own, or to a free woman with whom he committedadultery, then hecannot be named after him and he does not inheritfrom him, even ifthe one whom he claims as his father acknowledgeshim. So he is anillegitimate child who belongs to his mother’speople, whoever theyare, whether she is a free woman or a slave.”",
      "chain": [
        "11222",
        "30512",
        "20719",
        "10880",
        "19934",
        "19911"
      ]
    }
  ],
  "total_hadiths": 15
}