{
  "id": "30516",
  "name": "Muhammad bin Sahl bin Askr محمد بن سهل بن عسكر",
  "full_name": "Muhammad bin Sahl bin Askr محمد بن سهل بن عسكر",
  "grade": "3rd Century AH [11th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "251",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Baghdad"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  ت  س  -  ثقة ]"
    ],
    "tags": [
      "al-Tamimi",
      "Client",
      "Baghdad"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20262",
      "name": "'Uthman bin 'Umar bin Fars عثمان بن عمر بن فارس",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20121",
      "name": "'Abdur-Razzaq عبد الرزاق بن همام",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20300",
      "name": "Yahya bin Hsan يحيى بن حسان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "38456",
      "name": "al-Qasim bin Kathir bin al-N'man القاسم بن كثير بن النعمان الإسكندراني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20034",
      "name": "Muhammad bin Yusuf al-Faryabi محمد بن يوسف الفريابي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30232",
      "name": "Sa'id bin Abi Maryam سعيد بن أبي مريم",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20340",
      "name": "'Ubaidullah bin Musa bin Abi al-Mukhtar عبيد الله بن موسى بن أبي المختار باذام",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]"
    },
    {
      "id": "30005",
      "name": "Imam Tirmidhi الترمذي محمد بن عيسى بن سورة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30006",
      "name": "Imam Nasa'i أحمد بن شعيب بن علي بن سنان النسائي",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30023",
      "name": "Muhammad bin Yahya bin Faris al-Dhahli محمد بن يحيى بن فارس الذهلي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30013",
      "name": "Ibn Abi Dunya ابن أبي الدنيا",
      "grade": "3rd Century AH [12th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "211",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن سهل بن عسكر البغدادي، وإبراهيم بن يعقوب، قالا حدثنا علي بن عياش الحمصي، حدثنا شعيب بن أبي حمزة، حدثنا محمد بن المنكدر، عن جابر بن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من قال حين يسمع النداء اللهم رب هذه الدعوة التامة والصلاة القائمة آت محمدا الوسيلة والفضيلة وابعثه مقاما محمودا الذي وعدته إلا حلت له الشفاعة يوم القيامة ‏\"‏ ‏.‏ قال أبو عيسى حديث جابر حديث صحيح حسن غريب من حديث محمد بن المنكدر لا نعلم أحدا رواه غير شعيب بن أبي حمزة عن محمد بن المنكدر ‏.‏ وأبو حمزة اسمه دينار ‏.‏",
      "text_en": " Jabir bin Abdullah narrated that :                     Allah's Messenger said: \"Whoever says, when he hears the call: (Allahumma, rabba hadhihidda 'watit-tammati was Salatilqa'imah, ati Muhammadanil wasilata wal-Fadilata, wab'athhu Maqamun Mahmudan alladhi wa'adtahu) 'O Allah! Lord of this perfect call and established prayer, grant Muhammad Al-Wasilah and Al-Fadilah, and raise him to the praised station that you promised him' - then intercession on the Day of Resurrection is made lawful for him.\"",
      "chain": [
        "30516",
        "38088",
        "20448",
        "20428",
        "11048",
        "34"
      ]
    },
    {
      "hadith_no": "1342",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Chapters On Judgements From The Messenger of Allah - كتاب الأحكام عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن سهل بن عسكر البغدادي، حدثنا محمد بن يوسف، حدثنا نافع بن عمر الجمحي، عن عبد الله بن أبي مليكة، عن ابن عباس، أن رسول الله صلى الله عليه وسلم قضى أن اليمين على المدعى عليه ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ والعمل على هذا عند أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم أن البينة على المدعي واليمين على المدعى عليه ‏.‏",
      "text_en": " Ibn 'Abbas narrated that the Messenger of Allah (ﷺ) judged that the oath is due from the one the claim is made against.",
      "chain": [
        "30516",
        "30388",
        "20203",
        "11090",
        "17"
      ]
    },
    {
      "hadith_no": "1653",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Virtues of Jihad - كتاب فضائل الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "22",
      "text_ar": "حدثنا محمد بن سهل بن عسكر البغدادي، حدثنا القاسم بن كثير المصري، حدثنا عبد الرحمن بن شريح، أنه سمع سهل بن أبي أمامة بن سهل بن حنيف، يحدث عن أبيه، عن جده، عن النبي صلى الله عليه وسلم قال ‏\"‏ من سأل الله الشهادة من قلبه صادقا بلغه الله منازل الشهداء وإن مات على فراشه ‏\"‏ ‏.‏ قال أبو عيسى حديث سهل بن حنيف حديث حسن غريب لا نعرفه إلا من حديث عبد الرحمن بن شريح ‏.‏ وقد رواه عبد الله بن صالح عن عبد الرحمن بن شريح ‏.‏ وعبد الرحمن بن شريح يكنى أبا شريح وهو إسكندراني ‏.‏ وفي الباب عن معاذ بن جبل ‏.‏",
      "text_en": " Narrated Sahl bin Abi Umamah bin Sahl bin Hunaif:                     From his father, from his grandfather, that the Prophet (ﷺ) said: \"Whoever asks Allah for Martyrdom sincerely in his heart, Allah will grant the status of martyrdom for him, even if he were to die in his bed.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib as a narration of Sahl bin Hunaif. We do not know of it except from the report of 'Abdur-Rahman bin Shuraih. 'Abdullah bin Salih reported it from 'Abdur-Rahman bin Shuraih, and 'Abdur-Rahman bin Shuraih's kunyah is Abu Shuriah, and he is from Iskandarani.There is something on this topic from Mu'adh bin Jabal.",
      "chain": [
        "30516",
        "38456",
        "20438",
        "11857",
        "405"
      ]
    },
    {
      "hadith_no": "1815",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن سهل بن عسكر البغدادي، وعبد الله بن عبد الرحمن، قالا حدثنا يحيى بن حسان، حدثنا سليمان بن بلال، عن هشام بن عروة، عن أبيه، عن عائشة، عن النبي صلى الله عليه وسلم قال ‏\"‏ بيت لا تمر فيه جياع أهله ‏\"‏ ‏.‏ قال وفي الباب عن سلمى امرأة أبي رافع ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه من حديث هشام بن عروة إلا من هذا الوجه ‏.‏ قال وسألت البخاري عن هذا الحديث فقال لا أعلم أحدا رواه غير يحيى بن حسان ‏.‏",
      "text_en": " Narrated 'Aishah:                     That the Prophet (ﷺ) said: \"A house without dates, its inhabitants will be hungry.\"He said: There are narrations on this topic from Salma the wife of Abu Rafi'.[Abu 'Eisa said:] This Hadith is Hasan Gharib from this route. We do not know of it to be a narration of Hisham bin 'Urwah except through this route. He said: I asked Al-Bukhari about this Hadith and he said: \"I do not know of anyone who reported it other than Yahya bin Hassan.\"",
      "chain": [
        "30516",
        "30025",
        "20300",
        "20160",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1840",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن سهل بن عسكر البغدادي، حدثنا يحيى بن حسان، حدثنا سليمان بن بلال، عن هشام بن عروة، عن أبيه، عن عائشة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ نعم الإدام الخل ‏\"‏ ‏.‏ حدثنا عبد الله بن عبد الرحمن، أخبرنا يحيى بن حسان، عن سليمان بن بلال، بهذا الإسناد نحوه إلا أنه قال ‏\"‏ نعم الإدام أو الأدم الخل ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه لا نعرفه من حديث هشام بن عروة إلا من حديث سليمان بن بلال ‏.‏",
      "text_en": " Narrated 'Aishah:                     That the Messenger of Allah (ﷺ) said: \"What an excellent condiment vinegar is.\"Another chain with similar except that he (ﷺ) said: \"What an excellent condiment, or, (the most excellent of) condiments is vinegar.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib from this route. It is not known as a Hadith of Hisham bin 'Urwah except through the narration of Sulaiman bin Bilal.",
      "chain": [
        "30516",
        "20300",
        "20160",
        "11065",
        "10511",
        "53"
      ]
    }
  ],
  "total_hadiths": 5
}