{
  "id": "30514",
  "name": "Muhammad bin Hatim Al-Samayn محمد بن حاتم البغدادي - السمين",
  "full_name": "Muhammad bin Hatim Al-Samayn محمد بن حاتم البغدادي - السمين",
  "grade": "3rd Century AH [10th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "236",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Merv",
      "al-Baghdad"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ م  د  -  صدوق ]"
    ],
    "tags": [
      "al-Baghdadi",
      "al-Mervazi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20032",
      "name": "Waki' bin al-Jarrah وكيع بن الجراح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20208",
      "name": "Isma'il bin Ibrahim",
      "grade": "Thiqah (Trustworthy)"
    },
    {
      "id": "20214",
      "name": "Bahz bin Asad al-'Ami",
      "grade": "Thiqah (Trustworthy)"
    },
    {
      "id": "20381",
      "name": "Hajjaj bin Muhammad al-Musaysi حجاج بن محمد المصيصي الأعور",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20229",
      "name": "Ruh bin 'Ubada bin al-'Ala' روح بن عبادة بن العلاء",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20650",
      "name": "Zayd bin al-Habab al-'Akli زيد بن الحباب أبو الحسين العكلي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20426",
      "name": "Shababa bin Sawar شبابة بن سوار الفزاري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20033",
      "name": "'Abdur Rahman bin Mahdi عبد الرحمن بن مهدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20450",
      "name": "'Umar bin Yonus bin al-Qasim عمر بن يونس بن القاسم",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20633",
      "name": "Kathir bin Hisham al-Klaby كثير بن هشام الكلابي أبو سهل الرقي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20277",
      "name": "Muhammad bin Bakr bin 'Uthman al-Barsani محمد بن بكر بن عثمان البرساني",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20031",
      "name": "Yahya bin Sa'id bin Farroukh al-Qatan يحيى بن سعيد بن فروخ القطان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20472",
      "name": "Yazid bin Harun يزيد بن هارون",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20184",
      "name": "Ya'qub bin Ibrahim bin Sa'd يعقوب بن إبراهيم بن سعد بن إبراهيم",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "10840",
      "name": "Yahya bin 'Aabad bin Shayban يحيى بن عباد بن شيبان",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "20286",
      "name": "Mua'dh bin Mua'dh bin Nsr معاذ بن معاذ بن نصر",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30278",
      "name": "Ma'la bin Mansur al-Razi معلى بن منصور الرازي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "28280",
      "name": "'Abdullah bin Ja'far عبد الله بن جعفر الرقي المعيطي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20408",
      "name": "Asbat bin Muhammad أسباط بن محمد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20190",
      "name": "Bashr bin al-Sari al-Afwah بشر بن السري أبو عمرو الأفوه",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30252",
      "name": "Sa'id bin Sulaiman al-Dabi سعيد بن سليمان - سعدويه الضبي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20244",
      "name": "'Abdullah bin Bakr عبد الله بن بكر بن حبيب السهمي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30106",
      "name": "'Affan bin Muslim عفان بن مسلم بن عبد الله الصفار",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20202",
      "name": "Makki bin Ibrahim bin Bashayr مكي بن إبراهيم بن بشير",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20389",
      "name": "Mua'wiya bin 'Amr bin al-Mhlb معاوية بن عمرو بن المهلب بن عمرو",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]"
    },
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "30554",
      "name": "Abu Zara' al-Razi أبو زرعة الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "144",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن حاتم بن ميمون، حدثنا يحيى بن سعيد، حدثنا يزيد بن كيسان، عن أبي حازم الأشجعي، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم لعمه ‏\"‏ قل لا إله إلا الله أشهد لك بها يوم القيامة ‏\"‏ ‏.‏ قال لولا أن تعيرني قريش يقولون إنما حمله على ذلك الجزع لأقررت بها عينك فأنزل الله ‏{‏ إنك لا تهدي من أحببت ولكن الله يهدي من يشاء‏}‏",
      "text_en": " It is narrated on the authority of Abu Huraira that the Messenger of Allah said to his uncle (at the time of his death):                      Make a profession of it that there is no god but Allah and I will bear testimony (of your being a Muslim) on the Day of judgment. He (Abu Talib) said: Were it not the fear of the Quraysh blaming me (and) saying that it was the fear of (approaching death) that induced me to do so, I would have certainly delighted your eyes. It was then that Allah revealed: \" Verily thou canst not guide to the right path whom thou lovest. And it is Allah Who guideth whom He will and He knoweth best who are the guided\" (xxviii-56).",
      "chain": [
        "30514",
        "20031",
        "10845",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "337",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثني محمد بن حاتم بن ميمون، وإبراهيم بن دينار، - واللفظ لإبراهيم - قالا حدثنا حجاج، - وهو ابن محمد - عن ابن جريج، قال أخبرني يعلى بن مسلم، أنه سمع سعيد بن جبير، يحدث عن ابن عباس، أن ناسا، من أهل الشرك قتلوا فأكثروا وزنوا فأكثروا ثم أتوا محمدا صلى الله عليه وسلم فقالوا إن الذي تقول وتدعو لحسن ولو تخبرنا أن لما عملنا كفارة فنزل ‏{‏ والذين لا يدعون مع الله إلها آخر ولا يقتلون النفس التي حرم الله إلا بالحق ولا يزنون ومن يفعل ذلك يلق أثاما‏}‏ ونزل ‏{‏ يا عبادي الذين أسرفوا على أنفسهم لا تقنطوا من رحمة الله‏{‏ ‏.‏",
      "text_en": " It is narrated on the authority of Ibn 'Abbas that some persons amongst the polytheist had committed a large number of murders and had excessively indulged in fornication. Then they came to Muhammad (may peace be upon him) and said:                      Whatever you assert and whatever you call to is indeed good. But if you inform us that there is atonement of our past deeds (then we would embrace Islam). Then it was revealed: And those who call not unto another god along with Allah and slay not any soul which Allah has forbidden except in the cause of justice, nor commit fornication; and he who does this shall meet the requital of sin. Multiplied for him shall be the torment on the Day of Resurrection, and he shall therein abide disgraced, except him who repents a believes and does good deeds. Then these! for the Allah shall change their vices into virtues. Verily Allah is Ever Forgiving, Merciful (xxv. 68-70). Say thou: O my bondsmen woo have committed extravagance against themselves despair not of the Mercy of Allah I Verily Allah will forgive the sins altogether. He is indeed the Forgiving, the Merciful (xxxix. 53).",
      "chain": [
        "30514",
        "30496",
        "20381",
        "11070",
        "11568",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "234",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثني محمد بن حاتم بن ميمون، حدثنا عبد الرحمن بن مهدي، حدثنا معاوية بن صالح، عن ربيعة، - يعني ابن يزيد - عن أبي إدريس الخولاني، عن عقبة بن عامر، ح وحدثني أبو عثمان، عن جبير بن نفير، عن عقبة بن عامر، قال كانت علينا رعاية الإبل فجاءت نوبتي فروحتها بعشي فأدركت رسول الله صلى الله عليه وسلم قائما يحدث الناس فأدركت من قوله ‏\"‏ ما من مسلم يتوضأ فيحسن وضوءه ثم يقوم فيصلي ركعتين مقبل عليهما بقلبه ووجهه إلا وجبت له الجنة ‏\"‏ ‏.‏ قال فقلت ما أجود هذه ‏.‏ فإذا قائل بين يدى يقول التي قبلها أجود ‏.‏ فنظرت فإذا عمر قال إني قد رأيتك جئت آنفا قال ‏\"‏ ما منكم من أحد يتوضأ فيبلغ - أو فيسبغ - الوضوء ثم يقول أشهد أن لا إله إلا الله وأن محمدا عبد الله ورسوله إلا فتحت له أبواب الجنة الثمانية يدخل من أيها شاء ‏\"‏ ‏.‏",
      "text_en": " 'Uqba b. 'Amir reported:                      We were entrusted with the task of tending the camels. On my turn when I came back in the evening after grazing them in the pastures, I found Allah's Messenger (may peace be upon him) stand and address the people. I heard these words of his: If any Muslim performs ablution well, then stands and prays two rak'ahs setting about them with his heart as well as his face, Paradise would be guaranteed to him. I said: What a fine thing is this! And a narrator who was before me said: The first was better than even this. When I cast a glance, I saw that it was 'Umair who said: I see that you have just come and observed: If anyone amongst you performs the ablution, and then completes the ablution well and then says: I testify that there is no god but Allah and that Muhammad is the servant of Allah and His Messenger, the eight gates of Paradise would be opened for him and he may enter by whichever of them he wishes.",
      "chain": [
        "30514",
        "20033",
        "20675",
        "11414",
        "11027",
        "189",
        "11113",
        "4097",
        "189"
      ]
    },
    {
      "hadith_no": "274",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثني محمد بن حاتم، حدثنا إسحاق بن منصور، حدثنا عمر بن أبي زائدة، عن الشعبي، عن عروة بن المغيرة، عن أبيه، أنه وضأ النبي صلى الله عليه وسلم فتوضأ ومسح على خفيه فقال له فقال ‏\"‏ إني أدخلتهما طاهرتين ‏\"‏ ‏.‏",
      "text_en": " 'Urwah al Mughira reported it from his father:                      He (Mughira) helped the Apostle (may peace be upon him) in performing the ablution, and he performed it and wiped over his shoes. He (Mughira) said to him (about the washing of the feet after putting them off), but he (the Holy Prophet) said: I put them (feet) in when these were clean.",
      "chain": [
        "30514",
        "30313",
        "11643",
        "11052",
        "11373",
        "166"
      ]
    },
    {
      "hadith_no": "323",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثنا إسحاق بن إبراهيم، ومحمد بن حاتم، قال إسحاق أخبرنا وقال ابن حاتم، حدثنا محمد بن بكر، أخبرنا ابن جريج، أخبرني عمرو بن دينار، قال أكبر علمي والذي يخطر على بالي أن أبا الشعثاء أخبرني أن ابن عباس أخبره أن رسول الله صلى الله عليه وسلم كان يغتسل بفضل ميمونة ‏.‏",
      "text_en": " Ibn Abbas reported that the Messenger of Allah (may peace be upon him) took a bath with the water left over by Maimuna.",
      "chain": [
        "30021",
        "30514",
        "20277",
        "11070",
        "11081",
        "17"
      ]
    },
    {
      "hadith_no": "490",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن حاتم، حدثنا بهز، حدثنا وهيب، حدثنا عبد الله بن طاوس، عن طاوس، عن ابن عباس، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أمرت أن أسجد على سبعة أعظم الجبهة - وأشار بيده على أنفه - واليدين والرجلين وأطراف القدمين ولا نكفت الثياب ولا الشعر ‏\"‏ ‏.‏",
      "text_en": " Ibn Abbas reported that the Messenger of Allah (may peace be upon him) said:                      I have been commanded to prostrate myself on seven bones:\" forehead,\" and then pointed with his hand towards his nose, hands, feet, and the extremities of the feet; and we were forbidden to fold back clothing and hair.",
      "chain": [
        "30514",
        "20214",
        "20299",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "1879",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني محمد بن حاتم، حدثنا محمد بن بكر، أخبرنا ابن جريج، حدثني عبدة، بن أبي لبابة عن شقيق بن سلمة، قال سمعت ابن مسعود، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ بئسما للرجل أن يقول نسيت سورة كيت وكيت أو نسيت آية كيت وكيت بل هو نسي ‏\"‏ ‏.‏",
      "text_en": " Abu Musa al-Ash'ari reported Allah's Apostle (may peace be upon him) as saying:                      Keep refreshing your knowledge of the Qur'an, for I swear by Him in Whose Hand is the life of Mahammad that it is more liable to escape than camels which are hobbled.",
      "chain": [
        "30514",
        "20277",
        "11070",
        "10793",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "2000",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "وحدثني محمد بن حاتم، حدثنا بهز، حدثنا وهيب، حدثنا عبد الله بن طاوس، عن أبيه، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ حق لله على كل مسلم أن يغتسل في كل سبعة أيام يغسل رأسه وجسده ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported that the Apostle of Allah (may peace be upon him) said. it is the right of Allah upon every Muslim that he should take a bath (at least) on one day (Friday) during the seven days (of the week) and he should wash his head and body.",
      "chain": [
        "30514",
        "20214",
        "20299",
        "11433",
        "11053",
        "13"
      ]
    },
    {
      "hadith_no": "2297",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثني محمد بن حاتم، حدثنا بهز، حدثنا وهيب، حدثنا موسى بن عقبة، عن عبد الواحد، عن عباد بن عبد الله بن الزبير، يحدث عن عائشة، أنها لما توفي سعد بن أبي وقاص أرسل أزواج النبي صلى الله عليه وسلم أن يمروا بجنازته في المسجد فيصلين عليه ففعلوا فوقف به على حجرهن يصلين عليه أخرج به من باب الجنائز الذي كان إلى المقاعد فبلغهن أن الناس عابوا ذلك وقالوا ما كانت الجنائز يدخل بها المسجد ‏.‏ فبلغ ذلك عائشة فقالت ما أسرع الناس إلى أن يعيبوا ما لا علم لهم به ‏.‏ عابوا علينا أن يمر بجنازة في المسجد وما صلى رسول الله صلى الله عليه وسلم على سهيل ابن بيضاء إلا في جوف المسجد ‏.‏",
      "text_en": " 'Abbad b. 'Abdullah b. Zubair reported on the authority of 'A'isha that when Sa'd b. Abu Waqqas died, the wives of the Apostle of Allah (may peace be upon him) sent message to bring his bier into the mosque so that they should offer prayer for him. They (the participants of the funeral) did accordingly, and it was placed in front of their apartments and they offered prayer for him. It was brought out of the door (known as) Bab al-Jana'iz which was towards the side of Maqa'id, and the news reached them (the wives of the Holy Prophet) that the people bad criticised this (i. e. offering of funeral prayer in the mosque) saying that it was not desirable to take the bier inside the mosque. This was conveyed to 'A'isha. She said:                      How hastily the people criticise that about which they know little. They criticise us for carrying the bier in the mosque. The Messenger of Allah (may peace be upon him) offered not the funeral prayer of Suhail b. Baida' but in the innermost part of the mosque.",
      "chain": [
        "30514",
        "20214",
        "20299",
        "11106",
        "20256",
        "11250",
        "53"
      ]
    },
    {
      "hadith_no": "2640",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثني محمد بن حاتم، حدثنا بهز بن أسد، حدثنا أبو بكر النهشلي، حدثنا زياد، بن علاقة عن عمرو بن ميمون، عن عائشة، رضى الله عنها قالت كان رسول الله صلى الله عليه وسلم يقبل في رمضان وهو صائم ‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her) reported that Allah's Messenger (may peace be upon him) kissed (his wives) during Ramadan while observing fast.",
      "chain": [
        "30514",
        "20214",
        "20619",
        "11339",
        "11382",
        "53"
      ]
    },
    {
      "hadith_no": "2707",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثني محمد بن حاتم، حدثنا إسحاق بن منصور، حدثنا إسرائيل، عن منصور، عن إبراهيم، عن علقمة، قال دخل الأشعث بن قيس على ابن مسعود وهو يأكل يوم عاشوراء فقال يا أبا عبد الرحمن إن اليوم يوم عاشوراء ‏.‏ فقال قد كان يصام قبل أن ينزل رمضان فلما نزل رمضان ترك فإن كنت مفطرا فاطعم ‏.‏",
      "text_en": " 'Alqama reported that Ash'ath b. Qais went to Ibn Mas'udd while he was eating on the day of Ashura. Thereupon he said:                      Abu Abd al-Rahman, it is the day of 'Ashura (and you are eating). Upon this he said: Fast was observed on (this day) before the (fasting) in Ramadan was made obligatory, but when it was made obligatory, (fasting on the day of 'Ashura) was abandoned. So if you are not fasting, then take food.",
      "chain": [
        "30514",
        "30313",
        "20311",
        "11067",
        "11051",
        "11017"
      ]
    },
    {
      "hadith_no": "2992",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثني محمد بن حاتم، حدثنا بهز، حدثنا وهيب، حدثنا عبد الله بن طاوس، عن أبيه، عن عائشة، - رضى الله عنها - أنها أهلت بعمرة فقدمت ولم تطف بالبيت حتى حاضت فنسكت المناسك كلها ‏.‏ وقد أهلت بالحج ‏.‏ فقال لها النبي صلى الله عليه وسلم يوم النفر ‏\"‏ يسعك طوافك لحجك وعمرتك ‏\"‏ ‏.‏ فأبت فبعث بها مع عبد الرحمن إلى التنعيم فاعتمرت بعد الحج ‏.‏",
      "text_en": " A'isha (Allah be pleased with her) reported that she put on Ihram for, Umra and arrived 'at Mecca) but did not circumambulate the House as she had entered in the period of menses, and then put on Ihram for Hajj and performed all the rituals concerning it (except circumambulating the House). The Apostle of Allah (may peace be upon him) said to her on the day of march (when pilgrims come to Mina):                      Your circumambulation would suffice both Hajj and Umra. She, however, felt reluc- tant. Thereupon the Holy Prophet (may peace be upon him) sent her with 'Abd al- Rahman to Tan'im and she performed Umra (with separate rituals) after Hajj.",
      "chain": [
        "30514",
        "20214",
        "20299",
        "11433",
        "11053",
        "53"
      ]
    },
    {
      "hadith_no": "3068",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني محمد بن حاتم، حدثنا بهز، حدثنا وهيب، حدثنا عبد الله بن طاوس، عن أبيه، عن ابن عباس، - رضى الله عنهما - قال كانوا يرون أن العمرة في أشهر الحج من أفجر الفجور في الأرض ويجعلون المحرم صفر ويقولون إذا برأ الدبر وعفا الأثر وانسلخ صفر حلت العمرة لمن اعتمر ‏.‏ فقدم النبي صلى الله عليه وسلم وأصحابه صبيحة رابعة مهلين بالحج فأمرهم أن يجعلوها عمرة فتعاظم ذلك عندهم فقالوا يا رسول الله أى الحل قال ‏\"‏ الحل كله ‏\"‏ ‏.‏",
      "text_en": " Ibn Abbas (Allah be pleased with them) reported that they (the Arabs of pre-Islamic days) looked upon Umra during the months of Hajj as the greatest of sins on the earth. So they intercalated the month of Muharram for Safar and said:                      When the backs of their camels would become all right and traces (if the pilgrims) would be effaced (from the paths) and the month of Safar would be over, then Umra would be permissible for one who wants to perform it. When Allah's Apostle (may peace be upon him) and his Companions came in the state of Ihram for performing Hajj on the fourth (of Dhu'l-Hijja) he (Allah's Apostle) commanded them to change their state of Ihram (from Hajj) to that of 'Umra. It was something inconceivable for them. So they said: Messenger of Allah, is it a complete freedom (of the obligation) of Ihram? Thereupon he said: It is a complete freedom (from Ihram).",
      "chain": [
        "30514",
        "20214",
        "20299",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "3081",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني محمد بن حاتم، حدثنا يحيى بن سعيد، عن ابن جريج، حدثني الحسن، بن مسلم عن طاوس، عن ابن عباس، أن معاوية بن أبي سفيان، أخبره قال قصرت عن رسول الله صلى الله عليه وسلم بمشقص وهو على المروة أو رأيته يقصر عنه بمشقص وهو على المروة ‏.‏",
      "text_en": " Ibn Abbis (Allah be pleased with him) reported that Mu'awiya b. Abu Safyin had told him:                      I clipped the hair (from the head of) Allah's Messenger (may peace he upon him) with a clipper while he was at al-Marwa, or I saw him getting his hair clipped with a clipper as he was at al-Marwa. 1722",
      "chain": [
        "30514",
        "20031",
        "11070",
        "11557",
        "11053",
        "17",
        "27"
      ]
    },
    {
      "hadith_no": "3097",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني محمد بن حاتم بن ميمون، حدثنا يحيى بن سعيد، عن ابن جريج، قال أخبرني عطاء، قال سمعت ابن عباس، يحدثنا قال قال رسول الله صلى الله عليه وسلم لامرأة من الأنصار سماها ابن عباس فنسيت اسمها ‏\"‏ ما منعك أن تحجي معنا ‏\"‏ ‏.‏ قالت لم يكن لنا إلا ناضحان فحج أبو ولدها وابنها على ناضح وترك لنا ناضحا ننضح عليه قال ‏\"‏ فإذا جاء رمضان فاعتمري فإن عمرة فيه تعدل حجة ‏\"‏ ‏.‏",
      "text_en": " Ataa reported:                      I heard Ibn Abbas (Allah be pleased with him) narrating to us that Allah's Messenger (may peace be upon him) said to a woman of the Ansar (Ibn Abbas had mentioned her name but I have forgotten it): 'What has prevented you that you do not perform Hajj along with us? She said: We have only two camels for carrying water. One of the camels has been taken by my husband and my son for performing Hajj and one has been left for us for carrying water, whereupon he (the Holy Prophet) said: So when the month of Ramadan come, perform Umra, for'Umra in this (month) is equal to Hajj (in reward).",
      "chain": [
        "30514",
        "20031",
        "11070",
        "11029"
      ]
    },
    {
      "hadith_no": "3224",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثني محمد بن حاتم، حدثنا بهز، حدثنا وهيب، حدثنا عبد الله بن طاوس، عن أبيه، عن ابن عباس، أن النبي صلى الله عليه وسلم قيل له في الذبح والحلق والرمى والتقديم والتأخير فقال ‏\"‏ لا حرج ‏\"‏ ‏.‏",
      "text_en": " Ibn Abbas (Allah be pleased with them) reported that it was said to Allah's Apostle (may peace be upon him) about sacrificing of animals, shaving of one's head, throwing of pebbles, and (the order of) precedence and succession, and he said:                      There is no harm in it.",
      "chain": [
        "30514",
        "20214",
        "20299",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "3228",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثني محمد بن حاتم بن ميمون، حدثنا روح بن عبادة، حدثنا صخر بن جويرية، عن نافع، أن ابن عمر، كان يرى التحصيب سنة وكان يصلي الظهر يوم النفر بالحصبة ‏.‏ قال نافع قد حصب رسول الله صلى الله عليه وسلم والخلفاء بعده ‏.‏",
      "text_en": " Nafi' reported that Ibn 'Umar regarded halt at Muhassab as Sunnah (of the Holy Prophet) and observed the noon prayer on Yaum al-Nafr at that place. Nafi' said:                      Allah's Messenger (may peace be upon him) halted at Muhassab and the Caliphs did the same after him.",
      "chain": [
        "30514",
        "20229",
        "20429",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3244",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني محمد بن حاتم بن ميمون، ومحمد بن مرزوق، وعبد بن حميد، قال عبد أخبرنا وقال الآخران، حدثنا محمد بن بكر، أخبرنا ابن جريج، أخبرني الحسن بن مسلم، أن مجاهدا، أخبره أن عبد الرحمن بن أبي ليلى أخبره أن علي بن أبي طالب أخبره ‏.‏ أن نبي الله صلى الله عليه وسلم أمره أن يقوم على بدنه وأمره أن يقسم بدنه كلها لحومها وجلودها وجلالها في المساكين ولا يعطي في جزارتها منها شيئا ‏.‏",
      "text_en": " Ali b. Abi Talib (Allah be pleased with him) reported:                      Allah's Apostle (may peace be upon him) put him in charge of his sacrificial animals, and commanded him to distribute the whole of their meat, hides, and saddle cloths to the poor, and not to give to the butcher anything out of them.",
      "chain": [
        "30514",
        "34240",
        "30553",
        "20277",
        "11070",
        "11557",
        "11028",
        "11196",
        "5"
      ]
    },
    {
      "hadith_no": "3285",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثني محمد بن حاتم، حدثنا يحيى بن سعيد، عن ابن جريج، أخبرني الحسن، بن مسلم عن طاوس، قال كنت مع ابن عباس إذ قال زيد بن ثابت تفتي أن تصدر الحائض، قبل أن يكون آخر عهدها بالبيت ‏.‏ فقال له ابن عباس إما لا فسل فلانة الأنصارية هل أمرها بذلك رسول الله صلى الله عليه وسلم قال فرجع زيد بن ثابت إلى ابن عباس يضحك وهو يقول ما أراك إلا قد صدقت ‏.‏",
      "text_en": " Tawus reported:                      I was in the company of Ibn Abbas (Allah be pleased with them) when Zaid b. Thabit said: Do you give religious verdict that the woman who is in menses is allowed to go without performing the last circumambulation of the House? Ibn 'Abbas (Allah be pleased with them) said to him: Ask such and such woman of the Ansar, if you do not (believe my religious verdict) whether Allah's Messenger (may peace be upon him) had coimmanded her this. Zaid b Thabit (went to that lady and after getting this verdict attested by her) came back to Ibn Abbas (Allah be pleased with them) smilingly and said: I did not find you but telling the truth.",
      "chain": [
        "30514",
        "20031",
        "11070",
        "11557",
        "11053",
        "49"
      ]
    },
    {
      "hadith_no": "3575",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "حدثنا محمد بن حاتم بن ميمون، حدثنا بهز، ح وحدثني محمد بن رافع، حدثنا أبو النضر، هاشم بن القاسم قالا جميعا حدثنا سليمان بن المغيرة، عن ثابت، عن أنس، وهذا حديث بهز قال لما انقضت عدة زينب قال رسول الله صلى الله عليه وسلم لزيد ‏\"‏ فاذكرها على ‏\"‏ ‏.‏ قال فانطلق زيد حتى أتاها وهى تخمر عجينها قال فلما رأيتها عظمت في صدري حتى ما أستطيع أن أنظر إليها أن رسول الله صلى الله عليه وسلم ذكرها فوليتها ظهري ونكصت على عقبي فقلت يا زينب أرسل رسول الله صلى الله عليه وسلم يذكرك ‏.‏ قالت ما أنا بصانعة شيئا حتى أوامر ربي ‏.‏ فقامت إلى مسجدها ونزل القرآن وجاء رسول الله صلى الله عليه وسلم فدخل عليها بغير إذن قال فقال ولقد رأيتنا أن رسول الله صلى الله عليه وسلم أطعمنا الخبز واللحم حين امتد النهار فخرج الناس وبقي رجال يتحدثون في البيت بعد الطعام فخرج رسول الله صلى الله عليه وسلم واتبعته فجعل يتتبع حجر نسائه يسلم عليهن ويقلن يا رسول الله كيف وجدت أهلك قال فما أدري أنا أخبرته أن القوم خرجوا أو أخبرني - قال - فانطلق حتى دخل البيت فذهبت أدخل معه فألقى الستر بيني وبينه ونزل الحجاب قال ووعظ القوم بما وعظوا به ‏.‏ زاد ابن رافع في حديثه ‏{‏ لا تدخلوا بيوت النبي إلا أن يؤذن لكم إلى طعام غير ناظرين إناه‏}‏ إلى قوله ‏{‏ والله لا يستحيي من الحق‏}‏",
      "text_en": " Anas (Allah be pleased with him) reported:                      When the 'Iddah of Zainab was over, Allah's Messenger (may peace be upon him) said to Zaid to make a mention to her about him. Zaid went on until he came to her and she was fermenting her flour. He (Zaid) said: As I saw her I felt in my heart an idea of her greatness so much so that I could not see towards her (simply for the fact) that Allah's Messenger (may peace be upon him) had made a mention of her. So I turned my back towards her. and I turned upon my heels, and said: Zainab, Allah's Messenger (may peace be upon him) has sent (me) with a message to you. She said: I do not do anything until I solicit the will of my Lord. So she stood at her place of worship and the (verse of) the Qur'an (pertaining to her marriage) were revealed, and Allah's Messenger (may peace be upon him) came to her without permission. He (the narrator) said: I saw that Allah's Messenger (may peace be upon him) served us bread and meat until it was broad day light and the people went away, but some persons who were busy in con- versation stayed on in the house after the meal. Allah's Messenger (may peace be upon him) also went out and I also followed him, and he began to visit the apartments of his wives greeting them (with the words): As-Salamu 'alaikum, and they would say: Allah's Messenger, how did you find your family (hadrat Zainab)? He (the narrator) stated: I do not know whether I had informed him that the people had gone out or he (the Holy Prophet) informed me (about that). He moved on until he entered the apartment, and I also went and wanted to enter (the apartment) along with him, but he threw a curtain between me and him, as (the verfes pertaining to seclusion) had been revealed, and people were instructed in what they had been instructed. Ibn Rafii had made this addition in his narration:\" O you who believe, enter not the houses of the Prophet unless permission is given to you for a meal, not waiting for its cooking being finished...\" to the words\"... Allah forbears not from the truth.\"",
      "chain": [
        "30514",
        "20214",
        "30375",
        "20390",
        "20236",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "3794",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "وحدثني محمد بن حاتم بن ميمون، حدثنا يحيى بن سعيد، عن ابن جريج، ح وحدثنا محمد بن رافع، حدثنا عبد الرزاق، أخبرنا ابن جريج، ح وحدثني هارون بن عبد الله، - واللفظ له - حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني أبو الزبير، أنه سمع جابر بن عبد الله، يقول طلقت خالتي فأرادت أن تجد نخلها فزجرها رجل أن تخرج فأتت النبي صلى الله عليه وسلم فقال ‏\"‏ بلى فجدي نخلك فإنك عسى أن تصدقي أو تفعلي معروفا ‏\"‏ ‏.‏",
      "text_en": " Jabir b. 'Abdullah (Allah be pleased with them) reported:                      My maternal aunt was divorced, and she intended to pluck her dates. A person scolded her for having come out (during the period of 'Idda). She came to Allah's Prophet (may peace be upon him.) and he said: Certainly you can pluck (dates) from your palm trees, for perhaps you may give charity or do an act of kindness.",
      "chain": [
        "30514",
        "20031",
        "11070",
        "30375",
        "20121",
        "11070",
        "20381",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "4155",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن حاتم بن ميمون، حدثنا سفيان بن عيينة، عن عمرو، عن أبي، المنهال قال باع شريك لي ورقا بنسيئة إلى الموسم أو إلى الحج فجاء إلى فأخبرني فقلت هذا أمر لا يصلح ‏.‏ قال قد بعته في السوق فلم ينكر ذلك على أحد ‏.‏ فأتيت البراء بن عازب فسألته فقال قدم النبي صلى الله عليه وسلم المدينة ونحن نبيع هذا البيع فقال ‏\"‏ ما كان يدا بيد فلا بأس به وما كان نسيئة فهو ربا ‏\"‏ ‏.‏ وائت زيد بن أرقم فإنه أعظم تجارة مني ‏.‏ فأتيته فسألته فقال مثل ذلك ‏.‏",
      "text_en": " Abu Minhal reported:                      My partner sold silver to be paid in the (Hajj) season or (in the days of) Hajj. He (my partner) came to me and informed me, and I said to him: Such transaction is not desirable. He said: I sold it in the market (on loan) but nobody objected to this. I went to al-Bara' b. 'Azib and asked him, and he said: Allah's Apostle (may peace be upon him) came to Medina and we made such transaction, whereupon he said: In case the payment is made on the spot, there is no harm in it, and in case (it is 'sold) on loan, it is usury. You better go to Zaid b. Arqam, for he is a greater trader than I; so I went to him and asked him, and he said like it.",
      "chain": [
        "30514",
        "20005",
        "11081",
        "11290"
      ]
    },
    {
      "hadith_no": "4231",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Rules of Inheritance - كتاب الفرائض",
      "chapter_no": "24",
      "text_ar": "حدثني محمد بن حاتم بن ميمون، حدثنا حجاج بن محمد، حدثنا ابن جريج، قال أخبرني ابن المنكدر، عن جابر بن عبد الله، قال عادني النبي صلى الله عليه وسلم وأبو بكر في بني سلمة يمشيان فوجدني لا أعقل فدعا بماء فتوضأ ثم رش على منه فأفقت فقلت كيف أصنع في مالي يا رسول الله فنزلت ‏{‏يوصيكم الله في أولادكم للذكر مثل حظ الأنثيين‏}‏",
      "text_en": " Jabir b. 'Abdullah (Allah be pleased with him) reported:                      Allah's Apostle (may peace be upon him) and Abi Bakr (Allah be pleased with him) visited me on foot in Banu Salama, and found me unconscious. He (the Holy Prophet) called for water and performed ablution and sprinkled out of it (the water) over me. I felt relieved. I said: Allah's Messenger, what should I do with my property? And this verse was revealed:\" Allah enjoins you concerning your children: for the male is equal of the portion of two females.\"",
      "chain": [
        "30514",
        "20381",
        "11070",
        "11048",
        "34"
      ]
    },
    {
      "hadith_no": "4480",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Oath; for Establishing the Responsibility of Murders; Fighting; Requital - كتاب القسامة والمحاربين والقصاص والديات",
      "chapter_no": "29",
      "text_ar": "حدثني محمد بن حاتم بن ميمون، حدثنا يحيى بن سعيد، حدثنا قرة بن خالد، حدثنا محمد بن سيرين، عن عبد الرحمن بن أبي بكرة، وعن رجل، آخر هو في نفسي أفضل من عبد الرحمن بن أبي بكرة ح وحدثنا محمد بن عمرو بن جبلة وأحمد بن خراش قالا حدثنا أبو عامر عبد الملك بن عمرو حدثنا قرة بإسناد يحيى بن سعيد - وسمى الرجل حميد بن عبد الرحمن - عن أبي بكرة قال خطبنا رسول الله صلى الله عليه وسلم يوم النحر فقال ‏\"‏ أى يوم هذا ‏\"‏ ‏.‏ وساقوا الحديث بمثل حديث ابن عون غير أنه لا يذكر ‏\"‏ وأعراضكم ‏\"‏ ‏.‏ ولا يذكر ثم انكفأ إلى كبشين وما بعده وقال في الحديث ‏\"‏ كحرمة يومكم هذا في شهركم هذا في بلدكم هذا إلى يوم تلقون ربكم ألا هل بلغت ‏\"‏ ‏.‏ قالوا نعم ‏.‏ قال ‏\"‏ اللهم اشهد ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Abu Bakra through another chain of transmitters (and the words are):                     \" Allah's Messenger (may peace be upon him) addressed us on the day of Nahr (Sacrifice) and said: What day is this? And the rest of the hadith is the same except that he did not make mention of\" your honour,\" and also did not make mention of this: He then turned his attention towards two rams and what follows, and in a hadith (the words pertaining to sacred- ness are recorded in this way):\" Like the sacredness of this day of yours, in this month of yours, in this city of yours to the day when you will meet your Lord. Behold, have I not conveyed (the Message of God)? They said: Yes. He said: O Allah, bear witness.\"",
      "chain": [
        "30514",
        "20031",
        "11301",
        "11035",
        "11294",
        "11220",
        "20443"
      ]
    },
    {
      "hadith_no": "5906",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثني محمد بن حاتم، حدثنا محمد بن بكر، أخبرنا ابن جريج، أخبرني عمرو، بن دينار أن عامر بن سعد، أخبره أن رجلا سأل سعد بن أبي وقاص عن الطاعون، فقال أسامة بن زيد أنا أخبرك عنه، قال رسول الله صلى الله عليه وسلم ‏\"‏ هو عذاب أو رجز أرسله الله على طائفة من بني إسرائيل أو ناس كانوا قبلكم فإذا سمعتم به بأرض فلا تدخلوها عليه وإذا دخلها عليكم فلا تخرجوا منها فرارا ‏\"‏ ‏.‏",
      "text_en": " 'Amir b. Sa'd reported that a person asked Sa'd b. Abu Waqqas about the plague, whereupon Usama b. Zaid said:                      I would inform you about it. The Messenger of Allah (may peace be upon him) said: It is a calamity or a disease which Allah sent to a group of Bani Isra'il, or to the people who were before you; so when you hear of it in land, don't enter it and when it has broken out in your land, don't run away from it.",
      "chain": [
        "30514",
        "20277",
        "11070",
        "11081",
        "10554",
        "9"
      ]
    },
    {
      "hadith_no": "6026",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Poetry - كتاب الشعر",
      "chapter_no": "42",
      "text_ar": "وحدثني محمد بن حاتم بن ميمون، حدثنا ابن مهدي، عن سفيان، عن عبد الملك، بن عمير حدثنا أبو سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أصدق كلمة قالها شاعر كلمة لبيد ألا كل شىء ما خلا الله باطل وكاد أمية بن أبي الصلت أن يسلم ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      The truest word uttered by a poet is this verse of Labid:\" Behold! apart from Allah everything is vain,\" and Umayya b. Abu Salt was almost a Muslim.",
      "chain": [
        "30514",
        "20033",
        "20012",
        "11368",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "6166",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا محمد بن حاتم بن ميمون، حدثنا محمد بن بكر، أخبرنا ابن جريج، أخبرني  عمرو بن دينار، عن محمد بن علي، عن جابر بن عبد الله، قال وأخبرني محمد بن المنكدر، عن جابر بن عبد الله، قال لما مات النبي صلى الله عليه وسلم جاء أبا بكر مال من قبل العلاء بن الحضرمي فقال أبو بكر من كان له على النبي صلى الله عليه وسلم دين أو كانت له قبله عدة فليأتنا ‏.‏ بنحو حديث ابن عيينة ‏.‏",
      "text_en": " Jabir b. 'Abdullah reported:                      When Allah's Apostle (may peace be upon him) died, there came to Abfi Bakr wealth from al-'Ala' b. al-Hadrami. Abu Bakr said: He to whom Allah's Apostle (may peace be upon him) owed any debt or held out any promise should come to us; the rest of the hadith is the same.",
      "chain": [
        "30514",
        "20277",
        "11070",
        "11081",
        "11442",
        "34",
        "11048",
        "34"
      ]
    },
    {
      "hadith_no": "6476",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثني محمد بن حاتم بن ميمون، حدثنا بهز، حدثنا سليمان بن المغيرة، عن ثابت، عن أنس، قال مات ابن لأبي طلحة من أم سليم فقالت لأهلها لا تحدثوا أبا طلحة بابنه حتى أكون أنا أحدثه - قال - فجاء فقربت إليه عشاء فأكل وشرب - فقال - ثم تصنعت له أحسن ما كان تصنع قبل ذلك فوقع بها فلما رأت أنه قد شبع وأصاب منها قالت يا أبا طلحة أرأيت لو أن قوما أعاروا عاريتهم أهل بيت فطلبوا عاريتهم ألهم أن يمنعوهم قال لا ‏.‏ قالت فاحتسب ابنك ‏.‏ قال فغضب وقال تركتني حتى تلطخت ثم أخبرتني بابني ‏.‏ فانطلق حتى أتى رسول الله صلى الله عليه وسلم فأخبره بما كان فقال رسول الله صلى الله عليه وسلم ‏\"‏ بارك الله لكما في غابر ليلتكما ‏\"‏ ‏.‏ قال فحملت - قال - فكان رسول الله صلى الله عليه وسلم في سفر وهي معه وكان رسول الله صلى الله عليه وسلم إذا أتى المدينة من سفر لا يطرقها طروقا فدنوا من المدينة فضربها المخاض فاحتبس عليها أبو طلحة وانطلق رسول الله صلى الله عليه وسلم - قال - يقول أبو طلحة إنك لتعلم يا رب إنه يعجبني أن أخرج مع رسولك إذا خرج وأدخل معه إذا دخل وقد احتبست بما ترى - قال - تقول أم سليم يا أبا طلحة ما أجد الذي كنت أجد انطلق ‏.‏ فانطلقنا - قال - وضربها المخاض حين قدما فولدت غلاما فقالت لي أمي يا أنس لا يرضعه أحد حتى تغدو به على رسول الله صلى الله عليه وسلم ‏.‏ فلما أصبح احتملته فانطلقت به إلى رسول الله صلى الله عليه وسلم - قال - فصادفته ومعه ميسم فلما رآني قال ‏\"‏ لعل أم سليم ولدت ‏\"‏ ‏.‏ قلت نعم ‏.‏ فوضع الميسم - قال - وجئت به فوضعته في حجره ودعا رسول الله صلى الله عليه وسلم بعجوة من عجوة المدينة فلاكها في فيه حتى ذابت ثم قذفها في في الصبي فجعل الصبي يتلمظها - قال - فقال رسول الله صلى الله عليه وسلم ‏\"‏ انظروا إلى حب الأنصار التمر ‏\"‏ ‏.‏ قال فمسح وجهه وسماه عبد الله ‏.‏",
      "text_en": " Anas reported that the son of Abu Talba who was born of Umm Sulaim died. She (Umm Sulaim) said to the members of her family:                      Do not narrate to Abu Talha about his son until I narrate it to him. Abu Talha came (home) ; she presented to him the supper. He took it and drank water. She then embellished herself which she did not do before. He (Abu Talha) had a sexual intercourse with her and when she saw that he was satisfied after sexual intercourse with her, she said: Abu Talha, if some people borrow something from another family and then (the members of the family) ask for its return, would they resist its return? He said: No. She said: I inform you about the death of your son. He was annoyed, and said: You did not inform me until I had a sexual intercourse with you and you later on gave me information about my son. He went to Allah's Messenger (may peace be upon him) and informed him what had happened. Thereupon Allah's Messenger (may peace be upon him) said: May Allah bless both of you in the night spent by you! He (the narrator) said: She became pregnant. Allah's Messenger (may peace he upon him) was in the course of a journey and she was along with him and when Allah's Messenger (may peace be upon him) came back to Medina from the journey he did not enter (his house) (during the night). When the people came near Medina, she felt the pangs of delivery. He (Abu Talha) remained with her and Allah's Messenger (may peace be upon him) proceeded on. Abu Talha said: O Lord, you know that I love to go along with Allah's Messenger when he goes out and enter along with him when he enters and I have been detained as Thou seest. Umm Sulaim said: Abu Talha, I do not feel (so much pain) as I was feeling formerly, so better proceed on. So we proceeded on and she felt the pangs of delivery as they reached (Medina) and a child was born and my mother said to me: Anas, none should suckle him until you go to Allah's Messenger (may peace be upon him) tomorrow morning. And when it was morning I carried him (the child) and went along with him to Allah's Messenger (may peace beupon him). He said: I saw that he had in his hand the instrument for the cauterisation of the camels. When he saw me. he said: This is, perhaps, what Umm Sulaim has given birth to. I said: Yes. He laid down that instrument on the ground. I brought that child to him and placed it in his lap and Allah's Messenger (may peace be upon him) asked Ajwa dates of Medina to be brought and softened them in his month. When these had become palatable he placed them in the mouth of that child. The child began to taste them. Then Allah's Messenger (may peace be upon him) said: See what love the Ansar have for dates. He then wiped his face and named him 'Abdullah.",
      "chain": [
        "30514",
        "20214",
        "20236",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "6680",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثني محمد بن حاتم بن ميمون، حدثنا ابن مهدي، عن معاوية بن صالح، عن  عبد الرحمن بن جبير بن نفير، عن أبيه، عن النواس بن سمعان الأنصاري، قال سألت رسول الله صلى الله عليه وسلم عن البر والإثم فقال ‏\"‏ البر حسن الخلق والإثم ما حاك في صدرك وكرهت أن يطلع عليه الناس ‏\"‏ ‏.‏",
      "text_en": " Nawwas b. Sam'an al-Ansari reported:                      I asked Allah's Messenger (may peace be upon him) about virtue and vice. He said: Virtue is a kind disposition and vice is what rankles in your heart and that you disapprove that people should come to know of it.",
      "chain": [
        "30514",
        "20033",
        "20675",
        "10942",
        "3600"
      ]
    },
    {
      "hadith_no": "6721",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثني محمد بن حاتم بن ميمون، حدثنا بهز، حدثنا حماد بن سلمة، عن ثابت، عن أبي رافع، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله عز وجل يقول يوم القيامة يا ابن آدم مرضت فلم تعدني ‏.‏ قال يا رب كيف أعودك وأنت رب العالمين ‏.‏ قال أما علمت أن عبدي فلانا مرض فلم تعده أما علمت أنك لو عدته لوجدتني عنده يا ابن آدم استطعمتك فلم تطعمني ‏.‏ قال يا رب وكيف أطعمك وأنت رب العالمين ‏.‏ قال أما علمت أنه استطعمك عبدي فلان فلم تطعمه أما علمت أنك لو أطعمته لوجدت ذلك عندي يا ابن آدم استسقيتك فلم تسقني ‏.‏ قال يا رب كيف أسقيك وأنت رب العالمين قال استسقاك عبدي فلان فلم تسقه أما إنك لو سقيته وجدت ذلك عندي ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      Verily, Allah, the Exalted and Glorious, would say on the Day of Resurrection: O son of Adam, I was sick but you did not visit Me. He would say: O my Lord; how could I visit Thee whereas Thou art the Lord of the worlds? Thereupon He would say: Didn't you know that such and such servant of Mine was sick but you did not visit him and were you not aware of this that if you had visited him, you would have found Me by him? O son of Adam, I asked food from you but you did not feed Me. He would say: My Lord, how could I feed Thee whereas Thou art the Lord of the worlds? He said: Didn't you know that such and such servant of Mine asked food from you but you did not feed him, and were you not aware that if you had fed him you would have found him by My side? (The Lord would again say: ) O son of Adam, I asked drink from you but you did not provide Me. He would say: My Lord, how could I provide Thee whereas Thou art the Lord of the worlds? Thereupon He would say: Such and such of servant of Mine asked you for a drink but you did not provide him, and had you provided him drink you would have found him near Me.",
      "chain": [
        "30514",
        "20214",
        "20021",
        "11269",
        "479",
        "13"
      ]
    },
    {
      "hadith_no": "7015",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن حاتم بن ميمون، حدثنا بهز، حدثنا وهيب، حدثنا سهيل، عن أبيه، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن لله تبارك وتعالى ملائكة سيارة فضلا يتبعون مجالس الذكر فإذا وجدوا مجلسا فيه ذكر قعدوا معهم وحف بعضهم بعضا بأجنحتهم حتى يملئوا ما بينهم وبين السماء الدنيا فإذا تفرقوا عرجوا وصعدوا إلى السماء - قال - فيسألهم الله عز وجل وهو أعلم بهم من أين جئتم فيقولون جئنا من عند عباد لك في الأرض يسبحونك ويكبرونك ويهللونك ويحمدونك ويسألونك ‏.‏ قال وماذا يسألوني قالوا يسألونك جنتك ‏.‏ قال وهل رأوا جنتي قالوا لا أى رب ‏.‏ قال فكيف لو رأوا جنتي قالوا ويستجيرونك ‏.‏ قال ومم يستجيرونني قالوا من نارك يا رب ‏.‏ قال وهل رأوا ناري قالوا لا ‏.‏ قال فكيف لو رأوا ناري قالوا ويستغفرونك - قال - فيقول قد غفرت لهم فأعطيتهم ما سألوا وأجرتهم مما استجاروا - قال - فيقولون رب فيهم فلان عبد خطاء إنما مر فجلس معهم قال فيقول وله غفرت هم القوم لا يشقى بهم جليسهم ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Apostle (may peace be upon him) as saying Allah has mobile (squads) of angels, who have no other work (to attend to but) to follow the assemblies of Dhikr and when they find such assemblies in which there is Dhikr (of Allah) they sit in them and some of them surround the others with their wings till the space between them and the sky of the world is fully covered, and when they disperse (after the assembly of Dhikr is adjourned) they go upward to the heaven and Allah, the Exalted and Glorious, asks them although He is best informed about them:                      Where have you come from? They say: We come from Thine servants upon the earth who had been glorifying Thee (reciting Subhan Allah), uttering Thine Greatness (saying Allah o-Akbar) and uttering Thine Oneness (La ilaha ill Allah) and praising Thee (uttering al-Hamdu Lillah) and begging of Thee. Be would say: What do they beg of Me? They would say: They beg of Thee the Paradise of Thine. He (God) would say: Have they seen My Paradise? They said: No, our Lord. He would say: (What it would be then) if they were to see Mine Paradise? They (the angels) said: They seek Thine protection. He (the Lord) would say: Against what do they seek protection of Mine? They (the angels) would say: Our Lord, from the Hell-Fire. He (the Lord) would say: Have they seen My Fire? They would say: No. He (the Lord) would say: What it would be if they were to see My Fire? They would say: They beg of Thee forgiveness. He would say: I grant pardon to them, and confer upon them what they ask for and grant them protection against which they seek protection. They (the angels) would again say: Our Lord, there is one amongst them such and such simple servant who happened to pass by (that assembly) and sat there along with them (who had been participating in that assembly). He (the Lord) would say: I also grant him pardon, for they are a people the seat-fellows of whom are in no way unfortunate.",
      "chain": [
        "30514",
        "20214",
        "20299",
        "13"
      ]
    },
    {
      "hadith_no": "7424",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "وحدثني محمد بن حاتم بن ميمون، حدثنا الوليد بن صالح، حدثنا عبيد الله بن، عمرو حدثنا زيد بن أبي أنيسة، عن عبد الملك العامري، عن يوسف بن ماهك، أخبرني  عبد الله بن صفوان، عن أم المؤمنين، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ سيعوذ بهذا البيت - يعني الكعبة - قوم ليست لهم منعة ولا عدد ولا عدة يبعث إليهم جيش حتى إذا كانوا ببيداء من الأرض خسف بهم ‏\"‏ ‏.‏ قال يوسف وأهل الشأم يومئذ يسيرون إلى مكة فقال عبد الله بن صفوان أما والله ما هو بهذا الجيش ‏.‏   قال زيد وحدثني عبد الملك العامري، عن عبد الرحمن بن سابط، عن الحارث، بن أبي ربيعة عن أم المؤمنين، ‏.‏ بمثل حديث يوسف بن ماهك غير أنه لم يذكر فيه الجيش الذي ذكره عبد الله بن صفوان ‏.‏",
      "text_en": " Abdullah b. Safwan reported the Mother of the Faithful as saying that Allah's Messenger (may peace be upon him) said:                      They would soon seek protection in this House, viz. Ka'ba (the defenceless), people who would have nothing to protect themselves in the shape of weapons or the strength of the people. An army would be sent to fight (and kill) them and when they would enter a plain ground the army would be sunk in it. Yiisuf (one of the narrators) said: It was a people of Syria (hordes of Hajjaj) who had been on that day comin. towards Mecca for an attack (on 'Abdulllah b. Zubair) and Abdullah b. Safwan said: By God, it does not imply this army.",
      "chain": [
        "30514",
        "20392",
        "30024",
        "11340",
        "11264",
        "487",
        "53"
      ]
    },
    {
      "hadith_no": "312",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا الحسن بن يحيى، أخبرنا محمد بن حاتم، - يعني حبي - حدثنا عبد الله بن المبارك، عن يونس بن نافع، عن كثير بن زياد، قال حدثتني الأزدية، - يعني مسة - قالت حججت فدخلت على أم سلمة فقلت يا أم المؤمنين إن سمرة بن جندب يأمر النساء يقضين صلاة المحيض ‏.‏ فقالت لا يقضين كانت المرأة من نساء النبي صلى الله عليه وسلم تقعد في النفاس أربعين ليلة لا يأمرها النبي صلى الله عليه وسلم بقضاء صلاة النفاس ‏.‏ قال محمد يعني ابن حاتم واسمها مسة تكنى أم بسة ‏.‏ قال أبو داود كثير بن زياد كنيته أبو سهل ‏.‏",
      "text_en": " \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAl-Azdiyyah, viz. Mussah, said:                      I performed Hajj and came to Umm Salamah and said (to her): Mother of the believers, Samurah b. Jundub commands women to complete the prayers abandoned during their menstrual period. She said: They should not do so. The wives of the Prophet (ﷺ) would refrain (from prayer) for forty nights (i.e. days) during the course of bleeding after child birth. The Prophet (ﷺ) would not command them to complete the prayers abandoned during the period of bleeding.Muhammad b. Hatim said: The name of Al-Azdiyyah is Mussah and her patronymic name is Umm Busrah.Abu Dawud said: The patronymic names of Kathir b. Ziyad s Abu Sahl.",
      "chain": [
        "34057",
        "30514",
        "20025",
        "28664",
        "14330",
        "19523",
        "56"
      ]
    },
    {
      "hadith_no": "345",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن حاتم الجرجرائي، حبي حدثنا ابن المبارك، عن الأوزاعي، حدثني حسان بن عطية، حدثني أبو الأشعث الصنعاني، حدثني أوس بن أوس الثقفي، سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من غسل يوم الجمعة واغتسل ثم بكر وابتكر ومشى ولم يركب ودنا من الإمام فاستمع ولم يلغ كان له بكل خطوة عمل سنة أجر صيامها وقيامها ‏\"‏ ‏.‏",
      "text_en": " Narrated Aws ibn Aws ath-Thaqafi:                     I heard the apostle of Allah (ﷺ) say: If anyone makes (his wife) wash and he washes himself on Friday, goes out early (for Friday prayer), attends the sermon from the beginning, walking, not riding, takes his seat near the imam, listens attentively, and does not indulge in idle talk, he will get the reward of a year's fasting and praying at night for every step he takes.",
      "chain": [
        "30514",
        "20025",
        "20024",
        "11413",
        "10917",
        "3214"
      ]
    },
    {
      "hadith_no": "452",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن حاتم، حدثنا عبيد الله بن موسى، عن شيبان، عن فراس، عن عطية، عن ابن عمر، أن مسجد النبي، صلى الله عليه وسلم كانت سواريه على عهد رسول الله صلى الله عليه وسلم من جذوع النخل أعلاه مظلل بجريد النخل ثم إنها نخرت في خلافة أبي بكر فبناها بجذوع النخل وبجريد النخل ثم إنها نخرت في خلافة عثمان فبناها بالآجر فلم تزل ثابتة حتى الآن ‏.‏",
      "text_en": " Ibn 'Umar reported:                      The pillars of the mosque of the Prophet (ﷺ) during the life time of the Messenger of Allah (ﷺ) were made of the trunks of the palm-tree; they covered from the above by twigs of the palm-tree; they decayed during the caliphate of Abu Bakr. He built it afresh with trunks and twigs of the palm-tree. But they again decayed during the caliphate of 'Uthman. He, therefore, built it with bricks. That survives until today.",
      "chain": [
        "30514",
        "20340",
        "20240",
        "11385",
        "18"
      ]
    },
    {
      "hadith_no": "1766",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن حاتم، حدثنا عبد الرحمن بن مهدي، حدثنا عبد الله بن المبارك، عن حرملة بن عمران، عن عبد الله بن الحارث الأزدي، قال سمعت غرفة بن الحارث الكندي، قال شهدت رسول الله صلى الله عليه وسلم في حجة الوداع وأتي بالبدن فقال ‏\"‏ ادعوا لي أبا حسن ‏\"‏ ‏.‏ فدعي له علي - رضى الله عنه - فقال له ‏\"‏ خذ بأسفل الحربة ‏\"‏ ‏.‏ وأخذ رسول الله صلى الله عليه وسلم بأعلاها ثم طعن بها في البدن فلما فرغ ركب بغلته وأردف عليا رضى الله عنه ‏.‏",
      "text_en": " Narrated Arfah ibn al-Harith al-Kandi:                     I was present with the Messenger of Allah (ﷺ) at the Farewell Pilgrimage. When the sacrificial camels were brought to him, he said: Call AbulHasan (Ali) to me. Ali was then called for and he (the Prophet) said to him: Catch hold of the lower end of the lance, and the Messenger of Allah (ﷺ) himself caught hold of the upper end. He then pierced the camels with it. When he finished slaughtering, he rode on his mule and mounted Ali behind him.",
      "chain": [
        "30514",
        "20033",
        "20025",
        "20622",
        "18510",
        "5220"
      ]
    },
    {
      "hadith_no": "594",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Traveling - أَبْوَابُ السَّفَرِ",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن حاتم المؤدب البغدادي البصري، حدثنا عامر بن صالح الزبيري، هو من ولد الزبير حدثنا هشام بن عروة، عن أبيه، عن عائشة، قالت أمر رسول الله صلى الله عليه وسلم ببناء المساجد في الدور وأن تنظف وتطيب ‏.‏",
      "text_en": " Aishah narrated:                     \"The Prophet ordered the construction of Masajid in all Dur and that they be kept clean and scented.\"",
      "chain": [
        "30514",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2255",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا محمد بن حاتم المكتب، حدثنا محمد بن عبد الله الأنصاري، حدثنا حميد الطويل، عن أنس، عن النبي صلى الله عليه وسلم قال ‏\"‏ انصر أخاك ظالما أو مظلوما ‏\"‏ ‏.‏ قلنا يا رسول الله نصرته مظلوما فكيف أنصره ظالما قال ‏\"‏ تكفه عن الظلم فذاك نصرك إياه ‏\"‏ ‏.‏ قال وفي الباب عن عائشة ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " It was narrated from Anas bin Malik, that the Prophet(s.a.w) said:                     \"Help your brother whether he is an oppressor or oppressed.\" It was said: \"O Messenger of Allah! I help him when he is oppressed. But how can I help him when he oppresses?\" He said: \"Prevent him from oppression, that is your help for him.\"",
      "chain": [
        "30514",
        "20280",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "2322",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا محمد بن حاتم المكتب، حدثنا علي بن ثابت، حدثنا عبد الرحمن بن ثابت بن ثوبان، قال سمعت عطاء بن قرة، قال سمعت عبد الله بن ضمرة، قال سمعت أبا هريرة، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ألا إن الدنيا ملعونة ملعون ما فيها إلا ذكر الله وما والاه وعالما أو متعلما ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah (s.a.w) said:                     \"Lo! Indeed the world is cursed. What is in it is cursed, except for remembrance of Allah, what is conducive to that, the knowledgeable person and the learning person.\"",
      "chain": [
        "30514",
        "28408",
        "20731",
        "18732",
        "13"
      ]
    },
    {
      "hadith_no": "3524",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا محمد بن حاتم المكتب، حدثنا أبو بدر، شجاع بن الوليد عن الرحيل بن معاوية، أخي زهير بن معاوية عن الرقاشي، عن أنس بن مالك، قال كان النبي صلى الله عليه وسلم إذا كربه أمر قال ‏\"‏ يا حى يا قيوم برحمتك أستغيث ‏\"‏ ‏.‏ وبإسناده قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ألظوا بيا ذا الجلال والإكرام ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏ وقد روي هذا الحديث عن أنس من غير هذا الوجه ‏.‏",
      "text_en": " Anas bin Malik said:                     “Whenever a matter would distress him, the Prophet would say: ‘O Living, O Self-Sustaining Sustainer! Inr Your Mercy do I seek relief (Ya Hayyu Ya Qayyum, Bi-Rahmatika Astaghith).’”And with this chain, that he said: “The Messenger of Allah said: ‘Be constant with: “O Possessor of Majesty and Honor. (Ya Dhal-Jalali Wal-Ikram).’”",
      "chain": [
        "30514",
        "20328",
        "19"
      ]
    },
    {
      "hadith_no": "4194",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن حاتم المكتب المؤدب، حدثنا القاسم بن مالك المزني، عن عبد الملك بن أبي سليمان، عن عطاء، عن ابن عباس، قال دعا لي رسول الله صلى الله عليه وسلم أن يؤتيني الله الحكمة مرتين ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه من حديث عطاء ‏.‏ وقد رواه عكرمة عن ابن عباس ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     \"The Messenger of Allah (ﷺ) supplicated for me that Allah should give me Al-Hukm (knowledge, understanding, judging justly, or understanding of the Qur'an) two times.\"",
      "chain": [
        "30514",
        "20350",
        "10945",
        "11029",
        "17"
      ]
    },
    {
      "hadith_no": "397",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Ghusl and Tayammum - كتاب الغسل والتيمم",
      "chapter_no": "4",
      "text_ar": "أخبرنا محمد بن حاتم، قال حدثنا حبان، قال حدثنا عبد الله، عن معمر، عن همام بن منبه، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏‏\"‏‏ لا يبولن الرجل في الماء الدائم ثم يغتسل منه أو يتوضأ ‏‏\"‏‏ ‏‏.‏‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:                      \"None of you should urinate into standing water and then perform Ghusl or Wudu' with it.\"",
      "chain": [
        "30514",
        "20218",
        "20025",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "436",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Ghusl and Tayammum - كتاب الغسل والتيمم",
      "chapter_no": "4",
      "text_ar": "أخبرنا محمد بن حاتم قال: حدثنا عبيدة قال: حدثنا سليمان الأعمش عن حبيب بن أبي ثابت عن سعيد بن جبير عن ابن عباس عن علي رضي الله عنه قال: كنت رجلا مذاء فأمرت رجلا فسأل النبي صلى الله عليه وسلم فقال: «فيه الوضوء».",
      "text_en": " It was narrated that 'Ali, may Allah be please with him, said:                      \"I was a man who emotted a great deal of Madhi. I told a man to ask the Prophet (ﷺ) (about that) and he said: 'Wudu' (is required) for that.\"",
      "chain": [
        "30514",
        "11060",
        "11331",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "1800",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا محمد بن حاتم بن نعيم، قال حدثنا حبان، ومحمد بن مكي، قالا أنبأنا عبد الله، عن أبي يونس القشيري، عن ابن أبي رباح، عن شهر بن حوشب، حدثه عن أم حبيبة بنت أبي سفيان، قالت من صلى ثنتى عشرة ركعة في يوم فصلى قبل الظهر بنى الله له بيتا في الجنة ‏.‏",
      "text_en": " It was narrated that Umm Habibah bint Abi Sufyan said:                     \"Whoever prays twelve rak'ahs in a day and prays before Zuhr, Allah (SWT) will build for him a house in Paradise.\"",
      "chain": [
        "30514",
        "20218",
        "18",
        "11044",
        "59"
      ]
    },
    {
      "hadith_no": "1806",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا محمد بن حاتم، قال حدثنا محمد بن مكي، وحبان، قالا حدثنا عبد الله، عن إسماعيل، عن المسيب بن رافع، عن أم حبيبة، قالت من صلى في يوم وليلة ثنتى عشرة ركعة سوى المكتوبة بنى الله عز وجل له بيتا في الجنة ‏.‏ لم يرفعه حصين وأدخل بين عنبسة وبين المسيب ذكوان ‏.‏",
      "text_en": " It was narrated that Umm Habibah said:                     \"Whoever prays twelve rak'ahs during the night and day apart from the prescribed prayers, Allah (SWT), the Mighty and Sublime, will build for him a house in Paradise.\"",
      "chain": [
        "30514",
        "20218",
        "18",
        "20208",
        "11394",
        "59"
      ]
    },
    {
      "hadith_no": "2105",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن حاتم، قال أنبأنا حبان بن موسى، - خراساني - قال أنبأنا عبد الله، عن معمر، عن الزهري، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا دخل رمضان فتحت أبواب الرحمة وغلقت أبواب جهنم وسلسلت الشياطين ‏\"‏ ‏.‏",
      "text_en": " It was narrated Az-Zuhri, from Abu Hurairah that the Prophet said:                     \"When Ramadan begins, the gates of mercy are opened and the gates of Hall are closed, and the devils are chained up.\"",
      "chain": [
        "30514",
        "30322",
        "20025",
        "20115",
        "11013",
        "13"
      ]
    },
    {
      "hadith_no": "2115",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن حاتم بن نعيم، - مصيصي - قال أنبأنا حبان بن موسى المروزي، قال أنبأنا عبد الله، عن سفيان، عن سماك، عن عكرمة، مرسل ‏.‏",
      "text_en": " Narrated 'Ikramah:                     A similar, Mursal, report was narrated from 'Ikrimah.",
      "chain": [
        "30514",
        "30322",
        "20025",
        "20012",
        "10770"
      ]
    },
    {
      "hadith_no": "2128",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن حاتم، قال حدثنا حبان، قال حدثنا عبد الله، عن الحجاج بن أرطاة، عن منصور، عن ربعي، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا رأيتم الهلال فصوموا وإذا رأيتموه فأفطروا فإن غم عليكم فأتموا شعبان ثلاثين إلا أن تروا الهلال قبل ذلك ثم صوموا رمضان ثلاثين إلا أن تروا الهلال قبل ذلك ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ribi said;\"the Messenger of Allah said:                      \"The Messenger of Allah said: 'When you see the crescent then fast, and when you see it, then stop fasting. If it is too cloudy then complete Shaban as thirty days, unless you see the crescent before that, then fast Ramadan as thirty days, unless you see the new crescent before that.\"'",
      "chain": [
        "30514",
        "20218",
        "20025",
        "20580",
        "11067",
        "11334"
      ]
    },
    {
      "hadith_no": "2217",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن حاتم، قال أنبأنا سويد، قال أنبأنا عبد الله، عن ابن جريج، قراءة عليه عن عطاء بن أبي رباح، قال أخبرني عطاء الزيات، أنه سمع أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ قال الله عز وجل كل عمل ابن آدم له إلا الصيام هو لي وأنا أجزي به الصيام جنة فإذا كان يوم صوم أحدكم فلا يرفث ولا يصخب فإن شاتمه أحد أو قاتله فليقل إني امرؤ صائم والذي نفس محمد بيده لخلوف فم الصائم أطيب عند الله من ريح المسك ‏\"‏ ‏.‏ وقد روى هذا الحديث عن أبي هريرة سعيد بن المسيب ‏.‏",
      "text_en": " Abu Hurairah said:                     \"The Messenger of Allah said: 'Allah, the Mighty and sublime, said: Every deed of the son of Adam is for him, except fasting; it is for me and I shall reward for it. Fasting is a shield. If any one of you is observing a fast, let him not utte obscene a fast, let him not utter obscene talk or raise his voice in anger, and if anyone insults him or wants to fight, let him say: I am a person who is fasting. By the One in Whose hand is the soul of Muhammad, the smell coming from the mouth of the fasting person is better before Allah than the fragrance of musk.\" ' (Sahih) This Hadith was narrated from Abu Hurairah by Saeed bin Al-Musayyab.",
      "chain": [
        "30514",
        "20025",
        "11029",
        "13"
      ]
    },
    {
      "hadith_no": "2235",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن حاتم، قال أنبأنا حبان، قال أنبأنا عبد الله، عن مسعر، عن الوليد بن أبي مالك، قال حدثنا أصحابنا، عن أبي عبيدة، قال الصيام جنة ما لم يخرقها ‏.‏",
      "text_en": " It was narrated that Al-Walid bin Abi Malik said:                     \"Our companions narrated to us that Abu 'Ubaidah said: 'Fasting is a shield, so long as you do not damage it.\"'",
      "chain": [
        "30514",
        "20218",
        "20025",
        "20359",
        "10"
      ]
    },
    {
      "hadith_no": "2275",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن حاتم، قال حدثنا حبان، قال أنبأنا عبد الله، عن ابن عيينة، عن أيوب، عن شيخ، من قشير عن عمه، حدثنا ثم، ألفيناه في إبل له فقال له أبو قلابة حدثه فقال الشيخ حدثني عمي أنه ذهب في إبل له فانتهى إلى النبي صلى الله عليه وسلم وهو يأكل أو قال يطعم فقال ‏\"‏ ادن فكل أو قال ‏\"‏ ادن فاطعم ‏\"‏ ‏.‏ فقلت إني صائم ‏.‏ فقال ‏\"‏ إن الله عز وجل وضع عن المسافر شطر الصلاة والصيام وعن الحامل والمرضع ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ayyub, from a Shailh of Qushair, from his paternal uncle;then we met him concerning some camels of his, and Bu Qilabah said to him:                      \"Tell it to us.\" The old man said: \"My paternal uncle told me that he went to the Prophet, concerning some camels of his, while he was eating. He said: 'Come and eat.' I said: 'I am fasting.' He said: 'Allah, the mighty and sublime, has waived half of the prayer and fasting for the traveler, the pregnant woman and the sick.\"'",
      "chain": [
        "30514",
        "20218",
        "20025",
        "20005",
        "11015"
      ]
    },
    {
      "hadith_no": "2287",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن حاتم، قال أنبأنا سويد، قال أخبرنا عبد الله، عن شعبة، عن الحكم، عن مقسم، عن ابن عباس، أن النبي صلى الله عليه وسلم خرج في رمضان فصام حتى أتى قديدا ثم أتي بقدح من لبن فشرب وأفطر هو وأصحابه ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that:                     the Prophet went out in Ramadan and fasted until he came to Qudaid, then a cup of milk was brought to him and he drank and broke his fast; he and his Companions.",
      "chain": [
        "30514",
        "20025",
        "20020",
        "11069",
        "11725",
        "17"
      ]
    },
    {
      "hadith_no": "2338",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن حاتم، قال أنبأنا حبان، قال أنبأنا عبد الله، عن سفيان بن عيينة، ومعمر، عن الزهري، عن حمزة بن عبد الله بن عمر، عن أبيه، عن حفصة، قالت لا صيام لمن لم يجمع الصيام قبل الفجر ‏.‏",
      "text_en": " It was narrated that Hafsah that:                     \"There is no fast for the one who does not intend to fast before dawn.\"",
      "chain": [
        "30514",
        "20218",
        "20025",
        "20005",
        "20115",
        "11013",
        "11818",
        "18",
        "54"
      ]
    },
    {
      "hadith_no": "2410",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن حاتم، قال أنبأنا حبان، قال أنبأنا عبد الله، عن عاصم، عن أبي عثمان، عن رجل، قال أبو ذر سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من صام ثلاثة أيام من كل شهر فقد تم صوم الشهر أو فله صوم الشهر ‏\"‏ ‏.‏ شك عاصم ‏.‏",
      "text_en": " Abu 'Uthman reported from a man, that Abu Dharrr said:                     \"I heard the Messenger of Allah say: \"Whoever fasts three days of each month has fasted the month in full' or 'will have (the reward of) fasting the month.\"' 'Asim was in doubt.",
      "chain": [
        "30514",
        "20218",
        "20025",
        "11080",
        "11113",
        "23"
      ]
    },
    {
      "hadith_no": "2431",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن حاتم، قال أنبأنا حبان، قال أنبأنا عبد الله، عن شعبة، عن أنس بن سيرين، قال سمعت عبد الملك بن أبي المنهال، يحدث عن أبيه، أن النبي صلى الله عليه وسلم أمرهم بصيام ثلاثة أيام البيض قال ‏\"‏ هي صوم الشهر ‏\"‏ ‏.‏",
      "text_en": " 'Abdul-Malik bin Abi Al-Minhai narrated from his father that:                     the Prophet  commanded them to fast the three days of Al-Bid. He said: \"That is (equivalent to) fasting for the whole month.\"",
      "chain": [
        "30514",
        "20218",
        "20025",
        "20020",
        "11038"
      ]
    },
    {
      "hadith_no": "2991",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن حاتم، قال أنبأنا سويد، قال أنبأنا عبد الله، عن يونس، عن ابن شهاب، عن عروة، عن عائشة، قالت خرجنا مع رسول الله صلى الله عليه وسلم في حجة الوداع فمنا من أهل بالحج ومنا من أهل بعمرة وأهدى فقال رسول الله صلى الله عليه وسلم ‏\"‏ من أهل بعمرة ولم يهد فليحلل ومن أهل بعمرة فأهدى فلا يحل ومن أهل بحجة فليتم حجه ‏\"‏ ‏.‏ قالت عائشة وكنت ممن أهل بعمرة ‏.‏",
      "text_en": " It was narrated that Aishah said:                     \"We set out with the Messenger of Allah for the Farewell Pilgrimage. Some of us entered Ihram for Hajj and some of us entered Ihram for Umrah and brought along a Hadi. The Messenger of Allah said: 'Whoever entered Ihram for Umrah and did not bring Hadi, let him exit Ihram. And whoever entered Ihram for Umrah and did bring a Hadi, let him not exit Ihra. Whoever entered Ihram for Hajj let him complete his Hajj.'\" Aishah said \"And I was one of those who had entered Ihram for Umrah.\"",
      "chain": [
        "30514",
        "20025",
        "20475",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2996",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن حاتم بن نعيم، قال أنبأنا سويد، قال أنبأنا عبد الله، عن عبد الوارث، - ثقة - قال حدثنا حميد الأعرج، عن محمد بن إبراهيم التيمي، عن رجل، منهم يقال له عبد الرحمن بن معاذ قال خطبنا رسول الله صلى الله عليه وسلم بمنى ففتح الله أسماعنا حتى إن كنا لنسمع ما يقول ونحن في منازلنا فطفق النبي صلى الله عليه وسلم يعلمهم مناسكهم حتى بلغ الجمار فقال بحصى الخذف وأمر المهاجرين أن ينزلوا في مقدم المسجد وأمر الأنصار أن ينزلوا في مؤخر المسجد ‏.‏",
      "text_en": " It was narrated from Muhammad bin Ibrahim At-Taimi that a man amonth them who was called Abdulr-Rahman bin Muadh said:                     The Messenger of Allah addressed us in Mina, and Allah enabled us to hear hwat he said when we were in our encampments. The Prophet started to teach them their rituals until he reached the Himar (Stoning the pillars), and he said: look for pebbles the size of date stones or fingertips. And he told the Muhajirun to camp in front of the Masjid and the Ansar to camp behind the Masjid.",
      "chain": [
        "30514",
        "20025",
        "11213"
      ]
    },
    {
      "hadith_no": "3017",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن حاتم، قال حدثنا حبان، قال أنبأنا عبد الله، عن عبد الملك بن أبي سليمان، عن عطاء، عن ابن عباس، عن الفضل بن عباس، قال أفاض رسول الله صلى الله عليه وسلم من عرفات وردفه أسامة بن زيد فجالت به الناقة وهو رافع يديه لا تجاوزان رأسه فما زال يسير على هينته حتى انتهى إلى جمع ‏.‏",
      "text_en": " It was narrated from Ibn Abbas that Al-Fadl bin Abbas said:                     \"The Messenger of Allah departed from Arafat and Usmah bin Zaid rode behind him. His camel bolted and he was raising his hands (to rein it in) but not above his head. He carried on like that until he reached Jam (Al-Muzdalifah).\"",
      "chain": [
        "30514",
        "20218",
        "20025",
        "10945",
        "11029",
        "17",
        "135"
      ]
    },
    {
      "hadith_no": "3031",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن حاتم، قال أنبأنا حبان، قال أنبأنا عبد الله، عن إبراهيم بن عقبة، أن كريبا، قال سألت أسامة بن زيد - وكان ردف رسول الله صلى الله عليه وسلم عشية عرفة - فقلت كيف فعلتم قال أقبلنا نسير حتى بلغنا المزدلفة فأناخ فصلى المغرب ثم بعث إلى القوم فأناخوا في منازلهم فلم يحلوا حتى صلى رسول الله صلى الله عليه وسلم العشاء الآخرة ثم حل الناس فنزلوا فلما أصبحنا انطلقت على رجلي في سباق قريش وردفه الفضل ‏.‏",
      "text_en": " It was narrated from Ibrahim bin Uqbah that Kuraib said:                     \"I asked usamah bin Zaid, who rode behind the Messenger of Allah one the evening of Arafat. I said: \"What did you do?' He said: 'We started traveling until we reached Al-Muzadalifah, then he stopped and prayed Maghrib. Then he sent word to the people to stay in their camps, and they did not unload their camels until the Messenger of Allah had prayed the later Isah. Then the people unloaded their camels and made camp. When morning came I set out on foot amonth those of the Quraish who got there first, and Al-Fadl rode behind the Prophet.'\"",
      "chain": [
        "30514",
        "20218",
        "20025",
        "11125",
        "11211",
        "50"
      ]
    },
    {
      "hadith_no": "3422",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا محمد بن حاتم بن نعيم، قال حدثنا محمد بن مكي بن عيسى، قال حدثنا عبد الله، قال حدثنا يونس، عن الزهري، عن عبد الرحمن بن عبد الله بن كعب بن مالك، قال سمعت كعب بن مالك، يحدث حديثه حين تخلف عن رسول الله صلى الله عليه وسلم في غزوة تبوك وقال فيه إذا رسول رسول الله صلى الله عليه وسلم يأتيني فقال إن رسول الله صلى الله عليه وسلم ح وأخبرني سليمان بن داود قال أنبأنا ابن وهب عن يونس قال ابن شهاب أخبرني عبد الرحمن بن عبد الله بن كعب بن مالك أن عبد الله بن كعب بن مالك قال سمعت كعب بن مالك يحدث حديثه حين تخلف عن رسول الله صلى الله عليه وسلم في غزوة تبوك وساق قصته وقال إذا رسول رسول الله صلى الله عليه وسلم يأتي فقال إن رسول الله صلى الله عليه وسلم يأمرك أن تعتزل امرأتك ‏.‏ فقلت أطلقها أم ماذا قال لا بل اعتزلها فلا تقربها ‏.‏ فقلت لامرأتي الحقي بأهلك فكوني عندهم حتى يقضي الله عز وجل في هذا الأمر ‏.‏",
      "text_en": " Ka'b bin Malik narrated the Hadith about when he stayed behind, and did not join the Messenger of Allah on the expedition to Tabuk. He told the story, and said:                      \"The envoy of the Messenger of Allah came to me and said: 'The Messenger of Allah commands you to stay away from your wife.' I said: 'Shall I divorce her or what?' He said: 'No, just keep away from her and do not approach her.' I said to my wife: 'Go to your family and stay with them until Allah, the Mighty and Sublime, decides concerning this matter.'\"",
      "chain": [
        "30514",
        "33027",
        "20025",
        "20475",
        "11013",
        "11519",
        "390"
      ]
    },
    {
      "hadith_no": "3617",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Wills - كتاب الوصايا",
      "chapter_no": "30",
      "text_ar": "أخبرنا محمد بن حاتم بن نعيم، قال حدثنا حبان، قال أنبأنا عبد الله، عن ابن عون، عن نافع، عن ابن عمر، قوله‏.‏",
      "text_en": " (The same) was narrated from Ibn 'Awn, from Nafi', from Ibn 'Umar.",
      "chain": [
        "30514",
        "20218",
        "20025",
        "11071",
        "11014"
      ]
    },
    {
      "hadith_no": "3678",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Presents - كتاب النحل",
      "chapter_no": "31",
      "text_ar": "أخبرنا محمد بن حاتم، قال حدثنا حبان، قال حدثنا عبد الله، عن هشام بن عروة، عن أبيه، أن بشيرا، أتى النبي صلى الله عليه وسلم فقال يا نبي الله نحلت النعمان نحلة ‏.‏ قال ‏\"‏ أعطيت لإخوته ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ فاردده ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Hisham bin 'Urwah, from his father, that Bashir came to the Prophet and said:                      \"O Prophet of Allah, I have given An-Nu'man a present.\" He said: \"Have you given something to his brothers?\" He said: \"No.\" He said: \"Then take it back.\"",
      "chain": [
        "30514",
        "20218",
        "20025",
        "11065",
        "10511"
      ]
    },
    {
      "hadith_no": "3684",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Presents - كتاب النحل",
      "chapter_no": "31",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا أبو نعيم، قال حدثنا زكريا، عن عامر، قال حدثني عبد الله بن عتبة بن مسعود، ح وأنبأنا محمد بن حاتم، قال أنبأنا حبان، قال أنبأنا عبد الله، عن زكريا، عن الشعبي، عن عبد الله بن عتبة بن مسعود، أن رجلا، جاء إلى النبي صلى الله عليه وسلم - وقال محمد أتى النبي صلى الله عليه وسلم - فقال إني تصدقت على ابني بصدقة فاشهد فقال ‏\"‏ هل لك ولد غيره ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ أعطيتهم كما أعطيته ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ أأشهد على جور ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin 'Utbah bin Mas'ud that a man came to the Prophet and said:                      \"I have given a gift to my son, so bear witness.\" He said: \"Do you have any other children?\" He said: \"Yes.\" He said: \"Have you given them something like that which you have given him?\" He said: \"No.\" He said: \"Shall I bear witness to unfairness?\"",
      "chain": [
        "38022",
        "20348",
        "11338",
        "11052",
        "4145",
        "30514",
        "20218",
        "18",
        "11338",
        "11052",
        "4145"
      ]
    },
    {
      "hadith_no": "3686",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Presents - كتاب النحل",
      "chapter_no": "31",
      "text_ar": "أخبرنا محمد بن حاتم، قال أنبأنا حبان، قال أنبأنا عبد الله، عن فطر، عن مسلم بن صبيح، قال سمعت النعمان، يقول وهو يخطب انطلق بي أبي إلى رسول الله صلى الله عليه وسلم يشهده على عطية أعطانيها فقال ‏\"‏ هل لك بنون سواه ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ سو بينهم ‏\"‏ ‏.‏",
      "text_en": " An-Nu'man said, when he was delivering a Khutbah:                      \"My father took me to the Messenger of Allah to ask him to bear witness to a gift that he had given me. He said: 'Do you have any other children besides him?' He said: 'Yes.' He said: 'Treat them equally.'\"",
      "chain": [
        "30514",
        "20218",
        "20025",
        "11392",
        "274"
      ]
    },
    {
      "hadith_no": "3692",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Gifts - كتاب الهبة",
      "chapter_no": "32",
      "text_ar": "أخبرنا محمد بن حاتم، قال حدثنا حبان، قال أنبأنا عبد الله، عن إبراهيم بن نافع، عن الحسن بن مسلم، عن طاوس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يحل لأحد أن يهب هبة ثم يرجع فيها إلا من ولده ‏\"‏ ‏.‏ قال طاوس كنت أسمع وأنا صغير عائد في قيئه فلم ندر أنه ضرب له مثلا قال ‏\"‏ فمن فعل ذلك فمثله كمثل الكلب يأكل ثم يقيء ثم يعود في قيئه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Tawus said:                      \"The Messenger of Allah said: 'It is not permissible for anyone to give a gift then take it back, except from one's son.'\" Tawus said: \"When I was young I used to hear (the phrase), 'The one who goes back to his vomit,' but we did not realize that this was a similitude.\" He said: \"The likeness of the one who does that is that of a dog which eats then vomits, then goes back to its vomit.\"",
      "chain": [
        "30514",
        "20218",
        "20025",
        "20189",
        "11557",
        "11053"
      ]
    },
    {
      "hadith_no": "3700",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Gifts - كتاب الهبة",
      "chapter_no": "32",
      "text_ar": "أخبرنا محمد بن حاتم بن نعيم، قال حدثنا حبان، قال أنبأنا عبد الله، عن خالد، عن عكرمة، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ليس لنا مثل السوء الراجع في هبته كالكلب في قيئه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                      \"The Messenger of Allah said: 'It does not befit us to leave bad examples. The one who takes back his gift is like a dog with its vomit.'\"",
      "chain": [
        "30514",
        "20218",
        "20025",
        "11282",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "3705",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Gifts - كتاب الهبة",
      "chapter_no": "32",
      "text_ar": "أخبرنا محمد بن حاتم بن نعيم، قال حدثنا حبان، أنبأنا عبد الله، عن حنظلة، أنه سمع طاوسا، يقول أخبرنا بعض، من أدرك النبي صلى الله عليه وسلم أنه قال ‏\"‏ مثل الذي يهب فيرجع في هبته كمثل الكلب يأكل فيقيء ثم يأكل قيئه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Hanzalah that he heard Tawus say:                      \"Some of those who met the Prophet told us that he said: 'The likeness of the one who gives (something), then takes back his gift, is that of a dog which eats, then vomits, then eats its vomit.'\"",
      "chain": [
        "30514",
        "20218",
        "20025",
        "11243",
        "11053"
      ]
    },
    {
      "hadith_no": "3714",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of ar-Ruqba - كتاب الرقبى",
      "chapter_no": "33",
      "text_ar": "أخبرنا محمد بن حاتم، قال أنبأنا حبان، قال حدثنا عبد الله، عن حنظلة، أنه سمع طاوسا، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تحل الرقبى فمن أرقب رقبى فهو سبيل الميراث ‏\"‏ ‏.‏",
      "text_en": " Hanzalah narrated that he heard Tawus say:                      \"The Messenger of Allah said: 'Ruqba is not permissible. Whoever is given something on the basis of Ruqba, it is part of his estate.'\"",
      "chain": [
        "30514",
        "20218",
        "20025",
        "11243",
        "11053"
      ]
    },
    {
      "hadith_no": "3719",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of ar-Ruqba - كتاب الرقبى",
      "chapter_no": "33",
      "text_ar": "أخبرنا محمد بن حاتم، قال أنبأنا حبان، قال أنبأنا عبد الله، عن معمر، قال سمعت عمرو بن دينار، يحدث عن طاوس، عن حجر المدري، عن زيد بن ثابت، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ العمرى للوارث ‏\"‏ ‏.‏ والله أعلم ‏.‏",
      "text_en": " (A different chain) from Ma'mar who said:                      \"I heard 'Amr bin Dinar, narrating from Tawus, from Hujr Al-Madari, from Zaid bin Thabit, that the Messenger of Allah said: \"'Umra (a gift given for life) belongs to the heir.\" And Allah knows best.\"",
      "chain": [
        "30514",
        "20218",
        "20025",
        "20115",
        "11081",
        "11053",
        "49"
      ]
    },
    {
      "hadith_no": "3726",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of 'Umra - كتاب العمرى",
      "chapter_no": "34",
      "text_ar": "أخبرنا محمد بن حاتم، قال حدثنا حبان، قال أنبأنا عبد الله، عن محمد بن إسحاق، قال حدثنا مكحول، عن طاوس، بتل رسول الله صلى الله عليه وسلم العمرى والرقبى ‏.‏",
      "text_en": " It was narrated from Tawus that the Messenger of Allah made 'Umra and Ruqba binding.",
      "chain": [
        "30514",
        "20218",
        "20025",
        "11107",
        "11066"
      ]
    },
    {
      "hadith_no": "3730",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of 'Umra - كتاب العمرى",
      "chapter_no": "34",
      "text_ar": "أخبرنا محمد بن حاتم، قال أنبأنا حبان، قال أنبأنا عبد الله، عن عبد الملك بن أبي سليمان، عن عطاء، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أعطي شيئا حياته فهو له حياته وموته ‏\"‏ ‏.‏",
      "text_en": " 'Abdul-Malik bin Abi Sulaiman narrated from 'Ata' who said:                      \"The Messenger of Allah said: 'Whoever is given something for the rest of his life, it belongs to him for as long as he lives and after he dies.'\"",
      "chain": [
        "30514",
        "20218",
        "20025",
        "10945",
        "11029"
      ]
    },
    {
      "hadith_no": "3857",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا محمد بن حاتم، قال أنبأنا حبان، قال أنبأنا عبد الله، عن شعبة، عن حماد، عن إبراهيم، عن أبي سعيد، قال إذا استأجرت أجيرا فأعلمه أجره‏.‏‏",
      "text_en": " It was narrated that Abu Sa'eed said:                      \"When you hire a worker, tell him what his wages will be.\"",
      "chain": [
        "30514",
        "20218",
        "20025",
        "20020",
        "20022",
        "11051",
        "38"
      ]
    },
    {
      "hadith_no": "3859",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا محمد بن حاتم، قال أنبأنا حبان، قال أنبأنا عبد الله، عن جرير بن حازم، عن حماد، - هو ابن أبي سليمان - أنه سئل عن رجل، استأجر أجيرا على طعامه قال لا حتى تعلمه‏.‏‏",
      "text_en": " It was narrated from Hammad -Ibn Abi Sulaiman- that he was asked about a man who hired a worker in return for food and he said:                      \"No, not until he tells him (what his wages will be).\"",
      "chain": [
        "30514",
        "20218",
        "20025",
        "11272",
        "10756"
      ]
    },
    {
      "hadith_no": "3861",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا محمد بن حاتم، قال أنبأنا حبان، قال أنبأنا عبد الله، عن ابن جريج، قراءة قال قلت لعطاء عبد أؤاجره سنة بطعامه وسنة أخرى بكذا وكذا‏.‏‏ قال لا بأس به ويجزئه اشتراطك حين تؤاجره أياما أو آجرته وقد مضى بعض السنة قال إنك لا تحاسبني لما مضى‏.‏‏",
      "text_en": " It was narrated that Ibn Juraij said:                      \"I said to 'Ata': 'What if I hire a slave for a year in return for his food, and for another year, in return for such and such?' He said: 'There is nothing wrong with that, and you may stipulate your conditions of hiring even for a few days.' 'How about if I make a deal to hire him when part of the year has passed?' He said: 'Do not hold me to account for what has passed.'\"",
      "chain": [
        "30514",
        "20218",
        "20025"
      ]
    },
    {
      "hadith_no": "3924",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا محمد بن حاتم، قال حدثنا حبان، قال حدثنا عبد الله بن المبارك، عن ليث، قال حدثني بكير بن عبد الله بن الأشج، عن أسيد بن رافع بن خديج، أن أخا، رافع قال لقومه قد نهى رسول الله صلى الله عليه وسلم اليوم عن شىء كان لكم رافقا وأمره طاعة وخير نهى عن الحقل‏.‏‏",
      "text_en": " It was narrated from Usaid bin Rafi' bin Khadij that the brother of Rafi' said to his people:                      \"Today the Messenger of Allah has forbidden something which was convenient for you, but following his command is an act of obedience (to Allah) and is good. He forbade Al-Haql.\"",
      "chain": [
        "30514",
        "20218",
        "20025",
        "20023",
        "11154",
        "1988"
      ]
    },
    {
      "hadith_no": "3926",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا محمد بن حاتم، قال أنبأنا حبان، قال أنبأنا عبد الله، عن سعيد بن يزيد أبي شجاع، قال حدثني عيسى بن سهل بن رافع بن خديج، قال إني ليتيم في حجر جدي رافع بن خديج وبلغت رجلا وحججت معه فجاء أخي عمران بن سهل بن رافع بن خديج فقال يا أبتاه إنه قد أكرينا أرضنا فلانة بمائتى درهم‏.‏‏ فقال يا بنى دع ذاك فإن الله عز وجل سيجعل لكم رزقا غيره إن رسول الله صلى الله عليه وسلم قد نهى عن كراء الأرض‏.‏‏",
      "text_en": " 'Eisa bin Sahl bin Rafi' bin Khadij narrated:                      \"I was an orphan in the care of my grandfather Rafi' bin Khadij. I reached puberty and became a man, and I performed Hajj with him. My brother 'Imran bin Sahl bin Rafi' bin Khadij came and said: 'O my father, we have leased our land to so and so (a woman) for two hundred Dirhams.' He said: 'O my son, leave that (do not do it), for Allah will give you other provision. The Messenger of Allah forbade leasing land.'\"",
      "chain": [
        "30514",
        "20218",
        "20025"
      ]
    },
    {
      "hadith_no": "3967",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا محمد بن حاتم بن نعيم، قال أنبأنا حبان، قال حدثنا عبد الله، عن حميد الطويل، عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أمرت أن أقاتل الناس حتى يشهدوا أن لا إله إلا الله وأن محمدا رسول الله فإذا شهدوا أن لا إله إلا الله وأن محمدا رسول الله واستقبلوا قبلتنا وأكلوا ذبيحتنا وصلوا صلاتنا فقد حرمت علينا دماؤهم وأموالهم إلا بحقها لهم ما للمسلمين وعليهم ما عليهم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Anas bin Malik that :                     The Messenger of Allah [SAW] said: \"I have been commanded to fight the idolators until they bear witness to La ilaha illallah (there is none worthy of worship except Allah) and that Muhammad is the Messenger of Allah [SAW]. If they bear witness to La ilaha illallah and that Muhammad is the Messenger of Allah [SAW], and they face our Qiblah, eat our slaughtered animals, and pray as we do, then their blood and wealth become forbidden except for a right that is due, and they will have the same rights and obligations as the Muslims.\"",
      "chain": [
        "30514",
        "20218",
        "20025",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "4880",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرنا محمد بن حاتم بن نعيم، قال أنبأنا حبان، قال حدثنا عبد الله، عن الأوزاعي، قال حدثني عطاء بن أبي رباح، أن رجلا، سرق ثوبا فأتي به رسول الله صلى الله عليه وسلم فأمر بقطعه فقال الرجل يا رسول الله هو له ‏.‏ قال ‏\"‏ فهلا قبل الآن ‏\"‏ ‏.‏",
      "text_en": " 'Ata' bin Abi Rabah narrated that:                     a man stole a garment, and was brought before the Messenger of Allah, who order that his hand be cut off. The man said: \"O Messenger of Allah, he can keep it.\" He said: \"Why (did you not say that) before now?\"",
      "chain": [
        "30514",
        "20218",
        "20025",
        "20024",
        "11029"
      ]
    },
    {
      "hadith_no": "4916",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرنا محمد بن حاتم، قال أنبأنا حبان بن موسى، قال حدثنا عبد الله، عن يونس، عن الزهري، قال قالت عمرة عن عائشة، رضى الله عنها عن رسول الله صلى الله عليه وسلم ‏\"‏ تقطع يد السارق في ربع دينار ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Az-Zuhri said:                     \"Amrah said, narrating from 'Aishah, may Allah be pleased with her, that the Messenger of Allah cut off the hand of a thief for a quarter of a Dinar.\"",
      "chain": [
        "30514",
        "30322",
        "20025",
        "20475",
        "11013",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "5003",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book Of Faith and its Signs - كتاب الإيمان وشرائعه",
      "chapter_no": "47",
      "text_ar": "أخبرنا محمد بن حاتم بن نعيم، قال أنبأنا حبان، قال أنبأنا عبد الله، عن حميد الطويل، عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أمرت أن أقاتل الناس حتى يشهدوا أن لا إله إلا الله وأن محمدا رسول الله فإذا شهدوا أن لا إله إلا الله وأن محمدا رسول الله واستقبلوا قبلتنا وأكلوا ذبيحتنا وصلوا صلاتنا فقد حرمت علينا دماؤهم وأموالهم إلا بحقها لهم ما للمسلمين وعليهم ما عليهم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Anas bin Malik that:                     The Messenger of Allah [SAW] said: \"I have been commanded to fight the people until they bear witness that there is none worthy of worship except Allah and that Muhammad is the Messenger of Allah. If they bear witness that there is none worthy of worship except Allah and that Muhammad is the Messenger of Allah, they turn to face the same Qiblah as us, they eat our slaughtered animals, and they pray as we pray; then their blood and their wealth are forbidden to us, except for a right that is due, and they have the same rights and duties as the Muslims.\"",
      "chain": [
        "30514",
        "20218",
        "20025",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "5110",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا محمد بن حاتم، قال حدثنا حبان، قال حدثنا عبد الله، عن حيوة بن شريح، قال حدثني عياش بن عباس القتباني، عن أبي الحصين الحميري، أنه كان هو وصاحب له يلزمان أبا ريحانة يتعلمان منه خيرا قال فحضر صاحبي يوما فأخبرني صاحبي أنه سمع أبا ريحانة يقول إن رسول الله صلى الله عليه وسلم حرم الوشر والوشم والنتف ‏.‏",
      "text_en": " It was narrated from Abu Al-Husain Al-Himyari that :                     He and a companion of his used to stay with Abu Raihanah to learn good things from him. He said: \"One day my companion came and told me that he heard Abu Raihanah say: 'The Messenger of Allah [SAW] forbade filing (the teeth), tattoos, and plucking hairs.'\"",
      "chain": [
        "30514",
        "20218",
        "20025",
        "26010",
        "10871",
        "16107",
        "10696"
      ]
    },
    {
      "hadith_no": "5146",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا محمد بن حاتم، قال حدثنا حبان، قال أنبأنا عبد الله، عن ليث بن سعد، قال حدثني يزيد بن أبي حبيب، عن ابن أبي الصعبة، عن رجل، من همدان يقال له أفلح عن ابن زرير، أنه سمع عليا، يقول إن نبي الله صلى الله عليه وسلم أخذ حريرا فجعله في يمينه وأخذ ذهبا فجعله في شماله ثم قال ‏\"‏ إن هذين حرام على ذكور أمتي ‏\"‏ ‏.‏ قال أبو عبد الرحمن وحديث ابن المبارك أولى بالصواب إلا قوله أفلح فإن أبا أفلح أشبه والله تعالى أعلم ‏.‏",
      "text_en": " 'Ali said:                     \"The Prophet of Allah [SAW] took hold of some silk in his right hand, and some gold in his left, then he said: 'These two are forbidden for the males of my Ummah.'\"",
      "chain": [
        "30514",
        "20218",
        "20025",
        "20023",
        "11411",
        "16056",
        "5"
      ]
    }
  ],
  "total_hadiths": 82
}