{
  "id": "30526",
  "name": "Yahya bin Ayoub al-Maqabri يحيى بن أيوب المقابري",
  "full_name": "Yahya bin Ayoub al-Maqabri يحيى بن أيوب المقابري",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "234",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Baghdad"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ عخ  م  د  عس  -  ثقة ]"
    ],
    "tags": [
      "al-Baghdadi",
      "'Abid"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20155",
      "name": "Isma'il bin Ja'far bin Abi Kathir إسماعيل بن جعفر بن أبي كثير الأنصاري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20468",
      "name": "Hashaym bin Bashayr bin al-Qasim هشيم بن بشير بن القاسم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20201",
      "name": "Marwan bin Mua'wiya al-Fazari مروان بن معاوية الفزاري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20584",
      "name": "Khlf bin Khlyfh خلف بن خليفة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20029",
      "name": "'Abdullah bin Wahb عبد الله بن وهب بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20032",
      "name": "Waki' bin al-Jarrah وكيع بن الجراح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20354",
      "name": "Muhammad bin Khazim al-Darir محمد بن خازم أبو معاوية الضرير",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20243",
      "name": "'Aabad bin 'Aabad bin Habib عباد بن عباد بن حبيب بن المهلب",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "25197",
      "name": "'Ali bin Gharab علي بن غراب",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "students": [
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]"
    },
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-muslim-251-2",
      "hadith_no": "251",
      "source": "Sahih Muslim",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا يحيى بن أيوب، وقتيبة، وابن، حجر جميعا عن إسماعيل بن جعفر، - قال ابن أيوب حدثنا إسماعيل، - أخبرني العلاء، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ألا أدلكم على ما يمحو الله به الخطايا ويرفع به الدرجات ‏\"‏ ‏.‏ قالوا بلى يا رسول الله ‏.‏ قال ‏\"‏ إسباغ الوضوء على المكاره وكثرة الخطا إلى المساجد وانتظار الصلاة بعد الصلاة فذلكم الرباط ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      The Messenger of Allah (may peace be upon him) said: Should I not suggest to you that by which Allah obliterates the sins and elevates the ranks (of a man). They (the hearers) said: Yes, Messenger of Allah. He said: Performing the ablution thoroughly despite odds, tranverside of more paces towards the mosque, and waiting for the next prayer after observing a prayer, and that is mindfulness.",
      "usc_msa_ref": "",
      "chain": [
        "30526",
        "30367",
        "20387",
        "20155",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-158",
      "hadith_no": "158",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا يحيى بن معين، حدثنا عمرو بن الربيع بن طارق، أخبرنا يحيى بن أيوب، عن عبد الرحمن بن رزين، عن محمد بن يزيد، عن أيوب بن قطن، عن أبى بن عمارة، - قال يحيى بن أيوب وكان قد صلى مع رسول الله صلى الله عليه وسلم للقبلتين - أنه قال يا رسول الله أمسح على الخفين قال ‏\"‏ نعم ‏\"‏ ‏.‏ قال يوما قال ‏\"‏ يوما ‏\"‏ ‏.‏ قال ويومين قال ‏\"‏ ويومين ‏\"‏ ‏.‏ قال وثلاثة قال ‏\"‏ نعم وما شئت ‏\"‏ ‏.‏ قال أبو داود رواه ابن أبي مريم المصري عن يحيى بن أيوب عن عبد الرحمن بن رزين عن محمد بن يزيد بن أبي زياد عن عبادة بن نسى عن أبى بن عمارة قال فيه حتى بلغ سبعا ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ نعم وما بدا لك ‏\"‏ قال أبو داود وقد اختلف في إسناده وليس هو بالقوي ورواه ابن أبي مريم ويحيى بن إسحاق السيلحيني عن يحيى بن أيوب وقد اختلف في إسناده ‏.‏",
      "text_en": " Narrated Ubayy ibn Umarah:                     I asked: Messenger of Allah (ﷺ) may I wipe over the socks? He replied: Yes. He asked: For one day? He replied: For one day. He again asked: And for two days? He replied: For two days too. He again asked: And for three days? He replied: Yes, as long as you wish.Abu Dawud said: Another version says: He asked him about the period until he reached the period of seven days. The Messenger of Allah (ﷺ) replied: Yes, as long as you wish (i.e. there is no time limit).Abu Dawud said: There is a variance in the chain of narrators of this tradition. The chain is not strong.Another chain from Yahya b. Ayyub is also disputed.",
      "usc_msa_ref": "",
      "chain": [
        "30020",
        "30206",
        "20379",
        "34204",
        "18069",
        "30526"
      ]
    },
    {
      "id": "sunan-abi-daud-3086",
      "hadith_no": "3086",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا يحيى بن أيوب، حدثنا عباد بن العوام، عن هشام، عن الحسن، قال الركاز الكنز العادي",
      "text_en": " Al hasan said “Rikaz means treasure buried in pre Islamic times.”",
      "usc_msa_ref": "",
      "chain": [
        "30526",
        "20431",
        "20295",
        "11016"
      ]
    },
    {
      "id": "sunan-abi-daud-4609",
      "hadith_no": "4609",
      "source": "Sunan Abi Da'ud",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا يحيى بن أيوب، حدثنا إسماعيل، - يعني ابن جعفر - قال أخبرني العلاء، - يعني ابن عبد الرحمن - عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من دعا إلى هدى كان له من الأجر مثل أجور من تبعه لا ينقص ذلك من أجورهم شيئا ومن دعا إلى ضلالة كان عليه من الإثم مثل آثام من تبعه لا ينقص ذلك من آثامهم شيئا ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the Messenger of Allah (ﷺ) as saying:                      If anyone summons other to follow right guidance, his reward will be equivalent to that of the people who follow him, without their rewards being diminished in any respect on that account; and if anyone summons others to follow error the sin of which sins being diminished in any respect on that account.",
      "usc_msa_ref": "",
      "chain": [
        "30526",
        "20155",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-5188",
      "hadith_no": "5188",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا يحيى بن أيوب، - يعني المقابري - حدثنا إسماعيل، - يعني ابن جعفر - حدثنا محمد بن عمرو، عن أبي سلمة، عن نافع بن عبد الحارث، قال خرجت مع رسول الله صلى الله عليه وسلم حتى دخلت حائطا فقال لي ‏\"‏ أمسك الباب ‏\"‏ ‏.‏ فضرب الباب فقلت ‏\"‏ من هذا ‏\"‏ ‏.‏ وساق الحديث ‏.‏ قال أبو داود يعني حديث أبي موسى الأشعري قال فيه فدق الباب ‏.‏",
      "text_en": " Narrated Nafi' ibn AbdulHarith:                     I went out with the (Messenger of Allah (ﷺ) until I entered a garden, he said: Keep on closing the door. The door was then closed. I then said: Who is there ? He then narrated the rest of the tradition.Abu Dawud said: That is to say, the tradition of Abu Musa al-Ash'ari. In this version he said: \"He then knocked at the door.\"",
      "usc_msa_ref": "",
      "chain": [
        "30526",
        "20155",
        "11220",
        "10567",
        "5309"
      ]
    }
  ],
  "total_hadiths": 5
}