{
  "id": "30524",
  "name": "Harun bin 'Abdullah al-Hamal هارون بن عبد الله بن مروان الحمال",
  "full_name": "Harun bin 'Abdullah al-Hamal هارون بن عبد الله بن مروان الحمال",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "243",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Baghdad"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  4  -  ثقة ]"
    ],
    "tags": [
      "al-Baghdadi",
      "hafiz"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20315",
      "name": "al-Husain bin 'Ali bin al-Walid al-Ja'fi الحسين بن علي بن الوليد الجعفي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20416",
      "name": "Ja'far bin Awn bin Ja'far جعفر بن عون بن جعفر",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20380",
      "name": "al-'Aswad bin 'Amir Shadhan الأسود بن عامر شاذان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20318",
      "name": "Hammad bin Usamah حماد بن أسامة - أبو أسامة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20224",
      "name": "Hmad bin Ms'd'h al-Tmymy حماد بن مسعدة التميمي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20229",
      "name": "Ruh bin 'Ubada bin al-'Ala' روح بن عبادة بن العلاء",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20547",
      "name": "Sulaiman bin Da'ud bin al-Jarud سليمان بن داود أبو داود الطيالسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20328",
      "name": "Shuja' bin al-Walid bin Qays al-Sakuni شجاع بن الوليد بن قيس",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20250",
      "name": "'Abdul Samad bin 'Abdul Warith bin Sa'id عبد الصمد بن عبد الوارث بن سعيد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20172",
      "name": "Muhammad bin Abi Fadayk محمد بن إسماعيل بن مسلم بن أبي فديك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "30213",
      "name": "Muhammad bin 'Ubaid al-Tanafasi محمد بن عبيد بن أبي أمية الطنافسي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "20277",
      "name": "Muhammad bin Bakr bin 'Uthman al-Barsani محمد بن بكر بن عثمان البرساني",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20355",
      "name": "Muhammad bin 'Abdullah bin al-Zubair محمد بن عبد الله أبو أحمد الزبيري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20254",
      "name": "Abu Bakr al-Hanfi عبد الكبير بن عبد المجيد- أبو بكر الحنفي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20472",
      "name": "Yazid bin Harun يزيد بن هارون",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20298",
      "name": "Wahb bin Jarir bin Hazim bin Zayd وهب بن جرير بن حازم بن زيد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30112",
      "name": "Ma'n bin 'Isa bin Yahya معن بن عيسى بن يحيى",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "students": [
    {
      "id": "30004",
      "name": "Ibn Maja ابن ماجة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]"
    },
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "30005",
      "name": "Imam Tirmidhi الترمذي محمد بن عيسى بن سورة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30006",
      "name": "Imam Nasa'i أحمد بن شعيب بن علي بن سنان النسائي",
      "grade": "3rd Century AH [12th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-muslim-412",
      "hadith_no": "412",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا الوليد بن شجاع، وهارون بن عبد الله، وحجاج بن الشاعر، قالوا حدثنا حجاج، - وهو ابن محمد - عن ابن جريج، قال أخبرني أبو الزبير، أنه سمع جابر بن عبد الله، يقول سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ لا تزال طائفة من أمتي يقاتلون على الحق ظاهرين إلى يوم القيامة - قال - فينزل عيسى ابن مريم صلى الله عليه وسلم فيقول أميرهم تعال صل لنا ‏.‏ فيقول لا ‏.‏ إن بعضكم على بعض أمراء ‏.‏ تكرمة الله هذه الأمة ‏\"‏ ‏.‏",
      "text_en": " Jabir b. 'Abdullah reported:                      I heard the Messenger of Allah (may peace be upon him) say: A section of my people will not cease fighting for the Truth and will prevail till the Day of Resurrection. He said: Jesus son of Mary would then descend and their (Muslims') commander would invite him to come and lead them in prayer, but he would say: No, some amongst you are commanders over some (amongst you). This is the honour from Allah for this Ummah.",
      "usc_msa_ref": "",
      "chain": [
        "30482",
        "30524",
        "38834",
        "20381",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "id": "sahih-muslim-419-5",
      "hadith_no": "419",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن المثنى، وهارون بن عبد الله، قالا حدثنا عبد الصمد، قال سمعت أبي يحدث، قال حدثنا عبد العزيز، عن أنس، قال لم يخرج إلينا نبي الله صلى الله عليه وسلم ثلاثا فأقيمت الصلاة فذهب أبو بكر يتقدم فقال نبي الله صلى الله عليه وسلم بالحجاب فرفعه فلما وضح لنا وجه نبي الله صلى الله عليه وسلم ما نظرنا منظرا قط كان أعجب إلينا من وجه النبي صلى الله عليه وسلم حين وضح لنا - قال - فأومأ نبي الله صلى الله عليه وسلم بيده إلى أبي بكر أن يتقدم وأرخى نبي الله صلى الله عليه وسلم الحجاب فلم نقدر عليه حتى مات ‏.‏",
      "text_en": " Anas reported:                      The Apostle of Allah (may peace be upon him) did not come to us for three days. When the prayer was about to start. Abu Bakr stepped forward (to lead the prayer), and the Apostle of Allah (may peace be upon him) lifted the curtain. When the face of the Apostle of Allah (may peace be upon him) became visible to us, we (found) that no sight was more endearing to us than the face of the Apostle of Allah (may peace be upon him) as it appeared to us. The Apostle of Allah (may peace be upon him) with the gesture of his hand directed Abu Bakr to step forward (and lead the prayer). The Apostle of Allah (may peace be upon him) then drew the curtain, and we could not see him till he died.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "30524",
        "20250",
        "20258",
        "11295",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-442-9",
      "hadith_no": "442",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا عبد الله بن يزيد المقرئ، حدثنا سعيد، - يعني ابن أبي أيوب - حدثنا كعب بن علقمة، عن بلال بن عبد الله بن عمر، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تمنعوا النساء حظوظهن من المساجد إذا استأذنوكم ‏\"‏ فقال بلال والله لنمنعهن ‏.‏ فقال له عبد الله أقول قال رسول الله صلى الله عليه وسلم وتقول أنت لنمنعهن ‏.‏",
      "text_en": " Ibn Umar reported:                      The Messenger of Allah (may peace be upon him) said: Do not deprive women of their share of the mosques, when they seek permission from you. Bilal said: By Allah, we would certainly prevent them. 'Abdullah said: I say that the Messenger of Allah (may peace be upon him) said it and you say: We would certainly prevent them!",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "23033",
        "20375",
        "10872",
        "11816",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-455-2",
      "hadith_no": "455",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "وحدثنا هارون بن عبد الله، حدثنا حجاج بن محمد، عن ابن جريج، ح قال وحدثني محمد بن رافع، - وتقاربا في اللفظ - حدثنا عبد الرزاق، أخبرنا ابن جريج، قال سمعت محمد بن عباد بن جعفر، يقول أخبرني أبو سلمة بن سفيان، وعبد الله بن عمرو بن العاص، وعبد الله بن المسيب العابدي، عن عبد الله بن السائب، قال صلى لنا النبي صلى الله عليه وسلم الصبح بمكة فاستفتح سورة المؤمنين حتى جاء ذكر موسى وهارون أو ذكر عيسى - محمد بن عباد يشك أو اختلفوا عليه - أخذت النبي صلى الله عليه وسلم سعلة فركع وعبد الله بن السائب حاضر ذلك ‏.‏ وفي حديث عبد الرزاق فحذف فركع ‏.‏ وفي حديثه وعبد الله بن عمرو ‏.‏ ولم يقل ابن العاص ‏.‏",
      "text_en": " Abdullah b. Sa'id reported:                      The Apostle of Allah (may peace be upon him) led us in the morning prayer in Mecca and began Sarat al-Mu'minin (xxiii ) but when he came to the mention of Moses and Aaron (verse. 45) or to the mention of Jesus (verse 50), a cough got the better of him, and he bowed. 'Abdullah b. Sa'ib was present there, and in the hadith narrated by Abd al-Razzaq (the words are): He cut short (the recitation) and bowed.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20381",
        "11070",
        "30375",
        "20121",
        "11070",
        "11262",
        "29"
      ]
    },
    {
      "id": "sahih-muslim-480-6",
      "hadith_no": "480",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن نافع، ح وحدثني عيسى بن حماد المصري، أخبرنا الليث، عن يزيد بن أبي حبيب، ح قال وحدثني هارون بن عبد الله، حدثنا ابن أبي فديك، حدثنا الضحاك بن عثمان، ح قال وحدثنا المقدمي، حدثنا يحيى، - وهو القطان - عن ابن عجلان، ح وحدثني هارون بن سعيد الأيلي، حدثنا ابن وهب، حدثني أسامة بن زيد، ح قال وحدثنا يحيى بن أيوب، وقتيبة، وابن، حجر قالوا حدثنا إسماعيل، - يعنون ابن جعفر - أخبرني محمد، وهو ابن عمرو ح قال وحدثني هناد بن السري، حدثنا عبدة، عن محمد بن إسحاق، كل هؤلاء عن إبراهيم بن عبد الله بن حنين، عن أبيه، عن علي، - إلا الضحاك وابن عجلان فإنهما زادا عن ابن عباس، عن علي، - عن النبي صلى الله عليه وسلم كلهم قالوا نهاني عن قراءة القرآن وأنا راكع ولم يذكروا في روايتهم النهى عنها في السجود كما ذكر الزهري وزيد بن أسلم والوليد بن كثير وداود بن قيس ‏.‏",
      "text_en": " This hadith has been narrated by some other narrators, Ibn 'Abbas and others, and they all reported that 'Ali said:                      The Apostle of Allah (may peace be upon him) forbade me to recite the Qur'an while I am in a state of bowing and prostration, and in their narration (there is a mention of) forbiddance from that (recital) in the state of prostration as it has been transmitted by Zuhri, Zaid b. Aslam, al-Wahid b. Kathir, and Dawud b. Qais.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "11014",
        "20023",
        "11411",
        "30524",
        "20172",
        "20504",
        "20031",
        "10616",
        "30492"
      ]
    },
    {
      "id": "sahih-muslim-506-2",
      "hadith_no": "506",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثني هارون بن عبد الله، ومحمد بن رافع، قالا حدثنا محمد بن إسماعيل بن أبي فديك، عن الضحاك بن عثمان، عن صدقة بن يسار، عن عبد الله بن عمر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا كان أحدكم يصلي فلا يدع أحدا يمر بين يديه فإن أبى فليقاتله فإن معه القرين ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. 'Umar reported that the Messenger of Allah (may peace be upon him) said:                      When any one of you prays, he should not allow anyone to pass before him, and if he refuses, he should be then forcibly resisted, for there is a devil with him.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "30375",
        "20172",
        "20504",
        "10641",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-1273",
      "hadith_no": "1273",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا محمد بن إسحاق المسيبي، حدثني أنس، - يعني ابن عياض - عن موسى بن عقبة، ح وحدثنا هارون بن عبد الله، حدثنا حماد بن مسعدة، عن ابن جريج، ح قال وحدثنا الصلت بن مسعود، حدثنا سفيان بن موسى، عن أيوب، كلهم عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم بنحوه ‏.‏",
      "text_en": " A hadith like this has been narrated from the Apostle of Allah (may peace be upon him) on the authority of Ibn 'Umar with another chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30413",
        "20157",
        "11106",
        "30524",
        "20224",
        "11070",
        "30435",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-1477",
      "hadith_no": "1477",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثني إسحاق بن إبراهيم، ومحمد بن حاتم، كلاهما عن محمد بن بكر، ح قال وحدثني هارون بن عبد الله، حدثنا حجاج بن محمد، ح قال وحدثني حجاج بن الشاعر، ومحمد بن رافع، قالا حدثنا عبد الرزاق، - وألفاظهم متقاربة - قالوا جميعا عن ابن جريج، قال أخبرني المغيرة بن حكيم، عن أم كلثوم بنت أبي بكر، أنها أخبرته عن عائشة، قالت أعتم النبي صلى الله عليه وسلم ذات ليلة حتى ذهب عامة الليل وحتى نام أهل المسجد ثم خرج فصلى فقال ‏\"‏ إنه لوقتها لولا أن أشق على أمتي ‏\"‏ ‏.‏ وفي حديث عبد الرزاق ‏\"‏ لولا أن يشق على أمتي ‏\"‏ ‏.‏",
      "text_en": " 'A'isha reported:                      The Apostle of Allah (may peace be upon him) one night delayed (observing the 'Isya' prayer) till a great part of the night was over and the people in the mosque had gone to sleep. He (the Holy Prophet) then came out and observed prayer and said: This is the proper time for it; were it not that I would impose a burden on my people (I would normally pray at this time). In the hadith transmitters by 'Abd al-Razzaq (the words are):\" Were it not that it would impose burden on my people.\"",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "38487",
        "20277",
        "30524",
        "20381",
        "38834",
        "30375",
        "11070",
        "10966",
        "10500"
      ]
    },
    {
      "id": "sahih-muslim-1508",
      "hadith_no": "1508",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثني هارون بن عبد الله، ومحمد بن حاتم، قالا حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني عمر بن عطاء بن أبي الخوار، أنه بينا هو جالس مع نافع بن جبير بن مطعم إذ مر بهم أبو عبد الله ختن زيد بن زبان مولى الجهنيين فدعاه نافع فقال سمعت أبا هريرة يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ صلاة مع الإمام أفضل من خمس وعشرين صلاة يصليها وحده ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      The Messenger of Allah (way peace be upon him) said: Prayer along with the Imam is twenty-five times more excellent than prayer said by a single person.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "38487",
        "20381",
        "11070",
        "10654",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-1708",
      "hadith_no": "1708",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني هارون بن عبد الله، ومحمد بن رافع، قالا حدثنا ابن أبي فديك، عن الضحاك بن عثمان، عن إبراهيم بن عبد الله بن حنين، عن أبي مرة، مولى أم هانئ عن أبي الدرداء، قال أوصاني حبيبي صلى الله عليه وسلم بثلاث لن أدعهن ما عشت بصيام ثلاثة أيام من كل شهر وصلاة الضحى وبأن لا أنام حتى أوتر ‏.‏",
      "text_en": " Abu Murra, the freed slave of Umm Hani, narrated on the authority of Abu Darda':                      My Friend (may peace be upon him) instructed me in three (acts), and I would never abandon them as long as I live. (And these three things are): Three fasts during every month, the forenoon prayer, and this that I should not sleep till I have observed the Witr prayer.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "30375",
        "20172",
        "20504",
        "11150",
        "11237",
        "37"
      ]
    },
    {
      "id": "sahih-muslim-1744",
      "hadith_no": "1744",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني محمد بن حاتم، وهارون بن عبد الله، قالا حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني عثمان بن أبي سليمان، أن أبا سلمة بن عبد الرحمن، أخبره أن عائشة أخبرته أن النبي صلى الله عليه وسلم لم يمت حتى كان كثير من صلاته وهو جالس ‏.‏",
      "text_en": " 'A'isha reported:                      When the Messenger of Allah (may peace be upon him) grew bulky and heavy he would observe (most of his Nafl) prayers sitting.",
      "usc_msa_ref": "",
      "chain": [
        "38487",
        "30524",
        "20381",
        "11070",
        "10649",
        "10567",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-1792",
      "hadith_no": "1792",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني هارون بن عبد الله، حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني نافع، أن ابن عمر، كان يقول من صلى من الليل فليجعل آخر صلاته وترا قبل الصبح كذلك كان رسول الله صلى الله عليه وسلم يأمرهم ‏.‏",
      "text_en": " Ibn 'Umar reported Allah's Messenger (way peace be upon him) as saying:                      Witr is a rak'ah at the end of the prayer.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20381",
        "11070",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-1796",
      "hadith_no": "1796",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا أبو كريب، وهارون بن عبد الله، قالا حدثنا أبو أسامة، عن الوليد بن كثير، قال حدثني عبيد الله بن عبد الله بن عمر، أن ابن عمر، حدثهم أن رجلا نادى رسول الله صلى الله عليه وسلم وهو في المسجد فقال يا رسول الله كيف أوتر صلاة الليل فقال رسول الله صلى الله عليه وسلم ‏\"‏ من صلى فليصل مثنى مثنى فإن أحس أن يصبح سجد سجدة فأوترت له ما صلى ‏\"‏ ‏.‏ قال أبو كريب عبيد الله بن عبد الله ‏.‏ ولم يقل ابن عمر ‏.‏",
      "text_en": " Anas b. Sirin reported:                      I asked Ibn 'Umar to tell me about the practice of the Holy Prophet (may peace be upon him) in regard to two rak'ahs before the dawn prayer: Should I make lengthy recitation in them? He said: The Messenger of Allah (may peace be upon him) used to observe, the night prayer in pairs and then made the number odd by observing one rak'ah. I said: I am not asking you about it. He said: You are a bulky man, will you not show me the patience to narrate to you the hadith completely? The Messenger of Allah (may peace be upon him) used to observe the night prayer in pairs and then made the number odd by observing one rak'ah, and then he observed two rak'ahs before dawn quite close to the call for prayer (Khalaf said:\" Did you see [yourself the Holy Prophet observing] the two rak'ahs before the dawn?\" and he made no mention of prayer.)",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "30524",
        "20318",
        "11230",
        "11817"
      ]
    },
    {
      "id": "sahih-muslim-1837",
      "hadith_no": "1837",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني هارون بن عبد الله، ومحمد بن رافع، قالا حدثنا وهب بن جرير، أخبرني أبي قال، سمعت قيس بن سعد، يحدث عن عطاء، عن ابن عباس، قال بعثني العباس إلى النبي صلى الله عليه وسلم وهو في بيت خالتي ميمونة فبت معه تلك الليلة فقام يصلي من الليل فقمت عن يساره فتناولني من خلف ظهره فجعلني على يمينه ‏.‏",
      "text_en": " Ibn 'Abbas reported:                      I spent a night in the house of my mother's sister Maimuna, and the rest of the hadith is the same as narrated above.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "30375",
        "20298",
        "11272",
        "172",
        "11029",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-1999",
      "hadith_no": "1999",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "وحدثناه إسحاق بن إبراهيم، أخبرنا محمد بن بكر، ح وحدثنا هارون بن عبد، الله حدثنا الضحاك بن مخلد، كلاهما عن ابن جريج، بهذا الإسناد ‏.‏",
      "text_en": " This hadith has been narrated by Ibn Juraij with the came chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20277",
        "30524",
        "20241"
      ]
    },
    {
      "id": "sahih-muslim-2080",
      "hadith_no": "2080",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "وحدثنا هارون بن عبد الله، حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني عمر بن عطاء، أن نافع بن جبير، أرسله إلى السائب بن يزيد ابن أخت نمر ‏.‏ وساق الحديث بمثله غير أنه قال فلما سلم قمت في مقامي ولم يذكر الإمام ‏.‏",
      "text_en": " The same hadith is narrated on the authority of 'Umar b. Ata' but with this modification:                      When he (the Imam) pronounced salutation I stood up at my place. No mention was made of the Imam in it.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20381",
        "11070",
        "13541",
        "11059"
      ]
    },
    {
      "id": "sahih-muslim-2228",
      "hadith_no": "2228",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "حدثنا هارون بن عبد الله، وحجاج بن الشاعر، قالا حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني أبو الزبير، أنه سمع جابر بن عبد الله، يحدث أن النبي صلى الله عليه وسلم خطب يوما فذكر رجلا من أصحابه قبض فكفن في كفن غير طائل وقبر ليلا فزجر النبي صلى الله عليه وسلم أن يقبر الرجل بالليل حتى يصلى عليه إلا أن يضطر إنسان إلى ذلك وقال النبي صلى الله عليه وسلم ‏\"‏ إذا كفن أحدكم أخاه فليحسن كفنه ‏\"‏ ‏.‏",
      "text_en": " Jabir b. 'Abdullah reported:                      Allah's Messenger (may peace be upon him) one day in the course of his sermon made mention of a person among his Companions who had died and had been wrapped in a shroud not long (enough to cover his whole body) and was buried during the night. The Apostle of Allah (may peace be upon him) reprimanded (the audience) that a person was buried during the night (in a state that) funeral prayer could not be offered (over him by the Messenger of Allah). (And this is permissible only) when it becomes a dire necessity for a man. The Apostle of Allah (may peace be upon him) also said: When any one of you shrouds his brother, he should shroud him well.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "38834",
        "20381",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "id": "sahih-muslim-2290",
      "hadith_no": "2290",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثني هارون بن عبد الله، حدثنا حجاج بن محمد، ح وحدثني محمد بن رافع، حدثنا عبد الرزاق، جميعا عن ابن جريج، قال أخبرني أبو الزبير، أنه سمع جابر بن عبد، الله يقول سمعت النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " A hadith like this has been transmitted on the authority of Jabir b. 'Abdullah.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20381",
        "30375",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "id": "sahih-muslim-2298",
      "hadith_no": "2298",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثني هارون بن عبد الله، ومحمد بن رافع، - واللفظ لابن رافع - قالا حدثنا ابن أبي فديك، أخبرنا الضحاك، - يعني ابن عثمان - عن أبي النضر، عن أبي سلمة بن، عبد الرحمن أن عائشة، لما توفي سعد بن أبي وقاص قالت ادخلوا به المسجد حتى أصلي عليه ‏.‏ فأنكر ذلك عليها فقالت والله لقد صلى رسول الله صلى الله عليه وسلم على ابنى بيضاء في المسجد سهيل وأخيه ‏.‏ قال مسلم سهيل بن دعد وهو ابن البيضاء أمه بيضاء ‏.‏",
      "text_en": " Abu Salama b. 'Abd al-Rahman reported on the authority ot 'A'isha that when Sa'd b. Abu Waqqas died she said:                      Bring it (the bier) into the mosque so that I offer prayer for him. But, this act of hers was disapproved. She said: By Allah, the Messenger of Allah (may peace be upon him) offered prayer in the mosque for the two sons of Baida', viz, for Suhail and his brother.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "30375",
        "20172",
        "20504",
        "11164",
        "10567"
      ]
    },
    {
      "id": "sahih-muslim-2425",
      "hadith_no": "2425",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثني محمد بن حاتم، وهارون بن عبد الله، قالا حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني ابن أبي مليكة، أن عباد بن عبد الله بن الزبير، أخبره عن أسماء، بنت أبي بكر أنها جاءت النبي صلى الله عليه وسلم فقالت يا نبي الله ليس لي شىء إلا ما أدخل على الزبير فهل على جناح أن أرضخ مما يدخل على فقال ‏\"‏ ارضخي ما استطعت ولا توعي فيوعي الله عليك ‏\"‏ ‏.‏",
      "text_en": " Asma', daughter of Abu Bakr, reported that abe came to the Apostle of Allah (may peace he upon him) and said:                      Apostle of Allah, I have nothing with me, but only, that which is given to me by Zubair (for household expenses). Is there any sin for me if I spend out of that which is given to me (by Zabair)? Upon this he (the Holy Prophet) said: Spend according to your means; and do not hoard, for Allah will withhold from you.",
      "usc_msa_ref": "",
      "chain": [
        "38487",
        "30524",
        "20381",
        "11070",
        "11090",
        "11250",
        "70"
      ]
    },
    {
      "id": "sahih-muslim-2465",
      "hadith_no": "2465",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثني زهير بن حرب، وهارون بن عبد الله، قالا حدثنا حجاج بن محمد، عن ابن جريج، قال سمعت عطاء، يقول سمعت ابن عباس، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لو أن لابن آدم ملء واد مالا لأحب أن يكون إليه مثله ولا يملأ نفس ابن آدم إلا التراب والله يتوب على من تاب ‏\"‏ ‏.‏ قال ابن عباس فلا أدري أمن القرآن هو أم لا ‏.‏ وفي رواية زهير قال فلا أدري أمن القرآن ‏.‏ لم يذكر ابن عباس ‏.‏",
      "text_en": " Ibn Abbas reported Allah's Messenger (may peace be upon him) as saying:                      If there were for the son of Adam a valley full of riches, he would long to possess another one like it. and Ibn Adam does not feel satiated but with dust. 1413 And Allah returns to him who returns (to HiM). 1414 Ibn Abbas said: I do not know whether it is from the Qur'an or not; and in the narration transmitted by Zuhair it was said: I do not know whether it is from the Qur'an, and he made no mention of Ibn Abbas.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "30524",
        "20381",
        "11070",
        "11029",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-2558",
      "hadith_no": "2558",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا روح بن عبادة، حدثنا زكرياء بن إسحاق، حدثنا عمرو بن دينار، أنه سمع ابن عمر، - رضى الله عنهما - يقول سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ الشهر هكذا وهكذا وهكذا ‏\"‏ ‏.‏ وقبض إبهامه في الثالثة ‏.‏",
      "text_en": " Ibn Umar (Allah be pleased with both of them) reported Allah's Messenger (may peace be upon him) as saying:                      The month is thus and thus and thus (i. e. pointing with his fingers thrice), and he held back his thumb at the third time (in order to show that it can also consist of twenty-nine days).",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20229",
        "11244",
        "11081",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-2574",
      "hadith_no": "2574",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثني هارون بن عبد الله، وحجاج بن الشاعر، قالا حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني أبو الزبير، أنه سمع جابر بن عبد الله، - رضى الله عنهما - يقول اعتزل النبي صلى الله عليه وسلم نساءه شهرا فخرج إلينا صباح تسع وعشرين فقال بعض القوم يا رسول الله إنما أصبحنا لتسع وعشرين ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ إن الشهر يكون تسعا وعشرين ‏\"‏ ‏.‏ ثم طبق النبي صلى الله عليه وسلم بيديه ثلاثا مرتين بأصابع يديه كلها والثالثة بتسع منها ‏.‏",
      "text_en": " Abu Zubair is reported to have heard Jabir b. 'Abdullah (Allah be pleased with both of them) as saying:                      The Apostle of Allah (may peace be upon him) separated himself from his wives for a month. (His wives said: ) He came to us on the morning of the twenty-ninth. Upon this some, of the people said: It is the morning of twenty- ninth (according to our calculation). Upon this the Apostle of Allah (may peace be upon him) said: The month. may also consist of twenty-nine days. The Apostle of Allah (may peace be upon him) then flapped his bands thrice, twice with all the fingers of both his hand (to indicate twenty-nine) and by the third time with nine (fingers).",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "38834",
        "20381",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "id": "sahih-muslim-2575",
      "hadith_no": "2575",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثني هارون بن عبد الله، حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني يحيى بن عبد الله بن محمد بن صيفي، أن عكرمة بن عبد الرحمن بن الحارث، أخبره أن أم سلمة - رضى الله عنها - أخبرته أن النبي صلى الله عليه وسلم حلف أن لا يدخل على بعض أهله شهرا فلما مضى تسعة وعشرون يوما غدا عليهم - أو راح - فقيل له حلفت يا نبي الله أن لا تدخل علينا شهرا ‏.‏ قال ‏\"‏ إن الشهر يكون تسعة وعشرين يوما ‏\"‏ ‏.‏",
      "text_en": " Umm Salama (Allah be pleased with him) reported that the Apostle of Allah (may peace be upon him) took an oath that he would not go to some of his wives for the whole of the month. When twenty-nine days bad passed he (the Holy Prophet) went to them in the morning or in the evening. Upon this it was said to him:                      Apostle of Allah, you took an oath that you would not come to us for a month, whereupon he said: The month may also consist of twenty-nine days.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20381",
        "11070",
        "11448",
        "56"
      ]
    },
    {
      "id": "sahih-muslim-2878",
      "hadith_no": "2878",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني هارون بن عبد الله، حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني صالح بن كيسان، عن نافع، عن ابن عمر، - رضى الله عنهما - أنه كان يخبر أن النبي صلى الله عليه وسلم أهل حين استوت به ناقته قائمة ‏.‏",
      "text_en": " Ibn 'Umar (Allah be pleased with them) reported that the Apostle of Allah (may peace be upon him) pronounced Talbiya as his camel stood up.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20381",
        "11070",
        "11176",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-2930",
      "hadith_no": "2930",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا هارون بن عبد الله، حدثنا محمد بن بكر، حدثنا ابن جريج، قال قلت لنافع ماذا سمعت ابن عمر، يحل للحرام قتله من الدواب فقال لي نافع قال عبد الله سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ خمس من الدواب لا جناح على من قتلهن في قتلهن الغراب والحدأة والعقرب والفارة والكلب العقور ‏\"‏ ‏.‏",
      "text_en": " Ibn Juraij reported:                      I said to Nafi: What is that which you heard Ibn, Umar declaring permissible for a Mubrim to kill some of the beasts? Nafi, said to me that 'Abdullah had reported: I heard Allah's Messenger (may peace be upon him) as saying: Five are the beasts in killing which or their being killed, there is no sin: crow, kite, scorpion, rat and voracious dog.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20277",
        "11070",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-2958",
      "hadith_no": "2958",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا الأسود بن عامر، عن زهير، عن أبي الزبير، قال سمعت سعيد بن جبير، يقول قال ابن عباس - رضى الله عنهما - وقصت رجلا راحلته وهو مع رسول الله صلى الله عليه وسلم فأمرهم رسول الله صلى الله عليه وسلم أن يغسلوه بماء وسدر وأن يكشفوا وجهه - حسبته قال - ورأسه فإنه يبعث يوم القيامة وهو يهل ‏.‏",
      "text_en": " Sa'id b. Jubair reported on the authority of Ibn 'Abbas (Allah be pleased with them) that the camel of a person broke his neck as he was in the company of Allah's Messenger (may peace be upon him). The Messenger of Allah, (way peace be upon him) commanded them (Companions) to wash him with water mixed (with the leaves of) the lote (tree) and to keep his face exposed; (he, the narrator) said:                      And his head (too), for he would be raised on the Day of Resurrection pronouncing Talbiya.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20380",
        "20321",
        "11263",
        "11050",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-2964",
      "hadith_no": "2964",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا أبو داود الطيالسي، حدثنا حبيب بن يزيد، عن عمرو بن هرم، عن سعيد بن جبير، وعكرمة، عن ابن عباس، رضى الله عنهما أن ضباعة، أرادت الحج فأمرها النبي صلى الله عليه وسلم أن تشترط ففعلت ذلك عن أمر رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Ibn Abbas (Allah be pleased with him) reported that Duba'a intended to perform Hajj. and the Apostle of Allah (may peace be upon him) commanded her (to enter into the state of Ihram) with condition. She did it in compliance with the com- mand of Allah's Apostle (may peace be upon him).",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20547",
        "20534",
        "10708",
        "11050",
        "11023",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-3071",
      "hadith_no": "3071",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا هارون بن عبد الله، حدثنا محمد بن الفضل السدوسي، حدثنا وهيب، أخبرنا أيوب، عن أبي العالية البراء، عن ابن عباس، - رضى الله عنهما - قال قدم النبي صلى الله عليه وسلم وأصحابه لأربع خلون من العشر وهم يلبون بالحج فأمرهم أن يجعلوها عمرة ‏.‏",
      "text_en": " Ibn 'Abbas (Allah be pleased with them) reported:                      Allah's Messenger (may peace be upon him) came along with his Companions when four days had passed out of ten days (of Dhu'l-Hijja) and they were pronouncing Talbiya for Hajj, and he (the Holy Prophet) commanded them to change (this Ihram) into that of 'Umra.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20283",
        "20299",
        "11015",
        "11618",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-3095",
      "hadith_no": "3095",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا هارون بن عبد الله، أخبرنا محمد بن بكر البرساني، أخبرنا ابن جريج، قال سمعت عطاء، يخبر قال أخبرني عروة بن الزبير، قال كنت أنا وابن، عمر مستندين إلى حجرة عائشة وإنا لنسمع ضربها بالسواك تستن - قال - فقلت يا أبا عبد الرحمن أعتمر النبي صلى الله عليه وسلم في رجب قال نعم ‏.‏ فقلت لعائشة أى أمتاه ألا تسمعين ما يقول أبو عبد الرحمن قالت وما يقول قلت يقول اعتمر النبي صلى الله عليه وسلم في رجب ‏.‏ فقالت يغفر الله لأبي عبد الرحمن لعمري ما اعتمر في رجب وما اعتمر من عمرة إلا وإنه لمعه ‏.‏ قال وابن عمر يسمع فما قال لا ولا نعم ‏.‏ سكت ‏.‏",
      "text_en": " 'Ataa reported that 'Urwa b. Zubair (Allah be pleased with him) had informed him (this):                      I and Ibn 'Umar were reclining against the (wall) of the apartment of A'isha and we were listening to the sound produced by the brushing of her teeth. I said Abu Abd al-Rahman (the kunya of 'Abdullah b. Umar), did Allah's Apostle (may peace be upon him) perform 'Umra in the month of Rijab? He said: Yes. I said to 'A'isha: Mother, are you listening to what Abu Abd al-Rabman is saying? She said: What is he Saying? I said: He is saying that Allah's Apostle (may peace be upon him) performed 'Umra during the month of Rajab, whereupon she said: May Allah grant pardon to Abu Abd al-Rahman I By my life he (the Holy Prophet) did not perform 'Umra during the month of Rajab. And never was there an Umra performed by him (the Holy Prophet) in which he ('Abdullah b. 'Umar) did not join him. Ibn 'Umar heard this and said nothing to affirm It or to deny it, but kept quiet.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20277",
        "11070",
        "10511"
      ]
    },
    {
      "id": "sahih-muslim-3156",
      "hadith_no": "3156",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني محمد بن حاتم، وهارون بن عبد الله، ويعقوب الدورقي، قالوا أخبرنا يزيد بن هارون، أخبرنا عبد العزيز بن أبي سلمة، عن عمر بن حسين، عن عبد الله بن، أبي سلمة عن عبد الله بن عبد الله بن عمر، عن أبيه، قال كنا مع رسول الله صلى الله عليه وسلم في غداة عرفة فمنا المكبر ومنا المهلل فأما نحن فنكبر قال قلت والله لعجبا منكم كيف لم تقولوا له ماذا رأيت رسول الله صلى الله عليه وسلم يصنع.",
      "text_en": " Abdullah b. 'Umar reported on the authority of his father (Allah be pleased with them):                      We were along with Allah's Messenger (way peace he upon him) in the morning of 'Arafa (9th of Dhu'l-Hijja). Some of us pronounced Takbir and some of us Tahlil La ilaha ill-Allah). And to those of us who pronounced Takbir, I said: By Allah, how strange it is that you did not care to ask him: What did you see Allah's Messenger (may peace be upon him) doing (on this occasion)?",
      "usc_msa_ref": "",
      "chain": [
        "38487",
        "30524",
        "30400",
        "20472",
        "32017",
        "10929",
        "11814",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-3339",
      "hadith_no": "3339",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثني هارون بن عبد الله، حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني أبو الزبير، أن عليا الأزدي، أخبره أن ابن عمر علمهم أن رسول الله صلى الله عليه وسلم كان إذا استوى على بعيره خارجا إلى سفر كبر ثلاثا ثم قال ‏\"‏ سبحان الذي سخر لنا هذا وما كنا له مقرنين وإنا إلى ربنا لمنقلبون اللهم إنا نسألك في سفرنا هذا البر والتقوى ومن العمل ما ترضى اللهم هون علينا سفرنا هذا واطو عنا بعده اللهم أنت الصاحب في السفر والخليفة في الأهل اللهم إني أعوذ بك من وعثاء السفر وكآبة المنظر وسوء المنقلب في المال والأهل ‏\"‏ ‏.‏ وإذا رجع قالهن ‏.‏ وزاد فيهن ‏\"‏ آيبون تائبون عابدون لربنا حامدون ‏\"‏ ‏.‏",
      "text_en": " Ibn Umar (Allah be pleased with them) reported that whenever Allah's Messenger (may peace be upon him) mounted his camel while setting out on a journey, he glorified Allah (uttered Allah-o-Akbar) thrice, and then said:                      Hallowed is He Who subdued for us this (ride) and we were not ourselves powerful enough to use It as a ride, and we are going to return to our Lord. O Allah, we seek virtue and piety from Thee in this journey of ours and the act which pleaseth Thee. O Allah, lighten this journey of ours, and make its distance easy for us. O Allah, Thou art (our) companion during the journey, and guardian of (our) family. O Allah, I seek refuge with Thee from hardships of the journey, gloominess of the sights, and finding of evil changes in property and family on return. And he (the Holy Prophet) uttered (these words), and made this addition to them: We are returning, repentant, worshipping our Lord. and praising Him.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20381",
        "11070",
        "11263"
      ]
    },
    {
      "id": "sahih-muslim-3536",
      "hadith_no": "3536",
      "source": "Sahih Muslim",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثني هارون بن عبد الله، حدثنا حجاج بن محمد، قال قال ابن جريج ح وحدثناه إسحاق بن إبراهيم، ومحمد بن رافع، عن عبد الرزاق، أخبرنا ابن جريج، أخبرني أبو الزبير، أنه سمع جابر بن عبد الله، يقول نهى رسول الله صلى الله عليه وسلم عن الشغار ‏.‏",
      "text_en": " Jabir b. Abdullah (Allah be pleased with him) reported that Allah's Messenger (may peace be upon him) prohibited Shighar.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20381",
        "11070",
        "30123",
        "30375",
        "20121",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "id": "sahih-muslim-3559",
      "hadith_no": "3559",
      "source": "Sahih Muslim",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثناه محمد بن المثنى، حدثنا أبو داود، ح وحدثنا محمد بن رافع، وهارون، بن عبد الله قالا حدثنا وهب بن جرير، ح وحدثنا أحمد بن خراش، حدثنا شبابة، كلهم عن شعبة، عن حميد، بهذا الإسناد غير أن في، حديث وهب قال قال عبد الرحمن تزوجت امرأة ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Humaid with the same chain of transmitters except (with this minor alteration of words) that 'Abd al-Rahman said:                     \" I married a woman.\"",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "30002",
        "30375",
        "30524",
        "20298",
        "20020"
      ]
    },
    {
      "id": "sahih-muslim-3589",
      "hadith_no": "3589",
      "source": "Sahih Muslim",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثني هارون بن عبد الله، حدثنا حجاج بن محمد، عن ابن جريج، أخبرني موسى بن عقبة، عن نافع، قال سمعت عبد الله بن عمر، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ أجيبوا هذه الدعوة إذا دعيتم لها ‏\"‏ ‏.‏ قال وكان عبد الله بن عمر يأتي الدعوة في العرس وغير العرس ويأتيها وهو صائم ‏.‏",
      "text_en": " Nafil reported:                      I heard Abdullah b. Umar (Allah be pleased with them) narrating that Allah's Messenger (may peace be upon him) said: Accept the feast when you are invited to it. And Abdullah (b. Umar) used to come to the feast, whether it was a wedding feast or other than that, and he would come there even in the state of fasting.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20381",
        "11070",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-3743",
      "hadith_no": "3743",
      "source": "Sahih Muslim",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "وحدثني هارون بن عبد الله، حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني أبو الزبير، أنه سمع عبد الرحمن بن أيمن، مولى عزة يسأل ابن عمر وأبو الزبير يسمع ذلك كيف ترى في رجل طلق امرأته حائضا فقال طلق ابن عمر امرأته وهى حائض على عهد رسول الله صلى الله عليه وسلم فسأل عمر رسول الله صلى الله عليه وسلم فقال إن عبد الله بن عمر طلق امرأته وهى حائض ‏.‏ فقال له النبي صلى الله عليه وسلم ‏\"‏ ليراجعها ‏\"‏ ‏.‏ فردها وقال ‏\"‏ إذا طهرت فليطلق أو ليمسك ‏\"‏ ‏.‏ قال ابن عمر وقرأ النبي صلى الله عليه وسلم يا أيها النبي إذا طلقتم النساء فطلقوهن في قبل عدتهن ‏.‏",
      "text_en": " Abu Zubair reported that he heard 'Abd al-Rahman b. Aiman (the freed slave of 'Azza) say that he asked Ibn 'Umar (Allah be pleased with them) and Abu Zubair heard:                      What is your opinion about the person who divorced his wife in the state of menses? Thereupon he said: Ibn Umar (Allah be pleased with them) divorced his wife during the lifetime of Allah's Messenger (may peace be upon him) while she was in the state of menses. Upon this Allah's Messenger (may peace be upon him) told him to take her back and so he took her back and he (further) said: When she is pure, then either divorce her or retain her. Ibn 'Umar (Allah be pleased with them) said that Allah's Apostle (may peace be upon him) then recited this verse:\" O Apostle, when you divorce women, divorce them at the commencement of their prescribed period\" (Ixv 1).",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20381",
        "11070",
        "11263"
      ]
    },
    {
      "id": "sahih-muslim-3744",
      "hadith_no": "3744",
      "source": "Sahih Muslim",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "وحدثني هارون بن عبد الله، حدثنا أبو عاصم، عن ابن جريج، عن أبي الزبير، عن ابن عمر، ‏.‏ نحو هذه القصة ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20241",
        "11070",
        "11263"
      ]
    },
    {
      "id": "sahih-muslim-3848",
      "hadith_no": "3848",
      "source": "Sahih Muslim",
      "chapter": "The Book of Emancipating Slaves - كتاب العتق",
      "chapter_no": "21",
      "text_ar": "حدثني هارون بن عبد الله، حدثنا وهب بن جرير، حدثنا أبي قال، سمعت قتادة، يحدث بهذا الإسناد بمعنى حديث ابن أبي عروبة وذكر في الحديث قوم عليه قيمة عدل.",
      "text_en": " A hadith like this is reported on the authority of the same chain of transmitters but with a slight change of words.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20298",
        "11272",
        "11019"
      ]
    },
    {
      "id": "sahih-muslim-3977",
      "hadith_no": "3977",
      "source": "Sahih Muslim",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "حدثني يحيى بن معين، وهارون بن عبد الله، وحسين بن عيسى، قالوا حدثنا أبو أسامة، حدثنا عبيد الله، عن نافع، عن ابن عمر، قال نهى رسول الله صلى الله عليه وسلم عن المزابنة والمزابنة بيع ثمر النخل بالتمر كيلا وبيع الزبيب بالعنب كيلا وعن كل ثمر بخرصه ‏.‏",
      "text_en": " Ibn 'Umar (Allah be pleased with them) reported Allah's Messenger (may peace be upon him) having forbidden Muzabana, and Muzabana is the selling of dry dates by measure for fresh dates and the selling of raisins by measure for grapes and selling of all Ports of fruits on the basis of calculation.",
      "usc_msa_ref": "",
      "chain": [
        "30020",
        "30524",
        "30326",
        "20318",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-4447",
      "hadith_no": "4447",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Oath; for Establishing the Responsibility of Murders; Fighting; Requital - كتاب القسامة والمحاربين والقصاص والديات",
      "chapter_no": "29",
      "text_ar": "وحدثنا هارون بن عبد الله، حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن أيوب، عن أبي رجاء، مولى أبي قلابة قال قال أبو قلابة حدثنا أنس بن مالك، قال قدم على رسول الله صلى الله عليه وسلم قوم من عكل أو عرينة فاجتووا المدينة فأمر لهم رسول الله صلى الله عليه وسلم بلقاح وأمرهم أن يشربوا من أبوالها وألبانها ‏.‏ بمعنى حديث حجاج بن أبي عثمان ‏.‏ قال وسمرت أعينهم وألقوا في الحرة يستسقون فلا يسقون.",
      "text_en": " Anas b. Malik reported that some people of the tribe of 'Ukl or 'Uraina came to Allah's Messenger (may peace be upon him), and they found the climate of Medina uncogenial. Allah's Messenger (may peace be upon him) commanded them to the milch she-camels and commanded them to drink their urine and their milk. The rest of the hadith is the same (and the concluding words are):                     \" Their eyes were pierced, and they were thrown on the stony ground. They were asking for water, but they were not given water.\"",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20193",
        "20022",
        "11015",
        "11592",
        "11047",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-4450",
      "hadith_no": "4450",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Oath; for Establishing the Responsibility of Murders; Fighting; Requital - كتاب القسامة والمحاربين والقصاص والديات",
      "chapter_no": "29",
      "text_ar": "وحدثنا هارون بن عبد الله، حدثنا مالك بن إسماعيل، حدثنا زهير، حدثنا سماك، بن حرب عن معاوية بن قرة، عن أنس، قال أتى رسول الله صلى الله عليه وسلم نفر من عرينة فأسلموا وبايعوه وقد وقع بالمدينة الموم - وهو البرسام - ثم ذكر نحو حديثهم وزاد وعنده شباب من الأنصار قريب من عشرين فأرسلهم إليهم وبعث معهم قائفا يقتص أثرهم ‏.‏",
      "text_en": " Anas reported:                      There came to Allah's Messenger (may peace be upon him) some ponple from 'Uraina. They embraced Islam and swore allegiance to him and there had spread at that time pleurisy. The rest of the hadith is the same (but with this addition):\" There were by his (the Prophet's) side about twenty young men of the Ansar; he sent them (behind) them (culprits), and he also sent along with them one expert in following the track so that he might trace their footprints.\"",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20357",
        "20321",
        "10770",
        "11306",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-4538",
      "hadith_no": "4538",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Punishments Prescribed by Islam - كتاب الحدود",
      "chapter_no": "30",
      "text_ar": "وحدثني هارون بن عبد الله، حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني أبو الزبير، أنه سمع جابر بن عبد الله، يقول رجم النبي صلى الله عليه وسلم رجلا من أسلم ورجلا من اليهود وامرأته ‏.‏",
      "text_en": " Jabir b. 'Abdullah reported that Allah's Apostle (may peace be upon him) stoned (to death) a person from Banu Aslam, and a Jew and his wife.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20381",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "id": "sahih-muslim-4851",
      "hadith_no": "4851",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثني زهير بن حرب، وهارون بن عبد الله، قالا حدثنا حجاج بن محمد، قال قال ابن جريج نزل ‏{‏ يا أيها الذين آمنوا أطيعوا الله وأطيعوا الرسول وأولي الأمر منكم‏}‏ في عبد الله بن حذافة بن قيس بن عدي السهمي بعثه النبي صلى الله عليه وسلم في سرية ‏.‏ أخبرنيه يعلى بن مسلم عن سعيد بن جبير عن ابن عباس ‏.‏",
      "text_en": " It has been narrated on the authority of Ibn Juraij that the Qur'anic injunction:                     \" 0 you who believe, obey Allah, His Apostle and those in authority from amongst You\" (iv. 59) -was revealed in respect of 'Abdullah b. Hudhafa b. Qais b. Adi al-Sahmi who was despatched by the Holy Prophet (may peace be upon him) as leader of a military campaign. The narrator said: He was informed of this fact by Ya'la b. Muslim who was informed by Sa'id b. Jubair who in turn was informed by Ibn Abbas.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "30524",
        "20381"
      ]
    },
    {
      "id": "sahih-muslim-5024",
      "hadith_no": "5024",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا أبو بكر بن النضر بن أبي النضر، وهارون بن عبد الله، ومحمد بن رافع، وعبد بن حميد - وألفاظهم متقاربة - قالوا حدثنا هاشم بن القاسم، حدثنا سليمان، - وهو ابن المغيرة - عن ثابت، عن أنس بن مالك، قال بعث رسول الله صلى الله عليه وسلم بسيسة عينا ينظر ما صنعت عير أبي سفيان فجاء وما في البيت أحد غيري وغير رسول الله صلى الله عليه وسلم قال لا أدري ما استثنى بعض نسائه قال فحدثه الحديث قال فخرج رسول الله صلى الله عليه وسلم فتكلم فقال ‏\"‏ إن لنا طلبة فمن كان ظهره حاضرا فليركب معنا ‏\"‏ ‏.‏ فجعل رجال يستأذنونه في ظهرانهم في علو المدينة فقال ‏\"‏ لا إلا من كان ظهره حاضرا ‏\"‏ ‏.‏ فانطلق رسول الله صلى الله عليه وسلم وأصحابه حتى سبقوا المشركين إلى بدر وجاء المشركون فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا يقدمن أحد منكم إلى شىء حتى أكون أنا دونه ‏\"‏ ‏.‏ فدنا المشركون فقال رسول الله صلى الله عليه وسلم ‏\"‏ قوموا إلى جنة عرضها السموات والأرض ‏\"‏ ‏.‏ قال يقول عمير بن الحمام الأنصاري يا رسول الله جنة عرضها السموات والأرض قال ‏\"‏ نعم ‏\"‏ ‏.‏ قال بخ بخ ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ ما يحملك على قولك بخ بخ ‏\"‏ ‏.‏ قال لا والله يا رسول الله إلا رجاءة أن أكون من أهلها ‏.‏ قال ‏\"‏ فإنك من أهلها ‏\"‏ ‏.‏ فأخرج تمرات من قرنه فجعل يأكل منهن ثم قال لئن أنا حييت حتى آكل تمراتي هذه إنها لحياة طويلة - قال - فرمى بما كان معه من التمر ‏.‏ ثم قاتلهم حتى قتل ‏.‏",
      "text_en": " It has been reported on the authority of Anas b. Malik who said:                      The Messenger of Allah (may peace be upon him) sent Busaisah as a scout to see what the caravan of Abu Sufyan was doing. He came (back and met the Holy Prophet in his house) where there was nobody except myself and the Messenger of Allah. I do not remember whether he (Hadrat Anas) made an exception of some wives of the Holy Prophet (may peace be upon him) or not and told him the news of the caravan. (Having heard the news), the Messenger of Allah (may peace be upon him) came out (hurriedly), spoke to the people and said: We are in need (of men) ; whoever has an animal to ride upon ready with him should ride with us. People began to ask him permission for bringing their riding animals which were grazing on the hillocks near Medina. He said: No. (I want) only those who have their riding animals ready. So the Messenger of Allah (may peace be upon him) and his Companions proceeded towards Badr and reached there forestalling the polytheists (of Mecca). When the polytheists (also) reached there, the Messenger of Allah (may peace be upon him) said: None of you should step forward to (do) anything unless I am ahead of him. The polytheists (now) advanced (towards us), and the Messenger of Allah (may peace be upon him) said. Get up to enter Paradise which is equal in width to the heavens and the earth. 'Umair b. al- Humam al-Ansari said: Messenger of Allah, is Paradise equal in extent to the heavens and the earth? He said: Yes. 'Umair said: My goodness! The Messenger of Allah (may peace be upon him) asked him: What prompted you to utter these words (i. e. my goodness! ')? He said: Messenger of Allah, nothing but the desire that I be among its residents. He said: Thou art (surely) amona its residents. He took out dates from his bag and began to eat them. Then he said: If I were to live until I have eaten all these dates of mine, it would be a long life. (The narrator said): He threw away all the dates he had with him. Then he fought the enemies until he was killed.",
      "usc_msa_ref": "",
      "chain": [
        "30528",
        "30524",
        "30375",
        "20390",
        "20236",
        "11269",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-5063",
      "hadith_no": "5063",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثني هارون بن عبد الله، وحجاج بن الشاعر، قالا حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني أبو الزبير، أنه سمع جابر بن عبد الله، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا تزال طائفة من أمتي يقاتلون على الحق ظاهرين إلى يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Jabir b. 'Abdullah who said:                      I heard the Messenger of Allah (may peace be upon him) say: A group of people from my Umma will continue to fight In defence of truth and remain triumphant until the Day of judgment.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "38834",
        "20381",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "id": "sahih-muslim-5120",
      "hadith_no": "5120",
      "source": "Sahih Muslim",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثني هارون بن عبد الله، حدثنا محمد بن بكر، أخبرنا ابن جريج، أخبرني  نافع، قال قال ابن عمر ح",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20277",
        "11070",
        "11014"
      ]
    },
    {
      "id": "sahih-muslim-5143",
      "hadith_no": "5143",
      "source": "Sahih Muslim",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثناه أبو الربيع، وقتيبة، قالا حدثنا حماد، ح وحدثني زهير بن حرب، حدثنا  إسماعيل، كلاهما عن أيوب، ح وحدثنا ابن نمير، حدثنا أبي، حدثنا مالك بن مغول، ح وحدثني  هارون بن عبد الله، أخبرنا محمد بن بكر، أخبرنا ابن جريج، ح وحدثنا هارون بن عبد، الله حدثنا شجاع بن الوليد، قال سمعت موسى بن عقبة، ح وحدثنا هارون بن سعيد، الأيلي حدثنا ابن وهب، أخبرني أسامة، كلهم عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم في الضب بمعنى حديث الليث عن نافع غير أن حديث أيوب أتي رسول الله صلى الله عليه وسلم بضب فلم يأكله ولم يحرمه وفي حديث أسامة قال قام رجل في المسجد ورسول الله صلى الله عليه وسلم على المنبر ‏.‏",
      "text_en": " A hadith pertaining to the eating of the lizard is transmitted from the Holy Prophet (may peace be upon him) on the authority of Ibn 'Umar, but in this very hadith narrated through a different chain of transmitters there is a slight variation of wording (and the words are):                     \" A lizard was brought to Allah's Messenger (may peace be upon him) but he neither ate that nor declared it unlawful.\" And in the hadith transmitted through Usama (the words are):\" The man (inquirer) was standing in the mosque and Allah's Messenger (may peace be upon him) was sitting on the pulpit.\"",
      "usc_msa_ref": "",
      "chain": [
        "30137",
        "30367",
        "20022",
        "30022",
        "11015",
        "30212",
        "20331",
        "20358",
        "30524",
        "20277",
        "11070",
        "30524",
        "20328",
        "11106"
      ]
    },
    {
      "id": "sahih-muslim-5175",
      "hadith_no": "5175",
      "source": "Sahih Muslim",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "حدثني محمد بن حاتم، حدثنا يحيى بن سعيد، عن ابن جريج، ح وحدثنا عبد، بن حميد أخبرنا محمد بن بكر، أخبرنا ابن جريج، ح وحدثني هارون بن عبد الله، حدثنا  حجاج بن محمد، قال قال ابن جريج أخبرني أبو الزبير، أنه سمع جابر بن عبد الله، يقول نهى رسول الله صلى الله عليه وسلم أن يقتل شىء من الدواب صبرا ‏.‏",
      "text_en": " Jabir b. 'Abdullah reported that Allah's Messenger (may peace be upon him) forbade that any beast should be killed after it has been tied.",
      "usc_msa_ref": "",
      "chain": [
        "38487",
        "20031",
        "11070",
        "30553",
        "20277",
        "11070",
        "30524",
        "20381",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "id": "sahih-muslim-5415",
      "hadith_no": "5415",
      "source": "Sahih Muslim",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثني هارون بن عبد الله، حدثنا حجاج بن محمد، ح وحدثنا عبد بن حميد، أخبرني أبو عاصم، جميعا عن ابن جريج، ح وحدثنا زهير بن حرب، - واللفظ له - حدثنا  روح بن عبادة، حدثنا ابن جريج، قال سمعت عطاء، يقول سمعت ابن عباس، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا أكل أحدكم من الطعام فلا يمسح يده حتى يلعقها أو يلعقها ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Abbas reported Allah's Messenger (may peace be upon him) as saying:                      When any one of you eats food he should not wipe his hand until he has licked it or got it licked by (someone else).",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20381",
        "30553",
        "11070",
        "30022",
        "20229",
        "11070",
        "11029",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-5582",
      "hadith_no": "5582",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "وحدثني محمد بن حاتم، وهارون بن عبد الله، وابن أبي خلف، وألفاظهم، متقاربةقالوا حدثنا روح بن عبادة، حدثنا ابن جريج، قال سمعت محمد بن عباد بن جعفر، يقولأمرت مسلم بن يسار مولى نافع بن عبد الحارث أن يسأل ابن عمر، - قال - وأنا جالس،بينهما أسمعت من النبي صلى الله عليه وسلم في الذي يجر إزاره من الخيلاء شيئا قالسمعته يقول ‏\"‏ لا ينظر الله إليه يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " Mubammad b. 'Abbad b. ja'far reported:                      I ordered Muslim b. Yasar, the freed slave of Nafi' b. 'Abd al-Harith, while I was sitting between them, that he should ask Ibn 'Umar if he had heard anything from Allah's Messenger (may peace be upon him) pertaining to one who trails his lower garment out of pride. He said: I heard him (the Holy Prophet) as saying: Allah will not look toward him on the Day of Resurrection.",
      "usc_msa_ref": "",
      "chain": [
        "38487",
        "30524",
        "20229",
        "11070",
        "30377"
      ]
    },
    {
      "id": "sahih-muslim-5673",
      "hadith_no": "5673",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "وحدثني هارون بن عبد الله، حدثنا حجاج بن محمد، ح وحدثنا عبد بن حميد، أخبرنا محمد بن بكر، ‏.‏ كلاهما عن ابن جريج، قال أخبرني أبو الزبير، أنه سمع جابر، بن عبد الله يقول نهى رسول الله صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " This hadith has been reported on the authority of Jabir b. 'Abdullah through another chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20381",
        "30553",
        "20277",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "id": "sahih-muslim-5788",
      "hadith_no": "5788",
      "source": "Sahih Muslim",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثني هارون بن عبد الله، وحجاج بن الشاعر، قالا حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني أبو الزبير، أنه سمع جابر بن عبد الله، يقول سلم ناس من يهود على رسول الله صلى الله عليه وسلم فقالوا السام عليك يا أبا القاسم ‏.‏ فقال ‏\"‏ وعليكم ‏\"‏ ‏.‏ فقالت عائشة وغضبت ألم تسمع ما قالوا قال ‏\"‏ بلى قد سمعت فرددت عليهم وإنا نجاب عليهم ولا يجابون علينا ‏\"‏ ‏.‏",
      "text_en": " Jabir b. Abdullah reported that some people from amongst the Jews said to Allah's Messenger (may peace be upon him) Abu'l-Qasim. as-Sam-u-'Alaikum, whereupon he said:                      Wa 'Alaikum, A'isha was enraged and asked him (Allah's Apostle) whether he had not heard what they had said. He said, I did hear and I retorted to them (and the curse that I invoked upon them would receive response from Allah), but (the curse that they invoked upon us) would not be responded.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "38834",
        "20381",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "id": "sahih-muslim-5835",
      "hadith_no": "5835",
      "source": "Sahih Muslim",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "وحدثنا هارون بن عبد الله، حدثنا روح بن عبادة، حدثنا شعبة، - سمعت هشام، بن زيد سمعت أنس بن مالك، يحدث أن يهودية، جعلت سما في لحم ثم أتت به رسول الله صلى الله عليه وسلم بنحو حديث خالد ‏.‏",
      "text_en": " Anas b. Malik reported that a Jewess brought poisoned meat and then served it to Allah's Messenger (may peace be upon him)",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20229",
        "20020",
        "11228",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-5944",
      "hadith_no": "5944",
      "source": "Sahih Muslim",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "وحدثني هارون بن عبد الله، حدثنا روح بن عبادة، حدثنا شعبة، بهذا الإسناد مثله ولم يقل ‏\"‏ حق ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Shu'ba with the same chain of transmitters but there is no mention of the word\" Haqq\"\" (fact).",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20229"
      ]
    },
    {
      "id": "sahih-muslim-5991",
      "hadith_no": "5991",
      "source": "Sahih Muslim",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "وحدثناه هارون بن عبد الله، وعبد الله بن جعفر، عن معن بن عيسى، عن مالك، عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم بذلك ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Ibn 'Umar also.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "108",
        "30112",
        "20001",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-6139",
      "hadith_no": "6139",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثنا هارون بن عبد الله، حدثنا عبد الصمد، حدثنا هشام، ح وحدثنا حسن، بن علي الحلواني حدثنا أبو الوليد الطيالسي، حدثنا أبو عوانة، كلاهما عن قتادة، عن  أنس، عن النبي صلى الله عليه وسلم بمثله غير أنهما شكا فقالا أو مثل ما بين المدينة وعمان ‏.‏ وفي حديث أبي عوانة ‏\"‏ ما بين لابتى حوضي ‏\"‏ ‏.‏",
      "text_en": " Anas reported this hadith with this change that there was some doubt between (places mentioned) and there is a slight variation of wording.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20250",
        "20295",
        "20296",
        "11019",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-6242",
      "hadith_no": "6242",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا إسحاق بن إبراهيم، وهارون بن عبد الله، عن روح بن عبادة، حدثنا  زكرياء بن إسحاق، عن عمرو بن دينار، عن ابن عباس، أن رسول الله صلى الله عليه وسلم مكث بمكة ثلاث عشرة وتوفي وهو ابن ثلاث وستين ‏.‏",
      "text_en": " Ibn 'Abbas reported that Allah's Messenger (may peace be upon him) stayed in Mecca for thirteen years and he died when he had attained the age of sixty three years.",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "30524",
        "20229",
        "11244",
        "11081",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-6560",
      "hadith_no": "6560",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثني هارون بن عبد الله، حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني  أبو الزبير، أنه سمع جابر بن عبد الله، يقول أخبرتني أم مبشر، أنها سمعت النبي صلى الله عليه وسلم يقول عند حفصة ‏\"‏ لا يدخل النار إن شاء الله من أصحاب الشجرة أحد ‏.‏ الذين بايعوا تحتها ‏\"‏ ‏.‏ قالت بلى يا رسول الله ‏.‏ فانتهرها فقالت حفصة ‏{‏ وإن منكم إلا واردها‏}‏ فقال النبي صلى الله عليه وسلم ‏\"‏ قد قال الله عز وجل ‏{‏ ثم ننجي الذين اتقوا ونذر الظالمين فيها جثيا‏}‏",
      "text_en": " Umm Mubashshir reported that she heard Allah's Apostle (may peace be upon him) as saying in presence of Hafsa:                      God willing, the people of the Tree would never enter the fire of Hell one amongst those who owed allegiance under that. She said: Allah's Messenger, why not? He scolded her. Hafsa said: And there is none amongst you but shall have to pass over that (narrow Bridge). Thereupon Allah's Apostle (may peace be upon him) said: Allah, the Exalted and Glorious, has said: We would rescue those persons who are God-conscious and we would leave the tyrants to their fate there (xix. 72).",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20381",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "id": "sahih-muslim-6606",
      "hadith_no": "6606",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثني هارون بن عبد الله، حدثنا عبد الصمد، حدثنا شعبة، حدثني سيد بني، تميم محمد بن عبد الله بن أبي يعقوب الضبي بهذا الإسناد ‏.‏ مثله قال ‏\"‏ وجهينة ‏\"‏ ‏.‏ ولم يقل أحسب ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Abu Ya'qub Dabbi with the same chain of transmitters but with a slight variation of wording.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20250",
        "20020"
      ]
    },
    {
      "id": "sahih-muslim-6608",
      "hadith_no": "6608",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمد بن المثنى، وهارون بن عبد الله، قالا حدثنا عبد الصمد، ح وحدثنيه  عمرو الناقد، حدثنا شبابة بن سوار، قالا حدثنا شعبة، عن أبي بشر، بهذا الإسناد ‏.‏",
      "text_en": " This hadith has been reported on the authority of Abu Bishr with the same chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "30524",
        "20250",
        "20426",
        "20020"
      ]
    },
    {
      "id": "sahih-muslim-6644",
      "hadith_no": "6644",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثني هارون بن عبد الله، وحجاج بن الشاعر، قالا حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني أبو الزبير، أنه سمع جابر بن عبد الله، يقول سمعت النبي صلى الله عليه وسلم يقول قبل أن يموت بشهر ‏\"‏ تسألوني عن الساعة وإنما علمها عند الله وأقسم بالله ما على الأرض من نفس منفوسة تأتي عليها مائة سنة ‏\"‏ ‏.‏",
      "text_en": " Jabir b. 'Abdullah reported:                      I heard Allah's Messenger (may peace be upon him) as saying this one month before his death: You asked me about the Last Hour whereas its knowledge is with Allah. I, however, take an oath and say that none upon the earth, the created beings (from amongst my Companions), would survive at the end of one hundred years. This hadith has been narrated on the authority of Ibn Juraij with the same chain of transmitters, but there is no mention of the words:\" one month before his death\".",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "38834",
        "20381",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "id": "sahih-muslim-6790",
      "hadith_no": "6790",
      "source": "Sahih Muslim",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثني هارون بن عبد الله، وحجاج بن الشاعر، قالا حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني أبو الزبير، أنه سمع جابر بن عبد الله، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إنما أنا بشر وإني اشترطت على ربي عز وجل أى عبد من المسلمين سببته أو شتمته أن يكون ذلك له زكاة وأجرا ‏\"‏ ‏.‏  حدثنيه ابن أبي خلف، حدثنا روح، ح وحدثناه عبد بن حميد، حدثنا أبو عاصم، جميعا عن ابن جريج، بهذا الإسناد مثله ‏.‏",
      "text_en": " Jabir b. Abdullah reported Allah's Messenger (may peace be upon him) as saying:                      I am a human being and I have made this term with my Lord, the Exalted and Glorious: For any servant amongst Muslims whom I curse or scold, make that a source of purity and reward. This hadith has been narrated on the authority of Ibn Juraij with the same chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "38834",
        "20381",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "id": "sahih-muslim-6842",
      "hadith_no": "6842",
      "source": "Sahih Muslim",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثني هارون بن عبد الله، وعبد الله بن جعفر بن يحيى بن خالد، جميعا عن  معن بن عيسى، عن مالك بن أنس، عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم بمعنى حديث جويرية ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "30112",
        "20001",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-7231",
      "hadith_no": "7231",
      "source": "Sahih Muslim",
      "chapter": "The Book Giving Description of the Day of Judgement; Paradise and Hell - كتاب صفة القيامة والجنة والنار",
      "chapter_no": "53",
      "text_ar": "حدثني سريج بن يونس، وهارون بن عبد الله، قالا حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني إسماعيل بن أمية، عن أيوب بن خالد، عن عبد الله بن رافع، مولى أم سلمة عن أبي هريرة، قال أخذ رسول الله صلى الله عليه وسلم بيدي فقال ‏\"‏ خلق الله عز وجل التربة يوم السبت وخلق فيها الجبال يوم الأحد وخلق الشجر يوم الاثنين وخلق المكروه يوم الثلاثاء وخلق النور يوم الأربعاء وبث فيها الدواب يوم الخميس وخلق آدم عليه السلام بعد العصر من يوم الجمعة في آخر الخلق وفي آخر ساعة من ساعات الجمعة فيما بين العصر إلى الليل ‏\"‏ ‏.‏",
      "text_en": " Abu Haraira reported that Allah's Messenger (may peace be upon him) took hold of my hands and said:                      Allah, the Exalted and Glorious, created the clay on Saturday and He created the mountains on Sunday and He created the trees on Monday and He created the things entailing labour on Tuesday and created light on Wednesday and lie caused the animals to spread on Thursday and created Adam (peace be upon him) after 'Asr on Friday;the last creation at the last hour of the hours of Friday, i. e. between afternoon and night.",
      "usc_msa_ref": "",
      "chain": [
        "30251",
        "30524",
        "20381",
        "11070",
        "11417",
        "11831",
        "11864",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-7580",
      "hadith_no": "7580",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثني هارون بن عبد الله، حدثنا حجاج بن محمد، قال قال ابن جريج حدثني  أبو الزبير، أنه سمع جابر بن عبد الله، يقول أخبرتني أم شريك، أنها سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ ليفرن الناس من الدجال في الجبال ‏\"‏ ‏.‏ قالت أم شريك يا رسول الله فأين العرب يومئذ قال ‏\"‏ هم قليل ‏\"‏ ‏.‏",
      "text_en": " Umm Sharik reported:                      I heard Allah's Messenger (may peace be upon him) as saying: The people would run away from the Dajjal seeking shelter in the mountains. She said: Where would be the Arabs then in that day? He said: They would be small in number.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20381",
        "11070",
        "11263",
        "34",
        "187"
      ]
    },
    {
      "id": "sahih-muslim-7601",
      "hadith_no": "7601",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا عفان بن مسلم، حدثنا همام، حدثنا قتادة، عن  أنس، قال مر غلام للمغيرة بن شعبة وكان من أقراني فقال النبي صلى الله عليه وسلم ‏\"‏ إن يؤخر هذا فلن يدركه الهرم حتى تقوم الساعة ‏\"‏ ‏.‏",
      "text_en": " Anas reported:                      A young boy of Mughira b. Shu'ba happened to pass by (the Holy Prophet) and he was of my age Thereupon Allah's Apostle (may peace be apon him) said: If he lives long he would not grow very old till the Last Hour would come (to the old People of this generation).",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "30106",
        "20297",
        "11019",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-7729",
      "hadith_no": "7729",
      "source": "Sahih Muslim",
      "chapter": "The Book of Commentary - كتاب التفسير",
      "chapter_no": "57",
      "text_ar": "حدثني هارون بن عبد الله، حدثنا أبو النضر، هاشم بن القاسم الليثي حدثنا أبو معاوية، - يعني شيبان - عن منصور بن المعتمر، عن سعيد بن جبير، عن ابن عباس،قال نزلت هذه الآية بمكة ‏{‏ والذين لا يدعون مع الله إلها آخر‏}‏ إلى قوله ‏{‏ مهانا‏}‏ فقال المشركون وما يغني عنا الإسلام وقد عدلنا بالله وقد قتلنا النفس التي حرم الله وأتينا الفواحش فأنزل الله عز وجل ‏{‏ إلا من تاب وآمن وعمل عملا صالحا‏}‏ إلى آخر الآية ‏.‏ قال فأما من دخل في الإسلام وعقله ثم قتل فلا توبة له ‏.‏",
      "text_en": " Ibn 'Abbas said:                      This verse was revealed in Mecca:\" And they who call not upon another god with Allah and slay not the soul which Allah has forbidden except in the cause of justice\" up to the word Muhdana (abased). Thereupon the polytheists said: Islam is of no avail to us for we have made peer with Allah and we killed the soul which Allah had forbidden to do and we committed debauchery, and it was (on this occasion) that Allah, the Exalted and Glorious, revealed this verse:\" Except him who repents and believes and does good deeds\" up to the end Ibn 'Abbis says: He who enters the fold of Islam and understands its command and then kills the soul there is no repentance for him.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "11067",
        "11050"
      ]
    },
    {
      "id": "sahih-muslim-7731",
      "hadith_no": "7731",
      "source": "Sahih Muslim",
      "chapter": "The Book of Commentary - كتاب التفسير",
      "chapter_no": "57",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وهارون بن عبد الله، وعبد بن حميد، قال عبد أخبرنا وقال الآخران، حدثنا جعفر بن عون، أخبرنا أبو عميس، عن عبد المجيد بن سهيل، عن عبيد الله بن عبد الله بن عتبة، قال قال لي ابن عباس تعلم - وقال هارون تدري - آخر سورة نزلت من القرآن نزلت جميعا قلت نعم ‏.‏ ‏{‏ إذا جاء نصر الله والفتح‏}‏ قال صدقت ‏.‏ وفي رواية ابن أبي شيبة تعلم أى سورة ‏.‏ ولم يقل آخر ‏.‏",
      "text_en": " Ubaidullah b. 'Abdullah b. 'Utba reported:                      Ibn Abbas said to me: Do you know-and in the words of Harun (another narrator): Are you aware of-the last Sura which was revealed in the Qur'an as a whole? I said: Yes,\" When came the help from Allah and the victory\" (cx.). Thereupon, he said: You have told the truth. And in the narration of Abu Shaiba (the words are): Do you know the Sura? And he did not mention the words\" the last one\".",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30524",
        "30553",
        "20416",
        "11705",
        "11004"
      ]
    },
    {
      "id": "sunan-abi-daud-110",
      "hadith_no": "110",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا يحيى بن آدم، حدثنا إسرائيل، عن عامر بن شقيق بن جمرة، عن شقيق بن سلمة، قال رأيت عثمان بن عفان غسل ذراعيه ثلاثا ثلاثا ومسح رأسه ثلاثا ثم قال رأيت رسول الله صلى الله عليه وسلم فعل هذا ‏.‏ قال أبو داود رواه وكيع عن إسرائيل قال توضأ ثلاثا فقط ‏.‏",
      "text_en": " Shaqiq b. Salamah said :                      I saw ‘ Uthman b. ‘ Affan (perform ablution). He washed his forearms three times and washed his head thrice. He then said : I saw the Messenger of Allah (ﷺ) doing like that. Abu Dawud said: Another version says: \"He performed ablution three times only.\"",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20364",
        "20311",
        "15261",
        "11353"
      ]
    },
    {
      "id": "sunan-abi-daud-1016",
      "hadith_no": "1016",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا هاشم بن القاسم، حدثنا عكرمة بن عمار، عن ضمضم بن جوس الهفاني، حدثني أبو هريرة، بهذا الخبر قال ثم سجد سجدتى السهو بعد ما سلم ‏.‏",
      "text_en": " Abu Hurairah reported; He then made two prostration on account of forgetfulness after he had given the salutation.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20390",
        "10704",
        "19914",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-1047",
      "hadith_no": "1047",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا حسين بن علي، عن عبد الرحمن بن يزيد بن جابر، عن أبي الأشعث الصنعاني، عن أوس بن أوس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن من أفضل أيامكم يوم الجمعة فيه خلق آدم وفيه قبض وفيه النفخة وفيه الصعقة فأكثروا على من الصلاة فيه فإن صلاتكم معروضة على ‏\"‏ ‏.‏ قال قالوا يا رسول الله وكيف تعرض صلاتنا عليك وقد أرمت يقولون بليت ‏.‏ فقال ‏\"‏ إن الله عز وجل حرم على الأرض أجساد الأنبياء ‏\"‏ ‏.‏",
      "text_en": " Narrated Aws ibn Aws:                     The Prophet (ﷺ) said: Among the most excellent of your days is Friday; on it Adam was created, on it he died, on it the last trumpet will be blown, and on it the shout will be made, so invoke more blessings on me that day, for your blessings will be submitted to me.  The people asked: Messenger of Allah, how can it be that our blessings will be submitted to you while your body is decayed? He replied: Allah, the Exalted, has prohibited the earth from consuming the bodies of Prophets.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20315",
        "20395",
        "10917",
        "3214"
      ]
    },
    {
      "id": "sunan-abi-daud-1347",
      "hadith_no": "1347",
      "source": "Sunan Abi Da'ud",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا يزيد بن هارون، أخبرنا بهز بن حكيم، فذكر هذا الحديث بإسناده قال ‏:‏ يصلي العشاء ثم يأوي إلى فراشه، لم يذكر الأربع ركعات، وساق الحديث قال فيه ‏:‏ فيصلي ثماني ركعات يسوي بينهن في القراءة والركوع والسجود، ولا يجلس في شىء منهن إلا في الثامنة، فإنه كان يجلس ثم يقوم ولا يسلم، فيصلي ركعة يوتر بها، ثم يسلم تسليمة يرفع بها صوته حتى يوقظنا، ثم ساق معناه ‏.‏",
      "text_en": " The above-mentioned tradition has also been narrated by Banu al-Hakim through a different chain of narrators. This version adds:                      He (the Prophet) would offer the night prayer and go to his bed. In this version there is no mention of praying four rak'ahs. The narrator then transmitted the rest of the tradition. This version further says: He would pray eight rak'ahs during which his recitation of the Qur'an, bowing and prostration were all equal. He would sit only after the eight rak'ah, and then stand up without uttering the salutation, and pray one rak'ah observing witr prayer and then give the salutation raising his voice so much so that we were about to awake. The narrator then transmitted the tradition to the same effect.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20472",
        "19901"
      ]
    },
    {
      "id": "sunan-abi-daud-1399",
      "hadith_no": "1399",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Ramadan - كتاب شهر رمضان",
      "chapter_no": "6",
      "text_ar": "حدثنا يحيى بن موسى البلخي، وهارون بن عبد الله، قالا أخبرنا عبد الله بن يزيد، أخبرنا سعيد بن أبي أيوب، حدثني عياش بن عباس القتباني، عن عيسى بن هلال الصدفي، عن عبد الله بن عمرو، قال أتى رجل رسول الله صلى الله عليه وسلم فقال أقرئني يا رسول الله ‏.‏ فقال ‏\"‏ اقرأ ثلاثا من ذوات الراء ‏\"‏ ‏.‏ فقال كبرت سني واشتد قلبي وغلظ لساني ‏.‏ قال ‏\"‏ فاقرأ ثلاثا من ذوات حم ‏\"‏ ‏.‏ فقال مثل مقالته ‏.‏ فقال ‏\"‏ اقرأ ثلاثا من المسبحات ‏\"‏ ‏.‏ فقال مثل مقالته فقال الرجل يا رسول الله أقرئني سورة جامعة ‏.‏ فأقرأه النبي صلى الله عليه وسلم ‏{‏ إذا زلزلت الأرض ‏}‏ حتى فرغ منها ‏.‏ فقال الرجل والذي بعثك بالحق لا أزيد عليها أبدا ثم أدبر الرجل فقال النبي صلى الله عليه وسلم ‏\"‏ أفلح الرويجل ‏\"‏ ‏.‏ مرتين ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr:                     A man came to the Messenger of Allah (ﷺ) and said: Teach me to read the Qur'an, Messenger of Allah.  He said: Read three surahs which begin with A.L.R.  He said: My age is advanced, my mind has become dull (i.e. memory has grown weak), and my tongue has grown heavy). So he said: Then read three surahs which begin with H.M. He repeated the same words.  So he said: Read three surahs which begin with the \"Glorification of Allah\". But he repeated the same excuse.  The man then said: Teach me a comprehensive surah, Messenger of Allah. The Prophet (ﷺ) taught him Surah (99). \"When the Earth is shaken with her earthquake\". When he finished it, the man said: By Him Who sent you with truth, I shall never add anything to it. Then man then went away.  The Prophet (ﷺ) said twice:  The man received salvation.",
      "usc_msa_ref": "",
      "chain": [
        "30221",
        "30524",
        "23033",
        "20375",
        "10871",
        "16083",
        "29"
      ]
    },
    {
      "id": "sunan-abi-daud-1447",
      "hadith_no": "1447",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا هارون بن عبد الله البزاز، حدثنا مكي بن إبراهيم، حدثنا عبد الله، - يعني ابن سعيد بن أبي هند - عن أبي النضر، عن بسر بن سعيد، عن زيد بن ثابت، أنه قال احتجر رسول الله صلى الله عليه وسلم في المسجد حجرة فكان رسول الله صلى الله عليه وسلم يخرج من الليل فيصلي فيها قال فصلوا معه بصلاته - يعني رجالا - وكانوا يأتونه كل ليلة حتى إذا كان ليلة من الليالي لم يخرج إليهم رسول الله صلى الله عليه وسلم فتنحنحوا ورفعوا أصواتهم وحصبوا بابه - قال - فخرج إليهم رسول الله صلى الله عليه وسلم مغضبا فقال ‏\"‏ يا أيها الناس ما زال بكم صنيعكم حتى ظننت أن ستكتب عليكم فعليكم بالصلاة في بيوتكم فإن خير صلاة المرء في بيته إلا الصلاة المكتوبة ‏\"‏ ‏.‏",
      "text_en": " Zaid b. Thabit said:                      The Messenger of Allah (ﷺ) built a chamber in the mosque. He used to come out at night and pray there. They (the people) also prayed along with him. They would come (to prayer) every night. If on any night the Messenger of Allah (ﷺ) did not come out, they would cough, raise their voices and throw pebbles and sand on his door. The Messenger of Allah (ﷺ) came out to time in anger and said: O People, you kept on doing this till I thought that it will be prescribed for you. Offer your prayers in your houses, for a man's prayer is better in his house except obligatory prayer.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20202",
        "11184",
        "11164",
        "11153",
        "49"
      ]
    },
    {
      "id": "sunan-abi-daud-1482",
      "hadith_no": "1482",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا يزيد بن هارون، عن الأسود بن شيبان، عن أبي نوفل، عن عائشة، رضى الله عنها قالت كان رسول الله صلى الله عليه وسلم يستحب الجوامع من الدعاء ويدع ما سوى ذلك ‏.‏",
      "text_en": " 'Aishah said:                      The Messenger of Allah (ﷺ) liked comprehensive supplication and abandoned other kinds.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20472",
        "10669",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-1764",
      "hadith_no": "1764",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا محمد، ويعلى، ابنا عبيد قالا حدثنا محمد بن إسحاق، عن ابن أبي نجيح، عن مجاهد، عن عبد الرحمن بن أبي ليلى، عن علي، - رضى الله عنه - قال لما نحر رسول الله صلى الله عليه وسلم بدنه فنحر ثلاثين بيده وأمرني فنحرت سائرها ‏.‏",
      "text_en": " Narrated Ali ibn AbuTalib:                     When the Messenger of Allah (ﷺ) sacrificed the camels, he sacrificed thirty of them with his own hand, and then commanded me (to sacrifice them), so I sacrificed the rest of them.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "30213",
        "11107",
        "11254",
        "11028",
        "11196",
        "5"
      ]
    },
    {
      "id": "sunan-abi-daud-1868",
      "hadith_no": "1868",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا أبو أسامة، حدثنا هشام بن عروة، عن أبيه، عن عائشة، - رضى الله عنها - قالت دخل رسول الله صلى الله عليه وسلم عام الفتح من كداء من أعلى مكة ودخل في العمرة من كدى قال وكان عروة يدخل منهما جميعا وكان أكثر ما كان يدخل من كدى وكان أقربهما إلى منزله ‏.‏",
      "text_en": " A’ishah said The Apostle of Allaah (ﷺ) entered Makkah from the side of Kuda’ the upper end of Makkah in the year of conquest (of Makkah) and he entered from the side of Kida’ when he performed ‘Umrah. ‘Urwah used to enter (Makkah) from both sides, but he often entered from the side of Kuda’ as it was nearer to his house.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20318",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-1879",
      "hadith_no": "1879",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا هارون بن عبد الله، ومحمد بن رافع، - المعنى - قالا حدثنا أبو عاصم، عن معروف، - يعني ابن خربوذ المكي - حدثنا أبو الطفيل، قال رأيت النبي صلى الله عليه وسلم يطوف بالبيت على راحلته يستلم الركن بمحجنه ثم يقبله زاد محمد بن رافع ثم خرج إلى الصفا والمروة فطاف سبعا على راحلته ‏.‏",
      "text_en": " Abu Al Tufail reported on the authority of Ibn ‘Abbas who said I saw the Prophet (ﷺ) circumambulating the Ka’bah on his Camel, touching the corner (Black Stone) with a crooked stick and kissing it (the crooked stick). The narrator Muhammad bin Rafi’ added “he then went o Al Safa and Al Marwah and ran seven times on his Camel.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "30375",
        "20241",
        "11564",
        "3660"
      ]
    },
    {
      "id": "sunan-abi-daud-1942",
      "hadith_no": "1942",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا ابن أبي فديك، عن الضحاك، - يعني ابن عثمان - عن هشام بن عروة، عن أبيه، عن عائشة، أنها قالت أرسل النبي صلى الله عليه وسلم بأم سلمة ليلة النحر فرمت الجمرة قبل الفجر ثم مضت فأفاضت وكان ذلك اليوم اليوم الذي يكون رسول الله صلى الله عليه وسلم - تعني - عندها ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     The Prophet (ﷺ) sent Umm Salamah on the night before the day of sacrifice and she threw pebbles at the jamrah before dawn. She hastened (to Mecca) and performed the circumambulation. That day was the one the Messenger of Allah (ﷺ) spent with her.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20172",
        "20504",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-1954",
      "hadith_no": "1954",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا هشام بن عبد الملك، حدثنا عكرمة، حدثني الهرماس بن زياد الباهلي، قال رأيت النبي صلى الله عليه وسلم يخطب الناس على ناقته العضباء يوم الأضحى بمنى ‏.‏",
      "text_en": " Narrated Harmas ibn Ziyad al-Bahili:                     I saw the Prophet (ﷺ) addressing the people on his she-camel al-Adba', on the day of sacrifice at Mina.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "11023",
        "5320"
      ]
    },
    {
      "id": "sunan-abi-daud-2220",
      "hadith_no": "2220",
      "source": "Sunan Abi Da'ud",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا محمد بن الفضل، حدثنا حماد بن سلمة، عن هشام بن عروة، عن عروة، عن عائشة، مثله ‏.‏",
      "text_en": " A similar tradition has been transmitted by A’ishah through a different chain of narrators.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20283",
        "20021",
        "11065",
        "10511"
      ]
    },
    {
      "id": "sunan-abi-daud-2303",
      "hadith_no": "2303",
      "source": "Sunan Abi Da'ud",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا هارون بن عبد الله، ومالك بن عبد الواحد المسمعي، قالا حدثنا يزيد بن هارون، عن هشام، عن حفصة، عن أم عطية، عن النبي صلى الله عليه وسلم بهذا الحديث وليس في تمام حديثهما ‏.‏ قال المسمعي قال يزيد ولا أعلمه إلا قال فيه ‏\"‏ ولا تختضب ‏\"‏ ‏.‏ وزاد فيه هارون ‏\"‏ ولا تلبس ثوبا مصبوغا إلا ثوب عصب ‏\"‏ ‏.‏",
      "text_en": " The tradition mentioned above has also been narrated by Al ‘Umm Athiyah from the Prophet (ﷺ) through a different chain of narrators. The tradition narrated by Yazid bin Harun from Hisham does perfectly correspond to the tradition transmitted by Ibrahim bin Tahman and ‘Abd Allah Al Shami from Hisham. The narrator Al Misma’I reported Yazid as saying “I do not know but that he said “she should not dye herself.” To this the narrator Harun added “She should not wear colored clothes except one of the types made of dyed yarn.”",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20472",
        "20295",
        "54",
        "71"
      ]
    },
    {
      "id": "sunan-abi-daud-2359",
      "hadith_no": "2359",
      "source": "Sunan Abi Da'ud",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا هارون بن عبد الله، ومحمد بن العلاء، - المعنى - قالا حدثنا أبو أسامة، حدثنا هشام بن عروة، عن فاطمة بنت المنذر، عن أسماء بنت أبي بكر، قالت أفطرنا يوما في رمضان في غيم في عهد رسول الله صلى الله عليه وسلم ثم طلعت الشمس قال أبو أسامة قلت لهشام أمروا بالقضاء قال وبد من ذلك",
      "text_en": " Narrated Asma' daughter of Abu Bakr :                     We broke the fast one during Ramadan when it was cloudy in the lifetime of the Messenger of Allah (ﷺ) ; then the sun rose. Abu Usamah said: I said to Hisham: Were they commanded to atone for it ? He replied: That was inevitable.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "30216",
        "20318",
        "11065",
        "10526",
        "70"
      ]
    },
    {
      "id": "sunan-abi-daud-2543",
      "hadith_no": "2543",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا هشام بن سعيد الطالقاني، حدثنا محمد بن المهاجر الأنصاري، حدثني عقيل بن شبيب، عن أبي وهب الجشمي، - وكانت له صحبة - قال قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏ عليكم بكل كميت أغر محجل، أو أشقر أغر محجل، أو أدهم أغر محجل ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuWahb al-Jushami,:                     The Messenger of Allah (ﷺ) said: Keep to every dark bay horse with a white blaze and white on the legs, or sorrel with a white blaze and white on the legs , or black with a white blaze and white on the legs.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "26529",
        "18745"
      ]
    },
    {
      "id": "sunan-abi-daud-2553",
      "hadith_no": "2553",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا هشام بن سعيد الطالقاني، أخبرنا محمد بن المهاجر، حدثني عقيل بن شبيب، عن أبي وهب الجشمي، - وكانت له صحبة - قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ارتبطوا الخيل وامسحوا بنواصيها وأعجازها ‏\"‏ ‏.‏ أو قال ‏\"‏ أكفالها ‏\"‏ ‏.‏ ‏\"‏ وقلدوها ولا تقلدوها الأوتار ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuWahb al-Jushami,:                     The Messenger of Allah (ﷺ) said: Tie the horses, rub down their forelocks and their buttocks (or he said: Their rumps), and put things on their necks, but do not put bowstrings.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "26529",
        "18745"
      ]
    },
    {
      "id": "sunan-abi-daud-2618",
      "hadith_no": "2618",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا هاشم بن القاسم، حدثنا سليمان، - يعني ابن المغيرة - عن ثابت، عن أنس، قال بعث - يعني النبي صلى الله عليه وسلم - بسبسة عينا ينظر ما صنعت عير أبي سفيان ‏.‏",
      "text_en": " Anas said “the Prophet(ﷺ) sent Busaisah as a spy to see what the caravan of Abu Sufyan was doing.”",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20390",
        "20236",
        "11269",
        "19"
      ]
    },
    {
      "id": "sunan-abi-daud-2654",
      "hadith_no": "2654",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا هارون بن عبد الله، أن هاشم بن القاسم، وهشاما، حدثاهم قالا، حدثنا عكرمة بن عمار، قال حدثني إياس بن سلمة، قال حدثني أبي قال، غزوت مع رسول الله صلى الله عليه وسلم هوازن - قال - فبينما نحن نتضحى وعامتنا مشاة وفينا ضعفة إذ جاء رجل على جمل أحمر فانتزع طلقا من حقو البعير فقيد به جمله ثم جاء يتغدى مع القوم فلما رأى ضعفتهم ورقة ظهرهم خرج يعدو إلى جمله فأطلقه ثم أناخه فقعد عليه ثم خرج يركضه واتبعه رجل من أسلم على ناقة ورقاء هي أمثل ظهر القوم - قال - فخرجت أعدو فأدركته ورأس الناقة عند ورك الجمل وكنت عند ورك الناقة ثم تقدمت حتى كنت عند ورك الجمل ثم تقدمت حتى أخذت بخطام الجمل فأنخته فلما وضع ركبته بالأرض اخترطت سيفي فأضرب رأسه فندر فجئت براحلته وما عليها أقودها فاستقبلني رسول الله صلى الله عليه وسلم في الناس مقبلا فقال ‏\"‏ من قتل الرجل ‏\"‏ ‏.‏ فقالوا سلمة بن الأكوع ‏.‏ قال ‏\"‏ له سلبه أجمع ‏\"‏ ‏.‏ قال هارون هذا لفظ هاشم ‏.‏",
      "text_en": " Salamh (bin  Al Akwa’) said “I went on an expedition with the Apostle of Allaah(ﷺ) against Hawazin and while we were having a meal in the forenoon and most of our people were on foot and some of us were weak, a man came on a red Camel. He took out a rope from the lion of the Camel and tied his Camel with it and began to take meal with the people. When he saw the weak condition of their people and lack of mounts he went out in a hurry to his Camel, untied it made it kneel down and sat on it and went off galloping it. A man of the tribe of Aslam followed him on a brown she Camel which was best of those of the people. I hastened out and I found him while the head of the she Camel was near the paddock of the she Camel. I then went ahead till I reached near the paddock of the Camel. I then went ahead till I caught the Camel’s nose string. I made it kneel. When it placed its knee on the ground, I drew my sword and struck the man on his head and it fell down. I then brought the Camel leading it with (its equipment) on it. The Apostle of Allaah(ﷺ) came forward facing me and asked “Who killed the man? They (the people) said “Salamah bin Akwa’. He said “he gets all his spoil.”Harun said “This is Hashim’s version.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20390",
        "10704"
      ]
    },
    {
      "id": "sunan-abi-daud-2665",
      "hadith_no": "2665",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا عثمان بن عمر، أخبرنا إسرائيل، عن أبي إسحاق، عن حارثة بن مضرب، عن علي، قال تقدم - يعني عتبة بن ربيعة - وتبعه ابنه وأخوه فنادى من يبارز فانتدب له شباب من الأنصار فقال من أنتم فأخبروه فقال لا حاجة لنا فيكم إنما أردنا بني عمنا ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ قم يا حمزة قم يا علي قم يا عبيدة بن الحارث ‏\"‏ ‏.‏ فأقبل حمزة إلى عتبة وأقبلت إلى شيبة واختلف بين عبيدة والوليد ضربتان فأثخن كل واحد منهما صاحبه ثم ملنا على الوليد فقتلناه واحتملنا عبيدة ‏.‏",
      "text_en": " Narrated Ali ibn AbuTalib:                     (At the battle of Badr) Utbah ibn Rabi'ah came forward followed by his son and his brother and cried out: Who will be engaged in single combat?  Some young men of the Helpers responded to his call. He asked: Who are you? They told him. He said: We do not want you; we, in fact, want only our cousins. The Prophet (ﷺ) said: Get up Hamzah get up Ali; get up Ubaydah ibn al-Harith. Hamzah went forward to Utbah, I went forward to Shaybah; and after two blows had been exchanged between Ubaydah and al-Walid, they wounded one another severely; so we turned against al-Walid and killed him, and we carried Ubaydah away.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20262",
        "20311",
        "11049",
        "19801",
        "5"
      ]
    },
    {
      "id": "sunan-abi-daud-2695",
      "hadith_no": "2695",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن المثنى، قال حدثنا معاذ بن معاذ، ح وحدثنا هارون بن عبد الله، قال حدثنا روح، قال حدثنا سعيد، عن قتادة، عن أنس، عن أبي طلحة، قال كان رسول الله صلى الله عليه وسلم إذا غلب على قوم أقام بالعرصة ثلاثا ‏.‏ قال ابن المثنى إذا غلب قوما أحب أن يقيم بعرصتهم ثلاثا ‏.‏ قال أبو داود كان يحيى بن سعيد يطعن في هذا الحديث لأنه ليس من قديم حديث سعيد لأنه تغير سنة خمس وأربعين ولم يخرج هذا الحديث إلا بأخرة ‏.‏ قال أبو داود يقال إن وكيعا حمل عنه في تغيره ‏.‏",
      "text_en": " Abu Talhah said “When the Apostle of Allaah(ﷺ) prevailed on any people, he stayed three nights in the field. Ibn Al Muthanna said “When he prevailed over people, he liked to stay three nights in the field.”Abu Dawud said “Yahya bin Sa’id used to object to this tradition for this is not from his early traditions because his memory was spoiled at the age of forty five. He narrated this tradition in the last days of his age.”Abu Dawud said “ It is said that Waki ‘ recived this tradition from him when his memory was spoiled.”",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20286",
        "30524",
        "20229",
        "11168",
        "11019",
        "19",
        "229"
      ]
    },
    {
      "id": "sunan-abi-daud-2697",
      "hadith_no": "2697",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا هارون بن عبد الله، قال حدثنا هاشم بن القاسم، قال حدثنا عكرمة، قال حدثني إياس بن سلمة، قال حدثني أبي قال، خرجنا مع أبي بكر وأمره علينا رسول الله صلى الله عليه وسلم فغزونا فزارة فشننا الغارة ثم نظرت إلى عنق من الناس فيه الذرية والنساء فرميت بسهم فوقع بينهم وبين الجبل فقاموا فجئت بهم إلى أبي بكر فيهم امرأة من فزارة وعليها قشع من أدم معها بنت لها من أحسن العرب فنفلني أبو بكر ابنتها فقدمت المدينة فلقيني رسول الله صلى الله عليه وسلم فقال لي ‏\"‏ يا سلمة هب لي المرأة ‏\"‏ ‏.‏ فقلت والله لقد أعجبتني وما كشفت لها ثوبا ‏.‏ فسكت حتى إذا كان من الغد لقيني رسول الله صلى الله عليه وسلم في السوق فقال ‏\"‏ يا سلمة هب لي المرأة لله أبوك ‏\"‏ ‏.‏ فقلت يا رسول الله والله ما كشفت لها ثوبا وهي لك ‏.‏ فبعث بها إلى أهل مكة وفي أيديهم أسرى ففاداهم بتلك المرأة ‏.‏",
      "text_en": " Salamah said “We went out (on an expedition) with Abu Bakr. The Apostle of Allaah(ﷺ) appointed him commander over us. We attacked Fazarah and took them from all sides. I then saw a group of people which contained children and women. I shot an arrow towards them, but it fell between them and the mountain. They stood; I brought them to Abu Bakr. There was among them a woman of Fazarah. She wore a skin over her and her daughter who was the most beautiful of the Arabs was with her. Abu Bakr gave her daughter to me as a reward. I came back to Madeenah. The Apostle of Allaah(ﷺ) met me and said to me “Give me the woman, Salamah. I said to him, I swear by Allaah, she is to my liking and I have not yet untied he garment. He kept silence, and when the next day came the Apostle of Allaah(ﷺ) met me in the market and said to me “Give me the woman, Salamah, by Allaah, your father. I said the Apostle of Allaah, I have not yet untied her garment. I swear by Allaah, she is now yours. He sent her to the people of Makkah who had (some Muslims) prisoners in their hands. They released them for this woman.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20390",
        "11023"
      ]
    },
    {
      "id": "sunan-abi-daud-2752",
      "hadith_no": "2752",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا هاشم بن القاسم، حدثنا عكرمة، حدثني إياس بن سلمة، عن أبيه، قال أغار عبد الرحمن بن عيينة على إبل رسول الله صلى الله عليه وسلم فقتل راعيها وخرج يطردها هو وأناس معه في خيل فجعلت وجهي قبل المدينة ثم ناديت ثلاث مرات يا صباحاه ‏.‏ ثم اتبعت القوم فجعلت أرمي وأعقرهم فإذا رجع إلى فارس جلست في أصل شجرة حتى ما خلق الله شيئا من ظهر النبي صلى الله عليه وسلم إلا جعلته وراء ظهري وحتى ألقوا أكثر من ثلاثين رمحا وثلاثين بردة يستخفون منها ثم أتاهم عيينة مددا فقال ليقم إليه نفر منكم ‏.‏ فقام إلى أربعة منهم فصعدوا الجبل فلما أسمعتهم قلت أتعرفوني قالوا ومن أنت قلت أنا ابن الأكوع والذي كرم وجه محمد صلى الله عليه وسلم لا يطلبني رجل منكم فيدركني ولا أطلبه فيفوتني ‏.‏ فما برحت حتى نظرت إلى فوارس رسول الله صلى الله عليه وسلم يتخللون الشجر أولهم الأخرم الأسدي فيلحق بعبد الرحمن بن عيينة ويعطف عليه عبد الرحمن فاختلفا طعنتين فعقر الأخرم عبد الرحمن وطعنه عبد الرحمن فقتله فتحول عبد الرحمن على فرس الأخرم فيلحق أبو قتادة بعبد الرحمن فاختلفا طعنتين فعقر بأبي قتادة وقتله أبو قتادة فتحول أبو قتادة على فرس الأخرم ثم جئت إلى رسول الله صلى الله عليه وسلم وهو على الماء الذي جليتهم عنه ذو قرد فإذا نبي الله صلى الله عليه وسلم في خمسمائة فأعطاني سهم الفارس والراجل ‏.‏",
      "text_en": " Salamah (bin Al ‘Akwa) said “Abd Al rahman bin ‘Uyainah raided the Camels of the Apostle of Allaah(ﷺ) and killed their herdsman. He and some people who were with him on horses proceeded on driving them away. I turned my face towards Madeenah and shouted three times. A morning raid, I then went after the people shooting arrows at them and hamstringing them (their beasts). When a horseman returned to me, I sat in the foot of a tree till there was no riding beast of the Prophet (ﷺ) created by Allaah which I had not kept behind my back. They threw away more than thirty lance and thirty cloaks to lighten themselves. Then ‘Uyainah came to them with reinforcement and said “A few of you should go to him. Four of them stood and came to me. They ascended a mountain. Then they came near me till they could hear my voice. I told them “Do you know me?”  They said “Who are you? I replied “I am Ibn Al ‘Akwa. By Him Who honored the face of Muhammad (ﷺ) if any man of you pursues he cannot catch me and if I pursue him, I will not miss him. This went on with me till I saw the horsemen of the Apostle of Allaah(ﷺ) coming through the trees. Al Akhram Al Asadi was at their head. He then joined ‘Abd Al Rahman bin ‘Uyainah and ‘Abd Al Rahman turned over him. They attacked each other with lances. Al Akhram hamstrung ‘Abd Al Rahman’s horse and ‘Abd Al Rahman pierced a lance in his body and killed him. ‘Abd al Rahman then returned on the horse of Al Akhram. I then came to the Apostle of Allaah(ﷺ)  who was present at the same water from where I drove them away and which is known as Dhu Qarad. The Prophet (ﷺ) was among five hundred people. He then gave me two portions a horseman’s and a footman’s.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20390",
        "11023"
      ]
    },
    {
      "id": "sunan-abi-daud-2789",
      "hadith_no": "2789",
      "source": "Sunan Abi Da'ud",
      "chapter": "Sacrifice (Kitab Al-Dahaya) - كتاب الضحايا",
      "chapter_no": "16",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا عبد الله بن يزيد، حدثني سعيد بن أبي أيوب، حدثني عياش بن عباس القتباني، عن عيسى بن هلال الصدفي، عن عبد الله بن عمرو بن العاص، أن النبي صلى الله عليه وسلم قال ‏\"‏ أمرت بيوم الأضحى عيدا جعله الله عز وجل لهذه الأمة ‏\"‏ ‏.‏ قال الرجل أرأيت إن لم أجد إلا أضحية أنثى أفأضحي بها قال ‏\"‏ لا ولكن تأخذ من شعرك وأظفارك وتقص شاربك وتحلق عانتك فتلك تمام أضحيتك عند الله عز وجل ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     The Prophet (ﷺ) said: I have been commanded to celebrate festival ('Id) on the day of sacrifice, which Allah, Most High, has appointed for this community. A man said: If I do not find except a she-goat or a she-camel borrowed for milk or other benefits, should I sacrifice it? He said: No, but you should clip your hair , and nails, trim your moustaches, and shave your pubes. This is all your sacrifice in the eyes of Allah, Most High.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "1945",
        "20375",
        "10871",
        "16083",
        "29"
      ]
    },
    {
      "id": "sunan-abi-daud-2820",
      "hadith_no": "2820",
      "source": "Sunan Abi Da'ud",
      "chapter": "Sacrifice (Kitab Al-Dahaya) - كتاب الضحايا",
      "chapter_no": "16",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا حماد بن مسعدة، عن عوف، عن أبي ريحانة، عن ابن عباس، قال نهى رسول الله صلى الله عليه وسلم عن أكل معاقرة الأعراب ‏.‏ قال أبو داود اسم أبي ريحانة عبد الله بن مطر وغندر أوقفه على ابن عباس ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Messenger of Allah (ﷺ) forbade to eat (the meat of animals) slaughtered by the bedouins for vainglory and pride.Abu Dawud said: The narrator Ghundar narrated this tradition as a saying of Ibn 'Abbas (and not of the Prophet).",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20224",
        "11298",
        "10696",
        "17"
      ]
    },
    {
      "id": "sunan-abi-daud-2922",
      "hadith_no": "2922",
      "source": "Sunan Abi Da'ud",
      "chapter": "Shares of Inheritance (Kitab Al-Fara'id) - كتاب الفرائض",
      "chapter_no": "19",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا أبو أسامة، حدثني إدريس بن يزيد، حدثنا طلحة بن مصرف، عن سعيد بن جبير، عن ابن عباس، في قوله ‏{‏ والذين عقدت أيمانكم فآتوهم نصيبهم ‏}‏ قال كان المهاجرون حين قدموا المدينة تورث الأنصار دون ذوي رحمه للأخوة التي آخى رسول الله صلى الله عليه وسلم بينهم فلما نزلت هذه الآية ‏{‏ ولكل جعلنا موالي مما ترك ‏}‏ قال نسختها ‏{‏ والذين عقدت أيمانكم فآتوهم نصيبهم ‏}‏ من النصرة والنصيحة والرفادة ويوصي له وقد ذهب الميراث ‏.‏",
      "text_en": " Ibn 'Abbas explained the following Qur'anic verse :                      \"To those also, to whom your right hand was pledged, give your portion.\" When the Emigrants came to Medina. they inherited from the Helpers without any blood-relationship with them for the brotherhood which the Messenger of Allah (ﷺ) established between them. When the following verse was revealed: \"To (benefit) everyone we have appointed shares and heirs to property left by parent and relatives.\" it abrogated the verse: \"To those also, to whom your right hand was pledged, give their due portion.\" This alliance was made for help, well wishing and cooperation. Now a legacy can be made for him. (The right to)inheritance was abolished.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20318",
        "11356",
        "11050"
      ]
    },
    {
      "id": "sunan-abi-daud-3028",
      "hadith_no": "3028",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا محمد بن أحمد القرشي، وهارون بن عبد الله، أن عبد الله بن الزبير، حدثهم حدثنا فرج بن سعيد، حدثني عمي، ثابت بن سعيد عن أبيه، سعيد - يعني ابن أبيض - عن جده، أبيض بن حمال أنه كلم رسول الله صلى الله عليه وسلم في الصدقة حين وفد عليه فقال ‏\"‏ يا أخا سبإ لا بد من صدقة ‏\"‏ ‏.‏ فقال إنما زرعنا القطن يا رسول الله وقد تبددت سبأ ولم يبق منهم إلا قليل بمأرب ‏.‏ فصالح نبي الله صلى الله عليه وسلم على سبعين حلة بز من قيمة وفاء بز المعافر كل سنة عمن بقي من سبإ بمأرب فلم يزالوا يؤدونها حتى قبض رسول الله صلى الله عليه وسلم وإن العمال انتقضوا عليهم بعد قبض رسول الله صلى الله عليه وسلم فيما صالح أبيض بن حمال رسول الله صلى الله عليه وسلم في الحلل السبعين فرد ذلك أبو بكر على ما وضعه رسول الله صلى الله عليه وسلم حتى مات أبو بكر فلما مات أبو بكر رضى الله عنه انتقض ذلك وصارت على الصدقة ‏.‏",
      "text_en": " Narrated Abyad ibn Hammal:                     Abyad spoke to the Messenger of Allah (ﷺ) about sadaqah when he came along with a deputation to him.  He replied: O brother of Saba', sadaqah is unavoidable.  He said: We cultivated cotton, Messenger of Allah. The people of Saba' scattered, and there remained only a few at Ma'arib. He therefore concluded a treaty of peace with the Messenger of Allah (ﷺ) to give seventy suits of cloth, equivalent to the price of the Yemeni garments known as al-mu'afir, to be paid every year on behalf of those people of Saba' who remained at Ma'arib. They continued to pay them till the Messenger of Allah (ﷺ) died. The governors after the death of the Messenger of Allah (ﷺ) broke the treaty concluded by Abyad by Hammal with the Messenger of Allah (ﷺ) to give seventy suits of garments. AbuBakr then revived it as the Messenger of Allah (ﷺ) had done till AbuBakr died. When AbuBakr died, it was discontinued and the sadaqah was levied.",
      "usc_msa_ref": "",
      "chain": [
        "32026",
        "30524"
      ]
    },
    {
      "id": "sunan-abi-daud-3057",
      "hadith_no": "3057",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا أبو داود، حدثنا عمران، عن قتادة، عن يزيد بن عبد الله بن الشخير، عن عياض بن حمار، قال أهديت للنبي صلى الله عليه وسلم ناقة فقال ‏\"‏ أسلمت ‏\"‏ ‏.‏ فقلت لا ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ إني نهيت عن زبد المشركين ‏\"‏ ‏.‏",
      "text_en": " Narrated Iyad ibn Himar:                     I presented a she-camel to the Prophet (ﷺ). He asked: Have you embraced Islam? I replied: No. The Prophet (ﷺ) said: I have been prohibited to accept the present of polytheists.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "30002",
        "123",
        "11019",
        "11318",
        "5217"
      ]
    },
    {
      "id": "sunan-abi-daud-3065",
      "hadith_no": "3065",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا هارون بن عبد الله، قال قال محمد بن الحسن المخزومي ‏\"‏ ما لم تنله أخفاف الإبل ‏\"‏ يعني أن الإبل تأكل منتهى رءوسها ويحمى ما فوقه ‏.‏",
      "text_en": " Muhammad bin Al hasan Al Mukhzumi said “The sentence “that which is not reached by the Camel hoofs” means that the Camels eat (the arak trees) within the reach of their heads. So the land (where the arak trees are growing) may be protected beyond such a region.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20004"
      ]
    },
    {
      "id": "sunan-abi-daud-3104",
      "hadith_no": "3104",
      "source": "Sunan Abi Da'ud",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا مكي بن إبراهيم، حدثنا الجعيد، عن عائشة بنت سعد، أن أباها، قال اشتكيت بمكة فجاءني النبي صلى الله عليه وسلم يعودني ووضع يده على جبهتي ثم مسح صدري وبطني ثم قال ‏\"‏ اللهم اشف سعدا وأتمم له هجرته ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Aishah daughter of Sa'd:                     That her father said: I had a complaint at Mecca. The Messenger of Allah (ﷺ) came to pay a sick-visit to me. He put his hand on my forehead, wiped my chest and belly, and then said: O Allah! heal up Sa'd and complete his immigration.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20202",
        "11679",
        "10559",
        "9"
      ]
    },
    {
      "id": "sunan-abi-daud-3169",
      "hadith_no": "3169",
      "source": "Sunan Abi Da'ud",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا هارون بن عبد الله، وعبد الرحمن بن حسين الهروي، قالا حدثنا المقرئ، حدثنا حيوة، حدثني أبو صخر، - وهو حميد بن زياد - أن يزيد بن عبد الله بن قسيط، حدثه أن داود بن عامر بن سعد بن أبي وقاص حدثه عن أبيه، أنه كان عند ابن عمر بن الخطاب إذ طلع خباب صاحب المقصورة فقال يا عبد الله بن عمر ألا تسمع ما يقول أبو هريرة إنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ من خرج مع جنازة من بيتها وصلى عليها ‏\"‏ ‏.‏ فذكر معنى حديث سفيان فأرسل ابن عمر إلى عائشة فقالت صدق أبو هريرة ‏.‏",
      "text_en": " Dawud b. 'Amir b. Sa'd b. Abi Waqqas said that his father 'Amir b. Sa'd was with Ibn 'Umar b. al-Khattab when Khabbab, the owner of the closet (maqsurah), came and said:                      'Abd Allah b.'Umar dont you hear what Abu Hurairah says ? He heard the Messenger of Allah (ﷺ) say: If anyone goes out of his house, accompanies bier and prays over it.... He then mentioned the rest of the tradition as narrated by Sufyan. Thereupon Ibn 'Umar sent someone to 'Aishah (asking her about it). She replied: Abu Hurairah spoke the truth.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "26010",
        "11841",
        "11236"
      ]
    },
    {
      "id": "sunan-abi-daud-3171",
      "hadith_no": "3171",
      "source": "Sunan Abi Da'ud",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا عبد الصمد، ح وحدثنا ابن المثنى، حدثنا أبو داود، قالا حدثنا حرب، - يعني ابن شداد - حدثنا يحيى، حدثني باب بن عمير، حدثني رجل، من أهل المدينة عن أبيه، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا تتبع الجنازة بصوت ولا نار ‏\"‏ ‏.‏ زاد هارون ‏\"‏ ولا يمشى بين يديها ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     The Prophet (said) said: A bier should not be followed by a loud voice (of wailing) or fire.Abu Dawud said: Harun (one of the narrators) added: \"And it should not be preceded (with those) either.\"",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20250",
        "30170",
        "30002",
        "20220",
        "11449",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-3190",
      "hadith_no": "3190",
      "source": "Sunan Abi Da'ud",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا ابن أبي فديك، عن الضحاك، - يعني ابن عثمان - عن أبي النضر، عن أبي سلمة، عن عائشة، قالت والله لقد صلى رسول الله صلى الله عليه وسلم على ابنى بيضاء في المسجد سهيل وأخيه ‏.‏",
      "text_en": " Narrated 'Aishah:                     I swear by Allah, the Messenger of Allah (ﷺ) prayed in the mosque over the two sons of al-Baida': Suhail and his brother.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20172",
        "20504",
        "11164",
        "10567",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-3260",
      "hadith_no": "3260",
      "source": "Sunan Abi Da'ud",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا عمر بن حفص، حدثنا أبي، عن محمد بن أبي يحيى، عن يزيد الأعور، عن يوسف بن عبد الله بن سلام، مثله ‏.‏",
      "text_en": " A similar tradition has also been transmitted by Yusuf b. 'Abd Allah b. Salam through a different chain of narrators.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "30204",
        "20317"
      ]
    },
    {
      "id": "sunan-abi-daud-3402",
      "hadith_no": "3402",
      "source": "Sunan Abi Da'ud",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا الفضل بن دكين، حدثنا بكير، - يعني ابن عامر - عن ابن أبي نعم، حدثني رافع بن خديج، أنه زرع أرضا فمر به النبي صلى الله عليه وسلم وهو يسقيها فسأله ‏\"‏ لمن الزرع ولمن الأرض ‏\"‏ ‏.‏ فقال زرعي ببذري وعملي لي الشطر ولبني فلان الشطر ‏.‏ فقال ‏\"‏ أربيتما فرد الأرض على أهلها وخذ نفقتك ‏\"‏ ‏.‏",
      "text_en": " Narrated Rafi' ibn Khadij:                     Rafi' had cultivated a land. The Prophet (ﷺ) passed him when he was watering it. So he asked him: To whom does the crop belong, and to whom does the land belong? He replied: The crop is mine for my seed and labour. The half (of the crop) is mine and the half for so-and-so. He said: You conducted usurious transaction. Return the land to its owner and take your wages and cost.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20348",
        "11366",
        "1986"
      ]
    },
    {
      "id": "sunan-abi-daud-3426",
      "hadith_no": "3426",
      "source": "Sunan Abi Da'ud",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا هاشم بن القاسم، حدثنا عكرمة، حدثني طارق بن عبد الرحمن القرشي، قال جاء رافع بن رفاعة إلى مجلس الأنصار فقال لقد نهانا نبي الله صلى الله عليه وسلم اليوم فذكر أشياء ونهانا عن كسب الأمة إلا ما عملت بيدها ‏.‏ وقال هكذا بأصابعه نحو الخبز والغزل والنفش ‏.‏",
      "text_en": " Narrated Tariq ibn AbdurRahman al-Qarash:                     Rafi' ibn Rifa'ah came to a meeting of the Ansar and said: The Prophet of Allah (ﷺ) forbade us (from some things) today, and he mentioned some things. He forbade the earning of a slave-girl except what she earned with her hand. He indicated (some things) with his fingers such as baking, spinning, and ginning.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20390",
        "11023"
      ]
    },
    {
      "id": "sunan-abi-daud-3507",
      "hadith_no": "3507",
      "source": "Sunan Abi Da'ud",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا هارون بن عبد الله، حدثني عبد الصمد، حدثنا همام، عن قتادة، بإسناده ومعناه زاد إن وجد داء في الثلاث الليالي رد بغير بينة وإن وجد داء بعد الثلاث كلف البينة أنه اشتراه وبه هذا الداء ‏.‏ قال أبو داود هذا التفسير من كلام قتادة ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Qatadah through a different chain of narrators to the same effect. This version adds:                      \"If he finds defect (in the slave) within three days, he may return it without evidence; if he finds a defect after three days, he will be required to produce evidence that he (the slave) had the defect when he bought it.\" Abu Dawud said: This explanation is from the words of Qatadah.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20250",
        "20297",
        "30002"
      ]
    },
    {
      "id": "sunan-abi-daud-3780",
      "hadith_no": "3780",
      "source": "Sunan Abi Da'ud",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا أبو داود، عن زهير، عن أبي إسحاق، عن سعد بن عياض، عن عبد الله بن مسعود، قال كان أحب العراق إلى رسول الله صلى الله عليه وسلم عراق الشاة ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     The bone dearer to the Messenger of Allah (ﷺ) was the bone of sheep.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "30002",
        "20321",
        "11049",
        "16"
      ]
    },
    {
      "id": "sunan-abi-daud-3817",
      "hadith_no": "3817",
      "source": "Sunan Abi Da'ud",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا الفضل بن دكين، حدثنا عقبة بن وهب بن عقبة العامري، قال سمعت أبي يحدث، عن الفجيع العامري، أنه أتى رسول الله صلى الله عليه وسلم فقال ما يحل لنا من الميتة قال ‏\"‏ ما طعامكم ‏\"‏ ‏.‏ قلنا نغتبق ونصطبح ‏.‏ قال أبو نعيم فسره لي عقبة قدح غدوة وقدح عشية ‏.‏ قال ‏\"‏ ذاك - وأبي - الجوع ‏\"‏ ‏.‏ فأحل لهم الميتة على هذه الحال ‏.‏ قال أبو داود الغبوق من آخر النهار والصبوح من أول النهار ‏.‏",
      "text_en": " Narrated Al-Faji' ibn Abdullah al-Amiri:                     Al-Faji' came to the Messenger of Allah (ﷺ) and asked: Is not dead meat lawful for us? He said: What is your food? We said: Some food in the evening and some in the morning. AbuNu'aym said: Uqbah explained it to me saying: a cup (of milk) in the morning and a cup in the evening; this does not satisfy the hunger. So made the carrion lawful for them in this condition.Abu Dawud said: Ghabuq is a drink in the evening and Sabuh is a drink in the morning.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20348"
      ]
    },
    {
      "id": "sunan-abi-daud-3830",
      "hadith_no": "3830",
      "source": "Sunan Abi Da'ud",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا عمر بن حفص، حدثنا أبي، عن محمد بن أبي يحيى، عن يزيد الأعور، عن يوسف بن عبد الله بن سلام، قال رأيت النبي صلى الله عليه وسلم أخذ كسرة من خبز شعير فوضع عليها تمرة وقال ‏\"‏ هذه إدام هذه ‏\"‏ ‏.‏",
      "text_en": " Narrated Yusuf ibn Abdullah ibn Salam:                     I saw that the Prophet (ﷺ) took a piece of break of barley and put a date on it and said: This is the condiment of this.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "30204",
        "20317",
        "5335"
      ]
    },
    {
      "id": "sunan-abi-daud-3856",
      "hadith_no": "3856",
      "source": "Sunan Abi Da'ud",
      "chapter": "Medicine (Kitab Al-Tibb) - كتاب الطب",
      "chapter_no": "29",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا أبو داود، وأبو عامر - وهذا لفظ أبي عامر - عن فليح بن سليمان، عن أيوب بن عبد الرحمن بن صعصعة الأنصاري، عن يعقوب بن أبي يعقوب، عن أم المنذر بنت قيس الأنصارية، قالت دخل على رسول الله صلى الله عليه وسلم ومعه علي عليه السلام وعلي ناقه ولنا دوالي معلقة فقام رسول الله صلى الله عليه وسلم يأكل منها وقام علي ليأكل فطفق رسول الله صلى الله عليه وسلم يقول لعلي ‏\"‏ مه إنك ناقه ‏\"‏ ‏.‏ حتى كف علي عليه السلام ‏.‏ قالت وصنعت شعيرا وسلقا فجئت به فقال رسول الله صلى الله عليه وسلم ‏\"‏ يا علي أصب من هذا فهو أنفع لك ‏\"‏ ‏.‏ قال أبو داود قال هارون العدوية ‏.‏",
      "text_en": " Narrated Umm al-Mundhar bint Qays al-Ansariyyah:                     The Messenger of Allah (ﷺ) came to visit me, accompanied by Ali who was convalescing. We had some ripe dates hung up. The Messenger of Allah (ﷺ) got up and began to eat from them.  Ali also got up to eat, but the Messenger of Allah (ﷺ) said repeatedly to Ali: Stop, Ali, for you are convalescing, and Ali stopped.  She said: I then prepared some barley and beer-root and brought it.  The Messenger of Allah (ﷺ) then said: Take some of this, Ali, for it will be more beneficial for you.  AbuDawud said: The narrator Harun said: al-Adawiyyah (i.e. Umm al-Mundhar).",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "30002",
        "20443",
        "20169",
        "12604"
      ]
    },
    {
      "id": "sunan-abi-daud-3870",
      "hadith_no": "3870",
      "source": "Sunan Abi Da'ud",
      "chapter": "Medicine (Kitab Al-Tibb) - كتاب الطب",
      "chapter_no": "29",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا محمد بن بشر، حدثنا يونس بن أبي إسحاق، عن مجاهد، عن أبي هريرة، قال نهى رسول الله صلى الله عليه وسلم عن الدواء الخبيث ‏.‏",
      "text_en": " Narrated Abu Hurayrah:                     The Messenger of Allah (ﷺ) prohibited unclean medicine.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20352",
        "10846",
        "11028",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-3926",
      "hadith_no": "3926",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Book of Manumission of Slaves - كتاب العتق",
      "chapter_no": "31",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا أبو بدر، حدثني أبو عتبة، إسماعيل بن عياش حدثني سليمان بن سليم، عن عمرو بن شعيب، عن أبيه، عن جده، عن النبي صلى الله عليه وسلم قال ‏\"‏ المكاتب عبد ما بقي عليه من مكاتبته درهم ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Amr b. Shu'aib:                     on his father's authority, told that his grandfather reported the Prophet (ﷺ) said: A slave who has entered into an agreement to purchase his freedom is a slave as long as a dirham of the agreed price remains to be paid.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "36577",
        "20730",
        "19934",
        "19911"
      ]
    },
    {
      "id": "sunan-abi-daud-3988",
      "hadith_no": "3988",
      "source": "Sunan Abi Da'ud",
      "chapter": "Dialects and Readings of the Qur'an (Kitab Al-Huruf Wa Al-Qira'at) - كتاب الحروف والقراءات",
      "chapter_no": "32",
      "text_ar": "حدثنا عثمان بن أبي شيبة، وهارون بن عبد الله، قالا حدثنا أبو أسامة، حدثني الحسن بن الحكم النخعي، حدثنا أبو سبرة النخعي، عن فروة بن مسيك الغطيفي، قال أتيت النبي صلى الله عليه وسلم فذكر الحديث فقال رجل من القوم يا رسول الله أخبرنا عن سبإ ما هو أرض أم امرأة فقال ‏\"‏ ليس بأرض ولا امرأة ولكنه رجل ولد عشرة من العرب فتيامن ستة وتشاءم أربعة ‏\"‏ ‏.‏ قال عثمان الغطفاني مكان الغطيفي وقال حدثنا الحسن بن الحكم النخعي ‏.‏",
      "text_en": " Narrated Farwah ibn Musayk al-Ghutayfi:                     I came to the Prophet (ﷺ). He then narrated the rest of the tradition. A man from the people said: \"Messenger of Allah! tell us about Saba'; what is it: land or woman? He replied: It is neither land nor woman; it is a man to whom ten children of the Arabs were born: six of them lived in the Yemen and four lived in Syria. The narrator Uthman said al-Ghatafani instead of al-Ghutayfi. He said: It has been transmitted to us by al-Hasan ibn al-Hakam an-Nakha'i.",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "30524",
        "20318",
        "15089",
        "15674",
        "5226"
      ]
    },
    {
      "id": "sunan-abi-daud-4089",
      "hadith_no": "4089",
      "source": "Sunan Abi Da'ud",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا أبو عامر، - يعني عبد الملك بن عمرو - حدثنا هشام بن سعد، عن قيس بن بشر التغلبي، قال أخبرني أبي، - وكان جليسا لأبي الدرداء - قال كان بدمشق رجل من أصحاب النبي صلى الله عليه وسلم يقال له ابن الحنظلية وكان رجلا متوحدا قلما يجالس الناس إنما هو صلاة فإذا فرغ فإنما هو تسبيح وتكبير حتى يأتي أهله فمر بنا ونحن عند أبي الدرداء فقال له أبو الدرداء كلمة تنفعنا ولا تضرك قال بعث رسول الله صلى الله عليه وسلم سرية فقدمت فجاء رجل منهم فجلس في المجلس الذي يجلس فيه رسول الله صلى الله عليه وسلم فقال لرجل إلى جنبه لو رأيتنا حين التقينا نحن والعدو فحمل فلان فطعن فقال خذها مني وأنا الغلام الغفاري كيف ترى في قوله قال ما أراه إلا قد بطل أجره فسمع بذلك آخر فقال ما أرى بذلك بأسا فتنازعا حتى سمع رسول الله صلى الله عليه وسلم فقال ‏\"‏ سبحان الله لا بأس أن يؤجر ويحمد ‏\"‏ ‏.‏ فرأيت أبا الدرداء سر بذلك وجعل يرفع رأسه إليه ويقول أنت سمعت ذلك من رسول الله صلى الله عليه وسلم فيقول نعم ‏.‏ فما زال يعيد عليه حتى إني لأقول ليبركن على ركبتيه ‏.‏ قال فمر بنا يوما آخر فقال له أبو الدرداء كلمة تنفعنا ولا تضرك قال قال لنا رسول الله صلى الله عليه وسلم ‏\"‏ المنفق على الخيل كالباسط يده بالصدقة لا يقبضها ‏\"‏ ‏.‏ ثم مر بنا يوما آخر فقال له أبو الدرداء كلمة تنفعنا ولا تضرك ‏.‏ قال قال لنا رسول الله صلى الله عليه وسلم ‏\"‏ نعم الرجل خريم الأسدي لولا طول جمته وإسبال إزاره ‏\"‏ ‏.‏ فبلغ ذلك خريما فعجل فأخذ شفرة فقطع بها جمته إلى أذنيه ورفع إزاره إلى أنصاف ساقيه ‏.‏ ثم مر بنا يوما آخر فقال له أبو الدرداء كلمة تنفعنا ولا تضرك فقال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إنكم قادمون على إخوانكم فأصلحوا رحالكم وأصلحوا لباسكم حتى تكونوا كأنكم شامة في الناس فإن الله لا يحب الفحش ولا التفحش ‏\"‏ ‏.‏ قال أبو داود وكذلك قال أبو نعيم عن هشام قال حتى تكونوا كالشامة في الناس ‏.‏",
      "text_en": " Narrated Qays ibn Bishr at-Taghlibi:                     My father told me that he was a companion of Abu Darda'. There was in Damascus a man from the companions of the Prophet (ﷺ), called Ibn al-Hanzaliyyah. He was a recluse and rarely met the people. He remained engaged in prayer. When he was not praying he was occupied in glorifying Allah and exalting Him until he went to his family. Once he passed us when we were with AbudDarda'.  AbudDarda' said to him: Tell us a word which benefits us and does not harm you.  He said: The Messenger of Allah (ﷺ) sent out a contingent and it came back. One of the men came and sat in the place where the Messenger of Allah (ﷺ) used to sit, and he said to a man beside him: Would that you saw us when we met the enemy and so-and-so attacked and cut through a lance.  He said: Take it from me and I am a boy of the tribe Ghifar. What do you think about his statement?  He replied: I think his reward was lost.  Another man heard it and said: I do not think that there is any harm in it.  They quarrelled until the Messenger of Allah (ﷺ) heard it, and he said: Glory be to Allah! There is no harm if he is rewarded and praised. I saw that AbudDarda' was pleased with it and began to raise his hand to him and say: Did you hear it from the Messenger of Allah (ﷺ)?  He said: Yes. He continued to repeat it to him so often that I thought he was going to kneel down. He said: On another day he again passed us.  AbudDarda' said to him: (Tell us) a word which benefits us and does not harm you.  He said: The Messenger of Allah (ﷺ) said to us: One who spends on (the maintenance of) horses (for jihad) is like the one who spreads his hand to give alms (sadaqah) and does not withhold it. He then passed us on another day.  AbudDarda' said to him: (Tell us) a word which benefits us and does no harm to you.  He said: The Messenger of Allah (ﷺ) said: Khuraym al-Asadi would be a fine man were it not for the length of his hair, which reaches the shoulders, and the way he lets his lower garment hang down. When Khuraym heard that, he hurriedly, took a knife, cut his hair in line with his ears and raised his lower garment half way up his legs. He then passed us on another day.  AbudDarda' said to him: (tell us) a word which benefits us and does not harm you.  He said: I heard the Messenger of Allah (ﷺ) say: You are coming to your brethren; so tidy your mounts and tidy your dress, until you are like a mole among the people. Allah does not like obscene words or deeds, or do intentional committing of obscenity.Abu Dawud said: Similarly, Abu Nu'aim narrated from Hisham. He said: Until you will be like a mole among the people.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20443",
        "20519"
      ]
    },
    {
      "id": "sunan-abi-daud-4180",
      "hadith_no": "4180",
      "source": "Sunan Abi Da'ud",
      "chapter": "Combing the Hair (Kitab Al-Tarajjul) - كتاب الترجل",
      "chapter_no": "35",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا عبد العزيز بن عبد الله الأويسي، حدثنا سليمان بن بلال، عن ثور بن زيد، عن الحسن بن أبي الحسن، عن عمار بن ياسر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ثلاثة لا تقربهم الملائكة جيفة الكافر والمتضمخ بالخلوق والجنب إلا أن يتوضأ ‏\"‏ ‏.‏",
      "text_en": " Narrated Ammar ibn Yasir:                     The Prophet (ﷺ) said: The angels do not come near three: the dead body of the unbeliever, one who smears himself with khaluq, and the one who is sexually defiled except that he performs ablution.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "30105",
        "20160",
        "11155",
        "11016",
        "25"
      ]
    },
    {
      "id": "sunan-abi-daud-4241",
      "hadith_no": "4241",
      "source": "Sunan Abi Da'ud",
      "chapter": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim) - كتاب الفتن والملاحم",
      "chapter_no": "37",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا أبو داود الحفري، عن بدر بن عثمان، عن عامر، عن رجل، عن عبد الله، عن النبي صلى الله عليه وسلم قال ‏\"‏ يكون في هذه الأمة أربع فتن في آخرها الفناء ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     The Prophet (ﷺ) said: four (majestic) trials (fitnahs) will take place among this community, and in their end there will be destruction.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20668",
        "10745",
        "11052",
        "18"
      ]
    },
    {
      "id": "sunan-abi-daud-4287",
      "hadith_no": "4287",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Promised Deliverer (Kitab Al-Mahdi) - كتاب المهدى",
      "chapter_no": "38",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا عبد الصمد، عن همام، عن قتادة، بهذا الحديث وقال ‏\"‏ تسع سنين ‏\"‏ ‏.‏ قال أبو داود وقال غير معاذ عن هشام ‏\"‏ تسع سنين ‏\"‏ ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Qatadah through a different chain of narrators. This version has \"nine years\".Abu Dawud said:                      The other narrators mentioned \"nine years\" from Hisham except Mu'adh.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20250",
        "20297",
        "11019",
        "30002"
      ]
    },
    {
      "id": "sunan-abi-daud-4301",
      "hadith_no": "4301",
      "source": "Sunan Abi Da'ud",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا عبد الوهاب بن نجدة، حدثنا إسماعيل، ح وحدثنا هارون بن عبد الله، حدثنا الحسن بن سوار، حدثنا إسماعيل، حدثنا سليمان بن سليم، عن يحيى بن جابر الطائي، - قال هارون في حديثه - عن عوف بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لن يجمع الله على هذه الأمة سيفين سيفا منها وسيفا من عدوها ‏\"‏ ‏.‏",
      "text_en": " Narrated Awf ibn Malik:                     The Prophet (ﷺ) said: Allah will not gather two swords upon this community: Its own sword and the sword of its enemy.",
      "usc_msa_ref": "",
      "chain": [
        "38363",
        "30103",
        "30524",
        "28100",
        "11418",
        "20730",
        "10978",
        "10805"
      ]
    },
    {
      "id": "sunan-abi-daud-4343",
      "hadith_no": "4343",
      "source": "Sunan Abi Da'ud",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا الفضل بن دكين، حدثنا يونس بن أبي إسحاق، عن هلال بن خباب أبي العلاء، قال حدثني عكرمة، حدثني عبد الله بن عمرو بن العاص، قال بينما نحن حول رسول الله صلى الله عليه وسلم إذ ذكر الفتنة فقال ‏\"‏ إذا رأيتم الناس قد مرجت عهودهم وخفت أماناتهم وكانوا هكذا ‏\"‏ ‏.‏ وشبك بين أصابعه قال فقمت إليه فقلت كيف أفعل عند ذلك جعلني الله فداك قال ‏\"‏ الزم بيتك واملك عليك لسانك وخذ بما تعرف ودع ما تنكر وعليك بأمر خاصة نفسك ودع عنك أمر العامة ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     When we were around the Messenger of Allah (ﷺ), he mentioned the period of commotion (fitnah) saying: When you see the people that their covenants have been impaired, (the fulfilling of) the guarantees becomes rare, and they become thus (interwining his fingers). I then got up and said: What should I do at that time, may Allah make me ransom for you? He replied: Keep to your house, control your tongue, accept what you approve, abandon what you disapprove, attend to your own affairs, and leave alone the affairs of the generality.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20348",
        "10846",
        "11312",
        "11023",
        "29"
      ]
    },
    {
      "id": "sunan-abi-daud-4509",
      "hadith_no": "4509",
      "source": "Sunan Abi Da'ud",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا داود بن رشيد، حدثنا عباد بن العوام، ح وحدثنا هارون بن عبد الله، حدثنا سعيد بن سليمان، حدثنا عباد، عن سفيان بن حسين، عن الزهري، عن سعيد، وأبي، سلمة - قال هارون - عن أبي هريرة، أن امرأة، من اليهود أهدت إلى النبي صلى الله عليه وسلم شاة مسمومة - قال - فما عرض لها النبي صلى الله عليه وسلم ‏.‏ قال أبو داود هذه أخت مرحب اليهودية التي سمت النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     A Jewess presented a poisoned sheep to the Prophet (ﷺ), but the Prophet (ﷺ) did not interfere with he.Abu Dawud said: The Jewess who poisoned the Prophet (ﷺ) was sister of Marhab.",
      "usc_msa_ref": "",
      "chain": [
        "30248",
        "20431",
        "30524",
        "30252",
        "20431",
        "20655",
        "11013",
        "11168",
        "10567",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-4772",
      "hadith_no": "4772",
      "source": "Sunan Abi Da'ud",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا أبو داود الطيالسي، وسليمان بن داود، - يعني أبا أيوب الهاشمي - عن إبراهيم بن سعد، عن أبيه، عن أبي عبيدة بن محمد بن عمار بن ياسر، عن طلحة بن عبد الله بن عوف، عن سعيد بن زيد، عن النبي صلى الله عليه وسلم قال ‏:‏ ‏\"‏ من قتل دون ماله فهو شهيد، ومن قتل دون أهله أو دون دمه أو دون دينه فهو شهيد ‏\"‏ ‏.‏",
      "text_en": " Narrated Sa'id ibn Zayd:                     The Prophet (ﷺ) said: He who is killed while protecting his property is a martyr, and he who is killed while defending his family, or his blood, or his religion is a martyr.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20547",
        "30584",
        "20150",
        "11063",
        "19954",
        "11043",
        "11"
      ]
    },
    {
      "id": "sunan-abi-daud-4775",
      "hadith_no": "4775",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا أبو عامر، حدثنا محمد بن هلال، سمع أباه، يحدث قال قال أبو هريرة وهو يحدثنا كان النبي صلى الله عليه وسلم يجلس معنا في المجلس يحدثنا فإذا قام قمنا قياما حتى نراه قد دخل بعض بيوت أزواجه فحدثنا يوما فقمنا حين قام فنظرنا إلى أعرابي قد أدركه فجبذه بردائه فحمر رقبته قال أبو هريرة وكان رداء خشنا فالتفت فقال له الأعرابي احمل لي على بعيرى هذين فإنك لا تحمل لي من مالك ولا من مال أبيك ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ لا وأستغفر الله لا وأستغفر الله لا وأستغفر الله لا أحمل لك حتى تقيدني من جبذتك التي جبذتني ‏\"‏ ‏.‏ فكل ذلك يقول له الأعرابي والله لا أقيدكها ‏.‏ فذكر الحديث قال ثم دعا رجلا فقال له ‏\"‏ احمل له على بعيريه هذين على بعير شعيرا وعلى الآخر تمرا ‏\"‏ ‏.‏ ثم التفت إلينا فقال ‏\"‏ انصرفوا على بركة الله تعالى ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Messenger of Allah (ﷺ) used to sit with us in meetings and talk to us. When he stood up we also used to stand up and see him entering the house of one of his wives. One day he talked to us and we stood up as he stood up and we saw that an Arabi (a nomadic Arab) caught hold of him and gave his cloak a violent tug making his neck red.  AbuHurayrah said: The cloak was coarse. He turned to him and the Arabi said to him: Load these two camels of mine, for you do not give me anything from your property or from your father's property.  The Prophet (ﷺ) said to him: No, I ask Allah's forgiveness; no, I ask Allah's forgiveness; no, I ask Allah's forgiveness. I shall not give you the camel-load until you make amends for the way in which you tugged at me.  Each time the Arabi said to him: I swear by Allah, I shall not do so.  He then mentioned the rest of the tradition. He (the Prophet), then called a man and said to him: Load these two camels of his: one camel with barley and the other with dates. He then turned to us and said: Go on your way with the blessing of Allah.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20443",
        "12489"
      ]
    },
    {
      "id": "sunan-abi-daud-4928",
      "hadith_no": "4928",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا هارون بن عبد الله، ومحمد بن العلاء، أن أبا أسامة، أخبرهم عن مفضل بن يونس، عن الأوزاعي، عن أبي يسار القرشي، عن أبي هاشم، عن أبي هريرة، أن النبي صلى الله عليه وسلم أتي بمخنث قد خضب يديه ورجليه بالحناء فقال النبي صلى الله عليه وسلم ‏\"‏ ما بال هذا ‏\"‏ ‏.‏ فقيل يا رسول الله يتشبه بالنساء ‏.‏ فأمر به فنفي إلى النقيع فقالوا يا رسول الله ألا نقتله فقال ‏\"‏ إني نهيت عن قتل المصلين ‏\"‏ ‏.‏ قال أبو أسامة والنقيع ناحية عن المدينة وليس بالبقيع ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     Am effeminate man (mukhannath) who had dyed his hands and feet with henna was brought to the Prophet (ﷺ). He asked: What  is the matter with this man? He was told: \"Messenger of Allah! He imitates the look of women.\" So he issued an order regarding him and he was banished to an-Naqi'. The people said: Messenger of Allah! Should we not kill him? He said: I have been prohibited from killing people who pray. AbuUsamah said: Naqi' is a region near Medina and not a Baqi'.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "30216",
        "20318",
        "25313",
        "20024",
        "11454",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-4950",
      "hadith_no": "4950",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا هشام بن سعيد الطالقاني، أخبرنا محمد بن المهاجر الأنصاري، قال حدثني عقيل بن شبيب، عن أبي وهب الجشمي، وكانت، له صحبة قال قال رسول الله صلى الله عليه وسلم ‏\"‏ تسموا بأسماء الأنبياء وأحب الأسماء إلى الله عبد الله وعبد الرحمن وأصدقها حارث وهمام وأقبحها حرب ومرة ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuWahb al-Jushami:                     The Prophet (ﷺ) said: Call yourselves by the names of the Prophets. The names dearest to Allah are Abdullah and AbdurRahman, the truest are Harith and Hammam, and the worst are Harb and Murrah.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "26529",
        "18745"
      ]
    },
    {
      "id": "sunan-abi-daud-5036",
      "hadith_no": "5036",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا مالك بن إسماعيل، حدثنا عبد السلام بن حرب، عن يزيد بن عبد الرحمن، عن يحيى بن إسحاق بن عبد الله بن أبي طلحة، عن أمه، حميدة أو عبيدة بنت عبيد بن رفاعة الزرقي عن أبيها، عن النبي صلى الله عليه وسلم قال ‏\"‏ تشمت العاطس ثلاثا فإن شئت أن تشمته فشمته وإن شئت فكف ‏\"‏ ‏.‏",
      "text_en": " Narrated Ubayd ibn Rifa'ah az-Zuraqi:                     The Prophet (ﷺ) said: Invoke a blessing on one who sneezes three times; (and if he sneezes more often), then if you wish to invoke a blessing on him, you may invoke, and if you wish (to stop), then stop.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20357",
        "20248",
        "30525"
      ]
    },
    {
      "id": "sunan-abi-daud-5175",
      "hadith_no": "5175",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا أبو داود الحفري، عن سفيان، عن الأعمش، عن طلحة بن مصرف، عن رجل، عن سعد، نحوه عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " A similar tradition has also been transmitted by Talhah b. Musarrif from a man from Sa’d from the prophet (May peace be upon him) through a different chain of narrators.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20668",
        "20012",
        "11060",
        "11356",
        "9"
      ]
    },
    {
      "id": "sunan-an-nasai-62",
      "hadith_no": "62",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرني هارون بن عبد الله، قال حدثنا معن، قال حدثنا معاوية بن صالح، عن حبيب بن عبيد، عن جبير بن نفير، قال شهدت عوف بن مالك يقول سمعت رسول الله صلى الله عليه وسلم يصلي على ميت فسمعت من دعائه وهو يقول ‏\"‏ اللهم اغفر له وارحمه وعافه واعف عنه وأكرم نزله وأوسع مدخله واغسله بالماء والثلج والبرد ونقه من الخطايا كما ينقى الثوب الأبيض من الدنس ‏\"‏ ‏.‏",
      "text_en": " 'Awf bin Malik said:                      \"I heard the Messenger of Allah (ﷺ) offering the (funeral) prayer for one who had died, and I heard him say in his supplication: 'Allahummaghfir lahu warhamhu wa 'afihi was a'fu 'anhu, wa akrim nuzulahu wa wassi' ,adkhalahu waghsilhu bil-ma'i wath-thalji wal-baradi wa naqqihi min al-khataya kama ynaqqath-thawb al-abyad min ad-danas. (O Allah, forgive him and have mercy on him, keep him safe and sound and forgive him, honor the place where he settles and make his entrance wide; wash him with water and snow and hail, and cleanse him of sin as a white garment is cleansed of dirt).\"",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "30112",
        "20675",
        "10899",
        "4097"
      ]
    },
    {
      "id": "sunan-an-nasai-71",
      "hadith_no": "71",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرني هارون بن عبد الله، قال حدثنا معن، قال حدثنا مالك، ح والحارث بن مسكين قراءة عليه وأنا أسمع، عن ابن القاسم، قال حدثني مالك، عن نافع، عن ابن عمر، قال كان الرجال والنساء يتوضئون في زمان رسول الله صلى الله عليه وسلم جميعا ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                      \"Men and women used to perform Wudu' together during the time of the Messenger of Allah (ﷺ).\"",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "30112",
        "20001",
        "36017",
        "30234",
        "20001",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-164",
      "hadith_no": "164",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا هارون بن عبد الله، حدثنا معن، أنبأنا مالك، ح والحارث بن مسكين قراءة عليه وأنا أسمع، عن ابن القاسم، قال أنبأنا مالك، عن عبد الله بن أبي بكر بن محمد بن عمرو بن حزم، أنه سمع عروة بن الزبير، يقول دخلت على مروان بن الحكم فذكرنا ما يكون منه الوضوء فقال مروان من مس الذكر الوضوء ‏.‏ فقال عروة ما علمت ذلك ‏.‏ فقال مروان أخبرتني بسرة بنت صفوان أنها سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إذا مس أحدكم ذكره فليتوضأ ‏\"‏ ‏.‏",
      "text_en": " 'Urwah bin Az-Zubair said:                      \"I entered upon Mawan bin Al-Hakam and we mentioned the things for which Wudu' is done. Marwan said: 'Wudu' should be done after touching the penis.' 'Urwah said: 'I did not know that.' Marwan said: 'Busrah bint Safwan told me that she heard the Messenger of Allah (ﷺ) say: \"And if any one of you touches his penis, let him do Wudu'.\"",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "30112",
        "20001",
        "36017",
        "30234",
        "20001",
        "11104",
        "10511"
      ]
    },
    {
      "id": "sunan-an-nasai-178",
      "hadith_no": "178",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا عبيد الله بن سعيد، وهارون بن عبد الله، قالا حدثنا حرمي، - وهو ابن عمارة بن أبي حفصة - قال حدثنا شعبة، عن عمرو بن دينار، قال سمعت يحيى بن جعدة، يحدث عن عبد الله بن عمرو القاري، عن أبي طلحة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ توضئوا مما غيرت النار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Talhah that the Messenger of Allah (ﷺ) said:                      \"Perform Wudu' from that which has been altered by fire.\"",
      "usc_msa_ref": "",
      "chain": [
        "30359",
        "30524",
        "20221",
        "20020",
        "11081",
        "229"
      ]
    },
    {
      "id": "sunan-an-nasai-179",
      "hadith_no": "179",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا هارون بن عبد الله، قال حدثنا حرمي بن عمارة، قال حدثنا شعبة، عن أبي بكر بن حفص، عن ابن شهاب، عن ابن أبي طلحة، عن أبي طلحة، أن النبي صلى الله عليه وسلم قال ‏\"‏ توضئوا مما أنضجت النار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Talhah that the Prophet (ﷺ) said:                      \"Perform Wudu' from that which has been heated with fire.\"",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20221",
        "20020",
        "11180",
        "11013",
        "229"
      ]
    },
    {
      "id": "sunan-an-nasai-326-2",
      "hadith_no": "326",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Water - كتاب المياه",
      "chapter_no": "2",
      "text_ar": "أخبرنا هارون بن عبد الله، قال حدثنا أبو أسامة، قال حدثنا الوليد بن كثير، قال حدثنا محمد بن كعب القرظي، عن عبيد الله بن عبد الرحمن بن رافع، عن أبي سعيد الخدري، قال قيل يا رسول الله أتتوضأ من بئر بضاعة وهي بئر يطرح فيها لحوم الكلاب والحيض والنتن فقال ‏\"‏ الماء طهور لا ينجسه شىء ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Sa'eed Al-Khudri said:                      \"It was said: 'O Messenger of Allah, you perform Wudu' from the well into which the bodies of dogs, menstrual rags and garbage are thrown?' He said: 'Water is pure and it is not made impure by anything.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20318",
        "11230",
        "11221",
        "38"
      ]
    },
    {
      "id": "sunan-an-nasai-342",
      "hadith_no": "342",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Water - كتاب المياه",
      "chapter_no": "2",
      "text_ar": "أخبرنا هارون بن عبد الله، قال حدثنا معن، قال حدثنا مالك، عن نافع، عن ابن عمر، قال كان الرجال والنساء يتوضئون في زمان رسول الله صلى الله عليه وسلم جميعا ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                      \"Men and women used to perform Wudu' together during the time of the Messenger of Allah (ﷺ).\"",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "30112",
        "20001",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-788",
      "hadith_no": "788",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا هارون بن عبد الله، قال حدثنا معن، قال حدثنا مالك، ح قال وحدثنا الحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن القاسم، قال حدثني مالك، عن ابن شهاب، عن محمود بن الربيع، ‏.‏ أن عتبان بن مالك، كان يؤم قومه وهو أعمى وأنه قال لرسول الله صلى الله عليه وسلم إنها تكون الظلمة والمطر والسيل وأنا رجل ضرير البصر فصل يا رسول الله في بيتي مكانا أتخذه مصلى ‏.‏ فجاء رسول الله صلى الله عليه وسلم فقال ‏\"‏ أين تحب أن أصلي لك ‏\"‏ ‏.‏ فأشار إلى مكان من البيت فصلى فيه رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated from Mahmiid bin Ar-Rabi' that 'Itbk bin Milk used to lead his people in prayer, and he was blind. He said to theMessenger of Allah (ﷺ):                     \"Sometimes it is dark or rainy or there is a flood, and I am a blindman; 0 Messenger of Allah (ﷺ), (come and) pray in a place in my house that I may take as a prayer-place.\" He said: \"Where would you likeme to pray for you?\" He showed him a place in his house, and the Messenger of Allah (ﷺ) prayed there.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "30112",
        "20001",
        "36017",
        "30234",
        "20001",
        "11013",
        "5278",
        "251"
      ]
    },
    {
      "id": "sunan-an-nasai-863",
      "hadith_no": "863",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا هارون بن عبد الله، قال حدثنا معاوية بن عمرو، قال حدثنا أبو إسحاق، عن ابن جريج، قال أخبرني منبوذ، - رجل من آل أبي رافع - عن الفضل بن عبيد الله بن أبي رافع، عن أبي رافع، نحوه ‏.‏",
      "text_en": " (Another chain) with similar from  Abu Rafi.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20389",
        "11049",
        "11070",
        "479"
      ]
    },
    {
      "id": "sunan-an-nasai-923",
      "hadith_no": "923",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرني هارون بن عبد الله، قال حدثنا زيد بن الحباب، قال حدثنا معاوية بن صالح، قال حدثني أبو الزاهرية، قال حدثني كثير بن مرة الحضرمي، عن أبي الدرداء، سمعه يقول سئل رسول الله صلى الله عليه وسلم أفي كل صلاة قراءة قال ‏\"‏ نعم ‏\"‏ ‏.‏ قال رجل من الأنصار وجبت هذه ‏.‏ فالتفت إلى وكنت أقرب القوم منه فقال ما أرى الإمام إذا أم القوم إلا قد كفاهم ‏.‏ قال أبو عبد الرحمن هذا عن رسول الله صلى الله عليه وسلم خطأ إنما هو قول أبي الدرداء ولم يقرأ هذا مع الكتاب ‏.‏",
      "text_en": " Kathir bin Murrah Al-Hadrami narrated that :                     He heard Abu Ad-Darda say: \"The Messenger of Allah (ﷺ) was asked: 'Is there recitation in every prayer?' He said: 'Yes.' A man among the Ansar said: 'Is that obligatory?' He (Abu Ad-Darda) turned to me (Kathir), as I was closest of the people to him, and said: 'I think that if the Imam leads the people, that is sufficient for them.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20650",
        "20675",
        "10901",
        "19940",
        "37"
      ]
    },
    {
      "id": "sunan-an-nasai-982",
      "hadith_no": "982",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا هارون بن عبد الله، قال حدثنا ابن أبي فديك، عن الضحاك بن عثمان، عن بكير بن عبد الله، عن سليمان بن يسار، عن أبي هريرة، قال ما صليت وراء أحد أشبه صلاة برسول الله صلى الله عليه وسلم من فلان ‏.‏ قال سليمان كان يطيل الركعتين الأوليين من الظهر ويخفف الأخريين ويخفف العصر ويقرأ في المغرب بقصار المفصل ويقرأ في العشاء بوسط المفصل ويقرأ في الصبح بطول المفصل ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"I have never prayed behind anyone whose prayer more closely resembled that of the Messenger of Allah (ﷺ) than so-and-so.\" (The narrator) Sulaiman siad: \"He used to make the first two rak'ahs of Zuhr lengthy and the last two shorter, and he would make 'Asr shorter; in Maghrib he would recite the short Mufassal surahs, in Isha' the medium-length Mufassal surahs and in Subh the long Mufassal surahs.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20172",
        "20504",
        "11154",
        "11005",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-1132",
      "hadith_no": "1132",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرني هارون بن عبد الله، قال حدثنا الحسن بن سوار، قال حدثنا ليث بن سعد، عن معاوية بن صالح، عن عمرو بن قيس الكندي، أنه سمع عاصم بن حميد، يقول سمعت عوف بن مالك، يقول قمت مع النبي صلى الله عليه وسلم فبدأ فاستاك وتوضأ ثم قام فصلى فبدأ فاستفتح من البقرة لا يمر بآية رحمة إلا وقف وسأل ولا يمر بآية عذاب إلا وقف يتعوذ ثم ركع فمكث راكعا بقدر قيامه يقول في ركوعه ‏\"‏ سبحان ذي الجبروت والملكوت والكبرياء والعظمة ‏\"‏ ‏.‏ ثم سجد بقدر ركوعه يقول في سجوده ‏\"‏ سبحان ذي الجبروت والملكوت والكبرياء والعظمة ‏\"‏ ‏.‏ ثم قرأ آل عمران ثم سورة ثم سورة فعل مثل ذلك ‏.‏",
      "text_en": " 'Awf bin Malik said:                     \"I prayed Qiyam with the Prophet (ﷺ). He started by using the Siwak and performing wudu, then he stood and prayed. He started reciting Al-Baqarah and he did not come to any verse that spoke of mercy but he paused and asked for mercy, and he did not come to any verse that spoke of punishment but he paused (and sought refuge with Allah from that). Then he bowed and he stayed bowing for as long as he had stood,a nd he said while bowing: 'Subhanaka Dhil-jabaraut wal-malakut wal-kibriya' wal-'azamah (Glory be to the One Who has all power, sovereignty, magnificence and might.)' Then he prostrated for as long as he had bowed, saying while prostrating: 'Subhana Dhil-jabarut wal-malakut wal-kibriya' wal-'azamah (Glory be to the One Who has all power, sovereignty, magnificence and might.)' Then he recited Al Imran, then another surah and another, doing that each time.\"",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "28100",
        "20023",
        "20675",
        "19935",
        "10805"
      ]
    },
    {
      "id": "sunan-an-nasai-1251",
      "hadith_no": "1251",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا هارون بن عبد الله، قال حدثنا حجاج، وروح، - هو ابن عبادة - عن ابن جريج، قال أخبرني عبد الله بن مسافع، أن مصعب بن شيبة، أخبره عن عتبة بن محمد بن الحارث، عن عبد الله بن جعفر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من شك في صلاته فليسجد سجدتين ‏\"‏ ‏.‏ قال حجاج ‏\"‏ بعد ما يسلم ‏\"‏ ‏.‏ وقال روح ‏\"‏ وهو جالس ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin Ja'far that:                     The Messenger of Allah (ﷺ) said: \"Whoever has doubt during his prayer, let him prostrate twice.\" (One of the narrators) Hajjaj said: \"After he has said the taslim.\" (Another of them) Rawh said: \"While he is sitting.\"",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20219",
        "20229",
        "11070",
        "10658",
        "108"
      ]
    },
    {
      "id": "sunan-an-nasai-Grade-20",
      "hadith_no": "Grade",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرني هارون بن عبد الله، قال حدثنا الحسن بن سوار، قال حدثنا الليث، قال حدثنا خالد، عن سعيد، عن أبي بكر بن المنكدر، أن عمرو بن سليم، أخبره عن عبد الرحمن بن أبي سعيد، عن أبيه، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن الغسل يوم الجمعة على كل محتلم والسواك وأن يمس من الطيب ما يقدر عليه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdur-Rahman bin Abi Sa'eed, from his father, that:                     The Messenger of Allah (ﷺ) said: \"Ghusl should be performed on Friday by everyone who has reached the age of puberty, and using the siwak, and he should put on whatever he is able of using perfume.\"",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "28100",
        "20023",
        "11282",
        "11168",
        "1544",
        "11879",
        "38"
      ]
    },
    {
      "id": "sunan-an-nasai-Grade-27",
      "hadith_no": "Grade",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرني هارون بن عبد الله، قال حدثني يحيى بن آدم، قال حدثنا حسن بن عياش، قال حدثنا جعفر بن محمد، عن أبيه، عن جابر بن عبد الله، قال كنا نصلي مع رسول الله صلى الله عليه وسلم الجمعة ثم نرجع فنريح نواضحنا ‏.‏ قلت أية ساعة قال زوال الشمس ‏.‏",
      "text_en": " It was narrated that Ja'far bin Muhammad from his father, from Jabir bin 'Abdullah who said:                     \"We used to pray jumu'ah with the Messenger of Allah (ﷺ) then we would go back and tend to our camels.\" I said: \" At what time?\" He said: \"When the sun had passed its zenith.\"",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20364",
        "10898",
        "11442",
        "34"
      ]
    },
    {
      "id": "sunan-an-nasai-1628",
      "hadith_no": "1628",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا هارون بن عبد الله، قال حدثنا حجاج، قال قال ابن جريج عن أبيه، أخبرني ابن أبي مليكة، أن يعلى بن مملك، أخبره أنه، سأل أم سلمة عن صلاة، رسول الله صلى الله عليه وسلم فقالت كان يصلي العتمة ثم يسبح ثم يصلي بعدها ما شاء الله من الليل ثم ينصرف فيرقد مثل ما صلى ثم يستيقظ من نومه ذلك فيصلي مثل ما نام وصلاته تلك الآخرة تكون إلى الصبح ‏.‏",
      "text_en": " Ya'la bin Mamlak said that he asked Umm Salamah about the prayer of the Messenger of Allah (ﷺ) and she said:                     \"He used to pray 'Isha, then he would recite tasbih, then after that he would pray whatever Allah (SWT) willed (he should pray) of night prayer. Then he would go and sleep for as long as he had prayed. Then he would get up from sleep and pray for as long as he had slept, and this last prayer of his would continue until dawn.\"",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20219",
        "11070",
        "19831",
        "11090",
        "56"
      ]
    },
    {
      "id": "sunan-an-nasai-1661",
      "hadith_no": "1661",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا هارون بن عبد الله، قال حدثنا أبو داود الحفري، عن حفص، عن حميد، عن عبد الله بن شقيق، عن عائشة، قالت رأيت النبي صلى الله عليه وسلم يصلي متربعا ‏.‏ قال أبو عبد الرحمن لا أعلم أحدا روى هذا الحديث غير أبي داود وهو ثقة ولا أحسب هذا الحديث إلا خطأ والله تعالى أعلم ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"I saw the Prophet (ﷺ) praying while sitting cross-legged.\"",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20668",
        "20317",
        "11279",
        "10694",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-1707",
      "hadith_no": "1707",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا هارون بن عبد الله، قال حدثنا يحيى بن آدم، قال حدثنا أبو بكر النهشلي، عن حبيب بن أبي ثابت، عن يحيى بن الجزار، عن ابن عباس، قال كان رسول الله صلى الله عليه وسلم يصلي من الليل ثمان ركعات ويوتر بثلاث ويصلي ركعتين قبل صلاة الفجر ‏.‏ خالفه عمرو بن مرة فرواه عن يحيى بن الجزار عن أم سلمة عن رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Abu Bakr An-Nahshali narrated from Habib bin Abi Thabit, from Yahya bin Al-Jazzar, that Ibn 'Abbas said:                     \"The Messenger of Allah (ﷺ) used to pray eight rak'ahs at night and pray witr with three, and pray two rak'ahs before Fajr.\"",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20364",
        "20619",
        "11331",
        "10839",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-1787",
      "hadith_no": "1787",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا هارون بن عبد الله، قال حدثنا حسين بن علي، عن زائدة، عن سليمان، عن حبيب بن أبي ثابت، عن عبدة بن أبي لبابة، عن سويد بن غفلة، عن أبي الدرداء، يبلغ به النبي صلى الله عليه وسلم قال ‏\"‏ من أتى فراشه وهو ينوي أن يقوم يصلي من الليل فغلبته عيناه حتى أصبح كتب له ما نوى وكان نومه صدقة عليه من ربه عز وجل ‏\"‏ ‏.‏ خالفه سفيان ‏.‏",
      "text_en": " It was narrated from Abu Ad-Darda' who attributed it to the Prophet (ﷺ):                     \"Whoever goes to his bed intending to get up and pray qiyam at night, then sleep overwhelms him until morning, will have recorded that which he intended and his sleep is a charity given to him by his Lord, the Mighty and Sublime.\"",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20315",
        "20320",
        "11060",
        "11331",
        "10793",
        "11174"
      ]
    },
    {
      "id": "sunan-an-nasai-1818",
      "hadith_no": "1818",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا هارون بن عبد الله، حدثنا معن، قال حدثنا إبراهيم بن سعد، عن الزهري، عن عبيد الله بن عبد الله بن عتبة، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يتمنين أحد منكم الموت إما محسنا فلعله أن يزداد خيرا وإما مسيئا فلعله أن يستعتب ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah said:                     \"None of you should wish for death. Either he is a doer of good, so perhaps he may do more good, or he is an evildoer but perhaps he will give up his evil ways.\"",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "30112",
        "20150",
        "11013",
        "11004",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-1984",
      "hadith_no": "1984",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا هارون بن عبد الله، قال حدثنا معن، قال حدثنا معاوية بن صالح، عن حبيب بن عبيد الكلاعي، عن جبير بن نفير الحضرمي، قال سمعت عوف بن مالك، يقول سمعت رسول الله صلى الله عليه وسلم يصلي على ميت فسمعت في دعائه وهو يقول ‏\"‏ اللهم اغفر له وارحمه وعافه واعف عنه وأكرم نزله ووسع مدخله واغسله بالماء والثلج والبرد ونقه من الخطايا كما نقيت الثوب الأبيض من الدنس وأبدله دارا خيرا من داره وأهلا خيرا من أهله وزوجا خيرا من زوجه وأدخله الجنة ونجه من النار - أو قال - وأعذه من عذاب القبر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Jubair bin Nufair Al-Hadrami said:                     \"I heard 'Awf bin Malik say: \"I heard the Messenger of Allah offering the funeral prayer for one who had died, and I heard him say in his supplication: Allahummaghfir lahu warhamhu wa 'afihi, wa a'fu 'anhu, wa akrim nuzulahu wa wassi' mudkhalahu waghsilhu bil-ma wath-thalji wal-barad, wa naqqihi min al-khataya kama naqqaita-thawb al-abyad min ad-danas. Wa abdihu daran khairan min darhi, wa ahlan khayran min ahlihi, wa zawjan khayran min zawjihi. Wa adkhilahul-jannah wa najjhi min an-nar\" (O Allah, forgive him and have mercy on him, keep him safe and sound and forgive him, honor the place where he settles and make his entrance wide; wash hm with water and snow and hail, and cleanse him of his sin as you cleanse a white garment of dirt. O Allah, give him a house better than his house and a family better than his house and a family better than his family and a wife better than his wife, and admit him to Paradise and save him from Hellfire).''' Or he said: \"Wa a'idhhu al-qabr (And protect him from the torment of the grave.)\"",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "30112",
        "20675",
        "10899",
        "4097",
        "10805"
      ]
    },
    {
      "id": "sunan-an-nasai-2008",
      "hadith_no": "2008",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا هارون بن عبد الله، قال حدثنا أبو عامر، عن عبد الله بن جعفر، عن إسماعيل بن محمد، عن عامر بن سعد، ‏:‏ أن سعدا، لما حضرته الوفاة قال ‏:‏ الحدوا لي لحدا، وانصبوا على نصبا كما فعل برسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated from 'Amir bin Sa'd that when Sa'd was dying he said:                     \"Make a niche for me in the side of the grave and set up (bricks) over me as was done for the Messenger of Allah.\"",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20443",
        "108",
        "10554"
      ]
    },
    {
      "id": "sunan-an-nasai-2264",
      "hadith_no": "2264",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا هارون بن عبد الله، وعبد الرحمن بن محمد بن سلام، قالا حدثنا أبو داود، عن سفيان، عن الأوزاعي، عن يحيى، عن أبي سلمة، عن أبي هريرة، قال أتي النبي صلى الله عليه وسلم بطعام بمر الظهران فقال لأبي بكر وعمر ‏\"‏ أدنيا فكلا ‏\"‏ ‏.‏ فقالا إنا صائمان ‏.‏ فقال ‏\"‏ ارحلوا لصاحبيكم اعملوا لصاحبيكم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"Some food was brought to the Messenger of Allah at Marr Az-Zahran, and he said to Abu Bakr and 'Umar: 'Come and eat.' They said: 'We are fasting.' He said: 'Saddle the camels for your companions, and help your companions.\"'(Daif)",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "36587",
        "20547",
        "20012",
        "20024",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-2299",
      "hadith_no": "2299",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرني هارون بن عبد الله، قال حدثنا محمد بن بكر، قال أنبأنا عبد الحميد بن جعفر، قال أخبرني عمران بن أبي أنس، عن أبي سلمة بن عبد الرحمن، عن حمزة بن عمرو، أنه سأل رسول الله صلى الله عليه وسلم عن الصوم في السفر قال ‏\"‏ إن شئت أن تصوم فصم وإن شئت أن تفطر فأفطر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Hamzah bin 'Amr that:                     he asked the Messenger of Allah about fasting while traveling. He said: \"If you wish to fast then fast, and if you wish not to fast then do not fast.\"",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20277",
        "11875",
        "10605",
        "10567",
        "4123"
      ]
    },
    {
      "id": "sunan-an-nasai-2382",
      "hadith_no": "2382",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرني هارون بن عبد الله، قال حدثنا الحسن بن موسى، قال أنبأنا أبو هلال، قال حدثنا غيلان، - وهو ابن جرير - قال حدثنا عبد الله، - وهو ابن معبد الزماني - عن أبي قتادة، عن عمر، قال كنا مع رسول الله صلى الله عليه وسلم فمررنا برجل فقالوا يا نبي الله هذا لا يفطر منذ كذا وكذا ‏.‏ فقال ‏\"‏ لا صام ولا أفطر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Umar said:                     \"We were with the Messenger of Allah and we passed by a man. They said: 'O Prophet of Allah, this man has not broken his fast for such and such a time.' He said: 'He has neither fasted nor broken his fast.\"' 'Ata said: \"someone who heard him told me that Ibn 'Umar (said) that the Prophet said: 'Whoever fasts every day of his life, then he has not fasted.\"",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20383",
        "19857",
        "11300",
        "10697",
        "391",
        "3"
      ]
    },
    {
      "id": "sunan-an-nasai-2463",
      "hadith_no": "2463",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا هارون بن عبد الله، قال حدثنا روح، قال حدثنا زكريا بن إسحاق، قال حدثني عمرو بن أبي سفيان، قال حدثني مسلم بن ثفنة، أن ابن علقمة، استعمل أباه على صدقة قومه وساق الحديث ‏.‏",
      "text_en": " Muslim bin Thafinah narrated that:                     Ibn 'Alqamah appointed his father to collect the Zakah of his people - and he quoted the same Hadith.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20229",
        "11244",
        "13554"
      ]
    },
    {
      "id": "sunan-an-nasai-2475",
      "hadith_no": "2475",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا هارون بن عبد الله، قال حدثنا أبو أسامة، عن الوليد بن كثير، عن محمد بن عبد الرحمن بن أبي صعصعة، عن يحيى بن عمارة، وعباد بن تميم، عن أبي سعيد الخدري، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا صدقة فيما دون خمس أوساق من التمر ولا فيما دون خمس أواق من الورق صدقة ولا فيما دون خمس ذود من الإبل صدقة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Sa 'eed Al-Khudri that he heard the Messenger of Allah say:                     \"No Sadaqah is due on less than five  Awsaq[2] of dates, no Sadaqah is due on less than five Awaq of silver, and no Sadagah is due on less than five Dhawd (head) of camels.\"",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20318",
        "11230",
        "11536",
        "11232",
        "639",
        "38"
      ]
    },
    {
      "id": "sunan-an-nasai-2565",
      "hadith_no": "2565",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرني هارون بن عبد الله، قال حدثنا معن، قال حدثنا مالك، ح وأنبأنا قتيبة بن سعيد، عن مالك، عن زيد بن أسلم، عن ابن بجيد الأنصاري، عن جدته، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ردوا السائل ولو بظلف ‏\"‏ ‏.‏ في حديث هارون محرق ‏.‏",
      "text_en": " It was narrated from Abu Bujaid Al-Ansari from his grandmother that the Messenger of Allah said:                     \"Respond to the one who asks even with a sheep's foot.\" According to the narration of Harun: \"With a sheep's burned foot.\"",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "30112",
        "20001",
        "30367",
        "20001",
        "11163"
      ]
    },
    {
      "id": "sunan-an-nasai-2765",
      "hadith_no": "2765",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا هارون بن عبد الله، قال حدثنا أبو داود، قال حدثنا حبيب، عن عمرو بن هرم، عن سعيد بن جبير، وعكرمة، عن ابن عباس، أن ضباعة، أرادت الحج فأمرها النبي صلى الله عليه وسلم أن تشترط ففعلت عن أمر رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas:                     That Duba'ah wanted to perform Hajj, so the Prophet Told here to stipulate a condition, and she acted upon the command of the Messenger of Allah.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20547",
        "11276",
        "10708",
        "11050",
        "11023",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-3096",
      "hadith_no": "3096",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا هارون بن عبد الله، ومحمد بن إسماعيل بن إبراهيم، قالا حدثنا يزيد، قال أنبأنا حماد بن سلمة، عن حميد، عن أنس، عن النبي صلى الله عليه وسلم قال ‏\"‏ جاهدوا المشركين بأموالكم وأيديكم وألسنتكم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Anas that the Prophet (ﷺ) said:                      \"Strive against the idolators with your wealth, your hands and your tongues.\" [1][1] Its chain has defects while its meaning is supported by other chains.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "34188",
        "20472",
        "20021",
        "11279",
        "19"
      ]
    },
    {
      "id": "sunan-an-nasai-3139",
      "hadith_no": "3139",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرني هارون بن عبد الله، قال حدثنا يزيد بن هارون، قال أنبأنا حماد بن سلمة، عن جبلة بن عطية، عن يحيى بن الوليد، عن عبادة بن الصامت، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من غزا وهو لا يريد إلا عقالا فله ما نوى ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Ubadah bin As-Samit that the Messenger of Allah (ﷺ) said:                      \"Whoever fights seeking only an 'Iqbal, then he will have what he intended.\"",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20472",
        "20021",
        "18116",
        "25357",
        "40"
      ]
    },
    {
      "id": "sunan-an-nasai-3190",
      "hadith_no": "3190",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرني هارون بن عبد الله، قال حدثنا حرمي بن عمارة، قال حدثنا شعبة، عن علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ حرمة نساء المجاهدين على القاعدين كحرمة أمهاتهم وإذا خلفه في أهله فخانه قيل له يوم القيامة هذا خانك في أهلك فخذ من حسناته ما شئت فما ظنكم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Sulaiman bin Buraidah, from his father, that the Messenger of Allah (ﷺ) said:                      \"The sanctity of the wive of the Mujahidin to those who stay behind is like the sanctity of their mothers. If he takes on the responsibility of looking after his wife then betrays him, it will be said to him on the Day of Resurrection: 'This one betrayed you with your wife, so take whatever you want of his good deeds.' So what do you think?\"",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20221",
        "20020",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "id": "sunan-an-nasai-3240",
      "hadith_no": "3240",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا هارون بن عبد الله، قال حدثنا معن، قال حدثنا مالك، ح والحارث بن مسكين قراءة عليه وأنا أسمع، عن ابن القاسم، قال حدثني مالك، عن محمد بن يحيى بن حبان، عن الأعرج، عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏\"‏ لا يخطب أحدكم على خطبة أخيه ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     It was narrated from Abu Hurairah that the Prophet said: \"None of you should propose marriage to a woman when someone else has already proposed to her.\"",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "30112",
        "20001",
        "36017",
        "30234",
        "20001",
        "11222",
        "11197",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-3268",
      "hadith_no": "3268",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا هارون بن عبد الله، قال حدثنا معن، قال حدثنا مالك، عن عبد الرحمن بن القاسم، وأنبأنا محمد بن سلمة، قال حدثنا عبد الرحمن بن القاسم، عن مالك، قال حدثني عبد الرحمن بن القاسم، عن أبيه، عن عبد الرحمن، ومجمع، ابنى يزيد بن جارية الأنصاري عن خنساء بنت خذام، أن أباها، زوجها وهي ثيب فكرهت ذلك فأتت رسول الله صلى الله عليه وسلم فرد نكاحه ‏.‏",
      "text_en": " It was narrated from Khansa' bint Khidham that her father married her off when she had been previously married, and she was unwilling. She went to the Messenger of Allah and he annulled the marriage.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "30112",
        "20001",
        "10530",
        "20672",
        "10530",
        "20001",
        "10530",
        "10535",
        "10530",
        "1719"
      ]
    },
    {
      "id": "sunan-an-nasai-3275",
      "hadith_no": "3275",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا هارون بن عبد الله، قال حدثنا معن، قال حدثنا مالك، والحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن القاسم، قال حدثني مالك، عن نافع، عن نبيه بن وهب، أن أبان بن عثمان، قال سمعت عثمان بن عفان، رضى الله عنه يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ لا ينكح المحرم ولا ينكح ولا يخطب ‏\"‏ ‏.‏",
      "text_en": " 'Uthman bin 'Affan, may Allah be pleased with him, said:                      \"The Messenger of Allah said: 'The Muhrim should not get married, or arrange a marriage for someone else, or propose marriage.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "30112",
        "20001",
        "36017",
        "30234",
        "20001",
        "11014",
        "19965",
        "10582",
        "4"
      ]
    },
    {
      "id": "sunan-an-nasai-3288",
      "hadith_no": "3288",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرني هارون بن عبد الله، قال حدثنا معن، قال حدثنا مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يجمع بين المرأة وعمتها ولا بين المرأة وخالتها ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                      \"The Messenger of Allah said: '(A man should not be married to) a woman and her paternal aunt nor to a woman and her maternal aunt at the same time.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "30112",
        "20001",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-3307",
      "hadith_no": "3307",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرني هارون بن عبد الله، قال حدثنا معن، قال حدثنا مالك، والحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن القاسم، قال حدثني مالك، عن عبد الله بن أبي بكر، عن عمرة، عن عائشة، قالت كان فيما أنزل الله عز وجل - وقال الحارث فيما أنزل من القرآن - عشر رضعات معلومات يحرمن ثم نسخن بخمس معلومات فتوفي رسول الله صلى الله عليه وسلم وهي مما يقرأ من القرآن ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                      \"One of the things that Allah, the Mighty and Sublime, revealed\" -(one of the narrators) Al-Harith said (in his narration): \"One of the things that were revealed in the Qur'an\"- \"was that ten known breast-feedings make marriage prohibited, then that was abrogated and changed to five known breast-feedings. Then the Messenger of Allah passed away when this was something that was still being recited in the Qur'an.\"",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "30112",
        "20001",
        "36017",
        "30234",
        "20001",
        "11104",
        "11455",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-3313",
      "hadith_no": "3313",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا هارون بن عبد الله، قال حدثنا معن، قال حدثنا مالك، عن عبد الله بن أبي بكر، عن عمرة، أن عائشة، أخبرتها أن رسول الله صلى الله عليه وسلم كان عندها وأنها سمعت رجلا يستأذن في بيت حفصة قالت عائشة فقلت يا رسول الله هذا رجل يستأذن في بيتك ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أراه فلانا ‏\"‏ ‏.‏ لعم حفصة من الرضاعة ‏.‏ قالت عائشة فقلت لو كان فلان حيا - لعمها من الرضاعة - دخل على ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن الرضاعة تحرم ما يحرم من الولادة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amrah that 'Aishah told her that the Messenger of Allah was with her, and she heard a man asking permission to enter Hafsah's house. 'Aishah said:                      \"I said: 'O Messenger of Allah, there is a man asking permission to enter your house.' The Messenger of Allah said: 'I think it is so-and-so the paternal uncle of Hafsah through breast-feeding.' 'Aishah said: If so-and-so (her own paternal uncle through breast-feeding) were alive, would he be allowed to enter upon me?' The Messenger of Allah said: 'What becomes unlawful (for marriage) through breast-feeding is that which becomes unlawful through birth.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "30112",
        "20001",
        "11104",
        "11455",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-3316",
      "hadith_no": "3316",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا هارون بن عبد الله، أنبأنا معن، قال حدثنا مالك، عن ابن شهاب، عن عروة، عن عائشة، قالت كان أفلح أخو أبي القعيس يستأذن على وهو عمي من الرضاعة فأبيت أن آذن له حتى جاء رسول الله صلى الله عليه وسلم فأخبرته فقال ‏\"‏ ائذني له فإنه عمك ‏\"‏ ‏.‏ قالت عائشة وذلك بعد أن نزل الحجاب ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                      \"Aflah, the brother of Abu Al-Qu'ais, who was my paternal uncle through breast-feeding, used to ask permission to enter upon me, and I refused to let him in until the Messenger of Allah came, and I told him about that. He said: 'Let him in, for he is your paternal uncle.'\" 'Aishah said: \"That was after the (Verse of) Hijab had been revealed.\"",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "30112",
        "20001",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-3337",
      "hadith_no": "3337",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا هارون بن عبد الله، قال حدثنا معن، قال حدثنا مالك، عن نافع، ح والحارث بن مسكين قراءة عليه وأنا أسمع، عن ابن القاسم، قال مالك حدثني نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم نهى عن الشغار والشغار أن يزوج الرجل الرجل ابنته على أن يزوجه ابنته وليس بينهما صداق ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that the Messenger of Allah forbade Ash-Shighar. Ash-Shighar means when a man marries his daughter to another man, on the condition that that man marries his daughter to him, and no dowry is exchanged between them.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "30112",
        "20001",
        "11014",
        "36017",
        "30234",
        "20001",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-3359",
      "hadith_no": "3359",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا هارون بن عبد الله، قال حدثنا معن، قال حدثنا مالك، عن أبي حازم، عن سهل بن سعد، أن رسول الله صلى الله عليه وسلم جاءته امرأة فقالت يا رسول الله إني قد وهبت نفسي لك ‏.‏ فقامت قياما طويلا فقام رجل فقال زوجنيها إن لم يكن لك بها حاجة ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ هل عندك شىء ‏\"‏ ‏.‏ قال ما أجد شيئا ‏.‏ قال ‏\"‏ التمس ولو خاتما من حديد ‏\"‏ ‏.‏ فالتمس فلم يجد شيئا فقال له رسول الله صلى الله عليه وسلم ‏\"‏ هل معك من القرآن شىء ‏\"‏ ‏.‏ قال نعم سورة كذا وسورة كذا ‏.‏ لسور سماها ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ قد زوجتكها على ما معك من القرآن ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Sahl bin Sa'd that a woman came to the Messenger of Allah and said:                      \"O Messenger of Allah, I give myself in marriage to you.\" She stood for a long time, then a man stood up and said: \"Marry her to me if you do not want to marry her.\" The Messenger of Allah said: \"Do you have anything?\" He said: \"I cannot find anything.\" He said: \"Look (for something), even if it is only an iron ring.\" So he looked but he could not find anything. The Messenger of Allah said to him: \"Have you (memorized) anything of the Qur'an?\" He said: \"Yes, Surah such and such and Surah such and such,\" naming them. The Messenger of Allah said: \"I marry her to you for what you know of the Qur'an.\"",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "30112",
        "20001",
        "11172",
        "399"
      ]
    },
    {
      "id": "sunan-an-nasai-3569",
      "hadith_no": "3569",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Horses, Races and Shooting - كتاب الخيل",
      "chapter_no": "28",
      "text_ar": "أخبرني هارون بن عبد الله، قال حدثنا معن، قال حدثنا مالك، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن القاسم، قال حدثنا مالك، عن ابن شهاب، عن حمزة، وسالم، ابنى عبد الله بن عمر عن عبد الله بن عمر، رضى الله عنهما أن رسول الله صلى الله عليه وسلم قال ‏\"‏ الشؤم في الدار والمرأة والفرس ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin 'Umar that the Messenger of Allah said:                      \"Omens are in houses, women and horses.\"",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "30112",
        "20001",
        "36017",
        "30234",
        "20001",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-3598",
      "hadith_no": "3598",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Endowments - كتاب الإحباس",
      "chapter_no": "29",
      "text_ar": "أخبرني هارون بن عبد الله، قال حدثنا معاوية بن عمرو، عن أبي إسحاق الفزاري، عن ابن عون، عن نافع، عن ابن عمر، عن عمر، رضى الله عنه عن النبي صلى الله عليه وسلم نحوه ‏.‏",
      "text_en": " A similar report was narrated from Abu Ishaq Al-Fazari, from (Ayyub) bin 'Awn, from Nafi', from Ibn 'Umar, from 'Umar, may Allah be pleased with him, from the Prophet.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20389",
        "20405",
        "11071",
        "11014",
        "18",
        "3"
      ]
    },
    {
      "id": "sunan-an-nasai-3656",
      "hadith_no": "3656",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Wills - كتاب الوصايا",
      "chapter_no": "30",
      "text_ar": "أخبرني هارون بن عبد الله، قال حدثنا عفان، قال حدثنا سليمان بن كثير، عن الزهري، عن عبيد الله بن عبد الله، عن ابن عباس، عن سعد بن عبادة، أنه أتى النبي صلى الله عليه وسلم فقال إن أمي ماتت وعليها نذر أفيجزئ عنها أن أعتق عنها قال ‏\"‏ أعتق عن أمك ‏\"‏‏.‏",
      "text_en": " It was narrated from Sa'd bin 'Ubadah that he came to the Prophet and said:                      \"My mother has died and she had a vow to fulfill. Will it suffice if I free a slave on her behalf?\" He said: \"Free a slave on behalf of your mother.\"",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "30106",
        "20235",
        "11013",
        "11004",
        "17",
        "35"
      ]
    },
    {
      "id": "sunan-an-nasai-3983",
      "hadith_no": "3983",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرني هارون بن عبد الله، قال حدثنا عبد الله بن بكر، قال حدثنا حاتم بن أبي صغيرة، عن النعمان بن سالم، أن عمرو بن أوس، أخبره أن أباه أوسا قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أمرت أن أقاتل الناس حتى يشهدوا أن لا إله إلا الله ثم تحرم دماؤهم وأموالهم إلا بحقها ‏\"‏ ‏.‏",
      "text_en": " It was narrated from An-Nu'man bin Salim that:                     'Amr bin Aws told him that his father Aws said: \"The Messenger of Allah [SAW] said: 'I have been commanded to fight the people until they bear witness to La ilaha illallah (there is none worthy of worship except Allah), then their blood and their wealth become forbidden to me, except for a right that is due.\"",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20244",
        "11274",
        "10972",
        "11437"
      ]
    },
    {
      "id": "sunan-an-nasai-4133",
      "hadith_no": "4133",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Distribution of Al-Fay' - كتاب قسم الفىء",
      "chapter_no": "38",
      "text_ar": "أخبرنا هارون بن عبد الله الحمال، قال حدثنا عثمان بن عمر، عن يونس بن يزيد، عن الزهري، عن يزيد بن هرمز، أن نجدة الحروري، حين خرج في فتنة ابن الزبير أرسل إلى ابن عباس يسأله عن سهم ذي القربى لمن تراه قال هو لنا لقربى رسول الله صلى الله عليه وسلم قسمه رسول الله صلى الله عليه وسلم لهم وقد كان عمر عرض علينا شيئا رأيناه دون حقنا فأبينا أن نقبله وكان الذي عرض عليهم أن يعين ناكحهم ويقضي عن غارمهم ويعطي فقيرهم وأبى أن يزيدهم على ذلك ‏.‏",
      "text_en": " It was narrated from Yazid bin Hurmuz that:                     when Najdah Al-Haruriyyah rebelled during the Fitnah of Ibn Zubayr, he sent word to Ibn 'Abbas asking him about the share of the relatives (of the Messenger of Allah) -to whom did he think it should be given? He replied: \"It is for us, because of our blood ties to the Messenger of Allah allocated it to them, but 'Umar offered us something we thought was less than what was our due, and we refused to accept it. What he offered to them who wanted to get married, and to help the debtors pay off their debts, and he gave to their indigent. But he refused to give them more than that.\"",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20262",
        "20475",
        "11013",
        "10627"
      ]
    },
    {
      "id": "sunan-an-nasai-4153",
      "hadith_no": "4153",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of al-Bay'ah - كتاب البيعة",
      "chapter_no": "39",
      "text_ar": "أخبرنا هارون بن عبد الله، قال حدثنا أبو أسامة، قال حدثني الوليد بن كثير، قال حدثني عبادة بن الوليد، أن أباه الوليد، حدثه عن جده، عبادة بن الصامت قال بايعنا رسول الله صلى الله عليه وسلم على السمع والطاعة في عسرنا ويسرنا ومنشطنا ومكارهنا وعلى أن لا ننازع الأمر أهله وعلى أن نقول بالعدل أين كنا لا نخاف في الله لومة لائم ‏.‏",
      "text_en": " It was narrated that 'Ubadah bin As-Samit said:                     \"We pledged to the Messenger of Allah to hear and obey during our hardship and our ease, when we felt energetic and when we felt tired, that we would not contend with the orders of  whomever was entrusted with it, that we would stand for justice wherever we may be, and that we would not fear the blame of any blamer for the sake of Allah.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20318",
        "11230",
        "12201",
        "40"
      ]
    },
    {
      "id": "sunan-an-nasai-4221",
      "hadith_no": "4221",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of al-'Aqiqah - كتاب العقيقة",
      "chapter_no": "40",
      "text_ar": "أخبرنا هارون بن عبد الله، قال حدثنا قريش بن أنس، عن حبيب بن الشهيد، قال لي محمد بن سيرين سل الحسن ممن سمع حديثه، في العقيقة ‏.‏ فسألته عن ذلك، فقال سمعته من، سمرة ‏.‏",
      "text_en": " It was narrated from Habib bin Ash-Shahid:                     \"Muhammad bin Sirin said to me: 'Ask Al-Hasan (Al-Basri) from whom he heard this Hadith about the 'Aqiqah.' I asked him about that and he said: 'I heard it from Samurh.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20273",
        "11275",
        "11035"
      ]
    },
    {
      "id": "sunan-an-nasai-4227",
      "hadith_no": "4227",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of al-Fara' and al-'Atirah - كتاب الفرع والعتيرة",
      "chapter_no": "41",
      "text_ar": "أخبرني هارون بن عبد الله، قال حدثنا عفان، قال حدثنا يحيى بن زرارة السهمي، قال حدثني أبي، عن جده الحارث بن عمرو، ح وأنبأنا هارون بن عبد الله، قال حدثنا هشام بن عبد الملك، قال حدثني يحيى بن زرارة السهمي، قال حدثني أبي، عن جده الحارث بن عمرو، أنه لقي رسول الله صلى الله عليه وسلم في حجة الوداع فقلت بأبي أنت يا رسول الله وأمي استغفر لي ‏.‏ فقال ‏\"‏ غفر الله لكم ‏\"‏ ‏.‏ وهو على ناقته العضباء ثم استدرت من الشق الآخر وساق الحديث ‏.‏",
      "text_en": " Yahya bin Zurarah As-Sahmi said:                     \"My father narrated to me from his grandfather, Al-Harith bin 'Amr that he met the Messenger of Allah during the Farewell Pilgrimage and said: 'May my father and mother be sacrificed for you! O Messenger of Allah; pray for forgiveness for me.' He said: 'May Allah forgive you (plural).' He was atop his slit-eared camel and I came around to the other side\"' and he quoted the Hadith.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "30106",
        "30524"
      ]
    },
    {
      "id": "sunan-an-nasai-4375",
      "hadith_no": "4375",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرني هارون بن عبد الله، قال حدثنا شجاع بن الوليد، قال حدثني زياد بن خيثمة، قال حدثنا أبو إسحاق، عن شريح بن النعمان، عن علي بن أبي طالب، رضى الله عنه أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يضحى بمقابلة ولا مدابرة ولا شرقاء ولا خرقاء ولا عوراء ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Ali bin Abi Talib, may Allah be please wityh him, that the messenger of Allah said:                     \"Do not sacrifice and animal with its ears slit from the front, and animal with its ears slit from the back, an animals with its ears slit lengthwise, and animal with a round hole in its ears, or an animal with one bad eye.\"",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20328",
        "20585",
        "11049",
        "5"
      ]
    },
    {
      "id": "sunan-an-nasai-4460",
      "hadith_no": "4460",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرني هارون بن عبد الله، قال حدثنا أبو أسامة، قال أخبرني الوليد، - يعني ابن كثير - عن معبد بن كعب بن مالك، عن أبي قتادة الأنصاري، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ إياكم وكثرة الحلف في البيع فإنه ينفق ثم يمحق ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Qatadah Al-Ansari that he heard the Messenger of Allah say:                     \"Beware of taking oaths a great deal when selling, for it may help you to make a sale but it destroys the blessing.\"",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20318",
        "11230",
        "1134",
        "391"
      ]
    },
    {
      "id": "sunan-an-nasai-4566",
      "hadith_no": "4566",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرني هارون بن عبد الله، قال حدثنا أبو أسامة، قال قال إسماعيل حدثنا حكيم بن جابر، ح وأنبأنا يعقوب بن إبراهيم، قال حدثنا يحيى، عن إسماعيل، قال حدثنا حكيم بن جابر، عن عبادة بن الصامت، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ الذهب الكفة بالكفة ‏\"‏ ‏.‏ ولم يذكر يعقوب ‏\"‏ الكفة بالكفة ‏\"‏ ‏.‏ فقال معاوية إن هذا لا يقول شيئا ‏.‏ قال عبادة إني والله ما أبالي أن لا أكون بأرض يكون بها معاوية إني أشهد أني سمعت رسول الله صلى الله عليه وسلم يقول ذلك ‏.‏",
      "text_en": " It was narrated that 'Ubadah bin As-Samit said:                     \"I heard the Messenger of Allah say: 'Gold, equal amount.\"' (One of the narrators) Yaqub did not mention: \"Equal amount.\" Muawiyah said: \"This does not mean anything.\" 'Ubadah said; \"By Allah I do not care if I am in a land where Muawiyah is not present. I bear witness that I heard the Messenger of Allah say that.\"",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20318",
        "11418",
        "20184",
        "11449",
        "11418",
        "40"
      ]
    },
    {
      "id": "sunan-an-nasai-4679",
      "hadith_no": "4679",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرني هارون بن عبد الله، قال حدثنا حماد بن مسعدة، عن ابن جريج، عن عكرمة بن خالد، قال حدثني أسيد بن حضير بن سماك، أن رسول الله صلى الله عليه وسلم قضى أنه إذا وجدها في يد الرجل غير المتهم فإن شاء أخذها بما اشتراها وإن شاء اتبع سارقه وقضى بذلك أبو بكر وعمر ‏.‏",
      "text_en": " Usaid bin Hudair bin Simak narrated that:                     the Messenger of Allah ruled that if a man found (his goods) in the possession of a man who was not guilty, then if he wished he could give the man what he had paid for it, or if he wished he could go after the one who had stolen it. Abu Bakr and 'Umar passed similar judgments.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20224",
        "11070",
        "11709",
        "45"
      ]
    },
    {
      "id": "sunan-an-nasai-4832",
      "hadith_no": "4832",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرني هارون بن عبد الله، قال حدثنا سفيان، قال حدثني عبد الملك بن أبجر، عن إياد بن لقيط، عن أبي رمثة، قال أتيت النبي صلى الله عليه وسلم مع أبي فقال ‏\"‏ من هذا معك ‏\"‏ ‏.‏ قال ابني أشهد به ‏.‏ قال ‏\"‏ أما إنك لا تجني عليه ولا يجني عليك ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Rimthah said;\"I came to the Prophet with my father and he said:                      'Who is this with you?' He said:' my son, I bear witness (that he is my son). He said: 'You cannot be affected by his sin or he by yours.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20005",
        "10892"
      ]
    },
    {
      "id": "sunan-an-nasai-4937",
      "hadith_no": "4937",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرني هارون بن عبد الله، قال حدثنا قدامة بن محمد، قال أنبأنا مخرمة، عن أبيه، قال سمعت عثمان بن أبي الوليد، مولى الأخنسيين يقول سمعت عروة بن الزبير، يقول كانت عائشة تحدث عن النبي صلى الله عليه وسلم يقول ‏\"‏ لا تقطع اليد إلا في المجن أو ثمنه ‏\"‏ ‏.‏",
      "text_en": " Makhramah narrated that his father said:                     \"I heard 'Uthman bin Abi AL-Walid, the freed slave of the Akhnasiyin, say: 'I heard 'Urwah bin Az-Zubair say;'Aishah used to narrated that the Prophet said: \"The hand (of the htief) should notbe cut off for anything but a shield or its equivalent in value.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "10511"
      ]
    },
    {
      "id": "sunan-an-nasai-4947",
      "hadith_no": "4947",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرنا هارون بن عبد الله، قال حدثنا الأسود بن عامر، قال أنبأنا الحسن بن حى، عن منصور، عن الحكم، عن عطاء، ومجاهد، عن أيمن، قال يقطع السارق في ثمن المجن وكان ثمن المجن على عهد رسول الله صلى الله عليه وسلم دينارا أو عشرة دراهم ‏.‏",
      "text_en": " It was narrated that Ayman said:                     \"The (hand of) a thief is to be cut off for the price of a shield, and the price of a shield during the time of the Messenger of Allah was a Dinar, or ten Dirhams.\" (Daif)",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20380",
        "11067",
        "11069",
        "11029",
        "11028"
      ]
    },
    {
      "id": "sunan-an-nasai-4986",
      "hadith_no": "4986",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book Of Faith and its Signs - كتاب الإيمان وشرائعه",
      "chapter_no": "47",
      "text_ar": "أخبرنا هارون بن عبد الله، قال حدثنا حجاج، عن ابن جريج، قال حدثنا عثمان بن أبي سليمان، عن علي الأزدي، عن عبيد بن عمير، عن عبد الله بن حبشي الخثعمي، أن النبي صلى الله عليه وسلم سئل أى الأعمال أفضل فقال ‏\"‏ إيمان لا شك فيه وجهاد لا غلول فيه وحجة مبرورة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abdullah bin Hubshi Al-Khath'ami that:                     The Prophet [SAW] was asked: \"Which deed is best?\" He said: \"Faith in which there is no doubt, Jihad in which there is no Ghulul, and Hajjatun Mabrur.\"",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20219",
        "11070",
        "10649",
        "19335",
        "11259",
        "5119"
      ]
    },
    {
      "id": "sunan-an-nasai-5033",
      "hadith_no": "5033",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book Of Faith and its Signs - كتاب الإيمان وشرائعه",
      "chapter_no": "47",
      "text_ar": "أخبرنا هارون بن عبد الله قال حدثنا معن قال حدثنا مالك ح والحارث بن مسكين قراءة عليه وأنا أسمع عن ابن القاسم أخبرني مالك واللفظ له عن ابن شهاب عن سالم عن أبيه  أن رسول الله صلى الله عليه وسلم مر على رجل يعظ أخاه في الحياء فقال دعه فإن الحياء من الإيمان",
      "text_en": " It was narrated from Salim, from his father, that:                     The Messenger of Allah [SAW] passed by a man who was censuring his brother about modesty. He said: \"Let him be, for modesty is part of faith.\"",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "30112",
        "20001",
        "36017",
        "30234",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-5036",
      "hadith_no": "5036",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book Of Faith and its Signs - كتاب الإيمان وشرائعه",
      "chapter_no": "47",
      "text_ar": "أخبرنا هارون بن عبد الله قال حدثنا معن ح والحارث بن مسكين قراءة عليه وأنا أسمع عن ابن القاسم قالا حدثنا مالك عن عبد الرحمن بن عبد الله بن عبد الرحمن بن أبي صعصعة عن أبيه عن أبي سعيد الخدري قال  قال رسول الله صلى الله عليه وسلم يوشك أن يكون خير مال مسلم غنم يتبع بها شعف الجبال ومواقع القطر يفر بدينه من الفتن",
      "text_en": " It was narrated that Abu Sa'eed Al-Khudri said:                     \"The Messenger of Allah [SAW] said: 'Soon the best wealth of a Muslim will be the sheep which follows in the mountain peaks and places where rainfall is to be found, fleeing with his religion from the tribulations.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "30112",
        "36017",
        "30234",
        "20001",
        "11518",
        "11514",
        "38"
      ]
    },
    {
      "id": "sunan-an-nasai-5180",
      "hadith_no": "5180",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرني هارون بن عبد الله، قال حدثنا عبد الصمد بن عبد الوارث، قال حدثنا حرب، - وهو ابن شداد - عن يحيى، قال حدثني عمرو بن سعد الفدكي، أن نافعا، أخبره قال حدثني ابن حنين، أن عليا، حدثه قال نهاني رسول الله صلى الله عليه وسلم عن ثياب المعصفر وعن خاتم الذهب وعن لبس القسي وأن أقرأ وأنا راكع ‏.‏ خالفه الليث بن سعد ‏.‏",
      "text_en": " Ibn Hunain narrated that 'Ali said to him:                     \"The Messenger of Allah [SAW] forbade me (from wearing) garments dyed with safflower, and from gold rings, and from wearing Al-Qassi, and that I recite Qur'an while I am bowing.\"",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20250",
        "20220",
        "11449",
        "18793",
        "11014",
        "5"
      ]
    },
    {
      "id": "sunan-an-nasai-5270",
      "hadith_no": "5270",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرني هارون بن عبد الله، قال حدثنا عبد الصمد بن عبد الوارث، قال حدثنا حرب، عن يحيى، حدثني عمرو بن سعد الفدكي، أن نافعا، أخبره حدثني ابن حنين، أن عليا، حدثه قال نهاني رسول الله صلى الله عليه وسلم عن ثياب المعصفر وعن خاتم الذهب ولبس القسي وأن أقرأ وأنا راكع ‏.‏",
      "text_en": " 'Ali said:                     \"The Messenger of Allah [SAW] forbade me from wearing garments dyed with safflower, and from gold rings, and from wearing Al-Qassi, and that I recite Qur'an while I am bowing.\"",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20250",
        "20220",
        "11449",
        "18793",
        "11014",
        "5"
      ]
    },
    {
      "id": "sunan-ibn-majah-1008",
      "hadith_no": "1008",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا هارون بن عبد الله الحمال، والحسن بن داود المنكدري، قالا حدثنا ابن أبي فديك، عن الضحاك بن عثمان، عن صدقة بن يسار، عن عبد الله بن عمر، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ إذا كان أحدكم يصلي فلا يدع أحدا يمر بين يديه فإن أبى فليقاتله فإن معه القرين ‏\"‏ ‏.‏ وقال المنكدري فإن معه العزى ‏.‏",
      "text_en": " It wasnarrated from ‘Abdullah bin ‘Umar that the Messenger of Allah(ﷺ) said:                      “When anyone of you is performing prayer, he should notlet anyone pass in front of him. If he insists then let him fighthim,for he has a Qarin (devil-companion) with him.”",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "32007",
        "20172",
        "20504",
        "10641",
        "18"
      ]
    },
    {
      "id": "sunan-ibn-majah-1405",
      "hadith_no": "1405",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا هارون بن عبد الله الحمال، حدثنا الحسين بن علي الجعفي، عن زائدة، عن سليمان الأعمش، عن حبيب بن أبي ثابت، عن عبدة بن أبي لبابة، عن سويد بن غفلة، عن أبي الدرداء، يبلغ به النبي  صلى الله عليه وسلم  قال ‏\"‏ من أتى فراشه وهو ينوي أن يقوم فيصلي من الليل فغلبته عينه حتى يصبح - كتب له ما نوى وكان نومه صدقة عليه من ربه ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Darda’ conveyed that the Prophet (ﷺ) said:                     “Whoever goes to bed intending to wake up and pray during thenight,but is overwhelmed by sleep until morning comes, what heintended willbe recorded for him, and his sleep is a charity givento him by hisLord.”",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20315",
        "20320",
        "11060",
        "11331",
        "10793",
        "11174"
      ]
    },
    {
      "id": "sunan-ibn-majah-1550",
      "hadith_no": "1550",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا نصر بن علي الجهضمي، وهارون بن عبد الله الحمال، قالا حدثنا محمد بن بكر البرساني، أنبأنا يونس بن يزيد الأيلي، عن الزهري، عن أنس بن مالك، قال كان رسول الله  صلى الله عليه وسلم  وأبو بكر و عمر وعثمان يمشون أمام الجنازة ‏.‏",
      "text_en": " It wasnarrated that Anas bin Malik said:                      “The Messenger of Allah(ﷺ),Abu Bakr, ‘Umar and ‘Uthman used to walk ahead of the funeral(procession).”",
      "usc_msa_ref": "",
      "chain": [
        "30395",
        "30524",
        "20277",
        "20475",
        "11013",
        "19"
      ]
    },
    {
      "id": "sunan-ibn-majah-1732",
      "hadith_no": "1732",
      "source": "Sunan Ibn Majah",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عامر، ح وحدثنا عبد الرحمن بن إبراهيم، وهارون بن عبد الله الحمال، قالا حدثنا ابن أبي فديك، جميعا عن هشام بن سعد، عن عثمان بن حيان الدمشقي، حدثتني أم الدرداء، عن أبي الدرداء، أنه قال لقد رأيتنا مع رسول الله  صلى الله عليه وسلم  في بعض أسفاره في اليوم الحار الشديد الحر وإن الرجل ليضع يده على رأسه من شدة الحر وما في القوم أحد صائم إلا رسول الله  صلى الله عليه وسلم  وعبد الله بن رواحة ‏.‏",
      "text_en": " It wasnarrated that Abu Darda’ said:                      “We were with the Messenger ofAllah (ﷺ) on one of his journeys on a hot day, and it was extremelyhot. A man would put his hand over his head because of the intenseheat. No one among the people was fasting except for the Messenger ofAllah (ﷺ) and ‘Abdullah bin Rawahah.”",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20443",
        "30285",
        "30524",
        "20172",
        "20519",
        "11890",
        "11457",
        "37"
      ]
    },
    {
      "id": "sunan-ibn-majah-2702",
      "hadith_no": "2702",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا هارون بن عبد الله الحمال، حدثنا حجاج بن محمد، حدثنا يونس بن أبي إسحاق، عن أبي إسحاق، عن أبي جحيفة، عن علي، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أصاب في الدنيا ذنبا فعوقب به فالله أعدل من أن يثني عقوبته على عبده ومن أذنب ذنبا في الدنيا فستره الله عليه فالله أكرم من أن يعود في شىء قد عفا عنه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ali that the Messenger of Allah (ﷺ) said:                     “Whoever commits a sin in this world and is punished for it, Allah (STW) is too just to repeat the punishment for his slave (in the hereafter). And whoever commits a sin in this world and Allah conceals him, Allah is too generous to go back to something that He has pardoned.”",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20381",
        "10846",
        "11049",
        "4047",
        "5"
      ]
    },
    {
      "id": "sunan-ibn-majah-2866",
      "hadith_no": "2866",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا هارون بن عبد الله الحمال، حدثنا ابن أبي فديك، عن الخليل بن عبد الله، عن الحسن، عن علي بن أبي طالب، وأبي الدرداء، وأبي، هريرة وأبي أمامة الباهلي وعبد الله بن عمر وعبد الله بن عمرو وجابر بن عبد الله وعمران بن الحصين كلهم يحدث عن رسول الله صلى الله عليه وسلم أنه قال ‏\"‏ من أرسل بنفقة في سبيل الله وأقام في بيته فله بكل درهم سبعمائة درهم ومن غزا بنفسه في سبيل الله وأنفق في وجه ذلك فله بكل درهم سبعمائة ألف درهم ‏\"‏ ‏.‏ ثم تلا هذه الآية ‏{والله يضاعف لمن يشاء}‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Ali bin Abu Talib, Abu Darda’, Abu Hurairah, AbuUmamah Al-Bahili, ‘Abdullah bin ‘Umar, ‘Abdullah bin ‘Amr,Jabir bin‘Abdullah and ‘Imran bin Husain, all of them narratingthat theMessenger of Allah (ﷺ) said:                      “Whoever sends financialsupport in thecause of Allah and stays at home, for every Dirham hewill have (thereward of) seven hundred Dirham. Whoever fightshimself in the causeof Allah, and spends on that, for every Dirhamhe will have (thereward of) seven hundred thousand Dirham.” Thenhe recited the Verse:“Allah gives manifold increase to whom Hewills.”[2:261]",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20172",
        "11016",
        "5",
        "37"
      ]
    },
    {
      "id": "sunan-ibn-majah-2887",
      "hadith_no": "2887",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا هارون بن عبد الله الحمال، حدثنا حجاج بن محمد، حدثنا ابن جريج، أخبرني محمد بن طلحة بن عبد الله بن عبد الرحمن بن أبي بكر الصديق، عن أبيه، طلحة عن معاوية بن جاهمة السلمي، أن جاهمة، أتى النبي صلى الله عليه وسلم فذكر نحوه ‏.‏ قال أبو عبد الله بن ماجه هذا جاهمة بن عباس بن مرداس السلمي الذي عاتب النبي صلى الله عليه وسلم يوم حنين ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20381",
        "11070",
        "20604",
        "5299"
      ]
    },
    {
      "id": "sunan-ibn-majah-3269",
      "hadith_no": "3269",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Sacrifices - كتاب الأضاحي",
      "chapter_no": "26",
      "text_ar": "حدثنا هارون بن عبد الله الحمال، حدثنا سفيان بن عيينة، عن عبد الرحمن بن حميد بن عبد الرحمن بن عوف، عن سعيد بن المسيب، عن أم سلمة، أن النبي  صلى الله عليه وسلم  قال ‏\"‏ إذا دخل العشر وأراد أحدكم أن يضحي فلا يمس من شعره ولا بشره شيئا ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Umm Salamah that the Prophet (ﷺ) said:                      “Whentheten days (of Dhul-Hijjah) begin, and one of you wants to offer asacrifice, let him not remove anything from his hair or skin.”",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20005",
        "11193",
        "11002",
        "56"
      ]
    },
    {
      "id": "sunan-ibn-majah-3342",
      "hadith_no": "3342",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hunting - كتاب الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا هارون بن عبد الله الحمال، حدثنا هاشم بن القاسم، حدثنا زياد بن عبد الله بن علاثة، عن موسى بن محمد بن إبراهيم، عن أبيه، عن جابر، وأنس بن مالك، أن النبي  صلى الله عليه وسلم  كان إذا دعا على الجراد قال ‏\"‏ اللهم أهلك كباره واقتل صغاره وأفسد بيضه واقطع دابره وخذ بأفواهها عن معايشنا وأرزاقنا إنك سميع الدعاء ‏\"‏ ‏.‏ فقال رجل يا رسول الله كيف تدعو على جند من أجناد الله بقطع دابره قال ‏\"‏ إن الجراد نثرة الحوت في البحر ‏\"‏ ‏.‏ قال هاشم قال زياد فحدثني من رأى الحوت ينثره ‏.‏",
      "text_en": " It wasnarrated from Jabir and Anas bin Malik that whenever theMessenger ofAllah (ﷺ) supplicated against the locusts, he said:                      “OAllah,destroy their large ones and kill their small ones, spoil theireggsand root them out. Take their mouths away from our livelihood andprovision, for You are the One Who hears the prayers.” A man said:“OMessenger of Allah, are you praying against one of the troops ofAllah, that they may be rooted out?” He said: “Locusts weresneezedout by the fish in the sea.”",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20390",
        "28189",
        "34",
        "19"
      ]
    },
    {
      "id": "sunan-ibn-majah-3896",
      "hadith_no": "3896",
      "source": "Sunan Ibn Majah",
      "chapter": "Interpretation of Dreams - كتاب تعبير الرؤيا",
      "chapter_no": "35",
      "text_ar": "حدثنا هارون بن عبد الله الحمال، حدثنا سفيان بن عيينة، عن عبيد الله بن أبي يزيد، عن أبيه، عن سباع بن ثابت، عن أم كرز الكعبية، قالت سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ ذهبت النبوة وبقيت المبشرات ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Umm Kurz Al-Ka’biyyah said:                      “I heard theMessengerof Allah (ﷺ) say: ‘Prophecy is gone, but good dreamsremain.’”",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20005",
        "11258",
        "13153",
        "5048",
        "3182"
      ]
    },
    {
      "id": "sunan-ibn-majah-4202",
      "hadith_no": "4202",
      "source": "Sunan Ibn Majah",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا محمد بن الصباح، ونصر بن علي، وهارون بن عبد الله الحمال، قالوا حدثنا سفيان بن عيينة، عن محمد بن سوقة، سمع نافع بن جبير، يخبر عن أم سلمة، قالت ذكر النبي  صلى الله عليه وسلم  الجيش الذي يخسف بهم فقالت أم سلمة يا رسول الله لعل فيهم المكره قال ‏\"‏ إنهم يبعثون على نياتهم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Umm Salamah said:                      “The Prophet (ﷺ) mentionedthe army that would be swallowed up by the earth, and Umm Salamahsaid: ‘O Messenger of Allah, perhaps there will be some among themwho were forced (to join them)?’ He said: ‘They will beresurrected according to their intentions.’”",
      "usc_msa_ref": "",
      "chain": [
        "30269",
        "30395",
        "30524",
        "20005",
        "11387",
        "11059",
        "56"
      ]
    }
  ],
  "total_hadiths": 197
}