{
  "id": "30523",
  "name": "Mansur bin Abi Mazahim منصور بن أبي مزاحم بشير التركي",
  "full_name": "Mansur bin Abi Mazahim (Bashir) منصور بن أبي مزاحم بشير التركي",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "235",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Baghdad"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  د  س  -  ثقة ]"
    ],
    "tags": [
      "al-Baghdadi",
      "Client",
      "al-Azdi"
    ],
    "area_of_interest_display": [
      {
        "en": "Narrator[Grade:Thiqah] [ م  د  س  -  ثقة ]",
        "ar": "Narrator[Grade:Thiqah] [ م  د  س  -  ثقة ]",
        "ckb": "Narrator[Grade:Thiqah] [ م  د  س  -  ثقة ]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "al-Baghdad",
        "ar": "al-Baghdad",
        "ckb": "al-Baghdad"
      }
    ],
    "tags_display": [
      {
        "en": "al-Baghdadi",
        "ar": "al-Baghdadi",
        "ckb": "al-Baghdadi"
      },
      {
        "en": "Client (Mawla)",
        "ar": "مولى",
        "ckb": "مەولا"
      },
      {
        "en": "al-Azdi",
        "ar": "al-Azdi",
        "ckb": "al-Azdi"
      }
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [7th Generation]",
        "ar": "تابع التابعين [الجيل السابع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی حەوتەم]"
      }
    },
    {
      "id": "20169",
      "name": "Falayh bin Suliaman فليح بن سليمان",
      "grade": "Succ. (Taba' Tabi') [7th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [7th Generation]",
        "ar": "تابع التابعين [الجيل السابع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی حەوتەم]"
      }
    },
    {
      "id": "20506",
      "name": "Abu Uvais al-Madni أبو أويس المدني الأصبحي",
      "grade": "Succ. (Taba' Tabi') [7th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [7th Generation]",
        "ar": "تابع التابعين [الجيل السابع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی حەوتەم]"
      }
    },
    {
      "id": "20635",
      "name": "Muhammad bin Muslim bin Abi al-Wadah محمد بن مسلم بن أبي الوضاح",
      "grade": "Succ. (Taba' Tabi') [8th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [8th Generation]",
        "ar": "تابع التابعين [الجيل الثامن]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی هەشتەم]"
      }
    },
    {
      "id": "20402",
      "name": "Yahya bin Hamza bin Waqd يحيى بن حمزة بن واقد",
      "grade": "Succ. (Taba' Tabi') [8th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [8th Generation]",
        "ar": "تابع التابعين [الجيل الثامن]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی هەشتەم]"
      }
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [8th Generation]",
        "ar": "تابع التابعين [الجيل الثامن]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی هەشتەم]"
      }
    },
    {
      "id": "25208",
      "name": "'Umar bin 'Abdur Rahman عمر بن عبد الرحمن بن قيس",
      "grade": "Succ. (Taba' Tabi') [8th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [8th Generation]",
        "ar": "تابع التابعين [الجيل الثامن]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی هەشتەم]"
      }
    },
    {
      "id": "20509",
      "name": "'Abdur Rahman bin Abi al-Zanad عبد الرحمن بن أبي الزناد",
      "grade": "Succ. (Taba' Tabi') [7th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [7th Generation]",
        "ar": "تابع التابعين [الجيل السابع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی حەوتەم]"
      }
    },
    {
      "id": "20327",
      "name": "Abu al-Ahwus, Salam bin Sulaym al-Hanafi أبو الأحوص سلام بن سليم الحنفي",
      "grade": "Succ. (Taba' Tabi') [7th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [7th Generation]",
        "ar": "تابع التابعين [الجيل السابع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی حەوتەم]"
      }
    },
    {
      "id": "20616",
      "name": "Yahya bin Ya'la يحيى بن يعلى أبو المحياة",
      "grade": "Succ. (Taba' Tabi') [8th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [8th Generation]",
        "ar": "تابع التابعين [الجيل الثامن]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی هەشتەم]"
      }
    },
    {
      "id": "20373",
      "name": "Abu Bakr bin 'Ayyash al-Asadi أبو بكر بن عياش بن سالم الأسدي",
      "grade": "Succ. (Taba' Tabi') [7th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [7th Generation]",
        "ar": "تابع التابعين [الجيل السابع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی حەوتەم]"
      }
    },
    {
      "id": "20150",
      "name": "Ibrahim bin Sa'd bin Ibrahim إبراهيم بن سعد بن إبراهيم",
      "grade": "Succ. (Taba' Tabi') [8th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [8th Generation]",
        "ar": "تابع التابعين [الجيل الثامن]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی هەشتەم]"
      }
    }
  ],
  "students": [
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]",
      "grade_display": {
        "en": "3rd Century AH [Shafi'i]",
        "ar": "القرن الثالث الهجري [شافعي]",
        "ckb": "سەدەی سێیەمی كۆچی [شافیعی]"
      }
    },
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]",
      "grade_display": {
        "en": "3rd Century AH [11th Generation]",
        "ar": "القرن الثالث الهجري [الجيل الحادي عشر]",
        "ckb": "سەدەی سێیەمی كۆچی [نەوەی یازدەیەم]"
      }
    }
  ],
  "hadiths": [
    {
      "id": "sahih-muslim-258",
      "hadith_no": "258",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا منصور بن أبي مزاحم، حدثنا إبراهيم بن سعد، ح وحدثني محمد بن جعفر بن زياد، أخبرنا إبراهيم، - يعني ابن سعد - عن ابن شهاب، عن سعيد بن المسيب، عن أبي هريرة، قال سئل رسول الله صلى الله عليه وسلم أى الأعمال أفضل قال ‏\"‏ إيمان بالله ‏\"‏ ‏.‏ قال ثم ماذا قال ‏\"‏ الجهاد في سبيل الله ‏\"‏ ‏.‏ قال ثم ماذا قال ‏\"‏ حج مبرور ‏\"‏ ‏.‏ وفي رواية محمد بن جعفر قال ‏\"‏ إيمان بالله ورسوله ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      The Messenger of Allah was asked about the best of deeds. He observed: Belief in Allah. He (the inquirer) said: What next? He (the Holy Prophet) replied: Jihad (struggle to the utmost) in the cause of Allah. He (the inquirer) again said: What next? He (the Holy Prophet) replied: Pilgrimage accepted into the grace of the Lord. In the. tradition narrated on the authority of Muhammad b. Ja'far (the words are) that he (the Holy Prophet) said: Belief in Allah and His Messenger. Muhammad b. Rafi and 'Abd b. Humaid, 'Abdur-Razzaq and Ma'mar and Zuhri have narrated a hadith like this on the authority of the same chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30523",
        "20150",
        "20173",
        "20150",
        "11013",
        "11002",
        "13"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-1444",
      "hadith_no": "1444",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا منصور بن أبي مزاحم، حدثنا عبد الله بن المبارك، عن أبي بكر بن عثمان بن سهل بن حنيف، قال سمعت أبا أمامة بن سهل، يقول صلينا مع عمر بن عبد العزيز الظهر ثم خرجنا حتى دخلنا على أنس بن مالك فوجدناه يصلي العصر فقلت يا عم ما هذه الصلاة التي صليت قال العصر وهذه صلاة رسول الله صلى الله تعالى عليه وسلم التي كنا نصلي معه ‏.‏",
      "text_en": " Abu Umama b. Sahl reported:                      We offered the noon prayer with Umar b. 'Abd al-'Aziz. We then set out till we came to Anas b. Malik and found him busy in saying the afternoon prayer. I said to him: O uncle! which is this prayer that you are offering? He said: It is the afternoon prayer and this is the prayer of the Messenger of Allah (may peace be upon him) that we offered along with him.",
      "usc_msa_ref": "",
      "chain": [
        "30523",
        "20025",
        "11548",
        "15659"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-3692",
      "hadith_no": "3692",
      "source": "Sahih Muslim",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "وحدثناه منصور بن أبي مزاحم، حدثنا إبراهيم بن سعد، عن الزهري، عن عروة، عن عائشة، قالت دخل قائف ورسول الله صلى الله عليه وسلم شاهد وأسامة بن زيد وزيد بن حارثة مضطجعان فقال إن هذه الأقدام بعضها من بعض ‏.‏ فسر بذلك النبي صلى الله عليه وسلم وأعجبه وأخبر به عائشة ‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her) reported:                      A physiognomist visited (our house) and Allah's Messenger (may peace be upon him) was present, and Usama b. Zaid and Zaid b. Haritha were both lying asleep, and he (the physiognomist), said: These feet are related to one another. Allah's Apostle (may peace be upon him) was pleased to hear this, and he was happy and informed 'A'isha (Allah be pleased with her) about it.",
      "usc_msa_ref": "",
      "chain": [
        "30523",
        "20150",
        "11013",
        "10511",
        "53"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-4081",
      "hadith_no": "4081",
      "source": "Sahih Muslim",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا منصور بن أبي مزاحم، ومحمد بن جعفر بن زياد، - قال منصور حدثنا إبراهيم بن سعد، عن الزهري، وقال ابن جعفر، أخبرنا إبراهيم، وهو ابن سعد عن ابن، شهاب عن عبيد الله بن عبد الله بن عتبة، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ كان رجل يداين الناس فكان يقول لفتاه إذا أتيت معسرا فتجاوز عنه لعل الله يتجاوز عنا ‏.‏ فلقي الله فتجاوز عنه ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      There was a person who gave loans to the people and said to his men: When an insolvent comes to you show him leniency that Allah may overlook our (faults). So when he met Allah, He overlooked his faults (forgave him).",
      "usc_msa_ref": "",
      "chain": [
        "30523",
        "20173",
        "11067",
        "20150",
        "11013",
        "11051",
        "30008",
        "11013",
        "11004",
        "13"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-4994",
      "hadith_no": "4994",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا منصور بن أبي مزاحم، حدثنا يحيى بن حمزة، عن محمد بن الوليد الزبيدي، عن الزهري، عن عطاء بن يزيد الليثي، عن أبي سعيد الخدري، أن رجلا، أتى النبي صلى الله عليه وسلم فقال أى الناس أفضل فقال ‏\"‏ رجل يجاهد في سبيل الله بماله ونفسه ‏\"‏ قال ثم من قال ‏\"‏ مؤمن في شعب من الشعاب يعبد الله ربه ويدع الناس من شره ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Abu Sa'id Khudri that a man came to the Holy Prophet (may peace he upon him) and said:                      Who is the best of men? He replied: A man who fights in the way of Allah spending his wealth and staking his life. The man then asked: Who is next to him (in excellence)? He said: Next to him is a believer who lives in a mountain gorge worshipping hid Lord and sparing men from his mischief.",
      "usc_msa_ref": "",
      "chain": [
        "30523",
        "20402",
        "20459",
        "11013",
        "11206",
        "38"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-5064",
      "hadith_no": "5064",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا منصور بن أبي مزاحم، حدثنا يحيى بن حمزة، عن عبد الرحمن بن يزيد، بن جابر أن عمير بن هانئ، حدثه قال سمعت معاوية، على المنبر يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا تزال طائفة من أمتي قائمة بأمر الله لا يضرهم من خذلهم أو خالفهم حتى يأتي أمر الله وهم ظاهرون على الناس ‏\"‏ ‏.‏",
      "text_en": " It his been narrated on the authority of Umair b. Umm Hani who said:                      I heard Mu'awiya say (while delivering a sermon from the pulpit) that he heard the Messenger of Allah (may peace be upon him) say: A group of people from my Umma will continue to obey Allah's Command, and those who desert or oppose them shall not be able to do them any harm. They will be dominating the peeple until Allah's Command is executed (i. e. Resurrection is established).",
      "usc_msa_ref": "",
      "chain": [
        "30523",
        "20402",
        "20395",
        "11415"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-5647",
      "hadith_no": "5647",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "حدثنا منصور بن أبي مزاحم، حدثنا إبراهيم بن سعد، عن الزهري، عن القاسم،بن محمد عن عائشة، قالت دخل على رسول الله صلى الله عليه وسلم وأنا متسترة بقرامفيه صورة فتلون وجهه ثم تناول الستر فهتكه ثم قال ‏\"‏ إن من أشد الناس عذابا يومالقيامة الذين يشبهون بخلق الله ‏\"‏ ‏.‏",
      "text_en": " A'isha reported that Allah's Messenger (may peace be upon him) entered (my apartment) and I had hung (on the door of my apartment) a thin curtain having pictures on it. The colour of his face underwent a change. He then took hold of that curtain and tore it and then said:                      The most grievous torfnent for the people on the Day of Resurrection would be for those who try to imitate Allah in the act of creation.",
      "usc_msa_ref": "",
      "chain": [
        "30523",
        "20150",
        "11013",
        "53"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-6149",
      "hadith_no": "6149",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا منصور بن أبي مزاحم، حدثنا إبراهيم، - يعني ابن سعد - عن الزهري، ح وحدثني أبو عمران، محمد بن جعفر بن زياد - واللفظ له - أخبرنا إبراهيم، عن ابن، شهاب عن عبيد الله بن عبد الله بن عتبة بن مسعود، عن ابن عباس، قال كان رسول الله صلى الله عليه وسلم أجود الناس بالخير وكان أجود ما يكون في شهر رمضان إن جبريل عليه السلام كان يلقاه في كل سنة في رمضان حتى ينسلخ فيعرض عليه رسول الله صلى الله عليه وسلم القرآن فإذا لقيه جبريل كان رسول الله صلى الله عليه وسلم أجود بالخير من الريح المرسلة ‏.‏",
      "text_en": " Ibn 'Abbas reported that Allah's Messenger (may peace be upon him) was the most generous of people in charity, but he was generous to the utmost in the month of Ramadan. Gabriel (peace be upon him) would meet him every year during the month of Ramadin until it ended, and Allah's Messenger (may peace be upon him) recited to him the Qur'an; and when Gabriel met him Allah's Messenger (may peace be upon him) was most generous in giving charity like the blowing wind.",
      "usc_msa_ref": "",
      "chain": [
        "30523",
        "20150",
        "11013",
        "11051",
        "11013",
        "11004",
        "17"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-6208",
      "hadith_no": "6208",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا منصور بن أبي مزاحم، ومحمد بن جعفر بن زياد، قال منصور حدثنا وقال، ابن جعفر أخبرنا إبراهيم، - يعنيان ابن سعد - عن ابن شهاب، عن عبيد الله بن عبد، الله عن ابن عباس، قال كان أهل الكتاب يسدلون أشعارهم وكان المشركون يفرقون رءوسهم وكان رسول الله صلى الله عليه وسلم يحب موافقة أهل الكتاب فيما لم يؤمر به فسدل رسول الله صلى الله عليه وسلم ناصيته ثم فرق بعد ‏.‏",
      "text_en": " Ibn Abbas reported that the People of the Book used to let their hair fall (on their foreheads) and the polytheists used to part them on their heads, and Allah's Messenger (may peace be upon him) liked to conform his behaviour to the People of the Book in matters in which he received no command (from God) ; so Allah's Messenger (may peace be upon him) let fall his hair upon his forehead, and then he began to part it after this.",
      "usc_msa_ref": "",
      "chain": [
        "30523",
        "20173",
        "11067",
        "11013",
        "11004",
        "17"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-6340",
      "hadith_no": "6340",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا منصور بن أبي مزاحم، حدثنا إبراهيم بن سعد، عن صالح بن كيسان، ح وحدثنا زهير بن حرب، والحسن بن علي الحلواني، وعبد بن حميد، - واللفظ لهم - قالوا حدثنا يعقوب بن إبراهيم، حدثنا أبي، عن صالح، عن ابن شهاب، حدثني أبو أمامة، بن سهل أنه سمع أبا سعيد الخدري، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ بينا أنا نائم رأيت الناس يعرضون وعليهم قمص منها ما يبلغ الثدي ومنها ما يبلغ دون ذلك ومر عمر بن الخطاب وعليه قميص يجره ‏\"‏ ‏.‏ قالوا ماذا أولت ذلك يا رسول الله قال ‏\"‏ الدين ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id Khudri reported Allah's Messenger (may peace be upon him) as say ing:                      While I was asleep I saw people being presented to me (in a dream) and they wore shirts and some of these reached up to the breasts and some even beyond them. Then there happened to pass 'Umar b. Khattab and his shirt had been trailing. They said: Allah's Messeneer, how do you interpret the dream? He said: (As strength of) faith.",
      "usc_msa_ref": "",
      "chain": [
        "30523",
        "20150",
        "11176",
        "30022",
        "30115",
        "30553",
        "20184",
        "20150",
        "11176",
        "11013",
        "15659",
        "38"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-6355",
      "hadith_no": "6355",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا منصور بن أبي مزاحم، حدثنا إبراهيم يعني ابن سعد، ح وحدثنا حسن، الحلواني وعبد بن حميد قال عبد أخبرني وقال، حسن حدثنا يعقوب، - وهو ابن إبراهيم بن سعد - حدثنا أبي، عن صالح، عن ابن شهاب، أخبرني عبد الحميد بن عبد الرحمن، بن زيد أن محمد بن سعد بن أبي وقاص، أخبره أن أباه سعدا قال استأذن عمر على رسول الله صلى الله عليه وسلم وعنده نساء من قريش يكلمنه ويستكثرنه عالية أصواتهن فلما استأذن عمر قمن يبتدرن الحجاب فأذن له رسول الله صلى الله عليه وسلم ورسول الله صلى الله عليه وسلم يضحك فقال عمر أضحك الله سنك يا رسول الله ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ عجبت من هؤلاء اللاتي كن عندي فلما سمعن صوتك ابتدرن الحجاب ‏\"‏ ‏.‏ قال عمر فأنت يا رسول الله أحق أن يهبن ‏.‏ ثم قال عمر أى عدوات أنفسهن أتهبنني ولا تهبن رسول الله صلى الله عليه وسلم قلن نعم أنت أغلظ وأفظ من رسول الله صلى الله عليه وسلم ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ والذي نفسي بيده ما لقيك الشيطان قط سالكا فجا إلا سلك فجا غير فجك ‏\"‏ ‏.‏",
      "text_en": " Sa'd b. Waqqas reported that Umar sought permission from Allah's Messenger (may peace be upon him) to visit him when some women of the Quraish were busy in talking with him and raising their voices above his Voiee. When'Umar sought permission they stood up and went hurriedly behind the curtain. Allah's Messenger (may peace be upon him) gave him permission smilingly. Thereupon 'Umar said:                      Allah's Messenger, may Allah keep you happy all your life. Then Allah's Messenger (may peace be upon him) said: I wonder at these women who were with me and no sooner did they hear your voice, they immediately went behind the curtain. Thereupon 'Umar said: Allah's Messenger, you have more right that they should fear you. Then Umar (addressing the women) said: O ye enemies of yourselves, do you fear me and fear not the Messenger of Allah (may peace be upon him)? They said: Yes, you are harsh and strict as compared to the Messenger of Allah (may peace be upon him). Thereupon, Allah's Messenger (maypeace be upon him) said: By Him in Whose Hand is my life, if satan would encounter you in the way he would certainly take a different way from that of yours.",
      "usc_msa_ref": "",
      "chain": [
        "30523",
        "20150",
        "20184",
        "20150",
        "11176",
        "11013",
        "10553"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-6386",
      "hadith_no": "6386",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا منصور بن أبي مزاحم، حدثنا إبراهيم، - يعني ابن سعد - عن أبيه، عن  عبد الله بن شداد، قال سمعت عليا، يقول ما جمع رسول الله صلى الله عليه وسلم أبويه لأحد غير سعد بن مالك فإنه جعل يقول له يوم أحد ‏\"‏ ارم فداك أبي وأمي ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. Shaddad reported that he heard 'Allahs saying:                      Allah's Messenger (may peace be upon him) did not gather his parents except in case of Sa'd b. Malik that he said to him on the Day of Ubud: Shoot an arrow, may my father and mother be taken as ransom for you.",
      "usc_msa_ref": "",
      "chain": [
        "30523",
        "20150",
        "11063",
        "169",
        "5"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-6465",
      "hadith_no": "6465",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا منصور بن أبي مزاحم، حدثنا إبراهيم، - يعني ابن سعد - عن أبيه، عن  عروة، عن عائشة، ح",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30523",
        "20150",
        "11063",
        "10511"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-7579",
      "hadith_no": "7579",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا منصور بن أبي مزاحم، حدثنا يحيى بن حمزة، عن الأوزاعي، عن إسحاق، بن عبد الله عن عمه، أنس بن مالك أن رسول الله صلى الله عليه وسلم قال ‏\"‏ يتبع الدجال من يهود أصبهان سبعون ألفا عليهم الطيالسة ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik reported that Allah's Messenger (may peace be upon him) said:                      The Dajjal would be followed by seventy thousand Jews of Isfahan wearing Persian shawls.",
      "usc_msa_ref": "",
      "chain": [
        "30523",
        "20402",
        "20024",
        "11151",
        "19"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sunan-abi-daud-2889",
      "hadith_no": "2889",
      "source": "Sunan Abi Da'ud",
      "chapter": "Shares of Inheritance (Kitab Al-Fara'id) - كتاب الفرائض",
      "chapter_no": "19",
      "text_ar": "حدثنا منصور بن أبي مزاحم، حدثنا أبو بكر، عن أبي إسحاق، عن البراء بن عازب، قال جاء رجل إلى النبي صلى الله عليه وسلم فقال يا رسول الله يستفتونك في الكلالة فما الكلالة قال ‏\"‏ تجزيك آية الصيف ‏\"‏ ‏.‏ فقلت لأبي إسحاق هو من مات ولم يدع ولدا ولا والدا قال كذلك ظنوا أنه كذلك ‏.‏",
      "text_en": " Narrated Al-Bara' ibn Azib:                     A man came to the Prophet (ﷺ) and said: Messenger of Allah, they ask thee for a legal decision about a kalalah. What is meant by kalalah? He replied: The verse revealed in summer is sufficient for you.  I asked AbuIshaq: Does it mean a person who dies and leaves neither children nor father? He said: This is so. The people think it is so.",
      "usc_msa_ref": "",
      "chain": [
        "30523",
        "20436",
        "11049",
        "400"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-an-nasai-5133",
      "hadith_no": "5133",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا أبو بكر بن علي، قال حدثنا منصور بن أبي مزاحم، قال أنبأنا إبراهيم بن سعد، عن أبيه، عن محمد بن عبد الله بن عمرو بن هشام، عن بكير، عن بسر بن سعيد، عن زينب الثقفية، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا خرجت المرأة إلى العشاء الآخرة فلا تمس طيبا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Zainab Ath-Thaqafiyyah that:                     The Messenger of Allah [SAW] said: \"If a woman goes out to (pray) 'Isha', let her not touch perfume.\"",
      "usc_msa_ref": "",
      "chain": [
        "30523",
        "20150",
        "11063",
        "11154",
        "11153",
        "498"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    }
  ],
  "total_hadiths": 16,
  "grade_display": {
    "en": "3rd Century AH [10th Generation]",
    "ar": "القرن الثالث الهجري [الجيل العاشر]",
    "ckb": "سەدەی سێیەمی كۆچی [نەوەی دەیەم]"
  }
}