{
  "id": "30537",
  "name": "Bashr bin Hilal al-Swaf بشر بن هلال الصواف",
  "full_name": "Bashr bin Hilal al-Swaf بشر بن هلال الصواف",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "247",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  4  -  ثقة ]"
    ],
    "tags": []
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20532",
      "name": "Ja'far bin Sulaiman al-Daba'i جعفر بن سليمان الضبعي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20258",
      "name": "'Abdul Warith bin Sa'id bin Dhakwan عبد الوارث بن سعيد بن ذكوان",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20304",
      "name": "Yazid bin Zari' يزيد بن زريع",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20031",
      "name": "Yahya bin Sa'id bin Farroukh al-Qatan يحيى بن سعيد بن فروخ القطان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30004",
      "name": "Ibn Maja ابن ماجة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]"
    },
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "30005",
      "name": "Imam Tirmidhi الترمذي محمد بن عيسى بن سورة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30006",
      "name": "Imam Nasa'i أحمد بن شعيب بن علي بن سنان النسائي",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30313",
      "name": "Ishaq bin Mansur al-Kausaj إسحاق بن منصور بن بهرام - الكوسج",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "4347",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "وحدثنا محمد بن عبد الله بن نمير، حدثنا أبي ح، وحدثنا محمد بن المثنى، حدثنا يحيى، - وهو القطان - عن عبيد الله، ح وحدثني بشر بن هلال، حدثنا عبد الوارث، حدثنا أيوب، ح وحدثنا أبو كريب، حدثنا أبو أسامة، عن الوليد بن كثير، ح وحدثنا ابن أبي عمر، حدثنا سفيان، عن إسماعيل بن أمية، ح وحدثنا ابن رافع، حدثنا ابن أبي فديك، أخبرنا الضحاك، وابن أبي ذئب، ح وحدثنا إسحاق بن إبراهيم، وابن، رافع عن عبد الرزاق، عن ابن جريج، أخبرني عبد الكريم، ‏.‏ كل هؤلاء عن نافع، عن ابن عمر، بمثل هذه القصة عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " This hadith is narrated on the authority of Ibn Umar through another chain of transmitters.",
      "chain": [
        "30212",
        "20331",
        "30170",
        "20031",
        "11201",
        "30537",
        "20258",
        "11015",
        "30216",
        "20318",
        "11230",
        "30421",
        "20005",
        "11417"
      ]
    },
    {
      "hadith_no": "5829",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثنا بشر بن هلال الصواف، حدثنا عبد الوارث، حدثنا عبد العزيز بن صهيب، عن أبي نضرة، عن أبي سعيد، أن جبريل، أتى النبي صلى الله عليه وسلم فقال يا محمد اشتكيت فقال ‏\"‏ نعم ‏\"‏ ‏.‏ قال باسم الله أرقيك من كل شىء يؤذيك من شر كل نفس أو عين حاسد الله يشفيك باسم الله أرقيك ‏.‏",
      "text_en": " Abu Sa'id reported that Gabriel came to AJlah's Messenger (may peace be upon him) and said:                      Muhammad, have you fallen ill? Thereupon he said: Yes. He (Gabriel) said:\" In the name of Allah I exercise you from everything and safeguard you from every evil that may harm you and from the eye of a jealous one. Allah would cure you and I invoke the name of Allah for you.\"",
      "chain": [
        "30537",
        "20258",
        "11295",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "993",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا بشر بن هلال، حدثنا عبد الوارث، عن إسماعيل بن أمية، سألت نافعا عن الرجل، يصلي وهو مشبك يديه قال قال ابن عمر تلك صلاة المغضوب عليهم ‏.‏",
      "text_en": " Isma’ll b. Umayyah said:                      I asked about a man who intertwines his fingers while he is engaged in prayer. He said that Ibn ‘Umar had said: This is the prayer of those who earn the anger of Allah.",
      "chain": [
        "30537",
        "20258",
        "11417",
        "11014"
      ]
    },
    {
      "hadith_no": "2186",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا بشر بن هلال، أن جعفر بن سليمان، حدثهم عن يزيد الرشك، عن مطرف بن عبد الله، أن عمران بن حصين، سئل عن الرجل، يطلق امرأته ثم يقع بها ولم يشهد على طلاقها ولا على رجعتها فقال طلقت لغير سنة ‏.‏ وراجعت لغير سنة أشهد على طلاقها وعلى رجعتها ولا تعد ‏.‏",
      "text_en": " Narrated Mutarrif ibn Abdullah:                     Imran ibn Husayn was asked about a person who divorces his wife, and then has intercourse with her, but he does not call any witness to her divorce nor to her restoration. He said: You divorced against the sunnah and took her back against the sunnah. Call someone to bear witness to her divorce, and to her return in marriage, and do not repeat it.",
      "chain": [
        "30537",
        "20532",
        "11319",
        "11305",
        "123"
      ]
    },
    {
      "hadith_no": "3108",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا بشر بن هلال، حدثنا عبد الوارث، عن عبد العزيز بن صهيب، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يدعون أحدكم بالموت لضر نزل به ولكن ليقل اللهم أحيني ما كانت الحياة خيرا لي وتوفني إذا كانت الوفاة خيرا لي ‏\"‏ ‏.‏",
      "text_en": " Narrated Anas:                     The Messenger of Allah (ﷺ) as saying: No one of you should wish for death for any calamity that befalls him, but he should say: O Allah! cause me to live so long as my life is better for me ; and cause me to die where death is better for me.",
      "chain": [
        "30537",
        "20258",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "775",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا بشر بن هلال البصري، حدثنا عبد الوارث بن سعيد، حدثنا أيوب، عن عكرمة، عن ابن عباس، قال احتجم رسول الله صلى الله عليه وسلم وهو محرم صائم ‏.‏ قال أبو عيسى هذا حديث صحيح ‏.‏ وهكذا روى وهيب نحو رواية عبد الوارث ‏.‏ وروى إسماعيل بن إبراهيم عن أيوب عن عكرمة مرسلا ولم يذكر فيه عن ابن عباس ‏.‏",
      "text_en": " Ibn Abbas narrated:                     \"the Messenger of Allah was cupped while he was fasting and in Ihram.\"",
      "chain": [
        "30537",
        "20258",
        "11015",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "865",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا بشر بن هلال الصواف البصري، حدثنا عبد الوارث بن سعيد، وعبد الوهاب الثقفي، عن خالد الحذاء، عن عكرمة، عن ابن عباس، قال طاف النبي صلى الله عليه وسلم على راحلته فإذا انتهى إلى الركن أشار إليه ‏.‏ قال وفي الباب عن جابر وأبي الطفيل وأم سلمة ‏.‏ قال أبو عيسى حديث ابن عباس حديث حسن صحيح ‏.‏ وقد كره قوم من أهل العلم أن يطوف الرجل بالبيت وبين الصفا والمروة راكبا إلا من عذر ‏.‏ وهو قول الشافعي ‏.‏",
      "text_en": " Ibn Abbas narrated:                     \"The Prophet performed Tawaf upon his mount, so when he arrived at the (Black Stone) corner, he pointed to it.\"",
      "chain": [
        "30537",
        "20258",
        "20259",
        "11282",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "972",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا بشر بن هلال البصري الصواف، حدثنا عبد الوارث بن سعيد، عن عبد العزيز بن صهيب، عن أبي نضرة، عن أبي سعيد، أن جبريل، أتى النبي صلى الله عليه وسلم فقال يا محمد اشتكيت قال ‏\"‏ نعم ‏\"‏ ‏.‏ قال باسم الله أرقيك من كل شيء يؤذيك من شر كل نفس وعين حاسد باسم الله أرقيك والله يشفيك ‏.‏",
      "text_en": " Abu Sa'eed narrated that:                     Jibril came to the Prophet and said: \"O Muhammad! Are you suffering?\" He said: \"Yes.\" He said: \"In the Name of Allah, I recite a prayer (Ruqyah) over you, from the evil of every person and evil eye. In the Name of Allah I recite a prayer (Ruqyah) over you, may Allah cure you.\"",
      "chain": [
        "30537",
        "20258",
        "11295",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "1575",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Military Expeditions - كتاب السير عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "21",
      "text_ar": "حدثنا بشر بن هلال الصواف، حدثنا جعفر بن سليمان الضبعي، عن ثابت، عن أنس، قال كان رسول الله صلى الله عليه وسلم يغزو بأم سليم ونسوة معها من الأنصار يسقين الماء ويداوين الجرحى ‏.‏ قال أبو عيسى وفي الباب عن الربيع بنت معوذ ‏.‏ وهذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Anas:                     \"The Messenger of Allah (ﷺ) used to go to battle with Umm Sulaim, and other women with her, from the Ansar, who would give water and attend to the wounded.\"[Abu 'Eisa said:] There is something on this topic from Ar-Rabi' bin Mu'awwidh. This Hadith is Hasan Sahih.",
      "chain": [
        "30537",
        "20532",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "2305",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا بشر بن هلال الصواف البصري، حدثنا جعفر بن سليمان، عن أبي طارق، عن الحسن، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من يأخذ عني هؤلاء الكلمات فيعمل بهن أو يعلم من يعمل بهن ‏\"‏ ‏.‏ فقال أبو هريرة فقلت أنا يا رسول الله فأخذ بيدي فعد خمسا وقال ‏\"‏ اتق المحارم تكن أعبد الناس وارض بما قسم الله لك تكن أغنى الناس وأحسن إلى جارك تكن مؤمنا وأحب للناس ما تحب لنفسك تكن مسلما ولا تكثر الضحك فإن كثرة الضحك تميت القلب ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من حديث جعفر بن سليمان ‏.‏ والحسن لم يسمع من أبي هريرة شيئا هكذا روي عن أيوب ويونس بن عبيد وعلي بن زيد قالوا لم يسمع الحسن من أبي هريرة ‏.‏ وروى أبو عبيدة الناجي عن الحسن هذا الحديث قوله ولم يذكر فيه عن أبي هريرة عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Al-Hasan narrated from Abu Hurairah that the Messenger of Allah (s.a.w)  said:                     \"Who will take these statements from me, so that he may act upon them, or teach one who will act upon them?\" So Abu Hurairah said: \"I said: 'I shall O Messenger of Allah!' So he (s.a.w) took my hand and enumerated five (things), he said: \"Be on guard against the unlawful and you shall be the most worshiping among the people, be satisfied with what Allah has alloted for you and you shall be the richest of the people, be kind to your neighbor and you shall be a believer, love for the people what you love for yourself and you shall be a Muslim. And do not laugh too much, for indeed increased laughter kills the heart.\"",
      "chain": [
        "30537",
        "20532",
        "11016",
        "13"
      ]
    },
    {
      "hadith_no": "2375",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا بشر بن هلال الصواف، حدثنا عبد الوارث بن سعيد، عن يونس، عن الحسن، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لعن عبد الدينار لعن عبد الدرهم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه وقد روي هذا الحديث من غير هذا الوجه عن أبي صالح عن أبي هريرة عن النبي صلى الله عليه وسلم أيضا أتم من هذا وأطول ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah (s.a.w)  said:                     \"Cursed be the slave of the Dinar, cursed be the slave of the Dirham.\"",
      "chain": [
        "30537",
        "20258",
        "20475",
        "11016",
        "13"
      ]
    },
    {
      "hadith_no": "2704",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا بشر بن هلال البصري، حدثنا جعفر بن سليمان، عن سعيد الجريري، ح قال وحدثنا هارون بن عبد الله البزاز، حدثنا سيار، حدثنا جعفر بن سليمان، عن سعيد الجريري المعنى، واحد، عن أبي عثمان النهدي، عن حنظلة الأسيدي، وكان، من كتاب النبي صلى الله عليه وسلم أنه مر بأبي بكر وهو يبكي فقال ما لك يا حنظلة قال نافق حنظلة يا أبا بكر نكون عند رسول الله صلى الله عليه وسلم يذكرنا بالنار والجنة كأنا رأى عين فإذا رجعنا إلى الأزواج والضيعة نسينا كثيرا ‏.‏ قال فوالله إنا لكذلك انطلق بنا إلى رسول الله صلى الله عليه وسلم ‏.‏ فانطلقنا فلما رآه رسول الله صلى الله عليه وسلم قال ‏\"‏ ما لك يا حنظلة ‏\"‏ ‏.‏ قال نافق حنظلة يا رسول الله نكون عندك تذكرنا بالنار والجنة كأنا رأى عين فإذا رجعنا عافسنا الأزواج والضيعة ونسينا كثيرا ‏.‏ قال فقال رسول الله صلى الله عليه وسلم ‏\"‏ لو تدومون على الحال الذي تقومون بها من عندي لصافحتكم الملائكة في مجالسكم وفي طرقكم وعلى فرشكم ولكن يا حنظلة ساعة وساعة وساعة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Abu 'Uthman narrated from Hanzalah Al-Usaidi",
      "chain": [
        "30537",
        "20532",
        "11286",
        "11429",
        "20532",
        "11113"
      ]
    },
    {
      "hadith_no": "3190",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Recitation - كتاب القراءات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "46",
      "text_ar": "حدثنا بشر بن هلال الصواف، حدثنا جعفر بن سليمان الضبعي، عن هارون الأعور، عن بديل بن ميسرة، عن عبد الله بن شقيق، عن عائشة، أن النبي صلى الله عليه وسلم كان يقرأ ‏(‏فروح وريحان وجنة نعيم ‏)‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من حديث هارون الأعور ‏.‏",
      "text_en": " Narrated 'Aishah:                     that the Prophet (ﷺ) would recite: \"Furuhun Wa Raihanun Wa Jannatu Na'im (56:89)\"",
      "chain": [
        "30537",
        "20532",
        "10672",
        "10694",
        "53"
      ]
    },
    {
      "hadith_no": "3978",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا بشر بن هلال الصواف البصري، حدثنا جعفر بن سليمان الضبعي، عن ثابت، عن أنس بن مالك، قال لما كان اليوم الذي دخل فيه رسول الله صلى الله عليه وسلم المدينة أضاء منها كل شيء فلما كان اليوم الذي مات فيه أظلم منها كل شيء وما نفضنا عن رسول الله صلى الله عليه وسلم الأيدي وإنا لفي دفنه حتى أنكرنا قلوبنا ‏.‏ قال أبو عيسى هذا حديث غريب صحيح ‏.‏",
      "text_en": " Narrated Anas bin Malik:                     \"On the day in which the Messenger of Allah (ﷺ) entered Al-Madinah, everything in it was illuminated. Then, on the day in which he died, everything in it was dark. And we did not remove our hands from the Messenger of Allah (ﷺ), while we were burying him because our hearts felt so estranged.\"",
      "chain": [
        "30537",
        "20532",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "163",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا بشر بن هلال، قال حدثنا عبد الوارث، عن أيوب، عن هشام بن عروة، عن أبيه، عن عائشة، - رضى الله عنها - قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا نعس الرجل وهو في الصلاة فلينصرف لعله يدعو على نفسه وهو لا يدري ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Aishah said:                      \"The Messenger of Allah (ﷺ) said: 'If a man feels drowsy when he is praying, let him stop, lest he supplicate against himself without realizing.'\"",
      "chain": [
        "30537",
        "20258",
        "11015",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1253",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا بشر بن هلال، قال حدثنا عبد الوارث، عن هشام الدستوائي، عن يحيى بن أبي كثير، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا نودي للصلاة أدبر الشيطان له ضراط فإذا قضي التثويب أقبل حتى يخطر بين المرء وقلبه حتى لا يدري كم صلى فإذا رأى أحدكم ذلك فليسجد سجدتين ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah (ﷺ) said: 'When the call to prayer is given, the Shaitan runs away breaking wind loudly. When the Tathwb (Iqamah) is completed, he comes back and whispers to a man in his hear, until he does not know how many (rak'ahs) he has prayed. If any one of you notices that, let him prostrate twice.'\"",
      "chain": [
        "30537",
        "20258",
        "20295",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "2106",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا بشر بن هلال، قال حدثنا عبد الوارث، عن أيوب، عن أبي قلابة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أتاكم رمضان شهر مبارك فرض الله عز وجل عليكم صيامه تفتح فيه أبواب السماء وتغلق فيه أبواب الجحيم وتغل فيه مردة الشياطين لله فيه ليلة خير من ألف شهر من حرم خيرها فقد حرم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah said: 'There has come to you Ramadan, a blessed month, which Allah, the Mighty and Sublime, has enjoined you to fast. In it the gates of heavens are opened and the gates of Hell are closed, and every devil is chained up. In it Allah has a night which is better than a thousand months; whoever is deprived of its goodness is indeed deprived.\"'",
      "chain": [
        "30537",
        "20258",
        "11015",
        "11047",
        "13"
      ]
    },
    {
      "hadith_no": "2955",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا بشر بن هلال، قال أنبأنا عبد الوارث، عن خالد، عن عكرمة، عن عبد الله بن عباس، أن رسول الله صلى الله عليه وسلم كان يطوف بالبيت على راحلته فإذا انتهى إلى الركن أشار إليه ‏.‏",
      "text_en": " It was narrated from Abdullah bin Abbas that:                     the Messenger of Allah used to circumambulate the House on his mount, and when he reached the Corner be pointed to it.\" (Sahih) Chpater 161. They Saying Of Allah, The Mighty And Sublimse: \"Take Your Adornment To Every Masjid\"",
      "chain": [
        "30537",
        "20258",
        "11282",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "4114",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا بشر بن هلال الصواف، قال حدثنا عبد الوارث، قال حدثنا أيوب، عن غيلان بن جرير، عن زياد بن رباح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من خرج من الطاعة وفارق الجماعة فمات مات ميتة جاهلية ومن خرج على أمتي يضرب برها وفاجرها لا يتحاشى من مؤمنها ولا يفي لذي عهدها فليس مني ومن قاتل تحت راية عمية يدعو إلى عصبية أو يغضب لعصبية فقتل فقتلة جاهلية ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah [SAW] said: 'Whoever parts from obedience, and splits away from the Jama'ah and dies, then he has died a death of Jahiliyyah. Whoever rebels against my Ummah, killing good and evil people alike, and does not try to avoid killing the believers, and does not pay attention to those who are under a covenant, then he is not of me. Whoever fights for a cause that is not clear, advocating tribalism, getting angry for the sake of tribalism, and he is killed, then he has died a death of Jahiliyyah.'\"",
      "chain": [
        "30537",
        "20258",
        "11015",
        "11300",
        "13"
      ]
    },
    {
      "hadith_no": "234",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا بشر بن هلال الصواف، حدثنا داود بن الزبرقان، عن بكر بن خنيس، عن عبد الرحمن بن زياد، عن عبد الله بن يزيد، عن عبد الله بن عمرو، قال خرج رسول الله  صلى الله عليه وسلم  ذات يوم من بعض حجره فدخل المسجد فإذا هو بحلقتين إحداهما يقرءون القرآن ويدعون الله والأخرى يتعلمون ويعلمون فقال النبي  صلى الله عليه وسلم  ‏\"‏ كل على خير هؤلاء يقرءون القرآن ويدعون الله فإن شاء أعطاهم وإن شاء منعهم وهؤلاء يتعلمون ويعلمون وإنما بعثت معلما ‏\"‏ ‏.‏ فجلس معهم ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin 'Amr said:                     \"The Messenger of Allah came out of one of his apartments one day and entered the mosque, where he saw two circles, one reciting Qur'an and supplicating to Allah, and the other learning and teaching. The Prophet said: 'Both of them are good. These people are reciting the Qur'an and supplicating to Allah, and if He wills He will give them, and if He wills He will withhold from them. And these people are learning and teaching. Verily I have been sent as a teacher.' Then he sat down with them.\"",
      "chain": [
        "30537",
        "24124",
        "25031",
        "28326",
        "1945",
        "29"
      ]
    },
    {
      "hadith_no": "311",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا بشر بن هلال الصواف، حدثنا جعفر بن سليمان، عن أبي عمران الجوني، عن أنس بن مالك، قال وقت لنا في قص الشارب وحلق العانة ونتف الإبط وتقليم الأظفار أن لا نترك أكثر من أربعين ليلة ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                     \"We were given a time limit with regard to trimming the mustache, shaving the pubic hairs, plucking the armpit hairs and clipping the nails. We were not to leave that for more than forty days.\"",
      "chain": [
        "30537",
        "20532",
        "11296",
        "19"
      ]
    },
    {
      "hadith_no": "599",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن بشار، وبشر بن هلال الصواف، قالا حدثنا عبد الوهاب بن عبد المجيد، قال حدثنا المهاجر أبو مخلد، عن عبد الرحمن بن أبي بكرة، عن أبيه، عن النبي  صلى الله عليه وسلم  أنه رخص للمسافر إذا توضأ ولبس خفيه ثم أحدث وضوءا أن يمسح ثلاثة أيام ولياليهن وللمقيم يوما وليلة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdur-Rahman bin Abu Bakrah, from his father, that:                     The Prophet granted a concession to travelers: \"If a traveler performed ablution and put on leather socks, then he performed a fresh ablution, he could wipe over the leather socks for three days and nights; the resident could do so for one day and one night.\"",
      "chain": [
        "30160",
        "30537",
        "20259",
        "11294",
        "3229"
      ]
    },
    {
      "hadith_no": "878",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا بشر بن هلال الصواف، حدثنا يزيد بن زريع، حدثنا هشام الدستوائي، عن يحيى بن أبي كثير، عن عبد الله بن أبي قتادة، عن أبيه، قال كان رسول الله  صلى الله عليه وسلم  يقرأ بنا في الركعتين الأوليين من صلاة الظهر ويسمعنا الآية أحيانا ‏.‏",
      "text_en": " It wasnarrated from ‘Abdullah bin Abu Qatadah that his father said:                     “TheMessenger of Allah (ﷺ) used to recite when leading us in thefirsttwo Rak’ah of the Zuhr prayer, and sometimes he would recitesuchthat we could hear the Verse.”",
      "chain": [
        "30537",
        "20304",
        "20295",
        "11449",
        "11804",
        "391"
      ]
    },
    {
      "hadith_no": "984",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا بشر بن هلال الصواف، حدثنا يزيد بن زريع، عن حسين المعلم، عن عمرو بن شعيب، عن أبيه، عن جده، قال رأيت النبي  صلى الله عليه وسلم  ينفتل عن يمينه وعن يساره في الصلاة ‏.‏",
      "text_en": " It wasnarrated from ‘Amr bin Shu’aib, from his father, that hisgrandfather said:                      “I saw the Prophet (ﷺ) departing to his rightandto his left when he finished the prayer.”",
      "chain": [
        "30537",
        "20304",
        "11278",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "1032",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا بشر بن هلال الصواف، حدثنا يزيد بن زريع، عن خالد الحذاء، عن أبي قلابة، عن مالك بن الحويرث، قال أتيت النبي  صلى الله عليه وسلم  أنا وصاحب لي فلما أردنا الانصراف قال لنا ‏\"‏ إذا حضرت الصلاة فأذنا وأقيما وليؤمكما أكبركما ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Malik bin Huwairith said:                      “I came to the Prophet(ﷺ) with a friend of mine, and when we wanted to leave, he said tous: ‘When the time for prayer comes, say the Adhan and Iqamah, thenlet the older of you lead the prayer.’”",
      "chain": [
        "30537",
        "20304",
        "11282",
        "11047",
        "5265"
      ]
    },
    {
      "hadith_no": "1091",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا بشر بن هلال الصواف، حدثنا يزيد بن زريع، عن حسين المعلم، عن عمرو بن شعيب، عن أبيه، عن جده، قال رأيت رسول الله  صلى الله عليه وسلم  يصلي حافيا ومنتعلا ‏.‏",
      "text_en": " It wasnarrated from ‘Amr bin Shu’aib, from his father, that hisgrandfather said:                      “I saw the Messenger of Allah (ﷺ) performingprayer both barefoot, and while wearing sandals.”",
      "chain": [
        "30537",
        "20304",
        "11278",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "1289",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا بشر بن هلال الصواف، حدثنا يزيد بن زريع، عن حسين المعلم، عن عبد الله بن بريدة، عن عمران بن حصين، أنه سأل رسول الله  صلى الله عليه وسلم  عن الرجل يصلي قاعدا قال ‏\"‏ من صلى قائما فهو أفضل ومن صلى قاعدا فله نصف أجر القائم ومن صلى نائما فله نصف أجر القاعد ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Imran bin Husain that he asked the Messenger ofAllah (ﷺ) about a man who prays sitting down. He said, “Whoeverperforms prayer standing up, that is better. Whoever performs prayersitting down will have half the reward of one who prays standing. Andwhoever performs prayer lying down will have half the reward of onewho prays sitting.”",
      "chain": [
        "30537",
        "20304",
        "11278",
        "11432",
        "123"
      ]
    },
    {
      "hadith_no": "1700",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا بشر بن هلال الصواف، حدثنا جعفر بن سليمان الضبعي، حدثنا ثابت، عن أنس، قال لما كان اليوم الذي دخل فيه رسول الله  صلى الله عليه وسلم  المدينة أضاء منها كل شىء فلما كان اليوم الذي مات فيه أظلم منها كل شىء ‏.‏ وما نفضنا عن النبي  صلى الله عليه وسلم  الأيدي حتى أنكرنا قلوبنا ‏.‏",
      "text_en": " It wasnarrated that Anas said:                      “On the day when the Messenger ofAllah(ﷺ) entered Al-Madinah, everything was lit up, and on the daywhenhe died, everything went dark, and no sooner had we dusted offourhands (after burying him) but we felt that our hearts hadchanged.”*",
      "chain": [
        "30537",
        "20532",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "2103",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Divorce - كتاب الطلاق",
      "chapter_no": "10",
      "text_ar": "حدثنا بشر بن هلال الصواف، حدثنا جعفر بن سليمان الضبعي، عن يزيد الرشك، عن مطرف بن عبد الله بن الشخير، أن عمران بن الحصين، سئل عن رجل، يطلق امرأته ثم يقع بها ولم يشهد على طلاقها ولا على رجعتها ‏.‏ فقال عمران طلقت بغير سنة وراجعت بغير سنة أشهد على طلاقها وعلى رجعتها ‏.‏",
      "text_en": " 'Imran bin Husain:                     was asked about a man who divorced his wife then had intercourse with her, and there were no witnesses to his divorcing her or his taking her back. 'Imran said: \"You have divorced (her) in a manner that is not according to the Sunnah, and you have taken her back in a manner that is not according to the Sunnah. Bring people to witness your divorcing her and taking her back.\"",
      "chain": [
        "30537",
        "20532",
        "11319",
        "11305"
      ]
    },
    {
      "hadith_no": "3546",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Drinks - كتاب الأشربة",
      "chapter_no": "30",
      "text_ar": "حدثنا بشر بن هلال الصواف، حدثنا عبد الوارث بن سعيد، عن أيوب، عن عكرمة، عن أبي هريرة، قال نهى رسول الله  صلى الله عليه وسلم  عن الشرب من في السقاء ‏.‏",
      "text_en": " It wasnarrated that Abu Hurairah said:                      “The Messenger of Allah (ﷺ)forbade drinking (directly) from the mouth of a water skin.”",
      "chain": [
        "30537",
        "20258",
        "11015",
        "11023",
        "13"
      ]
    },
    {
      "hadith_no": "3652",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا بشر بن هلال الصواف، حدثنا عبد الوارث، عن عبد العزيز بن صهيب، عن أبي نضرة، عن أبي سعيد، أن جبرائيل، أتى النبي  صلى الله عليه وسلم  فقال يا محمد اشتكيت قال ‏\"‏ نعم ‏\"‏ ‏.‏ قال بسم الله أرقيك من كل شىء يؤذيك من شر كل نفس أو عين أو حاسد الله يشفيك بسم الله أرقيك ‏.‏",
      "text_en": " It wasnarrated from Abu Sa’eed that Jibra’il came to the Prophet(ﷺ)and said:                      “O Muhammad, you are ill. He said: ‘Yes.’ He said:Bismillahi arqika, min kulli shay’in yu’dika, min sharri kullinafsinaw ‘aynin aw hasidin. Allahu yashfika, bismillahi arqika (Inthe Nameof Allah I perform Ruqyah for you, from everything that isharmingyou, from the evil of every soul or envious eye, may Allahheal you.In the Name of Allah I perform Ruqyah for you).",
      "chain": [
        "30537",
        "20258",
        "11295",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "3916",
      "source": " Sunan Ibn Majah ",
      "chapter": "Interpretation of Dreams - كتاب تعبير الرؤيا",
      "chapter_no": "35",
      "text_ar": "حدثنا بشر بن هلال الصواف، حدثنا عبد الوارث بن سعيد، عن أيوب، عن عكرمة، عن ابن عباس، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من تحلم حلما كاذبا كلف أن يعقد بين شعيرتين ويعذب على ذلك ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Abbas that the Messenger of Allah (ﷺ)said:                     “Whoever tells of a false dream, will be ordered (on the Day ofResurrection) to tie two grains of barley together, and he will bepunished for that.”",
      "chain": [
        "30537",
        "20258",
        "11015",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "4083",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا بشر بن هلال الصواف، حدثنا عبد الوارث بن سعيد، حدثنا أيوب، عن غيلان بن جرير، عن زياد بن رياح، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من قاتل تحت راية عمية يدعو إلى عصبية أو يغضب لعصبية فقتلته جاهلية ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                      “Whoever fights under a banner of folly, supportingtribalism,or getting angry for the sake of tribalism, he dies in astate ofignorance.”",
      "chain": [
        "30537",
        "20258",
        "11015",
        "11300",
        "13"
      ]
    },
    {
      "hadith_no": "4133",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا بشر بن هلال الصواف، حدثنا عبد الوارث بن سعيد، عن سليمان التيمي، ح وحدثنا عمرو بن رافع، حدثنا عبد الله بن المبارك، عن سليمان التيمي، عن أبي عثمان النهدي، عن أسامة بن زيد، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ ما أدع بعدي فتنة أضر على الرجال من النساء ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Usamah bin Zaid that the Messenger of Allah(ﷺ) said:                      “I am not leaving behind me any tribulation that ismoreharmful to men than women.”",
      "chain": [
        "30537",
        "20258",
        "11289",
        "18792",
        "20025",
        "11289",
        "11113",
        "50"
      ]
    }
  ],
  "total_hadiths": 34
}