{
  "id": "30547",
  "name": "Swyd bin Sa'id سويد بن سعيد",
  "full_name": "Swyd bin Sa'id سويد بن سعيد",
  "grade": "3rd Century AH [10th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Maqbool] [ م  ق  -  صدوق ]"
    ],
    "tags": []
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "20421",
      "name": "Hafs bin Mysrh al-Qyly حفص بن ميسرة العقيلي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "23063",
      "name": "Muslim bin Khalid al-Zanji مسلم بن خالد الزنجي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20022",
      "name": "Hammad bin Zayd حماد بن زيد بن درهم الأزدي الأزرق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20509",
      "name": "'Abdur Rahman bin Abi al-Zanad عبد الرحمن بن أبي الزناد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "28327",
      "name": "'Abdur Rahman bin Zayd bin Aslam عبد الرحمن بن زيد بن أسلم العدوي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20304",
      "name": "Yazid bin Zari' يزيد بن زريع",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "27031",
      "name": "Frj bin Fdalh bin al-N'man فرج بن فضالة بن النعمان",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20165",
      "name": "'Abdul 'Aziz bin Abi Hazim عبد العزيز بن أبي حازم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20167",
      "name": "'Abdul 'Aziz bin Muhammad al-Daruradi عبد العزيز بن محمد الدراوردي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20288",
      "name": "Ma'tmar bin Sulaiman-al-Taufayl معتمر بن سليمان - الطفيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20259",
      "name": "'Abdul Wahab bin 'Abdul Majeed al-Thaqaf عبد الوهاب بن عبد المجيد الثقفي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20345",
      "name": "'Ali bin Ms'hr علي بن مسهر",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20201",
      "name": "Marwan bin Mua'wiya al-Fazari مروان بن معاوية الفزاري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20366",
      "name": "Yahya bin Zakaria bin Abi Zaida يحيى بن زكريا بن أبي زائدة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20733",
      "name": "al-Walid bin Muslim al-Quraishi الوليد بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "students": [
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]"
    },
    {
      "id": "30004",
      "name": "Ibn Maja ابن ماجة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30554",
      "name": "Abu Zara' al-Razi أبو زرعة الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30467",
      "name": "'Abdullah bin 'Amir عبد الله بن عامر بن زرارة الحضرمي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38001",
      "name": "Ahmed bin al-Azhar bin Mny' أحمد بن الأزهر بن منيع",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "36010",
      "name": "Ishaq bin Ibrahim bin Yonus إسحاق بن إبراهيم بن يونس",
      "grade": "3rd Century AH [12th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "88",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "وحدثنا سويد بن سعيد، حدثنا علي بن مسهر، قال سمعت أنا وحمزة الزيات، من أبان بن أبي عياش نحوا من ألف حديث ‏.‏ قال علي فلقيت حمزة فأخبرني أنه رأى النبي صلى الله عليه وسلم في المنام فعرض عليه ما سمع من أبان فما عرف منها إلا شيئا يسيرا خمسة أو ستة ‏.‏",
      "text_en": "",
      "chain": [
        "30547",
        "20345"
      ]
    },
    {
      "hadith_no": "139",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا سويد بن سعيد، وابن أبي عمر، قالا حدثنا مروان، - يعنيان الفزاري - عن أبي مالك، عن أبيه، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من قال لا إله إلا الله وكفر بما يعبد من دون الله حرم ماله ودمه وحسابه على الله ‏\"‏ ‏.‏",
      "text_en": " It Is narrated on the authority of Abu Malik:                      I heard the Messenger of Allah (may peace be upon him) say: He who professed that there is no god but Allah and made a denial of everything which the people worship beside Allah, his property and blood became inviolable, an their affairs rest with Allah.",
      "chain": [
        "30547",
        "30421",
        "20201",
        "10766",
        "5098"
      ]
    },
    {
      "hadith_no": "276",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا منجاب بن الحارث التميمي، وسويد بن سعيد، كلاهما عن علي بن مسهر، - قال منجاب أخبرنا ابن مسهر، - عن الأعمش، عن إبراهيم، عن علقمة، عن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يدخل النار أحد في قلبه مثقال حبة خردل من إيمان ولا يدخل الجنة أحد في قلبه مثقال حبة خردل من كبرياء ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of 'Abdullah b. Mas'ud that the Messenger of Allah (may peace be upon him) observed:                      None shall enter the Fire (of Hell) who has in his heart the weight of a mustard seed of Iman and none shall enter Paradise who has in his heart the weight of a mustard seed of pride.",
      "chain": [
        "30479",
        "30547",
        "20345",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "472",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني سويد بن سعيد، قال حدثني حفص بن ميسرة، عن زيد بن أسلم، عن عطاء بن يسار، عن أبي سعيد الخدري، أن ناسا، في زمن رسول الله صلى الله عليه وسلم قالوا يا رسول الله هل نرى ربنا يوم القيامة قال رسول الله صلى الله عليه وسلم ‏\"‏ نعم ‏\"‏ ‏.‏ قال ‏\"‏ هل تضارون في رؤية الشمس بالظهيرة صحوا ليس معها سحاب وهل تضارون في رؤية القمر ليلة البدر صحوا ليس فيها سحاب ‏\"‏ ‏.‏ قالوا لا يا رسول الله ‏.‏ قال ‏\"‏ ما تضارون في رؤية الله تبارك وتعالى يوم القيامة إلا كما تضارون في رؤية أحدهما إذا كان يوم القيامة أذن مؤذن ليتبع كل أمة ما كانت تعبد ‏.‏ فلا يبقى أحد كان يعبد غير الله سبحانه من الأصنام والأنصاب إلا يتساقطون في النار حتى إذا لم يبق إلا من كان يعبد الله من بر وفاجر وغبر أهل الكتاب فيدعى اليهود فيقال لهم ما كنتم تعبدون قالوا كنا نعبد عزير ابن الله ‏.‏ فيقال كذبتم ما اتخذ الله من صاحبة ولا ولد فماذا تبغون قالوا عطشنا يا ربنا فاسقنا ‏.‏ فيشار إليهم ألا تردون فيحشرون إلى النار كأنها سراب يحطم بعضها بعضا فيتساقطون في النار ‏.‏ ثم يدعى النصارى فيقال لهم ما كنتم تعبدون قالوا كنا نعبد المسيح ابن الله ‏.‏ فيقال لهم كذبتم ‏.‏ ما اتخذ الله من صاحبة ولا ولد ‏.‏ فيقال لهم ماذا تبغون فيقولون عطشنا يا ربنا فاسقنا ‏.‏ - قال - فيشار إليهم ألا تردون فيحشرون إلى جهنم كأنها سراب يحطم بعضها بعضا فيتساقطون في النار حتى إذا لم يبق إلا من كان يعبد الله تعالى من بر وفاجر أتاهم رب العالمين سبحانه وتعالى في أدنى صورة من التي رأوه فيها ‏.‏ قال فما تنتظرون تتبع كل أمة ما كانت تعبد ‏.‏ قالوا يا ربنا فارقنا الناس في الدنيا أفقر ما كنا إليهم ولم نصاحبهم ‏.‏ فيقول أنا ربكم ‏.‏ فيقولون نعوذ بالله منك لا نشرك بالله شيئا - مرتين أو ثلاثا - حتى إن بعضهم ليكاد أن ينقلب ‏.‏ فيقول هل بينكم وبينه آية فتعرفونه بها فيقولون نعم ‏.‏ فيكشف عن ساق فلا يبقى من كان يسجد لله من تلقاء نفسه إلا أذن الله له بالسجود ولا يبقى من كان يسجد اتقاء ورياء إلا جعل الله ظهره طبقة واحدة كلما أراد أن يسجد خر على قفاه ‏.‏ ثم يرفعون رءوسهم وقد تحول في صورته التي رأوه فيها أول مرة فقال أنا ربكم ‏.‏ فيقولون أنت ربنا ‏.‏ ثم يضرب الجسر على جهنم وتحل الشفاعة ويقولون اللهم سلم سلم ‏\"‏ ‏.‏ قيل يا رسول الله وما الجسر قال ‏\"‏ دحض مزلة ‏.‏ فيه خطاطيف وكلاليب وحسك تكون بنجد فيها شويكة يقال لها السعدان فيمر المؤمنون كطرف العين وكالبرق وكالريح وكالطير وكأجاويد الخيل والركاب فناج مسلم ومخدوش مرسل ومكدوس في نار جهنم ‏.‏ حتى إذا خلص المؤمنون من النار فوالذي نفسي بيده ما منكم من أحد بأشد مناشدة لله في استقصاء الحق من المؤمنين لله يوم القيامة لإخوانهم الذين في النار يقولون ربنا كانوا يصومون معنا ويصلون ويحجون ‏.‏ فيقال لهم أخرجوا من عرفتم ‏.‏ فتحرم صورهم على النار فيخرجون خلقا كثيرا قد أخذت النار إلى نصف ساقيه وإلى ركبتيه ثم يقولون ربنا ما بقي فيها أحد ممن أمرتنا به ‏.‏ فيقول ارجعوا فمن وجدتم في قلبه مثقال دينار من خير فأخرجوه ‏.‏ فيخرجون خلقا كثيرا ثم يقولون ربنا لم نذر فيها أحدا ممن أمرتنا ‏.‏ ثم يقول ارجعوا فمن وجدتم في قلبه مثقال نصف دينار من خير فأخرجوه ‏.‏ فيخرجون خلقا كثيرا ثم يقولون ربنا لم نذر فيها ممن أمرتنا أحدا ‏.‏ ثم يقول ارجعوا فمن وجدتم في قلبه مثقال ذرة من خير فأخرجوه ‏.‏ فيخرجون خلقا كثيرا ثم يقولون ربنا لم نذر فيها خيرا ‏\"‏ ‏.‏ وكان أبو سعيد الخدري يقول إن لم تصدقوني بهذا الحديث فاقرءوا إن شئتم ‏{‏ إن الله لا يظلم مثقال ذرة وإن تك حسنة يضاعفها ويؤت من لدنه أجرا عظيما‏}‏ ‏\"‏ فيقول الله عز وجل شفعت الملائكة وشفع النبيون وشفع المؤمنون ولم يبق إلا أرحم الراحمين فيقبض قبضة من النار فيخرج منها قوما لم يعملوا خيرا قط قد عادوا حمما فيلقيهم في نهر في أفواه الجنة يقال له نهر الحياة فيخرجون كما تخرج الحبة في حميل السيل ألا ترونها تكون إلى الحجر أو إلى الشجر ما يكون إلى الشمس أصيفر وأخيضر وما يكون منها إلى الظل يكون أبيض ‏\"‏ ‏.‏ فقالوا يا رسول الله كأنك كنت ترعى بالبادية قال ‏\"‏ فيخرجون كاللؤلؤ في رقابهم الخواتم يعرفهم أهل الجنة هؤلاء عتقاء الله الذين أدخلهم الله الجنة بغير عمل عملوه ولا خير قدموه ثم يقول ادخلوا الجنة فما رأيتموه فهو لكم ‏.‏ فيقولون ربنا أعطيتنا ما لم تعط أحدا من العالمين ‏.‏ فيقول لكم عندي أفضل من هذا فيقولون يا ربنا أى شىء أفضل من هذا ‏.‏ فيقول رضاى فلا أسخط عليكم بعده أبدا ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id al-Khudri reported:                      Some people during the lifetime of the Messenger of Allah (may peace be upon him) said: Messenger of Allah! shall we see our Lord on the Day of Resurrection? The Messenger of Allah (may peace be upon him) said: Yes, and added: Do you feel any trouble in seeing the sun at noon with no cloud over it, and do you feel trouble in seeing the moon (open) in the full moonlit night with no cloud over it? They said: No, Messenger of Allah! He (the Holy Prophet) said: You will not feel any trouble in seeing Allah on the Day of Resurrection any more than you do in seeing any one of them. When the Day of Resurrection comes a Mu'adhdhin (a proclaimer) would proclaim: Let every people follow what they used to worship. Then all who worshipped idols and stones besides Allah would fall into the Fire, till only the righteous and the vicious and some of the people of the Book who worshipped Allah are left. Then the Jews would be summoned, and it would be said to them: What did you worship? They will say: We worshipped 'Uzair, son of Allah. It would be said to them: You tell a lie; Allah had never had a spouse or a son. What do you want now? They would say: We feel thirsty, O our Lord! Quench our thirst. They would be directed (to a certain direction) and asked: Why don't you go there to drink water? Then they would be pushed towards the Fire (and they would find to their great dismay that) it was but a mirage (and the raging flames of fire) would be consuming one another, and they would fall into the Fire. Then the Christians would be summoned and it would be said to them: What did you worship? They would say: We worshipped Jesus, son of Allah. It would be said to them: You tell a lie; Allah did not take for Himself either a spouse or a son. Then it would be said to them: What do you want? They would say: Thirsty we are, O our Lord! Quench our thirst. They would be directed (to a certain direction) and asked: Why don't you go there to get water? But they would be pushed and gathered together towards the Hell, which was like a mirage to them, and the flames would consume one another. They would fall Into the Fire, till no one is left except he who worshipped Allah, be he pious or sinful. The Lord of the Universe, Glorified and Exalted, would come to them in a form recognisable to them and say; What are you looking for? Every people follow that which they worshipped. They would say: Our Lord, we kept ourselves separate from the people in the world, though we felt great need of them; we, however, did not associate ourselves with them. He would say: I am your Lord. They would say: We take refuge with Allah from thee and do not associate anything with Allah. They would repeat it twice or thrice, till some of them would be about to return. It would be said: Is there any sign between you and Him by which you will recognise Him? They would say: Yes. and the things would be laid bare. Those who used to prostrate themselves before God of their own accord would be permitted by God to prostrate themselves. But there would remain none who used to prostrate out of fear (of people) and ostentation but Allah would make his back as one piece, and whenever he would attempt to prostrate he would fall on his back. Then they would raise their heads and He would assume the Form in which they had seen Him the first time and would say: I am your Lord. They would say: Thou art our Lord. Then the bridge would be set up over the Hell and intercession would be allowed and they will say: O God, keep safe, keep safe. It was asked: Messenger of Allah, what is this bridge? He said: The void in which one Is likely to slip. There would be hooks, tongs, spits like the thorn that is found in Najd and is known as Sa'dan. The believers would then pass over within the twinkling of an eye, like lightning, like wind, like a bird, like the finest horses and camels. Some will escape and be safe, some will be lacerated and let go, and some will be pushed into the fire of Hell till the believers will find rescue from the Fire. By One in Whose hand is my life, there will be none among you more eager to claim a right than the believers on the Day of Resurrection for (saying their) brethren in the Fire who would say: O our Lord, they were fasting along with us, and praying and performing pilgrimage. It will be said to them: Take out those whom you recognise. Then their persons would be forbidden to the Fire; and they would take out a large number of people who had been overtaken by Fire up to the middle of the shank or up to the knees. They would then say: O our Lord I not one of those about whom Thou didst give us command remains in it. He will then say: Go back and bring out those in whose hearts you find good of the weight of a dinar Then they will take out a large number of people. Then they would say: O our Lord! we have not left anyone about whom You commanded us. He will then say: Go back and bring out those in whose hearts you find as much as half a dinar of good. Then they will take out a large number of people, and would say: O our Lord! not one of those about whom Thou commanded us we have left in it. Then He would say: Go back and in whose heart you find good to the weight of a particle bring him out. They would bring out a large number of people, and would then say: O our Lord, now we have not left anyone in it (Hell) having any good in him. Abu Sa'id Khudri said: If you don't testify me in this hadith, then recite if you like:\" Surely Allah wrongs not the weight of an atom; and if it is a good deed. He multiplies it and gives from Himself a great reward\" (al-Qur'an, iv. 40). Then Allah, Exalted and Great, would say: The angels have interceded, the apostles have interceded and the believers have interceded, and no one remains (to grant pardon) but the Most Merciful of the mercifuls. He will then take a handful from Fire and bring out from it people who never did any good and who had been turned into charcoal, and will cast them into a river called the river of life, on the outskirts of Paradise. They will come out as a seed comes cut from the silt carried by flood. You see it near the stone or near the tree. That which is exposed to the sun is yellowish or greenish and which is under the shade is white. They said: Messenger of Allah! it seems as if you had been tending a flock in the jungle. He (the Holy Prophet) said: They will come forth like pearls with seals on their necks. The inhabitants of Paradise would recognise them (and say): Those are who have been set free by the Compassionate One. Who has admitted them into Paradise without any (good) deed that they did or any good that they sent in advance Then He would say: Enter the Paradise; whatever you see in it is yours. They would say: O Lord, Thou hast bestowed upon us (favours) which Thou didst not bestow upon anyone else in the world. He would say: There is with Me (a favour) for you better than this. They would say: O our Lord! which thing is better than this? He would say: It is My pleasure. I will never be angry with you after this",
      "chain": [
        "30547",
        "20421",
        "11163",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "244",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا سويد بن سعيد، عن مالك بن أنس، ح وحدثنا أبو الطاهر، - واللفظ له - أخبرنا عبد الله بن وهب، عن مالك بن أنس، عن سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا توضأ العبد المسلم - أو المؤمن - فغسل وجهه خرج من وجهه كل خطيئة نظر إليها بعينيه مع الماء - أو مع آخر قطر الماء - فإذا غسل يديه خرج من يديه كل خطيئة كان بطشتها يداه مع الماء - أو مع آخر قطر الماء - فإذا غسل رجليه خرجت كل خطيئة مشتها رجلاه مع الماء - أو مع آخر قطر الماء - حتى يخرج نقيا من الذنوب ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      Allah's Messenger (may peace be upon him) said: When a bondsman-a Muslim or a believer-washes his face (in course of ablution), every sin he contemplated with his eyes, will be washed away from his face along with water, or with the last drop of water; when he washes his hands, every sin they wrought will be effaced from his hands with the water, or with the last drop of water; and when he washes his feet, every sin towards which his feet have walked will be washed away with the water or with the last drop of water with the result that he comes out pure from all sins.",
      "chain": [
        "30547",
        "20001",
        "20029",
        "20001",
        "11173",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "247",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا سويد بن سعيد، وابن أبي عمر، جميعا عن مروان الفزاري، - قال ابن أبي عمر حدثنا مروان، - عن أبي مالك الأشجعي، سعد بن طارق عن أبي حازم، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن حوضي أبعد من أيلة من عدن لهو أشد بياضا من الثلج وأحلى من العسل باللبن ولآنيته أكثر من عدد النجوم وإني لأصد الناس عنه كما يصد الرجل إبل الناس عن حوضه ‏\"‏ ‏.‏ قالوا يا رسول الله أتعرفنا يومئذ قال ‏\"‏ نعم لكم سيما ليست لأحد من الأمم تردون على غرا محجلين من أثر الوضوء ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      Verily Allah's Messenger (may peace be upon him) said: My Cistern has its dimensions wider than the distance between Aila and Aden, and its water is whiter than ice and sweeter than the honey diluted with milk, and its cups are more numerous than the numbers of the stars. Verily I shall prevent the (faithless) people therefrom just as a man prevents the camels of the people from his fountain. They said: Messenger of Allah, will you recognise us on that day? He said: Yes, you will have distinctive marks which nobody among the peoples (except you) will have; you would come to me with blazing forehead and bright hands and feet on account of the traces of ablution.",
      "chain": [
        "30547",
        "30421",
        "30421",
        "20201",
        "10766",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "1207",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثني سويد بن سعيد، حدثني حفص بن ميسرة، عن موسى بن عقبة، عن نافع، عن ابن عمر، وعن عبد الله بن دينار، عن ابن عمر، قال بينما الناس في صلاة الغداة إذ جاءهم رجل ‏.‏ بمثل حديث مالك ‏.‏",
      "text_en": " Ibn 'Umar reported:                      As the people were engaged in the morning prayer a man came to them. The rest of the hadith is the same.",
      "chain": [
        "30547",
        "20421",
        "11106",
        "11014",
        "18",
        "11183",
        "18"
      ]
    },
    {
      "hadith_no": "1518",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا قتيبة بن سعيد، وإسحاق بن إبراهيم، وسويد بن سعيد، ويعقوب الدورقي، كلهم عن مروان الفزاري، - قال قتيبة حدثنا الفزاري، - عن عبيد الله بن الأصم، قال حدثنا يزيد بن الأصم، عن أبي هريرة، قال أتى النبي صلى الله عليه وسلم رجل أعمى فقال يا رسول الله إنه ليس لي قائد يقودني إلى المسجد ‏.‏ فسأل رسول الله صلى الله عليه وسلم أن يرخص له فيصلي في بيته فرخص له فلما ولى دعاه فقال ‏\"‏ هل تسمع النداء بالصلاة ‏\"‏ ‏.‏ فقال نعم ‏.‏ قال ‏\"‏ فأجب ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      There came to the Apostle of Allah (may peace be upon him) a blind man and said: Messenger of Allah, I have no one to guide me to the mosque. He, therefore, asked. Allah's Messenger (may peace be upon him) permission to say prayer in his house. He (tee Holy Prophet) granted him permission. Then when the man turned away he called him and said: Do you hear the call to prayer? He said: Yes. He (the Holy Prophet then) said: Respond to it.",
      "chain": [
        "30367",
        "30123",
        "30547",
        "30367",
        "20405",
        "10842",
        "13"
      ]
    },
    {
      "hadith_no": "1537",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا أبو معاوية، ح وحدثني سويد بن سعيد، قال حدثنا علي بن مسهر، جميعا عن الأعمش، ح وحدثنا إسحاق بن إبراهيم، - واللفظ له - أخبرنا عيسى بن يونس، حدثنا الأعمش، عن أبي سفيان، عن جابر، قال حدثنا أبو سعيد الخدري، أنه دخل على رسول الله صلى الله عليه وسلم فوجده يصلي على حصير يسجد عليه ‏.‏",
      "text_en": " Abu Sa'id al-Khudri reported that he went to the Messenger of Allah (may peace be upon him) and found him observing prayer on a mat and prostrating on that.",
      "chain": [
        "30201",
        "30216",
        "20354",
        "30547",
        "20345",
        "11060",
        "30123",
        "20347",
        "11060",
        "116",
        "34",
        "38"
      ]
    },
    {
      "hadith_no": "1852",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثناه إسماعيل بن الخليل، وسويد بن سعيد، عن علي بن مسهر، عن الأعمش، بهذا الإسناد ‏.‏ مثله ‏.‏",
      "text_en": " 'Abdullah (b. Mas'ud) reported that a mention was made of a man who slept the whole night till morning. He (the Holy Prophet) remarked:                      That is a man in whose ears (or in whose ear) the devil urinated.",
      "chain": [
        "30186",
        "30547",
        "20345"
      ]
    },
    {
      "hadith_no": "2147",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Eclipse) - كتاب الكسوف",
      "chapter_no": "11",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا حفص بن ميسرة، حدثني زيد بن أسلم، عن عطاء، بن يسار عن ابن عباس، قال انكسفت الشمس على عهد رسول الله صلى الله عليه وسلم فصلى رسول الله صلى الله عليه وسلم والناس معه فقام قياما طويلا قدر نحو سورة البقرة ثم ركع ركوعا طويلا ثم رفع فقام قياما طويلا وهو دون القيام الأول ثم ركع ركوعا طويلا وهو دون الركوع الأول ثم سجد ثم قام قياما طويلا وهو دون القيام الأول ثم ركع ركوعا طويلا وهو دون الركوع الأول ثم رفع فقام قياما طويلا وهو دون القيام الأول ثم ركع ركوعا طويلا وهو دون الركوع الأول ثم سجد ثم انصرف وقد انجلت الشمس فقال ‏\"‏ إن الشمس والقمر آيتان من آيات الله لا ينكسفان لموت أحد ولا لحياته فإذا رأيتم ذلك فاذكروا الله ‏\"‏ ‏.‏ قالوا يا رسول الله رأيناك تناولت شيئا في مقامك هذا ثم رأيناك كففت ‏.‏ فقال ‏\"‏ إني رأيت الجنة فتناولت منها عنقودا ولو أخذته لأكلتم منه ما بقيت الدنيا ورأيت النار فلم أر كاليوم منظرا قط ورأيت أكثر أهلها النساء ‏\"‏ ‏.‏ قالوا بم يا رسول الله قال ‏\"‏ بكفرهن ‏\"‏ ‏.‏ قيل أيكفرن بالله قال ‏\"‏ بكفر العشير وبكفر الإحسان لو أحسنت إلى إحداهن الدهر ثم رأت منك شيئا قالت ما رأيت منك خيرا قط ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Abbas reported:                      There was an eclipse of the sun during the lifetime of the Messenger of Allah (may peace be upon him). The Messenger of Allah, (may peace be upon him) prayed accompanied by the people. He stood for a long time, about as long as it would take to recite Surah al-Baqara; then he bowed for a long time; then he raised his head and stood for a long time, but it was less than the first qiyam. He then bowed for a long time but for a shorter while than the first. He then prostrated and then stood for a long time, but it was less than the first qiyam. He then bowed for a long time, but it was less than the first bowing. He then raised (his head) and stood for a long time, but it was less than the first qiyam. He then bowed for a long time but it was less than the first bowing. He then observed prostration, and then he finished, and the sun had cleared (by that time). He (the Holy Prophet) then said: The sun and moon are two signs from the signs of Allah. These two do not eclipse on account of the death of anyone or on account of the birth of anyone. So when you see that, remember Allah. They (his Companions) said: Messenger of Allah, we saw you reach out to something, while you were standing here, then we saw you restrain yourself. He said: I saw Paradise and reached out to a bunch of its grapes; and had I taken it you would have eaten of it as long as the world endured. I saw Hell also. No such (abominable) sight have I ever seen as that which I saw today; and I observed that most of its inhabitants were women. They said: Messenger of Allah, on what account is it so? He said: For their ingratitude or disbelief (bi-kufraihinna). It was said: Do they disbelieve in Allah? He said: (Not for their disbelief in God) but for their ingratitude to their husbands and ingratitude to kindness. If you were to treat one of them kindly for ever, but if she later saw anything (displeasing) in you, she would say: I have never seen any good in you.",
      "chain": [
        "30547",
        "20421",
        "11163",
        "11020",
        "17"
      ]
    },
    {
      "hadith_no": "2337",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثني سويد بن سعيد، حدثنا حفص، - يعني ابن ميسرة الصنعاني - عن زيد بن أسلم، أن أبا صالح، ذكوان أخبره أنه، سمع أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ ما من صاحب ذهب ولا فضة لا يؤدي منها حقها إلا إذا كان يوم القيامة صفحت له صفائح من نار فأحمي عليها في نار جهنم فيكوى بها جنبه وجبينه وظهره كلما بردت أعيدت له في يوم كان مقداره خمسين ألف سنة حتى يقضى بين العباد فيرى سبيله إما إلى الجنة وإما إلى النار ‏\"‏ ‏.‏ قيل يا رسول الله فالإبل قال ‏\"‏ ولا صاحب إبل لا يؤدي منها حقها ومن حقها حلبها يوم وردها إلا إذا كان يوم القيامة بطح لها بقاع قرقر أوفر ما كانت لا يفقد منها فصيلا واحدا تطؤه بأخفافها وتعضه بأفواهها كلما مر عليه أولاها رد عليه أخراها في يوم كان مقداره خمسين ألف سنة حتى يقضى بين العباد فيرى سبيله إما إلى الجنة وإما إلى النار ‏\"‏ ‏.‏ قيل يا رسول الله فالبقر والغنم قال ‏\"‏ ولا صاحب بقر ولا غنم لا يؤدي منها حقها إلا إذا كان يوم القيامة بطح لها بقاع قرقر لا يفقد منها شيئا ليس فيها عقصاء ولا جلحاء ولا عضباء تنطحه بقرونها وتطؤه بأظلافها كلما مر عليه أولاها رد عليه أخراها في يوم كان مقداره خمسين ألف سنة حتى يقضى بين العباد فيرى سبيله إما إلى الجنة وإما إلى النار ‏\"‏ ‏.‏ قيل يا رسول الله فالخيل قال ‏\"‏ الخيل ثلاثة هي لرجل وزر وهي لرجل ستر وهي لرجل أجر فأما التي هي له وزر فرجل ربطها رياء وفخرا ونواء على أهل الإسلام فهي له وزر وأما التي هي له ستر فرجل ربطها في سبيل الله ثم لم ينس حق الله في ظهورها ولا رقابها فهي له ستر وأما التي هي له أجر فرجل ربطها في سبيل الله لأهل الإسلام في مرج وروضة فما أكلت من ذلك المرج أو الروضة من شىء إلا كتب له عدد ما أكلت حسنات وكتب له عدد أرواثها وأبوالها حسنات ولا تقطع طولها فاستنت شرفا أو شرفين إلا كتب الله له عدد آثارها وأرواثها حسنات ولا مر بها صاحبها على نهر فشربت منه ولا يريد أن يسقيها إلا كتب الله له عدد ما شربت حسنات ‏\"‏ ‏.‏ قيل يا رسول الله فالحمر قال ‏\"‏ ما أنزل على في الحمر شىء إلا هذه الآية الفاذة الجامعة ‏{‏ فمن يعمل مثقال ذرة خيرا يره * ومن يعمل مثقال ذرة شرا يره‏}‏ ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (way peace be upon him) as saying:                      If any owner of gold or silver does not pay what is due on him, when the Day of Resurrection would come, plates of fire would be beaten out for him; these would then be heated in the fire of Hell and his sides, his forehead and his back would be cauterized with them. Whenever these cool down, (the process is) repeated during a day the extent of which would be fifty thousand years, until judgment is pronounced among servants, and he sees whether his path is to take him to Paradise or to Hell. It was said: Messenger of Allah, what about the camel? He (the Holy Prophet) said: If any owner of the camel does not pay what is due on him, and of his due in that (camel) is (also) to milk it on the day when it comes down to water. When the Day of Resurrection comes a soft sandy plain would be set for him, as extensive as possible, (he will find) that not a single young one is missing, and they will trample him with their hoofs and bite him with their mouths. As often as the first of them passes him, the last of them would be made to return during a day the extent of which would be fifty thousand years, until judgment is pronounced among servants and he sees whether his path is to take him to Paradise or to Hell. It was (again) said: Messenger of Allah, what about cows (cattle) and sheep? He said: It any owner of the cattle and sheep does not pay what is due on them, when the Day of Resurrection comes a soft sandy plain would be spread for them, he will find none of them missing, with twisted horns, without horns or with a broken horn, and they will gore him with their horns and trample him with their hoofs. As often as the first of them passes him the last of them would be made to return to him during a day the extent of which would be fifty thousand years, until judgment would be pronounced among the servants. And he would be shown his path-path leading him to Paradise or to Hell. It was said: Messenger of Allah, what about the horse? Upon this he said: The horses are of three types. To one than (these are) a burden, and to another man (these are) a covering, and still to another man (these are) a source of reward. The one for whom these are a burden is the person who rears them in order to show off, for vainglory and for opposing the Muslims; so they are a burden for him. The one for whom these are a covering is the person who rears them for the sake of Allah but does not forget the right of Allah concerning their backs and their necks, and so they are a covering for him. As for those which bring reward (these refer to) the person who rears them for the sake of Allah to be used for Muslims and he puts them in meadow and field. And whatever thing do these eat from that meadow and field would be recorded on his behalf as good deeds, as would also the amount of their dung and urine. And these would not break their halter and prance a course or two without having got recorded the amount of their hoof marks and their dung as a good deed on his behalf (on behalf of their owner). And their master does not bring them past a river from which they drink, though he did not intend to quench their thirst, but Allah would record for him the amount of what they drink on his behalf as deeds. It was said: Messenger of Allah, what about the asses?, Upon this he said: Nothing has been revealed to me in regard to the asses (in particular) except this one verse of a comprehensive nature:\" He who does an atom's weight of good will see it, and he who does an atom's weight of evil will see it\" (xcix. 7)",
      "chain": [
        "30547",
        "20421",
        "11163",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "2368",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثني سويد بن سعيد، حدثنا علي بن مسهر، ح وحدثناه إسحاق بن إبراهيم، وعبد بن حميد قالا أخبرنا عبد الرزاق، أخبرنا معمر، جميعا عن هشام بن عروة، في هذا الإسناد بمثله ‏.‏",
      "text_en": " This hadith has been narrated by Ibn 'Urwa with the same chain of transmitters.",
      "chain": [
        "30547",
        "20345",
        "30123",
        "30553",
        "20121",
        "11065"
      ]
    },
    {
      "hadith_no": "2409",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثني سويد بن سعيد، حدثني حفص بن ميسرة، عن موسى بن عقبة، عن أبي، الزناد عن الأعرج، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ قال رجل لأتصدقن الليلة بصدقة فخرج بصدقته فوضعها في يد زانية فأصبحوا يتحدثون تصدق الليلة على زانية ‏.‏ قال اللهم لك الحمد على زانية لأتصدقن بصدقة ‏.‏ فخرج بصدقته فوضعها في يد غني فأصبحوا يتحدثون تصدق على غني ‏.‏ قال اللهم لك الحمد على غني لأتصدقن بصدقة ‏.‏ فخرج بصدقته فوضعها في يد سارق فأصبحوا يتحدثون تصدق على سارق ‏.‏ فقال اللهم لك الحمد على زانية وعلى غني وعلى سارق ‏.‏ فأتي فقيل له أما صدقتك فقد قبلت أما الزانية فلعلها تستعف بها عن زناها ولعل الغني يعتبر فينفق مما أعطاه الله ولعل السارق يستعف بها عن سرقته ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Apostle (may peace be upon him) as saying:                      A man expressed his intention to give charity, so he came out with charity and placed it in the hand of an adulteress. In the morning, the people were talking and saying: charity was given to an adulteress last night. He (the giver of Sadaqa) said: 0 Allah, to Thee be the praise-to an adulteress. He then again expressed his intention to give charity; so he went out with the charity and placed it in the hand of a rich person. In the morning the people were talking and saying: Charity was given to a rich person. He (the giver of charity) said: 0 Allah, to Thee be the praise-to a well-to-do person. He then expressed his intention to give charity, so he went out with charity and placed it in the hand of a thief. In the morning, the people were talking and saying: Charity was given to a thief. So (one of the persons) said: 0 Allah, to Thee be the praise (what a misfortune it is that charity has been given to) the adulteress, to a rich person. to a thief! There came (the angel to him) and he was told: Your charity has been accepted. As for the adulteress (the charity might become the means) whereby she might restrain herself from fornication. The rich man might perhaps learn a lesson and spend from what Allah has given him, and the thief might thereby refrain from committing theft.",
      "chain": [
        "30547",
        "20421",
        "11106",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "2466",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثني سويد بن سعيد، حدثنا علي بن مسهر، عن داود، عن أبي حرب بن أبي، الأسود عن أبيه، قال بعث أبو موسى الأشعري إلى قراء أهل البصرة فدخل عليه ثلاثمائة رجل قد قرءوا القرآن فقال أنتم خيار أهل البصرة وقراؤهم فاتلوه ولا يطولن عليكم الأمد فتقسو قلوبكم كما قست قلوب من كان قبلكم وإنا كنا نقرأ سورة كنا نشبهها في الطول والشدة ببراءة فأنسيتها غير أني قد حفظت منها لو كان لابن آدم واديان من مال لابتغى واديا ثالثا ولا يملأ جوف ابن آدم إلا التراب ‏.‏ وكنا نقرأ سورة كنا نشبهها بإحدى المسبحات فأنسيتها غير أني حفظت منها ‏{‏ يا أيها الذين آمنوا لم تقولون ما لا تفعلون‏}‏ فتكتب شهادة في أعناقكم فتسألون عنها يوم القيامة ‏.‏",
      "text_en": " Abu Harb b. Abu al-Aswad reported on the authority of his father that Abu Musa al-Ash'ari sent for the reciters of Basra. They came to him and they were three hundred in number. They recited the Qur'an and he said:                      You are the best among the inhabitants of Basra, for you are the reciters among them. So continue to recite it. (But bear in mind) that your reciting for a long time may not harden your hearts as were hardened the hearts of those before you. We used to recite a surah which resembled in length and severity to (Surah) Bara'at. I have, however, forgotten it with the exception of this which I remember out of it:\" If there were two valleys full of riches, for the son of Adam, he would long for a third valley, and nothing would fill the stomach of the son of Adam but dust.\" And we used so recite a slirah which resembled one of the surahs of Musabbihat, and I have forgotten it, but remember (this much) out of it:\" Oh people who believe, why do you say that which you do not practise\" (lxi 2.) and\" that is recorded in your necks as a witness (against you) and you would be asked about it on the Day of Resurrection\" (xvii. 13).",
      "chain": [
        "30547",
        "20345",
        "10729"
      ]
    },
    {
      "hadith_no": "2675",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا سعيد بن عمرو الأشعثي، وسهل بن عثمان، وسويد بن سعيد، وحسين، بن حريث كلهم عن مروان، - قال سعيد أخبرنا مروان بن معاوية، - عن عاصم، قال سمعت أبا نضرة، يحدث عن أبي سعيد الخدري، وجابر بن عبد الله، - رضى الله عنهم - قالا سافرنا مع رسول الله صلى الله عليه وسلم فيصوم الصائم ويفطر المفطر فلا يعيب بعضهم على بعض ‏.‏",
      "text_en": " Abu Nadra reported Abu Sa'id al. Khudri and Jabir b. Abdullah as saying:                      We travelled with the Messenger of Allah (may peace be upon him). The observer of the fast observed it, and the breaker of the fast broke it, but none of them found fault with each other.",
      "chain": [
        "30465",
        "30546",
        "30547",
        "30325",
        "20201",
        "11168",
        "20201",
        "11080",
        "10721",
        "38",
        "34"
      ]
    },
    {
      "hadith_no": "2989",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثناه سويد بن سعيد، عن علي بن مسهر، عن الأعمش، عن إبراهيم، عن الأسود، عن عائشة، - رضى الله عنها - قالت خرجنا مع رسول الله صلى الله عليه وسلم نلبي لا نذكر حجا ولا عمرة ‏.‏ وساق الحديث بمعنى حديث منصور ‏.‏",
      "text_en": " 'A'isha (Allah be pleased, with her) reported:                      We went out with the Mes. senger of Allah (may peace be upon him) pronouncing Talbiya having no explicit inten- tion of Pilgrimage or 'Umra. The rest of the hadith is the same.",
      "chain": [
        "30547",
        "20345",
        "11060",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "3663",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "حدثني زهير بن حرب، حدثنا إسماعيل بن إبراهيم، ح وحدثنا محمد بن عبد، الله بن نمير حدثنا إسماعيل، ح وحدثنا سويد بن سعيد، حدثنا معتمر بن سليمان، كلاهما عن أيوب، عن ابن أبي مليكة، عن عبد الله بن الزبير، عن عائشة، قالت قال رسول الله صلى الله عليه وسلم وقال سويد وزهير إن النبي صلى الله عليه وسلم قال ‏\"‏ لا تحرم المصة والمصتان ‏\"‏ ‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her), Suwaid and Zubair reported Allah's Apostle (may peace be upon him) as saying:                      One suckling or two do not make (marriage) unlawful.",
      "chain": [
        "30022",
        "20208",
        "30212",
        "20208",
        "30547",
        "20288",
        "11015",
        "11090",
        "106",
        "53"
      ]
    },
    {
      "hadith_no": "3947",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا حفص بن ميسرة، حدثني موسى بن عقبة، عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم بمثل حديث مالك وعبيد الله ‏.‏",
      "text_en": " Nafi, reported on the authority of Ibn Umar (Allah be pleased with them) a hadith like that narrated before.",
      "chain": [
        "30547",
        "20421",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "4127",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا حفص بن ميسرة، عن زيد بن أسلم، عن عبد الرحمن، بن وعلة - رجل من أهل مصر - أنه جاء عبد الله بن عباس ح . وحدثنا أبو الطاهر، - واللفظ له - أخبرنا ابن وهب، أخبرني مالك بن أنس، وغيره عن زيد بن أسلم، عن عبد الرحمن بن وعلة السبإي، - من أهل مصر - أنه سأل عبد الله بن عباس عما يعصر من العنب فقال ابن عباس إن رجلا أهدى لرسول الله صلى الله عليه وسلم راوية خمر فقال له رسول الله صلى الله عليه وسلم هل علمت أن الله قد حرمها قال لا فسار إنسانا فقال له رسول الله صلى الله عليه وسلم بم ساررته فقال أمرته ببيعها فقال إن الذي حرم شربها حرم بيعها قال ففتح المزادة حتى ذهب ما فيها",
      "text_en": " 'Abd al-Rahman b. Wa'ala as-Saba'i (who was an Egyptian) asked 'Abdullah b. Abbas; (Allah be pleased with them) about that which is extracted from the grapes, whereupon he said:                      A person presented to Allah's Messenger (may peace be upon him) a small water-skin of wine. Allab's Messenger (may peace be upon him) said to him: Do you know that Allah has forbidden it? He said: No. He then whisper- ed to another man. Allah's Messenger (may peace be upon him) asked him what he had whispered. He said: I advised him to sell that, whereupon he (the Holy Prophet) said: Verily He Who has forbidden its drinking has forbidden its sale also. He (the narrator) said: He opened the waterskin until what was contained in it was spilt.",
      "chain": [
        "30547",
        "20421",
        "11163",
        "20029",
        "20001",
        "11163"
      ]
    },
    {
      "hadith_no": "4350",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "وحدثني سويد بن سعيد، حدثنا الوليد بن مسلم، عن الأوزاعي، ح وحدثنا إسحاق، بن إبراهيم وعبد بن حميد قالا حدثنا عبد الرزاق، أخبرنا معمر، كلاهما عن الزهري، بهذا الإسناد وحديث معمر مثل حديث يونس غير أنه قال ‏\"‏ فليتصدق بشىء ‏\"‏ ‏.‏ وفي حديث الأوزاعي ‏\"‏ من حلف باللات والعزى ‏\"‏ ‏.‏ قال أبو الحسين مسلم هذا الحرف - يعني قوله تعال أقامرك ‏.‏ فليتصدق - لا يرويه أحد غير الزهري قال وللزهري نحو من تسعين حديثا يرويه عن النبي صلى الله عليه وسلم لا يشاركه فيه أحد بأسانيد جياد ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Zuhri.",
      "chain": [
        "30547",
        "20733",
        "20024",
        "30123",
        "20121"
      ]
    },
    {
      "hadith_no": "4593",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Judicial Decisions - كتاب الأقضية",
      "chapter_no": "31",
      "text_ar": "وحدثنا سويد بن سعيد، حدثني حفص، - يعني ابن ميسرة الصنعاني - عن موسى بن عقبة، ح وحدثنا أمية بن بسطام، حدثنا يزيد بن زريع، حدثنا روح، - وهو ابن القاسم - عن محمد بن عجلان، جميعا عن أبي الزناد، بهذا الإسناد مثل معنى حديث ورقاء ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Abu az-Zinad with the same chain of transmitters.",
      "chain": [
        "30547",
        "20421",
        "11106",
        "30124",
        "20304",
        "11586",
        "10616"
      ]
    },
    {
      "hadith_no": "4918",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا سعيد بن عمرو الأشعثي، وسويد بن سعيد، وإسحاق بن إبراهيم، وأحمد، بن عبدة - واللفظ لسعيد قال سعيد وإسحاق أخبرنا وقال الآخران، حدثنا سفيان، عن عمرو، عن جابر، قال كنا يوم الحديبية ألفا وأربعمائة فقال لنا النبي صلى الله عليه وسلم ‏\"‏ أنتم اليوم خير أهل الأرض ‏\"‏ ‏.‏ وقال جابر لو كنت أبصر لأريتكم موضع الشجرة.",
      "text_en": " It has been narrated (through a different chain of transmitters) on the authority of Jabir who said:                      We were one thousand and four hundred on the Day of Hudaibiya when the Holy Prophet (may peace be upon him) said to us: Today you are the best people on the earth. And Jabir said: If I had the eyesight, I could show you the place of the tree.",
      "chain": [
        "30465",
        "30547",
        "30123",
        "30423",
        "20005",
        "11081",
        "34"
      ]
    },
    {
      "hadith_no": "4934",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثني سويد بن سعيد، حدثنا علي بن مسهر، عن عاصم، عن أبي عثمان، قال أخبرني مجاشع بن مسعود السلمي، قال جئت بأخي أبي معبد إلى رسول الله صلى الله عليه وسلم بعد الفتح فقلت يا رسول الله بايعه على الهجرة ‏.‏ قال ‏\"‏ قد مضت الهجرة بأهلها ‏\"‏ ‏.‏ قلت فبأى شىء تبايعه قال ‏\"‏ على الإسلام والجهاد والخير ‏\"‏ ‏.‏ قال أبو عثمان فلقيت أبا معبد فأخبرته بقول مجاشع فقال صدق ‏.‏",
      "text_en": " It has been reported on the authority of Mujashi' b. Mas'ud who said:                      I brought my brother Abu Ma'bad to the Messenger of Allah (may peace he upon him) after the conquest of Mecca and said: Messenger of Allah, allow him to swear his pledge of migration at your hand. He said: The period of migration is over with those who had to do it (and now nobody can get this meritorious distinctions) I said: For what actions will you allow him to bind himself in oath? He said: (He can do so) for serving the cause of Islam, for fighting in the way of Allah and for fighting in the cause of virtue. Abd Uthman said: I met Abd Ma'bad and told him what I had heard from Mujashi'. He said: He has told the truth.",
      "chain": [
        "30547",
        "20345",
        "11080",
        "11113",
        "5271"
      ]
    },
    {
      "hadith_no": "5022",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا سعيد بن عمرو الأشعثي، وسويد بن سعيد، - واللفظ لسعيد - أخبرنا  سفيان، عن عمرو، سمع جابرا، يقول قال رجل أين أنا يا، رسول الله إن قتلت قال ‏\"‏ في الجنة ‏\"‏ ‏.‏ فألقى تمرات كن في يده ثم قاتل حتى قتل ‏.‏ وفي حديث سويد قال رجل للنبي صلى الله عليه وسلم يوم أحد ‏.‏",
      "text_en": " It has been reported on the authority of Jabir that a man said:                      Messenger of Allah, where shall I be if I am killed? He replied: In Paradise. The man threw away the dates he had in his hand and fought until he was killed (i. e. he did not wait until he could finish the dates). In the version of the tradition narrated by Suwaid we have the words:\" A man said to the Holy Prophet (may peace be upon him). on the day of Uhud......\"",
      "chain": [
        "30465",
        "30547",
        "20005",
        "11081",
        "34"
      ]
    },
    {
      "hadith_no": "5523",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "وحدثنا ابن نمير، حدثنا أبي ح، وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، ح وحدثنا محمد بن أبي بكر المقدمي، حدثنا يحيى بن سعيد، كلهم عن عبيد الله، ح وحدثني سويد بن سعيد، حدثنا حفص بن ميسرة، عن موسى بن عقبة، كلاهما عن نافع، عن ابن، عمر عن النبي صلى الله عليه وسلم بنحو حديث مالك ‏.‏",
      "text_en": " This hadith has been narrated by Ibn Umar through another chain of transmitters.",
      "chain": [
        "30212",
        "20331",
        "30201",
        "20318",
        "30161",
        "20031",
        "11201",
        "30547",
        "20421",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "5633",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "حدثني سويد بن سعيد، حدثنا عبد العزيز بن أبي حازم، عن أبي سلمة بن عبد،الرحمن عن عائشة، أنها قالت واعد رسول الله صلى الله عليه وسلم جبريل عليه السلامفي ساعة يأتيه فيها فجاءت تلك الساعة ولم يأته وفي يده عصا فألقاها من يده وقال‏\"‏ ما يخلف الله وعده ولا رسله ‏\"‏ ‏.‏ ثم التفت فإذا جرو كلب تحت سريره فقال ‏\"‏ ياعائشة متى دخل هذا الكلب ها هنا ‏\"‏ ‏.‏ فقالت والله ما دريت ‏.‏ فأمر به فأخرج فجاءجبريل فقال رسول الله صلى الله عليه وسلم ‏\"‏ واعدتني فجلست لك فلم تأت ‏\"‏ ‏.‏ فقالمنعني الكلب الذي كان في بيتك إنا لا ندخل بيتا فيه كلب ولا صورة ‏.‏",
      "text_en": " A'isha reported that Gabriel (peace be upon him) made a promise with Allah's Messenger (may peace be upon him) to come at a definite hour; that hour came but he did not visit him. And there was in his hand (in the hand of Allah's Apostle) a staff. He threw it from his hand and said:                      Never has Allah or His messengers (angels) ever broken their promise. Then he cast a glance (and by chance) found a puppy under his cot and said: 'A'isha, when did this dog enter here? She said: BY Allah, I don't know He then commanded and it was turned out. Then Gabriel came and Allah's Messenger (may peace be upon him) said to him: You promised me and I waited for you. but you did not come, whereupon he said: It was the dog in your house which prevented me (to come), for we (angels) do not enter a house in which there is a dog or a picture.",
      "chain": [
        "30547",
        "20165",
        "53"
      ]
    },
    {
      "hadith_no": "5685",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "حدثني سويد بن سعيد، حدثني حفص بن ميسرة، عن زيد بن أسلم، عن عطاء، بن يسار عن أبي سعيد الخدري، عن النبي صلى الله عليه وسلم قال ‏\"‏ إياكم والجلوس في الطرقات ‏\"‏ ‏.‏ قالوا يا رسول الله ما لنا بد من مجالسنا نتحدث فيها ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ فإذا أبيتم إلا المجلس فأعطوا الطريق حقه ‏\"‏ ‏.‏ قالوا وما حقه قال ‏\"‏ غض البصر وكف الأذى ورد السلام والأمر بالمعروف والنهى عن المنكر ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id Kbudri reported Allah's Apostle (may peace be upon him) as saying:                      Avoid sitting on the paths. They (his Companions) said: Allah's Messenger. there is no other help to it (but to sit here as we) hold our meetings and discuss matters there. Thereupon Allah's Messenger (may peace be upon him) said: If you have to sit at all, theg fulfil the rights, of the path. They said: What are their rights? Thereupon he said: Keeping the eye downward (so that you may not stare at the women), refraining from doing some harm to the other and exchanging mutual greetings (saying as-Salamu 'Alaikum to one another) and commanding the good and forbidding the evil.",
      "chain": [
        "30547",
        "20421",
        "11163",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "5774",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا حفص بن ميسرة، عن زيد بن أسلم، عن عطاء، بن يسار عن أبي سعيد الخدري، عن النبي صلى الله عليه وسلم قال ‏\"‏ إياكم والجلوس بالطرقات ‏\"‏ ‏.‏ قالوا يا رسول الله ما لنا بد من مجالسنا نتحدث فيها ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا أبيتم إلا المجلس فأعطوا الطريق حقه ‏\"‏ ‏.‏ قالوا وما حقه قال ‏\"‏ غض البصر وكف الأذى ورد السلام والأمر بالمعروف والنهى عن المنكر ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id Khudri reported Allah's Apostle (may peace be upon him) as saying:                      Avoid sitting on the paths. They (the Companions) said: Allah's Messenger, we cannot help but holding our meetings (in these paths) and discuss matters (there). Thereupon Allah's Messenger (may peace be upon him) said: If you insist on holding meetings, then give the path its due right. They said: What are its due rights? Upon this he said: Lowering the gaze, refraining from doing harm, exchanging of greetings. commanding of good and forbidding from evil.",
      "chain": [
        "30547",
        "20421",
        "11163",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "6127",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثني سويد بن سعيد، حدثنا حفص بن ميسرة، عن موسى بن عقبة، عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم بمثل حديث عبيد الله ‏.‏",
      "text_en": " A hadith like this has been narrated on the authority of Ibn Umar through another chain of transmitters.",
      "chain": [
        "30547",
        "20421",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "6234",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا أبو كامل، حدثنا حماد يعني ابن زيد، ح وحدثني سويد بن سعيد، حدثنا  علي بن مسهر، كلاهما عن عاصم الأحول، ح وحدثني حامد بن عمر البكراوي، - واللفظ له - حدثنا عبد الواحد، - يعني ابن زياد - حدثنا عاصم، عن عبد الله بن سرجس، قال رأيت النبي صلى الله عليه وسلم وأكلت معه خبزا ولحما - أو قال ثريدا - قال فقلت له أستغفر لك النبي صلى الله عليه وسلم قال نعم ولك ثم تلا هذه الآية ‏{‏ واستغفر لذنبك وللمؤمنين والمؤمنات‏}‏ قال ثم درت خلفه فنظرت إلى خاتم النبوة بين كتفيه عند ناغض كتفه اليسرى جمعا عليه خيلان كأمثال الثآليل ‏.‏",
      "text_en": " Abdullah b. Sarjis reported:                      I saw Allah's Apostle (may peace be upon him) and ate with him bread and meat, or he said Tharid (bread soaked in soup). I said to him: Did Allah's Apostle (may peace be upon him) seek forgiveness for you? He said: Yes, and for you, and he then recited this verse:\" Ask forgiveness for thy sin and for the believing men and believing women\" (xlvii. 19). I then went after him and saw the Seal of Prophethood between his shoulders on the left side of his shoulder having spots on it like moles.",
      "chain": [
        "20022",
        "30547",
        "11080",
        "30128",
        "20256",
        "11080",
        "3245"
      ]
    },
    {
      "hadith_no": "6398",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا إسماعيل بن الخليل، وسويد بن سعيد، كلاهما عن ابن مسهر، قال إسماعيل أخبرنا علي بن مسهر، عن هشام بن عروة، عن أبيه، عن عبد الله بن الزبير، قال كنت أنا وعمر بن أبي سلمة، يوم الخندق مع النسوة في أطم حسان فكان يطأطئ لي مرة فأنظر وأطأطئ له مرة فينظر فكنت أعرف أبي إذا مر على فرسه في السلاح إلى بني قريظة ‏.‏ قال وأخبرني عبد الله بن عروة عن عبد الله بن الزبير قال فذكرت ذلك لأبي فقال ورأيتني يا بنى قلت نعم ‏.‏ قال أما والله لقد جمع لي رسول الله صلى الله عليه وسلم يومئذ أبويه فقال ‏\"‏ فداك أبي وأمي ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. Zubair reported on the Day of the Battle of the Trench:                      I and Umar b. Abu Salama were with women folk in the fort of Hassan (b. Thabit). He at one time leaned for me and I cast a glance and at anothertime I leaned for him and he would see and I recognised my father as he rode on his horse with his arms towards the tribe of Quraizah. 'Abdullah b. 'Urwa reported from Abdullah b. Zubair: I made a mention of that to my father, whereupon he said: My son, did you see me (on that occasion)? He said: Yes. Thereupon he said: By Allah, Allah's Messenger (may peace be upon him) addressed me saying: I would sacrifice for thee my father and my mother.",
      "chain": [
        "30186",
        "30547",
        "20208",
        "20345",
        "11065",
        "10511",
        "106"
      ]
    },
    {
      "hadith_no": "6435",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا علي بن مسهر، عن هشام، عن أبيه، عن عائشة، قالت استأذنت هالة بنت خويلد أخت خديجة على رسول الله صلى الله عليه وسلم فعرف استئذان خديجة فارتاح لذلك فقال ‏\"‏ اللهم هالة بنت خويلد ‏\"‏ ‏.‏ فغرت فقلت وما تذكر من عجوز من عجائز قريش حمراء الشدقين هلكت في الدهر فأبدلك الله خيرا منها ‏.‏",
      "text_en": " A'isha reported that Hala b. Khuwailid (sister of Khadija) sought permission from Allah's Messenger (may peace be upon him) to see him and he was reminded of Khadija's (manner of) asking leave to enter and (was overwhelmed) with emotions thereby and said:                      O Allah, it is Hala, daughter of Khuwailid, and I felt jealous and said: Why do you remember one of those old women of the Quraish with gums red and who is long dead-while Allah has given you a better one in her stead?",
      "chain": [
        "30547",
        "20345",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "6720",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثني سويد بن سعيد، حدثنا مروان بن معاوية، عن عاصم الأحول، بهذا الإسناد ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Asim al-Ahwal with the same chain of transmitters.",
      "chain": [
        "30547",
        "20201"
      ]
    },
    {
      "hadith_no": "6775",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثني سويد بن سعيد، حدثني حفص بن ميسرة، عن زيد بن أسلم، أن عبد الملك، بن مروان بعث إلى أم الدرداء بأنجاد من عنده فلما أن كان ذات ليلة قام عبد الملك من الليل فدعا خادمه فكأنه أبطأ عليه فلعنه فلما أصبح قالت له أم الدرداء سمعتك الليلة لعنت خادمك حين دعوته ‏.‏ فقالت سمعت أبا الدرداء يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يكون اللعانون شفعاء ولا شهداء يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " Zaid b. Aslam reported that 'Abd al-Malik b. Marwan sent some domestic goods for decoration to Umm Darda' on his own behalf, and when it was night 'Abd al-Malik got up and called for the servant. It seemed as if he (the servant) was late (in responding to his call), so he ('Abd al-Malik) invoked curse upon him, and when it was morning Umm Darda' said to him:                      I heard you cursing your servant during the night when you called him, and she said: I heard Abu Darda' as saying that Allah's Messenger (may peace be upon him) said: The invoker of curse would neither be intercessor nor witness on the Day of Resurrection.",
      "chain": [
        "30547",
        "20421",
        "11163"
      ]
    },
    {
      "hadith_no": "6847",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا سويد بن سعيد، عن معتمر بن سليمان، عن أبيه، حدثنا أبو عمران الجوني، عن جندب، أن رسول الله صلى الله عليه وسلم حدث ‏\"‏ أن رجلا قال والله لا يغفر الله لفلان وإن الله تعالى قال من ذا الذي يتألى على أن لا أغفر لفلان فإني قد غفرت لفلان وأحبطت عملك ‏\"‏ ‏.‏ أو كما قال ‏.‏",
      "text_en": " Jundub reported that Allah's Messenger (may peace be upon him) stated that a person said:                      Allah would not forgive such and such (person). Thereupon Allah the Exalted and Glorious, said: Who is he who adjures about Me that I would not grant pardon to so and so; I have granted pardon to so and so and blotted out his deeds (who took an oath that I would not grant pardon to him).",
      "chain": [
        "30547",
        "20288",
        "11289",
        "11296",
        "4053"
      ]
    },
    {
      "hadith_no": "6848",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثني سويد بن سعيد، حدثني حفص بن ميسرة، عن العلاء بن عبد الرحمن، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ رب أشعث مدفوع بالأبواب لو أقسم على الله لأبره ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace he upon him) as saying:                      Many a person with disheveled hair and covered with dust is turned away from the doors (whereas he is held in such a high esteem by Allah) that if he were to adjure in the name of Allah (about anything) Allah would fulfil that.",
      "chain": [
        "30547",
        "20421",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "6870",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا سويد بن سعيد، ومحمد بن عبد الأعلى، - وتقاربا في اللفظ - قالا حدثنا  المعتمر، عن أبيه، عن أبي السليل، عن أبي حسان، قال قلت لأبي هريرة إنه قد مات لي ابنان فما أنت محدثي عن رسول الله صلى الله عليه وسلم بحديث تطيب به أنفسنا عن موتانا قال قال نعم ‏\"‏ صغارهم دعاميص الجنة يتلقى أحدهم أباه - أو قال أبويه - فيأخذ بثوبه - أو قال بيده - كما آخذ أنا بصنفة ثوبك هذا فلا يتناهى - أو قال فلا ينتهي - حتى يدخله الله وأباه الجنة ‏\"‏ ‏.‏ وفي رواية سويد قال حدثنا أبو السليل وحدثنيه عبيد الله بن سعيد حدثنا يحيى - يعني ابن سعيد - عن التيمي بهذا الإسناد وقال فهل سمعت من رسول الله صلى الله عليه وسلم شيئا تطيب به أنفسنا عن موتانا قال نعم ‏.‏",
      "text_en": " Abu Hassan reported:                      I said to Abu Huraira that my two children had died. Would you narrate to me anything from Allah's Messenger (may peace be upon him) a hadith which would soothe our hearts in our bereavements? He said: Yes. Small children are the fowls of Paradise. If one of them meets his father (or he said his parents) he would take hold of his cloth, or he said with his hand as I take hold of the hem of your cloth (with my hand). And he (the child) would not take off (his hand) from it until Allah causes his father to enter Paradise. This hadith has been narrated on the authority of Tamim with the same chain of transmitters. And he is reported to have said: Did you hear from Allah's Messenger (may peace be upon him) anything which may soothe our heart in our bereavements? He said: Yes.",
      "chain": [
        "30547",
        "20288",
        "11289"
      ]
    },
    {
      "hadith_no": "6952",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Knowledge - كتاب العلم",
      "chapter_no": "48",
      "text_ar": "حدثني سويد بن سعيد، حدثنا حفص بن ميسرة، حدثني زيد بن أسلم، عن عطاء، بن يسار عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لتتبعن سنن الذين من قبلكم شبرا بشبر وذراعا بذراع حتى لو دخلوا في جحر ضب لاتبعتموهم ‏\"‏ ‏.‏ قلنا يا رسول الله آليهود والنصارى قال ‏\"‏ فمن ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id al-Khudri reported Allah's Messenger (may peace be upon him) as saying:                      You would tread the same path as was trodden by those before you inch by inch and step by step so much so that if they had entered into the hole of the lizard, you would follow them in this also. We said: Allah's Messenger, do you mean Jews and Christians (by your words)\" those before you\"? He said: Who else (than those two religious groups)?",
      "chain": [
        "30547",
        "20421",
        "11163",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "7122",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Heart-Melting Traditions - كتاب الرقاق",
      "chapter_no": "50",
      "text_ar": "حدثنا عبيد الله بن معاذ العنبري، وسويد بن سعيد، ومحمد بن عبد الأعلى، جميعا عن المعتمر، قال ابن معاذ حدثنا المعتمر بن سليمان، قال قال أبي حدثنا أبو عثمان، عن أسامة بن زيد بن حارثة، وسعيد بن زيد بن عمرو بن نفيل، أنهما حدثا عن رسول الله صلى الله عليه وسلم أنه قال ‏\"‏ ما تركت بعدي في الناس فتنة أضر على الرجال من النساء ‏\"‏ ‏.‏",
      "text_en": " Usama b. Zaid b. Harith and Sa'id b. Zaid b. 'Amr b. Naufal both reported Allah's Messenger (may peace be upon him) as saying:                      I have not left after me turmoil for the people but the harm done to men by women.",
      "chain": [
        "30150",
        "30547",
        "20288",
        "20288",
        "11289",
        "11113",
        "50",
        "11"
      ]
    },
    {
      "hadith_no": "7126",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Heart-Melting Traditions - كتاب الرقاق",
      "chapter_no": "50",
      "text_ar": "وحدثنا إسحاق بن منصور، وعبد بن حميد، قالا أخبرنا أبو عاصم، عن ابن، جريج أخبرني موسى بن عقبة، ح وحدثني سويد بن سعيد، حدثنا علي بن مسهر، عن  عبيد الله، ح وحدثني أبو كريب، ومحمد بن طريف البجلي، قالا حدثنا ابن فضيل، حدثنا  أبي ورقبة بن مسقلة، ح وحدثني زهير بن حرب، وحسن الحلواني، وعبد بن حميد، قالوا حدثنا يعقوب، - يعنون ابن إبراهيم بن سعد - حدثنا أبي، عن صالح بن كيسان، كلهم عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم بمعنى حديث أبي ضمرة عن موسى بن عقبة وزادوا في حديثهم ‏\"‏ وخرجوا يمشون ‏\"‏ ‏.‏ وفي حديث صالح ‏\"‏ يتماشون ‏\"‏ ‏.‏ إلا عبيد الله فإن في حديثه ‏\"‏ وخرجوا ‏\"‏ ‏.‏ ولم يذكر بعدها شيئا ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Musa b. 'Uqba but with a slight variation of wording.",
      "chain": [
        "30313",
        "30553",
        "20241",
        "11070",
        "11106",
        "30547",
        "20345",
        "11201",
        "30216",
        "30476",
        "20356",
        "30022"
      ]
    },
    {
      "hadith_no": "7128",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Repentance and Exhortation to Repentance - كتاب التوبة",
      "chapter_no": "51",
      "text_ar": "حدثني سويد بن سعيد، حدثنا حفص بن ميسرة، حدثني زيد بن أسلم، عن أبي، صالح عن أبي هريرة، عن رسول الله صلى الله عليه وسلم أنه قال ‏\"‏ قال الله عز وجل أنا عند ظن عبدي بي وأنا معه حيث يذكرني والله لله أفرح بتوبة عبده من أحدكم يجد ضالته بالفلاة ومن تقرب إلى شبرا تقربت إليه ذراعا ومن تقرب إلى ذراعا تقربت إليه باعا وإذا أقبل إلى يمشي أقبلت إليه أهرول ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      Allah, the Exalted and Glorious, said: I live in the thought of My servant and I am with him as he remembers Me. (The Holy Prophet) further said: By Allah, Allah is more pleased wth the repentance of His servant than what one of you would do on finding the lost camel in the waterless desert. When he draws near Me by the span of his hand. I draw near him by the length of a cubit and when he draws near Me by the length of a cubit. I draw near him by the length of a fathom and when he draws near Me walking I draw close to him hurriedly.",
      "chain": [
        "30547",
        "20421",
        "11163",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "7369",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "حدثني سويد بن سعيد، حدثني حفص بن ميسرة، عن العلاء بن عبد الرحمن، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ رب أشعث مدفوع بالأبواب لو أقسم على الله لأبره ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as say- ing:                      Many a people with dishevelled hair are driven away from the door (but they are so pious) that if they are to swear in the name of Allah, He would definitely fulfil that.",
      "chain": [
        "30547",
        "20421",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "7383",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "حدثنا محمد بن إسحاق المسيبي، حدثنا أنس يعني ابن عياض، ح وحدثني  سويد بن سعيد، حدثنا حفص بن ميسرة، كلاهما عن موسى بن عقبة، ح وحدثنا أبو بكر، بن أبي شيبة حدثنا أبو خالد الأحمر، وعيسى بن يونس، عن ابن عون، ح وحدثني عبد، الله بن جعفر بن يحيى حدثنا معن، حدثنا مالك، ح وحدثني أبو نصر التمار، حدثنا حماد، بن سلمة عن أيوب، ح وحدثنا الحلواني، وعبد بن حميد، عن يعقوب بن إبراهيم بن سعد، حدثنا أبي، عن صالح، كل هؤلاء عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم ‏.‏ بمعنى حديث عبيد الله عن نافع ‏.‏ غير أن في حديث موسى بن عقبة وصالح ‏\"‏ حتى يغيب أحدهم في رشحه إلى أنصاف أذنيه ‏\"‏ ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Ibn 'Umar but with a slight variation of wording (and the words are):                     \" One of them would be completely submerged in perspiration up to half of his ears.\"",
      "chain": [
        "30413",
        "20157",
        "30547",
        "20421",
        "11106",
        "30201",
        "20326",
        "20347",
        "11071",
        "30112",
        "20001"
      ]
    },
    {
      "hadith_no": "7611",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "حدثني سويد بن سعيد، حدثنا حفص بن ميسرة، عن العلاء، عن أبيه، عن أبي، هريرة أن رسول الله صلى الله عليه وسلم قال ‏\"‏ يقول العبد مالي مالي إنما له من ماله ثلاث ما أكل فأفنى أو لبس فأبلى أو أعطى فاقتنى وما سوى ذلك فهو ذاهب وتاركه للناس ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      A servant says, My wealth. my wealth, but out of his wealth three things are only his: whatever he eats and makes use of or by means of which he dresses himself and it wears out or he gives as charity, and this is what he stored for himself (as a reward for the Hereafter), and what is beyond this (it is of no use to you) because you are to depart and leave it for other people. This hadith has been narrated on the authority of al-'Ala' b. 'Abd al-Rahman with the same chain of transmitters.",
      "chain": [
        "30547",
        "20421",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "31",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وسويد بن سعيد، وعبد الله بن عامر بن زرارة، وإسماعيل بن موسى، قالوا حدثنا شريك، عن سماك، عن عبد الرحمن بن عبد الله بن مسعود، عن أبيه، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من كذب على متعمدا فليتبوأ مقعده من النار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdur-Rahman bin 'Abdullah bin Mas'ud that his father said:                     \"The Messenger of Allah (ﷺ) said: 'Whoever tells lies about me deliberately, let him take his place in Hell.\"",
      "chain": [
        "30201",
        "30547",
        "30467",
        "35016",
        "20587",
        "10770",
        "11363",
        "16"
      ]
    },
    {
      "hadith_no": "38",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا علي بن مسهر، عن مطرف، عن عطية، عن أبي سعيد، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من كذب على متعمدا فليتبوأ مقعده من النار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Sa'eed said:                     \"The Messenger of Allah (ﷺ) said: 'Whoever tells lies about me deliberately, let him take his place in Hell.\"",
      "chain": [
        "30547",
        "20345",
        "11395",
        "38"
      ]
    },
    {
      "hadith_no": "47",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا سويد بن سعيد، وأحمد بن ثابت الجحدري، قالا حدثنا عبد الوهاب الثقفي، عن جعفر بن محمد، عن أبيه، عن جابر بن عبد الله، قال كان رسول الله  صلى الله عليه وسلم  إذا خطب احمرت عيناه وعلا صوته واشتد غضبه كأنه منذر جيش يقول ‏\"‏ صبحكم مساكم ‏\"‏ ‏.‏ ويقول ‏\"‏ بعثت أنا والساعة كهاتين ‏\"‏ ‏.‏ ويقرن بين إصبعيه السبابة والوسطى ثم يقول ‏\"‏ أما بعد فإن خير الأمور كتاب الله وخير الهدى هدى محمد وشر الأمور محدثاتها وكل بدعة ضلالة ‏\"‏ ‏.‏ وكان يقول ‏\"‏ من ترك مالا فلأهله ومن ترك دينا أو ضياعا فعلى وإلى ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Jabir bin 'Abdullah said:                     \"When the Messenger of Allah (ﷺ) delivered a sermon, his eyes would turn red, he would raise his voice and he would speak with intensity, as if he were warning of an (enemy) army, saying, 'They will surely attack you in the morning, or they will surely attack you in the evening!' He would say: 'I and the Hour have been sent like these two,' and he would hold his index and middle finger. Then he would say: 'The best of guidance is the guidance of Muhammad. The most evil matters are those that are newly-invented, and every innovation (Bid'ah) is a going astray.' And he used to say: 'Whoever dies and leaves behind some wealth, it is for his family, and whoever leaves behind a debt or dependent children, then they are both my responsibility.'\"",
      "chain": [
        "30547",
        "34002",
        "20259",
        "10898",
        "11442",
        "34"
      ]
    },
    {
      "hadith_no": "54",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا أبو كريب، محمد بن العلاء حدثنا عبد الله بن إدريس، وعبدة، وأبو معاوية وعبد الله بن نمير ومحمد بن بشر ح وحدثنا سويد بن سعيد، حدثنا علي بن مسهر، ومالك بن أنس، وحفص بن ميسرة، وشعيب بن إسحاق، عن هشام بن عروة، عن أبيه، عن عبد الله بن عمرو بن العاص، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ إن الله لا يقبض العلم انتزاعا ينتزعه من الناس ولكن يقبض العلم بقبض العلماء فإذا لم يبق عالما اتخذ الناس رءوسا جهالا فسئلوا فأفتوا بغير علم فضلوا وأضلوا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin 'Amr bin 'As that:                     the Messenger of Allah (ﷺ) said: 'Allah will not take away knowledge by removing it from people (from their hearts). Rather He will take away knowledge by taking away the scholars, then when there are no scholars left, the people will take the ignorant as their leaders. They will be asked questions and they will issue verdicts without knowledge, thus they will go astray and lead others astray.'\"",
      "chain": [
        "30216",
        "20102",
        "20337",
        "30547",
        "20345",
        "20001",
        "20421",
        "20239",
        "11065",
        "10511"
      ]
    },
    {
      "hadith_no": "58",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا ابن أبي الرجال، عن عبد الرحمن بن عمرو الأوزاعي، عن عبدة بن أبي لبابة، عن عبد الله بن عمرو بن العاص، قال سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ لم يزل أمر بني إسرائيل معتدلا حتى نشأ فيهم المولدون أبناء سبايا الأمم فقالوا بالرأى فضلوا وأضلوا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin 'Amr bin 'As said:                     \"I heard the Messenger of Allah (ﷺ) say: 'The affairs of the Children of Israel remained fair until Muwalladun emerged among them - the children of female slaves from other nations. They spoke of their own opinions (in religious matters) and so they went astray and led others astray.'\"",
      "chain": [
        "30547",
        "20024",
        "10793",
        "29"
      ]
    },
    {
      "hadith_no": "62",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا علي بن مسهر، عن الأعمش، ح وحدثنا علي بن ميمون الرقي، حدثنا سعيد بن مسلمة، عن الأعمش، عن إبراهيم، عن علقمة، عن عبد الله، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا يدخل الجنة من كان في قلبه مثقال حبة من خردل من كبر ولا يدخل النار من كان في قلبه مثقال حبة من خردل من إيمان ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abdullah said:                     \"The Messenger of Allah (ﷺ) said: 'No one will enter Paradise who has even a mustard-seed's weight of arrogance in his heart, and no one will enter Hell who has even a mustard-seed's weight of faith in his heart.'\"",
      "chain": [
        "30547",
        "20345",
        "11060",
        "38412",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "124",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وسويد بن سعيد، وإسماعيل بن موسى، قالوا حدثنا شريك، عن أبي إسحاق، عن حبشي بن جنادة، قال سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ علي مني وأنا منه ولا يؤدي عني إلا علي ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Hubshi bin Junadah said:                     \"I heard the Messenger of Allah say: ''Ali is part of me and I am part of him, and no one will represent me except 'Ali.'\"",
      "chain": [
        "30201",
        "30547",
        "35016",
        "11858",
        "11049",
        "4112"
      ]
    },
    {
      "hadith_no": "154",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا إسماعيل بن موسى، وسويد بن سعيد، قالا حدثنا شريك، عن أبي ربيعة الإيادي، عن ابن بريدة، عن أبيه، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن الله أمرني بحب أربعة وأخبرني أنه يحبهم ‏\"‏ ‏.‏ قيل يا رسول الله من هم قال ‏\"‏ علي منهم ‏\"‏ ‏.‏ يقول ذلك ثلاثا ‏\"‏ وأبو ذر وسلمان والمقداد ‏\"‏ ‏.‏",
      "text_en": " Ibn Buraidah narrated that his father said:                     \"The Messenger of Allah said: 'Allah has commanded me to love four people, and He told me that He also loves them.' He was asked: 'O Messenger of Allah, who are they?' He said: ''Ali is one of them,' and he said that three times, 'and Abu Dharr, Salman and Miqdad.'\"",
      "chain": [
        "35016",
        "30547",
        "20587",
        "11432",
        "3131"
      ]
    },
    {
      "hadith_no": "176",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وسويد بن سعيد، قالا حدثنا أبو الأحوص، عن سماك، عن عكرمة، عن ابن عباس، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ ليقرأن القرآن ناس من أمتي يمرقون من الإسلام كما يمرق السهم من الرمية ‏\"‏ ‏.‏",
      "text_en": "",
      "chain": [
        "30201",
        "30547",
        "20327",
        "10770",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "289",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا علي بن مسهر، عن أبي سفيان، طريف السعدي ح وحدثنا أبو كريب، محمد بن العلاء حدثنا أبو معاوية، عن أبي سفيان السعدي، عن أبي نضرة، عن أبي سعيد الخدري، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ مفتاح الصلاة الطهور وتحريمها التكبير وتحليلها التسليم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Sa'eed Al-Khudri that:                     The Messenger of Allah said: \"The key to prayer is purification, its opening is to say Allahu Akbar and its closing is to say As-salamu 'alaikum.\"",
      "chain": [
        "30547",
        "20345",
        "30216",
        "20354",
        "14190",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "295",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا سويد بن سعيد، حدثني حفص بن ميسرة، حدثني زيد بن أسلم، عن عطاء بن يسار، عن عبد الله الصنابحي، عن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ من توضأ فمضمض واستنشق خرجت خطاياه من فمه وأنفه فإذا غسل وجهه خرجت خطاياه من وجهه حتى تخرج من تحت أشفار عينيه فإذا غسل يديه خرجت خطاياه من يديه فإذا مسح رأسه خرجت خطاياه من رأسه حتى تخرج من أذنيه فإذا غسل رجليه خرجت خطاياه من رجليه حتى تخرج من تحت أظفار رجليه وكانت صلاته ومشيه إلى المسجد نافلة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah As-Sunabihi that:                     The Messenger of Allah said: \"Whoever performs ablution and rinses his mouth and nose, his sins will exit through his mouth and nose. When he washes his face, his sins will exit from his face, even from beneath his eyelids. When he washes his hands, his sins will exit from his hands. When he wipes his head, his sins will exit from his head, and even from his ears. When he washes his feet, his sins will exit from his feet, even from beneath his toenails. Then his prayer and walking towards the mosque will earn extra merit for him.\"",
      "chain": [
        "30547",
        "20421",
        "11163",
        "11020",
        "5144"
      ]
    },
    {
      "hadith_no": "321",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا يحيى بن زكريا بن أبي زائدة، عن أبيه، عن خالد بن سلمة، عن عبد الله البهي، عن عروة، عن عائشة، أن رسول الله  صلى الله عليه وسلم  كان يذكر الله على كل أحيانه ‏.‏",
      "text_en": " 'Urwah narrated from 'Aishah that:                     The Messenger of Allah used to remember Allah in all circumstances.",
      "chain": [
        "30547",
        "20366",
        "11338",
        "10680",
        "10939",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "327",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وسويد بن سعيد، وإسماعيل بن موسى السدي، قالوا حدثنا شريك، عن المقدام بن شريح بن هانئ، عن أبيه، عن عائشة، قالت من حدثك أن رسول الله  صلى الله عليه وسلم  بال قائما فلا تصدقه أنا رأيته يبول قاعدا ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"If anyone tells you that the Messenger of Allah urinated while standing, do not believe him, for I (always) saw him urinating while sitting down.\"",
      "chain": [
        "30201",
        "30547",
        "35016",
        "11858",
        "10830",
        "10774",
        "53"
      ]
    },
    {
      "hadith_no": "380",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا عيسى بن يونس، عن هاشم بن البريد، عن عبد الله بن محمد بن عقيل، عن جابر بن عبد الله، أن رجلا، مر على النبي  صلى الله عليه وسلم  وهو يبول فسلم عليه فقال له رسول الله  صلى الله عليه وسلم  ‏\"‏ إذا رأيتني على مثل هذه الحالة فلا تسلم على فإنك إن فعلت ذلك لم أرد عليك ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Jabir bin 'Abdullah that:                     \"A man passed by the Prophet while he was urinating, and greeted him by the Salam. The Messenger of Allah said to him: \"If you see me in this istuation, do not greet me with the Salam, for if you that I will not respond to you.'\"",
      "chain": [
        "30547",
        "20347",
        "15581",
        "12246",
        "34"
      ]
    },
    {
      "hadith_no": "478",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا يحيى بن زكريا بن أبي زائدة، عن شعبة، عن حبيب بن زيد، عن عباد بن تميم، عن عبد الله بن زيد، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ الأذنان من الرأس ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Zaid said:                     \"The Messenger of Allah said: 'The ears are part of the head.'\"",
      "chain": [
        "30547",
        "20366",
        "20020",
        "20700",
        "639",
        "605"
      ]
    },
    {
      "hadith_no": "549",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا شريك، عن عمرو بن عامر، عن أنس بن مالك، قال كان رسول الله  صلى الله عليه وسلم  يتوضأ لكل صلاة وكنا نحن نصلي الصلوات كلها بوضوء واحد ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                     \"The Messenger of Allah used to perform ablution for every prayer, and we used to perform all of the prayers with one ablution.\"",
      "chain": [
        "30547",
        "20587",
        "15406",
        "19"
      ]
    },
    {
      "hadith_no": "704",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا سفيان بن عيينة، عن مسعر، ح وحدثنا محمد بن عثمان بن كرامة، حدثنا أبو أسامة، عن مسعر، عن عبد الجبار بن وائل، عن أبيه، قال رأيت النبي  صلى الله عليه وسلم  أتي بدلو فمضمض منه فمج فيه مسكا أو أطيب من المسك واستنثر خارجا من الدلو ‏.‏",
      "text_en": " It was narrated from 'Abdul Jabbar bin Wa'il that his father said:                     \"A bucket was brought to the Prophet; he rinsed his mouth and spat into it, and it was like musk or better than musk, and he rinsed his nostrils outside the bucket.\"",
      "chain": [
        "30547",
        "20005",
        "20359",
        "30214",
        "20318",
        "20359",
        "10940"
      ]
    },
    {
      "hadith_no": "709",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا أبو الأحوص، عن محمد بن عبيد الله، عن الحسن بن سعد، عن أبيه، عن علي، قال جاء رجل إلى النبي  صلى الله عليه وسلم  فقال إني اغتسلت من الجنابة وصليت الفجر ثم أصبحت فرأيت قدر موضع الظفر لم يصبه الماء ‏.‏ فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ لو كنت مسحت عليه بيدك أجزأك ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Ali said:                     \"A man came to the Prophet and said: 'I bathed to cleanse myself from sexual impurity, and I prayed Fajr, then I noticed a spot the size of a fingernail that the water did not reach.' The Messenger of Allah said: 'If you had wiped it that would have been sufficient for you.'\"",
      "chain": [
        "30547",
        "20327",
        "30213",
        "10754",
        "18341",
        "5"
      ]
    },
    {
      "hadith_no": "888",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو كريب، حدثنا محمد بن الفضيل، ح وحدثنا سويد بن سعيد، حدثنا علي بن مسهر، جميعا عن أبي سفيان السعدي، عن أبي نضرة، عن أبي سعيد، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا صلاة لمن لم يقرأ في كل ركعة ب ‏{الحمد لله‏}‏ وسورة في فريضة أو غيرها ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Sa’eed said:                      “The Messenger of Allah (ﷺ)said: ‘There is no prayer for the one who does not recite in everyRak’ah: Al-Hamd (Al-Fatihah) and a Surah whether in an obligatoryprayer or another.’”",
      "chain": [
        "30216",
        "30547",
        "20345",
        "14190",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "1010",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا بكر بن خلف، وسويد بن سعيد، قالا حدثنا يزيد بن زريع، حدثنا خالد الحذاء، عن أبي قلابة، عن زينب بنت أبي سلمة، عن أمها، قالت كان فراشها بحيال مسجد رسول الله  صلى الله عليه وسلم  ‏.‏",
      "text_en": " It wasnarrated from Zainab bint Umm Salamah that her mother saidthat herbed was in front of the place where the Messenger of Allah(ﷺ)prostrated.",
      "chain": [
        "34043",
        "30547",
        "20304",
        "11282",
        "11047",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "1014",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا حميد بن مسعدة، وسويد بن سعيد، قالا حدثنا حماد بن زيد، حدثنا محمد بن زياد، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ ألا يخشى الذي يرفع رأسه قبل الإمام أن يحول الله رأسه رأس حمار ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Hurairah said:                      “The Messenger of Allah (ﷺ)said: ‘Does not the one who raises his head before the Imam fearthatAllah may turn his head into the head of a donkey?’”",
      "chain": [
        "30430",
        "30547",
        "20022",
        "11216",
        "13"
      ]
    },
    {
      "hadith_no": "1089",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا يحيى بن سليم، عن إسماعيل بن أمية، وعبيد الله، عن نافع، أنه كان يقول قال ابن عمر رخص رسول الله  صلى الله عليه وسلم  للنساء في التصفيق وللرجال في التسبيح ‏.‏",
      "text_en": " It wasnarrated that Nafi’ used to say:                      “Ibn ‘Umar said: ‘TheMessenger of Allah (ﷺ) granted a concession for the women to slap,and for the men to say the Tasbih.”",
      "chain": [
        "30547",
        "20204",
        "11417",
        "11201",
        "11014"
      ]
    },
    {
      "hadith_no": "1361",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا شريك، عن مغيرة، عن عامر، قال شهد عياض الأشعري عيدا بالأنبار فقال مالي لا أراكم تقلسون كما كان يقلس عند رسول الله  صلى الله عليه وسلم  ‏.‏",
      "text_en": " It wasnarrated that ‘Amir said:                      “Iyad Al-Ash’ari was in Anbar at thetime of ‘Eid, and he said: ‘Why is it that I do not see youengaged inTaqlis as was done in the presence of the Messenger ofAllah (ﷺ)?’”",
      "chain": [
        "30547",
        "20587",
        "11072",
        "11052"
      ]
    },
    {
      "hadith_no": "1365",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا علي بن مسهر، عن عبيد الله، عن نافع، عن ابن عمر، قال كان النبي  صلى الله عليه وسلم  إذا صلى يوم عيد أو غيره نصبت الحربة بين يديه فيصلي إليها والناس من خلفه ‏.‏ قال نافع فمن ثم اتخذها الأمراء ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Umar said:                      “When the Prophet (ﷺ) prayedonthe day of ‘Eid or on another occasion, a small spear was set up infront of him, and he prayed facing it, and the people were behindhim.”",
      "chain": [
        "30547",
        "20345",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1447",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا أبو عاصم العباداني، عن فائد بن عبد الرحمن، عن عبد الله بن أبي أوفى الأسلمي، قال خرج علينا رسول الله  صلى الله عليه وسلم  فقال ‏\"‏ من كانت له حاجة إلى الله أو إلى أحد من خلقه فليتوضأ وليصل ركعتين ثم ليقل لا إله إلا الله الحليم الكريم سبحان الله رب العرش العظيم الحمد لله رب العالمين اللهم إني أسألك موجبات رحمتك وعزائم مغفرتك والغنيمة من كل بر والسلامة من كل إثم أسألك ألا تدع لي ذنبا إلا غفرته ولا هما إلا فرجته ولا حاجة هي لك رضا إلا قضيتها لي ثم يسأل الله من أمر الدنيا والآخرة ما شاء فإنه يقدر ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Abdullah bin Abi Awfa Al-Aslami said:                      “TheMessenger of Allah (ﷺ) came out to us and said: ‘Whoever has someneed from Allah or from any of His creation, let him perform ablutionand pray two Rak’ah, then let him say: La ilahaillallahul-Halimul-Karim. Subhan-Allahi Rabbil-‘arshil-‘azim.Al-hamdu LillahiRabbil-‘Alamin. Allahumma inni as’aluka mujibatrahmatika, wa ‘aza’imamaghfiratika, wal-ghanimata min kullibarrin, was-salamata min kulliithmnin. As’aluka alla tada’a lidhanban illa ghafartahu, wa la hammanilla farrajtahu, wa la hajahhiya laka irdan illa qadaitaha li (Nonehas the right to beworshipped but Allah, the Forbearing, the MostGenerous. Glory is toAllah, the Lord of the Mighty Throne. Praise isto Allah, the Lord ofthe worlds. O Allah, I ask You for the means ofYour mercy andforgiveness, the benefit of every good deed and safetyfrom all sins.I ask You not to leave any sin of mine but You forgiveit, or anydistress but You relieve it, or any need that is pleasingto You butYou meet it). Then he should ask Allah for whatever hewants in thisworld and in the Hereafter, for it is decreed.”",
      "chain": [
        "30547",
        "24515"
      ]
    },
    {
      "hadith_no": "1483",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الله بن عامر بن زرارة، وسويد بن سعيد، قالا حدثنا علي بن مسهر، عن الأعمش، عن أبي وائل، عن عبد الله، قال صليت ذات ليلة مع رسول الله  صلى الله عليه وسلم  فلم يزل قائما حتى هممت بأمر سوء ‏.‏ قلت وما ذاك الأمر قال هممت أن أجلس وأتركه ‏.‏",
      "text_en": " It wasnarrated from Abu Wa’il that ‘Abdullah said:                      “I prayed onenight with the Messenger of Allah (ﷺ) and he kept standing until Ithought of doing something bad.” I said: “What was that?”Hesaid: “Ithought of sitting down and leaving him.”",
      "chain": [
        "30467",
        "30547",
        "20345",
        "11060",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "1565",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا علي بن مسهر، عن محمد بن إسحاق، عن محمد بن إبراهيم، عن أبي سلمة، عن أبي هريرة، قال كان رسول الله  صلى الله عليه وسلم  إذا صلى على جنازة يقول ‏\"‏ اللهم اغفر لحينا وميتنا وشاهدنا وغائبنا وصغيرنا وكبيرنا وذكرنا وأنثانا اللهم من أحييته منا فأحيه على الإسلام ومن توفيته منا فتوفه على الإيمان اللهم لا تحرمنا أجره ولا تضلنا بعده ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Hurairah said:                      “When the Messenger of Allah(ﷺ)offered the funeral prayer he would say: ‘Allahummaghfirlihayyinawa mayyitina, wa shahidina wa gha’ibina, wa saghirina wakabirina,wa dhakarina wa unthana. Allahumma man ahyaitahu minnafaahyihi‘alal-Islam, wa man tawaffaytahu minna fa tawaffahu ‘alal-iman.Allahumma la tahrimna ajrahu wa la tudillana ba’dah. [O Allah,forgive our living and our dead, those who are present and those whoare absent, our young and our old, our males and our females. OAllah,whomever of us You cause to live, let him live in Islam, andwhomeverof us You cause to die, let him die in (a state of) faith. OAllah, donot deprive us of his reward, and do not let us go astrayafterhim].’”",
      "chain": [
        "30547",
        "20345",
        "11107",
        "11213",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1633",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا عبد العزيز بن أبي حازم، عن سهيل، عن أبيه، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لأن يجلس أحدكم على جمرة تحرقه خير له من أن يجلس على قبر ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah said:                      The Messenger of Allah (ﷺ)said:“If one of you were to sit on a live coal that burns him, thatwould be better for him than if he were to sit on a grave.”",
      "chain": [
        "30547",
        "20165",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "1657",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا يحيى بن سليم، عن ابن خثيم، عن شهر بن حوشب، عن أسماء بنت يزيد، قالت لما توفي ابن رسول الله  صلى الله عليه وسلم  إبراهيم بكى رسول الله  صلى الله عليه وسلم  فقال له المعزي - إما أبو بكر وإما عمر - أنت أحق من عظم الله حقه ‏.‏ قال رسول الله  صلى الله عليه وسلم  ‏\"‏ تدمع العين ويحزن القلب ولا نقول ما يسخط الرب لولا أنه وعد صادق وموعود جامع وأن الآخر تابع للأول لوجدنا عليك يا إبراهيم أفضل مما وجدنا وإنا بك لمحزونون ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Asma’ bint Yazid said:                      “When Ibrahim, the son ofthe Messenger of Allah (ﷺ), died, the Messenger of Allah (ﷺ)wept.The one who was consoling him, either Abu Bakr or ‘Umar, saidto him:‘You are indeed the best of those who glorify Allah withwhat is dueto him.’ The Messenger of Allah (ﷺ) said: ‘The eyeweeps and theheart grieves, but we do not say anything that angersthe Lord. Wereit not that death is something that inevitably comesto all, and thatthe latter will surely join the former, then wewould have been morethan we are, verily we grieve for you.’”",
      "chain": [
        "30547",
        "20204",
        "11044",
        "84"
      ]
    },
    {
      "hadith_no": "1869",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters Regarding Zakat - كتاب الزكاة",
      "chapter_no": "8",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا الوليد بن مسلم، عن البختري بن عبيد، عن أبيه، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إذا أعطيتم الزكاة فلا تنسوا ثوابها أن تقولوا اللهم اجعلها مغنما ولا تجعلها مغرما ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah narrated that  :                     the Messenger of Allah(ﷺ) said: “When you give Zakat, do not forget its reward, and say 'Allahummaj-'alha maghnaman wa la taj-'alha maghrama (O Allah! Make it a gain and do not make it a loss).' ” (Maudu')",
      "chain": [
        "30547",
        "20733",
        "27006",
        "13"
      ]
    },
    {
      "hadith_no": "1950",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا علي بن مسهر، حدثنا هشام بن عروة، عن أبيه، عن عائشة، قالت تزوجني رسول الله  صلى الله عليه وسلم  وأنا بنت ست سنين فقدمنا المدينة فنزلنا في بني الحارث بن الخزرج فوعكت فتمرق شعري حتى وفى له جميمة فأتتني أمي أم رومان وإني لفي أرجوحة ومعي صواحبات لي فصرخت بي فأتيتها وما أدري ما تريد فأخذت بيدي فأوقفتني على باب الدار وإني لأنهج حتى سكن بعض نفسي ثم أخذت شيئا من ماء فمسحت به على وجهي ورأسي ثم أدخلتني الدار فإذا نسوة من الأنصار في بيت فقلن على الخير والبركة وعلى خير طائر ‏.‏ فأسلمتني إليهن فأصلحن من شأني فلم يرعني إلا رسول الله  صلى الله عليه وسلم  ضحى ‏.‏ فأسلمتني إليه وأنا يومئذ بنت تسع سنين ‏.‏",
      "text_en": " It was narrated that:                     Aishah said: “The Messenger of Allah married me when I was six years old. Then we came to Al-Madinah and settled among Banu Harith bin Khazraj. I became ill and my hair fell out, then it grew back and became abundant. My mother Umm Ruman came to me while I was on an Urjuhah with some of my friends, and called for me. I went to her, and I did not know what she wanted. She took me by the hand and made me stand at the door of the house, and I was panting. When I got my breath back, she took some water and wiped my face and head, and led me into the house. There were some woman of the Ansar inside the house, and they said: 'With blessings and good fortune (from Allah).' (My mother) handed me over to them and they tidied me up. And suddenly I saw the Messenger of Allah in the morning. And she handed me over to him and I was at that time, nine years old.”",
      "chain": [
        "30547",
        "20345",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1957",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا مالك بن أنس، عن نافع، عن ابن عمر، قال نهى رسول الله  صلى الله عليه وسلم  عن الشغار والشغار أن يقول الرجل للرجل زوجني ابنتك أو أختك على أن أزوجك ابنتي أو أختي ‏.‏ وليس بينهما صداق ‏.‏",
      "text_en": " It was narrated that:                     Ibn Umar said: “The Messenger of Allah forbade Shighar. Shighar is when a man says to another man: 'Marry your daughter or sister to me, on condition that I will marry my daughter or sister to you,' and they do not give any dower (i.e. neither of them give other the dower).”",
      "chain": [
        "30547",
        "20001",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1980",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا عبد العزيز بن محمد الدراوردي، عن سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، أن النبي  صلى الله عليه وسلم  كان إذا رفأ قال ‏\"‏ بارك الله لكم وبارك عليكم وجمع بينكما في خير ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah:                     that the Prophet used to say, when offering congratulations of the occasion of marriage: “Barak Allahu lakum, wa barak 'alaikum, wa jama'a bainakuma fi khair (May Allah bless you and bestow blessings upon you,  and bring you together in harmony).”",
      "chain": [
        "30547",
        "20167",
        "11173",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "1986",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا المفضل بن عبد الله، عن جابر، عن الشعبي، عن مسروق، عن عائشة، وأم سلمة قالتا أمرنا رسول الله  صلى الله عليه وسلم  أن نجهز فاطمة حتى ندخلها على علي فعمدنا إلى البيت ففرشناه ترابا لينا من أعراض البطحاء ثم حشونا مرفقتين ليفا فنفشناه بأيدينا ثم أطعمنا تمرا وزبيبا وسقينا ماء عذبا وعمدنا إلى عود فعرضناه في جانب البيت ليلقى عليه الثوب ويعلق عليه السقاء فما رأينا عرسا أحسن من عرس فاطمة ‏.‏",
      "text_en": " It was narrated that 'Aishah and Umm Salamah said:                     “The Messenger of Allah commanded us to prepare Fatimah (for her wedding) taken her in to 'Ali. We went to the house and sprinkled it with soft earth from the land of Batha'. Then we stuffed two pillows with (date - palm) fiber which we picked with our own hands. Then we offered dates and raisins to eat, and sweet water to drink. We went and got some wood and set it up at the side of room, to hang the clothes and water skins on. And we never saw any wedding better than the wedding of Fatimah.”",
      "chain": [
        "30547",
        "34",
        "11052",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "2094",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Divorce - كتاب الطلاق",
      "chapter_no": "10",
      "text_ar": "حدثنا سويد بن سعيد، وعبد الله بن عامر بن زرارة، ومسروق بن المرزبان، قالوا حدثنا يحيى بن زكريا بن أبي زائدة، عن صالح بن صالح بن حى، عن سلمة بن كهيل، عن سعيد بن جبير، عن ابن عباس، عن عمر بن الخطاب، ‏.‏ أن رسول الله  صلى الله عليه وسلم  طلق حفصة ثم راجعها ‏.‏",
      "text_en": " It was narrated from 'Umar bin Khattab that:                     the Messenger of Allah divorced Hafsah then took her back.",
      "chain": [
        "30547",
        "30467",
        "20366",
        "11350",
        "11050",
        "17",
        "3"
      ]
    },
    {
      "hadith_no": "2138",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Divorce - كتاب الطلاق",
      "chapter_no": "10",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا يحيى بن زكريا بن أبي زائدة، عن حارثة بن محمد، عن عمرة، عن عائشة، أن رسول الله  صلى الله عليه وسلم  إنما آلى لأن زينب ردت عليه هديته ‏.‏ فقالت عائشة لقد أقمأتك ‏.‏ فغضب  صلى الله عليه وسلم  فآلى منهن ‏.‏",
      "text_en": " It was narrated from Aishah that:                     the Messenger of Allah (ﷺ) swore to keep away from his wives, because Zainab had sent back her gift and 'Aishah said: \"She has disgraced you.\" He became angry and swore to keep away from them.",
      "chain": [
        "30547",
        "20366",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "2232",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا عمرو بن يحيى بن سعيد القرشي، عن جده، سعيد بن أبي أحيحة عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ ما بعث الله نبيا إلا راعي غنم ‏\"‏ ‏.‏ قال له أصحابه وأنت يا رسول الله ‏.‏ قال ‏\"‏ وأنا كنت أرعاها لأهل مكة بالقراريط ‏\"‏ ‏.‏ قال سويد يعني كل شاة بقيراط ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:                     \"Allah has not sent any Prophet but he was a shepherd.\" His Companions said to him: \"Even you, O Messenger of Allah?\" He said: \"Even me I used to tend the sheep of the people of Makkah for a few Qirats.\" (Sahih)(One of the narrators) Suwaid said: \" Meaning one Qirat for every sheep.\"",
      "chain": [
        "30547",
        "11210",
        "13"
      ]
    },
    {
      "hadith_no": "2255",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا مالك بن أنس، عن نافع، عن ابن عمر، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ لا يبيع بعضكم على بيع بعض ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that the Messenger of Allah (ﷺ) said:                     \"Let one of you not undersell another.\"[1]",
      "chain": [
        "30547",
        "20001",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2311",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا مالك بن أنس، عن نافع، عن ابن عمر، أن النبي  صلى الله عليه وسلم  قال ‏\"‏ من ابتاع طعاما فلا يبعه حتى يستوفيه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that the Prophet (ﷺ) said:                     \"Whoever buys food, let him not sell it until he has taken full possession of it.\"",
      "chain": [
        "30547",
        "20001",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2349",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وسويد بن سعيد، وهارون بن إسحاق، قالوا أنبأنا المعتمر بن سليمان، عن محمد بن فضاء، عن أبيه، عن علقمة بن عبد الله، عن أبيه، قال نهى رسول الله  صلى الله عليه وسلم  عن كسر سكة المسلمين الجائزة بينهم إلا من بأس ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Alqamah bin 'Abdullah that his father said:                     \"The Messenger of Allah (ﷺ) forbade breaking the coins of the Muslims that are in circulation among them, without any necessary reason.”(1)",
      "chain": [
        "30201",
        "30547",
        "35158",
        "20288",
        "14347",
        "19855"
      ]
    },
    {
      "hadith_no": "2373",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Rulings - كتاب الأحكام",
      "chapter_no": "13",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا محمد بن الفرات، عن محارب بن دثار، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏{‏لن تزول قدم شاهد الزور حتى يوجب الله له النار‏}‏‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that the Messenger of Allah (ﷺ) said:                     'The one who bears false witness will not move away (on the Day of Resurrection) until Allah condemns him to Hell.' ”",
      "chain": [
        "30547",
        "25272",
        "11389",
        "18"
      ]
    },
    {
      "hadith_no": "2536",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Pawning - كتاب الرهون",
      "chapter_no": "16",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا يحيى بن سليم، عن إسماعيل بن أمية، عن سعيد بن أبي سعيد المقبري، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ثلاثة أنا خصمهم يوم القيامة ومن كنت خصمه خصمته يوم القيامة رجل أعطى بي ثم غدر ورجل باع حرا فأكل ثمنه ورجل استأجر أجيرا فاستوفى منه ولم يوفه أجره ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:                     (Allah (SWT) says:) “I am the opponent of three on the Day of Resurrection, and if I am someone's opponent I will defeat him: A man who makes promises in My Name, then proves treacherous; a man who sells a free man and consumes his price; and a man who hires a worker, makes use to him, then does not give him his wages.”",
      "chain": [
        "30547",
        "20204",
        "11417",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "2597",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Pre-emption - كتاب الشفعة",
      "chapter_no": "17",
      "text_ar": "حدثنا سويد بن سعيد، قال حدثنا محمد بن الحارث، عن محمد بن عبد الرحمن بن البيلماني، عن أبيه، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا شفعة لشريك على شريك إذا سبقه بالشراء ولا لصغير ولا لغائب ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that the Messenger of Allah (ﷺ) said:                     “There is no preemption for a partner when his co-partner has beaten him to it (in another deal before), not for a minor nor one who is absent.”",
      "chain": [
        "30547",
        "28526",
        "18"
      ]
    },
    {
      "hadith_no": "2697",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا علي بن مسهر، ح وحدثنا الحسن بن عرفة، حدثنا أبو حفص الأبار، جميعا عن إسماعيل بن مسلم، عن عمرو بن دينار، عن طاوس، عن ابن عباس، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا تقام الحدود في المساجد ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn Abbas that the Messenger of Allah (ﷺ) said:                     “Do not carry out the legal punishment in the mosque.”",
      "chain": [
        "30547",
        "20345",
        "36540",
        "25208",
        "22025",
        "11081",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "2763",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا علي بن مسهر، عن إسماعيل بن مسلم، عن عمرو بن دينار، عن طاوس، عن ابن عباس، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يقتل بالولد الوالد ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that the Messenger of Allah (ﷺ) said:                     “A father should not be killed for his son.”",
      "chain": [
        "30547",
        "20345",
        "22025",
        "11081",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "2807",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Wills - كتاب الوصايا",
      "chapter_no": "22",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا عبد الرحيم بن زيد العمي، عن أبيه، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من فر من ميراث وارثه قطع الله ميراثه من الجنة يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Anas bin Malik that the Messenger of Allah (ﷺ) said:                     “Whoever tries to avoid giving the inheritance to his heirs, Allah (SWT) will deprive him of his inheritance in Paradise on the Day of Resurrection.”",
      "chain": [
        "30547",
        "24258",
        "19"
      ]
    },
    {
      "hadith_no": "2828",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Shares of Inheritance - كتاب الفرائض",
      "chapter_no": "23",
      "text_ar": "حدثنا أحمد بن عمرو بن السرح المصري، أنبأنا عبد الله بن وهب، أنبأنا يونس، عن ابن شهاب، حدثه عن قبيصة بن ذؤيب، ح وحدثنا سويد بن سعيد، حدثنا مالك بن أنس، عن ابن شهاب، عن عثمان بن إسحاق بن خرشة، عن ابن ذؤيب، قال جاءت الجدة إلى أبي بكر الصديق تسأله ميراثها فقال لها أبو بكر ما لك في كتاب الله شىء وما علمت لك في سنة رسول الله صلى الله عليه وسلم شيئا فارجعي حتى أسأل الناس ‏.‏ فسأل الناس فقال المغيرة بن شعبة حضرت رسول الله صلى الله عليه وسلم أعطاها السدس فقال أبو بكر هل معك غيرك فقام محمد بن مسلمة الأنصاري فقال مثل ما قال المغيرة بن شعبة فأنفذه لها أبو بكر ‏.‏ ثم جاءت الجدة الأخرى من قبل الأب إلى عمر تسأله ميراثها فقال ما لك في كتاب الله شىء وما كان القضاء الذي قضي به إلا لغيرك وما أنا بزائد في الفرائض شيئا ولكن هو ذاك السدس فإن اجتمعتما فيه فهو بينكما وأيتكما خلت به فهو لها ‏.‏",
      "text_en": " It wasnarrated that Ibn Dhu’aib said:                      “A grandmother came to Abu BakrSiddiq and asked him for her inheritance. Abu Bakr said to her: ‘Youhave nothing according to the Book of Allah, and I don’t know ofanything for you according to the Book of Allah, and I don’t knowof anything for you according to the Sunnah of the Messenger of Allah(ﷺ). Go back until I ask the people.’ So he asked the people andAl-Mughirah bin Shu’bah said: ‘I was present with the Messengerof Allah (ﷺ) and he gave her (the grandmother) one sixth.’ AbuBakr said: ‘Is there anyone else with you (who will corroboratewhat you say)?’ Muhammad bin Maslamah Al-Ansari stood up and saidsomething like what Mughirah bin Shu’bah had said. So Abu Bakrapplied it in her case.”",
      "chain": [
        "20029",
        "20475",
        "11013",
        "30547",
        "20001",
        "11013",
        "19815"
      ]
    },
    {
      "hadith_no": "2912",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا هشام بن عمار، وسويد بن سعيد، قالا حدثنا مالك بن أنس، حدثني الزهري، عن أنس بن مالك، أن النبي صلى الله عليه وسلم دخل مكة يوم الفتح وعلى رأسه المغفر ‏.‏",
      "text_en": " It wasnarrated from Anas bin Malik that the Prophet (ﷺ) enteredMakkah onthe day of the Conquest, with a helmet on his head.",
      "chain": [
        "30288",
        "30547",
        "20001",
        "11013",
        "19"
      ]
    },
    {
      "hadith_no": "2974",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن رمح، أنبأنا الليث بن سعد، عن عبيد الله بن عمر، عن نافع، عن ابن عمر، ح وحدثنا محمد بن الصباح، وسويد بن سعيد، قالا حدثنا عبد الله بن رجاء المكي، عن عبيد الله، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ على المرء المسلم الطاعة فيما أحب أو كره إلا أن يؤمر بمعصية فمن أمر بمعصية فلا سمع ولا طاعة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Umar that the Messenger of Allah (ﷺ)said:                     “The Muslim is obliged to obey (the ruler) whether he likes itornot, unless he is commanded to commit an act of disobedience. If heis commanded to commit a sin then he should neither listen nor obey.”",
      "chain": [
        "30490",
        "20023",
        "11201",
        "11014",
        "18",
        "30269",
        "30547",
        "23027",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2975",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا يحيى بن سليم، ح وحدثنا هشام بن عمار، حدثنا إسماعيل بن عياش، قالا حدثنا عبد الله بن عثمان بن خثيم، عن القاسم بن عبد الرحمن بن عبد الله بن مسعود، عن أبيه، عن جده عبد الله بن مسعود، أن النبي صلى الله عليه وسلم قال ‏\"‏ سيلي أموركم بعدي رجال يطفئون السنة ويعملون بالبدعة ويؤخرون الصلاة عن مواقيتها ‏\"‏ فقلت يا رسول الله إن أدركتهم كيف أفعل قال ‏\"‏ تسألني يا ابن أم عبد كيف تفعل لا طاعة لمن عصى الله ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Abdullah bin Mas’ud that the Prophet (ﷺ)said:                     “Among those in charge of you, after I am gone, will be men whoextinguish the Sunnah and follow innovation. They will delay theprayer from its proper time.” I said: “O Messenger of Allah, if Iliveto see them, what should I do?” He said: “You ask me, O Ibn‘Abd, whatyou should do? There is no obedience to one who disobeysAllah.”",
      "chain": [
        "30547",
        "20204",
        "30288",
        "20736",
        "10644",
        "11648",
        "11363",
        "16"
      ]
    },
    {
      "hadith_no": "3009",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا هشام بن سليمان القرشي، عن ابن جريج، قال وأخبرنيه أيضا، عن ابن عطاء، عن عكرمة، عن ابن عباس، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ الزاد والراحلة ‏\"‏ ‏.‏ يعني قوله ‏{‏ من استطاع إليه سبيلا ‏}‏ ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Abbas that the Messenger of Allah (ﷺ)said:                     “Provision and a mount,” meaning, about Allah’s saying:“Whoevercan bear the way.” [3:97]",
      "chain": [
        "30547",
        "11070",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "3057",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا عبد الرحيم الرازي، عن ابن خثيم، عن سعيد بن جبير، قال سمعت ابن عباس، يقول قال رسول الله  صلى الله عليه وسلم  ‏\"‏ ليأتين هذا الحجر يوم القيامة وله عينان يبصر بهما ولسان ينطق به يشهد على من يستلمه بحق ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Sa’eed bin Jubair said:                      I heard Ibn ‘Abbas say:TheMessenger of Allah (ﷺ) said: “This Stone will be brought on theDay of Resurrection, and it will be given two eyes with which to see,and a tongue with which to speak, and it will bear witness for thosewho touched it in sincerity.”",
      "chain": [
        "30547",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "3149",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا علي بن مسهر، عن الحجاج، عن الحكم بن عتيبة، عن مقسم، عن ابن عباس، قال كان رسول الله  صلى الله عليه وسلم  إذا رمى جمرة العقبة مضى ولم يقف ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “When the Messenger of Allah(ﷺ)had stoned ‘Aqabah Pillar, he would continue on, and would notstaythere.”",
      "chain": [
        "30547",
        "20345",
        "20381",
        "11069",
        "11725",
        "17"
      ]
    },
    {
      "hadith_no": "3310",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Slaughtering - كتاب الذبائح",
      "chapter_no": "27",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا ابن أبي زائدة، عن محمد بن إسحاق، عن ابن أبي نجيح، عن مجاهد، عن ابن عمر، قال نهى رسول الله  صلى الله عليه وسلم  عن لحوم الجلالة وألبانها ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Umar said:                      “The Messenger of Allah (ﷺ)forbade the meat and milk of Al-Jallalah.”*",
      "chain": [
        "30547",
        "20366",
        "11107",
        "11254",
        "11028",
        "18"
      ]
    },
    {
      "hadith_no": "3313",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Slaughtering - كتاب الذبائح",
      "chapter_no": "27",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا علي بن مسهر، عن أبي إسحاق الشيباني، قال سألت عبد الله بن أبي أوفى عن لحوم الحمر الأهلية، فقال أصابتنا مجاعة يوم خيبر ونحن مع النبي  صلى الله عليه وسلم  وقد أصاب القوم حمرا خارجا من المدينة فنحرناها وإن قدورنا لتغلي إذ نادى منادي النبي  صلى الله عليه وسلم  أن اكفئوا القدور ولا تطعموا من لحوم الحمر شيئا ‏.‏ فأكفأناها ‏.‏ فقلت لعبد الله بن أبي أوفى حرمها تحريما قال تحدثنا أنما حرمها رسول الله  صلى الله عليه وسلم  ألبتة من أجل أنها تأكل العذرة ‏.‏",
      "text_en": " It wasnarrated that Abu Ishaq Shaibani said:                      “I asked ‘Abdullah binAbuAwfa about the flesh of domesticated donkeys and he said: ‘We werestarving on the Day of Khaibar, when we were with the Prophet (ﷺ).The people had gotten some donkeys as spoils of war on the way outfrom Al-Madinah, so we slaughtered them and our cooking pots wereboiling when the caller of the Messenger of Allah (ﷺ) cried out,telling us to overturn out pots and not to eat anything of the fleshof donkeys. So we overturned them.’ I said to ‘Abdullah bin AbuAwfa:‘Was it made unlawful?’ He said: ‘We think that theMessenger of Allah(ﷺ) forbade it altogether because it eatsexcrement.’”",
      "chain": [
        "30547",
        "20345",
        "11352",
        "5115"
      ]
    },
    {
      "hadith_no": "3315",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Slaughtering - كتاب الذبائح",
      "chapter_no": "27",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا علي بن مسهر، عن عاصم، عن الشعبي، عن البراء بن عازب، قال أمرنا رسول الله  صلى الله عليه وسلم  أن نلقي لحوم الحمر الأهلية نيئة ونضيجة ثم لم يأمرنا به بعد ‏.‏",
      "text_en": " It wasnarrated that Bara’ bin ‘Azib said:                      “The Messenger of Allah(ﷺ) commanded us to throw away the meat of domesticated donkeys,rawor cooked, then he did not say anything to us about it afterthat.”",
      "chain": [
        "30547",
        "20345",
        "11080",
        "11052",
        "400"
      ]
    },
    {
      "hadith_no": "3323",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hunting - كتاب الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا سويد بن سعيد، أنبأنا مالك بن أنس، عن نافع، عن ابن عمر، قال أمر رسول الله  صلى الله عليه وسلم  بقتل الكلاب ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Umar said:                      “The Messenger of Allah (ﷺ)commanded that dogs be killed.”",
      "chain": [
        "30547",
        "20001",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3403",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا يزيد بن زريع، عن يونس، عن الحسن، عن معقل بن يسار، قال بينما هو يتغدى إذ سقطت منه لقمة فتناولها فأماط ما كان فيها من أذى فأكلها فتغامز به الدهاقين فقيل أصلح الله الأمير إن هؤلاء الدهاقين يتغامزون من أخذك اللقمة وبين يديك هذا الطعام ‏.‏ قال إني لم أكن لأدع ما سمعت من رسول الله  صلى الله عليه وسلم  لهذه الأعاجم إنا كنا نأمر أحدنا إذا سقطت لقمته أن يأخذها فيميط ما كان فيها من أذى ويأكلها ولا يدعها للشيطان ‏.‏",
      "text_en": " It wasnarrated from Hasan about Ma’qil bin Yasar:                      “While (he) waseating lunch, a morsel of food fell on the floor. He picked it up,removed whatever dirt had gotten onto it, and ate it. The villagersand farmers winked at one another (finding it odd) and it was said:‘May Allah help the chief! These villagers and farmers are winkingatone another because you picked up a morsel (from the ground) whenyouhave this food in front of you.’ He said: ‘I am not going togive upsomething I heard from the Messenger of Allah (ﷺ) for thesenon-Arabs. We were told, if one of us dropped a morsel of food, topick itup, remove whatever dirt was on it, and eat it, and not toleave itfor Satan.’”",
      "chain": [
        "30547",
        "20304",
        "20475",
        "11016",
        "3120"
      ]
    },
    {
      "hadith_no": "3460",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا محمد بن الصباح، وسويد بن سعيد، قالا حدثنا عبد العزيز بن أبي حازم، حدثني أبي قال، سألت سهل بن سعد هل رأيت النقي قال ما رأيت النقي حتى قبض رسول الله  صلى الله عليه وسلم  ‏.‏ فقلت فهل كان لهم مناخل على عهد رسول الله  صلى الله عليه وسلم  قال ما رأيت منخلا حتى قبض رسول الله  صلى الله عليه وسلم  ‏.‏ قلت فكيف كنتم تأكلون الشعير غير منخول قال نعم ننفخه فيطير منه ما طار وما بقي ثريناه ‏.‏",
      "text_en": " ‘Abdul-‘Aziz bin Abu Hazim said:                      My father told me: I asked SahlbinSa’d: “Did you ever see dough made from well-sifted flour?”He said:“I never saw dough made from well-sifted flour until theMessenger ofAllah (ﷺ) passed away.” I said: “Did they havesieves at the time ofthe Messenger of Allah (ﷺ)?” He said: “Inever saw a sieve until theMessenger of Allah (ﷺ) passed away.”I said: “How did you eat barleythat was not sifted?” He said:“We used to blow on it, and whateverflew away, flew away, andwhatever was left we made dough with it.”",
      "chain": [
        "30269",
        "30547",
        "20165",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "3477",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا هشام بن عمار، وسويد بن سعيد، ويحيى بن عثمان بن سعيد بن كثير بن دينار الحمصي، قالوا حدثنا بقية بن الوليد، حدثنا يوسف بن أبي كثير، عن نوح بن ذكوان، عن الحسن، عن أنس بن مالك، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن من السرف أن تأكل كل ما اشتهيت ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Anas bin Malik that the Messenger of Allah (ﷺ)said:                     “It is extravagance to eat everything you want.”",
      "chain": [
        "30288",
        "30547",
        "38705",
        "20644",
        "11016",
        "19"
      ]
    },
    {
      "hadith_no": "3533",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Drinks - كتاب الأشربة",
      "chapter_no": "30",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا المعتمر بن سليمان، عن أبيه، حدثتني رميثة، عن عائشة، أنها قالت أتعجز إحداكن أن تتخذ كل عام من جلد أضحيتها سقاء ثم قالت نهى رسول الله  صلى الله عليه وسلم  أن ينبذ في الجر وفي كذا وفي كذا إلا الخل ‏.‏",
      "text_en": " It wasnarrated that ‘Aishah said:                      “Is anyone of you incapable oftakinga water skin from the skin of her sacrifice each year?” Thenshesaid: “The Messenger of Allah (ﷺ) forbade making Nabidh in(earthenware) jars, and in such and such, and such and such, exceptfor vinegar.”",
      "chain": [
        "30547",
        "20288",
        "11289",
        "53"
      ]
    },
    {
      "hadith_no": "3548",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Drinks - كتاب الأشربة",
      "chapter_no": "30",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا علي بن مسهر، عن عاصم، عن الشعبي، عن ابن عباس، قال سقيت النبي  صلى الله عليه وسلم  من زمزم فشرب قائما ‏.‏ فذكرت ذلك لعكرمة فحلف بالله ما فعل ‏.‏",
      "text_en": " ‘Asimnarrated from Sha’bi, from Ibn ‘Abbas who said:                      “I drew waterfrom Zamzam for the Prophet (ﷺ) and he drank standing up.”",
      "chain": [
        "30547",
        "20345",
        "11080",
        "11052",
        "17"
      ]
    },
    {
      "hadith_no": "3560",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Drinks - كتاب الأشربة",
      "chapter_no": "30",
      "text_ar": "حدثنا أحمد بن عبدة، وسويد بن سعيد، قالا حدثنا حماد بن زيد، عن ثابت البناني، عن عبد الله بن رباح، عن أبي قتادة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ ساقي القوم آخرهم شربا ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Qatadah that the Messenger of Allah (ﷺ) said:                     “The oen who serves water to others should be the last one to drinkfrom it.”",
      "chain": [
        "30423",
        "30547",
        "20022",
        "11269",
        "11865",
        "391"
      ]
    },
    {
      "hadith_no": "3611",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا علي بن مسهر، عن سعد الإسكاف، عن الأصبغ بن نباتة، عن علي، قال نزل جبريل على النبي  صلى الله عليه وسلم  بحجامة الأخدعين والكاهل ‏.‏",
      "text_en": " It wasnarrated that ‘Ali said:                      “Jibra’il came down to the Prophet(ﷺ) with (the recommendation of) cupping in the two veins at theside of the neck and the base of the neck.”",
      "chain": [
        "30547",
        "20345",
        "15020",
        "5"
      ]
    },
    {
      "hadith_no": "3615",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا عثمان بن مطر، عن زكريا بن ميسرة، عن النهاس بن قهم، عن أنس بن مالك، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ من أراد الحجامة فليتحر سبعة عشر أو تسعة عشر أو إحدى وعشرين ولا يتبيغ بأحدكم الدم فيقتله ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Anas bin Malik that the Messenger of Allah (ﷺ)said:                     “Whoever wants to be cupped, let him seek out the seventeenth,nineteenth or twenty-first (of the month); and let none of you allowhis blood to rage so that it kills him.”",
      "chain": [
        "30547",
        "24311",
        "14398",
        "19"
      ]
    },
    {
      "hadith_no": "3616",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا عثمان بن مطر، عن الحسن بن أبي جعفر، عن محمد بن جحادة، عن نافع، عن ابن عمر، قال يا نافع قد تبيغ بي الدم فالتمس لي حجاما واجعله رفيقا إن استطعت ولا تجعله شيخا كبيرا ولا صبيا صغيرا فإني سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ الحجامة على الريق أمثل وفيه شفاء وبركة وتزيد في العقل وفي الحفظ فاحتجموا على بركة الله يوم الخميس واجتنبوا الحجامة يوم الأربعاء والجمعة والسبت ويوم الأحد تحريا واحتجموا يوم الاثنين والثلاثاء فإنه اليوم الذي عافى الله فيه أيوب من البلاء وضربه بالبلاء يوم الأربعاء فإنه لا يبدو جذام ولا برص إلا يوم الأربعاء أو ليلة الأربعاء ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Umar said:                      “O Nafi’! The blood is boilinginme, find me a cupper, but let it be someone gentle if you can, notanold man or a young boy. For I heard the Messenger of Allah (ﷺ)say:‘Cupping on an empty stomach is better, and in it there ishealingand blessing, and it increases one’s intellect and memory. Sohaveyourselves cupped for the blessing of Allah on Thursdays, andavoidcupping on Wednesdays, Fridays, Saturdays and Sundays. Haveyourselves cupped on Mondays and Tuesdays, for that is the day onwhich Allah relieved Ayyub of Calamity, and He inflicted calamityuponhim on a Wednesday, and leprosy and leucoderma only appear onWednesdays, or on the night of Wednesday.”",
      "chain": [
        "30547",
        "24311",
        "24081",
        "18897",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3634",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا مسلم بن خالد، عن عتبة بن مسلم، عن عبيد بن حنين، عن أبي هريرة، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ إذا وقع الذباب في شرابكم فليغمسه فيه ثم ليطرحه فإن في أحد جناحيه داء وفي الآخر شفاء ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Prophet (ﷺ) said:                      “If aflyfalls into your drink, dip it into it then throw it away, for ononeof its wings is a disease and on the other is a cure.”",
      "chain": [
        "30547",
        "23063",
        "11522",
        "11202",
        "13"
      ]
    },
    {
      "hadith_no": "3694",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا موسى بن الفضل، عن شعبة، عن هشام بن زيد، عن أنس بن مالك، قال رأيت رسول الله  صلى الله عليه وسلم  يسم غنما في آذانها ورأيته متزرا بكساء ‏.‏",
      "text_en": " It wasnarrated that Anas bin Malik said:                      “I saw the Messenger ofAllah(ﷺ) marking sheep on their ears, and I saw him wearing a cloakaround his wrist.”",
      "chain": [
        "30547",
        "20020",
        "11228",
        "19"
      ]
    },
    {
      "hadith_no": "4062",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا علي بن مسهر، عن الأعمش، عن أبي سفيان، عن جابر، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ أمرت أن أقاتل الناس حتى يقولوا لا إله إلا الله فإذا قالوا لا إله إلا الله عصموا مني دماءهم وأموالهم إلا بحقها وحسابهم على الله ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Jabir that the Messenger of Allah (ﷺ) said:                      “Ihave been commanded to fight the people until they say: La ilahaillallah. If they say: La ilaha illallah, then their blood and wealthare protected from me, except for a right that is due from it, andtheir reckoning will be with Allah.”",
      "chain": [
        "30547",
        "20345",
        "11060",
        "11249",
        "34"
      ]
    },
    {
      "hadith_no": "4064",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا علي بن مسهر، عن عاصم، عن السميط بن السمير، عن عمران بن الحصين، قال أتى نافع بن الأزرق وأصحابه فقالوا هلكت يا عمران ‏.‏ قال ما هلكت ‏.‏ قالوا بلى ‏.‏ قال ما الذي أهلكني قالوا قال الله ‏{وقاتلوهم حتى لا تكون فتنة ويكون الدين كله لله}‏ ‏.‏ قال قد قاتلناهم حتى نفيناهم فكان الدين كله لله إن شئتم حدثتكم حديثا سمعته من رسول الله  صلى الله عليه وسلم  ‏.‏ قالوا وأنت سمعته من رسول الله  صلى الله عليه وسلم  ‏.‏ قال نعم شهدت رسول الله  صلى الله عليه وسلم  وقد بعث جيشا من المسلمين إلى المشركين فلما لقوهم قاتلوهم قتالا شديدا فمنحوهم أكتافهم فحمل رجل من لحمتي على رجل من المشركين بالرمح فلما غشيه قال أشهد أن لا إله إلا الله إني مسلم فطعنه فقتله فأتى رسول الله  صلى الله عليه وسلم  فقال يا رسول الله هلكت قال ‏\"‏ وما الذي صنعت ‏\"‏ ‏.‏ مرة أو مرتين فأخبره بالذي صنع فقال له رسول الله  صلى الله عليه وسلم  ‏\"‏ فهلا شققت عن بطنه فعلمت ما في قلبه ‏\"‏ ‏.‏ قال يا رسول الله لو شققت بطنه أكنت أعلم ما في قلبه قال ‏\"‏ فلا أنت قبلت ما تكلم به ولا أنت تعلم ما في قلبه ‏\"‏ ‏.‏ قال فسكت عنه رسول الله  صلى الله عليه وسلم  فلم يلبث إلا يسيرا حتى مات فدفناه فأصبح على ظهر الأرض فقالوا لعل عدوا نبشه فدفناه ثم أمرنا غلماننا يحرسونه فأصبح على ظهر الأرض فقلنا لعل الغلمان نعسوا فدفناه ثم حرسناه بأنفسنا فأصبح على ظهر الأرض فألقيناه في بعض تلك الشعاب ‏.‏",
      "text_en": " It was narrated from Sumait bin Sumair, that ‘Imran bin Husainsaid:                      “Nafi’ bin Azraq and his companions came and said: ‘Youare doomed, O ‘Imran!’ He (‘Imran) said: ‘I am not doomed.’They said: ‘Yes you are.’ I said: ‘Why am I doomed?’ Theysaid: ‘Allah says: “And fight them until there is no more Fitnah(disbelief and polytheism, i.e., worshipping others besides Allah),and the religion (worship) will be all for Allah Alone.”[8:39] Hesaid: ‘We fought them until they were defeated and the religion wasall for Allah Alone. If you wish, I will tell you a Hadith that Iheard from the Messenger of Allah (ﷺ).’ They said: ‘Did you(really) hear it from the Messenger of Allah (ﷺ)?’ He said: ‘Yes.I was with the Messenger of Allah (ﷺ) and he had sent an army ofthe Muslims to the idolaters. When they met them they fought themfiercely, and they (the idolaters) gave them their shoulders (i.e.,turned and fled). A man among my kin attacked an idolator man with aspear, and when he was defeated he said: “I bear witness that nonehas the right to be worshipped but Allah, I am a Muslim.” But hestabbed him and killed him. He came to the Messenger of Allah (ﷺ)and said: “O Messenger of Allah, I am doomed.” He said “What isit that you have done?” one or two times. He told him what he haddone and the Messenger of Allah (ﷺ) said to him: “Why didn’tyou cut open his belly and find out what was in his heart?” Hesaid: “O Messenger of Allah, I wish I had cut open his belly andcould have known what was in his heart.” He said: “You did notaccept what he said, and you could not have known what was in hisheart!” The Messenger of Allah (ﷺ) remained silent concerning him(that man), and a short while later he died. We buried him, but thefollowing morning he was on the surface of the earth. They said:“Perhaps an enemy of his disinterred him.” So we buried him(again) and told our slaves to stand guard. But the following morninghe was on the surface of the earth again then we said: ‘Perhaps theslaves dozed off.’ So we buried him (again) and stood guardourselves, but the following morning he was on the surface of theearth (again). So we threw him into one of these mountain passes.’”",
      "chain": [
        "30547",
        "20345",
        "11080"
      ]
    },
    {
      "hadith_no": "4098",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا مبارك بن سحيم، عن عبد العزيز بن صهيب، عن أنس بن مالك، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ ما من مسلمين التقيا بأسيافهما إلا كان القاتل والمقتول في النار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Anas bin Malik that the Prophet (ﷺ) said:                     “There are no two Muslims who confront one another with theirswords,but both the killer and the slain will be in Hell.”",
      "chain": [
        "30547",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "4101",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا مروان بن معاوية، عن عبد الحكم السدوسي، حدثنا شهر بن حوشب، عن أبي أمامة، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ من شر الناس منزلة عند الله يوم القيامة عبد أذهب آخرته بدنيا غيره ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Umamah that the Messenger of Allah (ﷺ)said:                      “Among the worst people in status before Allah on the Day ofResurrection will be a person who loses his Hereafter for the sake ofthis world.”",
      "chain": [
        "30547",
        "20201",
        "11044",
        "405"
      ]
    },
    {
      "hadith_no": "4121",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا عبد الرحمن بن إبراهيم، ويعقوب بن حميد بن كاسب، وسويد بن سعيد، قالوا حدثنا مروان بن معاوية الفزاري، حدثنا يزيد بن كيسان، عن أبي حازم، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ بدأ الإسلام غريبا وسيعود غريبا فطوبى للغرباء ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                      “Islam began as something strange and will go back to beingstrange, so glad tidings to the strangers.’”",
      "chain": [
        "30285",
        "32048",
        "30547",
        "20201",
        "10845",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "4146",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا يحيى بن سليم، عن عبد الله بن عثمان بن خثيم، عن أبي الزبير، عن جابر، قال لما رجعت إلى رسول الله  صلى الله عليه وسلم  مهاجرة البحر قال ‏\"‏ ألا تحدثوني بأعاجيب ما رأيتم بأرض الحبشة ‏\"‏ ‏.‏ قال فتية منهم بلى يا رسول الله بينا نحن جلوس مرت بنا عجوز من عجائز رهابينهم تحمل على رأسها قلة من ماء فمرت بفتى منهم فجعل إحدى يديه بين كتفيها ثم دفعها فخرت على ركبتيها فانكسرت قلتها فلما ارتفعت التفتت إليه فقالت سوف تعلم يا غدر إذا وضع الله الكرسي وجمع الأولين والآخرين وتكلمت الأيدي والأرجل بما كانوا يكسبون فسوف تعلم كيف أمري وأمرك عنده غدا ‏.‏ قال يقول رسول الله  صلى الله عليه وسلم  ‏\"‏ صدقت صدقت كيف يقدس الله أمة لا يؤخذ لضعيفهم من شديدهم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Jabir said:                      “When the emigrants who hadcrossedthe sea came back to the Messenger of Allah (ﷺ), he said:‘Why don’tyou tell me of the strange things that you saw in theland ofAbyssinia?’ Some young men among them said: ‘Yes, OMessenger ofAllah. While we were sitting, one of their elderly nunscame past,carrying a vessel of water on her head. She passed by someof theiryouth, one of whom placed his hand between her shoulders andpushedher. She fell on her knees and her vessel broke. When shestood up,she turned to him and said: “You will come to know, Otraitor, thatwhen Allah sets up the Footstool and gathers the firstand the last,and hands and feet speak of what they used to earn, youwill come toknow your case and my case in His presence soon.’”The Messenger ofAllah (ﷺ) said: ‘She spoke the truth, she spokethe truth. How canAllah purify any people (of sin) when they do notsupport their weakfrom their strong?’”",
      "chain": [
        "30547",
        "20204",
        "10644",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "4232",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا بقية، عن بحير بن سعد، عن خالد بن أبي بلال، عن عبد الله بن بسر، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ بين الملحمة وفتح المدينة ست سنين ويخرج الدجال في السابعة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin Busr that the Messenger of Allah(ﷺ) said:                      \"Between the fierce battle and the conquest ofAl-Madinahwill be six years, and the appearance of Dajjal will comein theseventh.'\"",
      "chain": [
        "30547",
        "20644",
        "3650"
      ]
    }
  ],
  "total_hadiths": 120
}