{
  "id": "30553",
  "name": "'Abd bin Hameed bin Nasr عبد بن حميد بن نصر",
  "full_name": "'Abd bin Hameed bin Nasr عبد بن حميد بن نصر",
  "grade": "3rd Century AH [11th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "249",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [خت  م  ت  -  ثقة حافظ ]"
    ],
    "tags": []
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20416",
      "name": "Ja'far bin Awn bin Ja'far جعفر بن عون بن جعفر",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20318",
      "name": "Hammad bin Usamah حماد بن أسامة - أبو أسامة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20244",
      "name": "'Abdullah bin Bakr عبد الله بن بكر بن حبيب السهمي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20472",
      "name": "Yazid bin Harun يزيد بن هارون",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20172",
      "name": "Muhammad bin Abi Fadayk محمد بن إسماعيل بن مسلم بن أبي فديك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20528",
      "name": "Ahmed bin Ishaq bin Zayd أحمد بن إسحاق بن زيد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20229",
      "name": "Ruh bin 'Ubada bin al-'Ala' روح بن عبادة بن العلاء",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20232",
      "name": "Sa'id bin 'Amir al-Dab'ai سعيد بن عامر الضبعي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20121",
      "name": "'Abdur-Razzaq عبد الرزاق بن همام",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20250",
      "name": "'Abdul Samad bin 'Abdul Warith bin Sa'id عبد الصمد بن عبد الوارث بن سعيد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20450",
      "name": "'Umar bin Yonus bin al-Qasim عمر بن يونس بن القاسم",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "28413",
      "name": "'Ali bin 'Asim bin S'hyb علي بن عاصم بن صهيب الواسطي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20352",
      "name": "Muhammad bin Bashr bin al-Farafsa محمد بن بشر بن الفرافصة العبدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20277",
      "name": "Muhammad bin Bakr bin 'Uthman al-Barsani محمد بن بكر بن عثمان البرساني",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20608",
      "name": "Mus'ab bin al-Mqdam al-Khth'my مصعب بن المقدام الخثعمي مولاهم أبو عبد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20668",
      "name": "'Umar bin Sa'd bin 'Ubaid عمر بن سعد بن عبيد أبو داود",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20443",
      "name": "Abu 'Amir al-'Aqdi عبد الملك بن عمرو القيسي أبو عامر العقدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "20547",
      "name": "Sulaiman bin Da'ud bin al-Jarud سليمان بن داود أبو داود الطيالسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20296",
      "name": "Hisham bin 'Abdul Malik al-Tayalasi هشام بن عبد الملك أبو الوليد الطيالسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30283",
      "name": "Ishaq bin Ibrahim bin Yazid إسحاق بن إبراهيم بن يزيد",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20364",
      "name": "Yahya bin Aadm bin Sulaiman يحيى بن آدم بن سليمان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20184",
      "name": "Ya'qub bin Ibrahim bin Sa'd يعقوب بن إبراهيم بن سعد بن إبراهيم",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20372",
      "name": "Ya'la bin 'Ubaid bin Umayya al-Tanafasi يعلى بن عبيد بن أبي أمية الطنافسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20393",
      "name": "Yonus bin Muhammad bin Muslim يونس بن محمد بن مسلم المؤدب",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20283",
      "name": "Muhammad bin al-Fadl 'Aram محمد بن الفضل السدوسي أبو النعمان عارم",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20285",
      "name": "Muslim bin Ibrahim al-Azdy مسلم بن إبراهيم الأزدي الفراهيدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20348",
      "name": "al-Fadl bin Dakayn, Abu Na'eem الفضل بن دكين أبو نعيم الملائي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20340",
      "name": "'Ubaidullah bin Musa bin Abi al-Mukhtar عبيد الله بن موسى بن أبي المختار باذام",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "23033",
      "name": "'Abdullah bin Yazid al-'Advi عبد الله بن يزيد العدوي المقري القصير",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20164",
      "name": "'Abdullah bin Muslima al-Qa'nabi عبد الله بن مسلمة بن قعنب القعنبي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20241",
      "name": "al-Dahhak bin Mukhlad Abu 'Asim al-Nabil الضحاك بن مخلد أبو عاصم النبيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]"
    },
    {
      "id": "30005",
      "name": "Imam Tirmidhi الترمذي محمد بن عيسى بن سورة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "11057",
      "name": "Muhammad bin 'Abdur Rahman bin Yazid محمد بن عبد الرحمن بن يزيد",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "131",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا بشر بن السري، حدثنا زكرياء بن إسحاق، ح وحدثنا عبد بن حميد، حدثنا أبو عاصم، عن زكرياء بن إسحاق، عن يحيى بن عبد الله بن صيفي، عن أبي معبد، عن ابن عباس، أن النبي صلى الله عليه وسلم بعث معاذا إلى اليمن فقال ‏\"‏ إنك ستأتي قوما ‏\"‏ بمثل حديث وكيع ‏.‏",
      "text_en": "",
      "chain": [
        "30421",
        "20190",
        "11244",
        "30553",
        "20241",
        "11244",
        "11448",
        "13127",
        "17"
      ]
    },
    {
      "hadith_no": "142",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا إسحاق بن إبراهيم، وعبد بن حميد، قالا أخبرنا عبد الرزاق، أخبرنا معمر، ح وحدثنا حسن الحلواني، وعبد بن حميد، قالا حدثنا يعقوب، - وهو ابن إبراهيم بن سعد - قال حدثني أبي، عن صالح، كلاهما عن الزهري، بهذا الإسناد مثله غير أن حديث صالح انتهى عند قوله فأنزل الله عز وجل فيه ‏.‏ ولم يذكر الآيتين ‏.‏ وقال في حديثه ويعودان في تلك المقالة ‏.‏ وفي حديث معمر مكان هذه الكلمة فلم يزالا به ‏.‏",
      "text_en": "",
      "chain": [
        "30123",
        "30553",
        "20121",
        "20115",
        "130115",
        "30553",
        "20184",
        "20150"
      ]
    },
    {
      "hadith_no": "161",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا عبيد الله بن سعيد، وعبد بن حميد، قالا حدثنا أبو عامر العقدي، حدثنا سليمان بن بلال، عن عبد الله بن دينار، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ الإيمان بضع وسبعون شعبة والحياء شعبة من الإيمان ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Huraira that the Prophet (may peace be upon him) said:                      Iman has over seventy branches, and modesty is a branch of Iman.",
      "chain": [
        "30359",
        "30553",
        "20443",
        "20160",
        "11183",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "164",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد بن حميد، حدثنا عبد الرزاق، أخبرنا معمر، عن الزهري، بهذا الإسناد وقال مر برجل من الأنصار يعظ أخاه ‏.‏",
      "text_en": " Zuhri has narrated this hadith with the addition of these words:                      He (the Holy Prophet) happened to pass by a mass of Ansar who was instructing his brother (about modesty).",
      "chain": [
        "30553",
        "20121",
        "20115"
      ]
    },
    {
      "hadith_no": "171",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا حسن الحلواني، وعبد بن حميد، جميعا عن أبي عاصم، - قال عبد أنبأنا أبو عاصم، - عن ابن جريج، أنه سمع أبا الزبير، يقول سمعت جابرا، يقول سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ المسلم من سلم المسلمون من لسانه ويده ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Jabir that he heard the (Holy Prophet) say:                      A Muslim is he from whose hand and tongue the Muslim's are safe.",
      "chain": [
        "130115",
        "30553",
        "20241",
        "20241",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "259",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنيه محمد بن رافع، وعبد بن حميد، عن عبد الرزاق، أخبرنا معمر، عن الزهري، بهذا الإسناد مثله ‏.‏",
      "text_en": "",
      "chain": [
        "30553",
        "20121",
        "20115"
      ]
    },
    {
      "hadith_no": "261",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن رافع، وعبد بن حميد، قال عبد أخبرنا وقال ابن رافع، حدثنا عبد الرزاق، أخبرنا معمر، عن الزهري، عن حبيب، مولى عروة بن الزبير عن عروة بن الزبير، عن أبي مراوح، عن أبي ذر، عن النبي صلى الله عليه وسلم بنحوه غير أنه قال ‏\"‏ فتعين الصانع أو تصنع لأخرق ‏\"‏ ‏.‏",
      "text_en": " Muhammad b. Abu Rafi' narrated the hadith on the authority of Abu Dharr with a slight difference.",
      "chain": [
        "30375",
        "30553",
        "20121",
        "20115",
        "11013",
        "10511",
        "23"
      ]
    },
    {
      "hadith_no": "285",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا إسحاق بن إبراهيم، وعبد بن حميد، قالا أخبرنا عبد الرزاق، قال أخبرنا معمر، ح وحدثنا إسحاق بن موسى الأنصاري، حدثنا الوليد بن مسلم، عن الأوزاعي، ح وحدثنا محمد بن رافع، حدثنا عبد الرزاق، أخبرنا ابن جريج، جميعا عن الزهري، بهذا الإسناد أما الأوزاعي وابن جريج ففي حديثهما قال أسلمت لله ‏.‏ كما قال الليث في حديثه ‏.‏ وأما معمر ففي حديثه فلما أهويت لأقتله قال لا إله إلا الله ‏.‏",
      "text_en": " The same hadith has been transmitted by the same chain of narrators. The hadith transmitted by Auza'i and Ibn Juraij contains these words:                      I embraced Islam for Allah's sake. and in the hadith narrated by Ma'mar the words are: I knelt down to kill him, that he said; There is no god but Allah.",
      "chain": [
        "30123",
        "30553",
        "20121",
        "20115",
        "30410",
        "20733",
        "20024",
        "30375",
        "20121"
      ]
    },
    {
      "hadith_no": "299",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد بن حميد، وإسحاق بن منصور، قالا أخبرنا جعفر بن عون، أخبرنا أبو عميس، قال سمعت أبا صخرة، يذكر عن عبد الرحمن بن يزيد، وأبي، بردة بن أبي موسى قالا أغمي على أبي موسى وأقبلت امرأته أم عبد الله تصيح برنة ‏.‏ قالا ثم أفاق قال ألم تعلمي - وكان يحدثها - أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أنا بريء ممن حلق وسلق وخرق ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Burda that Abu Musa fell unconscious and his wife Umm Abdullah came there and wailed loudly. When he felt relief he said:                      Don't you know? -and narrated to her: Verily the Messenger of Allah (may peace be upon him) said: I have no concern with one who shaved her hair, lamented loudly and tore (her clothes in grief).",
      "chain": [
        "30553",
        "30313",
        "20416",
        "20395",
        "11901"
      ]
    },
    {
      "hadith_no": "319",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا محمد بن رافع، وعبد بن حميد، جميعا عن عبد الرزاق، - قال ابن رافع حدثنا عبد الرزاق، - أخبرنا معمر، عن الزهري، عن ابن المسيب، عن أبي هريرة، قال شهدنا مع رسول الله صلى الله عليه وسلم حنينا فقال لرجل ممن يدعى بالإسلام ‏\"‏ هذا من أهل النار ‏\"‏ فلما حضرنا القتال قاتل الرجل قتالا شديدا فأصابته جراحة فقيل يا رسول الله الرجل الذي قلت له آنفا ‏\"‏ إنه من أهل النار ‏\"‏ فإنه قاتل اليوم قتالا شديدا وقد مات ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ إلى النار ‏\"‏ فكاد بعض المسلمين أن يرتاب فبينما هم على ذلك إذ قيل إنه لم يمت ولكن به جراحا شديدا فلما كان من الليل لم يصبر على الجراح فقتل نفسه فأخبر النبي صلى الله عليه وسلم بذلك فقال ‏\"‏ الله أكبر أشهد أني عبد الله ورسوله ‏\"‏ ‏.‏ ثم أمر بلالا فنادى في الناس ‏\"‏ إنه لا يدخل الجنة إلا نفس مسلمة وإن الله يؤيد هذا الدين بالرجل الفاجر ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Huraira:                      We participated in the Battle of Hunain along with the Messenger of Allah (may peace be upon him). He (the Holy Prophet) said about a man who claimed to be a Muslim that he was one of the denizens of the Fire (of Hell). When we were in the thick of the battle that man fought desperately and was wounded. It was said: Messenger of Allah, the person whom you at first called as the denizen of Fire fought desperately and died. Upon this the Apostle of Allah (may peace be upon him) remarked: He was doomed to the Fire (of Hell). Some men were on the verge of doubt (about his fate) when it was said that he was not dead but fatally wounded. When it was night he could not stand the (pain of his) wound and killed himself. The Apostle (may peace be upon him) was informed of that. He (the Holy Prophet) observed: Allah is Great, I bear testimony to the fact that I am the servant of Allah and His messenger. He then commanded Bilal to announce to the people that none but a Muslim would enter Paradise. Verily Allah helps this faith even by a sinful person.",
      "chain": [
        "30375",
        "30553",
        "20121",
        "20121",
        "20115",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "339",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا حسن الحلواني، وعبد بن حميد، - قال الحلواني حدثنا وقال عبد، حدثني - يعقوب، - وهو ابن إبراهيم بن سعد - حدثنا أبي، عن صالح، عن ابن شهاب، قال أخبرني عروة بن الزبير، أن حكيم بن حزام، أخبره أنه، قال لرسول الله صلى الله عليه وسلم أى رسول الله أرأيت أمورا كنت أتحنث بها في الجاهلية من صدقة أو عتاقة أو صلة رحم أفيها أجر فقال رسول الله صلى الله عليه وسلم ‏\"‏ أسلمت على ما أسلفت من خير ‏\"‏ ‏.‏",
      "text_en": " Hakim b. Hizam reported to 'Urwa b. Zubair that he said to the Messenger of Allah (may peace be upon him):                      Messenger of Allah, do you think if there is any reward (of the Lord with me on the Day of Resurrection) for the deeds of religious purification that I performed in the state of ignorance, such as charity, freeing a slave, cementing of blood-relations? Upon this he (the Apostle of Allah) said to him: You have accepted Islam with all the previous virtues that you had practised.",
      "chain": [
        "130115",
        "30553",
        "30115",
        "20184",
        "20150",
        "11176",
        "11013",
        "10511",
        "423"
      ]
    },
    {
      "hadith_no": "340",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا إسحاق بن إبراهيم، وعبد بن حميد، قالا أخبرنا عبد الرزاق، أخبرنا معمر، عن الزهري، بهذا الإسناد ح وحدثنا إسحاق بن إبراهيم، أخبرنا أبو معاوية، حدثنا هشام بن عروة، عن أبيه، عن حكيم بن حزام، قال قلت يا رسول الله أشياء كنت أفعلها في الجاهلية - قال هشام يعني أتبرر بها - فقال رسول الله صلى الله عليه وسلم ‏\"‏ أسلمت على ما أسلفت لك من الخير ‏\"‏ ‏.‏ قلت فوالله لا أدع شيئا صنعته في الجاهلية إلا فعلت في الإسلام مثله ‏.‏",
      "text_en": " It is narrate on the authority of Hakim b. Hizam:                      I said: Messenger of Allah, I did so some of the deeds in the state of ignorance. (One of the transmitters Hisham b. Urwa explained them as acts of piety. Upon this the Messenger, of Allah remarked: You have embraced Islam with all the previous acts of virtue. I said: By God, I would leave nothing undone in Islam the like of which I did in the state of ignorance.",
      "chain": [
        "30123",
        "30553",
        "20121",
        "20115",
        "30123",
        "20354",
        "11065",
        "10511",
        "423"
      ]
    },
    {
      "hadith_no": "362",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثني زهير بن حرب، وعبد بن حميد، جميعا عن يعقوب، قال زهير حدثنا يعقوب بن إبراهيم، حدثنا ابن أخي ابن شهاب، عن عمه، قال أخبرني عروة بن الزبير، أن أبا هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يأتي الشيطان أحدكم فيقول من خلق كذا وكذا حتى يقول له من خلق ربك فإذا بلغ ذلك فليستعذ بالله ولينته ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Huraira that the Messenger of Allah may peace be upon him) observed:                      The Satan comes to everyone. of you and says: Who created this and that? till he questions: Who created your Lord? When he comes to that, one should seek refuge in Allah and keep away (from such idle thoughts).",
      "chain": [
        "30022",
        "30553",
        "20184",
        "20321",
        "20184",
        "20176",
        "10511",
        "13"
      ]
    },
    {
      "hadith_no": "393",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد بن حميد، أخبرنا عبد الرزاق، أخبرنا معمر، عن ثابت، عن أنس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تقوم الساعة على أحد يقول الله الله ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Anas that the Messenger of Allah (may peace be upon him) said:                      The Hour (Resurrection) would not come upon anyone so long as he supplicates Allah.",
      "chain": [
        "30553",
        "20121",
        "20115",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "397",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا الحسن بن علي الحلواني، وعبد بن حميد، قالا حدثنا يعقوب، - وهو ابن إبراهيم بن سعد - حدثنا أبي، عن صالح، عن ابن شهاب، قال حدثني عامر بن سعد، عن أبيه، سعد أنه قال أعطى رسول الله صلى الله عليه وسلم رهطا وأنا جالس فيهم ‏.‏ بمثل حديث ابن أخي ابن شهاب عن عمه ‏.‏ وزاد فقمت إلى رسول الله صلى الله عليه وسلم فساررته فقلت ما لك عن فلان ‏.‏",
      "text_en": " Sa'd reported:                      The Messenger of Allah (may peace be upon him) bestowed upon a group of persons (booty) and I was sitting with them. The remaining part of the hadith is the same as mentioned (above) with the additionI stood up and went to the Messenger of Allah (may peace be upon him) and whispered to him: Why did you omit such and such a man?",
      "chain": [
        "30115",
        "30553",
        "20184",
        "20150",
        "11176",
        "11013",
        "10554"
      ]
    },
    {
      "hadith_no": "407",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثناه عبد الأعلى بن حماد، وأبو بكر بن أبي شيبة وزهير بن حرب قالوا حدثنا سفيان بن عيينة، ح وحدثنيه حرملة بن يحيى، أخبرنا ابن وهب، قال حدثني يونس، ح وحدثنا حسن الحلواني، وعبد بن حميد، عن يعقوب بن إبراهيم بن سعد، حدثنا أبي، عن صالح، كلهم عن الزهري، بهذا الإسناد وفي رواية ابن عيينة ‏\"‏ إماما مقسطا وحكما عدلا ‏\"‏ ‏.‏ وفي رواية يونس ‏\"‏ حكما عادلا ‏\"‏ ‏.‏ ولم يذكر ‏\"‏ إماما مقسطا ‏\"‏ ‏.‏ وفي حديث صالح ‏\"‏ حكما مقسطا ‏\"‏ كما قال الليث ‏.‏ وفي حديثه من الزيادة ‏\"‏ وحتى تكون السجدة الواحدة خيرا من الدنيا وما فيها ‏\"‏ ‏.‏ ثم يقول أبو هريرة اقرءوا إن شئتم ‏{‏ وإن من أهل الكتاب إلا ليؤمنن به قبل موته‏}‏ الآية ‏.‏",
      "text_en": " The same hadith is transmitted from Zuhri with the same chain of transmission. But in the tradition narrated by Ibn 'Uyaina the words are:                     \" impartial leader and just judge\" and in the tradition narrated by Yunus: the\" judge judging with justice\" and\" impartial leader\" are not mentioned. And in the hadith narrated by Salih like the one transmitted by Laith the words are:\" impartial judge\". And in the hadith transmitted by Ziyad the words are:\" Till one sajda is better than the worldand what it contains. Then Abu Huraira used to say,\" recite\" if you like: Not one of the People of the Book will fail to believe in him before his death.",
      "chain": [
        "30146",
        "20005",
        "20029",
        "20475",
        "130115",
        "30553",
        "20184",
        "20150"
      ]
    },
    {
      "hadith_no": "437",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا عبد بن حميد، أخبرنا يونس بن محمد، حدثنا شيبان بن عبد الرحمن، عن قتادة، عن أبي العالية، حدثنا ابن عم، نبيكم صلى الله عليه وسلم ابن عباس قال قال رسول الله صلى الله عليه وسلم ‏\"‏ مررت ليلة أسري بي على موسى بن عمران - عليه السلام - رجل آدم طوال جعد كأنه من رجال شنوءة ورأيت عيسى ابن مريم مربوع الخلق إلى الحمرة والبياض سبط الرأس ‏\"‏ ‏.‏ وأري مالكا خازن النار والدجال ‏.‏ في آيات أراهن الله إياه فلا تكن في مرية من لقائه ‏.‏ قال كان قتادة يفسرها أن نبي الله صلى الله عليه وسلم قد لقي موسى عليه السلام ‏.‏",
      "text_en": " Abu al-'Aliya reported:                      Ibn Abbas, the son of your Prophet's uncle, told us that the Messenger of Allah (may peace be upon him) had observed: On the night of my night journey I passed by Moses b. 'Imran (peace be upon him), a man light brown in complexion, tall. well-built as if he was one of the men of the Shanu'a, and saw Jesus son of Mary as a medium-statured man with white and red complexion and crisp hair, and I was shown Malik the guardian of Fire, and Dajjal amongst the signs which were shown to me by Allah. He (the narrator) observed: Then do not doubt his (i. e. of the Holy Prophet) meeting with him (Moses). Qatada elucidated it thus: Verily the Apostle of Allah (may peace be upon him), met Moses (peace be upon him).",
      "chain": [
        "30553",
        "20393",
        "20240",
        "11019",
        "11618"
      ]
    },
    {
      "hadith_no": "442",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني محمد بن رافع، وعبد بن حميد، - وتقاربا في اللفظ - قال ابن رافع حدثنا وقال عبد، أخبرنا عبد الرزاق، أخبرنا معمر، عن الزهري، قال أخبرني سعيد بن المسيب، عن أبي هريرة، قال قال النبي صلى الله عليه وسلم ‏\"‏ حين أسري بي لقيت موسى - عليه السلام - ‏\"‏ ‏.‏ فنعته النبي صلى الله عليه وسلم ‏\"‏ فإذا رجل - حسبته قال - مضطرب رجل الرأس كأنه من رجال شنوءة - قال - ولقيت عيسى ‏\"‏ ‏.‏ فنعته النبي صلى الله عليه وسلم ‏\"‏ فإذا ربعة أحمر كأنما خرج من ديماس ‏\"‏ ‏.‏ - يعني حماما - قال ‏\"‏ ورأيت إبراهيم - صلوات الله عليه - وأنا أشبه ولده به - قال - فأتيت بإناءين في أحدهما لبن وفي الآخر خمر فقيل لي خذ أيهما شئت ‏.‏ فأخذت اللبن فشربته ‏.‏ فقال هديت الفطرة أو أصبت الفطرة أما إنك لو أخذت الخمر غوت أمتك ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Huraira that the Apostle of Allah (may peace be upon him) said:                      When I was taken for the night journey I met Moses peace be upon him). The Apostle of Allah (may peace be upon him) gave his description thus: He was a man, I suppose-and he (the narrator) was somewhat doubtful (that the Holy Prophet observed): (Moses) was a man erect in stature with straight hair on his head as it he was one of the men of the Shanu'a; and I met Jesus and the Apostle of Allah (may peace be upon him) described him as one having a medium stature and a red complexion as if he had (just) come out of the bath He observed: I saw Ibrahim (peace be upon him) and amongst his children I have the greatest resemblance with him. He said: There were brought to me two vessels. In one of them was milk and in the other one there was wine. And it was said to me: Select any one you like. So I selected the vessel containing milk and drank it. He (the angel) said: You have been guided on al-fitra or you have attained al-fitra. Had you selected wine, your Ummah would have been misled.",
      "chain": [
        "30375",
        "30553",
        "20121",
        "20115",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "509",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني زهير بن حرب، وعبد بن حميد، قال زهير حدثنا يعقوب بن إبراهيم، حدثنا ابن أخي ابن شهاب، عن عمه، أخبرني أبو سلمة بن عبد الرحمن، أن أبا هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لكل نبي دعوة وأردت إن شاء الله أن أختبئ دعوتي شفاعة لأمتي يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      The Messenger of Allah (may peace be upon him) said: There is for every apostle a prayer, and I intend (if Allah so willed) that I would reserve my prayer for the intercession of my Ummah on the Day of Resurrection.",
      "chain": [
        "30022",
        "30553",
        "20321",
        "20184",
        "20176",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "510",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثني زهير بن حرب، وعبد بن حميد، قال زهير حدثنا يعقوب بن إبراهيم، حدثنا ابن أخي ابن شهاب، عن عمه، حدثني عمرو بن أبي سفيان بن أسيد بن جارية الثقفي، مثل ذلك عن أبي هريرة، عن رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " 'Amr b. Abu Sufyan transmitted a hadith like this from Abu Huraira who narrated it from the Messenger of Allah (may peace be upon him).",
      "chain": [
        "30022",
        "30553",
        "20321",
        "20184",
        "20176",
        "13"
      ]
    },
    {
      "hadith_no": "256",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا عبد بن حميد، حدثنا أبو نعيم، حدثنا إسماعيل بن مسلم، حدثنا أبو المتوكل، أن ابن عباس، حدثه أنه، بات عند النبي صلى الله عليه وسلم ذات ليلة فقام نبي الله صلى الله عليه وسلم من آخر الليل فخرج فنظر في السماء ثم تلا هذه الآية في آل عمران ‏{‏ إن في خلق السموات والأرض واختلاف الليل والنهار‏}‏ حتى بلغ ‏{‏ فقنا عذاب النار‏}‏ ثم رجع إلى البيت فتسوك وتوضأ ثم قام فصلى ثم اضطجع ثم قام فخرج فنظر إلى السماء فتلا هذه الآية ثم رجع فتسوك فتوضأ ثم قام فصلى ‏.‏",
      "text_en": " Ibn 'Abbas reported that he spent a night at the house of the Apostle of Allah (may peace be upon him), The Apostle of Allah (way peace be upon him) got up for prayer in the latter part of the night. He went out and looked towards the sky and then recited this verse (190th) of AI-i-'Imran:                     \" Verily in the creation of the heavens and the earth and the alternation of night and day.\" up to the (words)\" save us from the torment of Hell.\" He then returned to his house, used the tooth-stick, performed the ablution, and then got up and offered the prayer. He than lay down on the bed. and again got up and went out and looked towards the sky and recited this verse (mentioned above), then returned, used the tooth-stick, performed ablution and again offered the prayer.",
      "chain": [
        "30553",
        "20348",
        "22025",
        "17"
      ]
    },
    {
      "hadith_no": "330",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثنا عمرو الناقد، حدثنا يزيد بن هارون، ح وحدثنا عبد بن حميد، أخبرنا عبد الرزاق، قالا أخبرنا الثوري، عن أيوب بن موسى، في هذا الإسناد وفي حديث عبد الرزاق فأنقضه للحيضة والجنابة فقال ‏\"‏ لا ‏\"‏ ثم ذكر بمعنى حديث ابن عيينة ‏.‏",
      "text_en": " This hadith has been narrated by Amr al-Naqid, Yazid b. Harun, 'Abd b. Humaid, Abd al-Razzaq, Thauri, Ayyub b. Musa, with the same chain of transmitters. In hadith narrated by Abd al-Razzaq there is a mention of the menstruation and of the sexual intercourse. The rest of the hadith has been transmitted like that of Ibn 'Uyaina.",
      "chain": [
        "30263",
        "20472",
        "30553",
        "20121",
        "20012",
        "11241"
      ]
    },
    {
      "hadith_no": "335",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثنا عبد بن حميد، أخبرنا عبد الرزاق، أخبرنا معمر، عن عاصم، عن معاذة، قالت سألت عائشة فقلت ما بال الحائض تقضي الصوم ولا تقضي الصلاة فقالت أحرورية أنت قلت لست بحرورية ولكني أسأل ‏.‏ قالت كان يصيبنا ذلك فنؤمر بقضاء الصوم ولا نؤمر بقضاء الصلاة ‏.‏",
      "text_en": " Mu'adha said:                      I asked 'A'isha: What is the reason that a menstruating woman completes the fasts (that she abandons during her monthly course). but she does not complete the prayers? She (Hadrat 'A'isha) said: Are you a Haruriya? I said: I am not a Haruriya, but I simply want to inquire. She said: We passed through this (period of menstruation), and we were ordered to complete the fasts, but were not ordered to complete the prayers.",
      "chain": [
        "30553",
        "20121",
        "20115",
        "11080",
        "11456"
      ]
    },
    {
      "hadith_no": "347",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثني زهير بن حرب، وعبد بن حميد، قالا حدثنا عبد الصمد بن عبد الوارث، ح وحدثنا عبد الوارث بن عبد الصمد، - واللفظ له - حدثني أبي، عن جدي، عن الحسين بن ذكوان، عن يحيى بن أبي كثير، أخبرني أبو سلمة، أن عطاء بن يسار، أخبره أن زيد بن خالد الجهني أخبره أنه، سأل عثمان بن عفان قال قلت أرأيت إذا جامع الرجل امرأته ولم يمن قال عثمان ‏\"‏ يتوضأ كما يتوضأ للصلاة ويغسل ذكره ‏\"‏ ‏.‏ قال عثمان سمعته من رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Zaid b. Khalid al-Jubani reported that he askad Uthman b. 'Affan:                      What is your opinion about the man who has sexual intercourse with his wife, but does not experience orgasm? Uthman said: He should perform ablution as he does for prayer, and wash his organ. 'Uthmin also said: I have heard it from the Messenger of Allah (may peace be upon him).",
      "chain": [
        "30022",
        "30553",
        "20250",
        "20258",
        "11449",
        "10567",
        "11020",
        "3625",
        "4"
      ]
    },
    {
      "hadith_no": "363",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثنا حسن الحلواني، وعبد بن حميد، جميعا عن يعقوب بن إبراهيم بن سعد، حدثني أبي، عن صالح، عن ابن شهاب، بهذا الإسناد بنحو رواية يونس ‏.‏",
      "text_en": " This hadith is narrated by Ibn Shihab with the same chain of transmitters as transmitted by Yunus.",
      "chain": [
        "130115",
        "30553",
        "20184",
        "20150",
        "11176"
      ]
    },
    {
      "hadith_no": "394",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "وحدثناه إسحاق بن إبراهيم، وعبد بن حميد، قالا أخبرنا عبد الرزاق، أخبرنا معمر، عن الزهري، بهذا الإسناد مثله وزاد فصاعدا ‏.‏",
      "text_en": " This hadith has also been transmitted by Ma'mar from al-Zuhri with the same chain of transmitters with the addition of these words:                     \" and something more\".",
      "chain": [
        "30123",
        "30553",
        "20121",
        "20115"
      ]
    },
    {
      "hadith_no": "402",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد بن حميد، حدثنا حسين الجعفي، عن زائدة، عن منصور، بهذا الإسناد مثل حديثهما وذكر في الحديث ‏\"‏ ثم ليتخير بعد من المسألة ما شاء أو ما أحب ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Mansur with the same chain of transmitters and he made a mention of this:                     \" Then he may choose any supplication which pleases him or which he likes.\"",
      "chain": [
        "30553",
        "20315",
        "20320"
      ]
    },
    {
      "hadith_no": "411",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد بن حميد، أخبرنا عبد الرزاق، أخبرنا معمر، عن الزهري، أخبرني أنس، أن النبي صلى الله عليه وسلم سقط من فرسه فجحش شقه الأيمن ‏.‏ وساق الحديث وليس فيه زيادة يونس ومالك ‏.‏",
      "text_en": " Anas b. Malik reported:                      The Messenger of Allah (may peace be upon him) fell down from his horse and his right side was grazed, and the rest of the hadith is the same. In this hadith there are no additions (of words) as transmitted by Yunus and Malik.",
      "chain": [
        "30553",
        "20121",
        "20115",
        "11013",
        "19"
      ]
    },
    {
      "hadith_no": "418",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن رافع، وعبد بن حميد، - واللفظ لابن رافع - قالا حدثنا عبد الرزاق، أخبرنا معمر، قال قال الزهري وأخبرني عبيد الله بن عبد الله بن عتبة، أن عائشة، أخبرته قالت، أول ما اشتكى رسول الله صلى الله عليه وسلم في بيت ميمونة فاستأذن أزواجه أن يمرض في بيتها وأذن له - قالت - فخرج ويد له على الفضل بن عباس ويد له على رجل آخر وهو يخط برجليه في الأرض ‏.‏ فقال عبيد الله فحدثت به ابن عباس فقال أتدري من الرجل الذي لم تسم عائشة هو علي ‏.‏",
      "text_en": " 'A'isha reported:                      It was in the house ofMaimuna that the Messenger of Allah (may peace be upon him) first fell ill. He asked permission from his wives to stay in her ('A'isha's) house during his illness. They granted him permission. She ('A'isha) narrated: He (the Holy Prophet) went out (for prayer) with his hand over al-Fadl b. 'Abbas and on the other hand there was another person and (due to weakness) his feet dragged on the earth. 'Ubaidullah said: I narrated this hadith to the son of 'Abbas ('Abdullah b. 'Abbas) and he said: Do you know who the man was whose name 'A'isha did not mention? It was 'Ali.",
      "chain": [
        "30375",
        "30553",
        "20121",
        "20115",
        "11013",
        "11004",
        "53"
      ]
    },
    {
      "hadith_no": "418",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن رافع، وعبد بن حميد، - واللفظ لابن رافع - قال عبد أخبرنا وقال ابن رافع، حدثنا عبد الرزاق، - أخبرنا معمر، قال الزهري وأخبرني حمزة بن عبد الله بن عمر، عن عائشة، قالت لما دخل رسول الله صلى الله عليه وسلم بيتي قال ‏\"‏ مروا أبا بكر فليصل بالناس ‏\"‏ ‏.‏ قالت فقلت يا رسول الله إن أبا بكر رجل رقيق إذا قرأ القرآن لا يملك دمعه فلو أمرت غير أبي بكر ‏.‏ قالت والله ما بي إلا كراهية أن يتشاءم الناس بأول من يقوم في مقام رسول الله صلى الله عليه وسلم قالت فراجعته مرتين أو ثلاثا فقال ‏\"‏ ليصل بالناس أبو بكر فإنكن صواحب يوسف ‏\"‏ ‏.‏",
      "text_en": " 'A'isha reported:                      When the Messenger of Allah (may peace be upon him) came to my house, he said: Ask Abu Bakr to lead people in prayer. 'A'isha narrated: I said, Messenger of Allah, Abu Bakr is a man of tenderly feelings; as he recites the Qur'an, he cannot help shedding tears: so better command anyone else to lead the prayer. By Allah, there is nothing disturbing in it for me but the idea that the people may not takeevil omen with regard to one who is the first to occupy the place of the Messenger of Allah (may peace be upon him). I tried to dissuade him (the Holy Prophet) twice or thrice (from appointing my father as an Imam in prayer), but he ordered Abu Bakr to lead the people in prayer and said: You women are like those (who had) surrounded Yusuf.",
      "chain": [
        "30375",
        "30553",
        "20121",
        "20115",
        "11013",
        "11818",
        "53"
      ]
    },
    {
      "hadith_no": "419",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثني عمرو الناقد، وحسن الحلواني، وعبد بن حميد، - قال عبد أخبرني وقال الآخران، حدثنا يعقوب، - وهو ابن إبراهيم بن سعد - وحدثني أبي، عن صالح، عن ابن شهاب، قال أخبرني أنس بن مالك، أن أبا بكر، كان يصلي لهم في وجع رسول الله صلى الله عليه وسلم الذي توفي فيه حتى إذا كان يوم الاثنين - وهم صفوف في الصلاة - كشف رسول الله صلى الله عليه وسلم ستر الحجرة فنظر إلينا وهو قائم كأن وجهه ورقة مصحف ‏.‏ ثم تبسم رسول الله صلى الله عليه وسلم ضاحكا - قال - فبهتنا ونحن في الصلاة من فرح بخروج رسول الله صلى الله عليه وسلم ونكص أبو بكر على عقبيه ليصل الصف وظن أن رسول الله صلى الله عليه وسلم خارج للصلاة فأشار إليهم رسول الله صلى الله عليه وسلم بيده أن أتموا صلاتكم - قال - ثم دخل رسول الله صلى الله عليه وسلم فأرخى الستر - قال - فتوفي رسول الله صلى الله عليه وسلم من يومه ذلك ‏.‏",
      "text_en": " Anas b. Malik reported, Abu Bakr led them in prayer due to the illness of the Messenger of Allah (may peace be upon him) of which be died. It was a Monday and they stood in rows for prayer. The Messenger of Allah (may peace be upon him) drew aside the curtain of ('A'isha's) apartment and looked at us while he was standing, and his (Prophet's) face was (as bright) as the paper of the Holy Book. The Messenger of Allah (may peace be upon him) felt happy and smiled. And we were confounded with joy while in prayer due to the arrival (among our midst) of the Messenger of Allah (may peace be upon him), Abu Bakr stepped back upon his heels to say prayer in a row perceiving that the Messenger of Allah (may peace be upon him) had come out for prayer. The Messenger of Allah (may peace be upon him) with the help of his hand signed to them to complete their prayer. The Messenger of Allah (may peace be upon him) went back (to his apartment) and drew the curtain. He (the narrator) said:                      The Messenger of Allah (may peace be upon him) breathed his last on that very day.",
      "chain": [
        "30263",
        "130115",
        "30553",
        "20184",
        "20150",
        "11176",
        "11013",
        "19",
        "20436"
      ]
    },
    {
      "hadith_no": "419",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "وحدثني محمد بن رافع، وعبد بن حميد، جميعا عن عبد الرزاق، أخبرنا معمر، عن الزهري، قال أخبرني أنس بن مالك، قال لما كان يوم الاثنين ‏.‏ بنحو حديثهما ‏.‏",
      "text_en": " This hadith is narrated on the authority of Anas b. Malik by another chain of transmitters.",
      "chain": [
        "30375",
        "30553",
        "20121",
        "20115",
        "11013",
        "19"
      ]
    },
    {
      "hadith_no": "462",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعمرو الناقد، قالا حدثنا سفيان، ح قال وحدثني حرملة بن يحيى، أخبرنا ابن وهب، أخبرني يونس، ح قال وحدثنا إسحاق بن إبراهيم، وعبد بن حميد، قالا أخبرنا عبد الرزاق، أخبرنا معمر، ح قال وحدثنا عمرو الناقد، حدثنا يعقوب بن إبراهيم بن سعد، حدثنا أبي، عن صالح، كلهم عن الزهري، بهذا الإسناد ‏.‏ وزاد في حديث صالح ثم ما صلى بعد حتى قبضه الله عز وجل ‏.‏",
      "text_en": " This hadith has been narrated by Zuhri with the same chain of transmitters but with this addition:                     \" And he did not lead the player after this till his death.\"",
      "chain": [
        "30201",
        "30263",
        "20005",
        "30487",
        "20029",
        "20475",
        "30123",
        "30553",
        "20121",
        "20115",
        "30263",
        "20184",
        "20150"
      ]
    },
    {
      "hadith_no": "463",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، قالا حدثنا سفيان، ح قال وحدثني حرملة بن يحيى، أخبرنا ابن وهب، أخبرني يونس، ح قال وحدثنا إسحاق بن إبراهيم، وعبد بن حميد، قالا أخبرنا عبد الرزاق، أخبرنا معمر، كلهم عن الزهري، بهذا الإسناد ‏.‏ مثله ‏.‏",
      "text_en": " This hadith has been narrated by Zuhri with the same chain of transmitters.",
      "chain": [
        "30201",
        "30022",
        "20005",
        "30487",
        "20029",
        "20475",
        "30123",
        "30553",
        "20121"
      ]
    },
    {
      "hadith_no": "503",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثني إسحاق بن منصور، وعبد بن حميد، قالا أخبرنا جعفر بن عون، أخبرنا أبو عميس، ح قال وحدثني القاسم بن زكرياء، حدثنا حسين بن علي، عن زائدة، قال حدثنا مالك بن مغول، كلاهما عن عون بن أبي جحيفة، عن أبيه، عن النبي صلى الله عليه وسلم بنحو حديث سفيان وعمر بن أبي زائدة يزيد بعضهم على بعض وفي حديث مالك بن مغول فلما كان بالهاجرة خرج بلال فنادى بالصلاة ‏.‏",
      "text_en": " 'Aun b. Abu Juhaifa narrated from the Apostle of Allah (may peace be upon him) on the authority of his father a hadith like that of Sufyan, and 'Umar b. Abu Za'ida made this addition:                      Some of them tried to excel the others (in obtaining water), and in the hadith transmitted by Malik b. Mighwal (the words are): When it was noon, Bilal came out and summoned (people) to (noon) prayer.",
      "chain": [
        "30313",
        "30553",
        "20416",
        "20315",
        "20320",
        "20358",
        "11383",
        "4047"
      ]
    },
    {
      "hadith_no": "504",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا إسحاق بن إبراهيم، وعبد بن حميد، قالا أخبرنا عبد الرزاق، أخبرنا معمر، عن الزهري، بهذا الإسناد ‏.‏ ولم يذكر فيه منى ولا عرفة وقال في حجة الوداع أو يوم الفتح ‏.‏",
      "text_en": " This hadith has been reported by Ma'mar on the authority of al-Zuhri with the came chain of transmitters, but here no mention has been made of Mina or 'Arafa, and he said:                      It was in the Farewell Pilgrimage or on the Day of Victory.",
      "chain": [
        "30123",
        "30553",
        "20121",
        "20115"
      ]
    },
    {
      "hadith_no": "1198",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن رافع، وعبد بن حميد، قالا حدثنا عبد الرزاق، أخبرنا معمر، عن الزهري، عن ابن المسيب، وأبي، سلمة عن أبي هريرة، عن النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " This hadith has been narratted by Abu Huraira by another chain of transmitters.",
      "chain": [
        "30375",
        "30553",
        "20121",
        "20115",
        "11013",
        "11002",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1279",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني محمد بن رافع، وعبد بن حميد، قال عبد أخبرنا وقال ابن رافع، حدثنا عبد الرزاق، أخبرنا معمر، عن الزهري، عن ابن المسيب، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أكل من هذه الشجرة فلا يقربن مسجدنا ولا يؤذينا بريح الثوم ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      The Messenger of Allah (may peace be upon him) said: He who eats of this plant (garlic) should not approach our mosque and should not harm us with the odour of garlic.",
      "chain": [
        "30375",
        "30553",
        "20121",
        "20115",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "1337",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني محمد بن رافع، وعبد بن حميد، قال عبد أخبرنا وقال ابن رافع، حدثنا عبد الرزاق، أخبرنا معمر، عن عبيد الله بن عمر، عن نافع، عن ابن عمر، أن النبي صلى الله عليه وسلم كان إذا جلس في الصلاة وضع يديه على ركبتيه ورفع إصبعه اليمنى التي تلي الإبهام فدعا بها ويده اليسرى على ركبته اليسرى باسطها عليها ‏.‏",
      "text_en": " Ibn 'Umar reported that when the Messenger of Allah (may peace be upon him) sat for tashahhud he placed his left hand on his left knee. and his right hand on his right knee. and he raised his right finger, which is next to the thumb, making supplication in this way, and he stretched his left hand on his left knee.",
      "chain": [
        "30375",
        "30553",
        "20121",
        "20115",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1338",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا عبد بن حميد، حدثنا يونس بن محمد، حدثنا حماد بن سلمة، عن أيوب، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم كان إذا قعد في التشهد وضع يده اليسرى على ركبته اليسرى ووضع يده اليمنى على ركبته اليمنى وعقد ثلاثة وخمسين وأشار بالسبابة ‏.‏",
      "text_en": " Another version on the authority of Ibn Umar says:                      When the Messenger of Allah (may peace be upon him) sat for tashahhud, he placed his left hand on his left knee and placed his right hand on his right knee, and he formed a ring like (fifty-three) and pointed with his finger of attestation.",
      "chain": [
        "30553",
        "20393",
        "20021",
        "11015",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1404",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا عبد بن حميد، أخبرنا عبد الرزاق، أخبرنا معمر، عن الزهري، عن أبي سلمة، عن أبي هريرة، ‏.‏ بمثل حديث مالك عن زيد بن أسلم، ‏.",
      "text_en": " This hadith is narrated by Abu Huraira with another chain of transmitters.",
      "chain": [
        "30553",
        "20121",
        "20115",
        "11013",
        "10567"
      ]
    },
    {
      "hadith_no": "1529",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا محمد بن رافع، وعبد بن حميد، كلاهما عن عبد الرزاق، قال أخبرنا معمر، عن الزهري، قال حدثني محمود بن ربيع، عن عتبان بن مالك، قال أتيت رسول الله صلى الله عليه وسلم ‏.‏ وساق الحديث بمعنى حديث يونس غير أنه قال فقال رجل أين مالك بن الدخشن أو الدخيشن وزاد في الحديث قال محمود فحدثت بهذا الحديث نفرا فيهم أبو أيوب الأنصاري فقال ما أظن رسول الله صلى الله عليه وسلم قال ما قلت - قال - فحلفت إن رجعت إلى عتبان أن أسأله - قال - فرجعت إليه فوجدته شيخا كبيرا قد ذهب بصره وهو إمام قومه فجلست إلى جنبه فسألته عن هذا الحديث فحدثنيه كما حدثنيه أول مرة ‏.‏ قال الزهري ثم نزلت بعد ذلك فرائض وأمور نرى أن الأمر انتهى إليها فمن استطاع أن لا يغتر فلا يغتر ‏.‏",
      "text_en": " 'Itban b. Malik reported:                      I came to the Messenger of Allah (may peace be upon him) and the rest of the hadith is the same as narrated (above) except this that a man said: Where is Malik b. Dukhshun or Dukhaishin, and also made this addition that Mahmud said: I narrated this ver hadith to many people and among them was Abu Ayyub al-Ansari who said: I cannot think that the Messenger of Allah (may peace be upon him) could have said so as you say. He (the narrator) said: I took an oath that if I ever go to 'Itban. I would ask him about it. So I went to him and found him to be a very aged man, having lost his eyesight, but he was the Imam of the people. I sat by his side and asked about this hadith and he narrated it In the same way as he had narrated it for the first time. Then so many other obligatory acts and commands were revealed which we see having been completed. So he who wants that he should not be deceived would not be deceived.",
      "chain": [
        "30375",
        "30553",
        "20121",
        "20115",
        "11013",
        "251"
      ]
    },
    {
      "hadith_no": "1623",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثناه زهير بن حرب، حدثنا الوليد بن مسلم، عن الأوزاعي، ح وحدثناه إسحاق، وعبد بن حميد، قالا أخبرنا عبد الرزاق، أخبرنا معمر، جميعا عن الزهري، بهذا الإسناد قال بمنى ‏.‏ ولم يقل وغيره ‏.‏",
      "text_en": " A hadith like this has been reported by Zuhri, with the same chain of transmitters, and in it mention was made of Mina only, but not of other places.",
      "chain": [
        "30022",
        "20733",
        "20024",
        "30312",
        "30553",
        "20121"
      ]
    },
    {
      "hadith_no": "1642",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثناه عبد بن حميد، حدثنا سعيد بن عامر، عن شعبة، ح وحدثنا عبد بن حميد، أخبرنا عبد الرزاق، أخبرنا معمر، كلاهما عن عاصم الأحول، عن عبد الله بن الحارث، أن ابن عباس، أمر مؤذنه - في حديث معمر - في يوم جمعة في يوم مطير ‏.‏ بنحو حديثهم وذكر في حديث معمر فعله من هو خير مني ‏.‏ يعني النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " 'Abdullah b. Harith reported that the Mu'adhdhin of Ibn 'Abba said Adhan on Friday (and then made the announcement to say prayer in houses) because it was a rainy day; as it has been narrated by Ma'mar and others, and in this hadith it was mentioned:                      He who did it, i. e. the Apostle of Allah (may peace be upon him), was better than I.",
      "chain": [
        "30553",
        "20232",
        "20020",
        "30553",
        "20121",
        "11080",
        "912"
      ]
    },
    {
      "hadith_no": "1643",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثناه عبد بن حميد، حدثنا أحمد بن إسحاق الحضرمي، حدثنا وهيب، حدثنا أيوب، عن عبد الله بن الحارث، - قال وهيب لم يسمعه منه - قال أمر ابن عباس مؤذنه في يوم جمعة في يوم مطير ‏.‏ بنحو حديثهم ‏.‏",
      "text_en": " A hadith like this that Ibn 'Abbas ordered his Mu'adhdhin (to summon people to prayer and then make announcement to say prayer in their houses) on Friday which was a rainy day, has been transmitted by 'Abdullah b. Harith. Wuhaib, however, says that he did not hear it from him.",
      "chain": [
        "30553",
        "20528",
        "20299",
        "11015",
        "912"
      ]
    },
    {
      "hadith_no": "1680",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثناه عبد بن حميد، أخبرنا عبد الرزاق، أخبرنا زكرياء بن إسحاق، بهذا الإسناد مثله ‏.‏",
      "text_en": " A hadith like this has been reported by Ishaq with the same chain of transmitters.",
      "chain": [
        "30553",
        "20121"
      ]
    },
    {
      "hadith_no": "1747",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني أبو الطاهر، وحرملة، قالا أخبرنا ابن وهب، أخبرني يونس، ح وحدثنا إسحاق بن إبراهيم، وعبد بن حميد، قالا أخبرنا عبد الرزاق، أخبرنا معمر، جميعا عن الزهري، بهذا الإسناد ‏.‏ مثله غير أنهما قالا بعام واحد أو اثنين ‏.‏",
      "text_en": " Jabir b. Samura reported that the Apostle of Allah (may peace be upon him) observed (Nafl) prayer sitting before his death.",
      "chain": [
        "30487",
        "20029",
        "20475",
        "30123",
        "30553",
        "20121"
      ]
    },
    {
      "hadith_no": "1804",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا عبد بن حميد، أخبرنا أبو عاصم، أخبرنا ابن جريج، أخبرني أبو الزبير، عن جابر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أفضل الصلاة طول القنوت ‏\"‏ ‏.‏",
      "text_en": " Jabir reported:                      The Messenger of Allah (may peace be upon him) was asked about the prayer which was most excellent. He said: That in which the standing is longer. (This hadith is narrated by another chain of transmitters too.)",
      "chain": [
        "30553",
        "20241",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "1816",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا عبد بن حميد، أخبرنا عبد الرزاق، أخبرنا معمر، عن الزهري، عن أبي سلمة، عن أبي هريرة، قال كان رسول الله صلى الله عليه وسلم يرغب في قيام رمضان من غير أن يأمرهم فيه بعزيمة فيقول ‏\"‏ من قام رمضان إيمانا واحتسابا غفر له ما تقدم من ذنبه ‏\"‏ ‏.‏ فتوفي رسول الله صلى الله عليه وسلم والأمر على ذلك ثم كان الأمر على ذلك في خلافة أبي بكر وصدرا من خلافة عمر على ذلك ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      He who observed the fasts of Ramadan with faith and seeking reward (from Allah), all his previous sins would be forgiven, and he who observed prayer on Lailat-ul- Qadr with faith and seeking reward (from Allah), all his previous sins would be forgiven.",
      "chain": [
        "30553",
        "20121",
        "20115",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1847",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا محمد بن المثنى، ومحمد بن حاتم، وعبد بن حميد، وأبو معن الرقاشي قالوا حدثنا عمر بن يونس، حدثنا عكرمة بن عمار، حدثنا يحيى بن أبي كثير، حدثني أبو سلمة، بن عبد الرحمن بن عوف قال سألت عائشة أم المؤمنين بأى شىء كان نبي الله صلى الله عليه وسلم يفتتح صلاته إذا قام من الليل قالت كان إذا قام من الليل افتتح صلاته ‏\"‏ اللهم رب جبرائيل وميكائيل وإسرافيل فاطر السموات والأرض عالم الغيب والشهادة أنت تحكم بين عبادك فيما كانوا فيه يختلفون اهدني لما اختلف فيه من الحق بإذنك إنك تهدي من تشاء إلى صراط مستقيم ‏\"‏ ‏.‏",
      "text_en": " 'Ali b. Abu Talib reported that when the Messenger of Allah (may peace be upon him) got up at night for prayer he would say:                      I turn my face in complete devotion to One Who is the Originator of the heaven and the earth and I am not of the polytheists. Verily my prayer, my sacrifice, my living and my dying are for Allah, the Lord of the worlds; There is no partner with Him and this is what I have been commanded (to profess and believe) and I am of the believers. O Allah, Thou art the King, there is no god but Thee, Thou art my Lord, and I am Thy bondman. I wronged myself and make a confession of my Sin. Forgive all my sins, for no one forgives the sins but Thee, and guide me in the best of conduct for none but Thee guideth anyone (in) good conduct. Remove sins from me, for none else but Thou can remove sins from me. Here I am at Thy service, and Grace is to Thee and the whole of good is in Thine hand, and one cannot get nearneststo Thee through evil. My (power as well as existence) is due to Thee (Thine grace) and I turn to Thee (for supplication). Thou art blessed and Thou art exalted. I seek forgiveness from Thee and turn to Thee in repentance: and when he would bow, he would say: O Allah, it is for Thee that I bowed. I affirm my faith in Thee and I submit to Thee, and submit humbly before Thee my hearing, my eyesight, my marrow, my bone, my sinew; and when he would raise his head, he would say: O Allah, our Lord, praise is due to Thee, (the praise) with which is filled the heavens and the earth, and with which is filled that (space) which exists between them, and filled with anything that Thou desireth afterward. And when he prostrated himself, he (the Holy Prophet) would say: O Allah, it is to Thee that I prostrate myself and it is in Thee that I affirm my faith, and I submit to Thee. My face is submitted before One Who created it, and shaped it, and opened his faculties of hearing and seeing. Blessed is Allah, the best of Creators; and he would then say between Tashahhud and the pronouncing of salutation: Forgive me of the earlier and later open and secret (sins) and that where I made transgression and that Thou knowest better than I. Thou art the First and the Last. There is no god, but Thee.",
      "chain": [
        "30170",
        "38487",
        "30553",
        "30432",
        "20450",
        "10704",
        "11449",
        "10567",
        "53"
      ]
    }
  ],
  "total_hadiths": 451
}