{
  "id": "30555",
  "name": "'Ali bin al-Husain bin Waqid علي بن الحسين بن واقد المروزي",
  "full_name": "'Ali bin al-Husain bin Waqid علي بن الحسين بن واقد المروزي",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Sadooq/Delusion",
  "biography": {
    "birth": {
      "date_hijri": "135",
      "date_gregorian": "NA",
      "date_display": [
        "135 AH"
      ],
      "place": ""
    },
    "death": {
      "date_hijri": "211",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Merv"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq/Delusion] [ بخ  م  4  -  صدوق له أوهام ]"
    ],
    "tags": [
      "al-Mervzi",
      "Client"
    ]
  },
  "parents": [
    {
      "id": "20648",
      "name": "al-Husain bin Waqid ak-Mervzi الحسين بن واقد المروزي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20648",
      "name": "al-Husain bin Waqid ak-Mervzi الحسين بن واقد المروزي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [],
  "hadiths": [
    {
      "id": "sunan-abi-daud-2298",
      "hadith_no": "2298",
      "source": "Sunan Abi Da'ud",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا أحمد بن محمد المروزي، حدثني علي بن الحسين بن واقد، عن أبيه، عن يزيد النحوي، عن عكرمة، عن ابن عباس، ‏{‏ والذين يتوفون منكم ويذرون أزواجا وصية لأزواجهم متاعا إلى الحول غير إخراج ‏}‏ فنسخ ذلك بآية الميراث بما فرض لهن من الربع والثمن ونسخ أجل الحول بأن جعل أجلها أربعة أشهر وعشرا ‏.‏",
      "text_en": " The Qur’anic verse “Those of you who die and leave widows should bequeath for their widows a year’s maintenance and residence was abrogated by the verse containing the laws of succession, as one-fourth or one-eighth share was prescribed for them (i.e., the widows). The waiting period for one year was also repealed as a period of four months ten days was prescribed for them.",
      "usc_msa_ref": "",
      "chain": [
        "30304",
        "30555",
        "20648",
        "19950",
        "11023"
      ]
    },
    {
      "id": "sunan-abi-daud-3753",
      "hadith_no": "3753",
      "source": "Sunan Abi Da'ud",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا أحمد بن محمد المروزي، حدثني علي بن الحسين بن واقد، عن أبيه، عن يزيد النحوي، عن عكرمة، عن ابن عباس، قال ‏{‏ لا تأكلوا أموالكم بينكم بالباطل إلا أن تكون تجارة عن تراض منكم ‏}‏ فكان الرجل يحرج أن يأكل عند أحد من الناس بعد ما نزلت هذه الآية فنسخ ذلك الآية التي في النور قال ‏{‏ ليس عليكم جناح ‏}‏ ‏{‏ أن تأكلوا من بيوتكم ‏}‏ إلى قوله ‏{‏ أشتاتا ‏}‏ كان الرجل الغني يدعو الرجل من أهله إلى الطعام قال إني لأجنح أن آكل منه ‏.‏ والتجنح الحرج ويقول المسكين أحق به مني ‏.‏ فأحل في ذلك أن يأكلوا مما ذكر اسم الله عليه وأحل طعام أهل الكتاب ‏.‏",
      "text_en": " Narrated Abdullah Ibn Abbas:                     When the verse: \"O ye who believe! eat not up your property among yourselves in vanities, but let there be amongst you traffic and trade by mutual good will\" was revealed, a man thought it a sin to eat in the house of another man after the revelation of this verse.  Then this (injunction) was revealed by the verse in Surat an-Nur: \"No blame on you whether you eat in company or separately.\"  When a rich man (after revelation) invited a man from his people to eat food in his house, he would say: I consider it a sin to eat from it, and he said: a poor man is more entitled to it than I. The Arabic word tajannah means sin or fault. It was then declared lawful to eat something on which the name of Allah was mentioned, and it was made lawful to eat the flesh of an animal slaughtered by the people of the Book.",
      "usc_msa_ref": "",
      "chain": [
        "30304",
        "30555",
        "20648",
        "19950",
        "11023",
        "17"
      ]
    },
    {
      "id": "sunan-abi-daud-4111",
      "hadith_no": "4111",
      "source": "Sunan Abi Da'ud",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا أحمد بن محمد المروزي، حدثنا علي بن الحسين بن واقد، عن أبيه، عن يزيد النحوي، عن عكرمة، عن ابن عباس، ‏{‏ وقل للمؤمنات يغضضن من أبصارهن ‏}‏ الآية فنسخ واستثني من ذلك ‏{‏ والقواعد من النساء اللاتي لا يرجون نكاحا ‏}‏ الآية ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     The verse: \"And say to the believing women that they should lower gaze was partly abrogated by the verse: \"Such elderly women as are past the prospect of marriage.\"",
      "usc_msa_ref": "",
      "chain": [
        "30304",
        "30555",
        "20648",
        "19950",
        "11023"
      ]
    },
    {
      "id": "sunan-abi-daud-4358",
      "hadith_no": "4358",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا أحمد بن محمد المروزي، حدثنا علي بن الحسين بن واقد، عن أبيه، عن يزيد النحوي، عن عكرمة، عن ابن عباس، قال كان عبد الله بن سعد بن أبي سرح يكتب لرسول الله صلى الله عليه وسلم فأزله الشيطان فلحق بالكفار فأمر به رسول الله صلى الله عليه وسلم أن يقتل يوم الفتح فاستجار له عثمان بن عفان فأجاره رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     Abdullah ibn AbuSarh used to write (the revelation) for the Messenger of Allah (ﷺ). Satan made him slip, and he joined the infidels. The Messenger of Allah (ﷺ) commanded to kill him on the day of Conquest (of Mecca). Uthman ibn Affan sought protection for him. The Messenger of Allah (ﷺ) gave him protection.",
      "usc_msa_ref": "",
      "chain": [
        "30304",
        "30555",
        "20648",
        "19950",
        "11023",
        "17"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2621-2",
      "hadith_no": "2621",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Faith - كتاب الإيمان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "40",
      "text_ar": "حدثنا أبو عمار الحسين بن حريث، ويوسف بن عيسى، قالا حدثنا الفضل بن موسى، عن الحسين بن واقد، ح وحدثنا أبو عمار الحسين بن حريث، ومحمود بن غيلان، قالا حدثنا علي بن الحسين بن واقد، عن أبيه، ح وحدثنا محمد بن علي بن الحسن بن شقيق، ومحمود بن غيلان، قالا حدثنا علي بن الحسن بن شقيق، عن الحسين بن واقد، عن عبد الله بن بريدة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ العهد الذي بيننا وبينهم الصلاة فمن تركها فقد كفر ‏\"‏ ‏.‏ وفي الباب عن أنس وابن عباس ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏",
      "text_en": " Narrated Abdullah bin Buraidah narrated from his father:                     that the Messenger of Allah (ﷺ) said: \"The covenant between us and them is the Salat, so whoever abandons it he has committed disbelief.\"",
      "usc_msa_ref": "",
      "chain": [
        "30325",
        "30401",
        "20452",
        "20648",
        "30325",
        "30277",
        "30555",
        "20648",
        "38554",
        "30277"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3000",
      "hadith_no": "3000",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا أبو عمار الحسين بن حريث، حدثنا علي بن الحسين بن واقد، حدثني أبي، حدثني عبد الله بن بريدة، قال سمعت أبي بريدة، يقول بينما النبي صلى الله عليه وسلم يمشي إذ جاءه رجل ومعه حمار فقال يا رسول الله اركب ‏.‏ وتأخر الرجل ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لأنت أحق بصدر دابتك إلا أن تجعله لي ‏\"‏ ‏.‏ قال قد جعلته لك ‏.‏ قال فركب ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه ‏.‏ وفي الباب عن قيس بن سعد بن عبادة ‏.‏",
      "text_en": " Narrated 'Abdullah bin Buraidah:                     \"I heard my father Buraidah saying: 'I was walking with the Prophet (ﷺ) when a man came to him with a donkey, so he said: \"O Messenger of Allah! Ride\" and the man moved toward the back. The Messenger of Allah (ﷺ) said: \"No, you have more right to the front of your beast, unless you allot it for me.\" He said: \"I have allotted it for you.'\" He said: 'So he rode.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30325",
        "30555",
        "20648",
        "11432"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4053",
      "hadith_no": "4053",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا الحسين بن حريث أبو عمار المروزي، حدثنا علي بن الحسين بن واقد، حدثني أبي، حدثني عبد الله بن بريدة، قال حدثني أبي بريدة، قال أصبح رسول الله صلى الله عليه وسلم فدعا بلالا فقال ‏\"‏ يا بلال بم سبقتني إلى الجنة ما دخلت الجنة قط إلا سمعت خشخشتك أمامي دخلت البارحة الجنة فسمعت خشخشتك أمامي فأتيت على قصر مربع مشرف من ذهب فقلت لمن هذا القصر فقالوا لرجل من العرب فقلت أنا عربي لمن هذا القصر قالوا لرجل من قريش قلت أنا قرشي لمن هذا القصر قالوا لرجل من أمة محمد قلت أنا محمد لمن هذا القصر قالوا لعمر بن الخطاب ‏\"‏ ‏.‏ فقال بلال يا رسول الله ما أذنت قط إلا صليت ركعتين وما أصابني حدث قط إلا توضأت عندها ورأيت أن لله على ركعتين ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ بهما ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن جابر ومعاذ وأنس وأبي هريرة أن النبي صلى الله عليه وسلم قال ‏\"‏ رأيت في الجنة قصرا من ذهب فقلت لمن هذا فقيل لعمر بن الخطاب ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏ ومعنى هذا الحديث أني دخلت البارحة الجنة يعني رأيت في المنام كأني دخلت الجنة هكذا روي في بعض الحديث ‏.‏ ويروى عن ابن عباس أنه قال رؤيا الأنبياء وحى ‏.‏",
      "text_en": " Narrated Abu Buraidah:                     \"The Messenger of Allah (ﷺ) awoke in the morning and called for Bilal, then said: 'O Bilal! By what have you preceded me to Paradise? I have not entered Paradise at all, except that I heard your footsteps before me. I entered Paradise last night, and I heard your footsteps before me, and I came upon a square palace having balconies made of gold. So I said: 'Whose palace is this?' They said: 'A man among the Arabs.' So I said: 'I am an Arab, whose palace is this?' They said: 'A man among the Quraish.' So I said: 'I am from the Quraish, whose palace is this?' They said: 'A man from the Ummah of Muhammad (ﷺ).' So I said: 'I am Muhammad, whose palace is this?' They said: ''Umar bin Al-Khattab's.' So Bilal said: 'O Allah's Messenger! I have never called the Adhan except that I prayed two Rak'ah, and I never committed Hadath except that I performed Wudu upon that, and I considered that I owed Allah two Rak'ah.' So the Messenger of Allah (ﷺ) said: 'For those two.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30325",
        "30555",
        "20648",
        "11432"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4054",
      "hadith_no": "4054",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا الحسين بن حريث، حدثنا علي بن الحسين بن واقد، حدثني أبي، حدثني عبد الله بن بريدة، قال سمعت بريدة، يقول خرج رسول الله صلى الله عليه وسلم في بعض مغازيه فلما انصرف جاءت جارية سوداء فقالت يا رسول الله إني كنت نذرت إن ردك الله سالما أن أضرب بين يديك بالدف وأتغنى ‏.‏ فقال لها رسول الله صلى الله عليه وسلم ‏\"‏ إن كنت نذرت فاضربي وإلا فلا ‏\"‏ ‏.‏ فجعلت تضرب فدخل أبو بكر وهي تضرب ثم دخل علي وهي تضرب ثم دخل عثمان وهي تضرب ثم دخل عمر فألقت الدف تحت استها ثم قعدت عليه ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن الشيطان ليخاف منك يا عمر إني كنت جالسا وهي تضرب فدخل أبو بكر وهي تضرب ثم دخل علي وهي تضرب ثم دخل عثمان وهي تضرب فلما دخلت أنت يا عمر ألقت الدف ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من حديث بريدة وفي الباب عن عمر وسعد بن أبي وقاص وعائشة ‏.‏",
      "text_en": " Narrated Buraidah:                     \"The Messenger of Allah (ﷺ) went out for one of his expeditions, then when he came back, a black slave girl came to him and said: 'O Messenger of Allah! I took an oath that if Allah returned you safely, I would beat the Duff before you and sing.' So the Messenger of Allah (ﷺ) said to her: 'If you have taken an oath, then beat it, and if you have not then do not.' So she started to beat the Duff, and Abu Bakr entered while she was beating it. Then 'Ali entered while she was beating it, then 'Uthman entered while she was beating it. Then 'Umar entered, so she put the Duff under her, and sat upon it. So the Messenger of Allah (ﷺ) said: 'Indeed Ash-Shaitan is afraid of you O 'Umar! I was sitting while she beat it, and then Abu Bakr entered while she was beating it, then 'Ali entered while she was beating it, then 'Uthman entered while she was beating it, then when you entered O 'Umar and she put away the Duff.'",
      "usc_msa_ref": "",
      "chain": [
        "30325",
        "30555",
        "20648",
        "11432"
      ]
    },
    {
      "id": "sunan-an-nasai-3499",
      "hadith_no": "3499",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا زكريا بن يحيى، قال حدثنا إسحاق بن إبراهيم، قال أنبأنا علي بن الحسين بن واقد، قال حدثني أبي قال، أنبأنا يزيد النحوي، عن عكرمة، عن ابن عباس، في قوله ‏{‏ ما ننسخ من آية أو ننسها نأت بخير منها أو مثلها ‏}‏ وقال ‏{‏ وإذا بدلنا آية مكان آية والله أعلم بما ينزل ‏}‏ الآية وقال ‏{‏ يمحو الله ما يشاء ويثبت وعنده أم الكتاب ‏}‏ فأول ما نسخ من القرآن القبلة وقال ‏{‏ والمطلقات يتربصن بأنفسهن ثلاثة قروء ‏}‏ وقال ‏{‏ واللائي يئسن من المحيض من نسائكم إن ارتبتم فعدتهن ثلاثة أشهر ‏}‏ فنسخ من ذلك قال تعالى ‏{‏ وإن طلقتموهن من قبل أن تمسوهن ‏}‏ ‏{‏ فما لكم عليهن من عدة تعتدونها ‏}‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas with regard to Allah's saying:                      \"Whatever a Verse (revelation) do We abrogate or cause to be forgotten, We bring a better one or similar to it.\" and He said: \"And when We change a Verse in place of another --and Allah knows best what He sends down.\" and He said: \"Allah blots out what He wills and confirms (what He wills). And with Him is the Mother of the Book.\"  \"The first thing that was abrogated in the Qur'an was the Qiblah.\"And He said: \"And divorced women shall wait (as regards their marriage) for three menstrual periods.\" and He said: \"And those of your women as have passed the age of monthly courses, for them the 'Iddah, if you have doubt (about their periods), is three months.\" So (some) of that was abrogated, (according to) His, Most High, saying: \"And then divorce them before you have sexual intercourse with them, no 'Iddah have you to count in respect of them.\"",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "30555",
        "20648",
        "19950",
        "11023"
      ]
    },
    {
      "id": "sunan-an-nasai-3543",
      "hadith_no": "3543",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا زكريا بن يحيى السجزي، خياط السنة قال حدثنا إسحاق بن إبراهيم، قال حدثنا علي بن الحسين بن واقد، قال أخبرني أبي قال، حدثنا يزيد النحوي، عن عكرمة، عن ابن عباس، في قوله ‏{‏ والذين يتوفون منكم ويذرون أزواجا وصية لأزواجهم متاعا إلى الحول غير إخراج ‏}‏ نسخ ذلك بآية الميراث مما فرض لها من الربع والثمن ونسخ أجل الحول أن جعل أجلها أربعة أشهر وعشرا ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas, with regard to Allah's saying:                      \"And those of you who die and leave behind wives should bequeath for their wives a year's maintenance and residence without turning them out.\" This was abrogated by the Verse on inheritance, which allocated to her one-quarter or one-eighth. And the appointed time ('Iddah) of one year was abrogated and replaced with the ('Iddah) term of four months and ten days.",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "30555",
        "20648",
        "19950",
        "11023"
      ]
    },
    {
      "id": "sunan-an-nasai-3554",
      "hadith_no": "3554",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "حدثنا زكريا بن يحيى، قال حدثنا إسحاق بن إبراهيم، قال حدثنا علي بن الحسين بن واقد، قال حدثني أبي قال، حدثنا يزيد النحوي، عن عكرمة، عن ابن عباس، في قوله ‏{‏ ما ننسخ من آية أو ننسها نأت بخير منها أو مثلها ‏}‏ وقال ‏{‏ وإذا بدلنا آية مكان آية والله أعلم بما ينزل ‏}‏ الآية وقال ‏{‏ يمحو الله ما يشاء ويثبت وعنده أم الكتاب ‏}‏ فأول ما نسخ من القرآن القبلة وقال ‏{‏ والمطلقات يتربصن بأنفسهن ثلاثة قروء ولا يحل لهن أن يكتمن ما خلق الله في أرحامهن ‏}‏ إلى قوله ‏{‏ إن أرادوا إصلاحا ‏}‏ وذلك بأن الرجل كان إذا طلق امرأته فهو أحق برجعتها وإن طلقها ثلاثا فنسخ ذلك وقال ‏{‏ الطلاق مرتان فإمساك بمعروف أو تسريح بإحسان ‏}‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas, regarding Allah's saying:                      \"Whatever a Verse do We abrogate or cause to be forgotten, We bring a better one or similar to it.\" and \"And when We change a Verse in place of another -and Allah knows best what He sends down\" (Al-Nahl 16:101) and \"Allah blots out what He wills and confirms (what He wills). And with Him is the Mother of the Book.\" The first thing that was abrogated in the Qur'an was the Qiblah. And He said: \"And divorced women shall wait (as regards their marriage) for three menstrual periods, and it is not lawful for them to conceal what Allah has created in their wombs, if they believe in Allah and the Last Day.\" \"And their husbands have better right to take them back in that period, if they wish for reconciliation.\" -that is because when a man divorced his wife, he had more right to take her back, even if he had divorced her three times. Then (Allah) abrogated that and said: \"The divorce is twice, after that, either you retain her on reasonable terms or release her with kindness.\"",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "30555",
        "20648",
        "19950",
        "11023"
      ]
    },
    {
      "id": "sunan-an-nasai-4069",
      "hadith_no": "4069",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا زكريا بن يحيى، قال حدثنا إسحاق بن إبراهيم، قال أنبأنا علي بن الحسين بن واقد، قال أخبرني أبي، عن يزيد النحوي، عن عكرمة، عن ابن عباس، قال في سورة النحل ‏{‏ من كفر بالله من بعد إيمانه إلا من أكره ‏}‏ إلى قوله ‏{‏ لهم عذاب عظيم ‏}‏ فنسخ واستثنى من ذلك فقال ‏{‏ ثم إن ربك للذين هاجروا من بعد ما فتنوا ثم جاهدوا وصبروا إن ربك من بعدها لغفور رحيم ‏}‏ وهو عبد الله بن سعد بن أبي سرح الذي كان على مصر كان يكتب لرسول الله صلى الله عليه وسلم فأزله الشيطان فلحق بالكفار فأمر به أن يقتل يوم الفتح فاستجار له عثمان بن عفان فأجاره رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said concerning Surat An-Nahl - :                     \"Whoever disbelieved in Allah after his belief, except him who is forced thereto and whose heart is at rest with Faith; but such as open their breasts to disbelief, on them is wrath from Allah, and theirs will be a great torment.\" \"This was abrogated, and an exception was made, as Allah said: \"Then, verily, your Lord for those who emigrated after they had been put to trials and thereafter strove hard and fought (for the Cause of Allah) and were patient, verily, your Lord afterward is, Oft-Forgiving, Most Merciful.\" This was 'Abdullah bin Sa'd bin Abi As-Sarh who was the governor of Egypt and used to write to the Messenger of Allah [SAW]. The Shaitan misled him and he went and joined the unbelievers. So he (the Prophet [SAW]) commanded that he be killed on the day of the Conquest of Makkah. Then, 'Uthman bin 'Afan sought protection for him, and the Messenger of Allah [SAW] granted him protection.\"",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "30555",
        "20648",
        "19950",
        "11023",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-2126",
      "hadith_no": "2126",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Divorce - كتاب الطلاق",
      "chapter_no": "10",
      "text_ar": "حدثنا أحمد بن سعيد الدارمي، حدثنا علي بن الحسين بن واقد، حدثنا هشام بن سعد، عن الزهري، عن عروة، عن المسور بن مخرمة، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ لا طلاق قبل نكاح ولا عتق قبل ملك ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Miswar bin Makharamah that the Prophet (ﷺ) said:                     \"There is no divorce before marriage, and no manumission before taking possession.\"",
      "usc_msa_ref": "",
      "chain": [
        "30296",
        "30555",
        "20519",
        "11013",
        "10511",
        "2201"
      ]
    },
    {
      "id": "sunan-ibn-majah-2308",
      "hadith_no": "2308",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا عبد الرحمن بن بشر بن الحكم، ومحمد بن عقيل بن خويلد، قالا حدثنا علي بن الحسين بن واقد، حدثني أبي، حدثني يزيد النحوي، أن عكرمة، حدثه عن ابن عباس، قال لما قدم النبي  صلى الله عليه وسلم  المدينة كانوا من أخبث الناس كيلا فأنزل الله سبحانه ‏{ويل للمطففين}‏ فأحسنوا الكيل بعد ذلك ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"When the Prophet (ﷺ) came to Al-Madinah, they were the worst people in weights and measures. Then Allah, Glorious is He revealed: \"Woe to the Mutaffifun (those who give less in measure and weight)\",[1] and they were fair in weights and measures after that.",
      "usc_msa_ref": "",
      "chain": [
        "30356",
        "38552",
        "30555",
        "20648",
        "19950",
        "11023",
        "17"
      ]
    }
  ],
  "total_hadiths": 14
}