{
  "id": "30554",
  "name": "Abu Zara' al-Razi أبو زرعة الرازي",
  "full_name": "Abu Zara' al-Razi أبو زرعة الرازي",
  "grade": "3rd Century AH [11th generation]",
  "biography": {
    "birth": {
      "date_hijri": "200",
      "date_gregorian": "NA",
      "date_display": [
        "200 AH"
      ],
      "place": ""
    },
    "death": {
      "date_hijri": "264",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  ت  س  ق  -  ثقة ]"
    ],
    "tags": [
      "Ally B.Makhzum",
      "Client",
      "al-Razi",
      "Hafiz"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20241",
      "name": "al-Dahhak bin Mukhlad Abu 'Asim al-Nabil الضحاك بن مخلد أبو عاصم النبيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20348",
      "name": "al-Fadl bin Dakayn, Abu Na'eem الفضل بن دكين أبو نعيم الملائي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20351",
      "name": "Qabaysa bin 'Uqba bin Muhammad قبيصة بن عقبة بن محمد بن سفيان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20285",
      "name": "Muslim bin Ibrahim al-Azdy مسلم بن إبراهيم الأزدي الفراهيدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20296",
      "name": "Hisham bin 'Abdul Malik al-Tayalasi هشام بن عبد الملك أبو الوليد الطيالسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20414",
      "name": "Thabit bin Muhammad al-'Abid ثابت بن محمد العابد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20191",
      "name": "Khallad bin Yahya bin Safwan خلاد بن يحيى بن صفوان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20433",
      "name": "'Abdullah bin Salah عبد الله بن صالح بن مسلم",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20164",
      "name": "'Abdullah bin Muslima al-Qa'nabi عبد الله بن مسلمة بن قعنب القعنبي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "38507",
      "name": "Muhammad bin Sa'id bin Sabq محمد بن سعيد بن سابق",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30107",
      "name": "Muhammad bin 'Ubaidullah bin Muhammad محمد بن عبيد الله بن محمد بن زيد",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20040",
      "name": "Musa bin Isma'il al-Munqari al-Tabudhaki موسى بن إسماعيل المنقري - لتبوذكي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "36520",
      "name": "Ibrahim bin Shmas al-Ghazy إبراهيم بن شماس الغازي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30188",
      "name": "al-Hasan bin Bashr bin Slm الحسن بن بشر بن سلم",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30189",
      "name": "al-Hasan bin al-Rabi' al-Bajli الحسن بن الربيع",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30502",
      "name": "al-Hakm bin Musa الحكم بن موسى البزاز",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "37511",
      "name": "Safwan bin Salah bin Safwan صفوان بن صالح بن صفوان",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38257",
      "name": "Snyd bin Da'ud al-Msysy Abu سنيد بن داود المصيصي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "2803",
      "name": "'Abdur Rahman bin Shayba ( عبد الرحمن بن شيبة بن عثمان الحجبي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "35094",
      "name": "'Ali bin 'Abdul Hameed علي بن عبد الحميد بن مصعب",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30211",
      "name": "Muhammad bin al-Salt bin al-Hajjaj محمد بن الصلت بن الحجاج الأسدي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30239",
      "name": "Yahya bin 'Abdullah bin Bukayr يحيى بن عبد الله بن بكير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38483",
      "name": "Muhammad bin Umayya bin Aadm محمد بن أمية بن آدم",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30479",
      "name": "Mnjab bin al-Harith منجاب بن الحارث",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "35073",
      "name": "Abd al-Rhym bin Mtrf عبد الرحيم بن مطرف بن أنيس بن قدامة",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "37540",
      "name": "Hisham bin Khalid bin Yazid al-Azraq هشام بن خالد بن زيد بن مروان الأزرق",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "students": [
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]"
    },
    {
      "id": "30005",
      "name": "Imam Tirmidhi الترمذي محمد بن عيسى بن سورة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30006",
      "name": "Imam Nasa'i أحمد بن شعيب بن علي بن سنان النسائي",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30004",
      "name": "Ibn Maja ابن ماجة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30410",
      "name": "Ishaq bin Musa bin 'Abdullah bin Musa إسحاق بن موسى بن عبد الله بن موسى",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30487",
      "name": "Hrmlh bin Yahya bin حرملة بن يحيى",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30583",
      "name": "al-Rabi' bin Sulaiman الربيع بن سليمان",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38495",
      "name": "Muhammad bin Hmyd bin Hyan محمد بن حميد بن حيان",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30153",
      "name": "'Amr bin 'Ali bin Bahr al-Bahli عمرو بن علي بن بحر الباهلي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30493",
      "name": "Yonus bin 'Abdul A'la al-Sadfi يونس بن عبد الأعلى بن ميسرة الصدفي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30467",
      "name": "'Abdullah bin 'Amir عبد الله بن عامر بن زرارة الحضرمي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "37518",
      "name": "'Abdur Rahman bin 'Amr عبد الرحمن بن عمرو",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "37518",
      "name": "'Abdur Rahman bin 'Amr عبد الرحمن بن عمرو",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38566",
      "name": "Muhammad bin Awf bin Sufyan محمد بن عوف بن سفيان الطائي",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "744",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا موسى بن إسماعيل، قال حدثنا عبد الواحد بن زياد، قال حدثنا عمارة بن القعقاع، قال حدثنا أبو زرعة، قال حدثنا أبو هريرة، قال كان رسول الله صلى الله عليه وسلم يسكت بين التكبير وبين القراءة إسكاتة  قال أحسبه قال هنية  فقلت بأبي وأمي يا رسول الله، إسكاتك بين التكبير والقراءة ما تقول قال ‏\"‏ أقول اللهم باعد بيني وبين خطاياى كما باعدت بين المشرق والمغرب، اللهم نقني من الخطايا كما ينقى الثوب الأبيض من الدنس، اللهم اغسل خطاياى بالماء والثلج والبرد ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle used to keep silent between the Takbir and the recitation of Qur'an and that interval of silence used to be a short one. I said to the Prophet \"May my parents be sacrificed for you! What do you say in the pause between Takbir and recitation?\" The Prophet said, \"I say, 'Allahumma, baa`id baini wa baina khatayaya kama baa`adta baina l-mashriqi wa l-maghrib. Allahumma, naqqini min khatayaya kama yunaqqa th-thawbu l-abyadu mina d-danas. Allahumma, ighsil khatayaya bi l-maa'i wa th-thalji wa l-barad (O Allah! Set me apart from my sins (faults) as the East and West are set apart from each other and clean me from sins as a white garment is cleaned of dirt (after thorough washing). O Allah! Wash off my sins with water, snow and hail.)\"",
      "chain": [
        "20040",
        "20256",
        "11379",
        "30554",
        "13"
      ]
    },
    {
      "hadith_no": "1440",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا عبد الواحد، حدثنا عمارة بن القعقاع، حدثنا أبو زرعة، حدثنا أبو هريرة  رضى الله عنه  قال جاء رجل إلى النبي صلى الله عليه وسلم فقال يا رسول الله أى الصدقة أعظم أجرا قال ‏\"‏ أن تصدق وأنت صحيح شحيح، تخشى الفقر وتأمل الغنى، ولا تمهل حتى إذا بلغت الحلقوم قلت لفلان كذا، ولفلان كذا، وقد كان لفلان ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     A man came to the Prophet and asked, \"O Allah's Apostle! Which charity is the most superior in reward?\" He replied, \"The charity which you practice while you are healthy, niggardly and afraid of poverty and wish to become wealthy. Do not delay it to the time of approaching death and then say, 'Give so much to such and such, and so much to such and such.' And it has already belonged to such and such (as it is too late).\"",
      "chain": [
        "20040",
        "20256",
        "11379",
        "30554",
        "13"
      ]
    },
    {
      "hadith_no": "3073",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن أبي حيان، قال حدثني أبو زرعة، قال حدثني أبو هريرة  رضى الله عنه  قال قام فينا النبي صلى الله عليه وسلم فذكر الغلول فعظمه وعظم أمره قال ‏\"‏ لا ألفين أحدكم يوم القيامة على رقبته شاة لها ثغاء على رقبته فرس له حمحمة يقول يا رسول الله، أغثني‏.‏ فأقول لا أملك لك شيئا، قد أبلغتك‏.‏ وعلى رقبته بعير له رغاء، يقول يا رسول الله أغثني‏.‏ فأقول لا أملك لك شيئا، قد أبلغتك‏.‏ وعلى رقبته صامت، فيقول يا رسول الله أغثني‏.‏ فأقول لا أملك لك شيئا، قد أبلغتك‏.‏ أو على رقبته رقاع تخفق، فيقول يا رسول الله أغثني‏.‏ فأقول لا أملك لك شيئا، قد أبلغتك ‏\"‏‏.‏ وقال أيوب عن أبي حيان فرس له حمحمة‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet got up amongst us and mentioned Al Ghulul, emphasized its magnitude and declared that it was a great sin saying, \"Don't commit Ghulul for I should not like to see anyone amongst you on the Day of Ressurection, carrying over his neck a sheep that will be bleating, or carrying over his neck a horse that will be neighing. Such a man will be saying: 'O Allah's Apostle! Intercede with Allah for me,' and I will reply, 'I can't help you, for I have conveyed Allah's Message to you Nor should I like to see a man carrying over his neck, a camel that will be grunting. Such a man will say, 'O Allah's Apostle! Intercede with Allah for me, and I will say, 'I can't help you for I have conveyed Allah's Message to you,' or one carrying over his neck gold and silver and saying, 'O Allah's Apostle! Intercede with Allah for me,' and I will say, 'I can't help you for I have conveyed Allah's Message to you,' or one carrying clothes that will be fluttering, and the man will say, 'O Allah's Apostle! Intercede with Allah for me.' And I will say, 'I can't help you, for I have conveyed Allah's Message to you.\"",
      "chain": [
        "30175",
        "20031",
        "11404",
        "30554",
        "13"
      ]
    },
    {
      "hadith_no": "4680",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا عبد الواحد، حدثنا عمارة، حدثنا أبو زرعة، حدثنا أبو هريرة، رضى الله عنه قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تقوم الساعة حتى تطلع الشمس من مغربها، فإذا رآها الناس آمن من عليها، فذاك حين لا ينفع نفسا إيمانها، لم تكن آمنت من قبل ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"The Hour will not be established until the sun rises from the West: and when the people see it, then whoever will be living on the surface of the earth will have faith, and that is (the time) when no good will it do to a soul to believe then, if it believed not before.\" (6.158)",
      "chain": [
        "20040",
        "20256",
        "11379",
        "30554",
        "13"
      ]
    },
    {
      "hadith_no": "6018",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا موسى، حدثنا عبد الواحد، حدثنا عمارة، حدثنا أبو زرعة، قال دخلت مع أبي هريرة دارا بالمدينة فرأى أعلاها مصورا يصور، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ومن أظلم ممن ذهب يخلق كخلقي، فليخلقوا حبة، وليخلقوا ذرة ‏\"‏‏.‏ ثم دعا بتور من ماء فغسل يديه حتى بلغ إبطه فقلت يا أبا هريرة أشىء سمعته من رسول الله صلى الله عليه وسلم قال منتهى الحلية‏.‏",
      "text_en": " Narrated Abu Zur'a:                     l entered a house in Medina with Abu Huraira, and he saw a man making pictures at the top of the house. Abu Huraira said, \"I heard Allah's Apostle saying that Allah said, 'Who would be more unjust than the one who tries to create the like of My creatures? Let them create a grain: let them create a gnat.' \"Abu Huraira then asked for a water container and washed his arms up to his armpits. I said, \"0 Abu i Huraira! Is this something you have heard I from Allah's Apostle?\" He said, \"The limit for ablution is up to the place where the ornaments will reach on the Day of Resurrection.'",
      "chain": [
        "20040",
        "20256",
        "11379",
        "30554"
      ]
    },
    {
      "hadith_no": "232",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن المثنى، وابن، بشار جميعا عن محمد بن جعفر، عن شعبة، ح وحدثنا عبيد الله بن معاذ، - واللفظ له - حدثنا أبي، حدثنا شعبة، عن علي بن مدرك، سمع أبا زرعة، يحدث عن جده، جرير قال قال لي النبي صلى الله عليه وسلم في حجة الوداع ‏\"‏ استنصت الناس ‏\"‏ ‏.‏ ثم قال ‏\"‏ لا ترجعوا بعدي كفارا يضرب بعضكم رقاب بعض ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Jarir b. 'Abdullah that the Apostle of Allah (may peace and blessings be upon him) asked him on the occasion of the Farewell Pilgrimage to make the people silent and then said:                      Do not return to unbelief after me by striking the necks of one another.",
      "chain": [
        "30201",
        "30170",
        "20173",
        "20020",
        "13898",
        "20020",
        "11377",
        "30554",
        "4057"
      ]
    },
    {
      "hadith_no": "1384",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "قال مسلم وحدثت عن يحيى بن حسان، ويونس المؤدب، و غيرهما قالوا حدثنا عبد الواحد بن زياد، قال حدثني عمارة بن القعقاع، حدثنا أبو زرعة، قال سمعت أبا هريرة، يقول كان رسول الله صلى الله عليه وسلم إذا نهض من الركعة الثانية استفتح القراءة ب ‏{‏ الحمد لله رب العالمين‏}‏ ولم يسكت ‏.‏",
      "text_en": " Abu Huraira reported that when the Messenger of Allah (may peace be upon him) stood up for the second rak'ah he opened it with the recitation of the praise of Allah, the Lord of universe (al-Fatiha), and he did not observe silence (before the recitation of al-Fatiha).",
      "chain": [
        "20300",
        "20256",
        "11379",
        "30554",
        "13"
      ]
    },
    {
      "hadith_no": "7327",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "وحدثنا قتيبة بن سعيد، حدثنا عبد الواحد، - يعني ابن زياد - عن عمارة بن، القعقاع حدثنا أبو زرعة، قال سمعت أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ أول من يدخل الجنة ‏\"‏ ‏.‏ ح",
      "text_en": " This hadith has been narrated on the authority of Abu Huraira through another chain of transmitters that Allah's Messenger (may peace be upon him) said:                      The (members of the) first group which would get into Paradise will have their faces as bright as stars in the sky. They would neither pass water, nor void excrement, nor will they suffer from catarrh, nor will they spit, and their combs would be made of gold, and their sweat will be musk, the fuel of their brazier will be aloes, and their wives will be large-eyed maidens and their form would be alike as one single person after the form of their father (Adam) sixty cubits tall.",
      "chain": [
        "30367",
        "20256",
        "11379",
        "30554",
        "13"
      ]
    },
    {
      "hadith_no": "7509",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، حدثنا شعبة، عن أبي التياح، قال سمعت أبا زرعة، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ يهلك أمتي هذا الحى من قريش ‏\"‏ ‏.‏ قالوا فما تأمرنا قال ‏\"‏ لو أن الناس اعتزلوهم ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported that Allah's Apostle (may peace be upon him) as saying:                      This tribe of the Quraish would kill (people) of wy Ummah. They (the Companions) said: What us to do (in such a situations)? Thereupon he said: Would that the people remain aside from them (and not besmear their hand with the blood of the Muslim).",
      "chain": [
        "30201",
        "20318",
        "20020",
        "11317",
        "30554",
        "13"
      ]
    },
    {
      "hadith_no": "45",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا إبراهيم بن خالد، حدثنا أسود بن عامر، حدثنا شريك، وهذا، لفظه ح وحدثنا محمد بن عبد الله، - يعني المخرمي - حدثنا وكيع، عن شريك، عن إبراهيم بن جرير، عن المغيرة، عن أبي زرعة، عن أبي هريرة، قال كان النبي صلى الله عليه وسلم إذا أتى الخلاء أتيته بماء في تور أو ركوة فاستنجى ‏.‏ قال أبو داود في حديث وكيع ثم مسح يده على الأرض ثم أتيته بإناء آخر فتوضأ ‏.‏ قال أبو داود وحديث الأسود بن عامر أتم ‏.‏",
      "text_en": " Narrated Abu Hurayrah :                     When the Prophet (sal Allaahu alayhi wa sallam ) went to the privy, I took to him water in a small vessel  or a skin, and he cleansed himself. He then wiped his hand on the ground. I then took to him another vessel  and he performed ablution.Abu Dawud said : The tradition is transmitted by al-Aswad b. 'Amir is more perfect.",
      "chain": [
        "38072",
        "20380",
        "20587",
        "30271",
        "20032",
        "11858",
        "18002",
        "166",
        "30554",
        "13"
      ]
    },
    {
      "hadith_no": "2546",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا موسى بن مروان الرقي، حدثنا مروان بن معاوية، عن أبي حيان التيمي، حدثنا أبو زرعة، عن أبي هريرة، ‏:‏ أن رسول الله صلى الله عليه وسلم كان يسمي الأنثى من الخيل فرسا ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Messenger of Allah (ﷺ) used to name a mare a horse.",
      "chain": [
        "35154",
        "20201",
        "11404",
        "30554"
      ]
    },
    {
      "hadith_no": "541",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on the Two Eids - أَبْوَابُ الْعِيدَيْنِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الأعلى بن واصل بن عبد الأعلى الكوفي، وأبو زرعة قالا حدثنا محمد بن الصلت، عن فليح بن سليمان، عن سعيد بن الحارث، عن أبي هريرة، قال كان النبي صلى الله عليه وسلم إذا خرج يوم العيد في طريق رجع في غيره ‏.‏ قال وفي الباب عن عبد الله بن عمر وأبي رافع ‏.‏ قال أبو عيسى وحديث أبي هريرة حديث حسن غريب ‏.‏ وروى أبو تميلة ويونس بن محمد هذا الحديث عن فليح بن سليمان عن سعيد بن الحارث عن جابر بن عبد الله ‏.‏ قال وقد استحب بعض أهل العلم للإمام إذا خرج في طريق أن يرجع في غيره اتباعا لهذا الحديث وهو قول الشافعي ‏.‏ وحديث جابر كأنه أصح ‏.‏",
      "text_en": " Abu Hurairah narrated:                     \"When Allah's Messenger would go out on the day of Eid by one route, he would return by another.\"",
      "chain": [
        "30554",
        "30211",
        "20169",
        "11167",
        "13"
      ]
    },
    {
      "hadith_no": "3193",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Recitation - كتاب القراءات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "46",
      "text_ar": "حدثنا أبو زرعة، والفضل بن أبي طالب، وغير، واحد، قالوا حدثنا الحسن بن بشر، عن الحكم بن عبد الملك، عن قتادة، عن عمران بن حصين، أن النبي صلى الله عليه وسلم قرأ‏:‏ ‏(‏وترى الناس سكارى وما هم بسكارى ‏)‏ ‏.‏ قال أبو عيسى هذا حديث حسن وهكذا روى الحكم بن عبد الملك عن قتادة ‏.‏ ولا نعرف لقتادة سماعا من أحد من أصحاب النبي صلى الله عليه وسلم إلا من أنس وأبو الطفيل ‏.‏ وهو عندي حديث مختصر إنما يروى عن قتادة عن الحسن عن عمران بن حصين قال كنا مع النبي صلى الله عليه وسلم في السفر فقرأ ‏:‏ ‏(‏يا أيها الناس اتقوا ربكم ‏)‏ الحديث بطوله وحديث الحكم بن عبد الملك عندي مختصر من هذا الحديث ‏.‏",
      "text_en": " Narrated 'Imran bin Husain:                     \"The Prophet (ﷺ) recited: You shall see mankind as if in a drunken state, yet they will not be in a drunken state. (22:2)",
      "chain": [
        "30554",
        "31130",
        "30188",
        "24090",
        "11019",
        "123"
      ]
    },
    {
      "hadith_no": "4067",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا أبو زرعة، حدثنا الحسن بن بشر، حدثنا الحكم بن عبد الملك، عن قتادة، عن أنس بن مالك، قال لما أمر رسول الله صلى الله عليه وسلم ببيعة الرضوان كان عثمان بن عفان رسول رسول الله صلى الله عليه وسلم إلى أهل مكة قال فبايع الناس قال فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن عثمان في حاجة الله وحاجة رسوله ‏\"‏ ‏.‏ فضرب بإحدى يديه على الأخرى فكانت يد رسول الله صلى الله عليه وسلم لعثمان خيرا من أيديهم لأنفسهم ‏.‏ قال هذا حديث حسن صحيح غريب ‏.‏",
      "text_en": " Narrated Anas bin Malik:                     that when the Messenger of Allah (ﷺ) ordered the pledge of Ridwan, 'Uthman bin 'Affan was the messenger of the Messenger of Allah (ﷺ) to the people of Makkah. He said: \"So the Messenger of Allah (ﷺ) said: 'Indeed 'Uthman is busy with the affair of Allah and the affair of His Messenger' then he (ﷺ) put one of his hands on the other. The hand of the Messenger of Allah (ﷺ) on behalf of 'Uthman, was better than their own hands for themselves.",
      "chain": [
        "30554",
        "30188",
        "24090",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "3566",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Horses, Races and Shooting - كتاب الخيل",
      "chapter_no": "28",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال حدثنا محمد بن جعفر، قال حدثنا شعبة، ح وأنبأنا إسماعيل بن مسعود، قال حدثنا بشر، قال حدثنا شعبة، عن عبد الله بن يزيد، عن أبي زرعة، عن أبي هريرة، قال كان النبي صلى الله عليه وسلم يكره الشكال من الخيل ‏.‏ واللفظ لإسماعيل ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                      The Prophet used to dislike the Shikal among horses. And the wording is that of Isma'il.",
      "chain": [
        "30123",
        "20173",
        "20020",
        "34033",
        "20212",
        "20020",
        "1945",
        "30554",
        "13"
      ]
    }
  ],
  "total_hadiths": 15
}