{
  "id": "30567",
  "name": "Mkhld bin Khalid bin Yazid مخلد بن خالد بن يزيد الشعيري",
  "full_name": "Mkhld bin Khalid bin Yazid مخلد بن خالد بن يزيد الشعيري",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "'Asqalan",
      "Tursus"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  د  -  ثقة ]"
    ],
    "tags": [
      "'Asqalan",
      "Tursus"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20354",
      "name": "Muhammad bin Khazim al-Darir محمد بن خازم أبو معاوية الضرير",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "30212",
      "name": "Muhammad bin 'Abdullah bin Numayr محمد بن عبد الله بن نمير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20318",
      "name": "Hammad bin Usamah حماد بن أسامة - أبو أسامة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20450",
      "name": "'Umar bin Yonus bin al-Qasim عمر بن يونس بن القاسم",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "38072",
      "name": "Abu Thaur al-Kalbi إبراهيم بن خالد أبو ثور الكلبي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20121",
      "name": "'Abdur-Razzaq عبد الرزاق بن همام",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20229",
      "name": "Ruh bin 'Ubada bin al-'Ala' روح بن عبادة بن العلاء",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20472",
      "name": "Yazid bin Harun يزيد بن هارون",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]"
    },
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "30467",
      "name": "'Abdullah bin 'Amir عبد الله بن عامر بن زرارة الحضرمي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "36504",
      "name": "Ahmed bin Khalid al-Khlal أحمد بن خالد الخلال",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-muslim-2492",
      "hadith_no": "2492",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثنا مخلد بن خالد الشعيري، حدثنا سفيان، حدثني عمر بن سعيد، بهذا الإسناد ولم يذكر في الحديث علقمة بن علاثة ولا صفوان بن أمية ولم يذكر الشعر في حديثه‏.‏",
      "text_en": " This hadith has been narrated by Sa'id with the same chain of transmitters, but no mention has been made of Alqama b. 'Ulatha, nor of safwin b. Umayya, and he did not mention the verse in his hadith.",
      "usc_msa_ref": "",
      "chain": [
        "30567",
        "20005",
        "10652"
      ]
    },
    {
      "id": "sunan-abi-daud-235",
      "hadith_no": "235",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عمرو بن عثمان، حدثنا محمد بن حرب، حدثنا الزبيدي، ح وحدثنا عياش بن الأزرق، أخبرنا ابن وهب، عن يونس، ح وحدثنا مخلد بن خالد، حدثنا إبراهيم بن خالد، - إمام مسجد صنعاء - حدثنا رباح، عن معمر، ح وحدثنا مؤمل بن الفضل، حدثنا الوليد، عن الأوزاعي، كلهم عن الزهري، عن أبي سلمة، عن أبي هريرة، قال أقيمت الصلاة وصف الناس صفوفهم فخرج رسول الله صلى الله عليه وسلم حتى إذا قام في مقامه ذكر أنه لم يغتسل فقال للناس ‏\"‏ مكانكم ‏\"‏ ‏.‏ ثم رجع إلى بيته فخرج علينا ينطف رأسه وقد اغتسل ونحن صفوف ‏.‏ وهذا لفظ ابن حرب وقال عياش في حديثه فلم نزل قياما ننتظره حتى خرج علينا وقد اغتسل ‏.‏",
      "text_en": " Abu Hurairah reported:                      The prayer (in congregation) began and people stood in their rows. The Messenger of Allah (May peace be upon him) came out (from his residence). When he stood at his proper place he recalled that he did not take a bath. He then said to the people: (Remain standing) at your places. Then he returned to his house and came out upon us after taking a bath while the drops of water were coming down from his head. We were standing in the rows (of prayer). This is the version of Ibn Harb. ‘Ayyash reported in his version: we kept on waiting for him while we were standing until he came upon us after he had taken a bath.",
      "usc_msa_ref": "",
      "chain": [
        "10581",
        "30373",
        "20459",
        "20029",
        "20475",
        "30567",
        "38072",
        "20115",
        "38659",
        "20733",
        "20024",
        "11013",
        "10567"
      ]
    },
    {
      "id": "sunan-abi-daud-356",
      "hadith_no": "356",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا مخلد بن خالد، حدثنا عبد الرزاق، أخبرنا ابن جريج، قال أخبرت عن عثيم بن كليب، عن أبيه، عن جده، أنه جاء إلى النبي صلى الله عليه وسلم فقال قد أسلمت ‏.‏ فقال له النبي صلى الله عليه وسلم ‏\"‏ ألق عنك شعر الكفر ‏\"‏ ‏.‏ يقول احلق ‏.‏ قال وأخبرني آخر أن النبي صلى الله عليه وسلم قال لآخر معه ‏\"‏ ألق عنك شعر الكفر واختتن ‏\"‏ ‏.‏",
      "text_en": " 'Uthaim b. Kulaib reported from his father (Kuthair) on the authority of his grandfather (Kulaib) that he came to the Prophet (ﷺ):                      I have embraced Islam. The Prophet (ﷺ) said to him: Remove from yourself the hair that grew during of unbelief, saying \"shave them\". He further says that another person (other than the grandfather of 'Uthaim) reported to him that the Prophet (ﷺ) said to another person who accompanied him: Remove from yourself the hair that grew during the period of unbelief and get yourself circumcised.",
      "usc_msa_ref": "",
      "chain": [
        "30567",
        "20121",
        "11070",
        "19831"
      ]
    },
    {
      "id": "sunan-abi-daud-933",
      "hadith_no": "933",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مخلد بن خالد الشعيري، حدثنا ابن نمير، حدثنا علي بن صالح، عن سلمة بن كهيل، عن حجر بن عنبس، عن وائل بن حجر، أنه صلى خلف رسول الله صلى الله عليه وسلم فجهر بآمين وسلم عن يمينه وعن شماله حتى رأيت بياض خده ‏.‏",
      "text_en": " Wail b, hujr said that he prayed behind the Messenger of Allah (ﷺ),and he said Amin loudly and saluted at his right and left sides until I saw the whiteness of his cheek.",
      "usc_msa_ref": "",
      "chain": [
        "30567",
        "30212",
        "20593",
        "11350",
        "15084",
        "3045"
      ]
    },
    {
      "id": "sunan-abi-daud-1082",
      "hadith_no": "1082",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مخلد بن خالد، حدثنا أبو عاصم، عن يزيد بن أبي عبيد، عن سلمة بن الأكوع، قال كان بين منبر رسول الله صلى الله عليه وسلم وبين الحائط كقدر ممر الشاة ‏.‏",
      "text_en": " Salamah b. al-Akwa' said:                      The space between the pulpit of the Messenger of Allah (ﷺ) and the wall (of the mosque) was such that a goat could pass.",
      "usc_msa_ref": "",
      "chain": [
        "30567",
        "20241",
        "11450",
        "237"
      ]
    },
    {
      "id": "sunan-abi-daud-1324",
      "hadith_no": "1324",
      "source": "Sunan Abi Da'ud",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا مخلد بن خالد، حدثنا إبراهيم، - يعني ابن خالد - عن رباح بن زيد، عن معمر، عن أيوب، عن ابن سيرين، عن أبي هريرة، قال ‏:‏ ‏\"‏ إذا ‏\"‏ ‏.‏ بمعناه زاد ‏:‏ ‏\"‏ ثم ليطول بعد ما شاء ‏\"‏ ‏.‏ قال أبو داود ‏:‏ روى هذا الحديث حماد بن سلمة وزهير بن معاوية وجماعة عن هشام عن محمد أوقفوه على أبي هريرة، وكذلك رواه أيوب وابن عون أوقفوه على أبي هريرة، ورواه ابن عون عن محمد قال ‏:‏ فيهما تجوز ‏.‏",
      "text_en": " This tradition has also been transmitted by Abu Hurairah through a different chain of narrators to the same effect. This version adds:                      He should then prolong it afterwards as much as he likes.Abu Dawud said: This tradition has been transmitted by Hammad b. Salamah, Zuhair b. Mu'awiyah and a group of narrators from Hisham. They transmitted it as a statement of Abu Hurairah himself (mauquf).This tradition has also been transmitted by Ibn 'Awn from Muhammad (b. Sirin). This version has the wordings: These two rak'ahs were short.",
      "usc_msa_ref": "",
      "chain": [
        "30567",
        "38072",
        "28175",
        "20115",
        "11015",
        "11035",
        "13",
        "20021"
      ]
    },
    {
      "id": "sunan-abi-daud-1372",
      "hadith_no": "1372",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Ramadan - كتاب شهر رمضان",
      "chapter_no": "6",
      "text_ar": "حدثنا مخلد بن خالد، وابن أبي خلف، - المعنى - قالا حدثنا سفيان، عن الزهري، عن أبي سلمة، عن أبي هريرة، يبلغ به النبي صلى الله عليه وسلم ‏\"‏ من صام رمضان إيمانا واحتسابا غفر له ما تقدم من ذنبه ومن قام ليلة القدر إيمانا واحتسابا غفر له ما تقدم من ذنبه ‏\"‏ ‏.‏ قال أبو داود وكذا رواه يحيى بن أبي كثير عن أبي سلمة ومحمد بن عمرو عن أبي سلمة ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     The Prophet (ﷺ) as saying: If anyone fasts during Ramadan because of faith and in order to seek his reward from Allah, his previous sins will be forgiven to him. If anyone prays in the night of the power (lailat al-qadr) because of faith and in order to seek his reward from Allah his previous sins will be forgiven for him.Abu Dawud said: This tradition has been transmitted in a similar manner by Yahya b. Abi Kathir and Muhammad b. 'Amr from Abu Salamah.",
      "usc_msa_ref": "",
      "chain": [
        "30567",
        "30560",
        "20005",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-1718",
      "hadith_no": "1718",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Book of Lost and Found Items - كتاب اللقطة",
      "chapter_no": "10",
      "text_ar": "حدثنا مخلد بن خالد، حدثنا عبد الرزاق، أخبرنا معمر، عن عمرو بن مسلم، عن عكرمة، - أحسبه - عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏\"‏ ضالة الإبل المكتومة غرامتها ومثلها معها ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Hurayrah:                     The Prophet (ﷺ) said: He who hides a stray camel shall pay a fine, and a like compensation with it.",
      "usc_msa_ref": "",
      "chain": [
        "30567",
        "20121",
        "20115",
        "10953",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-1803",
      "hadith_no": "1803",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا الحسن بن علي، ومخلد بن خالد، ومحمد بن يحيى، - المعنى - قالوا حدثنا عبد الرزاق، أخبرنا معمر، عن ابن طاوس، عن أبيه، عن ابن عباس، أن معاوية، قال له أما علمت أني قصرت عن رسول الله صلى الله عليه وسلم بمشقص أعرابي على المروة - زاد الحسن في حديثه - لحجته ‏.‏",
      "text_en": " Ibn Abbas said that Mu'awiyah told him:                      do you not know that I clipped the hair of the head of the Messenger of Allah (ﷺ) with a broad iron arrowhead at al-Marwah? Al-Hasan added in his version: \"during his hajj.\"",
      "usc_msa_ref": "",
      "chain": [
        "30",
        "30567",
        "11222",
        "20121",
        "20115",
        "11433",
        "11053",
        "17",
        "27"
      ]
    },
    {
      "id": "sunan-abi-daud-1875",
      "hadith_no": "1875",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا مخلد بن خالد، حدثنا عبد الرزاق، أخبرنا معمر، عن الزهري، عن سالم، عن ابن عمر، أنه أخبر بقول، عائشة رضى الله عنها إن الحجر بعضه من البيت ‏.‏ فقال ابن عمر والله إني لأظن عائشة إن كانت سمعت هذا من رسول الله صلى الله عليه وسلم إني لأظن رسول الله صلى الله عليه وسلم لم يترك استلامهما إلا أنهما ليسا على قواعد البيت ولا طاف الناس وراء الحجر إلا لذلك ‏.‏",
      "text_en": " Ibn Umar was informed about the statement of Aisha that a part of al-Hijr is included in the magnitude of the Ka'bah. Ibn Umar said:                      By Allah, I think that she must have heard it from the Messenger of Allah (ﷺ). I think that the Messenger of Allah (ﷺ) had not given up touching both of them but for the reason that they were not on the foundation of the House (the Ka'bah), nor did the people circumambulate (the House) beyond al-Hijr for this reason.",
      "usc_msa_ref": "",
      "chain": [
        "30567",
        "20121",
        "20115",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "id": "sunan-abi-daud-1928",
      "hadith_no": "1928",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا شبابة، ح وحدثنا مخلد بن خالد، - المعنى - أخبرنا عثمان بن عمر، عن ابن أبي ذئب، عن الزهري، بإسناد ابن حنبل عن حماد، ومعناه، قال بإقامة واحدة لكل صلاة ولم يناد في الأولى ولم يسبح على أثر واحدة منهما ‏.‏ قال مخلد لم يناد في واحدة منهما ‏.‏",
      "text_en": " The aforesaid tradition has also been transmitted to the same effect by by Al Zuhri with a different chain of narrators beginning with Ibn Hanbal on the authority of Hammad. This version adds “With an iqamah for every prayer, he did not call adhan for the first prayer and he did not offer supererogatory prayer after any of them. The narrator Makhlad said “He did not call adhan for any of them.”",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20426",
        "30567",
        "20262",
        "20177",
        "20022"
      ]
    },
    {
      "id": "sunan-abi-daud-2131",
      "hadith_no": "2131",
      "source": "Sunan Abi Da'ud",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا مخلد بن خالد، والحسن بن علي، ومحمد بن أبي السري، - المعنى - قالوا حدثنا عبد الرزاق، أخبرنا ابن جريج، عن صفوان بن سليم، عن سعيد بن المسيب، عن رجل، من الأنصار - قال ابن أبي السري من أصحاب النبي صلى الله عليه وسلم ولم يقل من الأنصار ثم اتفقوا - يقال له بصرة قال تزوجت امرأة بكرا في سترها فدخلت عليها فإذا هي حبلى فقال النبي صلى الله عليه وسلم ‏\"‏ لها الصداق بما استحللت من فرجها والولد عبد لك فإذا ولدت ‏\"‏ ‏.‏ قال الحسن ‏\"‏ فاجلدها ‏\"‏ ‏.‏ وقال ابن أبي السري ‏\"‏ فاجلدوها ‏\"‏ ‏.‏ أو قال ‏\"‏ فحدوها ‏\"‏ ‏.‏ قال أبو داود روى هذا الحديث قتادة عن سعيد بن يزيد عن ابن المسيب ورواه يحيى بن أبي كثير عن يزيد بن نعيم عن سعيد بن المسيب وعطاء الخراساني عن سعيد بن المسيب أرسلوه كلهم ‏.‏ وفي حديث يحيى بن أبي كثير أن بصرة بن أكثم نكح امرأة وكلهم قال في حديثه جعل الولد عبدا له ‏.‏",
      "text_en": " A man from the Ansar called Basrah said:                      I married a virgin woman in her veil. When I entered upon her, I found her pregnant. (I mentioned this to the Prophet). The Prophet (ﷺ) said: She will get the dower, for you made her vagina lawful for you. The child will be your slave. When she has begotten (a child), flog her (according to the version of al-Hasan). The version of Ibn AbusSari has: You people, flog her, or said: inflict hard punishment on him.Abu Dawud said: This tradition has been transmitted by Qatadah from Sa'd b. Yazid on the authority of Ibn al-Musayyab in a similar way. This tradition has been narrated by Yahya b. Abi Kathir from Yazid b. Nu'aim from Sa'id b. al-Musayyab, and 'Ata al-Khurasani narrated it from Sa'id b. al-Musayyab ; they all narrated this tradition from the Prophet (ﷺ) omitting the link of the Companion (i.e. a mursal tradition). The version of Yahya b. Abi Kathir has: Basrah b. Aktham married a woman. The agreed version has: He made the child his servant.",
      "usc_msa_ref": "",
      "chain": [
        "30567",
        "30",
        "20121",
        "11070",
        "11177",
        "11002"
      ]
    },
    {
      "id": "sunan-abi-daud-2255",
      "hadith_no": "2255",
      "source": "Sunan Abi Da'ud",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا مخلد بن خالد الشعيري، حدثنا سفيان، عن عاصم بن كليب، عن أبيه، عن ابن عباس، أن النبي صلى الله عليه وسلم أمر رجلا حين أمر المتلاعنين أن يتلاعنا أن يضع يده على فيه عند الخامسة يقول إنها موجبة ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     When the Prophet (ﷺ) ordered a man and his wife to invoke curses on each other, he ordered a man to put his hand on his mouth when he came to the fifth utterance, saying that it would be the deciding one.",
      "usc_msa_ref": "",
      "chain": [
        "30567",
        "20005",
        "10778",
        "19941",
        "17"
      ]
    },
    {
      "id": "sunan-abi-daud-2290",
      "hadith_no": "2290",
      "source": "Sunan Abi Da'ud",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا مخلد بن خالد، حدثنا عبد الرزاق، عن معمر، عن الزهري، عن عبيد الله، قال أرسل مروان إلى فاطمة فسألها فأخبرته أنها كانت عند أبي حفص وكان النبي صلى الله عليه وسلم أمر علي بن أبي طالب - يعني على بعض اليمن - فخرج معه زوجها فبعث إليها بتطليقة كانت بقيت لها وأمر عياش بن أبي ربيعة والحارث بن هشام أن ينفقا عليها فقالا والله ما لها نفقة إلا أن تكون حاملا ‏.‏ فأتت النبي صلى الله عليه وسلم فقال ‏\"‏ لا نفقة لك إلا أن تكوني حاملا ‏\"‏ ‏.‏ واستأذنته في الانتقال فأذن لها فقالت أين أنتقل يا رسول الله قال ‏\"‏ عند ابن أم مكتوم ‏\"‏ ‏.‏ وكان أعمى تضع ثيابها عنده ولا يبصرها فلم تزل هناك حتى مضت عدتها فأنكحها النبي صلى الله عليه وسلم أسامة فرجع قبيصة إلى مروان فأخبره بذلك فقال مروان لم نسمع هذا الحديث إلا من امرأة فسنأخذ بالعصمة التي وجدنا الناس عليها فقالت فاطمة حين بلغها ذلك بيني وبينكم كتاب الله قال الله تعالى ‏{‏ فطلقوهن لعدتهن ‏}‏ حتى ‏{‏ لا تدري لعل الله يحدث بعد ذلك أمرا ‏}‏ قالت فأى أمر يحدث بعد الثلاث قال أبو داود وكذلك رواه يونس عن الزهري وأما الزبيدي فروى الحديثين جميعا حديث عبيد الله بمعنى معمر وحديث أبي سلمة بمعنى عقيل ورواه محمد بن إسحاق عن الزهري أن قبيصة بن ذؤيب حدثه بمعنى دل على خبر عبيد الله بن عبد الله حين قال فرجع قبيصة إلى مروان فأخبره بذلك ‏.‏",
      "text_en": " ‘Ubaid Allah said “Marwan sent someone (Qabisah) to Fatimah and asked her (about  the case). She said that she was the wife of Abu Hafs. The Prophet (ﷺ) appointed ‘Ali as governor in a certain part of Yemen. Her husband also proceeded with him. From there he sent a message to her pronouncing one divorce that had yet remained. He commanded ‘Ayyash bin Abi Rabi’ah and Al Harith bin Hisham to provide maintenance to her. They said “By Allah there is no sustenance for her except in case she is pregnant.” She came to the Prophet(ﷺ) who said “There is no sustenance for you except in case you are pregnant. She then asked permission to shift (from her house) and he gave her permission.” She asked “Where should I shift. Apostle of Allaah(ﷺ)? The Apostle of Allaah(ﷺ) said to Ibn Umm Maktum . He was blind. She would undress herself and he could not see her. She lived there till her waiting period passed. The Prophet (ﷺ) married her to Usamah. Qabisah then returned to Marwan and narrated that to him. Marwan said “We did not hear this tradition except from a woman, so we shall follow the reliable practice on which we found the people”. When this reached Fatimah she said “between me and you is the Book of Allah”. Allaah the exalted said “Divorce them for their waiting period...” Thou knowest not it may be that Allaah will afterward bring some new thing to pass. She said “What a new thing will emerge after triple divorce.”Abu Dawud said “A similar tradition has been narrated by Yunus on the authority of Al Zuhri. As for Al Zubaidi he narrated both traditions, the tradition of ‘Ubaid Allah in the version of Ma’mar and the tradition of Abu Salamah in the version of ‘Aqil.”Abu Dawud said “Muhammad bin Ishaq narrated on the authority of Al Zuhri that Qabisah bin Dhuwaib transmitted to him the version which was narrated by ‘Ubaid Allah bin ‘Abd Allaah which has Qabisah then returned to Marwan and informed him about that.”",
      "usc_msa_ref": "",
      "chain": [
        "30567",
        "20121",
        "20115",
        "11013",
        "11201"
      ]
    },
    {
      "id": "sunan-abi-daud-2774",
      "hadith_no": "2774",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا مخلد بن خالد، حدثنا أبو عاصم، عن أبي بكرة، بكار بن عبد العزيز أخبرني أبي عبد العزيز، عن أبي بكرة، عن النبي صلى الله عليه وسلم أنه كان إذا جاءه أمر سرور أو بشر به خر ساجدا شاكرا لله ‏.‏",
      "text_en": " Narrated AbuBakrah:                     When anything came to the Prophet (ﷺ) which caused pleasure (or, by which he was made glad), he prostrated himself in gratitude to Allah.",
      "usc_msa_ref": "",
      "chain": [
        "30567",
        "20241",
        "3229"
      ]
    },
    {
      "id": "sunan-abi-daud-2898",
      "hadith_no": "2898",
      "source": "Sunan Abi Da'ud",
      "chapter": "Shares of Inheritance (Kitab Al-Fara'id) - كتاب الفرائض",
      "chapter_no": "19",
      "text_ar": "حدثنا أحمد بن صالح، ومخلد بن خالد، - وهذا حديث مخلد وهو الأشبع - قال حدثنا عبد الرزاق حدثنا معمر عن ابن طاوس عن أبيه عن ابن عباس قال قال رسول الله صلى الله عليه وسلم ‏\"‏ اقسم المال بين أهل الفرائض على كتاب الله فما تركت الفرائض فلأولى ذكر ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Prophet (ﷺ) said: Divide the property among those whose share have been prescribed in the Book of Allah, and what remains from the prescribed shares goes to the nearest male heirs.",
      "usc_msa_ref": "",
      "chain": [
        "30226",
        "30567",
        "20121",
        "20115",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "id": "sunan-abi-daud-3294",
      "hadith_no": "3294",
      "source": "Sunan Abi Da'ud",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا مخلد بن خالد، حدثنا عبد الرزاق، حدثنا ابن جريج، قال كتب إلى يحيى بن سعيد أخبرني عبيد الله بن زحر، مولى لبني ضمرة - وكان أيما رجل - أن أبا سعيد الرعيني أخبره بإسناد يحيى ومعناه ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Abu Sa'id al-Ru'aini with the same chain as narrated by Yahya (b. Sa'id) and to the same effect.",
      "usc_msa_ref": "",
      "chain": [
        "30567",
        "20121",
        "11070"
      ]
    },
    {
      "id": "sunan-abi-daud-3299",
      "hadith_no": "3299",
      "source": "Sunan Abi Da'ud",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا مخلد بن خالد، حدثنا عبد الرزاق، أخبرنا ابن جريج، أخبرني سعيد بن أبي أيوب، أن يزيد بن أبي حبيب، أخبره أن أبا الخير حدثه عن عقبة بن عامر الجهني، قال ‏:‏ نذرت أختي أن تمشي، إلى بيت الله، فأمرتني أن أستفتي لها رسول الله صلى الله عليه وسلم فاستفتيت النبي صلى الله عليه وسلم فقال ‏:‏ ‏\"‏ لتمش ولتركب ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Uqbah bin 'Amir al-Juhani:                     My sister took a vow to walk on foot to the House of Allah (i.e. Ka'bah). She asked me to consult the Prophet (ﷺ) about her. So I consulted the Prophet (ﷺ). He said: Let her walk and ride.",
      "usc_msa_ref": "",
      "chain": [
        "30567",
        "20121",
        "11070",
        "20375",
        "11411",
        "189"
      ]
    },
    {
      "id": "sunan-abi-daud-3306",
      "hadith_no": "3306",
      "source": "Sunan Abi Da'ud",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا مخلد بن خالد، قال حدثنا أبو عاصم، ح وحدثنا عباس العنبري، - المعنى - قال حدثنا روح، عن ابن جريج، قال أخبرني يوسف بن الحكم بن أبي سفيان، أنه سمع حفص بن عمر بن عبد الرحمن بن عوف، وعمرا، وقال، عباس ‏:‏ ابن حنة أخبراه عن عمر بن عبد الرحمن بن عوف، عن رجال، من أصحاب النبي صلى الله عليه وسلم بهذا الخبر ‏.‏ زاد فقال النبي صلى الله عليه وسلم ‏\"‏ والذي بعث محمدا بالحق لو صليت ها هنا لأجزأ عنك صلاة في بيت المقدس ‏\"‏ ‏.‏ قال أبو داود ‏:‏ رواه الأنصاري عن ابن جريج فقال جعفر بن عمرو، وقال عمرو بن حية وقال أخبراه عن عبد الرحمن بن عوف وعن رجال من أصحاب النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " The tradition mentioned above (No.3299) has also been transmitted by Umar ibn Abd al-Rahman ibn Awf on the authority of his father and the Companions of the Prophet (ﷺ). This version has:                      \"The Prophet (ﷺ) said: By Him Who sent Muhammad with truth, if you prayed here, this would be sufficient for you like the prayer in Jerusalem.\"Abu Dawud said: This tradition has also been transmitted by al-Ansari, from Ibn-Juraij. He said: Ja'far b. 'Umar and 'Amr b. Hayyah. He said: They transmitted from 'Abd al-Rahman b. 'Awf and from the Companions of the Prophet (ﷺ).",
      "usc_msa_ref": "",
      "chain": [
        "30567",
        "20241",
        "20229",
        "11070",
        "12062",
        "3",
        "10560"
      ]
    },
    {
      "id": "sunan-abi-daud-3713",
      "hadith_no": "3713",
      "source": "Sunan Abi Da'ud",
      "chapter": "Drinks (Kitab Al-Ashribah) - كتاب الأشربة",
      "chapter_no": "27",
      "text_ar": "حدثنا مخلد بن خالد، حدثنا أبو معاوية، عن الأعمش، عن أبي عمر، يحيى البهراني عن ابن عباس، قال كان ينبذ للنبي صلى الله عليه وسلم الزبيب فيشربه اليوم والغد وبعد الغد إلى مساء الثالثة ثم يأمر به فيسقى الخدم أو يهراق ‏.‏ قال أبو داود معنى يسقى الخدم يبادر به الفساد ‏.‏ قال أبو داود أبو عمر يحيى بن عبيد البهراني ‏.‏",
      "text_en": " Ibn abbas said :                      Raisins were steeped for the Prophet (ﷺ) and he would drink it in the morning and the night after, the following day and the night after. He then gave orders and it was given to servants to drinks or poured away.Abu Dawud said: That \"it was given to servants to drink\" means before it spoiled.Abu Dawud said: Abu 'Umar Yahya al-Bahrani.",
      "usc_msa_ref": "",
      "chain": [
        "30567",
        "20354",
        "11060",
        "17"
      ]
    },
    {
      "id": "sunan-abi-daud-3737",
      "hadith_no": "3737",
      "source": "Sunan Abi Da'ud",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا مخلد بن خالد، حدثنا أبو أسامة، عن عبيد الله، عن نافع، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم بمعناه زاد ‏\"‏ فإن كان مفطرا فليطعم وإن كان صائما فليدع ‏\"‏ ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Ibn ‘Umar to the same effect through a different chain of narrators. This version has the additional words:                      If he is not fasting, he should eat, and if he is fasting, he should leave it.",
      "usc_msa_ref": "",
      "chain": [
        "30567",
        "20318",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-abi-daud-3854",
      "hadith_no": "3854",
      "source": "Sunan Abi Da'ud",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا مخلد بن خالد، حدثنا عبد الرزاق، أخبرنا معمر، عن ثابت، عن أنس، أن النبي صلى الله عليه وسلم جاء إلى سعد بن عبادة فجاء بخبز وزيت فأكل ثم قال النبي صلى الله عليه وسلم ‏\"‏ أفطر عندكم الصائمون وأكل طعامكم الأبرار وصلت عليكم الملائكة ‏\"‏ ‏.‏",
      "text_en": " Narrated Anas ibn Malik:                     The Prophet (ﷺ) came to visit Sa'd ibn Ubaydah, and he brought bread and olive oil, and he ate (them). Them). Then the Prophet (ﷺ) said: May the fasting (men) break their fast with you, and the pious eat your food, and the angels pray for blessing on you.",
      "usc_msa_ref": "",
      "chain": [
        "30567",
        "20121",
        "20115",
        "11269",
        "19"
      ]
    },
    {
      "id": "sunan-abi-daud-3923",
      "hadith_no": "3923",
      "source": "Sunan Abi Da'ud",
      "chapter": "Divination and Omens (Kitab Al-Kahanah Wa Al-Tatayyur) - كتاب الكهانة و التطير",
      "chapter_no": "30",
      "text_ar": "حدثنا مخلد بن خالد، وعباس العنبري، قالا حدثنا عبد الرزاق، أخبرنا معمر، عن يحيى بن عبد الله بن بحير، قال أخبرني من، سمع فروة بن مسيك، قال قلت يا رسول الله أرض عندنا يقال لها أرض أبين هي أرض ريفنا وميرتنا وإنها وبئة أو قال وباؤها شديد ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ دعها عنك فإن من القرف التلف ‏\"‏ ‏.‏",
      "text_en": " Yahya ibn Abdullah ibn Buhayr said that he was informed by one who had heard Farwah ibn Musayk tell that he said:                      Messenger of Allah! we have land called Abyan, which is the land where we have our fields and grow our crops, but it is very unhealthy. The Prophet (ﷺ) said: Leave it, for destruction comes from being near disease.",
      "usc_msa_ref": "",
      "chain": [
        "30567",
        "30437",
        "20121",
        "20115",
        "5226"
      ]
    },
    {
      "id": "sunan-abi-daud-3944",
      "hadith_no": "3944",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Book of Manumission of Slaves - كتاب العتق",
      "chapter_no": "31",
      "text_ar": "حدثنا مخلد بن خالد، حدثنا يزيد بن هارون، أخبرنا يحيى بن سعيد، عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم بمعنى إبراهيم بن موسى ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Ibn 'Umar from the Prophet (ﷺ) to the same effect as mentioned by Ibrahim b. Musa through a different chain.",
      "usc_msa_ref": "",
      "chain": [
        "30567",
        "20472",
        "11062",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-abi-daud-4048",
      "hadith_no": "4048",
      "source": "Sunan Abi Da'ud",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا مخلد بن خالد، حدثنا روح، حدثنا سعيد بن أبي عروبة، عن قتادة، عن الحسن، عن عمران بن حصين، أن نبي الله صلى الله عليه وسلم قال ‏\"‏ لا أركب الأرجوان ولا ألبس المعصفر ولا ألبس القميص المكفف بالحرير ‏\"‏ ‏.‏ قال وأومأ الحسن إلى جيب قميصه ‏.‏ قال وقال ‏\"‏ ألا وطيب الرجال ريح لا لون له ألا وطيب النساء لون لا ريح له ‏\"‏ ‏.‏ قال سعيد أراه قال إنما حملوا قوله في طيب النساء على أنها إذا خرجت فأما إذا كانت عند زوجها فلتطيب بما شاءت ‏.‏",
      "text_en": " Narrated Imran ibn Husayn:                     The Prophet (ﷺ) said: I do not ride on purple, or wear a garment dyed with saffron, or wear shirt hemmed with silk. Pointing to the collar of his shirt al-Hasan (al-Basri) said: The perfume used by men should have an odour but no colour, and the perfume used by women should have a colour but no odour. Sa'id said: I think he said: They interpreted his tradition about perfume used by women as applying when she comes out. But when she is with her husband, she may use any perfume she wishes.",
      "usc_msa_ref": "",
      "chain": [
        "30567",
        "20229",
        "11073",
        "11019",
        "11016",
        "123"
      ]
    },
    {
      "id": "sunan-abi-daud-4185",
      "hadith_no": "4185",
      "source": "Sunan Abi Da'ud",
      "chapter": "Combing the Hair (Kitab Al-Tarajjul) - كتاب الترجل",
      "chapter_no": "35",
      "text_ar": "حدثنا مخلد بن خالد، حدثنا عبد الرزاق، أخبرنا معمر، عن ثابت، عن أنس، قال كان شعر رسول الله صلى الله عليه وسلم إلى شحمة أذنيه ‏.‏",
      "text_en": " Narrated Anas ibn Malik:                     The hair of the Messenger of Allah (ﷺ) were up to the lobes of his ears.",
      "usc_msa_ref": "",
      "chain": [
        "30567",
        "20121",
        "20115",
        "11269",
        "19"
      ]
    },
    {
      "id": "sunan-abi-daud-4395",
      "hadith_no": "4395",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا الحسن بن علي، ومخلد بن خالد، - المعنى - قالا حدثنا عبد الرزاق، أخبرنا معمر، - قال مخلد عن معمر، - عن أيوب، عن نافع، عن ابن عمر، أن امرأة، مخزومية كانت تستعير المتاع وتجحده فأمر النبي صلى الله عليه وسلم بها فقطعت يدها ‏.‏ قال أبو داود رواه جويرية عن نافع عن ابن عمر أو عن صفية بنت أبي عبيد زاد فيه وأن النبي صلى الله عليه وسلم قام خطيبا فقال ‏\"‏ هل من امرأة تائبة إلى الله عز وجل ورسوله ‏\"‏ ‏.‏ ثلاث مرات وتلك شاهدة فلم تقم ولم تتكلم ‏.‏ قال أبو داود ورواه ابن غنج عن نافع عن صفية بنت أبي عبيد قال فيه فشهد عليها ‏.‏",
      "text_en": " Ibn ‘Umar said:                      A Makhzuml  woman used to borrow goods and deny having received them, so the prophet (ﷺ) gave orders and her hand was cut off.Abu Dawud said: Juwairiyyah has transmitted it from Nafi from Ibn ‘Umar or from Safiyyah daughter of Abu ‘Ubaid. This version adds: The prophet (ﷺ) got up and gave an address saying : Is there any woman who repents to Allah, the Exalted, and to his Apostle? He said it three times, That( woman) was present there but she did not get up and speak. Ibn Ghunj transmitted it from Nafi from Safiyyah daughter of Abu ‘Ubaid. This version has : He witnessed to her.",
      "usc_msa_ref": "",
      "chain": [
        "30",
        "30567",
        "20121",
        "20115",
        "20462",
        "20115",
        "11015",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-abi-daud-4513",
      "hadith_no": "4513",
      "source": "Sunan Abi Da'ud",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا مخلد بن خالد، حدثنا عبد الرزاق، حدثنا معمر، عن الزهري، عن ابن كعب بن مالك، عن أبيه، أن أم مبشر، قالت للنبي صلى الله عليه وسلم في مرضه الذي مات فيه ما يتهم بك يا رسول الله فإني لا أتهم بابني شيئا إلا الشاة المسمومة التي أكل معك بخيبر ‏.‏ وقال النبي صلى الله عليه وسلم ‏\"‏ وأنا لا أتهم بنفسي إلا ذلك فهذا أوان قطعت أبهري ‏\"‏ ‏.‏ قال أبو داود وربما حدث عبد الرزاق بهذا الحديث مرسلا عن معمر عن الزهري عن النبي صلى الله عليه وسلم وربما حدث به عن الزهري عن عبد الرحمن بن كعب بن مالك وذكر عبد الرزاق أن معمرا كان يحدثهم بالحديث مرة مرسلا فيكتبونه ويحدثهم مرة به فيسنده فيكتبونه وكل صحيح عندنا قال عبد الرزاق فلما قدم ابن المبارك على معمر أسند له معمر أحاديث كان يوقفها ‏.‏",
      "text_en": " Narrated Ibn Ka'b b. Malik:                     On the authority of his father: Umm Mubashshir said to the Prophet (ﷺ) during the sickness of which he died: What do you think about your illness, Messenger of Allah (ﷺ)? I do not think about the illness of my son except the poisoned sheep of which he had eaten with you at Khaybar. The Prophet (ﷺ) said: And I do not think about my illness except that. This is the time when it cut off my aorta.Abu Dawud said: Sometime 'Abd al-Razzaq transmitted this tradition, omitting the link of the Companion, from Ma'mar, from al-Zuhri, from the Prophet (ﷺ), and sometimes he transmitted it from al-Zuhri from 'Abd al-Rahman b. Ka'b b. Malik, 'Abd al-Rahman mentioned that Ma'mar sometimes transmitted the tradition in a mursal form (omitting the link of the Companion), and they recorded it. And all this is correct with us. 'Abd al-Razzaq said: When Ibn al-Mubarak came to Ma'mar, he transmitted the traditions in a musnad form (with a perfect chain) which he transmitted as mauquf traditions (statements of the Companions and not of the Prophet).",
      "usc_msa_ref": "",
      "chain": [
        "30567",
        "20121",
        "20115",
        "11013",
        "1293"
      ]
    },
    {
      "id": "sunan-abi-daud-4674",
      "hadith_no": "4674",
      "source": "Sunan Abi Da'ud",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا محمد بن المتوكل العسقلاني، ومخلد بن خالد الشعيري، - المعنى - قالا حدثنا عبد الرزاق، أخبرنا معمر، عن ابن أبي ذئب، عن سعيد بن أبي سعيد، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما أدري أتبع لعين هو أم لا وما أدري أعزير نبي هو أم لا ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the Messenger of Allah (May peace be upon him) as saying :                      I do not know whether Tubba was accursed or not, and ‘Uzair (Azra was a prophet or not).",
      "usc_msa_ref": "",
      "chain": [
        "38581",
        "30567",
        "20121",
        "20115",
        "20177",
        "11168",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-4757",
      "hadith_no": "4757",
      "source": "Sunan Abi Da'ud",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا مخلد بن خالد، حدثنا عبد الرزاق، أخبرنا معمر، عن الزهري، عن سالم، عن أبيه، قال ‏:‏ قام النبي صلى الله عليه وسلم في الناس فأثنى على الله بما هو أهله، فذكر الدجال فقال ‏:‏ ‏\"‏ إني لأنذركموه، وما من نبي إلا قد أنذره قومه، لقد أنذره نوح قومه، ولكني سأقول لكم فيه قولا لم يقله نبي لقومه ‏:‏ إنه أعور وإن الله ليس بأعور ‏\"‏ ‏.‏",
      "text_en": " Ibn Umar reported:                      The Messenger of Allah (May peace be upon him) stood among the people and praised Allah in a way which is worthy of him, and mentioned the Antichrist (Dajjal), saying : I warn you of him, and there has been no prophet who has not warned his people about him, and Noah also warned his people about him. But I tell you about him a word which no Prophet had told his people : you should know that he will be blind in one eye, and Allah is not blind is one eye.",
      "usc_msa_ref": "",
      "chain": [
        "30567",
        "20121",
        "20115",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "id": "sunan-abi-daud-4773",
      "hadith_no": "4773",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا مخلد بن خالد الشعيري، حدثنا عمر بن يونس، حدثنا عكرمة، - يعني ابن عمار - قال حدثني إسحاق، - يعني ابن عبد الله بن أبي طلحة - قال قال أنس كان رسول الله صلى الله عليه وسلم من أحسن الناس خلقا فأرسلني يوما لحاجة فقلت والله لا أذهب ‏.‏ وفي نفسي أن أذهب لما أمرني به نبي الله صلى الله عليه وسلم ‏.‏ قال فخرجت حتى أمر على صبيان وهم يلعبون في السوق فإذا رسول الله صلى الله عليه وسلم قابض بقفاى من ورائي فنظرت إليه وهو يضحك فقال ‏\"‏ يا أنيس اذهب حيث أمرتك ‏\"‏ ‏.‏ قلت نعم أنا أذهب يا رسول الله ‏.‏ قال أنس والله لقد خدمته سبع سنين أو تسع سنين ما علمت قال لشىء صنعت لم فعلت كذا وكذا ‏.‏ ولا لشىء تركت هلا فعلت كذا وكذا ‏.‏",
      "text_en": " ANAS SAID:                      THE APOSTLE OF ALLAH (MAY PEACE BE UPON HIM) WAS ONE OF THE BEST OF MEN IN CHARACTER. ONE DAY HE SENT ME TO DO SOMETHING, AND I SAID: I SWEAR BY ALLAH THAT I WILL NOT GO. BUT IN MY HEART I FELT THAT I SHOULD GO TO DO WHAT THE  PROPHET OF ALLAH (MAY PEACE BE UPON HIM) HAD COMMANDED ME; SO I WENT OUT AND CAME UPON SOME BOYS WHO WERE PLAYING IN THE STREET. ALL OF A SUDDEN THE APOSTLE OF ALLAH (MAY PEACE BE UPON HIM) WHO HAD COME UP BEHIND CAUGHT ME BY THE BACK OF THE NECK, AND WHEN I LOOKED AT HIM HE WAS LAUGHING. HE SAID: GO WHERE I ORDERED YOU, LITTLE ANAS. I REPLIED : YES, I AM GOING, APOSTLE OF ALLAH! ANAS SAID: I SWEAR BY ALLAH, I SERVED HIM FOR SEVEN OR NINE YEARS, AND HE NEVER SAID TO ME ABOUT A THING WHICH I HAD DONE: WHY DID YOU DO SUCH AND SUCH? NOR ABOUT A THING WHICH I LEFT: WHY DID NOT DO SUCH AND SUCH?",
      "usc_msa_ref": "",
      "chain": [
        "30567",
        "20450",
        "10704",
        "11151",
        "19"
      ]
    },
    {
      "id": "sunan-abi-daud-4821",
      "hadith_no": "4821",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا ابن السرح، ومخلد بن خالد، قالا حدثنا سفيان، عن محمد بن المنكدر، قال حدثني من، سمع أبا هريرة، يقول قال أبو القاسم صلى الله عليه وسلم ‏\"‏ إذا كان أحدكم في الشمس ‏\"‏ ‏.‏ وقال مخلد ‏\"‏ في الفىء ‏\"‏ ‏.‏ ‏\"‏ فقلص عنه الظل وصار بعضه في الشمس وبعضه في الظل فليقم ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     AbulQasim (ﷺ) said: When one of you is in the sun (Shams)--Makhlad's version has \"fay'\"--and the shadow withdraws from him so that he is partly in sun and partly in shade, he should get up.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "30567",
        "20005",
        "11048",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-5240",
      "hadith_no": "5240",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا مخلد بن خالد، وسلمة، - يعني ابن شبيب - قالا حدثنا عبد الرزاق، أخبرنا معمر، عن عثمان بن أبي سليمان، عن رجل، من ثقيف عن عروة بن الزبير، يرفع الحديث إلى النبي صلى الله عليه وسلم نحوه ‏.‏",
      "text_en": " A similar report (as previous) was narrated from a man from Thaqif, from 'Urwah bin Az-Zubair, who attributed the Hadith to the Prophet (ﷺ).",
      "usc_msa_ref": "",
      "chain": [
        "30567",
        "30417",
        "20121",
        "20115",
        "10649",
        "10511"
      ]
    }
  ],
  "total_hadiths": 33
}