{
  "id": "30560",
  "name": "Muhammad bin Ahmed bin Abi Khalaf محمد بن أحمد بن أبي خلف",
  "full_name": "Muhammad bin Ahmed bin Abi Khalaf محمد بن أحمد بن أبي خلف",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "170",
      "date_gregorian": "NA",
      "date_display": [
        "170 AH"
      ],
      "place": ""
    },
    "death": {
      "date_hijri": "237",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Baghdad"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  د  -  ثقة ]"
    ],
    "tags": [
      "al-Salmi",
      "al-Qatay'i",
      "al-Baghdadi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20326",
      "name": "Sulaiman bin Hayan al-Azdi سليمان بن حيان الأزدي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "30112",
      "name": "Ma'n bin 'Isa bin Yahya معن بن عيسى بن يحيى",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30213",
      "name": "Muhammad bin 'Ubaid al-Tanafasi محمد بن عبيد بن أبي أمية الطنافسي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30020",
      "name": "Yahya bin Ma'in يحيى بن معين",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20184",
      "name": "Ya'qub bin Ibrahim bin Sa'd يعقوب بن إبراهيم بن سعد بن إبراهيم",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20636",
      "name": "Musa bin Da'ud al-Dby موسى بن داود الضبي أبو عبد الله",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30279",
      "name": "Mansur bin Salma bin 'Abdul 'Aziz منصور بن سلمة بن عبد العزيز",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20617",
      "name": "Yahya bin Yaman al-Jly يحيى بن يمان العجلي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30525",
      "name": "Yahya bin Ishaq يحيى بن إسحاق",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20380",
      "name": "al-'Aswad bin 'Amir Shadhan الأسود بن عامر شاذان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20411",
      "name": "Ishaq bin Yusuf bin Mrdas إسحاق بن يوسف بن مرداس",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20229",
      "name": "Ruh bin 'Ubada bin al-'Ala' روح بن عبادة بن العلاء",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30464",
      "name": "Zakaria bin 'Ady bin Zarayn زكريا بن عدي بن زريق",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30209",
      "name": "Muhammad bin Sabiq al-Tamimi محمد بن سابق التميمي",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "students": [
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]"
    },
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "30025",
      "name": "'Abdullah bin 'Abdur Rahman al-Daarimi عبد الله بن عبد الرحمن الدارمي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30467",
      "name": "'Abdullah bin 'Amir عبد الله بن عامر بن زرارة الحضرمي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30218",
      "name": "Musa bin Harun bin Bashyr موسى بن هارون بن بشير",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "519",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني محمد بن أحمد بن أبي خلف، حدثنا روح، حدثنا ابن جريج، قال أخبرني أبو الزبير، أنه سمع جابر بن عبد الله، يقول عن النبي صلى الله عليه وسلم ‏\"‏ لكل نبي دعوة قد دعا بها في أمته وخبأت دعوتي شفاعة لأمتي يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " Abu Zubair heard Jabir b. Abdullah reporting it from the Apostle of Allah (may peace be upon him):                      For every apostle was a prayer with which he prayed (to his Lord) for his Ummah, but I have reserved my prayer for the intercession of my Ummah on the Day of Resurrection.",
      "chain": [
        "30560",
        "20229",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "1300",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني محمد بن أحمد بن أبي خلف، حدثنا موسى بن داود، حدثنا سليمان بن بلال، عن زيد بن أسلم، عن عطاء بن يسار، عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا شك أحدكم في صلاته فلم يدر كم صلى ثلاثا أم أربعا فليطرح الشك وليبن على ما استيقن ثم يسجد سجدتين قبل أن يسلم فإن كان صلى خمسا شفعن له صلاته وإن كان صلى إتماما لأربع كانتا ترغيما للشيطان ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id al-Khudri reported:                      The Messenger of Allah (may peace be upon him) said: When any one of you is in doubt about his prayer and he does Dot know how much he has prayed, three or four (rak'ahs). he should cast aside his doubt and base his prayer on what he is sure of. then perform two prostrations before giving salutations. If he has prayed five rak'ahs, they will make his prayer an even number for him, and if he has prayed exactly four, they will be humiliation for the devil.",
      "chain": [
        "30560",
        "20636",
        "20160",
        "11163",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "2405",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثني محمد بن أحمد بن أبي خلف، حدثنا زكرياء بن عدي، أخبرنا عبيد الله، بن عمرو عن زيد، عن عدي بن ثابت، عن أبي حازم، عن أبي هريرة، عن النبي صلى الله عليه وسلم أنه نهى فذكر خصالا وقال ‏\"‏ من منح منيحة غدت بصدقة وراحت بصدقة صبوحها وغبوقها ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported that the Apostle of Allah (may peace be upon him) forbade (to do certain things) and then he made a mention of certain habits and said:                      He who gives a she-camel as a gift, for him is the reward (of the gift) both morn- ing and evening-a reward for drinking milk in the morning and a reward for drinking milk in the evening.",
      "chain": [
        "30560",
        "30464",
        "30024",
        "15",
        "11372",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "2702",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثني محمد بن أحمد بن أبي خلف، حدثنا روح، حدثنا أبو مالك، عبيد الله بن الأخنس أخبرني نافع، عن عبد الله بن عمر، - رضى الله عنهما - قال ذكر عند النبي صلى الله عليه وسلم صوم يوم عاشوراء ‏.‏ فذكر مثل حديث الليث بن سعد سواء ‏.‏",
      "text_en": " Abdullah b. Umar (Allah be pleased with them) reported that the day of 'Ashura was mentioned before the Apostle of Allah (may peace be upon him) and he narrated a hadith like one (narrated above).",
      "chain": [
        "30560",
        "20229",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "4075",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "وحدثني محمد بن أحمد بن أبي خلف، وحجاج بن الشاعر، قالا حدثنا أبو سلمة، الخزاعي - قال حجاج منصور بن سلمة - أخبرنا سليمان بن بلال، عن خثيم بن عراك، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا أفلس الرجل فوجد الرجل عنده سلعته بعينها فهو أحق بها ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      When a inan becomes insolvent, and the other person (seller) finds his goods intact with him, he is more entitled to get them than anyone else.",
      "chain": [
        "30560",
        "38834",
        "30279",
        "20160",
        "11504",
        "11204",
        "13"
      ]
    },
    {
      "hadith_no": "4103",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن أحمد بن أبي خلف، حدثنا روح، ح وحدثني إسحاق بن منصور، أخبرنا روح بن عبادة، حدثنا ابن جريج، أخبرني أبو الزبير، أنه سمع جابر بن عبد الله، يقول أمرنا رسول الله صلى الله عليه وسلم بقتل الكلاب حتى إن المرأة تقدم من البادية بكلبها فنقتله ثم نهى النبي صلى الله عليه وسلم عن قتلها وقال ‏\"‏ عليكم بالأسود البهيم ذي النقطتين فإنه شيطان ‏\"‏ ‏.‏",
      "text_en": " Abu Zubair heard Jabir b. 'Abdullah (Allah be pleased with him) saying:                      Allah's Messenger (may peace be upon him) ordered us to kill dogs, and we carried out this order so much so that we also kill the dog coming with a woman from the desert. Then Allah's Apostle (may peace be upon him) forbade their killing. He (the Holy Prophet further) said: It is your duty the jet-black (dog) having two spots (on the eyes), for it is a devil.",
      "chain": [
        "30560",
        "20229",
        "30313",
        "20229",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "5095",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثني محمد بن أحمد بن أبي خلف، حدثنا معن بن عيسى، حدثني معاوية، عن  عبد الرحمن بن جبير بن نفير، عن أبيه، عن أبي ثعلبة، عن النبي صلى الله عليه وسلم في الذي يدرك صيده بعد ثلاث ‏\"‏ فكله ما لم ينتن ‏\"‏ ‏.‏",
      "text_en": " Abu Tha'laba reported Allah's Apostle (may peace be upon him) as saying about one who comes three days later on the game he has shot:                      Eat it, provided it has not gone rotten.",
      "chain": [
        "30560",
        "30112",
        "27",
        "10942",
        "4056"
      ]
    },
    {
      "hadith_no": "5348",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثني محمد بن أحمد بن أبي خلف، حدثنا زكرياء بن عدي، حدثنا عبيد الله، عن زيد، عن يحيى أبي عمر النخعي، قال سأل قوم ابن عباس عن بيع الخمر، وشرائها، والتجارة فيها فقال أمسلمون أنتم قالوا نعم ‏.‏ قال فإنه لا يصلح بيعها ولا شراؤها ولا التجارة فيها ‏.‏ قال فسألوه عن النبيذ فقال خرج رسول الله صلى الله عليه وسلم في سفر ثم رجع وقد نبذ ناس من أصحابه في حناتم ونقير ودباء فأمر به فأهريق ثم أمر بسقاء فجعل فيه زبيب وماء فجعل من الليل فأصبح فشرب منه يومه ذلك وليلته المستقبلة ومن الغد حتى أمسى فشرب وسقى فلما أصبح أمر بما بقي منه فأهريق ‏.‏",
      "text_en": " Yahya Abu 'Umar al-Nakhai reported that some people asked Ibn Abbas about the sale and purchase of wine and its commerce. He asked (them):                      Are you Muslims? They said, Yes. Thereupon he said: Its sale and purchase and its trade are not permissible. They then asked him about Nabidh and he said: Allah's Messenger (may peace be upon him) went out on a journey and then came back and some persons amongst his Companions prepared Nabidh for him in green pitcher, hollow stump and gourd. He commanded it to be thrown away, and it was done accordingly. He then ordered them (to prepare it.) in a waterskin and it was prepared in that by steeping raisins in water, and it was prepared in the night. In the morning he drank out of that and on that day and then the next night, and then on the next day until the evening. He drank and gave others to drink. When it was morning (of the third night) he commanded what was left of that to be thrown away.",
      "chain": [
        "30560",
        "30464",
        "11201",
        "15"
      ]
    },
    {
      "hadith_no": "5726",
      "source": " Sahih Muslim ",
      "chapter": "The Book on General Behaviour - كتاب الآداب",
      "chapter_no": "39",
      "text_ar": "حدثنا محمد بن أحمد بن أبي خلف، حدثنا روح، حدثنا ابن جريج، أخبرني أبو الزبير أنه سمع جابر بن عبد الله، يقول أراد النبي صلى الله عليه وسلم أن ينهى عن أن يسمى بيعلى وببركة وبأفلح وبيسار وبنافع وبنحو ذلك ثم رأيته سكت بعد عنها فلم يقل شيئا ثم قبض رسول الله صلى الله عليه وسلم ولم ينه عن ذلك ثم أراد عمر أن ينهى عن ذلك ثم تركه ‏.‏",
      "text_en": " Jabir b. 'Abdullah reported:                      Allah's Messenger (may peace be upon him) decided to forbid (his followers) to name persons as Ya'la (Elevated), Baraka (Blessing), Aflah (Successful), Yasar and Nafi', but I saw that he kept silent after that and he did not say anything until Allah's Messenger (may peace be upon him) died. And he did not forbid (his followers to do this), then 'Umar decided to prohibit (people) from giving these names, but later on gave up the idea.",
      "chain": [
        "30560",
        "20229",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "5980",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "وحدثني أبو الطاهر، أخبرنا ابن وهب، أخبرني ابن جريج، ح وحدثني محمد، بن أحمد بن أبي خلف حدثنا روح، حدثنا ابن جريج، ح وحدثنا عبد بن حميد، أخبرنا  محمد بن بكر، أخبرنا ابن جريج، أخبرني عبد الحميد بن جبير بن شيبة، أن سعيد بن المسيب، أخبره أن أم شريك أخبرته أنها، استأمرت النبي صلى الله عليه وسلم في قتل الوزغان فأمر بقتلها ‏.‏ وأم شريك إحدى نساء بني عامر بن لؤى ‏.‏ اتفق لفظ حديث ابن أبي خلف وعبد بن حميد وحديث ابن وهب قريب منه ‏.‏",
      "text_en": " Umm Sharik reported that she consulted Allah's Apostle (may peace be upon him) in regard to killing of geckos, and he commanded to kill them and Umm Sharik is one of the women of Bani 'Amir b. Luwayy. This hadith has been reported through another chain of transmitters with the same meaning.",
      "chain": [
        "20029",
        "11070",
        "30560",
        "20229",
        "11070",
        "30553",
        "20277",
        "11070",
        "11255",
        "11002",
        "187"
      ]
    },
    {
      "hadith_no": "6260",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثني محمد بن أحمد بن أبي خلف، حدثنا أبو سلمة، - وهو منصور بن سلمة الخزاعي - أخبرنا ليث، عن يزيد بن الهاد، عن ابن شهاب، بهذا الإسناد مثله سواء ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Ibn Shihab with the same chain of transmitters.",
      "chain": [
        "30560",
        "30279",
        "20023",
        "11234"
      ]
    },
    {
      "hadith_no": "6511",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمد بن أحمد بن أبي خلف، حدثنا زكرياء بن عدي، أخبرنا عبيد الله، بن عمرو عن عبد الكريم، عن محمد بن المنكدر، عن جابر، قال جيء بأبي يوم أحد مجدعا فوضع بين يدى النبي صلى الله عليه وسلم ‏.‏ فذكر نحو حديثهم ‏.‏",
      "text_en": " Jabir reported:                      My father was brought in a state that his ears had been cut off and (his dead body) was placed before Allah's Apostle (may peace be upon him), the rest of the hadith is the same.",
      "chain": [
        "30560",
        "30464",
        "30024",
        "18655",
        "11048",
        "34"
      ]
    },
    {
      "hadith_no": "6898",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Destiny - كتاب القدر",
      "chapter_no": "47",
      "text_ar": "حدثني محمد بن أحمد بن أبي خلف، حدثنا يحيى بن أبي بكير، حدثنا زهير أبو خيثمة حدثني عبد الله بن عطاء، أن عكرمة بن خالد، حدثه أن أبا الطفيل حدثه قال دخلت على أبي سريحة حذيفة بن أسيد الغفاري فقال سمعت رسول الله صلى الله عليه وسلم بأذنى هاتين يقول ‏\"‏ إن النطفة تقع في الرحم أربعين ليلة ثم يتصور عليها الملك ‏\"‏ ‏.‏ قال زهير حسبته قال الذي يخلقها ‏\"‏ فيقول يا رب أذكر أو أنثى فيجعله الله ذكرا أو أنثى ثم يقول يا رب أسوي أو غير سوي فيجعله الله سويا أو غير سوي ثم يقول يا رب ما رزقه ما أجله ما خلقه ثم يجعله الله شقيا أو سعيدا ‏\"‏ ‏.‏",
      "text_en": " Abu Tufail reported:                      I visited Abu Sariha Hudhaifa b. Usaid al-Ghifari who said: I listened with these two ears of mine Allahs Messenger (may peace be upon him) as saying: The semen stays in the womb for forty nights, then the angel, gives it a shape. Zubair said: I think that he said: One who fashions that and decides whether he would be male or female. Then he (the angel) says: Would his limbs be full or imperfect? And then the Lord makes thein full and perfect or otherwise as He desires. Then he says: My Lord, what about his livelihood, and his death and what about his disposition? And then the Lord decides about his misfortune and fortune.",
      "chain": [
        "30560",
        "20365",
        "10785",
        "11709",
        "3660"
      ]
    },
    {
      "hadith_no": "176",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا قتيبة بن سعيد، ومحمد بن أحمد بن أبي خلف، قالا حدثنا سفيان، عن الزهري، عن سعيد بن المسيب، وعباد بن تميم، عن عمه، قال شكي إلى النبي صلى الله عليه وسلم الرجل يجد الشىء في الصلاة حتى يخيل إليه فقال ‏\"‏ لا ينفتل حتى يسمع صوتا أو يجد ريحا ‏\"‏ ‏.‏",
      "text_en": " 'Abbad b. Tamim reported from his uncle that a person made a complaint to the Prophet (ﷺ) that he entertained (doubt) as if something had happened to him which had rendered his ablution invalid. He (the Prophet) said:                      He should not cease (to pray) unless he hears a sound or perceives a smell (of passing wind).",
      "chain": [
        "30367",
        "30560",
        "20005",
        "11013",
        "11002",
        "639"
      ]
    },
    {
      "hadith_no": "320",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن أحمد بن أبي خلف، ومحمد بن يحيى النيسابوري، - في آخرين - قالوا حدثنا يعقوب، أخبرنا أبي، عن صالح، عن ابن شهاب، حدثني عبيد الله بن عبد الله، عن ابن عباس، عن عمار بن ياسر، أن رسول الله صلى الله عليه وسلم عرس بأولات الجيش ومعه عائشة فانقطع عقد لها من جزع ظفار فحبس الناس ابتغاء عقدها ذلك حتى أضاء الفجر وليس مع الناس ماء فتغيظ عليها أبو بكر وقال حبست الناس وليس معهم ماء فأنزل الله تعالى على رسوله صلى الله عليه وسلم رخصة التطهر بالصعيد الطيب فقام المسلمون مع رسول الله صلى الله عليه وسلم فضربوا بأيديهم إلى الأرض ثم رفعوا أيديهم ولم يقبضوا من التراب شيئا فمسحوا بها وجوههم وأيديهم إلى المناكب ومن بطون أيديهم إلى الآباط ‏.‏ زاد ابن يحيى في حديثه قال ابن شهاب في حديثه ولا يعتبر بهذا الناس ‏.‏ قال أبو داود وكذلك رواه ابن إسحاق قال فيه عن ابن عباس وذكر ضربتين كما ذكر يونس ورواه معمر عن الزهري ضربتين وقال مالك عن الزهري عن عبيد الله بن عبد الله عن أبيه عن عمار وكذلك قال أبو أويس عن الزهري وشك فيه ابن عيينة قال مرة عن عبيد الله عن أبيه أو عن عبيد الله عن ابن عباس ومرة قال عن أبيه ومرة قال عن ابن عباس اضطرب ابن عيينة فيه وفي سماعه من الزهري ولم يذكر أحد منهم في هذا الحديث الضربتين إلا من سميت ‏.‏",
      "text_en": " Narrated Ammar ibn Yasir:                     The Messenger of Allah (ﷺ) encamped at Ulat al-Jaysh and Aisha was in his company. Her necklace of onyx of Zifar was broken (and fell somewhere). The people were detained to make a search for that necklace until the dawn broke. There was no water with the people. Therefore AbuBakr became angry with her and said: You detained the people and they have no water with them.  Thereupon Allah, the Exalted, sent down revelation about it to His Apostle (ﷺ) granting concession to purify themselves with pure earth. Then the Muslims stood up with the Messenger of Allah (ﷺ) and struck the ground with their hands and then they raised their hands, and did not take any earth (in their hands). Then they wiped with them their faces and hands up to the shoulders, and from their palms up to the armpits.Ibn Yahya added in his version: Ibn Shihab said in his tradition: The people do not take this (tradition) into account.Abu Dawud said: Ibn Ishaq also reported it in a similar way. In this (version) he said on the authority of Ibn 'Abbas. He mentioned the words \"two strikes\" (i.e. striking the earth twice) as mentioned by Yunus. And Ma'mar also narrated on the authority of al-Zuhri \"two strikes\". And Malik said: From al-Zuhri from 'Ubaid Allah b. 'Abd Allah from his father on the authority of 'Ammar. Abu Uwais also reported it in a similar way on the authority of al-Zuhri. But Ibn 'Uyainah doubted it, he sometimes said: from his father, and sometimes he said: from Ibn 'Abbas. Ibn 'Uyainah was confused in it and in his hearing from al-Zuhri. No one has mentioned \"two strikes\" in this tradition except those whose names I have mentioned.",
      "chain": [
        "30560",
        "30023",
        "20184",
        "20150",
        "11176",
        "11013",
        "11004",
        "17",
        "25"
      ]
    },
    {
      "hadith_no": "827",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، وأحمد بن محمد المروزي، ومحمد بن أحمد بن أبي خلف، وعبد الله بن محمد الزهري، وابن السرح، قالوا حدثنا سفيان، عن الزهري، سمعت ابن أكيمة، يحدث سعيد بن المسيب قال سمعت أبا هريرة، يقول صلى بنا رسول الله صلى الله عليه وسلم صلاة نظن أنها الصبح بمعناه إلى قوله ‏\"‏ ما لي أنازع القرآن ‏\"‏ ‏.‏ قال أبو داود قال مسدد في حديثه قال معمر فانتهى الناس عن القراءة فيما جهر به رسول الله صلى الله عليه وسلم وقال ابن السرح في حديثه قال معمر عن الزهري قال أبو هريرة فانتهى الناس ‏.‏ وقال عبد الله بن محمد الزهري من بينهم قال سفيان وتكلم الزهري بكلمة لم أسمعها فقال معمر إنه قال فانتهى الناس ‏.‏ قال أبو داود ورواه عبد الرحمن بن إسحاق عن الزهري وانتهى حديثه إلى قوله ‏\"‏ ما لي أنازع القرآن ‏\"‏ ‏.‏ ورواه الأوزاعي عن الزهري قال فيه قال الزهري فاتعظ المسلمون بذلك فلم يكونوا يقرءون معه فيما يجهر به صلى الله عليه وسلم ‏.‏ قال أبو داود سمعت محمد بن يحيى بن فارس قال قوله فانتهى الناس ‏.‏ من كلام الزهري ‏.‏",
      "text_en": " Abu Hurairah said:                      The Messenger of Allah(May peace be upon him) led us in prayer, that was, we think, the dawn prayer, He further narrated this tradition up to the words “what is the matter with me that I have been contended with in (the recitation of ) the Qur’an.”Abu Dawud said: Musaddad in his tradition said that Ma’mar said: The people ceased to recit (the Qur’an) at the prayer in which the Messenger of Allah(May peace be upon him) recited aloud. Ibn al-Sarh said in his version that Ma’mar reported from al-Zuhrl on the authority of Ab Hurairah. Then the people ceased (to recite behind the imam).Another version says: Sufyan said: Al-Zuhrl spoke a word that I could not hear. Then Ma’mar said; He said: Then people ceased (to recite the Qur’an)Abu Dawud said: This tradition has been narrated by ‘Abd al-Raman b. Ishaq on the authority of al-Zuhrl. This version ends at the words: “What is the matter with me that I am contended with in (the recitation of ) the Qur’an. Al-Awza’ I also narrated it on the authority of al-Zuhri. This version has: Al-Zuhrl said: The Muslims took lesson from that and thenceforth they did not recite (the Qur’an) at the prayer in which he (the Prophet) recited a loud.Abu Dawud said: I heard Muhammad b. Yaya b. Faris say: The words “ the people ceased to recite (the Qur’an)” is a statement of al-zuhri.",
      "chain": [
        "30175",
        "30304",
        "30560",
        "30485",
        "20005",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "1169",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book Of The Prayer For Rain (Kitab al-Istisqa') - كتاب الاستسقاء",
      "chapter_no": "3",
      "text_ar": "حدثنا ابن أبي خلف، حدثنا محمد بن عبيد، حدثنا مسعر، عن يزيد الفقير، عن جابر بن عبد الله، قال أتت النبي صلى الله عليه وسلم بواكي فقال ‏\"‏ اللهم اسقنا غيثا مغيثا مريئا نافعا غير ضار عاجلا غير آجل ‏\"‏ ‏.‏ قال فأطبقت عليهم السماء ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     The people came to the Prophet (ﷺ) weeping (due to drought). He said (making supplication): O Allah! give us rain which will replenish us, abundant, fertilising and profitable, not injurious, granting it now without delay. He (the narrator) said: Thereupon the sky became overcast.",
      "chain": [
        "30560",
        "30213",
        "20359",
        "11665",
        "34"
      ]
    },
    {
      "hadith_no": "1372",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Ramadan - كتاب شهر رمضان",
      "chapter_no": "6",
      "text_ar": "حدثنا مخلد بن خالد، وابن أبي خلف، - المعنى - قالا حدثنا سفيان، عن الزهري، عن أبي سلمة، عن أبي هريرة، يبلغ به النبي صلى الله عليه وسلم ‏\"‏ من صام رمضان إيمانا واحتسابا غفر له ما تقدم من ذنبه ومن قام ليلة القدر إيمانا واحتسابا غفر له ما تقدم من ذنبه ‏\"‏ ‏.‏ قال أبو داود وكذا رواه يحيى بن أبي كثير عن أبي سلمة ومحمد بن عمرو عن أبي سلمة ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     The Prophet (ﷺ) as saying: If anyone fasts during Ramadan because of faith and in order to seek his reward from Allah, his previous sins will be forgiven to him. If anyone prays in the night of the power (lailat al-qadr) because of faith and in order to seek his reward from Allah his previous sins will be forgiven for him.Abu Dawud said: This tradition has been transmitted in a similar manner by Yahya b. Abi Kathir and Muhammad b. 'Amr from Abu Salamah.",
      "chain": [
        "30567",
        "30560",
        "20005",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1434",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا محمد بن أحمد بن أبي خلف، حدثنا أبو زكريا، يحيى بن إسحاق السيلحيني حدثنا حماد بن سلمة، عن ثابت، عن عبد الله بن رباح، عن أبي قتادة، أن النبي صلى الله عليه وسلم قال لأبي بكر ‏\"‏ متى توتر ‏\"‏ قال أوتر من أول الليل ‏.‏ وقال لعمر ‏\"‏ متى توتر ‏\"‏ ‏.‏ قال آخر الليل ‏.‏ فقال لأبي بكر ‏\"‏ أخذ هذا بالحزم ‏\"‏ ‏.‏ وقال لعمر ‏\"‏ أخذ هذا بالقوة ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuQatadah:                     The Prophet (ﷺ) asked AbuBakr: When do you observe the witr? He replied: I observe the witr prayer in the early hours of the night. The Prophet (ﷺ) asked Umar: When do you observe the witr? He replied: At the end of the night. He then said to AbuBakr: This has followed it with care; and he said to Umar: He has followed it with strength.",
      "chain": [
        "30560",
        "20021",
        "11269",
        "11865",
        "391"
      ]
    },
    {
      "hadith_no": "4013",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Hot Baths (Kitab Al-Hammam) - كتاب الحمَّام",
      "chapter_no": "33",
      "text_ar": "حدثنا محمد بن أحمد بن أبي خلف، حدثنا الأسود بن عامر، حدثنا أبو بكر بن عياش، عن عبد الملك بن أبي سليمان، عن عطاء، عن صفوان بن يعلى، عن أبيه، عن النبي صلى الله عليه وسلم بهذا الحديث ‏.‏ قال أبو داود الأول أتم ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Ya'la from the Prophet (ﷺ) through a different chain of narrators.Abu Dawud said:                      The former is more perfect.",
      "chain": [
        "30560",
        "20380",
        "20373",
        "10945",
        "11029",
        "11248",
        "897"
      ]
    }
  ],
  "total_hadiths": 20
}