{
  "id": "30561",
  "name": "Muhammad bin 'Abdullah bin Qahzad محمد بن عبد الله بن قهزاد",
  "full_name": "Muhammad bin 'Abdullah bin Qahzad محمد بن عبد الله بن قهزاد",
  "grade": "3rd Century AH [11th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "262",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Merv"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  -  ثقة ]"
    ],
    "tags": [
      "al-Marwazi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20291",
      "name": "al-Nadr bin Shumayl al-Maazni النضر بن شميل المازني أبو الحسن النحوي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20416",
      "name": "Ja'far bin Awn bin Ja'far جعفر بن عون بن جعفر",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20372",
      "name": "Ya'la bin 'Ubaid bin Umayya al-Tanafasi يعلى بن عبيد بن أبي أمية الطنافسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30555",
      "name": "'Ali bin al-Husain bin Waqid علي بن الحسين بن واقد المروزي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38693",
      "name": "Wahb bin Zama' al-Tamimi وهب بن زمعة التميمي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30362",
      "name": "'Ali bin al-Hasan bin Shaqayq علي بن الحسن بن شقيق",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30340",
      "name": "Salmah bin Sulaiman al-Mervazi سلمة بن سليمان المروزي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30349",
      "name": "'Abdullah bin 'Uthman - ''Aabadan عبد الله بن عثمان - عبدان",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30188",
      "name": "al-Hasan bin Bashr bin Slm الحسن بن بشر بن سلم",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "students": [
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]"
    },
    {
      "id": "20469",
      "name": "Wadah bin 'Abdullah al-Yashkari وضاح بن عبد الله اليشكري أبو عوانة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "38555",
      "name": "Muhammad bin 'Ali bin Hamza محمد بن علي بن حمزة",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1471",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن عبد الله، قال حدثني أبي قال، حدثني ثمامة، أن أنسا  رضى الله عنه  حدثه أن أبا بكر  رضى الله عنه  كتب له التي أمر الله رسوله صلى الله عليه وسلم ‏\"‏ ومن بلغت صدقته بنت مخاض وليست عنده وعنده بنت لبون فإنها تقبل منه، ويعطيه المصدق عشرين درهما أو شاتين، فإن لم يكن عنده بنت مخاض على وجهها، وعنده ابن لبون فإنه يقبل منه وليس معه شىء ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     Abu Bakr wrote to me what Allah had instructed His Apostle (p.b.u.h) to do regarding the one who had to pay one Bint Makhad (i.e. one year-old she-camel) as Zakat, and he did not have it but had got Bint Labun (two year old she-camel). (He wrote that) it could be accepted from him as Zakat, and the collector of Zakat would return him 20 Dirhams or two sheep; and if the Zakat payer had not a Bint Makhad, but he had Ibn Labun (a two year old he-camel) then it could be accepted as his Zakat, but he would not be paid anything .",
      "chain": [
        "30561",
        "11270",
        "19"
      ]
    },
    {
      "hadith_no": "1474",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن عبد الله، قال حدثني أبي قال، حدثني ثمامة، أن أنسا، حدثه أن أبا بكر  رضى الله عنه  كتب له التي فرض رسول الله صلى الله عليه وسلم ‏\"‏ وما كان من خليطين فإنهما يتراجعان بينهما بالسوية ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     Abu Bakr wrote to me what Allah's Apostle has made compulsory (regarding Zakat) and this was mentioned in it: If a property is equally owned by two partners, they should pay the combined Zakat and it will be considered that both of them have paid their Zakat equally.",
      "chain": [
        "30561",
        "11270",
        "19",
        "20436"
      ]
    },
    {
      "hadith_no": "1476",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن عبد الله، قال حدثني أبي قال، حدثني ثمامة، أن أنسا  رضى الله عنه  حدثه أن أبا بكر  رضى الله عنه  كتب له فريضة الصدقة التي أمر الله رسوله صلى الله عليه وسلم ‏\"‏ من بلغت عنده من الإبل صدقة الجذعة، وليست عنده جذعة وعنده حقة، فإنها تقبل منه الحقة ويجعل معها شاتين إن استيسرتا له أو عشرين درهما، ومن بلغت عنده صدقة الحقة وليست عنده الحقة وعنده الجذعة، فإنها تقبل منه الجذعة، ويعطيه المصدق عشرين درهما أو شاتين، ومن بلغت عنده صدقة الحقة وليست عنده إلا بنت لبون فإنها تقبل منه بنت لبون، ويعطي شاتين أو عشرين درهما، ومن بلغت صدقته بنت لبون وعنده حقة فإنها تقبل منه الحقة ويعطيه المصدق عشرين درهما أو شاتين، ومن بلغت صدقته بنت لبون وليست عنده وعنده بنت مخاض، فإنها تقبل منه بنت مخاض ويعطي معها عشرين درهما أو شاتين ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     Abu Bakr , wrote to me about the Zakat which Allah had ordered His Apostle to observe: Whoever had to pay Jahda (Jahda means a four-year-old she-camel) as Zakat from his herd of camels and he had not got one, and he had Hiqqa (three-year-old she-camel), that Hiqqa should be accepted from him along with two sheep if they were available or twenty Dirhams (one Durham equals about 1/4 Saudi Riyal) and whoever had to pay Hiqqa as Zakat and he had no Hiqqa but had a Jadha, the Jadha should be accepted from him, and the Zakat collector should repay him twenty Dirhams or two sheep; and whoever had to pay Hiqqa as Zakat and he had not got one, but had a Bint Labun (two-year-old she-camel), it should be accepted from him along with two sheep or twenty Dirhams; and whoever had to pay Bint Labun and had a Hiqqa, that Hiqqa should be accepted from him and the Zakat collector should repay him twenty Dirhams or two sheep; and whoever had to pay Bint Labun and he had not got one but had a Bint Makhad (one-year-old she camel), that Bint Makhad should be accepted from him along with twenty Dirhams or two sheep.",
      "chain": [
        "30561",
        "11270",
        "19"
      ]
    },
    {
      "hadith_no": "1478",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن عبد الله، قال حدثني أبي قال، حدثني ثمامة، أن أنسا  رضى الله عنه  حدثه أن أبا بكر  رضى الله عنه  كتب له ‏{‏الصدقة‏}‏ التي أمر الله رسوله صلى الله عليه وسلم ‏\"‏ ولا يخرج في الصدقة هرمة، ولا ذات عوار، ولا تيس، إلا ما شاء المصدق ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     Abu Bakr wrote to me what Allah had ordered His Apostle (about Zakat) which goes: Neither an old nor a defected animal, nor a male-goat may be taken as Zakat except if the Zakat collector wishes (to take it).",
      "chain": [
        "30561",
        "11270",
        "19"
      ]
    },
    {
      "hadith_no": "2693",
      "source": " Sahih Bukhari ",
      "chapter": "Peacemaking - كتاب الصلح",
      "chapter_no": "53",
      "text_ar": "حدثنا محمد بن عبد الله، حدثنا عبد العزيز بن عبد الله الأويسي، وإسحاق بن محمد الفروي، قالا حدثنا محمد بن جعفر، عن أبي حازم، عن سهل بن سعد  رضى الله عنه أن أهل، قباء اقتتلوا حتى تراموا بالحجارة، فأخبر رسول الله صلى الله عليه وسلم بذلك فقال ‏\"‏ اذهبوا بنا نصلح بينهم ‏\"‏‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     Once the people of Quba fought with each other till they threw stones on each other. When Allah's Apostle was informed about it, he said, \"Let us go to bring about a reconciliation between them.\"",
      "chain": [
        "30561",
        "30105",
        "20173",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "2809",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا محمد بن عبد الله، حدثنا حسين بن محمد أبو أحمد، حدثنا شيبان، عن قتادة، حدثنا أنس بن مالك، أن أم الربيع بنت البراء، وهى أم حارثة بن سراقة أتت النبي صلى الله عليه وسلم فقالت يا نبي الله، ألا تحدثني عن حارثة وكان قتل يوم بدر أصابه سهم غرب، فإن كان في الجنة، صبرت، وإن كان غير ذلك اجتهدت عليه في البكاء‏.‏ قال ‏\"‏ يا أم حارثة، إنها جنان في الجنة، وإن ابنك أصاب الفردوس الأعلى ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Um Ar-Rubai'bint Al-Bara', the mother of Hartha bin Suraqa came to the Prophet and said, \"O Allah's Prophet! Will you tell me about Hartha?\" Hartha has been killed (i.e. martyred) on the day of Badr with an arrow thrown by an unidentified person. She added, \"If he is in Paradise, I will be patient; otherwise, I will weep bitterly for him.\" He said, \"O mother of Hartha! There are Gardens in Paradise and your son got the Firdausal-ala (i.e. the best place in Paradise).",
      "chain": [
        "30561",
        "20384",
        "20240",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "3703",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا الحميدي، ومحمد بن عبد الله، قالا حدثنا إبراهيم بن سعد، عن أبيه، عن محمد بن جبير بن مطعم، عن أبيه، قال أتت امرأة النبي صلى الله عليه وسلم فأمرها أن ترجع إليه‏.‏ قالت أرأيت إن جئت ولم أجدك كأنها تقول الموت‏.‏ قال عليه السلام ‏\"‏ إن لم تجديني فأتي أبا بكر ‏\"‏‏.‏",
      "text_en": " Narrated Jubair bin Mut`im:                     A woman came to the Prophet who ordered her to return to him again. She said, \"What if I came and did not find you?\" as if she wanted to say, \"If I found you dead?\" The Prophet said, \"If you should not find me, go to Abu Bakr.\"",
      "chain": [
        "30418",
        "30561",
        "20150",
        "11063",
        "11058",
        "871"
      ]
    },
    {
      "hadith_no": "4318",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا محمد بن عبد الله، حدثنا حماد بن مسعدة، عن يزيد بن أبي عبيد، عن سلمة بن الأكوع، قال غزوت مع النبي صلى الله عليه وسلم سبع غزوات‏.‏ فذكر خيبر والحديبية ويوم حنين ويوم القرد‏.‏ قال يزيد ونسيت بقيتهم‏.‏",
      "text_en": " Narrated Yazid bin Abi Ubaid:                     Salama bin Al-Akwa` said, \"I fought in seven Ghazwat along with the Prophet.\" He then mentioned Khaibar, Al-Hudaibiya, the day (i.e. battle) of Hunain and the day of Al-Qurad. I forgot the names of the other Ghazwat.",
      "chain": [
        "30561",
        "20224",
        "11450",
        "237"
      ]
    },
    {
      "hadith_no": "4776",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن عبد الله، حدثنا سعيد بن أبي مريم، أخبرنا المغيرة، قال حدثني أبو الزناد، عن الأعرج، عن أبي هريرة  رضى الله عنه  عن رسول الله صلى الله عليه وسلم قال ‏\"‏ إنه ليأتي الرجل العظيم السمين يوم القيامة لا يزن عند الله جناح بعوضة وقال اقرءوا ‏{‏فلا نقيم لهم يوم القيامة وزنا‏}‏ ‏\"‏‏.‏ وعن يحيى بن بكير عن المغيرة بن عبد الرحمن عن أبي الزناد مثله‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"On the Day of Resurrection, a huge fat man will come who will not weigh, the weight of the wing of a mosquito in Allah's Sight.\" and then the Prophet added, 'We shall not give them any weight on the Day of Resurrection ' (18.105)",
      "chain": [
        "30561",
        "30232",
        "166",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "4855",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني محمد بن عبد الله، حدثنا محمد بن عبيد الطنافسي، عن العوام، قال سألت مجاهدا عن سجدة، ص فقال سألت ابن عباس من أين سجدت فقال أوما تقرأ ‏{‏ومن ذريته داود وسليمان‏}‏ ‏{‏أولئك الذين هدى الله فبهداهم اقتده‏}‏ فكان داود ممن أمر نبيكم صلى الله عليه وسلم أن يقتدي به، فسجدها رسول الله صلى الله عليه وسلم‏.‏ ‏{‏عجاب‏}‏ عجيب‏.‏ القط الصحيفة هو ها هنا صحيفة الحسنات‏.‏ وقال مجاهد ‏{‏في عزة‏}‏ معازين‏.‏ ‏{‏الملة الآخرة‏}‏ ملة قريش‏.‏ الاختلاق الكذب‏.‏ الأسباب طرق السماء في أبوابها ‏{‏جند ما هنالك مهزوم‏}‏ يعني قريشا ‏{‏أولئك الأحزاب‏}‏ القرون الماضية‏.‏ ‏{‏فواق‏}‏ رجوع‏.‏ ‏{‏قطنا‏}‏ عذابنا ‏{‏اتخذناهم سخريا‏}‏ أحطنا بهم أتراب أمثال‏.‏ وقال ابن عباس الأيد القوة في العبادة الأبصار البصر في أمر الله، ‏{‏حب الخير عن ذكر ربي‏}‏ من ذكر‏.‏ ‏{‏طفق مسحا‏}‏ يمسح أعراف الخيل وعراقيبها‏.‏ ‏{‏الأصفاد‏}‏ الوثاق‏.‏",
      "text_en": " Narrated Al-Awwam:                     I asked Mujahid regarding the prostration in Surat Sa`d. He said, \"I asked Ibn `Abbas, 'What evidence makes you prostrate?' He said, \"Don't you recite:--'And among his progeny, David and Solomon..(6.84). Those are they whom Allah had guided. So follow their guidance.' (6.90) So David was the one of those prophets whom Prophet (Muhammad) was ordered to follow. David prostrated, so Allah's Apostle (Muhammad) performed this prostration too.'",
      "chain": [
        "30561",
        "30213",
        "11441",
        "11028"
      ]
    },
    {
      "hadith_no": "6808",
      "source": " Sahih Bukhari ",
      "chapter": "Expiation for Unfulfilled Oaths - كتاب كفارات الأيمان",
      "chapter_no": "84",
      "text_ar": "حدثني محمد بن عبد الله، حدثنا عثمان بن عمر بن فارس، أخبرنا ابن عون، عن الحسن، عن عبد الرحمن بن سمرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تسأل الإمارة، فإنك إن أعطيتها عن غير مسألة أعنت عليها، وإن أعطيتها عن مسألة وكلت إليها، وإذا حلفت على يمين فرأيت غيرها خيرا منها، فأت الذي هو خير، وكفر عن يمينك ‏\"‏‏.‏ تابعه أشهل عن ابن عون‏.‏ وتابعه يونس وسماك بن عطية وسماك بن حرب وحميد وقتادة ومنصور وهشام والربيع‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Samura:                     Allah's Apostle said, \"(O `Abdur-Rahman!) Do not seek to be a ruler, for, if you are given the authority of ruling without your asking for it, then Allah will help you; but if you are given it by your asking, then you will be held responsible for it (i.e. Allah will not help you ) . And if you take an oath to do something and later on find another thing, better than that, then do what is better and make expiation for (the dissolution of) your oath.\"",
      "chain": [
        "30561",
        "20262",
        "11071",
        "11016",
        "955"
      ]
    },
    {
      "hadith_no": "6872",
      "source": " Sahih Bukhari ",
      "chapter": "Limits and Punishments set by Allah (Hudood) - كتاب الحدود",
      "chapter_no": "86",
      "text_ar": "حدثني محمد بن عبد الله، حدثنا عاصم بن علي، حدثنا عاصم بن محمد، عن واقد بن محمد، سمعت أبي قال عبد الله، قال رسول الله صلى الله عليه وسلم في حجة الوداع ‏\"‏ ألا أى شهر تعلمونه أعظم حرمة ‏\"‏‏.‏ قالوا ألا شهرنا هذا‏.‏ قال ‏\"‏ ألا أى بلد تعلمونه أعظم حرمة ‏\"‏‏.‏ قالوا ألا بلدنا هذا‏.‏ قال ‏\"‏ ألا أى يوم تعلمونه أعظم حرمة ‏\"‏‏.‏ قالوا ألا يومنا هذا‏.‏ قال ‏\"‏ فإن الله تبارك وتعالى قد حرم دماءكم وأموالكم وأعراضكم، إلا بحقها، كحرمة يومكم هذا، في بلدكم هذا، في شهركم هذا، ألا هل بلغت ‏\"‏‏.‏  ثلاثا كل ذلك يجيبونه ألا نعم  قال ‏\"‏ ويحكم  أو ويلكم  لا ترجعن بعدي كفارا، يضرب بعضكم رقاب بعض ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     Allah Apostle said in Hajjat-al-Wada`, \"Which month (of the year) do you think is most sacred?\" The people said, \"This current month of ours (the month of Dhull-Hijja).\" He said, \"Which town (country) do you think is the most sacred?\" They said, \"This city of ours (Mecca).\" He said, \"Which day do you think is the most sacred?\" The people said, \"This day of ours.\" He then said, \"Allah, the Blessed, the Supreme, has made your blood, your property and your honor as sacred as this day of yours in this town of yours, in this month of yours (and such protection cannot be slighted) except rightfully.\" He then said thrice, \"Have I conveyed Allah's Message (to you)?\" The people answered him each time saying, 'Yes.\" The Prophet added, 'May Allah be merciful to you (or, woe on you)! Do not revert to disbelief after me by cutting the necks of each other.'",
      "chain": [
        "30561",
        "20430",
        "20163",
        "11544",
        "11217",
        "16"
      ]
    },
    {
      "hadith_no": "6994",
      "source": " Sahih Bukhari ",
      "chapter": "Blood Money (Ad-Diyat) - كتاب الديات",
      "chapter_no": "88",
      "text_ar": "حدثني محمد بن عبد الله، حدثنا محمد بن سابق، حدثنا زائدة، حدثنا هشام بن عروة، عن أبيه، أنه سمع المغيرة بن شعبة، يحدث عن عمر، أنه استشارهم في إملاص المرأة مثله‏.‏",
      "text_en": " Narrated `Urwa:                     I heard Al-Maghira bin Shu`ba narrating that `Umar had consulted them about the case of abortion (similarly as narrated in No. 42).",
      "chain": [
        "30561",
        "30209",
        "20320",
        "11065",
        "10511",
        "166",
        "3"
      ]
    },
    {
      "hadith_no": "33",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "وقال محمد بن عبد الله حدثني العباس بن أبي رزمة، قال سمعت عبد الله، يقول بيننا وبين القوم القوائم ‏.‏ يعني الإسناد ‏.‏",
      "text_en": "",
      "chain": [
        "30561",
        "20025"
      ]
    },
    {
      "hadith_no": "48",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "حدثني محمد بن عبد الله بن قهزاذ، قال سمعت عبد الله بن عثمان بن جبلة، يقول قلت لعبد الله بن المبارك من هذا الرجل الذي رويت عنه، حديث عبد الله بن عمرو ‏\"‏ يوم الفطر يوم الجوائز ‏\"‏ ‏.‏ قال سليمان بن الحجاج ‏.‏ انظر ما وضعت في يدك منه ‏.‏",
      "text_en": "",
      "chain": [
        "30561"
      ]
    },
    {
      "hadith_no": "96",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "وحدثني محمد بن عبد الله بن قهزاذ، قال سمعت أبا إسحاق الطالقاني، يقول سمعت ابن المبارك، يقول لو خيرت بين أن أدخل الجنة وبين أن ألقى عبد الله بن محرر لاخترت أن ألقاه ثم أدخل الجنة فلما رأيته كانت بعرة أحب إلى منه ‏.‏",
      "text_en": "",
      "chain": [
        "30561",
        "20642",
        "20025"
      ]
    },
    {
      "hadith_no": "390",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثني محمد بن رافع، حدثنا حجين، - وهو ابن المثنى - حدثنا الليث، عن عقيل، ح وحدثني محمد بن عبد الله بن قهزاذ، حدثنا سلمة بن سليمان، أخبرنا يونس، كلاهما عن الزهري، بهذا الإسناد كما قال ابن جريج كان رسول الله صلى الله عليه وسلم إذا قام للصلاة رفع يديه حتى تكونا حذو منكبيه ثم كبر ‏.‏",
      "text_en": " This hadith has been transmitted with the same chain of transmitters by al. Zuhri as narrated by Ibn Juraij (who) said. When the Messenger of Allah (may peace be upon him) stood up for prayer, he raised hands (to the height) apposite the shoulders and then recited takbir.",
      "chain": [
        "30375",
        "20382",
        "20023",
        "11207",
        "30561",
        "30340",
        "11070"
      ]
    },
    {
      "hadith_no": "3223",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني محمد بن عبد الله بن قهزاذ، حدثنا علي بن الحسن، عن عبد الله بن، المبارك أخبرنا محمد بن أبي حفصة، عن الزهري، عن عيسى بن طلحة، عن عبد الله بن، عمرو بن العاص قال سمعت رسول الله صلى الله عليه وسلم وأتاه رجل يوم النحر وهو واقف عند الجمرة فقال يا رسول الله إني حلقت قبل أن أرمي ‏.‏ فقال ‏\"‏ ارم ولا حرج ‏\"‏ وأتاه آخر فقال إني ذبحت قبل أن أرمي ‏.‏ قال ‏\"‏ ارم ولا حرج ‏\"‏ ‏.‏ وأتاه آخر فقال إني أفضت إلى البيت قبل أن أرمي ‏.‏ قال ‏\"‏ ارم ولا حرج ‏\"‏ ‏.‏ قال فما رأيته سئل يومئذ عن شىء إلا قال ‏\"‏ افعلوا ولا حرج ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. 'Amr b. al-As (Allah be pleased with them) said:                      As Allah's Messenger (may peace be'upon him) was standing near the jamra, a person came to him on the Day of Nahr and said: Messenger of Allah, I got (my head shaved) before throwing pebbles, whereupon he (the Holy Prophet) said: Throw pebbles (now) ; there is no harm in it. Another man (then) came and said: I have sacrificed before throwing the stones. He said: Throw stones (now) and there is no harm. Another came to him and said: I have observed the circumambulation of Ifada of the House before throwing pebbles. He said: Throw pebbles (now) ; there is no harm in it, He (the narrator) said: I did not see that he (the Holy Prophet) was asked about anything on that day, but he said: Do, and there is no harm in it.",
      "chain": [
        "30561",
        "20025",
        "20279",
        "11013",
        "10573",
        "29"
      ]
    },
    {
      "hadith_no": "4986",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثني محمد بن عبد الله بن قهزاذ، حدثنا علي بن الحسن، عن عبد الله بن المبارك، أخبرنا سعيد بن أبي أيوب، وحيوة بن شريح، قال كل واحد منهما حدثني شرحبيل بن، شريك عن أبي عبد الرحمن الحبلي، أنه سمع أبا أيوب الأنصاري، يقول قال رسول الله صلى الله عليه وسلم بمثله سواء ‏.‏",
      "text_en": " This tradition has been narrated on the authority of Abu Ayyub through a different chain of transmitters having the same wording.",
      "chain": [
        "30561",
        "20025",
        "20375",
        "26010",
        "10862",
        "10938",
        "33"
      ]
    },
    {
      "hadith_no": "6861",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا محمد بن عبد الله بن قهزاذ، حدثنا سلمة بن سليمان، أخبرنا عبد الله، أخبرنا معمر، عن ابن شهاب، حدثني عبد الله بن أبي بكر بن حزم، عن عروة، عن عائشة، ح",
      "text_en": "",
      "chain": [
        "30561",
        "30340",
        "20025",
        "20115",
        "11013",
        "11104",
        "10511"
      ]
    },
    {
      "hadith_no": "512",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا حماد بن خالد، حدثنا محمد بن عمرو، عن محمد بن عبد الله، عن عمه عبد الله بن زيد، قال أراد النبي صلى الله عليه وسلم في الأذان أشياء لم يصنع منها شيئا قال فأري عبد الله بن زيد الأذان في المنام فأتى النبي صلى الله عليه وسلم فأخبره فقال ‏\"‏ ألقه على بلال ‏\"‏ ‏.‏ فألقاه عليه فأذن بلال فقال عبد الله أنا رأيته وأنا كنت أريده قال ‏\"‏ فأقم أنت ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Zayd:                     The Prophet (ﷺ) intended to do many things for calling (the people) to prayer, but he did not do any of them. Then Abdullah ibn Zayd was taught in a dream how to pronounce the call to prayer. He came to the Prophet (ﷺ) and informed him. He said: Teach it to Bilal. He then taught him, and Bilal made a call to prayer. Abdullah said: I saw it in a dream and I wished to pronounce it, but he (the Prophet) said: You should pronounce iqamah.",
      "chain": [
        "30203",
        "20537",
        "11220",
        "30561",
        "605"
      ]
    },
    {
      "hadith_no": "3981",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Dialects and Readings of the Qur'an (Kitab Al-Huruf Wa Al-Qira'at) - كتاب الحروف والقراءات",
      "chapter_no": "32",
      "text_ar": "حدثنا محمد بن عبد الله، حدثنا المغيرة بن سلمة، حدثنا ابن المبارك، عن الأجلح، حدثني عبد الله بن عبد الرحمن بن أبزى، عن أبيه، عن أبى، أن النبي صلى الله عليه وسلم قرأ ‏{‏ بفضل الله وبرحمته فبذلك فليفرحوا هو خير مما تجمعون ‏}‏ ‏.‏",
      "text_en": " Narrated Ibn Abzi:                     Ubayy ibn Ka'b) said: The Prophet (ﷺ) read the verse: \"Say: In the bounty of Allah and in His mercy--in that let you rejoice: that is better than the wealth you hoard.\"",
      "chain": [
        "30561",
        "20570",
        "20025"
      ]
    },
    {
      "hadith_no": "4554",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا محمد بن عبد الله، حدثنا سعيد، عن قتادة، عن عبد ربه، عن أبي عياض، عن عثمان بن عفان، وزيد بن ثابت، في المغلظة أربعون جذعة خلفة وثلاثون حقة وثلاثون بنات لبون وفي الخطإ ثلاثون حقة وثلاثون بنات لبون وعشرون بنو لبون ذكور وعشرون بنات مخاض ‏.‏",
      "text_en": " Narrated Zaid b. Thabit:                     About the bloodwit for quasi-intentional murder..... He then mentioned a similar tradition as mentioned above.",
      "chain": [
        "30170",
        "30561",
        "11168",
        "11019",
        "11714",
        "4"
      ]
    },
    {
      "hadith_no": "4555",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا محمد بن عبد الله، حدثنا سعيد، عن قتادة، عن سعيد بن المسيب، عن زيد بن ثابت، في الدية المغلظة فذكر مثله سواء ‏.‏ قال أبو داود قال أبو عبيد وعن غير واحد إذا دخلت الناقة في السنة الرابعة فهو حق والأنثى حقة لأنه يستحق أن يحمل عليه ويركب فإذا دخل في الخامسة فهو جذع وجذعة فإذا دخل في السادسة وألقى ثنيته فهو ثني وثنية فإذا دخل في السابعة فهو رباع ورباعية فإذا دخل في الثامنة وألقى السن الذي بعد الرباعية فهو سديس وسدس فإذا دخل في التاسعة وفطر نابه وطلع فهو بازل فإذا دخل في العاشرة فهو مخلف ثم ليس له اسم ولكن يقال بازل عام وبازل عامين ومخلف عام ومخلف عامين إلى ما زاد ‏.‏ وقال النضر بن شميل بنت مخاض لسنة وبنت لبون لسنتين وحقة لثلاث وجذعة لأربع والثني لخمس ورباع لست وسديس لسبع وبازل لثمان ‏.‏ قال أبو داود قال أبو حاتم والأصمعي والجذوعة وقت وليس بسن ‏.‏ قال أبو حاتم قال بعضهم فإذا ألقى رباعيته فهو رباع وإذا ألقى ثنيته فهو ثني وقال أبو عبيد إذا ألقحت فهي خلفة فلا تزال خلفة إلى عشرة أشهر فإذا بلغت عشرة أشهر فهي عشراء ‏.‏ قال أبو حاتم إذا ألقى ثنيته فهو ثني وإذا ألقى رباعيته فهو رباع ‏.‏",
      "text_en": " Narrated Abu Dawud:                     Abu Dawud and others have said: When a she-camel enters fourth year, the female is called hiqqah, and the male is called hiqq, for it deserves that it should be loaded and ridden. When a camel enters its fifth year, the male is called Jadha' and the female is called Jadha'ah. When it enters its sixth year, and sheds its front teeth, it is called thani (male) and thaniyyah (female). When it enters its seventh year, it is called raba' and raba'iyyah. When it enters its ninth year and cuts its canine teeth, it is called bazil. When it enters its tenth year, it is called mukhlif. Then there is no name for it, but is called bazil'am and bazil'amain, and mukhlif'am and mukhlif'amain, upto any year it increases. Nad d. Shumail said: Bint makhad is a she-camel of one year, and bin labun is s she-camel of two years, hiqqah is a she-camel of three years, jadha'ah is a she-camel of four years, thani is a camel of five years, raba' is a camel of six years, sadis is a camel of seven years, and bazil is a camel of eight years.Abu Dawud said: Abu Hatim and al-Asma'i said: Al-Jadhu'ah is a time when no tooth is growing. Abu Hatim said: Some of them said: When it sheds its teeth between front and canine teeth, it is called raba' and when it sheds its front teeth, it is called thani. Abu 'Ubaid said: When it becomes pregnant, it is called khalifah, and it remains khalifah for ten months; when it reaches ten months, it is called 'ushara', Abu Hatim said: When it shed its front teeth, it is called thani and when it sheds its teeth between front and canine teeth it is called raba'.",
      "chain": [
        "30170",
        "30561",
        "11168",
        "11019",
        "11002",
        "49",
        "30002",
        "36618"
      ]
    },
    {
      "hadith_no": "2374",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "حدثنا عيسى بن مساور، عن الوليد، قال حدثنا الأوزاعي، قال أخبرني عطاء، عن عبد الله، ح وأنبأنا محمد بن عبد الله، قال حدثني الوليد، عن الأوزاعي، قال حدثنا عطاء، عن عبد الله بن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من صام الأبد فلا صام ولا أفطر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin 'Umar said:                     \"The Messenger of Allah said: 'Whoever fasts every day of is life, then he has neither fasted, nor broken the fast.\"",
      "chain": [
        "36610",
        "20733",
        "20024",
        "11029",
        "18",
        "30561",
        "20733",
        "20024",
        "11029",
        "18"
      ]
    },
    {
      "hadith_no": "5466",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا محمد بن عبد الله، قال حدثنا أبو أسامة، قال حدثنا هشام بن عروة، عن أبيه، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم كثيرا ما يدعو بهؤلاء الكلمات ‏\"‏ اللهم إني أعوذ بك من فتنة النار وعذاب النار وفتنة القبر وعذاب القبر وشر فتنة المسيح الدجال وشر فتنة الفقر وشر فتنة الغنى اللهم اغسل خطاياى بماء الثلج والبرد وأنق قلبي من الخطايا كما أنقيت الثوب الأبيض من الدنس وباعد بيني وبين خطاياى كما باعدت بين المشرق والمغرب اللهم إني أعوذ بك من الكسل والهرم والمأثم والمغرم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"The Messenger of Allah [SAW] often used to say these words in his supplication: 'Allahumma, inni a'udhu bika min fitnatin-nari, wa 'adhabin-nari, wa fitnatil-qabri, wa 'adhabil-qabr, wa sharri fitnatil masihid-dajjal, wa sharri fitnatil-faqri, wa sharri fitnatil-ghina. Allahummaghsil khatayaya bima'ith-thalji wal-baradi wa anqi qalbi minal-khataya kama anqaitath-thawbal-abyada min ad-danasi, wa ba'id baini wa baina khatayaya kama ba'adta bainal-mashriqi wal-maghrib. Allahumma inni a'udhu bika min al-kasali wal harami, wal ma'thami wal-maghram (O Allah, I seek refuge with You form the tribulation of the Fire and the torment of the Fire, from the tribulation of the grave and the torment of the grave, from the evil of the tribulation of the Al-Masihid-Dajjal, from the evils of the tribulation of poverty and from the evil of the tribulation of richness. O Allah, put a great distance between me and my sins, as great as the distance You have made between the East and the West. O Allah, I seek refuge in You from laziness, old age, sin and debt.)'\"",
      "chain": [
        "30561",
        "20318",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "42",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا محمد بن عبد الله، أنبأنا الحسن بن موسى الأشيب، عن شعبة، مثل حديث سمرة بن جندب ‏.‏",
      "text_en": "",
      "chain": [
        "30561",
        "20383"
      ]
    },
    {
      "hadith_no": "573",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا محمد بن عبد الله، عن عبيد الله الهذلي، - قال محمد بن يحيى وهو عندنا ابن أبي حميد - أنبأنا أبو المليح الهذلي، عن واثلة بن الأسقع، قال جاء أعرابي إلى النبي  صلى الله عليه وسلم  فقال اللهم ارحمني ومحمدا ولا تشرك في رحمتك إيانا أحدا ‏.‏ فقال ‏\"‏ لقد حظرت واسعا ويحك - أو ويلك - ‏\"‏ ‏.‏ قال فشج يبول فقال أصحاب النبي  صلى الله عليه وسلم  مه ‏.‏ فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ دعوه ‏\"‏ ‏.‏ ثم دعا بسجل من ماء فصب عليه ‏.‏",
      "text_en": " It was narrated that Wathilah bin Asqa' said:                     \"A Bedouin came to the Prophet and said: 'O Allah, have mercy on me and Muhammed, and do not allow anyone else to share in your Mercy.' The Prophet said: 'You have placed restrictions on something that is vast, woe to you!' Then he (the Bedouin) spread his legs and urinated, and the Companions of the Prophet told him to stop, but the Messenger of Allah said: 'Let him be,' then he called for a vessel of water and poured it over (the urine).\"",
      "chain": [
        "11222",
        "30561",
        "11222",
        "11453",
        "4049"
      ]
    },
    {
      "hadith_no": "1981",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن عبد الله، حدثنا أشعث، عن الحسن، عن عقيل بن أبي طالب، أنه تزوج امرأة من بني جشم فقالوا بالرفاء والبنين فقال لا تقولوا هكذا ولكن قولوا كما قال رسول الله  صلى الله عليه وسلم  ‏\"‏ اللهم بارك لهم وبارك عليهم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Aqil bin Abu Talib:                     that he married a woman from Banu Jusham, and they said: “Do not say that, rather say what the Messenger of Allah said: 'Allahumma barik lahum wa barik alaihim ( O Allah, bless them and bestow blessings upon tham.)' ”",
      "chain": [
        "30160",
        "30561",
        "11324",
        "11016",
        "165"
      ]
    },
    {
      "hadith_no": "2230",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن عبد الله، حدثنا فروة أبو يونس، عن هلال بن جبير، عن أنس بن مالك، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من أصاب من شىء فليلزمه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Anas bin Malik that the Messenger of Allah (ﷺ) said:                     'Whoever achieves at something, let him stick with It.'\"",
      "chain": [
        "30160",
        "30561",
        "14401",
        "19"
      ]
    },
    {
      "hadith_no": "2491",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Charity - كتاب الصدقات",
      "chapter_no": "15",
      "text_ar": "حدثنا إبراهيم بن المستمر، حدثنا محمد بن عبد الله، ح وحدثنا يحيى بن حكيم، حدثنا ابن أبي عدي، جميعا عن سعيد، عن قتادة، عن الحسن، عن سمرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ على اليد ما أخذت حتى تؤديه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Samurah that the Messenger of Allah (ﷺ) said:                     “The hand that takes is responsible for what it has taken until it returns it.”",
      "chain": [
        "34023",
        "30561",
        "34280",
        "20276",
        "11168",
        "11019",
        "11016",
        "394"
      ]
    }
  ],
  "total_hadiths": 31
}