{
  "id": "30569",
  "name": "Wahb bin Bqyh bin 'Uthman وهب بن بقية بن عثمان",
  "full_name": "Wahb bin Bqyh bin 'Uthman وهب بن بقية بن عثمان",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "239",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Wasit"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ م  د  س  -  ثقة ]"
    ],
    "tags": [
      "al-Wasti"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20022",
      "name": "Hammad bin Zayd حماد بن زيد بن درهم الأزدي الأزرق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20532",
      "name": "Ja'far bin Sulaiman al-Daba'i جعفر بن سليمان الضبعي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20468",
      "name": "Hashaym bin Bashayr bin al-Qasim هشيم بن بشير بن القاسم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20546",
      "name": "Sulaym bin Aghdar سليم بن أخضر",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20246",
      "name": "'Abdul A'ala bin 'Abdul A'ala al-Sami عبد الأعلى بن عبد الأعلى البصري السامي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20423",
      "name": "Khalid bin 'Abdullah al-Tahan خالد بن عبد الله بن عبد الرحمن الطحان",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20450",
      "name": "'Umar bin Yonus bin al-Qasim عمر بن يونس بن القاسم",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20304",
      "name": "Yazid bin Zari' يزيد بن زريع",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20354",
      "name": "Muhammad bin Khazim al-Darir محمد بن خازم أبو معاوية الضرير",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20326",
      "name": "Sulaiman bin Hayan al-Azdi سليمان بن حيان الأزدي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20572",
      "name": "Nwh bin Qays bin نوح بن قيس بن",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20547",
      "name": "Sulaiman bin Da'ud bin al-Jarud سليمان بن داود أبو داود الطيالسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]"
    },
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "30554",
      "name": "Abu Zara' al-Razi أبو زرعة الرازي",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "4905",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثني وهب بن بقية الواسطي، حدثنا خالد بن عبد الله، عن الجريري، عن أبي، نضرة عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا بويع لخليفتين فاقتلوا الآخر منهما ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Aba Sa'id al-Khudri that the Messenger of Allah (may peace be upon him) said:                      When oath of allegiance has been taken for two caliphs, kill the one for whom the oath was taken later.",
      "chain": [
        "30569",
        "20423",
        "11286",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "43",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا وهب بن بقية، عن خالد، - يعني الواسطي - عن خالد، - يعني الحذاء - عن عطاء بن أبي ميمونة، عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم دخل حائطا ومعه غلام معه ميضأة وهو أصغرنا فوضعها عند السدرة فقضى حاجته فخرج علينا وقد استنجى بالماء ‏.‏",
      "text_en": " Narrated Anas b. Malik :                     The Apostle of Allaah ( sal Allaahu alayhi wa sallam ) entered a park. He was accompanied by a boy who had a jug of water with him. He was the youngest of us. He placed it near the lote-tree. He ( the Prophet, sal Allaahu alayhi wa sallam ) relieved himself. He came to us after he had cleansed himself with water.",
      "chain": [
        "30569",
        "20423",
        "11282",
        "11601",
        "19"
      ]
    },
    {
      "hadith_no": "296",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا وهب بن بقية، أخبرنا خالد، عن سهيل، - يعني ابن أبي صالح - عن الزهري، عن عروة بن الزبير، عن أسماء بنت عميس، قالت قلت يا رسول الله إن فاطمة بنت أبي حبيش استحيضت منذ كذا وكذا فلم تصل ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ سبحان الله إن هذا من الشيطان لتجلس في مركن فإذا رأت صفرة فوق الماء فلتغتسل للظهر والعصر غسلا واحدا وتغتسل للمغرب والعشاء غسلا واحدا وتغتسل للفجر غسلا واحدا وتتوضأ فيما بين ذلك ‏\"‏ ‏.‏ قال أبو داود رواه مجاهد عن ابن عباس لما اشتد عليها الغسل أمرها أن تجمع بين الصلاتين ‏.‏ قال أبو داود ورواه إبراهيم عن ابن عباس وهو قول إبراهيم النخعي وعبد الله بن شداد ‏.‏",
      "text_en": " Asma' daughter of 'Unais said:                      I said: Messenger of Allah, Fatimah daughter of Abu Hubaish had a flow of blood for a certain period and did not pray. The Messenger of Allah (ﷺ) said: Glory be to Allah! This comes from the devil. She should sit in a tub, and when she sees yellowness of the top of the water, she would take a bath once for the Zuhr and 'Asr prayer, and take another bath for the Maghrib and 'Isha prayers, and take a bath once for the fajr prayer, and in between times she would perform ablution.Abu Dawud said: Mujahid reported on the authority of Ibn 'Abbas: When bathing became hard for her, he commanded her to combine the two prayers.Abu Dawud said: Ibrahim reported it from Ibn 'Abbas. This is also the view of Ibrahim al-Nakha'i and 'Abd Allah b. Shaddad.",
      "chain": [
        "30569",
        "20423",
        "11173",
        "11013",
        "10511",
        "69"
      ]
    },
    {
      "hadith_no": "443",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا وهب بن بقية، عن خالد، عن يونس بن عبيد، عن الحسن، عن عمران بن حصين، أن رسول الله صلى الله عليه وسلم كان في مسير له فناموا عن صلاة الفجر فاستيقظوا بحر الشمس فارتفعوا قليلا حتى استقلت الشمس ثم أمر مؤذنا فأذن فصلى ركعتين قبل الفجر ثم أقام ثم صلى الفجر ‏.‏",
      "text_en": " 'Imran b. Husain said:                      The Messenger of Allah (ﷺ) was on his journey. They (the people) slept abandoning the Fajr prayer. They awoke by the heat of the sun. Then they travelled a little until the sun rose high. He (the Prophet) commanded the mu'adhdhin (one who called for prayer) to call for prayer. He then offered two rak'ahs of prayer (sunnah prayer) before the (obligatory) fajr prayer. Then he (the mu'adhdhin) announced for saying the prayer in congregation (i.e. he uttered iqamah). Then he led them in the morning prayer.",
      "chain": [
        "30569",
        "20423",
        "11075",
        "11016",
        "123"
      ]
    },
    {
      "hadith_no": "692",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عثمان بن أبي شيبة، ووهب بن بقية، وابن أبي خلف، وعبد الله بن سعيد، - قال عثمان - حدثنا أبو خالد، حدثنا عبيد الله، عن نافع، عن ابن عمر، أن النبي صلى الله عليه وسلم كان يصلي إلى بعيره ‏.‏",
      "text_en": " Ibn 'Umar said:                      The Prophet (ﷺ) used to pray facing his camel.",
      "chain": [
        "30203",
        "30569",
        "11184",
        "4",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "830",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا وهب بن بقية، أخبرنا خالد، عن حميد الأعرج، عن محمد بن المنكدر، عن جابر بن عبد الله، قال خرج علينا رسول الله صلى الله عليه وسلم ونحن نقرأ القرآن وفينا الأعرابي والأعجمي فقال ‏\"‏ اقرءوا فكل حسن وسيجيء أقوام يقيمونه كما يقام القدح يتعجلونه ولا يتأجلونه ‏\"‏ ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     The Messenger of Allah (ﷺ) came to us while we were reciting the Qur'an, and there were among us bedouins and the non-Arabs. He said: Recite, all is well. In the near future there will appear people who will straighten it (the Qur'an) as an arrow is straightened. They will recite it quickly and not slowly (or it means that they will get the reward in this world and not in the Hereafter).",
      "chain": [
        "30569",
        "20423",
        "11048",
        "34"
      ]
    },
    {
      "hadith_no": "859",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا وهب بن بقية، عن خالد، عن محمد، - يعني ابن عمرو - عن علي بن يحيى بن خلاد، عن أبيه، عن رفاعة بن رافع، بهذه القصة قال ‏\"‏ إذا قمت فتوجهت إلى القبلة فكبر ثم اقرأ بأم القرآن وبما شاء الله أن تقرأ وإذا ركعت فضع راحتيك على ركبتيك وامدد ظهرك ‏\"‏ ‏.‏ وقال ‏\"‏ إذا سجدت فمكن لسجودك فإذا رفعت فاقعد على فخذك اليسرى ‏\"‏ ‏.‏",
      "text_en": " This tradition has also been transmitted through a different chain of narrators by Rifa’ah b. Rafi. This version goes:                      When you get up and face the qiblah, what Allah wishes you to recite. And when you bow, put your palms on your knees and stretch out your back. When you prostrate yourself, do it completely( so that you are at the rest). When you raise yourself then sit on your left thigh.",
      "chain": [
        "30569",
        "20423",
        "11220",
        "11710",
        "325",
        "323"
      ]
    },
    {
      "hadith_no": "984",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا وهب بن بقية، أخبرنا عمر بن يونس اليمامي، حدثني محمد بن عبد الله بن طاوس، عن أبيه، عن طاوس، عن ابن عباس، عن النبي صلى الله عليه وسلم أنه كان يقول بعد التشهد ‏\"‏ اللهم إني أعوذ بك من عذاب جهنم وأعوذ بك من عذاب القبر وأعوذ بك من فتنة الدجال وأعوذ بك من فتنة المحيا والممات ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Prophet (ﷺ) used to say after the tashahhud: \"O Allah, I seek refuge in Thee from the punishment in Hell, and I seek refuge in Thee from the punishment in the grave, and I seek refuge in Thee from the trial of antichrist, and I seek refuge in Thee from the trial of life and death.\"",
      "chain": [
        "30569",
        "20450",
        "28521",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "1286",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا وهب بن بقية، أخبرنا خالد، عن واصل، عن يحيى بن عقيل، عن يحيى بن يعمر، عن أبي الأسود الدؤلي، قال بينما نحن عند أبي ذر قال ‏\"‏ يصبح على كل سلامى من أحدكم في كل يوم صدقة فله بكل صلاة صدقة وصيام صدقة وحج صدقة وتسبيح صدقة وتكبير صدقة وتحميد صدقة ‏\"‏ ‏.‏ فعد رسول الله صلى الله عليه وسلم من هذه الأعمال الصالحة ثم قال ‏\"‏ يجزئ أحدكم من ذلك ركعتا الضحى ‏\"‏ ‏.‏",
      "text_en": " Abu al-Aswad al-Dailani said:                      While we were present with Abu Dharr, he said: In the morning, alms are due for him, ever fast is alms, every pilgrimage is alms, every utterance of \"Glory to be Allah\" is alms, every utterance of \"Allah is most great\" is alms, every utterance of \"Praise be to Allah\" is alms. The Messenger of Allah (ﷺ) recounted all such good works. He then said: Two rak'ahs which one prays in the Duha serve instead of that.",
      "chain": [
        "30569",
        "20423",
        "10726",
        "11316",
        "11114"
      ]
    },
    {
      "hadith_no": "1354",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا وهب بن بقية، عن خالد، عن حصين، نحوه قال ‏:‏ ‏\"‏ وأعظم لي نورا ‏\"‏ ‏.‏ قال أبو داود ‏:‏ وكذلك قال أبو خالد الدالاني عن حبيب في هذا، وكذلك قال في هذا الحديث وقال سلمة بن كهيل عن أبي رشدين عن ابن عباس ‏.‏",
      "text_en": " The above tradition has also been transmitted by Husain through a different chain of narrators in like manner. This version has the words:                      \"And give me abundant light.\"Abu Dawud said: This tradition has been transmitted by Abu Khalid al-Dalani from Habib and Salamah b. Kuhail from Abu Rishdin from Ibn 'Abbas in a similar manner.",
      "chain": [
        "30569",
        "20423",
        "15097",
        "20728",
        "11350"
      ]
    },
    {
      "hadith_no": "1856",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا وهب بن بقية، عن خالد الطحان، عن خالد الحذاء، عن أبي قلابة، عن عبد الرحمن بن أبي ليلى، عن كعب بن عجرة، أن رسول الله صلى الله عليه وسلم مر به زمن الحديبية فقال ‏\"‏ قد آذاك هوام رأسك ‏\"‏ ‏.‏ قال نعم ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ احلق ثم اذبح شاة نسكا أو صم ثلاثة أيام أو أطعم ثلاثة آصع من تمر على ستة مساكين ‏\"‏ ‏.‏",
      "text_en": " Ka’ab bin ‘Ujrah said that the Apostle of Allaah(ﷺ) came upon him (during their stay) at Al Hudaibiyyah. He asked do the insects of your head (lice) annoy you? He said Yes. The Prophet (ﷺ) said Shave your head, then sacrifice a sheep as offering or fast three days or give three sa’s of dates to six poor people.",
      "chain": [
        "30569",
        "20423",
        "11282",
        "11047",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "2005",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا وهب بن بقية، عن خالد، عن أفلح، عن القاسم، عن عائشة، - رضى الله عنها - قالت أحرمت من التنعيم بعمرة فدخلت فقضيت عمرتي وانتظرني رسول الله صلى الله عليه وسلم بالأبطح حتى فرغت وأمر الناس بالرحيل ‏.‏ قالت وأتى رسول الله صلى الله عليه وسلم البيت فطاف به ثم خرج ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     I put on ihram for umrah at at-Tan'im and I entered (Mecca) and performed my umrah as an atonement. The Messenger of Allah (ﷺ) waited for me at al-Abtah till I finished it. He commanded the people to depart. The Messenger of Allah (ﷺ) came to the House (the Ka'bah), went round it and went out (i.e. left for Medina).",
      "chain": [
        "30569",
        "20423",
        "20156",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "2077",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا وهب بن بقية، عن خالد، عن حصين، عن عامر، عن الحارث الأعور، عن رجل، من أصحاب النبي صلى الله عليه وسلم قال فرأينا أنه علي - عليه السلام - عن النبي صلى الله عليه وسلم بمعناه ‏.‏",
      "text_en": " The aforesaid tradition has also been transmitted by ‘Ali through a different chain of narrators from the Prophet (ﷺ) to the same effect.",
      "chain": [
        "30569",
        "20423",
        "15097",
        "11052",
        "19865"
      ]
    },
    {
      "hadith_no": "2123",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا وهب بن بقية، وعثمان بن أبي شيبة، عن هشيم، عن حميد، عن أنس بن مالك، قال لما أخذ رسول الله صلى الله عليه وسلم صفية أقام عندها ثلاثا ‏.‏ زاد عثمان وكانت ثيبا ‏.‏ وقال حدثني هشيم أخبرنا حميد أخبرنا أنس ‏.‏",
      "text_en": " Narrated Anas bin Malik:                     When the Messenger of Allah (ﷺ) married Safiyyah, he stayed with her three nights. The narrator 'Uthman added: She was non virgin (previously married). He said: This tradition has been narrated to me by Hushaim, reported by Humaid, and transmitted by Anas.",
      "chain": [
        "30569",
        "30203",
        "20468",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "2241",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا مسدد، حدثنا هشيم، ح وحدثنا وهب بن بقية، أخبرنا هشيم، عن ابن أبي ليلى، عن حميضة بن الشمردل، عن الحارث بن قيس، - قال مسدد ابن عميرة ‏.‏ وقال وهب الأسدي - قال أسلمت وعندي ثمان نسوة فذكرت ذلك للنبي صلى الله عليه وسلم فقال النبي صلى الله عليه وسلم ‏\"‏ اختر منهن أربعا ‏\"‏ ‏.‏ قال أبو داود وحدثنا به أحمد بن إبراهيم حدثنا هشيم بهذا الحديث فقال قيس بن الحارث مكان الحارث بن قيس قال أحمد بن إبراهيم هذا الصواب ‏.‏ يعني قيس بن الحارث ‏.‏",
      "text_en": " Narrated Al-Harith ibn Qays al-Asadi:                     I embraced Islam while I had eight wives. So I mentioned it to the Prophet (ﷺ). The Prophet (said) said: Select four of them.Abu Dawud said: This tradition has also been narrated to us by Ahmad b. Ibrahim from Hushaim. He said: Qais b. al-Harith instead of al-Harith b. Qais. Ahmad b. Ibrahim said: This is correct, i.e. Qais b. al-Harith.",
      "chain": [
        "30175",
        "20468",
        "30569",
        "20468",
        "11196",
        "15072"
      ]
    },
    {
      "hadith_no": "2353",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا وهب بن بقية، عن خالد، عن محمد، - يعني ابن عمرو - عن أبي سلمة، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يزال الدين ظاهرا ما عجل الناس الفطر لأن اليهود والنصارى يؤخرون ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: Religion will continue to prevail as long as people hasten to break the fast, because the Jews and the Christians delay doing so.",
      "chain": [
        "30569",
        "20423",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "2378",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا وهب بن بقية، أخبرنا أبو معاوية، عن عتبة، عن أبي معاذ، عن عبيد الله بن أبي بكر بن أنس، عن أنس بن مالك، أنه كان يكتحل وهو صائم ‏.‏",
      "text_en": " 'Ubaid Allah b. Abu Bakr b. Anas reported on the authority of Anas b. Malik that he used to apply collyrium when he was fasting.",
      "chain": [
        "30569",
        "20354",
        "11436",
        "19"
      ]
    },
    {
      "hadith_no": "2473",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا وهب بن بقية، أخبرنا خالد، عن عبد الرحمن، - يعني ابن إسحاق - عن الزهري، عن عروة، عن عائشة، أنها قالت السنة على المعتكف أن لا يعود مريضا ولا يشهد جنازة ولا يمس امرأة ولا يباشرها ولا يخرج لحاجة إلا لما لا بد منه ولا اعتكاف إلا بصوم ولا اعتكاف إلا في مسجد جامع ‏.‏ قال أبو داود غير عبد الرحمن بن إسحاق لا يقول فيه قالت السنة ‏.‏ قال أبو داود جعله قول عائشة ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     The sunnah for one who is observing i'tikaf (in a mosque) is not to visit a patient, or to attend a funeral, or touch or embrace one's wife, or go out for anything but necessary purposes. There is no i'tikaf without fasting, and there is no i'tikaf except in a congregational mosque.",
      "chain": [
        "30569",
        "20423",
        "11876",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2651",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا وهب بن بقية، عن خالد، عن حصين، عن سعد بن عبيدة، عن أبي عبد الرحمن السلمي، عن علي، بهذه القصة قال انطلق حاطب فكتب إلى أهل مكة أن محمدا صلى الله عليه وسلم قد سار إليكم وقال فيه قالت ما معي كتاب ‏.‏ فانتحيناها فما وجدنا معها كتابا فقال علي والذي يحلف به لأقتلنك أو لتخرجن الكتاب ‏.‏ وساق الحديث ‏.‏",
      "text_en": " ‘Ali said “Hatib went and wrote to the people of Makkah that Muhammad (ﷺ) is going to proceed to them. This version has “She said “I have no letter. We made her Camel kneel down, but we did not find any letter with her. ’Ali said “By Him in Whose name oath is taken, I shall kill you or you should bring out the letter. He then narrated the rest of the tradition.",
      "chain": [
        "30569",
        "20423",
        "15097",
        "11344",
        "11359"
      ]
    },
    {
      "hadith_no": "2737",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا وهب بن بقية، قال أخبرنا خالد، عن داود، عن عكرمة، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم يوم بدر ‏\"‏ من فعل كذا وكذا فله من النفل كذا وكذا ‏\"‏ قال فتقدم الفتيان ولزم المشيخة الرايات فلم يبرحوها فلما فتح الله عليهم قالت المشيخة كنا ردءا لكم لو انهزمتم لفئتم إلينا فلا تذهبوا بالمغنم ونبقى فأبى الفتيان وقالوا جعله رسول الله صلى الله عليه وسلم لنا فأنزل الله ‏{‏ يسألونك عن الأنفال قل الأنفال لله ‏}‏ إلى قوله ‏{‏ كما أخرجك ربك من بيتك بالحق وإن فريقا من المؤمنين لكارهون ‏}‏ يقول فكان ذلك خيرا لهم فكذلك أيضا فأطيعوني فإني أعلم بعاقبة هذا منكم ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Messenger of Allah (ﷺ) said on the day of Badr: He who does such-and-such, will have such-and such. The young men came forward and the old men remained standing near the banners, and they did not move from there. When Allah bestowed victory on them, the old men said: We were support for you. If you had been defeated, you would have returned to us. Do not take this booty alone and we remain (deprived of it). The young men refused (to give), and said: The Messenger of Allah (ﷺ) has given it to us. Then Allah sent down: \"They ask thee concerning (things taken as) spoils of war, Say: (Such) spoils are at the disposal of Allah and the Apostle......Just as they Lord ordered thee out of thy house in truth, even though a party among the believers disliked it.\" This proved good for them. Similarly obey me. I know the consequence of this better than you.",
      "chain": [
        "30569",
        "20423",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2897",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Shares of Inheritance (Kitab Al-Fara'id) - كتاب الفرائض",
      "chapter_no": "19",
      "text_ar": "حدثنا وهب بن بقية، عن خالد، عن يونس، عن الحسن، أن عمر، قال أيكم يعلم ما ورث رسول الله صلى الله عليه وسلم الجد فقال معقل بن يسار أنا ورثه رسول الله صلى الله عليه وسلم السدس ‏.‏ قال مع من قال لا أدري ‏.‏ قال لا دريت فما تغني إذا ‏.‏",
      "text_en": " Al-Hasan reported that Umar asked:                      Which of your knows what share the Messenger of Allah (ﷺ) had given to the grandfather from the estate? Ma'qil ibn Yasar said: The Messenger of Allah (ﷺ) gave him a sixth. He asked: Along with whom? He replied: I do not know. He said: You do not know; what is the use then?",
      "chain": [
        "30569",
        "20423",
        "20475",
        "11016",
        "3"
      ]
    },
    {
      "hadith_no": "2930",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا وهب بن بقية، حدثنا خالد، عن إسماعيل بن أبي خالد، عن أخيه، عن بشر بن قرة الكلبي، عن أبي بردة، عن أبي موسى، قال انطلقت مع رجلين إلى النبي صلى الله عليه وسلم فتشهد أحدهما ثم قال جئنا لتستعين بنا على عملك ‏.‏ وقال الآخر مثل قول صاحبه ‏.‏ فقال ‏\"‏ إن أخونكم عندنا من طلبه ‏\"‏ ‏.‏ فاعتذر أبو موسى إلى النبي صلى الله عليه وسلم وقال لم أعلم لما جاءا له ‏.‏ فلم يستعن بهما على شىء حتى مات ‏.‏",
      "text_en": " Narrated Abu Musa:                     I went along with two men to see the Prophet (ﷺ). One of them recited tashahhud and said: We have come to you so that you may employ us for your work. The other also said the same thing. He  (the Prophet) replied: The most faithless of you in our eyes is the one who asked for it (responsible post). Abu Musa then apologized to the Prophet (ﷺ) and said: I did not know why they came to you. He did not employ them for anything until he died.",
      "chain": [
        "30569",
        "20423",
        "11418",
        "15185",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "3180",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا وهب بن بقية، عن خالد، عن يونس، عن زياد بن جبير، عن أبيه، عن المغيرة بن شعبة، - وأحسب أن أهل، زياد أخبروني أنه، رفعه إلى النبي صلى الله عليه وسلم - قال ‏\"‏ الراكب يسير خلف الجنازة والماشي يمشي خلفها وأمامها وعن يمينها وعن يسارها قريبا منها والسقط يصلى عليه ويدعى لوالديه بالمغفرة والرحمة ‏\"‏ ‏.‏",
      "text_en": " Narrated Al-Mughirah ibn Shu'bah:                     (I think that the people of Ziyad informed me that he reported on the authority of the Prophet (ﷺ): A rider should go behind the bier, and those on foot should walk behind it, in front of it, on its right and on its left keeping near it. Prayer should be offered over an abortion and forgiveness and mercy supplicated for its parents.",
      "chain": [
        "30569",
        "20423",
        "20475",
        "11285",
        "3225",
        "166"
      ]
    },
    {
      "hadith_no": "3447",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا وهب بن بقية، أخبرنا خالد، عن عمرو بن يحيى، عن محمد بن عمرو بن عطاء، عن سعيد بن المسيب، عن معمر بن أبي معمر، أحد بني عدي بن كعب قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يحتكر إلا خاطئ ‏\"‏ ‏.‏ فقلت لسعيد فإنك تحتكر قال ومعمر كان يحتكر ‏.‏ قال أبو داود وسألت أحمد ما الحكرة قال ما فيه عيش الناس ‏.‏ قال أبو داود قال الأوزاعي المحتكر من يعترض السوق ‏.‏",
      "text_en": " Narrated Ma'mar b. Abi Ma'mar, one of the children of 'Adi b. Ka'b:                     The Messenger of Allah (ﷺ) as saying: No one withholds goods till their price rises but a sinner. I said to Sa'id (b. al-Musayyab): You withhold goods till their price rises. He said: Ma'mar used to withhold goods till their price rose.Abu Dawud said: I asked Ahmad (b. Hanbal): What is hoarding (hukrah) ? He replied: That on which people live.Abu Dawud said: Al-Auza'i said: A muhtakir (one who hoards) is one who withholds supply of goods in the market.",
      "chain": [
        "30569",
        "20423",
        "11210",
        "11220",
        "11002"
      ]
    },
    {
      "hadith_no": "3684",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Drinks (Kitab Al-Ashribah) - كتاب الأشربة",
      "chapter_no": "27",
      "text_ar": "حدثنا وهب بن بقية، عن خالد، عن عاصم بن كليب، عن أبي بردة، عن أبي موسى، قال سألت النبي صلى الله عليه وسلم عن شراب من العسل فقال ‏\"‏ ذاك البتع ‏\"‏ ‏.‏ قلت وينتبذ من الشعير والذرة ‏.‏ فقال ‏\"‏ ذاك المزر ‏\"‏ ‏.‏ ثم قال ‏\"‏ أخبر قومك أن كل مسكر حرام ‏\"‏ ‏.‏",
      "text_en": " Abu Musa said :                      I asked the prophet (ﷺ) about wine made from honey.  He said: That is bit. I said: And the one made from barley and millet ? He said :That is mizr. He then said: Tell your people that every intoxicant is prohibited.",
      "chain": [
        "30569",
        "20423",
        "10778",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "3693",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Drinks (Kitab Al-Ashribah) - كتاب الأشربة",
      "chapter_no": "27",
      "text_ar": "حدثنا وهب بن بقية، عن نوح بن قيس، حدثنا عبد الله بن عون، عن محمد بن سيرين، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال لوفد عبد القيس ‏\"‏ أنهاكم عن النقير والمقير والحنتم والدباء والمزادة المجبوبة ولكن اشرب في سقائك وأوكه ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah said:                      The Messenger of Allah (ﷺ) said to the deputation of 'Abd al-Qais: I forbid you the use of hollow stumps, vessels smeared with pitch, green harrs, pumpkins, and a skin cut off at the top, but drink from your skin and tie it with string.",
      "chain": [
        "30569",
        "20572",
        "11071",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "3695",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Drinks (Kitab Al-Ashribah) - كتاب الأشربة",
      "chapter_no": "27",
      "text_ar": "حدثنا وهب بن بقية، عن خالد، عن عوف، عن أبي القموص، زيد بن علي حدثني رجل، كان من الوفد الذين وفدوا إلى النبي صلى الله عليه وسلم من عبد القيس يحسب عوف أن اسمه قيس بن النعمان فقال ‏\"‏ لا تشربوا في نقير ولا مزفت ولا دباء ولا حنتم واشربوا في الجلد الموكإ عليه فإن اشتد فاكسروه بالماء فإن أعياكم فأهريقوه ‏\"‏ ‏.‏",
      "text_en": " A man of the deputation of 'Abd al-Qais who came to the Prophet (ﷺ) said - the narrator 'Awf thinks that his name was Qais bin al-Nu'man:                      The Prophet (ﷺ) said: Do not drink from hollowed stumps, vessel smeared with pitch, pumpkins, and green jars, but drink from a skin which is tied with string. If the drink ferments, lighten it by infusing water. If you are helpless, then pour it away.",
      "chain": [
        "30569",
        "20423",
        "11298"
      ]
    },
    {
      "hadith_no": "3960",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book of Manumission of Slaves - كتاب العتق",
      "chapter_no": "31",
      "text_ar": "حدثنا وهب بن بقية، حدثنا خالد بن عبد الله، - هو الطحان - عن خالد، عن أبي قلابة، عن أبي زيد، أن رجلا، من الأنصار بمعناه وقال - يعني النبي صلى الله عليه وسلم - ‏\"‏ لو شهدته قبل أن يدفن لم يدفن في مقابر المسلمين ‏\"‏ ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Abu Qilabah from Abu Zaid through a different chain of narrators to the same effect:                      A man of the Ansar ... The Prophet (ﷺ) said: Had I been present before his burial, he would not have been buried in a Muslim cemetry.",
      "chain": [
        "30569",
        "20423",
        "11047"
      ]
    },
    {
      "hadith_no": "4153",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا وهب بن بقية، أخبرنا خالد، عن سهيل، - يعني ابن أبي صالح - عن سعيد بن يسار الأنصاري، عن زيد بن خالد الجهني، عن أبي طلحة الأنصاري، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ لا تدخل الملائكة بيتا فيه كلب ولا تمثال ‏\"‏ ‏.‏ وقال انطلق بنا إلى أم المؤمنين عائشة نسألها عن ذلك ‏.‏ فانطلقنا فقلنا يا أم المؤمنين إن أبا طلحة حدثنا عن رسول الله صلى الله عليه وسلم بكذا وكذا فهل سمعت النبي صلى الله عليه وسلم يذكر ذلك قالت لا ولكن سأحدثكم بما رأيته فعل خرج رسول الله صلى الله عليه وسلم في بعض مغازيه وكنت أتحين قفوله فأخذت نمطا كان لنا فسترته على العرض فلما جاء استقبلته فقلت السلام عليك يا رسول الله ورحمة الله وبركاته الحمد لله الذي أعزك وأكرمك فنظر إلى البيت فرأى النمط فلم يرد على شيئا ورأيت الكراهية في وجهه فأتى النمط حتى هتكه ثم قال ‏\"‏ إن الله لم يأمرنا فيما رزقنا أن نكسو الحجارة واللبن ‏\"‏ ‏.‏ قالت فقطعته وجعلته وسادتين وحشوتهما ليفا فلم ينكر ذلك على ‏.‏",
      "text_en": " Narrated Abu Talhat al-Ansari:                     I heard the Prophet (ﷺ) say: The angels do not enter a house which contains a dog or a picture. Zaid b. Khalid al-Juhani said to Sa'id b. Yasar al-Ansari, the transmitter of this tradition: Go with me to 'Aishah, Mother of Faithful, so that we ask about it. So we went and said to her: Mother of Faithful, Abu Talhah has transmitted to us a tradition so-and-so. Have you heard the Prophet (ﷺ) mentioning that ? She replied: No but I tell what I saw him doing. The Messenger of Allah (ﷺ) went on an expedition and I was waiting for his return. I got a carpet which I hung as a screen on a stick over the door. When he came I received him and said: Peace be upon you, Messenger of Allah, His mercy and His blessings. Praise to be Allah Who gave you dominance and respect. Then he looked at the house and saw the carpet; and he did not respond to me at all. I found (signs of) disapproval in his face. He then came to the carpet and tore it down. He then said: Allah has not commanded us to clothe stones and clay out of the sustenance He has given us. She said: I then cut it to pieces and made two pillows out of it and stuffed them with palm fibre, and he did not disapprove of it to me.",
      "chain": [
        "30569",
        "20423",
        "11173",
        "11170",
        "3625",
        "229"
      ]
    },
    {
      "hadith_no": "4215",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Signet-Rings (Kitab Al-Khatam) - كتاب الخاتم",
      "chapter_no": "36",
      "text_ar": "حدثنا وهب بن بقية، عن خالد، عن سعيد، عن قتادة، عن أنس، بمعنى حديث عيسى بن يونس زاد فكان في يده حتى قبض وفي يد أبي بكر حتى قبض وفي يد عمر حتى قبض وفي يد عثمان فبينما هو عند بئر إذ سقط في البئر فأمر بها فنزحت فلم يقدر عليه ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Anas through a different chain of narrators. This version as transmitted by 'Isa b. Yunus adds:                      It remained in his hand until he died, in the hand of 'Abu Bakr until he died, in the hand of 'Umar until he died, and in the hand of 'Uthman. When he was near a well, it fell down in it. He ordered to take it out, but it could not be found.",
      "chain": [
        "30569",
        "20423",
        "11168",
        "11019"
      ]
    },
    {
      "hadith_no": "4338",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا وهب بن بقية، عن خالد، ح وحدثنا عمرو بن عون، أخبرنا هشيم، - المعنى - عن إسماعيل، عن قيس، قال قال أبو بكر بعد أن حمد الله، وأثنى، عليه يا أيها الناس إنكم تقرءون هذه الآية وتضعونها على غير مواضعها ‏{‏ عليكم أنفسكم لا يضركم من ضل إذا اهتديتم ‏}‏ قال عن خالد وإنا سمعنا النبي صلى الله عليه وسلم يقول ‏\"‏ إن الناس إذا رأوا الظالم فلم يأخذوا على يديه أوشك أن يعمهم الله بعقاب ‏\"‏ ‏.‏ وقال عمرو عن هشيم وإني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ما من قوم يعمل فيهم بالمعاصي ثم يقدرون على أن يغيروا ثم لا يغيروا إلا يوشك أن يعمهم الله منه بعقاب ‏\"‏ ‏.‏ قال أبو داود رواه كما قال خالد أبو أسامة وجماعة ‏.‏ وقال شعبة فيه ‏\"‏ ما من قوم يعمل فيهم بالمعاصي هم أكثر ممن يعمله ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Bakr:                     You people recite this verse \"You who believe, care for yourselves; he who goes astray cannot harm you when you are rightly-guided,\" and put it in its improper place. Khalid's version has: We heard the Prophet (ﷺ) say: When the people see a wrongdoer and do not prevent him, Allah will soon punish them all. Amr ibn Hushaym's version has: I heard the Messenger of Allah (ﷺ) say: If acts of disobedience are done among any people and do not change them though the are able to do so, Allah will soon punish them all.Adu Dawud said: This tradition has also been transmitted by Abu Usamah and a group transmitters similar to the version narrated by Khalid. The version of Shu'bah has: \"If acts of obedience are done among any people who are more numerous than those who do them....\"",
      "chain": [
        "30569",
        "20423",
        "30154",
        "20208",
        "11046"
      ]
    },
    {
      "hadith_no": "4416",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا وهب بن بقية، ومحمد بن الصباح بن سفيان، قالا حدثنا هشيم، عن منصور، عن الحسن، بإسناد يحيى ومعناه قالا ‏\"‏ جلد مائة والرجم ‏\"‏ ‏.‏",
      "text_en": " A similar tradition has been transmitted by al-Hasan through a chain of Yahya and to the same effect. This version adds:                      They shall receive a hundred lashes and toned to death.",
      "chain": [
        "30569",
        "30269",
        "20468",
        "11067"
      ]
    },
    {
      "hadith_no": "4453",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا وهب بن بقية، عن هشيم، عن مغيرة، عن إبراهيم، والشعبي، عن النبي صلى الله عليه وسلم نحوه لم يذكر فدعا بالشهود فشهدوا ‏.‏",
      "text_en": " A similar tradition has also been transmitted by Ibrahim and al-Sha’bi from the Prophet (ﷺ) through a different chain of narrators. But this version does not mention the words:                      He called the witnesses who testified.",
      "chain": [
        "30569",
        "20468",
        "11072",
        "11051",
        "11052"
      ]
    },
    {
      "hadith_no": "4454",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا وهب بن بقية، عن هشيم، عن ابن شبرمة، عن الشعبي، بنحو منه ‏.‏",
      "text_en": " A similar tradition has also been transmitted by al-Sha’bi through a different chain of narrators.",
      "chain": [
        "30569",
        "20468"
      ]
    },
    {
      "hadith_no": "4511",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا وهب بن بقية، حدثنا خالد، عن محمد بن عمرو، عن أبي سلمة، أن رسول الله صلى الله عليه وسلم أهدت له يهودية بخيبر شاة مصلية نحو حديث جابر قال فمات بشر بن البراء بن معرور الأنصاري فأرسل إلى اليهودية ‏\"‏ ما حملك على الذي صنعت ‏\"‏ ‏.‏ فذكر نحو حديث جابر فأمر بها رسول الله صلى الله عليه وسلم فقتلت ولم يذكر أمر الحجامة ‏.‏",
      "text_en": " Narrated AbuSalamah:                     A Jewess presented a roasted sheep to the Messenger of Allah (ﷺ) at Khaybar. He then mentioned the rest of the tradition like that of Jabir (No. 4495). He said: Then Bashir ibn al-Bara' ibn Ma'rur al-Ansari died. He sent someone to call on the Jewess, and said to her (when she came): What motivated you to do the work you have done?  He then mentioned the rest of the tradition similar to the one mentioned by Jabir (No. 4495). The Messenger of Allah (ﷺ) then ordered regarding her and she was killed. But he (AbuSalamah) did not mention the matter of cupping.",
      "chain": [
        "30569",
        "20423",
        "11220",
        "10567"
      ]
    },
    {
      "hadith_no": "4512",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا وهب بن بقية، عن خالد، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال كان رسول الله صلى الله عليه وسلم يقبل الهدية ولا يأكل الصدقة ‏.‏ وحدثنا وهب بن بقية في موضع آخر عن خالد عن محمد بن عمرو عن أبي سلمة ولم يذكر أبا هريرة قال كان رسول الله صلى الله عليه وسلم يقبل الهدية ولا يأكل الصدقة ‏.‏ زاد فأهدت له يهودية بخيبر شاة مصلية سمتها فأكل رسول الله صلى الله عليه وسلم منها وأكل القوم فقال ‏\"‏ ارفعوا أيديكم فإنها أخبرتني أنها مسمومة ‏\"‏ ‏.‏ فمات بشر بن البراء بن معرور الأنصاري فأرسل إلى اليهودية ‏\"‏ ما حملك على الذي صنعت ‏\"‏ ‏.‏ قالت إن كنت نبيا لم يضرك الذي صنعت وإن كنت ملكا أرحت الناس منك ‏.‏ فأمر بها رسول الله صلى الله عليه وسلم فقتلت ثم قال في وجعه الذي مات فيه ‏\"‏ ما زلت أجد من الأكلة التي أكلت بخيبر فهذا أوان قطعت أبهري ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     The Messenger of Allah (ﷺ) would accept a present, but would not accept alms (sadaqah).And Wahb bin Baqiyyah narrated to us, elsewhere, from Khalid, from Muhammad ibn Amr said on the authority of AbuSalamah, and he did not mention the name of Abu Hurairah: The Messenger of Allah (ﷺ) used to accept presents but not alms (sadaqah).  This version adds: So a Jewess presented him at Khaybar with a roasted sheep which she had poisoned. The Messenger of Allah (ﷺ) ate of it and the people also ate.  He then said: Take away your hands (from the food), for it has informed me that it is poisoned. Bishr ibn al-Bara' ibn Ma'rur al-Ansari died.  So he (the Prophet) sent for the Jewess (and said to her): What motivated you to do the work you have done?  She said: If you were a prophet, it would not harm you; but if you were a king, I should  rid the people of you. The Messenger of Allah (ﷺ) then ordered regarding her and she was killed. He then said about the pain of which he died: I continued to feel pain from the morsel which I had eaten at Khaybar. This is the time when it has cut off my aorta.",
      "chain": [
        "30569",
        "20423",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "4596",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا وهب بن بقية، عن خالد، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ افترقت اليهود على إحدى أو ثنتين وسبعين فرقة وتفرقت النصارى على إحدى أو ثنتين وسبعين فرقة وتفترق أمتي على ثلاث وسبعين فرقة ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: The Jews were split up into seventy-one or seventy-two sects; and the Christians were split up into seventy one or seventy-two sects; and my community will be split up into seventy-three sects.",
      "chain": [
        "30569",
        "20423",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "4783",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا وهب بن بقية، عن خالد، عن داود، عن بكر، أن النبي صلى الله عليه وسلم بعث أبا ذر بهذا الحديث ‏.‏ قال أبو داود وهذا أصح الحديثين ‏.‏",
      "text_en": " BAKR SAID:                      THE PROPHET (MAY PEACE BE UPON HIM) SENT MU’ADH FOR SOME OF HIS WORK. HE THEN TRANSMITTED THE REST OF THE TRADITION MENTIONED ABOVE.ABU DAWUD SAID: THIS TRADITION IS SOUNDER OF THE TWO TRADITIONS.",
      "chain": [
        "30569",
        "20423",
        "11267"
      ]
    },
    {
      "hadith_no": "4863",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا وهب بن بقية، أخبرنا خالد، عن حميد، عن أنس، قال كان النبي صلى الله عليه وسلم إذا مشى كأنه يتوكأ ‏.‏",
      "text_en": " Anas said:                      when the Prophet(ﷺ) walked, it looked as if he bent forwards.",
      "chain": [
        "30569",
        "20423",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "4982",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا وهب بن بقية، عن خالد، - يعني ابن عبد الله - عن خالد، - يعني الحذاء - عن أبي تميمة، عن أبي المليح، عن رجل، قال كنت رديف النبي صلى الله عليه وسلم فعثرت دابته فقلت تعس الشيطان ‏.‏ فقال ‏\"‏ لا تقل تعس الشيطان فإنك إذا قلت ذلك تعاظم حتى يكون مثل البيت ويقول بقوتي ولكن قل بسم الله فإنك إذا قلت ذلك تصاغر حتى يكون مثل الذباب ‏\"‏ ‏.‏",
      "text_en": " Abu al-Malih reported on the authority of a man :                      I was riding on a mount behind the prophet (May peace be upon him). It stumbled. Thereupon I said: May the devil perish! He said: do not say; may the devil perish! For you say that, he will swell so much so that he will be like a house, and say: by my power. But say: in the name of Allah; for when you say that, he will diminish so much so that he will be like a fly.",
      "chain": [
        "30569",
        "20423",
        "11282",
        "11453"
      ]
    },
    {
      "hadith_no": "4998",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا وهب بن بقية، أخبرنا خالد، عن حميد، عن أنس، أن رجلا، أتى النبي صلى الله عليه وسلم فقال يا رسول الله احملني ‏.‏ قال النبي صلى الله عليه وسلم ‏\"‏ إنا حاملوك على ولد ناقة ‏\"‏ ‏.‏ قال وما أصنع بولد الناقة فقال النبي صلى الله عليه وسلم ‏\"‏ وهل تلد الإبل إلا النوق ‏\"‏ ‏.‏",
      "text_en": " Narrated Anas ibn Malik:                     A man came to the Prophet (ﷺ) and said: Messenger of Allah! give me a mount. The Prophet (ﷺ) said: We shall give you a she-camel's child  to ride on. He said: What shall I do with a she-camel's child? The Prophet (ﷺ) replied: Do any others than she-camels give birth to camels?",
      "chain": [
        "30569",
        "20423",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "5051",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا وهيب، ح وحدثنا وهب بن بقية، عن خالد، نحوه عن سهيل، عن أبيه، عن أبي هريرة، عن النبي صلى الله عليه وسلم أنه كان يقول إذا أوى إلى فراشه ‏\"‏ اللهم رب السموات ورب الأرض ورب كل شىء فالق الحب والنوى منزل التوراة والإنجيل والقرآن أعوذ بك من شر كل ذي شر أنت آخذ بناصيته أنت الأول فليس قبلك شىء وأنت الآخر فليس بعدك شىء وأنت الظاهر فليس فوقك شىء وأنت الباطن فليس دونك شىء ‏\"‏ ‏.‏ زاد وهب في حديثه ‏\"‏ اقض عني الدين وأغنني من الفقر ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah said:                      when the prophet (May peace be upon him) went to his bed, he used to say : O Allah! Lord of the heavens, Lord of the earth, Lord of everything, who splittest the grain and the kernel, who hast sent down the Torah, forelock Thou seizes. Thou art the first and there is nothing before thee; Thou art the Last and there is nothing after Thee; Thou art the Outward and there is nothing above Thee; Thou art the Inward and there is nothing below Thee. Wahb added in his version : pay the debt for me and grant me riches instead of  poverty.",
      "chain": [
        "20040",
        "20299",
        "30569",
        "20423",
        "13"
      ]
    },
    {
      "hadith_no": "5071",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا وهب بن بقية، عن خالد، ح وحدثنا محمد بن قدامة بن أعين، حدثنا جرير، عن الحسن بن عبيد الله، عن إبراهيم بن سويد، عن عبد الرحمن بن يزيد، عن عبد الله، أن النبي صلى الله عليه وسلم كان يقول إذا أمسى ‏\"‏ أمسينا وأمسى الملك لله والحمد لله لا إله إلا الله وحده لا شريك له ‏\"‏ ‏.‏ زاد في حديث جرير وأما زبيد كان يقول كان إبراهيم بن سويد يقول ‏\"‏ لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شىء قدير رب أسألك خير ما في هذه الليلة وخير ما بعدها وأعوذ بك من شر ما في هذه الليلة وشر ما بعدها رب أعوذ بك من الكسل ومن سوء الكبر أو الكفر رب أعوذ بك من عذاب في النار وعذاب في القبر ‏\"‏ ‏.‏ وإذا أصبح قال ذلك أيضا ‏\"‏ أصبحنا وأصبح الملك لله ‏\"‏ ‏.‏ قال أبو داود رواه شعبة عن سلمة بن كهيل عن إبراهيم بن سويد قال ‏\"‏ من سوء الكبر ‏\"‏ ‏.‏ ولم يذكر سوء الكفر ‏.‏",
      "text_en": "  ‘Abd Allah (b. Mas’ud) told that when the evening came, the prophet (May peace be upon him) would say:                      we have come to the evening, and in the evening the dominion belongs to Allah: “Praise be to Allah; there is no god but Allah alone who has no partner”. The version of Jarir adds: Zubaid said that Ibrahim b. Suwaid said: There is no god but Allah alone who has no partner; to him belongs the dominion, to him praise is due, and He is omnipotent. O Allah! I ask thee for the good of what this night contains, and the good of what comes after it; and I seek refuge in Thee from the evil of what this night contains, and from the evil of what comes after it. My Lord! I seek refuge in Thee from indolence, the evil of old age or of disbelief. My Lord! I seek refuge in Thee from a punishment in Hell and a punishment in the grave. In the morning he said that also: we have come to the morning, and in the morning the dominion belongs to Allah.Abu Dawud said: Shu’bah transmitted from Salamah b. Kuhail, from Ibrahim b. Suwaid, saying: from the evil of old age. He did not mention the evil of disbelief.",
      "chain": [
        "30569",
        "20423",
        "38573",
        "20028",
        "10755",
        "10887",
        "20395",
        "18"
      ]
    },
    {
      "hadith_no": "5127",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا وهب بن بقية، حدثنا خالد، عن يونس بن عبيد، عن ثابت، عن أنس بن مالك، قال رأيت أصحاب رسول الله صلى الله عليه وسلم فرحوا بشىء لم أرهم فرحوا بشىء أشد منه قال رجل يا رسول الله الرجل يحب الرجل على العمل من الخير يعمل به ولا يعمل بمثله فقال رسول الله صلى الله عليه وسلم ‏\"‏ المرء مع من أحب ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik said :                      I never saw the Companions of the Messenger of Allah (May peace be upon him) so happy about anything as I saw them happy about this thing. A man said : Messenger of Allah! A man loves another man for the good work which he does, but he himself cannot do like it. The Messenger of Allah (May peace be upon him) said: A man will be with those whom he loves.",
      "chain": [
        "30569",
        "20423",
        "11075",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "5244",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا وهب بن بقية، أخبرنا خالد، عن واصل، عن يحيى بن عقيل، عن يحيى بن يعمر، عن أبي الأسود الديلي، عن أبي ذر، بهذا الحديث وذكر النبي صلى الله عليه وسلم في وسطه ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Abu Dharr through a different chain of narrators. In this version the transmitter mentioned the Prophet(ﷺ) in the middle of the tradition.",
      "chain": [
        "30569",
        "20423",
        "10726",
        "11316",
        "11114",
        "23"
      ]
    },
    {
      "hadith_no": "2402",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا زكرياء بن يحيى، قال حدثنا وهب بن بقية، قال أنبأنا خالد، عن خالد، - وهو الحذاء - عن أبي قلابة، عن أبي المليح، قال دخلت مع أبيك زيد على عبد الله بن عمرو فحدث أن رسول الله صلى الله عليه وسلم ذكر له صومي فدخل على فألقيت له وسادة أدم ربعة حشوها ليف فجلس على الأرض وصارت الوسادة فيما بيني وبينه قال ‏\"‏ أما يكفيك من كل شهر ثلاثة أيام ‏\"‏ ‏.‏ قلت يا رسول الله ‏.‏ قال ‏\"‏ خمسا ‏\"‏ ‏.‏ قلت يا رسول الله ‏.‏ قال ‏\"‏ سبعا ‏\"‏ ‏.‏ قلت يا رسول الله ‏.‏ قال ‏\"‏ تسعا ‏\"‏ ‏.‏ قلت يا رسول الله ‏.‏ قال ‏\"‏ إحدى عشرة ‏\"‏ ‏.‏ قلت يا رسول الله ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ لا صوم فوق صوم داود شطر الدهر صيام يوم وفطر يوم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn Al-Malih said:                     \"I entered with Zaid upon 'Abdullah bin Amr and he narrated: 'The Messenger of Allah was told about my fasting, so the entered upon me and I gave him an average-sized leather pillow that was stuffed with palm fibvers. He sat in the ground with the pillow between myself and him, and said: \"Whill it not be sufficient for you to fast three days each months?\" I said: O Messenger of Allah! He said: \"O Messenger of Allah!\" He said: \"Eleven.\" I said: \"O Messenger of Allah!\" Then the Prophet said: \"There is not fast better than the fast of Dawud, half of a lifetime, fasting one day and not next.\"",
      "chain": [
        "30193",
        "30569",
        "20423",
        "11282",
        "11047",
        "11453"
      ]
    }
  ],
  "total_hadiths": 46
}