{
  "id": "30585",
  "name": "'Abbas bin Muhammad bin Hatm عباس بن محمد بن حاتم",
  "full_name": "'Abbas bin Muhammad bin Hatm عباس بن محمد بن حاتم",
  "grade": "3rd Century AH [11th generation]",
  "reliability_grade": "Thiqah Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "351",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Baghdad"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ 4  -  ثقة حافظ ]"
    ],
    "tags": [
      "al-Baghdadi"
    ],
    "area_of_interest_display": [
      {
        "en": "Narrator[Grade:Thiqah Thiqah] [ 4  -  ثقة حافظ ]",
        "ar": "Narrator[Grade:Thiqah Thiqah] [ 4  -  ثقة حافظ ]",
        "ckb": "Narrator[Grade:Thiqah Thiqah] [ 4  -  ثقة حافظ ]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "al-Baghdad",
        "ar": "al-Baghdad",
        "ckb": "al-Baghdad"
      }
    ],
    "tags_display": [
      {
        "en": "al-Baghdadi",
        "ar": "al-Baghdadi",
        "ckb": "al-Baghdadi"
      }
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "id": "jami-al-tirmidhi-514",
      "hadith_no": "514",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on the Day of Friday - كِتَاب الْجُمُعَةِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
      "chapter_no": "4",
      "text_ar": "حدثنا محمد بن حميد الرازي، وعباس بن محمد الدوري، قالا حدثنا أبو عبد الرحمن المقرئ، عن سعيد بن أبي أيوب، حدثني أبو مرحوم، عن سهل بن معاذ، عن أبيه، أن النبي صلى الله عليه وسلم نهى عن الحبوة يوم الجمعة والإمام يخطب ‏.‏ قال أبو عيسى وهذا حديث حسن ‏.‏ وأبو مرحوم اسمه عبد الرحيم بن ميمون ‏.‏ وقد كره قوم من أهل العلم الحبوة يوم الجمعة والإمام يخطب ورخص في ذلك بعضهم منهم عبد الله بن عمر وغيره وبه يقول أحمد وإسحاق لا يريان بالحبوة والإمام يخطب بأسا ‏.‏",
      "text_en": " Sahl bin Ma'adh narrated from his father:                     \"The Prophet prohibited Al-Habwah on Friday while the Imam is delivering the Khutbah.\"",
      "usc_msa_ref": "",
      "chain": [
        "38495",
        "30585",
        "20375"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-1320",
      "hadith_no": "1320",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا عباس بن محمد الدوري، حدثنا عبد الوهاب بن عطاء، أخبرنا إسرائيل، عن زيد بن عطاء بن السائب، عن محمد بن المنكدر، عن جابر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ غفر الله لرجل كان قبلكم كان سهلا إذا باع سهلا إذا اشترى سهلا إذا اقتضى ‏\"‏ ‏.‏ قال هذا حديث صحيح حسن غريب من هذا الوجه ‏.‏",
      "text_en": " Narrated Jabir:                     That the Messenger of Allah (ﷺ) said: \"Allah forgave a man who was before you: He was tolerant when selling, tolerant when purchasing, and tolerant when repaying.\"He said: This Hadith is Gharib Sahih Hasan from this route.",
      "usc_msa_ref": "",
      "chain": [
        "30585",
        "20557",
        "20311",
        "11048",
        "34"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-2153",
      "hadith_no": "2153",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا عباس الدوري، وغير، واحد، قالوا حدثنا عبد الله بن يزيد المقرئ، حدثنا سعيد بن أبي أيوب، حدثني أبو مرحوم عبد الرحيم بن ميمون، عن سهل بن معاذ بن أنس الجهني، عن أبيه، عن النبي صلى الله عليه وسلم قال ‏\"‏ من كظم غيظا وهو يستطيع أن ينفذه دعاه الله يوم القيامة على رءوس الخلائق حتى يخيره في أى الحور شاء ‏\"‏ ‏.‏ قال هذا حديث حسن غريب ‏.‏",
      "text_en": " Sahl bim Mu'adh bin Anas Al-Juhani narrated that the Messenger of Allah said:                     \"Whoever suppresses his rage while he is able to unleash it, Allah will call him before the heads (leaders) of creation on the Day of Judgement, so that he can inform Him of which of the Hur he would like.\"",
      "usc_msa_ref": "",
      "chain": [
        "30585",
        "23033",
        "20375",
        "19814"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-2170",
      "hadith_no": "2170",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Medicine - كتاب الطب عن رسول اللَّهِ صلى الله عليه وسلم",
      "chapter_no": "28",
      "text_ar": "حدثنا عباس بن محمد الدوري، حدثنا يونس بن محمد، حدثنا فليح بن سليمان، عن عثمان بن عبد الرحمن التيمي، عن يعقوب بن أبي يعقوب، عن أم المنذر، قالت دخل على رسول الله صلى الله عليه وسلم ومعه علي ولنا دوال معلقة قالت فجعل رسول الله صلى الله عليه وسلم يأكل وعلي معه يأكل ‏.‏ فقال رسول الله صلى الله عليه وسلم لعلي ‏\"‏ مه مه يا علي فإنك ناقه ‏\"‏ ‏.‏ قال فجلس علي والنبي صلى الله عليه وسلم يأكل ‏.‏ قالت فجعلت لهم سلقا وشعيرا فقال النبي صلى الله عليه وسلم ‏\"‏ يا علي من هذا فأصب فإنه أوفق لك ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من حديث فليح ‏.‏ ويروى عن فليح عن أيوب بن عبد الرحمن ‏.‏",
      "text_en": " Umm Al-Mundhir said:                     The Messenger of Allah (s.a.w) entered upon me, while 'Ali was with him, and we had a cluster of unripe dates hanging.\" She said: \"The Messenger of Allah (s.a.w) said to 'Ali: 'Stop, stop, for you are still recovering.' So 'Ali sat and the Prophet ate.\" She said: 'I made some chard and barley for them, so the Prophet said: 'O 'Ali eat from this, for indeed it will be more suitable for you.\"",
      "usc_msa_ref": "",
      "chain": [
        "30585",
        "20393",
        "20169",
        "11525",
        "12604"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-2332",
      "hadith_no": "2332",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا عباس بن محمد الدوري، حدثنا خالد بن مخلد، حدثنا عبد الله بن عمر العمري، عن سعد بن سعيد الأنصاري، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تقوم الساعة حتى يتقارب الزمان فتكون السنة كالشهر والشهر كالجمعة وتكون الجمعة كاليوم ويكون اليوم كالساعة وتكون الساعة كالضرمة بالنار ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب من هذا الوجه ‏.‏ وسعد بن سعيد هو أخو يحيى بن سعيد الأنصاري ‏.‏",
      "text_en": " Anas bin Malik narrated that the Allah's Messenger (s.a.w) said:                     \"The hour shall not be established until time is constricted, and the year is like a month, a month is like the week, and the week is like the day, and the day is like the hour, and the hour is like the flare of the fire.\"",
      "usc_msa_ref": "",
      "chain": [
        "30585",
        "30463",
        "20507",
        "11853",
        "19"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-2359",
      "hadith_no": "2359",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا عباس بن محمد الدوري، حدثنا يحيى بن أبي بكير، حدثنا حريز بن عثمان، عن سليم بن عامر، قال سمعت أبا أمامة، يقول ما كان يفضل عن أهل، بيت النبي صلى الله عليه وسلم خبز الشعير ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه ‏.‏ ويحيى بن أبي بكير هذا كوفي وأبو بكير والد يحيى روى له سفيان الثوري ويحيى بن عبد الله بن بكير مصري صاحب الليث ‏.‏",
      "text_en": " Abu Umamah narrated:                     \"There was never a surplus of barley  bread for the inhabitants of the house of the Messenger of Allah (s.a.w).\"",
      "usc_msa_ref": "",
      "chain": [
        "30585",
        "20365",
        "11684",
        "10915",
        "4048"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-2669",
      "hadith_no": "2669",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا عباس بن محمد الدوري، حدثنا عبد الله بن يزيد المقرئ، حدثنا سعيد بن أبي أيوب، عن أبي مرحوم عبد الرحيم بن ميمون، عن سهل بن معاذ بن أنس الجهني، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من ترك اللباس تواضعا لله وهو يقدر عليه دعاه الله يوم القيامة على رءوس الخلائق حتى يخيره من أى حلل الإيمان شاء يلبسها ‏\"‏ ‏.‏ هذا حديث حسن ‏.‏ ومعنى قوله ‏\"‏ حلل الإيمان ‏\"‏ ‏.‏ يعني ما يعطى أهل الإيمان من حلل الجنة ‏.‏",
      "text_en": " Sahl bin Mu'adh bin Anas Al-Juhani narrated from his father, that the Messenger of Allah (s.a.w)said:                     \"Whoever leaves(valuable) dress out of humility to Allah while he is able to (afford it), Allah will call him before the heads of creation on the Day of Judgement so that he can chose whichever Hulal of faith he wishes to wear.\"",
      "usc_msa_ref": "",
      "chain": [
        "30585",
        "23033",
        "20375",
        "19814"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-2681",
      "hadith_no": "2681",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا عبد بن حميد، وعباس بن محمد الدوري، قالا حدثنا عبد الله بن يزيد المقرئ، حدثنا سعيد بن أبي أيوب، حدثني أبو مرحوم عبد الرحيم بن ميمون، عن سهل بن معاذ بن أنس، عن أبيه، أن النبي صلى الله عليه وسلم قال ‏\"‏ من كظم غيظا وهو يقدر على أن ينفذه دعاه الله على رءوس الخلائق يوم القيامة حتى يخيره في أى الحور شاء ‏\"‏ ‏.‏ قال هذا حديث حسن غريب ‏.‏",
      "text_en": " Sahl bin Mu'ad bin Anas narrated from his father, that the Prophet (s.a.w) said:                     \"Whoever suppresses his rage, while he is able to exact it, Allah will call him before the heads of creation [on the Day of Judgement] so that he can chose whichever of the Hur he wishes.\"",
      "usc_msa_ref": "",
      "chain": [
        "30553",
        "30585",
        "23033",
        "20375",
        "19814",
        "16045"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-2712",
      "hadith_no": "2712",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا عباس الدوري، حدثنا يحيى بن أبي بكير، عن إسرائيل، بهذا الإسناد نحوه ‏.‏ وسألت محمد بن إسماعيل عن هذا الحديث، فلم يعرفه إلا من حديث إسرائيل ولم يعرف اسم أبي بشر ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30585",
        "20365",
        "20311",
        "34188"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-2713",
      "hadith_no": "2713",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا عباس بن محمد الدوري، حدثنا عبد الله بن يزيد، حدثنا سعيد بن أبي أيوب، عن أبي مرحوم عبد الرحيم بن ميمون، عن سهل بن معاذ بن أنس الجهني، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من أعطى لله ومنع لله وأحب لله وأبغض لله وأنكح لله فقد استكمل إيمانه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏",
      "text_en": " Sahl bin Mu'adh[bin Anas] Al-Juhni narrated from his father that the Prophet (s.a.w) said:                     \"Whoever gives for the sake of Allah, withholds for the sake of Allah, loves for the sake of Allah, hates for the sake of Allah, and marries for the sake of Allah, he has indeed perfected his faith.\"",
      "usc_msa_ref": "",
      "chain": [
        "30585",
        "1945",
        "20375",
        "19814"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-2715",
      "hadith_no": "2715",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on the description of Paradise - كتاب صفة الجنة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "38",
      "text_ar": "حدثنا عباس الدوري، حدثنا عبيد الله بن موسى، عن شيبان، عن فراس، عن عطية، عن أبي سعيد الخدري، عن النبي صلى الله عليه وسلم قال ‏\"‏ في الجنة شجرة يسير الراكب في ظلها مائة عام لا يقطعها وقال ذلك الظل الممدود ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب من حديث أبي سعيد ‏.‏",
      "text_en": " Abu Sa'eed Al-Khudri narrated that the Prophet (s.a.w) said:                     \"In Paradise there is a tree, a rider will travel in its shade for a hundred years without reaching an end.\"",
      "usc_msa_ref": "",
      "chain": [
        "30585",
        "20340",
        "20240",
        "11385",
        "38"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-2778",
      "hadith_no": "2778",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on the Description of Hellfire - كتاب صفة جهنم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "39",
      "text_ar": "حدثنا عباس الدوري، حدثنا عبيد الله بن موسى، أخبرنا شيبان، عن الأعمش، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن غلظ جلد الكافر اثنان وأربعون ذراعا وإن ضرسه مثل أحد وإن مجلسه من جهنم كما بين مكة والمدينة ‏\"‏ ‏.‏ هذا حديث حسن صحيح غريب من حديث الأعمش ‏.‏",
      "text_en": " Abu Hurairah narrated that the Prophet (s.a.w) said:                     \"Indeed a disbeliever's skin will be forty-two forearm lengths thick, his molar teeth will be like Uhud (mountain), and his sitting place in Hell will be like what is between Makkah and Al-Madinah.\"",
      "usc_msa_ref": "",
      "chain": [
        "30585",
        "20340",
        "20240",
        "11060",
        "11161",
        "13"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-4068",
      "hadith_no": "4068",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن، وعباس بن محمد الدوري، وغير، واحد المعنى، واحد، قالوا حدثنا سعيد بن عامر قال عبد الله أخبرنا سعيد بن عامر عن يحيى بن أبي الحجاج المنقري عن أبي مسعود الجريري عن ثمامة بن حزن القشيري قال شهدت الدار حين أشرف عليهم عثمان فقال ائتوني بصاحبيكم اللذين ألباكم على ‏.‏ قال فجيء بهما فكأنهما جملان أو كأنهما حماران ‏.‏ قال فأشرف عليهم عثمان فقال أنشدكم بالله والإسلام هل تعلمون أن رسول الله صلى الله عليه وسلم قدم المدينة وليس بها ماء يستعذب غير بئر رومة فقال رسول الله ‏\"‏ من يشتري بئر رومة فيجعل دلوه مع دلاء المسلمين بخير له منها في الجنة ‏\"‏ ‏.‏ فاشتريتها من صلب مالي فأنتم اليوم تمنعوني أن أشرب منها حتى أشرب من ماء البحر ‏.‏ قالوا اللهم نعم ‏.‏ قال أنشدكم بالله والإسلام هل تعلمون أن المسجد ضاق بأهله فقال رسول الله صلى الله عليه وسلم ‏\"‏ من يشتري بقعة آل فلان فيزيدها في المسجد بخير له منها في الجنة ‏\"‏ ‏.‏ فاشتريتها من صلب مالي فأنتم اليوم تمنعوني أن أصلي فيها ركعتين ‏.‏ قالوا اللهم نعم ‏.‏ قال أنشدكم بالله والإسلام هل تعلمون أني جهزت جيش العسرة من مالي قالوا اللهم نعم ‏.‏ ثم قال أنشدكم بالله والإسلام هل تعلمون أن رسول الله صلى الله عليه وسلم كان على ثبير مكة ومعه أبو بكر وعمر وأنا فتحرك الجبل حتى تساقطت حجارته بالحضيض قال فركضه برجله وقال ‏\"‏ اسكن ثبير فإنما عليك نبي وصديق وشهيدان ‏\"‏ ‏.‏ قالوا اللهم نعم ‏.‏ قال الله أكبر شهدوا لي ورب الكعبة أني شهيد ثلاثا ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ وقد روي من غير وجه عن عثمان ‏.‏",
      "text_en": " Narrated Thumamah bin Hazn Al-Qushairi:                     \"I was present at the house when 'Uthman appeared above them saying: 'Bring me your two companions who have gathered you against me.'\" He said: \"So they were brought as if they were two camels, or as if they were two donkeys.\" He said: \"'Uthman appeared above them and said: 'I ask you by Allah and Islam! Do you know that the Messenger of Allah (ﷺ) came to Al-Madinah and there was no water in it that was sweet except the well of Rumah, so the Messenger of Allah (ﷺ) said: 'Who will purchase this well of Rumah and place his bucket alongside the buckets of the Muslims, in exchange for better than that in Paradise?' So I bought it with the core of my wealth, and today you prevent me from drinking from it, so that I would have to drink from the water of the sea?' They said: 'O Allah! Yes!' He said: 'I ask you by Allah and Islam! Do you know that the Masjid, was insufficient for its people, so the Messenger of Allah (ﷺ) said: 'Who will purchase the land of the family of so-and-so, and add it to the Masjid in exchange for better than that in Paradise?' So I bought it with the core of my wealth, and today you prevent me from praying two Rak'ah in it?' They said: 'O Allah! Yes.' He said: 'I ask you by Allah and Islam! Do you know that I prepared the 'army of distress' from my wealth?' They said: 'O Allah! Yes!' Then he said: 'I ask you by Allah and Islam! Do you know that the Messenger of Allah (ﷺ) was on (mount) Thabir of Makkah, and with him was Abu Bakr, and 'Umar, and myself. The mountain began shaking until its rocks fell to the bottom.' He said: 'So he (ﷺ) stomped it with his foot and said: \"Be still O Thabir! For there is none upon except a Prophet, a Siddiq and two martyrs?\"' They said: 'O Allah! Yes!' He said: 'Allah is Great! Bear witness by the Lord of the Ka'bah that I am a martyr!' - three times.\"",
      "usc_msa_ref": "",
      "chain": [
        "30025",
        "30585",
        "20232",
        "18",
        "20232",
        "24486",
        "10673"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    }
  ],
  "total_hadiths": 13,
  "grade_display": {
    "en": "3rd Century AH [11th Generation]",
    "ar": "القرن الثالث الهجري [الجيل الحادي عشر]",
    "ckb": "سەدەی سێیەمی كۆچی [نەوەی یازدەیەم]"
  }
}