{
  "id": "30586",
  "name": "Muhammad bin 'Abdul Malik bin Zunjwiya محمد بن عبد الملك بن زنجويه الغزال",
  "full_name": "Muhammad bin 'Abdul Malik bin Zunjwiya محمد بن عبد الملك بن زنجويه الغزال",
  "grade": "3rd Century AH [11th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "258",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Baghdad"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ 4  -  ثقة ]"
    ],
    "tags": [
      "al-Baghdadi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "1454",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Shortening the Prayer When Traveling - كتاب تقصير الصلاة فى السفر",
      "chapter_no": "15",
      "text_ar": "أخبرنا محمد بن عبد الملك بن زنجويه، عن عبد الرزاق، عن ابن جريج، قال أخبرني إسماعيل بن محمد بن سعد، أن حميد بن عبد الرحمن، أخبره أن السائب بن يزيد أخبره أنه، سمع العلاء بن الحضرمي، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ يمكث المهاجر بعد قضاء نسكه ثلاثا ‏\"‏ ‏.‏",
      "text_en": " Al-'Ala bin Al-Hadrami said:                     \"The Messenger of Allah (ﷺ) said: 'The Muhajir may stay for three days after completing his rituals.'\"",
      "chain": [
        "30586",
        "20121",
        "11070",
        "11500",
        "10561",
        "3048",
        "586"
      ]
    },
    {
      "hadith_no": "2893",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن عبد الملك بن زنجويه، قال حدثنا عبد الرزاق، قال حدثنا جعفر بن سليمان، عن ثابت، عن أنس، قال دخل النبي صلى الله عليه وسلم مكة في عمرة القضاء وابن رواحة بين يديه يقول خلوا بني الكفار عن سبيله اليوم نضربكم على تأويله ضربا يزيل الهام عن مقيله ويذهل الخليل عن خليله قال عمر يا ابن رواحة في حرم الله وبين يدى رسول الله صلى الله عليه وسلم تقول هذا الشعر فقال النبي صلى الله عليه وسلم ‏\"‏ خل عنه فوالذي نفسي بيده لكلامه أشد عليهم من وقع النبل ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Anas said:                     \"The Prophet entered Makkah during Umratul-Qada' and Ibn Rawahah went before him, saying: Get out of his way, you unbelievers, make way.Today we will fight about its revelationWith blows that will remove heads from shouldersAnd make friend unmindful of friend.Umar said to him: \"O Ibn Rawahah! In the Sanctuary of Allah and in front of the Messenger of Allah you recite poetry?\" The Prophet said: \"Let him do that, for by the one in whose hand is my soul, his words are harder for them than being shot with arrows.\"",
      "chain": [
        "30586",
        "20121",
        "20532",
        "11269",
        "19"
      ]
    }
  ],
  "total_hadiths": 2
}