{
  "id": "30584",
  "name": "Sulaiman bin Da'ud bin Da'ud سليمان بن داود بن داود بن علي",
  "full_name": "Sulaiman bin Da'ud bin Da'ud سليمان بن داود بن داود بن علي",
  "grade": "3rd Century AH [10th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "219",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Baghdad"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ عخ  4  -  ثقة ]"
    ],
    "tags": [
      "Quraish",
      "B.Hashim",
      "al-Baghdadi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20509",
      "name": "'Abdur Rahman bin Abi al-Zanad عبد الرحمن بن أبي الزناد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20002",
      "name": "Imam Shafi'ee ابو عبد الله محمد بن إدريس الشافعي",
      "grade": "Succ. (Taba' Tabi') [9th generation] [Shafi'ee]"
    }
  ],
  "students": [
    {
      "id": "30292",
      "name": "Ahmed bin al-Hasan bin Junaydab أحمد بن الحسن بن جنيدب",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30115",
      "name": "al-Hasan bin 'Ali al-Halwani الحسن بن علي الخلال الحلواني",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30375",
      "name": "Muhammad bin Rafa'i محمد بن رافع",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30245",
      "name": "al-Hasan bin Muhammad al-Za'farani الحسن بن محمد الصباح الزعفراني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "34188",
      "name": "Muhammad bin Isma'il bin Ibrahim محمد بن إسماعيل بن إبراهيم بن مقسم",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30023",
      "name": "Muhammad bin Yahya bin Faris al-Dhahli محمد بن يحيى بن فارس الذهلي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38369",
      "name": "'Ubaidullah bin Fdalh عبيد الله بن فضالة بن إبراهيم النسائي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30437",
      "name": "'Abbas bin 'Abdul 'Azeem al-'Anbari عباس بن عبد العظيم العنبري",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30272",
      "name": "Muhammad bin 'Abdul Rahim bin Abi Zuhayr محمد بن عبد الرحيم بن أبي زهير البزاز",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    },
    {
      "id": "31513",
      "name": "al-Harith bin Muhammad bin Abi Usama الحارث بن محمد بن أبي أسامة",
      "grade": "3rd Century AH"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1072",
      "source": " Sahih Bukhari ",
      "chapter": "Prostration During Recital of Qur'an - كتاب سجود القرآن",
      "chapter_no": "17",
      "text_ar": "حدثنا سليمان بن داود أبو الربيع، قال حدثنا إسماعيل بن جعفر، قال أخبرنا يزيد بن خصيفة، عن ابن قسيط، عن عطاء بن يسار، أنه أخبره، أنه، سأل زيد بن ثابت  رضى الله عنه  فزعم أنه قرأ على النبي صلى الله عليه وسلم ‏{‏والنجم‏}‏ فلم يسجد فيها‏.‏",
      "text_en": " Narrated `Ata' bin Yasar:                     I asked Zaid bin Thabit about prostration on which he said that he had recited An-Najm before the Prophet, yet he (the Prophet) had not performed a prostration.",
      "chain": [
        "30584",
        "20155",
        "11235",
        "11236",
        "11020",
        "49"
      ]
    },
    {
      "hadith_no": "1579",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا سليمان بن داود أبو الربيع، حدثنا فليح، عن نافع، قال كان ابن عمر  رضى الله عنهما  إذا أراد الخروج إلى مكة ادهن بدهن ليس له رائحة طيبة، ثم يأتي مسجد الحليفة فيصلي ثم يركب، وإذا استوت به راحلته قائمة أحرم، ثم قال هكذا رأيت النبي صلى الله عليه وسلم يفعل‏.‏",
      "text_en": " Narrated Nafi`:                     Whenever Ibn `Umar intended to go to Mecca he used to oil himself with a sort of oil that had no pleasant smell, then he would go to the Mosque of Al-Hulaita and offer the prayer, and then ride. When he mounted well on his Mount and the Mount stood up straight, he would proclaim the intention of assuming Ihram, and he used to say that he had seen the Prophet doing the same.",
      "chain": [
        "30584",
        "20169",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2749",
      "source": " Sahih Bukhari ",
      "chapter": "Wills and Testaments (Wasaayaa) - كتاب الوصايا",
      "chapter_no": "55",
      "text_ar": "حدثنا سليمان بن داود أبو الربيع، حدثنا إسماعيل بن جعفر، حدثنا نافع بن مالك بن أبي عامر أبو سهيل، عن أبيه، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ آية المنافق ثلاث، إذا حدث كذب، وإذا اؤتمن خان، وإذا وعد أخلف ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"The signs of a hypocrite are three: Whenever he speaks he tells a lie; whenever he is entrusted he proves dishonest; whenever he promises he breaks his promise.\"",
      "chain": [
        "30584",
        "20155",
        "11445",
        "11443",
        "13"
      ]
    },
    {
      "hadith_no": "2890",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا سليمان بن داود أبو الربيع، عن إسماعيل بن زكرياء، حدثنا عاصم، عن مورق العجلي، عن أنس  رضى الله عنه  قال كنا مع النبي صلى الله عليه وسلم أكثرنا ظلا الذي يستظل بكسائه، وأما الذين صاموا فلم يعملوا شيئا، وأما الذين أفطروا فبعثوا الركاب وامتهنوا وعالجوا فقال النبي صلى الله عليه وسلم ‏\"‏ ذهب المفطرون اليوم بالأجر ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     We were with the Prophet (on a journey) and the only shade one could have was the shade made by one's own garment. Those who fasted did not do any work and those who did not fast served the camels and brought the water on them and treated the sick and (wounded). So, the Prophet said, \"Today, those who were not fasting took (all) the reward.\"",
      "chain": [
        "30584",
        "20313",
        "11080",
        "11308",
        "19"
      ]
    },
    {
      "hadith_no": "4406",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا سليمان بن داود أبو الربيع، حدثنا فليح، عن الزهري، عن حميد بن عبد الرحمن، عن أبي هريرة، أن أبا بكر الصديق  رضى الله عنه  بعثه في الحجة التي أمره النبي صلى الله عليه وسلم قبل حجة الوداع يوم النحر في رهط يؤذن في الناس لا يحج بعد العام مشرك ولا يطوف بالبيت عريان‏.‏",
      "text_en": " Narrated Abu Huraira:                     That during the Hajj in which the Prophet had made Abu Bakr As Siddiq as chief of the, Hajj before the Hajj-ul-Wida,' on the day of Nahr, Abu Bakr sent him along with a group of persons to announce to the people. \"No pagan is permitted to perform Hajj after this year, and nobody is permitted to perform the Tawaf of the Ka`ba naked.\"",
      "chain": [
        "30584",
        "20169",
        "11013",
        "10561",
        "13"
      ]
    },
    {
      "hadith_no": "4793",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني سليمان بن داود أبو الربيع، حدثنا فليح، عن الزهري، عن سهل بن سعد، أن رجلا، أتى رسول الله صلى الله عليه وسلم فقال يا رسول الله، أرأيت رجلا رأى مع امرأته رجلا أيقتله فتقتلونه أم كيف يفعل فأنزل الله فيهما ما ذكر في القرآن من التلاعن، فقال له رسول الله صلى الله عليه وسلم ‏\"‏ قد قضي فيك وفي امرأتك ‏\"‏‏.‏ قال فتلاعنا، وأنا شاهد عند رسول الله صلى الله عليه وسلم ففارقها فكانت سنة أن يفرق بين المتلاعنين وكانت حاملا، فأنكر حملها وكان ابنها يدعى إليها، ثم جرت السنة في الميراث أن يرثها، وترث منه ما فرض الله لها‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     A man came to Allah's Apostle and said, \"O Allah's Apostle! Suppose a man saw another man with his wife, should he kill him whereupon you might kill him (i.e. the killer) (in Qisas) or what should he do?\" So Allah revealed concerning their case what is mentioned of the order of Mula'ana. Allah's Apostle said to the man, \"The matter between you and your wife has been decided.\" So they did Mula'ana in the presence of Allah's Apostle and I was present there, and then the man divorced his wife. So it became a tradition to dissolve the marriage of those spouses who were involved in a case of Mula'ana. The woman was pregnant and the husband denied that he was the cause of her pregnancy, so the son was (later) ascribed to her. Then it became a tradition that such a son would be the heir of his mother, and she would inherit of him what Allah prescribed for her.",
      "chain": [
        "30584",
        "20169",
        "11013",
        "399"
      ]
    },
    {
      "hadith_no": "5297",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثني محمود، حدثنا عبد الرزاق، أخبرنا معمر، عن ابن طاوس، عن أبيه، عن أبي هريرة، قال ‏\"‏ قال سليمان بن داود  عليهما السلام  لأطوفن الليلة بمائة امرأة، تلد كل امرأة غلاما، يقاتل في سبيل الله، فقال له الملك قل إن شاء الله‏.‏ فلم يقل ونسي، فأطاف بهن، ولم تلد منهن إلا امرأة نصف إنسان ‏\"‏‏.‏ قال النبي صلى الله عليه وسلم ‏\"‏ لو قال إن شاء الله لم يحنث، وكان أرجى لحاجته ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     (The Prophet) Solomon son of (the Prophet) David said, \"Tonight I will go round (i.e. have sexual relations with) one hundred women (my wives) everyone of whom will deliver a male child who will fight in Allah's Cause.\" On that an Angel said to him, \"Say: 'If Allah will.' \" But Solomon did not say it and forgot to say it. Then he had sexual relations with them but none of them delivered any child except one who delivered a half person. The Prophet said, \"If Solomon had said: 'If Allah will,' Allah would have fulfilled his (above) desire and that saying would have made him more hopeful.\"",
      "chain": [
        "30277",
        "20121",
        "20115",
        "11433",
        "11053",
        "13",
        "30584"
      ]
    },
    {
      "hadith_no": "3136",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا محمد بن المثنى، حدثنا سليمان بن داود، حدثنا معروف بن خربوذ، قال سمعت أبا الطفيل، يقول رأيت رسول الله صلى الله عليه وسلم يطوف بالبيت ويستلم الركن بمحجن معه ويقبل المحجن ‏.‏",
      "text_en": " Abu Tufail reported:                      I saw Allah's Messenger (may peace be upon him) circumambulating the House. and touching the corner with a stick that he had with him, and then kissing the stick.",
      "chain": [
        "30170",
        "30584",
        "11564",
        "3660"
      ]
    },
    {
      "hadith_no": "4378",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "وحدثنا عبد بن حميد، أخبرنا عبد الرزاق بن همام، أخبرنا معمر، عن ابن طاوس، عن أبيه، عن أبي هريرة، قال قال سليمان بن داود لأطيفن الليلة على سبعين امرأة تلد كل امرأة منهن غلاما يقاتل في سبيل الله ‏.‏ فقيل له قل إن شاء الله ‏.‏ فلم يقل ‏.‏ فأطاف بهن فلم تلد منهن إلا امرأة واحدة نصف إنسان ‏.‏ قال فقال رسول الله صلى الله عليه وسلم ‏\"‏ لو قال إن شاء الله ‏.‏ لم يحنث وكان دركا لحاجته ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported that Sulaiman b. Dawud said:                      I will certainly have intercourse with seventy wives during the night, and every wife amongst them will give birth to a child, who will fight in the cause of Allah. It was said to him: Say:\" Insha' Allah\" (God willing), but he did not say so and forgot it. He went round them but none of them give birth to a child except one woman and that too was an incomplete person. Upon this Allah's Messenger (may peace be upon him) said: If he had said\" Insha' Allah.\" he would not have failed, and his desire must have been fulfilled.",
      "chain": [
        "30553",
        "20121",
        "20115",
        "11433",
        "11053",
        "13",
        "30584"
      ]
    },
    {
      "hadith_no": "5105",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثنا أحمد بن حنبل، حدثنا سليمان بن داود، حدثنا أبو عوانة، حدثنا الحكم، وأبو بشر عن ميمون بن مهران، عن ابن عباس، أن رسول الله صلى الله عليه وسلم نهى عن كل ذي ناب من السباع وعن كل ذي مخلب من الطير ‏.‏",
      "text_en": " Ibn Abbas reported that Allah's Messenger (may peace be upon him) forbade (the eating) of all the fanged beasts of prey, and of all the birds having talons.",
      "chain": [
        "30007",
        "30584",
        "20469",
        "11012",
        "17"
      ]
    },
    {
      "hadith_no": "6225",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثنا محمد بن المثنى، وابن، بشار وأحمد بن إبراهيم الدورقي وهارون بن عبد الله جميعا عن أبي داود، قال ابن المثنى حدثنا سليمان بن داود، حدثنا شعبة، عن  خليد بن جعفر، سمع أبا إياس، عن أنس، أنه سئل عن شيب النبي، صلى الله عليه وسلم فقال ما شانه الله ببيضاء ‏.‏",
      "text_en": " Anas (b. Malik) was asked about the old age of Allah's Apostle (may peace be upon him). He said:                      Allah did not blemish him with white hair.",
      "chain": [
        "30170",
        "30002",
        "30584",
        "20020",
        "10682",
        "11306",
        "19"
      ]
    },
    {
      "hadith_no": "49",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا مسدد، وسليمان بن داود العتكي، قالا حدثنا حماد بن زيد، عن غيلان بن جرير، عن أبي بردة، عن أبيه، قال مسدد قال أتينا رسول الله صلى الله عليه وسلم نستحمله فرأيته يستاك على لسانه - قال أبو داود وقال سليمان قال دخلت على النبي صلى الله عليه وسلم وهو يستاك وقد وضع السواك على طرف لسانه - وهو يقول ‏\"‏ إه إه ‏\"‏ ‏.‏ يعني يتهوع ‏.‏ قال أبو داود قال مسدد فكان حديثا طويلا اختصرته ‏.‏",
      "text_en": " Narrated Abu Burdah:                     On the authority of his father ( Abu Musa al-Ash'ari), reported (according to the version of Musaddad) : We came to the Apostle of Allaah (sal Allaahu alayhi wa sallam) to provide us with a mount, and found him using the tooth-stick, its one end being at his tongue (i.e. he wsa rinsing his mouth).According to the version of Sulaiman it goes : I entered upon the Prophet (sal Allaahu alayhi wa sallam ) who was using the tooth-stick, and had it placed at one side of his tongue, producing a gurgling sound.Abu Dawud said : Musaddad said that the tradition was a lengthy but he shortened it.",
      "chain": [
        "30175",
        "30584",
        "20022",
        "11300",
        "11901",
        "41",
        "30175"
      ]
    },
    {
      "hadith_no": "84",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا هناد، وسليمان بن داود العتكي، قالا حدثنا شريك، عن أبي فزارة، عن أبي زيد، عن عبد الله بن مسعود، أن النبي صلى الله عليه وسلم قال له ليلة الجن ‏\"‏ ما في إداوتك ‏\"‏ ‏.‏ قال نبيذ ‏.‏ قال ‏\"‏ تمرة طيبة وماء طهور ‏\"‏ ‏.‏ قال أبو داود وقال سليمان بن داود عن أبي زيد أو زيد كذا قال شريك ولم يذكر هناد ليلة الجن ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     AbuZayd quoted Abdullah ibn Mas'ud as saying that on the night when the jinn listened to the Qur'an the Prophet (ﷺ) said: What is in your skin vessel? He said: I have some nabidh. He (the Holy Prophet) said: It consists of fresh dates and pure water. Sulayman ibn Dawud reported the same version of this tradition on the authority of AbuZayd or Zayd. But Sharik said that Hammad did not mention the words \"night of the jinn\".",
      "chain": [
        "30480",
        "30584",
        "20587",
        "16"
      ]
    },
    {
      "hadith_no": "319",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا سليمان بن داود المهري، وعبد الملك بن شعيب، عن ابن وهب، نحو هذا الحديث قال قام المسلمون فضربوا بأكفهم التراب ولم يقبضوا من التراب شيئا فذكر نحوه ولم يذكر المناكب والآباط ‏.‏ قال ابن الليث إلى ما فوق المرفقين ‏.‏",
      "text_en": " The tradition has also been reported through a different chain of narrators. This version has:                      The Muslims stood up and struck the earth with their palms, but did not get any earth (in their hands). He (Ibn Wahb) then narrated the rest of the tradition in like manner, but he did not mention the words \"shoulders\" and \"armpits\". Ibn al-Laith said: (They) wiped above the elbows.",
      "chain": [
        "30584",
        "30489",
        "20029",
        "20475",
        "11013",
        "11004",
        "25"
      ]
    },
    {
      "hadith_no": "392",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا سليمان بن داود، حدثنا إسماعيل بن جعفر المدني، عن أبي سهيل، نافع بن مالك بن أبي عامر بإسناده بهذا الحديث قال ‏\"‏ أفلح وأبيه إن صدق دخل الجنة وأبيه إن صدق ‏\"‏ ‏.‏",
      "text_en": " This tradition has also been reported by Abu Suhail Nafi' b. Malik b. Abi 'Amir through a different chain of narrators. It adds:                      He will be successful, by his father, if he speaks the truth; he will enter Paradise, by his father, if he speaks the truth.",
      "chain": [
        "30584",
        "20155"
      ]
    },
    {
      "hadith_no": "441",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا العباس العنبري، حدثنا سليمان بن داود، - وهو الطيالسي - حدثنا سليمان، - يعني ابن المغيرة - عن ثابت، عن عبد الله بن رباح، عن أبي قتادة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ليس في النوم تفريط إنما التفريط في اليقظة أن تؤخر صلاة حتى يدخل وقت أخرى ‏\"‏ ‏.‏",
      "text_en": " Abu Qatadah reported the Messenger of Allah (ﷺ) as saying:                      There is no remissness in sleep, it is only when one is awake that there is remissness when you delay saying the prayer till the time for the next prayer comes.",
      "chain": [
        "30437",
        "30584",
        "20236",
        "11269",
        "11865",
        "391"
      ]
    },
    {
      "hadith_no": "479",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا سليمان بن داود، حدثنا حماد، حدثنا أيوب، عن نافع، عن ابن عمر، قال بينما رسول الله صلى الله عليه وسلم يخطب يوما إذ رأى نخامة في قبلة المسجد فتغيظ على الناس ثم حكها قال وأحسبه قال فدعا بزعفران فلطخه به وقال ‏\"‏ إن الله قبل وجه أحدكم إذا صلى فلا يبزق بين يديه ‏\"‏ ‏.‏ قال أبو داود رواه إسماعيل وعبد الوارث عن أيوب عن نافع ومالك وعبيد الله وموسى بن عقبة عن نافع نحو حماد إلا أنه لم يذكروا الزعفران ورواه معمر عن أيوب وأثبت الزعفران فيه وذكر يحيى بن سليم عن عبيد الله عن نافع الخلوق ‏.‏",
      "text_en": " Ibn ‘Umar reported:                      One day while the Messenger of Allah(ﷺ)was giving sermon he suddenly saw phlegm on the wall towards the qiblah(the direction to which Muslims turn in prayer) of the mosque. So he became angry at people. He then scraped it and sent for saffron and stained with it. He then said: When any one of you prays, Allah, the Exalted, faces him: he, therefore, should not spit before him.",
      "chain": [
        "30584",
        "20022",
        "11015",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "490",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا سليمان بن داود، أخبرنا ابن وهب، قال حدثني ابن لهيعة، ويحيى بن أزهر، عن عمار بن سعد المرادي، عن أبي صالح الغفاري، أن عليا، - رضي الله عنه - مر ببابل وهو يسير فجاءه المؤذن يؤذن بصلاة العصر فلما برز منها أمر المؤذن فأقام الصلاة فلما فرغ قال إن حبيبي صلى الله عليه وسلم نهاني أن أصلي في المقبرة ونهاني أن أصلي في أرض بابل فإنها ملعونة ‏.‏",
      "text_en": " Narrated Ali ibn AbuTalib:                     AbuSalih al-Ghifari reported: Ali (once) passed by Babylon during his travels. The mu'adhdhin (the person who calls for prayer) came to him to call for the afternoon prayer. When he passed by that place, he commanded to announce for the prayer. After finishing the prayer he said: My affectionate friend (i.e. the Prophet) prohibited me to say prayer in the graveyard. He also forbade me to offer prayer in Babylon because it is accursed.",
      "chain": [
        "30584",
        "20029",
        "20624"
      ]
    },
    {
      "hadith_no": "497",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا سليمان بن داود المهري، حدثنا ابن وهب، أخبرنا هشام بن سعد، حدثني معاذ بن عبد الله بن خبيب الجهني، قال دخلنا عليه فقال لامرأته متى يصلي الصبي فقالت كان رجل منا يذكر عن رسول الله صلى الله عليه وسلم أنه سئل عن ذلك فقال ‏\"‏ إذا عرف يمينه من شماله فمروه بالصلاة ‏\"‏ ‏.‏",
      "text_en": " Narrated Mu'adh ibn Abdullah ibn Khubayb al-Juhani:                     Hisham ibn Sa'd reported: We entered upon Mu'adh ibn Abdullah ibn Khubayb al-Juhani. He said to his wife: When (at what age) should a boy pray? She replied: Some person of us reported: The Messenger of Allah (ﷺ) was asked about it; he said: When a boy distinguishes right hand from the left hand, then command him to pray.",
      "chain": [
        "30584",
        "20029",
        "20519",
        "19822"
      ]
    },
    {
      "hadith_no": "528",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا سليمان بن داود العتكي، حدثنا محمد بن ثابت، حدثني رجل، من أهل الشام عن شهر بن حوشب، عن أبي أمامة، أو عن بعض، أصحاب النبي صلى الله عليه وسلم أن بلالا أخذ في الإقامة فلما أن قال قد قامت الصلاة قال النبي صلى الله عليه وسلم ‏\"‏ أقامها الله وأدامها ‏\"‏ ‏.‏ وقال في سائر الإقامة كنحو حديث عمر - رضى الله عنه - في الأذان ‏.‏",
      "text_en": " Narrated AbuUmamah, or one of the Companion of the Prophet:                     Bilal began the Iqamah, and when he said: \"The time for prayer has come,\" the Prophet (ﷺ) said: \"May Allah establish it and cause it to continue.\"",
      "chain": [
        "30584",
        "11044"
      ]
    },
    {
      "hadith_no": "580",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا سليمان بن داود المهري، حدثنا ابن وهب، أخبرني يحيى بن أيوب، عن عبد الرحمن بن حرملة، عن أبي علي الهمداني، قال سمعت عقبة بن عامر، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من أم الناس فأصاب الوقت فله ولهم ومن انتقص من ذلك شيئا فعليه ولا عليهم ‏\"‏ ‏.‏",
      "text_en": " Narrated Uqbah ibn Amir:                     I heard the Messenger of Allah (ﷺ) say: He who leads the people in prayer, and he does so at the right time, will receive, as well as those who are led (in prayer) will get (the reward). He who delays (prayer) from the appointed time will be responsible (for this delay) and not those who are led in prayer.",
      "chain": [
        "30584",
        "20029",
        "20379",
        "11878",
        "189"
      ]
    },
    {
      "hadith_no": "707",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن سعيد الهمداني، ح حدثنا سليمان بن داود، قالا حدثنا ابن وهب، أخبرني معاوية، عن سعيد بن غزوان، عن أبيه، أنه نزل بتبوك وهو حاج فإذا رجل مقعد فسأله عن أمره فقال له سأحدثك حديثا فلا تحدث به ما سمعت أني حى إن رسول الله صلى الله عليه وسلم نزل بتبوك إلى نخلة فقال ‏\"‏ هذه قبلتنا ‏\"‏ ‏.‏ ثم صلى إليها فأقبلت وأنا غلام أسعى حتى مررت بينه وبينها فقال ‏\"‏ قطع صلاتنا قطع الله أثره ‏\"‏ ‏.‏ فما قمت عليها إلى يومي هذا ‏.‏",
      "text_en": " Sa’id b. Ghazwan reported on the authority  of his father that he made his stay at Tabuk(during his journey) for performing Hajj. All of a sudden he saw a crippled man and asked him about his condition. He said:                      I relate to you a tradition, but do not narrate it to anyone so long as I am alive: The Messenger of Allah (ﷺ) encamped at Tabuk near a date-palm and he said:  This is our qiblah (direction for praying). He then offered prayer facing it. I came running, when I was a boy, until I passed the place between him and the tree. He said (cursing): He cut off our prayer, may Allah cut off his walking. I could not, therefore, stand upon them(feet) till today.",
      "chain": [
        "30296",
        "30584",
        "20029",
        "27",
        "116"
      ]
    },
    {
      "hadith_no": "744",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا الحسن بن علي، حدثنا سليمان بن داود الهاشمي، حدثنا عبد الرحمن بن أبي الزناد، عن موسى بن عقبة، عن عبد الله بن الفضل بن ربيعة بن الحارث بن عبد المطلب، عن عبد الرحمن الأعرج، عن عبيد الله بن أبي رافع، عن علي بن أبي طالب، - رضى الله عنه - عن رسول الله صلى الله عليه وسلم أنه كان إذا قام إلى الصلاة المكتوبة كبر ورفع يديه حذو منكبيه ويصنع مثل ذلك إذا قضى قراءته وأراد أن يركع ويصنعه إذا رفع من الركوع ولا يرفع يديه في شىء من صلاته وهو قاعد وإذا قام من السجدتين رفع يديه كذلك وكبر ‏.‏ قال أبو داود في حديث أبي حميد الساعدي حين وصف صلاة النبي صلى الله عليه وسلم إذا قام من الركعتين كبر ورفع يديه حتى يحاذي بهما منكبيه كما كبر عند افتتاح الصلاة ‏.‏",
      "text_en": " Narrated Ali ibn AbuTalib:                     When the Messenger of Allah (ﷺ) stood for offering the obligatory prayer, he uttered the takbir (Allah is most great) and raised his hands opposite to his shoulders; and he did like that when he finished recitation (of the Qur'an) and was about to bow; and he did like that when he rose after bowing; and he did not raise his hands in his prayer while he was in his sitting position. When he stood up from his prostrations (at the end of two rak'ahs), he raised his hands likewise and uttered the takbir (Allah is most great) and raised his hands so as to bring them up to his shoulders, as he uttered the takbir in the beginning of the prayer.",
      "chain": [
        "30115",
        "30584",
        "20509",
        "11106",
        "11197",
        "11199",
        "5"
      ]
    },
    {
      "hadith_no": "761",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا الحسن بن علي، حدثنا سليمان بن داود الهاشمي، أخبرنا عبد الرحمن بن أبي الزناد، عن موسى بن عقبة، عن عبد الله بن الفضل بن ربيعة بن الحارث بن عبد المطلب، عن عبد الرحمن الأعرج، عن عبيد الله بن أبي رافع، عن علي بن أبي طالب، عن رسول الله صلى الله عليه وسلم أنه كان إذا قام إلى الصلاة المكتوبة كبر ورفع يديه حذو منكبيه ويصنع مثل ذلك إذا قضى قراءته وإذا أراد أن يركع ويصنعه إذا رفع من الركوع ولا يرفع يديه في شىء من صلاته وهو قاعد وإذا قام من السجدتين رفع يديه كذلك وكبر ودعا نحو حديث عبد العزيز في الدعاء يزيد وينقص الشىء ولم يذكر ‏\"‏ والخير كله في يديك والشر ليس إليك ‏\"‏ ‏.‏ وزاد فيه ويقول عند انصرافه من الصلاة ‏\"‏ اللهم اغفر لي ما قدمت وأخرت وما أسررت وأعلنت أنت إلهي لا إله إلا أنت ‏\"‏ ‏.‏",
      "text_en": " ‘Ali b. Ali Talib said:                      When the Messenger of Allah (ﷺ) stood up for (offering) obligatory prayer, he uttered the takbir (Allah is most great) and raised his hands opposite to his shoulders, and he did so when he finished the recitation (of the Qur’an) and when he was about to bow; and he did like that when he raised (his head) after bowing. He did not raise his hands in prayer when he was sitting. When he stood at the end of two rak’ahs, he raised his hands in a similar way and uttered the takbir and supplicated in a more or less the same manner as narrated by ‘Abd al-‘Aziz in his version. This version does not mention the words “All good is in Thy Hands and evil does not pertain to Thee.” And this adds: He said when he finished the prayer: “O Allah, forgive me my former and latter sins, my open and secret sins; Thou art my deity; there is no God but Thee.",
      "chain": [
        "30115",
        "30584",
        "20509",
        "11106",
        "11197",
        "11199",
        "5"
      ]
    },
    {
      "hadith_no": "1127",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن عبيد، وسليمان بن داود، - المعنى - قالا حدثنا حماد بن زيد، حدثنا أيوب، عن نافع، أن ابن عمر، رأى رجلا يصلي ركعتين يوم الجمعة في مقامه فدفعه وقال أتصلي الجمعة أربعا وكان عبد الله يصلي يوم الجمعة ركعتين في بيته ويقول هكذا فعل رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Nafi' said:                      Ibn 'Umar saw a man praying two rak'ahs after the Friday prayer on the same place (where he offered the Friday prayer). He pushed him and said: Do you offer four rak'ahs of Friday prayer ? 'Abd Allah (b. 'Umar) used to pray two rak'ahs in his house after the Friday prayer, and he used to say: This is how the Messenger of Allah (ﷺ) did.",
      "chain": [
        "30213",
        "30584",
        "20022",
        "11015",
        "11014"
      ]
    },
    {
      "hadith_no": "1162",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book Of The Prayer For Rain (Kitab al-Istisqa') - كتاب الاستسقاء",
      "chapter_no": "3",
      "text_ar": "حدثنا ابن السرح، وسليمان بن داود، قالا أخبرنا ابن وهب، قال أخبرني ابن أبي ذئب، ويونس، عن ابن شهاب، قال أخبرني عباد بن تميم المازني، أنه سمع عمه، - وكان من أصحاب رسول الله صلى الله عليه وسلم يقول خرج رسول الله صلى الله عليه وسلم يوما يستسقي فحول إلى الناس ظهره يدعو الله عز وجل - قال سليمان بن داود واستقبل القبلة وحول رداءه ثم صلى ركعتين - قال ابن أبي ذئب - وقرأ فيهما زاد ابن السرح يريد الجهر ‏.‏",
      "text_en": " Abbad b. Tamim al Mazini said on the authority of his uncle (Abd Allah b. Zaid b Asim) who was a Companion of the Messenger of Allah (ﷺ):                      One day the Messenger of Allah (ﷺ) went out to make supplication for rain.  He turned his back towards the people praying to Allah, the Exalted.  The narrator Sulaiman b. Dawud said: He faced the qiblah and turned around his cloak and then offered two rak'ahs of prayer.  The narrator Ibn Abi Dhi'b said: He recited from the Qur'an in both of them.  The version of Ibn al-Sarh adds: By it he means in a loud voice.",
      "chain": [
        "30485",
        "30584",
        "20029",
        "20177",
        "20475",
        "11013",
        "639",
        "605"
      ]
    },
    {
      "hadith_no": "1207",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Rules of Law about the Prayer during Journey - كتاب صلاة السفر",
      "chapter_no": "4",
      "text_ar": "حدثنا سليمان بن داود العتكي، حدثنا حماد، حدثنا أيوب، عن نافع، أن ابن عمر، استصرخ على صفية وهو بمكة فسار حتى غربت الشمس وبدت النجوم فقال إن النبي صلى الله عليه وسلم كان إذا عجل به أمر في سفر جمع بين هاتين الصلاتين ‏.‏ فسار حتى غاب الشفق فنزل فجمع بينهما ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     Ibn Umar was informed about the death of Safiyyah (the wife of the Prophet) when he was at Mecca. He proceeded till the sun set and the stars shined. He said: When the Prophet (ﷺ) was in a hurry about something while on a journey, he would combine both these prayers. He proceed till twilight had disappeared. He then combined both of them (the prayers).",
      "chain": [
        "30584",
        "20022",
        "11015",
        "11014"
      ]
    },
    {
      "hadith_no": "1219",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Rules of Law about the Prayer during Journey - كتاب صلاة السفر",
      "chapter_no": "4",
      "text_ar": "حدثنا سليمان بن داود المهري، حدثنا ابن وهب، أخبرني جابر بن إسماعيل، عن عقيل، بهذا الحديث بإسناده قال ويؤخر المغرب حتى يجمع بينها وبين العشاء حين يغيب الشفق ‏.‏",
      "text_en": " The above mentioned tradition has also been reported by 'Uqail through a different chain of narrators. He said:                      He would delay the evening prayer till he combined the evening and the night prayers when the twilight disappeared.",
      "chain": [
        "30584",
        "20029",
        "20621",
        "11207"
      ]
    },
    {
      "hadith_no": "1302",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا أحمد بن يونس، وسليمان بن داود العتكي، قالا حدثنا يعقوب، عن جعفر، عن سعيد بن جبير، عن النبي صلى الله عليه وسلم بمعناه مرسل ‏.‏ قال أبو داود سمعت محمد بن حميد يقول سمعت يعقوب يقول كل شىء حدثتكم عن جعفر عن سعيد بن جبير عن النبي صلى الله عليه وسلم فهو مسند عن ابن عباس عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Sa'id b. Jubair:                     This tradition from the Prophet (ﷺ) without mentioning the name of the Companion in the chain (in the mursal form).Abu dawud said: I heard Muhammad b. Humaid say: I heard Ya'qub say: Anything I narrated to you from Ja'far on the authority of Sa'id b. Jubair from the Prophet (ﷺ) is directly coming from Ibn Abbas from the Prophet (ﷺ).",
      "chain": [
        "30184",
        "30584",
        "20184",
        "11407",
        "11050"
      ]
    },
    {
      "hadith_no": "1313",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا أبو صفوان عبد الله بن سعيد بن عبد الملك بن مروان، ح وحدثنا سليمان بن داود، ومحمد بن سلمة المرادي، قالا حدثنا ابن وهب، - المعنى - عن يونس، عن ابن شهاب، أن السائب بن يزيد، وعبيد الله، أخبراه أن عبد الرحمن بن عبد قالا عن ابن وهب بن عبد القاري، قال سمعت عمر بن الخطاب، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ من نام عن حزبه أو عن شىء منه فقرأه ما بين صلاة الفجر وصلاة الظهر كتب له كأنما قرأه من الليل ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Umar bin Al-Khattab:                     The Messenger of Allah (ﷺ) as saying: He who misses him daily round of recital or part of it due to sleep and he recites it between the dawn and the noon prayers, will be reckoned as if he recited it at night.",
      "chain": [
        "30367",
        "30584",
        "30491",
        "20475",
        "11013",
        "3048"
      ]
    },
    {
      "hadith_no": "1337",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا سليمان بن داود المهري، حدثنا ابن وهب، أخبرني ابن أبي ذئب، وعمرو بن الحارث، ويونس بن يزيد، أن ابن شهاب، أخبرهم بإسناده، ومعناه،، قال ‏:‏ ويوتر بواحدة، ويسجد سجدة قدر ما يقرأ أحدكم خمسين آية قبل أن يرفع رأسه، فإذا سكت المؤذن من صلاة الفجر وتبين له الفجر ‏.‏ وساق معناه ‏.‏ قال ‏:‏ وبعضهم يزيد على بعض ‏.‏",
      "text_en": " This tradition has been transmitted by Ibn Shihab through a different chain of narrators to the same effect. This version adds:                      He would observe witr with a single rak'ah and make a prostration as long as you would take to recite fifty verses before raising his head. When the mu'adhdhin finished his call for the dawn prayer and the dawn became clear to him.... Then the narrator transmitted the rest of the tradition to the same effect.Some narrators added something more in their version.",
      "chain": [
        "30584",
        "20029",
        "20177",
        "20377",
        "20475",
        "11013"
      ]
    },
    {
      "hadith_no": "1456",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا سليمان بن داود المهري، حدثنا ابن وهب، حدثنا موسى بن على بن رباح، عن أبيه، عن عقبة بن عامر الجهني، قال خرج علينا رسول الله صلى الله عليه وسلم ونحن في الصفة فقال ‏\"‏ أيكم يحب أن يغدو إلى بطحان أو العقيق فيأخذ ناقتين كوماوين زهراوين بغير إثم بالله عز وجل ولا قطع رحم ‏\"‏ ‏.‏ قالوا كلنا يا رسول الله ‏.‏ قال ‏\"‏ فلأن يغدو أحدكم كل يوم إلى المسجد فيتعلم آيتين من كتاب الله عز وجل خير له من ناقتين وإن ثلاث فثلاث مثل أعدادهن من الإبل ‏\"‏ ‏.‏",
      "text_en": " 'Uqbah b. 'Amir al-Juhani said:                      When we were in the Suffah, the Messenger of Allah (ﷺ) asked: Which of you would like to go out every morning to Buthan or Al-'Aqiq and bring two large humped and fat she-camels without being guilty of sin and severing ties of relationship ? They  (the people) said: Messenger of Allah, we would all like that. He said: If any one of you goes out in the morning to the mosque and learns two verses of the Book of Allah, the Exalted, it is better for him than two she-camels, and three verses are better for him than three she-camels, and so on than their numbers in camels.",
      "chain": [
        "30584",
        "20029",
        "20628",
        "10870",
        "189"
      ]
    },
    {
      "hadith_no": "1473",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا سليمان بن داود المهري، أخبرنا ابن وهب، حدثني عمر بن مالك، وحيوة، عن ابن الهاد، عن محمد بن إبراهيم بن الحارث، عن أبي سلمة بن عبد الرحمن، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ما أذن الله لشىء ما أذن لنبي حسن الصوت يتغنى بالقرآن يجهر به ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the Messenger of Allah (ﷺ) as saying:                      Allah has not listened to anything as He does to a Prophet chanting the Qur'an with a loud voice.",
      "chain": [
        "30584",
        "20029",
        "26010",
        "11234",
        "11213",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1508",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا مسدد، وسليمان بن داود العتكي، - وهذا حديث مسدد - قالا حدثنا المعتمر، قال سمعت داود الطفاوي، قال حدثني أبو مسلم البجلي، عن زيد بن أرقم، قال سمعت نبي الله صلى الله عليه وسلم يقول وقال سليمان كان رسول الله صلى الله عليه وسلم يقول في دبر صلاته ‏\"‏ اللهم ربنا ورب كل شىء أنا شهيد أنك أنت الرب وحدك لا شريك لك اللهم ربنا ورب كل شىء أنا شهيد أن محمدا عبدك ورسولك اللهم ربنا ورب كل شىء أنا شهيد أن العباد كلهم إخوة اللهم ربنا ورب كل شىء اجعلني مخلصا لك وأهلي في كل ساعة في الدنيا والآخرة يا ذا الجلال والإكرام اسمع واستجب الله أكبر الأكبر اللهم نور السموات والأرض ‏\"‏ ‏.‏ قال سليمان بن داود ‏\"‏ رب السموات والأرض ‏\"‏ ‏.‏ ‏\"‏ الله أكبر الأكبر حسبي الله ونعم الوكيل الله أكبر الأكبر ‏\"‏ ‏.‏",
      "text_en": " Narrated Zayd ibn Arqam:                     I heard the Messenger of Allah (ﷺ) saying (the version of Sulayman has: The Messenger of Allah (ﷺ) used to say) after his prayer:- \"O Allah, our Lord and Lord of everything, I bear witness that Thou art the Lord alone Who hast no partner; O Allah, Our Lord and Lord of everything, I bear witness that Muhammad is Thy servant and Thy apostle ; O Allah, our Lord and Lord of everything, I bear witness that all the servants are brethren; O Allah, our Lord and Lord of everything make me sincere to Thee, and my family too at every moment, in this world and in the world hereafter, O Possessor of glory and honour, listen to me and answer. Allah is incomparably great. O Allah, Light of the heavens and of the earth\".The narrator Sulaiman b. Dawud said: \"Lord of the heavens and of the earth, Allah is incomparably great. Allah is sufficient for me; and the excellent guardian is He; Allah is incomparably great.",
      "chain": [
        "30175",
        "30584",
        "20288",
        "384"
      ]
    },
    {
      "hadith_no": "1530",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا سليمان بن داود العتكي، حدثنا إسماعيل بن جعفر، عن العلاء بن عبد الرحمن، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من صلى على واحدة صلى الله عليه عشرا ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: If anyone invokes blessings on me once, Allah will bless him ten times.",
      "chain": [
        "30584",
        "20155",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "1557",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا ابن السرح، وسليمان بن داود، قالا أخبرنا ابن وهب، أخبرني يونس، عن الزهري، قال قال أبو بكر إن حقه أداء الزكاة وقال عقالا ‏.‏",
      "text_en": " This tradition has also been transmitted by Al Zuhri through a different chain of narrators. This version has “Abu Bakr said its due is the payment of zakat.” He used the word “a rope of a Camel”",
      "chain": [
        "30485",
        "30584",
        "20029",
        "20475",
        "11013",
        "20436"
      ]
    },
    {
      "hadith_no": "1573",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا سليمان بن داود المهري، أخبرنا ابن وهب، أخبرني جرير بن حازم، وسمى، آخر عن أبي إسحاق، عن عاصم بن ضمرة، والحارث الأعور، عن علي، - رضى الله عنه - عن النبي صلى الله عليه وسلم ببعض أول هذا الحديث قال ‏\"‏ فإذا كانت لك مائتا درهم وحال عليها الحول ففيها خمسة دراهم وليس عليك شىء - يعني في الذهب - حتى يكون لك عشرون دينارا فإذا كان لك عشرون دينارا وحال عليها الحول ففيها نصف دينار فما زاد فبحساب ذلك ‏\"‏ ‏.‏ قال فلا أدري أعلي يقول فبحساب ذلك ‏.‏ أو رفعه إلى النبي صلى الله عليه وسلم ‏\"‏ وليس في مال زكاة حتى يحول عليه الحول ‏\"‏ ‏.‏ إلا أن جريرا قال ابن وهب يزيد في الحديث عن النبي صلى الله عليه وسلم ‏\"‏ ليس في مال زكاة حتى يحول عليه الحول ‏\"‏ ‏.‏",
      "text_en": " Narrated Ali ibn AbuTalib:                     The Prophet (ﷺ) said: \"When you possess two hundred dirhams and one year passes on them, five dirhams are payable. Nothing is incumbent on you, that is, on gold, till it reaches twenty dinars. When you possess twenty dinars and one year passes on them, half a dinar is payable. Whatever exceeds, that will be reckoned properly.\" (The narrator said: I do not remember whether the words \"that will be reckoned properly\" were uttered by All himself or he attributed them to the Prophet (ﷺ). No zakat is payable on property till a year passes on it. But Jarir said: Ibn Wahb (sub-narrator) added to this tradition from the Prophet (ﷺ): \"No zakat is payable on property until a year passes away on it.\"",
      "chain": [
        "30584",
        "20029",
        "11272",
        "11049",
        "19871",
        "19865",
        "5"
      ]
    },
    {
      "hadith_no": "1615",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا مسدد، وسليمان بن داود العتكي، قالا حدثنا حماد، عن أيوب، عن نافع، قال قال عبد الله فعدل الناس بعد نصف صاع من بر ‏.‏ قال وكان عبد الله يعطي التمر فأعوز أهل المدينة التمر عاما فأعطى الشعير ‏.‏",
      "text_en": " Abd’ Allah(b. 'Umar) said “The people then began to pay half a sa’ of wheat later on. The narrator said :                      'Abd Allah (b. Umar) use to pay dried dates as sadaqah one year the people of Medina lacked dried dates, hence he paid barley.",
      "chain": [
        "30175",
        "30584",
        "20022",
        "11015",
        "11014"
      ]
    },
    {
      "hadith_no": "1619",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا مسدد، وسليمان بن داود العتكي، قالا حدثنا حماد بن زيد، عن النعمان بن راشد، عن الزهري، - قال مسدد عن ثعلبة بن عبد الله بن أبي صعير، - عن أبيه، - وقال سليمان بن داود عبد الله بن ثعلبة أو ثعلبة بن عبد الله بن أبي صعير عن أبيه، - قال قال رسول الله صلى الله عليه وسلم ‏\"‏ صاع من بر أو قمح على كل اثنين صغير أو كبير حر أو عبد ذكر أو أنثى أما غنيكم فيزكيه الله وأما فقيركم فيرد الله عليه أكثر مما أعطاه ‏\"‏ ‏.‏ زاد سليمان في حديثه غني أو فقير ‏.‏",
      "text_en": " 'Abd Allah b. Tha'labah or Tha'labah bin 'Abd Allah bin Abu Su'air reported on his father's authority that the Messenger of Allah (ﷺ) said:                      One sa' of wheat is to be taken from every two, young or old, freeman or slave, male or female. Those of you who are rich will be purified by Allah, and those of you who are poor will have more than they gave returned by Him to them. Sulayman added in his version: \"rich or poor\"",
      "chain": [
        "30175",
        "30584",
        "20022",
        "10971",
        "11013",
        "30175",
        "30584"
      ]
    },
    {
      "hadith_no": "1747",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا سليمان بن داود المهري، حدثنا ابن وهب، أخبرني يونس، عن ابن شهاب، عن سالم، - يعني ابن عبد الله - عن أبيه، قال سمعت النبي صلى الله عليه وسلم يهل ملبدا ‏.‏",
      "text_en": " Ibn `Umar said that  he heard the Prophet (SWAS) say with hair matted that he raised his  voice in the talbiyah.",
      "chain": [
        "30584",
        "20029",
        "20475",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "2001",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا سليمان بن داود، أخبرنا ابن وهب، حدثني ابن جريج، عن عطاء بن أبي رباح، عن ابن عباس، أن النبي صلى الله عليه وسلم لم يرمل في السبع الذي أفاض فيه ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Prophet (ﷺ) did not walk quickly (ramal) in the seven rounds of the last circumambulation (Tawaf al-Ifadah).",
      "chain": [
        "30584",
        "20029",
        "11070",
        "11029",
        "17"
      ]
    },
    {
      "hadith_no": "2202",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا أحمد بن عمرو بن السرح، وسليمان بن داود، قالا أخبرنا ابن وهب، أخبرني يونس، عن ابن شهاب، أخبرني عبد الرحمن بن عبد الله بن كعب بن مالك، أن عبد الله بن كعب، - وكان قائد كعب من بنيه حين عمي - قال سمعت كعب بن مالكفساق قصته في تبوك قال حتى إذا مضت أربعون من الخمسين إذا رسول رسول الله صلى الله عليه وسلم يأتي فقال إن رسول الله صلى الله عليه وسلم يأمرك أن تعتزل امرأتك ‏.‏ قال فقلت أطلقها أم ماذا أفعل قال لا بل اعتزلها فلا تقربنها ‏.‏ فقلت لامرأتي الحقي بأهلك فكوني عندهم حتى يقضي الله سبحانه في هذا الأمر ‏.‏",
      "text_en": " ‘Abd Allah bin Ka’b reported “I heard Ka’ab bin Malik. He then narrated his story about the battle of Tabuk.(Narrating the story) he added “When forty out of fifty days passed”, the messenger of the Apostle of Allaah(ﷺ) came and said “The Apostle of Allaah(ﷺ) has commanded you to keep away from your wife. He said “So, I (Ka’b bin Malik)” said “Should I divorce her or what should I do? He said “No, but only keep away from her and do not go near her”. So, I said to my wife “Go to your people and live with them until Allaah, the exalted makes a decision in this matter.”",
      "chain": [
        "30485",
        "30584",
        "20029",
        "20475",
        "11013",
        "11519",
        "1131"
      ]
    },
    {
      "hadith_no": "2208",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا سليمان بن داود العتكي، حدثنا جرير بن حازم، عن الزبير بن سعيد، عن عبد الله بن علي بن يزيد بن ركانة، عن أبيه، عن جده، أنه طلق امرأته البتة فأتى رسول الله صلى الله عليه وسلم فقال ‏\"‏ ما أردت ‏\"‏ ‏.‏ قال واحدة ‏.‏ قال ‏\"‏ آلله ‏\"‏ ‏.‏ قال آلله ‏.‏ قال ‏\"‏ هو على ما أردت ‏\"‏ ‏.‏ قال أبو داود وهذا أصح من حديث ابن جريج أن ركانة طلق امرأته ثلاثا لأنهم أهل بيته وهم أعلم به وحديث ابن جريج رواه عن بعض بني أبي رافع عن عكرمة عن ابن عباس ‏.‏",
      "text_en": " 'Ali b. Yazid b. Rukanah reported on the authority of his father from his grandfather that he  (Rukanah) divorced his wife absolutely; so he came to the Messenger of Allah (ﷺ). He asked (him):                      What did you intend? He said: A single utterance of divorce. He said: Do you swear by Allah? He replied: I swear by Allah. He said: It stands as you intended.Abu Dawud said: This tradition is sounder than that of Ibn Juraij that Rukanah divorced his wife by three pronouncements, for they are the members of his family and they are more aware for him. The tradition of Ibn Juraij has been narrated by some children of Abu Rafi' from 'Ikrimah on the authority of Ibn 'Abbas.",
      "chain": [
        "30584",
        "11272",
        "18549"
      ]
    },
    {
      "hadith_no": "2252",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا سليمان بن داود العتكي، حدثنا فليح، عن الزهري، عن سهل بن سعد، في هذا الحديث وكانت حاملا فأنكر حملها فكان ابنها يدعى إليها ثم جرت السنة في الميراث أن يرثها وترث منه ما فرض الله عز وجل لها ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Sahl bin Sa’d through a different chain of narrators.  This version has “She was pregnant, he denied pregnancy from him. So her son was attributed to her. In the law of succession the practice (sunnah) was established that the son gets a share in the inheritance of his mother and the mother gets the share in the inheritance of her son according to the shares prescribed by Allaah the Exalted.",
      "chain": [
        "30584",
        "20169",
        "11013",
        "399"
      ]
    },
    {
      "hadith_no": "2292",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا سليمان بن داود، حدثنا ابن وهب، حدثنا عبد الرحمن بن أبي الزناد، عن هشام بن عروة، عن أبيه، قال لقد عابت ذلك عائشة - رضى الله عنها - أشد العيب يعني حديث فاطمة بنت قيس وقالت إن فاطمة كانت في مكان وحش فخيف على ناحيتها فلذلك رخص لها رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Urwah said:                      Aisha (Allah be pleased with her) severely objected to the tradition of Fatimah daughter of Qays. She said: Fatimah lived in a desolate house and she feared for her loneliness there. Hence the Messenger of Allah (ﷺ) accorded permission to her (to leave the place).",
      "chain": [
        "30584",
        "20029",
        "20509",
        "11065",
        "10511"
      ]
    },
    {
      "hadith_no": "2306",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا سليمان بن داود المهري، أخبرنا ابن وهب، أخبرني يونس، عن ابن شهاب، حدثني عبيد الله بن عبد الله بن عتبة، أن أباه، كتب إلى عمر بن عبد الله بن الأرقم الزهري يأمره أن يدخل، على سبيعة بنت الحارث الأسلمية فيسألها عن حديثها وعما قال لها رسول الله صلى الله عليه وسلم حين استفتته فكتب عمر بن عبد الله إلى عبد الله بن عتبة يخبره أن سبيعة أخبرته أنها كانت تحت سعد ابن خولة - وهو من بني عامر بن لؤى وهو ممن شهد بدرا - فتوفي عنها في حجة الوداع وهي حامل فلم تنشب أن وضعت حملها بعد وفاته فلما تعلت من نفاسها تجملت للخطاب فدخل عليها أبو السنابل بن بعكك - رجل من بني عبد الدار - فقال لها ما لي أراك متجملة لعلك ترتجين النكاح إنك والله ما أنت بناكح حتى تمر عليك أربعة أشهر وعشر ‏.‏ قالت سبيعة فلما قال لي ذلك جمعت على ثيابي حين أمسيت فأتيت رسول الله صلى الله عليه وسلم فسألته عن ذلك فأفتاني بأني قد حللت حين وضعت حملي وأمرني بالتزويج إن بدا لي ‏.‏ قال ابن شهاب ولا أرى بأسا أن تتزوج حين وضعت وإن كانت في دمها غير أنه لا يقربها زوجها حتى تطهر ‏.‏",
      "text_en": " ‘Ubaid Allah bin ‘Abd Allah bin ‘Utbah said that his father wrote (a letter) to ‘Abd Allaah bin Al Arqam Al Zuhri asking him to visit Subai’ah daughter of Al Harith Al Aslamiyyah and ask her about her story and what the Apostle of Allaah(ﷺ) said to her when she asked his opinion (about her). So, ‘Umar bin Abd allah wrote in reply to ‘Abd Allah bin ‘Utbah informing him what she told him. She told that she was under (i.e., the wife of) Sa’d bin Khawlah who belonged to Banu Amir bin Luwayy. He was one of those who participated in the battle of Badr. He died at the Farwell Pilgrimage while she was pregnant. Soon after his death she gave birth to a child. When she was purified from her bleeding after child birth she adorned herself for seekers in marriage. Then Abu Al Sanabil bin Ba’kah a man from Banu Abd Al Dar entered upon her and said to her “What is the matter seeing you adorned, perhaps you are seeking marriage? I swear by Allah you cannot marry until four months and ten days pass away. Saubai’ah said “When she said this to me, I gathered my clothes on me when the evening came and I came to the Apostle of Allaah(ﷺ) and asked him about that. He told me that I became lawful when I had delivered a child. He suggested me to marry if I wished. Ibn Shihab said “I do not see any harm if she marries when she gives birth to the child, even though she had the bleeding after the child birth, but her husband should not have sexual intercourse till she is purified.",
      "chain": [
        "30584",
        "20029",
        "20475",
        "11013",
        "11004"
      ]
    },
    {
      "hadith_no": "2320",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا سليمان بن داود العتكي، حدثنا حماد، حدثنا أيوب، عن نافع، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الشهر تسع وعشرون فلا تصوموا حتى تروه ولا تفطروا حتى تروه فإن غم عليكم فاقدروا له ثلاثين ‏\"‏ ‏.‏ قال فكان ابن عمر إذا كان شعبان تسعا وعشرين نظر له فإن رؤي فذاك وإن لم ير ولم يحل دون منظره سحاب ولا قترة أصبح مفطرا فإن حال دون منظره سحاب أو قترة أصبح صائما ‏.‏ قال فكان ابن عمر يفطر مع الناس ولا يأخذ بهذا الحساب ‏.‏",
      "text_en": " Ibn ‘Umar reported the Apostle of Allaah(ﷺ) as saying “The month consists of twenty nine days, but do not fast till you sight it (the moon) and do not break your fast till you sight it. If the weather is cloudy, calculate it thirty days. When the twenty-ninth of Sha’ban came, Ibn ‘Umar would send someone (who tried) to sight the moon for him. If it was sighted then well and good, in case it was not sighted and there was no cloud and dust before him (on the horizon) he would not keep fast the next day. If there appeared (on the horizon) before him cloud or dust, he would fast the following day. Ibn ‘Umar would end his fasting alone with the people and did not follow this calculation.”",
      "chain": [
        "30584",
        "20022",
        "11015",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2394",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا سليمان بن داود المهري، أخبرنا ابن وهب، أخبرني عمرو بن الحارث، أن عبد الرحمن بن القاسم، حدثه أن محمد بن جعفر بن الزبير حدثه أن عباد بن عبد الله بن الزبير حدثه أنه، سمع عائشة، زوج النبي صلى الله عليه وسلم تقول أتى رجل إلى النبي صلى الله عليه وسلم في المسجد في رمضان فقال يا رسول الله احترقت ‏.‏ فسأله النبي صلى الله عليه وسلم ما شأنه قال أصبت أهلي ‏.‏ قال ‏\"‏ تصدق ‏\"‏ ‏.‏ قال والله ما لي شىء ولا أقدر عليه ‏.‏ قال ‏\"‏ اجلس ‏\"‏ ‏.‏ فجلس فبينما هو على ذلك أقبل رجل يسوق حمارا عليه طعام فقال رسول الله صلى الله عليه وسلم ‏\"‏ أين المحترق آنفا ‏\"‏ ‏.‏ فقام الرجل فقال رسول الله صلى الله عليه وسلم ‏\"‏ تصدق بهذا ‏\"‏ ‏.‏ فقال يا رسول الله أعلى غيرنا فوالله إنا لجياع ما لنا شىء ‏.‏ قال ‏\"‏ كلوه ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Aishah, wife of Prophet (ﷺ):                     A man came to the Prophet (ﷺ) during Ramadan in the mosque. He said: Messenger of Allah, I am burnt. The Prophet (ﷺ) asked him what happened to him. He said: I had sexual intercourse with my wife. He said: Give sadaqah (alms). He said: I swear by Allah, I possess nothing with me, and I cannot do this. He said: Sit down. He sat down. While he was waiting, a man came forward driving his donkey loaded with food. The Messenger of Allah (ﷺ) said: Where is the man who was burnt just now ? Thereupon the man stood up. The Messenger of Allah (ﷺ) said: Give it as sadaqah (alms). He asked: Messenger of Allah, to others than us ? By Allah. we are hungry, we have nothing (to eat). He said: Eat it yourselves.",
      "chain": [
        "30584",
        "20029",
        "20377",
        "10530",
        "11215",
        "11250"
      ]
    },
    {
      "hadith_no": "2445",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا سليمان بن داود المهري، حدثنا ابن وهب، أخبرني يحيى بن أيوب، أن إسماعيل بن أمية القرشي، حدثه أنه، سمع أبا غطفان، يقول سمعت عبد الله بن عباس، يقول حين صام النبي صلى الله عليه وسلم يوم عاشوراء وأمرنا بصيامه قالوا يا رسول الله إنه يوم تعظمه اليهود والنصارى ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ فإذا كان العام المقبل صمنا يوم التاسع ‏\"‏ ‏.‏ فلم يأت العام المقبل حتى توفي رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Ibn 'Abbas said:                      When the Prophet (ﷺ) on the day of 'Ashurah and commanded us to fast on it, they  (i.e. Companions) said: Messenger of Allah, this is a day which is considered great by Jews and Christians ? The Messenger of Allah (ﷺ) said: When the next year comes, we shall fast on the 9th of Muharram. But the next year the Messenger of Allah (ﷺ) breathed his last.",
      "chain": [
        "30584",
        "20029",
        "20379",
        "11417",
        "17"
      ]
    },
    {
      "hadith_no": "2465",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا سليمان بن داود المهري، أخبرنا ابن وهب، عن يونس، أن نافعا، أخبره عن ابن عمر، أن النبي صلى الله عليه وسلم كان يعتكف العشر الأواخر من رمضان ‏.‏ قال نافع وقد أراني عبد الله المكان الذي يعتكف فيه رسول الله صلى الله عليه وسلم من المسجد ‏.‏",
      "text_en": " Ibn 'Umar said:                      The Prophet (ﷺ) used to observe I'tikaf during the last ten days of Ramadan. Nafi' said: 'Abd Allah (b. 'Umar) showed me the place in the mosque where Messenger of Allah (ﷺ) used to observe I'tikaf.",
      "chain": [
        "30584",
        "20029",
        "20475",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2490",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا سليمان بن داود العتكي، حدثنا حماد، - يعني ابن زيد - عن يحيى بن سعيد، عن محمد بن يحيى بن حبان، عن أنس بن مالك، قال حدثتني أم حرام بنت ملحان، أخت أم سليم أن رسول الله صلى الله عليه وسلم قال عندهم فاستيقظ وهو يضحك ‏.‏ قالت فقلت يا رسول الله ما أضحكك قال ‏\"‏ رأيت قوما ممن يركب ظهر هذا البحر كالملوك على الأسرة ‏\"‏ ‏.‏ قالت قلت يا رسول الله ادع الله أن يجعلني منهم ‏.‏ قال ‏\"‏ فإنك منهم ‏\"‏ ‏.‏ قالت ثم نام فاستيقظ وهو يضحك ‏.‏ قالت فقلت يا رسول الله ما أضحكك فقال مثل مقالته ‏.‏ قلت يا رسول الله ادع الله أن يجعلني منهم ‏.‏ قال ‏\"‏ أنت من الأولين ‏\"‏ ‏.‏ قال فتزوجها عبادة بن الصامت فغزا في البحر فحملها معه فلما رجع قربت لها بغلة لتركبها فصرعتها فاندقت عنقها فماتت ‏.‏",
      "text_en": " Anas bin Malik (may Allaah be pleased with him) said “Umm Haram, daughter of Milhan, sister of Umm Sulaim, narrated to me that the Apostle of Allaah(ﷺ) took a mid day nap with them. He then awoke laughing. She said “I asked the Apostle of Allaah(ﷺ), what made you laugh?” He replied  “I saw some people who ere sailing in the midst of the sea like kings on thrones. She said “I said the Apostle of Allaah(ﷺ) beseech Allaah that He may put me among them. He replied “You will be among them.” She said “He then slept and awoke laughing. She said “I asked the Apostle of Allaah(ﷺ), what made you laugh? He replied as he said in the first reply. She said “I said the Apostle of Allaah(ﷺ) beseech Allaah that HE may put me amongst them. He replied “You will be among the first. Then ‘Ubadah bin Al Samit married her and sailed on the sea on an expedition and took her with him. When he returned, a riding beast was brought near her to ride, but it threw her down. Her neck was broken and she died.",
      "chain": [
        "30584",
        "20022",
        "20031",
        "11222",
        "19"
      ]
    },
    {
      "hadith_no": "2642",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا سليمان بن داود المهري، أخبرنا ابن وهب، أخبرني يحيى بن أيوب، عن حميد الطويل، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أمرت أن أقاتل المشركين ‏\"‏ ‏.‏ بمعناه ‏.‏",
      "text_en": " Anas bin Malik reported the Apostle of Allaah(ﷺ) as saying “ I am commanded to fight with the polytheists. The rest of the tradition is to the same effect as mentioned above.”",
      "chain": [
        "30584",
        "20029",
        "20379",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "2879",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wills (Kitab Al-Wasaya) - كتاب الوصايا",
      "chapter_no": "18",
      "text_ar": "حدثنا سليمان بن داود المهري، حدثنا ابن وهب، أخبرني الليث، عن يحيى بن سعيد، عن صدقة، عمر بن الخطاب رضى الله عنه قال نسخها لي عبد الحميد بن عبد الله بن عبد الله بن عمر بن الخطاب بسم الله الرحمن الرحيم هذا ما كتب عبد الله عمر في ثمغ فقص من خبره نحو حديث نافع قال غير متأثل مالا فما عفا عنه من ثمره فهو للسائل والمحروم - قال وساق القصة - قال وإن شاء ولي ثمغ اشترى من ثمره رقيقا لعمله وكتب معيقيب وشهد عبد الله بن الأرقم بسم الله الرحمن الرحيم هذا ما أوصى به عبد الله عمر أمير المؤمنين إن حدث به حدث أن ثمغا وصرمة بن الأكوع والعبد الذي فيه والمائة سهم التي بخيبر ورقيقه الذي فيه والمائة التي أطعمه محمد صلى الله عليه وسلم بالوادي تليه حفصة ما عاشت ثم يليه ذو الرأى من أهلها أن لا يباع ولا يشترى ينفقه حيث رأى من السائل والمحروم وذي القربى ولا حرج على من وليه إن أكل أو آكل أو اشترى رقيقا منه ‏.‏",
      "text_en": " Narrated Yahya b. Sa'id:                     'Abd al-Hamid b. Abd 'Allah b. 'Abd Allah b. 'Umar b. al-Khattab copied to me a document about the religious endowment (waqf) made by 'Umar b. al-Khattab : In the name of Allah, the Compassionate, the Merciful. This is what Allah's servant 'Umar has written about Thamgh. He narrated the tradition like the one transmitted by Nafi'. He added: \"provided he is not storing up goods (for himself)\". The surplus fruit will be devoted to the beggar and the deprived. He then went on with the tradition, saying: If the man in charge of Thamgh wishes to buy a slave for his work for its fruits (by selling them), he may do so. Mu'iqib penned it and 'Abd Allah b. al-Arqam witnessed it : In the name of Allah, the Compassionate, the Merciful. This is what Allah's servant 'Umar , Commander of Faithful, directed, in case of some incident happens to him (i.e. he dies), that Thamg, Sirmah b. al-Akwa', the servant who is there, the hundred shares in (the land of) Khaibr, the servant who is there and the hundred sahres which Muhammad (ﷺ) had donated to me in the valley (nearly) will remain in the custody of Hafsah during her life, then the men of opinion from her family will be in charge of these (endowments), that these will neither be sold not purchased, spending (its produce) where they think (necessary on the beggar, deprived and relatives). There is no harm to the one in charge (of this endowment) if he eats himself, or feeds, or buys slaves with it.",
      "chain": [
        "30584",
        "20029",
        "20023",
        "11062"
      ]
    },
    {
      "hadith_no": "2967",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا هشام بن عمار، حدثنا حاتم بن إسماعيل، ح وحدثنا سليمان بن داود المهري، أخبرنا ابن وهب، أخبرني عبد العزيز بن محمد، ح وحدثنا نصر بن علي، حدثنا صفوان بن عيسى، - وهذا لفظ حديثه - كلهم عن أسامة بن زيد، عن الزهري، عن مالك بن أوس بن الحدثان، قال كان فيما احتج به عمر رضى الله عنه أنه قال كانت لرسول الله صلى الله عليه وسلم ثلاث صفايا بنو النضير وخيبر وفدك فأما بنو النضير فكانت حبسا لنوائبه وأما فدك فكانت حبسا لأبناء السبيل وأما خيبر فجزأها رسول الله صلى الله عليه وسلم ثلاثة أجزاء جزءين بين المسلمين وجزءا نفقة لأهله فما فضل عن نفقة أهله جعله بين فقراء المهاجرين ‏.‏",
      "text_en": " Narrated Umar ibn al-Khattab:                     Malik ibn Aws al-Hadthan said: One of the arguments put forward by Umar was that he said that the Messenger of Allah (ﷺ) received three things exclusively to himself: Banu an-Nadir, Khaybar and Fadak. The Banu an-Nadir property was kept wholly for his emergent needs, Fadak for travellers, and Khaybar was divided by the Messenger of Allah (ﷺ) into three sections: two for Muslims, and one as a contribution for his family. If anything remained after making the contribution of his family, he divided it among the poor Emigrants.",
      "chain": [
        "30288",
        "20159",
        "30584",
        "20029",
        "20167",
        "30395",
        "20553",
        "50",
        "11013",
        "5030"
      ]
    },
    {
      "hadith_no": "3008",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا سليمان بن داود المهري، أخبرني ابن وهب، أخبرني أسامة بن زيد الليثي، عن نافع، عن عبد الله بن عمر، قال لما افتتحت خيبر سألت يهود رسول الله صلى الله عليه وسلم أن يقرهم على أن يعملوا على النصف مما خرج منها فقال رسول الله صلى الله عليه وسلم ‏\"‏ أقركم فيها على ذلك ما شئنا ‏\"‏ ‏.‏ فكانوا على ذلك وكان التمر يقسم على السهمان من نصف خيبر ويأخذ رسول الله صلى الله عليه وسلم الخمس وكان رسول الله صلى الله عليه وسلم أطعم كل امرأة من أزواجه من الخمس مائة وسق تمرا وعشرين وسقا شعيرا فلما أراد عمر إخراج اليهود أرسل إلى أزواج النبي صلى الله عليه وسلم فقال لهن من أحب منكن أن أقسم لها نخلا بخرصها مائة وسق فيكون لها أصلها وأرضها وماؤها ومن الزرع مزرعة خرص عشرين وسقا فعلنا ومن أحب أن نعزل الذي لها في الخمس كما هو فعلنا ‏.‏",
      "text_en": " ‘Abd Allah bin ‘Umar reported that ‘Umar said “When Khaibar was conquered, the Jews asked the Apostle of Allaah(ﷺ) to confirm that they would do all the cultivation and have half the produce. The Apostle of Allaah(ﷺ) said “I shall confirm you on that condition as long as we wish. So they were confirmed on that (condition). The dates from half the produce of Khaibar were divided into a number of portions. The Apostle of Allaah(ﷺ) would take the fifth. The Apostle of Allaah(ﷺ) used to contribute from the fifth one hundred wasqs of dates and twenty wasqs of wheat to each of his wives. When ‘Umar intended to expel the Jews from Khaibar he sent a message to the wives of the Prophet (ﷺ) and said to them “If any of you wishes that I divide the palm trees for her by their assessment that amounts one hundred wasqs (of dates) and to her belongs their root, their land and their water and (likewise) twenty wasqs from the produce of the cultivated land by assessment, I shall (do that). And if any of you wishes that we take out her portion from the fifth, we shall do (that).",
      "chain": [
        "30584",
        "20029",
        "20500",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3032",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا سليمان بن داود العتكي، حدثنا جرير، عن قابوس بن أبي ظبيان، عن أبيه، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تكون قبلتان في بلد واحد ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Prophet (ﷺ) said: Two qiblahs in one land are not right.",
      "chain": [
        "30584",
        "20028",
        "15452",
        "17"
      ]
    },
    {
      "hadith_no": "3045",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا سليمان بن داود المهري، أخبرنا ابن وهب، أخبرني يونس بن يزيد، عن ابن شهاب، عن عروة بن الزبير، أن هشام بن حكيم بن حزام، وجد رجلا وهو على حمص يشمس ناسا من النبط في أداء الجزية فقال ما هذا سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن الله يعذب الذين يعذبون الناس في الدنيا ‏\"‏ ‏.‏",
      "text_en": " ‘Urwa bin Al Zubair said “Hisham bin Halim bin Hizam found a man who was the governor of Hims making some Copts stand in the sun for the payment of jizyah. He said “What is this?” I heard the Apostle (ﷺ) as saying “Allaah Most High will punish those who punish the people in this world.”",
      "chain": [
        "30584",
        "20029",
        "20475",
        "11013",
        "10511",
        "434"
      ]
    },
    {
      "hadith_no": "3052",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا سليمان بن داود المهري، أخبرنا ابن وهب، حدثني أبو صخر المديني، أن صفوان بن سليم، أخبره عن عدة، من أبناء أصحاب رسول الله صلى الله عليه وسلم عن آبائهم دنية عن رسول الله صلى الله عليه وسلم قال ‏\"‏ ألا من ظلم معاهدا أو انتقصه أو كلفه فوق طاقته أو أخذ منه شيئا بغير طيب نفس فأنا حجيجه يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " Narrated A number of Companions of the Prophet:                     Safwan reported from a number of Companions of the Messenger of Allah (ﷺ) on the authority of their fathers who were relatives of each other. The Messenger of Allah (ﷺ) said: Beware, if anyone wrongs a contracting man, or diminishes his right, or forces him to work beyond his capacity, or takes from him anything without his consent, I shall plead for him on the Day of Judgment.",
      "chain": [
        "30584",
        "20029",
        "11177"
      ]
    },
    {
      "hadith_no": "3068",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا سليمان بن داود المهري، أخبرنا ابن وهب، حدثني سبرة بن عبد العزيز بن الربيع الجهني، عن أبيه، عن جده، أن النبي صلى الله عليه وسلم نزل في موضع المسجد تحت دومة فأقام ثلاثا ثم خرج إلى تبوك وإن جهينة لحقوه بالرحبة فقال لهم ‏\"‏ من أهل ذي المروة ‏\"‏ ‏.‏ فقالوا بنو رفاعة من جهينة ‏.‏ فقال ‏\"‏ قد أقطعتها لبني رفاعة ‏\"‏ ‏.‏ فاقتسموها فمنهم من باع ومنهم من أمسك فعمل ثم سألت أباه عبد العزيز عن هذا الحديث فحدثني ببعضه ولم يحدثني به كله ‏.‏",
      "text_en": " Narrated Saburah ibn Ma'bad al-Juhani:                     The Prophet (ﷺ) alighted at a place where a mosque has been built under a large tree. He tarried there for three days, and then proceeded to Tabuk. Juhaynah met him on a wide plain. He asked them: who are the people of Dhul-Marwah? They replied: Banu Rifa'ah of Juhaynah. He said: I have given this (land) to Banu Rifa'ah as a fief. Therefore, they divided it. Some of them sold (their share) and others retained and worked on it.  (Sub-narrator Ibn Wahab said: I then asked AbdulAziz about this tradition. He narrated a part of it to me and did not narrate it in full.",
      "chain": [
        "30584",
        "20029"
      ]
    },
    {
      "hadith_no": "3135",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، ح وحدثنا سليمان بن داود المهري، أخبرنا ابن وهب، - وهذا لفظه - أخبرني أسامة بن زيد الليثي، أن ابن شهاب، أخبره أن أنس بن مالك حدثهم أن شهداء أحد لم يغسلوا ودفنوا بدمائهم ولم يصل عليهم ‏.‏",
      "text_en": " Narrated Anas ibn Malik:                     The martyrs of Uhud were not washed, and they were buried with their blood. No prayer was offered over them.",
      "chain": [
        "30226",
        "20029",
        "30584",
        "20029",
        "20500",
        "11013",
        "19"
      ]
    },
    {
      "hadith_no": "3139",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا سليمان بن داود المهري، حدثنا ابن وهب، عن الليث، بهذا الحديث بمعناه قال يجمع بين الرجلين من قتلى أحد في ثوب واحد ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by al-Laith through a different chain of the same effect. This version adds:                      He combined two persons from among the martyrs of Uhud in one garment.",
      "chain": [
        "30584",
        "20029",
        "20023"
      ]
    },
    {
      "hadith_no": "3252",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا سليمان بن داود العتكي، حدثنا إسماعيل بن جعفر المدني، عن أبي سهيل، نافع بن مالك بن أبي عامر عن أبيه، أنه سمع طلحة بن عبيد الله يعني في، حديث قصة الأعرابي قال النبي صلى الله عليه وسلم ‏\"‏ أفلح وأبيه إن صدق دخل الجنة وأبيه إن صدق ‏\"‏ ‏.‏",
      "text_en": " Referring to the story of a bedouin, Talhah b. 'Ubaid Allah reported the Prophet (ﷺ) as saying:                      He became successful, by his father, if he speaks the truth, he will enter paradise, by his father, if he speaks truth.",
      "chain": [
        "30584",
        "20155",
        "11445",
        "11443"
      ]
    },
    {
      "hadith_no": "3317",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا سليمان بن داود، وابن السرح، قالا حدثنا ابن وهب، أخبرني يونس، قال قال ابن شهاب فأخبرني عبد الرحمن بن عبد الله بن كعب بن مالك، أن عبد الله بن كعب، - وكان قائد كعب من بنيه حين عمي - عن كعب بن مالك، قال قلت ‏:‏ يا رسول الله إن من توبتي أن أنخلع من مالي صدقة إلى الله وإلى رسوله ‏.‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏ أمسك عليك بعض مالك فهو خير لك ‏\"‏ ‏.‏ قال فقلت ‏:‏ إني أمسك سهمي الذي بخيبر ‏.‏",
      "text_en": " Narrated Ka'b ibn Malik:                     I said: Messenger of Allah, to make my repentance complete I should divest myself of my property as sadaqah (alms) for Allah and His Apostle. The Messenger of Allah (ﷺ) said: Retain some of your property, for that will be better for you. So he said: I shall retain the portion I have at Khaybar.",
      "chain": [
        "30584",
        "30485",
        "20029",
        "20475",
        "11013",
        "11519",
        "1131",
        "390"
      ]
    },
    {
      "hadith_no": "3342",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا سليمان بن داود المهري، أخبرنا ابن وهب، حدثني سعيد بن أبي أيوب، أنه سمع أبا عبد الله القرشي، يقول سمعت أبا بردة بن أبي موسى الأشعري، يقول عن أبيه، عن رسول الله صلى الله عليه وسلم أنه قال ‏\"‏ إن أعظم الذنوب عند الله أن يلقاه بها عبد - بعد الكبائر التي نهى الله عنها - أن يموت رجل وعليه دين لا يدع له قضاء ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuMusa al-Ash'ari:                     The Prophet (ﷺ) said: After the grave sins which Allah has prohibited the greatest sin is that a man dies while he has debt due from him and does not leave anything to pay it off, and meets Him with it.",
      "chain": [
        "30584",
        "20029",
        "20375",
        "30184",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "3462",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا سليمان بن داود المهري، أخبرنا ابن وهب، أخبرني حيوة بن شريح، ح وحدثنا جعفر بن مسافر التنيسي، حدثنا عبد الله بن يحيى البرلسي، حدثنا حيوة بن شريح، عن إسحاق أبي عبد الرحمن، - قال سليمان عن أبي عبد الرحمن الخراساني، - أن عطاء الخراساني، حدثه أن نافعا حدثه عن ابن عمر، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إذا تبايعتم بالعينة وأخذتم أذناب البقر ورضيتم بالزرع وتركتم الجهاد سلط الله عليكم ذلا لا ينزعه حتى ترجعوا إلى دينكم ‏\"‏ ‏.‏ قال أبو داود الإخبار لجعفر وهذا لفظه ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     I heard the Messenger of Allah, (ﷺ) say: When you enter into the inah transaction, hold the tails of oxen, are pleased with agriculture, and give up conducting jihad (struggle in the way of Allah). Allah will make disgrace prevail over you, and will not withdraw it until you return to your original religion.",
      "chain": [
        "30584",
        "20029",
        "26010",
        "38132",
        "30354",
        "26010",
        "11005",
        "11359",
        "10947",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3470",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا سليمان بن داود المهري، وأحمد بن سعيد الهمداني، قالا أخبرنا ابن وهب، قال أخبرني ابن جريج، ح وحدثنا محمد بن معمر، حدثنا أبو عاصم، عن ابن جريج، - المعنى - أن أبا الزبير المكي، أخبره عن جابر بن عبد الله، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن بعت من أخيك تمرا فأصابتها جائحة فلا يحل لك أن تأخذ منه شيئا بم تأخذ مال أخيك بغير حق ‏\"‏ ‏.‏",
      "text_en": " Narrated Jabir bin ‘Abdullah :                     The Messenger of Allah (ﷺ) as saying: If you were to sell dried dates to your brother and they were smitten by blight, it will not be allowable for you to take your brother's property unjustly.",
      "chain": [
        "30584",
        "30296",
        "20029",
        "11070",
        "30172",
        "20241",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "3471",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا سليمان بن داود المهري، أخبرنا ابن وهب، أخبرني عثمان بن الحكم، عن ابن جريج، عن عطاء، قال الجوائح كل ظاهر مفسد من مطر أو برد أو جراد أو ريح أو حريق ‏.‏",
      "text_en": " 'Ata said:                      Blight means anything which obviously damages (the crop), by rain, hail, locust, blast of wind, or fire.",
      "chain": [
        "30584",
        "20029",
        "11070",
        "11029"
      ]
    },
    {
      "hadith_no": "3472",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا سليمان بن داود، أخبرنا ابن وهب، أخبرني عثمان بن الحكم، عن يحيى بن سعيد، أنه قال لا جائحة فيما أصيب دون ثلث رأس المال - قال يحيى - وذلك في سنة المسلمين ‏.‏",
      "text_en": " Yahya b. Sa'id said:                      Blight is not effective when less than one-third of goods are damaged. Yayha said: That has been the established practice of Muslims.",
      "chain": [
        "30584",
        "20029",
        "11062"
      ]
    },
    {
      "hadith_no": "3521",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا سليمان بن داود، حدثنا عبد الله، - يعني ابن وهب - أخبرني يونس، عن ابن شهاب، قال أخبرني أبو بكر بن عبد الرحمن بن الحارث بن هشام، أن رسول الله صلى الله عليه وسلم فذكر معنى حديث مالك زاد ‏\"‏ وإن قضى من ثمنها شيئا فهو أسوة الغرماء فيها ‏\"‏ ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Abu Bakr b. 'Adb al-Rahman b. al-Harith b. Hisham from Messenger of Allah (ﷺ) through a different chain of narrators to the same effect as narrated by Malik. This version adds:                      \"If he paid something from the price (of the property), then he will be equal to the creditors in it.\"",
      "chain": [
        "30584",
        "20029",
        "20475",
        "11013",
        "11003"
      ]
    },
    {
      "hadith_no": "3540",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا سليمان بن داود المهري، أخبرنا ابن وهب، أخبرني أسامة بن زيد، أن عمرو بن شعيب، حدثه عن أبيه، عن عبد الله بن عمرو، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ مثل الذي يسترد ما وهب كمثل الكلب يقيء فيأكل قيئه فإذا استرد الواهب فليوقف فليعرف بما استرد ثم ليدفع إليه ما وهب ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     The Prophet (ﷺ) said: The similitude of the one who takes back what he gifted is like that of a dog which vomits and then it eats vomit. When a donor seeks to take back (his gift), it should be made known and he informed why he sought to take it back. Then whatever he donated should be returned to him.",
      "chain": [
        "30584",
        "20029",
        "50",
        "19934",
        "19911",
        "29"
      ]
    },
    {
      "hadith_no": "3586",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا سليمان بن داود المهري، أخبرنا ابن وهب، عن يونس بن يزيد، عن ابن شهاب، أن عمر بن الخطاب، - رضى الله عنه - قال وهو على المنبر يا أيها الناس إن الرأى إنما كان من رسول الله صلى الله عليه وسلم مصيبا لأن الله كان يريه وإنما هو منا الظن والتكلف ‏.‏",
      "text_en": " Narrated Umar ibn al-Khattab:                     Umar said while he was (sitting) on the pulpit: O people, the opinion from the Messenger of Allah (ﷺ) was right, because Allah showed (i.e. inspired) him; but from us it is sheer conjecture and artifice.",
      "chain": [
        "30584",
        "20029",
        "20475",
        "11013",
        "3"
      ]
    },
    {
      "hadith_no": "3594",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا سليمان بن داود المهري، أخبرنا ابن وهب، أخبرني سليمان بن بلال، ح وحدثنا أحمد بن عبد الواحد الدمشقي، حدثنا مروان، - يعني ابن محمد - حدثنا سليمان بن بلال، أو عبد العزيز بن محمد - شك الشيخ - عن كثير بن زيد، عن الوليد بن رباح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الصلح جائز بين المسلمين ‏\"‏ ‏.‏ زاد أحمد ‏\"‏ إلا صلحا أحل حراما أو حرم حلالا ‏\"‏ ‏.‏ وزاد سليمان بن داود وقال رسول الله صلى الله عليه وسلم ‏\"‏ المسلمون على شروطهم ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: Conciliation between Muslims is permissible. The narrator Ahmad added in his version: \"except the conciliation which makes lawful unlawful and unlawful lawful.\" Sulayman ibn Dawud added: The Messenger of Allah (ﷺ) said: Muslims are on (i.e. stick to) their conditions.",
      "chain": [
        "30584",
        "20029",
        "20160",
        "20640",
        "20160",
        "22171",
        "13"
      ]
    },
    {
      "hadith_no": "3636",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا سليمان بن داود العتكي، حدثنا حماد، حدثنا واصل، مولى أبي عيينة قال سمعت أبا جعفر، محمد بن علي يحدث عن سمرة بن جندب، أنه كانت له عضد من نخل في حائط رجل من الأنصار قال ومع الرجل أهله قال فكان سمرة يدخل إلى نخله فيتأذى به ويشق عليه فطلب إليه أن يبيعه فأبى فطلب إليه أن يناقله فأبى فأتى النبي صلى الله عليه وسلم فذكر ذلك له فطلب إليه النبي صلى الله عليه وسلم أن يبيعه فأبى فطلب إليه أن يناقله فأبى ‏.‏ قال ‏\"‏ فهبه له ولك كذا وكذا ‏\"‏ ‏.‏ أمرا رغبه فيه فأبى فقال ‏\"‏ أنت مضار ‏\"‏ ‏.‏ فقال رسول الله صلى الله عليه وسلم للأنصاري ‏\"‏ اذهب فاقلع نخله ‏\"‏ ‏.‏",
      "text_en": " Abu Ja'far Muhammad bin 'Ali reported from Samurah ibn Jundub that he had a row of palm-trees in the garden of a man of the Ansar. The man had his family with him. Samurah used to visit his palm-trees, and the man was annoyed by that and felt it keenly. So he asked him (Samurah) to sell them to him, but he refused. He then asked him to take something else in exchange, but he refused.  So he came to the Holy Prophet (ﷺ) and mentioned it to him. The Holy Prophet (ﷺ) asked him to sell it to him, but he refused. He asked him to take something else in exchange, but he refused.  He then said:                      Give it to him and you can have such and such, mentioning something with which he tried to please him, but he refused. He then said: You are a nuisance. The Messenger of Allah (ﷺ) then said to the Ansari: Go and uproot his palm-trees.",
      "chain": [
        "30584",
        "20022",
        "11442",
        "394"
      ]
    },
    {
      "hadith_no": "3655",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Knowledge (Kitab Al-Ilm) - كتاب العلم",
      "chapter_no": "26",
      "text_ar": "حدثنا سليمان بن داود المهري، أخبرنا ابن وهب، أخبرني يونس، عن ابن شهاب، أن عروة بن الزبير، حدثه أن عائشة زوج النبي صلى الله عليه وسلم قالت ألا يعجبك أبو هريرة جاء فجلس إلى جانب حجرتي يحدث عن رسول الله صلى الله عليه وسلم يسمعني ذلك وكنت أسبح فقام قبل أن أقضي سبحتي ولو أدركته لرددت عليه إن رسول الله صلى الله عليه وسلم لم يكن يسرد الحديث مثل سردكم ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     Are you not surprised at AbuHurayrah? He came and sat beside my apartment, and began to narrate traditions from the Messenger of Allah (ﷺ) making me hear them. I am saying supererogatory prayer. He got up (and went away) before I finished my prayer. Had I found him, I would have replied to him. The Messenger of Allah (ﷺ) did not narrate traditions quickly one after another as you narrate quickly.",
      "chain": [
        "30584",
        "20029",
        "20475",
        "11013",
        "10511"
      ]
    },
    {
      "hadith_no": "3679",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Drinks (Kitab Al-Ashribah) - كتاب الأشربة",
      "chapter_no": "27",
      "text_ar": "حدثنا سليمان بن داود، ومحمد بن عيسى، - في آخرين - قالوا حدثنا حماد، - يعني ابن زيد - عن أيوب، عن نافع، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ كل مسكر خمر وكل مسكر حرام ومن مات وهو يشرب الخمر يدمنها لم يشربها في الآخرة ‏\"‏ ‏.‏",
      "text_en": " Ibn ‘Umar reported the Apostel of Allah (ﷺ) as saying:                      Every intoxicant is forbidden. He who drinks wine in this world, and dies when he is addiction to it, will not drink it in the next.",
      "chain": [
        "30584",
        "31167",
        "20022",
        "11015",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3889",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Medicine (Kitab Al-Tibb) - كتاب الطب",
      "chapter_no": "29",
      "text_ar": "حدثنا سليمان بن داود، حدثنا شريك، ح وحدثنا العباس العنبري، حدثنا يزيد بن هارون، أخبرنا شريك، عن العباس بن ذريح، عن الشعبي، - قال العباس - عن أنس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا رقية إلا من عين أو حمة أو دم يرقأ ‏\"‏ ‏.‏ لم يذكر العباس العين وهذا لفظ سليمان بن داود ‏.‏",
      "text_en": " Anas reported the Prophet (ﷺ) as saying :                      No spell is to be used except for the evil eye, or sting of  poisonous insects, or bleeding. The narrator al-‘Abhas did mention the words “evil eye”. The is the version of Sulaiman b. Dawud.",
      "chain": [
        "30584",
        "20587",
        "30437",
        "20472",
        "11858",
        "11052",
        "100",
        "19"
      ]
    },
    {
      "hadith_no": "3942",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book of Manumission of Slaves - كتاب العتق",
      "chapter_no": "31",
      "text_ar": "حدثنا سليمان بن داود، حدثنا حماد، عن أيوب، عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم بهذا الحديث قال أيوب فلا أدري هو في الحديث عن النبي صلى الله عليه وسلم أو شىء قاله نافع وإلا عتق منه ما عتق ‏.‏",
      "text_en": " The tradition mentioned above has also been narrated by Ibn 'Umar from the Prophet (ﷺ). The narrator Ayyub said:                      I do not know whether the following words are part of the tradition of the Prophet (ﷺ) or Nafi' told them himself: \"Otherwise he will be emancipated to the extent of the first man's share.\"",
      "chain": [
        "30584",
        "20022",
        "11015",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "4006",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Dialects and Readings of the Qur'an (Kitab Al-Huruf Wa Al-Qira'at) - كتاب الحروف والقراءات",
      "chapter_no": "32",
      "text_ar": "حدثنا أحمد بن صالح، قال حدثنا ح، وحدثنا سليمان بن داود المهري، أخبرنا ابن وهب، أخبرنا هشام بن سعد، عن زيد بن أسلم، عن عطاء بن يسار، عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ قال الله عز وجل لبني إسرائيل ‏{‏ ادخلوا الباب سجدا وقولوا حطة تغفر لكم خطاياكم ‏}‏ ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Sa’id Al Khudri :                     The Messenger of Allah (ﷺ) said: Allah, the Exalted, said to the children of Israel : \"... but enter the gate with humility, in posture and in words, and you will be forgiven your faults (tughfar lakum)\".",
      "chain": [
        "30226",
        "30584",
        "20029",
        "20519",
        "11163",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "4102",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا أحمد بن صالح، ح وحدثنا سليمان بن داود المهري، وابن السرح، وأحمد بن سعيد الهمداني، قالوا أخبرنا ابن وهب، قال أخبرني قرة بن عبد الرحمن المعافري، عن ابن شهاب، عن عروة بن الزبير، عن عائشة، - رضى الله عنها - أنها قالت يرحم الله نساء المهاجرات الأول لما أنزل الله ‏{‏ وليضربن بخمرهن على جيوبهن ‏}‏ شققن أكنف - قال ابن صالح أكثف - مروطهن فاختمرن بها ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     May Allah have mercy on the early immigrant women. When the verse \"That they should draw their veils over their bosoms\" was revealed, they tore their thick outer garments and made veils from them.",
      "chain": [
        "30226",
        "30584",
        "30485",
        "30296",
        "20029",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "4163",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Combing the Hair (Kitab Al-Tarajjul) - كتاب الترجل",
      "chapter_no": "35",
      "text_ar": "حدثنا سليمان بن داود المهري، أخبرنا ابن وهب، حدثني ابن أبي الزناد، عن سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من كان له شعر فليكرمه ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: He who has hair should honour it.",
      "chain": [
        "30584",
        "20029",
        "20509",
        "11173",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "4291",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا سليمان بن داود المهري، أخبرنا ابن وهب، أخبرني سعيد بن أبي أيوب، عن شراحيل بن يزيد المعافري، عن أبي علقمة، عن أبي هريرة، فيما أعلم عن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن الله يبعث لهذه الأمة على رأس كل مائة سنة من يجدد لها دينها ‏\"‏ ‏.‏ قال أبو داود رواه عبد الرحمن بن شريح الإسكندراني لم يجز به شراحيل ‏.‏",
      "text_en": " Narrated Abu Hurayrah:                     The Prophet (ﷺ) said: Allah will raise for this community at the end of every hundred years the one who will renovate its religion for it.Abu Dawud said: 'Abd al-Rahman bin Shuriah al-Iskandarani has also transmitted this tradition, but he did not exceed Shrahil.",
      "chain": [
        "30584",
        "20029",
        "20375",
        "10861"
      ]
    },
    {
      "hadith_no": "4376",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا سليمان بن داود المهري، أخبرنا ابن وهب، قال سمعت ابن جريج، يحدث عن عمرو بن شعيب، عن أبيه، عن عبد الله بن عمرو بن العاص، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ تعافوا الحدود فيما بينكم فما بلغني من حد فقد وجب ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     The Prophet (ﷺ) said: Forgive the infliction of prescribed penalties among yourselves, for any prescribed penalty of which I hear must be carried out.",
      "chain": [
        "30584",
        "20029",
        "11070",
        "19934",
        "19911",
        "29"
      ]
    },
    {
      "hadith_no": "4487",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا سليمان بن داود المهري المصري ابن أخي، رشدين بن سعد أخبرنا ابن وهب، أخبرنا أسامة بن زيد، أن ابن شهاب، حدثه عن عبد الرحمن بن أزهر، قال كأني أنظر إلى رسول الله صلى الله عليه وسلم الآن وهو في الرحال يلتمس رحل خالد بن الوليد فبينما هو كذلك إذ أتي برجل قد شرب الخمر فقال للناس ‏\"‏ اضربوه ‏\"‏ ‏.‏ فمنهم من ضربه بالنعال ومنهم من ضربه بالعصا ومنهم من ضربه بالميتخة - قال ابن وهب الجريدة الرطبة - ثم أخذ رسول الله صلى الله عليه وسلم ترابا من الأرض فرمى به في وجهه ‏.‏",
      "text_en": " Narrated AbdurRahman ibn Azhar:                     I can still picture myself looking at the Messenger of Allah (ﷺ) who was among the camps of the Companions seeking the camp of Khalid ibn al-Walid, when a man who had drunk wine was brought before him. He asked the people: Beat him. Some struck him with sandals, some with sticks and some with fresh branches of the palm-tree (mitakhah). Ibn Wahb said: This (mitakhah) means green palm fronds. Then the apostle of Allah (ﷺ) took some dust from the ground and threw it on his face.",
      "chain": [
        "30584",
        "20029",
        "50",
        "11013",
        "2216"
      ]
    },
    {
      "hadith_no": "4510",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا سليمان بن داود المهري، حدثنا ابن وهب، قال أخبرني يونس، عن ابن شهاب، قال كان جابر بن عبد الله يحدث أن يهودية، من أهل خيبر سمت شاة مصلية ثم أهدتها لرسول الله صلى الله عليه وسلم فأخذ رسول الله صلى الله عليه وسلم الذراع فأكل منها وأكل رهط من أصحابه معه ثم قال لهم رسول الله صلى الله عليه وسلم ‏\"‏ ارفعوا أيديكم ‏\"‏ ‏.‏ وأرسل رسول الله صلى الله عليه وسلم إلى اليهودية فدعاها فقال لها ‏\"‏ أسممت هذه الشاة ‏\"‏ ‏.‏ قالت اليهودية من أخبرك قال ‏\"‏ أخبرتني هذه في يدي ‏\"‏ ‏.‏ للذراع ‏.‏ قالت نعم ‏.‏ قال ‏\"‏ فما أردت إلى ذلك ‏\"‏ ‏.‏ قالت قلت إن كان نبيا فلن يضره وإن لم يكن استرحنا منه ‏.‏ فعفا عنها رسول الله صلى الله عليه وسلم ولم يعاقبها وتوفي بعض أصحابه الذين أكلوا من الشاة واحتجم رسول الله صلى الله عليه وسلم على كاهله من أجل الذي أكل من الشاة حجمه أبو هند بالقرن والشفرة وهو مولى لبني بياضة من الأنصار ‏.‏",
      "text_en": " Narrated Ibn Shihab:                     Jabir ibn Abdullah used to say that a Jewess from the inhabitants of Khaybar poisoned a roasted sheep and presented it to the Messenger of Allah (ﷺ) who took its foreleg and ate from it. A group of his companions also ate with him.  The Messenger of Allah (ﷺ) then said: Take your hands away (from the food). The Messenger of Allah (ﷺ) then sent someone to the Jewess and he called her.  He said to her: Have you poisoned this sheep?  The Jewess replied: Who has informed you? He said: This foreleg which I have in my hand has informed me.  She said: Yes.  He said: What did you intend by it?  She said: I thought if you were a prophet, it would not harm you; if you were not a prophet, we should rid ourselves of him (i.e. the Prophet). The Messenger of Allah (ﷺ) then forgave her, and did not punish her. But some of his companions who ate it, died. The Messenger of Allah (ﷺ) had himself cupped on his shoulder on account of that which he had eaten from the sheep. AbuHind cupped him with the horn and knife. He was a client of Banu Bayadah from the Ansar.",
      "chain": [
        "30584",
        "20029",
        "20475",
        "11013",
        "34"
      ]
    },
    {
      "hadith_no": "4645",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا قطن بن نسير، حدثنا جعفر يعني ابن سليمان، ح حدثنا سليمان بن داود، عن شريك، عن سليمان الأعمش، قال جمعت مع الحجاج فخطب فذكر حديث أبي بكر بن عياش قال فيها فاسمعوا وأطيعوا لخليفة الله وصفيه عبد الملك بن مروان ‏.‏ وساق الحديث قال ولو أخذت ربيعة بمضر ولم يذكر قصة الحمراء ‏.‏",
      "text_en": " Sulaiman al-A’mash said:                      I prayed the Friday prayer with al-Hajjaj and he addressed. He then transmitted the tradition of Abu Bakr b. ‘Ayyash. He said in it: Hear and obey the caliph of Allah and his select ‘Abd al-Malik bin Marwan. He then transmitted the rest of the tradition, and said: If I seized Rabi’ah for Mudar. But he did not mention the story of the clients (i.e. non Arabs).",
      "chain": [
        "30444",
        "20532",
        "30584",
        "11858",
        "11060"
      ]
    },
    {
      "hadith_no": "4735",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا سليمان بن داود المهري، أخبرنا عبد الله بن وهب، قال أخبرني يونس بن يزيد، عن ابن شهاب، قال أخبرني عروة بن الزبير، وسعيد بن المسيب، وعلقمة بن وقاص، وعبيد الله بن عبد الله، عن حديث، عائشة وكل حدثني طائفة، من الحديث قالت ولشأني في نفسي كان أحقر من أن يتكلم الله في بأمر يتلى ‏.‏",
      "text_en": " ‘A’ishah said:                      I thought in my mind that my affair was far inferior to the speaking of Allah about me with a command that will be recited.",
      "chain": [
        "30584",
        "20029",
        "20475",
        "11013",
        "10511",
        "11002",
        "11004"
      ]
    },
    {
      "hadith_no": "4760",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا مسدد، وسليمان بن داود، - المعنى - قالا حدثنا حماد بن زيد، عن المعلى بن زياد، وهشام بن حسان، عن الحسن، عن ضبة بن محصن، عن أم سلمة، زوج النبي صلى الله عليه وسلم قالت قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏ ستكون عليكم أئمة تعرفون منهم وتنكرون فمن أنكر ‏\"‏ ‏.‏ قال أبو داود قال هشام ‏:‏ ‏\"‏ بلسانه فقد برئ، ومن كره بقلبه فقد سلم ولكن من رضي وتابع ‏\"‏ ‏.‏ فقيل ‏:‏ يا رسول الله أفلا نقتلهم قال ابن داود ‏:‏ ‏\"‏ أفلا نقاتلهم ‏\"‏ ‏.‏ قال ‏:‏ ‏\"‏ لا ما صلوا ‏\"‏ ‏.‏",
      "text_en": " Umm Salamah, wife of the Prophet (May peace be upon him) is reported to have said:                      The Messenger of Allah (May peace be upon him) said: You will have commanders some of whom you will approve and some of whom you will disapprove. He who expresses disapproval with his tongue (Abu Dawud said : This is Hisham’s version) is guiltless; and he who feels disapproval in his heart, is safe, but he who is pleased and follows them. He was asked; shall we not kill them, Messenger of Allah? Abu Dawud’s version has : Shall we not fight with them? He replied : No, so long as they pray.",
      "chain": [
        "30175",
        "30584",
        "20022",
        "11311",
        "11016"
      ]
    },
    {
      "hadith_no": "4772",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا أبو داود الطيالسي، وسليمان بن داود، - يعني أبا أيوب الهاشمي - عن إبراهيم بن سعد، عن أبيه، عن أبي عبيدة بن محمد بن عمار بن ياسر، عن طلحة بن عبد الله بن عوف، عن سعيد بن زيد، عن النبي صلى الله عليه وسلم قال ‏:‏ ‏\"‏ من قتل دون ماله فهو شهيد، ومن قتل دون أهله أو دون دمه أو دون دينه فهو شهيد ‏\"‏ ‏.‏",
      "text_en": " Narrated Sa'id ibn Zayd:                     The Prophet (ﷺ) said: He who is killed while protecting his property is a martyr, and he who is killed while defending his family, or his blood, or his religion is a martyr.",
      "chain": [
        "30524",
        "20547",
        "30584",
        "20150",
        "11063",
        "19954",
        "11043",
        "11"
      ]
    },
    {
      "hadith_no": "4845",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا سليمان بن داود المهري، أخبرنا ابن وهب، قال أخبرني أسامة بن زيد الليثي، عن عمرو بن شعيب، عن أبيه، عن عبد الله بن عمرو، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يحل لرجل أن يفرق بين اثنين إلا بإذنهما ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     The Messenger of Allah (ﷺ) said: It is not lawful for a man to separate two persons except with their permission.",
      "chain": [
        "30584",
        "20029",
        "20500",
        "19934",
        "19911",
        "29"
      ]
    },
    {
      "hadith_no": "4974",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا سليمان بن داود، أخبرنا ابن وهب، قال أخبرنا الليث بن سعد، عن جعفر بن ربيعة، عن الأعرج، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يقولن أحدكم الكرم فإن الكرم الرجل المسلم ولكن قولوا حدائق الأعناب ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the Messenger of Allah (May peace be upon him) as saying :                      None of you should Call (grapes) karm, for the karm is a Muslim man, but call (grapes) garden of grapes (hada’iq al-a’nab).",
      "chain": [
        "30584",
        "20029",
        "20023",
        "11407",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "5024",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا مسدد، وسليمان بن داود، قالا حدثنا حماد، حدثنا أيوب، عن عكرمة، عن ابن عباس، أن النبي صلى الله عليه وسلم قال ‏\"‏ من صور صورة عذبه الله بها يوم القيامة حتى ينفخ فيها وليس بنافخ ومن تحلم كلف أن يعقد شعيرة ومن استمع إلى حديث قوم يفرون به منه صب في أذنه الآنك يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " Ibn ‘Abbas reported the Prophet (May peace be upon him) as saying :                      If anyone makes a representation of anything, Allah will punish him on the day of Resurrection for it until he breathes into it, but he will bw unable to do so. If anyone pretends to have had a dream which he did not see, he will gives the task of joining barley-seed. If anyone listens to other people’s talk when they try to avoid him, lead will be poured into his ears on the Day of resurrection.",
      "chain": [
        "30175",
        "30584",
        "20022",
        "11015",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "3438",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، حدثنا سليمان بن داود، عن شعبة، عن أبي بشر، عن سعيد بن جبير، ولم يذكر عن ابن عباس، وهشيم، عن أبي بشر، عن سعيد بن جبير، عن ابن عباس ‏:‏ ‏(‏ولا تجهر بصلاتك ‏)‏ قال نزلت بمكة كان رسول الله صلى الله عليه وسلم إذا رفع صوته بالقرآن سبه المشركون ومن أنزله ومن جاء به فأنزل الله ‏:‏ ‏(‏ولا تجهر بصلاتك ‏)‏ فيسبوا القرآن ومن أنزله ومن جاء به ‏:‏ ‏(‏ولا تخافت بها ‏)‏ عن أصحابك بأن تسمعهم حتى يأخذوا عنك القرآن ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Sa'eed bin Jubair:                     from Ibn 'Abbas, regarding: 'And offer your Salat neither aloud nor in a low voice (17:110).\" He said: \"It was revealed in Makkah. When the Messenger of Allah (ﷺ) would raise his voice with the Qur'an, the idolaters would insult him, the One Who revealed it, and the one who came with it. So Allah revealed: And offer your Salat neither aloud so that they would not insult the Qur'an and the One who revealed it, and the one who came with it, nor in a low voice (too low) such that you can let your Companions hear it, and learn it from you.\"",
      "chain": [
        "30553",
        "30584",
        "20020",
        "11419",
        "11050",
        "17",
        "20468",
        "11419",
        "11050"
      ]
    },
    {
      "hadith_no": "3687",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، حدثنا سليمان بن داود، عن شعبة، عن أبي بشر، عن سعيد بن جبير، عن ابن عباس، رضى الله عنهما قال كان عمر يسألني مع أصحاب النبي صلى الله عليه وسلم فقال له عبد الرحمن بن عوف أتسأله ولنا بنون مثله فقال له عمر إنه من حيث تعلم فسأله عن هذه الآية ‏:‏ ‏(‏ إذا جاء نصر الله والفتح ‏)‏ فقلت إنما هو أجل رسول الله صلى الله عليه وسلم أعلمه إياه وقرأ السورة إلى آخرها فقال له عمر والله ما أعلم منها إلا ما تعلم ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Ibn Abbas said:                     “Umar used to ask me questions in front of the Companions of the Prophet. So Abdur-Rahman bin Awf said to him: ‘Why do you ask him, while we have children like him?’” He said: “Umar said to him: ‘It is because of what you know (about him).’ So he asked him about this Ayah: ‘When there comes the help of Allah and the Conquest.’ I said: “It is only regarding the (end of the) life span of the Messenger of Allah, informing him of it.” Then he recited the Surat until its end. So Umar said to him: “By Allah! I know not about it, but what you know.”",
      "chain": [
        "30553",
        "30584",
        "20020",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "3423",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا الحسن بن علي الخلال، حدثنا سليمان بن داود الهاشمي، حدثنا عبد الرحمن بن أبي الزناد، عن موسى بن عقبة، عن عبد الله بن الفضل، عن عبد الرحمن الأعرج، عن عبيد الله بن أبي رافع، عن علي بن أبي طالب، عن رسول الله صلى الله عليه وسلم أنه كان إذا قام إلى الصلاة المكتوبة رفع يديه حذو منكبيه ويصنع ذلك أيضا إذا قضى قراءته وأراد أن يركع ويصنعها إذا رفع رأسه من الركوع ولا يرفع يديه في شيء من صلاته وهو قاعد وإذا قام من سجدتين رفع يديه كذلك فكبر ويقول حين يفتتح الصلاة بعد التكبير ‏\"‏ وجهت وجهي للذي فطر السموات والأرض حنيفا وما أنا من المشركين إن صلاتي ونسكي ومحياى ومماتي لله رب العالمين لا شريك له وبذلك أمرت وأنا من المسلمين اللهم أنت الملك لا إله إلا أنت سبحانك أنت ربي وأنا عبدك ظلمت نفسي واعترفت بذنبي فاغفر لي ذنوبي جميعا إنه لا يغفر الذنوب إلا أنت واهدني لأحسن الأخلاق لا يهدي لأحسنها إلا أنت واصرف عني سيئها لا يصرف عني سيئها إلا أنت لبيك وسعديك وأنا بك وإليك ولا منجا منك ولا ملجأ إلا إليك أستغفرك وأتوب إليك ‏\"‏ ‏.‏ ثم يقرأ فإذا ركع كان كلامه في ركوعه أن يقول ‏\"‏ اللهم لك ركعت وبك آمنت ولك أسلمت وأنت ربي خشع سمعي وبصري ومخي وعظمي لله رب العالمين ‏\"‏ ‏.‏ فإذا رفع رأسه من الركوع قال ‏\"‏ سمع الله لمن حمده ‏\"‏ ‏.‏ ثم يتبعها ‏\"‏ اللهم ربنا ولك الحمد ملء السموات والأرض وملء ما شئت من شيء بعد ‏\"‏ ‏.‏ وإذا سجد قال في سجوده ‏\"‏ اللهم لك سجدت وبك آمنت ولك أسلمت وأنت ربي سجد وجهي للذي خلقه وشق سمعه وبصره تبارك الله أحسن الخالقين ‏\"‏ ‏.‏ ويقول عند انصرافه من الصلاة ‏\"‏ اللهم اغفر لي ما قدمت وما أخرت وما أسررت وما أعلنت أنت إلهي لا إله إلا أنت ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح ‏.‏ والعمل على هذا عند الشافعي وبعض أصحابنا ‏.‏ قال أبو عيسى وأحمد لا يراه وقال بعض أهل العلم من أهل الكوفة وغيرهم يقول هذا في صلاة التطوع ولا يقوله في المكتوبة ‏.‏ سمعت أبا إسماعيل الترمذي محمد بن إسماعيل بن يوسف يقول سمعت سليمان بن داود الهاشمي يقول وذكر هذا الحديث فقال هذا عندنا مثل حديث الزهري عن سالم عن أبيه ‏.‏",
      "text_en": " Ali bin Abi Talib narrated that :                     when the Messenger of Allah would stand for the obligatory prayer, he would raise his hands to the level of his shoulder, and he would do this [also] when he finished his recitation and intended to bow, and he would do it when he raised his head from Ruku, and he would not raise his hands in any of his prayers while he was seated. When he would rise from the two prostrations, he would likewise raise his hands, and say the Takbir, and when he opened his Salat after the Takbir, he would say: “I have directed my face towards the One who has created the heavens and the earth, as a Hanif, and I am not of the idolaters. Indeed, my Salat, my sacrifice, my living, my dying, is for Allah, the Lord of all that exists, without partner, and with this have I been ordered and I am of the Muslims. O Allah, You are the King, there is none worthy of worship except You. Glorified are You, You are My Lord, and I am Your slave, I have wronged myself and I admit to my sin, so forgive me all my sins, verily, there is none who forgives sins but You, and guide me to the best of manners, none guides to the best of them except You, and turn away from me the evil of them, none can turn away from me the evil of them, none turns away from me the evil of them except You, I am here in Your obedience and aiding Your cause, and I am reliant upon You and ever-turning towards You, [and] there is no refuge from You nor hiding place from You except (going) to You, I seek Your forgiveness, and I repent to you (Wajjahtu Wajhi Lilladhi Fataras-Samawati Wal-Arda Hanifan Wa Ma Ana Min Al-Mushrikin, Inna Salati Wa Nusuki Wa Mahyaya Wa Mamati Lillahi Rabbil-Alamin, La Sharika Lahu Wa Bidhalika Umirtu Wa Ana Min Al-Muslimin. Allahumma Antal-Maliku La Ilaha Illa Anta Subhanaka, Anta Rabbi, Wa Ana Abduka Zalamtu Nafsi Wa’taraftu Bidhanbi Faghfirli Dhanbi Jami’an, Innahu La Yaghfir udh-Dhunuba Illa Ant. Wahdini Li-Ahsanil-Akhlaqi La Yahdi Li-Ahsaniha Illa Ant. Wasrif Anni Sayyi’aha Illa Ant. Labaika Wa Sa’daika Wa Ana Bika Wa Ilaika, [Wa] La Manja Minka Wa La Milja Illa Ilaik, Astaghfiruka Wa Atubu Ilaik).” Then he would recite, then when he would bow, his speech in his Ruku, would be to say: “O Allah, to You have I bowed, and in You have I believed, and to You have I submitted (in Islam), and You are my Lord. My hearing, my sight, my brain and my bones are humbled to Allah, the Lord of the Worlds all that exists (Allahumma Laka Raka’tu Wa Bika Amantu Wa Laka Aslamtu Wa Anta Rabbi, Khasha’a Sam’I Wa Basari Wa Mukhkhi Wa Azmi Lillahi, Rabbil-Alamin).” Then, when he raised his head from Ruku he would say: “Allah hears the one who praises him (Sami Allahu Liman Hamidah).” Then he would follow it with: “O Allah, our Lord, to You is praise filling the heavens and the earth and filling whatever You wish of things afterward (Allahumma Rabban Lakal-Hamdu Mil’as-Samawati Wal-Ardi Wa Mil’a Ma Shi’ta Min Shai’in Ba’d).” Then, when he would prostrated he would say in his prostration: “O Allah, to You have I prostrated, and in You have I believed, and to You have I submitted (in Islam), and You are my Lord, my face has prostrated to the One that created it, and grated its hearing and sight, Blessed is Allah, the Best of Creators (Allahumma Laka Sajadtu Wa Bika Amantu Wa Laka Aslamtu, Wa Anta Rabbi, Sajada WAjhi Lilladhi Khalaqahu Wa Shaqqa Sam’ahu Wa Basarahu, Tabarak Allahu Ahsanul-Khaliqin).” When he was finished with his Salat, we would say: “O Allah, forgive me what I have done, before and after, and what I have hidden, and what I have done openly, and You are my Deity, there is none worthy of worship except You (Allahummaghfirli Ma Qaddamtu Wa Ma Akhkhartu Wa Ma Asrartu Wa Ma A’lantu, Wa Anta Ilahi, La Ilaha Illa Ant).”",
      "chain": [
        "30115",
        "30584",
        "20509",
        "11106",
        "11187",
        "11197",
        "11199",
        "5"
      ]
    },
    {
      "hadith_no": "4281",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا أحمد بن الحسن، حدثنا سليمان بن داود الهاشمي، حدثنا إبراهيم بن سعد، حدثني صالح بن كيسان، عن الزهري، عن محمد بن أبي سفيان، عن يوسف بن الحكم، عن محمد بن سعد، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من يرد هوان قريش أهانه الله ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب من هذا الوجه ‏.‏",
      "text_en": " Narrated Sa'd:                     that the Messenger of Allah (ﷺ) said: \"Whoever wishes to humiliate the Quraish then Allah will humiliate him.\"",
      "chain": [
        "30292",
        "30584",
        "20150",
        "11176",
        "11013",
        "30008"
      ]
    },
    {
      "hadith_no": "79",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا سليمان بن داود، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن وهب، عن مالك، ويونس، وعمرو بن الحارث، أن ابن شهاب، أخبرهم عن عباد بن زياد، عن عروة بن المغيرة، أنه سمع أباه، يقول سكبت على رسول الله صلى الله عليه وسلم حين توضأ في غزوة تبوك فمسح على الخفين ‏.‏ قال أبو عبد الرحمن لم يذكر مالك عروة بن المغيرة ‏.‏",
      "text_en": " It was narrated from 'Urwah bin Al-Mughirah that he heard his father say:                      \"I poured water for the Messenger of Allah (ﷺ) when he performed Wudu' during the battle of Tabuk, and he wiped over his Khuff.\"",
      "chain": [
        "30584",
        "36017",
        "20029",
        "20001",
        "20475",
        "20377",
        "11013",
        "10927",
        "11373",
        "166"
      ]
    },
    {
      "hadith_no": "121",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا سليمان بن داود، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن وهب، عن عمرو بن الحارث، عن أبي النضر، عن أبي سلمة بن عبد الرحمن، عن عبد الله بن عمر، عن سعد بن أبي وقاص، عن رسول الله صلى الله عليه وسلم أنه مسح على الخفين ‏.‏",
      "text_en": " It was narrated from Sa'd bin Abi Waqqas that the Messenger of Allah (ﷺ) wiped over the Khuffs.",
      "chain": [
        "30584",
        "36017",
        "20029",
        "20377",
        "11164",
        "10567",
        "18",
        "9"
      ]
    },
    {
      "hadith_no": "222",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا سليمان بن داود، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن وهب، عن عمرو بن الحارث، عن بكير، أن أبا السائب، أخبره أنه، سمع أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يغتسل أحدكم في الماء الدائم وهو جنب ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah said:                      \"The Messenger of Allah (ﷺ) said: 'None of you should perform Ghusl in standing water when he is Junub.'\"",
      "chain": [
        "30584",
        "36017",
        "20029",
        "20377",
        "11154",
        "13"
      ]
    },
    {
      "hadith_no": "396",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Ghusl and Tayammum - كتاب الغسل والتيمم",
      "chapter_no": "4",
      "text_ar": "أخبرنا سليمان بن داود، والحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن وهب، عن عمرو بن الحارث، عن بكير، أن أبا السائب، حدثه أنه، سمع أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏‏\"‏‏ لا يغتسل أحدكم في الماء الدائم وهو جنب ‏‏\"‏‏ ‏‏.‏‏",
      "text_en": " Abu Hurairah said:                      \"The Messenger of Allah (ﷺ) said: 'None of you should perform ghusl in standing water while he is Junub.'\"",
      "chain": [
        "30584",
        "36017",
        "20029",
        "20377",
        "11154",
        "13"
      ]
    },
    {
      "hadith_no": "452",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Salah - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "أخبرنا سليمان بن داود، عن ابن وهب، قال أخبرني عمرو بن الحارث، أن عبد ربه بن سعيد، حدثه أن البناني حدثه عن أنس بن مالك، أن الصلوات، فرضت بمكة وأن ملكين أتيا رسول الله صلى الله عليه وسلم فذهبا به إلى زمزم فشقا بطنه وأخرجا حشوه في طست من ذهب فغسلاه بماء زمزم ثم كبسا جوفه حكمة وعلما ‏.‏",
      "text_en": " It was narrated from Anas bin Malik that the prayers were enjoined in Makkah, and that two angels came to the Messenger of Allah (ﷺ) and took him to Zamzam, where they split open his stomach and took out his innards in a basin of gold, and washed them with Zamzam water, then they filled his heart with wisdom and knowledge.",
      "chain": [
        "30584",
        "20029",
        "20377",
        "11191",
        "19"
      ]
    },
    {
      "hadith_no": "713",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Masjids - كتاب المساجد",
      "chapter_no": "8",
      "text_ar": "أخبرنا سليمان بن داود، عن ابن وهب، قال أخبرني يونس، عن ابن شهاب، عن عبيد الله بن عبد الله، عن عبد الله بن عباس، أن رسول الله صلى الله عليه وسلم طاف في حجة الوداع على بعير يستلم الركن بمحجن ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin 'Abbas that the Messenger of Allah (ﷺ) performed Tawaf during the Farewell Pilgrimage atop a camel, touching the Rukn [1] with a stick that was bent at the top.[1] The corner of the Ka'bah in which the Black Stone is situated.",
      "chain": [
        "30584",
        "20029",
        "20475",
        "11013",
        "11004",
        "17"
      ]
    },
    {
      "hadith_no": "731",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Masjids - كتاب المساجد",
      "chapter_no": "8",
      "text_ar": "أخبرنا سليمان بن داود، قال حدثنا ابن وهب، عن يونس، قال ابن شهاب وأخبرني عبد الرحمن بن كعب بن مالك، أن عبد الله بن كعب، قال سمعت كعب بن مالك، يحدث حديثه حين تخلف عن رسول الله صلى الله عليه وسلم في غزوة تبوك قال وصبح رسول الله صلى الله عليه وسلم قادما وكان إذا قدم من سفر بدأ بالمسجد فركع فيه ركعتين ثم جلس للناس فلما فعل ذلك جاءه المخلفون فطفقوا يعتذرون إليه ويحلفون له وكانوا بضعا وثمانين رجلا فقبل رسول الله صلى الله عليه وسلم علانيتهم وبايعهم واستغفر لهم ووكل سرائرهم إلى الله عز وجل حتى جئت فلما سلمت تبسم تبسم المغضب ثم قال ‏\"‏ تعال ‏\"‏ ‏.‏ فجئت حتى جلست بين يديه فقال لي ‏\"‏ ما خلفك ألم تكن ابتعت ظهرك ‏\"‏ ‏.‏ فقلت يا رسول الله إني والله لو جلست عند غيرك من أهل الدنيا لرأيت أني سأخرج من سخطه ولقد أعطيت جدلا ولكن والله لقد علمت لئن حدثتك اليوم حديث كذب لترضى به عني ليوشك أن الله عز وجل يسخطك على ولئن حدثتك حديث صدق تجد على فيه إني لأرجو فيه عفو الله والله ما كنت قط أقوى ولا أيسر مني حين تخلفت عنك ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أما هذا فقد صدق فقم حتى يقضي الله فيك ‏\"‏ ‏.‏ فقمت فمضيت ‏.‏ مختصر ‏.‏",
      "text_en": " 'Abdullah bin Ka'b said:                      \"I heard Ka'b bin Malik telling the story of when he stayed behind from going out on the campaign of Tabuk with the Messenger of Allah (ﷺ). He said: 'The Messenger of Allah (ﷺ) came back in the morning, and when he came back from a journey he would go to the Masjid first and pray two Rak'ahs there, then he would sit to (meet with) the people. When he did that, those who had stayed behind came to him and started giving their excuses, swearing by Allah. There were eighty-odd men, and the Messenger of Allah (ﷺ) accepted what they declared and accepted their oaths of allegiance; he prayed for forgiveness for them and left whatever was in their hearts to Allah. Then when I came and greeted him, he smiled as one who is angry, then he said: 'Come here.' So I came and sat in front of him, [1] and he said: 'What kept you behind? Did you not buy a mount?' I said: 'O Messenger of Allah, if I were to sit before anyone other than you of those who hold high positions in this world, I would find a way to avoid his anger. I am an eloquent man but, by Allah, I know that if I were to tell you a lie today to make you pleased with me, Allah would soon make you angry with me, but if I tell you the truth, it will make you angry with me, but I will still have the hope that Allah may forgive me. I have never been in a better position, physically or financially, than the time when I stayed behind and did not join you.' The Messenger of Allah (ﷺ) said: 'This man has spoken the truth. Go away until Allah decides concerning you.' So I got up and went away.\" This is an abridged version of narration.[1] It is this which the author cited the narration for. While the absence of the mention of a thing - in this case prayer - is not a proof that it does not exist.",
      "chain": [
        "30584",
        "20029",
        "20475",
        "11013",
        "1134",
        "1131",
        "390"
      ]
    },
    {
      "hadith_no": "856",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا سليمان بن داود، عن ابن وهب، قال أخبرني عمرو بن الحارث، أن الحكيم بن عبد الله القرشي، حدثه أن نافع بن جبير وعبد الله بن أبي سلمة حدثاه أن معاذ بن عبد الرحمن حدثهما عن حمران، مولى عثمان بن عفان عن عثمان بن عفان، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من توضأ للصلاة فأسبغ الوضوء ثم مشى إلى الصلاة المكتوبة فصلاها مع الناس أو مع الجماعة أو في المسجد غفر الله له ذنوبه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Uthman bin 'Affan said:                      \"I heard the Messenger of Allah (ﷺ) say: 'Whoever does wudu' properly, then walks to (attend) the prescribed prayer, and prays with the people or with the congregation or in the Masjid, Allah will forgive him his sins.\"",
      "chain": [
        "30584",
        "20029",
        "20377",
        "11059",
        "11421",
        "4"
      ]
    },
    {
      "hadith_no": "993",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا سليمان بن داود، عن ابن وهب، قال حدثنا عمرو بن الحارث، عن سعيد بن أبي هلال، أن أبا الرجال، محمد بن عبد الرحمن حدثه عن أمه، عمرة عن عائشة، أن رسول الله صلى الله عليه وسلم بعث رجلا على سرية فكان يقرأ لأصحابه في صلاتهم فيختم ب ‏{‏ قل هو الله أحد ‏}‏ فلما رجعوا ذكروا ذلك لرسول الله صلى الله عليه وسلم فقال ‏\"‏ سلوه لأى شىء فعل ذلك ‏\"‏ ‏.‏ فسألوه فقال لأنها صفة الرحمن عز وجل فأنا أحب أن أقرأ بها ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ أخبروه أن الله عز وجل يحبه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Aishah that:                     The Messenger of Allah (ﷺ) sent a man on a campaign, and he used to recite to his companions when leading them in prayer, and would conclude with 'Say: He is Allah, (the) One.' When they returned, they told the Messenger of Allah (ﷺ) about that. He said: \"Ask them why he did that.\" So they asked him and he said: \"Because it is a description of the Most Merciful, the Mighty and Sublime, and I love to recite it.\" The Messenger of Allah (ﷺ) said: \"Tell him that Allah (SWT), the Mighty and Sublime, loves him.\"",
      "chain": [
        "30584",
        "20029",
        "20377",
        "11169",
        "10959",
        "53"
      ]
    },
    {
      "hadith_no": "1019",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا سليمان بن داود، عن ابن وهب، قال أخبرني عمرو بن الحارث، أن ابن شهاب، أخبره أن أبا سلمة أخبره أن أبا هريرة حدثه أن رسول الله صلى الله عليه وسلم سمع قراءة أبي موسى فقال ‏\"‏ لقد أوتي مزمارا من مزامير آل داود عليه السلام ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah narrated that:                     The Messenger of Allah (ﷺ) heard the recitation of Abu Musa and said: He has been given a Mizmar among the Mazamir of the family of Dawud, peace be upon him.\"",
      "chain": [
        "30584",
        "20029",
        "20377",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1203",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا محمد بن رافع، قال حدثنا سليمان بن داود أبو داود، قال حدثنا هشام، - وهو ابن أبي عبد الله - عن معمر، عن يحيى، عن ضمضم، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم أمر بقتل الأسودين في الصلاة ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     The Messenger of Allah (ﷺ) enjoined killing the two black ones (snakes and scorpions) while praying.",
      "chain": [
        "30375",
        "30584",
        "20115",
        "11449",
        "13"
      ]
    },
    {
      "hadith_no": "1316",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا محمد بن إسماعيل بن إبراهيم، قال حدثنا سليمان، - يعني ابن داود الهاشمي - قال حدثنا إبراهيم، - وهو ابن سعد - قال حدثني عبد الله بن جعفر، - وهو ابن المسور المخرمي - عن إسماعيل بن محمد، قال حدثني عامر بن سعد، عن أبيه، أن رسول الله صلى الله عليه وسلم كان يسلم عن يمينه وعن يساره ‏.‏",
      "text_en": " 'Amr bin Sa'd narrated from his father:                     That the Messenger of Allah (ﷺ) used to say the taslim to his right and to his left.",
      "chain": [
        "34188",
        "30584",
        "20150",
        "10554",
        "9"
      ]
    },
    {
      "hadith_no": "1328",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا سليمان بن داود بن حماد بن سعد، عن ابن وهب، قال أخبرني ابن أبي ذئب، وعمرو بن الحارث، ويونس بن يزيد، أن ابن شهاب، أخبرهم عن عروة، قال قالت عائشة كان رسول الله صلى الله عليه وسلم يصلي فيما بين أن يفرغ من صلاة العشاء إلى الفجر إحدى عشرة ركعة ويوتر بواحدة ويسجد سجدة قدر ما يقرأ أحدكم خمسين آية قبل أن يرفع رأسه ‏.‏ وبعضهم يزيد على بعض في الحديث ‏.‏ مختصر ‏.‏",
      "text_en": " It was narrated from 'Urwah (that) Aishah said:                     \"The Messenger of Allah (ﷺ) used to pray eleven rak'ahs, making it odd (witr) by one between the time when he finished 'Isha and dawn, and he would prostrate for as long as it takes one of you to recite fifty verses before raising his head.\"",
      "chain": [
        "30584",
        "20029",
        "20177",
        "20377",
        "20475",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1560",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Prayer for the Two 'Eids - كتاب صلاة العيدين",
      "chapter_no": "19",
      "text_ar": "أخبرنا سليمان بن داود، عن ابن وهب، قال أخبرني يونس بن يزيد، وعمرو بن الحارث، عن ابن شهاب، عن سالم، عن أبيه، قال وجد عمر بن الخطاب - رضى الله تعالى عنه - حلة من إستبرق بالسوق فأخذها فأتى بها رسول الله صلى الله عليه وسلم فقال يا رسول الله ابتع هذه فتجمل بها للعيد والوفد ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إنما هذه لباس من لا خلاق له أو إنما يلبس هذه من لا خلاق له ‏\"‏ ‏.‏ فلبث عمر ما شاء الله ثم أرسل إليه رسول الله صلى الله عليه وسلم بجبة ديباج فأقبل بها حتى جاء رسول الله صلى الله عليه وسلم فقال يا رسول الله قلت ‏\"‏ إنما هذه لباس من لا خلاق له ‏\"‏ ‏.‏ ثم أرسلت إلى بهذه ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ بعها وتصب بها حاجتك ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Salim that:                     His father said: \"Umar bin A-Khattab, may Allah be pleased with him, found a Hullah of Istibraq in the market. He took it and brought it to the Messenger of Allah (ﷺ) and said: 'O Messenger of Allah (ﷺ), why don't you buy this and adorn yourself with it for the two 'Eids and when (meeting) the delegations?' The Messenger of Allah (ﷺ) said: 'This is the clothing of one who has no share in the Hereafter,' or: 'This is worn by one who has no share in the Hereafter.' Then as much time passed as Allah (SWT) willed, then the Messenger of Allah (ﷺ) sent to Umar a garment made of Dibaj. He brought it to the Messenger of Allah (ﷺ) and said: 'O Messenger of Allah, you said that this is the clothing of one who has no share in the Hereafter, then you sent this to me?' The Messenger of Allah (ﷺ) said: 'Sell it and use the money for whatever you need.'\"",
      "chain": [
        "30584",
        "20029",
        "20475",
        "20377",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "2030",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا سليمان بن داود، قال أنبأنا ابن وهب، قال أخبرني عمرو بن الحارث، أن ثمامة بن شفى، حدثه قال ‏:‏ كنا مع فضالة بن عبيد بأرض الروم فتوفي صاحب لنا، فأمر فضالة بقبره فسوي، ثم قال ‏:‏ سمعت رسول الله صلى الله عليه وسلم يأمر بتسويتها ‏.‏",
      "text_en": " Thumamah bin Shufa narrated:                     \"We were with Fadalah bin 'Ubaid in the land of the Romans, and a companion of ours died. Fadalah ordered that his grave be made level, then he said: 'I heard the Messenger of Allah commanding that it be made level.\"'",
      "chain": [
        "30584",
        "20029",
        "20377"
      ]
    },
    {
      "hadith_no": "2062",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا سليمان بن داود، عن ابن وهب، قال أخبرني يونس، عن ابن شهاب، أخبرني عروة بن الزبير، أنه سمع أسماء بنت أبي بكر، تقول قام رسول الله صلى الله عليه وسلم فذكر الفتنة التي يفتن بها المرء في قبره فلما ذكر ذلك ضج المسلمون ضجة حالت بيني وبين أن أفهم كلام رسول الله صلى الله عليه وسلم فلما سكنت ضجتهم قلت لرجل قريب مني أى بارك الله لك ماذا قال رسول الله صلى الله عليه وسلم في آخر قوله قال ‏\"‏ قد أوحي إلى أنكم تفتنون في القبور قريبا من فتنة الدجال ‏\"‏ ‏.‏",
      "text_en": " 'Urwah bin Az-Zubair (narrated) that he heard Asma' bint Abi Bakr say:                     \"The Messenger of Allah stood up and mentioned the trail with which a person will be tested in his grave. When he mentioned that the people became restless, which prevented me from understanding what the Messenger of Allah had said. When they settled down, I said to a man who was near me: 'May Allah bless you, what did the end?' he said: 'It has been revealed to me that you will be tested in your graves with a trial close to that of the Dajjal.\"'",
      "chain": [
        "30584",
        "20029",
        "20475",
        "11013",
        "10511"
      ]
    },
    {
      "hadith_no": "2064",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا سليمان بن داود، عن ابن وهب، قال أخبرني يونس، عن ابن شهاب، قال حدثني عروة، أن عائشة، قالت دخل على رسول الله صلى الله عليه وسلم وعندي امرأة من اليهود وهي تقول إنكم تفتنون في القبور ‏.‏ فارتاع رسول الله صلى الله عليه وسلم وقال ‏\"‏ إنما تفتن يهود ‏\"‏ ‏.‏ وقالت عائشة فلبثنا ليالي ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ إنه أوحي إلى أنكم تفتنون في القبور ‏\"‏ ‏.‏ قالت عائشة فسمعت رسول الله صلى الله عليه وسلم بعد يستعيذ من عذاب القبر ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"The Messenger of Allah came to me and there was a Jewish woman with me who was saying: 'You will be tested in your graves.' The Messenger of Allah got upset and said: 'Rather the Jews will be tested.\"' 'Aishah said: \"A few nights later, the Messenger of Allah said: 'It has been revealed to me that you will be tested in your graves.\"' 'Aishah said; \"Afterward I heard the Messenger of Allah seeking refuge with Allah from the torment of the grave.",
      "chain": [
        "30584",
        "20029",
        "20475",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2095",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا سليمان بن داود، عن ابن وهب، قال أخبرني يونس، عن ابن شهاب، عن عبيد الله بن عبد الله بن عتبة، أن عبد الله بن عباس، كان يقول كان رسول الله صلى الله عليه وسلم أجود الناس وكان أجود ما يكون في رمضان حين يلقاه جبريل وكان جبريل يلقاه في كل ليلة من شهر رمضان فيدارسه القرآن ‏.‏ قال كان رسول الله صلى الله عليه وسلم حين يلقاه جبريل عليه السلام أجود بالخير من الريح المرسلة ‏.‏",
      "text_en": " It was narrated from 'Ubaidullah bin 'Abdulah bin 'Utabah that 'Abdullah bin 'Abbas used to say:                     \"The Messenger of Allah was the most generous of people, and he was most generous in Ramadan when Jibril me him. Jibril use to meet him every night during the month of Ramadan and study Quran with him.\" And he said: 'When Jibril met him, the Messenger of Allah was more generous in doing good than the blowing wind'",
      "chain": [
        "30584",
        "20029",
        "20475",
        "11013",
        "11004",
        "17"
      ]
    },
    {
      "hadith_no": "2119",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن يحيى بن عبد الله النيسابوري، قال حدثنا سليمان بن داود، قال حدثنا إبراهيم، عن محمد بن مسلم، عن سعيد بن المسيب، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا رأيتم الهلال فصوموا وإذا رأيتموه فأفطروا فإن غم عليكم فصوموا ثلاثين يوما ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of allah sadi:                     \"When you see the crescent then fast, and when you crescent then fast, and when you see it, stop fasting. If it is obscured from you (too cloudy), then fast thirty days.\"",
      "chain": [
        "11222",
        "30584",
        "20150",
        "167",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "2214",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا سليمان بن داود، عن ابن وهب، قال أخبرني عمرو، أن المنذر بن عبيد، حدثه عن أبي صالح السمان، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ الصيام لي وأنا أجزي به والصائم يفرح مرتين عند فطره ويوم يلقى الله وخلوف فم الصائم أطيب عند الله من ريح المسك ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah said:                     \"(Allah says) fasting is for me and I shall reward for it. The fasting person rejoices twice: when he breaks his fast and the day when he meets his Lord. And the smell that come from the mouth of the fasting person is better before Allah than the fragrance of musk.\" '",
      "chain": [
        "30584",
        "20029",
        "20377",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "2649",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا سليمان بن داود بن حماد بن سعد ابن أخي، رشدين بن سعد أبو الربيع والحارث بن مسكين قراءة عليه وأنا أسمع، عن ابن وهب، قال أخبرني مالك بن أنس، عن إبراهيم بن عقبة، عن كريب، عن ابن عباس، أن رسول الله صلى الله عليه وسلم مر بامرأة وهي في خدرها معها صبي فقالت ألهذا حج قال ‏\"‏ نعم ولك أجر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that:                     the Messenger of Allah passed by a woman when she was in her seclusion and had a child with her. She said: \"Is there Hajj for this one?'' He said: \"Yes, and you will be rewarded.''(sahih)",
      "chain": [
        "30584",
        "20029",
        "20001",
        "11125",
        "11211",
        "17"
      ]
    },
    {
      "hadith_no": "2942",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا أحمد بن عمرو، وسليمان بن داود، عن ابن وهب، قال أخبرني يونس، عن ابن شهاب، عن سالم، عن أبيه، قال كان رسول الله صلى الله عليه وسلم حين يقدم مكة يستلم الركن الأسود أول ما يطوف يخب ثلاثة أطواف من السبع ‏.‏",
      "text_en": " It was narrated from Salim that his father said:                     \"When the Messenger of Allah came to Makkah, he touched the Black Stone and at the beginning of his Tawaf, he walked rapidly in (the first) three of the seven rounds.\"",
      "chain": [
        "30584",
        "20029",
        "20475",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "2954",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا يونس بن عبد الأعلى، وسليمان بن داود، عن ابن وهب، قال أخبرني يونس، عن ابن شهاب، عن عبيد الله بن عبد الله، عن عبد الله بن عباس، أن رسول الله صلى الله عليه وسلم طاف في حجة الوداع على بعير يستلم الركن بمحجن ‏.‏",
      "text_en": " It was narrated from Abdullah bin Abbas that:                     the Messenger of Allah circumambulated (the Kabah) during the Farewell Pilgrimage on a camel, touching the Corner with a crook-ended stick.",
      "chain": [
        "30493",
        "30584",
        "20029",
        "20475",
        "11013",
        "11004",
        "17"
      ]
    },
    {
      "hadith_no": "3180",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا سليمان بن داود، والحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن وهب، قال أخبرني عمرو بن الحارث، عن بكير بن الأشج، عن بسر بن سعيد، عن زيد بن خالد، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ من جهز غازيا في سبيل الله فقد غزا ومن خلفه في أهله بخير فقد غزا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Zaid bin Khalid that the Messenger of Allah (ﷺ) said:                      \"Whoever equips a warrior in the cause of Allah has fought, and whoever looks after his family in his absence has fought.\"",
      "chain": [
        "30584",
        "36017",
        "20029",
        "20377",
        "11154",
        "11153",
        "3625"
      ]
    },
    {
      "hadith_no": "3346",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا يونس بن عبد الأعلى، وسليمان بن داود، عن ابن وهب، أخبرني يونس، عن ابن شهاب، قال أخبرني عروة بن الزبير، أنه سأل عائشة عن قول الله، عز وجل ‏{‏ وإن خفتم أن لا تقسطوا في اليتامى فانكحوا ما طاب لكم من النساء ‏}‏ قالت يا ابن أختي هي اليتيمة تكون في حجر وليها فتشاركه في ماله فيعجبه مالها وجمالها فيريد وليها أن يتزوجها بغير أن يقسط في صداقها فيعطيها مثل ما يعطيها غيره فنهوا أن ينكحوهن إلا أن يقسطوا لهن ويبلغوا بهن أعلى سنتهن من الصداق فأمروا أن ينكحوا ما طاب لهم من النساء سواهن قال عروة قالت عائشة ثم إن الناس استفتوا رسول الله صلى الله عليه وسلم بعد فيهن فأنزل الله عز وجل ‏{‏ ويستفتونك في النساء قل الله يفتيكم فيهن ‏}‏ إلى قوله ‏{‏ وترغبون أن تنكحوهن ‏}‏ قالت عائشة والذي ذكر الله تعالى أنه يتلى في الكتاب الآية الأولى التي فيها ‏{‏ وإن خفتم أن لا تقسطوا في اليتامى فانكحوا ما طاب لكم من النساء ‏}‏ قالت عائشة وقول الله في الآية الأخرى ‏{‏ وترغبون أن تنكحوهن ‏}‏ رغبة أحدكم عن يتيمته التي تكون في حجره حين تكون قليلة المال والجمال فنهوا أن ينكحوا ما رغبوا فى مالها من يتامى النساء إلا بالقسط من أجل رغبتهم عنهن ‏.‏",
      "text_en": " 'Urwah bin Az-Zubair narrated that he asked 'Aishah about the saying of Allah, the Mighty and Sublime:                      \"And if you fear that you shall not be able to deal justly with the orphan girls then marry (other) women of your choice.\" She said: \"O son of my sister, this refers to a female orphan who is in the care of her guardian, and her wealth is joined to his, and he is attracted to her wealth and her beauty. So her guardian wants to marry her without being fair with regard to her dowry, and without giving her what someone else would give her. So they were forbidden to marry them unless they were fair to them and gave them the highest possible dowry that is customarily given, and they were commanded to marry other women of their choice.\" 'Urwah said: \"'Aishah said: 'Then later on, Allah, the Mighty and Sublime, revealed concerning them: 'They ask your legal instruction concerning women, say: Allah instructs you about them, and about what is recited unto you in the Book concerning the orphan girls whom you give not the prescribed portions and yet whom you desire to marry.' 'Aishah said: 'What Allah, Most High, mentioned here that is recited in the Book is the first Verse in which it says: And if you fear that you shall not be able to deal justly with orphan girls then marry (other) women of your choice.' 'Aishah said: 'What is referred to in the other Verse -and yet whom you desire to marry- is the desire of one of you not to marry orphan girl who is under his care if she is lacking in wealth and beauty. So they were forbidden to marry those orphan women to whose wealth they were attracted unless they were fair, because of their desire not to marry (those who were lacking in wealth and beauty.)'\"",
      "chain": [
        "30493",
        "30584",
        "20029",
        "20475",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "3401",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا سليمان بن داود، عن ابن وهب، قال أخبرني مخرمة، عن أبيه، قال سمعت محمود بن لبيد، قال أخبر رسول الله صلى الله عليه وسلم عن رجل، طلق امرأته ثلاث تطليقات جميعا فقام غضبانا ثم قال ‏\"‏ أيلعب بكتاب الله وأنا بين أظهركم ‏\"‏ ‏.‏ حتى قام رجل وقال يا رسول الله ألا أقتله ‏.‏",
      "text_en": " Makhramah narrated that his father said:                      \"I heard Mahmud bin Labid say: 'The Messenger of Allah was told about a man who had divorced his wife with three simultaneous divorces. He stood up angrily and said: Is the Book of Allah being toyed with while I am still among you? Then a man stood up and said: 'O Messenger of Allah, shall I kill him?'\"",
      "chain": [
        "30584",
        "20029",
        "1830"
      ]
    },
    {
      "hadith_no": "3646",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Wills - كتاب الوصايا",
      "chapter_no": "30",
      "text_ar": "أخبرنا سليمان بن داود، عن ابن وهب، قال أخبرني يونس، عن ابن شهاب، قال أخبرني سعيد بن المسيب، وأبو سلمة بن عبد الرحمن عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم حين أنزل عليه ‏{‏وأنذر عشيرتك الأقربين‏}‏ قال ‏\"‏ يا معشر قريش اشتروا أنفسكم من الله لا أغني عنكم من الله شيئا يا بني عبد المطلب لا أغني عنكم من الله شيئا يا عباس بن عبد المطلب لا أغني عنك من الله شيئا يا صفية عمة رسول الله صلى الله عليه وسلم لا أغني عنك من الله شيئا يا فاطمة بنت محمد سليني ما شئت لا أغني عنك من الله شيئا ‏\"‏‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                      \"The Messenger of Allah said, when the Verse: 'And warn your tribe (O Muhammad) of near kindred.' was revealed: 'O Quraish! Buy your souls from your Lord; I cannot avail you anything before Allah. O Banu 'Abdul-Muttalib! I cannot avail you anything before Allah. O 'Abbas bin 'Abdul-Muttalib! I cannot avail you anything before Allah. O Safiyyah, paternal aunt of the Messenger of Allah! I cannot avail you anything before Allah. O Fatimah bint Muhammad! Ask me for whatever you want, I cannot avail you anything before Allah.'\"",
      "chain": [
        "30584",
        "20029",
        "20475",
        "11013",
        "11002",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "3824",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا سليمان بن داود، قال أنبأنا ابن وهب، عن يونس، قال قال ابن شهاب فأخبرني عبد الرحمن بن كعب بن مالك، أن عبد الله بن كعب، قال سمعت كعب بن مالك، يحدث حديثه حين تخلف عن رسول الله صلى الله عليه وسلم في غزوة تبوك قال فلما جلست بين يديه قلت يا رسول الله إن من توبتي أن أنخلع من مالي صدقة إلى الله وإلى رسوله ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ أمسك عليك بعض مالك فهو خير لك ‏\"‏ ‏.‏ فقلت فإني أمسك سهمي الذي بخيبر ‏.‏ مختصر ‏.‏",
      "text_en": " 'Abdur-Rahman bin Ka'b bin Malik narrated that 'Abdullah bin Ka'b said:                      \"I heard Ka'b bin Malik narrating his Hadith about when he stayed behind and did not join the Messenger of Allah on the campaign to Tabuk. He said: 'When I sat down before him I said: \"O Messenger of Allah, as part of my repentance I want to give my wealth in charity to Allah and His Messenger.\" The Messenger of Allah said: \"Keep some of your wealth for yourself; that is better for you.\" I said: \"I will keep my share that is in Khaibar.\"'\"",
      "chain": [
        "30584",
        "20029",
        "20475",
        "11013",
        "1134",
        "1131",
        "390"
      ]
    },
    {
      "hadith_no": "3963",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Kind Treatment of Women - كتاب عشرة النساء",
      "chapter_no": "36",
      "text_ar": "أخبرنا سليمان بن داود، قال أنبأنا ابن وهب، قال أخبرني ابن جريج، عن عبد الله بن كثير، أنه سمع محمد بن قيس، يقول سمعت عائشة، تقول ألا أحدثكم عن النبي صلى الله عليه وسلم وعني قلنا بلى ‏.‏ قالت لما كانت ليلتي انقلب فوضع نعليه عند رجليه ووضع رداءه وبسط إزاره على فراشه ولم يلبث إلا ريثما ظن أني قد رقدت ثم انتعل رويدا وأخذ رداءه رويدا ثم فتح الباب رويدا وخرج وأجافه رويدا وجعلت درعي في رأسي فاختمرت وتقنعت إزاري وانطلقت في إثره حتى جاء البقيع فرفع يديه ثلاث مرات وأطال القيام ثم انحرف وانحرفت فأسرع فأسرعت فهرول فهرولت فأحضر فأحضرت وسبقته فدخلت وليس إلا أن اضطجعت فدخل فقال ‏\"‏ ما لك يا عائش رابية ‏\"‏ ‏.‏ قال سليمان حسبته قال حشيا قال ‏\"‏ لتخبرني أو ليخبرني اللطيف الخبير ‏\"‏ ‏.‏ قلت يا رسول الله بأبي أنت وأمي فأخبرته الخبر قال ‏\"‏ أنت السواد الذي رأيت أمامي ‏\"‏ ‏.‏ قلت نعم - قالت - فلهدني لهدة في صدري أوجعتني ‏.‏ قال ‏\"‏ أظننت أن يحيف الله عليك ورسوله ‏\"‏ ‏.‏ قالت مهما يكتم الناس فقد علمه الله عز وجل ‏.‏ قال ‏\"‏ نعم - قال - فإن جبريل عليه السلام أتاني حين رأيت ولم يكن يدخل عليك وقد وضعت ثيابك فناداني فأخفى منك فأجبته وأخفيته منك وظننت أنك قد رقدت فكرهت أن أوقظك وخشيت أن تستوحشي فأمرني أن آتي أهل البقيع فأستغفر لهم ‏\"‏ ‏.‏ خالفه حجاج بن محمد فقال عن ابن جريج عن ابن أبي مليكة عن محمد بن قيس ‏.‏",
      "text_en": " 'Aishah said:                      \"Shall I not tell you about the Prophet and I?\" We said: \"Yes.\" She said: \"When it was my night, he came in, placed his shoes by his feet, lay down his Rida' (upper garment), and spread his Izar (lower garment) on his bed. As soon as he thought that I had gone to sleep, he put his shoes on slowly and picked up his Rida' slowly. Then he opened the door slowly, went out and shut it slowly. I put my garment over my head, covered myself and put on my Izar (lower garment), and I set out after him until he came to Al-Baqi', raised his hands three times and stood there for a long time. Then he left and I left, he hurried and I hurried, he ran and I ran, and I got there before him and entered (the house). I had only just laid down when he came in and said: 'O 'Aishah, why are you out of breath?' (one of the reporters) Sulaiman said: I thought he (Ibn Wahb) said: 'short of breath.' He said: 'Either you tell me or the All-Aware, All-Knowing will tell me.' I said: 'O Messenger of Allah, may my father and mother be sacrificed for you;' and I told him the story. He said: 'You were the black shape I saw in front of me?' I said: 'Yes.'\" She said: \"He gave me a shove in the chest that hurt me and said: 'You thought that Allah and His Messenger would be unfair to you.' She said: 'Whatever people conceal, Allah, the Mighty and Sublime, knows it.' He said: 'Yes.' He said: 'Jibril came to me when you saw (me leave) but he did not enter upon you because you have taken off your garments. So he called me but he concealed himself from you, and I answered him but I concealed it from you. I thought that you had gone to sleep and I did not want to wake you and I was afraid that you would feel lonely. He told me to go to Al-Baqi' and pray for forgiveness for them.'\" Hajjaj bin Muhammad contradicted him (Ibn Wahb), he said: \"From Ibn Juraij, from Ibn Abi Mulaikah, from Muhammad bin Qais.\"",
      "chain": [
        "30584",
        "20029",
        "11070",
        "11252"
      ]
    },
    {
      "hadith_no": "4095",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا محمد بن رافع، ومحمد بن إسماعيل بن إبراهيم، قالا حدثنا سليمان، - يعني ابن داود - الهاشمي قال حدثنا إبراهيم، عن أبيه، عن أبي عبيدة بن محمد بن عمار بن ياسر، عن طلحة بن عبد الله بن عوف، عن سعيد بن زيد، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من قتل دون ماله فهو شهيد ومن قتل دون أهله فهو شهيد ومن قتل دون دينه فهو شهيد ومن قتل دون دمه فهو شهيد ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Sa'eed bin Zaid said:                     \"The Messenger of Allah [SAW] said: 'Whoever is killed protecting his wealth, he is a martyr. Whoever is killed protecting his family, he is a martyr. Whoever is killed protecting his religion, he is a martyr. Whoever is killed protecting himself, he is a martyr.'\"",
      "chain": [
        "30375",
        "34188",
        "30584",
        "11051",
        "19954",
        "11043",
        "11"
      ]
    },
    {
      "hadith_no": "4248",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of al-Fara' and al-'Atirah - كتاب الفرع والعتيرة",
      "chapter_no": "41",
      "text_ar": "أخبرنا سليمان بن داود، عن ابن وهب، قال أخبرني عمرو بن الحارث، والليث بن سعد، عن كثير بن فرقد، أن عبد الله بن مالك بن حذافة، حدثه عن العالية بنت سبيع، أن ميمونة، زوج النبي صلى الله عليه وسلم حدثتها أنه مر برسول الله صلى الله عليه وسلم رجال من قريش يجرون شاة لهم مثل الحصان فقال لهم رسول الله صلى الله عليه وسلم ‏\"‏ لو أخذتم إهابها ‏\"‏ ‏.‏ قالوا إنها ميتة ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ يطهرها الماء والقرظ ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Maimunah, the wife of the Prophet, that:                     some men of Quraish passed by the Messenger of Allah dragging a sheep the size of a donkey. He said to them: \"Why don't you take its skin?\" They said: \"It is dead meat.\" The Messenger of Allah said: \"Purify it with water and Qaraz.\"",
      "chain": [
        "30584",
        "20029",
        "20377",
        "20023",
        "20170",
        "13530"
      ]
    },
    {
      "hadith_no": "4335",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا سليمان بن داود، قال حدثنا عبد الله بن وهب، قال أخبرني يونس، ومالك، وأسامة، عن ابن شهاب، عن الحسن، وعبد الله، ابنى محمد عن أبيهما، عن علي بن أبي طالب، رضى الله عنه قال نهى رسول الله صلى الله عليه وسلم عن متعة النساء يوم خيبر وعن لحوم الحمر الإنسية ‏.‏",
      "text_en": " It was narrated from Al-Hasan bin Muhammad, and 'Abdullah bin Muhammad, from their father, that 'Ali bin Abi Talib may Allah be please with him, said:                     \"The Messenger of Allah forbade Mut'ah and the flesh of domesticated donkeys on the Day of Khaibar.\"",
      "chain": [
        "30584",
        "20029",
        "20475",
        "20001",
        "50",
        "11013",
        "11016",
        "30351",
        "5"
      ]
    },
    {
      "hadith_no": "4371",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا سليمان بن داود، عن ابن وهب، قال أخبرني عمرو بن الحارث، والليث بن سعد، وذكر، آخر وقدمه أن سليمان بن عبد الرحمن، حدثهم عن عبيد بن فيروز، عن البراء بن عازب، قال سمعت رسول الله صلى الله عليه وسلم وأشار بأصابعه وأصابعي أقصر من أصابع رسول الله صلى الله عليه وسلم يشير بأصبعه يقول ‏\"‏ لا يجوز من الضحايا العوراء البين عورها والعرجاء البين عرجها والمريضة البين مرضها والعجفاء التي لا تنقي ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Ubaid bin Fairuz thatAl;-Bara bnin 'Azib said:                      \"I heard the Messenger of Allah say\" - and he gestured with his fingers, but his fingers were shorter than the fingers of the Messenger of Allah - he said \"It is not permissible to offer as a sacrifice an animal that clearly has one bad eye, a lame animal that is obviously lame, as sick animal that is obviously sick, or an animals that is so emaciated that it is as if there is no marrow in its bones.\"",
      "chain": [
        "30584",
        "20029",
        "20377",
        "20023",
        "19876",
        "400"
      ]
    },
    {
      "hadith_no": "4382",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا سليمان بن داود، عن ابن وهب، قال أخبرني عمرو، عن بكير بن الأشج، عن معاذ بن عبد الله بن خبيب، عن عقبة بن عامر، قال ضحينا مع رسول الله صلى الله عليه وسلم بجذع من الضأن ‏.‏",
      "text_en": " it was narrated that 'Uqbah bin 'Amir said:                     'We sacrificed a Jadh'ah sheep with the Messenger of Allah.\"",
      "chain": [
        "30584",
        "20029",
        "20377",
        "11154",
        "19822",
        "189"
      ]
    },
    {
      "hadith_no": "4604",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا سليمان بن داود، والحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن وهب، قال أخبرني عمرو بن الحارث، عن المنذر بن عبيد، عن القاسم بن محمد، عن ابن عمر، أن النبي صلى الله عليه وسلم نهى أن يبيع أحد طعاما اشتراه بكيل حتى يستوفيه ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that:                     the Prophet forbade anyone to sell food that he brought",
      "chain": [
        "30584",
        "36017",
        "20029",
        "20377",
        "10535",
        "18"
      ]
    },
    {
      "hadith_no": "4853",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا عمرو بن منصور، قال حدثنا الحكم بن موسى، قال حدثنا يحيى بن حمزة، عن سليمان بن داود، قال حدثني الزهري، عن أبي بكر بن محمد بن عمرو بن حزم، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم كتب إلى أهل اليمن كتابا فيه الفرائض والسنن والديات وبعث به مع عمرو بن حزم فقرئت على أهل اليمن هذه نسختها ‏\"‏ من محمد النبي صلى الله عليه وسلم إلى شرحبيل بن عبد كلال ونعيم بن عبد كلال والحارث بن عبد كلال قيل ذي رعين ومعافر وهمدان أما بعد ‏\"‏ ‏.‏ وكان في كتابه ‏\"‏ أن من اعتبط مؤمنا قتلا عن بينة فإنه قود إلا أن يرضى أولياء المقتول وأن في النفس الدية مائة من الإبل وفي الأنف إذا أوعب جدعه الدية وفي اللسان الدية وفي الشفتين الدية وفي البيضتين الدية وفي الذكر الدية وفي الصلب الدية وفي العينين الدية وفي الرجل الواحدة نصف الدية وفي المأمومة ثلث الدية وفي الجائفة ثلث الدية وفي المنقلة خمس عشرة من الإبل وفي كل أصبع من أصابع اليد والرجل عشر من الإبل وفي السن خمس من الإبل وفي الموضحة خمس من الإبل وأن الرجل يقتل بالمرأة وعلى أهل الذهب ألف دينار ‏\"‏ ‏.‏ خالفه محمد بن بكار بن بلال ‏.‏",
      "text_en": " It was narrated from Abu Bakr bin Muhammad bin 'Amr bin Hazm, from his father from his grandfather, that:                     the Messenger of Allah wrote a letter to the people of Yemen, included in which were the rules of inheritance, the sunan and the (rules concerning) blood money. He sent it with 'Arm bin Hazm and it was read to the people of Yemen, Its contents were as follows: \"From Muhammad the Prophet to Shurahbil bin 'Abd Kulal, Nu'aim bin 'Abd Kulal, Al-Harith bin' Abd Kulal, Qail dhil-Ru'ain, Mu'afir and Hamdan. To precede\" - And in this letter it said that whoevewrkills a believer for no just reason is to be killed in return, unless the heirs of the victim agree to pardon him. For killing a person, the Diyah is one hundred camels. For the nose, if it is cut off completely, diyah must be paid, for the tongue, diyah must be paid; for the lips, Diyah must be paid; for the testicles, Diyah must be paid; for the ends, Diyah must be paid; for the backbone, Dynamist be paid; for the eyes, Diyah must be paid; for one leg, half the Diyah must be paid; for a blow to the head that reaches the brain, one-third of thediyah must be paid; for a stab wound that penetrates deeply into the body, one-third of the diyah must be paid; for a blow that breaks the bone, fifteen camels must be given; for every digit of the hands or feet, ten camels must be given; for a tooth five camels must be given; for an injury that exposes the bone, five camels must be given. A man may be killed in return for (killing) a woman and those who deal in gold must pay one thousand dinars. (Daif)",
      "chain": [
        "38433",
        "30502",
        "20402",
        "30584",
        "11013",
        "11239",
        "1209"
      ]
    },
    {
      "hadith_no": "5127",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا محمد بن إسماعيل بن إبراهيم، قال حدثنا سليمان بن داود بن علي بن عبد الله بن العباس الهاشمي، قال حدثنا إبراهيم بن سعد، قال سمعت صفوان بن سليم، - ولم أسمع من صفوان غيره - يحدث عن رجل ثقة عن أبي هريرة قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا خرجت المرأة إلى المسجد فلتغتسل من الطيب كما تغتسل من الجنابة ‏\"‏ ‏.‏ مختصر ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah [SAW] said: 'If a woman goes out to the Masjid, let her perform Ghusl to remove perfume as she would perform Ghusl to remove Janabah (impurity following sexual activity).'\" This is an abridged form of it.",
      "chain": [
        "34188",
        "30584",
        "20150",
        "11177",
        "13"
      ]
    },
    {
      "hadith_no": "781",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book On The Mosques And The Congregations - كتاب المساجد والجماعات",
      "chapter_no": "4",
      "text_ar": "حدثنا مجزأة بن سفيان بن أسيد، مولى ثابت البناني حدثنا سليمان بن داود الصائغ، عن ثابت البناني، عن أنس بن مالك، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ بشر المشائين في الظلم إلى المساجد بالنور التام يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                     \"The Messenger of Allah said: 'Give glad tidings to those who walk to the mosques in the dark, of perfect light on the Day of Resurrection.'\"",
      "chain": [
        "30584",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "913",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا العباس بن عبد العظيم العنبري، حدثنا سليمان بن داود أبو أيوب الهاشمي، حدثنا عبد الرحمن بن أبي الزناد، عن موسى بن عقبة، عن عبد الله بن الفضل، عن عبد الرحمن الأعرج، عن عبيد الله بن أبي رافع، عن علي بن أبي طالب، قال كان النبي  صلى الله عليه وسلم  إذا قام إلى الصلاة المكتوبة كبر ورفع يديه حتى يكونا حذو منكبيه وإذا أراد أن يركع فعل مثل ذلك وإذا رفع رأسه من الركوع فعل مثل ذلك وإذا قام من السجدتين فعل مثل ذلك ‏.‏",
      "text_en": " It wasnarrated that ‘Ali bin Abu Talib said:                      “When the Prophet (ﷺ)stood up to offer a prescribed prayer, he said Allahu Akbar andraisedhis hands until they were parallel to his shoulders. When hewanted tobow he did likewise; when he raised his head from bowing hedidlikewise; and when he stood up after the two prostrations he didlikewise.”*",
      "chain": [
        "30437",
        "30584",
        "20509",
        "11106",
        "11187",
        "11197",
        "11199",
        "5"
      ]
    }
  ],
  "total_hadiths": 134
}