{
  "id": "31",
  "name": "Hussain ibn 'Ali ibn Abi Talib ( حسين بن علي بن أﺑﻲ طالب ( رضي الله عنه",
  "full_name": "Hussain ibn 'Ali ibn Abi Talib ( حسين بن علي بن أﺑﻲ طالب ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "4",
      "date_gregorian": "626",
      "date_display": [
        "4 AH",
        "626 CE"
      ],
      "place": "Medinah"
    },
    "death": {
      "date_hijri": "61",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Karbala, Iraq",
      "reason": "Martyred"
    },
    "places_of_stay": [
      "Medinah",
      "Kufa",
      "Makkah"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ ع  -  صحبة ]",
      "Fiqh"
    ],
    "tags": [
      "Quraish",
      "B.Hashim",
      "Grand Child"
    ]
  },
  "parents": [
    {
      "id": "5",
      "name": "Ali ibn Abi Talib ( علي بن أبي طالب بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "63",
      "name": "Fatima bint Muhammad ( فاطمة الزهراء بنت محمد بن عبد الله ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "30",
      "name": "Hassan ibn Ali bin Abi Talib ( الحسن بن علي بن أﺑﻲ طالب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "98",
      "name": "Zaynab bint 'Ali bin Abi Talib ( زينب بنت على بن أبي طالب ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "99",
      "name": "Umm Kulthum bint 'Ali bin Abi Talib ( أم كلثوم بنت علي بن أبي طالب ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "children": [
    {
      "id": "11045",
      "name": "'Ali bin al-Husain bin 'Ali علي بن الحسين بن علي - زين العابدين",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "15816",
      "name": "Sakina bint al-Husain bin 'Ali سكينة بنت الحسين بن علي بن أبي طالب",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "19506",
      "name": "Fatima bint al-Husain bin 'Ali فاطمة بنت الحسين بن علي بن أبي طالب",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "5",
      "name": "Ali ibn Abi Talib ( علي بن أبي طالب بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "63",
      "name": "Fatima bint Muhammad ( فاطمة الزهراء بنت محمد بن عبد الله ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3",
      "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3670",
      "name": "Hind bin Abi Halah ( هند بن أبي هالة التميمي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "30",
      "name": "Hassan ibn Ali bin Abi Talib ( الحسن بن علي بن أﺑﻲ طالب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11045",
      "name": "'Ali bin al-Husain bin 'Ali علي بن الحسين بن علي - زين العابدين",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19506",
      "name": "Fatima bint al-Husain bin 'Ali فاطمة بنت الحسين بن علي بن أبي طالب",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "15816",
      "name": "Sakina bint al-Husain bin 'Ali سكينة بنت الحسين بن علي بن أبي طالب",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "11442",
      "name": "Muhammad bin 'Ali b. al-Hussain al-Baqir محمد بن علي بن الحسين بن علي ,الباقر",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11052",
      "name": "'Amir al-Sha'bi عامر الشعبي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11023",
      "name": "'Ikrama عكرمة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11511",
      "name": "Sinan bin Abi Sinan سنان بن أبي سنان الديلي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10933",
      "name": "'Abdullah bin 'Amr bin 'Uthman عبد الله بن عمرو بن عثمان المطرف",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1127",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا أبو اليمان، قال أخبرنا شعيب، عن الزهري، قال أخبرني علي بن حسين، أن حسين بن علي، أخبره أن علي بن أبي طالب أخبره أن رسول الله صلى الله عليه وسلم طرقه وفاطمة بنت النبي  عليه السلام  ليلة فقال ‏\"‏ ألا تصليان ‏\"‏‏.‏ فقلت يا رسول الله، أنفسنا بيد الله، فإذا شاء أن يبعثنا بعثنا‏.‏ فانصرف حين قلنا ذلك ولم يرجع إلى شيئا‏.‏ ثم سمعته وهو مول يضرب فخذه وهو يقول ‏\"‏وكان الإنسان أكثر شىء جدلا‏}‏‏\"‏‏.‏",
      "text_en": " Narrated `Ali bin Abi Talib:                     One night Allah's Apostle came to me and Fatima, the daughter of the Prophet and asked, \"Won't you pray (at night)?\" I said, \"O Allah's Apostle! Our souls are in the hands of Allah and if He wants us to get up He will make us get up.\" When I said that, he left us without saying anything and I heard that he was hitting his thigh and saying, \"But man is more quarrelsome than anything.\" (18.54)",
      "chain": [
        "30330",
        "20428",
        "11013",
        "11045",
        "31",
        "5"
      ]
    },
    {
      "hadith_no": "2089",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا عبدان، أخبرنا عبد الله، أخبرنا يونس، عن ابن شهاب، قال أخبرني علي بن حسين، أن حسين بن علي  رضى الله عنهما  أخبره أن عليا  عليه السلام  قال كانت لي شارف من نصيبي من المغنم، وكان النبي صلى الله عليه وسلم أعطاني شارفا من الخمس، فلما أردت أن أبتني بفاطمة  عليها السلام  بنت رسول الله صلى الله عليه وسلم واعدت رجلا صواغا من بني قينقاع أن يرتحل معي فنأتي بإذخر أردت أن أبيعه من الصواغين، وأستعين به في وليمة عرسي‏.‏",
      "text_en": " Narrated `Ali:                     I got an old she-camel as my share from the booty, and the Prophet had given me another from Al- Khumus. And when I intended to marry Fatima (daughter of the Prophet), I arranged that a goldsmith from the tribe of Bani Qainuqa' would accompany me in order to bring Idhkhir and then sell it to the goldsmiths and use its price for my marriage banquet.",
      "chain": [
        "30349",
        "20025",
        "20475",
        "11013",
        "11045",
        "31"
      ]
    },
    {
      "hadith_no": "3091",
      "source": " Sahih Bukhari ",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا عبدان، أخبرنا عبد الله، أخبرنا يونس، عن الزهري، قال أخبرني علي بن الحسين، أن حسين بن علي، عليهما السلام أخبره أن عليا قال كانت لي شارف من نصيبي من المغنم يوم بدر، وكان النبي صلى الله عليه وسلم أعطاني شارفا من الخمس، فلما أردت أن أبتني بفاطمة بنت رسول الله صلى الله عليه وسلم واعدت رجلا صواغا من بني قينقاع، أن يرتحل معي فنأتي بإذخر أردت أن أبيعه الصواغين، وأستعين به في وليمة عرسي، فبينا أنا أجمع لشارفى متاعا من الأقتاب والغرائر والحبال، وشارفاى مناخان إلى جنب حجرة رجل من الأنصار، رجعت حين جمعت ما جمعت، فإذا شارفاى قد اجتب أسنمتهما وبقرت خواصرهما، وأخذ من أكبادهما، فلم أملك عينى حين رأيت ذلك المنظر منهما، فقلت من فعل هذا فقالوا فعل حمزة بن عبد المطلب، وهو في هذا البيت في شرب من الأنصار‏.‏ فانطلقت حتى أدخل على النبي صلى الله عليه وسلم وعنده زيد بن حارثة، فعرف النبي صلى الله عليه وسلم في وجهي الذي لقيت، فقال النبي صلى الله عليه وسلم ‏\"‏ ما لك ‏\"‏ فقلت يا رسول الله، ما رأيت كاليوم قط، عدا حمزة على ناقتى، فأجب أسنمتهما وبقر خواصرهما، وها هو ذا في بيت معه شرب‏.‏ فدعا النبي صلى الله عليه وسلم بردائه فارتدى ثم انطلق يمشي، واتبعته أنا وزيد بن حارثة حتى جاء البيت الذي فيه حمزة، فاستأذن فأذنوا لهم فإذا هم شرب، فطفق رسول الله صلى الله عليه وسلم يلوم حمزة فيما فعل، فإذا حمزة قد ثمل محمرة عيناه، فنظر حمزة إلى رسول الله صلى الله عليه وسلم، ثم صعد النظر فنظر إلى ركبته، ثم صعد النظر فنظر إلى سرته، ثم صعد النظر فنظر إلى وجهه ثم قال حمزة هل أنتم إلا عبيد لأبي فعرف رسول الله صلى الله عليه وسلم أنه قد ثمل، فنكص رسول الله صلى الله عليه وسلم على عقبيه القهقرى وخرجنا معه‏.‏",
      "text_en": " Narrated `Ali:                     I got a she-camel in my share of the war booty on the day (of the battle) of Badr, and the Prophet had given me a she-camel from the Khumus. When I intended to marry Fatima, the daughter of Allah's Apostle, I had an appointment with a goldsmith from the tribe of Bani Qainuqa' to go with me to bring Idhkhir (i.e. grass of pleasant smell) and sell it to the goldsmiths and spend its price on my wedding party. I was collecting for my she-camels equipment of saddles, sacks and ropes while my two shecamels were kneeling down beside the room of an Ansari man. I returned after collecting whatever I collected, to see the humps of my two she-camels cut off and their flanks cut open and some portion of their livers was taken out. When I saw that state of my two she-camels, I could not help weeping. I asked, \"Who has done this?\" The people replied, \"Hamza bin `Abdul Muttalib who is staying with some Ansari drunks in this house.\" I went away till I reached the Prophet and Zaid bin Haritha was with him. The Prophet noticed on my face the effect of what I had suffered, so the Prophet asked. \"What is wrong with you.\" I replied, \"O Allah's Apostle! I have never seen such a day as today. Hamza attacked my two she-camels, cut off their humps, and ripped open their flanks, and he is sitting there in a house in the company of some drunks.\" The Prophet then asked for his covering sheet, put it on, and set out walking followed by me and Zaid bin Haritha till he came to the house where Hamza was. He asked permission to enter, and they allowed him, and they were drunk. Allah's Apostle started rebuking Hamza for what he had done, but Hamza was drunk and his eyes were red. Hamza looked at Allah's Apostle and then he raised his eyes, looking at his knees, then he raised up his eyes looking at his umbilicus, and again he raised up his eyes look in at his face. Hamza then said, \"Aren't you but the slaves of my father?\" Allah's Apostle realized that he was drunk, so Allah's Apostle retreated, and we went out with him.",
      "chain": [
        "30349",
        "20025",
        "20475",
        "11013",
        "11045",
        "31",
        "5"
      ]
    },
    {
      "hadith_no": "4053",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبدان، أخبرنا عبد الله، أخبرنا يونس،‏.‏ حدثنا أحمد بن صالح، حدثنا عنبسة، حدثنا يونس، عن الزهري، أخبرنا علي بن حسين، أن حسين بن علي  عليهم السلام  أخبره أن عليا قال كانت لي شارف من نصيبي من المغنم يوم بدر، وكان النبي صلى الله عليه وسلم أعطاني مما أفاء الله عليه من الخمس يومئذ، فلما أردت أن أبتني بفاطمة  عليها السلام  بنت النبي صلى الله عليه وسلم واعدت رجلا صواغا في بني قينقاع أن يرتحل معي فنأتي بإذخر، فأردت أن أبيعه من الصواغين فنستعين به في وليمة عرسي، فبينا أنا أجمع لشارفى من الأقتاب والغرائر والحبال، وشارفاى مناخان إلى جنب حجرة رجل من الأنصار، حتى جمعت ما جمعت فإذا أنا بشارفى قد أجبت أسنمتها، وبقرت خواصرهما، وأخذ من أكبادهما، فلم أملك عينى حين رأيت المنظر، قلت من فعل هذا قالوا فعله حمزة بن عبد المطلب، وهو في هذا البيت، في شرب من الأنصار، عنده قينة وأصحابه فقالت في غنائها ألا يا حمز للشرف النواء، فوثب حمزة إلى السيف، فأجب أسنمتهما، وبقر خواصرهما، وأخذ من أكبادهما قال علي فانطلقت حتى أدخل على النبي صلى الله عليه وسلم وعنده زيد بن حارثة، وعرف النبي صلى الله عليه وسلم الذي لقيت فقال ‏\"‏ ما لك ‏\"‏‏.‏ قلت يا رسول الله، ما رأيت كاليوم، عدا حمزة على ناقتى، فأجب أسنمتهما، وبقر خواصرهما وها هو ذا في بيت معه شرب، فدعا النبي صلى الله عليه وسلم بردائه، فارتدى ثم انطلق يمشي، واتبعته أنا وزيد بن حارثة، حتى جاء البيت الذي فيه حمزة، فاستأذن عليه فأذن له، فطفق النبي صلى الله عليه وسلم يلوم حمزة فيما فعل، فإذا حمزة ثمل محمرة عيناه، فنظر حمزة إلى النبي صلى الله عليه وسلم ثم صعد النظر، فنظر إلى ركبته، ثم صعد النظر، فنظر إلى وجهه، ثم قال حمزة وهل أنتم إلا عبيد لأبي فعرف النبي صلى الله عليه وسلم أنه ثمل، فنكص رسول الله صلى الله عليه وسلم على عقبيه القهقرى، فخرج وخرجنا معه‏.‏",
      "text_en": " Narrated `Ali:                     I had a she-camel which I got in my share from the booty of the battle of Badr, and the Prophet had given me another she camel from the Khumus which Allah had bestowed on him that day. And when I intended to celebrate my marriage to Fatima, the daughter of the Prophet, I made an arrangement with a goldsmith from Bani Qainuqa 'that he should go with me to bring Idhkhir (i.e. a kind of grass used by gold-smiths) which I intended to sell to gold-smiths in order to spend its price on the marriage banquet. While I was collecting ropes and sacks of pack saddles for my two she-camels which were kneeling down beside an Ansari's dwelling and after collecting what I needed, I suddenly found that the humps of the two she-camels had been cut off and their flanks had been cut open and portions of their livers had been taken out. On seeing that, I could not help weeping. I asked, \"Who has done that?\" They (i.e. the people) said, \"Hamza bin `Abdul Muttalib has done it. He is present in this house with some Ansari drinkers, a girl singer, and his friends. The singer said in her song, \"O Hamza, get at the fat she-camels!\" On hearing this, Hamza rushed to his sword and cut of the camels' humps and cut their flanks open and took out portions from their livers.\" Then I came to the Prophet, with whom Zaid bin Haritha was present. The Prophet noticed my state and asked, \"What is the matter?\" I said, \"O Allah's Apostle, I have never experienced such a day as today! Hamza attacked my two she-camels, cut off their humps and cut their flanks open, and he is still present in a house along some drinkers.\" The Prophet asked for his cloak, put it on, and proceeded, followed by Zaid bin Haritha and myself, till he reached the house where Hamza was. He asked the permission to enter, and he was permitted. The Prophet started blaming Hamza for what he had done. Hamza was drunk and his eyes were red. He looked at the Prophet then raised his eyes to look at his knees and raised his eves more to look at his face and then said, \"You are not but my father's slaves.\" When the Prophet understood that Hamza was drunk, he retreated, walking backwards went out and we left with him.",
      "chain": [
        "30349",
        "20025",
        "30226",
        "11716",
        "20475",
        "11013",
        "11045",
        "31",
        "5"
      ]
    },
    {
      "hadith_no": "4771",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا يعقوب بن إبراهيم بن سعد، حدثنا أبي، عن صالح، عن ابن شهاب، قال أخبرني علي بن حسين، أن حسين بن علي، أخبره عن علي  رضى الله عنه  أن رسول الله صلى الله عليه وسلم طرقه وفاطمة قال ‏\"‏ ألا تصليان ‏\"‏‏.‏ ‏{‏رجما بالغيب‏}‏ لم يستبن‏.‏ ‏{‏فرطا‏}‏ ندما ‏{‏سرادقها‏}‏ مثل السرادق، والحجرة التي تطيف بالفساطيط، ‏{‏يحاوره‏}‏ من المحاورة ‏{‏لكنا هو الله ربي‏}‏ أى لكن أنا هو الله ربي ثم حذف الألف وأدغم إحدى النونين في الأخرى‏.‏ ‏{‏زلقا‏}‏ لا يثبت فيه قدم‏.‏ ‏{‏هنالك الولاية‏}‏ مصدر الولي‏.‏ ‏{‏عقبا‏}‏ عاقبة وعقبى وعقبة واحد وهى الآخرة قبلا وقبلا وقبلا استئنافا ‏{‏ليدحضوا‏}‏ ليزيلوا، الدحض الزلق‏.‏",
      "text_en": " Narrated `Ali:                     That one night Allah's Apostle came to him and Fatima and said, \"Don't you (both offer the (Tahajjud) prayer?\" `Ali said, 'When Allah wishes us to get up, we get up.\" The Prophet then recited: 'But man is more quarrelsome than anything.' (18.54) (See Hadith No. 227,Vol. 2)",
      "chain": [
        "30026",
        "20184",
        "20150",
        "11176",
        "11013",
        "11045",
        "31",
        "5"
      ]
    },
    {
      "hadith_no": "5853",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا عبدان، أخبرنا عبد الله، أخبرنا يونس، عن الزهري، أخبرني علي بن حسين، أن حسين بن علي، أخبره أن عليا  رضى الله عنه  قال فدعا النبي صلى الله عليه وسلم بردائه، ثم انطلق يمشي، واتبعته أنا وزيد بن حارثة، حتى جاء البيت الذي فيه حمزة، فاستأذن فأذنوا لهم‏.‏",
      "text_en": " Narrated `Ali:                     The Prophet asked for his Rida, put it on and set out walking. Zaid bin Haritha and I followed him till he reached the house where Harnza (bin `Abdul Muttalib) was present and asked for permission to enter, and they gave us permission.",
      "chain": [
        "30349",
        "20025",
        "20475",
        "11013",
        "11045",
        "31",
        "5"
      ]
    },
    {
      "hadith_no": "7433",
      "source": " Sahih Bukhari ",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، ح حدثني محمد بن سلام، أخبرنا عتاب بن بشير، عن إسحاق، عن الزهري، أخبرني علي بن حسين، أن حسين بن علي  رضى الله عنهما  أخبره أن علي بن أبي طالب قال إن رسول الله صلى الله عليه وسلم طرقه وفاطمة  عليها السلام  بنت رسول الله صلى الله عليه وسلم فقال لهم ‏\"‏ ألا تصلون ‏\"‏‏.‏ فقال علي فقلت يا رسول الله إنما أنفسنا بيد الله، فإذا شاء أن يبعثنا بعثنا، فانصرف رسول الله صلى الله عليه وسلم حين قال له ذلك ولم يرجع إليه شيئا، ثم سمعه وهو مدبر يضرب فخذه وهو يقول ‏{‏وكان الإنسان أكثر شىء جدلا‏}‏‏.‏ قال أبو عبد الله يقال ما أتاك ليلا فهو طارق‏.‏ ويقال الطارق النجم، والثاقب المضيء، يقال أثقب نارك للموقد‏.‏",
      "text_en": " Narrated `Ali bin Abi Talib:                     That Allah's Apostle came to him and Fatima the daughter of Allah's Apostle at their house at night and said, \"Won't you pray?\" `Ali replied, \"O Allah's Apostle! Our souls are in the Hands of Allah and when he wants us to get up, He makes us get up.\" When `Ali said that to him, Allah's Apostle left without saying anything to him. While the Prophet was leaving, `Ali heard him striking his thigh (with his hand) and saying, \"But man is quarrelsome more than anything else.\" (18.54)",
      "chain": [
        "30330",
        "20428",
        "11013",
        "30376",
        "20446",
        "30312",
        "11013",
        "11045",
        "31"
      ]
    },
    {
      "hadith_no": "7555",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري،‏.‏ وحدثنا إسماعيل، حدثني أخي عبد الحميد، عن سليمان، عن محمد بن أبي عتيق، عن ابن شهاب، عن علي بن حسين، أن حسين بن علي  عليهما السلام  أخبره أن علي بن أبي طالب أخبره أن رسول الله صلى الله عليه وسلم طرقه وفاطمة بنت رسول الله صلى الله عليه وسلم ليلة فقال لهم ‏\"‏ ألا تصلون ‏\"‏‏.‏ قال علي فقلت يا رسول الله إنما أنفسنا بيد الله، فإذا شاء أن يبعثنا بعثنا، فانصرف رسول الله صلى الله عليه وسلم حين قلت ذلك، ولم يرجع إلى شيئا، ثم سمعته وهو مدبر يضرب فخذه ويقول ‏\"‏ ‏{‏وكان الإنسان أكثر شىء جدلا‏}‏‏\"‏",
      "text_en": " Narrated `Ali bin Abi Talib:                     That one night Allah's Apostle visited him and Fatima, the daughter of Allah's Apostle and said to them, \"Won 't you offer (night) prayer?.. `Ali added: I said, \"O Allah's Apostle! Our souls are in the Hand of Allah and when He Wishes to bring us to life, He does.\" Then Allah's Apostle went away when I said so and he did not give any reply. Then I heard him on leaving while he was striking his thighs, saying, 'But man is, more quarrelsome than anything.' (18.54)",
      "chain": [
        "30330",
        "20428",
        "11013",
        "20208",
        "20436",
        "20160",
        "11013",
        "11045",
        "31",
        "5"
      ]
    },
    {
      "hadith_no": "5244",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثني أبو بكر بن إسحاق، أخبرنا سعيد بن كثير بن عفير أبو عثمان المصري، حدثنا عبد الله بن وهب، حدثني يونس بن يزيد، عن ابن شهاب، أخبرني علي بن حسين، بن علي أن حسين بن علي، أخبره أن عليا قال كانت لي شارف من نصيبي من المغنم يوم بدر وكان رسول الله صلى الله عليه وسلم أعطاني شارفا من الخمس يومئذ فلما أردت أن أبتني بفاطمة بنت رسول الله صلى الله عليه وسلم واعدت رجلا صواغا من بني قينقاع يرتحل معي فنأتي بإذخر أردت أن أبيعه من الصواغين فأستعين به في وليمة عرسي فبينا أنا أجمع لشارفى متاعا من الأقتاب والغرائر والحبال وشارفاى مناخان إلى جنب حجرة رجل من الأنصار وجمعت حين جمعت ما جمعت فإذا شارفاى قد اجتبت أسنمتهما وبقرت خواصرهما وأخذ من أكبادهما فلم أملك عينى حين رأيت ذلك المنظر منهما قلت من فعل هذا قالوا فعله حمزة بن عبد المطلب وهو في هذا البيت في شرب من الأنصار غنته قينة وأصحابه فقالت في غنائها ألا يا حمز للشرف النواء فقام حمزة بالسيف فاجتب أسنمتهما وبقر خواصرهما فأخذ من أكبادهما قال علي فانطلقت حتى أدخل على رسول الله صلى الله عليه وسلم وعنده زيد بن حارثة - قال - فعرف رسول الله صلى الله عليه وسلم في وجهي الذي لقيت ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ ما لك ‏\"‏ قلت يا رسول الله والله ما رأيت كاليوم قط عدا حمزة على ناقتى فاجتب أسنمتهما وبقر خواصرهما وها هو ذا في بيت معه شرب - قال - فدعا رسول الله صلى الله عليه وسلم بردائه فارتداه ثم انطلق يمشي واتبعته أنا وزيد بن حارثة حتى جاء الباب الذي فيه حمزة فاستأذن فأذنوا له فإذا هم شرب فطفق رسول الله صلى الله عليه وسلم يلوم حمزة فيما فعل فإذا حمزة محمرة عيناه فنظر حمزة إلى رسول الله صلى الله عليه وسلم ثم صعد النظر إلى ركبتيه ثم صعد النظر فنظر إلى سرته ثم صعد النظر فنظر إلى وجهه فقال حمزة وهل أنتم إلا عبيد لأبي فعرف رسول الله صلى الله عليه وسلم أنه ثمل فنكص رسول الله صلى الله عليه وسلم على عقبيه القهقرى وخرج وخرجنا معه ‏.‏",
      "text_en": " Husain b. 'Ali reported 'Ali having said:                      There fell to my lot a she-camel out of the spoils of war on the Day of Badr, and Allah's Messenger (may peace be upon him) gave me (another) she-camel on that day out of the Khums (one-fifth reserved for Allah and His Messenger). When I made up my mind to consummate my marriage with Fatima, the daughter of Allah's Messenger (may peace be upon him), I prevailed upon a goldsmith of the tribe of Qainuqa' to go along with me so that we might bring Idhkhir wishing to sell that to the goldsmiths and thus I should be able to arrange my wedding feast. While I was arranging the equipments. i. e. litters, sacks and ropes, my two she-camels were sitting down at the side of the apartment of a person of the Ansar. I collected (the different articles of equipment) and found to my surprise that their humps had been chopped off and their haunches had been cut off and their livers had been taken out. I could not help weeping when I saw that plight of theirs. I said: Who has done that? They said: Hamza b. 'Abd al-Muttalib has done this. and he is in this house dead drunk in the company of some of the Ansair with asinging girl singing before him and his companions. She said in her song: O Hamza. get up and attack these falty she-camels. Thereupon Hamza stood up with a sword (in his hand) and cut off their humps and ripped their haunches and tore out their livers. 'Ali said: I went away until I came to Allah's Messenger (may peace be upon him) and there was with him Zaid b. Haritha. Allah's Messenger (may peace be upon him) recognised from my face what I had experienced, whereupon Allah's Messenger (may peace be upon him) said: What has happened to you? I said: Messenger of Allah, by Allah, I have never seen (such an unfortunate day) as this day. Hamza has committed aggression to my she-camels, and has cut off their humps. and ripped their haunches, and he is in a house in the company of some drunkards. (Hearing this) Allah's Messenger (may peace be upon him) sent for his mantle and, putting it on him, he proceeded, and I and Zaid b. Haritha followed him, until he came to the door (of the house) in which there was Hamza. He (the Holy Prophet) sought permission which they granted him. and they were all drunk. Allah's Messenger (may peace be upon him) began to reprimand Hamza for what he had done. Hamza's eyes were red. He cast a glance at Allah's Messenger (may peace be upon him) and then looked towards his knees. and then lifted his eyes and cast a glance at his waist and then lifted his eyes and saw his face. And then Hamza said: Are you anything but the slaves of my father? Alah's Messenger (may peace be upon him) came to know that he was intoxicated, and he thus turned upon his heels, and came out, and we also came out along with him.",
      "chain": [
        "11108",
        "20029",
        "20475",
        "11013",
        "11045",
        "31",
        "5"
      ]
    },
    {
      "hadith_no": "1304",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا أحمد بن محمد المروزي ابن شبوية، حدثني علي بن حسين، عن أبيه، عن يزيد النحوي، عن عكرمة، عن ابن عباس، قال في المزمل ‏{‏ قم الليل إلا قليلا * نصفه ‏}‏ نسختها الآية التي فيها ‏{‏ علم أن لن تحصوه فتاب عليكم فاقرءوا ما تيسر من القرآن ‏}‏ وناشئة الليل أوله وكانت صلاتهم لأول الليل يقول هو أجدر أن تحصوا ما فرض الله عليكم من قيام الليل وذلك أن الإنسان إذا نام لم يدر متى يستيقظ وقوله ‏{‏ أقوم قيلا ‏}‏ هو أجدر أن يفقه في القرآن وقوله ‏{‏ إن لك في النهار سبحا طويلا ‏}‏ يقول فراغا طويلا ‏.‏",
      "text_en": " Narrated Abdullah Ibn Abbas:                     In Surat al-Muzzammil (73), the verse: \"Keep vigil at night but a little, a half thereof\" (2-3) has been abrogated by the following verse: \"He knoweth that ye count it not, and turneth unto you in mercy. Recite then of the Qur'an that which is easy for you\" (v.20). The phrase \"the vigil of the night\" (nashi'at al-layl) means the early hours of the night. They (the companions) would pray (the tahajjud prayer) in the early hours of the night.  He (Ibn Abbas) says: It is advisable to offer the prayer at night (tahajjud), prescribed by Allah for you (in the early hours of the night). This is because when a person sleeps, he does not know when he will awake. The words \"speech more certain\" (aqwamu qilan) means that this time is more suitable for the understanding of the Qur'an. He says: The verse: \"Lo, thou hast by day a chain of business\" (v.7) means engagement for long periods (in the day's work).",
      "chain": [
        "30304",
        "11045",
        "31",
        "19950",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2090",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا أحمد بن محمد بن ثابت المروزي، حدثني علي بن حسين بن واقد، عن أبيه، عن يزيد النحوي، عن عكرمة، عن ابن عباس، قال ‏{‏ لا يحل لكم أن ترثوا النساء كرها ولا تعضلوهن لتذهبوا ببعض ما آتيتموهن إلا أن يأتين بفاحشة مبينة ‏}‏ وذلك أن الرجل كان يرث امرأة ذي قرابته فيعضلها حتى تموت أو ترد إليه صداقها فأحكم الله عن ذلك ونهى عن ذلك ‏.‏",
      "text_en": " Ibn ‘Abbas explained the Qur’anic verse It is not lawful for you forcibly to inherit the woman (of your deceased kinsmen) nor (that) ye should put constraint upon them that ye may take away a part of that which ye have given them, unless they be guilty of flagrant lewdness and said “This means that a man used to inherit a relative woman. He prevented her from marriage till she died or returned her dower to her. Hence, Allaah prohibited that practice.",
      "chain": [
        "30304",
        "11045",
        "31",
        "19950",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2195",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا أحمد بن محمد المروزي، حدثني علي بن حسين بن واقد، عن أبيه، عن يزيد النحوي، عن عكرمة، عن ابن عباس، قال ‏{‏ والمطلقات يتربصن بأنفسهن ثلاثة قروء ولا يحل لهن أن يكتمن ما خلق الله في أرحامهن ‏}‏ الآية وذلك أن الرجل كان إذا طلق امرأته فهو أحق برجعتها وإن طلقها ثلاثا فنسخ ذلك وقال ‏{‏ الطلاق مرتان ‏}‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     Divorced women shall wait concerning themselves for three monthly periods. Nor is it lawful for them to hide what Allah hath created in their wombs. This means that if a man divorced his wife he had the right to take her back in marriage though he had divorced her by three pronouncements. This was then repealed (by a Qur'anic verse). Divorce is only permissible twice.",
      "chain": [
        "30304",
        "11045",
        "31",
        "19950",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2282",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثني أحمد بن محمد بن ثابت المروزي، حدثني علي بن حسين، عن أبيه، عن يزيد النحوي، عن عكرمة، عن ابن عباس، قال ‏{‏ والمطلقات يتربصن بأنفسهن ثلاثة قروء ‏}‏ ‏.‏ وقال ‏{‏ واللائي يئسن من المحيض من نسائكم إن ارتبتم فعدتهن ثلاثة أشهر ‏}‏ فنسخ من ذلك وقال ‏{‏ وإن طلقتموهن من قبل أن تمسوهن ‏}‏ ‏{‏ فما لكم عليهن من عدة تعتدونها ‏}‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     Women who are divorced shall wait, keeping themselves apart, three monthly courses; and then said: And for such of your women as despair of menstruation, if ye doubt, their period (of waiting) shall be three months. This was abrogated from the former verse. Again he said: (O ye who believe, if ye wed believing women) and divorce them before ye have touched them, then there is no period that ye should reckon.\"",
      "chain": [
        "30304",
        "11045",
        "31",
        "19950",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2313",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا أحمد بن محمد بن شبوية، حدثني علي بن حسين بن واقد، عن أبيه، عن يزيد النحوي، عن عكرمة، عن ابن عباس، ‏{‏ يا أيها الذين آمنوا كتب عليكم الصيام كما كتب على الذين من قبلكم ‏}‏ فكان الناس على عهد النبي صلى الله عليه وسلم إذا صلوا العتمة حرم عليهم الطعام والشراب والنساء وصاموا إلى القابلة فاختان رجل نفسه فجامع امرأته وقد صلى العشاء ولم يفطر فأراد الله عز وجل أن يجعل ذلك يسرا لمن بقي ورخصة ومنفعة فقال سبحانه ‏{‏ علم الله أنكم كنتم تختانون أنفسكم ‏}‏ ‏.‏ وكان هذا مما نفع الله به الناس ورخص لهم ويسر ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     Ibn Abbas explained the following Qur'anic verse: \"O ye who believe! fasting is prescribed for you as it was prescribed for those before you\" During the lifetime of the Prophet (ﷺ), when the people offered night prayer, they were asked to abstain from food and drink and (intercourse with) women, they kept fast till the next night. A man betrayed himself and had intercourse with his wife after he had offered the night prayer, and he did not break his fast. So Allah, the Exalted, intended to make it (fasting) easy for those who survived,  thus providing a concession and utility. Allah, the Glorified, said: \"Allah knoweth what ye used to do secretly among yourselves.\" By this Allah benefited the people and provided concession and ease to them.",
      "chain": [
        "30304",
        "11045",
        "31",
        "19950",
        "11023"
      ]
    },
    {
      "hadith_no": "2316",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا أحمد بن محمد، حدثني علي بن حسين، عن أبيه، عن يزيد النحوي، عن عكرمة، عن ابن عباس، ‏{‏ وعلى الذين يطيقونه فدية طعام مسكين ‏}‏ فكان من شاء منهم أن يفتدي بطعام مسكين افتدى وتم له صومه فقال ‏{‏ فمن تطوع خيرا فهو خير له وأن تصوموا خير لكم ‏}‏ وقال ‏{‏ فمن شهد منكم الشهر فليصمه ومن كان مريضا أو على سفر فعدة من أيام أخر ‏}‏ ‏.‏",
      "text_en": " Ibn ‘Abbas explain the Qur’anic verse “For those who can do it(with hardship) is a ransom, the feeding of one, that is indigent” said “If one of them wished to pay ransom by providing food to an indigent person he could pay ransom.. Thus, his fast was complete. Allaah, the Exalted pronounced “But he that will give more of his own free will, it is better for him”. Again he pronounced “So every one of you who is present (at his home) during that month should spend it in fasting.” But, if anyone is ill or on a journey the prescribed period (should be made up) by days later.",
      "chain": [
        "30304",
        "11045",
        "31",
        "19950",
        "11023"
      ]
    },
    {
      "hadith_no": "2505",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا أحمد بن محمد المروزي، حدثني علي بن الحسين، عن أبيه، عن يزيد النحوي، عن عكرمة، عن ابن عباس، قال ‏{‏ إلا تنفروا يعذبكم عذابا أليما ‏}‏ و ‏{‏ ما كان لأهل المدينة ‏}‏ إلى قوله ‏{‏ يعملون ‏}‏ نسختها الآية التي تليها ‏{‏ وما كان المؤمنون لينفروا كافة ‏}‏",
      "text_en": " Ibn ‘Abbas said “The Qur’anic verse “Unless you go forth, He will punish you with a grievous penalty, and the verse “It is not fitting for the people of Medina”... up to “that Allaah might required their deed with the best (possible reward)  have been repealed by the verse. Nor should the believers all go forth together.”",
      "chain": [
        "30304",
        "11045",
        "31",
        "19950",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2572",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا أحمد بن محمد بن ثابت المروزي، حدثني علي بن حسين، حدثني أبي، حدثني عبد الله بن بريدة، قال سمعت أبي بريدة، يقول بينما رسول الله صلى الله عليه وسلم يمشي جاء رجل ومعه حمار فقال يا رسول الله اركب ‏.‏ وتأخر الرجل ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا أنت أحق بصدر دابتك مني إلا أن تجعله لي ‏\"‏ ‏.‏ قال فإني قد جعلته لك ‏.‏ فركب ‏.‏",
      "text_en": " Narrated Buraydah ibn al-Hasib:                     While the Messenger of Allah (ﷺ) was walking a man who had an ass came to him and said: Messenger of Allah, ride; and the man moved to the back of the animal. The Messenger of Allah (ﷺ) said: No, you have more right to ride in front on your animal than me unless you grant that right to me. He said: I grant it to you. So he mounted.",
      "chain": [
        "30304",
        "11045",
        "31",
        "11432"
      ]
    },
    {
      "hadith_no": "2771",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا أحمد بن محمد بن ثابت المروزي، حدثني علي بن حسين، عن أبيه، عن يزيد النحوي، عن عكرمة، عن ابن عباس، قال ‏{‏ لا يستأذنك الذين يؤمنون بالله واليوم الآخر ‏}‏ الآية نسختها التي في النور ‏{‏ إنما المؤمنون الذين آمنوا بالله ورسوله ‏}‏ إلى قوله ‏{‏ غفور رحيم ‏}‏ ‏.‏",
      "text_en": " Ibn ‘Abbas said “The verse “Those who believe in Allaah and the Last Day ask thee for no exemption from fighting with their goods and persons” was abrogated by the verse “Only those are believers who believe in Allaah and His Apostle....For Allaah is Oft-Forgiving, Most Merciful.”",
      "chain": [
        "30304",
        "11045",
        "31",
        "19950",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2817",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Sacrifice (Kitab Al-Dahaya) - كتاب الضحايا",
      "chapter_no": "16",
      "text_ar": "حدثنا أحمد بن محمد بن ثابت المروزي، حدثني علي بن حسين، عن أبيه، عن يزيد النحوي، عن عكرمة، عن ابن عباس، قال ‏{‏ فكلوا مما ذكر اسم الله عليه ‏}‏ ‏{‏ ولا تأكلوا مما لم يذكر اسم الله عليه ‏}‏ فنسخ واستثنى من ذلك فقال ‏{‏ وطعام الذين أوتوا الكتاب حل لكم وطعامكم حل لهم ‏}‏ ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     The verse: \"So eat of (meats) on which Allah's name hath been pronounced\" and the verse: \"Eat not of  (meats) on which Allah's name hath not been pronounced\" were abrogated, meaning an exception was made therein by the verse: \"The food of the people of the Book is lawful unto you and yours is lawful unto them.\"",
      "chain": [
        "30304",
        "11045",
        "31",
        "19950",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2843",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Sacrifice (Kitab Al-Dahaya) - كتاب الضحايا",
      "chapter_no": "16",
      "text_ar": "حدثنا أحمد بن محمد بن ثابت، حدثنا علي بن الحسين، حدثني أبي، حدثنا عبد الله بن بريدة، قال سمعت أبي بريدة، يقول كنا في الجاهلية إذا ولد لأحدنا غلام ذبح شاة ولطخ رأسه بدمها فلما جاء الله بالإسلام كنا نذبح شاة ونحلق رأسه ونلطخه بزعفران ‏.‏",
      "text_en": " Narrated Buraydah ibn al-Hasib:                     When a boy was born to one of us in the pre-Islamic period, we sacrificed a sheep and smeared his head with its blood; but when Allah brought Islam, we sacrificed a sheep, shaved his head and smeared his head with saffron.",
      "chain": [
        "30304",
        "11045",
        "31",
        "11432"
      ]
    },
    {
      "hadith_no": "2869",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wills (Kitab Al-Wasaya) - كتاب الوصايا",
      "chapter_no": "18",
      "text_ar": "حدثنا أحمد بن محمد المروزي، حدثني علي بن حسين بن واقد، عن أبيه، عن يزيد النحوي، عن عكرمة، عن ابن عباس، ‏{‏ إن ترك خيرا الوصية للوالدين والأقربين ‏}‏ فكانت الوصية كذلك حتى نسختها آية الميراث ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     The Qur'anic verse goes: \"(It is prescribed when death approaches any of you), if he leaves any goods, that he may bequest to parents and next to kin.\" The bequest was made in this way until the verse of inheritance repealed it.",
      "chain": [
        "30304",
        "11045",
        "31",
        "19950",
        "11023"
      ]
    },
    {
      "hadith_no": "2921",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Shares of Inheritance (Kitab Al-Fara'id) - كتاب الفرائض",
      "chapter_no": "19",
      "text_ar": "حدثنا أحمد بن محمد بن ثابت، حدثني علي بن حسين، عن أبيه، عن يزيد النحوي، عن عكرمة، عن ابن عباس، رضى الله عنهما قال ‏{‏ والذين عقدت أيمانكم فآتوهم نصيبهم ‏}‏ كان الرجل يحالف الرجل ليس بينهما نسب فيرث أحدهما الآخر فنسخ ذلك الأنفال فقال تعالى ‏{‏ وأولو الأرحام بعضهم أولى ببعض ‏}‏ ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     To those also, to whom your right hand was pledged, give their due portion. A man made an agreement with another man (in early days of Islam), and there was no relationship between the ; one of them inherited from the other. The following verse of Surat Al-Anfal abrogated it: \"But kindred by blood have prior right against each other.\"",
      "chain": [
        "30304",
        "11045",
        "31",
        "19950",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2924",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Shares of Inheritance (Kitab Al-Fara'id) - كتاب الفرائض",
      "chapter_no": "19",
      "text_ar": "حدثنا أحمد بن محمد، حدثنا علي بن حسين، عن أبيه، عن يزيد النحوي، عن عكرمة، عن ابن عباس، والذين، آمنوا وهاجروا والذين آمنوا ولم يهاجروا فكان الأعرابي لا يرث المهاجر ولا يرثه المهاجر فنسختها فقال ‏{‏ وأولو الأرحام بعضهم أولى ببعض ‏}‏",
      "text_en": " Narrated Ibn 'Abbas:                     Referring to the verse: \"Those who believed and adopted exile... As to those who believed but came not into exile\": A bedouin (who did not migrate to Medina) did not inherit from an emigrant, and an emigrant did no inherit from him. It was abrogated by the verse: \"But kindred by blood have prior rights against each other.\"",
      "chain": [
        "30304",
        "11045",
        "31",
        "19950",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "3590",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا أحمد بن محمد المروزي، حدثني علي بن حسين، عن أبيه، عن يزيد النحوي، عن عكرمة، عن ابن عباس، قال ‏{‏ فإن جاءوك فاحكم بينهم أو أعرض عنهم ‏}‏ فنسخت قال ‏{‏ فاحكم بينهم بما أنزل الله ‏}‏ ‏.‏",
      "text_en": " Ibn 'Abbas said:                      The Qur'anic verse: \"If they do come to thee, either judge between them, or decline to interfere\" was abrogated by the verse: \"So judge between them by what Allah hath revealed.\"",
      "chain": [
        "30304",
        "11045",
        "31",
        "19950",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "3672",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Drinks (Kitab Al-Ashribah) - كتاب الأشربة",
      "chapter_no": "27",
      "text_ar": "حدثنا أحمد بن محمد المروزي، حدثنا علي بن حسين، عن أبيه، عن يزيد النحوي، عن عكرمة، عن ابن عباس، قال ‏{‏ يا أيها الذين آمنوا لا تقربوا الصلاة وأنتم سكارى ‏}‏ و ‏{‏ يسألونك عن الخمر والميسر قل فيهما إثم كبير ومنافع للناس ‏}‏ نسختهما التي في المائدة ‏{‏ إنما الخمر والميسر والأنصاب ‏}‏ الآية ‏.‏",
      "text_en": " Ibn  Abbas said:                      The Quranic verse :”O ye who believe ,approach not prayer with minds befogged until you can understand all they say,” and the verse: “They ask thee concerning wine and gambling.  Say: In them is great sin and some profit for men ,” were repeated by the verse in Surat al-Ma’idah: ”O ye who believe, intoxicants and gambling,(dedication) stones.",
      "chain": [
        "30304",
        "11045",
        "31",
        "19950",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "4372",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا أحمد بن محمد بن ثابت، حدثنا علي بن حسين، عن أبيه، عن يزيد النحوي، عن عكرمة، عن ابن عباس، قال ‏{‏ إنما جزاء الذين يحاربون الله ورسوله ويسعون في الأرض فسادا أن يقتلوا أو يصلبوا أو تقطع أيديهم وأرجلهم من خلاف أو ينفوا من الأرض ‏}‏ إلى قوله ‏{‏ غفور رحيم ‏}‏ نزلت هذه الآية في المشركين فمن تاب منهم قبل أن يقدر عليه لم يمنعه ذلك أن يقام فيه الحد الذي أصابه ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The verse \"The punishment of those who wage war against Allah and His Apostle, and strive with might and main for mischief through the land is execution, or crucifixion, or the cutting off of hands and feet from opposite side or exile from the land...most merciful\" was revealed about polytheists. If any of them repents before they are arrested, it does not prevent from inflicting on him the prescribed punishment which he deserves.",
      "chain": [
        "30304",
        "11045",
        "31",
        "19950",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "4413",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا أحمد بن محمد بن ثابت المروزي، حدثني علي بن الحسين، عن أبيه، عن يزيد النحوي، عن عكرمة، عن ابن عباس، قال ‏{‏ واللاتي يأتين الفاحشة من نسائكم فاستشهدوا عليهن أربعة منكم فإن شهدوا فأمسكوهن في البيوت حتى يتوفاهن الموت أو يجعل الله لهن سبيلا ‏}‏ وذكر الرجل بعد المرأة ثم جمعهما فقال ‏{‏ واللذان يأتيانها منكم فآذوهما فإن تابا وأصلحا فأعرضوا عنهما ‏}‏ فنسخ ذلك بآية الجلد فقال ‏{‏ الزانية والزاني فاجلدوا كل واحد منهما مائة جلدة ‏}‏ ‏.‏",
      "text_en": " Ibn ‘Abbas said:                      The Qur’anic verse goes: “If any of your woman are guilty of lewdness, take the evidence of four (reliable) witnesses from amongst you against them, and if they testify, Confine them to houses until death do chain them or Allah ordains for them some (other) way. Allah then mentioned man after woman and combined them in another verse :  “If two men among you are guilty of lewdness, punish them both. If they repent and amend, leave them alone. This command was abrogated by the verse relating to flogging : “The woman and the man guilty of adultery or fornication – flog  each of them with one hundred stripes.",
      "chain": [
        "30304",
        "11045",
        "31",
        "19950",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "5016",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن محمد المروزي، قال حدثني علي بن حسين، عن أبيه، عن يزيد النحوي، عن عكرمة، عن ابن عباس، قال ‏{‏ والشعراء يتبعهم الغاوون ‏}‏ فنسخ من ذلك واستثنى فقال ‏{‏ إلا الذين آمنوا وعملوا الصالحات وذكروا الله كثيرا ‏}‏ ‏.‏",
      "text_en": " Ibn ‘Abbas said :                      The verse “And the poets it is those straying in evil who follow them. He (Allah) then abrogated it and made an exception saying: Except those who believe and work righteousness, engage much in the remembrance of Allah.\"",
      "chain": [
        "30304",
        "11045",
        "31",
        "19950",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "5242",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن محمد المروزي، قال حدثني علي بن حسين، حدثني أبي قال، حدثني عبد الله بن بريدة، قال سمعت أبي بريدة، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ في الإنسان ثلاثمائة وستون مفصلا فعليه أن يتصدق عن كل مفصل منه بصدقة ‏\"‏ ‏.‏ قالوا ومن يطيق ذلك يا نبي الله قال ‏\"‏ النخاعة في المسجد تدفنها والشىء تنحيه عن الطريق فإن لم تجد فركعتا الضحى تجزئك ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Buraydah:                     I heard the Messenger of Allah (ﷺ) say: A human being has three hundred and sixty joints for each of which he must give alms. The people asked him: Who is capable of doing this ? He replied: It may be mucus in the mosque which you bury, and something which you remove from the road; but if you do not find such, two rak'ahs in the forenoon will be sufficient for you.",
      "chain": [
        "30304",
        "11045",
        "31",
        "11432"
      ]
    },
    {
      "hadith_no": "4143",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا الحسين بن حريث، حدثنا علي بن حسين بن واقد، حدثني أبي، حدثني عبد الله بن بريدة، قال سمعت أبي، ‏:‏ بريدة يقول كان رسول الله صلى الله عليه وسلم يخطبنا إذ جاء الحسن والحسين عليهما السلام عليهما قميصان أحمران يمشيان ويعثران فنزل رسول الله صلى الله عليه وسلم من المنبر فحملهما ووضعهما بين يديه ثم قال ‏\"‏ صدق الله ‏:‏ ‏(‏ إنما أموالكم وأولادكم فتنة ‏)‏ فنظرت إلى هذين الصبيين يمشيان ويعثران فلم أصبر حتى قطعت حديثي ورفعتهما ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب إنما نعرفه من حديث الحسين بن واقد ‏.‏",
      "text_en": " Narrated Buraidah:                     \"The Messenger of Allah (ﷺ) was delivering a Khutbah to us when Al-Hasan and Al-Husain [peace be upon them] came, wearing red shirts, walking and falling down. So the Messenger of Allah (ﷺ) descended from the Minbar and carried them, and placed them in front of him. Then he said: 'Allah spoke the Truth: Indeed, your wealth and your children are a trial (64:15). I looked at these two children walking and falling down, and I could not bear patiently anymore until I interrupted my talk and picked them up.\"",
      "chain": [
        "30325",
        "11045",
        "31",
        "11432"
      ]
    },
    {
      "hadith_no": "1612",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا عبيد الله بن سعد بن إبراهيم بن سعد، قال حدثنا عمي، قال حدثنا أبي، عن ابن إسحاق، قال حدثني حكيم بن حكيم بن عباد بن حنيف، عن محمد بن مسلم بن شهاب، عن علي بن حسين، عن أبيه، عن جده، علي بن أبي طالب قال دخل على رسول الله صلى الله عليه وسلم وعلى فاطمة من الليل فأيقظنا للصلاة ثم رجع إلى بيته فصلى هويا من الليل فلم يسمع لنا حسا فرجع إلينا فأيقظنا فقال ‏\"‏ قوما فصليا ‏\"‏ ‏.‏ قال فجلست وأنا أعرك عيني وأقول إنا والله ما نصلي إلا ما كتب الله لنا إنما أنفسنا بيد الله ‏.‏ فإن شاء أن يبعثنا بعثنا - قال - فولى رسول الله صلى الله عليه وسلم وهو يقول ويضرب بيده على فخذه ‏\"‏ ما نصلي إلا ما كتب الله لنا ‏{‏ وكان الإنسان أكثر شىء جدلا ‏}‏ ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ali bin Husain, from his father, that:                     Hs grandfather Ali bin Abi Talib said: \"The Messenger of Allah (ﷺ) came in to Fatimah and I, one night and woke us up to pray, then he went back to his house and prayed for part of the night, and he did not hear any movement from us. He came back to us and woke us up, and said: 'Get up and pray.' I sat up, rubbing my eyes, and said: 'By Allah, we will only pray that which has decreed for us; our souls are in the hand of Allah (SWT) and if He wants to make us get up, He will make us get up.' The Messenger of Allah (ﷺ) turned away, striking his hand on his thigh, saying: 'We will only pray that which Allah (SWT) has decreed for us! But man is ever more quarrelsome than anything.'\"",
      "chain": [
        "11107",
        "19803",
        "167",
        "11045",
        "31",
        "5"
      ]
    },
    {
      "hadith_no": "68",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا سهل بن أبي سهل، ومحمد بن إسماعيل، قالا حدثنا عبد السلام بن صالح أبو الصلت الهروي، حدثنا علي بن موسى الرضا، عن أبيه، عن جعفر بن محمد، عن أبيه، عن علي بن الحسين، عن أبيه، عن علي بن أبي طالب، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ الإيمان معرفة بالقلب وقول باللسان وعمل بالأركان ‏\"‏ ‏.‏ قال أبو الصلت لو قرئ هذا الإسناد على مجنون لبرأ ‏.‏",
      "text_en": " It was narrated that 'Ali bin Abu Talib said:                     \"The Messenger of Allah (ﷺ) said: 'Faith is knowledge in the heart, words on the tongue and action with the physical faculties. (limbs of the body).'\" (Maudu')",
      "chain": [
        "38259",
        "34188",
        "10898",
        "11442",
        "11045",
        "31",
        "5"
      ]
    },
    {
      "hadith_no": "1668",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع بن الجراح، عن هشام بن زياد، عن أمه، عن فاطمة بنت الحسين، عن أبيها، قال قال النبي  صلى الله عليه وسلم  ‏\"‏ من أصيب بمصيبة فذكر مصيبته فأحدث استرجاعا - وإن تقادم عهدها - كتب الله له من الأجر مثله يوم أصيب ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Fatimah bint Husain that her father said:                      TheProphet(ﷺ) said: “Whoever was stricken with a calamity and when heremembers it he says ‘Inna lillahi, wa inna ilayhi raji’un(Truly, toAllah we belong and truly, to Him we shall return),’even though ithappened a long time ago, Allah will record for him areward like thatof the day it befell him.”",
      "chain": [
        "30201",
        "20032",
        "12556",
        "19506",
        "31"
      ]
    }
  ],
  "total_hadiths": 33
}