{
  "id": "31167",
  "name": "Muhammad bin 'Isa bin Hyan محمد بن عيسى بن حيان",
  "full_name": "Muhammad bin 'Isa bin Hyan محمد بن عيسى بن حيان",
  "grade": "3rd Century AH",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Mada'in",
      "Antioch"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah]"
    ],
    "tags": [
      "al-Mada'ini",
      "al-Antaki"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "1796",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "وقال محمد بن عيسى حدثنا حماد، عن أيوب، عن نافع، عن ابن عمر  رضى الله عنهما  أنه كان إذا أقبل بات بذي طوى، حتى إذا أصبح دخل، وإذا نفر مر بذي طوى وبات بها حتى يصبح، وكان يذكر أن النبي صلى الله عليه وسلم كان يفعل ذلك‏.‏",
      "text_en": " Narrated Nafi':                      Whenver Ibn 'Umar (ra) approached (Makkah) he used to pass the night at Dhi-Tuwa till dawn, and then he would enter Makkah. On his return, he used to pass by Dhi-Tuwa and pass the night there till dawn, and he used to say that the Prophet () used to do the same.",
      "chain": [
        "31167",
        "20022",
        "11015",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "6141",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "وقال محمد بن عيسى حدثنا هشيم، أخبرنا حميد الطويل، حدثنا أنس بن مالك، قال كانت الأمة من إماء أهل المدينة لتأخذ بيد رسول الله صلى الله عليه وسلم فتنطلق به حيث شاءت‏.‏",
      "text_en": "     Anas bin Malik said, \"Any of the female slaves of Medina      could take hold of the hand of Allah's Apostle and take him wherever      she wished.\"",
      "chain": [
        "31167",
        "20468",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "24",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا حجاج، عن ابن جريج، عن حكيمة بنت أميمة بنت رقيقة، عن أمها، أنها قالت كان للنبي صلى الله عليه وسلم قدح من عيدان تحت سريره يبول فيه بالليل ‏.‏",
      "text_en": " Narrated Umaymah daughter of Ruqayqah:                     The Prophet (ﷺ) had a wooden vessel under his bed in which he would urinate at night.",
      "chain": [
        "31167",
        "20219",
        "11070",
        "19444",
        "2750"
      ]
    },
    {
      "hadith_no": "50",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا عنبسة بن عبد الواحد، عن هشام بن عروة، عن أبيه، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يستن وعنده رجلان أحدهما أكبر من الآخر فأوحي إليه في فضل السواك ‏\"‏ أن كبر ‏\"‏ ‏.‏ أعط السواك أكبرهما ‏.‏ قال أحمد - هو ابن حزم - قال لنا أبو سعيد هو ابن الأعرابي هذا مما تفرد به أهل المدينة ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     The Messenger of Allah (ﷺ) was using the tooth-stick, when two men, one older than the other, were with him. A revelation came to him about the merit of using the tooth-stick. He was asked to show proper respect and give it to the elder of the two.",
      "chain": [
        "31167",
        "25222",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "58",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا هشيم، أخبرنا حصين، عن حبيب بن أبي ثابت، عن محمد بن علي بن عبد الله بن عباس، عن أبيه، عن جده عبد الله بن عباس، قال بت ليلة عند النبي صلى الله عليه وسلم فلما استيقظ من منامه أتى طهوره فأخذ سواكه فاستاك ثم تلا هذه الآيات ‏{‏ إن في خلق السموات والأرض واختلاف الليل والنهار لآيات لأولي الألباب ‏}‏ حتى قارب أن يختم السورة أو ختمها ثم توضأ فأتى مصلاه فصلى ركعتين ثم رجع إلى فراشه فنام ما شاء الله ثم استيقظ ففعل مثل ذلك ثم رجع إلى فراشه فنام ثم استيقظ ففعل مثل ذلك ثم رجع إلى فراشه فنام ثم استيقظ ففعل مثل ذلك كل ذلك يستاك ويصلي ركعتين ثم أوتر ‏.‏ قال أبو داود رواه ابن فضيل عن حصين قال فتسوك وتوضأ وهو يقول ‏{‏ إن في خلق السموات والأرض ‏}‏ حتى ختم السورة ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     I spent a night with the Prophet (sal Allaahu alayhi wa sallam). When he woke up from his sleep (in the latter part of the night for prayer) he came to his ablution water. He took the tooth-stick and used it. He then recited the verse: \"Verily in the creation of the heavens and the earth and the alternation of the night and the day are tokens (of His Sovereignty) for men of understanding\" (iii-190). He recited these verses up to the end of the chapter or he finished the whole chapter. He then performed  ablution and  came to the place of prayer. He then said two rak'ahs of prayer. He then lay down on the bed and slept as much as Allaah wished. He then got up and did the same. He then lay down and slept. He then got up and did the same. Every time he used the tooth-stick and offered two rak'ah of prayer. He then offered the prayer known as witr.Abu Dawud said: Fudail on the authority if Husain reported the wording: He then used the tooth-stick and performed ablution while he was reciting the verses: \"Verily in the creation of the heaves and the earth...\" until he finished the chapter.",
      "chain": [
        "31167",
        "20468",
        "15097",
        "11331",
        "10961",
        "10949",
        "17"
      ]
    },
    {
      "hadith_no": "89",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن محمد بن حنبل، ومسدد، ومحمد بن عيسى، - المعنى - قالوا حدثنا يحيى بن سعيد، عن أبي حزرة، حدثنا عبد الله بن محمد، - قال ابن عيسى في حديثه ابن أبي بكر ثم اتفقوا أخو القاسم بن محمد - قال كنا عند عائشة فجيء بطعامها فقام القاسم يصلي فقالت سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يصلى بحضرة الطعام ولا وهو يدافعه الأخبثان ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Abd Allaah b. Muhammad:                     We were in the company of 'Aishah. When her food was brought in, al-Qasim stood up to say his prayer. Thereupon , 'Aishah said : I heard the Messenger of Allaah (sal Allaahu alayhi wa sallam) say: Prayer should not be offered in presence of meals, nor at the moment  when one is struggling with two evils (e.g. when one is feeling the call of nature.)",
      "chain": [
        "30007",
        "30175",
        "31167",
        "11062",
        "30351"
      ]
    },
    {
      "hadith_no": "90",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا ابن عياش، عن حبيب بن صالح، عن يزيد بن شريح الحضرمي، عن أبي حى المؤذن، عن ثوبان، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ثلاث لا يحل لأحد أن يفعلهن لا يؤم رجل قوما فيخص نفسه بالدعاء دونهم فإن فعل فقد خانهم ولا ينظر في قعر بيت قبل أن يستأذن فإن فعل فقد دخل ولا يصلي وهو حقن حتى يتخفف ‏\"‏ ‏.‏",
      "text_en": " Narrated Thawban:                     The Messenger of Allah (ﷺ) said: Three things one is not allowed to do: supplicating Allah specifically for himself and ignoring others while leading people in prayer; if he did so, he deceived them; looking inside a house before taking permission: if he did so, it is as if he entered the house, saying prayer while one is feeling the call of nature until one eases oneself.",
      "chain": [
        "31167",
        "28090",
        "19173",
        "18410",
        "130"
      ]
    },
    {
      "hadith_no": "132",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن عيسى، ومسدد، قالا حدثنا عبد الوارث، عن ليث، عن طلحة بن مصرف، عن أبيه، عن جده، قال رأيت رسول الله صلى الله عليه وسلم يمسح رأسه مرة واحدة حتى بلغ القذال - وهو أول القفا - وقال مسدد ومسح رأسه من مقدمه إلى مؤخره حتى أخرج يديه من تحت أذنيه ‏.‏ قال مسدد فحدثت به يحيى فأنكره ‏.‏ قال أبو داود وسمعت أحمد يقول ابن عيينة زعموا كان ينكره ويقول أيش هذا طلحة عن أبيه عن جده",
      "text_en": " Narrated Talhah ibn Musarrif:                     I saw the Messenger of Allah (ﷺ) wiping his head once up to his nape.Musaddad reported: He wiped his head from front to back until he moved his hands from beneath the ears.Abu Dawud said: I heard Ahmad say: People thought that Ibn 'Uyainah had considered it to be munkar (rejected) and said: What is this chain: Talhah - his father - his grandfather ?",
      "chain": [
        "31167",
        "30175",
        "20258",
        "20023",
        "11356",
        "15532"
      ]
    },
    {
      "hadith_no": "171",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا شريك، عن عمرو بن عامر البجلي، - قال محمد هو أبو أسد بن عمرو - قال سألت أنس بن مالك عن الوضوء، فقال كان النبي صلى الله عليه وسلم يتوضأ لكل صلاة وكنا نصلي الصلوات بوضوء واحد ‏.‏",
      "text_en": " Abu Asad b. ‘Amr said:                      I asked Anas b. Malik about ablution. He replied: The Prophet (ﷺ) performed ablution for each prayer and we offered (many) prayers with the same ablution.",
      "chain": [
        "31167",
        "20587",
        "15406",
        "19"
      ]
    },
    {
      "hadith_no": "560",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا أبو معاوية، عن هلال بن ميمون، عن عطاء بن يزيد، عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الصلاة في جماعة تعدل خمسا وعشرين صلاة فإذا صلاها في فلاة فأتم ركوعها وسجودها بلغت خمسين صلاة ‏\"‏ ‏.‏ قال أبو داود قال عبد الواحد بن زياد في الحديث ‏\"‏ صلاة الرجل في الفلاة تضاعف على صلاته في الجماعة ‏\"‏ ‏.‏ وساق الحديث ‏.‏",
      "text_en": " Narrated AbuSa'id al-Khudri:                     Prayer in congregation is equivalent to twenty-five prayers (offered alone). If he prays in a jungle, and performs its bowing and prostrations perfectly, it becomes equivalent to fifty prayers (in respect of reward).Abu Dawud said: 'Abd al-Walid b. Ziyad narrated in his version of this tradition: \"Prayer said by a single person in a jungle is more excellent by multiplied degrees than prayer said in congregation.\"",
      "chain": [
        "31167",
        "20354",
        "11206",
        "38"
      ]
    },
    {
      "hadith_no": "807",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا معتمر بن سليمان، ويزيد بن هارون، وهشيم، عن سليمان التيمي، عن أمية، عن أبي مجلز، عن ابن عمر، أن النبي صلى الله عليه وسلم سجد في صلاة الظهر ثم قام فركع فرأينا أنه قرأ تنزيل السجدة ‏.‏ قال ابن عيسى لم يذكر أمية أحد إلا معتمر ‏.‏",
      "text_en": " Ibn ‘Umr said:                      The prophet (ﷺ) prostrated himself in the noon prayer; then he stood up and bowed, and we knew that he recited Tanzil al-sajdah(surah xxxii).Ibn ‘Isa said: No one narrated this tradition to Umayyah except Mu’tamir.",
      "chain": [
        "31167",
        "20288",
        "20472",
        "20468",
        "11289",
        "11313",
        "18"
      ]
    },
    {
      "hadith_no": "846",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا عبد الله بن نمير، وأبو معاوية ووكيع ومحمد بن عبيد كلهم عن الأعمش، عن عبيد بن الحسن، سمعت عبد الله بن أبي أوفى، يقول كان رسول الله صلى الله عليه وسلم إذا رفع رأسه من الركوع يقول ‏\"‏ سمع الله لمن حمده اللهم ربنا لك الحمد ملء السموات وملء الأرض وملء ما شئت من شىء بعد ‏\"‏ ‏.‏ قال أبو داود قال سفيان الثوري وشعبة بن الحجاج عن عبيد أبي الحسن بهذا الحديث ليس فيه بعد الركوع ‏.‏ قال سفيان لقينا الشيخ عبيدا أبا الحسن بعد فلم يقل فيه بعد الركوع ‏.‏ قال أبو داود ورواه شعبة عن أبي عصمة عن الأعمش عن عبيد قال ‏\"‏ بعد الركوع ‏\"‏ ‏.‏",
      "text_en": " Abd Allah b. Abi Awfa said:                      When the Messenger of Allah (ﷺ) raised his head after bowing, he said: Allah listens to him who praises Him. O Allah, our lord, to Thee be the praise in the heavens and in all the earth, and all that it please Thee to create afterwards.Abu Dawud said: Sufyan al-Thawri and Shu’bah b. al-Hajjaj reported on authority of Ubaid b. al-Hasan: There is no mention of the words “after bowing” in this tradition. Sufyan said: we met al-shaikh ‘Ubaid b. al-Hasan; he did not say the words “bowing” in it.Abu dawud said: Shu’bah narrated this from Abi ‘Ismah, from al-A’mash, on the authority of ‘Ubaid, saying: “after bowing”.",
      "chain": [
        "31167",
        "20331",
        "11060",
        "10796",
        "5115"
      ]
    },
    {
      "hadith_no": "949",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا هشيم، أخبرنا إسماعيل بن أبي خالد، عن الحارث بن شبيل، عن أبي عمرو الشيباني، عن زيد بن أرقم، قال كان أحدنا يكلم الرجل إلى جنبه في الصلاة فنزلت ‏{‏ وقوموا لله قانتين ‏}‏ فأمرنا بالسكوت ونهينا عن الكلام ‏.‏",
      "text_en": " Zaid b. Arqam said ; One of us used to speak to the man standing by his side during prayer. Then the Quranic verse “ And stand up with devotion to Allah”",
      "chain": [
        "31167",
        "20468",
        "11418",
        "11681",
        "11343",
        "384"
      ]
    },
    {
      "hadith_no": "1083",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا حسان بن إبراهيم، عن ليث، عن مجاهد، عن أبي الخليل، عن أبي قتادة، عن النبي صلى الله عليه وسلم أنه كره الصلاة نصف النهار إلا يوم الجمعة وقال ‏\"‏ إن جهنم تسجر إلا يوم الجمعة ‏\"‏ ‏.‏ قال أبو داود هو مرسل مجاهد أكبر من أبي الخليل وأبو الخليل لم يسمع من أبي قتادة ‏.‏",
      "text_en": " Narrated AbuQatadah:                     The Prophet (ﷺ) disapproved of the offering of prayer at the meridian except on Friday. The Hell-fire is kindled except on Friday.Abu Dawud said: This is a mursal tradition (i.e. the successor is narrating it directly from the Prophet). Mujahid is older than Abu al-Khalil, and Abu al-Khalil did not hear (any tradition from) Abu Qatadah.",
      "chain": [
        "31167",
        "20417",
        "20023",
        "11028",
        "11291",
        "391"
      ]
    },
    {
      "hadith_no": "1250",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا ابن علية، حدثنا داود بن أبي هند، حدثني النعمان بن سالم، عن عمرو بن أوس، عن عنبسة بن أبي سفيان، عن أم حبيبة، قالت قال النبي صلى الله عليه وسلم ‏\"‏ من صلى في يوم ثنتى عشرة ركعة تطوعا بني له بهن بيت في الجنة ‏\"‏ ‏.‏",
      "text_en": " Narrated Umm Habibah:                     The Prophet (ﷺ) as saying: If anyone prays in a day and a night twelve rak'ahs voluntarily (supererogatory prayer), a house will be built from him in Paradise on account of these (rak'ahs).",
      "chain": [
        "31167",
        "20208",
        "11585",
        "10972",
        "11437",
        "846",
        "59"
      ]
    },
    {
      "hadith_no": "1319",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا يحيى بن زكريا، عن عكرمة بن عمار، عن محمد بن عبد الله الدؤلي، عن عبد العزيز بن أخي، حذيفة عن حذيفة، قال ‏:‏ كان النبي صلى الله عليه وسلم إذا حزبه أمر صلى ‏.‏",
      "text_en": " Hudhaifah said:                      When anything distressed the Prophet (ﷺ), he prayed.",
      "chain": [
        "31167",
        "10704",
        "145"
      ]
    },
    {
      "hadith_no": "1353",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا هشيم، أخبرنا حصين، عن حبيب بن أبي ثابت، ح وحدثنا عثمان بن أبي شيبة، حدثنا محمد بن فضيل، عن حصين، عن حبيب بن أبي ثابت، عن محمد بن علي بن عبد الله بن عباس، عن أبيه، عن ابن عباس، ‏:‏ أنه رقد عند النبي صلى الله عليه وسلم فرآه استيقظ فتسوك وتوضأ وهو يقول ‏:‏ ‏{‏ إن في خلق السموات والأرض ‏}‏ حتى ختم السورة، ثم قام فصلى ركعتين أطال فيهما القيام والركوع والسجود، ثم إنه انصرف فنام حتى نفخ، ثم فعل ذلك ثلاث مرات بست ركعات، كل ذلك يستاك ثم يتوضأ ويقرأ هؤلاء الآيات، ثم أوتر - قال عثمان ‏:‏ بثلاث ركعات، فأتاه المؤذن فخرج إلى الصلاة - وقال ابن عيسى ‏:‏ ثم أوتر فأتاه بلال فآذنه بالصلاة حين طلع الفجر، فصلى ركعتى الفجر ثم خرج إلى الصلاة - ثم اتفقا - وهو يقول ‏:‏ ‏\"‏ اللهم اجعل في قلبي نورا، واجعل في لساني نورا، واجعل في سمعي نورا، واجعل في بصري نورا، واجعل خلفي نورا، وأمامي نورا، واجعل من فوقي نورا، ومن تحتي نورا، اللهم وأعظم لي نورا ‏\"‏ ‏.‏",
      "text_en": " 'Abd Allah b. 'Abbas said that he slept with the Prophet (ﷺ). He saw that he (the Prophet) awoke, used tooth-stick, performed ablution, and recited:                      \"In the creation of the heavens and earth\" [3:190] to the end of the surah. Then he stood up and prayed two rak'ahs in which he prolonged the standing, bowing, and prostrations. He then uttered turned away and slept till he bagan to snore. This he did three times. This made six rak'ahs in all. He would use tooth-stick, then perform ablution, and recite those verses. He then observed the witr prayer. The version of 'Uthman has: with three rak'ahs. The mu'adhdhin then came to him and he went out for prayer. The version of Ibn 'Isa adds: He then observed witr prayer ; then Bilal came to him and called him for prayer when the dawn broke. He then prayed the two rak'ahs of the dawn prayer. He then went out for prayer. Then both the narrators were agreed: He beagan to supplicate saying: O Allah, place light in my heart, light in my tongue, light in my hearing, light in my eyesight, light on my right hand, light on my left hand, light in front of me, light behing me, light below me, O Allah, give me abundant light.",
      "chain": [
        "31167",
        "20468",
        "15097",
        "11331",
        "30203",
        "20356",
        "15097",
        "11331",
        "10961",
        "10949"
      ]
    },
    {
      "hadith_no": "1506",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا محمد بن عيسى، قال حدثنا ابن علية، عن الحجاج بن أبي عثمان، عن أبي الزبير، قال سمعت عبد الله بن الزبير، على المنبر يقول كان النبي صلى الله عليه وسلم إذا انصرف من الصلاة يقول ‏\"‏ لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شىء قدير لا إله إلا الله مخلصين له الدين ولو كره الكافرون أهل النعمة والفضل والثناء الحسن لا إله إلا الله مخلصين له الدين ولو كره الكافرون ‏\"‏ ‏.‏",
      "text_en": " Abu Zubair said:                      \"I heard 'Abd Allah b. al-Zubair saying on the pulpit: When the Prophet (ﷺ) finished the prayer, he used to say (at the end of the prayer): 'There is no God but Allah, Alone, Who has no partner, to Him belongs the Kingdom, to Him praise is due, and He is Omnipotent. There is no God but Allah to Whom we are sincere in devotion, even though the infidels should disapprove. To Him belongs wealth, to Him belongs grace and to Him is worthy accorded. There is no got but Allah to Whom we are sincere in devotion, even though infidels should disapprove.",
      "chain": [
        "31167",
        "20208",
        "11277",
        "11263",
        "106"
      ]
    },
    {
      "hadith_no": "1533",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا أبو عوانة، عن الأسود بن قيس، عن نبيح العنزي، عن جابر بن عبد الله، أن امرأة، قالت للنبي صلى الله عليه وسلم صل على وعلى زوجي ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ صلى الله عليك وعلى زوجك ‏\"‏ ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     A woman said to the Prophet (ﷺ): Invoke blessing on me as well as on my husband. The Prophet (ﷺ) said: May Allah send blessing on you and your husband.",
      "chain": [
        "31167",
        "20469",
        "11323",
        "34"
      ]
    },
    {
      "hadith_no": "1564",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا عتاب، - يعني ابن بشير - عن ثابت بن عجلان، عن عطاء، عن أم سلمة، قالت كنت ألبس أوضاحا من ذهب فقلت يا رسول الله أكنز هو فقال ‏\"‏ ما بلغ أن تؤدى زكاته فزكي فليس بكنز ‏\"‏ ‏.‏",
      "text_en": " Narrated Umm Salamah, Ummul Mu'minin:                     I used to wear gold ornaments. I asked: Is that a treasure (kanz), Messenger of Allah? He replied: whatever reaches a quantity on which zakat is payable is not a treasure (kanz) when the zakat is paid.",
      "chain": [
        "31167",
        "20446",
        "11676",
        "11029",
        "56"
      ]
    },
    {
      "hadith_no": "1744",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن عيسى، وإسماعيل بن إبراهيم أبو معمر، قالا حدثنا مروان بن شجاع، عن خصيف، عن عكرمة، ومجاهد، وعطاء، عن ابن عباس، أن النبي صلى الله عليه وسلم قال ‏\"‏ الحائض والنفساء إذا أتتا على الوقت تغتسلان وتحرمان وتقضيان المناسك كلها غير الطواف بالبيت ‏\"‏ ‏.‏ قال أبو معمر في حديثه حتى تطهر ولم يذكر ابن عيسى عكرمة ومجاهدا قال عن عطاء عن ابن عباس ولم يقل ابن عيسى ‏\"‏ كلها ‏\"‏ ‏.‏ قال ‏\"‏ المناسك إلا الطواف بالبيت ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Prophet (ﷺ) said: A menstruating woman and the one who delivered a child should take a bath, put on ihram and perform all the rites of hajj except circumambulation of the House (Ka'bah) when they came to the place of wearing ihram. Abu Ma'mar said in his version: \"till she is purified\". The narrator Ibn Isa did not mention the names of Ikrimah and Mujahid, but he said: from Ata on the authority of Ibn Abbas. Ibn Isa also did not mention the word \"all (rites of hajj).\" He said in his version: All the rites of hajj except circumambulation of the House (the Ka'bah).",
      "chain": [
        "31167",
        "20208",
        "20388",
        "19908",
        "11023",
        "11028",
        "11029",
        "17"
      ]
    },
    {
      "hadith_no": "1820",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا أبو عوانة، عن أبي بشر، عن عطاء، عن يعلى بن أمية، وهشيم، عن الحجاج، عن عطاء، عن صفوان بن يعلى، عن أبيه، بهذه القصة قال فيه فقال له النبي صلى الله عليه وسلم ‏\"‏ اخلع جبتك ‏\"‏ ‏.‏ فخلعها من رأسه وساق الحديث ‏.‏",
      "text_en": " This tradition has also been narrated by Ya’la bin Umayyah through a different chain of narrators. This version adds The Prophet (ﷺ) said to him “Take off your tunic”. He then took it off from his head. The narrator then narrated the rest of the tradition.",
      "chain": [
        "31167",
        "20469",
        "11419",
        "11029",
        "20468",
        "20381",
        "11029",
        "11248"
      ]
    },
    {
      "hadith_no": "1853",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا حماد، عن ميمون بن جابان، عن أبي رافع، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ الجراد من صيد البحر ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the Prophet (ﷺ) as saying “Locusts are counted along with what is caught in the sea (i.e., the game of the sea).”",
      "chain": [
        "31167",
        "20022",
        "479",
        "13"
      ]
    },
    {
      "hadith_no": "2136",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا يحيى بن معين، ومحمد بن عيسى، - المعنى - قالا حدثنا عباد بن عباد، عن عاصم، عن معاذة، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يستأذننا إذا كان في يوم المرأة منا بعد ما نزلت ‏{‏ ترجي من تشاء منهن وتؤوي إليك من تشاء ‏}‏ قالت معاذة فقلت لها ما كنت تقولين لرسول الله صلى الله عليه وسلم قالت كنت أقول إن كان ذلك إلى لم أوثر أحدا على نفسي ‏.‏",
      "text_en": " Narrated 'Aishah:                     The Messenger of Allah (ﷺ) used to aske our permission on the day he had to stay with one of his wives (by turns) after the following Qur'anic verse was revealed: \"You may distance those whom you like, and draw close to those whom you like\" [33:51]. The narrator Mu'adhah said: I said to her: What did you say to the Messenger of Allah (ﷺ) ? She said: I used to say: If had an option for that, I would not preferred anyone to myself.",
      "chain": [
        "30020",
        "31167",
        "20243",
        "11080",
        "11456",
        "53"
      ]
    },
    {
      "hadith_no": "2161",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا جرير، عن منصور، عن سالم بن أبي الجعد، عن كريب، عن ابن عباس، قال قال النبي صلى الله عليه وسلم ‏\"‏ لو أن أحدكم إذا أراد أن يأتي أهله قال بسم الله اللهم جنبنا الشيطان وجنب الشيطان ما رزقتنا ثم قدر أن يكون بينهما ولد في ذلك لم يضره شيطان أبدا ‏\"‏ ‏.‏",
      "text_en": " Ibn ‘Abbas reported the Prophet (ﷺ) as saying “If anyone who means to have intercourse with his wife says “In the name of Allaah, O Allaah, keep us away from the devil and keep the devil away from what You hast provided us.” It will be ordained that no devil will ever harm the child born to them.",
      "chain": [
        "31167",
        "20028",
        "11067",
        "11342",
        "11211",
        "17"
      ]
    },
    {
      "hadith_no": "2225",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "قال أبو داود سمعت محمد بن عيسى، يحدث به حدثنا المعتمر، قال سمعت الحكم بن أبان، يحدث بهذا الحديث ولم يذكر ابن عباس قال عن عكرمةقال أبو داود كتب إلى الحسين بن حريث قال أخبرنا الفضل بن موسى، عن معمر، عن الحكم بن أبان، عن عكرمة، عن ابن عباس، بمعناه عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Abu Dawud said “I heard Muhammad bin Isa narrating this tradition who said Mu’tamar narrated it to us. And he (Mu’tamar) said “ I heard Al Hakam bin Aban narrating this tradition. He did not mention the name of Ibn ‘Abbas.Abu Dawud said “Al Hussain bin Huraith wrote to me saying “Al Fadl bin Musa narrated from Ibn ‘Abbas to the same effect from the Prophet(ﷺ).",
      "chain": [
        "30002",
        "31167",
        "20288",
        "19904",
        "20452",
        "20115",
        "19904",
        "11023"
      ]
    },
    {
      "hadith_no": "2279",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا سفيان، عن أبي فروة، عن عبد الرحمن بن أبي ليلى، بهذا الخبر وليس بتمامه قال وقضى بها لجعفر وقال ‏\"‏ إن خالتها عنده ‏\"‏ ‏.‏",
      "text_en": " This tradition has been narrated by ‘Abd Al Rahman bin Abi Laila through a different chain of narrators. This version has “He decided that she would be given to Ja’far and said “Her maternal aunt is with him(i.e., his wife).",
      "chain": [
        "31167",
        "20012",
        "11653",
        "11196"
      ]
    },
    {
      "hadith_no": "2348",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا ملازم بن عمرو، عن عبد الله بن النعمان، حدثني قيس بن طلق، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ كلوا واشربوا ولا يهيدنكم الساطع المصعد فكلوا واشربوا حتى يعترض لكم الأحمر ‏\"‏ ‏.‏ قال أبو داود هذا مما تفرد به أهل اليمامة ‏.‏",
      "text_en": " Narrated Talq ibn Ali al-Yamami:                     The Messenger of Allah (ﷺ) said: Eat and drink; let not the white and ascending light prevent you from (eating and drinking); so eat and drink until the red light spreads horizontally.",
      "chain": [
        "31167",
        "20743",
        "18585",
        "19937",
        "5103"
      ]
    },
    {
      "hadith_no": "2386",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا محمد بن دينار، حدثنا سعد بن أوس العبدي، عن مصدع أبي يحيى، عن عائشة، أن النبي صلى الله عليه وسلم كان يقبلها وهو صائم ويمص لسانها ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     The Prophet (ﷺ) used to kiss her and suck her tongue when he was fasting.",
      "chain": [
        "31167",
        "24396",
        "20722",
        "53"
      ]
    },
    {
      "hadith_no": "2390",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا مسدد، ومحمد بن عيسى، - المعنى - قالا حدثنا سفيان، - قال مسدد - حدثنا الزهري، عن حميد بن عبد الرحمن، عن أبي هريرة، قال أتى رجل النبي صلى الله عليه وسلم فقال هلكت ‏.‏ فقال ‏\"‏ ما شأنك ‏\"‏ ‏.‏ قال وقعت على امرأتي في رمضان ‏.‏ قال ‏\"‏ فهل تجد ما تعتق رقبة ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ فهل تستطيع أن تصوم شهرين متتابعين ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ فهل تستطيع أن تطعم ستين مسكينا ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ اجلس ‏\"‏ ‏.‏ فأتي النبي صلى الله عليه وسلم بعرق فيه تمر فقال ‏\"‏ تصدق به ‏\"‏ ‏.‏ فقال يا رسول الله ما بين لابتيها أهل بيت أفقر منا فضحك رسول الله صلى الله عليه وسلم حتى بدت ثناياه قال ‏\"‏ فأطعمه إياهم ‏\"‏ ‏.‏ وقال مسدد في موضع آخر أنيابه ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     A man came to the Prophet (ﷺ) and said: I am undone. He asked him: What has happened to you ? He said: I had intercourse with my wife in Ramadan (while I was fasting). He asked: Can you set a slave free ? He said: No. He again asked: Can you fast for two consecutive months ? He said: No. He asked: Can you provide food for sixty poor people ? He said: No. He said: Sit down. Then a huge basket containing dates ('araq) was brought to the Prophet (ﷺ). He then said to him: Give it as sadaqah (i.e. alms). He said: Messenger of Allah, there is no poorer family than mine between the two lave plains of it (Medina). The Messenger of Allah (ﷺ) laughed so that his eye-teeth became visible, and said: Give it to your family to eat. Musaddad said in another place: \"his canine teeth\".",
      "chain": [
        "30175",
        "31167",
        "20012",
        "30175",
        "11013",
        "10561",
        "13"
      ]
    },
    {
      "hadith_no": "2448",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا أحمد بن حنبل، ومحمد بن عيسى، ومسدد، - والإخبار في حديث أحمد - قالوا حدثنا سفيان قال سمعت عمرا قال أخبرني عمرو بن أوس سمعه من عبد الله بن عمرو قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ أحب الصيام إلى الله تعالى صيام داود وأحب الصلاة إلى الله صلاة داود كان ينام نصفه ويقوم ثلثه وينام سدسه وكان يفطر يوما ويصوم يوما ‏\"‏ ‏.‏",
      "text_en": " 'Abd Allah b. 'And (b. al-'As) said:                      The Messenger of Allah (ﷺ) said to me: The fast most liked by Allah is the one observed by Dawud (David), and the prayer dearer to Allah is the one offered by Dawud (David): he would sleep half the night, and stand (in prayer) one-third of it, and sleep one-sixth of it. He would go without fasting one day, and fast the other day.",
      "chain": [
        "30007",
        "31167",
        "20005",
        "3",
        "11437"
      ]
    },
    {
      "hadith_no": "2472",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، ومحمد بن عيسى، قالا حدثنا عبد السلام بن حرب، أخبرنا الليث بن أبي سليم، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، - قال النفيلي - قالت كان النبي صلى الله عليه وسلم يمر بالمريض وهو معتكف فيمر كما هو ولا يعرج يسأل عنه ‏.‏ وقال ابن عيسى قالت إن كان النبي صلى الله عليه وسلم يعود المريض وهو معتكف ‏.‏",
      "text_en": " According to the version of Al Nufaili, A’ishah said “The Prophet (ﷺ) used to pass by a patient while he was observing I’tikaf(in the mosque) but he passed as usual and did not stay asking about him.”According to the version of Ibn Isa she said “The Prophet (ﷺ) would visit a patient while he was observing I’tikaf.”",
      "chain": [
        "30352",
        "31167",
        "20248",
        "10957",
        "10530",
        "10535",
        "53",
        "30352"
      ]
    },
    {
      "hadith_no": "2476",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا محمد بن عيسى، وقتيبة بن سعيد، قالا حدثنا يزيد، عن خالد، عن عكرمة، عن عائشة، - رضى الله عنها - قالت اعتكفت مع النبي صلى الله عليه وسلم امرأة من أزواجه فكانت ترى الصفرة والحمرة فربما وضعنا الطست تحتها وهي تصلي ‏.‏",
      "text_en": " A’ishah(may Allaah be pleased with her) said “One of the wives of the Apostle of Allaah(ﷺ) observed I’tikaf along with him (in the mosque). She would see yellowness and redness. Sometimes we would place a washbasin while she prayed.”",
      "chain": [
        "31167",
        "30367",
        "20304",
        "11282",
        "11023",
        "53"
      ]
    },
    {
      "hadith_no": "2664",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا إسحاق بن نجيح، - وليس بالملطي - عن مالك بن حمزة بن أبي أسيد الساعدي، عن أبيه، عن جده، قال قال النبي صلى الله عليه وسلم يوم بدر ‏\"‏ إذا أكثبوكم فارموهم بالنبل ولا تسلوا السيوف حتى يغشوكم ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuUsayd as-Sa'idi:                     The Prophet (ﷺ) said at the battle of Badr: When they come near you shoot arrows at them; and do not draw swords at them until they come near you.",
      "chain": [
        "31167",
        "26502"
      ]
    },
    {
      "hadith_no": "2666",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن عيسى، وزياد بن أيوب، قالا حدثنا هشيم، أخبرنا مغيرة، عن شباك، عن إبراهيم، عن هنى بن نويرة، عن علقمة، عن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أعف الناس قتلة أهل الإيمان ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     The Prophet (ﷺ) said: The most merciful of the people in respect of killing are believers (in Allah).",
      "chain": [
        "31167",
        "30249",
        "20468",
        "11072",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "2736",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا مجمع بن يعقوب بن مجمع بن يزيد الأنصاري، قال سمعت أبي يعقوب بن مجمع، يذكر عن عمه عبد الرحمن بن يزيد الأنصاري، عن عمه، مجمع بن جارية الأنصاري وكان أحد القراء الذين قرءوا القرآن قال شهدنا الحديبية مع رسول الله صلى الله عليه وسلم فلما انصرفنا عنها إذا الناس يهزون الأباعر فقال بعض الناس لبعض ما للناس قالوا أوحي إلى رسول الله صلى الله عليه وسلم ‏.‏ فخرجنا مع الناس نوجف فوجدنا النبي صلى الله عليه وسلم واقفا على راحلته عند كراع الغميم فلما اجتمع عليه الناس قرأ عليهم ‏{‏ إنا فتحنا لك فتحا مبينا ‏}‏ فقال رجل يا رسول الله أفتح هو قال ‏\"‏ نعم والذي نفس محمد بيده إنه لفتح ‏\"‏ ‏.‏ فقسمت خيبر على أهل الحديبية فقسمها رسول الله صلى الله عليه وسلم على ثمانية عشر سهما وكان الجيش ألفا وخمسمائة فيهم ثلاثمائة فارس فأعطى الفارس سهمين وأعطى الراجل سهما ‏.‏ قال أبو داود حديث أبي معاوية أصح والعمل عليه وأرى الوهم في حديث مجمع أنه قال ثلاثمائة فارس وكانوا مائتى فارس ‏.‏",
      "text_en": " Narrated Mujammi' ibn Jariyah al-Ansari:                     Mujammi' was one of the Qur'an-reciters (qaris), and he said: We were present with the Messenger of Allah (ﷺ) at al-Hudaybiyyah. When we returned, the people were driving their camels quickly.  The people said to one another: What is the matter with them?  They said: Revelation has come down to the Prophet (ﷺ). We also proceeded with the people, galloping (our camels). We found the Prophet (ﷺ) standing on his riding-animal at Kura' al-Ghamim.  When the people gathered near him, he recited: \"Verily We have granted thee a manifest victory.  A man asked: Is this a victory, Messenger of Allah?  He replied: Yes. By Him in Whose hands the soul of Muhammad is, this is a victory. Khaybar was divided among those who had been at al-Hudaybiyyah, and the Messenger of Allah (ﷺ) divided it into eighteen portions. The army consisted of one thousand five hundred men, of which three hundred were cavalry, and he gave two shares to a horseman and one to a foot-soldier.Abu Dawud said: Abu Mu'awiyah's tradition is sounder, and it is one which is followed. I think the error is in the tradition of Mujammi', because he said: \"three hundred horsemen.\" when there were only two hundred.",
      "chain": [
        "31167",
        "22207"
      ]
    },
    {
      "hadith_no": "2847",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Game (Kitab Al-Said) - كتاب الصيد",
      "chapter_no": "17",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا جرير، عن منصور، عن إبراهيم، عن همام، عن عدي بن حاتم، قال سألت النبي صلى الله عليه وسلم قلت إني أرسل الكلاب المعلمة فتمسك على أفآكل قال ‏\"‏ إذا أرسلت الكلاب المعلمة وذكرت اسم الله فكل مما أمسكن عليك ‏\"‏ ‏.‏ قلت وإن قتلن قال ‏\"‏ وإن قتلن ما لم يشركها كلب ليس منها ‏\"‏ ‏.‏ قلت أرمي بالمعراض فأصيب أفآكل قال ‏\"‏ إذا رميت بالمعراض وذكرت اسم الله فأصاب فخزق فكل وإن أصاب بعرضه فلا تأكل ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Abi b. Hatim:                     I asked the Prophet (ﷺ) ,and said: I set off my trained dogs, and they catch (something) for me: may I eat (it)? He said: When you set off trained dogs and mention Allah's name, eat what they catch for you. I said: Even if they killed (the game)? He said: Even if they killed (the game) as long as another dog does not join it. I said: I shoot with a featherless arrow, and it strikes the target, may I eat (it) ? He said: If you shoot with a featherless arrow and mention Allah's name, and it strikes the aim, and pierce it, eat it ; and if it strikes with its middle, do not eat (it).",
      "chain": [
        "31167",
        "20028",
        "11067",
        "11051",
        "11447",
        "212"
      ]
    },
    {
      "hadith_no": "2852",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Game (Kitab Al-Said) - كتاب الصيد",
      "chapter_no": "17",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا هشيم، حدثنا داود بن عمرو، عن بسر بن عبيد الله، عن أبي إدريس الخولاني، عن أبي ثعلبة الخشني، قال قال رسول الله صلى الله عليه وسلم في صيد الكلب ‏\"‏ إذا أرسلت كلبك وذكرت اسم الله فكل وإن أكل منه وكل ما ردت عليك يداك ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuTha'labah al-Khushani:                     The Messenger of Allah (ﷺ) said about the game hunted by a dog: If you set off your dog and have mentioned Allah's name, eat (it),  even if it eats any of it; and eat what your hands return you.",
      "chain": [
        "31167",
        "20468",
        "30504",
        "11412",
        "11027",
        "4056"
      ]
    },
    {
      "hadith_no": "2860",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Game (Kitab Al-Said) - كتاب الصيد",
      "chapter_no": "17",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا محمد بن عبيد، حدثنا الحسن بن الحكم النخعي، عن عدي بن ثابت، عن شيخ، من الأنصار عن أبي هريرة، عن النبي صلى الله عليه وسلم بمعنى مسدد قال ‏\"‏ ومن لزم السلطان افتتن ‏\"‏ ‏.‏ زاد ‏\"‏ وما ازداد عبد من السلطان دنوا إلا ازداد من الله بعدا ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: He said: He who sticks to a king is perverted. This version adds: The nearer a servant (of Allah) goes to a king, the farther he keeps away from Allah.",
      "chain": [
        "31167",
        "30213",
        "15089",
        "11372",
        "13"
      ]
    },
    {
      "hadith_no": "2990",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا عنبسة بن عبد الواحد القرشي، قال أبو جعفر - يعني ابن عيسى - كنا نقول إنه من الأبدال قبل أن نسمع أن الأبدال من الموالي قال حدثني الدخيل بن إياس بن نوح بن مجاعة عن هلال بن سراج بن مجاعة عن أبيه عن جده مجاعة أنه أتى النبي صلى الله عليه وسلم يطلب دية أخيه قتلته بنو سدوس من بني ذهل ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ لو كنت جاعلا لمشرك دية جعلت لأخيك ولكن سأعطيك منه عقبى ‏\"‏ ‏.‏ فكتب له النبي صلى الله عليه وسلم بمائة من الإبل من أول خمس يخرج من مشركي بني ذهل فأخذ طائفة منها وأسلمت بنو ذهل فطلبها بعد مجاعة إلى أبي بكر وأتاه بكتاب النبي صلى الله عليه وسلم فكتب له أبو بكر باثنى عشر ألف صاع من صدقة اليمامة أربعة آلاف برا وأربعة آلاف شعيرا وأربعة آلاف تمرا وكان في كتاب النبي صلى الله عليه وسلم لمجاعة ‏\"‏ بسم الله الرحمن الرحيم هذا كتاب من محمد النبي لمجاعة بن مرارة من بني سلمى إني أعطيته مائة من الإبل من أول خمس يخرج من مشركي بني ذهل عقبة من أخيه ‏\"‏ ‏.‏",
      "text_en": " Narrated Mujja'ah ibn Mirarah al-Yamani:                     Mujja'ah went to the Prophet (ﷺ) asking him for the blood-money of his brother whom Banu Sadus from Banu Dhuhl had killed.  The Prophet (ﷺ) said: Had I appointed blood-money for a polytheist, I should have appointed it for your brother. But I shall give you compensation for him. So the Prophet (ﷺ) wrote (a document) for him that he should be given a hundred camels which were to be acquired from the fifth taken from the polytheists of Banu Dhuhl. So he took a part of them, for Banu Dhuhl embraced Islam.  He then asked AbuBakr for them later on, and brought to him the document of the Prophet (ﷺ). So AbuBakr wrote for him that he should be given one thousand two hundred sa's from the sadaqah of al-Yamamah; four thousand (sa's) of wheat, four thousand (sa's) of barley, and four thousand (sa's) of dates.  The text of the document written by the Prophet (ﷺ) for Mujja'ah was as follows: \"In the name of Allah, the Beneficent, the Merciful. This document is from Muhammad, the Prophet, to Mujja'ah ibn Mirarah of Banu Sulma. I have given him one hundred camels from the first fifth acquired from the polytheist of Banu Dhuhl as a compensation for his brother.\"",
      "chain": [
        "31167",
        "25222"
      ]
    },
    {
      "hadith_no": "3015",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا مجمع بن يعقوب بن مجمع بن يزيد الأنصاري، قال سمعت أبي يعقوب بن مجمع، يذكر لي عن عمه عبد الرحمن بن يزيد الأنصاري، عن عمه، مجمع بن جارية الأنصاري - وكان أحد القراء الذين قرءوا القرآن - قال قسمت خيبر على أهل الحديبية فقسمها رسول الله صلى الله عليه وسلم على ثمانية عشر سهما وكان الجيش ألفا وخمسمائة فيهم ثلاثمائة فارس فأعطى الفارس سهمين وأعطى الراجل سهما ‏.‏",
      "text_en": " Narrated Mujammi' ibn Jariyah al-Ansari,:                     Khaybar was divided among the people of al-Hudaybiyyah. The Messenger of Allah (ﷺ) divided it into eighteen portions. The army contained one thousand and five hundred people. There were three hundred horsemen among them. He gave double share to the horsemen, and a single to the footmen.",
      "chain": [
        "31167",
        "22207"
      ]
    },
    {
      "hadith_no": "3050",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا أشعث بن شعبة، حدثنا أرطاة بن المنذر، قال سمعت حكيم بن عمير أبا الأحوص، يحدث عن العرباض بن سارية السلمي، قال نزلنا مع النبي صلى الله عليه وسلم خيبر ومعه من معه من أصحابه وكان صاحب خيبر رجلا ماردا منكرا فأقبل إلى النبي صلى الله عليه وسلم فقال يا محمد ألكم أن تذبحوا حمرنا وتأكلوا ثمرنا وتضربوا نساءنا فغضب يعني النبي صلى الله عليه وسلم وقال ‏\"‏ يا ابن عوف اركب فرسك ثم ناد ألا إن الجنة لا تحل إلا لمؤمن وأن اجتمعوا للصلاة ‏\"‏ ‏.‏ قال فاجتمعوا ثم صلى بهم النبي صلى الله عليه وسلم ثم قام فقال ‏\"‏ أيحسب أحدكم متكئا على أريكته قد يظن أن الله لم يحرم شيئا إلا ما في هذا القرآن ألا وإني والله قد وعظت وأمرت ونهيت عن أشياء إنها لمثل القرآن أو أكثر وأن الله عز وجل لم يحل لكم أن تدخلوا بيوت أهل الكتاب إلا بإذن ولا ضرب نسائهم ولا أكل ثمارهم إذا أعطوكم الذي عليهم ‏\"‏ ‏.‏",
      "text_en": " Narrated Al-Irbad ibn Sariyah as-Sulami:                     We alighted with the Prophet (ﷺ) at Khaybar, and he had his companions with him. The chief of Khaybar was a defiant and abominable man.  He came to the Prophet (ﷺ) and said: Is it proper for you, Muhammad, that you slaughter our donkeys, eat our fruit, and beat our women?  The Prophet (ﷺ) became angry and said: Ibn Awf, ride your horse, and call loudly: Beware, Paradise is lawful only for a believer, and that they (the people) should gather for prayer.  They gathered and the Prophet (ﷺ) led them in prayer, stood up and said: Does any of you, while reclining on his couch, imagine that Allah has prohibited only that which is to be found in this Qur'an? By Allah, I have preached, commanded and prohibited various matters as numerous as that which is found in the Qur'an, or more numerous. Allah has not permitted you to enter the houses of the people of the Book without permission, or beat their women, or eat their fruits when they give you that which is imposed on them.",
      "chain": [
        "31167",
        "28050",
        "18017",
        "17017",
        "5172"
      ]
    },
    {
      "hadith_no": "3091",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا محمد بن عيسى، ومسدد، - المعنى - قالا حدثنا هشيم، عن العوام بن حوشب، عن إبراهيم بن عبد الرحمن السكسكي، عن أبي بردة، عن أبي موسى، قال سمعت النبي صلى الله عليه وسلم غير مرة ولا مرتين يقول ‏\"‏ إذا كان العبد يعمل عملا صالحا فشغله عنه مرض أو سفر كتب له كصالح ما كان يعمل وهو صحيح مقيم ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Musa:                     I heard the Prophet (ﷺ) many times say: When a servant of Allah is accustomed to do a good work, then becomes ill or goes on journey, what was accustomed to do when he was well and staying at home will be recorded for him.",
      "chain": [
        "31167",
        "20468",
        "11441",
        "11619",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "3243",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا محمد بن عيسى، وهناد بن السري، - المعنى - قالا حدثنا أبو معاوية، حدثنا الأعمش، عن شقيق، عن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من حلف على يمين هو فيها فاجر ليقتطع بها مال امرئ مسلم لقي الله وهو عليه غضبان ‏\"‏ ‏.‏ فقال الأشعث في والله كان ذلك كان بيني وبين رجل من اليهود أرض فجحدني فقدمته إلى النبي صلى الله عليه وسلم فقال لي النبي صلى الله عليه وسلم ‏\"‏ ألك بينة ‏\"‏ ‏.‏ قلت لا ‏.‏ قال لليهودي ‏\"‏ احلف ‏\"‏ ‏.‏ قلت يا رسول الله إذا يحلف ويذهب بمالي فأنزل الله تعالى ‏{‏ إن الذين يشترون بعهد الله وأيمانهم ثمنا قليلا ‏}‏ إلى آخر الآية ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     The Messenger of Allah (ﷺ) said: He who swears an oath in which he tells a lie to take the property of a Muslim by unfair means, will meet Allah while He is angry with him.  Al-Ash'ath said: I swear by Allah, he said this about me. There was some land between me and a Jew, but he denied it to me; so I presented him to the Prophet (ﷺ).  The Prophet (ﷺ) asked me: Have you any evidence?  I replied: No.  He said to the Jew: Take an oath.  I said: Messenger of Allah, now he will take an oath and take my property.  So Allah, the Exalted, revealed the verse, \"As for those who sell the faith they owe to Allah and their own plighted word for a small price, they shall have no portion in the hereafter.\"",
      "chain": [
        "31167",
        "30480",
        "20354",
        "11060",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "3259",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا يحيى بن العلاء، عن محمد بن يحيى بن حبان، عن يوسف بن عبد الله بن سلام، قال ‏:‏ رأيت النبي صلى الله عليه وسلم وضع تمرة على كسرة فقال ‏:‏ ‏\"‏ هذه إدام هذه ‏\"‏ ‏.‏",
      "text_en": " Narrated Yusuf ibn Abdullah ibn Salam:                     I saw that the Prophet (ﷺ) put a date on a loaf and said: This is a thing eaten with bread (condiments).",
      "chain": [
        "31167",
        "28635",
        "11222",
        "5335"
      ]
    },
    {
      "hadith_no": "3262",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا محمد بن عيسى، ومسدد، - وهذا حديثه - قالا حدثنا عبد الوارث، عن أيوب، عن نافع، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏ من حلف فاستثنى فإن شاء رجع، وإن شاء ترك غير حنث ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     The Prophet (ﷺ) said: If anyone swears an oath and makes an exception, he may fulfil it if he wishes and break it if he wishes without any accountability for breaking.",
      "chain": [
        "31167",
        "30175",
        "20258",
        "11015",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3316",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا سليمان بن حرب، ومحمد بن عيسى، قالا حدثنا حماد، عن أيوب، عن أبي قلابة، عن أبي المهلب، عن عمران بن حصين، ‏:‏ قال كانت العضباء لرجل من بني عقيل وكانت من سوابق الحاج قال ‏:‏ فأسر فأتى النبي صلى الله عليه وسلم وهو في وثاق والنبي صلى الله عليه وسلم على حمار عليه قطيفة فقال ‏:‏ يا محمد علام تأخذني وتأخذ سابقة الحاج قال ‏:‏ ‏\"‏ نأخذك بجريرة حلفائك ثقيف ‏\"‏ ‏.‏ قال ‏:‏ وكان ثقيف قد أسروا رجلين من أصحاب النبي صلى الله عليه وسلم قال ‏:‏ وقد قال فيما قال ‏:‏ وأنا مسلم أو قال ‏:‏ وقد أسلمت ‏.‏ فلما مضى النبي صلى الله عليه وسلم - قال أبو داود ‏:‏ فهمت هذا من محمد بن عيسى - ناداه يا محمد يا محمد ‏.‏ قال ‏:‏ وكان النبي صلى الله عليه وسلم رحيما رفيقا فرجع إليه قال ‏:‏ ‏\"‏ ما شأنك ‏\"‏ ‏.‏ قال ‏:‏ إني مسلم ‏.‏ قال ‏:‏ ‏\"‏ لو قلتها وأنت تملك أمرك أفلحت كل الفلاح ‏\"‏ ‏.‏ قال أبو داود ‏:‏ ثم رجعت إلى حديث سليمان قال ‏:‏ يا محمد إني جائع فأطعمني إني ظمآن فاسقني ‏.‏ قال فقال النبي صلى الله عليه وسلم ‏:‏ ‏\"‏ هذه حاجتك ‏\"‏ ‏.‏ أو قال ‏:‏ ‏\"‏ هذه حاجته ‏\"‏ ‏.‏ قال ‏:‏ ففودي الرجل بعد بالرجلين ‏.‏ قال ‏:‏ وحبس رسول الله صلى الله عليه وسلم العضباء لرحله - قال - فأغار المشركون على سرح المدينة فذهبوا بالعضباء - قال - فلما ذهبوا بها وأسروا امرأة من المسلمين - قال - فكانوا إذا كان الليل يريحون إبلهم في أفنيتهم - قال - فنوموا ليلة وقامت المرأة فجعلت لا تضع يدها على بعير إلا رغا حتى أتت على العضباء - قال - فأتت على ناقة ذلول مجرسة - قال - فركبتها ثم جعلت لله عليها إن نجاها الله لتنحرنها - قال - فلما قدمت المدينة عرفت الناقة ناقة النبي صلى الله عليه وسلم فأخبر النبي صلى الله عليه وسلم بذلك فأرسل إليها، فجيء بها وأخبر بنذرها فقال ‏:‏ ‏\"‏ بئسما جزيتيها ‏\"‏ ‏.‏ أو ‏:‏ ‏\"‏ جزتها ‏\"‏ ‏.‏ ‏:‏ ‏\"‏ إن الله أنجاها عليها لتنحرنها، لا وفاء لنذر في معصية الله ولا فيما لا يملك ابن آدم ‏\"‏ ‏.‏ قال أبو داود ‏:‏ والمرأة هذه امرأة أبي ذر ‏.‏",
      "text_en": " 'Imran b. Husain said:                      'Adba belonged to a man of Banu 'Aqil. It used to go ahead of pligrims. The man was then captivated. He was brought in chains to the Prophet (ﷺ). The Prophet (ﷺ) was riding on a donkey with a blanket on him. He said: Muhammad, why do you arrest me and capture the one (i.e. the she-camel) which goes ahead of the pilgrims. He replied: We are arresting you on account of the crime committed by your allies Thaqid. Thaqif captivated two persons from among the Companions of the Prophet (ﷺ). He said (whatever he said) I am a Muslim, or he said: I have embraced Islam. When the Prophet (ﷺ) went ahead, he called him: O Muhammed, O Muhammed. Abu Dawud said: I learnt it from the version of the narrator Muhammad b. 'Isa. The Prophet (ﷺ) was compassionate and kind hearted. So he returned to him, and asked: What is the matter with you ? He replied: I am a Muslim. He said: Had you said it when the matter was in your hand, you would have succeeded completely. Abu Dawud said: I then returned to the version of the narrator Sulaiman (b. Harb). He said: Muhammad, I am hungry, so feed me. I am thirsty, so give me water. The Prophet (ﷺ) said: This is your need, or he said: This is his need (the narrator is doubtful). Later on the man was taken back (by Thaqif) as a ransom for the two men (of the Companions of the Prophet). The Prophet (ﷺ) retained 'Adba for his journey. The narrator said: The polytheists raided the pasturing animals of Medina and they took away 'Adba. When they took away 'Adba, they also captivated a Muslim woman. They used to leave their camels in the fields for rest at night. One night they slept and the (Muslim) woman stood up. Any camel on which she put her hand brayed until she came to 'Adba. She came to a she-camel which was docile and experienced. She then rode on her and vowed to Allah that if He saved her, she would sacrifice it. When she came to Medina, the people recognized the she-camel of the Prophet (ﷺ). The Prophet (ﷺ) was then informed about it and he sent for her. She was brought to him and she informed him about her vow. He said: It is a bad return that you have given it. Allah has not saved you, on its (back) that you now sacrifice it. A vow to do an act of disobedience must not be fulfilled, or to do something over which one has no control.Abu Dawud said: This woman was the wife of Abu Dharr.",
      "chain": [
        "20193",
        "31167",
        "20022",
        "11015",
        "11047",
        "123"
      ]
    },
    {
      "hadith_no": "3331",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا هشيم، أخبرنا عباد بن راشد، قال سمعت سعيد بن أبي خيرة، يقول حدثنا الحسن، منذ أربعين سنة عن أبي هريرة، قال قال النبي صلى الله عليه وسلم ح وحدثنا وهب بن بقية أخبرنا خالد عن داود - يعني ابن أبي هند - وهذا لفظه عن سعيد بن أبي خيرة عن الحسن عن أبي هريرة أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ليأتين على الناس زمان لا يبقى أحد إلا أكل الربا فإن لم يأكله أصابه من بخاره ‏\"‏ ‏.‏ قال ابن عيسى ‏\"‏ أصابه من غباره ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: A time is certainly coming to mankind when only the receiver of usury will remain, and if he does not receive it, some of its vapour will reach him. Ibn Isa said: Some of its dust will reach him.",
      "chain": [
        "31167",
        "20468",
        "20242",
        "14146",
        "13"
      ]
    },
    {
      "hadith_no": "3351",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن عيسى، وأبو بكر بن أبي شيبة وأحمد بن منيع قالوا حدثنا ابن المبارك، ح وحدثنا ابن العلاء، أخبرنا ابن المبارك، عن سعيد بن يزيد، حدثني خالد بن أبي عمران، عن حنش، عن فضالة بن عبيد، قال أتي النبي صلى الله عليه وسلم عام خيبر بقلادة فيها ذهب وخرز - قال أبو بكر وابن منيع فيها خرز معلقة بذهب - ابتاعها رجل بتسعة دنانير أو بسبعة دنانير فقال النبي صلى الله عليه وسلم ‏\"‏ لا حتى تميز بينه وبينه ‏\"‏ ‏.‏ فقال إنما أردت الحجارة فقال النبي صلى الله عليه وسلم ‏\"‏ لا حتى تميز بينهما ‏\"‏ ‏.‏ قال فرده حتى ميز بينهما ‏.‏ وقال ابن عيسى أردت التجارة ‏.‏ قال أبو داود وكان في كتابه الحجارة فغيره فقال التجارة ‏.‏",
      "text_en": " Narrated Fudalah ibn Ubayd:                     The Prophet (ﷺ) was brought a necklace in which there were gold and pearls. (The narrators AbuBakr and (Ahmad) Ibn Mani' said: The pearls were set with gold in it, and a man bought it for nine or seven dinars.) The Prophet (ﷺ) said: (It must not be sold) till the contents are considered separately. The narrator said: He returned it till the contents were considered separately. The narrator Ibn Asa said: By this I intended trade.Abu Dawud said: The word hijarah (stone) was recorded in his note-book before, but he changed it and narrated tijarah (trade).",
      "chain": [
        "31167",
        "20025",
        "20025",
        "10906",
        "15113",
        "1935"
      ]
    },
    {
      "hadith_no": "3382",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا هشيم، أخبرنا صالح أبو عامر، - قال أبو داود كذا قال محمد - حدثنا شيخ، من بني تميم قال خطبنا علي بن أبي طالب - أو قال قال علي قال ابن عيسى هكذا حدثنا هشيم، - قال سيأتي على الناس زمان عضوض يعض الموسر على ما في يديه ولم يؤمر بذلك قال الله تعالى ‏{‏ ولا تنسوا الفضل بينكم ‏}‏ ويبايع المضطرون وقد نهى النبي صلى الله عليه وسلم عن بيع المضطر وبيع الغرر وبيع الثمرة قبل أن تدرك ‏.‏",
      "text_en": " Narrated Ali ibn AbuTalib:                     A time is certainly coming to mankind when people will bite each other and a rich man will hold fast, what he has in his possession (i.e. his property), though he was not commanded for that. Allah, Most High, said: \"And do not forget liberality between yourselves.\" The men who are forced will contract sale while the Prophet (ﷺ) forbade forced contract, one which involves  some uncertainty, and the sale of fruit before it is ripe.",
      "chain": [
        "31167",
        "20468",
        "11035",
        "5",
        "20468"
      ]
    },
    {
      "hadith_no": "3468",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا أبو بدر، عن زياد بن خيثمة، عن سعد، - يعني الطائي - عن عطية بن سعد، عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أسلف في شىء فلا يصرفه إلى غيره ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuSa'id al-Khudri:                     The Prophet (ﷺ) said: If anyone pays in advance he must not transfer it to someone else before he receives it.",
      "chain": [
        "31167",
        "36577",
        "20585",
        "15373",
        "38"
      ]
    },
    {
      "hadith_no": "3621",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا أبو معاوية، حدثنا الأعمش، عن شقيق، عن الأشعث، قال كان بيني وبين رجل من اليهود أرض فجحدني فقدمته إلى النبي صلى الله عليه وسلم قال لي النبي صلى الله عليه وسلم ‏\"‏ ألك بينة ‏\"‏ ‏.‏ قلت لا ‏.‏ قال لليهودي ‏\"‏ احلف ‏\"‏ ‏.‏ قلت يا رسول الله إذا يحلف ويذهب بمالي ‏.‏ فأنزل الله ‏{‏ إن الذين يشترون بعهد الله وأيمانهم ‏}‏ إلى آخر الآية ‏.‏",
      "text_en": " Al-Ash’ath b. Qais said:                      A Jew and I shared some land and he denied my right, so I took him to the holy prophet (ﷺ). The holy prophet (ﷺ) said to me: Have you have proof. I said: No. He then said to the Jew: Swear an oath I said Messenger of Allah,he will swear an oath and go off my property. So Allah sent down: “Those who barter for a small price Allah’s covenant  and their oaths....\" to the end of the verse.",
      "chain": [
        "31167",
        "20354",
        "11060",
        "11353",
        "485"
      ]
    },
    {
      "hadith_no": "3679",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Drinks (Kitab Al-Ashribah) - كتاب الأشربة",
      "chapter_no": "27",
      "text_ar": "حدثنا سليمان بن داود، ومحمد بن عيسى، - في آخرين - قالوا حدثنا حماد، - يعني ابن زيد - عن أيوب، عن نافع، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ كل مسكر خمر وكل مسكر حرام ومن مات وهو يشرب الخمر يدمنها لم يشربها في الآخرة ‏\"‏ ‏.‏",
      "text_en": " Ibn ‘Umar reported the Apostel of Allah (ﷺ) as saying:                      Every intoxicant is forbidden. He who drinks wine in this world, and dies when he is addiction to it, will not drink it in the next.",
      "chain": [
        "30584",
        "31167",
        "20022",
        "11015",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3779",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا ابن علية، عن عبد الرحمن بن إسحاق، عن عبد الرحمن بن معاوية، عن عثمان بن أبي سليمان، عن صفوان بن أمية، قال كنت آكل مع النبي صلى الله عليه وسلم فآخذ اللحم بيدي من العظم فقال ‏\"‏ أدن العظم من فيك فإنه أهنأ وأمرأ ‏\"‏ ‏.‏ قال أبو داود عثمان لم يسمع من صفوان وهو مرسل ‏.‏",
      "text_en": " Narrated Safwan ibn Umayyah:                     I was eating with the Prophet (ﷺ) and snatching the meat from the bone with my hand. He said: bring the bone near your mouth, for it is more beneficial and wholesome.Abu Dawud said: 'Uthman did not hear (traditions) from Safwan. This is a mursal tradition.",
      "chain": [
        "31167",
        "20208",
        "11876",
        "10649",
        "449"
      ]
    },
    {
      "hadith_no": "3972",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Dialects and Readings of the Qur'an (Kitab Al-Huruf Wa Al-Qira'at) - كتاب الحروف والقراءات",
      "chapter_no": "32",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا معتمر، قال سمعت أبي قال، سمعت أنس بن مالك، يقول قال النبي صلى الله عليه وسلم ‏\"‏ اللهم إني أعوذ بك من البخل والهرم ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik reported that Messenger of Allah (ﷺ) as saying:                      O Allah, I seek refuge in Thee from niggardliness and old age.",
      "chain": [
        "31167",
        "20288",
        "11289",
        "19"
      ]
    },
    {
      "hadith_no": "3974",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Dialects and Readings of the Qur'an (Kitab Al-Huruf Wa Al-Qira'at) - كتاب الحروف والقراءات",
      "chapter_no": "32",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا سفيان، حدثنا عمرو بن دينار، عن عطاء، عن ابن عباس، قال لحق المسلمون رجلا في غنيمة له فقال السلام عليكم فقتلوه وأخذوا تلك الغنيمة فنزلت ‏{‏ ولا تقولوا لمن ألقى إليكم السلام لست مؤمنا تبتغون عرض الحياة الدنيا ‏}‏ تلك الغنيمة ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     The Muslims met a man with some sheep of his. He said: Peace be upon you. But they killed him and took those few sheep. Thereupon the following Qur'anic verse was revealed: \"...And say to anyone who offers you a salutation: Thou art none of believer, coveting the perishable good of this life.\" meaning these few sheep.",
      "chain": [
        "31167",
        "20012",
        "11081",
        "11029",
        "17"
      ]
    },
    {
      "hadith_no": "4003",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Dialects and Readings of the Qur'an (Kitab Al-Huruf Wa Al-Qira'at) - كتاب الحروف والقراءات",
      "chapter_no": "32",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا حجاج، عن ابن جريج، قال أخبرني عمر بن عطاء، أن مولى، لابن الأسقع - رجل صدق - أخبره عن ابن الأسقع أنه سمعه يقول إن النبي صلى الله عليه وسلم جاءهم في صفة المهاجرين فسأله إنسان أى آية في القرآن أعظم قال النبي صلى الله عليه وسلم ‏\"‏ ‏{‏ الله لا إله إلا هو الحى القيوم لا تأخذه سنة ولا نوم ‏}‏ ‏\"‏ ‏.‏",
      "text_en": " Narrated Ibn al-Asqa':                     The Prophet (ﷺ) came to them in the swelling place of immigrants and a man asked him: Which is the greatest verse of the Qur'an ? The Prophet (ﷺ) replied: Allah, there is no god but He - the Living, the Self-Subsisting Eternal. No slumber can seize Him nor sleep.\"",
      "chain": [
        "31167",
        "20219",
        "11070",
        "13541"
      ]
    },
    {
      "hadith_no": "4029",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا أبو عوانة، ح وحدثنا محمد، - يعني ابن عيسى - عن شريك، عن عثمان بن أبي زرعة، عن المهاجر الشامي، عن ابن عمر، - قال في حديث شريك يرفعه - قال ‏\"‏ من لبس ثوب شهرة ألبسه الله يوم القيامة ثوبا مثله ‏\"‏ ‏.‏ زاد عن أبي عوانة ‏\"‏ ثم تلهب فيه النار ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     The Prophet (ﷺ) as saying: If anyone wears a garment for gaining fame, Allah will clothe him in a similar garment on the Day of Resurrection.",
      "chain": [
        "31167",
        "20469",
        "31167",
        "11858",
        "21619",
        "18"
      ]
    },
    {
      "hadith_no": "4106",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا أبو جميع، سالم بن دينار عن ثابت، عن أنس، أن النبي صلى الله عليه وسلم أتى فاطمة بعبد قد وهبه لها قال وعلى فاطمة رضي الله عنها ثوب إذا قنعت به رأسها لم يبلغ رجليها وإذا غطت به رجليها لم يبلغ رأسها فلما رأى النبي صلى الله عليه وسلم ما تلقى قال ‏\"‏ إنه ليس عليك بأس إنما هو أبوك وغلامك ‏\"‏ ‏.‏",
      "text_en": " Narrated Anas ibn Malik:                     The Prophet (ﷺ) brought Fatimah a slave which he donated to her. Fatimah wore a garment which, when she covered her head, did not reach her feet, and when she covered her feet by it, that garment did not reach her head. When the Prophet (ﷺ) saw her struggle, he said: There is no harm to you: Here is only your father and slave.",
      "chain": [
        "31167",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "4169",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Combing the Hair (Kitab Al-Tarajjul) - كتاب الترجل",
      "chapter_no": "35",
      "text_ar": "حدثنا محمد بن عيسى، وعثمان بن أبي شيبة، - المعنى - قالا حدثنا جرير، عن منصور، عن إبراهيم، عن علقمة، عن عبد الله، قال لعن الله الواشمات والمستوشمات ‏.‏ قال محمد والواصلات وقال عثمان والمتنمصات ثم اتفقا والمتفلجات للحسن المغيرات خلق الله عز وجل ‏.‏ فبلغ ذلك امرأة من بني أسد يقال لها أم يعقوب ‏.‏ زاد عثمان كانت تقرأ القرآن ثم اتفقا فأتته فقالت بلغني عنك أنك لعنت الواشمات والمستوشمات ‏.‏ قال محمد والواصلات وقال عثمان والمتنمصات ثم اتفقا والمتفلجات قال عثمان للحسن المغيرات خلق الله تعالى ‏.‏ فقال وما لي لا ألعن من لعن رسول الله صلى الله عليه وسلم وهو في كتاب الله تعالى قالت لقد قرأت ما بين لوحى المصحف فما وجدته ‏.‏ فقال والله لئن كنت قرأتيه لقد وجدتيه ثم قرأ ‏{‏ وما آتاكم الرسول فخذوه وما نهاكم عنه فانتهوا ‏}‏ قالت إني أرى بعض هذا على امرأتك ‏.‏ قال فادخلي فانظري ‏.‏ فدخلت ثم خرجت فقال ما رأيت وقال عثمان فقالت ما رأيت ‏.‏ فقال لو كان ذلك ما كانت معنا ‏.‏",
      "text_en": " 'Abd Allah (b. Mas'us) said:                      Allah has cursed the woman who tattoo and the women who have themselves tattooed, the women who add false hair (according to the version of Muhammad b. Isa) and the women who pluck hairs from their faces (according to the version on 'Uthman). The agreed version then goes: The women who spaces between their teeth for beauty, changing what Allah has created. When a woman of Banu Asad called Umm Ya'qub, who read the Qur'an (according to the version of 'Uthman) heard it, she came to him (according to the agreed version) and said: I have heard that you have cursed the women who tattoo, those have themselves tattooed, those who add false hair (according to the version of Muhammad), those pluck hairs from their faces, and those who make spaces between their teeth (according to the agreed version), for changing what Allah has created (according to the version of 'Uthman). He said: Why should I not curse those whom the Messenger of Allah (ﷺ) had cursed and those who were mentioned in Allah's Book ? She said: I have read it from cover to cover and have not found in it. He said: I swear by Allah, if you read it, you would have found it. He then read: What the Apostle has brought you accept, and what he has forbidden refrain from it. She said: I find some of these thing in you wife. He said: Enter (the house) and see. She said: I then entered (the house) and came out. He asked: What did you see ? She said: I did not see (anything). He said: Had it been so, she would have not have been with us. This is according to the version of 'Uthman.",
      "chain": [
        "31167",
        "20028",
        "11067",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "4252",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim) - كتاب الفتن والملاحم",
      "chapter_no": "37",
      "text_ar": "حدثنا سليمان بن حرب، ومحمد بن عيسى، قالا حدثنا حماد بن زيد، عن أيوب، عن أبي قلابة، عن أبي أسماء، عن ثوبان، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله زوى لي الأرض ‏\"‏ ‏.‏ أو قال ‏\"‏ إن ربي زوى لي الأرض فرأيت مشارقها ومغاربها وإن ملك أمتي سيبلغ ما زوي لي منها وأعطيت الكنزين الأحمر والأبيض وإني سألت ربي لأمتي أن لا يهلكها بسنة بعامة ولا يسلط عليهم عدوا من سوى أنفسهم فيستبيح بيضتهم وإن ربي قال لي يا محمد إني إذا قضيت قضاء فإنه لا يرد ولا أهلكهم بسنة بعامة ولا أسلط عليهم عدوا من سوى أنفسهم فيستبيح بيضتهم ولو اجتمع عليهم من بين أقطارها أو قال بأقطارها حتى يكون بعضهم يهلك بعضا وحتى يكون بعضهم يسبي بعضا وإنما أخاف على أمتي الأئمة المضلين وإذا وضع السيف في أمتي لم يرفع عنها إلى يوم القيامة ولا تقوم الساعة حتى تلحق قبائل من أمتي بالمشركين وحتى تعبد قبائل من أمتي الأوثان وإنه سيكون في أمتي كذابون ثلاثون كلهم يزعم أنه نبي وأنا خاتم النبيين لا نبي بعدي ولا تزال طائفة من أمتي على الحق ‏\"‏ ‏.‏ قال ابن عيسى ‏\"‏ ظاهرين ‏\"‏ ‏.‏ ثم اتفقا ‏\"‏ لا يضرهم من خالفهم حتى يأتي أمر الله ‏\"‏ ‏.‏",
      "text_en": " Narrated Thawban:                     The Messenger of Allah (ﷺ) as saying: Allah, the Exalted, folded for me the earth, or he said (the narrator is doubtful): My Lord folded for me the earth, so much so that I saw its easts and wests (i.e. the extremities). The kingdom of my community will reach as far as the earth was floded for me. The two treasures, the red and the white, were bestowed on me. I prayed to my Lord that He may not destroy my community by prevailing famine, and not give their control to an enemy who annihilates then en masse except from among themselves. My Lord said to me: Muhammad, If I make a decision, it is not withdrawn ; and I shall not destroy them by prevailing famine, and I shall not give their control to an enemy, except from among themselves, who exterminates them en masse, even if they are stormed from all sides of the earth ; only a section of them will destroy another section, and a section will captive another section. I am afraid about my community of those leaders who will lead astray. When the sword is used among my people, it will not be withdrawn from them till the Day of Resurrection, and the Last Hour will not come before the tribes of my people attach themselves to the polytheists and tribes of my people worship idols. There will be among my people thirty great liars each of them asserting that he is (Allah's) prophet, where as I am the seal of the Prophet  s after whom (me) there will be no prophet ; and a section of my people will continue to hold to the truth - (according to the Ibn Isa's version: (will continue to dominate) - the agreed version goes: \"and will not be injured by those who oppose them, till Allah's command comes.\"",
      "chain": [
        "20193",
        "31167",
        "20022",
        "11015",
        "11047",
        "130"
      ]
    },
    {
      "hadith_no": "4606",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا محمد بن الصباح البزاز، حدثنا إبراهيم بن سعد، ح وحدثنا محمد بن عيسى، حدثنا عبد الله بن جعفر المخرمي، وإبراهيم بن سعد، عن سعد بن إبراهيم، عن القاسم بن محمد، عن عائشة، رضى الله عنها قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ من أحدث في أمرنا هذا ما ليس فيه فهو رد ‏\"‏ ‏.‏ قال ابن عيسى قال النبي صلى الله عليه وسلم ‏\"‏ من صنع أمرا على غير أمرنا فهو رد ‏\"‏ ‏.‏",
      "text_en": " 'Aishah reported the Messenger of Allah (ﷺ) as saying:                      if any one introduces into this affair of ours anything which does not belong to it, it is rejected. Ibn Isa said: the prophet (ﷺ) said: if anyone practices any action in away other than our practice, it is rejected.",
      "chain": [
        "30269",
        "20150",
        "31167",
        "20505",
        "20150",
        "11063",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "4763",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا محمد بن عبيد، ومحمد بن عيسى، - المعنى - قالا حدثنا حماد، عن أيوب، عن محمد، عن عبيدة، ‏:‏ أن عليا، ذكر أهل النهروان فقال ‏:‏ فيهم رجل مودن اليد أو مخدج اليد، أو مثدون اليد لولا أن تبطروا لنبأتكم ما وعد الله الذين يقتلونهم على لسان محمد صلى الله عليه وسلم ‏.‏ قال قلت ‏:‏ أنت سمعت هذا منه قال ‏:‏ إي ورب الكعبة ‏.‏",
      "text_en": " ‘Ubaidah (al-salman) said :                      ‘Ali mentioned about the people of al Nahrawan, saying: Among them there will be a man with a defective hand or with a small hand. if you were not to overjoy. I would inform you of what Allah has promised (the reward for) those who will kill them at the tongue of Muhammad (May peace be upon him). I asked : Have you heard this from him? He replied : Yes, by the lord of the Ka’bah.",
      "chain": [
        "30213",
        "31167",
        "20022",
        "11015",
        "11035",
        "5"
      ]
    },
    {
      "hadith_no": "5140",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا الحارث بن مرة، حدثنا كليب بن منفعة، عن جده، أنه أتى النبي صلى الله عليه وسلم فقال يا رسول الله من أبر قال ‏\"‏ أمك وأباك وأختك وأخاك ومولاك الذي يلي ذاك حق واجب ورحم موصولة ‏\"‏ ‏.‏",
      "text_en": " Kulaib b. Manfa'ah said that his grandfather told then he went to the Prophet (ﷺ) and said:                      Messenger of Allah! to whom should I show kindness? He said: Your mother, your sister, your brother and the slave whom you set free and who is your relative, a due binding (on you), and a tie of relationship which should be joined.",
      "chain": [
        "31167",
        "14336"
      ]
    },
    {
      "hadith_no": "5152",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا سفيان، عن بشير أبي إسماعيل، عن مجاهد، عن عبد الله بن عمرو، أنه ذبح شاة فقال أهديتم لجاري اليهودي فإني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ما زال جبريل يوصيني بالجار حتى ظننت أنه سيورثه ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     Mujahid said that Abdullah ibn Amr slaughtered a sheep and said: Have you presented a gift from it to my neighbour, the Jew, for I heard the Messenger of Allah (ﷺ) say: Gabriel kept on commending the neighbour to me so that I thought he would make an heir?",
      "chain": [
        "31167",
        "20012",
        "11028",
        "29"
      ]
    },
    {
      "hadith_no": "3278",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا عمرو بن منصور، قال حدثنا محمد بن عيسى، قال حدثنا يحيى بن زكريا بن أبي زائدة، عن داود، عن عمرو بن سعيد، عن سعيد بن جبير، عن ابن عباس، أن رجلا، كلم النبي صلى الله عليه وسلم في شىء فقال النبي صلى الله عليه وسلم ‏\"‏ إن الحمد لله نحمده ونستعينه من يهده الله فلا مضل له ومن يضلل الله فلا هادي له وأشهد أن لا إله إلا الله وحده لا شريك له وأشهد أن محمدا عبده ورسوله أما بعد ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that a man spoke to the Prophet about something and the Prophet said:                      \"Innal-hamda lillahi nahmaduhu wa nasta'inahu, man yahdih Illahu fala mudilla lahu wa man yudlil Illahu fala hadiya lahu, wa ashhadu an la ilaha illallahu (wahdahu lasharika lahu) wa ashhadu anna Muhammadan 'abdahu wa rasuluhu. Amma ba'd (Praise be to Allah, we seek His help. Whomsoever Allah guides will never be led astray, and whomsoever Allah leaves astray, no one can guide. I bear witness that there is none worthy of worship but Allah (alone with no partners) and I bear witness that Muhammad is His slave and Messenger. To proceed).\"",
      "chain": [
        "38433",
        "31167",
        "20366",
        "10602",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "4019",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرني إبراهيم بن يعقوب، قال حدثنا محمد بن عيسى، قال حدثنا حماد بن زيد، قال حدثنا يحيى بن سعيد، قال حدثني أبو أمامة بن سهل، وعبد الله بن عامر بن ربيعة، قالا كنا مع عثمان وهو محصور - وكنا إذا دخلنا مدخلا نسمع كلام من بالبلاط - فدخل عثمان يوما ثم خرج فقال إنهم ليتواعدوني بالقتل ‏.‏ قلنا يكفيكهم الله ‏.‏ قال فلم يقتلوني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يحل دم امرئ مسلم إلا بإحدى ثلاث رجل كفر بعد إسلامه أو زنى بعد إحصانه أو قتل نفسا بغير نفس ‏\"‏ ‏.‏ فوالله ما زنيت في جاهلية ولا إسلام ولا تمنيت أن لي بديني بدلا منذ هداني الله ولا قتلت نفسا فلم يقتلونني",
      "text_en": " Abu Umamah bin Sahl and 'Abdullah bin 'Amir bin Rabi'ah said:                     \"We were with 'Uthman when he was under siege and we could hear what was said from Al-Balat. 'Uthman came in one day, then he came out, and said: 'They are threatening to kill me.' We said: 'Allah will suffice you against them.' He said: 'Why would they kill me? I heard the Messenger of Allah [SAW] say: It is not permissible to shed the blood of a Muslim except in one of three cases: A man who reverts to Kufr after becoming Muslim, or commits adultery after being married, or one who kills a soul unlawfully. By Allah, I did not commit adultery during Jahiliyyah or in Islam, I never wished to follow any other religion since Allah guided me, and I have never killed anyone, so why do they want to kill me?'\"",
      "chain": [
        "38088",
        "31167",
        "20022",
        "11062",
        "15659",
        "709"
      ]
    },
    {
      "hadith_no": "4811",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا محمد بن عيسى بن النقاش، قال حدثنا يزيد، - يعني ابن هارون - قال أنبأنا حماد، عن قتادة، عن خلاس، عن علي، وعن أيوب، عن عكرمة، عن ابن عباس، عن النبي صلى الله عليه وسلم قال ‏\"‏ المكاتب يعتق بقدر ما أدى ويقام عليه الحد بقدر ما عتق منه ويرث بقدر ما عتق منه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas tht the Prophet said:                     \"The Mukatab is free to the extent that the has paid off (toward buying his freedom); he Hadd punishment should be carried out on him proportionate to the amount he has paid off (toward buying his freedom); and he inherits proportionate to the amount he has paid off (toward buying his freedom).\"",
      "chain": [
        "31167",
        "20472",
        "20022",
        "11019",
        "11283",
        "5",
        "11015",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "5079",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا محمد بن عبد الرحمن بن أشعث، قال حدثني محمد بن عيسى، قال حدثنا هشيم، قال أخبرني ابن أبي ليلى، عن الأجلح، فلقيت الأجلح فحدثني عن ابن بريدة، عن أبي الأسود الديلي، عن أبي ذر، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ إن من أحسن ما غيرتم به الشيب الحناء والكتم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Dharr said:                     \"I heard the Prophet [SAW] say: 'Some of the best things with which you can change gray hair are Henna and Katam.'\"",
      "chain": [
        "31167",
        "20468",
        "11196",
        "11432",
        "11114",
        "23"
      ]
    },
    {
      "hadith_no": "5283",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا محمد بن عامر، قال حدثنا محمد بن عيسى، قال حدثنا عباد بن العوام، عن سعيد، عن قتادة، عن أنس، أن النبي صلى الله عليه وسلم كان يتختم في يمينه ‏.‏",
      "text_en": " It was narrated from Anas that:                     The Prophet [SAW] used to wear his ring on his right hand.",
      "chain": [
        "38522",
        "31167",
        "20431",
        "11168",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "1517",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا أحمد بن الأزهر، حدثنا محمد بن عيسى، حدثنا يوسف بن الماجشون، حدثنا محمد بن المنكدر، قال دخلت على جابر بن عبد الله وهو يموت فقلت اقرأ على رسول الله  صلى الله عليه وسلم  السلام ‏.‏",
      "text_en": " Muhammadbin Munkadir said:                      “I entered upon Jabir bin ‘Abdullah whenhewas dying, and I said: ‘Convey my Salam to the Messenger of Allah(ﷺ).’”",
      "chain": [
        "38001",
        "31167",
        "20027",
        "11048"
      ]
    }
  ],
  "total_hadiths": 71
}