{
  "id": "31160",
  "name": "Muhammad bin Abi Da'ud al-Bghdady محمد بن أبي داود",
  "full_name": "Muhammad bin Abi Da'ud al-Bghdady محمد بن أبي داود",
  "grade": "3rd Century AH",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Baghdad"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [د  أبي  داود]"
    ],
    "tags": [
      "al-Baghdadi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "id": "sunan-abi-daud-66",
      "hadith_no": "66",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن العلاء، والحسن بن علي، ومحمد بن سليمان الأنباري، قالوا حدثنا أبو أسامة، عن الوليد بن كثير، عن محمد بن كعب، عن عبيد الله بن عبد الله بن رافع بن خديج، عن أبي سعيد الخدري، أنه قيل لرسول الله صلى الله عليه وسلم أنتوضأ من بئر بضاعة وهي بئر يطرح فيها الحيض ولحم الكلاب والنتن فقال رسول الله صلى الله عليه وسلم ‏\"‏ الماء طهور لا ينجسه شىء ‏\"‏ ‏.‏ قال أبو داود وقال بعضهم عبد الرحمن بن رافع ‏.‏",
      "text_en": " Narrated AbuSa'id al-Khudri:                     The people asked the Messenger of Allah (ﷺ): Can we perform ablution out of the well of Buda'ah, which is a well into which menstrual clothes, dead dogs and stinking things were thrown? He replied: Water is pure and is not defiled by anything.",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "30",
        "31160",
        "20318",
        "11230",
        "11221",
        "12328",
        "38"
      ]
    },
    {
      "id": "sunan-abi-daud-321",
      "hadith_no": "321",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن سليمان الأنباري، حدثنا أبو معاوية الضرير، عن الأعمش، عن شقيق، قال كنت جالسا بين عبد الله وأبي موسى فقال أبو موسى يا أبا عبد الرحمن أرأيت لو أن رجلا أجنب فلم يجد الماء شهرا ‏.‏ أما كان يتيمم فقال لا وإن لم يجد الماء شهرا فقال أبو موسى فكيف تصنعون بهذه الآية التي في سورة المائدة ‏{‏ فلم تجدوا ماء فتيمموا صعيدا طيبا ‏}‏ فقال عبد الله لو رخص لهم في هذا لأوشكوا إذا برد عليهم الماء أن يتيمموا بالصعيد ‏.‏ فقال له أبو موسى وإنما كرهتم هذا لهذا قال نعم فقال له أبو موسى ألم تسمع قول عمار لعمر بعثني رسول الله صلى الله عليه وسلم في حاجة فأجنبت فلم أجد الماء فتمرغت في الصعيد كما تتمرغ الدابة ثم أتيت النبي صلى الله عليه وسلم فذكرت ذلك له فقال ‏\"‏ إنما كان يكفيك أن تصنع هكذا ‏\"‏ ‏.‏ فضرب بيده على الأرض فنفضها ثم ضرب بشماله على يمينه وبيمينه على شماله على الكفين ثم مسح وجهه ‏.‏ فقال له عبد الله أفلم تر عمر لم يقنع بقول عمار",
      "text_en": " Shaqiq said:                      While I was sitting between 'Abd Allah and Abu Musa, the latter said: Abu 'Abd al-Rahman, what do you think if a man becomes defiled (because of seminal omission) and does not find water for a month; should he not perform tayammum ? He replied: No, even if he does not find water for a month. Abu Musa then said: How will you do with the Qur'anic version (about tayammum) in the chapter al-Ma'idah which says: \"... and you find no water, then go to clean, high ground\" (5:6)? 'Abd Allah (b. Mas'ud) then said: If they (the people) are granted concession in this respect, they might perform tayammum with pure earth when water is cold. Abu Musa said: For this (reason) you forbade it ? He said: Yes. Abu Musa then said: Did you not hear what 'Ammar said to 'Umar ? (He said): The Messenger of Allah (ﷺ) sent me on some errand. I had seminal emission and I did not find water. Therefore, I rolled on the ground just as an animal rolls down. I then came to the Prophet (ﷺ) and made a mention of that to him. He said: It would have been enough for you to do thus. Then he struck the ground with his hands and shook them off and then stuck the right hand with his left hand and his left hand with his right hand (and wiped) over his hands (up to the wrist) and wiped his face. 'Abd Allah then said to him: Did you not see that 'Umar was not satisfied with the statement of 'Ammar ?",
      "usc_msa_ref": "",
      "chain": [
        "31160",
        "20354",
        "11060",
        "11353"
      ]
    },
    {
      "id": "sunan-abi-daud-433",
      "hadith_no": "433",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن قدامة بن أعين، حدثنا جرير، عن منصور، عن هلال بن يساف، عن أبي المثنى، عن ابن أخت، عبادة بن الصامت عن عبادة بن الصامت، ح وحدثنا محمد بن سليمان الأنباري، حدثنا وكيع، عن سفيان، - المعنى - عن منصور، عن هلال بن يساف، عن أبي المثنى الحمصي، عن أبي أبى ابن امرأة، عبادة بن الصامت عن عبادة بن الصامت، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إنها ستكون عليكم بعدي أمراء تشغلهم أشياء عن الصلاة لوقتها حتى يذهب وقتها فصلوا الصلاة لوقتها ‏\"‏ ‏.‏ فقال رجل يا رسول الله أصلي معهم قال ‏\"‏ نعم إن شئت ‏\"‏ ‏.‏ وقال سفيان إن أدركتها معهم أأصلي معهم قال ‏\"‏ نعم إن شئت ‏\"‏ ‏.‏",
      "text_en": " Narrated Ubadah ibn as-Samit:                     After me you will come under rulers who will be detained from saying prayer at its proper time by (their) works until its time has run out, so offer prayer at its proper time. A man asked him: Messenger of Allah, may I offer prayer with them? He replied: Yes, if you wish (to do so). Sufyan (another narrator through a different chain)said: May I offer prayer with them if I get it with them? He said: Yes, if you wish to do so.",
      "usc_msa_ref": "",
      "chain": [
        "38573",
        "20028",
        "11067",
        "10835",
        "40",
        "31160",
        "20032",
        "11067",
        "10835"
      ]
    },
    {
      "id": "sunan-abi-daud-520",
      "hadith_no": "520",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا قيس يعني ابن الربيع، ح وحدثنا محمد بن سليمان الأنباري، حدثنا وكيع، عن سفيان، جميعا عن عون بن أبي جحيفة، عن أبيه، قال أتيت النبي صلى الله عليه وسلم بمكة وهو في قبة حمراء من أدم فخرج بلال فأذن فكنت أتتبع فمه ها هنا وها هنا ‏.‏ قال ثم خرج رسول الله صلى الله عليه وسلم وعليه حلة حمراء برود يمانية قطري ‏.‏ وقال موسى قال رأيت بلالا خرج إلى الأبطح فأذن فلما بلغ حى على الصلاة حى على الفلاح ‏.‏ لوى عنقه يمينا وشمالا ولم يستدر ثم دخل فأخرج العنزة وساق حديثه ‏.‏",
      "text_en": " Abu Juhaifah reported:                      I came to the prophet (ﷺ) at Mecca; he was sitting in a tent made of leather. Then Bilal came out and called to prayer. I looked at his mouth following him this side and that side (i.e., right and left). Later at his Messenger of Allah (ﷺ) came out clad in a red suit, i.e, wearing the sheets of the Yemen, of the Qatri design. The version narrated by Musa has the word; “I saw Bilal going towards al-Abtah”.He then made a call to prayer. When he reached the words “ come to prayer, come to salvation”. He turned his neck right and left, respectively; he did not turn himself (with his whole body). He then entered (his house) and came out with a lancet. The narrator then reported the rest of the tradition.",
      "usc_msa_ref": "",
      "chain": [
        "20040",
        "25246",
        "31160",
        "20032",
        "20012",
        "11383",
        "4047"
      ]
    },
    {
      "id": "sunan-abi-daud-562",
      "hadith_no": "562",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن سليمان الأنباري، أن عبد الملك بن عمرو، حدثهم عن داود بن قيس، قال حدثني سعد بن إسحاق، عن أبي سعيد المقبري، حدثني أبو ثمامة الحناط، أن كعب بن عجرة، أدركه وهو يريد المسجد أدرك أحدهما صاحبه قال فوجدني وأنا مشبك بيدى فنهاني عن ذلك وقال إن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا توضأ أحدكم فأحسن وضوءه ثم خرج عامدا إلى المسجد فلا يشبكن يديه فإنه في صلاة ‏\"‏ ‏.‏",
      "text_en": " Narrated Ka'b ibn Ujrah:                     AbuThumamah al-Hannat said that Ka'b ibn Ujrah met him while he was going to the mosque; one of the two (companions) met his companion (on his way to the mosque) And he met crossing the fingers of my both hands. He prohibited me to do so, and said: The Messenger of Allah (ﷺ) has said: If any of you performs ablution, and performs his ablution perfectly, and then goes out intending for the mosque, he should not cross the fingers of his hand because he is already in prayer.",
      "usc_msa_ref": "",
      "chain": [
        "31160",
        "11845",
        "11212",
        "13559",
        "4052"
      ]
    },
    {
      "id": "sunan-abi-daud-630",
      "hadith_no": "630",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن سليمان الأنباري، حدثنا وكيع، عن سفيان، عن أبي حازم، عن سهل بن سعد، قال لقد رأيت الرجال عاقدي أزرهم في أعناقهم من ضيق الأزر خلف رسول الله صلى الله عليه وسلم في الصلاة كأمثال الصبيان فقال قائل يا معشر النساء لا ترفعن رءوسكن حتى يرفع الرجال ‏.‏",
      "text_en": " Sahl b. Sa’d said:                      I saw the people tying their wrappers over their necks like children due to the narrowness of the wrappers behind the Messenger of Allah (May peace be upon him) during prayer. Someone said: Body of women, do not raise your heads until the men raise (their heads).",
      "usc_msa_ref": "",
      "chain": [
        "31160",
        "20032",
        "20012",
        "11172",
        "399"
      ]
    },
    {
      "id": "sunan-abi-daud-671",
      "hadith_no": "671",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن سليمان الأنباري، حدثنا عبد الوهاب، - يعني ابن عطاء - عن سعيد، عن قتادة، عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أتموا الصف المقدم ثم الذي يليه فما كان من نقص فليكن في الصف المؤخر ‏\"‏ ‏.‏",
      "text_en": " Narrated Anas ibn Malik:                     The Prophet (ﷺ) said: Complete the front row, then the one that comes next, and if there is any incompleteness, let it be in the last row.",
      "usc_msa_ref": "",
      "chain": [
        "31160",
        "20557",
        "11168",
        "11019",
        "19"
      ]
    },
    {
      "id": "sunan-abi-daud-705",
      "hadith_no": "705",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن سليمان الأنباري، حدثنا وكيع، عن سعيد بن عبد العزيز، عن مولى، ليزيد بن نمران عن يزيد بن نمران، قال رأيت رجلا بتبوك مقعدا فقال مررت بين يدى النبي صلى الله عليه وسلم وأنا على حمار وهو يصلي فقال ‏\"‏ اللهم اقطع أثره ‏\"‏ ‏.‏ فما مشيت عليها بعد ‏.‏",
      "text_en": " Yazid b. Namran said:                      I saw a crippled man at Tabuk. He (the man) said: I passed riding a donkey in front of the Prophet(ﷺ) who was praying. He said (cursing him): O Allah, cut off his walking. Thenceforth I could not walk.",
      "usc_msa_ref": "",
      "chain": [
        "31160",
        "20032",
        "20638"
      ]
    },
    {
      "id": "sunan-abi-daud-729",
      "hadith_no": "729",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن سليمان الأنباري، حدثنا وكيع، عن شريك، عن عاصم بن كليب، عن علقمة بن وائل، عن وائل بن حجر، قال أتيت النبي صلى الله عليه وسلم في الشتاء فرأيت أصحابه يرفعون أيديهم في ثيابهم في الصلاة ‏.‏",
      "text_en": " Wa’il b. Hujr said:                      I came to the Prophet(ﷺ) during winter; I saw his companions raise their hands in their clothes in prayer.",
      "usc_msa_ref": "",
      "chain": [
        "31160",
        "20032",
        "20587",
        "10778",
        "10801",
        "3045"
      ]
    },
    {
      "id": "sunan-abi-daud-879",
      "hadith_no": "879",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن سليمان الأنباري، حدثنا عبدة، عن عبيد الله، عن محمد بن يحيى بن حبان، عن عبد الرحمن الأعرج، عن أبي هريرة، عن عائشة، - رضى الله عنها - قالت فقدت رسول الله صلى الله عليه وسلم ذات ليلة فلمست المسجد فإذا هو ساجد وقدماه منصوبتان وهو يقول ‏\"‏ أعوذ برضاك من سخطك وأعوذ بمعافاتك من عقوبتك وأعوذ بك منك لا أحصي ثناء عليك أنت كما أثنيت على نفسك ‏\"‏ ‏.‏",
      "text_en": " ‘A’ishah said; one night I missed the Messenger of Allah (ﷺ) and when I sought him on the spot of prayer I found him in prostration with his feet raised, and he was saying:                     ”(O Allah), I seek refuge in Your good pleasure from Your anger, and in Your Mercy from Your Punishment, and I seek refuge from You in You; I am not able to praise You (the way that You deserve to be praised), for You are as You have praised Yourself”.",
      "usc_msa_ref": "",
      "chain": [
        "31160",
        "20337",
        "11201",
        "11222",
        "11197",
        "13",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-952",
      "hadith_no": "952",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن سليمان الأنباري، حدثنا وكيع، عن إبراهيم بن طهمان، عن حسين المعلم، عن ابن بريدة، عن عمران بن حصين، قال كان بي الناصور فسألت النبي صلى الله عليه وسلم فقال ‏\"‏ صل قائما فإن لم تستطع فقاعدا فإن لم تستطع فعلى جنب ‏\"‏ ‏.‏",
      "text_en": " ‘Imran b. Husain said :                      I had a fistula; so I asked the prophet (ﷺ). He said: offer prayer in standing condition; if you are unable to do so, then in sitting condition: if you are then at your side(i.e, in lying condition).",
      "usc_msa_ref": "",
      "chain": [
        "31160",
        "20032",
        "20187",
        "11278",
        "11432",
        "123"
      ]
    },
    {
      "id": "sunan-abi-daud-999",
      "hadith_no": "999",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن سليمان الأنباري، حدثنا أبو نعيم، عن مسعر، بإسناده ومعناه قال ‏\"‏ أما يكفي أحدكم - أو أحدهم - أن يضع يده على فخذه ثم يسلم على أخيه من عن يمينه ومن عن شماله ‏\"‏ ‏.‏",
      "text_en": " The aforesaid tradition has also been narrated by Mis’ar through a different chain of transmitters to the same effect. This version adds:                      Is it not sufficient for one of you or for one of them that he puts his hand on his thigh, and then gives the salutation to his brother to his right and left sides.",
      "usc_msa_ref": "",
      "chain": [
        "31160",
        "20348"
      ]
    },
    {
      "id": "sunan-abi-daud-1054",
      "hadith_no": "1054",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن سليمان الأنباري، حدثنا محمد بن يزيد، وإسحاق بن يوسف، عن أيوب أبي العلاء، عن قتادة، عن قدامة بن وبرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من فاتته الجمعة من غير عذر فليتصدق بدرهم أو نصف درهم أو صاع حنطة أو نصف صاع ‏\"‏ ‏.‏ قال أبو داود رواه سعيد بن بشير عن قتادة هكذا إلا أنه قال ‏\"‏ مدا أو نصف مد ‏\"‏ ‏.‏ وقال عن سمرة ‏.‏ قال أبو داود سمعت أحمد بن حنبل يسأل عن اختلاف هذا الحديث فقال همام عندي أحفظ من أيوب يعني أبا العلاء ‏.‏",
      "text_en": " Narrated Qudamah ibn Wabirah:                     The Prophet (ﷺ) said: If anyone omits the Friday prayer without excuse, he must give one dirham or half a dirham, or one sa' or half a sa' of wheat, in alms.Abu Dawud said: Sa'id b. Bashir reported this tradition in a like manner, except that he narrated \"one mudd or half mudd\" (instead of sa'). He narrated it from Samurah.Abu Dawud said: I heard Ahmad bin Hanbal being asked about the differences over the narration of this Hadith. He said: \"Hammam has a stronger memory - in my opinion - than Ayyub.\"",
      "usc_msa_ref": "",
      "chain": [
        "31160",
        "34204",
        "20411",
        "11019"
      ]
    },
    {
      "id": "sunan-abi-daud-1092",
      "hadith_no": "1092",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن سليمان الأنباري، حدثنا عبد الوهاب، - يعني ابن عطاء - عن العمري، عن نافع، عن ابن عمر، قال كان النبي صلى الله عليه وسلم يخطب خطبتين كان يجلس إذا صعد المنبر حتى يفرغ - أراه قال المؤذن - ثم يقوم فيخطب ثم يجلس فلا يتكلم ثم يقوم فيخطب ‏.‏",
      "text_en": " Ibn 'Umar said:                      The Prophet (ﷺ) used to deliver two sermons. He would sit down when he ascended the pulpit till he (I think he meant the mu'adhdhin) finished. He would then stand up and preach, then sit down and say nothing, then stand up and preach.",
      "usc_msa_ref": "",
      "chain": [
        "31160",
        "20557",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-abi-daud-1472",
      "hadith_no": "1472",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا محمد بن سليمان الأنباري، قال قال وكيع وابن عيينة يعني يستغني به ‏.‏",
      "text_en": " Waki' and Ibn 'Uyainah said (explaining the meaning of taghanni):                      This means that the Qur'an makes a man neglect all other things, and be content with it.",
      "usc_msa_ref": "",
      "chain": [
        "31160"
      ]
    },
    {
      "id": "sunan-abi-daud-1507",
      "hadith_no": "1507",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا محمد بن سليمان الأنباري، حدثنا عبدة، عن هشام بن عروة، عن أبي الزبير، قال كان عبد الله بن الزبير يهلل في دبر كل صلاة فذكر نحو هذا الدعاء زاد فيه ‏\"‏ ولا حول ولا قوة إلا بالله لا إله إلا الله لا نعبد إلا إياه له النعمة ‏\"‏ ‏.‏ وساق بقية الحديث ‏.‏",
      "text_en": " Abu al-Zubair said:                      'Abd Allah b. al-Zubair used to recite this supplication after each (prescribed) prayer. He then narrated a similar supplication and added to it: \"There is no might and no power except in Allah; there is no god but Allah Whom alone we worship. To Him belongs wealth.\" The narrator then transmitted the rest of tradition.",
      "usc_msa_ref": "",
      "chain": [
        "31160",
        "20337",
        "11065",
        "11263",
        "106"
      ]
    },
    {
      "id": "sunan-abi-daud-1889",
      "hadith_no": "1889",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن سليمان الأنباري، حدثنا يحيى بن سليم، عن ابن خثيم، عن أبي الطفيل، عن ابن عباس، أن النبي صلى الله عليه وسلم اضطبع فاستلم وكبر ثم رمل ثلاثة أطواف وكانوا إذا بلغوا الركن اليماني وتغيبوا من قريش مشوا ثم يطلعون عليهم يرملون تقول قريش كأنهم الغزلان قال ابن عباس فكانت سنة ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Prophet (ﷺ) wore the mantle under his right armpit with the end over his left shoulder, and touched the corner (Black Stone), then uttered \"Allah is most great\" and walked proudly in three circuits of circumambulation. When they (the Companions) reached the Yamani corner, and disappeared from the eyes of the Quraysh, they walked as usual; When they appeared before them, they walked proudly with rapid strides. Thereupon the Quraysh said: They look to be the deer (that are jumping). Ibn Abbas said: Hence this became the sunnah (model behaviour of the Prophet).",
      "usc_msa_ref": "",
      "chain": [
        "31160",
        "20204",
        "3660",
        "17"
      ]
    },
    {
      "id": "sunan-abi-daud-1930",
      "hadith_no": "1930",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن سليمان الأنباري، حدثنا إسحاق، - يعني ابن يوسف - عن شريك، عن أبي إسحاق، عن سعيد بن جبير، وعبد الله بن مالك، قالا صلينا مع ابن عمر بالمزدلفة المغرب والعشاء بإقامة واحدة فذكر معنى حديث ابن كثير ‏.‏",
      "text_en": " Sa’id bin Jubair and ‘Abd Allah bin Malik said “We offered the sunset and the night prayers at Al Muzdalifah along with ibn ‘Umar with one iqamah.” The narrator then narrated the rest of the tradition as reported by Ibn Kathir.",
      "usc_msa_ref": "",
      "chain": [
        "31160",
        "20411",
        "20587",
        "11049",
        "11050"
      ]
    },
    {
      "id": "sunan-abi-daud-2060",
      "hadith_no": "2060",
      "source": "Sunan Abi Da'ud",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا محمد بن سليمان الأنباري، حدثنا وكيع، عن سليمان بن المغيرة، عن أبي موسى الهلالي، عن أبيه، عن ابن مسعود، عن النبي صلى الله عليه وسلم بمعناه وقال أنشز العظم ‏.‏",
      "text_en": " The aforesaid tradition has also been narrated by Ibn Mas’ud through a different chain of narrators and to the same effect from the Prophet (ﷺ). This version has the words anshaz al-‘azma meaning which nourishes bones and makes them sturdy and vigorous.",
      "usc_msa_ref": "",
      "chain": [
        "31160",
        "20032",
        "20236",
        "16"
      ]
    },
    {
      "id": "sunan-abi-daud-2534",
      "hadith_no": "2534",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن سليمان الأنباري، حدثنا عبيدة بن حميد، عن الأسود بن قيس، عن نبيح العنزي، عن جابر بن عبد الله، حدث عن رسول الله صلى الله عليه وسلم أنه أراد أن يغزو فقال ‏:‏ ‏\"‏ يا معشر المهاجرين والأنصار، إن من إخوانكم قوما ليس لهم مال ولا عشيرة فليضم أحدكم إليه الرجلين أو الثلاثة فما لأحدنا من ظهر يحمله إلا عقبة كعقبة ‏\"‏ ‏.‏ يعني أحدهم ‏.‏ فضممت إلى اثنين أو ثلاثة، قال ‏:‏ ما لي إلا عقبة كعقبة أحدهم من جملي ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     Once the Messenger of Allah (ﷺ) intended to go on an expedition. He said: O group of the emigrants (Muhajirun) and the helpers (Ansar), among your brethren there are people who have neither property nor family. So one of you should take with him two or three persons; with me. I also rode on my camel by turns like one of them.",
      "usc_msa_ref": "",
      "chain": [
        "31160",
        "20341",
        "11323",
        "34"
      ]
    },
    {
      "id": "sunan-abi-daud-2612",
      "hadith_no": "2612",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن سليمان الأنباري، حدثنا وكيع، عن سفيان، عن علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، قال كان رسول الله صلى الله عليه وسلم إذا بعث أميرا على سرية أو جيش أوصاه بتقوى الله في خاصة نفسه وبمن معه من المسلمين خيرا وقال ‏\"‏ إذا لقيت عدوك من المشركين فادعهم إلى إحدى ثلاث خصال أو خلال فأيتها أجابوك إليها فاقبل منهم وكف عنهم ادعهم إلى الإسلام فإن أجابوك فاقبل منهم وكف عنهم ثم ادعهم إلى التحول من دارهم إلى دار المهاجرين وأعلمهم أنهم إن فعلوا ذلك أن لهم ما للمهاجرين وأن عليهم ما على المهاجرين فإن أبوا واختاروا دارهم فأعلمهم أنهم يكونون كأعراب المسلمين يجرى عليهم حكم الله الذي يجري على المؤمنين ولا يكون لهم في الفىء والغنيمة نصيب إلا أن يجاهدوا مع المسلمين فإن هم أبوا فادعهم إلى إعطاء الجزية فإن أجابوا فاقبل منهم وكف عنهم فإن أبوا فاستعن بالله تعالى وقاتلهم وإذا حاصرت أهل حصن فأرادوك أن تنزلهم على حكم الله تعالى فلا تنزلهم فإنكم لا تدرون ما يحكم الله فيهم ولكن أنزلوهم على حكمكم ثم اقضوا فيهم بعد ما شئتم ‏\"‏ ‏.‏ قال سفيان بن عيينة قال علقمة فذكرت هذا الحديث لمقاتل بن حيان فقال حدثني مسلم - قال أبو داود هو ابن هيصم - عن النعمان بن مقرن عن النبي صلى الله عليه وسلم مثل حديث سليمان بن بريدة ‏.‏",
      "text_en": " Sulaiman bin Buraidah reported on the authority of his father. When the Apostle of Allaah(ﷺ) appointed a Commander over an Army or a detachment, he instructed him to fear Allaah himself and consider the welfare of the Muslims who were with him. He then said “When you meet the polytheists who are your enemy, summon them tone of three things and accept whichever of them they are willing to agree to, and refrain from them. Summon them to Islam and if they agree, accept it from them and refrain from them. Then summon them to leave their territory and transfer to the abode of the Emigrants and tell them that if they do so, they will have the same rights and responsibilities as the Emigrants, but if they refuse and choose their own abode, tell them that they will be like the desert Arabs who are Muslims subject to Allaah’s jurisdiction which applies to the believers, but will have no spoil or booty unless they strive with the Muslims. If they refuse demand jizyah (poll tax) from them, if they agree accept it from them and refrain from them. But if they refuse, seek Alaah’s help and fight with them. When you invade the fortress and they (its people) offer to capitulate and have the matter referred to Allaah’s jurisdiction, do not grant this, for you do not know whether or not you will hit on Allaah’s jurisdiction regarding them. But let them capitulate and have the matter refereed to your jurisdiction and make a decision about them later on as you wish.Sufyan (bin ‘Uyainah) said thah ‘Alqamah said “I mentioned this tradition to Muqatil bin Habban, He said “Muslim narrated it to me.” Abu Dawud said “He is Ibn Haidam narrated from Al Nu’man in Muqqarin from the Prophet (ﷺ) like the tradition of Sulaiman bin Buraidah.",
      "usc_msa_ref": "",
      "chain": [
        "31160",
        "20032",
        "20012",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "id": "sunan-abi-daud-2699",
      "hadith_no": "2699",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن سليمان الأنباري، والحسن بن علي، - المعنى - قالا حدثنا ابن نمير، عن عبيد الله، عن نافع، عن ابن عمر، قال ذهب فرس له فأخذها العدو فظهر عليهم المسلمون فرد عليه في زمن رسول الله صلى الله عليه وسلم ‏.‏ وأبق عبد له فلحق بأرض الروم فظهر عليهم المسلمون فرده عليه خالد بن الوليد بعد النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Nafi said that a horse of Ibn ‘Umar went away and the enemy seized it. The Muslims overpowered them. Khalid bin Walid returned it to him after the Prophet (ﷺ).",
      "usc_msa_ref": "",
      "chain": [
        "31160",
        "30",
        "30212",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-abi-daud-3231",
      "hadith_no": "3231",
      "source": "Sunan Abi Da'ud",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا محمد بن سليمان الأنباري، حدثنا عبد الوهاب، - يعني ابن عطاء - عن سعيد، عن قتادة، عن أنس، عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ إن العبد إذا وضع في قبره وتولى عنه أصحابه إنه ليسمع قرع نعالهم ‏\"‏ ‏.‏",
      "text_en": " Narrated Anas:                     The Prophet (ﷺ) as saying: When a servant (of Allah) is placed in his grave, and his Companions depart from him, he hears the stepping sound of their shoes.",
      "usc_msa_ref": "",
      "chain": [
        "31160",
        "20557",
        "11168",
        "11019",
        "19"
      ]
    },
    {
      "id": "sunan-abi-daud-3234",
      "hadith_no": "3234",
      "source": "Sunan Abi Da'ud",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا محمد بن سليمان الأنباري، حدثنا محمد بن عبيد، عن يزيد بن كيسان، عن أبي حازم، عن أبي هريرة، قال أتى رسول الله صلى الله عليه وسلم قبر أمه فبكى وأبكى من حوله فقال رسول الله صلى الله عليه وسلم ‏\"‏ استأذنت ربي تعالى على أن أستغفر لها فلم يؤذن لي فاستأذنت أن أزور قبرها فأذن لي فزوروا القبور فإنها تذكر بالموت ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     The Messenger of Allah (ﷺ) visited his mother's grave and wept and cause those around him to weep. The Messenger of Allah (ﷺ) then said: I asked my Lord's permission to pray for forgiveness for her, but I was not allowed. I then asked His permission to visit her grave, and I was allowed. So visit graves, for they make one mindful of death.",
      "usc_msa_ref": "",
      "chain": [
        "31160",
        "30213",
        "10845",
        "11172",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-3412",
      "hadith_no": "3412",
      "source": "Sunan Abi Da'ud",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن سليمان الأنباري، حدثنا كثير، - يعني ابن هشام - عن جعفر بن برقان، حدثنا ميمون، عن مقسم، أن النبي صلى الله عليه وسلم حين افتتح خيبر فذكر نحو حديث زيد قال فحزر النخل وقال فأنا ألي جذاذ النخل وأعطيكم نصف الذي قلت ‏.‏",
      "text_en": " Narrated Miqsam:                     When the Prophet (ﷺ) conquered Khaibar. He then narrated it like the tradition of Zaid (b. Abu al-Zarqa'). This version has: He then assessed the produce of the palm-trees and said: I take the job of picking the fruit myself, and I shall give you half of (the amount) I said.",
      "usc_msa_ref": "",
      "chain": [
        "31160",
        "20633",
        "20646",
        "11725"
      ]
    },
    {
      "id": "sunan-abi-daud-3864",
      "hadith_no": "3864",
      "source": "Sunan Abi Da'ud",
      "chapter": "Medicine (Kitab Al-Tibb) - كتاب الطب",
      "chapter_no": "29",
      "text_ar": "حدثنا محمد بن سليمان الأنباري، حدثنا أبو معاوية، عن الأعمش، عن أبي سفيان، عن جابر، قال بعث النبي صلى الله عليه وسلم إلى أبى طبيبا فقطع منه عرقا ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     The Prophet (ﷺ) sent a physician to Ubayy (ibn Ka'b), and he cut his vein.",
      "usc_msa_ref": "",
      "chain": [
        "31160",
        "20354",
        "11060",
        "11249",
        "34"
      ]
    },
    {
      "id": "sunan-abi-daud-3950",
      "hadith_no": "3950",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Book of Manumission of Slaves - كتاب العتق",
      "chapter_no": "31",
      "text_ar": "حدثنا محمد بن سليمان الأنباري، حدثنا عبد الوهاب، عن سعيد، عن قتادة، أن عمر بن الخطاب، - رضى الله عنه - قال من ملك ذا رحم محرم فهو حر ‏.‏",
      "text_en": " Narrated Umar ibn al-Khattab:                     Qatadah reported Umar ibn al-Khattab (may Allah be pleased with him) as saying: If anyone gets possession of a relative who is within the prohibited degrees, that person becomes free.",
      "usc_msa_ref": "",
      "chain": [
        "31160",
        "20259",
        "11168",
        "11019",
        "3"
      ]
    },
    {
      "id": "sunan-abi-daud-3975",
      "hadith_no": "3975",
      "source": "Sunan Abi Da'ud",
      "chapter": "Dialects and Readings of the Qur'an (Kitab Al-Huruf Wa Al-Qira'at) - كتاب الحروف والقراءات",
      "chapter_no": "32",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا ابن أبي الزناد، ح وحدثنا محمد بن سليمان الأنباري، حدثنا حجاج بن محمد، عن ابن أبي الزناد، - وهو أشبع - عن أبيه، عن خارجة بن زيد بن ثابت، عن أبيه، أن النبي صلى الله عليه وسلم كان يقرأ ‏{‏ غير أولي الضرر ‏}‏ ولم يقل سعيد كان يقرأ ‏.‏",
      "text_en": " Narrated Zayd ibn Thabit:                     The Prophet (ﷺ) used to read: \"Not equal are those believers who sit (at home) and receive no hurt (ghayru ulid-darari) but the narrator Sa'id did not say the words \"used to read\"",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20509",
        "31160",
        "20381",
        "20509",
        "11061",
        "11006",
        "49"
      ]
    },
    {
      "id": "sunan-abi-daud-4183",
      "hadith_no": "4183",
      "source": "Sunan Abi Da'ud",
      "chapter": "Combing the Hair (Kitab Al-Tarajjul) - كتاب الترجل",
      "chapter_no": "35",
      "text_ar": "حدثنا عبد الله بن مسلمة، ومحمد بن سليمان الأنباري، قالا حدثنا وكيع، عن سفيان، عن أبي إسحاق، عن البراء، قال ما رأيت من ذي لمة أحسن في حلة حمراء من رسول الله صلى الله عليه وسلم زاد محمد بن سليمان له شعر يضرب منكبيه ‏.‏ قال أبو داود وكذا رواه إسرائيل عن أبي إسحاق قال يضرب منكبيه وقال شعبة يبلغ شحمة أذنيه ‏.‏",
      "text_en": " Narrated Al-Bara' :                     I did not see any man with locks hanging down to shoulders in red robe more beautiful than the Messenger of Allah (ﷺ). Muhammad b. Sulaiman added: He had hair which touched his shoulders.Abu Dawud said: Isra'il also transmitted it in a similar way from Abu Ishaq saying: \"(his hair) touched his shoulders\". Shu'bah added: (His hair) reached the lobes of his ears.",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "31160",
        "20032",
        "20012",
        "11049",
        "400"
      ]
    },
    {
      "id": "sunan-abi-daud-4254",
      "hadith_no": "4254",
      "source": "Sunan Abi Da'ud",
      "chapter": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim) - كتاب الفتن والملاحم",
      "chapter_no": "37",
      "text_ar": "حدثنا محمد بن سليمان الأنباري، حدثنا عبد الرحمن، عن سفيان، عن منصور، عن ربعي بن حراش، عن البراء بن ناجية، عن عبد الله بن مسعود، عن النبي صلى الله عليه وسلم قال ‏\"‏ تدور رحى الإسلام لخمس وثلاثين أو ست وثلاثين أو سبع وثلاثين فإن يهلكوا فسبيل من هلك وإن يقم لهم دينهم يقم لهم سبعين عاما ‏\"‏ ‏.‏ قال قلت أمما بقي أو مما مضى قال ‏\"‏ مما مضى ‏\"‏ ‏.‏ قال أبو داود من قال خراش فقد أخطأ ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     The Prophet (ﷺ) said: The mill of Islam will go round till the year thirty-five, or thirty-six, or thirty-seven; then if they perish, they will have followed the path of those who perished before them, but if their religion is maintained, it will be maintained for seventy years. I asked: Does it mean seventy years which remain or seventy years which are gone by? He replied: It means (seventy years) that are gone by.Abu Dawud said: Those who recorded Khirash, the name of a narrator, are wrong. (The correct name is Hirash)",
      "usc_msa_ref": "",
      "chain": [
        "31160",
        "20033",
        "20012",
        "11067",
        "11334",
        "16"
      ]
    },
    {
      "id": "sunan-abi-daud-4375",
      "hadith_no": "4375",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا جعفر بن مسافر، ومحمد بن سليمان الأنباري، قالا أخبرنا ابن أبي فديك، عن عبد الملك بن زيد، - نسبه جعفر إلى سعيد بن زيد بن عمرو بن نفيل - عن محمد بن أبي بكر، عن عمرة، عن عائشة، رضى الله عنها قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ أقيلوا ذوي الهيئات عثراتهم إلا الحدود ‏\"‏ ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     The Messenger of Allah (ﷺ) Said: Forgive the people of good qualities their slips, but not faults to which prescribed penalties apply.",
      "usc_msa_ref": "",
      "chain": [
        "38132",
        "31160",
        "20172",
        "11214",
        "11455",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-4419",
      "hadith_no": "4419",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا محمد بن سليمان الأنباري، حدثنا وكيع، عن هشام بن سعد، قال حدثني يزيد بن نعيم بن هزال، عن أبيه، قال كان ماعز بن مالك يتيما في حجر أبي ‏.‏ فأصاب جارية من الحى فقال له أبي ائت رسول الله صلى الله عليه وسلم فأخبره بما صنعت لعله يستغفر لك وإنما يريد بذلك رجاء أن يكون له مخرجا فأتاه فقال يا رسول الله إني زنيت فأقم على كتاب الله ‏.‏ فأعرض عنه فعاد فقال يا رسول الله إني زنيت فأقم على كتاب الله ‏.‏ حتى قالها أربع مرار ‏.‏ قال صلى الله عليه وسلم ‏\"‏ إنك قد قلتها أربع مرات فبمن ‏\"‏ ‏.‏ قال بفلانة ‏.‏ قال ‏\"‏ هل ضاجعتها ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ هل باشرتها ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ هل جامعتها ‏\"‏ ‏.‏ قال نعم ‏.‏ قال فأمر به أن يرجم فأخرج به إلى الحرة ‏.‏ فلما رجم فوجد مس الحجارة جزع فخرج يشتد فلقيه عبد الله بن أنيس وقد عجز أصحابه فنزع له بوظيف بعير فرماه به فقتله ثم أتى النبي صلى الله عليه وسلم فذكر ذلك له فقال ‏\"‏ هلا تركتموه لعله أن يتوب فيتوب الله عليه ‏\"‏ ‏.‏",
      "text_en": " Narrated Nu'aym ibn Huzzal:                     Yazid ibn Nu'aym ibn Huzzal, on his father's authority said: Ma'iz ibn Malik was an orphan under the protection of my father. He had illegal sexual intercourse with a slave-girl belonging to a clan. My father said to him: Go to the Messenger of Allah (ﷺ) and inform him of what you have done, for he may perhaps ask Allah for your forgiveness. His purpose in that was simply a hope that it might be a way of escape for him.  So he went to him and said: Messenger of Allah! I have committed fornication, so inflict on me the punishment ordained by Allah. He (the Prophet) turned away from him, so he came back and said: Messenger of Allah! I have committed fornication, so inflict on me the punishment ordained by Allah. He (again) turned away from him, so he came back and said: Messenger of Allah! I have committed fornication, so inflict on me the punishment ordained by Allah.  When he uttered it four times, the Messenger of Allah (ﷺ) said: You have said it four times. With whom did you commit it?  He replied: With so and so.  He asked: Did you lie down with her?  He replied: Yes.  He asked: Had your skin been in contact with hers?  He replied. Yes.  He asked: Did you have intercourse with her?  He said: Yes. So he (the Prophet) gave orders that he should be stoned to death. He was then taken out to the Harrah, and while he was being stoned he felt the effect of the stones and could not bear it and fled. But Abdullah ibn Unays encountered him when those who had been stoning him could not catch up with him. He threw the bone of a camel's foreleg at him, which hit him and killed him. They then went to the Prophet (ﷺ) and reported it to him.  He said: Why did you not leave him alone. Perhaps he might have repented and been forgiven by Allah.",
      "usc_msa_ref": "",
      "chain": [
        "31160",
        "20032",
        "20519",
        "10982"
      ]
    },
    {
      "id": "sunan-abi-daud-4546",
      "hadith_no": "4546",
      "source": "Sunan Abi Da'ud",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا محمد بن سليمان الأنباري، حدثنا زيد بن الحباب، عن محمد بن مسلم، عن عمرو بن دينار، عن عكرمة، عن ابن عباس، أن رجلا، من بني عدي قتل فجعل النبي صلى الله عليه وسلم ديته اثنى عشر ألفا ‏.‏ قال أبو داود رواه ابن عيينة عن عمرو عن عكرمة عن النبي صلى الله عليه وسلم لم يذكر ابن عباس ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     A man of Banu Adi was killed. The Prophet (ﷺ) fixed his blood-wit at the rate of twelve thousand (dirhams).Abu Dawud said: Ibn 'Uyainah transmitted it from 'Amr, from 'Ikrimah, from the Prophet (ﷺ), and he did not mention Ibn 'Abbas.",
      "usc_msa_ref": "",
      "chain": [
        "31160",
        "20650",
        "167",
        "11081",
        "11023",
        "17"
      ]
    },
    {
      "id": "sunan-abi-daud-4680",
      "hadith_no": "4680",
      "source": "Sunan Abi Da'ud",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا محمد بن سليمان الأنباري، وعثمان بن أبي شيبة، - المعنى - قالا حدثنا وكيع، عن سفيان، عن سماك، عن عكرمة، عن ابن عباس، قال لما توجه النبي صلى الله عليه وسلم إلى الكعبة قالوا يا رسول الله فكيف الذين ماتوا وهم يصلون إلى بيت المقدس فأنزل الله تعالى ‏{‏ وما كان الله ليضيع إيمانكم ‏}‏ ‏.‏",
      "text_en": " Ibn ‘Abbas said:                      when the Prophet (May peace be upon him) turned towards the Ka’bah (in prayer), the people asked : Messenger of Allah (May peace be upon him)! what will happen with those who died while they prayed with their faces towards Jerusalem ? Allah the Exalted, then revealed : “And never would Allah make your faith of no effect.”",
      "usc_msa_ref": "",
      "chain": [
        "31160",
        "20032",
        "20012",
        "10770",
        "11023",
        "17"
      ]
    },
    {
      "id": "sunan-abi-daud-4751",
      "hadith_no": "4751",
      "source": "Sunan Abi Da'ud",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا محمد بن سليمان الأنباري، حدثنا عبد الوهاب بن عطاء الخفاف أبو نصر، عن سعيد، عن قتادة، عن أنس بن مالك، قال ‏:‏ إن نبي الله صلى الله عليه وسلم دخل نخلا لبني النجار فسمع صوتا ففزع فقال ‏:‏ ‏\"‏ من أصحاب هذه القبور ‏\"‏ ‏.‏ قالوا ‏:‏ يا رسول الله ناس ماتوا في الجاهلية ‏.‏ فقال ‏:‏ ‏\"‏ تعوذوا بالله من عذاب النار ومن فتنة الدجال ‏\"‏ ‏.‏ قالوا ‏:‏ ومم ذاك يا رسول الله قال ‏:‏ ‏\"‏ إن المؤمن إذا وضع في قبره أتاه ملك فيقول له ‏:‏ ما كنت تعبد فإن الله هداه قال ‏:‏ كنت أعبد الله ‏.‏ فيقال له ‏:‏ ما كنت تقول في هذا الرجل فيقول ‏:‏ هو عبد الله ورسوله فما يسأل عن شىء غيرها فينطلق به إلى بيت كان له في النار، فيقال له ‏:‏ هذا بيتك كان لك في النار ولكن الله عصمك ورحمك فأبدلك به بيتا في الجنة فيقول ‏:‏ دعوني حتى أذهب فأبشر أهلي ‏.‏ فيقال له ‏:‏ اسكن ‏.‏ وإن الكافر إذا وضع في قبره أتاه ملك فينتهره فيقول له ‏:‏ ما كنت تعبد فيقول ‏:‏ لا أدري ‏.‏ فيقال له ‏:‏ لا دريت ولا تليت ‏.‏ فيقال له ‏:‏ فما كنت تقول في هذا الرجل فيقول ‏:‏ كنت أقول ما يقول الناس ‏.‏ فيضربه بمطراق من حديد بين أذنيه فيصيح صيحة يسمعها الخلق غير الثقلين ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik said:                      The Messenger of Allah(ﷺ) entered the garden of the palm trees of Banu al-Najjar. He heard a voice and was terrified. He asked: Who are the people buried in these graves? The people replied: Messenger of Allah! These are some people who died in the pre-Islamic times. He said: Seek refuge in Allah from the punishment of the fire, and the trail of Antichrist. They asked: Why is it that, Messenger of Allah? He said: When a man is placed in his grave, an angel comes to him and says to him: Whom did you worship? Allah then guides him and he says: I worshiped Allah. He is then asked: What was your opinion of this man? He replies: He is Allah’s servant and His Apostle. He will not then be asked about anything else. He will then be taken to his abode in Hell and will be told: This was your abode in Hell, but Allah protected you and had mercy on you substituted for you an abode in Paradise for it. He will say: Leave me so that I may go and give glad tidings to my family. He will be told: Dwell. When an infidel is placed in his grave, an angel comes to him, reprimands him and asks him: Whom did you worship? He replies: I do not know. He will be told: You neither knew nor did you follow(the believers). He is then asked: What was your opinion on this man? He replies: I held the opinion that the other people held. He will then give him a blow between his ears with an iron hammer and will utter a shout which will be heard by all the creatures(near him) with the exception of men and jinn.",
      "usc_msa_ref": "",
      "chain": [
        "31160",
        "11168",
        "11019",
        "19"
      ]
    },
    {
      "id": "sunan-abi-daud-5004",
      "hadith_no": "5004",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن سليمان الأنباري، حدثنا ابن نمير، عن الأعمش، عن عبد الله بن يسار، عن عبد الرحمن بن أبي ليلى، قال حدثنا أصحاب، محمد صلى الله عليه وسلم أنهم كانوا يسيرون مع النبي صلى الله عليه وسلم فنام رجل منهم فانطلق بعضهم إلى حبل معه فأخذه ففزع فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا يحل لمسلم أن يروع مسلما ‏\"‏ ‏.‏",
      "text_en": " Narrated AbdurRahman ibn AbuLayla:                     The Companions of the Prophet (ﷺ) told us that they were travelling with the Prophet (ﷺ). A man of them slept, and one of them went to the rope which he had with him. He took it, by which he was frightened. The Prophet (ﷺ) said: It is not lawful for a Muslim that he frightens a Muslim.",
      "usc_msa_ref": "",
      "chain": [
        "31160",
        "30212",
        "11060",
        "15313",
        "11196"
      ]
    }
  ],
  "total_hadiths": 36
}