{
  "id": "3120",
  "name": "Ma'qil bin Yasar al-Mazni ( معقل بن يسار المزني البصري ( رضي الله عنه",
  "full_name": "Ma'qil bin Yasar al-Mazni ( معقل بن يسار المزني البصري ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Hijaz"
    },
    "death": {
      "date_hijri": "59",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Basra, al-Harra",
      "reason": "NA"
    },
    "places_of_stay": [
      "Hijaz",
      "Medina",
      "Basra"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ ع  -  صحابي ]"
    ],
    "tags": [
      "al-Mazni",
      "Ridwan",
      "Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "3122",
      "name": "al-Nu'man bin Maqrn al-Mazni ( النعمان بن مقرن المزني ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "123",
      "name": "'Imran bin Husain ( عمران بن حصين ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11306",
      "name": "Mua'wiya bin Qurrah bin Iyas معاوية بن قرة بن إياس بن هلال",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19855",
      "name": "'Alqama bin 'Abdullah علقمة بن عبد الله بن سنان",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10677",
      "name": "al-Hakam bin 'Abdullah al-A'raj الحكم بن عبد الله بن إسحاق الأعرج",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11382",
      "name": "'Amr bin Maymun al-Aw'di عمرو بن ميمون الأودي أبو عبد الله",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11016",
      "name": "al-Hasan al-Basri الحسن البصري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19066",
      "name": "Nafi' bin Abi Nafi' نافع بن أبي نافع البزاز",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11453",
      "name": "Abu al-Malih bin Usama أبو المليح بن أسامة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10718",
      "name": "Muslim bin Mukhraq al-Abdi مسلم بن مخراق العبدي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "18835",
      "name": "Ayad Abu Khalid al-Bjly عياض أبو خالد",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-4571",
      "hadith_no": "4571",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عبيد الله بن سعيد، حدثنا أبو عامر العقدي، حدثنا عباد بن راشد، حدثنا الحسن، قال حدثني معقل بن يسار، قال كانت لي أخت تخطب إلى‏.‏ وقال إبراهيم عن يونس، عن الحسن، حدثني معقل بن يسار،‏.‏ حدثنا أبو معمر، حدثنا عبد الوارث، حدثنا يونس، عن الحسن، أن أخت، معقل بن يسار طلقها زوجها، فتركها حتى انقضت عدتها، فخطبها فأبى معقل، فنزلت ‏{‏فلا تعضلوهن أن ينكحن أزواجهن‏}‏‏.‏",
      "text_en": " Narrated Al-Hasan:                     The sister of Ma'qal bin Yasar was divorced by her husband who left her till she had fulfilled her term of 'Iddat (i.e. the period which should elapse before she can Remarry) and then he wanted to remarry her but Maqal refused, so this Verse was revealed:-- \"Do not prevent them from marrying their (former) husbands.\" (2.232)",
      "usc_msa_ref": "52",
      "chain": [
        "30359",
        "20443",
        "20242",
        "11016",
        "3120",
        "20150",
        "20475",
        "11016",
        "30315",
        "20258",
        "20475",
        "11016"
      ]
    },
    {
      "id": "sahih-bukhari-5185",
      "hadith_no": "5185",
      "source": "Sahih Bukhari",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا أحمد بن أبي عمرو، قال حدثني أبي قال، حدثني إبراهيم، عن يونس، عن الحسن، ‏{‏فلا تعضلوهن‏}‏ قال حدثني معقل بن يسار، أنها نزلت فيه قال زوجت أختا لي من رجل فطلقها، حتى إذا انقضت عدتها جاء يخطبها، فقلت له زوجتك وفرشتك وأكرمتك، فطلقتها، ثم جئت تخطبها، لا والله لا تعود إليك أبدا، وكان رجلا لا بأس به وكانت المرأة تريد أن ترجع إليه فأنزل الله هذه الآية ‏{‏فلا تعضلوهن‏}‏ فقلت الآن أفعل يا رسول الله‏.‏ قال فزوجها إياه‏.‏",
      "text_en": " Narrated Al-Hasan:                     concerning the Verse: 'Do not prevent them' (2.232) Ma'qil bin Yasar told me that it was revealed in his connection. He said, \"I married my sister to a man and he divorced her, and when her days of 'Idda (three menstrual periods) were over, the man came again and asked for her hand, but I said to him, 'I married her to you and made her your bed (your wife) and favored you with her, but you divorced her. Now you come to ask for her hand again? No, by Allah, she will never go back to you (again)!' That man was not a bad man and his wife wanted to go back to him. So Allah revealed this Verse: 'Do not prevent them.' (2.232) So I said, 'Now I will do it (let her go back to him), O Allah's Apostle.\"So he married her to him again.",
      "usc_msa_ref": "61",
      "chain": [
        "11051",
        "20475",
        "3120"
      ]
    },
    {
      "id": "sahih-muslim-4837",
      "hadith_no": "4837",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا عقبة بن مكرم العمي، حدثنا يعقوب بن إسحاق، أخبرني سوادة بن أبي، الأسود حدثني أبي أن معقل بن يسار، مرض فأتاه عبيد الله بن زياد يعوده ‏.‏ نحو حديث الحسن عن معقل، ‏.‏",
      "text_en": " It has been narrated on the authority of Abu al-Aswad who said:                      My father related to me that Ma'qil b. Yasir fell ill. 'Ubaidullah b. Ziyad called on him to inquire after his health. Here follows the tradition as narrated by Hasan from Ma'qil.",
      "usc_msa_ref": "",
      "chain": [
        "30441",
        "20679",
        "20549",
        "10718",
        "3120"
      ]
    },
    {
      "id": "sahih-muslim-4924",
      "hadith_no": "4924",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا يحيى بن يحيى، أخبرنا يزيد بن زريع، عن خالد، عن الحكم بن عبد الله، بن الأعرج عن معقل بن يسار، قال لقد رأيتني يوم الشجرة والنبي صلى الله عليه وسلم يبايع الناس وأنا رافع غصنا من أغصانها عن رأسه ونحن أربع عشرة مائة قال لم نبايعه على الموت ولكن بايعناه على أن لا نفر ‏.‏",
      "text_en": " It has been narrated on the authority of Ma'qil b. Yasar who aaid:                      I remember being present on the Day of the Tree, and the Holy Prophet (may peace be upon him) was taking the oath of the people and I was holding a twig of the tree over his head. We were fourteen hundred (in number). We did not take oath to the death, but to the effect that we would not run away from the battlefield.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20304",
        "11282",
        "3120"
      ]
    },
    {
      "id": "sahih-muslim-7587",
      "hadith_no": "7587",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا حماد بن زيد، عن معلى بن زياد، عن معاوية بن، قرة عن معقل بن يسار، أن رسول الله صلى الله عليه وسلم ح",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20022",
        "11306",
        "3120"
      ]
    },
    {
      "id": "sunan-abi-daud-2050",
      "hadith_no": "2050",
      "source": "Sunan Abi Da'ud",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا أحمد بن إبراهيم، حدثنا يزيد بن هارون، أخبرنا مستلم بن سعيد ابن أخت، منصور بن زاذان عن منصور، - يعني ابن زاذان - عن معاوية بن قرة، عن معقل بن يسار، قال جاء رجل إلى النبي صلى الله عليه وسلم فقال إني أصبت امرأة ذات حسب وجمال وإنها لا تلد أفأتزوجها قال ‏\"‏ لا ‏\"‏ ‏.‏ ثم أتاه الثانية فنهاه ثم أتاه الثالثة فقال ‏\"‏ تزوجوا الودود الولود فإني مكاثر بكم الأمم ‏\"‏ ‏.‏",
      "text_en": " Narrated Ma'qil ibn Yasar:                     A man came to the Prophet (ﷺ) and said: I have found a woman of rank and beauty, but she does not give birth to children. Should I marry her? He said: No. He came again to him, but he prohibited him. He came to him third time, and he (the Prophet) said: Marry women who are loving and very prolific, for I shall outnumber the peoples by you.",
      "usc_msa_ref": "",
      "chain": [
        "30494",
        "20472",
        "20742",
        "11444",
        "11306",
        "3120"
      ]
    },
    {
      "id": "sunan-abi-daud-2087",
      "hadith_no": "2087",
      "source": "Sunan Abi Da'ud",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا محمد بن المثنى، حدثني أبو عامر، حدثنا عباد بن راشد، عن الحسن، حدثني معقل بن يسار، قال كانت لي أخت تخطب إلى فأتاني ابن عم لي فأنكحتها إياه ثم طلقها طلاقا له رجعة ثم تركها حتى انقضت عدتها فلما خطبت إلى أتاني يخطبها فقلت لا والله لا أنكحها أبدا ‏.‏ قال ففي نزلت هذه الآية ‏{‏ وإذا طلقتم النساء فبلغن أجلهن فلا تعضلوهن أن ينكحن أزواجهن ‏}‏ الآية ‏.‏ قال فكفرت عن يميني فأنكحتها إياه ‏.‏",
      "text_en": " Ma’qil bin Yasar said:                      I had a sister and I was asked to give her in marriage. My cousin came to me and I married her to him. He then divorced her one revocable divorce. He abandoned her till her waiting period passed. When I was asked to give her in marriage, he again came to me and asked her in marriage. Thereupon I said to him “No, by Allah, I will never marry her to you. Then the following verse was revealed about my case: “And when ye have divorced women and they reach their term, place not difficulties in the way of their marrying their husbands.” So I expiated for my oath, and married her off to him.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20443",
        "20242",
        "11016",
        "3120"
      ]
    },
    {
      "id": "sunan-abi-daud-2655",
      "hadith_no": "2655",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، أخبرنا أبو عمران الجوني، عن علقمة بن عبد الله المزني، عن معقل بن يسار، أن النعمان، - يعني ابن مقرن - قال شهدت رسول الله صلى الله عليه وسلم إذا لم يقاتل من أول النهار أخر القتال حتى تزول الشمس وتهب الرياح وينزل النصر ‏.‏",
      "text_en": " Narrated An-Nu'man ibn Muqarrin:                     I was present at fighting along with the Messenger of Allah (ﷺ), and when he did not fight at the beginning of the day, he waited till the sun had passed the meridian, the winds blew, and help came down.",
      "usc_msa_ref": "",
      "chain": [
        "20040",
        "20022",
        "11296",
        "19855",
        "3120",
        "3122"
      ]
    },
    {
      "id": "sunan-abi-daud-3121",
      "hadith_no": "3121",
      "source": "Sunan Abi Da'ud",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا محمد بن العلاء، ومحمد بن مكي المروزي، - المعنى - قالا حدثنا ابن المبارك، عن سليمان التيمي، عن أبي عثمان، - وليس بالنهدي - عن أبيه، عن معقل بن يسار، قال قال النبي صلى الله عليه وسلم ‏\"‏ اقرءوا ‏{‏ يس ‏}‏ على موتاكم ‏\"‏ ‏.‏ وهذا لفظ ابن العلاء ‏.‏",
      "text_en": " Narrated Ma'qil ibn Yasar:                     The Prophet (ﷺ) said: Recite Surah Ya-Sin over your dying men. This is the version of Ibn al-Ala'",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20025",
        "11289",
        "3120"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1613",
      "hadith_no": "1613",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Military Expeditions - كتاب السير عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "21",
      "text_ar": "حدثنا الحسن بن علي الخلال، حدثنا عفان بن مسلم، والحجاج بن منهال، قالا حدثنا حماد بن سلمة، حدثنا أبو عمران الجوني، عن علقمة بن عبد الله المزني، عن معقل بن يسار، أن عمر بن الخطاب، بعث النعمان بن مقرن إلى الهرمزان فذكر الحديث بطوله فقال النعمان بن مقرن شهدت مع رسول الله صلى الله عليه وسلم فكان إذا لم يقاتل أول النهار انتظر حتى تزول الشمس وتهب الرياح وينزل النصر ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وعلقمة بن عبد الله هو أخو بكر بن عبد الله المزني ‏.‏",
      "text_en": " Narrated Ma'qil bin Yasar:                     \"Umar bin Al-Khattab sent An-Nu'man bin Muqarrin to Al-Hurmuzan.\" And he mentioned the Hadith in its entirety. An-Nu'man bin Muqarrin said: \"I participated (in battles) with the Messenger of Allah (ﷺ). So when he did not fight in the beginning if the daytime, he would wait until the sun passed the zenith, and the wind of victory would rage, and victory would descent upon them.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. 'Alqamah bin 'Abdullah (one of the narrators) is the brother of Bakr bin 'Abdullah Al-Muzani.",
      "usc_msa_ref": "",
      "chain": [
        "30115",
        "30106",
        "20219",
        "20021",
        "11296",
        "19855",
        "3120",
        "3"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3172",
      "hadith_no": "3172",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on The Virtues of the Qur'an - كتاب فضائل القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو أحمد الزبيري، حدثنا خالد بن طهمان أبو العلاء الخفاف، حدثني نافع بن أبي نافع، عن معقل بن يسار، عن النبي صلى الله عليه وسلم قال ‏\"‏ من قال حين يصبح ثلاث مرات أعوذ بالله السميع العليم من الشيطان الرجيم وقرأ ثلاث آيات من آخر سورة الحشر وكل الله به سبعين ألف ملك يصلون عليه حتى يمسي وإن مات في ذلك اليوم مات شهيدا ومن قالها حين يمسي كان بتلك المنزلة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من هذا الوجه ‏.‏",
      "text_en": " Narrated Ma'qil bin Yasar:                     that the Prophet (ﷺ) said: \"Whoever says three times when he gets up in the morning: 'A'udhu Billahis-Sami Al-'Alim Min Ash-Shaitanir-Rajim' and he recites three Ayat from the end of Surah Al-Hashr - Allah appoints seventy-thousand angels who say Salat upon him until the evening. If he dies on that day, he dies a martyr, and whoever reaches the evening, he holds the same status.\"",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20355",
        "19066",
        "3120"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3248",
      "hadith_no": "3248",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، حدثنا هشام بن القاسم، عن المبارك بن فضالة، عن الحسن، عن معقل بن يسار، أنه زوج أخته رجلا من المسلمين على عهد رسول الله صلى الله عليه وسلم فكانت عنده ما كانت ثم طلقها تطليقة لم يراجعها حتى انقضت العدة فهويها وهويته ثم خطبها مع الخطاب فقال له يا لكع أكرمتك بها وزوجتكها فطلقتها والله لا ترجع إليك أبدا آخر ما عليك قال فعلم الله حاجته إليها وحاجتها إلى بعلها فأنزل الله ‏(‏ وإذا طلقتم النساء فبلغن أجلهن ‏)‏ إلى قوله ‏:‏‏(‏ وأنتم لا تعلمون ‏)‏ فلما سمعها معقل قال سمعا لربي وطاعة ثم دعاه فقال أزوجك وأكرمك ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وقد روي من غير وجه عن الحسن ‏.‏ وفي هذا الحديث دلالة على أنه لا يجوز النكاح بغير ولي لأن أخت معقل بن يسار كانت ثيبا فلو كان الأمر إليها دون وليها لزوجت نفسها ولم تحتج إلى وليها معقل بن يسار وإنما خاطب الله في الآية الأولياء فقال ‏:‏ ‏(‏ولا تعضلوهن أن ينكحن أزواجهن ‏)‏ ففي هذه الآية دلالة على أن الأمر إلى الأولياء في التزويج مع رضاهن ‏.‏",
      "text_en": " Narrated Al-Hasan:                     from Ma'qil bin Yasar that he married his sister to a man among the Muslims during the time of the Messenger of Allah (ﷺ). She remained with him as long as she did, then he divorced her once without taking her back until her 'Iddah elapsed, but they desired each other again. He (Ma'qil) said to him: 'You ingrate! I honored you by marrying her to you, then you divorced her. By Allah! She will never be returned to you again.' Allah knew of his heed for her and her need for a husband, so Allah, Blessed and Most High, revealed: 'And when you have divorced women and they have fulfilled the term of their prescribed period...' up to His saying: '... and you do not know (2:232).' So when Ma'qil heard that he said: 'I heard my Lord and obey.' Then he called for him and said: 'I marry you, and honor you.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30553",
        "14352",
        "11016",
        "3120"
      ]
    },
    {
      "id": "sunan-an-nasai-3227",
      "hadith_no": "3227",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا عبد الرحمن بن خالد، قال حدثنا يزيد بن هارون، قال أنبأنا المستلم بن سعيد، عن منصور بن زاذان، عن معاوية بن قرة، عن معقل بن يسار، قال جاء رجل إلى رسول الله صلى الله عليه وسلم فقال إني أصبت امرأة ذات حسب ومنصب إلا أنها لا تلد أفأتزوجها فنهاه ثم أتاه الثانية فنهاه ثم أتاه الثالثة فنهاه فقال ‏\"‏ تزوجوا الولود الودود فإني مكاثر بكم ‏\"‏ ‏.‏",
      "text_en": " Narrated Ma'qil bin Yasar:                     It was narrated that Ma'qil bin Yasar said: \"A man came to the Messenger of Allah and said: 'I have found a woman who is from a good family and of good status, but she does not bear children, should I marry her?' He told him not to. Then he came to him a second time and he told him not to (marry her). Then he came to him a third time and he told him not to (marry her), then he said: 'Marry the one who is fertile and loving, for I will boast of your great numbers.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20376",
        "20472",
        "11444",
        "11306",
        "3120"
      ]
    },
    {
      "id": "sunan-ibn-majah-1515",
      "hadith_no": "1515",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن الحسن بن شقيق، عن ابن المبارك، عن سليمان التيمي، عن أبي عثمان، - وليس بالنهدي - عن أبيه، عن معقل بن يسار، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ اقرءوها عند موتاكم ‏\"‏ ‏.‏ يعني ‏{يس}‏ ‏.‏",
      "text_en": " It wasnarrated from Ma’qil bin Yasar that the Messenger of Allah(ﷺ)said:                      “Recite Qur’an near your dying ones,” meaning Ya-Sin.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30362",
        "20025",
        "11289",
        "3120"
      ]
    },
    {
      "id": "sunan-ibn-majah-2786",
      "hadith_no": "2786",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا إبراهيم بن سعيد الجوهري، حدثنا أنس بن عياض أبو ضمرة، عن عبد السلام بن أبي الجنوب، عن الحسن، عن معقل بن يسار، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ المسلمون يد على من سواهم وتتكافأ دماؤهم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ma'qil bin Yasar that the Messenger of Allah (ﷺ) said:                     “The Muslims are one hand against others, and their blood is equal.”",
      "usc_msa_ref": "",
      "chain": [
        "30498",
        "20157",
        "22125",
        "11016",
        "3120"
      ]
    },
    {
      "id": "sunan-ibn-majah-2826",
      "hadith_no": "2826",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Shares of Inheritance - كتاب الفرائض",
      "chapter_no": "23",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا شبابة، حدثنا يونس بن أبي إسحاق، عن أبي إسحاق، عن عمرو بن ميمون، عن معقل بن يسار المزني، قال سمعت النبي صلى الله عليه وسلم أتي بفريضة فيها جد فأعطاه ثلثا أو سدسا ‏.‏",
      "text_en": " It wasnarrated that Ma’qil bin Yasar Al-Muzani said:                      “I heard theProphet (ﷺ) when a case was brought to him which involved the shareof a grandfather. He gave him one third, or one sixth.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20426",
        "10846",
        "11049",
        "11382",
        "3120"
      ]
    },
    {
      "id": "sunan-ibn-majah-2827",
      "hadith_no": "2827",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Shares of Inheritance - كتاب الفرائض",
      "chapter_no": "23",
      "text_ar": "قال أبو الحسن القطان حدثنا أبو حاتم، حدثنا ابن الطباع، حدثنا هشيم، عن يونس، عن الحسن، عن معقل بن يسار، قال قضى رسول الله صلى الله عليه وسلم في جد كان فينا بالسدس ‏.‏",
      "text_en": " It wasnarrated that Ma’qil bin Yasar said:                      “The Messenger of Allah(ﷺ) ruled concerning a grandfather who was among us, that he shouldreceive one sixth.”",
      "usc_msa_ref": "",
      "chain": [
        "38473",
        "20468",
        "20475",
        "11016",
        "3120"
      ]
    },
    {
      "id": "sunan-ibn-majah-3403",
      "hadith_no": "3403",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا يزيد بن زريع، عن يونس، عن الحسن، عن معقل بن يسار، قال بينما هو يتغدى إذ سقطت منه لقمة فتناولها فأماط ما كان فيها من أذى فأكلها فتغامز به الدهاقين فقيل أصلح الله الأمير إن هؤلاء الدهاقين يتغامزون من أخذك اللقمة وبين يديك هذا الطعام ‏.‏ قال إني لم أكن لأدع ما سمعت من رسول الله  صلى الله عليه وسلم  لهذه الأعاجم إنا كنا نأمر أحدنا إذا سقطت لقمته أن يأخذها فيميط ما كان فيها من أذى ويأكلها ولا يدعها للشيطان ‏.‏",
      "text_en": " It wasnarrated from Hasan about Ma’qil bin Yasar:                      “While (he) waseating lunch, a morsel of food fell on the floor. He picked it up,removed whatever dirt had gotten onto it, and ate it. The villagersand farmers winked at one another (finding it odd) and it was said:‘May Allah help the chief! These villagers and farmers are winkingatone another because you picked up a morsel (from the ground) whenyouhave this food in front of you.’ He said: ‘I am not going togive upsomething I heard from the Messenger of Allah (ﷺ) for thesenon-Arabs. We were told, if one of us dropped a morsel of food, topick itup, remove whatever dirt was on it, and eat it, and not toleave itfor Satan.’”",
      "usc_msa_ref": "",
      "chain": [
        "30547",
        "20304",
        "20475",
        "11016",
        "3120"
      ]
    },
    {
      "id": "sunan-ibn-majah-4120",
      "hadith_no": "4120",
      "source": "Sunan Ibn Majah",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا حميد بن مسعدة، حدثنا جعفر بن سليمان، عن المعلى بن زياد، عن معاوية بن قرة، عن معقل بن يسار، قال قال رسول  صلى الله عليه وسلم  ‏\"‏ العبادة في الهرج كهجرة إلى ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ma’qil bin Yasar that the Messenger of Allah(ﷺ) said:                      “Worship during the time of bloodshed is likeemigratingto me.”",
      "usc_msa_ref": "",
      "chain": [
        "30430",
        "20532",
        "11306",
        "3120"
      ]
    }
  ],
  "total_hadiths": 19
}