{
  "id": "3131",
  "name": "Burayda bin al-Husayb ( بريدة بن الحصيب ( رضي الله عنه",
  "full_name": "Burayda bin al-Husayb ( بريدة بن الحصيب ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Hijaz"
    },
    "death": {
      "date_hijri": "63",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Basra",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina",
      "Makkah",
      "Basra"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ ع  -  صحابي ]"
    ],
    "tags": [
      "al-Aslami",
      "Khaybar",
      "Conquest"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "10916",
      "name": "Sulaiman bin Burayda bin al-Husayb سليمان بن بريدة بن الحصيب",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11432",
      "name": "'Abdullah bin Burayda bin al-Husayb عبد الله بن بريدة بن الحصيب الأسلمي",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "students": [
    {
      "id": "10916",
      "name": "Sulaiman bin Burayda bin al-Husayb سليمان بن بريدة بن الحصيب",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11432",
      "name": "'Abdullah bin Burayda bin al-Husayb عبد الله بن بريدة بن الحصيب الأسلمي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "18502",
      "name": "'Abdullah bin Aws عبد الله بن أوس الخزاعي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11052",
      "name": "'Amir al-Sha'bi عامر الشعبي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11453",
      "name": "Abu al-Malih bin Usama أبو المليح بن أسامة",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-4393",
      "hadith_no": "4393",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني محمد بن بشار، حدثنا روح بن عبادة، حدثنا علي بن سويد بن منجوف، عن عبد الله بن بريدة، عن أبيه  رضى الله عنه  قال بعث النبي صلى الله عليه وسلم عليا إلى خالد ليقبض الخمس وكنت أبغض عليا، وقد اغتسل، فقلت لخالد ألا ترى إلى هذا فلما قدمنا على النبي صلى الله عليه وسلم ذكرت ذلك له فقال ‏\"‏ يا بريدة أتبغض عليا ‏\"‏‏.‏ فقلت نعم‏.‏ قال ‏\"‏ لا تبغضه فإن له في الخمس أكثر من ذلك ‏\"‏‏.‏",
      "text_en": " Narrated Buraida:                     The Prophet sent `Ali to Khalid to bring the Khumus (of the booty) and I hated `Ali, and `Ali had taken a bath (after a sexual act with a slave-girl from the Khumus). I said to Khalid, \"Don't you see this (i.e. `Ali)?\" When we reached the Prophet I mentioned that to him. He said, \"O Buraida! Do you hate `Ali?\" I said, \"Yes.\" He said, \"Do you hate him, for he deserves more than that from the Khumlus.\"",
      "usc_msa_ref": "637",
      "chain": [
        "30160",
        "20229",
        "11606",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sahih-bukhari-4513",
      "hadith_no": "4513",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني أحمد بن الحسن، حدثنا أحمد بن محمد بن حنبل بن هلال، حدثنا معتمر بن سليمان، عن كهمس، عن ابن بريدة، عن أبيه، قال غزا مع رسول الله صلى الله عليه وسلم ست عشرة غزوة‏.‏",
      "text_en": " Narrated Buraida:                     That he fought sixteen Ghazawat with Allah''s Apostle.",
      "usc_msa_ref": "749",
      "chain": [
        "30292",
        "30007",
        "20288",
        "11303",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sahih-muslim-277-2",
      "hadith_no": "277",
      "source": "Sahih Muslim",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبي، حدثنا سفيان، عن علقمة بن مرثد، ح وحدثني محمد بن حاتم، - واللفظ له - حدثنا يحيى بن سعيد، عن سفيان، قال حدثني علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، أن النبي صلى الله عليه وسلم صلى الصلوات يوم الفتح بوضوء واحد ومسح على خفيه فقال له عمر لقد صنعت اليوم شيئا لم تكن تصنعه ‏.‏ قال ‏\"‏ عمدا صنعته يا عمر ‏\"‏ ‏.‏",
      "text_en": " Sulaiman b. Buraida narrated it from his father that the Apostle of Allah (may peace be upon him) offered prayers with one ablution on the day of the Conquest (of Mecca) and wiped over the socks. 'Umar said to him:                      You have today done something that you have not been accustomed to before. He (the Holy Prophet) said: 0 'Umar, I have done that on purpose.",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20331",
        "20012",
        "11374",
        "38487",
        "20031",
        "20012",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "id": "sahih-muslim-1290",
      "hadith_no": "1290",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني حجاج بن الشاعر، حدثنا عبد الرزاق، أخبرنا الثوري، عن علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، أن رجلا، نشد في المسجد فقال من دعا إلى الجمل الأحمر ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ لا وجدت ‏.‏ إنما بنيت المساجد لما بنيت له ‏\"‏ ‏.‏",
      "text_en": " Sulaiman b. Buraida narrated it on the authority of his father that a man cried out in the mosque saying:                      Who had called out for the red camel? Upon this the Apostle of Allah (may peace be upon him) said: May it not be restored to you! The mosques are built for what they are meant.",
      "usc_msa_ref": "",
      "chain": [
        "38834",
        "20121",
        "20012",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "id": "sahih-muslim-1291",
      "hadith_no": "1291",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن أبي سنان، عن علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، أن النبي صلى الله عليه وسلم لما صلى قام رجل فقال من دعا إلى الجمل الأحمر فقال النبي صلى الله عليه وسلم ‏\"‏ لا وجدت إنما بنيت المساجد لما بنيت له ‏\"‏ ‏.‏",
      "text_en": " Sulaiman b. Buraida reported on the authority of his father that when the Apostle of Allah (may peace be upon him) had said prayer a man stood up and said:                      Who called for a red camel? (Upon this) the Apostle of Allah (may peace be upon him) said: May it not be restored to you! The mosques are built for what they are meant.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20032",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "id": "sahih-muslim-1292",
      "hadith_no": "1292",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا جرير، عن محمد بن شيبة، عن علقمة بن مرثد، عن ابن بريدة، عن أبيه، قال جاء أعرابي بعد ما صلى النبي صلى الله عليه وسلم صلاة الفجر ‏.‏ فأدخل رأسه من باب المسجد فذكر ‏.‏ بمثل حديثهما ‏.‏ قال مسلم هو شيبة بن نعامة أبو نعامة روى عنه مسعر وهشيم وجرير وغيرهم من الكوفيين ‏.‏",
      "text_en": " Ibn Buraida narrated it on the authority of his father that a Bedouin came when the Apostle of Allah (may peace be upon him) had completed the morning prayer. He thrust his head in the door of the mosque, and then the hadith (as narrated above) was narrated.This hadith has been reported by another chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20028",
        "11374",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sahih-muslim-1422",
      "hadith_no": "1422",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثني زهير بن حرب، وعبيد الله بن سعيد، كلاهما عن الأزرق، - قال زهير حدثنا إسحاق بن يوسف الأزرق، - حدثنا سفيان، عن علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، عن النبي صلى الله عليه وسلم أن رجلا سأله عن وقت الصلاة فقال له ‏\"‏ صل معنا هذين ‏\"‏ ‏.‏ يعني اليومين فلما زالت الشمس أمر بلالا فأذن ثم أمره فأقام الظهر ثم أمره فأقام العصر والشمس مرتفعة بيضاء نقية ثم أمره فأقام المغرب حين غابت الشمس ثم أمره فأقام العشاء حين غاب الشفق ثم أمره فأقام الفجر حين طلع الفجر فلما أن كان اليوم الثاني أمره فأبرد بالظهر فأبرد بها فأنعم أن يبرد بها وصلى العصر والشمس مرتفعة أخرها فوق الذي كان وصلى المغرب قبل أن يغيب الشفق وصلى العشاء بعد ما ذهب ثلث الليل وصلى الفجر فأسفر بها ثم قال ‏\"‏ أين السائل عن وقت الصلاة ‏\"‏ ‏.‏ فقال الرجل أنا يا رسول الله ‏.‏ قال ‏\"‏ وقت صلاتكم بين ما رأيتم ‏\"‏ ‏.‏",
      "text_en": " Sulaiman b. Buraida narrated it on the authority of his father that a person asked the Apostle of Allah (may peace be upon him) about the time of prayer. Upon this he said:                      Pray with us these two, meaning two days. When the sun passed the meridian. he gave command to Bilal who uttered the call to prayer. then lie commanded him and pronounced Iqama for noon prayer (Then at the tine of the afternoon prayer) he again commanded and Iqama for the afternoon prayer was pronounced when the sun was high, white and clear. He then commanded and Iqama for the evening prayer was pronounced, when the sun had set. He then commanded him and the Iqama for the night prayer was pronounced When the twilight had disappeared. He then commanded him and the Iqama for the morning prayer was pronounced, when the dawn had appeared. When it was the next day, he commanded him to delay the noon prayer till the extreme heat had passed and he did so, and he allowed it to be delayed till the extreme heat had passed. He observed the afternoon prayer when the sun was high, delaying it beyond the time he had previously observed it. He observed the evening prayer before the twilight had vanished; he observed the night prayer when a third of the night had passed; and he observed the dawn prayer when there was clear daylight. He (the Holy Prophet) then said: Where is the man who inquired about the time of prayer? He (the inquirer) said: Messenger of Allah I here I am. He (the Holy Prophet) said: The time for your prayer is within the limits of what you have seen.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "20321",
        "20411",
        "20012",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "id": "sahih-muslim-1423",
      "hadith_no": "1423",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني إبراهيم بن محمد بن عرعرة السامي، حدثنا حرمي بن عمارة، حدثنا شعبة، عن علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، أن رجلا، أتى النبي صلى الله عليه وسلم فسأله عن مواقيت الصلاة فقال ‏\"‏ اشهد معنا الصلاة ‏\"‏ ‏.‏ فأمر بلالا فأذن بغلس فصلى الصبح حين طلع الفجر ثم أمره بالظهر حين زالت الشمس عن بطن السماء ثم أمره بالعصر والشمس مرتفعة ثم أمره بالمغرب حين وجبت الشمس ثم أمره بالعشاء حين وقع الشفق ثم أمره الغد فنور بالصبح ثم أمره بالظهر فأبرد ثم أمره بالعصر والشمس بيضاء نقية لم تخالطها صفرة ثم أمره بالمغرب قبل أن يقع الشفق ثم أمره بالعشاء عند ذهاب ثلث الليل أو بعضه - شك حرمي - فلما أصبح قال ‏\"‏ أين السائل ما بين ما رأيت وقت ‏\"‏ ‏.‏",
      "text_en": " Buraida narrated on the authority of his father that a man came to the Prophet (may peace be upon him) and asked about the times of prayer. He said:                      You observe with us the prayer. He commanded Bilal, and he uttered the call to prayer in the darkness of night preceding daybreak and he said the morning prayer till dawn had appeared. He then commanded him (Bilal) to call for the noon prayer when the sun had declined from the zenith. He then commanded him (Bilal) to call for the afternoon prayer when the sun was high. He then commanded him for the evening prayer when the sun had set. He then commanded him for the night prayer when the twilight had disappeared. Then on the next day he commanded him (to call for prayer) when there was light in the morning. He then commanded him (to call) for the noon prayer when the extreme heat was no more. He then commanded him for the afternoon prayer when the sun was bright and clear and yellowness did not blend with it. He then commanded him to observe the sunset prayer. He then commanded him for the night prayer when a third part of the night bad passed or a bit less than that. Harami (the narrator of this hadith) was in doubt about that part of the mentioned hadith which concerned the portion of the night. When it was dawn, he (the Holy Prophet) said: Where is the inquirer (who inquired about the times of prayer and added): Between (these two extremes) is the time for prayer.",
      "usc_msa_ref": "",
      "chain": [
        "20221",
        "20020",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "id": "sahih-muslim-1887",
      "hadith_no": "1887",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن نمير، ح وحدثنا ابن نمير، حدثنا أبي، حدثنا مالك، - وهو ابن مغول - عن عبد الله بن بريدة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن عبد الله بن قيس أو الأشعري أعطي مزمارا من مزامير آل داود ‏\"‏ ‏.‏",
      "text_en": " Abu Burda narrated on the authority of Abu Musa that the Messenger of Allah (may peace be upon him) had said to Abu Musa:                      If you were to see me, as I was listening to your recitation (of the Qur'an) yester-night (you would have felt delighted). You are in fact endowed with a sweet voice like that of David himself.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20331",
        "30212",
        "20331",
        "20358",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sahih-muslim-2302",
      "hadith_no": "2302",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، قالا حدثنا محمد بن عبد الله، الأسدي عن سفيان، عن علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، قال كان رسول الله صلى الله عليه وسلم يعلمهم إذا خرجوا إلى المقابر فكان قائلهم يقول - في رواية أبي بكر - السلام على أهل الديار - وفي رواية زهير - السلام عليكم أهل الديار من",
      "text_en": " Sulaiman b. Buraida narrated on the authority of his father that the Messenger of Allah (may peace be upon him) used to teach them when they went out to the graveyard. One of the narrators used to say this in the narration transmitted on the authority of Abu Bakr:                     \" Peace be upon the inhabitants of the city (i. e. graveyard).\" In the hadith transmitted by Zuhair (the words are):\" Peace be upon you, the inhabitants of the city, among the believers, and Muslims, and God willing we shall join you. I beg of Allah peace for us and for you.\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30022",
        "20005",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "id": "sahih-muslim-2305",
      "hadith_no": "2305",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن عبد الله بن نمير، ومحمد بن المثنى، - واللفظ لأبي بكر وابن نمير - قالوا حدثنا محمد بن فضيل، عن أبي سنان، - وهو ضرار بن مرة - عن محارب بن دثار، عن ابن بريدة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ نهيتكم عن زيارة القبور فزوروها ونهيتكم عن لحوم الأضاحي فوق ثلاث فأمسكوا ما بدا لكم ونهيتكم عن النبيذ إلا في سقاء فاشربوا في الأسقية كلها ولا تشربوا مسكرا ‏\"‏ ‏.‏ قال ابن نمير في روايته عن عبد الله بن بريدة عن أبيه ‏.‏",
      "text_en": " Ibn Buraida reported on the authority of his father that the Messenger of Allah (may peace be upon him) said:                      I forbade you to visit graves, but you may now visit them; I forbade you to eat the flesh of sacrificial animals after three days, but you way now keep it as along as you feel inclined; and I forbade you nabidh except in a water-skin, you may drink it from all kinds of water-skins, but you must not drink anything intoxicating.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30212",
        "30170",
        "20356",
        "10776",
        "11389",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sahih-muslim-2753",
      "hadith_no": "2753",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثني علي بن حجر السعدي، حدثنا علي بن مسهر أبو الحسن، عن عبد الله، بن عطاء عن عبد الله بن بريدة، عن أبيه، - رضى الله عنه - قال بينا أنا جالس، عند رسول الله صلى الله عليه وسلم إذ أتته امرأة فقالت إني تصدقت على أمي بجارية وإنها ماتت - قال - فقال ‏\"‏ وجب أجرك وردها عليك الميراث ‏\"‏ ‏.‏ قالت يا رسول الله إنه كان عليها صوم شهر أفأصوم عنها قال ‏\"‏ صومي عنها ‏\"‏ ‏.‏ قالت إنها لم تحج قط أفأحج عنها قال ‏\"‏ حجي عنها ‏\"‏ ‏.‏",
      "text_en": " Abdullah b. Buraida (Allah be pleased with him) reported on the authority of his father:                      When we were sitting with the Messenger of Allah (may peace be upon him), a woman came to him and said: I had gifted to my mother a maid-servant, and now she (the mother) has died. Thereupon he (the Holy Prophet) said: There is a definite reward for you and she (the maid-servant) has been returned to you as an inheritance. She (that woman) again said: Fasts of a month (of Ramadan) are due upon her; should I observe them on her behalf? He (the Holy Prophet) said: Observe fasts on her behalf. She (again) said: She did not perform Hajj, should I perform it on her behalf? He (the Holy Prophet) said: Perform Hajj on her behalf.",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20345",
        "10785",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sahih-muslim-2754",
      "hadith_no": "2754",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثناه أبو بكر بن أبي شيبة، حدثنا عبد الله بن نمير، عن عبد الله بن عطاء، عن عبد الله بن بريدة، عن أبيه، - رضى الله عنه - قال كنت جالسا عند النبي صلى الله عليه وسلم ‏.‏ بمثل حديث ابن مسهر غير أنه قال صوم شهرين ‏.‏",
      "text_en": " 'Abdullah b. Buraida (Allah be pleased with him) reported on the authority of his father:                      I was sitting with the Apostle of Allah (may peace be upon him) ; the rest of the hadith is the same but with this variation that the (the narrator) said:\" Fasts of two months.\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20331",
        "10785",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sahih-muslim-2755",
      "hadith_no": "2755",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا عبد بن حميد، أخبرنا عبد الرزاق، أخبرنا الثوري، عن عبد الله بن عطاء، عن ابن بريدة، عن أبيه، - رضى الله عنه - قال جاءت امرأة إلى النبي صلى الله عليه وسلم ‏.‏ فذكر بمثله وقال صوم شهر ‏.‏",
      "text_en": "  Ibn Buraida (Allah be pleased with him) reported on the authority of his father:                      A woman came to the Apostle of Allah (may peace be upon him), and the rest of the hadith is the same, but he said:\" Fasting of one month.\"",
      "usc_msa_ref": "",
      "chain": [
        "30553",
        "20121",
        "20012",
        "10785",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sahih-muslim-2757",
      "hadith_no": "2757",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثني ابن أبي خلف، حدثنا إسحاق بن يوسف، حدثنا عبد الملك بن أبي سليمان، عن عبد الله بن عطاء المكي، عن سليمان بن بريدة، عن أبيه، - رضى الله عنه - قال أتت امرأة إلى النبي صلى الله عليه وسلم ‏.‏ بمثل حديثهم وقال صوم شهر ‏.‏",
      "text_en": " Buraida (Allah be pleased with him) reported a similar hadith on the authority of his father that a woman came to the Apostle of Allah (may peace be upon him) and he said:                     \" Fasting for one month.\"",
      "usc_msa_ref": "",
      "chain": [
        "20411",
        "10945",
        "10785",
        "10916",
        "3131"
      ]
    },
    {
      "id": "sahih-muslim-4527",
      "hadith_no": "4527",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Punishments Prescribed by Islam - كتاب الحدود",
      "chapter_no": "30",
      "text_ar": "وحدثنا محمد بن العلاء الهمداني، حدثنا يحيى بن يعلى، - وهو ابن الحارث المحاربي - عن غيلان، - وهو ابن جامع المحاربي - عن علقمة بن مرثد، عن سليمان، بن بريدة عن أبيه، قال جاء ماعز بن مالك إلى النبي صلى الله عليه وسلم فقال يا رسول الله طهرني ‏.‏ فقال ‏\"‏ ويحك ارجع فاستغفر الله وتب إليه ‏\"‏ ‏.‏ قال فرجع غير بعيد ثم جاء فقال يا رسول الله طهرني ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ ويحك ارجع فاستغفر الله وتب إليه ‏\"‏ ‏.‏ قال فرجع غير بعيد ثم جاء فقال يا رسول الله طهرني ‏.‏ فقال النبي صلى الله عليه وسلم مثل ذلك حتى إذا كانت الرابعة قال له رسول الله صلى الله عليه وسلم ‏\"‏ فيم أطهرك ‏\"‏ ‏.‏ فقال من الزنى ‏.‏ فسأل رسول الله صلى الله عليه وسلم ‏\"‏ أبه جنون ‏\"‏ ‏.‏ فأخبر أنه ليس بمجنون ‏.‏ فقال ‏\"‏ أشرب خمرا ‏\"‏ ‏.‏ فقام رجل فاستنكهه فلم يجد منه ريح خمر ‏.‏ قال فقال رسول الله صلى الله عليه وسلم ‏\"‏ أزنيت ‏\"‏ ‏.‏ فقال نعم ‏.‏ فأمر به فرجم فكان الناس فيه فرقتين قائل يقول لقد هلك لقد أحاطت به خطيئته وقائل يقول ما توبة أفضل من توبة ماعز أنه جاء إلى النبي صلى الله عليه وسلم فوضع يده في يده ثم قال اقتلني بالحجارة - قال - فلبثوا بذلك يومين أو ثلاثة ثم جاء رسول الله صلى الله عليه وسلم وهم جلوس فسلم ثم جلس فقال ‏\"‏ استغفروا لماعز بن مالك ‏\"‏ ‏.‏ قال فقالوا غفر الله لماعز بن مالك ‏.‏ - قال - فقال رسول الله صلى الله عليه وسلم ‏\"‏ لقد تاب توبة لو قسمت بين أمة لوسعتهم ‏\"‏ ‏.‏ قال ثم جاءته امرأة من غامد من الأزد فقالت يا رسول الله طهرني ‏.‏ فقال ‏\"‏ ويحك ارجعي فاستغفري الله وتوبي إليه ‏\"‏ ‏.‏ فقالت أراك تريد أن ترددني كما رددت ماعز بن مالك ‏.‏ قال ‏\"‏ وما ذاك ‏\"‏ ‏.‏ قالت إنها حبلى من الزنا ‏.‏ فقال ‏\"‏ آنت ‏\"‏ ‏.‏ قالت نعم ‏.‏ فقال لها ‏\"‏ حتى تضعي ما في بطنك ‏\"‏ ‏.‏ قال فكفلها رجل من الأنصار حتى وضعت قال فأتى النبي صلى الله عليه وسلم فقال قد وضعت الغامدية ‏.‏ فقال ‏\"‏ إذا لا نرجمها وندع ولدها صغيرا ليس له من يرضعه ‏\"‏ ‏.‏ فقام رجل من الأنصار فقال إلى رضاعه يا نبي الله ‏.‏ قال فرجمها ‏.‏",
      "text_en": " Sulaiman b. Buraida reported on the authority of his father that Ma, iz b. Malik came to Allah's Apostle (may peace be upon him) and said to him:                      Messenger of Allah, purify me, whereupon he said: Woe be upon you, go back, ask forgiveness of Allah and turn to Him in repentance. He (the narrator) said that he went back not far, then came and said: Allah's Messenger, purify me. whereupon Allah's Messenger (may peace be upon him) said: Woe be upon you, go back and ask forgiveness of Allah and turn to Him in repentance. He (the narrator) said that he went back not far, when he came and said: Allah's Messenger, purify me. Allah's Apostle (may peace be upon him) said as he had said before. When it was the fourth time, Allah's Messenger (may, peace be upon him) said: From what am I to purify you? He said: From adultery, Allah's Messenger (may peace be upon him) asked if he had been mad. He was informed that he was not mad. He said: Has he drunk wine? A person stood up and smelt his breath but noticed no smell of wine. Thereupon Allah's Messenger (may peace be upon him) said: Have you committed adultery? He said: Yes. He made pronouncement about him and he was stoned to death. The people had been (divided) into two groups about him (Ma'iz). One of them said: He has been undone for his sins had encompassed him, whereas another said: There is no repentance more excellent than the repentance of Ma'iz, for he came to Allah's Apostle (may peace be upon him) and placing his hand in his (in the Holy Prophet's) hand said: Kill me with stones. (This controversy about Ma'iz) remained for two or three days. Then came Allah's Messenger (may peace be upon him) to them (his Companions) as they were sitting. He greeted them with salutation and then sat down and said: Ask forgiveness for Ma'iz b. Malik. They said: May Allah forgive Ma'iz b. Malik. Thereupon Allah's Messenger (may peace be upon him) said: He (Ma'iz) has made such a repentance that if that were to be divided among a people, it would have been enough for all of them. He (the narrator) said: Then a woman of Ghamid, a branch of Azd, came to him and said: Messenger of of Allah, purify me, whereupon he said: Woe be upon you; go back and beg forgiveness from Allah and turn to Him in repentance. She said: I find that you intend to send me back as you sent back Ma'iz. b. Malik. He (the Holy, Prophet) said: What has happened to you? She said that she had become pregnant as a result of fornication. He (the Holy Prophet) said: Is it you (who has done that)? She said: Yes. He (the Holy Prophet) said to her: (You will not be punished) until you deliver what is there in your womb. One of the Ansar became responsible for her until she was delivered (of the child). He (that Ansari) came to Allah's Apostle (may peace be upon him) and said the woman of Ghamid has given birth to a child. He (the Holy Prophet) said: In that case we shall not stone her and so leave her infant with none to suckle him. One of the Ansar got up and said: Allah's Apostle, let the responsibility of his suckling be upon me. She was then stoned to death.",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "10809",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "id": "sahih-muslim-4528",
      "hadith_no": "4528",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Punishments Prescribed by Islam - كتاب الحدود",
      "chapter_no": "30",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن نمير، ح وحدثنا محمد بن عبد، الله بن نمير - وتقاربا في لفظ الحديث - حدثنا أبي، حدثنا بشير بن المهاجر، حدثنا عبد الله بن بريدة، عن أبيه، أن ماعز بن مالك الأسلمي، أتى رسول الله صلى الله عليه وسلم فقال يا رسول الله إني قد ظلمت نفسي وزنيت وإني أريد أن تطهرني ‏.‏ فرده فلما كان من الغد أتاه فقال يا رسول الله إني قد زنيت ‏.‏ فرده الثانية فأرسل رسول الله صلى الله عليه وسلم إلى قومه فقال ‏\"‏ أتعلمون بعقله بأسا تنكرون منه شيئا ‏\"‏ ‏.‏ فقالوا ما نعلمه إلا وفي العقل من صالحينا فيما نرى فأتاه الثالثة فأرسل إليهم أيضا فسأل عنه فأخبروه أنه لا بأس به ولا بعقله فلما كان الرابعة حفر له حفرة ثم أمر به فرجم ‏.‏ قال فجاءت الغامدية فقالت يا رسول الله إني قد زنيت فطهرني ‏.‏ وإنه ردها فلما كان الغد قالت يا رسول الله لم تردني لعلك أن تردني كما رددت ماعزا فوالله إني لحبلى ‏.‏ قال ‏\"‏ إما لا فاذهبي حتى تلدي ‏\"‏ ‏.‏ فلما ولدت أتته بالصبي في خرقة قالت هذا قد ولدته ‏.‏ قال ‏\"‏ اذهبي فأرضعيه حتى تفطميه ‏\"‏ ‏.‏ فلما فطمته أتته بالصبي في يده كسرة خبز فقالت هذا يا نبي الله قد فطمته وقد أكل الطعام ‏.‏ فدفع الصبي إلى رجل من المسلمين ثم أمر بها فحفر لها إلى صدرها وأمر الناس فرجموها فيقبل خالد بن الوليد بحجر فرمى رأسها فتنضح الدم على وجه خالد فسبها فسمع نبي الله صلى الله عليه وسلم سبه إياها فقال ‏\"‏ مهلا يا خالد فوالذي نفسي بيده لقد تابت توبة لو تابها صاحب مكس لغفر له ‏\"‏ ‏.‏ ثم أمر بها فصلى عليها ودفنت ‏.‏",
      "text_en": " 'Abdullah b. Buraida reported on the authority of his father that Ma'iz b. Malik al-Aslami came to Allah's Messenger (may peace be upon him) and said:                      Allah's Messenger, I have wronged myself; I have committed adultery and I earnestly desire that you should purify me. He turned him away. On the following day, he (Ma'iz) again came to him and said: Allah's Messenger, I have committed adultery. Allah's Messenger (may peace be upon him) turned him away for the second time, and sent him to his people saying: Do you know if there is anything wrong with his mind. They denied of any such thing in him and said: We do not know him but as a wise good man among us, so far as we can judge. He (Ma'iz) came for the third time, and he (the Holy Prophet) sent him as he had done before. He asked about him and they informed him that there was nothing wrong with him or with his mind. When it was the fourth time, a ditch was dug for him and he (the Holy Prophet) pronounced judg- ment about him and he wis stoned. He (the narrator) said: There came to him (the Holy Prophet) a woman from Ghamid and said: Allah's Messenger, I have committed adultery, so purify me. He (the Holy Prophet) turned her away. On the following day she said: Allah's Messenger, Why do you turn me away? Perhaps, you turn me away as you turned away Ma'iz. By Allah, I have become pregnant. He said: Well, if you insist upon it, then go away until you give birth to (the child). When she was delivered she came with the child (wrapped) in a rag and said: Here is the child whom I have given birth to. He said: Go away and suckle him until you wean him. When she had weaned him, she came to him (the Holy Prophet) with the child who was holding a piece of bread in his hand. She said: Allah's Apostle, here is he as I have weaned him and he eats food. He (the Holy Prophet) entrusted the child to one of the Muslims and then pronounced punishment. And she was put in a ditch up to her chest and he commanded people and they stoned her. Khalid b Walid came forward with a stone which he flung at her head and there spurted blood on the face of Khalid and so he abused her. Allah's Apostle (may peace be upon him) heard his (Khalid's) curse that he had huried upon her. Thereupon he (the Holy Prophet) said: Khalid, be gentle. By Him in Whose Hand is my life, she has made such a repentance that even if a wrongful tax-collector were to repent, he would have been forgiven. Then giving command regarding her, he prayed over her and she was buried.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20331",
        "10747",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sahih-muslim-4618",
      "hadith_no": "4618",
      "source": "Sahih Muslim",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع بن الجراح، عن سفيان، ح وحدثنا إسحاق بن إبراهيم، أخبرنا يحيى بن آدم، حدثنا سفيان، قال أملاه علينا إملاء ح. وحدثني عبد الله بن هاشم، - واللفظ له - حدثني عبد الرحمن، - يعني ابن مهدي - حدثنا سفيان، عن علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، قال كان رسول الله صلى الله عليه وسلم إذا أمر أميرا على جيش أو سرية أوصاه في خاصته بتقوى الله ومن معه من المسلمين خيرا ثم قال ‏\"‏ اغزوا باسم الله في سبيل الله قاتلوا من كفر بالله اغزوا و لا تغلوا ولا تغدروا ولا تمثلوا ولا تقتلوا وليدا وإذا لقيت عدوك من المشركين فادعهم إلى ثلاث خصال - أو خلال - فأيتهن ما أجابوك فاقبل منهم وكف عنهم ثم ادعهم إلى الإسلام فإن أجابوك فاقبل منهم وكف عنهم ثم ادعهم إلى التحول من دارهم إلى دار المهاجرين وأخبرهم أنهم إن فعلوا ذلك فلهم ما للمهاجرين وعليهم ما على المهاجرين فإن أبوا أن يتحولوا منها فأخبرهم أنهم يكونون كأعراب المسلمين يجري عليهم حكم الله الذي يجري على المؤمنين ولا يكون لهم في الغنيمة والفىء شىء إلا أن يجاهدوا مع المسلمين فإن هم أبوا فسلهم الجزية فإن هم أجابوك فاقبل منهم وكف عنهم فإن هم أبوا فاستعن بالله وقاتلهم ‏.‏ وإذا حاصرت أهل حصن فأرادوك أن تجعل لهم ذمة الله وذمة نبيه فلا تجعل لهم ذمة الله ولا ذمة نبيه ولكن اجعل لهم ذمتك وذمة أصحابك فإنكم أن تخفروا ذممكم وذمم أصحابكم أهون من أن تخفروا ذمة الله وذمة رسوله ‏.‏ وإذا حاصرت أهل حصن فأرادوك أن تنزلهم على حكم الله فلا تنزلهم على حكم الله ولكن أنزلهم على حكمك فإنك لا تدري أتصيب حكم الله فيهم أم لا ‏\"‏ ‏.‏ قال عبد الرحمن هذا أو نحوه وزاد إسحاق في آخر حديثه عن يحيى بن آدم قال فذكرت هذا الحديث لمقاتل بن حيان - قال يحيى يعني أن علقمة يقوله لابن حيان - فقال حدثني مسلم بن هيصم عن النعمان بن مقرن عن النبي صلى الله عليه وسلم نحوه ‏.‏",
      "text_en": " It has been reported from Sulaiman b. Buraid through his father that when the Messenger of Allah (may peace be upon him) appointed anyone as leader of an army or detachment he would especially exhort him to fear Allah and to be good to the Muslims who were with him. He would say:                      Fight in the name of Allah and in the way of Allah. Fight against those who disbelieve in Allah. Make a holy war, do not embezzle the spoils; do not break your pledge; and do not mutilate (the dead) bodies; do not kill the children. When you meet your enemies who are polytheists, invite them to three courses of action. If they respond to any one of these, you also accept it and withold yourself from doing them any harm. Invite them to (accept) Islam; if they respond to you, accept it from them and desist from fighting against them. Then invite them to migrate from their lands to the land of Muhairs and inform them that, if they do so, they shall have all the privileges and obligations of the Muhajirs. If they refuse to migrate, tell them that they will have the status of Bedouin Muilims and will be subjected to the Commands of Allah like other Muslims, but they will not get any share from the spoils of war or Fai' except when they actually fight with the Muslims (against the disbelievers). If they refuse to accept Islam, demand from them the Jizya. If they agree to pay, accept it from them and hold off your hands. If they refuse to pay the tax, seek Allah's help and fight them. When you lay siege to a fort and the besieged appeal to you for protection in the name of Allah and His Prophet, do not accord to them the guarantee of Allah and His Prophet, but accord to them your own guarantee and the guarantee of your companions for it is a lesser sin that the security given by you or your companions be disregarded than that the security granted in the name of Allah and His Prophet be violated When you besiege a fort and the besieged want you to let them out in accordance with Allah's Command, do not let them come out in accordance with His Command, but do so at your (own) command, for you do not know whether or not you will be able to carry out Allah's behest with regard to them.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20032",
        "20012",
        "30123",
        "20364",
        "20012",
        "20033",
        "20005",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "id": "sahih-muslim-4620",
      "hadith_no": "4620",
      "source": "Sahih Muslim",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "وحدثني حجاج بن الشاعر، حدثني عبد الصمد بن عبد الوارث، حدثنا شعبة، حدثني علقمة بن مرثد، أن سليمان بن بريدة، حدثه عن أبيه، قال كان رسول الله صلى الله عليه وسلم إذا بعث أميرا أو سرية دعاه فأوصاه ‏.‏ وساق الحديث بمعنى حديث سفيان ‏.‏",
      "text_en": " Sulaiman b. Buraida repotted on the authority of his father that when Allah's Messenger (may peace be upon him) sent an Amir with a detachment he called him and advised him. The rest of the hadith is the same.",
      "usc_msa_ref": "",
      "chain": [
        "38834",
        "20250",
        "20020",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "id": "sahih-muslim-4799",
      "hadith_no": "4799",
      "source": "Sahih Muslim",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "وحدثني أحمد بن حنبل، حدثنا معتمر بن سليمان، عن كهمس، عن ابن بريدة، عن أبيه، أنه قال غزا مع رسول الله صلى الله عليه وسلم ست عشرة غزوة ‏.‏",
      "text_en": " It has been narrated by Buraida who heard it from his father that he joined the Messenger of Allah (may peace be upon him) in sixteen military campaigns",
      "usc_msa_ref": "",
      "chain": [
        "30007",
        "20288",
        "11303",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sahih-muslim-5017",
      "hadith_no": "5017",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن سفيان، عن علقمة بن مرثد، عن  سليمان بن بريدة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ حرمة نساء المجاهدين على القاعدين كحرمة أمهاتهم وما من رجل من القاعدين يخلف رجلا من المجاهدين فى أهله فيخونه فيهم إلا وقف له يوم القيامة فيأخذ من عمله ما شاء فما ظنكم ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Sulaimin b. Buraida who learnt the tradition from his father. The latter said that the Messenger of Allah (may peace be upon him) said:                      The sanctity of the wives of Mujahids is like the sanctity of their mothers for those who sit at home (i. e do not go out for Jihad). Anyone who stays behind looking after the family of a Mujahid and betrays his trust will be made to stand on the Day of judgment before the Mujahid who will take away from his meritorious deeds whatever he likes. So what do you think (will he leave anything)?",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20032",
        "20012",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "id": "sahih-muslim-5018",
      "hadith_no": "5018",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثني محمد بن رافع، حدثنا يحيى بن آدم، حدثنا مسعر، عن علقمة بن مرثد، عن ابن بريدة، عن أبيه، قال قال - يعني النبي صلى الله عليه وسلم ‏.‏ بمعنى حديث الثوري ‏.‏",
      "text_en": " This tradition has been narrated by the same authority through different chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30375",
        "20364",
        "20359",
        "11374",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sahih-muslim-5228",
      "hadith_no": "5228",
      "source": "Sahih Muslim",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "وحدثنا محمد بن عبد الله بن نمير، حدثنا محمد بن فضيل، حدثنا ضرار بن مرة، أبو سنان عن محارب بن دثار، عن عبد الله بن بريدة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ نهيتكم عن زيارة القبور فزوروها ونهيتكم عن لحوم الأضاحي فوق ثلاث فأمسكوا ما بدا لكم ونهيتكم عن النبيذ إلا في سقاء فاشربوا في الأسقية كلها ولا تشربوا مسكرا ‏\"‏ ‏.‏",
      "text_en": " Abdullah b. Buraida reported on the authority of his father that Allah's Messenger (may peace be upon him) said this:                      I prohibited you from visiting the graves, but (now) you may visit them, and I prohibited you (from eating) the flesh of sacrific- ed animals beyond three days, but now keep it as long as you like. I prohibited you from the use of Nabidh except (that preoared) in dry waterskins. Now drink (Nabidh prepared in any utensil), but do not drink when it becomes intoxicant.",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20356",
        "11389",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sahih-muslim-5229",
      "hadith_no": "5229",
      "source": "Sahih Muslim",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "وحدثني حجاج بن الشاعر، حدثنا الضحاك بن مخلد، عن سفيان، عن علقمة، بن مرثد عن ابن بريدة، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ كنت نهيتكم ‏\"‏ ‏.‏ فذكر بمعنى حديث أبي سنان ‏.‏",
      "text_en": " Ibn Buraida, on the authority of his father, reported Allah's Messenger (may peace be upon him) having said this:                      I used to forbid you. The rest of the hadith is the same.",
      "usc_msa_ref": "",
      "chain": [
        "38834",
        "20012",
        "11374",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sahih-muslim-5325",
      "hadith_no": "5325",
      "source": "Sahih Muslim",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثنا محمد بن عبد الله بن نمير، حدثنا محمد بن فضيل، حدثنا ضرار بن مرة، أبو سنان عن محارب بن دثار، عن عبد الله بن بريدة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ نهيتكم عن النبيذ إلا في سقاء فاشربوا في الأسقية كلها ولا تشربوا مسكرا ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. Buraida, on the authority of his father, reported Allah's Messenger (may peace be upon him) as saying:                      I had forbidden you from the preparation of Nabidh except in a waterskin. But now you may drink in all vessels, but do not drink what is intoxicant.",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20356",
        "11389",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sahih-muslim-5326",
      "hadith_no": "5326",
      "source": "Sahih Muslim",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثنا حجاج بن الشاعر، حدثنا ضحاك بن مخلد، عن سفيان، عن علقمة بن، مرثد عن ابن بريدة، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ نهيتكم عن الظروف وإن الظروف - أو ظرفا - لا يحل شيئا ولا يحرمه وكل مسكر حرام ‏\"‏ ‏.‏",
      "text_en": " Ibn Buraida, on the authority of his father, reported Allah's Messenger (may peace be upon him) as saying:                      I had forbidden you (from the preparation of Nabidh) and drinking it in certain vessels, (but now you may do so if you like) for it is not vessels or a vessel that makes a thing lawful or unlawful. It is every intoxicant that is unlawful.",
      "usc_msa_ref": "",
      "chain": [
        "38834",
        "20012",
        "11374",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sahih-muslim-5327",
      "hadith_no": "5327",
      "source": "Sahih Muslim",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن معرف بن واصل، عن محارب، بن دثار عن ابن بريدة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ كنت نهيتكم عن الأشربة في ظروف الأدم فاشربوا في كل وعاء غير أن لا تشربوا مسكرا ‏\"‏ ‏.‏",
      "text_en": " Ibn Buraida, on the authority of his father, reported Allah's Messenger (may Peace be upon him) as saying:                      I had forbidden you from the drinking (and preparation of) Nabidh in the vessels made out of leather, but (now) you may drink in all vessels, but you do not drink an intoxicant.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20032",
        "10828",
        "11389",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sahih-muslim-6033",
      "hadith_no": "6033",
      "source": "Sahih Muslim",
      "chapter": "The Book of Poetry - كتاب الشعر",
      "chapter_no": "42",
      "text_ar": "حدثني زهير بن حرب، حدثنا عبد الرحمن بن مهدي، عن سفيان، عن علقمة بن، مرثد عن سليمان بن بريدة، عن أبيه، أن النبي صلى الله عليه وسلم قال ‏\"‏ من لعب بالنردشير فكأنما صبغ يده في لحم خنزير ودمه ‏\"‏ ‏.‏",
      "text_en": " Buraida reported on the authority of his father that Allah's Apostle (may peace be upon him) said:                      He who played chess is like one who dyed his hand with the flesh and blood of swine.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "20033",
        "20012",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "id": "sunan-abi-daud-155",
      "hadith_no": "155",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا مسدد، وأحمد بن أبي شعيب الحراني، قالا حدثنا وكيع، حدثنا دلهم بن صالح، عن حجير بن عبد الله، عن ابن بريدة، عن أبيه، أن النجاشي، أهدى إلى رسول الله صلى الله عليه وسلم خفين أسودين ساذجين فلبسهما ثم توضأ ومسح عليهما ‏.‏ قال مسدد عن دلهم بن صالح ‏.‏ قال أبو داود هذا مما تفرد به أهل البصرة ‏.‏",
      "text_en": " Narrated AbuMusa al-Ash'ari:                     Negus presented to the Messenger of Allah (ﷺ) two black and simple socks. He put them on; then he performed ablution and wiped over them.Musaddad reported this tradition from Dulham b. Salih.Abu Dawud said: This tradition has been narrated by the people of Basrah alone.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "30301",
        "20032",
        "15130",
        "28094",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-abi-daud-172",
      "hadith_no": "172",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا مسدد، أخبرنا يحيى، عن سفيان، حدثني علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، قال صلى رسول الله صلى الله عليه وسلم يوم الفتح خمس صلوات بوضوء واحد ومسح على خفيه فقال له عمر إني رأيتك صنعت اليوم شيئا لم تكن تصنعه ‏.‏ قال ‏\"‏ عمدا صنعته ‏\"‏ ‏.‏",
      "text_en": " Buraidah on the authority of his father reported:                      The Messenger of Allah (ﷺ) performed five prayers with the same ablution of the occasion of the capture of Mecca, and he wiped over his socks.  ‘Umar said to him(the Prophet): I saw you doing a thing today that you never did. He said: I did it deliberately.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20031",
        "20012",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "id": "sunan-abi-daud-636",
      "hadith_no": "636",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن يحيى بن فارس الذهلي، حدثنا سعيد بن محمد، حدثنا أبو تميلة، يحيى بن واضح حدثنا أبو المنيب، عبيد الله العتكي عن عبد الله بن بريدة، عن أبيه، قال نهى رسول الله صلى الله عليه وسلم أن يصلى في لحاف لا يتوشح به والآخر أن يصلى في سراويل وليس عليك رداء ‏.‏",
      "text_en": " Narrated Buraydah ibn al-Hasib:                     The Messenger of Allah (ﷺ) prohibited us to pray in a sheet of cloth without crossing both its ends, and he also prohibited us to pray in a wrapper without putting on a sheet.",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "30195",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-abi-daud-1109",
      "hadith_no": "1109",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن العلاء، أن زيد بن حباب، حدثهم حدثنا حسين بن واقد، حدثني عبد الله بن بريدة، عن أبيه، قال خطبنا رسول الله صلى الله عليه وسلم فأقبل الحسن والحسين - رضى الله عنهما - عليهما قميصان أحمران يعثران ويقومان فنزل فأخذهما فصعد بهما المنبر ثم قال ‏\"‏ صدق الله ‏{‏ إنما أموالكم وأولادكم فتنة ‏}‏ رأيت هذين فلم أصبر ‏\"‏ ‏.‏ ثم أخذ في الخطبة ‏.‏",
      "text_en": " Narrated Buraydah ibn al-Hasib:                     The Messenger of Allah (ﷺ) delivered a speech to us; meanwhile al-Hasan and al-Husayn came upon there stumbling, wearing red shirts. He came down from the pulpit, took them and ascended it with them. He then said: Allah truly said: \"Your property and your children are only trial\" (Ixiv.15). I saw both of them, and I could not wait. Afterwards he resumed the speech.",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20650",
        "20648",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-abi-daud-1419",
      "hadith_no": "1419",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا ابن المثنى، حدثنا أبو إسحاق الطالقاني، حدثنا الفضل بن موسى، عن عبيد الله بن عبد الله العتكي، عن عبد الله بن بريدة، عن أبيه، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ الوتر حق فمن لم يوتر فليس منا الوتر حق فمن لم يوتر فليس منا الوتر حق فمن لم يوتر فليس منا ‏\"‏‏.‏",
      "text_en": " Narrated Buraydah ibn al-Hasib:                     I heard the Messenger of Allah (ﷺ) say: The witr is a duty, so he who does not observe it does not belong to us; the witr is a duty, so he who does not observe it does not belong to us; the witr is a duty, so he who does not observe it does not belong to us.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20642",
        "20452",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-abi-daud-1493",
      "hadith_no": "1493",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن مالك بن مغول، حدثنا عبد الله بن بريدة، عن أبيه، أن رسول الله صلى الله عليه وسلم سمع رجلا يقول اللهم إني أسألك أني أشهد أنك أنت الله لا إله إلا أنت الأحد الصمد الذي لم يلد ولم يولد ولم يكن له كفوا أحد ‏.‏ فقال ‏\"‏ لقد سألت الله بالاسم الذي إذا سئل به أعطى وإذا دعي به أجاب ‏\"‏ ‏.‏",
      "text_en": " Narrated Buraydah ibn al-Hasib:                     The Messenger of Allah (ﷺ) heard a man saying: O Allah, I ask Thee, I bear witness that there is no god but Thou, the One, He to Whom men repair, Who has not begotten, and has not been begotten, and to Whom no one is equal, and he said: You have supplicated Allah using His Greatest Name, when asked with this name He gives, and when supplicated by this name he answers.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20031",
        "20358",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-abi-daud-2149",
      "hadith_no": "2149",
      "source": "Sunan Abi Da'ud",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا إسماعيل بن موسى الفزاري، أخبرنا شريك، عن أبي ربيعة الإيادي، عن ابن بريدة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم لعلي ‏\"‏ يا علي لا تتبع النظرة النظرة فإن لك الأولى وليست لك الآخرة ‏\"‏ ‏.‏",
      "text_en": " Narrated Buraydah ibn al-Hasib:                     The Prophet (ﷺ) said: to Ali: Do not give a second look, Ali, (because) while you are not to blame for the first, you have no right to the second.",
      "usc_msa_ref": "",
      "chain": [
        "35016",
        "20587",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-abi-daud-2496",
      "hadith_no": "2496",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا سفيان، عن قعنب، عن علقمة بن مرثد، عن ابن بريدة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ حرمة نساء المجاهدين على القاعدين كحرمة أمهاتهم وما من رجل من القاعدين يخلف رجلا من المجاهدين في أهله إلا نصب له يوم القيامة فقيل له هذا قد خلفك في أهلك فخذ من حسناته ما شئت ‏\"‏ ‏.‏ فالتفت إلينا رسول الله صلى الله عليه وسلم فقال ‏\"‏ ما ظنكم ‏\"‏ ‏.‏ قال أبو داود كان قعنب رجلا صالحا وكان ابن أبي ليلى أراد قعنبا على القضاء فأبى عليه وقال أنا أريد الحاجة بدرهم فأستعين عليها برجل ‏.‏ قال وأينا لا يستعين في حاجته قال أخرجوني حتى أنظر فأخرج فتوارى ‏.‏ قال سفيان بينما هو متوار إذ وقع عليه البيت فمات ‏.‏",
      "text_en": " Buraidah reported the Apostle of Allaah(ﷺ) as saying “Respect to be shown by those who stay at home to the women of those who are engaged in jihad is t be like that shown to their mothers. If any man among those who stay at home is entrusted with the oversight of one’s family who is engaged in jihad and betrays him, he will be setup for him on the Day of Resurrection and he (the mujahid) will be told “This (man) was entrusted with the oversight of your family, so take what you want from his good deeds. The Apostle of Allaah(ﷺ) turned towards us and said “So what do you think.”Abu Dawud said “Qa’nab (a narrator of this tradition) was a pious man. Ibn Abi Laila intended to appoint him a judge, but he refused and said “If I intend to fulfill my need of a dirham, I seek the help of a person for it. He said “Which of us does not seek the help in his need? He said “Bring me out so that I may see. So he was brought out, and he concealed himself. Sufyan said “While he was concealing himself.” Sufyan said “While he was concealing himself the house suddenly fell on him and he died.”",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20005",
        "10813",
        "11374",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-abi-daud-2612",
      "hadith_no": "2612",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن سليمان الأنباري، حدثنا وكيع، عن سفيان، عن علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، قال كان رسول الله صلى الله عليه وسلم إذا بعث أميرا على سرية أو جيش أوصاه بتقوى الله في خاصة نفسه وبمن معه من المسلمين خيرا وقال ‏\"‏ إذا لقيت عدوك من المشركين فادعهم إلى إحدى ثلاث خصال أو خلال فأيتها أجابوك إليها فاقبل منهم وكف عنهم ادعهم إلى الإسلام فإن أجابوك فاقبل منهم وكف عنهم ثم ادعهم إلى التحول من دارهم إلى دار المهاجرين وأعلمهم أنهم إن فعلوا ذلك أن لهم ما للمهاجرين وأن عليهم ما على المهاجرين فإن أبوا واختاروا دارهم فأعلمهم أنهم يكونون كأعراب المسلمين يجرى عليهم حكم الله الذي يجري على المؤمنين ولا يكون لهم في الفىء والغنيمة نصيب إلا أن يجاهدوا مع المسلمين فإن هم أبوا فادعهم إلى إعطاء الجزية فإن أجابوا فاقبل منهم وكف عنهم فإن أبوا فاستعن بالله تعالى وقاتلهم وإذا حاصرت أهل حصن فأرادوك أن تنزلهم على حكم الله تعالى فلا تنزلهم فإنكم لا تدرون ما يحكم الله فيهم ولكن أنزلوهم على حكمكم ثم اقضوا فيهم بعد ما شئتم ‏\"‏ ‏.‏ قال سفيان بن عيينة قال علقمة فذكرت هذا الحديث لمقاتل بن حيان فقال حدثني مسلم - قال أبو داود هو ابن هيصم - عن النعمان بن مقرن عن النبي صلى الله عليه وسلم مثل حديث سليمان بن بريدة ‏.‏",
      "text_en": " Sulaiman bin Buraidah reported on the authority of his father. When the Apostle of Allaah(ﷺ) appointed a Commander over an Army or a detachment, he instructed him to fear Allaah himself and consider the welfare of the Muslims who were with him. He then said “When you meet the polytheists who are your enemy, summon them tone of three things and accept whichever of them they are willing to agree to, and refrain from them. Summon them to Islam and if they agree, accept it from them and refrain from them. Then summon them to leave their territory and transfer to the abode of the Emigrants and tell them that if they do so, they will have the same rights and responsibilities as the Emigrants, but if they refuse and choose their own abode, tell them that they will be like the desert Arabs who are Muslims subject to Allaah’s jurisdiction which applies to the believers, but will have no spoil or booty unless they strive with the Muslims. If they refuse demand jizyah (poll tax) from them, if they agree accept it from them and refrain from them. But if they refuse, seek Alaah’s help and fight with them. When you invade the fortress and they (its people) offer to capitulate and have the matter referred to Allaah’s jurisdiction, do not grant this, for you do not know whether or not you will hit on Allaah’s jurisdiction regarding them. But let them capitulate and have the matter refereed to your jurisdiction and make a decision about them later on as you wish.Sufyan (bin ‘Uyainah) said thah ‘Alqamah said “I mentioned this tradition to Muqatil bin Habban, He said “Muslim narrated it to me.” Abu Dawud said “He is Ibn Haidam narrated from Al Nu’man in Muqqarin from the Prophet (ﷺ) like the tradition of Sulaiman bin Buraidah.",
      "usc_msa_ref": "",
      "chain": [
        "31160",
        "20032",
        "20012",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "id": "sunan-abi-daud-2613",
      "hadith_no": "2613",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا أبو صالح الأنطاكي، محبوب بن موسى أخبرنا أبو إسحاق الفزاري، عن سفيان، عن علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، أن النبي صلى الله عليه وسلم قال ‏\"‏ اغزوا باسم الله وفي سبيل الله وقاتلوا من كفر بالله اغزوا ولا تغدروا ولا تغلوا ولا تمثلوا ولا تقتلوا وليدا ‏\"‏ ‏.‏",
      "text_en": " Sulaiman bin Buraidah reported on his father’s authority The Prophet(ﷺ) said “Fight in the name of Allaah and in the path of Allaah and with him who disbelieves in Allaah fight and do not be treacherous and do not be dishonest about boot yand do not deface (in killing) and do not kill a child.”",
      "usc_msa_ref": "",
      "chain": [
        "20405",
        "20012",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "id": "sunan-abi-daud-2895",
      "hadith_no": "2895",
      "source": "Sunan Abi Da'ud",
      "chapter": "Shares of Inheritance (Kitab Al-Fara'id) - كتاب الفرائض",
      "chapter_no": "19",
      "text_ar": "حدثنا محمد بن عبد العزيز بن أبي رزمة، أخبرني أبي، حدثنا عبيد الله أبو المنيب العتكي، عن ابن بريدة، عن أبيه، أن النبي صلى الله عليه وسلم جعل للجدة السدس إذا لم تكن دونها أم ‏.‏",
      "text_en": " Narrated Buraydah:                     The Prophet (ﷺ) appointed a sixth to a grandmother if no mother is left to inherit before her.",
      "usc_msa_ref": "",
      "chain": [
        "30379",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-abi-daud-2903",
      "hadith_no": "2903",
      "source": "Sunan Abi Da'ud",
      "chapter": "Shares of Inheritance (Kitab Al-Fara'id) - كتاب الفرائض",
      "chapter_no": "19",
      "text_ar": "حدثنا عبد الله بن سعيد الكندي، حدثنا المحاربي، عن جبريل بن أحمر، عن عبد الله بن بريدة، عن أبيه، قال أتى النبي صلى الله عليه وسلم رجل فقال إن عندي ميراث رجل من الأزد ولست أجد أزديا أدفعه إليه ‏.‏ قال ‏\"‏ اذهب فالتمس أزديا حولا ‏\"‏ ‏.‏ قال فأتاه بعد الحول فقال يا رسول الله لم أجد أزديا أدفعه إليه ‏.‏ قال ‏\"‏ فانطلق فانظر أول خزاعي تلقاه فادفعه إليه ‏\"‏ ‏.‏ فلما ولى قال ‏\"‏ على الرجل ‏\"‏ ‏.‏ فلما جاء قال ‏\"‏ انظر كبر خزاعة فادفعه إليه ‏\"‏ ‏.‏",
      "text_en": " Narrated Buraydah ibn al-Hasib:                     A man came to the Messenger of Allah (ﷺ) and said: I have property left by a man of Azd. I do not find any man of Azd to give it to him. He said: Go and look for man of Azd for a year. He then came to him after one year and said: Messenger of Allah, I did not find any man of Azd to give it to him. He said: Look for a man of Khuza'ah whom you meet first and give it to him. When he turned away, he said; Call the man to me. When he came to him, he said: Look for the leading man of Khuza'ah and give it to him.",
      "usc_msa_ref": "",
      "chain": [
        "30200",
        "20333",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-abi-daud-2904",
      "hadith_no": "2904",
      "source": "Sunan Abi Da'ud",
      "chapter": "Shares of Inheritance (Kitab Al-Fara'id) - كتاب الفرائض",
      "chapter_no": "19",
      "text_ar": "حدثنا الحسين بن أسود العجلي، حدثنا يحيى بن آدم، حدثنا شريك، عن جبريل بن أحمر أبي بكر، عن ابن بريدة، عن أبيه، قال مات رجل من خزاعة فأتي النبي صلى الله عليه وسلم بميراثه فقال ‏\"‏ التمسوا له وارثا أو ذا رحم ‏\"‏ ‏.‏ فلم يجدوا له وارثا ولا ذا رحم فقال رسول الله صلى الله عليه وسلم ‏\"‏ أعطوه الكبر من خزاعة ‏\"‏ ‏.‏ قال يحيى قد سمعته مرة يقول في هذا الحديث ‏\"‏ انظروا أكبر رجل من خزاعة ‏\"‏ ‏.‏",
      "text_en": " Narrated Buraydah ibn al-Hasib:                     A man of Khuza'ah died and his estate was brought to the Prophet (ﷺ). He said: Look for his heir or some relative. But they found neither heir nor relative. The Messenger of Allah (ﷺ) said: Give it to the leading man of Khuza'ah. The narrator Yahya said: Sometimes I heard him (al-Husayn ibn Aswad) say in this tradition: Look for the greatest man of Khuza'ah.",
      "usc_msa_ref": "",
      "chain": [
        "20364",
        "20587",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-abi-daud-2943",
      "hadith_no": "2943",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا زيد بن أخزم أبو طالب، حدثنا أبو عاصم، عن عبد الوارث بن سعيد، عن حسين المعلم، عن عبد الله بن بريدة، عن أبيه، عن النبي صلى الله عليه وسلم قال ‏\"‏ من استعملناه على عمل فرزقناه رزقا فما أخذ بعد ذلك فهو غلول ‏\"‏ ‏.‏",
      "text_en": " Narrated Buraidah:                     The Prophet (ﷺ) as saying: When we appoint someone to an administrative post and provide him with an allowance, anything he takes beyond that is unfaithful dealing.",
      "usc_msa_ref": "",
      "chain": [
        "30136",
        "20241",
        "20258",
        "11278",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-abi-daud-3235",
      "hadith_no": "3235",
      "source": "Sunan Abi Da'ud",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا معرف بن واصل، عن محارب بن دثار، عن ابن بريدة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ نهيتكم عن زيارة القبور فزوروها فإن في زيارتها تذكرة ‏\"‏ ‏.‏",
      "text_en": " Narrated Buraidah:                     The Messenger of Allah (ﷺ) as saying: I forbade you to visit graves, but you may now visit them, for in visiting them there is a reminder (of death).",
      "usc_msa_ref": "",
      "chain": [
        "30184",
        "11389",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-abi-daud-3253",
      "hadith_no": "3253",
      "source": "Sunan Abi Da'ud",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زهير، حدثنا الوليد بن ثعلبة الطائي، عن ابن بريدة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من حلف بالأمانة فليس منا ‏\"‏ ‏.‏",
      "text_en": " Narrated Buraydah ibn al-Hasib:                     The Prophet (ﷺ) said: He who swears by Amanah (faithfulness) is not one of our number.",
      "usc_msa_ref": "",
      "chain": [
        "30184",
        "20321",
        "14411",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-abi-daud-3258",
      "hadith_no": "3258",
      "source": "Sunan Abi Da'ud",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثني أحمد بن حنبل، حدثنا زيد بن الحباب، حدثنا حسين، - يعني ابن واقد - حدثني عبد الله بن بريدة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏ من حلف فقال إني بريء من الإسلام فإن كان كاذبا فهو كما قال، وإن كان صادقا فلن يرجع إلى الإسلام سالما ‏\"‏ ‏.‏",
      "text_en": " Narrated Buraydah ibn al-Hasib:                     The Prophet (ﷺ) said: If anyone takes an oath and says: I am free from Islam; now if he is a liar (in his oath), he will not return to Islam with soundness.",
      "usc_msa_ref": "",
      "chain": [
        "30007",
        "20650",
        "20648",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-abi-daud-3573",
      "hadith_no": "3573",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن حسان السمتي، حدثنا خلف بن خليفة، عن أبي هاشم، عن ابن بريدة، عن أبيه، عن النبي صلى الله عليه وسلم قال ‏\"‏ القضاة ثلاثة واحد في الجنة واثنان في النار فأما الذي في الجنة فرجل عرف الحق فقضى به ورجل عرف الحق فجار في الحكم فهو في النار ورجل قضى للناس على جهل فهو في النار ‏\"‏ ‏.‏ قال أبو داود وهذا أصح شىء فيه يعني حديث ابن بريدة ‏\"‏ القضاة ثلاثة ‏\"‏ ‏.‏",
      "text_en": " Narrated Buraydah ibn al-Hasib:                     The Prophet (ﷺ) said: Judges are of three types, one of whom will go to Paradise and two to Hell. The one who will go to Paradise is a man who knows what is right and gives judgment accordingly; but a man who knows what is right and acts tyrannically in his judgment will go to Hell; and a man who gives judgment for people when he is ignorant will go to Hell.Abu Dawud said: On this subject this is the soundest tradition, that is, the tradition of Ibn Buraidah: Judges are of three types.",
      "usc_msa_ref": "",
      "chain": [
        "36628",
        "20584",
        "11454",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-abi-daud-3698",
      "hadith_no": "3698",
      "source": "Sunan Abi Da'ud",
      "chapter": "Drinks (Kitab Al-Ashribah) - كتاب الأشربة",
      "chapter_no": "27",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا معرف بن واصل، عن محارب بن دثار، عن ابن بريدة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ نهيتكم عن ثلاث وأنا آمركم بهن نهيتكم عن زيارة القبور فزوروها فإن في زيارتها تذكرة ونهيتكم عن الأشربة أن تشربوا إلا في ظروف الأدم فاشربوا في كل وعاء غير أن لا تشربوا مسكرا ونهيتكم عن لحوم الأضاحي أن تأكلوها بعد ثلاث فكلوا واستمتعوا بها في أسفاركم ‏\"‏ ‏.‏",
      "text_en": " Narrated Buraydah ibn al-Hasib:                     The Prophet (ﷺ) said: I forbade you three things, and now I command (permit) you for them. I forbade you to visit graves, now you may visit them, for in visiting them there is admonition. I forbade you drinks except from skin vessels, but now you may drink from any kind of vessels, but do not drink an intoxicant. I forbade you to eat the meat of sacrificial animals after three days, but now you may eat and enjoy it during your journeys.",
      "usc_msa_ref": "",
      "chain": [
        "30184",
        "11389",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-abi-daud-3920",
      "hadith_no": "3920",
      "source": "Sunan Abi Da'ud",
      "chapter": "Divination and Omens (Kitab Al-Kahanah Wa Al-Tatayyur) - كتاب الكهانة و التطير",
      "chapter_no": "30",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا هشام، عن قتادة، عن عبد الله بن بريدة، عن أبيه، أن النبي صلى الله عليه وسلم كان لا يتطير من شىء وكان إذا بعث عاملا سأل عن اسمه فإذا أعجبه اسمه فرح به ورئي بشر ذلك في وجهه وإن كره اسمه رئي كراهية ذلك في وجهه وإذا دخل قرية سأل عن اسمها فإن أعجبه اسمها فرح بها ورئي بشر ذلك في وجهه وإن كره اسمها رئي كراهية ذلك في وجهه ‏.‏",
      "text_en": " Narrated Buraydah ibn al-Hasib:                     The Prophet (ﷺ) did not take omens from anything, but when he sent out an agent he asked about his name. If it pleased him, he was glad about it, and his cheerfulness on that account was visible in his face. If he disliked his name, his displeasure on that account was visible in his face. When he entered a village, he asked about its name, and if it pleased him, he was glad about it, and his cheerfulness on that account was visible in his face. But if he disliked its name, his displeasure on that account was visible in his face.",
      "usc_msa_ref": "",
      "chain": [
        "20285",
        "20295",
        "11019",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-abi-daud-4026",
      "hadith_no": "4026",
      "source": "Sunan Abi Da'ud",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا زياد بن أيوب، حدثنا أبو تميلة، قال حدثني عبد المؤمن بن خالد، عن عبد الله بن بريدة، عن أبيه، عن أم سلمة، قالت لم يكن ثوب أحب إلى رسول الله صلى الله عليه وسلم من قميص ‏.‏",
      "text_en": " Narrated Umm Salamah, Ummul Mu'minin:                     No clothing was dearer to be Messenger of Allah (ﷺ) than shirt.",
      "usc_msa_ref": "",
      "chain": [
        "30249",
        "20183",
        "28375",
        "11432",
        "3131",
        "56"
      ]
    },
    {
      "id": "sunan-abi-daud-4223",
      "hadith_no": "4223",
      "source": "Sunan Abi Da'ud",
      "chapter": "Signet-Rings (Kitab Al-Khatam) - كتاب الخاتم",
      "chapter_no": "36",
      "text_ar": "حدثنا الحسن بن علي، ومحمد بن عبد العزيز بن أبي رزمة، - المعنى - أن زيد بن حباب، أخبرهم عن عبد الله بن مسلم السلمي المروزي أبي طيبة، عن عبد الله بن بريدة، عن أبيه، أن رجلا، جاء إلى النبي صلى الله عليه وسلم وعليه خاتم من شبه فقال له ‏\"‏ ما لي أجد منك ريح الأصنام ‏\"‏ ‏.‏ فطرحه ثم جاء وعليه خاتم من حديد فقال ‏\"‏ ما لي أرى عليك حلية أهل النار ‏\"‏ ‏.‏ فطرحه فقال يا رسول الله من أى شىء أتخذه قال ‏\"‏ اتخذه من ورق ولا تتمه مثقالا ‏\"‏ ‏.‏ ولم يقل محمد عبد الله بن مسلم ‏.‏ ولم يقل الحسن السلمي المروزي ‏.‏",
      "text_en": " Narrated Buraydah ibn al-Hasib:                     A man came to the Prophet (ﷺ) and he was wearing a signet-ring of yellow copper. He said to him: How is it that I notice the odour of idols in you? So he threw it away, and came wearing an iron signet ring. He (the Prophet) said: What is it that I see you wearing the adornment of the inhabitants of Hell? So he threw it away. He asked: Messenger of Allah, what material I must use? He said: Make it of silver, but do not weigh it as much as a mithqal,The narrator Muhammad did not say: \" 'Abd Allah b. Muslim,\" and al-Hasan did not say: \"al-Sulami al-Marwazi.\"",
      "usc_msa_ref": "",
      "chain": [
        "30",
        "20650",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-abi-daud-4305",
      "hadith_no": "4305",
      "source": "Sunan Abi Da'ud",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا جعفر بن مسافر التنيسي، حدثنا خلاد بن يحيى، حدثنا بشير بن المهاجر، حدثنا عبد الله بن بريدة، عن أبيه، عن النبي صلى الله عليه وسلم في حديث ‏\"‏ يقاتلكم قوم صغار الأعين ‏\"‏ ‏.‏ يعني الترك قال ‏\"‏ تسوقونهم ثلاث مرار حتى تلحقوهم بجزيرة العرب فأما في السياقة الأولى فينجو من هرب منهم وأما في الثانية فينجو بعض ويهلك بعض وأما في الثالثة فيصطلمون ‏\"‏ ‏.‏ أو كما قال ‏.‏",
      "text_en": " Buraidah said:                      In the tradition telling that people with small eyes, i.e. the Turks, will fight against you, the prophet (ﷺ) said: You will drive them off three times till you catch up with them in Arabia. On the first occasion when you drive them off those who fly will be safe, on the second occasion some will be safe and some will perish, but on the third occasion they will be extirpated, or he said words to that effect.",
      "usc_msa_ref": "",
      "chain": [
        "38132",
        "20191",
        "10747",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-abi-daud-4433",
      "hadith_no": "4433",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا محمد بن أبي بكر بن أبي شيبة، حدثنا يحيى بن يعلى بن الحارث، حدثنا أبي، عن غيلان، عن علقمة بن مرثد، عن ابن بريدة، عن أبيه، أن النبي صلى الله عليه وسلم استنكه ماعزا ‏.‏",
      "text_en": " Buraidah said. :                      The Prophet (ﷺ) smelt the breath of Ma’iz.",
      "usc_msa_ref": "",
      "chain": [
        "11300",
        "11374",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-abi-daud-4434",
      "hadith_no": "4434",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا أحمد بن إسحاق الأهوازي، حدثنا أبو أحمد، حدثنا بشير بن المهاجر، حدثني عبد الله بن بريدة، عن أبيه، قال كنا أصحاب رسول الله نتحدث أن الغامدية وماعز بن مالك لو رجعا بعد اعترافهما أو قال لو لم يرجعا بعد اعترافهما لم يطلبهما وإنما رجمهما عند الرابعة ‏.‏",
      "text_en": " Narrated Buraydah ibn al-Hasib:                     We, the Companions of the Messenger of Allah (ﷺ), used to talk mutually: Would that al-Ghamidiyyah and Ma'iz ibn Malik had withdrawn after their confession; or he said: Had they not withdrawn after their confession, he would not have pursued them (for punishment). He had them stoned after the fourth (confession).",
      "usc_msa_ref": "",
      "chain": [
        "30289",
        "20355",
        "10747",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-abi-daud-4442",
      "hadith_no": "4442",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا إبراهيم بن موسى الرازي، أخبرنا عيسى بن يونس، عن بشير بن المهاجر، حدثنا عبد الله بن بريدة، عن أبيه، أن امرأة، - يعني من غامد - أتت النبي صلى الله عليه وسلم فقالت إني قد فجرت ‏.‏ فقال ‏\"‏ ارجعي ‏\"‏ ‏.‏ فرجعت فلما كان الغد أتته فقالت لعلك أن تردني كما رددت ماعز بن مالك فوالله إني لحبلى ‏.‏ فقال لها ‏\"‏ ارجعي ‏\"‏ ‏.‏ فرجعت فلما كان الغد أتته فقال لها ‏\"‏ ارجعي حتى تلدي ‏\"‏ ‏.‏ فرجعت فلما ولدت أتته بالصبي فقالت هذا قد ولدته ‏.‏ فقال لها ‏\"‏ ارجعي فأرضعيه حتى تفطميه ‏\"‏ ‏.‏ فجاءت به وقد فطمته وفي يده شىء يأكله فأمر بالصبي فدفع إلى رجل من المسلمين وأمر بها فحفر لها وأمر بها فرجمت وكان خالد فيمن يرجمها فرجمها بحجر فوقعت قطرة من دمها على وجنته فسبها فقال له النبي صلى الله عليه وسلم ‏\"‏ مهلا يا خالد فوالذي نفسي بيده لقد تابت توبة لو تابها صاحب مكس لغفر له ‏\"‏ ‏.‏ وأمر بها فصلي عليها فدفنت ‏.‏",
      "text_en": " ) Buraidah said:                      A woman of Ghamid came to the Prophet (ﷺ) and said: I have committed fornication. He said: Go back. She returned, and on the next day she came to him again, and said: Perhaps you want to send me back as you did to Ma’iz b. Malik. I swear by Allah, I am pregnant. He said to her: Go back. She then returned and came to him the next day. He said to her: Go back until you give birth to a child. She then returned. When she gave birth to a child, she brought the child to him, and said: Here it is! I have given birth to it. He said: Go back, and suckle him until you wean him. When she had weaned him, she brought him (the boy) to him with something in his hand which he was eating. The boy was then given to a certain man of the Muslims and he (the Prophet) commanded regarding her. So a pit was dug for her, and he gave orders about her and she was stoned to death. Khalid was one of those who were throwing stones at her. He threw a stone at her. When a drop blood fell on his cheeks, he abused her. The Prophet (ﷺ) said to him: Gently, Khalid. By Him in whose hand my soul is, she has reported to such an extent that if one who wrongfully takes extra tax were to repent to a like extent, he would be forgiven. Then giving command regarding her, prayed over her and she was buried.",
      "usc_msa_ref": "",
      "chain": [
        "30309",
        "20347",
        "10747",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-abi-daud-4578",
      "hadith_no": "4578",
      "source": "Sunan Abi Da'ud",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا عباس بن عبد العظيم، حدثنا عبيد الله بن موسى، حدثنا يوسف بن صهيب، عن عبد الله بن بريدة، عن أبيه، أن امرأة، حذفت امرأة فأسقطت فرفع ذلك إلى رسول الله صلى الله عليه وسلم فجعل في ولدها خمسمائة شاة ونهى يومئذ عن الحذف ‏.‏ قال أبو داود كذا الحديث خمسمائة شاة ‏.‏ والصواب مائة شاة ‏.‏ قال أبو داود هكذا قال عباس وهو وهم ‏.‏",
      "text_en": " Narrated Buraydah ibn al-Hasib:                     A woman threw a stone at another woman and she aborted. The dispute was brought to the Messenger of Allah (ﷺ). He gave judgment that five hundred sheep should be paid for her (unborn) child, and forbade throwing stones.Abu Dawud said: The version of this tradition goes in this way, i.e. five hundred sheep. What is correct is one hundred sheep. Abu Dawud said: 'Abbas transmitted this tradition this way, but it is misunderstanding.",
      "usc_msa_ref": "",
      "chain": [
        "30437",
        "20340",
        "15649",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-abi-daud-4939",
      "hadith_no": "4939",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن سفيان، عن علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، عن النبي صلى الله عليه وسلم قال ‏\"‏ من لعب بالنردشير فكأنما غمس يده في لحم خنزير ودمه ‏\"‏ ‏.‏",
      "text_en": " Buraidah reported the Prophet (May peace be upon him) as saying :                      If anyone plays backgammon, he sinks his hand in the flesh of swine and its blood.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20031",
        "20012",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "id": "sunan-abi-daud-4977",
      "hadith_no": "4977",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا عبيد الله بن عمر بن ميسرة، حدثنا معاذ بن هشام، قال حدثني أبي، عن قتادة، عن عبد الله بن بريدة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تقولوا للمنافق سيد فإنه إن يك سيدا فقد أسخطتم ربكم عز وجل ‏\"‏ ‏.‏",
      "text_en": " Narrated Buraydah ibn al-Hasib:                     The Prophet (ﷺ) said: Do not call a hypocrite sayyid (master), for if he is a sayyid, you will displease your Lord, Most High.",
      "usc_msa_ref": "",
      "chain": [
        "30024",
        "20287",
        "20295",
        "11019",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-abi-daud-5070",
      "hadith_no": "5070",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زهير، حدثنا الوليد بن ثعلبة الطائي، عن ابن بريدة، عن أبيه، عن النبي صلى الله عليه وسلم قال ‏\"‏ من قال حين يصبح أو حين يمسي اللهم أنت ربي لا إله إلا أنت خلقتني وأنا عبدك وأنا على عهدك ووعدك ما استطعت أعوذ بك من شر ما صنعت أبوء بنعمتك وأبوء بذنبي فاغفر لي إنه لا يغفر الذنوب إلا أنت ‏.‏ فمات من يومه أو من ليلته دخل الجنة ‏\"‏ ‏.‏",
      "text_en": " Narrated Buraydah ibn al-Hasib:                     The Prophet (ﷺ) said: If anyone says in the morning or in the evening: \"O Allah! Thou art my Lord; there is no god but Thee, Thou hast created me, and I am Thy servant and hold to Thy covenant and promise as much as I can; I seek refuge in Thee from the evil of what I have done: I acknowledge Thy favour to me, and I acknowledge my sin; pardon me, for none but Thee pardons sins, and dies during the daytime or during the night.\" he will go to Paradise.",
      "usc_msa_ref": "",
      "chain": [
        "30184",
        "20321",
        "14411",
        "11432",
        "3131"
      ]
    },
    {
      "id": "jami-al-tirmidhi-61",
      "hadith_no": "61",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، عن سفيان، عن علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، قال كان النبي صلى الله عليه وسلم يتوضأ لكل صلاة فلما كان عام الفتح صلى الصلوات كلها بوضوء واحد ومسح على خفيه ‏.‏ فقال عمر إنك فعلت شيئا لم تكن فعلته ‏.‏ قال ‏\"‏ عمدا فعلته ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وروى هذا الحديث علي بن قادم عن سفيان الثوري وزاد فيه ‏\"‏ توضأ مرة مرة ‏\"‏ ‏.‏ قال وروى سفيان الثوري هذا الحديث أيضا عن محارب بن دثار عن سليمان بن بريدة أن النبي صلى الله عليه وسلم كان يتوضأ لكل صلاة ‏.‏ ورواه وكيع عن سفيان عن محارب بن دثار عن سليمان بن بريدة عن أبيه ‏.‏ قال ورواه عبد الرحمن بن مهدي وغيره عن سفيان عن محارب بن دثار عن سليمان بن بريدة عن النبي صلى الله عليه وسلم مرسلا وهذا أصح من حديث وكيع ‏.‏ والعمل على هذا عند أهل العلم أنه يصلي الصلوات بوضوء واحد ما لم يحدث وكان بعضهم يتوضأ لكل صلاة استحبابا وإرادة الفضل ‏.‏ ويروى عن الإفريقي عن أبي غطيف عن ابن عمر عن النبي صلى الله عليه وسلم قال ‏\"‏ من توضأ على طهر كتب الله له به عشر حسنات ‏\"‏ ‏.‏ وهذا إسناد ضعيف ‏.‏ وفي الباب عن جابر بن عبد الله أن النبي صلى الله عليه وسلم صلى الظهر والعصر بوضوء واحد ‏.‏",
      "text_en": " Sulaiman bin Buraidah narrated that his father said:                     \"The Prophet would perform Wudu for every Salat. So during the year of the Conquest, he performed all of the prayers with one Wudu, and he wiped over his Khuff. So Umar said, 'You did something that you have not done before?' He replied: \"I did it on purpose.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20033",
        "20012",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "id": "jami-al-tirmidhi-152",
      "hadith_no": "152",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن منيع، والحسن بن الصباح البزار، وأحمد بن محمد بن موسى المعنى، واحد، قالوا حدثنا إسحاق بن يوسف الأزرق، عن سفيان الثوري، عن علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، قال أتى النبي صلى الله عليه وسلم رجل فسأله عن مواقيت الصلاة فقال ‏\"‏ أقم معنا إن شاء الله ‏\"‏ ‏.‏ فأمر بلالا فأقام حين طلع الفجر ثم أمره فأقام حين زالت الشمس فصلى الظهر ثم أمره فأقام فصلى العصر والشمس بيضاء مرتفعة ثم أمره بالمغرب حين وقع حاجب الشمس ثم أمره بالعشاء فأقام حين غاب الشفق ثم أمره من الغد فنور بالفجر ثم أمره بالظهر فأبرد وأنعم أن يبرد ثم أمره بالعصر فأقام والشمس آخر وقتها فوق ما كانت ثم أمره فأخر المغرب إلى قبيل أن يغيب الشفق ثم أمره بالعشاء فأقام حين ذهب ثلث الليل ثم قال ‏\"‏ أين السائل عن مواقيت الصلاة ‏\"‏ ‏.‏ فقال الرجل أنا ‏.‏ فقال ‏\"‏ مواقيت الصلاة كما بين هذين ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب صحيح ‏.‏ قال وقد رواه شعبة عن علقمة بن مرثد أيضا ‏.‏",
      "text_en": " Sulaiman bin Buraidah narrated that his father said:                     \"A man came to the Prophet to ask him about the times for Salat. So he said: 'Stay with us, In sha Allah.' So he ordered Bilal to call the Iqamah when Fajr began, then he ordered him to call the Iqamah when the Sun passed the zenith, then he prayed Zuhr. Then he ordered him to call the Iqamah to pray Asr while the sun was elevated and white. Then he ordered him (to call the Iqamah for) Maghrib when the (top) edge of the sun had set. Then he ordered him to call the Iqamah for Isha when the horizon (twilight) had vanished. Then he ordered him in the morning (to give the call for Fajr prayer), when the light of Fajr glowed. Then he ordered (him to call the Iqamah for) Zuhr, so he waited well until it had cooled. Then he ordered (him to call the Iqamah for) Asr, so he calIed the Iqamah while the sun was later in its position than what it was (the day before). Then he ordered him to delay Maghrib until right before the twilight had disappeared. Then he ordered (him to call the Iqamah for) Isha, so he called the Iqamah when a third of the night had passed. Then he said: 'Where is the one who asked about he times for the Salat?' So the man said, 'It is I.' So he said: 'The times [or the Salat are what are between these two.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "30244",
        "30304",
        "20411",
        "20012",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "id": "jami-al-tirmidhi-309",
      "hadith_no": "309",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبدة بن عبد الله الخزاعي البصري، حدثنا زيد بن الحباب، حدثنا حسين بن واقد، عن عبد الله بن بريدة، عن أبيه، قال كان رسول الله صلى الله عليه وسلم يقرأ في العشاء الآخرة بالشمس وضحاها ونحوها من السور ‏.‏ قال وفي الباب عن البراء بن عازب وأنس ‏.‏ قال أبو عيسى حديث بريدة حديث حسن ‏.‏ وقد روي عن النبي صلى الله عليه وسلم أنه قرأ في العشاء الآخرة بالتين والزيتون ‏.‏ وروي عن عثمان بن عفان أنه كان يقرأ في العشاء بسور من أوساط المفصل نحو سورة المنافقين وأشباهها ‏.‏ وروي عن أصحاب النبي صلى الله عليه وسلم والتابعين أنهم قرءوا بأكثر من هذا وأقل فكأن الأمر عندهم واسع في هذا ‏.‏ وأحسن شيء في ذلك ما روي عن النبي صلى الله عليه وسلم أنه قرأ بالشمس وضحاها والتين والزيتون ‏.‏",
      "text_en": " Abdullah bin Buraidah narrated that his father (Buraidah) said:                     \"Allah's Messenger would recite: By the sun and its brightness, or similar Surah for the latter Isha (prayer).\"",
      "usc_msa_ref": "",
      "chain": [
        "30149",
        "20650",
        "20648",
        "11432",
        "3131"
      ]
    },
    {
      "id": "jami-al-tirmidhi-542",
      "hadith_no": "542",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on the Two Eids - أَبْوَابُ الْعِيدَيْنِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
      "chapter_no": "5",
      "text_ar": "حدثنا الحسن بن الصباح البزار البغدادي، حدثنا عبد الصمد بن عبد الوارث، عن ثواب بن عتبة، عن عبد الله بن بريدة، عن أبيه، قال كان النبي صلى الله عليه وسلم لا يخرج يوم الفطر حتى يطعم ولا يطعم يوم الأضحى حتى يصلي ‏.‏ قال وفي الباب عن علي وأنس ‏.‏ قال أبو عيسى حديث بريدة بن حصيب الأسلمي حديث غريب ‏.‏ وقال محمد لا أعرف لثواب بن عتبة غير هذا الحديث ‏.‏ وقد استحب قوم من أهل العلم أن لا يخرج يوم الفطر حتى يطعم شيئا ويستحب له أن يفطر على تمر ولا يطعم يوم الأضحى حتى يرجع ‏.‏",
      "text_en": " Abdullah bin Buraidah narrated from his father:                     \"The Prophet would not leave on the Day of Fitr until he ate, and he would not eat on the day of Adha until he prayed.\"",
      "usc_msa_ref": "",
      "chain": [
        "30244",
        "20250",
        "14052",
        "11432",
        "3131"
      ]
    },
    {
      "id": "jami-al-tirmidhi-667",
      "hadith_no": "667",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Zakat - كتاب الزكاة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "7",
      "text_ar": "حدثنا علي بن حجر، حدثنا علي بن مسهر، عن عبد الله بن عطاء، عن عبد الله بن بريدة، عن أبيه، قال كنت جالسا عند النبي صلى الله عليه وسلم إذ أتته امرأة فقالت يا رسول الله إني كنت تصدقت على أمي بجارية وإنها ماتت ‏.‏ قال ‏\"‏ وجب أجرك وردها عليك الميراث ‏\"‏ ‏.‏ قالت يا رسول الله إنها كان عليها صوم شهر أفأصوم عنها قال ‏\"‏ صومي عنها ‏\"‏ ‏.‏ قالت يا رسول الله إنها لم تحج قط أفأحج عنها قال ‏\"‏ نعم حجي عنها ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ولا يعرف هذا من حديث بريدة إلا من هذا الوجه ‏.‏ وعبد الله بن عطاء ثقة عند أهل الحديث ‏.‏ والعمل على هذا عند أكثر أهل العلم أن الرجل إذا تصدق بصدقة ثم ورثها حلت له ‏.‏ وقال بعضهم إنما الصدقة شيء جعلها لله فإذا ورثها فيجب أن يصرفها في مثله ‏.‏ وروى سفيان الثوري وزهير بن معاوية هذا الحديث عن عبد الله بن عطاء ‏.‏",
      "text_en": " Abdullah bin Buraidah narrated from his father:                     \"I was sitting with the Prophet when a woman came to him and said: 'O Messenger of Allah! I gave a slave girl to my mother in charity and she died.' He said: 'Your reward is already established, and your right to inherit her has returned it (that Sadaqah) to you.' She said: 'O Messenger of Allah! There was a month of fasting due on her, shall I perform the fast for her?' He said: 'Fast on her behalf.' She said: 'O Messenger of Allah! She never performed Hajj, shall I perform Hajj for her?' He said: 'Yes, perform Hajj on her behalf.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20345",
        "10785",
        "11432",
        "3131"
      ]
    },
    {
      "id": "jami-al-tirmidhi-929",
      "hadith_no": "929",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن عبد الأعلى، حدثنا عبد الرزاق، عن سفيان الثوري، عن عبد الله بن عطاء، ‏.‏ قال وحدثنا علي بن حجر، حدثنا علي بن مسهر، عن عبد الله بن عطاء، عن عبد الله بن بريدة، عن أبيه، قال جاءت امرأة إلى النبي صلى الله عليه وسلم فقالت إن أمي ماتت ولم تحج أفأحج عنها قال ‏\"‏ نعم حجي عنها ‏\"‏ ‏.‏ قال أبو عيسى وهذا حديث حسن صحيح ‏.‏",
      "text_en": " Abdullah bin Buraidah narrated from his father who said:                     \"A woman came to the Prophet and said: 'My mother died and she did not perform Hajj should I perform Hajj on her behalf?' He said: 'Yes, perform Hajj on her behalf.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30449",
        "20121",
        "20012",
        "20387",
        "20345",
        "10785",
        "11432",
        "3131"
      ]
    },
    {
      "id": "jami-al-tirmidhi-982",
      "hadith_no": "982",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، عن المثنى بن سعيد، عن قتادة، عن عبد الله بن بريدة، عن أبيه، عن النبي صلى الله عليه وسلم قال ‏\"‏ المؤمن يموت بعرق الجبين ‏\"‏ ‏.‏ قال وفي الباب عن ابن مسعود ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ وقد قال بعض أهل العلم لا نعرف لقتادة سماعا من عبد الله بن بريدة ‏.‏",
      "text_en": " Abdullah bin Buraidah narrated from his father, that:                     The Prophet said:  \"The believer dies with sweat on his brow.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20031",
        "11019",
        "11432",
        "3131"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1054",
      "hadith_no": "1054",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن بشار، ومحمود بن غيلان، والحسن بن علي الخلال، قالوا حدثنا أبو عاصم النبيل، حدثنا سفيان، عن علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ قد كنت نهيتكم عن زيارة القبور فقد أذن لمحمد في زيارة قبر أمه فزوروها فإنها تذكر الآخرة ‏\"‏ ‏.‏ قال وفي الباب عن أبي سعيد وابن مسعود وأنس وأبي هريرة وأم سلمة ‏.‏ قال أبو عيسى حديث بريدة حديث حسن صحيح ‏.‏ والعمل على هذا عند أهل العلم لا يرون بزيارة القبور بأسا ‏.‏ وهو قول ابن المبارك والشافعي وأحمد وإسحاق ‏.‏",
      "text_en": " Sulaiman bin Buraidah narrated from his father that:                     The Messenger of Allah said: \"I had prohibited you from visiting the graves. But Muhammad was permitted to visit the grave of his mother: so visit them, for they will remind you of the Hereafter.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "30277",
        "30115",
        "20241",
        "20012",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1322-2",
      "hadith_no": "1322",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Chapters On Judgements From The Messenger of Allah - كتاب الأحكام عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن إسماعيل، حدثني الحسن بن بشر، حدثنا شريك، عن الأعمش، عن سعد بن عبيدة، عن ابن بريدة، عن أبيه، أن النبي صلى الله عليه وسلم قال ‏\"‏ القضاة ثلاثة قاضيان في النار وقاض في الجنة رجل قضى بغير الحق فعلم ذاك فذاك في النار وقاض لا يعلم فأهلك حقوق الناس فهو في النار وقاض قضى بالحق فذلك في الجنة ‏\"‏ ‏.‏",
      "text_en": " [Ibn Buraidah narrated from his father that the Prophet (ﷺ) said:                      \"The judges are three: Two judges that are in the Fire, and a judge that is in Paradise. A man who judges without the truth, and he knows that. This one is in the Fire. One who judges while not knowing, ruining the rights of the people. So he is in the Fire. A judge who judges with the truth, that is the one in Paradise.\"] (Daif)",
      "usc_msa_ref": "",
      "chain": [
        "34188",
        "30188",
        "20587",
        "11060",
        "11344",
        "11432",
        "3131"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1408",
      "hadith_no": "1408",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Blood Money - كتاب الديات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "16",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، حدثنا سفيان، عن علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، قال كان رسول الله صلى الله عليه وسلم إذا بعث أميرا على جيش أوصاه في خاصة نفسه بتقوى الله ومن معه من المسلمين خيرا فقال ‏\"‏ اغزوا بسم الله وفي سبيل الله قاتلوا من كفر بالله اغزوا ولا تغلوا ولا تغدروا ولا تمثلوا ولا تقتلوا وليدا ‏\"‏ ‏.‏ وفي الحديث قصة ‏.‏ قال وفي الباب عن عبد الله بن مسعود وشداد بن أوس وعمران بن حصين وأنس وسمرة والمغيرة ويعلى بن مرة وأبي أيوب ‏.‏ قال أبو عيسى حديث بريدة حديث حسن صحيح ‏.‏ وكره أهل العلم المثلة ‏.‏",
      "text_en": " Narrated Buraidah:                     from his father who said: \"Whenever the Messenger of Allah (ﷺ) dispatched a commander of an army he would exhort him personally; that he should have Taqwa of Allah, and regarding those of the Muslims who are with him; that he should be good to them. He would say: 'Fight in the Name of Allah and in Allah's curse. Fight those who disbelieve in Allah and fight, do not be treacherous, nor mutilate, nor kill a child.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20033",
        "20012",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1510",
      "hadith_no": "1510",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Sacrifices - كتاب الأضاحى عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "19",
      "text_ar": "حدثنا محمد بن بشار، ومحمود بن غيلان، والحسن بن علي الخلال، وغير، واحد، قالوا أخبرنا أبو عاصم النبيل، حدثنا سفيان الثوري، عن علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ كنت نهيتكم عن لحوم الأضاحي فوق ثلاث ليتسع ذو الطول على من لا طول له فكلوا ما بدا لكم وأطعموا وادخروا ‏\"‏ ‏.‏ قال وفي الباب عن ابن مسعود وعائشة ونبيشة وأبي سعيد وقتادة بن النعمان وأنس وأم سلمة ‏.‏ قال أبو عيسى حديث بريدة حديث حسن صحيح ‏.‏ والعمل على هذا عند أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم ‏.‏",
      "text_en": " Narrated Sulaiman bin Buraidah:                     From his father that the Messenger of Allah (ﷺ) said: \"I used to prohibit you from (eating) the meat of Sacrifice beyond three days so that those who have the ability would give to those who do not have it. So (now) eat  as you like, feed others, and save from it.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "30277",
        "30115",
        "20241",
        "20012",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1617",
      "hadith_no": "1617",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Military Expeditions - كتاب السير عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "21",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، عن سفيان، عن علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، قال كان رسول الله صلى الله عليه وسلم إذا بعث أميرا على جيش أوصاه في خاصة نفسه بتقوى الله ومن معه من المسلمين خيرا وقال ‏\"‏ اغزوا بسم الله وفي سبيل الله قاتلوا من كفر بالله ولا تغلوا ولا تغدروا ولا تمثلوا ولا تقتلوا وليدا فإذا لقيت عدوك من المشركين فادعهم إلى إحدى ثلاث خصال أو خلال أيتها أجابوك فاقبل منهم وكف عنهم ادعهم إلى الإسلام والتحول من دارهم إلى دار المهاجرين وأخبرهم إن فعلوا ذلك فإن لهم ما للمهاجرين وعليهم ما على المهاجرين وإن أبوا أن يتحولوا فأخبرهم أنهم يكونوا كأعراب المسلمين يجري عليهم ما يجري على الأعراب ليس لهم في الغنيمة والفىء شيء إلا أن يجاهدوا فإن أبوا فاستعن بالله عليهم وقاتلهم وإذا حاصرت حصنا فأرادوك أن تجعل لهم ذمة الله وذمة نبيه فلا تجعل لهم ذمة الله ولا ذمة نبيه واجعل لهم ذمتك وذمم أصحابك لأنكم إن تخفروا ذمتكم وذمم أصحابكم خير من أن تخفروا ذمة الله وذمة رسوله وإذا حاصرت أهل حصن فأرادوك أن تنزلهم على حكم الله فلا تنزلوهم ولكن أنزلهم على حكمك فإنك لا تدري أتصيب حكم الله فيهم أم لا ‏\"‏ ‏.‏ أو نحو هذا ‏.‏ قال أبو عيسى وفي الباب عن النعمان بن مقرن ‏.‏ وحديث بريدة حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Sulaiman bin Buraidah:                     From his father who said: \"When the Messenger of Allah (sawS) sent a commander of an army, he would exhort him concerning himself to have Taqwa of Allah, and he would exhort him to be good to those who are with him among the Muslims. He would say: 'Fight in the Name of Allah, in the cause of Allah. Fight those who disbelieve in Allah, and do not steal from the spoils of war or be treacherous, nor mutilate, and do not kill a child. When you meet your enemy among the idolaters, then call them to one of the three options or choices, whichever of them they respond to then accept it from them, and refrain from them. Call them to Islam, and to relocate from their land to the land of Emigrants. Inform them that if they do that, then they will have similar to what those who emigrated have, and from them will be required similar to what is required from those who have emigrated. And if they refuse to relocate, then inform them that they will be like the Bedouins among the Muslim, and they will be treated the same as Bedouins aretreated. There is no war spoils or Fay' for them, unless they fight along with the Muslims. If they refuse then seek aid from Allah against them and fight them. And if you lay siege to a fortress and they want you to grant them covenant from Allah and a covenant of His Prophet, then do not grant them the covenant of Allah nor the covenant of His Prophet. Rather grant them your own covenant and the covenant of your companions, it will be better than breaking Allah's covenant and the covenant of His Messenger. And if you lay siege to the people of a fortress and they want you to lift the siege for negotiating upon the judgement of Allah, then do not stop, but rather make them surrender to your judgement, for you do not know if you will come upon the judgement of Allah regarding them or not.' Or similar to that.\"[Abu 'Eisa said:] There is something on this topic from An-Nu'man bin Muqarrin, and the Hadith of Buraidah is a Hasan Sahih Hadith",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20033",
        "20012",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1785",
      "hadith_no": "1785",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Clothing - كتاب اللباس",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن حميد، حدثنا زيد بن حباب، وأبو تميلة يحيى بن واضح عن عبد الله بن مسلم، عن عبد الله بن بريدة، عن أبيه، قال جاء رجل إلى النبي صلى الله عليه وسلم وعليه خاتم من حديد فقال ‏\"‏ ما لي أرى عليك حلية أهل النار ‏\"‏ ‏.‏ ثم جاءه وعليه خاتم من صفر فقال ‏\"‏ ما لي أجد منك ريح الأصنام ‏\"‏ ‏.‏ ثم أتاه وعليه خاتم من ذهب فقال ‏\"‏ ما لي أرى عليك حلية أهل الجنة ‏\"‏ ‏.‏ قال من أى شيء أتخذه قال ‏\"‏ من ورق ولا تتمه مثقالا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏ وفي الباب عن عبد الله بن عمرو ‏.‏ وعبد الله بن مسلم يكنى أبا طيبة وهو مروزي ‏.‏",
      "text_en": " Narrated 'Abdullah bin Buraidah:                     From his father who said: \"A man wearing an iron ring came to the Prophet (ﷺ). So he said to him: 'What is this I see on you, jewelry of the people of the Fire ?' Then he came wearing a ring of brass. So he said: 'What is this smell of idols I sense on you ?' Then he came wearing a ring of gold. So he said to him: 'What is this jewelry of the people of Paradise I see on you ?' So he said: 'What should I use then ?' He said: 'From silver, but not its entire weight.\"[Abu 'Eisa said:] This Hadith is Gharib and there are narrations on this topic from 'Abdullah bin 'Amr, and 'Abdullah bin Muslim's Kunyah is Abu Taibah, and he is from Al-Marwaz.",
      "usc_msa_ref": "",
      "chain": [
        "38495",
        "20650",
        "11872",
        "11432",
        "3131"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1869",
      "hadith_no": "1869",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Drinks - كتاب الأشربة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "26",
      "text_ar": "حدثنا محمد بن بشار، والحسن بن علي، ومحمود بن غيلان، قالوا حدثنا أبو عاصم، حدثنا سفيان، عن علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إني كنت نهيتكم عن الظروف وإن ظرفا لا يحل شيئا ولا يحرمه وكل مسكر حرام ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Sulaiman bin Buraidah:                     From his father, that the Messenger of Allah (ﷺ) said: \"I had indeed forbidden you from using containers, but the container does not make anything lawful nor unlawful, rather every intoxicant is unlawful.\" [Abu 'Eisa said:] This Hadith is Hasan Sahih.",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "30",
        "30277",
        "20241",
        "20012",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2739",
      "hadith_no": "2739",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on the description of Paradise - كتاب صفة الجنة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "38",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن، قال أخبرنا عاصم بن علي، حدثنا المسعودي، عن علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، أن رجلا، سأل النبي صلى الله عليه وسلم فقال يا رسول الله هل في الجنة من خيل قال ‏\"‏ إن الله أدخلك الجنة فلا تشاء أن تحمل فيها على فرس من ياقوتة حمراء يطير بك في الجنة حيث شئت إلا فعلت ‏\"‏ ‏.‏ قال وسأله رجل فقال يا رسول الله هل في الجنة من إبل قال فلم يقل له مثل ما قال لصاحبه قال ‏\"‏ إن يدخلك الله الجنة يكن لك فيها ما اشتهت نفسك ولذت عينك ‏\"‏ ‏.‏",
      "text_en": " Sulaiman bin Buraidah narrated from his father that a man asked the Prophet (s.a.w):                     \"O Messenger of Allah, are there horses in Paradise?\" He said,  \"If Allah admits you into Paradise, you will not wish to be carried, on a horse of rubies that will fly with you wherever you want in Paradise except that you will do so.\" He said: \"And a man asked him: 'O Messenger of Allah, are there camels in Paradise?\"\" He said: \"So he (s.a.w) did not say what he said to his companion, rather, he said: 'If Allah admits you into Paradise, you will have in it whatever is desired by your soul and pleasing to you eye.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30025",
        "20430",
        "20724",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2743",
      "hadith_no": "2743",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on the description of Paradise - كتاب صفة الجنة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "38",
      "text_ar": "حدثنا حسين بن يزيد الطحان الكوفي، حدثنا محمد بن فضيل، عن ضرار بن مرة، عن محارب بن دثار، عن ابن بريدة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أهل الجنة عشرون ومائة صف ثمانون منها من هذه الأمة وأربعون من سائر الأمم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ وقد روي هذا الحديث عن علقمة بن مرثد عن سليمان بن بريدة عن النبي صلى الله عليه وسلم مرسلا ومنهم من قال عن سليمان بن بريدة عن أبيه وحديث أبي سنان عن محارب بن دثار حسن ‏.‏ وأبو سنان اسمه ضرار بن مرة وأبو سنان الشيباني اسمه سعيد بن سنان وهو بصري وأبو سنان الشامي اسمه عيسى بن سنان هو القسملي ‏.‏",
      "text_en": " Ibn Buraidah narrated from his father that the Messenger of Allah (s.a.w)said:                     \"The people of Paradise are a hundred and twenty rows, eighty of them are from this nation, and forty are from the rest of the nations.\"",
      "usc_msa_ref": "",
      "chain": [
        "20356",
        "11389",
        "11432",
        "3131"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3052",
      "hadith_no": "3052",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا هناد، حدثنا وكيع، عن دلهم بن صالح، عن حجير بن عبد الله، عن ابن بريدة، عن أبيه، أن النجاشي، أهدى إلى النبي صلى الله عليه وسلم خفين أسودين ساذجين فلبسهما ثم توضأ ومسح عليهما ‏.‏ قال هذا حديث حسن إنما نعرفه من حديث دلهم وقد رواه محمد بن ربيعة عن دلهم ‏.‏",
      "text_en": " Narrated Ibn Buraidah:                     from his father: \"An-Najashi gave the Prophet (ﷺ) two black plain Khuff. So he wore them, then he performed Wudu and wiped over them.\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20032",
        "15130",
        "28094",
        "11432",
        "3131"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3110",
      "hadith_no": "3110",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Parables - كتاب الأمثال عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "44",
      "text_ar": "حدثنا محمد بن إسماعيل، حدثنا خلاد بن يحيى، حدثنا بشير بن المهاجر، أخبرنا عبد الله بن بريدة، عن أبيه، قال قال النبي صلى الله عليه وسلم ‏\"‏ هل تدرون ما هذه وما هذه ‏\"‏ ‏.‏ ورمى بحصاتين ‏.‏ قالوا الله ورسوله أعلم ‏.‏ قال ‏\"‏ هذاك الأمل وهذاك الأجل ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه ‏.‏",
      "text_en": " Narrated 'Abdullah bin Buraidah:                     from his father that the Prophet (ﷺ) said: \"Do you know what the parable of this and this is?\" - and he tossed two pebbles. They said: \"Allah and His Messenger (ﷺ) know better.\" He said: \"This (the farther) one is hope, and this (closer) one is death.\"",
      "usc_msa_ref": "",
      "chain": [
        "34188",
        "20191",
        "10747",
        "11432",
        "3131"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3424",
      "hadith_no": "3424",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا يعقوب بن إبراهيم الدورقي، حدثنا أبو تميلة، عن الزبير بن جنادة، عن ابن بريدة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لما انتهينا إلى بيت المقدس قال جبريل بإصبعه فخرق به الحجر وشد به البراق ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Narrated Ibn Buraidah:                     from his father that the Messenger of Allah (ﷺ) said: \"When we reached Bait Al-Maqdis, Jibra'il pointed with his finger causing a crack in the rock, and he tied Al-Buraq to it.\"",
      "usc_msa_ref": "",
      "chain": [
        "30400",
        "20183",
        "11432",
        "3131"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3523-2",
      "hadith_no": "3523",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا محمد بن حاتم المؤدب، حدثنا الحكم بن ظهير، حدثنا علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، قال شكا خالد بن الوليد المخزومي إلى النبي صلى الله عليه وسلم فقال يا رسول الله ما أنام الليل من الأرق ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ إذا أويت إلى فراشك فقل اللهم رب السموات السبع وما أظلت ورب الأرضين وما أقلت ورب الشياطين وما أضلت كن لي جارا من شر خلقك كلهم جميعا أن يفرط على أحد منهم أو أن يبغي على عز جارك وجل ثناؤك ولا إله غيرك ولا إله إلا أنت ‏\"‏ ‏.‏ قال هذا حديث ليس إسناده بالقوي ‏.‏ والحكم بن ظهير قد ترك حديثه بعض أهل الحديث ويروى هذا الحديث عن النبي صلى الله عليه وسلم مرسلا من غير هذا الوجه ‏.‏",
      "text_en": " Sulaiman bin Buraidah narrated that his father said:                     “Khalid bin Al-Walid al Makhzumi complained to the Prophet saying: ‘O Messenger of allah, I do not sleep at night due to insomnia.’ So Allah’s Prophet said: ‘When you go to your bed, say: I Allah, Lord of the Seven Heavens and what they have shaded, Lord of the earths and what they carry, Lord of the Shyatin and those they have misguided, be for me a Protector against the evil of Your creation, all of them together, so that none of them should transgress against me, or oppress me, mighty is the one who seeks protection in You, and glorified if Your praise, and there is none worthy of worship other than You, and there is none worthy of worship except You. (Allahumma Rabbas-Samawatis-Sab’i Wa Ma Azallat, Wa Rabbal-Ardina Wa Ma Aqallat, Wa Rabbash-Shayatini Wa Ma Adallat, Kun Li Jaran Min Sharri Khalqika Kullihim Jami’an An Yafruta Alayya, Azza Jaruka Wa Jalla Thana’uka, Wa La Ilaha Ghairuka Wa La Ilaha Illa Anta).”",
      "usc_msa_ref": "",
      "chain": [
        "38487",
        "28130",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4084",
      "hadith_no": "4084",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا إسماعيل بن موسى الفزاري ابن بنت السدي، حدثنا شريك، عن أبي ربيعة، عن ابن بريدة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله أمرني بحب أربعة وأخبرني أنه يحبهم ‏\"‏ ‏.‏ قيل يا رسول الله سمهم لنا ‏.‏ قال ‏\"‏ علي منهم يقول ذلك ثلاثا وأبو ذر والمقداد وسلمان أمرني بحبهم وأخبرني أنه يحبهم ‏\"‏ ‏.‏ قال هذا حديث حسن غريب لا نعرفه إلا من حديث شريك ‏.‏",
      "text_en": " Narrated Buraidah:                     that the Messenger of Allah (ﷺ) said: \"Indeed Allah has ordered me to love four, and He informed me that He loves them.\" It was said: \"O Messenger of Allah! Name them for us.\" He said: \"'Ali is among them,\" saying that three times, \"And Abu Dharr, Al-Miqdad, and Salman. And He ordered me to love them, and He informed me that He loves them.\"",
      "usc_msa_ref": "",
      "chain": [
        "35016",
        "20587",
        "11432",
        "3131"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4239",
      "hadith_no": "4239",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا أبو كريب، حدثنا عثمان بن ناجية، عن عبد الله بن مسلم أبي طيبة، عن عبد الله بن بريدة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما من أحد من أصحابي يموت بأرض إلا بعث قائدا ونورا لهم يوم القيامة ‏\"‏ ‏.‏ قال هذا حديث غريب ‏.‏ وروي هذا الحديث عن عبد الله بن مسلم أبي طيبة عن ابن بريدة عن النبي صلى الله عليه وسلم مرسل وهو أصح ‏.‏",
      "text_en": " Narrated 'Abdullah bin Buraidah:                     from his father, that the Messenger of Allah (ﷺ) said: \"There is no one among my Companions who dies in a land except that he shall be resurrected as a guide and light for them (people of that land) on the Day of Resurrection.\"",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "11432",
        "3131"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4242",
      "hadith_no": "4242",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا إبراهيم بن سعيد الجوهري، حدثنا الأسود بن عامر، عن جعفر الأحمر، عن عبد الله بن عطاء، عن ابن بريدة، عن أبيه، قال كان أحب النساء إلى رسول الله صلى الله عليه وسلم فاطمة ومن الرجال علي ‏.‏ قال إبراهيم بن سعيد يعني من أهل بيته ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من هذا الوجه ‏.‏",
      "text_en": " Narrated Buraidah:                     \"The most beloved of women to the Messenger of Allah (ﷺ) was Fatimah and from the men was 'Ali.\"",
      "usc_msa_ref": "",
      "chain": [
        "30498",
        "20380",
        "31935",
        "10785",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-an-nasai-134",
      "hadith_no": "134",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا يحيى، عن سفيان، قال حدثنا علقمة بن مرثد، عن ابن بريدة، عن أبيه، قال كان رسول الله صلى الله عليه وسلم يتوضأ لكل صلاة فلما كان يوم الفتح صلى الصلوات بوضوء واحد فقال له عمر فعلت شيئا لم تكن تفعله ‏.‏ قال ‏\"‏ عمدا فعلته يا عمر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn Buraidah that his father said:                      \"The Messenger of Allah (ﷺ) used to perform Wudu' for every prayer. One the day of the Conquest (of Makkah), he offered all the prayers with one Wudu'. 'Umar said to him: 'You have done something that you never did before.' He said: 'I did that deliberately, O 'Umar.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30359",
        "20031",
        "20012",
        "11374",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-an-nasai-463",
      "hadith_no": "463",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Salah - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "أخبرنا الحسين بن حريث، قال أنبأنا الفضل بن موسى، عن الحسين بن واقد، عن عبد الله بن بريدة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن العهد الذي بيننا وبينهم الصلاة فمن تركها فقد كفر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin Buraidah that his father said:                      \"The Messenger of Allah (ﷺ) said: 'The covenant that stands between us and them is the Salah; whoever abandons it, he has committed disbelief.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30325",
        "20452",
        "20648",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-an-nasai-524",
      "hadith_no": "524",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرني عمرو بن هشام، قال حدثنا مخلد بن يزيد، عن سفيان الثوري، عن علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، قال جاء رجل إلى رسول الله صلى الله عليه وسلم فسأله عن وقت الصلاة فقال ‏\"‏ أقم معنا هذين اليومين ‏\"‏ ‏.‏ فأمر بلالا فأقام عند الفجر فصلى الفجر ثم أمره حين زالت الشمس فصلى الظهر ثم أمره حين رأى الشمس بيضاء فأقام العصر ثم أمره حين وقع حاجب الشمس فأقام المغرب ثم أمره حين غاب الشفق فأقام العشاء ثم أمره من الغد فنور بالفجر ثم أبرد بالظهر وأنعم أن يبرد ثم صلى العصر والشمس بيضاء وأخر عن ذلك ثم صلى المغرب قبل أن يغيب الشفق ثم أمره فأقام العشاء حين ذهب ثلث الليل فصلاها ثم قال ‏\"‏ أين السائل عن وقت الصلاة وقت صلاتكم ما بين ما رأيتم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Sulaiman bin Buraidah that his father said:                      \"A man came to the Messenger of Allah (ﷺ) and asked him about the times of prayer. He said: 'Stay with us for these two days.' Then he told Bilal to say the Iqamah at dawn and he prayed Fajr. Then he told him to do that when the sun had passed its zenith and he prayed Zuhr. Then he told him to do that when the sun was still bright, and he said the Iqamah for 'Asr. Then he told him to do that when the last part of the sun had dissapeared, and he said the Iqamah for Maghrib. Then he told him to do that when the twilight had disappeared and he said the Iqamah for 'Isha'. The following day, he prayed Fajr when there was light, then he delayed Zuhr until it was cooler, and waited until it was much cooler before praying 'Asr but the sun was still clear, so he prayed 'Asr later than on the first day. Then he prayed Maghrib before the twilight disappeared. Then he told him to say the Iqamah for 'Isha' when one-third of the night had passed, and he prayed, then he said: 'Where is the one who was asking about the times of prayer? The times of your prayer are between the times you have seen.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38434",
        "20462",
        "20012",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "id": "sunan-an-nasai-999",
      "hadith_no": "999",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا محمد بن علي بن الحسن بن شقيق، قال حدثنا أبي قال، أنبأنا الحسين بن واقد، عن عبد الله بن بريدة، عن أبيه، أن رسول الله صلى الله عليه وسلم كان يقرأ في صلاة العشاء الآخرة بالشمس وضحاها وأشباهها من السور ‏.‏",
      "text_en": " It was narrated from Abdullah bin Buraidah, from his father, that:                     The Messenger of Allah (ﷺ) used to recite 'By the sun and its brightness' and similar surahs in Isha'.",
      "usc_msa_ref": "",
      "chain": [
        "38554",
        "30362",
        "20648",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-an-nasai-Grade-49",
      "hadith_no": "Grade",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرنا محمد بن عبد العزيز، قال حدثنا الفضل بن موسى، عن حسين بن واقد، عن عبد الله بن بريدة، عن أبيه، قال كان النبي صلى الله عليه وسلم يخطب فجاء الحسن والحسين - رضى الله عنهما - وعليهما قميصان أحمران يعثران فيهما فنزل النبي صلى الله عليه وسلم فقطع كلامه فحملهما ثم عاد إلى المنبر ثم قال ‏\"‏ صدق الله ‏{‏ إنما أموالكم وأولادكم فتنة ‏}‏ رأيت هذين يعثران في قميصيهما فلم أصبر حتى قطعت كلامي فحملتهما ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin Buraidah that:                     His father said: \"The Prophet (ﷺ) was preaching, then Al-Hasan and Al-Husain came, wearing red shirts and stumbling in them. The Prophet (ﷺ) came down, interrupting himself, and picked them up, then he went back to the minbar and said: 'Allah has spoken the truth: Your wealth and your children are only a trial. I saw these two stumbling in their shirts and I could not continue until I had interrupted myself and picked them up.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30380",
        "20452",
        "20648",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-an-nasai-1585",
      "hadith_no": "1585",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Prayer for the Two 'Eids - كتاب صلاة العيدين",
      "chapter_no": "19",
      "text_ar": "أخبرنا يعقوب بن إبراهيم، قال حدثنا أبو تميلة، عن الحسين بن واقد، عن ابن بريدة، عن أبيه، قال بينا رسول الله صلى الله عليه وسلم على المنبر يخطب إذ أقبل الحسن والحسين عليهما السلام عليهما قميصان أحمران يمشيان ويعثران فنزل وحملهما فقال ‏\"‏ صدق الله ‏{‏ إنما أموالكم وأولادكم فتنة ‏}‏ رأيت هذين يمشيان ويعثران في قميصيهما فلم أصبر حتى نزلت فحملتهما ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn Buraidah that:                     His father said: \"While the Messenger of Allah (ﷺ) was on the minbar, Al-Hasan and Al-Husain came,wearing red shirts, walking and stumbling. He came down and picked them up, then said: 'Allah has spoken the truth: Your wealth and your children are only a trial.' I saw these two walking and stumbling in their shirts, and I could not be patient until I went down and picked them up.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20184",
        "20183",
        "20648",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-an-nasai-1828",
      "hadith_no": "1828",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا يحيى، عن المثنى بن سعيد، عن قتادة، عن عبد الله بن بريدة، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ موت المؤمن بعرق الجبين ‏\"‏ ‏.‏",
      "text_en": " It is narrated from 'Abdullah bin Buraidah, from his father, that the Messenger of Allah said:                     \"The believer dies with sweat on his forehead.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20031",
        "11019",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-an-nasai-1829",
      "hadith_no": "1829",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا محمد بن معمر، قال حدثنا يوسف بن يعقوب، قال حدثنا كهمس، عن ابن بريدة، عن أبيه، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ المؤمن يموت بعرق الجبين ‏\"‏ ‏.‏",
      "text_en": " It was narrated from (Ibn Buraidah) that his father said:                     \"I heard the Messenger of Allah say: 'The believer dies with sweat on his forehead.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30172",
        "20305",
        "11303",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-an-nasai-2032",
      "hadith_no": "2032",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرني محمد بن آدم، عن ابن فضيل، عن أبي سنان، عن محارب بن دثار، عن عبد الله بن بريدة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏ نهيتكم عن زيارة القبور فزوروها، ونهيتكم عن لحوم الأضاحي فوق ثلاثة أيام فأمسكوا ما بدا لكم، ونهيتكم عن النبيذ إلا في سقاء فاشربوا في الأسقية كلها، ولا تشربوا مسكرا ‏\"‏ ‏.‏",
      "text_en": " It is was narrated from 'Abdullah bin Buraidah  that his father said:                     \"The Messenger of Allah said: 'I forbade you to visit graves but now visit them; and I forbade you to eat the sacrificial meat after three days, but now keep it as long as you want; and I forbade you to make Nabidh I anything but a water-skin but now drink it from any kind of container, but do not drink intoxicants.\"'",
      "usc_msa_ref": "",
      "chain": [
        "20356",
        "11389",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-an-nasai-3189",
      "hadith_no": "3189",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا حسين بن حريث، ومحمود بن غيلان، - واللفظ لحسين - قالا حدثنا وكيع، عن سفيان، عن علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ حرمة نساء المجاهدين على القاعدين كحرمة أمهاتهم وما من رجل يخلف في امرأة رجل من المجاهدين فيخونه فيها إلا وقف له يوم القيامة فأخذ من عمله ما شاء فما ظنكم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Sulaiman bin Buraidah that his father said:                      \"The Messenger of Allah (ﷺ) said: 'The sanctity of the wives of the Mujahidin to those who stay behind is like the sanctity of their mothers. There is no man who takes on the responsibility of looking after the wife of one of the Mujahidin and betrays him with her but he (the betrayer) will be made to stand before him on the Day of Resurrection and he will take whatever he wants of his (good) deeds. So what do you think?'\"",
      "usc_msa_ref": "",
      "chain": [
        "30325",
        "30277",
        "20032",
        "20012",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "id": "sunan-an-nasai-3190",
      "hadith_no": "3190",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرني هارون بن عبد الله، قال حدثنا حرمي بن عمارة، قال حدثنا شعبة، عن علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ حرمة نساء المجاهدين على القاعدين كحرمة أمهاتهم وإذا خلفه في أهله فخانه قيل له يوم القيامة هذا خانك في أهلك فخذ من حسناته ما شئت فما ظنكم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Sulaiman bin Buraidah, from his father, that the Messenger of Allah (ﷺ) said:                      \"The sanctity of the wive of the Mujahidin to those who stay behind is like the sanctity of their mothers. If he takes on the responsibility of looking after his wife then betrays him, it will be said to him on the Day of Resurrection: 'This one betrayed you with your wife, so take whatever you want of his good deeds.' So what do you think?\"",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20221",
        "20020",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "id": "sunan-an-nasai-3191",
      "hadith_no": "3191",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا عبد الله بن محمد بن عبد الرحمن، قال حدثنا سفيان، قال حدثنا قعنب، - كوفي - عن علقمة بن مرثد، عن ابن بريدة، عن أبيه، عن النبي صلى الله عليه وسلم قال ‏\"‏ حرمة نساء المجاهدين على القاعدين في الحرمة كأمهاتهم وما من رجل من القاعدين يخلف رجلا من المجاهدين في أهله إلا نصب له يوم القيامة فيقال يا فلان هذا فلان فخذ من حسناته ما شئت ‏\"‏ ‏.‏ ثم التفت النبي صلى الله عليه وسلم إلى أصحابه فقال ‏\"‏ ما ظنكم ترون يدع له من حسناته شيئا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn Buraidah, from his father, that the Messenger of Allah (ﷺ) said:                      \"The sanctity of the wives of the Mujahidin to those who stay behind is like the sanctity of their mothers. There is no man among those who stay behind who takes on the responsibility of looking after the wife of one of the Mujahidin (and betrays him) but he (the betrayer) will be made to stand before him on the Day Resurrection and it will be said: 'O So-and-so, this is so-and-so, take whatever you want from his good deeds.'\" Then the Prophet (ﷺ) turned to his Companions and said: \"What do you think: Will he leave him any of his good deeds?\"",
      "usc_msa_ref": "",
      "chain": [
        "20012",
        "11374",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-an-nasai-3221",
      "hadith_no": "3221",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا الحسين بن حريث، قال حدثنا الفضل بن موسى، عن الحسين بن واقد، عن عبد الله بن بريدة، عن أبيه، قال خطب أبو بكر وعمر رضى الله عنهما فاطمة فقال رسول الله صلى الله عليه وسلم ‏\"‏ إنها صغيرة ‏\"‏ ‏.‏ فخطبها علي فزوجها منه ‏.‏",
      "text_en": " Narrated 'Abdullah bin Buraidah:                     It was narrated from 'Abdullah bin Buraidah that his father said: \"Abu Bakr and 'Umar, may Allah be pleased with them, proposed marriage to Fatimah but the Messenger of Allah said: 'She is young.' Then 'Ali proposed marriage to her and he married her to him.\"",
      "usc_msa_ref": "",
      "chain": [
        "30325",
        "20452",
        "20648",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-an-nasai-3225",
      "hadith_no": "3225",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا يعقوب بن إبراهيم، قال حدثنا أبو تميلة، عن حسين بن واقد، عن ابن بريدة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن أحساب أهل الدنيا الذي يذهبون إليه المال ‏\"‏ ‏.‏",
      "text_en": " Narrated Ibn Buraidah:                     It was narrated from Ibn Buraidah that his father said: \"The Messenger of Allah said: 'The nobility of the people of this world, that which they (always) go to, is wealth.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20184",
        "20183",
        "20648",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-an-nasai-3772",
      "hadith_no": "3772",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا الحسين بن حريث، قال حدثنا الفضل بن موسى، عن حسين بن واقد، عن عبد الله بن بريدة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من قال إني بريء من الإسلام فإن كان كاذبا فهو كما قال وإن كان صادقا لم يعد إلى الإسلام سالما ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin Buraidah that his father said:                      \"The Messenger of Allah said: 'Whoever says: I have nothing to do with Islam, if he is lying then he is as he said, and if he is telling the truth, his Islam will not be sound.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30325",
        "20452",
        "20648",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-an-nasai-3990",
      "hadith_no": "3990",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا الحسن بن إسحاق المروزي، - ثقة - حدثني خالد بن خداش، قال حدثنا حاتم بن إسماعيل، عن بشير بن المهاجر، عن عبد الله بن بريدة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ قتل المؤمن أعظم عند الله من زوال الدنيا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin Buraidah that his father said:                     \"The Messenger of Allah [SAW] said: 'Killing a believer is more grievous before Allah than the extinction of the whole world.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30323",
        "20159",
        "10747",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-an-nasai-4092",
      "hadith_no": "4092",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا أحمد بن نصر، قال حدثنا المؤمل، عن سفيان، عن علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من قتل دون ماله فهو شهيد ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Sulaiman bin Buraidah that his father said:                     \"The Messenger of Allah [SAW] said: 'Whoever is killed defending his wealth, he is a martyr.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20012",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "id": "sunan-an-nasai-4213",
      "hadith_no": "4213",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of al-'Aqiqah - كتاب العقيقة",
      "chapter_no": "40",
      "text_ar": "أخبرنا الحسين بن حريث، قال حدثنا الفضل، عن الحسين بن واقد، عن عبد الله بن بريدة، عن أبيه، أن رسول الله صلى الله عليه وسلم عق عن الحسن والحسين ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin Buraidah, from his father, that:                     the Messenger of Allah offered the 'Aqiqah for Al-Hasan and Al-Husain.",
      "usc_msa_ref": "",
      "chain": [
        "30325",
        "20452",
        "20648",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-an-nasai-4429",
      "hadith_no": "4429",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا عمرو بن منصور، قال حدثنا عبد الله بن محمد، - وهو النفيلي - قال حدثنا زهير، ح وأنبأنا محمد بن معدان بن عيسى، قال حدثنا الحسن بن أعين، قال حدثنا زهير، قال حدثنا زبيد بن الحارث، عن محارب بن دثار، عن ابن بريدة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إني كنت نهيتكم عن ثلاث عن زيارة القبور فزوروها ولتزدكم زيارتها خيرا ونهيتكم عن لحوم الأضاحي بعد ثلاث فكلوا منها وأمسكوا ما شئتم ونهيتكم عن الأشربة في الأوعية فاشربوا في أى وعاء شئتم ولا تشربوا مسكرا ‏\"‏ ‏.‏ ولم يذكر محمد ‏\"‏ وأمسكوا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn Buraidah that his father said:                     \" The Messenger of Allah said: 'I used to forbid you from doing three things: to visit graves, but now visit three, for you may benefit from that. And I used to forbid you (from eating) the meat of sacrificial animals after three days but now eat it, and keep whatever you want. A and I forbade you to drink form (certain kinds of) vessels, but now drink form whatever kind of vessel you want but do not drink any kind of intoxicant.\" (Sahih )Muhammad (one of the narrators) did not mention: \"kept (whatever you want).",
      "usc_msa_ref": "",
      "chain": [
        "38433",
        "30352",
        "20321",
        "38591",
        "20418",
        "20321",
        "11335",
        "11389",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-an-nasai-4430",
      "hadith_no": "4430",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا العباس بن عبد العظيم العنبري، عن الأحوص بن جواب، عن عمار بن رزيق، عن أبي إسحاق، عن الزبير بن عدي، عن ابن بريدة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إني كنت نهيتكم عن لحوم الأضاحي بعد ثلاث وعن النبيذ إلا في سقاء وعن زيارة القبور فكلوا من لحوم الأضاحي ما بدا لكم وتزودوا وادخروا ومن أراد زيارة القبور فإنها تذكر الآخرة واشربوا واتقوا كل مسكر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn Buraidah that his fhater said:                     \"The Messenger of Allah said: \"I used to forbid you (from eating) the meat of sacrificial animals after three days, and to (make) Nadidh except in a water skin, and to visit graves. But now eat whatever you want of the meat, or take some with you (when traveling) or store it: and whoever wants to visit graves, it will remind him of the Hereafter; and drink, but beware of any kind of intoxicant.\"' (Sahih )",
      "usc_msa_ref": "",
      "chain": [
        "30437",
        "20595",
        "11049",
        "11336",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-an-nasai-4731",
      "hadith_no": "4731",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا الحسن بن إسحاق المروزي، قال حدثني خالد بن خداش، قال حدثنا حاتم بن إسماعيل، عن بشير بن المهاجر، عن عبد الله بن بريدة، عن أبيه، أن رجلا، جاء إلى النبي صلى الله عليه وسلم فقال إن هذا الرجل قتل أخي ‏.‏ قال ‏\"‏ اذهب فاقتله كما قتل أخاك ‏\"‏ ‏.‏ فقال له الرجل اتق الله واعف عني فإنه أعظم لأجرك وخير لك ولأخيك يوم القيامة ‏.‏ قال فخلى عنه قال فأخبر النبي صلى الله عليه وسلم فسأله فأخبره بما قال له قال فأعنفه ‏\"‏ أما إنه كان خيرا مما هو صانع بك يوم القيامة يقول يا رب سل هذا فيم قتلني ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin Buraidah, from the father, that a man came to the Prophet and said:                     \"This man killed my brother.\" He said: \"Go and kill him as he killed your brother.\" The man said to him: \"Fear Allah and let me go, for that will bring you a greater reward and will be better for you and your brother on the Day of Resurrection.\" So he let him go. The Prophet was told about that, so he asked him about it, and he told him what he had said. He said: \"Pardoning him would be better for you than what he would have done for you on the Day of Resurrection when he said: 'O Lord, ask him why he killed me.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30323",
        "20159",
        "10747",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-an-nasai-4813",
      "hadith_no": "4813",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا يعقوب بن إبراهيم، وإبراهيم بن يونس بن محمد، قالا حدثنا عبيد الله بن موسى، قال حدثنا يوسف بن صهيب، عن عبد الله بن بريدة، عن أبيه، أن امرأة، خذفت امرأة فأسقطت فجعل رسول الله صلى الله عليه وسلم في ولدها خمسين شاة ونهى يومئذ عن الخذف ‏.‏ أرسله أبو نعيم ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin Buraidah, from his father, that:                     a woman threw some pebbles and stuck another woman, and she miscarried. The Messenger of Allah stipulated (a Diyah of ) fifty sheep for her child. And on that day, he forbade throwing pebbles.",
      "usc_msa_ref": "",
      "chain": [
        "20184",
        "20340",
        "15649",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-an-nasai-5195",
      "hadith_no": "5195",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا زيد بن الحباب، قال حدثني عبد الله بن مسلم، - من أهل مرو أبو طيبة - قال حدثنا عبد الله بن بريدة، عن أبيه، أن رجلا، جاء إلى النبي صلى الله عليه وسلم وعليه خاتم من حديد فقال ‏\"‏ ما لي أرى عليك حلية أهل النار ‏\"‏ ‏.‏ فطرحه ثم جاءه وعليه خاتم من شبه فقال ‏\"‏ ما لي أجد منك ريح الأصنام ‏\"‏ ‏.‏ فطرحه قال يا رسول الله من أى شىء أتخذه قال ‏\"‏ من ورق ولا تتمه مثقالا ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah bin Buraidah narrated from his father that:                     A man came to the Prophet [SAW] and he was wearing an iron ring. He said: \"Why do I see you wearing the jewelry of the people of Hell?\" He threw it away, then he came and he was wearing a brass ring. He said: \"Why do I notice the stench of idols from you?\" So he threw it away, and said: \"O Messenger of Allah, what should I use?\" He said: \"Silver, but it should not equal a Mithqal.\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20650",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-an-nasai-5651",
      "hadith_no": "5651",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا العباس بن عبد العظيم، عن الأحوص بن جواب، عن عمار بن رزيق، أنه حدثهم عن أبي إسحاق، عن الزبير بن عدي، عن ابن بريدة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إني كنت نهيتكم عن لحوم الأضاحي فتزودوا وادخروا ومن أراد زيارة القبور فإنها تذكر الآخرة واشربوا واتقوا كل مسكر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn Buraidah that his father said:                     \"The Messenger of Allah [SAW] said: 'I used to forbid you (to store) the sacrificial meat, but now eat it and store it; and whosoever wants to visit graves (may do so), for they are a reminder of the Hereafter; and drink but avoid all intoxicants.\"",
      "usc_msa_ref": "",
      "chain": [
        "30437",
        "20595",
        "11049",
        "11336",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-an-nasai-5652",
      "hadith_no": "5652",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرني محمد بن آدم بن سليمان، عن ابن فضيل، عن أبي سنان، عن محارب بن دثار، عن عبد الله بن بريدة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إني كنت نهيتكم عن زيارة القبور فزوروها ونهيتكم عن لحوم الأضاحي فوق ثلاثة أيام فأمسكوا ما بدا لكم ونهيتكم عن النبيذ إلا في سقاء فاشربوا في الأسقية كلها ولا تشربوا مسكرا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin Buraidah that his father said:                     \"The Messenger of Allah [SAW] said: 'I used to forbid you to visit graves, but (now) visit them. And I forbade you (to keep) the sacrificial meat for three days, but now keep whatever you wish. And I forbade Nabidh to you, unless it was (made) in a water skin, but now drink from all kinds of vessels but do not drink any intoxicant.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20356",
        "11389",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-an-nasai-5653",
      "hadith_no": "5653",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا محمد بن معدان بن عيسى بن معدان الحراني، قال حدثنا الحسن بن أعين، قال حدثنا زهير، قال حدثنا زبيد، عن محارب، عن ابن بريدة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إني كنت نهيتكم عن ثلاث زيارة القبور فزوروها ولتزدكم زيارتها خيرا ونهيتكم عن لحوم الأضاحي بعد ثلاث فكلوا منها ما شئتم ونهيتكم عن الأشربة في الأوعية فاشربوا في أى وعاء شئتم ولا تشربوا مسكرا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn Buraidah that his father said:                     \"The Messenger of Allah [SAW] said: 'I used to forbid three things to you: Visiting graves, but now visit them, and may visiting them increase you in goodness; and I forbade you (to store) the sacrificial meat for more than three days, but now eat whatever you wish of it. And I forbade to you drinks in (certain kinds of ) vessels, but now drink from whatever vessel you wish, but do not drink any intoxicant.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20418",
        "20321",
        "11335",
        "11389",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-an-nasai-5654",
      "hadith_no": "5654",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا أبو بكر بن علي، قال حدثنا إبراهيم بن الحجاج، قال حدثنا حماد بن سلمة، عن حماد بن أبي سليمان، عن عبد الله بن بريدة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ كنت نهيتكم عن الأوعية فانتبذوا فيما بدا لكم وإياكم وكل مسكر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin Buraidah that his father said:                     \"The Messenger of Allah [SAW] said: 'I used to forbid certain kinds of vessels to you. Now soak (fruits) in whatever you wish, but beware of any intoxicant.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20021",
        "10756",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-an-nasai-5655",
      "hadith_no": "5655",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا أبو علي، محمد بن يحيى بن أيوب - مروزي - قال حدثنا عبد الله بن عثمان، قال حدثنا عيسى بن عبيد الكندي، - خراساني - قال سمعت عبد الله بن بريدة، عن أبيه، أن رسول الله صلى الله عليه وسلم بينا هو يسير إذ حل بقوم فسمع لهم لغطا فقال ‏\"‏ ما هذا الصوت ‏\"‏ ‏.‏ قالوا يا نبي الله لهم شراب يشربونه ‏.‏ فبعث إلى القوم فدعاهم فقال ‏\"‏ في أى شىء تنتبذون ‏\"‏ ‏.‏ قالوا ننتبذ في النقير والدباء وليس لنا ظروف ‏.‏ فقال ‏\"‏ لا تشربوا إلا فيما أوكيتم عليه ‏\"‏ ‏.‏ قال فلبث بذلك ما شاء الله أن يلبث ثم رجع عليهم فإذا هم قد أصابهم وباء واصفروا ‏.‏ قال ‏\"‏ ما لي أراكم قد هلكتم ‏\"‏ ‏.‏ قالوا يا نبي الله أرضنا وبيئة وحرمت علينا إلا ما أوكينا عليه ‏.‏ قال ‏\"‏ اشربوا وكل مسكر حرام ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah bin Buraidah (narrated) from his father that:                     While the Messenger of Allah [SAW] was walking, he approached some people and heard a confused noise coming from them. He said: \"What is this noise?\" They said: \"O Messenger of Allah, they have a drink that they drink.\" He sent for those people and said: \"In what do you soak (fruit - to make that drink)?\" They said: \"We soak (fruits) in vessels carved from wood and gourds, and we have no water skins (that can be closed).\" He said: \"Do not drink except from a vessel that can be tied closed.\" Then as much time as Allah willed passed, then he went back to them and they had fallen sick and become pallid. He said: \"Why do you look so ill?\" They said: \"O Messenger of Allah, our land is unhealthy and you forbade to us everything except that which was in a vessel that could be tied closed.\" He said: \"Drink, but every intoxicant is unlawful.\"",
      "usc_msa_ref": "",
      "chain": [
        "28471",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-an-nasai-5678",
      "hadith_no": "5678",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا محمد بن إسماعيل، قال حدثنا يزيد، قال أنبأنا شريك، عن سماك بن حرب، عن ابن بريدة، عن أبيه، أن رسول الله صلى الله عليه وسلم نهى عن الدباء والحنتم والنقير والمزفت ‏.‏ خالفه أبو عوانة ‏.‏",
      "text_en": " It was narrated from Ibn Buraidah, from his father, that:                     The Messenger of Allah [SAW] forbade Ad-Dubba', Al-Hantam, An-Naqir, and Al-Muzaffat.",
      "usc_msa_ref": "",
      "chain": [
        "34188",
        "20472",
        "20587",
        "10770",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-ibn-majah-154",
      "hadith_no": "154",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا إسماعيل بن موسى، وسويد بن سعيد، قالا حدثنا شريك، عن أبي ربيعة الإيادي، عن ابن بريدة، عن أبيه، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن الله أمرني بحب أربعة وأخبرني أنه يحبهم ‏\"‏ ‏.‏ قيل يا رسول الله من هم قال ‏\"‏ علي منهم ‏\"‏ ‏.‏ يقول ذلك ثلاثا ‏\"‏ وأبو ذر وسلمان والمقداد ‏\"‏ ‏.‏",
      "text_en": " Ibn Buraidah narrated that his father said:                     \"The Messenger of Allah said: 'Allah has commanded me to love four people, and He told me that He also loves them.' He was asked: 'O Messenger of Allah, who are they?' He said: ''Ali is one of them,' and he said that three times, 'and Abu Dharr, Salman and Miqdad.'\"",
      "usc_msa_ref": "",
      "chain": [
        "35016",
        "30547",
        "20587",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-ibn-majah-550",
      "hadith_no": "550",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعلي بن محمد، قالا حدثنا وكيع، عن سفيان، عن محارب بن دثار، عن سليمان بن بريدة، عن أبيه، أن النبي  صلى الله عليه وسلم  كان يتوضأ لكل صلاة فلما كان يوم فتح مكة صلى الصلوات كلها بوضوء واحد ‏.‏",
      "text_en": " Sulaiman bin Buraidah narrated from his father that:                     The Prophet used to perform ablution for every prayer, but on the day of the conquest of Makkah, he performed all of the prayers with one ablution.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "38409",
        "20032",
        "20012",
        "11389",
        "10916",
        "3131"
      ]
    },
    {
      "id": "sunan-ibn-majah-592",
      "hadith_no": "592",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، حدثنا دلهم بن صالح الكندي، عن حجير بن عبد الله الكندي، عن ابن بريدة، عن أبيه، أن النجاشي، أهدى للنبي  صلى الله عليه وسلم  خفين أسودين ساذجين فلبسهما ثم توضأ ومسح عليهما ‏.‏",
      "text_en": " It was narrated from Abu Buraidah from his father that:                     An-Najashi gave the Prophet a gift of a pair of plain black leather socks. He put them on, then he (performed ablution and) wiped over them.",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20032",
        "15130",
        "28094",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-ibn-majah-667-2",
      "hadith_no": "667",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Prayer - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن الصباح، وأحمد بن سنان، قالا حدثنا إسحاق بن يوسف الأزرق، أنبأنا سفيان، ح وحدثنا علي بن ميمون الرقي، حدثنا مخلد بن يزيد، عن سفيان، عن علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، قال جاء رجل إلى النبي  صلى الله عليه وسلم  فسأله عن وقت الصلاة فقال ‏\"‏ صل معنا هذين اليومين ‏\"‏ ‏.‏ فلما زالت الشمس أمر بلالا فأذن ثم أمره فأقام الظهر ثم أمره فأقام العصر والشمس مرتفعة بيضاء نقية ثم أمره فأقام المغرب حين غابت الشمس ثم أمره فأقام العشاء حين غاب الشفق ثم أمره فأقام الفجر حين طلع الفجر فلما كان من اليوم الثاني أمره فأذن الظهر فأبرد بها وأنعم أن يبرد بها ثم صلى العصر والشمس مرتفعة أخرها فوق الذي كان وصلى المغرب قبل أن يغيب الشفق وصلى العشاء بعدما ذهب ثلث الليل وصلى الفجر فأسفر بها ثم قال ‏\"‏ أين السائل عن وقت الصلاة ‏\"‏ ‏.‏ فقال الرجل أنا يا رسول الله ‏.‏ قال ‏\"‏ وقت صلاتكم بين ما رأيتم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Sulaiman bin Buraidah that his father said:                     \"A man came to the Prophet and asked him about the times of the prayer. He said: 'Pray with us for two days.' When the sun passed its zenith he commanded Bilal to call the Adhan, then he commanded him to give the Iqamah for Zuhr; then he commanded him to give the Iqamah for 'Asr when the sun was high and clearly white. Then he commanded him to give the Iqamah for Maghrib when the sun had set; then he commanded him to give the Iqamah for 'Isha' when the red afterglow had disappeared; then he commanded him to give the Iqamah for Fajr when dawn came. On the following day he commanded him to give the Adhan for Zuhr when the extreme heat had passed and it had cooled down; then he prayed 'Asr when the sun was still high, but he delayed it more than he had done the day before; then he prayed Maghrib before the red afterglow disappeared; he prayed 'Isha' when one-third of the night had passed; and he prayed Fajr at the time when it was already light. Then he said: 'Where is the one who was asking about the times of Prayer?' The man said: 'Here I am, O Messenger of Allah.' He said: 'The times of your prayer are between the times you have seen.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30269",
        "30297",
        "20411",
        "20012",
        "38412",
        "20462",
        "20005",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "id": "sunan-ibn-majah-765",
      "hadith_no": "765",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book On The Mosques And The Congregations - كتاب المساجد والجماعات",
      "chapter_no": "4",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، عن أبي سنان، سعيد بن سنان عن علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، قال صلى رسول الله  صلى الله عليه وسلم  فقال رجل من دعا إلى الجمل الأحمر فقال النبي  صلى الله عليه وسلم  ‏\"‏ لا وجدته إنما بنيت المساجد لما بنيت له ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Sulaiman bin Burdah that his father said:                     \"The Messenger of Allah performed prayer, then a man said: 'Who was looking for the red camel?' The Prophet said: 'May you not find it! The mosques were built for that for which they were built.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20032",
        "10767",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "id": "sunan-ibn-majah-1132",
      "hadith_no": "1132",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا إسماعيل بن إبراهيم البالسي، حدثنا علي بن الحسن بن شقيق، حدثنا حسين بن واقد، حدثنا عبد الله بن بريدة، عن أبيه، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ العهد الذي بيننا وبينهم الصلاة فمن تركها فقد كفر ‏\"‏ ‏.‏",
      "text_en": " ‘Abdullah bin Buraidah narrated that his father said:                      “TheMessengerof Allah (ﷺ) said: ‘The covenant that distinguishesbetween us andthem is prayer; so whoever leaves it, he has committedKufr.’”",
      "usc_msa_ref": "",
      "chain": [
        "38106",
        "30362",
        "20648",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-ibn-majah-1519",
      "hadith_no": "1519",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا بكر بن خلف أبو بشر، حدثنا يحيى بن سعيد، عن المثنى بن سعيد، عن قتادة، عن ابن بريدة، عن أبيه، أن النبي  صلى الله عليه وسلم  قال ‏\"‏ المؤمن يموت بعرق الجبين ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Buraidah from his father that the Prophet(ﷺ)said:                      “The believer dies with sweat on his brow.”",
      "usc_msa_ref": "",
      "chain": [
        "34043",
        "20031",
        "11019",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-ibn-majah-1533",
      "hadith_no": "1533",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا سعيد بن يحيى بن الأزهر الواسطي، حدثنا أبو معاوية، حدثنا أبو بردة، عن علقمة بن مرثد، عن ابن بريدة، عن أبيه، قال لما أخذوا في غسل النبي  صلى الله عليه وسلم  ناداهم مناد من الداخل لا تنزعوا عن رسول الله  صلى الله عليه وسلم  قميصه ‏.‏",
      "text_en": " It wasnarrated from Abu Buraidah that his father said:                      “When theystartedto wash the Prophet (ﷺ), a voice called out from inside (thehouse)saying: ‘Do not remove the shirt of the Messenger of Allah.’”",
      "usc_msa_ref": "",
      "chain": [
        "30254",
        "20354",
        "1820",
        "11374",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-ibn-majah-1599",
      "hadith_no": "1599",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن حميد، حدثنا مهران بن أبي عمر، عن أبي سنان، عن علقمة بن مرثد، عن ابن بريدة، عن أبيه، أن النبي  صلى الله عليه وسلم  صلى على ميت بعد ما دفن ‏.‏",
      "text_en": " It wasnarrated from Ibn Buraidah from his father that the Prophet(ﷺ)offered the funeral prayer for a deceased person after he hadbeenburied.",
      "usc_msa_ref": "",
      "chain": [
        "38495",
        "28586",
        "11374",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-ibn-majah-1614",
      "hadith_no": "1614",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن عباد بن آدم، حدثنا أبو أحمد، حدثنا سفيان، عن علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، قال كان رسول الله  صلى الله عليه وسلم  يعلمهم إذا خرجوا إلى المقابر كان قائلهم يقول السلام عليكم أهل الديار من المؤمنين والمسلمين وإنا إن شاء الله بكم لاحقون نسأل الله لنا ولكم العافية ‏.‏",
      "text_en": " It wasnarrated from Sulaiman bin Buraidah that his father said:                      “TheMessenger of Allah (ﷺ) used to teach them, when they went out tothegraveyard, to say: As-salamu ‘alaykum ahlad-diyarminal-mu’minina wal-muslimin, wa inna insha’ Allah bikum lahiqun,nas’alul-laha lana walakumul-‘afiyah (Peace be upon you, Oinhabitants of the abodes,believers and Muslims, and we will joinyou soon if Allah wills. Weask Allah for well-being for us and foryou).’”",
      "usc_msa_ref": "",
      "chain": [
        "34211",
        "20355",
        "20012",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "id": "sunan-ibn-majah-1821",
      "hadith_no": "1821",
      "source": "Sunan Ibn Majah",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا محمد بن المصفى، حدثنا بقية، حدثنا محمد بن عبد الرحمن، عن سليمان بن بريدة، عن أبيه، قال قال رسول الله  صلى الله عليه وسلم  لبلال ‏\"‏ الغداء يا بلال ‏\"‏ ‏.‏ فقال إني صائم ‏.‏ قال رسول الله  صلى الله عليه وسلم  ‏\"‏ نأكل أرزاقنا وفضل رزق بلال في الجنة أشعرت يا بلال أن الصائم تسبح عظامه وتستغفر له الملائكة ما أكل عنده ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Sulaiman bin Buraidah that his father said:                      “TheMessenger of Allah (ﷺ) said to Bilal: ‘Come and eat, O Bilal.’Hesaid: ‘I am fasting.’ The Messenger of Allah (ﷺ) said: ‘Weareeating our provision, but most of Bilal’s provision is inParadise. Doyou realise, O Bilal, that the bones of the fastingperson glorifyAllah and the angels pray for forgiveness for him solong as food iseaten in front of him?’”",
      "usc_msa_ref": "",
      "chain": [
        "20644",
        "11105",
        "10916",
        "3131"
      ]
    },
    {
      "id": "sunan-ibn-majah-1828",
      "hadith_no": "1828",
      "source": "Sunan Ibn Majah",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا أبو عاصم، حدثنا ثواب بن عتبة المهري، عن ابن بريدة، عن أبيه، أن رسول الله  صلى الله عليه وسلم  كان لا يخرج يوم الفطر حتى يأكل وكان لا يأكل يوم النحر حتى يرجع ‏.‏",
      "text_en": " It wasnarrated from Ibn Buraidah from his father, that:                      The Messenger ofAllah (ﷺ) would not go out on the Day of Fitr until he had eaten,and he would not eat on the Day of Nahr (the day of sacrifice) untilhe came back.",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "20241",
        "14052",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-ibn-majah-1831",
      "hadith_no": "1831",
      "source": "Sunan Ibn Majah",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا زهير بن محمد، حدثنا عبد الرزاق، عن سفيان، عن عبد الله بن عطاء، عن ابن بريدة، عن أبيه، قال جاءت امرأة إلى النبي  صلى الله عليه وسلم  فقالت يا رسول الله إن أمي ماتت وعليها صوم أفأصوم عنها قال ‏\"‏ نعم ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Ibn Buraidah that his father said:                      “A woman cametothe Prophet (ﷺ) and said: ‘O Messenger of Allah, my mother hasdied and she owed a fast. Should I fast on her behalf?’ He said:‘Yes.’”",
      "usc_msa_ref": "",
      "chain": [
        "20394",
        "20121",
        "20012",
        "10785",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-ibn-majah-1947",
      "hadith_no": "1947",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا هناد بن السري، حدثنا وكيع، عن كهمس بن الحسن، عن ابن بريدة، عن أبيه، قال جاءت فتاة إلى النبي  صلى الله عليه وسلم  فقالت إن أبي زوجني ابن أخيه ليرفع بي خسيسته ‏.‏ قال فجعل الأمر إليها ‏.‏ فقالت قد أجزت ما صنع أبي ولكن أردت أن تعلم النساء أن ليس إلى الآباء من الأمر شىء ‏.‏",
      "text_en": " It was narrated from Ibn Buraidah that:                     his father said: “A girl came to the Prophet and said: 'My father married married me to his brother's son so that he might raise his status thereby.' The Prophet gave her the choice, and she said: 'I approve of what my father did, but I wanted to know that their fathers have no right to do that.' ”",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20032",
        "11303",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-ibn-majah-2178",
      "hadith_no": "2178",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Expiation - كتاب الكفارات",
      "chapter_no": "11",
      "text_ar": "حدثنا عمرو بن رافع البجلي، حدثنا الفضل بن موسى، عن الحسين بن واقد، عن عبد الله بن بريدة، عن أبيه، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من قال إني بريء من الإسلام فإن كان كاذبا فهو كما قال وإن كان صادقا لم يعد إليه الإسلام سالما ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abdullah bin Buraidah that his father told that :                     the Messenger of Allah (ﷺ) said: \"Whoever says: 'I have nothing to do with Islam,' if he is lying then he is as he said, and if he is telling the truth, his Islam will not be sound.\"",
      "usc_msa_ref": "",
      "chain": [
        "18792",
        "20452",
        "20648",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-ibn-majah-2484",
      "hadith_no": "2484",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Charity - كتاب الصدقات",
      "chapter_no": "15",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، عن سفيان، عن عبد الله بن عطاء، عن عبد الله بن بريدة، عن أبيه، قال جاءت امرأة إلى النبي صلى الله عليه وسلم فقالت يا رسول الله إني تصدقت على أمي بجارية وإنها ماتت ‏.‏ فقال ‏\"‏ آجرك الله ورد عليك الميراث ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin Buraidah that his father said:                     “A woman came to-the Prophet (ﷺ) and said: 'O Messenger of Allah (ﷺ), I gave my mother a slave girl of mine, and she has died.' The Messenger of Allah (ﷺ) said: 'Allah (SWT) has rewarded you, and returned to you your inheritance  (without your seeking that.' ”",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20032",
        "20012",
        "10785",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-ibn-majah-2967",
      "hadith_no": "2967",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا محمد بن يوسف الفريابي، حدثنا سفيان، عن علقمة بن مرثد، عن ابن بريدة، عن أبيه، قال كان رسول الله صلى الله عليه وسلم إذا أمر رجلا على سرية أوصاه في خاصة نفسه بتقوى الله ومن معه من المسلمين خيرا فقال ‏\"‏ اغزوا باسم الله وفي سبيل الله قاتلوا من كفر بالله اغزوا ولا تغدروا ولا تغلوا ولا تمثلوا ولا تقتلوا وليدا وإذا أنت لقيت عدوك من المشركين فادعهم إلى إحدى ثلاث خلال أو خصال فأيتهن أجابوك إليها فاقبل منهم وكف عنهم ادعهم إلى الإسلام فإن أجابوك فاقبل منهم وكف عنهم ثم ادعهم إلى التحول من دارهم إلى دار المهاجرين وأخبرهم إن هم فعلوا ذلك أن لهم ما للمهاجرين وأن عليهم ما على المهاجرين وإن أبوا فأخبرهم أنهم يكونون كأعراب المسلمين يجري عليهم حكم الله الذي يجري على المؤمنين ولا يكون لهم في الفىء والغنيمة شىء إلا أن يجاهدوا مع المسلمين فإن هم أبوا أن يدخلوا في الإسلام فسلهم إعطاء الجزية فإن فعلوا فاقبل منهم وكف عنهم فإن هم أبوا فاستعن بالله عليهم وقاتلهم وإن حاصرت حصنا فأرادوك أن تجعل لهم ذمة الله وذمة نبيك فلا تجعل لهم ذمة الله ولا ذمة نبيك ولكن اجعل لهم ذمتك وذمة أبيك وذمة أصحابك فإنكم إن تخفروا ذمتكم وذمة آبائكم أهون عليكم من أن تخفروا ذمة الله وذمة رسوله وإن حاصرت حصنا فأرادوك أن ينزلوا على حكم الله فلا تنزلهم على حكم الله ولكن أنزلهم على حكمك فإنك لا تدري أتصيب فيهم حكم الله أم لا ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Ibn Buraidah that his father said:                      “Whenever heappointed a man to lead a military detachment, the Messenger of Allah(ﷺ) would advise him especially to fear Allah and treat the Muslimswith him well. He (ﷺ) said: ‘Fight in the Name of Allah and inthecause of Allah. Fight those how disbelieve in Allah. Fight but donotbe treacherous, do not steal from the spoils of war, do notmutilateand do not kill children. When you meet your enemy fromamong thepolytheists, call them to one of three things. Whichever ofthem theyrespond to, accept it from them and refrain from fightingthem. Invitethem to accept Islam, and if they respond then accept itfrom them andrefrain from fighting them. Then invite them to leavetheir land andmove to the land of the polytheists. Tell them that ifthey do that,then they will have the same rights and duties as thepolytheists. Ifthey refuse, then tell them that they will be likethe Muslim Bedouins(who live in the desert), subject to the samerulings of Allah as thebelievers. But they will have no share ofFay’* or war spoils, unlessthey fight alongside the Muslims. Ifthey refuse to enter Islam, thenask them to pay the Poll-tax. Ifthey do that, then accept it fromthem and refrain from fightingthem. But if they refuse, then seek thehelp of Allah against themand fight them. If you lay siege to themand they want you to givethem the protection of Allah and yourProphet, do not give them theprotection of Allah and your Prophet,rather give them yourprotection and the protection of your father andyour Companions, forif you violate your protection and the protectionof your fathers,that is easier than violating the protection of Allahand theprotection of His Messenger. If you lay siege to them and theywantyou to let them come out with a promise of the judgement of AllahandHis Messenger (ﷺ), do not offer them a promise of the judgementofAllah and His Messenger (ﷺ), rather offer them your judgement,because you do not know if you will actually pass (the same as)Allah’s judgement regarding them or not.’”",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "20034",
        "20012",
        "11374",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-ibn-majah-3531",
      "hadith_no": "3531",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Drinks - كتاب الأشربة",
      "chapter_no": "30",
      "text_ar": "حدثنا عبد الحميد بن بيان الواسطي، حدثنا إسحاق بن يوسف، عن شريك، عن سماك، عن القاسم بن مخيمرة، عن ابن بريدة، عن أبيه، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ كنت نهيتكم عن الأوعية فانتبذوا فيه واجتنبوا كل مسكر ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Ibn Buraidah from his father that the Prophet(ﷺ)said:                      “I used to forbid you to use certain vessels, but now makeNabidh in them, but avoid all intoxicants.”",
      "usc_msa_ref": "",
      "chain": [
        "20411",
        "20587",
        "10770",
        "10812",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-ibn-majah-3642",
      "hadith_no": "3642",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا إسحاق بن سليمان، عن أبي جعفر الرازي، عن حصين، عن الشعبي، عن بريدة بن الحصيب، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا رقية إلا من عين أو حمة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Buraidah that the Messenger of Allah (ﷺ) said:                     “Thereis no Ruqyah except for the evil eye or from the sting of ascorpion.”",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20310",
        "20746",
        "15097",
        "11052",
        "3131"
      ]
    },
    {
      "id": "sunan-ibn-majah-3731",
      "hadith_no": "3731",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو عامر عبد الله بن عامر بن براد بن يوسف بن أبي بردة بن أبي موسى الأشعري، حدثنا زيد بن الحباب، حدثنا حسين بن واقد، قاضي مرو حدثني عبد الله بن بريدة، أن أباه، حدثه قال رأيت رسول الله  صلى الله عليه وسلم  يخطب فأقبل حسن وحسين عليهما قميصان أحمران يعثران ويقومان فنزل النبي  صلى الله عليه وسلم  فأخذهما فوضعهما في حجره فقال ‏\"‏ صدق الله ورسوله ‏{إنما أموالكم وأولادكم فتنة}‏ رأيت هذين فلم أصبر ‏\"‏ ‏.‏ ثم أخذ في خطبته ‏.‏",
      "text_en": " ‘Abdullah bin Buraidah narrated that his father told him:                      I saw theMessenger of Allah (ﷺ) delivering a sermon, and Hasan and Husaincame forward, wearing red shirts, stumbling and getting up again. TheProphet (ﷺ) stepped down, picked them up and put them in his lap.Then he said: “Allah and His Messenger have spoken the truth. ‘Yourwealth and your children are only a trial.’ [64:15] I saw these twoand I could not be patient. Then he resumed his sermon.”",
      "usc_msa_ref": "",
      "chain": [
        "20650",
        "20648",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-ibn-majah-3751",
      "hadith_no": "3751",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو بكر، حدثنا وكيع، حدثنا دلهم بن صالح الكندي، عن حجير بن عبد الله الكندي، عن ابن بريدة، عن أبيه، أن النجاشي، أهدى لرسول الله  صلى الله عليه وسلم  خفين ساذجين أسودين فلبسهما ‏.‏",
      "text_en": " It wasnarrated from Ibn Buraidah, from his father, that an-Najashisent apair of pure black Khuff as a gift to the Prophet (ﷺ) of,which hewore.",
      "usc_msa_ref": "",
      "chain": [
        "20436",
        "20032",
        "15130",
        "28094",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-ibn-majah-3722-2",
      "hadith_no": "3722",
      "source": "Sunan Ibn Majah",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا زيد بن الحباب، عن أبي المنيب، عن ابن بريدة، عن أبيه، أن النبي  صلى الله عليه وسلم  نهى أن يقعد بين الظل والشمس ‏.‏",
      "text_en": " It was narrated from Ibn Buraidah, from his father, that the Prophet(ﷺ) :                     \"forbade sitting between the shade and sun.\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20650",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-ibn-majah-3763-2",
      "hadith_no": "3763",
      "source": "Sunan Ibn Majah",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر، حدثنا عبد الله بن نمير، وأبو أسامة عن سفيان، عن علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ من لعب بالنردشير فكأنما غمس يده في لحم خنزير ودمه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Sulaiman bin Buraidah from his father that the Prophet(ﷺ) said:                     \"Whoever plays backgammon, it is as if he dipped his hand in the flesh and blood of a pig.\"",
      "usc_msa_ref": "",
      "chain": [
        "20436",
        "20331",
        "20318",
        "20012",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "id": "sunan-ibn-majah-3781-2",
      "hadith_no": "3781",
      "source": "Sunan Ibn Majah",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، عن بشير بن مهاجر، عن ابن بريدة، عن أبيه، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ يجيء القرآن يوم القيامة كالرجل الشاحب فيقول أنا الذي أسهرت ليلك وأظمأت نهارك ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn Buraidah that his father told that the Messenger of Allah(ﷺ) said:                     \"The Quran will come on the Day of Resurrection, like a pale man, and will say: 'I am the one that kept you awake at night and made you thirsty during the day.\"",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20032",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-ibn-majah-3872",
      "hadith_no": "3872",
      "source": "Sunan Ibn Majah",
      "chapter": "Supplication - كتاب الدعاء",
      "chapter_no": "34",
      "text_ar": "حدثنا علي بن محمد، حدثنا إبراهيم بن عيينة، حدثنا الوليد بن ثعلبة، عن عبد الله ابن بريدة، عن أبيه، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ اللهم أنت ربي لا إله إلا أنت خلقتني وأنا عبدك وأنا على عهدك ووعدك ما استطعت أعوذ بك من شر ما صنعت أبوء بنعمتك وأبوء بذنبي فاغفر لي فإنه لا يغفر الذنوب إلا أنت ‏\"‏ ‏.‏ قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من قالها في يومه وليلته فمات في ذلك اليوم أو تلك الليلة دخل الجنة إن شاء الله تعالى ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin Buraidah that :                     his father said: \"The Messenger of Allah (saas) said: Allahumma Anta Rabbi la ilaha illa Anta, khalaqtani wa ana 'abduka wa ana 'ala 'ahdika wa wa'dika mastata'tu. A'udhu bika min sharri ma sana'tu, abu'u bi ni'matika wa abu'u bi dhanbi faghfirli, fa innahu la yaghfirudh-dhunuba illa Anta (O Allah, You are my Lord, there is none worthy of worship except You. You have created me and I am Your slave, and I am adhering to Your covenant and Your promise as much as I can. I seek refuge with You from the evil of what I do.  I acknowledge Your blessing and I acknowledge my sin, so forgive me, for there is none who can forgive sin except You).\"He said: \"The Messenger of Allah (saas) said: 'Whoever says this by day and by night, if he dies that day or that night, he will enter Paradise if Allah wills.\"",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20018",
        "14411",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-ibn-majah-4205",
      "hadith_no": "4205",
      "source": "Sunan Ibn Majah",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا أبو غسان، محمد بن عمرو زنيج حدثنا أبو تميلة، حدثنا خالد بن عبيد، حدثنا عبد الله بن بريدة، عن أبيه، قال ذهب بي رسول الله  صلى الله عليه وسلم  إلى موضع بالبادية قريب من مكة فإذا أرض يابسة حولها رمل فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ تخرج الدابة من هذا الموضع ‏\"‏ ‏.‏ فإذا فتر في شبر ‏.‏ قال ابن بريدة فحججت بعد ذلك بسنين فأرانا عصا له فإذا هو بعصاى هذه كذا وكذا ‏.‏",
      "text_en": " ‘Abdullah bin Buraidah narrated that his father said:                      “TheMessengerof Allah (ﷺ) took me to a place in the desert, nearMakkah, wherethere was arid land surrounded by sand. The Messengerof Allah (ﷺ)said: ‘The Beast will emerge from this spot – spanby a span. (i.e,the size of that spot).’”",
      "usc_msa_ref": "",
      "chain": [
        "20183",
        "14100",
        "11432",
        "3131"
      ]
    }
  ],
  "total_hadiths": 136
}