{
  "id": "3141",
  "name": "'Umayr Mawla Abi Laham al-Ghafari ( عمير مولى آبي اللحم ( رضي الله عنه",
  "full_name": "'Umayr Mawla Abi Laham al-Ghafari ( عمير مولى آبي اللحم ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Hijaz"
    },
    "death": {
      "date_hijri": "70",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Hijaz"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ م  4  -  صحابي ]"
    ],
    "tags": [
      "al-Ghaffari",
      "Khaybar",
      "Hunain"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "students": [
    {
      "id": "11213",
      "name": "Muhammad bin Ibrahim bin al-Harith محمد بن إبراهيم بن الحارث",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10614",
      "name": "Muhammad bin Zayd bin al-Mhajr محمد بن زيد بن المهاجر بن قنفذ",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11234",
      "name": "Yazid bin 'Abdullah bin Usama B. al-Haad يزيد بن عبد الله بن أسامة بن الهاد",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11450",
      "name": "Yazid bin Abi 'Ubaid يزيد بن أبي عبيد",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "2415",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وابن، نمير وزهير بن حرب جميعا عن حفص، بن غياث - قال ابن نمير حدثنا حفص، - عن محمد بن زيد، عن عمير، مولى آبي اللحم قال كنت مملوكا فسألت رسول الله صلى الله عليه وسلم أأتصدق من مال موالي بشىء قال ‏\"‏ نعم والأجر بينكما نصفان ‏\"‏ ‏.‏",
      "text_en": " Umair, the freed slave of Abi'l-Lahm reported:                      1 was the slave (of Abi'l-Lahm). I asked the Messenger of Allah (may peace be upon him) if I could give some charity out of my master's wealth. He said: Yes, and the reward is half and half between you two.",
      "chain": [
        "30201",
        "20317",
        "30212",
        "11217",
        "3141"
      ]
    },
    {
      "hadith_no": "1168",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book Of The Prayer For Rain (Kitab al-Istisqa') - كتاب الاستسقاء",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن سلمة المرادي، أخبرنا ابن وهب، عن حيوة، وعمر بن مالك، عن ابن الهاد، عن محمد بن إبراهيم، عن عمير، مولى بني آبي اللحم أنه رأى النبي صلى الله عليه وسلم يستسقي عند أحجار الزيت قريبا من الزوراء قائما يدعو يستسقي رافعا يديه قبل وجهه لا يجاوز بهما رأسه ‏.‏",
      "text_en": " Narrated Umayr, the client of AbulLahm:                     Umayr saw the Prophet (ﷺ) praying for rain at Ahjar az-Zayt near az-Zawra', standing, making supplication, praying for rain and raising his hands in front of his face, but not lifting them above his head.",
      "chain": [
        "30491",
        "20029",
        "26010",
        "20626",
        "11234",
        "11213",
        "3141"
      ]
    },
    {
      "hadith_no": "2730",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا بشر، - يعني ابن المفضل - عن محمد بن زيد، قال حدثني عمير، مولى آبي اللحم قال شهدت خيبر مع سادتي فكلموا في رسول الله صلى الله عليه وسلم فأمر بي فقلدت سيفا فإذا أنا أجره فأخبر أني مملوك فأمر لي بشىء من خرثي المتاع ‏.‏ قال أبو داود معناه أنه لم يسهم له ‏.‏ قال أبو داود وقال أبو عبيد كان حرم اللحم على نفسه فسمي آبي اللحم ‏.‏",
      "text_en": " Narrated Umayr, client of AbulLahm:                     I was present at Khaybar along with my masters who spoke about me to the Messenger of Allah (ﷺ). He ordered about me, and a sword was girded on me and I was trailing it. He was then informed that I was a slave. He, therefore, ordered that I should be given some inferior goods.Abu Dawud said: This means that he (the Prophet) did not allot a portion of the spoils.Abu Dawud said: Abu 'Ubaid said: As he (the narrator Abi al-Lahm) made eating meat unlawful on himself, he was called Abi al-Lahm (one who hates meat).",
      "chain": [
        "30007",
        "20212",
        "11217",
        "3141"
      ]
    },
    {
      "hadith_no": "557",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Traveling - أَبْوَابُ السَّفَرِ",
      "chapter_no": "6",
      "text_ar": "حدثنا قتيبة، حدثنا الليث بن سعد، عن خالد بن يزيد، عن سعيد بن أبي هلال، عن يزيد بن عبد الله، عن عمير، مولى آبي اللحم عن آبي اللحم، أنه رأى رسول الله صلى الله عليه وسلم عند أحجار الزيت يستسقي وهو مقنع بكفيه يدعو ‏.‏ قال أبو عيسى كذا قال قتيبة في هذا الحديث عن آبي اللحم ولا نعرف له عن النبي صلى الله عليه وسلم إلا هذا الحديث الواحد وعمير مولى آبي اللحم قد روى عن النبي صلى الله عليه وسلم أحاديث وله صحبة ‏.‏",
      "text_en": " Umair, the freed slave of Abi Al-Lahm narrated from Abi Al-Lahm that :                     he saw the Messenger of Allah at Ahjar Az-Zait, supplicating for rain, and he was raising his hands in supplication.",
      "chain": [
        "30367",
        "20023",
        "11408",
        "11169",
        "11318",
        "3141"
      ]
    },
    {
      "hadith_no": "1557",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Military Expeditions - كتاب السير عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "21",
      "text_ar": "حدثنا قتيبة، حدثنا بشر بن المفضل، عن محمد بن زيد، عن عمير، مولى آبي اللحم قال شهدت خيبر مع سادتي فكلموا في رسول الله صلى الله عليه وسلم وأعلموه أني مملوك ‏.‏ قال فأمر بي فقلدت السيف فإذا أنا أجره فأمر لي بشيء من خرثي المتاع وعرضت عليه رقية كنت أرقي بها المجانين فأمرني بطرح بعضها وحبس بعضها ‏.‏ وفي الباب عن ابن عباس ‏.‏ وهذا حديث حسن صحيح ‏.‏ والعمل على هذا عند بعض أهل العلم أن لا يسهم للمملوك ولكن يرضخ له بشيء ‏.‏ وهو قول الثوري والشافعي وأحمد وإسحاق ‏.‏",
      "text_en": " Narrated 'Umair, the freed slave of Abil-Lahm:                     \"I participated at Khaibar with my masters. They spoke about me to the Messenger of Allah (ﷺ) and told him that I was a slave.\" He said: \"So he ordered me to take up the sword, and I found myself dragging it, so he ordered that I be given something from the goods. I presented a Ruqyah that I used to treat the possessed with, so he ordered me leave some of it and keep some of it.\"There is something on this topic from Ibn 'Abbas.This Hadith is Hasan Sahih. This is acted upon according to the some of the people of knowledge. A complete portion is not given to slave, but something is conferred upon him. This is the view of Ath-Thawri, Ash-Shafi'i, Ahmad, and Ishaq.",
      "chain": [
        "30367",
        "20212",
        "11217",
        "3141"
      ]
    },
    {
      "hadith_no": "1514",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Praying for Rain (Al-Istisqa') - كتاب الاستسقاء",
      "chapter_no": "17",
      "text_ar": "أخبرنا قتيبة، قال حدثنا الليث، عن خالد بن يزيد، عن سعيد بن أبي هلال، عن يزيد بن عبد الله، عن عمير، مولى آبي اللحم عن آبي اللحم، أنه رأى رسول الله صلى الله عليه وسلم عند أحجار الزيت يستسقي وهو مقنع بكفيه يدعو ‏.‏",
      "text_en": " It was narrated from Abi Al-Lahm that:                     He saw the Messenger of Allah at Ahjar Az-Zait praying for rain and raising his hands, making supplications.",
      "chain": [
        "30367",
        "20023",
        "11408",
        "11169",
        "11318",
        "3141"
      ]
    },
    {
      "hadith_no": "2385",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا حفص بن غياث، عن محمد بن زيد، عن عمير، - مولى آبي اللحم - قال كان مولاى يعطيني الشىء فأطعم منه فمنعني - أو قال فضربني - فسألت النبي  صلى الله عليه وسلم  أو سأله فقلت لا أنتهي أو لا أدعه ‏.‏ فقال ‏\"‏ الأجر بينكما ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Umair, the freed slave of Aabi Lahm, said:                     \"My master used to give me food and I would feed others from it, then he stopped me,\" or he said: \"He beat me. So I asked the Prophet,” -or- \"he asked him and I said: 'I will not stop.' He said: 'Both of you will be rewarded.\"'",
      "chain": [
        "30201",
        "20317",
        "11217",
        "3141"
      ]
    }
  ],
  "total_hadiths": 7
}