{
  "id": "3159",
  "name": "Nadba client of Maymuna ( ندبة مولاة ميمونة ( رضي الله عنها",
  "full_name": "Nadba client of Maymuna ( ندبة مولاة ميمونة ( رضي الله عنها",
  "grade": "Comp.(RA) [1st Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Hijaz"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Medina",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ د  س  -  صحبة ]"
    ],
    "tags": [
      "Female",
      "Client"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "61",
      "name": "Maymuna bint al-Harith ( ميمونة بنت الحارث بن حزن الهلالية ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "267",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا يزيد بن خالد بن عبد الله بن موهب الرملي، حدثنا الليث بن سعد، عن ابن شهاب، عن حبيب، مولى عروة عن ندبة، مولاة ميمونة عن ميمونة، أن رسول الله صلى الله عليه وسلم كان يباشر المرأة من نسائه وهي حائض إذا كان عليها إزار إلى أنصاف الفخذين أو الركبتين تحتجز به ‏.‏",
      "text_en": " Maimunah said:                      The Prophet (ﷺ) would contact and embrace any of his wives while she was menstruating. She would wear the wrapper up to half the the thighs or cover her knees with it.",
      "chain": [
        "38715",
        "20023",
        "11013",
        "29264",
        "3159",
        "61"
      ]
    },
    {
      "hadith_no": "289",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا الحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن وهب، عن يونس، والليث، عن ابن شهاب، عن حبيب، مولى عروة عن بدية، - وكان الليث يقول ندبة - مولاة ميمونة عن ميمونة قالت كان رسول الله صلى الله عليه وسلم يباشر المرأة من نسائه وهي حائض إذا كان عليها إزار يبلغ أنصاف الفخذين والركبتين ‏.‏ في حديث الليث محتجزة به ‏.‏",
      "text_en": " It was narrated that Maimunah said:                      \"The Messenger of Allah (ﷺ) would fondle one of his wives while she was menstruating, if she wore an Izar (waist wrap) that reached halfway down to the middle of her thighs or to her knees.\" In the narration of Al-Laith: \"Being covered with it.\"",
      "chain": [
        "36017",
        "20029",
        "20475",
        "20023",
        "11013",
        "29264",
        "20023",
        "3159",
        "61"
      ]
    },
    {
      "hadith_no": "376",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Menstruation and Istihadah - كتاب الحيض والاستحاضة",
      "chapter_no": "3",
      "text_ar": "أخبرنا الحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن وهب، عن يونس، والليث، عن ابن شهاب، عن حبيب، مولى عروة عن بدية، - وكان الليث يقول ندبة - مولاة ميمونة عن ميمونة قالت كان رسول الله صلى الله عليه وسلم يباشر المرأة من نسائه وهي حائض إذا كان عليها إزار يبلغ أنصاف الفخذين والركبتين في حديث الليث تحتجز به ‏.‏",
      "text_en": " It was narrated that Maimunah said:                      \"The Messenger of Allah (ﷺ) would fondle one of his wives when she was menstruating, if she wore and Izar (waist wrap) that reached halfway down her thighs or to her knees.",
      "chain": [
        "36017",
        "20029",
        "20475",
        "20023",
        "11013",
        "29264",
        "20023",
        "3159",
        "61"
      ]
    }
  ],
  "total_hadiths": 3
}