{
  "id": "3195",
  "name": "'Abdur Rahman bin 'Abd al-Qari ( عبد الرحمن بن عبد القاري ( رضي الله عنه",
  "full_name": "'Abdur Rahman bin 'Abd al-Qari ( عبد الرحمن بن عبد القاري ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Hijaz"
    },
    "death": {
      "date_hijri": "80",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Medina",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah",
      "Medina"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ ع  -  صحبة ]"
    ],
    "tags": [
      "Ally B.Zuhrah",
      "B.Khuzayma",
      "al-Qara",
      "Child",
      "Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [
    {
      "id": "3196",
      "name": "'Abdullah bin 'Abd al-Qari ( عبد الله بن عبد القاري ( رضي الله عنه",
      "grade": "Comp.(RA) [2nd Generation]"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "3",
      "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "33",
      "name": "Abu Ayyub al-Ansari ( أبو أيوب الأنصاري خالد بن زيد ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "229",
      "name": "Abu Talha Ansari ( أبو طلحة الأنصاري زيد بن سهل بن الأسود ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "10511",
      "name": "'Urwa ibn al-Zubayr عروة بن الزبير",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-2010",
      "hadith_no": "2010",
      "source": "Sahih Bukhari",
      "chapter": "Praying at Night in Ramadaan (Taraweeh) - كتاب صلاة التراويح",
      "chapter_no": "31",
      "text_ar": "وعن ابن شهاب، عن عروة بن الزبير، عن عبد الرحمن بن عبد القاري، أنه قال خرجت مع عمر بن الخطاب  رضى الله عنه  ليلة في رمضان، إلى المسجد، فإذا الناس أوزاع متفرقون يصلي الرجل لنفسه، ويصلي الرجل فيصلي بصلاته الرهط فقال عمر إني أرى لو جمعت هؤلاء على قارئ واحد لكان أمثل‏.‏ ثم عزم فجمعهم على أبى بن كعب، ثم خرجت معه ليلة أخرى، والناس يصلون بصلاة قارئهم، قال عمر نعم البدعة هذه، والتي ينامون عنها أفضل من التي يقومون‏.‏ يريد آخر الليل، وكان الناس يقومون أوله‏.‏",
      "text_en": " 'Abdur Rahman bin 'Abdul Qari said,\"I went out in the company of 'Umar bin Al-Khattab one night in Ramadan to the mosque and found the people praying in different groups. A man praying alone or a man praying with a little group behind him. So, 'Umar said, 'In my opinion I would better collect these (people) under the leadership of one Qari (Reciter) (i.e. let them pray in congregation!)'. So, he made up his mind to congregate them behind Ubai bin Ka'b. Then on another night I went again in his company and the people were praying behind their reciter. On that, 'Umar remarked, 'What an excellent Bid'a (i.e. innovation in religion) this is; but the prayer which they do not perform, but sleep at its time is better than the one they are offering.' He meant the prayer in the last part of the night. (In those days) people used to pray in the early part of the night.\"",
      "usc_msa_ref": "",
      "chain": [
        "11013",
        "10511",
        "3195"
      ]
    },
    {
      "id": "sahih-bukhari-2419",
      "hadith_no": "2419",
      "source": "Sahih Bukhari",
      "chapter": "Khusoomaat - كتاب الخصومات",
      "chapter_no": "44",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن ابن شهاب، عن عروة بن الزبير، عن عبد الرحمن بن عبد القاري، أنه قال سمعت عمر بن الخطاب  رضى الله عنه  يقول سمعت هشام بن حكيم بن حزام، يقرأ سورة الفرقان على غير ما أقرؤها، وكان رسول الله صلى الله عليه وسلم أقرأنيها، وكدت أن أعجل عليه، ثم أمهلته حتى انصرف، ثم لببته بردائه فجئت به رسول الله صلى الله عليه وسلم فقلت إني سمعت هذا يقرأ على غير ما أقرأتنيها، فقال لي ‏\"‏ أرسله ‏\"‏‏.‏ ثم قال له ‏\"‏ اقرأ ‏\"‏‏.‏ فقرأ‏.‏ قال ‏\"‏ هكذا أنزلت ‏\"‏‏.‏ ثم قال لي ‏\"‏ اقرأ ‏\"‏‏.‏ فقرأت فقال ‏\"‏ هكذا أنزلت‏.‏ إن القرآن أنزل على سبعة أحرف فاقرءوا منه ما تيسر ‏\"‏‏.‏",
      "text_en": " Narrated `Umar bin Al-Khattab:                     I heard Hisham bin Hakim bin Hizam reciting Surat-al-Furqan in a way different to that of mine. Allah's Apostle had taught it to me (in a different way). So, I was about to quarrel with him (during the prayer) but I waited till he finished, then I tied his garment round his neck and seized him by it and brought him to Allah's Apostle and said, \"I have heard him reciting Surat-al-Furqan in a way different to the way you taught it to me.\" The Prophet ordered me to release him and asked Hisham to recite it. When he recited it, Allah s Apostle said, \"It was revealed in this way.\" He then asked me to recite it. When I recited it, he said, \"It was revealed in this way. The Qur'an has been revealed in seven different ways, so recite it in the way that is easier for you.\"",
      "usc_msa_ref": "601",
      "chain": [
        "30355",
        "20001",
        "11013",
        "10511",
        "3195",
        "3"
      ]
    },
    {
      "id": "sahih-bukhari-5043",
      "hadith_no": "5043",
      "source": "Sahih Bukhari",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا سعيد بن عفير، قال حدثني الليث، قال حدثني عقيل، عن ابن شهاب، قال حدثني عروة بن الزبير، أن المسور بن مخرمة، وعبد الرحمن بن عبد القاري، حدثاه أنهما، سمعا عمر بن الخطاب، يقول سمعت هشام بن حكيم، يقرأ سورة الفرقان في حياة رسول الله صلى الله عليه وسلم فاستمعت لقراءته فإذا هو يقرأ على حروف كثيرة لم يقرئنيها رسول الله صلى الله عليه وسلم فكدت أساوره في الصلاة فتصبرت حتى سلم فلببته بردائه فقلت من أقرأك هذه السورة التي سمعتك تقرأ‏.‏ قال أقرأنيها رسول الله صلى الله عليه وسلم‏.‏ فقلت كذبت فإن رسول الله صلى الله عليه وسلم قد أقرأنيها على غير ما قرأت، فانطلقت به أقوده إلى رسول الله صلى الله عليه وسلم فقلت إني سمعت هذا يقرأ بسورة الفرقان على حروف لم تقرئنيها‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أرسله اقرأ يا هشام ‏\"‏‏.‏ فقرأ عليه القراءة التي سمعته يقرأ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ كذلك أنزلت ‏\"‏‏.‏ ثم قال ‏\"‏ اقرأ يا عمر ‏\"‏‏.‏ فقرأت القراءة التي أقرأني، فقال رسول الله صلى الله عليه وسلم ‏\"‏ كذلك أنزلت، إن هذا القرآن أنزل على سبعة أحرف فاقرءوا ما تيسر منه ‏\"‏‏.‏",
      "text_en": " Narrated `Umar bin Al-Khattab:                     I heard Hisham bin Hakim reciting Surat Al-Furqan during the lifetime of Allah's Apostle and I listened to his recitation and noticed that he recited in several different ways which Allah's Apostle had not taught me. I was about to jump over him during his prayer, but I controlled my temper, and when he had completed his prayer, I put his upper garment around his neck and seized him by it and said, \"Who taught you this Sura which I heard you reciting?\" He replied, \"Allah's Apostle taught it to me.\" I said, \"You have told a lie, for Allah's Apostle has taught it to me in a different way from yours.\" So I dragged him to Allah's Apostle and said (to Allah's Apostle), \"I heard this person reciting Surat Al-Furqan in a way which you haven't taught me!\" On that Allah's Apostle said, \"Release him, (O `Umar!) Recite, O Hisham!\" Then he recited in the same way as I heard him reciting. Then Allah's Apostle said, \"It was revealed in this way,\" and added, \"Recite, O `Umar!\" I recited it as he had taught me. Allah's Apostle then said, \"It was revealed in this way. This Qur'an has been revealed to be recited in seven different ways, so recite of it whichever (way) is easier for you (or read as much of it as may be easy for you).",
      "usc_msa_ref": "514",
      "chain": [
        "30233",
        "20023",
        "11207",
        "11013",
        "10511",
        "2201",
        "3195",
        "3"
      ]
    },
    {
      "id": "sahih-bukhari-7645",
      "hadith_no": "7645",
      "source": "Sahih Bukhari",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا يحيى بن بكير، حدثنا الليث، عن عقيل، عن ابن شهاب، حدثني عروة، أن المسور بن مخرمة، وعبد الرحمن بن عبد القاري، حدثاه أنهما، سمعا عمر بن الخطاب، يقول سمعت هشام بن حكيم، يقرأ سورة الفرقان في حياة رسول الله صلى الله عليه وسلم فاستمعت لقراءته، فإذا هو يقرأ على حروف كثيرة لم يقرئنيها رسول الله صلى الله عليه وسلم، فكدت أساوره في الصلاة، فتصبرت حتى سلم، فلببته بردائه فقلت من أقرأك هذه السورة التي سمعتك تقرأ قال أقرأنيها رسول الله صلى الله عليه وسلم فقلت كذبت، أقرأنيها على غير ما قرأت‏.‏ فانطلقت به أقوده إلى رسول الله صلى الله عليه وسلم فقلت إني سمعت هذا يقرأ سورة الفرقان على حروف لم تقرئنيها‏.‏ فقال ‏\"‏ أرسله، اقرأ يا هشام ‏\"‏‏.‏ فقرأ القراءة التي سمعته‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ كذلك أنزلت ‏\"‏‏.‏ ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ اقرأ يا عمر ‏\"‏‏.‏ فقرأت التي أقرأني فقال ‏\"‏ كذلك أنزلت، إن هذا القرآن أنزل على سبعة أحرف فاقرءوا ما تيسر منه ‏\"‏‏.‏",
      "text_en": " Narrated `Umar bin Al-Khattab:                     I heard Hisham bin Hakim reciting Surat-al-Furqan during the lifetime of Allah's Apostle, I listened to his recitation and noticed that he was reciting in a way that Allah's Apostle had not taught me. I was about to jump over him while He was still in prayer, but I waited patiently and when he finished his prayer, I put my sheet round his neck (and pulled him) and said, \"Who has taught you this Sura which I have heard you reciting?\" Hisham said, \"Allah's Apostle taught it to me.\" I said, \"You are telling a lie, for he taught it to me in a way different from the way you have recited it!\" Then I started leading (dragged) him to Allah's Apostle and said (to the Prophet), \" I have heard this man reciting Surat-al- Furqan in a way that you have not taught me.\" The Prophet said: \"(O `Umar) release him! Recite, O Hisham.\" Hisham recited in the way I heard him reciting. Allah's Apostle said, \"It was revealed like this.\" Then Allah's Apostle said, \"Recite, O `Umar!\" I recited in the way he had taught me, whereupon he said, \"It was revealed like this,\" and added, \"The Qur'an has been revealed to be recited in seven different ways, so recite of it whichever is easy for you .\" (See Hadith No. 514, Vol. 6)",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20023",
        "11207",
        "11013",
        "10511",
        "2201",
        "3195",
        "3"
      ]
    },
    {
      "id": "sahih-muslim-1779",
      "hadith_no": "1779",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا هارون بن معروف، حدثنا عبد الله بن وهب، ح وحدثني أبو الطاهر، وحرملة، قالا أخبرنا ابن وهب، عن يونس بن يزيد، عن ابن شهاب، عن السائب بن يزيد، وعبيد الله بن عبد الله، أخبراه عن عبد الرحمن بن عبد القاري، قال سمعت عمر بن الخطاب، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ من نام عن حزبه أو عن شىء منه فقرأه فيما بين صلاة الفجر وصلاة الظهر كتب له كأنما قرأه من الليل ‏\"‏ ‏.‏",
      "text_en": " Zaid b. Arqam, on seeing some people praying in the forenoon, said:                      They well know that prayer at another time than this is more excellent, for Allah's Messenger (may peace be upon him) said: The prayer of those who are penitent is observed when your weaned camels feel the heat of the sun.",
      "usc_msa_ref": "",
      "chain": [
        "30280",
        "20029",
        "30487",
        "20029",
        "20475",
        "11013",
        "3048",
        "3195",
        "3"
      ]
    },
    {
      "id": "sahih-muslim-1936",
      "hadith_no": "1936",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن ابن شهاب، عن عروة بن الزبير، عن عبد الرحمن بن عبد القاري، قال سمعت عمر بن الخطاب، يقول سمعت هشام بن، حكيم بن حزام يقرأ سورة الفرقان على غير ما أقرؤها وكان رسول الله صلى الله عليه وسلم أقرأنيها فكدت أن أعجل عليه ثم أمهلته حتى انصرف ثم لببته بردائه فجئت به رسول الله صلى الله عليه وسلم فقلت يا رسول الله إني سمعت هذا يقرأ سورة الفرقان على غير ما أقرأتنيها ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أرسله اقرأ ‏\"‏ ‏.‏ فقرأ القراءة التي سمعته يقرأ فقال رسول الله صلى الله عليه وسلم ‏\"‏ هكذا أنزلت ‏\"‏ ‏.‏ ثم قال لي ‏\"‏ اقرأ ‏\"‏ ‏.‏ فقرأت فقال ‏\"‏ هكذا أنزلت إن هذا القرآن أنزل على سبعة أحرف فاقرءوا ما تيسر منه ‏\"‏ ‏.‏",
      "text_en": " This hadith has been transmitted thus by 'Umar b. Khattab (with a slight change of words):                     \" I heard Hisham b. Hakim reciting Surah al-Furqan during the lifetime of Allah's Messenger (may peace be upon him).\" The rest is the same but with this addition:\" I was about to catch hold of him in prayer, but I exercised patience till he pronounced salutation.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "11013",
        "10511",
        "3195",
        "3"
      ]
    },
    {
      "id": "sunan-abi-daud-1475",
      "hadith_no": "1475",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا القعنبي، عن مالك، عن ابن شهاب، عن عروة بن الزبير، عن عبد الرحمن بن عبد القاري، قال سمعت عمر بن الخطاب، يقول سمعت هشام بن حكيم بن حزام، يقرأ سورة الفرقان على غير ما أقرؤها وكان رسول الله صلى الله عليه وسلم أقرأنيها فكدت أن أعجل عليه ثم أمهلته حتى انصرف ثم لببته بردائه فجئت به رسول الله صلى الله عليه وسلم فقلت يا رسول الله إني سمعت هذا يقرأ سورة الفرقان على غير ما أقرأتنيها ‏.‏ فقال له رسول الله صلى الله عليه وسلم ‏\"‏ اقرأ ‏\"‏ ‏.‏ فقرأ القراءة التي سمعته يقرأ فقال رسول الله صلى الله عليه وسلم ‏\"‏ هكذا أنزلت ‏\"‏ ‏.‏ ثم قال لي ‏\"‏ اقرأ ‏\"‏ ‏.‏ فقرأت فقال ‏\"‏ هكذا أنزلت ‏\"‏ ‏.‏ ثم قال ‏\"‏ إن هذا القرآن أنزل على سبعة أحرف فاقرءوا ما تيسر منه ‏\"‏ ‏.‏",
      "text_en": " 'Umar b. al-Khattab said:                      I heard Hisham b. Hakim (b. Hizam) reciting Surah al-Furqan in a different manner from my way of reciting, and the Messenger of Allah (ﷺ) had taught me to recite it. I nearly spoke sharply to him, but I delayed till he had finished. Then I caught his cloak at the neck, and I brought him to the Messenger of Allah (ﷺ). I said: Messenger of Allah, I heard this man reciting Surah al-Furqan in a manner different from that in which you taught me to recite it. The Messenger of Allah (ﷺ) the told him to recite it. He then recited in the manner I heard him recite. The Messenger of Allah (ﷺ) said: Thus was it sent down. He then said to me: Recite, I recited (it). He then said: Thus was it sent down. He said: The Qur'an was sent down in seven modes of reading, so recite according to what comes most easily.",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "20001",
        "11013",
        "10511",
        "3195",
        "3"
      ]
    },
    {
      "id": "jami-al-tirmidhi-581",
      "hadith_no": "581",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Traveling - أَبْوَابُ السَّفَرِ",
      "chapter_no": "6",
      "text_ar": "حدثنا قتيبة، حدثنا أبو صفوان، عن يونس بن يزيد، عن ابن شهاب الزهري، أن السائب بن يزيد، وعبيد الله بن عبد الله بن عتبة بن مسعود، أخبراه عن عبد الرحمن بن عبد القاري، قال سمعت عمر بن الخطاب، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ من نام عن حزبه أو عن شيء منه فقرأه ما بين صلاة الفجر وصلاة الظهر كتب له كأنما قرأه من الليل ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ قال وأبو صفوان اسمه عبد الله بن سعيد المكي وروى عنه الحميدي وكبار الناس ‏.‏",
      "text_en": " Umar bin Al-Khattab narrated that :                     the Messenger of Allah said: \"Whoever slept, (missing) his section or some of it, then he recited it between the Fajr prayer and the Zuhr prayer, it is written for him as if he had recited it in the night.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20525",
        "20475",
        "3048",
        "3195",
        "3"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3472",
      "hadith_no": "3472",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا يحيى بن موسى، وعبد بن حميد، وغير، واحد المعنى، واحد، قالوا حدثنا عبد الرزاق، عن يونس بن سليم، عن الزهري، عن عروة بن الزبير، عن عبد الرحمن بن عبد القاري، قال سمعت عمر بن الخطاب، رضى الله عنه يقول كان النبي صلى الله عليه وسلم إذا نزل عليه الوحى سمع عند وجهه كدوي النحل فأنزل عليه يوما فمكثنا ساعة فسري عنه فاستقبل القبلة ورفع يديه وقال ‏\"‏ اللهم زدنا ولا تنقصنا وأكرمنا ولا تهنا وأعطنا ولا تحرمنا وآثرنا ولا تؤثر علينا وأرضنا وارض عنا ‏\"‏ ‏.‏ ثم قال صلى الله عليه وسلم ‏\"‏ أنزل على عشر آيات من أقامهن دخل الجنة ‏\"‏ ‏.‏ ثم قرأ ‏:‏ ‏(‏ قد أفلح المؤمنون ‏)‏ حتى ختم عشر آيات ‏.‏",
      "text_en": " Narrated 'Umar bin Al-Khattab [may Allah be pleased with him]:                     \"When revelation came to the Messenger of Allah (ﷺ), one could hear what sounded like the drone of bees before his face. One day revelation was coming to him, he faced the Qiblah, raised his hands and said: 'O Allah! Increase us, do not diminish us. Favor us, do not withhold from us, make us pleased and be pleased with us.' He (ﷺ) said: 'Ten Ayah were revealed to me, whoever abides by them shall enter Paradise (and they are): 'Successful indeed ar the believers...' until the completion of then Ayat (23:1-10).\"",
      "usc_msa_ref": "",
      "chain": [
        "30221",
        "30553",
        "20121",
        "11013",
        "10511",
        "3195",
        "3"
      ]
    },
    {
      "id": "sunan-an-nasai-937",
      "hadith_no": "937",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن القاسم، قال حدثني مالك، عن ابن شهاب، عن عروة بن الزبير، عن عبد الرحمن بن عبد القاري، قال سمعت عمر بن الخطاب، - رضى الله عنه - يقول سمعت هشام بن حكيم، يقرأ سورة الفرقان على غير ما أقرؤها عليه وكان رسول الله صلى الله عليه وسلم أقرأنيها فكدت أن أعجل عليه ثم أمهلته حتى انصرف ثم لببته بردائه فجئت به إلى رسول الله صلى الله عليه وسلم فقلت يا رسول الله إني سمعت هذا يقرأ سورة الفرقان على غير ما أقرأتنيها ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ اقرأ ‏\"‏ ‏.‏ فقرأ القراءة التي سمعته يقرأ فقال رسول الله صلى الله عليه وسلم ‏\"‏ هكذا أنزلت ‏\"‏ ‏.‏ ثم قال لي ‏\"‏ اقرأ ‏\"‏ ‏.‏ فقرأت فقال ‏\"‏ هكذا أنزلت إن هذا القرآن أنزل على سبعة أحرف ‏{‏ فاقرءوا ما تيسر منه ‏}‏ ‏\"‏ ‏.‏",
      "text_en": " It was narrated that AbdurRahman bin Abdul-Qari said:                     \"I heard Umar bin Al-Khattab, may Allah be pleased with him, say: 'I heard Hisham bin Hakim bin Hizam reciting Surat Al-Furqan, in a way that I had not been taught, and the Messenger of Allah (ﷺ) had taught me. I was about to interrupt him (in his prayer), but I left him alone until he had finished. Then I grabbed him by his garment and brought him to the Messenger of Allah (ﷺ) and said: 'O Messenger of Allah, I heard this man reciting Surat Al-Furqan in a way that you did not teach me.' The Messenger of Allah (ﷺ) said to him: 'Recite.' So he recited it in the way that I had heard him recite. Then the Messenger of Allah (ﷺ) said: 'It was revealed like this.' Then he said to me: 'Recite.' So I recited it and he said: 'It was revealed like this. This Quran has been revealed in seven different modes, so recite as much of the Quran as may be easy for you.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11013",
        "10511",
        "3195",
        "3"
      ]
    },
    {
      "id": "sunan-an-nasai-1790",
      "hadith_no": "1790",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا قتيبة بن سعيد، قال حدثنا أبو صفوان عبد الله بن سعيد بن عبد الملك بن مروان، عن يونس، عن ابن شهاب، أن السائب بن يزيد، وعبيد الله، أخبراه أن عبد الرحمن بن عبد القاري قال سمعت عمر بن الخطاب، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ من نام عن حزبه أو عن شىء منه فقرأه فيما بين صلاة الفجر وصلاة الظهر كتب له كأنما قرأه من الليل ‏\"‏ ‏.‏",
      "text_en": " Abdur-Rahman bin Abdul-Qari said:                     \"I heard Umar bin Al-Khattab say: 'The Messenger of Allah (ﷺ) said: Whoever sleeps and misses his portion (of Qur'an) or part of it, and then reads it between Fajr and Zuhr prayers, it will be recorded for him as if he had read it at night.'\" (Sahih",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20475",
        "11013",
        "3048",
        "3195",
        "3"
      ]
    },
    {
      "id": "sunan-an-nasai-1791",
      "hadith_no": "1791",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا محمد بن رافع، قال حدثنا عبد الرزاق، قال أنبأنا معمر، عن الزهري، عن عروة، عن عبد الرحمن بن عبد القاري، أن عمر بن الخطاب، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ من نام عن حزبه - أو قال جزئه - من الليل فقرأه فيما بين صلاة الصبح إلى صلاة الظهر فكأنما قرأه من الليل ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abdur-Rahman bin Abdul-Qari that:                     Umar bin Al-Khattab said: \"(The Messenger of Allah (ﷺ) said): \"Whoever sleeps and misses his nightly portion, and reads it between Subh and Zuhr prayers, it is as if he read it at night.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11013",
        "10511",
        "3195",
        "3"
      ]
    },
    {
      "id": "sunan-an-nasai-1792",
      "hadith_no": "1792",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا قتيبة بن سعيد، عن مالك، عن داود بن الحصين، عن الأعرج، عن عبد الرحمن بن عبد القاري، أن عمر بن الخطاب، قال من فاته حزبه من الليل فقرأه حين تزول الشمس إلى صلاة الظهر فإنه لم يفته أو كأنه أدركه ‏.‏ رواه حميد بن عبد الرحمن بن عوف موقوفا ‏.‏",
      "text_en": " It was narrated from Abdur-Rahman bin Abdul-Qari that Umar bin Al-Khattab said:                     \"Whoever misses his nightly portion and recites it from the time when the sun passes its zenith until Zuhr prayer, then he did not miss it, or it is as if he caught up with it.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20001",
        "11160",
        "11197",
        "3195",
        "3"
      ]
    },
    {
      "id": "sunan-ibn-majah-1404",
      "hadith_no": "1404",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أحمد بن عمرو بن السرح المصري، حدثنا عبد الله بن وهب، أنبأنا يونس بن يزيد، عن ابن شهاب، أن السائب بن يزيد، وعبيد الله بن عبد الله، أخبراه عن عبد الرحمن بن عبد القاري، قال سمعت عمر بن الخطاب، يقول قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من نام عن جزئه أو عن شىء منه فقرأه فيما بين صلاة الفجر وصلاة الظهر - كتب له كأنما قرأه من الليل ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Abdur-Rahman bin ‘Abdin Al-Qari said:                      “I heard‘Umar bin Khattab say: ‘The Messenger of Allah (ﷺ) said:‘Whoeversleeps and misses his daily portion of Qur’an, or anypart of it, lethim read it between the Fajr prayer and the Zuhrprayer, and it willbe recorded as if he had read it during thenight.”",
      "usc_msa_ref": "",
      "chain": [
        "20029",
        "20475",
        "11013",
        "3048",
        "3195",
        "3"
      ]
    }
  ],
  "total_hadiths": 14
}