{
  "id": "32",
  "name": "Mu'adh ibn Jabal ( معاذ بن جبل بن عمرو بن أوس ( رضي الله عنه",
  "full_name": "Mu'adh ibn Jabal ( معاذ بن جبل بن عمرو بن أوس ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "biography": {
    "birth": {
      "date_hijri": "18",
      "date_gregorian": "606",
      "date_display": [
        "18 BH",
        "606 CE"
      ],
      "place": "Medinah"
    },
    "death": {
      "date_hijri": "18",
      "date_gregorian": "640",
      "date_display": null,
      "place": "Amawas, Palestine",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medinah",
      "Yemen",
      "Makkah",
      "Palestine",
      "Syria"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Fiqh",
      "Narrator [ ع  -  صحابة ]",
      "Commander"
    ],
    "tags": [
      "Khazraj",
      "Ansar",
      "B.Jusham B.al-Khazraj",
      "B.Salima",
      "Aqaba 2",
      "Badr",
      "Uhud",
      "Khandaq",
      "Messenger"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [
    {
      "id": "1150",
      "name": "al-sa'ba bint Jabal bin 'Amr ( الصعبة بنت جبل بن عمرو بن أوس ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "children": [
    {
      "id": "1151",
      "name": "Umm 'Abdullah bint Mu'adh ibn Jabal ( أم عبد الله بنت معاذ بن جبل بن عمرو ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "1149",
      "name": "'Abdur Rahman bin Mu'adh ibn Jabal ( عبد الرحمن بن معاذ بن جبل الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA)"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "students": [
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "41",
      "name": "Abu Musa al-Asha'ari ( أبو موسى الأشعري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "29",
      "name": "'Abdullah bin 'Amr bin al-'Aas ( عبد الله بن عمرو بن العاص ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "955",
      "name": "'Abdur Rahman bin Samra ( عبد الرحمن بن سمرة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5115",
      "name": "'Abdullah bin Abi Awfa ( عبد الله بن أبي أوفي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "34",
      "name": "Jabir ibn 'Abdullah ( جابر بن عبد الله بن عمرو السلمي الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3660",
      "name": "Abu al-Tufayl, 'Amir bin Wathla ( أبو الطفيل عامر بن واثلة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5152",
      "name": "'Abdur Rahman bin Ghnm ( عبد الرحمن بن غنم ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11026",
      "name": "Abu Muslim al-Khulani أبو مسلم الخولاني",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "19310",
      "name": "Abu 'Abdullah Client of B.Taym أبو عبد الله مولى بني تميم",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "11353",
      "name": "Shaqayq bin Salmah al-Asadi شقيق بن سلمة الأسدي أبو وائل الكوفي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11018",
      "name": "Masrouq bin al-Ajda' مسروق بن الأجدع",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "169",
      "name": "'Abdullah ibn Shaddad ( عبد الله بن شداد بن الهاد الليثي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11620",
      "name": "al-Aswad bin Hilal al-Maharbi الأسود بن هلال المحاربي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11054",
      "name": "al-Aswad bin Yazid الأسود بن يزيد بن قيس النخعي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11046",
      "name": "Qays bin Abi Hazim قيس بن أبي حازم",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11382",
      "name": "'Amr bin Maymun al-Aw'di عمرو بن ميمون الأودي أبو عبد الله",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11722",
      "name": "Malik bin Yakhamar مالك بن يخامر",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11027",
      "name": "Abu Idrees al-Khulani أبو إدريس الخولاني",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "19921",
      "name": "'Abdullah bin Qays, Abu Bahriyya عبد الله بن قيس الكندي أبو بحرية",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "19302",
      "name": "Abu Zbyh أبو ظبية",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11020",
      "name": "'Ata ibn Yasar عطاء بن يسار أبو محمد مولى ميمونة",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11196",
      "name": "'Abdur Rahman bin Abi Layla عبد الرحمن بن أبي ليلى",
      "grade": "Follower(Tabi') [2nd Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "700",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا مسلم، قال حدثنا شعبة، عن عمرو، عن جابر بن عبد الله، أن معاذ بن جبل، كان يصلي مع النبي صلى الله عليه وسلم ثم يرجع فيؤم قومه‏.‏",
      "text_en": " Narrated Mu`adh bin Jabal:                     I used to pray the `Isha prayer with the Prophet and then go to lead my people in the prayer.",
      "chain": [
        "20285",
        "20020",
        "20377",
        "34",
        "32"
      ]
    },
    {
      "hadith_no": "1994",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا معاذ، أخبرنا ابن عون، عن زياد بن جبير، قال جاء رجل إلى ابن عمر  رضى الله عنهما  فقال رجل نذر أن يصوم يوما، قال أظنه قال الاثنين، فوافق يوم عيد‏.‏ فقال ابن عمر أمر الله بوفاء النذر، ونهى النبي صلى الله عليه وسلم عن صوم هذا اليوم‏.‏",
      "text_en": " Narrated Ziyad bin Jubair:                     A man went to Ibn `Umar I. and said, \"A man vowed to fast one day (the sub-narrator thinks that he said that the day was Monday), and that day happened to be `Id day.\" Ibn `Umar said, \"Allah orders vows to be fulfilled and the Prophet forbade the fasting on this day (i.e. Id).",
      "chain": [
        "30170",
        "32",
        "11071",
        "11285"
      ]
    },
    {
      "hadith_no": "2161",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا معاذ، حدثنا ابن عون، عن محمد، قال أنس بن مالك  رضى الله عنه  نهينا أن يبيع حاضر لباد‏.‏",
      "text_en": " Narrated Anas bin Malik:                     We were forbidden that a town dweller should sell goods of a desert dweller.",
      "chain": [
        "30170",
        "32",
        "11071",
        "11035",
        "19"
      ]
    },
    {
      "hadith_no": "2856",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثني إسحاق بن إبراهيم، سمع يحيى بن آدم، حدثنا أبو الأحوص، عن أبي إسحاق، عن عمرو بن ميمون، عن معاذ  رضى الله عنه  قال كنت ردف النبي صلى الله عليه وسلم على حمار يقال له عفير، فقال ‏\"‏ يا معاذ، هل تدري حق الله على عباده وما حق العباد على الله ‏\"‏‏.‏ قلت الله ورسوله أعلم‏.‏ قال ‏\"‏ فإن حق الله على العباد أن يعبدوه ولا يشركوا به شيئا، وحق العباد على الله أن لا يعذب من لا يشرك به شيئا ‏\"‏‏.‏ فقلت يا رسول الله، أفلا أبشر به الناس قال ‏\"‏ لا تبشرهم فيتكلوا ‏\"‏‏.‏",
      "text_en": " Narrated Mu`adh:                     I was a companion rider of the Prophet on a donkey called 'Ufair. The Prophet asked, \"O Mu`adh! Do you know what Allah's right on His slaves is, and what the right of His slaves on Him is?\" I replied, \"Allah and His Apostle know better.\" He said, \"Allah's right on His slaves is that they should worship Him (Alone) and should not worship any besides Him. And slave's right on Allah is that He should not punish him who worships none besides Him.\" I said, \"O Allah's Apostle! Should I not inform the people of this good news?\" He said, \"Do not inform them of it, lest they should depend on it (absolutely).",
      "chain": [
        "30123",
        "20364",
        "20327",
        "11049",
        "11382",
        "32"
      ]
    },
    {
      "hadith_no": "3682",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثني محمد بن المثنى، حدثنا معاذ، قال حدثني أبي، عن قتادة، حدثنا أنس  رضى الله عنه  أن رجلين، من أصحاب النبي صلى الله عليه وسلم خرجا من عند النبي صلى الله عليه وسلم في ليلة مظلمة ومعهما مثل المصباحين، يضيآن بين أيديهما، فلما افترقا صار مع كل واحد منهما واحد حتى أتى أهله‏.‏",
      "text_en": " Narrated Anas:                     Once two men from the companions of Allah's Apostle went out of the house of the Prophet on a very dark night. They were accompanied by two things that resembled two lamps lighting the way in front of them, and when they parted, each of them was accompanied by one of those two things (lamps) till they reached their homes.",
      "chain": [
        "30170",
        "32",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "4180",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "وقال معاذ حدثنا هشام، عن أبي الزبير، عن جابر، قال كنا مع النبي صلى الله عليه وسلم بنخل‏.‏ فذكر صلاة الخوف‏.‏ قال مالك وذلك أحسن ما سمعت في صلاة الخوف‏.‏ تابعه الليث عن هشام عن زيد بن أسلم أن القاسم بن محمد حدثه صلى النبي صلى الله عليه وسلم في غزوة بني أنمار‏.‏",
      "text_en": "",
      "chain": [
        "32",
        "11065",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "4391",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن حبيب بن أبي ثابت، عن سعيد بن جبير، عن عمرو بن ميمون، أن معاذا  رضى الله عنه  لما قدم اليمن صلى بهم الصبح فقرأ ‏{‏واتخذ الله إبراهيم خليلا‏}‏ فقال رجل من القوم لقد قرت عين أم إبراهيم‏.‏ زاد معاذ عن شعبة عن حبيب عن سعيد عن عمرو أن النبي صلى الله عليه وسلم بعث معاذا إلى اليمن، فقرأ معاذ في صلاة الصبح سورة النساء فلما قال ‏{‏واتخذ الله إبراهيم خليلا‏}‏ قال رجل خلفه قرت عين أم إبراهيم‏.‏",
      "text_en": " Narrated `Amr bin Maimuin:                     When Mu`adh arrived at Yemen, he led them (i.e. the people of Yemen) in the Fajr prayer wherein he recited: 'Allah took Abraham as a Khalil.' A man amongst the people said, \"(How) glad the mother of Abraham is!\" (In another narration) `Amr said, \"The Prophet sent Mu`adh to Yemen and he (led the people) in the Fajr prayer and recited: 'Allah took Abraham as a Khalil. A man behind him said, \"(How) glad the mother of Abraham is!\"",
      "chain": [
        "20193",
        "20020",
        "11331",
        "11050",
        "11382",
        "32"
      ]
    },
    {
      "hadith_no": "4693",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "وقال معاذ حدثنا شعبة، عن خبيب، سمع حفصا، سمع أبا سعيد، رجلا من أصحاب النبي صلى الله عليه وسلم بهذا، وقال هي ‏{‏الحمد لله رب العالمين‏}‏ السبع المثاني‏.‏",
      "text_en": "",
      "chain": [
        "32",
        "20020",
        "11159"
      ]
    },
    {
      "hadith_no": "5470",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا عبد الله بن أبي الأسود، حدثنا معاذ، حدثني أبي، عن يونس، عن قتادة، عن أنس بن مالك، قال ما أكل النبي صلى الله عليه وسلم على خوان، ولا في سكرجة، ولا خبز له مرقق‏.‏ قلت لقتادة على ما يأكلون قال على السفر‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet never took his meals at a dining table, nor in small plates, and he never ate thin wellbaked bread. (The sub-narrator asked Qatada, \"Over what did they use to take their meals?\" Qatada said, \"On leather dining sheets.\"",
      "chain": [
        "30145",
        "32",
        "20475",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "5873",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثني عبد الله بن أبي الأسود، حدثنا معاذ، قال حدثني أبي، عن قتادة، عن أنس بن مالك، رضى الله عنه  قال كان أحب الثياب إلى النبي صلى الله عليه وسلم أن يلبسها الحبرة‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The most beloved garment to the Prophet to wear was the Hibra (a kind of Yemenese cloth).",
      "chain": [
        "30145",
        "32",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "6033",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا هدبة بن خالد، حدثنا همام، حدثنا قتادة، حدثنا أنس بن مالك، عن معاذ بن جبل  رضى الله عنه  قال بينا أنا رديف النبي، صلى الله عليه وسلم ليس بيني وبينه إلا أخرة الرحل فقال ‏\"‏ يا معاذ ‏\"‏‏.‏ قلت لبيك رسول الله وسعديك‏.‏ ثم سار ساعة ثم قال ‏\"‏ يا معاذ ‏\"‏‏.‏ قلت لبيك رسول الله وسعديك‏.‏ ثم سار ساعة ثم قال ‏\"‏ يا معاذ ‏\"‏‏.‏ قلت لبيك رسول الله وسعديك‏.‏ قال ‏\"‏ هل تدري ما حق الله على عباده ‏\"‏‏.‏ قلت الله ورسوله أعلم‏.‏ قال ‏\"‏ حق الله على عباده أن يعبدوه ولا يشركوا به شيئا ‏\"‏‏.‏ ثم سار ساعة ثم قال ‏\"‏ يا معاذ بن جبل ‏\"‏‏.‏ قلت لبيك رسول الله وسعديك‏.‏ فقال ‏\"‏ هل تدري ما حق العباد على الله إذا فعلوه ‏\"‏‏.‏ قلت الله ورسوله أعلم‏.‏ قال ‏\"‏ حق العباد على الله أن لا يعذبهم ‏\"‏‏.‏",
      "text_en": " Narrated Mu`adh bin Jabal:                     While I was riding behind the Prophet and between me and him and between me and him there was only the back of the saddle, he said, \"0 Mu`adh!\" I replied, \"Labbaik, 0 Allah's Apostle, and Sa`daik!\" he said, \"Do you know what is Allah's right upon his slave?\" I said, \"Allah and His Apostle know best\" He said \"Allah's right upon his slaves is that they should worship Him alone and not worship anything else besides Him.\" Then he proceeded for a while and then said, \"O Mu`adh bin Jabal!\" I replied, \"Labbaik, O Allah's Apostle:, Sa`daik!' He said, \"Do you know what is the right of the slaves upon Allah if they do that?\" I replied, \"Allah and His Apostle know best.\" He said, \"The right of the slaves upon Allah is that He will not punish them (if they do that).",
      "chain": [
        "20294",
        "20297",
        "11019",
        "19",
        "32"
      ]
    },
    {
      "hadith_no": "6174",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا محمد بن عبادة، أخبرنا يزيد، أخبرنا سليم، حدثنا عمرو بن دينار، حدثنا جابر بن عبد الله، أن معاذ بن جبل  رضى الله عنه  كان يصلي مع النبي صلى الله عليه وسلم ثم يأتي قومه فيصلي بهم الصلاة، فقرأ بهم البقرة  قال  فتجوز رجل فصلى صلاة خفيفة، فبلغ ذلك معاذا فقال إنه منافق‏.‏ فبلغ ذلك الرجل، فأتى النبي صلى الله عليه وسلم فقال يا رسول الله إنا قوم نعمل بأيدينا، ونسقي بنواضحنا، وإن معاذا صلى بنا البارحة، فقرأ البقرة فتجوزت، فزعم أني منافق‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ يا معاذ أفتان أنت  ثلاثا  اقرأ ‏{‏والشمس وضحاها‏}‏ و‏{‏سبح اسم ربك الأعلى‏}‏ ونحوها ‏\"‏‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     Mu`adh bin Jabal used to pray with the Prophet and then go to lead his people in prayer. Once he led the people in prayer and recited Surat-al-Baqara. A man left (the row of the praying people) and offered (light) prayer (separately) and went away. When Mu`adh came to know about it, he said. \"He (that man) is a hypocrite.\" Later that man heard what Mu`adh said about him, so he came to the Prophet and said, \"O Allah's Apostle! We are people who work with our own hands and irrigate (our farms) with our camels. Last night Mu`adh led us in the (night) prayer and he recited Sura-al-Baqara, so I offered my prayer separately, and because of that, he accused me of being a hypocrite.\" The Prophet called Mu`adh and said thrice, \"O Mu`adh! You are putting the people to trials? Recite 'Washshamsi wad-uhaha' (91) or'Sabbih isma Rabbi ka-l-A'la' (87) or the like.\"",
      "chain": [
        "30378",
        "20472",
        "20234",
        "11081",
        "34",
        "32"
      ]
    },
    {
      "hadith_no": "6340",
      "source": " Sahih Bukhari ",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا همام، عن قتادة، عن أنس، عن معاذ، قال أنا رديف النبي، صلى الله عليه وسلم فقال ‏\"‏ يا معاذ ‏\"‏‏.‏ قلت لبيك وسعديك‏.‏ ثم قال مثله ثلاثا ‏\"‏ هل تدري ما حق الله على العباد أن يعبدوه ولا يشركوا به شيئا ‏\"‏‏.‏ ثم سار ساعة فقال ‏\"‏ يا معاذ ‏\"‏‏.‏ قلت لبيك وسعديك‏.‏ قال ‏\"‏ هل تدري ما حق العباد على الله إذا فعلوا ذلك أن لا يعذبهم ‏\"‏‏.‏",
      "text_en": " Narrated Mu`adh:                     While I was a companion rider with the Prophet he said, \"O Mu`adh!\" I replied, \"Labbaik wa Sa`daik.\" He repeated this call three times and then said, \"Do you know what Allah's Right on His slaves is?\" I replied, \"No.\" He said, Allah's Right on His slaves is that they should worship Him (Alone) and should not join partners in worship with Him.\" He said, \"O Mu`adh!\" I replied, \"Labbaik wa Sa`daik.\" He said, \"Do you know what the right of (Allah's) salves on Allah is, if they do that (worship Him Alone and join none in His worship)? It is that He will not punish them.\"",
      "chain": [
        "20040",
        "20297",
        "11019",
        "19",
        "32"
      ]
    },
    {
      "hadith_no": "6560",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "وقال معاذ حدثنا شعبة، عن قتادة، سمعت عقبة، سمعت أبا سعيد، عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": "",
      "chain": [
        "32",
        "20020",
        "11019",
        "189",
        "38"
      ]
    },
    {
      "hadith_no": "6579",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا هدبة بن خالد، حدثنا همام، حدثنا قتادة، حدثنا أنس بن مالك، عن معاذ بن جبل  رضى الله عنه  قال بينما أنا رديف النبي، صلى الله عليه وسلم ليس بيني وبينه إلا آخرة الرحل فقال ‏\"‏ يا معاذ ‏\"‏‏.‏ قلت لبيك يا رسول الله وسعديك، ثم سار ساعة ثم قال ‏\"‏ يا معاذ ‏\"‏‏.‏ قلت لبيك رسول الله وسعديك، ثم سار ساعة ثم قال ‏\"‏ يا معاذ بن جبل ‏\"‏‏.‏ قلت‏:‏ لبيك رسول الله وسعديك‏.‏ قال ‏\"‏ هل تدري ما حق الله على عباده ‏\"‏‏.‏ قلت الله ورسوله أعلم‏.‏ قال ‏\"‏ حق الله على عباده أن يعبدوه، ولا يشركوا به شيئا ‏\"‏‏.‏ ثم سار ساعة ثم قال ‏\"‏ يا معاذ بن جبل ‏\"‏‏.‏ قلت لبيك رسول الله وسعديك‏.‏ قال ‏\"‏ هل تدري ما حق العباد على الله إذا فعلوه ‏\"‏‏.‏ قلت الله ورسوله أعلم‏.‏ قال ‏\"‏ حق العباد على الله أن لا يعذبهم ‏\"‏‏.‏",
      "text_en": " Narrated Mu`adh bin Jabal:                     While I was riding behind the Prophet as a companion rider and there was nothing between me and him except the back of the saddle, he said, \"O Mu`adh!\" I replied, \"Labbaik O Allah's Apostle! And Sa'diak!\" He proceeded for a while and then said, \"O Mu`adh!\" I said, \"Labbaik and Sa`daik, O Allah's Apostle!\" He then proceeded for another while and said, \"O Mu`adh bin Jabal!\" I replied, \"Labbaik, O Allah's Apostle, and Sa`daik!\" He said, \"Do you know what is Allah's right on His slaves?\" I replied, \"Allah and His Apostle know better.\" He said, \"Allah's right on his slaves is that they should worship Him and not worship anything besides Him.\" He then proceeded for a while, and again said, \"O Mu`adh bin Jabal!\" I replied. \"Labbaik, O Allah's Apostle, and Sa`daik.\" He said, \"Do you know what is (Allah's) slaves' (people's) right on Allah if they did that?\" I replied, \"Allah and His Apostle know better.\" He said, \"The right of (Allah's) slaves on Allah is that He should not punish them (if they did that).",
      "chain": [
        "20294",
        "20297",
        "11019",
        "19",
        "32"
      ]
    },
    {
      "hadith_no": "7100",
      "source": " Sahih Bukhari ",
      "chapter": "Interpretation of Dreams - كتاب التعبير",
      "chapter_no": "92",
      "text_ar": "حدثني عبد الله بن محمد، حدثنا أزهر، عن ابن عون، ح وحدثني خليفة، حدثنا معاذ، حدثنا ابن عون، عن محمد، حدثنا قيس بن عباد، عن عبد الله بن سلام، قال رأيت كأني في روضة، وسط الروضة عمود في أعلى العمود عروة، فقيل لي ارقه‏.‏ قلت لا أستطيع‏.‏ فأتاني وصيف فرفع ثيابي فرقيت، فاستمسكت بالعروة، فانتبهت وأنا مستمسك بها، فقصصتها على النبي صلى الله عليه وسلم فقال ‏\"‏ تلك الروضة روضة الإسلام، وذلك العمود عمود الإسلام، وتلك العروة عروة الوثقى، لا تزال مستمسكا بالإسلام حتى تموت ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Salam:                     (In a dream) I saw myself in a garden, and there was a pillar in the middle of the garden, and there was a handhold at the top of the pillar. I was asked to climb it. I said, \"I cannot.\" Then a servant came and lifted up my clothes and I climbed (the pillar), and then got hold of the handhold, and I woke up while still holding it. I narrated that to the Prophet who said, \"The garden symbolizes the garden of Islam, and the handhold is the firm Islamic handhold which indicates that you will be adhering firmly to Islam until you die.\"",
      "chain": [
        "30351",
        "20206",
        "11071",
        "30132",
        "32",
        "11071",
        "11035",
        "11609",
        "103"
      ]
    },
    {
      "hadith_no": "7461",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن أبي حصين، والأشعث بن سليم، سمعا الأسود بن هلال، عن معاذ بن جبل، قال قال النبي صلى الله عليه وسلم ‏\"‏ يا معاذ أتدري ما حق الله على العباد ‏\"‏‏.‏ قال الله ورسوله أعلم‏.‏ قال ‏\"‏ أن يعبدوه ولا يشركوا به شيئا، أتدري ما حقهم عليه ‏\"‏‏.‏ قال الله ورسوله أعلم‏.‏ قال ‏\"‏ أن لا يعذبهم ‏\"‏‏.‏",
      "text_en": " Narrated Mu`adh bin Jabal:                     The Prophet said, \"O Mu`adh! Do you know what Allah's Right upon His slaves is?\" I said, \"Allah and His Apostle know best.\" The Prophet said, \"To worship Him (Allah) Alone and to join none in worship with Him (Allah). Do you know what their right upon Him is?\" I replied, \"Allah and His Apostle know best.\" The Prophet said, \"Not to punish them (if they do so).",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11371",
        "11324",
        "11620",
        "32"
      ]
    },
    {
      "hadith_no": "130",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب وإسحاق بن إبراهيم جميعا عن وكيع، - قال أبو بكر حدثنا وكيع، - عن زكرياء بن إسحاق، قال حدثني يحيى بن عبد الله بن صيفي، عن أبي معبد، عن ابن عباس، عن معاذ بن جبل، - قال أبو بكر ربما قال وكيع عن ابن عباس، أن معاذا، - قال بعثني رسول الله صلى الله عليه وسلم قال ‏\"‏ إنك تأتي قوما من أهل الكتاب ‏.‏ فادعهم إلى شهادة أن لا إله إلا الله وأني رسول الله فإن هم أطاعوا لذلك فأعلمهم أن الله افترض عليهم خمس صلوات في كل يوم وليلة فإن هم أطاعوا لذلك فأعلمهم أن الله افترض عليهم صدقة تؤخذ من أغنيائهم فترد في فقرائهم فإن هم أطاعوا لذلك فإياك وكرائم أموالهم واتق دعوة المظلوم فإنه ليس بينها وبين الله حجاب ‏\"‏ ‏.‏",
      "text_en": " It is reported on the authority of Ibn 'Abbas that Mu'adh said:                      The Messenger of Allah sent me (as a governor of Yemen) and (at the time of departure) instructed me thus: You will soon find yourself in a community one among the people of the Book, so first call them to testify that there is no god but Allah, that I (Muhammad) am the messenger of Allah, and if they accept this, then tell them Allah has enjoined upon them five prayers during the day and the night and if they accept it, then tell them that Allah has made Zakat obligatory for them that it should be collected from the rich and distributed among the poor, and if they agree to it don't pick up (as a share of Zakat) the best of their wealths. Beware of the supplication of the oppressed for there is no barrier between him and Allah.",
      "chain": [
        "30201",
        "20032",
        "20436",
        "20032",
        "11244",
        "11448",
        "13127",
        "17",
        "32",
        "20032",
        "17",
        "32"
      ]
    },
    {
      "hadith_no": "152",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا هداب بن خالد الأزدي، حدثنا همام، حدثنا قتادة، حدثنا أنس بن مالك، عن معاذ بن جبل، قال كنت ردف النبي صلى الله عليه وسلم ليس بيني وبينه إلا مؤخرة الرحل فقال ‏\"‏ يا معاذ بن جبل ‏\"‏ ‏.‏ قلت لبيك رسول الله وسعديك ‏.‏ ثم سار ساعة ثم قال ‏\"‏ يا معاذ بن جبل ‏\"‏ ‏.‏ قلت لبيك رسول الله وسعديك ‏.‏ ثم سار ساعة ثم قال ‏\"‏ يا معاذ بن جبل ‏\"‏ ‏.‏ قلت لبيك رسول الله وسعديك ‏.‏ قال ‏\"‏ هل تدري ما حق الله على العباد ‏\"‏ ‏.‏ قال قلت الله ورسوله أعلم ‏.‏ قال ‏\"‏ فإن حق الله على العباد أن يعبدوه ولا يشركوا به شيئا ‏\"‏ ‏.‏ ثم سار ساعة ثم قال ‏\"‏ يا معاذ بن جبل ‏\"‏ ‏.‏ قلت لبيك رسول الله وسعديك ‏.‏ قال ‏\"‏ هل تدري ما حق العباد على الله إذا فعلوا ذلك ‏\"‏ ‏.‏ قال قلت الله ورسوله أعلم ‏.‏ قال ‏\"‏ أن لا يعذبهم ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Mu'adh b. Jabal:                      I was riding behind the Prophet (may peace be upon him) and there was nothing between him and me but the rear part of the saddle, when he said: Mu'adh b. Jabal: To which I replied: At your beck and call, and at your pleasure, Messenger of Allah! He moved along for a few minutes, when again he said: Mu'adh b. Jabal: To which I replied: At your beck and call, and at your pleasure, Messenger of Allah! He then again moved along for a few minutes and said: Mu'adh b. Jabal: To which I replied. At your beck and call, and at your pleasure. Messenger of Allah He, (the Holy Prophet) said: Do you know what right has Allah upon His servants? I said: Allah and His Messenger know best. He (the Holy Prophet) said: Verily the right of Allah over His servants is that they should worship Him, not associating anything with Him. He (the Holy Prophet) with Mu'adh behind him, moved along for a few minutes and said: Mu'adh b. Jabal: To which I replied: At your beck and call, and at your pleasure, Messenger of Allah! He (the Holy Prophet) said: Do you know what rights have servants upon Allah in case they do it (i. e. they worship Allah without associating anything with Him)? I (Mu'adh b. Jabal) replied: Allah and His Messenger know best. (Upon this) he (the Holy Prophet) remarked: That He would not torment them (with the fire of Hell).",
      "chain": [
        "20297",
        "11019",
        "19",
        "32"
      ]
    },
    {
      "hadith_no": "153",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو الأحوص، سلام بن سليم عن أبي إسحاق، عن عمرو بن ميمون، عن معاذ بن جبل، قال كنت ردف رسول الله صلى الله عليه وسلم على حمار يقال له عفير قال فقال ‏\"‏ يا معاذ تدري ما حق الله على العباد وما حق العباد على الله ‏\"‏ ‏.‏ قال قلت الله ورسوله أعلم ‏.‏ قال ‏\"‏ فإن حق الله على العباد أن يعبدوا الله ولا يشركوا به شيئا وحق العباد على الله عز وجل أن لا يعذب من لا يشرك به شيئا ‏\"‏ ‏.‏ قال قلت يا رسول الله أفلا أبشر الناس قال ‏\"‏ لا تبشرهم فيتكلوا ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Mu'adh b. Jabal that he observed:                      I was riding behind the Messenger of Allah (may peace be upon him) on an ass known as 'Ufair. He (Mu'adh) observed: He (the Holy Prophet) said: Mu'adh, do you know what right has Allah over His bondsmen and what right have His bondsmen over Him? Mu'adh added: I replied: Allah and his Messenger know best. Upon this he (the Holy Prophet remarked: The right of Allah over His bondsmen is that they should worship Allah and should not associate anything with Him, and the right of His bondsmen over Allah, Glorious and Sublime, is that He does not punish him who associates not anything with Him. He (Mu'adh) added: I said to the Messenger of Allah: Should I then give the tidings to the people? He (the Holy Prophet) said: Do not tell them this good news, for they would trust in it alone.",
      "chain": [
        "30201",
        "11049",
        "11382",
        "32"
      ]
    },
    {
      "hadith_no": "154",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن المثنى، وابن، بشار قال ابن المثنى حدثنا محمد بن جعفر، حدثنا شعبة، عن أبي حصين، والأشعث بن سليم، أنهما سمعا الأسود بن هلال، يحدث عن معاذ بن جبل، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يا معاذ أتدري ما حق الله على العباد ‏\"‏ ‏.‏ قال الله ورسوله أعلم ‏.‏ قال ‏\"‏ أن يعبد الله ولا يشرك به شىء - قال - أتدري ما حقهم عليه إذا فعلوا ذلك ‏\"‏ ‏.‏ فقال الله ورسوله أعلم ‏.‏ قال ‏\"‏ أن لا يعذبهم ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Mu'adh b. Jabal that the Messenger of Allah (may peace be upon him) said:                      Mu'adh, do you know the right of Allah over His bondsmen? He (Mu'adh) said: Allah and His Apostle know best. He (the Messenger of Allah) said: That Allah alone should be worshipped and nothing should be associated with Him. He (the Holy Prophet) said: What right have they (bondsmen) upon Him in case they do it? He (Mu'adh) said: Allah and His Apostle know best. He (the Holy Prophet) said: That He would not punish them.",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "11371",
        "11324",
        "11620",
        "32"
      ]
    },
    {
      "hadith_no": "155",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا القاسم بن زكرياء، حدثنا حسين، عن زائدة، عن أبي حصين، عن الأسود بن هلال، قال سمعت معاذا، يقول دعاني رسول الله صلى الله عليه وسلم فأجبته فقال ‏\"‏ هل تدري ما حق الله على الناس ‏\"‏ ‏.‏ نحو حديثهم ‏.‏",
      "text_en": " It is narrated on the authority of Aswad b. Hilal that he heard Mu'adh say this:                      The Messenger of Allah (may peace be upon him) called, me and I replied to him. He (the Holy Prophet) said: Do you know the right of Allah upon the people? and then followed the hadith (mentioned above).",
      "chain": [
        "11278",
        "20320",
        "11371",
        "11620",
        "32"
      ]
    },
    {
      "hadith_no": "379",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثني أبو غسان المسمعي، مالك بن عبد الواحد وإسحاق بن إبراهيم قال أبو غسان حدثنا معاذ، وقال، إسحاق أخبرنا معاذ بن هشام، صاحب الدستوائي وحدثني أبي، عن عامر الأحول، عن مكحول، عن عبد الله بن محيريز، عن أبي محذورة، أن نبي الله صلى الله عليه وسلم علمه هذا الأذان ‏\"‏ الله أكبر الله أكبر أشهد أن لا إله إلا الله أشهد أن لا إله إلا الله أشهد أن محمدا رسول الله أشهد أن محمدا رسول الله - ثم يعود فيقول - أشهد أن لا إله إلا الله أشهد أن لا إله إلا الله أشهد أن محمدا رسول الله أشهد أن محمدا رسول الله حى على الصلاة - مرتين - حى على الفلاح - مرتين ‏\"‏ ‏.‏ زاد إسحاق ‏\"‏ الله أكبر الله أكبر لا إله إلا الله ‏\"‏ ‏.‏",
      "text_en": " Abu Mahdhura said that the Apostle of Allah (may peace be upon him) taught him Adhan like this:                      Allah is the Greatest, Allah is the Greatest; I testify that there is no god but Allah, I testify that there is no god but Allah; I testify that Muhammad Is the Messenger of Allah, I testify that Muhammad is the Messenger of Allah, and it should be again repeated: I testify that there is no god but Allah, I testify that there is no god but Allah; I testify that Muhammad Is the Messenger of Allah, I testify that Muhammad is the Messenger of Allah. Come to the prayer (twice). Come to the prayer (twice). Ishaq added: Allah is the Greatest, Allah is the Greatest; there Is no god but Allah.",
      "chain": [
        "30456",
        "20179",
        "32",
        "30312",
        "20287",
        "20295",
        "10693",
        "11066",
        "11253",
        "2416"
      ]
    },
    {
      "hadith_no": "465",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا هشيم، عن منصور، عن عمرو بن دينار، عن جابر بن عبد الله، أن معاذ بن جبل، كان يصلي مع رسول الله صلى الله عليه وسلم العشاء الآخرة ثم يرجع إلى قومه فيصلي بهم تلك الصلاة ‏.‏",
      "text_en": " Jabir b. 'Abdullah reported:                      Mu'adh b. Jabal said the night prayer with the Messenger of Allah (may peace be upon him) and then returned to his people and then led them in this prayer.",
      "chain": [
        "30399",
        "20468",
        "11067",
        "11081",
        "34",
        "32"
      ]
    },
    {
      "hadith_no": "1665",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا أحمد بن عبد الله بن يونس، حدثنا زهير، حدثنا أبو الزبير، عن أبي الطفيل، عامر عن معاذ، قال خرجنا مع رسول الله صلى الله عليه وسلم في غزوة تبوك فكان يصلي الظهر والعصر جميعا والمغرب والعشاء جميعا ‏.‏",
      "text_en": " Mu'adh reported:                      We set out with the Messenger of Allah (may peace be upon him) on the Tabuk expedition, and he observed the noon and afternoon prayers together and the sunset and 'Isha' prayers together.",
      "chain": [
        "30184",
        "20321",
        "11263",
        "32"
      ]
    },
    {
      "hadith_no": "1666",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا يحيى بن حبيب، حدثنا خالد، - يعني ابن الحارث - حدثنا قرة بن خالد، حدثنا أبو الزبير، حدثنا عامر بن واثلة أبو الطفيل، حدثنا معاذ بن جبل، قال جمع رسول الله صلى الله عليه وسلم في غزوة تبوك بين الظهر والعصر وبين المغرب والعشاء ‏.‏ قال فقلت ما حمله على ذلك قال فقال أراد أن لا يحرج أمته ‏.‏",
      "text_en": " Mu'adh b. Jabal reported:                      The Messenger of Allah (may peace be upon him) combined in the expedition to Tabuk the noon prayer with the afternoon prayer and the sunset prayer with the 'Isha' prayer. He (one of the narrators) said: What prompted him to do that? He (Mu'adh) replied that he (the Holy Prophet) wanted that his Ummah should not be put to (unnecessary) hardship.",
      "chain": [
        "20226",
        "11301",
        "11263",
        "32"
      ]
    },
    {
      "hadith_no": "3328",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني أبو غسان المسمعي، ومحمد بن بشار، جميعا عن معاذ بن هشام، - قال أبو غسان حدثنا معاذ، - حدثني أبي، عن قتادة، عن قزعة، عن أبي سعيد الخدري، أن نبي الله صلى الله عليه وسلم قال ‏\"‏ لا تسافر امرأة فوق ثلاث ليال إلا مع ذي محرم ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id Khudri (Allah be pleased with him) reported Allah's Apostle (may peace be upon him) as saying:                      A woman should not set out on a journey extending beyond three nights but with a Mahram.",
      "chain": [
        "30456",
        "30160",
        "20287",
        "20179",
        "32",
        "11019",
        "38"
      ]
    },
    {
      "hadith_no": "3665",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "وحدثني أبو غسان المسمعي، حدثنا معاذ، ح وحدثنا ابن المثنى، وابن، بشار قالا حدثنا معاذ بن هشام، حدثني أبي، عن قتادة، عن صالح بن أبي مريم أبي الخليل، عن عبد الله بن الحارث، عن أم الفضل، أن رجلا، من بني عامر بن صعصعة قال يا نبي الله هل تحرم الرضعة الواحدة قال ‏\"‏ لا ‏\"‏ ‏.‏",
      "text_en": " Umm Fadl (Allah be pleased with her) reported that a person from Banu 'Amir b. Sa'sa said:                      Allah's Apostle, does one suckling make the (marriage) unlawful? He said: No.",
      "chain": [
        "30456",
        "32",
        "30160",
        "20287",
        "20295",
        "11019",
        "912"
      ]
    },
    {
      "hadith_no": "3905",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا ابن أبي عدي، عن ابن عون، عن محمد، عن أنس،ح ‏.‏ وحدثنا ابن المثنى، حدثنا معاذ، حدثنا ابن عون، عن محمد، قال قال أنس بن مالك نهينا عن أن يبيع حاضر لباد ‏.‏",
      "text_en": " Anas b. Malik (Allah be pleased with him) said:                      We were forbidden that a townsman should sell for a man of the desert.",
      "chain": [
        "30170",
        "20276",
        "11071",
        "11035",
        "32",
        "11071",
        "11035",
        "19"
      ]
    },
    {
      "hadith_no": "6086",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن الدارمي، حدثنا أبو علي الحنفي، حدثنا مالك، - وهو ابن أنس - عن أبي الزبير المكي، أن أبا الطفيل، عامر بن واثلة أخبره أن معاذ بن جبل أخبره قال خرجنا مع رسول الله صلى الله عليه وسلم عام غزوة تبوك فكان يجمع الصلاة فصلى الظهر والعصر جميعا والمغرب والعشاء جميعا حتى إذا كان يوما أخر الصلاة ثم خرج فصلى الظهر والعصر جميعا ثم دخل ثم خرج بعد ذلك فصلى المغرب والعشاء جميعا ثم قال ‏\"‏ إنكم ستأتون غدا إن شاء الله عين تبوك وإنكم لن تأتوها حتى يضحي النهار فمن جاءها منكم فلا يمس من مائها شيئا حتى آتي ‏\"‏ ‏.‏ فجئناها وقد سبقنا إليها رجلان والعين مثل الشراك تبض بشىء من ماء - قال - فسألهما رسول الله صلى الله عليه وسلم ‏\"‏ هل مسستما من مائها شيئا ‏\"‏ ‏.‏ قالا نعم ‏.‏ فسبهما النبي صلى الله عليه وسلم وقال لهما ما شاء الله أن يقول - قال - ثم غرفوا بأيديهم من العين قليلا قليلا حتى اجتمع في شىء - قال - وغسل رسول الله صلى الله عليه وسلم فيه يديه ووجهه ثم أعاده فيها فجرت العين بماء منهمر أو قال غزير - شك أبو علي أيهما قال - حتى استقى الناس ثم قال ‏\"‏ يوشك يا معاذ إن طالت بك حياة أن ترى ما ها هنا قد ملئ جنانا ‏\"‏ ‏.‏",
      "text_en": " Mu'adh b. Jabal reported that he went along with Allah's Apostle (may peace be upon him) in the expedition of Tabuk and he (the Holy Prophet) combined the prayers. He offered the noon and afternoon prayers together and the sunset and night prayers together and on the other day he deferred the prayers; he then came out and offered the noon and afternoon prayers together. He then went in and (later on) came out and then after that offered the sunset and night prayers together and then said:                      God willing, you would reach by tomorrow the fountain of Tabuk and you should not come to that until it is dawn, and he who amongst you happens to go there should not touch its water until I come. We came to that and two persons (amongst) us reached that fountain ahead of us. It was a thin flow of water like the shoelace. Allah's Messenger (may peace be upon him) asked them whether they had touched the water. They said: Yes. Allah's Apostle (may peace be upon him) scolded them, and he said to them what he had to say by the will of God. The people then took water of the fountain in their palms until it became somewhat significant and Allah's Messenger (may peace be upon him) washed his hands and his face too in it, and then, took it again in that (fountain) and there gushed forth abundant water from that fountain, until all the people drank to their fill. He then said: Mu'adh, it is hoped that if you live long you would see its water irrigating well the gardens.",
      "chain": [
        "30025",
        "20260",
        "20001",
        "11263",
        "3660",
        "32"
      ]
    },
    {
      "hadith_no": "26",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا إسحاق بن سويد الرملي، وعمر بن الخطاب أبو حفص، وحديثه، أتم أن سعيد بن الحكم، حدثهم قال أخبرنا نافع بن يزيد، حدثني حيوة بن شريح، أن أبا سعيد الحميري، حدثه عن معاذ بن جبل، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ اتقوا الملاعن الثلاث البراز في الموارد وقارعة الطريق والظل ‏\"‏ ‏.‏",
      "text_en": " Narrated Mu'adh ibn Jabal:                     The Messenger of Allah (ﷺ) said: Be on your guard against three things which provoke cursing: easing in the watering places and on the thoroughfares, and in the shade (of the tree).",
      "chain": [
        "38092",
        "3",
        "30232",
        "20629",
        "26010",
        "32"
      ]
    },
    {
      "hadith_no": "213",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا هشام بن عبد الملك اليزني، حدثنا بقية بن الوليد، عن سعد الأغطش، - وهو ابن عبد الله - عن عبد الرحمن بن عائذ الأزدي، - قال هشام وهو ابن قرط أمير حمص - عن معاذ بن جبل، قال سألت رسول الله صلى الله عليه وسلم عما يحل للرجل من امرأته وهي حائض قال فقال ‏\"‏ ما فوق الإزار والتعفف عن ذلك أفضل ‏\"‏ ‏.‏ قال أبو داود وليس هو - يعني الحديث - بالقوي ‏.‏",
      "text_en": " Narrated Mu'adh ibn Jabal:                     I asked the Messenger of Allah (ﷺ): What is lawful for a man to do with his wife when she is menstruating? He replied: What is above the waist-wrapper, but it is better to abstain from it, too.Abu Dawud said: This (tradition) is not strong.",
      "chain": [
        "20644",
        "19925",
        "32"
      ]
    },
    {
      "hadith_no": "421",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عمرو بن عثمان الحمصي، حدثنا أبي، حدثنا حريز، عن راشد بن سعد، عن عاصم بن حميد السكوني، أنه سمع معاذ بن جبل، يقول ارتقبنا النبي صلى الله عليه وسلم في صلاة العتمة فأخر حتى ظن الظان أنه ليس بخارج والقائل منا يقول صلى فإنا لكذلك حتى خرج النبي صلى الله عليه وسلم فقالوا له كما قالوا فقال لهم ‏\"‏ أعتموا بهذه الصلاة فإنكم قد فضلتم بها على سائر الأمم ولم تصلها أمة قبلكم ‏\"‏ ‏.‏",
      "text_en": " Narrated Mu'adh ibn Jabal:                     We waited for the Prophet (ﷺ) to offer the night prayer. He delayed until people thought that he would not come out and some of us said that he had offered the prayer. At the moment when we were in this condition the Prophet (ﷺ) came out. People said to him as they were already saying. He said: Observe this prayer when it is dark, for by it you have been made superior to all the peoples, no people having observed it before you.",
      "chain": [
        "38429",
        "28388",
        "19909",
        "18471",
        "32"
      ]
    },
    {
      "hadith_no": "507",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن المثنى، عن أبي داود، ح وحدثنا نصر بن المهاجر، حدثنا يزيد بن هارون، عن المسعودي، عن عمرو بن مرة، عن ابن أبي ليلى، عن معاذ بن جبل، قال أحيلت الصلاة ثلاثة أحوال وأحيل الصيام ثلاثة أحوال وساق نصر الحديث بطوله واقتص ابن المثنى منه قصة صلاتهم نحو بيت المقدس قط قال الحال الثالث أن رسول الله صلى الله عليه وسلم قدم المدينة فصلى - يعني نحو بيت المقدس - ثلاثة عشر شهرا فأنزل الله تعالى هذه الآية ‏{‏ قد نرى تقلب وجهك في السماء فلنولينك قبلة ترضاها فول وجهك شطر المسجد الحرام وحيث ما كنتم فولوا وجوهكم شطره ‏}‏ فوجهه الله تعالى إلى الكعبة ‏.‏ وتم حديثه وسمى نصر صاحب الرؤيا قال فجاء عبد الله بن زيد رجل من الأنصار وقال فيه فاستقبل القبلة قال الله أكبر الله أكبر أشهد أن لا إله إلا الله أشهد أن لا إله إلا الله أشهد أن محمدا رسول الله أشهد أن محمدا رسول الله حى على الصلاة مرتين حى على الفلاح مرتين الله أكبر الله أكبر لا إله إلا الله ثم أمهل هنية ثم قام فقال مثلها إلا أنه قال زاد بعد ما قال ‏\"‏ حى على الفلاح ‏\"‏ ‏.‏ قد قامت الصلاة قد قامت الصلاة ‏.‏ قال فقال رسول الله صلى الله عليه وسلم ‏\"‏ لقنها بلالا ‏\"‏ ‏.‏ فأذن بها بلال وقال في الصوم قال فإن رسول الله صلى الله عليه وسلم كان يصوم ثلاثة أيام من كل شهر ويصوم يوم عاشوراء فأنزل الله تعالى ‏{‏ كتب عليكم الصيام كما كتب على الذين من قبلكم ‏}‏ إلى قوله ‏{‏ طعام مسكين ‏}‏ فكان من شاء أن يصوم صام ومن شاء أن يفطر ويطعم كل يوم مسكينا أجزأه ذلك وهذا حول فأنزل الله تعالى ‏{‏ شهر رمضان الذي أنزل فيه القرآن ‏}‏ إلى ‏{‏ أيام أخر ‏}‏ فثبت الصيام على من شهد الشهر وعلى المسافر أن يقضي وثبت الطعام للشيخ الكبير والعجوز اللذين لا يستطيعان الصوم وجاء صرمة وقد عمل يومه وساق الحديث ‏.‏",
      "text_en": " Narrated Mu'adh ibn Jabal:                     Prayer passed through three stages and fasting also passed through three stages. The narrator Nasr reported the rest of the tradition completely. The narrator, Ibn al-Muthanna, narrated the story of saying prayer facing in the direction of Jerusalem.  He said: The third stage is that the Messenger of Allah (ﷺ) came to Medina and prayed, i.e. facing Jerusalem, for thirteen months.  Then Allah, the Exalted, revealed the verse: \"We have seen thee turning thy face to Heaven (for guidance, O Muhammad). And now verily We shall make thee turn (in prayer) toward a qiblah which is dear to thee. So turn thy face toward the Inviolable Place of Worship, and ye (O Muslims), wherever ye may be, turn your face (when ye pray) toward it\" (ii.144). And Allah, the Reverend and the Majestic, turned (them) towards the Ka'bah. He (the narrator) completed his tradition.  The narrator, Nasr, mentioned the name of the person who had the dream, saying: And Abdullah ibn Zayd, a man from the Ansar, came. The same version reads: And he turned his face towards the qiblah and said: Allah is most great, Allah is most great; I testify that there is no god but Allah, I testify that there is no god but Allah; I testify that Muhammad is the Messenger of Allah, I testify that Muhammad is the Messenger of Allah; come to prayer (he pronounced it twice), come to salvation (he pronounced it twice); Allah is Most Great, Allah is most great. He then paused for a while, and then got up and pronounced in a similar way, except that after the phrase \"Come to salvation\" he added. \"The time for prayer has come, the time for prayer has come.\"  The Messenger of Allah (ﷺ) said: Teach it to Bilal, then pronounce the adhan (call to prayer) with the same words. As regards fasting, he said: The Messenger of Allah (ﷺ) used to fast for three days every month, and would fast on the tenth of Muharram. Then Allah, the Exalted, revealed the verse: \".......Fasting was prescribed for those before you, that ye may ward off (evil)......and for those who can afford it there is a ransom: the feeding of a man in need (ii.183-84). If someone wished to keep the fast, he would keep the fast; if someone wished to abandon the fast, he would feed an indigent every day; it would do for him. But this was changed. Allah, the Exalted, revealed: \"The month of Ramadan in which was revealed the Qur'an ..........(let him fast the same) number of other days\" (ii.185).  Hence the fast was prescribed for the one who was present in the month (of Ramadan) and the traveller was required to atone (for them); feeding (the indigent) was prescribed for the old man and woman who were unable to fast. (The narrator, Nasr, further reported): The companion Sirmah, came after finishing his day's work......and he narrated the rest of the tradition.",
      "chain": [
        "30170",
        "30002",
        "20472",
        "20724",
        "11381",
        "11196",
        "32"
      ]
    },
    {
      "hadith_no": "599",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبيد الله بن عمر بن ميسرة، حدثنا يحيى بن سعيد، عن محمد بن عجلان، حدثنا عبيد الله بن مقسم، عن جابر بن عبد الله، أن معاذ بن جبل، كان يصلي مع رسول الله صلى الله عليه وسلم العشاء ثم يأتي قومه فيصلي بهم تلك الصلاة ‏.‏",
      "text_en": " Jabir b. ‘Abd Allah said :                      Mu’adh b. Jabal would pray along with the Messenger of Allah (ﷺ)in the night prayer, then go and lead his people and lead them in the same prayer.",
      "chain": [
        "30024",
        "20031",
        "10616",
        "11521",
        "34",
        "32"
      ]
    },
    {
      "hadith_no": "600",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، حدثنا سفيان، عن عمرو بن دينار، سمع جابر بن عبد الله، يقول إن معاذا كان يصلي مع النبي صلى الله عليه وسلم ثم يرجع فيؤم قومه ‏.‏",
      "text_en": " Jabir b. ‘Abd Allah said :                      Mu’adh b. Jabal would pray along the prophet (ﷺ), then go and lead his people in prayer.",
      "chain": [
        "30175",
        "20012",
        "11081",
        "34",
        "32"
      ]
    },
    {
      "hadith_no": "704",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن إسماعيل البصري، حدثنا معاذ، حدثنا هشام، عن يحيى، عن عكرمة، عن ابن عباس، قال أحسبه عن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا صلى أحدكم إلى غير سترة فإنه يقطع صلاته الكلب والحمار والخنزير واليهودي والمجوسي والمرأة ويجزئ عنه إذا مروا بين يديه على قذفة بحجر ‏\"‏ ‏.‏ قال أبو داود في نفسي من هذا الحديث شىء كنت أذاكر به إبراهيم وغيره فلم أر أحدا جاء به عن هشام ولا يعرفه ولم أر أحدا يحدث به عن هشام وأحسب الوهم من ابن أبي سمينة - يعني محمد بن إسماعيل البصري مولى بني هاشم - والمنكر فيه ذكر المجوسي وفيه ‏\"‏ على قذفة بحجر ‏\"‏ ‏.‏ وذكر الخنزير وفيه نكارة ‏.‏ قال أبو داود ولم أسمع هذا الحديث إلا من محمد بن إسماعيل وأحسبه وهم لأنه كان يحدثنا من حفظه ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     Ikrimah reported on the authority of Ibn Abbas, saying: I think the Messenger of Allah (ﷺ) said: When one of you prays without a sutrah, a dog, an ass, a pig, a Jew, a Magian, and a woman cut off his prayer, but it will suffice if they pass in front of him at a distance of over a stone's throw.Abu Dawud said: There is something about this tradition in my heart. I used to discuss it with Ibrahim and others. I did not find anyone who narrated it from Hisham and knew it. I did not know anyone who reported it from Hisham and knew it. I did not know anyone who related it from Hisham. I think the confusion is on the part of Ibn Abi Saminah that is, Muhammad b. Isma'il al-Basri, the freed slave of Banu Hisham. In this tradition the mention of words \"a Magian\" is rejected; the mention of the words \"at a stone's throw\" and \"a pig\" is rejected.Abu Dawud said: I did not hear this tradition except from Muhammad b. Isma'il b. Samurrah and I think he was mistaken because he used to narrate to us from his memory.",
      "chain": [
        "34188",
        "32",
        "11065",
        "20031",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "1206",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Rules of Law about the Prayer during Journey - كتاب صلاة السفر",
      "chapter_no": "4",
      "text_ar": "حدثنا القعنبي، عن مالك، عن أبي الزبير المكي، عن أبي الطفيل، عامر بن واثلة أن معاذ بن جبل، أخبرهم أنهم، خرجوا مع رسول الله صلى الله عليه وسلم في غزوة تبوك فكان رسول الله صلى الله عليه وسلم يجمع بين الظهر والعصر والمغرب والعشاء فأخر الصلاة يوما ثم خرج فصلى الظهر والعصر جميعا ثم دخل ثم خرج فصلى المغرب والعشاء جميعا ‏.‏",
      "text_en": " Narrated Mu’adh bin Jabal :                     They (the Companions) proceeded on the expedition of Tabuk along with the Messenger of Allah (ﷺ). He combined the noon and afternoon prayers and the sunset and night prayers. One day he delayed the prayer and came out (of his dwelling) and combined the noon and the afternoon prayers. He then went it and then came out and combined the sunset and the night prayers.",
      "chain": [
        "20164",
        "20001",
        "11263",
        "3660",
        "32"
      ]
    },
    {
      "hadith_no": "1208",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Rules of Law about the Prayer during Journey - كتاب صلاة السفر",
      "chapter_no": "4",
      "text_ar": "حدثنا يزيد بن خالد بن يزيد بن عبد الله بن موهب الرملي الهمداني، حدثنا المفضل بن فضالة، والليث بن سعد، عن هشام بن سعد، عن أبي الزبير، عن أبي الطفيل، عن معاذ بن جبل، أن رسول الله صلى الله عليه وسلم كان في غزوة تبوك إذا زاغت الشمس قبل أن يرتحل جمع بين الظهر والعصر وإن يرتحل قبل أن تزيغ الشمس أخر الظهر حتى ينزل للعصر وفي المغرب مثل ذلك إن غابت الشمس قبل أن يرتحل جمع بين المغرب والعشاء وإن يرتحل قبل أن تغيب الشمس أخر المغرب حتى ينزل للعشاء ثم جمع بينهما ‏.‏ قال أبو داود رواه هشام بن عروة عن حسين بن عبد الله عن كريب عن ابن عباس عن النبي صلى الله عليه وسلم نحو حديث المفضل والليث ‏.‏",
      "text_en": " Narrated Mu'adh ibn Jabal:                     On the expedition to Tabuk if the sun had passed the meridian before the apostle of Allah (ﷺ) moved off, he combined the noon and the afternoon prayers; but if he moved off before the sun had passed the meridian, he delayed the noon prayer till he halted for the afternoon prayer. He acted similarly for the sunset prayer; if the sun set before he moved off, he combined the sunset and the night prayers, but if he moved off before sunset, he delayed the sunset prayer till he halted for the night prayer and then combined them.Abu Dawud said: Hisham b. 'Urwah narrated this tradition from Husain b. 'Abd Allah, from Kuraib on the authority of Ibn 'Abbas from the Prophet (ﷺ) like the tradition narrated by Mufaddal and al-Laith.",
      "chain": [
        "38715",
        "20378",
        "20023",
        "20519",
        "11263",
        "3660",
        "32"
      ]
    },
    {
      "hadith_no": "1220",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Rules of Law about the Prayer during Journey - كتاب صلاة السفر",
      "chapter_no": "4",
      "text_ar": "حدثنا قتيبة بن سعيد، أخبرنا الليث، عن يزيد بن أبي حبيب، عن أبي الطفيل، عامر بن واثلة عن معاذ بن جبل، أن النبي صلى الله عليه وسلم كان في غزوة تبوك إذا ارتحل قبل أن تزيغ الشمس أخر الظهر حتى يجمعها إلى العصر فيصليهما جميعا وإذا ارتحل بعد زيغ الشمس صلى الظهر والعصر جميعا ثم سار وكان إذا ارتحل قبل المغرب أخر المغرب حتى يصليها مع العشاء وإذا ارتحل بعد المغرب عجل العشاء فصلاها مع المغرب ‏.‏ قال أبو داود ولم يرو هذا الحديث إلا قتيبة وحده ‏.‏",
      "text_en": " Narrated Mu'adh ibn Jabal:                     The Prophet (ﷺ) was engaged in the Battle of Tabuk. If he moved off before the sun had declined, he would delay the noon prayer till he would combine it with the afternoon prayer and would offer them together. If he moved off after the sun had declined, he would combine the noon and afternoon prayers, and then he proceeded; if he moved off before the evening prayer, he would delay the evening prayer; he would offer it along with the night prayer, he would delay the evening prayer; he would offer it along with the night prayer. If he moved off after the evening prayer, he would offer the night prayer earlier and offer it along with the evening prayer.Abu Dawud said: This tradition has not been narrated by anyone except by Qutaibah.",
      "chain": [
        "30367",
        "20023",
        "11411",
        "32"
      ]
    },
    {
      "hadith_no": "1522",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا عبيد الله بن عمر بن ميسرة، حدثنا عبد الله بن يزيد المقرئ، حدثنا حيوة بن شريح، قال سمعت عقبة بن مسلم، يقول حدثني أبو عبد الرحمن الحبلي، عن الصنابحي، عن معاذ بن جبل، أن رسول الله صلى الله عليه وسلم أخذ بيده وقال ‏\"‏ يا معاذ والله إني لأحبك والله إني لأحبك ‏\"‏ ‏.‏ فقال ‏\"‏ أوصيك يا معاذ لا تدعن في دبر كل صلاة تقول اللهم أعني على ذكرك وشكرك وحسن عبادتك ‏\"‏ ‏.‏ وأوصى بذلك معاذ الصنابحي وأوصى به الصنابحي أبا عبد الرحمن ‏.‏",
      "text_en": " Mu'adh b. Jabal reported that the Messenger of Allah (ﷺ) caught his hand and said:                      By Allah, I love you, Mu'adh. I give some instruction to you. Never leave to recite this supplication after every (prescribed) prayer: \"O Allah, help me in remembering You, in giving You thanks, and worshipping You well.\"Mu'adh willed this supplication to the narrator al-Sunabihi and al-Sunabihi to 'Abu Abd al-Rahman.",
      "chain": [
        "30024",
        "23033",
        "26010",
        "16076",
        "10938",
        "5144",
        "32"
      ]
    },
    {
      "hadith_no": "1576",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا النفيلي، حدثنا أبو معاوية، عن الأعمش، عن أبي وائل، عن معاذ، أن النبي صلى الله عليه وسلم لما وجهه إلى اليمن أمره أن يأخذ من البقر من كل ثلاثين تبيعا أو تبيعة ومن كل أربعين مسنة ومن كل حالم - يعني محتلما - دينارا أو عدله من المعافر ثياب تكون باليمن ‏.‏",
      "text_en": " Narrated Mu'adh ibn Jabal:                     When the Prophet (ﷺ) sent him to the Yemen, he ordered him to take a male or a female calf a year old for every thirty cattle and a cow in its third year for every forty, and one dinar for every adult (unbeliever as a poll-tax) or cloths of equivalent value manufactured in the Yemen.",
      "chain": [
        "30352",
        "20354",
        "11060",
        "11353",
        "32"
      ]
    },
    {
      "hadith_no": "1577",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا عثمان بن أبي شيبة، والنفيلي، وابن المثنى، قالوا حدثنا أبو معاوية، حدثنا الأعمش، عن إبراهيم، عن مسروق، عن معاذ، عن النبي صلى الله عليه وسلم مثله ‏.‏",
      "text_en": " This tradition has also been transmitted by Mu’adh through a different chain of narrators to the same effect.",
      "chain": [
        "30203",
        "30352",
        "30170",
        "20354",
        "11060",
        "11051",
        "11018",
        "32"
      ]
    },
    {
      "hadith_no": "1578",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا هارون بن زيد بن أبي الزرقاء، حدثنا أبي، عن سفيان، عن الأعمش، عن أبي وائل، عن مسروق، عن معاذ بن جبل، قال بعثه النبي صلى الله عليه وسلم إلى اليمن فذكر مثله لم يذكر ثيابا تكون باليمن ‏.‏ ولا ذكر يعني محتلما ‏.‏ قال أبو داود ورواه جرير ويعلى ومعمر وشعبة وأبو عوانة ويحيى بن سعيد عن الأعمش عن أبي وائل عن مسروق - قال يعلى ومعمر - عن معاذ مثله ‏.‏",
      "text_en": " Narrated Mu’adh bin Jabal :                     that the Prophet (ﷺ) sent him to Yemen. He then narrated the tradition something similar. He did not mention in this version cloths made in the Yemen nor did he refer to adult (unbelievers).Abu Dawud said This tradition has been transmitted by Jarir, Ya’la, Ma’mar, Abu ‘Awanahand Yahya bin Sa’id from Al A’mash, from Abu Wa’il, on the authority of Masruq, and from Ya’la and Ma’mar on the authority of Mu’adh to the same effect.",
      "chain": [
        "38673",
        "20005",
        "11060",
        "11353",
        "11018",
        "32"
      ]
    },
    {
      "hadith_no": "1599",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا الربيع بن سليمان، حدثنا ابن وهب، عن سليمان، - يعني ابن بلال - عن شريك بن عبد الله بن أبي نمر، عن عطاء بن يسار، عن معاذ بن جبل، أن رسول الله صلى الله عليه وسلم بعثه إلى اليمن فقال ‏\"‏ خذ الحب من الحب والشاة من الغنم والبعير من الإبل والبقرة من البقر ‏\"‏ ‏.‏ قال أبو داود شبرت قثاءة بمصر ثلاثة عشر شبرا ورأيت أترجة على بعير بقطعتين قطعت وصيرت على مثل عدلين ‏.‏",
      "text_en": " Narrated Mu'adh ibn Jabal:                     When the Messenger of Allah (ﷺ) sent him to the Yemen, he said (to him): Collect corn from the corn, sheep from the sheep, camel from the camels, and cow from the cows.Abu Dawud said: In Egypt I saw a cucumber thirteen spans in length and a citron cut into two pieces loaded on a camel like two loads.",
      "chain": [
        "30583",
        "20029",
        "20160",
        "11858",
        "11020",
        "32"
      ]
    },
    {
      "hadith_no": "2515",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا حيوة بن شريح الحضرمي، حدثنا بقية، حدثني بحير، عن خالد بن معدان، عن أبي بحرية، عن معاذ بن جبل، عن رسول الله صلى الله عليه وسلم أنه قال ‏:‏ ‏\"‏ الغزو غزوان فأما من ابتغى وجه الله، وأطاع الإمام، وأنفق الكريمة، وياسر الشريك، واجتنب الفساد، فإن نومه ونبهه أجر كله وأما من غزا فخرا ورياء وسمعة، وعصى الإمام، وأفسد في الأرض، فإنه لم يرجع بالكفاف ‏\"‏ ‏.‏",
      "text_en": " Narrated Mu'adh ibn Jabal:                     The Prophet (ﷺ) said: Fighting is of two kinds: The one who seeks Allah's favour, obeys the leader, gives the property he values, treats his associates gently and avoids doing mischief, will have the reward for all the time whether he is asleep or awake; but the one who fights in a boasting spirit, for the sake of display and to gain a reputation, who disobeys the leader and does mischief in the earth will not return credit or without blame.",
      "chain": [
        "26010",
        "20644",
        "11422",
        "19921",
        "32"
      ]
    },
    {
      "hadith_no": "2541",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا هشام بن خالد أبو مروان، وابن المصفى، قالا حدثنا بقية، عن ابن ثوبان، عن أبيه، يرد إلى مكحول إلى مالك بن يخامر أن معاذ بن جبل، حدثهم أنه، سمع رسول الله صلى الله عليه وسلم يقول ‏:‏ ‏\"‏ من قاتل في سبيل الله فواق ناقة فقد وجبت له الجنة، ومن سأل الله القتل من نفسه صادقا ثم مات أو قتل فإن له أجر شهيد ‏\"‏ ‏.‏ زاد ابن المصفى من هنا ‏:‏ ‏\"‏ ومن جرح جرحا في سبيل الله أو نكب نكبة فإنها تجيء يوم القيامة كأغزر ما كانت، لونها لون الزعفران، وريحها ريح المسك، ومن خرج به خراج في سبيل الله فإن عليه طابع الشهداء ‏\"‏ ‏.‏",
      "text_en": " Narrated Mu'adh ibn Jabal:                     The Messenger of Allah (ﷺ) said: If anyone fights in Allah's path as long as the time between two milkings of a she-camel, Paradise will be assured for him. If anyone sincerely asks Allah for being killed and then dies or is killed, there will be a reward of a martyr for him. Ibn al-Musaffa added from here: If anyone is wounded in Allah's path, or suffers a misfortune, it will come on the Day of resurrection as copious as possible, its colour saffron, and its odour musk; and if anyone suffers from ulcers while in Allah's path, he will have on him the stamp of the martyrs.",
      "chain": [
        "37540",
        "20644",
        "32"
      ]
    },
    {
      "hadith_no": "2559",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا هناد بن السري، عن أبي الأحوص، عن أبي إسحاق، عن عمرو بن ميمون، عن معاذ، قال كنت ردف رسول الله صلى الله عليه وسلم على حمار يقال له عفير ‏.‏",
      "text_en": " Mu’adh said “I was seated behind the Prophet (ﷺ) on a donkey that was called ‘Ufair”.",
      "chain": [
        "30480",
        "20327",
        "11049",
        "11382",
        "32"
      ]
    },
    {
      "hadith_no": "2893",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Shares of Inheritance (Kitab Al-Fara'id) - كتاب الفرائض",
      "chapter_no": "19",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا أبان، حدثنا قتادة، حدثني أبو حسان، عن الأسود بن يزيد، أن معاذ بن جبل، ورث أختا وابنة فجعل لكل واحدة منهما النصف وهو باليمن ونبي الله صلى الله عليه وسلم يومئذ حى ‏.‏",
      "text_en": " Narrated Al-Aswad b. Yazid:                     Mu'adh b. Jabal gave shares of inheritance to a sister and a daughter. He gave each of them half. He was at Yemen while the Prophet (ﷺ) was alive.",
      "chain": [
        "20040",
        "20577",
        "11019",
        "11054",
        "32"
      ]
    },
    {
      "hadith_no": "2912",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Shares of Inheritance (Kitab Al-Fara'id) - كتاب الفرائض",
      "chapter_no": "19",
      "text_ar": "حدثنا مسدد، حدثنا عبد الوارث، عن عمرو بن أبي حكيم الواسطي، حدثنا عبد الله بن بريدة، أن أخوين، اختصما إلى يحيى بن يعمر يهودي ومسلم فورث المسلم منهما وقال حدثني أبو الأسود أن رجلا حدثه أن معاذا حدثه قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ الإسلام يزيد ولا ينقص ‏\"‏ ‏.‏ فورث المسلم ‏.‏",
      "text_en": " Narrated Mu'adh ibn Jabal:                     I heard the Messenger of Allah (ﷺ) say: Islam increases and does not diminish. He, therefore, appointed a Muslim heir (of a non-Muslim).",
      "chain": [
        "30175",
        "20258",
        "11432",
        "11114",
        "32"
      ]
    }
  ],
  "total_hadiths": 116
}