{
  "id": "32032",
  "name": "Muhammad bin 'Uthman bin Khalid محمد بن عثمان بن خالد",
  "full_name": "Muhammad bin 'Uthman bin Khalid محمد بن عثمان بن خالد",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Sadooq/Delusion",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "241",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina",
      "Makkah"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq/Delusion] [ س  ق  -  صدوق يخطئ ]"
    ],
    "tags": [
      "B.Umayya",
      "al-Madni",
      "Makkah"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20509",
      "name": "'Abdur Rahman bin Abi al-Zanad عبد الرحمن بن أبي الزناد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20165",
      "name": "'Abdul 'Aziz bin Abi Hazim عبد العزيز بن أبي حازم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "30108",
      "name": "Muhammad bin 'Ubaid bin Maymun al-Taban محمد بن عبيد بن ميمون التبان",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "22076",
      "name": "Salah bin Qadama bin Ibrahim صالح بن قدامة بن إبراهيم بن محمد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "students": [
    {
      "id": "30004",
      "name": "Ibn Maja ابن ماجة",
      "grade": "3rd Century AH [12th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "14",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا أبو مروان، محمد بن عثمان العثماني حدثنا إبراهيم بن سعد بن إبراهيم بن عبد الرحمن بن عوف، عن أبيه، عن القاسم بن محمد، عن عائشة، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ من أحدث في أمرنا هذا ما ليس منه فهو رد ‏\"‏ ‏.‏",
      "text_en": " Aishah narrated that:                     The Messenger of Allah (ﷺ) said: \"Whoever innovates something in this matter of ours (i.e. Islam) that is not part of it, will have it rejected.\"",
      "chain": [
        "32032",
        "20150",
        "11063",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "114",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا أبو مروان، محمد بن عثمان العثماني حدثنا أبي عثمان بن خالد، عن عبد الرحمن بن أبي الزناد، عن أبيه، عن الأعرج، عن أبي هريرة، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ لكل نبي رفيق في الجنة ورفيقي فيها عثمان بن عفان ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     The Messenger of Allah said: \"Every Prophet will have a friend in Paradise, and my friend there will be 'Uthman bin 'Affan.\"",
      "chain": [
        "32032",
        "20509",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "115",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا أبو مروان، محمد بن عثمان العثماني حدثنا أبي عثمان بن خالد، عن عبد الرحمن بن أبي الزناد، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن النبي  صلى الله عليه وسلم  لقي عثمان عند باب المسجد فقال ‏\"‏ يا عثمان هذا جبريل أخبرني أن الله قد زوجك أم كلثوم بمثل صداق رقية على مثل صحبتها ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     The Prophet met 'Uthman at the door of the mosque and said: \"O 'Uthman! Jibril has told me that Allah married you to Umm Kulthum for a dowry like that of Ruqayyah, provided that you treat her as you treated Ruqayyah.\"",
      "chain": [
        "32032",
        "20509",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "211",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا أبو مروان، محمد بن عثمان العثماني حدثنا عبد العزيز بن أبي حازم، عن العلاء بن عبد الرحمن، عن أبيه، عن أبي هريرة، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ من دعا إلى هدى كان له من الأجر مثل أجور من اتبعه لا ينقص ذلك من أجورهم شيئا ومن دعا إلى ضلالة فعليه من الإثم مثل آثام من اتبعه لا ينقص ذلك من آثامهم شيئا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     The Messenger of Allah said: \"Whoever calls people to true guidance, will have a reward equal to that of those who follow him, without that detracting from their reward in the slightest. And whoever calls people to misguidance, will have a (burden of) sin equal to that of those who follow him, without that detracting from their sins in the slightest.'\"",
      "chain": [
        "32032",
        "20165",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "223",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا أبو مروان، محمد بن عثمان العثماني حدثنا إبراهيم بن سعد، عن ابن شهاب، عن عامر بن واثلة أبي الطفيل، أن نافع بن عبد الحارث، لقي عمر بن الخطاب بعسفان - وكان عمر استعمله على مكة - فقال عمر من استخلفت على أهل الوادي قال استخلفت عليهم ابن أبزى ‏.‏ قال ومن ابن أبزى قال رجل من موالينا ‏.‏ قال عمر فاستخلفت عليهم مولى قال إنه قارئ لكتاب الله تعالى عالم بالفرائض قاض ‏.‏ قال عمر أما إن نبيكم  صلى الله عليه وسلم  قال ‏\"‏ إن الله يرفع بهذا الكتاب أقواما ويضع به آخرين ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Nafi' bin 'Abdul-Harith met 'Umar bin Khattab in 'Usfan, when 'Umar had appointed him as his governer in Makkah.:                     'Umar asked: \"Whom have you appointed as your deputy over the people of the valley?\" He said: \"I have appointed Ibn Abza over them.\" 'Umar said: \"Who is Ibn Abza?\" Nafi' said: \"One of our freed slaves.\" 'Umar said: \"Have you appointed a freed slave over them?\" Nafi' said: \"He has great knowledge of the Book of Allah, is well versed in the rules of inheritance (Fara'id) and is a (good) judge.\" 'Umar said: \"Did not your prophet say: 'Allah raises some people (in status) because of this book and brings others low because of it?'\"",
      "chain": [
        "32032",
        "20150",
        "11013"
      ]
    },
    {
      "hadith_no": "274",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا أبو مروان العثماني، محمد بن عثمان حدثنا إبراهيم بن سعد، عن الزهري، عن عبد الرحمن بن هرمز الأعرج، أنه سمع أبا هريرة، يقول والله لولا آيتان في كتاب الله تعالى ما حدثت عنه - يعني عن النبي  صلى الله عليه وسلم  - شيئا أبدا لولا قول الله ‏{إن الذين يكتمون ما أنزل الله من الكتاب}‏ إلى آخر الآيتين ‏.‏",
      "text_en": " It was narrated that 'Abdur-Rahman bin Hurmuz Al-A'raj heard Abu Hurairah say:                     \"By Allah, were it not for two Verses in the Book of Allah, I would never have narrated anything from him, meaning from the Prophet, were it not for the Words of Allah: Verily, those who conceal what Allah has sent down of the Book, and purchase a small gain therewith (of worldly things), they eat into their bellies nothing but fire. Allah will not speak to them on the Day of Resurrection, nor purify them, and theirs will be a painful torment. Those are they who have purchased error at the price of guidance, and torment at the price of forgiveness. So how bold they are (for evil deeds which will push them) to the Fire.'\"",
      "chain": [
        "32032",
        "20150",
        "11013",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "629",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو مروان العثماني، محمد بن عثمان حدثنا عبد العزيز بن محمد، عن يزيد بن عبد الله بن الهاد، عن عبد الله بن خباب، عن أبي سعيد الخدري، أنه كان تصيبه الجنابة بالليل فيريد أن ينام فأمره رسول الله  صلى الله عليه وسلم  أن يتوضأ ثم ينام ‏.‏",
      "text_en": " It was narrated from Abu Sa'eed Khudri that:                     He used to become sexually impure at night, then he would want to sleep. The Messenger of Allah told him to perform ablution and then go to sleep.",
      "chain": [
        "32032",
        "20167",
        "11234",
        "11182",
        "38"
      ]
    },
    {
      "hadith_no": "775",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book On The Mosques And The Congregations - كتاب المساجد والجماعات",
      "chapter_no": "4",
      "text_ar": "حدثنا أبو مروان العثماني، محمد بن عثمان حدثنا إبراهيم بن سعد، عن ابن شهاب، عن سعيد بن المسيب، وأبي، سلمة عن أبي هريرة، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ إذا أقيمت الصلاة فلا تأتوها وأنتم تسعون وأتوها تمشون وعليكم السكينة فما أدركتم فصلوا وما فاتكم فأتموا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     The Messenger of Allah said: \"When the Iqamah is called for the prayer, do not come running. Come walking with tranquility. Whatever you catch up with, pray, and whatever you miss, complete it.\"",
      "chain": [
        "32032",
        "20150",
        "11013",
        "11002",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "787",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book On The Mosques And The Congregations - كتاب المساجد والجماعات",
      "chapter_no": "4",
      "text_ar": "حدثنا أبو مروان، محمد بن عثمان العثماني حدثنا إبراهيم بن سعد، عن ابن شهاب، عن سعيد بن المسيب، عن أبي هريرة، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ فضل الجماعة على صلاة أحدكم وحده خمس وعشرون جزءا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     The Messenger of Allah said: \"The prayer in congregation is twenty-five times more virtuous than the prayer of anyone of you on his own.\"",
      "chain": [
        "32032",
        "20150",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "1068",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو مروان العثماني، حدثنا إبراهيم بن سعد، عن ابن شهاب، عن سعيد بن المسيب، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من أكل من هذه الشجرة الثوم فلا يؤذينا بها في مسجدنا هذا ‏\"‏ ‏.‏ قال إبراهيم وكان أبي يزيد فيه الكراث والبصل عن النبي  صلى الله عليه وسلم  ‏.‏ يعني أنه يزيد على حديث أبي هريرة في الثوم ‏.‏",
      "text_en": " It wasnarrated that Abu Hurairah said:                      “The Messenger of Allah (ﷺ)said: ‘Whoever eats from this plant; garlic, let him not annoy uswithit in this mosque of ours.’”",
      "chain": [
        "32032",
        "20150",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "1208",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو مروان، محمد بن عثمان العثماني حدثنا إبراهيم بن سعد، عن أبيه، عن حفص بن عاصم، عن عبد الله بن مالك ابن بحينة، قال مر النبي  صلى الله عليه وسلم  برجل وقد أقيمت صلاة الصبح وهو يصلي فكلمه بشىء لا أدري ما هو فلما انصرف أحطنا به نقول له ماذا قال لك رسول الله  صلى الله عليه وسلم  قال قال لي ‏\"‏ يوشك أحدكم أن يصلي الفجر أربعا ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Abdullah bin Malik bin Buhainah said:                      “TheProphet(ﷺ) passed by a man who was praying when the Iqamah for Subhprayerhad been called, and he said something to him, I do not knowwhat hesaid. When he finished, we surrounded the man and asked him:‘Whatdid the Messenger of Allah (ﷺ) say to you?’ He said: ‘He saidto me: “Soon one of you will pray Fajr with four Rak’ah.’”",
      "chain": [
        "32032",
        "20150",
        "11063",
        "11420",
        "932"
      ]
    },
    {
      "hadith_no": "1285",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو مروان العثماني، حدثنا عبد العزيز بن أبي حازم، عن هشام بن عروة، عن أبيه، عن عائشة، قالت ما رأيت رسول الله  صلى الله عليه وسلم  يصلي في شىء من صلاة الليل إلا قائما حتى دخل في السن فجعل يصلي جالسا حتى إذا بقي عليه من قراءته أربعون آية أو ثلاثون آية قام فقرأها وسجد ‏.‏",
      "text_en": " It wasnarrated that ‘Aishah said:                      “I did not see the Messenger ofAllah(ﷺ) offer any of the night prayers in any way other thanstanding,until he became old. Then he started to pray sitting downuntil, whenthere were thirty or forty Verses left of his recitation,he wouldstand up and recite them, and prostrate.”",
      "chain": [
        "32032",
        "20165",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1432",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن نمير، ح وحدثنا أبو مروان، محمد بن عثمان العثماني حدثنا عبد العزيز بن أبي حازم، جميعا عن هشام بن عروة، عن أبيه، عن عائشة، قالت قال النبي  صلى الله عليه وسلم  ‏\"‏ إذا نعس أحدكم فليرقد حتى يذهب عنه النوم فإنه لا يدري إذا صلى وهو ناعس لعله يذهب يستغفر فيسب نفسه ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Aishah said:                      “The Prophet (ﷺ) said: ‘Ifanyoneof you becomes drowsy, let him sleep until he feels refreshed,for hedoes not know, if he prays when he feels drowsy, he may want tosaywords seeking forgiveness but (instead) he ends up cursinghimself.’”",
      "chain": [
        "30201",
        "20331",
        "32032",
        "20165",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1688",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو مروان العثماني، حدثنا إبراهيم بن سعد، عن أبيه، عن عروة، عن عائشة، قالت سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ ما من نبي يمرض إلا خير بين الدنيا والآخرة ‏\"‏ ‏.‏ قالت فلما كان مرضه الذي قبض فيه أخذته بحة فسمعته يقول ‏\"‏ مع الذين أنعم الله عليهم من النبيين والصديقين والشهداء والصالحين ‏\"‏ ‏.‏ فعلمت أنه خير ‏.‏",
      "text_en": " It wasnarrated that ‘Aishah said:                      “I heard the Messenger of Allah(ﷺ)say: ‘There is no Prophet who fell sick but he was given thechoicebetween this world and the Hereafter.’ She said: ‘When hebecamesick with the illness that would be his last, (his voice)becamehoarse and I heard him say, “In the company of those on whomAllahhas bestowed His grace, of the Prophets, the true believers, themartyrs, and the righteous.’” [4:69] Then I knew that he had beengiven the choice.”",
      "chain": [
        "32032",
        "20150",
        "11063",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1723",
      "source": " Sunan Ibn Majah ",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا أبو مروان، محمد بن عثمان العثماني حدثنا إبراهيم بن سعد، عن الزهري، عن سالم بن عبد الله، عن ابن عمر، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إذا رأيتم الهلال فصوموا وإذا رأيتموه فأفطروا ‏.‏ فإن غم عليكم فاقدروا له ‏\"‏ ‏.‏ قال وكان ابن عمر يصوم قبل الهلال بيوم ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Umar that the Messenger of Allah (ﷺ)said:                     ‘When you see the new crescent, fast, and when you see it, stopfasting. If it is cloudy then calculate it (as thirty days).” Ibn‘Umar used to fast one day before the new crescent was seen.",
      "chain": [
        "32032",
        "20150",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "1724",
      "source": " Sunan Ibn Majah ",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا أبو مروان العثماني، حدثنا إبراهيم بن سعد، عن الزهري، عن سعيد بن المسيب، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إذا رأيتم الهلال فصوموا وإذا رأيتموه فأفطروا فإن غم عليكم فصوموا ثلاثين يوما ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                     “When you see the new crescent then fast, and when you see itthenstop fasting. If it is cloudy then fast thirty days.”",
      "chain": [
        "32032",
        "20150",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "1858",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters Regarding Zakat - كتاب الزكاة",
      "chapter_no": "8",
      "text_ar": "حدثنا أبو مروان، محمد بن عثمان العثماني حدثنا عبد العزيز بن أبي حازم، عن العلاء بن عبد الرحمن، عن أبيه، عن أبي هريرة، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ تأتي الإبل التي لم تعط الحق منها تطأ صاحبها بأخفافها وتأتي البقر والغنم تطأ صاحبها بأظلافها وتنطحه بقرونها ويأتي الكنز شجاعا أقرع فيلقى صاحبه يوم القيامة فيفر منه صاحبه مرتين ثم يستقبله فيفر صاحبه فيقول مالي ولك ‏.‏ فيقول أنا كنزك أنا كنزك ‏.‏ فيتقيه بيده فيلقمها ‏.‏",
      "text_en": " 'Abu Hurairah narrated that:                     the Messenger of Allah said: “The camels on which the dues (i.e. Zakat) were not paid will come, trampling their owners with their hooves. And cattle and sheep will come and trample at their owners with their hooves and butt them with their horns, And hoarded treasure will come in the form of a bald-headed snale, and will meet its owner on the Day of Resurrection. Its owner will flee from it two time, then it will come to him and he will flee again, and will say: 'What do I have to do with you?' and it will say: 'I am your hoarded treasure, I am your hoarded treasure.' He will try to shield himself with this hand and it will devour it.”",
      "chain": [
        "32032",
        "20165",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "1921",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو مروان، محمد بن عثمان العثماني حدثنا إبراهيم بن سعد، عن الزهري، عن سعيد بن المسيب، عن سعد، قال لقد رد رسول الله  صلى الله عليه وسلم  على عثمان بن مظعون التبتل ولو أذن له لاختصينا ‏.‏",
      "text_en": " It was narrated that:                     Sa'd said: “The Messenger of Allah disapproved of Uthman bin Maz'un's desire to remain celibate; if he had given him permission, we would have gotten ourselves castrated.”",
      "chain": [
        "32032",
        "20150",
        "11013",
        "11002",
        "9"
      ]
    },
    {
      "hadith_no": "2001",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو مروان، محمد بن عثمان العثماني حدثنا إبراهيم بن سعد، عن ابن شهاب، حدثني عبيد الله بن عبد الله، عن أبي سعيد الخدري، قال سأل رجل رسول الله  صلى الله عليه وسلم  عن العزل فقال ‏\"‏ أوتفعلون لا عليكم أن لا تفعلوا فإنه ليس من نسمة قضى الله لها أن تكون إلا هي كائنة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Sa'eed Al-Kudri said:                     “A man asked the Messenger of about coitus interruptus. He said: 'Do you do that? If you do not do so, it will not harm; for there is no soul that (SWT) has decreed will exist but it will come into being.' “",
      "chain": [
        "32032",
        "20150",
        "11013",
        "11004",
        "38"
      ]
    },
    {
      "hadith_no": "2144",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Divorce - كتاب الطلاق",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو مروان، محمد بن عثمان العثماني حدثنا إبراهيم بن سعد، عن ابن شهاب، عن سهل بن سعد الساعدي، قال جاء عويمر إلى عاصم بن عدي فقال سل لي رسول الله  صلى الله عليه وسلم  أرأيت رجلا وجد مع امرأته رجلا فقتله أيقتل به أم كيف يصنع فسأل عاصم رسول الله  صلى الله عليه وسلم  عن ذلك فعاب رسول الله  صلى الله عليه وسلم  المسائل ‏.‏ ثم لقيه عويمر فسأله فقال ما صنعت فقال صنعت أنك لم تأتني بخير سألت رسول الله  صلى الله عليه وسلم  فعاب المسائل فقال عويمر والله لآتين رسول الله  صلى الله عليه وسلم  ولأسألنه ‏.‏ فأتى رسول الله  صلى الله عليه وسلم  فوجده قد أنزل عليه فيهما فلاعن بينهما فقال عويمر والله لئن انطلقت بها يا رسول الله لقد كذبت عليها ‏.‏ قال ففارقها قبل أن يأمره رسول الله  صلى الله عليه وسلم  فصارت سنة في المتلاعنين ثم قال النبي  صلى الله عليه وسلم  ‏\"‏ انظروها فإن جاءت به أسحم أدعج العينين عظيم الأليتين فلا أراه إلا قد صدق عليها وإن جاءت به أحيمر كأنه وحرة فلا أراه إلا كاذبا ‏\"‏ ‏.‏ قال فجاءت به على النعت المكروه ‏.‏",
      "text_en": " It was narrated that Sahl bin Sa'd As-Sa'idi said:                     \"Uwaimir came to 'Asim bin 'Adi and said: 'Ask the Messenger of Ailah (ﷺ) for me: \"Do you think that if a man finds another man with his wife and kills him, he should be killed in retaliation, or what should he do?\" 'Asim asked the Messenger of Allah (ﷺ) about that, and the Messenger of Allah (ﷺ) disapproved of the question. Then 'Uwaimir met him ('Asim) and asked him about that, saying: 'What did you do?’ He said: I did that and you have not brought me any good. I asked the Messenger of Allah (ﷺ) and he disapproved of this question.’ Uwaimir said: 'By Allah, I will go to the Messenger of Allah (ﷺ) myself and ask him.' So he went to the Messenger of Allah (ﷺ) and found that Qur'an had been revealed concerning them, and the Prophet (ﷺ) told them to go through the procedure of Li'an. 'Uwaimir said: 'O Messenger of Allah, (ﷺ) by Allah if I take her back, I would have been telling lies about her.' So he left her before the Messenger of Allah (ﷺ) told him to do so, and that became the Sunnah for two who engage in the procedure of Li'an. Then the Prophet (ﷺ) said: 'Wait and see. If she gives birth to a child who is black in color with widely-spaced dark eyes and large buttocks, then I think that he was telling the truth about her, but if she gives birth to a child with a red complexion like a Wahrah,[1] then I think that he was lying.' Then she gave birth to a child with features resembling those of the man concerning whom she was accused.\"",
      "chain": [
        "32032",
        "20150",
        "11013",
        "399"
      ]
    },
    {
      "hadith_no": "2322",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا أبو مروان، محمد بن عثمان العثماني حدثنا محمد بن ميمون المدني، عن عبد الرحمن بن أبي الزناد، عن أبيه، عن الأعرج، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ اللهم بارك لأمتي في بكورها يوم الخميس ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:                     \"O Allah, bless my nation early in the morning of Thursday.' \"",
      "chain": [
        "32032",
        "30108",
        "20509",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "2506",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Charity - كتاب الصدقات",
      "chapter_no": "15",
      "text_ar": "حدثنا أبو مروان العثماني، حدثنا إبراهيم بن سعد، عن أبيه، عن عمر بن أبي سلمة، عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ نفس المؤمن معلقة بدينه حتى يقضى عنه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) that the Messenger of Allah (ﷺ) said:                     “The soul of the believer is attached to his debt until it is paid off.”",
      "chain": [
        "32032",
        "20150",
        "11063",
        "246",
        "101",
        "13"
      ]
    },
    {
      "hadith_no": "2683",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا أبو مروان العثماني، حدثنا إبراهيم بن سعد، عن ابن شهاب، أن عمرة، أخبرته عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تقطع اليد إلا في ربع دينار فصاعدا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Aishah that the Messenger of Allah (S.A.W.) said:                     “Do not cut off (the thief's hand) except for something worth one quarter of a Dinar or more",
      "chain": [
        "32032",
        "20150",
        "11013",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "2820",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Wills - كتاب الوصايا",
      "chapter_no": "22",
      "text_ar": "حدثنا أبو مروان، محمد بن عثمان العثماني حدثنا عبد العزيز بن أبي حازم، عن العلاء بن عبد الرحمن، عن أبيه، عن أبي هريرة، أن رجلا، سأل رسول الله صلى الله عليه وسلم قال إن أبي مات وترك مالا ولم يوص فهل يكفر عنه أن تصدقت عنه قال ‏\"‏ نعم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that a man asked the Messenger of Allah (ﷺ):                     “My father died and left behind wealth, but he did not make a will. Will it expiate for him if I give charity on his behalf?” He said: “Yes.”",
      "chain": [
        "32032",
        "20165",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "3019",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو مروان، محمد بن عثمان العثماني حدثنا عبد العزيز الدراوردي، عن عبد الرحمن بن الحارث بن عياش بن أبي ربيعة المخزومي، عن حكيم بن حكيم بن عباد بن حنيف الأنصاري، عن نافع بن جبير، عن عبد الله بن عباس، أن امرأة، من خثعم جاءت النبي  صلى الله عليه وسلم  فقالت يا رسول الله إن أبي شيخ كبير قد أفند وأدركته فريضة الله على عباده في الحج ولا يستطيع أداءها فهل يجزئ عنه أن أؤديها عنه قال رسول الله  صلى الله عليه وسلم  ‏\"‏ نعم ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Abdullah bin ‘Abbas that a woman from Khath’amcame to the Prophet (ﷺ) and said:                      “O Messenger of Allah, myfatheris an old man who has become weak, and now the command ofAllah hascome for His slaves to perform Hajj, but he cannot do it.Will itdischarge his duty if I perform it on his behalf?” TheMessenger ofAllah (ﷺ) said: “Yes.”",
      "chain": [
        "32032",
        "20167",
        "19803",
        "11059",
        "17"
      ]
    },
    {
      "hadith_no": "3232",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو مروان، محمد بن عثمان العثماني حدثنا عبد العزيز بن أبي حازم، عن العلاء بن عبد الرحمن، عن أبيه، عن أبي هريرة، أن النبي  صلى الله عليه وسلم  قال ‏\"‏ اللهم إن إبراهيم خليلك ونبيك وإنك حرمت مكة على لسان إبراهيم اللهم وأنا عبدك ونبيك وإني أحرم ما بين لابتيها ‏\"‏ ‏.‏ قال أبو مروان لابتيها حرتى المدينة ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Prophet (ﷺ) said:                      “OAllah!Ibrahim was Your Friend and Prophet, and You declared Makkah tobesacred through Ibrahim. O Allah! I am Your slave and Prophet, and Ideclare what is between its two lava fields to be sacred.”",
      "chain": [
        "32032",
        "20165",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "3784",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو مروان، محمد بن عثمان العثماني حدثنا عبد العزيز بن أبي حازم، عن العلاء بن عبد الرحمن، عن أبيه، عن أبي هريرة، قال سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ قال الله عز وجل قسمت الصلاة بيني وبين عبدي شطرين فنصفها لي ونصفها لعبدي ولعبدي ما سأل ‏\"‏ ‏.‏ قال فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ اقرءوا يقول العبد ‏{الحمد لله رب العالمين}‏ فيقول الله عز وجل حمدني عبدي ولعبدي ما سأل ‏.‏ فيقول ‏{الرحمن الرحيم}‏ فيقول أثنى على عبدي ولعبدي ما سأل ‏.‏ يقول ‏{مالك يوم الدين }‏ فيقول الله مجدني عبدي فهذا لي وهذه الآية بيني وبين عبدي نصفين يقول العبد ‏{إياك نعبد وإياك نستعين}‏ يعني فهذه بيني وبين عبدي ولعبدي ما سأل وآخر السورة لعبدي يقول العبد ‏{اهدنا الصراط المستقيم * صراط الذين أنعمت عليهم غير المغضوب عليهم ولا الضالين}‏ فهذا لعبدي ولعبدي ما سأل ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said, 'I heard the Messenger of Allah(ﷺ) say':                     \"Allah said: 'I have divided the prayer between Myself and My slave into two halves, and My slave shall have what he has asked for.'When the slave says: 'Al-hamdulillah i rabbil Alameen (All the praise is to Allah, the Lord of all that exists),' Allah says:'My slave has praised Me, and My slave shall have what he has asked for.' And when he says: 'Ar-Rahmanir-Rahim (The Mos Gracious, the Most Merciful),' Allah says: 'My slave has extolled Me, and My slave shall have what he has asked for.' And when he says: 'Maliki yawmiddin [The Only Owner (and he Ruling Judge] if the Day of Recompense],' Allahs says: 'My slave has Glorified Me. This is for Me, and this Verse is between me and My slave in two halves.' And when he says: ' Iyyaka na'budu wa iyyaka nastain [You (Alone) we worship, and You (Alone) we ask for help],' He says: 'This is between Me an My slave, and My slave shall have what he has asked for.' And the end of the Surah is for My slave.' And when he says: 'Ihdinas-siratal-mustaqeema, siratal-alldhina an'amta alayhim a lad-dallin [Guide us to the Straight Way, the way of those on whom You have bestowed Your Grace, not(the way) of those who earned Your Anger, nor of those who went astray],' He says: 'THis is for My slave, and My slave shall have what he has asked for.\"",
      "chain": [
        "32032",
        "20165",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "3901",
      "source": " Sunan Ibn Majah ",
      "chapter": "Interpretation of Dreams - كتاب تعبير الرؤيا",
      "chapter_no": "35",
      "text_ar": "حدثنا أبو مروان العثماني، قال حدثنا عبد العزيز بن أبي حازم، عن العلاء بن عبد الرحمن، عن أبيه، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من رآني في المنام فقد رآني فإن الشيطان لا يتمثل بي ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                     “Whoever sees me in a dream has (really) seen me, for Satancannotappear in my form.”",
      "chain": [
        "32032",
        "20165",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "4107",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا أبو مروان، محمد بن عثمان العثماني حدثنا إبراهيم بن سعد، عن ابن شهاب، عن محمد بن عبد الرحمن بن ماعز العامري، أن سفيان بن عبد الله الثقفي، قال قلت يا رسول الله حدثني بأمر أعتصم به ‏.‏ قال ‏\"‏ قل ربي الله ثم استقم ‏\"‏ ‏.‏ قلت يا رسول الله ما أكثر ما تخاف على فأخذ رسول الله  صلى الله عليه وسلم  بلسان نفسه ثم قال ‏\"‏ هذا ‏\"‏ ‏.‏",
      "text_en": " Sufyan bin ‘Abdullah Thaqafi said:                      “I said: ‘O Messenger ofAllah,tell me of something that I can adhere to.’ He said: ‘Say:“Allah ismy Lord,” then stand straight (adhere steadfastly toIslam).’ He said:‘O Messenger of Allah, what is the thing thatyou fear most for me?’The Messenger of Allah (ﷺ) took hold ofhis own tongue, then hesaid: ‘This.’”",
      "chain": [
        "32032",
        "20150",
        "11013",
        "5066"
      ]
    },
    {
      "hadith_no": "4183",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا أبو مروان العثماني، حدثنا عبد العزيز بن أبي حازم، عن العلاء بن عبد الرحمن، عن أبيه، عن أبي هريرة، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ لا تقوم الساعة حتى يفيض المال وتظهر الفتن ويكثر الهرج ‏\"‏ ‏.‏ قالوا وما الهرج يا رسول الله قال ‏\"‏ القتل القتل القتل ‏\"‏ ‏.‏ ثلاثا ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                      “The Hour will not begin until wealth becomes abundant andtribulations appear, and Harj increases.” They said: “What isHarj, OMessenger of Allah?” He said: “Killing, killing,killing,” threetimes.",
      "chain": [
        "32032",
        "20165",
        "10606",
        "11884",
        "13"
      ]
    }
  ],
  "total_hadiths": 30
}