{
  "id": "32048",
  "name": "Y'aqub bin Hmyd bin Kasb يعقوب بن حميد بن كاسب المدني",
  "full_name": "Y'aqub bin Hmyd bin Kasb يعقوب بن حميد بن كاسب المدني",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "241",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina",
      "Makkah"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ عخ  ق  -  صدوق ]"
    ],
    "tags": [
      "al-Madni",
      "Makkah"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "22059",
      "name": "Zakaria bin Mnzwr زكريا بن منظور",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "22064",
      "name": "Sa'd bin Sa'id bin Abi Sa'id سعد بن سعيد بن أبي سعيد المقبري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20150",
      "name": "Ibrahim bin Sa'd bin Ibrahim إبراهيم بن سعد بن إبراهيم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20159",
      "name": "Hatm bin Isma'il al-Madni حاتم بن إسماعيل المدني",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20201",
      "name": "Marwan bin Mua'wiya al-Fazari مروان بن معاوية الفزاري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20288",
      "name": "Ma'tmar bin Sulaiman-al-Taufayl معتمر بن سليمان - الطفيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "11034",
      "name": "al-Mughira bin 'Abdur Rahman المغيرة بن عبد الرحمن بن الحارث",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20733",
      "name": "al-Walid bin Muslim al-Quraishi الوليد بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20172",
      "name": "Muhammad bin Abi Fadayk محمد بن إسماعيل بن مسلم بن أبي فديك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "30112",
      "name": "Ma'n bin 'Isa bin Yahya معن بن عيسى بن يحيى",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "students": [],
  "hadiths": [
    {
      "id": "sunan-ibn-majah-9",
      "hadith_no": "9",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا القاسم بن نافع، حدثنا الحجاج بن أرطاة، عن عمرو بن شعيب، عن أبيه، قال قام معاوية خطيبا فقال أين علماؤكم أين علماؤكم سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ لا تقوم الساعة إلا وطائفة من أمتي ظاهرون على الناس لا يبالون من خذلهم ولا من نصرهم ‏\"‏ ‏.‏",
      "text_en": " Amr bin Shu'aib narrated that:                     His father said: \"Mu'awiyah stood up to deliver a sermon and said: 'Where are your scholars? Where are your scholars?  For I heard the Messenger of Allah (ﷺ) say: The Hour will not begin until a group of my Ummah will prevail over the people, and they will not care who lets them down and who supports them.\"",
      "usc_msa_ref": "",
      "chain": [
        "32048",
        "20580",
        "19934",
        "19911"
      ]
    },
    {
      "id": "sunan-ibn-majah-84",
      "hadith_no": "84",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا هشام بن عمار، ويعقوب بن حميد بن كاسب، قالا حدثنا سفيان بن عيينة، عن عمرو بن دينار، سمع طاوسا، يقول سمعت أبا هريرة، يخبر عن النبي  صلى الله عليه وسلم  قال ‏\"‏ احتج آدم وموسى فقال له موسى يا آدم أنت أبونا خيبتنا وأخرجتنا من الجنة بذنبك ‏.‏ فقال له آدم يا موسى اصطفاك الله بكلامه وخط لك التوراة بيده أتلومني على أمر قدره الله على قبل أن يخلقني بأربعين سنة فحج آدم موسى فحج آدم موسى فحج آدم موسى ‏\"‏ ‏.‏ ثلاثا ‏.‏",
      "text_en": " It was narrated that 'Amr bin Dinar heard Tawus say:                     \"I heard Abu Hurairah narrating that the Prophet (ﷺ) said: 'Adam and Musa debated, and Musa said to him: \"O Adam, you are our father but have deprived us and caused us to be expelled from Paradise because of your sin.\" Adam said to him: \"O Musa, Allah chose you to speak with His own Hand. Are you blaming me for something which Allah decreed for me forty years before He created me?\" Thus Adam won the argument with Musa, thus Adam won the argument with Musa.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30288",
        "32048",
        "20005",
        "11081",
        "11053"
      ]
    },
    {
      "id": "sunan-ibn-majah-149",
      "hadith_no": "149",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا يحيى بن سليم، عن عبد الله بن عثمان بن خثيم، عن سعيد بن أبي راشد، أن يعلى بن مرة، حدثهم أنهم، خرجوا مع النبي  صلى الله عليه وسلم  إلى طعام دعوا له فإذا حسين يلعب في السكة قال فتقدم النبي  صلى الله عليه وسلم  أمام القوم وبسط يديه فجعل الغلام يفر ها هنا وها هنا ويضاحكه النبي  صلى الله عليه وسلم  حتى أخذه فجعل إحدى يديه تحت ذقنه والأخرى في فأس رأسه فقبله وقال ‏\"‏ حسين مني وأنا من حسين أحب الله من أحب حسينا حسين سبط من الأسباط ‏\"‏ ‏.‏ حدثنا علي بن محمد حدثنا وكيع عن سفيان مثله ‏.‏",
      "text_en": " It was narrated from Sa'eed bin Abu Rashid that Ya'la bin Murrah told them that:                     They had gone out with the Prophet to a meal to which they had been invited, and Husain was there playing in the street. The Prophet came in front of the people and stretched out his hands, and the child started to run here and there. The Prophet made him laugh until he caught him, then he put one hand under his chin and the other on his head and kissed him, and said, \"Husain is part of me and I am part of him. May Allah love those who love Husain. Husain is a tribe among tribes.\" (Hasan)(Another chain with similar meaning)",
      "usc_msa_ref": "",
      "chain": [
        "32048",
        "20204",
        "10644",
        "5062"
      ]
    },
    {
      "id": "sunan-ibn-majah-199",
      "hadith_no": "199",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا سفيان بن عيينة، عن عمرو بن دينار، عن عكرمة، عن أبي هريرة، أن النبي  صلى الله عليه وسلم  قال ‏\"‏ إذا قضى الله أمرا في السماء ضربت الملائكة أجنحتها خضعانا لقوله كأنه سلسلة على صفوان فإذا فزع عن قلوبهم قالوا ماذا قال ربكم قالوا الحق وهو العلي الكبير قال فيسمعها مسترقو السمع بعضهم فوق بعض فيسمع الكلمة فيلقيها إلى من تحته فربما أدركه الشهاب قبل أن يلقيها إلى الذي تحته فيلقيها على لسان الكاهن أو الساحر فربما لم يدرك حتى يلقيها فيكذب معها مائة كذبة فتصدق تلك الكلمة التي سمعت من السماء ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     The Prophet said: \"When Allah decrees a matter in heaven, the angels beat their wings in submission to his decree (with a sound) like a chain beating a rock. Then \"When fear is banished from their hearts, they say: 'What is it that your Lord has said?' They say: 'The truth. And He is The Most High, The Most Great.\" He said: 'Then the eavesdroppers (from among the jinn) listen out for that, one above the other, so (one of them) hears the words and passes it on to the one beneath him. The Shihab (shooting star) may strike him before he can pass it on to the one beneath him and the latter can pass it on to the soothsayer or sorcerer, or it may not strike him until he has passed it on. And he ads one hundred lies to it, and only that word which was overheard from the heavens is true.\"",
      "usc_msa_ref": "",
      "chain": [
        "32048",
        "20005",
        "11081",
        "11023",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-250",
      "hadith_no": "250",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب المدني، حدثني إسحاق بن إبراهيم، عن صفوان بن سليم، عن عبيد الله بن طلحة، عن الحسن البصري، عن أبي هريرة، أن النبي  صلى الله عليه وسلم  قال ‏\"‏ أفضل الصدقة أن يتعلم المرء المسلم علما ثم يعلمه أخاه المسلم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     The Prophet said: \"The best of charity is when a Muslim man gains knowledge, then he teaches it to his Muslim brother.\"",
      "usc_msa_ref": "",
      "chain": [
        "32048",
        "30123",
        "11177",
        "11016",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-333",
      "hadith_no": "333",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا المغيرة بن عبد الرحمن، وعبد الله بن رجاء المكي، عن محمد بن عجلان، عن القعقاع بن حكيم، عن أبي صالح، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إذا استطاب أحدكم فلا يستطب بيمينه ليستنج بشماله ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah said: 'When anyone of you cleans himself, he should not clean himself with his right hand. Let him clean himself with his left hand.'\"",
      "usc_msa_ref": "",
      "chain": [
        "32048",
        "20182",
        "23027",
        "10616",
        "10612",
        "11161",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-357",
      "hadith_no": "357",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا يحيى بن سليم، عن ابن خثيم، عن يونس بن خباب، عن يعلى بن مرة، أن النبي  صلى الله عليه وسلم  كان إذا ذهب إلى الغائط أبعد ‏.‏",
      "text_en": " It was narrated from Ya'la bin Murrah that:                     When the Prophet went to relieve himself, he would go far away.",
      "usc_msa_ref": "",
      "chain": [
        "32048",
        "20204",
        "19886"
      ]
    },
    {
      "id": "sunan-ibn-majah-463",
      "hadith_no": "463",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا سفيان بن حمزة، عن كثير بن زيد، عن الوليد بن رباح، عن أبي هريرة، أن النبي  صلى الله عليه وسلم  قال ‏\"‏ كفارات الخطايا إسباغ الوضوء على المكاره وإعمال الأقدام إلى المساجد وانتظار الصلاة بعد الصلاة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     The Prophet said: \"Sins are expiated by well-performed ablution despite difficulties, increasing the number of steps one takes towards the mosque, (and waiting for the next prayer after prayer).\"",
      "usc_msa_ref": "",
      "chain": [
        "32048",
        "22171",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-510",
      "hadith_no": "510",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا عبد العزيز بن محمد الدراوردي، عن عبيد الله بن عمر، عن إبراهيم بن محمد بن عبد الله بن جحش، عن أبيه، عن زينب بنت جحش، أنه كان لها مخضب من صفر قالت فكنت أرجل رأس رسول الله  صلى الله عليه وسلم  فيه ‏.‏",
      "text_en": " It was narrated from Zainab bint Jahsh that :                     She had a tub of brass. She said: \"I used to comb the hair of the Messenger of Allah in it.\"",
      "usc_msa_ref": "",
      "chain": [
        "32048",
        "20167",
        "11201",
        "11905",
        "57"
      ]
    },
    {
      "id": "sunan-ibn-majah-610",
      "hadith_no": "610",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا عبد العزيز بن أبي حازم، ح وحدثنا أبو إسحاق الهروي، حدثنا إسماعيل بن جعفر، جميعا عن العلاء، عن أبيه، عن أبي هريرة، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ جعلت لي الأرض مسجدا وطهورا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     The Messenger of Allah said: \"the earth has been made for me a place of worship and a means of purification.\"",
      "usc_msa_ref": "",
      "chain": [
        "32048",
        "20165",
        "20155",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-688-2",
      "hadith_no": "688",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Prayer - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا المغيرة بن عبد الرحمن، عن يزيد بن أبي عبيد، عن سلمة بن الأكوع، أنه كان يصلي مع النبي  صلى الله عليه وسلم  المغرب إذا توارت بالحجاب ‏.‏",
      "text_en": " It was narrated from Salamah bin Akwa' that:                     He used to pray the Maghrib with the Messenger of Allah when the sun set.",
      "usc_msa_ref": "",
      "chain": [
        "32048",
        "20182",
        "11450",
        "237"
      ]
    },
    {
      "id": "sunan-ibn-majah-705-2",
      "hadith_no": "705",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Prayer - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا المغيرة بن عبد الرحمن، عن محمد بن عجلان، عن المقبري، عن أبي هريرة، ح وحدثنا يعقوب بن حميد، حدثنا ابن أبي حازم، عن عبد الرحمن بن حرملة، عن سعيد بن المسيب، عن أبي هريرة، أن النبي  صلى الله عليه وسلم  قال ‏\"‏ لا تغلبنكم الأعراب على اسم صلاتكم - زاد ابن حرملة - فإنما هي العشاء وإنما يقولون العتمة لإعتامهم بالإبل ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     The Prophet said: \"Do not let the Bedouins make you change the name of your prayer.\" Ibn Harmalah added: \"Rather it is the 'Isha', but they say the 'Atamah because they bring their camels in for milking at that time (when it is dark).\"",
      "usc_msa_ref": "",
      "chain": [
        "32048",
        "20182",
        "10616",
        "11168",
        "13",
        "32048",
        "20165",
        "11878",
        "11002",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-767",
      "hadith_no": "767",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book On The Mosques And The Congregations - كتاب المساجد والجماعات",
      "chapter_no": "4",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا عبد الله بن وهب، أخبرني حيوة بن شريح، عن محمد بن عبد الرحمن الأسدي أبي الأسود، عن أبي عبد الله، مولى شداد بن الهاد أنه سمع أبا هريرة، يقول سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ من سمع رجلا ينشد ضالة في المسجد فليقل لا رد الله عليك فإن المساجد لم تبن لهذا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu 'Abdullah, the freed slave of Shaddad bin Had that:                     He heard Abu Hurairah say: \"I heard the Messenger of Allah say: 'Whoever hears a man making a lost-and-found announcement in the mosque, let him say: \"May Allah not return it to you!\" For the mosques were not built for that.'\"",
      "usc_msa_ref": "",
      "chain": [
        "32048",
        "20029",
        "26010",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-935",
      "hadith_no": "935",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا عبد العزيز بن أبي حازم، عن يزيد بن الهاد، عن محمد بن إبراهيم التيمي، عن عامر بن سعد، عن العباس بن عبد المطلب، أنه سمع النبي  صلى الله عليه وسلم  يقول ‏\"‏ إذا سجد العبد سجد معه سبعة آراب وجهه وكفاه وركبتاه وقدماه ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Abbas bin ‘Abdul-Muttalib that he heard theProphet (ﷺ) say:                      “When a person prostrates, seven parts of hisbodyprostrate with him: His face, his two hands, his two knees, andhistwo feet.”",
      "usc_msa_ref": "",
      "chain": [
        "32048",
        "20165",
        "11234",
        "11213",
        "10554",
        "100"
      ]
    },
    {
      "id": "sunan-ibn-majah-1065",
      "hadith_no": "1065",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا إبراهيم بن المنذر الحزامي، ويعقوب بن حميد بن كاسب، قالا حدثنا ابن أبي فديك، عن كثير بن زيد، عن المطلب بن عبد الله، عن أبي هريرة، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ إذا دخل أحدكم المسجد فلا يجلس حتى يركع ركعتين ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                     “When anyone of you enters the mosque, let him not sit downuntilhe performs two Rak’ah.”",
      "usc_msa_ref": "",
      "chain": [
        "30308",
        "32048",
        "20172",
        "22171",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-1202",
      "hadith_no": "1202",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الرحمن بن إبراهيم الدمشقي، ويعقوب بن حميد بن كاسب، قالا حدثنا مروان بن معاوية، عن يزيد بن كيسان، عن أبي حازم، عن أبي هريرة، أن النبي  صلى الله عليه وسلم  قرأ في الركعتين قبل الفجر ‏{قل يا أيها الكافرون‏}‏ و ‏{قل هو الله أحد‏}‏",
      "text_en": " It wasnarrated from Abu Hurairah that in the two Rak’ah before theFajr,the Prophet (ﷺ) used to recite:                      “Say: ‘O you disbelievers!”[Al-Kafirun (109)] and “Say: Allah is One.” [Al-Ikhlas (112)]",
      "usc_msa_ref": "",
      "chain": [
        "30285",
        "32048",
        "20201",
        "10845",
        "11172",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-1210",
      "hadith_no": "1210",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الرحمن بن إبراهيم، ويعقوب بن حميد بن كاسب، قالا حدثنا مروان بن معاوية، عن يزيد بن كيسان، عن أبي حازم، عن أبي هريرة، أن النبي  صلى الله عليه وسلم  نام عن ركعتى الفجر فقضاهما بعد ما طلعت الشمس ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Prophet (ﷺ) slept andmissedthe two Rak’ah before Fajr, so he made them up after the sunhadrisen.",
      "usc_msa_ref": "",
      "chain": [
        "30285",
        "32048",
        "20201",
        "10845",
        "11172",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-1277",
      "hadith_no": "1277",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا عبد الله بن موسى التيمي، عن أسامة بن زيد، عن عبد الله بن يزيد، مولى الأسود بن سفيان عن محمد بن عبد الرحمن بن ثوبان، عن أبي هريرة، قال خرج النبي  صلى الله عليه وسلم  إلى الصلاة وكبر ثم أشار إليهم فمكثوا ثم انطلق فاغتسل وكان رأسه يقطر ماء فصلى بهم فلما انصرف قال ‏\"‏ إني خرجت إليكم جنبا وإني نسيت حتى قمت في الصلاة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Hurairah said:                      “The Prophet (ﷺ) came outtopray and said the Takbir, then he gestured to them to wait. He wentand took a bath, and his head was dripping with water while he ledthem in prayer. When he finished he said: ‘I came out to you in astate of sexual impurity, and I forgot until I had started to pray.’”",
      "usc_msa_ref": "",
      "chain": [
        "32048",
        "28473",
        "50",
        "11189",
        "11218",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-1434",
      "hadith_no": "1434",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا حاتم بن إسماعيل، عن أبي بكر بن يحيى بن النضر، عن أبيه، عن أبي هريرة، أن النبي  صلى الله عليه وسلم  قال ‏\"‏ إذا قام أحدكم من الليل فاستعجم القرآن على لسانه فلم يدر ما يقول اضطجع ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Prophet (ﷺ) said:                      “Whenanyone of you gets up to pray at night, and his tongue stumbles overthe words of the Qur’an, and he does not know what he is saying,lethim lie down.”",
      "usc_msa_ref": "",
      "chain": [
        "32048",
        "20159",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-1497",
      "hadith_no": "1497",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا المغيرة بن عبد الرحمن المخزومي، عن يزيد بن أبي عبيد، عن سلمة بن الأكوع، أنه كان يأتي إلى سبحة الضحى فيعمد إلى الأسطوانة دون المصحف فيصلي قريبا منها فأقول له ألا تصلي ها هنا وأشير إلى بعض نواحي المسجد فيقول إني رأيت رسول الله  صلى الله عليه وسلم  يتحرى هذا المقام ‏.‏",
      "text_en": " It wasnarrated from Yazid bin Abu ‘Ubaid that Salamah bin Al-Akwa’usedto offer the Duha prayer, and he would come to the pillar thatwasnear the Mushaf. I said to him:                      “Why do you not pray over there?”And I pointed to some corner of the mosque. He said: “I saw theMessenger of Allah (ﷺ) seeking out this place.”",
      "usc_msa_ref": "",
      "chain": [
        "32048",
        "11034",
        "11450",
        "237"
      ]
    },
    {
      "id": "sunan-ibn-majah-1569",
      "hadith_no": "1569",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا المغيرة بن عبد الرحمن، حدثنا خالد بن إلياس، عن إسماعيل بن عمرو بن سعيد بن العاص، عن عثمان بن عبد الله بن الحكم بن الحارث، عن عثمان بن عفان، ‏.‏ أن النبي  صلى الله عليه وسلم  صلى على عثمان بن مظعون وكبر عليه أربعا ‏.‏",
      "text_en": " It wasnarrated from ‘Uthman bin ‘Affan that the Prophet (ﷺ)offeredthe funeral prayer for ‘Uthman bin Maz’un, and he said fourTakbir over him.",
      "usc_msa_ref": "",
      "chain": [
        "32048",
        "20182",
        "22048",
        "18046",
        "13535",
        "4"
      ]
    },
    {
      "id": "sunan-ibn-majah-1596",
      "hadith_no": "1596",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا عبد العزيز بن محمد الدراوردي، عن محمد بن زيد بن المهاجر بن قنفذ، عن عبد الله بن عامر بن ربيعة، عن أبيه، أن امرأة، سوداء ماتت لم يؤذن بها النبي  صلى الله عليه وسلم  فأخبر بذلك فقال ‏\"‏ هلا آذنتموني بها ‏\"‏ ‏.‏ ثم قال لأصحابه ‏\"‏ صفوا عليها ‏\"‏ ‏.‏ فصلى عليها ‏.‏",
      "text_en": " It wasnarrated from ‘Abdullah bin ‘Amir bin Rabi’ah, from hisfather,that a black woman died and the Prophet (ﷺ) was not toldaboutthat. Then he was informed of it, and he said:                      “Why did you nottell me?” Then he said to his Companions: “Line up in rows topray forher,” and he offered the funeral prayer for her.",
      "usc_msa_ref": "",
      "chain": [
        "32048",
        "20167",
        "10614",
        "709",
        "708"
      ]
    },
    {
      "id": "sunan-ibn-majah-1662",
      "hadith_no": "1662",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا عبد العزيز بن محمد الدراوردي، حدثنا أسيد بن أبي أسيد، عن موسى بن أبي موسى الأشعري، عن أبيه، ‏.‏ أن النبي  صلى الله عليه وسلم  قال ‏\"‏ الميت يعذب ببكاء الحى إذا قالوا واعضداه واكاسياه ‏.‏ واناصراه واجبلاه ونحو هذا - يتعتع ويقال أنت كذلك أنت كذلك ‏\"‏ ‏.‏ قال أسيد فقلت سبحان الله إن الله يقول ‏{ولا تزر وازرة وزر أخرى }‏ ‏.‏ قال ويحك أحدثك أن أبا موسى حدثني عن رسول الله  صلى الله عليه وسلم  فترى أن أبا موسى كذب على النبي  صلى الله عليه وسلم  أو ترى أني كذبت على أبي موسى",
      "text_en": " It wasnarrated from Asid bin Abu Asid, from Musa bin Abu Musa Ash’ari,from his father that the Prophet (ﷺ) said:                      “The deceased ispunished for the weeping of the living. If they say: ‘O mystrength, O he who clothed us, O my help, O my rock,’ and so on, heis rebuked and it is said: ‘Were you really like that? Were youreally like that?’” Asid said: \"I said: 'Subhan-Allah! Allah says: \"And no bearer of burdens shall another's burden (35:18).\" He said: \"Woe to you, I tell you that Abu Musa narrated to me from the Messenger of Allah (ﷺ), and you think that Abu Musa was telling lies about the Prophet (ﷺ)? Or do you think that I am telling lies about Abu Musa?\"",
      "usc_msa_ref": "",
      "chain": [
        "32048",
        "20167",
        "19800",
        "11902"
      ]
    },
    {
      "id": "sunan-ibn-majah-1836",
      "hadith_no": "1836",
      "source": "Sunan Ibn Majah",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا محمد بن معن، عن أبيه، وعن عبد الله بن عبد الله الأموي، عن معن بن محمد، عن حنظلة بن علي الأسلمي، عن أبي هريرة، عن النبي  صلى الله عليه وسلم  أنه قال ‏\"‏ الطاعم الشاكر بمنزلة الصائم الصابر ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Prophet (ﷺ) said:                      “Agratefuleater is equal to a patient fasting person.”",
      "usc_msa_ref": "",
      "chain": [
        "32048",
        "20180",
        "11724",
        "23509",
        "11842",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-1936",
      "hadith_no": "1936",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا عبد الله بن الحارث المخزومي، عن طلحة، عن عطاء، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ انكحوا فإني مكاثر بكم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     the Messenger of Allah said: “Marry, for I will boast of your great numbers.”",
      "usc_msa_ref": "",
      "chain": [
        "32048",
        "20524",
        "11356",
        "11029",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-1978",
      "hadith_no": "1978",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا عبد العزيز بن أبي حازم، عن سهيل، عن أبيه، عن أبي هريرة، أن رسول الله  صلى الله عليه وسلم  لعن المرأة تتشبه بالرجال والرجل يتشبه بالنساء ‏.‏",
      "text_en": " It was narrated from Abu Hurairah:                     that the Messenger of Allah cursed women who imitate men and men who imitate women.",
      "usc_msa_ref": "",
      "chain": [
        "32048",
        "20165",
        "11172",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-2171",
      "hadith_no": "2171",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Expiation - كتاب الكفارات",
      "chapter_no": "11",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا حماد بن خالد، ح وحدثنا يعقوب بن حميد بن كاسب، حدثنا معن بن عيسى، جميعا عن محمد بن هلال، عن أبيه، عن أبي هريرة، قال كانت يمين رسول الله  صلى الله عليه وسلم  ‏\"‏ لا وأستغفر الله ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The swearing of the Messenger of Allah (ﷺ) was: 'No, and I ask Allah for forgiveness.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20537",
        "32048",
        "30112",
        "12489",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-2180",
      "hadith_no": "2180",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Expiation - كتاب الكفارات",
      "chapter_no": "11",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا حاتم بن إسماعيل، عن أبي بكر بن يحيى بن النضر، عن أبيه، عن أبي هريرة، أن النبي  صلى الله عليه وسلم  قال ‏\"‏ رأى عيسى ابن مريم رجلا يسرق فقال أسرقت قال لا والذي لا إله إلا هو ‏.‏ فقال عيسى آمنت بالله وكذبت بصري ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Prophet (ﷺ) said:                     \"Eisa bin Maryam saw a man stealing and said: 'Did you steal?'  He said: 'No, by the One besides Whom there is no other God.' 'Eisa said: 'I believe in Allah, and I do not believe what my eyes see.'\"",
      "usc_msa_ref": "",
      "chain": [
        "32048",
        "20159",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-2217",
      "hadith_no": "2217",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Expiation - كتاب الكفارات",
      "chapter_no": "11",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا عبد العزيز بن محمد، عن عمرو بن أبي عمرو، عن الأعرج، عن أبي هريرة، قال رأى النبي  صلى الله عليه وسلم  شيخا يمشي بين ابنيه فقال ‏\"‏ ما شأن هذا ‏\"‏ ‏.‏ قال ابناه نذر يا رسول الله ‏.‏ قال ‏\"‏ اركب أيها الشيخ فإن الله غني عنك وعن نذرك ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Prophet (ﷺ) saw an old man walking between his two sons, and he said: What is the matter with him?' His sons said: 'A vow, O Messenger of Allah.' He said: 'Let this old man ride, for Allah has no need of you or your vow.\"'",
      "usc_msa_ref": "",
      "chain": [
        "32048",
        "20167",
        "11209",
        "11197",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-2223",
      "hadith_no": "2223",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا عبد العزيز الدراوردي، عن ثور بن زيد الديلي، عن أبي الغيث، مولى ابن مطيع عن أبي هريرة، أن النبي  صلى الله عليه وسلم  قال ‏\"‏ الساعي على الأرملة والمسكين كالمجاهد في سبيل الله وكالذي يقوم الليل ويصوم النهار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Prophet (ﷺ) said:                     'The one who strives to support the widow and the poor is like a Mujahid who fights in the cause of Allah, and like one who stands in the night (in voluntary prayer) and fasts by day.\"",
      "usc_msa_ref": "",
      "chain": [
        "32048",
        "20167",
        "11155",
        "11165",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-2229",
      "hadith_no": "2229",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا يحيى بن سليم الطائفي، عن عبد الله بن عثمان بن خثيم، عن إسماعيل بن عبيد بن رفاعة، عن أبيه، عن جده، رفاعة قال خرجنا مع رسول الله  صلى الله عليه وسلم  فإذا الناس يتبايعون بكرة فناداهم ‏\"‏ يا معشر التجار ‏\"‏ ‏.‏ فلما رفعوا أبصارهم ومدوا أعناقهم قال ‏\"‏ إن التجار يبعثون يوم القيامة فجارا إلا من اتقى الله وبر وصدق ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Isma'il bin 'Ubaid bin Rifa'ah, from his father, that his grandfather Rifa'ah said:                     \"We went out with the Messenger of Allah (ﷺ)  and the people were trading early in the morning. He called them: 'O merchants!' and when they looked up and craned their necks, he said : 'The merchants will be raised on the Day of Resurrection as immoral people, apart from those who fear Allah and act righteously and speak the truth (i.e. those who are honest).\"'",
      "usc_msa_ref": "",
      "chain": [
        "32048",
        "20204",
        "10644",
        "38113"
      ]
    },
    {
      "id": "sunan-ibn-majah-2288",
      "hadith_no": "2288",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا يعلى بن شبيب، عن عبد الله بن عثمان بن خثيم، عن قيلة أم بني أنمار، قالت أتيت رسول الله  صلى الله عليه وسلم  في بعض عمره عند المروة فقلت يا رسول الله إني امرأة أبيع وأشتري فإذا أردت أن أبتاع الشىء سمت به أقل مما أريد ثم زدت ثم زدت حتى أبلغ الذي أريد وإذا أردت أن أبيع الشىء سمت به أكثر من الذي أريد ثم وضعت حتى أبلغ الذي أريد ‏.‏ فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا تفعلي يا قيلة إذا أردت أن تبتاعي شيئا فاستامي به الذي تريدين أعطيت أو منعت ‏\"‏ ‏.‏ وقال ‏\"‏ إذا أردت أن تبيعي شيئا فاستامي به الذي تريدين أعطيت أو منعت ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Qailah Umm Bani Anmar said:                     \"I came to the Messenger of Allah (ﷺ), during one of his 'Umrah at Marwah and said: 'O Messenger of Allah, I am a woman who buys and sells. When I want to buy something, I state a price less than I want to pay, then I raise it gradually until it reaches the price I want to pay. And when I want to sell something, I state a price more than I want, then I lower it until it reaches the price I want.' The Messenger of Allah (ﷺ) said: 'Do not do that, O Qailah. When you want to buy something, state the price you want, whether it is given or not. And when you want to sell something, state the price you want, whether it is given or not.'\"",
      "usc_msa_ref": "",
      "chain": [
        "32048",
        "10644",
        "4029"
      ]
    },
    {
      "id": "sunan-ibn-majah-2323",
      "hadith_no": "2323",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا إسحاق بن جعفر بن محمد بن علي بن الحسين، عن عبد الرحمن بن أبي بكر الجدعاني، عن نافع، عن ابن عمر، أن النبي  صلى الله عليه وسلم  قال ‏\"‏ اللهم بارك لأمتي في بكورها ‏\"‏ ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "32048",
        "28032",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-ibn-majah-2367",
      "hadith_no": "2367",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا الوليد بن مسلم، عن محمد بن حمزة بن يوسف بن عبد الله بن سلام، عن أبيه، عن جده عبد الله بن سلام، قال جاء رجل إلى النبي  صلى الله عليه وسلم  فقال إن بني فلان أسلموا - لقوم من اليهود - وإنهم قد جاعوا فأخاف أن يرتدوا ‏.‏ فقال النبي  صلى الله عليه وسلم  ‏\"‏ من عنده ‏\"‏ ‏.‏ فقال رجل من اليهود عندي كذا وكذا - لشىء قد سماه أراه قال ثلاثمائة دينار بسعر كذا وكذا من حائط بني فلان ‏.‏ فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ بسعر كذا وكذا إلى أجل كذا وكذا وليس من حائط بني فلان ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Muhammad bin Hamzah bin Yusuf bin 'Abdullah bin Salam, from his father, that his grandfather 'Abdullah bin Salam said:                     \"A man came to the Prophet (ﷺ) and said, 'The tribe of Banu so-and- so, who were descended from the Jews, have become Muslim, and they are starving, and I am afraid that they may apostatize.' The Prophet (ﷺ) said:  'Who has something with him?' A Jewish man said: 'I have such and such, and he named it, and I think he said three hundred Dinar for such and such 'an amount (of produce) from the garden of the tribe of Banu so-and-so.' The Messenger of Allah (ﷺ) said: 'For such and such a price at such and such a time, but not from the garden of the tribe of Banu so-and- so.\"'",
      "usc_msa_ref": "",
      "chain": [
        "32048",
        "20733",
        "103"
      ]
    },
    {
      "id": "sunan-ibn-majah-2387",
      "hadith_no": "2387",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا محمد بن الصباح، ويعقوب بن حميد بن كاسب، قالا حدثنا معتمر بن سليمان، قال سمعت ابن أبي الحكم الغفاري، قال حدثتني جدتي، عن عم، أبيها رافع بن عمرو الغفاري قال كنت وأنا غلام، أرمي نخلنا - أو قال نخل الأنصار - فأتي بي النبي  صلى الله عليه وسلم  فقال ‏\"‏ يا غلام - وقال ابن كاسب فقال يا بنى - لم ترمي النخل ‏\"‏ ‏.‏ قال قلت آكل ‏.‏ قال ‏\"‏ فلا ترمي النخل وكل مما يسقط في أسافلها ‏\"‏ ‏.‏ قال ثم مسح رأسي وقال ‏\"‏ اللهم أشبع بطنه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Rafi' bin 'Amr Al-Ghifari said:                     \"When I was a boy, I used to throw stones at our date-palm trees\"[1] - or he said: \"the date-palm trees of the Ansar.\" I was brought to the Prophet (ﷺ) and he said: 'O boy' - (one of the narrators) Ibn Kasib said: He said: 'O my son - why are you throwing stones at the date-palm trees?' I said: 'So I can eat.' He said: 'Do not throw stones at the date-palm trees. Eat from what falls to the ground from them.' Then he patted me on the head and said: 'O Allah give him enough to eat.'”",
      "usc_msa_ref": "",
      "chain": [
        "30269",
        "32048",
        "20288"
      ]
    },
    {
      "id": "sunan-ibn-majah-2504",
      "hadith_no": "2504",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Charity - كتاب الصدقات",
      "chapter_no": "15",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا عبد العزيز بن محمد، عن ثور بن زيد الديلي، عن أبي الغيث، - مولى ابن مطيع - عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏\"‏ من أخذ أموال الناس يريد إتلافها أتلفه الله ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Prophet (ﷺ) said:                     “Whoever takes people's wealth with the intention of destroying it, Allah (SWT) will destroy him.”",
      "usc_msa_ref": "",
      "chain": [
        "32048",
        "20167",
        "11155",
        "11165",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-2643",
      "hadith_no": "2643",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، أنبأنا محمد بن عثمان الجمحي، حدثنا الحكم بن أبان، عن عكرمة، عن ابن عباس، عن النبي صلى الله عليه وسلم قال ‏\"‏ من ستر عورة أخيه المسلم ستر الله عورته يوم القيامة ومن كشف عورة أخيه المسلم كشف الله عورته حتى يفضحه بها في بيته ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn `Abbas that the Prophet (ﷺ) said:                     “Whoever conceals the (hidden) fault of his Muslim brother, Allah (SWT) will conceal his faults on the Day of Resurrection. Whoever exposes the fault of his Muslim brother, Allah will expose his faults, until (so that) He shames him, due to it, in his (own) house.”",
      "usc_msa_ref": "",
      "chain": [
        "32048",
        "17668",
        "19904",
        "11023",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-2673",
      "hadith_no": "2673",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا عبد العزيز بن أبي حازم، عن سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، قال وحدثنا المغيرة بن عبد الرحمن، عن ابن عجلان، عن أبيه، عن أبي هريرة، قال وحدثنا أنس بن عياض، عن أبي معشر، عن محمد بن كعب، وموسى بن يسار، عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏\"‏ من حمل علينا السلاح فليس منا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:                     “Whoever bears weapons against us is not one of us.”",
      "usc_msa_ref": "",
      "chain": [
        "32048",
        "20165",
        "11173",
        "11161",
        "13",
        "20182",
        "10616",
        "13",
        "20157",
        "19825",
        "11221",
        "19054",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-2879",
      "hadith_no": "2879",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا سفيان بن عيينة، عن محمد بن عبد الرحمن، - مولى آل طلحة - عن عيسى بن طلحة، عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏\"‏ لا يجتمع غبار في سبيل الله ودخان جهنم في جوف عبد مسلم ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Prophet (ﷺ) said:                      “Thedust(of Jihad) in the cause of Allah and the smoke of Hell will neverbecombined in the interior of a Muslim.”",
      "usc_msa_ref": "",
      "chain": [
        "32048",
        "20005",
        "10818",
        "10573",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-2993",
      "hadith_no": "2993",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا عبد العزيز بن محمد، عن سهيل، عن أبيه، عن أبي هريرة، عن النبي صلى الله عليه وسلم بنحوه ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "32048",
        "20167",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-3036",
      "hadith_no": "3036",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا إبراهيم بن المنذر الحزامي، ويعقوب بن حميد بن كاسب، قالا حدثنا ابن أبي فديك، عن الضحاك بن عثمان، عن محمد بن المنكدر، عن عبد الرحمن بن يربوع، عن أبي بكر الصديق، أن رسول الله  صلى الله عليه وسلم  سئل أى الأعمال أفضل قال ‏\"‏ العج والثج ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Bakr As-Siddiq that the Messenger of Allah(ﷺ)was asked:                      “Which actions are best?” He said: “Raising one’svoice and slaughtering the sacrificial animal.”",
      "usc_msa_ref": "",
      "chain": [
        "30308",
        "32048",
        "20172",
        "20504",
        "11048",
        "2"
      ]
    },
    {
      "id": "sunan-ibn-majah-3286",
      "hadith_no": "3286",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Slaughtering - كتاب الذبائح",
      "chapter_no": "27",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا عبد الله بن وهب، حدثني عمرو بن الحارث، عن أيوب بن موسى، أنه حدثه أن يزيد بن عبد المزني حدثه أن النبي  صلى الله عليه وسلم  قال ‏\"‏ يعق عن الغلام ولا يمس رأسه بدم ‏\"‏ ‏.‏",
      "text_en": " Yazidbin ‘Abdul-Muzani narrated that the Prophet (ﷺ) said:                      “Offeran‘Aqiqah for the boy, but do not smear his head with blood.”",
      "usc_msa_ref": "",
      "chain": [
        "32048",
        "20029",
        "20377",
        "11241"
      ]
    },
    {
      "id": "sunan-ibn-majah-3316",
      "hadith_no": "3316",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Slaughtering - كتاب الذبائح",
      "chapter_no": "27",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا المغيرة بن عبد الرحمن، عن يزيد بن أبي عبيد، عن سلمة بن الأكوع، قال غزونا مع رسول الله  صلى الله عليه وسلم  غزوة خيبر فأمسى الناس قد أوقدوا النيران فقال النبي  صلى الله عليه وسلم  ‏\"‏ علام توقدون ‏\"‏ ‏.‏ قالوا على لحوم الحمر الإنسية فقال ‏\"‏ أهريقوا ما فيها واكسروها ‏\"‏ ‏.‏ فقال رجل من القوم أو نهريق ما فيها ونغسلها فقال النبي  صلى الله عليه وسلم  ‏\"‏ أو ذاك ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Salamah bin Akwa’ said:                      “We went out with theMessenger of Allah (ﷺ) on the campaign of Khaibar, and in theevening the people lit their fires. The Prophet (ﷺ) said: ‘Whatareyou cooking?’ They said: ‘The meat of domesticated donkeys.’He said:‘Throw out what is in them (the pots) and break them.’ Aman said: ‘Orcan we throw out what is in them and wash them?’The Prophet (ﷺ)said: ‘Or (do) that.’”",
      "usc_msa_ref": "",
      "chain": [
        "32048",
        "20182",
        "11450",
        "237"
      ]
    },
    {
      "id": "sunan-ibn-majah-3337",
      "hadith_no": "3337",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hunting - كتاب الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا معن بن عيسى، عن هشام بن سعد، عن زيد بن أسلم، عن ابن عمر، أن النبي  صلى الله عليه وسلم  قال ‏\"‏ ما قطع من البهيمة وهي حية فما قطع منها فهو ميتة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Umar that the Prophet (ﷺ) said:                      “Whateveriscut from an animal hen it is still alive, what is cut from it isMaitah (dead meat).”",
      "usc_msa_ref": "",
      "chain": [
        "32048",
        "30112",
        "20519",
        "11163",
        "18"
      ]
    },
    {
      "id": "sunan-ibn-majah-3425",
      "hadith_no": "3425",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، وحرملة بن يحيى، قالا حدثنا عبد الله بن وهب، أخبرني عمرو بن الحارث، حدثني سليمان بن زياد الحضرمي، أنه سمع عبد الله بن الحارث بن جزء الزبيدي، يقول كنا نأكل على عهد رسول الله  صلى الله عليه وسلم  في المسجد الخبز واللحم ‏.‏",
      "text_en": " It wasnarrated that ‘Abdullah bin Harith bin Jaz’ Az-Zubaidi said:                     “Atthe time of the Messenger of Allah (ﷺ) we used to eat bread andmeat in the mosque.”",
      "usc_msa_ref": "",
      "chain": [
        "32048",
        "30487",
        "20029",
        "20377",
        "16043",
        "4050"
      ]
    },
    {
      "id": "sunan-ibn-majah-3450",
      "hadith_no": "3450",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، وإسماعيل بن موسى، قالا حدثنا إبراهيم بن سعد، عن أبيه، عن عبد الله بن جعفر، قال رأيت رسول الله  صلى الله عليه وسلم  يأكل القثاء بالرطب ‏.‏",
      "text_en": " It wasnarrated ‘Abdullah bin Ja’far said:                      “I saw the Messenger ofAllah (ﷺ) eating cucumbers with dates.”",
      "usc_msa_ref": "",
      "chain": [
        "32048",
        "35016",
        "20150",
        "11063",
        "108"
      ]
    },
    {
      "id": "sunan-ibn-majah-3454",
      "hadith_no": "3454",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا محمد بن الصباح، ويعقوب بن حميد بن كاسب، قالا حدثنا عبد العزيز بن محمد، أخبرني سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، أن رسول الله  صلى الله عليه وسلم  كان إذا أتي بأول الثمرة قال ‏\"‏ اللهم بارك لنا في مدينتنا وفي ثمارنا وفي مدنا وفي صاعنا بركة مع بركة ‏\"‏ ‏.‏ ثم يناوله أصغر من بحضرته من الولدان ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that when the first fruits (of theseason)were brought, the Messenger of Allah (ﷺ) would say:                      “OAllah,bless us in our city and in our fruits, in our Mudd and in ourSa’,*blessing upon blessing.” Then he would give it to the smallestofthe children present.",
      "usc_msa_ref": "",
      "chain": [
        "30269",
        "32048",
        "20167",
        "11173",
        "11161",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-3461",
      "hadith_no": "3461",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا ابن وهب، أخبرني عمرو بن الحارث، أخبرني بكر بن سوادة، أن حنش بن عبد الله، حدثه عن أم أيمن، أنها غربلت دقيقا فصنعته للنبي  صلى الله عليه وسلم  رغيفا فقال ‏\"‏ ما هذا ‏\"‏ ‏.‏ قالت طعام نصنعه بأرضنا فأحببت أن أصنع منه لك رغيفا ‏.‏ فقال ‏\"‏ رديه فيه ثم اعجنيه ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Umm Ayman that she sifted some flour and made aloaf ofbread for the Prophet (ﷺ). He said:                      “What is this?” Shesaid:“It is food that we make in our land, and I wanted to make aloafof it for you. He said: “Fold it onto itself and knead it.”",
      "usc_msa_ref": "",
      "chain": [
        "32048",
        "20029",
        "20377",
        "10849",
        "202"
      ]
    },
    {
      "id": "sunan-ibn-majah-3468",
      "hadith_no": "3468",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا مروان بن معاوية، عن يزيد بن كيسان، عن أبي حازم، عن أبي هريرة، أنه قال والذي نفسي بيده ما شبع نبي الله  صلى الله عليه وسلم  ثلاثة أيام تباعا من خبز الحنطة حتى توفاه الله عز وجل ‏.‏",
      "text_en": " It wasnarrated that Abu Hurairah said:                      “By the One in Whose Hand ismysoul, the Prophet of Allah (ﷺ) never ate his fill of wheat breadfor three days in a row, until Allah took his soul.”",
      "usc_msa_ref": "",
      "chain": [
        "32048",
        "20201",
        "10845",
        "11172",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-3724-2",
      "hadith_no": "3724",
      "source": "Sunan Ibn Majah",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا إسماعيل بن عبد الله، حدثنا محمد بن نعيم بن عبد الله المجمر، عن أبيه، عن ابن طخفة الغفاري، عن أبي ذر، قال مر بي النبي  صلى الله عليه وسلم  وأنا مضطجع على بطني فركضني برجله وقال ‏\"‏ يا جنيدب إنما هذه ضجعة أهل النار ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Dharr said:                     \"The Prophet(ﷺ) passed by me and I was lying on my stomach. He nudged me with his foot and said: 'O Junaidib! This is how the people of Hell lie.'\"\"",
      "usc_msa_ref": "",
      "chain": [
        "32048",
        "30103",
        "20506",
        "23"
      ]
    },
    {
      "id": "sunan-ibn-majah-3725-2",
      "hadith_no": "3725",
      "source": "Sunan Ibn Majah",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا سلمة بن رجاء، عن الوليد بن جميل الدمشقي، أنه سمع القاسم بن عبد الرحمن، يحدث عن أبي أمامة، قال مر النبي  صلى الله عليه وسلم  على رجل نائم في المسجد منبطح على وجهه فضربه برجله وقال ‏\"‏ قم واقعد فإنها نومة جهنمية ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Umamah said:                     \"The Prophet(ﷺ) passed by a man who was sleeping in the masjid, lying on his face. He struck him with his foot and said: 'Get up' or; 'Sit up, fo this is a hellish kind of sleep.'\"",
      "usc_msa_ref": "",
      "chain": [
        "32048",
        "20325",
        "19127",
        "19896",
        "405"
      ]
    },
    {
      "id": "sunan-ibn-majah-3790",
      "hadith_no": "3790",
      "source": "Sunan Ibn Majah",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا المغيرة بن عبد الرحمن، عن عبد الله بن سعيد بن أبي هند، عن زياد بن أبي زياد، مولى ابن عياش عن أبي بحرية، عن أبي الدرداء، أن النبي  صلى الله عليه وسلم  قال ‏\"‏ ألا أنبئكم بخير أعمالكم وأرضاها عند مليككم وأرفعها في درجاتكم وخير لكم من إعطاء الذهب والورق ومن أن تلقوا عدوكم فتضربوا أعناقهم ويضربوا أعناقكم ‏\"‏ ‏.‏ قالوا وما ذاك يا رسول الله قال ‏\"‏ ذكر الله ‏\"‏ ‏.‏ وقال معاذ بن جبل ما عمل امرؤ بعمل أنجى له من عذاب الله عز وجل من ذكر الله ‏.‏",
      "text_en": " It was narrated from Abu Darda that the Prophet(ﷺ) said:                     \"Shall I not tell you of the best of your deeds, the most pleasing to your Sovereign, those that raise you most in status, that are better than your gold and silver, or meeting you enemy (in battle) and you strike their necks and they strike your necks?\" They said: \" WHat is that, O Messenger of Allah?\" He said: \"Remembering Allah(Dhikr).\"",
      "usc_msa_ref": "",
      "chain": [
        "32048",
        "20182",
        "11184",
        "19921",
        "37"
      ]
    },
    {
      "id": "sunan-ibn-majah-3826",
      "hadith_no": "3826",
      "source": "Sunan Ibn Majah",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا يعقوب بن حميد المدني، حدثنا محمد بن معن، حدثنا خالد بن سعيد، عن أبي زينب، مولى حازم بن حرملة عن حازم بن حرملة، قال مررت بالنبي  صلى الله عليه وسلم  فقال لي ‏\"‏ يا حازم أكثر من قول لا حول ولا قوة إلا بالله فإنها من كنوز الجنة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Hazim bin Harmalah said:                     \"I passed by the Prophet (saas) and he said to me: 'O Hazim, say often: \"La hawla wa la quwwata illa billah (there is no power and no strength except with Allah),\" for it is one of the treasures of Paradise.'\"",
      "usc_msa_ref": "",
      "chain": [
        "32048",
        "20180",
        "20422"
      ]
    },
    {
      "id": "sunan-ibn-majah-3868",
      "hadith_no": "3868",
      "source": "Sunan Ibn Majah",
      "chapter": "Supplication - كتاب الدعاء",
      "chapter_no": "34",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا عبد العزيز بن أبي حازم، عن سهيل، عن أبيه، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إذا أصبحتم فقولوا اللهم بك أصبحنا وبك أمسينا وبك نحيى وبك نموت وإذا أمسيتم فقولوا اللهم بك أمسينا وبك أصبحنا وبك نحيى وبك نموت وإليك المصير ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that :                     the Messenger of Allah (saas) said: \"In the morning say: 'Allahumma bika asbahna, wa bika amsayna, wa bika nahya, wa bika namut (O Allah, by Your leave we have reached the morning and by Your leave we reach the evening, and by Your leave we live and by Your leave we die). And when evening comes, say: Allahumma bika amsayna, wa bika asbahna, wa bika nahya, wa bika namut, wa ilaykal-masir (O Allah, by Your leave we have reached the evening and by Your leave we reach the morning, and by Your leave we live and by Your leave we die, and unto You is our return).\"",
      "usc_msa_ref": "",
      "chain": [
        "32048",
        "20165",
        "11172",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-3885",
      "hadith_no": "3885",
      "source": "Sunan Ibn Majah",
      "chapter": "Supplication - كتاب الدعاء",
      "chapter_no": "34",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا حاتم بن إسماعيل، عن عبد الله بن حسين بن عطاء بن يسار، عن سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، أن النبي  صلى الله عليه وسلم  كان إذا خرج من بيته قال ‏\"‏ بسم الله لا حول ولا قوة إلا بالله التكلان على الله ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that whenever he left his house, the Prophet (ﷺ) would say:                      “Bismillah, la hawla wa la quwwata illa billah, at-tuklanu ‘ala Allah (In the Name of Allah, there is no power and strength except with Allah, and trust is placed in Allah).”",
      "usc_msa_ref": "",
      "chain": [
        "32048",
        "20159",
        "11173",
        "11161",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-3918",
      "hadith_no": "3918",
      "source": "Sunan Ibn Majah",
      "chapter": "Interpretation of Dreams - كتاب تعبير الرؤيا",
      "chapter_no": "35",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب المدني، حدثنا سفيان بن عيينة، عن الزهري، عن عبيد الله بن عبد الله، عن ابن عباس، قال أتى النبي  صلى الله عليه وسلم  رجل منصرفه من أحد فقال يا رسول الله إني رأيت في المنام ظلة تنطف سمنا وعسلا ورأيت الناس يتكففون منها فالمستكثر والمستقل ورأيت سببا واصلا إلى السماء رأيتك أخذت به فعلوت به ثم أخذ به رجل بعدك فعلا به ثم أخذ به رجل بعده فعلا به ثم أخذ به رجل بعده فانقطع به ثم وصل له فعلا به ‏.‏ فقال أبو بكر دعني أعبرها يا رسول الله ‏.‏ قال ‏\"‏ اعبرها ‏\"‏ ‏.‏ قال أما الظلة فالإسلام وأما ما ينطف منها من العسل والسمن فهو القرآن حلاوته ولينه وأما ما يتكفف منه الناس فالآخذ من القرآن كثيرا وقليلا وأما السبب الواصل إلى السماء فما أنت عليه من الحق أخذت به فعلا بك ثم يأخذه رجل من بعدك فيعلو به ثم آخر فيعلو به ثم آخر فينقطع به ثم يوصل له فيعلو به ‏.‏ قال ‏\"‏ أصبت بعضا وأخطأت بعضا ‏\"‏ ‏.‏ قال أبو بكر أقسمت عليك يا رسول الله لتخبرني بالذي أصبت من الذي أخطأت ‏.‏ فقال النبي  صلى الله عليه وسلم  ‏\"‏ لا تقسم يا أبا بكر ‏\"‏ ‏.‏ حدثنا محمد بن يحيى، حدثنا عبد الرزاق، أنبأنا معمر، عن الزهري، عن عبيد الله، عن ابن عباس، قال كان أبو هريرة يحدث أن رجلا، أتى رسول الله  صلى الله عليه وسلم  فقال يا رسول الله رأيت ظلة بين السماء والأرض تنطف سمنا وعسلا فذكر الحديث نحوه ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “A man came to the Prophet(ﷺ),upon his return from Uhud, and said: ‘O Messenger of Allah, inmydream I saw a cloud giving shade, from which drops of ghee andhoneywere falling, and I saw people collecting them in the palms oftheirhands, some gathering a lot and some a little. And I saw a ropereaching up into heaven, and I saw you take hold of it and rise withit. Then another man took hold of it after you rose with it, thenanother man took hold of it after him and rose with it. Then a mantook hold of it after him and it broke, then it was reconnected andherose with it.’ Abu Bakr said: ‘Let me interpret it, OMessenger ofAllah.’ He said: ‘Interpret it.’ He said: ‘Asfor the cloud givingshade, it is Islam, and the drops of honey andghee that fall from it(represent) the Qur’an with its sweetnessand softness. As for thepeople collecting that in their palms, somelearn a lot of the Qur’anand some learn a little. As for the ropereaching up into heaven, itis the truth that you are following; youtook hold of it and rose withit, then another man till take hold ofit after you and rise with you,then another, who will rise with it,then another, but it will breakand then he reconnected, then he willrise with it.’ He said: ‘Youhave got some of it right and someof it wrong.’ Abu Bakr said: ‘Iadjure you O Messenger of Allah,tell me what I got right and what Igot wrong.’ The Prophet (ﷺ)said: ‘Do not swear, O Abu Bakr.”*",
      "usc_msa_ref": "",
      "chain": [
        "32048",
        "20005",
        "11013",
        "11004",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-4121",
      "hadith_no": "4121",
      "source": "Sunan Ibn Majah",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا عبد الرحمن بن إبراهيم، ويعقوب بن حميد بن كاسب، وسويد بن سعيد، قالوا حدثنا مروان بن معاوية الفزاري، حدثنا يزيد بن كيسان، عن أبي حازم، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ بدأ الإسلام غريبا وسيعود غريبا فطوبى للغرباء ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                      “Islam began as something strange and will go back to beingstrange, so glad tidings to the strangers.’”",
      "usc_msa_ref": "",
      "chain": [
        "30285",
        "32048",
        "30547",
        "20201",
        "10845",
        "11172",
        "13"
      ]
    }
  ],
  "total_hadiths": 57
}