{
  "id": "3205",
  "name": "Junadah bin Abi Umayya ( جنادة بن أبي أمية ( رضي الله عنه",
  "full_name": "Junadah bin Abi Umayya ( جنادة بن أبي أمية ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Hijaz",
      "place_display": {
        "en": "Hijaz",
        "ar": "الحجاز",
        "ckb": "حیجاز"
      }
    },
    "death": {
      "date_hijri": "80",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Syria",
      "reason": "Natural",
      "place_display": {
        "en": "Syria",
        "ar": "الشام",
        "ckb": "شام"
      }
    },
    "places_of_stay": [
      "Medina",
      "Syria",
      "Bahrain",
      "Egypt"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ ع  -  صحبة ]",
      "Governor"
    ],
    "tags": [
      "B.Azd",
      "B.Dausi",
      "Shami",
      "Child"
    ],
    "area_of_interest_display": [
      {
        "en": "Recitation/Quran",
        "ar": "تلاوة القرآن",
        "ckb": "خوێندنەوە/قورئان"
      },
      {
        "en": "Narrator [ ع  -  صحبة ]",
        "ar": "Narrator [ ع  -  صحبة ]",
        "ckb": "Narrator [ ع  -  صحبة ]"
      },
      {
        "en": "Governor",
        "ar": "Governor",
        "ckb": "Governor"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "Medina",
        "ar": "المدينة المنورة",
        "ckb": "مەدینە"
      },
      {
        "en": "Syria",
        "ar": "الشام",
        "ckb": "شام"
      },
      {
        "en": "Bahrain",
        "ar": "Bahrain",
        "ckb": "Bahrain"
      },
      {
        "en": "Egypt",
        "ar": "مصر",
        "ckb": "میسر"
      }
    ],
    "tags_display": [
      {
        "en": "B.Azd",
        "ar": "B.Azd",
        "ckb": "B.Azd"
      },
      {
        "en": "B.Dausi",
        "ar": "B.Dausi",
        "ckb": "B.Dausi"
      },
      {
        "en": "Shami",
        "ar": "Shami",
        "ckb": "Shami"
      },
      {
        "en": "Child (Young Companion)",
        "ar": "صغير الصحابة",
        "ckb": "منداڵ"
      }
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah",
      "grade_display": {
        "en": "Messenger of Allah",
        "ar": "رسول الله",
        "ckb": "پێغەمبەری خودا"
      }
    },
    {
      "id": "3",
      "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "5",
      "name": "Ali ibn Abi Talib ( علي بن أبي طالب بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "32",
      "name": "Mu'adh ibn Jabal ( معاذ بن جبل بن عمرو بن أوس ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "37",
      "name": "Abu al-Darda ( أبو الدرداء عويمر بن زيد بن قيس الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "29",
      "name": "'Abdullah bin 'Amr bin al-'Aas ( عبد الله بن عمرو بن العاص ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "40",
      "name": "'Ubada bin As-Samit ( عبادة بن الصامت بن قيس بن أصرم ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "4079",
      "name": "Basr bin Artah ( بسر بن أرطاة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    }
  ],
  "students": [],
  "hadiths": [
    {
      "id": "sahih-bukhari-1154",
      "hadith_no": "1154",
      "source": "Sahih Bukhari",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا صدقة بن الفضل، أخبرنا الوليد، عن الأوزاعي، قال حدثني عمير بن هانئ، قال حدثني جنادة بن أبي أمية، حدثني عبادة بن الصامت، عن النبي صلى الله عليه وسلم قال ‏\"‏ من تعار من الليل فقال لا إله إلا الله وحده لا شريك له، له الملك، وله الحمد، وهو على كل شىء قدير‏.‏ الحمد لله، وسبحان الله، ولا إله إلا الله، والله أكبر، ولا حول ولا قوة إلا بالله‏.‏ ثم قال اللهم اغفر لي‏.‏ أو دعا استجيب، فإن توضأ وصلى قبلت صلاته ‏\"‏‏.‏",
      "text_en": " Narrated 'Ubada bin As-Samit:                     The Prophet \"Whoever gets up at night and says: -- 'La ilaha il-lallah Wahdahu la Sharika lahu Lahu-lmulk, waLahu-l-hamd wahuwa 'ala kullishai'in Qadir. Al hamdu lil-lahi wa subhanal-lahi wa la-ilaha il-lal-lah wa-l-lahu akbar wa la hawla Wala Quwata il-la-bil-lah.' (None has the right to be worshipped but Allah. He is the Only One and has no partners . For Him is the Kingdom and all the praises are due for Him. He is Omnipotent. All the praises are for Allah. All the glories are for Allah. And none has the right to be worshipped but Allah, And Allah is Great And there is neither Might nor Power Except with Allah). And then says: -- Allahumma, Ighfir li (O Allah! Forgive me). Or invokes (Allah), he will be responded to and if he performs ablution (and prays), his prayer will be accepted.\"",
      "usc_msa_ref": "",
      "chain": [
        "30343",
        "20733",
        "20024",
        "11415",
        "3205",
        "40"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-3435",
      "hadith_no": "3435",
      "source": "Sahih Bukhari",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا صدقة بن الفضل، حدثنا الوليد، عن الأوزاعي، قال حدثني عمير بن هانئ، قال حدثني جنادة بن أبي أمية، عن عبادة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ من شهد أن لا إله إلا الله وحده لا شريك له، وأن محمدا عبده ورسوله، وأن عيسى عبد الله ورسوله وكلمته، ألقاها إلى مريم، وروح منه، والجنة حق والنار حق، أدخله الله الجنة على ما كان من العمل ‏\"‏‏.‏ قال الوليد حدثني ابن جابر عن عمير عن جنادة وزاد ‏\"‏ من أبواب الجنة الثمانية، أيها شاء ‏\"‏‏.‏",
      "text_en": " Narrated 'Ubada:                     The Prophet said, \"If anyone testifies that None has the right to be worshipped but Allah Alone Who has no partners, and that Muhammad is His Slave and His Apostle, and that Jesus is Allah's Slave and His Apostle and His Word which He bestowed on Mary and a Spirit created by Him, and that Paradise is true, and Hell is true, Allah will admit him into Paradise with the deeds which he had done even if those deeds were few.\" (Junada, the sub-narrator said, \" 'Ubada added, 'Such a person can enter Paradise through any of its eight gates he likes.\")",
      "usc_msa_ref": "644",
      "chain": [
        "30343",
        "20733",
        "20024",
        "11415",
        "3205"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-7142",
      "hadith_no": "7142",
      "source": "Sahih Bukhari",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا إسماعيل، حدثني ابن وهب، عن عمرو، عن بكير، عن بسر بن سعيد، عن جنادة بن أبي أمية، قال دخلنا على عبادة بن الصامت وهو مريض قلنا أصلحك الله حدث بحديث، ينفعك الله به سمعته من النبي، صلى الله عليه وسلم‏.‏ قال دعانا النبي صلى الله عليه وسلم فبايعناه",
      "text_en": " Narrated Junada bin Abi Umaiya:                     We entered upon 'Ubada bin As-Samit while he was sick. We said, \"May Allah make you healthy. Will you tell us a Hadith you heard from the Prophet and by which Allah may make you benefit?\" He said, \"The Prophet called us and we gave him the Pledge of allegiance for Islam, and among the conditions on which he took the Pledge from us, was that we were to listen and obey (the orders) both at the time when we were active and at the time when we were tired, and at our difficult time and at our ease and to be obedient to the ruler and give him his right even if he did not give us our right, and not to fight against him unless we noticed him having open Kufr (disbelief) for which we would have a proof with us from Allah.\"",
      "usc_msa_ref": "178",
      "chain": [
        "30103",
        "20029",
        "20377",
        "11154",
        "11153",
        "3205"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-muslim-149",
      "hadith_no": "149",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا داود بن رشيد، حدثنا الوليد، - يعني ابن مسلم - عن ابن جابر، قال حدثني عمير بن هانئ، قال حدثني جنادة بن أبي أمية، حدثنا عبادة بن الصامت، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من قال أشهد أن لا إله إلا الله وحده لا شريك له وأن محمدا عبده ورسوله وأن عيسى عبد الله وابن أمته وكلمته ألقاها إلى مريم وروح منه وأن الجنة حق وأن النار حق أدخله الله من أى أبواب الجنة الثمانية شاء ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Ubadah b. Samit that the messenger of Allah (may peace be upon him) observed:                      He who said:\" There is no god but Allah, He is One and there is no associate with Him, that Muhammad is his servant and His messenger, that Christ is servant and the son of His slave-girl and he (Christ) His word which He communicated to Mary and is His Spirit, that Paradise is a fact and Hell is a fact,\" Allah would make him (he who affirms these truths enter Paradise through any one of its eight doors which he would like.",
      "usc_msa_ref": "",
      "chain": [
        "30248",
        "20733",
        "11415",
        "3205",
        "40"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-4877",
      "hadith_no": "4877",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا أحمد بن عبد الرحمن بن وهب بن مسلم، حدثنا عمي عبد الله بن وهب، حدثنا عمرو بن الحارث، حدثني بكير، عن بسر بن سعيد، عن جنادة بن أبي أمية، قال دخلنا على عبادة بن الصامت وهو مريض فقلنا حدثنا أصلحك الله، بحديث ينفع الله به سمعته من، رسول الله صلى الله عليه وسلم ‏.‏ فقال دعانا رسول الله صلى الله عليه وسلم فبايعناه فكان فيما أخذ علينا أن بايعنا على السمع والطاعة في منشطنا ومكرهنا وعسرنا ويسرنا وأثرة علينا وأن لا ننازع الأمر أهله قال ‏\"‏ إلا أن تروا كفرا بواحا عندكم من الله فيه برهان ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Junida b. Abu Umayya who said:                      We called upon 'Ubada b. Samit who was ill and said to him: May God give you health I Narrate to us a tradition which God may prove beneficial (to us) and which you have heard from the Messenger of Allah (may peace be upon him). He said: The Messenger of Allah (may peace be upon him) called us and we took the oath of allegiance to him. Among the injunctions he made binding upon us was: Listening and obedience (to the Amir) in our pleasure and displeasure, in our adversity and prosperity, even when somebody is given preference over us, and without disputing the delegation of powers to a man duly invested with them (Obedience shall be accorded to him in all circumstances) except when you have clear signs of his disbelief in (or disobedience to) God-signs that could be used as a conscientious justification (for non-compliance with his orders).",
      "usc_msa_ref": "",
      "chain": [
        "20377",
        "11154",
        "11153",
        "3205"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sunan-abi-daud-3417",
      "hadith_no": "3417",
      "source": "Sunan Abi Da'ud",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا عمرو بن عثمان، وكثير بن عبيد، قالا حدثنا بقية، حدثني بشر بن عبد الله بن يسار، قال عمرو حدثني عبادة بن نسى، عن جنادة بن أبي أمية، عن عبادة بن الصامت، نحو هذا الخبر - والأول أتم - فقلت ما ترى فيها يا رسول الله فقال ‏\"‏ جمرة بين كتفيك تقلدتها ‏\"‏ ‏.‏ أو ‏\"‏ تعلقتها ‏\"‏ ‏.‏",
      "text_en": " A similar tradition has also been transmitted by 'Ubadah b. al-Samit through a different chain of narrators, but the former tradition is more perfect. This version has:                      I said: What do you think about it, Messenger of Allah? He said: A live coal between your shoulders which you have put around your neck or hanged it.",
      "usc_msa_ref": "",
      "chain": [
        "10581",
        "38462",
        "20644",
        "11081",
        "3205",
        "40"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-4320",
      "hadith_no": "4320",
      "source": "Sunan Abi Da'ud",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا حيوة بن شريح، حدثنا بقية، حدثني بحير، عن خالد بن معدان، عن عمرو بن الأسود، عن جنادة بن أبي أمية، عن عبادة بن الصامت، أنه حدثهم أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إني قد حدثتكم عن الدجال حتى خشيت أن لا تعقلوا إن مسيح الدجال رجل قصير أفحج جعد أعور مطموس العين ليس بناتئة ولا جحراء فإن ألبس عليكم فاعلموا أن ربكم ليس بأعور ‏\"‏ ‏.‏ قال أبو داود عمرو بن الأسود ولي القضاء ‏.‏",
      "text_en": " Narrated Ubadah ibn as-Samit:                     The Prophet (ﷺ) said: I have told you so much about the Dajjal (Antichrist) that I am afraid you may not understand. The Antichrist is short, hen-toed, woolly-haired, one-eyed, an eye-sightless, and neither protruding nor deep-seated. If you are confused about him, know that your Lord is not one-eyed.Abu Dawud said: 'Amr bin Al-Aswad was appointed a judge.",
      "usc_msa_ref": "",
      "chain": [
        "26010",
        "20644",
        "11422",
        "11714",
        "3205",
        "40"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-4408",
      "hadith_no": "4408",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، أخبرني حيوة بن شريح، عن عياش بن عباس القتباني، عن شييم بن بيتان، ويزيد بن صبح الأصبحي، عن جنادة بن أبي أمية، قال كنا مع بسر بن أرطاة في البحر فأتي بسارق يقال له مصدر قد سرق بختية فقال قد سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا تقطع الأيدي في السفر ‏\"‏ ‏.‏ ولولا ذلك لقطعته ‏.‏",
      "text_en": " Narrated Busr ibn Artat:                     Junadah ibn AbuUmayyah said: We were with Busr ibn Artat on the sea (on an expedition). A thief called Misdar who had stolen a bukhti she-camel was brought. He said: I heard the Messenger of Allah (ﷺ) say: Hands are not to be cut off during a warlike expedition. Had it not been so, I would have cut it off.",
      "usc_msa_ref": "",
      "chain": [
        "30226",
        "20029",
        "26010",
        "10871",
        "16050",
        "16115",
        "3205"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-5060",
      "hadith_no": "5060",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا عبد الرحمن بن إبراهيم الدمشقي، حدثنا الوليد، قال قال الأوزاعي حدثني عمير بن هانئ، قال حدثني جنادة بن أبي أمية، عن عبادة بن الصامت، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من تعار من الليل فقال حين يستيقظ لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شىء قدير سبحان الله والحمد لله ولا إله إلا الله والله أكبر ولا حول ولا قوة إلا بالله ثم دعا رب اغفر لي ‏\"‏ ‏.‏ قال الوليد أو قال ‏\"‏ دعا استجيب له فإن قام فتوضأ ثم صلى قبلت صلاته ‏\"‏ ‏.‏",
      "text_en": " ‘Ubadah b. al-Samit reported the Messenger of Allah (May peace be upon him) as saying; If anyone is alarmed while asleep and he says when awakes :                      there is no god but Allah alone Who has no partner, to whom dominion belongs, to whom praise is due, and who has power over everything (omnipotent). Glory be to Allah, and praise be to Allah, and there is no god but Allah, and then he prays: O my Lord, forgive me. Abu Dawud said : Al-Walid’s version has; and he prays, his prayer will be answered. If he gets up, performs ablution, and prays, his prayer will be accepted.",
      "usc_msa_ref": "",
      "chain": [
        "20733",
        "20024",
        "11415",
        "3205",
        "40"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "jami-al-tirmidhi-1450",
      "hadith_no": "1450",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Legal Punishments (Al-Hudud) - كتاب الحدود عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "17",
      "text_ar": "حدثنا قتيبة، حدثنا ابن لهيعة، عن عياش بن عباس المصري، عن شييم بن بيتان، عن جنادة بن أبي أمية، عن بسر بن أرطاة، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ لا تقطع الأيدي في الغزو ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏ وقد روى غير ابن لهيعة بهذا الإسناد نحو هذا ‏.‏ ويقال بسر بن أبي أرطاة أيضا ‏.‏ والعمل على هذا عند بعض أهل العلم منهم الأوزاعي لا يرون أن يقام الحد في الغزو بحضرة العدو مخافة أن يلحق من يقام عليه الحد بالعدو فإذا خرج الإمام من أرض الحرب ورجع إلى دار الإسلام أقام الحد على من أصابه ‏.‏ كذلك قال الأوزاعي ‏.‏",
      "text_en": " Narrated Busr Bin Artah:                     That the Prophet (ﷺ) said: \"The hands are not cut in the battles.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20624",
        "10871",
        "16050",
        "3205"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-3414-2",
      "hadith_no": "3414",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا الوليد بن مسلم، حدثنا الأوزاعي، حدثني عمير بن هانئ، قال حدثني جنادة بن أبي أمية، حدثني عبادة بن الصامت، رضى الله عنه عن رسول الله صلى الله عليه وسلم قال ‏\"‏ من تعار من الليل فقال لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شيء قدير وسبحان الله والحمد لله ولا إله إلا الله والله أكبر ولا حول ولا قوة إلا بالله ثم قال رب اغفر لي أو قال ثم دعا استجيب له فإن عزم فتوضأ ثم صلى قبلت صلاته ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏",
      "text_en": " Ubadah bin As-Samit, may Allah be pleased with him, narrated that:                     The Messenger of Allah said: “Whoever wakes up in the night and say, ‘None has the right to be worshipped but Allah, alone, without partner, to Him belongs the Dominion, and to Him is the praise, and He has power over all things. And Glory is to Allah, and all the praise is to Allah, and ‘None has the right to be worshipped but Allah, and Allah is the greatest, and there is no might nor power except by Allah (La Ilaha Illallah, Wahdahu La Sharika Lahu, Lahul-Mulku Wa Lahul-Hamdu, Wa Huwa ala Kulli Shai’in Qadir. Wa Subhan Allah, Walhamdullilah, Wa La Ilaha Illallah, Wa Allahu Akbar, Wa La Hawla Wa La Quwwata Illa Billah.)’ – then he said: ‘O my Lord, forgive me (Rabbighfirli)’ – or he said – ‘then he supplicates, he shall be responded to. So he makes a firm determination, then performs Wudu, then he performs Salat, his Salat shall be accepted.”",
      "usc_msa_ref": "",
      "chain": [
        "20733",
        "20024",
        "11415",
        "3205",
        "40"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "sunan-an-nasai-4750",
      "hadith_no": "4750",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا عبد الرحمن بن إبراهيم، دحيم قال حدثنا مروان، قال حدثنا الحسن، - وهو ابن عمرو - عن مجاهد، عن جنادة بن أبي أمية، عن عبد الله بن عمرو، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من قتل قتيلا من أهل الذمة لم يجد ريح الجنة وإن ريحها ليوجد من مسيرة أربعين عاما ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin 'Amr said:                     \"The Messenger of Allah said: 'Whoever kills a person from among Ahl Adh-Dhimmah, he will not smell the fragrance of Paradise, and its fragrance may be detected from a distance of forty years.\"",
      "usc_msa_ref": "",
      "chain": [
        "30285",
        "20201",
        "11624",
        "11028",
        "3205",
        "29"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-4979",
      "hadith_no": "4979",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرنا عمرو بن عثمان، قال حدثني بقية، قال حدثني نافع بن يزيد، قال حدثني حيوة بن شريح، عن عياش بن عباس، عن جنادة بن أبي أمية، قال سمعت بسر بن أبي أرطاة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا تقطع الأيدي في السفر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Junadah bin Abi Umayyah said:                     \"I heard Busr bin Abi Artah say: 'I heard the Messenger of Allah say: Hand should not be cut off while traveling.\"'",
      "usc_msa_ref": "",
      "chain": [
        "10581",
        "20644",
        "20629",
        "26010",
        "10871",
        "3205"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-ibn-majah-3657",
      "hadith_no": "3657",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا عمرو بن عثمان بن سعيد بن كثير بن دينار الحمصي، حدثنا أبي، عن ابن ثوبان، عن عمير، أنه سمع جنادة بن أبي أمية، قال سمعت عبادة بن الصامت، يقول أتى جبرائيل عليه السلام النبي  صلى الله عليه وسلم  وهو يوعك فقال بسم الله أرقيك من كل شىء يؤذيك من حسد حاسد ومن كل عين الله يشفيك ‏.‏",
      "text_en": " It wasnarrated from ‘Aishah that the Prophet (ﷺ) used to blow whenperforming Ruqyah.",
      "usc_msa_ref": "",
      "chain": [
        "10581",
        "4",
        "3205",
        "40"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-3878",
      "hadith_no": "3878",
      "source": "Sunan Ibn Majah",
      "chapter": "Supplication - كتاب الدعاء",
      "chapter_no": "34",
      "text_ar": "حدثنا عبد الرحمن بن إبراهيم الدمشقي، حدثنا الوليد بن مسلم، حدثنا الأوزاعي، حدثني عمير بن هانئ، حدثني جنادة بن أبي أمية، عن عبادة بن الصامت، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من تعار من الليل فقال حين يستيقظ لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شىء قدير سبحان الله والحمد لله ولا إله إلا الله والله أكبر ولا حول ولا قوة إلا بالله العلي العظيم ثم دعا رب اغفر لي - غفر له ‏\"‏ ‏.‏ قال الوليد أو قال ‏\"‏ دعا استجيب له فإن قام فتوضأ ثم صلى قبلت صلاته ‏\"‏ ‏.‏",
      "text_en": " It was narrated that ‘Ubadah bin As-Samit said:                      “The Messenger of Allah (ﷺ) said: ‘Whoever wakes up in the morning and says upon waking: La ilaha illallah wahdahu la sharika lahu, lahul-mulku wa lahul-hamdu, wa Huwa ‘ala kulli shay’in Qadir; Subhan-Allah walhamdu lillahi, wa la ilaha illallahu, wa Allahu Akbar, wa la hawla wa la quwwata illa billahil-‘Aliyil-‘Azim (None has the right to be worshipped but Allah alone, with no partner or associate. His is the dominion and all praise is to Him, and He is Able to do all things. Glory is to Allah, praise is to Allah, none has the right to be worshiped but Allah, Allah is the Most Great, and there is no power and no strength except with Allah, the Most High, the Most Supreme), then he supplicates Rabbighfirli (O Lord, forgive me), he will be forgiven.’”Walid said: “Or he said: then if he supplicated, it will be answered for him then if he stood up and performed ablution and then performed prayer, his prayer would be accepted.”",
      "usc_msa_ref": "",
      "chain": [
        "30285",
        "20733",
        "20024",
        "11415",
        "3205",
        "40"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    }
  ],
  "total_hadiths": 15,
  "grade_display": {
    "en": "Companion (RA) [1st Generation]",
    "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
    "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
  }
}