{
  "id": "323",
  "name": "Rifa'a bin Rafi' bin Malik bin al-'Ajlan ( رفاعة بن رافع بن مالك بن العجلان ( رضي الله عنه",
  "full_name": "Rifa'a bin Rafi' bin Malik bin al-'Ajlan ( رفاعة بن رافع بن مالك بن العجلان ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medinah"
    },
    "death": {
      "date_hijri": "42",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Medinah",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medinah"
    ],
    "area_of_interest": [
      "Recitation/Quran"
    ],
    "tags": [
      "Ansar",
      "Khazraj",
      "B.Jusham B.al-Khazraj",
      "B.Zurayq",
      "Badr",
      "Uhud"
    ]
  },
  "parents": [
    {
      "id": "321",
      "name": "Rafi' bin Malik bin al-'Ajlan ( رافع بن مالك بن العجلان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "309",
      "name": "Umm Malik bint Ubayy bin Malik ( أم مالك بنت أبي بن مالك الأنصارية ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "322",
      "name": "Malik bin Rafi' bin Malik ( مالك بن رافع بن مالك بن العجلان ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "324",
      "name": "Khallad bin Rafi' bin Malik ( خلاد بن رافع بن مالك بن العجلان ( رضي الله عنه",
      "grade": "Comp.(RA)"
    }
  ],
  "children": [
    {
      "id": "19828",
      "name": "'Ubaid bin Rifa'a bin Rafi' bin Malik عبيد بن رفاعة الزرقي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11554",
      "name": "Mu'adh bin Rifa'a bin Rafi' bin Malik معاذ بن رفاعة الزرقي",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "2",
      "name": "Abu Bakr Al-Siddique ( أبو بكر الصديق ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "40",
      "name": "'Ubada bin As-Samit ( عبادة بن الصامت بن قيس بن أصرم ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "19828",
      "name": "'Ubaid bin Rifa'a bin Rafi' bin Malik عبيد بن رفاعة الزرقي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11554",
      "name": "Mu'adh bin Rifa'a bin Rafi' bin Malik معاذ بن رفاعة الزرقي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "325",
      "name": "Yahya bin Khallad bin Rafi' bin Malik ( يحيى بن خلاد بن رافع بن مالك ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11710",
      "name": "'Ali bin Yahya bin Khlad علي بن يحيى بن خلاد بن رافع",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "799",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن نعيم بن عبد الله المجمر، عن علي بن يحيى بن خلاد الزرقي، عن أبيه، عن رفاعة بن رافع الزرقي، قال كنا يوما نصلي وراء النبي صلى الله عليه وسلم فلما رفع رأسه من الركعة قال ‏\"‏ سمع الله لمن حمده ‏\"‏‏.‏ قال رجل وراءه ربنا ولك الحمد، حمدا كثيرا طيبا مباركا فيه، فلما انصرف قال ‏\"‏ من المتكلم ‏\"‏‏.‏ قال أنا‏.‏ قال ‏\"‏ رأيت بضعة وثلاثين ملكا يبتدرونها، أيهم يكتبها أول ‏\"‏‏.‏",
      "text_en": " Narrated Rifa`a bin Rafi` Az-Zuraqi:                     One day we were praying behind the Prophet. When he raised his head from bowing, he said, \"Sami`a l-lahu liman hamidah.\" A man behind him said, \"Rabbana wa laka l-hamdu, hamdan kathiran taiyiban mubarakan fihi\" (O our Lord! All the praises are for You, many good and blessed praises). When the Prophet completed the prayer, he asked, \"Who has said these words?\" The man replied, \"I.\" The Prophet said, \"I saw over thirty angels competing to write it first.\" Prophet rose (from bowing) and stood straight till all the vertebrae of his spinal column came to a natural position.",
      "chain": [
        "20164",
        "20001",
        "11225",
        "11710",
        "325",
        "323"
      ]
    },
    {
      "hadith_no": "4042",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني إسحاق بن إبراهيم، أخبرنا جرير، عن يحيى بن سعيد، عن معاذ بن رفاعة بن رافع الزرقي، عن أبيه  وكان أبوه من أهل بدر  قال جاء جبريل إلى النبي صلى الله عليه وسلم فقال ‏\"‏ ما تعدون أهل بدر فيكم قال من أفضل المسلمين  أو كلمة نحوها  قال وكذلك من شهد بدرا من الملائكة ‏\"‏‏.‏",
      "text_en": " Narrated Rifaa:                     (who was one of the Badr warriors) Gabriel came to the Prophet and said, \"How do you look upon the warriors of Badr among yourselves?\" The Prophet said, \"As the best of the Muslims.\" or said a similar statement. On that, Gabriel said, \"And so are the Angels who participated in the Badr (battle).",
      "chain": [
        "30123",
        "20028",
        "11062",
        "11554",
        "323"
      ]
    },
    {
      "hadith_no": "770",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا القعنبي، عن مالك، عن نعيم بن عبد الله المجمر، عن علي بن يحيى الزرقي، عن أبيه، عن رفاعة بن رافع الزرقي، قال كنا يوما نصلي وراء رسول الله صلى الله عليه وسلم فلما رفع رسول الله صلى الله عليه وسلم رأسه من الركوع قال ‏\"‏ سمع الله لمن حمده ‏\"‏ ‏.‏ قال رجل وراء رسول الله صلى الله عليه وسلم اللهم ربنا ولك الحمد حمدا كثيرا طيبا مباركا فيه فلما انصرف رسول الله صلى الله عليه وسلم قال ‏\"‏ من المتكلم بها آنفا ‏\"‏ ‏.‏ فقال الرجل أنا يا رسول الله ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لقد رأيت بضعة وثلاثين ملكا يبتدرونها أيهم يكتبها أول ‏\"‏ ‏.‏",
      "text_en": " Rifa’ah b. Rafi’ said:                      One day we were praying behind the Messenger of Allah (ﷺ). When the Messenger of Allah (ﷺ) raised his head after bowing, he said: Allah listened to him who praised Him. A man behind the Messenger of Allah(ﷺ) said: O Allah, Our Lord, and to Thee be praise, much praise, good and blessed. When the Messenger of Allah (ﷺ) finished his prayer, he asked: Which of you if the one who spoke (the words) just now. The man said: I (uttered) these words, Prophet of Allah. The Messenger of Allah(ﷺ) said: I saw more than thirty angels racing against one another to be the one to write them first.",
      "chain": [
        "20164",
        "20001",
        "11225",
        "11710",
        "325",
        "323"
      ]
    },
    {
      "hadith_no": "773",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة بن سعيد، وسعيد بن عبد الجبار، نحوه قال قتيبة حدثنا رفاعة بن يحيى بن عبد الله بن رفاعة بن رافع، عن عم، أبيه معاذ بن رفاعة بن رافع عن أبيه، قال صليت خلف رسول الله صلى الله عليه وسلم فعطس رفاعة لم يقل قتيبة رفاعة فقلت الحمد لله حمدا كثيرا طيبا مباركا فيه مباركا عليه كما يحب ربنا ويرضى فلما صلى رسول الله صلى الله عليه وسلم انصرف فقال ‏\"‏ من المتكلم في الصلاة ‏\"‏ ‏.‏ ثم ذكر نحو حديث مالك وأتم منه ‏.‏",
      "text_en": " Narrated Rifa'ah ibn Rafi':                     I offered prayer behind the Messenger of Allah (ﷺ). Rifa'ah sneezed. The narrator Qutaybah did not mention the name Rifa'ah (but he said: I sneezed). So I said: Praise be to Allah, praise much, good and blessed therein, blessed thereupon, as our Lord likes and is pleased. When the Messenger of Allah (ﷺ) finished his prayer, he turned and said: Who was the speaker in prayer? He then narrated the rest of the tradition like that of Malik and completed it.",
      "chain": [
        "30367",
        "30416",
        "30367",
        "11554",
        "323"
      ]
    },
    {
      "hadith_no": "858",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا الحسن بن علي، حدثنا هشام بن عبد الملك، والحجاج بن منهال، قالا حدثنا همام، حدثنا إسحاق بن عبد الله بن أبي طلحة، عن علي بن يحيى بن خلاد، عن أبيه، عن عمه، رفاعة بن رافع بمعناه قال فقال رسول الله صلى الله عليه وسلم ‏\"‏ إنها لا تتم صلاة أحدكم حتى يسبغ الوضوء كما أمره الله عز وجل فيغسل وجهه ويديه إلى المرفقين ويمسح برأسه ورجليه إلى الكعبين ثم يكبر الله عز وجل ويحمده ثم يقرأ من القرآن ما أذن له فيه وتيسر ‏\"‏ ‏.‏ فذكر نحو حديث حماد قال ‏\"‏ ثم يكبر فيسجد فيمكن وجهه ‏\"‏ ‏.‏ قال همام وربما قال ‏\"‏ جبهته من الأرض حتى تطمئن مفاصله وتسترخي ثم يكبر فيستوي قاعدا على مقعده ويقيم صلبه ‏\"‏ ‏.‏ فوصف الصلاة هكذا أربع ركعات حتى فرغ ‏\"‏ لا تتم صلاة أحدكم حتى يفعل ذلك ‏\"‏ ‏.‏",
      "text_en": " Narrated Rifa'ah ibn Rafi':                     This version (of Hadith No 856) adds: The Messenger of Allah (ﷺ) said: The prayer of any of you is not complete until he performs ablution perfectly, as Allah, the Exalted, has ordered you. He should wash his face and hands up to the elbows, and wipe his head and (wash) his feet up to the ankles. Then he should exalt Allah and praise Him. Then he should recite the Qur'an as much as it is convenient for him. (Narrator then narrated the tradition like Hammad's, No. 856). He said: He then utter the takbir and prostration himself so that his face is at rest. Hammam (sub-narrator) said: Sometimes he reported: So that his forehead is at rest on the ground, and his joints return to their places and are loosened. Then he should say the takbir and then sit right on his hips and erect his back. He described the nature of prayer in this way by offering four rak'ahs until he finished it. The prayer of any of you is not complete unless he does so.",
      "chain": [
        "30115",
        "20219",
        "20297",
        "11151",
        "11710",
        "325",
        "323"
      ]
    },
    {
      "hadith_no": "859",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا وهب بن بقية، عن خالد، عن محمد، - يعني ابن عمرو - عن علي بن يحيى بن خلاد، عن أبيه، عن رفاعة بن رافع، بهذه القصة قال ‏\"‏ إذا قمت فتوجهت إلى القبلة فكبر ثم اقرأ بأم القرآن وبما شاء الله أن تقرأ وإذا ركعت فضع راحتيك على ركبتيك وامدد ظهرك ‏\"‏ ‏.‏ وقال ‏\"‏ إذا سجدت فمكن لسجودك فإذا رفعت فاقعد على فخذك اليسرى ‏\"‏ ‏.‏",
      "text_en": " This tradition has also been transmitted through a different chain of narrators by Rifa’ah b. Rafi. This version goes:                      When you get up and face the qiblah, what Allah wishes you to recite. And when you bow, put your palms on your knees and stretch out your back. When you prostrate yourself, do it completely( so that you are at the rest). When you raise yourself then sit on your left thigh.",
      "chain": [
        "30569",
        "20423",
        "11220",
        "11710",
        "325",
        "323"
      ]
    },
    {
      "hadith_no": "860",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مؤمل بن هشام، حدثنا إسماعيل، عن محمد بن إسحاق، حدثني علي بن يحيى بن خلاد بن رافع، عن أبيه، عن عمه، رفاعة بن رافع عن النبي صلى الله عليه وسلم بهذه القصة قال ‏\"‏ إذا أنت قمت في صلاتك فكبر الله تعالى ثم اقرأ ما تيسر عليك من القرآن ‏\"‏ ‏.‏ وقال فيه ‏\"‏ فإذا جلست في وسط الصلاة فاطمئن وافترش فخذك اليسرى ثم تشهد ثم إذا قمت فمثل ذلك حتى تفرغ من صلاتك ‏\"‏ ‏.‏",
      "text_en": " This tradition has also been transmitted by Rifa’ah b Rafi through a different chain of narrators. This version has :                      When you get up to pray, say the takbir, exalting Allah; then recite the Qur’an as much as it is convenient for you. The version adds: When you sit in the middle of the prayer, do it completely(so that you are at rest) and spread your left thigh; then recite the tashahhud. Then if you get up (again), do in a similar way until you finish your prayer.",
      "chain": [
        "30180",
        "20208",
        "11107",
        "11120",
        "323"
      ]
    },
    {
      "hadith_no": "861",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عباد بن موسى الختلي، حدثنا إسماعيل، - يعني ابن جعفر - أخبرني يحيى بن علي بن يحيى بن خلاد بن رافع الزرقي، عن أبيه، عن جده، عن رفاعة بن رافع، أن رسول الله صلى الله عليه وسلم فقص هذا الحديث قال فيه ‏\"‏ فتوضأ كما أمرك الله جل وعز ثم تشهد فأقم ثم كبر فإن كان معك قرآن فاقرأ به وإلا فاحمد الله وكبره وهلله ‏\"‏ ‏.‏ وقال فيه ‏\"‏ وإن انتقصت منه شيئا انتقصت من صلاتك ‏\"‏ ‏.‏",
      "text_en": " Rifa’ah b. Rafi has also narrated this tradition through a different chain from the Messenger of Allah(ﷺ). This version goes:                      Then perform ablution in a way Allah, the exalted, has command you, then say the shahadah and get up and say the takbir. Then if you know any of the Qur’an, recite it; otherwise say: “Praise be to Allah”; “Allah is most great”; “ There is no god but Allah” He ( the narrator) also said in this version: If some defect remains in this, that detect will remain in your prayer.",
      "chain": [
        "30255",
        "20155",
        "29225",
        "323"
      ]
    },
    {
      "hadith_no": "302",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا علي بن حجر، أخبرنا إسماعيل بن جعفر، عن يحيى بن علي بن يحيى بن خلاد بن رافع الزرقي، عن جده، عن رفاعة بن رافع، أن رسول الله صلى الله عليه وسلم بينما هو جالس في المسجد يوما قال رفاعة ونحن معه إذ جاءه رجل كالبدوي فصلى فأخف صلاته ثم انصرف فسلم على النبي صلى الله عليه وسلم فقال النبي صلى الله عليه وسلم ‏\"‏ وعليك فارجع فصل فإنك لم تصل ‏\"‏ ‏.‏ فرجع فصلى ثم جاء فسلم عليه فقال ‏\"‏ وعليك فارجع فصل فإنك لم تصل ‏\"‏ ‏.‏ ففعل ذلك مرتين أو ثلاثا كل ذلك يأتي النبي صلى الله عليه وسلم فيسلم على النبي صلى الله عليه وسلم فيقول النبي صلى الله عليه وسلم ‏\"‏ وعليك فارجع فصل فإنك لم تصل ‏\"‏ ‏.‏ فخاف الناس وكبر عليهم أن يكون من أخف صلاته لم يصل فقال الرجل في آخر ذلك فأرني وعلمني فإنما أنا بشر أصيب وأخطئ ‏.‏ فقال ‏\"‏ أجل إذا قمت إلى الصلاة فتوضأ كما أمرك الله ثم تشهد وأقم فإن كان معك قرآن فاقرأ وإلا فاحمد الله وكبره وهلله ثم اركع فاطمئن راكعا ثم اعتدل قائما ثم اسجد فاعتدل ساجدا ثم اجلس فاطمئن جالسا ثم قم فإذا فعلت ذلك فقد تمت صلاتك وإن انتقصت منه شيئا انتقصت من صلاتك ‏\"‏ ‏.‏ قال وكان هذا أهون عليهم من الأول أنه من انتقص من ذلك شيئا انتقص من صلاته ولم تذهب كلها ‏.‏ قال وفي الباب عن أبي هريرة وعمار بن ياسر ‏.‏ قال أبو عيسى حديث رفاعة بن رافع حديث حسن ‏.‏ وقد روي عن رفاعة هذا الحديث من غير وجه ‏.‏",
      "text_en": " Rifa`ah bin Rafi` narrated:                     \"One day Allah's Messenger was sitting in the Masjid\" Rifa'ah said: \"And we were with him. Then what appeared to be a Bedouin man entered to pray, but he performed his Salat in a very brief manner. He then got up and greeted the prophet with Salam. The Prophet said (returning the greeting): 'And upon you. Go back and perform Salat, for indeed you have no prayed.' So he returned to perform Salat then came and greeted the Prophet with Salam. So he (the Prophet) said (returning the greeting): 'And upon you. Go back and perform Salat, for indeed you have not prayed.' [He did that] two or three times, each time coming to the Prophet, greeted the Prophet with Salam and the Prophet saying: 'And upon you. Go back and perform Salat, for indeed you have not prayed.' - until the people got scared and became very worried that one whose prayer was so brief had not actually prayed. Then in the end the man said: 'Then show me, and teach me, for I am a human who has suffered and is mistaken.' So he said: 'Alright. When you stand for Salat then perform Wudu as Allah ordered you. Then say the Tashahhud, and the Iqamah as well. If you know any Quran then recite it, if not then praise Allah, mention His greatness, and the Tahlil. Then bow such that you are at rest in your bowing, then stand completely, then prostrate completely, then sit such that you are at rest while sitting them stand. When you have done that, then you have completed your Salat, and if you leave out something, then you have made your Salat deficient.' And this was easier on them than the first matter, because if some of this was deficient, It would only reduce the reward of his Salat, it would not have gone entirely. \"",
      "chain": [
        "20387",
        "20155",
        "323"
      ]
    },
    {
      "hadith_no": "3558",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عامر العقدي، حدثنا زهير، وهو ابن محمد عن عبد الله بن محمد بن عقيل، أن معاذ بن رفاعة، أخبره عن أبيه، قال قام أبو بكر الصديق على المنبر ثم بكى فقال قام رسول الله صلى الله عليه وسلم عام الأول على المنبر ثم بكى فقال ‏\"‏ سلوا الله العفو والعافية فإن أحدا لم يعط بعد اليقين خيرا من العافية ‏\"‏ ‏.‏ قال هذا حديث حسن غريب من هذا الوجه عن أبي بكر رضى الله عنه ‏.‏",
      "text_en": " Mu’adh bin Rifa’ah narrated from his father, that he said:                     “Abu Bakr stood upon the Minbar, then wept, and said: ‘The Messenger of Allah stood upon the Minbar the first year (of Hijrah), then wept, and said: “Ask Allah for pardon and Al-Afiyah, for verily, none has been given anything better than Al-Afiyah.’”",
      "chain": [
        "30160",
        "20443",
        "20321",
        "12246",
        "11554",
        "323"
      ]
    },
    {
      "hadith_no": "675",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Adhan (The Call to Prayer) - كتاب الأذان",
      "chapter_no": "7",
      "text_ar": "أخبرنا علي بن حجر، قال أنبأنا إسماعيل، قال حدثنا يحيى بن علي بن يحيى بن خلاد بن رفاعة بن رافع الزرقي، عن أبيه، عن جده، عن رفاعة بن رافع، أن رسول الله صلى الله عليه وسلم بينا هو جالس في صف الصلاة الحديث ‏.‏",
      "text_en": " It was narrated from Rifa'ah bin Rafi' that while the Messenger of Allah (ﷺ) was sitting in the row for prayer. The Hadith. [1][1]With this chain, At-Tirmidhi recorded it (No. 302) and An-Nasai in Al-Kubra (No. 1631). It is the narration about the man who prayed incorrectly, and in it, the Prophet instructed him:                      \"Then Tashhad, then say the Iqamah.\" And they say that the meaning of Tashhad here is call the Adhan. An-Nasai recorded the Hadith with different chains (1054, 1137, 1314,1315). Whereas the wording narrated by At- Tirmidhi, and the author in Al-Kubra, mentions what the author mentioned in the chapter, the other cited versions that An-Nasai in this hook quoted do not. So it is as if he narrated the chain here for Hadith, indicating the same version that At-Tirmidhi narrated, and he himself in Al-Kubra, but he did not want to narrate the actual text here. Abu Dawud also narrated it with the order for the Adhan and Iqamah, through a different route of transmission (No. 861). And it is among the proofs used for the view that the Adhan and Iqamah are obligatory - since it has been ordered in the Hadith of the one who prayed incorrectly.",
      "chain": [
        "20387",
        "20208",
        "323"
      ]
    },
    {
      "hadith_no": "931",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا قتيبة، قال حدثنا رفاعة بن يحيى بن عبد الله بن رفاعة بن رافع، عن عم، أبيه معاذ بن رفاعة بن رافع عن أبيه، قال صليت خلف النبي صلى الله عليه وسلم فعطست فقلت الحمد لله حمدا كثيرا طيبا مباركا فيه مباركا عليه كما يحب ربنا ويرضى ‏.‏ فلما صلى رسول الله صلى الله عليه وسلم انصرف فقال ‏\"‏ من المتكلم في الصلاة ‏\"‏ ‏.‏ فلم يكلمه أحد ثم قالها الثانية ‏\"‏ من المتكلم في الصلاة ‏\"‏ ‏.‏ فقال رفاعة بن رافع بن عفراء أنا يا رسول الله ‏.‏ قال ‏\"‏ كيف قلت ‏\"‏ ‏.‏ قال قلت الحمد لله حمدا كثيرا طيبا مباركا فيه مباركا عليه كما يحب ربنا ويرضى ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ والذي نفسي بيده لقد ابتدرها بضعة وثلاثون ملكا أيهم يصعد بها ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Mu'adh bin Rifa'ah bin Rafi' that :                     His father said: \"I prayed behind the Prophet (ﷺ) and I sneezed and said: 'Al-hamdu lillahi, hamdan kathiran tayiban mubarakan fih, mubarakan'alaihi, kama yuhibbu rabbuna wa yarda (Praise be to Allah, much good and blessed praise as our Lord loves and is pleased with.)' When he finished praying, the Messenger of Allah (ﷺ) said: 'Who is the one who spoke during the prayer?' But no one said anything. Then he said it a second time: 'Who is the one who spoke during the prayer?' So Rifa'ah bin Rafi bin Afrah said: 'It was me, O Messenger of Allah.' He said: 'I said: \"Praise be to Allah, much good and blessed praise as our Lord loves and is pleased with.'\" The Prophet (ﷺ) said: 'By the One in Whose hand is my soul, thirty-odd angels hastened to see which of them would take it up.'\"",
      "chain": [
        "30367",
        "11554",
        "323"
      ]
    },
    {
      "hadith_no": "1053",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا قتيبة، قال حدثنا بكر بن مضر، عن ابن عجلان، عن علي بن يحيى الزرقي، عن أبيه، عن عمه، رفاعة بن رافع وكان بدريا قال كنا مع رسول الله صلى الله عليه وسلم إذ دخل رجل المسجد فصلى ورسول الله صلى الله عليه وسلم يرمقه ولا يشعر ثم انصرف فأتى رسول الله صلى الله عليه وسلم فسلم عليه فرد عليه السلام ثم قال ‏\"‏ ارجع فصل فإنك لم تصل ‏\"‏ ‏.‏ قال لا أدري في الثانية أو في الثالثة قال والذي أنزل عليك الكتاب لقد جهدت فعلمني وأرني ‏.‏ قال ‏\"‏ إذا أردت الصلاة فتوضأ فأحسن الوضوء ثم قم فاستقبل القبلة ثم كبر ثم اقرأ ثم اركع حتى تطمئن راكعا ثم ارفع حتى تعتدل قائما ثم اسجد حتى تطمئن ساجدا ثم ارفع رأسك حتى تطمئن قاعدا ثم اسجد حتى تطمئن ساجدا فإذا صنعت ذلك فقد قضيت صلاتك وما انتقصت من ذلك فإنما تنقصه من صلاتك ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Rifa'ah bin Rafi'- who had been present at Badr- said:                     \"We were with the Messenger of Allah (ﷺ) when a man entered the Masjid and prayed. The Messenger of Allah (ﷺ) watched him without him realizing, then he finished, came to the Messenger of Allah (ﷺ) and greeted him with salam. He returned the salam and said: \"Go back and pray, for you have not prayed.'\" He (the narrator) said: \"I do not know if it was the second or third time,- \"(the man) said: 'By the One Who revealed the Book to you, I have tried my best. Teach me and show me.' He said: 'When you want to pray, perform wudu' and do it well, then stand up and face the qiblah. Then say the takbir, then recite, then bow until you are at ease in bowing. Then stand up until you are standing up straight. Then prostrate until you are at ease in prostration, then raise your head until you are at ease in sitting, then prostrate until you are at ease in prostration. If you do that then you will have done your prayer properly, and whatever you failed to do properly is going to detract from your prayer.\"",
      "chain": [
        "30367",
        "20374",
        "10616",
        "11710",
        "325",
        "323"
      ]
    },
    {
      "hadith_no": "1062",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا محمد بن سلمة، قال أنبأنا ابن القاسم، عن مالك، قال حدثني نعيم بن عبد الله، عن علي بن يحيى الزرقي، عن أبيه، عن رفاعة بن رافع، قال كنا يوما نصلي وراء رسول الله صلى الله عليه وسلم فلما رفع رأسه من الركعة قال ‏\"‏ سمع الله لمن حمده ‏\"‏ ‏.‏ قال رجل وراءه ربنا ولك الحمد حمدا كثيرا طيبا مباركا فيه ‏.‏ فلما انصرف رسول الله صلى الله عليه وسلم قال ‏\"‏ من المتكلم آنفا ‏\"‏ ‏.‏ فقال الرجل أنا يا رسول الله ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ لقد رأيت بضعة وثلاثين ملكا يبتدرونها أيهم يكتبها أولا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Rifa'ah bin Rafi said:                     \"We were praying behind the Messenger of Allah (ﷺ) one day and when he raised his head from bowing he said: 'Sami Allahu liman hamidah (Allah hears the one who praises Him).' A man behind him said: 'Rabbana wa lakal-hamd, hamdan kathiran tayyiban mubarakan fih. (O our Lord, and to You be praise, much blessed and pure praise.)' When the Messenger of Allah (ﷺ) had finished, he said: \"Who is the one who spoke just now?\" The man said: 'I did, O Messenger of Allah.' The Messenger of Allah (ﷺ) said: 'I saw thirty-some angels rushing to see which of them would write it down first.'\"",
      "chain": [
        "20672",
        "30234",
        "20001",
        "11710",
        "325",
        "323"
      ]
    },
    {
      "hadith_no": "1136",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا محمد بن عبد الله بن يزيد المقرئ أبو يحيى، بمكة - وهو بصري - قال حدثنا أبي قال، حدثنا همام، قال حدثنا إسحاق بن عبد الله بن أبي طلحة، أن علي بن يحيى بن خلاد بن مالك بن رافع بن مالك، حدثه عن أبيه، عن عمه، رفاعة بن رافع قال بينما رسول الله صلى الله عليه وسلم جالس ونحن حوله إذ دخل رجل فأتى القبلة فصلى فلما قضى صلاته جاء فسلم على رسول الله صلى الله عليه وسلم وعلى القوم فقال له رسول الله صلى الله عليه وسلم ‏\"‏ وعليك اذهب فصل فإنك لم تصل ‏\"‏ ‏.‏ فذهب فصلى فجعل رسول الله صلى الله عليه وسلم يرمق صلاته ولا يدري ما يعيب منها فلما قضى صلاته جاء فسلم على رسول الله صلى الله عليه وسلم وعلى القوم فقال له رسول الله صلى الله عليه وسلم ‏\"‏ وعليك اذهب فصل فإنك لم تصل ‏\"‏ ‏.‏ فأعادها مرتين أو ثلاثا فقال الرجل يا رسول الله ما عبت من صلاتي فقال رسول الله صلى الله عليه وسلم ‏\"‏ إنها لم تتم صلاة أحدكم حتى يسبغ الوضوء كما أمره الله عز وجل فيغسل وجهه ويديه إلى المرفقين ويمسح برأسه ورجليه إلى الكعبين ثم يكبر الله عز وجل ويحمده ويمجده ‏\"‏ ‏.‏ قال همام وسمعته يقول ‏\"‏ ويحمد الله ويمجده ويكبره ‏\"‏ ‏.‏ قال فكلاهما قد سمعته يقول قال ‏\"‏ ويقرأ ما تيسر من القرآن مما علمه الله وأذن له فيه ثم يكبر ويركع حتى تطمئن مفاصله وتسترخي ثم يقول سمع الله لمن حمده ثم يستوي قائما حتى يقيم صلبه ثم يكبر ويسجد حتى يمكن وجهه ‏\"‏ ‏.‏ وقد سمعته يقول ‏\"‏ جبهته حتى تطمئن مفاصله وتسترخي ويكبر فيرفع حتى يستوي قاعدا على مقعدته ويقيم صلبه ثم يكبر فيسجد حتى يمكن وجهه ويسترخي فإذا لم يفعل هكذا لم تتم صلاته ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Rifa'ah bin Rafi' said:                     \"While the Messenger of Allah (ﷺ) was sitting with us around him, a man came in, turned towards the Qiblah and prayed. When he had finished his prayer, he came and greeted the Messenger of Allah (ﷺ) and the people with Salam. The Messenger of Allah (ﷺ) said to him: 'And also to you. Go and pray, for you have not prayed.' So he went and prayed, and the Messenger of Allah (ﷺ) started watching him, and he (the man) did not know what was wrong with it. When he had finished the prayer, he came and greeted the Messenger of Allah (ﷺ) and the people with salam. The Messenger of Allah (ﷺ) said to him: 'And also to you. Go and pray, for you have not prayed.' He repeated it two or three times, then the man said: 'O Messenger of Allah, what is wrong with my prayer?' The Messenger of Allah (ﷺ) said: 'The prayer of any of you is not complete unless he performs wudu properly as enjoined by Allah, the Mighty and Sublime. So he should wash his face, his arms up to the elbows, and wipe his head, and (wash) his feet up to the ankles. Then he should magnify Allah (SWT) and praise Him and glorify Him.'\" - (One of the narrators) Hammam said: \"I heard him say: 'He should praise Allah and glorify Him and magnify Him.\" He said: \"I heard both of them.\" -\"He (the Prophet (ﷺ)) said: 'He should recite whatever is easy for him of the Quran that Allah has taught him and permitted him in it (the prayer). Then he should say the Takbir and bow until his joints settle and he is relaxed. Then he should say: 'Sami Allahu liman hamidah (Allah hears the one who praises Him)' and stand up straight until his backbone is straight (and at ease). Then he should say Takbir and prostrate until he has placed his face firmly on the ground.\" \"I heard him say: his forehead, until his joints settle and he is relaxed. Then he should say the Takbir and sit up until his backbone is straight (and at ease). Then he should prostrate until he has placed his face firmly on the ground and he is relaxed. If he does not do that then he has not completed his prayer.\"",
      "chain": [
        "11447",
        "11151",
        "422",
        "323"
      ]
    },
    {
      "hadith_no": "496",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا حجاج، حدثنا همام، حدثنا إسحاق بن عبد الله بن أبي طلحة، حدثني علي بن يحيى بن خلاد، عن أبيه، عن عمه، رفاعة بن رافع أنه كان جالسا عند النبي  صلى الله عليه وسلم  فقال ‏\"‏ إنها لا تتم صلاة لأحد حتى يسبغ الوضوء كما أمره الله تعالى يغسل وجهه ويديه إلى المرفقين ويمسح برأسه ورجليه إلى الكعبين ‏\"‏ ‏.‏",
      "text_en": " 'Ali bin Yahya bin Khallad narrated, from his father, from his paternal uncle Rifa'ah bin Rafi' that:                     He was sitting with the Prophet who said: 'No person's prayer is complete until he performs ablution properly as Allah has commanded him, washing his face, his arms up to the elbows, wiping his head and his feet up to the ankles.'\"",
      "chain": [
        "11222",
        "20219",
        "20297",
        "11151",
        "11710",
        "325",
        "323"
      ]
    }
  ],
  "total_hadiths": 16
}