{
  "id": "3240",
  "name": "'Aidh bin 'Amr al-Mazni ( عائذ بن عمرو المزني ( رضي الله عنه",
  "full_name": "'Aidh bin 'Amr al-Mazni ( عائذ بن عمرو المزني ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Hijaz"
    },
    "death": {
      "date_hijri": "60",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Medina",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina",
      "Basra"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ خ  م  س  -  صحابي ]"
    ],
    "tags": [
      "al-Mazni",
      "Basri",
      "Ridwan"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [
    {
      "id": "3241",
      "name": "Rafi' bin 'Amr al-Mazni ( رافع بن عمرو المزني ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "2",
      "name": "Abu Bakr Al-Siddique ( أبو بكر الصديق ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11309",
      "name": "Nasr bin 'Imran bin Isam نصر بن عمران بن عصام",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11016",
      "name": "al-Hasan al-Basri الحسن البصري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11306",
      "name": "Mua'wiya bin Qurrah bin Iyas معاوية بن قرة بن إياس بن هلال",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "14209",
      "name": "'Abdullah bin Khlyfh عبد الله بن خليفة ويقال خليفة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11296",
      "name": "Abu 'Imran al-Jauni عبد الملك بن حبيب أبو عمران الجوني",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "4227",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا محمد بن حاتم بن بزيع، حدثنا شاذان، عن شعبة، عن أبي جمرة، قال سألت عائذ بن عمرو  رضى الله عنه  وكان من أصحاب النبي صلى الله عليه وسلم من أصحاب الشجرة هل ينقض الوتر قال إذا أوترت من أوله، فلا توتر من آخره‏.‏",
      "text_en": " Narrated Abu Jamra:                     I asked Aidh bin `Amr, who was one of the companions of the Prophet one of those (who gave the allegiance to the Prophet the Tree: \"Can the witr prayer be repeated (in one night)?\" He said, \"If you have offered it in the first part of the night, you should not repeat it in the last part 'of the night.\" (See Fath-ul-Bari page 458 Vol 8th).",
      "chain": [
        "30163",
        "20380",
        "20020",
        "11309",
        "3240"
      ]
    },
    {
      "hadith_no": "4838",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا جرير بن حازم، حدثنا الحسن، أن عائذ بن عمرو، - وكان من أصحاب رسول الله صلى الله عليه وسلم - دخل على عبيد الله بن زياد فقال أى بنى إني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن شر الرعاء الحطمة فإياك أن تكون منهم ‏\"‏ ‏.‏ فقال له اجلس فإنما أنت من نخالة أصحاب محمد صلى الله عليه وسلم ‏.‏ فقال وهل كانت لهم نخالة إنما كانت النخالة بعدهم وفي غيرهم ‏.‏",
      "text_en": " It has been narrated on the authority of Hasan that A'idh b. 'Amr who was one of the Companions of the Messenger of Allah (may peace be upon him) called on 'Ubaidullah b. Ziyad and said (to him):                      O my son, I have heard the Messenger of Allah (may peace be upon him) say: The worst of guardians is the cruel ruler. Beware of being one of them. Ubaidullah said (to him out of arrogance): Sit you down. You are from the chaff of the Companions of Muhammad (may peace be upon him). A'idh said: Was there worthless chaff among them? Such worthless chaff appeared after them and among other people.",
      "chain": [
        "20656",
        "11272",
        "11016",
        "3240"
      ]
    },
    {
      "hadith_no": "6568",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمد بن حاتم، حدثنا بهز، حدثنا حماد بن سلمة، عن ثابت، عن معاوية، بن قرة عن عائذ بن عمرو، أن أبا سفيان، أتى على سلمان وصهيب وبلال في نفر فقالوا والله ما أخذت سيوف الله من عنق عدو الله مأخذها ‏.‏ قال فقال أبو بكر أتقولون هذا لشيخ قريش وسيدهم فأتى النبي صلى الله عليه وسلم فأخبره فقال ‏\"‏ يا أبا بكر لعلك أغضبتهم لئن كنت أغضبتهم لقد أغضبت ربك ‏\"‏ ‏.‏ فأتاهم أبو بكر فقال يا إخوتاه أغضبتكم قالوا لا يغفر الله لك يا أخى ‏.‏",
      "text_en": " 'A'idh b. Amr reported that Abu Sufyan came to Salman, Suhaib and Bilal in the presence of a group of persons. They said:                      By Allah, the sword of Allah did not reach the neck of the enemy of Allah as it was required to reach. Thereupon Abu Bakr said: Do you say this to the old man of the Quraish and their chief? Then he came to Allah's Apostle (may peace be upon'him) and informed him of this. Thereupon he (the Holy Prophet) said: Abu Bakr, you have perhaps annoyed them and if you annoyed them you have in fact annoyed your Lord. So Abu Bakr came to them and said: O my brothers, I have annoyed you. They said: No, our brother, may Allah forgive you",
      "chain": [
        "38487",
        "20214",
        "20021",
        "11269",
        "11306",
        "3240"
      ]
    },
    {
      "hadith_no": "2586",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا محمد بن عثمان بن أبي صفوان الثقفي، قال حدثنا أمية بن خالد، قال حدثنا شعبة، عن بسطام بن مسلم، عن عبد الله بن خليفة، عن عائذ بن عمرو، أن رجلا، أتى النبي صلى الله عليه وسلم فسأله فأعطاه فلما وضع رجله على أسكفة الباب قال رسول الله صلى الله عليه وسلم ‏\"‏ لو تعلمون ما في المسألة ما مشى أحد إلى أحد يسأله شيئا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from  'A'idh bin 'Amr that:                     a man came to the prophet and asked him and he gave him, and when he placed his foot on the threshold the Messenger of Allah said: \"If you knew how bad begging is, no one would go to anyone else and ask him for anything.\"",
      "chain": [
        "38549",
        "20530",
        "20020",
        "24032",
        "14209",
        "3240"
      ]
    }
  ],
  "total_hadiths": 4
}