{
  "id": "3242",
  "name": "'Abdullah bin Mughfal al-Mazni ( عبد الله بن مغفل المزني ( رضي الله عنه",
  "full_name": "'Abdullah bin Mughfal al-Mazni ( عبد الله بن مغفل المزني ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Hijaz"
    },
    "death": {
      "date_hijri": "57",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Masra",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina",
      "Basra"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ ع  -  صحابي ]"
    ],
    "tags": [
      "al-Mazni",
      "Basri",
      "Ridwan",
      "Tabouk"
    ]
  },
  "parents": [
    {
      "id": "3243",
      "name": "Mughfal bin 'Abd Nahm al-Mazni ( مغفل بن عبد نهم بن عفيف المزني ( رضي الله عنه",
      "grade": "Comp.(RA)"
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "2",
      "name": "Abu Bakr As-Siddique ( أبو بكر الصديق ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4",
      "name": "'Uthman ibn 'Affaan ( عثمان بن عفان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11281",
      "name": "Hameed bin Hilal حميد بن هلال",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11269",
      "name": "Thabit bin Aslam Albanani ثابت بن أسلم البناني",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11305",
      "name": "Matraf bin 'Abdullah bin al-Shakhayr مطرف بن عبد الله بن الشخير",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11306",
      "name": "Mua'wiya bin Qurrah bin Iyas معاوية بن قرة بن إياس بن هلال",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11602",
      "name": "'Uqba bin S'hban عقبة بن صهبان",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11016",
      "name": "al-Hasan al-Basri الحسن البصري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11050",
      "name": "Sa'id bin Jubayr سعيد بن جبير الأسدي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11432",
      "name": "'Abdullah bin Burayda bin al-Husayb عبد الله بن بريدة بن الحصيب الأسلمي",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-563",
      "hadith_no": "563",
      "source": "Sahih Bukhari",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو معمر  هو عبد الله بن عمرو  قال حدثنا عبد الوارث، عن الحسين، قال حدثنا عبد الله بن بريدة، قال حدثني عبد الله المزني، أن النبي صلى الله عليه وسلم قال ‏\"‏ لا تغلبنكم الأعراب على اسم صلاتكم المغرب ‏\"‏‏.‏ قال الأعراب وتقول هي العشاء‏.‏",
      "text_en": " Narrated `Abdullah Al-Muzani:                     The Prophet said, \"Do not be influenced by bedouins regarding the name of your Maghrib prayer which is called `Isha' by them.\"",
      "usc_msa_ref": "538",
      "chain": [
        "30350",
        "20258",
        "11278",
        "11432",
        "3242"
      ]
    },
    {
      "id": "sahih-bukhari-624",
      "hadith_no": "624",
      "source": "Sahih Bukhari",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا إسحاق الواسطي، قال حدثنا خالد، عن الجريري، عن ابن بريدة، عن عبد الله بن مغفل المزني، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ بين كل أذانين صلاة  ثلاثا  لمن شاء ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Mughaffal Al-Muzani:                     Allah's Apostle said thrice, \"There is a prayer between the two Adhans (Adhan and Iqama),\" and added, \"For the one who wants to pray.\"",
      "usc_msa_ref": "597",
      "chain": [
        "30312",
        "20423",
        "11286",
        "11432",
        "3242"
      ]
    },
    {
      "id": "sahih-bukhari-627",
      "hadith_no": "627",
      "source": "Sahih Bukhari",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد الله بن يزيد، قال حدثنا كهمس بن الحسن، عن عبد الله بن بريدة، عن عبد الله بن مغفل، قال قال النبي صلى الله عليه وسلم ‏\"‏ بين كل أذانين صلاة بين كل أذانين صلاة  ثم قال في الثالثة  لمن شاء ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Mughaffal:                     The prophet said, \"There is a prayer between the two Adhans (Adhan and Iqama), there is a prayer between the two Adhans.\" And then while saying it the third time he added, \"For the one who wants to (pray).",
      "usc_msa_ref": "600",
      "chain": [
        "1945",
        "11303",
        "11432",
        "3242"
      ]
    },
    {
      "id": "sahih-bukhari-1183",
      "hadith_no": "1183",
      "source": "Sahih Bukhari",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا أبو معمر، حدثنا عبد الوارث، عن الحسين، عن ابن بريدة، قال حدثني عبد الله المزني، عن النبي صلى الله عليه وسلم قال ‏\"‏ صلوا قبل صلاة المغرب ‏\"‏‏.‏  قال في الثالثة  لمن شاء كراهية أن يتخذها الناس سنة‏.‏",
      "text_en": " Narrated `Abdullah Al-Muzni:                     The Prophet said, \"Pray before the Maghrib (compulsory) prayer.\" He (said it thrice) and in the third time, he said, \"Whoever wants to offer it can do so.\" He said so because he did not like the people to take it as a tradition.",
      "usc_msa_ref": "277",
      "chain": [
        "30315",
        "20258",
        "11278",
        "11432",
        "3242"
      ]
    },
    {
      "id": "sahih-bukhari-3153",
      "hadith_no": "3153",
      "source": "Sahih Bukhari",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا أبو الوليد، حدثنا شعبة، عن حميد بن هلال، عن عبد الله بن مغفل  رضى الله عنه  قال كنا محاصرين قصر خيبر، فرمى إنسان بجراب فيه شحم، فنزوت لآخذه، فالتفت فإذا النبي صلى الله عليه وسلم فاستحييت منه‏.‏",
      "text_en": " Narrated `Abdullah bin Mughaffal:                     While we were besieging the fort of Khaibar, a person threw a leather container containing fat, and I ran to take it, but when I turned I saw the Prophet (standing behind), so I felt embarrassed in front of him.",
      "usc_msa_ref": "381",
      "chain": [
        "20296",
        "20020",
        "11281",
        "3242"
      ]
    },
    {
      "id": "sahih-bukhari-4263",
      "hadith_no": "4263",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا أبو الوليد، حدثنا شعبة‏.‏ وحدثني عبد الله بن محمد، حدثنا وهب، حدثنا شعبة، عن حميد بن هلال، عن عبد الله بن مغفل  رضى الله عنه  قال كنا محاصري خيبر فرمى إنسان بجراب فيه شحم، فنزوت لآخذه، فالتفت فإذا النبي صلى الله عليه وسلم، فاستحييت‏.‏",
      "text_en": " Narrated `Abdullah bin Mughaffal:                     While we were besieging Khaibar, a person threw a leather container containing some fat and I ran to take it. Suddenly I looked behind, and behold! The Prophet was there. So I felt shy (to take it then).",
      "usc_msa_ref": "525",
      "chain": [
        "20296",
        "30351",
        "20298",
        "20020",
        "11281",
        "3242"
      ]
    },
    {
      "id": "sahih-bukhari-4326",
      "hadith_no": "4326",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا أبو الوليد، حدثنا شعبة، عن معاوية بن قرة، قال سمعت عبد الله بن مغفل، يقول رأيت رسول الله صلى الله عليه وسلم يوم فتح مكة على ناقته، وهو يقرأ سورة الفتح يرجع، وقال لولا أن يجتمع الناس حولي لرجعت كما رجع‏.‏",
      "text_en": " Narrated `Abdullah bin Mughaffal:                     I saw Allah's Apostle on the day of the Conquest of Mecca over his she-camel, reciting Surat-al-Fath in a vibrant quivering tone. (The sub-narrator, Mu'awiya added, \"Were I not afraid that the people may gather around me, I would recite in vibrant quivering tone as he (i.e. `Abdullah bin Mughaffal) did, imitating Allah's Apostle.\")",
      "usc_msa_ref": "578",
      "chain": [
        "20296",
        "20020",
        "11306",
        "3242"
      ]
    },
    {
      "id": "sahih-bukhari-4884",
      "hadith_no": "4884",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا شعبة، حدثنا معاوية بن قرة، عن عبد الله بن مغفل، قال قرأ النبي صلى الله عليه وسلم يوم فتح مكة سورة الفتح فرجع فيها‏.‏ قال معاوية لو شئت أن أحكي لكم قراءة النبي صلى الله عليه وسلم لفعلت‏.‏",
      "text_en": " Narrated `Abdullah bin Mughaffal:                     On the Day of the Conquest of Mecca, the Prophet recited Surat Al-Fath in a vibrating and pleasant voice. (Muawaiya, the subnarrator said, \"If I could imitate the recitation of the Prophet I would do so.\")",
      "usc_msa_ref": "359",
      "chain": [
        "20285",
        "20020",
        "11306",
        "3242"
      ]
    },
    {
      "id": "sahih-bukhari-5087",
      "hadith_no": "5087",
      "source": "Sahih Bukhari",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا حجاج بن منهال، حدثنا شعبة، قال أخبرني أبو إياس، قال سمعت عبد الله بن مغفل، قال رأيت رسول الله صلى الله عليه وسلم يوم فتح مكة وهو يقرأ على راحلته سورة الفتح‏.‏",
      "text_en": " Narrated `Abdullah bin Mughaffal:                     I saw Allah's Apostle reciting Surat-al-Fath on his she-camel on the day of the Conquest of Mecca.",
      "usc_msa_ref": "553",
      "chain": [
        "20219",
        "20020",
        "11306",
        "3242"
      ]
    },
    {
      "id": "sahih-bukhari-5101",
      "hadith_no": "5101",
      "source": "Sahih Bukhari",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا آدم بن أبي إياس، حدثنا شعبة، حدثنا أبو إياس، قال سمعت عبد الله بن مغفل، قال رأيت النبي صلى الله عليه وسلم يقرأ وهو على ناقته  أو جمله  وهى تسير به وهو يقرأ سورة الفتح أو من سورة الفتح قراءة لينة يقرأ وهو يرجع‏.‏",
      "text_en": " Narrated `Abdullah bin Mughaffal:                     I saw the Prophet reciting (Qur'an) while he was riding on his she camel or camel which was moving, carrying him. He was reciting Surat Fath or part of Surat Fath very softly and in an Attractive vibrating tone.",
      "usc_msa_ref": "567",
      "chain": [
        "20404",
        "20020",
        "11306",
        "3242"
      ]
    },
    {
      "id": "sahih-bukhari-5537",
      "hadith_no": "5537",
      "source": "Sahih Bukhari",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا يوسف بن راشد، حدثنا وكيع، ويزيد بن هارون  واللفظ ليزيد  عن كهمس بن الحسن، عن عبد الله بن بريدة، عن عبد الله بن مغفل، أنه رأى رجلا يخذف فقال له لا تخذف فإن رسول الله صلى الله عليه وسلم نهى عن الخذف  أو كان يكره الخذف  وقال ‏\"‏ إنه لا يصاد به صيد ولا ينكى به عدو، ولكنها قد تكسر السن وتفقأ العين ‏\"‏‏.‏ ثم رآه بعد ذلك يخذف فقال له أحدثك عن رسول الله صلى الله عليه وسلم أنه نهى عن الخذف‏.‏ أو كره الخذف، وأنت تخذف لا أكلمك كذا وكذا‏.‏",
      "text_en": " Narrated `Abdullah bin Maghaffal:                     that he saw a man throwing stones with two fingers (at something) and said to him, \"Do not throw stones, for Allah's Apostle has forbidden throwing stones, or e used to dislike it.\" `Abdullah added: Throwing stones will neither hunt the game, nor kill (or hurt) an enemy, but it may break a tooth or gouge out an eye.\" Afterwards `Abdullah once again saw the man throwing stones. He said to him, \"I tell you that Allah's Apostle has forbidden or disliked the throwing the stones (in such a way), yet you are throwing stones! I shall not talk to you for such-and-such a period.\"",
      "usc_msa_ref": "388",
      "chain": [
        "30224",
        "20032",
        "20472",
        "11303",
        "11432",
        "3242"
      ]
    },
    {
      "id": "sahih-bukhari-5566",
      "hadith_no": "5566",
      "source": "Sahih Bukhari",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا أبو الوليد، حدثنا شعبة، عن حميد بن هلال، عن عبد الله بن مغفل  رضى الله عنه  قال كنا محاصرين قصر خيبر، فرمى إنسان بجراب فيه شحم، فنزوت لآخذه، فالتفت فإذا النبي صلى الله عليه وسلم فاستحييت منه‏.‏ وقال ابن عباس طعامهم ذبائحهم‏.‏",
      "text_en": " Narrates `Abdullah bin Mughaffal:                     While we were besieging the castle of Khaibar, Somebody threw a skin full of fat and I went ahead to take it, but on looking behind, I saw the Prophet and I felt shy in his presence (and did not take it).",
      "usc_msa_ref": "",
      "chain": [
        "20296",
        "20020",
        "11281",
        "3242"
      ]
    },
    {
      "id": "sahih-bukhari-6292",
      "hadith_no": "6292",
      "source": "Sahih Bukhari",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا آدم، حدثنا شعبة، عن قتادة، قال سمعت عقبة بن صهبان الأزدي، يحدث عن عبد الله بن مغفل المزني، قال نهى النبي صلى الله عليه وسلم عن الخذف وقال ‏\"‏ إنه لا يقتل الصيد، ولا ينكأ العدو، وإنه يفقأ العين، ويكسر السن ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Mughaffal Al-Muzani:                     The Prophet forbade the throwing of stones (with the thumb and the index or middle finger), and said \"It neither hunts a game nor kills (or hurts) an enemy, but it gouges out an eye or breaks a tooth.\"",
      "usc_msa_ref": "239",
      "chain": [
        "20404",
        "20020",
        "11019",
        "11602",
        "3242"
      ]
    },
    {
      "id": "sahih-bukhari-7456",
      "hadith_no": "7456",
      "source": "Sahih Bukhari",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا أبو معمر، حدثنا عبد الوارث، عن الحسين، عن ابن بريدة، حدثني عبد الله المزني، عن النبي صلى الله عليه وسلم قال ‏\"‏ صلوا قبل صلاة المغرب  قال في الثالثة  لمن شاء ‏\"‏‏.‏ كراهية أن يتخذها الناس سنة‏.‏",
      "text_en": " Narrated `Abdullah Al Muzam:                     The Prophet said, \"Perform (an optional) prayer before Maghrib prayer.\" (He repeated it thrice) and the third time he said, \"Whoever wants to offer it can do so,\" lest the people should take it as a Sunna (tradition). (See Hadith No. 277, Vol. 2)",
      "usc_msa_ref": "465",
      "chain": [
        "30315",
        "20258",
        "11278",
        "11432",
        "3242"
      ]
    },
    {
      "id": "sahih-bukhari-7635",
      "hadith_no": "7635",
      "source": "Sahih Bukhari",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا أحمد بن أبي سريج، أخبرنا شبابة، حدثنا شعبة، عن معاوية بن قرة، عن عبد الله بن مغفل المزني، قال رأيت رسول الله صلى الله عليه وسلم يوم الفتح على ناقة له يقرأ سورة الفتح، أو من سورة الفتح  قال  فرجع فيها  قال  ثم قرأ معاوية يحكي قراءة ابن مغفل وقال ‏\"‏ لولا أن يجتمع الناس عليكم لرجعت كما رجع ابن مغفل ‏\"‏‏.‏ يحكي النبي صلى الله عليه وسلم فقلت لمعاوية كيف كان ترجيعه قال آ آ آ ثلاث مرات‏.‏",
      "text_en": " Narrated Shu`ba:                     Mu'awiya bin Qurra reported that `Abdullah bin Al-Maghaffal Al-Muzani said, \"I saw Allah's Apostle on the day of the Conquest of Mecca, riding his she-camel and reciting Surat-al-Fath (48) or part of Surat-al-Fath. He recited it in a vibrating and pleasant voice. Then Mu'awiya recited as `Abdullah bin Mughaffal had done and said, \"Were I not afraid that the people would crowd around me, I would surely recite in a vibrating pleasant voice as Ibn Mughaffal did, imitating the Prophet.\" I asked Muawiya, \"How did he recite in that tone?\" He said thrice, \"A, A , A.\"",
      "usc_msa_ref": "631",
      "chain": [
        "30298",
        "20426",
        "20020",
        "11306",
        "3242"
      ]
    },
    {
      "id": "sahih-muslim-1889",
      "hadith_no": "1889",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن إدريس، ووكيع، عن شعبة، عن معاوية بن قرة، قال سمعت عبد الله بن مغفل المزني، يقول قرأ النبي صلى الله عليه وسلم عام الفتح في مسير له سورة الفتح على راحلته فرجع في قراءته ‏.‏ قال معاوية لولا أني أخاف أن يجتمع على الناس لحكيت لكم قراءته ‏.‏",
      "text_en": " Mu'awiya b. Qurra is reported to have heard 'Abdullah b. Mughaffal as saying:                      I saw the Messenger of Allah (may peace be upon him) reciting Surah Fath on his camel on the day of the Conquest of Mecca. He (the narrator) said: Ibn Mughaffal recited it and repeated it. Mu'awiya said: Had there been (no crowed of) people, I would have given a practical demonstration of that which Ibn Mughaffal had mentioned from the Apostle of Allah (may peace be upon him).",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20102",
        "20032",
        "20020",
        "11306",
        "3242"
      ]
    },
    {
      "id": "sahih-muslim-1890",
      "hadith_no": "1890",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا محمد بن المثنى، ومحمد بن بشار، قال ابن المثنى حدثنا محمد بن جعفر، حدثنا شعبة، عن معاوية بن قرة، قال سمعت عبد الله بن مغفل، قال رأيت رسول الله صلى الله عليه وسلم يوم فتح مكة على ناقته يقرأ سورة الفتح ‏.‏ قال فقرأ ابن مغفل ورجع ‏.‏ فقال معاوية لولا الناس لأخذت لكم بذلك الذي ذكره ابن مغفل عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " This hadlth has been narrated by Khalid al-Harith with the same chain of transmitters (with these words:                     ) (The Holy Prophet) was reciting Surat al-Fath as he was travelling on his mount.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "11306",
        "3242"
      ]
    },
    {
      "id": "sahih-muslim-1977",
      "hadith_no": "1977",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، ووكيع، عن كهمس، قال حدثنا عبد الله بن بريدة، عن عبد الله بن مغفل المزني، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ بين كل أذانين صلاة - قالها ثلاثا قال في الثالثة - لمن شاء ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated by Abdullah b. Mughaffal by another chain of transmitters, but with this variation that he (the Holy Prophet) said at the fourth time:                     \" He who wishes (may do to).\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20318",
        "20032",
        "11303",
        "11432",
        "3242"
      ]
    },
    {
      "id": "sahih-muslim-1978",
      "hadith_no": "1978",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا عبد الأعلى، عن الجريري، عن عبد الله، بن بريدة عن عبد الله بن مغفل، عن النبي صلى الله عليه وسلم ‏.‏ مثله إلا أنه قال في الرابعة ‏\"‏ لمن شاء ‏\"‏ ‏.‏",
      "text_en": " Salim b. Abdullah b. 'Umar reported:                      The Messenger of Allah (may peace he upon him) led on* of the two groups In one rak'ah of prayer in danger, while the other group faced the -enemy. Then they (the members of the first group) went back and replaced their companions who were facing the enemy. and then they (the members of the second group) came and the Apostle of Allah (may peace be upon him) led them in one rak'ah of prayer. Then the Apostle of Allah (may peace be upon him) pronounced salutation, and then they (the members of the Ant group) completed the rak'ah and they (the members of the second group) completed the rak'ah. This hadith has been narrated by another chain of tranamitters.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20246",
        "11286",
        "11432",
        "3242"
      ]
    },
    {
      "id": "sahih-muslim-4704",
      "hadith_no": "4704",
      "source": "Sahih Muslim",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا سليمان، - يعني ابن المغيرة - حدثنا حميد، بن هلال عن عبد الله بن مغفل، قال أصبت جرابا من شحم يوم خيبر - قال - فالتزمته فقلت لا أعطي اليوم أحدا من هذا شيئا - قال - فالتفت فإذا رسول الله صلى الله عليه وسلم متبسما ‏.‏",
      "text_en": " It has been narrated on the authority of Abdullah b. Mughaffal who said I found a bag containing fat on the day of the Battle of Khaibar. I caught hold of it and said:                      I will not give anything today from it to anybody. Then I turned round and saw that the Messenger of Allah (may peace be upon him) was smiling (at my words).",
      "usc_msa_ref": "",
      "chain": [
        "20656",
        "20236",
        "11281",
        "3242"
      ]
    },
    {
      "id": "sahih-muslim-4705",
      "hadith_no": "4705",
      "source": "Sahih Muslim",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا محمد بن بشار العبدي، حدثنا بهز بن أسد، حدثنا شعبة، حدثني حميد، بن هلال قال سمعت عبد الله بن مغفل، يقول رمي إلينا جراب فيه طعام وشحم يوم خيبرفوثبت لآخذه قال فالتفت فإذا رسول الله صلى الله عليه وسلم فاستحييت منه ‏.‏",
      "text_en": " This tradition has been transmitted by a different chain of narrators with a different wording, the last in the chain being the same narrator, (i. e. 'Abdullah b. Mughaffal), who said:                      A bag containing food and fat was thrown to us. I lept forward to catch it. Then I turned round and saw (to my surprise) the Messenger of Allah (may peace be upon him) and I felt ashamed of my act in his presence.",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20214",
        "20020",
        "11281",
        "3242"
      ]
    },
    {
      "id": "sahih-muslim-5164",
      "hadith_no": "5164",
      "source": "Sahih Muslim",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثنا محمد بن المثنى، حدثنا محمد بن جعفر، وعبد الرحمن بن مهدي، قالا حدثنا شعبة، عن قتادة، عن عقبة بن صهبان، عن عبد الله بن مغفل، قال نهى رسول الله صلى الله عليه وسلم عن الخذف ‏.‏ قال ابن جعفر في حديثه وقال إنه لا ينكأ العدو ولا يقتل الصيد ولكنه يكسر السن ويفقأ العين ‏.‏ وقال ابن مهدي إنها لا تنكأ العدو ‏.‏ ولم يذكر تفقأ العين ‏.‏",
      "text_en": " 'Abdullah b. Mughaffal reported that Allah's Messenger (may peace be upon him) prohibited throwing of pebbles. Ibn Ja'far reported (in the narration transmitted by him) that he (the Holy Prophet) said:                      It neither inflicts defeat to the enemy nor kills the game but breaks the tooth and puts the eye out. This hadith has been transmitted on the authority of Ibn Mahdi with a slight variation of wording.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20173",
        "20033",
        "20020",
        "11019",
        "11602",
        "3242"
      ]
    },
    {
      "id": "sunan-abi-daud-27",
      "hadith_no": "27",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن محمد بن حنبل، والحسن بن علي، قالا حدثنا عبد الرزاق، قال أحمد حدثنا معمر، أخبرني أشعث، وقال الحسن، عن أشعث بن عبد الله، عن الحسن، عن عبد الله بن مغفل، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يبولن أحدكم في مستحمه ثم يغتسل فيه ‏\"‏ ‏.‏ قال أحمد ‏\"‏ ثم يتوضأ فيه فإن عامة الوسواس منه ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Mughaffal:                     The Messenger of Allah (ﷺ) said: No one of you should make water in his bath and then wash himself there (after urination). The version of Ahmad has: Then performs ablution there, for evil thoughts come from it.",
      "usc_msa_ref": "",
      "chain": [
        "30007",
        "30",
        "20121",
        "30007",
        "20115",
        "11324",
        "11016",
        "19837",
        "11016",
        "3242"
      ]
    },
    {
      "id": "sunan-abi-daud-96",
      "hadith_no": "96",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، حدثنا سعيد الجريري، عن أبي نعامة، أن عبد الله بن مغفل، سمع ابنه، يقول اللهم إني أسألك القصر الأبيض عن يمين الجنة، إذا دخلتها ‏.‏ فقال أى بنى سل الله الجنة وتعوذ به من النار فإني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إنه سيكون في هذه الأمة قوم يعتدون في الطهور والدعاء ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Mughaffal:                     Abdullah heard his son praying to Allah: O Allah, I ask Thee a white palace on the right of Paradise when I enter it. He said: O my son, ask Allah for Paradise and seek refuge in Him from Hell-Fire, for I heard the Messenger of Allah (ﷺ) say: In this community there will be some people who will exceed the limits in purification as well as in supplication.",
      "usc_msa_ref": "",
      "chain": [
        "20040",
        "20022",
        "11286",
        "3242"
      ]
    },
    {
      "id": "sunan-abi-daud-1281",
      "hadith_no": "1281",
      "source": "Sunan Abi Da'ud",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا عبيد الله بن عمر، حدثنا عبد الوارث بن سعيد، عن الحسين المعلم، عن عبد الله بن بريدة، عن عبد الله المزني، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ صلوا قبل المغرب ركعتين ‏\"‏ ‏.‏ ثم قال ‏\"‏ صلوا قبل المغرب ركعتين لمن شاء ‏\"‏ ‏.‏ خشية أن يتخذها الناس سنة ‏.‏",
      "text_en": " Narrated 'Abd Allah al-Muzani:                     The Messenger of Allah (ﷺ) said: Pray two rak'ahs before the Maghrib prayer. He then said (again): Pray two rak'ahs before the Maghrib prayer, it applies to those who wish to do so. That was because he feared that the people might treat it as sunnah.",
      "usc_msa_ref": "",
      "chain": [
        "11201",
        "20258",
        "11278",
        "11432",
        "3242"
      ]
    },
    {
      "id": "sunan-abi-daud-1283",
      "hadith_no": "1283",
      "source": "Sunan Abi Da'ud",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا ابن علية، عن الجريري، عن عبد الله بن بريدة، عن عبد الله بن مغفل، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ بين كل أذانين صلاة بين كل أذانين صلاة لمن شاء ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Abd Allah b. Mughaffal:                     The Messenger of Allah (ﷺ) as saying: Between the two adhans there is a prayer, between the two adhans there is prayer for one who desires (to offer).",
      "usc_msa_ref": "",
      "chain": [
        "30352",
        "20208",
        "11286",
        "11432",
        "3242"
      ]
    },
    {
      "id": "sunan-abi-daud-1467",
      "hadith_no": "1467",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن معاوية بن قرة، عن عبد الله بن مغفل، قال رأيت رسول الله صلى الله عليه وسلم يوم فتح مكة وهو على ناقة يقرأ بسورة الفتح وهو يرجع ‏.‏",
      "text_en": " 'Abd Allah b. Mughaffal said:                      On the day of the Conquest of Mecca I saw the Messenger of Allah (ﷺ) riding his she-camel reciting Surah al-Fath repeating each verse several times.",
      "usc_msa_ref": "",
      "chain": [
        "30329",
        "20020",
        "11306",
        "3242"
      ]
    },
    {
      "id": "sunan-abi-daud-2702",
      "hadith_no": "2702",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا موسى بن إسماعيل، والقعنبي، قالا حدثنا سليمان، عن حميد، - يعني ابن هلال - عن عبد الله بن مغفل، قال دلي جراب من شحم يوم خيبر - قال - فأتيته فالتزمته - قال - ثم قلت لا أعطي من هذا أحدا اليوم شيئا - قال - فالتفت فإذا رسول الله صلى الله عليه وسلم يتبسم إلى ‏.‏",
      "text_en": " ‘Abd Allaah bin Mughaffal said “On the day of Khaibar a skin of fat was hanging. I came to it and clung to it. I then said (i.e., thought) I shall not give any one any of it today. I then turned round and saw the Apostle of Allaah(ﷺ) smiling at me.",
      "usc_msa_ref": "",
      "chain": [
        "20040",
        "20164",
        "20160",
        "11281",
        "3242"
      ]
    },
    {
      "id": "sunan-abi-daud-2845",
      "hadith_no": "2845",
      "source": "Sunan Abi Da'ud",
      "chapter": "Game (Kitab Al-Said) - كتاب الصيد",
      "chapter_no": "17",
      "text_ar": "حدثنا مسدد، حدثنا يزيد، حدثنا يونس، عن الحسن، عن عبد الله بن مغفل، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لولا أن الكلاب أمة من الأمم لأمرت بقتلها فاقتلوا منها الأسود البهيم ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Mughaffal:                     The Prophet (ﷺ) said: Were dogs not a species of creature I should command that they all be killed; but kill every pure black one.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20304",
        "20475",
        "11016",
        "3242"
      ]
    },
    {
      "id": "sunan-abi-daud-4159",
      "hadith_no": "4159",
      "source": "Sunan Abi Da'ud",
      "chapter": "Combing the Hair (Kitab Al-Tarajjul) - كتاب الترجل",
      "chapter_no": "35",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن هشام بن حسان، عن الحسن، عن عبد الله بن مغفل، قال نهى رسول الله صلى الله عليه وسلم عن الترجل إلا غبا ‏.‏",
      "text_en": " Narrated Abdullah ibn Mughaffal:                     The Messenger of Allah (ﷺ) forbade combing the hair except every second day.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20031",
        "11311",
        "11016",
        "3242"
      ]
    },
    {
      "id": "sunan-abi-daud-4807",
      "hadith_no": "4807",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، عن يونس، وحميد، عن الحسن، عن عبد الله بن مغفل، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن الله رفيق يحب الرفق ويعطي عليه ما لا يعطي على العنف ‏\"‏ ‏.‏",
      "text_en": " ‘ABD ALLAH B. MUGHAFFAL REPORTED THE APOSTLE OF ALLAH (MAY PEACE BE UPON HIM) AS SAYING :                      ALLAH IS GENTLE, LIKES GENTLENESS, AND GIVES FOR GENTLENESS WHAT HE DOES NOT GIVE FOR HARSHNESS.",
      "usc_msa_ref": "",
      "chain": [
        "20040",
        "20022",
        "20475",
        "11279",
        "11016",
        "3242"
      ]
    },
    {
      "id": "sunan-abi-daud-5270",
      "hadith_no": "5270",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن قتادة، عن عقبة بن صهبان، عن عبد الله بن مغفل، قال نهى رسول الله صلى الله عليه وسلم عن الخذف قال ‏\"‏ إنه لا يصيد صيدا ولا ينكأ عدوا وإنما يفقأ العين ويكسر السن ‏\"‏ ‏.‏",
      "text_en": " ‘Abd b. Mughaffal said :                      The Messenger of Allah (ﷺ) prohibited throwing pebbles (in sport) saying : game is not caught by such means. Neither is an enemy injured, but it may sometimes put out an eye or break a tooth.",
      "usc_msa_ref": "",
      "chain": [
        "30329",
        "20020",
        "11019",
        "11602",
        "3242"
      ]
    },
    {
      "id": "jami-al-tirmidhi-21",
      "hadith_no": "21",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا علي بن حجر، وأحمد بن محمد بن موسى، مردويه قالا أخبرنا عبد الله بن المبارك، عن معمر، عن أشعث بن عبد الله، عن الحسن، عن عبد الله بن مغفل، أن النبي صلى الله عليه وسلم نهى أن يبول الرجل في مستحمه ‏.‏ وقال ‏\"‏ إن عامة الوسواس منه ‏\"‏ ‏.‏ قال وفي الباب عن رجل من أصحاب النبي صلى الله عليه وسلم ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه مرفوعا إلا من حديث أشعث بن عبد الله ويقال له أشعث الأعمى ‏.‏ وقد كره قوم من أهل العلم البول في المغتسل وقالوا عامة الوسواس منه ‏.‏ ورخص فيه بعض أهل العلم منهم ابن سيرين وقيل له إنه يقال إن عامة الوسواس منه فقال ربنا الله لا شريك له ‏.‏ وقال ابن المبارك قد وسع في البول في المغتسل إذا جرى فيه الماء ‏.‏ قال أبو عيسى حدثنا بذلك أحمد بن عبدة الآملي عن حبان عن عبد الله بن المبارك ‏.‏",
      "text_en": " Abdullah bin Mughaffal narrated that :                     the Prophet  prohibited that a man should urinate in his bathing area. And he said: \"It will only cause misgivings.\" [He said:] There are narrations on This topic from \"a man from among the Companions of the Prophet.\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "30304",
        "20025",
        "20115",
        "19837",
        "11016",
        "3242"
      ]
    },
    {
      "id": "jami-al-tirmidhi-185",
      "hadith_no": "185",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا هناد، حدثنا وكيع، عن كهمس بن الحسن، عن عبد الله بن بريدة، عن عبد الله بن مغفل، عن النبي صلى الله عليه وسلم قال ‏\"‏ بين كل أذانين صلاة لمن شاء ‏\"‏ ‏.‏ وفي الباب عن عبد الله بن الزبير ‏.‏ قال أبو عيسى حديث عبد الله بن مغفل حديث حسن صحيح ‏.‏ وقد اختلف أصحاب النبي صلى الله عليه وسلم في الصلاة قبل المغرب فلم ير بعضهم الصلاة قبل المغرب ‏.‏ وقد روي عن غير واحد من أصحاب النبي صلى الله عليه وسلم أنهم كانوا يصلون قبل صلاة المغرب ركعتين بين الأذان والإقامة ‏.‏ وقال أحمد وإسحاق إن صلاهما فحسن ‏.‏ وهذا عندهما على الاستحباب ‏.‏",
      "text_en": " Abdullah bin Mughaffal narrated that :                     the Prophet said: \"Between every two calls (to prayer) there is a Salat for whoever wills.\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20032",
        "11303",
        "11432",
        "3242"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1486",
      "hadith_no": "1486",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Hunting - كتاب الصيد والذبائح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "18",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا هشيم، أخبرنا منصور بن زاذان، ويونس بن عبيد، عن الحسن، عن عبد الله بن مغفل، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لولا أن الكلاب أمة من الأمم لأمرت بقتلها كلها فاقتلوا منها كل أسود بهيم ‏\"‏ ‏.‏ قال وفي الباب عن ابن عمر وجابر وأبي رافع وأبي أيوب ‏.‏ قال أبو عيسى حديث عبد الله بن مغفل حديث حسن صحيح ‏.‏ ويروى في بعض الحديث ‏\"‏ أن الكلب الأسود البهيم شيطان ‏\"‏ ‏.‏ والكلب الأسود البهيم الذي لا يكون فيه شيء من البياض ‏.‏ وقد كره بعض أهل العلم صيد الكلب الأسود البهيم ‏.‏",
      "text_en": " Narrated 'Abdullah bin Mughaffal:                     That the Messenger of Allah (ﷺ) said: \"If it were not that dogs were part of a nation among the nations, then I would order to that all of them be killed. So kill every one of them that is all black.\"",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "20468",
        "11444",
        "11075",
        "11016",
        "3242"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1489",
      "hadith_no": "1489",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Hunting - كتاب الصيد والذبائح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "18",
      "text_ar": "حدثنا عبيد بن أسباط بن محمد القرشي، حدثنا أبي، عن الأعمش، عن إسماعيل بن مسلم، عن الحسن، عن عبد الله بن مغفل، قال إني لممن يرفع أغصان الشجرة عن وجه رسول الله صلى الله عليه وسلم وهو يخطب فقال ‏\"‏ لولا أن الكلاب أمة من الأمم لأمرت بقتلها فاقتلوا منها كل أسود بهيم وما من أهل بيت يرتبطون كلبا إلا نقص من عملهم كل يوم قيراط إلا كلب صيد أو كلب حرث أو كلب غنم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن وقد روي هذا الحديث من غير وجه عن الحسن عن عبد الله بن مغفل عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated 'Abdullah bin Mughaffal:                     \"I was one of those who held up the branches from the tree away from the face of the Messenger of Allah (ﷺ) while he was delivering the Khutbah saying: 'If it were not that dogs were a nation among nations, then I would order that they be killed. So kill every one among them that is all black. There is one inhabiting a home in which they keep a dog but their deeds are decreased by one Qirat every day - except for a hunting dog, or a farm dog, or a sheep dog.'\"",
      "usc_msa_ref": "",
      "chain": [
        "11060",
        "22025",
        "11016",
        "3242"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1756",
      "hadith_no": "1756",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Clothing - كتاب اللباس",
      "chapter_no": "24",
      "text_ar": "حدثنا علي بن خشرم، أخبرنا عيسى بن يونس، عن هشام، عن الحسن، عن عبد الله بن مغفل، قال نهى رسول الله صلى الله عليه وسلم عن الترجل إلا غبا ‏.‏",
      "text_en": " Narrated 'Abdullah bin Mughaffal:                     \"The Messenger of Allah (ﷺ) prohibited combing except every other day.",
      "usc_msa_ref": "",
      "chain": [
        "30556",
        "20347",
        "11065",
        "11016",
        "3242"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2350",
      "hadith_no": "2350",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا محمد بن عمرو بن نبهان بن صفوان الثقفي البصري، حدثنا روح بن أسلم، حدثنا شداد أبو طلحة الراسبي، عن أبي الوازع، عن عبد الله بن مغفل، قال قال رجل للنبي صلى الله عليه وسلم يا رسول الله والله إني لأحبك ‏.‏ فقال ‏\"‏ انظر ماذا تقول ‏\"‏ ‏.‏ قال والله إني لأحبك ‏.‏ فقال ‏\"‏ انظر ماذا تقول ‏\"‏ ‏.‏ قال والله إني لأحبك ‏.‏ ثلاث مرات فقال ‏\"‏ إن كنت تحبني فأعد للفقر تجفافا فإن الفقر أسرع إلى من يحبني من السيل إلى منتهاه ‏\"‏ ‏.‏  حدثنا نصر بن علي، حدثنا أبي، عن شداد أبي طلحة، نحوه بمعناه ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ وأبو الوازع الراسبي اسمه جابر بن عمرو وهو بصري ‏.‏",
      "text_en": " 'Abdullah bin Maghaffal said:                     \"A man said to the Prophet (s.a.w): 'O Messenger of Allah! By Allah! Indeed I love you!' So he said: 'Consider what you say.' He said: 'By Allah! I indeed love you!' Three times. He said: 'If you do not love me, then prepare arm yourself against poverty. For indeed poverty comes faster upon whoever loves me than the flood to its destination.'\"",
      "usc_msa_ref": "",
      "chain": [
        "11220",
        "24141",
        "3242"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4236",
      "hadith_no": "4236",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا يعقوب بن إبراهيم بن سعد، حدثنا عبيدة بن أبي رائطة، عن عبد الرحمن بن زياد، عن عبد الله بن مغفل، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الله الله في أصحابي الله الله في أصحابي لا تتخذوهم غرضا بعدي فمن أحبهم فبحبي أحبهم ومن أبغضهم فببغضي أبغضهم ومن آذاهم فقد آذاني ومن آذاني فقد آذى الله ومن آذى الله فيوشك أن يأخذه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من هذا الوجه ‏.‏",
      "text_en": " Narrated 'Abdullah bin Mughaffal:                     that the Messenger of Allah (ﷺ) said: \"(Fear) Allah! (Fear) Allah regarding my Companions! Do not make them objects of insults after me. Whoever loves them, it is out of love of me that he loves them. And whoever hates them, it is out of hatred for me that he hates them. And whoever harms them, he has harmed me, and whoever harms me, he has offended Allah, and whoever offends Allah, [then] he shall soon be punished.\"",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "20184",
        "25185",
        "28326",
        "3242"
      ]
    },
    {
      "id": "sunan-an-nasai-36",
      "hadith_no": "36",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا علي بن حجر، قال أنبأنا ابن المبارك، عن معمر، عن الأشعث بن عبد الله، عن الحسن، عن عبد الله بن مغفل، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يبولن أحدكم في مستحمه فإن عامة الوسواس منه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin Mughaffal that the Prophet (ﷺ) said:                      \"None of you should urinate in the place where he bathes, for most Waswas (devilish whispers) [1] come from that.\"[1] I.e., with regard to whether the urine has soiled his body or not.",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20025",
        "20115",
        "11016",
        "3242"
      ]
    },
    {
      "id": "sunan-an-nasai-336",
      "hadith_no": "336",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Water - كتاب المياه",
      "chapter_no": "2",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا خالد، - يعني ابن الحارث - عن شعبة، عن أبي التياح، قال سمعت مطرفا، عن عبد الله بن مغفل، أن رسول الله صلى الله عليه وسلم أمر بقتل الكلاب ورخص في كلب الصيد والغنم وقال ‏\"‏ إذا ولغ الكلب في الإناء فاغسلوه سبع مرات وعفروه الثامنة بالتراب ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin Mughaffal that the Messenger of Allah (ﷺ) commanded that dogs be killed, but he made an exception for hunting dogs and sheepdogs and said:                      \"If a dog licks a vessel then wash it seven times and rub it the eighth time with dust.\"",
      "usc_msa_ref": "",
      "chain": [
        "30449",
        "20226",
        "20020",
        "11317",
        "11395",
        "3242"
      ]
    },
    {
      "id": "sunan-an-nasai-337",
      "hadith_no": "337",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Water - كتاب المياه",
      "chapter_no": "2",
      "text_ar": "أخبرنا عمرو بن يزيد، قال حدثنا بهز بن أسد، قال حدثنا شعبة، عن أبي التياح، يزيد بن حميد قال سمعت مطرفا، يحدث عن عبد الله بن مغفل، قال أمر رسول الله صلى الله عليه وسلم بقتل الكلاب قال ‏\"‏ ما بالهم وبال الكلاب ‏\"‏ ‏.‏ قال ورخص في كلب الصيد وكلب الغنم وقال ‏\"‏ إذا ولغ الكلب في الإناء فاغسلوه سبع مرات وعفروا الثامنة بالتراب ‏\"‏ ‏.‏ خالفه أبو هريرة فقال إحداهن بالتراب ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Mughaffal said:                      \"The Messenger of Allah (ﷺ) commanded that dogs be killed. He said: 'What do they have to do with dogs?' And he granted a concession regarding hunting dogs and sheepdogs. And he said: 'If a dog licks a vessel, wash it seven times, and rub it the eighth time with dust.' Abu Hurairah differed from him and said: 'Rub it one time with dust.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20214",
        "20020",
        "11395",
        "3242"
      ]
    },
    {
      "id": "sunan-an-nasai-689",
      "hadith_no": "689",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Adhan (The Call to Prayer) - كتاب الأذان",
      "chapter_no": "7",
      "text_ar": "أخبرنا عبيد الله بن سعيد، عن يحيى، عن كهمس، قال حدثنا عبد الله بن بريدة، عن عبد الله بن مغفل، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ بين كل أذانين صلاة بين كل أذانين صلاة بين كل أذانين صلاة لمن شاء ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Mughaffal said:                      \"The Messenger of Allah (ﷺ) said: 'Between each two Adhans [1] there is a prayer, between each two Adhans there is a prayer, between each two Adhans there is a prayer, for whoever wants to do it.\"[1]Meaning, between the Adhan and Iqamah.",
      "usc_msa_ref": "",
      "chain": [
        "30359",
        "20031",
        "11303",
        "11432",
        "3242"
      ]
    },
    {
      "id": "sunan-an-nasai-735",
      "hadith_no": "735",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Masjids - كتاب المساجد",
      "chapter_no": "8",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا يحيى، عن أشعث، عن الحسن، عن عبد الله بن مغفل، أن رسول الله صلى الله عليه وسلم نهى عن الصلاة في أعطان الإبل ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin Mughaffal that the Messenger of Allah (ﷺ) forbade praying in the camel pens.[1] A'tan:                      Kneeling places, or, where they kneel to drink water.",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20031",
        "11324",
        "11016",
        "3242"
      ]
    },
    {
      "id": "sunan-an-nasai-4280",
      "hadith_no": "4280",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا عمران بن موسى، قال حدثنا يزيد بن زريع، قال حدثنا يونس، عن الحسن، عن عبد الله بن مغفل، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لولا أن الكلاب أمة من الأمم لأمرت بقتلها فاقتلوا منها الأسود البهيم وأيما قوم اتخذوا كلبا ليس بكلب حرث أو صيد أو ماشية فإنه ينقص من أجره كل يوم قيراط ‏\"‏ ‏.‏",
      "text_en": " It was narrated form 'Abdullah bin Mughaffal that the Messenger of Allah said:                     \"Were it not that dogs form one of the communities (or nations - of creatures), I would have commanded that they be killed. But kill those that are all black. Any people who keep a dog, except for dogs used for farming, hunting or herding livestock, one Qirat will be deducted from their reward each day.\"",
      "usc_msa_ref": "",
      "chain": [
        "28454",
        "20304",
        "20475",
        "11016",
        "3242"
      ]
    },
    {
      "id": "sunan-an-nasai-4288",
      "hadith_no": "4288",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا يحيى، وابن أبي عدي، ومحمد بن جعفر، عن عوف، عن الحسن، عن عبد الله بن مغفل، عن النبي صلى الله عليه وسلم قال ‏\"‏ من اتخذ كلبا إلا كلب صيد أو ماشية أو زرع نقص من أجره كل يوم قيراط ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin Mughaffal that the Prophet said:                     \"Whoever keeps a dog, except a dog for hunting, herding livestock or farming, one Qurat will be deducted from his reward each day.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20031",
        "20276",
        "20173",
        "11298",
        "11016",
        "3242"
      ]
    },
    {
      "id": "sunan-an-nasai-4435",
      "hadith_no": "4435",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا يعقوب بن إبراهيم، قال حدثنا يحيى بن سعيد، عن سليمان بن مغيرة، قال حدثنا حميد بن هلال، قال حدثنا عبد الله بن مغفل، قال دلي جراب من شحم يوم خيبر فالتزمته قلت لا أعطي أحدا منه شيئا فالتفت فإذا رسول الله صلى الله عليه وسلم يتبسم ‏.‏",
      "text_en": " 'Abdullah bin Mughaffal said:                     \"A bag of fat was thrown on the day of Khaibar, and I caught it and said: \"I will not give anything of this to anyone.' I turned around and saw the Messenger of Allah there, smiling.\" (Sahih )",
      "usc_msa_ref": "",
      "chain": [
        "20184",
        "20031",
        "11281",
        "3242"
      ]
    },
    {
      "id": "sunan-an-nasai-4815",
      "hadith_no": "4815",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا يزيد، قال أنبأنا كهمس، عن عبد الله بن بريدة، عن عبد الله بن مغفل، أنه رأى رجلا يخذف فقال لا تخذف فإن نبي الله صلى الله عليه وسلم كان ينهى عن الخذف أو يكره الخذف ‏.‏ شك كهمس ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin Mughaffal that he saw a man throwing pebbles and he said:                     \"Do not throw pebbles, for the Prophet of Allah forbade throwing pebbles,\" or \"he disliked the throwing of pebbles.\" Kahmas (one of the narrators) was not sure.",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20472",
        "11303",
        "11432",
        "3242"
      ]
    },
    {
      "id": "sunan-an-nasai-5055",
      "hadith_no": "5055",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا علي بن حجر، قال حدثنا عيسى بن يونس، عن هشام بن حسان، عن الحسن، عن عبد الله بن مغفل، قال نهى رسول الله صلى الله عليه وسلم عن الترجل إلا غبا ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Mughaffal said:                     \"The Messenger of Allah [SAW] forbade combing one's hair, except every other day.\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20347",
        "11311",
        "11016",
        "3242"
      ]
    },
    {
      "id": "sunan-ibn-majah-17",
      "hadith_no": "17",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا أحمد بن ثابت الجحدري، وأبو عمر حفص بن عمرو قالا حدثنا عبد الوهاب الثقفي، حدثنا أيوب، عن سعيد بن جبير، عن عبد الله بن مغفل، أنه كان جالسا إلى جنبه ابن أخ له فخذف فنهاه وقال إن رسول الله  صلى الله عليه وسلم  نهى عنها وقال ‏\"‏ إنها لا تصيد صيدا ولا تنكي عدوا وإنها تكسر السن وتفقأ العين ‏\"‏ ‏.‏ قال فعاد ابن أخيه يخذف فقال أحدثك أن رسول الله  صلى الله عليه وسلم  نهى عنها ثم عدت تخذف لا أكلمك أبدا ‏.‏",
      "text_en": " It was narrated from Sa'eed bin Jubair that :                     Abdullah bin Mughaffal was sitting beside a nephew of his, the nephew hurled a pebble and he told him not to do that, and he said: \"The Messenger of Allah (ﷺ) had forbidden that. He (the Prophet) said: 'It cannot be used for hunting and it cannot harm an enemy, but it may break a tooth or put an eye out.\" He said.\" His nephew hurled another pebble and he (\"Abdullah bin Mughaffal) said: 'I tell you that the Messenger of Allah forbade that (and you go hurl another pebble)? I will never speak to you again.'\"",
      "usc_msa_ref": "",
      "chain": [
        "34002",
        "20259",
        "11015",
        "11050",
        "3242"
      ]
    },
    {
      "id": "sunan-ibn-majah-323",
      "hadith_no": "323",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا عبد الرزاق، أنبأنا معمر، عن أشعث بن عبد الله، عن الحسن، عن عبد الله بن مغفل، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا يبولن أحدكم في مستحمه فإن عامة الوسواس منه ‏\"‏ ‏.‏ قال أبو عبد الله بن ماجه سمعت علي بن محمد الطنافسي يقول إنما هذا في الحفيرة فأما اليوم فلا ‏.‏ فمغتسلاتهم الجص والصاروج والقير فإذا بال فأرسل عليه الماء لا بأس به ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Mughaffal said:                     \"The Messenger of Allah said: 'None of you should urinate in his wash area for most of the insinuating thoughts come from that.'\" (Da'if)abu 'Abdullah bin Majah said: (\"Abul-Hasan said: 'I heard Muhammed bin Yazid saying:) ''Ali bim Muhammed At-Tanafisi said: 'This (prohibition) applies to cases where the ground (in the place used for washing) was soft. But nowadays this does not apply, because the baths you use now are built of plaster, Saruj and tar; so if a person urinates there then pours water over it, that clears it away, and that is fine.'\"",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "20121",
        "20115",
        "19837",
        "11016",
        "3242"
      ]
    },
    {
      "id": "sunan-ibn-majah-769",
      "hadith_no": "769",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book On The Mosques And The Congregations - كتاب المساجد والجماعات",
      "chapter_no": "4",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا هشيم، عن يونس، عن الحسن، عن عبد الله بن مغفل المزني، قال قال النبي  صلى الله عليه وسلم  ‏\"‏ صلوا في مرابض الغنم ولا تصلوا في أعطان الإبل فإنها خلقت من الشياطين ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Mughaffal Al-Muzani said:                     \"The Prophet said: 'Perform prayer in the sheep's resting-places and do not perform prayer in the camels' resting-places, for they were created from the devils.\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20468",
        "20475",
        "11016",
        "3242"
      ]
    },
    {
      "id": "sunan-ibn-majah-1004",
      "hadith_no": "1004",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا جميل بن الحسن، حدثنا عبد الأعلى، حدثنا سعيد، عن قتادة، عن الحسن، عن عبد الله بن مغفل، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ يقطع الصلاة المرأة والكلب والحمار ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Abdullah bin Mughaffal that the Prophet (ﷺ)said:                     “The prayer is severed by a woman, a dog and a donkey.”",
      "usc_msa_ref": "",
      "chain": [
        "34046",
        "20246",
        "11168",
        "11019",
        "11016",
        "3242"
      ]
    },
    {
      "id": "sunan-ibn-majah-1217",
      "hadith_no": "1217",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، ووكيع، عن كهمس، حدثنا عبد الله بن بريدة، عن عبد الله بن مغفل، قال قال نبي الله  صلى الله عليه وسلم  ‏\"‏ بين كل أذانين صلاة ‏\"‏ ‏.‏ قالها ثلاثا قال في الثالثة ‏\"‏ لمن شاء ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Abdullah bin Mughaffal said:                      “The Prophet ofAllah(ﷺ) said: ‘Between every two Adhans there is a prayer.’ Hesaidit three times, and on the third time he said, ‘For those whowish.’”*",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20318",
        "20032",
        "11303",
        "11432",
        "3242"
      ]
    },
    {
      "id": "sunan-ibn-majah-2580",
      "hadith_no": "2580",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Pawning - كتاب الرهون",
      "chapter_no": "16",
      "text_ar": "حدثنا الوليد بن عمرو بن سكين، حدثنا محمد بن عبد الله بن المثنى، ح وحدثنا الحسن بن محمد بن الصباح، حدثنا عبد الوهاب بن عطاء، قالا حدثنا إسماعيل المكي، عن الحسن، عن عبد الله بن مغفل، أن النبي صلى الله عليه وسلم قال ‏\"‏ من حفر بئرا فله أربعون ذراعا عطنا لماشيته ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin Mughaffal that the Prophet (ﷺ) said:                     “Whoever digs a well, is entitled to forty forearms' length surrounding it is as a resting place for his flocks.”",
      "usc_msa_ref": "",
      "chain": [
        "30245",
        "20557",
        "11016",
        "3242"
      ]
    },
    {
      "id": "sunan-ibn-majah-3321",
      "hadith_no": "3321",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hunting - كتاب الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا شبابة، حدثنا شعبة، عن أبي التياح، قال سمعت مطرفا، يحدث عن عبد الله بن مغفل، أن رسول الله  صلى الله عليه وسلم  أمر بقتل الكلاب ثم قال ‏\"‏ ما لهم وللكلاب ‏\"‏ ‏.‏ ثم رخص لهم في كلب الصيد ‏.‏",
      "text_en": " It wasnarrated from ‘Abdullah bin Mughaffal that the Messenger ofAllah(ﷺ) commanded that dogs be killed, then he said:                      “What do theyuse dogs for?” Then he permitted them to keep hunting dogs.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20426",
        "20020",
        "11317",
        "11395",
        "3242"
      ]
    },
    {
      "id": "sunan-ibn-majah-3322",
      "hadith_no": "3322",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hunting - كتاب الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عثمان بن عمر، ح وحدثنا محمد بن الوليد، حدثنا محمد بن جعفر، قالا حدثنا شعبة، عن أبي التياح، قال سمعت مطرفا، عن عبد الله بن مغفل، أن رسول الله  صلى الله عليه وسلم  أمر بقتل الكلاب ثم قال ‏\"‏ ما لهم وللكلاب ‏\"‏ ‏.‏ ثم رخص لهم في كلب الزرع وكلب العين ‏.‏ قال بندار العين حيطان المدينة ‏.‏",
      "text_en": " It wasnarrated from ‘Abdullah bin Mughaffal that the Messenger ofAllah(ﷺ) commanded that dogs be killed, then he said:                      “What do theyuse dogs for?” Then he permitted them to keep farming dogs and dogsof‘Ein. Bundar said: “The ‘Ein refers to the walls ofAl-Madinah.”",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20262",
        "20459",
        "20173",
        "20020",
        "11317",
        "11395",
        "3242"
      ]
    },
    {
      "id": "sunan-ibn-majah-3326",
      "hadith_no": "3326",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hunting - كتاب الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أحمد بن عبد الله، عن أبي شهاب، حدثني يونس بن عبيد، عن الحسن، عن عبد الله بن مغفل، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لولا أن الكلاب أمة من الأمم لأمرت بقتلها فاقتلوا منها الأسود البهيم وما من قوم اتخذوا كلبا إلا كلب ماشية أو كلب صيد أو كلب حرث إلا نقص من أجورهم كل يوم قيراطان ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Abdullah bin Mughaffal that the Messenger ofAllah(ﷺ) said:                      “Were it not that dogs form one of the communities(ornations – of creatures), I would have commanded that they bekilled. But kill those that are all black. There are no people whokeep a dog, except for dogs used for herding livestock, hunting orfarming, but two Qirat will be deducted from their reward each day.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "11075",
        "11016",
        "3242"
      ]
    },
    {
      "id": "sunan-ibn-majah-3349",
      "hadith_no": "3349",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hunting - كتاب الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبيد بن سعيد، ح وحدثنا محمد بن بشار، حدثنا محمد بن جعفر، قالا حدثنا شعبة، عن قتادة، عن عقبة بن صهبان، عن عبد الله بن مغفل، قال نهى النبي  صلى الله عليه وسلم  عن الخذف وقال ‏\"‏ إنها لا تقتل الصيد ولا تنكي العدو ولكنها تفقأ العين وتكسر السن ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Abdullah bin Mughaffal said:                      “The Prophet (ﷺ)forbade throwing small pebbles and said: ‘They do not kill any gameorhurt the enemy, but they can break a tooth or put out an eye.’”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20665",
        "30160",
        "20173",
        "20020",
        "11019",
        "11602",
        "3242"
      ]
    },
    {
      "id": "sunan-ibn-majah-3864",
      "hadith_no": "3864",
      "source": "Sunan Ibn Majah",
      "chapter": "Supplication - كتاب الدعاء",
      "chapter_no": "34",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عفان، حدثنا حماد بن سلمة، أنبأنا سعيد الجريري، عن أبي نعامة، أن عبد الله بن مغفل، سمع ابنه، يقول اللهم إني أسألك القصر الأبيض عن يمين الجنة، إذا دخلتها ‏.‏ فقال أى بنى سل الله الجنة وعذ به من النار فإني سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ سيكون قوم يعتدون في الدعاء ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Na'amah that :                     'Abdullah bin Mughaffal heard his son say: \"O Allah, I ask You for the white palace on the right-hand side of Paradise, when I enter it.\" He said: \"O my son, ask Allah for Paradise and seek refuge with Him from Hell, for I heard the Messenger of Allah (saas) say: 'There will be people who will transgress in supplication.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30106",
        "20021",
        "11286",
        "3242"
      ]
    }
  ],
  "total_hadiths": 60
}