{
  "id": "3245",
  "name": "'Abdullah bin Sarjis al-Mazni ( عبد الله بن سرجس ( رضي الله عنه",
  "full_name": "'Abdullah bin Sarjis al-Mazni ( عبد الله بن سرجس ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Hijaz",
      "place_display": {
        "en": "Hijaz",
        "ar": "الحجاز",
        "ckb": "حیجاز"
      }
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Basra",
      "reason": "Natural",
      "place_display": {
        "en": "Basra",
        "ar": "البصرة",
        "ckb": "بەسرە"
      }
    },
    "places_of_stay": [
      "Medina",
      " Basra"
    ],
    "area_of_interest": [
      "Narrator [ م  4  -  صحابي ]"
    ],
    "tags": [
      "al-Mazni",
      "Ally B.Makhzum",
      "Basri"
    ],
    "area_of_interest_display": [
      {
        "en": "Narrator [ م  4  -  صحابي ]",
        "ar": "Narrator [ م  4  -  صحابي ]",
        "ckb": "Narrator [ م  4  -  صحابي ]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "Medina",
        "ar": "المدينة المنورة",
        "ckb": "مەدینە"
      },
      {
        "en": "Basra",
        "ar": "البصرة",
        "ckb": "بەسرە"
      }
    ],
    "tags_display": [
      {
        "en": "al-Mazni",
        "ar": "al-Mazni",
        "ckb": "al-Mazni"
      },
      {
        "en": "Ally B.Makhzum",
        "ar": "Ally B.Makhzum",
        "ckb": "Ally B.Makhzum"
      },
      {
        "en": "Basri",
        "ar": "Basri",
        "ckb": "Basri"
      }
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah",
      "grade_display": {
        "en": "Messenger of Allah",
        "ar": "رسول الله",
        "ckb": "پێغەمبەری خودا"
      }
    },
    {
      "id": "3",
      "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    }
  ],
  "students": [
    {
      "id": "11019",
      "name": "Qatada قتادة",
      "grade": "Follower(Tabi') [4th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [4th Generation]",
        "ar": "تابعي [الجيل الرابع]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی چوارەم]"
      }
    }
  ],
  "hadiths": [
    {
      "id": "sahih-muslim-1684",
      "hadith_no": "1684",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا أبو كامل الجحدري، حدثنا حماد يعني ابن زيد، ح وحدثني حامد بن عمر البكراوي، حدثنا عبد الواحد يعني ابن زياد، ح وحدثنا ابن نمير، حدثنا أبو معاوية، كلهم عن عاصم، ح وحدثني زهير بن حرب، - واللفظ له - حدثنا مروان بن معاوية الفزاري، عن عاصم الأحول، عن عبد الله بن سرجس، قال دخل رجل المسجد ورسول الله صلى الله عليه وسلم في صلاة الغداة فصلى ركعتين في جانب المسجد ثم دخل مع رسول الله صلى الله عليه وسلم فلما سلم رسول الله صلى الله عليه وسلم قال ‏\"‏ يا فلان بأى الصلاتين اعتددت أبصلاتك وحدك أم بصلاتك معنا ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. Sarjis reported:                      A person entered the mosque, while the Messenger of Allah (may peace be upon him) was leading the dawn prayer. He observed two rak'ahs in a corner of the mosque, and then joined the Messenger of Allah (may peace be upon him) in prayer. When the Messenger of Allah (may peace be upon him) had pronounced salutations (he had concluded the prayer), he said: O, so and so, which one out of these two prayers did you count (as your Fard prayer), the one that you observed alone or the prayer that you observed with us?",
      "usc_msa_ref": "",
      "chain": [
        "30559",
        "20022",
        "30128",
        "20256",
        "30212",
        "11080",
        "30022",
        "20201",
        "11080",
        "3245"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-3128",
      "hadith_no": "3128",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا خلف بن هشام، والمقدمي، وأبو كامل وقتيبة بن سعيد كلهم عن حماد، - قال خلف حدثنا حماد بن زيد، - عن عاصم الأحول، عن عبد الله بن سرجس، قال رأيت الأصلع - يعني عمر بن الخطاب - يقبل الحجر ويقول والله إني لأقبلك وإني أعلم أنك حجر وأنك لا تضر ولا تنفع ولولا أني رأيت رسول الله صلى الله عليه وسلم قبلك ما قبلتك ‏.‏ وفي رواية المقدمي وأبي كامل رأيت الأصيلع ‏.‏",
      "text_en": " Abdullah b. Sarjis reported:                      I saw the bald one, i. e. 'Umar b. Khattib (Allah be pleased with him). kissing the Stone and saying: By Allah. I am kissing with full consciousness of the fact that you are a stone and that you can neither do any harm nor good; and if I had not seen Allah's Messenger (may peace be upon him) kissing you. I would not have kissed you. The rest of the hadith is the same.",
      "usc_msa_ref": "",
      "chain": [
        "30503",
        "20022",
        "20022",
        "11080",
        "3245"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-3340",
      "hadith_no": "3340",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثني زهير بن حرب، حدثنا إسماعيل ابن علية، عن عاصم الأحول، عن عبد، الله بن سرجس قال كان رسول الله صلى الله عليه وسلم إذا سافر يتعوذ من وعثاء السفر وكآبة المنقلب والحور بعد الكور ودعوة المظلوم وسوء المنظر في الأهل والمال‏.‏",
      "text_en": " Abdullah b. Sarjis (Allah be pleased with him) reported that when Allah's Messenger (may peace be upon him) set forth on a journey, he sought refuge (with Allah) from the hardships of the travelling, and finding of evil changes on return, and disgrace after honour, and the curse of the oppressed and a gloomy sad scene in family and property.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "20208",
        "11080",
        "3245"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-6234",
      "hadith_no": "6234",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا أبو كامل، حدثنا حماد يعني ابن زيد، ح وحدثني سويد بن سعيد، حدثنا  علي بن مسهر، كلاهما عن عاصم الأحول، ح وحدثني حامد بن عمر البكراوي، - واللفظ له - حدثنا عبد الواحد، - يعني ابن زياد - حدثنا عاصم، عن عبد الله بن سرجس، قال رأيت النبي صلى الله عليه وسلم وأكلت معه خبزا ولحما - أو قال ثريدا - قال فقلت له أستغفر لك النبي صلى الله عليه وسلم قال نعم ولك ثم تلا هذه الآية ‏{‏ واستغفر لذنبك وللمؤمنين والمؤمنات‏}‏ قال ثم درت خلفه فنظرت إلى خاتم النبوة بين كتفيه عند ناغض كتفه اليسرى جمعا عليه خيلان كأمثال الثآليل ‏.‏",
      "text_en": " Abdullah b. Sarjis reported:                      I saw Allah's Apostle (may peace be upon him) and ate with him bread and meat, or he said Tharid (bread soaked in soup). I said to him: Did Allah's Apostle (may peace be upon him) seek forgiveness for you? He said: Yes, and for you, and he then recited this verse:\" Ask forgiveness for thy sin and for the believing men and believing women\" (xlvii. 19). I then went after him and saw the Seal of Prophethood between his shoulders on the left side of his shoulder having spots on it like moles.",
      "usc_msa_ref": "",
      "chain": [
        "20022",
        "30547",
        "11080",
        "30128",
        "20256",
        "11080",
        "3245"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sunan-abi-daud-29",
      "hadith_no": "29",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عبيد الله بن عمر بن ميسرة، حدثنا معاذ بن هشام، حدثني أبي، عن قتادة، عن عبد الله بن سرجس، أن رسول الله صلى الله عليه وسلم نهى أن يبال في الجحر ‏.‏ قال قالوا لقتادة ما يكره من البول في الجحر قال كان يقال إنها مساكن الجن ‏.‏",
      "text_en": " Narrated Abdullah ibn Sarjis:                     The Prophet (ﷺ) prohibited to urinate in a hole.Qatadah (a narrator) was asked about the reason for the disapproval of urinating in a hole. He replied: It is said that these (hoes) are the habitats of the jinn.",
      "usc_msa_ref": "",
      "chain": [
        "30024",
        "20287",
        "20295",
        "11019",
        "3245"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-1265",
      "hadith_no": "1265",
      "source": "Sunan Abi Da'ud",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن عاصم، عن عبد الله بن سرجس، قال جاء رجل والنبي صلى الله عليه وسلم يصلي الصبح فصلى الركعتين ثم دخل مع النبي صلى الله عليه وسلم في الصلاة فلما انصرف قال ‏\"‏ يا فلان أيتهما صلاتك التي صليت وحدك أو التي صليت معنا ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Abd Allah b. Sarjas:                     A man came while the Prophet (ﷺ) was leading the people in the dawn prayer. He prayed the two rak'ahs and then joined the congregational prayer led by the Prophet (ﷺ). When he finished the prayer, the Prophet (ﷺ) said:  So-and-so, which was your real prayer, the one you prayed alone or the one offered with us ?",
      "usc_msa_ref": "",
      "chain": [
        "20193",
        "20022",
        "11080",
        "3245"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "jami-al-tirmidhi-2142",
      "hadith_no": "2142",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا قتيبة، حدثنا نوح بن قيس، عن عبد الله بن عمران، عن عبد الله بن سرجس، عن النبي صلى الله عليه وسلم نحوه ولم يذكر فيه عن عاصم والصحيح حديث نصر بن علي ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20572",
        "3245"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-3439-2",
      "hadith_no": "3439",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا أحمد بن عبدة الضبي، حدثنا حماد بن زيد، عن عاصم الأحول، عن عبد الله بن سرجس، قال كان النبي صلى الله عليه وسلم إذا سافر يقول ‏\"‏ اللهم أنت الصاحب في السفر والخليفة في الأهل اللهم اصحبنا في سفرنا واخلفنا في أهلنا اللهم إني أعوذ بك من وعثاء السفر وكآبة المنقلب ومن الحور بعد الكون ومن دعوة المظلوم ومن سوء المنظر في الأهل والمال ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح ‏.‏ قال ويروى الحور بعد الكور أيضا قال ومعنى قوله الحور بعد الكون أو الكور وكلاهما له وجه يقال إنما هو الرجوع من الإيمان إلى الكفر أو من الطاعة إلى المعصية إنما يعني الرجوع من شيء إلى شيء من الشر ‏.‏",
      "text_en": " Abdullah bin Sarjis narrated that:                     When the Prophet wanted to travel, he would say: “O Allah, You are the companion on the journey, and the caretaker for the family, O Allah, accompany us in our journey, and watch over our families, O Allah, I seek refuge in You from the difficulties of the journey, and from returning in great sadness, and from loss after increase, and from the supplication of the oppressed, and from someone looking with evil at our families and wealth (Allahumma Antas-Sahibu Fis-Safari Wal-Khalifatu Fil-Ahli Allahumma Ashabna Fi Safarina Wakhlufna Fi Ahlina. Allahumma Inni A’udhu Bika Min Wa’tha’is-Safari Wa Ka’abatil-Munqalab, Wa Minal-Hawri Ba’dal-Kawri, Wa Min Da’watil-Mazlum, Wa Min Su’il-Manzari Fil-Ahli Wal-Mal).”",
      "usc_msa_ref": "",
      "chain": [
        "30423",
        "20022",
        "11080",
        "3245"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "sunan-an-nasai-34",
      "hadith_no": "34",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال أنبأنا معاذ بن هشام، قال حدثني أبي، عن قتادة، عن عبد الله بن سرجس، أن نبي الله صلى الله عليه وسلم قال ‏\"‏ لا يبولن أحدكم في جحر ‏\"‏ ‏.‏ قالوا لقتادة وما يكره من البول في الجحر قال يقال إنها مساكن الجن ‏.‏",
      "text_en": " It was narrated from Qatadah, from 'Abdullah bin Sarjis, that the Prophet of Allah (ﷺ) said:                      \"None of you should urinate into a burrow in the ground.\" They said to Qatadah: \"Why is it disliked to urinate into a burrow in the ground?\" He said: \"It is said that these are dwelling-places of the jinn.\"",
      "usc_msa_ref": "",
      "chain": [
        "30359",
        "20287",
        "20295",
        "11019",
        "3245"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-868",
      "hadith_no": "868",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا يحيى بن حبيب بن عربي، قال حدثنا حماد، قال حدثنا عاصم، عن عبد الله بن سرجس، قال جاء رجل ورسول الله صلى الله عليه وسلم في صلاة الصبح فركع الركعتين ثم دخل فلما قضى رسول الله صلى الله عليه وسلم صلاته قال ‏\"‏ يا فلان أيهما صلاتك التي صليت معنا أو التي صليت لنفسك ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Sarjis said:                      \"A man came while the Messenger of Allah (ﷺ) was praying Subh, and he prayed two Rak'ahs then joined the prayer. When the Messenger of Allah (ﷺ) had finished praying he said: O so-and-so, which of them is your prayer - the one you prayed withus or the one you prayed on your own?\"'",
      "usc_msa_ref": "",
      "chain": [
        "30459",
        "20022",
        "11080",
        "3245"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-5498",
      "hadith_no": "5498",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا أزهر بن جميل، قال حدثنا خالد بن الحارث، قال حدثنا شعبة، عن عاصم، عن عبد الله بن سرجس، أن رسول الله صلى الله عليه وسلم كان إذا سافر قال ‏\"‏ اللهم إني أعوذ بك من وعثاء السفر وكآبة المنقلب والحور بعد الكور ودعوة المظلوم وسوء المنظر في الأهل والمال ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin Sarjis that :                     When the Messenger of Allah [SAW] traveled, he would say: \"Allahumma inni a'udhu bika min wa'tha'is-safari, wa kabatil-munqalabi, wal-hawri ba'dal-kawri, wa da'watil-mazlumi, wa suw'il-munzari fil-ahli wal-mal (O Allah, I seek refuge with You from the hardships of travel and the sorrows of return, from loss after plenty, from the supplication of the one who has been wronged, and seeing some calamity befall my family or wealth.)\"",
      "usc_msa_ref": "",
      "chain": [
        "30122",
        "20226",
        "20020",
        "11080",
        "3245"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-5499",
      "hadith_no": "5499",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال حدثنا جرير، عن عاصم، عن عبد الله بن سرجس، أن رسول الله صلى الله عليه وسلم كان إذا سافر قال ‏\"‏ اللهم إني أعوذ بك من وعثاء السفر وكآبة المنقلب والحور بعد الكور ودعوة المظلوم وسوء المنظر في الأهل والمال والولد ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin Sarjis that :                     When the Messenger of Allah [SAW] traveled, he would say: \"Allahumma inni a'udhu bika min wa'tha'is-safari, wa kabatil-munqalabi, wal-hawri ba'dal-kawri, wa da'watil-mazlumi, wa su'il-munzari fil-ahli wal-mali wal-walad (O Allah, I seek refuge with You from the hardships of travel and the sorrows of return, from loss after plenty, from the supplication of the one who has been wronged, and seeing some calamity befall my family or wealth or child.)\"",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20028",
        "11080",
        "3245"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-5500",
      "hadith_no": "5500",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا يوسف بن حماد، قال حدثنا بشر بن منصور، عن عاصم، عن عبد الله بن سرجس، قال كان النبي صلى الله عليه وسلم إذا سافر يتعوذ من وعثاء السفر وكآبة المنقلب والحور بعد الكور ودعوة المظلوم وسوء المنظر ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Sarjis said:                     \"When the Prophet [SAW] traveled, he would seek refuge with Allah from the hardships of travel, and the sorrows of return, from loss after plenty, from the supplication of the one who has been wronged, and from seeing some calamity befall.\"",
      "usc_msa_ref": "",
      "chain": [
        "30573",
        "20531",
        "11080",
        "3245"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-ibn-majah-404",
      "hadith_no": "404",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا المعلى بن أسد، حدثنا عبد العزيز بن المختار، حدثنا عاصم الأحول، عن عبد الله بن سرجس، قال نهى رسول الله  صلى الله عليه وسلم  أن يغتسل الرجل بفضل وضوء المرأة والمرأة بفضل الرجل ولكن يشرعان جميعا ‏.‏ قال أبو عبد الله بن ماجه الصحيح هو الأول والثاني وهم ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Sarjis said:                     \"The Messenger of Allah forbade men to perform ablution with the water left over by a woman, and women to perform ablution with water left over by a man, however both (spouses) may start to perform their ablutions at the same time.\"",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "20252",
        "11080",
        "3245"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-1207",
      "hadith_no": "1207",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو معاوية، عن عاصم، عن عبد الله بن سرجس، أن رسول الله  صلى الله عليه وسلم  رأى رجلا يصلي الركعتين قبل صلاة الغداة وهو في الصلاة فلما صلى قال له ‏\"‏ بأى صلاتيك اعتددت ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Abdullah bin Sarjis that the Messenger of Allah(ﷺ) saw a man performing the two Rak’ah before the morning prayerwhile he himself was performing prayer. When he had finished prayinghe said to him:                      “Which of your two prayers did you intend to becounted (i.e., accepted)?”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20354",
        "11080",
        "3245"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-3056",
      "hadith_no": "3056",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعلي بن محمد، قالا حدثنا أبو معاوية، حدثنا عاصم الأحول، عن عبد الله بن سرجس، قال رأيت الأصيلع عمر بن الخطاب يقبل الحجر ويقول إني لأقبلك وإني لأعلم أنك حجر لا تضر ولا تنفع ولولا أني رأيت رسول الله  صلى الله عليه وسلم  يقبلك ما قبلتك ‏.‏",
      "text_en": " It wasnarrated that ‘Abdullah bin Sarjis said:                      “I saw the baldforeheadof ‘Umar bin Khattab when he kissed the Black Stone and said:‘Iam kissing you, although I know that you are only a stone and youcanneither cause harm nor bring benefit. Had I not seen the MessengerofAllah (ﷺ) kissing you, I would not have kissed you.’”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "38409",
        "20354",
        "11080",
        "3245"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-3888",
      "hadith_no": "3888",
      "source": "Sunan Ibn Majah",
      "chapter": "Supplication - كتاب الدعاء",
      "chapter_no": "34",
      "text_ar": "حدثنا أبو بكر، حدثنا عبد الرحيم بن سليمان، وأبو معاوية عن عاصم، عن عبد الله بن سرجس، قال كان رسول الله  صلى الله عليه وسلم  يقول - وقال عبد الرحيم يتعوذ - إذا سافر ‏\"‏ اللهم إني أعوذ بك من وعثاء السفر وكآبة المنقلب والحور بعد الكور ودعوة المظلوم وسوء المنظر في الأهل والمال ‏\"‏ ‏.‏ وزاد أبو معاوية فإذا رجع قال مثلها ‏.‏",
      "text_en": " It was narrated that ‘Abdullah bin Sarjis said:                      “The Messenger of Allah (ﷺ) used to say” – and (one of the narrators) ‘Abdur-Rahim said: “he used to seek refuge” – “when he traveled: ‘Allahumma inni a’udhu bika min wa’tha’is-safar, wa ka’abatil-munqalab, wal-hawri ba’dal-kawr, wa da’watil-mazlum, wa su’il-manzari fil-ahli wal-mal (O Allah, I seek refuge with You from the hardships of travel and the sorrows of return, from decrease after increase, from the prayer of the one who has been wronged, and seeing some calamity befall my family or wealth).’”(One of the narrators) Abu Mu’awiyah added: “And when he returned he said likewise.”",
      "usc_msa_ref": "",
      "chain": [
        "20436",
        "20334",
        "20354",
        "11080",
        "3245"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    }
  ],
  "total_hadiths": 17,
  "grade_display": {
    "en": "Companion (RA) [1st Generation]",
    "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
    "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
  }
}