{
  "id": "34",
  "name": "Jabir ibn 'Abdullah ( جابر بن عبد الله بن عمرو السلمي الأنصاري ( رضي الله عنه",
  "full_name": "Jabir ibn 'Abdullah ( جابر بن عبد الله بن عمرو السلمي الأنصاري ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "biography": {
    "birth": {
      "date_hijri": "16",
      "date_gregorian": "607",
      "date_display": [
        "16 BH",
        "607 CE"
      ],
      "place": "Medinah"
    },
    "death": {
      "date_hijri": "78",
      "date_gregorian": "687",
      "date_display": null,
      "place": "Baghdad",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medinah",
      "Baghdad",
      "Egypt",
      "Damascus"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ ع  -  صحابي ]",
      "Fiqh"
    ],
    "tags": [
      "Ansar",
      "Khazraj",
      "B.Jusham B.al-Khazraj",
      "B.Salima",
      "Aqaba 2"
    ]
  },
  "parents": [
    {
      "id": "1000",
      "name": "'Abdullah ibn 'Amr bin Haram ( عبد الله بن عمرو بن حرام بن ثعلبة ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "1065",
      "name": "Unaysa bint 'Anma ibn 'Adi ( أنيسة بنت غنمة بن عدي ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "spouses": [
    {
      "id": "624",
      "name": "Suhayma bint Mas'ud bin Aws ( سهيمة بنت مسعود بن أوس ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "siblings": [
    {
      "id": "1075",
      "name": "Umm Mu'adh bint 'Abdullah ( أم معاذ بنت عبد الله بن عمرو بن حرام ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "children": [
    {
      "id": "11192",
      "name": "'Abdur Rahman bin Jabir bin 'Abdullah عبد الرحمن بن جابر بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "12366",
      "name": "'Aqeel bin Jabir ibn 'Abdullah عقيل بن جابر بن عبد الله الأنصاري",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11192",
      "name": "'Abdur Rahman bin Jabir bin 'Abdullah عبد الرحمن بن جابر بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "12937",
      "name": "Mahmud bin Jabir bin 'Abdullah محمود بن جابر بن عبد الله بن عمرو",
      "grade": "Follower(Tabi')"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "2",
      "name": "Abu Bakr As-Siddique ( أبو بكر الصديق ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3",
      "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5",
      "name": "Ali ibn Abi Talib ( علي بن أبي طالب بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "10",
      "name": "Abu 'Ubaidah ibn al-Jarrah ( أبو عبيدة بن الجراح ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "6",
      "name": "Talha ibn 'Ubaidullah ( طلحة بن عبيد الله ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "32",
      "name": "Mu'adh ibn Jabal ( معاذ بن جبل بن عمرو بن أوس ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "25",
      "name": "'Ammar ibn Yasir ( عمار بن ياسر بن عامر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "22",
      "name": "Khalid bin al-Walid ( خالد بن الوليد بن المغيرة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "1820",
      "name": "Abu Burda bin Niyar ( أبو بردة بن نيار ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "391",
      "name": "Abu Qatada ibn Rab'i ( أبو قتادة بن ربعي الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "38",
      "name": "Abu Sa'id al-Khudri ( أبو سعيد سعد بن مالك بن سنان الخدري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "1048",
      "name": "'Abdullah bin 'Unays al-Juhani ( عبد الله بن أنيس الجهني أبو يحيى المدني ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "1457",
      "name": "Abu Hameed al-Sa'idi al-Ansari ( عبد الرحمن بن سعد, أبو حميد الساعدي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "187",
      "name": "Umm Shareek ( أم شريك العامرية/ الأنصارية/ الدوسية ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "1399",
      "name": "Umm Malik al-Ansariyya ( أم مالك الأنصارية ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "1293",
      "name": "Umm Mubashir al-Ansariyya ( أم مبشر الأنصارية ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "10500",
      "name": "Umm Khultum bint Abi Bakr أم كلثوم بنت أبي بكر الصديق",
      "grade": "Follower(Tabi') [2nd Generation]"
    }
  ],
  "students": [
    {
      "id": "11192",
      "name": "'Abdur Rahman bin Jabir bin 'Abdullah عبد الرحمن بن جابر بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "12366",
      "name": "'Aqeel bin Jabir ibn 'Abdullah عقيل بن جابر بن عبد الله الأنصاري",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11192",
      "name": "'Abdur Rahman bin Jabir bin 'Abdullah عبد الرحمن بن جابر بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11002",
      "name": "Sa'id ibn al-Musayyib سعيد بن المسيب بن حزن أبو محمد القرشي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "1830",
      "name": "Mahmud bin Labid bin 'Uqba ( محمود بن لبيد بن عقبة بن رافع ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11263",
      "name": "Muhammad bin Muslim bin Tadras محمد بن مسلم بن تدرس أبو الزبير",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11081",
      "name": "'Amr bin Dinar عمرو بن دينار الأثرم الجمحي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11442",
      "name": "Muhammad bin 'Ali b. al-Hussain al-Baqir محمد بن علي بن الحسين بن علي ,الباقر",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11085",
      "name": "Muhammad bin 'Amr bin al-Hasan محمد بن عمرو بن الحسن",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11048",
      "name": "Muhammad bin al-Munkdar bin 'Abdullah محمد بن المنكدر بن عبد الله بن الهدير",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10721",
      "name": "al-Mandhar bin Malik bin Qata' المنذر بن مالك بن قطعة - أبو نضرة العبدي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11231",
      "name": "Wahb bin Kysan al-Quraishi وهب بن كيسان القرشي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11510",
      "name": "Sa'id bin Myna سعيد بن مينا",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11156",
      "name": "al-Hasan bin Muhammad bin 'Ali الحسن بن محمد بن علي بن أبي طالب",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11167",
      "name": "Sa'id bin al-Harith bin Abi Sa'id سعيد بن الحارث بن أبي سعيد",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11342",
      "name": "Salm bin Abi al-Ja'd سالم بن أبي الجعد",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11556",
      "name": "Ayman al-Habshi al-Makki أيمن الحبشي المكي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11016",
      "name": "al-Hasan al-Basri الحسن البصري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11161",
      "name": "Dhakwan Abu Salah al-Saman al-Ziyat ذكوان أبو صالح السمان الزيات",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11169",
      "name": "Sa'id bin Abi Hilal سعيد بن أبي هلال الليثي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11856",
      "name": "Sulaiman bin Atyq سليمان بن عتيق",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11103",
      "name": "Asim bin 'Umar bin Qatada al-Ansari عاصم بن عمر بن قتادة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11052",
      "name": "'Amir al-Sha'bi عامر الشعبي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "1131",
      "name": "'Abdullah bin Ka'b bin Malik b. Abi Ka'b ( عبد الله بن كعب بن مالك السلمي الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "1134",
      "name": "'Abdur Rahman bin Ka'b bin Malik ( عبد الرحمن بن كعب بن مالك السلمي ( رضي الله عنه",
      "grade": "Comp.(RA) [2nd Generation]"
    },
    {
      "id": "10938",
      "name": "Abu 'Abdur Rahman al-Habli عبد الله بن يزيد أبو عبد الرحمن الحبلي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11521",
      "name": "'Ubaidullah bin Mqsm عبيد الله بن مقسم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11029",
      "name": "'Ata' bin Abi Rabah عطاء بن أبي رباح",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10511",
      "name": "'Urwa ibn al-Zubayr عروة بن الزبير",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11028",
      "name": "Mujahid bin Jabir مجاهد بن جبر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10612",
      "name": "al-Q'qa' bin Hkym al-Knany القعقاع بن حكيم الكناني المدني",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11665",
      "name": "Yazid bin S'hyb يزيد بن صهيب",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "4",
      "source": " Sahih Bukhari ",
      "chapter": "Revelation - كتاب بدء الوحى",
      "chapter_no": "1",
      "text_ar": "قال ابن شهاب وأخبرني أبو سلمة بن عبد الرحمن، أن جابر بن عبد الله الأنصاري، قال  وهو يحدث عن فترة الوحى، فقال  في حديثه ‏\"‏ بينا أنا أمشي، إذ سمعت صوتا، من السماء، فرفعت بصري فإذا الملك الذي جاءني بحراء جالس على كرسي بين السماء والأرض، فرعبت منه، فرجعت فقلت زملوني‏.‏ فأنزل الله تعالى ‏{‏يا أيها المدثر * قم فأنذر‏}‏ إلى قوله ‏{‏والرجز فاهجر‏}‏ فحمي الوحى وتتابع ‏\"‏‏.‏ تابعه عبد الله بن يوسف وأبو صالح‏.‏ وتابعه هلال بن رداد عن الزهري‏.‏ وقال يونس ومعمر ‏\"‏ بوادره ‏\"‏‏.‏",
      "text_en": " Narrated Jabir bin 'Abdullah Al-Ansari while talking about the period of pause in revelation reporting the speech of the Prophet \"While I was walking, all of a sudden I heard a voice from the sky. I looked up and saw the same angel who had visited me at the cave of Hira' sitting on a chair between the sky and the earth. I got afraid of him and came back home and said, 'Wrap me (in blankets).' And then Allah revealed the following Holy Verses (of Quran):                       'O you (i.e. Muhammad)! wrapped up in garments!' Arise and warn (the people against Allah's Punishment),... up to 'and desert the idols.' (74.1-5) After this the revelation started coming strongly, frequently and regularly.\"",
      "chain": [
        "11013",
        "10567",
        "34"
      ]
    },
    {
      "hadith_no": "194",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا أبو الوليد، قال حدثنا شعبة، عن محمد بن المنكدر، قال سمعت جابرا، يقول جاء رسول الله صلى الله عليه وسلم يعودني، وأنا مريض لا أعقل، فتوضأ وصب على من وضوئه، فعقلت فقلت يا رسول الله لمن الميراث إنما يرثني كلالة‏.‏ فنزلت آية الفرائض‏.‏",
      "text_en": " Narrated Jabir:                     Allah's Apostle came to visit me while I was sick and unconscious. He performed ablution and sprinkled the remaining water on me and I became conscious and said, \"O Allah's Apostle! To whom will my inheritance go as I have neither ascendants nor descendants?\" Then the Divine verses regarding Fara'id (inheritance) were revealed.",
      "chain": [
        "20296",
        "20020",
        "11048",
        "34"
      ]
    },
    {
      "hadith_no": "252",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الله بن محمد، قال حدثنا يحيى بن آدم، قال حدثنا زهير، عن أبي إسحاق، قال حدثنا أبو جعفر، أنه كان عند جابر بن عبد الله هو وأبوه، وعنده قوم فسألوه عن الغسل،‏.‏ فقال يكفيك صاع‏.‏ فقال رجل ما يكفيني‏.‏ فقال جابر كان يكفي من هو أوفى منك شعرا، وخير منك، ثم أمنا في ثوب‏.‏",
      "text_en": " Narrated Abu Ja`far:                     While I and my father were with Jabir bin `Abdullah, some People asked him about taking a bath He replied, \"A Sa` of water is sufficient for you.\" A man said, \"A Sa` is not sufficient for me.\" Jabir said, \"A Sa was sufficient for one who had more hair than you and was better than you (meaning the Prophet).\" And then Jabir (put on) his garment and led the prayer.",
      "chain": [
        "30351",
        "20364",
        "20321",
        "11049",
        "11442",
        "34"
      ]
    },
    {
      "hadith_no": "255",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن بشار، قال حدثنا غندر، قال حدثنا شعبة، عن مخول بن راشد، عن محمد بن علي، عن جابر بن عبد الله، قال كان النبي صلى الله عليه وسلم يفرغ على رأسه ثلاثا‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     The Prophet used to pour water three times on his head.",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11390",
        "11442",
        "34"
      ]
    },
    {
      "hadith_no": "256",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو نعيم، قال حدثنا معمر بن يحيى بن سام، حدثني أبو جعفر، قال قال لي جابر أتاني ابن عمك يعرض بالحسن بن محمد ابن الحنفية قال كيف الغسل من الجنابة فقلت كان النبي صلى الله عليه وسلم يأخذ ثلاثة أكف ويفيضها على رأسه، ثم يفيض على سائر جسده‏.‏ فقال لي الحسن إني رجل كثير الشعر‏.‏ فقلت كان النبي صلى الله عليه وسلم أكثر منك شعرا‏.‏",
      "text_en": " Narrated Abu Ja`far:                     Jabir bin `Abdullah said to me, \"Your cousin (Hasan bin Muhammad bin Al-Hanafiya) came to me and asked about the bath of Janaba. I replied, 'The Prophet uses to take three handfuls of water, pour them on his head and then pour more water over his body.' Al-Hasan said to me, 'I am a hairy man.' I replied, 'The Prophet had more hair than you'. \"",
      "chain": [
        "20348",
        "11654",
        "11442",
        "34"
      ]
    },
    {
      "hadith_no": "335",
      "source": " Sahih Bukhari ",
      "chapter": "Rubbing hands and feet with dust (Tayammum) - كتاب التيمم",
      "chapter_no": "7",
      "text_ar": "حدثنا محمد بن سنان، قال حدثنا هشيم، ح قال وحدثني سعيد بن النضر، قال أخبرنا هشيم، قال أخبرنا سيار، قال حدثنا يزيد  هو ابن صهيب الفقير  قال أخبرنا جابر بن عبد الله، أن النبي صلى الله عليه وسلم قال ‏\"‏ أعطيت خمسا لم يعطهن أحد قبلي نصرت بالرعب مسيرة شهر، وجعلت لي الأرض مسجدا وطهورا، فأيما رجل من أمتي أدركته الصلاة فليصل، وأحلت لي المغانم ولم تحل لأحد قبلي، وأعطيت الشفاعة، وكان النبي يبعث إلى قومه خاصة، وبعثت إلى الناس عامة ‏\"‏‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     The Prophet said, \"I have been given five things which were not given to any one else before me. -1. Allah made me victorious by awe, (by His frightening my enemies) for a distance of one month's journey. -2. The earth has been made for me (and for my followers) a place for praying and a thing to perform Tayammum, therefore anyone of my followers can pray wherever the time of a prayer is due. -3. The booty has been made Halal (lawful) for me yet it was not lawful for anyone else before me. -4. I have been given the right of intercession (on the Day of Resurrection). -5. Every Prophet used to be sent to his nation only but I have been sent to all mankind.",
      "chain": [
        "34207",
        "20468",
        "30253",
        "20468",
        "11429",
        "11665",
        "34"
      ]
    },
    {
      "hadith_no": "361",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا يحيى بن صالح، قال حدثنا فليح بن سليمان، عن سعيد بن الحارث، قال سألنا جابر بن عبد الله عن الصلاة، في الثوب الواحد فقال خرجت مع النبي صلى الله عليه وسلم في بعض أسفاره، فجئت ليلة لبعض أمري، فوجدته يصلي وعلى ثوب واحد، فاشتملت به وصليت إلى جانبه، فلما انصرف قال ‏\"‏ ما السرى يا جابر ‏\"‏‏.‏ فأخبرته بحاجتي، فلما فرغت قال ‏\"‏ ما هذا الاشتمال الذي رأيت ‏\"‏‏.‏ قلت كان ثوب‏.‏ يعني ضاق‏.‏ قال ‏\"‏ فإن كان واسعا فالتحف به، وإن كان ضيقا فاتزر به ‏\"‏‏.‏",
      "text_en": " Narrated Sa`id bin Al-Harith:                     I asked Jabir bin `Abdullah about praying in a single garment. He said, \"I traveled with the Prophet during some of his journeys, and I came to him at night for some purpose and I found him praying. At that time, I was wearing a single garment with which I covered my shoulders and prayed by his side. When he finished the prayer, he asked, 'O Jabir! What has brought you here?' I told him what I wanted. When I finished, he asked, 'O Jabir! What is this garment which I have seen and with which you covered your shoulders?' I replied, 'It is a (tight) garment.' He said, 'If the garment is large enough, wrap it round the body (covering the shoulders) and if it is tight (too short) then use it as an Izar (tie it around your waist only.)' \"",
      "chain": [
        "20470",
        "20169",
        "11167",
        "34"
      ]
    },
    {
      "hadith_no": "364",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا مطر بن الفضل، قال حدثنا روح، قال حدثنا زكرياء بن إسحاق، حدثنا عمرو بن دينار، قال سمعت جابر بن عبد الله، يحدث أن رسول الله صلى الله عليه وسلم كان ينقل معهم الحجارة للكعبة وعليه إزاره‏.‏ فقال له العباس عمه يا ابن أخي، لو حللت إزارك فجعلت على منكبيك دون الحجارة‏.‏ قال فحله فجعله على منكبيه، فسقط مغشيا عليه، فما رئي بعد ذلك عريانا صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     While Allah's Apostle was carrying stones (along) with the people of Mecca for (the building of) the Ka`ba wearing an Izar (waist-sheet cover), his uncle Al-`Abbas said to him, \"O my nephew! (It would be better) if you take off your Izar and put it over your shoulders underneath the stones.\" So he took off his Izar and put it over his shoulders, but he fell unconscious and since then he had never been seen naked.",
      "chain": [
        "30392",
        "20229",
        "11244",
        "11081",
        "34"
      ]
    },
    {
      "hadith_no": "400",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا مسلم، قال حدثنا هشام، قال حدثنا يحيى بن أبي كثير، عن محمد بن عبد الرحمن، عن جابر، قال كان رسول الله صلى الله عليه وسلم يصلي على راحلته حيث توجهت، فإذا أراد الفريضة نزل فاستقبل القبلة‏.‏",
      "text_en": " Narrated Jabir:                     Allah's Apostle used to pray (optional, non-obligatory prayer) while riding on his mount (Rahila) wherever it turned, and whenever he wanted to pray the compulsory prayer he dismounted and prayed facing the Qibla.",
      "chain": [
        "20285",
        "20295",
        "11449",
        "11105",
        "34"
      ]
    },
    {
      "hadith_no": "438",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا محمد بن سنان، قال حدثنا هشيم، قال حدثنا سيار  هو أبو الحكم  قال حدثنا يزيد الفقير، قال حدثنا جابر بن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أعطيت خمسا لم يعطهن أحد من الأنبياء قبلي، نصرت بالرعب مسيرة شهر، وجعلت لي الأرض مسجدا وطهورا، وأيما رجل من أمتي أدركته الصلاة فليصل، وأحلت لي الغنائم، وكان النبي يبعث إلى قومه خاصة، وبعثت إلى الناس كافة، وأعطيت الشفاعة ‏\"‏‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     Allah's Apostle said, \"I have been given five things which were not given to any amongst the Prophets before me. These are: -1. Allah made me victorious by awe (by His frightening my enemies) for a distance of one month's journey. -2. The earth has been made for me (and for my followers) a place for praying and a thing to perform Tayammum. Therefore my followers can pray wherever the time of a prayer is due. -3. The booty has been made Halal (lawful) for me (and was not made so for anyone else). -4. Every Prophet used to be sent to his nation exclusively but I have been sent to all mankind. -5. I have been given the right of intercession (on the Day of Resurrection.)",
      "chain": [
        "34207",
        "20468",
        "11429",
        "11665",
        "34"
      ]
    },
    {
      "hadith_no": "443",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا خلاد بن يحيى، قال حدثنا مسعر، قال حدثنا محارب بن دثار، عن جابر بن عبد الله، قال أتيت النبي صلى الله عليه وسلم وهو في المسجد  قال مسعر أراه قال ضحى  فقال ‏\"‏ صل ركعتين ‏\"‏‏.‏ وكان لي عليه دين فقضاني وزادني‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     I went to the Prophet in the mosque (the sub-narrator Mas`ar thought that Jabir had said, \"In the forenoon.\") He ordered me to pray two rak`at. He owed me some money and he repaid it to me and gave more than what was due to me.",
      "chain": [
        "20191",
        "20359",
        "11389",
        "34"
      ]
    },
    {
      "hadith_no": "449",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا خلاد، قال حدثنا عبد الواحد بن أيمن، عن أبيه، عن جابر، أن امرأة، قالت يا رسول الله، ألا أجعل لك شيئا تقعد عليه، فإن لي غلاما نجارا قال ‏\"‏ إن شئت ‏\"‏‏.‏ فعملت المنبر‏.‏",
      "text_en": " Narrated Jabir:                     A woman said, \"O Allah's Apostle! Shall I get something constructed for you to sit on as I have a slave who is a carpenter?\" He replied, \"Yes, if you like.\" So she had that pulpit constructed.",
      "chain": [
        "11560",
        "11556",
        "34"
      ]
    },
    {
      "hadith_no": "451",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا قتيبة بن سعيد، قال حدثنا سفيان، قال قلت لعمرو أسمعت جابر بن عبد الله يقول مر رجل في المسجد ومعه سهام، فقال له رسول الله صلى الله عليه وسلم ‏\"‏ أمسك بنصالها ‏\"‏‏.‏",
      "text_en": " Narrated `Amr:                     I heard Jabir bin `Abdullah saying, \"A man passed through the mosque carrying arrows. Allah's Apostle said to him, 'Hold them by their heads.' \"",
      "chain": [
        "30367",
        "20005",
        "34"
      ]
    },
    {
      "hadith_no": "565",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا مسلم بن إبراهيم، قال حدثنا شعبة، عن سعد بن إبراهيم، عن محمد بن عمرو  هو ابن الحسن بن علي  قال سألنا جابر بن عبد الله عن صلاة النبي، صلى الله عليه وسلم فقال كان يصلي الظهر بالهاجرة، والعصر والشمس حية، والمغرب إذا وجبت، والعشاء إذا كثر الناس عجل، وإذا قلوا أخر، والصبح بغلس‏.‏",
      "text_en": " Narrated Muhammad bin `Amr:                     We asked Jabir bin `Abdullah about the prayers of the Prophet . He said, \"He used to pray Zuhr prayer at midday, the `Asr when the sun was still hot, and the Maghrib after sunset (at its stated time). The `Isha was offered early if the people gathered, and used to be delayed if their number was less; and the morning prayer was offered when it was still dark. \"",
      "chain": [
        "20285",
        "20020",
        "11063",
        "11220",
        "34"
      ]
    },
    {
      "hadith_no": "596",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا معاذ بن فضالة، قال حدثنا هشام، عن يحيى، عن أبي سلمة، عن جابر بن عبد الله، أن عمر بن الخطاب، جاء يوم الخندق بعد ما غربت الشمس، فجعل يسب كفار قريش قال يا رسول الله ما كدت أصلي العصر حتى كادت الشمس تغرب‏.‏ قال النبي صلى الله عليه وسلم ‏\"‏ والله ما صليتها ‏\"‏‏.‏ فقمنا إلى بطحان، فتوضأ للصلاة، وتوضأنا لها فصلى العصر بعد ما غربت الشمس، ثم صلى بعدها المغرب‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     On the day of Al-Khandaq (the battle of trench.) `Umar bin Al-Khattab came cursing the disbelievers of Quraish after the sun had set and said, \"O Allah's Apostle I could not offer the `Asr prayer till the sun had set.\" The Prophet said, \"By Allah! I, too, have not prayed.\" So we turned towards Buthan, and the Prophet performed ablution and we too performed ablution and offered the `Asr prayer after the sun had set, and then he offered the Maghrib prayer.",
      "chain": [
        "30177",
        "20295",
        "20031",
        "10567",
        "34",
        "3"
      ]
    },
    {
      "hadith_no": "598",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا مسدد، قال حدثنا يحيى، عن هشام، قال حدثنا يحيى  هو ابن أبي كثير  عن أبي سلمة، عن جابر، قال جعل عمر يوم الخندق يسب كفارهم وقال ما كدت أصلي العصر حتى غربت‏.‏ قال فنزلنا بطحان، فصلى بعد ما غربت الشمس، ثم صلى المغرب‏.‏",
      "text_en": " Narrated Jabir:                     `Umar came cursing the disbelievers (of Quraish) on the day of Al-Khandaq (the battle of Trench) and said, \"I could not offer the `Asr prayer till the sun had set. Then we went to Buthan and he offered the (`Asr) prayer after sunset and then he offered the Maghrib prayer.",
      "chain": [
        "30175",
        "20031",
        "11065",
        "11449",
        "10567",
        "34"
      ]
    },
    {
      "hadith_no": "614",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا علي بن عياش، قال حدثنا شعيب بن أبي حمزة، عن محمد بن المنكدر، عن جابر بن عبد الله، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من قال حين يسمع النداء اللهم رب هذه الدعوة التامة والصلاة القائمة آت محمدا الوسيلة والفضيلة وابعثه مقاما محمودا الذي وعدته، حلت له شفاعتي يوم القيامة ‏\"‏‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     Allah's Apostle said, \"Whoever after listening to the Adhan says, 'Allahumma Rabba hadhihi-dda` watit-tammah, was-salatil qa'imah, ati Muhammadan al-wasilata wal-fadilah, wa b`ath-hu maqaman mahmudan-il-ladhi wa`adtahu' [O Allah! Lord of this perfect call (perfect by not ascribing partners to You) and of the regular prayer which is going to be established, give Muhammad the right of intercession and illustriousness, and resurrect him to the best and the highest place in Paradise that You promised him (of)], then my intercession for him will be allowed on the Day of Resurrection\".",
      "chain": [
        "20448",
        "20428",
        "11048",
        "34"
      ]
    },
    {
      "hadith_no": "641",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو نعيم، قال حدثنا شيبان، عن يحيى، قال سمعت أبا سلمة، يقول أخبرنا جابر بن عبد الله، أن النبي صلى الله عليه وسلم جاءه عمر بن الخطاب يوم الخندق فقال يا رسول الله، والله ما كدت أن أصلي حتى كادت الشمس تغرب، وذلك بعد ما أفطر الصائم‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ والله ما صليتها ‏\"‏ فنزل النبي صلى الله عليه وسلم إلى بطحان وأنا معه فتوضأ ثم صلى  يعني العصر  بعد ما غربت الشمس، ثم صلى بعدها المغرب‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     On the day of Al-Khandaq (the trench), `Umar bin Al-Khattab went to the Prophet and said, \"O Allah's Apostle! By Allah, I could not pray (the `Asr) till the sun had set.\" `Umar told this to the Prophet at the time when a fasting person had done Iftar (taken his meals). The Prophet then went to Buthan and I was with him. He performed ablution and offered the `Asr prayer after the sun had set and then the Maghrib prayer.",
      "chain": [
        "20348",
        "20240",
        "11449",
        "10567",
        "34"
      ]
    },
    {
      "hadith_no": "700",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا مسلم، قال حدثنا شعبة، عن عمرو، عن جابر بن عبد الله، أن معاذ بن جبل، كان يصلي مع النبي صلى الله عليه وسلم ثم يرجع فيؤم قومه‏.‏",
      "text_en": " Narrated Mu`adh bin Jabal:                     I used to pray the `Isha prayer with the Prophet and then go to lead my people in the prayer.",
      "chain": [
        "20285",
        "20020",
        "20377",
        "34",
        "32"
      ]
    },
    {
      "hadith_no": "701",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "وحدثني محمد بن بشار، قال حدثنا غندر، قال حدثنا شعبة، عن عمرو، قال سمعت جابر بن عبد الله، قال كان معاذ بن جبل يصلي مع النبي صلى الله عليه وسلم ثم يرجع فيؤم قومه، فصلى العشاء فقرأ بالبقرة، فانصرف الرجل، فكأن معاذا تناول منه، فبلغ النبي صلى الله عليه وسلم فقال ‏\"‏ فتان فتان فتان ‏\"‏ ثلاث مرار أو قال ‏\"‏ فاتنا فاتنا فاتن ‏\"‏ وأمره بسورتين من أوسط المفصل‏.‏ قال عمرو لا أحفظهما‏.‏",
      "text_en": " Narrated `Amr:                     Jabir bin `Abdullah said, \"Mu`adh bin Jabal used to pray with the Prophet and then go to lead his people in prayer Once he led the `Isha' prayer and recited Surat \"Al-Baqara.\" Somebody left the prayer and Mu`adh criticized him. The news reached the Prophet and he said to Mu`adh, 'You are putting the people to trial,' and repeated it thrice (or said something similar) and ordered him to recite two medium Suras of Mufassal.\" (`Amr said that he had forgotten the names of those Suras).",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11439",
        "34"
      ]
    },
    {
      "hadith_no": "705",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا آدم بن أبي إياس، قال حدثنا شعبة، قال حدثنا محارب بن دثار، قال سمعت جابر بن عبد الله الأنصاري، قال أقبل رجل بناضحين وقد جنح الليل، فوافق معاذا يصلي، فترك ناضحه وأقبل إلى معاذ، فقرأ بسورة البقرة أو النساء، فانطلق الرجل، وبلغه أن معاذا نال منه، فأتى النبي صلى الله عليه وسلم فشكا إليه معاذا، فقال النبي صلى الله عليه وسلم ‏\"‏ يا معاذ أفتان أنت  أو فاتن ثلاث مرار  فلولا صليت بسبح اسم ربك، والشمس وضحاها، والليل إذا يغشى، فإنه يصلي وراءك الكبير والضعيف وذو الحاجة ‏\"‏‏.‏ أحسب هذا في الحديث‏.‏ قال أبو عبد الله وتابعه سعيد بن مسروق ومسعر والشيباني‏.‏ قال عمرو وعبيد الله بن مقسم وأبو الزبير عن جابر قرأ معاذ في العشاء بالبقرة‏.‏ وتابعه الأعمش عن محارب‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah Al-Ansari:                     Once a man was driving two Nadihas (camels used for agricultural purposes) and night had fallen. He found Mu`adh praying so he made his camel kneel and joined Mu`adh in the prayer. The latter recited Surat 'Al-Baqara\" or Surat \"An-Nisa\", (so) the man left the prayer and went away. When he came to know that Mu`adh had criticized him, he went to the Prophet, and complained against Mu`adh. The Prophet said thrice, \"O Mu`adh ! Are you putting the people to trial?\" It would have been better if you had recited \"Sabbih Isma Rabbika-l-A`la (87)\", Wash-shamsi wa duhaha (91)\", or \"Wal-laili idha yaghsha (92)\", for the old, the weak and the needy pray behind you.\" Jabir said that Mu`adh recited Sura Al-Baqara in the `Isha' prayer.",
      "chain": [
        "20404",
        "20020",
        "11389",
        "34"
      ]
    },
    {
      "hadith_no": "711",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا سليمان بن حرب، وأبو النعمان، قالا حدثنا حماد بن زيد، عن أيوب، عن عمرو بن دينار، عن جابر، قال كان معاذ يصلي مع النبي صلى الله عليه وسلم ثم يأتي قومه فيصلي بهم‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     Mu`adh used to pray with the Prophet and then go and lead his people (tribe) in the prayer.",
      "chain": [
        "20193",
        "20283",
        "20022",
        "11015",
        "11081",
        "34"
      ]
    },
    {
      "hadith_no": "854",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد الله بن محمد، قال حدثنا أبو عاصم، قال أخبرنا ابن جريج، قال أخبرني عطاء، قال سمعت جابر بن عبد الله، قال قال النبي صلى الله عليه وسلم ‏\"‏ من أكل من هذه الشجرة  يريد الثوم  فلا يغشانا في مساجدنا ‏\"‏‏.‏ قلت ما يعني به قال ما أراه يعني إلا نيئه‏.‏ وقال مخلد بن يزيد عن ابن جريج إلا نتنه‏.‏",
      "text_en": " Narrated `Ata':                     I heard Jabir bin `Abdullah saying, \"The Prophet said, 'Whoever eats (from) this plant (he meant garlic) should keep away from our mosque.\" I said, \"What does he mean by that?\" He replied, \"I think he means only raw garlic.\"",
      "chain": [
        "30351",
        "20241",
        "11070",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "918",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا سعيد بن أبي مريم، قال حدثنا محمد بن جعفر، قال أخبرني يحيى بن سعيد، قال أخبرني ابن أنس، أنه سمع جابر بن عبد الله، قال كان جذع يقوم إليه النبي صلى الله عليه وسلم فلما وضع له المنبر سمعنا للجذع مثل أصوات العشار حتى نزل النبي صلى الله عليه وسلم فوضع يده عليه‏.‏ قال سليمان عن يحيى أخبرني حفص بن عبيد الله بن أنس أنه سمع جابرا‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     The Prophet used to stand by a stem of a date-palm tree (while delivering a sermon). When the pulpit was placed for him we heard that stem crying like a pregnant she-camel till the Prophet got down from the pulpit and placed his hand over it.",
      "chain": [
        "30232",
        "20173",
        "11062",
        "34"
      ]
    },
    {
      "hadith_no": "930",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا أبو النعمان، قال حدثنا حماد بن زيد، عن عمرو بن دينار، عن جابر بن عبد الله، قال جاء رجل والنبي صلى الله عليه وسلم يخطب الناس يوم الجمعة فقال ‏\"‏ أصليت يا فلان ‏\"‏‏.‏ قال لا‏.‏ قال ‏\"‏ قم فاركع ‏\"‏‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     A person entered the mosque while the Prophet was delivering the Khutba on a Friday. The Prophet said to him, \"Have you prayed?\" The man replied in the negative. The Prophet said, \"Get up and pray two rak`at.\"",
      "chain": [
        "20283",
        "20022",
        "11081",
        "34"
      ]
    },
    {
      "hadith_no": "931",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا علي بن عبد الله، قال حدثنا سفيان، عن عمرو، سمع جابرا، قال دخل رجل يوم الجمعة والنبي صلى الله عليه وسلم يخطب فقال ‏\"‏ أصليت ‏\"‏‏.‏ قال لا‏.‏ قال ‏\"‏ فصل ركعتين ‏\"‏‏.‏",
      "text_en": " Narrated Jabir:                     A man entered the Mosque while the Prophet was delivering the Khutba. The Prophet said to him, \"Have you prayed?\" The man replied in the negative. The Prophet said, \"Pray two rak`at.\"",
      "chain": [
        "30026",
        "20005",
        "11081",
        "34"
      ]
    },
    {
      "hadith_no": "936",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا معاوية بن عمرو، قال حدثنا زائدة، عن حصين، عن سالم بن أبي الجعد، قال حدثنا جابر بن عبد الله، قال بينما نحن نصلي مع النبي صلى الله عليه وسلم إذ أقبلت عير تحمل طعاما، فالتفتوا إليها حتى ما بقي مع النبي صلى الله عليه وسلم إلا اثنا عشر رجلا، فنزلت هذه الآية ‏{‏وإذا رأوا تجارة أو لهوا انفضوا إليها وتركوك قائما‏}‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     While we were praying (Jumua Khutba & prayer) with the Prophet (p.b.u.h), some camels loaded with food, arrived (from Sham). The people diverted their attention towards the camels (and left the mosque), and only twelve persons remained with the Prophet. So this verse was revealed: \"But when they see Some bargain or some amusement, They disperse headlong to it, And leave you standing.\" (62.11)",
      "chain": [
        "20389",
        "20320",
        "15097",
        "11342",
        "34"
      ]
    },
    {
      "hadith_no": "945",
      "source": " Sahih Bukhari ",
      "chapter": "Fear Prayer - كتاب صلاة الخوف",
      "chapter_no": "12",
      "text_ar": "حدثنا يحيى، قال حدثنا وكيع، عن علي بن مبارك، عن يحيى بن أبي كثير، عن أبي سلمة، عن جابر بن عبد الله، قال جاء عمر يوم الخندق، فجعل يسب كفار قريش ويقول يا رسول الله ما صليت العصر حتى كادت الشمس أن تغيب‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ وأنا والله ما صليتها بعد ‏\"‏‏.‏ قال فنزل إلى بطحان فتوضأ، وصلى العصر بعد ما غابت الشمس، ثم صلى المغرب بعدها‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     On the day of the Khandaq `Umar came, cursing the disbelievers of Quraish and said, \"O Allah's Apostle! I have not offered the `Asr prayer and the sun has set.\" The Prophet replied, \"By Allah! I too, have not offered the prayer yet. \"The Prophet then went to Buthan, performed ablution and performed the `Asr prayer after the sun had set and then offered the Maghrib prayer after it.\"",
      "chain": [
        "30020",
        "20032",
        "20449",
        "11449",
        "10567",
        "34"
      ]
    },
    {
      "hadith_no": "961",
      "source": " Sahih Bukhari ",
      "chapter": "The Two Festivals (Eids) - كتاب العيدين",
      "chapter_no": "13",
      "text_ar": "حدثنا إبراهيم بن موسى، قال أخبرنا هشام، أن ابن جريج، أخبرهم قال أخبرني عطاء، عن جابر بن عبد الله، قال سمعته يقول إن النبي صلى الله عليه وسلم خرج يوم الفطر، فبدأ بالصلاة قبل الخطبة‏.‏ قال وأخبرني عطاء، أن ابن عباس، أرسل إلى ابن الزبير في أول ما بويع له إنه لم يكن يؤذن بالصلاة يوم الفطر، إنما الخطبة بعد الصلاة‏.‏ وأخبرني عطاء، عن ابن عباس، وعن جابر بن عبد الله، قالا لم يكن يؤذن يوم الفطر ولا يوم الأضحى‏.‏ وعن جابر بن عبد الله، قال سمعته يقول إن النبي صلى الله عليه وسلم قام فبدأ بالصلاة، ثم خطب الناس بعد، فلما فرغ نبي الله صلى الله عليه وسلم نزل فأتى النساء، فذكرهن وهو يتوكأ على يد بلال، وبلال باسط ثوبه، يلقي فيه النساء صدقة‏.‏ قلت لعطاء أترى حقا على الإمام الآن أن يأتي النساء فيذكرهن حين يفرغ قال إن ذلك لحق عليهم، وما لهم أن لا يفعلوا",
      "text_en": " Narrated Ibn Juraij:                     `Ata' said, \"Jabir bin `Abdullah said, 'The Prophet went out on the Day of `Id-ul-Fitr and offered the prayer before delivering the Khutba, Ata told me that during the early days of Ibn Az-Zubair, Ibn `Abbas had sent a message to him telling him that the Adhan for the `Id Prayer was never pronounced (in the life time of Allah's Apostle) and the Khutba used to be delivered after the prayer. Ata told me that Ibn `Abbas and Jabir bin `Abdullah, had said, \"There was no Adhan for the prayer of `Id-ul-Fitr and `Id-ul-Aqha.\" `Ata' said, \"I heard Jabir bin `Abdullah saying, 'The Prophet stood up and started with the prayer, and after it he delivered the Khutba. When the Prophet of Allah (p.b.u.h) finished (the Khutba), he went to the women and preached to them, while he was leaning on Bilal's hand. Bilal was spreading his garment and the ladies were putting alms in it.' \" I said to Ata, \"Do you think it incumbent upon an Imam to go to the women and preach to them after finishing the prayer and Khutba?\" `Ata' said, \"No doubt it is incumbent on Imams to do so, and why should they not do so?\"",
      "chain": [
        "30309",
        "20295",
        "11070",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "978",
      "source": " Sahih Bukhari ",
      "chapter": "The Two Festivals (Eids) - كتاب العيدين",
      "chapter_no": "13",
      "text_ar": "حدثني إسحاق بن إبراهيم بن نصر، قال حدثنا عبد الرزاق، قال حدثنا ابن جريج، قال أخبرني عطاء، عن جابر بن عبد الله، قال سمعته يقول قام النبي صلى الله عليه وسلم يوم الفطر، فصلى فبدأ بالصلاة ثم خطب، فلما فرغ نزل فأتى النساء، فذكرهن وهو يتوكأ على يد بلال وبلال باسط ثوبه، يلقي فيه النساء الصدقة‏.‏ قلت لعطاء زكاة يوم الفطر قال لا ولكن صدقة يتصدقن حينئذ، تلقي فتخها ويلقين‏.‏ قلت أترى حقا على الإمام ذلك ويذكرهن قال إنه لحق عليهم، وما لهم لا يفعلونه",
      "text_en": "  Narrated Ibn Juraij:                      `Ata' told me that he had heard Jabir bin `Abdullah saying, \"The Prophet stood up to offer the prayer of the `Id ul Fitr. He first offered the prayer and then delivered the Khutba. After finishing it he got down (from the pulpit) and went towards the women and advised them while he was leaning on Bilal's hand. Bilal was spreading out his garment where the women were putting their alms.\" I asked `Ata' whether it was the Zakat of `Id ul Fitr. He said, \"No, it was just alms given at that time. Some lady put her finger ring and the others would do the same.\" I said, (to `Ata'), \"Do you think that it is incumbent upon the Imam to give advice to the women (on `Id day)?\" He said, \"No doubt, it is incumbent upon the Imams to do so and why should they not do so?\"",
      "chain": [
        "30123",
        "20121",
        "11070",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "986",
      "source": " Sahih Bukhari ",
      "chapter": "The Two Festivals (Eids) - كتاب العيدين",
      "chapter_no": "13",
      "text_ar": "حدثنا محمد، قال أخبرنا أبو تميلة، يحيى بن واضح عن فليح بن سليمان، عن سعيد بن الحارث، عن جابر، قال كان النبي صلى الله عليه وسلم إذا كان يوم عيد خالف الطريق‏.‏ تابعه يونس بن محمد عن فليح‏.‏ وحديث جابر أصح‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     On the Day of `Id the Prophet used to return (after offering the `Id prayer) through a way different from that by which he went.",
      "chain": [
        "30213",
        "20169",
        "11167",
        "34"
      ]
    },
    {
      "hadith_no": "1094",
      "source": " Sahih Bukhari ",
      "chapter": "Shortening the Prayers (At-Taqseer) - كتاب التقصير",
      "chapter_no": "18",
      "text_ar": "حدثنا أبو نعيم، قال حدثنا شيبان، عن يحيى، عن محمد بن عبد الرحمن، أن جابر بن عبد الله، أخبره أن النبي صلى الله عليه وسلم كان يصلي التطوع وهو راكب في غير القبلة‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     The Prophet used to offer the Nawafil, while riding, facing a direction other than that of the Qibla.",
      "chain": [
        "20348",
        "20240",
        "11449",
        "11105",
        "34"
      ]
    },
    {
      "hadith_no": "1099",
      "source": " Sahih Bukhari ",
      "chapter": "Shortening the Prayers (At-Taqseer) - كتاب التقصير",
      "chapter_no": "18",
      "text_ar": "حدثنا معاذ بن فضالة، قال حدثنا هشام، عن يحيى، عن محمد بن عبد الرحمن بن ثوبان، قال حدثني جابر بن عبد الله، أن النبي صلى الله عليه وسلم كان يصلي على راحلته نحو المشرق فإذا أراد أن يصلي المكتوبة نزل فاستقبل القبلة‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     The Prophet used to pray (the Nawafil) on his Mount facing east and whenever he wanted to offer the compulsory prayer, he used to dismount and face the Qibla.",
      "chain": [
        "30177",
        "20295",
        "20031",
        "11218",
        "34"
      ]
    },
    {
      "hadith_no": "1166",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا قتيبة، قال حدثنا عبد الرحمن بن أبي الموالي، عن محمد بن المنكدر، عن جابر بن عبد الله  رضى الله عنهما  قال كان رسول الله صلى الله عليه وسلم يعلمنا الاستخارة في الأمور كما يعلمنا السورة من القرآن يقول ‏\"‏ إذا هم أحدكم بالأمر فليركع ركعتين من غير الفريضة ثم ليقل اللهم إني أستخيرك بعلمك وأستقدرك بقدرتك، وأسألك من فضلك العظيم، فإنك تقدر ولا أقدر وتعلم ولا أعلم وأنت علام الغيوب، اللهم إن كنت تعلم أن هذا الأمر خير لي في ديني ومعاشي وعاقبة أمري  أو قال عاجل أمري وآجله  فاقدره لي ويسره لي ثم بارك لي فيه، وإن كنت تعلم أن هذا الأمر شر لي في ديني ومعاشي وعاقبة أمري  أو قال في عاجل أمري وآجله  فاصرفه عني واصرفني عنه، واقدر لي الخير حيث كان ثم أرضني  قال  ويسمي حاجته ‏\"‏‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     The Prophet (p.b.u.h) used to teach us the way of doing Istikhara (Istikhara means to ask Allah to guide one to the right sort of action concerning any job or a deed), in all matters as he taught us the Suras of the Qur'an. He said, \"If anyone of you thinks of doing any job he should offer a two rak`at prayer other than the compulsory ones and say (after the prayer): -- 'Allahumma inni astakhiruka bi'ilmika, Wa astaqdiruka bi-qudratika, Wa as'alaka min fadlika Al-`azlm Fa-innaka taqdiru Wala aqdiru, Wa ta'lamu Wala a'lamu, Wa anta 'allamu l-ghuyub. Allahumma, in kunta ta'lam anna hadha-lamra Khairun li fi dini wa ma'ashi wa'aqibati `Amri (or 'ajili `Amri wa'ajilihi) Faqdirhu wa yas-sirhu li thumma barik li Fihi, Wa in kunta ta'lamu anna hadha-lamra shar-run li fi dini wa ma'ashi wa'aqibati `Amri (or fi'ajili `Amri wa ajilihi) Fasrifhu anni was-rifni anhu. Waqdir li al-khaira haithu kana Thumma ardini bihi.' (O Allah! I ask guidance from Your knowledge, And Power from Your Might and I ask for Your great blessings. You are capable and I am not. You know and I do not and You know the unseen. O Allah! If You know that this job is good for my religion and my subsistence and in my Hereafter--(or said: If it is better for my present and later needs)--Then You ordain it for me and make it easy for me to get, And then bless me in it, and if You know that this job is harmful to me In my religion and subsistence and in the Hereafter--(or said: If it is worse for my present and later needs)--Then keep it away from me and let me be away from it. And ordain for me whatever is good for me, And make me satisfied with it). The Prophet added that then the person should name (mention) his need.",
      "chain": [
        "30367",
        "20441",
        "11048",
        "34"
      ]
    },
    {
      "hadith_no": "1170",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا آدم، قال أخبرنا شعبة، أخبرنا عمرو بن دينار، قال سمعت جابر بن عبد الله  رضى الله عنهما  قال قال رسول الله صلى الله عليه وسلم وهو يخطب ‏\"‏ إذا جاء أحدكم والإمام يخطب  أو قد خرج  فليصل ركعتين ‏\"‏‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     While delivering a sermon, Allah's Apostle said, \"If anyone of you comes while the Imam is delivering the sermon or has come out for it, he should offer a two rak`at prayer.\"",
      "chain": [
        "20404",
        "20020",
        "11081",
        "34"
      ]
    },
    {
      "hadith_no": "1217",
      "source": " Sahih Bukhari ",
      "chapter": "Actions while Praying - كتاب العمل فى الصلاة",
      "chapter_no": "21",
      "text_ar": "حدثنا أبو معمر، حدثنا عبد الوارث، حدثنا كثير بن شنظير، عن عطاء بن أبي رباح، عن جابر بن عبد الله  رضى الله عنهما  قال بعثني رسول الله صلى الله عليه وسلم في حاجة له فانطلقت، ثم رجعت وقد قضيتها، فأتيت النبي صلى الله عليه وسلم فسلمت عليه، فلم يرد على، فوقع في قلبي ما الله أعلم به فقلت في نفسي لعل رسول الله صلى الله عليه وسلم وجد على أني أبطأت عليه، ثم سلمت عليه فلم يرد على، فوقع في قلبي أشد من المرة الأولى، ثم سلمت عليه فرد على فقال ‏\"‏ إنما منعني أن أرد عليك أني كنت أصلي ‏\"‏‏.‏ وكان على راحلته متوجها إلى غير القبلة‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     Allah's Apostle sent me for some job and when I had finished it I returned and came to the Prophet and greeted him but he did not return my greeting. So I felt so sorry that only Allah knows it and I said to myself,, 'Perhaps Allah's Apostle is angry because I did not come quickly, then again I greeted him but he did not reply. I felt even more sorry than I did the first time. Again I greeted him and he returned the greeting and said, \"The thing which prevented me from returning the greeting was that I was praying.\" And at that time he was on his Rahila and his face was not towards the Qibla.",
      "chain": [
        "30315",
        "20258",
        "11610",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "1244",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، قال سمعت محمد بن المنكدر، قال سمعت جابر بن عبد الله  رضى الله عنهما  قال لما قتل أبي جعلت أكشف الثوب عن وجهه أبكي، وينهوني عنه والنبي صلى الله عليه وسلم لا ينهاني، فجعلت عمتي فاطمة تبكي، فقال النبي صلى الله عليه وسلم ‏\"‏ تبكين أو لا تبكين، ما زالت الملائكة تظله بأجنحتها حتى رفعتموه ‏\"‏‏.‏ تابعه ابن جريج أخبرني ابن المنكدر سمع جابرا  رضى الله عنه ‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     When my father was martyred, I lifted the sheet from his face and wept and the people forbade me to do so but the Prophet did not forbid me. Then my aunt Fatima began weeping and the Prophet said, \"It is all the same whether you weep or not. The angels were shading him continuously with their wings till you shifted him (from the field). \"",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11048",
        "34"
      ]
    },
    {
      "hadith_no": "1270",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا مالك بن إسماعيل، حدثنا ابن عيينة، عن عمرو، سمع جابرا  رضى الله عنه  قال أتى النبي صلى الله عليه وسلم عبد الله بن أبى بعد ما دفن فأخرجه، فنفث فيه من ريقه وألبسه قميصه‏.‏",
      "text_en": " Narrated Jabir:                     The Prophet came to (the grave of) `Abdullah bin Ubai after his body was buried. The body was brought out and then the Prophet put his saliva over the body and clothed it in his shirt.",
      "chain": [
        "20357",
        "20005",
        "11081",
        "34"
      ]
    },
    {
      "hadith_no": "1293",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، حدثنا ابن المنكدر، قال سمعت جابر بن عبد الله  رضى الله عنهما  قال جيء بأبي يوم أحد، قد مثل به حتى وضع بين يدى رسول الله صلى الله عليه وسلم وقد سجي ثوبا فذهبت أريد أن أكشف عنه فنهاني قومي، ثم ذهبت أكشف عنه فنهاني قومي، فأمر رسول الله صلى الله عليه وسلم فرفع فسمع صوت صائحة فقال ‏\"‏ من هذه ‏\"‏‏.‏ فقالوا ابنة عمرو أو أخت عمرو‏.‏ قال ‏\"‏ فلم تبكي أو لا تبكي فما زالت الملائكة تظله بأجنحتها حتى رفع ‏\"‏‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     On the day of the Battle of Uhud, my father was brought and he had been mutilated (in battle) and was placed in front of Allah's Apostle and a sheet was over him. I went intending to uncover my father but my people forbade me; again I wanted to uncover him but my people forbade me. Allah's Apostle gave his order and he was shifted away. At that time he heard the voice of a crying woman and asked, \"Who is this?\" They said, \"It is the daughter or the sister of `Amr.\" He said, \"Why does she weep? (or let her stop weeping), for the angels had been shading him with their wings till he (i.e. the body of the martyr) was shifted away.\"",
      "chain": [
        "30026",
        "20005",
        "11048",
        "34"
      ]
    },
    {
      "hadith_no": "1311",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا معاذ بن فضالة، حدثنا هشام، عن يحيى، عن عبيد الله بن مقسم، عن جابر بن عبد الله  رضى الله عنهما  قال مر بنا جنازة فقام لها النبي صلى الله عليه وسلم وقمنا به‏.‏ فقلنا يا رسول الله، إنها جنازة يهودي‏.‏ قال ‏\"‏ إذا رأيتم الجنازة فقوموا ‏\"‏‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     A funeral procession passed in front of us and the Prophet stood up and we too stood up. We said, 'O Allah's Apostle! This is the funeral procession of a Jew.\" He said, \"Whenever you see a funeral procession, you should stand up.\"",
      "chain": [
        "30177",
        "20295",
        "20031",
        "11521",
        "34"
      ]
    },
    {
      "hadith_no": "1317",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا مسدد، عن أبي عوانة، عن قتادة، عن عطاء، عن جابر بن عبد الله  رضى الله عنهما  أن رسول الله صلى الله عليه وسلم صلى على النجاشي، فكنت في الصف الثاني أو الثالث‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     Allah's Apostle offered the funeral prayer for An-Najashi and I was in the second or third row.",
      "chain": [
        "30175",
        "20469",
        "11019",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "1320",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا إبراهيم بن موسى، أخبرنا هشام بن يوسف، أن ابن جريج، أخبرهم قال أخبرني عطاء، أنه سمع جابر بن عبد الله  رضى الله عنهما  يقول قال النبي صلى الله عليه وسلم ‏\"‏ قد توفي اليوم رجل صالح من الحبش فهلم فصلوا عليه ‏\"‏‏.‏ قال فصففنا فصلى النبي صلى الله عليه وسلم عليه ونحن صفوف‏.‏ قال أبو الزبير عن جابر كنت في الصف الثاني‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     The Prophet said, \"Today a pious man from Ethiopia (i.e. An Najashi) has expired, come on to offer the funeral prayer.\" (Jabir said): We lined up in rows and after that the Prophet led the prayer and we were in rows. Jabir added, I was in the second row.\"",
      "chain": [
        "30309",
        "20467",
        "11070",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "1334",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن سنان، حدثنا سليم بن حيان، حدثنا سعيد بن ميناء، عن جابر  رضى الله عنه  أن النبي صلى الله عليه وسلم صلى على أصحمة النجاشي فكبر أربعا‏.‏ وقال يزيد بن هارون وعبد الصمد عن سليم أصحمة‏.‏ وتابعه عبد الصمد‏.‏",
      "text_en": " Narrated Jabir:                     The Prophet offered the funeral prayer of As-Hama An-Najash and said four Takbir.",
      "chain": [
        "34207",
        "20234",
        "11510",
        "34"
      ]
    },
    {
      "hadith_no": "1343",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا عبد الله بن يوسف، حدثنا الليث، قال حدثني ابن شهاب، عن عبد الرحمن بن كعب بن مالك، عن جابر بن عبد الله  رضى الله عنهما  قال كان النبي صلى الله عليه وسلم يجمع بين الرجلين من قتلى أحد في ثوب واحد ثم يقول ‏\"‏ أيهم أكثر أخذا للقرآن ‏\"‏‏.‏ فإذا أشير له إلى أحدهما قدمه في اللحد وقال ‏\"‏ أنا شهيد على هؤلاء يوم القيامة ‏\"‏‏.‏ وأمر بدفنهم في دمائهم، ولم يغسلوا ولم يصل عليهم‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     The Prophet collected every two martyrs of Uhud in one piece of cloth, then he would ask, \"Which of them had (knew) more of the Qur'an?\" When one of them was pointed out for him, he would put that one first in the grave and say, \"I will be a witness on these on the Day of Resurrection.\" He ordered them to be buried with their blood on their bodies and they were neither washed nor was a funeral prayer offered for them.",
      "chain": [
        "30355",
        "20023",
        "11013",
        "1134",
        "34"
      ]
    },
    {
      "hadith_no": "1345",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا سعيد بن سليمان، حدثنا الليث، حدثنا ابن شهاب، عن عبد الرحمن بن كعب، أن جابر بن عبد الله  رضى الله عنهما  أخبره أن النبي صلى الله عليه وسلم كان يجمع بين الرجلين من قتلى أحد‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     The Prophet buried every two martyrs in of Uhud in one grave.",
      "chain": [
        "30252",
        "20023",
        "11013",
        "1134",
        "34"
      ]
    },
    {
      "hadith_no": "1346",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا أبو الوليد، حدثنا ليث، عن ابن شهاب، عن عبد الرحمن بن كعب، عن جابر، قال قال النبي صلى الله عليه وسلم ‏\"‏ ادفنوهم في دمائهم ‏\"‏‏.‏  يعني يوم أحد  ولم يغسلهم‏.‏",
      "text_en": " Narrated Jabir:                     The Prophet said, \"Bury them (i.e. martyrs) with their blood.\" (that was) On the day of the Battle of Uhud. He did not get them washed.",
      "chain": [
        "20296",
        "20023",
        "11013",
        "1134",
        "34"
      ]
    },
    {
      "hadith_no": "1347",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا ابن مقاتل، أخبرنا عبد الله، أخبرنا ليث بن سعد، حدثني ابن شهاب، عن عبد الرحمن بن كعب بن مالك، عن جابر بن عبد الله  رضى الله عنهما  أن رسول الله صلى الله عليه وسلم كان يجمع بين الرجلين من قتلى أحد في ثوب واحد ثم يقول ‏\"‏ أيهم أكثر أخذا للقرآن ‏\"‏‏.‏ فإذا أشير له إلى أحدهما قدمه في اللحد وقال ‏\"‏ أنا شهيد على هؤلاء ‏\"‏‏.‏ وأمر بدفنهم بدمائهم، ولم يصل عليهم ولم يغسلهم‏.‏   وأخبرنا الأوزاعي، عن الزهري، عن جابر بن عبد الله  رضى الله عنهما  كان رسول الله صلى الله عليه وسلم يقول لقتلى أحد ‏\"‏ أى هؤلاء أكثر أخذا للقرآن ‏\"‏‏.‏ فإذا أشير له إلى رجل قدمه في اللحد قبل صاحبه‏.‏ وقال جابر فكفن أبي وعمي في نمرة واحدة‏.‏   وقال سليمان بن كثير حدثني الزهري، حدثنا من، سمع جابرا  رضى الله عنه‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     Allah's Apostle shrouded every two martyrs of Uhud in one piece of cloth and then he would ask, \"Which of them knew more Qur'an?\" When one of them was pointed out he would put him first in the grave. He said, \"I am a witness on these.\" Then he ordered them to be buried with blood on their bodies. Neither did he offer their funeral prayer nor did he get them washed. (Jabir bin `Abdullah added): Allah's Apostle used to ask about the martyrs of Uhud as to which of them knew more of the Qur'an.\" And when one of them was pointed out as having more of it he would put him first in the grave and then his companions. (Jabir added): My father and my uncle were shrouded in one sheet.",
      "chain": [
        "30118",
        "20025",
        "20023",
        "11013",
        "1134",
        "34"
      ]
    },
    {
      "hadith_no": "1350",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، قال عمرو سمعت جابر بن عبد الله  رضى الله عنهما  قال أتى رسول الله صلى الله عليه وسلم عبد الله بن أبى بعد ما أدخل حفرته فأمر به فأخرج، فوضعه على ركبتيه، ونفث عليه من ريقه، وألبسه قميصه، فالله أعلم، وكان كسا عباسا قميصا‏.‏ قال سفيان وقال أبو هارون وكان على رسول الله صلى الله عليه وسلم قميصان، فقال له ابن عبد الله يا رسول الله، ألبس أبي قميصك الذي يلي جلدك‏.‏ قال سفيان فيرون أن النبي صلى الله عليه وسلم ألبس عبد الله قميصه مكافأة لما صنع‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     Allah's Apostle came to `Abdullah bin Ubai (a hypocrite) after his death and he has been laid in his pit (grave). He ordered (that he be taken out of the grave) and he was taken out. Then he placed him on his knees and threw some of his saliva on him and clothed him in his (the Prophet's) own shirt. Allah knows better (why he did so). `Abdullah bin Ubai had given his shirt to Al-Abbas to wear. Abu Harun said, \"Allah's Apostle at that time had two shirts and the son of `Abdullah bin Ubai said to him, 'O Allah's Apostle! Clothe my father in your shirt which has been in contact with your skin.' ' Sufyan added, \"Thus people think that the Prophet clothed `Abdullah bin Tubal in his shirt in lieu of what he (Abdullah) had done (for Al `Abbas, the Prophet's uncle.)\"",
      "chain": [
        "30026",
        "20005",
        "11081",
        "34"
      ]
    },
    {
      "hadith_no": "1351",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا مسدد، أخبرنا بشر بن المفضل، حدثنا حسين المعلم، عن عطاء، عن جابر  رضى الله عنه  قال لما حضر أحد دعاني أبي من الليل فقال ما أراني إلا مقتولا في أول من يقتل من أصحاب النبي صلى الله عليه وسلم، وإني لا أترك بعدي أعز على منك، غير نفس رسول الله صلى الله عليه وسلم، فإن على دينا فاقض، واستوص بأخواتك خيرا‏.‏ فأصبحنا فكان أول قتيل، ودفن معه آخر في قبر، ثم لم تطب نفسي أن أتركه مع الآخر فاستخرجته بعد ستة أشهر، فإذا هو كيوم وضعته هنية غير أذنه‏.‏",
      "text_en": " Narrated Jabir:                     When the time of the Battle of Uhud approached, my father called me at night and said, \"I think that I will be the first amongst the companions of the Prophet to be martyred. I do not leave anyone after me dearer to me than you, except Allah's Apostle's soul and I owe some debt and you should repay it and treat your sisters favorably (nicely and politely).\" So in the morning he was the first to be martyred and was buried along with another (martyr). I did not like to leave him with the other (martyr) so I took him out of the grave after six months of his burial and he was in the same condition as he was on the day of burial, except a slight change near his ear.",
      "chain": [
        "30175",
        "20212",
        "11278",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "1352",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سعيد بن عامر، عن شعبة، عن ابن أبي نجيح، عن عطاء، عن جابر  رضى الله عنه  قال دفن مع أبي رجل فلم تطب نفسي حتى أخرجته فجعلته في قبر على حدة‏.‏",
      "text_en": " Narrated Jabir:                     A man was buried along with my father and I did not like it till I took him (i.e. my father) out and buried him in a separate grave.",
      "chain": [
        "30026",
        "20232",
        "20020",
        "11254",
        "11029",
        "34"
      ]
    }
  ],
  "total_hadiths": 1626
}