{
  "id": "34008",
  "name": "Ahmed bin Abi 'Ubaid أحمد بن أبي عبيد الله",
  "full_name": "Ahmed bin Abi 'Ubaid أحمد بن أبي عبيد الله",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "240",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ت  س  -  ثقة ]"
    ],
    "tags": [
      "Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20304",
      "name": "Yazid bin Zari' يزيد بن زريع",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20233",
      "name": "Salm bin Qutayba, Abu Qutayba سلم بن قتيبة الشعيري - أبو قتيبة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20355",
      "name": "Muhammad bin 'Abdullah bin al-Zubair محمد بن عبد الله أبو أحمد الزبيري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30005",
      "name": "Imam Tirmidhi الترمذي محمد بن عيسى بن سورة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30006",
      "name": "Imam Nasa'i أحمد بن شعيب بن علي بن سنان النسائي",
      "grade": "3rd Century AH [12th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "jami-al-tirmidhi-50",
      "hadith_no": "50",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا نصر بن علي الجهضمي، وأحمد بن أبي عبيد الله السليمي البصري، قالا حدثنا أبو قتيبة، سلم بن قتيبة عن الحسن بن علي الهاشمي، عن عبد الرحمن الأعرج، عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏\"‏ جاءني جبريل فقال يا محمد إذا توضأت فانتضح ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏ قال وسمعت محمدا يقول الحسن بن علي الهاشمي منكر الحديث ‏.‏ قال وفي الباب عن أبي الحكم بن سفيان وابن عباس وزيد بن حارثة وأبي سعيد الخدري ‏.‏ وقال بعضهم سفيان بن الحكم أو الحكم بن سفيان واضطربوا في هذا الحديث ‏.‏",
      "text_en": " Abu Hurairah narrated that :                     the Prophet said: \"Jibril came to me and he said: 'O Muhammad! When you perform wudu then perform Nadh.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30395",
        "34008",
        "20233",
        "30",
        "11197",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2449",
      "hadith_no": "2449",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Dreams - كتاب الرؤيا عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "34",
      "text_ar": "حدثنا أحمد بن أبي عبيد الله السليمي البصري، حدثنا يزيد بن زريع، حدثنا سعيد، عن قتادة، عن محمد بن سيرين، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الرؤيا ثلاث فرؤيا حق ورؤيا يحدث بها الرجل نفسه ورؤيا تحزين من الشيطان فمن رأى ما يكره فليقم فليصل ‏\"‏ ‏.‏ وكان يقول ‏\"‏ يعجبني القيد وأكره الغل القيد ثبات في الدين ‏\"‏ ‏.‏ وكان يقول ‏\"‏ من رآني فإني أنا هو فإنه ليس للشيطان أن يتمثل بي ‏\"‏ ‏.‏ وكان يقول ‏\"‏ لا تقص الرؤيا إلا على عالم أو ناصح ‏\"‏ ‏.‏ وفي الباب عن أنس وأبي بكرة وأم العلاء وابن عمر وعائشة وأبي موسى وجابر وأبي سعيد وابن عباس وعبد الله بن عمرو ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Abu Hurarirah narrated that the Messenger of Allah (s.a.w)  said:                     \"Dreams are of three types: The true dream, dreams about something that has happened to the man himself, and dreams in which the Shaitan frightens someone. So whoever sees what he dislikes, then he should get up and perform Salah.\" And he would say: \"I like fetters and I dislike the iron collar.\" And he would say: \" Whoever has seen me (in a dream) then it is I , for indeed Shaitan is not able to resemble me.\" And he would say: \"The dream is not to be narrated except to a knowledgeable person or a sincere advisor.\"",
      "usc_msa_ref": "",
      "chain": [
        "34008",
        "20304",
        "11168",
        "11019",
        "11035",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3442-2",
      "hadith_no": "3442",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا أحمد بن أبي عبيد الله السليمي البصري، حدثنا أبو قتيبة، سلم بن قتيبة عن إبراهيم بن عبد الرحمن بن يزيد بن أمية، عن نافع، عن ابن عمر، قال كان رسول الله صلى الله عليه وسلم إذا ودع رجلا أخذ بيده فلا يدعها حتى يكون الرجل هو يدع يد النبي صلى الله عليه وسلم ويقول ‏\"‏ أستودع الله دينك وأمانتك وآخر عملك ‏\"‏ ‏.‏ قال هذا حديث غريب من هذا الوجه ‏.‏ وروي هذا الحديث من غير وجه عن ابن عمر ‏.‏",
      "text_en": " Ibn Umar narrated, saying:                     “When the Prophet would bid farewell to a man, he would take his hand, and not let it go until the man let go of the hand, of the Prophet, and he would say: ‘I entrust to Allah your religion, your trusts, and the last of your deeds (Astawdi’ullaha Dinaka Wa Amanataka Wa Akhira Amalik).’”",
      "usc_msa_ref": "",
      "chain": [
        "34008",
        "20233",
        "22006",
        "11014",
        "18"
      ]
    }
  ],
  "total_hadiths": 3
}