{
  "id": "34033",
  "name": "Isma'il bin Mas'ud al-Jhdry إسماعيل بن مسعود الجحدري",
  "full_name": "Isma'il bin Mas'ud al-Jhdry إسماعيل بن مسعود الجحدري",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "248",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ س  -  ثقة ]"
    ],
    "tags": [
      "Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20226",
      "name": "Khalid bin al-Harith bin 'Ubaid خالد بن الحارث بن عبيد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20288",
      "name": "Ma'tmar bin Sulaiman-al-Taufayl معتمر بن سليمان - الطفيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20304",
      "name": "Yazid bin Zari' يزيد بن زريع",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "students": [
    {
      "id": "30006",
      "name": "Imam Nasa'i أحمد بن شعيب بن علي بن سنان النسائي",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sunan-an-nasai-47",
      "hadith_no": "47",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، قال أنبأنا هشام، عن يحيى، عن عبد الله بن أبي قتادة، عن أبي قتادة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا شرب أحدكم فلا يتنفس في إنائه وإذا أتى الخلاء فلا يمس ذكره بيمينه ولا يتمسح بيمينه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Qatadah that the Messenger of Allah (ﷺ) said:                      \"When any one of you drinks, let him not breathe into the vessel, and when he goes to the toilet let him not touch his penis with his right hand, nor wipe himself with this right hand.\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "20295",
        "11449",
        "11804",
        "391"
      ]
    },
    {
      "id": "sunan-an-nasai-135",
      "hadith_no": "135",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد بن الحارث، عن شعبة، عن منصور، عن مجاهد، عن الحكم، عن أبيه، أن رسول الله صلى الله عليه وسلم كان إذا توضأ أخذ حفنة من ماء فقال بها هكذا - ووصف شعبة - نضح به فرجه فذكرته لإبراهيم فأعجبه قال الشيخ ابن السني قال أبو عبد الرحمن الحكم هو ابن سفيان الثقفي رضى الله عنه ‏.‏",
      "text_en": " It was narrated from Al-Hakam, from his father, that when the Messenger of Allah (ﷺ) performed Wudu', he would take a handful of water and do this with it. Shu'bah described it:                      \"He would sprinkle his private parts with it.\" [1]Shaikh Ibn As-Sunni said: \"Al-Hakam (one of the narrators) is Ibn Sufyan Ath-Thaqafi.[1] The purpose is to ward off devilish whispers lest the person think any emission has taken place, and thus think that his Wudu' has been invalidated.",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20226",
        "20020",
        "11067",
        "11028",
        "11069"
      ]
    },
    {
      "id": "sunan-an-nasai-160",
      "hadith_no": "160",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا عمرو بن علي، وإسماعيل بن مسعود، قالا حدثنا يزيد بن زريع، قال حدثنا شعبة، عن عاصم، عن زر، قال قال صفوان بن عسال كنا إذا كنا مع رسول الله صلى الله عليه وسلم في سفر أمرنا أن لا ننزعه ثلاثا إلا من جنابة ولكن من غائط وبول ونوم ‏.‏",
      "text_en": " Safwan bin 'Assal said:                      \"When we were with the Messenger of Allah (ﷺ) on a journey, he told us not to take them off for three days except in the case of Janabah, but not in the case of defecation, urinating or sleep.\"",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "34033",
        "20304",
        "20020",
        "11080",
        "11337"
      ]
    },
    {
      "id": "sunan-an-nasai-162",
      "hadith_no": "162",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا إسماعيل بن مسعود، وحميد بن مسعدة، قالا حدثنا يزيد بن زريع، قال حدثنا معمر، عن الزهري، عن أبي سلمة، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا استيقظ أحدكم من منامه فلا يدخل يده في الإناء حتى يفرغ عليها ثلاث مرات فإنه لا يدري أين باتت يده ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:                      \"When any one of you wakes from sleep, let him not put his hand into the vessel until he has washed it three times, because he does not know where his hand spent the night.\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "30430",
        "20304",
        "20115",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-285",
      "hadith_no": "285",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، قال حدثنا هشام، ح وأنبأنا عبيد الله بن سعيد، وإسحاق بن إبراهيم، قالا حدثنا معاذ بن هشام، - واللفظ له - قال حدثني أبي، عن يحيى، قال حدثنا أبو سلمة، أن زينب بنت أبي سلمة، حدثته أن أم سلمة حدثتها قالت، بينما أنا مضطجعة، مع رسول الله صلى الله عليه وسلم في الخميلة إذ حضت فانسللت فأخذت ثياب حيضتي فقال رسول الله صلى الله عليه وسلم ‏\"‏ أنفست ‏\"‏ ‏.‏ قلت نعم فدعاني فاضطجعت معه في الخميلة ‏.‏",
      "text_en": " Umm Salamah narrated:                      \"While I was lying down with the Messenger of Allah (ﷺ) under a blanket, my period came, so I slipped away and put on the clothes I used to wear when I was menstruating. The Messenger of Allah (ﷺ) said: 'Are you menstruating?' I said: 'Yes.' Then he called me and I lied down with him under the blanket.\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "20295",
        "30359",
        "30123",
        "20287",
        "20295",
        "11449",
        "10567",
        "244",
        "56"
      ]
    },
    {
      "id": "sunan-an-nasai-320",
      "hadith_no": "320",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا إسماعيل بن مسعود، أنبأنا خالد، أنبأنا شعبة، عن الحكم، سمعت ذرا، يحدث عن ابن أبزى، عن أبيه، قال وقد سمعه الحكم، من ابن عبد الرحمن قال أجنب رجل فأتى عمر - رضى الله عنه - فقال إني أجنبت فلم أجد ماء ‏.‏ قال لا تصل ‏.‏ قال له عمار أما تذكر أنا كنا في سرية فأجنبنا فلم نجد ماء فأما أنت فلم تصل وأما أنا فإني تمعكت فصليت ثم أتيت النبي صلى الله عليه وسلم فذكرت ذلك له فقال ‏\"‏ إنما كان يكفيك ‏\"‏ ‏.‏ وضرب شعبة بكفيه ضربة ونفخ فيهما ثم دلك إحداهما بالأخرى ثم مسح بهما وجهه ‏.‏ فقال عمر شيئا لا أدري ما هو ‏.‏ فقال إن شئت لا حدثته ‏.‏ وذكر شيئا في هذا الإسناد عن أبي مالك وزاد سلمة قال بل نوليك من ذلك ما توليت ‏.‏",
      "text_en": " It was narrated that Ibn 'Abdur-Rahman said:                      \"A man became Junub and came to 'Umar, may Allah be pleased with him, and said: 'I have become Junub and I cannot find any water.' He said: 'Do not pray.' 'Ammar said to him: 'Do you not remember when we were on a campaign and became Junub. You did not prayed, then I came to the Prophet (ﷺ) and told him that, and he said: 'This would have been sufficient for you.'\" - (One of the narrators) Shu'bah struck his hands once and blew into them, then he rubbed them together, then wiped his face with them - ('Ammar said): \"'Umar said something I did not understand.\" So he said: \"If you wish, I shall not narrate it.\" Salamah mentioned something in this chain from Abu Malik, and Salamah added that he said: \"Rather, we will let you bear the burden of what you tool upon yourself.\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "20020",
        "11069",
        "11423"
      ]
    },
    {
      "id": "sunan-an-nasai-371",
      "hadith_no": "371",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Menstruation and Istihadah - كتاب الحيض والاستحاضة",
      "chapter_no": "3",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا معاذ بن هشام، ح وأنبأنا إسحاق بن إبراهيم، قال أنبأنا معاذ بن هشام، قال حدثني أبي ح، وأنبأنا إسماعيل بن مسعود، قال حدثنا خالد، - وهو ابن الحارث - قال حدثنا هشام، عن يحيى بن أبي كثير، قال حدثني أبو سلمة، أن زينب بنت أبي سلمة، حدثته أن أم سلمة حدثتها قالت، بينما أنا مضطجعة، مع رسول الله صلى الله عليه وسلم إذ حضت فانسللت فأخذت ثياب حيضتي فقال رسول الله صلى الله عليه وسلم ‏\"‏ أنفست ‏\"‏ ‏.‏ قلت نعم فدعاني فاضطجعت معه في الخميلة ‏.‏ واللفظ لعبيد الله بن سعيد ‏.‏",
      "text_en": " Umm Salamah narrated:                      \"While I was lying down with the Messenger of Allah (ﷺ) under a blanket, my period came so I slipped away and put on the clothes I used to wear when I was menstruating. The Messenger of Allah (ﷺ) said: 'Are you menstruating?' I said: 'Yes.' Then he called me to lie down with him under the blanket.\" This is the wording of 'Ubaidullah bin Sa'eed.[1][1] That is, one of the narrators in one of the chains, as the author reported it throughdifferent chains, as he did when it preceded, see No. 284.",
      "usc_msa_ref": "",
      "chain": [
        "30359",
        "20287",
        "30123",
        "20287",
        "20295",
        "34033",
        "20226",
        "11065",
        "11449",
        "10567",
        "244"
      ]
    },
    {
      "id": "sunan-an-nasai-557",
      "hadith_no": "557",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا إسماعيل بن مسعود، ومحمد بن عبد الأعلى، قالا حدثنا خالد، عن شعبة، عن أبي صدقة، عن أنس بن مالك، قال كان رسول الله صلى الله عليه وسلم يصلي الظهر إذا زالت الشمس ويصلي العصر بين صلاتيكم هاتين ويصلي المغرب إذا غربت الشمس ويصلي العشاء إذا غاب الشفق - ثم قال على إثره - ويصلي الصبح إلى أن ينفسح البصر ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                      \"The Messenger of Allah (ﷺ) used to pray Zuhr when the sun passed its zenith, and he would pray 'Asr between these two prayers; and he would pray Maghrib when the sun had set, and he used to pray 'Isha' when the twilight had disappeared,\" then he said straight after that: \"And he would pray Fajr when a man could see clearly.\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "30449",
        "20423",
        "20020",
        "19"
      ]
    },
    {
      "id": "sunan-an-nasai-569",
      "hadith_no": "569",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا إسماعيل بن مسعود، أنبأنا خالد، حدثنا عبيد الله، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم نهى أن يصلى مع طلوع الشمس أو غروبها ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that the Messenger of Allah (ﷺ) forbade praying when the sun is rising or setting.",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-583",
      "hadith_no": "583",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا إسماعيل بن مسعود، عن خالد بن الحارث، عن شعبة، عن أبي إسحاق، قال سمعت مسروقا، والأسود، قالا نشهد على عائشة أنها قالت كان رسول الله صلى الله عليه وسلم إذا كان عندي بعد العصر صلاهما ‏.‏",
      "text_en": " It was narrated that Abu Ishaq said:                      \"I heard Masruq and Al-Aswad say: We bear witness that 'Aishah said: 'When the Messenger of Allah (ﷺ) was with me after 'Asr, he would pray them (these two Rak'ahs).'\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20226",
        "20020",
        "11049",
        "11018",
        "11054"
      ]
    },
    {
      "id": "sunan-an-nasai-652",
      "hadith_no": "652",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Adhan (The Call to Prayer) - كتاب الأذان",
      "chapter_no": "7",
      "text_ar": "أخبرنا إسماعيل بن مسعود، ومحمد بن عبد الأعلى، قالا حدثنا يزيد، - يعني ابن زريع - قال حدثنا شعبة، عن موسى بن أبي عثمان، عن أبي يحيى، عن أبي هريرة، سمعه من، فم رسول الله صلى الله عليه وسلم يقول ‏\"‏ المؤذن يغفر له بمد صوته ويشهد له كل رطب ويابس ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah, who heard it from the mouth of the Messenger of Allah (ﷺ):                      \"The Mu'adhdhin will be forgiven as far as his voice reaches, and every wet and dry thing will bear witness for him.\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "30449",
        "20304",
        "20020",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-738",
      "hadith_no": "738",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Masjids - كتاب المساجد",
      "chapter_no": "8",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، عن شعبة، عن سليمان، - يعني الشيباني - عن عبد الله بن شداد، عن ميمونة، أن رسول الله صلى الله عليه وسلم كان يصلي على الخمرة ‏.‏",
      "text_en": " It was narrated from Maimunah that the Messenger of Allah (ﷺ) used to pray on a mat.",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "20020",
        "11352",
        "169",
        "61"
      ]
    },
    {
      "id": "sunan-an-nasai-755",
      "hadith_no": "755",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Qiblah - كتاب القبلة",
      "chapter_no": "9",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، قال حدثنا شعبة، عن منصور، عن إبراهيم، عن الأسود، عن عائشة، - رضى الله عنها - قالت كنت بين يدى رسول الله صلى الله عليه وسلم وهو يصلي فإذا أردت أن أقوم كرهت أن أقوم - فأمر بين يديه - انسللت انسلالا ‏.‏",
      "text_en": " It was narrated that Aishah, may Allah be pleased with her, said:                      \"I was in front of the Messenger of Allah (ﷺ) when he was praying, and when I wanted to leave I did not want to get up and pass in front of him, so I just slipped away slowly and quietly.\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "20020",
        "11067",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-818",
      "hadith_no": "818",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا إسماعيل بن مسعود، عن خالد، قال حدثنا سعيد، عن قتادة، عن أنس، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أتموا الصف الأول ثم الذي يليه وإن كان نقص فليكن في الصف المؤخر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Anas that the Messenger of Allah (ﷺ) said:                      \"Complete the first row, then the one behind it, and if any row is to be leftincomplete let it be the last row.\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "11168",
        "11019",
        "19"
      ]
    },
    {
      "id": "sunan-an-nasai-826",
      "hadith_no": "826",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد بن الحارث، عن ابن أبي ذئب، قال أخبرني الحارث بن عبد الرحمن، عن سالم بن عبد الله، عن عبد الله بن عمر، قال كان رسول الله صلى الله عليه وسلم يأمر بالتخفيف ويؤمنا بالصافات ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin 'Umar said:                      \"The Messenger of Allah (ﷺ) used to enjoin upon us to make the prayer short, but he would lead us in prayer and recite As-Saffat.\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20226",
        "20177",
        "19903",
        "11011",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-843",
      "hadith_no": "843",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد بن الحارث، عن شعبة، عن أبي إسحاق، أنه أخبرهم عن عبد الله بن أبي بصير، عن أبيه، - قال شعبة وقال أبو إسحاق وقد سمعته منه، ومن أبيه - قال سمعت أبى بن كعب، يقول صلى رسول الله صلى الله عليه وسلم يوما صلاة الصبح فقال ‏\"‏ أشهد فلان الصلاة ‏\"‏ ‏.‏ قالوا لا ‏.‏ قال ‏\"‏ ففلان ‏\"‏ ‏.‏ قالوا لا ‏.‏ قال ‏\"‏ إن هاتين الصلاتين من أثقل الصلاة على المنافقين ولو يعلمون ما فيهما لأتوهما ولو حبوا والصف الأول على مثل صف الملائكة ولو تعلمون فضيلته لابتدرتموه وصلاة الرجل مع الرجل أزكى من صلاته وحده وصلاة الرجل مع الرجلين أزكى من صلاته مع الرجل وما كانوا أكثر فهو أحب إلى الله عز وجل ‏\"‏ ‏.‏",
      "text_en": " Ubay bin Ka'b said:                      \"One day the Messenger of Allah (ﷺ) prayed Fajr, then he said: 'Did so-and-so attend the prayer? They said: 'No.' He said: '(What about) so-and-so? They said:'No' He said: 'These two prayers. are the most burdensome for the hypocrites. If they knew what (virtue) there is in them, they would come, even if they had to crawl. And the virtue of the first row is like thatof the row of the angels. If you knew its virtue, you would compete for it. A man's prayer with another man is greater in reward than his prayer alone. And a man's prayer with two other men is greater in reward thanhis prayer with one other man; the more people there are, the more beloved that is to Allah, the Mighty and Sublime.\"'",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20226",
        "20020",
        "11049",
        "20020",
        "39"
      ]
    },
    {
      "id": "sunan-an-nasai-874",
      "hadith_no": "874",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا يزيد بن زريع، قال حدثنا شعبة، عن أبي إسحاق، عن عاصم بن ضمرة، قال سألنا عليا عن صلاة، رسول الله صلى الله عليه وسلم قال أيكم يطيق ذلك قلنا إن لم نطقه سمعنا ‏.‏ قال كان إذا كانت الشمس من ها هنا كهيئتها من ها هنا عند العصر صلى ركعتين فإذا كانت من ها هنا كهيئتها من ها هنا عند الظهر صلى أربعا ويصلي قبل الظهر أربعا وبعدها ثنتين ويصلي قبل العصر أربعا يفصل بين كل ركعتين بتسليم على الملائكة المقربين والنبيين ومن تبعهم من المؤمنين والمسلمين ‏.‏",
      "text_en": " It was narrated from Abu Ishaq, that 'Asim bin Damrah said:                      \"We asked 'Ali about the prayer of the Messenger of Allah (ﷺ). He said: 'Who among you could manage to do that?' We said: 'Even if we cannot do it, we still want to hear about it.' He said: 'When the sun reached the same height (in the east) as it reaches (in the west) at thetime of 'Asr, he would pray two rak'ahs, and when the sun reached the same height (in theeast) as it reaches (in the west) at thetime for Zuhr he would pray four Rak'ahs. He would pray four Rak'ahs before Zuhr and two after, and he would pray four Rak'ahs before 'Asr, separating each two Rak'ahs with Taslim upon the angels who are close to Allah, and the prophets, and those who follow them of the believers and Muslims.\"'",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20304",
        "20020",
        "11049",
        "19871",
        "5"
      ]
    },
    {
      "id": "sunan-an-nasai-893",
      "hadith_no": "893",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، عن شعبة، قال أخبرني ميسرة بن حبيب، قال سمعت المنهال بن عمرو، يحدث عن أبي عبيدة، عن عبد الله، أنه رأى رجلا يصلي قد صف بين قدميه فقال أخطأ السنة ولو راوح بينهما كان أعجب إلى ‏.‏",
      "text_en": " It was narrated from Abdullah that:                     He saw a man praying with his feet together. He said: \"He is not following the Sunnah. If he were to shift his weight from one to the other I would like that better.\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "20020",
        "25322",
        "11656",
        "10",
        "16"
      ]
    },
    {
      "id": "sunan-an-nasai-908",
      "hadith_no": "908",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، قال حدثنا عثمان بن غياث، قال أخبرني أبو نعامة الحنفي، قال حدثنا ابن عبد الله بن مغفل، قال كان عبد الله بن مغفل إذا سمع أحدنا، يقرأ ‏{‏ بسم الله الرحمن الرحيم ‏}‏ يقول صليت خلف رسول الله صلى الله عليه وسلم وخلف أبي بكر وخلف عمر رضى الله عنهما فما سمعت أحدا منهم قرأ بسم الله الرحمن الرحيم ‏.‏",
      "text_en": " Ibn Abdullah bin Mughaffal said:                     \"If Abdullah bin Mughaffal heard any one of us recite: 'In the Name of Allah, the Most Gracious, the Most Merciful', he would say: 'I prayed behind the Messenger of Allah (ﷺ) and behind Abu Bakr and behind Umar-may Allah be pleased with them both- and I did not hear any of them recite: 'In the Name of Allah, the Most Gracious, the Most Merciful.\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "11600"
      ]
    },
    {
      "id": "sunan-an-nasai-913",
      "hadith_no": "913",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، قال حدثنا شعبة، عن خبيب بن عبد الرحمن، قال سمعت حفص بن عاصم، يحدث عن أبي سعيد بن المعلى، أن النبي صلى الله عليه وسلم مر به وهو يصلي فدعاه - قال - فصليت ثم أتيته فقال ‏\"‏ ما منعك أن تجيبني ‏\"‏ قال كنت أصلي ‏.‏ قال ‏\"‏ ألم يقل الله عز وجل ‏{‏ يا أيها الذين آمنوا استجيبوا لله وللرسول إذا دعاكم لما يحييكم ‏}‏ ألا أعلمك أعظم سورة قبل أن أخرج من المسجد ‏\"‏ ‏.‏ قال فذهب ليخرج قلت يا رسول الله قولك ‏.‏ قال ‏\"‏ الحمد لله رب العالمين هي السبع المثاني الذي أوتيت والقرآن العظيم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Sa'eed bin Al-Mu'alla that:                     The Prophet (ﷺ) passed by him when he was praying, and called him. He said: \"I finished praying, then I came to him, and he said: 'What kept you from answering me?' He said: 'I was praying.' He said: 'Does not Allah say: O you who believe! Answer Allah (by obeying Him) and (His) Messenger when he calls you to that which will give you life? Shall I not teach you the greatest surah before I leave the masjid?' Then he went to leave, and I said: 'O Messenger of Allah, what about what you said?' He said: \"All praise and thanks be to Allah, Lord of all that exists. These are the seven oft-recited that I have been given, and the Grand Quran.'\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "20020",
        "11159",
        "11420"
      ]
    },
    {
      "id": "sunan-an-nasai-927",
      "hadith_no": "927",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا يزيد بن زريع، قال حدثني معمر، عن الزهري، عن سعيد بن المسيب، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم إذا ‏\"‏ قال الإمام ‏{‏ غير المغضوب عليهم ولا الضالين ‏}‏ فقولوا آمين فإن الملائكة تقول آمين وإن الإمام يقول آمين فمن وافق تأمينه تأمين الملائكة غفر له ما تقدم من ذنبه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah (ﷺ) said: 'When the Imam says: Not (the way) of those who earned Your anger, nor of those who went astray, say: 'Amin' for the angels say Amin and the Imam says Amin, and if a person's Amin coincides with the Amin of the angels, his previous sins will be forgiven.'\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20304",
        "20115",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-950",
      "hadith_no": "950",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا إسماعيل بن مسعود، ومحمد بن عبد الأعلى، - واللفظ له - قال حدثنا خالد، عن شعبة، عن زياد بن علاقة، قال سمعت عمي، يقول صليت مع رسول الله صلى الله عليه وسلم الصبح فقرأ في إحدى الركعتين ‏{‏ والنخل باسقات لها طلع نضيد ‏}‏ قال شعبة فلقيته في السوق في الزحام فقال ‏{‏ ق ‏}‏ ‏.‏",
      "text_en": " It was narrated that Ziyad bin Ilaqah said:                     \"I heard my paternal uncle say: 'I prayed Subh with the Messenger of Allah (ﷺ), and in one of the rak'ahs he recited: \"And tall date palms, with ranged clusters.\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "20020",
        "11339"
      ]
    },
    {
      "id": "sunan-an-nasai-959",
      "hadith_no": "959",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، قال حدثنا شعبة، عن أبي إسحاق، عن الأسود، عن عبد الله، أن رسول الله صلى الله عليه وسلم قرأ النجم فسجد فيها ‏.‏",
      "text_en": " It was narrated from Abdullah that:                     The Messenger of Allah (ﷺ) recited An-Najm and prostrated during it.",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "20020",
        "11049",
        "11054",
        "16"
      ]
    },
    {
      "id": "sunan-an-nasai-1001",
      "hadith_no": "1001",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا يزيد بن زريع، قال حدثنا شعبة، عن عدي بن ثابت، عن البراء بن عازب، قال كان رسول الله صلى الله عليه وسلم في سفر فقرأ في العشاء في الركعة الأولى بالتين والزيتون ‏.‏",
      "text_en": " It was narrated that Al-Bara' bin Azib said:                     \"The Messenger of Allah (ﷺ) was on a journey and he recited: 'By the fig and the olive' in the first rak'ah of isha'. \"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20304",
        "20020",
        "11372",
        "400"
      ]
    },
    {
      "id": "sunan-an-nasai-1005",
      "hadith_no": "1005",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، قال حدثنا شعبة، عن عمرو بن مرة، قال سمعت أبا وائل، يقول قال رجل عند عبد الله قرأت المفصل في ركعة ‏.‏ قال هذا كهذ الشعر لقد عرفت النظائر التي كان رسول الله صلى الله عليه وسلم يقرن بينهن ‏.‏ فذكر عشرين سورة من المفصل سورتين سورتين في ركعة ‏.‏",
      "text_en": " It was narrated that 'Amr bin Murrah said:                     \"I heard Abu Wa'il say: \"A man said in the presence of Abdullah: 'I recited Al-Mufassal in one rak'ah.' He said: 'That is like reciting poetry. I know the similar surahs that the Messenger of Allah (ﷺ) used to recite together.' And he mentioned twenty surahs from Al-Mufassal, two by two in each rak'ah.\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "20020",
        "11381",
        "11353"
      ]
    },
    {
      "id": "sunan-an-nasai-1029",
      "hadith_no": "1029",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد بن الحارث، عن شعبة، عن سليمان، قال سمعت إبراهيم، يحدث عن علقمة، والأسود، أنهما كانا مع عبد الله في بيته فقال أصلى هؤلاء قلنا نعم ‏.‏ فأمهما وقام بينهما بغير أذان ولا إقامة ‏.‏ قال إذا كنتم ثلاثة فاصنعوا هكذا وإذا كنتم أكثر من ذلك فليؤمكم أحدكم وليفرش كفيه على فخذيه فكأنما أنظر إلى اختلاف أصابع رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated from 'Alqamah and Al-Aswad that:                     They were with 'Abdullah in his house and he said: \"Have these people prayed?\" We said: \"Yes.\" So he led them in prayer and stood between them, with no Adhan and no Iqamah, and said: \"If you are three then do this, and if you are more than that then let one of you lead the others in prayer, and let him lay his hands on his thighs. It is as if I can see the fingers of the Messenger of Allah (ﷺ), interlaced.'\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20226",
        "20020",
        "11060",
        "11051",
        "11017"
      ]
    },
    {
      "id": "sunan-an-nasai-1047",
      "hadith_no": "1047",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، ويزيد، قالا حدثنا شعبة، عن منصور، عن أبي الضحى، عن مسروق، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يكثر أن يقول في ركوعه وسجوده ‏\"‏ سبحانك ربنا وبحمدك اللهم اغفر لي ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"The Messenger of Allah (ﷺ) often used to say when bowing and prostrating: 'Subhanaka Rabbana wa bi Hamdika, Allahumm aghfirli (Glorfy and praise be to You, our Lord. O Allah, forgive me.).'\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "20472",
        "20020",
        "11067",
        "11392",
        "11018",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-1056",
      "hadith_no": "1056",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا يزيد، - وهو ابن زريع - قال حدثنا سعيد، عن قتادة، عن نصر بن عاصم، أنه حدثهم عن مالك بن الحويرث، أنه رأى رسول الله صلى الله عليه وسلم يرفع يديه إذا ركع وإذا رفع رأسه من الركوع حتى يحاذي بهما فروع أذنيه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Malik bin Al-Huwairith that:                     He saw the Prophet (ﷺ) raise his hands when he bowed, and when he raised his head from bowing, until they were in level with the highest part of his ears.",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20304",
        "11168",
        "11019",
        "10724",
        "5265"
      ]
    },
    {
      "id": "sunan-an-nasai-1064",
      "hadith_no": "1064",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، قال حدثنا سعيد، عن قتادة، عن يونس بن جبير، عن حطان بن عبد الله، أنه حدثه أنه، سمع أبا موسى، قال إن نبي الله صلى الله عليه وسلم خطبنا وبين لنا سنتنا وعلمنا صلاتنا فقال ‏\"‏ إذا صليتم فأقيموا صفوفكم ثم ليؤمكم أحدكم فإذا كبر الإمام فكبروا وإذا قرأ ‏{‏ غير المغضوب عليهم ولا الضالين ‏}‏ فقولوا آمين يجبكم الله وإذا كبر وركع فكبروا واركعوا فإن الإمام يركع قبلكم ويرفع قبلكم ‏\"‏ ‏.‏ قال نبي الله صلى الله عليه وسلم ‏\"‏ فتلك بتلك وإذا قال سمع الله لمن حمده فقولوا اللهم ربنا ولك الحمد يسمع الله لكم فإن الله قال على لسان نبيه صلى الله عليه وسلم سمع الله لمن حمده فإذا كبر وسجد فكبرو واسجدوا فإن الإمام يسجد قبلكم ويرفع قبلكم قال نبي الله صلى الله عليه وسلم ‏\"‏ فتلك بتلك فإذا كان عند القعدة فليكن من أول قول أحدكم التحيات الطيبات الصلوات لله سلام عليك أيها النبي ورحمة الله وبركاته سلام علينا وعلى عباد الله الصالحين أشهد أن لا إله إلا الله وأشهد أن محمدا عبده ورسوله سبع كلمات وهي تحية الصلاة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Hittan bin 'Abdullah that:                     He heard Abu Musa say: \"The Prophet of Allah (ﷺ) addressed us and taught us our Sunnah and our prayer. He said: 'When you pray, make your rows straight and let one of you lead you in prayer. When the Imam says the takbir, then say the takbir. When he recites 'Not (the way) of those who earned Your anger, nor those who went astray' then say: \"Amin\" and Allah will answer you. When he says the takbir and bows, then say the takbir and bow. The Imam bows before you do and stands up before you do.' The Prophet of Allah (ﷺ) said: 'This makes up for that. And when he says: \"'Sami Allahu liman hamidah (Allah hears the one who praises Him),' then say: \"Allahumma Rabbana wa lakal-hamd (O Allah, our Lord, and to You be the praise), \" Allah will hear you, for Allah has said on the lips of His Prophet (ﷺ): \"Allah hears the one who praises Him.\" And when he (the Imam) says the takbir and prostrates, then say the takbir and prostrate. The Imam prostrates before you do and sits up before you do.' The Prophet of Allah (ﷺ) said: 'This makes up for that. And when he is sitting, let the first thing that any one of you says be: At-tahiyaatut-tayyibatus-salawatuLillah, salamun 'alayka ayyuhanabiyyu wa rahmatullahi wa barakatuhu, salamun 'alayna wa 'ala 'ibadillahis-salihin, ashhadu an la ilaha ill-Allah wa ashhadu anna Muhammadan 'abduhu wa rasuluh (All compliments, good words and prayers are due to Allah, peace be upon you O Prophet, and the mercy of Allah and His blessings. Peace be upon us and upon the righteous slaves of Allah. I bear witness that there is none worthy of worship except Allah and I bear witness that Muhammad is His slave and Messenger)- seven phrases which are the greeting of the prayer.'\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "11168",
        "11019",
        "11320",
        "30170"
      ]
    },
    {
      "id": "sunan-an-nasai-1072",
      "hadith_no": "1072",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا بشر بن المفضل، عن يونس، عن ابن سيرين، قال حدثني بعض، من صلى مع رسول الله صلى الله عليه وسلم صلاة الصبح فلما قال ‏\"‏ سمع الله لمن حمده ‏\"‏ ‏.‏ في الركعة الثانية قام هنيهة ‏.‏",
      "text_en": " It was narrated that Ibn Sirin said:                     \"Some of those who prayed the Subh prayer with the Messenger of Allah (ﷺ) narrated to me that when he said: Sami'Allahu liman hamidah (Allah hears those who praise Him)' in the second rak'ah, he stood for a while.\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20212",
        "20475",
        "11035"
      ]
    },
    {
      "id": "sunan-an-nasai-1084",
      "hadith_no": "1084",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، عن شعبة، عن أبي بشر، قال سمعت يوسف، - وهو ابن ماهك - يحدث عن حكيم، قال بايعت رسول الله صلى الله عليه وسلم أن لا أخر إلا قائما ‏.‏",
      "text_en": " It was narrated that Abu Bushr said:                     \"I heard Yusuf-meaning Ibn Mahak- narrating that Hakim said: 'I gave my pledge of allegiance to the Messenger of Allah (ﷺ), pledging that I would go down (in prostration) only after standing up from bowing.'\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "20020",
        "11419",
        "11264"
      ]
    },
    {
      "id": "sunan-an-nasai-1110",
      "hadith_no": "1110",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا عبدة، قال حدثنا سعيد، عن قتادة، عن أنس، ح وأخبرنا إسماعيل بن مسعود، عن خالد، عن شعبة، عن قتادة، قال سمعت أنسا، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ اعتدلوا في السجود ولا يبسط أحدكم ذراعيه انبساط الكلب ‏\"‏ ‏.‏ اللفظ لإسحاق ‏.‏",
      "text_en": " It was narrated that Qatadah said:                     \"I heard Anas (narrate) that the Messenger of Allah (ﷺ) said: 'Be moderate in prostration and do not rest your forearms along the ground like a dog.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20337",
        "11168",
        "11019",
        "19",
        "34033",
        "20423",
        "20020",
        "11019",
        "19"
      ]
    },
    {
      "id": "sunan-an-nasai-1169",
      "hadith_no": "1169",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، قال حدثنا هشام، - هو الدستوائي - عن حماد، عن أبي وائل، عن ابن مسعود، قال كنا نصلي مع رسول الله صلى الله عليه وسلم فنقول السلام على الله السلام على جبريل السلام على ميكائيل ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تقولوا السلام على الله فإن الله هو السلام ولكن قولوا التحيات لله والصلوات والطيبات السلام عليك أيها النبي ورحمة الله وبركاته السلام علينا وعلى عباد الله الصالحين أشهد أن لا إله إلا الله وأشهد أن محمدا عبده ورسوله ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn Mas'ud said:                     \"We used to pray with the Messenger of Allah (ﷺ) and we would say: \"Peace (As-Salam) be upon Allah (SWT), peace be upon Jibril, peace be upon Mika'il.' The Messenger of Allah (ﷺ) said: 'Do not say \"Peace (As-Salam) be upon Allah, for Allah is As-Salam.\" Rather say: \"At-tahiyyatu lillahi was-salawatu wat-tayyibat, as-salamu 'alaika ayyuhan-Nabiyyu wa rahmatAllahi wa baraktuhu. As-salamu 'alaina wa 'ala 'ibad illahis-salihin, ashahdu an la illaha ill-Allah wa ashhadu anna Muhammadan 'abduhu wa rasuluhu (Allah compliments, prayers and pure words are due to Allah. Peace be upon you, O Prophet, and the mercy of Allah (SWT) and his blessings. Peace be upon us and upon the righteous slaves of Allah (SWT). I bear witness that none has the right to be worshipped except Allah and I bear witness that Muhammad is His slave and Messenger).\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "20295",
        "20022",
        "11353",
        "16"
      ]
    },
    {
      "id": "sunan-an-nasai-1219",
      "hadith_no": "1219",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا يحيى بن سعيد، قال حدثنا إسماعيل بن أبي خالد، قال حدثني الحارث بن شبيل، عن أبي عمرو الشيباني، عن زيد بن أرقم، قال كان الرجل يكلم صاحبه في الصلاة بالحاجة على عهد رسول الله صلى الله عليه وسلم حتى نزلت هذه الآية ‏{‏ حافظوا على الصلوات والصلاة الوسطى وقوموا لله قانتين ‏}‏ فأمرنا بالسكوت ‏.‏",
      "text_en": " It was narrated that Zaid bin Arqam said:                     \"We used to speak to each other during the prayer, saying whatever was necessary, at the time of the Messenger of Allah (ﷺ), until this verse was revealed: Guard strictly (five obligatory) As-Salawat (the prayers) especially the middle Salah (i.e. the best prayer- 'Asr). And stand before Allah with obedience (and do not speak to others during the Salah (prayers)), so we were commanded to be silent.\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20031",
        "11418",
        "11681",
        "11343",
        "384"
      ]
    },
    {
      "id": "sunan-an-nasai-1244",
      "hadith_no": "1244",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد بن الحارث، عن شعبة، قال كتب إلى منصور وقرأته عليه وسمعته يحدث رجلا عن إبراهيم عن علقمة عن عبد الله أن رسول الله صلى الله عليه وسلم صلى صلاة الظهر ثم أقبل عليهم بوجهه فقالوا أحدث في الصلاة حدث قال ‏\"‏ وما ذاك ‏\"‏ ‏.‏ فأخبروه بصنيعه فثنى رجله واستقبل القبلة فسجد سجدتين ثم سلم ثم أقبل عليهم بوجهه فقال ‏\"‏ إنما أنا بشر أنسى كما تنسون فإذا نسيت فذكروني ‏\"‏ ‏.‏ وقال ‏\"‏ لو كان حدث في الصلاة حدث أنبأتكم به ‏\"‏ ‏.‏ وقال ‏\"‏ إذا أوهم أحدكم في صلاته فليتحر أقرب ذلك من الصواب ثم ليتم عليه ثم يسجد سجدتين ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah that:                     The Messenger of Allah (ﷺ) prayed Zuhr then he turned to face them and they said: 'Has there been some change concerning the prayer?' He said: 'Why are you asking?' They told him what he had done, so he turned back toward the Qiblah and prostrated twice. Then he said the salam and turned to face them and said: 'I am only human, I forget as you forget, so if I forget, then remind me.' And he said: 'If there had been some change concerning the prayer I would have told you.' And he said: 'If one of you is not sure about his prayer, let him estimate what is closest to what is correct, then let him complete it on that basis, then prostrate twice.'",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20226",
        "20020",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "id": "sunan-an-nasai-1265",
      "hadith_no": "1265",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال أنبأنا بشر بن المفضل، قال حدثنا عاصم بن كليب، عن أبيه، عن وائل بن حجر، قال قلت لأنظرن إلى صلاة رسول الله صلى الله عليه وسلم كيف يصلي فقام رسول الله صلى الله عليه وسلم فاستقبل القبلة فرفع يديه حتى حاذتا أذنيه ثم أخذ شماله بيمينه فلما أراد أن يركع رفعهما مثل ذلك ووضع يديه على ركبتيه فلما رفع رأسه من الركوع رفعهما مثل ذلك فلما سجد وضع رأسه بذلك المنزل من يديه ثم جلس فافترش رجله اليسرى ووضع يده اليسرى على فخذه اليسرى وحد مرفقه الأيمن على فخذه اليمنى وقبض ثنتين وحلق ورأيته يقول هكذا وأشار بشر بالسبابة من اليمنى وحلق الإبهام والوسطى ‏.‏",
      "text_en": " It was narrated that Wa'il bin Hujr said:                     \"I said: 'I am going to watch the Messenger of Allah (ﷺ) and see how he prays.' The Messenger of Allah (ﷺ) stood up and faced the Qiblah, then he raised his hands until they were in level with his ears, then he held his left hand with his right. When he wanted to bow, he raised them (his hands) likewise, then placed his hands on his knees. When he raised his head from bowing, he raised them (his hands) likewise. When he prostrated he put his hands in the same position in relation to his head, then he sat up and lay his left foot on the ground. He placed his left hand on his left thigh and his right elbow on his right thigh, and made a circle with two of his fingers. And I saw him doing like this\"- Bishr (one of the narrators) pointed with the forefinger of his right hand and made a circle with the thumb and middle finger.",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20212",
        "10778",
        "19941",
        "3045"
      ]
    },
    {
      "id": "sunan-an-nasai-1364",
      "hadith_no": "1364",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا بشر، - وهو ابن المفضل - قال حدثنا داود بن أبي هند، عن الوليد بن عبد الرحمن، عن جبير بن نفير، عن أبي ذر، قال صمنا مع رسول الله صلى الله عليه وسلم رمضان فلم يقم بنا النبي صلى الله عليه وسلم حتى بقي سبع من الشهر فقام بنا حتى ذهب نحو من ثلث الليل ثم كانت سادسة فلم يقم بنا فلما كانت الخامسة قام بنا حتى ذهب نحو من شطر الليل قلنا يا رسول الله لو نفلتنا قيام هذه الليلة ‏.‏ قال ‏\"‏ إن الرجل إذا صلى مع الإمام حتى ينصرف حسب له قيام ليلة ‏\"‏ ‏.‏ قال ثم كانت الرابعة فلم يقم بنا فلما بقي ثلث من الشهر أرسل إلى بناته ونسائه وحشد الناس فقام بنا حتى خشينا أن يفوتنا الفلاح ثم لم يقم بنا شيئا من الشهر ‏.‏ قال داود قلت ما الفلاح قال السحور ‏.‏",
      "text_en": " It was narrated that Abu Dharr said:                     \"We fasted Ramadan with the Messenger of Allah (ﷺ), and the Prophet (ﷺ) did not lead us in Qiyam until there were seven days left of the month, then he led us in Qiyam until one-third of the night had passed. Then, when there were six days left, he did not lead us in Qiyam. When there were five days left, he led us in praying Qiyam until half the night had passed. We said: 'O Messenger of Allah (SA), why don't you lead us in praying Qiyam for the rest of the night?' He said: 'If a man prays with the Imam until he leaves, that will be continued for him as if he spent the whole night in prayer.' Then, when there were four days left, he did not lead us in praying Qiyam. When there were three days left he sent for his daughters and women, and gathered the people, and he led us in praying Qiyam until we feared that we would miss Al-Falah. Then he did not lead us in praying Qiyam for the rest of the month.\" Dawud (one of the narrators) said: \"I said: ' What is falah?' He said: 'Sahur.'",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20212",
        "11585",
        "10975",
        "4097",
        "23"
      ]
    },
    {
      "id": "sunan-an-nasai-1366",
      "hadith_no": "1366",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا إسماعيل بن مسعود، ومحمد بن عبد الأعلى، قالا حدثنا خالد، - وهو ابن الحارث - عن هشام، عن يحيى بن أبي كثير، عن أبي سلمة بن عبد الرحمن، عن جابر بن عبد الله، أن عمر بن الخطاب، يوم الخندق بعد ما غربت الشمس جعل يسب كفار قريش وقال يا رسول الله ما كدت أن أصلي حتى كادت الشمس تغرب فقال رسول الله صلى الله عليه وسلم ‏\"‏ فوالله ما صليتها ‏\"‏ ‏.‏ فنزلنا مع رسول الله صلى الله عليه وسلم إلى بطحان فتوضأ للصلاة وتوضأنا لها فصلى العصر بعد ما غربت الشمس ثم صلى بعدها المغرب ‏.‏",
      "text_en": " It was narrated from Jabir bin Abdullah that:                     On the Day of Al-Khandaq, after the sun had set, Umar bin Al-Khattab started cursing the disbelievers of the Quraish and said: \"O Messenger of Allah, I was hardly able to pray until the sun set.\" The Messenger of Allah (ﷺ) said: \"By Allah, I did not pray.\" So we went down with the Messenger of Allah (ﷺ) to Buthan. He performed wudu' for prayer and so did we, and he prayed 'Asr after the sun had set, then he prayed Maghrib after that.\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "30449",
        "20226",
        "20295",
        "11449",
        "10567",
        "34",
        "3"
      ]
    },
    {
      "id": "sunan-an-nasai-Grade-52",
      "hadith_no": "Grade",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا بشر بن المفضل، قال حدثنا عبيد الله، عن نافع، عن عبد الله، أن رسول الله صلى الله عليه وسلم كان يخطب الخطبتين وهو قائم وكان يفصل بينهما بجلوس ‏.‏",
      "text_en": " It was narrated from 'Abdullah that:                     The Messenger of Allah (ﷺ) used to deliver two khutbahs standing, and he would separate them by sitting.",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20212",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-1444",
      "hadith_no": "1444",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Shortening the Prayer When Traveling - كتاب تقصير الصلاة فى السفر",
      "chapter_no": "15",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا يزيد بن زريع، قال حدثنا سعيد، قال حدثنا قتادة، أن موسى بن سلمة، حدثهم أنه، سأل ابن عباس قلت تفوتني الصلاة في جماعة وأنا بالبطحاء، ما ترى أن أصلي، قال ركعتين سنة أبي القاسم صلى الله عليه وسلم ‏.‏",
      "text_en": " Musa bin Salamah narrated that he asked Ibn 'Abbas:                     \"I missed the prayer in congregation when I was in Al-Batha; how do you think I should pray?\" He said: \"Two rak'ahs, the sunnah of the Messenger of Allah (ﷺ).\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20304",
        "11168",
        "11019",
        "26042",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-1492",
      "hadith_no": "1492",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، عن أشعث، عن الحسن، عن أبي بكرة، أن رسول الله صلى الله عليه وسلم صلى ركعتين مثل صلاتكم هذه وذكر كسوف الشمس ‏.‏",
      "text_en": " It was narrated from Abu Bakrah that:                     The Messenger of Allah (ﷺ) prayed two rak'ahs like this prayer of yours, and he mentioned the eclipse of the sun.",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "11324",
        "11016",
        "3229"
      ]
    },
    {
      "id": "sunan-an-nasai-1538",
      "hadith_no": "1538",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Fear Prayer - كتاب صلاة الخوف",
      "chapter_no": "18",
      "text_ar": "أخبرنا إسماعيل بن مسعود، عن يزيد بن زريع، قال حدثنا معمر، عن الزهري، عن سالم، عن أبيه، أن رسول الله صلى الله عليه وسلم صلى بإحدى الطائفتين ركعة والطائفة الأخرى مواجهة العدو ثم انطلقوا فقاموا في مقام أولئك وجاء أولئك فصلى بهم ركعة أخرى ثم سلم عليهم فقام هؤلاء فقضوا ركعتهم وقام هؤلاء فقضوا ركعتهم ‏.‏",
      "text_en": " It was narrated from Salim from his father, that:                     The Messenger of Allah (ﷺ) led one of the two groups in praying one rak'ah while the other group was facing the enemy, then they moved away and took the place of the others, and the others came and he led them in praying the other rak'ah, then he said the salam and they stood up and made up the other rak'ah, and the others stood up and made up the other rak'ah.",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20304",
        "20115",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-1547",
      "hadith_no": "1547",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Fear Prayer - كتاب صلاة الخوف",
      "chapter_no": "18",
      "text_ar": "أخبرنا علي بن الحسين الدرهمي، وإسماعيل بن مسعود، قالا حدثنا خالد، قال حدثنا عبد الملك بن أبي سليمان، عن عطاء، عن جابر، قال شهدنا مع رسول الله صلى الله عليه وسلم صلاة الخوف فقمنا خلفه صفين والعدو بيننا وبين القبلة فكبر رسول الله صلى الله عليه وسلم وكبرنا وركع وركعنا ورفع ورفعنا فلما انحدر للسجود سجد رسول الله صلى الله عليه وسلم والذين يلونه وقام الصف الثاني حين رفع رسول الله صلى الله عليه وسلم والصف الذين يلونه ثم سجد الصف الثاني حين رفع رسول الله صلى الله عليه وسلم في أمكنتهم ثم تأخر الصف الذين كانوا يلون النبي صلى الله عليه وسلم وتقدم الصف الآخر فقام في مقامهم وقام هؤلاء في مقام الآخرين قياما وركع النبي صلى الله عليه وسلم وركعنا ثم رفع ورفعنا فلما انحدر للسجود سجد الذين يلونه والآخرون قيام فلما رفع رسول الله صلى الله عليه وسلم والذين يلونه سجد الآخرون ثم سلم ‏.‏",
      "text_en": " It was narrated that Jabir said:                     \"We witnessed the fear prayer with the Messenger of Allah (ﷺ). We stood behind him in two rows, and the enemy was between us and the Qiblah. The Messenger of Allah (ﷺ) said the takbir. He bowed and we bowed, and he stood up again and we stood up. When he went down in prostration, the Messenger of Allah (ﷺ) and those who were closest to him prostrated, and the second row remained standing until the Messenger of Allah (ﷺ) and the row closest to him stood up. Then the second row prostrated when the Messenger of Allah (ﷺ) had stood up, where they were. Then the row that had been closest to the Prophet (ﷺ) moved back and the second row moved forward, each standing in the place where the other had been. The Prophet (ﷺ) bowed and we bowed, then he stood up and we stood up, and when he went down in prostration, those who were closest to him prostrated and the others remained standing. When the Messenger of Allah (ﷺ) and those who were closest to him sat up, the others prostrated, then he said the taslim.\"",
      "usc_msa_ref": "",
      "chain": [
        "11045",
        "34033",
        "20423",
        "10945",
        "11029",
        "34"
      ]
    },
    {
      "id": "sunan-an-nasai-1551",
      "hadith_no": "1551",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Fear Prayer - كتاب صلاة الخوف",
      "chapter_no": "18",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، وإسماعيل بن مسعود، - واللفظ له - قالا حدثنا خالد، عن أشعث، عن الحسن، عن أبي بكرة، أن رسول الله صلى الله عليه وسلم صلى بالقوم في الخوف ركعتين ثم سلم ثم صلى بالقوم الآخرين ركعتين ثم سلم فصلى النبي صلى الله عليه وسلم أربعا ‏.‏",
      "text_en": " It was narrated from Abu Bakrah that:                     The Messenger of Allah (ﷺ) led the people in offering the fear prayer, two rak'ahs. Then he said the taslim and led others in offering the fear prayer, then he said the taslim. So the Prophet (ﷺ) had prayed four rak'ahs.",
      "usc_msa_ref": "",
      "chain": [
        "30449",
        "34033",
        "20423",
        "11324",
        "11016",
        "3229"
      ]
    },
    {
      "id": "sunan-an-nasai-1574",
      "hadith_no": "1574",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Prayer for the Two 'Eids - كتاب صلاة العيدين",
      "chapter_no": "19",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، قال حدثنا شعبة، عن سماك، قال سألت جابرا أكان رسول الله صلى الله عليه وسلم يخطب قائما قال كان رسول الله صلى الله عليه وسلم يخطب قائما ثم يقعد قعدة ثم يقوم ‏.‏",
      "text_en": " It was narrated that Simak said:                     \"I asked Jabir: 'Did the Messenger of Allah (ﷺ) deliver the Khutbah standing?' He said: 'The Messenger of Allah (ﷺ) used to deliver the Khutbah standing, then he would sit for a while, then stand up again.'\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "20020",
        "10770"
      ]
    },
    {
      "id": "sunan-an-nasai-1588",
      "hadith_no": "1588",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Prayer for the Two 'Eids - كتاب صلاة العيدين",
      "chapter_no": "19",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا حاتم بن وردان، عن أيوب، عن محمد بن سيرين، عن أنس بن مالك، قال خطبنا رسول الله صلى الله عليه وسلم يوم أضحى وانكفأ إلى كبشين أملحين فذبحهما ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                     \"The Messenger of Allah (ﷺ) addressed us on the day of Al-Adha and went to two black and white rams and slaughtered them.\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "11015",
        "11035",
        "19"
      ]
    },
    {
      "id": "sunan-an-nasai-1636",
      "hadith_no": "1636",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا يحيى بن حبيب بن عربي، وإسماعيل بن مسعود، قالا حدثنا معتمر، قال سمعت أبي قال، سمعت أنسا، يقول أخبرني بعض، أصحاب النبي صلى الله عليه وسلم أن النبي صلى الله عليه وسلم ليلة أسري به مر على موسى عليه السلام وهو يصلي في قبره ‏.‏",
      "text_en": " Mu'tamir said:                     \"I heard my father say: I heard Anas say: 'One of the companions of the Prophet (ﷺ) told me that on the Night Journey, the Prophet (ﷺ) passed by Musa, peace be upon him, and he was praying in his grave.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30459",
        "34033",
        "20288",
        "11289",
        "19"
      ]
    },
    {
      "id": "sunan-an-nasai-1654",
      "hadith_no": "1654",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا إسماعيل بن مسعود، حدثنا خالد، عن شعبة، عن أبي إسحاق، قال سمعت أبا سلمة، عن أم سلمة، قالت ما مات رسول الله صلى الله عليه وسلم حتى كان أكثر صلاته قاعدا إلا الفريضة وكان أحب العمل إليه أدومه وإن قل ‏.‏",
      "text_en": " It was narrated from Abu Salamah, that Umm Salamah said:                     \"The Messenger of Allah (ﷺ) did not pass away until most of his prayers were offered sitting down, except for the obligatory prayers, and the dearest of actions to him were those which were done persistently, even if they were few.\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "20020",
        "11049",
        "10567",
        "56"
      ]
    },
    {
      "id": "sunan-an-nasai-1698",
      "hadith_no": "1698",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا بشر بن المفضل، قال حدثنا سعيد، عن قتادة، عن زرارة بن أوفى، عن سعد بن هشام، أن عائشة، حدثته أن رسول الله صلى الله عليه وسلم كان لا يسلم في ركعتى الوتر ‏.‏",
      "text_en": " It was narrated from Sa'd bin Hisham, that:                     Aishah told him: \"The Messenger of Allah (ﷺ) would not say the taslim for two rak'ahs during witr.\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20212",
        "11168",
        "11019",
        "11284",
        "11166",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-1718",
      "hadith_no": "1718",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، قال حدثنا شعبة، عن قتادة، عن زرارة بن أوفى، عن سعد بن هشام، عن عائشة، قالت لما أسن رسول الله صلى الله عليه وسلم وأخذ اللحم صلى سبع ركعات لا يقعد إلا في آخرهن وصلى ركعتين وهو قاعد بعد ما يسلم فتلك تسع يا بنى وكان رسول الله صلى الله عليه وسلم إذا صلى صلاة أحب أن يداوم عليها ‏.‏ مختصر ‏.‏ خالفه هشام الدستوائي ‏.‏",
      "text_en": " Shu'bah narrated from Qatadah, from Zurarahbin Awfa, from Sa'd bin Hisham, that:                     Aishah said: \"When the Messenger of Allah (ﷺ) grew old and put on weight, he prayed seven rak'ahs and only sat in the last of them, and he prayed two rak'ahs while sitting after saying the taslim, and that was nine, O my son! And when the Messenger of Allah (ﷺ) offered any prayer he liked to persist in doing so.\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "20020",
        "11019",
        "11284",
        "11166",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-1774",
      "hadith_no": "1774",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد بن الحارث، قال حدثنا عبيد الله، عن نافع، عن عبد الله، قال حدثتني أختي، حفصة أنه كان يصلي قبل الفجر ركعتين خفيفتين ‏.‏",
      "text_en": " It was narrated that Abdullah said:                     \"My sister Hafsah told me that he used to pray two brief rak'ahs before Fajr.\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20226",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-1781",
      "hadith_no": "1781",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، قال حدثنا هشام، قال حدثنا يحيى، عن أبي سلمة، أنه سأل عائشة عن صلاة، رسول الله صلى الله عليه وسلم بالليل قالت كان يصلي ثلاث عشرة ركعة يصلي ثمان ركعات ثم يوتر ثم يصلي ركعتين وهو جالس فإذا أراد أن يركع قام فركع ويصلي ركعتين بين الأذان والإقامة في صلاة الصبح ‏.‏",
      "text_en": " It was narrated from Abu Salamah that :                     He asked Aishah about the prayer of the Messenger of Allah (ﷺ) at night. She said: \"He used to pray thirteen rak'ahs. He would pray eight rak'ahs then pray witr, then pray two rak'ahs sitting down. When he wanted to bow he would stand and bow, and he prayed two rak'ahs between the adhan and iqamah of subh prayer.",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "20295",
        "11449",
        "10567",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-1874",
      "hadith_no": "1874",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا بشر بن المفضل، عن يونس، عن الحسن، عن صعصعة بن معاوية، قال لقيت أبا ذر قلت حدثني ‏.‏ قال نعم قال رسول الله صلى الله عليه وسلم ‏\"‏ ما من مسلمين يموت بينهما ثلاثة أولاد لم يبلغوا الحنث إلا غفر الله لهما بفضل رحمته إياهم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Sa'sa'ah bin Mu'awiyah said:                     \"I met Abu Dharr and said: 'Tell me a Hadith.' He said: the Messenger of Allah said: There are no two Muslims, three of whose children die before reaching puberty, but Allah will forgive them by virtue of His mercy towards them.\"'",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20212",
        "20475",
        "11016",
        "18438"
      ]
    },
    {
      "id": "sunan-an-nasai-1886",
      "hadith_no": "1886",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا إسماعيل بن مسعود، عن يزيد، قال حدثنا أيوب، عن محمد بن سيرين، عن أم عطية، قالت دخل علينا رسول الله صلى الله عليه وسلم ونحن نغسل ابنته فقال ‏\"‏ اغسلنها ثلاثا أو خمسا أو أكثر من ذلك إن رأيتن ذلك بماء وسدر واجعلن في الآخرة كافورا أو شيئا من كافور فإذا فرغتن فآذنني ‏\"‏ ‏.‏ فلما فرغنا آذناه فألقى إلينا حقوه وقال ‏\"‏ أشعرنها إياه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Umm 'Atiyyah said:                     \"The Messenger of Allah entered upon us when we were washing his daughter and said: 'Wash her three times or five, or more if you think (that is necessary), with water and lotus leaves, and put camphor, or some camphor in it the last time. And when you have finished, inform me.' When we finished, we informed him, and he threw his waist-wrap to us and said: 'Shroud her in it.\"'",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20304",
        "11015",
        "11035",
        "71"
      ]
    },
    {
      "id": "sunan-an-nasai-1889",
      "hadith_no": "1889",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا بشر، عن سلمة بن علقمة، عن محمد، عن بعض، إخوته عن أم عطية، قالت توفيت ابنة لرسول الله صلى الله عليه وسلم فأمرنا بغسلها فقال ‏\"‏ اغسلنها ثلاثا أو خمسا أو سبعا أو أكثر من ذلك إن رأيتن ‏\"‏ ‏.‏ قالت قلت وترا قال ‏\"‏ نعم واجعلن في الآخرة كافورا أو شيئا من كافور فإذا فرغتن فآذنني ‏\"‏ ‏.‏ فلما فرغنا آذناه فأعطانا حقوه وقال ‏\"‏ أشعرنها إياه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Umm 'Atiyyah said:                     \"A daughter of the Messenger of Allah died and he told us to wash her. He said: 'Three times, or five or seven, or more than that, if you think that (is necessary).' I said: 'An odd number?' He said: 'Yes, and put camphor, or some camphor, in (the water) the last time. And when you have finished, inform me.' So when you have finished, we informed him, and then gave us his waist-wrap and said: 'Shroud her in it.\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20212",
        "11593",
        "11035",
        "71"
      ]
    },
    {
      "id": "sunan-an-nasai-1903",
      "hadith_no": "1903",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا يحيى، عن الأعمش، ح وأخبرنا إسماعيل بن مسعود، قال حدثنا يحيى بن سعيد القطان، قال سمعت الأعمش، قال سمعت شقيقا، قال حدثنا خباب، قال هاجرنا مع رسول الله صلى الله عليه وسلم نبتغي وجه الله تعالى فوجب أجرنا على الله فمنا من مات لم يأكل من أجره شيئا منهم مصعب بن عمير قتل يوم أحد فلم نجد شيئا نكفنه فيه إلا نمرة كنا إذا غطينا رأسه خرجت رجلاه وإذا غطينا بها رجليه خرجت رأسه فأمرنا رسول الله صلى الله عليه وسلم أن نغطي بها رأسه ونجعل على رجليه إذخرا ومنا من أينعت له ثمرته فهو يهدبها ‏.‏ واللفظ لإسماعيل ‏.‏",
      "text_en": " Khabbab said:                     \"We emigrated with the Messenger of Allah, seeking the Face of Allah, the Most High, so our reward became due from Allah. Some of us died without enjoying anything of his reward (in this world) among them is Mus'ab bin Umair. He was matyred on the day of Uhud and we could not find anything to shroud him in except a Namirah; if we covered his head with it, his feet were uncovered, and if we covered his feet with it, his head became uncovered. The Messenger of Allah told us to cover his head with it and to put Idhkhir over his feet. And for some of us, the fruits of our labor have ripened and we are gathering them.\" This is the wording of Isma'il",
      "usc_msa_ref": "",
      "chain": [
        "30359",
        "20031",
        "11060",
        "34033",
        "20031",
        "11060",
        "11353",
        "149"
      ]
    },
    {
      "id": "sunan-an-nasai-1917",
      "hadith_no": "1917",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا علي بن حجر، قال حدثنا إسماعيل، عن هشام، ح وأخبرنا إسماعيل بن مسعود، قال حدثنا خالد، قال حدثنا هشام، عن يحيى، عن أبي سلمة، عن أبي سعيد، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا رأيتم الجنازة فقوموا فمن تبعها فلا يقعد حتى توضع ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Sa'eed said:                     \"The Messenger of Allah said: 'When you see a funeral, stand up, and whoever follows it, let him not sit down until (the body) is placed (in the grave).\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20208",
        "20295",
        "34033",
        "20423",
        "11065",
        "11449",
        "10567",
        "38"
      ]
    },
    {
      "id": "sunan-an-nasai-1921",
      "hadith_no": "1921",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، قال حدثنا شعبة، عن عمرو بن مرة، عن عبد الرحمن بن أبي ليلى، قال كان سهل بن حنيف وقيس بن سعد بن عبادة بالقادسية فمر عليهما بجنازة فقاما فقيل لهما إنها من أهل الأرض ‏.‏ فقالا مر على رسول الله صلى الله عليه وسلم بجنازة فقام فقيل له إنه يهودي ‏.‏ فقال ‏\"‏ أليست نفسا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdur-Rahman bin Abi Laila said:                     \"Sahl bin Hunaif and Qais bin Sa'd bin 'Ubadah were in Al-Qadisiyyah when a funeral passed by them, so they stood up and it was said to them: 'It is one of the local people.' They said: 'A funeral passed the Messenger of Allah and he stood up, and it was said to him: It Is a Jew. He said: 'Is it not a soul?\"'",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "20020",
        "11381",
        "11196"
      ]
    },
    {
      "id": "sunan-an-nasai-1922",
      "hadith_no": "1922",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا علي بن حجر، قال حدثنا إسماعيل، عن هشام، ح وأخبرنا إسماعيل بن مسعود، قال حدثنا خالد، قال حدثنا هشام، عن يحيى بن أبي كثير، عن عبيد الله بن مقسم، عن جابر بن عبد الله، قال مرت بنا جنازة فقام رسول الله صلى الله عليه وسلم وقمنا معه فقلت يا رسول الله إنما هي جنازة يهودية ‏.‏ فقال ‏\"‏ إن للموت فزعا فإذا رأيتم الجنازة فقوموا ‏\"‏ ‏.‏ اللفظ لخالد ‏.‏",
      "text_en": " It was narrated that Jabir bin 'Abdullah said:                     \"A funeral passed by us and the Messenger of Allah stood up and we stood with him. I said: 'O Messenger of Allah, it is a Jewish funeral.' He said: 'Death is something terrifying, so if you see a funeral, stand up,\"' This is the wording of Khalid.",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20208",
        "20295",
        "34033",
        "20423",
        "11065",
        "11449",
        "11521",
        "34"
      ]
    },
    {
      "id": "sunan-an-nasai-1948",
      "hadith_no": "1948",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، قال حدثنا سعيد بن عبيد الله، قال سمعت زياد بن جبير، يحدث عن أبيه، عن المغيرة بن شعبة، أنه ذكر أن رسول الله صلى الله عليه وسلم قال ‏\"‏ الراكب خلف الجنازة والماشي حيث شاء منها والطفل يصلى عليه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Al-Mughirah bin Shu'bah that:                     the Messenger of Allah said: \"The rider should move behind the Janazah and the pedestrian may walk wherever he wishes, and the (funeral) prayer should be offered for a child.\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "11629",
        "11285",
        "3225",
        "166"
      ]
    },
    {
      "id": "sunan-an-nasai-1957",
      "hadith_no": "1957",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، قال حدثنا هشام، عن يحيى بن أبي كثير، عن أبي قلابة، عن أبي المهلب، عن عمران بن حصين، أن امرأة، من جهينة أتت رسول الله صلى الله عليه وسلم فقالت إني زنيت وهي حبلى فدفعها إلى وليها فقال ‏\"‏ أحسن إليها فإذا وضعت فائتني بها ‏\"‏ ‏.‏ فلما وضعت جاء بها فأمر بها فشكت عليها ثيابها ثم رجمها ثم صلى عليها فقال له عمر أتصلي عليها وقد زنت فقال ‏\"‏ لقد تابت توبة لو قسمت بين سبعين من أهل المدينة لوسعتهم وهل وجدت توبة أفضل من أن جادت بنفسها لله عز وجل ‏\"‏ ‏.‏",
      "text_en": " It was narrated from \"Imran bin Husain that:                     a woman from Juhainah came to the Messenger of Allah sand said: \"I have committed Zina.\" And she was committed Zina.\" And She was pregnant. He handed her over to her guardian and said: \"Look after her, and when she gave birth, he brought her to him. He ordered that her garment be wrapped around her, then he offered the funeral prayer for her. 'Umar said to him: \"Are you praying for her even though she committed Zina?\" he said: \"She has repented in  a manner that, if it were to be shared among seventy of the people of Al-Madinah it would suffice them. Have you ever seen repentance better than the one who sacrificed herself for the sake of Allah, the Mighty and Sublime?\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "20295",
        "11449",
        "11047",
        "123"
      ]
    },
    {
      "id": "sunan-an-nasai-1975",
      "hadith_no": "1975",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا بشر بن المفضل، قال حدثنا يونس، عن محمد بن سيرين، عن أبي المهلب، عن عمران بن حصين، قال قال لنا رسول الله صلى الله عليه وسلم ‏\"‏ إن أخاكم النجاشي قد مات فقوموا فصلوا عليه ‏\"‏ ‏.‏ قال فقمنا فصففنا عليه كما يصف على الميت وصلينا عليه كما يصلى على الميت ‏.‏",
      "text_en": " It was narrated that 'Imran bin Husain said:                     \"The Messenger of Allah said to us: 'Your brother An-Najashi has died, so get up and offer the funeral prayer for him.' So we got up and formed row to pray for him, as rows are formed to pray for the dead, and he led us in praying for him as people pray for the dead.\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20212",
        "20475",
        "11035",
        "123"
      ]
    },
    {
      "id": "sunan-an-nasai-1986",
      "hadith_no": "1986",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا يزيد، - وهو ابن زريع - قال حدثنا هشام بن أبي عبد الله، عن يحيى بن أبي كثير، عن أبي إبراهيم الأنصاري، عن أبيه، أنه سمع النبي صلى الله عليه وسلم يقول في الصلاة على الميت ‏\"‏ اللهم اغفر لحينا وميتنا وشاهدنا وغائبنا وذكرنا وأنثانا وصغيرنا وكبيرنا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Ibrahim Al-Ansari, from his father, that:                     he heard the Prophet say, when offering the funeral prayer for one who had died: Allahummighfir lihayyina wa mayyitina wa shahidina wa gha'ibina wadhakarina wa unthana wa saghirina wa kabirina (O Allah, forgive our living and our dead, those who are present among us and those who are absent, our males and our females, our young and our old).",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20304",
        "11449"
      ]
    },
    {
      "id": "sunan-an-nasai-2000",
      "hadith_no": "2000",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، قال حدثنا شعبة، قال أخبرني محمد بن المنكدر، عن مسعود بن الحكم، عن علي، قال ‏:‏ رأيت رسول الله صلى الله عليه وسلم قام فقمنا، ورأيناه قعد فقعدنا ‏.‏",
      "text_en": " It was narrated from 'Ali bin Abi Talib that:                     mention was made of standing at the funeral until the body is placed in the grave. 'Ali bin Abi Talib said: \"The Messenger of Allah stood, then he sat down.\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "20020",
        "11048",
        "5"
      ]
    },
    {
      "id": "sunan-an-nasai-2012",
      "hadith_no": "2012",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا إسماعيل بن مسعود، عن يزيد، - وهو ابن زريع - قال حدثنا شعبة، عن أبي جمرة، عن ابن عباس، قال ‏:‏ جعل تحت رسول الله صلى الله عليه وسلم حين دفن قطيفة حمراء ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"When the Messenger of Allah was buried, a red velvet cloak was placed beneath him.\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20304",
        "20020",
        "11309",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-2023",
      "hadith_no": "2023",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، عن شعبة، عن سليمان الشيباني، عن الشعبي، ‏:‏ أخبرني من، مر مع رسول الله صلى الله عليه وسلم على قبر منتبذ، فأمهم وصف خلفه، قلت ‏:‏ من هو يا أبا عمرو قال ‏:‏ ابن عباس ‏.‏",
      "text_en": " It was narrated from Sulaiman Ash-Shaibani from Ash-Sha'bi:                     \"Some people passed by an isolated grave with the Messenger of Allah and he led them in prayer and they formed rows behind him.\" I said: \"Who was that O Abu 'Amr?\" He said: \"Ibn 'Abbas.\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "20020",
        "11352"
      ]
    },
    {
      "id": "sunan-an-nasai-2156",
      "hadith_no": "2156",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، قال حدثنا هشام، قال حدثنا قتادة، عن أنس، عن زيد بن ثابت، قال تسحرنا مع رسول الله صلى الله عليه وسلم ثم قمنا إلى الصلاة ‏.‏ قلت زعم أن أنسا القائل ما كان بين ذلك قال قدر ما يقرأ الرجل خمسين آية ‏.‏",
      "text_en": " It was narrated from Anas that Zaid bin Thabit said:                     \"We had Sahur with the Messenger of Allah then we went to pray.\" I (one of the narrators) said: \"It is claimed that Anas said: 'How long was there between them?' He said: 'As long as it takes a man to recite fifty verses.\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "20295",
        "11019",
        "19",
        "49"
      ]
    },
    {
      "id": "sunan-an-nasai-2184",
      "hadith_no": "2184",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال أنبأنا خالد، - وهو ابن الحارث - عن كهمس، عن عبد الله بن شقيق، قال قلت لعائشة أكان رسول الله صلى الله عليه وسلم يصلي صلاة الضحى قالت لا إلا أن يجيء من مغيبه ‏.‏ قلت هل كان رسول الله صلى الله عليه وسلم يصوم شهرا كله قالت لا ما علمت صام شهرا كله إلا رمضان ولا أفطر حتى يصوم منه حتى مضى لسبيله ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Shaqiq said:                     \"I said to Aishah: 'Did the Messenger of Allah offer Duha prayer? She said: \"No, unless he was returning from a journey, I Did the Messenger of Allah fast an entire month?' She said: 'No, I do not remember him fasting any month in full apart from Ramadan, and he did not break his fast for a whole month, rather he would fast some of (each month) until he passed away.\"' '",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20226",
        "11303",
        "10694"
      ]
    },
    {
      "id": "sunan-an-nasai-2290",
      "hadith_no": "2290",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، عن شعبة، عن منصور، عن مجاهد، عن ابن عباس، قال خرج رسول الله صلى الله عليه وسلم إلى مكة فصام حتى أتى عسفان فدعا بقدح فشرب - قال شعبة - في رمضان فكان ابن عباس يقول من شاء صام ومن شاء أفطر ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"The Messenger of Allah went out to Makkah, and he fasted until he came to 'Usfan. Then he called for a cup and drank.\" (One of the narrators) Shubah said: \"(That was) in Ramadan. Ibn 'Abbas used to say: 'Whoever wants to fast, may fast, and whoever wants to break may break his fast.\"'",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "20020",
        "11067",
        "11028",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-2348",
      "hadith_no": "2348",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا إسماعيل بن مسعود، عن خالد، قال حدثنا سعيد، قال حدثنا قتادة، عن زرارة بن أوفى، عن سعد بن هشام، عن عائشة، قالت لا أعلم نبي الله صلى الله عليه وسلم قرأ القرآن كله في ليلة ولا قام ليلة حتى الصباح ولا صام شهرا قط كاملا غير رمضان ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"I do not know that the Messenger of Allah recited the whole Quran in one night, or prayed Qiyam until morning, or ever fasted an entire month, except Ramadan.\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "11168",
        "11019",
        "11284",
        "11166",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-2442",
      "hadith_no": "2442",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا يزيد بن زريع، حدثنا سعيد بن أبي عروبة، قال حدثنا قتادة، عن أبي عمرو الغداني، أن أبا هريرة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ أيما رجل كانت له إبل لا يعطي حقها في نجدتها ورسلها ‏\"‏ ‏.‏ قالوا يا رسول الله ما نجدتها ورسلها قال ‏\"‏ في عسرها ويسرها فإنها تأتي يوم القيامة كأغذ ما كانت وأسمنه وآشره يبطح لها بقاع قرقر فتطؤه بأخفافها إذا جاءت أخراها أعيدت عليه أولاها في يوم كان مقداره خمسين ألف سنة حتى يقضى بين الناس فيرى سبيله وأيما رجل كانت له بقر لا يعطي حقها في نجدتها ورسلها فإنها تأتي يوم القيامة أغذ ما كانت وأسمنه وآشره يبطح لها بقاع قرقر فتنطحه كل ذات قرن بقرنها وتطؤه كل ذات ظلف بظلفها إذا جاوزته أخراها أعيدت عليه أولاها في يوم كان مقداره خمسين ألف سنة حتى يقضى بين الناس فيرى سبيله وأيما رجل كانت له غنم لا يعطي حقها في نجدتها ورسلها فإنها تأتي يوم القيامة كأغذ ما كانت وأكثره وأسمنه وآشره ثم يبطح لها بقاع قرقر فتطؤه كل ذات ظلف بظلفها وتنطحه كل ذات قرن بقرنها ليس فيها عقصاء ولا عضباء إذا جاوزته أخراها أعيدت عليه أولاها في يوم كان مقداره خمسين ألف سنة حتى يقضى بين الناس فيرى سبيله ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah said:                     \"I heard the Messenger of Allah say: 'Any man who has camels and does not pay what is due on them in its Najdah or its Risl mean?' He said: 'In times of hardship or in times of ease; they will come on the Day of Resurrection as energetic, fat and lively as they ever were. He will be laid face down in a flat arena for them and they will trample him with their hooves. When the last of them has passed, the first of them will return, on a day that is as long as fifty thousand years, until judgment is passed among the people, and he realizes his end. Any man who has cattle and does not pay what is due on them in drought or in plenty, they will come on the Day of Resurrection as energetic, fat and lively as they ever were. He will be laid face down in a flat arena for them, and they will trample him with their cloven hooves. When the last of them has passed the first of them will return, on a day that is as long as fifty thousand years, until judgment is passed among the people and he realizes his end. Any man who has sheep and does not pay what is due on them in drought or in plenty, they will come on the Day or Resurrection as energetic, fat and lively as they ever were. He will be laid face down in a flat arena for them and they will trample him with their cloven hooves, and each horned one will gore him with its horn, and there will be none among them with twisted or broken horns. When the last of them has passed, the first of them will return, on a day that is as long as fifty thousand years, until judgment is passed among the people, and he realizes his end.\"'",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20304",
        "11073",
        "11019",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-2479",
      "hadith_no": "2479",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، عن حسين، عن عمرو بن شعيب، عن أبيه، عن جده، أن امرأة، من أهل اليمن أتت رسول الله صلى الله عليه وسلم وبنت لها في يد ابنتها مسكتان غليظتان من ذهب فقال ‏\"‏ أتؤدين زكاة هذا ‏\"‏ ‏.‏ قالت لا ‏.‏ قال ‏\"‏ أيسرك أن يسورك الله عز وجل بهما يوم القيامة سوارين من نار ‏\"‏ ‏.‏ قال فخلعتهما فألقتهما إلى رسول الله صلى الله عليه وسلم فقالت هما لله ولرسوله صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu 'aib, from his father, from his grandfather, that:                     a woman from among the people of Yemen came to the Messenger of Allah with a daughter of hers, and on the daughter's hand were two thick bangles of gold. He said: \"Do you pay Zakah on these? She said: \"No.\" He said: \"Would it please you if Allah were to put two bangles of fire on you on the Day of Resurrection? \" So she took them of and gave them to the Messenger of Allah and said: \"They are for Allah and His Messenger.\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "11278",
        "19934",
        "19911"
      ]
    },
    {
      "id": "sunan-an-nasai-2484",
      "hadith_no": "2484",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا يزيد بن زريع، قال حدثنا روح بن القاسم، قال حدثني عمرو بن يحيى بن عمارة، عن أبيه، عن أبي سعيد الخدري، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يحل في البر والتمر زكاة حتى تبلغ خمسة أوسق ولا يحل في الورق زكاة حتى تبلغ خمسة أواق ولا يحل في إبل زكاة حتى تبلغ خمس ذود ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Sa'eed Al-Khudri that the Messenger of Allah said:                     \"No Zakah is due on wheat or dates unless the amount reaches five Awsuq. No Zakah is due on silver unless the amount reaches five Awaq. No Zakah is due on camels until the number reaches five Dhawd.\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20304",
        "11586",
        "11210",
        "11232",
        "38"
      ]
    },
    {
      "id": "sunan-an-nasai-2506",
      "hadith_no": "2506",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا يزيد بن زريع، قال أنبأنا شعبة، عن الحكم بن عتيبة، عن القاسم بن مخيمرة، عن عمرو بن شرحبيل، عن قيس بن سعد بن عبادة، قال كنا نصوم عاشوراء ونؤدي زكاة الفطر فلما نزل رمضان ونزلت الزكاة لم نؤمر به ولم ننه عنه وكنا نفعله ‏.‏",
      "text_en": " It was narrated that Qais bin Sa'd bin 'Ubadah Said:                     \"We used to fast on 'Ashura and give Zakatul-Fitr, and when the command to fast in Ramadan was revealed, and the command to give Zakah was revealed, we were neither commanded to give it, nor told not to do so, and we used to do it.\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20304",
        "20020",
        "11069",
        "10812",
        "11644",
        "172"
      ]
    },
    {
      "id": "sunan-an-nasai-2524",
      "hadith_no": "2524",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا الحسين بن محمد الذارع، قال حدثنا يزيد، - وهو ابن زريع - قال حدثنا شعبة، ‏.‏ قال وأنبأنا إسماعيل بن مسعود، قال حدثنا بشر، - وهو ابن المفضل - قال حدثنا شعبة، - واللفظ لبشر - عن قتادة، عن أبي المليح، عن أبيه، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن الله عز وجل لا يقبل صلاة بغير طهور ولا صدقة من غلول ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Al-Malib that his father said:                     \"I heard the Messenger of Allah say: 'Allah, the Mighty and Sublime, does not accept prayer without purification or charity from Ghulul.\"",
      "usc_msa_ref": "",
      "chain": [
        "34059",
        "20304",
        "34033",
        "20212",
        "11019",
        "11453",
        "4001"
      ]
    },
    {
      "id": "sunan-an-nasai-2540",
      "hadith_no": "2540",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد بن الحارث، قال حدثنا حسين المعلم، عن عمرو بن شعيب، أن أباه، حدثه عن عبد الله بن عمرو، قال لما فتح رسول الله صلى الله عليه وسلم مكة قام خطيبا فقال في خطبته ‏\"‏ لا يجوز لامرأة عطية إلا بإذن زوجها ‏\"‏ ‏.‏ مختصر ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin 'Amr said:                     \"When the Messenger of Allah conquered Makkah, he stood up to address the people and said in his Khutbah; 'It is not permissible for a woman to give anything without her husband's permission.\"' (He narrated it) in abridged from.",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20226",
        "11278",
        "19934",
        "19911",
        "29"
      ]
    },
    {
      "id": "sunan-an-nasai-2553",
      "hadith_no": "2553",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أنبأنا إسماعيل بن مسعود، قال حدثنا خالد، قال حدثنا شعبة، أن عمرو بن مرة، حدثهم عن خيثمة، عن عدي بن حاتم، قال ذكر رسول الله صلى الله عليه وسلم النار فأشاح بوجهه وتعوذ منها ذكر شعبة أنه فعله ثلاث مرات - ثم قال ‏\"‏ اتقوا النار ولو بشق التمرة فإن لم تجدوا فبكلمة طيبة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Adiyy bin Hatim said:                     \"The Messenger of Allah mentioned the Fire, and he turned his face away (as if seeing it), and sought refuge with Allah from it.\" (One of the narrators) Shu'bah said: \"He did that three times, then he said: 'Protect yourselves from the Fire even with half a date, and if you cannot find that, then with a good word.\"'",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "20020",
        "11381",
        "11332",
        "212"
      ]
    },
    {
      "id": "sunan-an-nasai-2679",
      "hadith_no": "2679",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا يزيد بن زريع، قال أنبأنا أيوب، عن عمرو، عن جابر بن زيد، عن ابن عباس، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إذا لم يجد إزارا فليلبس السراويل وإذا لم يجد النعلين فليلبس الخفين وليقطعهما أسفل من الكعبين ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"I heard the Messenger of Allah say; 'If you cannot find an Izar then wear pants, and if you cannot find sandals then wear khuffs, but cut them so that they come lower than the ankles.",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20304",
        "11015",
        "11081",
        "11271",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-2785",
      "hadith_no": "2785",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، قال حدثنا شعبة، عن منصور، قال سمعت إبراهيم، عن الأسود، عن عائشة، قالت كنت أفتل قلائد هدى رسول الله صلى الله عليه وسلم غنما ‏.‏",
      "text_en": " It was narrated that Aishah said:                     \"I used to twist the garlands for the sacrificial sheep of the Messenger of Allah.\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "20020",
        "11067",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-2786",
      "hadith_no": "2786",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، قال حدثنا شعبة، عن سليمان، عن إبراهيم، عن الأسود، عن عائشة، أن رسول الله صلى الله عليه وسلم كان يهدي الغنم ‏.‏",
      "text_en": " It was narrated from Aishah:                     That the Messenger of Allah used to send sheep as a Hadi,",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "20020",
        "11060",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-2902",
      "hadith_no": "2902",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا إسماعيل بن مسعود، ومحمد بن عبد الأعلى، عن خالد، عن شعبة، عن أبي إسحاق، عن الأسود، أن أم المؤمنين، قالت إن رسول الله صلى الله عليه وسلم قال ‏\"‏ لولا أن قومي - وفي حديث محمد قومك - حديث عهد بجاهلية لهدمت الكعبة وجعلت لها بابين ‏\"‏ ‏.‏ فلما ملك ابن الزبير جعل لها بابين ‏.‏",
      "text_en": " It was narrated from Al-Aswad that the Mother of the Believers said:                     \"The Messenger of Allah said: \"Were it not for the fact that my people' - according to the narration of Muhammad he said: 'Your people' - 'have recently left Jailiyyah, I would have knocked down the House and given it two doors.'\" When Ibn Az-Zubair was in power, he gave it two doors.",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "30449",
        "20423",
        "20020",
        "11049",
        "11054",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-2916",
      "hadith_no": "2916",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، عن عبد الملك، عن عطاء، عن أسامة، قال خرج رسول الله صلى الله عليه وسلم من البيت صلى ركعتين في قبل الكعبة ثم قال ‏\"‏ هذه القبلة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Usmah said:                     \"The Messenger of Allah came out of the House and prayed two Rakahs in front of the Kabah, then he said: 'This is the Qiblah.'\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "11368",
        "11029",
        "50"
      ]
    },
    {
      "id": "sunan-an-nasai-2948",
      "hadith_no": "2948",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا إسماعيل بن مسعود، ومحمد بن المثنى، قالا حدثنا خالد، قال حدثنا عبيد الله، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم كان لا يستلم إلا الحجر والركن اليماني ‏.‏",
      "text_en": " It was narrated from Ibn Umar:                     The Prophet used to touch only the Stone and the Yemeni Corner. (Sahih)Chatper 157. Touching The Two Yemeni Corners",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "30170",
        "20423",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-2994",
      "hadith_no": "2994",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، قال حدثنا عبد الملك، عن عطاء، عن جابر، قال قدمنا مع رسول الله صلى الله عليه وسلم لأربع مضين من ذي الحجة فقال النبي صلى الله عليه وسلم ‏\"‏ أحلوا واجعلوها عمرة ‏\"‏ ‏.‏ فضاقت بذلك صدورنا وكبر علينا فبلغ ذلك النبي صلى الله عليه وسلم فقال ‏\"‏ يا أيها الناس أحلوا فلولا الهدى الذي معي لفعلت مثل الذي تفعلون ‏\"‏ ‏.‏ فأحللنا حتى وطئنا النساء وفعلنا ما يفعل الحلال حتى إذا كان يوم التروية وجعلنا مكة بظهر لبينا بالحج ‏.‏",
      "text_en": " It was narrated that Jabir said:                      \"We came with the Messenger of Allah on the fourth day of Dhul-Hijjah. The prophet said: 'Exit Ihram and make it Umrah.' We were distressed and upset by that. News of that reached the Messenger of Allah and he said: 'O people, exit Ihram. Were if not for the Hadi that I brought with me, I would have done what you are doing.' So we exited Ihram, and had intercourse with our wives, ad we did everything that the non-Muhrim does until the day of At-Tarwiyah, when we put Makkah behind us (When we headed for Mina) and entered Ihram for Hajj.\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "11368",
        "11029",
        "34"
      ]
    },
    {
      "id": "sunan-an-nasai-3010",
      "hadith_no": "3010",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا إسماعيل بن مسعود، عن خالد، عن شعبة، عن سليمان، عن عمارة بن عمير، عن عبد الرحمن بن يزيد، عن عبد الله، قال كان رسول الله صلى الله عليه وسلم يصلي الصلاة لوقتها إلا بجمع وعرفات ‏.‏",
      "text_en": " It was narrated that Abdullah said:                     \"The Messenger of Allah used to offer prayers at their proper time except in Jam (Al-Muzdalifah) and Arafat.\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "20020",
        "11060",
        "11378",
        "11055",
        "16"
      ]
    },
    {
      "id": "sunan-an-nasai-3042",
      "hadith_no": "3042",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، عن شعبة، عن عبد الله بن أبي السفر، قال سمعت الشعبي، يقول حدثني عروة بن مضرس بن أوس بن حارثة بن لأم، قال أتيت النبي صلى الله عليه وسلم بجمع فقلت هل لي من حج فقال ‏\"‏ من صلى هذه الصلاة معنا ووقف هذا الموقف حتى يفيض وأفاض قبل ذلك من عرفات ليلا أو نهارا فقد تم حجه وقضى تفثه ‏\"‏ ‏.‏",
      "text_en": " Urwah bin Mudarris bin Aws bin Harithah bin La'm said:                     \"I came to the Prophet in Jam (Al-Muzdalifah) and said: 'Is there Hajj for me?' He said: 'Whoever offers this prayer with us and observed this standing until he departed, and he departed before that from Arafat by night or by day, then his Hajj is complete. And he has completed the prescribed duties.'\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "20020",
        "11636",
        "11052",
        "4068"
      ]
    },
    {
      "id": "sunan-an-nasai-3047",
      "hadith_no": "3047",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، قال حدثنا شعبة، عن أبي إسحاق، عن عمرو بن ميمون، قال سمعته يقول شهدت عمر بجمع فقال إن أهل الجاهلية كانوا لا يفيضون حتى تطلع الشمس ويقولون أشرق ثبير وإن رسول الله صلى الله عليه وسلم خالفهم ثم أفاض قبل أن تطلع الشمس ‏.‏",
      "text_en": " It was narrated that Amr bin Maimun aid:                     \"I head him say 'I saw 'Umar in Al-Muzdalifah and he said: The people of the Jahiliyyah would not depart until the sun had risen, and they would say: Shine, O Thabir! The Messenger of Allah differed from them and departed before the sun had risen.",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "20020",
        "11049",
        "11382"
      ]
    },
    {
      "id": "sunan-an-nasai-3136",
      "hadith_no": "3136",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، قال حدثنا شعبة، أن عمرو بن مرة، أخبرهم قال سمعت أبا وائل، قال حدثنا أبو موسى الأشعري، قال جاء أعرابي إلى رسول الله صلى الله عليه وسلم فقال الرجل يقاتل ليذكر ويقاتل ليغنم ويقاتل ليرى مكانه فمن في سبيل الله قال ‏\"‏ من قاتل لتكون كلمة الله هي العليا فهو في سبيل الله عز وجل ‏\"‏ ‏.‏",
      "text_en": " Abu Musa Al-Ash'ari said:                      \"A Bedouin came to the Messenger of Allah (ﷺ) and said: 'A man fights for fame, or he fights for the spoils of war, or he fights to show off. Who is the one who is fighting in the cause of Allah?' He said: 'The one who fights so that the word of Allah will be supreme is the one who is fighting in the cause of Allah, the Mighty and Sublime.'\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "20020",
        "11381",
        "11353",
        "41"
      ]
    },
    {
      "id": "sunan-an-nasai-3185",
      "hadith_no": "3185",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا بشر بن المفضل، عن يونس، عن الحسن، عن صعصعة بن معاوية، قال لقيت أبا ذر قال قلت حدثني ‏.‏ قال نعم قال رسول الله صلى الله عليه وسلم ‏\"‏ ما من عبد مسلم ينفق من كل مال له زوجين في سبيل الله إلا استقبلته حجبة الجنة كلهم يدعوه إلى ما عنده ‏\"‏ ‏.‏ قلت وكيف ذلك قال ‏\"‏ إن كانت إبلا فبعيرين وإن كانت بقرا فبقرتين ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Sa'sa'ah bin Mu'awiyah said:                      \"I met Abu Dharr and said: 'Tell me a Hadith.' He said. Yes, the Messenger of Allah (ﷺ) said: There is no Muslim worshiper who spends from each type of his wealth on a pair (of things) in the cause of Allah, but the keepers of Paradise will welcome him, all of them calling him to what they have (of reward).' I said: \"How is that?\" He said: \"If it is camels, he gives two, and if it is cows, he gives two.'\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20212",
        "20475",
        "11016",
        "18438"
      ]
    },
    {
      "id": "sunan-an-nasai-3198",
      "hadith_no": "3198",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا إسماعيل بن مسعود، عن يزيد، - وهو ابن زريع - قال حدثنا سعيد، عن قتادة، أن أنسا، حدثهم أن النبي صلى الله عليه وسلم كان يطوف على نسائه في الليلة الواحدة وله يومئذ تسع نسوة ‏.‏",
      "text_en": " Narrated Anas:                     Anas narrated that the Prophet used to go around to his wives in a single night, and at that time he had nine wives.",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20304",
        "11168",
        "11019"
      ]
    },
    {
      "id": "sunan-an-nasai-3213",
      "hadith_no": "3213",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، عن أشعث، عن الحسن، عن سعد بن هشام، عن عائشة، أن رسول الله صلى الله عليه وسلم نهى عن التبتل ‏.‏",
      "text_en": " Narrated 'Aishah:                     It was narrated from 'Aishah that the Messenger of Allah forbade celibacy.",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "11324",
        "11016",
        "11166",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-3226",
      "hadith_no": "3226",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، عن عبد الملك، عن عطاء، عن جابر، أنه تزوج امرأة على عهد رسول الله صلى الله عليه وسلم فلقيه النبي صلى الله عليه وسلم فقال ‏\"‏ أتزوجت يا جابر ‏\"‏ ‏.‏ قال قلت نعم قال ‏\"‏ بكرا أم ثيبا ‏\"‏ ‏.‏ قال قلت بل ثيبا ‏.‏ قال ‏\"‏ فهلا بكرا تلاعبك ‏\"‏ ‏.‏ قال قلت يا رسول الله كن لي أخوات فخشيت أن تدخل بيني وبينهن ‏.‏ قال ‏\"‏ فذاك إذا إن المرأة تنكح على دينها ومالها وجمالها فعليك بذات الدين تربت يداك ‏\"‏ ‏.‏",
      "text_en": " Narrated Jabir:                     It was narrated from Jabir that he married a woman at the time of the Messenger of Allah, and the Prophet met him and said: \"Have you got married, O Jabir?\" He said: 'Yes.' He said: 'A virgin or a previously-married woman?' I said: 'A previously-married woman.' He said: 'Why not a virgin who would play with you?' I said: 'O Messenger of Allah, I have sisters, and I did not want her to come between them and I.' He said: 'That's better then. A woman may be married for her religious commitment, her wealth or her beauty. You should choose the one who is religiously committed, may your hands be rubbed with dust (may you prosper).'\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "11368",
        "11029",
        "34"
      ]
    },
    {
      "id": "sunan-an-nasai-3327",
      "hadith_no": "3327",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا إسماعيل بن مسعود، وحميد بن مسعدة، قالا حدثنا يزيد بن زريع، قال حدثنا ابن عون، عن محمد بن سيرين، عن عبد الرحمن بن بشر بن مسعود، ورد الحديث حتى رده إلى أبي سعيد الخدري قال ذكر ذلك عند رسول الله صلى الله عليه وسلم قال ‏\"‏ وما ذاكم ‏\"‏ ‏.‏ قلنا الرجل تكون له المرأة فيصيبها ويكره الحمل وتكون له الأمة فيصيب منها ويكره أن تحمل منه ‏.‏ قال ‏\"‏ لا عليكم أن لا تفعلوا فإنما هو القدر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdur-Rahman bin Bishr bin Mas'ud, who attributed the Hadith to Abu Sa'eed Al-Khudri, that mention of that (coitus interruptus) was made to the Messenger of Allah and he said:                      \"Why do you do that?\" We said: \"A man may have a wife, and he has intercourse with her, but he does not want her to get pregnant, or he may have a concubine, and he has intercourse with her, but he does not want her to get pregnant.\" He said: \"It does not make any difference if you do that, for it is the matter of Al-Qadr.\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "30430",
        "20304",
        "11071",
        "11035",
        "11877"
      ]
    },
    {
      "id": "sunan-an-nasai-3566",
      "hadith_no": "3566",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Horses, Races and Shooting - كتاب الخيل",
      "chapter_no": "28",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال حدثنا محمد بن جعفر، قال حدثنا شعبة، ح وأنبأنا إسماعيل بن مسعود، قال حدثنا بشر، قال حدثنا شعبة، عن عبد الله بن يزيد، عن أبي زرعة، عن أبي هريرة، قال كان النبي صلى الله عليه وسلم يكره الشكال من الخيل ‏.‏ واللفظ لإسماعيل ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                      The Prophet used to dislike the Shikal among horses. And the wording is that of Isma'il.",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20173",
        "20020",
        "34033",
        "20212",
        "20020",
        "1945",
        "30554",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-3585",
      "hadith_no": "3585",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Horses, Races and Shooting - كتاب الخيل",
      "chapter_no": "28",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، عن ابن أبي ذئب، عن نافع بن أبي نافع، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا سبق إلا في نصل أو حافر أو خف ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah said:                      \"There should be no awards (for victory in a competition) except for arrows, camels or horses.\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "20177",
        "19066",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-3600",
      "hadith_no": "3600",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Endowments - كتاب الإحباس",
      "chapter_no": "29",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا بشر، عن ابن عون، قال وأنبأنا حميد بن مسعدة، قال حدثنا بشر، قال حدثنا ابن عون، عن نافع، عن ابن عمر، قال أصاب عمر أرضا بخيبر فأتى النبي صلى الله عليه وسلم فاستأمره فيها فقال إني أصبت أرضا كثيرا لم أصب مالا قط أنفس عندي منه فما تأمر فيها قال ‏\"‏ إن شئت حبست أصلها وتصدقت بها ‏\"‏ ‏.‏ فتصدق بها - على أنه لا تباع ولا توهب - فتصدق بها في الفقراء والقربى وفي الرقاب وفي سبيل الله وابن السبيل والضيف لا جناح - يعني - على من وليها أن يأكل أو يطعم صديقا غير متمول اللفظ لإسماعيل ‏.‏",
      "text_en": " It was narrated from Bishr, from Ibn 'Awn, from Nafi', from Ibn 'Umar who said:                      \"Umar acquired some land at Khaibar. He came to the Prophet and consulted him about it. He said: 'I have acquired a great deal of land, and I have never acquired any wealth that is more precious to me than it. What do you command me to do with it?' He said: 'If you wish, you may freeze it and give it in charity.' So he gave it in charity on condition that it would not be sold or given away, and he gave it in charity to the poor, relatives, to emancipate slaves, for the cause of Allah, for wayfarers and guests. There is no sin -on the administrator- if he eats (from it) or feeds a friend, with no intention of becoming wealthy from it.'\" These are the wordings of Isma'il.",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20212",
        "11071",
        "30430",
        "20212",
        "11071",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-3620",
      "hadith_no": "3620",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Wills - كتاب الوصايا",
      "chapter_no": "30",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد بن الحارث، قال حدثنا مالك بن مغول، قال حدثنا طلحة، قال سألت ابن أبي أوفى أوصى رسول الله صلى الله عليه وسلم قال لا‏.‏ قلت كيف كتب على المسلمين الوصية قال أوصى بكتاب الله‏.‏",
      "text_en": " Talha said:                      \"I asked Ibn Abi Awfa: 'Did the Messenger of Allah leave a will?' He said: 'No.' I said: 'How come it is prescribed for the Muslims to make wills?' He said: 'He left instructions urging the Muslims to adhere to the Book of Allah.'\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20226",
        "20358",
        "11356"
      ]
    },
    {
      "id": "sunan-an-nasai-3642",
      "hadith_no": "3642",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Wills - كتاب الوصايا",
      "chapter_no": "30",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، قال حدثنا سعيد، قال حدثنا قتادة، عن شهر بن حوشب، أن ابن غنم، ذكر أن ابن خارجة، ذكر له أنه شهد رسول الله صلى الله عليه وسلم يخطب الناس على راحلته وإنها لتقصع بجرتها وإن لعابها ليسيل فقال رسول الله صلى الله عليه وسلم في خطبته ‏\"‏ إن الله قد قسم لكل إنسان قسمه من الميراث فلا تجوز لوارث وصية ‏\"‏‏.‏",
      "text_en": " It was narrated from Shahr bin Hawshab that Ibn Ghanm mentioned that Ibn Kharijah told him that he saw the Messenger of Allah addressing the people from atop his mount, which was chewing its cud and its saliva was dripping down. The Messenger of Allah said in his Khutbah:                      \"Allah has given each person a share of the inheritance, and it is not permissible to give bequests to an heir.\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "11168",
        "11019",
        "11044"
      ]
    },
    {
      "id": "sunan-an-nasai-3668",
      "hadith_no": "3668",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Wills - كتاب الوصايا",
      "chapter_no": "30",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، عن حسين، عن عمرو بن شعيب، عن أبيه، عن جده، أن رجلا، أتى النبي صلى الله عليه وسلم فقال إني فقير ليس لي شىء ولي يتيم‏.‏ قال ‏\"‏ كل من مال يتيمك غير مسرف ولا مباذر ولا متأثل ‏\"‏‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from his father, from his grandfather, that a man came to the Prophet and said:                      \"I am poor and I do not have anything, and I have an orphan (under my care).\" He said: \"Eat from the property of your orphan without being extravagant, wasteful or keeping it as capital for yourself.\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "11278",
        "19934",
        "19911"
      ]
    },
    {
      "id": "sunan-an-nasai-3757",
      "hadith_no": "3757",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of 'Umra - كتاب العمرى",
      "chapter_no": "34",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، قال حدثنا حسين المعلم، عن عمرو بن شعيب، أن أباه، حدثه عن عبد الله بن عمرو، ح وأخبرنا حميد بن مسعدة، قال حدثنا يزيد بن زريع، قال حدثنا حسين المعلم، عن عمرو بن شعيب، عن أبيه، عن جده، قال لما فتح رسول الله صلى الله عليه وسلم مكة قام خطيبا فقال في خطبته ‏\"‏ لا يجوز لامرأة عطية إلا بإذن زوجها ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from his father, that his grandfather said:                      \"When the Messenger of Allah conquered Makkah, he stood up to address (the people) and said in his Khutbah: 'It is not permissible for a woman to give (a gift) except with her husband's permission.'\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "11278",
        "19934",
        "19911",
        "29",
        "30430",
        "20304",
        "11278",
        "19934",
        "19911"
      ]
    },
    {
      "id": "sunan-an-nasai-3801",
      "hadith_no": "3801",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، عن شعبة، قال أخبرني منصور، عن عبد الله بن مرة، عن عبد الله بن عمر، أن رسول الله صلى الله عليه وسلم نهى عن النذر وقال ‏\"‏ إنه لا يأتي بخير إنما يستخرج به من البخيل ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin 'Umar that the Messenger of Allah forbade vows and said:                      \"They do not bring any good; they are just a means of taking wealth from the miserly.\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "20020",
        "11067",
        "11362",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-3874",
      "hadith_no": "3874",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "حدثنا إسماعيل بن مسعود، قال حدثنا خالد بن الحارث، قال حدثنا عبد الملك، عن عطاء، عن جابر، أن رسول الله صلى الله عليه وسلم قال ‏‏\"‏‏ من كان له أرض فليزرعها فإن عجز أن يزرعها فليمنحها أخاه المسلم ولا يزرعها إياه ‏‏\"‏‏‏.‏‏",
      "text_en": " It was narrated from 'Ata' from Jabir, that the Messenger of Allah said:                      \"Whoever has land, let him cultivate it. If he is unable to cultivate it, let him give it to his Muslim brother and not share-crop it with him.\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20226",
        "11368",
        "11029",
        "34"
      ]
    },
    {
      "id": "sunan-an-nasai-3897",
      "hadith_no": "3897",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد بن الحارث، عن سعيد، عن يعلى بن حكيم، عن سليمان بن يسار، أن رافع بن خديج، قال كنا نحاقل على عهد رسول الله صلى الله عليه وسلم فزعم أن بعض عمومته أتاه فقال نهاني رسول الله صلى الله عليه وسلم عن أمر كان لنا نافعا وطواعية الله ورسوله أنفع لنا‏.‏‏ قلنا وما ذاك قال قال رسول الله صلى الله عليه وسلم ‏‏\"‏‏ من كانت له أرض فليزرعها أو ليزرعها أخاه ولا يكاريها بثلث ولا ربع ولا طعام مسمى ‏‏\"‏‏‏.‏‏ رواه حنظلة بن قيس عن رافع فاختلف على ربيعة في روايته‏.‏‏",
      "text_en": " It was narrated that Rafi' bin Khadij said:                      \"We used to lease land on the basis of Al-Muhaqalah during the time of the Messenger of Allah.\" He said that one of his paternal uncles came to them and said: \"The Messenger of Allah has forbidden me to do something that was beneficial for us, but obedience to Allah and His Messenger is more beneficial.\" We said: \"What is that?\" He said: \"The Messenger of Allah said: 'Whoever has land, let him cultivate it (himself) or give it to his brother to cultivate, and not lease it in return for one-third or one-quarter of the yield nor a specified amount of food (produce).'\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20226",
        "11168",
        "11567",
        "11005",
        "1986"
      ]
    },
    {
      "id": "sunan-an-nasai-3913",
      "hadith_no": "3913",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، - وهو ابن الحارث - قال حدثنا عبيد الله بن عمر، عن نافع، أن رجلا، أخبر ابن عمر، أن رافع بن خديج، يأثر في كراء الأرض حديثا فانطلقت معه أنا والرجل الذي أخبره حتى أتى رافعا فأخبره رافع أن رسول الله صلى الله عليه وسلم نهى عن كراء الأرض‏.‏‏ فترك عبد الله كراء الأرض‏.‏‏",
      "text_en": " It was narrated from Nafi':                      \"A man told Ibn 'Umar that Rafi' bin Khadij had narrated a Hadith concerning leasing of land. He and I, along with the man who had told him that, went to Rafi', and he told us that the Messenger of Allah had forbidden leasing land. So 'Abdullah stopped leasing land.\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20226",
        "11201",
        "11014",
        "18",
        "1986"
      ]
    },
    {
      "id": "sunan-an-nasai-3947",
      "hadith_no": "3947",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Kind Treatment of Women - كتاب عشرة النساء",
      "chapter_no": "36",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا بشر، - يعني ابن المفضل - قال حدثنا شعبة، عن عمرو بن مرة، ‏{‏ عن مرة، ‏}‏ عن أبي موسى، عن النبي صلى الله عليه وسلم قال ‏\"‏ فضل عائشة على النساء كفضل الثريد على سائر الطعام ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Musa that the Prophet said:                      \"The superiority of 'Aishah to other women is like the superiority of Tharid to other kinds of food.\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20212",
        "20020",
        "11381",
        "41"
      ]
    },
    {
      "id": "sunan-an-nasai-4024",
      "hadith_no": "4024",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا يزيد بن زريع، عن حجاج الصواف، قال حدثنا أبو رجاء، مولى أبي قلابة قال حدثنا أبو قلابة، قال حدثني أنس بن مالك، أن نفرا، من عكل ثمانية قدموا على النبي صلى الله عليه وسلم فاستوخموا المدينة وسقمت أجسامهم فشكوا ذلك إلى رسول الله صلى الله عليه وسلم فقال ‏\"‏ ألا تخرجون مع راعينا في إبله فتصيبوا من ألبانها وأبوالها ‏\"‏ ‏.‏ قالوا بلى ‏.‏ فخرجوا فشربوا من ألبانها وأبوالها فصحوا فقتلوا راعي رسول الله صلى الله عليه وسلم فبعث فأخذوهم فأتي بهم فقطع أيديهم وأرجلهم وسمر أعينهم ونبذهم في الشمس حتى ماتوا ‏.‏",
      "text_en": " Anas bin Malik narrated that:                     A group of eighty people from 'Ukl came to the Prophet [SAW], but the climate of Al-Madinah did not suit them and they fell sick. They complained about that to the Messenger of Allah [SAW] and he said: \"Why don't you go out with our herdsmen and drink the milk and urine of the camels?\" They said: \"Yes (we will do that).\" They went out and drank some of the (camels') milk and urine, and they recovered. Then they killed the herdsman of the Messenger of Allah [SAW], so he sent (men after them) and they caught them and brought them back. He had their hands and feet cut off and branded their eyes, and left them in the sun to die.",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20304",
        "11047",
        "19"
      ]
    },
    {
      "id": "sunan-an-nasai-4249",
      "hadith_no": "4249",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of al-Fara' and al-'Atirah - كتاب الفرع والعتيرة",
      "chapter_no": "41",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا بشر، - يعني ابن المفضل - قال حدثنا شعبة، عن الحكم، عن ابن أبي ليلى، عن عبد الله بن عكيم، قال قرئ علينا كتاب رسول الله صلى الله عليه وسلم وأنا غلام شاب ‏\"‏ أن لا تنتفعوا من الميتة بإهاب ولا عصب ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin 'Ukaim said:                     \"The letter of the Messenger of Allah was read to us when I was a young boy: 'Do not make use of the skins and sinew of dead animals.\"'",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20212",
        "20020",
        "11069",
        "11196",
        "10786"
      ]
    },
    {
      "id": "sunan-an-nasai-4265",
      "hadith_no": "4265",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا أبو عبد الصمد عبد العزيز بن عبد الصمد، قال حدثنا منصور، عن إبراهيم، عن همام بن الحارث، عن عدي بن حاتم، أنه سأل رسول الله صلى الله عليه وسلم فقال أرسل الكلب المعلم فيأخذ ‏.‏ فقال ‏\"‏ إذا أرسلت الكلب المعلم وذكرت اسم الله عليه فأخذ فكل ‏\"‏ ‏.‏ قلت وإن قتل قال ‏\"‏ وإن قتل ‏\"‏ ‏.‏ قلت أرمي بالمعراض ‏.‏ قال ‏\"‏ إذا أصاب بحده فكل وإذا أصاب بعرضه فلا تأكل ‏\"‏ ‏.‏",
      "text_en": " It was Narrated from 'Adiyy bin Hatim the he asked the Messenger of Allah :                     \"I release my trained dog and he catches (game).\" He said: \"If you release the trained dog and you say the name of Allah over him, and he catches (something), then eat.\" I said: \"Even if he kills it?\" He said: shoot with the Mirad.\" He said: \"If it hits (the game) with its sharp point, then eat, but if it hits it with its broad side, then do not eat\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20251",
        "11067",
        "11051",
        "11400",
        "212"
      ]
    },
    {
      "id": "sunan-an-nasai-4301",
      "hadith_no": "4301",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، وإسماعيل بن مسعود، قالا حدثنا خالد، عن شعبة، عن أبي بشر، عن سعيد بن جبير، عن عدي بن حاتم، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا رأيت سهمك فيه ولم تر فيه أثرا غيره وعلمت أنه قتله فكل ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Adiyy bin Hatim that the Messenger of Allah said:                     \"If you see your arrow in it. And you do not see any other mark, and you know that (Your arrow) killed it, then eat it.\"",
      "usc_msa_ref": "",
      "chain": [
        "30449",
        "34033",
        "20423",
        "20020",
        "11419",
        "11050",
        "212"
      ]
    },
    {
      "id": "sunan-an-nasai-4312",
      "hadith_no": "4312",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، عن شعبة، عن هشام، - وهو ابن زيد - قال سمعت أنسا، يقول أنفجنا أرنبا بمر الظهران فأخذتها فجئت بها إلى أبي طلحة فذبحها فبعثني بفخذيها ووركيها إلى النبي صلى الله عليه وسلم فقبله ‏.‏",
      "text_en": " Anas said:                     \"We disturbed a rabbit in Marr Az-Zahran so I  caught it, and brought it to Abu Talhah  who slaughtered it, and sent me with its thighs and haunches to the Prophet and he accepted it.\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "20020",
        "11228",
        "19"
      ]
    },
    {
      "id": "sunan-an-nasai-4318",
      "hadith_no": "4318",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، قال حدثنا شعبة، عن أبي بشر، عن سعيد بن جبير، عن ابن عباس، قال أهدت خالتي إلى رسول الله صلى الله عليه وسلم أقطا وسمنا وأضبا فأكل من الأقط والسمن وترك الأضب تقذرا وأكل على مائدة رسول الله صلى الله عليه وسلم ولو كان حراما ما أكل على مائدة رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"My maternal aunt gave some cottage cheese, cooking fat, and mastigures to the Messenger of Allah He ate some of the cottage cheese and cooking fat, and left the mastigures, as he found them distasteful. But they were eaten upon the table-spread of the Messenger of Allah and if they were Haram they would not have been eaten upon the table-spread of the Messenger of Allah and he would not have told others to eat them.\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "20020",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-4348",
      "hadith_no": "4348",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا إسماعيل بن مسعود، عن بشر، - هو ابن المفضل - قال حدثنا سعيد، عن علي بن الحكم، عن ميمون بن مهران، عن سعيد بن جبير، عن ابن عباس، أن نبي الله صلى الله عليه وسلم نهى يوم خيبر عن كل ذي مخلب من الطير وعن كل ذي ناب من السباع ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that:                     on the Day of Khaibar, the Prophet of Allah forbade eating any birds with talons and any predators with fangs. (Daif)",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20212",
        "11168",
        "11012",
        "11050",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-4369",
      "hadith_no": "4369",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، عن شعبة، عن سليمان بن عبد الرحمن، مولى بني أسد عن أبي الضحاك، عبيد بن فيروز مولى بني شيبان قال قلت للبراء حدثني عما، نهى عنه رسول الله صلى الله عليه وسلم من الأضاحي ‏.‏ قال قام رسول الله صلى الله عليه وسلم ويدي أقصر من يده فقال ‏\"‏ أربع لا يجزن العوراء البين عورها والمريضة البين مرضها والعرجاء البين ظلعها والكسيرة التي لا تنقي ‏\"‏ ‏.‏ قلت إني أكره أن يكون في القرن نقص وأن يكون في السن نقص ‏.‏ قال ما كرهته فدعه ولا تحرمه على أحد ‏.‏",
      "text_en": " It was narrated that Abu Ad-Dahhak 'Ubaid bin Fairuz, the freed slave of Banu Shaiban, said:                     \"IU said to Al-Bara bin Azib: 'Tell me of the sacrificial animals that the Messenger of Allah disliked or forbade, He said: The Messenger of Allah stood up, and my hands are shorter than his, and he said:  \"There are four that will not do as sacrifices: the animals that clearly has one bad eye: the sick animals that is obviously sick; the lame animal with an obvious limp; and the animal that is so emaciated that it is as if three is no marrow in its bones.\"' I said: \"I dislike that the animals should have some fault in its horns or teeth' He said;'what you dislike, forget about it and do not make it for bidden to anyone.\"\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "20020"
      ]
    },
    {
      "id": "sunan-an-nasai-4381",
      "hadith_no": "4381",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، قال حدثنا هشام، عن يحيى بن أبي كثير، عن بعجة بن عبد الله الجهني، عن عقبة بن عامر، قال قسم رسول الله صلى الله عليه وسلم بين أصحابه أضاحي فأصابني جذعة فقلت يا رسول الله أصابتني جذعة ‏.‏ فقال ‏\"‏ ضح بها ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Uqbah bin 'Amir said:                     \"The Messenger of Allah divided some sacrificial animals among his Companions, and I got a Jadh'ah sheep. I said: 'O Messenger of Allah, I got a Jadh'ah sheep.' He said: 'Sacrifice it.\"\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "20295",
        "11449",
        "10893",
        "189"
      ]
    },
    {
      "id": "sunan-an-nasai-4388",
      "hadith_no": "4388",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا حاتم بن وردان، عن أيوب، عن محمد بن سيرين، عن أنس بن مالك، قال خطبنا رسول الله صلى الله عليه وسلم يوم أضحى وانكفأ إلى كبشين أملحين فذبحهما ‏.‏ مختصر ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                     \"The Messenge of Allah addressed us on the Day of Sacrifice, and he went toward two Amlah rams and sacrificed them.\" An abridgment. (Sahih )",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "11015",
        "11035",
        "19"
      ]
    },
    {
      "id": "sunan-an-nasai-4401",
      "hadith_no": "4401",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، وإسماعيل بن مسعود، عن خالد، عن شعبة، عن سماك، قال سمعت مري بن قطري، عن عدي بن حاتم، قال قلت يا رسول الله إني أرسل كلبي فآخذ الصيد فلا أجد ما أذكيه به فأذبحه بالمروة وبالعصا ‏.‏ قال ‏\"‏ أنهر الدم بما شئت واذكر اسم الله عز وجل ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Adiyy bin Hatim said:                     \"I said: 'O Messenger of Allah, I release my dog and I catch the game, but I cannot find anything to slaughter it with, so I slaughter it with a Marwah or a stick,; He said: 'Shed the blood with whatever you wish, and say the name of Allah.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30449",
        "34033",
        "20423",
        "20020",
        "10770",
        "19879",
        "212"
      ]
    },
    {
      "id": "sunan-an-nasai-4409",
      "hadith_no": "4409",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، عن شعبة، عن سعيد بن مسروق، عن عباية بن رافع، عن رافع، قال قلت يا رسول الله إنا لاقو العدو غدا وليس معنا مدى ‏.‏ قال ‏\"‏ ما أنهر الدم وذكر اسم الله عز وجل فكل ما خلا السن والظفر ‏\"‏ ‏.‏ قال فأصاب رسول الله صلى الله عليه وسلم نهبا فند بعير فرماه رجل بسهم فحبسه فقال ‏\"‏ إن لهذه النعم - أو قال الإبل - أوابد كأوابد الوحش فما غلبكم منها فافعلوا به هكذا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Rafi said:                     \"I said: 'O Messenger of Allah, we are going to meet the enemy tomorrow, and we do not have any knives.' He said: 'If the blood is shed and the name of Allah is mentioned, then eat, unlike (it is slaughtered) with teeth or nails.\" Then the Messenger of Allah got some spoils of war and a camel ran away. A man shot and arrow at it and stopped it. He (the Prophet) said; 'Some of these animals - or 'these camels'- 'are untamed like wild animals, so if one of them goes out of your control, do the same.\"' (Sahih )",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "20020",
        "20016"
      ]
    },
    {
      "id": "sunan-an-nasai-4415",
      "hadith_no": "4415",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، عن شعبة، أخبرني قتادة، قال سمعت أنسا، قال ضحى رسول الله صلى الله عليه وسلم بكبشين أملحين أقرنين يكبر ويسمي ولقد رأيته يذبحهما بيده واضعا على صفاحهما قدمه ‏.‏ قلت أنت سمعته منه قال نعم ‏.‏",
      "text_en": " Anas said:                     \"The Messenger of Allah sacrificed two horned, Amlah rams, saying: 'Allah Akbar and pronouncing the Name of Allah. I saw him slaughtering them with his own hand, and placing his foot on their sides.\" I said: You heard it from Him? He said: Yes. (Sahih )",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "20020",
        "11019",
        "19"
      ]
    },
    {
      "id": "sunan-an-nasai-4439",
      "hadith_no": "4439",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، عن شعبة، عن هشام بن زيد، قال دخلت مع أنس على الحكم - يعني ابن أيوب - فإذا أناس يرمون دجاجة في دار الأمير فقال نهى رسول الله صلى الله عليه وسلم أن تصبر البهائم ‏.‏",
      "text_en": " It was narrated that Hisham bin Zaid said;\"Ans and I entered upon Al-Hakam - that it, Ibn Ayyb - and there were some people shooting at a chicken in the house of the governor. He said:                      'The Messenger of Allah forbade using animals as targets;'",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "20020",
        "11228"
      ]
    },
    {
      "id": "sunan-an-nasai-4448",
      "hadith_no": "4448",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، قال حدثنا هشام، قال حدثنا قتادة، عن عكرمة، عن ابن عباس، قال نهى رسول الله صلى الله عليه وسلم عن المجثمة ولبن الجلالة والشرب من في السقاء ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"The Messenger of Allah forbade (eating) animals that had been taken as targets, the milk of Al-Jallalah (animals that eat dung), and drinking directly from water skins.\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "20295",
        "11019",
        "11023",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-4554",
      "hadith_no": "4554",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا نصر بن علي، وإسماعيل بن مسعود، - واللفظ له - عن خالد، قال حدثنا سعيد، عن قتادة، عن سعيد بن المسيب، عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم أتي بتمر ريان - وكان تمر رسول الله صلى الله عليه وسلم بعلا فيه يبس - فقال ‏\"‏ أنى لكم هذا ‏\"‏ ‏.‏ قالوا ابتعناه صاعا بصاعين من تمرنا فقال ‏\"‏ لا تفعل فإن هذا لا يصح ولكن بع تمرك واشتر من هذا حاجتك ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Sa'eed Al-udri that:                     some dates from trees that were irrigated artificially were brought to the Messenger of Allah and the dates of the messenger of Allah were dates from trees that were nourished by their roots.  He said: \"Where did you get these from?\" They said: \"We bought a Sa of them for two Sa s of our dates: He said: \"Do not do that, for this is not right. Rather sell your dates and but what you need of these,\"",
      "usc_msa_ref": "",
      "chain": [
        "30395",
        "34033",
        "20423",
        "11168",
        "11019",
        "11002",
        "38"
      ]
    },
    {
      "id": "sunan-an-nasai-4555",
      "hadith_no": "4555",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "حدثني إسماعيل بن مسعود، قال حدثنا خالد، قال حدثنا هشام، عن يحيى بن أبي كثير، عن أبي سلمة بن عبد الرحمن، قال حدثنا أبو سعيد الخدري، قال كنا نرزق تمر الجمع على عهد رسول الله صلى الله عليه وسلم فنبيع الصاعين بالصاع فبلغ ذلك رسول الله صلى الله عليه وسلم فقال ‏\"‏ لا صاعى تمر بصاع ولا صاعى حنطة بصاع ولا درهما بدرهمين ‏\"‏ ‏.‏",
      "text_en": " A Abu Sa 'eed al- Khudri said:                     \"We used to be given mixed dates during the time of the Messenger of Allah and we would sell two Sa s for one Sa News of that reached the Messenger of Allah and he said Do not sell) two Sa s of dates for a Sa, or two Sa s of wheat for s Sa or a Dirham for two Dirhams. ,\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "20295",
        "11449",
        "10567",
        "38"
      ]
    },
    {
      "id": "sunan-an-nasai-4562",
      "hadith_no": "4562",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا بشر بن المفضل، قال حدثنا سلمة بن علقمة، عن محمد، قال حدثني مسلم بن يسار، وعبد الله بن عبيد، قالا جمع المنزل بين عبادة بن الصامت وبين معاوية فقال عبادة نهى رسول الله صلى الله عليه وسلم أن نبيع الذهب بالذهب والورق بالورق والبر بالبر والشعير بالشعير والتمر بالتمر - قال أحدهما والملح بالملح ولم يقل الآخر - إلا سواء بسواء مثلا بمثل - قال أحدهما من زاد أو ازداد فقد أربى ولم يقل الآخر - وأمرنا أن نبيع الذهب بالورق والورق بالذهب والبر بالشعير والشعير بالبر يدا بيد كيف شئنا فبلغ هذا الحديث معاوية فقام فقال ما بال رجال يحدثون أحاديث عن رسول الله صلى الله عليه وسلم قد صحبناه ولم نسمعه منه ‏.‏ فبلغ ذلك عبادة بن الصامت فقام فأعاد الحديث فقال لنحدثن بما سمعناه من رسول الله صلى الله عليه وسلم وإن رغم معاوية ‏.‏ خالفه قتادة رواه عن مسلم بن يسار عن أبي الأشعث عن عبادة ‏.‏",
      "text_en": " Muslim bin Yasar and 'Abdullah bin 'Ubaid said:                     \"Ubadah bin As-Samit and Muawiyah met at a stopping place on the road. 'Ubadah said: 'The Messenger of Allah forbade us to sell gold for gold, silver for silver, wheat for wheat, barley for barley, dates for dates\"' - one of them said: \"salt for salt, \" but the other did not say \"unless it was equal amount for equal amount, like for like.\" One of them said: \"Whoever gives more or takes more has engaged in Riba,\" but the other one did not say it. \"And the commanded us to sell gold for silver and silver for gold, and wheat for barley and barley for wheat, hand to hand, however we wanted.' News of this hadith reached Muawiyah and he stood up and said: 'What is the matter with men who narrate Hadiths from the Messenger of Allah when we accompanied him and we never heard him say it? News of that reached 'Ubadah bin As-Samit and he stood up and repeated the Hadith, then he said: 'We will narrate what we heard from the Messenger of Allah, whether Muawiyah likes it or not.\"' Qatadah contradicted him, he reported it from Muslim bin Yasar, from Abu Al-=Ashath, from 'Ubadah.",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20212",
        "11593",
        "11035",
        "13118"
      ]
    },
    {
      "id": "sunan-an-nasai-4565",
      "hadith_no": "4565",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، عن سليمان بن علي، أن أبا المتوكل، مر بهم في السوق فقام إليه قوم أنا منهم قال قلنا أتيناك لنسألك عن الصرف ‏.‏ قال سمعت أبا سعيد الخدري قال له رجل ما بينك وبين رسول الله صلى الله عليه وسلم غير أبي سعيد الخدري قال ليس بيني وبينه غيره ‏.‏ قال فإن الذهب بالذهب والورق بالورق - قال سليمان أو قال والفضة بالفضة - والبر بالبر والشعير بالشعير والتمر بالتمر والملح بالملح سواء بسواء فمن زاد على ذلك أو ازداد فقد أربى والآخذ والمعطي فيه سواء ‏.‏",
      "text_en": " It was narrated from Sulaiman bin Ali:                     \"Abu Al-Mutawakkil passed by them in the market and some people, including me, stood up to greet him. We said: 'We have come to you to ask you about transactions.' He said: 'I heard a man say to Abu Saeed Al-Khudri': 'Is there anyone between you and the Messenger of Allah (in the chain of narrators) apart from Abu Saeed Al-Khudri? He said: 'There is no one else between him and I. He said: Gold for gold, silver for silver, wheat for wheat, barley for barley, dates for dates, salt for salt, equal amounts. Whoever gives more than that or takes more has engaged in Riba, and the taker and the giver are the same.\"'",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "38"
      ]
    },
    {
      "id": "sunan-an-nasai-4571",
      "hadith_no": "4571",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا حميد بن مسعدة، وإسماعيل بن مسعود، قالا حدثنا يزيد، - وهو ابن زريع - قال حدثنا ابن عون، عن نافع، عن أبي سعيد الخدري، قال بصر عيني وسمع أذني، من رسول الله صلى الله عليه وسلم فذكر النهى عن الذهب بالذهب والورق بالورق إلا سواء بسواء مثلا بمثل ‏\"‏ ولا تبيعوا غائبا بناجز ولا تشفوا أحدهما على الآخر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Saeed Al-Khudri said:                     \"My eyes saw and my ears heard the Messenger of Allah. And he mentioned the prohibition of (selling) gold for gold and silver for silver, unless it is equal amounts, like for like. And do not sell it in return for something to be paid later, and do not differentiate.\"",
      "usc_msa_ref": "",
      "chain": [
        "30430",
        "34033",
        "20304",
        "11071",
        "11014",
        "38"
      ]
    },
    {
      "id": "sunan-an-nasai-4610",
      "hadith_no": "4610",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، قال حدثنا هشام، قال حدثنا قتادة، عن أنس بن مالك، أنه مشى إلى رسول الله صلى الله عليه وسلم بخبز شعير وإهالة سنخة ‏.‏ قال ولقد رهن درعا له عند يهودي بالمدينة وأخذ منه شعيرا لأهله ‏.‏",
      "text_en": " It was narrated from Anas bin Malik that he brought some barley bread and rancid oil to the Messenger of Allah. He said:                     \"He put his armor in pledge for that with a Jew in Al-Madinah, and he took some barley from him for his family.",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "20295",
        "11019",
        "19"
      ]
    },
    {
      "id": "sunan-an-nasai-4629",
      "hadith_no": "4629",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا إسماعيل بن مسعود، عن خالد، عن حسين المعلم، عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم نهى عن سلف وبيع وشرطين في بيع وربح ما لم يضمن ‏.‏",
      "text_en": " It was narrated from 'Amr bin shu'aib, from his father, from his grandfather, that:                     the Messenger of Allah prohibited lending on the condition of a sale, or to have two conditions in one transaction, or to profit from what you do not posses.",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "11278",
        "19934",
        "19911"
      ]
    },
    {
      "id": "sunan-an-nasai-4657",
      "hadith_no": "4657",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، قال حدثنا عبيد الله، عن عبد الله بن دينار، عن عبد الله، رضى الله عنه أن رسول الله صلى الله عليه وسلم نهى عن بيع الولاء وعن هبته ‏.‏",
      "text_en": " it was narrated from 'Abdullah that:                     the Messenger of Allah forbade selling loyalty or giving it away.",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "11201",
        "11183",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-4715",
      "hadith_no": "4715",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا بشر بن المفضل، قال حدثنا يحيى بن سعيد، عن بشير بن يسار، عن سهل بن أبي حثمة، قال انطلق عبد الله بن سهل ومحيصة بن مسعود بن زيد إلى خيبر وهي يومئذ صلح فتفرقا في حوائجهما فأتى محيصة على عبد الله بن سهل وهو يتشحط في دمه قتيلا فدفنه ثم قدم المدينة فانطلق عبد الرحمن بن سهل وحويصة ومحيصة ابنا مسعود إلى رسول الله صلى الله عليه وسلم فذهب عبد الرحمن يتكلم فقال له رسول الله صلى الله عليه وسلم ‏\"‏ كبر الكبر ‏\"‏ ‏.‏ وهو أحدث القوم فسكت فتكلما فقال رسول الله صلى الله عليه وسلم ‏\"‏ أتحلفون بخمسين يمينا منكم وتستحقون قاتلكم أو صاحبكم ‏\"‏ ‏.‏ فقالوا يا رسول الله كيف نحلف ولم نشهد ولم نر فقال ‏\"‏ أتبرئكم يهود بخمسين ‏\"‏ ‏.‏ فقالوا يا رسول الله كيف نأخذ أيمان قوم كفار فعقله رسول الله صلى الله عليه وسلم من عنده ‏.‏",
      "text_en": " It was narratd that Sahl bin Abi Hatmah said:                     \"Abdullah bin Sahl and Muhayysah bin Mas'ud bin Zaid went to Khaibar, and at that time there was a peace treaty. They went their separatea ways to go about their business, then Muhayysah came upon 'Abdullah bin Sahl lying dead in a pool of blood. He buried him, then he camae to Al-Madinah. 'Abdur-Rahman bin Sahl and Huwhayysah, and Muhayysah, the tow sons of Nas'ud, came to the Messenger of Allah, and \"Abdur-Rahman started to speak, but the Messenger of Allah said: \"Let the elders speak first,\" for he was the youngest of them. So he fell silent and they (the other two) spoke. The Messenger of Allah said: \"Will you sear fifty oaths, then you will receive compensation or be entitled to retaliate?\" They said: \"O Messenger of Allah, how can we a wear and oath when we did not witness and did not see (what happened)\" He said: \"Then can the Jews swear fifty oaths declaring their innocence?\" They said: \"O Messenger of Allah, how can we accept the oath of a disbelieving people?\" So the Messenger of Allah paid the blood money himself.",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20212",
        "11062",
        "11810",
        "1822"
      ]
    },
    {
      "id": "sunan-an-nasai-4727",
      "hadith_no": "4727",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، قال حدثنا حاتم، عن سماك، ذكر أن علقمة بن وائل، أخبره عن أبيه، أنه كان قاعدا عند رسول الله صلى الله عليه وسلم إذ جاء رجل يقود آخر بنسعة فقال يا رسول الله قتل هذا أخي ‏.‏ فقال له رسول الله صلى الله عليه وسلم ‏\"‏ أقتلته ‏\"‏ ‏.‏ قال يا رسول الله لو لم يعترف أقمت عليه البينة ‏.‏ قال نعم قتلته ‏.‏ قال ‏\"‏ كيف قتلته ‏\"‏ ‏.‏ قال كنت أنا وهو نحتطب من شجرة فسبني فأغضبني فضربت بالفأس على قرنه ‏.‏ فقال له رسول الله صلى الله عليه وسلم ‏\"‏ هل لك من مال تؤديه عن نفسك ‏\"‏ ‏.‏ قال يا رسول الله مالي إلا فأسي وكسائي ‏.‏ فقال له رسول الله صلى الله عليه وسلم ‏\"‏ أترى قومك يشترونك ‏\"‏ ‏.‏ قال أنا أهون على قومي من ذاك ‏.‏ فرمى بالنسعة إلى الرجل فقال ‏\"‏ دونك صاحبك ‏\"‏ ‏.‏ فلما ولى قال رسول الله صلى الله عليه وسلم ‏\"‏ إن قتله فهو مثله ‏\"‏ ‏.‏ فأدركوا الرجل فقالوا ويلك إن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن قتله فهو مثله ‏\"‏ ‏.‏ فرجع إلى رسول الله صلى الله عليه وسلم فقال يا رسول الله حدثت أنك قلت ‏\"‏ إن قتله فهو مثله ‏\"‏ ‏.‏ وهل أخذته إلا بأمرك فقال ‏\"‏ ما تريد أن يبوء بإثمك وإثم صاحبك ‏\"‏ ‏.‏ قال بلى ‏.‏ قال ‏\"‏ فإن ذاك ‏\"‏ ‏.‏ قال ذلك كذلك ‏.‏",
      "text_en": " 'Alqamah bin Wa'il narrated from his father that he was sitting with the Messenger of Allah when a man came leading another man by a string. He said:                     \"O Messenger of Allah, this man killed my brother.\" The Messenger of Allah said to him: \"Did you kill him?\" He said: \"O Messenger of Allah even if he did not confess I would have brought proof against him.\" He said: \"Yes, I killed him.\" He said: \"How did you kill him?\" He said: \"He and I were chopping firewood from a tree and he insulted me, so I got angry and struck him with the ax on the forehead.\" The Messenger of Allah said: \"Do you have any wealth with which you can pay the Diyah to save yourself?\" He said: \"O Messenger of Allah, I do not have anything but my ax and my clothes.\" The Messenger of Allah said to him: \"Do you think your people will pay to save you?\" He said: \"I am too insignificant to them for that.\" He threw the string to the man and said: \"Here, thank him.\" When he turned to go, the Messenger of Allah said: \"If he kills him, he will be like him. \"They caught up with the man, and said: \"Woe to you! The Messenger of Allah said: 'If he kills him, he will be like him. \"So he went back to the Messenger of Allah and said: \"O Messenger of Allah, I have been told that you said: 'if he kills him, he will be like him. 'But I only took him because you told me to. He said: 'Don't you want him to carry your sin and the sin of your companion (the victim)?' He said: 'Yes, if that is the case.' He said: 'And that is how it is.\"'",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "20159",
        "10770",
        "10801"
      ]
    },
    {
      "id": "sunan-an-nasai-4747",
      "hadith_no": "4747",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، عن عيينة، قال أخبرني أبي قال، قال أبو بكرة قال رسول الله صلى الله عليه وسلم ‏\"‏ من قتل معاهدا في غير كنهه حرم الله عليه الجنة ‏\"‏ ‏.‏",
      "text_en": " Abu Bakrah said:                     \"The Messenger of Allah said: 'Whoever kills a Mu'ahad with no justification, Allah will forbid Paradise to him.\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "3229"
      ]
    },
    {
      "id": "sunan-an-nasai-4756",
      "hadith_no": "4756",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا حميد بن مسعدة، وإسماعيل بن مسعود، قالا حدثنا بشر، عن حميد، قال ذكر أنس أن عمته، كسرت ثنية جارية فقضى نبي الله صلى الله عليه وسلم بالقصاص فقال أخوها أنس بن النضر أتكسر ثنية فلانة لا والذي بعثك بالحق لا تكسر ثنية فلانة ‏.‏ قال وكانوا قبل ذلك سألوا أهلها العفو والأرش فلما حلف أخوها - وهو عم أنس وهو الشهيد يوم أحد - رضي القوم بالعفو ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ إن من عباد الله من لو أقسم على الله لأبره ‏\"‏ ‏.‏",
      "text_en": " Anas narrated that:                     his paternal aunt broke the front tooth of a girl and the Prophet of Allah decreed retaliation. Her brother, Anas bin An-Nadr, said: \"Will you break the from tooth of so and so? No, by the One Who sent you with the truth, the front tooth of so and so will not be broken!\" Before that, they had asked her family for forgiveness and blood money. When her brother- who was the paternal uncle of Anas and was martyred at Ubud-swore that oath, the people agreed to forgive. The Prophet said: \"There are among the slaves of Allah who, if they swear by Allah who, if they swear by Allah, Allah fulfills their oath.",
      "usc_msa_ref": "",
      "chain": [
        "30430",
        "34033",
        "20212",
        "11279",
        "19"
      ]
    },
    {
      "id": "sunan-an-nasai-4779",
      "hadith_no": "4779",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، عن شعبة، عن هشام بن زيد، عن أنس، أن يهوديا، رأى على جارية أوضاحا فقتلها بحجر فأتي بها النبي صلى الله عليه وسلم وبها رمق فقال ‏\"‏ أقتلك فلان ‏\"‏ ‏.‏ فأشار شعبة برأسه يحكيها أن لا ‏.‏ فقال ‏\"‏ أقتلك فلان ‏\"‏ ‏.‏ فأشار شعبة برأسه يحكيها أن لا ‏.‏ قال ‏\"‏ أقتلك فلان ‏\"‏ ‏.‏ فأشار شعبة برأسه يحكيها أن نعم ‏.‏ فدعا به رسول الله صلى الله عليه وسلم فقتله بين حجرين ‏.‏",
      "text_en": " It was narrated from Anas, that:                     a Jew saw some jewelry on a girl, so he killed her with a rock. She was brought to the Prophet as she was breathing her last, and he said: \"Did so and so kill you?\" - Shu'bah (one of the narrators) gestured with his head, to show that she had gestured no. - He said: \"Did so and so kill you?\" - Shu'bah (one of the narrators) gestured with his head to show that she had gestured no. - He said: \"Did so and so kill you?\" - Shu'bah (one of the narrators) gestured with his head to show that she had gestured yes. - So the Messenger of Allah called for him, and killed him with two rocks.",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "20020",
        "11228",
        "19"
      ]
    },
    {
      "id": "sunan-an-nasai-4796",
      "hadith_no": "4796",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا بشر بن المفضل، عن خالد الحذاء، عن القاسم بن ربيعة، عن يعقوب بن أوس، عن رجل، من أصحاب النبي صلى الله عليه وسلم أن رسول الله صلى الله عليه وسلم لما دخل مكة يوم الفتح قال ‏\"‏ ألا وإن كل قتيل خطإ العمد أو شبه العمد قتيل السوط والعصا منها أربعون في بطونها أولادها ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ya'qub bin Aws, from a man among the Companions of the Prophet that:                     when the Messenger of Allah entered Makkah on the Day of the Conquest, he said: \"Indeed, every accidental killing on purpose, or resembling on purpose - killing with a whip or stick, for it are forty (she-camels) which their young in their wombs.\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20212",
        "11282",
        "14317"
      ]
    },
    {
      "id": "sunan-an-nasai-4850",
      "hadith_no": "4850",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد بن الحارث، قال حدثنا حسين المعلم، عن عمرو بن شعيب، أن أباه، حدثه عن عبد الله بن عمرو، قال لما افتتح رسول الله صلى الله عليه وسلم مكة قال في خطبته ‏\"‏ وفي الأصابع عشر عشر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin 'Amr said:                     \"When the Messenger of Allah conquered Makkah, he said in his Khutbah: \"(The Diyah) for fingers is ten each.\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20226",
        "11278",
        "19934",
        "19911",
        "29"
      ]
    },
    {
      "id": "sunan-an-nasai-4852",
      "hadith_no": "4852",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد بن الحارث، قال حدثنا حسين المعلم، عن عمرو بن شعيب، أن أباه، حدثه عن عبد الله بن عمرو، قال لما افتتح رسول الله صلى الله عليه وسلم مكة قال في خطبته ‏\"‏ وفي المواضح خمس خمس ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib that his father told him that 'Abdullah bin 'Amr said:                      \"When the Messenger of Allah (ﷺ) conquered Makkah , he said in his Khutbah: 'For any wound that exposes the bone, the diyah is five (camels) each.'\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20226",
        "11278",
        "19934",
        "19911",
        "29"
      ]
    },
    {
      "id": "sunan-an-nasai-4981",
      "hadith_no": "4981",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، قال حدثنا شعبة، عن عبد الملك بن عمير، عن عطية، أنه أخبره قال كنت في سبى قريظة وكان ينظر فمن خرج شعرته قتل ومن لم تخرج استحيي ولم يقتل ‏.‏",
      "text_en": " It was narrated that 'Atiyyah said:                     'I was among the prisoners of Quraizah; we were examined, and whoever had grown (pubic) hair was killed, and whoever had not grown hair, he was allowed to live and was not killed.\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "20020",
        "11368"
      ]
    },
    {
      "id": "sunan-an-nasai-5058",
      "hadith_no": "5058",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد بن الحارث، عن كهمس، عن عبد الله بن شقيق، قال كان رجل من أصحاب النبي صلى الله عليه وسلم عاملا بمصر فأتاه رجل من أصحابه فإذا هو شعث الرأس مشعان قال ما لي أراك مشعانا وأنت أمير قال كان نبي الله صلى الله عليه وسلم ينهانا عن الإرفاه ‏.‏ قلنا وما الإرفاه قال الترجل كل يوم ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Shaqiq said:                     \"One of the Companions of the Prophet [SAW] was a governor in Egypt, and one of his companions came to him and found him with unkempt, wild hair. He said: 'How come I see you with wild hair when you are a governor?' He said: 'The Prophet of Allah [SAW] forbade us from Al-Irfah,' and we said: 'What is Al-Irfah?' He said: 'To comb your hair every day.'\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20226",
        "11303",
        "10694"
      ]
    },
    {
      "id": "sunan-an-nasai-5102",
      "hadith_no": "5102",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، عن شعبة، عن الأعمش، قال سمعت عبد الله بن مرة، يحدث عن الحارث، عن عبد الله، قال آكل الربا وموكله وكاتبه إذا علموا ذلك والواشمة والموشومة للحسن ولاوي الصدقة والمرتد أعرابيا بعد الهجرة ملعونون على لسان محمد صلى الله عليه وسلم يوم القيامة ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin Murrah, from Al-Harith, from 'Abdullah, who said:                     \"The one who consumes Riba, the one who pays it, and the one who writes it down, if they know that it is Riba; the woman who does tattoos and the woman who has that done for the purpose of beautification; the one who withholds Sadaqah (Zakah); and the one who reverts to the life of a Bedouin after having emigrated- they will (all) be cursed upon the tongue of Muhammad [SAW] on the Day of Resurrection.\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "20020",
        "11060",
        "11362",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-5126",
      "hadith_no": "5126",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، قال حدثنا ثابت، - وهو ابن عمارة - عن غنيم بن قيس، عن الأشعري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أيما امرأة استعطرت فمرت على قوم ليجدوا من ريحها فهي زانية ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Al-Ash'ari said:                     \"The Messenger of Allah [SAW] said: 'Any woman who puts on perfume then passes by people so that they can smell her fragrance then she is an adulteress.'\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "14048",
        "10710"
      ]
    },
    {
      "id": "sunan-an-nasai-5178",
      "hadith_no": "5178",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا بشر، - وهو ابن المفضل - قال حدثنا عبيد الله، عن نافع، عن ابن حنين، مولى علي عن علي، رضى الله عنه قال نهاني رسول الله صلى الله عليه وسلم عن أربع عن التختم بالذهب وعن لبس القسي وعن قراءة القرآن وأنا راكع وعن لبس المعصفر ‏.‏ ووافقه أيوب إلا أنه لم يسم المولى ‏.‏",
      "text_en": " It was narrated from Ibn Hunain, the freed slave of 'Ali, that 'Ali said:                     \"The Messenger of Allah [SAW] forbade me from four: Gold rings, wearing Al-Qassi, reciting Qur'an while I am bowing, and from wearing garments dyed with safflower.\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20212",
        "11201",
        "11014",
        "5"
      ]
    },
    {
      "id": "sunan-an-nasai-5212",
      "hadith_no": "5212",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا بشر، قال حدثنا عاصم بن كليب، عن أبي بردة، عن علي، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ قل اللهم اهدني وسددني ‏\"‏ ‏.‏ ونهاني أن أضع الخاتم في هذه وهذه وأشار بشر بالسبابة والوسطى ‏.‏ قال وقال عاصم أحدهما ‏.‏",
      "text_en": " It was narrated that 'Ali said:                     \"The Messenger of Allah [SAW] said to me: 'Say: O Allah, guide me and make me steadfast,' and he forbade me to put a ring on this one and this one\" - and Bishr (one of the narrators) pointed to his forefinger and middle finger. And 'Asim said: \"One of the two of them.\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20212",
        "10778",
        "11901",
        "5"
      ]
    },
    {
      "id": "sunan-an-nasai-5215",
      "hadith_no": "5215",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، عن عبيد الله، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم اتخذ خاتما من ذهب وجعل فصه مما يلي كفه فاتخذ الناس خواتيم فطرحه النبي صلى الله عليه وسلم وقال ‏\"‏ لا ألبسه أبدا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that:                     The Messenger of Allah [SAW] put on a ring of gold and put its stone (Fass) toward his palm. Then the people started to wear rings, and the Messenger of Allah [SAW] discarded it and said: \"I will never wear it again.\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-5316",
      "hadith_no": "5316",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، - وهو ابن الحارث - قال حدثنا هشام، عن يحيى بن أبي كثير، عن محمد بن إبراهيم، أن خالد بن معدان، أخبره أن جبير بن نفير أخبره أن عبد الله بن عمرو أخبره أنه، رآه رسول الله صلى الله عليه وسلم وعليه ثوبان معصفران فقال ‏\"‏ هذه ثياب الكفار فلا تلبسها ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah bin 'Amr narrated that:                     The Messenger of Allah [SAW] saw him wearing two garments dyed with safflower and he said: \"This is the clothing of disbelievers; do not wear it.\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20226",
        "20295",
        "11449",
        "11213",
        "11422",
        "4097",
        "29"
      ]
    },
    {
      "id": "sunan-an-nasai-5327",
      "hadith_no": "5327",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا قتيبة بن سعيد، قال حدثنا الليث، عن نافع، ح وأنبأنا إسماعيل بن مسعود، قال حدثنا بشر، قال حدثنا عبيد الله، عن نافع، عن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من جر ثوبه - أو قال إن الذي يجر ثوبه - من الخيلاء لم ينظر الله إليه يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah said:                     \"The Messenger of Allah [SAW] said: 'Whoever drags his garment out of pride, Allah will not look at him on the Day of Resurrection.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "11014",
        "34033",
        "20212",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-5330",
      "hadith_no": "5330",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، - وهو ابن الحارث - قال حدثنا هشام، عن يحيى، عن محمد بن إبراهيم، قال حدثني أبو يعقوب، أنه سمع أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ ما تحت الكعبين من الإزار ففي النار ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah said:                     \"The Messenger of Allah [SAW] said: 'Whatever of the Izar comes below the ankles is in the Fire.'\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20226",
        "20295",
        "11449",
        "11213",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-5445",
      "hadith_no": "5445",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، قال حدثنا شعبة، عن عبد الملك بن عمير، قال سمعت مصعب بن سعد، عن أبيه، قال كان يعلمنا خمسا كان يقول كان رسول الله صلى الله عليه وسلم يدعو بهن ويقولهن ‏\"‏ اللهم إني أعوذ بك من البخل وأعوذ بك من الجبن وأعوذ بك أن أرد إلى أرذل العمر وأعوذ بك من فتنة الدنيا وأعوذ بك من عذاب القبر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abudl-Malik bin 'Umair said:                     \"I heard Mus'ab bin Sa'd (narrate) about his father: 'He used to tech us five things, which he said that the Messenger of Allah [SAW] used to recite in his supplication: 'Allahumma inni a'udhu bika minal-bukhli, wa a'udhu bika minal-jubni, wa a'udhu bika an uradda ila ardhalil-'umuri, wa a'udhu bika min fitnatid-dunya, wa a'udhu bika min 'adhabil-qabr (O Allah, I seek refuge in You from miserliness, and I seek refuge in You from cowardice, and I seek refuge in You from reaching the age of senility, and I seek refuge in You from the trials of this world, and I seek refuge in You from the torment of the grave).'\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "20020",
        "11368",
        "10556",
        "9"
      ]
    },
    {
      "id": "sunan-an-nasai-5566",
      "hadith_no": "5566",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، - يعني ابن الحارث - قال حدثنا هشام، عن يحيى، عن عبد الله بن أبي قتادة، عن أبي قتادة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا تنبذوا الزهو والرطب جميعا ولا البسر والزبيب جميعا وانبذوا كل واحد منهما على حدته ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Qatadah that:                     The Messenger of Allah [SAW] said: \"Do not soak Az-Zahuw and ripe dates together, nor Al-Busr and raisins together. Soak each one of them on its own.\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20226",
        "20295",
        "11449",
        "11804",
        "391"
      ]
    },
    {
      "id": "sunan-an-nasai-5682",
      "hadith_no": "5682",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، قال حدثنا أبان بن صمعة، قال حدثتني والدتي، عن عائشة، أنها سئلت عن الأشربة، فقالت كان رسول الله صلى الله عليه وسلم ينهى عن كل مسكر ‏.‏ واعتلوا بحديث عبد الله بن شداد عن عبد الله بن عباس ‏.‏",
      "text_en": " It was narrated that 'Aishah was asked about drinks and she said:                     \"The Messenger of Allah [SAW] used to forbid all intoxicants.\" And they use the narration of 'Abdullah bin Shaddad from 'Abdullah bin 'Abbas.",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "20529",
        "53"
      ]
    }
  ],
  "total_hadiths": 149
}