{
  "id": "34035",
  "name": "Ayoub bin Muhammad bin Ayoub al-Qalb أيوب بن محمد بن أيوب القلب",
  "full_name": "Ayoub bin Muhammad bin Ayoub al-Qalb أيوب بن محمد بن أيوب القلب",
  "grade": "3rd Century AH [10th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ق  -  ثقة ]"
    ],
    "tags": [
      "B.Hashim",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "24271",
      "name": "Abd al-Qahr bin al-Sry عبد القاهر بن السري السلمي أبو رفاعة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20469",
      "name": "Wadah bin 'Abdullah al-Yashkari وضاح بن عبد الله اليشكري أبو عوانة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20256",
      "name": "'Abdul Wahid bin Ziyad عبد الواحد بن زياد العبدي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "students": [
    {
      "id": "30004",
      "name": "Ibn Maja ابن ماجة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30013",
      "name": "Ibn Abi Dunya ابن أبي الدنيا",
      "grade": "3rd Century AH [12th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "711",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Adhan and the Sunnah Regarding It - كتاب الأذان والسنة فيها",
      "chapter_no": "3",
      "text_ar": "حدثنا أيوب بن محمد الهاشمي، حدثنا عبد الواحد بن زياد، عن حجاج بن أرطاة، عن عون بن أبي جحيفة، عن أبيه، قال أتيت رسول الله  صلى الله عليه وسلم  بالأبطح وهو في قبة حمراء فخرج بلال فأذن فاستدار في أذانه وجعل إصبعيه في أذنيه ‏.‏",
      "text_en": " It was narrated from 'Awn bin Abu Juhaifah that his father said:                     \"I came to the Messenger of Allah in Abtah, when he was in a red tent. Bilal came out and gave the call to prayer, turning around and putting his fingers in his ears.\"",
      "chain": [
        "34035",
        "20256",
        "20580",
        "11383",
        "4047"
      ]
    },
    {
      "hadith_no": "914",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أيوب بن محمد الهاشمي، حدثنا عمر بن رياح، عن عبد الله بن طاوس، عن أبيه، عن ابن عباس، أن رسول الله  صلى الله عليه وسلم  كان يرفع يديه عند كل تكبيرة ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Abbas that the Messenger of Allah (ﷺ)used toraise his hands at every Takbir (saying Allahu Akbar).",
      "chain": [
        "34035",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "3127",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أيوب بن محمد الهاشمي، حدثنا عبد القاهر بن السري السلمي، حدثنا عبد الله بن كنانة بن عباس بن مرداس السلمي، أن أباه، أخبره عن أبيه، أن النبي  صلى الله عليه وسلم  دعا لأمته عشية عرفة بالمغفرة فأجيب إني قد غفرت لهم ما خلا الظالم فإني آخذ للمظلوم منه ‏.‏ قال ‏\"‏ أى رب إن شئت أعطيت المظلوم من الجنة وغفرت للظالم ‏\"‏ ‏.‏ فلم يجب عشيته فلما أصبح بالمزدلفة أعاد الدعاء فأجيب إلى ما سأل ‏.‏ قال فضحك رسول الله  صلى الله عليه وسلم  ‏.‏ أو قال تبسم ‏.‏ فقال له أبو بكر وعمر بأبي أنت وأمي إن هذه لساعة ما كنت تضحك فيها فما الذي أضحكك أضحك الله سنك قال ‏\"‏ إن عدو الله إبليس لما علم أن الله عز وجل قد استجاب دعائي وغفر لأمتي أخذ التراب فجعل يحثوه على رأسه ويدعو بالويل والثبور فأضحكني ما رأيت من جزعه ‏\"‏ ‏.‏",
      "text_en": " ‘Abdullah bin Kinanah bin ‘Abbas bin Mirdas As-Sulami narratedthathis father told him, from his father, that the Messenger ofAllah(ﷺ) prayed for forgiveness for his nation one evening at‘Arafat,and the response came:                      “I have forgiven them, except forthewrongdoer, with whom I will settle the score in favor of the onewhomhe wronged.” He said: “O Lord, if You will, then grantParadise to theone who is wronged, and forgive the wrongdoer.” Noresponse came (thatevening).The next day at Muzdalifah he repeatedthe supplication, andreceived a response to what he asked for. He(the narrator) said: “TheMessenger of Allah (ﷺ) laughed,” orhe said, “He smiled. Abu Bakrand ‘Umar said to him: ‘May myfather and mother be ransomed for you,this is not a time when youusually laugh. What made you laugh, mayAllah make your years filledwith laughter?’ He said: ‘The enemy ofAllah, Iblis, when he cameto know that Allah answered my prayer andforgiven my nation, tooksome dust and started to sprinkle it on hishead, uttering cries ofwoe and doom, and what I saw of his anguishmade me laugh.’”",
      "chain": [
        "34035",
        "24271"
      ]
    }
  ],
  "total_hadiths": 3
}