{
  "id": "34041",
  "name": "Bashr bin Mua'dh al-Qdy بشر بن معاذ العقدي",
  "full_name": "Bashr bin Mua'dh al-Qdy بشر بن معاذ العقدي",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "240",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ ت  س  ق  -  صدوق ]"
    ],
    "tags": [
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "23002",
      "name": "Ibrahim bin 'Abdul 'Aziz bin 'bdul Malik إبراهيم بن عبد العزيز بن عبد الملك",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "24027",
      "name": "Ayoub bin Waqd al-Kwfy أيوب بن واقد الكوفي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20469",
      "name": "Wadah bin 'Abdullah al-Yashkari وضاح بن عبد الله اليشكري أبو عوانة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20304",
      "name": "Yazid bin Zari' يزيد بن زريع",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20028",
      "name": "Jarir bin 'Abdul Hameed al-Razi جرير بن عبد الحميد أبو عبد الله الضبي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20547",
      "name": "Sulaiman bin Da'ud bin al-Jarud سليمان بن داود أبو داود الطيالسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20284",
      "name": "Marhum bin 'Abdul 'Aziz bin Mahran مرحوم بن عبد العزيز بن مهران العطار",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20256",
      "name": "'Abdul Wahid bin Ziyad عبد الواحد بن زياد العبدي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20022",
      "name": "Hammad bin Zayd حماد بن زيد بن درهم الأزدي الأزرق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "students": [
    {
      "id": "30005",
      "name": "Imam Tirmidhi الترمذي محمد بن عيسى بن سورة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30006",
      "name": "Imam Nasa'i أحمد بن شعيب بن علي بن سنان النسائي",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30004",
      "name": "Ibn Maja ابن ماجة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30244",
      "name": "al-Hasan bin al-Sbah al-Bzar الحسن بن الصباح البزار",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "25",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا نصر بن علي الجهضمي، وبشر بن معاذ العقدي، قالا حدثنا بشر بن المفضل، عن عبد الرحمن بن حرملة، عن أبي ثفال المري، عن رباح بن عبد الرحمن بن أبي سفيان بن حويطب، عن جدته، عن أبيها، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا وضوء لمن لم يذكر اسم الله عليه ‏\"‏ ‏.‏ قال وفي الباب عن عائشة وأبي سعيد وأبي هريرة وسهل بن سعد وأنس ‏.‏ قال أبو عيسى قال أحمد بن حنبل لا أعلم في هذا الباب حديثا له إسناد جيد ‏.‏ وقال إسحاق إن ترك التسمية عامدا أعاد الوضوء وإن كان ناسيا أو متأولا أجزأه ‏.‏ قال محمد بن إسماعيل أحسن شيء في هذا الباب حديث رباح بن عبد الرحمن ‏.‏ قال أبو عيسى ورباح بن عبد الرحمن عن جدته عن أبيها ‏.‏ وأبوها سعيد بن زيد بن عمرو بن نفيل ‏.‏ وأبو ثفال المري اسمه ثمامة بن حصين ‏.‏ ورباح بن عبد الرحمن هو أبو بكر بن حويطب ‏.‏ منهم من روى هذا الحديث فقال عن أبي بكر بن حويطب فنسبه إلى جده ‏.‏",
      "text_en": " Rabah bin Abdur-Rahman bin Abi Sufyan bin Huwaitib narrated from his grandmother, from her father; she said (that he said):                     \"I heard Allah's Messenger saying: there is no Wudu for one who does not mention Allah's Name over it.\"",
      "chain": [
        "30395",
        "34041",
        "20212",
        "11878",
        "18108",
        "12091"
      ]
    },
    {
      "hadith_no": "163",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "وحدثنا بشر بن معاذ البصري، قال حدثنا إسماعيل ابن علية، عن ابن جريج، بهذا الإسناد نحوه ‏.‏ وهذا أصح ‏.‏",
      "text_en": " Similar narration is reported by Bishr ibn Mu'adh Al-Bari who said that :                     Isma'il ibn Ulayyah narrated to him from Ibn Juraij. This latter chain is more correct.",
      "chain": [
        "34041",
        "20208",
        "11070"
      ]
    },
    {
      "hadith_no": "178",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة، وبشر بن معاذ، قالا حدثنا أبو عوانة، عن قتادة، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من نسي صلاة فليصلها إذا ذكرها ‏\"‏ ‏.‏ وفي الباب عن سمرة وأبي قتادة ‏.‏ قال أبو عيسى حديث أنس حديث حسن صحيح ‏.‏ ويروى عن علي بن أبي طالب أنه قال في الرجل ينسى الصلاة قال يصليها متى ما ذكرها في وقت أو في غير وقت ‏.‏ وهو قول الشافعي وأحمد بن حنبل وإسحاق ‏.‏ ويروى عن أبي بكرة أنه نام عن صلاة العصر فاستيقظ عند غروب الشمس فلم يصل حتى غربت الشمس ‏.‏ وقد ذهب قوم من أهل الكوفة إلى هذا وأما أصحابنا فذهبوا إلى قول علي بن أبي طالب رضي الله عنه ‏.‏",
      "text_en": " Anas (bin Malik) narrated that :                     Allah's Messenger said: \"Whoever forgets a Salat then he is to pray it when he remembers it.\"",
      "chain": [
        "30367",
        "34041",
        "20469",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "191",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا بشر بن معاذ البصري، حدثنا إبراهيم بن عبد العزيز بن عبد الملك بن أبي محذورة، قال أخبرني أبي وجدي، جميعا عن أبي محذورة، أن رسول الله صلى الله عليه وسلم أقعده وألقى عليه الأذان حرفا حرفا ‏.‏ قال إبراهيم مثل أذاننا ‏.‏ قال بشر فقلت له أعد على ‏.‏ فوصف الأذان بالترجيع ‏.‏ قال أبو عيسى حديث أبي محذورة في الأذان حديث صحيح ‏.‏ وقد روي عنه من غير وجه ‏.‏ وعليه العمل بمكة وهو قول الشافعي ‏.‏",
      "text_en": " Abu Mahdhurah narrated that :                     Allah's Messenger sat with him and taught him the Adhan word for word. Ibrahim said, \"It is the same as our Adhan.\" Bishr said: \"So I said to him, 'Repeat it to me.' So he described the Adhan with At-Tarjl'.\"",
      "chain": [
        "34041",
        "23002",
        "2416"
      ]
    },
    {
      "hadith_no": "412",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة، وبشر بن معاذ العقدي، قالا حدثنا أبو عوانة، عن زياد بن علاقة، عن المغيرة بن شعبة، قال صلى رسول الله صلى الله عليه وسلم حتى انتفخت قدماه فقيل له أتتكلف هذا وقد غفر لك ما تقدم من ذنبك وما تأخر قال ‏\"‏ أفلا أكون عبدا شكورا ‏\"‏ ‏.‏ قال وفي الباب عن أبي هريرة وعائشة ‏.‏ قال أبو عيسى حديث المغيرة بن شعبة حديث حسن صحيح ‏.‏",
      "text_en": " Al-Mughirah bin Shu'bah narrated:                     \"Allah's Messenger (S) performed Salat until his feet were swollen, so it was said to him: 'You burden yourself like this, while your past and future sins have been forgiven?' He said: 'Shouldn't I be a grateful worshipper?'\"",
      "chain": [
        "30367",
        "34041",
        "20469",
        "11339",
        "166"
      ]
    },
    {
      "hadith_no": "420",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا بشر بن معاذ العقدي، حدثنا عبد الواحد بن زياد، حدثنا الأعمش، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا صلى أحدكم ركعتى الفجر فليضطجع على يمينه ‏\"‏ ‏.‏ قال وفي الباب عن عائشة ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن صحيح غريب من هذا الوجه ‏.‏ وقد روي عن عائشة أن النبي صلى الله عليه وسلم كان إذا صلى ركعتى الفجر في بيته اضطجع على يمينه ‏.‏ وقد رأى بعض أهل العلم أن يفعل هذا استحبابا ‏.‏",
      "text_en": " Abu Hurairah narrated that:                     Allah's Messenger (S) said: \"When one of you prays the two Rak'ah of Fajr then let him lay down on his right (side).\"",
      "chain": [
        "34041",
        "20256",
        "11060",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "789",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا بشر بن معاذ العقدي البصري، حدثنا أيوب بن واقد الكوفي، عن هشام بن عروة، عن أبيه، عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ من نزل على قوم فلا يصومن تطوعا إلا بإذنهم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث منكر لا نعرف أحدا من الثقات روى هذا الحديث عن هشام بن عروة ‏.‏ وقد روى موسى بن داود عن أبي بكر المديني عن هشام بن عروة عن أبيه عن عائشة عن النبي صلى الله عليه وسلم نحوا من هذا ‏.‏ قال أبو عيسى وهذا حديث ضعيف أيضا ‏.‏ وأبو بكر ضعيف عند أهل الحديث وأبو بكر المدني الذي روى عن جابر بن عبد الله اسمه الفضل بن مبشر وهو أوثق من هذا وأقدم ‏.‏",
      "text_en": " Aishah narrated that:                     The Messenger of Allah said: \"Whoever stays with a people, then he is not to fast without their permission.\"",
      "chain": [
        "34041",
        "24027",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2172",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Medicine - كتاب الطب عن رسول اللَّهِ صلى الله عليه وسلم",
      "chapter_no": "28",
      "text_ar": "حدثنا بشر بن معاذ العقدي، حدثنا أبو عوانة، عن زياد بن علاقة، عن أسامة بن شريك، قال قالت الأعراب يا رسول الله ألا نتداوى قال ‏\"‏ نعم يا عباد الله تداووا فإن الله لم يضع داء إلا وضع له شفاء أو قال دواء إلا داء واحدا ‏\"‏ ‏.‏ قالوا يا رسول الله وما هو قال ‏\"‏ الهرم ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن ابن مسعود وأبي هريرة وأبي خزامة عن أبيه وابن عباس ‏.‏ وهذا حديث حسن صحيح ‏.‏",
      "text_en": " Usamah bin Sharik said:                     \"Some Bedouins asked: 'O Messenger of Allah (s.a.w) shall we treat (our ill)?' He said: 'Yes, O worshipers of Allah! Use remedies. For indeed Allah did not make a disease but He made a cure for it' - or - 'a remedy. Except for one disease.' They said: 'O Messenger of Allah (s.a.w)! What is it?' He said: 'Old age.'\"",
      "chain": [
        "34041",
        "20469",
        "11339",
        "4000"
      ]
    },
    {
      "hadith_no": "3538",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا بشر بن معاذ العقدي، حدثنا يزيد بن زريع، عن سعيد بن أبي عروبة، عن قتادة، عن الحسن، عن سمرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ سام أبو العرب وحام أبو الحبش ويافث أبو الروم ‏\"‏ ‏.‏",
      "text_en": " Narrated Samurah:                     that the Prophet (ﷺ) said: \"Sam was the father of Arabs, Ham the father of the Ethiopians, and Yafith the father of the Romans.\"",
      "chain": [
        "34041",
        "20304",
        "11073",
        "11019",
        "11016",
        "394"
      ]
    },
    {
      "hadith_no": "3571",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "وحدثنا بشر بن معاذ، حدثنا عبد الله بن جعفر، عن العلاء، نحوه إلا أنه قال معلق بالثريا ‏.‏",
      "text_en": "",
      "chain": [
        "34041",
        "108",
        "10606"
      ]
    },
    {
      "hadith_no": "3571",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا بشر بن معاذ العقدي البصري، حدثنا حماد بن واقد، عن إسرائيل، عن أبي إسحاق، عن أبي الأحوص، عن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ سلوا الله من فضله فإن الله عز وجل يحب أن يسأل وأفضل العبادة انتظار الفرج ‏\"‏ ‏.‏ قال أبو عيسى هكذا روى حماد بن واقد هذا الحديث وقد خولف في روايته ‏.‏ وحماد بن واقد هذا هو الصفار ليس بالحافظ وهو عندنا شيخ بصري ‏.‏ وروى أبو نعيم هذا الحديث عن إسرائيل عن حكيم بن جبير عن رجل عن النبي صلى الله عليه وسلم مرسل وحديث أبي نعيم أشبه أن يكون أصح ‏.‏",
      "text_en": " Abdullah narrated that the Messenger of Allah said:                     “Ask Allah of His Bounty. For verily, Allah the Mighty and Sublime, loves to be asked, and the best of worship is awaiting relief.”",
      "chain": [
        "34041",
        "24100",
        "20311",
        "11049",
        "20327",
        "18"
      ]
    },
    {
      "hadith_no": "4310",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا بشر بن معاذ العقدي، - بصري - حدثنا يزيد بن زريع، عن سعيد بن أبي عروبة، عن قتادة، عن الحسن، عن سمرة بن جندب، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ سام أبو العرب ويافث أبو الروم وحام أبو الحبش ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ ويقال يافث ويافت ويفث ‏.‏",
      "text_en": " Narrated Samurah bin Jundab:                     that the Messenger of Allah (ﷺ) said: \"Sam was the father of Arabs, Yafith was the father of Romans, and Ham was the father of Ethiopians.\"",
      "chain": [
        "34041",
        "20304",
        "11073",
        "11019",
        "11016",
        "394"
      ]
    },
    {
      "hadith_no": "636",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Adhan (The Call to Prayer) - كتاب الأذان",
      "chapter_no": "7",
      "text_ar": "أخبرنا بشر بن معاذ، قال حدثني إبراهيم، - وهو ابن عبد العزيز بن عبد الملك بن أبي محذورة - قال حدثني أبي عبد العزيز، وجدي عبد الملك، عن أبي محذورة، أن النبي صلى الله عليه وسلم أقعده فألقى عليه الأذان حرفا حرفا قال إبراهيم هو مثل أذاننا هذا ‏.‏ قلت له أعد على ‏.‏ قال الله أكبر الله أكبر أشهد أن لا إله إلا الله مرتين أشهد أن محمدا رسول الله مرتين ثم قال - بصوت دون ذلك الصوت يسمع من حوله - أشهد أن لا إله إلا الله مرتين أشهد أن محمدا رسول الله مرتين حى على الصلاة مرتين حى على الفلاح مرتين الله أكبر الله أكبر لا إله إلا الله ‏.‏",
      "text_en": " It was narrated from Abu Mahdhurah that the Prophet (ﷺ) sat him down and taught him the Adhan letter by letter. (One of the narrators) Ibrahim said, \"It is like this Adhan of ours\". I said[1]:                      \"Recite it to me.\" He said, \"Allahu Akbar, Allahu Akbar (Allah is the greatest, Allah is the greatest), Ashhadu an la ilaha illallah (I bear witness that there is none worthy of worship except Allah) - twice. Ashhadu anna Muhammadan Rasulallah (I bear witness that Muhammad is the messenger of Allah) - twice. Then he said in a lower voice which those around him could here: Ashhadu an la ilaha ill-Allah (I bear witness that there is none worthy of worship except Allah) - twice. Ashhadu anna Muhammadan Rasulallah (I bear witness that Muhammad is the messenger of Allah) - twice, Hayya'ala as-salah (come to prayer) - twice, Hayya alal-falah (come to prosperity) - twice, Allahu Akbar Allahu Akbar la ilaha illallah (Allah is the Greatest, Allah is the Greatest, there is none worthy of worship except Allah).[1] Bishir bin Mu'adh who heard it from Ibrahim, and from whom An-Nasa'i is reporting it, is the one who is asking for the Adhan to be recited to him.",
      "chain": [
        "34041",
        "23002",
        "2416"
      ]
    },
    {
      "hadith_no": "859",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا علي بن محمد، حدثنا عبد الله بن إدريس، ح وحدثنا بشر بن معاذ الضرير، حدثنا بشر بن المفضل، قالا حدثنا عاصم بن كليب، عن أبيه، عن وائل بن حجر، قال رأيت النبي  صلى الله عليه وسلم  يصلي فأخذ شماله بيمينه ‏.‏",
      "text_en": " It wasnarrated that Wa’il bin Hujr said:                      “I saw the Prophet (ﷺ)performing prayer, and he took hold of his left hand with his right.”",
      "chain": [
        "38409",
        "20102",
        "34041",
        "20212",
        "10778",
        "19941",
        "3045"
      ]
    },
    {
      "hadith_no": "916",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا بشر بن معاذ الضرير، حدثنا بشر بن المفضل، حدثنا عاصم بن كليب، عن أبيه، عن وائل بن حجر، قال قلت لأنظرن إلى رسول الله  صلى الله عليه وسلم  كيف يصلي فقام فاستقبل القبلة فرفع يديه حتى حاذتا أذنيه فلما ركع رفعهما مثل ذلك فلما رفع رأسه من الركوع رفعهما مثل ذلك ‏.‏",
      "text_en": " It wasnarrated that Wa’il bin Hujr said:                      “I said: ‘I will look attheMessenger of Allah (ﷺ) and see how he performs the prayer.’ Hestood up and faced the Qiblah, and raised his hands until they wereparallel to his ears. When he bowed, he raised them likewise, andwhenhe raised his head from Ruku’, he raised them likewise.”",
      "chain": [
        "34041",
        "20212",
        "10778",
        "19941",
        "3045"
      ]
    },
    {
      "hadith_no": "933",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا بشر بن معاذ الضرير، حدثنا أبو عوانة، وحماد بن زيد، عن عمرو بن دينار، عن طاوس، عن ابن عباس، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ أمرت أن أسجد على سبعة أعظم ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Abbas that the Prophet (ﷺ) said:                      “I havebeen commanded to prostrate on seven bones.”",
      "chain": [
        "34041",
        "20469",
        "20022",
        "11081",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "1093",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا بشر بن معاذ الضرير، حدثنا حماد بن زيد، وأبو عوانة عن عمرو بن دينار، عن طاوس، عن ابن عباس، قال قال النبي  صلى الله عليه وسلم  ‏\"‏ أمرت أن لا أكف شعرا ولا ثوبا ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      The Prophet (ﷺ) said: “I wascommanded not to tuck up my hair or my garment.”*",
      "chain": [
        "34041",
        "20022",
        "20469",
        "11081",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "1400",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا بشر بن معاذ الضرير، حدثنا عبد الله بن جعفر المدني، حدثنا إبراهيم بن إسماعيل بن مجمع، عن أبي الزبير، عن جابر، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن من أحسن الناس صوتا بالقرآن الذي إذا سمعتموه يقرأ حسبتموه يخشى الله ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Jabir said:                      “The Messenger of Allah (ﷺ) said:‘Among the people who recite the Qur’an with the most beautifulvoicesis the man who, when you hear him, you think that he fearsAllah.’”",
      "chain": [
        "34041",
        "22001",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "2312",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا عمران بن موسى الليثي، حدثنا حماد بن زيد، ح وحدثنا بشر بن معاذ الضرير، حدثنا أبو عوانة، وحماد بن زيد، قالا حدثنا عمرو بن دينار، عن طاوس، عن ابن عباس، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من ابتاع طعاما فلا يبعه حتى يستوفيه ‏\"‏ ‏.‏ قال أبو عوانة في حديثه قال ابن عباس وأحسب كل شىء مثل الطعام ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"The Messenger of Allah (ﷺ) said: 'Whoever buys food, let him not sell it until he has taken full possession of it.'\" (Sahih)  In his narration, (one of the narrators) Abu 'Awanah said: \"Ibn 'Abbas said: 'I think everything is like food.\"'",
      "chain": [
        "28454",
        "20022",
        "34041",
        "20469",
        "20022",
        "11081",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "2320",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا بشر بن معاذ الضرير، حدثنا حماد بن زيد، عن عمرو بن دينار، مولى آل الزبير عن سالم بن عبد الله بن عمر، عن أبيه، عن جده، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من قال حين يدخل السوق لا إله إلا الله وحده لا شريك له له الملك وله الحمد يحيي ويميت وهو حى لا يموت بيده الخير كله وهو على كل شىء قدير - كتب الله له ألف ألف حسنة ومحا عنه ألف ألف سيئة وبنى له بيتا في الجنة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Salim bin 'Abdullah bin 'Umar, from his father, that his grandfather told that the Messenger of Allah (ﷺ) said:                     \"Whoever says, when he enters the marketplace: 'La ilaha illallah wahdahu la sharika lahu, lahul-mulk wa lahul-hamdu, yuhyi wa yumitu, wa Huwa hayyun la yamutu, bi yadihil-khairu kulluhu, wa Huwa ala kulli shay’in Qadir (None has the right to be worshiped but Allah alone, with no partner, to Him belongs all sovereignty and to Him is the praise, He gives life and gives death, and He is Ever-Living and does not die; in His Hand is all goodness and He is Able to do all things),' Allah will record for him one million good deeds, and will erase from him one million bad deeds, and will build for him a house in Paradise. \"",
      "chain": [
        "34041",
        "20022",
        "11081",
        "11011",
        "18"
      ]
    }
  ],
  "total_hadiths": 20
}