{
  "id": "34046",
  "name": "Jmyl bin al-Hasan bin Jmyl جميل بن الحسن",
  "full_name": "Jmyl bin al-Hasan bin Jmyl جميل بن الحسن",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Sadooq/Delusion",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq/Delusion] [ ق  -  صدوق يخطئ ]"
    ],
    "tags": [
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20246",
      "name": "'Abdul A'ala bin 'Abdul A'ala al-Sami عبد الأعلى بن عبد الأعلى البصري السامي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "24415",
      "name": "Muhammad bin Mrwan bin Qdamh محمد بن مروان بن قدامة العقيلي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20259",
      "name": "'Abdul Wahab bin 'Abdul Majeed al-Thaqaf عبد الوهاب بن عبد المجيد الثقفي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20455",
      "name": "Muhammad bin al-Hasan bin Hilal محمد بن الحسن بن هلال",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20032",
      "name": "Waki' bin al-Jarrah وكيع بن الجراح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30004",
      "name": "Ibn Maja ابن ماجة",
      "grade": "3rd Century AH [12th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "313",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا جميل بن الحسن العتكي، حدثنا عبد الأعلى بن عبد الأعلى، حدثنا سعيد بن أبي عروبة، عن قتادة، ح وحدثنا هارون بن إسحاق، حدثنا عبدة، قال حدثنا سعيد، عن قتادة، عن القاسم بن عوف الشيباني، عن زيد بن أرقم، ‏.‏ أن رسول الله قال فذكر الحديث ‏.‏",
      "text_en": "",
      "chain": [
        "34046",
        "20246",
        "11073",
        "11019",
        "35158",
        "20337",
        "11168",
        "11019",
        "10811",
        "384"
      ]
    },
    {
      "hadith_no": "893",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا جميل بن الحسن بن جميل العتكي، حدثنا عبد الأعلى، حدثنا سعيد، عن قتادة، عن الحسن، عن سمرة بن جندب، قال سكتتان حفظتهما عن رسول الله  صلى الله عليه وسلم  ‏.‏ فأنكر ذلك عمران بن الحصين فكتبنا إلى أبى بن كعب بالمدينة فكتب أن سمرة قد حفظ ‏.‏ قال سعيد فقلنا لقتادة ما هاتان السكتتان قال إذا دخل في صلاته وإذا فرغ من القراءة ‏.‏ ثم قال بعد وإذا قرأ ‏{غير المغضوب عليهم ولا الضالين}‏ ‏.‏ قال وكان يعجبهم إذا فرغ من القراءة أن يسكت حتى يتراد إليه نفسه ‏.‏",
      "text_en": " It wasnarrated that Samurah bin Jundab said:                      “There are two pausesinwhich I memorized from the Messenger of Allah (ﷺ), but ‘Imran binHusain denied that. We wrote to Ubayy bin Ka’b in Al-Madinah, andhewrote that Samurah had indeed memorized them.”",
      "chain": [
        "34046",
        "20246",
        "11168",
        "11019",
        "11016",
        "394"
      ]
    },
    {
      "hadith_no": "898",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا جميل بن الحسن، حدثنا عبد الأعلى، حدثنا معمر، عن الزهري، عن ابن أكيمة، عن أبي هريرة، قال صلى بنا رسول الله  صلى الله عليه وسلم  فذكر نحوه وزاد فيه قال فسكتوا بعد فيما جهر فيه الإمام ‏.‏",
      "text_en": " It wasnarrated that Abu Hurairah said:                      “The Messenger of Allah (ﷺ)ledus in prayer,” and he mentioned a similar report, and added to it,and he said: “And after that they were quiet in the prayers inwhichthe Imam recites aloud.”",
      "chain": [
        "34046",
        "20246",
        "20115",
        "11013",
        "13"
      ]
    },
    {
      "hadith_no": "901",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا بكر بن خلف، وجميل بن الحسن، قالا حدثنا عبد الأعلى، حدثنا معمر، ح وحدثنا أحمد بن عمرو بن السرح المصري، وهاشم بن القاسم الحراني، قالا حدثنا عبد الله بن وهب، عن يونس، جميعا عن الزهري، عن سعيد بن المسيب، وأبي، سلمة بن عبد الرحمن عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إذا أمن القارئ فأمنوا فمن وافق تأمينه تأمين الملائكة غفر له ما تقدم من ذنبه ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Hurairah said:                      The Messenger of Allah (ﷺ)said:“When the recite says Amin, then say Amin, for if a person’sAmincoincides with the Amin of the angels, his previous sins will beforgiven.”",
      "chain": [
        "34043",
        "34046",
        "20246",
        "20115",
        "38678",
        "20029",
        "20475",
        "11013",
        "11002",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "954",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا جميل بن الحسن، حدثنا عبد الأعلى، حدثنا سعيد، عن قتادة، ح وحدثنا عبد الرحمن بن عمر، حدثنا ابن أبي عدي، حدثنا سعيد بن أبي عروبة، وهشام بن أبي عبد الله، عن قتادة، ‏.‏ وهذا حديث عبد الرحمن عن يونس بن جبير، عن حطان بن عبد الله، عن أبي موسى الأشعري، أن رسول الله  صلى الله عليه وسلم  خطبنا وبين لنا سنتنا وعلمنا صلاتنا فقال ‏\"‏ إذا صليتم فكان عند القعدة فليكن من أول قول أحدكم التحيات الطيبات الصلوات لله السلام عليك أيها النبي ورحمة الله وبركاته السلام علينا وعلى عباد الله الصالحين أشهد أن لا إله إلا الله وأشهد أن محمدا عبده ورسوله سبع كلمات هن تحية الصلاة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Musa Al-Ash’ari:                      “The Messenger of Allah (ﷺ)addressed us and explained the Sunnah for us, and he taught us ourprayer. He said: ‘When you perform prayer, and you are sitting, letthe first thing you say be: At-Tahiyyatut-tayyibatus-salawatu lillah;as-salamu ‘alayka ayyuhan-Nabiyyu wa rahmatullahi wa barakatuhu;as-salamu ‘alayna wa ‘ala ‘ibadillahis-salihin. Ashhadu an lailaha illallah wa ashhadu anna Muhammadan ‘abduhu wa Rasuluhu (Allcompliments, good words and prayers are due to Allah; peace be uponyou, O Prophet, and the mercy of Allah and His blessings; peace beupon us and upon the righteous slaves of Allah. I bear witness thatnone has the right to be worshipped but Allah and I bear witness thatMuhammad is His slave and Messenger). Seven phrases which are thegreeting of the prayer.’”",
      "chain": [
        "34046",
        "20246",
        "11168",
        "11019",
        "20276",
        "11073",
        "11320",
        "41"
      ]
    },
    {
      "hadith_no": "1004",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا جميل بن الحسن، حدثنا عبد الأعلى، حدثنا سعيد، عن قتادة، عن الحسن، عن عبد الله بن مغفل، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ يقطع الصلاة المرأة والكلب والحمار ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Abdullah bin Mughaffal that the Prophet (ﷺ)said:                     “The prayer is severed by a woman, a dog and a donkey.”",
      "chain": [
        "34046",
        "20246",
        "11168",
        "11019",
        "11016",
        "3242"
      ]
    },
    {
      "hadith_no": "1320",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن المثنى، وأحمد بن ثابت، وجميل بن الحسن، قالوا حدثنا عبد الوهاب، حدثنا خالد الحذاء، عن أبي قلابة، عن النعمان بن بشير، قال انكسفت الشمس على عهد رسول الله  صلى الله عليه وسلم  فخرج فزعا يجر ثوبه حتى أتى المسجد فلم يزل يصلي حتى انجلت ثم قال ‏\"‏ إن أناسا يزعمون أن الشمس والقمر لا ينكسفان إلا لموت عظيم من العظماء وليس كذلك إن الشمس والقمر لا ينكسفان لموت أحد ولا لحياته فإذا تجلى الله لشىء من خلقه خشع له ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Nu’man bin Bashir said:                      “The sun was eclipsed atthe time of the Messenger of Allah (ﷺ), and he came out alarmed,dragging his lower garment, until he reached the mosque. He continuedto perform prayer until the eclipse was over, then he said: ‘Somepeople claim that the sun and moon only become eclipsed because ofthedeath of a great leader. That is not so. The sun and the moon donotbecome eclipsed for the death or birth of anyone. When AllahmanifestsHimself to anything in His creation, it humbles itselfbefore Him.’”",
      "chain": [
        "30170",
        "34046",
        "20259",
        "11282",
        "11047",
        "274"
      ]
    },
    {
      "hadith_no": "1681",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا جميل بن الحسن، قال حدثنا أبو المنذر الهذيل بن الحكم، حدثنا عبد العزيز بن أبي رواد، عن عكرمة، عن ابن عباس، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ موت غربة شهادة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Abbas that the Messenger of Allah (ﷺ)said:                     Dying in a strange land is martyrdom.”",
      "chain": [
        "34046",
        "20739",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "1956",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا جميل بن الحسن العتكي، حدثنا محمد بن مروان العقيلي، حدثنا هشام بن حسان، عن محمد بن سيرين، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا تزوج المرأة المرأة ولا تزوج المرأة نفسها فإن الزانية هي التي تزوج نفسها ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     the Messenger of Allah said: “No woman should arrange the marriage of another woman, and no woman should arrange her own marriage. The adulteress is the one who arranges her own marriage.”",
      "chain": [
        "34046",
        "24415",
        "11311",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "2000",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا سهل بن أبي سهل، وجميل بن الحسن، قالا حدثنا سفيان بن عيينة، عن محمد بن المنكدر، أنه سمع جابر بن عبد الله، يقول كانت يهود تقول من أتى امرأة في قبلها من دبرها كان الولد أحول فأنزل الله سبحانه ‏{نساؤكم حرث لكم فأتوا حرثكم أنى شئتم}‏ ‏.‏",
      "text_en": " It was narrated from Muhammad bin Munkadir:                     that he heard Jabir bin 'Abdullah say: “The Jews used to say that if a man has intercourse with a woman in her vagina from the back, the child would have a squint. Then Allah, Glorious is He, revealed: 'Your wives are a tilth for you, so go to your tilth, when or how you will.' ”",
      "chain": [
        "38259",
        "34046",
        "20005",
        "11048",
        "34"
      ]
    },
    {
      "hadith_no": "2346",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Rulings - كتاب الأحكام",
      "chapter_no": "13",
      "text_ar": "حدثنا جميل بن الحسن العتكي، حدثنا عبد الأعلى، حدثنا سعيد، عن قتادة، عن خلاس، عن أبي رافع، عن أبي هريرة، أن رجلين، تدارءا في بيع ليس لواحد منهما بينة فأمرهما رسول الله صلى الله عليه وسلم أن يستهما على اليمين أحبا ذلك أم كرها ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that :                     two men disputed concerning a transaction, and neither of them had proof. The Messenger of Allah commanded them to draw lots as to which of them should swear an oath, whether they liked it or not.",
      "chain": [
        "34046",
        "20246",
        "11168",
        "11019",
        "11283",
        "479",
        "13"
      ]
    },
    {
      "hadith_no": "2365",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Rulings - كتاب الأحكام",
      "chapter_no": "13",
      "text_ar": "حدثنا عبيد الله بن يوسف الجبيري، وجميل بن الحسن العتكي، قالا حدثنا محمد بن مروان العجلي، حدثنا عبد الملك بن أبي نضرة، عن أبيه، عن أبي سعيد الخدري، قال تلا هذه الآية ‏{‏يا أيها الذين آمنوا إذا تداينتم بدين إلى أجل مسمى ‏}‏ حتى بلغ ‏{‏فإن أمن بعضكم بعضا‏}‏ فقال هذه نسخت ما قبلها ‏.‏",
      "text_en": " It was narrated that :                     Abu Sa'eed Al-Khudri recited this Verse: “O you who believe! When you contract a debt for a fixed period...” until: “then if one of you entrusts the other.” Then he said: “This abrogates what came before.”",
      "chain": [
        "34147",
        "34046",
        "24415",
        "24280",
        "38"
      ]
    },
    {
      "hadith_no": "2468",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Gifts - كتاب الهبات",
      "chapter_no": "14",
      "text_ar": "حدثنا جميل بن الحسن، حدثنا عبد الأعلى، حدثنا سعيد، عن عامر الأحول، عن عمرو بن شعيب، عن أبيه، عن جده، أن نبي الله صلى الله عليه وسلم قال ‏\"‏ لا يرجع أحدكم في هبته إلا الوالد من ولده ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Amr bin Shu'aib, from his father, from, his Grandfather, that the Prophet (ﷺ) of Allah (SWT) said:                     “None of you should take back his gift, except a father (taking it back) from his son.”",
      "chain": [
        "34046",
        "20246",
        "11168",
        "10693",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2755",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا جميل بن الحسن العتكي، حدثنا عبد الأعلى، حدثنا سعيد، عن مطر، عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ الأصابع سواء كلهن فيهن عشر عشر من الإبل ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from his father, from his grandfather, that the Messenger of Allah (ﷺ) said:                     “The fingers are all same, and (the compensatory money) for each of them is ten camels.",
      "chain": [
        "34046",
        "20246",
        "11168",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2757",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا جميل بن الحسن، حدثنا عبد الأعلى، حدثنا سعيد بن أبي عروبة، عن مطر، عن عمرو بن شعيب، عن أبيه، عن جده، أن النبي صلى الله عليه وسلم قال ‏\"‏ في المواضح خمس خمس من الإبل ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from his father, from his grandfather, that the Prophet (ﷺ) of said:                     “For a wound that exposes a bone, is five; (the compensation) is five camels.”",
      "chain": [
        "34046",
        "20246",
        "11073",
        "19934",
        "19911"
      ]
    }
  ],
  "total_hadiths": 15
}