{
  "id": "34043",
  "name": "Bakr bin Khlf al-Basri بكر بن خلف البصري",
  "full_name": "Bakr bin Khlf al-Basri بكر بن خلف البصري",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "240",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ خت  د  ق  -  صدوق ]"
    ],
    "tags": [
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20278",
      "name": "Muhammad bin Ja'far Ghandar محمد بن جعفر غندر صاحب الكرابيس",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20277",
      "name": "Muhammad bin Bakr bin 'Uthman al-Barsani محمد بن بكر بن عثمان البرساني",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "28010",
      "name": "Ibrahim bin Khalid bin 'Ubaid إبراهيم بن خالد بن عبيد القرشي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20241",
      "name": "al-Dahhak bin Mukhlad Abu 'Asim al-Nabil الضحاك بن مخلد أبو عاصم النبيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20288",
      "name": "Ma'tmar bin Sulaiman-al-Taufayl معتمر بن سليمان - الطفيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20304",
      "name": "Yazid bin Zari' يزيد بن زريع",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "students": [
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "30004",
      "name": "Ibn Maja ابن ماجة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30467",
      "name": "'Abdullah bin 'Amir عبد الله بن عامر بن زرارة الحضرمي",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sunan-abi-daud-4784",
      "hadith_no": "4784",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا بكر بن خلف، والحسن بن علي، - المعنى - قالا حدثنا إبراهيم بن خالد، حدثنا أبو وائل القاص، قال دخلنا على عروة بن محمد بن السعدي فكلمه رجل فأغضبه فقام فتوضأ ثم رجع وقد توضأ فقال حدثني أبي عن جدي عطية قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الغضب من الشيطان وإن الشيطان خلق من النار وإنما تطفأ النار بالماء فإذا غضب أحدكم فليتوضأ ‏\"‏ ‏.‏",
      "text_en": " Narrated Atiyyah as-Sa'di:                     AbuWa'il al-Qass said: We entered upon Urwah ibn Muhammad ibn as-Sa'di. A man spoke to him and made him angry. So he stood and performed ablution; he then returned and performed ablution, and said: My father told me on the authority of my grandfather Atiyyah who reported the Messenger of Allah (ﷺ) as saying: Anger comes from the devil, the devil was created of fire, and fire is extinguished only with water; so when one of you becomes angry, he should perform ablution.",
      "usc_msa_ref": "",
      "chain": [
        "34043",
        "30",
        "38072",
        "28278"
      ]
    },
    {
      "id": "sunan-ibn-majah-180",
      "hadith_no": "180",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا بكر بن خلف أبو بشر، حدثنا عبد الرزاق، عن معمر، عن قتادة، عن أنس بن مالك، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ يخرج قوم في آخر الزمان - أو في هذه الأمة - يقرءون القرآن لا يجاوز تراقيهم - أو حلقومهم سيماهم التحليق إذا رأيتموهم - أو إذا لقيتموهم - فاقتلوهم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                     \"The Messenger of Allah said: 'At the end of time or among this nation (Ummah) there will appear people who will recite the Qur'an but it will not go any deeper than their collarbones or their throats. Their distinguishing feature will be their shaved heads. If you see them, or meet them, then kill them.'\"",
      "usc_msa_ref": "",
      "chain": [
        "34043",
        "20121",
        "20115",
        "11019",
        "19"
      ]
    },
    {
      "id": "sunan-ibn-majah-220",
      "hadith_no": "220",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا بكر بن خلف أبو بشر، حدثنا عبد الرحمن بن مهدي، حدثنا عبد الرحمن بن بديل، عن أبيه، عن أنس بن مالك، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن لله أهلين من الناس ‏\"‏ ‏.‏ قالوا يا رسول الله من هم قال ‏\"‏ هم أهل القرآن أهل الله وخاصته ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                     \"The Messenger of Allah said: 'Allah has His own people among mankind.' They said: 'O Messenger of Allah, who are they?' He said: 'The people of the Qur'an, the people of Allah and those who are closest to Him.'\"",
      "usc_msa_ref": "",
      "chain": [
        "34043",
        "20033",
        "19"
      ]
    },
    {
      "id": "sunan-ibn-majah-225",
      "hadith_no": "225",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا بكر بن خلف أبو بشر، حدثنا عبد الأعلى، عن معمر، عن الزهري، عن سعيد بن المسيب، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من يرد الله به خيرا يفقهه في الدين ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah said: 'When Allah wills good for a person, He causes him to understand the religion.'\"",
      "usc_msa_ref": "",
      "chain": [
        "34043",
        "20246",
        "20115",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-283",
      "hadith_no": "283",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، ومحمد بن جعفر، ح وحدثنا بكر بن خلف أبو بشر، ختن المقرئ حدثنا يزيد بن زريع، قالوا حدثنا شعبة، عن قتادة، عن أبي المليح بن أسامة، عن أبيه، أسامة بن عمير الهذلي قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا يقبل الله صلاة إلا بطهور ولا يقبل صدقة من غلول ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Usamah bin 'Umair Al-Hudhali said:                     \"The Messenger of Allah said: 'Allah does not accept any prayer without purification and He does not accept any charity from Ghulul.'\" (Sahih)Another chain with similar wording.",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20031",
        "20173",
        "34043",
        "20304",
        "20020",
        "11019",
        "11453"
      ]
    },
    {
      "id": "sunan-ibn-majah-695",
      "hadith_no": "695",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بشر، بكر بن خلف حدثنا عبد الرحمن بن مهدي، عن معاوية بن صالح، عن العلاء بن الحارث، عن حرام بن حكيم، عن عمه عبد الله بن سعد، قال سألت رسول الله  صلى الله عليه وسلم  عن مواكلة الحائض فقال ‏\"‏ واكلها ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Sa'd said:                     \"I asked the Messenger of Allah about eating with a menstruating woman and he said: 'Eat with her.'\"",
      "usc_msa_ref": "",
      "chain": [
        "34043",
        "20033",
        "20675",
        "10884",
        "5127"
      ]
    },
    {
      "id": "sunan-ibn-majah-768",
      "hadith_no": "768",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book On The Mosques And The Congregations - كتاب المساجد والجماعات",
      "chapter_no": "4",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يزيد بن هارون، ح وحدثنا أبو بشر، بكر بن خلف حدثنا يزيد بن زريع، قالا حدثنا هشام بن حسان، عن محمد بن سيرين، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن لم تجدوا إلا مرابض الغنم وأعطان الإبل فصلوا في مرابض الغنم ولا تصلوا في أعطان الإبل ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     The Messenger of Allah said: \"If you cannot find anywhere (for prayer) except sheep's resting-places and camels' resting-places, then perform prayer in the sheep's resting-places and do not perform prayer in the camels' resting-places.\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20472",
        "34043",
        "20304",
        "11311",
        "11035",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-863",
      "hadith_no": "863",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا نصر بن علي الجهضمي، وبكر بن خلف، وعقبة بن مكرم، قالوا حدثنا صفوان بن عيسى، حدثنا بشر بن رافع، عن أبي عبد الله ابن عم أبي هريرة، عن أبي هريرة، أن النبي  صلى الله عليه وسلم  كان يفتتح القراءة ب ‏{الحمد لله رب العالمين}‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Prophet (ﷺ) used tostart hisrecitation with ‘All the praises and thanks are to Allah,the Lordof all that exists’ (Al-hamdu Lillahi Rabbil-‘Alamin),’ [1:                     2]",
      "usc_msa_ref": "",
      "chain": [
        "30395",
        "34043",
        "30441",
        "20553",
        "28061",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-868",
      "hadith_no": "868",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بشر، بكر بن خلف حدثنا ابن أبي عدي، عن حجاج الصواف، عن يحيى بن أبي كثير، عن عبد الله بن أبي قتادة، وعن أبي سلمة، عن أبي قتادة، قال كان رسول الله  صلى الله عليه وسلم  يصلي بنا فيطيل في الركعة الأولى من الظهر ويقصر في الثانية وكذلك في الصبح ‏.‏",
      "text_en": " It wasnarrated that Abu Qatadah said:                      “The Messenger of Allah (ﷺ)usedto lead us in prayer, and he would lengthen the first Rak’ah oftheZuhr and shorten the second Rak’ah, and he would do likewise intheSubh.”",
      "usc_msa_ref": "",
      "chain": [
        "34043",
        "20276",
        "11449",
        "11804",
        "10567",
        "391"
      ]
    },
    {
      "id": "sunan-ibn-majah-901",
      "hadith_no": "901",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا بكر بن خلف، وجميل بن الحسن، قالا حدثنا عبد الأعلى، حدثنا معمر، ح وحدثنا أحمد بن عمرو بن السرح المصري، وهاشم بن القاسم الحراني، قالا حدثنا عبد الله بن وهب، عن يونس، جميعا عن الزهري، عن سعيد بن المسيب، وأبي، سلمة بن عبد الرحمن عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إذا أمن القارئ فأمنوا فمن وافق تأمينه تأمين الملائكة غفر له ما تقدم من ذنبه ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Hurairah said:                      The Messenger of Allah (ﷺ)said:“When the recite says Amin, then say Amin, for if a person’sAmincoincides with the Amin of the angels, his previous sins will beforgiven.”",
      "usc_msa_ref": "",
      "chain": [
        "34043",
        "34046",
        "20246",
        "20115",
        "38678",
        "20029",
        "20475",
        "11013",
        "11002",
        "10567",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-960",
      "hadith_no": "960",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا بكر بن خلف أبو بشر، حدثنا خالد بن الحارث، عن شعبة، عن عاصم بن عبيد الله، قال سمعت عبد الله بن عامر بن ربيعة، عن أبيه، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ ما من مسلم يصلي على إلا صلت عليه الملائكة ما صلى على فليقل العبد من ذلك أو ليكثر ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Asim bin ‘Ubaidullah said:                      “I heard ‘Abdullahbin ‘Amir bin Rabi’ah narrating from his father that the Prophet(ﷺ)said: “There is no Muslim who sends peace and blessings uponme, butthe angels will send peace and blessings upon him as long ashe sendspeace and blessings upon me. So let a person do a little ofthat or alot.”",
      "usc_msa_ref": "",
      "chain": [
        "34043",
        "20226",
        "20020",
        "19808",
        "709",
        "708"
      ]
    },
    {
      "id": "sunan-ibn-majah-996",
      "hadith_no": "996",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا بكر بن خلف أبو بشر، حدثنا حميد بن الأسود، حدثنا إسماعيل بن أمية، ح وحدثنا عمار بن خالد، حدثنا سفيان بن عيينة، عن إسماعيل بن أمية، عن أبي عمرو بن محمد بن عمرو بن حريث، عن جده، حريث بن سليم عن أبي هريرة، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ إذا صلى أحدكم فليجعل تلقاء وجهه شيئا فإن لم يجد فلينصب عصا فإن لم يجد فليخط خطا ثم لا يضره ما مر بين يديه ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Prophet (ﷺ) said:                      “Whenanyone of you performs prayer, let him put something in front of him.If he cannot find anything then let him put a stick. If he cannotfindone, then let him draw a line. Then it will not matter ifanythingpasses in front of him.”",
      "usc_msa_ref": "",
      "chain": [
        "34043",
        "20225",
        "11417",
        "20005",
        "11417",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-1010",
      "hadith_no": "1010",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا بكر بن خلف، وسويد بن سعيد، قالا حدثنا يزيد بن زريع، حدثنا خالد الحذاء، عن أبي قلابة، عن زينب بنت أبي سلمة، عن أمها، قالت كان فراشها بحيال مسجد رسول الله  صلى الله عليه وسلم  ‏.‏",
      "text_en": " It wasnarrated from Zainab bint Umm Salamah that her mother saidthat herbed was in front of the place where the Messenger of Allah(ﷺ)prostrated.",
      "usc_msa_ref": "",
      "chain": [
        "34043",
        "30547",
        "20304",
        "11282",
        "11047",
        "244",
        "56"
      ]
    },
    {
      "id": "sunan-ibn-majah-1016",
      "hadith_no": "1016",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا هشام بن عمار، حدثنا سفيان، عن ابن عجلان، ح وحدثنا أبو بشر، بكر بن خلف حدثنا يحيى بن سعيد، عن ابن عجلان، عن محمد بن يحيى بن حبان، عن ابن محيريز، عن معاوية بن أبي سفيان، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا تبادروني بالركوع ولا بالسجود فمهما أسبقكم به إذا ركعت تدركوني به إذا رفعت ومهما أسبقكم به إذا سجدت تدركوني به إذا رفعت إني قد بدنت ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Mu’awiyah bin Abu Sufyan said:                      “The Messenger ofAllah (ﷺ) said: ‘Do not bow or prostrate before me. No matter howfar ahead of you I bow, you will catch up with me when I stand up,andno matter how far ahead of you I prostrate, you will catch upwith mewhen I raise my head. I have become bulky.’”",
      "usc_msa_ref": "",
      "chain": [
        "30288",
        "20012",
        "10616",
        "34043",
        "20031",
        "10616",
        "11222",
        "27"
      ]
    },
    {
      "id": "sunan-ibn-majah-1027",
      "hadith_no": "1027",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا بكر بن خلف أبو بشر، حدثنا أبو بكر الحنفي، حدثنا الضحاك بن عثمان، حدثنا شرحبيل، قال سمعت جابر بن عبد الله، يقول كان رسول الله  صلى الله عليه وسلم  يصلي المغرب فجئت فقمت عن يساره فأقامني عن يمينه ‏.‏",
      "text_en": " Shurahbilsaid:                      “I heard Jabir bin ‘Abdullah say: ‘The Messenger ofAllah(ﷺ) was performing Maghrib, and I came and stood on his left,buthe made me stand on his right.’”",
      "usc_msa_ref": "",
      "chain": [
        "34043",
        "20254",
        "20504",
        "34"
      ]
    },
    {
      "id": "sunan-ibn-majah-1095",
      "hadith_no": "1095",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا بكر بن خلف، حدثنا خالد بن الحارث، عن شعبة، ح وحدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، أخبرني مخول بن راشد، قال سمعت أبا سعد، - رجلا من أهل المدينة - يقول رأيت أبا رافع مولى رسول الله  صلى الله عليه وسلم  رأى الحسن بن علي وهو يصلي وقد عقص شعره فأطلقه أو نهى عنه وقال نهى رسول الله  صلى الله عليه وسلم  أن يصلي الرجل وهو عاقص شعره ‏.‏",
      "text_en": " Mukhawwal said:                      “I heard Abu Sa’d, a man from the people ofMadinah,say: ‘I saw Abu Rafi’, the freed slave of the Messengerof Allah(ﷺ), when he saw Hasan bin ‘Ali performing prayer, withhis hairbraided. He undid it, or told him not to do that, and said:“TheMessenger of Allah (ﷺ) forbade a man from performing prayerwith hishair braided.”",
      "usc_msa_ref": "",
      "chain": [
        "34043",
        "20226",
        "20020",
        "30160",
        "20173",
        "20020",
        "11390"
      ]
    },
    {
      "id": "sunan-ibn-majah-1205",
      "hadith_no": "1205",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أزهر بن القاسم، ح وحدثنا بكر بن خلف أبو بشر، حدثنا روح بن عبادة، قالا حدثنا زكريا بن إسحاق، عن عمرو بن دينار، عن عطاء بن يسار، عن أبي هريرة، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ إذا أقيمت الصلاة فلا صلاة إلا المكتوبة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                     “Once the Iqamah has been called, there should be no prayer buttheobligatory one.”",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "23006",
        "34043",
        "20229",
        "11244",
        "11081",
        "11020",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-1411",
      "hadith_no": "1411",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا بكر بن خلف أبو بشر، حدثنا يحيى بن سعيد، عن قدامة بن عبد الله، عن جسرة بنت دجاجة، قالت سمعت أبا ذر، يقول قام النبي  صلى الله عليه وسلم  بآية حتى أصبح يرددها والآية ‏{إن تعذبهم فإنهم عبادك وإن تغفر لهم فإنك أنت العزيز الحكيم}‏ ‏.‏",
      "text_en": " It wasnarrated that Jasrah bint Dijajah said:                      “I heard Abu Dharrsay:‘The Prophet (ﷺ) stood reciting a Verse and repeating it untilmorning came. That Verse was: “If you punish them, they are Yourslaves, and if You forgive them, verily You, only You, are theAll-Mighty, the All-Wise.’”” [5:118]",
      "usc_msa_ref": "",
      "chain": [
        "34043",
        "20031",
        "19462",
        "23"
      ]
    },
    {
      "id": "sunan-ibn-majah-1441",
      "hadith_no": "1441",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بشر، بكر بن خلف حدثنا عبد الرحمن بن مهدي، عن معاوية بن صالح، عن العلاء بن الحارث، عن حرام بن معاوية، عن عمه عبد الله بن سعد، قال سألت رسول الله  صلى الله عليه وسلم  أيما أفضل الصلاة في بيتي أو الصلاة في المسجد قال ‏\"‏ ألا ترى إلى بيتي ما أقربه من المسجد فلأن أصلي في بيتي أحب إلى من أن أصلي في المسجد إلا أن تكون صلاة مكتوبة ‏\"‏ ‏.‏",
      "text_en": " ‘Abdullah bin Sa’d said:                      “I asked the Messenger of Allah (ﷺ):‘Which is better prayer in my house or prayer in the mosque?’ Hesaid:‘Do you not see how close my house is to the mosque?’ Butpraying inmy house is dearer to me than praying in the mosque, apartfrom theprescribed prayers.’”",
      "usc_msa_ref": "",
      "chain": [
        "34043",
        "20033",
        "20675",
        "10884",
        "5127"
      ]
    },
    {
      "id": "sunan-ibn-majah-1455",
      "hadith_no": "1455",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بشر، بكر بن خلف حدثنا سلمة بن رجاء، حدثتني شعثاء، عن عبد الله بن أبي أوفى، أن رسول الله  صلى الله عليه وسلم  صلى يوم بشر برأس أبي جهل ركعتين ‏.‏",
      "text_en": " It wasnarrated from ‘Abdullah bin Abu Awfa that the Messenger ofAllah(ﷺ) prayed two Rak’ah on the day when he was given the gladtidings of the head (death) of Abu Jahl.",
      "usc_msa_ref": "",
      "chain": [
        "34043",
        "20325",
        "5115"
      ]
    },
    {
      "id": "sunan-ibn-majah-1482",
      "hadith_no": "1482",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بشر، بكر بن خلف حدثنا ابن أبي عدي، عن سليمان التيمي، عن أبي نضرة، عن جابر بن عبد الله، قال كان رسول الله  صلى الله عليه وسلم  يقوم في أصل شجرة - أو قال إلى جذع - ثم اتخذ منبرا ‏.‏ قال فحن الجذع - قال جابر - حتى سمعه أهل المسجد حتى أتاه رسول الله  صلى الله عليه وسلم  فمسحه فسكن ‏.‏ فقال بعضهم لو لم يأته لحن إلى يوم القيامة ‏.‏",
      "text_en": " It wasnarrated that Jabir bin ‘Abdullah said:                      “The Messenger ofAllah(ﷺ) used to stand by the root of a tree, or by a tree trunk,thenhe started to use a pulpit. The tree trunk made a grievingsound.”Jabir said: “So that the people in the mosque could hear it.Untilthe Messenger of Allah (ﷺ) came to it and rubbed it, and itcalmeddown. Some of them said: ‘If he had not come to it, it wouldhavegrieved until the Day of Resurrection.’”",
      "usc_msa_ref": "",
      "chain": [
        "34043",
        "20276",
        "11289",
        "10721",
        "34"
      ]
    },
    {
      "id": "sunan-ibn-majah-1486",
      "hadith_no": "1486",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا بكر بن خلف أبو بشر، حدثنا أبو عاصم، عن ابن جريج، عن أبي الزبير، عن جابر بن عبد الله، قال سئل النبي  صلى الله عليه وسلم  أى الصلاة أفضل قال ‏\"‏ طول القنوت ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Jabir bin ‘Abdullah said:                      “The Prophet (ﷺ) wasasked: ‘Which prayer is best?’ He said: ‘That with the longerQunut.’”",
      "usc_msa_ref": "",
      "chain": [
        "34043",
        "20241",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "id": "sunan-ibn-majah-1496",
      "hadith_no": "1496",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، ح وحدثنا أبو بشر، بكر بن خلف حدثنا يحيى بن سعيد، قالا حدثنا عبد الحميد بن جعفر، عن أبيه، عن تميم بن محمود، عن عبد الرحمن بن شبل، قال نهى رسول الله  صلى الله عليه وسلم  عن ثلاث عن نقرة الغراب وعن فرشة السبع وأن يوطن الرجل المكان الذي يصلي فيه كما يوطن البعير ‏.‏",
      "text_en": " It wasnarrated that ‘Abdur-Rahman bin Shibl said:                      “The Messenger ofAllah (ﷺ) forbade three things: Pecking like a crow, spreading (theforearms) like a beast of prey, and a man having a place in themosquein which he usually offers the prayer, like a camel has aplace towhich it usually goes.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20032",
        "34043",
        "11062",
        "11875",
        "11833",
        "18098",
        "6792"
      ]
    },
    {
      "id": "sunan-ibn-majah-1519",
      "hadith_no": "1519",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا بكر بن خلف أبو بشر، حدثنا يحيى بن سعيد، عن المثنى بن سعيد، عن قتادة، عن ابن بريدة، عن أبيه، أن النبي  صلى الله عليه وسلم  قال ‏\"‏ المؤمن يموت بعرق الجبين ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Buraidah from his father that the Prophet(ﷺ)said:                      “The believer dies with sweat on his brow.”",
      "usc_msa_ref": "",
      "chain": [
        "34043",
        "20031",
        "11019",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-ibn-majah-1590",
      "hadith_no": "1590",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بشر، بكر بن خلف حدثنا يحيى بن سعيد، عن عبيد الله، عن نافع، عن ابن عمر، قال لما توفي عبد الله بن أبى جاء ابنه إلى النبي  صلى الله عليه وسلم  فقال يا رسول الله أعطني قميصك أكفنه فيه ‏.‏ فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ آذنوني به ‏\"‏ ‏.‏ فلما أراد النبي  صلى الله عليه وسلم  أن يصلي عليه قال له عمر بن الخطاب ما ذاك لك ‏.‏ فصلى عليه النبي  صلى الله عليه وسلم  فقال له النبي  صلى الله عليه وسلم  ‏\"‏ أنا بين خيرتين ‏{استغفر لهم أو لا تستغفر لهم }‏ ‏\"‏ ‏.‏ فأنزل الله سبحانه ‏{ولا تصل على أحد منهم مات أبدا ولا تقم على قبره}‏ ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Umar said:                      “When ‘Abdullah bin Ubayy died,his son came to the Prophet (ﷺ) and said: ‘O Messenger of Allah,give me your shirt so that I may shroud him in it.’ The MessengerofAllah (ﷺ) said: ‘Notify me when he is ready (i.e., when he hasbeenwashed and shrouded).’ When the Prophet (ﷺ) wanted to offerthefuneral prayer for him: ‘You should not do that.’ The Prophet(aw)offered the funeral prayer for him, and the Prophet (ﷺ) saidto him:‘I have been given two choices: “...ask forgiveness forthem(hypocrites) or ask not forgiveness for them...’” [9:80]Then Allahrevealed: ‘And never pray (the funeral prayer) for anyof them(hypocrites) who dies, nor stand at his grave.’” [9:84]",
      "usc_msa_ref": "",
      "chain": [
        "34043",
        "20031",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-ibn-majah-1863",
      "hadith_no": "1863",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters Regarding Zakat - كتاب الزكاة",
      "chapter_no": "8",
      "text_ar": "حدثنا بكر بن خلف، ومحمد بن يحيى، قالا حدثنا عبيد الله بن موسى، أنبأنا إبراهيم بن إسماعيل، عن عبد الله بن واقد، عن ابن عمر، وعائشة، أن النبي  صلى الله عليه وسلم  كان يأخذ من كل عشرين دينارا فصاعدا نصف دينار ومن الأربعين دينارا دينارا ‏.‏",
      "text_en": " Ibn 'Umar and 'Aishah narrated that:                     that from every twenty Dinar or more. The Prophet used to take half a Dinar and from forty Dinar, one Dinar.",
      "usc_msa_ref": "",
      "chain": [
        "34043",
        "11222",
        "20340",
        "26500",
        "18",
        "53"
      ]
    },
    {
      "id": "sunan-ibn-majah-1870",
      "hadith_no": "1870",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters Regarding Zakat - كتاب الزكاة",
      "chapter_no": "8",
      "text_ar": "حدثنا أبو بشر، بكر بن خلف حدثنا عبد الرحمن بن مهدي، حدثنا سليمان بن كثير، حدثنا ابن شهاب، عن سالم بن عبد الله، عن أبيه، عن النبي  صلى الله عليه وسلم  قال أقرأني سالم كتابا كتبه رسول الله  صلى الله عليه وسلم  في الصدقات قبل أن يتوفاه الله فوجدت فيه ‏\"‏ في خمس من الإبل شاة وفي عشر شاتان وفي خمس عشرة ثلاث شياه وفي عشرين أربع شياه وفي خمس وعشرين بنت مخاض إلى خمس وثلاثين فإن لم توجد بنت مخاض فابن لبون ذكر فإن زادت على خمس وثلاثين واحدة ففيها بنت لبون إلى خمسة وأربعين فإن زادت على خمس وأربعين واحدة ففيها حقة إلى ستين فإن زادت على ستين واحدة ففيها جذعة إلى خمس وسبعين فإن زادت على خمس وسبعين واحدة ففيها ابنتا لبون إلى تسعين فإن زادت على تسعين واحدة ففيها حقتان إلى عشرين ومائة فإذا كثرت ففي كل خمسين حقة وفي كل أربعين بنت لبون ‏\"‏ ‏.‏",
      "text_en": " Ibn Shihab narrated from Salim bin Abdullah, from his father, from the Prophet(ﷺ):                     Ibn Shihab said: “Salim read to me a letter that the Messenger of Allah had written concerning Sadaqat, before Allah caused him to pass away, in which it was said: 'For five camels one sheep; for ten, two sheep; for twenty, four sheep. For twenty five, a Bint Makhad(a one year old she-camel), up to thirty-five; if there is no Bint Makhad, then a Bin Labun ( a two-year-old male camel). If there are more than thirty-five even one, then a Bint Labun ( a two-year-old she-camel) must be given up to forty-five. If there are more than forty-five, even one, then a Hiqqah (a three-year-old she-camel), up to sixty camels. If there are more than sixty, even one more, then a Jadha'ah ( a four-year-old she-camel) must be given, up to seventy-five. If there are more than seventy-five, even one more, then two Bint Labun must be given, upto ninety. If there are more than ninety, even one more, then two Hiqqah must be given, up to one hundred and twenty. If there are many camels, then for each fifty, one Hiqqah must be given and for each forty a Bint Labun' ”",
      "usc_msa_ref": "",
      "chain": [
        "34043",
        "20033",
        "20235",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "id": "sunan-ibn-majah-1877",
      "hadith_no": "1877",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters Regarding Zakat - كتاب الزكاة",
      "chapter_no": "8",
      "text_ar": "حدثنا بكر بن خلف، حدثنا عبد الرحمن بن مهدي، حدثنا سليمان بن كثير، حدثنا ابن شهاب، عن سالم بن عبد الله، عن أبيه، عن رسول الله  صلى الله عليه وسلم  قال أقرأني سالم كتابا كتبه رسول الله  صلى الله عليه وسلم  في الصدقات قبل أن يتوفاه الله فوجدت فيه ‏\"‏ في أربعين شاة شاة إلى عشرين ومائة فإذا زادت واحدة ففيها شاتان إلى مائتين فإذا زادت واحدة ففيها ثلاث شياه إلى ثلاثمائة فإذا كثرت ففي كل مائة شاة ‏\"‏ ‏.‏ ووجدت فيه ‏\"‏ لا يجمع بين متفرق ولا يفرق بين مجتمع ‏\"‏ ‏.‏ ووجدت فيه ‏\"‏ لا يؤخذ في الصدقة تيس ولا هرمة ولا ذات عوار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn Shihab, from Salim bin Abdullah, from his father, from the Messenger of Allah:                     Salim said: “My father read to me a letter that the Messenger of Allah (ﷺ) had written about Sadaqat before Allah caused him to pass away. I read in it: 'For forty sheep, one sheep, up to one hundred and twenty. If there is more than that - even one - then two sheep, up to two hundred, If there is one more than that - even one = then three sheep, up to three hundred. If there are many sheep, then for each hundred, one sheep.' And I read in it: 'Separate flocks should not be combined, and a combined flock should not be separated.' And I read in it: 'And a male goat should not be taken for Sadaqah, nor a decrepit nor defective animal.' ”",
      "usc_msa_ref": "",
      "chain": [
        "34043",
        "20033",
        "20235",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "id": "sunan-ibn-majah-1893",
      "hadith_no": "1893",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters Regarding Zakat - كتاب الزكاة",
      "chapter_no": "8",
      "text_ar": "حدثنا أبو بشر، بكر بن خلف حدثنا يحيى بن سعيد، عن عبد الحميد بن جعفر، حدثني صالح بن أبي عريب، عن كثير بن مرة الحضرمي، عن عوف بن مالك الأشجعي، قال خرج رسول الله  صلى الله عليه وسلم  وقد علق رجل قناء أو قنوا وبيده عصا فجعل يطعن بذلك يدقدق في ذلك القنو ويقول ‏\"‏ لو شاء رب هذه الصدقة تصدق بأطيب منها إن رب هذه الصدقة يأكل الحشف يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that:                     Awf bin Malik Al-Ashja'i said: “The Messenger of Allah went out, and a man had hung up one or more bunches of dates. He (the Prophet) had a stick in his hand and he started hitting that bunch of dates repeatedly, saying: 'If the owner of these dates wanted to give in charity, he should have given something better than these. The owner of this charity will eat rotten and shriveled dates on the Day of Resurrection.' ”",
      "usc_msa_ref": "",
      "chain": [
        "34043",
        "20031",
        "11875",
        "18431",
        "19940",
        "3051"
      ]
    },
    {
      "id": "sunan-ibn-majah-1968",
      "hadith_no": "1968",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا بكر بن خلف أبو بشر، حدثنا يزيد بن زريع، حدثنا داود بن أبي هند، حدثني عمرو بن سعيد، عن سعيد بن جبير، عن ابن عباس، أن النبي  صلى الله عليه وسلم  قال ‏\"‏ الحمد لله نحمده ونستعينه ونعوذ بالله من شرور أنفسنا ومن سيئات أعمالنا من يهده الله فلا مضل له ومن يضلل فلا هادي له وأشهد أن لا إله إلا الله وحده لا شريك له وأن محمدا عبده ورسوله ‏.‏ أما بعد ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that:                     the Prophet (ﷺ) said: “Al-hamdu lillahi nahmadhu wa nasta'inuhu wa na'udhu billahi min shururi anfusina wa min sayi'ati a'malina lahu, wa man yudil fala mudilla lahu, wa man yudil fala hadiaya lahu. Wa ashadu Anna la ilaha illallahu wahduhu la sharika lahu, wa rashulhu. Ammaba'd: (Praise is to Allah, we praise Him and we seek His help. We seek refuge with Allah from the evil of our own souls and from our bad deeds, Whomsoever is led astray; and whomsoever is led astray; no one can guide. I bear witness that none has the right to be worshiped but Allah, alone with no partner or associate, and that Muhammad is His slave and His Messenger To proceed:).”",
      "usc_msa_ref": "",
      "chain": [
        "34043",
        "20304",
        "11585",
        "10602",
        "11050",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-2067",
      "hadith_no": "2067",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع بن الجراح، ح وحدثنا أبو بشر، بكر بن خلف حدثنا يحيى بن سعيد، جميعا عن سفيان، عن إسماعيل بن أمية، عن عبد الله بن عروة، عن عروة، عن عائشة، قالت تزوجني النبي  صلى الله عليه وسلم  في شوال وبنى بي في شوال ‏.‏ فأى نسائه كان أحظى عنده مني ‏.‏ وكانت عائشة تستحب أن تدخل نساءها في شوال ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"The Prophet, married me in Shawwal, and he consummated the marriage with me in Shawwal, and which of his wives was more favored to him than I.\" 'Airhuh used to like marriage to be consummated with her female relatives in Shawwal.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20032",
        "34043",
        "11062",
        "20012",
        "11417",
        "11699",
        "10511",
        "53"
      ]
    },
    {
      "id": "sunan-ibn-majah-2132",
      "hadith_no": "2132",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Divorce - كتاب الطلاق",
      "chapter_no": "10",
      "text_ar": "حدثنا بكر بن خلف أبو بشر، حدثنا أبو عاصم، عن جعفر بن يحيى بن ثوبان، عن عمه، عمارة بن ثوبان عن عطاء، عن ابن عباس، أن النبي  صلى الله عليه وسلم  قال ‏\"‏ لا تسأل المرأة زوجها الطلاق في غير كنهه فتجد ريح الجنة ‏.‏ وإن ريحها ليوجد من مسيرة أربعين عاما ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that the Prophet (ﷺ) said:                     \"No woman asks for divorce when it is not absolutely necessary, but she will never smell the fragrance of paradise, although its fragrance can be detected from a distance of forty years' travel. \"",
      "usc_msa_ref": "",
      "chain": [
        "34043",
        "20241",
        "28085",
        "13539",
        "11029",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-2336-2",
      "hadith_no": "2336",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Rulings - كتاب الأحكام",
      "chapter_no": "13",
      "text_ar": "حدثنا أبو بشر، بكر بن خلف حدثنا أبو عاصم، عن ابن جريج، عن عمرو بن دينار، أن هشام بن يحيى، أخبره أن عكرمة بن سلمة أخبره أن أخوين من بلمغيرة أعتق أحدهما أن لا يغرز خشبا في جداره فأقبل مجمع بن يزيد ورجال كثير من الأنصار فقالوا نشهد أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يمنع أحدكم جاره أن يغرز خشبة في جداره ‏\"‏ ‏.‏ فقال يا أخي إنك مقضي لك على وقد حلفت فاجعل أسطوانا دون حائطي أو جداري فاجعل عليه خشبك ‏.‏",
      "text_en": " 'Ikrimah bin Salamh narrated that :                     there were two brothers from among the sons of Mughirah. One of them swore an oath to set a slave free if the other one fixed a piece of wood to his wall. Mujammi' bin Yazid  and many men from among the Ansar came and said: “We bear witness that the Messenger of Allah (ﷺ) said: 'None of you should refuse to let his neighbor fix a piece of wood to his wall.' ” He said: 'O my brother, judgment has been passed in your favor against me, but I have sworn an oath.' So go ahead and fix your wood to my wall.”",
      "usc_msa_ref": "",
      "chain": [
        "34043",
        "20241",
        "11070",
        "11081"
      ]
    },
    {
      "id": "sunan-ibn-majah-2465",
      "hadith_no": "2465",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Gifts - كتاب الهبات",
      "chapter_no": "14",
      "text_ar": "حدثنا أبو بشر، بكر بن خلف حدثنا يزيد بن زريع، عن داود بن أبي هند، عن الشعبي، عن النعمان بن بشير، قال انطلق به أبوه يحمله إلى النبي صلى الله عليه وسلم فقال اشهد أني قد نحلت النعمان من مالي كذا وكذا ‏.‏ قال ‏\"‏ فكل بنيك نحلت مثل الذي نحلت النعمان ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ فأشهد على هذا غيري ‏\"‏ ‏.‏ قال ‏\"‏ أليس يسرك أن يكونوا لك في البر سواء ‏\"‏ ‏.‏ قال بلى ‏.‏ قال ‏\"‏ فلا إذا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Nu'man bin Bashir said that his father took him to the Prophet (ﷺ) and said:                     “Bear witness that I have given Nu'man such and such from my wealth.” He said: “Have you given all your children something like that which you have given to Nu'man?” He said: “No.” He said: “Then let someone other than me bear witness to that.” And he said: “Would you not like all your children to honor you equally?” He said: “Of course.” He said: “Then do not do this.”",
      "usc_msa_ref": "",
      "chain": [
        "34043",
        "20304",
        "11585",
        "11052",
        "274"
      ]
    },
    {
      "id": "sunan-ibn-majah-2647",
      "hadith_no": "2647",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا بكر بن خلف أبو بشر، حدثنا يحيى بن سعيد، عن سعيد بن أبي عروبة، عن قتادة، عن يونس بن جبير، عن حطان بن عبد الله، عن عبادة بن الصامت، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ خذوا عني خذوا عني قد جعل الله لهن سبيلا البكر بالبكر جلد مائة وتغريب سنة والثيب بالثيب جلد مائة والرجم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from `Ubadah bin Samit that the Messenger of Allah (ﷺ) said:                     “Learn from me. Allah (SWT) has ordained for them (women) another way. (If) a virgin (commits illegal sexual intercourse)  with a virgin, (the punishment is) one hundred lashes and exile for one year. (If) a Thayyib (commits adultery) with a Thayyib (the punishment is) one hundred lashes and stoning.”",
      "usc_msa_ref": "",
      "chain": [
        "34043",
        "20031",
        "11073",
        "11019",
        "11320",
        "40"
      ]
    },
    {
      "id": "sunan-ibn-majah-2707",
      "hadith_no": "2707",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا أبو بشر، بكر بن خلف حدثنا ابن أبي الضيف، حدثنا عبد الله بن عثمان بن خثيم، عن سعيد بن جبير، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من انتسب إلى غير أبيه أو تولى غير مواليه فعليه لعنة الله والملائكة والناس أجمعين ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn Abbas that the Messenger of Allah (ﷺ) said:                     “Whoever claims to belong to someone other than his father, or (a freed slave) who claims that his Wala is for other than his real master, the curse of Allah (SWT), the angels and all the people will be upon him.”",
      "usc_msa_ref": "",
      "chain": [
        "34043",
        "10644",
        "11050",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-2970",
      "hadith_no": "2970",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن بشار، وأبو بشر بكر بن خلف قالا حدثنا يحيى بن سعيد، حدثنا شعبة، حدثني أبو التياح، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ اسمعوا وأطيعوا وإن استعمل عليكم عبد حبشي كأن رأسه زبيبة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Anas bin Malik that the Messenger of Allah (ﷺ)said:                     “Listen and obey, even if the one appointed over you is anEthiopian slave with a head like a raisin.”",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "34043",
        "20031",
        "20020",
        "11317",
        "19"
      ]
    },
    {
      "id": "sunan-ibn-majah-3003",
      "hadith_no": "3003",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بشر، بكر بن خلف حدثنا ابن أبي عدي، عن داود بن أبي هند، عن أبي العالية، عن ابن عباس، قال كنا مع رسول الله  صلى الله عليه وسلم  بين مكة والمدينة فمررنا بواد فقال ‏\"‏ أى واد هذا ‏\"‏ ‏.‏ قالوا وادي الأزرق ‏.‏ قال ‏\"‏ كأني أنظر إلى موسى  صلى الله عليه وسلم  - فذكر من طول شعره شيئا لا يحفظه داود - واضعا إصبعيه في أذنيه له جؤار إلى الله بالتلبية مارا بهذا الوادي ‏\"‏ ‏.‏ قال ثم سرنا حتى أتينا على ثنية فقال ‏\"‏ أى ثنية هذه ‏\"‏ ‏.‏ قالوا ثنية هرشى أو لفت ‏.‏ قال ‏\"‏ كأني أنظر إلى يونس على ناقة حمراء عليه جبة صوف وخطام ناقته خلبة مارا بهذا الوادي ملبيا ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “We were with the Messenger ofAllah (ﷺ) between Makkah and Al-Madinah, and we passed through avalley. He said: ‘What valley is this?’ They said: ‘AzraqValley.’ Hesaid: ‘It is as if I can see Musa (as) – and hementioned somethingabout the length of his hair, which Dawud (one ofthe narrators) didnot remember – ‘putting his fingers in hisears and raising his voiceto Allah reciting the Talbiyah, passingthrough this valley.’ Then wetraveled on until we came to a narrowpass, and he said: ‘What pass isthis?’ They said: ‘ThaniyyatHarsha’ or ‘Laft.’ He said: ‘It is as ifI can see Yunus, ona red she-camel, wearing a woollen cloak andholding the reins of hisshe-camel, woven from palm fibres, passingthrough this valley,reciting the Talbiyah.’”",
      "usc_msa_ref": "",
      "chain": [
        "34043",
        "20276",
        "11585",
        "11618",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-3051",
      "hadith_no": "3051",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بشر، بكر بن خلف حدثنا أبو عاصم، عن ابن جريج، أخبرني أبو الزبير، أنه سمع طاوسا، وعكرمة، يحدثان عن ابن عباس، قال جاءت ضباعة بنت الزبير بن عبد المطلب رسول الله  صلى الله عليه وسلم  فقالت إني امرأة ثقيلة وإني أريد الحج فكيف أهل قال ‏\"‏ أهلي واشترطي أن محلي حيث حبستني ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      Duba’ah bint Zubair bin‘Abdul-Muttalib came to the Messenger of Allah (ﷺ) and said: “Iam a heavywoman and I want to go for Hajj. How should I enterIhram?” He said:“Enter Ihram and stipulate the condition thatyou will exit Ihram fromthe point where you are prevented.”",
      "usc_msa_ref": "",
      "chain": [
        "34043",
        "20241",
        "11070",
        "11263",
        "11053",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-3097",
      "hadith_no": "3097",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا بكر بن خلف أبو بشر، حدثنا أبو عاصم، أنبأنا ابن جريج، أخبرني منصور بن عبد الرحمن، عن أمه، صفية عن أسماء بنت أبي بكر، قالت خرجنا مع رسول الله  صلى الله عليه وسلم  محرمين فقال النبي  صلى الله عليه وسلم  ‏\"‏ من كان معه هدى فليقم على إحرامه ومن لم يكن معه هدى فليحلل ‏\"‏ ‏.‏ قالت ولم يكن معي هدى فأحللت وكان مع الزبير هدى فلم يحل فلبست ثيابي وجئت إلى الزبير فقال قومي عني ‏.‏ فقلت أتخشى أن أثب عليك ‏.‏",
      "text_en": " It wasnarrated that Asma’ bint Abi Bakr said:                      “We went out with theMessenger of Allah (ﷺ) in Ihram. The Prophet (ﷺ) said: ‘Whoeverhas a sacrificial animal with him, let him remain in Ihram. Whoeverdoes not have a sacrificial animal with him, let him exit Ihram.’Shesaid: ‘I did not have a sacrificial animal with me, so I exitedIhram,but Zubair had a sacrificial animal with him, so he did notexitIhram. So I put on my regular clothes and came to Zubair, and hesaid:‘Go away from me.’ I said: ‘Are you afraid I am going tojump onyou?!’”",
      "usc_msa_ref": "",
      "chain": [
        "34043",
        "20241",
        "11070",
        "11565",
        "70"
      ]
    },
    {
      "id": "sunan-ibn-majah-3155",
      "hadith_no": "3155",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا بكر بن خلف أبو بشر، حدثنا حمزة بن الحارث بن عمير، عن أبيه، عن أيوب، عن سعيد بن جبير، عن ابن عباس، أن النبي  صلى الله عليه وسلم  لبى حتى رمى جمرة العقبة ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Abbas that the Prophet (ﷺ) recitedTalbiyahuntil he stoned ‘Aqabah Pillar.",
      "usc_msa_ref": "",
      "chain": [
        "34043",
        "11015",
        "11050",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-3166",
      "hadith_no": "3166",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بشر، بكر بن خلف حدثنا يزيد بن زريع، عن خالد الحذاء، عن عكرمة، عن ابن عباس، قال كان رسول الله  صلى الله عليه وسلم  يسأل يوم منى فيقول ‏\"‏ لا حرج لا حرج ‏\"‏ ‏.‏ فأتاه رجل فقال حلقت قبل أن أذبح قال ‏\"‏ لا حرج ‏\"‏ ‏.‏ قال رميت بعد ما أمسيت قال ‏\"‏ لا حرج ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “The Messenger of Allah (ﷺ)wasasked on the Day of Mina, and he would say: ‘There is no harm inthat, there is no harm in that.’ A man came to him and said: ‘Ishavedmy head before I slaughtered (my sacrifice),’ and he said:‘There isno harm in that.’ He said: ‘I stoned (the Pillar)after evening came,’and he said: ‘There is no harm in that.’”",
      "usc_msa_ref": "",
      "chain": [
        "34043",
        "20304",
        "11282",
        "11023",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-3175",
      "hadith_no": "3175",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا بكر بن خلف أبو بشر، حدثنا يحيى بن سعيد، حدثنا سفيان، حدثني محمد بن طارق، عن طاوس، وأبو الزبير، عن عائشة، وابن، عباس أن النبي  صلى الله عليه وسلم  أخر طواف الزيارة إلى الليل ‏.‏",
      "text_en": " It wasnarrated from ‘Aishah and Ibn ‘Abbas that the Prophet (ﷺ)delayed Tawafuz-Ziyarah until nighttime.",
      "usc_msa_ref": "",
      "chain": [
        "34043",
        "20031",
        "20012",
        "11053",
        "11263",
        "53",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-3200",
      "hadith_no": "3200",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا بكر بن خلف أبو بشر، حدثنا محمد بن أبي الضيف، عن ابن خثيم، عن أبي الزبير، عن جابر، أن النبي  صلى الله عليه وسلم  احتجم وهو محرم من رهصة أخذته ‏.‏",
      "text_en": " It wasnarrated from Jabir that the Prophet (ﷺ) was treated withcuppingwhen he was in the state of Ihram, because he did not feelwell.",
      "usc_msa_ref": "",
      "chain": [
        "34043",
        "11263",
        "34"
      ]
    },
    {
      "id": "sunan-ibn-majah-3231",
      "hadith_no": "3231",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا بكر بن خلف، حدثنا معاذ بن هشام، حدثنا أبي، عن أيوب، عن نافع، عن ابن عمر، قال قال رسول الله  صلى الله عليه وسلم  من استطاع منكم أن يموت بالمدينة فليفعل فإني أشهد لمن مات بها ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Umar that the Messenger of Allah (ﷺ)said:                     ‘Whoever among you can die in Al-Madinah, let him do so, for Iwillbear witness in favor of those who die there.”",
      "usc_msa_ref": "",
      "chain": [
        "34043",
        "20287",
        "20295",
        "11015",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-ibn-majah-3287",
      "hadith_no": "3287",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Slaughtering - كتاب الذبائح",
      "chapter_no": "27",
      "text_ar": "حدثنا أبو بشر، بكر بن خلف حدثنا يزيد بن زريع، عن خالد الحذاء، عن أبي المليح، عن نبيشة، قال نادى رجل رسول الله  صلى الله عليه وسلم  فقال يا رسول الله إنا كنا نعتر عتيرة في الجاهلية في رجب فما تأمرنا قال ‏\"‏ اذبحوا لله عز وجل في أى شهر ما كان وبروا الله وأطعموا ‏\"‏ ‏.‏ قالوا يا رسول الله إنا كنا نفرع فرعا في الجاهلية فما تأمرنا قال ‏\"‏ في كل سائمة فرع تغذوه ماشيتك حتى إذا استحمل ذبحته فتصدقت بلحمه - أراه قال - على ابن السبيل فإن ذلك هو خير ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Nubaishah said:                      “A man called the Messenger ofAllah(ﷺ) and said: ‘O Messenger of Allah, we used to sacrifice the‘Atirah during the Ignorance days in Rajab,; what do you command ustodo?’ He said: “Sacrifice to Allah whatever month it is, dogood forthe sake of Allah and feed (the poor).’ They said: ‘OMessenger ofAllah, we used to sacrifice the Far’ah during theIgnorance days; whatdo you command us to do?’ He said: ‘Forevery Sa’imah* (flock ofgrazing animals), feed the firstborn asyou feed the rest of yourflock until it reaches an age where itcould be used to carry loads,then sacrifice it, and give its meat incharity’ – I** think he said –‘to the wayfarer, for that isgood.’”",
      "usc_msa_ref": "",
      "chain": [
        "34043",
        "20304",
        "11282",
        "11453"
      ]
    },
    {
      "id": "sunan-ibn-majah-3297",
      "hadith_no": "3297",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Slaughtering - كتاب الذبائح",
      "chapter_no": "27",
      "text_ar": "حدثنا أبو بشر، بكر بن خلف حدثنا غندر، حدثنا شعبة، سمعت حاضر بن مهاجر، يحدث عن سليمان بن يسار، عن زيد بن ثابت، أن ذئبا، نيب في شاة فذبحوها بمروة فرخص لهم رسول الله  صلى الله عليه وسلم  في أكلها ‏.‏",
      "text_en": " It wasnarrated from Zaid bin Thabit that a wolf bit a sheep, andtheyslaughtered it with a sharp-edged stone, and the Messenger ofAllah(ﷺ) allowed them to eat it.",
      "usc_msa_ref": "",
      "chain": [
        "34043",
        "20278",
        "20020",
        "11005",
        "49"
      ]
    },
    {
      "id": "sunan-ibn-majah-3312",
      "hadith_no": "3312",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Slaughtering - كتاب الذبائح",
      "chapter_no": "27",
      "text_ar": "حدثنا بكر بن خلف أبو بشر، حدثنا أبو عاصم، حدثنا ابن جريج، أخبرني أبو الزبير، أنه سمع جابر بن عبد الله، يقول أكلنا زمن خيبر الخيل وحمر الوحش ‏.‏",
      "text_en": " It wasnarrated from Abu Zubair that he heard Jabir bin ‘Abdullahsay:                      “Atthe time of Khaibar we ate horses and wild donkeys.”",
      "usc_msa_ref": "",
      "chain": [
        "34043",
        "20241",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "id": "sunan-ibn-majah-3356",
      "hadith_no": "3356",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hunting - كتاب الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا بكر بن خلف، حدثنا ابن أبي عدي، عن سعيد، عن علي بن الحكم، عن ميمون بن مهران، عن سعيد بن جبير، عن ابن عباس، قال نهى رسول الله  صلى الله عليه وسلم  يوم خيبر عن أكل كل ذي ناب من السباع وعن كل ذي مخلب من الطير ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “On the Day of Khaibar, theMessenger of Allah (ﷺ) forbade eating any predatory animal that hasfangs and any bird that has talons.”",
      "usc_msa_ref": "",
      "chain": [
        "34043",
        "20276",
        "11168",
        "11012",
        "11050",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-3433",
      "hadith_no": "3433",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا بكر بن خلف أبو بشر، حدثنا يحيى بن سعيد، عن مسعر، حدثني شيخ، من فهم - قال وأظنه يسمى محمد بن عبد الله - أنه سمع عبد الله بن جعفر يحدث ابن الزبير وقد نحر لهم جزورا أو بعيرا أنه سمع رسول الله  صلى الله عليه وسلم  - قال والقوم يلقون لرسول الله  صلى الله عليه وسلم  اللحم - يقول ‏\"‏ أطيب اللحم لحم الظهر ‏\"‏ ‏.‏",
      "text_en": " ‘Abdullah bin Ja’far told Ibn Zubair, who had slaughtered a camelforthem, that he heard the Messenger of Allah (ﷺ), and he(‘Abdullah)said:                      “Some people were bringing meat to theMessenger of Allah (ﷺ)and he said: ‘The best meat is the meat ofthe back.’”",
      "usc_msa_ref": "",
      "chain": [
        "34043",
        "20031",
        "20359",
        "108"
      ]
    },
    {
      "id": "sunan-ibn-majah-3455",
      "hadith_no": "3455",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا أبو بشر، بكر بن خلف حدثنا يحيى بن محمد بن قيس المدني، حدثنا هشام بن عروة، عن أبيه، عن عائشة، قالت قال رسول الله  صلى الله عليه وسلم  ‏\"‏ كلوا البلح بالتمر كلوا الخلق بالجديد فإن الشيطان يغضب ويقول بقي ابن آدم حتى أكل الخلق بالجديد ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Aishah that the Messenger of Allah (ﷺ) said:                     “Eatunripe dates with ripe one and eat old dates with new ones, for Satan gets angry and says: ‘Thesonof Adam will survive so long as he eats old dates with new ones.’”",
      "usc_msa_ref": "",
      "chain": [
        "34043",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "id": "sunan-ibn-majah-3458",
      "hadith_no": "3458",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا أبو بشر، بكر بن خلف حدثنا أبو قتيبة، عن همام، عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك، قال رأيت رسول الله  صلى الله عليه وسلم  أتي بتمر عتيق فجعل يفتشه ‏.‏",
      "text_en": " It wasnarrated that Anas bin Malik said:                      “I saw the Messenger ofAllah(ﷺ) when he was brought some old dates; he started to inspectthem.”",
      "usc_msa_ref": "",
      "chain": [
        "34043",
        "20233",
        "20297",
        "11151",
        "19"
      ]
    },
    {
      "id": "sunan-ibn-majah-3547",
      "hadith_no": "3547",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Drinks - كتاب الأشربة",
      "chapter_no": "30",
      "text_ar": "حدثنا بكر بن خلف أبو بشر، حدثنا يزيد بن زريع، حدثنا خالد الحذاء، عن عكرمة، عن ابن عباس، أن رسول الله  صلى الله عليه وسلم  نهى أن يشرب من فم السقاء ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “The Messenger of Allah (ﷺ)forbade drinking (directly) from the mouth of a water skin.”",
      "usc_msa_ref": "",
      "chain": [
        "34043",
        "20304",
        "11282",
        "11023",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-3554",
      "hadith_no": "3554",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Drinks - كتاب الأشربة",
      "chapter_no": "30",
      "text_ar": "حدثنا بكر بن خلف أبو بشر، حدثنا يزيد بن زريع، عن خالد الحذاء، عن عكرمة، عن ابن عباس، قال نهى رسول الله  صلى الله عليه وسلم  عن التنفس في الإناء ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “The Messenger of Allah (ﷺ)forbade breathing into the vessel.”",
      "usc_msa_ref": "",
      "chain": [
        "34043",
        "20304",
        "11282",
        "11023",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-3577",
      "hadith_no": "3577",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا أبو بشر، بكر بن خلف حدثنا عمر بن سهل، حدثنا أبو حمزة العطار، عن الحسن، عن جابر بن عبد الله، قال أهدي للنبي  صلى الله عليه وسلم  عسل فقسم بيننا لعقة لعقة فأخذت لعقتي ثم قلت يا رسول الله أزداد أخرى قال ‏\"‏ نعم ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Jabir bin ‘Abdullah said:                      “Some honey was givenasa gift to the Prophet (ﷺ), and he shared among us spoonful byspoonful. I took my spoonful then I said: ‘O Messenger of Allah,can Ihave another?’ He said: ‘Yes.’”",
      "usc_msa_ref": "",
      "chain": [
        "34043",
        "11016",
        "34"
      ]
    },
    {
      "id": "sunan-ibn-majah-3607",
      "hadith_no": "3607",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا أبو بشر، بكر بن خلف حدثنا عبد الأعلى، حدثنا عباد بن منصور، عن عكرمة، عن ابن عباس، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ نعم العبد الحجام يذهب بالدم ويخف الصلب ويجلو البصر ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “The Messenger of Allah (ﷺ)said: ‘What a good slave is the cupper. He takes away the blood,reduces pressure on the spine, and improves the eyesight.’”",
      "usc_msa_ref": "",
      "chain": [
        "34043",
        "20246",
        "19848",
        "11023",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-3809",
      "hadith_no": "3809",
      "source": "Sunan Ibn Majah",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بشر، بكر بن خلف حدثني يحيى بن سعيد، عن موسى بن أبي عيسى الطحان، عن عون بن عبد الله، عن أبيه، أو عن أخيه، عن النعمان بن بشير، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن مما تذكرون من جلال الله التسبيح والتهليل والتحميد ينعطفن حول العرش لهن دوي كدوي النحل تذكر بصاحبها أما يحب أحدكم أن يكون له - أو لا يزال له - من يذكر به ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Nu'man bin Bashir that :                     the Messenger of Allah (ﷺ) said: \"What you mention of glory of Allah, of Tabsih (Subhan-Allah), Tahlil (Allahu-Akbar) and Tahmid (Al-Hamdu lillah), revolves around the Throne, buzzing like bees, reminding of the one who said it.  Wouldn't any one of you like to have, or continue to have, something that reminds of him (in the presence of Allah)?'\"",
      "usc_msa_ref": "",
      "chain": [
        "34043",
        "20031",
        "10620",
        "10806",
        "11004",
        "274"
      ]
    },
    {
      "id": "sunan-ibn-majah-3865",
      "hadith_no": "3865",
      "source": "Sunan Ibn Majah",
      "chapter": "Supplication - كتاب الدعاء",
      "chapter_no": "34",
      "text_ar": "حدثنا أبو بشر، بكر بن خلف حدثنا ابن أبي عدي، عن جعفر بن ميمون، عن أبي عثمان، عن سلمان، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ إن ربكم حيي كريم يستحيي من عبده أن يرفع إليه يديه فيردهما صفرا - أو قال خائبتين ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Salman that the :                     Prophet (saas) said: \"Your Lord is Kind and Most Generous, and is too kind to let His slave, if he raises his hands to Him, bring them back empty,\" or he said \"frustrated.\"",
      "usc_msa_ref": "",
      "chain": [
        "34043",
        "20276",
        "18132",
        "11113",
        "14"
      ]
    },
    {
      "id": "sunan-ibn-majah-3887",
      "hadith_no": "3887",
      "source": "Sunan Ibn Majah",
      "chapter": "Supplication - كتاب الدعاء",
      "chapter_no": "34",
      "text_ar": "حدثنا أبو بشر، بكر بن خلف حدثنا أبو عاصم، عن ابن جريج، أخبرني أبو الزبير، عن جابر بن عبد الله، أنه سمع النبي  صلى الله عليه وسلم  يقول ‏\"‏ إذا دخل الرجل بيته فذكر الله عند دخوله وعند طعامه قال الشيطان لا مبيت لكم ولا عشاء ‏.‏ وإذا دخل ولم يذكر الله عند دخوله قال الشيطان أدركتم المبيت ‏.‏ فإذا لم يذكر الله عند طعامه قال أدركتم المبيت والعشاء ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Jabir bin ‘Abdullah that he heard the Prophet (ﷺ) say:                      “When a man enters his house, and remembers Allah when he enters and when he eats, Satan says: ‘You have no place to stay and no supper.’ If he enters his house and does not remember Allah upon entering, Satan says: ‘You have found a place to stay.’ And if he does not remember Allah when he eats, (Satan) says: ‘You have found a place to stay and supper.’”",
      "usc_msa_ref": "",
      "chain": [
        "34043",
        "20241",
        "11070",
        "11263",
        "34"
      ]
    }
  ],
  "total_hadiths": 59
}