{
  "id": "34055",
  "name": "al-Hasan bin Qz'h الحسن بن قزعة",
  "full_name": "al-Hasan bin Qz'h الحسن بن قزعة",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "250",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ ت  س  ق  -  صدوق ]"
    ],
    "tags": [
      "B.Hashim",
      "Client",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20568",
      "name": "Muslimh bin 'Alqama al-Mazny مسلمة بن علقمة المازني",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20288",
      "name": "Ma'tmar bin Sulaiman-al-Taufayl معتمر بن سليمان - الطفيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20226",
      "name": "Khalid bin al-Harith bin 'Ubaid خالد بن الحارث بن عبيد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20711",
      "name": "Sufyan bin Habib al-Basri سفيان بن حبيب البصري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "18195",
      "name": "Husayn bin Nmyr al-Kndy Thm حصين بن نمير",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "20200",
      "name": "Fadayl bin 'Iyyad bin Mas'ud فضيل بن عياض بن مسعود",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20243",
      "name": "'Aabad bin 'Aabad bin Habib عباد بن عباد بن حبيب بن المهلب",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20281",
      "name": "Muhammad bin 'Abdur Rahman al-Tafawi محمد بن عبد الرحمن الطفاوي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "students": [
    {
      "id": "30005",
      "name": "Imam Tirmidhi الترمذي محمد بن عيسى بن سورة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30006",
      "name": "Imam Nasa'i أحمد بن شعيب بن علي بن سنان النسائي",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30004",
      "name": "Ibn Maja ابن ماجة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30554",
      "name": "Abu Zara' al-Razi أبو زرعة الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30349",
      "name": "'Abdullah bin 'Uthman - ''Aabadan عبد الله بن عثمان - عبدان",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30013",
      "name": "Ibn Abi Dunya ابن أبي الدنيا",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30467",
      "name": "'Abdullah bin 'Amir عبد الله بن عامر بن زرارة الحضرمي",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "jami-al-tirmidhi-1241",
      "hadith_no": "1241",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Divorce and Li'an - كتاب الطلاق واللعان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "13",
      "text_ar": "حدثنا الحسن بن قزعة البصري، أنبأنا مسلمة بن علقمة، أنبأنا داود بن علي، عن عامر، عن مسروق، عن عائشة، قالت آلى رسول الله صلى الله عليه وسلم من نسائه وحرم فجعل الحرام حلالا وجعل في اليمين كفارة ‏.‏ قال وفي الباب عن أنس وأبي موسى ‏.‏ قال أبو عيسى حديث مسلمة بن علقمة عن داود رواه علي بن مسهر وغيره عن داود عن الشعبي أن النبي صلى الله عليه وسلم ‏.‏ مرسلا ‏.‏ وليس فيه عن مسروق عن عائشة وهذا أصح من حديث مسلمة بن علقمة ‏.‏ والإيلاء هو أن يحلف الرجل أن لا يقرب امرأته أربعة أشهر فأكثر ‏.‏ واختلف أهل العلم فيه إذا مضت أربعة أشهر فقال بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم إذا مضت أربعة أشهر يوقف فإما أن يفيء وإما أن يطلق ‏.‏ وهو قول مالك بن أنس والشافعي وأحمد وإسحاق ‏.‏ وقال بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم إذا مضت أربعة أشهر فهي تطليقة بائنة ‏.‏ وهو قول سفيان الثوري وأهل الكوفة ‏.‏",
      "text_en": " Aishah narrated:                     \"The Messenger of Allah swore Ila from his wives, and he made something unlawful and he made himself unlawful what was lawful, and he made atonement for his oath.\"",
      "usc_msa_ref": "",
      "chain": [
        "34055",
        "20568",
        "13020",
        "11052",
        "11018",
        "53"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1284",
      "hadith_no": "1284",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا الحسن بن قزعة، أخبرنا عبد الرحمن بن مهدي، عن حماد بن سلمة، عن الحجاج، عن الحكم، عن ميمون بن أبي شبيب، عن علي، قال وهب لي رسول الله صلى الله عليه وسلم غلامين أخوين فبعت أحدهما فقال لي رسول الله صلى الله عليه وسلم ‏\"‏ يا علي ما فعل غلامك ‏\"‏ ‏.‏ فأخبرته فقال ‏\"‏ رده رده ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ وقد كره بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم التفريق بين السبى في البيع ويكره أن يفرق بين الوالدة وولدها وبين الوالد والولد وبين الإخوة والأخوات في البيع ‏.‏ ورخص بعض أهل العلم في التفريق بين المولدات الذين ولدوا في أرض الإسلام ‏.‏ والقول الأول أصح ‏.‏ وروي عن إبراهيم النخعي أنه فرق بين والدة وولدها في البيع فقيل له في ذلك فقال إني قد استأذنتها بذلك فرضيت ‏.‏",
      "text_en": " Narrated 'Ali :                     \"The Messenger of Allah (ﷺ) gave me two boys who were brothers, so I sold one of them, and the Messenger of Allah (ﷺ) said to me: 'O, 'Ali! What happened to your boy?' So I informed him, and he said: 'Return him, return him.'\"[Abu 'Eisa said:] This Hadith is Hasan Gharib. Some of the people of knowledge among the Companions of the Prophet (ﷺ) and others, disliked separating between the captives when selling them.Some of the people of knowledge permitted separating the children that were born in the land of Islam, but the first view is more correct. It has been related that Ibrahim An-Nakha'i seperated a mother and her child in a sale, so he was asked about that. He said: \"I sought her permission for that and she approved.\"",
      "usc_msa_ref": "",
      "chain": [
        "34055",
        "20033",
        "20021",
        "20381",
        "11069",
        "10834",
        "5",
        "20298"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3338",
      "hadith_no": "3338",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا الحسن بن قزعة، حدثنا سفيان بن حبيب، حدثنا سعيد، عن قتادة، عن خلاس بن عمرو، عن عمار بن ياسر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أنزلت المائدة من السماء خبزا ولحما وأمروا أن لا يخونوا ولا يدخروا لغد فخانوا وادخروا ورفعوا لغد فمسخوا قردة وخنازير ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏ قد رواه أبو عاصم وغير واحد عن سعيد بن أبي عروبة عن قتادة عن خلاس عن عمار بن ياسر موقوفا ولا نعرفه مرفوعا إلا من حديث الحسن بن قزعة ‏.‏",
      "text_en": " Narrated 'Ammar bin Yasir:                     \"The Messenger of Allah (ﷺ) said: 'The Ma'idah was sent down from the Heavens with bread and meat. And they were commanded to not be deceitful with it and hide it for tomorrow. So they were deceitful with it and they hid it, so it was raised up in the morning. Then they were transformed into monkeys and pigs.'\"",
      "usc_msa_ref": "",
      "chain": [
        "34055",
        "20711",
        "11168",
        "11019",
        "11283",
        "25"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3516",
      "hadith_no": "3516",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا الحسن بن قزعة، - بصري - حدثنا مسلمة بن علقمة، عن داود بن أبي هند، عن عامر الشعبي، في قول الله عز وجل ‏:‏ ‏(‏ ما كان محمد أبا أحد من رجالكم ‏)‏ قال ما كان ليعيش له فيكم ولد ذكر ‏.‏",
      "text_en": " Narrated Dawud bin Abi Hind:                     from Ash-Sha'bi regarding the saying of Allah [the Mighty and Sublime]: 'Muhammad is not the father of any one of your men (33:40)' he said: \"No male children of his would live among them.\"",
      "usc_msa_ref": "",
      "chain": [
        "34055",
        "20568",
        "11585"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3575",
      "hadith_no": "3575",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا الحسن بن قزعة البصري، حدثنا سفيان بن حبيب، عن شعبة، عن ثوير، عن أبيه، عن الطفيل بن أبى بن كعب، عن أبيه، عن النبي صلى الله عليه وسلم ‏:‏ ‏(‏ وألزمهم كلمة التقوى ‏)‏ قال لا إله إلا الله ‏.‏ قال هذا حديث غريب لا نعرفه مرفوعا إلا من حديث الحسن بن قزعة قال وسألت أبا زرعة عن هذا الحديث فلم يعرفه مرفوعا إلا من هذا الوجه ‏.‏",
      "text_en": " Narrated At-Tufail bin Ubayy bin Ka'b:                     from his father, from the Prophet (ﷺ) (regarding this Ayah): 'And made them stick to the word of Taqwa (48:26).' He (ﷺ) said (the word is): \"La Ilaha Illallah.\"",
      "usc_msa_ref": "",
      "chain": [
        "34055",
        "20711",
        "20020",
        "13898"
      ]
    },
    {
      "id": "sunan-an-nasai-1731",
      "hadith_no": "1731",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا الحسن بن قزعة، عن حصين بن نمير، عن حصين بن عبد الرحمن، عن ذر، عن ابن عبد الرحمن بن أبزى، عن أبيه، أن رسول الله صلى الله عليه وسلم كان يقرأ في الوتر ب ‏{‏ سبح اسم ربك الأعلى ‏}‏ و ‏{‏ قل يا أيها الكافرون ‏}‏ و ‏{‏ قل هو الله أحد ‏}‏",
      "text_en": " It was narrated from Ibn Abdur-Rahman bin Abza from his father that:                     The Messenger of Allah (ﷺ) used to recite in Witr: \"Glorify the Name of your Lord, the Most High;\" and \"Say: O you disbelievers!;' and 'Say: He is Allah, (the) One.'\"",
      "usc_msa_ref": "",
      "chain": [
        "34055",
        "18195",
        "15097",
        "11423",
        "11346",
        "4046"
      ]
    },
    {
      "id": "sunan-an-nasai-1997",
      "hadith_no": "1997",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا الحسن بن قزعة، قال حدثنا مسلمة بن علقمة، قال أنبأنا داود، عن عامر، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من تبع جنازة فصلى عليها ثم انصرف فله قيراط من الأجر ومن تبعها فصلى عليها ثم قعد حتى يفرغ من دفنها فله قيراطان من الأجر كل واحد منهما أعظم من أحد ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah said: 'Whoever follows a funeral and offers the funeral prayer then leaves, will have one Qirat reward. And whoever follows it and offers the funeral prayer then stays until the burial is completed will have two Qirat of reward, both of which are greater than Uhud.\"",
      "usc_msa_ref": "",
      "chain": [
        "34055",
        "20568",
        "11052",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-2249",
      "hadith_no": "2249",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا الحسن بن قزعة، عن حميد بن الأسود، قال حدثنا سهيل، عن النعمان بن أبي عياش، قال سمعت أبا سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من صام يوما في سبيل الله عز وجل باعده الله عن النار سبعين خريفا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that An-Numan bin Abi 'Ayyash said:                     \"I heard Abu Saeed Al-Khudri say: 'The Messenger of Allah said: Whoever fasts one day in the cause of Allah will separate his face from the fire by (a distance of) seventy autumns.\"'",
      "usc_msa_ref": "",
      "chain": [
        "34055",
        "20225",
        "11542",
        "38"
      ]
    },
    {
      "id": "sunan-an-nasai-3220",
      "hadith_no": "3220",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا الحسن بن قزعة، قال حدثنا سفيان، - وهو ابن حبيب - عن ابن جريج، عن عطاء، عن جابر، قال لقيني رسول الله صلى الله عليه وسلم فقال ‏\"‏ يا جابر هل أصبت امرأة بعدي ‏\"‏ ‏.‏ قلت نعم يا رسول الله ‏.‏ قال ‏\"‏ أبكرا أم أيما ‏\"‏ ‏.‏ قلت أيما ‏.‏ قال ‏\"‏ فهلا بكرا تلاعبك ‏\"‏ ‏.‏",
      "text_en": " Narrated Jabir:                     It was narrated that Jabir said: \"The Messenger of Allah met me and said: 'O Jabir, have you got married to a woman since I last saw you?' I said: 'Yes, O Messenger of Allah.' He said: 'To a virgin or to a previously-married woman?' I said: 'To a previously-married woman.' He said: 'Why not a virgin, so she could play with you?'\"",
      "usc_msa_ref": "",
      "chain": [
        "34055",
        "20711",
        "11070",
        "11029",
        "34"
      ]
    },
    {
      "id": "sunan-an-nasai-5149",
      "hadith_no": "5149",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا الحسن بن قزعة، عن سفيان بن حبيب، عن خالد، عن أبي قلابة، عن معاوية، أن رسول الله صلى الله عليه وسلم نهى عن لبس الحرير والذهب إلا مقطعا ‏.‏ خالفه عبد الوهاب رواه عن خالد عن ميمون عن أبي قلابة ‏.‏",
      "text_en": " It was narrated from Mu'awiyah that:                     The Messenger of Allah [SAW] forbade wearing silk and gold, unless it was broken (into smaller pieces).",
      "usc_msa_ref": "",
      "chain": [
        "34055",
        "20711",
        "20423",
        "11047",
        "27"
      ]
    },
    {
      "id": "sunan-an-nasai-5175",
      "hadith_no": "5175",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا الحسن بن قزعة، قال حدثنا خالد بن الحارث، قال حدثنا محمد بن عمرو، عن إبراهيم بن عبد الله بن حنين، عن أبيه، قال سمعت عليا، يقول نهاني رسول الله صلى الله عليه وسلم ولا أقول نهاكم عن خاتم الذهب وعن القسي والمعصفر وأن لا أقرأ وأنا راكع ‏.‏",
      "text_en": " It was narrated from Ibrahim bin 'Abdullah bin Hunain that his father said:                     \"I heard 'Ali say: 'The Messenger of Allah [SAW] forbade me- but I do not say that he forbade you- from wearing gold rings, Al-Qassi, and garments dyed with safflower, and reciting Qur'an while bowing.'\"",
      "usc_msa_ref": "",
      "chain": [
        "34055",
        "20226",
        "11220",
        "11150",
        "11181",
        "5"
      ]
    },
    {
      "id": "sunan-an-nasai-5302",
      "hadith_no": "5302",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا الحسن بن قزعة، عن خالد، - وهو ابن الحارث - قال حدثنا محمد بن عمرو، عن واقد بن عمرو بن سعد بن معاذ، قال دخلت على أنس بن مالك حين قدم المدينة فسلمت عليه فقال ممن أنت قلت أنا واقد بن عمرو بن سعد بن معاذ ‏.‏ قال إن سعدا كان أعظم الناس وأطوله ‏.‏ ثم بكى فأكثر البكاء ثم قال إن رسول الله صلى الله عليه وسلم بعث إلى أكيدر صاحب دومة بعثا فأرسل إليه بجبة ديباج منسوجة فيها الذهب فلبسه رسول الله صلى الله عليه وسلم ثم قام على المنبر وقعد فلم يتكلم ونزل فجعل الناس يلمسونها بأيديهم فقال ‏\"‏ أتعجبون من هذه لمناديل سعد في الجنة أحسن مما ترون ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Wafid bin 'Amr bin Sa'd bin Mu'adh said:                     \"I entered upon Anas bin Malik when he came to Al-Madinah and greeted him with Salam. He said: 'Where are you from?' I said: 'I am Wafid bin 'Amr bin Sa'd bin Mu'adh.' He said: 'Sa'd was the greatest and most virtuous of people.' Then he wept a great deal, then he said: 'The Messenger of Allah [SAW] sent a delegation to Ukaidir the ruler of Dumah, who sent him a Jubbah made of Ad-Dibaj interwoven with gold. The Messenger of Allah [SAW] put it on, then he stood on the Minbar and sat, without speaking, then he came down and the people started touching it with their hands. He said: 'Are you admiring this? The handkerchiefs of Sa'd in Paradise are more beautiful than what you see.'\"",
      "usc_msa_ref": "",
      "chain": [
        "34055",
        "20226",
        "11220",
        "10621",
        "9"
      ]
    },
    {
      "id": "sunan-an-nasai-5366",
      "hadith_no": "5366",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا الحسن بن قزعة، عن سفيان بن حبيب، ومعتمر بن سليمان، عن أشعث، عن محمد بن سيرين، عن عبد الله بن شقيق، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم لا يصلي في لحفنا ‏.‏ قال سفيان ملاحفنا ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"The Messenger of Allah [SAW] would not pray in our blankets.\"",
      "usc_msa_ref": "",
      "chain": [
        "34055",
        "20711",
        "20288",
        "11324",
        "11035",
        "10694",
        "53"
      ]
    },
    {
      "id": "sunan-ibn-majah-2150",
      "hadith_no": "2150",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Divorce - كتاب الطلاق",
      "chapter_no": "10",
      "text_ar": "حدثنا الحسن بن قزعة، حدثنا مسلمة بن علقمة، حدثنا داود بن أبي هند، عن عامر، عن مسروق، عن عائشة، قالت آلى رسول الله  صلى الله عليه وسلم  من نسائه وحرم فجعل الحرام حلالا ‏.‏ وجعل في اليمين كفارة ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"The Messenger of Allah swore to keep away from his wives and declared them as unlawful for him, so he made something permissible forbidden, and he offered expiation for having sworn to do so.\"",
      "usc_msa_ref": "",
      "chain": [
        "34055",
        "20568",
        "11585",
        "11052",
        "11018",
        "53"
      ]
    }
  ],
  "total_hadiths": 14
}