{
  "id": "34062",
  "name": "Hafs bin 'Umar Abu حفص بن عمر أبو عمر",
  "full_name": "Hafs bin 'Umar Abu حفص بن عمر أبو عمر",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "290",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [د  أبي  داود]"
    ],
    "tags": [
      "al-Basri"
    ],
    "area_of_interest_display": [
      {
        "en": "Narrator[Grade:Sadooq] [د  أبي  داود]",
        "ar": "Narrator[Grade:Sadooq] [د  أبي  داود]",
        "ckb": "Narrator[Grade:Sadooq] [د  أبي  داود]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "Basra",
        "ar": "البصرة",
        "ckb": "بەسرە"
      }
    ],
    "tags_display": [
      {
        "en": "al-Basri",
        "ar": "al-Basri",
        "ckb": "al-Basri"
      }
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "id": "sahih-bukhari-2801",
      "hadith_no": "2801",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا حفص بن عمر الحوضي، حدثنا همام، عن إسحاق، عن أنس  رضى الله عنه  قال بعث النبي صلى الله عليه وسلم أقواما من بني سليم إلى بني عامر في سبعين، فلما قدموا، قال لهم خالي أتقدمكم، فإن أمنوني حتى أبلغهم عن رسول الله صلى الله عليه وسلم وإلا كنتم مني قريبا‏.‏ فتقدم، فأمنوه، فبينما يحدثهم عن النبي صلى الله عليه وسلم إذ أومئوا إلى رجل منهم، فطعنه فأنفذه فقال الله أكبر، فزت ورب الكعبة‏.‏ ثم مالوا على بقية أصحابه فقتلوهم، إلا رجلا أعرج صعد الجبل‏.‏ قال همام فأراه آخر معه، فأخبر جبريل  عليه السلام  النبي صلى الله عليه وسلم أنهم قد لقوا ربهم، فرضي عنهم وأرضاهم، فكنا نقرأ أن بلغوا قومنا أن قد لقينا ربنا فرضي عنا وأرضانا‏.‏ ثم نسخ بعد، فدعا عليهم أربعين صباحا، على رعل وذكوان وبني لحيان وبني عصية الذين عصوا الله ورسوله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Anas:                     The Prophet sent seventy men from the tribe of Bani Salim to the tribe of Bani Amir. When they reached there, my maternal uncle said to them, \"I will go ahead of you, and if they allow me to convey the message of Allah's Apostle (it will be all right); otherwise you will remain close to me.\" So he went ahead of them and the pagans granted him security But while he was reporting the message of the Prophet , they beckoned to one of their men who stabbed him to death. My maternal uncle said, \"Allah is Greater! By the Lord of the Ka`ba, I am successful.\" After that they attached the rest of the party and killed them all except a lame man who went up to the top of the mountain. (Hammam, a sub-narrator said, \"I think another man was saved along with him).\" Gabriel informed the Prophet that they (i.e the martyrs) met their Lord, and He was pleased with them and made them pleased. We used to recite, \"Inform our people that we have met our Lord, He is pleased with us and He has made us pleased \" Later on this Qur'anic Verse was cancelled. The Prophet invoked Allah for forty days to curse the murderers from the tribe of Ral, Dhakwan, Bani Lihyan and Bam Usaiya who disobeyed Allah and his Apostle.",
      "usc_msa_ref": "57",
      "chain": [
        "34062",
        "20297",
        "30312",
        "19"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-4242",
      "hadith_no": "4242",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني محمد بن عبد الرحيم، حدثنا حفص بن عمر أبو عمر الحوضي، حدثنا حماد بن زيد، حدثنا أيوب، والحجاج الصواف، قال حدثني أبو رجاء، مولى أبي قلابة وكان معه بالشأم أن عمر بن عبد العزيز، استشار الناس يوما قال ما تقولون في هذه القسامة فقالوا حق، قضى بها رسول الله صلى الله عليه وسلم وقضت بها الخلفاء، قبلك‏.‏ قال وأبو قلابة خلف سريره فقال عنبسة بن سعيد فأين حديث أنس في العرنيين قال أبو قلابة إياى حدثه أنس بن مالك‏.‏ قال عبد العزيز بن صهيب عن أنس من عرينة‏.‏ وقال أبو قلابة عن أنس من عكل‏.‏ ذكر القصة‏.‏",
      "text_en": " Narrated Abu Raja:                     The freed slave of Abu Qilaba, who was with Abu Qilaba in Sham: `Umar bin `Abdul `Aziz consulted the people saying, \"What do you think of Qasama.\" They said, \"'It is a right (judgment) which Allah's Apostle and the Caliphs before you acted on.\" Abu Qilaba was behind `Umar's bed. 'Anbasa bin Sa`id said, But what about the narration concerning the people of `Uraina?\" Abu Qilaba said, \"Anas bin Malik narrated it to me,\" and then narrated the whole story.",
      "usc_msa_ref": "506",
      "chain": [
        "30272",
        "34062",
        "20022",
        "11015"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-5286",
      "hadith_no": "5286",
      "source": "Sahih Bukhari",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا حفص بن عمر الحوضي، حدثنا هشام، عن قتادة، عن أنس  رضى الله عنه  قال لأحدثنكم حديثا سمعته من رسول الله صلى الله عليه وسلم لا يحدثكم به أحد غيري، سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن من أشراط الساعة أن يرفع العلم، ويكثر الجهل ويكثر الزنا، ويكثر شرب الخمر، ويقل الرجال، ويكثر النساء حتى يكون لخمسين امرأة القيم الواحد ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     I will narrate to you a Habith I heard from Allah's Apostle and none other than I will tell you of it. I heard Allah's Apostle saying, \"From among the portents of the Hour are the following: Religious knowledge will be taken away; General ignorance (in religious matters) will increase; illegal Sexual intercourse will prevail: Drinking of alcoholic drinks will prevail. Men will decrease in number, and women will increase in number, so much so that fifty women will be looked after by one man.\"",
      "usc_msa_ref": "158",
      "chain": [
        "34062",
        "20295",
        "11019",
        "19"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sunan-an-nasai-4726",
      "hadith_no": "4726",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا عمرو بن منصور، قال حدثنا حفص بن عمر، - وهو الحوضي - قال حدثنا جامع بن مطر، عن علقمة بن وائل، عن أبيه، قال كنت قاعدا عند رسول الله صلى الله عليه وسلم جاء رجل في عنقه نسعة فقال يا رسول الله إن هذا وأخي كانا في جب يحفرانها فرفع المنقار فضرب به رأس صاحبه فقتله ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ اعف عنه ‏\"‏ ‏.‏ فأبى وقال يا نبي الله إن هذا وأخي كانا في جب يحفرانها فرفع المنقار فضرب به رأس صاحبه فقتله ‏.‏ فقال ‏\"‏ اعف عنه ‏\"‏ ‏.‏ فأبى ثم قام فقال يا رسول الله إن هذا وأخي كانا في جب يحفرانها فرفع المنقار - أراه قال - فضرب رأس صاحبه فقتله ‏.‏ فقال ‏\"‏ اعف عنه ‏\"‏ ‏.‏ فأبى قال ‏\"‏ اذهب إن قتلته كنت مثله ‏\"‏ ‏.‏ فخرج به حتى جاوز فناديناه أما تسمع ما يقول رسول الله صلى الله عليه وسلم فرجع فقال إن قتلته كنت مثله قال ‏\"‏ نعم اعف ‏\"‏ ‏.‏ فخرج يجر نسعته حتى خفي علينا ‏.‏",
      "text_en": " It was narrated from 'Alqamah bin Wa'il that his father said:                     \"I was sitting with the Messenger of Allah when a man came with a string around his neck and said: 'O Messenger of Allah, this man and my brother were digging a hole, and he raised his pickax and struck his companion in the head, Killing him. 'The Prophet said: 'Forgive him,' but he refused and said: 'O Prophet of Allah, this man and my brother were digging a whole, and he raised his pickax and struck his companion in the head, killing him.' The Prophet said: 'Forgive him,' but he refused, then he stood up and said: 'O Messenger of Allah, this man and my brother were digging a hole, and he raised his pickax and struck his companion in the head, killing him.' The Prophet said: 'Forgive him,' but he refused. He (the prophet) said: 'Go, but if you kill him, you will be like him. So he took him out, and they called out to him: Didn't you hear what the Messenger of Allah said?' So he came back and he said: 'If I kill him will I be like him?' He said: 'Yes. Forgive him.' Then he went out, dragging his string, until he disappeared from our view.\"",
      "usc_msa_ref": "",
      "chain": [
        "38433",
        "34062",
        "14056",
        "10801"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    }
  ],
  "total_hadiths": 4,
  "grade_display": {
    "en": "3rd Century AH [10th Generation]",
    "ar": "القرن الثالث الهجري [الجيل العاشر]",
    "ckb": "سەدەی سێیەمی كۆچی [نەوەی دەیەم]"
  }
}