{
  "id": "34120",
  "name": "'Abdullah bin Mua'wiya عبد الله بن معاوية بن موسى",
  "full_name": "'Abdullah bin Mua'wiya عبد الله بن معاوية بن موسى",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "243",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ د  ت  ق  -  ثقة ]"
    ],
    "tags": [
      "B.Jumah",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20215",
      "name": "Thabit bin Yazid al-Ahwl ثابت بن يزيد الأحول",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "24207",
      "name": "Salah bin Bashir bin Wada' - al-Mari صالح بن بشير بن وادع - المري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20021",
      "name": "Hammad bin Salama حماد بن سلمة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20022",
      "name": "Hammad bin Zayd حماد بن زيد بن درهم الأزدي الأزرق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20253",
      "name": "'Abdul 'Aziz bin Muslim al-Qasimali عبد العزيز بن مسلم القسملي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "24359",
      "name": "Ghsan bin Brzyn غسان بن برزين",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11307",
      "name": "Mahdi bin Maymun al-Azdi مهدي بن ميمون الأزدي المعولي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20299",
      "name": "Wahayb bin Khalid bin 'Ajlan al-Bahli وهيب بن خالد بن عجلان الباهلي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "30005",
      "name": "Imam Tirmidhi الترمذي محمد بن عيسى بن سورة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30004",
      "name": "Ibn Maja ابن ماجة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30013",
      "name": "Ibn Abi Dunya ابن أبي الدنيا",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "35094",
      "name": "'Ali bin 'Abdul Hameed علي بن عبد الحميد بن مصعب",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sunan-abi-daud-1443",
      "hadith_no": "1443",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الله بن معاوية الجمحي، حدثنا ثابت بن يزيد، عن هلال بن خباب، عن عكرمة، عن ابن عباس، قال قنت رسول الله صلى الله عليه وسلم شهرا متتابعا في الظهر والعصر والمغرب والعشاء وصلاة الصبح في دبر كل صلاة إذا قال ‏\"‏ سمع الله لمن حمده ‏\"‏ ‏.‏ من الركعة الآخرة يدعو على أحياء من بني سليم على رعل وذكوان وعصية ويؤمن من خلفه ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Messenger of Allah (ﷺ) recited the supplication (Qunut) daily for a month at the noon, afternoon, sunset, night and morning prayers. When he said: \"Allah listens to him who praises Him\" in the last rak'ah, invoking a curse on some clans of Banu Sulaym, Ri'l, Dhakwan and Usayyah, and those who were standing behind him said: Amen.",
      "usc_msa_ref": "",
      "chain": [
        "34120",
        "20215",
        "11312",
        "11023",
        "17"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1866",
      "hadith_no": "1866",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Drinks - كتاب الأشربة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "26",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الأعلى بن عبد الأعلى، عن هشام بن حسان، عن مهدي بن ميمون، ح وحدثنا عبد الله بن معاوية الجمحي، حدثنا مهدي بن ميمون المعنى، واحد، عن أبي عثمان الأنصاري، عن القاسم بن محمد، عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ كل مسكر حرام ما أسكر الفرق منه فملء الكف منه حرام ‏\"‏ ‏.‏ قال أبو عيسى قال أحدهما في حديثه ‏\"‏ الحسوة منه حرام ‏\"‏ ‏.‏ قال هذا حديث حسن ‏.‏ وقد رواه ليث بن أبي سليم والربيع بن صبيح عن أبي عثمان الأنصاري نحو رواية مهدي بن ميمون ‏.‏ وأبو عثمان الأنصاري اسمه عمرو بن سالم ويقال عمر بن سالم أيضا ‏.‏",
      "text_en": " Narrated 'Aishah:                     That the Messenger of Allah (ﷺ) said: \"Every intoxicant is unlawful. Whatever a Faraq of it intoxicates, then a handful of it is unlawful.\"[Abu 'Eisa said:] One of them said in his Hadith: \"A sip of it is unlawful.\"He said: This Hadith is Hasan. Al-Laith bin Abi Sulaim and Ar-Rabi' bin Sabih reported similar to the narration of Mahdi bin Maimun from Abu 'Uthman Al-Ansari. Abu 'Uthman Al-Ansari's (a narrator in this chain) name is 'Amr bin Salim, and they say: \"Umar bin Salim\" (as well).",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20246",
        "11311",
        "11307",
        "34120",
        "11307",
        "10873",
        "10535",
        "53"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2178-2",
      "hadith_no": "2178",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا عبد الله بن معاوية الجمحي، حدثنا حماد بن سلمة، عن ليث، عن طاوس، عن زياد بن سيمين، كوش عن عبد الله بن عمرو، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ تكون فتنة تستنظف العرب قتلاها في النار اللسان فيها أشد من السيف ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏ سمعت محمد بن إسماعيل يقول لا يعرف لزياد بن سيمين كوش غير هذا الحديث رواه حماد بن سلمة عن ليث فرفعه ورواه حماد بن زيد عن ليث فوقفه ‏.‏",
      "text_en": " 'Abdullah bin 'Amr narrated that the Messenger of Allah (s.a.w) said:                     \"There shall be a Fitnah of extermination of the 'Arabs. Its fighters are in the Fire. During it, the tongue is stronger then the sword.\"",
      "usc_msa_ref": "",
      "chain": [
        "34120",
        "20021",
        "20023",
        "11053",
        "29"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2234-2",
      "hadith_no": "2234",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا عبد الله بن معاوية الجمحي، حدثنا حماد بن سلمة، عن خالد الحذاء، عن عبد الله بن شقيق، عن عبد الله بن سراقة، عن أبي عبيدة بن الجراح، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إنه لم يكن نبي بعد نوح إلا قد أنذر الدجال قومه وإني أنذركموه ‏\"‏ ‏.‏ فوصفه لنا رسول الله صلى الله عليه وسلم فقال ‏\"‏ لعله سيدركه بعض من رآني أو سمع كلامي ‏\"‏ ‏.‏ قالوا يا رسول الله فكيف قلوبنا يومئذ قال ‏\"‏ مثلها يعني اليوم أو خير ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن عبد الله بن بسر وعبد الله بن الحارث بن جزى وعبد الله بن مغفل وأبي هريرة ‏.‏ وهذا حديث حسن غريب من حديث أبي عبيدة بن الجراح لا نعرفه إلا من حديث خالد الحذاء وقد رواه شعبة أيضا عن خالد الحذاء ‏.‏ وأبو عبيدة بن الجراح اسمه عامر بن عبد الله بن الجراح ‏.‏",
      "text_en": " Abu 'Ubaidah bin Al-Jarrah said:                     \"I heard the Messenger of Allah(s.a.w): 'There was never a Prophet after Nuh but that he warned his people about the Dajjal, and indeed I shall warn you of him.' Then the Messenger of Allah(s.a.w) described him for us, and he said: \"Perhaps some of you who see me, or hear my words shall live to see him.\" They said: \"O Messenger of Allah! How will our hearts be on that day?\" He said: \"The same",
      "usc_msa_ref": "",
      "chain": [
        "34120",
        "20021",
        "11282",
        "10694",
        "14212",
        "10"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2248-2",
      "hadith_no": "2248",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا عبد الله بن معاوية الجمحي، حدثنا حماد بن سلمة، عن علي بن زيد، عن عبد الرحمن بن أبي بكرة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يمكث أبو الدجال وأمه ثلاثين عاما لا يولد لهما ولد ثم يولد لهما غلام أعور أضر شيء وأقله منفعة تنام عيناه ولا ينام قلبه ‏\"‏ ‏.‏ ثم نعت لنا رسول الله صلى الله عليه وسلم أبويه فقال ‏\"‏ أبوه طوال ضرب اللحم كأن أنفه منقار وأمه امرأة فرضاخية طويلة اليدين ‏\"‏ ‏.‏ فقال أبو بكرة فسمعنا بمولود في اليهود بالمدينة فذهبت أنا والزبير بن العوام حتى دخلنا على أبويه فإذا نعت رسول الله صلى الله عليه وسلم فيهما فقلنا هل لكما ولد فقالا مكثنا ثلاثين عاما لا يولد لنا ولد ثم ولد لنا غلام أعور أضر شيء وأقله منفعة تنام عيناه ولا ينام قلبه ‏.‏ قال فخرجنا من عندهما فإذا هو منجدل في الشمس في قطيفة له وله همهمة فكشف عن رأسه فقال ما قلتما قلنا وهل سمعت ما قلنا قال نعم تنام عيناى ولا ينام قلبي ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من حديث حماد بن سلمة ‏.‏",
      "text_en": " It was narrated from 'Abdur-Rahman bin Abi Bakrah from his father who said:                     \"The Messenger of Allah(s.a.w) said: 'The father of the Dajjal and hid mother, will abide for thirty years without bearing a son. Then a boy shall be born to them, having one eye in which there is some defect, providing little use. His eyes sleep but his heart does not sleep.' Then the Messenger of Allah(s.a.w) described his parents for us: 'His father is tall, with little fat, with a nose  as if it were a beak. His mother is a bulky woman with long breasts.'\" So Abu Bakrah said: \"I heard about a child being born to some Jews in Al-Madinah. So Az-Zubair bin Al-'Awwam and I went until we entered upon his parents. They appeared as the Messenger of Allah(s.a.w) had described them. We said: 'Do you have any children?' They said: 'We remained for thirty years without any children being born to us, then we bore a boy, having one eye in which there is some defect, providing little use. His eyes sleep but his heart does not sleep.'\" He said: \"So we were leaving them, when he appeared, glittering in the sunlight in a velvet garment, murmuring something. He uncovered his head and said: 'What were you saying?' We said: 'Did you hear what we were saying?' He said: 'Yes, that my eyes sleep but my heart does not sleep.'\"",
      "usc_msa_ref": "",
      "chain": [
        "34120",
        "20021",
        "10664",
        "11294",
        "3229"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2360",
      "hadith_no": "2360",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا عبد الله بن معاوية الجمحي، حدثنا ثابت بن يزيد، عن هلال بن خباب، عن عكرمة، عن ابن عباس، قال كان رسول الله صلى الله عليه وسلم يبيت الليالي المتتابعة طاويا وأهله لا يجدون عشاء وكان أكثر خبزهم خبز الشعير ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Ibn 'Abbas  said:                     \" The Messenger of Allah (s.a.w) would spend many consecutive nights and his family did not have supper, and most of the time their bread was barley bread.\"",
      "usc_msa_ref": "",
      "chain": [
        "34120",
        "20215",
        "11312",
        "11023",
        "17"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2400",
      "hadith_no": "2400",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا عبد الله بن معاوية الجمحي، حدثنا عبد العزيز بن مسلم، حدثنا أبو ظلال، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله يقول إذا أخذت كريمتى عبدي في الدنيا لم يكن له جزاء عندي إلا الجنة ‏\"‏ ‏.‏ وفي الباب عن أبي هريرة وزيد بن أرقم ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه ‏.‏ وأبو ظلال اسمه هلال ‏.‏",
      "text_en": " Anas bin Malik narrated that the Messenger of Allah(s.a.w) said:                     \"Indeed Allah [Most High] said: 'When I take My slave's sight in the world, then there shall be no reward for him with Me except Paradise.'\"",
      "usc_msa_ref": "",
      "chain": [
        "34120",
        "20253",
        "19"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2775",
      "hadith_no": "2775",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on the Description of Hellfire - كتاب صفة جهنم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "39",
      "text_ar": "حدثنا عبد الله بن معاوية الجمحي، حدثنا عبد العزيز بن مسلم، عن الأعمش، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يخرج عنق من النار يوم القيامة له عينان تبصران وأذنان تسمعان ولسان ينطق يقول إني وكلت بثلاثة بكل جبار عنيد وبكل من دعا مع الله إلها آخر وبالمصورين ‏\"‏ ‏.‏ وفي الباب عن أبي سعيد ‏.‏ قال أبو عيسى هذا حديث حسن غريب صحيح ‏.‏ وقد رواه بعضهم عن الأعمش عن عطية عن أبي سعيد عن النبي صلى الله عليه وسلم نحو هذا وروى أشعث بن سوار عن عطية عن أبي سعيد الخدري عن النبي صلى الله عليه وسلم نحوه ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah (s.a.w) said:                     \"Some of the Fire  (in the shape of a long neck) will come out of the Fire on the Day of judgment. It will have two eyes which can see, two ears which can hear, and a tongue which can speak. It will say: 'I have been left in charge of three: Every obstinate oppressor, everyone who called upon a deity besides Allah, and the image makers.\"",
      "usc_msa_ref": "",
      "chain": [
        "34120",
        "20253",
        "11060",
        "11161",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-739",
      "hadith_no": "739",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book On The Mosques And The Congregations - كتاب المساجد والجماعات",
      "chapter_no": "4",
      "text_ar": "حدثنا عبد الله بن معاوية الجمحي، حدثنا حماد بن سلمة، عن أيوب، عن أبي قلابة، عن أنس بن مالك، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا تقوم الساعة حتى يتباهى الناس في المساجد ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                     \"The Messenger of Allah said: 'The Hour will not begin until the people compete in (building) mosques.'\"",
      "usc_msa_ref": "",
      "chain": [
        "34120",
        "20021",
        "11015",
        "11047",
        "19"
      ]
    },
    {
      "id": "sunan-ibn-majah-2533",
      "hadith_no": "2533",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Pawning - كتاب الرهون",
      "chapter_no": "16",
      "text_ar": "حدثنا عبد الله بن معاوية الجمحي، حدثنا ثابت بن يزيد، حدثنا هلال بن خباب، عن عكرمة، عن ابن عباس، أن رسول الله صلى الله عليه وسلم مات ودرعه رهن عند يهودي بثلاثين صاعا من شعير ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that:                     the Messenger of Allah (ﷺ) died while his armor was pawned to a Jew for thirty Sa’s of barley.' ”",
      "usc_msa_ref": "",
      "chain": [
        "34120",
        "20215",
        "11312",
        "11023",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-2622",
      "hadith_no": "2622",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Manumission (of Slaves) - كتاب العتق",
      "chapter_no": "19",
      "text_ar": "حدثنا عبد الله بن معاوية الجمحي، حدثنا حماد بن سلمة، عن سعيد بن جمهان، عن سفينة أبي عبد الرحمن، قال أعتقتني أم سلمة واشترطت على أن أخدم النبي صلى الله عليه وسلم ما عاش ‏.‏",
      "text_en": " It was narrated from that Safinah - Abu 'Abdur-Rahman-said :                     “Umm Salamah freed me but stipulated that I should serve the Prophet (ﷺ) as long he lived.”",
      "usc_msa_ref": "",
      "chain": [
        "34120",
        "20021",
        "19846"
      ]
    },
    {
      "id": "sunan-ibn-majah-3472",
      "hadith_no": "3472",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا عبد الله بن معاوية الجمحي، حدثنا ثابت بن يزيد، عن هلال بن خباب، عن عكرمة، عن ابن عباس، قال كان رسول الله  صلى الله عليه وسلم  يبيت الليالي المتتابعة طاويا وأهله لا يجدون العشاء وكان عامة خبزهم خبز الشعير ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “The Messenger of Allah (ﷺ)usedto spend many nights in a row hungry and his family could find nosupper, and usually their bread was barley bread.”",
      "usc_msa_ref": "",
      "chain": [
        "34120",
        "20215",
        "11312",
        "11023",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-4102",
      "hadith_no": "4102",
      "source": "Sunan Ibn Majah",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا عبد الله بن معاوية الجمحي، حدثنا حماد بن سلمة، عن ليث، عن طاوس، عن زياد، سيمين كوش عن عبد الله بن عمرو، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ تكون فتنة تستنظف العرب قتلاها في النار اللسان فيها أشد من وقع السيف ‏\"‏ ‏.‏",
      "text_en": " It was narrated from ‘Abdullah bin ‘Amr that the Messenger ofAllah(ﷺ) said:                      “There will be a tribulation which will utterlydestroythe Arabs, and those who are slain will be in Hell. At thattime thetongue will be worse than a blow of the sword.”",
      "usc_msa_ref": "",
      "chain": [
        "34120",
        "20021",
        "20023",
        "11053",
        "29"
      ]
    }
  ],
  "total_hadiths": 13
}