{
  "id": "34170",
  "name": "'Imran bin Musa عمران بن موسى",
  "full_name": "'Imran bin Musa عمران بن موسى",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "240",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ ت  س  ق  -  صدوق ]"
    ],
    "tags": [
      "al-Laithi",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20022",
      "name": "Hammad bin Zayd حماد بن زيد بن درهم الأزدي الأزرق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20258",
      "name": "'Abdul Warith bin Sa'id bin Dhakwan عبد الوارث بن سعيد بن ذكوان",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20304",
      "name": "Yazid bin Zari' يزيد بن زريع",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20256",
      "name": "'Abdul Wahid bin Ziyad عبد الواحد بن زياد العبدي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20565",
      "name": "Muhammad bin Swa'a محمد بن سواء",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [],
  "hadiths": [
    {
      "id": "jami-al-tirmidhi-764",
      "hadith_no": "764",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا عمران بن موسى القزاز، حدثنا عبد الوارث بن سعيد، حدثنا علي بن زيد، عن سعيد بن المسيب، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن ربكم يقول كل حسنة بعشر أمثالها إلى سبعمائة ضعف والصوم لي وأنا أجزي به الصوم جنة من النار ولخلوف فم الصائم أطيب عند الله من ريح المسك وإن جهل على أحدكم جاهل وهو صائم فليقل إني صائم ‏\"‏ ‏.‏ وفي الباب عن معاذ بن جبل وسهل بن سعد وكعب بن عجرة وسلامة بن قيصر وبشير ابن الخصاصية ‏.‏ واسم بشير زحم بن معبد والخصاصية هي أمه ‏.‏ قال أبو عيسى وحديث أبي هريرة حديث حسن غريب من هذا الوجه ‏.‏",
      "text_en": " Abu Hurairah narrated that:                     The Messenger of Allah said: \"Indeed your Lord said: 'Every good deed is rewarded with ten of the same up to seven hundred times over. Fasting is for Me, and I shall reward for it.' Fasting is a shield from the Fire. The smell coming from the mouth of the one fasting is more pleasant to Allah than the scent of musk. If one of you is abused by an ignorant person while fasting, then let him say: 'Indeed I am fasting.'\"",
      "usc_msa_ref": "",
      "chain": [
        "34170",
        "20258",
        "10664",
        "11002",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4210",
      "hadith_no": "4210",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا عمران بن موسى القزاز، حدثنا حماد بن زيد، حدثنا المهاجر، عن أبي العالية الرياحي، عن أبي هريرة، قال أتيت النبي صلى الله عليه وسلم بتمرات فقلت يا رسول الله ادع الله فيهن بالبركة ‏.‏ فضمهن ثم دعا لي فيهن بالبركة فقال لي ‏\"‏ خذهن واجعلهن في مزودك هذا أو في هذا المزود كلما أردت أن تأخذ منه شيئا فأدخل فيه يدك فخذه ولا تنثره نثرا ‏\"‏ ‏.‏ فقد حملت من ذلك التمر كذا وكذا من وسق في سبيل الله فكنا نأكل منه ونطعم وكان لا يفارق حقوي حتى كان يوم قتل عثمان فإنه انقطع ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه وقد روي هذا الحديث من غير هذا الوجه عن أبي هريرة ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     \"I came to the Prophet (ﷺ) with some dates and said: 'O Messenger of Allah, supplicate to Allah to bless them.' So he took them and supplicated for me for blessing in them, and then said to me: 'Take them and put them in this bag of yours - or this bag - and whenever you intend to take from it, then put your hand in it and take it, and do not scatter them all about.' So I carried such and such Wasq of those dates in the cause of Allah. We used to eat from it, and give others to eat, and it (the bag) would not part from my waist until the day 'Uthman was killed, for they had run out.\"",
      "usc_msa_ref": "",
      "chain": [
        "34170",
        "20022",
        "11424",
        "13"
      ]
    }
  ],
  "total_hadiths": 2
}