{
  "id": "34188",
  "name": "Muhammad bin Isma'il bin Ibrahim محمد بن إسماعيل بن إبراهيم بن مقسم",
  "full_name": "Muhammad bin Isma'il bin Ibrahim محمد بن إسماعيل بن إبراهيم بن مقسم",
  "grade": "3rd Century AH [11th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "264",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra",
      "Damascus"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ س  -  ثقة ]"
    ],
    "tags": [
      "B.Asad",
      "al-Basri",
      "Damascus"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20033",
      "name": "'Abdur Rahman bin Mahdi عبد الرحمن بن مهدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20443",
      "name": "Abu 'Amir al-'Aqdi عبد الملك بن عمرو القيسي أبو عامر العقدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "28392",
      "name": "'Uthman bin 'Amr bin Saj عثمان بن عمرو بن ساج",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20411",
      "name": "Ishaq bin Yusuf bin Mrdas إسحاق بن يوسف بن مرداس",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20416",
      "name": "Ja'far bin Awn bin Ja'far جعفر بن عون بن جعفر",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20381",
      "name": "Hajjaj bin Muhammad al-Musaysi حجاج بن محمد المصيصي الأعور",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20232",
      "name": "Sa'id bin 'Amir al-Dab'ai سعيد بن عامر الضبعي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30283",
      "name": "Ishaq bin Ibrahim bin Yazid إسحاق بن إبراهيم بن يزيد",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20298",
      "name": "Wahb bin Jarir bin Hazim bin Zayd وهب بن جرير بن حازم بن زيد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20393",
      "name": "Yonus bin Muhammad bin Muslim يونس بن محمد بن مسلم المؤدب",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20352",
      "name": "Muhammad bin Bashr bin al-Farafsa محمد بن بشر بن الفرافصة العبدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20372",
      "name": "Ya'la bin 'Ubaid bin Umayya al-Tanafasi يعلى بن عبيد بن أبي أمية الطنافسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20472",
      "name": "Yazid bin Harun يزيد بن هارون",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20244",
      "name": "'Abdullah bin Bakr عبد الله بن بكر بن حبيب السهمي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20632",
      "name": "'Ali bin Hafs al-Mada'ini علي بن حفص المدائني",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20202",
      "name": "Makki bin Ibrahim bin Bashayr مكي بن إبراهيم بن بشير",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20348",
      "name": "al-Fadl bin Dakayn, Abu Na'eem الفضل بن دكين أبو نعيم الملائي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20280",
      "name": "Muhammad bin 'Abdullah al-Ansari محمد بن عبد الله بن المثني - الأنصاري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30006",
      "name": "Imam Nasa'i أحمد بن شعيب بن علي بن سنان النسائي",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "37518",
      "name": "'Abdur Rahman bin 'Amr عبد الرحمن بن عمرو",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "7649",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثني محمد بن أبي غالب، حدثنا محمد بن إسماعيل، حدثنا معتمر، سمعت أبي يقول، حدثنا قتادة، أن أبا رافع، حدثه أنه، سمع أبا هريرة  رضى الله عنه  يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن الله كتب كتابا قبل أن يخلق الخلق إن رحمتي سبقت غضبي‏.‏ فهو مكتوب عنده فوق العرش ‏\"‏‏.‏",
      "text_en": "",
      "chain": [
        "30274",
        "34188",
        "20288",
        "11289",
        "11019",
        "13"
      ]
    },
    {
      "hadith_no": "255",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن عوف، قال قرأت في أصل إسماعيل بن عياش - قال ابن عوف - وحدثنا محمد بن إسماعيل، عن أبيه، حدثني ضمضم بن زرعة، عن شريح بن عبيد، قال أفتاني جبير بن نفير عن الغسل، من الجنابة أن ثوبان، حدثهم أنهم، استفتوا النبي صلى الله عليه وسلم عن ذلك فقال ‏\"‏ أما الرجل فلينشر رأسه فليغسله حتى يبلغ أصول الشعر وأما المرأة فلا عليها أن لا تنقضه لتغرف على رأسها ثلاث غرفات بكفيها ‏\"‏ ‏.‏",
      "text_en": " Narrated Thawban:                     Shurayh ibn Ubayd said: Jubayr ibn Nufayr gave me a verdict about the bath because of sexual defilement that Thawban reported to them that they asked the Prophet (ﷺ) about it. He (the Prophet) replied: As regards man, he should undo the hair of his head and wash it until the water should reach the roots of the hair. But there is no harm if the woman does not undo it (her hair) and pour three handfuls of water over her head.",
      "chain": [
        "38566",
        "34188",
        "18459",
        "18414"
      ]
    },
    {
      "hadith_no": "704",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن إسماعيل البصري، حدثنا معاذ، حدثنا هشام، عن يحيى، عن عكرمة، عن ابن عباس، قال أحسبه عن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا صلى أحدكم إلى غير سترة فإنه يقطع صلاته الكلب والحمار والخنزير واليهودي والمجوسي والمرأة ويجزئ عنه إذا مروا بين يديه على قذفة بحجر ‏\"‏ ‏.‏ قال أبو داود في نفسي من هذا الحديث شىء كنت أذاكر به إبراهيم وغيره فلم أر أحدا جاء به عن هشام ولا يعرفه ولم أر أحدا يحدث به عن هشام وأحسب الوهم من ابن أبي سمينة - يعني محمد بن إسماعيل البصري مولى بني هاشم - والمنكر فيه ذكر المجوسي وفيه ‏\"‏ على قذفة بحجر ‏\"‏ ‏.‏ وذكر الخنزير وفيه نكارة ‏.‏ قال أبو داود ولم أسمع هذا الحديث إلا من محمد بن إسماعيل وأحسبه وهم لأنه كان يحدثنا من حفظه ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     Ikrimah reported on the authority of Ibn Abbas, saying: I think the Messenger of Allah (ﷺ) said: When one of you prays without a sutrah, a dog, an ass, a pig, a Jew, a Magian, and a woman cut off his prayer, but it will suffice if they pass in front of him at a distance of over a stone's throw.Abu Dawud said: There is something about this tradition in my heart. I used to discuss it with Ibrahim and others. I did not find anyone who narrated it from Hisham and knew it. I did not know anyone who reported it from Hisham and knew it. I did not know anyone who related it from Hisham. I think the confusion is on the part of Ibn Abi Saminah that is, Muhammad b. Isma'il al-Basri, the freed slave of Banu Hisham. In this tradition the mention of words \"a Magian\" is rejected; the mention of the words \"at a stone's throw\" and \"a pig\" is rejected.Abu Dawud said: I did not hear this tradition except from Muhammad b. Isma'il b. Samurrah and I think he was mistaken because he used to narrate to us from his memory.",
      "chain": [
        "34188",
        "32",
        "11065",
        "20031",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "4071",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا ابن عوف الطائي، حدثنا محمد بن إسماعيل، حدثني أبي، - قال ابن عوف الطائي وقرأت في أصل إسماعيل - قال حدثني ضمضم - يعني ابن زرعة - عن شريح بن عبيد عن حبيب بن عبيد عن حريث بن الأبح السليحي أن امرأة من بني أسد قالت كنت يوما عند زينب امرأة رسول الله صلى الله عليه وسلم ونحن نصبغ ثيابا لها بمغرة فبينا نحن كذلك إذ طلع علينا رسول الله صلى الله عليه وسلم فلما رأى المغرة رجع فلما رأت ذلك زينب علمت أن رسول الله صلى الله عليه وسلم قد كره ما فعلت فأخذت فغسلت ثيابها ووارت كل حمرة ثم إن رسول الله صلى الله عليه وسلم رجع فاطلع فلما لم ير شيئا دخل ‏.‏",
      "text_en": " Narrated Hurayth ibn al-Abajj as-Sulayhi:                     That a woman of Banu Asad: One day I was with Zaynab, the wife of the Messenger of Allah (ﷺ), and we were dyeing her clothes with red ochre. In the meantime the Messenger of Allah (ﷺ) peeped us. When he saw the red ochre, he returned. When Zaynab saw this, she realised that the Messenger of Allah (ﷺ) disapproved of what she had done. She then took and washed her clothes and concealed all redness. The Messenger of Allah (ﷺ) then returned and peeped, and when he did not see anything, he entered.",
      "chain": [
        "34188",
        "18459",
        "18414",
        "10899"
      ]
    },
    {
      "hadith_no": "4079",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد بن إسماعيل، مولى بني هاشم حدثنا عثمان بن عثمان الغطفاني، حدثنا سليمان بن خربوذ، حدثني شيخ، من أهل المدينة قال سمعت عبد الرحمن بن عوف، يقول عممني رسول الله صلى الله عليه وسلم فسدلها بين يدى ومن خلفي ‏.‏",
      "text_en": " Narrated AbdurRahman ibn Awf:                     The Messenger of Allah (ﷺ) put a turban on me and let the ends hang in front of him and behind me.",
      "chain": [
        "34188",
        "20559",
        "18382",
        "8"
      ]
    },
    {
      "hadith_no": "4128",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد بن إسماعيل، مولى بني هاشم حدثنا الثقفي، عن خالد، عن الحكم بن عتيبة، أنه انطلق هو وناس معه إلى عبد الله بن عكيم - رجل من جهينة - قال الحكم فدخلوا وقعدت على الباب فخرجوا إلى فأخبروني أن عبد الله بن عكيم أخبرهم أن رسول الله صلى الله عليه وسلم كتب إلى جهينة قبل موته بشهر أن لا ينتفعوا من الميتة بإهاب ولا عصب ‏.‏ قال أبو داود فإذا دبغ لا يقال له إهاب إنما يسمى شنا وقربة قال النضر بن شميل يسمى إهابا ما لم يدبغ ‏.‏",
      "text_en": " Al-Hakam ibn Uyaynah said that he went along with some people to Abdullah ibn Ukaym, a man of Juhaynah. al-Hakam said:                      They entered and I sat at the door. Then they came out and told me that Abdullah ibn Ukaym had informed them that the Messenger of Allah (ﷺ) had written to Juhaynah one month before his death: Do not make use of the skin or sinew of an animal which died a natural death.Abu Dawud said: Al-Nadr b. Shumail said: The skin is called ihab when it is not tanned and when it is tanned, it not called ihab but na,es shann and qirbah (tanned skin or leather).",
      "chain": [
        "34188",
        "20423",
        "11069",
        "10786"
      ]
    },
    {
      "hadith_no": "4253",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim) - كتاب الفتن والملاحم",
      "chapter_no": "37",
      "text_ar": "حدثنا محمد بن عوف الطائي، حدثنا محمد بن إسماعيل، حدثني أبي، - قال ابن عوف وقرأت في أصل إسماعيل - قال حدثني ضمضم، عن شريح، عن أبي مالك، - يعني الأشعري - قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله أجاركم من ثلاث خلال أن لا يدعو عليكم نبيكم فتهلكوا جميعا وأن لا يظهر أهل الباطل على أهل الحق وأن لا تجتمعوا على ضلالة ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuMalik al-Ash'ari:                     The Prophet (ﷺ) said: Allah  has protected you from three things: that your Prophet should not invoke a curse on you and should all perish, that those who follow what is false should not prevail over those who follow the truth, and that you should not all agree in an error.",
      "chain": [
        "38566",
        "34188",
        "5372"
      ]
    },
    {
      "hadith_no": "5008",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا سليمان بن عبد الحميد البهراني، أنه قرأ في أصل إسماعيل بن عياش وحدثه محمد بن إسماعيل ابنه قال حدثني أبي قال حدثني ضمضم عن شريح بن عبيد قال حدثنا أبو ظبية أن عمرو بن العاص قال يوما وقام رجل فأكثر القول فقال عمرو لو قصد في قوله لكان خيرا له سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لقد رأيت أو أمرت أن أتجوز في القول فإن الجواز هو خير ‏\"‏ ‏.‏",
      "text_en": " One day when a man got up and spoke at length Amr ibn al-'As said If he had been moderate in what he said:                      It would have been better for him. I heard the Messenger of Allah (ﷺ) say: I think (or, I have been commanded) that I should be brief in what I say, for brevity is better.",
      "chain": [
        "34188",
        "18414",
        "28"
      ]
    },
    {
      "hadith_no": "5083",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن عوف، حدثنا محمد بن إسماعيل، قال حدثني أبي، - قال ابن عوف ورأيته في أصل إسماعيل - قال حدثني ضمضم، عن شريح، عن أبي مالك، قال قالوا يا رسول الله حدثنا بكلمة، نقولها إذا أصبحنا وأمسينا واضطجعنا فأمرهم أن يقولوا ‏:‏ اللهم فاطر السموات والأرض عالم الغيب والشهادة أنت رب كل شىء والملائكة يشهدون أنك لا إله إلا أنت فإنا نعوذ بك من شر أنفسنا ومن شر الشيطان الرجيم وشركه وأن نقترف سوءا على أنفسنا أو نجره إلى مسلم ‏.‏",
      "text_en": " Narrated AbuMalik:                     The people asked: Tell us a word which we repeat in the morning, evening and when we rise.  So he commanded us to say: \"O Allah! Creator of Heavens and Earth; Knower of all that is hidden and open; Thou art the Lord of everything; the angels testify that there is no god but Thee, for we seek refuge in Thee from the evil within ourselves, from the evil of the Devil accused and from the evil of his suggestion about partnership with Allah, and that we earn sin for ourselves or drag it to a Muslim.\"",
      "chain": [
        "38566",
        "34188",
        "10766"
      ]
    },
    {
      "hadith_no": "5096",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا ابن عوف، حدثنا محمد بن إسماعيل، قال حدثني أبي، - قال ابن عوف ورأيت في أصل إسماعيل - قال حدثني ضمضم، عن شريح، عن أبي مالك الأشعري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا ولج الرجل في بيته فليقل اللهم إني أسألك خير المولج وخير المخرج بسم الله ولجنا وبسم الله خرجنا وعلى الله ربنا توكلنا ثم ليسلم على أهله ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuMalik Al-Ash'ari:                     The Prophet (ﷺ) said: When a man goes into his house, he should say: \"O Allah! I ask Thee for good both when entering and when going out; in the name of Allah we have entered, and in the name of Allah we have gone out, and in Allah our Lord do we trust.\" He should then greet his family.",
      "chain": [
        "34188",
        "5372"
      ]
    },
    {
      "hadith_no": "7",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن إسماعيل، حدثنا مالك بن إسماعيل، عن إسرائيل بن يونس، عن يوسف بن أبي بردة، عن أبيه، عن عائشة، رضى الله عنها قالت كان النبي صلى الله عليه وسلم إذا خرج من الخلاء قال ‏\"‏ غفرانك ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من حديث إسرائيل عن يوسف بن أبي بردة ‏.‏ وأبو بردة بن أبي موسى اسمه عامر بن عبد الله بن قيس الأشعري ‏.‏ ولا نعرف في هذا الباب إلا حديث عائشة رضى الله عنها عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " 'Aishah, [may Allah be pleased with her] said:                     \"When the Prophet would exit the toilet he would say: 'Ghufranak.'\"",
      "chain": [
        "34188",
        "20357",
        "20311",
        "19951",
        "11901",
        "53"
      ]
    },
    {
      "hadith_no": "360",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن إسماعيل، حدثنا علي بن الحسن، حدثنا الحسين بن واقد، حدثنا أبو غالب، قال سمعت أبا أمامة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ ثلاثة لا تجاوز صلاتهم آذانهم العبد الآبق حتى يرجع وامرأة باتت وزوجها عليها ساخط وإمام قوم وهم له كارهون ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه ‏.‏ وأبو غالب اسمه حزور ‏.‏",
      "text_en": " Abu Umamah narrated that :                     Allah's Messenger said: \"There are three whose Salat would not rise up beyond their ears: The runaway slave until he returns, a woman who spends a night while her husband is angry with her, and a people's Imam whom they dislike.\"",
      "chain": [
        "34188",
        "20648",
        "4048"
      ]
    },
    {
      "hadith_no": "619",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Zakat - كتاب الزكاة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "7",
      "text_ar": "حدثنا محمد بن إسماعيل، حدثنا علي بن عبد الحميد الكوفي، حدثنا سليمان بن المغيرة، عن ثابت، عن أنس، قال كنا نتمنى أن يأتي، الأعرابي العاقل فيسأل النبي صلى الله عليه وسلم ونحن عنده فبينا نحن على ذلك إذ أتاه أعرابي فجثا بين يدى النبي صلى الله عليه وسلم فقال يا محمد إن رسولك أتانا فزعم لنا أنك تزعم أن الله أرسلك ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ نعم ‏\"‏ ‏.‏ قال فبالذي رفع السماء وبسط الأرض ونصب الجبال آلله أرسلك فقال النبي صلى الله عليه وسلم ‏\"‏ نعم ‏\"‏ ‏.‏ قال فإن رسولك زعم لنا أنك تزعم أن علينا خمس صلوات في اليوم والليلة ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ نعم ‏\"‏ ‏.‏ قال فبالذي أرسلك آلله أمرك بهذا قال النبي صلى الله عليه وسلم ‏\"‏ نعم ‏\"‏ ‏.‏ قال فإن رسولك زعم لنا أنك تزعم أن علينا صوم شهر في السنة ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ صدق ‏\"‏ ‏.‏ قال فبالذي أرسلك آلله أمرك بهذا قال النبي صلى الله عليه وسلم ‏\"‏ نعم ‏\"‏ ‏.‏ قال فإن رسولك زعم لنا أنك تزعم أن علينا في أموالنا الزكاة ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ صدق ‏\"‏ ‏.‏ قال فبالذي أرسلك آلله أمرك بهذا فقال النبي صلى الله عليه وسلم ‏\"‏ نعم ‏\"‏ ‏.‏ قال فإن رسولك زعم لنا أنك تزعم أن علينا الحج إلى البيت من استطاع إليه سبيلا ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ نعم ‏\"‏ ‏.‏ قال فبالذي أرسلك آلله أمرك بهذا فقال النبي صلى الله عليه وسلم ‏\"‏ نعم ‏\"‏ ‏.‏ فقال والذي بعثك بالحق لا أدع منهن شيئا ولا أجاوزهن ‏.‏ ثم وثب فقال النبي صلى الله عليه وسلم ‏\"‏ إن صدق الأعرابي دخل الجنة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه وقد روي من غير هذا الوجه عن أنس عن النبي صلى الله عليه وسلم ‏.‏ سمعت محمد بن إسماعيل يقول قال بعض أهل العلم فقه هذا الحديث أن القراءة على العالم والعرض عليه جائز مثل السماع ‏.‏ واحتج بأن الأعرابي عرض على النبي صلى الله عليه وسلم فأقر به النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Anas narrated:                     \"We used to hope that an intelligent Bedouin would show up to question the Prophet while we were with him. So one while we were with him, a Bedouin came, kneeling in front of the Prophet, and he said: 'O Muhammad, your messenger came to us and told us that you say that Allah sent you.' So the Prophet say: 'Yes.' He said, 'So, (swear) by the One who raised the heaves, and spread out the earth, and erected the mountains; has Allah sent you?' The Prophet said, 'Yes.' He said: 'Your messenger told us that you say that there are five prayers required from us in a day and a night.' The Prophet said, 'Yes.' He said, 'By the One Who sent you, has Allah ordered that you you?' He said, 'Yes.' He said, 'Your messenger told us that you say that we are required to fast for a month out of the year.' He said, 'He told the truth.' He said, 'By the One Who sent you, has Allah ordered that you?' The Prophet said, 'Yes.' He said, 'Your messenger told us that Zakat is required from our wealth.' The Prophet said, 'He told the truth.' He said, 'By the One Who sent you, has Allah ordered you that?' The Prophet said, 'Yes.' He said, 'Your messenger told us that you say that we are required to perform Hajj to Allah's House if able to undertake the journey.' The Prophet said, 'Yes.' He said, 'By the One Who sent you, has Allah Commanded you that?' (The Prophet said:) 'Yes.' So he said: 'By the One Who sent you with the Truth, I will not leave any of them, nor surpass them.' Then he got up quickly (leaving). The Prophet said: 'If the Bedouin told the truth, then he will enter Paradise.'\"",
      "chain": [
        "34188",
        "20236",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "641",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Zakat - كتاب الزكاة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "7",
      "text_ar": "حدثنا محمد بن إسماعيل، حدثنا إبراهيم بن موسى، حدثنا الوليد بن مسلم، عن المثنى بن الصباح، عن عمرو بن شعيب، عن أبيه، عن جده، أن النبي صلى الله عليه وسلم خطب الناس فقال ‏\"‏ ألا من ولي يتيما له مال فليتجر فيه ولا يتركه حتى تأكله الصدقة ‏\"‏ ‏.‏ قال أبو عيسى وإنما روي هذا الحديث من هذا الوجه وفي إسناده مقال لأن المثنى بن الصباح يضعف في الحديث ‏.‏ وروى بعضهم هذا الحديث عن عمرو بن شعيب أن عمر بن الخطاب ‏.‏ فذكر هذا الحديث ‏.‏ وقد اختلف أهل العلم في هذا الباب فرأى غير واحد من أصحاب النبي صلى الله عليه وسلم في مال اليتيم زكاة ‏.‏ منهم عمر وعلي وعائشة وابن عمر وبه يقول مالك والشافعي وأحمد وإسحاق ‏.‏ وقالت طائفة من أهل العلم ليس في مال اليتيم زكاة ‏.‏ وبه يقول سفيان الثوري وعبد الله بن المبارك ‏.‏ وعمرو بن شعيب هو ابن محمد بن عبد الله بن عمرو بن العاص وشعيب قد سمع من جده عبد الله بن عمرو ‏.‏ وقد تكلم يحيى بن سعيد في حديث عمرو بن شعيب وقال هو عندنا واه ‏.‏ ومن ضعفه فإنما ضعفه من قبل أنه يحدث من صحيفة جده عبد الله بن عمرو وأما أكثر أهل الحديث فيحتجون بحديث عمرو بن شعيب ويثبتونه منهم أحمد وإسحاق وغيرهما ‏.‏",
      "text_en": " Amr bin Shu'aib narrated from his father, from his grandfather that :                     the Prophet addressed the people and said: \"As for one who is the guardian of an orphan who has wealth, then let him do business with it and not leave it until it becomes consumed by charity.\"",
      "chain": [
        "34188",
        "30309",
        "20733",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "645",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Zakat - كتاب الزكاة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "7",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا يزيد بن هارون، أخبرنا يزيد بن عياض، عن عاصم بن عمر بن قتادة، ح وحدثنا محمد بن إسماعيل، قال حدثنا أحمد بن خالد، عن محمد بن إسحاق، عن عاصم بن عمر بن قتادة، عن محمود بن لبيد، عن رافع بن خديج، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ العامل على الصدقة بالحق كالغازي في سبيل الله حتى يرجع إلى بيته ‏\"‏ ‏.‏ قال أبو عيسى حديث رافع بن خديج حديث حسن صحيح ‏.‏ ويزيد بن عياض ضعيف عند أهل الحديث ‏.‏ وحديث محمد بن إسحاق أصح ‏.‏",
      "text_en": " Rafi bin Khadij narrated:                     \"I herd the Messenger of Allah saying: 'The one who works in collecting charity in truth is like the one who fights in the cause of Allah until he returns.'\"",
      "chain": [
        "30242",
        "20472",
        "12592",
        "11103",
        "34188",
        "11107",
        "11103",
        "1830",
        "1986"
      ]
    },
    {
      "hadith_no": "663",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Zakat - كتاب الزكاة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "7",
      "text_ar": "حدثنا محمد بن إسماعيل، حدثنا موسى بن إسماعيل، حدثنا صدقة بن موسى، عن ثابت، عن أنس، قال سئل النبي صلى الله عليه وسلم أى الصوم أفضل بعد رمضان فقال ‏\"‏ شعبان لتعظيم رمضان ‏\"‏ ‏.‏ قيل فأى الصدقة أفضل قال ‏\"‏ صدقة في رمضان ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏ وصدقة بن موسى ليس عندهم بذاك القوي ‏.‏",
      "text_en": " Anas narrated that :                     the Prophet was asked which fast was most virtuous after Ramadan? He said: \"Sha'ban in honor of Ramadan\" He said: \"Which charity is best?\" He (pbuh) said: \"Charity in Ramadan.\"",
      "chain": [
        "34188",
        "20040",
        "24209",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "691",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا محمد بن إسماعيل، حدثنا محمد بن الصباح، حدثنا الوليد بن أبي ثور، عن سماك، عن عكرمة، عن ابن عباس، قال جاء أعرابي إلى النبي صلى الله عليه وسلم فقال إني رأيت الهلال ‏.‏ قال ‏\"‏ أتشهد أن لا إله إلا الله أتشهد أن محمدا رسول الله ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ يا بلال أذن في الناس أن يصوموا غدا ‏\"‏ ‏.‏  حدثنا أبو كريب، حدثنا حسين الجعفي، عن زائدة، عن سماك، نحوه بهذا الإسناد ‏.‏ قال أبو عيسى حديث ابن عباس فيه اختلاف ‏.‏ وروى سفيان الثوري، وغيره، عن سماك، عن عكرمة، عن النبي صلى الله عليه وسلم مرسلا وأكثر أصحاب سماك رووا عن سماك عن عكرمة عن النبي صلى الله عليه وسلم مرسلا ‏.‏ والعمل على هذا الحديث عند أكثر أهل العلم قالوا تقبل شهادة رجل واحد في الصيام ‏.‏ وبه يقول ابن المبارك والشافعي وأحمد وأهل الكوفة ‏.‏ قال إسحاق لا يصام إلا بشهادة رجلين ‏.‏ ولم يختلف أهل العلم في الإفطار أنه لا يقبل فيه إلا شهادة رجلين ‏.‏",
      "text_en": " Ibn Abbas narrated:                     \"A Bedouin came to the Prophet and said: 'I have seen the crescent.' So he said: 'Do you testify that none has the right to be worshipped but Allah? Do you testify that Muhammad is the Messenger of Allah?' He said: 'Yes.' So he said: 'O Bilal! Announce to the people that they should fast tomorrow.'\"",
      "chain": [
        "34188",
        "30269",
        "27362",
        "10770",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "697",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "أخبرني محمد بن إسماعيل، حدثنا إبراهيم بن المنذر، حدثنا إسحاق بن جعفر بن محمد، حدثني عبد الله بن جعفر، عن عثمان بن محمد الأخنسي، عن سعيد المقبري، عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏\"‏ الصوم يوم تصومون والفطر يوم تفطرون والأضحى يوم تضحون ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ وفسر بعض أهل العلم هذا الحديث فقال إنما معنى هذا أن الصوم والفطر مع الجماعة وعظم الناس ‏.‏",
      "text_en": " Abu Hurairah narrated that :                     the Prophet said: \"The fast is the day the people fast, the breaking of the fast is the day the people break their fast, and the sacrifice is the day the people sacrifice.\"",
      "chain": [
        "34188",
        "30308",
        "108",
        "19835",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "800",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا محمد بن إسماعيل، حدثنا سعيد بن أبي مريم، حدثنا محمد بن جعفر، قال حدثني زيد بن أسلم، قال حدثني محمد بن المنكدر، عن محمد بن كعب، قال أتيت أنس بن مالك في رمضان فذكر نحوه ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ ومحمد بن جعفر هو ابن أبي كثير هو مديني ثقة وهو أخو إسماعيل بن جعفر ‏.‏ وعبد الله بن جعفر هو ابن نجيح والد علي بن عبد الله المديني وكان يحيى بن معين يضعفه ‏.‏ وقد ذهب بعض أهل العلم إلى هذا الحديث وقالوا للمسافر أن يفطر في بيته قبل أن يخرج وليس له أن يقصر الصلاة حتى يخرج من جدار المدينة أو القرية ‏.‏ وهو قول إسحاق بن إبراهيم الحنظلي ‏.‏",
      "text_en": " (Another chain) from Muhammad bin Ka'b who said:                     \"I went to Anas bin Malik during Ramadan\" and he mentioned a similar narration (as no. 799).",
      "chain": [
        "34188",
        "30232",
        "20173",
        "11163",
        "11048",
        "11221"
      ]
    },
    {
      "hadith_no": "927",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن إسماعيل الواسطي، قال سمعت ابن نمير، عن أشعث بن سوار، عن أبي الزبير، عن جابر، قال كنا إذا حججنا مع النبي صلى الله عليه وسلم فكنا نلبي عن النساء ونرمي عن الصبيان ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من هذا الوجه ‏.‏ وقد أجمع أهل العلم على أن المرأة لا يلبي عنها غيرها بل هي تلبي عن نفسها ويكره لها رفع الصوت بالتلبية ‏.‏",
      "text_en": " Jabir narrated:                     \"When we performed our Hajj with the Prophet we would say the Talbiyah for the women and we would stone for the boys.\"",
      "chain": [
        "34188",
        "30212",
        "10891",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "1322",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Chapters On Judgements From The Messenger of Allah - كتاب الأحكام عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن إسماعيل، حدثني الحسن بن بشر، حدثنا شريك، عن الأعمش، عن سعد بن عبيدة، عن ابن بريدة، عن أبيه، أن النبي صلى الله عليه وسلم قال ‏\"‏ القضاة ثلاثة قاضيان في النار وقاض في الجنة رجل قضى بغير الحق فعلم ذاك فذاك في النار وقاض لا يعلم فأهلك حقوق الناس فهو في النار وقاض قضى بالحق فذلك في الجنة ‏\"‏ ‏.‏",
      "text_en": " [Ibn Buraidah narrated from his father that the Prophet (ﷺ) said:                      \"The judges are three: Two judges that are in the Fire, and a judge that is in Paradise. A man who judges without the truth, and he knows that. This one is in the Fire. One who judges while not knowing, ruining the rights of the people. So he is in the Fire. A judge who judges with the truth, that is the one in Paradise.\"] (Daif)",
      "chain": [
        "34188",
        "30188",
        "20587",
        "11060",
        "11344",
        "11432",
        "3131"
      ]
    },
    {
      "hadith_no": "2325",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا محمد بن إسماعيل، حدثنا أبو نعيم، حدثنا عبادة بن مسلم، حدثنا يونس بن خباب، عن سعيد الطائي أبي البختري، أنه قال حدثني أبو كبشة الأنماري، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ ثلاثة أقسم عليهن وأحدثكم حديثا فاحفظوه ‏\"‏ ‏.‏ قال ‏\"‏ ما نقص مال عبد من صدقة ولا ظلم عبد مظلمة فصبر عليها إلا زاده الله عزا ولا فتح عبد باب $$مسألة إلا فتح الله عليه باب فقر أو كلمة نحوها وأحدثكم حديثا فاحفظوه قال ‏\"‏ إنما الدنيا لأربعة نفر عبد رزقه الله مالا وعلما فهو يتقي فيه ربه ويصل فيه رحمه ويعلم لله فيه حقا فهذا بأفضل المنازل وعبد رزقه الله علما ولم يرزقه مالا فهو صادق النية يقول لو أن لي مالا لعملت بعمل فلان فهو بنيته فأجرهما سواء وعبد رزقه الله مالا ولم يرزقه علما فهو يخبط في ماله بغير علم لا يتقي فيه ربه ولا يصل فيه رحمه ولا يعلم لله فيه حقا فهذا بأخبث المنازل وعبد لم يرزقه الله مالا ولا علما فهو يقول لو أن لي مالا لعملت فيه بعمل فلان فهو بنيته فوزرهما سواء ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Abu Kabshah Al-Anmari narrated that the Messenger of Allah (s.a.w) said:                     \"There are three things for which I swear and narrate to you about, so remember it.\" He said: \"The slave(of Allah) wealth shall not be decreased by charity, no slave (of Allah) suffers injustice and is patient with it except that Allah adds to his honor; no slave(of Allah) opens up a door to begging except that Allah opens a door for him to poverty\"- or a statement similar- \"And I shall narrate to you a narration, so remember it.\" He said: \"The world is only for four persons: A slave whom Allah provides with wealth and knowledge, so he has Taqwa of his Lord with it, nurtures the ties of kinship with it, and he knows that Allah has a right in it. SO this is the most virtuous rank. And a slave whom Allah provides with knowledge, but He does not provide with wealth. So he has a truthful intent, saying: 'If I had wealth, then I would do the deeds of so-and-so with it.'  He has his intention, so their rewards are the same. And a slave whom Allah provides with wealth, but He does not provide him with knowledge. [So he] spends his wealth rashly without knowledge,nor having Taqwa of his Lord, nor nurturing the ties of kinship, and he does not know that Allah has a right in it. So this is the most despicable rank. And a slave whom Allah does not provide with wealth nor knowledge, so he says: 'If I had wealth, then I would do the deeds of so-and-so with it.' He has his intention, so their sin is the same.\"",
      "chain": [
        "34188",
        "20348",
        "19886"
      ]
    },
    {
      "hadith_no": "2369",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا محمد بن إسماعيل، حدثنا آدم بن أبي إياس، حدثنا شيبان أبو معاوية، حدثنا عبد الملك بن عمير، عن أبي سلمة بن عبد الرحمن، عن أبي هريرة، قال خرج النبي صلى الله عليه وسلم في ساعة لا يخرج فيها ولا يلقاه فيها أحد فأتاه أبو بكر فقال ‏\"‏ ما جاء بك يا أبا بكر ‏\"‏ ‏.‏ فقال خرجت ألقى رسول الله صلى الله عليه وسلم وأنظر في وجهه والتسليم عليه ‏.‏ فلم يلبث أن جاء عمر فقال ‏\"‏ ما جاء بك يا عمر ‏\"‏ ‏.‏ قال الجوع يا رسول الله قال فقال رسول الله صلى الله عليه وسلم ‏\"‏ وأنا قد وجدت بعض ذلك ‏\"‏ ‏.‏ فانطلقوا إلى منزل أبي الهيثم بن التيهان الأنصاري وكان رجلا كثير النخل والشاء ولم يكن له خدم فلم يجدوه فقالوا لامرأته أين صاحبك فقالت انطلق يستعذب لنا الماء ‏.‏ فلم يلبثوا أن جاء أبو الهيثم بقربة يزعبها فوضعها ثم جاء يلتزم النبي صلى الله عليه وسلم ويفديه بأبيه وأمه ثم انطلق بهم إلى حديقته فبسط لهم بساطا ثم انطلق إلى نخلة فجاء بقنو فوضعه فقال النبي صلى الله عليه وسلم ‏\"‏ أفلا تنقيت لنا من رطبه ‏\"‏ ‏.‏ فقال يا رسول الله إني أردت أن تختاروا أو قال تخيروا من رطبه وبسره ‏.‏ فأكلوا وشربوا من ذلك الماء فقال رسول الله صلى الله عليه وسلم ‏\"‏ هذا والذي نفسي بيده من النعيم الذي تسألون عنه يوم القيامة ظل بارد ورطب طيب وماء بارد ‏\"‏ ‏.‏ فانطلق أبو الهيثم ليصنع لهم طعاما فقال النبي صلى الله عليه وسلم ‏\"‏ لا تذبحن ذات در ‏\"‏ ‏.‏ قال فذبح لهم عناقا أو جديا فأتاهم بها فأكلوا فقال النبي صلى الله عليه وسلم ‏\"‏ هل لك خادم ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ فإذا أتانا سبى فائتنا ‏\"‏ ‏.‏ فأتي النبي صلى الله عليه وسلم برأسين ليس معهما ثالث فأتاه أبو الهيثم فقال النبي صلى الله عليه وسلم ‏\"‏ اختر منهما ‏\"‏ ‏.‏ فقال يا نبي الله اختر لي ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ إن المستشار مؤتمن خذ هذا فإني رأيته يصلي واستوص به معروفا ‏\"‏ ‏.‏ فانطلق أبو الهيثم إلى امرأته فأخبرها بقول رسول الله صلى الله عليه وسلم فقالت امرأته ما أنت ببالغ ما قال فيه النبي صلى الله عليه وسلم إلا أن تعتقه قال فهو عتيق ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ إن الله لم يبعث نبيا ولا خليفة إلا وله بطانتان بطانة تأمره بالمعروف وتنهاه عن المنكر وبطانة لا تألوه خبالا ومن يوق بطانة السوء فقد وقي ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏",
      "text_en": " Abu Hurairah narrated :                     \"The Prophet (s.a.w) went out during an hour in which he would normally not go out, nor meet with anyone. Then Abu Bakr came to him. So he said:\"What brought you O Abu Bakr?\" He said: \"I came to meet the Messenger of Allah (s.a.w) and to look at his face, and to make sure he was safe. It was not long before 'Umar came. He said: \"What has brought you O 'Umar ?\" He said: \"Hunger  O  Messenger of Allah!\"He said: \"I also experienced some of that\" So they went to the home of Abu Al-Haitham At-Taiyyihan Al-Ansari. He was a man with many date-palms and sheep, but he had no servants so they did not find him there. They said to his wife: \"Where is your companion?\" She said: \"He has gone to fetch us some good water.\" It was not long before Abu Al-Haitham came along hauling to a large water-skin which he put down. Then he came to hug the Prophet (s.a.w) and uttered that his father and mother should be ransomed for him. Then he went to grove of his and he spread out a mat for them. Then he went to a date-palm and returned with a cluster of dates which he put down. The prophet (s.a.w) said: \"Why don't you select some ripe dates for us?\" He said:  \"O Messenger of Allah(s.a.w)! I wanted you to select from the ripe dates and the unripe dates.\" So they ate and they drank from that water. The Messenger of Allah(s.a.w) said: \"By the One in Whose Hand is my soul! This is among the favors which you shall be asked about on the Day of Judgement. Cool shade, tasty ripe dates, and cool water.\" Abu Al-Haitham left to prepare some food for them. The Prophet (s.a.w) said: \"Do not slaughter one with milk.\" So he Slaughtered a small female or male goat and brought it to them so they could eat it. The Prophet (s.a.w) said: \"Do you have any servants?\" He said: \"No.\" So he said: \"Then if we get some captives we shall bring them for you.\" So (later) the Prophet (s.a.w) came with 2 males, there was no third among them and he brought them to Abu Al-Haitham. The Prophet (s.a.w) said: \"Choose from them.\" He said: \"O Prophet of Allah! Choose for me.\" So the Prophet (s.a.w) said: \"Indeed the one consulted is entrusted. Take this one for I have seen him praying, and encourage him to do well.\" So Abu Al-Haitham went to his wife and informed her of what the Messenger of Allah (s.a.w) said. So his wife said: \"You will not fulfill what the Prophet (s.a.w) said until you have freed him.\" So he said: \"He is free.\" So the Prophet (s.a.w) said: \"Indeed Allah has not send a Prophet nor made a Khalifah except that he has two groups of supporters, group ordering him to do good, and prohibiting him from evil and a group that never ceases spoiling his affairs. So whoever protected.\"",
      "chain": [
        "34188",
        "20404",
        "20240",
        "11368",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "2632",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا محمد بن إسماعيل، حدثنا يحيى بن صالح، حدثنا محمد بن المهاجر، عن العباس، عن أبي سلام الحبشي، قال بعث إلى عمر بن عبد العزيز فحملت على البريد ‏.‏ قال فلما دخل عليه قال يا أمير المؤمنين لقد شق على مركبي البريد ‏.‏ فقال يا أبا سلام ما أردت أن أشق عليك ولكن بلغني عنك حديث تحدثه عن ثوبان عن النبي صلى الله عليه وسلم في الحوض فأحببت أن تشافهني به ‏.‏ قال أبو سلام حدثني ثوبان عن النبي صلى الله عليه وسلم قال ‏\"‏ حوضي من عدن إلى عمان البلقاء ماؤه أشد بياضا من اللبن وأحلى من العسل وأكاويبه عدد نجوم السماء من شرب منه شربة لم يظمأ بعدها أبدا أول الناس ورودا عليه فقراء المهاجرين الشعث رءوسا الدنس ثيابا الذين لا ينكحون المتنعمات ولا تفتح لهم السدد ‏\"‏ ‏.‏ قال عمر لكني نكحت المتنعمات وفتح لي السدد ونكحت فاطمة بنت عبد الملك لا جرم أني لا أغسل رأسي حتى يشعث ولا أغسل ثوبي الذي يلي جسدي حتى يتسخ ‏.‏ قال أبو عيسى هذا حديث غريب من هذا الوجه ‏.‏ وقد روي هذا الحديث عن معدان بن أبي طلحة عن ثوبان عن النبي صلى الله عليه وسلم ‏.‏ وأبو سلام الحبشي اسمه ممطور وهو شامي ثقة ‏.‏",
      "text_en": " Al-'Abbas narrated from Abu Sallam Al-Habashi who said:                     \"'Umar bin 'Abdul-'Aziz summoned me so I got a ride on a mule.\" [He said:] \"When he entered upon him, he said: 'O Commander of the Beleivers! My riding mule was troublesome for me.' So he said: 'O Abu Sallam!I did not want to trouble you, but a Hadith which you narrated-from Thawban, from the Prophet (s.a.w) about the Hawd-was conveyed to me,and I wanted you to narrate it directly to me.\"'Abu Sallam said: \"Thawban narrated to me from The Messenger of Allah (s.a.w) who said 'My Hawd (is as large as) from 'Adan to 'Amman of Al-Balqa', its water is whiter than milk and sweeter than honey. Its cups are as numerous as the stars, whoever drinks one drink from it, he will never be thirsty after that again. The first people to arrive at it are the poor among the Muhajirin with disheveled heads, dirty clothes, those whom the women of favor would not marry, nor would the doors be open for them.' 'Umar said: 'But I have married a women of favor and the doors are open for me. I married Fatimah bint 'Abdul-Malik. I shall certainly not wash my head until it is disheveled, nor wash my garment which touches my body until it becomes dirty.\"",
      "chain": [
        "34188",
        "20470",
        "100",
        "10968"
      ]
    },
    {
      "hadith_no": "2712",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا عباس الدوري، حدثنا يحيى بن أبي بكير، عن إسرائيل، بهذا الإسناد نحوه ‏.‏ وسألت محمد بن إسماعيل عن هذا الحديث، فلم يعرفه إلا من حديث إسرائيل ولم يعرف اسم أبي بشر ‏.‏",
      "text_en": "",
      "chain": [
        "30585",
        "20365",
        "20311",
        "34188"
      ]
    },
    {
      "hadith_no": "2746",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of Paradise - كتاب صفة الجنة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "38",
      "text_ar": "حدثنا محمد بن إسماعيل، حدثنا هشام بن عمار، حدثنا عبد الحميد بن حبيب بن أبي العشرين، حدثنا الأوزاعي، حدثنا حسان بن عطية، عن سعيد بن المسيب، أنه لقي أبا هريرة فقال أبو هريرة أسأل الله أن يجمع، بيني وبينك في سوق الجنة ‏.‏ فقال سعيد أفيها سوق قال نعم أخبرني رسول الله صلى الله عليه وسلم ‏\"‏ أن أهل الجنة إذا دخلوها نزلوا فيها بفضل أعمالهم ثم يؤذن في مقدار يوم الجمعة من أيام الدنيا فيزورون ربهم ويبرز لهم عرشه ويتبدى لهم في روضة من رياض الجنة فتوضع لهم منابر من نور ومنابر من لؤلؤ ومنابر من ياقوت ومنابر من زبرجد ومنابر من ذهب ومنابر من فضة ويجلس أدناهم وما فيهم من دني على كثبان المسك والكافور وما يرون أن أصحاب الكراسي بأفضل منهم مجلسا ‏\"‏ ‏.‏ قال أبو هريرة قلت يا رسول الله وهل نرى ربنا قال ‏\"‏ نعم قال هل تتمارون في رؤية الشمس والقمر ليلة البدر ‏\"‏ ‏.‏ قلنا لا ‏.‏ قال ‏\"‏ كذلك لا تتمارون في رؤية ربكم ولا يبقى في ذلك المجلس رجل إلا حاضره الله محاضرة حتى يقول للرجل منهم يا فلان ابن فلان أتذكر يوم قلت كذا وكذا فيذكره ببعض غدراته في الدنيا فيقول يا رب أفلم تغفر لي فيقول بلى فبسعة مغفرتي بلغت منزلتك هذه ‏.‏ فبينما هم على ذلك غشيتهم سحابة من فوقهم فأمطرت عليهم طيبا لم يجدوا مثل ريحه شيئا قط ويقول ربنا تبارك وتعالى قوموا إلى ما أعددت لكم من الكرامة فخذوا ما اشتهيتم ‏.‏ قال فنأتي سوقا قد حفت به الملائكة فيه ما لم تنظر العيون إلى مثله ولم تسمع الآذان ولم يخطر على القلوب فيحمل لنا ما اشتهينا ليس يباع فيها ولا يشترى وفي ذلك السوق يلقى أهل الجنة بعضهم بعضا قال فيقبل الرجل ذو المنزلة المرتفعة فيلقى من هو دونه وما فيهم دني فيروعه ما يرى عليه من اللباس فما ينقضي آخر حديثه حتى يتخيل إليه ما هو أحسن منه وذلك أنه لا ينبغي لأحد أن يحزن فيها ثم ننصرف إلى منازلنا فتتلقانا أزواجنا فيقلن مرحبا وأهلا لقد جئت وإن بك من الجمال أفضل مما فارقتنا عليه ‏.‏ فنقول إنا جالسنا اليوم ربنا الجبار ويحقنا أن ننقلب بمثل ما انقلبنا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من هذا الوجه وقد روى سويد بن عمرو عن الأوزاعي شيئا من هذا الحديث ‏.‏",
      "text_en": " Hasan bin 'Atiyyah narrated from Sa'eed bin Al-Musayyab, that he met Abu Hurairah, and Abu Hurairah said:                     \"I supplicate Allah to bring you and I together in the market of Paradise.\" So Sa'eed said: \"Is there a market in it?\" He said: \"Yes, the messenger of Allah (s.a.w) informed me that: 'When the people of Paradise enter it, they shall take their places according to the virtue of their deeds. Then permission shall be granted to them to visit their Lord, for the length of a Friday from the days of the world. He shall present for them His Throne and He shall manifest the gardens of Paradise. Then lofty seats of light shall be erected for them, and lofty saets of pearl, and lofty seats or corundum, and lofty seats of peridots, and lofty seats of gold, and lofty seats of silver. And the lowest of them- and there is none of them that is low- shall sit upon a dune of musk and camphor, and they shall not regard those upon the chairs as having a better sitting place than them.' Abu Hurairah said: \"I said: 'O Messenger of Allah, and will we see our Lord?' He (S.a.w) said: 'Yes.[He said: ] Do you doubt [concerning] seeing the sun, or the  moon on a night when it is full?' We said: 'No.' He said: 'Likewise, you will not doubt concerning seeing your Lord. And they shall not remain in that meeting any man except Allah shall give him a lecture until he says to a man from among them: \"O so-and",
      "chain": [
        "34188",
        "30288",
        "27523",
        "20024",
        "11413",
        "11002"
      ]
    },
    {
      "hadith_no": "2681",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Knowledge - كتاب العلم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "41",
      "text_ar": "حدثنا محمد بن إسماعيل، حدثنا إبراهيم بن موسى، أخبرنا الوليد بن مسلم، حدثنا روح بن جناح، عن مجاهد، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ فقيه أشد على الشيطان من ألف عابد ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب ولا نعرفه إلا من هذا الوجه من حديث الوليد بن مسلم ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     that the Messenger of Allah (ﷺ) said: \"The Faqih is harder on Ash-Shaitan than a thousand worshipers.\"",
      "chain": [
        "34188",
        "30309",
        "20733",
        "27512",
        "11028",
        "17"
      ]
    },
    {
      "hadith_no": "2732",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Seeking Permission - كتاب الاستئذان والآداب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "42",
      "text_ar": "حدثنا محمد بن إسماعيل، حدثنا إبراهيم بن يحيى بن محمد بن عباد المدني، حدثني أبو يحيى بن محمد، عن محمد بن إسحاق، عن محمد بن مسلم الزهري، عن عروة بن الزبير، عن عائشة، قالت قدم زيد بن حارثة المدينة ورسول الله صلى الله عليه وسلم في بيتي فأتاه فقرع الباب فقام إليه رسول الله صلى الله عليه وسلم عريانا يجر ثوبه والله ما رأيته عريانا قبله ولا بعده فاعتنقه وقبله ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه من حديث الزهري إلا من هذا الوجه ‏.‏",
      "text_en": " Narrated 'Aishah:                     \"Zaid bin Harithah arrived in Al-Madinah while the Messenger of Allah (ﷺ) was in his house. So he went and knocked at the door, so the Messenger of Allah (ﷺ) stood naked (1), dragging his garment - and by Allah! I did not see him naked before nor afterwards - and he hugged him and kissed him.\"(1) They say that the meaning of naked here is that he was not wearing his Rida or upper wrap and it was that which was dragging, so the area between the navel and knees were covered. See Tuhfat Al-Ahwadhi.",
      "chain": [
        "34188",
        "11107",
        "20176",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "3101",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Parables - كتاب الأمثال عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "44",
      "text_ar": "حدثنا محمد بن إسماعيل، حدثنا محمد بن سنان، حدثنا سليم بن حيان، بصري حدثنا سعيد بن ميناء، عن جابر بن عبد الله، قال قال النبي صلى الله عليه وسلم ‏\"‏ إنما مثلي ومثل الأنبياء قبلي كرجل بنى دارا فأكملها وأحسنها إلا موضع لبنة فجعل الناس يدخلونها ويتعجبون منها ويقولون لولا موضع اللبنة ‏\"‏ ‏.‏ وفي الباب عن أبى بن كعب وأبي هريرة ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه ‏.‏",
      "text_en": " Narrated Jabir bin 'Abdullah:                     that the Messenger of Allah (ﷺ) said: \"The parable of myself and the Prophets [before myself] is that of a man who constructed a house. He complete it and made it well, except for the space of one brick. So the people enter it and marvel at it saying: 'If not for the space of this brick.'\"",
      "chain": [
        "34188",
        "34207",
        "20234",
        "11510",
        "34"
      ]
    },
    {
      "hadith_no": "3102",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Parables - كتاب الأمثال عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "44",
      "text_ar": "حدثنا محمد بن إسماعيل، حدثنا موسى بن إسماعيل، حدثنا أبان بن يزيد، حدثنا يحيى بن أبي كثير، عن زيد بن سلام، أن أبا سلام، حدثه أن الحارث الأشعري حدثه أن النبي صلى الله عليه وسلم قال ‏\"‏ إن الله أمر يحيى بن زكريا بخمس كلمات أن يعمل بها ويأمر بني إسرائيل أن يعملوا بها وإنه كاد أن يبطئ بها فقال عيسى إن الله أمرك بخمس كلمات لتعمل بها وتأمر بني إسرائيل أن يعملوا بها فإما أن تأمرهم وإما أنا آمرهم ‏.‏ فقال يحيى أخشى إن سبقتني بها أن يخسف بي أو أعذب فجمع الناس في بيت المقدس فامتلأ المسجد وقعدوا على الشرف فقال إن الله أمرني بخمس كلمات أن أعمل بهن وآمركم أن تعملوا بهن أولهن أن تعبدوا الله ولا تشركوا به شيئا وإن مثل من أشرك بالله كمثل رجل اشترى عبدا من خالص ماله بذهب أو ورق فقال هذه داري وهذا عملي فاعمل وأد إلى فكان يعمل ويؤدي إلى غير سيده فأيكم يرضى أن يكون عبده كذلك وإن الله أمركم بالصلاة فإذا صليتم فلا تلتفتوا فإن الله ينصب وجهه لوجه عبده في صلاته ما لم يلتفت وآمركم بالصيام فإن مثل ذلك كمثل رجل في عصابة معه صرة فيها مسك فكلهم يعجب أو يعجبه ريحها وإن ريح الصائم أطيب عند الله من ريح المسك وآمركم بالصدقة فإن مثل ذلك كمثل رجل أسره العدو فأوثقوا يده إلى عنقه وقدموه ليضربوا عنقه فقال أنا أفديه منكم بالقليل والكثير ‏.‏ ففدى نفسه منهم وآمركم أن تذكروا الله فإن مثل ذلك كمثل رجل خرج العدو في أثره سراعا حتى إذا أتى على حصن حصين فأحرز نفسه منهم كذلك العبد لا يحرز نفسه من الشيطان إلا بذكر الله ‏\"‏ ‏.‏ قال النبي صلى الله عليه وسلم ‏\"‏ وأنا آمركم بخمس الله أمرني بهن السمع والطاعة والجهاد والهجرة والجماعة فإنه من فارق الجماعة قيد شبر فقد خلع ربقة الإسلام من عنقه إلا أن يرجع ومن ادعى دعوى الجاهلية فإنه من جثا جهنم ‏\"‏ ‏.‏ فقال رجل يا رسول الله وإن صلى وصام قال ‏\"‏ وإن صلى وصام فادعوا بدعوى الله الذي سماكم المسلمين المؤمنين عباد الله ‏\"‏ ‏.‏ هذا حديث حسن صحيح غريب ‏.‏ قال محمد بن إسماعيل الحارث الأشعري له صحبة وله غير هذا الحديث ‏.‏",
      "text_en": " Narrated Al-Harith Al-Ash'ari:                     that the Messenger of Allah (ﷺ) said: \"Indeed Allah commanded Yahya bin Zakariyya with five commandments to abide by, and to command the Children of Isra'il to abide by them. But he was slow in doing so. So 'Eisa said: 'Indeed Allah commanded you with five commandments to abide by and to command the Children of Isra'il to abide by. Either you command them, or I shall command them.' So Yahya said: 'I fear that if you precede me in this, then the earth may swallow me, or I shall be punished.' So he gathered the people in Jerusalem, and they filled [the Masjid] and sat upon its balconies. So he said: 'Indeed Allah has commanded me with five commandments to abide by, and to command you to abide by. The first of them is that you worship Allah and not associate anything with him. The parable of the one who associates others with Allah is that of a man who buys a servant with his own gold or silver, then he says to him: \"This is my home and this is my business so take care of it and give me the profits.\" So he takes care of it and gives the profits to someone other than his master. Which of you would live to have a servant like that? And Allah commands you to perform Salat, and when you perform Salat then do not turn away, for Allah is facing the face of His worshipers as long as he does not turn away. And He commands you with fasting. For indeed the parable of fasting, is that of a man in a group with a sachet containing musk. All of them enjoy its fragrance. Indeed the breath of the fasting person is more pleasant to Allah than the scent of musk. And He commands you to give charity. The parable of that, is a man captured by his enemies, tying his hands to his neck, and they come to him to beat his neck. Then he said: \"I can ransom myself from you with a little or a lot\" so he ransoms himself from them. And He commands you to remember Allah. For indeed the parable of that, is a man whose enemy quickly tracks him until he reaches an impermeable fortress in which he protects himself from them. This is how the worshiper is; he does not protect himself from Ash-Shaitan except by the remembrance of Allah.'\" The Prophet (ﷺ) said: \"And I command you with five that Allah commanded me: Listening and obeying, Jihad, Hijrah, and the Jama'ah. For indeed whoever parts from the Jama'ah the measure of a hand-span, then he has cast off the yoke of Islam from his neck, unless he returns. And whoever calls with the call of Jahiliyyah then he is from the coals of Hell.\" A man said: \"O Messenger of Allah! Even if he performs Salat and fasts?\" So he (ﷺ) said: \"Even if he performs Salat and fasts. So call with the call that Allah named you with: Muslims, believers, worshipers of Allah.\"",
      "chain": [
        "34188",
        "20040",
        "20205",
        "11449",
        "10912"
      ]
    },
    {
      "hadith_no": "3110",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Parables - كتاب الأمثال عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "44",
      "text_ar": "حدثنا محمد بن إسماعيل، حدثنا خلاد بن يحيى، حدثنا بشير بن المهاجر، أخبرنا عبد الله بن بريدة، عن أبيه، قال قال النبي صلى الله عليه وسلم ‏\"‏ هل تدرون ما هذه وما هذه ‏\"‏ ‏.‏ ورمى بحصاتين ‏.‏ قالوا الله ورسوله أعلم ‏.‏ قال ‏\"‏ هذاك الأمل وهذاك الأجل ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه ‏.‏",
      "text_en": " Narrated 'Abdullah bin Buraidah:                     from his father that the Prophet (ﷺ) said: \"Do you know what the parable of this and this is?\" - and he tossed two pebbles. They said: \"Allah and His Messenger (ﷺ) know better.\" He said: \"This (the farther) one is hope, and this (closer) one is death.\"",
      "chain": [
        "34188",
        "20191",
        "10747",
        "11432",
        "3131"
      ]
    },
    {
      "hadith_no": "3122",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on The Virtues of the Qur'an - كتاب فضائل القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمد بن إسماعيل، قال حدثنا الحميدي، حدثنا سفيان بن عيينة، في تفسير حديث عبد الله بن مسعود قال ما خلق الله من سماء ولا أرض أعظم من آية الكرسي ‏.‏ قال سفيان لأن آية الكرسي هو كلام الله وكلام الله أعظم من خلق الله من السماء والأرض ‏.‏",
      "text_en": " Narrated 'Abdullah bin Mas'ud:                     \"Allah has not created in the heavens nor in the earth what is more magnificent than Ayat Al-Kursi.\" Sufyan said: \"Because Ayat Al-Kursi is the Speech of Allah, and Allah's Speech is greater than Allah's creation of the heavens and the earth.\"",
      "chain": [
        "34188",
        "30418",
        "20005"
      ]
    },
    {
      "hadith_no": "3125",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on The Virtues of the Qur'an - كتاب فضائل القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمد بن إسماعيل، أخبرنا هشام بن إسماعيل أبو عبد الملك العطار، حدثنا محمد بن شعيب، حدثنا إبراهيم بن سليمان، عن الوليد بن عبد الرحمن، أنه حدثهم عن جبير بن نفير، عن نواس بن سمعان، عن النبي صلى الله عليه وسلم قال ‏\"‏ يأتي القرآن وأهله الذين يعملون به في الدنيا تقدمه سورة البقرة وآل عمران ‏\"‏ ‏.‏ قال نواس وضرب لهما رسول الله صلى الله عليه وسلم ثلاثة أمثال ما نسيتهن بعد قال ‏\"‏ تأتيان كأنهما غيايتان وبينهما شرق أو كأنهما غمامتان سوداوان أو كأنهما ظلة من طير صواف تجادلان عن صاحبهما ‏\"‏ ‏.‏ وفي الباب عن بريدة وأبي أمامة ‏.‏ قال أبو عيسى هذا حديث غريب من هذا الوجه ‏.‏ ومعنى هذا الحديث عند أهل العلم أنه يجيء ثواب قراءته كذا فسر بعض أهل العلم هذا الحديث وما يشبه هذا من الأحاديث أنه يجيء ثواب قراءة القرآن ‏.‏ وفي حديث النواس عن النبي صلى الله عليه وسلم ما يدل على ما فسروا إذ قال النبي صلى الله عليه وسلم ‏\"‏ وأهله الذين يعملون به في الدنيا ‏\"‏ ‏.‏ ففي هذا دلالة أنه يجيء ثواب العمل ‏.‏",
      "text_en": " Narrated An-Nawwas bin Sam'an:                     that the Prophet (ﷺ) said: \"The Qur'an shall come, and its people who acted according to it in the world. Surat Al-Baqarah and Al 'Imran shall be in front of it. An-Nawwas said: \"The Messenger of Allah (ﷺ) stated three parables about them which I have not since forgotten, he said: \"They will come as if they are two shades between which there is illumination, or as if they are two shady clouds, or as if they are shadows of lines of birds arguing on behalf of their people.\"",
      "chain": [
        "34188",
        "37539",
        "20732",
        "10975",
        "4097"
      ]
    },
    {
      "hadith_no": "3147",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on The Virtues of the Qur'an - كتاب فضائل القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمد بن إسماعيل، حدثنا إسماعيل بن أبي أويس، حدثنا عبد العزيز بن محمد، عن عبيد الله بن عمر، عن ثابت البناني، عن أنس بن مالك، قال كان رجل من الأنصار يؤمهم في مسجد قباء فكان كلما افتتح سورة يقرأ لهم في الصلاة فقرأ بها افتتح ب ‏(‏قل هو الله أحد ‏)‏ حتى يفرغ منها ثم يقرأ بسورة أخرى معها وكان يصنع ذلك في كل ركعة فكلمه أصحابه فقالوا إنك تقرأ بهذه السورة ثم لا ترى أنها تجزيك حتى تقرأ بسورة أخرى فإما أن تقرأ بها وإما أن تدعها وتقرأ بسورة أخرى ‏.‏ قال ما أنا بتاركها إن أحببتم أن أؤمكم بها فعلت وإن كرهتم تركتكم ‏.‏ وكانوا يرونه أفضلهم وكرهوا أن يؤمهم غيره فلما أتاهم النبي صلى الله عليه وسلم أخبروه الخبر فقال ‏\"‏ يا فلان ما يمنعك مما يأمر به أصحابك وما يحملك أن تقرأ هذه السورة في كل ركعة ‏\"‏ ‏.‏ فقال يا رسول الله إني أحبها ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن حبها أدخلك الجنة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب صحيح من هذا الوجه من حديث عبيد الله بن عمر عن ثابت ‏.‏",
      "text_en": " Narrated Anas bin Malik:                     \"There was a man from the Ansar who led them (in Salat) at Masjid Quba. Every time he was to recite a Surah for them during Salat, he would begin by reciting Qul Huwa Allahu Ahad until he finished, then he would recite another Surah with it. He did that in each Rak'ah. His companions talked to him and said: 'You recite this Surah. You should either recite it or leave it and recite another Surah.'\" He said: \"I shall not leave it, if you would like me to lead you with it then I shall do so, and if you do not like it then I shall leave you.\" And they considered him the best among them, and they did not like the idea of someone else leading them. So when the Prophet (ﷺ) came to them they informed him about what had happened and he (ﷺ) said: \"O so-and-so! What prevents you from doing what your companions told you to do, why do recite this Surah in every Rak'ah\" He said: \"O Messenger of Allah! Indeed I love it.\" So the Messenger of Allah (ﷺ) said: \"Your love for it shall have you admitted into Paradise.\"",
      "chain": [
        "34188",
        "30103",
        "20167",
        "11201",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "3168",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on The Virtues of the Qur'an - كتاب فضائل القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمد بن إسماعيل الواسطي، حدثنا وكيع، حدثنا أبو فروة، يزيد بن سنان عن أبي المبارك، عن صهيب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما آمن بالقرآن من استحل محارمه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث ليس إسناده بالقوي وقد خولف وكيع في روايته ‏.‏ وقال محمد أبو فروة يزيد بن سنان الرهاوي ليس بحديثه بأس إلا رواية ابنه محمد عنه فإنه يروي عنه مناكير ‏.‏ قال أبو عيسى وقد روى محمد بن يزيد بن سنان عن أبيه هذا الحديث فزاد في هذا الإسناد عن مجاهد عن سعيد بن المسيب عن صهيب ولا يتابع محمد بن يزيد على روايته وهو ضعيف وأبو المبارك رجل مجهول ‏.‏",
      "text_en": " Narrated Suhaib:                     that the Messenger of Allah (ﷺ) said: \"He does not believe in the Qur'an who makes lawful what it prohibits.\"",
      "chain": [
        "34188",
        "20032",
        "28643",
        "182"
      ]
    },
    {
      "hadith_no": "3175",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on The Virtues of the Qur'an - كتاب فضائل القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمد بن إسماعيل، قال حدثنا محمد بن كثير، أخبرنا إسرائيل، حدثنا عثمان بن المغيرة، عن سالم بن أبي الجعد، عن جابر، قال كان النبي صلى الله عليه وسلم يعرض نفسه بالموقف فقال ‏\"‏ ألا رجل يحملني إلى قومه فإن قريشا قد منعوني أن أبلغ كلام ربي ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب صحيح ‏.‏",
      "text_en": " Narrated Jabir bin 'Abdullah:                     \"During the Mawqif (hajj season), the Prophet (ﷺ) would present himself sand say: 'Which man will bring me to his people? For indeed the Quraish have prevented me from conveying the Speech of my Lord.'\"",
      "chain": [
        "34188",
        "28531",
        "20311",
        "11640",
        "11342",
        "34"
      ]
    },
    {
      "hadith_no": "3176",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on The Virtues of the Qur'an - كتاب فضائل القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمد بن إسماعيل، حدثنا شهاب بن عباد العبدي، حدثنا محمد بن الحسن بن أبي يزيد الهمداني، عن عمرو بن قيس، عن عطية، عن أبي سعيد، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يقول الرب عز وجل من شغله القرآن وذكري عن مسألتي أعطيته أفضل ما أعطي السائلين وفضل كلام الله على سائر الكلام كفضل الله على خلقه ‏\"‏ ‏.‏ قال هذا حديث حسن غريب ‏.‏",
      "text_en": " Narrated 'Atiyyah:                     from Abu Sa'eed, that the Messenger of Allah (ﷺ) said: \"The Lord, Blessed and Most High is He, has said: 'Whoever is too busy with the Qur'an for remembering Me and asking Me, then I shall give him more than what I give to those who ask.' And the virtue of Allah's Speech over the speech of others is like the virtue of Allah over His creation.",
      "chain": [
        "34188",
        "30196",
        "25260",
        "213",
        "38"
      ]
    },
    {
      "hadith_no": "3371",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمد بن إسماعيل، حدثنا سعيد بن سليمان، حدثنا عباد بن العوام، حدثنا سفيان بن حسين، عن الحكم بن عتيبة، عن مقسم، عن ابن عباس، قال بعث النبي صلى الله عليه وسلم أبا بكر وأمره أن ينادي بهؤلاء الكلمات ثم أتبعه عليا فبينا أبو بكر في بعض الطريق إذ سمع رغاء ناقة رسول الله صلى الله عليه وسلم القصواء فخرج أبو بكر فزعا فظن أنه رسول الله صلى الله عليه وسلم فإذا هو علي فدفع إليه كتاب رسول الله صلى الله عليه وسلم وأمر عليا أن ينادي بهؤلاء الكلمات فانطلقا فحجا فقام علي أيام التشريق فنادى ذمة الله ورسوله بريئة من كل مشرك فسيحوا في الأرض أربعة أشهر ولا يحجن بعد العام مشرك ولا يطوفن بالبيت عريان ولا يدخل الجنة إلا مؤمن وكان علي ينادي فإذا عيي قام أبو بكر فنادى بها ‏.‏ قال أبو عيسى وهذا حديث حسن غريب من هذا الوجه من حديث ابن عباس ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     \"The Messenger of Allah (ﷺ) dispatched Abu Bakr ordering him to announce these statements. Then 'Ali followed him. When Abu Bakr was at a particular road, he heard the heavy breathing of Al-Qiswa, the she camel of the Messenger of Allah (ﷺ), so Abu Bakr appeared frightened because he thought that it was the Messenger of Allah (ﷺ). When he saw that it was 'Ali, he gave him the letter of the Messenger of Allah (ﷺ), and told 'Ali to announce the statements. So he left to perform Hajj. During the day of At-Tashriq 'Ali stood to announce: 'The protection of Allah and His Messenger is removed from every idolater. So travel in the land for four months. There is to be no idolater performing Hajj after this year, nor may anyone perform Tawaf around the House while naked. None shall enter Paradise but a believer.' 'Ali was making the announcement, so when he became exhausted Abu Bakr would announce it.\"",
      "chain": [
        "34188",
        "30252",
        "20431",
        "20655",
        "11069",
        "11725",
        "17"
      ]
    },
    {
      "hadith_no": "3419",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمد بن إسماعيل، حدثنا أحمد بن أبي الطيب، حدثنا مصعب بن سلام، عن عمرو بن قيس، عن عطية، عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ اتقوا فراسة المؤمن فإنه ينظر بنور الله ‏\"‏ ‏.‏ ثم قرأ ‏:‏ ‏(‏ إن في ذلك لآيات للمتوسمين ‏)‏ ‏.‏ قال أبو عيسى هذا حديث غريب إنما نعرفه من هذا الوجه وقد روي عن بعض أهل العلم في تفسير هذه الآية ‏:‏ ‏(‏ إن في ذلك لآيات للمتوسمين ‏)‏ قال للمتفرسين ‏.‏",
      "text_en": " Narrated Abu Sa'eed Al-Khudri:                     that the Messenger of Allah (ﷺ) said: \"Beware of the believer's intuition, for indeed he sees with Allah's Light.\" Then he recited: Surely in this are signs for those who see (15:75).",
      "chain": [
        "34188",
        "30240",
        "25302",
        "213",
        "38"
      ]
    },
    {
      "hadith_no": "3468",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمد بن إسماعيل، وغير، واحد، قالوا حدثنا عبد الله بن صالح، قال حدثني الليث، عن عبد الرحمن بن خالد، عن ابن شهاب، عن محمد بن عروة بن الزبير، عن عبد الله بن الزبير، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إنما سمي البيت العتيق لأنه لم يظهر عليه جبار ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح وقد روي هذا الحديث عن الزهري عن النبي صلى الله عليه وسلم مرسلا ‏.‏",
      "text_en": " Narrated 'Abdullah bin Az-Zubair:                     that the Messenger of Allah (ﷺ) said: \"It is only called Al-Bait Al-'Atiq because it has not been conquered by a tyrant.\"",
      "chain": [
        "34188",
        "20023",
        "20376",
        "11013",
        "106"
      ]
    },
    {
      "hadith_no": "3498",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمد بن إسماعيل، حدثنا إسماعيل بن أبي أويس، حدثني ابن أبي الزناد، عن أبي الزناد، عن عروة بن الزبير، عن نيار بن مكرم الأسلمي، قال لما نزلت ‏:‏ ‏(‏ الم * غلبت الروم * في أدنى الأرض وهم من بعد غلبهم سيغلبون * في بضع سنين ‏)‏ فكانت فارس يوم نزلت هذه الآية قاهرين للروم وكان المسلمون يحبون ظهور الروم عليهم لأنهم وإياهم أهل كتاب وفي ذلك قول الله تعالى ‏:‏ ‏(‏يومئذ يفرح المؤمنون * بنصر الله ينصر من يشاء وهو العزيز الرحيم ‏)‏ فكانت قريش تحب ظهور فارس لأنهم وإياهم ليسوا بأهل كتاب ولا إيمان ببعث فلما أنزل الله تعالى هذه الآية خرج أبو بكر الصديق رضى الله عنه يصيح في نواحي مكة ‏:‏ ‏(‏ الم * غلبت الروم * في أدنى الأرض وهم من بعد غلبهم سيغلبون * في بضع سنين ‏)‏ قال ناس من قريش لأبي بكر فذلك بيننا وبينكم زعم صاحبكم أن الروم ستغلب فارسا في بضع سنين أفلا نراهنك على ذلك قال بلى ‏.‏ وذلك قبل تحريم الرهان فارتهن أبو بكر والمشركون وتواضعوا الرهان وقالوا لأبي بكر كم تجعل البضع ثلاث سنين إلى تسع سنين فسم بيننا وبينك وسطا تنتهي إليه ‏.‏ قال فسموا بينهم ست سنين قال فمضت الست سنين قبل أن يظهروا فأخذ المشركون رهن أبي بكر فلما دخلت السنة السابعة ظهرت الروم على فارس فعاب المسلمون على أبي بكر تسمية ست سنين لأن الله تعالى قال ‏:‏ ‏(‏في بضع سنين ‏)‏ قال وأسلم عند ذلك ناس كثير ‏.‏ قال هذا حديث صحيح حسن غريب من حديث نيار بن مكرم لا نعرفه إلا من حديث عبد الرحمن بن أبي الزناد ‏.‏",
      "text_en": " Narrated Niyar bin Mukram Al-Aslami:                     \"When (the following) was revealed: 'Alif Lam Mim. The Romans have been defeated. In the nearest land, and they, after their defeat, will be victorious in Bid' years (30:1-4).' - on the day that these Ayat were revealed, the Persians had defeated the Romans, and the Muslims had wanted the Romans to be victorious over them, because they were the people of the Book. So Allah said about that: 'And on that day, the believers will rejoice - with the help of Allah. He helps whom He wills, and He is the Almighty, the Most Merciful (30:4 & 5). The Quraish wanted the Persians to be victorious since they were not people of the Book, nor did they believe in the Resurrection. So when Allah revealed these Ayat, Abu Bakr As-Siddiq, may Allah be pleased with him, went out, proclaiming throughout Makkah: 'Alif Lam Mim. The Romans have been defeated. In the nearest land, and they, after their defeat, will be victorious, in Bid' years (30:1-4).' Some of the Quraish said: 'Then this is (a bet) between us and you. Your companion claims that the Romans will defeat the Persians in Bid' years, so why have have a bet on that between us and you?' Abu Bakr said: 'Yes.' This was before betting has been forbidden. So Abu Bakr and the idolaters made a bet, and they said to Abu Bakr: 'What do you think - Bid' means something between three and nine years, so let us agree on the middle.' So they agreed on six years; Then six years passed without the Romans being victorious. The idolaters took what they won in the bet from Abu Bakr. When the seventh year came and the Romans were finally victorious over the Persians, the Muslims rebuked Abu Bakr for agreeing to six years. He said: 'Because Allah said: 'In Bid' years.' At that time, many people became Muslims.\"",
      "chain": [
        "34188",
        "30103",
        "20509",
        "11061",
        "10511",
        "5318"
      ]
    },
    {
      "hadith_no": "3412",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا محمد بن إسماعيل بن سمرة الأحمسي الكوفي، حدثنا أسباط بن محمد، حدثنا عمرو بن قيس الملائي، عن الحكم بن عتيبة، عن عبد الرحمن بن أبي ليلى، عن كعب بن عجرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ معقبات لا يخيب قائلهن يسبح الله في دبر كل صلاة ثلاثا وثلاثين ويحمده ثلاثا وثلاثين ويكبره أربعا وثلاثين ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ وعمرو بن قيس الملائي ثقة حافظ ‏.‏ وروى شعبة هذا الحديث عن الحكم ولم يرفعه ‏.‏ ورواه منصور بن المعتمر عن الحكم ورفعه ‏.‏",
      "text_en": " Ka’b bin Ujrah narrated that:                     The Prophet said: “There are Mu’aqqibat, he who says them shall not be miserable. Glorify Allah at the end of every prayer thirty-three times, and praise him thirty-three times, and extol His greatness thirty-four times.”",
      "chain": [
        "34188",
        "20408",
        "10803",
        "11069",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "3458",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا محمد بن إسماعيل، حدثنا عبد الله بن يزيد المقرئ، حدثنا سعيد بن أبي أيوب، حدثني أبو مرحوم، عن سهل بن معاذ بن أنس، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أكل طعاما فقال الحمد لله الذي أطعمني هذا ورزقنيه من غير حول مني ولا قوة ‏.‏ غفر له ما تقدم من ذنبه ‏\"‏ ‏.‏ قال هذا حديث حسن غريب وأبو مرحوم اسمه عبد الرحيم بن ميمون ‏.‏",
      "text_en": " Sahl bin Mu’adh bin Anas narrated from his father that:                     The Messenger of Allah said: “Whoever eats food and then says: ‘All praise is due to Allah who fed me this and granted it as provision to me, without any effort from me nor power, (Al-Hamdulillah, Alladhi At’amani Hadha Wa Razaqanihi Min Ghairi Hawlin Minni, Wa La Quwwatin)’ his past sins shall be forgiven.”",
      "chain": [
        "34188",
        "23033",
        "20375",
        "16045"
      ]
    },
    {
      "hadith_no": "3577",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا محمد بن إسماعيل، حدثنا موسى بن إسماعيل، حدثنا حفص بن عمر الشني، حدثني أبي عمر بن مرة، قال سمعت بلال بن يسار بن زيد، مولى النبي صلى الله عليه وسلم حدثني أبي عن جدي سمع النبي صلى الله عليه وسلم يقول ‏\"‏ من قال أستغفر الله العظيم الذي لا إله إلا هو الحى القيوم وأتوب إليه ‏.‏ غفر له وإن كان فر من الزحف ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من هذا الوجه ‏.‏",
      "text_en": " Bilal bin Yasar bin Zaid [the freed slave of the Prophet] narrated:                     “My father narrated to me, from my grandfather, that he heard the Prophet say: ‘Whoever says: “I seek forgiveness from Allah, the Magnificent, whom there is none worthy of worship but Him, the Living, Al-Qayyum, and I repent to him,” (Astaghfirullahal-Azimalladhi La Ilaha Illa Huwal-Hayyul-Qayyumu Wa Atubu Ilaih) then Allah will forgive him, even if he fled from battle.’”",
      "chain": [
        "34188",
        "20040",
        "30329"
      ]
    },
    {
      "hadith_no": "3965",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن إسماعيل، حدثنا سليمان بن عبد الرحمن الدمشقي، حدثنا الوليد بن مسلم، حدثنا الأوزاعي، حدثني شداد أبو عمار، حدثني واثلة بن الأسقع، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله اصطفى كنانة من ولد إسماعيل واصطفى قريشا من كنانة واصطفى هاشما من قريش واصطفاني من بني هاشم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏",
      "text_en": " Narrated Wathilah bin Al-Asqa':                     that the Messenger of Allah (ﷺ) said: \"Indeed, Allah chose Kinanah from the children of Isma'il, and He chose Quraish from Kinanah, and He chose Hashim from Quraish, and He chose me from Banu Hashim.\"",
      "chain": [
        "34188",
        "30587",
        "20733",
        "20024",
        "10881",
        "4049"
      ]
    },
    {
      "hadith_no": "3974",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن إسماعيل، حدثنا عبد الله بن يزيد المقرئ، حدثنا حيوة، أخبرنا كعب بن علقمة، سمع عبد الرحمن بن جبير، أنه سمع عبد الله بن عمرو، أنه سمع النبي صلى الله عليه وسلم يقول ‏\"‏ إذا سمعتم المؤذن فقولوا مثل ما يقول المؤذن ثم صلوا على فإنه من صلى على صلاة صلى الله عليه بها عشرا ثم سلوا لي الوسيلة فإنها منزلة في الجنة لا تنبغي إلا لعبد من عباد الله وأرجو أن أكون أنا هو ومن سأل لي الوسيلة حلت عليه الشفاعة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ قال محمد عبد الرحمن بن جبير هذا قرشي مصري مدني وعبد الرحمن بن جبير بن نفير شامي ‏.‏",
      "text_en": " Narrated 'Abdullah bin 'Amr:                     that the Messenger of Allah (ﷺ) said: \"If you hear the Muadh-dhin then say as he says. Then send Salat upon me, because whoever sends Salat upon me, Allah will send Salat upon him ten times due to it. Then ask Allah that He gives me Al-Wasilah, because it is a place in Paradise which is not for anyone except for a slave from the slaves of Allah, and I hope that I am him. And whoever asks that I have Al-Wasilah, then (my) intercession will be made lawful for him.\"",
      "chain": [
        "34188",
        "23033",
        "26010",
        "10872",
        "10865",
        "29"
      ]
    },
    {
      "hadith_no": "3981",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن إسماعيل، حدثنا محمد بن بشار، حدثنا ابن أبي عدي، عن هشام بن حسان، عن عكرمة، عن ابن عباس، قال أنزل على رسول الله صلى الله عليه وسلم وهو ابن أربعين فأقام بمكة ثلاث عشرة وبالمدينة عشرا وتوفي وهو ابن ثلاث وستين ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     \"The Messenger of Allah (ﷺ) received Revelation when he was forty years old. So he stayed in Makkah for thirteen years and in Al-Madinah for ten. And he died when he was sixty-three years old.\"",
      "chain": [
        "34188",
        "30160",
        "20276",
        "11311",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "3988",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن إسماعيل، حدثنا محمد بن سعيد، حدثنا شريك، عن سماك، عن أبي ظبيان، عن ابن عباس، قال جاء أعرابي إلى رسول الله صلى الله عليه وسلم فقال بم أعرف أنك نبي قال ‏\"‏ إن دعوت هذا العذق من هذه النخلة أتشهد أني رسول الله ‏\"‏ ‏.‏ فدعاه رسول الله صلى الله عليه وسلم فجعل ينزل من النخلة حتى سقط إلى النبي صلى الله عليه وسلم ثم قال ‏\"‏ ارجع ‏\"‏ ‏.‏ فعاد فأسلم الأعرابي ‏.‏ قال أبو عيسى هذا حديث حسن غريب صحيح ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     \"A Bedouin came to the Messenger of Allah (ﷺ) and said: 'How shall I know that you are a Prophet?' He said: 'If I were to call this date cluster from this palm tree, would you bear witness that I am the Messenger of Allah?' So the Messenger of Allah (ﷺ) called it and they started to fall from the tree, until they fell towards the Prophet (ﷺ), then he said: 'Go back,' and it went back. So the Bedouin accepted Islam.\"",
      "chain": [
        "34188",
        "20587",
        "10770",
        "19301",
        "17"
      ]
    },
    {
      "hadith_no": "3997",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن إسماعيل، حدثنا أبو نعيم، حدثنا المسعودي، عن عثمان بن مسلم بن هرمز، عن نافع بن جبير بن مطعم، عن علي، قال لم يكن رسول الله صلى الله عليه وسلم بالطويل ولا بالقصير شثن الكفين والقدمين ضخم الرأس ضخم الكراديس طويل المسربة إذا مشى تكفأ تكفؤا كأنما انحط من صبب لم أر قبله ولا بعده مثله ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated 'Ali:                     \"The Prophet (ﷺ) was not tall nor was he short, his hands and feet were thick, his head was large, he was big-boned, he had a long Masrubah (the line of hair from the chest to the navel), and whenever he walked, he leaned forward as if he was going down a decline. I have not seen anyone before him nor after him that resembled him (ﷺ).\"",
      "chain": [
        "34188",
        "20348",
        "20724",
        "11059",
        "5"
      ]
    },
    {
      "hadith_no": "4066",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن إسماعيل، حدثنا الحسن بن واقع الرملي، حدثنا ضمرة بن ربيعة، عن عبد الله بن شوذب، عن عبد الله بن القاسم، عن كثير، مولى عبد الرحمن بن سمرة عن عبد الرحمن بن سمرة، قال جاء عثمان إلى النبي صلى الله عليه وسلم بألف دينار - قال الحسن بن واقع وكان في موضع آخر من كتابي في كمه حين جهز جيش العسرة فنثرها في حجره ‏.‏ قال عبد الرحمن فرأيت النبي صلى الله عليه وسلم يقلبها في حجره ويقول ‏\"‏ ما ضر عثمان ما عمل بعد اليوم ‏\"‏ ‏.‏ مرتين ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه ‏.‏",
      "text_en": " Narrated 'Abdur-Rahman bin Samurah:                     that 'Uthman went to the Prophet (ﷺ) with one-thousand Dinar\" - Al-Hasan bin Waqi (one of the narrators) said: \"And in another place in my book: 'In his garment when the 'army of distress' was being prepared. So he poured them into his lap.'\" - 'Abdur-Rahman said: \"So I saw the Prophet (ﷺ) turning them over in his lap, saying: 'Whatever 'Uthman does after today will not harm him,' two times.\"",
      "chain": [
        "34188",
        "20738",
        "20715",
        "18563",
        "955"
      ]
    },
    {
      "hadith_no": "4081",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا سفيان بن وكيع، حدثنا أبي، عن إسرائيل، وحدثنا محمد بن إسماعيل، حدثنا عبيد الله بن موسى، عن إسرائيل، عن أبي إسحاق، عن البراء بن عازب، أن النبي صلى الله عليه وسلم قال لعلي بن أبي طالب ‏\"‏ أنت مني وأنا منك ‏\"‏ ‏.‏ وفي الحديث قصة ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Al-Bara bin 'Azib:                     that the Prophet (ﷺ) said to 'Ali bin Abi Talib: \"You are from me, and I am from you.\"And there is a story along with this Hadith.",
      "chain": [
        "35047",
        "20311",
        "34188",
        "20340",
        "20311",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "4132",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن إسماعيل، حدثنا عبيد الله بن موسى، عن إسرائيل، عن أبي إسحاق، عن البراء بن عازب، أن النبي صلى الله عليه وسلم قال لجعفر بن أبي طالب ‏\"‏ أشبهت خلقي وخلقي ‏\"‏ ‏.‏ وفي الحديث قصة ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Al-Bara bin 'Azib:                     that the Prophet (ﷺ) said to Ja'far bin Abi Talib: \"You share similarity with me in appearance and in character.\"",
      "chain": [
        "34188",
        "20340",
        "20311",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "4271",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن إسماعيل، حدثنا عبد الله بن محمد، حدثنا عبيد الله بن موسى، والحسين بن محمد، عن إسرائيل، عن السدي، عن الوليد بن أبي هشام، عن زيد بن زائدة، عن عبد الله بن مسعود، رضي الله عنه عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يبلغني أحد عن أحد شيئا ‏\"‏ ‏.‏ وقد روي هذا الحديث عن عبد الله بن مسعود عن النبي صلى الله عليه وسلم شيئا من هذا من غير هذا الوجه ‏.‏",
      "text_en": " Narrated 'Abdullah bin Mas'ud:                     that the Prophet (ﷺ) said: \"No one should convey to me anything regarding anyone.\"",
      "chain": [
        "34188",
        "30351",
        "20340",
        "20311",
        "10743",
        "10622",
        "18322"
      ]
    },
    {
      "hadith_no": "4327",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن إسماعيل، حدثنا أحمد بن خالد الحمصي، حدثنا محمد بن إسحاق، عن سعيد بن أبي سعيد المقبري، عن أبيه، عن أبي هريرة، قال أهدى رجل من بني فزارة إلى النبي صلى الله عليه وسلم ناقة من إبله التي كانوا أصابوا بالغابة فعوضه منها بعض العوض فتسخطه فسمعت رسول الله صلى الله عليه وسلم على هذا المنبر يقول ‏\"‏ إن رجالا من العرب يهدي أحدهم الهدية فأعوضه منها بقدر ما عندي ثم يتسخطه فيظل يتسخط فيه على وايم الله لا أقبل بعد مقامي هذا من رجل من العرب هدية إلا من قرشي أو أنصاري أو ثقفي أو دوسي ‏\"‏ ‏.‏ قال هذا حديث حسن وهو أصح من حديث يزيد بن هارون عن أيوب ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     \"A man from Banu Fazarah gave a gift to the Prophet (ﷺ) of she-camel from his camels which they had taken at Al-Ghabah. So he reciprocated for it with something in return, but he was upset with it. So I heard the Messenger of Allah (ﷺ), upon [this] Minbar saying: 'Indeed one of the men from the Bedouins gave me a gift so I reciprocated for it to the extent of what I had. Then he became very upset with me. By Allah! After my experience with this Bedouin man, I shall not accept a gift from anyone except from a Quraishi, Ansari, Thaqafi, or Dawsi.'\"",
      "chain": [
        "34188",
        "11107",
        "11168",
        "11212",
        "13"
      ]
    },
    {
      "hadith_no": "489",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Salah - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "أخبرنا محمد بن إسماعيل بن إبراهيم، قال حدثنا إسحاق بن يوسف الأزرق، عن زكريا بن أبي زائدة، عن أبي إسحاق، عن البراء بن عازب، قال قدم رسول الله صلى الله عليه وسلم المدينة فصلى نحو بيت المقدس ستة عشر شهرا ثم إنه وجه إلى الكعبة فمر رجل قد كان صلى مع النبي صلى الله عليه وسلم على قوم من الأنصار فقال أشهد أن رسول الله صلى الله عليه وسلم قد وجه إلى الكعبة ‏.‏ فانحرفوا إلى الكعبة ‏.‏",
      "text_en": " It was narrated that Al-Bara bin 'Azib said:                      \"The Messenger of Allah (ﷺ) came to Al-Madinah and prayed toward Bait Al-Maqdis for sixteen months, then he was commanded to face towards the Ka'bah. A man who had prayed with the Prophet (ﷺ) passed by some of the Ansar and said: 'I bear witness that the Messenger of Allah (ﷺ) has been commanded to face towards the Ka'bah' so they turned to face the Ka'bah.\"",
      "chain": [
        "34188",
        "20411",
        "11338",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "633",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Adhan (The Call to Prayer) - كتاب الأذان",
      "chapter_no": "7",
      "text_ar": "أخبرنا محمد بن إسماعيل، وإبراهيم بن الحسن، قالا حدثنا حجاج، قال قال ابن جريج أخبرني نافع، عن عبد الله بن عمر، أنه كان يقول كان المسلمون حين قدموا المدينة يجتمعون فيتحينون الصلاة وليس ينادي بها أحد فتكلموا يوما في ذلك فقال بعضهم اتخذوا ناقوسا مثل ناقوس النصارى ‏.‏ وقال بعضهم بل قرنا مثل قرن اليهود ‏.‏ فقال عمر رضى الله عنه أولا تبعثون رجلا ينادي بالصلاة ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ يا بلال قم فناد بالصلاة ‏\"‏ ‏.‏",
      "text_en": " Nafi' narrated that 'Abdullah bin 'Umar used to say:                      \"When the Muslims arrived in Al-Madinah they used to gather and try to figure out the time for prayer, and no one gave the call to prayer. One day they spoke about that; some of them said: 'Let us use a bell like the Christians do;' others said, 'No, a horn like the Jews have.' 'Umar, may ,Allah be pleased with him, said: 'Why don't you send a man to announce the time of prayer?' The Messenger of Allah (ﷺ) said: 'O Bilal, get up and give the call to prayer.'\"",
      "chain": [
        "34188",
        "38070",
        "20219",
        "11070",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "742",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Qiblah - كتاب القبلة",
      "chapter_no": "9",
      "text_ar": "أخبرنا محمد بن إسماعيل بن إبراهيم، قال حدثنا إسحاق بن يوسف الأزرق، عن زكريا بن أبي زائدة، عن أبي إسحاق، عن البراء بن عازب، قال قدم رسول الله صلى الله عليه وسلم المدينة فصلى نحو بيت المقدس ستة عشر شهرا ثم وجه إلى الكعبة فمر رجل قد كان صلى مع النبي صلى الله عليه وسلم على قوم من الأنصار فقال أشهد أن رسول الله صلى الله عليه وسلم قد وجه إلى الكعبة ‏.‏ فانحرفوا إلى الكعبة ‏.‏",
      "text_en": " Narrated Al Bara bin Azib:                     Al Bara bin Azib said: The messenger of Allah (peace be upon him) came to Al-Madinah and prayed toward Bait-al-Maqdis for sixteen months, then he was commanded to pray toward the Ka'bah. A man who had prayed with the prophet (peace be upon him)passed by some of the Ansar and said: \"I bear witness that the messenger of Allah (peace be upon him) has been commanded to face toward the Ka'bah. So they turned to face the Ka'bah\".",
      "chain": [
        "34188",
        "20411",
        "11338",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "804",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا محمد بن إسماعيل بن إبراهيم، قال حدثنا حجاج، قال قال ابن جريج أخبرني زياد، أن قزعة، مولى لعبد قيس أخبره أنه، سمع عكرمة، مولى ابن عباس قال قال ابن عباس صليت إلى جنب النبي صلى الله عليه وسلم وعائشة خلفنا تصلي معنا وأنا إلى جنب النبي صلى الله عليه وسلم أصلي معه ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                      \"I prayed beside the Prophet (ﷺ) and Ayesha was behind us praying with us, and I was beside the Prophet (ﷺ) praying with him.\"",
      "chain": [
        "34188",
        "20219",
        "11070",
        "11339",
        "11023"
      ]
    },
    {
      "hadith_no": "841",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا محمد بن إسماعيل بن إبراهيم، قال حدثنا حجاج، قال ابن جريج أخبرني زياد، أن قزعة، مولى لعبد القيس أخبره أنه، سمع عكرمة، قال قال ابن عباس صليت إلى جنب النبي صلى الله عليه وسلم وعائشة خلفنا تصلي معنا وأنا إلى جنب النبي صلى الله عليه وسلم أصلي معه ‏.‏",
      "text_en": " Ibn 'Abbas said:                      \"I prayed beside the Prophet (ﷺ) and Aisha was behind us praying with us, and I was beside the Prophet (ﷺ) praying with him.\"",
      "chain": [
        "34188",
        "20219",
        "11070",
        "11339",
        "11023"
      ]
    },
    {
      "hadith_no": "948",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا محمد بن إسماعيل بن إبراهيم، قال حدثنا يزيد، قال أنبأنا سليمان التيمي، عن سيار، - يعني ابن سلامة - عن أبي برزة، أن رسول الله صلى الله عليه وسلم كان يقرأ في صلاة الغداة بالستين إلى المائة ‏.‏",
      "text_en": " It was narrated from Abu Barzah that:                     The Messenger of Allah (ﷺ) used to recite between sixty and one hundred verses in Al-Ghadah (Subh) prayer.",
      "chain": [
        "34188",
        "20472",
        "11289",
        "11290",
        "227"
      ]
    },
    {
      "hadith_no": "1067",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرني محمد بن إسماعيل بن إبراهيم، قال حدثنا يحيى بن أبي بكير، قال حدثنا إبراهيم بن نافع، عن وهب بن ميناس العدني، عن سعيد بن جبير، عن ابن عباس، أن النبي صلى الله عليه وسلم كان إذا أراد السجود بعد الركعة يقول ‏\"‏ اللهم ربنا ولك الحمد ملء السموات وملء الأرض وملء ما شئت من شىء بعد ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that:                     When the Prophet (ﷺ) wanted to prostrate after bowing, he would say: \"Allahumma, Rabbana wa lakal-hamd, mil'as-samawati wa mil'al-ardi wa mil'ama shi'ta min shai'in ba'd ( O Allah, our Lord, to You be the Praise, filling the heavens, filling the Earth, and filling whatever else You will.)\"",
      "chain": [
        "34188",
        "20365",
        "20189",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "1250",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا محمد بن إسماعيل بن إبراهيم، قال حدثنا حجاج، قال ابن جريج أخبرني عبد الله بن مسافع، أن مصعب بن شيبة، أخبره عن عتبة بن محمد بن الحارث، عن عبد الله بن جعفر، أن النبي صلى الله عليه وسلم قال ‏\"‏ من شك في صلاته فليسجد سجدتين بعد ما يسلم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin Ja'far that :                     The Messenger of Allah (ﷺ) said: \"Whoever has doubt during his prayer, let him prostrate twice after he said the taslim.\"",
      "chain": [
        "34188",
        "20219",
        "11070",
        "10658",
        "108"
      ]
    },
    {
      "hadith_no": "1316",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا محمد بن إسماعيل بن إبراهيم، قال حدثنا سليمان، - يعني ابن داود الهاشمي - قال حدثنا إبراهيم، - وهو ابن سعد - قال حدثني عبد الله بن جعفر، - وهو ابن المسور المخرمي - عن إسماعيل بن محمد، قال حدثني عامر بن سعد، عن أبيه، أن رسول الله صلى الله عليه وسلم كان يسلم عن يمينه وعن يساره ‏.‏",
      "text_en": " 'Amr bin Sa'd narrated from his father:                     That the Messenger of Allah (ﷺ) used to say the taslim to his right and to his left.",
      "chain": [
        "34188",
        "30584",
        "20150",
        "10554",
        "9"
      ]
    },
    {
      "hadith_no": "1603",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا محمد بن إسماعيل أبو بكر، قال حدثنا عبد الله بن محمد بن أسماء، قال حدثنا جويرية، عن مالك، قال قال الزهري أخبرني أبو سلمة بن عبد الرحمن، وحميد بن عبد الرحمن، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من قام رمضان إيمانا واحتسابا غفر له ما تقدم من ذنبه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     The Messenger of Allah (ﷺ) said: \"Whoever prays Qiyam during Ramadan out of faith and in the hope of reward, he will be forgiven his previous sins.\"",
      "chain": [
        "34188",
        "30144",
        "20216",
        "20001",
        "11013",
        "10567",
        "10561",
        "13"
      ]
    },
    {
      "hadith_no": "1676",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرني محمد بن إسماعيل بن إبراهيم، عن أبي نعيم، عن سفيان، عن أبي إسحاق، عن عاصم بن ضمرة، عن علي، رضى الله عنه قال الوتر ليس بحتم كهيئة المكتوبة ولكنه سنة سنها رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated that Ali, may Allah (SWT) be pleased with him, said:                     \"Witr is not essential like the obligatory prayers, but it is the sunnah of the Messenger of Allah (ﷺ).\"",
      "chain": [
        "34188",
        "20348",
        "20012",
        "11049",
        "19871",
        "5"
      ]
    },
    {
      "hadith_no": "1716",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا محمد بن إسماعيل بن إبراهيم، عن يزيد، قال حدثنا سفيان بن الحسين، عن الحكم، عن مقسم، قال الوتر سبع فلا أقل من خمس فذكرت ذلك لإبراهيم فقال عمن ذكره قلت لا أدري ‏.‏ قال الحكم فحججت فلقيت مقسما فقلت له عمن قال عن الثقة عن عائشة وعن ميمونة ‏.‏",
      "text_en": " Sufyan bin Al-Husain narrated from Al-Hakam that Miqsam said:                     \"Witr is seven and no less than five.\" I mentioned that to Ibrahim and he said: \"From whom did he quote that?\" I said: \"I do not know.\" Al-Hakam said: \"Then I performed Hajj and I met Miqsam and said to him: 'From whom (did you narrate that)?' He said: 'From the trustworthy one, from Aishah and from Maimunah.'\"",
      "chain": [
        "34188",
        "20472",
        "11069",
        "11725",
        "53"
      ]
    },
    {
      "hadith_no": "1752",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا محمد بن إسماعيل بن إبراهيم، عن أبي نعيم، عن سفيان، عن زبيد، عن ذر، عن سعيد بن عبد الرحمن بن أبزى، عن أبيه، قال كان رسول الله صلى الله عليه وسلم يوتر ب ‏{‏ سبح اسم ربك الأعلى ‏}‏ و ‏{‏ قل يا أيها الكافرون ‏}‏ و ‏{‏ قل هو الله أحد ‏}‏ فإذا أراد أن ينصرف قال ‏\"‏ سبحان الملك القدوس ‏\"‏ ‏.‏ ثلاثا يرفع بها صوته ‏.‏ قال أبو عبد الرحمن أبو نعيم أثبت عندنا من محمد بن عبيد ومن قاسم بن يزيد وأثبت أصحاب سفيان عندنا والله أعلم يحيى بن سعيد القطان ثم عبد الله بن المبارك ثم وكيع بن الجراح ثم عبد الرحمن بن مهدي ثم أبو نعيم ثم الأسود في هذا الحديث ‏.‏ ورواه جرير بن حازم عن زبيد فقال يمد صوته في الثالثة ويرفع ‏.‏",
      "text_en": " It was narrated from Ibn Abdur-Rahman bin Abza that his father said:                     \"The Messenger of Allah (ﷺ) used to recite in witr: Glorify the Name of Your Lord, the Most High;' and \"Say: O you disbelievers!'; and 'Say: He is Allah, (the) One.\" And after he had said the salam, he would say: Subhanal-Malikil-Quddus (Glory be to the Sovereign, the Most Holy) three times, raising his voice with it.\"",
      "chain": [
        "34188",
        "20348",
        "20012",
        "11335",
        "11423",
        "11346",
        "4046"
      ]
    },
    {
      "hadith_no": "1755",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا محمد بن إسماعيل بن إبراهيم، عن أبي عامر، عن هشام، عن قتادة، عن عزرة، عن سعيد بن عبد الرحمن بن أبزى، أن النبي صلى الله عليه وسلم كان يوتر ‏.‏ وساق الحديث ‏.‏",
      "text_en": " It was narrated from Sa'eed bin Abdur-Rahman bin Abza that:                     The Prophet (ﷺ) used to recite in witr and he quoted the same hadith.",
      "chain": [
        "34188",
        "20295",
        "11019",
        "10799",
        "11346"
      ]
    },
    {
      "hadith_no": "1804",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا محمد بن إسماعيل بن إبراهيم، قال حدثنا يزيد بن هارون، قال أنبأنا إسماعيل، عن المسيب بن رافع، عن عنبسة بن أبي سفيان، عن أم حبيبة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من صلى في اليوم والليلة ثنتى عشرة ركعة بني له بيت في الجنة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Umm Habibah that:                     The Prophet (ﷺ) said: \"Whoever prays twelve rak'ahs during the day and night, a house will be built for him in Paradise.\"",
      "chain": [
        "34188",
        "20472",
        "11418",
        "11394",
        "846",
        "59"
      ]
    },
    {
      "hadith_no": "1876",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا محمد بن إسماعيل بن إبراهيم ابن علية، وعبد الرحمن بن محمد، قالا حدثنا إسحاق، - وهو الأزرق - عن عوف، عن محمد، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ ما من مسلمين يموت بينهما ثلاثة أولاد لم يبلغوا الحنث إلا أدخلهما الله بفضل رحمته إياهم الجنة ‏\"‏ ‏.‏ قال ‏\"‏ يقال لهم ادخلوا الجنة فيقولون حتى يدخل آباؤنا فيقال ادخلوا الجنة أنتم وآباؤكم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Prophet said:                     \"There are no two Muslims, three of whose children die before reaching puberty, but Allah will admit them to Paradise by virtue of His mercy toward them. It will be said to them: 'Enter Paradise.' They will say: 'Not until our parents enter.' So it will be said: 'Enter Paradise, you and your parents.\"'",
      "chain": [
        "34188",
        "20411",
        "11298",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "2096",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن إسماعيل، قال حدثني حفص بن عمر بن الحارث، قال حدثنا حماد، قال حدثنا معمر، والنعمان بن راشد، عن الزهري، عن عروة، عن عائشة، قالت ما لعن رسول الله صلى الله عليه وسلم من لعنة تذكر وكان إذا كان قريب عهد بجبريل عليه السلام يدارسه كان أجود بالخير من الريح المرسلة ‏.‏ قال أبو عبد الرحمن هذا خطأ والصواب حديث يونس بن يزيد وأدخل هذا حديثا في حديث ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"Hardly anyone every remembered the Messenger of Allah cursing anyone, and if he had recently met with Jibril and studied the Quran with him, he was more generous in doing good than the blowing with. \"(Sahih)Abu 'Abdur-Rehman (An-Nasai) said; This is a mistake, and what is correct is the (previous) narration of Yunus bin Yazid, he put this narration in the Hadith.",
      "chain": [
        "34188",
        "30329",
        "20022",
        "20115",
        "10971",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2201",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرني محمد بن إسماعيل، قال حدثنا عبد الله بن محمد بن أسماء، قال حدثنا جويرية، عن مالك، قال الزهري أخبرني أبو سلمة بن عبد الرحمن، وحميد بن عبد الرحمن، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من قام رمضان إيمانا واحتسابا غفر له ما تقدم من ذنبه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah said:                     \"Whoever spends the night of Ramadan in prayer (Qiyam) out of faith and in the hope of reward, he will be forgiven his previous sins.\" '",
      "chain": [
        "34188",
        "30144",
        "20216",
        "20001",
        "11013",
        "10567",
        "10561",
        "13"
      ]
    },
    {
      "hadith_no": "2304",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن إسماعيل بن إبراهيم، عن محمد بن بشر، عن هشام بن عروة، عن أبيه، عن حمزة بن عمرو الأسلمي، أنه سأل رسول الله صلى الله عليه وسلم أصوم في السفر قال ‏\"‏ إن شئت فصم وإن شئت فأفطر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Hamzah bin 'Amr Al-Aslami that he asked the Messenger of Allah:                     \"Should I fast while traveling?\" He said: \"If you wish then fast, and if you wish then do not fast.\"",
      "chain": [
        "34188",
        "20352",
        "11065",
        "10511",
        "4123"
      ]
    },
    {
      "hadith_no": "2317",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن إسماعيل بن إبراهيم، قال حدثنا يزيد، قال أنبأنا ورقاء، عن عمرو بن دينار، عن عطاء، عن ابن عباس، في قوله عز وجل ‏{‏ وعلى الذين يطيقونه فدية طعام مسكين ‏}‏ يطيقونه يكلفونه فدية طعام مسكين واحد ‏{‏ فمن تطوع خيرا ‏}‏ طعام مسكين آخر ليست بمنسوخة ‏{‏ فهو خير له وأن تصوموا خير لكم ‏}‏ لا يرخص في هذا إلا للذي لا يطيق الصيام أو مريض لا يشفى ‏.‏",
      "text_en": " It was narrated from 'Ata from Ibn 'Abbas:                     concerning this verse \"And as for those who can fast with difficulty, (a choice either to fast or) to feed a Miskin (poor person) (for every day).\" That for those who can fast with difficulty means they find it hard; to feed a Miskin means feeding one poor person for each day. But whoever does good of his own accord means feeding another poor person. This is not abrogated, and it is bette for him. And: that \"you fast is better for you\" means there is no concession regarding this except for those who are not able to fast, or who are incurably sick.",
      "chain": [
        "34188",
        "20472",
        "11081",
        "11029"
      ]
    },
    {
      "hadith_no": "2396",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن إسماعيل بن إبراهيم، قال حدثنا يزيد، قال حدثنا حماد، ح وأخبرني زكريا بن يحيى، قال حدثنا عبد الأعلى، قال حدثنا حماد، عن ثابت، عن شعيب بن عبد الله بن عمرو، عن أبيه، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ صم يوما ولك أجر عشرة ‏\"‏ ‏.‏ فقلت زدني ‏.‏ فقال ‏\"‏ صم يومين ولك أجر تسعة ‏\"‏ ‏.‏ قلت زدني ‏.‏ قال ‏\"‏ صم ثلاثة أيام ولك أجر ثمانية ‏\"‏ ‏.‏ قال ثابت فذكرت ذلك لمطرف فقال ما أراه إلا يزداد في العمل وينقص من الأجر واللفظ لمحمد ‏.‏",
      "text_en": " It was narrated from Shuaib bin 'Abdullah bin 'Amr that his father said:                     \"The Messenger of Allah said to me: 'Fast one day and you will have the reward of ten.' I said: 'Let me fast more.' He said: 'Fast two days and you will have the reward of nine.' I said: 'Let me fast more than that.' He said: 'Fast three days and you will have the reward of eight.\" (One of the narrators) Thabit said: \"I mentioned that to Mutarrif and he said: 'I only see that he is making more effort for less reward.'\"",
      "chain": [
        "34188",
        "20472",
        "20022",
        "20246",
        "20022",
        "11269"
      ]
    },
    {
      "hadith_no": "2429",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن إسماعيل بن إبراهيم، قال حدثنا يعلى، عن طلحة بن يحيى، عن موسى بن طلحة، قال أتي النبي صلى الله عليه وسلم بأرنب قد شواها رجل فلما قدمها إليه قال يا رسول الله إني قد رأيت بها دما فتركها رسول الله صلى الله عليه وسلم فلم يأكلها وقال لمن عنده ‏\"‏ كلوا فإني لو اشتهيتها أكلتها ‏\"‏ ‏.‏ ورجل جالس فقال رسول الله صلى الله عليه وسلم ‏\"‏ ادن فكل مع القوم ‏\"‏ ‏.‏ فقال يا رسول الله إني صائم ‏.‏ قال ‏\"‏ فهلا صمت البيض ‏\"‏ ‏.‏ قال وما هن قال ‏\"‏ ثلاث عشرة وأربع عشرة وخمس عشرة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Musa bin Talhah said:                     \"A rabbit that a man had grilled was brought to the Prophet and when he offered it to him he said: 'O Messenger of Allah, I saw some blood on it.\" The Messenger of Allah did not eat it, but he said to those who were with him: \"Eat; if I felt like it, I would have eaten it.' There was a man sitting, and the Messenger of Allah said: 'Come and eat with the people.' He said: 'O Messenger of Allah, I am fasting.' He said: 'Why don't you fast Al-Bid?' He said: 'What are they?' He said: \"The thirteenth, fourteenth and fifteenth?\"'",
      "chain": [
        "34188",
        "20372",
        "11863",
        "579"
      ]
    },
    {
      "hadith_no": "2675",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرني محمد بن إسماعيل بن إبراهيم، وعمرو بن علي، قالا حدثنا يزيد، وهو ابن هارون قال حدثنا يحيى، - وهو ابن سعيد الأنصاري - عن عمر بن نافع، عن أبيه، عن ابن عمر، أن رجلا، سأل رسول الله صلى الله عليه وسلم ما نلبس من الثياب إذا أحرمنا قال ‏\"‏ لا تلبسوا القميص ولا السراويلات ولا العمائم ولا البرانس ولا الخفاف إلا أن يكون أحد ليست له نعلان فليلبس الخفين أسفل من الكعبين ولا تلبسوا من الثياب شيئا مسه ورس ولا زعفران ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that:                     a man asked the Messenger of Allah what garments we should wear when we enter Ihram. He said: \"Do not wear shirts, or pants, or 'Imamahs, or burnouses, or Khuffs unless someone does not have any sandals, in which case he should wear Khuffs that come beneath the ankles. And do not wear any garment that has been touched by (dyed with) Wars or saffron.",
      "chain": [
        "34188",
        "30153",
        "20472",
        "11062",
        "11713",
        "18"
      ]
    },
    {
      "hadith_no": "2710",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرني محمد بن إسماعيل بن إبراهيم، قال حدثنا وهب بن جرير، قال حدثنا أبي قال، سمعت قيس بن سعد، يحدث عن عطاء، عن صفوان بن يعلى، عن أبيه، قال أتى رسول الله صلى الله عليه وسلم رجل وهو بالجعرانة وعليه جبة وهو مصفر لحيته ورأسه فقال يا رسول الله إني أحرمت بعمرة وأنا كما ترى فقال ‏\"‏ انزع عنك الجبة واغسل عنك الصفرة وما كنت صانعا في حجتك فاصنعه في عمرتك ‏\"‏ ‏.‏",
      "text_en": " It was narrated f rom Safwan bin Ya'la that his father saide:                     \"A man came to the Messenger of Allah when he was in Al-Jirranah wearing a Jubnah, and having applied Khauq to his beard and head. He said: 'O Messenger of Allah! I have entered Ihram for 'Umrah and I am as you see.' He said: 'Take off the Jubbah and wash off the perfume, and whatever you would do for Hajj, do it for 'Umrah.'''",
      "chain": [
        "34188",
        "20298",
        "11272",
        "172",
        "11029",
        "11248",
        "897"
      ]
    },
    {
      "hadith_no": "2718",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن إسماعيل الطبراني أبو بكر، قال حدثنا أحمد بن محمد بن حنبل، قال حدثنا يحيى بن سعيد، قال حدثنا شعبة، حدثني منصور، وسليمان، عن إبراهيم، عن الأسود، عن عائشة، قالت خرجنا مع رسول الله صلى الله عليه وسلم لا نرى إلا أنه الحج ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                      \"We set out with the Messenger of Allah (ﷺ) thinking that it was for nothing other than Hajj.\"",
      "chain": [
        "34188",
        "30007",
        "20031",
        "20020",
        "11067",
        "11005",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "2759",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا عمران بن يزيد، قال أنبأنا شعيب، قال أنبأنا ابن جريج، قال أخبرني صالح بن كيسان، ح وأخبرني محمد بن إسماعيل بن إبراهيم، قال حدثنا إسحاق يعني ابن يوسف، عن ابن جريج، عن صالح بن كيسان، عن نافع، عن ابن عمر، أنه كان يخبر أن النبي صلى الله عليه وسلم أهل حين استوت به راحلته ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar:                     That he used to narrate that the Prophet began the Talbiyah when his mount stood up with him.",
      "chain": [
        "20428",
        "11070",
        "11176",
        "34188",
        "20411",
        "11070",
        "11176",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2997",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن إسماعيل بن إبراهيم، وعبد الرحمن بن محمد بن سلام، قالا حدثنا إسحاق الأزرق، عن سفيان الثوري، عن عبد العزيز بن رفيع، قال سألت أنس بن مالك فقلت أخبرني بشىء، عقلته عن رسول الله صلى الله عليه وسلم أين صلى الظهر يوم التروية قال بمنى ‏.‏ فقلت أين صلى العصر يوم النفر قال بالأبطح ‏.‏",
      "text_en": " It was narrated that Abdul-Aziz bin Rafi said:                     \"I asked anas bin Malik: 'Tell me of something that you learned from the Messenger of Allah; where did he pray Zuhr on the day of At-Tarwiyah?' He said: 'In Mina.' I said: 'Where did he pray Asr on the day of An-Nafr?' He said: 'In Al-Abtah.'\"",
      "chain": [
        "34188",
        "36587",
        "20411",
        "20012",
        "11257",
        "19"
      ]
    },
    {
      "hadith_no": "3096",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا هارون بن عبد الله، ومحمد بن إسماعيل بن إبراهيم، قالا حدثنا يزيد، قال أنبأنا حماد بن سلمة، عن حميد، عن أنس، عن النبي صلى الله عليه وسلم قال ‏\"‏ جاهدوا المشركين بأموالكم وأيديكم وألسنتكم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Anas that the Prophet (ﷺ) said:                      \"Strive against the idolators with your wealth, your hands and your tongues.\" [1][1] Its chain has defects while its meaning is supported by other chains.",
      "chain": [
        "30524",
        "34188",
        "20472",
        "20021",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "3174",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "حدثني محمد بن إسماعيل بن إبراهيم، قال حدثنا يزيد، قال أنبأنا هشيم، قال حدثنا سيار أبو الحكم، عن جبر بن عبيدة، عن أبي هريرة، قال وعدنا رسول الله صلى الله عليه وسلم غزوة الهند فإن أدركتها أنفق فيها نفسي ومالي وإن قتلت كنت أفضل الشهداء وإن رجعت فأنا أبو هريرة المحرر ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                      \"The Messenger of Allah (ﷺ) promised that we would invade India. If I live to see that I will sacrifice myself and my wealth. If I am killed, I will be one of the best of the martyrs, and if I come back, I will be Abu Hurairah Al-Muharrar.\"",
      "chain": [
        "34188",
        "20472",
        "20468",
        "11429",
        "18115",
        "13"
      ]
    },
    {
      "hadith_no": "3229",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا محمد بن إسماعيل بن إبراهيم، قال حدثنا يزيد، قال حدثنا حماد بن سلمة، وغيره، عن هارون بن رئاب، عن عبد الله بن عبيد بن عمير، وعبد الكريم، عن عبد الله بن عبيد بن عمير، عن ابن عباس، - عبد الكريم يرفعه إلى ابن عباس وهارون لم يرفعه - قالا جاء رجل إلى رسول الله صلى الله عليه وسلم فقال إن عندي امرأة هي من أحب الناس إلى وهي لا تمنع يد لامس ‏.‏ قال ‏\"‏ طلقها ‏\"‏ ‏.‏ قال لا أصبر عنها ‏.‏ قال ‏\"‏ استمتع بها ‏\"‏ ‏.‏ قال أبو عبد الرحمن هذا الحديث ليس بثابت وعبد الكريم ليس بالقوي وهارون بن رئاب أثبت منه وقد أرسل الحديث وهارون ثقة وحديثه أولى بالصواب من حديث عبد الكريم ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     It was narrated from Ibn 'Abbas that a man came to the Messenger of Allah and said: \"I have a wife who is one of the most beloved of the people to me, but she does not object if anyone touches her.\" He said: \"Divorce her.\" He said: \"I cannot do without her.\" He said: \"Then stay with her as much as you need to.\"",
      "chain": [
        "34188",
        "20472",
        "20021",
        "10974",
        "10643",
        "18655",
        "10643"
      ]
    },
    {
      "hadith_no": "3254",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا محمد بن إسماعيل بن إبراهيم، قال حدثنا يزيد، عن حماد بن سلمة، عن ثابت البناني، حدثني ابن عمر بن أبي سلمة، عن أبيه، عن أم سلمة، لما انقضت عدتها بعث إليها أبو بكر يخطبها عليه فلم تزوجه فبعث إليها رسول الله صلى الله عليه وسلم عمر بن الخطاب يخطبها عليه فقالت أخبر رسول الله صلى الله عليه وسلم أني امرأة غيرى وأني امرأة مصبية وليس أحد من أوليائي شاهد ‏.‏ فأتى رسول الله صلى الله عليه وسلم فذكر ذلك له فقال ‏\"‏ ارجع إليها فقل لها أما قولك إني امرأة غيرى فسأدعو الله لك فيذهب غيرتك وأما قولك إني امرأة مصبية فستكفين صبيانك وأما قولك أن ليس أحد من أوليائي شاهد فليس أحد من أوليائك شاهد ولا غائب يكره ذلك ‏\"‏ ‏.‏ فقالت لابنها يا عمر قم فزوج رسول الله صلى الله عليه وسلم فزوجه ‏.‏ مختصر ‏.‏",
      "text_en": " It was narrated from Umm Salamah, that when her 'Iddah had ended, Abu Bakr sent word to her proposing marriage to her, but she did not marry him. Then the Messenger of Allah sent 'Umar bin Al-Khattab with a proposal of marriage. She said:                      \"Tell the Messenger of Allah that I am a jealous woman and that I have sons, and none of my guardians are present.\" He went to the Messenger of Allah and told him that. He said: \"Go back to her and tell her: As for your saying that you are a jealous woman, I will pray to Allah for you to take away your jealousy. As for your saying that you have sons, your sons will be taken care of. And as for your saying that none of your guardians are present, none of your guardians, present or absent, would object to that.\" She said to her son: \"O 'Umar, get up and perform the marriage to the Messenger of Allah,\" so he performed the marriage.",
      "chain": [
        "34188",
        "20472",
        "20021",
        "11269"
      ]
    },
    {
      "hadith_no": "3392",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرني محمد بن إسماعيل بن إبراهيم، وعبد الله بن محمد بن تميم، عن حجاج، قال قال ابن جريج أخبرني أبو الزبير، أنه سمع عبد الرحمن بن أيمن، يسأل ابن عمر وأبو الزبير يسمع كيف ترى في رجل طلق امرأته حائضا فقال له طلق عبد الله بن عمر امرأته وهي حائض على عهد رسول الله صلى الله عليه وسلم فسأل عمر رسول الله صلى الله عليه وسلم فقال إن عبد الله بن عمر طلق امرأته و هي حائض ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ ليراجعها ‏\"‏ ‏.‏ فردها على قال ‏\"‏ إذا طهرت فليطلق أو ليمسك ‏\"‏ ‏.‏ قال ابن عمر فقال النبي صلى الله عليه وسلم ‏{‏ يا أيها النبي إذا طلقتم النساء فطلقوهن ‏}‏ في قبل عدتهن ‏.‏",
      "text_en": " 'Abdullah bin Ayman asked Ibn 'Umar while Abu Az-Zubair was listening:                      \"What did you think about a man who divorces his wife when she is menstruating?\" He said to him: \"Abdullah bin 'Umar divorced his wife when she was menstruating during the time of the Messenger of Allah. 'Umar asked the Messenger of Allah (about that) and said: 'Abdullah bin 'Umar has divorced his wife while she was menstruating.' The Messenger of Allah said: 'Let him take her back.' So he made me take her back. He said: 'When she becomes pure, let him divorce her or keep her.' Ibn 'Umar said: 'The Prophet said: 'O Prophet! When you divorce women, divorce them before their 'Iddah (prescribed period) elapses.'\"",
      "chain": [
        "34188",
        "20219",
        "11070",
        "11263"
      ]
    },
    {
      "hadith_no": "3454",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا محمد بن إسماعيل بن إبراهيم، قال حدثنا يحيى بن أبي بكير الكرماني، قال حدثنا شعبة، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، - قال وكان وصي أبيه قال وفرقت أن أقول، سمعته من، أبيك - قالت عائشة سألت رسول الله صلى الله عليه وسلم عن بريرة وأردت أن أشتريها واشترط الولاء لأهلها فقال ‏\"‏ اشتريها فإن الولاء لمن أعتق ‏\"‏ ‏.‏ قال وخيرت وكان زوجها عبدا ثم قال بعد ذلك ما أدري وأتي رسول الله صلى الله عليه وسلم بلحم ‏.‏ فقالوا هذا مما تصدق به على بريرة ‏.‏ قال ‏\"‏ هو لها صدقة ولنا هدية ‏\"‏ ‏.‏",
      "text_en": " Yahya bin Abi Bukair Al-Karmani said:                      \"Shu'bah narrated to us, from 'Abdur-Rahman bin Al-Qasim, from his father, from 'Aishah. He (Shu'bah) said: \"And he ('Abdur-Rahman) was the executor for his father.\" He (Shu'bah) said: \"I was afraid to say to him: 'Did you hear this from your father.'\" -- 'Aishah said: \"I asked the Messenger of Allah about Barirah, as I wanted to buy her but it was stipulated that the Wala' would go to her (former) masters. He said: 'Buy her, for the Wala' is to the one who sets the slave free.' And she was given the choice, as her husband was a slave.\" Then he said, after that: \"I do not know.\" --\"And some meat was brought to the Messenger of Allah and they said: 'This is some of that which was given in charity to Barirah.' He said: 'It is charity for her and a gift for us.'\"",
      "chain": [
        "34188",
        "20365",
        "20020",
        "10530",
        "10535",
        "53",
        "53"
      ]
    },
    {
      "hadith_no": "3505",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرني محمد بن إسماعيل بن إبراهيم، قال حدثنا السهمي، - يعني عبد الله بن بكر - قال حدثنا سعيد، عن أيوب، عن نافع، عن صفية بنت أبي عبيد، عن بعض، أزواج النبي صلى الله عليه وسلم وهي أم سلمة عن النبي صلى الله عليه وسلم نحوه ‏.‏",
      "text_en": " A similar report was narrated from Safiyyah bint Abi 'Ubaid from one of the wives of the Prophet -and she is Umm Salamah- from the Prophet.",
      "chain": [
        "34188",
        "11168",
        "11015",
        "11014",
        "11811"
      ]
    },
    {
      "hadith_no": "3523",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا أبو داود، سليمان بن سيف قال حدثنا الحسن، وهو ابن أعين قال حدثنا زهير، ح وأخبرني محمد بن إسماعيل بن إبراهيم، قال حدثنا يحيى، قال حدثنا زهير بن معاوية، قال حدثنا أبو إسحاق، عن الأسود، ومسروق، وعبيدة، عن عبد الله، أن سورة النساء القصرى، نزلت بعد البقرة ‏.‏",
      "text_en": " It was narrated from 'Abdullah that the shorter Surah, that speaks of women (At-Talaq), was revealed after Al-Baqarah.",
      "chain": [
        "11016",
        "20321",
        "34188",
        "20031",
        "20321",
        "11049",
        "11054",
        "11018",
        "11370",
        "16"
      ]
    },
    {
      "hadith_no": "3531",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرني محمد بن إسماعيل بن إبراهيم، قال حدثنا يزيد، قال حدثنا ورقاء، عن ابن أبي نجيح، قال عطاء عن ابن عباس، نسخت هذه الآية عدتها في أهلها فتعتد حيث شاءت وهو قول الله عز وجل ‏{‏ غير إخراج ‏}‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that this Verse abrogated the woman's 'Iddah among her family, and she may observe her 'Iddah wherever she wants. That is the saying of Allah, the Mighty and Sublime:                      without turning them out.",
      "chain": [
        "34188",
        "20472",
        "11254",
        "11029"
      ]
    },
    {
      "hadith_no": "3535",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا محمد بن إسماعيل بن إبراهيم، قال حدثنا يحيى بن أبي بكير، قال حدثنا إبراهيم بن طهمان، قال حدثني بديل، عن الحسن بن مسلم، عن صفية بنت شيبة، عن أم سلمة، زوج النبي صلى الله عليه وسلم عن النبي صلى الله عليه وسلم قال ‏\"‏ المتوفى عنها زوجها لا تلبس المعصفر من الثياب ولا الممشقة ولا تختضب ولا تكتحل ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Safiyyah bint Shaibah, from Umm Salamah, the wife of the Prophet, that the Prophet said:                      \"The woman whose husband has died should not wear clothes that are dyed with safflower or red clay, and she should not use dye nor kohl.\"",
      "chain": [
        "34188",
        "20365",
        "20187",
        "11557",
        "2802"
      ]
    },
    {
      "hadith_no": "3878",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرني محمد بن إسماعيل بن إبراهيم، عن يونس، قال حدثنا حماد، عن مطر، عن عطاء، عن جابر، رفعه نهى عن كراء الأرض،‏.‏‏ وافقه عبد الملك بن عبد العزيز بن جريج على النهى عن كراء الأرض،‏.‏‏",
      "text_en": " It was narrated from Jabir who attributed it to the Prophet:                      \"That he forbade leasing out land.\"",
      "chain": [
        "34188",
        "20475",
        "20022",
        "11029"
      ]
    },
    {
      "hadith_no": "3909",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرني محمد بن إسماعيل بن إبراهيم، قال حدثنا يزيد، قال أنبأنا ابن عون، عن نافع، كان ابن عمر يأخذ كراء الأرض فبلغه عن رافع بن خديج، شىء فأخذ بيدي فمشى إلى رافع وأنا معه فحدثه رافع عن بعض عمومته أن رسول الله صلى الله عليه وسلم نهى عن كراء الأرض‏.‏‏ فترك عبد الله بعد‏.‏‏",
      "text_en": " It was narrated from Nafi':                      \"Ibn 'Umar used to take rent for some land, then he heard something from Rafi' bin Khadij. He took me by the hand and went off to Rafi', and I was with him. Rafi' narrated to him from some of his paternal uncles, that the Messenger of Allah forbade leasing land, so 'Abdullah stopped (doing that) afterward.\"",
      "chain": [
        "34188",
        "20472",
        "11071",
        "11014",
        "1986"
      ]
    },
    {
      "hadith_no": "3943",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Kind Treatment of Women - كتاب عشرة النساء",
      "chapter_no": "36",
      "text_ar": "أخبرني محمد بن إسماعيل بن إبراهيم، قال حدثنا يزيد، قال أنبأنا حماد بن سلمة، عن أيوب، عن أبي قلابة، عن عبد الله بن يزيد، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يقسم بين نسائه ثم يعدل ثم يقول ‏\"‏ اللهم هذا فعلي فيما أملك فلا تلمني فيما تملك ولا أملك ‏\"‏ ‏.‏ أرسله حماد بن زيد ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                      \"The Messenger of Allah used to divide his time equally among his wives then he would say: 'O Allah, this is what I have done with regard to that over which I have control, so do not blame me for that over which You have control and I do not.'\"  Hammad bin Zaid narrated it in Mursal form.",
      "chain": [
        "34188",
        "20472",
        "20021",
        "11015",
        "11047",
        "1945",
        "53"
      ]
    },
    {
      "hadith_no": "4095",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا محمد بن رافع، ومحمد بن إسماعيل بن إبراهيم، قالا حدثنا سليمان، - يعني ابن داود - الهاشمي قال حدثنا إبراهيم، عن أبيه، عن أبي عبيدة بن محمد بن عمار بن ياسر، عن طلحة بن عبد الله بن عوف، عن سعيد بن زيد، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من قتل دون ماله فهو شهيد ومن قتل دون أهله فهو شهيد ومن قتل دون دينه فهو شهيد ومن قتل دون دمه فهو شهيد ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Sa'eed bin Zaid said:                     \"The Messenger of Allah [SAW] said: 'Whoever is killed protecting his wealth, he is a martyr. Whoever is killed protecting his family, he is a martyr. Whoever is killed protecting his religion, he is a martyr. Whoever is killed protecting himself, he is a martyr.'\"",
      "chain": [
        "30375",
        "34188",
        "30584",
        "11051",
        "19954",
        "11043",
        "11"
      ]
    },
    {
      "hadith_no": "4118",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرني محمد بن إسماعيل بن إبراهيم، عن يزيد، عن سليمان التيمي، عن الحسن، عن أبي موسى، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا تواجه المسلمان بسيفيهما فقتل أحدهما صاحبه فهما في النار ‏\"‏ ‏.‏ قيل يا رسول الله هذا القاتل فما بال المقتول قال ‏\"‏ أراد قتل صاحبه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Musa that:                     The Prophet [SAW] said: \"If two Muslims confront each other with swords, and one kills the other, they will both be in Hell.\" It was said: \"O Messenger of Allah, (we understand about) the killer, but what about the one who is killed?\" He said: \"He wanted to kill his companion.\"",
      "chain": [
        "34188",
        "20472",
        "11289",
        "11016",
        "41"
      ]
    },
    {
      "hadith_no": "4119",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرني محمد بن إسماعيل بن إبراهيم، قال حدثنا يزيد، - وهو ابن هارون - قال أنبأنا سعيد، عن قتادة، عن الحسن، عن أبي موسى الأشعري، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا تواجه المسلمان بسيفيهما فقتل أحدهما صاحبه فهما في النار مثله سواء ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Musa Al-Ash'ari that:                     The Prophet [SAW] said: \"If two Muslims confront each other with swords and one of them kills the other, they will both be in Hell.\"",
      "chain": [
        "34188",
        "20472",
        "11168",
        "11019",
        "11016",
        "41"
      ]
    },
    {
      "hadith_no": "4482",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرني محمد بن إسماعيل بن إبراهيم، قال حدثنا يزيد، قال أنبأنا همام، عن قتادة، عن الحسن، عن سمرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ البيعان بالخيار ما لم يتفرقا ويأخذ أحدهما ما رضي من صاحبه أو هوي ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Al- Hasan from Samurah, who said:                     \"The Messenger of Allah said;\" Two traders have the choice as long as they have not separated, or until they reach a deal that suits both of th4em or that is satisfactory (to both)\"",
      "chain": [
        "34188",
        "20472",
        "20297",
        "11019",
        "11016",
        "394"
      ]
    },
    {
      "hadith_no": "4723",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا محمد بن إسماعيل بن إبراهيم، قال حدثنا إسحاق، عن عوف الأعرابي، عن علقمة بن وائل الحضرمي، عن أبيه، قال جيء بالقاتل الذي قتل إلى رسول الله صلى الله عليه وسلم جاء به ولي المقتول فقال له رسول الله صلى الله عليه وسلم ‏\"‏ أتعفو ‏\"‏ ‏.‏ قال لا قال ‏\"‏ أتقتل ‏\"‏ ‏.‏ قال نعم قال ‏\"‏ اذهب ‏\"‏ ‏.‏ فلما ذهب دعاه قال ‏\"‏ أتعفو ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ أتأخذ الدية ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ أتقتل ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ اذهب ‏\"‏ ‏.‏ فلما ذهب قال ‏\"‏ أما إنك إن عفوت عنه فإنه يبوء بإثمك وإثم صاحبك ‏\"‏ ‏.‏ فعفا عنه فأرسله - قال - فرأيته يجر نسعته ‏.‏",
      "text_en": " It was narrated from 'Alqamah binWa'il Al-Hadrami that his farther said:                     A man who had killed someone was brought to the Messenger of Allah, and he was brought by the heir of the victim. The Messenger of Allah said to him. 'Will you forgive him? He said: No.' He said: 'Will you kill him? He said: 'Yes.' He said: 'Go away.' Then when he went away, he called him back and said: will you forgive him?' He said: 'No.' He said: 'Will you accept the Diyah? He said: 'No.' He said: 'will you kill him? He said: 'Yes.' He said: 'Go away.' Then when he had gone he said: If you forgive him, he will carry your sin and the sin of your companion (the victim).\" So he forgave him and let him go.\" He said: \"And I saw him dragging his string.\"",
      "chain": [
        "34188",
        "30021",
        "11298",
        "10801"
      ]
    },
    {
      "hadith_no": "4782",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا محمد بن إسماعيل بن إبراهيم، قال حدثنا علي بن حفص، قال حدثنا ورقاء، عن عمرو، عن مجاهد، قال ‏{‏ كتب عليكم القصاص في القتلى الحر بالحر ‏}‏ قال كان بنو إسرائيل عليهم القصاص وليس عليهم الدية فأنزل الله عز وجل عليهم الدية فجعلها على هذه الأمة تخفيفا على ما كان على بني إسرائيل ‏.‏",
      "text_en": " It was narrated that Mujahid said:                     \"Al-Qisas (the Law of Equality in punishment) is prescribed for you in case of murder: the free  for the free[2] The rule for the Children of Israel was Qisas, and not Diyah. Then Allah, the Mighty and Sublime, revealed the Diyah to them, and He revealed this ruling to this Ummah as an alleviation of the ruling that applied to the Children of Israel.\"",
      "chain": [
        "34188",
        "20632",
        "11439",
        "11028"
      ]
    },
    {
      "hadith_no": "4792",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرني محمد بن إسماعيل بن إبراهيم، قال حدثنا يونس، قال حدثنا حماد، عن أيوب، عن القاسم بن ربيعة، أن رسول الله صلى الله عليه وسلم خطب يوم الفتح ‏.‏ مرسل ‏.‏",
      "text_en": " It was narrated from Al-Qasim bin Rabi'ah that:                     the Messenger of Allah delivered a speech on the Day of the Conquest. (And he mentioned it) in Mursal from.",
      "chain": [
        "34188",
        "20475",
        "20022",
        "11015",
        "14317"
      ]
    },
    {
      "hadith_no": "4810",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "حدثنا محمد بن إسماعيل بن إبراهيم، قال حدثنا يعلى، عن الحجاج الصواف، عن يحيى، عن عكرمة، عن ابن عباس، قال قضى رسول الله صلى الله عليه وسلم في المكاتب يودى بقدر ما أدى من مكاتبته دية الحر وما بقي دية العبد ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"The Messenger of Allah ruled that in the case of a Mukatab, the Diyah should be (equivalent) to the Diyah for a free man, proportionate to the amount he had paid off (towards buying his freedom).\" (Dar'if)",
      "chain": [
        "34188",
        "20372",
        "20031",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "4910",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرني محمد بن إسماعيل بن إبراهيم، قال حدثنا أبو نعيم، عن سفيان، عن أيوب، وإسماعيل بن أمية، وعبيد الله، وموسى بن عقبة، عن نافع، عن ابن عمر، أن النبي صلى الله عليه وسلم قطع في مجن قيمته ثلاثة دراهم ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that:                     the Messenger of Allah cut off (a thief's hand) for a shield that was worth three Dirhams.",
      "chain": [
        "34188",
        "20348",
        "20012",
        "11015",
        "11417",
        "11201",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "4965",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرنا محمد بن إسماعيل بن إبراهيم، قال حدثنا أبو نعيم، عن سفيان، عن يحيى، عن محمد بن يحيى بن حبان، عن رافع بن خديج، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا قطع في ثمر ولا كثر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Rafi bin Khadij said:                     \"I heard the Messenger of Allah say: 'The hand is not to be cut off for (stealing) produce or the spadix of palm trees.\"'",
      "chain": [
        "34188",
        "20348",
        "20012",
        "20031",
        "11222",
        "1986"
      ]
    },
    {
      "hadith_no": "5094",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرني محمد بن إسماعيل بن إبراهيم، قال حدثنا أبو النضر، قال حدثنا شعبة، عن هشام بن عروة، عن امرأته، فاطمة عن أسماء بنت أبي بكر، أن رسول الله صلى الله عليه وسلم لعن الواصلة والمستوصلة ‏.‏",
      "text_en": " It was narrated from Hisham bin 'Urwah, from his wife Fatimah, from Asma' bint Abi Bakr, that:                     The Messenger of Allah [SAW] cursed the woman who affixes hair extensions and the woman who has that done.",
      "chain": [
        "34188",
        "20390",
        "20020",
        "11065",
        "70"
      ]
    },
    {
      "hadith_no": "5127",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا محمد بن إسماعيل بن إبراهيم، قال حدثنا سليمان بن داود بن علي بن عبد الله بن العباس الهاشمي، قال حدثنا إبراهيم بن سعد، قال سمعت صفوان بن سليم، - ولم أسمع من صفوان غيره - يحدث عن رجل ثقة عن أبي هريرة قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا خرجت المرأة إلى المسجد فلتغتسل من الطيب كما تغتسل من الجنابة ‏\"‏ ‏.‏ مختصر ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah [SAW] said: 'If a woman goes out to the Masjid, let her perform Ghusl to remove perfume as she would perform Ghusl to remove Janabah (impurity following sexual activity).'\" This is an abridged form of it.",
      "chain": [
        "34188",
        "30584",
        "20150",
        "11177",
        "13"
      ]
    },
    {
      "hadith_no": "5213",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا محمد بن إسماعيل بن إبراهيم، عن سعيد بن عامر، عن همام، عن ابن جريج، عن الزهري، عن أنس، أن رسول الله صلى الله عليه وسلم كان إذا دخل الخلاء نزع خاتمه ‏.‏",
      "text_en": " It was narrated from Anas that:                     When entering the Khala', the Messenger of Allah [SAW] would take off his ring.",
      "chain": [
        "34188",
        "20232",
        "20297",
        "11070",
        "11013",
        "19"
      ]
    },
    {
      "hadith_no": "5678",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا محمد بن إسماعيل، قال حدثنا يزيد، قال أنبأنا شريك، عن سماك بن حرب، عن ابن بريدة، عن أبيه، أن رسول الله صلى الله عليه وسلم نهى عن الدباء والحنتم والنقير والمزفت ‏.‏ خالفه أبو عوانة ‏.‏",
      "text_en": " It was narrated from Ibn Buraidah, from his father, that:                     The Messenger of Allah [SAW] forbade Ad-Dubba', Al-Hantam, An-Naqir, and Al-Muzaffat.",
      "chain": [
        "34188",
        "20472",
        "20587",
        "10770",
        "11432",
        "3131"
      ]
    },
    {
      "hadith_no": "68",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا سهل بن أبي سهل، ومحمد بن إسماعيل، قالا حدثنا عبد السلام بن صالح أبو الصلت الهروي، حدثنا علي بن موسى الرضا، عن أبيه، عن جعفر بن محمد، عن أبيه، عن علي بن الحسين، عن أبيه، عن علي بن أبي طالب، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ الإيمان معرفة بالقلب وقول باللسان وعمل بالأركان ‏\"‏ ‏.‏ قال أبو الصلت لو قرئ هذا الإسناد على مجنون لبرأ ‏.‏",
      "text_en": " It was narrated that 'Ali bin Abu Talib said:                     \"The Messenger of Allah (ﷺ) said: 'Faith is knowledge in the heart, words on the tongue and action with the physical faculties. (limbs of the body).'\" (Maudu')",
      "chain": [
        "38259",
        "34188",
        "10898",
        "11442",
        "11045",
        "31",
        "5"
      ]
    },
    {
      "hadith_no": "77",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا محمد بن إسماعيل الرازي، أنبأنا يونس بن محمد، حدثنا عبد الله بن محمد الليثي، حدثنا نزار بن حيان، عن عكرمة، عن ابن عباس، وعن جابر بن عبد الله، قالا قال رسول الله  صلى الله عليه وسلم  ‏\"‏ صنفان من أمتي ليس لهما في الإسلام نصيب أهل الإرجاء وأهل القدر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas and Jabir bin 'Abdullah said:                     \"The Messenger of Allah (ﷺ) said: 'There are two types among my Ummah who have no share of Islam: the people of Irja' and the people of Qadar.'\"",
      "chain": [
        "34188",
        "20393",
        "28305",
        "19075",
        "11023",
        "17",
        "34"
      ]
    },
    {
      "hadith_no": "125",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا محمد بن إسماعيل الرازي، حدثنا عبيد الله بن موسى، أنبأنا العلاء بن صالح، عن المنهال، عن عباد بن عبد الله، قال قال علي أنا عبد الله، وأخو، رسوله  صلى الله عليه وسلم  وأنا الصديق الأكبر، لا يقولها بعدي إلا كذاب صليت قبل الناس بسبع سنين ‏.‏",
      "text_en": " It was narrated that 'Abbad bin 'Abdullah said:                     \"'Ali said: 'I am the slave of Allah and the brother of His Messenger. I am the greatest teller of the truth (Siddiq Akbar), and no one will say this after me except a liar. I prayed seven years before the people.\"",
      "chain": [
        "34188",
        "20340",
        "25224",
        "11656"
      ]
    },
    {
      "hadith_no": "265",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا علي بن محمد، ومحمد بن إسماعيل، قالا حدثنا عبد الرحمن بن محمد المحاربي، حدثنا عمار بن سيف، عن أبي معاذ البصري، ح وحدثنا علي بن محمد، حدثنا إسحاق بن منصور، عن عمار بن سيف، عن أبي معاذ، عن ابن سيرين، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ تعوذوا بالله من جب الحزن ‏\"‏ ‏.‏ قالوا يا رسول الله وما جب الحزن قال ‏\"‏ واد في جهنم يتعوذ منه جهنم كل يوم أربعمائة مرة ‏\"‏ ‏.‏ قالوا يا رسول الله ومن يدخله قال ‏\"‏ أعد للقراء المرائين بأعمالهم وإن من أبغض القراء إلى الله الذين يزورون الأمراء ‏\"‏ ‏.‏ قال المحاربي الجورة ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah said: 'Seek refuge with Allah from the pit of grief.' They said: 'o Messenger of Allah, what is the pit of grief?' He said: 'A valley in Hell from which Hell itself seeks refuge four hundred times each day.' It was said: 'O Messenger of Allah, who will enter it?' He said: 'It has been prepared for reciters of the Qur'an who want to show off their deeds. The most hateful of reciters of the Qur'an to Allah are those who visit the rulers.'\" (Da'if)Other chains of narrators.",
      "chain": [
        "38409",
        "34188",
        "20333",
        "25203",
        "38409",
        "30313",
        "25203",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "271",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا محمد بن إسماعيل، أنبأنا وهب بن إسماعيل الأسدي، حدثنا عبد الله بن سعيد المقبري، عن جده، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من تعلم العلم ليباهي به العلماء ويماري به السفهاء ويصرف به وجوه الناس إليه أدخله الله جهنم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah said: 'Whoever seeks knowledge in order to argue with the foolish, or to show off before the scholars, or to attract people's attention, Allah will admit him to Hell.'\"",
      "chain": [
        "34188",
        "25342",
        "22096",
        "13"
      ]
    },
    {
      "hadith_no": "1012",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن إسماعيل، حدثنا زيد بن الحباب، حدثني أبو المقدام، عن محمد بن كعب، عن ابن عباس، قال نهى رسول الله  صلى الله عليه وسلم  أن يصلى خلف المتحدث والنائم ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “The Messenger of Allah (ﷺ)forbade performing prayer behind one who is engaged in conversationorone who is sleeping.”",
      "chain": [
        "34188",
        "20650",
        "11221",
        "17"
      ]
    },
    {
      "hadith_no": "1322",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا علي بن محمد، ومحمد بن إسماعيل، قالا حدثنا وكيع، عن سفيان، عن الأسود بن قيس، عن ثعلبة بن عباد، عن سمرة بن جندب، قال صلى بنا رسول الله  صلى الله عليه وسلم  في الكسوف فلا نسمع له صوتا ‏.‏",
      "text_en": " It wasnarrated that Samurah bin Jundab said:                      “The Messenger of Allah(ﷺ) led us in the eclipse prayer, and we did not hear his voice.”",
      "chain": [
        "38409",
        "34188",
        "20032",
        "20012",
        "11323",
        "19841",
        "394"
      ]
    },
    {
      "hadith_no": "1324",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا علي بن محمد، ومحمد بن إسماعيل، قالا حدثنا وكيع، عن سفيان، عن هشام بن إسحاق بن عبد الله بن كنانة، عن أبيه، قال أرسلني أمير من الأمراء إلى ابن عباس أسأله عن الصلاة، في الاستسقاء فقال ابن عباس ما منعه أن يسألني، قال خرج رسول الله  صلى الله عليه وسلم  متواضعا متبذلا متخشعا مترسلا متضرعا فصلى ركعتين كما يصلي في العيد ولم يخطب خطبتكم هذه ‏.‏",
      "text_en": " It wasnarrated from Hisham bin Ishaq bin ‘Absullah bin Kinanah thathisfather said:                      “One of the chiefs* sent me to Ibn ‘Abbas to ask himabout the prayer for rain. Ibn ‘Abbas said: ‘What kept him fromaskingme?’ He said: ‘The Messenger of Allah (ﷺ) went outhumbly, walkingwith a humble and moderate gait, imploring, and heperformed twoRak’ah as he used to pray for ‘Eid, but he did notgive a sermon likethis sermon of yours.’”",
      "chain": [
        "38409",
        "34188",
        "20032",
        "20012",
        "20016"
      ]
    },
    {
      "hadith_no": "1499",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا إسحاق بن إبراهيم بن حبيب، ومحمد بن إسماعيل، قالا حدثنا عبد الرحمن المحاربي، عن عبد الله بن سعيد بن أبي سعيد، عن أبيه، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ ألزم نعليك قدميك فإن خلعتهما فاجعلهما بين رجليك ولا تجعلهما عن يمينك ولا عن يمين صاحبك ولا وراءك فتؤذي من خلفك ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Hurairah said:                      “The Messenger of Allah (ﷺ)said: ‘Keep your shoes on your feet. If you take them off thenplacethem between your two feet; do not place them to your right, orto theright of your companions, or behind you, for they may annoywhoever isbehind you.’”",
      "chain": [
        "34027",
        "34188",
        "20333",
        "13"
      ]
    },
    {
      "hadith_no": "1516",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا يزيد بن هارون، ح وحدثنا محمد بن إسماعيل، حدثنا المحاربي، جميعا عن محمد بن إسحاق، عن الحارث بن فضيل، عن الزهري، عن عبد الرحمن بن كعب بن مالك، عن أبيه، قال لما حضرت كعبا الوفاة أتته أم بشر بنت البراء بن معرور فقالت يا أبا عبد الرحمن إن لقيت فلانا فاقرأ عليه مني السلام ‏.‏ قال غفر الله لك يا أم بشر نحن أشغل من ذلك ‏.‏ قالت يا أبا عبد الرحمن أما سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ إن أرواح المؤمنين في طير خضر تعلق في شجر الجنة ‏\"‏ ‏.‏ قال بلى ‏.‏ قالت فهو ذاك ‏.‏",
      "text_en": " It wasnarrated from ‘Abdur-Rahman bin Ka’b bin Malik, about Ka’b:                     “When Ka’b was dying, Umm Bishr bint Bara’ bin Ma’rur came tohim andsaid: ‘O Abu ‘Abdur-Rahman! If you meet so-and-so, conveySalam to himfrom me.’ He said: ‘May Allah forgive you, O UmmBishr! We are toobusy to think of that.’ She said: ‘O Abu‘Abdur-Rahman! Did you nothear the Messenger of Allah (ﷺ) say:“The souls of the believers arein green birds, eating from thetrees of Paradise”?’ He said: ‘Yes.’She said: ‘That iswhat I mean.’”",
      "chain": [
        "11222",
        "20472",
        "34188",
        "20333",
        "11107",
        "11835",
        "11013",
        "1134",
        "390"
      ]
    },
    {
      "hadith_no": "1640",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن إسماعيل بن البختري الواسطي، حدثنا يزيد بن هارون، عن إبراهيم بن سعد، عن الزهري، عن سالم، عن أبيه، قال جاء أعرابي إلى النبي  صلى الله عليه وسلم  فقال يا رسول الله إن أبي كان يصل الرحم وكان وكان فأين هو قال ‏\"‏ في النار ‏\"‏ ‏.‏ قال فكأنه وجد من ذلك فقال يا رسول الله فأين أبوك فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ حيثما مررت بقبر كافر فبشره بالنار ‏\"‏ ‏.‏ قال فأسلم الأعرابي بعد وقال لقد كلفني رسول الله  صلى الله عليه وسلم  تعبا ما مررت بقبر كافر إلا بشرته بالنار ‏.‏",
      "text_en": " It wasnarrated from Salim that his father said:                      “A Bedouin came totheProphet (ﷺ) and said: ‘O Messenger of Allah, my father used touphold the ties of kinship, and so and so forth, where is he?’ Hesaid: ‘In the Fire.’ It was as if he found that difficult tobear.Then he said: ‘O Messenger of Allah. Where is your father?’TheMessenger of Allah (ﷺ) said: ‘Whenever you pass by the graveof anidolater, give him the tidings of Hell-fire.’ The Bedouinlater becameMuslim, and he said: ‘The Messenger of Allah (ﷺ)gave me a difficulttask. I never passed the grave of an idolater butI gave him thetidings of Hell-fire.’”",
      "chain": [
        "34188",
        "20472",
        "20150",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "1721",
      "source": " Sunan Ibn Majah ",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا عمرو بن عبد الله الأودي، ومحمد بن إسماعيل، قالا حدثنا أبو أسامة، حدثنا زائدة بن قدامة، حدثنا سماك بن حرب، عن عكرمة، عن ابن عباس، قال جاء أعرابي إلى النبي  صلى الله عليه وسلم  فقال أبصرت الهلال الليلة ‏.‏ فقال ‏\"‏ أتشهد أن لا إله إلا الله وأن محمدا رسول الله ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ قم يا بلال فأذن في الناس أن يصوموا غدا ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “A Bedouin came to the Prophet(ﷺ) and said: ‘I have seen the new crescent tonight.’ He said:‘Doyou bear witness that none has the right to be worshipped butAllahand that Muhammad is the Messenger of Allah (ﷺ)?’ He said:‘Yes.’ Hesaid: ‘Get up, O Bilal, and announce to the peoplethat they shouldfast tomorrow.’”",
      "chain": [
        "34188",
        "20318",
        "20320",
        "10770",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2010",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن إسماعيل بن البختري الواسطي، حدثنا أبو أسامة، عن ابن عون، ومجالد، عن الشعبي، عن الحارث، عن علي، قال لعن رسول الله  صلى الله عليه وسلم  المحلل والمحلل له ‏.‏",
      "text_en": " It was narrated that 'Ali said:                     “The Massenger of Allah cursed the Muhallil and the Muhallal lahu.”",
      "chain": [
        "34188",
        "20318",
        "11071",
        "10820",
        "11052",
        "5"
      ]
    },
    {
      "hadith_no": "2030",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا عمرو بن عبد الله، ومحمد بن إسماعيل، قالا حدثنا أبو أسامة، عن عبد الحميد بن جعفر، عن يزيد بن أبي حبيب، عن مرثد بن عبد الله، عن عقبة بن عامر، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ إن أحق الشرط أن يوفى به ما استحللتم به الفروج ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Uqbah bin 'Amir:                     that the Prophet said: “The conditions most deserving to be fulfilled are those by means of which the private parts become permissible for you.”",
      "chain": [
        "34188",
        "20318",
        "11875",
        "11411",
        "189"
      ]
    },
    {
      "hadith_no": "2074",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن إسماعيل، حدثنا وكيع، عن شيبان أبي معاوية، عن يحيى بن أبي كثير، عن أبي سهم، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من الغيرة ما يحب الله ومنها ما يكره الله فأما ما يحب فالغيرة في الريبة وأما ما يكره فالغيرة في غير ريبة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     the Messenger of Allah said: \"There is a kind of protective jealousy that Allah loves and a kind that Allah hates. As for that which Allah loves, it is protective jealousy when there are grounds for suspicion. And as for that which He hates, it is protective jealousy when there are no grounds for suspicion.\"",
      "chain": [
        "34188",
        "20032",
        "11449",
        "13"
      ]
    },
    {
      "hadith_no": "2241",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا علي بن محمد، ومحمد بن إسماعيل، قالا حدثنا وكيع، حدثنا مغيرة بن زياد الموصلي، عن عبادة بن نسى، عن الأسود بن ثعلبة، عن عبادة بن الصامت، قال علمت ناسا من أهل الصفة القرآن والكتابة فأهدى إلى رجل منهم قوسا فقلت ليست بمال وأرمي عنها في سبيل الله فسألت رسول الله  صلى الله عليه وسلم  عنها فقال ‏\"‏ إن سرك أن تطوق بها طوقا من نار فاقبلها ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Ubadah bin Samit said:                     \"I taught people from Ahtus-Suffah\" Qur'an and how to write, and one of them gave me a bow. I said: 'It is not money, and I can shoot (with it) for the sake of Allah., I asked the Messenger of Allah (ﷺ) about it and he said: 'If it would please you to have a necklace of fire placed around your neck, then accept it.'\"",
      "chain": [
        "38409",
        "34188",
        "20032",
        "19947",
        "17002",
        "40"
      ]
    },
    {
      "hadith_no": "2275",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا الحسين بن أبي السري العسقلاني، ومحمد بن إسماعيل، قالا حدثنا وكيع، حدثنا سعيد بن بشير، عن قتادة، عن الحسن، عن سمرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إذا باع المجيزان فهو للأول ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Samurah that the Messenger of Allah (ﷺ), said:                     \"If two (separate) authorized persons make a sale (of the same thing), then the first transaction is the one that is valid. \"",
      "chain": [
        "38177",
        "34188",
        "20032",
        "20710",
        "11019",
        "11016",
        "394"
      ]
    },
    {
      "hadith_no": "2292",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا علي بن محمد، ومحمد بن إسماعيل، قالا حدثنا وكيع، عن المسعودي، عن علي بن مدرك، عن خرشة بن الحر، عن أبي ذر، عن النبي  صلى الله عليه وسلم  ح وحدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن علي بن مدرك، عن أبي زرعة بن عمرو بن جرير، عن خرشة بن الحر، عن أبي ذر، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ ثلاثة لا يكلمهم الله يوم القيامة ولا ينظر إليهم ولا يزكيهم ولهم عذاب أليم ‏\"‏ ‏.‏ فقلت من هم يا رسول الله فقد خابوا وخسروا ‏.‏ قال ‏\"‏ المسبل إزاره والمنان عطاءه والمنفق سلعته بالحلف الكاذب ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Dharr that the Prophet (ﷺ) said:                     \"There are three to whom Allah will not speak on the Day of Resurrection nor will He look at them or purify them, and theirs will be a painful torment.\" I said: \"Who are they, O Messenger of Allah? For they are indeed losers.\" He said: \"The one who lets his garment hang beneath his ankles, the one who reminds another of what he has given him, and the one who sells his product by means of false oaths.\"",
      "chain": [
        "38409",
        "34188",
        "20032",
        "20724",
        "11377",
        "4026",
        "23"
      ]
    },
    {
      "hadith_no": "2305",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعلي بن محمد، ومحمد بن إسماعيل، قالوا حدثنا وكيع، حدثنا سفيان، عن سماك بن حرب، عن سويد بن قيس، قال جلبت أنا ومخرفة العبدي، بزا من هجر فجاءنا رسول الله  صلى الله عليه وسلم  فساومنا سراويل وعندنا وزان يزن بالأجر فقال له النبي  صلى الله عليه وسلم  ‏\"‏ يا وزان زن وأرجح ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Suwaid bin Qais said:                     \"Makhrafah Al' Abdi and I brought linens from Hajar[1] The Messenger of Allah (ﷺ) came to us to bargain with us with some trousers. There was someone with me who weighed (the goods) in exchange for a wage. So the Prophet (ﷺ) said to the one weighing: 'Weigh and add more.'\"",
      "chain": [
        "30201",
        "38409",
        "34188",
        "20032",
        "20012",
        "10770",
        "16165"
      ]
    },
    {
      "hadith_no": "2326",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا محمد بن إسماعيل، حدثنا وكيع، حدثنا المسعودي، عن جابر، عن أبي الضحى، عن مسروق، عن عبد الله بن مسعود، أنه قال أشهد على الصادق المصدوق أبي القاسم  صلى الله عليه وسلم  أنه حدثنا قال ‏\"‏ بيع المحفلات خلابة ولا تحل الخلابة لمسلم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Mas'ud said:                     \"I bear witness that the true and truly inspired one Abul-Qasim (ﷺ) told us: 'Selling a Muhaffalah is Khilabah, and Khilabah is not lawful for the Muslim.\"' (Ibn Majah said: \" Meaning: 'Deception.\")",
      "chain": [
        "34188",
        "20032",
        "20724",
        "34",
        "11392",
        "11018",
        "16"
      ]
    },
    {
      "hadith_no": "2333",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا علي بن محمد، ومحمد بن إسماعيل، قالا حدثنا وكيع، حدثنا سفيان، عن جابر، عن القاسم بن عبد الرحمن، عن أبيه، عن عبد الله بن مسعود، قال كان النبي  صلى الله عليه وسلم  إذا أتي بالسبى أعطى أهل البيت جميعا كراهية أن يفرق بينهم ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Mas'ud said:                     \"When captives were brought to him, the Prophet (ﷺ) would give the members of one family together (to one person), not wanting to separate them.\"",
      "chain": [
        "38409",
        "34188",
        "20032",
        "20012",
        "34",
        "19896",
        "16"
      ]
    },
    {
      "hadith_no": "2395",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا محمد بن إسماعيل، حدثنا عثمان بن عبد الرحمن، حدثنا علي بن عروة، عن المقبري، عن أبي هريرة، رضى الله عنه قال أمر رسول الله  صلى الله عليه وسلم  الأغنياء باتخاذ الغنم وأمر الفقراء باتخاذ الدجاج وقال ‏\"‏ عند اتخاذ الأغنياء الدجاج يأذن الله بهلاك القرى ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The  Messenger of Allah (ﷺ) commanded the rich to keep sheep, and he commanded the poor to keep chickens, and he said: 'When the rich keep chickens, then Allah will give permission for the town to be destroyed.\"'",
      "chain": [
        "34188",
        "28389",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "2309",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Rulings - كتاب الأحكام",
      "chapter_no": "13",
      "text_ar": "حدثنا علي بن محمد، ومحمد بن إسماعيل، قالا حدثنا وكيع، حدثنا إسرائيل، عن عبد الأعلى، عن بلال بن أبي موسى، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من سأل القضاء وكل إلى نفسه ومن جبر عليه نزل إليه ملك فسدده ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Anas bin Malik that the Messenger of Allah (ﷺ) said:                     “Whoever asks to be appointed a judge, will be entrusted to himself, but “Whoever asks to be appointed a judge, will be entrusted to himself, but whoever is forced to accept position, an angel will come down to him and guide him.' ”",
      "chain": [
        "38409",
        "34188",
        "20032",
        "20311",
        "20246",
        "19"
      ]
    },
    {
      "hadith_no": "2477",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Gifts - كتاب الهبات",
      "chapter_no": "14",
      "text_ar": "حدثنا علي بن محمد، ومحمد بن إسماعيل، قالا حدثنا وكيع، حدثنا إبراهيم بن إسماعيل بن مجمع بن جارية الأنصاري، عن عمرو بن دينار، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الرجل أحق بهبته ما لم يثب منها ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:                     “A man has more right to his gift so long as he has not gotten something in return for it.”",
      "chain": [
        "38409",
        "34188",
        "20032",
        "26500",
        "11081",
        "13"
      ]
    },
    {
      "hadith_no": "2558",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Pawning - كتاب الرهون",
      "chapter_no": "16",
      "text_ar": "حدثنا أبو بكر بن خلاد الباهلي، ومحمد بن إسماعيل، قالا حدثنا وكيع، عن سفيان، عن عمرو بن دينار، عن طاوس، قال قال ابن عباس إنما قال رسول الله صلى الله عليه وسلم ‏\"‏ لأن يمنح أحدكم أخاه الأرض خير له من أن يأخذ لها خراجا معلوما ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Tawus that Ibn`Abbas told that the Messenger of Allah (ﷺ) merely said:                     “For one of you to give (land) to his brother is better for him than if he were to take a set amount in rent for it.”",
      "chain": [
        "30357",
        "34188",
        "20032",
        "20012",
        "11081",
        "11053"
      ]
    },
    {
      "hadith_no": "2611",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Manumission (of Slaves) - كتاب العتق",
      "chapter_no": "19",
      "text_ar": "حدثنا علي بن محمد، ومحمد بن إسماعيل، قالا حدثنا وكيع، حدثنا شريك، عن حسين بن عبد الله بن عبيد الله بن عباس، عن عكرمة، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أيما رجل ولدت أمته منه فهي معتقة عن دبر منه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn`Abbas that the Messenger of Allah (ﷺ) said:                     “Any man whose slave won an bears him a child, she will be free after he dies.”",
      "chain": [
        "38409",
        "34188",
        "20032",
        "11858",
        "12056",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2942",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا يحيى بن حكيم، وحفص بن عمرو، قالا حدثنا عبد الرحمن بن مهدي، ح وحدثنا محمد بن إسماعيل، أنبأنا وكيع، قالا حدثنا سفيان، عن أبي هاشم الرماني، - قال أبو عبد الله هو يحيى بن الأسود - عن أبي مجلز، عن قيس بن عباد، قال سمعت أبا ذر، يقسم لنزلت هذه الآيات في هؤلاء الرهط الستة يوم بدر ‏{‏هذان خصمان اختصموا في ربهم‏}‏ إلى قوله‏:‏ ‏{‏ إن الله يفعل ما يريد‏}‏ في حمزة بن عبد المطلب وعلي بن أبي طالب وعبيدة بن الحارث وعتبة بن ربيعة وشيبة بن ربيعة والوليد بن عتبة اختصموا في الحجج يوم بدر ‏.‏",
      "text_en": " It wasnarrated that Qais bin ‘Ubaid said:                      “I heard Abu Dharrswearingthat these verses were revealed concerning those six peopleon theDay of Badr: ‘These two opponents (believers and disbelievers)dispute with each other about their Lord.”[22:19] to the words“Verily, Allah does what he wills.’[22:14] (that is) Hamzah bin‘Abdul-Muttalib, ‘Ali bin Abi Talib, ‘Ubaidah bin Al-Harith,‘Utbahbin Rabi’ah, Shaibah bin Rabi’ah and Al-Walid bin‘Utbah. They arguedwith one another on the Day of Badr.”",
      "chain": [
        "34280",
        "20033",
        "34188",
        "20032",
        "20012",
        "11454",
        "30184",
        "11313",
        "11609"
      ]
    },
    {
      "hadith_no": "2947",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن إسماعيل، أنبأنا وكيع، عن عكرمة بن عمار، عن إياس بن سلمة بن الأكوع، عن أبيه، قال غزونا مع أبي بكر هوازن على عهد النبي صلى الله عليه وسلم فأتينا ماء لبني فزارة فعرسنا حتى إذا كان عند الصبح شنناها عليهم غارة فأتينا أهل ماء فبيتناهم فقتلناهم تسعة أو سبعة أبيات ‏.‏",
      "text_en": " It wasnarrated from Iyas bin Salamah bin Awka’, that his fathersaid:                      “Weattacked Hawazin, with Abu Bakr, during the time of theProphet(ﷺ), and we arrived at an oasis belonging to Bani Fazarahduringthe last part of the night. We attacked at dawn, raiding thepeopleof the oasis, and killed them, nine or seven households.”",
      "chain": [
        "34188",
        "20032",
        "10704",
        "11152",
        "237"
      ]
    },
    {
      "hadith_no": "2954",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا علي بن محمد، ومحمد بن إسماعيل، قالا حدثنا وكيع، عن عكرمة بن عمار، عن إياس بن سلمة بن الأكوع، عن أبيه، قال غزونا مع أبي بكر هوازن على عهد رسول الله صلى الله عليه وسلم فنفلني جارية من بني فزارة من أجمل العرب عليها قشع لها فما كشفت لها عن ثوب حتى أتيت المدينة فلقيني النبي صلى الله عليه وسلم في السوق فقال ‏\"‏ لله أبوك هبها لي ‏\"‏ ‏.‏ فوهبتها له فبعث بها ففادى بها أسارى من أسارى المسلمين كانوا بمكة ‏.‏",
      "text_en": " It wasnarrated from Ayas bin Salamah bin Akwa’ that his father said:                     “Weattacked, Hawazin at the time of the Messenger of Allah (ﷺ) withAby Bakr. He awarded me a slave girl from Banu Fazarah, among themostbeautiful of the Arabs, who was wearing an animal skin of hers.I didnot divest her of her clothing until I reached Al-Madinah. ThentheProphet (ﷺ) met me in the marketplace, and said: ‘By Alla,give herto me.’ So I gave her to him, and he sent her as a ransomfor some ofthe Muslim prisoners who were in Makkah.”",
      "chain": [
        "38409",
        "34188",
        "20032",
        "10704",
        "11152",
        "237"
      ]
    },
    {
      "hadith_no": "3505",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Drinks - كتاب الأشربة",
      "chapter_no": "30",
      "text_ar": "حدثنا علي بن محمد، ومحمد بن إسماعيل، قالا حدثنا وكيع، حدثنا عبد العزيز بن عمر بن عبد العزيز، عن عبد الرحمن بن عبد الله الغافقي، وأبي، طعمة مولاهم أنهما سمعا ابن عمر، يقول قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لعنت الخمر على عشرة أوجه بعينها وعاصرها ومعتصرها وبائعها ومبتاعها وحاملها والمحمولة إليه وآكل ثمنها وشاربها وساقيها ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Umar that the Messenger of Allah (ﷺ)said:                     “Wine is cursed from ten angles: The wine itself, the one whosqueezes (the grapes etc), the one for whom it is squeezed, the onewho sells it, the one who buys it, the one who carries it, the one towhom it is carried, the one who consumes its price, the one whodrinksit and the one who pours it.”",
      "chain": [
        "38409",
        "34188",
        "20032",
        "20166",
        "18634",
        "18"
      ]
    },
    {
      "hadith_no": "3718",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا محمد بن إسماعيل، حدثنا وكيع، عن سفيان، عن ابن جريج، عن العباس بن عبد الرحمن، - هو ابن ميناء - عن جودان، عن النبي  صلى الله عليه وسلم  مثله ‏.‏",
      "text_en": " A hadith similar to the above has been narrated through a chain differing from the first at the 4th level of narrators.",
      "chain": [
        "34188",
        "20032",
        "20012",
        "11070",
        "18494",
        "5006"
      ]
    }
  ],
  "total_hadiths": 139
}