{
  "id": "35043",
  "name": "Sa'd bin Hafs al-Tlhy سعد بن حفص الطلحي",
  "full_name": "Sa'd bin Hafs al-Tlhy سعد بن حفص الطلحي",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [خ  سي  البخاري  والنسائي  في  اليوم  والليلة]"
    ],
    "tags": [
      "Client",
      "al-Kufa"
    ],
    "area_of_interest_display": [
      {
        "en": "Narrator[Grade:Thiqah] [خ  سي  البخاري  والنسائي  في  اليوم  والليلة]",
        "ar": "Narrator[Grade:Thiqah] [خ  سي  البخاري  والنسائي  في  اليوم  والليلة]",
        "ckb": "Narrator[Grade:Thiqah] [خ  سي  البخاري  والنسائي  في  اليوم  والليلة]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "Kufa",
        "ar": "الكوفة",
        "ckb": "كوفە"
      }
    ],
    "tags_display": [
      {
        "en": "Client (Mawla)",
        "ar": "مولى",
        "ckb": "مەولا"
      },
      {
        "en": "al-Kufa",
        "ar": "al-Kufa",
        "ckb": "al-Kufa"
      }
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20240",
      "name": "Shayban bin 'Abdur Rahman شيبان بن عبد الرحمن النحوي أبو معاوية",
      "grade": "Succ. (Taba' Tabi') [7th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [7th Generation]",
        "ar": "تابع التابعين [الجيل السابع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی حەوتەم]"
      }
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]",
      "grade_display": {
        "en": "3rd Century AH [11th Generation]",
        "ar": "القرن الثالث الهجري [الجيل الحادي عشر]",
        "ckb": "سەدەی سێیەمی كۆچی [نەوەی یازدەیەم]"
      }
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-179",
      "hadith_no": "179",
      "source": "Sahih Bukhari",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا سعد بن حفص، حدثنا شيبان، عن يحيى، عن أبي سلمة، أن عطاء بن يسار، أخبره أن زيد بن خالد أخبره أنه، سأل عثمان بن عفان  رضى الله عنه  قلت أرأيت إذا جامع فلم يمن قال عثمان يتوضأ كما يتوضأ للصلاة، ويغسل ذكره‏.‏ قال عثمان سمعته من رسول الله صلى الله عليه وسلم‏.‏ فسألت عن ذلك عليا، والزبير، وطلحة، وأبى بن كعب  رضى الله عنهم  فأمروه بذلك‏.‏",
      "text_en": " Narrated Zaid bin Khalid:                     I asked `Uthman bin `Affan about a person who engaged in intercourse but did no discharge. `Uthman replied, \"He should perform ablution like the one for an ordinary prayer but he must wash his penis.\" `Uthman added, \"I heard it from Allah's Apostle.\" I asked `Ali Az-Zubair, Talha and Ubai bin Ka`b about it and they, too, gave the same reply. (This order was canceled later on and taking a bath became necessary for such cases).",
      "usc_msa_ref": "",
      "chain": [
        "35043",
        "20240",
        "11449",
        "10567",
        "11020",
        "3625",
        "4"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-322",
      "hadith_no": "322",
      "source": "Sahih Bukhari",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا سعد بن حفص، قال حدثنا شيبان، عن يحيى، عن أبي سلمة، عن زينب ابنة أبي سلمة، حدثته أن أم سلمة قالت حضت وأنا مع النبي، صلى الله عليه وسلم في الخميلة، فانسللت فخرجت منها، فأخذت ثياب حيضتي فلبستها، فقال لي رسول الله صلى الله عليه وسلم ‏\"‏ أنفست ‏\"‏‏.‏ قلت نعم، فدعاني فأدخلني معه في الخميلة‏.‏ قالت وحدثتني أن النبي صلى الله عليه وسلم كان يقبلها وهو صائم، وكنت أغتسل أنا والنبي صلى الله عليه وسلم من إناء واحد من الجنابة‏.‏",
      "text_en": " Narrated Zainab bint Abi Salama:                     Um-Salama said, \"I got my menses while I was lying with the Prophet under a woolen sheet. So I slipped away, took the clothes for menses and put them on. Allah's Apostle said, 'Have you got your menses?' I replied, 'Yes.' Then he called me and took me with him under the woolen sheet.\" Um Salama further said, \"The Prophet used to kiss me while he was fasting. The Prophet and I used to take the bath of Janaba from a single pot.\"",
      "usc_msa_ref": "319",
      "chain": [
        "35043",
        "20240",
        "11449",
        "10567",
        "244",
        "56"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-2841",
      "hadith_no": "2841",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا سعد بن حفص، حدثنا شيبان، عن يحيى، عن أبي سلمة، أنه سمع أبا هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ من أنفق زوجين في سبيل الله دعاه خزنة الجنة، كل خزنة باب أى فل هلم ‏\"‏‏.‏ قال أبو بكر يا رسول الله، ذاك الذي لا توى عليه‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ إني لأرجو أن تكون منهم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Whoever spends two things in Allah's Cause, will be called by all the gate-keepers of Paradise who will be saying, 'O so-and-so! Come here.' \" Abu Bakr said, \"O Allah's Apostle! Such persons will never be destroyed.\" The Prophet said, \"I hope you will be one of them.\"",
      "usc_msa_ref": "94",
      "chain": [
        "35043",
        "20240",
        "11449",
        "10567",
        "13"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-3837",
      "hadith_no": "3837",
      "source": "Sahih Bukhari",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا سعد بن حفص، حدثنا شيبان، عن يحيى، قال أبو سلمة أخبرني أبو أسيد، أنه سمع النبي صلى الله عليه وسلم يقول ‏\"‏ خير الأنصار  أو قال خير دور الأنصار  بنو النجار وبنو عبد الأشهل وبنو الحارث وبنو ساعدة ‏\"‏‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "35043",
        "20240",
        "11449",
        "10567",
        "113"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-4812",
      "hadith_no": "4812",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا سعد بن حفص، حدثنا شيبان، عن منصور، عن سعيد بن جبير، قال قال ابن أبزى سل ابن عباس عن قوله تعالى ‏{‏ومن يقتل مؤمنا متعمدا فجزاؤه جهنم‏}‏ وقوله ‏{‏لا يقتلون النفس التي حرم الله إلا بالحق‏}‏ حتى بلغ ‏{‏إلا من تاب‏}‏ فسألته فقال لما نزلت قال أهل مكة فقد عدلنا بالله وقتلنا النفس التي حرم الله إلا بالحق وأتينا الفواحش، فأنزل الله ‏{‏إلا من تاب وآمن وعمل عملا صالحا‏}‏ إلى قوله ‏{‏غفورا رحيما‏}‏",
      "text_en": " Narrated Sa`id bin Jubair:                     Ibn Abza said to me, \"Ask Ibn `Abbas regarding the Statement of Allah: 'And whoever murders a believer intentionally, his recompense is Hell.' (4.69) And also His Statement: '...nor kill such life as Allah has forbidden, except for a just cause .....except those who repent, believe, and do good deeds.' \" (25.68-70) So I asked Ibn `Abbas and he said, \"When this (25.68-69) was revealed, the people of Mecca said, \"We have invoked other gods with Allah, and we have murdered such lives which Allah has made sacred, and we have committed illegal sexual intercourse. So Allah revealed: 'Except those who repent, believe, and do good deeds and Allah is Oft-Forgiving, Most Merciful.' (25.70)",
      "usc_msa_ref": "288",
      "chain": [
        "35043",
        "20240",
        "11067",
        "11050"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-4958",
      "hadith_no": "4958",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا سعد بن حفص، حدثنا شيبان، عن يحيى، قال أخبرني أبو سلمة، قال جاء رجل إلى ابن عباس وأبو هريرة جالس عنده فقال أفتني في امرأة ولدت بعد زوجها بأربعين ليلة‏.‏ فقال ابن عباس آخر الأجلين‏.‏ قلت أنا ‏{‏وأولات الأحمال أجلهن أن يضعن حملهن‏}‏ قال أبو هريرة أنا مع ابن أخي  يعني أبا سلمة  فأرسل ابن عباس غلامه كريبا إلى أم سلمة يسألها فقالت قتل زوج سبيعة الأسلمية وهى حبلى، فوضعت بعد موته بأربعين ليلة فخطبت فأنكحها رسول الله صلى الله عليه وسلم وكان أبو السنابل فيمن خطبها‏.‏",
      "text_en": " Narrated Abu Salama:                     A man came to Ibn `Abbas while Abu Huraira was sitting with him and said, \"Give me your verdict regarding a lady who delivered a baby forty days after the death of her husband.\" Ibn `Abbas said, \"This indicates the end of one of the two prescribed periods.\" I said \"For those who are pregnant, their prescribed period is until they deliver their burdens.\" Abu Huraira said, I agree with my cousin (Abu Salama).\" Then Ibn `Abbas sent his slave, Kuraib to Um Salama to ask her (regarding this matter). She replied. \"The husband of Subai'a al Aslamiya was killed while she was pregnant, and she delivered a baby forty days after his death. Then her hand was asked in marriage and Allah's Apostle married her (to somebody). Abu As-Sanabil was one of those who asked for her hand in marriage\".",
      "usc_msa_ref": "",
      "chain": [
        "35043",
        "20240",
        "11449",
        "10567"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-5108",
      "hadith_no": "5108",
      "source": "Sahih Bukhari",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا سعد بن حفص، حدثنا شيبان، عن يحيى، عن محمد بن عبد الرحمن، عن أبي سلمة، عن عبد الله بن عمرو، قال لي النبي صلى الله عليه وسلم ‏\"‏ في كم تقرأ القرآن ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr:                     The Prophet asked me, \"How long does it take you to finish the recitation of the whole Qur'an?\"",
      "usc_msa_ref": "573",
      "chain": [
        "35043",
        "20240",
        "11449",
        "11105",
        "10567",
        "29"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-5220",
      "hadith_no": "5220",
      "source": "Sahih Bukhari",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا سعد بن حفص، حدثنا شيبان، عن منصور، عن سالم بن أبي الجعد، عن كريب، عن ابن عباس، قال قال النبي صلى الله عليه وسلم ‏\"‏ أما لو أن أحدهم يقول حين يأتي أهله باسم الله، اللهم جنبني الشيطان، وجنب الشيطان ما رزقتنا، ثم قدر بينهما في ذلك، أو قضي ولد، لم يضره شيطان أبدا ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet said, \"If anyone of you, when having sexual intercourse with his wife, says: Bismillah, Allahumma jannibni-Sh-Shaitan wa jannib-ish-Shaitan ma razaqtana, and if it is destined that they should have a child, then Satan will never be able to harm him.\"",
      "usc_msa_ref": "94",
      "chain": [
        "35043",
        "20240",
        "11067",
        "11342",
        "11211",
        "17"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-6041",
      "hadith_no": "6041",
      "source": "Sahih Bukhari",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا سعد بن حفص، حدثنا شيبان، عن منصور، عن المسيب، عن وراد، عن المغيرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن الله حرم عليكم عقوق الأمهات، ومنع وهات، ووأد البنات، وكره لكم قيل وقال، وكثرة السؤال، وإضاعة المال ‏\"‏‏.‏",
      "text_en": " Narrated Al-Mughira:                     The Prophet said, \"Allah has forbidden you ( 1 ) to be undutiful to your mothers (2) to withhold (what you should give) or (3) demand (what you do not deserve), and (4) to bury your daughters alive. And Allah has disliked that (A) you talk too much about others ( B), ask too many questions (in religion), or (C) waste your property.\"",
      "usc_msa_ref": "6",
      "chain": [
        "35043",
        "20240",
        "11067",
        "11402",
        "166"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-6509",
      "hadith_no": "6509",
      "source": "Sahih Bukhari",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا سعد بن حفص، حدثنا شيبان، عن يحيى، عن محمد بن إبراهيم القرشي، قال أخبرني معاذ بن عبد الرحمن، أن ابن أبان، أخبره قال أتيت عثمان بطهور وهو جالس على المقاعد، فتوضأ فأحسن الوضوء ثم قال رأيت النبي صلى الله عليه وسلم توضأ وهو في هذا المجلس، فأحسن الوضوء ثم قال ‏\"‏ من توضأ مثل هذا الوضوء، ثم أتى المسجد فركع ركعتين، ثم جلس، غفر له ما تقدم من ذنبه ‏\"‏‏.‏ قال وقال النبي صلى الله عليه وسلم ‏\"‏ لا تغتروا ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     I brought water to `Uthman bin `Affan to perform the ablution while he was sitting on his seat. He performed the ablution in a perfect way and said, \"I saw the Prophet performing the ablution in this place and he performed it in a perfect way and said, \"Whoever performs the ablution as I have done this time and then proceeds to the mosque and offers a two-rak`at prayer and then sits there (waiting for the compulsory congregational prayers), then all his past sins will be forgiven.\" The Prophet further added, \"Do not be conceited (thinking that your sins will be forgiven because of your prayer).",
      "usc_msa_ref": "441",
      "chain": [
        "35043",
        "20240",
        "11449",
        "11213",
        "2706"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-6739",
      "hadith_no": "6739",
      "source": "Sahih Bukhari",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا سعد بن حفص، حدثنا شيبان، عن منصور، عن إبراهيم، عن عبيدة، عن عبد الله، قال سئل النبي صلى الله عليه وسلم أى الناس خير قال ‏\"‏ قرني، ثم الذين يلونهم، ثم الذين يلونهم، ثم يجيء قوم تسبق شهادة أحدهم يمينه، ويمينه شهادته ‏\"‏‏.‏ قال إبراهيم وكان أصحابنا ينهونا ونحن غلمان أن نحلف بالشهادة والعهد‏.‏",
      "text_en": " Narrated `Abdullah:                     The Prophet was asked, \"Who are the best people?\" He replied: The people of my generation, and then those who will follow (come after) them, and then those who will come after the later; after that there will come some people whose witness will precede their oaths and their oaths will go ahead of their witness.\" Ibrahim (a sub-narrator) said, \"When we were young, our elder friends used to prohibit us from taking oaths by saying, 'I bear witness swearing by Allah, or by Allah's Covenant.\"'",
      "usc_msa_ref": "652",
      "chain": [
        "35043",
        "20240",
        "11067",
        "11051",
        "11370",
        "16"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-7210",
      "hadith_no": "7210",
      "source": "Sahih Bukhari",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا سعد بن حفص، حدثنا شيبان، عن يحيى، عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك، قال قال النبي صلى الله عليه وسلم ‏\"‏ يجيء الدجال حتى ينزل في ناحية المدينة، ثم ترجف المدينة ثلاث رجفات، فيخرج إليه كل كافر ومنافق ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet said, \"Ad-Dajjal will come and encamp at a place close to Medina and then Medina will shake thrice whereupon every Kafir (disbeliever) and hypocrite will go out (of Medina) towards him.\"",
      "usc_msa_ref": "239",
      "chain": [
        "35043",
        "20240",
        "11449",
        "11151",
        "19"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-7484",
      "hadith_no": "7484",
      "source": "Sahih Bukhari",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا سعد بن حفص، حدثنا شيبان، عن منصور، عن ربعي بن حراش، عن خرشة بن الحر، عن أبي ذر، قال كان النبي صلى الله عليه وسلم إذا أخذ مضجعه من الليل قال ‏\"‏ باسمك نموت ونحيا، فإذا استيقظ قال الحمد لله الذي أحيانا بعد ما أماتنا وإليه النشور ‏\"‏‏.‏",
      "text_en": " Narrated Abu Dharr:                     When the Prophet went to bed at night, he used to say: \"Bismika namutu wa nahya.\" And when he got up in the morning, he used to say, \"Al hamdu li l-lahi al-ladhi ahyana ba'da ma amatana, wa ilaihi-nnushur.\"",
      "usc_msa_ref": "",
      "chain": [
        "35043",
        "20240",
        "11067",
        "11334",
        "4026",
        "23"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    }
  ],
  "total_hadiths": 13,
  "grade_display": {
    "en": "3rd Century AH [10th Generation]",
    "ar": "القرن الثالث الهجري [الجيل العاشر]",
    "ckb": "سەدەی سێیەمی كۆچی [نەوەی دەیەم]"
  }
}