{
  "id": "35093",
  "name": "'Ali bin Sa'id bin Msrwq علي بن سعيد بن مسروق الكندي",
  "full_name": "'Ali bin Sa'id bin Msrwq علي بن سعيد بن مسروق الكندي",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "249",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ ت  س  -  صدوق ]"
    ],
    "tags": [
      "al-Kundi",
      "al-Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20317",
      "name": "Hafs bin Ghyath حفص بن غياث",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20334",
      "name": "'Abdul Rahim bin Sulaiman عبد الرحيم بن سليمان الكناني",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20366",
      "name": "Yahya bin Zakaria bin Abi Zaida يحيى بن زكريا بن أبي زائدة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20616",
      "name": "Yahya bin Ya'la يحيى بن يعلى أبو المحياة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20347",
      "name": "'Isa bin Yonus bin Abi Ishaq عيسى بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20201",
      "name": "Marwan bin Mua'wiya al-Fazari مروان بن معاوية الفزاري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20345",
      "name": "'Ali bin Ms'hr علي بن مسهر",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20102",
      "name": "'Abdullah bin Idris bin Yazid al-Audi عبد الله بن إدريس بن يزيد الأودي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "students": [
    {
      "id": "30005",
      "name": "Imam Tirmidhi الترمذي محمد بن عيسى بن سورة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30006",
      "name": "Imam Nasa'i أحمد بن شعيب بن علي بن سنان النسائي",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38719",
      "name": "Y'aqub bin Sufyan يعقوب بن سفيان",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "31170",
      "name": "Muhammad bin Sulaiman al-Baghandi محمد بن سليمان بن الحارث الباغندي",
      "grade": "3rd Century AH"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "4802",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا علي بن سعيد بن مسروق، قال حدثنا يحيى بن زكريا بن أبي زائدة، عن حجاج، عن زيد بن جبير، عن خشف بن مالك، قال سمعت ابن مسعود، يقول قضى رسول الله صلى الله عليه وسلم دية الخطإ عشرين بنت مخاض وعشرين ابن مخاض ذكورا وعشرين بنت لبون وعشرين جذعة وعشرين حقة ‏.‏",
      "text_en": " In Mas'ud said:                     \"The Messenger of Allah ruled that the Diyah for accidental killing is twenty Bint Makhad, twenty Bin Makhad, twenty Bint Labur, twenty Jadh'ah, and twenty Hiqqah.\"",
      "chain": [
        "35093",
        "20366",
        "20219",
        "22061",
        "19907",
        "16"
      ]
    },
    {
      "hadith_no": "4824",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا علي بن سعيد بن مسروق، قال حدثنا يحيى بن أبي زائدة، عن إسرائيل، عن منصور، عن إبراهيم، عن عبيد بن نضيلة، عن المغيرة بن شعبة، قال ضربت امرأة من بني لحيان ضرتها بعمود الفسطاط فقتلتها وكان بالمقتولة حمل فقضى رسول الله صلى الله عليه وسلم على عصبة القاتلة بالدية ولما في بطنها بغرة ‏.‏",
      "text_en": " It was narrated that Al-Muhgirah bin Shu'bah said:                     \"A woman of Banu Lihyan struck her co-wife with a tent pole and killed her, and the slain woman was pregnant. The Messenger of Allah ruled that the Diyah was to be paid by the'Asbah of the killer, and that a slave should be given (as Diyah) for the child in her womb\".",
      "chain": [
        "35093",
        "20366",
        "20311",
        "11067",
        "11051",
        "166"
      ]
    },
    {
      "hadith_no": "4876",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرنا علي بن سعيد بن مسروق، قال حدثنا عبد الله بن المبارك، عن معمر، عن بهز بن حكيم، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم حبس رجلا في تهمة ثم خلى سبيله ‏.‏",
      "text_en": " It was narrated from Bahz bin Hakim, from his father, from his grandfather, that:                     the Messenger of Allah detained a man who was under suspicion, and then he let him go. (Hssan)",
      "chain": [
        "35093",
        "20025",
        "20115",
        "19901",
        "19905"
      ]
    },
    {
      "hadith_no": "4897",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرنا علي بن سعيد بن مسروق، قال حدثنا يحيى بن زكريا بن أبي زائدة، عن سفيان بن عيينة، عن الزهري، عن عروة، عن عائشة، أن امرأة، سرقت على عهد رسول الله صلى الله عليه وسلم فقالوا ما نكلمه فيها ما من أحد يكلمه إلا حبه أسامة ‏.‏ فكلمه فقال ‏\"‏ يا أسامة إن بني إسرائيل هلكوا بمثل هذا كان إذا سرق فيهم الشريف تركوه وإن سرق فيهم الدون قطعوه وإنها لو كانت فاطمة بنت محمد لقطعتها ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Aishah that:                     a woman stole at the time of Messenger of Allah and they said: \"We cannot speak to him concerning her; there is no one who can speak to him except his beloved, Usamah.\" So he spoke to him, and he said\"O Usamah, the Children of Israel were destroyed for such a thing. Whenever a noble person among them stole, they would let him go, but if a low-class person among them stole, they would cut off his hand. If it were Fatimah bint Muhammad (who stole), I would cut off her hand.\"",
      "chain": [
        "35093",
        "20366",
        "20005",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "5425",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Etiquette of Judges - كتاب آداب القضاة",
      "chapter_no": "49",
      "text_ar": "أخبرنا علي بن سعيد بن مسروق، قال حدثنا يحيى بن أبي زائدة، عن نافع بن عمر، عن ابن أبي مليكة، قال كانت جاريتان تخرزان بالطائف فخرجت إحداهما ويدها تدمى فزعمت أن صاحبتها أصابتها وأنكرت الأخرى فكتبت إلى ابن عباس في ذلك فكتب أن رسول الله صلى الله عليه وسلم قضى أن اليمين على المدعى عليه ولو أن الناس أعطوا بدعواهم لادعى ناس أموال ناس ودماءهم فادعها واتل عليها هذه الآية ‏{‏ إن الذين يشترون بعهد الله وأيمانهم ثمنا قليلا أولئك لا خلاق لهم في الآخرة ‏}‏ حتى ختم الآية فدعوتها فتلوت عليها فاعترفت بذلك فسره ‏.‏",
      "text_en": " It was narrated from Nafi' bin 'Umar, that Ibn Abi Mulaikah said:                     \"There were two female neighbors who used to do leatherwork (with an awl) in At-Ta'if. One of them came out with her hand bleeding and claimed that her companion had injured her, but the other one denied it. I wrote to Ibn 'Abbas concerning that. He wrote, (saying) that the Messenger of Allah [SAW] ruled that the person against whom the claim was made should swear an oath. For if people were to be given what they claimed was theirs, then people would make claims against the wealth and blood of others.\" So he called her and recited this Verse to her: \"Verily, those who purchase a small gain at the cost of Allah's Covenant and their oaths, they shall have no portion in the Hereafter...\" until the end of the Verse. He called her and recited that to her, and she confessed to that. News of that reached him and he was happy.",
      "chain": [
        "35093",
        "20366",
        "20203",
        "11090"
      ]
    }
  ],
  "total_hadiths": 5
}