{
  "id": "36009",
  "name": "Ahmed bin Yahya bin al-Wzyr أحمد بن يحيى بن الوزير",
  "full_name": "Ahmed bin Yahya bin al-Wzyr أحمد بن يحيى بن الوزير",
  "grade": "3rd Century AH [11th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "265",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Egypt"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ د  س  -  ثقة ]"
    ],
    "tags": [
      "al-Masri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20029",
      "name": "'Abdullah bin Wahb عبد الله بن وهب بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20002",
      "name": "Imam Shafi'ee ابو عبد الله محمد بن إدريس الشافعي",
      "grade": "Succ. (Taba' Tabi') [9th generation] [Shafi'ee]"
    },
    {
      "id": "36033",
      "name": "Shu'aib bin al-Laith bin Sa'd شعيب بن الليث بن سعد",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "students": [
    {
      "id": "30006",
      "name": "Imam Nasa'i أحمد بن شعيب بن علي بن سنان النسائي",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "35095",
      "name": "'Ali bin 'Abdur Rahman علي بن عبد الرحمن بن محمد بن المغيرة",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "3321",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا أحمد بن يحيى بن الوزير، قال سمعت ابن وهب، قال أخبرني سليمان، عن يحيى، وربيعة، عن القاسم، عن عائشة، قالت أمر النبي صلى الله عليه وسلم امرأة أبي حذيفة أن ترضع سالما مولى أبي حذيفة حتى تذهب غيرة أبي حذيفة فأرضعته وهو رجل ‏.‏ قال ربيعة فكانت رخصة لسالم ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                      \"The Messenger of Allah commanded the wife of Abu Hudhaifah to breast-feed Salim, the freed slave of Abu Hudhaifah, so that the protective jealousy of Abu Hudhaifah would be dispelled. She breast-fed him when he was a man.\" (One of the narrators) Rabi'ah said: \"That was a concession granted to Salim.\"",
      "chain": [
        "36009",
        "20029",
        "20160",
        "20031",
        "11162",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "3388",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا أحمد بن يحيى بن الوزير، قال حدثنا سعيد بن كثير بن عفير، قال أخبرني سليمان بن بلال، عن يحيى بن سعيد، عن حميد الطويل، عن أنس، أنه سمعه يقول آخى رسول الله صلى الله عليه وسلم بين قريش والأنصار فآخى بين سعد بن الربيع وعبد الرحمن بن عوف فقال له سعد إن لي مالا فهو بيني وبينك شطران ولي امرأتان فانظر أيهما أحب إليك فأنا أطلقها فإذا حلت فتزوجها ‏.‏ قال بارك الله لك في أهلك ومالك دلوني - أى - على السوق ‏.‏ فلم يرجع حتى رجع بسمن وأقط قد أفضله ‏.‏ قال ورأى رسول الله صلى الله عليه وسلم على أثر صفرة فقال ‏\"‏ مهيم ‏\"‏ ‏.‏ فقلت تزوجت امرأة من الأنصار ‏.‏ فقال ‏\"‏ أولم ولو بشاة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Humaid At-Tawil that he heard Anas say:                      \"The Messenger of Allah established the bond of brotherhood between (some of) the Quraish and (some of) the Ansar, and he established the bond of brotherhood between Sa'd bin Ar-Rabi' and 'Abdur-Rahman bin 'Awf. Sa'd said to him: 'I have wealth, which I will share equally between you and me. And I have two wives, so look and see which one you like better, and I will divorce her, and when her 'Iddah is over you can marry her.' He said: 'May Allah bless your family and your wealth for you. Show me -i.e., where the market is.' And he did not come back until he brought some ghee, and cottage cheese that he had left over. He said: 'The Messenger of Allah saw traces of yellow perfume on me and he said: 'What is this for?' I said: 'I have married a woman from among the Ansar.' He said: 'Give a Walimah (wedding feast) even if it is with one sheep.'\"",
      "chain": [
        "36009",
        "30233",
        "20160",
        "11062",
        "11279",
        "19"
      ]
    }
  ],
  "total_hadiths": 2
}