{
  "id": "36012",
  "name": "Ashhb bin 'Abdul 'Aziz أشهب بن عبد العزيز بن داود",
  "full_name": "Ashhb bin 'Abdul 'Aziz أشهب بن عبد العزيز بن داود",
  "grade": "3rd Century AH [10th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "204",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Egypt"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ د  س  -  ثقة ]"
    ],
    "tags": [
      "al-Masri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "20023",
      "name": "al-Laith bin Sa'd الليث بن سعد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20160",
      "name": "Sulaiman bin Bilal al-Taymi سليمان بن بلال التيمي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20200",
      "name": "Fadayl bin 'Iyyad bin Mas'ud فضيل بن عياض بن مسعود",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20624",
      "name": "'Abdullah bin lahya'a bin 'Uqba عبد الله بن لهيعة بن عقبة الحضرمي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "36017",
      "name": "al-Harith bin Mskyn bin Muhammad الحارث بن مسكين بن محمد",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30485",
      "name": "Ahmed bin 'Amr bin al-Sarh أحمد بن عمرو بن السرح أبو الطاهر",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "36056",
      "name": "Muhammad bin 'Abdullah bin 'Abdul Hakam محمد بن عبد الله بن عبد الحكم",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30493",
      "name": "Yonus bin 'Abdul A'la al-Sadfi يونس بن عبد الأعلى بن ميسرة الصدفي",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "244",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا يونس بن عبد الأعلى، قال حدثنا أشهب، عن مالك، أن ابن شهاب، وهشام بن عروة، حدثاه عن عروة، عن عائشة، - رضى الله عنها - قالت خرجنا مع رسول الله صلى الله عليه وسلم عام حجة الوداع فأهللت بالعمرة فقدمت مكة وأنا حائض فلم أطف بالبيت ولا بين الصفا والمروة فشكوت ذلك إلى رسول الله صلى الله عليه وسلم فقال ‏\"‏ انقضي رأسك وامتشطي وأهلي بالحج ودعي العمرة ‏\"‏ ‏.‏ ففعلت فلما قضينا الحج أرسلني مع عبد الرحمن بن أبي بكر إلى التنعيم فاعتمرت فقال ‏\"‏ هذه مكان عمرتك ‏\"‏ ‏.‏ قال أبو عبد الرحمن هذا حديث غريب من حديث مالك عن هشام بن عروة لم يروه أحد إلا أشهب ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                      \"We went out with the Messenger of Allah (ﷺ) in the year of the Farewell Pilgrimage. I (said the Talbiyah) for 'Umrah and I arrived in Makkah while I was menstruating, so I did not perform Tawaf around the House nor between As-Safa and Al-Marwah. I complained about that to the Messenger of Allah (ﷺ), and he said: 'Undo your braids and comb your hair, and enter (begin the Talbiyah) for Hajj, and leave the 'Umrah.' So I did that, and then when we had completed Hajj, he sent me with 'Abdur-Rahman bin Abi Bakr to At-Tan'im, and I performed 'Umrah. He said: 'This is in place of your 'Umrah.'\"Abu 'Abdur-Rahman said: This Hadith is Gharib as a narration of Malik from Hisham, from 'Urwah. No one except Asshab reported it.",
      "chain": [
        "30493",
        "36012",
        "20001",
        "11013",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2333",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرني محمد بن عبد الله بن عبد الحكم، عن أشهب، قال أخبرني يحيى بن أيوب، وذكر، آخر أن عبد الله بن أبي بكر بن محمد بن عمرو بن حزم، حدثهما عن ابن شهاب، عن سالم بن عبد الله، عن أبيه، عن حفصة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من لم يجمع الصيام قبل طلوع الفجر فلا يصوم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Hafsah that the Prophet said:                     \"Whoever does not intend to fast before dawn comes, should not fast.\" (Daif)",
      "chain": [
        "36056",
        "36012",
        "20379",
        "11013",
        "11011",
        "18",
        "54"
      ]
    },
    {
      "hadith_no": "3005",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا يونس بن عبد الأعلى، قال أخبرني أشهب، قال أخبرني مالك، أن ابن شهاب، حدثه عن سالم بن عبد الله، قال كتب عبد الملك بن مروان إلى الحجاج بن يوسف يأمره أن لا، يخالف ابن عمر في أمر الحج فلما كان يوم عرفة جاءه ابن عمر حين زالت الشمس وأنا معه فصاح عند سرادقه أين هذا فخرج إليه الحجاج وعليه ملحفة معصفرة فقال له ما لك يا أبا عبد الرحمن قال الرواح إن كنت تريد السنة ‏.‏ فقال له هذه الساعة فقال له نعم ‏.‏ فقال أفيض على ماء ثم أخرج إليك ‏.‏ فانتظره حتى خرج فسار بيني وبين أبي فقلت إن كنت تريد أن تصيب السنة فاقصر الخطبة وعجل الوقوف ‏.‏ فجعل ينظر إلى ابن عمر كيما يسمع ذلك منه فلما رأى ذلك ابن عمر قال صدق ‏.‏",
      "text_en": " It was narrated that Salim Bin Abdullah said:                     \"Abdul Malik bin Marwan wrote to Al-Hajjaj bin Yusuf telling him not to go against Ibn Umar with regard to the Hajj. On the day of Arafat, Ibn Umar came to him when the sun had passed its zenith, and I was with him, and shouted near his cotton tent: 'Where is he?' Al-Hajjaj came out to him, wearing a wrap dyed with safflower. He said: 'What is the matter, O Abu Abdur Rahman?' He said: 'We have to move on if you want to follow Sunnah.' He said to him: 'At this hour?' He said: 'Yes.' He said: 'I will pour some water over my self (have a bath) then I will come out to you.' So he waited until he came, then he walked between my father and me, I said: 'If you want to follow the Sunnah, then deliver a short Khutbah and hasten to stand (in Arafat).' He started to look at Ibn Umar so that he could hear that, and when Ibn Umar noticed that he said: 'He is speaking the truth.'\"",
      "chain": [
        "30493",
        "36012",
        "20001",
        "11013",
        "11011"
      ]
    },
    {
      "hadith_no": "3048",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرني محمد بن عبد الله بن عبد الحكم، عن أشهب، أن داود بن عبد الرحمن، حدثهم أن عمرو بن دينار حدثه أن عطاء بن أبي رباح حدثهم أنه، سمع ابن عباس، يقول أرسلني رسول الله صلى الله عليه وسلم في ضعفة أهله فصلينا الصبح بمنى ورمينا الجمرة ‏.‏",
      "text_en": " Ata bin Abi Rabah told them that he heard Ibn Abbas say:                     \"The Messenger of Allah sent me with the weak ones of his family to pray Subh in Mina and stone the Jamrah.\"",
      "chain": [
        "36056",
        "36012",
        "11081",
        "17"
      ]
    }
  ],
  "total_hadiths": 4
}