{
  "id": "36033",
  "name": "Shu'aib bin al-Laith bin Sa'd شعيب بن الليث بن سعد",
  "full_name": "Shu'aib bin al-Laith bin Sa'd شعيب بن الليث بن سعد",
  "grade": "3rd Century AH [10th generation]",
  "biography": {
    "birth": {
      "date_hijri": "135",
      "date_gregorian": "NA",
      "date_display": [
        "135 AH"
      ],
      "place": ""
    },
    "death": {
      "date_hijri": "199",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Egypt"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ د  س  -  ثقة ]"
    ],
    "tags": [
      "Client",
      "al-Fahmi",
      "al-Masri"
    ]
  },
  "parents": [
    {
      "id": "20023",
      "name": "al-Laith bin Sa'd الليث بن سعد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "30489",
      "name": "'Abdul Malik bin Shu'aib bin al-Laith عبد الملك بن شعيب بن الليث بن سعد",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "teachers": [
    {
      "id": "20023",
      "name": "al-Laith bin Sa'd الليث بن سعد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "30489",
      "name": "'Abdul Malik bin Shu'aib bin al-Laith عبد الملك بن شعيب بن الليث بن سعد",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "363",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثني عبد الملك بن شعيب بن الليث، قال حدثني أبي، عن جدي، قال حدثني عقيل بن خالد، قال قال ابن شهاب أخبرني عروة بن الزبير، أن أبا هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يأتي العبد الشيطان فيقول من خلق كذا وكذا ‏\"‏ مثل حديث ابن أخي ابن شهاب ‏.‏",
      "text_en": " This hadith is transmitted by Urwa b. Zubair on the authority of Abu Huraira (and the words are):                      The Satan comes to the bondsman (of Allah) and says: Who created this and that? The remaining part of the hadith is the same.",
      "chain": [
        "30489",
        "36033",
        "11207",
        "11013",
        "10511",
        "13"
      ]
    },
    {
      "hadith_no": "424",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني عبد الملك بن شعيب بن الليث، قال حدثني أبي، عن جدي، قال حدثني عقيل بن خالد، قال ابن شهاب سمعت عروة بن الزبير، يقول قالت عائشة زوج النبي صلى الله عليه وسلم فرجع إلى خديجة يرجف فؤاده واقتص الحديث بمثل حديث يونس ومعمر ولم يذكر أول حديثهما من قوله أول ما بدئ به رسول الله صلى الله عليه وسلم من الوحى الرؤيا الصادقة ‏.‏ وتابع يونس على قوله فوالله لا يخزيك الله أبدا ‏.‏ وذكر قول خديجة أى ابن عم اسمع من ابن أخيك ‏.‏",
      "text_en": " This hadith has been reported from 'A'isha by another chain of transmitters and the words are:                      He (the Holy Prophet) came to Khadija an his heart was trembling. The rest of the hadith has been narrated like one transmitted by Yunus and Ma'mar, but the first part is not mentioned, i. e. the first thing with which was started the revelation to the Holy Prophet was the true vision. And these words like those transmitted by Yunus are mentioned thus: By Allah, Allah would never humiliate you. And there is also a mention of the words of Khadija: O son of my uncle! Listen to the son of your brother.",
      "chain": [
        "30489",
        "36033",
        "11207",
        "11013",
        "10511"
      ]
    },
    {
      "hadith_no": "426",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني عبد الملك بن شعيب بن الليث، قال حدثني أبي، عن جدي، قال حدثني عقيل بن خالد، عن ابن شهاب، قال سمعت أبا سلمة بن عبد الرحمن، يقول أخبرني جابر بن عبد الله، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ ثم فتر الوحى عني فترة فبينا أنا أمشي ‏\"‏ ثم ذكر مثل حديث يونس غير أنه قال ‏\"‏ فجثثت منه فرقا حتى هويت إلى الأرض ‏\"‏ ‏.‏ قال وقال أبو سلمة والرجز الأوثان قال ثم حمي الوحى بعد وتتابع",
      "text_en": " It is narrated on the authority of Jabir b. Abdullah that he heard the Messenger of Allah (may peace be upon him) says:                      The wahi was intermitted for me for a small span of time and while I was walking, and then the hadith like the one narrated by Yunus was transmitted but with the exception of these words: I was terror-stricken till I fell on the ground. Abu Salama said: Defilement means idols. After this the revelation was speeded up and followed rapidly.",
      "chain": [
        "30489",
        "36033",
        "11207",
        "11013",
        "10567",
        "34"
      ]
    },
    {
      "hadith_no": "314",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثنا عبد الملك بن شعيب بن الليث، حدثني أبي، عن جدي، حدثني عقيل بن خالد، عن ابن شهاب، أنه قال أخبرني عروة بن الزبير، أن عائشة، زوج النبي صلى الله عليه وسلم أخبرته أن أم سليم أم بني أبي طلحة دخلت على رسول الله صلى الله عليه وسلم ‏.‏ بمعنى حديث هشام غير أن فيه قال قالت عائشة فقلت لها أف لك أترى المرأة ذلك",
      "text_en": " 'A'isha the wife of the Apostle (may peace be upon him) narrated:                      Umm Sulaim, the mother of Bani Abu Talha, came to the Messenger of Allah (may peace be upon him), and a hadith (like that) narrated by Hisham was narrated but for these words. A'isha said: I expressed disapproval to her, saying: Does a woman see a sexual dream?",
      "chain": [
        "30489",
        "36033",
        "11207",
        "11013",
        "10511"
      ]
    },
    {
      "hadith_no": "351",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثنا عبد الملك بن شعيب بن الليث، قال حدثني أبي، عن جدي، حدثني عقيل بن خالد، قال قال ابن شهاب أخبرني عبد الملك بن أبي بكر بن عبد الرحمن بن الحارث بن هشام، أن خارجة بن زيد الأنصاري، أخبره أن أباه زيد بن ثابت قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ الوضوء مما مست النار ‏\"‏",
      "text_en": " Zaid b Thabit reported:                      I heard the Messenger of Allah (may peace be upon him) say this: Ablution is obligatory (for one who takes anything) touched by fire.",
      "chain": [
        "30489",
        "36033",
        "11207",
        "11013"
      ]
    },
    {
      "hadith_no": "418",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثني عبد الملك بن شعيب بن الليث، حدثني أبي، عن جدي، قال حدثني عقيل بن خالد، قال ابن شهاب أخبرني عبيد الله بن عبد الله بن عتبة بن مسعود، أن عائشة، زوج النبي صلى الله عليه وسلم قالت لما ثقل رسول الله صلى الله عليه وسلم واشتد به وجعه استأذن أزواجه أن يمرض في بيتي فأذن له فخرج بين رجلين تخط رجلاه في الأرض بين عباس بن عبد المطلب وبين رجل آخر ‏.‏ قال عبيد الله فأخبرت عبد الله بالذي قالت عائشة فقال لي عبد الله بن عباس هل تدري من الرجل الآخر الذي لم تسم عائشة قال قلت لا ‏.‏ قال ابن عباس هو علي ‏.‏",
      "text_en": " 'A'isha, the wife of the Apostle (may peace be upon him), said:                      When the Messenger of Allah (may peace be upon him) fell ill and his illness became serious, he asked permission from his wives to stay in my house during his illness. They gave him permission to do so. He stepped out (of'A'isha's apartment for prayer) supported by two persons. (He was so much weak) that his feet dragged on the ground and he was being supported by 'Abbas b. 'Abd al-Muttalib and another person. 'Ubaidullah said: I informed 'Abdullah (b. 'Abbas) about that which 'A'isha had said. 'Abdullah b. 'Abbas said: Do you know the man whose name 'A'isha did not mention? He said: No. Ibn 'Abbas said: It was 'Ali.",
      "chain": [
        "30489",
        "36033",
        "11207",
        "11013",
        "11004"
      ]
    },
    {
      "hadith_no": "418",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الملك بن شعيب بن الليث، حدثني أبي، عن جدي، حدثني عقيل بن خالد، قال قال ابن شهاب أخبرني عبيد الله بن عبد الله بن عتبة بن مسعود، أن عائشة، زوج النبي صلى الله عليه وسلم قالت لقد راجعت رسول الله صلى الله عليه وسلم في ذلك وما حملني على كثرة مراجعته إلا أنه لم يقع في قلبي أن يحب الناس بعده رجلا قام مقامه أبدا وإلا أني كنت أرى أنه لن يقوم مقامه أحد إلا تشاءم الناس به فأردت أن يعدل ذلك رسول الله صلى الله عليه وسلم عن أبي بكر ‏.‏",
      "text_en": " 'A'isha, the wife of the Apostle of Allah (may peace be upon him), said:                      I tried to dissuade the Messenger of Allah (may peace be upon him) from it (i. e. from appointing Abu Bakr as the Imam.) and my insistence upon it was not due to the fact that I entertained any apprehension in my mind that the people would not love the man who would occupy his (Prophet's) place (i. e. who would be appointed as his caliph) and I feared that the people would be superstitious about one who would occupy his place. I, therefore, desired that the Messenger of Allah (may peace be upon him) should leave Abu Bakr aside in this matter.",
      "chain": [
        "30489",
        "36033",
        "11207",
        "11013",
        "11004"
      ]
    },
    {
      "hadith_no": "467",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "وحدثنا عبد الملك بن شعيب بن الليث، حدثني أبي، حدثني الليث بن سعد، حدثني يونس، عن ابن شهاب، حدثني أبو بكر بن عبد الرحمن، أنه سمع أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏.‏ بمثله غير أنه قال - بدل السقيم - الكبير ‏.‏",
      "text_en": " Abu Bakr b. 'Abd al-Rahman reported that he had heard Abu Huraira say that the Messenger of Allah (may peace be upon him) said like it, but he substituted\" the aged\" for 'the infirm\".",
      "chain": [
        "30489",
        "36033",
        "20023",
        "20475",
        "11013",
        "11003",
        "13"
      ]
    },
    {
      "hadith_no": "515",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثني حرملة بن يحيى، أخبرنا ابن وهب، أخبرني يونس، ح قال وحدثني عبد الملك بن شعيب بن الليث، وحدثني أبي، عن جدي، قال حدثني عقيل بن خالد، كلاهما عن ابن شهاب، عن سعيد بن المسيب، وأبي، سلمة عن أبي هريرة، عن النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " A hadith like this has been narrated by Abu Huraira with another chain of transmitters.",
      "chain": [
        "30487",
        "20029",
        "20475",
        "30489",
        "36033",
        "11207",
        "11013",
        "11002",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1476",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني عبد الملك بن شعيب بن الليث، حدثني أبي، عن جدي، عن عقيل، عن ابن شهاب، بهذا الإسناد ‏.‏ مثله ‏.‏ ولم يذكر قول الزهري وذكر لي ‏.‏ وما بعده ‏.‏",
      "text_en": " A hadith like this has been narrated by Ibn Shihab with the same chain of transmitters, but therein no mention has been made of the words of al-Zuhri:                      It was narrated to me, and that which followed.",
      "chain": [
        "30489",
        "36033",
        "11207"
      ]
    },
    {
      "hadith_no": "2003",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "وحدثني عبد الملك بن شعيب بن الليث، حدثني أبي، عن جدي، حدثني عقيل بن، خالد عن ابن شهاب، عن عمر بن عبد العزيز، عن عبد الله بن إبراهيم بن قارظ، وعن ابن المسيب، أنهما حدثاه أن أبا هريرة قال سمعت رسول الله صلى الله عليه وسلم يقول ‏.‏ بمثله ‏.‏",
      "text_en": " A hadith like this has been narrated by Abu Huraira by another chain of transmitters.",
      "chain": [
        "30489",
        "36033",
        "11207",
        "11013",
        "11010",
        "10888",
        "13"
      ]
    },
    {
      "hadith_no": "2234",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثني عبد الملك بن شعيب بن الليث، حدثني أبي، عن جدي، قال حدثني عقيل، بن خالد عن ابن شهاب، أنه قال حدثني رجال، عن أبي هريرة، عن النبي صلى الله عليه وسلم ‏.‏ بمثل حديث معمر وقال ‏\"‏ ومن اتبعها حتى تدفن ‏\"‏ ‏.‏",
      "text_en": " This hadith is narrated on thp authority of Abu Huraira through another chain of transmitters (with these words):                     \" He who followed it (the bier) till he (the dead) is buried.\"",
      "chain": [
        "30489",
        "36033",
        "11207",
        "11013",
        "13"
      ]
    },
    {
      "hadith_no": "2248",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثني عبد الملك بن شعيب بن الليث، حدثني أبي، عن جدي، قال حدثني عقيل، بن خالد عن ابن شهاب، عن سعيد بن المسيب، وأبي، سلمة بن عبد الرحمن أنهما حدثاه عن أبي هريرة، أنه قال نعى لنا رسول الله صلى الله عليه وسلم النجاشي صاحب الحبشة في اليوم الذي مات فيه فقال ‏\"‏ استغفروا لأخيكم ‏\"‏ ‏.‏ قال ابن شهاب وحدثني سعيد بن المسيب أن أبا هريرة حدثه أن رسول الله صلى الله عليه وسلم صف بهم بالمصلى فصلى فكبر عليه أربع تكبيرات ‏.‏",
      "text_en": " Abu Huraira reported:                      The Messenger of Allah (may peace be upon him) gave us the news of the death of Negus, the ruler of Abyssinia, on the day when he died, and he said (to us): Beg pardon for your brother. Ibn Shihab said that Sa'id b. Musayyib had told that Abu Huraira had narrated to him that the Messenger of Allah (may peace be upon him) drew them up in a row in a place of prayer, and offered prayer and recited four takbirs for him.",
      "chain": [
        "30489",
        "36033",
        "11207",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "2969",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا عبد الملك بن شعيب بن الليث، حدثني أبي، عن جدي، حدثني عقيل بن، خالد عن ابن شهاب، عن عروة بن الزبير، عن عائشة، زوج النبي صلى الله عليه وسلم أنها قالت خرجنا مع رسول الله صلى الله عليه وسلم عام حجة الوداع فمنا من أهل بعمرة ومنا من أهل بحج حتى قدمنا مكة فقال رسول الله صلى الله عليه وسلم ‏\"‏ من أحرم بعمرة ولم يهد فليحلل ومن أحرم بعمرة وأهدى فلا يحل حتى ينحر هديه ومن أهل بحج فليتم حجه ‏\"‏ ‏.‏ قالت عائشة - رضى الله عنها - فحضت فلم أزل حائضا حتى كان يوم عرفة ولم أهلل إلا بعمرة فأمرني رسول الله صلى الله عليه وسلم أن أنقض رأسي وأمتشط وأهل بحج وأترك العمرة - قالت - ففعلت ذلك حتى إذا قضيت حجتي بعث معي رسول الله صلى الله عليه وسلم عبد الرحمن بن أبي بكر وأمرني أن أعتمر من التنعيم مكان عمرتي التي أدركني الحج ولم أحلل منها ‏.‏",
      "text_en": " 'A'isha, the wife of the Apostle of Allah (may peace be upon him), said:                      We went out with the Messenger of Allah (may peace be upon him) during the year of the Farewell Pilgrimage. There were some amongst us who had put on IHram for Umra and there were some who had put on Ihram for Hajj. (We proceeded on till) we came to Mecca. The Messenger of Allah (may peace be upon him) said: He who put on Ihram for 'Umra but did not bring the sacrificial animal with him should put it off. and he who put on Ihram for Umra and he who had brought the sacrificial animal with him should not put it off until he had slaughtered the animal; and he who put on lhram for Hajj should complete it. A'isha (Allah be pleased with her) said: I was in the monthlyperiod, and I remained In this state till the day of 'Arafa, and I had entered into the state of Ihram for 'Umra. The Messenger of Allah (may peace be upon him) thus commanded me to undo my hair and comb them (again) and enter into the state of Ihram for Hajj, and abandon (the rites of 'Umra). She ('A'isha) said: I did so, and when I had completed my Pilgrimage, the Messenger of Allah (may peace be upon him) sent with me 'Abd al-Rabman b. Abu Bakr and commanded me to (resume the rites of) 'Umra at Tan'im. the place where (I abandoned) 'Umra and put on Ihram for Hajj (before completing Umra).",
      "chain": [
        "30489",
        "36033",
        "11207",
        "11013",
        "10511"
      ]
    },
    {
      "hadith_no": "3041",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا عبد الملك بن شعيب بن الليث، حدثني أبي، عن جدي، حدثني عقيل بن، خالد عن ابن شهاب، عن سالم بن عبد الله، أن عبد الله بن عمر، - رضى الله عنهما - قال تمتع رسول الله صلى الله عليه وسلم في حجة الوداع بالعمرة إلى الحج وأهدى فساق معه الهدى من ذي الحليفة وبدأ رسول الله صلى الله عليه وسلم فأهل بالعمرة ثم أهل بالحج وتمتع الناس مع رسول الله صلى الله عليه وسلم بالعمرة إلى الحج فكان من الناس من أهدى فساق الهدى ومنهم من لم يهد فلما قدم رسول الله صلى الله عليه وسلم مكة قال للناس ‏\"‏ من كان منكم أهدى فإنه لا يحل من شىء حرم منه حتى يقضي حجه ومن لم يكن منكم أهدى فليطف بالبيت وبالصفا والمروة وليقصر وليحلل ثم ليهل بالحج وليهد فمن لم يجد هديا فليصم ثلاثة أيام في الحج وسبعة إذا رجع إلى أهله ‏\"‏ ‏.‏ وطاف رسول الله صلى الله عليه وسلم حين قدم مكة فاستلم الركن أول شىء ثم خب ثلاثة أطواف من السبع ومشى أربعة أطواف ثم ركع - حين قضى طوافه بالبيت عند المقام - ركعتين ثم سلم فانصرف فأتى الصفا فطاف بالصفا والمروة سبعة أطواف ثم لم يحلل من شىء حرم منه حتى قضى حجه ونحر هديه يوم النحر وأفاض فطاف بالبيت ثم حل من كل شىء حرم منه وفعل مثل ما فعل رسول الله صلى الله عليه وسلم من أهدى وساق الهدى من الناس ‏.‏",
      "text_en": "  Abdullah b. 'Umar (Allah be pleased with them) reported:                      Allah's Messenger (may peace be upon him) observed Tamattu' in Hajjat-ul-Wada'. He first put on Ihram for 'Umra and then for Hajj. and then offered animal sacrifice. So he drove the sacrificial animals with him from Dhu'l-Hulaifa. Allah's Messenger (may peace be upon him) commenced Ihram of Umra and thus pronounced Talbiya for 'Umra. and then (put on Ihram for Hajj) and pronounced Talbiya for Hajj. And the people performed Tamattu' in the company of Allah's Messenger (may peace be upon him). They put on Ihram for Umra (first) and then for Hajj. Some of them had sacrificial animals which they had brought with them, whereas some of them had none to sacrifice. So when Allah's Messenger (may peace be upon him) came to Mecca, he said to the people: He who amongst you has brought sacrificial animals along with him must not treat as lawful anything which has become unlawful for him till he has completed the Hajj; and he, who amongst you has not brought the sacrificial animals should circumambulate the House, and run between al-Safa' and al-Marwa and clip (his hair) and put off the Ihram, and then again put on the Ihram for Hajj and offer sacrifice of animals. But he who does not find the sacrificial animal, he should observe fast for three days during the Hajj and for seven days when he returns to his family. Allah's Messenger (may peace be upon him) circumambulated (the House) when he came to Mecca: he first kissed the corner (of the Ka'ba containing the Black Stone), then ran in three circuits out of seven and walked in four circuits. And then when he had finished the circumambulation of the House he observed two rak'ahs of prayer at the Station (of Ibrahim), and then pronounced Salaam (for concluding the rak'ahs), and departed and came to al-Safa' and ran seven times between al-Safa' and al-Marwa. After that he did not treat anything as lawful which had become unlawful till he had completed his Hajj and sacrificed his animal on the day of sacrifice (10th of Dhu'l-Hijja). and then went back quickly (to Mecca) and performed circumambulation of the House (known as tawaf ifada) after which all that was unlawful for him became lawful; and those who had brought the sacrificial animals along with them did as Allah's Messenger (may peace be upon him) had done",
      "chain": [
        "30489",
        "36033",
        "11207",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "3433",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني عبد الملك بن شعيب بن الليث، حدثني أبي، عن جدي، حدثني عقيل بن، خالد عن ابن شهاب، أنه قال أخبرني سعيد بن المسيب، أن أبا هريرة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ يتركون المدينة على خير ما كانت لا يغشاها إلا العوافي - يريد عوافي السباع والطير - ثم يخرج راعيان من مزينة يريدان المدينة ينعقان بغنمهما فيجدانها وحشا حتى إذا بلغا ثنية الوداع خرا على وجوههما ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) heard Allah's Messenger (may peace be upon him) say:                      They (the residents of) Medina will abandon Medina whereas it is good for them and it will be haunted by beasts and birds, and two shepherds will come out from Muzainah intending (to go) towards Medina and tending their herd, and will find nothing but wilderness there until when they will reach the mountain path of Wada, they will fall down on their faces.",
      "chain": [
        "30489",
        "36033",
        "11207",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "3516",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "حدثنا عبد الملك بن شعيب بن الليث، حدثني أبي، عن جدي، حدثني خالد بن يزيد، حدثني سعيد بن أبي هلال، عن نبيه بن وهب، أن عمر بن عبيد الله بن معمر، أراد أن ينكح، ابنه طلحة بنت شيبة بن جبير في الحج وأبان بن عثمان يومئذ أمير الحاج فأرسل إلى أبان إني قد أردت أن أنكح، طلحة بن عمر فأحب أن تحضر، ذلك ‏.‏ فقال له أبان ألا أراك عراقيا جافيا إني سمعت عثمان بن عفان يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ لا ينكح المحرم ‏\"‏ ‏.‏",
      "text_en": " Nabaih b. Wahb reported that Umar b. 'Ubaidullah b. Ma'mar intended to marry his son Talha with the daughter of Shaiba b. Jubair during the Pilgrimage. Aban b. Uthman was at that time the Amir of Pilgrims. So he ('Umar b. Ubaidullah) sent someone (as a messenger) to Aban saying:                      I intend to marry Talha b. 'Umar and I earnestly desire you to be present there (in this ceremony of marriage). Aban said to him: I find you a block-headed 'Iraqi. I heard 'Uthman b. 'Affan say that Allah's Messenger (may peace be upon him) said: A Muhrim should not marry.",
      "chain": [
        "30489",
        "36033",
        "11408",
        "11169"
      ]
    },
    {
      "hadith_no": "3678",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "حدثني عبد الملك بن شعيب بن الليث، حدثني أبي، عن جدي، حدثني عقيل بن، خالد عن ابن شهاب، أنه قال أخبرني أبو عبيدة بن عبد الله بن زمعة، أن أمه، زينب بنت أبي سلمة أخبرته أن أمها أم سلمة زوج النبي صلى الله عليه وسلم كانت تقول أبى سائر أزواج النبي صلى الله عليه وسلم أن يدخلن عليهن أحدا بتلك الرضاعة وقلن لعائشة والله ما نرى هذا إلا رخصة أرخصها رسول الله صلى الله عليه وسلم لسالم خاصة فما هو بداخل علينا أحد بهذه الرضاعة ولا رائينا.",
      "text_en": " Umm Salama, the wife of Allah's Apostle (may peace be upon him), used to say that all wives of Allah's Apostle (may peace be upon him) disclaimed the idea that one with this type of fosterage (having been suckled after the proper period) should come to them. and said to 'A'isha:                      By Allah, we do not find this but a sort of concession given by Allah's Messenger (may peace be upon him) only for Salim, and no one was ging to be allowed to enter (our houses) with this type of fosterage and we do not subscribe to this view.",
      "chain": [
        "30489",
        "36033",
        "11207",
        "11013",
        "244"
      ]
    },
    {
      "hadith_no": "4243",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Rules of Inheritance - كتاب الفرائض",
      "chapter_no": "24",
      "text_ar": "حدثنا عبد الملك بن شعيب بن الليث، حدثني أبي، عن جدي، حدثني عقيل، ح وحدثني زهير بن حرب، حدثنا يعقوب بن إبراهيم، حدثنا ابن أخي ابن شهاب، ح وحدثنا ابن نمير، حدثنا أبي، حدثنا ابن أبي ذئب، كلهم عن الزهري، بهذا الإسناد هذا الحديث ‏.‏",
      "text_en": " This hadith has been narrated on the authority of al-Zuhri through another chain of transmitters.",
      "chain": [
        "30489",
        "36033",
        "11207",
        "30022",
        "20184",
        "20176",
        "30212",
        "20331",
        "20177"
      ]
    },
    {
      "hadith_no": "4295",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Bequests - كتاب الوصية",
      "chapter_no": "26",
      "text_ar": "وحدثنيه أبو الطاهر، وحرملة، قالا أخبرنا ابن وهب، أخبرني يونس، ح وحدثني عبد الملك بن شعيب بن الليث، حدثني أبي، عن جدي، حدثني عقيل، ح وحدثنا ابن أبي عمر، وعبد بن حميد قالا حدثنا عبد الرزاق، أخبرنا معمر، كلهم عن الزهري، بهذا الإسناد ‏.‏ نحو حديث عمرو بن الحارث ‏.‏",
      "text_en": "  This hadith has been narrated on the authority of Zuhri with the same chain of transmitters.",
      "chain": [
        "30487",
        "20029",
        "20475",
        "30489",
        "36033",
        "11207",
        "30421",
        "30553",
        "20121"
      ]
    },
    {
      "hadith_no": "4344",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "وحدثني عبد الملك بن شعيب بن الليث، حدثني أبي، عن جدي، حدثني عقيل بن، خالد ح وحدثنا إسحاق بن إبراهيم، وعبد بن حميد، قالا حدثنا عبد الرزاق، أخبرنا معمر، كلاهما عن الزهري، بهذا الإسناد ‏.‏ مثله غير أن في حديث عقيل ما حلفت بها منذ سمعت رسول الله صلى الله عليه وسلم ينهى عنها ولا تكلمت بها ‏.‏ ولم يقل ذاكرا ولا آثرا ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Zuhri except that in the hadith narrated on the authority of Uqail the words are:                     \" I did not take oath by (anyone else except Allah) since I heard Allah's Messenger forbidding it. nor did I speak in such terms, and the narrator did not say,\" on my own behalf or on behalf of someone else\".",
      "chain": [
        "30489",
        "36033",
        "11207",
        "30123",
        "30553",
        "20121"
      ]
    },
    {
      "hadith_no": "4664",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "وحدثنا عبد الملك بن شعيب بن الليث، حدثني أبي، عن جدي، قال حدثني عقيل، بن خالد عن ابن شهاب، عن سالم، عن عبد الله، أن رسول الله صلى الله عليه وسلم قد كان ينفل بعض من يبعث من السرايا لأنفسهم خاصة سوى قسم عامة الجيش والخمس في ذلك واجب كله ‏.‏",
      "text_en": " It has been narrated on the authority of Abdullah b. 'Umar that the Messenger of Allah (may peace be upon him) used to give (from the spoils of war) to small troops seat on expeditions something more than the due share of each fighter in a large force. And Khums (one-fifth of the total spoils) was to be reserved (for Allah and His Apostle) in all cases.",
      "chain": [
        "30489",
        "36033",
        "11207",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "5150",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثنا عبد الملك بن شعيب بن الليث، حدثنا أبي، عن جدي، حدثني خالد بن، يزيد حدثني سعيد بن أبي هلال، عن ابن المنكدر، أن أبا أمامة بن سهل، أخبره عن ابن، عباس قال أتي رسول الله صلى الله عليه وسلم وهو في بيت ميمونة وعنده خالد بن الوليد بلحم ضب ‏.‏ فذكر بمعنى حديث الزهري ‏.‏",
      "text_en": " Ibn 'Abbas reported that there had been brought to Allah's Messenger (may peace be upon him) the flesh of a lizard and Khalid b. Walid was also present there. The rest of the hadith is the same.",
      "chain": [
        "30489",
        "36033",
        "11408",
        "11169",
        "11048",
        "15659",
        "17"
      ]
    },
    {
      "hadith_no": "5799",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثنا عبد الملك بن شعيب بن الليث، حدثني أبي، عن جدي، حدثني عقيل بن، خالد عن ابن شهاب، عن عروة بن الزبير، عن عائشة، أن أزواج، رسول الله صلى الله عليه وسلم كن يخرجن بالليل إذا تبرزن إلى المناصع وهو صعيد أفيح وكان عمر بن الخطاب يقول لرسول الله صلى الله عليه وسلم احجب نساءك ‏.‏ فلم يكن رسول الله صلى الله عليه وسلم يفعل فخرجت سودة بنت زمعة زوج النبي صلى الله عليه وسلم ليلة من الليالي عشاء وكانت امرأة طويلة فناداها عمر ألا قد عرفناك يا سودة ‏.‏ حرصا على أن ينزل الحجاب ‏.‏ قالت عائشة فأنزل الله عز وجل الحجاب ‏.‏",
      "text_en": " 'A'isha reported that the wives of Allah's Messenger (may peace be upon him) used to go out in the cover of night when they went to open fields (in the outskirts of Medina) for easing themselves. 'Umar b Khattab used to say:                      Allah's Messenger, ask your ladies to observe veil, but Allah's Messenger (may peace be upon him) did not do that. So there went out Sauda, daughter of Zarn'a, the wife of Allah's Messenger (may peace be upon him), during one of the nights when it was dark. She was a tall statured lady. 'Umar called her saying: Sauda, we recognise you. (He did this with the hope that the verses pertaining to veil would be revealed.) 'A'isha said: Allah, the Exalted and Glorious, then revealed the verses pertaining to veil.",
      "chain": [
        "30489",
        "36033",
        "11207",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "5932",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "وحدثني عبد الملك بن شعيب بن الليث، حدثني أبي، عن جدي، حدثني عقيل بن، خالد ح وحدثنيه عبد الله بن عبد الرحمن الدارمي، أخبرنا أبو اليمان، أخبرنا شعيب، كلاهما عن الزهري، بهذا الإسناد ‏.‏ مثله ‏.‏ وفي حديث عقيل عن رسول الله صلى الله عليه وسلم ‏.‏ ولم يقل سمعت ‏.‏ وفي حديث شعيب قال سمعت النبي صلى الله عليه وسلم كما قال معمر ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Zuhri with the same chain of transmitters but with a slight variation of wording.",
      "chain": [
        "30489",
        "36033",
        "11207",
        "30330"
      ]
    },
    {
      "hadith_no": "6238",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثني عبد الملك بن شعيب بن الليث، حدثني أبي، عن جدي، قال حدثني عقيل، بن خالد عن ابن شهاب، عن عروة، عن عائشة، أن رسول الله صلى الله عليه وسلم توفي وهو ابن ثلاث وستين سنة ‏.‏ وقال ابن شهاب أخبرني سعيد بن المسيب بمثل ذلك ‏.‏",
      "text_en": " 'A'isha reported that Allah's Messenger (may peace be upon him) died when he had attained the age of sixty-three. And a hadith like this had been transmitted on the authority of Sa'id b. Musayyib.",
      "chain": [
        "30489",
        "36033",
        "11207",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "6253",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثني عبد الملك بن شعيب بن الليث، قال حدثني أبي، عن جدي، حدثني عقيل، ح وحدثنا عبد بن حميد، أخبرنا عبد الرزاق، أخبرنا معمر، ح وحدثنا عبد الله بن عبد، الرحمن الدارمي أخبرنا أبو اليمان، أخبرنا شعيب، كلهم عن الزهري، بهذا الإسناد ‏.‏ وفي حديث شعيب ومعمر سمعت رسول الله صلى الله عليه وسلم ‏.‏ وفي حديث عقيل قال قلت للزهري وما العاقب قال الذي ليس بعده نبي ‏.‏ وفي حديث معمر وعقيل الكفرة ‏.‏ وفي حديث شعيب الكفر ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Ma'mar (and the words are):                      I said to Zuhri: What does (the word) al-'Aqib imply? He said: One after whom there is no Prophet, and in the hadith transmitted on the authority of Ma'mar and 'Uqail there is a slight variation of wording.",
      "chain": [
        "30489",
        "36033",
        "11207",
        "30553",
        "20121",
        "20115",
        "30025",
        "30330"
      ]
    },
    {
      "hadith_no": "6335",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "وحدثني عبد الملك بن شعيب بن الليث، حدثني أبي، عن جدي، حدثني عقيل بن، خالد عن ابن شهاب، بهذا الإسناد ‏.‏ قصة الشاة والذئب ولم يذكر قصة البقرة ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Ibn Shihab with the same chain of transmitters, but there is no mention of the story pertaining to the ox.",
      "chain": [
        "30489",
        "36033",
        "11207"
      ]
    },
    {
      "hadith_no": "6344",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "وحدثني عبد الملك بن شعيب بن الليث، حدثني أبي، عن جدي، حدثني عقيل بن، خالد ح وحدثنا عمرو الناقد، والحلواني، وعبد بن حميد، عن يعقوب بن إبراهيم بن سعد، حدثنا أبي، عن صالح، بإسناد يونس نحو حديثه ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Yunus through another chain of transmitters.",
      "chain": [
        "30489",
        "36033",
        "11207",
        "30263",
        "30115",
        "30553",
        "20184",
        "20150"
      ]
    },
    {
      "hadith_no": "6550",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا عبد الملك بن شعيب بن الليث، حدثني أبي، عن جدي، حدثني خالد بن يزيد، حدثني سعيد بن أبي هلال، عن عمارة بن غزية، عن محمد بن إبراهيم، عن أبي سلمة، بن عبد الرحمن عن عائشة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ اهجوا قريشا فإنه أشد عليها من رشق بالنبل ‏\"‏ ‏.‏ فأرسل إلى ابن رواحة فقال ‏\"‏ اهجهم ‏\"‏ ‏.‏ فهجاهم فلم يرض فأرسل إلى كعب بن مالك ثم أرسل إلى حسان بن ثابت فلما دخل عليه قال حسان قد آن لكم أن ترسلوا إلى هذا الأسد الضارب بذنبه ثم أدلع لسانه فجعل يحركه فقال والذي بعثك بالحق لأفرينهم بلساني فرى الأديم ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تعجل فإن أبا بكر أعلم قريش بأنسابها - وإن لي فيهم نسبا - حتى يلخص لك نسبي ‏\"‏ ‏.‏ فأتاه حسان ثم رجع فقال يا رسول الله قد لخص لي نسبك والذي بعثك بالحق لأسلنك منهم كما تسل الشعرة من العجين ‏.‏ قالت عائشة فسمعت رسول الله صلى الله عليه وسلم يقول لحسان ‏\"‏ إن روح القدس لا يزال يؤيدك ما نافحت عن الله ورسوله ‏\"‏ ‏.‏ وقالت سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ هجاهم حسان فشفى واشتفى ‏\"‏ ‏.‏ قال حسان هجوت محمدا فأجبت عنه وعند الله في ذاك الجزاء هجوت محمدا برا تقيا رسول الله شيمته الوفاء فإن أبي ووالده وعرضي لعرض محمد منكم وقاء ثكلت بنيتي إن لم تروها تثير النقع من كنفى كداء يبارين الأعنة مصعدات على أكتافها الأسل الظماء تظل جيادنا متمطرات تلطمهن بالخمر النساء فإن أعرضتمو عنا اعتمرنا وكان الفتح وانكشف الغطاء وإلا فاصبروا لضراب يوم يعز الله فيه من يشاء وقال الله قد أرسلت عبدا يقول الحق ليس به خفاء وقال الله قد يسرت جندا هم الأنصار عرضتها اللقاء لنا في كل يوم من معد سباب أو قتال أو هجاء فمن يهجو رسول الله منكم ويمدحه وينصره سواء وجبريل رسول الله فينا وروح القدس ليس له كفاء",
      "text_en": " 'A'isha reported that Allah's Messenger (may peace be uport him) said. Satirise against the (non-believing amongst the) Quraish, for (the satire) is more grievous to them than the hurt of an arrow. So he (the Holy Prophet) sent (someone) to Ibn Rawiha and asked him to satirise against them, and he composed a satire, but it did not appeal to him (to the Holy Prophet). He then sent (someone) to Ka'b b. Malik (to do the same, but what he composed did not appeal to the Holy Prophet). He then sent one to Hassan b. Thabit. As he got into his presence, Hassan said:                      Now you have called for this lion who strikes (the enemies) with his tail. He then brought out his tongue and began to move it and said: By Him Who has sent you with Truth, I shall tear them with my tongue as the leather is torn. Thereupon Allah's Messenger (may peace be upon him) said: Don't be hasty; (let) Abu Bakr who has the best know- ledge of the lineage of the Quraish draw a distinction for you in regard to my lineage, as my lineage is thesame as theirs. Hassan then came to him (Abu Bakr) and after making inquiry (in regard to the lineage of the Holy Prophet) came back to him (the holy Prophet) and said: Allah's Messenger, he (Abu Bakr) has drawn a distinction in vour lineage (and that of the Quraish) By Him Who has sent you with Truth, I shall draw out from them (your name) as hair is drawn out from the flour. 'A'isha said: I heard Allah's Messenger (may peace be upon him) as saying to Hassin: Verily Ruh-ul- Qudus would continue to help you so long as you put up a defence on behalf of Allah and His Messenger. And she said: I heard Allah's Messenger (may peace be upon him) saying: Hassan satirised against them and gave satisfaction to the (Muslims) and disquieted (the non-Muslims). You satirised Muhammad, but I replied on his behalf, And there is reward with Allah for this. You satirised Muhammad. virtuous, righteous, The Apostle of Allah, whose nature is truthfulness. So verily my father and his father and my honour Are a protection to the honour of Muhammad; May I lose my dear daughter, if you don't see her, Wiping away the dust from the two sides of Kada', They pull at the rein, going upward; On their shoulders are spears thirsting (for the blood of the enemy) ; our steeds are sweating-our women wipe them with their mantles. If you had not interfered with us, we would have performed the 'Umra, And (then) there was the Victory, and the darkness cleared away. Otherwise wait for the fighting on the day in which Allah will honour whom He pleases. And Allah said: I have sent a servant who says the Truth in which there is no ambiguity; And Allah said: I have prepared an army-they are the Ansar whose object is fighting (the enemy), There reaches every day from Ma'add abuse, or fighting or satire; Whoever satirises the Apostle from amongst you, or praises him and helps it is all the same, And Gabriel, the Apostle of Allah is among us, and the Holy Spirit who has no match.",
      "chain": [
        "30489",
        "36033",
        "11408",
        "11169",
        "11894",
        "11213",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "6688",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "وحدثني عبد الملك بن شعيب بن الليث، حدثني أبي، عن جدي، حدثني عقيل بن، خالد قال قال ابن شهاب أخبرني أنس بن مالك، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من أحب أن يبسط له في رزقه وينسأ له في أثره فليصل رحمه ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik reported that Allah's Messenger (may peace be upon him) said:                      He who likes that his sustenance should be expanded and his age may be lengthened should join the tie of kinship.",
      "chain": [
        "30489",
        "36033",
        "11207",
        "11013",
        "19"
      ]
    },
    {
      "hadith_no": "7235",
      "source": " Sahih Muslim ",
      "chapter": "The Book Giving Description of the Day of Judgement; Paradise and Hell - كتاب صفة القيامة والجنة والنار",
      "chapter_no": "53",
      "text_ar": "حدثنا عبد الملك بن شعيب بن الليث، حدثني أبي، عن جدي، حدثني خالد بن يزيد، عن سعيد بن أبي هلال، عن زيد بن أسلم، عن عطاء بن يسار، عن أبي سعيد الخدري، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ تكون الأرض يوم القيامة خبزة واحدة يكفؤها الجبار بيده كما يكفأ أحدكم خبزته في السفر نزلا لأهل الجنة ‏\"‏ ‏.‏ قال فأتى رجل من اليهود فقال بارك الرحمن عليك أبا القاسم ألا أخبرك بنزل أهل الجنة يوم القيامة قال ‏\"‏ بلى ‏\"‏ ‏.‏ قال تكون الأرض خبزة واحدة - كما قال رسول الله صلى الله عليه وسلم - قال فنظر إلينا رسول الله صلى الله عليه وسلم ثم ضحك حتى بدت نواجذه قال ألا أخبرك بإدامهم قال ‏\"‏ بلى ‏\"‏ ‏.‏ قال إدامهم بالام ونون ‏.‏ قالوا وما هذا قال ثور ونون يأكل من زائدة كبدهما سبعون ألفا ‏.‏",
      "text_en": " Abu al-Sa'id Khudri reported Allah's Messenger (may peace be upon him) as saying that the earth would turn to be one single bread on the Day of Resurrection and the Almighty would turn it in His hand as one of you turns a loaf while on a journey. It would be a feast arranged in the honour of the people of Paradise. He (the narrator) further narrated that a person from among the Jews came and he said:                      Abu al-Qasim, may the Compassionate Lord be pleased with you! May I inform you about the feast arranged in honour of the people of Paradise on the Day of Resurrection? He said: Do it, of course. He said: The earth would become one single bread. Then Allah's Messenger (may peace be upon him) looked towards us and laughed until his molar teeth became visible. He then again said: May I inform you about that with which they would season it? He said: Do it, of course. He said: Their seasoning would be balim and fish. The Companions of the Holy Prophet (may peace be upon him) said: What is this balam? He said: Ox and fish from whose excessive livers seventy thousand people would be able to eat.",
      "chain": [
        "30489",
        "36033",
        "11408",
        "11169",
        "11163",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "7419",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "وحدثني عبد الملك بن شعيب بن الليث، حدثني أبي، عن جدي، حدثني عقيل بن، خالد ح وحدثنا عمرو الناقد، حدثنا يعقوب بن إبراهيم بن سعد، حدثنا أبي، عن صالح، كلاهما عن ابن شهاب، بمثل حديث يونس عن الزهري، بإسناده ‏.‏",
      "text_en": " This hadith has been narrated oil the authority of Zuhri with a different chain of transmitters.",
      "chain": [
        "30489",
        "36033",
        "11207",
        "30263",
        "20184",
        "20150"
      ]
    },
    {
      "hadith_no": "329",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عبد الملك بن شعيب بن الليث، أخبرنا أبي، عن جدي، عن جعفر بن ربيعة، عن عبد الرحمن بن هرمز، عن عمير، مولى ابن عباس أنه سمعه يقول أقبلت أنا وعبد الله بن يسار، مولى ميمونة زوج النبي صلى الله عليه وسلم حتى دخلنا على أبي الجهيم بن الحارث بن الصمة الأنصاري فقال أبو الجهيم أقبل رسول الله صلى الله عليه وسلم من نحو بئر جمل فلقيه رجل فسلم عليه فلم يرد رسول الله صلى الله عليه وسلم عليه السلام حتى أتى على جدار فمسح بوجهه ويديه ثم رد عليه السلام ‏.‏",
      "text_en": " 'Umair, the freed slave of Ibn 'Abbas, said that he heard him say:                      I and 'Abd Allah b. Yasar, the freed slave of Maimunah, wife of the Prophet (ﷺ), came and entered upon Abu al-Juhaim b. al-Harith b. al-Simmat al-Ansari. Abu al-Juhaim said: The Messenger of Allah (ﷺ) came from Bir Jamal (a place near Medina) and a man met him and saluted him. The Messenger of Allah (ﷺ) did not return the salutation until he came to a wall and wiped his face and hands and then returned the salutation (i.e. after performing tayammum).",
      "chain": [
        "30489",
        "36033",
        "20023",
        "11407",
        "11197",
        "11532",
        "17"
      ]
    },
    {
      "hadith_no": "718",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الملك بن شعيب بن الليث، قال حدثني أبي، عن جدي، عن يحيى بن أيوب، عن محمد بن عمر بن علي، عن عباس بن عبيد الله بن عباس، عن الفضل بن عباس، قال أتانا رسول الله صلى الله عليه وسلم ونحن في بادية لنا ومعه عباس فصلى في صحراء ليس بين يديه سترة وحمارة لنا وكلبة تعبثان بين يديه فما بالى ذلك ‏.‏",
      "text_en": " Narrated Al-Fadl ibn Abbas:                     The Messenger of Allah (ﷺ) came to us accompanied by Abbas when we were in open country belonging to us. He prayed in a desert with no sutrah in front of him, and a she-ass and a bitch of ours were playing in front of him, but he paid no attention to that.",
      "chain": [
        "30489",
        "36033",
        "20379",
        "19942",
        "18496",
        "135"
      ]
    },
    {
      "hadith_no": "738",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الملك بن شعيب بن الليث، حدثني أبي، عن جدي، عن يحيى بن أيوب، عن عبد الملك بن عبد العزيز بن جريج، عن ابن شهاب، عن أبي بكر بن عبد الرحمن بن الحارث بن هشام، عن أبي هريرة، أنه قال كان رسول الله صلى الله عليه وسلم إذا كبر للصلاة جعل يديه حذو منكبيه وإذا ركع فعل مثل ذلك وإذا رفع للسجود فعل مثل ذلك وإذا قام من الركعتين فعل مثل ذلك ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     When the Messenger of Allah (ﷺ) uttered the takbir (Allah is most great) for prayer (in the beginning), he raised his hands opposite to his shoulders; and when he bowed, he did like that; and when he raised his head to prostrate, he did like that; and when he got up at the end of two rak'ahs, he did like that.",
      "chain": [
        "30489",
        "36033",
        "20379",
        "11013",
        "11003",
        "13"
      ]
    },
    {
      "hadith_no": "1364",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الملك بن شعيب بن الليث، حدثني أبي، عن جدي، عن خالد بن يزيد، عن سعيد بن أبي هلال، عن مخرمة بن سليمان، أن كريبا، مولى ابن عباس أخبره أنه، قال ‏:‏ سألت ابن عباس كيف كانت صلاة رسول الله صلى الله عليه وسلم بالليل قال ‏:‏ بت عنده ليلة وهو عند ميمونة، فنام حتى إذا ذهب ثلث الليل أو نصفه استيقظ فقام إلى شن فيه ماء فتوضأ وتوضأت معه، ثم قام فقمت إلى جنبه على يساره فجعلني على يمينه، ثم وضع يده على رأسي كأنه يمس أذني كأنه يوقظني فصلى ركعتين خفيفتين، قلت ‏:‏ فقرأ فيهما بأم القرآن في كل ركعة ثم سلم ثم صلى حتى صلى إحدى عشرة ركعة بالوتر، ثم نام فأتاه بلال فقال ‏:‏ الصلاة يا رسول الله ‏.‏ فقام فركع ركعتين، ثم صلى للناس ‏.‏",
      "text_en": " The client of Ibn 'Abbas said that he asked him:                      How would the Messenger of Allah (ﷺ) pray during the night ? He replied: I spent a night with him when he was with Maimunah. He slept and awoke when half the night or one-third of it had passed. He stood up and went to a leather bad containing water. He performed ablution and I also performed ablution with him. He then stood up and I also stood at his left side. He made me stand at his right side. He then put his hand upon my head, as he was touching my ear and awakening me. He then prayed two light rak'ahs and recited Surah al-Fatihah in each of them, and uttered the salutation. He then prayed eleven rak'ahs observing the witr and slept. Then Bilal came to him and said: Prayer, Messenger of Allah. He got up and prayed two rak'ahs, and then led the people in the prayer.",
      "chain": [
        "30489",
        "36033",
        "11408",
        "11169",
        "11223"
      ]
    },
    {
      "hadith_no": "2746",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا عبد الملك بن شعيب بن الليث، قال حدثني أبي، عن جدي، ح وحدثنا حجاج بن أبي يعقوب، قال حدثني حجين، قال حدثنا الليث، عن عقيل، عن ابن شهاب، عن سالم، عن عبد الله بن عمر، أن رسول الله صلى الله عليه وسلم قد كان ينفل بعض من يبعث من السرايا لأنفسهم خاصة النفل سوى قسم عامة الجيش والخمس في ذلك واجب كله ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     The Messenger of Allah (ﷺ) used to give to some of the detachments he sent out (something extra) for themselves in particular apart from the division made to the whole army. The fifth is necessary in all that.",
      "chain": [
        "30489",
        "36033",
        "20023",
        "11207",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "3394",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا عبد الملك بن شعيب بن الليث، حدثني أبي، عن جدي الليث، حدثني عقيل، عن ابن شهاب، أخبرني سالم بن عبد الله بن عمر، أن ابن عمر، كان يكري أرضه حتى بلغه أن رافع بن خديج الأنصاري حدث أن رسول الله صلى الله عليه وسلم كان ينهى عن كراء الأرض فلقيه عبد الله فقال يا ابن خديج ماذا تحدث عن رسول الله صلى الله عليه وسلم في كراء الأرض قال رافع لعبد الله بن عمر سمعت عمى وكانا قد شهدا بدرا يحدثان أهل الدار أن رسول الله صلى الله عليه وسلم نهى عن كراء الأرض ‏.‏ قال عبد الله والله لقد كنت أعلم في عهد رسول الله صلى الله عليه وسلم أن الأرض تكرى ‏.‏ ثم خشي عبد الله أن يكون رسول الله صلى الله عليه وسلم أحدث في ذلك شيئا لم يكن علمه فترك كراء الأرض ‏.‏ قال أبو داود رواه أيوب وعبيد الله وكثير بن فرقد ومالك عن نافع عن رافع عن النبي صلى الله عليه وسلم ورواه الأوزاعي عن حفص بن عنان عن نافع عن رافع قال سمعت رسول الله صلى الله عليه وسلم وكذلك رواه زيد بن أبي أنيسة عن الحكم عن نافع عن ابن عمر أنه أتى رافعا فقال سمعت رسول الله صلى الله عليه وسلم فقال نعم ‏.‏ وكذا قال عكرمة بن عمار عن أبي النجاشي عن رافع بن خديج قال سمعت النبي عليه السلام ‏.‏ ورواه الأوزاعي عن أبي النجاشي عن رافع بن خديج عن عمه ظهير بن رافع عن النبي صلى الله عليه وسلم ‏.‏ قال أبو داود أبو النجاشي عطاء بن صهيب ‏.‏",
      "text_en": " Narrated Salim bin 'Abdullah b. 'Umar:                     Ibn 'Umar used to let out his land till it reached him that Rafi' b. Khadij al-Ansari narrated that the Messenger of Allah (ﷺ) forbade let out land. So 'Abd Allah (b. 'Umar) said: Ibn Khadij, what do you narrate from the Messenger of Allah (ﷺ) about leasing the land? Rafi' replied to 'Abd Allah b. 'Umar: I heard both of my uncles were present in the battle of Badr say, and they narrated it to the members of the family, that the Messenger of Allah (ﷺ) forbade leasing land. 'Abd Allah said: I swear by Allah, I knew that land was leased in the time of the Messenger of Allah (ﷺ). 'Abd Allah then feared that the Messenger of Allah (ﷺ) might have created something new in that matter, so he gave up leasing land.Abu Dawud said: This tradition has also been transmitted by Ayyub, 'Ubaid Allah, Kathir b. Farqad, Malik from Nafi' on the authority of Rafi' from the Prophet (ﷺ). It has also been transmitted by al-Auzai' from Hafs b. 'Inan al-Hanafi from Nafi' from Rafi' who said: I heard the Messenger of Allah (ﷺ) say: Similarly, it has been transmitted by Zaid b. Abi Unaisah from al-Hakkam from Nafi' from Ibn 'Umar that he went to Rafi' and asked: Have you heard the Messenger of Allah (ﷺ) say? He replied: Yes. Similarly, it has also been transmitted by 'Ikrimah b. 'Ammar from Abu al-Najashi, from Rafi' b. Khadij who said: I heard the Prophet (ﷺ) say. It has also been transmitted by al-Auza'i from Abu al-Najashi from Rafi' b. Khadij from his uncle Zuhair b. Rafi' from the Prophet (ﷺ).Abu Dawud said: The name of Abu al-Najashi is 'Ata b. Suhaib.",
      "chain": [
        "30489",
        "36033",
        "11207",
        "11013",
        "11011",
        "18",
        "1986"
      ]
    },
    {
      "hadith_no": "313",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا الربيع بن سليمان، قال حدثنا شعيب بن الليث، عن أبيه، عن جعفر بن ربيعة، عن عبد الرحمن بن هرمز، عن عمير، مولى ابن عباس أنه سمعه يقول أقبلت أنا وعبد الله بن يسار، مولى ميمونة حتى دخلنا على أبي جهيم بن الحارث بن الصمة الأنصاري فقال أبو جهيم أقبل رسول الله صلى الله عليه وسلم من نحو بئر الجمل ولقيه رجل فسلم عليه فلم يرد رسول الله صلى الله عليه وسلم حتى أقبل على الجدار فمسح بوجهه ويديه ثم رد عليه السلام ‏.‏",
      "text_en": " It was narrated from 'Umair the freed slave of Ibn 'Abbas that he heard him say:                      \"Abdullah bin Yasar the freed slave of Maimunah, and I came and entered upon Abu Juhaim bin Al-Harith bin Al-Sammah Al-Ansari. Abu Juhaim said: 'The Messenger of Allah (ﷺ) came back from the direction of Bi'r Al-jamal and was met by a man who greeted him with Salam, but the Messenger of Allah (ﷺ) did not return the greeting until he turned to the wall and wiped his face and hands, then he returned the greeting.'\"",
      "chain": [
        "30583",
        "36033",
        "20023",
        "11407",
        "11197",
        "11532"
      ]
    },
    {
      "hadith_no": "1260",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا الربيع بن سليمان، قال حدثنا شعيب بن الليث، قال حدثنا الليث، عن محمد بن عجلان، عن محمد بن يوسف، مولى عثمان عن أبيه، يوسف أن معاوية، صلى إمامهم فقام في الصلاة وعليه جلوس فسبح الناس فتم على قيامه ثم سجد سجدتين وهو جالس بعد أن أتم الصلاة ثم قعد على المنبر فقال إني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من نسي شيئا من صلاته فليسجد مثل هاتين السجدتين ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Muhammad bin Yusuf, the freed slave of Uthman, from his father Yusuf, that:                     Mu'awiyah prayed in front of them, and he stood up during the prayer when he should have sat. The people said tasbih, but he remained standing, then he prostrated twice while he was sitting, after he completed the prayer. Then he sat on the Minbar and said: 'I heard the Messenger of Allah (ﷺ) say: 'Whoever forgets something in his prayer, let him prostrate twice like this.'",
      "chain": [
        "30583",
        "36033",
        "20023",
        "10616",
        "30388"
      ]
    },
    {
      "hadith_no": "Grade",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرنا الربيع بن سليمان، قال حدثنا شعيب بن الليث، قال أنبأنا الليث، عن ابن عجلان، عن سمى، عن أبي صالح، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ تقعد الملائكة يوم الجمعة على أبواب المسجد يكتبون الناس على منازلهم فالناس فيه كرجل قدم بدنة وكرجل قدم بقرة وكرجل قدم شاة وكرجل قدم دجاجة وكرجل قدم عصفورا وكرجل قدم بيضة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     The Messenger of Allah (ﷺ) said: \"On Fridays the angels sit at the gates of the masjid writing down the peoples' names in the order in which they come. So the people are like a man who sacrifices a camel and like a man who sacrifices a camel, then like a man who sacrifices a cow and like a man who sacrifices a cow, then like a man who sacrifices a sheep and like a man who sacrifices a sheep, then like a man who sacrifices a chicken and like a man who sacrifices a chicken, then like a man who sacrifices a sparrow and like a man who sacrifices a sparrow, then like a man who sacrifices an egg and like a man who sacrifices an egg.\"",
      "chain": [
        "30583",
        "36033",
        "20023",
        "10616",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "2078",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا الربيع بن سليمان، قال حدثنا شعيب بن الليث، قال حدثنا الليث، عن ابن عجلان، عن أبي الزناد، عن الأعرج، عن أبي هريرة، قال عن رسول الله صلى الله عليه وسلم ‏\"‏ قال الله عز وجل كذبني ابن آدم ولم يكن ينبغي له أن يكذبني وشتمني ابن آدم ولم يكن ينبغي له أن يشتمني أما تكذيبه إياى فقوله إني لا أعيده كما بدأته وليس آخر الخلق بأعز على من أوله وأما شتمه إياى فقوله اتخذ الله ولدا وأنا الله الأحد الصمد لم ألد ولم أولد ولم يكن لي كفوا أحد ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah said:                     \"Allah, the Mighty and Sublinm, says: 'The son of Adam denied Me and he had no right to do so. and the son of Adam reviled Me and he had no right to do so. As for his denying Me, It is his saying that I will not resurrect him as I created him in the beginning, but resurrecting him is not more difficult for Me than creating him in the first place. And as for his reviling Me, it is his saying that Allah has taken a son, but I am Allah, the One, the Self-Sufficient Master, I beget not nor was I begotten, and there is none co-equal or comparable unto Me.\"'",
      "chain": [
        "30583",
        "36033",
        "20023",
        "10616",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "2690",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا أحمد بن يحيى بن الوزير بن سليمان، قال أنبأنا شعيب بن الليث، عن أبيه، عن هشام بن عروة، عن عثمان بن عروة، عن عروة، عن عائشة، قالت كنت أطيب رسول الله صلى الله عليه وسلم عند إحرامه بأطيب ما أجد ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"I used to put perfume on the Messenger of Allah when he entered Ihram, using the best perfume I could find.",
      "chain": [
        "36033",
        "20023",
        "11065",
        "11526",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2943",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرني محمد، وعبد الرحمن، ابنا عبد الله بن عبد الحكم قالا حدثنا شعيب بن الليث، عن أبيه، عن كثير بن فرقد، عن نافع، أن عبد الله بن عمر، كان يخب في طوافه حين يقدم في حج أو عمرة ثلاثا ويمشي أربعا قال وكان رسول الله صلى الله عليه وسلم يفعل ذلك ‏.‏",
      "text_en": " It was narrated from Nafi' that:                     Abdullah bin Umar  used to walk rapidly in three rounds of his Tawaf when he came for Hajj or Umrah, and walk (at a normal pace) in four. He said: \"The Messenger of Allah used to do that.\"",
      "chain": [
        "30213",
        "36033",
        "20023",
        "20170",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3325",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا عبد الملك بن شعيب بن الليث، قال أخبرني أبي، عن جدي، قال حدثني عقيل، عن ابن شهاب، أخبرني أبو عبيدة بن عبد الله بن زمعة، أن أمه، زينب بنت أبي سلمة أخبرته أن أمها أم سلمة زوج النبي صلى الله عليه وسلم كانت تقول أبى سائر أزواج النبي صلى الله عليه وسلم أن يدخل عليهن بتلك الرضاعة وقلن لعائشة والله ما نرى هذه إلا رخصة رخصها رسول الله صلى الله عليه وسلم خاصة لسالم فلا يدخل علينا أحد بهذه الرضاعة ولا يرانا ‏.‏",
      "text_en": " Zainab bint Abu Salamah narrated that her mother Umm Salamah, the wife of the Prophet, used to say:                      \"The rest of the wives of the Prophet refused for anyone to enter upon them on the basis of that type of breast-feeding, meaning breast-feeding of an adult. They said to 'Aishah: 'By Allah, we think that this is a concession which the Messenger of Allah granted only to Salim. No one will enter upon us, nor see us on the basis of this type of breast-feeding.'\"",
      "chain": [
        "30489",
        "36033",
        "11207",
        "11013",
        "244"
      ]
    },
    {
      "hadith_no": "3408",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرني عبد الرحمن بن عبد الله بن عبد الحكم، قال حدثنا شعيب بن الليث، عن أبيه، قال حدثني أيوب بن موسى، عن ابن شهاب، عن عروة، عن عائشة، قالت جاءت امرأة رفاعة القرظي إلى رسول الله صلى الله عليه وسلم فقالت يا رسول الله إني نكحت عبد الرحمن بن الزبير والله ما معه إلا مثل هذه الهدبة ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لعلك تريدين أن ترجعي إلى رفاعة لا حتى يذوق عسيلتك وتذوقي عسيلته ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                      \"The wife of Rifa'ah Al-Qurazi came to the Messenger of Allah and said: 'O Messenger of Allah! I got married to 'Abdur-Rahman bin Az-Zabir, and what he has is like this fringe.' The Messenger of Allah said: 'Perhaps you want to go back to Rifa'ah? No, not until he ('Abdur-Rahman) tastes your sweetness and you taste his sweetness.'\"",
      "chain": [
        "36039",
        "36033",
        "20023",
        "11241",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "3538",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا الربيع بن سليمان، قال حدثنا شعيب بن الليث، عن أبيه، قال حدثنا أيوب، - وهو ابن موسى - قال حميد وحدثتني زينب بنت أبي سلمة، عن أمها أم سلمة، قالت جاءت امرأة من قريش فقالت يا رسول الله إن ابنتي رمدت أفأكحلها ‏.‏ وكانت متوفى عنها ‏.‏ فقال ‏\"‏ ألا أربعة أشهر وعشرا ‏\"‏ ‏.‏ ثم قالت إني أخاف على بصرها فقال ‏\"‏ لا إلا أربعة أشهر وعشرا قد كانت إحداكن في الجاهلية تحد على زوجها سنة ثم ترمي على رأس السنة بالبعرة ‏\"‏ ‏.‏",
      "text_en": " Zainab bint Abi Salamah narrated that her mother Umm Salamah said:                      \"A woman from the Quraish came and said: 'O Messenger of Allah, my daughter's eyes are inflamed; shall I apply kohl to her?' (The daughter's) husband had died so (the Prophet) said: 'Not until four months and ten days (have passed).' Then she said: 'I fear for her sight.' He said: 'No, not until four months and ten days (have passed). During the Jahiliyyah one of you would mourn for her husband for a year, then when one year had passed she would throw a piece of dung.'\"",
      "chain": [
        "30583",
        "36033",
        "20023",
        "11241",
        "11279",
        "244"
      ]
    },
    {
      "hadith_no": "3912",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرني عبد الرحمن بن عبد الله بن عبد الحكم بن أعين، قال حدثنا شعيب بن الليث، عن أبيه، عن كثير بن فرقد، عن نافع، أن عبد الله بن عمر، كان يكري المزارع فحدث أن رافع بن خديج يأثر عن رسول الله صلى الله عليه وسلم أنه نهى عن ذلك‏.‏‏ قال نافع فخرج إليه على البلاط وأنا معه فسأله فقال نعم نهى رسول الله صلى الله عليه وسلم عن كراء المزارع‏.‏‏ فترك عبد الله كراءها‏.‏‏",
      "text_en": " It was narrated from Nafi' that 'Abdullah bin 'Umar used to lease arable land, then he was told that Rafi' bin Khadij narrated from the Messenger of Allah that he forbade that. Nafi' said:                      \"He went out to him (and met him) in Al-Balat, and I was with him. He asked him (about that) and he said: 'Yes, the Messenger of Allah forbade leasing arable land.' So 'Abdullah stopped leasing it.\"",
      "chain": [
        "36033",
        "20023",
        "20170",
        "11014",
        "18",
        "1986"
      ]
    },
    {
      "hadith_no": "3925",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا الربيع بن سليمان، قال حدثنا شعيب بن الليث، عن الليث، عن جعفر بن ربيعة، عن عبد الرحمن بن هرمز، قال سمعت أسيد بن رافع بن خديج الأنصاري، يذكر أنهم منعوا المحاقلة وهي أرض تزرع على بعض ما فيها‏.‏‏ رواه عيسى بن سهل بن رافع‏.‏‏",
      "text_en": " It was narrated that 'Abdur-Rahman bin Hurmuz said:                      \"I heard Usaid bin Rafi' bin Khadij Al-Ansari say that they did not allow Al-Muhaqalah, which is land that is cultivated in return for some of its produce.\"",
      "chain": [
        "30583",
        "36033",
        "20023",
        "11407",
        "11197"
      ]
    },
    {
      "hadith_no": "3930",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا عبد الرحمن بن عبد الله بن عبد الحكم، قال حدثنا شعيب بن الليث، قال حدثنا أبي، عن محمد بن عبد الرحمن، عن نافع، عن ابن عمر، أن النبي صلى الله عليه وسلم دفع إلى يهود خيبر نخل خيبر وأرضها على أن يعملوها بأموالهم وأن لرسول الله صلى الله عليه وسلم شطر ثمرتها‏.‏‏",
      "text_en": " It was narrated from Ibn 'Umar that the Prophet gave the datepalms of Khaibar and their land to the Jews of Khaibar on condition that they would take care of them at their expense, and the Messenger of Allah would have half of their fruits.",
      "chain": [
        "36039",
        "36033",
        "20023",
        "11105",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3931",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا عبد الرحمن بن عبد الله بن عبد الحكم، قال حدثنا شعيب بن الليث، عن أبيه، عن محمد بن عبد الرحمن، عن نافع، أن عبد الله بن عمر، كان يقول كانت المزارع تكرى على عهد رسول الله صلى الله عليه وسلم على أن لرب الأرض ما على ربيع الساقي من الزرع وطائفة من التبن لا أدري كم هو‏.‏‏",
      "text_en": " It was narrated from Nafi' that 'Abdullah bin 'Umar used to say:                      \"Arable land used to be leased out at the time of the Messenger of Allah on condition that the owner of the land would have whatever grew on the banks of the streams and a share of straw, I do not know how much it was.\"",
      "chain": [
        "36039",
        "36033",
        "20023",
        "11105",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "4083",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا محمد بن عبد الله بن عبد الحكم، عن شعيب بن الليث، قال أنبأنا الليث، عن ابن الهاد، عن قهيد بن مطرف الغفاري، عن أبي هريرة، أن رجلا، جاء إلى رسول الله صلى الله عليه وسلم فقال يا رسول الله أرأيت إن عدي على مالي قال ‏\"‏ فانشد بالله ‏\"‏ ‏.‏ قال فإن أبوا على قال ‏\"‏ فانشد بالله ‏\"‏ ‏.‏ قال فإن أبوا على قال ‏\"‏ فانشد بالله ‏\"‏ ‏.‏ قال فإن أبوا على قال ‏\"‏ فقاتل فإن قتلت ففي الجنة وإن قتلت ففي النار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     A man came to the Messenger of Allah [SAW] and said: \"O Messenger of Allah, what do you think if someone comes to steal my wealth?\" He said: \"Urge him by Allah.\" He said: \"What if he persists?\" He said: \"Urge him by Allah.\" He said: \"What if he persists?\" He said: \"Urge him by Allah.\" He said: \"What if he persists?\" He said: \"Then fight. If you are killed you will be in Paradise and if you kill him, he will be in the Fire.\"",
      "chain": [
        "36056",
        "36033",
        "20023",
        "11234",
        "13"
      ]
    },
    {
      "hadith_no": "4168",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of al-Bay'ah - كتاب البيعة",
      "chapter_no": "39",
      "text_ar": "أخبرنا عبد الملك بن شعيب بن الليث، عن أبيه، عن جده، قال حدثني عقيل، عن ابن شهاب، عن عمرو بن عبد الرحمن بن أمية، أن أباه، أخبره أن يعلى قال جئت إلى رسول الله صلى الله عليه وسلم بأبي يوم الفتح فقلت يا رسول الله بايع أبي على الهجرة ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ أبايعه على الجهاد وقد انقطعت الهجرة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr bin 'Abdur-Rahman bin Umayyah that his father told him that Ya'la said:                     \"I came to the Messenger of Allah with my father on the day of the Conquest (of Makkah) and said: 'O Messenger of Allah, accept my father's pledge to emigrate.' The Messenger of Allah said: 'I will accept his pledge for Jihad, for the emigration (Hijrah) has ceased.\"'",
      "chain": [
        "30489",
        "36033",
        "11207",
        "11013",
        "20372"
      ]
    },
    {
      "hadith_no": "4199",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of al-Bay'ah - كتاب البيعة",
      "chapter_no": "39",
      "text_ar": "أخبرنا الربيع بن سليمان، قال حدثنا شعيب بن الليث، قال حدثنا الليث، عن ابن عجلان، عن زيد بن أسلم، عن القعقاع بن حكيم، عن أبي صالح، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن الدين النصيحة إن الدين النصيحة إن الدين النصيحة ‏\"‏ ‏.‏ قالوا لمن يا رسول الله قال ‏\"‏ لله ولكتابه ولرسوله ولأئمة المسلمين وعامتهم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah said:                     \"Religion is sincerity, religion is sincerity (Al-Nasihah), religion is sincerity.\" They said; 'To whom, O Messengfer of Allah?\" He said: \"To Allah, to His Book, to His Messenger, to the imams of the Muslims and to their common folk",
      "chain": [
        "30583",
        "36033",
        "20023",
        "10616",
        "11163",
        "10612",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "4497",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا عبد الرحمن بن عبد الله بن عبد الحكم بن أعين، قال حدثنا شعيب بن الليث، عن أبيه، عن كثير بن فرقد، عن نافع، عن عبد الله، عن رسول الله صلى الله عليه وسلم أنه نهى عن النجش والتلقي وأن يبيع حاضر لباد ‏.‏",
      "text_en": " It was narrated from 'Abdullah that:                     the Messenger of Allah forbade artificially inflating prices, meeting traders on the way, and for a town-dweller to sell for a desert-dweller.\" (Sahih )",
      "chain": [
        "36033",
        "20023",
        "20170",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "4607",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا عبد الرحمن بن عبد الله بن عبد الحكم، قال حدثنا شعيب بن الليث، عن أبيه، عن محمد بن عبد الرحمن، عن نافع، أن ابن عمر، حدثهم أنهم، كانوا يبتاعون الطعام على عهد رسول الله صلى الله عليه وسلم من الركبان فنهاهم أن يبيعوا في مكانهم الذي ابتاعوا فيه حتى ينقلوه إلى سوق الطعام ‏.‏",
      "text_en": " It was narrated from Nafi that Ibn 'UMar told them, that:                     they used to buy foold from the riders at the time of the Messenger of Allah and he forbade them to sell it in the place where they had bought it until they moved it to the food market.",
      "chain": [
        "36039",
        "36033",
        "20023",
        "11105",
        "11014"
      ]
    },
    {
      "hadith_no": "4870",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرنا الربيع بن سليمان، قال حدثنا شعيب بن الليث، قال حدثنا الليث، عن ابن عجلان، عن القعقاع، عن أبي صالح، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يزني الزاني حين يزني وهو مؤمن ولا يسرق السارق حين يسرق وهو مؤمن ولا يشرب الخمر حين يشربها وهو مؤمن ولا ينتهب نهبة ذات شرف يرفع الناس إليها أبصارهم وهو مؤمن ‏\"‏ ‏.‏",
      "text_en": " It was narrated from abu Hurairah that the Messenger of Allah said:                     \"No one who commits Zina is a believer at the moment when he is committing Zina; no one who steals is a believe at the moment when he is stealing; no one who drinks wine is a believer at the moment when he is drinking it; and no robber is a believer at the moment when he is robbing and the people are looking on.",
      "chain": [
        "30583",
        "36033",
        "20023",
        "10616",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "5403",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Etiquette of Judges - كتاب آداب القضاة",
      "chapter_no": "49",
      "text_ar": "أخبرنا الربيع بن سليمان، قال حدثنا شعيب بن الليث، قال حدثنا الليث، عن ابن عجلان، عن أبي الزناد، عن الأعرج، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم أنه قال ‏\"‏ خرجت امرأتان معهما صبيان لهما فعدا الذئب على إحداهما فأخذ ولدها فأصبحتا تختصمان في الصبي الباقي إلى داود عليه السلام فقضى به للكبرى منهما فمرتا على سليمان فقال كيف أمركما فقصتا عليه فقال ائتوني بالسكين أشق الغلام بينهما ‏.‏ فقالت الصغرى أتشقه قال نعم ‏.‏ فقالت لا تفعل حظي منه لها ‏.‏ قال ‏.‏ هو ابنك ‏.‏ فقضى به لها ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     The Messenger of Allah [SAW] said: \"Two women went out with two children of theirs, and the wolf attacked one of them and took her child. The next day they referred their dispute over the remaining child to Dawud, peace be upon him, and he ruled that (the child) belonged to the older woman. Then they passed by Sulaiman and he said: 'What is your story?' So they told him. He said: 'Bring me a knife and I will cut him in half (to be shared) between you.' The younger one said: 'Will you cut him in half?' He said: 'Yes.' She said: 'Do not do that; I will give my share of him to her.' He said: 'He is your child' and he ruled that he belonged to her.\"",
      "chain": [
        "30583",
        "36033",
        "20023",
        "10616",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "5414",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Etiquette of Judges - كتاب آداب القضاة",
      "chapter_no": "49",
      "text_ar": "أخبرنا الربيع بن سليمان، قال حدثنا شعيب بن الليث، عن أبيه، عن جعفر بن ربيعة، عن عبد الرحمن الأعرج، عن عبد الله بن كعب بن مالك الأنصاري، عن كعب بن مالك، أنه كان له على عبد الله بن أبي حدرد الأسلمي - يعني دينا - فلقيه فلزمه فتكلما حتى ارتفعت الأصوات فمر بهما رسول الله صلى الله عليه وسلم فقال ‏\"‏ يا كعب ‏\"‏ ‏.‏ فأشار بيده كأنه يقول النصف فأخذ نصفا مما عليه وترك نصفا ‏.‏",
      "text_en": " It was narrated from Ka'b bin Malik that:                     He owed a debt by 'Abdullah bin Abi Hadrad Al-Aslami. He met him, and asked him to pay it off. They exchanged words until their voices became loud. The Messenger of Allah [SAW] passed by them and said: \"O Ka'b!\" and he gestured with his hand to say half. So he took half of what was owed and let him off the other half.",
      "chain": [
        "30583",
        "36033",
        "20023",
        "11407",
        "11197",
        "1131",
        "390"
      ]
    }
  ],
  "total_hadiths": 60
}