{
  "id": "36063",
  "name": "Wahb bin Bayan وهب بن بيان",
  "full_name": "Wahb bin Bayan وهب بن بيان",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "246",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Wasit",
      "Egypt"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ د  س  -  ثقة ]"
    ],
    "tags": [
      "al-Wasti",
      "Egypt"
    ],
    "area_of_interest_display": [
      {
        "en": "Narrator[Grade:Thiqah] [ د  س  -  ثقة ]",
        "ar": "Narrator[Grade:Thiqah] [ د  س  -  ثقة ]",
        "ckb": "Narrator[Grade:Thiqah] [ د  س  -  ثقة ]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "al-Wasit",
        "ar": "al-Wasit",
        "ckb": "al-Wasit"
      },
      {
        "en": "Egypt",
        "ar": "مصر",
        "ckb": "میسر"
      }
    ],
    "tags_display": [
      {
        "en": "al-Wasti",
        "ar": "al-Wasti",
        "ckb": "al-Wasti"
      },
      {
        "en": "Egypt",
        "ar": "Egypt",
        "ckb": "Egypt"
      }
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [8th Generation]",
        "ar": "تابع التابعين [الجيل الثامن]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی هەشتەم]"
      }
    },
    {
      "id": "20029",
      "name": "'Abdullah bin Wahb عبد الله بن وهب بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [9th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [9th Generation]",
        "ar": "تابع التابعين [الجيل التاسع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی نۆیەم]"
      }
    },
    {
      "id": "20341",
      "name": "'Ubaid'h bin Hameed عبيدة بن حميد",
      "grade": "Succ. (Taba' Tabi') [8th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [8th Generation]",
        "ar": "تابع التابعين [الجيل الثامن]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی هەشتەم]"
      }
    },
    {
      "id": "27049",
      "name": "Yahya bin Sa'id al-Tar يحيى بن سعيد العطار",
      "grade": "Succ. (Taba' Tabi') [9th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [9th Generation]",
        "ar": "تابع التابعين [الجيل التاسع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی نۆیەم]"
      }
    },
    {
      "id": "30213",
      "name": "Muhammad bin 'Ubaid al-Tanafasi محمد بن عبيد بن أبي أمية الطنافسي",
      "grade": "3rd Century AH [11th generation]",
      "grade_display": {
        "en": "3rd Century AH [11th Generation]",
        "ar": "القرن الثالث الهجري [الجيل الحادي عشر]",
        "ckb": "سەدەی سێیەمی كۆچی [نەوەی یازدەیەم]"
      }
    }
  ],
  "students": [
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]",
      "grade_display": {
        "en": "3rd Century AH [11th Generation]",
        "ar": "القرن الثالث الهجري [الجيل الحادي عشر]",
        "ckb": "سەدەی سێیەمی كۆچی [نەوەی یازدەیەم]"
      }
    },
    {
      "id": "30006",
      "name": "Imam Nasa'i أحمد بن شعيب بن علي بن سنان النسائي",
      "grade": "3rd Century AH [12th generation]",
      "grade_display": {
        "en": "3rd Century AH [12th Generation]",
        "ar": "القرن الثالث الهجري [الجيل الثاني عشر]",
        "ckb": "سەدەی سێیەمی كۆچی [نەوەی دوازدەیەم]"
      }
    },
    {
      "id": "38000",
      "name": "Ahmed bin Ibrahim bin Fyl أحمد بن إبراهيم بن فيل",
      "grade": "3rd Century AH [12th generation]",
      "grade_display": {
        "en": "3rd Century AH [12th Generation]",
        "ar": "القرن الثالث الهجري [الجيل الثاني عشر]",
        "ckb": "سەدەی سێیەمی كۆچی [نەوەی دوازدەیەم]"
      }
    }
  ],
  "hadiths": [
    {
      "id": "sunan-abi-daud-1920",
      "hadith_no": "1920",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن كثير، حدثنا سفيان، عن الأعمش، ح وحدثنا وهب بن بيان، حدثنا عبيدة، حدثنا سليمان الأعمش، - المعنى - عن الحكم، عن مقسم، عن ابن عباس، قال أفاض رسول الله صلى الله عليه وسلم من عرفة وعليه السكينة ورديفه أسامة وقال ‏\"‏ أيها الناس عليكم بالسكينة فإن البر ليس بإيجاف الخيل والإبل ‏\"‏ ‏.‏ قال فما رأيتها رافعة يديها عادية حتى أتى جمعا ‏.‏ زاد وهب ثم أردف الفضل بن العباس ‏.‏ وقال ‏\"‏ أيها الناس إن البر ليس بإيجاف الخيل والإبل فعليكم بالسكينة ‏\"‏ ‏.‏ قال فما رأيتها رافعة يديها حتى أتى منى ‏.‏",
      "text_en": " Ibn ‘Abbas said The Apostle of Allaah(ﷺ) returned from ‘Arafah preserving a quiet demeanor and he took Usamah up behind him (on the Camel). He said “O people preserve a quiet demeanor for piety does not consist in exciting the Horses and the Camels (i.e., in driving them quickly).” He (Ibn ‘Abbas) said “Thereafter I did not see them raising their hands running quickly till he came to Al Muzdalifah.” The narrator Wahb added He took Al Fadl bin ‘Abbas up behind him (on the Camel) and said O people piety does not consist in exciting the Horses and the Camels (i.e., in driving them quickly), you must preserve a quiet demeanor”. He (Ibn ‘Abbas) said “Thereafter I did not see them raising their hands till he came to Mina.”",
      "usc_msa_ref": "",
      "chain": [
        "28531",
        "20012",
        "11060",
        "36063",
        "11370",
        "11069",
        "11725",
        "17"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-2251",
      "hadith_no": "2251",
      "source": "Sunan Abi Da'ud",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا مسدد، ووهب بن بيان، وأحمد بن عمرو بن السرح، وعمرو بن عثمان، قالوا حدثنا سفيان، عن الزهري، عن سهل بن سعد، قال مسدد قال شهدت المتلاعنين على عهد رسول الله صلى الله عليه وسلم وأنا ابن خمس عشرة ففرق بينهما رسول الله صلى الله عليه وسلم حين تلاعنا ‏.‏ وتم حديث مسدد ‏.‏ وقال الآخرون إنه شهد النبي صلى الله عليه وسلم فرق بين المتلاعنين فقال الرجل كذبت عليها يا رسول الله إن أمسكتها - لم يقل بعضهم عليها - قال أبو داود لم يتابع ابن عيينة أحد على أنه فرق بين المتلاعنين ‏.‏",
      "text_en": " Sahl bin Sa’ad said “The version of Musaddad has “I witnessed the invoking of curses by the two spouses during the life time of the Apostle of Allaah(ﷺ) when I was fifteen years old. When they finished invoking curses, the Apostle of Allaah(ﷺ) separated them from each other. Here ends the version of Musaddad. Others said “He was present when the Prophet (ﷺ) separated the spouses who invoked curses on each other. The man (Sahl) said “I shall have lied against her, Apostle of Allaah(ﷺ) if I keep her.Abu Dawud said “Some narrators did not mention the word ‘alaiha(against her).”Abu Dawud said “No one supported Ibn ‘Uyainah that he separated the spouses who invoked curses.”",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "36063",
        "30485",
        "10581",
        "20012",
        "11013",
        "399",
        "30175"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-2406",
      "hadith_no": "2406",
      "source": "Sunan Abi Da'ud",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا أحمد بن صالح، ووهب بن بيان، - المعنى - قالا حدثنا ابن وهب، حدثني معاوية، عن ربيعة بن يزيد، أنه حدثه عن قزعة، قال أتيت أبا سعيد الخدري وهو يفتي الناس وهم مكبون عليه فانتظرت خلوته فلما خلا سألته عن صيام رمضان في السفر فقال خرجنا مع النبي صلى الله عليه وسلم في رمضان عام الفتح فكان رسول الله صلى الله عليه وسلم يصوم ونصوم حتى بلغ منزلا من المنازل فقال ‏\"‏ إنكم قد دنوتم من عدوكم والفطر أقوى لكم ‏\"‏ ‏.‏ فأصبحنا منا الصائم ومنا المفطر - قال - ثم سرنا فنزلنا منزلا فقال ‏\"‏ إنكم تصبحون عدوكم والفطر أقوى لكم فأفطروا ‏\"‏ ‏.‏ فكانت عزيمة من رسول الله صلى الله عليه وسلم ‏.‏ قال أبو سعيد ثم لقد رأيتني أصوم مع النبي صلى الله عليه وسلم قبل ذلك وبعد ذلك ‏.‏",
      "text_en": " Narrated Qaza'ah:                     I came to Abu Sa'id al-Khudri while he was giving his legal opinion to the people who bent down on him. So I waited to see hi when he was alone. When he became alone, I asked him about keeping fast while travelling. He said: we went out along with the Prophet (ﷺ) in Ramadan in the year of conquest of Mecca. The Messenger of Allah (ﷺ) fasted and we fasted until he reached a certain stage. He said: You have come near your enemy; the breaking of fast will bring you more strength. Then morning came when some of us fasted and other broke their fast. He (Abu Sa'id al-Khudri) said: We then proceeded and alighted at a stage. He said: You are going to attack your enemy tomorrow morning ; breaking the fast will bring you more strength ; so break your fast (i.e. do not keep fast). This resolution (of breaking the fast) took place (due to the announcement) from the Messenger of Allah (ﷺ). Abu Sa'id said: Then I found myself keeping fast along with the Prophet (ﷺ) before and after that.",
      "usc_msa_ref": "",
      "chain": [
        "30226",
        "36063",
        "20029",
        "27",
        "11414"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-4120",
      "hadith_no": "4120",
      "source": "Sunan Abi Da'ud",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا مسدد، ووهب بن بيان، وعثمان بن أبي شيبة، وابن أبي خلف، قالوا حدثنا سفيان، عن الزهري، عن عبيد الله بن عبد الله، عن ابن عباس، - قال مسدد ووهب - عن ميمونة، قالت أهدي لمولاة لنا شاة من الصدقة فماتت فمر بها النبي صلى الله عليه وسلم فقال ‏\"‏ ألا دبغتم إهابها فاستمتعتم به ‏\"‏ ‏.‏ قالوا يا رسول الله إنها ميتة ‏.‏ قال ‏\"‏ إنما حرم أكلها ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Abbas said - (Musaddad and Wahb transmitted from Maimunah) Maimunah said:                      A sheep was given in alms to a female client of ours, but it died. The Prophet (ﷺ) passed it and said: Why did you not tan its skin and get some good out of it ? They replied: Messenger of Allah, it died a natural death. He said: It is only the eating of it that is prohibited.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "36063",
        "30203",
        "20005",
        "11013",
        "11004",
        "17",
        "61"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-4384",
      "hadith_no": "4384",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا أحمد بن صالح، ووهب بن بيان، قالا حدثنا ح، وحدثنا ابن السرح، قال أخبرنا ابن وهب، أخبرني يونس، عن ابن شهاب، عن عروة، وعمرة، عن عائشة، رضى الله عنها عن النبي صلى الله عليه وسلم قال ‏\"‏ تقطع يد السارق في ربع دينار فصاعدا ‏\"‏ ‏.‏ قال أحمد بن صالح القطع في ربع دينار فصاعدا ‏.‏",
      "text_en": " ‘A’ishah reported the prophet (ﷺ) as saying :                      A thief’s hand should be cut off for a quarter of a dinar and upwards.Ahmed b. Salih said: The amputation (of a thief’s hand) is for a quarter of a dinar and upwards.",
      "usc_msa_ref": "",
      "chain": [
        "30226",
        "36063",
        "30485",
        "20029",
        "20475",
        "11013",
        "10511",
        "11455",
        "53"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-4503",
      "hadith_no": "4503",
      "source": "Sunan Abi Da'ud",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، قال حدثنا محمد بن إسحاق، فحدثني محمد بن جعفر بن الزبير، قال سمعت زياد بن ضميرة الضمري، ح وحدثنا وهب بن بيان، وأحمد بن سعيد الهمداني، قالا حدثنا ابن وهب، أخبرني عبد الرحمن بن أبي الزناد، عن عبد الرحمن بن الحارث، عن محمد بن جعفر، أنه سمع زياد بن سعد بن ضميرة السلمي، - وهذا حديث وهب وهو أتم - يحدث عروة بن الزبير عن أبيه - قال موسى - وجده وكانا شهدا مع رسول الله صلى الله عليه وسلم حنينا - ثم رجعنا إلى حديث وهب - أن محلم بن جثامة الليثي قتل رجلا من أشجع في الإسلام وذلك أول غير قضى به رسول الله صلى الله عليه وسلم فتكلم عيينة في قتل الأشجعي لأنه من غطفان وتكلم الأقرع بن حابس دون محلم لأنه من خندف فارتفعت الأصوات وكثرت الخصومة واللغط فقال رسول الله صلى الله عليه وسلم ‏\"‏ يا عيينة ألا تقبل الغير ‏\"‏ ‏.‏ فقال عيينة لا والله حتى أدخل على نسائه من الحرب والحزن ما أدخل على نسائي ‏.‏ قال ثم ارتفعت الأصوات وكثرت الخصومة واللغط فقال رسول الله صلى الله عليه وسلم ‏\"‏ يا عيينة ألا تقبل الغير ‏\"‏ ‏.‏ فقال عيينة مثل ذلك أيضا إلى أن قام رجل من بني ليث يقال له مكيتل عليه شكة وفي يده درقة فقال يا رسول الله إني لم أجد لما فعل هذا في غرة الإسلام مثلا إلا غنما وردت فرمي أولها فنفر آخرها اسنن اليوم وغير غدا فقال رسول الله صلى الله عليه وسلم ‏\"‏ خمسون في فورنا هذا وخمسون إذا رجعنا إلى المدينة ‏\"‏ ‏.‏ وذلك في بعض أسفاره ومحلم رجل طويل آدم وهو في طرف الناس فلم يزالوا حتى تخلص فجلس بين يدى رسول الله صلى الله عليه وسلم وعيناه تدمعان فقال يا رسول الله إني قد فعلت الذي بلغك وإني أتوب إلى الله تبارك وتعالى فاستغفر الله عز وجل لي يا رسول الله ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أقتلته بسلاحك في غرة الإسلام اللهم لا تغفر لمحلم ‏\"‏ ‏.‏ بصوت عال زاد أبو سلمة فقام وإنه ليتلقى دموعه بطرف ردائه قال ابن إسحاق فزعم قومه أن رسول الله صلى الله عليه وسلم استغفر له بعد ذلك ‏.‏ قال أبو داود قال النضر بن شميل الغير الدية ‏.‏",
      "text_en": " Narrated Ziyad ibn Sa'd ibn Dumayrah as-Sulami:                     On the authority of his father (Sa'd) and his grandfather (Dumayrah) (according to Musa's version) who were present in the battle of Hunayn with the Messenger of Allah (ﷺ): After the advent of Islam, Muhallam ibn Jaththamah al-Laythi killed a man of Ashja'. That was the first blood-money decided by the Messenger of Allah (ﷺ) (for payment). Uyaynah spoke about the killing of al-Ashja'i, for he belonged to Ghatafan, and al-Aqra' ibn Habis spoke on behalf of Muhallam, for he belonged to Khunduf. The voices rose high, and the dispute and noise grew.  So the Messenger of Allah (ﷺ) said: Do you not accept blood-money, Uyaynah?  Uyaynah then said: No, I swear by Allah, until I cause his women to suffer the same fighting and grief as he caused my women to suffer. Again the voices rose high, and the dispute and noise grew.  The Messenger of Allah (ﷺ) said: Do you not accept the blood-money Uyaynah? Uyaynah gave the same reply as before, and a man of Banu Layth called Mukaytil stood up. He had a weapon and a skin shield in his hand.  He said: I do not find in the beginning of Islam any illustration for what he has done except the one that \"some sheep came on, and those in the front were shot; hence those in the rear ran away\". (The other example is that) \"make a law today and change it.\"  The Messenger of Allah (ﷺ) said: Fifty (camels) here immediately and fifty when we return to Medina. This happened during some of his journeys. Muhallam was a tall man of dark complexion. He was with the people. They continued (to make effort for him) until he was released. He sat before the Messenger of Allah (ﷺ), with his eyes flowing.  He said: Messenger of Allah! I have done (the act) of which you have been informed. I repent to Allah, the Exalted, so ask Allah's forgiveness for me. Messenger of Allah!  The Messenger of Allah (ﷺ) then said: Did you kill him with your weapon at the beginning of Islam. O Allah! do not forgive Muhallam. He said these words loudly.  AbuSalamah added: He (Muhallam) then got up while he was wiping his tears with the end of his garment.  Ibn Ishaq said: His people alleged that the Messenger of Allah (ﷺ) asked forgiveness for him after that.Abu Dawud said: Al-Nadr b. Shumail said: al-ghiyar means blood-wit.",
      "usc_msa_ref": "",
      "chain": [
        "20040",
        "20022",
        "11107",
        "36063",
        "30296",
        "20029",
        "20509",
        "448",
        "20173"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-4576",
      "hadith_no": "4576",
      "source": "Sunan Abi Da'ud",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا وهب بن بيان، وابن السرح، قالا حدثنا ابن وهب، أخبرني يونس، عن ابن شهاب، عن سعيد بن المسيب، وأبي، سلمة عن أبي هريرة، قال اقتتلت امرأتان من هذيل فرمت إحداهما الأخرى بحجر فقتلتها فاختصموا إلى رسول الله صلى الله عليه وسلم فقضى رسول الله صلى الله عليه وسلم دية جنينها غرة عبد أو وليدة وقضى بدية المرأة على عاقلتها وورثها ولدها ومن معهم فقال حمل بن مالك بن النابغة الهذلي يا رسول الله كيف أغرم دية من لا شرب ولا أكل ولا نطق ولا استهل فمثل ذلك يطل فقال رسول الله صلى الله عليه وسلم ‏\"‏ إنما هذا من إخوان الكهان ‏\"‏ ‏.‏ من أجل سجعه الذي سجع ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     Two women of Hudhail fought together and one of them threw a stone at the other and killed her. They brought their dispute to the Messenger of Allah (ﷺ) who gave judgement that a male or female slave of the best quality should be given as compensation for her unborn child, and he fixed it to be paid by the woman's relatives on the father's side. He made her sons and those who were with them her heirs. Hamal b. Malik b. al-Nabighah al-Hudhali said: Messenger of Allah ! how should I be fined for one who has not drunk, or eaten or spoken, or raised his voice? - adding that compensation is not to be paid for such (an offense). The Messenger of Allah (ﷺ) said: This man simply belong to the soothsayers on account of his rhymed prose which he has used.",
      "usc_msa_ref": "",
      "chain": [
        "36063",
        "30485",
        "20029",
        "20475",
        "11013",
        "11002",
        "10567",
        "13"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-an-nasai-Grade-36",
      "hadith_no": "Grade",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرنا وهب بن بيان، قال أنبأنا ابن وهب، قال سمعت معاوية بن صالح، عن أبي الزاهرية، عن عبد الله بن بسر، قال كنت جالسا إلى جانبه يوم الجمعة فقال جاء رجل يتخطى رقاب الناس فقال له رسول الله صلى الله عليه وسلم ‏\"‏ أى اجلس فقد آذيت ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Az-Zahiriyah about 'Abdullah bin Busr, he said:                     \"I was sitting beside him on Friday and he said: 'A man came, stepping over people's necks, and the Messenger of Allah (ﷺ) said: 'Sit down, you are disturbing people.\"",
      "usc_msa_ref": "",
      "chain": [
        "36063",
        "20029",
        "20675",
        "10901",
        "3650"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-2886",
      "hadith_no": "2886",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا وهب بن بيان، قال حدثنا ابن وهب، قال أخبرني مالك، ويونس، عن ابن شهاب، عن عروة، عن عائشة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ الوزغ الفويسق ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Aishah that the Messenger of Allah said:                     \"Geckos are vermin.\"",
      "usc_msa_ref": "",
      "chain": [
        "36063",
        "20029",
        "20001",
        "20475",
        "11013",
        "10511",
        "53"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3285",
      "hadith_no": "3285",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا وهب بن بيان، قال حدثنا ابن وهب، قال أخبرني يونس، عن ابن شهاب، أن عروة بن الزبير، حدثه عن زينب بنت أبي سلمة، أن أم حبيبة، زوج النبي صلى الله عليه وسلم قالت يا رسول الله أنكح بنت أبي تعني أختها ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ وتحبين ذلك ‏\"‏ ‏.‏ قالت نعم لست لك بمخلية وأحب من شركتني في خير أختي ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن ذلك لا يحل ‏\"‏ ‏.‏ قالت أم حبيبة يا رسول الله والله لقد تحدثنا أنك تنكح درة بنت أبي سلمة ‏.‏ فقال ‏\"‏ بنت أم سلمة ‏\"‏ ‏.‏ قالت أم حبيبة نعم ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ فوالله لو أنها لم تكن ربيبتي في حجري ما حلت إنها لابنة أخي من الرضاعة أرضعتني وأبا سلمة ثويبة فلا تعرضن على بناتكن ولا أخواتكن ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Zainab bint Abi Salamah that Umm Habibah, the wife of the Prophet said:                      \"O Messenger of Allah, marry the daughter of my father\" - meaning her sister. The Messenger of Allah said: \"Would you like that?\" She said: \"Yes; I do not have you all to myself, and I would like to share this goodness with my sister.\" The Prophet said: \"That is not permissible for me.\" Umm Habibah said: \"O Messenger of Allah, by Allah, we have been saying that you want to marry Durrah bint Abi Salamah.\" He said: \"The daughter of Umm Salamah?\" I said: \"Yes.\" He said: \"By Allah, even if she were not my stepdaughter who is in my care, she would not be permissible for me (to marry), because she is the daughter of my brother through breast-feeding. Thuwaibah breastfed Abu Salamah and I. So do not offer your daughters or sisters to me in marriage.\"",
      "usc_msa_ref": "",
      "chain": [
        "36063",
        "20029",
        "20475",
        "11013",
        "10511",
        "244"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-4278",
      "hadith_no": "4278",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا وهب بن بيان، قال حدثنا ابن وهب، قال أخبرني يونس، قال قال ابن شهاب حدثني سالم بن عبد الله، عن أبيه، قال سمعت رسول الله صلى الله عليه وسلم رافعا صوته يأمر بقتل الكلاب فكانت الكلاب تقتل إلا كلب صيد أو ماشية ‏.‏",
      "text_en": " Salim bin 'Abdullah narrated that his father said:                     \"I heard the Messenger of Allah raise his voice with the command to kill dogs. All dogs were to be killed except dogs used for hunting or herding livestock.\"",
      "usc_msa_ref": "",
      "chain": [
        "36063",
        "20029",
        "20475",
        "11013",
        "11011",
        "18"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-4290",
      "hadith_no": "4290",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا وهب بن بيان، قال حدثنا ابن وهب، قال أخبرني يونس، قال أنبأنا ابن شهاب، عن سعيد بن المسيب، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ من اقتنى كلبا ليس بكلب صيد ولا ماشية ولا أرض فإنه ينقص من أجره قيراطان كل يوم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah said:                     \"Whoever keeps a dog that is not a dog used for hunting, herding livestock or guarding land, two qirats will be deducted from his reward each day.\"",
      "usc_msa_ref": "",
      "chain": [
        "36063",
        "20029",
        "20475",
        "11013",
        "11002",
        "13"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-4358",
      "hadith_no": "4358",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا وهب بن بيان، قال حدثنا ابن وهب، قال أخبرني يونس، عن ابن شهاب، عن سعيد، وأبي، سلمة عن أبي هريرة، عن رسول الله صلى الله عليه وسلم ‏\"‏ أن نملة قرصت نبيا من الأنبياء فأمر بقرية النمل فأحرقت فأوحى الله عز وجل إليه أن قد قرصتك نملة أهلكت أمة من الأمم تسبح ‏\"‏ ‏.‏",
      "text_en": " Was narrated from Abu Hurairah from the Messenger of Allah:                     \"An ant bit one o f the prophets, and he ordered that the ant nest be burned. Then Allah revealed to hymns: \"One ant bit you, and you destroyed one of the na5tions that glorify Allah.\"",
      "usc_msa_ref": "",
      "chain": [
        "36063",
        "20029",
        "20475",
        "11013",
        "11168",
        "10567",
        "13"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-4773",
      "hadith_no": "4773",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا وهب بن بيان، قال حدثنا ابن وهب، قال أخبرني عمرو بن الحارث، عن بكير بن عبد الله، عن عبيدة بن مسافع، عن أبي سعيد الخدري، قال بينا رسول الله صلى الله عليه وسلم يقسم شيئا أقبل رجل فأكب عليه فطعنه رسول الله صلى الله عليه وسلم بعرجون كان معه فخرج الرجل فقال رسول الله صلى الله عليه وسلم ‏\"‏ تعال فاستقد ‏\"‏ ‏.‏ قال بل قد عفوت يا رسول الله ‏.‏",
      "text_en": " It was narrated that Abu Aa'eed Al-Khudri daid:                     \"While the Messenger of Allah was distributing something, a man came and leaned over him, and the Messenger of Allah hit him with a stick that he had with him. The man went tout, and the Messenger of Allah said: 'Come and ask for retaliation. 'He said: 'No. I ask for retaliation.' He said: 'No, I pardon you, O Messenger of Allah.\"'",
      "usc_msa_ref": "",
      "chain": [
        "36063",
        "20029",
        "20377",
        "11154",
        "38"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-5136",
      "hadith_no": "5136",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا وهب بن بيان، قال حدثنا ابن وهب، قال أنبأنا عمرو بن الحارث، أن أبا عشانة، - هو المعافري - حدثه أنه، سمع عقبة بن عامر، يخبر أن رسول الله صلى الله عليه وسلم كان يمنع أهله الحلية والحرير ويقول ‏\"‏ إن كنتم تحبون حلية الجنة وحريرها فلا تلبسوها في الدنيا ‏\"‏ ‏.‏",
      "text_en": " 'Uqbah bin 'Amir narrated that:                     The Messenger of Allah [SAW] used to tell his wives not to wear jewelry and silk. He said: \"If you want the jewelry and silk of Paradise, then do not wear them in this world.\"",
      "usc_msa_ref": "",
      "chain": [
        "36063",
        "20029",
        "20377",
        "16021",
        "189"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-5326",
      "hadith_no": "5326",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا وهب بن بيان، قال حدثنا ابن وهب، قال أخبرني يونس، عن ابن شهاب، أن سالما، أخبره أن عبد الله بن عمر حدثه أن رسول الله صلى الله عليه وسلم قال ‏\"‏ بينا رجل يجر إزاره من الخيلاء خسف به فهو يتجلجل في الأرض إلى يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin 'Umar that:                     The Messenger of Allah [SAW] said: \"While a man was dragging his Izar out of pride, the earth swallowed him up, and he will continue sinking into it until the Day of Resurrection.\"",
      "usc_msa_ref": "",
      "chain": [
        "36063",
        "20029",
        "20475",
        "11013",
        "11011",
        "18"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-5355",
      "hadith_no": "5355",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا وهب بن بيان، قال حدثنا ابن وهب، قال حدثنا عمرو، قال حدثنا بكير، قال حدثني عبد الرحمن بن القاسم، أن أباه، حدثه عن عائشة، أنها نصبت سترا فيه تصاوير فدخل رسول الله صلى الله عليه وسلم فنزعه فقطعته وسادتين ‏.‏ قال رجل في المجلس حينئذ يقال له ربيعة بن عطاء أنا سمعت أبا محمد - يعني القاسم - عن عائشة قالت كان رسول الله صلى الله عليه وسلم يرتفق عليهما ‏.‏",
      "text_en": " It was narrated from 'Aishah that:                     She put up a curtain on which there were images, then the Messenger of Allah [SAW] came in and took it down, so she cut it up (and made) two pillows. A man in the gathering there whose name was Rabi'ah bin 'Ata' said: \"I heard Abu Muhammad - meaning Al-Qasim - narrate that 'Aishah said: 'The Messenger of Allah [SAW] used to recline on them.'\"",
      "usc_msa_ref": "",
      "chain": [
        "36063",
        "20029",
        "20377",
        "11154",
        "10530",
        "10535",
        "53"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    }
  ],
  "total_hadiths": 17,
  "grade_display": {
    "en": "3rd Century AH [10th Generation]",
    "ar": "القرن الثالث الهجري [الجيل العاشر]",
    "ckb": "سەدەی سێیەمی كۆچی [نەوەی دەیەم]"
  }
}