{
  "id": "3625",
  "name": "Zayd bin Khalid al-Juhni ( زيد بن خالد الجهني ( رضي الله عنه",
  "full_name": "Zayd bin Khalid al-Juhni ( زيد بن خالد الجهني ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Hijaz"
    },
    "death": {
      "date_hijri": "78",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Medina/Kufa",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina",
      "Kufa"
    ],
    "area_of_interest": [
      "Narrator [ ع  -  صحابي ]"
    ],
    "tags": [
      "al-Juhni",
      "al-Madni",
      "Ridwan",
      "Conquest"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "19238",
      "name": "Abu Hrb bin Zayd أبو حرب بن زيد",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "4",
      "name": "'Uthman ibn 'Affaan ( عثمان بن عفان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "229",
      "name": "Abu Talha Ansari ( أبو طلحة الأنصاري زيد بن سهل بن الأسود ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "10729",
      "name": "Abu Harb bin Abi al-Aswad أبو حرب بن أبي الأسود الديلي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19238",
      "name": "Abu Hrb bin Zayd أبو حرب بن زيد",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11170",
      "name": "Sa'id bin Yasar, Abu al-Hubab سعيد بن يسار أبو الحباب",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11706",
      "name": "'Ubaidullah bin al-Aswad عبيد الله بن الأسود الخولاني",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "929",
      "name": "'Abdullah bin Qays bin Makhrama ( عبد الله بن قيس بن مخرمة بن المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11153",
      "name": "Basr bin Sa'id al-Madni بسر بن سعيد المدني العابد",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11029",
      "name": "'Ata' bin Abi Rabah عطاء بن أبي رباح",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11020",
      "name": "'Ata ibn Yasar عطاء بن يسار أبو محمد مولى ميمونة",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11238",
      "name": "Yazid Mwla al-Mnb'th يزيد مولى المنبعث",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10858",
      "name": "Sufyan bin Han'i, Abu Salam al-Jayshani سفيان بن هانئ أبو سالم الجيشاني",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11004",
      "name": "'Ubaydullah bin 'Abdullah bin 'Utba عبيد الله بن عبد الله بن عتبة بن مسعود",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10567",
      "name": "Abu Salama bin 'Abdur Rahman أبو سلمة بن عبد الرحمن بن عوف",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "91",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا عبد الله بن محمد، قال حدثنا أبو عامر، قال حدثنا سليمان بن بلال المديني، عن ربيعة بن أبي عبد الرحمن، عن يزيد، مولى المنبعث عن زيد بن خالد الجهني، أن النبي صلى الله عليه وسلم سأله رجل عن اللقطة فقال ‏\"‏ اعرف وكاءها  أو قال وعاءها  وعفاصها، ثم عرفها سنة، ثم استمتع بها، فإن جاء ربها فأدها إليه ‏\"‏‏.‏ قال فضالة الإبل فغضب حتى احمرت وجنتاه  أو قال احمر وجهه  فقال ‏\"‏ وما لك ولها معها سقاؤها وحذاؤها، ترد الماء، وترعى الشجر، فذرها حتى يلقاها ربها ‏\"‏‏.‏ قال فضالة الغنم قال ‏\"‏ لك أو لأخيك أو للذئب ‏\"‏‏.‏",
      "text_en": " Narrated Zaid bin Khalid Al-Juhani:                     A man asked the Prophet about the picking up of a \"Luqata\" (fallen lost thing). The Prophet replied, \"Recognize and remember its tying material and its container, and make public announcement (about it) for one year, then utilize it but give it to its owner if he comes.\" Then the person asked about the lost camel. On that, the Prophet got angry and his cheeks or his Face became red and he said, \"You have no concern with it as it has its water container, and its feet and it will reach water, and eat (the leaves) of trees till its owner finds it.\" The man then asked about the lost sheep. The Prophet replied, \"It is either for you, for your brother (another person) or for the wolf.\"",
      "chain": [
        "30351",
        "20443",
        "20160",
        "11162",
        "11238",
        "3625"
      ]
    },
    {
      "hadith_no": "179",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا سعد بن حفص، حدثنا شيبان، عن يحيى، عن أبي سلمة، أن عطاء بن يسار، أخبره أن زيد بن خالد أخبره أنه، سأل عثمان بن عفان  رضى الله عنه  قلت أرأيت إذا جامع فلم يمن قال عثمان يتوضأ كما يتوضأ للصلاة، ويغسل ذكره‏.‏ قال عثمان سمعته من رسول الله صلى الله عليه وسلم‏.‏ فسألت عن ذلك عليا، والزبير، وطلحة، وأبى بن كعب  رضى الله عنهم  فأمروه بذلك‏.‏",
      "text_en": " Narrated Zaid bin Khalid:                     I asked `Uthman bin `Affan about a person who engaged in intercourse but did no discharge. `Uthman replied, \"He should perform ablution like the one for an ordinary prayer but he must wash his penis.\" `Uthman added, \"I heard it from Allah's Apostle.\" I asked `Ali Az-Zubair, Talha and Ubai bin Ka`b about it and they, too, gave the same reply. (This order was canceled later on and taking a bath became necessary for such cases).",
      "chain": [
        "35043",
        "20240",
        "11449",
        "10567",
        "11020",
        "3625",
        "4"
      ]
    },
    {
      "hadith_no": "292",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو معمر، حدثنا عبد الوارث، عن الحسين، قال يحيى وأخبرني أبو سلمة، أن عطاء بن يسار، أخبره أن زيد بن خالد الجهني أخبره أنه، سأل عثمان بن عفان فقال أرأيت إذا جامع الرجل امرأته فلم يمن‏.‏ قال عثمان يتوضأ كما يتوضأ للصلاة، ويغسل ذكره‏.‏ قال عثمان سمعته من رسول الله صلى الله عليه وسلم‏.‏ فسألت عن ذلك علي بن أبي طالب والزبير بن العوام وطلحة بن عبيد الله وأبى بن كعب  رضى الله عنهم  فأمروه بذلك‏.‏ قال يحيى وأخبرني أبو سلمة أن عروة بن الزبير أخبره أن أبا أيوب أخبره أنه سمع ذلك من رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Zaid bin Khalid Al-Juhani:                     I asked `Uthman bin `Affan about a man who engaged in the sexual intercourse with his wife but did not discharge. `Uthman replied, \"He should perform ablution like that for the prayer after washing his private parts.\" `Uthman added, \"I heard that from Allah's Apostle.\" I asked `Ali bin Abi Talib, Az- Zubair bin Al-`Awwam, Talha bin 'Ubaidullah and Ubai bin Ka`b and a gave the same reply. (Abu Aiyub said that he had heard that from Allah's Apostle ) (This order was canceled later on so one has to take a bath. See, Hadith No. 180).",
      "chain": [
        "30315",
        "20258",
        "11278",
        "11449",
        "10567",
        "11020",
        "3625",
        "4"
      ]
    },
    {
      "hadith_no": "510",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن أبي النضر، مولى عمر بن عبيد الله عن بسر بن سعيد، أن زيد بن خالد، أرسله إلى أبي جهيم يسأله ماذا سمع من، رسول الله صلى الله عليه وسلم في المار بين يدى المصلي فقال أبو جهيم قال رسول الله صلى الله عليه وسلم ‏\"‏ لو يعلم المار بين يدى المصلي ماذا عليه لكان أن يقف أربعين خيرا له من أن يمر بين يديه ‏\"‏‏.‏ قال أبو النضر لا أدري أقال أربعين يوما أو شهرا أو سنة‏.‏",
      "text_en": " Narrated Busr bin Sa`id:                     that Zaid bin Khalid sent him to Abi Juhaim to ask him what he had heard from Allah's Apostle about a person passing in front of another person who was praying. Abu Juhaim replied, \"Allah's Apostle said, 'If the person who passes in front of another person in prayer knew the magnitude of his sin he would prefer to wait for 40 (days, months or years) rather than to pass in front of him.\" Abu An-Nadr said, \"I do not remember exactly whether he said 40 days, months or years.\"",
      "chain": [
        "30355",
        "20001",
        "11164",
        "11153",
        "3625"
      ]
    },
    {
      "hadith_no": "846",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن صالح بن كيسان، عن عبيد الله بن عبد الله بن عتبة بن مسعود، عن زيد بن خالد الجهني، أنه قال صلى لنا رسول الله صلى الله عليه وسلم صلاة الصبح بالحديبية على إثر سماء كانت من الليلة، فلما انصرف أقبل على الناس فقال ‏\"‏ هل تدرون ماذا قال ربكم ‏\"‏‏.‏ قالوا الله ورسوله أعلم‏.‏ قال ‏\"‏ أصبح من عبادي مؤمن بي وكافر، فأما من قال مطرنا بفضل الله ورحمته فذلك مؤمن بي وكافر بالكوكب، وأما من قال بنوء كذا وكذا فذلك كافر بي ومؤمن بالكوكب ‏\"‏‏.‏",
      "text_en": " Narrated Zaid bin Khalid Al-Juhani:                     The Prophet led us in the Fajr prayer at Hudaibiya after a rainy night. On completion of the prayer, he faced the people and said, \"Do you know what your Lord has said (revealed)?\" The people replied, \"Allah and His Apostle know better.\" He said, \"Allah has said, 'In this morning some of my slaves remained as true believers and some became non-believers; whoever said that the rain was due to the Blessings and the Mercy of Allah had belief in Me and he disbelieves in the stars, and whoever said that it rained because of a particular star had no belief in Me but believes in that star.' \"",
      "chain": [
        "20164",
        "20001",
        "11176",
        "11004",
        "3625"
      ]
    },
    {
      "hadith_no": "1038",
      "source": " Sahih Bukhari ",
      "chapter": "Invoking Allah for Rain (Istisqaa) - كتاب الاستسقاء",
      "chapter_no": "15",
      "text_ar": "حدثنا إسماعيل، حدثني مالك، عن صالح بن كيسان، عن عبيد الله بن عبد الله بن عتبة بن مسعود، عن زيد بن خالد الجهني، أنه قال صلى لنا رسول الله صلى الله عليه وسلم صلاة الصبح بالحديبية على إثر سماء كانت من الليلة، فلما انصرف النبي صلى الله عليه وسلم أقبل على الناس فقال ‏\"‏ هل تدرون ماذا قال ربكم ‏\"‏‏.‏ قالوا الله ورسوله أعلم‏.‏ قال ‏\"‏ أصبح من عبادي مؤمن بي وكافر، فأما من قال مطرنا بفضل الله ورحمته‏.‏ فذلك مؤمن بي كافر بالكوكب، وأما من قال بنوء كذا وكذا‏.‏ فذلك كافر بي مؤمن بالكوكب ‏\"‏‏.‏",
      "text_en": " Narrated Zaid bin Khalid Al-Juhani:                     Allah's Apostle led the morning prayer in Al-Hudaibiya and it had rained the previous night. When the Prophet (p.b.u.h) had finished the prayer he faced the people and said, \"Do you know what your Lord has said?\" They replied, \"Allah and His Apostle know better.\" (The Prophet said), \"Allah says, 'In this morning some of My worshipers remained as true believers and some became non-believers; he who said that it had rained with the blessing and mercy of Allah is the one who believes in Me and does not believe in star, but he who said it had rained because of such and such (star) is a disbeliever in Me and is a believer in star.' \"",
      "chain": [
        "30103",
        "20001",
        "11176",
        "11004",
        "3625"
      ]
    },
    {
      "hadith_no": "2154",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن ابن شهاب، عن عبيد الله بن عبد الله، عن أبي هريرة، وزيد بن خالد  رضى الله عنهما  أن رسول الله صلى الله عليه وسلم سئل عن الأمة إذا زنت ولم تحصن قال ‏\"‏ إن زنت فاجلدوها، ثم إن زنت فاجلدوها، ثم إن زنت فبيعوها ولو بضفير ‏\"‏‏.‏ قال ابن شهاب لا أدري بعد الثالثة، أو الرابعة‏.‏",
      "text_en": " Narrated Abu Huraira and Zaid bin Khalid:                     Allah's Apostle was asked about the slave-girl, if she was a virgin and committed illegal sexual intercourse. The Prophet said, \"If she committed illegal sexual intercourse, lash her, and if she did it a second time, then lash her again, and if she repeated the third time, then sell her even for a hair rope.\" Ibn Shihab said, \"I don't know whether to sell her after the third or fourth offense.\"",
      "chain": [
        "30103",
        "20001",
        "11013",
        "11004",
        "13",
        "3625"
      ]
    },
    {
      "hadith_no": "2233",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثني زهير بن حرب، حدثنا يعقوب، حدثنا أبي، عن صالح، قال حدث ابن شهاب، أن عبيد الله، أخبره أن زيد بن خالد وأبا هريرة رضى الله عنهما أخبراه أنهما، سمعا رسول الله صلى الله عليه وسلم يسأل عن الأمة تزني ولم تحصن قال ‏\"‏ اجلدوها، ثم إن زنت فاجلدوها، ثم بيعوها بعد الثالثة أو الرابعة ‏\"‏‏.‏",
      "text_en": " Narrated Zaid bin Khalid and Abu Huraira:                     that Allah's Apostle was asked about an unmarried slave-girl who committed illegal sexual intercourse. They heard him saying, \"Flog her, and if she commits illegal sexual intercourse after that, flog her again, and on the third (or the fourth) offense, sell her.\"",
      "chain": [
        "30022",
        "20184",
        "20150",
        "11176",
        "11013",
        "11201",
        "3625"
      ]
    },
    {
      "hadith_no": "2315",
      "source": " Sahih Bukhari ",
      "chapter": "Representation; Authorization; Business by Proxy - كتاب الوكالة",
      "chapter_no": "40",
      "text_ar": "حدثنا أبو الوليد، أخبرنا الليث، عن ابن شهاب، عن عبيد الله، عن زيد بن خالد، وأبي، هريرة رضى الله عنهما عن النبي صلى الله عليه وسلم قال ‏\"‏ واغد يا أنيس إلى امرأة هذا، فإن اعترفت فارجمها ‏\"‏‏.‏",
      "text_en": " Narrated Zaid bin Khalid and Abu Huraira:                     The Prophet said, \"O Unais! Go to the wife of this (man) and if she confesses (that she has committed illegal sexual intercourse), then stone her to death.\"",
      "chain": [
        "20296",
        "20023",
        "11013",
        "11201",
        "3625",
        "13"
      ]
    },
    {
      "hadith_no": "2372",
      "source": " Sahih Bukhari ",
      "chapter": "Distribution of Water - كتاب المساقاة",
      "chapter_no": "42",
      "text_ar": "حدثنا إسماعيل، حدثنا مالك، عن ربيعة بن أبي عبد الرحمن، عن يزيد، مولى المنبعث عن زيد بن خالد  رضى الله عنه  قال جاء رجل إلى رسول الله صلى الله عليه وسلم فسأله عن اللقطة، فقال ‏\"‏ اعرف عفاصها ووكاءها، ثم عرفها سنة، فإن جاء صاحبها وإلا فشأنك بها ‏\"‏‏.‏ قال فضالة الغنم قال ‏\"‏ هي لك أو لأخيك أو للذئب ‏\"‏‏.‏ قال فضالة الإبل قال ‏\"‏ مالك ولها معها سقاؤها وحذاؤها، ترد الماء وتأكل الشجر، حتى يلقاها ربها ‏\"‏‏.‏",
      "text_en": " Narrated Zaid bin Khalid:                     A man came to Allah's Apostle and asked about Al-Luqata (a fallen thing). The Prophet said, \"Recognize its container and its tying material and then make a public announcement about it for one year and if its owner shows up, give it to him; otherwise use it as you like.\" The man said, \"What about a lost sheep?\" The Prophet said, \"It is for you, your brother or the wolf.\" The man said \"What about a lost camel?\" The Prophet said, \"Why should you take it as it has got its water-container (its stomach) and its hooves and it can reach the places of water and can eat the trees till its owner finds it?\"",
      "chain": [
        "30103",
        "20001",
        "11162",
        "11238",
        "3625"
      ]
    },
    {
      "hadith_no": "2427",
      "source": " Sahih Bukhari ",
      "chapter": "Lost Things Picked up by Someone (Luqatah) - كتاب فى اللقطة",
      "chapter_no": "45",
      "text_ar": "حدثنا عمرو بن عباس، حدثنا عبد الرحمن، حدثنا سفيان، عن ربيعة، حدثني يزيد، مولى المنبعث عن زيد بن خالد الجهني  رضى الله عنه  قال جاء أعرابي النبي صلى الله عليه وسلم فسأله عما يلتقطه فقال ‏\"‏ عرفها سنة، ثم احفظ عفاصها ووكاءها، فإن جاء أحد يخبرك بها، وإلا فاستنفقها ‏\"‏‏.‏ قال يا رسول الله فضالة الغنم قال ‏\"‏ لك أو لأخيك أو للذئب ‏\"‏‏.‏ قال ضالة الإبل فتمعر وجه النبي صلى الله عليه وسلم‏.‏ فقال ‏\"‏ ما لك ولها، معها حذاؤها وسقاؤها، ترد الماء وتأكل الشجر ‏\"‏‏.‏",
      "text_en": " Narrated Zaid bin Khalid Al-Juhani:                     A bedouin went to the Prophet and asked him about picking up a lost thing. The Prophet said, \"Make public announcement about it for one year. Remember the description of its container and the string with which it is tied; and if somebody comes and claims it and describes it correctly, (give it to him); otherwise, utilize it.\" He said, \"O Allah's Apostle! What about a lost sheep?\" The Prophet said, \"It is for you, for your brother (i.e. its owner), or for the wolf.\" He further asked, \"What about a lost camel?\" On that the face of the Prophet became red (with anger) and said, \"You have nothing to do with it, as it has its feet, its water reserve and can reach places of water and drink, and eat trees.\"",
      "chain": [
        "30152",
        "20033",
        "20012",
        "11162",
        "11238",
        "3625"
      ]
    },
    {
      "hadith_no": "2428",
      "source": " Sahih Bukhari ",
      "chapter": "Lost Things Picked up by Someone (Luqatah) - كتاب فى اللقطة",
      "chapter_no": "45",
      "text_ar": "حدثنا إسماعيل بن عبد الله، قال حدثني سليمان، عن يحيى، عن يزيد، مولى المنبعث أنه سمع زيد بن خالد  رضى الله عنه  يقول سئل النبي صلى الله عليه وسلم عن اللقطة فزعم أنه قال ‏\"‏ اعرف عفاصها ووكاءها، ثم عرفها سنة ‏\"‏‏.‏ يقول يزيد إن لم تعترف استنفق بها صاحبها وكانت وديعة، عنده‏.‏ قال يحيى فهذا الذي لا أدري أفي حديث رسول الله صلى الله عليه وسلم هو أم شىء من عنده  ثم قال كيف ترى في ضالة الغنم قال النبي صلى الله عليه وسلم ‏\"‏ خذها فإنما هي لك أو لأخيك أو للذئب ‏\"‏‏.‏ قال يزيد وهى تعرف أيضا‏.‏ ثم قال كيف ترى في ضالة الإبل قال فقال ‏\"‏ دعها فإن معها حذاءها وسقاءها، ترد الماء وتأكل الشجر، حتى يجدها ربها ‏\"‏‏.‏",
      "text_en": " Narrated Sulaiman bin Bilal from Yahya:                     Yazid Maula Al-Munba'ith heard Zaid bin Khalid al-Juham saying, \"The Prophet was asked about Luqata. He said, 'Remember the description of its container and the string it is tied with, and announce it publicly for one year.' \" Yazid added, \"If nobody claims then the person who has found it can spend it, and it is regarded as a trust entrusted to him.\" Yahya said, \"I do not know whether the last sentences were said by the Prophet or by Yazid.\" Zaid further said, \"The Prophet was asked, 'What about a lost sheep?' The Prophet said, 'Take it, for it is for you or for your brother (i.e. its owner) or for the wolf.\" Yazid added that it should also be announced publicly. The man then asked the Prophet about a lost camel. The Prophet said, \"Leave it, as it has its feet, water container (reservoir), and it will reach a place of water and eat trees till its owner finds it.\"",
      "chain": [
        "30103",
        "20160",
        "20031",
        "11238",
        "3625"
      ]
    },
    {
      "hadith_no": "2429",
      "source": " Sahih Bukhari ",
      "chapter": "Lost Things Picked up by Someone (Luqatah) - كتاب فى اللقطة",
      "chapter_no": "45",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن ربيعة بن أبي عبد الرحمن، عن يزيد، مولى المنبعث عن زيد بن خالد  رضى الله عنه  قال جاء رجل إلى رسول الله صلى الله عليه وسلم فسأله عن اللقطة‏.‏ فقال ‏\"‏ اعرف عفاصها ووكاءها، ثم عرفها سنة، فإن جاء صاحبها، وإلا فشأنك بها ‏\"‏‏.‏ قال فضالة الغنم قال ‏\"‏ هي لك أو لأخيك أو للذئب ‏\"‏‏.‏ قال فضالة الإبل قال ‏\"‏ ما لك ولها، معها سقاؤها وحذاؤها، ترد الماء وتأكل الشجر، حتى يلقاها ربها ‏\"‏‏.‏",
      "text_en": " Narrated Zaid bin Khalid:                     A man came and asked Allah's Apostle about picking a lost thing. The Prophet said, \"Remember the description of its container and the string it is tied with, and make public announcement about it for one year. If the owner shows up, give it to him; otherwise, do whatever you like with it.\" He then asked, \"What about a lost sheep?\" The Prophet said, \"It is for you, for your brother (i.e. its owner), or for the wolf.\" He further asked, \"What about a lost camel?\" The Prophet said, \"It is none of your concern. It has its water-container (reservoir) and its feet, and it will reach water and drink it and eat the trees till its owner finds it.\"",
      "chain": [
        "30355",
        "20001",
        "11162",
        "11238",
        "3625"
      ]
    },
    {
      "hadith_no": "2436",
      "source": " Sahih Bukhari ",
      "chapter": "Lost Things Picked up by Someone (Luqatah) - كتاب فى اللقطة",
      "chapter_no": "45",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا إسماعيل بن جعفر، عن ربيعة بن أبي عبد الرحمن، عن يزيد، مولى المنبعث عن زيد بن خالد الجهني  رضى الله عنه  أن رجلا سأل رسول الله صلى الله عليه وسلم عن اللقطة قال ‏\"‏ عرفها سنة، ثم اعرف وكاءها وعفاصها، ثم استنفق بها، فإن جاء ربها فأدها إليه ‏\"‏‏.‏ قالوا يا رسول الله فضالة الغنم قال ‏\"‏ خذها فإنما هي لك أو لأخيك أو للذئب ‏\"‏‏.‏ قال يا رسول الله، فضالة الإبل قال فغضب رسول الله صلى الله عليه وسلم حتى احمرت وجنتاه  أو احمر وجهه  ثم قال ‏\"‏ ما لك ولها، معها حذاؤها وسقاؤها، حتى يلقاها ربها ‏\"‏‏.‏",
      "text_en": " Narrated Zaid bin Khalid Al-Juhani:                     A man asked Allah's Apostle about the Luqata. He said, \"Make public announcement of it for one year, then remember the description of its container and the string it is tied with, utilize the money, and if its owner comes back after that, give it to him.\" The people asked, \"O Allah's Apostle! What about a lost sheep?\" Allah's Apostle said, \"Take it, for it is for you, for your brother, or for the wolf.\" The man asked, \"O Allah's Apostle! What about a lost camel?\" Allah's Apostle got angry and his cheeks or face became red, and said, \"You have no concern with it as it has its feet, and its watercontainer, till its owner finds it.\"",
      "chain": [
        "30367",
        "20155",
        "11162",
        "11238",
        "3625"
      ]
    },
    {
      "hadith_no": "2438",
      "source": " Sahih Bukhari ",
      "chapter": "Lost Things Picked up by Someone (Luqatah) - كتاب فى اللقطة",
      "chapter_no": "45",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن ربيعة، عن يزيد، مولى المنبعث عن زيد بن خالد  رضى الله عنه  أن أعرابيا، سأل النبي صلى الله عليه وسلم عن اللقطة قال ‏\"‏ عرفها سنة، فإن جاء أحد يخبرك بعفاصها ووكائها، وإلا فاستنفق بها ‏\"‏‏.‏ وسأله عن ضالة الإبل فتمعر وجهه، قال ‏\"‏ ما لك ولها معها سقاؤها وحذاؤها، ترد الماء وتأكل الشجر، دعها حتى يجدها ربها ‏\"‏‏.‏ وسأله عن ضالة الغنم‏.‏ فقال ‏\"‏ هي لك أو لأخيك، أو للذئب ‏\"‏‏.‏",
      "text_en": " Narrated Zaid bin Khalid:                     A bedouin asked the Prophet about the Luqata. The Prophet said, \"Make public announcement about it for one year and if then somebody comes and describes the container of the Luqata and the string it was tied with, (give it to him); otherwise, spend it.\" He then asked the Prophet about a lost camel. The face of the Prophet become red and he said, \"You have o concern with it as it has its water reservoir and feet and it will reach water and drink and eat trees. Leave it till its owner finds it.\" He then asked the Prophet about a lost sheep. The Prophet said, \"It is for you, for your brother, or for the wolf.\"",
      "chain": [
        "30388",
        "20005",
        "11162",
        "11238",
        "3625"
      ]
    },
    {
      "hadith_no": "2555",
      "source": " Sahih Bukhari ",
      "chapter": "Manumission of Slaves - كتاب العتق",
      "chapter_no": "49",
      "text_ar": "حدثنا مالك بن إسماعيل، حدثنا سفيان، عن الزهري، حدثني عبيد الله، سمعت أبا هريرة، وزيد بن خالد، رضى الله عنهما عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا زنت الأمة فاجلدوها، ثم إذا زنت فاجلدوها، ثم إذا زنت فاجلدوها، في الثالثة أو الرابعة بيعوها ولو بضفير ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira and Zaid bin Khalid:                     The Prophet said, \"If a slave-girl (Ama) commits illegal sexual intercourse, scourge her; if she does it again, scourge her again; if she repeats it, scourge her again.\" The narrator added that on the third or the fourth offense, the Prophet said, \"Sell her even for a hair rope.\"",
      "chain": [
        "20357",
        "20012",
        "11013",
        "11201",
        "13",
        "3625"
      ]
    },
    {
      "hadith_no": "2649",
      "source": " Sahih Bukhari ",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا يحيى بن بكير، حدثنا الليث، عن عقيل، عن ابن شهاب، عن عبيد الله بن عبد الله، عن زيد بن خالد  رضى الله عنه  عن رسول الله صلى الله عليه وسلم أنه أمر فيمن زنى ولم يحصن بجلد مائة وتغريب عام‏.‏",
      "text_en": " Narrated Zaid bin Khalid:                     Allah's Apostle ordered that an unmarried man who committed illegal sexual intercourse be scourged one hundred lashes and sent into exile for one year.",
      "chain": [
        "30399",
        "20023",
        "11207",
        "11013",
        "11004",
        "3625"
      ]
    },
    {
      "hadith_no": "2695",
      "source": " Sahih Bukhari ",
      "chapter": "Peacemaking - كتاب الصلح",
      "chapter_no": "53",
      "text_ar": "حدثنا آدم، حدثنا ابن أبي ذئب، حدثنا الزهري، عن عبيد الله بن عبد الله، عن أبي هريرة، وزيد بن خالد الجهني، رضى الله عنهما قالا جاء أعرابي فقال يا رسول الله اقض بيننا بكتاب الله‏.‏ فقام خصمه فقال صدق، اقض بيننا بكتاب الله‏.‏ فقال الأعرابي إن ابني كان عسيفا على هذا، فزنى بامرأته، فقالوا لي على ابنك الرجم‏.‏ ففديت ابني منه بمائة من الغنم ووليدة، ثم سألت أهل العلم، فقالوا إنما على ابنك جلد مائة وتغريب عام‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ لأقضين بينكما بكتاب الله، أما الوليدة والغنم فرد عليك، وعلى ابنك جلد مائة وتغريب عام، وأما أنت يا أنيس  لرجل  فاغد على امرأة هذا فارجمها ‏\"‏‏.‏ فغدا عليها أنيس فرجمها‏.‏",
      "text_en": " Narrated Abu Huraira and Zaid bin Khalid Al-Juhani:                     A bedouin came and said, \"O Allah's Apostle! Judge between us according to Allah's Laws.\" His opponent got up and said, \"He is right. Judge between us according to Allah's Laws.\" The bedouin said, \"My son was a laborer working for this man, and he committed illegal sexual intercourse with his wife. The people told me that my son should be stoned to death; so, in lieu of that, I paid a ransom of one hundred sheep and a slave girl to save my son. Then I asked the learned scholars who said, \"Your son has to be lashed one-hundred lashes and has to be exiled for one year.\" The Prophet said, \"No doubt I will judge between you according to Allah's Laws. The slave-girl and the sheep are to go back to you, and your son will get a hundred lashes and one year exile.\" He then addressed somebody, \"O Unais! go to the wife of this (man) and stone her to death\" So, Unais went and stoned her to death.",
      "chain": [
        "20404",
        "20177",
        "11013",
        "11004",
        "13",
        "3625"
      ]
    },
    {
      "hadith_no": "2724",
      "source": " Sahih Bukhari ",
      "chapter": "Conditions - كتاب الشروط",
      "chapter_no": "54",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا ليث، عن ابن شهاب، عن عبيد الله بن عبد الله بن عتبة بن مسعود، عن أبي هريرة، وزيد بن خالد الجهني، رضى الله عنهم أنهما قالا إن رجلا من الأعراب أتى رسول الله صلى الله عليه وسلم فقال رسول الله أنشدك الله إلا قضيت لي بكتاب الله‏.‏ فقال الخصم الآخر وهو أفقه منه نعم فاقض بيننا بكتاب الله، وائذن لي‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ قل ‏\"‏‏.‏ قال إن ابني كان عسيفا على هذا، فزنى بامرأته، وإني أخبرت أن على ابني الرجم، فافتديت منه بمائة شاة ووليدة، فسألت أهل العلم فأخبروني أنما على ابني جلد مائة، وتغريب عام، وأن على امرأة هذا الرجم‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ والذي نفسي بيده لأقضين بينكما بكتاب الله، الوليدة والغنم رد، وعلى ابنك جلد مائة وتغريب عام، اغد يا أنيس إلى امرأة هذا فإن اعترفت فارجمها ‏\"‏‏.‏ قال فغدا عليها فاعترفت، فأمر بها رسول الله صلى الله عليه وسلم فرجمت‏.‏",
      "text_en": " Narrated Abu Huraira and Zaid bin Khalid Al-Juhani:                     A bedouin came to Allah's Apostle and said, \"O Allah's apostle! I ask you by Allah to judge My case according to Allah's Laws.\" His opponent, who was more learned than he, said, \"Yes, judge between us according to Allah's Laws, and allow me to speak.\" Allah's Apostle said, \"Speak.\" He (i .e. the bedouin or the other man) said, \"My son was working as a laborer for this (man) and he committed illegal sexual intercourse with his wife. The people told me that it was obligatory that my son should be stoned to death, so in lieu of that I ransomed my son by paying one hundred sheep and a slave girl. Then I asked the religious scholars about it, and they informed me that my son must be lashed one hundred lashes, and be exiled for one year, and the wife of this (man) must be stoned to death.\" Allah's Apostle said, \"By Him in Whose Hands my soul is, I will judge between you according to Allah's Laws. The slave-girl and the sheep are to be returned to you, your son is to receive a hundred lashes and be exiled for one year. You, Unais, go to the wife of this (man) and if she confesses her guilt, stone her to death.\" Unais went to that woman next morning and she confessed. Allah's Apostle ordered that she be stoned to death.",
      "chain": [
        "30367",
        "20023",
        "11013",
        "11004",
        "13",
        "3625"
      ]
    },
    {
      "hadith_no": "2843",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا أبو معمر، حدثنا عبد الوارث، حدثنا الحسين، قال حدثني يحيى، قال حدثني أبو سلمة، قال حدثني بسر بن سعيد، قال حدثني زيد بن خالد  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من جهز غازيا في سبيل الله فقد غزا، ومن خلف غازيا في سبيل الله بخير فقد غزا ‏\"‏‏.‏",
      "text_en": " Narrated Zaid bin Khalid:                     Allah's Apostle said, \" He who pre pares a Ghazi going in Allah's Cause is given a reward equal to that of) a Ghazi; and he who looks after properly the dependents of a Ghazi going in Allah's Cause is (given a reward equal to that of) Ghazi.\"",
      "chain": [
        "30315",
        "20258",
        "11278",
        "11449",
        "10567",
        "11153",
        "3625"
      ]
    },
    {
      "hadith_no": "3226",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا أحمد، حدثنا ابن وهب، أخبرنا عمرو، أن بكير بن الأشج، حدثه أن بسر بن سعيد حدثه أن زيد بن خالد الجهني  رضى الله عنه  حدثه ومع، بسر بن سعيد عبيد الله الخولاني الذي كان في حجر ميمونة  رضى الله عنها  زوج النبي صلى الله عليه وسلم حدثهما زيد بن خالد أن أبا طلحة حدثه أن النبي صلى الله عليه وسلم قال ‏\"‏ لا تدخل الملائكة بيتا فيه صورة ‏\"‏‏.‏ قال بسر فمرض زيد بن خالد، فعدناه فإذا نحن في بيته بستر فيه تصاوير، فقلت لعبيد الله الخولاني ألم يحدثنا في التصاوير فقال إنه قال ‏\"‏ إلا رقم في ثوب ‏\"‏‏.‏ ألا سمعته قلت لا‏.‏ قال بلى قد ذكره‏.‏",
      "text_en": " Narrated Busr bin Sa`id:                     That Zaid bin Khalid Al-Juhani narrated to him something in the presence of Sa`id bin 'Ubaidullah Al- Khaulani who was brought up in the house of Maimuna the wife of the Prophet. Zaid narrated to them that Abu Talha said that the Prophet said, \"The Angels (of Mercy) do not enter a house wherein there is a picture.\" Busr said, \"Later on Zaid bin Khalid fell ill and we called on him. To our surprise we saw a curtain decorated with pictures in his house. I said to Ubaidullah Al-Khaulani, \"Didn't he (i.e. Zaid) tell us about the (prohibition of) pictures?\" He said, \"But he excepted the embroidery on garments. Didn't you hear him?\" I said, \"No.\" He said, \"Yes, he did.\"",
      "chain": [
        "30007",
        "20029",
        "20377",
        "11154",
        "11153",
        "3625"
      ]
    },
    {
      "hadith_no": "4200",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا خالد بن مخلد، حدثنا سليمان بن بلال، قال حدثني صالح بن كيسان، عن عبيد الله بن عبد الله، عن زيد بن خالد  رضى الله عنه  قال خرجنا مع رسول الله صلى الله عليه وسلم عام الحديبية، فأصابنا مطر ذات ليلة، فصلى لنا رسول الله صلى الله عليه وسلم الصبح، ثم أقبل علينا فقال ‏\"‏ أتدرون ماذا قال ربكم ‏\"‏‏.‏ قلنا الله ورسوله أعلم‏.‏ فقال ‏\"‏ قال الله أصبح من عبادي مؤمن بي وكافر بي، فأما من قال مطرنا برحمة الله وبرزق الله وبفضل الله‏.‏ فهو مؤمن بي، كافر بالكوكب‏.‏ وأما من قال مطرنا بنجم كذا‏.‏ فهو مؤمن بالكوكب، كافر بي ‏\"‏‏.‏",
      "text_en": " Narrated Zaid bin Khalid:                     We went out with Allah's Apostle in the year of Al-Hudaibiya. One night it rained and Allah's Apostle led us in the Fajr prayer and (after finishing it), turned to us and said, \" Do you know what your Lord has said?\" We replied, \"Allah and His Apostle know it better.\" He said, \"Allah said:-- \"(Some of) My slaves got up believing in Me, And (some of them) disbelieving in Me. The one who said: We have been given Rain through Allah's Mercy and Allah's Blessing and Allah's Bounty, Then he is a believer in Me, and is a Disbeliever in the star. And whoever said: We have been given rain because of suchand- such star, Then he is a believer in the star, and is a disbeliever in Me.\"",
      "chain": [
        "30463",
        "20160",
        "11176",
        "11004",
        "3625"
      ]
    },
    {
      "hadith_no": "6023",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا قتيبة، حدثنا الليث، عن بكير، عن بسر بن سعيد، عن زيد بن خالد، عن أبي طلحة، صاحب رسول الله صلى الله عليه وسلم قال إن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن الملائكة لا تدخل بيتا فيه الصورة ‏\"‏‏.‏ قال بسر ثم اشتكى زيد فعدناه، فإذا على بابه ستر فيه صورة فقلت لعبيد الله ربيب ميمونة زوج النبي صلى الله عليه وسلم ألم يخبرنا زيد عن الصور يوم الأول‏.‏ فقال عبيد الله ألم تسمعه حين قال إلا رقما في ثوب‏.‏",
      "text_en": " Narrated Abu Talha:                     Allah's Apostle said, \"Angels (of mercy) do not enter a house where there are pictures.'\" The subnarrator Busr added: \"Then Zaid fell ill and we paid him a visit. Behold! There was, hanging at his door, a curtain decorated with a picture. I said to 'Ubaidullah Al-Khaulani, the step son of Maimuna, the wife of the Prophet , \"Didn't Zaid tell us about the picture the day before yesterday?\" 'Ubaidullah said, \"Didn't you hear him saying: 'except a design in a garment'?\"",
      "chain": [
        "30367",
        "20023",
        "11154",
        "11153",
        "3625"
      ]
    },
    {
      "hadith_no": "6180",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا محمد، حدثنا إسماعيل بن جعفر، أخبرنا ربيعة بن أبي عبد الرحمن، عن يزيد، مولى المنبعث عن زيد بن خالد الجهني، أن رجلا، سأل رسول الله صلى الله عليه وسلم عن اللقطة فقال ‏\"‏ عرفها سنة، ثم اعرف وكاءها وعفاصها، ثم استنفق بها، فإن جاء ربها فأدها إليه ‏\"‏‏.‏ قال يا رسول الله فضالة الغنم قال ‏\"‏ خذها، فإنما هي لك، أو لأخيك، أو للذئب ‏\"‏‏.‏ قال يا رسول الله فضالة الإبل قال فغضب رسول الله صلى الله عليه وسلم حتى احمرت وجنتاه  أو احمر وجهه  ثم قال ‏\"‏ مالك ولها، معها حذاؤها وسقاؤها، حتى يلقاها ربها ‏\"‏‏.‏",
      "text_en": " Narrated Zaid bin Khalid Al-Juhani:                     A man asked Allah's Apostle about \"Al-Luqata\" (a lost fallen purse or a thing picked up by somebody). The Prophet said, \"You should announce it publicly for one year, and then remember and recognize the tying material of its container, and then you can spend it. If its owner came to you, then you should pay him its equivalent.\" The man said, \"O Allah's Apostle! What about a lost sheep?\" The Prophet said, \"Take it because it is for you, for your brother, or for the wolf.\" The man again said, \"O Allah's Apostle! What about a lost camel?\" Allah's Apostle became very angry and furious and his cheeks became red (or his face became red), and he said, \"You have nothing to do with it (the camel) for it has its food and its water container with it till it meets its owner.\"",
      "chain": [
        "30213",
        "20155",
        "11162",
        "11238",
        "3625"
      ]
    },
    {
      "hadith_no": "6715",
      "source": " Sahih Bukhari ",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن ابن شهاب، عن عبيد الله بن عبد الله بن عتبة بن مسعود، عن أبي هريرة، وزيد بن خالد، أنهما أخبراه أن رجلين اختصما إلى رسول الله صلى الله عليه وسلم فقال أحدهما اقض بيننا بكتاب الله‏.‏ وقال الآخر وهو أفقههما أجل يا رسول الله فاقض بيننا بكتاب الله، وائذن لي أن أتكلم‏.‏ قال ‏\"‏ تكلم ‏\"‏‏.‏ قال إن ابني كان عسيفا على هذا  قال مالك والعسيف الأجير  زنى بامرأته، فأخبروني أن على ابني الرجم، فافتديت منه بمائة شاة وجارية لي، ثم إني سألت أهل العلم فأخبروني أن ما على ابني جلد مائة وتغريب عام، وإنما الرجم على امرأته‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أما والذي نفسي بيده لأقضين بينكما بكتاب الله، أما غنمك وجاريتك فرد عليك ‏\"‏‏.‏ وجلد ابنه مائة وغربه عاما، وأمر أنيس الأسلمي أن يأتي امرأة الآخر، فإن اعترفت رجمها، فاعترفت فرجمها‏.‏",
      "text_en": " Narrated Abu Huraira and Zaid bin Khalid:                     Two men had a dispute in the presence of Allah's Apostle. One of them said, \"O Allah's Apostle! Judge between us according to Allah's Laws.\" The other who was wiser, said, \"Yes, O Allah's Apostle! Judge between us according to Allah's Laws and allow me to speak. The Prophet said, \"Speak.\" He said, \"My son was a laborer serving this (person) and he committed illegal sexual intercourse with his wife, The people said that my son is to be stoned to death, but I ransomed him with one-hundred sheep and a slave girl. Then I asked the learned people, who informed me that my son should receive one hundred lashes and will be exiled for one year, and stoning will be the lot for the man's wife.\" Allah's Apostle said, \"Indeed, by Him in Whose Hand my soul is, I will judge between you according to Allah's Laws: As for your sheep and slave girl, they are to be returned to you.\" Then he scourged his son one hundred lashes and exiled him for one year. Then Unais Al- Aslami was ordered to go to the wife of the second man, and if she confessed (the crime), then stone her to death. She did confess, so he stoned her to death.",
      "chain": [
        "30103",
        "20001",
        "11013",
        "11004",
        "13",
        "3625"
      ]
    },
    {
      "hadith_no": "6919",
      "source": " Sahih Bukhari ",
      "chapter": "Punishment of Disbelievers at War with Allah and His Apostle - كتاب المحاربين من أهل الكفر والردة",
      "chapter_no": "87",
      "text_ar": "حدثنا مالك بن إسماعيل، حدثنا عبد العزيز، أخبرنا ابن شهاب، عن عبيد الله بن عبد الله بن عتبة، عن زيد بن خالد الجهني، قال سمعت النبي صلى الله عليه وسلم يأمر فيمن زنى ولم يحصن جلد مائة وتغريب عام‏.‏   قال ابن شهاب وأخبرني عروة بن الزبير، أن عمر بن الخطاب، غرب، ثم لم تزل تلك السنة‏.‏",
      "text_en": " Narrated Zaid bin Khalid Al-Juhani:                     I heard the Prophet ordering that an unmarried person guilty of illegal sexual intercourse be flogged one-hundred stripes and be exiled for one year. `Umar bin Al-Khattab also exiled such a person, and this tradition is still valid.",
      "chain": [
        "20357",
        "20167",
        "11013",
        "11004",
        "3625"
      ]
    },
    {
      "hadith_no": "6923",
      "source": " Sahih Bukhari ",
      "chapter": "Punishment of Disbelievers at War with Allah and His Apostle - كتاب المحاربين من أهل الكفر والردة",
      "chapter_no": "87",
      "text_ar": "حدثنا عاصم بن علي، حدثنا ابن أبي ذئب، عن الزهري، عن عبيد الله، عن أبي هريرة، وزيد بن خالد، أن رجلا، من الأعراب جاء إلى النبي صلى الله عليه وسلم وهو جالس فقال يا رسول الله اقض بكتاب الله‏.‏ فقام خصمه فقال صدق اقض له يا رسول الله بكتاب الله، إن ابني كان عسيفا على هذا فزنى بامرأته فأخبروني أن على ابني الرجم، فافتديت بمائة من الغنم ووليدة، ثم سألت أهل العلم، فزعموا أن ما على ابني جلد مائة وتغريب عام‏.‏ فقال ‏\"‏ والذي نفسي بيده لأقضين بينكما بكتاب الله، أما الغنم والوليدة فرد عليك، وعلى ابنك جلد مائة وتغريب عام، وأما أنت يا أنيس فاغد على امرأة هذا فارجمها ‏\"‏‏.‏ فغدا أنيس فرجمها‏.‏",
      "text_en": " Narrated Abu Huraira and Zaid bin Khalid:                     A bedouin came to the Prophet while he (the Prophet) was sitting, and said, \"O Allah's Apostle! Give your verdict according to Allah's Laws (in our case).\" Then his opponent got up and said, \"He has told the truth, O Allah's Apostle! Decide his case according to Allah's Laws. My son was a laborer working for this person, and he committed illegal sexual intercourse with his wife, and the people told me that my son should be stoned to death, but I offered one-hundred sheep and a slave girl as a ransom for him. Then I asked the religious learned people, and they told me that my son should be flogged with one-hundred stripes and be exiled for one year.\" The Prophet said, \"By Him in Whose Hand my soul is, I will judge you according to Allah's Laws. The sheep and the slave girl will be returned to you and your son will be flogged one-hundred stripes and be exiled for one year. And you, O Unais! Go to the wife of this man (and if she confesses), stone her to death.\" So Unais went in the morning and stoned her to death (after she had confessed).",
      "chain": [
        "20430",
        "20177",
        "11013",
        "11201",
        "13",
        "3625"
      ]
    },
    {
      "hadith_no": "6924",
      "source": " Sahih Bukhari ",
      "chapter": "Punishment of Disbelievers at War with Allah and His Apostle - كتاب المحاربين من أهل الكفر والردة",
      "chapter_no": "87",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن ابن شهاب، عن عبيد الله بن عبد الله، عن أبي هريرة، وزيد بن خالد، رضى الله عنهما أن رسول الله صلى الله عليه وسلم سئل عن الأمة إذا زنت ولم تحصن قال ‏\"‏ إذا زنت فاجلدوها، ثم إن زنت فاجلدوها، ثم إن زنت فاجلدوها، ثم بيعوها ولو بضفير ‏\"‏‏.‏ قال ابن شهاب لا أدري بعد الثالثة أو الرابعة‏.‏",
      "text_en": " Narrated Abu Huraira and Zaid bin Khalid:                     The verdict of Allah's Apostle was sought about an unmarried slave girl guilty of illegal intercourse. He replied, \"If she commits illegal sexual intercourse, then flog her (fifty stripes), and if she commits illegal sexual intercourse (after that for the second time), then flog her (fifty stripes), and if she commits illegal sexual intercourse (for the third time), then flog her (fifty stripes) and sell her for even a hair rape.\" Ibn Shihab said, \"I am not sure whether the Prophet ordered that she be sold after the third or fourth time of committing illegal intercourse.\"",
      "chain": [
        "30355",
        "20001",
        "11013",
        "11004",
        "13",
        "3625"
      ]
    },
    {
      "hadith_no": "6928",
      "source": " Sahih Bukhari ",
      "chapter": "Punishment of Disbelievers at War with Allah and His Apostle - كتاب المحاربين من أهل الكفر والردة",
      "chapter_no": "87",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن ابن شهاب، عن عبيد الله بن عبد الله بن عتبة بن مسعود، عن أبي هريرة، وزيد بن خالد، أنهما أخبراه أن رجلين اختصما إلى رسول الله صلى الله عليه وسلم فقال أحدهما اقض بيننا بكتاب الله‏.‏ وقال الآخر وهو أفقههما أجل يا رسول الله فاقض بيننا بكتاب الله، وأذن لي أن أتكلم‏.‏ قال ‏\"‏ تكلم ‏\"‏‏.‏ قال إن ابني كان عسيفا على هذا  قال مالك والعسيف الأجير  فزنى بامرأته، فأخبروني أن على ابني الرجم، فافتديت منه بمائة شاة وبجارية لي، ثم إني سألت أهل العلم فأخبروني أن ما على ابني جلد مائة وتغريب عام، وإنما الرجم على امرأته‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أما والذي نفسي بيده لأقضين بينكما بكتاب الله، أما غنمك وجاريتك فرد عليك ‏\"‏‏.‏ وجلد ابنه مائة وغربه عاما، وأمر أنيسا الأسلمي أن يأتي امرأة الآخر، فإن اعترفت فارجمها، فاعترفت فرجمها‏.‏",
      "text_en": " Narrated Abu Huraira and Zaid bin Khalid:                     Two men had a dispute in the presence of Allah's Apostle. One of them said, \"Judge us according to Allah's Laws.\" The other who was more wise said, \"Yes, Allah's Apostle, judge us according to Allah's Laws and allow me to speak (first)\" The Prophet said to him, 'Speak \" He said, \"My son was a laborer for this man, and he committed illegal sexual intercourse with his wife, and the people told me that my son should be stoned to death, but I have given one-hundred sheep and a slave girl as a ransom (expiation) for my son's sin. Then I asked the religious learned people (about It), and they told me that my son should he flogged one-hundred stripes and should be exiled for one year, and only the wife of this man should be stoned to death \" Allah's Apostle said, \"By Him in Whose Hand my soul is, I will judge you according to Allah's Laws: O man, as for your sheep and slave girl, they are to be returned to you.\" Then the Prophet had the man's son flogged one hundred stripes and exiled for one year, and ordered Unais Al-Aslami to go to the wife of the other man, and if she confessed, stone her to death. She confessed and was stoned to death.",
      "chain": [
        "30355",
        "20001",
        "11013",
        "11004",
        "13",
        "3625"
      ]
    },
    {
      "hadith_no": "6944",
      "source": " Sahih Bukhari ",
      "chapter": "Punishment of Disbelievers at War with Allah and His Apostle - كتاب المحاربين من أهل الكفر والردة",
      "chapter_no": "87",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا ابن عيينة، عن الزهري، عن عبيد الله بن عبد الله بن عتبة، عن أبي هريرة، وزيد بن خالد الجهني، قالا جاء رجل إلى النبي صلى الله عليه وسلم فقال أنشدك الله إلا قضيت بيننا بكتاب الله‏.‏ فقام خصمه وكان أفقه منه فقال صدق، اقض بيننا بكتاب الله، وأذن لي يا رسول الله‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ قل ‏\"‏‏.‏ فقال إن ابني كان عسيفا في أهل، هذا فزنى بامرأته، فافتديت منه بمائة شاة وخادم وإني سألت رجالا من أهل العلم فأخبروني أن على ابني جلد مائة وتغريب عام، وأن على امرأة هذا الرجم‏.‏ فقال ‏\"‏ والذي نفسي بيده لأقضين بينكما بكتاب الله، المائة والخادم رد عليك، وعلى ابنك جلد مائة وتغريب عام، ويا أنيس اغد على امرأة هذا فسلها، فإن اعترفت فارجمها ‏\"‏‏.‏ فاعترفت فرجمها‏.‏",
      "text_en": " Narrated Abu Huraira and Zaid bin Khalid Al-Juhani:                     A man came to the Prophet and said, \"I beseech you to judge us according to Allah's Laws.\" Then his opponent who was wiser than he, got up and said, \"He has spoken the truth. So judge us according to Allah's Laws and please allow me (to speak), O Allah's Apostle.\" The Prophet said, \"Speak.\" He said, \"My son was a laborer for the family of this man and he committed illegal sexual intercourse with his wife, and I gave one-hundred sheep and a slave as a ransom (for my son), but I asked the religious learned people (regarding this case), and they informed me that my son should be flogged onehundred stripes, and be exiled for one year, and the wife of this man should be stoned (to death).\"The Prophet said, \"By Him in Whose Hand my soul is, I will Judge you (in this case) according to Allah's Laws. The one-hundred (sheep) and the slave shall be returned to you and your son shall be flogged one-hundred stripes and be exiled for one year. And O Unais! Go in the morning to the wife of this man and ask her, and if she confesses, stone her to death.\" She confessed and he stoned her to death.",
      "chain": [
        "30388",
        "20005",
        "11013",
        "11004",
        "13",
        "3625"
      ]
    },
    {
      "hadith_no": "7280",
      "source": " Sahih Bukhari ",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثنا آدم، حدثنا ابن أبي ذئب، حدثنا الزهري، عن عبيد الله بن عبد الله، عن أبي هريرة، وزيد بن خالد الجهني، قالا جاء أعرابي فقال يا رسول الله اقض بيننا بكتاب الله فقام خصمه فقال صدق فاقض بيننا بكتاب الله‏.‏ فقال الأعرابي إن ابني كان عسيفا على هذا فزنى بامرأته، فقالوا لي على ابنك الرجم‏.‏ ففديت ابني منه بمائة من الغنم ووليدة، ثم سألت أهل العلم فقالوا إنما على ابنك جلد مائة وتغريب عام‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ لأقضين بينكما بكتاب الله، أما الوليدة والغنم فرد عليك، وعلى ابنك جلد مائة وتغريب عام، وأما أنت يا أنيس  لرجل  فاغد على امرأة هذا فارجمها ‏\"‏‏.‏ فغدا عليها أنيس فرجمها‏.‏",
      "text_en": " Narrated Abu Huraira and Zaid bin Khalid Al-Juhani:                     A bedouin came and said, \"O Allah's Apostle! Judge between us according to Allah's Book (Laws).\" His opponent stood up and said, \"He has said the truth, so judge between us according to Allah's Laws.\" The bedouin said, \"My son was a laborer for this man and committed illegal sexual intercourse with his wife. The people said to me, 'Your son is to be stoned to death,' so I ransomed my son for one hundred sheep and a slave girl. Then I asked the religious learned men and they said to me, 'Your son has to receive one hundred lashes plus one year of exile.' \" The Prophet said, \"I shall judge between you according to Allah's Book (Laws)! As for the slave girl and the sheep, it shall be returned to you, and your son shall receive one-hundred lashes and be exiled for one year. O you, Unais!\" The Prophet addressed some man, \"Go in the morning to the wife of this man and stone her to death.\" So Unais went to her the next morning and stoned her to death.",
      "chain": [
        "20404",
        "20177",
        "11013",
        "11004",
        "13",
        "3625"
      ]
    },
    {
      "hadith_no": "7364",
      "source": " Sahih Bukhari ",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا مسدد، حدثنا سفيان، حدثنا الزهري، عن عبيد الله، عن أبي هريرة، وزيد بن خالد، قالا كنا عند النبي صلى الله عليه وسلم فقال ‏\"‏ لأقضين بينكما بكتاب الله ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira and Zaid bin Khalid:                     We were with the Prophet when he said (to two men), \"I shall judge between you according to Allah's Book (Laws).",
      "chain": [
        "30175",
        "20012",
        "11013",
        "11201",
        "13",
        "3625"
      ]
    },
    {
      "hadith_no": "7595",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا مسدد، حدثنا سفيان، عن صالح، عن عبيد الله، عن زيد بن خالد، قال مطر النبي صلى الله عليه وسلم فقال ‏\"‏ قال الله أصبح من عبادي كافر بي ومؤمن بي ‏\"‏‏.‏",
      "text_en": " Narrated Zaid bin Khalid:                     It rained (because of the Prophet's invocation for rain) and the Prophet said, \"Allah said, 'Some of My slaves have become disbelievers in Me, and some others, believers in Me.'\"",
      "chain": [
        "30175",
        "20012",
        "11176",
        "11201",
        "3625"
      ]
    },
    {
      "hadith_no": "240",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن صالح بن كيسان، عن عبيد الله بن عبد الله بن عتبة، عن زيد بن خالد الجهني، قال صلى بنا رسول الله صلى الله عليه وسلم صلاة الصبح بالحديبية في إثر السماء كانت من الليل فلما انصرف أقبل على الناس فقال ‏\"‏ هل تدرون ماذا قال ربكم ‏\"‏ ‏.‏ قالوا الله ورسوله أعلم ‏.‏ قال ‏\"‏ قال أصبح من عبادي مؤمن بي وكافر فأما من قال مطرنا بفضل الله ورحمته ‏.‏ فذلك مؤمن بي وكافر بالكوكب وأما من قال مطرنا بنوء كذا وكذا ‏.‏ فذلك كافر بي مؤمن بالكوكب ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Zaid b. Khalid al-Juhani:                      The Messenger of Allah (may peace and blessings be upon him) led the morning prayer at Hudaybiya. There were some marks of the rainfall during the night. At the conclusion of prayer he turned towards people and observed: Do you know what your Lord has said? They replied: Allah and His Messenger know best. Upon this he (the Holy Prophet) remarked: He (Allah) said: Some of My bondsmen entered the morning as My believers and some as unbelievers. He who said: We have had a rainfall due to the Blessing and Mercy of Allah, he is My believer and a disbeliever of stars, and who said: We have had a rainfall due to the rising of such and such (star) disbelieved Me and affirmed his faith in the stars.",
      "chain": [
        "30399",
        "11176",
        "11004",
        "3625"
      ]
    },
    {
      "hadith_no": "347",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثني زهير بن حرب، وعبد بن حميد، قالا حدثنا عبد الصمد بن عبد الوارث، ح وحدثنا عبد الوارث بن عبد الصمد، - واللفظ له - حدثني أبي، عن جدي، عن الحسين بن ذكوان، عن يحيى بن أبي كثير، أخبرني أبو سلمة، أن عطاء بن يسار، أخبره أن زيد بن خالد الجهني أخبره أنه، سأل عثمان بن عفان قال قلت أرأيت إذا جامع الرجل امرأته ولم يمن قال عثمان ‏\"‏ يتوضأ كما يتوضأ للصلاة ويغسل ذكره ‏\"‏ ‏.‏ قال عثمان سمعته من رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Zaid b. Khalid al-Jubani reported that he askad Uthman b. 'Affan:                      What is your opinion about the man who has sexual intercourse with his wife, but does not experience orgasm? Uthman said: He should perform ablution as he does for prayer, and wash his organ. 'Uthmin also said: I have heard it from the Messenger of Allah (may peace be upon him).",
      "chain": [
        "30022",
        "30553",
        "20250",
        "20258",
        "11449",
        "10567",
        "11020",
        "3625",
        "4"
      ]
    },
    {
      "hadith_no": "507",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن أبي النضر، عن بسر بن سعيد، أن زيد بن خالد الجهني، أرسله إلى أبي جهيم يسأله ماذا سمع من، رسول الله صلى الله عليه وسلم في المار بين يدى المصلي قال أبو جهيم قال رسول الله صلى الله عليه وسلم ‏\"‏ لو يعلم المار بين يدى المصلي ماذا عليه لكان أن يقف أربعين خيرا له من أن يمر بين يديه ‏\"‏ ‏.‏ قال أبو النضر لا أدري قال أربعين يوما أو شهرا أو سنة",
      "text_en": " Busr b Sa'id reported that Zaid b Khalid al-Juhani sent him to Abu Juhaim in order to ask him what he had heard from the Messenger of Allah (may peace be upon him) with regard to the passer in front of the worshipper. Abu Juhaim reported that the Messenger of Allah (may peace be upon him) said:                      If anyone who passes in front of a man who is praying knew the responsibility he incurs, he would stand still forty (years) rather than to pass in front of him Abu Nadr said: I do not know whether he said forty days or months or years.",
      "chain": [
        "30399",
        "11164",
        "11153",
        "3625"
      ]
    },
    {
      "hadith_no": "507",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الله بن هاشم بن حيان العبدي، حدثنا وكيع، عن سفيان، عن سالم أبي النضر، عن بسر بن سعيد، أن زيد بن خالد الجهني، أرسل إلى أبي جهيم الأنصاري ما سمعت النبي صلى الله عليه وسلم يقول فذكر بمعنى حديث مالك ‏.‏",
      "text_en": " This hadith has been narrated from Abu Juhaim Ansari by another chain of transmitters.",
      "chain": [
        "20032",
        "20012",
        "11164",
        "11153",
        "3625"
      ]
    },
    {
      "hadith_no": "1840",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا قتيبة بن سعيد، عن مالك بن أنس، عن عبد الله بن أبي بكر، عن أبيه، أن عبد الله بن قيس بن مخرمة، أخبره عن زيد بن خالد الجهني، أنه قال لأرمقن صلاة رسول الله صلى الله عليه وسلم الليلة فصلى ‏.‏ ركعتين خفيفتين ثم صلى ركعتين طويلتين طويلتين طويلتين ثم صلى ركعتين وهما دون اللتين قبلهما ثم صلى ركعتين وهما دون اللتين قبلهما ثم صلى ركعتين وهما دون اللتين قبلهما ثم صلى ركعتين وهما دون اللتين قبلهما ثم أوتر فذلك ثلاث عشرة ركعة ‏.‏",
      "text_en": " Jabir b. 'Abdullah reported:                      I accompanied the Messenger of Allah (may peace be upon him) in a journey and we reached a watering place. He said: Jabir, are you going to enter it? I said: Yes. The Messenger of Allah (may peace be upon him) then got down and I entered it. He (the Holy Prophet) then went away to relieve himself and I placed for him water for ablution. He then came back and performed ablution, and then stood and prayed in one garment, having its ends tied from the opposite sides. I stood. behind him and he caught hold of my ear and made me stand on his right side.",
      "chain": [
        "30367",
        "20001",
        "11104",
        "11239",
        "929",
        "3625"
      ]
    },
    {
      "hadith_no": "4531",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Punishments Prescribed by Islam - كتاب الحدود",
      "chapter_no": "30",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا ليث، ح وحدثناه محمد بن رمح، أخبرنا الليث، عن ابن شهاب، عن عبيد الله بن عبد الله بن عتبة بن مسعود، عن أبي هريرة، وزيد بن خالد، الجهني أنهما قالا إن رجلا من الأعراب أتى رسول الله صلى الله عليه وسلم فقال يا رسول الله أنشدك الله إلا قضيت لي بكتاب الله ‏.‏ فقال الخصم الآخر وهو أفقه منه نعم فاقض بيننا بكتاب الله وائذن لي ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ قل ‏\"‏ ‏.‏ قال إن ابني كان عسيفا على هذا فزنى بامرأته وإني أخبرت أن على ابني الرجم فافتديت منه بمائة شاة ووليدة فسألت أهل العلم فأخبروني أنما على ابني جلد مائة وتغريب عام وأن على امرأة هذا الرجم ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ والذي نفسي بيده لأقضين بينكما بكتاب الله الوليدة والغنم رد وعلى ابنك جلد مائة وتغريب عام واغد يا أنيس إلى امرأة هذا فإن اعترفت فارجمها ‏\"‏ ‏.‏ قال فغدا عليها فاعترفت فأمر بها رسول الله صلى الله عليه وسلم فرجمت ‏.‏",
      "text_en": " Abu Huraira and Zaid b Khalid al-Juhani reported that one of the desert tribes came to Allah's Messenger (may peace be upon him) and said:                      Messenger of Allah, I beg of you in the name of Allah that you pronounce judgment about me according to the Book of Allah. The second claimant who was wiser than him said: Well, decide amongst us according to the Book of Allah, but permit me (to say something). Thereupon Allah's Messenger (may peace be upon ham) said: Say. He said: My son was a servant in the house of this person and he committed adultery with his wife. I was informed that my son deserved stoning to death (as punishment for this offence). I gave one hundred goats and a slave girl as ransom for this. I asked the scholars (if this could serve as an expiation for this offence). They informed me that my son deserved one hundred lathes and exile for one year. and this woman deserved stoning (as she was married). Thereupon Allah's Messenger (may peace he upon him) said: By Him in Whose Hand is my life. I will decide between you according to the Book of Allah. The slave-girl and the goats should be given back, and your son is to be punished with one hundred lashes and exile for one year. And, O Unais (b. Zuhaq al-Aslami), go to this woman in the morning, and if she makes a confession, then stone her. He (the narrator) said: He went to her in the morning and she made a confession. And Allah's Messenger (may peace be upon him) made pronouncement about her and she was stoned to death.",
      "chain": [
        "30367",
        "20023",
        "30490",
        "20023",
        "11013",
        "11004",
        "13",
        "3625"
      ]
    },
    {
      "hadith_no": "4545",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Punishments Prescribed by Islam - كتاب الحدود",
      "chapter_no": "30",
      "text_ar": "وحدثنا أبو الطاهر، أخبرنا ابن وهب، قال سمعت مالكا، يقول حدثني ابن شهاب، عن عبيد الله بن عبد الله بن عتبة، عن أبي هريرة، وزيد بن خالد الجهني، أن رسول الله صلى الله عليه وسلم سئل عن الأمة ‏.‏ بمثل حديثهما ولم يذكر قول ابن شهاب والضفير الحبل ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Abu Huraira and Zaid b. Khalid al-Jubani, but in this no merition is made of the words of Ibn Shihab that dafir means rope.",
      "chain": [
        "20029",
        "20001",
        "11013",
        "11004",
        "13",
        "3625"
      ]
    },
    {
      "hadith_no": "4546",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Punishments Prescribed by Islam - كتاب الحدود",
      "chapter_no": "30",
      "text_ar": "حدثني عمرو الناقد، حدثنا يعقوب بن إبراهيم بن سعد، حدثني أبي، عن صالح، ح وحدثنا عبد بن حميد، أخبرنا عبد الرزاق، أخبرنا معمر، كلاهما عن الزهري، عن عبيد، الله عن أبي هريرة، وزيد بن خالد الجهني، عن النبي صلى الله عليه وسلم ‏.‏ بمثل حديث مالك والشك في حديثهما جميعا في بيعها في الثالثة أو الرابعة ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Abu Huraira and Zaid b. Khalid al-Juhani in the same way as transmitted by Malik with this (difference) tnat there is a doubt whether her sale (that of the slave-girl committing adultery) was mentioned after the third or the fourth time.",
      "chain": [
        "30263",
        "20184",
        "20150",
        "11176",
        "30553",
        "20121",
        "11013",
        "11201",
        "13",
        "3625"
      ]
    },
    {
      "hadith_no": "4591",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Judicial Decisions - كتاب الأقضية",
      "chapter_no": "31",
      "text_ar": "وحدثنا يحيى بن يحيى، قال قرأت على مالك عن عبد الله بن أبي بكر، عن أبيه، عن عبد الله بن عمرو بن عثمان، عن ابن أبي عمرة الأنصاري، عن زيد بن خالد، الجهني أن النبي صلى الله عليه وسلم قال ‏\"‏ ألا أخبركم بخير الشهداء الذي يأتي بشهادته قبل أن يسألها ‏\"‏ ‏.‏",
      "text_en": " Zaid b. Khalid al-Juhani reported Allah's Apostle (may peace be upon him) as saying:                      Should I not tell you of the best witnesses? He is the one who produces his evidence before he is asked for it.",
      "chain": [
        "30399",
        "11104",
        "11239",
        "10933",
        "3625"
      ]
    },
    {
      "hadith_no": "4595",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Luqatah - كتاب اللقطة",
      "chapter_no": "32",
      "text_ar": "حدثنا يحيى بن يحيى التميمي، قال قرأت على مالك عن ربيعة بن أبي عبد، الرحمن عن يزيد، مولى المنبعث عن زيد بن خالد الجهني، أنه قال جاء رجل إلى النبي صلى الله عليه وسلم فسأله عن اللقطة فقال ‏\"‏ اعرف عفاصها ووكاءها ثم عرفها سنة فإن جاء صاحبها وإلا فشأنك بها ‏\"‏ ‏.‏ قال فضالة الغنم قال ‏\"‏ لك أو لأخيك أو للذئب ‏\"‏ ‏.‏ قال فضالة الإبل قال ‏\"‏ ما لك ولها معها سقاؤها وحذاؤها ترد الماء وتأكل الشجر حتى يلقاها ربها ‏\"‏ ‏.‏ قال يحيى أحسب قرأت عفاصها",
      "text_en": " Zaid b. Khalid al-Juhani reported:                      A man came to Allah's Apostle (may peace be upon him) and asked him about picking up of stray articles. He said: Recognise (well) its bag and the strap (by which it is tied) then make announcement of that for a year. If its owner comes (within this time return that to him), otherwise it is yours. He (again) said: (What about) the lost goat? Thereupon he (the Holy Prophet) said: It is yours or for your brother, or for the wolf. He said: (What about) the lost camel? Thereupon he said: You have nothing to do with it; it has a leather bag along with it, and its shoes also. It comes to the watering-place, eats (the leaves of the) trees until its master finds him.",
      "chain": [
        "30399",
        "11162",
        "11238",
        "3625"
      ]
    },
    {
      "hadith_no": "4596",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Luqatah - كتاب اللقطة",
      "chapter_no": "32",
      "text_ar": "وحدثنا يحيى بن أيوب، وقتيبة، وابن، حجر قال ابن حجر أخبرنا وقال الآخران، حدثنا إسماعيل، - وهو ابن جعفر - عن ربيعة بن أبي عبد الرحمن، عن يزيد، مولى المنبعث عن زيد بن خالد الجهني، أن رجلا، سأل رسول الله صلى الله عليه وسلم عن اللقطة فقال ‏\"‏ عرفها سنة ثم اعرف وكاءها وعفاصها ثم استنفق بها فإن جاء ربها فأدها إليه ‏\"‏ ‏.‏ فقال يا رسول الله فضالة الغنم قال ‏\"‏ خذها فإنما هي لك أو لأخيك أو للذئب ‏\"‏ ‏.‏ فقال يا رسول الله فضالة الإبل قال فغضب رسول الله صلى الله عليه وسلم حتى احمرت وجنتاه - أو احمر وجهه - ثم قال ‏\"‏ ما لك ولها معها حذاؤها وسقاؤها حتى يلقاها ربها ‏\"‏ ‏.‏",
      "text_en": " Zaid b. Khalid al-Juhani reported that a person asked Allah's Apostle (may peace be upon him) about picking up of stray articles, whereupon he said:                      Make announcement about it for a year, and recognise well the strap and the bag (containing that) ; then spend that; and if its owner comes, make him the payment of that. He (the inquirer) said: Messenger of Allah, what about the lost goat? he said: Take it, for that is yours or for your brother, or for the wolf. He (again) said: (What about) the lost camel? The Messenger of Allah (may peace be upon him) was enraged until his cheeks became red (or his face became red) and then said: You have nothing to do about that; it has feet and a leather bag (to quench its thirst) until its owner finds it.",
      "chain": [
        "20379",
        "30367",
        "20155",
        "11162",
        "11238",
        "3625"
      ]
    },
    {
      "hadith_no": "4598",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Luqatah - كتاب اللقطة",
      "chapter_no": "32",
      "text_ar": "وحدثني أحمد بن عثمان بن حكيم الأودي، حدثنا خالد بن مخلد، حدثني سليمان، - وهو ابن بلال - عن ربيعة بن أبي عبد الرحمن، عن يزيد، مولى المنبعث قال سمعت زيد بن خالد الجهني، يقول أتى رجل رسول الله صلى الله عليه وسلم ‏.‏ فذكر نحو حديث إسماعيل بن جعفر ‏.‏ غير أنه قال فاحمار وجهه وجبينه وغضب ‏.‏ وزاد بعد قوله ‏\"‏ ثم عرفها سنة ‏\"‏ ‏.‏ ‏\"‏ فإن لم يجئ صاحبها كانت وديعة عندك ‏\"‏ ‏.‏",
      "text_en": " Zaid b. Khalid al-Juhani reported. There came to Allah's Messenger (may peace be upon him) a person, the rest of the hadith is the same but with the variation (of these words):                      His face became red, his forehead too, and he felt annoyed; and made an addition after the words: He should make announcement of that for a year, and if its owner does not turn up, then it is a trust with you.",
      "chain": [
        "30185",
        "30463",
        "20160",
        "11162",
        "11238",
        "3625"
      ]
    },
    {
      "hadith_no": "4600",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Luqatah - كتاب اللقطة",
      "chapter_no": "32",
      "text_ar": "وحدثني إسحاق بن منصور، أخبرنا حبان بن هلال، حدثنا حماد بن سلمة، حدثني يحيى بن سعيد، وربيعة الرأى بن أبي عبد الرحمن، عن يزيد، مولى المنبعث عن زيد بن، خالد الجهني أن رجلا، سأل النبي صلى الله عليه وسلم عن ضالة الإبل ‏.‏ زاد ربيعة فغضب حتى احمرت وجنتاه ‏.‏ واقتص الحديث بنحو حديثهم وزاد ‏\"‏ فإن جاء صاحبها فعرف عفاصها وعددها ووكاءها فأعطها إياه وإلا فهى لك ‏\"‏ ‏.‏",
      "text_en": " Zaid b. Khalid al-Juhani reported:                      A person asked Allah's Apostle (may peace be upon him) about a lost camel; Rabi'a made this addition: He (the Holy Prophet) was so much annoyed that his cheeks became red.\" The rest of the hadith is the same. He (the narrator) made this addition:\" If its (that of the article) owner comes and he recognises the bag (which contained it) and its number, and the strap. then give that to them, but if not, then it is for you.\"",
      "chain": [
        "30313",
        "20218",
        "20021",
        "11062",
        "11238",
        "3625"
      ]
    },
    {
      "hadith_no": "4601",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Luqatah - كتاب اللقطة",
      "chapter_no": "32",
      "text_ar": "وحدثني أبو الطاهر، أحمد بن عمرو بن سرح أخبرنا عبد الله بن وهب، حدثني الضحاك بن عثمان، عن أبي النضر، عن بسر بن سعيد، عن زيد بن خالد الجهني، قال سئل رسول الله صلى الله عليه وسلم عن اللقطة فقال ‏\"‏ عرفها سنة فإن لم تعترف فاعرف عفاصها ووكاءها ثم كلها فإن جاء صاحبها فأدها إليه ‏\"‏ ‏.‏ وحدثنيه إسحاق بن منصور، أخبرنا أبو بكر الحنفي، حدثنا الضحاك بن عثمان، بهذا الإسناد وقال في الحديث ‏\"‏ فإن اعترفت فأدها وإلا فاعرف عفاصها ووكاءها وعددها ‏\"‏ ‏.‏",
      "text_en": " Zaid b. Khalid al-Juhani reported that Allah's Messenger (may peace be upon him) was asked about picking up of stray things, whereupon he said:                      Make announcement of that for one year, but if it is not recognised (by the owner), then recognise its big and strap, then eat it; and if its owner comes, then give that to him. This hadith has been narrated on the authority of Al-Dahhak b. Uthman with the same chain of transmitters but with a slight variation of words.",
      "chain": [
        "20029",
        "20504",
        "11164",
        "11153",
        "3625"
      ]
    },
    {
      "hadith_no": "4607",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Luqatah - كتاب اللقطة",
      "chapter_no": "32",
      "text_ar": "وحدثني أبو الطاهر، ويونس بن عبد الأعلى، قالا حدثنا عبد الله بن وهب، قال أخبرني عمرو بن الحارث، عن بكر بن سوادة، عن أبي سالم الجيشاني، عن زيد بن خالد، الجهني عن رسول الله صلى الله عليه وسلم أنه قال ‏\"‏ من آوى ضالة فهو ضال ما لم يعرفها ‏\"‏ ‏.‏",
      "text_en": " Zaid b. Khalid al-Juhani reported Allah's Messenger (may peace be upon him) as sayin.:                      He who found a stray article is himself led astray if he does not advertise it.",
      "chain": [
        "20029",
        "20377",
        "10849",
        "10858",
        "3625"
      ]
    },
    {
      "hadith_no": "5011",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا سعيد بن منصور، وأبو الطاهر، قال أبو الطاهر أخبرنا ابن وهب، وقال، سعيد حدثنا عبد الله بن وهب، أخبرني عمرو بن الحارث، عن بكير بن الأشج، عن بسر، بن سعيد عن زيد بن خالد الجهني، عن رسول الله صلى الله عليه وسلم أنه قال ‏\"‏ من جهز غازيا في سبيل الله فقد غزا ومن خلفه في أهله بخير فقد غزا ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Zaid b. Khalid al-Juhani that the Messenger of Allah (may peace be upon him) said:                      Anybody who equips a warrior (going to fight) in the way of Allah (is like one who actually) fights. And anybody who looks well after his family in his absence (is also like one who actually) fights.",
      "chain": [
        "30116",
        "20029",
        "11168",
        "20029",
        "20377",
        "11154",
        "11153",
        "3625"
      ]
    },
    {
      "hadith_no": "5012",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا أبو الربيع الزهراني، حدثنا يزيد، - يعني ابن زريع - حدثنا حسين، المعلم حدثنا يحيى بن أبي كثير، عن أبي سلمة بن عبد الرحمن، عن بسر بن سعيد، عن  زيد بن خالد الجهني، قال قال نبي الله صلى الله عليه وسلم ‏\"‏ من جهز غازيا فقد غزا ومن خلف غازيا في أهله فقد غزا ‏\"‏ ‏.‏",
      "text_en": " The above tradition has been narrated on the authority of Khalid al- Juhani who said:                      The Prophet of Allah (may peace be upon him) said: He who equips a warrior in the way of Allah (is like one who dctually fights) aud he who looks after the family of a warrior in the way of Allah in fact participated in the battle.",
      "chain": [
        "30137",
        "20304",
        "11278",
        "11449",
        "10567",
        "11153",
        "3625"
      ]
    }
  ],
  "total_hadiths": 100
}