{
  "id": "3660",
  "name": "Abu al-Tufayl, 'Amir bin Wathla ( أبو الطفيل عامر بن واثلة ( رضي الله عنه",
  "full_name": "Abu al-Tufayl, 'Amir bin Wathla ( أبو الطفيل عامر بن واثلة ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "1",
      "date_gregorian": "NA",
      "date_display": [
        "1 AH"
      ],
      "place": "Hijaz"
    },
    "death": {
      "date_hijri": "110",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Makkah",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina",
      "Makkak"
    ],
    "area_of_interest": [
      "Narrator [ ع  -  صحابة ]"
    ],
    "tags": [
      "al-Laithi",
      "B.Kinan",
      "Child"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "2",
      "name": "Abu Bakr Al-Siddique ( أبو بكر الصديق ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3",
      "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5",
      "name": "Ali ibn Abi Talib ( علي بن أبي طالب بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "32",
      "name": "Mu'adh ibn Jabal ( معاذ بن جبل بن عمرو بن أوس ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "145",
      "name": "Hudhayfah ibn al-Yaman ( حذيفة بن اليمان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "16",
      "name": "ibn Mas'ud ( عبد الله بن مسعود ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4114",
      "name": "Hdhyfh bin Asyd ( حذيفة بن أسيد ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5309",
      "name": "Naf' bin Abd al-Harith ( نافع بن عبد الحارث بن خالد ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "384",
      "name": "Zayd bin Arqam ( زيد بن أرقم الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11263",
      "name": "Muhammad bin Muslim bin Tadras محمد بن مسلم بن تدرس أبو الزبير",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11019",
      "name": "Qatada قتادة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11257",
      "name": "'Abdul 'Aziz bin Rafi' عبد العزيز بن رفيع",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11343",
      "name": "Sa'd bin Iyas, Abu 'Amr Shaybani سعد بن إياس أبو عمرو الشيباني",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "10792",
      "name": "'Abdul Malik bin Sa'id عبد الملك بن سعيد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11251",
      "name": "'Abdullah bin Abd عبد الله بن عبد الرحمن بن أبي حسين",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11709",
      "name": "'Ikrama bin Khalid bin al-Aas عكرمة بن خالد بن العاص بن هشام",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "13539",
      "name": "'Amarah bin Thuban عمارة بن ثوبان حجازي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11081",
      "name": "'Amr bin Dinar عمرو بن دينار الأثرم الجمحي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11384",
      "name": "Farat bin Abi 'Abdur Rahman فرات بن أبي عبد الرحمن القزاز",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11261",
      "name": "al-Qasim bin Abi Bzh القاسم بن أبي بزة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10712",
      "name": "Khultum bin Jabir كلثوم بن جبر",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11303",
      "name": "Kahmas bin al-Hasan al-Tamimi كهمس بن الحسن التميمي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11564",
      "name": "Ma'ruf bin Kharbudh معروف بن خربوذ",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10969",
      "name": "Mnswr bin Hyan منصور بن حيان",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10659",
      "name": "al-Walid bin 'Abdullah bin Jmy' الوليد بن عبد الله بن جميع الزهري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11411",
      "name": "Yazid bin Abi Habib يزيد بن أبي حبيب",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "127",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا عبيد الله بن موسى عن معروف بن خربوذ عن أبي الطفيل عن علي بذلك‏.‏",
      "text_en": " Narrated Abu at-Tufail:                     The above mentioned Statement of `Ali.",
      "chain": [
        "20340",
        "11564",
        "3660"
      ]
    },
    {
      "hadith_no": "3114",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا أبو كامل، فضيل بن حسين الجحدري حدثنا عبد الواحد بن زياد، حدثنا الجريري، عن أبي الطفيل، قال قلت لابن عباس أرأيت هذا الرمل بالبيت ثلاثة أطواف ومشى أربعة أطواف أسنة هو فإن قومك يزعمون أنه سنة ‏.‏ قال فقال صدقوا وكذبوا ‏.‏ قال قلت ما قولك صدقوا وكذبوا قال إن رسول الله صلى الله عليه وسلم قدم مكة فقال المشركون إن محمدا وأصحابه لا يستطيعون أن يطوفوا بالبيت من الهزال وكانوا يحسدونه ‏.‏ قال فأمرهم رسول الله صلى الله عليه وسلم أن يرملوا ثلاثا ويمشوا أربعا ‏.‏ قال قلت له أخبرني عن الطواف بين الصفا والمروة راكبا أسنة هو فإن قومك يزعمون أنه سنة ‏.‏ قال صدقوا وكذبوا ‏.‏ قال قلت وما قولك صدقوا وكذبوا قال إن رسول الله صلى الله عليه وسلم كثر عليه الناس يقولون هذا محمد هذا محمد ‏.‏ حتى خرج العواتق من البيوت ‏.‏ قال وكان رسول الله صلى الله عليه وسلم لا يضرب الناس بين يديه فلما كثر عليه ركب والمشى والسعى أفضل ‏.‏",
      "text_en": " Abu Tufail reported:                      I said to Ibn Abbas (Allah be pleased with them): Do you think that walking swiftly round the House in three circuits, and just walking in four circuits is the Sunnah (of the Holy Prophet), for your people say that it is Sunnah? Thereupon he (Ibn 'Abbas) said: They have told the truth and the lie (too). I said: What do your words\" They have told the truth and the lie (too)\" imply? Thereupon he said: Allah's Messenger (may peace be upon him) came to Mecca and the polytheists said that Mubammad and his Companions had emaciated and would, therefore, be unable to circumambulate the House; and they felt jealous of him (the Holy Prophet). (It was due to this) that Allah's Messenger (may peace be upon him) commanded them to walk swiftly in three (circuits) and walk (normally) in four. I said to him: Inform me if it is Sunnah to observe Tawaf between al-Safa and al-Marwa while riding, for your people look upon it as Sunnah. He (Ibn Abbas) said: They have told the truth and the lie too. I said: What do your words\" They have told the truth and the lie tool, iMply? He said: as Allah's Messenger (may peace be upon him) had come to Mecca, there was such a large gathering of people around him that even the virgins had come out of their houses (to catch a glimpse of his face). and they were saying: He is Muhammad; He is Muhammad. Allah's Messenger (may peace be upon him) (was so gentle and kind) that the people were not beaten back (to make way) in front of him. When there was a; throng (of people) around him, he rode (the she-camel) but walking and trotting is, however, better.",
      "chain": [
        "30559",
        "20256",
        "11286",
        "3660"
      ]
    },
    {
      "hadith_no": "3116",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا ابن أبي عمر، حدثنا سفيان، عن ابن أبي حسين، عن أبي الطفيل، قال قلت لابن عباس إن قومك يزعمون أن رسول الله صلى الله عليه وسلم رمل بالبيت وبين الصفا والمروة وهى سنة ‏.‏ قال صدقوا وكذبوا ‏.‏",
      "text_en": " Abu Tufail reported:                      I said to Ibn 'Abbas (Allah be pleased with them): People are of the view that Allah's Messenger (may peace be upon him) moved quickly round the House and between al-Safa and al-Marwa, and (thus) it is Sunnah. He said: They told the truth and they told the lie.",
      "chain": [
        "30421",
        "20005",
        "3660"
      ]
    },
    {
      "hadith_no": "3117",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني محمد بن رافع، حدثنا يحيى بن آدم، حدثنا زهير، عن عبد الملك بن، سعيد بن الأبجر عن أبي الطفيل، قال قلت لابن عباس أراني قد رأيت رسول الله صلى الله عليه وسلم ‏.‏ قال فصفه لي ‏.‏ قال قلت رأيته عند المروة على ناقة وقد كثر الناس عليه ‏.‏ قال فقال ابن عباس ذاك رسول الله صلى الله عليه وسلم إنهم كانوا لا يدعون عنه ولا يكهرون ‏.‏",
      "text_en": " Abu Tufail reported; I. said to Ibn 'Abbas (Allah be pleased with them):                      I think that I saw Allah's Messenger (may peace be upon him). He (Ibn 'Abbis) said' Give a description of him to me. I said: I saw him near al-Marwa on the back of a she- camel, and people had thronged around him. Thereupon Ibn'Abbis said: It was Allah's Messenger (may peace be upon him) for they (the Compainions of the Holy Prophet) were neither pushed aside from him, nor were they turned away.",
      "chain": [
        "30375",
        "20364",
        "20321",
        "3660"
      ]
    },
    {
      "hadith_no": "3136",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا محمد بن المثنى، حدثنا سليمان بن داود، حدثنا معروف بن خربوذ، قال سمعت أبا الطفيل، يقول رأيت رسول الله صلى الله عليه وسلم يطوف بالبيت ويستلم الركن بمحجن معه ويقبل المحجن ‏.‏",
      "text_en": " Abu Tufail reported:                      I saw Allah's Messenger (may peace be upon him) circumambulating the House. and touching the corner with a stick that he had with him, and then kissing the stick.",
      "chain": [
        "30170",
        "30584",
        "11564",
        "3660"
      ]
    },
    {
      "hadith_no": "4740",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، عن الوليد بن جميع، حدثنا أبو الطفيل حدثنا حذيفة بن اليمان، قال ما منعني أن أشهد، بدرا إلا أني خرجت أنا وأبي - حسيل - قال فأخذنا كفار قريش قالوا إنكم تريدون محمدا فقلنا ما نريده ما نريد إلا المدينة ‏.‏ فأخذوا منا عهد الله وميثاقه لننصرفن إلى المدينة ولا نقاتل معه فأتينا رسول الله صلى الله عليه وسلم فأخبرناه الخبر فقال ‏\"‏ انصرفا نفي لهم بعهدهم ونستعين الله عليهم ‏\"‏ ‏.‏",
      "text_en": " It has been reported on the authority of Hudbaifa b. al-Yaman who said:                      Nothing prevented me from being present at! he Battle of Badr except this incident. I came out with my father Husail (to participate in the Battle), but we were caught by the disbelievers of Quraish. They said: (Do) you intend to go to Muhammad? We said: We do not intend to go to him, but we wish to go (back) to Medina. So they took from us a covenant in the name of God that we would turn back to Medina and would not fight on the side of Muhammad (may peace be upon him). So, we came to the Messenger of Allah (may peace be upon him) and related the incident to him. He said: Both, of you proceed (to Medina) ; we will fulfil the covenant made with them and seek God's help against them.",
      "chain": [
        "30201",
        "20318",
        "3660",
        "145"
      ]
    },
    {
      "hadith_no": "5239",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "حدثنا زهير بن حرب، وسريج بن يونس، كلاهما عن مروان، قال زهير حدثنا  مروان بن معاوية الفزاري، حدثنا منصور بن حيان، حدثنا أبو الطفيل، عامر بن واثلة قال كنت عند علي بن أبي طالب فأتاه رجل فقال ما كان النبي صلى الله عليه وسلم يسر إليك قال فغضب وقال ما كان النبي صلى الله عليه وسلم يسر إلى شيئا يكتمه الناس غير أنه قد حدثني بكلمات أربع ‏.‏ قال فقال ما هن يا أمير المؤمنين قال قال ‏\"‏ لعن الله من لعن والده ولعن الله من ذبح لغير الله ولعن الله من آوى محدثا ولعن الله من غير منار الأرض ‏\"‏ ‏.‏",
      "text_en": " Abu Tufail 'Amir b. Withila reported:                      I was in the company of 'Ali b. Abi Talib, when a person came to him, and said: What was it that Allah's Apostle (may peace be upon him) told you in secret? Thereupon he (liadrat 'All) was enraged and said: Allah's Apostle (may peace be upon him) did not tell me anything in secret that he hid from people, except that he told me four things. He said: Com- mader of Faithful, what are these? He said: Allah cursed him who cursed his father; Allah cursed him who sacrificed for anyone besides Allah; and Allah cursed him who accommodates an innovator (in religion) ; and Allah cursed him who changed the minarets (the boundary lines) of the land.",
      "chain": [
        "30022",
        "30251",
        "20201",
        "20321",
        "20201",
        "10969",
        "3660"
      ]
    },
    {
      "hadith_no": "5240",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو خالد الأحمر، سليمان بن حيان عن منصور، بن حيان عن أبي الطفيل، قال قلنا لعلي بن أبي طالب أخبرنا بشىء، أسره إليك رسول الله صلى الله عليه وسلم فقال ما أسر إلى شيئا كتمه الناس ولكني سمعته يقول ‏\"‏ لعن الله من ذبح لغير الله ولعن الله من آوى محدثا ولعن الله من لعن والديه ولعن الله من غير المنار ‏\"‏ ‏.‏",
      "text_en": " Abu Tufail reported:                      We said to 'Ali b. Abi Talib: Inform us about something which Allah's Messenger (may peace be upon him) told you in secret, whereupon he said: He told me nothing in secret which he bid from people, but I heard him say: Allah cursed him who sacrificed for anyone besides Allah; and cursed him who accommodated an innovator; and Allah cursed him who cursed his parents and Allah cursed him who changed the boundary lines (of the land possessed by him).",
      "chain": [
        "30201",
        "20326",
        "10969",
        "3660"
      ]
    },
    {
      "hadith_no": "5241",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "حدثنا محمد بن المثنى، ومحمد بن بشار، - واللفظ لابن المثنى - قالا حدثنا  محمد بن جعفر، حدثنا شعبة، قال سمعت القاسم بن أبي بزة، يحدث عن أبي الطفيل، قال سئل علي أخصكم رسول الله صلى الله عليه وسلم بشىء فقال ما خصنا رسول الله صلى الله عليه وسلم بشىء لم يعم به الناس كافة إلا ما كان في قراب سيفي هذا - قال - فأخرج صحيفة مكتوب فيها ‏\"‏ لعن الله من ذبح لغير الله ولعن الله من سرق منار الأرض ولعن الله من لعن والده ولعن الله من آوى محدثا ‏\"‏ ‏.‏",
      "text_en": " Abu Tufail reported:                      'Ali was asked whether Allah's Messenger (may peace be upon him) had showed special favour (by disclosing to him) a thing (which he kept secret from others). Thereupon he said: Allah's Messenger (may peace be upon him) singled us not for (disclosing to us) anything (secret) which he did not make public, (but those few things) which lie in the sheath of my sword. He drew out the written document contained in it and on that (it was mentioned): Allah cursed him who sacrificed for anyone else besides Allah; and Allah cursed him who stole the signposts (demarcating the boundary lines of the) land; and Allah cursed him who cursed his father; and Allah cursed him who accommodated an innovator (in religion).",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "11261",
        "3660"
      ]
    },
    {
      "hadith_no": "6086",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن الدارمي، حدثنا أبو علي الحنفي، حدثنا مالك، - وهو ابن أنس - عن أبي الزبير المكي، أن أبا الطفيل، عامر بن واثلة أخبره أن معاذ بن جبل أخبره قال خرجنا مع رسول الله صلى الله عليه وسلم عام غزوة تبوك فكان يجمع الصلاة فصلى الظهر والعصر جميعا والمغرب والعشاء جميعا حتى إذا كان يوما أخر الصلاة ثم خرج فصلى الظهر والعصر جميعا ثم دخل ثم خرج بعد ذلك فصلى المغرب والعشاء جميعا ثم قال ‏\"‏ إنكم ستأتون غدا إن شاء الله عين تبوك وإنكم لن تأتوها حتى يضحي النهار فمن جاءها منكم فلا يمس من مائها شيئا حتى آتي ‏\"‏ ‏.‏ فجئناها وقد سبقنا إليها رجلان والعين مثل الشراك تبض بشىء من ماء - قال - فسألهما رسول الله صلى الله عليه وسلم ‏\"‏ هل مسستما من مائها شيئا ‏\"‏ ‏.‏ قالا نعم ‏.‏ فسبهما النبي صلى الله عليه وسلم وقال لهما ما شاء الله أن يقول - قال - ثم غرفوا بأيديهم من العين قليلا قليلا حتى اجتمع في شىء - قال - وغسل رسول الله صلى الله عليه وسلم فيه يديه ووجهه ثم أعاده فيها فجرت العين بماء منهمر أو قال غزير - شك أبو علي أيهما قال - حتى استقى الناس ثم قال ‏\"‏ يوشك يا معاذ إن طالت بك حياة أن ترى ما ها هنا قد ملئ جنانا ‏\"‏ ‏.‏",
      "text_en": " Mu'adh b. Jabal reported that he went along with Allah's Apostle (may peace be upon him) in the expedition of Tabuk and he (the Holy Prophet) combined the prayers. He offered the noon and afternoon prayers together and the sunset and night prayers together and on the other day he deferred the prayers; he then came out and offered the noon and afternoon prayers together. He then went in and (later on) came out and then after that offered the sunset and night prayers together and then said:                      God willing, you would reach by tomorrow the fountain of Tabuk and you should not come to that until it is dawn, and he who amongst you happens to go there should not touch its water until I come. We came to that and two persons (amongst) us reached that fountain ahead of us. It was a thin flow of water like the shoelace. Allah's Messenger (may peace be upon him) asked them whether they had touched the water. They said: Yes. Allah's Apostle (may peace be upon him) scolded them, and he said to them what he had to say by the will of God. The people then took water of the fountain in their palms until it became somewhat significant and Allah's Messenger (may peace be upon him) washed his hands and his face too in it, and then, took it again in that (fountain) and there gushed forth abundant water from that fountain, until all the people drank to their fill. He then said: Mu'adh, it is hoped that if you live long you would see its water irrigating well the gardens.",
      "chain": [
        "30025",
        "20260",
        "20001",
        "11263",
        "3660",
        "32"
      ]
    },
    {
      "hadith_no": "6217",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا خالد بن عبد الله، عن الجريري، عن أبي الطفيل، قال قلت له أرأيت رسول الله صلى الله عليه وسلم قال نعم كان أبيض مليح الوجه ‏.‏ قال مسلم بن الحجاج مات أبو الطفيل سنة مائة وكان آخر من مات من أصحاب رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Jurairi reported:                      I said to Abu Tufail: Did you see Allah's Messenger (may peace be upon him)? He said: Yes, he had a white handsome face. Muslim b. Hajjaj said: Abu Tufail who died in 100 Hijra was the last of the Companions of Allah's Messenger (may peace be upon him).",
      "chain": [
        "30116",
        "20423",
        "11286",
        "3660"
      ]
    },
    {
      "hadith_no": "6218",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا عبيد الله بن عمر القواريري، حدثنا عبد الأعلى بن عبد الأعلى، عن الجريري، عن أبي الطفيل، قال رأيت رسول الله صلى الله عليه وسلم وما على وجه الأرض رجل رآه غيري ‏.‏ قال فقلت له فكيف رأيته قال كان أبيض مليحا مقصدا ‏.‏",
      "text_en": " Abu Tufail reported:                      I saw Allah's Messenger (may peace be upon him) and there is one amongst the people of the earth who (are living at the present time and) had seen him except me. I said to him: How did you find him? He said: He had an elegant white color, and he was of an average height.",
      "chain": [
        "30024",
        "20246",
        "11286",
        "3660"
      ]
    },
    {
      "hadith_no": "6895",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Destiny - كتاب القدر",
      "chapter_no": "47",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، وزهير بن حرب، - واللفظ لابن نمير - قالا حدثنا سفيان بن عيينة، عن عمرو بن دينار، عن أبي الطفيل، عن حذيفة بن أسيد، يبلغ به النبي صلى الله عليه وسلم قال ‏\"‏ يدخل الملك على النطفة بعد ما تستقر في الرحم بأربعين أو خمسة وأربعين ليلة فيقول يا رب أشقي أو سعيد فيكتبان فيقول أى رب أذكر أو أنثى فيكتبان ويكتب عمله وأثره وأجله ورزقه ثم تطوى الصحف فلا يزاد فيها ولا ينقص ‏\"‏ ‏.‏",
      "text_en": " Hudhaifa b. Usaid reported directly from Allah's Messenger (may peace be upon him) that he said:                      When the drop of (semen) remains in the womb for forty or fifty (days) or forty nights, the angel comes and says: My Lord, will he be good or evil? And both these things would be written. Then the angel says: My Lord, would he be male or female? And both these things are written. And his deeds and actions, his death, his livelihood; these are also recorded. Then his document of destiny is rolled and there is no addition to nor subtraction from it.",
      "chain": [
        "30212",
        "30022",
        "20005",
        "11081",
        "3660"
      ]
    },
    {
      "hadith_no": "6897",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Destiny - كتاب القدر",
      "chapter_no": "47",
      "text_ar": "حدثنا أحمد بن عثمان النوفلي، أخبرنا أبو عاصم، حدثنا ابن جريج، أخبرني  أبو الزبير، أن أبا الطفيل، أخبره أنه، سمع عبد الله بن مسعود، يقول ‏.‏ وساق الحديث بمثل حديث عمرو بن الحارث ‏.‏",
      "text_en": " This hadith has been narrated on the authority of 'Abdullah b. Mas'ud through another chain of transmitters.",
      "chain": [
        "30185",
        "20241",
        "11070",
        "11263",
        "3660",
        "16"
      ]
    },
    {
      "hadith_no": "6898",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Destiny - كتاب القدر",
      "chapter_no": "47",
      "text_ar": "حدثني محمد بن أحمد بن أبي خلف، حدثنا يحيى بن أبي بكير، حدثنا زهير أبو خيثمة حدثني عبد الله بن عطاء، أن عكرمة بن خالد، حدثه أن أبا الطفيل حدثه قال دخلت على أبي سريحة حذيفة بن أسيد الغفاري فقال سمعت رسول الله صلى الله عليه وسلم بأذنى هاتين يقول ‏\"‏ إن النطفة تقع في الرحم أربعين ليلة ثم يتصور عليها الملك ‏\"‏ ‏.‏ قال زهير حسبته قال الذي يخلقها ‏\"‏ فيقول يا رب أذكر أو أنثى فيجعله الله ذكرا أو أنثى ثم يقول يا رب أسوي أو غير سوي فيجعله الله سويا أو غير سوي ثم يقول يا رب ما رزقه ما أجله ما خلقه ثم يجعله الله شقيا أو سعيدا ‏\"‏ ‏.‏",
      "text_en": " Abu Tufail reported:                      I visited Abu Sariha Hudhaifa b. Usaid al-Ghifari who said: I listened with these two ears of mine Allahs Messenger (may peace be upon him) as saying: The semen stays in the womb for forty nights, then the angel, gives it a shape. Zubair said: I think that he said: One who fashions that and decides whether he would be male or female. Then he (the angel) says: Would his limbs be full or imperfect? And then the Lord makes thein full and perfect or otherwise as He desires. Then he says: My Lord, what about his livelihood, and his death and what about his disposition? And then the Lord decides about his misfortune and fortune.",
      "chain": [
        "30560",
        "20365",
        "10785",
        "11709",
        "3660"
      ]
    },
    {
      "hadith_no": "6899",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Destiny - كتاب القدر",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد الوارث بن عبد الصمد، حدثني أبي، حدثنا ربيعة بن كلثوم، حدثني  أبي كلثوم، عن أبي الطفيل، عن حذيفة بن أسيد الغفاري، صاحب رسول الله صلى الله عليه وسلم رفع الحديث إلى رسول الله صلى الله عليه وسلم ‏\"‏ أن ملكا موكلا بالرحم إذا أراد الله أن يخلق شيئا بإذن الله لبضع وأربعين ليلة ‏\"‏ ‏.‏ ثم ذكر نحو حديثهم ‏.‏",
      "text_en": " Hadhaifa b. Usaid Ghifari, a Companion of Allah's Messenger (may peace be upon him), reported it directly from Allah's Messenger (may peace upon him). as he said:                      There is an angel who looks after the womb when Allah decides to create any- thing after more than forty nights are over; the rest of the hadith is the same.",
      "chain": [
        "20541",
        "3660"
      ]
    },
    {
      "hadith_no": "7214",
      "source": " Sahih Muslim ",
      "chapter": "Pertaining To The Charateristics Of The Hypocrites And Command Concerning Them - كتاب صفات المنافقين وأحكامهم",
      "chapter_no": "52",
      "text_ar": "حدثنا زهير بن حرب، حدثنا أبو أحمد الكوفي، حدثنا الوليد بن جميع، حدثنا  أبو الطفيل، قال كان بين رجل من أهل العقبة وبين حذيفة بعض ما يكون بين الناس فقال أنشدك بالله كم كان أصحاب العقبة قال فقال له القوم أخبره إذ سألك قال كنا نخبر أنهم أربعة عشر فإن كنت منهم فقد كان القوم خمسة عشر وأشهد بالله أن اثنى عشر منهم حرب لله ولرسوله في الحياة الدنيا ويوم يقوم الأشهاد وعذر ثلاثة قالوا ما سمعنا منادي رسول الله صلى الله عليه وسلم ولا علمنا بما أراد القوم ‏.‏ وقد كان في حرة فمشى فقال ‏\"‏ إن الماء قليل فلا يسبقني إليه أحد ‏\"‏ ‏.‏ فوجد قوما قد سبقوه فلعنهم يومئذ ‏.‏",
      "text_en": " Abu Tufail reported that there was a dispute between Hudhaifa and one from the people of Aqaba as it happens amongst people. He said:                      I adjure you by Allah to tell me as to how many people from Aqaba were. The people said to him (Hudhaifa) to inform him as he had asked. We have been informed that they were fourteen and If you are to be counted amongst them, then they would be fifteen and I state by Allah that twelve amongst them were the enemies of Allah and of His Messenger (may peace be upon him) in this world. The rest of the three put forward this excuse: We did not hear the announcement of Allah's Messenger (may peace be upon him) and we were not aware of the intention of the people as he (the Holy Prophet) had been in the hot atmosphere. He (the Holy Prophet) then said: The water is small in quantity (at the next station). So nobody should go ahead of me, but he found people who had gone ahead of him and he cursed them on that day.",
      "chain": [
        "30022",
        "3660"
      ]
    },
    {
      "hadith_no": "7467",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا أبو خيثمة، زهير بن حرب وإسحاق بن إبراهيم وابن أبي عمر المكي - واللفظ لزهير - قال إسحاق أخبرنا وقال الآخران، حدثنا سفيان بن عيينة، عن فرات، القزاز عن أبي الطفيل، عن حذيفة بن أسيد الغفاري، قال اطلع النبي صلى الله عليه وسلم علينا ونحن نتذاكر فقال ‏\"‏ ما تذاكرون ‏\"‏ ‏.‏ قالوا نذكر الساعة ‏.‏ قال ‏\"‏ إنها لن تقوم حتى ترون قبلها عشر آيات ‏\"‏ ‏.‏ فذكر الدخان والدجال والدابة وطلوع الشمس من مغربها ونزول عيسى ابن مريم صلى الله عليه وسلم ويأجوج ومأجوج وثلاثة خسوف خسف بالمشرق وخسف بالمغرب وخسف بجزيرة العرب وآخر ذلك نار تخرج من اليمن تطرد الناس إلى محشرهم ‏.‏",
      "text_en": " Hudhaifa b. Usaid Ghifari reported:                      Allah's Messenger (may peace be upon him) came to us all of a sudden as we were (busy in a discussion). He said: What do you discuss about? They (the Companions) said. We are discussing about the Last Hour. Thereupon he said: It will not cone until you see ten signs before and (in this connection) he made a mention of the smoke, Dajjal, the beast, the rising of the sun from the west, the descent of Jesus son of Mary (Allah be pleased with him), the Gog and Magog, and land-slidings in three places, one in the east, one in the west and one in Arabia at the end of which fire would burn forth from the Yemen, and would drive people to the place of their assembly.",
      "chain": [
        "30312",
        "20005",
        "11384",
        "3660"
      ]
    },
    {
      "hadith_no": "7468",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، عن فرات القزاز، عن  أبي الطفيل، عن أبي سريحة، حذيفة بن أسيد قال كان النبي صلى الله عليه وسلم في غرفة ونحن أسفل منه فاطلع إلينا فقال ‏\"‏ ما تذكرون ‏\"‏ ‏.‏ قلنا الساعة ‏.‏ قال ‏\"‏ إن الساعة لا تكون حتى تكون عشر آيات خسف بالمشرق وخسف بالمغرب وخسف في جزيرة العرب والدخان والدجال ودابة الأرض ويأجوج ومأجوج وطلوع الشمس من مغربها ونار تخرج من قعرة عدن ترحل الناس ‏\"‏ ‏.‏ قال شعبة وحدثني عبد العزيز بن رفيع عن أبي الطفيل عن أبي سريحة ‏.‏ مثل ذلك لا يذكر النبي صلى الله عليه وسلم وقال أحدهما في العاشرة نزول عيسى ابن مريم صلى الله عليه وسلم ‏.‏ وقال الآخر وريح تلقي الناس في البحر ‏.‏",
      "text_en": " Hudhaifa b. Usaid reported:                      Allah's Apostle (may peace be upon him) was in an apartment and we were beneath that that he peeped in and said to us: What are you discussing about? We said: (We are discussing about the Last) Hour. Thereupon he said: The Last Hour would not come until the ten signs dppear: land-sliding in the east, and land-sliding in the west, and land-sliding in the peninsula of Arabia, the smoke, the Dajjal, the beast of the earth, Gog and Magog, the rising of the sun from the west and the fire which would emit from the lower part of 'Adan. Shu'ba said that 'Abd al-'Aziz b. Rufai' reported on the authority of Abu Tufail who reported on the authority of Abu Sariha a hadith like this that Allah's Apostle (may peace be upon him) did not make a mention of (the tenth sign) but he said that out of the ten one was the descent of Jesus Christ, son of Mary (peace be upon him), and in another version it is theb lowing of the violent gale which would drive the people to the ocean.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11384",
        "3660"
      ]
    },
    {
      "hadith_no": "7469",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "وحدثناه محمد بن بشار، حدثنا محمد، - يعني ابن جعفر - حدثنا شعبة، عن  فرات، قال سمعت أبا الطفيل، يحدث عن أبي سريحة، قال كان رسول الله صلى الله عليه وسلم في غرفة ونحن تحتها نتحدث ‏.‏ وساق الحديث بمثله ‏.‏ قال شعبة وأحسبه قال تنزل معهم إذا نزلوا وتقيل معهم حيث قالوا ‏.‏ قال شعبة وحدثني رجل هذا الحديث عن أبي الطفيل عن أبي سريحة ولم يرفعه قال أحد هذين الرجلين نزول عيسى ابن مريم وقال الآخر ريح تلقيهم في البحر ‏.‏",
      "text_en": " Abu Sariha reported:                      Allah's Messenger (may peace be upon him) was in an (upper) apartment and we were standing lower to him and discussing (about the Last Hour). The rest of the hadith is the same, and Shu'ba said: I think he also said these words: The fire would descend along with them where they would land and where they would take rest (during midday (it would also cool down for a while). Shu'ba said: This hadith has been transmitted to me through Abu Tufail and Abu Sariha and none could trace it back directly to Allah's Apostle (may peace b.. upon him). However, there is a mention of the descent of Jesus Christ son of Mary in one version and in the other there is a mention of the blowing of a violent would drive them to the ocean.",
      "chain": [
        "30160",
        "20173",
        "20020",
        "3660"
      ]
    },
    {
      "hadith_no": "7470",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "وحدثناه محمد بن المثنى، حدثنا أبو النعمان الحكم بن عبد الله العجلي، حدثنا  شعبة، عن فرات، قال سمعت أبا الطفيل، يحدث عن أبي سريحة، قال كنا نتحدث فأشرف علينا رسول الله صلى الله عليه وسلم ‏.‏ بنحو حديث معاذ وابن جعفر ‏.‏",
      "text_en": "",
      "chain": [
        "30170",
        "20020",
        "3660"
      ]
    },
    {
      "hadith_no": "7471",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "وقال ابن المثنى حدثنا أبو النعمان الحكم بن عبد الله، حدثنا شعبة، عن عبد، العزيز بن رفيع عن أبي الطفيل، عن أبي سريحة، بنحوه قال والعاشرة نزول عيسى ابن مريم ‏.‏ قال شعبة ولم يرفعه عبد العزيز ‏.‏",
      "text_en": " Abu Sariha reported:                      We were discussing the Last Hour) that Allah's Apostle (may peace be upon him) looked towards us. The rest of the hadith is the same and the tenth (sign) was the descent of Jesus Christ son of Mary, and Shu'ba said: 'Abd al-'Aziz did not trace it directly to Allah's Apostle (may peace be upon him).",
      "chain": [
        "20020",
        "11257",
        "3660"
      ]
    },
    {
      "hadith_no": "1206",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Rules of Law about the Prayer during Journey - كتاب صلاة السفر",
      "chapter_no": "4",
      "text_ar": "حدثنا القعنبي، عن مالك، عن أبي الزبير المكي، عن أبي الطفيل، عامر بن واثلة أن معاذ بن جبل، أخبرهم أنهم، خرجوا مع رسول الله صلى الله عليه وسلم في غزوة تبوك فكان رسول الله صلى الله عليه وسلم يجمع بين الظهر والعصر والمغرب والعشاء فأخر الصلاة يوما ثم خرج فصلى الظهر والعصر جميعا ثم دخل ثم خرج فصلى المغرب والعشاء جميعا ‏.‏",
      "text_en": " Narrated Mu’adh bin Jabal :                     They (the Companions) proceeded on the expedition of Tabuk along with the Messenger of Allah (ﷺ). He combined the noon and afternoon prayers and the sunset and night prayers. One day he delayed the prayer and came out (of his dwelling) and combined the noon and the afternoon prayers. He then went it and then came out and combined the sunset and the night prayers.",
      "chain": [
        "20164",
        "20001",
        "11263",
        "3660",
        "32"
      ]
    },
    {
      "hadith_no": "1208",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Rules of Law about the Prayer during Journey - كتاب صلاة السفر",
      "chapter_no": "4",
      "text_ar": "حدثنا يزيد بن خالد بن يزيد بن عبد الله بن موهب الرملي الهمداني، حدثنا المفضل بن فضالة، والليث بن سعد، عن هشام بن سعد، عن أبي الزبير، عن أبي الطفيل، عن معاذ بن جبل، أن رسول الله صلى الله عليه وسلم كان في غزوة تبوك إذا زاغت الشمس قبل أن يرتحل جمع بين الظهر والعصر وإن يرتحل قبل أن تزيغ الشمس أخر الظهر حتى ينزل للعصر وفي المغرب مثل ذلك إن غابت الشمس قبل أن يرتحل جمع بين المغرب والعشاء وإن يرتحل قبل أن تغيب الشمس أخر المغرب حتى ينزل للعشاء ثم جمع بينهما ‏.‏ قال أبو داود رواه هشام بن عروة عن حسين بن عبد الله عن كريب عن ابن عباس عن النبي صلى الله عليه وسلم نحو حديث المفضل والليث ‏.‏",
      "text_en": " Narrated Mu'adh ibn Jabal:                     On the expedition to Tabuk if the sun had passed the meridian before the apostle of Allah (ﷺ) moved off, he combined the noon and the afternoon prayers; but if he moved off before the sun had passed the meridian, he delayed the noon prayer till he halted for the afternoon prayer. He acted similarly for the sunset prayer; if the sun set before he moved off, he combined the sunset and the night prayers, but if he moved off before sunset, he delayed the sunset prayer till he halted for the night prayer and then combined them.Abu Dawud said: Hisham b. 'Urwah narrated this tradition from Husain b. 'Abd Allah, from Kuraib on the authority of Ibn 'Abbas from the Prophet (ﷺ) like the tradition narrated by Mufaddal and al-Laith.",
      "chain": [
        "38715",
        "20378",
        "20023",
        "20519",
        "11263",
        "3660",
        "32"
      ]
    },
    {
      "hadith_no": "1879",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا هارون بن عبد الله، ومحمد بن رافع، - المعنى - قالا حدثنا أبو عاصم، عن معروف، - يعني ابن خربوذ المكي - حدثنا أبو الطفيل، قال رأيت النبي صلى الله عليه وسلم يطوف بالبيت على راحلته يستلم الركن بمحجنه ثم يقبله زاد محمد بن رافع ثم خرج إلى الصفا والمروة فطاف سبعا على راحلته ‏.‏",
      "text_en": " Abu Al Tufail reported on the authority of Ibn ‘Abbas who said I saw the Prophet (ﷺ) circumambulating the Ka’bah on his Camel, touching the corner (Black Stone) with a crooked stick and kissing it (the crooked stick). The narrator Muhammad bin Rafi’ added “he then went o Al Safa and Al Marwah and ran seven times on his Camel.",
      "chain": [
        "30524",
        "30375",
        "20241",
        "11564",
        "3660"
      ]
    },
    {
      "hadith_no": "1885",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أبو سلمة، موسى بن إسماعيل حدثنا حماد، حدثنا أبو عاصم الغنوي، عن أبي الطفيل، قال قلت لابن عباس يزعم قومك أن رسول الله صلى الله عليه وسلم قد رمل بالبيت وأن ذلك سنة ‏.‏ قال صدقوا وكذبوا ‏.‏ قلت وما صدقوا وما كذبوا قال صدقوا قد رمل رسول الله صلى الله عليه وسلم وكذبوا ليس بسنة إن قريشا قالت زمن الحديبية دعوا محمدا وأصحابه حتى يموتوا موت النغف ‏.‏ فلما صالحوه على أن يجيئوا من العام المقبل فيقيموا بمكة ثلاثة أيام فقدم رسول الله صلى الله عليه وسلم والمشركون من قبل قعيقعان فقال رسول الله صلى الله عليه وسلم لأصحابه ‏\"‏ ارملوا بالبيت ثلاثا ‏\"‏ ‏.‏ وليس بسنة ‏.‏ قلت يزعم قومك أن رسول الله صلى الله عليه وسلم طاف بين الصفا والمروة على بعيره وأن ذلك سنة فقال صدقوا وكذبوا ‏.‏ قلت ما صدقوا وما كذبوا قال صدقوا قد طاف رسول الله صلى الله عليه وسلم بين الصفا والمروة على بعيره وكذبوا ليس بسنة كان الناس لا يدفعون عن رسول الله صلى الله عليه وسلم ولا يصرفون عنه فطاف على بعير ليسمعوا كلامه وليروا مكانه ولا تناله أيديهم ‏.‏",
      "text_en": " Abu Al Tufail said I said to Ibn ‘Abbas Your people think that the Apostle of Allaah(ﷺ) walked proudly with swift strides while going round the Ka’bah and that it is sunnah (practice of the Prophet). He said “They spoke the truth (in part) and told a lie (in part).” I asked “What truth did they speak and what lie did they tell?” He said “They spoke the truth that the Apostle of Allaah(ﷺ) walked proudly while going round the Ka’bah but they told a lie, this is no sunnah. The Quraish asserted during the days of Al Hudaibiyyah “Forsake Muhammad and his Companions till they die the death of a Camel which dies of bacteria in its nose. When they concluded a treaty with him agreeing upon the fact that they (the Prophet and his Companions) would come (to Makkah) next year and stay at Makkah three days, the Apostle of Allaah(ﷺ) said to the Companions “Walk proudly (moving shoulders) while going round the Ka’bah in first three circuits. (Ibn ‘Abbas said) But this is not sunnah. I said “Your people think that the Apostle of Allaah(ﷺ) ran between Al Safa and Al Marwah on a Camel and that is sunnah.” He said “They spoke the truth (in part) and told a lie (in part). I asked “What truth did they speak and what lie did they tell? He said “they spoke the truth that the Apostle of Allaah(ﷺ) ran between Al Safa and Al Marwah on a Camel. They told a lie that it is a sunnah. As the people did not move from around the Apostle of Allaah(ﷺ) and did not separate themselves from him he did the sa’i on a Camel so that they may listen to him and see his position and their hands might not reach him.",
      "chain": [
        "20040",
        "20022",
        "3660"
      ]
    },
    {
      "hadith_no": "1889",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن سليمان الأنباري، حدثنا يحيى بن سليم، عن ابن خثيم، عن أبي الطفيل، عن ابن عباس، أن النبي صلى الله عليه وسلم اضطبع فاستلم وكبر ثم رمل ثلاثة أطواف وكانوا إذا بلغوا الركن اليماني وتغيبوا من قريش مشوا ثم يطلعون عليهم يرملون تقول قريش كأنهم الغزلان قال ابن عباس فكانت سنة ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Prophet (ﷺ) wore the mantle under his right armpit with the end over his left shoulder, and touched the corner (Black Stone), then uttered \"Allah is most great\" and walked proudly in three circuits of circumambulation. When they (the Companions) reached the Yamani corner, and disappeared from the eyes of the Quraysh, they walked as usual; When they appeared before them, they walked proudly with rapid strides. Thereupon the Quraysh said: They look to be the deer (that are jumping). Ibn Abbas said: Hence this became the sunnah (model behaviour of the Prophet).",
      "chain": [
        "31160",
        "20204",
        "3660",
        "17"
      ]
    },
    {
      "hadith_no": "1890",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، أخبرنا عبد الله بن عثمان بن خثيم، عن أبي الطفيل، عن ابن عباس، أن رسول الله صلى الله عليه وسلم وأصحابه اعتمروا من الجعرانة فرملوا بالبيت ثلاثا ومشوا أربعا ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Messenger of Allah (ﷺ) and his Companions performed umrah from al-Ji'ranah and walked proudly with rapid strides round the House (the Ka'bah) in three circuits and walked as usual in four circuits.",
      "chain": [
        "20040",
        "20022",
        "10644",
        "3660",
        "17"
      ]
    },
    {
      "hadith_no": "2973",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا محمد بن الفضيل، عن الوليد بن جميع، عن أبي الطفيل، قال جاءت فاطمة رضى الله عنها إلى أبي بكر رضى الله عنه تطلب ميراثها من النبي صلى الله عليه وسلم قال فقال أبو بكر عليه السلام سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن الله عز وجل إذا أطعم نبيا طعمة فهي للذي يقوم من بعده ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuBakr:                     AbutTufayl said: Fatimah came to AbuBakr asking him for the inheritance of the Prophet (ﷺ). AbuBakr said: I heard the Messenger of Allah (ﷺ) say: If Allah, Most High, gives a Prophet some means of sustenance, that goes to his successor.",
      "chain": [
        "30203",
        "3660"
      ]
    },
    {
      "hadith_no": "4283",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Promised Deliverer (Kitab Al-Mahdi) - كتاب المهدى",
      "chapter_no": "38",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا الفضل بن دكين، حدثنا فطر، عن القاسم بن أبي بزة، عن أبي الطفيل، عن علي، - رضى الله تعالى عنه - عن النبي صلى الله عليه وسلم قال ‏\"‏ لو لم يبق من الدهر إلا يوم لبعث الله رجلا من أهل بيتي يملأها عدلا كما ملئت جورا ‏\"‏ ‏.‏",
      "text_en": " Narrated Ali ibn AbuTalib:                     The Prophet (ﷺ) said: If only one day of this time (world) remained, Allah would raise up a man from my family who would fill this earth with justice as it has been filled with oppression.",
      "chain": [
        "30203",
        "20348",
        "11261",
        "3660",
        "5"
      ]
    },
    {
      "hadith_no": "4311",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا مسدد، وهناد، - المعنى - قال مسدد حدثنا أبو الأحوص، حدثنا فرات القزاز، عن عامر بن واثلة، - وقال هناد عن أبي الطفيل، - عن حذيفة بن أسيد الغفاري، قال كنا قعودا نتحدث في ظل غرفة لرسول الله صلى الله عليه وسلم فذكرنا الساعة فارتفعت أصواتنا فقال رسول الله صلى الله عليه وسلم ‏\"‏ لن تكون - أو لن تقوم - الساعة حتى يكون قبلها عشر آيات طلوع الشمس من مغربها وخروج الدابة وخروج يأجوج ومأجوج والدجال وعيسى ابن مريم والدخان وثلاث خسوف خسف بالمغرب وخسف بالمشرق وخسف بجزيرة العرب وآخر ذلك تخرج نار من اليمن من قعر عدن تسوق الناس إلى المحشر ‏\"‏ ‏.‏",
      "text_en": " Hudhaifah b. Usaid al-Ansari said :                      We were sitting in the shade of the chamber of the Messenger of Allah (ﷺ) discussing (something) and when we mentioned the last hour, our voices rose high. The Messenger of Allah (ﷺ) said: The last hour will not come or happen until there appear ten signs before it : the rising of the sun in its place of setting, the coming forth of the beast, the coming forth of Gog and Magog, the Dajjal (Antichrist), (the descent of) Jesus son of Mary, the smoke, three subsidence’s, one in the will issue forth from the Yemen, from the lowest part of Aden, and drive mankind to their place of assembly.",
      "chain": [
        "30175",
        "30175",
        "20327",
        "11384",
        "30480",
        "3660"
      ]
    },
    {
      "hadith_no": "4864",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا حسين بن معاذ بن خليف، حدثنا عبد الأعلى، حدثنا سعيد الجريري، عن أبي الطفيل، قال رأيت رسول الله صلى الله عليه وسلم ‏.‏ قلت كيف رأيته قال كان أبيض مليحا إذا مشى كأنما يهوي في صبوب ‏.‏",
      "text_en": " Sa’id al-Jariri quoted Abu al-Tufail as saying:                      I saw the Messenger of Allah(ﷺ). I asked: How did you see him? He said: He was white, good-looking, and when he walked, it looked as if he was descending to a low ground.",
      "chain": [
        "20246",
        "11286",
        "3660"
      ]
    },
    {
      "hadith_no": "5144",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا ابن المثنى، حدثنا أبو عاصم، قال حدثني جعفر بن يحيى بن عمارة بن ثوبان، أخبرنا عمارة بن ثوبان، أن أبا الطفيل، أخبره قال رأيت النبي صلى الله عليه وسلم يقسم لحما بالجعرانة - قال أبو الطفيل وأنا يومئذ غلام أحمل عظم الجزور - إذ أقبلت امرأة حتى دنت إلى النبي صلى الله عليه وسلم فبسط لها رداءه فجلست عليه فقلت من هي فقالوا هذه أمه التي أرضعته ‏.‏",
      "text_en": " Narrated AbutTufayl:                     I saw the Prophet (ﷺ) distributing flesh at Ji'irranah, and I was a boy in those days bearing the bone of the camel, and when a woman who came forward approach the Prophet (ﷺ), he spread out his cloak for her, and she sat on it. I asked: Who is she? The people said: She is his foster-mother.",
      "chain": [
        "30170",
        "20241",
        "13539",
        "3660"
      ]
    },
    {
      "hadith_no": "334",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود، حدثنا الحسن بن أبي جعفر، عن أبي الزبير، عن أبي الطفيل، عن معاذ بن جبل، أن النبي صلى الله عليه وسلم كان يستحب الصلاة في الحيطان ‏.‏ قال أبو داود يعني البساتين ‏.‏ قال أبو عيسى حديث معاذ حديث غريب لا نعرفه إلا من حديث الحسن بن أبي جعفر ‏.‏ والحسن بن أبي جعفر قد ضعفه يحيى بن سعيد وغيره وأبو الزبير اسمه محمد بن مسلم بن تدرس وأبو الطفيل اسمه عامر بن واثلة ‏.‏",
      "text_en": " Mu'adh ibn Jabal narrated:                     \"The Prophet liked to perform Salat in Al-Hitan.\"",
      "chain": [
        "30277",
        "30002",
        "24081",
        "11263",
        "3660",
        "32"
      ]
    },
    {
      "hadith_no": "554",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Traveling - أَبْوَابُ السَّفَرِ",
      "chapter_no": "6",
      "text_ar": "حدثنا عبد الصمد بن سليمان، حدثنا زكريا اللؤلؤي، حدثنا أبو بكر الأعين، حدثنا علي بن المديني، حدثنا أحمد بن حنبل، حدثنا قتيبة، بهذا الحديث يعني حديث معاذ ‏.‏ وحديث معاذ حديث حسن غريب تفرد به قتيبة لا نعرف أحدا رواه عن الليث غيره ‏.‏ وحديث الليث عن يزيد بن أبي حبيب عن أبي الطفيل عن معاذ حديث غريب ‏.‏ والمعروف عند أهل العلم حديث معاذ من حديث أبي الزبير عن أبي الطفيل عن معاذ أن النبي صلى الله عليه وسلم جمع في غزوة تبوك بين الظهر والعصر وبين المغرب والعشاء ‏.‏ رواه قرة بن خالد وسفيان الثوري ومالك وغير واحد عن أبي الزبير المكي ‏.‏ وبهذا الحديث يقول الشافعي ‏.‏ وأحمد وإسحاق يقولان لا بأس أن يجمع بين الصلاتين في السفر في وقت إحداهما ‏.‏",
      "text_en": " [(Another chain) Qutaibah narrated :                     this Hadith to us, meaning the Hadith of Mu'adh]",
      "chain": [
        "30026",
        "30007",
        "30367",
        "11411",
        "3660"
      ]
    },
    {
      "hadith_no": "858",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا عبد الرزاق، أخبرنا سفيان، ومعمر، عن ابن خثيم، عن أبي الطفيل، قال كنت مع ابن عباس ومعاوية لا يمر بركن إلا استلمه فقال له ابن عباس إن النبي صلى الله عليه وسلم لم يكن يستلم إلا الحجر الأسود والركن اليماني ‏.‏ فقال معاوية ليس شيء من البيت مهجورا ‏.‏ قال وفي الباب عن عمر ‏.‏ قال أبو عيسى حديث ابن عباس حديث حسن صحيح ‏.‏ والعمل على هذا عند أكثر أهل العلم أن لا يستلم إلا الحجر الأسود والركن اليماني ‏.‏",
      "text_en": " Abu Tufail narrated:                     \"I was with Ibn Abbas, and Mu'awiyah would not pass any corner without touching it. So Ibn Abbas said to him: 'the Prophet would not touch any besides the Black Stone and the Yemeni corner.' So Mu'awiyah said: 'There is no part of the House that is untouchable.'\"",
      "chain": [
        "30277",
        "20121",
        "20012",
        "20115",
        "3660"
      ]
    },
    {
      "hadith_no": "2138",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا أبو هشام الرفاعي، محمد بن يزيد حدثنا محمد بن فضيل، عن الوليد بن عبد الله بن جميع، عن أبي الطفيل، عن حذيفة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تكونوا إمعة تقولون إن أحسن الناس أحسنا وإن ظلموا ظلمنا ولكن وطنوا أنفسكم إن أحسن الناس أن تحسنوا وإن أساءوا فلا تظلموا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من هذا الوجه ‏.‏",
      "text_en": " Hudhaifah narrated that the Messenger of Allah said:                     \"Do not let yourselves be 'yes-men', saying: 'If the people are good then we will be good, and if they are wrong then we will be wrong.'Rather, make up your own minds, if the people are good then you are good, and if they are evil, then do not behave unjustly.\"",
      "chain": [
        "30478",
        "20356",
        "10659",
        "3660",
        "145"
      ]
    },
    {
      "hadith_no": "2183",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا بندار، حدثنا عبد الرحمن بن مهدي، حدثنا سفيان، عن فرات القزاز، عن أبي الطفيل، عن حذيفة بن أسيد، قال أشرف علينا رسول الله صلى الله عليه وسلم من غرفة ونحن نتذاكر الساعة فقال النبي صلى الله عليه وسلم ‏\"‏ لا تقوم الساعة حتى تروا عشر آيات طلوع الشمس من مغربها ويأجوج ومأجوج والدابة وثلاثة خسوف خسف بالمشرق وخسف بالمغرب وخسف بجزيرة العرب ونار تخرج من قعر عدن تسوق الناس أو تحشر الناس فتبيت معهم حيث باتوا وتقيل معهم حيث قالوا ‏\"‏ ‏.‏ حدثنا محمود بن غيلان، حدثنا وكيع، عن سفيان، عن فرات، نحوه وزاد فيه ‏\"‏ الدخان ‏\"‏ ‏.‏حدثنا هناد، حدثنا أبو الأحوص، عن فرات القزاز، نحو حديث وكيع عن سفيان، ‏.‏حدثنا محمود بن غيلان، حدثنا أبو داود الطيالسي، عن شعبة، والمسعودي، سمعا من، فرات القزاز نحو حديث عبد الرحمن عن سفيان عن فرات وزاد فيه ‏\"‏ الدجال أو الدخان ‏\"‏ ‏.‏حدثنا أبو موسى، محمد بن المثنى حدثنا أبو النعمان الحكم بن عبد الله العجلي، عن شعبة، عن فرات، نحو حديث أبي داود عن شعبة، وزاد، فيه قال ‏\"‏ والعاشرة إما ريح تطرحهم في البحر وإما نزول عيسى ابن مريم ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن علي وأبي هريرة وأم سلمة وصفية بنت حيى ‏.‏ وهذا حديث حسن صحيح ‏.‏",
      "text_en": " Hudhaifah bin Asid said:                     \"The Messenger of Allah (s.a.w) stood over us on a balcony, and we were discussing the Hour. So the Messenger of Allah(s.a.w) said: 'The Hour shall not be established until you see ten signs. The sun rising from its setting place, Ya'juj and Ma'juj, the beast of the earth, and three collapses of the earth: A collapse in the east, a collapse in the west and a collapse in the 'Arabian peninsula. And a fire that comes out of a place within 'Adan, driving the people, or gathering the people, camping where they camp, and resting where they rest.\"'",
      "chain": [
        "30160",
        "20033",
        "20012",
        "11384",
        "3660"
      ]
    },
    {
      "hadith_no": "4078",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن سلمة بن كهيل، قال سمعت أبا الطفيل، يحدث عن أبي سريحة، أو زيد بن أرقم شك شعبة - عن النبي صلى الله عليه وسلم قال ‏\"‏ من كنت مولاه فعلي مولاه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏ وقد روى شعبة هذا الحديث عن ميمون أبي عبد الله عن زيد بن أرقم عن النبي صلى الله عليه وسلم ‏.‏ وأبو سريحة هو حذيفة بن أسيد الغفاري صاحب النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Abu Sarihah, or Zaid bin Arqam - Shu'bah had doubt:                     from the Prophet (ﷺ): \"For whomever I am his Mawla then 'Ali is his Mawla.\"",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11350",
        "3660"
      ]
    },
    {
      "hadith_no": "4305",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن موسى البصري، حدثنا الفضيل بن سليمان، عن عبد الله بن عثمان بن خثيم، حدثنا سعيد بن جبير، وأبو الطفيل، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم لمكة ‏\"‏ ما أطيبك من بلد وأحبك إلى ولولا أن قومي أخرجوني منك ما سكنت غيرك ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     that the Messenger of Allah (ﷺ) said about Makkah: \"How sweet of a land you are and how dear you are to me, and if it were not that my people expelled me from you, I would not have lived in other than you.\"",
      "chain": [
        "38602",
        "20271",
        "10644",
        "11050",
        "3660",
        "17"
      ]
    },
    {
      "hadith_no": "2086",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا يحيى، عن الوليد بن جميع، قال حدثنا أبو الطفيل، عن حذيفة بن أسيد، عن أبي ذر، قال إن الصادق المصدوق صلى الله عليه وسلم حدثني ‏\"‏ أن الناس يحشرون ثلاثة أفواج فوج راكبين طاعمين كاسين وفوج تسحبهم الملائكة على وجوههم وتحشرهم النار وفوج يمشون ويسعون يلقي الله الآفة على الظهر فلا يبقى حتى إن الرجل لتكون له الحديقة يعطيها بذات القتب لا يقدر عليها ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Dharr said;\"The truthful one whom people believe told me:                      'The people will be gathered in three groups: A group who will be riding, well fed and well clothed; a group whom the angels will drag on their faces and whom the fire will drive; and a group who will be walking with difficulty. Allah will send a disease to kill all the riding beasts and none will remain, until a man would give a garden for a she-camel but he will not be able to have it.",
      "chain": [
        "30153",
        "20031",
        "3660",
        "23"
      ]
    },
    {
      "hadith_no": "1123",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، عن سفيان، عن أبي الزبير، عن أبي الطفيل، عن معاذ بن جبل، أن النبي  صلى الله عليه وسلم  جمع بين الظهر والعصر والمغرب والعشاء في غزوة تبوك في السفر ‏.‏",
      "text_en": " It wasnarrated from Mu’adh bin Jabal that the Prophet (ﷺ) combinedtheZuhr and ‘Asr, and the Maghrib and ‘Isha’ when traveling duringthe campaign of Tabuk.",
      "chain": [
        "38409",
        "20032",
        "20012",
        "11263",
        "3660",
        "32"
      ]
    },
    {
      "hadith_no": "1603",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا معاوية بن هشام، حدثنا سفيان، عن حمران بن أعين، عن أبي الطفيل، عن مجمع بن جارية الأنصاري، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ إن أخاكم النجاشي قد مات فقوموا فصلوا عليه ‏\"‏ ‏.‏ فصفنا خلفه صفين ‏.‏",
      "text_en": " It wasnarrated from Mujammi’ bin Jariyah Al-Ansari that theMessenger ofAllah (ﷺ) said:                      “Your brother Najashi has died, sostand and prayfor him.” So we formed two rows behind him.",
      "chain": [
        "30201",
        "20609",
        "20012",
        "15108",
        "3660"
      ]
    },
    {
      "hadith_no": "1604",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا عبد الرحمن بن مهدي، عن المثنى بن سعيد، عن قتادة، عن أبي الطفيل، عن حذيفة بن أسيد، أن النبي  صلى الله عليه وسلم  خرج بهم فقال ‏\"‏ صلوا على أخ لكم مات بغير أرضكم ‏\"‏ ‏.‏ قالوا من هو قال ‏\"‏ النجاشي ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Hudhaifah bin Asid that the Prophet (ﷺ) ledthem outand said:                      “Pray for a brother of yours who has died in a landotherthan yours.” They said: “Who is he?” He said: “Najashi.”",
      "chain": [
        "30170",
        "20033",
        "11019",
        "3660"
      ]
    },
    {
      "hadith_no": "3066",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا عبد الرزاق، أنبأنا معمر، عن ابن خثيم، عن أبي الطفيل، عن ابن عباس، قال قال النبي  صلى الله عليه وسلم  لأصحابه حين أرادوا دخول مكة في عمرته بعد الحديبية ‏\"‏ إن قومكم غدا سيرونكم فليرونكم جلدا ‏\"‏ ‏.‏ فلما دخلوا المسجد استلموا الركن ورملوا والنبي  صلى الله عليه وسلم  معهم حتى إذا بلغوا الركن اليماني مشوا إلى الركن الأسود ثم رملوا حتى بلغوا الركن اليماني ثم مشوا إلى الركن الأسود ففعل ذلك ثلاث مرات ثم مشى الأربع ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “During his ‘Umrah afterHudaibiyah – when they wanted to enter Makkah – the Prophet (ﷺ)saidto his Companions: ‘Your people will see you tomorrow, so letthem seeyou looking strong.’ When they entered the mosque, theytouched thecorner and started to walk briskly, and the Prophet (ﷺ)was withthem. When they reached the Yemenite Corner, they walkednormally tothe Black Corner (the corner where the Black Stone is),then theywalked briskly until they reached the Yemenite Corner, thentheywalked normally to the Black Corner. They did that three times,thenthey walked normally for four circuits.”",
      "chain": [
        "11222",
        "20121",
        "20115",
        "3660",
        "17"
      ]
    },
    {
      "hadith_no": "3238",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا إسماعيل بن حفص الأبلي، حدثنا يحيى بن يمان، عن حمزة بن حبيب الزيات، عن حمران بن أعين، عن أبي الطفيل، عن أبي سعيد، قال حج النبي  صلى الله عليه وسلم  وأصحابه مشاة من المدينة إلى مكة وقال ‏\"‏ اربطوا أوساطكم بأزركم ‏\"‏ ‏.‏ ومشى خلط الهرولة ‏.‏",
      "text_en": " It wasnarrated that Abu Sa’eed said:                      “The Prophet (ﷺ) and hisCompanions performed Hajj walking from Al-Madinah to Makkah. He said:‘Tie your lower garments around your waists,’ and he alternatedbetween walking and jogging.”",
      "chain": [
        "20617",
        "20583",
        "15108",
        "3660",
        "38"
      ]
    },
    {
      "hadith_no": "4177",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن سفيان، عن فرات القزاز، عن أبي الطفيل، عن حذيفة بن أسيد، قال اطلع علينا النبي  صلى الله عليه وسلم  من غرفة ونحن نتذاكر الساعة فقال ‏\"‏ لا تقوم الساعة حتى تكون عشر آيات الدجال والدخان وطلوع الشمس من مغربها ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Hudhaifah bin Asid said:                      \"The Prophet (ﷺ)looked out at us from a room, when we were talking about the Hour. Hesaid: 'The Hour will not begin until there are ten signs: Dajjal,(False Christ), the smoke, and the rising of the sun from the west.'\"",
      "chain": [
        "30201",
        "20032",
        "20012",
        "11384",
        "3660"
      ]
    }
  ],
  "total_hadiths": 47
}