{
  "id": "36618",
  "name": "al-Qasim bin Salam القاسم بن سلام",
  "full_name": "al-Qasim bin Salam القاسم بن سلام",
  "grade": "3rd Century AH [10th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "224",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Baghdad"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خت  د  ت  -  ثقة ]"
    ],
    "tags": [
      "al-Baghdadi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "3968",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "وقال دحيم حدثنا الوليد، حدثنا الأوزاعي، حدثني أبو عبيد، عن عقبة بن وساج، حدثني أنس بن مالك  رضى الله عنه  قال قدم النبي صلى الله عليه وسلم المدينة، فكان أسن أصحابه أبو بكر، فغلفها بالحناء والكتم حتى قنأ لونها‏.‏",
      "text_en": "",
      "chain": [
        "30285",
        "20733",
        "20024",
        "36618",
        "19"
      ]
    },
    {
      "hadith_no": "5210",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "حدثني حرملة بن يحيى، أخبرنا ابن وهب، حدثني يونس، عن ابن شهاب، حدثني  أبو عبيد، مولى ابن أزهر أنه شهد العيد مع عمر بن الخطاب قال ثم صليت مع علي بن أبي طالب - قال - فصلى لنا قبل الخطبة ثم خطب الناس فقال إن رسول الله صلى الله عليه وسلم قد نهاكم أن تأكلوا لحوم نسككم فوق ثلاث ليال فلا تأكلوا ‏.‏",
      "text_en": " Abu 'Ubaid, the freed slave of Ibn Azhar, reported that he said 'Id (prayer) with Umar b. al-Khattab, and then said the 'Id (prayer) with 'Ali b. Abu Talib. He (the narrator further) reported:                      He led us in prayer before delivering the sermon and then addressed the people saying: Allah's Messenger (may peace be upon him) has forbidden you to eat the flesh of your sacrificial animals beyond three nights, so do not eat that.",
      "chain": [
        "30487",
        "20029",
        "20475",
        "11013",
        "36618"
      ]
    },
    {
      "hadith_no": "4555",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا محمد بن عبد الله، حدثنا سعيد، عن قتادة، عن سعيد بن المسيب، عن زيد بن ثابت، في الدية المغلظة فذكر مثله سواء ‏.‏ قال أبو داود قال أبو عبيد وعن غير واحد إذا دخلت الناقة في السنة الرابعة فهو حق والأنثى حقة لأنه يستحق أن يحمل عليه ويركب فإذا دخل في الخامسة فهو جذع وجذعة فإذا دخل في السادسة وألقى ثنيته فهو ثني وثنية فإذا دخل في السابعة فهو رباع ورباعية فإذا دخل في الثامنة وألقى السن الذي بعد الرباعية فهو سديس وسدس فإذا دخل في التاسعة وفطر نابه وطلع فهو بازل فإذا دخل في العاشرة فهو مخلف ثم ليس له اسم ولكن يقال بازل عام وبازل عامين ومخلف عام ومخلف عامين إلى ما زاد ‏.‏ وقال النضر بن شميل بنت مخاض لسنة وبنت لبون لسنتين وحقة لثلاث وجذعة لأربع والثني لخمس ورباع لست وسديس لسبع وبازل لثمان ‏.‏ قال أبو داود قال أبو حاتم والأصمعي والجذوعة وقت وليس بسن ‏.‏ قال أبو حاتم قال بعضهم فإذا ألقى رباعيته فهو رباع وإذا ألقى ثنيته فهو ثني وقال أبو عبيد إذا ألقحت فهي خلفة فلا تزال خلفة إلى عشرة أشهر فإذا بلغت عشرة أشهر فهي عشراء ‏.‏ قال أبو حاتم إذا ألقى ثنيته فهو ثني وإذا ألقى رباعيته فهو رباع ‏.‏",
      "text_en": " Narrated Abu Dawud:                     Abu Dawud and others have said: When a she-camel enters fourth year, the female is called hiqqah, and the male is called hiqq, for it deserves that it should be loaded and ridden. When a camel enters its fifth year, the male is called Jadha' and the female is called Jadha'ah. When it enters its sixth year, and sheds its front teeth, it is called thani (male) and thaniyyah (female). When it enters its seventh year, it is called raba' and raba'iyyah. When it enters its ninth year and cuts its canine teeth, it is called bazil. When it enters its tenth year, it is called mukhlif. Then there is no name for it, but is called bazil'am and bazil'amain, and mukhlif'am and mukhlif'amain, upto any year it increases. Nad d. Shumail said: Bint makhad is a she-camel of one year, and bin labun is s she-camel of two years, hiqqah is a she-camel of three years, jadha'ah is a she-camel of four years, thani is a camel of five years, raba' is a camel of six years, sadis is a camel of seven years, and bazil is a camel of eight years.Abu Dawud said: Abu Hatim and al-Asma'i said: Al-Jadhu'ah is a time when no tooth is growing. Abu Hatim said: Some of them said: When it sheds its teeth between front and canine teeth, it is called raba' and when it sheds its front teeth, it is called thani. Abu 'Ubaid said: When it becomes pregnant, it is called khalifah, and it remains khalifah for ten months; when it reaches ten months, it is called 'ushara', Abu Hatim said: When it shed its front teeth, it is called thani and when it sheds its teeth between front and canine teeth it is called raba'.",
      "chain": [
        "30170",
        "30561",
        "11168",
        "11019",
        "11002",
        "49",
        "30002",
        "36618"
      ]
    },
    {
      "hadith_no": "4425",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا أبو داود، قال حدثنا يعقوب، قال حدثنا أبي، عن صالح، عن ابن شهاب، أن أبا عبيد، أخبره أن علي بن أبي طالب قال إن رسول الله صلى الله عليه وسلم قد نهاكم أن تأكلوا لحوم نسككم فوق ثلاث ‏.‏",
      "text_en": " 'Ali bin Abi Talib Said:                     \"The Messenger of Allah has forbidden you from eating the meat of your sacrificaial animals for more than three day.\" (Sahih )",
      "chain": [
        "30002",
        "20184",
        "20150",
        "11176",
        "11013",
        "36618",
        "5"
      ]
    }
  ],
  "total_hadiths": 4
}