{
  "id": "36613",
  "name": "al-Fadl bin al-Sbah al-Bghdady الفضل بن الصباح البغدادي",
  "full_name": "al-Fadl bin al-Sbah al-Bghdady الفضل بن الصباح البغدادي",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "245",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Baghdad"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ت  ق  -  ثقة ]"
    ],
    "tags": [
      "al-Baghdadi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "id": "jami-al-tirmidhi-256",
      "hadith_no": "256",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "قال أبو عيسى حدثنا الفضل بن الصباح البغدادي، حدثنا سفيان بن عيينة، حدثنا الزهري، بهذا الإسناد نحو حديث ابن أبي عمر ‏.‏ قال وفي الباب عن عمر، وعلي، ووائل بن حجر، ومالك بن الحويرث، وأنس، وأبي، هريرة وأبي حميد وأبي أسيد وسهل بن سعد ومحمد بن مسلمة وأبي قتادة وأبي موسى الأشعري وجابر وعمير الليثي ‏.‏ قال أبو عيسى حديث ابن عمر حديث حسن صحيح ‏.‏ وبهذا يقول بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم منهم ابن عمر وجابر بن عبد الله وأبو هريرة وأنس وابن عباس وعبد الله بن الزبير وغيرهم ومن التابعين الحسن البصري وعطاء وطاوس ومجاهد ونافع وسالم بن عبد الله وسعيد بن جبير وغيرهم ‏.‏ وبه يقول مالك ومعمر والأوزاعي وابن عيينة وعبد الله بن المبارك والشافعي وأحمد وإسحاق ‏.‏ وقال عبد الله بن المبارك قد ثبت حديث من يرفع يديه وذكر حديث الزهري عن سالم عن أبيه ولم يثبت حديث ابن مسعود أن النبي صلى الله عليه وسلم لم يرفع يديه إلا في أول مرة ‏.‏ حدثنا بذلك أحمد بن عبدة الآملي حدثنا وهب بن زمعة عن سفيان بن عبد الملك عن عبد الله بن المبارك ‏.‏ قال وحدثنا يحيى بن موسى قال حدثنا إسماعيل بن أبي أويس قال كان مالك بن أنس يرى رفع اليدين في الصلاة ‏.‏ وقال يحيى وحدثنا عبد الرزاق قال كان معمر يرى رفع اليدين في الصلاة ‏.‏ وسمعت الجارود بن معاذ يقول كان سفيان بن عيينة وعمر بن هارون والنضر بن شميل يرفعون أيديهم إذا افتتحوا الصلاة وإذا ركعوا وإذا رفعوا رءوسهم ‏.‏",
      "text_en": " Salim narrated:                     Same as 255 (above) with a different chain",
      "usc_msa_ref": "",
      "chain": [
        "36613",
        "20005",
        "11013",
        "3",
        "5",
        "3045",
        "5265",
        "19"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2242",
      "hadith_no": "2242",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Inheritance - كتاب الفرائض عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "29",
      "text_ar": "حدثنا الفضل بن الصباح البغدادي، أخبرنا سفيان بن عيينة، أخبرنا محمد بن المنكدر، سمع جابر بن عبد الله، يقول مرضت فأتاني رسول الله صلى الله عليه وسلم يعودني فوجدني قد أغمي على فأتى ومعه أبو بكر وعمر وهما ماشيان فتوضأ رسول الله صلى الله عليه وسلم فصب على من وضوئه فأفقت فقلت يا رسول الله كيف أقضي في مالي أو كيف أصنع في مالي فلم يجبني شيئا وكان له تسع أخوات حتى نزلت آية الميراث ‏:‏ ‏(‏يستفتونك قل الله يفتيكم في الكلالة ‏)‏ الآية ‏.‏ قال جابر في نزلت ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Jabir bin 'Abdullah said:                     \"I was ill, so the Messenger of Allah(S.A.W)came to visit me and found me unconscious. He came walking while Abu Bakr and 'Umar were with him. The Messenger of Allah(S.A.W) performed Wudu, then poured the remaining water on me, so I came to my senses. I said: 'O Messenger of Allah(S.A.W)! how shall I dispose of my wealth?' - or - 'What shall I do with my wealth?' He did not reply anything to me\" -and he had nine sisters- \"until the Ayah about the inheritance was revealed: they ask you for a legal verdict. Say: \"Allah directs (thus) about Al-Kalalah.\" Jabir said: \"It was revealed regarding me.\"",
      "usc_msa_ref": "",
      "chain": [
        "36613",
        "20005",
        "11048",
        "34"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2745",
      "hadith_no": "2745",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on the description of Paradise - كتاب صفة الجنة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "38",
      "text_ar": "حدثنا الفضل بن الصباح البغدادي، حدثنا معن بن عيسى القزاز، عن خالد بن أبي بكر، عن سالم بن عبد الله، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ باب أمتي الذي يدخلون منه الجنة عرضه مسيرة الراكب الجواد ثلاثا ثم إنهم ليضغطون عليه حتى تكاد مناكبهم تزول ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏ قال سألت محمدا عن هذا الحديث فلم يعرفه وقال لخالد بن أبي بكر مناكير عن سالم بن عبد الله ‏.‏",
      "text_en": " Salim bin 'Abdullah narrated from his father that the Messenger of Allah (s.a.w) said:                     \"The breadth of the gate through which my Ummah shall enter Paradise is the distance that a good rider covers in three. (meaning three nights or three years and, and that [the latter] is more obvious) Despite that, they shall be constrained by it until their shoulders are almost crushed completely.\"",
      "usc_msa_ref": "",
      "chain": [
        "36613",
        "30112",
        "11011",
        "18"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2699-2",
      "hadith_no": "2699",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Seeking Permission - كتاب الاستئذان والآداب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "42",
      "text_ar": "حدثنا الفضل بن الصباح، - بغدادي - حدثنا سعيد بن زكريا، عن عنبسة بن عبد الرحمن، عن محمد بن زاذان، عن محمد بن المنكدر، عن جابر بن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ السلام قبل الكلام ‏\"‏ ‏.‏ وبهذا الإسناد عن النبي صلى الله عليه وسلم قال ‏\"‏ لا تدعوا أحدا إلى الطعام حتى يسلم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث منكر لا نعرفه إلا من هذا الوجه ‏.‏ وسمعت محمدا يقول عنبسة بن عبد الرحمن ضعيف في الحديث ذاهب ومحمد بن زاذان منكر الحديث ‏.‏",
      "text_en": " Narrated Jabir bin 'Abdullah:                     that the Messenger of Allah (ﷺ) said: \"The Salam is before talking.\"With this chain it has been reported that the Prophet (ﷺ) said: \"Do not invite anyone to the food until the Salam is given.\"",
      "usc_msa_ref": "",
      "chain": [
        "36613",
        "28459",
        "12455",
        "11048",
        "34"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3288",
      "hadith_no": "3288",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا الفضل بن الصباح البغدادي، حدثنا سفيان، عن ابن المنكدر، عن جابر بن عبد الله، عن النبي صلى الله عليه وسلم نحوه وفي حديث الفضل بن الصباح كلام أكثر من هذا ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "36613",
        "20012",
        "11048",
        "34"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3349",
      "hadith_no": "3349",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا الفضل بن الصباح البغدادي، حدثنا محمد بن فضيل، عن داود الأودي، عن الشعبي، عن علقمة، عن عبد الله، قال من سره أن ينظر إلى الصحيفة التي عليها خاتم محمد صلى الله عليه وسلم فليقرأ هذه الآيات ‏:‏ ‏(‏ قل تعالوا أتل ما حرم ربكم عليكم ‏)‏ الآية إلى قوله ‏:‏ ‏(‏ لعلكم تتقون ‏)‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Narrated 'Abdullah bin Mas'ud:                     \"Whoever wishes to look at the Sahifah which Muhammad (ﷺ) placed his seal upon, then let him look at these Ayat, 'Say: Come, I will recite what your Lord has prohibited you from... up to His saying \"That you may have Taqwa (6:151-153).'\"",
      "usc_msa_ref": "",
      "chain": [
        "36613",
        "20356",
        "11052",
        "11017",
        "16"
      ]
    }
  ],
  "total_hadiths": 6
}