{
  "id": "36610",
  "name": "'Isa bin Msawr al-Jwhry عيسى بن مساور الجوهري",
  "full_name": "'Isa bin Msawr al-Jwhry عيسى بن مساور الجوهري",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "245",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Baghdad"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ س  -  صدوق ]"
    ],
    "tags": [
      "al-Baghdadi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "id": "sunan-an-nasai-2374",
      "hadith_no": "2374",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "حدثنا عيسى بن مساور، عن الوليد، قال حدثنا الأوزاعي، قال أخبرني عطاء، عن عبد الله، ح وأنبأنا محمد بن عبد الله، قال حدثني الوليد، عن الأوزاعي، قال حدثنا عطاء، عن عبد الله بن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من صام الأبد فلا صام ولا أفطر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin 'Umar said:                     \"The Messenger of Allah said: 'Whoever fasts every day of is life, then he has neither fasted, nor broken the fast.\"",
      "usc_msa_ref": "",
      "chain": [
        "36610",
        "20733",
        "20024",
        "11029",
        "18",
        "30561",
        "20733",
        "20024",
        "11029",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-2437",
      "hadith_no": "2437",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا عيسى بن مساور، قال حدثنا محمد بن شعيب بن شابور، عن معاوية بن سلام، عن أخيه، زيد بن سلام أنه أخبره عن جده أبي سلام، عن عبد الرحمن بن غنم، أن أبا مالك الأشعري، حدثه أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إسباغ الوضوء شطر الإيمان والحمد لله تملأ الميزان والتسبيح والتكبير يملأ السموات والأرض والصلاة نور والزكاة برهان والصبر ضياء والقرآن حجة لك أو عليك ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdur-Rahman bin Ghanm that Abu Malik Al-Ash'ari told him that the Messenger of Allah said:                     \"Isbagh Al-Wudu is half of faith; Alhamdu lillah (praise be to Allah) fills the balance; the Tasbih and the Takbir fill the heavens and Earth; the Salah is light; the Zakah is a sign (of sincerity); patience is an illuminating torch; and the Qur'an is proof, either for you or against you.\"",
      "usc_msa_ref": "",
      "chain": [
        "36610",
        "20732",
        "20401",
        "5152"
      ]
    },
    {
      "id": "sunan-an-nasai-3741",
      "hadith_no": "3741",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of 'Umra - كتاب العمرى",
      "chapter_no": "34",
      "text_ar": "أخبرنا عيسى بن مساور، قال حدثنا الوليد، قال حدثنا أبو عمرو، عن ابن شهاب، عن أبي سلمة، عن جابر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ العمرى لمن أعمرها هي له ولعقبه يرثها من يرثه من عقبه ‏\"‏ ‏.‏",
      "text_en": " (A different chain) from Abu 'Amr, from Ibn Shihab, from Abu Salamah, from Jabir, who said:                      \"The Messenger of Allah said: 'Umra (a lifelong gift) belongs to the one to whom it was given; it belongs to him and to his heirs, and is inherited by those among his descendants who inherit from him.'\"",
      "usc_msa_ref": "",
      "chain": [
        "36610",
        "20733",
        "20024",
        "11013",
        "10567",
        "34"
      ]
    },
    {
      "id": "sunan-an-nasai-4172",
      "hadith_no": "4172",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of al-Bay'ah - كتاب البيعة",
      "chapter_no": "39",
      "text_ar": "أخبرنا عيسى بن مساور، قال حدثنا الوليد، عن عبد الله بن العلاء بن زبر، عن بسر بن عبيد الله، عن أبي إدريس الخولاني، عن عبد الله بن واقد السعدي، قال وفدت إلى رسول الله صلى الله عليه وسلم في وفد كلنا يطلب حاجة وكنت آخرهم دخولا على رسول الله صلى الله عليه وسلم فقلت يا رسول الله إني تركت من خلفي وهم يزعمون أن الهجرة قد انقطعت ‏.‏ قال ‏\"‏ لا تنقطع الهجرة ما قوتل الكفار ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Waqdan As-Sa'di said:                     \"We came in a delegation to the messenger of Allah, each of us with a question to ask him. I was the last of them to come in to the Messenger of Allah, and I said: 'O Messenger of Allah, I have left people behind me, and they are saying that emigration (Hijrah) has ceased.' He said: 'Emigration will not cease so long as the disbelievers are being fought.\"'",
      "usc_msa_ref": "",
      "chain": [
        "36610",
        "20733",
        "20399",
        "11412",
        "11027"
      ]
    }
  ],
  "total_hadiths": 4
}