{
  "id": "3661",
  "name": "al-Sa'b bin Juthama bin Qays ( الصعب بن جثامة ( رضي الله عنه",
  "full_name": "al-Sa'b bin Juthama bin Qays ( الصعب بن جثامة ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Hijaz"
    },
    "death": {
      "date_hijri": "12",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Ta'if",
      "Medina"
    ],
    "area_of_interest": [
      "Narrator [ ع  -  صحابي ]"
    ],
    "tags": [
      "al-Laithi",
      "al-Hijazi",
      "Emigrant"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [
    {
      "id": "3662",
      "name": "Muhlam bin Juthama bin Qays ( محلم بن جثامة ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "3663",
      "name": "Laith bin Juthama bin Qays ( ليث بن جثامة ( رضي الله عنه",
      "grade": "Comp.(RA)"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "students": [
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1856",
      "source": " Sahih Bukhari ",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن ابن شهاب، عن عبيد الله بن عبد الله بن عتبة بن مسعود، عن عبد الله بن عباس، عن الصعب بن جثامة الليثي، أنه أهدى لرسول الله صلى الله عليه وسلم حمارا وحشيا، وهو بالأبواء أو بودان فرده عليه، فلما رأى ما في وجهه قال ‏\"‏ إنا لم نرده عليك إلا أنا حرم ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Abbas:                     From As-Sa'b bin Jath-thama Al-Laithi that the latter presented an onager to Allah's Apostle while he was at Al-Abwa' or at Waddan, and he refused it. On noticing the signs of some unpleasant feeling of disappointment on his (As-Sab's) face, the Prophet said to him, \"I have only returned it because I am Muhrim.\"",
      "chain": [
        "30355",
        "20001",
        "11013",
        "11004",
        "17",
        "3661"
      ]
    },
    {
      "hadith_no": "2573",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن ابن شهاب، عن عبيد الله بن عبد الله بن عتبة بن مسعود، عن عبد الله بن عباس، عن الصعب بن جثامة  رضى الله عنهم  أنه أهدى لرسول الله صلى الله عليه وسلم حمارا وحشيا وهو بالأبواء أو بودان فرد عليه، فلما رأى ما في وجهه قال ‏\"‏ أما إنا لم نرده عليك إلا أنا حرم ‏\"‏‏.‏",
      "text_en": " Narrated As-Sa'b bin Jath-thama:                     An onager was presented to Allah's Apostle at the place called Al-Abwa' or Waddan, but Allah's Apostle rejected it. When the Prophet noticed the signs of sorrow on the giver's face he said, \"We have not rejected your gift, but we are in the state of Ihram.\" (i.e. if we were not in a state of Ihram we would have accepted your gift, Fath-ul-Bari page 130, Vol. 6)",
      "chain": [
        "30103",
        "20001",
        "11013",
        "11004",
        "17",
        "3661"
      ]
    },
    {
      "hadith_no": "3012",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، حدثنا الزهري، عن عبيد الله، عن ابن عباس، عن الصعب بن جثامة  رضى الله عنهم  قال مر بي النبي صلى الله عليه وسلم بالأبواء  أو بودان  وسئل عن أهل الدار يبيتون من المشركين، فيصاب من نسائهم وذراريهم قال ‏\"‏ هم منهم ‏\"‏‏.‏ وسمعته يقول ‏\"‏ لا حمى إلا لله ولرسوله صلى الله عليه وسلم ‏\"‏‏.‏",
      "text_en": " Narrated As-Sab bin Jaththama:                     The Prophet passed by me at a place called Al-Abwa or Waddan, and was asked whether it was permissible to attack the pagan warriors at night with the probability of exposing their women and children to danger. The Prophet replied, \"They (i.e. women and children) are from them (i.e. pagans).\" I also heard the Prophet saying, \"The institution of Hima is invalid except for Allah and His Apostle.\"",
      "chain": [
        "30026",
        "20005",
        "11013",
        "11201",
        "17",
        "3661"
      ]
    },
    {
      "hadith_no": "2902",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن ابن شهاب، عن عبيد الله بن، عبد الله عن ابن عباس، عن الصعب بن جثامة الليثي، أنه أهدى لرسول الله صلى الله عليه وسلم حمارا وحشيا وهو بالأبواء - أو بودان - فرده عليه رسول الله صلى الله عليه وسلم قال فلما أن رأى رسول الله صلى الله عليه وسلم ما في وجهي قال ‏\"‏ إنا لم نرده عليك إلا أنا حرم ‏\"‏ ‏.‏",
      "text_en": " Al-Sa'b b. Jaththama al-Laithi reported that he presented a wild ass to Allah's Messenger (may peace be upon him) when he was at al-Abwa', or Waddan, and he refused to accept it. He (the narrator) said:                      When the Messenger of Allah (may peace be upon him) looked into my face (which had the mark of dejection as my present had been rejected by him) he (in order to console me) said: We have refused it only because we are in a state of Ihram.",
      "chain": [
        "30399",
        "11013",
        "11004",
        "17",
        "3661"
      ]
    },
    {
      "hadith_no": "2903",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا يحيى بن يحيى، ومحمد بن رمح، وقتيبة، جميعا عن الليث بن سعد، ح وحدثنا عبد بن حميد، أخبرنا عبد الرزاق، أخبرنا معمر، ح وحدثنا حسن الحلواني، حدثنا يعقوب، حدثنا أبي، عن صالح، كلهم عن الزهري، بهذا الإسناد أهديت له حمار وحش ‏.‏ كما قال مالك ‏.‏ وفي حديث الليث وصالح أن الصعب بن جثامة أخبره ‏.‏",
      "text_en": " A hadith (pertaining to this topic), has been narrated on the authority of Zuhri (and the words are):                     \" I presented to him (the Holy Prophet) a wild ass.\"",
      "chain": [
        "30399",
        "30490",
        "20023",
        "30553",
        "20121",
        "20115",
        "130115",
        "20184",
        "20150",
        "3661"
      ]
    },
    {
      "hadith_no": "4647",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "وحدثنا يحيى بن يحيى، وسعيد بن منصور، وعمرو الناقد، جميعا عن ابن عيينة، قال يحيى أخبرنا سفيان بن عيينة، عن الزهري، عن عبيد الله، عن ابن عباس، عن الصعب، بن جثامة قال سئل النبي صلى الله عليه وسلم عن الذراري من المشركين يبيتون فيصيبون من نسائهم وذراريهم ‏.‏ فقال ‏\"‏ هم منهم ‏\"‏ ‏.‏",
      "text_en": " It is reported on the authority of Sa'b b. Jaththama that the Prophet of Allah (may peace be upon him), when asked about the women and children of the polytheists being killed during the night raid, said:                      They are from them.",
      "chain": [
        "30399",
        "30116",
        "20005",
        "11449",
        "20005",
        "11013",
        "11201",
        "17",
        "3661"
      ]
    },
    {
      "hadith_no": "4648",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا عبد بن حميد، أخبرنا عبد الرزاق، أخبرنا معمر، عن الزهري، عن عبيد، الله بن عبد الله بن عتبة عن ابن عباس، عن الصعب بن جثامة، قال قلت يا رسول الله إنا نصيب في البيات من ذراري المشركين قال ‏\"‏ هم منهم ‏\"‏ ‏.‏",
      "text_en": " It is narrated by Sa'b b. Jaththama that he said (to the Holy Prophet):                      Messenger of Allah, we kill the children of the polytheists during the night raids. He said: They are from them.",
      "chain": [
        "30553",
        "20121",
        "20115",
        "11013",
        "11004",
        "17",
        "3661"
      ]
    },
    {
      "hadith_no": "4649",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "وحدثني محمد بن رافع، حدثنا عبد الرزاق، أخبرنا ابن جريج، أخبرني عمرو، بن دينار أن ابن شهاب، أخبره عن عبيد الله بن عبد الله بن عتبة، عن ابن عباس، عن الصعب بن جثامة، أن النبي صلى الله عليه وسلم قيل له لو أن خيلا أغارت من الليل فأصابت من أبناء المشركين قال ‏\"‏ هم من آبائهم ‏\"‏ ‏.‏",
      "text_en": " Sa'b b. Jaththama has narrated that the Prophet (may peace be upon him) asked:                      What about the children of polytheists killed by the cavalry during the night raid? He said: They are from them.",
      "chain": [
        "30375",
        "20121",
        "11070",
        "11081",
        "11013",
        "11004",
        "17",
        "3661"
      ]
    },
    {
      "hadith_no": "2672",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا أحمد بن عمرو بن السرح، حدثنا سفيان، عن الزهري، عن عبيد الله، - يعني ابن عبد الله - عن ابن عباس، عن الصعب بن جثامة، أنه سأل النبي صلى الله عليه وسلم عن الدار من المشركين يبيتون فيصاب من ذراريهم ونسائهم ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ هم منهم ‏\"‏ ‏.‏ وكان عمرو - يعني ابن دينار - يقول هم من آبائهم ‏.‏ قال الزهري ثم نهى رسول الله صلى الله عليه وسلم بعد ذلك عن قتل النساء والولدان ‏.‏",
      "text_en": " Al Sa’b bin Jaththamah said that he asked the Apostle of Allaah(ﷺ) about the polytheists whose settlemnst were attacked at night when some of their offspring and women were smitten. The Prophet(ﷺ) “They are of them. ‘Amr bin Dinar used to say “they are regarded in the same way as their parents.”Al-Zuhri said:                      Thereafter the Messenger of Allah (ﷺ) prohibited to kill women and children.",
      "chain": [
        "30485",
        "20005",
        "11013",
        "11004",
        "17",
        "3661"
      ]
    },
    {
      "hadith_no": "3083",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا ابن السرح، أخبرنا ابن وهب، أخبرني يونس، عن ابن شهاب، عن عبيد الله بن عبد الله، عن ابن عباس، عن الصعب بن جثامة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا حمى إلا لله ولرسوله ‏\"‏ ‏.‏ قال ابن شهاب وبلغني أن رسول الله صلى الله عليه وسلم حمى النقيع ‏.‏",
      "text_en": " Al Sa’b bin Jaththamah reported the Apostle of Allaah(ﷺ) as saying “There is no (permission for) protected land except for Allaah and His Prophet. Ibn Shihab said “It has reached me that the Apostle of Allaah(ﷺ) protected Naqi’.”",
      "chain": [
        "30485",
        "20029",
        "20475",
        "11013",
        "11004",
        "17",
        "3661"
      ]
    },
    {
      "hadith_no": "3084",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا عبد العزيز بن محمد، عن عبد الرحمن بن الحارث، عن ابن شهاب، عن عبيد الله بن عبد الله، عن عبد الله بن عباس، عن الصعب بن جثامة، أن النبي صلى الله عليه وسلم حمى النقيع وقال ‏\"‏ لا حمى إلا لله عز وجل ‏\"‏ ‏.‏",
      "text_en": " Narrated As-Sa'b ibn Jaththamah:                     The Prophet (ﷺ) protected Naqi and said: There is no (permission for) protected land except for Allah Most High.",
      "chain": [
        "30116",
        "20167",
        "448",
        "11013",
        "11004",
        "17",
        "3661"
      ]
    },
    {
      "hadith_no": "849",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا قتيبة، حدثنا الليث، عن ابن شهاب، عن عبيد الله بن عبد الله، أن ابن عباس، أخبره أن الصعب بن جثامة أخبره أن رسول الله صلى الله عليه وسلم مر به بالأبواء أو بودان فأهدى له حمارا وحشيا فرده عليه فلما رأى رسول الله صلى الله عليه وسلم ما في وجهه من الكراهية قال ‏\"‏ إنه ليس بنا رد عليك ولكنا حرم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وقد ذهب قوم من أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم إلى هذا الحديث وكرهوا أكل الصيد للمحرم ‏.‏ وقال الشافعي إنما وجه هذا الحديث عندنا إنما رده عليه لما ظن أنه صيد من أجله وتركه على التنزه ‏.‏ وقد روى بعض أصحاب الزهري عن الزهري هذا الحديث وقال أهدى له لحم حمار وحش ‏.‏ وهو غير محفوظ ‏.‏ قال وفي الباب عن علي وزيد بن أرقم ‏.‏",
      "text_en": " Ibn Abbas narrated that:                     As-S'ab bin Jath-thamah informed him that the Messenger of Allah had passed him at Al-Abwa or Bawaddan. He (As-S'ab) gave him a wild donkey but he refused it. When the Messenger of Allah noticed on his face that he was upset, he said: \"We would not refuse you, but we are in Ihram\"",
      "chain": [
        "30367",
        "20023",
        "11013",
        "11004",
        "17",
        "3661"
      ]
    },
    {
      "hadith_no": "1570",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Military Expeditions - كتاب السير عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "21",
      "text_ar": "حدثنا نصر بن علي الجهضمي، حدثنا سفيان بن عيينة، عن الزهري، عن عبيد الله بن عبد الله، عن ابن عباس، قال أخبرني الصعب بن جثامة، قال قلت يا رسول الله إن خيلنا أوطأت من نساء المشركين وأولادهم ‏.‏ قال ‏\"‏ هم من آبائهم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     \"I was informed by As-Sa'b bin Jaththamah who said: \" I said: \"O Messenger of Allah our horses trampled over women and children of the idolaters.\" He said: \"They are from their fathers.'\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.",
      "chain": [
        "30395",
        "20005",
        "11013",
        "11004",
        "17",
        "3661"
      ]
    },
    {
      "hadith_no": "2819",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا قتيبة بن سعيد، عن مالك، عن ابن شهاب، عن عبيد الله بن عبد الله بن عتبة، عن عبد الله بن عباس، عن الصعب بن جثامة، أنه أهدى لرسول الله صلى الله عليه وسلم حمار وحش وهو بالأبواء أو بودان فرده عليه رسول الله صلى الله عليه وسلم فلما رأى رسول الله صلى الله عليه وسلم ما في وجهي قال ‏\"‏ أما إنه لم نرده عليك إلا أنا حرم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from As-Sab bin Jaththamah that:                     he gave the Messenger of Allah an onager when he was in Al-Abwa or in Waddan, but the Messenger of Allah gave it back to him. \"And when the Messenger of Allah saw the expression on my face he said: \"We only gave it back to you because we are in Ihram.'\"",
      "chain": [
        "30367",
        "20001",
        "11013",
        "11004",
        "17",
        "3661"
      ]
    },
    {
      "hadith_no": "2820",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا قتيبة، قال حدثنا حماد بن زيد، عن صالح بن كيسان، عن عبيد الله بن عبد الله، عن ابن عباس، عن الصعب بن جثامة، أن النبي صلى الله عليه وسلم أقبل حتى إذا كان بودان رأى حمار وحش فرده عليه وقال ‏\"‏ إنا حرم لا نأكل الصيد ‏\"‏ ‏.‏",
      "text_en": " It was narrated from As-Sab bin Jaththamah that:                     the Prophet came, and when he was in Waddan, he saw an onager, but he gave it back to him and said: \"'We are in Ihram, we cannot eat game.'\"",
      "chain": [
        "30367",
        "20022",
        "11176",
        "11004",
        "17",
        "3661"
      ]
    },
    {
      "hadith_no": "2946",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا سفيان بن عيينة، عن الزهري، عن عبيد الله بن عبد الله، عن ابن عباس، قال حدثنا الصعب بن جثامة، قال سئل النبي صلى الله عليه وسلم عن أهل الدار من المشركين يبيتون فيصاب النساء والصبيان قال ‏\"‏ هم منهم ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “Sa’b bin Jaththamah said: ‘TheProphet (ﷺ) was asked about the polytheists who are attacked atnight, and their women and children are killed.’ He said: ‘Theyarefrom among them.’”",
      "chain": [
        "30201",
        "20005",
        "11013",
        "11004",
        "17",
        "3661"
      ]
    }
  ],
  "total_hadiths": 16
}