{
  "id": "36621",
  "name": "Muhammad bin Isma'il bin Yusuf محمد بن إسماعيل بن يوسف",
  "full_name": "Muhammad bin Isma'il bin Yusuf محمد بن إسماعيل بن يوسف",
  "grade": "3rd Century AH [11th generation]",
  "reliability_grade": "Thiqah Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "280",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Tirmidh",
      "Baghdad"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ ت  س  -  ثقة حافظ ]"
    ],
    "tags": [
      "al-Salmi",
      "al-Tirmidhi",
      "Baghdad"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "1525",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Vows and Oaths - كتاب النذور والأيمان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "20",
      "text_ar": "حدثنا أبو إسماعيل الترمذي، - واسمه محمد بن إسماعيل بن يوسف حدثنا أيوب بن سليمان بن بلال، حدثنا أبو بكر بن أبي أويس، عن سليمان بن بلال، عن موسى بن عقبة، ومحمد بن عبد الله بن أبي عتيق، عن الزهري، عن سليمان بن أرقم، عن يحيى بن أبي كثير، عن أبي سلمة، عن عائشة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا نذر في معصية الله وكفارته كفارة يمين ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب وهو أصح من حديث أبي صفوان عن يونس ‏.‏ وأبو صفوان هو مكي واسمه عبد الله بن سعيد بن عبد الملك بن مروان وقد روى عنه الحميدي وغير واحد من جلة أهل الحديث ‏.‏ وقال قوم من أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم لا نذر في معصية الله وكفارته كفارة يمين ‏.‏ وهو قول أحمد وإسحاق واحتجا بحديث الزهري عن أبي سلمة عن عائشة ‏.‏ وقال بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم لا نذر في معصية ولا كفارة في ذلك ‏.‏ وهو قول مالك والشافعي ‏.‏",
      "text_en": " Narrated 'Aishah:                     That the Prophet (ﷺ) said: \"There is no vowing in disobedience to Allah, and its atonement is the atonement of an oath.\"",
      "chain": [
        "36621",
        "20158",
        "20436",
        "20160",
        "11106",
        "20175",
        "11013",
        "24178",
        "11449",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "563",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا محمد بن إسماعيل الترمذي، قال حدثنا أيوب بن سليمان، قال حدثنا أبو بكر، عن سليمان بن بلال، عن يونس، عن ابن شهاب، عن سالم، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من أدرك ركعة من صلاة من الصلوات فقد أدركها إلا أنه يقضي ما فاته ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Salim that the Messenger of Allah (ﷺ) said:                      \"Whoever catches up with a Rak'ah of one of the prayers has caught up with it, except that he has to make up the portion that he missed.\"",
      "chain": [
        "36621",
        "20158",
        "20436",
        "20160",
        "20475",
        "11013",
        "11011"
      ]
    },
    {
      "hadith_no": "3839",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا محمد بن إسماعيل الترمذي، قال حدثنا أيوب بن سليمان، قال حدثني أبو بكر بن أبي أويس، قال حدثني سليمان بن بلال، عن محمد بن أبي عتيق، وموسى بن عقبة، عن ابن شهاب، عن سليمان بن أرقم، أن يحيى بن أبي كثير الذي، كان يسكن اليمامة حدثه أنه، سمع أبا سلمة، يخبر عن عائشة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا نذر في معصية وكفارتها كفارة يمين ‏\"‏ ‏.‏ قال أبو عبد الرحمن سليمان بن أرقم متروك الحديث والله أعلم ‏.‏ خالفه غير واحد من أصحاب يحيى بن أبي كثير في هذا الحديث ‏.‏",
      "text_en": " It was narrated from 'Aishah that the Messenger of Allah said:                      \"There is no vow to commit an act of disobedience, and its expiation is the expiation for an oath.\"",
      "chain": [
        "36621",
        "20158",
        "20436",
        "20160",
        "11106",
        "11013",
        "24178",
        "53"
      ]
    }
  ],
  "total_hadiths": 3
}