{
  "id": "36649",
  "name": "Muhammad bin 'Isa bin al-Tibaa' محمد بن عيسى بن الطباع",
  "full_name": "Muhammad bin 'Isa bin al-Tibaa' محمد بن عيسى بن الطباع",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "150",
      "date_gregorian": "NA",
      "date_display": [
        "150 AH"
      ],
      "place": ""
    },
    "death": {
      "date_hijri": "224",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Baghdad",
      "al-Adhna"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خت  د  تم  س  ق  -  ثقة ]"
    ],
    "tags": [
      "al-Baghdadi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "20022",
      "name": "Hammad bin Zayd حماد بن زيد بن درهم الأزدي الأزرق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20177",
      "name": "Muhammad bin 'Abdur Rahman b. Abi Dh'ab محمد بن عبد الرحمن بن أبي ذئب",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20258",
      "name": "'Abdul Warith bin Sa'id bin Dhakwan عبد الوارث بن سعيد بن ذكوان",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20248",
      "name": "'Abdul Salam bin Harb bin Salm al-Mala'i عبد السلام بن حرب بن سلم النهدي الملائي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20505",
      "name": "'Abdullah bin Ja'far bin 'Abdur Rahman عبد الله بن جعفر بن عبد الرحمن - المخرمي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20446",
      "name": "'Atab bin Bashayr عتاب بن بشير",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20441",
      "name": "'Abdur Rahman bin Abi al-Mawal عبد الرحمن بن أبي الموال",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20469",
      "name": "Wadah bin 'Abdullah al-Yashkari وضاح بن عبد الله اليشكري أبو عوانة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20468",
      "name": "Hashaym bin Bashayr bin al-Qasim هشيم بن بشير بن القاسم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20288",
      "name": "Ma'tmar bin Sulaiman-al-Taufayl معتمر بن سليمان - الطفيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20304",
      "name": "Yazid bin Zari' يزيد بن زريع",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20179",
      "name": "Muhammad bin Matraf محمد بن مطرف",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20743",
      "name": "Malazm bin 'Amr - Lazaym ملازم بن عمرو اليمامي - لزيم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20201",
      "name": "Marwan bin Mua'wiya al-Fazari مروان بن معاوية الفزاري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20027",
      "name": "Yusuf bin Y'aqub bin Abi Salma يوسف بن يعقوب بن أبي سلمة الماجشون",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20417",
      "name": "Hisan bin Ibrahim حسان بن إبراهيم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20736",
      "name": "Isma'il bin Ayyash bin Saleem إسماعيل بن عياش بن سليم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20243",
      "name": "'Aabad bin 'Aabad bin Habib عباد بن عباد بن حبيب بن المهلب",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20431",
      "name": "'Aabad bin al-Wam bin عباد بن العوام",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30005",
      "name": "Imam Tirmidhi الترمذي محمد بن عيسى بن سورة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30006",
      "name": "Imam Nasa'i أحمد بن شعيب بن علي بن سنان النسائي",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30023",
      "name": "Muhammad bin Yahya bin Faris al-Dhahli محمد بن يحيى بن فارس الذهلي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30025",
      "name": "'Abdullah bin 'Abdur Rahman al-Daarimi عبد الله بن عبد الرحمن الدارمي",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "494",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن عيسى، - يعني ابن الطباع - حدثنا إبراهيم بن سعد، عن عبد الملك بن الربيع بن سبرة، عن أبيه، عن جده، قال قال النبي صلى الله عليه وسلم ‏\"‏ مروا الصبي بالصلاة إذا بلغ سبع سنين وإذا بلغ عشر سنين فاضربوه عليها ‏\"‏ ‏.‏",
      "text_en": " Narrated As-Saburah:                     The Prophet (ﷺ) said: Command a boy to pray when he reaches the age of seven years. When he becomes ten years old, then beat him for prayer.",
      "chain": [
        "36649",
        "20150",
        "20662"
      ]
    },
    {
      "hadith_no": "644",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن عيسى بن الطباع، حدثنا حجاج، عن ابن جريج، قال أكثر ما رأيت عطاء يصلي سادلا ‏.‏ قال أبو داود وهذا يضعف ذلك الحديث ‏.‏",
      "text_en": " Ibn Juraij said; I often saw ‘Ata praying while letting his garment trail.Abu Dawud said:                      This (practice of ‘Ata’) weakens the tradition (narrated by Abu Hurairah).",
      "chain": [
        "36649",
        "20219",
        "11070",
        "30002"
      ]
    },
    {
      "hadith_no": "4266",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim) - كتاب الفتن والملاحم",
      "chapter_no": "37",
      "text_ar": "حدثنا محمد بن عيسى بن الطباع، حدثنا عبد الله بن عبد القدوس، قال زياد سيمين كوش ‏.‏",
      "text_en": " 'Abd Allah b. 'Abd al-Quddus mentioned in his version:                      Ziyad, one who has white ears.",
      "chain": [
        "36649",
        "25147"
      ]
    },
    {
      "hadith_no": "4818",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن عيسى بن الطباع، وكثير بن عبيد، قالا حدثنا مروان، - قال ابن عيسى قال - حدثنا حميد، عن أنس، قال جاءت امرأة إلى رسول الله صلى الله عليه وسلم فقالت يا رسول الله إن لي إليك حاجة ‏.‏ فقال لها ‏\"‏ يا أم فلان اجلسي في أى نواحي السكك شئت حتى أجلس إليك ‏\"‏ ‏.‏ قال فجلست فجلس النبي صلى الله عليه وسلم إليها حتى قضت حاجتها ‏.‏ ولم يذكر ابن عيسى حتى قضت حاجتها ‏.‏ وقال كثير عن حميد عن أنس ‏.‏",
      "text_en": " Narrated Anas ibn Malik:                     A woman came to the Messenger of Allah (ﷺ) and said: Messenger of Allah: I have some need with you. He said to her: Mother of so and so, sit in the corner of any street you wish and I shall sit with you. So she sat and the Messenger of Allah (ﷺ) also sat with her till she fulfilled her need.The narrator Ibn 'Isa did not mention \"till she fulfilled her need.\" And Kathir said: from Humaid on the authority of Anas.",
      "chain": [
        "36649",
        "38462",
        "20201",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "5225",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن عيسى بن الطباع، حدثنا مطر بن عبد الرحمن الأعنق، حدثتني أم أبان بنت الوازع بن زارع، عن جدها، زارع وكان في وفد عبد القيس قال لما قدمنا المدينة فجعلنا نتبادر من رواحلنا فنقبل يد النبي صلى الله عليه وسلم ورجله - قال - وانتظر المنذر الأشج حتى أتى عيبته فلبس ثوبيه ثم أتى النبي صلى الله عليه وسلم فقال له ‏\"‏ إن فيك خلتين يحبهما الله الحلم والأناة ‏\"‏ ‏.‏ قال يا رسول الله أنا أتخلق بهما أم الله جبلني عليهما قال ‏\"‏ بل الله جبلك عليهما ‏\"‏ ‏.‏ قال الحمد لله الذي جبلني على خلتين يحبهما الله ورسوله ‏.‏",
      "text_en": " Narrated al-Wazi' ibn Zari':                     Umm Aban, daughter of al-Wazi' ibn Zari', quoting his grandfather, who was a member of the deputation of AbdulQays, said: When we came to Medina, we raced to be first to dismount and kiss the hand and foot of the Messenger of Allah (ﷺ). But al-Mundhir al-Ashajj waited until he came to the bundle of his clothes. He put on his two garments and then he went to the Prophet (ﷺ).  He said to him: You have two characteristics which Allah likes: gentleness and deliberation.  He asked: Have I acquired them or has Allah has created (them) my nature?  He replied: No, Allah has created (them) in your nature.  He then said: Praise be to Allah Who has created in my nature two characteristics which Allah and His Apostle like.",
      "chain": [
        "36649"
      ]
    },
    {
      "hadith_no": "4638",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا محمد بن يحيى بن عبد الله، قال حدثنا محمد بن عيسى بن الطباع، قال حدثنا أبو عوانة، عن مغيرة، عن الشعبي، عن جابر، قال غزوت مع النبي صلى الله عليه وسلم على ناضح لنا ثم ذكرت الحديث بطوله ثم ذكر كلاما معناه فأزحف الجمل فزجره النبي صلى الله عليه وسلم فانتشط حتى كان أمام الجيش فقال النبي صلى الله عليه وسلم ‏\"‏ يا جابر ما أرى جملك إلا قد انتشط ‏\"‏ ‏.‏ قلت ببركتك يا رسول الله ‏.‏ قال ‏\"‏ بعنيه ولك ظهره حتى تقدم ‏\"‏ ‏.‏ فبعته وكانت لي إليه حاجة شديدة ولكني استحييت منه فلما قضينا غزاتنا ودنونا استأذنته بالتعجيل فقلت يا رسول الله إني حديث عهد بعرس ‏.‏ قال ‏\"‏ أبكرا تزوجت أم ثيبا ‏\"‏ ‏.‏ قلت بل ثيبا يا رسول الله إن عبد الله بن عمرو أصيب وترك جواري أبكارا فكرهت أن آتيهن بمثلهن فتزوجت ثيبا تعلمهن وتؤدبهن فأذن لي وقال لي ‏\"‏ ائت أهلك عشاء ‏\"‏ ‏.‏ فلما قدمت أخبرت خالي ببيعي الجمل فلامني فلما قدم رسول الله صلى الله عليه وسلم غدوت بالجمل فأعطاني ثمن الجمل والجمل وسهما مع الناس ‏.‏",
      "text_en": " It was narrated that Jabir said:                     \"I went on a campaign with the Messenger of  Allah riding a camel of ours,\" then he quoted the whole Hadih. Then he said words to the effect that: \"The camel got tried and the Prophet hit it, so it became energetic and came to the front of the army. The Prophet said: 'O Jabir, I see that your camel has become energetic.' I said: \"It is because of your blessing, O Messenger of Allah,' He said: 'Sell it to me, and you can ride it till we arrive (in Al-Madinah). 'So I sold it to him. I was in great need of it myself but I felt too shy to refuse. When we finished our campaign, and we were close to Al-Madinah, I asked his permission to go on ahead. I said: 'O Messenger of Allah, I am newly married.' He said; 'Have you married a virgin or a previously married woman?' I said: 'A previously married woman, O Messenger of Allah. 'Abdullah bin 'Arm died and left behind young druthers, and I did not like to bring to them someone who was like them, so I married a previously married woman who could teach the, and rise them with good manners.' So he gave me permission, and said to me; 'Go to When I arrived, I told my maternal uncle that I had sold the camel and he scolded me. When the Messenger of Allah came, I brought the camel to him, and he gave me the price of the camel, and the camel, and share (of the spoils of war) with the rest of the people.",
      "chain": [
        "11222",
        "36649",
        "20469",
        "11072",
        "11052",
        "34"
      ]
    }
  ],
  "total_hadiths": 6
}