{
  "id": "37",
  "name": "Abu al-Darda ( أبو الدرداء عويمر بن زيد بن قيس الأنصاري ( رضي الله عنه",
  "full_name": "Abu al-Darda ( أبو الدرداء عويمر بن زيد بن قيس الأنصاري ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medinah"
    },
    "death": {
      "date_hijri": "32",
      "date_gregorian": "653",
      "date_display": null,
      "place": "Syria",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina",
      "Syria"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ ع  -  صحابي ]",
      "Fiqh",
      "Governor"
    ],
    "tags": [
      "Ansar",
      "Khazraj",
      "B.al-Harith B.al-Khazraj",
      "Uhud"
    ]
  },
  "parents": [],
  "spouses": [
    {
      "id": "87",
      "name": "Umm al-Darda ( خيرة بنت أبي حدرد أم الدرداء ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "207",
      "name": "Mahabba bint ar-Rabi' ibn 'Amr ( محبة بنت الربيع بن عمرو بن أبي زهير ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "siblings": [],
  "children": [
    {
      "id": "18090",
      "name": "Bilal bin Abi al-Drda'a بلال بن أبي الدرداء الأنصاري",
      "grade": "Follower(Tabi') [2nd Generation]"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "49",
      "name": "Zayd ibn Thabit ( زيد بن ثابت بن الضحاك بن زيد ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "87",
      "name": "Umm al-Darda ( خيرة بنت أبي حدرد أم الدرداء ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "18090",
      "name": "Bilal bin Abi al-Drda'a بلال بن أبي الدرداء الأنصاري",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "1935",
      "name": "Fadala bin 'Ubaid bin Naqid ( فضالة بن عبيد بن نافذ ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "10878",
      "name": "Ma'dan bin Abi Talha معدان بن أبي طلحة ويقال بن طلحة",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11027",
      "name": "Abu Idrees al-Khulani أبو إدريس الخولاني",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11237",
      "name": "Abu Murrah, Client of Umm Hani يزيد أبو مرة مولى",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19237",
      "name": "Abu Habibh al-Ta'iy أبو حبيبة الطائي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11348",
      "name": "Sa'id bin Yahmad, Abu al-Safr سعيد بن يحمد أبو السفر الهمداني",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10567",
      "name": "Abu Salama bin 'Abdur Rahman أبو سلمة بن عبد الرحمن بن عوف",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "4097",
      "name": "Jubayr bin Nufayr al-Hadrami ( جبير بن نفير الحضرمي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11174",
      "name": "Suwayd bin Ghaflah bin Awsajah سويد بن غفلة بن عوسجة",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11341",
      "name": "Zayd bin Wahb al-Jhny زيد بن وهب الجهني",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "10920",
      "name": "Safwan bin 'Abdullah صفوان بن عبد الله بن صفوان بن أمية",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11017",
      "name": "'Alqama bin Qays علقمة بن قيس بن عبد الله",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "17054",
      "name": "Kathir bin Qays كثير بن قيس",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11002",
      "name": "Sa'id ibn al-Musayyib سعيد بن المسيب بن حزن أبو محمد القرشي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "19921",
      "name": "'Abdullah bin Qays, Abu Bahriyya عبد الله بن قيس الكندي أبو بحرية",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "19940",
      "name": "Kathir bin Marrah al-Hadrami كثير بن مرة الحضرمي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11035",
      "name": "Ibn Sirin محمد بن سيرين الأنصاري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11221",
      "name": "Muhammad bin Ka'b bin Sulaym al-Qarzi محمد بن كعب بن سليم بن أسد القرظي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10835",
      "name": "Hilal bin Yasaf هلال بن يساف",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1945",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا عبد الله بن يوسف، حدثنا يحيى بن حمزة، عن عبد الرحمن بن يزيد بن جابر، أن إسماعيل بن عبيد الله، حدثه عن أم الدرداء، عن أبي الدرداء  رضى الله عنه  قال خرجنا مع النبي صلى الله عليه وسلم في بعض أسفاره في يوم حار حتى يضع الرجل يده على رأسه من شدة الحر، وما فينا صائم إلا ما كان من النبي صلى الله عليه وسلم وابن رواحة‏.‏",
      "text_en": " Narrated Abu Ad-Darda:                     We set out with Allah's Apostle on one of his journeys on a very hot day, and it was so hot that one had to put his hand over his head because of the severity of heat. None of us was fasting except the Prophet and Ibn Rawaha.",
      "chain": [
        "30355",
        "20402",
        "20395",
        "11457",
        "37"
      ]
    },
    {
      "hadith_no": "3705",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثني هشام بن عمار، حدثنا صدقة بن خالد، حدثنا زيد بن واقد، عن بسر بن عبيد الله، عن عائذ الله أبي إدريس، عن أبي الدرداء  رضى الله عنه  قال كنت جالسا عند النبي صلى الله عليه وسلم إذ أقبل أبو بكر آخذا بطرف ثوبه حتى أبدى عن ركبته، فقال النبي صلى الله عليه وسلم ‏\"‏ أما صاحبكم فقد غامر ‏\"‏‏.‏ فسلم، وقال إني كان بيني وبين ابن الخطاب شىء فأسرعت إليه ثم ندمت، فسألته أن يغفر لي فأبى على، فأقبلت إليك فقال ‏\"‏ يغفر الله لك يا أبا بكر ‏\"‏‏.‏ ثلاثا، ثم إن عمر ندم فأتى منزل أبي بكر فسأل أثم أبو بكر فقالوا لا‏.‏ فأتى إلى النبي صلى الله عليه وسلم، فسلم فجعل وجه النبي صلى الله عليه وسلم يتمعر حتى أشفق أبو بكر، فجثا على ركبتيه فقال يا رسول الله، والله أنا كنت أظلم مرتين‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ إن الله بعثني إليكم فقلتم كذبت‏.‏ وقال أبو بكر صدق‏.‏ وواساني بنفسه وماله، فهل أنتم تاركو لي صاحبي ‏\"‏‏.‏ مرتين فما أوذي بعدها‏.‏",
      "text_en": " Narrated Abu Ad-Darda:                     While I was sitting with the Prophet, Abu Bakr came, lifting up one corner of h is garment uncovering h is knee. The Prophet said, \"Your companion has had a quarrel.\" Abu Bakr greeted (the Prophet ) and said, \"O Allah's Apostle! There was something (i.e. quarrel) between me and the Son of Al-Khattab. I talked to him harshly and then regretted that, and requested him to forgive me, but he refused. This is why I have come to you.\" The Prophet said thrice, \"O Abu Bakr! May Allah forgive you.\" In the meanwhile, `Umar regretted (his refusal of Abu Bakr's excuse) and went to Abu Bakr's house and asked if Abu Bakr was there. They replied in the negative. So he came to the Prophet and greeted him, but signs of displeasure appeared on the face of the Prophet till Abu Bakr pitied (`Umar), so he knelt and said twice, \"O Allah's Apostle! By Allah! I was more unjust to him (than he to me).\" The Prophet said, \"Allah sent me (as a Prophet) to you (people) but you said (to me), 'You are telling a lie,' while Abu Bakr said, 'He has said the truth,' and consoled me with himself and his money.\" He then said twice, \"Won't you then give up harming my companion?\" After that nobody harmed Abu Bakr.",
      "chain": [
        "30288",
        "20398",
        "11671",
        "11412",
        "37"
      ]
    },
    {
      "hadith_no": "6520",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "قال النضر أخبرنا شعبة، وحدثنا حبيب بن أبي ثابت، والأعمش، وعبد العزيز بن رفيع، حدثنا زيد بن وهب، بهذا‏.‏ قال أبو عبد الله حديث أبي صالح عن أبي الدرداء، مرسل، لا يصح، إنما أردنا للمعرفة، والصحيح حديث أبي ذر‏.‏ قيل لأبي عبد الله حديث عطاء بن يسار عن أبي الدرداء قال مرسل أيضا لا يصح، والصحيح حديث أبي ذر‏.‏ وقال اضربوا على حديث أبي الدرداء هذا‏.‏ إذا مات قال لا إله إلا الله‏.‏ عند الموت‏.‏",
      "text_en": "",
      "chain": [
        "20291",
        "20020",
        "11331",
        "11060",
        "11257",
        "11341",
        "30184",
        "37"
      ]
    },
    {
      "hadith_no": "1239",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن سلمة المرادي، حدثنا عبد الله بن وهب، عن معاوية بن صالح، يقول حدثني ربيعة بن يزيد، عن أبي إدريس الخولاني، عن أبي الدرداء، قال قام رسول الله صلى الله عليه وسلم فسمعناه يقول ‏\"‏ أعوذ بالله منك ‏\"‏ ‏.‏ ثم قال ‏\"‏ ألعنك بلعنة الله ‏\"‏ ‏.‏ ثلاثا ‏.‏ وبسط يده كأنه يتناول شيئا فلما فرغ من الصلاة قلنا يا رسول الله قد سمعناك تقول في الصلاة شيئا لم نسمعك تقوله قبل ذلك ورأيناك بسطت يدك ‏.‏ قال ‏\"‏ إن عدو الله إبليس جاء بشهاب من نار ليجعله في وجهي فقلت أعوذ بالله منك ‏.‏ ثلاث مرات ثم قلت ألعنك بلعنة الله التامة فلم يستأخر ثلاث مرات ثم أردت أخذه والله لولا دعوة أخينا سليمان لأصبح موثقا يلعب به ولدان أهل المدينة ‏\"‏ ‏.‏",
      "text_en": " Abu Darda' reported:                      Allah's Messenger (may peace be upon him) stood up (to pray) and we heard him say:\" I seek refuge in Allah from thee.\" Then said:\" curse thee with Allah's curse\" three times, then he stretched out his hand as though he was taking hold of something. When he finished the prayer, we said: Messenger of Allah, we heard you say something during the prayer which we have not heard you say before, and we saw you stretch out your hand. He replied: Allah's enemy Iblis came with a flame of fire to put it in my face, so I said three times:\" I Seek refuge in Allah from thee.\" Then I said three times:\" I curse thee with Allah's full curse.\" But he did not retreat (on any one of these) three occasions. Thereafter I meant to seize him. I swear by Allah that had it not been for the supplication of my brother Sulaiman he would have been bound, and made an object of sport for the children of Medina.",
      "chain": [
        "30491",
        "20029",
        "20675",
        "11414",
        "11027",
        "37"
      ]
    },
    {
      "hadith_no": "1708",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني هارون بن عبد الله، ومحمد بن رافع، قالا حدثنا ابن أبي فديك، عن الضحاك بن عثمان، عن إبراهيم بن عبد الله بن حنين، عن أبي مرة، مولى أم هانئ عن أبي الدرداء، قال أوصاني حبيبي صلى الله عليه وسلم بثلاث لن أدعهن ما عشت بصيام ثلاثة أيام من كل شهر وصلاة الضحى وبأن لا أنام حتى أوتر ‏.‏",
      "text_en": " Abu Murra, the freed slave of Umm Hani, narrated on the authority of Abu Darda':                      My Friend (may peace be upon him) instructed me in three (acts), and I would never abandon them as long as I live. (And these three things are): Three fasts during every month, the forenoon prayer, and this that I should not sleep till I have observed the Witr prayer.",
      "chain": [
        "30524",
        "30375",
        "20172",
        "20504",
        "11150",
        "11237",
        "37"
      ]
    },
    {
      "hadith_no": "1919",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا محمد بن المثنى، حدثنا معاذ بن هشام، حدثني أبي، عن قتادة، عن سالم، بن أبي الجعد الغطفاني عن معدان بن أبي طلحة اليعمري، عن أبي الدرداء، أن النبي صلى الله عليه وسلم قال ‏\"‏ من حفظ عشر آيات من أول سورة الكهف عصم من الدجال ‏\"‏",
      "text_en": " This hadith has been transmitted by Qatada with the same chain of transmitters. But Shu'ba (one of the narrators) said:                      At the end of Surah al-Kahf, but Hammam said: At the beginning of Surah al-Kahf.",
      "chain": [
        "30170",
        "20287",
        "20295",
        "11019",
        "10878",
        "37"
      ]
    },
    {
      "hadith_no": "1922",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني زهير بن حرب، ومحمد بن بشار، قال زهير حدثنا يحيى بن سعيد، عن شعبة، عن قتادة، عن سالم بن أبي الجعد، عن معدان بن أبي طلحة، عن أبي الدرداء، عن النبي صلى الله عليه وسلم قال ‏\"‏ أيعجز أحدكم أن يقرأ في ليلة ثلث القرآن ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated by Qatada with the same chain of transmitters in these words:                      He (the Apostle of Allah) said: Allah divided the Qur'an into three parts, and he made:\" Say: He, Allah is One.\" one part out of the (three) parts of the Qur'an.",
      "chain": [
        "30022",
        "30160",
        "20321",
        "11062",
        "20020",
        "11019",
        "11342",
        "10878",
        "37"
      ]
    },
    {
      "hadith_no": "2686",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا داود بن رشيد، حدثنا الوليد بن مسلم، عن سعيد بن عبد العزيز، عن إسماعيل، بن عبيد الله عن أم الدرداء، عن أبي الدرداء، - رضى الله عنه - قال خرجنا مع رسول الله صلى الله عليه وسلم في شهر رمضان في حر شديد حتى إن كان أحدنا ليضع يده على رأسه من شدة الحر وما فينا صائم إلا رسول الله صلى الله عليه وسلم وعبد الله بن رواحة ‏.‏",
      "text_en": " Abu Darda' (Allah be pleased with him) reported:                      We set out during the month of Ramadan with the Messenger of Allah (may peace be upon him) in such an intense heat that one of us would place his hand over his head (in order to protect himself) against the excessive heat, and none among us was observing the fast, except the Messenger of Allah (may peace be upon him) and 'Abdullah b. Rawaha.",
      "chain": [
        "30248",
        "20733",
        "20638",
        "11457",
        "37"
      ]
    },
    {
      "hadith_no": "3635",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثني محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، عن يزيد بن خمير، قال سمعت عبد الرحمن بن جبير، يحدث عن أبيه، عن أبي الدرداء، عن النبي صلى الله عليه وسلم أنه أتى بامرأة مجح على باب فسطاط فقال ‏\"‏ لعله يريد أن يلم بها ‏\"‏ ‏.‏ فقالوا نعم ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لقد هممت أن ألعنه لعنا يدخل معه قبره كيف يورثه وهو لا يحل له كيف يستخدمه وهو لا يحل له ‏\"‏ ‏.‏",
      "text_en": " Abu Darda' (Allah be pleased with him) related from the Prophet of Allah (may peace be upon him) that he came upon a woman who was in the advanced stage of pregnancy at the door of a tent. He (the Holy Prophet) said:                      Perhaps he (the man accompanying her) intends to cohabit with her. They said: Yes. Thereupon Allah's Messenger (may peace be upon him) said: I have decided to curse him with such a curse as may go along with him to his grave. How can he own him (the child to be born) and that is not lawful for him, and how can he take him as a servant for that is not lawful for him?",
      "chain": [
        "30170",
        "20173",
        "20020",
        "10981",
        "10865",
        "37"
      ]
    },
    {
      "hadith_no": "6777",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا معاوية بن هشام، عن هشام بن سعد، عن  زيد بن أسلم، وأبي، حازم عن أم الدرداء، عن أبي الدرداء، سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن اللعانين لا يكونون شهداء ولا شفعاء يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " Umm Darda' reported on the authority of Abu Darda' as saying:                      I heard Allah's Messenger (may peace be upon him) as saying: The invoker of curse would neither be witness nor intercessor on the Day of Resurrection.",
      "chain": [
        "30201",
        "20609",
        "20519",
        "11163",
        "11172",
        "11457",
        "37"
      ]
    },
    {
      "hadith_no": "7103",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثني أحمد بن عمر بن حفص الوكيعي، حدثنا محمد بن فضيل، حدثنا أبي، عن  طلحة بن عبيد الله بن كريز، عن أم الدرداء، عن أبي الدرداء، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما من عبد مسلم يدعو لأخيه بظهر الغيب إلا قال الملك ولك بمثل ‏\"‏ ‏.‏",
      "text_en": " Abu Dharr reported that Allah's Messenger (may peace be upon him) said:                      There is no believing servant who supplicates for his brother behind his back (in his absence) that the Angels do not say: The same be for you too.",
      "chain": [
        "20356",
        "20349",
        "18679",
        "11457",
        "37"
      ]
    },
    {
      "hadith_no": "429",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن عبد الرحمن العنبري، حدثنا أبو علي الحنفي، عبيد الله بن عبد المجيد حدثنا عمران القطان، حدثنا قتادة، وأبان، كلاهما عن خليد العصري، عن أم الدرداء، عن أبي الدرداء، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ خمس من جاء بهن مع إيمان دخل الجنة من حافظ على الصلوات الخمس على وضوئهن وركوعهن وسجودهن ومواقيتهن وصام رمضان وحج البيت إن استطاع إليه سبيلا وأعطى الزكاة طيبة بها نفسه وأدى الأمانة ‏\"‏ ‏.‏ قالوا يا أبا الدرداء وما أداء الأمانة قال الغسل من الجنابة ‏.‏",
      "text_en": " Abu al-Darda' reported the Messenger of Allah (ﷺ) as saying:                      There are five thing, if anyone observe them with faith, he will enter Paradise. He who prays the five times prayer regularly, with the ablution for them, with their bowing, with their prostration and their (right) times ; keeps fast during Ramadan ; performs Hajj (pilgrimage) to the House (Ka'bah), provided he has the ability for its passage; pays Zakat happily ; and fulfills the trust (he will enter Paradise). People said: Abu al-Darda', what is fulfilling the trust ? He replied: Washing because of sexual defilement.",
      "chain": [
        "34217",
        "20260",
        "20718",
        "11019",
        "20577",
        "11457",
        "37"
      ]
    },
    {
      "hadith_no": "547",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زائدة، حدثنا السائب بن حبيش، عن معدان بن أبي طلحة اليعمري، عن أبي الدرداء، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ما من ثلاثة في قرية ولا بدو لا تقام فيهم الصلاة إلا قد استحوذ عليهم الشيطان فعليك بالجماعة فإنما يأكل الذئب القاصية ‏\"‏ ‏.‏ قال زائدة قال السائب يعني بالجماعة الصلاة في الجماعة ‏.‏",
      "text_en": " Narrated AbudDarda':                     I heard the Messenger of Allah (ﷺ) say: If there are three men in a village or in the desert among whom prayer is not offered (in congregation), the devil has got the mastery over them. So observe (prayer) in congregation), for the wolf eats only the straggling animal. Sa'ib said: By the word Jama'ah he meant saying prayer in company or in congregation.",
      "chain": [
        "30184",
        "20320",
        "18336",
        "10878",
        "37"
      ]
    },
    {
      "hadith_no": "1433",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الوهاب بن نجدة، حدثنا أبو اليمان، عن صفوان بن عمرو، عن أبي إدريس السكوني، عن جبير بن نفير، عن أبي الدرداء، قال ‏\"‏ أوصاني خليلي صلى الله عليه وسلم بثلاث لا أدعهن لشىء أوصاني بصيام ثلاثة أيام من كل شهر ولا أنام إلا على وتر وبسبحة الضحى في الحضر والسفر ‏.‏",
      "text_en": " Abu Al-Darda' said:                      My friend (i.e. \tthe Prophet) instructed me to observe three practices which I never leave: he instructed me to fast three days every month, and not to sleep but after observing the with, and to observe supererogatory prayer in the forenoon while traveling and while resident.",
      "chain": [
        "38363",
        "30330",
        "10921",
        "19204",
        "4097",
        "37"
      ]
    },
    {
      "hadith_no": "2156",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا النفيلي، حدثنا مسكين، حدثنا شعبة، عن يزيد بن خمير، عن عبد الرحمن بن جبير بن نفير، عن أبيه، عن أبي الدرداء، أن رسول الله صلى الله عليه وسلم كان في غزوة فرأى امرأة مجحا فقال ‏\"‏ لعل صاحبها ألم بها ‏\"‏ ‏.‏ قالوا نعم ‏.‏ فقال ‏\"‏ لقد هممت أن ألعنه لعنة تدخل معه في قبره كيف يورثه وهو لا يحل له وكيف يستخدمه وهو لا يحل له ‏\"‏ ‏.‏",
      "text_en": " Abu Al Darda said “The Apostle of Allaah(ﷺ) was in a battle. He saw a woman who was nearing the time when she was to deliver a child. “He said “Perhaps the master has intercourse with her.”. They(the people) said “Yes”. He said “I am inclined to invoke a curse on him which will enter his grave with him. How can he make it (the child) an heir when it is not lawful for him? How can he take it into his service when that is not lawful for him?”",
      "chain": [
        "30352",
        "20463",
        "20020",
        "10981",
        "10942",
        "37"
      ]
    },
    {
      "hadith_no": "2409",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا مؤمل بن الفضل، حدثنا الوليد، حدثنا سعيد بن عبد العزيز، حدثني إسماعيل بن عبيد الله، حدثتني أم الدرداء، عن أبي الدرداء، قال خرجنا مع رسول الله صلى الله عليه وسلم في بعض غزواته في حر شديد حتى إن أحدنا ليضع يده على رأسه أو كفه على رأسه من شدة الحر ما فينا صائم إلا رسول الله صلى الله عليه وسلم وعبد الله بن رواحة ‏.‏",
      "text_en": " Narrated Abu al-Darda:                     We went out along with the Messenger of Allah (ﷺ) for some battle in intense heat, so much so that one of us placed his hand on his head, or placed his palm on his head, due to intense heat, No one of us fasted except the Messenger of Allah (ﷺ) and 'Abd Allah b. Rawahah.",
      "chain": [
        "38659",
        "20733",
        "20638",
        "11457",
        "37"
      ]
    },
    {
      "hadith_no": "3642",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Knowledge (Kitab Al-Ilm) - كتاب العلم",
      "chapter_no": "26",
      "text_ar": "حدثنا محمد بن الوزير الدمشقي، حدثنا الوليد، قال لقيت شبيب بن شيبة فحدثني به، عن عثمان بن أبي سودة، عن أبي الدرداء، - يعني عن النبي صلى الله عليه وسلم - بمعناه ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Abu al-Darda through a different chain of narrators to the same effect from the Holy Prophet(ﷺ)",
      "chain": [
        "20733",
        "18710",
        "37"
      ]
    },
    {
      "hadith_no": "3874",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Medicine (Kitab Al-Tibb) - كتاب الطب",
      "chapter_no": "29",
      "text_ar": "حدثنا محمد بن عبادة الواسطي، حدثنا يزيد بن هارون، أخبرنا إسماعيل بن عياش، عن ثعلبة بن مسلم، عن أبي عمران الأنصاري، عن أم الدرداء، عن أبي الدرداء، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله أنزل الداء والدواء وجعل لكل داء دواء فتداووا ولا تداووا بحرام ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu al-Darda:                     The Prophet (ﷺ) said: Allah has sent down both the disease and the cure, and He has appointed a cure for every disease, so treat yourselves medically, but use nothing unlawful.",
      "chain": [
        "30378",
        "20472",
        "20736",
        "17010",
        "17096",
        "11457",
        "37"
      ]
    },
    {
      "hadith_no": "3892",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Medicine (Kitab Al-Tibb) - كتاب الطب",
      "chapter_no": "29",
      "text_ar": "حدثنا يزيد بن خالد بن موهب الرملي، حدثنا الليث، عن زياد بن محمد، عن محمد بن كعب القرظي، عن فضالة بن عبيد، عن أبي الدرداء، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من اشتكى منكم شيئا أو اشتكاه أخ له فليقل ربنا الله الذي في السماء تقدس اسمك أمرك في السماء والأرض كما رحمتك في السماء فاجعل رحمتك في الأرض اغفر لنا حوبنا وخطايانا أنت رب الطيبين أنزل رحمة من رحمتك وشفاء من شفائك على هذا الوجع فيبرأ ‏\"‏ ‏.‏",
      "text_en": " Narrated AbudDarda':                     I heard the Messenger of Allah (ﷺ) say: If any of you is suffering from anything or his brother is suffering, he should say: Our Lord is Allah Who is in the heaven, holy is Thy name, Thy command reigns supreme in the heaven and the earth, as Thy mercy in the heaven, make Thy mercy  in the earth; forgive us our sins, and our errors; Thou art the Lord of good men; send down mercy from Thy mercy, and remedy, and remedy from Thy remedy on this pain so that it is healed up.",
      "chain": [
        "38715",
        "20023",
        "11221",
        "1935",
        "37"
      ]
    },
    {
      "hadith_no": "3968",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book of Manumission of Slaves - كتاب العتق",
      "chapter_no": "31",
      "text_ar": "حدثنا محمد بن كثير، حدثنا سفيان، عن أبي إسحاق، عن أبي حبيبة الطائي، عن أبي الدرداء، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ مثل الذي يعتق عند الموت كمثل الذي يهدي إذا شبع ‏\"‏ ‏.‏",
      "text_en": " Narrated AbudDarda':                     The Prophet (ﷺ) said: the similitude of a man who emancipates a slave at the time of his death is like that of a man who gives a present after satisfying his appetite.",
      "chain": [
        "28531",
        "20012",
        "11049",
        "37"
      ]
    },
    {
      "hadith_no": "4298",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا هشام بن عمار، حدثنا يحيى بن حمزة، حدثنا ابن جابر، حدثني زيد بن أرطاة، قال سمعت جبير بن نفير، يحدث عن أبي الدرداء، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن فسطاط المسلمين يوم الملحمة بالغوطة إلى جانب مدينة يقال لها دمشق من خير مدائن الشام ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu al-Darda':                     The Prophet (ﷺ) said: The place of assembly of the Muslims at the time of the war will be in al-Ghutah near a city called Damascus, one of the best cities in Syria.",
      "chain": [
        "30288",
        "20402",
        "17510",
        "4097",
        "37"
      ]
    },
    {
      "hadith_no": "4799",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أبو الوليد الطيالسي، وحفص بن عمر، قالا حدثنا ح، وحدثنا ابن كثير، أخبرنا شعبة، عن القاسم بن أبي بزة، عن عطاء الكيخاراني، عن أم الدرداء، عن أبي الدرداء، عن النبي صلى الله عليه وسلم قال ‏\"‏ ما من شىء أثقل في الميزان من حسن الخلق ‏\"‏ ‏.‏ قال أبو الوليد قال سمعت عطاء الكيخاراني ‏.‏ قال أبو داود وهو عطاء بن يعقوب وهو خال إبراهيم بن نافع يقال كيخاراني وكوخاراني ‏.‏",
      "text_en": " Narrated AbudDarda':                     The Prophet (ﷺ) said: There is nothing heavier than good character put in the scale of a believer on the Day of Resurrection.Abu al-Walid said: I heard 'Ata al-Kaikharani say: Abu Dawud said: His name is 'Ata b. Ya'qub. He is the maternal uncle of Ibrahim b. Nafi'. He is called Kaikharani or Kukharani.",
      "chain": [
        "20296",
        "30329",
        "30169",
        "20020",
        "11261",
        "11457",
        "37"
      ]
    },
    {
      "hadith_no": "4919",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا أبو معاوية، عن الأعمش، عن عمرو بن مرة، عن سالم، عن أم الدرداء، عن أبي الدرداء، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ألا أخبركم بأفضل من درجة الصيام والصلاة والصدقة ‏\"‏ ‏.‏ قالوا بلى ‏.‏ قال ‏\"‏ إصلاح ذات البين وفساد ذات البين الحالقة ‏\"‏ ‏.‏",
      "text_en": " Narrated AbudDarda':                     The Prophet (ﷺ) said: Shall I not inform you of something more excellent in degree than fasting, prayer and almsgiving (sadaqah)? The people replied: Yes, Prophet of Allah! He said: It is putting things right between people, spoiling them is the shaver (destructive).",
      "chain": [
        "30216",
        "20354",
        "11060",
        "11381",
        "11011",
        "11457",
        "37"
      ]
    },
    {
      "hadith_no": "4948",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا عمرو بن عون، قال أخبرنا ح، وحدثنا مسدد، قال حدثنا هشيم، عن داود بن عمرو، عن عبد الله بن أبي زكرياء، عن أبي الدرداء، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إنكم تدعون يوم القيامة بأسمائكم وأسماء آبائكم فأحسنوا أسماءكم ‏\"‏ ‏.‏ قال أبو داود ابن أبي زكرياء لم يدرك أبا الدرداء ‏.‏",
      "text_en": " Narrated AbudDarda':                     The Prophet (ﷺ) said: On the Day of Resurrection you will be called by your names and by your father's names, so give yourselves good names.",
      "chain": [
        "30154",
        "30175",
        "20468",
        "30504",
        "37"
      ]
    },
    {
      "hadith_no": "5081",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا يزيد بن محمد الدمشقي، حدثنا عبد الرزاق بن مسلم الدمشقي، - وكان من ثقات المسلمين من المتعبدين - قال حدثنا مدرك بن سعد - قال يزيد شيخ ثقة - عن يونس بن ميسرة بن حلبس عن أم الدرداء عن أبي الدرداء رضى الله عنه قال من قال إذا أصبح وإذا أمسى حسبي الله لا إله إلا هو عليه توكلت وهو رب العرش العظيم سبع مرات كفاه الله ما أهمه صادقا كان بها أو كاذبا ‏.‏",
      "text_en": " Abu al-Darda’ said:                      if anyone says seven times morning and evening; “Allah sufficeth me: there is no god but He; on him is my trust- he, the Lord of the Throne (of glory) Supreme”, Allah will be sufficient for him against anything which grieves him, whether he is true or false in (repeating) them.",
      "chain": [
        "19201",
        "11457",
        "37"
      ]
    },
    {
      "hadith_no": "5130",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا حيوة بن شريح، حدثنا بقية، عن أبي بكر بن أبي مريم، عن خالد بن محمد الثقفي، عن بلال بن أبي الدرداء، عن أبي الدرداء، عن النبي صلى الله عليه وسلم قال ‏\"‏ حبك الشىء يعمي ويصم ‏\"‏ ‏.‏",
      "text_en": " Narrated AbudDarda':                     The Prophet (ﷺ) said: Your love for a thing causes blindness and deafness.",
      "chain": [
        "26010",
        "20644",
        "27053",
        "17505",
        "18090",
        "37"
      ]
    },
    {
      "hadith_no": "475",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Al-Witr - أَبْوَابُ الْوِتْرِ",
      "chapter_no": "3",
      "text_ar": "حدثنا أبو جعفر السمناني، حدثنا أبو مسهر، حدثنا إسماعيل بن عياش، عن بحير بن سعد، عن خالد بن معدان، عن جبير بن نفير، عن أبي الدرداء، وأبي، ذر عن رسول الله صلى الله عليه وسلم ‏\"‏ عن الله، عز وجل أنه قال ابن آدم اركع لي من أول النهار أربع ركعات أكفك آخره ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Jubair narrated from Abu Ad-Darda, or Abu Dharr, that :                     Allah's Messenger narrated that Allah, Blessed and Most High said: \"Son of Adam: Perform four Rak'ah for Me in the beginning of the day it will suffice you for the latter part of it.\"",
      "chain": [
        "30284",
        "20736",
        "11422",
        "4097",
        "37",
        "23"
      ]
    },
    {
      "hadith_no": "568",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Traveling - أَبْوَابُ السَّفَرِ",
      "chapter_no": "6",
      "text_ar": "حدثنا سفيان بن وكيع، حدثنا عبد الله بن وهب، عن عمرو بن الحارث، عن سعيد بن أبي هلال، عن عمر الدمشقي، عن أم الدرداء، عن أبي الدرداء، قال سجدت مع رسول الله صلى الله عليه وسلم إحدى عشرة سجدة منها التي في النجم ‏.‏",
      "text_en": " Abu Ad-Darda narrated:                     \"I performed eleven prostrations (of recitation) with the Messenger of Allah, among them was that which is in Surat An-Najm.\"",
      "chain": [
        "35047",
        "20029",
        "20377",
        "11169",
        "11457",
        "37"
      ]
    },
    {
      "hadith_no": "569",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Traveling - أَبْوَابُ السَّفَرِ",
      "chapter_no": "6",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن، أخبرنا عبد الله بن صالح، حدثنا الليث بن سعد، عن خالد بن يزيد، عن سعيد بن أبي هلال، عن عمر، وهو ابن حيان الدمشقي قال سمعت مخبرا، يخبر عن أم الدرداء، عن أبي الدرداء، عن النبي صلى الله عليه وسلم نحوه بلفظه ‏.‏ قال أبو عيسى وهذا أصح من حديث سفيان بن وكيع عن عبد الله بن وهب ‏.‏ قال وفي الباب عن علي وابن عباس وأبي هريرة وابن مسعود وزيد بن ثابت وعمرو بن العاص ‏.‏ قال أبو عيسى حديث أبي الدرداء حديث غريب لا نعرفه إلا من حديث سعيد بن أبي هلال عن عمر الدمشقي ‏.‏",
      "text_en": " (Another chain in which) Abu Ad-Darda narrated:                     \"I performed eleven prostrations with the Messenger of Allah, among them was that which is in Surat An-Najm.\"",
      "chain": [
        "30025",
        "20023",
        "11408",
        "11169",
        "3",
        "11457",
        "37"
      ]
    },
    {
      "hadith_no": "1473",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hunting - كتاب الصيد والذبائح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "18",
      "text_ar": "حدثنا أبو كريب، حدثنا عبد الرحيم بن سليمان، عن أبي أيوب الأفريقي، عن صفوان بن سليم، عن سعيد بن المسيب، عن أبي الدرداء، قال نهى رسول الله صلى الله عليه وسلم عن أكل المجثمة وهي التي تصبر بالنبل ‏.‏ قال وفي الباب عن عرباض بن سارية وأنس وابن عمر وابن عباس وجابر وأبي هريرة ‏.‏ قال أبو عيسى حديث أبي الدرداء حديث غريب ‏.‏",
      "text_en": " Narrated Abu Ad-Darda':                     \"The Messenger of Allah (ﷺ) prohibited eating the Mujath-thamah, and it is what is trapped and killed by arrows.\"",
      "chain": [
        "30216",
        "20334",
        "11177",
        "11002",
        "37"
      ]
    },
    {
      "hadith_no": "1702",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jihad - كتاب الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "23",
      "text_ar": "حدثنا أحمد بن محمد بن موسى، حدثنا عبد الله بن المبارك، قال أخبرنا عبد الرحمن بن يزيد بن جابر، حدثنا زيد بن أرطاة، عن جبير بن نفير، عن أبي الدرداء، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ ابغوني ضعفاءكم فإنما ترزقون وتنصرون بضعفائكم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Abu Ad-Darda':                     That he heard the Prophet (ﷺ) saying: \"Seek your weak for me. For indeed you sustenance and aid is only by your weak.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.",
      "chain": [
        "30304",
        "20025",
        "20395",
        "17510",
        "4097",
        "37"
      ]
    },
    {
      "hadith_no": "2022",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان بن عيينة، عن عطاء بن السائب الهجيمي، عن أبي عبد الرحمن السلمي، عن أبي الدرداء، أن رجلا، أتاه فقال إن لي امرأة وإن أمي تأمرني بطلاقها ‏.‏ قال أبو الدرداء سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ الوالد أوسط أبواب الجنة فإن شئت فأضع ذلك الباب أو احفظه ‏\"‏ ‏.‏ قال وقال ابن أبي عمر وربما قال سفيان إن أمي وربما قال أبي ‏.‏ وهذا حديث صحيح ‏.‏ وأبو عبد الرحمن السلمي اسمه عبد الله بن حبيب ‏.‏",
      "text_en": " Abu 'Abdur-Rahman As-Sulami  narrated from Abu Ad Darda'.:                     He said that a man came and said : \"I have a wife whom my mother has ordered me to divorce.\" So Abu Ad-Darda said: \" I heard the Messenger of Allah saying: 'The father is the middle gate to Paradise. So if you wish, then neglect that door, or protect it.'\"",
      "chain": [
        "30421",
        "20005",
        "11068",
        "11359",
        "37"
      ]
    },
    {
      "hadith_no": "2056",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا أحمد بن محمد، أخبرنا عبد الله بن المبارك، عن أبي بكر النهشلي، عن مرزوق أبي بكر التيمي، عن أم الدرداء، عن أبي الدرداء، عن النبي صلى الله عليه وسلم قال ‏\"‏ من رد عن عرض أخيه رد الله عن وجهه النار يوم القيامة ‏\"‏ ‏.‏ قال وفي الباب عن أسماء بنت يزيد ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏",
      "text_en": " Abu Ad-Darda narrated that the Messenger of Allah said:                     \"Whoever protects his brother's honor, Allah protects his face from the Fire on the Day of Resurrection.\"",
      "chain": [
        "30304",
        "20025",
        "20619",
        "11457",
        "37"
      ]
    },
    {
      "hadith_no": "2133",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان، حدثنا عمرو بن دينار، عن ابن أبي مليكة، عن يعلى بن مملك، عن أم الدرداء، عن أبي الدرداء، أن النبي صلى الله عليه وسلم قال ‏\"‏ ما شيء أثقل في ميزان المؤمن يوم القيامة من خلق حسن وإن الله ليبغض الفاحش البذيء ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن عائشة وأبي هريرة وأنس وأسامة بن شريك ‏.‏ وهذا حديث حسن صحيح ‏.‏",
      "text_en": " Abu Ad-Dardh narrated that the Messenger of Allah said:                     \"Nothing is heavier on the believer's Scale on the Day of Judgment than good character. For indeed Allah, Most High, is angered by the shameless obscene person.\"",
      "chain": [
        "30421",
        "20005",
        "11081",
        "11090",
        "11457",
        "37"
      ]
    },
    {
      "hadith_no": "2134",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا أبو كريب، حدثنا قبيصة بن الليث الكوفي، عن مطرف، عن عطاء، عن أم الدرداء، عن أبي الدرداء، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ ما من شيء يوضع في الميزان أثقل من حسن الخلق وإن صاحب حسن الخلق ليبلغ به درجة صاحب الصوم والصلاة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب من هذا الوجه ‏.‏",
      "text_en": " Abu Ad-Dardh narrated that the Messenger of Allah said:                     \"Nothing is placed on the Scale that is heavier than good character. Indeed the person with good character will have attained the rank of the person of fasting and prayer.\"",
      "chain": [
        "30216",
        "11395",
        "11029",
        "11457",
        "37"
      ]
    },
    {
      "hadith_no": "2145",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان بن عيينة، عن عمرو بن دينار، عن ابن أبي مليكة، عن يعلى بن مملك، عن أم الدرداء، عن أبي الدرداء، عن النبي صلى الله عليه وسلم قال ‏\"‏ من أعطي حظه من الرفق فقد أعطي حظه من الخير ومن حرم حظه من الرفق فقد حرم حظه من الخير ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن عائشة وجرير بن عبد الله وأبي هريرة ‏.‏ وهذا حديث حسن صحيح ‏.‏",
      "text_en": " Abu Ad-Darda narrated that the Messenger of Allah said:                     \"Whoever was given his share of gentleness, then he has been given a share of good. And whoever has been prevented from his share of gentleness, then he has been prevented from his share of good.\"",
      "chain": [
        "30421",
        "20005",
        "11081",
        "11090",
        "11457",
        "37"
      ]
    },
    {
      "hadith_no": "2698",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا هناد، حدثنا أبو معاوية، عن الأعمش، عن عمرو بن مرة، عن سالم بن أبي الجعد، عن أم الدرداء، عن أبي الدرداء، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ألا أخبركم بأفضل من درجة الصيام والصلاة والصدقة ‏\"‏ ‏.‏ قالوا بلى ‏.‏ قال ‏\"‏ صلاح ذات البين فإن فساد ذات البين هي الحالقة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث صحيح ‏.‏ ويروى عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ هي الحالقة لا أقول تحلق الشعر ولكن تحلق الدين ‏\"‏ ‏.‏",
      "text_en": " Abu Ad-Darda' narrated that the Messenger of Allah (s.a.w) said:                     \"Shall I not inform you of what is more virtuous than the rank of fasting, Salat, and charity?\" They said: \"But of course!\" He said: \"Making peace between each other. For indeed spoiling relations with each other is the Haliqah.\"",
      "chain": [
        "30480",
        "20354",
        "11060",
        "11381",
        "11342",
        "11457",
        "37"
      ]
    },
    {
      "hadith_no": "2789",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on the Description of Hellfire - كتاب صفة جهنم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "39",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن، أخبرنا عاصم بن يوسف، حدثنا قطبة بن عبد العزيز، عن الأعمش، عن شمر بن عطية، عن شهر بن حوشب، عن أم الدرداء، عن أبي الدرداء، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يلقى على أهل النار الجوع فيعدل ما هم فيه من العذاب فيستغيثون فيغاثون بطعام من ضريع لا يسمن ولا يغني من جوع فيستغيثون بالطعام فيغاثون بطعام ذي غصة فيذكرون أنهم كانوا يجيزون الغصص في الدنيا بالشراب فيستغيثون بالشراب فيرفع إليهم الحميم بكلاليب الحديد فإذا دنت من وجوههم شوت وجوههم فإذا دخلت بطونهم قطعت ما في بطونهم فيقولون ادعوا خزنة جهنم فيقولون ألم تك تأتيكم رسلكم بالبينات قالوا بلى ‏.‏ قالوا فادعوا وما دعاء الكافرين إلا في ضلال ‏.‏ قال فيقولون ادعوا مالكا فيقولون‏:‏ ‏(‏يا مالك ليقض علينا ربك ‏)‏ قال فيجيبهم‏:‏ ‏(‏إنكم ماكثون ‏)‏ ‏\"‏ ‏.‏ قال الأعمش نبئت أن بين دعائهم وبين إجابة مالك إياهم ألف عام ‏.‏ قال ‏\"‏ فيقولون ادعوا ربكم فلا أحد خير من ربكم فيقولون‏:‏ ‏(‏ربنا غلبت علينا شقوتنا وكنا قوما ضالين * ربنا أخرجنا منها فإن عدنا فإنا ظالمون ‏)‏ قال فيجيبهم‏:‏ ‏(‏اخسؤوا فيها ولا تكلمون ‏)‏ قال فعند ذلك يئسوا من كل خير وعند ذلك يأخذون في الزفير والحسرة والويل ‏\"‏ ‏.‏ قال عبد الله بن عبد الرحمن والناس لا يرفعون هذا الحديث ‏.‏ قال أبو عيسى إنما نعرف هذا الحديث عن الأعمش عن شمر بن عطية عن شهر بن حوشب عن أم الدرداء عن أبي الدرداء قوله وليس بمرفوع ‏.‏ وقطبة بن عبد العزيز هو ثقة عند أهل الحديث ‏.‏",
      "text_en": " Abu Ad-Darda' narrated that the Messenger of Allah (s.a.w) said:                     \"The inhabitants of the Fire will suffer from a hunger equal to the punishment they experience, so they will seek relief, and be given to eat of Dari; which will neither nourish nor avail against hunger. So they will (again) seek food to relieve (their hunger), and they will be given to eat of a food that causes one to choke. Then they will remember that they used remedy for choking in the world by drinking something. So they will seek relief from drink. Then they will be given Hamim with meat hooks, so when it comes toward their faces it melts their faces, and when it enters their insides it cuts up what is inside of them. So (some of them) say: 'Call the keepers of Hell' so they say: Did there not come to you your Messengers with clear signs? They say: 'Yes!' They say: 'Then call as you like.' And the invocation of the disbelievers is nothing but in vain.\" He said: \"They will say: 'Call Malik.' So they say: O Malik! Let your Lord make an end of us!'\" He said: \"So he answers them: Verily you shall abide forever. Al-A'mash said: \"I was informed that there is a thousand years between their calling him, and Malik's answering  them.\" He said: \"They say: 'Call your Lord, for there is none better than  your Lord.' So they will say: Our Lord! Our wretchedness over came us, and we were (an) erring people. Our Lord! Bring us out of this. If we ever return (to evil), indeed   we shall be wrong doers.\"He said: \"So the reply to them is: You remain in it in ignominy! And do not speak to Me.\" He said: \"So with that, they loose hope of any good, and with that they are taken to moaning, despair and severe ruin.\"",
      "chain": [
        "30025",
        "30198",
        "20599",
        "11060",
        "15238",
        "11044",
        "11457",
        "37"
      ]
    },
    {
      "hadith_no": "2653",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Knowledge - كتاب العلم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "41",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن، أخبرنا عبد الله بن صالح، حدثني معاوية بن صالح، عن عبد الرحمن بن جبير بن نفير، عن أبيه، جبير بن نفير عن أبي الدرداء، قال كنا مع رسول الله صلى الله عليه وسلم فشخص ببصره إلى السماء ثم قال ‏\"‏ هذا أوان يختلس العلم من الناس حتى لا يقدروا منه على شيء ‏\"‏ ‏.‏ فقال زياد بن لبيد الأنصاري كيف يختلس منا وقد قرأنا القرآن فوالله لنقرأنه ولنقرئنه نساءنا وأبناءنا ‏.‏ فقال ‏\"‏ ثكلتك أمك يا زياد إن كنت لأعدك من فقهاء أهل المدينة هذه التوراة والإنجيل عند اليهود والنصارى فماذا تغني عنهم ‏\"‏ ‏.‏ قال جبير فلقيت عبادة بن الصامت قلت ألا تسمع إلى ما يقول أخوك أبو الدرداء فأخبرته بالذي قال أبو الدرداء قال صدق أبو الدرداء إن شئت لأحدثنك بأول علم يرفع من الناس الخشوع يوشك أن تدخل مسجد جماعة فلا ترى فيه رجلا خاشعا ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ ومعاوية بن صالح ثقة عند أهل الحديث ولا نعلم أحدا تكلم فيه غير يحيى بن سعيد القطان وقد روي عن معاوية بن صالح نحو هذا ‏.‏ وروى بعضهم هذا الحديث عن عبد الرحمن بن جبير بن نفير عن أبيه عن عوف بن مالك عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Jubair bin Nufair:                     from Abu Ad-Darda who said: \"We were with the Prophet (ﷺ) when he raised his sight to the sky, then he said: 'This is the time when knowledge is to be taken from the people, until what remains of it shall not amount to anything.\" So Ziyad bin Labid Al-Ansari said: 'How will it be taken from us while we recite the Qur'an. By Allah we recite it, and our women and children recite it?' He (ﷺ) said: 'May you be bereaved of your mother O Ziyad! I used to consider you among the Fuqaha of the people of Al-Madinah. The Tawrah and Injil are with the Jews and Christians, but what do they avail of them?'\" Jubair said: \"So I met 'Ubadah bin As-Samit and said to him: 'Have you not heard what your brother Abu Ad-Darda said?' Then I informed him of what Abu Ad-Darda said. He said: 'Abu Ad-Darda spoke the truth. If you wish, we shall narrated to you about the first knowledge to be removed from the people: It is Khushu', soon you will enter the congregational Masjid, but not see any man in it with Khushu'.'\"",
      "chain": [
        "30025",
        "20675",
        "10942",
        "37"
      ]
    },
    {
      "hadith_no": "3127",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on The Virtues of the Qur'an - كتاب فضائل القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن قتادة، عن سالم بن أبي الجعد، عن معدان بن أبي طلحة، عن أبي الدرداء، عن النبي صلى الله عليه وسلم قال ‏\"‏ من قرأ ثلاث آيات من أول الكهف عصم من فتنة الدجال ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Ad-Darda:                     that the Prophet (ﷺ) said: \"Whoever recites three Ayat from the beginning of Al-Kahf he is protected from the turmoil of the Dajjal.\"",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11019",
        "11342",
        "10878",
        "37"
      ]
    },
    {
      "hadith_no": "3391",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا أحمد بن عبدة الضبي، حدثنا حماد بن زيد، عن عاصم بن بهدلة، عن أبي صالح، عن أبي الدرداء، عن النبي صلى الله عليه وسلم نحوه وليس فيه عن عطاء بن يسار ‏.‏ قال وفي الباب عن عبادة بن الصامت ‏.‏",
      "text_en": "",
      "chain": [
        "30423",
        "20022",
        "11358",
        "11161",
        "37"
      ]
    },
    {
      "hadith_no": "3445",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا جعفر بن محمد بن فضيل الجزري، وغير، واحد، قالوا حدثنا صفوان بن صالح، حدثنا الوليد بن مسلم، عن يزيد بن يوسف الصنعاني، عن مكحول، عن أم الدرداء، عن أبي الدرداء، عن النبي صلى الله عليه وسلم في قوله ‏:‏ ‏(‏ وكان تحته كنز لهما ‏)‏ قال ‏\"‏ ذهب وفضة ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Ad-Darda:                     that regarding Allah's saying: And there was under it a treasure belonging to them (18:82) - the Prophet (ﷺ) said: \"Gold and silver.\"",
      "chain": [
        "10898",
        "37511",
        "20733",
        "28648",
        "11066",
        "11457",
        "37"
      ]
    },
    {
      "hadith_no": "3490",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا أبو كريب، حدثنا محمد بن فضيل، عن محمد بن سعد الأنصاري، عن عبد الله بن ربيعة الدمشقي، حدثنا عائذ الله أبو إدريس الخولاني، عن أبي الدرداء، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ كان من دعاء داود يقول اللهم إني أسألك حبك وحب من يحبك والعمل الذي يبلغني حبك اللهم اجعل حبك أحب إلى من نفسي وأهلي ومن الماء البارد ‏\"‏ ‏.‏ قال وكان رسول الله صلى الله عليه وسلم إذا ذكر داود يحدث عنه قال ‏\"‏ كان أعبد البشر ‏\"‏ ‏.‏ قال هذا حديث حسن غريب ‏.‏",
      "text_en": " Abu Ad-Darda narrated that :                     the Messenger of Allah said: “It used to be from the supplication of Dawud that he would say: ‘O Allah, indeed, I ask You for Your love and the love of those who love You, and for the action that will cause me to attain Your love, O Allah, make You love more beloved to me than myself, my family and cold water (Allahumma Inni-As’aluka Hubbaka Wa Hubba Man Yuhibbuka Wal-Amalalladhi Yuballighuni Hubbak. Allahummaj’al Hubbaka Ahabba Ilaiya  Min Nafsi, Wa Ahli Wa Minal-Ma’il-Barid)He said: “And when the Prophet would mention Dawud, he would narrate about him, saying: “He was the best in worship out of all men.”",
      "chain": [
        "30216",
        "20356",
        "30008",
        "37"
      ]
    },
    {
      "hadith_no": "923",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرني هارون بن عبد الله، قال حدثنا زيد بن الحباب، قال حدثنا معاوية بن صالح، قال حدثني أبو الزاهرية، قال حدثني كثير بن مرة الحضرمي، عن أبي الدرداء، سمعه يقول سئل رسول الله صلى الله عليه وسلم أفي كل صلاة قراءة قال ‏\"‏ نعم ‏\"‏ ‏.‏ قال رجل من الأنصار وجبت هذه ‏.‏ فالتفت إلى وكنت أقرب القوم منه فقال ما أرى الإمام إذا أم القوم إلا قد كفاهم ‏.‏ قال أبو عبد الرحمن هذا عن رسول الله صلى الله عليه وسلم خطأ إنما هو قول أبي الدرداء ولم يقرأ هذا مع الكتاب ‏.‏",
      "text_en": " Kathir bin Murrah Al-Hadrami narrated that :                     He heard Abu Ad-Darda say: \"The Messenger of Allah (ﷺ) was asked: 'Is there recitation in every prayer?' He said: 'Yes.' A man among the Ansar said: 'Is that obligatory?' He (Abu Ad-Darda) turned to me (Kathir), as I was closest of the people to him, and said: 'I think that if the Imam leads the people, that is sufficient for them.'\"",
      "chain": [
        "30524",
        "20650",
        "20675",
        "10901",
        "19940",
        "37"
      ]
    },
    {
      "hadith_no": "1215",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا محمد بن سلمة، عن ابن وهب، عن معاوية بن صالح، قال حدثني ربيعة بن يزيد، عن أبي إدريس الخولاني، عن أبي الدرداء، قال قام رسول الله صلى الله عليه وسلم يصلي فسمعناه يقول ‏\"‏ أعوذ بالله منك ‏\"‏ ‏.‏ ثم قال ‏\"‏ ألعنك بلعنة الله ‏\"‏ ‏.‏ ثلاثا وبسط يده كأنه يتناول شيئا فلما فرغ من الصلاة قلنا يا رسول الله قد سمعناك تقول في الصلاة شيئا لم نسمعك تقوله قبل ذلك ورأيناك بسطت يدك ‏.‏ قال ‏\"‏ إن عدو الله إبليس جاء بشهاب من نار ليجعله في وجهي فقلت أعوذ بالله منك ثلاث مرات ثم قلت ألعنك بلعنة الله فلم يستأخر ثلاث مرات ثم أردت أن آخذه والله لولا دعوة أخينا سليمان لأصبح موثقا بها يلعب به ولدان أهل المدينة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Ad-Darda' said:                     \"The Messenger of Allah (ﷺ) stood praying, and we heard him say: 'I seek refuge with Allah from you.' Then he said: 'I curse you with the curse of Allah (SWT),' three times and stretched out his hand as if to take something. When he finished praying we said: 'O Messenger of Allah, we heard you say something in your prayer that we have never heard you say before, and we saw you stretch out your hand.' He said: 'The enemy of Allah (SWT), Iblis, came with a brand of fire to throw it in my face, so I said: I seek refuge with Allah from you three times, then I wanted to take hold of him. By Allah (SWT), were it not for the prayer of our brother Sulaiman, he would have been tied up this morning for the children of Al-Madinah to play with him.'\"",
      "chain": [
        "20672",
        "20029",
        "20675",
        "11414",
        "11027",
        "37"
      ]
    },
    {
      "hadith_no": "3132",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا هارون بن محمد بن بكار بن بلال، قال حدثنا محمد بن عيسى بن القاسم بن سميع، قال حدثنا زيد بن واقد، قال حدثني بسر بن عبيد الله، عن أبي إدريس الخولاني، عن أبي الدرداء، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أقام الصلاة وآتى الزكاة ومات لا يشرك بالله شيئا كان حقا على الله عز وجل أن يغفر له هاجر أو مات في مولده ‏\"‏ ‏.‏ فقلنا يا رسول الله ألا نخبر بها الناس فيستبشروا بها فقال ‏\"‏ إن للجنة مائة درجة بين كل درجتين كما بين السماء والأرض أعدها الله للمجاهدين في سبيله ولولا أن أشق على المؤمنين ولا أجد ما أحملهم عليه ولا تطيب أنفسهم أن يتخلفوا بعدي ما قعدت خلف سرية ولوددت أني أقتل ثم أحيا ثم أقتل ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Ad-Darda' said:                      \"The Messenger of Allah (ﷺ) said: 'Whoever established Salah, pays Zakah, and dies not associating anything with Allah, he has a right from Allah the Mighty and Sublime, that He will forgive him, whether he emigrated, or died in his birthplace.' We said: 'O Messenger of Allah! Shall we not tell the people about it so that they may rejoice?' He said: 'In Paradise there are one hundred levels, (the distance) between each two of which is like (the distance) between the Heaven and the Earth; Allah has prepared them fro the Mujahidin who strive in His cause. Were it not that it would be too difficult for the believers and I cannot find mounts for them - and they do not like to stay behind if I go out (on a campaign) - I would not have stayed behind from any expedition. I wish that I could be killed then brought back to life, then killed again.'\"",
      "chain": [
        "37538",
        "27542",
        "11671",
        "11412",
        "11027",
        "37"
      ]
    },
    {
      "hadith_no": "5",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا هشام بن عمار الدمشقي، حدثنا محمد بن عيسى بن سميع، حدثنا إبراهيم بن سليمان الأفطس، عن الوليد بن عبد الرحمن الجرشي، عن جبير بن نفير، عن أبي الدرداء، قال خرج علينا رسول الله  صلى الله عليه وسلم  ونحن نذكر الفقر ونتخوفه فقال ‏\"‏ آلفقر تخافون والذي نفسي بيده لتصبن عليكم الدنيا صبا حتى لا يزيغ قلب أحد منكم إزاغة إلا هيه وايم الله لقد تركتكم على مثل البيضاء ليلها ونهارها سواء ‏\"‏ ‏.‏ قال أبو الدرداء صدق والله رسول الله  صلى الله عليه وسلم  تركنا والله على مثل البيضاء ليلها ونهارها سواء ‏.‏",
      "text_en": " Abu Darda' said:                     \"The Messanger of Allah (ﷺ) came out to us when we were speaking of poverty and how we feared it. He said: 'Is it poverty that you fear? By the One in Whose Hand is my soul, (the delights and luxuries of) this world will come to you in plenty, and nothing will cause the heart of anyone of you to deviate except that. By Allah, I am leaving you upon something like Bayda (white, bright, clear path) the night and day of which are the same.'\"",
      "chain": [
        "30288",
        "27542",
        "27500",
        "10975",
        "4097",
        "37"
      ]
    },
    {
      "hadith_no": "79",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا أبو عثمان البخاري، حدثنا الهيثم، حدثنا إسماعيل، عن جرير بن عثمان، عن الحارث، - أظنه - عن مجاهد، عن أبي الدرداء، قال الإيمان يزداد وينقص ‏.‏",
      "text_en": " It was narrated that Abu Darda' said:                     \"Faith increases and decreases.\"",
      "chain": [
        "20208",
        "11028",
        "37"
      ]
    },
    {
      "hadith_no": "207",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا هشام بن عمار، حدثنا الوزير بن صبيح، حدثنا يونس بن حلبس، عن أم الدرداء، عن أبي الدرداء، عن النبي  صلى الله عليه وسلم  في قوله تعالى ‏{كل يوم هو في شأن}‏ ‏.‏ قال ‏\"‏ من شأنه أن يغفر ذنبا ويفرج كربا ويرفع قوما ويخفض آخرين ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Darda' that:                     The Prophet said concerning the Verse: \"Every day He is (engaged) in some affair.\" \"His affairs include forgiving sins, relieving distress, raising some people and bringing others low.\"",
      "chain": [
        "30288",
        "11457",
        "37"
      ]
    },
    {
      "hadith_no": "245",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا هشام بن عمار، حدثنا حفص بن عمر، عن عثمان بن عطاء، عن أبيه، عن أبي الدرداء، قال سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ إنه ليستغفر للعالم من في السموات ومن في الأرض حتى الحيتان في البحر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Dharr said:                     \"I heard the Messenger of Allah say: 'Everyone in the universe, in the heavens and on earth, prays for forgiveness for the scholar, even the fish in the sea.\"",
      "chain": [
        "30288",
        "30329",
        "37"
      ]
    },
    {
      "hadith_no": "584",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا هشام بن خالد الأزرق، حدثنا الحسن بن يحيى الخشني، حدثنا زيد بن واقد، عن بسر بن عبيد الله، عن أبي إدريس الخولاني، عن أبي الدرداء، قال خرج علينا رسول الله  صلى الله عليه وسلم  ورأسه يقطر ماء فصلى بنا في ثوب واحد متوشحا به قد خالف بين طرفيه فلما انصرف قال عمر بن الخطاب يا رسول الله تصلي بنا في ثوب واحد قال ‏\"‏ نعم أصلي فيه وفيه ‏\"‏ ‏.‏ أى قد جامعت فيه ‏.‏",
      "text_en": " It was narrated that Abu Darda' said:                     \"The Messenger of Allah came out to us with water dripping from his head, and he led us in prayer wearing a single garment, placing its one end on the right shoulder, and the other end on the other shoulder. When he finished praying, 'Umar bin Khattab said to him: 'O Messenger of Allah, did you lead us in prayer wearing a single garment? He said: 'Yes, I perform prayer in it, and in it I (i.e. I had sexual intercourse in it).\"",
      "chain": [
        "37540",
        "27503",
        "11671",
        "11412",
        "11027",
        "37"
      ]
    },
    {
      "hadith_no": "891",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا علي بن محمد، حدثنا إسحاق بن سليمان، حدثنا معاوية بن يحيى، عن يونس بن ميسرة، عن أبي إدريس الخولاني، عن أبي الدرداء، قال سأله رجل فقال أقرأ والإمام يقرأ قال سأل رجل النبي  صلى الله عليه وسلم  أفي كل صلاة قراءة فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ نعم ‏\"‏ ‏.‏ فقال رجل من القوم وجب هذا ‏.‏",
      "text_en": " Abu IdrisAl-Khawlani narrated that a man asked Abu Darda’:                      “Should Irecite when the Imam is reciting?” He said: “A man asked theProphet(ﷺ) whether there was recitation in every prayer. TheMessenger ofAllah (ﷺ) said: ‘Yes.’ A man among the peoplesaid: ‘It has becomeobligatory.’”",
      "chain": [
        "38409",
        "20310",
        "19201",
        "11027",
        "37"
      ]
    },
    {
      "hadith_no": "1109",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا سليمان بن عبد الرحمن الدمشقي، حدثنا عثمان بن فائد، حدثنا عاصم بن رجاء بن حيوة، عن المهدي بن عبد الرحمن بن عيينة بن خاطر، قال حدثتني عمتي أم الدرداء، عن أبي الدرداء، قال سجدت مع النبي  صلى الله عليه وسلم  إحدى عشرة سجدة ليس فيها من المفصل شىء الأعراف والرعد والنحل وبني إسرائيل ومريم والحج وسجدة الفرقان وسليمان سورة النمل والسجدة وفي ص وسجدة الحواميم ‏.‏",
      "text_en": " It wasnarrated that Abu Darda’ said:                      “I performed elevenprostrationswith the Prophet (ﷺ) of which there were none in theMufassal.Al-A’raf, Ar-Ra’d, An-Nahl, Bani Isra’il, Maryam, Al-Hajj,theprostration in Al-Furqan, Surat An-Naml (mentioning) Sulaiman,As-Sajdah, Sad, and the Ha-Mim Surah.”",
      "chain": [
        "11222",
        "30587",
        "24308",
        "28259",
        "37"
      ]
    },
    {
      "hadith_no": "1706",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا عمرو بن سواد المصري، حدثنا عبد الله بن وهب، عن عمرو بن الحارث، عن سعيد بن أبي هلال، عن زيد بن أيمن، عن عبادة بن نسى، عن أبي الدرداء، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ أكثروا الصلاة على يوم الجمعة فإنه مشهود تشهده الملائكة وإن أحدا لن يصلي على إلا عرضت على صلاته حتى يفرغ منها ‏\"‏ ‏.‏ قال قلت وبعد الموت قال ‏\"‏ وبعد الموت إن الله حرم على الأرض أن تأكل أجساد الأنبياء ‏\"‏ ‏.‏ فنبي الله حى يرزق ‏.‏",
      "text_en": " It wasnarrated from Abu Darda’ that the Messenger of Allah (ﷺ)said:                     “Send a great deal of blessing upon me on Fridays, for it iswitnessed by the angels. No one sends blessing upon me but hisblessing will be presented to me, until he finishes them.” A mansaid:“Even after death?” He said: “Even after death, for Allahhasforbidden the earth to consume the bodies of the Prophets, so theProphet of Allah is alive and receives provision.’”",
      "chain": [
        "30443",
        "20029",
        "20377",
        "11169",
        "18320",
        "37"
      ]
    },
    {
      "hadith_no": "1732",
      "source": " Sunan Ibn Majah ",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عامر، ح وحدثنا عبد الرحمن بن إبراهيم، وهارون بن عبد الله الحمال، قالا حدثنا ابن أبي فديك، جميعا عن هشام بن سعد، عن عثمان بن حيان الدمشقي، حدثتني أم الدرداء، عن أبي الدرداء، أنه قال لقد رأيتنا مع رسول الله  صلى الله عليه وسلم  في بعض أسفاره في اليوم الحار الشديد الحر وإن الرجل ليضع يده على رأسه من شدة الحر وما في القوم أحد صائم إلا رسول الله  صلى الله عليه وسلم  وعبد الله بن رواحة ‏.‏",
      "text_en": " It wasnarrated that Abu Darda’ said:                      “We were with the Messenger ofAllah (ﷺ) on one of his journeys on a hot day, and it was extremelyhot. A man would put his hand over his head because of the intenseheat. No one among the people was fasting except for the Messenger ofAllah (ﷺ) and ‘Abdullah bin Rawahah.”",
      "chain": [
        "30160",
        "20443",
        "30285",
        "30524",
        "20172",
        "20519",
        "11890",
        "11457",
        "37"
      ]
    },
    {
      "hadith_no": "2866",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا هارون بن عبد الله الحمال، حدثنا ابن أبي فديك، عن الخليل بن عبد الله، عن الحسن، عن علي بن أبي طالب، وأبي الدرداء، وأبي، هريرة وأبي أمامة الباهلي وعبد الله بن عمر وعبد الله بن عمرو وجابر بن عبد الله وعمران بن الحصين كلهم يحدث عن رسول الله صلى الله عليه وسلم أنه قال ‏\"‏ من أرسل بنفقة في سبيل الله وأقام في بيته فله بكل درهم سبعمائة درهم ومن غزا بنفسه في سبيل الله وأنفق في وجه ذلك فله بكل درهم سبعمائة ألف درهم ‏\"‏ ‏.‏ ثم تلا هذه الآية ‏{والله يضاعف لمن يشاء}‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Ali bin Abu Talib, Abu Darda’, Abu Hurairah, AbuUmamah Al-Bahili, ‘Abdullah bin ‘Umar, ‘Abdullah bin ‘Amr,Jabir bin‘Abdullah and ‘Imran bin Husain, all of them narratingthat theMessenger of Allah (ﷺ) said:                      “Whoever sends financialsupport in thecause of Allah and stays at home, for every Dirham hewill have (thereward of) seven hundred Dirham. Whoever fightshimself in the causeof Allah, and spends on that, for every Dirhamhe will have (thereward of) seven hundred thousand Dirham.” Thenhe recited the Verse:“Allah gives manifold increase to whom Hewills.”[2:261]",
      "chain": [
        "30524",
        "20172",
        "11016",
        "5",
        "37"
      ]
    },
    {
      "hadith_no": "2882",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا هشام بن عمار، حدثنا بقية، عن معاوية بن يحيى، عن ليث بن أبي سليم، عن يحيى بن عباد، عن أم الدرداء، عن أبي الدرداء، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ غزوة في البحر مثل عشر غزوات في البر والذي يسدر في البحر كالمتشحط في دمه في سبيل الله سبحانه ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Darda’ that the Messenger of Allah (ﷺ)said:                      “Amilitary expedition by sea is like ten expeditions by land.The onewho suffers from seasickness is like one who gets drenched inhis ownblood in the cause of Allah.”",
      "chain": [
        "30288",
        "20644",
        "10957",
        "10840",
        "11457",
        "37"
      ]
    },
    {
      "hadith_no": "3430",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا العباس بن الوليد الخلال الدمشقي، حدثنا يحيى بن صالح، حدثني سليمان بن عطاء الجزري، حدثني مسلمة بن عبد الله الجهني، عن عمه أبي مشجعة، عن أبي الدرداء، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ سيد طعام أهل الدنيا وأهل الجنة اللحم ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Darda’ that the Messenger of Allah (ﷺ)said:                     “The best food of the people of this world and the people ofParadise is meat.’”",
      "chain": [
        "20470",
        "28229",
        "17541",
        "37"
      ]
    },
    {
      "hadith_no": "3431",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا العباس بن الوليد الدمشقي، حدثنا يحيى بن صالح، حدثنا سليمان بن عطاء الجزري، حدثنا مسلمة بن عبد الله الجهني، عن عمه أبي مشجعة، عن أبي الدرداء، قال ما دعي رسول الله  صلى الله عليه وسلم  إلى لحم قط إلا أجاب ولا أهدي له لحم قط إلا قبله ‏.‏",
      "text_en": " It wasnarrated that Abu Darda’ said:                      “The Messenger of Allah (ﷺ)wasnever invited to eat meat but he would respond, and he was neveroffered meat as a gift but he would accept it.”",
      "chain": [
        "20470",
        "28229",
        "17541",
        "37"
      ]
    },
    {
      "hadith_no": "3496",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Drinks - كتاب الأشربة",
      "chapter_no": "30",
      "text_ar": "حدثنا الحسين بن الحسن المروزي، حدثنا ابن أبي عدي، ح وحدثنا إبراهيم بن سعيد الجوهري، حدثنا عبد الوهاب، جميعا عن راشد أبي محمد الحماني، عن شهر بن حوشب، عن أم الدرداء، عن أبي الدرداء، قال أوصاني خليلي  صلى الله عليه وسلم  ‏\"‏ لا تشرب الخمر فإنها مفتاح كل شر ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Darda’ said:                      ‘My close friend (ﷺ) advisedme:‘Do not drink wine, for it is the key to all evils.’”",
      "chain": [
        "20276",
        "30498",
        "20259",
        "14114",
        "11044",
        "11457",
        "37"
      ]
    },
    {
      "hadith_no": "3501",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Drinks - كتاب الأشربة",
      "chapter_no": "30",
      "text_ar": "حدثنا هشام بن عمار، حدثنا سليمان بن عتبة، حدثني يونس بن ميسرة بن حلبس، عن أبي إدريس، عن أبي الدرداء، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ لا يدخل الجنة مدمن خمر ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Darda’ that the Prophet (ﷺ) said:                      “No onewhois addicted to wine will enter Paradise.”",
      "chain": [
        "30288",
        "28228",
        "19201",
        "11027",
        "37"
      ]
    },
    {
      "hadith_no": "3697",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا محمد بن حسان الأزرق، حدثنا عبد المجيد بن أبي رواد، حدثنا مروان بن سالم، عن صفوان بن عمرو، عن شريح بن عبيد الحضرمي، عن أبي الدرداء، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن أحسن ما زرتم الله به في قبوركم ومساجدكم البياض ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Darda’ that the Messenger of Allah (ﷺ)said:                     “The best of that in which you visit Allah in your graves andyourmosque is white (garments).”*",
      "chain": [
        "36629",
        "20660",
        "28558",
        "10921",
        "18414",
        "37"
      ]
    },
    {
      "hadith_no": "3663",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا محمد بن الصباح، حدثنا سفيان بن عيينة، عن عطاء، عن أبي عبد الرحمن، عن أبي الدرداء، سمع النبي  صلى الله عليه وسلم  يقول ‏\"‏ الوالد أوسط أبواب الجنة فأضع ذلك الباب أو احفظه ‏\"‏ ‏.‏",
      "text_en": " Abu Umamah heard the Prophet(ﷺ) say that:                     \"The father is the middle door of Paradise (i.e. the best way to Paradise), so it is up to you whether you take advantage of it or not.\"",
      "chain": [
        "30269",
        "20005",
        "11029",
        "11359",
        "37"
      ]
    },
    {
      "hadith_no": "3790",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا المغيرة بن عبد الرحمن، عن عبد الله بن سعيد بن أبي هند، عن زياد بن أبي زياد، مولى ابن عياش عن أبي بحرية، عن أبي الدرداء، أن النبي  صلى الله عليه وسلم  قال ‏\"‏ ألا أنبئكم بخير أعمالكم وأرضاها عند مليككم وأرفعها في درجاتكم وخير لكم من إعطاء الذهب والورق ومن أن تلقوا عدوكم فتضربوا أعناقهم ويضربوا أعناقكم ‏\"‏ ‏.‏ قالوا وما ذاك يا رسول الله قال ‏\"‏ ذكر الله ‏\"‏ ‏.‏ وقال معاذ بن جبل ما عمل امرؤ بعمل أنجى له من عذاب الله عز وجل من ذكر الله ‏.‏",
      "text_en": " It was narrated from Abu Darda that the Prophet(ﷺ) said:                     \"Shall I not tell you of the best of your deeds, the most pleasing to your Sovereign, those that raise you most in status, that are better than your gold and silver, or meeting you enemy (in battle) and you strike their necks and they strike your necks?\" They said: \" WHat is that, O Messenger of Allah?\" He said: \"Remembering Allah(Dhikr).\"",
      "chain": [
        "32048",
        "20182",
        "11184",
        "19921",
        "37"
      ]
    },
    {
      "hadith_no": "3813",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا علي بن محمد، حدثنا أبو معاوية، عن عمر بن راشد، عن يحيى بن أبي كثير، عن أبي سلمة بن عبد الرحمن، عن أبي الدرداء، قال قال لي رسول الله  صلى الله عليه وسلم  ‏\"‏ عليك بسبحان الله والحمد لله ولا إله إلا الله والله أكبر فإنها - يعني - يحططن الخطايا كما تحط الشجرة ورقها ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Darda' said:                     \"The Messenger of Allah (ﷺ) said to me: 'You should recite Subhan-Allah, wal-Hamdu-Lillah, wa la ilahah illallah, wa Allahu Akbar (Glory is to Allah, praise is to Allah, none has the right to be worshiped but Allah, and Allah is the Most Great), for it sheds sins like the tree sheds its leaves.'\"",
      "chain": [
        "38409",
        "20354",
        "28427",
        "11449",
        "10567",
        "37"
      ]
    },
    {
      "hadith_no": "4170",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا الحسين بن الحسن المروزي، حدثنا ابن أبي عدي، ح وحدثنا إبراهيم بن سعيد الجوهري، حدثنا عبد الوهاب بن عطاء، قالا حدثنا راشد أبو محمد الحماني، عن شهر بن حوشب، عن أم الدرداء، عن أبي الدرداء، قال أوصاني خليلي  صلى الله عليه وسلم  أن ‏\"‏ لا تشرك بالله شيئا وإن قطعت وحرقت ولا تترك صلاة مكتوبة متعمدا فمن تركها متعمدا فقد برئت منه الذمة ولا تشرب الخمر فإنها مفتاح كل شر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Darda’ that my close friend (ﷺ) advisedme:                      “Do not associate anything with Allah, even if you are cut andburned. Do not neglect any prescribd prayer deliberately, for whoeverneglects it deliberately no longer has the protection of Allah. Anddonot drink wine, for it is the key to all evil.”",
      "chain": [
        "20276",
        "30498",
        "20557",
        "11044",
        "11457",
        "37"
      ]
    }
  ],
  "total_hadiths": 66
}