{
  "id": "37534",
  "name": "Mhmwd bin Khalid محمود بن خالد",
  "full_name": "Mhmwd bin Khalid محمود بن خالد",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "247",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Damascus"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ د  س  ق  -  ثقة ]"
    ],
    "tags": [
      "al-Salmi",
      "al-Damashqi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20733",
      "name": "al-Walid bin Muslim al-Quraishi الوليد بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "27536",
      "name": "'Umar bin Abd al-Wahd عمر بن عبد الواحد بن قيس السلمي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "27522",
      "name": "'Abdullah bin Kathir al-Dmshqy عبد الله بن كثير الدمشقي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20732",
      "name": "Muhammad bin Shu'aib bin Shabur محمد بن شعيب بن شابور",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20448",
      "name": "'Ali bin 'Ayyash علي بن عياش",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20034",
      "name": "Muhammad bin Yusuf al-Faryabi محمد بن يوسف الفريابي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30284",
      "name": "'Abdul A'ala bin Mushir al-Ghasani عبد الأعلى بن مسهر أبو مسهر الغساني",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "students": [
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "30006",
      "name": "Imam Nasa'i أحمد بن شعيب بن علي بن سنان النسائي",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30004",
      "name": "Ibn Maja ابن ماجة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "38032",
      "name": "Ahmed bin Abi al-Hawari أحمد بن عبد الله بن ميمون",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38000",
      "name": "Ahmed bin Ibrahim bin Fyl أحمد بن إبراهيم بن فيل",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "37501",
      "name": "Ahmed bin al-Ma'la bin Yazid أحمد بن المعلى بن يزيد",
      "grade": "3rd Century AH [12th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sunan-abi-daud-91",
      "hadith_no": "91",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمود بن خالد السلمي، حدثنا أحمد بن علي، حدثنا ثور، عن يزيد بن شريح الحضرمي، عن أبي حى المؤذن، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يحل لرجل يؤمن بالله واليوم الآخر أن يصلي وهو حقن حتى يتخفف ‏\"‏ ‏.‏ ثم ساق نحوه على هذا اللفظ قال ‏\"‏ ولا يحل لرجل يؤمن بالله واليوم الآخر أن يؤم قوما إلا بإذنهم ولا يختص نفسه بدعوة دونهم فإن فعل فقد خانهم ‏\"‏ ‏.‏ قال أبو داود هذا من سنن أهل الشام لم يشركهم فيها أحد ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: It is not permissible for a man who believes in Allah and in the Last Day that he should say the prayer while he is feeling the call of nature until he becomes light (by relieving himself).Then the narrator Thawr b. Yazid transmitted a similar tradition with the following wordings: \"It is not permissible for a man who believes in Allah and in the Last Day that he should lead the people in prayer but with their permission; and that he should not supplicate to Allah exclusively for himself leaving all others. If he did so, he violated trust.\"Abu Dawud said: This is a tradition reported by the narrators of Syria; no other person has joined them in relating this tradition.",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "28001",
        "11155",
        "19173",
        "18410",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-122",
      "hadith_no": "122",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمود بن خالد، ويعقوب بن كعب الأنطاكي، - لفظه - قالا حدثنا الوليد بن مسلم، عن حريز بن عثمان، عن عبد الرحمن بن ميسرة، عن المقدام بن معديكرب، قال رأيت رسول الله صلى الله عليه وسلم توضأ فلما بلغ مسح رأسه وضع كفيه على مقدم رأسه فأمرهما حتى بلغ القفا ثم ردهما إلى المكان الذي بدأ منه ‏.‏ قال محمود قال أخبرني حريز ‏.‏",
      "text_en": " Al-Miqdam b. Ma’dikarib reported :                      I saw the Messenger of Allah (ﷺ) perform ablution. When he reached the stage of wiping his head, he placed his palms on the front of the head. Then he moved them until he reached the nape. He then returned them to the place from where he had started.",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "20733",
        "11684",
        "18651"
      ]
    },
    {
      "id": "sunan-abi-daud-123",
      "hadith_no": "123",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمود بن خالد، وهشام بن خالد، - المعنى - قالا حدثنا الوليد، بهذا الإسناد قال ومسح بأذنيه ظاهرهما وباطنهما ‏.‏ زاد هشام وأدخل أصابعه في صماخ أذنيه ‏.‏",
      "text_en": " Another version says:                      He wiped his ears inside and outside. Hisham adds: He inserted his fingers in the ear-holes.",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "37540",
        "20733"
      ]
    },
    {
      "id": "sunan-abi-daud-125",
      "hadith_no": "125",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمود بن خالد، حدثنا الوليد، بهذا الإسناد قال فتوضأ ثلاثا ثلاثا وغسل رجليه بغير عدد ‏.‏",
      "text_en": " Another version says:                      He performed each part of the ablution three times and washed his feet times without number.",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "20733"
      ]
    },
    {
      "id": "sunan-abi-daud-165",
      "hadith_no": "165",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا موسى بن مروان، ومحمود بن خالد الدمشقي، - المعنى - قالا حدثنا الوليد، - قال محمود - أخبرنا ثور بن يزيد، عن رجاء بن حيوة، عن كاتب المغيرة بن شعبة، عن المغيرة بن شعبة، قال وضأت النبي صلى الله عليه وسلم في غزوة تبوك فمسح أعلى الخفين وأسفلهما ‏.‏ قال أبو داود وبلغني أنه لم يسمع ثور هذا الحديث من رجاء ‏.‏",
      "text_en": " Narrated Al-Mughirah ibn Shu'bah:                     I poured water while the Prophet (ﷺ)  performed ablution in the battle of Tabuk. He wiped over the upper part of the socks and their lower part.Abu Dawud said: I have been told that Thawr did not hear this tradition from Raja'.",
      "usc_msa_ref": "",
      "chain": [
        "35154",
        "37534",
        "20733",
        "30277",
        "20415",
        "10910",
        "166"
      ]
    },
    {
      "id": "sunan-abi-daud-349",
      "hadith_no": "349",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمود بن خالد الدمشقي، أخبرنا مروان، حدثنا علي بن حوشب، قال سألت مكحولا عن هذا القول، ‏\"‏ غسل واغتسل ‏\"‏ ‏.‏ فقال غسل رأسه وغسل جسده ‏.‏",
      "text_en": " Makhul was asked about the meaning of words ghassala and ightasala (that occur in tradition 345) and he said:                      one should was one's head and body well (and not than one should makes one's wife wash).",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "20201",
        "27532",
        "11066"
      ]
    },
    {
      "id": "sunan-abi-daud-385",
      "hadith_no": "385",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا أبو المغيرة، ح وحدثنا عباس بن الوليد بن مزيد، أخبرني أبي ح، وحدثنا محمود بن خالد، حدثنا عمر، - يعني ابن عبد الواحد - عن الأوزاعي، - المعنى - قال أنبئت أن سعيد بن أبي سعيد المقبري، حدث عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا وطئ أحدكم بنعليه الأذى فإن التراب له طهور ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported:                      The Messenger of Allah (ﷺ) said: When any one of you treads with his sandal upon an unclean place, the earth will render it purified.",
      "usc_msa_ref": "",
      "chain": [
        "30007",
        "20442",
        "38288",
        "28624",
        "37534",
        "27536",
        "11168",
        "11212",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-387",
      "hadith_no": "387",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمود بن خالد، حدثنا محمد، - يعني ابن عائذ - حدثني يحيى، - يعني ابن حمزة - عن الأوزاعي، عن محمد بن الوليد، أخبرني أيضا، سعيد بن أبي سعيد عن القعقاع بن حكيم، عن عائشة، عن رسول الله صلى الله عليه وسلم بمعناه ‏.‏",
      "text_en": " 'Aishah reported a similar tradition from the Messenger of Allah (ﷺ).",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "37529",
        "20402",
        "20024",
        "20459",
        "11168",
        "10612",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-415",
      "hadith_no": "415",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمود بن خالد، حدثنا الوليد، قال قال أبو عمرو يعني الأوزاعي وذلك أن ترى، ما على الأرض من الشمس صفراء ‏.‏",
      "text_en": " Al-Awza'i said:                      Delaying the 'Asr prayer means that the sunshine becomes yellow on the earth.",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "20733",
        "20024"
      ]
    },
    {
      "id": "sunan-abi-daud-541",
      "hadith_no": "541",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمود بن خالد، حدثنا الوليد، قال قال أبو عمرو ح وحدثنا داود بن رشيد، حدثنا الوليد، - وهذا لفظه - عن الأوزاعي، عن الزهري، عن أبي سلمة، عن أبي هريرة، أن الصلاة، كانت تقام لرسول الله صلى الله عليه وسلم فيأخذ الناس مقامهم قبل أن يأخذ النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Abu Hurairah reported:                      when the Iqamah was pronounced for prayer during the time of the Messenger of Allah (ﷺ), the people would take their seats before the prophet (ﷺ) came to his seat.",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "20733",
        "20024",
        "30248",
        "20733",
        "20024",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-693",
      "hadith_no": "693",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمود بن خالد الدمشقي، حدثنا علي بن عياش، حدثنا أبو عبيدة الوليد بن كامل، عن المهلب بن حجر البهراني، عن ضباعة بنت المقداد بن الأسود، عن أبيها، قال ما رأيت رسول الله صلى الله عليه وسلم يصلي إلى عود ولا عمود ولا شجرة إلا جعله على حاجبه الأيمن أو الأيسر ولا يصمد له صمدا ‏.‏",
      "text_en": " Narrated Al-Miqdad ibn al-Aswad:                     I never saw the Messenger of Allah (ﷺ) praying in front of a stick, a pillar, or a tree, without having it opposite his right or left eyebrow, and not facing it directly.",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "20448",
        "17068",
        "19497"
      ]
    },
    {
      "id": "sunan-abi-daud-847",
      "hadith_no": "847",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مؤمل بن الفضل الحراني، حدثنا الوليد، ح وحدثنا محمود بن خالد، حدثنا أبو مسهر، ح وحدثنا ابن السرح، حدثنا بشر بن بكر، ح وحدثنا محمد بن مصعب، حدثنا عبد الله بن يوسف، كلهم عن سعيد بن عبد العزيز، عن عطية بن قيس، عن قزعة بن يحيى، عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم كان يقول حين يقول سمع الله لمن حمده ‏\"‏ اللهم ربنا لك الحمد ملء السماء ‏\"‏ ‏.‏ قال مؤمل ملء السموات وملء الأرض وملء ما شئت من شىء بعد أهل الثناء والمجد أحق ما قال العبد وكلنا لك عبد لا مانع لما أعطيت ‏\"‏ ‏.‏ زاد محمود ‏\"‏ ولا معطي لما منعت ‏\"‏ ‏.‏ ثم اتفقوا - ‏\"‏ ولا ينفع ذا الجد منك الجد ‏\"‏ ‏.‏ قال بشر ‏\"‏ ربنا لك الحمد ‏\"‏ ‏.‏ لم يقل محمود ‏\"‏ اللهم ‏\"‏ ‏.‏ قال ‏\"‏ ربنا ولك الحمد ‏\"‏ ‏.‏",
      "text_en": " Abu sa’id al-Khuri said:                      When the Messenger of Allah (ﷺ) said: “ Allah listens to him who praises Him,” he also said: O Allah, our Lord, to thee be the praise in all heavens. Mu’ammil said( in his version); “ In all the heavens, and in all the earth, and in all that it pleases Thee to create afterwards. O thou Who art worthy of praise and glory, most worthy of what a servant says, and we are all thy servants, no one can withhold what thou givest or give what Thou withholdest. “The narrators then were agreed on the words: “And riches cannot avail a wealthy person with Thee.”",
      "usc_msa_ref": "",
      "chain": [
        "38659",
        "20733",
        "37534",
        "30284",
        "30485",
        "20413",
        "28536",
        "30355",
        "20638",
        "10877",
        "11302",
        "38"
      ]
    },
    {
      "id": "sunan-abi-daud-938",
      "hadith_no": "938",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا الوليد بن عتبة الدمشقي، ومحمود بن خالد، قالا حدثنا الفريابي، عن صبيح بن محرز الحمصي، حدثني أبو مصبح المقرائي، قال كنا نجلس إلى أبي زهير النميري - وكان من الصحابة - فيتحدث أحسن الحديث فإذا دعا الرجل منا بدعاء قال اختمه بآمين فإن آمين مثل الطابع على الصحيفة ‏.‏ قال أبو زهير أخبركم عن ذلك خرجنا مع رسول الله صلى الله عليه وسلم ذات ليلة فأتينا على رجل قد ألح في المسألة فوقف النبي صلى الله عليه وسلم يستمع منه فقال النبي صلى الله عليه وسلم ‏\"‏ أوجب إن ختم ‏\"‏ ‏.‏ فقال رجل من القوم بأى شىء يختم قال ‏\"‏ بآمين فإنه إن ختم بآمين فقد أوجب ‏\"‏ ‏.‏ فانصرف الرجل الذي سأل النبي صلى الله عليه وسلم فأتى الرجل فقال اختم يا فلان بآمين وأبشر ‏.‏ وهذا لفظ محمود ‏.‏ قال أبو داود المقراء قبيل من حمير ‏.‏",
      "text_en": " Narrated AbuZuhayr an-Numayri:                     AbuMisbah al-Muqra'i said: We used to sit in the company of AbuZuhayr an-Numayri. He was a companion of the Prophet (ﷺ), and he used to narrate good traditions. Once a man from among us made a supplication.  He said: End it with the utterance of Amin, for Amin is like a seal on the book.  AbuZuhayr said: I shall tell you about that. We went out with the Messenger of Allah (ﷺ) one night and came upon a man who made supplication with persistence. The Prophet (ﷺ) waited to hear him.  The Prophet (ﷺ) said: He will have done something which guarantees (Paradise for him) if he puts a seal to it.  One of the people asked: What should he use as a seal?  He replied: Amin, for if he ends it with Amin, he will do something which guarantees (Paradise for him).  Then the man who questioned the Prophet (ﷺ) came to the man who was supplicating, and said to him: So-and-so, end it with Amin and receive the good news. These are the words of Mahmud.Abu Dawud said: Al-Muqra'i is a clan of Himyar.",
      "usc_msa_ref": "",
      "chain": [
        "37543",
        "37534",
        "20034"
      ]
    },
    {
      "id": "sunan-abi-daud-942",
      "hadith_no": "942",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمود بن خالد، حدثنا الوليد، عن عيسى بن أيوب، قال قوله ‏\"‏ التصفيح للنساء ‏\"‏ ‏.‏ تضرب بأصبعين من يمينها على كفها اليسرى ‏.‏",
      "text_en": " ‘Isa b. Ayyub said:                      Clapping by women means that one should strike her left hand with the two fingers of her right hand.",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "20733"
      ]
    },
    {
      "id": "sunan-abi-daud-1102",
      "hadith_no": "1102",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمود بن خالد، حدثنا مروان، حدثنا سليمان بن بلال، عن يحيى بن سعيد، عن عمرة، عن أختها، قالت ما أخذت ق إلا من في رسول الله صلى الله عليه وسلم كان يقرؤها في كل جمعة ‏.‏ قال أبو داود كذا رواه يحيى بن أيوب وابن أبي الرجال عن يحيى بن سعيد عن عمرة عن أم هشام بنت حارثة بن النعمان ‏.‏",
      "text_en": " \t\t\t\t\t\t\t\t\t\t'Umrah reported on the authority of her sister:                      I memorized Surah al-Qaf from the mouth of the Messenger of Allah (ﷺ); he used to recite it on every friday.Abu Dawud said: This tradition has been narrated in a similar way by Yahya b. Ayyub, Ibn Abu Ar-Rijal, from Yahya b. Sa'id, from 'Umrah from Umm Hisham hint Harithah b. al-Nu'man.",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "20201",
        "20160",
        "11062",
        "11455"
      ]
    },
    {
      "id": "sunan-abi-daud-1107",
      "hadith_no": "1107",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمود بن خالد، حدثنا الوليد، أخبرني شيبان أبو معاوية، عن سماك بن حرب، عن جابر بن سمرة السوائي، قال كان رسول الله صلى الله عليه وسلم لا يطيل الموعظة يوم الجمعة إنما هن كلمات يسيرات ‏.‏",
      "text_en": " Narrated Jabir ibn Samurah as-Suwa'i:                     The Messenger of Allah (ﷺ) would not lengthen the sermon on Friday. He would say a few words.",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "20733",
        "20240",
        "10770",
        "393"
      ]
    },
    {
      "id": "sunan-abi-daud-1228",
      "hadith_no": "1228",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Rules of Law about the Prayer during Journey - كتاب صلاة السفر",
      "chapter_no": "4",
      "text_ar": "حدثنا محمود بن خالد، حدثنا محمد بن شعيب، عن النعمان بن المنذر، عن عطاء بن أبي رباح، أنه سأل عائشة - رضى الله عنها - هل رخص للنساء أن يصلين على الدواب قالت لم يرخص لهن في ذلك في شدة ولا رخاء ‏.‏ قال محمد هذا في المكتوبة ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     Ata' ibn AbuRabah asked Aisha: Can women offer prayer on a riding beast? She replied: They were not permitted to do so in hardship or comfort. Muhammad ibn Shu'ayb said: This (prohibition) applies to the obligatory prayers.",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "20732",
        "17545",
        "11029",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-1609",
      "hadith_no": "1609",
      "source": "Sunan Abi Da'ud",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا محمود بن خالد الدمشقي، وعبد الله بن عبد الرحمن السمرقندي، قالا حدثنا مروان، قال عبد الله حدثنا أبو يزيد الخولاني، - وكان شيخ صدق وكان ابن وهب يروي عنه - حدثنا سيار بن عبد الرحمن، - قال محمود الصدفي - عن عكرمة، عن ابن عباس، قال فرض رسول الله صلى الله عليه وسلم زكاة الفطر طهرة للصائم من اللغو والرفث وطعمة للمساكين من أداها قبل الصلاة فهي زكاة مقبولة ومن أداها بعد الصلاة فهي صدقة من الصدقات ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Messenger of Allah (ﷺ) prescribed the sadaqah (alms) relating to the breaking of the fast as a purification of the fasting from empty and obscene talk and as food for the poor. If anyone pays it before the prayer (of 'Id), it will be accepted as zakat. If anyone pays it after the prayer, that will be a sadaqah like other sadaqahs (alms).",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "20201",
        "18",
        "26049",
        "11023",
        "17"
      ]
    },
    {
      "id": "sunan-abi-daud-2011",
      "hadith_no": "2011",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا محمود بن خالد، حدثنا عمر، حدثنا أبو عمرو، - يعني الأوزاعي - عن الزهري، عن أبي سلمة، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال حين أراد أن ينفر من منى ‏\"‏ نحن نازلون غدا ‏\"‏ ‏.‏ فذكر نحوه ولم يذكر أوله ولا ذكر الخيف الوادي ‏.‏",
      "text_en": " Abu Hurairah said “Apostle of Allaah(ﷺ) said when intended to march from Mina we shall encamp tomorrow. The narrator then narrated something similar (as a previous tradition but he did not mention the opening words, nor did he mention the words “Al Khaif, Al Wadi(Khaif means Valley).”",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "3",
        "20024",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-2249",
      "hadith_no": "2249",
      "source": "Sunan Abi Da'ud",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا محمود بن خالد الدمشقي، حدثنا الفريابي، عن الأوزاعي، عن الزهري، عن سهل بن سعد الساعدي، بهذا الخبر قال فكان يدعى - يعني الولد - لأمه ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Sahl bin Sa’d Al Sa’idi through a different chain of narrators. This version adds the child was attributed to its mother.",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "20034",
        "20024",
        "11013",
        "399"
      ]
    },
    {
      "id": "sunan-abi-daud-2266",
      "hadith_no": "2266",
      "source": "Sunan Abi Da'ud",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا محمود بن خالد، حدثنا أبي، عن محمد بن راشد، بإسناده ومعناه زاد وهو ولد زنا لأهل أمه من كانوا حرة أو أمة وذلك فيما استلحق في أول الإسلام فما اقتسم من مال قبل الإسلام فقد مضى ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Muhammad bin Rashid through a different chain of narrators to the same effect.  This version adds “he is the child of fornication for the people of his mother whether she was free or a slave. This attribution of a child to the parents was practiced in the beginning of Islam. The property divided before Islam will not be taken into account.",
      "usc_msa_ref": "",
      "chain": [
        "37534"
      ]
    },
    {
      "id": "sunan-abi-daud-2276",
      "hadith_no": "2276",
      "source": "Sunan Abi Da'ud",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا محمود بن خالد السلمي، حدثنا الوليد، عن أبي عمرو، - يعني الأوزاعي - حدثني عمرو بن شعيب، عن أبيه، عن جده عبد الله بن عمرو، أن امرأة، قالت يا رسول الله إن ابني هذا كان بطني له وعاء وثديي له سقاء وحجري له حواء وإن أباه طلقني وأراد أن ينتزعه مني فقال لها رسول الله صلى الله عليه وسلم ‏\"‏ أنت أحق به ما لم تنكحي ‏\"‏ ‏.‏ ‏.‏",
      "text_en": " 'Amr b. Shu'aib on his father's authority said that his grandfather (Abdullah ibn Amr ibn al-'As) reported:                      A woman said: Messenger of Allah, my womb is a vessel to this son of mine, my breasts, a water-skin for him, and my lap a guard for him, yet his father has divorced me, and wants to take him away from me. The Messenger of Allah (ﷺ) said: You have more right to him as long as you do not marry.",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "20733",
        "19934",
        "19911",
        "29"
      ]
    },
    {
      "id": "sunan-abi-daud-2286",
      "hadith_no": "2286",
      "source": "Sunan Abi Da'ud",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا محمود بن خالد، حدثنا الوليد، حدثنا أبو عمرو، عن يحيى، حدثني أبو سلمة، حدثتني فاطمة بنت قيس، أن أبا عمرو بن حفص المخزومي، طلقها ثلاثا وساق الحديث وخبر خالد بن الوليد قال فقال النبي صلى الله عليه وسلم ‏\"‏ ليست لها نفقة ولا مسكن ‏\"‏ ‏.‏ قال فيه وأرسل إليها النبي صلى الله عليه وسلم أن لا تسبقيني بنفسك ‏.‏",
      "text_en": " Abu Salamah reported on the authority of Fatimah daughter of Qais that Abu ‘Amr bin Hafs Al Makhzumi divorced her three times. He then narrated the rest of the tradition. He then mentioned about Khalid bin Walid and said that the Prophet (ﷺ) said “There are no maintenance and dwelling for her.” This version has “The Apostle of Allaah(ﷺ) sent a message to her “Do not give her consent for marriage without my permission.””",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "20733",
        "20024",
        "11449",
        "10567",
        "224"
      ]
    },
    {
      "id": "sunan-abi-daud-2342",
      "hadith_no": "2342",
      "source": "Sunan Abi Da'ud",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا محمود بن خالد، وعبد الله بن عبد الرحمن السمرقندي، - وأنا لحديثه، أتقن - قالا حدثنا مروان، - هو ابن محمد - عن عبد الله بن وهب، عن يحيى بن عبد الله بن سالم، عن أبي بكر بن نافع، عن أبيه، عن ابن عمر، قال تراءى الناس الهلال فأخبرت رسول الله صلى الله عليه وسلم أني رأيته فصامه وأمر الناس بصيامه ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     The people looked for the moon, so I informed the Messenger of Allah (ﷺ) that I had sighted it. He fasted and commanded the people to fast.",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "20640",
        "20029",
        "18"
      ]
    },
    {
      "id": "sunan-abi-daud-2371",
      "hadith_no": "2371",
      "source": "Sunan Abi Da'ud",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا محمود بن خالد، حدثنا مروان، حدثنا الهيثم بن حميد، أخبرنا العلاء بن الحارث، عن مكحول، عن أبي أسماء الرحبي، عن ثوبان، عن النبي صلى الله عليه وسلم قال ‏\"‏ أفطر الحاجم والمحجوم ‏\"‏ ‏.‏ قال أبو داود ورواه ابن ثوبان عن أبيه عن مكحول بإسناده مثله ‏.‏",
      "text_en": " Narrated Thawban:                     The Prophet (ﷺ) as saying: A man who cups and a man who gets himself cupped break their fast.Abu Dawud said: Ibn Thawban transmitted a similar tradition from his father on the authority of Makhul through an chain of narrators mentioned by him.",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "20201",
        "20744",
        "10884",
        "11066",
        "10883",
        "130"
      ]
    },
    {
      "id": "sunan-abi-daud-2580",
      "hadith_no": "2580",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا محمود بن خالد، حدثنا الوليد بن مسلم، عن سعيد بن بشير، عن الزهري، بإسناد عباد ومعناه ‏.‏ قال أبو داود رواه معمر وشعيب وعقيل عن الزهري، عن رجال، من أهل العلم وهذا أصح عندنا ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Al Zuhri with the chain of ‘Abbad and to the same affect.Abu Dawud said “This tradition has also been narrated by Ma’mar, Shu’aib and ‘Aqil on the authority of Al Zuhri from a number of scholars and this is the soundest one in our opinion.",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "20733",
        "20710",
        "30002",
        "11013"
      ]
    },
    {
      "id": "sunan-abi-daud-2750",
      "hadith_no": "2750",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا عبد الله بن أحمد بن بشير بن ذكوان، ومحمود بن خالد الدمشقيان، - المعنى - قالا حدثنا مروان بن محمد، قال حدثنا يحيى بن حمزة، قال سمعت أبا وهب، يقول سمعت مكحولا، يقول كنت عبدا بمصر لامرأة من بني هذيل فأعتقتني فما خرجت من مصر وبها علم إلا حويت عليه فيما أرى ثم أتيت الحجاز فما خرجت منها وبها علم إلا حويت عليه فيما أرى ثم أتيت العراق فما خرجت منها وبها علم إلا حويت عليه فيما أرى ثم أتيت الشام فغربلتها كل ذلك أسأل عن النفل فلم أجد أحدا يخبرني فيه بشىء حتى أتيت شيخا يقال له زياد بن جارية التميمي فقلت له هل سمعت في النفل شيئا قال نعم سمعت حبيب بن مسلمة الفهري يقول شهدت النبي صلى الله عليه وسلم نفل الربع في البدأة والثلث في الرجعة ‏.‏",
      "text_en": " Narrated Habib ibn Maslamah al-Fihri:                     Makhul said: I was the slave of a woman of Banu Hudhayl; afterwards she emancipated me. I did not leave Egypt until I had acquired all the knowledge that seemed to me to exist there. I then came to al-Hijaz and I did not leave it until I had acquired all the knowledge that seemed to be available. Then I came to al-Iraq, and I did not leave it until I had acquired all the knowledge that seemed to be available.  I then came to Syria, and besieged it. I asked everyone about giving rewards from the booty. I did not find anyone who could tell me anything about it. I then met an old man called Ziyad ibn Jariyah at-Tamimi.  I asked him: Have you heard anything about giving rewards from the booty?  He replied: Yes. I heard Maslamah al-Fihri say: I was present with the Prophet (ﷺ). He gave a quarter of the spoils on the outward journey and a third on the return journey.",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "20640",
        "20402",
        "11066"
      ]
    },
    {
      "id": "sunan-abi-daud-2907",
      "hadith_no": "2907",
      "source": "Sunan Abi Da'ud",
      "chapter": "Shares of Inheritance (Kitab Al-Fara'id) - كتاب الفرائض",
      "chapter_no": "19",
      "text_ar": "حدثنا محمود بن خالد، وموسى بن عامر، قالا حدثنا الوليد، أخبرنا ابن جابر، حدثنا مكحول، قال جعل رسول الله صلى الله عليه وسلم ميراث ابن الملاعنة لأمه ولورثتها من بعدها ‏.‏",
      "text_en": " Narrated Makhul:                     The Messenger of Allah (ﷺ) assigned the estate of a child of a woman about whom she had invoked a curse to her mother, and to her heirs after her.",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "20733",
        "11066"
      ]
    },
    {
      "id": "sunan-abi-daud-2961",
      "hadith_no": "2961",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا محمود بن خالد، حدثنا محمد بن عائذ، حدثنا الوليد، حدثنا عيسى بن يونس، حدثني فيما، حدثه ابن لعدي بن عدي الكندي، أن عمر بن عبد العزيز، كتب إن من سأل عن مواضع الفىء، فهو ما حكم فيه عمر بن الخطاب رضى الله عنه فرآه المؤمنون عدلا موافقا لقول النبي صلى الله عليه وسلم ‏\"‏ جعل الله الحق على لسان عمر وقلبه ‏\"‏ ‏.‏ فرض الأعطية وعقد لأهل الأديان ذمة بما فرض عليهم من الجزية لم يضرب فيها بخمس ولا مغنم ‏.‏",
      "text_en": " Narrated Umar ibn al-Khattab:                     A son of Adi ibn Adi al-Kindi said that Umar ibn AbdulAziz wrote (to his governors): If anyone asks about the places where spoils (fay') should be spent, that should be done in accordance with the decision made by Umar ibn al-Khattab (Allah be pleased with him). The believers considered him to be just, according to the saying of the Prophet (ﷺ): Allah has placed truth upon Umar's tongue and heart. He fixed stipends for Muslims, and provided protection for the people of other religions by levying jizyah (poll-tax) on them, deducting no fifth from it, nor taking  it as booty.",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "37529",
        "20733",
        "20347"
      ]
    },
    {
      "id": "sunan-abi-daud-2993",
      "hadith_no": "2993",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا محمود بن خالد السلمي، حدثنا عمر، - يعني ابن عبد الواحد - عن سعيد، - يعني ابن بشير - عن قتادة، قال كان رسول الله صلى الله عليه وسلم إذا غزا كان له سهم صاف يأخذه من حيث شاءه فكانت صفية من ذلك السهم وكان إذا لم يغز بنفسه ضرب له بسهمه ولم يخير ‏.‏",
      "text_en": " Qatadah said “When the Apostle of Allaah(ﷺ) participated in battle there was for him a special portion which he took from where he desired. Safiyyah was from that portion. But when he did not participate himself in his battle, a portion was taken out for him, but he had no choice.”",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "27536",
        "20710",
        "11019"
      ]
    },
    {
      "id": "sunan-abi-daud-3033",
      "hadith_no": "3033",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا محمود بن خالد، حدثنا عمر، - يعني ابن عبد الواحد - قال قال سعيد - يعني ابن عبد العزيز - جزيرة العرب ما بين الوادي إلى أقصى اليمن إلى تخوم العراق إلى البحر ‏.‏ قال أبو داود قرئ على الحارث بن مسكين وأنا شاهد أخبرك أشهب بن عبد العزيز قال قال مالك عمر أجلى أهل نجران ولم يجلوا من تيماء لأنها ليست من بلاد العرب فأما الوادي فإني أرى إنما لم يجل من فيها من اليهود أنهم لم يروها من أرض العرب ‏.‏",
      "text_en": " Sa’id bin Abd Al ‘Aziz said “Arabia lies between Al Wadi to the extremes of the Yemen extending to the frontiers of Al Iraq and the sea.”Abu Dawud said “This tradition was read out to Al Harith bin Miskin while I was a witness”. Ashhab bin ‘Abd Al Aziz reported it to you on the authority of Malik who said ‘Umar expelled the people of Najran, but he did not expel (them) from Taima. For it did not fall within the territory of Arabia. As for Al Wadi, I think the Jews were not expelled from there. They did not think it a part of the land of Arabia.",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "27536"
      ]
    },
    {
      "id": "sunan-abi-daud-3056",
      "hadith_no": "3056",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا محمود بن خالد، حدثنا مروان بن محمد، حدثنا معاوية، بمعنى إسناد أبي توبة وحديثه قال عند قوله ‏\"‏ ما يقضي عني ‏\"‏ ‏.‏ فسكت عني رسول الله صلى الله عليه وسلم فاغتمزتها ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Mu’awiyah through a different chain of narrators to the same effect as narrated by Abu Taubah. This version has “I have nothing to pay from me. The Apostle of Allaah(ﷺ) thereupon kept silence and this displeased me.”",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "20640"
      ]
    },
    {
      "id": "sunan-abi-daud-3244",
      "hadith_no": "3244",
      "source": "Sunan Abi Da'ud",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا محمود بن خالد، حدثنا الفريابي، حدثنا الحارث بن سليمان، حدثني كردوس، عن الأشعث بن قيس، أن رجلا، من كندة ورجلا من حضرموت اختصما إلى النبي صلى الله عليه وسلم في أرض من اليمن فقال الحضرمي يا رسول الله إن أرضي اغتصبنيها أبو هذا وهي في يده ‏.‏ قال ‏\"‏ هل لك بينة ‏\"‏ ‏.‏ قال لا ولكن أحلفه والله ما يعلم أنها أرضي اغتصبنيها أبوه فتهيأ الكندي لليمين فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا يقتطع أحد مالا بيمين إلا لقي الله وهو أجذم ‏\"‏ ‏.‏ فقال الكندي هي أرضه ‏.‏",
      "text_en": " Narrated Al-Ash'ath ibn Qays:                     A man of Kindah and a man of Hadramawt brought their dispute to the Prophet (ﷺ) about a land in the Yemen. Al-Hadrami said: Messenger of Allah, the father of this (man) usurped my land and it is in his possession. The Prophet asked: Have you any evidence? Al-Hadrami replied: No, but I make him swear (that he should say) that he does not know that it is my land which his father usurped from me. Al-Kindi became ready to take the oath. The Messenger of Allah (ﷺ) said: If anyone usurps the property by taking an oath, he will meet Allah while his hand is mutilated. Al-Kindi then said: It is his land.",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "20034",
        "485"
      ]
    },
    {
      "id": "sunan-abi-daud-3509",
      "hadith_no": "3509",
      "source": "Sunan Abi Da'ud",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا محمود بن خالد الفريابي، عن سفيان، عن محمد بن عبد الرحمن، عن مخلد بن خفاف الغفاري، قال كان بيني وبين أناس شركة في عبد فاقتويته وبعضنا غائب فأغل على غلة فخاصمني في نصيبه إلى بعض القضاة فأمرني أن أرد الغلة فأتيت عروة بن الزبير فحدثته فأتاه عروة فحدثه عن عائشة - رضي الله عنها - عن رسول الله صلى الله عليه وسلم قال ‏\"‏ الخراج بالضمان ‏\"‏ ‏.‏",
      "text_en": " Narrated Makhlad ibn Khufaf al-Ghifari:                     I and some people were partners in a slave. I employed him on some work in the absence of one of the partners. He got earnings for me. He disputed me and the case of his claim to his share in the earnings to a judge, who ordered me to return the earnings (i.e. his share) to him. I then came to Urwah ibn az-Zubayr, and related the matter to him. Urwah then came to him and narrated to him a tradition from the Messenger of Allah (ﷺ) on the authority of Aisha: Profit follows responsibility.",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "20012",
        "11105"
      ]
    },
    {
      "id": "sunan-abi-daud-3570",
      "hadith_no": "3570",
      "source": "Sunan Abi Da'ud",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا محمود بن خالد، حدثنا الفريابي، عن الأوزاعي، عن الزهري، عن حرام بن محيصة الأنصاري، عن البراء بن عازب، قال كانت له ناقة ضارية فدخلت حائطا فأفسدت فيه فكلم رسول الله صلى الله عليه وسلم فيها فقضى أن حفظ الحوائط بالنهار على أهلها وأن حفظ الماشية بالليل على أهلها وأن على أهل الماشية ما أصابت ماشيتهم بالليل ‏.‏",
      "text_en": " Narrated Al-Bara' ibn Azib:                     Al-Bara' had a she-camel which was accustomed to graze the standing crop belonging to the people. She entered a garden and did damage to it. The Messenger of Allah (ﷺ) was informed about it. So he gave decision that the owners of gardens are responsible for guarding them by day, and the owners of the animals are responsible for guarding them by night. Any damage done by animals during the night is a responsibility lying on their owners.",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "20034",
        "20024",
        "11013",
        "400"
      ]
    },
    {
      "id": "sunan-abi-daud-3622",
      "hadith_no": "3622",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا محمود بن خالد، حدثنا الفريابي، حدثنا الحارث بن سليمان، حدثني كردوس، عن الأشعث بن قيس، أن رجلا، من كندة ورجلا من حضرموت اختصما إلى النبي صلى الله عليه وسلم في أرض من اليمن فقال الحضرمي يا رسول الله إن أرضي اغتصبنيها أبو هذا وهي في يده ‏.‏ قال ‏\"‏ هل لك بينة ‏\"‏ ‏.‏ قال لا ولكن أحلفه والله ما يعلم أنها أرضي اغتصبنيها أبوه ‏.‏ فتهيأ الكندي يعني لليمين ‏.‏ وساق الحديث ‏.‏",
      "text_en": " Al-Ash’ath b. Qais said:                      A men from Kindah and a men from Hadramawt came to the Holy Prophet(ﷺ)with their dispute about a land in the Yemen. The Hadrami said:Messenger of Allah, the this (man)had usurped land belonging to me, and it is his possession. He asked: Have you any proof ?He replied:No, but I can have him swear on oath. Allah knows that it is my land, and father seized it from me. The Kindi was prepared to take oath. He then narrated the rest of the tradition.",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "20034",
        "485"
      ]
    },
    {
      "id": "sunan-abi-daud-3640",
      "hadith_no": "3640",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا محمود بن خالد، أن محمد بن عثمان، حدثهم حدثنا عبد العزيز بن محمد، عن أبي طوالة، وعمرو بن يحيى، عن أبيه، عن أبي سعيد الخدري، قال اختصم إلى رسول الله صلى الله عليه وسلم رجلان في حريم نخلة - في حديث أحدهما فأمر بها فذرعت فوجدت سبعة أذرع وفي حديث الآخر - فوجدت خمسة أذرع فقضى بذاك ‏.‏ قال عبد العزيز فأمر بجريدة من جريدها فذرعت ‏.‏",
      "text_en": " Narrated AbuSa'id al-Khudri:                     Two men brought their dispute about the precincts of a palm-tree to the Messenger of Allah (ﷺ). According to a version of this tradition, he ordered to measure and it was measured. It was found seven yards. According to another version, it was found five yards. He made a decision according to that. AbdulAziz said: He ordered to measure with a branch of its branches. It was then measured.",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "17668",
        "20167",
        "11186",
        "11210",
        "11232",
        "38"
      ]
    },
    {
      "id": "sunan-abi-daud-3665",
      "hadith_no": "3665",
      "source": "Sunan Abi Da'ud",
      "chapter": "Knowledge (Kitab Al-Ilm) - كتاب العلم",
      "chapter_no": "26",
      "text_ar": "حدثنا محمود بن خالد، حدثنا أبو مسهر، حدثني عباد بن عباد الخواص، عن يحيى بن أبي عمرو السيباني، عن عمرو بن عبد الله السيباني، عن عوف بن مالك الأشجعي، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يقص إلا أمير أو مأمور أو مختال ‏\"‏ ‏.‏",
      "text_en": " Narrated Awf ibn Malik al-Ashja'i:                     I heard the Messenger of Allah (ﷺ) say: Only a ruler, or one put in charge, or one who is presumptuous, gives instructions.",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "30284",
        "20243",
        "19154",
        "18802",
        "3051"
      ]
    },
    {
      "id": "sunan-abi-daud-4110",
      "hadith_no": "4110",
      "source": "Sunan Abi Da'ud",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا محمود بن خالد، حدثنا عمر، عن الأوزاعي، في هذه القصة فقيل يا رسول الله إنه إذا يموت من الجوع فأذن له أن يدخل في كل جمعة مرتين فيسأل ثم يرجع ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by al-Auza'i through a different chain of narrators. This version adds:                      He was told: Messenger of Allah, in that case he will of starvation. So he allowed him to visit (the cit) twice a week so that he might ask for food and go back.",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "3"
      ]
    },
    {
      "id": "sunan-abi-daud-4381",
      "hadith_no": "4381",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا محمود بن خالد، حدثنا عمر بن عبد الواحد، عن الأوزاعي، قال حدثني أبو عمار، حدثني أبو أمامة، أن رجلا، أتى النبي صلى الله عليه وسلم فقال يا رسول الله إني أصبت حدا فأقمه على ‏.‏ قال ‏\"‏ توضأت حين أقبلت ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ هل صليت معنا حين صلينا ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ اذهب فإن الله تعالى قد عفا عنك ‏\"‏ ‏.‏",
      "text_en": " Abu ‘Umamah said :                     A man came to the prophet (ﷺ) and said : Messenger of Allah ! I have committed a crime which involves prescribed punishment so inflict it on me . He said : Have you not performed ablution when you came? He said : Yes, He said: Have you not prayed with us when we prayed ? He said : Yes .He then said : Go off, for Allah, the Exalted, forgave you.",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "27536",
        "20024",
        "4048"
      ]
    },
    {
      "id": "sunan-abi-daud-4522",
      "hadith_no": "4522",
      "source": "Sunan Abi Da'ud",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا محمود بن خالد، وكثير بن عبيد، قالا حدثنا ح، وحدثنا محمد بن الصباح بن سفيان، أخبرنا الوليد، عن أبي عمرو، عن عمرو بن شعيب، عن رسول الله صلى الله عليه وسلم أنه قتل بالقسامة رجلا من بني نصر بن مالك ببحرة الرغاء على شط لية البحرة قال القاتل والمقتول منهم ‏.‏ وهذا لفظ محمود ببحرة أقامه محمود وحده على شط لية البحرة ‏.‏",
      "text_en": " Narrated 'Amr b. Shu'aib:                     The Messenger of Allah (ﷺ) killed a man of Banu Nadr ibn Malik at Harrah ar-Righa' at the bank of Layyat al-Bahrah. The transmitter Mahmud (ibn Khalid) also mentioned the words along with the words \"at Bahrah\" \"the slayer and the slain were from among them\". Mahmud alone transmitted in this tradition the words \"at the bank of Layyah\".",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "38462",
        "30269",
        "20733",
        "19934"
      ]
    },
    {
      "id": "sunan-abi-daud-4567",
      "hadith_no": "4567",
      "source": "Sunan Abi Da'ud",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا محمود بن خالد السلمي، حدثنا مروان، - يعني ابن محمد - حدثنا الهيثم بن حميد، حدثني العلاء بن الحارث، حدثني عمرو بن شعيب، عن أبيه، عن جده، قال قضى رسول الله صلى الله عليه وسلم في العين القائمة السادة لمكانها بثلث الدية ‏.‏",
      "text_en": " Narrated 'Amr b. Suh'aib:                     On his father's authority, said that his grandfather said: The Messenger of Allah (ﷺ) gave judgment that a third of the blood-wit should be paid for an eye fixed in its place.",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "20640",
        "20744",
        "10884",
        "19934",
        "19911"
      ]
    },
    {
      "id": "sunan-abi-daud-4697",
      "hadith_no": "4697",
      "source": "Sunan Abi Da'ud",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا محمود بن خالد، حدثنا الفريابي، عن سفيان، قال حدثنا علقمة بن مرثد، عن سليمان بن بريدة، عن ابن يعمر، بهذا الحديث يزيد وينقص قال فما الإسلام قال ‏\"‏ إقام الصلاة وإيتاء الزكاة وحج البيت وصوم شهر رمضان والاغتسال من الجنابة ‏\"‏ ‏.‏ قال أبو داود علقمة مرجئ ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Ibn Ya’mur, with additions and omissions, through a different chain of narrators. This version adds; He asked :                      What is Islam? He replied : It means saying prayer, payment of zakat, performing HAJJ, fasting during RAMADAN, and taking a bath on account of sexual defilement.Abu Dawud said: 'Alqamah was a Murji'i.",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "20034",
        "20012",
        "11374",
        "10916"
      ]
    },
    {
      "id": "sunan-abi-daud-4706",
      "hadith_no": "4706",
      "source": "Sunan Abi Da'ud",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا محمود بن خالد، حدثنا الفريابي، عن إسرائيل، حدثنا أبو إسحاق، عن سعيد بن جبير، عن ابن عباس، قال حدثنا أبى بن كعب، قال سمعت رسول الله صلى الله عليه وسلم يقول في قوله ‏{‏ وأما الغلام فكان أبواه مؤمنين ‏}‏ ‏\"‏ وكان طبع يوم طبع كافرا ‏\"‏ ‏.‏",
      "text_en": " Ubayy b. Ka’b said :                      I heard the Messenger of Allah (May peace be upon him) explaining the verse “As for the youth his parents were people of Faith,” he was created infidel the day when he was created.",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "20034",
        "20311",
        "11049",
        "11050",
        "17",
        "39"
      ]
    },
    {
      "id": "sunan-abi-daud-4925",
      "hadith_no": "4925",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا محمود بن خالد، حدثنا أبي، حدثنا مطعم بن المقدام، قال حدثنا نافع، قال كنت ردف ابن عمر إذ مر براع يزمر فذكر نحوه ‏.‏ قال أبو داود أدخل بين مطعم ونافع سليمان بن موسى ‏.‏",
      "text_en": " Nafi said :                      I was sitting behind Ibn ‘Umar on the mount when he passed a shepherd who was blowing a pipe. He then mentioned the rest of the tradition in a similar manner.Abu Dawud said : Between Mut’im and Nafi the name of a narrator Sulaiman b. Musa has been inserted.",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "11014"
      ]
    },
    {
      "id": "sunan-abi-daud-5119",
      "hadith_no": "5119",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا محمود بن خالد الدمشقي، حدثنا الفريابي، حدثنا سلمة بن بشر الدمشقي، عن بنت واثلة بن الأسقع، أنها سمعت أباها، يقول قلت يا رسول الله ما العصبية قال ‏\"‏ أن تعين قومك على الظلم ‏\"‏ ‏.‏",
      "text_en": " Narrated Wathilah ibn al-Asqa':                     I asked: Messenger of Allah! what is party spirit? He replied: That you should help your people in wrongdoing.",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "20034"
      ]
    },
    {
      "id": "sunan-an-nasai-602",
      "hadith_no": "602",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا محمود بن خالد، قال حدثنا الوليد، قال حدثنا ابن جابر، قال حدثني نافع، قال خرجت مع عبد الله بن عمر في سفر يريد أرضا له فأتاه آت فقال إن صفية بنت أبي عبيد لما بها فانظر أن تدركها ‏.‏ فخرج مسرعا ومعه رجل من قريش يسايره وغابت الشمس فلم يصل الصلاة وكان عهدي به وهو يحافظ على الصلاة فلما أبطأ قلت الصلاة يرحمك الله ‏.‏ فالتفت إلى ومضى حتى إذا كان في آخر الشفق نزل فصلى المغرب ثم أقام العشاء وقد توارى الشفق فصلى بنا ثم أقبل علينا فقال إن رسول الله صلى الله عليه وسلم كان إذا عجل به السير صنع هكذا ‏.‏",
      "text_en": " Nafi' said:                      \"I went out with 'Abdullah bin 'Umar on a journey to some of his land. Then someone came to him and said: 'Safiyyah bint Abi 'Ubaid is sick, try to get there before it is too late.' He set out quickly, accompanied by a man of the Quraish. The sun set but he did not pray, although I knew him to be very careful about praying on time. When he slowed down I said: 'The prayer, may Allah have mercy on you.' He turned to me but carried on until the twilight was almost gone, then he stopped and prayed Maghrib, then he said the Iqamah for 'Isha', at that time the twilight had totally disappeared and led us in prayer. Then he turned to us and said: 'If the Messenger of Allah (ﷺ) was in a hurry to travel he would do this.'\"",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "20733",
        "11014"
      ]
    },
    {
      "id": "sunan-an-nasai-1337",
      "hadith_no": "1337",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا محمود بن خالد، قال حدثنا الوليد، عن أبي عمرو الأوزاعي، قال حدثني شداد أبو عمار، أن أبا أسماء الرحبي، حدثه أنه، سمع ثوبان، مولى رسول الله صلى الله عليه وسلم يحدث أن رسول الله صلى الله عليه وسلم كان إذا انصرف من صلاته استغفر ثلاثا وقال ‏\"‏ اللهم أنت السلام ومنك السلام تباركت يا ذا الجلال والإكرام ‏\"‏ ‏.‏",
      "text_en": " Thawban, the freed slave of the Messenger of Allah (ﷺ), narrated that:                     When he finished the prayer, the Messenger of Allah (ﷺ) would pray for forgiveness three times and say: 'Allahumma anta asalam, wa minka as-salam tabarakta ya dhal-jalali wal-ikram (O Allah, You are the source of eace (or the One free from all faults) and from You comes peace, blessed are You, O Possessor of Majesty and Honor).\"",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "20733",
        "10881",
        "10883"
      ]
    },
    {
      "id": "sunan-an-nasai-Grade-16",
      "hadith_no": "Grade",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرنا محمود بن خالد، عن الوليد، قال حدثنا عبد الله بن العلاء، أنه سمع القاسم بن محمد بن أبي بكر، أنهم ذكروا غسل يوم الجمعة عند عائشة فقالت إنما كان الناس يسكنون العالية فيحضرون الجمعة وبهم وسخ فإذا أصابهم الروح سطعت أرواحهم فيتأذى بها الناس فذكر ذلك لرسول الله صلى الله عليه وسلم فقال ‏\"‏ أولا يغتسلون ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah bin Al-'Ala narrated that:                     He heard Al-Qasim bin Muhammad bin Abi Bakr (say) that they mentioned Ghusl on Fridays in the presence of 'Aishah and she said: \"Some people used to live in Al-'Aliyah and they would come to Jumu'ah with dirt on them (because of their work). When a breeze came it would carry their smell to the people which annoyed them. Mention of that was made to the Messenger of Allah (ﷺ) and he said: \"Why don't you perform ghusl?\"",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "20733",
        "20399",
        "10535"
      ]
    },
    {
      "id": "sunan-an-nasai-Grade-35",
      "hadith_no": "Grade",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرنا محمود بن خالد، قال حدثني عمر بن عبد الواحد، قال سمعت يحيى بن الحارث، يحدث عن أبي الأشعث الصنعاني، عن أوس بن أوس الثقفي، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ من غسل واغتسل وابتكر وغدا ودنا من الإمام وأنصت ثم لم يلغ كان له بكل خطوة كأجر سنة صيامها وقيامها ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Aws bin Aws Ath-Thaqafi that :                     The Messenger of Allah (ﷺ) said: \"Whoever washes (ghassala) and performs ghusl, and comes early to the masjid and sits near the imam, is attentive and does not engage in idle talk, for every step he takes he will have (the reward of) a year's worth of good deeds, its fasting and Qiyam prayer.\"",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "27536",
        "19894",
        "10917",
        "3214"
      ]
    },
    {
      "id": "sunan-an-nasai-1479",
      "hadith_no": "1479",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "أخبرني محمود بن خالد، عن مروان، قال حدثني معاوية بن سلام، قال حدثنا يحيى بن أبي كثير، عن أبي سلمة بن عبد الرحمن، عن عبد الله بن عمرو، قال خسفت الشمس على عهد رسول الله صلى الله عليه وسلم فأمر فنودي الصلاة جامعة فصلى رسول الله صلى الله عليه وسلم بالناس ركعتين وسجدة ثم قام فصلى ركعتين وسجدة ‏.‏ قالت عائشة ما ركعت ركوعا قط ولا سجدت سجودا قط كان أطول منه ‏.‏ خالفه محمد بن حمير ‏.‏",
      "text_en": " It was narrated that Abdullah bin 'Amr said:                     \"The sun was eclipsed during the time of the Messenger of Allah (ﷺ), so he issued orders that the call be given: 'As-salatu jam'iah. The Messenger of Allah (ﷺ) led the people in prayer, bowing twice and prostrating twice. Then he stood and prayed, bowing twice and prostrating once. 'Aishah said: 'I never bowed or prostrated for so long as that.'\"",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "20201",
        "20401",
        "11449",
        "10567",
        "29"
      ]
    },
    {
      "id": "sunan-an-nasai-1528",
      "hadith_no": "1528",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Praying for Rain (Al-Istisqa') - كتاب الاستسقاء",
      "chapter_no": "17",
      "text_ar": "أخبرنا محمود بن خالد، قال حدثنا الوليد بن مسلم، قال أنبأنا أبو عمرو الأوزاعي، عن إسحاق بن عبد الله، عن أنس بن مالك، قال أصاب الناس سنة على عهد رسول الله صلى الله عليه وسلم فبينا رسول الله صلى الله عليه وسلم يخطب على المنبر يوم الجمعة فقام أعرابي فقال يا رسول الله هلك المال وجاع العيال فادع الله لنا ‏.‏ فرفع رسول الله صلى الله عليه وسلم يديه وما نرى في السماء قزعة والذي نفسي بيده ما وضعها حتى ثار سحاب أمثال الجبال ثم لم ينزل عن منبره حتى رأيت المطر يتحادر على لحيته فمطرنا يومنا ذلك ومن الغد والذي يليه حتى الجمعة الأخرى فقام ذلك الأعرابي أو قال غيره فقال يا رسول الله تهدم البناء وغرق المال فادع الله لنا ‏.‏ فرفع رسول الله صلى الله عليه وسلم يديه فقال ‏\"‏ اللهم حوالينا ولا علينا ‏\"‏ ‏.‏ فما يشير بيده إلى ناحية من السحاب إلا انفرجت حتى صارت المدينة مثل الجوبة وسال الوادي ولم يجئ أحد من ناحية إلا أخبر بالجود ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                     \"There was a drought during the time of the Messenger of Allah (ﷺ). While the Messenger of Allah (ﷺ) was giving the Khutbah on the minbar one Friday, a Bedouin stood up and said: 'O Messenger of Allah wealth has been destroyed and our children are hungry; pray to Allah for us.' The Messenger of Allah (ﷺ) raised his hands, and we could not see even a wisp of a cloud in the sky, but by the One in Whose hand is my soul, he did not lower (his hands) before clouds like mountains appeared, and he did not come down from his minbar before we saw the rain dripping from his beard. It rained that day and the next day, and the day after, until the following Friday. Then that Bedouin\"- or he said, \"Someone else\"- \"stood up and said: 'O Messenger of Allah, buildings have been destroyed and wealth has drowned; pray to Allah (SWT) for us. The Messenger of Allah (ﷺ) raised his hands and said: 'O Allah, around us and not on us.' He did not point in any direction but the clouds dispersed, until Al-Madinah became like a hole. And the valleys ran with water and no one came from any direction but he told us of the heavy rains.\"",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "20733",
        "20024",
        "11151",
        "19"
      ]
    },
    {
      "id": "sunan-an-nasai-1780",
      "hadith_no": "1780",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا محمود بن خالد، قال حدثنا الوليد، عن أبي عمرو، عن يحيى، قال حدثني أبو سلمة، عن عائشة، أن رسول الله صلى الله عليه وسلم كان يصلي ركعتين خفيفتين بين النداء والإقامة من صلاة الفجر ‏.‏",
      "text_en": " It was narrated from Aishah that:                     The Messenger of Allah (ﷺ) used to pray two brief rak'ahs between the Adhan and Iqamah for Fajr prayer.",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "20733",
        "20031",
        "10567",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-1815",
      "hadith_no": "1815",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا محمود بن خالد، عن مروان بن محمد، قال حدثنا سعيد بن عبد العزيز، عن سليمان بن موسى، عن مكحول، عن عنبسة بن أبي سفيان، عن أم حبيبة، - قال مروان وكان سعيد إذا قرئ عليه عن أم حبيبة عن النبي صلى الله عليه وسلم أقر بذلك ولم ينكره وإذا حدثنا به هو لم يرفعه - قالت من ركع أربع ركعات قبل الظهر وأربعا بعدها حرمه الله على النار ‏.‏ قال أبو عبد الرحمن مكحول لم يسمع من عنبسة شيئا ‏.‏",
      "text_en": " It was narrated from Umm Habibah-and when this was narrated to Sa'eed from Umm Habibah from the Prophet (ﷺ), he would approve it and not deny it but when he narrated it to us, he did not attribute it to the Prophet (ﷺ)- she said:                     \"Whoever prays four rak'ahs before Zuhr and four after it, Allah (SWT) will forbid him from the Fire.\"",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "20640",
        "20638",
        "10880",
        "11066",
        "846",
        "59",
        "20201",
        "59"
      ]
    },
    {
      "id": "sunan-an-nasai-2207",
      "hadith_no": "2207",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرني محمود بن خالد، عن مروان، أنبأنا معاوية بن سلام، عن يحيى بن أبي كثير، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من قام شهر رمضان إيمانا واحتسابا غفر له ما تقدم من ذنبه ومن قام ليلة القدر إيمانا واحتسابا غفر له ما تقدم من ذنبه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah said: 'Whoever spends the nights of Ramadan in prayer (Qiyam) out of faith and in the hope of reward, he will be forgiven his previous sins, and whoever spends the night of Lailat Al-Qadr in prayer out of faith and in the hope of reward, he will be forgiven his previous sins.\"'",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "20201",
        "20401",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-2254",
      "hadith_no": "2254",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمود بن خالد، عن محمد بن شعيب، قال أخبرني يحيى بن الحارث، عن القاسم أبي عبد الرحمن، أنه حدثه عن عقبة بن عامر، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ من صام يوما في سبيل الله عز وجل باعد الله منه جهنم مسيرة مائة عام ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Uqbah bin 'Amir that the Messenger of Allah said:                     \"Whoever fasts one day in the cause of Allah, the mighty and sublime, Allah will separate him the distance of one hundred years from the fire.\"",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "20732",
        "19894",
        "11648",
        "189"
      ]
    },
    {
      "id": "sunan-an-nasai-2259",
      "hadith_no": "2259",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمود بن خالد، قال حدثنا الفريابي، قال حدثنا الأوزاعي، قال حدثني يحيى، قال أخبرني محمد بن عبد الرحمن، قال حدثني من، سمع جابرا، نحوه ‏.‏",
      "text_en": " Muhammad bin 'Abdur-Rahman said:                     \"Someone who heard it from Jabir told me something similar.\"",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "20034",
        "20024",
        "11449",
        "11105",
        "34"
      ]
    },
    {
      "id": "sunan-an-nasai-3693",
      "hadith_no": "3693",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Gifts - كتاب الهبة",
      "chapter_no": "32",
      "text_ar": "أخبرنا محمود بن خالد، قال حدثنا عمر، عن الأوزاعي، قال حدثني محمد بن علي بن حسين، قال حدثني سعيد بن المسيب، قال حدثني عبد الله بن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ مثل الذي يرجع في صدقته كمثل الكلب يرجع في قيئه فيأكله ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah bin 'Abbas said:                      \"The Messenger of Allah said: 'The likeness of the one who takes back his gift, is that of a dog which goes back to its vomit and eats it.'\"",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "3",
        "20024",
        "11442",
        "11002",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-3740",
      "hadith_no": "3740",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of 'Umra - كتاب العمرى",
      "chapter_no": "34",
      "text_ar": "أخبرنا محمود بن خالد، قال حدثنا عمر، عن الأوزاعي، حدثنا ابن شهاب، قال وأخبرني عمرو بن عثمان، أنبأنا بقية بن الوليد، عن الأوزاعي، عن الزهري، عن عروة، عن جابر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أعمر عمرى فهي له ولعقبه يرثها من يرثه من عقبه ‏\"‏ ‏.‏",
      "text_en": " Al-Awza'i narrated from Az-Zuhri, from 'Urwah, from Jabir, who said:                      \"The Messenger of Allah said: 'Whoever is given something on the basis of 'Umra, it belongs to him and to his descendants, and is inherited by those who inherit from him.'\"",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "3",
        "20024",
        "11013",
        "10581",
        "20644",
        "20024",
        "11013",
        "10511",
        "34"
      ]
    },
    {
      "id": "sunan-an-nasai-3771",
      "hadith_no": "3771",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرني محمود بن خالد، قال حدثنا الوليد، قال حدثنا أبو عمرو، عن يحيى، أنه حدثه قال حدثني أبو قلابة، قال حدثني ثابت بن الضحاك، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من حلف بملة سوى الإسلام كاذبا فهو كما قال ومن قتل نفسه بشىء عذب به في الآخرة ‏\"‏ ‏.‏",
      "text_en": " Thabit bin Ad-Dahhak narrated that the Messenger of Allah said:                      \"Whoever swears by a religion other than Islam, telling a lie, will be as he said, and whoever kills himself with something will be punished with it in the Hereafter.\"",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "20733",
        "20024",
        "11449",
        "11047",
        "1902"
      ]
    },
    {
      "id": "sunan-an-nasai-4173",
      "hadith_no": "4173",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of al-Bay'ah - كتاب البيعة",
      "chapter_no": "39",
      "text_ar": "أخبرنا محمود بن خالد، قال حدثنا مروان بن محمد، قال حدثنا عبد الله بن العلاء بن زبر، قال حدثني بسر بن عبيد الله، عن أبي إدريس الخولاني، عن حسان بن عبد الله الضمري، عن عبد الله بن السعدي، قال وفدنا على رسول الله صلى الله عليه وسلم فدخل أصحابي فقضى حاجتهم وكنت آخرهم دخولا فقال ‏\"‏ حاجتك ‏\"‏ ‏.‏ فقلت يا رسول الله متى تنقطع الهجرة قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تنقطع الهجرة ما قوتل الكفار ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin As-Sa'di said:                     \"We came in a delegation to the Messenger of Allah and my companions entered and asked their questions. I was the last of them to enter, and he said: 'What is you question?' I said: 'O Messenger of Allah, when will emigration end?' The Messenger of Allah said: 'Emigration will not cease so long as the disbelievers are being fought.\"'",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "20640",
        "20399",
        "11412",
        "11027",
        "2605"
      ]
    },
    {
      "id": "sunan-an-nasai-4831",
      "hadith_no": "4831",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرني محمود بن خالد، قال حدثنا الوليد، عن ابن جريج، عن عمرو بن شعيب، عن أبيه، عن جده، مثله سواء ‏.‏",
      "text_en": " Narrator mentioned in hadith:                     A similar report was narrated from 'Amr bin shu'aib, from his father, from his grandfather. (Daif)",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "20733",
        "11070",
        "19934",
        "19911"
      ]
    },
    {
      "id": "sunan-an-nasai-5182",
      "hadith_no": "5182",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا محمود بن خالد، قال حدثنا الوليد، قال حدثنا أبو عمرو الأوزاعي، عن يحيى، عن علي، قال نهاني رسول الله صلى الله عليه وسلم وساق الحديث ‏.‏",
      "text_en": " It was narrated that 'Ali said:                     \"The Messenger of Allah [SAW] forbade\" and he quoted the same Hadith.",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "20733",
        "20024",
        "11449",
        "5"
      ]
    },
    {
      "id": "sunan-an-nasai-5390",
      "hadith_no": "5390",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Etiquette of Judges - كتاب آداب القضاة",
      "chapter_no": "49",
      "text_ar": "أخبرني عمرو بن عثمان، قال حدثنا الوليد، عن الأوزاعي، قال أخبرني ابن شهاب، ح وأخبرني محمود بن خالد، قال حدثنا عمر، عن الأوزاعي، حدثني الزهري، عن سليمان بن يسار، أن ابن عباس، أخبره أن امرأة من خثعم استفتت رسول الله صلى الله عليه وسلم والفضل رديف رسول الله صلى الله عليه وسلم فقالت يا رسول الله إن فريضة الله عز وجل في الحج على عباده أدركت أبي شيخا كبيرا لا يستطيع أن يستوي على الراحلة فهل يجزئ قال محمود فهل يقضي - أن أحج عنه فقال لها ‏\"‏ نعم ‏\"‏‏.‏ قال أبو عبد الرحمن وقد روى هذا الحديث غير واحد عن الزهري فلم يذكر فيه ما ذكر الوليد بن مسلم‏.‏",
      "text_en": " It was narrated from Sulaiman bin Yasar that Ibn 'Abbas told him:                     \"A woman from Khath'am asked the Messenger of Allah [SAW] a question when Al-Fadl was riding behind the Messenger of Allah [SAW]. She said: 'O Messenger of Allah, the command of Allah, the Mighty and Sublime, to His slaves to perform Hajj has come while my father is an old man, he cannot sit upright in the saddle. Will it suffice if I perform Hajj on his behalf?' He said: 'Yes.'\"",
      "usc_msa_ref": "",
      "chain": [
        "10581",
        "20733",
        "20024",
        "11013",
        "37534",
        "3",
        "20024",
        "11013",
        "11005",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-5432",
      "hadith_no": "5432",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا محمود بن خالد، قال حدثنا الوليد، قال حدثنا أبو عمرو، عن يحيى، عن محمد بن إبراهيم بن الحارث، أخبرني أبو عبد الله، أن ابن عابس الجهني، أخبره أن رسول الله صلى الله عليه وسلم قال له ‏\"‏ يا ابن عابس ألا أدلك - أو قال ألا أخبرك - بأفضل ما يتعوذ به المتعوذون ‏\"‏ ‏.‏ قال بلى يا رسول الله ‏.‏ قال ‏\"‏ ‏{‏ قل أعوذ برب الفلق ‏}‏ و ‏{‏ قل أعوذ برب الناس ‏}‏ هاتين السورتين ‏\"‏ ‏.‏",
      "text_en": " Abu 'Abdullah narrated that Ibn 'Abis Al-Juhani told him that:                     The Messenger of Allah [SAW] said to him: \"O Ibn 'Abis, shall I not tell you of the best thing with which those who seek refuge with Allah may do so?\" He said: \"Yes, O Messenger of Allah.\" He said: \"Say: I seek refuge with (Allah) the Lord of the daybreak.\", \"Say: I seek refuge with (Allah) the Lord of mankind.\" - these two Surahs.\"",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "20733",
        "20024",
        "11449",
        "11213",
        "30184"
      ]
    },
    {
      "id": "sunan-an-nasai-5437",
      "hadith_no": "5437",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرني محمود بن خالد، قال حدثنا الوليد، قال حدثني ابن جابر، عن القاسم أبي عبد الرحمن، عن عقبة بن عامر، قال بينا أقود برسول الله صلى الله عليه وسلم في نقب من تلك النقاب إذ قال ‏\"‏ ألا تركب يا عقبة ‏\"‏ ‏.‏ فأجللت رسول الله صلى الله عليه وسلم أن أركب مركب رسول الله صلى الله عليه وسلم ثم قال ‏\"‏ ألا تركب يا عقبة ‏\"‏ ‏.‏ فأشفقت أن يكون معصية فنزل وركبت هنيهة ونزلت وركب رسول الله صلى الله عليه وسلم ثم قال ‏\"‏ ألا أعلمك سورتين من خير سورتين قرأ بهما الناس ‏\"‏ ‏.‏ فأقرأني ‏{‏ قل أعوذ برب الفلق ‏}‏ و ‏{‏ قل أعوذ برب الناس ‏}‏ فأقيمت الصلاة فتقدم فقرأ بهما ثم مر بي فقال ‏\"‏ كيف رأيت يا عقبة بن عامر اقرأ بهما كلما نمت وقمت ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Uqbah bin 'Amir said:                     \"While I was leading the Messenger of Allah [SAW] (on his mount) in one of these mountain passes, he said: 'Why don't you ride, O 'Uqbah?' I had too much respect for the Messenger of Allah [SAW] to ride the mount of the Messenger of Allah [SAW]. Then he said: 'Why don't you ride, O 'Uqbah?' I was worried that I might be disobeying him, so he got off, and I rode for a little while, then I got off and the Messenger of Allah [SAW] rode. Then he said: 'Shall I not teach you two of the best Surahs that the people recite?' And he taught me: 'Say: I seek refuge with (Allah) the Lord of the daybreak,' and 'Say: I seek refuge with (Allah) the Lord of mankind.\" Then the Iqamah was said and he went forward and recited them. Then he passed by me and said: 'What do you think, O 'Uqbah bin 'Amir? Recite them every time you go to sleep and get up.'\"",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "20733",
        "11648",
        "189"
      ]
    },
    {
      "id": "sunan-an-nasai-5461",
      "hadith_no": "5461",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "قال أخبرني محمود بن خالد، قال حدثنا الوليد، عن أبي عمرو، - وهو الأوزاعي - قال حدثني إسحاق بن عبد الله بن أبي طلحة، قال حدثني جعفر بن عياض، قال حدثني أبو هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ تعوذوا بالله من الفقر والقلة والذلة وأن تظلم أو تظلم ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah said:                     \"The Messenger of Allah [SAW] said: 'Seek refuge with Allah from poverty, want, humiliation and wronging others or being wronged.'\"",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "20733",
        "11151",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-5463",
      "hadith_no": "5463",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا محمود بن خالد، قال حدثنا عمر، - يعني ابن عبد الواحد - عن الأوزاعي، قال حدثني إسحاق بن عبد الله، قال حدثني جعفر بن عياض، قال حدثني أبو هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ تعوذوا بالله من الفقر ومن القلة ومن الذلة وأن أظلم أو أظلم ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah said:                     \"The Messenger of Allah [SAW] said: 'Seek refuge with Allah from poverty, want and humiliation, and from wronging others or being wronged.'\"",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "27536",
        "20024",
        "11151",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-5518",
      "hadith_no": "5518",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا محمود بن خالد، قال حدثنا الوليد، قال حدثنا أبو عمرو، عن يحيى، أنه حدثه قال أخبرني أبو سلمة، قال حدثني أبو هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ تعوذوا بالله من عذاب النار وعذاب القبر ومن فتنة المحيا والممات ومن شر المسيح الدجال ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah said:                     The Messenger of Allah [SAW] said: \"Seek refuge with Allah from the torment of the Fire and the torment of the grave, from the trials of life and death, and from the evil of Al-Masihid-Dajjal.\"",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "20733",
        "20024",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-447",
      "hadith_no": "447",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمود بن خالد الدمشقي، حدثنا الوليد بن مسلم الدمشقي، عن ابن ثوبان، عن عبدة بن أبي لبابة، عن شقيق بن سلمة، قال رأيت عثمان وعليا يتوضآن ثلاثا ثلاثا ويقولان هكذا كان وضوء رسول الله  صلى الله عليه وسلم  ‏.‏",
      "text_en": " It was narrated that Shaqiq bin Salamah said:                     \"I saw 'Uthman and 'Ali performing ablution, washing each part three times, and they said: 'This is how the Messenger of Allah used to perform ablution.'\" (Hasan)Another chain with similar wording.",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "20733",
        "10793",
        "11353"
      ]
    },
    {
      "id": "sunan-ibn-majah-563",
      "hadith_no": "563",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمود بن خالد، والعباس بن الوليد الدمشقيان، قالا حدثنا مروان بن محمد، حدثنا رشدين، أنبأنا معاوية بن صالح، عن راشد بن سعد، عن أبي أمامة الباهلي، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن الماء لا ينجسه شىء إلا ما غلب على ريحه وطعمه ولونه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Umamah Al-Bahili said:                     \"The Messenger of Allah said: 'Water is not made impure by anything except that which changes its smell, taste and color.'\"",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "20640",
        "20675",
        "19909",
        "4048"
      ]
    },
    {
      "id": "sunan-ibn-majah-2727",
      "hadith_no": "2727",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا محمود بن خالد الدمشقي، حدثنا أبي، حدثنا محمد بن راشد، عن سليمان بن موسى، عن عمرو بن شعيب، عن أبيه، عن جده، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من قتل عمدا دفع إلى أولياء القتيل فإن شاءوا قتلوا وإن شاءوا أخذوا الدية وذلك ثلاثون حقة وثلاثون جذعة وأربعون خلفة وذلك عقل العمد ما صولحوا عليه فهو لهم وذلك تشديد العقل ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from this father, from his grandfather that the Messenger of Allah (ﷺ) said:                     “Whoever kills deliberately, he will be handed over to the heirs of the victim. If they want, they may kill him, or if they want, they may accept the blood money, which is thirty Hiqqah, thirty Jadha'ah and forty Khalifah. This is the blood money for deliberate slaying. Whatever is settled by reconciliation belongs to them, and that is a binding covenant.”",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "20719",
        "10880",
        "19934",
        "19911"
      ]
    },
    {
      "id": "sunan-ibn-majah-4155",
      "hadith_no": "4155",
      "source": "Sunan Ibn Majah",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا محمود بن خالد الدمشقي، حدثنا سليمان بن عبد الرحمن أبو أيوب، عن ابن أبي مالك، عن أبيه، عن عطاء بن أبي رباح، عن عبد الله بن عمر، قال أقبل علينا رسول الله  صلى الله عليه وسلم  فقال ‏\"‏ يا معشر المهاجرين خمس إذا ابتليتم بهن وأعوذ بالله أن تدركوهن لم تظهر الفاحشة في قوم قط حتى يعلنوا بها إلا فشا فيهم الطاعون والأوجاع التي لم تكن مضت في أسلافهم الذين مضوا ‏.‏ ولم ينقصوا المكيال والميزان إلا أخذوا بالسنين وشدة المؤنة وجور السلطان عليهم ‏.‏ ولم يمنعوا زكاة أموالهم إلا منعوا القطر من السماء ولولا البهائم لم يمطروا ولم ينقضوا عهد الله وعهد رسوله إلا سلط الله عليهم عدوا من غيرهم فأخذوا بعض ما في أيديهم ‏.‏ وما لم تحكم أئمتهم بكتاب الله ويتخيروا مما أنزل الله إلا جعل الله بأسهم بينهم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that ‘Abdullah bin ‘Umar said:                      “The MessengerofAllah (ﷺ) turned to us and said: ‘O Muhajirun, there are fivethingswith which you will be tested, and I seek refuge with Allahlest youlive to see them: Immorality never appears among a people tosuch anextent that they commit it openly, but plagues and diseasesthat werenever known among the predecessors will spread among them.They do notcheat in weights and measures but they will be strickenwith famine,severe calamity and the oppression of their rulers. Theydo notwithhold the Zakah of their wealth, but rain will be withheldfrom thesky, and were it not for the animals, no rain would fall onthem. Theydo not break their covenant with Allah and His Messenger,but Allahwill enable their enemies to overpower them and take someof what isin their hands. Unless their leaders rule according to theBook ofAllah and seek all good from that which Allah has revealed,Allah willcause them to fight one another.’”",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "11029",
        "18"
      ]
    }
  ],
  "total_hadiths": 73
}