{
  "id": "37540",
  "name": "Hisham bin Khalid bin Yazid al-Azraq هشام بن خالد بن زيد بن مروان الأزرق",
  "full_name": "Hisham bin Khalid bin Yazid al-Azraq هشام بن خالد بن زيد بن مروان الأزرق",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "249",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Damascus"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ د  ق  -  صدوق ]"
    ],
    "tags": [
      "al-Damashqi",
      "Client"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20733",
      "name": "al-Walid bin Muslim al-Quraishi الوليد بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20644",
      "name": "Baqiyya bin al-Walid bin Sa'aid بقية بن الوليد بن صائد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "27503",
      "name": "al-Hasan bin Yahya al-Khushni الحسن بن يحيى الخشني",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20201",
      "name": "Marwan bin Mua'wiya al-Fazari مروان بن معاوية الفزاري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "27508",
      "name": "Khalid bin Yazid bin 'Abdur Rahamn خالد بن يزيد بن عبد الرحمن بن أبي مالك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "27517",
      "name": "Suwayd bin 'Abdul 'Aziz سويد بن عبد العزيز بن نمير",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20239",
      "name": "Shu'aib bin Ishaq bin 'Abdur Rahman شعيب بن إسحاق بن عبد الرحمن",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20738",
      "name": "Dmrh bin Rabi'ya al-Flstyny ضمرة بن ربيعة الفلسطيني أبو عبد الله",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20732",
      "name": "Muhammad bin Shu'aib bin Shabur محمد بن شعيب بن شابور",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "30004",
      "name": "Ibn Maja ابن ماجة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38383",
      "name": "'Uthman bin 'Abdullah عثمان بن عبد الله بن محمد بن خرزاذ",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "37544",
      "name": "Yazid bin Muhammad يزيد بن محمد بن عبد الصمد",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "123",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمود بن خالد، وهشام بن خالد، - المعنى - قالا حدثنا الوليد، بهذا الإسناد قال ومسح بأذنيه ظاهرهما وباطنهما ‏.‏ زاد هشام وأدخل أصابعه في صماخ أذنيه ‏.‏",
      "text_en": " Another version says:                      He wiped his ears inside and outside. Hisham adds: He inserted his fingers in the ear-holes.",
      "chain": [
        "37534",
        "37540",
        "20733"
      ]
    },
    {
      "hadith_no": "2539",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا هشام بن خالد الدمشقي، حدثنا الوليد، عن معاوية بن أبي سلام، عن أبيه، عن جده أبي سلام، عن رجل، من أصحاب النبي صلى الله عليه وسلم قال ‏:‏ أغرنا على حى من جهينة فطلب رجل من المسلمين رجلا منهم فضربه فأخطأه وأصاب نفسه بالسيف فقال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏ أخوكم يا معشر المسلمين ‏\"‏ ‏.‏ فابتدره الناس فوجدوه قد مات، فلفه رسول الله صلى الله عليه وسلم بثيابه ودمائه وصلى عليه ودفنه، فقالوا ‏:‏ يا رسول الله أشهيد هو قال ‏:‏ ‏\"‏ نعم، وأنا له شهيد ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuSalam:                     AbuSalam reported on the authority of a man from the companion of the Prophet (ﷺ). He said: We attacked a tribe of Juhaynah. A man from the Muslims pursued a man of them, and struck him but missed him. He struck himself with the sword. The Messenger of Allah (ﷺ) said: Your brother, O group of Muslims. The people hastened towards him, but found him dead. The Messenger of Allah (ﷺ) wrapped him with his clothes and his blood, and offered (funeral) prayer for him and buried him. They said: Messenger of Allah, is he a martyr? He said: Yes, and I am witness to him.",
      "chain": [
        "37540",
        "20733"
      ]
    },
    {
      "hadith_no": "2541",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا هشام بن خالد أبو مروان، وابن المصفى، قالا حدثنا بقية، عن ابن ثوبان، عن أبيه، يرد إلى مكحول إلى مالك بن يخامر أن معاذ بن جبل، حدثهم أنه، سمع رسول الله صلى الله عليه وسلم يقول ‏:‏ ‏\"‏ من قاتل في سبيل الله فواق ناقة فقد وجبت له الجنة، ومن سأل الله القتل من نفسه صادقا ثم مات أو قتل فإن له أجر شهيد ‏\"‏ ‏.‏ زاد ابن المصفى من هنا ‏:‏ ‏\"‏ ومن جرح جرحا في سبيل الله أو نكب نكبة فإنها تجيء يوم القيامة كأغزر ما كانت، لونها لون الزعفران، وريحها ريح المسك، ومن خرج به خراج في سبيل الله فإن عليه طابع الشهداء ‏\"‏ ‏.‏",
      "text_en": " Narrated Mu'adh ibn Jabal:                     The Messenger of Allah (ﷺ) said: If anyone fights in Allah's path as long as the time between two milkings of a she-camel, Paradise will be assured for him. If anyone sincerely asks Allah for being killed and then dies or is killed, there will be a reward of a martyr for him. Ibn al-Musaffa added from here: If anyone is wounded in Allah's path, or suffers a misfortune, it will come on the Day of resurrection as copious as possible, its colour saffron, and its odour musk; and if anyone suffers from ulcers while in Allah's path, he will have on him the stamp of the martyrs.",
      "chain": [
        "37540",
        "20644",
        "32"
      ]
    },
    {
      "hadith_no": "525",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا هشام بن خالد الأزرق، حدثنا خالد بن يزيد بن أبي مالك، عن أبيه، عن أنس بن مالك، قال كان يضع يديه على أذنيه ويقول صمتا إن لم أكن سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ توضئوا مما مست النار ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Anas bin Malik would place his hands over his ears and say:                     \"May my ears be made deaf, if I did not hear the messenger of Allah saying: 'Perform ablution after (eating) that which has been changed by fire.'\"",
      "chain": [
        "37540",
        "27508",
        "17551",
        "19"
      ]
    },
    {
      "hadith_no": "584",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا هشام بن خالد الأزرق، حدثنا الحسن بن يحيى الخشني، حدثنا زيد بن واقد، عن بسر بن عبيد الله، عن أبي إدريس الخولاني، عن أبي الدرداء، قال خرج علينا رسول الله  صلى الله عليه وسلم  ورأسه يقطر ماء فصلى بنا في ثوب واحد متوشحا به قد خالف بين طرفيه فلما انصرف قال عمر بن الخطاب يا رسول الله تصلي بنا في ثوب واحد قال ‏\"‏ نعم أصلي فيه وفيه ‏\"‏ ‏.‏ أى قد جامعت فيه ‏.‏",
      "text_en": " It was narrated that Abu Darda' said:                     \"The Messenger of Allah came out to us with water dripping from his head, and he led us in prayer wearing a single garment, placing its one end on the right shoulder, and the other end on the other shoulder. When he finished praying, 'Umar bin Khattab said to him: 'O Messenger of Allah, did you lead us in prayer wearing a single garment? He said: 'Yes, I perform prayer in it, and in it I (i.e. I had sexual intercourse in it).\"",
      "chain": [
        "37540",
        "27503",
        "11671",
        "11412",
        "11027",
        "37"
      ]
    },
    {
      "hadith_no": "2525",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Charity - كتاب الصدقات",
      "chapter_no": "15",
      "text_ar": "حدثنا عبيد الله بن عبد الكريم، حدثنا هشام بن خالد، حدثنا خالد بن يزيد بن أبي مالك، وحدثنا أبو حاتم، حدثنا هشام بن خالد، حدثنا خالد بن يزيد بن أبي مالك، عن أبيه، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ رأيت ليلة أسري بي على باب الجنة مكتوبا الصدقة بعشر أمثالها والقرض بثمانية عشر ‏.‏ فقلت يا جبريل ما بال القرض أفضل من الصدقة ‏.‏ قال لأن السائل يسأل وعنده والمستقرض لا يستقرض إلا من حاجة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Anas bin Malik that the Messenger of Allah (ﷺ) said:                     “On the night on which I was taken on the Night Journey (Isra), I saw written at the gate of Paradise: 'Charity brings a tenfold reward and a loan brings an eighteen fold reward.' I said: 'O Jibril! Why is a loan better than charity?' He said: 'Because the beggar asks when he has something, but the one who asks for loan does so only because he is in need.' ”",
      "chain": [
        "37540",
        "27508",
        "38473",
        "37540",
        "27508",
        "17551",
        "19"
      ]
    },
    {
      "hadith_no": "3803",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا هشام بن خالد الأزرق أبو مروان، حدثنا الوليد بن مسلم، حدثنا زهير بن محمد، عن منصور بن عبد الرحمن، عن أمه، صفية بنت شيبة عن عائشة، قالت كان رسول الله  صلى الله عليه وسلم  إذا رأى ما يحب قال ‏\"‏ الحمد لله الذي بنعمته تتم الصالحات ‏\"‏ ‏.‏ وإذا رأى ما يكره قال ‏\"‏ الحمد لله على كل حال ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"When the Messenger of Allah (ﷺ) saw something he liked, he would say: 'Al-hamdu lillahil-ladhi bi ni'matihi tatimmus-salihat (Praise is to Allah by Whose grace good deeds are completed).' And if he saw something that he disliked, he would say: 'Al-hamdu lillahi 'ala kulli hal (Praise is to Allah in all circumstances).'\"",
      "chain": [
        "37540",
        "20733",
        "20394",
        "11565",
        "2802",
        "53"
      ]
    }
  ],
  "total_hadiths": 7
}