{
  "id": "37544",
  "name": "Yazid bin Muhammad يزيد بن محمد بن عبد الصمد",
  "full_name": "Yazid bin Muhammad يزيد بن محمد بن عبد الصمد",
  "grade": "3rd Century AH [11th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "277",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Damascus"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ د  س  -  صدوق ]"
    ],
    "tags": [
      "Quraish",
      "Client",
      "al-Damashqi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "560",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرني يزيد بن محمد بن عبد الصمد، قال حدثنا هشام العطار، قال حدثنا إسماعيل، - وهو ابن سماعة - عن موسى بن أعين، عن أبي عمرو الأوزاعي، عن الزهري، عن أبي سلمة، عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏\"‏ من أدرك من الصلاة ركعة فقد أدرك الصلاة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Prophet (ﷺ) said:                      \"Whoever catches up with a Rak'ah of the prayer, then he has caught up with the prayer.\"",
      "chain": [
        "37544",
        "20465",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1812",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرني يزيد بن محمد بن عبد الصمد، قال حدثنا هشام العطار، قال حدثني إسماعيل بن عبد الله بن سماعة، عن موسى بن أعين، عن أبي عمرو الأوزاعي، عن حسان بن عطية، قال لما نزل بعنبسة جعل يتضور فقيل له فقال أما إني سمعت أم حبيبة زوج النبي صلى الله عليه وسلم تحدث عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ من ركع أربع ركعات قبل الظهر وأربعا بعدها حرم الله عز وجل لحمه على النار ‏\"‏ ‏.‏ فما تركتهن منذ سمعتهن ‏.‏",
      "text_en": " It was narrated that Hassan bin 'Atiyyah said:                     \"When 'Anbasah was dying, he started to groan in pain. The people spoke to him and he said: 'I heard Umm Habibah, the wife of the Prophet (ﷺ) narrating that the Prophet (ﷺ) said: Whoever prays four rak'ahs before Zuhr and four after, Allah, the Mighty and Sublime, will forbid his flesh for the Fire. And I never stopped praying them from the time I heard that.'\"",
      "chain": [
        "37544",
        "20465",
        "11413"
      ]
    }
  ],
  "total_hadiths": 2
}