{
  "id": "38001",
  "name": "Ahmed bin al-Azhar bin Mny' أحمد بن الأزهر بن منيع",
  "full_name": "Ahmed bin al-Azhar bin Mny' أحمد بن الأزهر بن منيع",
  "grade": "3rd Century AH [11th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "263",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Nisapur"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ س  ق  -  ثقة ثبت ]"
    ],
    "tags": [
      "al-'Abdi",
      "al-Nisapuri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "2334",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا أحمد بن الأزهر، قال حدثنا عبد الرزاق، عن ابن جريج، عن ابن شهاب، عن سالم، عن ابن عمر، عن حفصة، أن النبي صلى الله عليه وسلم قال ‏\"‏ من لم يبيت الصيام من الليل فلا صيام له ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Hafsah that the Prophet said:                     \"Whoever does not have the intention of fasting from the night before, then there is no fast for him.\" (Daif)",
      "chain": [
        "38001",
        "20121",
        "11070",
        "11013",
        "11011",
        "18",
        "54"
      ]
    },
    {
      "hadith_no": "2931",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا أحمد بن الأزهر، قال حدثنا محمد بن عبد الله الأنصاري، قال حدثنا أشعث، عن الحسن، عن أنس، قال خرج رسول الله صلى الله عليه وسلم وخرجنا معه فلما بلغ ذا الحليفة صلى الظهر ثم ركب راحلته فلما استوت به على البيداء أهل بالحج والعمرة جميعا فأهللنا معه فلما قدم رسول الله صلى الله عليه وسلم مكة وطفنا أمر الناس أن يحلوا فهاب القوم فقال لهم رسول الله صلى الله عليه وسلم ‏\"‏ لولا أن معي الهدى لأحللت ‏\"‏ ‏.‏ فحل القوم حتى حلوا إلى النساء ولم يحل رسول الله صلى الله عليه وسلم ولم يقصر إلى يوم النحر ‏.‏",
      "text_en": " It was narrated that Anas said:                     \"The Messenger of Allah set out and we set out with him. When he reached Dhul-Hulaifah he prayed Zuhr, then he rode his mount, and when it stood up with him at Al-Baida, he initiated Ihram for Hajj and Umrah together, and we initiated Ihram with him. When the Messenger of Allah came to Makkah and we had performed Tawaf, he told the people to exit Ihram but they hesitated. The Messenger of Allah said to them: 'Were it not for the fact that I have the Hadi with me, I would have exited Ihra.' So the people exited Ihram completely, such that intimacy with their wives became permissible. But the Messenger of Allahd did not exit Ihram, and he did not cut his hair until the Day of Sacrifice.\"",
      "chain": [
        "38001",
        "20280",
        "11324",
        "11016",
        "19"
      ]
    },
    {
      "hadith_no": "3655",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Wills - كتاب الوصايا",
      "chapter_no": "30",
      "text_ar": "أخبرنا أحمد بن الأزهر، قال حدثنا روح بن عبادة، قال حدثنا زكريا بن إسحاق، قال حدثنا عمرو بن دينار، عن عكرمة، عن ابن عباس، أن رجلا، قال يا رسول الله إن أمه توفيت أفينفعها إن تصدقت عنها قال ‏\"‏ نعم ‏\"‏‏.‏ قال فإن لي مخرفا فأشهدك أني قد تصدقت به عنها‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that a man said:                      \"O Messenger of Allah, my mother died; will it benefit her if I give in charity on her behalf?\" He said: \"Yes.\" He said: \"I have a garden and I ask you to bear witness that I am giving it in charity on her behalf.\"",
      "chain": [
        "38001",
        "20229",
        "11244",
        "11081",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "4945",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرنا أبو الأزهر النيسابوري، قال حدثنا محمد بن يوسف، قال حدثنا سفيان، عن منصور، عن الحكم، عن مجاهد، عن أيمن، قال لم تقطع اليد في زمن رسول الله صلى الله عليه وسلم إلا في ثمن المجن وقيمة المجن يومئذ دينار ‏.‏",
      "text_en": " It was narrated that Ayman said:                     \"The hand of a thief was not be cut off during the time of the Messenger of Allah except for the value of a shield, and the value of a shield in those days was a Dinar.\" (Daif)",
      "chain": [
        "38001",
        "30388",
        "20005",
        "11067",
        "11069",
        "11028"
      ]
    },
    {
      "hadith_no": "75",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا أحمد بن الأزهر، حدثنا أبو النضر، حدثنا أبو جعفر، عن يونس، عن الحسن، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ أمرت أن أقاتل الناس حتى يشهدوا أن لا إله إلا الله وأني رسول الله ويقيموا الصلاة ويؤتوا الزكاة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah (ﷺ) said: 'I have been commanded to fight the people until they testify to La ilaha ill-allah (none has the right to be worshipped but Allah) and that I am the Messenger of Allah, and establish regular prayers and pay Zakat.'\"",
      "chain": [
        "38001",
        "20390",
        "12618",
        "20475",
        "11016",
        "13"
      ]
    },
    {
      "hadith_no": "76",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا أحمد بن الأزهر، حدثنا محمد بن يوسف، حدثنا عبد الحميد بن بهرام، عن شهر بن حوشب، عن عبد الرحمن بن غنم، عن معاذ بن جبل، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ أمرت أن أقاتل الناس حتى يشهدوا أن لا إله إلا الله وأني رسول الله ويقيموا الصلاة ويؤتوا الزكاة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Mu'adh bin Jabal said:                     \"The Messenger of Allah (ﷺ) said: 'I have been commanded to fight the people until they testify to La ilaha ill-allah (none has the right to be worshipped but Allah) and that I am the Messenger of Allah, and establish regular prayers and pay Zakat.'\"",
      "chain": [
        "38001",
        "30388",
        "18598",
        "11044",
        "5152",
        "32"
      ]
    },
    {
      "hadith_no": "131",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا أحمد بن الأزهر، حدثنا عمرو بن عثمان، حدثنا زهير بن معاوية، حدثني إسحاق بن يحيى بن طلحة، عن موسى بن طلحة، عن معاوية بن أبي سفيان، قال نظر النبي  صلى الله عليه وسلم  إلى طلحة فقال ‏\"‏ هذا ممن قضى نحبه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Mu'awiyah bin Abu Sufyan said:                     \"The Prophet looked at Talhah and said: 'This is one of those who fulfilled their covenant.'\"",
      "chain": [
        "38001",
        "10581",
        "20321",
        "18029",
        "579",
        "27"
      ]
    },
    {
      "hadith_no": "276",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا أحمد بن الأزهر، حدثنا الهيثم بن جميل، حدثني عمر بن سليم، حدثنا يوسف بن إبراهيم، قال سمعت أنس بن مالك، يقول سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ من سئل عن علم فكتمه ألجم يوم القيامة بلجام من نار ‏\"‏ ‏.‏",
      "text_en": " Yusuf bin Ibrahim said:                     'I heard Anas bin Malik say: \"I heard the Messenger of Allah say: \"Whoever is asked about knowledge and conceals it, it will be bridled on the Day of Resurrection with reins of fire.'\"",
      "chain": [
        "38001",
        "20391",
        "19"
      ]
    },
    {
      "hadith_no": "505",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا العباس بن الوليد، وأحمد بن الأزهر، قالا حدثنا مروان بن محمد، حدثنا يزيد بن السمط، حدثنا الوضين بن عطاء، عن محفوظ بن علقمة، عن سلمان الفارسي، أن رسول الله  صلى الله عليه وسلم  توضأ فقلب جبة صوف كانت عليه فمسح بها وجهه ‏.‏",
      "text_en": " It was narrated from salman Al-Farisi that :                     The Messenger of Allah performed ablution, then he turned inside out the woolen garment that he was wearing and wiped his face with it.",
      "chain": [
        "38001",
        "20640",
        "27556",
        "17548",
        "18970",
        "14"
      ]
    },
    {
      "hadith_no": "758",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book On The Mosques And The Congregations - كتاب المساجد والجماعات",
      "chapter_no": "4",
      "text_ar": "حدثنا عبد الرحمن بن بشر بن الحكم، وأحمد بن الأزهر، قالا حدثنا مالك بن سعير، أنبأنا هشام بن عروة، عن أبيه، عن عائشة، أن رسول الله  صلى الله عليه وسلم  أمر بالمساجد أن تبنى في الدور وأن تطهر وتطيب ‏.‏",
      "text_en": " It was narrated from 'Aishah that:                     The Messenger of Allah commanded that mosque to be built in (Ad-Dur) villages, and that they be purified and perfumed.",
      "chain": [
        "30356",
        "38001",
        "20460",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1221",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أحمد بن الأزهر، حدثنا عبد الرحمن بن واقد، ح وحدثنا محمد بن المؤمل بن الصباح، حدثنا بدل بن المحبر، قالا حدثنا عبد الملك بن الوليد، حدثنا عاصم بن بهدلة، عن زر، وأبي، وائل، عن عبد الله بن مسعود، ‏.‏ أن النبي  صلى الله عليه وسلم  كان يقرأ في الركعتين بعد صلاة المغرب ‏{قل يا أيها الكافرون‏}‏ و ‏{قل هو الله أحد }‏ ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Abdullah bin Mas’ud that for the two Rak’ahafter Maghrib, the Prophet (ﷺ) used to recite:                      “Say: O youdisbelievers!” [Al-Kafirun (109)] and “Say: He is Allah the One.”[Al-Ikhlas (112)]",
      "chain": [
        "38001",
        "34134",
        "34246",
        "20210",
        "11358",
        "11337"
      ]
    },
    {
      "hadith_no": "1245",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن يحيى، وأحمد بن الأزهر، قالا حدثنا عبد الرزاق، أنبأنا معمر، عن يحيى بن أبي كثير، عن أبي نضرة، عن أبي سعيد، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ أوتروا قبل أن تصبحوا ‏\"‏ ‏.‏ قال محمد بن يحيى في هذا الحديث دليل على أن حديث عبد الرحمن واه ‏.‏",
      "text_en": " It wasnarrated that Abu Sa’eed said:                      “The Messenger of Allah (ﷺ)said: ‘Pray Witr before morning comes.’”",
      "chain": [
        "11222",
        "38001",
        "20121",
        "20115",
        "11449",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "1327",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أحمد بن الأزهر، والحسن بن أبي الربيع، قالا حدثنا وهب بن جرير، حدثنا أبي قال، سمعت النعمان، يحدث عن الزهري، عن حميد بن عبد الرحمن، عن أبي هريرة، قال خرج رسول الله  صلى الله عليه وسلم  يوما يستسقي فصلى بنا ركعتين بلا أذان ولا إقامة ثم خطبنا ودعا الله وحول وجهه نحو القبلة رافعا يديه ثم قلب رداءه فجعل الأيمن على الأيسر والأيسر على الأيمن ‏.‏",
      "text_en": " It wasnarrated that Abu Hurairah said:                      “The Messenger of Allah (ﷺ)wentout one day to pray for rain. He led us in praying two Rak’ahwithout any Adhan or Iqamah, then he addressed us and supplicated toAllah. He turned to face the Qiblah, raising his hands, then heturnedhis cloak around, putting its right on the left and its lefton theright.”",
      "chain": [
        "38001",
        "20298",
        "11272",
        "274",
        "11013",
        "10561",
        "13"
      ]
    },
    {
      "hadith_no": "1331",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أحمد بن الأزهر، حدثنا أبو النضر، حدثنا أبو عقيل، عن عمر بن حمزة، حدثنا سالم، عن أبيه، قال ربما ذكرت قول الشاعر وأنا أنظر، إلى وجه رسول الله  صلى الله عليه وسلم  على المنبر فما نزل حتى جيش كل ميزاب بالمدينة فأذكر قول الشاعر وأبيض يستسقى الغمام بوجهه ثمال اليتامى عصمة للأرامل وهو قول أبي طالب ‏.‏",
      "text_en": " Salimnarrated that his father said:                      “Sometimes I remember the words ofthe poet when I was looking at the face of the Messenger of Allah(ﷺ) on the pulpit. He did not come down until all the waterspoutsin Al-Madinah were filled with rain. And I remember what the poetsaid: ‘He has a white complexion and rain is sought by virtue of his countenance,He cares for the orphans, and protects the widows,These are the words of Abu Talib.”",
      "chain": [
        "38001",
        "20390",
        "11899",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "1359",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أحمد بن الأزهر، حدثنا عبد العزيز بن الخطاب، حدثنا مندل، عن محمد بن عبيد الله بن أبي رافع، عن أبيه، عن جده، أن النبي  صلى الله عليه وسلم  كان يأتي العيد ماشيا ويرجع ماشيا في غير الطريق الذي ابتدأ فيه ‏.‏",
      "text_en": " It wasnarrated from Muhammad bin ‘Ubaidullah bin Abu Rafi’, from hisfather, from his grandfather, that the Messenger of Allah (ﷺ) usedto come to ‘Eid prayers walking, and that he would go back via adifferent route than the one he began with.",
      "chain": [
        "38001",
        "34136",
        "15492",
        "11199"
      ]
    },
    {
      "hadith_no": "1517",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا أحمد بن الأزهر، حدثنا محمد بن عيسى، حدثنا يوسف بن الماجشون، حدثنا محمد بن المنكدر، قال دخلت على جابر بن عبد الله وهو يموت فقلت اقرأ على رسول الله  صلى الله عليه وسلم  السلام ‏.‏",
      "text_en": " Muhammadbin Munkadir said:                      “I entered upon Jabir bin ‘Abdullah whenhewas dying, and I said: ‘Convey my Salam to the Messenger of Allah(ﷺ).’”",
      "chain": [
        "38001",
        "31167",
        "20027",
        "11048"
      ]
    },
    {
      "hadith_no": "1899",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters Regarding Zakat - كتاب الزكاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الله بن أحمد بن بشير بن ذكوان، وأحمد بن الأزهر، قالا حدثنا مروان بن محمد، حدثنا أبو يزيد الخولاني، عن سيار بن عبد الرحمن الصدفي، عن عكرمة، عن ابن عباس، قال فرض رسول الله  صلى الله عليه وسلم  زكاة الفطر طهرة للصائم من اللغو والرفث وطعمة للمساكين فمن أداها قبل الصلاة فهي زكاة مقبولة ومن أداها بعد الصلاة فهي صدقة من الصدقات ‏.‏",
      "text_en": " It was narrated that:                     Ibn Abbas said: “The Messenger of Allah (ﷺ) enjoined Zakatul-Fitr as a purification for the fasting person from idle talk and obscenities, and to feed the poor. Whoever pays it before the (Eid) prayer, it is an accepted Zakah, and whoever pays it after the prayer, it is (ordinary) charity.”",
      "chain": [
        "38001",
        "20640",
        "26049",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "1919",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا أحمد بن الأزهر، حدثنا آدم، حدثنا عيسى بن ميمون، عن القاسم، عن عائشة، قالت قال رسول الله  صلى الله عليه وسلم  ‏\"‏ النكاح من سنتي فمن لم يعمل بسنتي فليس مني وتزوجوا فإني مكاثر بكم الأمم ومن كان ذا طول فلينكح ومن لم يجد فعليه بالصيام فإن الصوم له وجاء ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Aishah that:                     the Messenger of Allah said: “Marriage is part of my sunnah, and whoever does not follow my sunnah has nothing to do with me. Get married, for I will boast of your great numbers before the nations. Whoever has the means, let him get married, and whoever does not, then he should fast for it will diminish his desire.”",
      "chain": [
        "38001",
        "20404",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "2133",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Divorce - كتاب الطلاق",
      "chapter_no": "10",
      "text_ar": "حدثنا أحمد بن الأزهر، حدثنا محمد بن الفضل، عن حماد بن زيد، عن أيوب، عن أبي قلابة، عن أبي أسماء، عن ثوبان، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ أيما امرأة سألت زوجها الطلاق في غير ما بأس فحرام عليها رائحة الجنة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Thawban that the Messenger of Allah (ﷺ) said:                     'Any woman who asks her husband for a divorce when it is not absolutely necessary, the fragrance of Paradise will be forbidden to her.'\"",
      "chain": [
        "38001",
        "20283",
        "20022",
        "11015",
        "11047",
        "130"
      ]
    },
    {
      "hadith_no": "2778",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا أحمد بن الأزهر، حدثنا عبد الرزاق، عن معمر، عن همام، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ النار جبار والبئر جبار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:                     “(The injuries caused by) a fire are without liability, and by falling into a well.”",
      "chain": [
        "38001",
        "20121",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "2808",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Wills - كتاب الوصايا",
      "chapter_no": "22",
      "text_ar": "حدثنا أحمد بن الأزهر، حدثنا عبد الرزاق بن همام، أنبأنا معمر، عن أشعث بن عبد الله، عن شهر بن حوشب، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الرجل ليعمل بعمل أهل الخير سبعين سنة فإذا أوصى حاف في وصيته فيختم له بشر عمله فيدخل النار وإن الرجل ليعمل بعمل أهل الشر سبعين سنة فيعدل في وصيته فيختم له بخير عمله فيدخل الجنة ‏\"‏ ‏.‏ قال أبو هريرة واقرءوا إن شئتم ‏{تلك حدود الله}‏ إلى قوله {عذاب مهين}‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:                     “A man may do the deeds of the people of goodness for seventy years, then when he makes his will, he is unjust in his will, so he ends (his life) with evil deeds and enters Hell. And a man may do the people of evil for seventy years, then he is just in his will, so he ends (his life) with good deeds and enters Paradise.”Abu Hurairah said: “Recite, if you wish: “These are the limits (set by) Allah (STW) up to His saying: 'a disgraceful torment'”",
      "chain": [
        "38001",
        "20121",
        "20115",
        "19837",
        "11044",
        "13"
      ]
    },
    {
      "hadith_no": "2822",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Wills - كتاب الوصايا",
      "chapter_no": "22",
      "text_ar": "حدثنا أحمد بن الأزهر، حدثنا روح بن عبادة، حدثنا حسين المعلم، عن عمرو بن شعيب، عن أبيه، عن جده، قال جاء رجل إلى النبي صلى الله عليه وسلم فقال لا أجد شيئا وليس لي مال ولي يتيم له مال قال ‏\"‏ كل من مال يتيمك غير مسرف ولا متأثل مالا ‏\"‏ ‏.‏ قال وأحسبه قال ‏\"‏ ولا تقي مالك بماله ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib from his father, that his a grandfather said:                     “A man came to the Prophet (ﷺ) and said: 'I do not have anything and I have no wealth, but I have an orphan (under my care) who has wealth.” He said: “Eat from the wealth of your orphan, without being extravagant or use it for trade.” He (narrator) said: “And I think he said: 'Do not preserve your wealth using his instead.'”",
      "chain": [
        "38001",
        "20229",
        "11278",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "3371",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hunting - كتاب الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا أحمد بن الأزهر النيسابوري، حدثنا الهيثم بن جميل، حدثنا شريك، عن هشام بن عروة، عن أبيه، عن ابن عمر، قال من يأكل الغراب وقد سماه رسول الله  صلى الله عليه وسلم  ‏\"‏ فاسقا ‏\"‏ ‏.‏ والله ما هو من الطيبات ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Umar said:                      “Who eats crows? The MessengerofAllah (ﷺ) called them vermin, By Allah, they are not from amongthegood and permissible things.”",
      "chain": [
        "38001",
        "20391",
        "20587",
        "11065",
        "10511",
        "18"
      ]
    },
    {
      "hadith_no": "3693",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا العباس بن الوليد الدمشقي، وأحمد بن الأزهر، قالا حدثنا مروان بن محمد، حدثنا يزيد بن السمط، حدثني الوضين بن عطاء، عن محفوظ بن علقمة، عن سلمان الفارسي، أن رسول الله  صلى الله عليه وسلم  توضأ فقلب جبة صوف كانت عليه فمسح بها وجهه ‏.‏",
      "text_en": " It wasnarrated from Salman Farisi that the Messenger of Allah (ﷺ)performed ablution, then he turned his woolen cloak that he waswearing inside out and wiped his face with it.",
      "chain": [
        "38001",
        "20640",
        "27556",
        "17548",
        "18970",
        "14"
      ]
    },
    {
      "hadith_no": "3783",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أحمد بن الأزهر، حدثنا عبد الرزاق، أنبأنا معمر، عن أيوب، عن نافع، عن ابن عمر، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ مثل القرآن مثل الإبل المعقلة إن تعاهدها صاحبها بعقلها أمسكها عليه وإن أطلق عقلها ذهبت ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn Umar that the Messenger of Allah(ﷺ) said:                     \"The likeness of the Quran is that of a hobbled camel. If its owner ties its rope, he will keep it, but if he loosens its rope it will go away.\"",
      "chain": [
        "38001",
        "20121",
        "20115",
        "11015",
        "11014",
        "18"
      ]
    }
  ],
  "total_hadiths": 25
}