{
  "id": "38022",
  "name": "Ahmed bin Suliaman أحمد بن سليمان",
  "full_name": "Ahmed bin Suliaman أحمد بن سليمان",
  "grade": "3rd Century AH [11th generation]",
  "reliability_grade": "Thiqah Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "261",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Jaziara",
      " Rahawa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ س  -  ثقة حافظ ]"
    ],
    "tags": [
      "al-Rahawi",
      "Al-Juzri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20668",
      "name": "'Umar bin Sa'd bin 'Ubaid عمر بن سعد بن عبيد أبو داود",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20348",
      "name": "al-Fadl bin Dakayn, Abu Na'eem الفضل بن دكين أبو نعيم الملائي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20650",
      "name": "Zayd bin al-Habab al-'Akli زيد بن الحباب أبو الحسين العكلي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20416",
      "name": "Ja'far bin Awn bin Ja'far جعفر بن عون بن جعفر",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20606",
      "name": "Mhadr Bdad Ma'jmh محاضر بضاد معجمة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20472",
      "name": "Yazid bin Harun يزيد بن هارون",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30006",
      "name": "Imam Nasa'i أحمد بن شعيب بن علي بن سنان النسائي",
      "grade": "3rd Century AH [12th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sunan-an-nasai-42",
      "hadith_no": "42",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا أبو نعيم، عن زهير، عن أبي إسحاق، قال ليس أبو عبيدة ذكره ولكن عبد الرحمن بن الأسود عن أبيه، أنه سمع عبد الله، يقول أتى النبي صلى الله عليه وسلم الغائط وأمرني أن آتيه بثلاثة أحجار فوجدت حجرين والتمست الثالث فلم أجده فأخذت روثة فأتيت بهن النبي صلى الله عليه وسلم فأخذ الحجرين وألقى الروثة وقال ‏\"‏ هذه ركس ‏\"‏ ‏.‏ قال أبو عبد الرحمن الركس طعام الجن ‏.‏",
      "text_en": " 'Abdur-Rahman bin Al-Aswad (narrated) from his father that he heard 'Abdullah say:                      \"The Prophet (ﷺ) wanted to defecate, and he told me to bring him three stones. I found two stones and looked for a third, but I could not find any, so I picked up a piece of dung and brought them to the Prophet (ﷺ). He took the two stones and three away the dung and said: \"This is Riks.\"Abu 'Abdur-Rahman (An-Nasai') said: Riks is the food of the jinn.",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20348",
        "20321",
        "11049",
        "16"
      ]
    },
    {
      "id": "sunan-an-nasai-128",
      "hadith_no": "128",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا أحمد بن سليمان الرهاوي، قال حدثنا يحيى بن آدم، قال حدثنا سفيان الثوري، ومالك بن مغول، وزهير، وأبو بكر بن عياش وسفيان بن عيينة عن عاصم، عن زر، قال سألت صفوان بن عسال عن المسح، على الخفين فقال كان رسول الله صلى الله عليه وسلم يأمرنا إذا كنا مسافرين أن نمسح على خفافنا ولا ننزعها ثلاثة أيام من غائط وبول ونوم إلا من جنابة ‏.‏",
      "text_en": " It was narrated that Zirr said:                      \"I asked Safwan bin 'Assal about wiping over the Khuffs, and he said: 'The Messenger of Allah (ﷺ) used to tell us, when we were travelling, to wipe over our Khuffs and not take them off for three nights in the event of defecating, urinating or sleeping; only in the case of Janabah.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20364",
        "20012",
        "20358",
        "20321",
        "11080",
        "11337",
        "4143"
      ]
    },
    {
      "id": "sunan-an-nasai-245",
      "hadith_no": "245",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا حسين، عن زائدة، قال حدثنا عطاء بن السائب، قال حدثني أبو سلمة بن عبد الرحمن، قال حدثتني عائشة، رضى الله عنها أن رسول الله صلى الله عليه وسلم كان إذا اغتسل من الجنابة وضع له الإناء فيصب على يديه قبل أن يدخلهما الإناء حتى إذا غسل يديه أدخل يده اليمنى في الإناء ثم صب باليمنى وغسل فرجه باليسرى حتى إذا فرغ صب باليمنى على اليسرى فغسلهما ثم تمضمض واستنشق ثلاثا ثم يصب على رأسه ملء كفيه ثلاث مرات ثم يفيض على جسده ‏.‏",
      "text_en": " 'Aishah narrated that when the Messenger of Allah (ﷺ) performed Ghusl from Janabah, the vessel (of water) would be placed before him, and he would pour water over his hands before putting then into the vessel. When he had washed his hands, he would put his right hand in the vessel then pour water with his right hand and wash his private parts with his left hand. When he had finished, he would pour water with his right hand over his left hand and wash them both. Then he would rinse his mouth and nose three times, then he would pour water filling both of his hands over his head three times, then he would pour water over his body.",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "11278",
        "20320",
        "11068",
        "10567",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-246",
      "hadith_no": "246",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا يزيد، قال حدثنا شعبة، عن عطاء بن السائب، عن أبي سلمة، قال سألت عائشة - رضى الله عنها - عن غسل رسول الله صلى الله عليه وسلم من الجنابة فقالت كان رسول الله صلى الله عليه وسلم يفرغ على يديه ثلاثا ثم يغسل فرجه ثم يغسل يديه ثم يمضمض ويستنشق ثم يفرغ على رأسه ثلاثا ثم يفيض على سائر جسده ‏.‏",
      "text_en": " It was narrated that Abu Salamah said:                      \"I asked 'Aishah about how the Messenger of Allah (ﷺ) performed Ghusl from Janabah. She said: 'The Messenger of Allah (ﷺ) used to pour water onto his hands three times, then he would wash his private part, then he would wash his hands, then rinse his mouth and nose, then pour water onto his head three times, then pour water over the rest of his body.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20472",
        "20020",
        "11068",
        "10567",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-451",
      "hadith_no": "451",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Salah - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا يحيى بن آدم، قال حدثنا مالك بن مغول، عن الزبير بن عدي، عن طلحة بن مصرف، عن مرة، عن عبد الله، قال لما أسري برسول الله صلى الله عليه وسلم انتهي به إلى سدرة المنتهى وهي في السماء السادسة وإليها ينتهي ما عرج به من تحتها وإليها ينتهي ما أهبط به من فوقها حتى يقبض منها قال ‏{‏ إذ يغشى السدرة ما يغشى ‏}‏ قال فراش من ذهب فأعطي ثلاثا الصلوات الخمس وخواتيم سورة البقرة ويغفر لمن مات من أمته لا يشرك بالله شيئا المقحمات ‏.‏",
      "text_en": " It was narrated that 'Abdullah said:                      \"When the Messenger of Allah (ﷺ) was taken on the Night Journey, he came to Sidrah Al-Muntaha, which is in the sixth heaven. That is where everything that comes up from below ends, and where everything that comes down from above, until it is taken from it. Allah says: When what covered the lote-tree did cover it! [1] He said: \"It was moths of gold. And I was given three things: The five daily prayers, the last verses of Surah Al-Baqarah, and whoever of my Ummah dies without associating anything with Allah will be forgiven for Al-Muqhimat.\" [2][1] An-Najm 53:16.[2] \"The sins of the worst magnitude that drag one into the Fire.\" (An-Nihayah)",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20364",
        "20358",
        "11336",
        "11356",
        "16"
      ]
    },
    {
      "id": "sunan-an-nasai-528",
      "hadith_no": "528",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا عبدة بن عبد الله، وأحمد بن سليمان، - واللفظ له - قالا حدثنا أبو داود، عن بدر بن عثمان، قال إملاء على حدثنا أبو بكر بن أبي موسى، عن أبيه، قال أتى النبي صلى الله عليه وسلم سائل يسأله عن مواقيت الصلاة فلم يرد عليه شيئا فأمر بلالا فأقام بالفجر حين انشق ثم أمره فأقام بالظهر حين زالت الشمس والقائل يقول انتصف النهار وهو أعلم ثم أمره فأقام بالعصر والشمس مرتفعة ثم أمره فأقام بالمغرب حين غربت الشمس ثم أمره فأقام بالعشاء حين غاب الشفق ثم أخر الفجر من الغد حين انصرف والقائل يقول طلعت الشمس ثم أخر الظهر إلى قريب من وقت العصر بالأمس ثم أخر العصر حتى انصرف والقائل يقول احمرت الشمس ثم أخر المغرب حتى كان عند سقوط الشفق ثم أخر العشاء إلى ثلث الليل ثم قال ‏\"‏ الوقت فيما بين هذين ‏\"‏ ‏.‏",
      "text_en": " Abu Bakr bin Abi Musa narrated that his father said:                      \"A man came to the Prophet (ﷺ) asking him about the times of prayer, and he did not answer him. He told Bilal to say the Iqamah at dawn broke, then he told him to say the Iqamah for Zuhr when the sun had passed its zenith and a person would say: 'It is the middle of the day,' but he (the Prophet (ﷺ)) knew better. Then he told him to say the Iqamah for 'Asr when the sun was still high. Then he told him to say the Iqamah for Maghrib when the sun had set. Then he told him to say the Iqamah for 'Isha' when the twilight had dissapeared. Then the next day he told him to say the Iqamah for Fajr, at a time such that when after he had finished one would say: 'The sun has risen.' Then he delayed Zuhr until it was nearly the time of 'Asr compared to the day before. Then he delayed 'Asr, to a time such that when he finished one would say: 'The su has turned red.' Then he delayed Maghrib until the twilight was about to disappear. Then he delayed 'Isha' until one-third of the night had passed. Then he said: 'The time (for prayer) is between these times.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30149",
        "38022",
        "20547",
        "10745"
      ]
    },
    {
      "id": "sunan-an-nasai-529",
      "hadith_no": "529",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا زيد بن الحباب، قال حدثنا خارجة بن عبد الله بن سليمان بن زيد بن ثابت، قال حدثني الحسين بن بشير بن سلام، عن أبيه، قال دخلت أنا ومحمد بن علي، على جابر بن عبد الله الأنصاري فقلنا له أخبرنا عن صلاة، رسول الله صلى الله عليه وسلم وذاك زمن الحجاج بن يوسف ‏.‏ قال خرج رسول الله صلى الله عليه وسلم فصلى الظهر حين زالت الشمس وكان الفىء قدر الشراك ثم صلى العصر حين كان الفىء قدر الشراك وظل الرجل ثم صلى المغرب حين غابت الشمس ثم صلى العشاء حين غاب الشفق ثم صلى الفجر حين طلع الفجر ثم صلى من الغد الظهر حين كان الظل طول الرجل ثم صلى العصر حين كان ظل الرجل مثليه قدر ما يسير الراكب سير العنق إلى ذي الحليفة ثم صلى المغرب حين غابت الشمس ثم صلى العشاء إلى ثلث الليل أو نصف الليل - شك زيد - ثم صلى الفجر فأسفر ‏.‏",
      "text_en": " Al-Husain bin Bashir bin Sallam narrated that his father said:                      \"Muhammad bin 'Ali and I entered upon Jabir bin 'Abdullah Al-Ansari. We said to him: 'Tell us about the prayer of the Messenger of Allah (ﷺ).' That was at the time of Al-Hajjaj bin Yusuf. He said: 'The Messenger of Allah (ﷺ) came out and prayed Zuhr when the sun had passed its zenith and the shadow (of a thing) was the length of a sandal-strap. Then he prayed 'Asr when the shadow of a man was the length of a sandal-strap plus his height. Then he prayed Maghrib when the sun had set. Then he prayed 'Isha' when the twilight disappeared. Then he prayed Fajr when dawn broke. The next day he prayed Zuhr when a man's shadow was equal to his height. Then he prayed 'Asr when a man's shadow was twice his height, and (the time between the prayer and sunset) lasted as long as it takes a swift rider to reach Dhul-Hulaifah. Then he prayed Maghrib when the sun set, then he prayed 'Isha' when one-third or one-half of the night had passed'\" - (One of the narrators) Zaid, was not sure - \"then he prayed Fajr when it had become bright.\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20650",
        "22047",
        "22038"
      ]
    },
    {
      "id": "sunan-an-nasai-546",
      "hadith_no": "546",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا أبو داود، - هو الحفري - عن سفيان، عن عبد الله بن أبي لبيد، عن أبي سلمة، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تغلبنكم الأعراب على اسم صلاتكم هذه فإنهم يعتمون على الإبل وإنها العشاء ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                      \"The Messenger of Allah (ﷺ) said: 'Do not let the Bedouin make you change the name of this prayer of yours, for they delay the prayer until it is very dark because of their preoccupation with camels and milking them. Verily, it is 'Isha'.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20668",
        "20012",
        "11515",
        "10567",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-680",
      "hadith_no": "680",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Adhan (The Call to Prayer) - كتاب الأذان",
      "chapter_no": "7",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا عفان، قال حدثنا حماد بن سلمة، قال حدثنا سعيد الجريري، عن أبي العلاء، عن مطرف، عن عثمان بن أبي العاص، قال قلت يا رسول الله اجعلني إمام قومي ‏.‏ فقال ‏\"‏ أنت إمامهم واقتد بأضعفهم واتخذ مؤذنا لا يأخذ على أذانه أجرا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Uthman bin Abi Al-As said:                      \"I said: 'O Messenger of Allah, made me the Imam of my people.' He said: 'You are their Imam, so consider the weakest among them and choose a Mu'adhdhin who does not accept any payment for his Adhan.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "30106",
        "20021",
        "11286",
        "11395",
        "3210"
      ]
    },
    {
      "id": "sunan-an-nasai-900",
      "hadith_no": "900",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا زيد بن الحباب، قال حدثني جعفر بن سليمان، عن علي بن علي، عن أبي المتوكل، عن أبي سعيد، قال كان رسول الله صلى الله عليه وسلم إذا افتتح الصلاة قال ‏\"‏ سبحانك اللهم وبحمدك وتبارك اسمك وتعالى جدك ولا إله غيرك ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Sa'eed said:                     \"When the Messenger of Allah (ﷺ) started to pray, he would say: 'Subhanakallahumma, wa bihamdika tabarakasmuka wa ta'ala jadduka wa la ilaha ghairuk (Glory and praise be to You, O Allah. Blessed be Your name and exalted be Your majesty, there is none worthy of worship except You.)\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20650",
        "20532",
        "11297",
        "38"
      ]
    },
    {
      "id": "sunan-an-nasai-1037",
      "hadith_no": "1037",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا أحمد بن سليمان الرهاوي، قال حدثنا حسين، عن زائدة، عن عطاء، عن سالم أبي عبد الله، عن عقبة بن عمرو، قال ألا أصلي لكم كما رأيت رسول الله صلى الله عليه وسلم يصلي فقلنا بلى ‏.‏ فقام فلما ركع وضع راحتيه على ركبتيه وجعل أصابعه من وراء ركبتيه وجافى إبطيه حتى استقر كل شىء منه ثم رفع رأسه فقام حتى استوى كل شىء منه ثم سجد فجافى إبطيه حتى استقر كل شىء منه ثم قعد حتى استقر كل شىء منه ثم سجد حتى استقر كل شىء منه ثم صنع كذلك أربع ركعات ثم قال هكذا رأيت رسول الله صلى الله عليه وسلم يصلي وهكذا كان يصلي بنا ‏.‏",
      "text_en": " It was narrated that 'Uqbah bin 'Amir said:                     \"Shall I not show you how I saw the Messenger of Allah (ﷺ) pray?\" We said: \"Yes.\" So he stood up and when he bowed, he placed his palms on his knees and put his fingers behind his knees, and held his arms out from his sides, until every part of him settled. Then he raised his head and stood up until every part of him settled. Then he prostrated and held his arms out from his sides, until every part of him settled. Then he sat up until every part of him settled. Then he prostrated again until every part of him settled. Then he did four rak'ahs like that. Then he said: \"This is how I saw the Messenger of Allah (ﷺ) pray, and this is how he used to lead us in prayer.\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "11278",
        "20320",
        "11029"
      ]
    },
    {
      "id": "sunan-an-nasai-1185",
      "hadith_no": "1185",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا يحيى بن آدم، عن مسعر، عن عبيد الله ابن القبطية، عن جابر بن سمرة، قال كنا نصلي خلف النبي صلى الله عليه وسلم فنسلم بأيدينا فقال ‏\"‏ ما بال هؤلاء يسلمون بأيديهم كأنها أذناب خيل شمس أما يكفي أحدهم أن يضع يده على فخذه ثم يقول السلام عليكم السلام عليكم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Jabir bin Samurah said:                     \"We used to pray behind the Messenger of Allah (ﷺ) and we would greet (others) with our hands. He said: 'What is the matter with those who greet (others) with their hands as if they were tails of wild horses? It is sufficient for any one of you to put his hand on his thigh and say: \"As-salamu 'alaikum, as-salamu 'alaikum.\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20364",
        "20359",
        "10794",
        "393"
      ]
    },
    {
      "id": "sunan-an-nasai-1278",
      "hadith_no": "1278",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا يحيى بن آدم، قال حدثنا عبد الرحمن بن حميد، قال حدثنا أبو الزبير، عن طاوس، عن ابن عباس، قال كان رسول الله صلى الله عليه وسلم يعلمنا التشهد كما يعلمنا السورة من القرآن ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"The Messenger of Allah (ﷺ) used to teach us the tashahhud just as he used to teach us a surah from the Quran.\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20364",
        "11193",
        "11263",
        "11053",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-1312",
      "hadith_no": "1312",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا يحيى بن آدم، قال حدثنا مالك، - وهو ابن مغول - عن طلحة بن مصرف، عن زيد بن وهب، عن حذيفة، أنه رأى رجلا يصلي فطفف فقال له حذيفة منذ كم تصلي هذه الصلاة قال منذ أربعين عاما ‏.‏ قال ما صليت منذ أربعين سنة ولو مت وأنت تصلي هذه الصلاة لمت على غير فطرة محمد صلى الله عليه وسلم ثم قال إن الرجل ليخفف ويتم ويحسن ‏.‏",
      "text_en": " It was narrated from Hudhaifah that:                     He saw a man praying (And his bowing and prostration) were lacking. Hudhaifah said to him: 'For how long have you been praying like this?' He said: \"For forty years.' He said: 'You have not been praying for forty years and if you die praying like this, you will have died following a path other than the path of Muhammad (ﷺ). Then he said: 'It is possible for a man to pray briefly, but still do it properly.\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20364",
        "20358",
        "11356",
        "11341",
        "145"
      ]
    },
    {
      "id": "sunan-an-nasai-1326",
      "hadith_no": "1326",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا عبيد الله بن موسى، قال حدثنا إسرائيل، عن فرات القزاز، عن عبيد الله، - وهو ابن القبطية - عن جابر بن سمرة، قال صليت مع رسول الله صلى الله عليه وسلم فكنا إذا سلمنا قلنا بأيدينا السلام عليكم السلام عليكم - قال - فنظر إلينا رسول الله صلى الله عليه وسلم فقال ‏\"‏ ما شأنكم تشيرون بأيديكم كأنها أذناب خيل شمس إذا سلم أحدكم فليلتفت إلى صاحبه ولا يومئ بيده ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Jabir bin Samurah said:                     \"I prayed with the Messenger of Allah (ﷺ) and when we said the salam we used to gesture with our hands: 'Asalamu alaykum wa rahmatullah (peace be upon, peace be upon you).' The Messenger of Allah (ﷺ) looked at us and said: 'What is the matter with you, pointing with your hands as if they are the tails of wild horses? When any one of you says the salam, let him turn to his companions and not gesture with his hand.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20340",
        "20311",
        "11384",
        "10794",
        "393"
      ]
    },
    {
      "id": "sunan-an-nasai-1332",
      "hadith_no": "1332",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا عمرو بن عون، قال حدثنا أبو عوانة، عن هلال، عن عبد الرحمن بن أبي ليلى، عن البراء بن عازب، قال رمقت رسول الله صلى الله عليه وسلم في صلاته فوجدت قيامه وركعته واعتداله بعد الركعة فسجدته فجلسته بين السجدتين فسجدته فجلسته بين التسليم والانصراف قريبا من السواء ‏.‏",
      "text_en": " It was narrated that Al-Bara' bin 'Azib said:                     \"I watched the Messenger of Allah (ﷺ) when he prayed, and I noticed that his standing, his bowing, his standing up after bowing, his prostration, his sitting between the two prostrations and his sitting between the taslim and departing were almost the same in length.\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "30154",
        "20469",
        "11229",
        "11196",
        "400"
      ]
    },
    {
      "id": "sunan-an-nasai-1345",
      "hadith_no": "1345",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا يعلى، قال حدثنا قدامة، عن جسرة، قالت حدثتني عائشة، - رضى الله عنها - قالت دخلت على امرأة من اليهود فقالت إن عذاب القبر من البول ‏.‏ فقلت كذبت ‏.‏ فقالت بلى إنا لنقرض منه الجلد والثوب ‏.‏ فخرج رسول الله صلى الله عليه وسلم إلى الصلاة وقد ارتفعت أصواتنا فقال ‏\"‏ ما هذا ‏\"‏ ‏.‏ فأخبرته بما قالت فقال ‏\"‏ صدقت ‏\"‏ ‏.‏ فما صلى بعد يومئذ صلاة إلا قال في دبر الصلاة ‏\"‏ رب جبريل وميكائيل وإسرافيل أعذني من حر النار وعذاب القبر ‏\"‏ ‏.‏",
      "text_en": " 'Aishah said:                     \"A Jewish woman entered unto me and said: 'The torment of the grave is because of urine.' I said: 'You are lying.' She said: 'No, it is true; we cut our skin and clothes because of it.' The Messenger of Allah (ﷺ) went out to pray and our voices became loud. He said: 'What is this?' So I told him what she had said. He said: 'She spoke the truth.' After that day he never offered any prayer but he said, following the prayer: 'Rabba Jibril wa Mika'il wa Israfil, aiding min harrin-nar wa 'adhabil-qabr (Lord of Jibril, Mika'il and Israfil, grant me refuge from the heat of the Fire and the torment of the grave).'\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20372",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-1358",
      "hadith_no": "1358",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا يحيى بن آدم، قال حدثنا زهير، وذكر، آخر عن سماك بن حرب، قال قلت لجابر بن سمرة كنت تجالس رسول الله صلى الله عليه وسلم قال نعم كان رسول الله صلى الله عليه وسلم إذا صلى الفجر جلس في مصلاه حتى تطلع الشمس فيتحدث أصحابه يذكرون حديث الجاهلية وينشدون الشعر ويضحكون ويتبسم صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated that Simak bin Harb said:                     \"I said to Jabir bin Samurah: 'Did you used to sit with the Messenger of Allah (ﷺ)?\" He said: 'Yes.' When the Messenger of Allah (ﷺ) had prayed fajr, he would sit in the place where he had prayed until the sun rose, and his companions would talk and remember things from the time of Jahilliyah and recite poetry, and they would laugh and he would smile.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20364",
        "20321",
        "10770"
      ]
    },
    {
      "id": "sunan-an-nasai-Grade-8",
      "hadith_no": "Grade",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا يزيد بن هارون، قال حدثنا همام، عن قتادة، عن قدامة بن وبرة، عن سمرة بن جندب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من ترك الجمعة من غير عذر فليتصدق بدينار فإن لم يجد فبنصف دينار ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Samurah bin Jundub said:                     \"The Messenger of Allah (ﷺ) said: \"Whoever misses jumu'ah with no excuse, let him give a dinar in charity, and if he cannot afford that, then half a dinar.\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20472",
        "20297",
        "11019",
        "394"
      ]
    },
    {
      "id": "sunan-an-nasai-1501",
      "hadith_no": "1501",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا أبو داود الحفري، عن سفيان، عن الأسود بن قيس، عن ثعلبة بن عباد، عن سمرة، أن النبي صلى الله عليه وسلم خطب حين انكسفت الشمس فقال ‏\"‏ أما بعد ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Samurah that:                     The Prophet (ﷺ) delivered a Khutbah when the sun eclipsed and he said: 'Amma ba'd (to proceed).'\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20668",
        "20012",
        "11323",
        "19841",
        "394"
      ]
    },
    {
      "id": "sunan-an-nasai-1599",
      "hadith_no": "1599",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا عفان بن مسلم، قال حدثنا وهيب، قال سمعت موسى بن عقبة، قال سمعت أبا النضر، يحدث عن بسر بن سعيد، عن زيد بن ثابت، أن النبي صلى الله عليه وسلم اتخذ حجرة في المسجد من حصير فصلى رسول الله صلى الله عليه وسلم فيها ليالي حتى اجتمع إليه الناس ثم فقدوا صوته ليلة فظنوا أنه نائم فجعل بعضهم يتنحنح ليخرج إليهم فقال ‏\"‏ ما زال بكم الذي رأيت من صنعكم حتى خشيت أن يكتب عليكم ولو كتب عليكم ما قمتم به فصلوا أيها الناس في بيوتكم فإن أفضل صلاة المرء في بيته إلا الصلاة المكتوبة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Zaid bin Thabit that :                     The Prophet (ﷺ) used some palm fiber mats to section off a small area in the masjid. And the Messenger of Allah (ﷺ) prayed in it for several nights until the people gathered around him. Then, one night they did not hear his voice, and they thought that he was sleeping, so they cleared their throats to make him come out to them. He said: 'You kept doing that until I feared that it would be made obligatory for you, and if it were made obligatory, you would not be able to do it. O people, pray in your houses, for the best prayer a person offers is in his house, apart from the prescribed (obligatory) prayers.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "30106",
        "20299",
        "11106",
        "20390",
        "11153",
        "49"
      ]
    },
    {
      "id": "sunan-an-nasai-1606",
      "hadith_no": "1606",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا زيد بن الحباب، قال أخبرني معاوية بن صالح، قال حدثني نعيم بن زياد أبو طلحة، قال سمعت النعمان بن بشير، على منبر حمص يقول قمنا مع رسول الله صلى الله عليه وسلم في شهر رمضان ليلة ثلاث وعشرين إلى ثلث الليل الأول ثم قمنا معه ليلة خمس وعشرين إلى نصف الليل ثم قمنا معه ليلة سبع وعشرين حتى ظننا أن لا ندرك الفلاح وكانوا يسمونه السحور ‏.‏",
      "text_en": " Nu'aim bin Ziyad Abu Talhah said:                     \"I heard An-Nu'man bin Bashir on the minbar in Hims saying: \"We prayed Qiyam with the Messenger of Allah (ﷺ) during Ramadan on the night of the twenty-third until one-third of the night had passed, then we prayed Qiyam with him on the night of the twenty-fifth until one-half of the night had passed, then we prayed Qiyam with him on the night of the twenty-seventh until we thought that we would miss Al-Falah- that is what they used to call suhur.\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20650",
        "20675",
        "274"
      ]
    },
    {
      "id": "sunan-an-nasai-1624",
      "hadith_no": "1624",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا عبيد الله، قال أنبأنا إسرائيل، عن أبي حصين، عن شقيق، قال كنا نؤمر إذا قمنا من الليل أن نشوص أفواهنا بالسواك ‏.‏",
      "text_en": " It was narrated that Shaqiq said:                     \"We were commanded, when we got up to pray at night, to clean our mouths with the siwak.\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "11201",
        "20311",
        "11371",
        "11353"
      ]
    },
    {
      "id": "sunan-an-nasai-1703",
      "hadith_no": "1703",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا أبو نعيم، قال حدثنا زهير، عن أبي إسحاق، عن سعيد بن جبير، عن ابن عباس، أنه كان يوتر بثلاث ب ‏{‏ سبح اسم ربك الأعلى ‏}‏ و ‏{‏ قل يا أيها الكافرون ‏}‏ و ‏{‏ قل هو الله أحد ‏}‏",
      "text_en": " Zuhair narrated from Abu Ishaq, from Sa'eed bin Jubair, :                     Ibn Abbas used to pray witr with three: (Reciting): Glorify the Name of Your Lord, the Most High;\" \"Say: O You disbelievers!\" and: \"Say: He is Allah, (the) One.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20348",
        "20321",
        "11049",
        "11050",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-1705",
      "hadith_no": "1705",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا حسين، عن زائدة، عن حصين، عن حبيب بن أبي ثابت، عن محمد بن علي بن عبد الله بن عباس، عن أبيه، عن جده، قال كنت عند النبي صلى الله عليه وسلم فقام فتوضأ واستاك وهو يقرأ هذه الآية حتى فرغ منها ‏{‏ إن في خلق السموات والأرض واختلاف الليل والنهار لآيات لأولي الألباب ‏}‏ ثم صلى ركعتين ثم عاد فنام حتى سمعت نفخه ثم قام فتوضأ واستاك ثم صلى ركعتين ثم نام ثم قام فتوضأ واستاك وصلى ركعتين وأوتر بثلاث ‏.‏",
      "text_en": " Husain narrated from Habib bin Abi Thabit, from Muhammad bin 'Ali bin 'Abdullah bin Abbas, from his father, that his grandfather said:                     \"I was with the Prophet (ﷺ) and he got up and performed wudu, cleaned his teeth while reciting this verse until he finished: 'Verily, in the creation of the heavens and the Earth, and in the alternation of night and day, there are indeed signs for men of understanding.' Then he prayed two rak'ahs, then he went back and slept until I heard him breathing deeply. Then he got up and performed wudu and cleaned his teeth. Then he prayed two rak'ahs, then he slept, then he got up and performed wudu and cleaned his teeth and prayed two rak'ahs and prayed witr with three rak'ahs.\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "11278",
        "20320",
        "15097",
        "11331",
        "10961",
        "10949"
      ]
    },
    {
      "id": "sunan-an-nasai-1709",
      "hadith_no": "1709",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا حسين، عن زائدة، عن سليمان، عن عمارة بن عمير، عن يحيى بن الجزار، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يصلي من الليل تسعا فلما أسن وثقل صلى سبعا ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"The Messenger of Allah (ﷺ) used to pray nine (rak'ahs) at night, then when he grew older and put on weight he prayed seven.\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "11278",
        "20320",
        "11060",
        "11378",
        "10839",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-1735",
      "hadith_no": "1735",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا محمد بن عبيد، قال حدثنا عبد الملك بن أبي سليمان، عن زبيد، عن سعيد بن عبد الرحمن بن أبزى، عن أبيه، قال كان رسول الله صلى الله عليه وسلم يوتر ب ‏{‏ سبح اسم ربك الأعلى ‏}‏ و ‏{‏ قل يا أيها الكافرون ‏}‏ و ‏{‏ قل هو الله أحد ‏}‏ ورواه محمد بن جحادة عن زبيد ولم يذكر ذرا ‏.‏",
      "text_en": " 'Abdul-Malik bin Abi Sulaiman reported from Zubaid, from Sa'eed bin Abdur-Rahman bin Abza, from his father, who said:                     \"The Messenger of Allah (ﷺ) used to recite in witr: Glorify the Name of your Lord, the Most High;\" and \"Say: O you disbelievers!;' and 'Say: He is Allah, (the) One.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "30213",
        "10945",
        "11335",
        "11346",
        "4046"
      ]
    },
    {
      "id": "sunan-an-nasai-1738",
      "hadith_no": "1738",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا يحيى بن آدم، قال حدثنا مالك، عن زبيد، عن ذر، عن ابن أبزى، مرسل ‏.‏ وقد رواه عطاء بن السائب عن سعيد بن عبد الرحمن بن أبزى، عن أبيه، ‏.‏",
      "text_en": " Ahmad bin Sulaiman informed us, he said:                     \"Yahya bin Adam narrated to us, he said: \"Malik narrated to us from Zubaid, from Dharr, from Ibn Abza.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20364",
        "20001",
        "11335",
        "11423",
        "11068",
        "11346"
      ]
    },
    {
      "id": "sunan-an-nasai-1803",
      "hadith_no": "1803",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا أبو نعيم، قال أنبأنا زهير، عن أبي إسحاق، عن المسيب بن رافع، عن عنبسة، أخي أم حبيبة عن أم حبيبة، قالت من صلى في اليوم والليلة ثنتى عشرة ركعة سوى المكتوبة بني له بيت في الجنة أربعا قبل الظهر وركعتين بعدها وثنتين قبل العصر وثنتين بعد المغرب وثنتين قبل الفجر ‏.‏",
      "text_en": " It was narrated that Umm Habibah said:                     \"Whoever prays twelve rak'ahs during the night and day other than the prescribed prayers, a house will be built for him in Paradise: four before Zuhr and two rak'ahs afterward, two before Asr, two after Maghrib and two before Fajr.\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20348",
        "20321",
        "11049",
        "11394",
        "59"
      ]
    },
    {
      "id": "sunan-an-nasai-1805",
      "hadith_no": "1805",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا يعلى، قال حدثنا إسماعيل، عن المسيب بن رافع، عن عنبسة بن أبي سفيان، عن أم حبيبة، قالت من صلى في الليل والنهار ثنتى عشرة ركعة سوى المكتوبة بني له بيت في الجنة ‏.‏",
      "text_en": " It was narrated that Umm Habibah said:                     \"Whoever prays twelve rak'ahs during the night and day apart from the prescribed prayers, a house will be built for him in Paradise.\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20372",
        "11418",
        "11394",
        "846",
        "59"
      ]
    },
    {
      "id": "sunan-an-nasai-2026",
      "hadith_no": "2026",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا أبو نعيم، ويحيى بن آدم، قالا حدثنا مالك بن مغول، عن سماك، عن جابر بن سمرة، قال ‏:‏ خرج رسول الله صلى الله عليه وسلم على جنازة أبي الدحداح، فلما رجع أتي بفرس معرورى فركب ومشينا معه ‏.‏",
      "text_en": " It was narrated that Jabir bin Samurah said:                     \"The Messenger of Allah went our to the funeral of Ibn Ad-Dahdah, and when he came back an unsaddled horse was brought to him, so he rode and we walked with him.\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20348",
        "20364",
        "20358",
        "10770",
        "393"
      ]
    },
    {
      "id": "sunan-an-nasai-2114",
      "hadith_no": "2114",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا أحمد بن سليمان، عن أبي داود، عن سفيان، عن سماك، عن عكرمة، مرسل ‏.‏",
      "text_en": " Narrated 'Ikramah:                     A similar, Mursal, report was narrated from 'Ikramah.",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "30002",
        "20012",
        "10770"
      ]
    },
    {
      "id": "sunan-an-nasai-2137",
      "hadith_no": "2137",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا محمد بن عبيد، قال حدثنا إسماعيل، عن محمد بن سعد بن أبي وقاص، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الشهر هكذا وهكذا وهكذا ‏\"‏ ‏.‏ وصفق محمد بن عبيد بيديه ينعتها ثلاثا ثم قبض في الثالثة الإبهام في اليسرى ‏.‏ قال يحيى بن سعيد قلت لإسماعيل عن أبيه قال لا ‏.‏",
      "text_en": " It was narrated that Muhammad bin Sad bin Abi Waqqas said:                     \"The Messenger of Allah said: 'The month is like this and like this and like this.\" (One of the narrators) Muhammad bin 'Ubaid clapped his hands three time to demonstrate it, then he withheld his left thumb the third time. Yahya bin Saeed said to Ismail (One of the narrators): \"Form his father?' He said: \"No.\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "30213",
        "11418",
        "30008"
      ]
    },
    {
      "id": "sunan-an-nasai-2148",
      "hadith_no": "2148",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا يزيد، قال أنبأنا عبد الملك بن أبي سليمان، عن عطاء، عن أبي هريرة، قال تسحروا فإن في السحور بركة ‏.‏ رفعه ابن أبي ليلى ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"Eat Sahur, for in Sahur there is blessing.\"  (Sahih Mawquf) while Ibn Abi Laila narrated it in Marfu form:",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20472",
        "10945",
        "11029",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-2160",
      "hadith_no": "2160",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا حسين، عن زائدة، عن الأعمش، عن عمارة، عن أبي عطية، قال دخلت أنا ومسروق، على عائشة فقال لها مسروق رجلان من أصحاب رسول الله صلى الله عليه وسلم كلاهما لا يألو عن الخير أحدهما يؤخر الصلاة والفطر والآخر يعجل الصلاة والفطر ‏.‏ فقالت عائشة أيهما الذي يعجل الصلاة والفطر قال مسروق عبد الله بن مسعود ‏.‏ فقالت عائشة هكذا كان يصنع رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated that Abu 'Atiyyah said:                     \"Masruq and I came to 'Aishah, and Masruq said to her: 'There are two men from among the Companions of the Messenger of Allah both of whom are good; one of them delays the prayer and Ifar, and the other hastens the prayer and Iftar.' 'Aishah said: 'Which of them is the one who hastens the prayer and Iftar?' Masruq said: 'That is what the Messenger of Allah  used to do.\"'",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "11278",
        "20320",
        "11060",
        "11379"
      ]
    },
    {
      "id": "sunan-an-nasai-2181",
      "hadith_no": "2181",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا أبو داود، عن سفيان، عن منصور، عن خالد بن سعد، عن عائشة، قالت كان النبي صلى الله عليه وسلم يصوم شعبان ‏.‏",
      "text_en": " It was narrated that Aishah said:                     \"The Prophet used to fast Shaban.\" '",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "30002",
        "20012",
        "11067",
        "11625",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-2270",
      "hadith_no": "2270",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا موسى بن مروان، قال حدثنا محمد بن حرب، عن الأوزاعي، قال أخبرني يحيى، قال حدثني أبو قلابة، قال حدثني أبو المهاجر، قال حدثني أبو أمية يعني الضمري، أنه قدم على النبي صلى الله عليه وسلم فذكر نحوه ‏.‏",
      "text_en": " Abu Umayyah Ad-Damri narrated:                     That he came to Prophet, and he mentioned something similar.",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "35154",
        "30373",
        "20024",
        "11449",
        "11047"
      ]
    },
    {
      "id": "sunan-an-nasai-2282",
      "hadith_no": "2282",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا عبيد الله، قال أنبأنا إسرائيل، عن موسى، - هو ابن أبي عائشة - عن غيلان، قال خرجت مع أبي قلابة في سفر فقرب طعاما فقلت إني صائم ‏.‏ فقال إن رسول الله صلى الله عليه وسلم خرج في سفر فقرب طعاما فقال لرجل ‏\"‏ ادن فاطعم ‏\"‏ ‏.‏ قال إني صائم ‏.‏ قال ‏\"‏ إن الله وضع عن المسافر نصف الصلاة والصيام في السفر ‏\"‏ ‏.‏ فادن فاطعم فدنوت فطعمت ‏.‏",
      "text_en": " It was narrated that Ghalian said:                     \"I went out with Abu Qilabah on a journey and he brought some food. I said: 'I am fasting.' He said: 'The Messenger of Allah went out on a journey and brought some food, and said to a man: Come and eat. He said: I am fasting. He said: Allah has waived for the traveler half of the prayer and fasting when traveling, so come and eat. So I came close and ate.\"'",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "11201",
        "20311",
        "11399",
        "11300"
      ]
    },
    {
      "id": "sunan-an-nasai-2359",
      "hadith_no": "2359",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا زيد بن الحباب، قال أخبرني ثابت بن قيس الغفاري، قال حدثني أبو سعيد المقبري، قال حدثني أبو هريرة، عن أسامة بن زيد، أن رسول الله صلى الله عليه وسلم كان يسرد الصوم فيقال لا يفطر ويفطر فيقال لا يصوم ‏.‏",
      "text_en": " It was narrated from Usamah bin Zaid:                     That the Messenger of Allah used to fast continually and it ws said that he would not break his fast, and he used not to fast and it was said that he would not fast.",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20650",
        "239",
        "11212",
        "13",
        "50"
      ]
    },
    {
      "id": "sunan-an-nasai-2363",
      "hadith_no": "2363",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا أبو داود، عن سفيان، عن منصور، عن خالد بن سعد، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يتحرى يوم الاثنين والخميس ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"The Messenger of Allah used to be keen to fast on Mondays and Thursday.\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "30002",
        "20012",
        "11067",
        "11625",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-2451",
      "hadith_no": "2451",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا يعلى، - وهو ابن عبيد - قال حدثنا الأعمش، عن شقيق، عن مسروق، والأعمش، عن إبراهيم، قالا قال معاذ بعثني رسول الله صلى الله عليه وسلم إلى اليمن فأمرني أن آخذ من كل أربعين بقرة ثنية ومن كل ثلاثين تبيعا ومن كل حالم دينارا أو عدله معافر ‏.‏",
      "text_en": " Muadh said:                     \"The Messenger of Allah sent me to Yemen, and he commanded me to take from every forty cows, a cow in its third year, and from every thirty, a Tabi '(two-year-old), and from every person who had reached the age of puberty a Dinar or is equivalent in Maafir.\" (Daif)",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20372",
        "11060",
        "11353",
        "11018",
        "11060",
        "11051"
      ]
    },
    {
      "id": "sunan-an-nasai-2520",
      "hadith_no": "2520",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا أبو نعيم، قال حدثنا سفيان، عن حنظلة، عن طاوس، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏\"‏ المكيال مكيال أهل المدينة والوزن وزن أهل مكة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that the Prophet (ﷺ) said:                      \"The measure (to be used) is themeasure of the people of Al-Madinah, and the weight (to be used) is the weight of the people of Makkah.\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20348",
        "20012",
        "11243",
        "11053",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-2548",
      "hadith_no": "2548",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا عفان، قال حدثنا وهيب، قال حدثنا عبد الله بن طاوس، عن أبيه، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ مثل البخيل والمتصدق مثل رجلين عليهما جنتان من حديد قد اضطرت أيديهما إلى تراقيهما فكلما هم المتصدق بصدقة اتسعت عليه حتى تعفي أثره وكلما هم البخيل بصدقة تقبضت كل حلقة إلى صاحبتها وتقلصت عليه وانضمت يداه إلى تراقيه ‏\"‏ ‏.‏ وسمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ فيجتهد أن يوسعها فلا تتسع ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Prophet said:                     \"The parable of the miser and the one who gives in charity is that of two men wearing coats of mail with their hands tied to their collarbones. Every time the one who gives thinks of giving in charity, the (coat of mail) expands until it obliterates his traces, and every time the miser thinks of giving charity, every circle (of the coat of mail) contracts and sticks to him, and his hand is tied up to his collarbones.\" I heard the Messenger of Allah say: \"He tries to expand it, but he cannot.\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "30106",
        "20299",
        "11433",
        "11053",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-2559",
      "hadith_no": "2559",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا يزيد، قال حدثنا همام، عن قتادة، عن عمرو بن شعيب، عن أبيه، عن جده، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ كلوا وتصدقوا والبسوا في غير إسراف ولا مخيلة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from his father, that his grandfather said:                     \"Eat, give charity and clothe yourselves, without being extravagant, and without showing off.\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20472",
        "20297",
        "11019",
        "19934",
        "19911"
      ]
    },
    {
      "id": "sunan-an-nasai-2592",
      "hadith_no": "2592",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا يحيى بن آدم، قال حدثنا سفيان الثوري، عن حكيم بن جبير، عن محمد بن عبد الرحمن بن يزيد، عن أبيه، عن عبد الله بن مسعود، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من سأل وله ما يغنيه جاءت خموشا أو كدوحا في وجهه يوم القيامة ‏\"‏ ‏.‏ قيل يا رسول الله وماذا يغنيه أو ماذا أغناه قال ‏\"‏ خمسون درهما أو حسابها من الذهب ‏\"‏ ‏.‏ قال يحيى قال سفيان وسمعت زبيدا يحدث عن محمد بن عبد الرحمن بن يزيد ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Mas'ud said:                     \"The Messenger of Allah said:  'Whoever asks when he has enough to make him independent of means will have lacerations on his face on the Day of Resurrection.' It was said: 'O Messenger of Allah, what would make him independent of means?' He said: 'Fifty Dirhams or its equivalent of gold.\"'",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20364",
        "20012",
        "19866",
        "16"
      ]
    },
    {
      "id": "sunan-an-nasai-2594",
      "hadith_no": "2594",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا أحمد بن سليمان، قال أنبأنا يحيى بن آدم، عن سفيان بن عيينة، عن داود بن شابور، عن عمرو بن شعيب، عن أبيه، عن جده، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من سأل وله أربعون درهما فهو الملحف ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from his father, that his grandfather said:                     \"The Messenger of Allah said:  'Whoever asks when he has forty Dirhams I being too demanding when asking.\"'",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20364",
        "20005",
        "13018",
        "19934",
        "19911"
      ]
    },
    {
      "id": "sunan-an-nasai-2599",
      "hadith_no": "2599",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا محمد بن بشر، قال أنبأنا شعبة، عن عبد الملك، عن زيد بن عقبة، عن سمرة بن جندب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن المسائل كدوح يكدح بها الرجل وجهه فمن شاء كدح وجهه ومن شاء ترك إلا أن يسأل الرجل ذا سلطان أو شيئا لا يجد منه بدا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Samurah bin Jundab said:                     \"The Messenger of Allah said: \"Every time a man begs, it will turn into lacerations on his face (on the Day of Resurrection). So whoever wants his face to be lacerated (let him ask), and whoever does not want that (let him not ask): except in the case of a man who asks a Sultan, or he asks when he can find no alternative.\"'",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20352",
        "20020",
        "11368",
        "15166",
        "394"
      ]
    },
    {
      "id": "sunan-an-nasai-2602",
      "hadith_no": "2602",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا مسكين بن بكير، قال حدثنا الأوزاعي، عن الزهري، عن سعيد بن المسيب، عن حكيم بن حزام، قال سألت رسول الله صلى الله عليه وسلم فأعطاني ثم سألته فأعطاني ثم سألته فأعطاني ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ يا حكيم إن هذا المال خضرة حلوة من أخذه بسخاوة نفس بورك له فيه ومن أخذه بإشراف النفس لم يبارك له فيه وكان كالذي يأكل ولا يشبع واليد العليا خير من اليد السفلى ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Hakim bin Hizam said:                     \"I asked the Messenger of Allah and he gave me, then I asked him and he gave me, then I asked him and he gave me. Then he said: 'O Kahim! This wealth is attractive and sweet. Whoever takes it without being greedy, it will be blessed for him, and whoever takes it with avarice, it will not be blessed for him. He is like one who eats and is not satisfied. And the upper hand is better than the lower hand.\"'",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20463",
        "20024",
        "11013",
        "11002",
        "423"
      ]
    },
    {
      "id": "sunan-an-nasai-2643",
      "hadith_no": "2643",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا يزيد، - وهو ابن هارون - قال أنبأنا هشام، عن محمد، عن يحيى بن أبي إسحاق، عن سليمان بن يسار، عن الفضل بن عباس، أنه كان رديف النبي صلى الله عليه وسلم فجاءه رجل فقال يا رسول الله إن أمي عجوز كبيرة وإن حملتها لم تستمسك وإن ربطتها خشيت أن أقتلها ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أرأيت لو كان على أمك دين أكنت قاضيه ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ فحج عن أمك ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Al-Fadl bin 'Abbas that:                     he was riding behind the Messenger of Allah and a man came and said: \"O Messenger of Allah! My mother is an old woman and she cannot sit firmly in the saddle. If I tie her I fear that I may kill her.\" The Messenger of Allah said: \"Don't you think that if your mother owed a debt you would pay it off?\" He said: \"Yes.\" Her said: \"Then perform Hajj on behalf of your mother.\"(Shih)",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20472",
        "20295",
        "20278",
        "11314",
        "11005",
        "135"
      ]
    },
    {
      "id": "sunan-an-nasai-2821",
      "hadith_no": "2821",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا عفان، قال حدثنا حماد بن سلمة، قال أنبأنا قيس بن سعد، عن عطاء، أن ابن عباس، قال لزيد بن أرقم ما علمت أن النبي صلى الله عليه وسلم أهدي له عضو صيد وهو محرم فلم يقبله قال نعم ‏.‏",
      "text_en": " It was narrated from 'Ata' that Ibn 'Abbas said to Zaid bin Arqam:                     \"Do you not know that the Prophet was given a piece of game meant when he was in Ihram and he did not accept it?\" He said: \"Yes.\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "30106",
        "20021",
        "172",
        "11029",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-2883",
      "hadith_no": "2883",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا يحيى بن آدم، عن حفص بن غياث، عن الأعمش، عن إبراهيم، عن الأسود، عن عبد الله، قال كنا مع رسول الله صلى الله عليه وسلم بالخيف من منى حتى نزلت ‏{‏ والمرسلات عرفا ‏}‏ فخرجت حية فقال رسول الله صلى الله عليه وسلم ‏\"‏ اقتلوها ‏\"‏ ‏.‏ فابتدرناها فدخلت في جحرها ‏.‏",
      "text_en": " It was narrated that Abdullah said:                     \"We were with the Messenger of Allah in Al-Khaif, which is in Mina, when the following was revealed: 'By the winds sent forth one after another.' A snake came out, and the Messenger of Allah said: 'Kill it.' So they rushed to kill, but it went back into its hole.\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20364",
        "20317",
        "11060",
        "11051",
        "11054",
        "16"
      ]
    },
    {
      "id": "sunan-an-nasai-2908",
      "hadith_no": "2908",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا أبو نعيم، قال حدثنا سيف بن سليمان، قال سمعت مجاهدا، يقول أتي ابن عمر في منزله فقيل هذا رسول الله صلى الله عليه وسلم قد دخل الكعبة فأقبلت فأجد رسول الله صلى الله عليه وسلم قد خرج وأجد بلالا على الباب قائما فقلت يا بلال أصلى رسول الله صلى الله عليه وسلم في الكعبة قال نعم ‏.‏ قلت أين قال ما بين هاتين الأسطوانتين ركعتين ثم خرج فصلى ركعتين في وجه الكعبة ‏.‏",
      "text_en": " Some one came to Ibn Umar in his house and said:                     The Messenger of Allah has entered the Kabah.\" So Ibn Umar said, I (Ibn Umar) came and found that the Messenger of Allah had come out, and I found Bilal standing at the door. I said: \"O Bilal, did the Messenger of Allah pray inside the Kabah?' He said: \"Ues.\" I said: \"Where>\" He said: \"Between these two columns, two Rakahs. Then he came out and prayed two Rakahs in front of the Kabah.\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20348",
        "11558",
        "11028"
      ]
    },
    {
      "id": "sunan-an-nasai-3093",
      "hadith_no": "3093",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا مؤمل بن الفضل، قال حدثنا الوليد، قال حدثني شعيب بن أبي حمزة، وسفيان بن عيينة، وذكر، آخر عن الزهري، عن سعيد بن المسيب، عن أبي هريرة، قال لما جمع أبو بكر لقتالهم فقال عمر يا أبا بكر كيف تقاتل الناس وقد قال رسول الله صلى الله عليه وسلم ‏\"‏ أمرت أن أقاتل الناس حتى يقولوا لا إله إلا الله فإذا قالوها عصموا مني دماءهم وأموالهم إلا بحقها ‏\"‏ ‏.‏ قال أبو بكر رضى الله عنه لأقاتلن من فرق بين الصلاة والزكاة والله لو منعوني عناقا كانوا يؤدونها إلى رسول الله صلى الله عليه وسلم لقاتلتهم على منعها ‏.‏ قال عمر رضى الله عنه فوالله ما هو إلا أن رأيت أن الله تعالى قد شرح صدر أبي بكر لقتالهم فعرفت أنه الحق ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                      \"When Abu Bakr mobilized to fight them, 'Umar said: 'O Abu Bakr, how can you fight the people when the Messenger of Allah (ﷺ) said: \"I have been commanded to fight the people until they say La ilaha illallah (there is none worthy or worship except Allah). Whoever says La ilaha illallah, his life and his property are safe from me, except for its right, and his reckoning will be with Allah?'\" Abu Bakr, may Allah be pleased with me him, said: 'By Allah, I will surely fight those who separate prayer and Zakah, for Zakah is what is due on wealth. By Allah, if they withhold from me a small she-goat that they used to give to the Messenger of Allah (ﷺ) I will fight them for withholding it.' ('Umar said) 'By Allah, when I realized that Allah, the Most High, had opened the chest of Abu Bakr to fighting them, then I knew that it was the truth.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "38659",
        "20733",
        "20428",
        "20005",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-3107",
      "hadith_no": "3107",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا جعفر بن عون، قال حدثنا مسعر، عن محمد بن عبد الرحمن، عن عيسى بن طلحة، عن أبي هريرة، قال لا يبكي أحد من خشية الله فتطعمه النار حتى يرد اللبن في الضرع ولا يجتمع غبار في سبيل الله ودخان جهنم في منخرى مسلم أبدا ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                      \"No man who weeps for fear of Allah will be touched by the Fire until the milk goes back into the udders. An the dust (of Jihad) in the cause of Allah, and the smoke of Hell, will never be combined in the nostrils of a Muslim.\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20416",
        "20359",
        "11105",
        "10573",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-3194",
      "hadith_no": "3194",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا جعفر بن عون، عن أبي عميس، عن عبد الله بن عبد الله بن جبر، عن أبيه، أن رسول الله صلى الله عليه وسلم عاد جبرا فلما دخل سمع النساء يبكين ويقلن كنا نحسب وفاتك قتلا في سبيل الله ‏.‏ فقال ‏\"‏ وما تعدون الشهادة إلا من قتل في سبيل الله إن شهداءكم إذا لقليل القتل في سبيل الله شهادة والبطن شهادة والحرق شهادة والغرق شهادة والمغموم - يعني الهدم - شهادة والمجنوب شهادة والمرأة تموت بجمع شهيدة ‏\"‏ ‏.‏ قال رجل أتبكين ورسول الله صلى الله عليه وسلم قاعد قال ‏\"‏ دعهن فإذا وجب فلا تبكين عليه باكية ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin 'Abdullah bin Jabr, from his father, that the Messenger of Allah (ﷺ) visited Jabr (when he was sick). When he entered he heard the women crying and saying:                      \"We thought that your death would come when fighting in the cause of Allah.\" He said: \"You think that martyrdom only comes when one is killed in the cause of Allah. In that case your martyrs would be few. Being killed in the  cause of Allah is martyrdom, dying of an abdominal complaint is martyrdom, being burned to death is martyrdom, drowning is martyrdom, being crushed beneath a falling wall is martyrdom, dying of pleurisy is martyrdom, and the woman who dies along with her fetus is a martyr.\" A man said: \"Are you weeping when the Messenger of Allah (ﷺ) is sitting here?\" He said: \"Let them be, but if he dies on one should weep for him.\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20416",
        "11185",
        "12206"
      ]
    },
    {
      "id": "sunan-an-nasai-3355",
      "hadith_no": "3355",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا يزيد، قال حدثنا سفيان، عن منصور، عن إبراهيم، عن علقمة، عن عبد الله، أنه أتي في امرأة تزوجها رجل فمات عنها ولم يفرض لها صداقا ولم يدخل بها فاختلفوا إليه قريبا من شهر لا يفتيهم ثم قال أرى لها صداق نسائها لا وكس ولا شطط ولها الميراث وعليها العدة ‏.‏ فشهد معقل بن سنان الأشجعي أن رسول الله صلى الله عليه وسلم قضى في بروع بنت واشق بمثل ما قضيت ‏.‏",
      "text_en": " It was narrated from 'Abdullah that a woman was brought to him who had married a man then he had died without naming any dowry for her and without consummating the marriage with her. They kept coming to him for nearly a month, and he did not issue any ruling to them. Then he said:                      \"I think that she should have a dowry like that of her peers no less, with no injustice and she may inherit from him and she has to observe the 'Iddah.\" Ma'qil bin Sinan Al-Ashja'i testified: \"The Messenger of Allah passed a similar judgment concerning Birwa' bint Washiq.\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20472",
        "20012",
        "11067",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "id": "sunan-an-nasai-3625",
      "hadith_no": "3625",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Wills - كتاب الوصايا",
      "chapter_no": "30",
      "text_ar": "أخبرني أحمد بن سليمان، قال حدثنا عارم، قال حدثنا حماد بن زيد، عن ابن عون، عن إبراهيم، عن الأسود، عن عائشة، قالت توفي رسول الله صلى الله عليه وسلم وليس عنده أحد غيري - قالت - ودعا بالطست‏.‏",
      "text_en": " It was narrated that 'Aishah said:                      \"The Messenger of Allah died when no one was with him except me.\" She said: \"And he called for a vessel.\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20283",
        "20022",
        "11071",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-3627",
      "hadith_no": "3627",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Wills - كتاب الوصايا",
      "chapter_no": "30",
      "text_ar": "أخبرنا عمرو بن منصور، وأحمد بن سليمان، - واللفظ لأحمد - قالا حدثنا أبو نعيم، قال حدثنا سفيان، عن سعد بن إبراهيم، عن عامر بن سعد، عن سعد، قال جاءني النبي صلى الله عليه وسلم يعودني وأنا بمكة قلت يا رسول الله أوصي بمالي كله قال ‏\"‏ لا ‏\"‏‏.‏ قلت فالشطر قال ‏\"‏ لا ‏\"‏‏.‏ قلت فالثلث قال ‏\"‏ الثلث والثلث كثير إنك أن تدع ورثتك أغنياء خير من أن تدعهم عالة يتكففون الناس يتكففون في أيديهم ‏\"‏‏.‏",
      "text_en": " It was narrated that Sa'd said:                      \"The Prophet came to visit me when I was in Makkah. I said: 'O Messenger of Allah, shall I bequeath all my money?' He said: 'No.' I said: 'One-half?' He said: 'No.' I said: 'One-third?' He said: '(Bequeath) one-third, and one-third is a lot. If you leave your heirs independent of means, that is better than if you leave them poor and holding out their hands to people.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38433",
        "38022",
        "20348",
        "20012",
        "11063",
        "10554",
        "9"
      ]
    },
    {
      "id": "sunan-an-nasai-3629",
      "hadith_no": "3629",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Wills - كتاب الوصايا",
      "chapter_no": "30",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا أبو نعيم، قال حدثنا مسعر، عن سعد بن إبراهيم، قال حدثني بعض، آل سعد قال مرض سعد فدخل رسول الله صلى الله عليه وسلم فقال يا رسول الله أوصي بمالي كله قال ‏\"‏ لا ‏\"‏‏.‏ وساق الحديث‏.‏",
      "text_en": " One from the family of Sa'd narrated:                      \"Sa'd fell sick and the Messenger of Allah entered upon him and he said: 'O Messenger of Allah, shall I bequeath all my money?' He said: 'No.'\" And he quoted the same Hadith.",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20348",
        "20359",
        "11063"
      ]
    },
    {
      "id": "sunan-an-nasai-3645",
      "hadith_no": "3645",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Wills - كتاب الوصايا",
      "chapter_no": "30",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا عبيد الله بن موسى، قال أنبأنا إسرائيل، عن معاوية، - وهو ابن إسحاق - عن موسى بن طلحة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يا بني عبد مناف اشتروا أنفسكم من ربكم إني لا أملك لكم من الله شيئا يا بني عبد المطلب اشتروا أنفسكم من ربكم إني لا أملك لكم من الله شيئا ولكن بيني وبينكم رحم أنا بالها ببلالها ‏\"‏‏.‏",
      "text_en": " It was narrated that Musa bin Talhah said:                      \"The Messenger of Allah said: 'O Banu 'Abd Manaf! Buy your souls from your Lord. I cannot avail you anything before Allah. Abu Banu 'Abdul-Muttalib! Buy your souls from your Lord. I cannot avail you anything before Allah. But between me and you there are ties of kinship which I will uphold.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20340",
        "20311",
        "11723",
        "579"
      ]
    },
    {
      "id": "sunan-an-nasai-3683",
      "hadith_no": "3683",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Presents - كتاب النحل",
      "chapter_no": "31",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا محمد بن عبيد، قال حدثنا إسماعيل، عن عامر، قال أخبرت أن بشير بن سعد أتى رسول الله صلى الله عليه وسلم فقال يا رسول الله إن امرأتي عمرة بنت رواحة أمرتني أن أتصدق على ابنها نعمان بصدقة وأمرتني أن أشهدك على ذلك ‏.‏ فقال له النبي صلى الله عليه وسلم ‏\"‏ هل لك بنون سواه ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ فأعطيتهم مثل ما أعطيت لهذا ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ فلا تشهدني على جور ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Amir said:                      \"I was told that Bashir bin Sa'd came to the Messenger of Allah and said: 'O Messenger of Allah, my wife 'Amrah bint Rawahah told me to give a gift to her son Nu'man, and she told me to ask you to bear witness to that.' The Prophet said: 'Do you have any other children?' He said: 'Yes.' He said: 'Have you given them something like that which you have given to this one?' He said: 'No.' He said: 'Then do not ask me to bear witness to unfairness.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "30213",
        "11418",
        "11052"
      ]
    },
    {
      "id": "sunan-an-nasai-3684",
      "hadith_no": "3684",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Presents - كتاب النحل",
      "chapter_no": "31",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا أبو نعيم، قال حدثنا زكريا، عن عامر، قال حدثني عبد الله بن عتبة بن مسعود، ح وأنبأنا محمد بن حاتم، قال أنبأنا حبان، قال أنبأنا عبد الله، عن زكريا، عن الشعبي، عن عبد الله بن عتبة بن مسعود، أن رجلا، جاء إلى النبي صلى الله عليه وسلم - وقال محمد أتى النبي صلى الله عليه وسلم - فقال إني تصدقت على ابني بصدقة فاشهد فقال ‏\"‏ هل لك ولد غيره ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ أعطيتهم كما أعطيته ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ أأشهد على جور ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin 'Utbah bin Mas'ud that a man came to the Prophet and said:                      \"I have given a gift to my son, so bear witness.\" He said: \"Do you have any other children?\" He said: \"Yes.\" He said: \"Have you given them something like that which you have given him?\" He said: \"No.\" He said: \"Shall I bear witness to unfairness?\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20348",
        "11338",
        "11052",
        "4145",
        "30514",
        "20218",
        "18",
        "11338",
        "11052",
        "4145"
      ]
    },
    {
      "id": "sunan-an-nasai-3712",
      "hadith_no": "3712",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of ar-Ruqba - كتاب الرقبى",
      "chapter_no": "33",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا يعلى، قال حدثنا سفيان، عن أبي الزبير، عن طاوس، عن ابن عباس، قال لا تحل الرقبى ولا العمرى فمن أعمر شيئا فهو له ومن أرقب شيئا فهو له ‏.‏",
      "text_en": " (A different chain) from Sufyan, from Abu Az-Zubair, from Tawus, from Ibn 'Abbas, who said:                      \"Ruqba and 'Umra are not permissible; whoever is given something on the basis of 'Umra, it is his, and whoever is given something on the basis of Ruqba, it is his.\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20372",
        "20012",
        "11263",
        "11053",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-3713",
      "hadith_no": "3713",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of ar-Ruqba - كتاب الرقبى",
      "chapter_no": "33",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا محمد بن بشر، قال حدثنا حجاج، عن أبي الزبير، عن طاوس، عن ابن عباس، قال لا تصلح العمرى ولا الرقبى فمن أعمر شيئا أو أرقبه فإنه لمن أعمره وأرقبه حياته وموته ‏.‏ أرسله حنظلة ‏.‏",
      "text_en": " (A different chain) from Hajjaj, from Abu Az-Zubair, from Tawus, from Ibn 'Abbas, who said:                      \"'Umra and Ruqba are not proper. Whoever gives something on the basis of 'Umra or Ruqba, it belongs to the one to whom he gave it on that basis, both during his lifetime and after his death.\" Hanzalah narrated it in Mursal form.",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20352",
        "20219",
        "11263",
        "11053",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-3728",
      "hadith_no": "3728",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of 'Umra - كتاب العمرى",
      "chapter_no": "34",
      "text_ar": "أخبرنا أحمد بن سليمان، قال أنبأنا عبيد الله، عن إسرائيل، عن عبد الكريم، عن عطاء، قال نهى رسول الله صلى الله عليه وسلم عن العمرى والرقبى ‏.‏ قلت وما الرقبى قال يقول الرجل للرجل هي لك حياتك ‏.‏ فإن فعلتم فهو جائزة ‏.‏",
      "text_en": " 'Abdul-Karim narrated from 'Ata', who said:                      \"The Messenger of Allah forbade 'Umra and Ruqba.\" I said: \"What is Ruqba?\" He said: \"When one man says to another: 'This belongs to you for the rest of your life.' But if you do that, it is permissible.\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "11201",
        "20311",
        "18655",
        "11029"
      ]
    },
    {
      "id": "sunan-an-nasai-3761",
      "hadith_no": "3761",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا أحمد بن سليمان الرهاوي، وموسى بن عبد الرحمن، قالا حدثنا محمد بن بشر، قال حدثنا سفيان، عن موسى بن عقبة، عن سالم بن عبد الله بن عمر، عن ابن عمر، قال كانت يمين يحلف عليها رسول الله صلى الله عليه وسلم ‏\"‏ لا ومقلب القلوب ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                      \"The oath by which the Messenger of Allah used to swear was: 'No, by the Controller of the hearts.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20352",
        "20012",
        "11106",
        "11011",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-3774",
      "hadith_no": "3774",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا يزيد، قال أنبأنا هشام، عن الحسن، عن عبد الرحمن بن سمرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا تحلفوا بآبائكم ولا بالطواغيت ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdur-Rahman bin Samurah that the Prophet said:                      \"Do not swear by your forefathers or by false gods (At-Tawaghit).\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20472",
        "20295",
        "11016",
        "955"
      ]
    },
    {
      "id": "sunan-an-nasai-3783",
      "hadith_no": "3783",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا عفان، قال حدثنا جرير بن حازم، قال سمعت الحسن، قال حدثنا عبد الرحمن بن سمرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا حلفت على يمين فكفر عن يمينك ثم ائت الذي هو خير ‏\"‏ ‏.‏",
      "text_en": " 'Abdur-Rahman bin Samurah said:                      \"The Messenger of Allah said: 'If you swear an oath, offer expiation for your oath, then do that which is better.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "30106",
        "11272",
        "11016",
        "955"
      ]
    },
    {
      "id": "sunan-an-nasai-3830",
      "hadith_no": "3830",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا عفان، قال حدثنا وهيب، قال حدثنا أيوب، عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏\"‏ من حلف على يمين فقال إن شاء الله فهو بالخيار إن شاء أمضى وإن شاء ترك ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that the Messenger of Allah said:                      \"Whoever swears an oath and says, 'If Allah wills,' then he has the choice: If he wishes, he may go ahead, and if he wishes he may not.\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "30106",
        "20299",
        "11015",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-3869",
      "hadith_no": "3869",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا أحمد بن سليمان، عن عبيد الله، قال حدثنا إسرائيل، عن إبراهيم بن مهاجر، عن مجاهد، عن رافع بن خديج، قال مر النبي صلى الله عليه وسلم على أرض رجل من الأنصار قد عرف أنه محتاج فقال ‏‏\"‏‏ لمن هذه الأرض ‏‏\"‏‏‏.‏‏ قال لفلان أعطانيها بالأجر‏.‏‏ فقال ‏‏\"‏‏ لو منحها أخاه ‏‏\"‏‏‏.‏‏ فأتى رافع الأنصار فقال إن رسول الله صلى الله عليه وسلم نهاكم عن أمر كان لكم نافعا وطاعة رسول الله صلى الله عليه وسلم أنفع لكم‏.‏‏",
      "text_en": " It was narrated that Rafi' bin Khadij said:                      \"The Prophet passed by the land of a man from among the Ansar who he knew was in need and said: 'Whose is this land?' He said: 'So and so's; he has given it to us in return for rent.' He said: 'Why did he not give it to his brother?'\" Rafi' came to the Ansar and said: \"The Messenger of Allah has forbidden something for you which was beneficial, but obedience to the command of the Messenger of Allah is more beneficial for you.\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "11201",
        "20311",
        "10739",
        "11028",
        "1986"
      ]
    },
    {
      "id": "sunan-an-nasai-3891",
      "hadith_no": "3891",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا عبيد الله بن موسى، قال أنبأنا إسرائيل، عن طارق، عن سعيد، قال نهى رسول الله صلى الله عليه وسلم عن المحاقلة قال سعيد فذكره نحوه‏.‏‏ رواه سفيان الثوري عن طارق‏.‏‏",
      "text_en": " It was narrated that Sa'eed said:                      \"The Messenger of Allah forbade Al-Muhaqalah.\" Sa'eed said: \"And he narrated something similar.\" And Sufyan Ath-Thawri reported it from Tariq.",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20340",
        "20311",
        "11355",
        "11168"
      ]
    },
    {
      "id": "sunan-an-nasai-3975",
      "hadith_no": "3975",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا مؤمل بن الفضل، قال حدثنا الوليد، قال حدثني شعيب بن أبي حمزة، وسفيان بن عيينة، وذكر، آخر عن الزهري، عن سعيد بن المسيب، عن أبي هريرة، قال فأجمع أبو بكر لقتالهم فقال عمر يا أبا بكر كيف تقاتل الناس وقد قال رسول الله صلى الله عليه وسلم ‏\"‏ أمرت أن أقاتل الناس حتى يقولوا لا إله إلا الله فإذا قالوها عصموا مني دماءهم وأموالهم إلا بحقها ‏\"‏ ‏.‏ قال أبو بكر لأقاتلن من فرق بين الصلاة والزكاة والله لو منعوني عناقا كانوا يؤدونها إلى رسول الله صلى الله عليه وسلم لقاتلتهم على منعها ‏.‏ قال عمر فوالله ما هو إلا أن رأيت الله قد شرح صدر أبي بكر لقتالهم فعرفت أنه الحق ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"So Abu Bakr decided to fight them, then 'Umar said: 'O Abu Bakr, how can you fight the people when the Messenger of Allah [SAW] said: \"I have been commanded to fight the people until they say La ilaha illallah, and if they say it, their blood and their wealth will be safe from me except for a right that is due.?' Abu Bakr said: 'I will fight whoever separates prayer and Zakah. By Allah, if they withhold from me a young goat that they used to give to the Messenger of Allah [SAW], I will fight them for withholding it.' 'Umar said: 'By Allah, as soon as I realized that Allah has expanded the chest of Abu Bakr to fight them, I knew that it was the truth.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "38659",
        "20733",
        "20428",
        "20005",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-3980",
      "hadith_no": "3980",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "‏{‏ أخبرنا أحمد بن سليمان، ‏}‏ قال عبيد الله حدثنا إسرائيل، عن سماك، عن النعمان بن سالم، عن رجل، حدثه قال دخل علينا رسول الله صلى الله عليه وسلم ونحن في قبة في مسجد المدينة وقال فيه ‏\"‏ إنه أوحي إلى أن أقاتل الناس حتى يقولوا لا إله إلا الله ‏\"‏ ‏.‏ نحوه ‏.‏",
      "text_en": " It was narrated from An-Nu'man bin Salim that:                     A man said to him: \"The Messenger of Allah [SAW] came to us while we were in a tent inside the Masjid of Al-Al-Madinah, and he said to us: 'It has been revealed to me that I should fight the people until they say La ilaha illallah.'\" A similar narration.",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "11201",
        "20311",
        "10770",
        "10972"
      ]
    },
    {
      "id": "sunan-an-nasai-3981",
      "hadith_no": "3981",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا الحسن بن محمد بن أعين، قال حدثنا زهير، قال حدثنا سماك، عن النعمان بن سالم، قال سمعت أوسا، يقول دخل علينا رسول الله صلى الله عليه وسلم ونحن في قبة وساق الحديث ‏.‏",
      "text_en": " It was narrated that An-Nu'man bin Salim said:                     \"I heard Aws say: 'The Messenger of Allah [SAW] came to us when we were in a tent.'\" And he quoted the same Hadith.",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20418",
        "20321",
        "10770",
        "10972"
      ]
    },
    {
      "id": "sunan-an-nasai-3993",
      "hadith_no": "3993",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا أبو داود، عن سفيان، عن الأعمش، عن أبي وائل، قال قال عبد الله أول ما يقضى بين الناس يوم القيامة في الدماء ‏.‏",
      "text_en": " It was narrated from 'Abdullah that:                     The Messenger of Allah [SAW] said: \"The first matter concerning which scores will be settled among the people on the Day of Resurrection will be bloodshed.\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "30002",
        "20012",
        "11060",
        "11353"
      ]
    },
    {
      "id": "sunan-an-nasai-4027",
      "hadith_no": "4027",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا محمد بن بشر، قال حدثنا سفيان، عن أيوب، عن أبي قلابة، عن أنس، قال أتى النبي صلى الله عليه وسلم نفر من عكل أو عرينة فأمر لهم - واجتووا المدينة - بذود أو لقاح يشربون ألبانها وأبوالها فقتلوا الراعي واستاقوا الإبل فبعث في طلبهم فقطع أيديهم وأرجلهم وسمل أعينهم ‏.‏",
      "text_en": " It was narrated that Anas said:                     \"A group of men from 'Ukl, or 'Uraynah, came to the Prophet [SAW], and when the climate of Al-Madinah did not suit them, he told them to go to some camels and drink their milk and urine. Then they killed the herdsman and stole the camels. He sent (men) after them, and had their hands and feet cut off, and their eyes gouged out.\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20352",
        "20012",
        "11015",
        "11047",
        "19"
      ]
    },
    {
      "id": "sunan-an-nasai-4051",
      "hadith_no": "4051",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا عبيد الله بن موسى، قال أنبأنا إسرائيل، عن مغيرة، عن الشعبي، عن جرير بن عبد الله، قال إذا أبق العبد إلى أرض الشرك فلا ذمة له ‏.‏",
      "text_en": " It was narrated that Jarir bin 'Abdullah said:                     \"If a slave runs away to the land of Shirk, there is no protection (or immunity) for him.\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20340",
        "20311",
        "11072",
        "11052",
        "4057"
      ]
    },
    {
      "id": "sunan-an-nasai-4089",
      "hadith_no": "4089",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا معاوية بن هشام، قال حدثنا سفيان، عن عبد الله بن الحسن، عن إبراهيم بن محمد بن طلحة، عن عبد الله بن عمرو، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من قتل دون ماله فهو شهيد ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin 'Amr said:                     \"The Messenger of Allah [SAW] said: 'Whoever is killed defending his wealth, he is a martyr.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20609",
        "20012",
        "19809",
        "11827",
        "29"
      ]
    },
    {
      "id": "sunan-an-nasai-4117",
      "hadith_no": "4117",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا يعلى، قال حدثنا سفيان، عن منصور، عن ربعي، عن أبي بكرة، قال إذا حمل الرجلان المسلمان السلاح أحدهما على الآخر فهما على جرف جهنم فإذا قتل أحدهما الآخر فهما في النار ‏.‏",
      "text_en": " It was narrated that Abu Bakrah said:                     \"If two Muslim men bear weapons against each other, then they are both on the brink of Hell. And if one of them kills the other, they will both be in Hell.\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20372",
        "20012",
        "11067",
        "11334",
        "3229"
      ]
    },
    {
      "id": "sunan-an-nasai-4212",
      "hadith_no": "4212",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of al-'Aqiqah - كتاب العقيقة",
      "chapter_no": "40",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا أبو نعيم، قال حدثنا داود بن قيس، عن عمرو بن شعيب، عن أبيه، عن جده، قال سئل رسول الله صلى الله عليه وسلم عن العقيقة فقال ‏\"‏ لا يحب الله عز وجل العقوق ‏\"‏ ‏.‏ وكأنه كره الاسم قال لرسول الله صلى الله عليه وسلم إنما نسألك أحدنا يولد له ‏.‏ قال ‏\"‏ من أحب أن ينسك عن ولده فلينسك عنه عن الغلام شاتان مكافأتان وعن الجارية شاة ‏\"‏ ‏.‏ قال داود سألت زيد بن أسلم عن المكافأتان قال الشاتان المشبهتان تذبحان جميعا ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shuaib, from his fahther, that his grandfather said:                     \"The messenger of Allah was asked about the 'Aqiqah and he said: \"Allah, the mighty and sublime, does not like Al-Uquq' as if he disliked the word (Al-Aqiqah). He said to the Messenger of Allah: 'But one of us may offer a sacrifice when a child is born to him.' He said: 'Whoever wants to offer a sacrifice for his child, let him do so, for a boy; two sheep, Mukafaatan, (of equal age), and for a girl, one.' (One of the narrators) Dawud said: 'I asked Ziad bin Aslam about the word Mukafaatan and he said: 'Two similar sheep that are slaughtered together.",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20348",
        "11845",
        "19934",
        "19911"
      ]
    },
    {
      "id": "sunan-an-nasai-4215",
      "hadith_no": "4215",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of al-'Aqiqah - كتاب العقيقة",
      "chapter_no": "40",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا عفان، قال حدثنا حماد، عن قيس بن سعد، عن عطاء، وطاوس، ومجاهد، عن أم كرز، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ في الغلام شاتان مكافأتان وفي الجارية شاة ‏\"‏ ‏.‏",
      "text_en": " it was narrated from Um Kurz that the Messenger of Allah said:                     \"for a boy two sheep, Mukafaatan (of equal age), and for a girl, one sheep.\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "30106",
        "20022",
        "172",
        "11029",
        "11053",
        "11028"
      ]
    },
    {
      "id": "sunan-an-nasai-4274",
      "hadith_no": "4274",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا يزيد، - وهو ابن هارون - أنبأنا زكريا، وعاصم، عن الشعبي، عن عدي بن حاتم، قال سألت رسول الله صلى الله عليه وسلم عن صيد المعراض فقال ‏\"‏ ما أصاب بحده فكل وما أصاب بعرضه فهو وقيذ ‏\"‏ ‏.‏ قال وسألته عن كلب الصيد فقال ‏\"‏ إذا أرسلت كلبك وذكرت اسم الله عليه فكل ‏\"‏ ‏.‏ قلت وإن قتل قال ‏\"‏ وإن قتل فإن أكل منه فلا تأكل وإن وجدت معه كلبا غير كلبك وقد قتله فلا تأكل فإنك إنما ذكرت اسم الله عز وجل على كلبك ولم تذكر على غيره ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Adiyy bin Hatim said:                     \"I asked the Messenger of Allah about hunting with the Mirad. He said: 'whatever is struck with the sharp edge, eat, and whatever is hit with its broad side, it is an animal killed by a blow. \"\" He said: \"And I asked him about hunting dogs. He said: 'If you release your dog and mention the name of Allah over it, then eat.,' I said: 'Even it he kills it?' He said: 'Even if he kills it?\" He said: 'Even if he kills it. But if he has eaten some of it, then do not eat. And if you find another dog with your dog and he has killed (the game), then do not eat, for you only said the name of Allah over your dog, not over your dog, not over any other.\"'",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20472",
        "11338",
        "11080",
        "11052",
        "212"
      ]
    },
    {
      "id": "sunan-an-nasai-4297",
      "hadith_no": "4297",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا حسين بن علي، عن زائدة، عن سعيد بن مسروق، عن عباية بن رفاعة بن رافع، عن رافع بن خديج، قال بينما نحن مع رسول الله صلى الله عليه وسلم في ذي الحليفة من تهامة فأصابوا إبلا وغنما ورسول الله صلى الله عليه وسلم في أخريات القوم فعجل أولهم فذبحوا ونصبوا القدور فدفع إليهم رسول الله صلى الله عليه وسلم فأمر بالقدور فأكفئت ثم قسم بينهم فعدل عشرا من الشاء ببعير فبينما هم كذلك إذ ند بعير وليس في القوم إلا خيل يسيرة فطلبوه فأعياهم فرماه رجل بسهم فحبسه الله فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن لهذه البهائم أوابد كأوابد الوحش فما غلبكم منها فاصنعوا به هكذا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Rafi bin Khadij said:                     \"While we were with the Messenger of Allah at Dhul-Hulaifah in Tihamanb, they acquired some camels and sheep (as spoils of war). The Messenger of Allah was among the last of the people, and the first of them hastened to slaughter (the animals) and set up pots (For cooking the meat). The Messenger of Allah came and ordered that the pots be came and ordered that the pots be overturned, then he divided it making ten sheep equivalent to one camel. While they were like that, a camel ran away. The people had only a few horses, so they went after fit and it and it got away from them. A man shot an arrow at it and stopped it. The Messenger of Allah said: 'Some of these animals arte untamed like wild animals, so if one of them goes out of your control, do the same.\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20315",
        "20320",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "id": "sunan-an-nasai-4719",
      "hadith_no": "4719",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا أبو نعيم، قال حدثنا سعيد بن عبيد الطائي، عن بشير بن يسار، زعم أن رجلا، من الأنصار يقال له سهل بن أبي حثمة أخبره أن نفرا من قومه انطلقوا إلى خيبر فتفرقوا فيها فوجدوا أحدهم قتيلا فقالوا للذين وجدوه عندهم قتلتم صاحبنا قالوا ما قتلناه ولا علمنا قاتلا ‏.‏ فانطلقوا إلى نبي الله صلى الله عليه وسلم فقالوا يا نبي الله انطلقنا إلى خيبر فوجدنا أحدنا قتيلا ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ الكبر الكبر ‏\"‏ ‏.‏ فقال لهم ‏\"‏ تأتون بالبينة على من قتل ‏\"‏ ‏.‏ قالوا ما لنا بينة ‏.‏ قال ‏\"‏ فيحلفون لكم ‏\"‏ ‏.‏ قالوا لا نرضى بأيمان اليهود ‏.‏ وكره رسول الله صلى الله عليه وسلم أن يبطل دمه فوداه مائة من إبل الصدقة ‏.‏ خالفهم عمرو بن شعيب ‏.‏",
      "text_en": " It was narrated from Sa'eed bin 'Ubaid At-Ta'l from Bushair bin Yasar who said:                     \"A man from among the Ansar who was called Sahl bin Abi Hathmah told him that some of his people went to Khaibar, where they went their separate ways. Then they found one of their numbers slain. They said to those in whose land they found him: 'You killed our companion!' They said: 'We did not kill him and we do not know who killed him.' They went to the prophet of Allah and said: 'O Prophet of Allah, we went to Khaibar and we found one of our number slain.' The Messenger of Allah said:  'Let the elders speak first.' And he said to them: 'Bring proof of the one whom you suspect killed him.' They said: 'We do not have any proof.' He said: \"Then let them swear an oath to you.' They said\" 'We will not accept the oath of the Jews.' The Messenger of Allah did not want his blood to have been shed with no Justice done, so he paid a Diyah of one hundred camels from the Sadaqah.\" 'Amr bin Shu'aib differed with them.",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20348",
        "11629",
        "11810"
      ]
    },
    {
      "id": "sunan-an-nasai-4755",
      "hadith_no": "4755",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا عفان، قال حدثنا حماد بن سلمة، قال حدثنا ثابت، عن أنس، أن أخت الربيع أم حارثة، جرحت إنسانا فاختصموا إلى النبي صلى الله عليه وسلم فقال رسول الله صلى الله عليه وسلم ‏\"‏ القصاص القصاص ‏\"‏ ‏.‏ فقالت أم الربيع يا رسول الله أيقتص من فلانة لا والله لا يقتص منها أبدا ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ سبحان الله يا أم الربيع القصاص كتاب الله ‏\"‏ ‏.‏ قالت لا والله لا يقتص منها أبدا ‏.‏ فما زالت حتى قبلوا الدية ‏.‏ قال ‏\"‏ إن من عباد الله من لو أقسم على الله لأبره ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Anas that:                     the sister of Ar-Rubai' Umm Harithah injured  a person and they referred the dispute to the Messenger of Allah. The Messenger of Allah said: \"Retaliation, retaliation (Qisas).\" Umm Ar-Rabi said: 'O Messenger of Allah, how could retaliation be carried out against so and so? No, by Allah, retaliation willnever be carried out against her!' The Messenger of Allah said: \"Subhan Allah, O Umm Ar-Rabi'! decreed by Allah.\" She said: \"No, by Allah, retaliation will never be carried out against her!\" And she carried on until they accepted Diyah (blood money). He (the prophet) said: \"There are among the slaves of Allah who, if they swear by Allah, Allah fulfills their oath.",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "30106",
        "20021",
        "11269",
        "19"
      ]
    },
    {
      "id": "sunan-an-nasai-4775",
      "hadith_no": "4775",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا أحمد بن سليمان، قال أنبأنا عبيد الله، عن إسرائيل، عن عبد الأعلى، أنه سمع سعيد بن جبير، يقول أخبرني ابن عباس، أن رجلا، وقع في أب كان له في الجاهلية فلطمه العباس فجاء قومه فقالوا ليلطمنه كما لطمه ‏.‏ فلبسوا السلاح فبلغ ذلك النبي صلى الله عليه وسلم فصعد المنبر فقال ‏\"‏ أيها الناس أى أهل الأرض تعلمون أكرم على الله عز وجل ‏\"‏ ‏.‏ فقالوا أنت ‏.‏ فقال ‏\"‏ إن العباس مني وأنا منه لا تسبوا موتانا فتؤذوا أحياءنا ‏\"‏ ‏.‏ فجاء القوم فقالوا يا رسول الله نعوذ بالله من غضبك استغفر لنا ‏.‏",
      "text_en": " Ibn 'Abbad narrated that:                     a man slandered one of his forefathers from the time of the Jahiliyyah, and Al-'Abbas slapped him. His people came and said: \"Let him slap him as he slapped him,\" and they prepared for quarrel. News of that reached the Prophet, and he ascended the Minbar and said: \"O People, which of the people of the Earth do you know to be the most noble before Allah?\" They said: \"You.\" He said: \"Al-Abbas belongs to me and I to him. Do not defame our dead or offend our living.\" Those people came and said: \"O Messenger of Allah, we seek refuge with Allah from your anger; pray to give us.\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "11201",
        "20311",
        "20246",
        "11050",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-4801",
      "hadith_no": "4801",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا يزيد بن هارون، قال أنبأنا محمد بن راشد، عن سليمان بن موسى، عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من قتل خطأ فديته مائة من الإبل ثلاثون بنت مخاض وثلاثون بنت لبون وثلاثون حقة وعشرة بني لبون ذكور ‏\"‏ ‏.‏ قال وكان رسول الله صلى الله عليه وسلم يقومها على أهل القرى أربعمائة دينار أو عدلها من الورق ويقومها على أهل الإبل إذا غلت رفع في قيمتها وإذا هانت نقص من قيمتها على نحو الزمان ما كان فبلغ قيمتها على عهد رسول الله صلى الله عليه وسلم ما بين الأربعمائة دينار إلى ثمانمائة دينار أو عدلها من الورق ‏.‏ قال وقضى رسول الله صلى الله عليه وسلم أن من كان عقله في البقر على أهل البقر مائتى بقرة ومن كان عقله في الشاة ألفى شاة وقضى رسول الله صلى الله عليه وسلم أن العقل ميراث بين ورثة القتيل على فرائضهم فما فضل فللعصبة وقضى رسول الله صلى الله عليه وسلم أن يعقل على المرأة عصبتها من كانوا ولا يرثون منه شيئا إلا ما فضل عن ورثتها وإن قتلت فعقلها بين ورثتها وهم يقتلون قاتلها ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from his father, from his grandfather, that the Messenger of Allah said:                     \"Whoever is killed by mistake, his ransom is one hundred camels: Thirty Bint Makkah, thirty Bint Labun, thirty Hiqqah and ten Bin Labun. \"[1] The Messenger of Allah used to fix the value (of the Diayah for accidental killing) among town-dwellers at four hundred Dinars or the equivalent value in silver. When he calculated the price in terms of people with camels (for Bedouin), it would vary from one time to another. When prices rose, the value in Dinars would rise, and when prices fell the value in Dinars would fall. At the time of the Messenger of Allah the value was between four hundred and eight hundred Dinars, or the equivalent value in silver, eight thousand Dirhams. And the Messenger of Allah ruled that if a person's blood money was paid in cattle, among those who kept cattle, the amount was two hundred cows; and if a person's blood money was paid in sheep, among this who kept sheep, the value was two thousand sheep. The Messenger of Allah ruled that the blood money is part of the estate, to be divided among the heirs of the victim according to their allotted shares, and whatever is left over is for the 'Asabah. And the Messenger of Allah ruled that if a woman commits urder then he 'Asahah, whoever they may be, must pay the blood money, but they do not inherit anything except that which is left over from her heirs; if a woman is killed then her blood money is to be shared among her heirs, and they may kill her killer. (Hasah)",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20472",
        "20719",
        "10880",
        "19934",
        "19911"
      ]
    },
    {
      "id": "sunan-an-nasai-4815",
      "hadith_no": "4815",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا يزيد، قال أنبأنا كهمس، عن عبد الله بن بريدة، عن عبد الله بن مغفل، أنه رأى رجلا يخذف فقال لا تخذف فإن نبي الله صلى الله عليه وسلم كان ينهى عن الخذف أو يكره الخذف ‏.‏ شك كهمس ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin Mughaffal that he saw a man throwing pebbles and he said:                     \"Do not throw pebbles, for the Prophet of Allah forbade throwing pebbles,\" or \"he disliked the throwing of pebbles.\" Kahmas (one of the narrators) was not sure.",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20472",
        "11303",
        "11432",
        "3242"
      ]
    },
    {
      "id": "sunan-an-nasai-4834",
      "hadith_no": "4834",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا معاوية بن هشام، عن سفيان، عن أشعث بن أبي الشعثاء، عن الأسود بن هلال، عن ثعلبة بن زهدم، قال انتهى قوم من بني ثعلبة إلى النبي صلى الله عليه وسلم وهو يخطب فقال رجل يا رسول الله هؤلاء بنو ثعلبة بن يربوع قتلوا فلانا رجلا من أصحاب النبي صلى الله عليه وسلم ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ لا تجني نفس على أخرى ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Tha'1abah bin Zahdam said:                      \"Some people from Banu Tha'labah came to the Prophet (ﷺ) when he was delivering a speech and a man said: 'O Messenger of Allah, these areBanu Tha'labah bin Yarbu' who killed so and so' - one of the Companions of the Prophet (ﷺ). The Prophet (ﷺ) said: 'No soul is affected by the sin of another.\"'",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20609",
        "20012",
        "11324",
        "11620",
        "5002"
      ]
    },
    {
      "id": "sunan-an-nasai-5005",
      "hadith_no": "5005",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book Of Faith and its Signs - كتاب الإيمان وشرائعه",
      "chapter_no": "47",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا أبو داود، عن سفيان، قال وحدثنا أبو نعيم، قال حدثنا سفيان، عن سهيل، عن عبد الله بن دينار، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الإيمان بضع وسبعون شعبة أفضلها لا إله إلا الله وأوضعها إماطة الأذى عن الطريق والحياء شعبة من الإيمان ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah [SAW] said: 'Faith has seventy-odd branches, the most virtuous of which is La ilaha illallah (there is none worthy of worship except Allah) and the least of which is removing something harmful from the road. And modesty (Al-Haya') is a branch of faith.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "30002",
        "20012",
        "20348",
        "20005",
        "11183",
        "11161",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-5051",
      "hadith_no": "5051",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا أبو داود، عن سفيان، عن عبيد الله بن عمر، عن نافع، عن ابن عمر، رضى الله عنهما قال نهى رسول الله صلى الله عليه وسلم عن القزع ‏.‏ قال أبو عبد الرحمن حديث يحيى بن سعيد ومحمد بن بشر أولى بالصواب ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                     \"The Messenger of Allah [SAW] forbade Al-Qaza' (to shave part of the head and leave part).\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "30002",
        "20012",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-5117",
      "hadith_no": "5117",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا أبو داود، - يعني الحفري - عن سفيان، عن الجريري، عن أبي نضرة، عن رجل، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ طيب الرجال ما ظهر ريحه وخفي لونه وطيب النساء ما ظهر لونه وخفي ريحه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah [SAW] said: 'The perfume for men is that whose scent is apparent while its color is hidden, and the perfume for women is that whose color is apparent, while its scent is hidden.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20668",
        "20012",
        "11286",
        "10721",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-5184",
      "hadith_no": "5184",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا يزيد، قال أنبأنا هشام، عن محمد، عن عبيدة، عن علي، قال نهى عن مياثر الأرجوان، ولبس القسي، وخاتم الذهب، ‏.‏",
      "text_en": " It was narrated from 'Abidah, from 'Ali, he said:                     \"He forbade red Al-Mayathir, wearing Al-Qassi, and gold rings.\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20472",
        "20295",
        "20278",
        "11370",
        "5"
      ]
    },
    {
      "id": "sunan-an-nasai-5189",
      "hadith_no": "5189",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا عبيد الله، قال حدثنا إسرائيل، عن منصور، عن سالم، عن رجل، حدثه عن البراء بن عازب، أن رجلا، كان جالسا عند النبي صلى الله عليه وسلم وعليه خاتم من ذهب وفي يد رسول الله صلى الله عليه وسلم مخصرة أو جريدة فضرب بها النبي صلى الله عليه وسلم إصبعه فقال الرجل ما لي يا رسول الله قال ‏\"‏ ألا تطرح هذا الذي في إصبعك ‏\"‏ ‏.‏ فأخذه الرجل فرمى به فرآه النبي صلى الله عليه وسلم بعد ذلك فقال ‏\"‏ ما فعل الخاتم ‏\"‏ ‏.‏ قال رميت به ‏.‏ قال ‏\"‏ ما بهذا أمرتك إنما أمرتك أن تبيعه فتستعين بثمنه ‏\"‏ ‏.‏ وهذا حديث منكر ‏.‏",
      "text_en": " It was narrated from Al-Bara' bin 'Azib that :                     A man was sitting with the Prophet [SAW] and he was wearing a gold ring. The Messenger of Allah [SAW] had a stick in his hand and the Prophet [SAW] struck his finger. The man said: \"What's wrong with me, O Messenger of Allah?\" He said: \"Why don't you get rid of this thing that is on your finger?\" The man took it and threw it away. The Prophet [SAW] saw him after that and said: \"What happened to the ring?\" He said: \"I threw it away.\" He said: \"I did not tell you to do that, rather I told you to sell it and benefit from its price.\" This Hadith is Munkar.",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "11201",
        "20311",
        "11067",
        "11011",
        "400"
      ]
    },
    {
      "id": "sunan-an-nasai-5195",
      "hadith_no": "5195",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا زيد بن الحباب، قال حدثني عبد الله بن مسلم، - من أهل مرو أبو طيبة - قال حدثنا عبد الله بن بريدة، عن أبيه، أن رجلا، جاء إلى النبي صلى الله عليه وسلم وعليه خاتم من حديد فقال ‏\"‏ ما لي أرى عليك حلية أهل النار ‏\"‏ ‏.‏ فطرحه ثم جاءه وعليه خاتم من شبه فقال ‏\"‏ ما لي أجد منك ريح الأصنام ‏\"‏ ‏.‏ فطرحه قال يا رسول الله من أى شىء أتخذه قال ‏\"‏ من ورق ولا تتمه مثقالا ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah bin Buraidah narrated from his father that:                     A man came to the Prophet [SAW] and he was wearing an iron ring. He said: \"Why do I see you wearing the jewelry of the people of Hell?\" He threw it away, then he came and he was wearing a brass ring. He said: \"Why do I notice the stench of idols from you?\" So he threw it away, and said: \"O Messenger of Allah, what should I use?\" He said: \"Silver, but it should not equal a Mithqal.\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20650",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-an-nasai-5200",
      "hadith_no": "5200",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا موسى بن داود، قال حدثنا زهير بن معاوية، عن حميد، عن أنس، قال كان خاتم النبي صلى الله عليه وسلم من فضة فصه منه ‏.‏",
      "text_en": " It was narrated that Anas said:                     \"The ring of the Prophet [SAW] was made of silver and its stone (Fass) was made of silver too.\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20636",
        "20321",
        "11279",
        "19"
      ]
    },
    {
      "id": "sunan-an-nasai-5224",
      "hadith_no": "5224",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا أبو نعيم، قال حدثنا زهير، عن أبي إسحاق، عن أبي الأحوص، عن أبيه، أنه أتى النبي صلى الله عليه وسلم في ثوب دون فقال له النبي صلى الله عليه وسلم ‏\"‏ ألك مال ‏\"‏ ‏.‏ قال نعم من كل المال ‏.‏ قال ‏\"‏ من أى المال ‏\"‏ ‏.‏ قال قد آتاني الله من الإبل والغنم والخيل والرقيق ‏.‏ قال ‏\"‏ فإذا آتاك الله مالا فلير عليك أثر نعمة الله وكرامته ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Al-Ahwas, from his father, :                     That he came to the Prophet [SAW] wearing shabby clothes. The Prophet [SAW] said to him: \"Do you have any wealth?\" He said: \"Yes, all kinds of wealth.\" He said: \"What kinds of wealth?\" He said: \"Allah has given me camels, cattle, sheep, horses and slaves.\" He said: \"If Allah has given you wealth, then let the effect of Allah's blessing and generosity be seen on you.\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20348",
        "20321",
        "11049",
        "20327"
      ]
    },
    {
      "id": "sunan-an-nasai-5313",
      "hadith_no": "5313",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا عبد الحميد بن محمد، قال حدثنا مخلد، قال حدثنا مسعر، عن وبرة، عن الشعبي، عن سويد بن غفلة، ح وأخبرنا أحمد بن سليمان، قال حدثنا عبيد الله، قال حدثنا إسرائيل، عن أبي حصين، عن إبراهيم، عن سويد بن غفلة، عن عمر، أنه لم يرخص في الديباج إلا موضع أربع أصابع ‏.‏",
      "text_en": " It was narrated from 'Umar that:                     He did not allow the wearing of silk except (something) the width of four fingers.",
      "usc_msa_ref": "",
      "chain": [
        "20462",
        "20359",
        "11052",
        "11174",
        "38022",
        "11201",
        "20311",
        "11371",
        "11051",
        "11174",
        "3"
      ]
    },
    {
      "id": "sunan-an-nasai-5394",
      "hadith_no": "5394",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Etiquette of Judges - كتاب آداب القضاة",
      "chapter_no": "49",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا يزيد، قال حدثنا هشام، عن محمد، عن يحيى بن أبي إسحاق، عن سليمان بن يسار، عن الفضل بن العباس، أنه كان رديف النبي صلى الله عليه وسلم فجاءه رجل فقال يا رسول الله إن أمي عجوز كبيرة إن حملتها لم تستمسك وإن ربطتها خشيت أن أقتلها‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أرأيت لو كان على أمك دين أكنت قاضيه ‏\"‏‏.‏ قال نعم‏.‏ قال ‏\"‏ فحج عن أمك ‏\"‏‏.‏",
      "text_en": " It was narrated from Al-Fadl bin 'Abbas, that:                     He was riding behind the Messenger of Allah [SAW], when a man came and said: \"O Messenger of Allah, my mother is an old woman; if I put her on a mount she cannot sit firmly, and if I tie her, I fear that I may kill her.\" He said: \"Do you think that if your mother owed a debt you would pay it off for her?\" He said: \"Yes.\" He said: \"Then perform Hajj on behalf of your mother.\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20472",
        "20295",
        "20278",
        "11314",
        "11005",
        "135"
      ]
    },
    {
      "id": "sunan-an-nasai-5458",
      "hadith_no": "5458",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا محاضر، قال حدثنا عاصم الأحول، عن عبد الله بن الحارث، عن زيد بن أرقم، قال لا أعلمكم إلا ما كان رسول الله صلى الله عليه وسلم يعلمنا يقول ‏\"‏ اللهم إني أعوذ بك من العجز والكسل والبخل والجبن والهرم وعذاب القبر اللهم آت نفسي تقواها وزكها أنت خير من زكاها أنت وليها ومولاها اللهم إني أعوذ بك من قلب لا يخشع ومن نفس لا تشبع وعلم لا ينفع ودعوة لا يستجاب لها ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Zaid bin Arqam said:                     \"I will not teach you anything but that which the Messenger of Allah [SAW] used to teach us. He said: 'Allahumma inni a'udhu bika min al-'ajzi wal-kasali, wal-bukhli, wal-jubni, wal-harami, wa 'adhabil-qabri, Allahumma ati nafsi taqwaha, wa zakkiha anta khairu min zakkaha, anta waliyyuha wa mawlaha. Allahumma inni a'udhu bika min qalbin la yakhsha'u wa min nafsin la tashba'u wa 'ilmin la yanfa'u wa da'watin la yustajabu laha (O Allah, I seek refuge in You from incapacity, laziness, miserliness, cowardice, old age, the torment of the grave. O Allah, make my soul obedient and purify it, for You are the best One to purify it, You are its Guardian and Lord. O Allah, I seek refuge in You from a heart that is not humble, a soul that is not satisfied, knowledge that is of no benefit and a supplication that is not answered.)\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20606",
        "11080",
        "912",
        "384"
      ]
    },
    {
      "id": "sunan-an-nasai-5483",
      "hadith_no": "5483",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا أبو داود، عن سفيان، عن أبي إسحاق، عن عمرو بن ميمون، قال كان النبي صلى الله عليه وسلم يتعوذ مرسل ‏.‏",
      "text_en": " It was narrated that 'Amr bin Maimun said:                     \"The Prophet [SAW] used to seek refuge.\" Mursal.",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "30002",
        "20012",
        "11049",
        "11382"
      ]
    },
    {
      "id": "sunan-an-nasai-5507",
      "hadith_no": "5507",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا جعفر بن عون، قال حدثنا عبد الرحمن بن عبد الله، عن أبي عمر، عن عبيد بن خشخاش، عن أبي ذر، قال دخلت المسجد ورسول الله صلى الله عليه وسلم فيه فجئت فجلست إليه فقال ‏\"‏ يا أبا ذر تعوذ بالله من شر شياطين الجن والإنس ‏\"‏ ‏.‏ قلت أوللإنس شياطين قال ‏\"‏ نعم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Dharr said:                     \"I entered the Masjid and the Messenger of Allah [SAW] was there, so I came and sat before him and he said: 'O Abu Dharr, seek refuge with Allah from the evils of the devils among the Jinn and mankind.' I said: 'Are there devils among mankind?' He said: 'Yes.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20416",
        "20439",
        "23"
      ]
    },
    {
      "id": "sunan-an-nasai-5558",
      "hadith_no": "5558",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا يزيد، قال أنبأنا حميد، عن عكرمة، عن ابن عباس، قال البسر وحده حرام ومع التمر حرام‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"Al-Busr on their own are unlawful and with dried dates they are unlawful.\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20472",
        "11279",
        "11023",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-5580",
      "hadith_no": "5580",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا عبيد الله، عن إسرائيل، عن أبي حصين، عن عامر، عن ابن عمر، قال الخمر من خمسة من التمر والحنطة والشعير والعسل والعنب ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                     \"Khamr is made from five things: From dates, wheat, barley, honey and grapes.\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "11201",
        "20311",
        "11371",
        "11052",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-5643",
      "hadith_no": "5643",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا يزيد بن هارون، قال حدثنا منصور بن حيان، سمع سعيد بن جبير، يحدث أنه سمع ابن عمر، وابن، عباس أنهما شهدا على رسول الله صلى الله عليه وسلم أنه نهى عن الدباء والحنتم والمزفت والنقير ثم تلا رسول الله صلى الله عليه وسلم هذه الآية ‏{‏ وما آتاكم الرسول فخذوه وما نهاكم عنه فانتهوا ‏}‏ ‏.‏",
      "text_en": " Sa'eed bin Jubair narrated that:                     He heard Ibn 'Umar and Ibn 'Abbas testify that the Messenger of Allah [SAW] forbade Ad-Dubba' (gourds), Al-Hantam, Al-Muzaffat, and An-Naqir. Then the Messenger of Allah [SAW] recited this Verse: \"And whatsoever the Messenger (Muhammad) gives you, take it; and whatsoever he forbids you, abstain (from it).\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20472",
        "10969",
        "11050",
        "18"
      ]
    }
  ],
  "total_hadiths": 105
}