{
  "id": "38032",
  "name": "Ahmed bin Abi al-Hawari أحمد بن عبد الله بن ميمون",
  "full_name": "Ahmed bin Abi al-Hawari أحمد بن عبد الله بن ميمون",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "164",
      "date_gregorian": "NA",
      "date_display": [
        "164 AH"
      ],
      "place": ""
    },
    "death": {
      "date_hijri": "246",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Kufa",
      "Damascus"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ د  ق  -  ثقة ]"
    ],
    "tags": [
      "al-Taghlabi",
      "al-Damashqi",
      "Imam",
      "Hafiz",
      "Zahid"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "id": "sunan-abi-daud-2958",
      "hadith_no": "2958",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا أحمد بن أبي الحواري، حدثنا سليم بن مطير، - شيخ من أهل وادي القرى - قال حدثني أبي مطير أنه خرج حاجا حتى إذا كان بالسويداء إذا أنا برجل قد جاء كأنه يطلب دواء وحضضا فقال أخبرني من سمع رسول الله صلى الله عليه وسلم في حجة الوداع وهو يعظ الناس ويأمرهم وينهاهم فقال ‏\"‏ يا أيها الناس خذوا العطاء ما كان عطاء فإذا تجاحفت قريش على الملك وكان عن دين أحدكم فدعوه ‏\"‏ ‏.‏ قال أبو داود ورواه ابن المبارك عن محمد بن يسار عن سليم بن مطير ‏.‏",
      "text_en": " Narrated A man:                     Sulaym ibn Mutayr reported on the authority of his father that Mutayr went away to perform hajj.  When he reached as-Suwaida', a man suddenly came searching for medicine and ammonium anthorhizum extract, and he said: A man who heard the Messenger of Allah (ﷺ) addressing the people commanding and prohibiting them, told me that he said: O people, accept presents so long as they remain presents; but when the Quraysh quarrel about the rule, and the presents are given for the religion of one of you, then leave them alone.Abu Dawud said: This tradition has been transmitted by Ibn al-Mubarak from Muhammad b. Yasar from Sulaim b. Mutair.",
      "usc_msa_ref": "",
      "chain": [
        "38032",
        "28222"
      ]
    },
    {
      "id": "sunan-abi-daud-3552",
      "hadith_no": "3552",
      "source": "Sunan Abi Da'ud",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا أحمد بن أبي الحواري، حدثنا الوليد، عن الأوزاعي، عن الزهري، عن أبي سلمة، وعروة، عن جابر، عن النبي صلى الله عليه وسلم بمعناه ‏.‏ قال أبو داود وهكذا رواه الليث بن سعد عن الزهري عن أبي سلمة عن جابر ‏.‏",
      "text_en": " The tradition mentioned above has also been narrated by Jabir from the Prophet (ﷺ) to the same effect through a different chain of narrators.Abu Dawud said:                      A similar tradition has also been transmitted by al-Laith b. Sa'd from al-Zuhri, from Abu Salamah from Jabir.",
      "usc_msa_ref": "",
      "chain": [
        "38032",
        "20733",
        "20024",
        "11013",
        "10567",
        "10511",
        "34"
      ]
    },
    {
      "id": "sunan-ibn-majah-3441",
      "hadith_no": "3441",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا أحمد بن أبي الحواري، حدثنا مروان بن محمد، حدثنا سليمان بن بلال، عن هشام بن عروة، عن أبيه، عن عائشة، قالت قال رسول الله  صلى الله عليه وسلم  ‏\"‏ نعم الإدام الخل ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Aishah that the Messenger of Allah (ﷺ) said:                     “Whata blessed condiment vinegar is.”",
      "usc_msa_ref": "",
      "chain": [
        "38032",
        "20640",
        "20160",
        "11065",
        "10511",
        "53"
      ]
    }
  ],
  "total_hadiths": 3
}