{
  "id": "38044",
  "name": "Ahmed bin al-Frat bin Khalid أحمد بن الفرات بن خالد",
  "full_name": "Ahmed bin al-Frat bin Khalid أحمد بن الفرات بن خالد",
  "grade": "3rd Century AH [11th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "258",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Asbahan",
      " Ray"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ د  -  ثقة حافظ ]"
    ],
    "tags": [
      "al-Razi",
      "Asbahan"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20331",
      "name": "'Abdullah bin Numayr عبد الله بن نمير",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20121",
      "name": "'Abdur-Razzaq عبد الرزاق بن همام",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "38528",
      "name": "Muhammad bin 'Abdullah bin Abi Ja'far محمد بن عبد الله بن أبي جعفر",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20443",
      "name": "Abu 'Amir al-'Aqdi عبد الملك بن عمرو القيسي أبو عامر العقدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20372",
      "name": "Ya'la bin 'Ubaid bin Umayya al-Tanafasi يعلى بن عبيد بن أبي أمية الطنافسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20547",
      "name": "Sulaiman bin Da'ud bin al-Jarud سليمان بن داود أبو داود الطيالسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1182",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book Of The Prayer For Rain (Kitab al-Istisqa') - كتاب الاستسقاء",
      "chapter_no": "3",
      "text_ar": "حدثنا أحمد بن الفرات بن خالد أبو مسعود الرازي، أخبرنا محمد بن عبد الله بن أبي جعفر الرازي، عن أبيه، عن أبي جعفر الرازي، قال أبو داود وحدثت عن عمر بن شقيق، حدثنا أبو جعفر الرازي، - وهذا لفظه وهو أتم - عن الربيع بن أنس، عن أبي العالية، عن أبى بن كعب، قال انكسفت الشمس على عهد رسول الله صلى الله عليه وسلم وإن النبي صلى الله عليه وسلم صلى بهم فقرأ بسورة من الطول وركع خمس ركعات وسجد سجدتين ثم قام الثانية فقرأ سورة من الطول وركع خمس ركعات وسجد سجدتين ثم جلس كما هو مستقبل القبلة يدعو حتى انجلى كسوفها ‏.‏",
      "text_en": " Narrated Ubayy b. Ka'b:                     An eclipse of the sun took place in the time of the Messenger of Allah (ﷺ).  The Prophet (ﷺ) led them in prayer.  He recited one of the long surahs, bowing five times and prostrating himself twice.  He then stood up for the second rak'ah, recited one of the long surahs, bowed firve times, prostrated himself twice, then sat where he was facing the qiblah and made the supplication till the eclipse was over.",
      "chain": [
        "38044",
        "38528",
        "28281",
        "20746",
        "24332",
        "20746",
        "19844",
        "11618",
        "39"
      ]
    },
    {
      "hadith_no": "1413",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prostration while reciting the Qur'an - كتاب سجود القرآن",
      "chapter_no": "7",
      "text_ar": "حدثنا أحمد بن الفرات أبو مسعود الرازي، أخبرنا عبد الرزاق، أخبرنا عبد الله بن عمر، عن نافع، عن ابن عمر، قال كان رسول الله صلى الله عليه وسلم يقرأ علينا القرآن فإذا مر بالسجدة كبر وسجد وسجدنا ‏.‏ قال عبد الرزاق وكان الثوري يعجبه هذا الحديث ‏.‏ قال أبو داود يعجبه لأنه كبر ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     The Messenger of Allah (ﷺ) used to recite the Qur'an to us. When he came upon the verse containing prostration, he would utter the takbir (Allah is most great) and we would prostrate ourselves along with him.The narrator 'Abd al-Razzaq said: Al-Thawri liked this tradition very much.Abu Dawud said: This was liked by him for this contains the uttering of takbir.",
      "chain": [
        "38044",
        "20121",
        "20507",
        "11014",
        "18"
      ]
    }
  ],
  "total_hadiths": 2
}