{
  "id": "38045",
  "name": "Ahmed bin Fdalh أحمد بن فضالة",
  "full_name": "Ahmed bin Fdalh أحمد بن فضالة",
  "grade": "3rd Century AH [11th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "257",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Nisa'"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ س  -  صدوق ]"
    ],
    "tags": [
      "al-Nisa'i"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "30463",
      "name": "Khalid bin Mukhallad al-Qatwani خالد بن مخلد القطواني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20121",
      "name": "'Abdur-Razzaq عبد الرزاق بن همام",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20241",
      "name": "al-Dahhak bin Mukhlad Abu 'Asim al-Nabil الضحاك بن مخلد أبو عاصم النبيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30006",
      "name": "Imam Nasa'i أحمد بن شعيب بن علي بن سنان النسائي",
      "grade": "3rd Century AH [12th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sunan-an-nasai-2664",
      "hadith_no": "2664",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرني أحمد بن فضالة بن إبراهيم النسائي، قال حدثنا خالد بن مخلد، قال حدثني سليمان بن بلال، قال حدثني يحيى، - وهو ابن سعيد الأنصاري - قال سمعت القاسم بن محمد، يحدث عن أبيه، عن أبي بكر، أنه خرج حاجا مع رسول الله صلى الله عليه وسلم حجة الوداع ومعه امرأته أسماء بنت عميس الخثعمية فلما كانوا بذي الحليفة ولدت أسماء محمد بن أبي بكر فأتى أبو بكر النبي صلى الله عليه وسلم فأخبره فأمره رسول الله صلى الله عليه وسلم أن يأمرها أن تغتسل ثم تهل بالحج وتصنع ما يصنع الناس إلا أنها لا تطوف بالبيت ‏.‏",
      "text_en": " It was narrated from Abu Bakr:                     That he went out for Hajj with the Messenger of Allah on the Farewell Pilgrimage, and his wife Asma' bint 'Umais Al-Khath'amiyyah was with him. When they were at Dhul-Hulaifah, Asma gave birth to Muhammad bin abi Bakr. Abu Bakr. Came to the Prophet and told him, and the Messenger of Allah told him to tell her to perform Ghusl, then begin the Talbniyah for Hajj, and to do everything that the people do, except that she should not circumambulate the House.(sahih)",
      "usc_msa_ref": "",
      "chain": [
        "38045",
        "30463",
        "20160",
        "11062",
        "10535",
        "168",
        "2"
      ]
    },
    {
      "id": "sunan-an-nasai-4122",
      "hadith_no": "4122",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا أحمد بن فضالة، قال حدثنا عبد الرزاق، قال أنبأنا معمر، عن أيوب، عن الحسن، عن الأحنف بن قيس، عن أبي بكرة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إذا تواجه المسلمان بسيفيهما فقتل أحدهما صاحبه فالقاتل والمقتول في النار ‏\"‏ ‏.‏ قالوا يا رسول الله هذا القاتل فما بال المقتول قال ‏\"‏ إنه أراد قتل صاحبه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Bakrah said:                     \"I heard the Messenger of Allah [SAW] say: 'If two Muslims confront each other with their swords and one of them kills the other, both the killer and the slain will be in Hell.'\" They said: \"O Messenger of Allah, (we understand about) the killer, but what about the one who is killed?\" He said: \"He wanted to kill his companion.\"",
      "usc_msa_ref": "",
      "chain": [
        "38045",
        "20121",
        "20115",
        "11015",
        "11016",
        "11112",
        "3229"
      ]
    },
    {
      "id": "sunan-an-nasai-4620",
      "hadith_no": "4620",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا يحيى بن سعيد، ويزيد بن زريع، وخالد بن الحارث، قالوا حدثنا شعبة، وأخبرني أحمد بن فضالة بن إبراهيم، قال حدثنا عبيد الله بن موسى، قال حدثنا الحسن بن صالح، عن ابن أبي عروبة، عن قتادة، عن الحسن، عن سمرة، أن رسول الله صلى الله عليه وسلم نهى عن بيع الحيوان بالحيوان نسيئة ‏.‏",
      "text_en": " It was narrated from Sasmurah that:                     the Messenger of Allah forbade selling animals in exchange for animal's ion credit.",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20031",
        "20304",
        "20226",
        "20020",
        "38045",
        "20340",
        "20647",
        "11073",
        "11019",
        "11016",
        "394"
      ]
    },
    {
      "id": "sunan-an-nasai-5480",
      "hadith_no": "5480",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا أحمد بن فضالة، عن عبيد الله، قال أنبأنا إسرائيل، عن أبي إسحاق، عن عمرو بن ميمون، عن عمر، أن النبي صلى الله عليه وسلم كان يتعوذ من الجبن والبخل وسوء العمر وفتنة الصدر وعذاب القبر ‏.‏",
      "text_en": " It was narrated from 'Umar that:                     The Prophet [SAW] used to seek refuge with Allah from cowardice, miserliness, reaching the age of second childhood, the trials of the heart and the torment of the grave.",
      "usc_msa_ref": "",
      "chain": [
        "38045",
        "11201",
        "20311",
        "11049",
        "11382",
        "3"
      ]
    }
  ],
  "total_hadiths": 4
}