{
  "id": "38088",
  "name": "Ibrahim bin Y'aqub bin Ishaq إبراهيم بن يعقوب بن إسحاق",
  "full_name": "Ibrahim bin Y'aqub bin Ishaq إبراهيم بن يعقوب بن إسحاق",
  "grade": "3rd Century AH [11th generation]",
  "reliability_grade": "Thiqah Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "259",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Damascus"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ د  ت  س  -  ثقة حافظ ]"
    ],
    "tags": [
      "Damascus"
    ],
    "area_of_interest_display": [
      {
        "en": "Narrator[Grade:Thiqah Thiqah] [ د  ت  س  -  ثقة حافظ ]",
        "ar": "Narrator[Grade:Thiqah Thiqah] [ د  ت  س  -  ثقة حافظ ]",
        "ckb": "Narrator[Grade:Thiqah Thiqah] [ د  ت  س  -  ثقة حافظ ]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "Damascus",
        "ar": "دمشق",
        "ckb": "دیمەشق"
      }
    ],
    "tags_display": [
      {
        "en": "Damascus",
        "ar": "Damascus",
        "ckb": "Damascus"
      }
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20244",
      "name": "'Abdullah bin Bakr عبد الله بن بكر بن حبيب السهمي",
      "grade": "Succ. (Taba' Tabi') [9th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [9th Generation]",
        "ar": "تابع التابعين [الجيل التاسع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی نۆیەم]"
      }
    },
    {
      "id": "20472",
      "name": "Yazid bin Harun يزيد بن هارون",
      "grade": "Succ. (Taba' Tabi') [9th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [9th Generation]",
        "ar": "تابع التابعين [الجيل التاسع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی نۆیەم]"
      }
    },
    {
      "id": "20250",
      "name": "'Abdul Samad bin 'Abdul Warith bin Sa'id عبد الصمد بن عبد الوارث بن سعيد",
      "grade": "Succ. (Taba' Tabi') [9th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [9th Generation]",
        "ar": "تابع التابعين [الجيل التاسع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی نۆیەم]"
      }
    },
    {
      "id": "20241",
      "name": "al-Dahhak bin Mukhlad Abu 'Asim al-Nabil الضحاك بن مخلد أبو عاصم النبيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [9th Generation]",
        "ar": "تابع التابعين [الجيل التاسع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی نۆیەم]"
      }
    },
    {
      "id": "36036",
      "name": "'Abdullah bin Salah عبد الله بن صالح بن محمد أبو صالح المصري",
      "grade": "3rd Century AH [10th generation]",
      "grade_display": {
        "en": "3rd Century AH [10th Generation]",
        "ar": "القرن الثالث الهجري [الجيل العاشر]",
        "ckb": "سەدەی سێیەمی كۆچی [نەوەی دەیەم]"
      }
    },
    {
      "id": "20650",
      "name": "Zayd bin al-Habab al-'Akli زيد بن الحباب أبو الحسين العكلي",
      "grade": "Succ. (Taba' Tabi') [9th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [9th Generation]",
        "ar": "تابع التابعين [الجيل التاسع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی نۆیەم]"
      }
    },
    {
      "id": "20381",
      "name": "Hajjaj bin Muhammad al-Musaysi حجاج بن محمد المصيصي الأعور",
      "grade": "Succ. (Taba' Tabi') [9th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [9th Generation]",
        "ar": "تابع التابعين [الجيل التاسع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی نۆیەم]"
      }
    },
    {
      "id": "30106",
      "name": "'Affan bin Muslim عفان بن مسلم بن عبد الله الصفار",
      "grade": "3rd Century AH [10th generation]",
      "grade_display": {
        "en": "3rd Century AH [10th Generation]",
        "ar": "القرن الثالث الهجري [الجيل العاشر]",
        "ckb": "سەدەی سێیەمی كۆچی [نەوەی دەیەم]"
      }
    }
  ],
  "students": [
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]",
      "grade_display": {
        "en": "3rd Century AH [11th Generation]",
        "ar": "القرن الثالث الهجري [الجيل الحادي عشر]",
        "ckb": "سەدەی سێیەمی كۆچی [نەوەی یازدەیەم]"
      }
    },
    {
      "id": "30005",
      "name": "Imam Tirmidhi الترمذي محمد بن عيسى بن سورة",
      "grade": "3rd Century AH [12th generation]",
      "grade_display": {
        "en": "3rd Century AH [12th Generation]",
        "ar": "القرن الثالث الهجري [الجيل الثاني عشر]",
        "ckb": "سەدەی سێیەمی كۆچی [نەوەی دوازدەیەم]"
      }
    },
    {
      "id": "30006",
      "name": "Imam Nasa'i أحمد بن شعيب بن علي بن سنان النسائي",
      "grade": "3rd Century AH [12th generation]",
      "grade_display": {
        "en": "3rd Century AH [12th Generation]",
        "ar": "القرن الثالث الهجري [الجيل الثاني عشر]",
        "ckb": "سەدەی سێیەمی كۆچی [نەوەی دوازدەیەم]"
      }
    },
    {
      "id": "37518",
      "name": "'Abdur Rahman bin 'Amr عبد الرحمن بن عمرو",
      "grade": "3rd Century AH [11th generation]",
      "grade_display": {
        "en": "3rd Century AH [11th Generation]",
        "ar": "القرن الثالث الهجري [الجيل الحادي عشر]",
        "ckb": "سەدەی سێیەمی كۆچی [نەوەی یازدەیەم]"
      }
    },
    {
      "id": "30554",
      "name": "Abu Zara' al-Razi أبو زرعة الرازي",
      "grade": "3rd Century AH [11th generation]",
      "grade_display": {
        "en": "3rd Century AH [11th Generation]",
        "ar": "القرن الثالث الهجري [الجيل الحادي عشر]",
        "ckb": "سەدەی سێیەمی كۆچی [نەوەی یازدەیەم]"
      }
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]",
      "grade_display": {
        "en": "3rd Century AH [11th Generation]",
        "ar": "القرن الثالث الهجري [الجيل الحادي عشر]",
        "ckb": "سەدەی سێیەمی كۆچی [نەوەی یازدەیەم]"
      }
    }
  ],
  "hadiths": [
    {
      "id": "sunan-abi-daud-2875",
      "hadith_no": "2875",
      "source": "Sunan Abi Da'ud",
      "chapter": "Wills (Kitab Al-Wasaya) - كتاب الوصايا",
      "chapter_no": "18",
      "text_ar": "حدثنا إبراهيم بن يعقوب الجوزجاني، حدثنا معاذ بن هانئ، حدثنا حرب بن شداد، حدثنا يحيى بن أبي كثير، عن عبد الحميد بن سنان، عن عبيد بن عمير، عن أبيه، أنه حدثه - وكانت، له صحبة - أن رجلا، سأله فقال يا رسول الله ما الكبائر فقال ‏\"‏ هن تسع ‏\"‏ ‏.‏ فذكر معناه زاد ‏\"‏ وعقوق الوالدين المسلمين واستحلال البيت الحرام قبلتكم أحياء وأمواتا ‏\"‏ ‏.‏",
      "text_en": " 'Umair, A Companion of the Prophet (ﷺ) said:                      A man asked him (the Prophet): Messenger of Allah, what are the grave sins? He replied: They are nine. He then mentioned the tradition to the same effect. This version adds: \"And disobedience to the Muslim parents, and to violate the sacred House, your qiblah (direction of prayer), in your life and after death.",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "30178",
        "20220",
        "11449",
        "13063",
        "11259",
        "5213"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-3284",
      "hadith_no": "3284",
      "source": "Sunan Abi Da'ud",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا إبراهيم بن يعقوب الجوزجاني، حدثنا يزيد بن هارون، قال أخبرني المسعودي، عن عون بن عبد الله، عن عبد الله بن عتبة، عن أبي هريرة، ‏:‏ أن رجلا، أتى النبي صلى الله عليه وسلم بجارية سوداء فقال ‏:‏ يا رسول الله إن على رقبة مؤمنة ‏.‏ فقال لها ‏:‏ ‏\"‏ أين الله ‏\"‏ ‏.‏ فأشارت إلى السماء بأصبعها ‏.‏ فقال لها ‏:‏ ‏\"‏ فمن أنا ‏\"‏ ‏.‏ فأشارت إلى النبي صلى الله عليه وسلم وإلى السماء، يعني أنت رسول الله ‏.‏ فقال ‏:‏ ‏\"‏ أعتقها فإنها مؤمنة ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     A man brought the Prophet (ﷺ) a black slave girl. He said: Messenger of Allah, emancipation of believing slave is due to me. He asked her: Where is Allah ? She pointed to the heaven with her finger. He then asked her: Who am I ? She pointed to the Prophet (ﷺ) and to the heaven, that is to say: You are the Messenger of Allah. He then said: Set her free, she is a believer.",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "20472",
        "20724",
        "10806",
        "4145"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "jami-al-tirmidhi-211",
      "hadith_no": "211",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن سهل بن عسكر البغدادي، وإبراهيم بن يعقوب، قالا حدثنا علي بن عياش الحمصي، حدثنا شعيب بن أبي حمزة، حدثنا محمد بن المنكدر، عن جابر بن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من قال حين يسمع النداء اللهم رب هذه الدعوة التامة والصلاة القائمة آت محمدا الوسيلة والفضيلة وابعثه مقاما محمودا الذي وعدته إلا حلت له الشفاعة يوم القيامة ‏\"‏ ‏.‏ قال أبو عيسى حديث جابر حديث صحيح حسن غريب من حديث محمد بن المنكدر لا نعلم أحدا رواه غير شعيب بن أبي حمزة عن محمد بن المنكدر ‏.‏ وأبو حمزة اسمه دينار ‏.‏",
      "text_en": " Jabir bin Abdullah narrated that :                     Allah's Messenger said: \"Whoever says, when he hears the call: (Allahumma, rabba hadhihidda 'watit-tammati was Salatilqa'imah, ati Muhammadanil wasilata wal-Fadilata, wab'athhu Maqamun Mahmudan alladhi wa'adtahu) 'O Allah! Lord of this perfect call and established prayer, grant Muhammad Al-Wasilah and Al-Fadilah, and raise him to the praised station that you promised him' - then intercession on the Day of Resurrection is made lawful for him.\"",
      "usc_msa_ref": "",
      "chain": [
        "30516",
        "38088",
        "20448",
        "20428",
        "11048",
        "34"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-1480-2",
      "hadith_no": "1480",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Hunting - كتاب الصيد والذبائح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "18",
      "text_ar": "حدثنا إبراهيم بن يعقوب الجوزجاني، حدثنا أبو النضر، عن عبد الرحمن بن عبد الله بن دينار، نحوه ‏.‏ قال أبو عيسى وهذا حديث حسن غريب لا نعرفه إلا من حديث زيد بن أسلم ‏.‏ والعمل على هذا عند أهل العلم ‏.‏ وأبو واقد الليثي اسمه الحارث بن عوف ‏.‏",
      "text_en": " Another chain with similar meaning.",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "20390",
        "20439"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-1817",
      "hadith_no": "1817",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا أحمد بن سعيد الأشقر، وإبراهيم بن يعقوب، قالا حدثنا يونس بن محمد، حدثنا المفضل بن فضالة، عن حبيب بن الشهيد، عن محمد بن المنكدر، عن جابر بن عبد الله، أن رسول الله صلى الله عليه وسلم أخذ بيد مجذوم فأدخله معه في القصعة ثم قال ‏\"‏ كل بسم الله ثقة بالله وتوكلا عليه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من حديث يونس بن محمد عن المفضل بن فضالة ‏.‏ والمفضل بن فضالة هذا شيخ بصري والمفضل بن فضالة شيخ آخر مصري أوثق من هذا وأشهر ‏.‏ وقد روى شعبة هذا الحديث عن حبيب بن الشهيد عن ابن بريدة أن ابن عمر أخذ بيد مجذوم وحديث شعبة أثبت عندي وأصح ‏.‏",
      "text_en": " Narrated Jabir bin ‘Abdullah :                     \"The Messenger of Allah (ﷺ) took the hand of a leper and put it in the Qas'ah. Then he said: 'Eat in Allah's Name, trusting in Allah and relying upon Him.'\"[Abu 'Eisa said:] This is a Gharib Hadith, we do not know of it except through the report of Yunus bin Muhammad, from Al-Mufaddal bin Fadalah, a Shaikh from Al-Basrah. There is another Shaikh from Al-Basrah named Al-Mufaddal bin Fadalah, who is more reliable han this one and more popular. Shu'bah reported this Hadith from Habib bin Ash-Shahid, from Ibn Buraidah: \"That Ibn 'Umar took the hand of a leper\" and the narration of Shu'bah is more appropriate to me and more correct.",
      "usc_msa_ref": "",
      "chain": [
        "30296",
        "38088",
        "20393",
        "20378",
        "11275",
        "11048",
        "34"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-2267-2",
      "hadith_no": "2267",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا إبراهيم بن يعقوب الجوزجاني، حدثنا نعيم بن حماد، حدثنا سفيان بن عيينة، عن أبي الزناد، عن الأعرج، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إنكم في زمان من ترك منكم عشر ما أمر به هلك ثم يأتي زمان من عمل منهم بعشر ما أمر به نجا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من حديث نعيم بن حماد عن سفيان بن عيينة ‏.‏ قال وفي الباب عن أبي ذر وأبي سعيد ‏.‏",
      "text_en": " Abu Hurairah narrated that the Prophet(s.a.w) said:                     \"You are in a time when whoever abandons a tenth of what he has been ordered, then he is ruined. Then, there will come a time in which whoever does a tenth of what he has been ordered shall be saved.\"",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "30238",
        "20005",
        "11061",
        "11197",
        "13"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-2703-2",
      "hadith_no": "2703",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Seeking Permission - كتاب الاستئذان والآداب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "42",
      "text_ar": "حدثنا محمد بن المثنى، وإبراهيم بن يعقوب، قالا حدثنا روح بن عبادة، عن حبيب بن الشهيد، عن الحسن، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ يسلم الراكب على الماشي والماشي على القاعد والقليل على الكثير ‏\"‏ ‏.‏ وزاد ابن المثنى في حديثه ‏\"‏ ويسلم الصغير على الكبير ‏\"‏ ‏.‏ وفي الباب عن عبد الرحمن بن شبل وفضالة بن عبيد وجابر ‏.‏ قال أبو عيسى هذا حديث قد روي من غير وجه عن أبي هريرة ‏.‏ وقال أيوب السختياني ويونس بن عبيد وعلي بن زيد إن الحسن لم يسمع من أبي هريرة ‏.‏",
      "text_en": " Narrated Al-Hasan:                     from Abu Hurairah that the Prophet (ﷺ) said: \"The rider gives the Salam to the walking person, and the walking person to the sitting person and the few to the many.\"Ibn Al-Muthanna added in his narration: \"And the young one gives the Salam to the elder.\"",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "38088",
        "20229",
        "11275",
        "11016",
        "13"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-3507-2",
      "hadith_no": "3507",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا إبراهيم بن يعقوب الجوزجاني، حدثني صفوان بن صالح، حدثنا الوليد بن مسلم، حدثنا شعيب بن أبي حمزة، عن أبي الزناد، عن الأعرج، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن لله تعالى تسعة وتسعين اسما مائة غير واحدة من أحصاها دخل الجنة هو الله الذي لا إله إلا هو الرحمن الرحيم الملك القدوس السلام المؤمن المهيمن العزيز الجبار المتكبر الخالق البارئ المصور الغفار القهار الوهاب الرزاق الفتاح العليم القابض الباسط الخافض الرافع المعز المذل السميع البصير الحكم العدل اللطيف الخبير الحليم العظيم الغفور الشكور العلي الكبير الحفيظ المقيت الحسيب الجليل الكريم الرقيب المجيب الواسع الحكيم الودود المجيد الباعث الشهيد الحق الوكيل القوي المتين الولي الحميد المحصي المبدئ المعيد المحيي المميت الحى القيوم الواجد الماجد الواحد الصمد القادر المقتدر المقدم المؤخر الأول الآخر الظاهر الباطن الوالي المتعالي البر التواب المنتقم العفو الرءوف مالك الملك ذو الجلال والإكرام المقسط الجامع الغني المغني المانع الضار النافع النور الهادي البديع الباقي الوارث الرشيد الصبور ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب حدثنا به غير واحد عن صفوان بن صالح ‏.‏ ولا نعرفه إلا من حديث صفوان بن صالح وهو ثقة عند أهل الحديث ‏.‏ وقد روي هذا الحديث من غير وجه عن أبي هريرة عن النبي صلى الله عليه وسلم ولا نعلم - في كبير شيء من الروايات له إسناد صحيح ذكر الأسماء إلا في هذا الحديث ‏.‏ وقد روى آدم بن أبي إياس هذا الحديث بإسناد غير هذا عن أبي هريرة عن النبي صلى الله عليه وسلم وذكر فيه الأسماء وليس له إسناد صحيح ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah said:                     “Indeed, Allah has ninety-nine Names, one hundred less one, whoever counts them shall enter Paradise. He is Allah, the one whom there is none worthy of worship except for Him (Allahu La Ilaha Illa Huwa), the Most Merciful (to the creation) (Ar-Rahman), the Most Beneficent (to the believers) (Ar-Rahim), the Kind (Al-Malik), the Free of Deficiencies (Al-Quddus), the Granter of Safety (As-Salam), the Granter of Security (Al-Mumin), the Watcher (Al-Muhaimin), the Mighty (Al-Aziz), the Compeller (Al-Jabbar), the Supreme (Al-Mutakabbir), the Creator (Al-Khaliq), the Originatory (Al-Bari), the Fashioner (Al-Musawwir), the Pardoner (Al-Ghaffar), the Giving (Al-Wahhab), the Provider (Ar-Razzaq), the Opener (Al-Fattah), the Knowing (Al-Alim), the Taker (Al-Qabid), the Giver (Al-Basit), the Abaser (Al-Khafid), the Exalter (Ar-Rafi), the One who grants honor (Al-Muizz, the One who humiliates (Al-Mudhil), the Hearing (As-Sami), the Seeing (Al-Basir), the Judge (Al-Hakam), the Just (Al-Adl), the Kind (Al-Latif), the Aware (Al-Khabir), the Forbearing (Al-Halim), the Magnificent (Al-Azim), the Oft-Forgiving (Al-Ghafur), the Grateful (Ash-Shakur), the Most High (Al-Ali), the Great (Al-Kabir), the Guardian (Al-Hafiz), the Powerful (Al-Muqit), the Reckoner (Al-Hasib), the Glorious (Al-Jalil), the Generous (Al-Karim), the Watcher (Ar-Raqib), the Responder (Al-Mujib), the Liberal Giver (Al-Wasi), the Wise (Al-Hakim), the Loving (Al-Wadud), the Majestic (Al-Majid), the Reviver (Al-Ba’ith), the Witness (Ash-Shahid), the Truth (Al-Haqq), the Guarantor (Al-Wakil), the Strong (Al-Qawi), the Firm (Al-Matin), the One Who Aids (Al-Wali), the Praiseworthy (Al-Hamid), the Encompasser (Al-Muhsi), the One Who Begins things (Al-Mubdi), the One Who brings things back (Al-Mu’id), the One Who gives life (Muhyi), the One Who causes death (Al-Mumit), the Living (Al-Hayyu), the Self-Sufficient (Al-Qayyum), the One Who brings into existence (Al-Wajid), the Illustrious (Al-Majid), the One (Al-Wahid), the Master (As-Samad), the Able (Al-Qadir), the Powerful (Al-Muqtadir), the One who hastens (Al-Muqaddim), the One who delays (Al-Mu’khkhir), the First (Al-Awal), the Last (Al-Akhir), the Apparent (Az-Zahir), the Inner (Al-Batin), the Owner (Al-Wali), the Exalted (Al-Muta’ali), the Doer of Good (Al-Barr), the Acceptor of repentance (At-Tawwab), the Avenger (Al-Muntaqim), the Pardoning (Al-Afuww), the Kind (Ar-Ra’uf), the Owner of Dominion (Malikul-Mulk), the Possessor of Glory and Generosity (Dhul Jalali Wal Ikram), the One who does justice (Al-Muqsit), the Gatherer (Al-Jami), the Rich (Al-Ghani), the Enricher (Al-Mughi), the Preventer (Al-Mani), the Harmer (Ad-Dar), the One who benefits (An-Nafi), the Light (An-Nur), the Guide (Al-Hadi), the Originator (Al-Badi), the Lasting (Al-Baqi), the Inheritor (Al-Warith), the Guide (Ar-Rashid), the Tolerant (As-Sabur).”",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "37511",
        "20733",
        "20428",
        "11061",
        "11197",
        "13"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-3509-2",
      "hadith_no": "3509",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا إبراهيم بن يعقوب، حدثنا زيد بن حباب، أن حميدا المكي، مولى ابن علقمة حدثه أن عطاء بن أبي رباح حدثه عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا مررتم برياض الجنة فارتعوا ‏\"‏ ‏.‏ قلت يا رسول الله وما رياض الجنة قال ‏\"‏ المساجد ‏\"‏ ‏.‏ قلت وما الرتع يا رسول الله قال ‏\"‏ سبحان الله والحمد لله ولا إله إلا الله والله أكبر ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah said:                     “When you pass by the gardens of Paradise, then feast.” I said: “O Messenger of Allah, and what are the gardens of Paradise?” He said, “The Masajid.” I said: “And what is feasting, O Messenger of Allah?” He said: “Glory is to Allah, (Subhan Allah)’ and ‘All praise is due to Allah, (Al-Hamdulillah)’ and ‘None has the right to be worshipped but Allah, (La Ilaha Illallah)’ and ‘Allah is the Greatest (Allahu Akbar).’”",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "20650",
        "11029",
        "13"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-3511-2",
      "hadith_no": "3511",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا إبراهيم بن يعقوب، حدثنا عمرو بن عاصم، حدثنا حماد بن سلمة، عن ثابت، عن عمرو بن أبي سلمة، عن أمه أم سلمة، عن أبي سلمة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا أصاب أحدكم مصيبة فليقل ‏:‏ ‏(‏ إنا لله وإنا إليه راجعون ‏)‏ اللهم عندك احتسبت مصيبتي فأجرني فيها وأبدلني منها خيرا ‏\"‏ ‏.‏ فلما احتضر أبو سلمة قال اللهم اخلف في أهلي خيرا مني فلما قبض قالت أم سلمة ‏:‏ ‏(‏ إنا لله وإنا إليه راجعون ‏)‏ عند الله احتسبت مصيبتي فأجرني فيها ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه ‏.‏ وروي هذا الحديث من غير هذا الوجه عن أم سلمة عن النبي صلى الله عليه وسلم وأبو سلمة اسمه عبد الله بن عبد الأسد ‏.‏",
      "text_en": " Umar bin Abu Salamah narrated from his mother, Umm Salamah, that the Messenger of Allah said:                     “When a calamity strikes one of you, then let him say: ‘Indeed, to Allah we belong and to Him we shall return. O Allah, I seek reward with You for my affliction, so reward me for it, and replace it for me with something better (Inna Lillahi Wa Inna Ilaihi Raji’un, Allahumma Indaka Ahtasibu Musibati Fa’jurni Fiha Wa Abdilni Minha Khair).’” When the time of death was near Abu Salamah, he said: ‘O Allah, replace me for my wife, with better than me.” So when he died, Umm Salamah said: “Indeed, to Allah we belong and to Him we shall return. I seek reward with  allah for my affliction, so reward me for it.”",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "20267",
        "20021",
        "11269",
        "30286",
        "56",
        "10567"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-3537-2",
      "hadith_no": "3537",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا إبراهيم بن يعقوب، حدثنا علي بن عياش، حدثنا عبد الرحمن بن ثابت بن ثوبان، عن أبيه، عن مكحول، عن جبير بن نفير، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن الله يقبل توبة العبد ما لم يغرغر ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ حدثنا محمد بن بشار، حدثنا أبو عامر العقدي، عن عبد الرحمن بن ثابت بن ثوبان، عن أبيه، عن مكحول، عن جبير بن نفير، عن ابن عمر، عن النبي صلى الله عليه وسلم نحوه بمعناه ‏.‏",
      "text_en": " Ibn Umar narrated that the Prophet said:                     “Indeed Allah accepts the repentance of a slave as long as (his soul does not reach his throat).”",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "20448",
        "20731",
        "11066",
        "4097",
        "18"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-4202",
      "hadith_no": "4202",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا إبراهيم بن يعقوب، حدثنا زيد بن حباب، حدثنا ميمون أبو عبد الله، حدثنا ثابت، قال قال لي أنس بن مالك يا ثابت خذ عني فإنك لم تأخذ عن أحد أوثق مني إني أخذته عن رسول الله صلى الله عليه وسلم وأخذه رسول الله صلى الله عليه وسلم عن جبريل وأخذه جبريل عن الله تعالى ‏.‏ قال هذا حديث حسن غريب لا نعرفه إلا من حديث زيد بن حباب ‏.‏",
      "text_en": " Narrated Thabit Al-Bunani:                     \"Anas bin Malik said to me: 'O Thabit, take from me, for indeed you shall not take from one more trustworthy than me. Verily, I took it from the Messenger of Allah (ﷺ), and the Messenger of Allah (ﷺ) took it from Jibra'il, and Jibra'il took it from Allah the Mighty and Sublime.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "20650",
        "11269",
        "19"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-4259",
      "hadith_no": "4259",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا إبراهيم بن يعقوب، ومحمد بن بشار، واللفظ، لابن يعقوب قالا حدثنا يحيى بن حماد، حدثنا عبد العزيز بن المختار، حدثنا خالد الحذاء، عن أبي عثمان النهدي، عن عمرو بن العاص، أن رسول الله صلى الله عليه وسلم استعمله على جيش ذات السلاسل ‏.‏ قال فأتيته فقلت يا رسول الله أى الناس أحب إليك قال ‏\"‏ عائشة ‏\"‏ ‏.‏ قلت من الرجال قال ‏\"‏ أبوها ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated 'Amr bin Al-'As:                     that the Messenger of Allah (ﷺ) appointed him as a leader of the army of Dhatis-Salasil. He said: \"So I went to him and said: 'O Messenger of Allah! Who is the most beloved to you among the people?' He said: ''Aishah.' I said: 'From the men?' He said: 'Her father.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "30160",
        "20574",
        "20252",
        "11282",
        "11113",
        "28"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-4328",
      "hadith_no": "4328",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا إبراهيم بن يعقوب، وغير، واحد، قالوا حدثنا وهب بن جرير، حدثنا أبي قال، سمعت عبد الله بن ملاذ، يحدث عن نمير بن أوس، عن مالك بن مسروح، عن عامر بن أبي عامر الأشعري، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ نعم الحى الأسد والأشعرون لا يفرون في القتال ولا يغلون هم مني وأنا منهم ‏\"‏ ‏.‏ قال فحدثت بذلك معاوية فقال ليس هكذا قال رسول الله قال ‏\"‏ هم مني وإلى ‏\"‏ ‏.‏ فقلت ليس هكذا حدثني أبي ولكنه حدثني قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ هم مني وأنا منهم ‏\"‏ ‏.‏ قال فأنت أعلم بحديث أبيك ‏.‏ قال هذا حديث حسن غريب لا نعرفه إلا من حديث وهب بن جرير ‏.‏ ويقال الأسد هم الأزد ‏.‏",
      "text_en": " Narrated 'Amir bin Abi 'Amir Al-Ash'ari:                     from his father who said: \"The Messenger of Allah (ﷺ) said: 'Blessed are the tribes of Al-Asad and Al-Ash'arun, they flee not from fighting nor do they pilfer the spoils of war. They are from me and I am from them.'\" He ('Amir) said: \"So I narrated that to Mu'awiyah, and he said: \"This is not how the Messenger of Allah (ﷺ) said it, he said: 'They are from me, and for me.' I said, this is not how my father narrated it to me, rather he narrated to me, saying: 'I heard the Messenger of Allah (ﷺ) saying: \"They are from me and I am from them.'\" So he said: 'Then you are more knowledgeable of your father's Hadith.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "20298",
        "11272",
        "28309",
        "19093",
        "17059",
        "18480",
        "408"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "sunan-an-nasai-175",
      "hadith_no": "175",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا إبراهيم بن يعقوب، قال حدثنا عبد الصمد بن عبد الوارث، قال حدثنا أبي، عن حسين المعلم، قال حدثني يحيى بن أبي كثير، عن عبد الرحمن بن عمرو الأوزاعي، أنه سمع المطلب بن عبد الله بن حنطب، يقول قال ابن عباس أتوضأ من طعام أجده في كتاب الله حلالا لأن النار مسته فجمع أبو هريرة حصى فقال أشهد عدد هذا الحصى أن رسول الله صلى الله عليه وسلم قال ‏\"‏ توضئوا مما مست النار ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Abbas said:                      \"Should I perform Wudu' after eating food that I see in the Book of Allah is permissible because fire has touched it?\" Abu Hurairah gathered some pebbles and said: \"I bear witness (as many times as) the number of these pebbles, that the Messenger of Allah (ﷺ) said: 'Perform Wudu' from that which has been touched by fire.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "20250",
        "20258",
        "11278",
        "11449",
        "20024",
        "19944"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-193",
      "hadith_no": "193",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا إبراهيم بن يعقوب بن إسحاق الجوزجاني، قال حدثني عبد الله بن يوسف، قال حدثنا عيسى بن يونس، قال حدثنا أشعث بن عبد الملك، عن ابن سيرين، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا قعد بين شعبها الأربع ثم اجتهد فقد وجب الغسل ‏\"‏ ‏.‏ قال أبو عبد الرحمن هذا خطأ والصواب أشعث عن الحسن عن أبي هريرة ‏.‏ وقد روى الحديث عن شعبة النضر بن شميل وغيره كما رواه خالد ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:                      \"When (a man) sits between the four parts of his wife's body and exerts himself, then Ghusl becomes obligatory.\"Abu 'Abdur-Rahman said: \"This is a mistake what is correct is; 'Ash'ath from Al-Hasan, from Abu Hurairah.' An-Nadr bin Shumail, and others, reported the Hadith from Shu'bah just as Khalid reported it.\"",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "30355",
        "20347",
        "19838",
        "11035",
        "13"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-406",
      "hadith_no": "406",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Ghusl and Tayammum - كتاب الغسل والتيمم",
      "chapter_no": "4",
      "text_ar": "أخبرني إبراهيم بن يعقوب، قال حدثنا النفيلي، قال حدثنا زهير، قال حدثنا عبد الملك، عن عطاء، عن يعلى، أن رسول الله صلى الله عليه وسلم رأى رجلا يغتسل بالبراز فصعد المنبر فحمد الله وأثنى عليه وقال ‏‏\"‏‏ إن الله عز وجل حليم حيي ستير يحب الحياء والستر فإذا اغتسل أحدكم فليستتر ‏‏\"‏‏ ‏‏.‏‏",
      "text_en": " It was narrated from Ya'la that the Messenger of Allah (ﷺ) saw a man performing Ghusl in an open place, so he ascended the Minbar and praised and glorified Allah, then he said:                      'Allah, the Mighty and Sublime, is forbearing, modest and concealing, and He loves modesty and concealment. When any one of you performs Ghusl, let him conceal himself.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "30352",
        "20321",
        "11368",
        "11029",
        "20372"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-505",
      "hadith_no": "505",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا إبراهيم بن يعقوب، قال حدثنا عمر بن حفص، قال حدثنا أبي ح، وأنبأنا إبراهيم بن يعقوب، قال حدثنا يحيى بن معين، قال حدثنا حفص، ح وأنبأنا عمرو بن منصور، قال حدثنا عمر بن حفص بن غياث، قال حدثنا أبي، عن الحسن بن عبيد الله، عن إبراهيم، عن يزيد بن أوس، عن ثابت بن قيس، عن أبي موسى، يرفعه قال ‏\"‏ أبردوا بالظهر فإن الذي تجدون من الحر من فيح جهنم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Musa in a Marfu' [1] report:                      \"Wait until it cools down to pray Zuhr, for the heat you experience is a breeze from Hell.\"[1] Meaning he attributed it to the Prophet (ﷺ).",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "30204",
        "20317",
        "38088",
        "30020",
        "20317",
        "38433",
        "30204",
        "20317",
        "10755",
        "11051",
        "15634",
        "239"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-554",
      "hadith_no": "554",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرني إبراهيم بن يعقوب، قال حدثنا ابن أبي مريم، قال أخبرنا أبو غسان، قال حدثني زيد بن أسلم، عن عاصم بن عمر بن قتادة، عن محمود بن لبيد، عن رجال، من قومه من الأنصار أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ما أسفرتم بالفجر فإنه أعظم بالأجر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Mahmud bin Labid, from some men among his people who were of the Ansar, that the Messenger of Allah (ﷺ) said:                      \"The more you delay Fajr, the greater the reward.\"",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "30232",
        "20179",
        "11163",
        "11103",
        "1830"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-643",
      "hadith_no": "643",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Adhan (The Call to Prayer) - كتاب الأذان",
      "chapter_no": "7",
      "text_ar": "أخبرني إبراهيم بن يعقوب، قال حدثنا سليمان بن حرب، قال حدثنا حماد بن زيد، عن أيوب، عن أبي قلابة، عن عمرو بن سلمة، فقال لي أبو قلابة هو حى أفلا تلقاه ‏.‏ قال أيوب فلقيته فسألته فقال لما كان وقعة الفتح بادر كل قوم بإسلامهم فذهب أبي بإسلام أهل حوائنا فلما قدم استقبلناه فقال جئتكم والله من عند رسول الله صلى الله عليه وسلم حقا فقال ‏\"‏ صلوا صلاة كذا في حين كذا وصلاة كذا في حين كذا فإذا حضرت الصلاة فليؤذن لكم أحدكم وليؤمكم أكثركم قرآنا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ayyub, from Abu Qilabah, from 'Amr bin Salamah:                      \"Abu Qilabah said to me (Ayyub): He ('Amr) is still alive, do you want to meet him?\" I met him and asked him, and he said: \"When Makkah was conquered, all the people hastened to announce their Islam. My father went to announce the Islam of the poeple of our village, and when he came back we went to see him and he said: 'By Allah, I have indeed come to you from the Messenger of Allah (ﷺ)'. He said: 'Pray such and such a prayer at such and such a time, pray such and such a prayer at such and such a time. When the time for prayer comes let one of you call the Adhan and let the one who knows the most Qur'an lead the prayer.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "20193",
        "20022",
        "11015",
        "11047",
        "5206"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-1325",
      "hadith_no": "1325",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا إبراهيم بن يعقوب، قال حدثنا علي بن الحسن بن شقيق، قال أنبأنا الحسين بن واقد، قال حدثنا أبو إسحاق، عن علقمة، والأسود، وأبي الأحوص، قالوا حدثنا عبد الله بن مسعود، أن رسول الله صلى الله عليه وسلم كان يسلم عن يمينه ‏\"‏ السلام عليكم ورحمة الله ‏\"‏ ‏.‏ حتى يرى بياض خده الأيمن وعن يساره ‏\"‏ السلام عليكم ورحمة الله ‏\"‏ ‏.‏ حتى يرى بياض خده الأيسر ‏.‏",
      "text_en": " 'Abdullah bin Mas'ud narrated that:                     The Messenger of Allah (ﷺ) used to say salam to his right:As-salamu 'alaykum wa rahmatullah (peace be upon you and the mercy of Allah) , until the whiteness of his right cheek could be seen, and to his left: As-salamu 'alaykum wa rahmatullah (peace be upon you and the mercy of Allah) until the whiteness of his left cheek could be seen.",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "30362",
        "20648",
        "11049",
        "11017",
        "11054",
        "20327",
        "16"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-1498",
      "hadith_no": "1498",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "أخبرني إبراهيم بن يعقوب، قال حدثنا موسى بن داود، قال حدثنا نافع بن عمر، عن ابن أبي مليكة، عن أسماء بنت أبي بكر، قالت صلى رسول الله صلى الله عليه وسلم في الكسوف فقام فأطال القيام ثم ركع فأطال الركوع ثم رفع فأطال القيام ثم ركع فأطال الركوع ثم رفع ثم سجد فأطال السجود ثم رفع ثم سجد فأطال السجود ثم قام فأطال القيام ثم ركع فأطال الركوع ثم رفع فأطال القيام ثم ركع فأطال الركوع ثم رفع ثم سجد فأطال السجود ثم رفع ثم سجد فأطال السجود ثم رفع ثم انصرف ‏.‏",
      "text_en": " It was narrated that Asma' bint Abi Bakr said:                     The Messenger of Allah (ﷺ) prayed during an eclipse. He stood for a long time, then he bowed for a long time, then he stood up and (remained standing) for a long time, then he bowed for a long time, then he stood up, then he prostrated for a long time, then he stood up and (remained standing) for a long time, then he bowed for a long time, then he stood up, then he prostrated for a long time, then he sat up, then he prostrated for a long time, then he sat up and then he finished.\"",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "20636",
        "20203",
        "11090",
        "70"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-1552",
      "hadith_no": "1552",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Fear Prayer - كتاب صلاة الخوف",
      "chapter_no": "18",
      "text_ar": "أخبرني إبراهيم بن يعقوب، قال حدثنا عمرو بن عاصم، قال حدثنا حماد بن سلمة، عن قتادة، عن الحسن، عن جابر بن عبد الله، أن رسول الله صلى الله عليه وسلم صلى بطائفة من أصحابه ركعتين ثم سلم ثم صلى بآخرين أيضا ركعتين ثم سلم ‏.‏",
      "text_en": " It was narrated from Jabir bin 'Abdullah that:                     The Prophet (ﷺ) led a group of his companions in praying two rak'ahs, then he said the taslim, then he led some others in praying two rak'ahs, then he said the taslim.",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "20267",
        "20021",
        "11019",
        "11016",
        "34"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-1687",
      "hadith_no": "1687",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا إبراهيم بن يعقوب، قال أخبرني عبد الله بن محمد بن علي، قال حدثنا زهير، عن الحسن بن الحر، عن نافع، أن ابن عمر، كان يوتر على بعيره ويذكر أن النبي صلى الله عليه وسلم كان يفعل ذلك ‏.‏",
      "text_en": " It was narrated from Nafi' that :                     Ibn Umar used to pray witr on his camel and he mentioned that the Prophet (ﷺ) used to do that.",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "20321",
        "15088",
        "11014",
        "18"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-1728",
      "hadith_no": "1728",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا إبراهيم بن يعقوب، قال حدثنا أبو النعمان، قال حدثنا حماد بن سلمة، عن عاصم الأحول، عن أبي مجلز، أن أبا موسى، كان بين مكة والمدينة فصلى العشاء ركعتين ثم قام فصلى ركعة أوتر بها فقرأ فيها بمائة آية من النساء ثم قال ما ألوت أن أضع قدمى حيث وضع رسول الله صلى الله عليه وسلم قدميه وأنا أقرأ بما قرأ به رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated from Abu Mijlaz that:                     Abu Musa was between Makkah and Al-Madinah. He prayed 'Isha with two rak'ahs, then he stood and prayed one rak'ah of witr in which he recited one hundred verses from An-Nisa'. Then he said: \"I tried my best to place my feet where the Messenger of Allah (ﷺ) placed his, and to recite what the Messenger of Allah (ﷺ) recited.\"",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "20283",
        "20021",
        "11080",
        "11313",
        "30170"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-1827",
      "hadith_no": "1827",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا إبراهيم بن يعقوب، قال حدثني أحمد بن إسحاق، قال حدثنا وهيب، قال حدثنا منصور ابن صفية، عن أمه، صفية بنت شيبة عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ لقنوا هلكاكم قول لا إله إلا الله ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"The Messenger of Allah said: 'Prompt your dying ones to say La ilaha illahllah (there is none worthy of worship except Allah).\"'",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "30289",
        "20299",
        "11565",
        "2802",
        "53"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-1854",
      "hadith_no": "1854",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا إبراهيم بن يعقوب، قال حدثنا سعيد بن سليمان، قال أنبأنا هشيم، قال أنبأنا منصور، - هو ابن زاذان - عن الحسن، عن عمران بن حصين، قال الميت يعذب بنياحة أهله عليه ‏.‏ فقال له رجل أرأيت رجلا مات بخراسان وناح أهله عليه ها هنا أكان يعذب بنياحة أهله قال صدق رسول الله صلى الله عليه وسلم وكذبت أنت ‏.‏",
      "text_en": " It was narrated that 'Imran bin Husain said:                     \"The deceased is punished due to his family's wailing for him.\" A man said to him: \"A man died in Khurasan and his family wailed for him here; will he be punished due to his family's wailing?\" He said: \"The Messenger of Allah spoke the truth and you are a liar.\"",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "30252",
        "20468",
        "11444",
        "11016",
        "123"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-1919",
      "hadith_no": "1919",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا يحيى بن سعيد، قال حدثنا زكريا، عن الشعبي، قال قال أبو سعيد ح وأخبرنا إبراهيم بن يعقوب بن إسحاق، قال حدثنا أبو زيد، سعيد بن الربيع قال حدثنا شعبة، عن عبد الله بن أبي السفر، قال سمعت الشعبي، يحدث عن أبي سعيد، أن رسول الله صلى الله عليه وسلم مروا عليه بجنازة فقام ‏.‏ وقال عمرو إن رسول الله صلى الله عليه وسلم مرت به جنازة فقام ‏.‏",
      "text_en": " It was narrated from Abu Sa'eed that a funeral passed by the Messenger of Allah and he stood up. (One of the narrators) 'Amr said:                     \"If a funeral passed by the Messenger of Allah he would stand up.\"",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20031",
        "11338",
        "11052",
        "38",
        "38088",
        "20231",
        "20020",
        "11636",
        "11052",
        "38"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-1935",
      "hadith_no": "1935",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا إبراهيم بن يعقوب، قال حدثني أحمد بن إسحاق، قال حدثنا وهيب، قال حدثنا منصور بن عبد الرحمن، عن أمه، عن عائشة، قالت ذكر عند النبي صلى الله عليه وسلم هالك بسوء فقال ‏\"‏ لا تذكروا هلكاكم إلا بخير ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"Something bad was said in the presence of the Prophet about a person who had died. He said: 'Do not say anything but good about your dead.\"'",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "30289",
        "20299",
        "11565",
        "2802",
        "53"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-2016",
      "hadith_no": "2016",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرني إبراهيم بن يعقوب، قال أنبأنا سليمان بن حرب، قال حدثنا حماد بن زيد، عن أيوب، عن حميد بن هلال، عن سعد بن هشام بن عامر، عن أبيه، قال ‏:‏ اشتد الجراح يوم أحد فشكي ذلك إلى رسول الله صلى الله عليه وسلم فقال ‏:‏ ‏\"‏ احفروا وأوسعوا وأحسنوا، وادفنوا في القبر الاثنين والثلاثة، وقدموا أكثرهم قرآنا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Sa'd bin Hisham bin 'Amir that his father said:                     \"Many people were wounded on the day of Uhud and complaints were made to the Messenger of Allah about that. He said: 'Dig graves and make them good and wide, and bury two or three in a grave, and put in first the one who knew the Qur'an most.\"'",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "20193",
        "20022",
        "11015",
        "11281",
        "11166",
        "1331"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-2017",
      "hadith_no": "2017",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا إبراهيم بن يعقوب، قال حدثنا مسدد، قال حدثنا عبد الوارث، عن أيوب، عن حميد بن هلال، عن أبي الدهماء، عن هشام بن عامر، أن رسول الله صلى الله عليه وسلم قال ‏:‏ ‏\"‏ احفروا وأحسنوا، وادفنوا الاثنين والثلاثة، وقدموا أكثرهم قرآنا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Hisham bin 'Amir that the Messenger of Allah said:                     \"Dig graves and dig them well, and bury two or three (together), and put in first the one who knew the Qur'an most.\"",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "30175",
        "20258",
        "11015",
        "11281",
        "1331"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-2050",
      "hadith_no": "2050",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا محمد بن عبد الله بن المبارك، وإبراهيم بن يعقوب بن إسحاق، قالا حدثنا يونس بن محمد، عن شيبان، عن قتادة، أنبأنا أنس بن مالك، قال قال نبي الله صلى الله عليه وسلم ‏\"‏ إن العبد إذا وضع في قبره وتولى عنه أصحابه إنه ليسمع قرع نعالهم ‏\"‏ ‏.‏ قال ‏\"‏ فيأتيه ملكان فيقعدانه فيقولان له ما كنت تقول في هذا الرجل فأما المؤمن فيقول أشهد أنه عبد الله ورسوله فيقال له انظر إلى مقعدك من النار قد أبدلك الله به مقعدا من الجنة ‏\"‏ ‏.‏ قال النبي صلى الله عليه وسلم ‏\"‏ فيراهما جميعا ‏\"‏ ‏.‏",
      "text_en": " Anas bin Malik said:                     \"The Prophet of Allah said: 'When a person is placed in his grave and his companions depart from him, he hears the sound of their sandals. Then two angles came to him and make him sit up, and they say to him: What did you say about this man? As for the believer, he says: \"I bear witness that he is the slave of Allah and His Messenger. Then it is said to him: Look at your place in Hell, Which Allah has replaced for you with a place in Paradise. The prophet said: 'And he sees them both.\"'",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "20393",
        "20240",
        "11019",
        "19"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-2098",
      "hadith_no": "2098",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرني إبراهيم بن يعقوب الجوزجاني، قال حدثنا ابن أبي مريم، قال أنبأنا نافع بن يزيد، عن عقيل، عن ابن شهاب، قال أخبرني أبو سهيل، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا دخل رمضان فتحت أبواب الجنة وغلقت أبواب النار وصفدت الشياطين ‏\"‏ ‏.‏",
      "text_en": " It Was narrated from Abu Hurairah that the Messenger of Allah said:                     'When Ramadan begins, the gates of Paradise are opened, the gates of Hell are closed, and the devils are fettered.\"",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "30232",
        "20629",
        "11207",
        "11013",
        "13"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-2116",
      "hadith_no": "2116",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرني إبراهيم بن يعقوب، قال حدثنا سعيد بن شبيب أبو عثمان، - وكان شيخا صالحا بطرسوس - قال أنبأنا ابن أبي زائدة، عن حسين بن الحارث الجدلي، عن عبد الرحمن بن زيد بن الخطاب، أنه خطب الناس في اليوم الذي يشك فيه فقال ألا إني جالست أصحاب رسول الله صلى الله عليه وسلم وساءلتهم وأنهم حدثوني أن رسول الله صلى الله عليه وسلم قال ‏\"‏ صوموا لرؤيته وأفطروا لرؤيته وانسكوا لها فإن غم عليكم فأكملوا ثلاثين فإن شهد شاهدان فصوموا وأفطروا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that:                     'Abdur-Rahman bin Zaid bin Al-Khattab addressed the people on the day concerning which there was doubt (as to whether the month had begun) and said: \"I sat with the Companions of the Messenger of Allah and asked them, and they a narrated that the Messenger of Allah said: 'Fast when you see it and stop fasting when you see it, and perform the rites on that basis. If it is obscured, then complete thirty days, and if two witnesses testify then fast and stop fasting.\"",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "20366",
        "15095",
        "459"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-2246",
      "hadith_no": "2246",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا إبراهيم بن يعقوب، قال حدثنا ابن أبي مريم، قال حدثنا سعيد بن عبد الرحمن، قال أخبرني سهيل، عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من صام يوما في سبيل الله باعد الله عز وجل وجهه عن النار سبعين خريفا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah said: 'Whoever fasts one day in the cause of Allah, Allah, the mighty and sublime, will separate his face from the fire by (a distance of)seventy autumns.\"'",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "30232",
        "13"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-2256",
      "hadith_no": "2256",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرني إبراهيم بن يعقوب، قال حدثنا محمد بن كثير، عن الأوزاعي، عن الزهري، عن سعيد بن المسيب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ليس من البر الصيام في السفر ‏\"‏ ‏.‏ قال أبو عبد الرحمن هذا خطأ والصواب الذي قبله لا نعلم أحدا تابع ابن كثير عليه ‏.‏",
      "text_en": " It was narrated that Saeed bin Al-Musayyab said:                     \"The Messenger of Allah said: 'It is not righteousness to fast when traveling.\"' (Sahih)Abu 'Abdur-Rahman (An-Nasai) said: This is a mistake, and what is correct is the one that is before it. We do not know of anyone who followed up Ibn Kathir.",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "28531",
        "20024",
        "11013",
        "11002"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-2739",
      "hadith_no": "2739",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرني إبراهيم بن يعقوب، قال حدثنا عثمان بن عمر، قال حدثنا إسماعيل بن مسلم، عن محمد بن واسع، عن مطرف، قال قال لي عمران بن حصين إن رسول الله صلى الله عليه وسلم قد تمتع وتمتعنا معه قال فيها قائل برأيه ‏.‏",
      "text_en": " It was narrated that Mutarrif said:                     \"Imran bin Husain said to me; 'The Messenger of Allah performed 'Umrah and Hajj together, and we performed 'Umrah and Hajj together with him, and whoever says anything different, that is his own personal opinion.",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "20262",
        "22025",
        "11395",
        "123"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-2766",
      "hadith_no": "2766",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرني إبراهيم بن يعقوب، قال حدثنا أبو النعمان، قال حدثنا ثابت بن يزيد الأحول، قال حدثنا هلال بن خباب، قال سألت سعيد بن جبير عن الرجل، يحج يشترط قال الشرط بين الناس فحدثته حديثه - يعني عكرمة - فحدثني عن ابن عباس أن ضباعة بنت الزبير بن عبد المطلب أتت النبي صلى الله عليه وسلم فقالت يا رسول الله إني أريد الحج فكيف أقول قال ‏\"‏ قولي لبيك اللهم لبيك ومحلي من الأرض حيث تحبسني فإن لك على ربك ما استثنيت ‏\"‏ ‏.‏",
      "text_en": " Hilal bin Khabbab said:                     \"I asked Sa'eed bin Jubair about a man who performs Hajj and stipulates a condition. He said: 'Conditions are something that people do among themselves.' I narrated the Hadith of 'Ikrimah to him, and he narrated to me from Ibn 'Abbas, that Duba'ah bint Az-Zubair bin 'Abdul-Muttalib came to the Prophet, and said: 'O Messenger of Allah, I want to perform Hajj, so what should I say?' He said:  'Say: Labbaik Allahumma! Labbaika wa mahilli min al-ardihayth tahbisuni (Here I am, O Allah, Here I am, and I shall exit Ihram at any place where You decree that I cannot proceed.)\" And whatever condition you stipulate will be accepted by your Lord.\"",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "20283",
        "20215",
        "11312",
        "11050",
        "17"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-2935",
      "hadith_no": "2935",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرني إبراهيم بن يعقوب، قال حدثنا موسى بن داود، عن حماد بن سلمة، عن عطاء بن السائب، عن سعيد بن جبير، عن ابن عباس، أن النبي صلى الله عليه وسلم قال ‏\"‏ الحجر الأسود من الجنة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn Abbas that the Prophet said:                     \"The Balck Stone is from Paradise.\"",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "20636",
        "20021",
        "11068",
        "11050",
        "17"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3126",
      "hadith_no": "3126",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرني إبراهيم بن يعقوب، قال حدثنا حجاج، قال حدثنا حماد بن سلمة، عن يونس، عن الحسن، عن ابن عمر، عن النبي صلى الله عليه وسلم فيما يحكيه عن ربه عز وجل قال ‏\"‏ أيما عبد من عبادي خرج مجاهدا في سبيل الله ابتغاء مرضاتي ضمنت له أن أرجعه إن أرجعته بما أصاب من أجر أو غنيمة وإن قبضته غفرت له ورحمته ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar, from the Prophet (ﷺ), of what he related from his Lord, the Mighty and Sublime:                      \"And of My slaves who goes out as a Mujahid striving in the cause of Allah, seeking my pleasure, I guarantee that I will bring him back with whatever he had earned as reward or spoils of war, and if I take his (soul) I will forgive him and have mercy on him.\"",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "20219",
        "20021",
        "20475",
        "11016",
        "18"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3134",
      "hadith_no": "3134",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرني إبراهيم بن يعقوب، قال حدثنا أبو النضر، هاشم بن القاسم قال حدثنا أبو عقيل عبد الله بن عقيل، قال حدثنا موسى بن المسيب، عن سالم بن أبي الجعد، عن سبرة بن أبي فاكه، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن الشيطان قعد لابن آدم بأطرقه فقعد له بطريق الإسلام فقال تسلم وتذر دينك ودين آبائك وآباء أبيك فعصاه فأسلم ثم قعد له بطريق الهجرة فقال تهاجر وتدع أرضك وسماءك وإنما مثل المهاجر كمثل الفرس في الطول فعصاه فهاجر ثم قعد له بطريق الجهاد فقال تجاهد فهو جهد النفس والمال فتقاتل فتقتل فتنكح المرأة ويقسم المال فعصاه فجاهد ‏\"‏ ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ فمن فعل ذلك كان حقا على الله عز وجل أن يدخله الجنة ومن قتل كان حقا على الله عز وجل أن يدخله الجنة وإن غرق كان حقا على الله أن يدخله الجنة أو وقصته دابته كان حقا على الله أن يدخله الجنة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Sabrah bin Abi Fakih said:                      \"I heard the Messenger of Allah (ﷺ) say: 'the Shaitan sits in the paths of the son of Adam. He sits waiting for him, in the path to Islam, and he says: Will you accept Islam, and leave your religion, and the religion of your forefathers? But he disobeys him and accepts Islam. Then he sits waiting for him, on the path to emigration, and he says: Will you emigrate and leave behind your land and sky? The one who emigrates is like a horse tethered to a peg. But he disobeys him and emigrates. Then he sits, waiting for him, on the path to Jihad, and he says: Will you fight in Jihad when it will cost you your life and your wealth? You will fight and be killed, and your wife will remarry, and your wealth will be divided. But he disobeys him and fights in Jihad.' The Messenger of Allah (ﷺ) said: 'Whoever does that, then he had a right from Allah, the Mighty and Sublime, that He will admit him to paradise. Whoever is killed, he has a right from Allah, the Mighty and Sublime, that He will admit him to Paradise. If he is drowned, he has a right from Allah that He will admit him to paradise, or whoever is thrown by his mount and his neck is broken, he had a right from Allah that he will admit him to Paradise.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "20390",
        "20723",
        "15562",
        "11342"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3197",
      "hadith_no": "3197",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرني إبراهيم بن يعقوب، قال حدثنا ابن أبي مريم، قال أنبأنا سفيان، قال حدثني عمرو بن دينار، عن عطاء، عن ابن عباس، قال توفي رسول الله صلى الله عليه وسلم وعنده تسع نسوة يصيبهن إلا سودة فإنها وهبت يومها وليلتها لعائشة ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     It was narrated that Ibn 'Abbas said: \"When the Messenger of Allah died he had nine wives; he used to be intimate with all of them except one, who had given her day and night to 'Aishah.\"",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "30232",
        "20012",
        "11081",
        "11029",
        "17"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3290",
      "hadith_no": "3290",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرني إبراهيم بن يعقوب، قال حدثنا ابن أبي مريم، قال حدثنا يحيى بن أيوب، أن جعفر بن ربيعة، حدثه عن عراك بن مالك، وعبد الرحمن الأعرج، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم أنه نهى أن تنكح المرأة على عمتها أو خالتها ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah forbade being married to a woman and her paternal aunt or maternal aunt at the same time.",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "30232",
        "20379",
        "11407",
        "11204",
        "11197",
        "13"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3587",
      "hadith_no": "3587",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Horses, Races and Shooting - كتاب الخيل",
      "chapter_no": "28",
      "text_ar": "أخبرنا إبراهيم بن يعقوب، قال حدثنا ابن أبي مريم، قال أنبأنا الليث، عن ابن أبي جعفر، عن محمد بن عبد الرحمن، عن سليمان بن يسار، عن أبي عبد الله، مولى الجندعيين عن أبي هريرة، رضى الله عنه قال لا يحل سبق إلا على خف أو حافر ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                      \"No award (for victory in a competition) is permissible except over camels or horses.\"",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "30232",
        "20023",
        "11105",
        "11005",
        "13"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3843",
      "hadith_no": "3843",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرني إبراهيم بن يعقوب، قال حدثنا الحسن بن موسى، قال حدثنا شيبان، عن يحيى، عن محمد بن الزبير، عن أبيه، عن عمران، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا نذر في غضب وكفارته كفارة اليمين ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Imran said:                      The Messenger of Allah said: \"There is no vow at a moment of anger and its expiation is the expiation for an oath.\"",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "20383",
        "20240",
        "11449",
        "14340",
        "123"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3846",
      "hadith_no": "3846",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرني إبراهيم بن يعقوب، قال حدثنا مسدد، قال حدثنا عبد الوارث، عن محمد بن الزبير الحنظلي، قال أخبرني أبي أن رجلا، حدثه أنه، سأل عمران بن حصين عن رجل، نذر نذرا لا يشهد الصلاة في مسجد قومه فقال عمران سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا نذر في غضب وكفارته كفارة يمين ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Muhammad bin Az-Zubayr Hanzali said:                      My father told me that a man told him, that he asked 'Imran bin Husain about a man who made a vow not to attend the prayers in the mosque of his people. 'Imran said: I heard the Messenger of Allah say: There is no vow at a moment of anger and its expiation is the expiation for an oath.",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "30175",
        "20258",
        "14340",
        "123"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3866",
      "hadith_no": "3866",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرني إبراهيم بن يعقوب بن إسحاق، قال حدثنا عفان، قال حدثنا عبد الواحد، قال حدثنا سعيد بن عبد الرحمن، عن مجاهد، قال حدثني أسيد بن رافع بن خديج، قال قال رافع بن خديج نهاكم رسول الله صلى الله عليه وسلم عن أمر كان لنا نافعا وطاعة رسول الله صلى الله عليه وسلم أنفع لنا قال ‏‏\"‏‏ من كانت له أرض فليزرعها فإن عجز عنها فليزرعها أخاه ‏‏\"‏‏‏.‏‏ خالفه عبد الكريم بن مالك‏.‏‏",
      "text_en": " Usaid bin Rafi' bin Khadij said:                      \"Rafi' bin Khadij said: 'The Messenger of Allah has forbidden something for you that used to be beneficial for us, but obedience to the Messenger of Allah is more beneficial for us. He said: \"Whoever has land let him cultivate it, and if he is unable to do so, let him give it to his brother to cultivate.\"'\"",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "30106",
        "20256",
        "11028",
        "1988"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-4019",
      "hadith_no": "4019",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرني إبراهيم بن يعقوب، قال حدثنا محمد بن عيسى، قال حدثنا حماد بن زيد، قال حدثنا يحيى بن سعيد، قال حدثني أبو أمامة بن سهل، وعبد الله بن عامر بن ربيعة، قالا كنا مع عثمان وهو محصور - وكنا إذا دخلنا مدخلا نسمع كلام من بالبلاط - فدخل عثمان يوما ثم خرج فقال إنهم ليتواعدوني بالقتل ‏.‏ قلنا يكفيكهم الله ‏.‏ قال فلم يقتلوني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يحل دم امرئ مسلم إلا بإحدى ثلاث رجل كفر بعد إسلامه أو زنى بعد إحصانه أو قتل نفسا بغير نفس ‏\"‏ ‏.‏ فوالله ما زنيت في جاهلية ولا إسلام ولا تمنيت أن لي بديني بدلا منذ هداني الله ولا قتلت نفسا فلم يقتلونني",
      "text_en": " Abu Umamah bin Sahl and 'Abdullah bin 'Amir bin Rabi'ah said:                     \"We were with 'Uthman when he was under siege and we could hear what was said from Al-Balat. 'Uthman came in one day, then he came out, and said: 'They are threatening to kill me.' We said: 'Allah will suffice you against them.' He said: 'Why would they kill me? I heard the Messenger of Allah [SAW] say: It is not permissible to shed the blood of a Muslim except in one of three cases: A man who reverts to Kufr after becoming Muslim, or commits adultery after being married, or one who kills a soul unlawfully. By Allah, I did not commit adultery during Jahiliyyah or in Islam, I never wished to follow any other religion since Allah guided me, and I have never killed anyone, so why do they want to kill me?'\"",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "31167",
        "20022",
        "11062",
        "15659",
        "709"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-4127",
      "hadith_no": "4127",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا إبراهيم بن يعقوب، قال حدثنا أحمد بن يونس، قال حدثنا أبو بكر بن عياش، عن الأعمش، عن مسلم، عن مسروق، عن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا ترجعوا بعدي كفارا يضرب بعضكم رقاب بعض ولا يؤخذ الرجل بجريرة أبيه ولا بجريرة أخيه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah said:                     \"The Messenger of Allah [SAW] said: 'Do not revert to disbelievers after I am gone, striking the necks of one another (killing one another). No man is to be punished for the sins of his father, or the sins of his brother.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "30184",
        "20373",
        "11060",
        "11392",
        "11018",
        "16"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-4129",
      "hadith_no": "4129",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرني إبراهيم بن يعقوب، قال حدثنا يعلى، قال حدثنا الأعمش، عن أبي الضحى، عن مسروق، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا ترجعوا بعدي كفارا ‏\"‏ ‏.‏ مرسل ‏.‏",
      "text_en": " It was narrated from Masruq that:                     The Messenger of Allah [SAW] said: \"Do not revert to disbelievers after I am gone.\" It is Mursal.",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "20372",
        "11060",
        "11392",
        "11018"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-4225",
      "hadith_no": "4225",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of al-Fara' and al-'Atirah - كتاب الفرع والعتيرة",
      "chapter_no": "41",
      "text_ar": "أخبرني إبراهيم بن يعقوب بن إسحاق، قال حدثنا عبيد الله بن عبد المجيد أبو علي الحنفي، قال حدثنا داود بن قيس، قال سمعت عمرو بن شعيب بن محمد بن عبد الله بن عمرو، عن أبيه، ‏{‏ عن أبيه، ‏}‏ وزيد بن أسلم قالوا يا رسول الله الفرع ‏.‏ قال ‏\"‏ حق فإن تركته حتى يكون بكرا فتحمل عليه في سبيل الله أو تعطيه أرملة خير من أن تذبحه فيلصق لحمه بوبره فتكفئ إناءك وتوله ناقتك ‏\"‏ ‏.‏ قالوا يا رسول الله فالعتيرة قال ‏\"‏ العتيرة حق ‏\"‏ ‏.‏ قال أبو عبد الرحمن أبو علي الحنفي هم أربعة إخوة أحدهم أبو بكر وبشر وشريك وآخر ‏.‏",
      "text_en": " 'Amr bin Shu'aib bin Muhammad bin 'Abdullah bin 'Amr (narrated) that his father and Zaid bin Aslam said:                     \"O Messenger of Allah! (What about) the Fara'?\" He said: \"It is a duty, but if you leave it (the animal) until it becomes half-grown and you load upon it (in Jihad) in the cause of Allah or give it to a widow, that is better than if you slaughter it (when it is just born) and its flesh is difficult to separate from its skin, then you turn your vessel upside down (because you will no longer be able to get milk from the mother) and you cause your she-camel to grieve (at the loss of its young).\" They said: \"O Messenger of Allah, (what about) the 'Atirah?\" He said: \"The 'Atirah is a duty.\" (Hasan)Abu 'Abdur-Rahman (An-Nasa'i) said:  Abu 'Ali Al-Hanafi (one of the narrators); they are four brothers: One of them is Abu Bakr, and Bishr, and Sharik, and the other.",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "11845",
        "19934"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-4247",
      "hadith_no": "4247",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of al-Fara' and al-'Atirah - كتاب الفرع والعتيرة",
      "chapter_no": "41",
      "text_ar": "أخبرني إبراهيم بن يعقوب، قال حدثنا مالك بن إسماعيل، قال حدثنا إسرائيل، عن الأعمش، عن إبراهيم، عن الأسود، عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ ذكاة الميتة دباغها ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"The Prophet said: 'The dead animal is purified by tanning it.\"'",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "20357",
        "20311",
        "11060",
        "11051",
        "11054",
        "53"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-4411",
      "hadith_no": "4411",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا إبراهيم بن يعقوب، قال حدثنا عبيد الله بن موسى، قال أنبأنا إسرائيل، عن منصور، عن خالد الحذاء، عن أبي قلابة، عن أبي أسماء الرحبي، عن أبي الأشعث، عن شداد بن أوس، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن الله عز وجل كتب الإحسان على كل شىء فإذا قتلتم فأحسنوا القتلة وإذا ذبحتم فأحسنوا الذبح وليحد أحدكم إذا ذبح شفرته وليرح ذبيحته ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Shaddad bin Aws said:                     \"I heard the Messenger of Allah say: 'Allah, the Might and Sublime, has the Mighty and Sublime, has decreed proficiency in all things, so when you kill, kill, well, and when you slaughter, slaughter well. Let on e of you sharpen his blade and spare suffering to the animal he slaughters\" (Sahih )",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "20340",
        "20311",
        "11067",
        "11282",
        "11047",
        "10883",
        "30121",
        "389"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-4510",
      "hadith_no": "4510",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا إبراهيم بن يعقوب بن إسحاق، قال حدثنا عبد الله بن يوسف، قال حدثنا الليث، عن عقيل، عن ابن شهاب، قال أخبرني عامر بن سعد بن أبي وقاص، عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم نهى عن الملامسة لمس الثوب لا ينظر إليه وعن المنابذة وهي طرح الرجل ثوبه إلى الرجل بالبيع قبل أن يقلبه أو ينظر إليه ‏.‏",
      "text_en": " It was narrated from Abu Sa' eed Al- Khudri that:                     the Messenger of Allah forbade Mulamasah, which means touching a garment without looking at it, and Munabadha, which is where one man sells his garment to another man, by throwing it to him, without him checking it or looking at it.",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "30355",
        "20023",
        "11207",
        "11013",
        "10554",
        "38"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-4931",
      "hadith_no": "4931",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرني إبراهيم بن يعقوب، قال حدثنا عبد الله بن يوسف، قال حدثنا عبد الرحمن بن محمد بن عبد الرحمن بن أبي الرجال، عن أبيه، عن عمرة، عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ يقطع يد السارق في ثمن المجن وثمن المجن ربع دينار ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"The Messenger of Allah said: 'The hand of the thief is to be cut off for the price of a shield, and the price of a shield is one-quarter of a Dinar.\"",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "30355",
        "11455",
        "53"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-5064",
      "hadith_no": "5064",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرني إبراهيم بن يعقوب، قال حدثنا سعيد بن سليمان، قال حدثنا أبو شهاب، قال حدثنا الأعمش، عن أبي وائل، قال خطبنا ابن مسعود فقال كيف تأمروني أقرأ على قراءة زيد بن ثابت بعد ما قرأت من في رسول الله صلى الله عليه وسلم بضعا وسبعين سورة وإن زيدا مع الغلمان له ذؤابتان ‏.‏",
      "text_en": " It was narrated that Abu Wa'il said:                     \"Ibn Mas'ud addressed us and said: 'How do you want me to recite? According to the recitation of Zaid bin Thabit, when I learned seventy-odd Surahs from the mouth of the Messenger of Allah [SAW] while Zaid was with the other boys with two braids?'\"",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "30252",
        "11613",
        "11060",
        "11353"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-5090",
      "hadith_no": "5090",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرني إبراهيم بن يعقوب، قال حدثنا أبو زيد، سعيد بن الربيع قال حدثنا علي بن المبارك، قال سمعت كريمة، قالت سمعت عائشة، سألتها امرأة عن الخضاب، بالحناء قالت لا بأس به ولكن أكره هذا لأن حبي صلى الله عليه وسلم كان يكره ريحه ‏.‏ تعني النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Karimah said:                     \"I heard a woman asking 'Aishah about dyeing the hair with Henna. She said: 'There is nothing wrong with it, but I do not like to do it because my beloved- meaning the Prophet [SAW]- disliked its smell.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "20231",
        "20449"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-5109",
      "hadith_no": "5109",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا إبراهيم بن يعقوب، قال حدثنا علي بن الحسن بن شقيق، قال أنبأنا الحسين بن واقد، قال حدثنا عبد الملك بن عمير، عن العريان بن الهيثم، عن قبيصة بن جابر، عن عبد الله، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لعن الله المتنمصات والموتشمات والمتفلجات اللاتي يغيرن خلق الله عز وجل ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah said:                     \"I heard the Messenger of Allah [SAW] say: 'May Allah curse Al-Mutanammisat, women who have tattoos done and women who have their teeth separated, those who change the creation of Allah, Mighty and Sublime.\"",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "30362",
        "20648",
        "11368",
        "15367",
        "16"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-5272",
      "hadith_no": "5272",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرني إبراهيم بن يعقوب، قال حدثنا الحسن بن موسى، قال حدثنا شيبان، عن يحيى، أخبرني خالد بن معدان، أن ابن حنين، حدثه أن عليا قال إن رسول الله صلى الله عليه وسلم نهى عن ثياب المعصفر وعن الحرير وأن يقرأ وهو راكع وعن خاتم الذهب ‏.‏",
      "text_en": " It was narrated from Ibn Hunain, that 'Ali said that:                     The Messenger of Allah [SAW] forbade garments dyed with safflower, and from silk, and reciting Qur'an while he is bowing, and from gold rings.",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "20383",
        "20240",
        "11449",
        "11422",
        "5"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-5308",
      "hadith_no": "5308",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرني إبراهيم بن يعقوب، قال حدثنا أبو النعمان، سنة سبع ومائتين قال حدثنا الصعق بن حزن، عن قتادة، عن علي البارقي، قال أتتني امرأة تستفتيني فقلت لها هذا ابن عمر ‏.‏ فاتبعته تسأله واتبعتها أسمع ما يقول ‏.‏ قالت أفتني في الحرير ‏.‏ قال نهى عنه رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated that 'Ali Al-Bariqi said:                     \"A woman came to me to ask a question, and I said to her: 'There is Ibn 'Umar.' So she went after him to ask him, and I went after her to hear what he would say. She said: 'Tell me about silk.' He said: 'The Messenger of Allah [SAW] forbade it.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "20552",
        "11019"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-5534",
      "hadith_no": "5534",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا إبراهيم بن يعقوب، قال حدثني العلاء بن هلال، قال حدثنا عبيد الله، عن زيد، عن عمرو بن مرة، عن القاسم بن عبد الرحمن، عن مسروق بن الأجدع، عن عائشة، قالت طلبت رسول الله صلى الله عليه وسلم ذات ليلة في فراشي فلم أصبه فضربت بيدي على رأس الفراش فوقعت يدي على أخمص قدميه فإذا هو ساجد يقول ‏\"‏ أعوذ بعفوك من عقابك وأعوذ برضاك من سخطك وأعوذ بك منك ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"I looked for the Messenger of Allah [SAW] one night in my bed, and I did not find him. I struck my hand on the head of the bed, and my hand fell on the soles of his feet. He was prostrating and saying: 'A'udhu bi 'afwika min 'iqabika, wa a'udhu bi ridaka min sakhatika, wa a'udhu bika minka (I seek refuge in Your forgiveness from Your punishment, and I seek refuge in Your pleasure from Your wrath, and I seek refuge in You from You.)'\"",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "28464",
        "11201",
        "15",
        "11381",
        "19896",
        "11018",
        "53"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-5535",
      "hadith_no": "5535",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرني إبراهيم بن يعقوب، قال حدثنا زيد بن الحباب، أن معاوية بن صالح، حدثه وحدثني أزهر بن سعيد، - يقال له الحرازي شامي عزيز الحديث - عن عاصم بن حميد قال سألت عائشة بما كان رسول الله صلى الله عليه وسلم يفتتح قيام الليل قالت سألتني عن شىء ما سألني عنه أحد كان يكبر عشرا ويسبح عشرا ويستغفر عشرا ويقول ‏\"‏ اللهم اغفر لي واهدني وارزقني وعافني ‏\"‏ ‏.‏ ويتعوذ من ضيق المقام يوم القيامة ‏.‏",
      "text_en": " It was narrated that 'Asim bin Humaid said:                     \"I asked 'Aishah with what the Messenger of Allah [SAW] would start Qiyam Al-Lail. She said: 'You have asked me about something that no one else has asked me about. He used to say Allahu Akbar ten times, and Subhan-Allah ten times, and Istaghfir-Allah ten times, and he would say, Allahummaghfirli, wahdini, warzuqni, wa'afini (O Allah, forgive me, guide me, grant me provision and give me good health,) and he would seek refuge from the difficulty of the standing on the Day of Resurrection.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "20650",
        "20675",
        "18018"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    }
  ],
  "total_hadiths": 62,
  "grade_display": {
    "en": "3rd Century AH [11th Generation]",
    "ar": "القرن الثالث الهجري [الجيل الحادي عشر]",
    "ckb": "سەدەی سێیەمی كۆچی [نەوەی یازدەیەم]"
  }
}