{
  "id": "38091",
  "name": "Azhar bin Mrwan al-Rqashy أزهر بن مروان الرقاشي",
  "full_name": "Azhar bin Mrwan al-Rqashy أزهر بن مروان الرقاشي",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "243",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ ت  ق  -  صدوق ]"
    ],
    "tags": []
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "780",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا أزهر بن مروان البصري، حدثنا محمد بن سواء، حدثنا سعيد بن أبي عروبة، عن أيوب، عن محمد بن سيرين، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا دعي أحدكم إلى طعام فليجب فإن كان صائما فليصل ‏\"‏ ‏.‏ يعني الدعاء ‏.‏",
      "text_en": " Abu Hurairah narrated that:                     The Prophet said: \"When one of you is invited to eat then let him respond, if he is fasting then let him pray.\" Meaning: supplicate.",
      "chain": [
        "38091",
        "20565",
        "11073",
        "11015",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "1713",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jihad - كتاب الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "23",
      "text_ar": "حدثنا أزهر بن مروان البصري، حدثنا عبد الوارث بن سعيد، عن أيوب، عن حميد بن هلال، عن أبي الدهماء، عن هشام بن عامر، قال شكي إلى رسول الله صلى الله عليه وسلم الجراحات يوم أحد فقال ‏\"‏ احفروا وأوسعوا وأحسنوا وادفنوا الاثنين والثلاثة في قبر واحد وقدموا أكثرهم قرآنا ‏\"‏ ‏.‏ فمات أبي فقدم بين يدى رجلين ‏.‏ قال أبو عيسى وفي الباب عن خباب وجابر وأنس ‏.‏ وهذا حديث حسن صحيح ‏.‏ وروى سفيان الثوري وغيره هذا الحديث عن أيوب عن حميد بن هلال عن هشام بن عامر ‏.‏ وأبو الدهماء اسمه قرفة بن بهيس أو بيهس ‏.‏",
      "text_en": " Narrated Hisham bin 'Amr:                     \"On the day of Uhud, the wounded complained to the Messenger of Allah, so he said: 'Dig, and make it wide, and appropriate, and bury two and three in one grave. And advance the one who knew the most Qu'ran.' My father had died so he placed before two men.\"[Abu 'Eisa said:] There are narrations on this topic from Khabbab, Jabir, and Anas. This Hadith is Hasan SahihSufyan Ath-Thawri and others reported this Hadith from Ayyub, from Humaid bin Hilal, from Hisham bin 'Amir. And Abu Ad-Dahma's (a narrator in the chain) name is Qirfah bin Buhais or Baihas",
      "chain": [
        "38091",
        "20258",
        "11015",
        "11281",
        "1331"
      ]
    },
    {
      "hadith_no": "1775",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Clothing - كتاب اللباس",
      "chapter_no": "24",
      "text_ar": "حدثنا أزهر بن مروان البصري، حدثنا الحارث بن نبهان، عن معمر، عن عمار بن أبي عمار، عن أبي هريرة، قال نهى رسول الله صلى الله عليه وسلم أن ينتعل الرجل وهو قائم ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏ وروى عبيد الله بن عمرو الرقي هذا الحديث عن معمر عن قتادة عن أنس وكلا الحديثين لا يصح عند أهل الحديث ‏.‏ والحارث بن نبهان ليس عندهم بالحافظ ولا نعرف لحديث قتادة عن أنس أصلا ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     \"The Messenger of Allah (ﷺ) prohibited that a man should put on sandals while he is standing.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib. 'Ubaidullah bin 'Amr Ar-Raqqi reported this Hadith from Ma'mar, from Qatadah, from Anas. Both of the Ahadith are not correct according to the people of Hadith. Al-Harith bin Nabhan is not a Hafiz according to them, and we do not know any basis for the narration of Qatadah from Anas.",
      "chain": [
        "38091",
        "24061",
        "20115",
        "10951",
        "13"
      ]
    },
    {
      "hadith_no": "2130",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Wala' And Gifts - كتاب الولاء والهبة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "31",
      "text_ar": "حدثنا أزهر بن مروان البصري، حدثنا محمد بن سواء، حدثنا أبو معشر، عن سعيد، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ تهادوا فإن الهدية تذهب وحر الصدر ولا تحقرن جارة لجارتها ولو شق فرسن شاة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب من هذا الوجه ‏.‏ وأبو معشر اسمه نجيح مولى بني هاشم وقد تكلم فيه بعض أهل العلم من قبل حفظه ‏.‏",
      "text_en": " Abu Hurairah narrated that the Prophet (s.a.w) said:                     \"Give gifts, for indeed the gift removes bad feelings from the chest. And let the neighbor not look down upon (the gift of) her neighbor, even if it be the lower shanks of sheep.\" [Abu 'Eisa said:] This Hadith is Gharib from this route. Abu Ma'shar's name is Najih, the freed slave of Banu Hisham. Some of the people of knowledge criticized him due to his poor memory.",
      "chain": [
        "38091",
        "20565",
        "10765",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "218",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا أزهر بن مروان، حدثنا الحارث بن نبهان، حدثنا عاصم بن بهدلة، عن مصعب بن سعد، عن أبيه، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ خياركم من تعلم القرآن وعلمه ‏\"‏ ‏.‏ قال وأخذ بيدي فأقعدني مقعدي هذا أقرئ ‏.‏",
      "text_en": " Mus'ab bin Sa'd narrated that his father said:                     \"The Messenger of Allah said: 'The best of you is the one who learns the Qur'an and teaches it.' \" 'Then he (Mus'ab) took me (the narrator) by the hand and made me sit here, and I started to teach Qur'an.'\"",
      "chain": [
        "38091",
        "24061",
        "11358",
        "10556",
        "9"
      ]
    },
    {
      "hadith_no": "871",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أزهر بن مروان، حدثنا الحارث بن نبهان، حدثنا عاصم بن بهدلة، عن مصعب بن سعد، عن أبيه، قال كان رسول الله  صلى الله عليه وسلم  يقرأ في صلاة الفجر يوم الجمعة ‏{الم * تنزيل}‏ و ‏{هل أتى على الإنسان}‏",
      "text_en": " It wasnarrated from Mus’ab bin Sa’d that his father said:                      “For theFajr prayer on Fridays, the Messenger of Allah (ﷺ) used to recite‘Alif-Lam-Mim. The revelation...’ [32:1] and ‘Has there notbeen overman...’” [76:1]",
      "chain": [
        "38091",
        "24061",
        "11358",
        "10556",
        "9"
      ]
    },
    {
      "hadith_no": "987",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أزهر بن مروان، حدثنا عبد الوارث، حدثنا أيوب، عن نافع، عن ابن عمر، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إذا وضع العشاء وأقيمت الصلاة فابدءوا بالعشاء ‏\"‏ ‏.‏ قال فتعشى ابن عمر ليلة وهو يسمع الإقامة ‏.‏",
      "text_en": " It wasnarrated from Nafi’ that Ibn ‘Umar said:                      “The Messenger ofAllah (ﷺ) said: ‘If food is served and the Iqamah for prayer isgiven, then start with the food.”He said: \"Ibn 'Umar ate dinner one night while he could hear the Iqamah.\"",
      "chain": [
        "38091",
        "20258",
        "11015",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1627",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا أزهر بن مروان، حدثنا عبد الوارث بن سعيد، حدثنا أيوب، عن حميد بن هلال، عن أبي الدهماء، عن هشام بن عامر، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ احفروا وأوسعوا وأحسنوا ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Hisham bin ‘Amir that the Messenger of Allah(ﷺ)said:                      “Dig the grave deep, make it spacious and prepare itwell.”",
      "chain": [
        "38091",
        "20258",
        "11015",
        "11281",
        "1331"
      ]
    },
    {
      "hadith_no": "1629",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا أزهر بن مروان، ومحمد بن زياد، قالا حدثنا عبد الوارث، عن أيوب، عن أبي الزبير، عن جابر، قال نهى رسول الله  صلى الله عليه وسلم  عن تقصيص القبور ‏.‏",
      "text_en": " It wasnarrated that Jabir said:                      “The Messenger of Allah (ﷺ)forbadeplastering over graves.”",
      "chain": [
        "38091",
        "11216",
        "20258",
        "11015",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "1642",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا أزهر بن مروان، حدثنا عبد الوارث، حدثنا محمد بن جحادة، عن أبي صالح، عن ابن عباس، قال لعن رسول الله  صلى الله عليه وسلم  زوارات القبور ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “The Messenger of Allah (ﷺ)cursed women who visit graves.”",
      "chain": [
        "38091",
        "20258",
        "18897",
        "11161",
        "17"
      ]
    },
    {
      "hadith_no": "1926",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا أزهر بن مروان، حدثنا حماد بن زيد، عن أيوب، عن القاسم الشيباني، عن عبد الله بن أبي أوفى، قال لما قدم معاذ من الشام سجد للنبي  صلى الله عليه وسلم  قال ‏\"‏ ما هذا يا معاذ ‏\"‏ ‏.‏ قال أتيت الشام فوافقتهم يسجدون لأساقفتهم وبطارقتهم فوددت في نفسي أن نفعل ذلك بك ‏.‏ فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ فلا تفعلوا فإني لو كنت آمرا أحدا أن يسجد لغير الله لأمرت المرأة أن تسجد لزوجها والذي نفس محمد بيده لا تؤدي المرأة حق ربها حتى تؤدي حق زوجها ولو سألها نفسها وهي على قتب لم تمنعه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that:                     Abdullah bin Abu Awfa said” When Muadh bin Jabal came from Sham, he prostrated to the Prophet who said: 'What is this, O Muadh?' He said: 'I went to Sham and saw them prostrating their bishops and patricians and I wanted to do that for you.' The messenger of Allah said: 'Do not do that. If I were to command anyone to prostrate to anyone other than Allah, I would have commanded women to prostrate to their husbands. By the one in who hand is the soul of Muhammad! No woman can fulfill her duty towards Allah until she fulfills her duty towards her husband. If he asks her (for intimacy) even if she is on her camel saddle, she should not refuse.' “",
      "chain": [
        "38091",
        "20022",
        "11015",
        "5115"
      ]
    },
    {
      "hadith_no": "2035",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا أزهر بن مروان، حدثنا عبد الوارث بن سعيد، حدثنا القاسم بن عبد الواحد، عن عبد الله بن محمد بن عقيل، عن ابن عمر، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إذا تزوج العبد بغير إذن سيده كان عاهرا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar:                     that the Messenger of Allah said : \"If a slave gets married without his master's permission, he is a fornicator.\"",
      "chain": [
        "38091",
        "20258",
        "23050",
        "12246",
        "18"
      ]
    },
    {
      "hadith_no": "2134",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Divorce - كتاب الطلاق",
      "chapter_no": "10",
      "text_ar": "حدثنا أزهر بن مروان، حدثنا عبد الأعلى بن عبد الأعلى، حدثنا سعيد بن أبي عروبة، عن قتادة، عن عكرمة، عن ابن عباس، أن جميلة بنت سلول، أتت النبي  صلى الله عليه وسلم  فقالت والله ما أعتب على ثابت في دين ولا خلق ‏.‏ ولكني أكره الكفر في الإسلام لا أطيقه بغضا ‏.‏ فقال لها النبي  صلى الله عليه وسلم  ‏\"‏ أتردين عليه حديقته ‏\"‏ ‏.‏ قالت نعم ‏.‏ فأمره رسول الله  صلى الله عليه وسلم  أن يأخذ منها حديقته ولا يزداد ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that:                     Jamilah bint Salul came to the Prophet (ﷺ) and said: \"By Allah, I do not find any fault with Thabit regarding his religion nor his behavior, but I hate disbelief after becoming Muslim and I cannot stand him. \"The Prophet (ﷺ) said to her: 'WiIl you give him back his garden?\" She said: \"Yes.\" So the Messenger of Allah (ﷺ) told him to take back his garden from her and no more than that.",
      "chain": [
        "38091",
        "20246",
        "11073",
        "11019",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2272",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا أزهر بن مروان، قال حدثنا حماد بن زيد، ح وحدثنا أبو كريب، حدثنا إسماعيل ابن علية، قالا حدثنا أيوب، عن عمرو بن شعيب، عن أبيه، عن جده، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا يحل بيع ما ليس عندك ولا ربح ما لم يضمن ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from his father, that his grandfather said:                     \"The Messenger of Allah (ﷺ) said: 'It is not permissible to sell something that is not with you, nor to profit from what  you do not possess.\"'",
      "chain": [
        "38091",
        "20022",
        "30216",
        "20208",
        "11015",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2352",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا أزهر بن مروان، حدثنا حماد بن زيد، عن أيوب، عن أبي الزبير، وسعيد بن ميناء، عن جابر بن عبد الله، أن رسول الله  صلى الله عليه وسلم  نهى عن المحاقلة والمزابنة ‏.‏",
      "text_en": " lt was narrated from Sabir bin 'Abdullah that :                     the Messenger of Allah (ﷺ) forbade the Muhaqalah and the Muzabanah.",
      "chain": [
        "38091",
        "20022",
        "11015",
        "11263",
        "11510",
        "34"
      ]
    },
    {
      "hadith_no": "2354",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Rulings - كتاب الأحكام",
      "chapter_no": "13",
      "text_ar": "حدثنا أزهر بن مروان، حدثنا عبد الأعلى، حدثنا سعيد، عن قتادة، عن أنس بن مالك، أن رجلا، كان في عهد رسول الله صلى الله عليه وسلم في عقدته ضعف وكان يبايع وأن أهله أتوا النبي صلى الله عليه وسلم فقالوا يا رسول الله احجر عليه ‏.‏ فدعاه النبي صلى الله عليه وسلم فنهاه عن ذلك فقال يا رسول الله إني لا أصبر عن البيع ‏.‏ فقال ‏\"‏ إذا بايعت فقل ها ولا خلابة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Anas bin Malik that :                     there was a man at the time of the Messenger of Allah (ﷺ) whose mental faculties were lacking, and he used to buy and sell. His family came to the Prophet (ﷺ) and said, “O Messenger of Allah, stop him.” So The Prophet (ﷺ) called him, and told him not to do that. He said: “O Messenger of Allah (ﷺ), I cannot bear to be away from business.” He said, “If you engage in a transaction then say: “Take it (i.e., the goods) and don't cheat (me).' ”",
      "chain": [
        "38091",
        "20246",
        "11168",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "2660",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا أزهر بن مروان، حدثنا عبد الوارث بن سعيد، حدثنا القاسم بن عبد الواحد، عن عبد الله بن محمد بن عقيل، عن جابر بن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن أخوف ما أخاف على أمتي عمل قوم لوط ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Jabir bin`Abdullah that the Messenger of Allah (ﷺ) said:                     “The thing that I most fear for my nation is the action of the people of Lut.”",
      "chain": [
        "38091",
        "20258",
        "23050",
        "12246",
        "34"
      ]
    },
    {
      "hadith_no": "4218",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا أزهر بن مروان، حدثنا عبد الأعلى، حدثنا سعيد، عن قتادة، قال حدثنا أبو رافع، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن يأجوج ومأجوج يحفرون كل يوم حتى إذا كادوا يرون شعاع الشمس قال الذي عليهم ارجعوا فسنحفره غدا ‏.‏ فيعيده الله أشد ما كان حتى إذا بلغت مدتهم وأراد الله أن يبعثهم على الناس حفروا حتى إذا كادوا يرون شعاع الشمس قال الذي عليهم ارجعوا فستحفرونه غدا إن شاء الله تعالى واستثنوا فيعودون إليه وهو كهيئته حين تركوه فيحفرونه ويخرجون على الناس فينشفون الماء ويتحصن الناس منهم في حصونهم فيرمون بسهامهم إلى السماء فترجع عليها الدم الذي اجفظ فيقولون قهرنا أهل الأرض وعلونا أهل السماء فيبعث الله نغفا في أقفائهم فيقتلهم بها ‏\"‏ ‏.‏ قال رسول الله  صلى الله عليه وسلم  ‏\"‏ والذي نفسي بيده إن دواب الأرض لتسمن وتشكر شكرا من لحومهم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                      \"Gog and Magog people dig every day until, when they canalmostsee the rays of the sun, the one in charge of them says: \"Goback andwe will dig it tomorrow.\" Then Allah puts it back,stronger than itwas before. (This will continue) until, when theirtime has come, andAllah wants to send them against the people, theywill dig until theycan almost see the rays of the sun, then the onewho is in charge ofthem will say: \"Go back, and we will dig ittomorrow if Allah wills.'So they will say: \"If Allah wills.\"Then they will come back to it andit will be as they left it. Sothey will dig and will come out to thepeople, and they will drinkall the water. The people will fortifythemselves against them intheir fortresses. They will shoot theirarrows towards the sky andthey will come back with blood on them, andthey will say: \"Wehave defeated the people of earth and dominated thepeople ofheaven.\" Then Allah will send a worm in the napes of theirnecksand will kill them thereby.'\" The Messenger of Allah (ﷺ)said:\"By the One in Whose Hand is my soul, the beasts of the earthwill grow fat on their flesh.\"",
      "chain": [
        "38091",
        "20246",
        "11168",
        "11019",
        "13"
      ]
    }
  ],
  "total_hadiths": 18
}