{
  "id": "38108",
  "name": "Isma'il bin Twbh bin Sulaiman إسماعيل بن توبة بن سليمان",
  "full_name": "Isma'il bin Twbh bin Sulaiman إسماعيل بن توبة بن سليمان",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "247",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ ق  -  صدوق ]"
    ],
    "tags": [
      "al-Thaqifi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20468",
      "name": "Hashaym bin Bashayr bin al-Qasim هشيم بن بشير بن القاسم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20396",
      "name": "Muhammad bin al-Hasan bin 'Imran محمد بن الحسن بن عمران",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20584",
      "name": "Khlf bin Khlyfh خلف بن خليفة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20155",
      "name": "Isma'il bin Ja'far bin Abi Kathir إسماعيل بن جعفر بن أبي كثير الأنصاري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "students": [
    {
      "id": "30004",
      "name": "Ibn Maja ابن ماجة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30554",
      "name": "Abu Zara' al-Razi أبو زرعة الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38164",
      "name": "al-Husain bin Ishaq al-Wasty الحسين بن إسحاق الواسطي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38385",
      "name": "'Ali bin Ishaq bin علي بن إسحاق",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "398",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا عمرو بن رافع، وإسماعيل بن توبة، قالا حدثنا يحيى بن زكريا بن أبي زائدة، عن حارثة، عن عمرة، عن عائشة، قالت كنت أتوضأ أنا ورسول الله،  صلى الله عليه وسلم  من إناء واحد قد أصابت منه الهرة قبل ذلك ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"The Messenger of Allah and I used to perform ablution from a single vessel, when the cat had drunk from it beforehand.\"",
      "chain": [
        "18792",
        "38108",
        "20366",
        "4109",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "427",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا إسماعيل بن توبة، حدثنا زياد بن عبد الله البكائي، عن عبد الملك بن أبي سليمان، عن أبي الزبير، عن جابر، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إذا قام أحدكم من النوم فأراد أن يتوضأ فلا يدخل يده في وضوئه حتى يغسلها فإنه لا يدري أين باتت يده ولا على ما وضعها ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Jabir said:                     \"The Messenger of Allah said: 'When anyone of oyu gets up from sleep and wants to perform ablution, he should not put his hand into the vessel he used for ablution until he has washed it, because he does not know where his hand spent the night or where he put it.'\" [(One of the narrators) Abu Ishaq said: \"What is correct is that it is narrated from Jabir, from Abu Hurairah.\"]",
      "chain": [
        "38108",
        "20322",
        "10945",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "551",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا إسماعيل بن توبة، حدثنا زياد بن عبد الله، حدثنا الفضل بن مبشر، قال رأيت جابر بن عبد الله يصلي الصلوات بوضوء واحد ‏.‏ فقلت ما هذا فقال رأيت رسول الله  صلى الله عليه وسلم  يصنع هذا فأنا أصنع كما صنع رسول الله  صلى الله عليه وسلم  ‏.‏",
      "text_en": " Fadl bin Mubashshir said:                     \"I saw Jabir bin 'Abdullah performing every prayer with one ablution, and I said: 'What is this?' He said: 'I saw the Messenger of Allah doing this, and I am doing as the Messenger of Allah did.'\"",
      "chain": [
        "38108"
      ]
    },
    {
      "hadith_no": "2156",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Divorce - كتاب الطلاق",
      "chapter_no": "10",
      "text_ar": "حدثنا إسماعيل بن توبة، حدثنا عباد بن العوام، عن يحيى بن أبي إسحاق، عن عبد الرحمن بن أذينة، عن أبي هريرة، أن رسول الله  صلى الله عليه وسلم  خير بريرة ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     the Messenger of Allah (ﷺ) gave Barirah the choice.",
      "chain": [
        "38108",
        "20431",
        "11314",
        "14235",
        "13"
      ]
    },
    {
      "hadith_no": "2315",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Rulings - كتاب الأحكام",
      "chapter_no": "13",
      "text_ar": "حدثنا إسماعيل بن توبة، حدثنا خلف بن خليفة، حدثنا أبو هاشم، قال لولا حديث ابن بريدة عن أبيه، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ القضاة ثلاثة اثنان في النار وواحد في الجنة رجل علم الحق فقضى به فهو في الجنة ورجل قضى للناس على جهل فهو في النار ورجل جار في الحكم فهو في النار ‏\"‏ ‏.‏ لقلنا إن القاضي إذا اجتهد فهو في الجنة ‏.‏",
      "text_en": " Abu Hashim said:                     “Were it not for the Hadith of Ibn Buraidah from his father, from the Prophet (ﷺ) who said: 'Judges are of three types, two of whom will be in Hell and one will be in Paradise. The man who knows the truth and rules in accordance with it, will be in Paradise. The man who passes judgment on the people in ignorance will be in Hell' - we would have said that if the judge does his best he will be in Paradise.”",
      "chain": [
        "38108",
        "20584",
        "11454"
      ]
    },
    {
      "hadith_no": "2496",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Charity - كتاب الصدقات",
      "chapter_no": "15",
      "text_ar": "حدثنا إسماعيل بن توبة، حدثنا هشيم، عن يونس بن عبيد، عن نافع، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ مطل الغني ظلم وإذا أحلت على مليء فاتبعه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that the Messenger of Allah (ﷺ) said:                     “When a rich man takes too long to repay a debt, this is wrongdoing, and if the debt is transferred to a rich man, you should accept if.”",
      "chain": [
        "38108",
        "20468",
        "11075",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2562",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Pawning - كتاب الرهون",
      "chapter_no": "16",
      "text_ar": "حدثنا إسماعيل بن توبة، حدثنا هشيم، عن ابن أبي ليلى، عن الحكم بن عتيبة، عن مقسم، عن ابن عباس، أن رسول الله صلى الله عليه وسلم أعطى خيبر أهلها على النصف نخلها وأرضها ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                     “When the Messenger of Allah (ﷺ) gave Khaibar to its people in return of its palm trees and land.",
      "chain": [
        "38108",
        "20468",
        "11196",
        "11069",
        "11725",
        "17"
      ]
    },
    {
      "hadith_no": "3173",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا إسماعيل بن توبة، حدثنا زافر بن سليمان، عن أبي سنان، عن عمرو بن مرة، عن مرة، عن عبد الله بن مسعود، قال قال رسول الله  صلى الله عليه وسلم  وهو على ناقته المخضرمة بعرفات فقال ‏\"‏ أتدرون أى يوم هذا وأى شهر هذا وأى بلد هذا ‏\"‏ ‏.‏ قالوا هذا بلد حرام وشهر حرام ويوم حرام ‏.‏ قال ‏\"‏ ألا وإن أموالكم ودماءكم عليكم حرام كحرمة شهركم هذا في بلدكم هذا في يومكم هذا ألا وإني فرطكم على الحوض وأكاثر بكم الأمم فلا تسودوا وجهي ألا وإني مستنقذ أناسا ومستنقذ مني أناس فأقول يا رب أصيحابي ‏.‏ فيقول إنك لا تدري ما أحدثوا بعدك ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Abdullah bin Mas’ud said:                      “The Messenger ofAllah (ﷺ) said, when he was atop his camel with the clipped ears in‘Arafat: ‘Do you know what day this is, what month this is andwhatland this is?’ They said: ‘This is a sacred land, a sacredmonth and asacred day.’ He said: ‘Your wealth and your blood aresacred to you asthis month of yours, in this land of yours, on thisday of yours. Iwill reach the Cistern (Hawd) before you, and I willbe proud of yourgreat numbers before the nations, so do not blackenmy face (i.e.,cause me to be ashamed). I will rescue some people,and some peoplewill be taken away from me. I will say: “O Lord, mycompanions!” andHe will say: “You do not know what innovationsthey introduced afteryou were gone.’”",
      "chain": [
        "38108",
        "26511",
        "11381",
        "16"
      ]
    }
  ],
  "total_hadiths": 8
}