{
  "id": "38107",
  "name": "Isma'il bin Bhram bin Yahya إسماعيل بن بهرام بن يحيى",
  "full_name": "Isma'il bin Bhram bin Yahya إسماعيل بن بهرام بن يحيى",
  "grade": "3rd Century AH [11th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "241",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Hamadan"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ ق  -  صدوق ]"
    ],
    "tags": [
      "al-Hamdani"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "2226",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا إسماعيل بن بهرام، حدثنا الحسن بن محمد بن عثمان، زوج بنت الشعبي حدثنا سفيان، عن الأعمش، عن يزيد الرقاشي، عن أنس بن مالك، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ أعظم الناس هما المؤمن الذي يهم بأمر دنياه وأمر آخرته ‏\"‏ ‏.‏ قال أبو عبد الله هذا حديث غريب تفرد به إسماعيل ‏.‏",
      "text_en": " It was narrated from Anas bin Malik that the Messenger of Allah (ﷺ) said:                     The one who has the most concerns is the believer who is concerned about both his worldly affairs and his Hereafter.\"' (Da'if)Abu 'Abdullah said: \"This Hadith is Gharib' Isma'il, alone, has narrated it.\"",
      "chain": [
        "38107",
        "30245",
        "20005",
        "11060",
        "14422",
        "19"
      ]
    },
    {
      "hadith_no": "3647",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا إسماعيل بن بهرام، حدثنا عبيد الله الأشجعي، عن سفيان، عن سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، قال لدغت عقرب رجلا فلم ينم ليلته فقيل للنبي  صلى الله عليه وسلم  إن فلانا لدغته عقرب فلم ينم ليلته ‏.‏ فقال ‏\"‏ أما إنه لو قال حين أمسى أعوذ بكلمات الله التامات من شر ما خلق - ما ضره لدغ عقرب حتى يصبح ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Hurairah said:                      “A scorpion stung a man andhe didnot sleep all the night. It was said to the Prophet (ﷺ): ‘So-and-sowas stung by a scorpion and he did not sleep all the night.’ Hesaid: ‘If he had said, last night: A’udhubikalimatil-lahit-tammatimin sharri ma khalaq (I seek refuge in thePerfect Words of Allah fromthe evil of that which He has created),the scorpion sting would nothave harmed him, until morning.’”",
      "chain": [
        "38107",
        "20338",
        "20012",
        "11173",
        "11161",
        "13"
      ]
    }
  ],
  "total_hadiths": 2
}