{
  "id": "38120",
  "name": "Ayoub bin Muhammad al-Wazan أيوب بن محمد بن زياد الوزان",
  "full_name": "Ayoub bin Muhammad al-Wazan أيوب بن محمد بن زياد الوزان",
  "grade": "3rd Century AH",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "249",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Raqqa",
      " Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah]"
    ],
    "tags": [
      "Client",
      "al-Raqqi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "185",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن العلاء، وأيوب بن محمد الرقي، وعمرو بن عثمان الحمصي، - المعنى - قالوا حدثنا مروان بن معاوية، أخبرنا هلال بن ميمون الجهني، عن عطاء بن يزيد الليثي، - قال هلال لا أعلمه إلا عن أبي سعيد ‏.‏ وقال أيوب وعمرو أراه - عن أبي سعيد أن النبي صلى الله عليه وسلم مر بغلام وهو يسلخ شاة فقال له رسول الله صلى الله عليه وسلم ‏\"‏ تنح حتى أريك فأدخل يده بين الجلد واللحم فدحس بها حتى توارت إلى الإبط ثم مضى فصلى للناس ولم يتوضأ ‏.‏ قال أبو داود زاد عمرو في حديثه - يعني - لم يمس ماء ‏.‏ وقال عن هلال بن ميمون الرملي ورواه عبد الواحد بن زياد وأبو معاوية عن هلال عن عطاء عن النبي صلى الله عليه وسلم مرسلا لم يذكرا أبا سعيد ‏.‏",
      "text_en": " Narrated AbuSa'id al-Khudri:                     The Prophet (ﷺ) passed by a boy who was skinning a goat. The Messenger of Allah (ﷺ) said: Give it up until I show you. He (the Prophet) inserted his hand between the skin and the flesh until it reached the armpit. He then went away and led the people in prayer and he did not perform ablution. The version of Amr added that he did not touch water.Abu Dawud said: This tradition has been narrated though another chain of transmitters, making no mention of Abu Sa'id.",
      "chain": [
        "30216",
        "38120",
        "10581",
        "20201",
        "15594",
        "11206",
        "38"
      ]
    },
    {
      "hadith_no": "1559",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا أيوب بن محمد الرقي، حدثنا محمد بن عبيد، حدثنا إدريس بن يزيد الأودي، عن عمرو بن مرة الجملي، عن أبي البختري الطائي، عن أبي سعيد الخدري، يرفعه إلى النبي صلى الله عليه وسلم قال ‏\"‏ ليس فيما دون خمسة أوسق زكاة ‏\"‏ ‏.‏ والوسق ستون مختوما ‏.‏ قال أبو داود أبو البختري لم يسمع من أبي سعيد ‏.‏",
      "text_en": " Narrated AbuSa'id al-Khudri:                     The Prophet (ﷺ) said: There is no zakat payable (on grain or dates) on less than five camel-loads. The wasq (one camel-load) measures sixty sa' in weight.",
      "chain": [
        "38120",
        "30213",
        "20407",
        "11381",
        "11347"
      ]
    },
    {
      "hadith_no": "3410",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا أيوب بن محمد الرقي، حدثنا عمر بن أيوب، حدثنا جعفر بن برقان، عن ميمون بن مهران، عن مقسم، عن ابن عباس، قال افتتح رسول الله صلى الله عليه وسلم خيبر واشترط أن له الأرض وكل صفراء وبيضاء ‏.‏ قال أهل خيبر نحن أعلم بالأرض منكم فأعطناها على أن لكم نصف الثمرة ولنا نصف ‏.‏ فزعم أنه أعطاهم على ذلك فلما كان حين يصرم النخل بعث إليهم عبد الله بن رواحة فحزر عليهم النخل وهو الذي يسميه أهل المدينة الخرص فقال في ذه كذا وكذا قالوا أكثرت علينا يا ابن رواحة ‏.‏ فقال فأنا ألي حزر النخل وأعطيكم نصف الذي قلت ‏.‏ قالوا هذا الحق وبه تقوم السماء والأرض قد رضينا أن نأخذه بالذي قلت ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     The Messenger of Allah (ﷺ) conquered Khaibar, and stipulated that all the land, gold and silver would belong to him. The people of Khaibar said: we know the land more than you ; so give it to us on condition that you should have half of the produce and we would have the half. He then gave it to them on that condition. When the time of picking the fruits of the palm-trees came, he sent 'Abd Allah b. Rawahah to them, and he assessed the among of the fruits of the palm-trees. This is what the people of Medina call khars (assessment). He used to say: In these palm-trees there is such-and-such amount (of produce). They would say: You assessed more to us, Ibn Rawahah (than the real amount). He would say: I first take the responsibility of assessing the fruits of the palm-trees and give you half of (the amount) I said. They would say: This is true, and on this (equity) stand the heavens and the earth. We agreed that we should take (the amount which) you said.",
      "chain": [
        "38120",
        "20667",
        "20646",
        "11012",
        "11725",
        "17"
      ]
    },
    {
      "hadith_no": "4181",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Combing the Hair (Kitab Al-Tarajjul) - كتاب الترجل",
      "chapter_no": "35",
      "text_ar": "حدثنا أيوب بن محمد الرقي، حدثنا عمر بن أيوب، عن جعفر بن برقان، عن ثابت بن الحجاج، عن عبد الله الهمداني، عن الوليد بن عقبة، قال لما فتح نبي الله صلى الله عليه وسلم مكة جعل أهل مكة يأتونه بصبيانهم فيدعو لهم بالبركة ويمسح رءوسهم قال فجيء بي إليه وأنا مخلق فلم يمسني من أجل الخلوق ‏.‏",
      "text_en": " Narrated Al-Walid ibn Uqbah:                     When the Prophet of Allah (ﷺ) conquered Makkah. The people of Makkah began to bring their boys and he would invoke a blessing on them and rub their heads. I was brought, but as I had been perfumed with khaluq, he did not touch me because of the khaluq.",
      "chain": [
        "38120",
        "20667",
        "20646",
        "18099"
      ]
    },
    {
      "hadith_no": "32",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا أيوب بن محمد الوزان، قال حدثنا حجاج، قال قال ابن جريج أخبرتني حكيمة بنت أميمة، عن أمها، أميمة بنت رقيقة قالت كان للنبي صلى الله عليه وسلم قدح من عيدان يبول فيه ويضعه تحت السرير ‏.‏",
      "text_en": " It was narrated that Umaimah bint Ruqaiqah said:                      \"The Prophet (ﷺ) had a vessel made from a date tree in which he would urinate and place it under the bed.\"",
      "chain": [
        "38120",
        "20219",
        "11070",
        "19444",
        "2750"
      ]
    },
    {
      "hadith_no": "282",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا أيوب بن محمد الوزان، قال حدثنا عبد الله بن جعفر، قال حدثنا عبيد الله بن عمرو، عن الأعمش، عن المقدام بن شريح، عن أبيه، عن عائشة، - رضى الله عنها - قالت كان رسول الله صلى الله عليه وسلم يضع فاه على الموضع الذي أشرب منه فيشرب من فضل سؤري وأنا حائض ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                      \"The Messenger of Allah (ﷺ) used to put his mouth on the place where I had drunk from, and he would drink from what was leftover by me, while I was menstruating.\"",
      "chain": [
        "38120",
        "108",
        "30024",
        "11060",
        "10830",
        "10774",
        "53"
      ]
    },
    {
      "hadith_no": "378",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Menstruation and Istihadah - كتاب الحيض والاستحاضة",
      "chapter_no": "3",
      "text_ar": "أخبرني أيوب بن محمد الوزان، قال حدثنا عبد الله بن جعفر، قال حدثنا عبيد الله بن عمرو، عن الأعمش، عن المقدام بن شريح، عن أبيه، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يضع فاه على الموضع الذي أشرب منه ويشرب من فضل شرابي وأنا حائض ‏.‏",
      "text_en": " It was narrated from Al-Miqdam bin Shuraih, from his father, that 'Aishah said:                      \"The Messenger of Allah (ﷺ) would put his mouth on the place from which I had drunk, and he would drink from my leftovers when I was menstruating.\"",
      "chain": [
        "38120",
        "108",
        "30024",
        "11060",
        "10830",
        "10774",
        "53"
      ]
    },
    {
      "hadith_no": "1270",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا أيوب بن محمد الوزان، قال حدثنا حجاج، قال ابن جريج أخبرني زياد، عن محمد بن عجلان، عن عامر بن عبد الله بن الزبير، عن عبد الله بن الزبير، أن النبي صلى الله عليه وسلم كان يشير بأصبعه إذا دعا ولا يحركها ‏.‏ قال ابن جريج وزاد عمرو قال أخبرني عامر بن عبد الله بن الزبير عن أبيه أنه رأى النبي صلى الله عليه وسلم يدعو كذلك ويتحامل بيده اليسرى على رجله اليسرى ‏.‏",
      "text_en": " It was narrated from Abdullah bin Az-Zubair:                     That the Prophet (ﷺ) used to point with his finger when he supplicated, but he did not move it. Ibn Jurayj said: \"And 'Amr added: 'Amir bin 'Abdullah bin Az-Zubair told me that his father saw the Prophet (ﷺ) supplicating like that, putting his weight on his left arm, leaning on his left leg.'\"",
      "chain": [
        "38120",
        "20219",
        "11070",
        "11339",
        "10616",
        "11178",
        "106"
      ]
    },
    {
      "hadith_no": "1920",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرني أيوب بن محمد الوزان، قال حدثنا مروان، قال حدثنا عثمان بن حكيم، قال أخبرني خارجة بن زيد بن ثابت، عن عمه، يزيد بن ثابت أنهم كانوا جلوسا مع النبي صلى الله عليه وسلم فطلعت جنازة فقام رسول الله صلى الله عليه وسلم وقام من معه فلم يزالوا قياما حتى نفذت ‏.‏",
      "text_en": " It was narrated form Yazid bin Thabit:                     That they were sitting with the Messenger of Allah when a funeral appeared. The Messenger of Allah stood up, and those who were with him stood up, until it had passed by.",
      "chain": [
        "38120",
        "20201",
        "11889",
        "11006"
      ]
    },
    {
      "hadith_no": "2672",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرني أيوب بن محمد الوزان، قال حدثنا إسماعيل، عن أيوب، عن عمرو بن دينار، عن جابر بن زيد، عن ابن عباس، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من لم يجد إزارا فليلبس سراويل ومن لم يجد نعلين فليلبس خفين ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said;\"I heard the Messenger of Allah say:                      'Whoever cannot find an Izar, let him wear pants, and whoever cannot find sandals, let him wear khuffs.\"",
      "chain": [
        "38120",
        "30103",
        "11015",
        "11081",
        "11271",
        "17"
      ]
    },
    {
      "hadith_no": "4246",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of al-Fara' and al-'Atirah - كتاب الفرع والعتيرة",
      "chapter_no": "41",
      "text_ar": "أخبرنا أيوب بن محمد الوزان، قال حدثنا حجاج بن محمد، قال حدثنا شريك، عن الأعمش، عن إبراهيم، عن الأسود، عن عائشة، عن النبي صلى الله عليه وسلم قال ‏\"‏ ذكاة الميتة دباغها ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Aishah that the Prophet said:                     \"The dead animal is purified by tanning it.\"",
      "chain": [
        "38120",
        "20381",
        "20587",
        "11060",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "1749",
      "source": " Sunan Ibn Majah ",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا أيوب بن محمد الرقي، وداود بن رشيد، قالا حدثنا معمر بن سليمان، حدثنا عبد الله بن بشر، عن الأعمش، عن أبي صالح، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ أفطر الحاجم والمحجوم ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                     ‘The cupper and the one for whom cupping is done both breaktheirfast.”",
      "chain": [
        "38120",
        "30248",
        "28578",
        "25140",
        "11060",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "2366",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Rulings - كتاب الأحكام",
      "chapter_no": "13",
      "text_ar": "حدثنا أيوب بن محمد الرقي، حدثنا معمر بن سليمان، ح وحدثنا محمد بن يحيى، حدثنا يزيد بن هارون، قالا حدثنا حجاج بن أرطاة، عن عمرو بن شعيب، عن أبيه، عن جده، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تجوز شهادة خائن ولا خائنة ولا محدود في الإسلام ولا ذي غمر على أخيه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shuaib  from his father that his grandfather said:                     “The Testimony of a man or woman who is treacherous, or of one who has been subjected to one of the Haad punishments of Islam, or of one who bears a grudge against his brother, is not permissible.”",
      "chain": [
        "38120",
        "28578",
        "11222",
        "20472",
        "20580",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2696",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا علي بن ميمون الرقي، وأيوب بن محمد الوزان، وعبد الله بن سعيد، قالوا حدثنا معمر بن سليمان، أنبأنا الحجاج بن أرطاة، عن عبد الجبار بن وائل، عن أبيه، قال استكرهت امرأة على عهد رسول الله صلى الله عليه وسلم فدرأ عنها الحد وأقامه على الذي أصابها ‏.‏ ولم يذكر أنه جعل لها مهرا ‏.‏",
      "text_en": " It was narrated from 'Abdul Jabbar bin Wa'il that his father said:                     “A Woman was coerced (i.e., raped) during the time of Messenger of Allah (ﷺ) He waived the legal punishment for her and carried it out on the one who had attacked her, but he (the narrator) did not say that he rules that she should be given a bridal-money.”",
      "chain": [
        "38412",
        "38120",
        "11184",
        "28578",
        "20580",
        "10940"
      ]
    },
    {
      "hadith_no": "3660",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا أيوب بن محمد الرقي، حدثنا معمر بن سليمان، حدثنا عبد الله بن بشر، عن الأعمش، عن عمرو بن مرة، عن يحيى بن الجزار، عن ابن أخت، زينب امرأة عبد الله عن زينب، قالت كانت عجوز تدخل علينا ترقي من الحمرة وكان لنا سرير طويل القوائم وكان عبد الله إذا دخل تنحنح وصوت فدخل يوما فلما سمعت صوته احتجبت منه فجاء فجلس إلى جانبي فمسني فوجد مس خيط فقال ما هذا فقلت رقى لي فيه من الحمرة فجذبه وقطعه فرمى به وقال لقد أصبح آل عبد الله أغنياء عن الشرك سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ إن الرقى والتمائم والتولة شرك ‏\"‏ ‏.‏ قلت فإني خرجت يوما فأبصرني فلان فدمعت عيني التي تليه فإذا رقيتها سكنت دمعتها وإذا تركتها دمعت ‏.‏ قال ذاك الشيطان إذا أطعتيه تركك وإذا عصيتيه طعن بإصبعه في عينك ولكن لو فعلت كما فعل رسول الله  صلى الله عليه وسلم  كان خيرا لك وأجدر أن تشفين تنضحين في عينك الماء وتقولين ‏\"‏ أذهب الباس رب الناس اشف أنت الشافي لا شفاء إلا شفاؤك شفاء لا يغادر سقما ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Imran bin Husain that the Prophet (ﷺ) saw amanwith a brass ring on his hand. He said:                      “What is this ring?” Hesaid: “It is for Wahinah.”* He said: “Take it off, for it willonlyincrease you in weakness.”",
      "chain": [
        "38120",
        "28578",
        "25140",
        "11060",
        "11381",
        "10839",
        "57"
      ]
    }
  ],
  "total_hadiths": 15
}