{
  "id": "38136",
  "name": "Hajb bin Sulaiman حاجب بن سليمان",
  "full_name": "Hajb bin Sulaiman حاجب بن سليمان",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Sadooq/Delusion",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "265",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq/Delusion] [ س  -  صدوق له أوهام ]"
    ],
    "tags": [
      "Client"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20660",
      "name": "'Abdul Majeed bin 'Abdul 'Aziz عبد المجيد بن عبد العزيز بن أبي رواد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20172",
      "name": "Muhammad bin Abi Fadayk محمد بن إسماعيل بن مسلم بن أبي فديك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20032",
      "name": "Waki' bin al-Jarrah وكيع بن الجراح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30006",
      "name": "Imam Nasa'i أحمد بن شعيب بن علي بن سنان النسائي",
      "grade": "3rd Century AH [12th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "641",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Adhan (The Call to Prayer) - كتاب الأذان",
      "chapter_no": "7",
      "text_ar": "أخبرنا حاجب بن سليمان، عن وكيع، عن سفيان، عن خالد الحذاء، عن أبي قلابة، عن مالك بن الحويرث، قال أتيت النبي صلى الله عليه وسلم أنا وابن عم لي وقال مرة أخرى أنا وصاحب لي فقال ‏\"‏ إذا سافرتما فأذنا وأقيما وليؤمكما أكبركما ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Malik bin Al-Huwairith said:                      \"I came to the Prophet (ﷺ) with a cousin of mine\" - on an another occasion he said: \"with a companion of mine\" - \"and he said: 'When the two of you travel, call the Adhan and the Iqamah, and let the older of you lead the prayer.'\"",
      "chain": [
        "38136",
        "20032",
        "20012",
        "11282",
        "11047",
        "5265"
      ]
    },
    {
      "hadith_no": "781",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا حاجب بن سليمان المنبجي، عن وكيع، عن سفيان، عن خالد الحذاء، عن أبي قلابة، عن مالك بن الحويرث، قال أتيت رسول الله صلى الله عليه وسلم أنا وابن عم لي - وقال مرة أنا وصاحب لي - فقال ‏\"‏ إذا سافرتما فأذنا وأقيما وليؤمكما أكبركما ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Milik bin Al-Huwairith said:                      \"I came to the Messenger of Allih (ﷺ) with a cousin of mine\" - once he said, \"with a  friend of mine\"-and he said: 'When you travel, call the Adhan and Iqamah, and let the older of you lead the prayer.\"'",
      "chain": [
        "38136",
        "20032",
        "20012",
        "11282",
        "11047",
        "5265"
      ]
    },
    {
      "hadith_no": "2373",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرني حاجب بن سليمان، قال حدثنا الحارث بن عطية، قال حدثنا الأوزاعي، عن عطاء بن أبي رباح، عن عبد الله بن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من صام الأبد فلا صام ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin 'Umar said:                     \"The Messenger of Allah said: 'Whoever fasts every day of his life, then he has not fasted.\"'",
      "chain": [
        "38136",
        "24059",
        "20024",
        "11029",
        "18"
      ]
    },
    {
      "hadith_no": "2909",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا حاجب بن سليمان المنبجي، عن ابن أبي رواد، قال حدثنا ابن جريج، عن عطاء، عن أسامة بن زيد، قال دخل رسول الله صلى الله عليه وسلم الكعبة فسبح في نواحيها وكبر ولم يصل ثم خرج فصلى خلف المقام ركعتين ثم قال ‏\"‏ هذه القبلة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Usmah bin Zaid said:                     \"The Messenger of Allah entered the Kabah and recited the Tasbih and the Takbir in its corners, but he did not pray. Then he came out and prayed two Rakahs behind the Maqam, then he said: 'This is Qiblah.'\"",
      "chain": [
        "38136",
        "11070",
        "11029",
        "50"
      ]
    },
    {
      "hadith_no": "3244",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرني حاجب بن سليمان، قال حدثنا حجاج، قال حدثنا ابن أبي ذئب، عن الزهري، ويزيد بن عبد الله بن قسيط، عن أبي سلمة بن عبد الرحمن، وعن الحارث بن عبد الرحمن، عن محمد بن عبد الرحمن بن ثوبان، أنهما سألا فاطمة بنت قيس عن أمرها، فقالت طلقني زوجي ثلاثا فكان يرزقني طعاما فيه شىء فقلت والله لئن كانت لي النفقة والسكنى لأطلبنها ولا أقبل هذا ‏.‏ فقال الوكيل ليس لك سكنى ولا نفقة ‏.‏ قالت فأتيت النبي صلى الله عليه وسلم فذكرت ذلك له فقال ‏\"‏ ليس لك سكنى ولا نفقة فاعتدي عند فلانة ‏\"‏ ‏.‏ قالت وكان يأتيها أصحابه ثم قال ‏\"‏ اعتدي عند ابن أم مكتوم فإنه أعمى فإذا حللت فآذنيني ‏\"‏ ‏.‏ قالت فلما حللت آذنته فقال رسول الله صلى الله عليه وسلم ‏\"‏ ومن خطبك ‏\"‏ ‏.‏ فقلت معاوية ورجل آخر من قريش ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ أما معاوية فإنه غلام من غلمان قريش لا شىء له وأما الآخر فإنه صاحب شر لا خير فيه ولكن انكحي أسامة بن زيد ‏\"‏ ‏.‏ قالت فكرهته ‏.‏ فقال لها ذلك ثلاث مرات فنكحته ‏.‏",
      "text_en": " It was narrated from Muhammad bin 'Abdur-Rahman bin Thawban that they asked Fatimah bint Qais about her story and she said:                      \"My husband divorced me three times, and he used to provide me with food that was not good.\" She said: \"By Allah, if I were entitled to maintenance and accommodation I would demand them and I would not accept this.\" The deputy said: \"You are not entitled to accommodation or maintenance.\" She said: \"I came to the Prophet and told him about that, and he said: 'You are not entitled to accommodation nor maintenance; observe your 'Iddah in the house of so-and-so.' She said: 'His Companions used to go to her.' Then he said: 'Observe your 'Iddah in the house of Ibn Umm Maktum, who is blind, and when your 'Iddah is over, let me know.'\"  She said: \"When my 'Iddah was over, I let him know. The Messenger of Allah said: 'Who has proposed marriage to you?' I said: 'Mu'awiyah and another man from the Quraish.' He said: 'As for Mu'awiyah, he is a boy among the Quraish and does not have anything, and as for the other he is a bad man with no goodness in him. Rather you should marry Usamah bin Zaid.'\" She said: \"I did not like the idea.\" But he said that to her three times so she married him.",
      "chain": [
        "38136",
        "20219",
        "20177",
        "11013",
        "11236",
        "10567",
        "19903"
      ]
    },
    {
      "hadith_no": "4003",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا حاجب بن سليمان المنبجي، قال حدثنا ابن أبي رواد، قال حدثنا ابن جريج، عن عبد الأعلى الثعلبي، عن سعيد بن جبير، عن ابن عباس، أن قوما، كانوا قتلوا فأكثروا وزنوا فأكثروا وانتهكوا فأتوا النبي صلى الله عليه وسلم قالوا يا محمد إن الذي تقول وتدعو إليه لحسن لو تخبرنا أن لما عملنا كفارة ‏.‏ فأنزل الله عز وجل ‏{‏ والذين لا يدعون مع الله إلها آخر ‏}‏ إلى ‏{‏ فأولئك يبدل الله سيئاتهم حسنات ‏}‏ قال يبدل الله شركهم إيمانا وزناهم إحصانا ونزلت ‏{‏ قل يا عبادي الذين أسرفوا على أنفسهم ‏}‏ الآية ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that :                     Some people used to kill, and they did a great deal of it, and they used to commit adultery and they did a great deal of it, and they committed violations. They came to the Prophet [SAW] and said: \"O Muhammad, what you say and call people to is good, if only you could tell us that there is any expiation for what we have done.\" Then Allah, the Mighty and Sublime, revealed: \"And those who invoke not any other ilah (god) along with Allah up to for those, Allah will change their sins into good deeds,\" he said: \"So Allah will change their Shirk into faith, and their adultery into chastity. And the Verse: \"Say: O 'Ibadi (My slaves) who have transgressed against themselves (by committing evil deeds and sins)\" was revealed.",
      "chain": [
        "38136",
        "11070",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "5233",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا حاجب بن سليمان، عن وكيع، عن سفيان، عن أبي إسحاق، عن البراء، قال ما رأيت من ذي لمة أحسن في حلة من رسول الله صلى الله عليه وسلم وله شعر يضرب منكبيه ‏.‏",
      "text_en": " It was narrated that Al-Bara' said:                     \"I never saw any long haired man in a Hullah who was more handsome than the Messenger of Allah [SAW], and he had hair that came down to his shoulders.\"",
      "chain": [
        "38136",
        "20032",
        "20012",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "5317",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرني حاجب بن سليمان، عن ابن أبي رواد، قال حدثنا ابن جريج، عن ابن طاوس، عن أبيه، عن عبد الله بن عمرو، أنه أتى النبي صلى الله عليه وسلم وعليه ثوبان معصفران فغضب النبي صلى الله عليه وسلم وقال ‏\"‏ اذهب فاطرحهما عنك ‏\"‏ ‏.‏ قال أين يا رسول الله قال ‏\"‏ في النار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin 'Amr that:                     He came to the Prophet [SAW] wearing two garments dyed with safflower. The Prophet [SAW] got angry and said: \"Go and take them off.\" He said: \"Where should I throw them, O Messenger of Allah?\" He said: \"In the fire.\"",
      "chain": [
        "38136",
        "11070",
        "11433",
        "11053",
        "29"
      ]
    }
  ],
  "total_hadiths": 8
}