{
  "id": "38132",
  "name": "Ja'far bin Msafr bin Rashid جعفر بن مسافر بن راشد",
  "full_name": "Ja'far bin Msafr bin Rashid جعفر بن مسافر بن راشد",
  "grade": "3rd Century AH [11th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "254",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ د  س  ق  -  صدوق ]"
    ],
    "tags": [
      "al-Hadhli"
    ],
    "area_of_interest_display": [
      {
        "en": "Narrator[Grade:Sadooq] [ د  س  ق  -  صدوق ]",
        "ar": "Narrator[Grade:Sadooq] [ د  س  ق  -  صدوق ]",
        "ckb": "Narrator[Grade:Sadooq] [ د  س  ق  -  صدوق ]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "NA",
        "ar": "NA",
        "ckb": "NA"
      }
    ],
    "tags_display": [
      {
        "en": "al-Hadhli",
        "ar": "al-Hadhli",
        "ckb": "al-Hadhli"
      }
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20413",
      "name": "Bashr bin Bakr al-Tunisi بشر بن بكر التنيسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [9th Generation]",
        "ar": "تابع التابعين [الجيل التاسع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی نۆیەم]"
      }
    },
    {
      "id": "23033",
      "name": "'Abdullah bin Yazid al-'Advi عبد الله بن يزيد العدوي المقري القصير",
      "grade": "Succ. (Taba' Tabi') [9th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [9th Generation]",
        "ar": "تابع التابعين [الجيل التاسع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی نۆیەم]"
      }
    },
    {
      "id": "20633",
      "name": "Kathir bin Hisham al-Klaby كثير بن هشام الكلابي أبو سهل الرقي",
      "grade": "Succ. (Taba' Tabi') [9th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [9th Generation]",
        "ar": "تابع التابعين [الجيل التاسع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی نۆیەم]"
      }
    },
    {
      "id": "20172",
      "name": "Muhammad bin Abi Fadayk محمد بن إسماعيل بن مسلم بن أبي فديك",
      "grade": "Succ. (Taba' Tabi') [8th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [8th Generation]",
        "ar": "تابع التابعين [الجيل الثامن]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی هەشتەم]"
      }
    },
    {
      "id": "20300",
      "name": "Yahya bin Hsan يحيى بن حسان",
      "grade": "Succ. (Taba' Tabi') [9th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [9th Generation]",
        "ar": "تابع التابعين [الجيل التاسع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی نۆیەم]"
      }
    },
    {
      "id": "30103",
      "name": "Isma'il bin 'Abdullah bin 'Abdullah إسماعيل بن عبد الله بن عبد الله بن أويس",
      "grade": "3rd Century AH [10th generation]",
      "grade_display": {
        "en": "3rd Century AH [10th Generation]",
        "ar": "القرن الثالث الهجري [الجيل العاشر]",
        "ckb": "سەدەی سێیەمی كۆچی [نەوەی دەیەم]"
      }
    }
  ],
  "students": [
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]",
      "grade_display": {
        "en": "3rd Century AH [11th Generation]",
        "ar": "القرن الثالث الهجري [الجيل الحادي عشر]",
        "ckb": "سەدەی سێیەمی كۆچی [نەوەی یازدەیەم]"
      }
    },
    {
      "id": "30006",
      "name": "Imam Nasa'i أحمد بن شعيب بن علي بن سنان النسائي",
      "grade": "3rd Century AH [12th generation]",
      "grade_display": {
        "en": "3rd Century AH [12th Generation]",
        "ar": "القرن الثالث الهجري [الجيل الثاني عشر]",
        "ckb": "سەدەی سێیەمی كۆچی [نەوەی دوازدەیەم]"
      }
    },
    {
      "id": "30004",
      "name": "Ibn Maja ابن ماجة",
      "grade": "3rd Century AH [12th generation]",
      "grade_display": {
        "en": "3rd Century AH [12th Generation]",
        "ar": "القرن الثالث الهجري [الجيل الثاني عشر]",
        "ckb": "سەدەی سێیەمی كۆچی [نەوەی دوازدەیەم]"
      }
    },
    {
      "id": "31170",
      "name": "Muhammad bin Sulaiman al-Baghandi محمد بن سليمان بن الحارث الباغندي",
      "grade": "3rd Century AH",
      "grade_display": {
        "en": "3rd Century AH",
        "ar": "القرن الثالث الهجري",
        "ckb": "سەدەی سێیەمی كۆچی"
      }
    }
  ],
  "hadiths": [
    {
      "id": "sunan-abi-daud-331",
      "hadith_no": "331",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا جعفر بن مسافر، حدثنا عبد الله بن يحيى البرلسي، حدثنا حيوة بن شريح، عن ابن الهاد، أن نافعا، حدثه عن ابن عمر، قال أقبل رسول الله صلى الله عليه وسلم من الغائط فلقيه رجل عند بئر جمل فسلم عليه فلم يرد عليه رسول الله صلى الله عليه وسلم حتى أقبل على الحائط فوضع يده على الحائط ثم مسح وجهه ويديه ثم رد رسول الله صلى الله عليه وسلم على الرجل السلام ‏.‏",
      "text_en": " Ibn 'Umar said:                      The Messenger of Allah (ﷺ) came from the privy. A man met him near Bir Jamal and saluted him. The Messenger of Allah (ﷺ) did not return the salutation until he came to a wall and placed his hands on the wall and wiped his face and hands; he then returned the man's salutation.",
      "usc_msa_ref": "",
      "chain": [
        "38132",
        "30354",
        "26010",
        "11234",
        "11014",
        "18"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-681",
      "hadith_no": "681",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا جعفر بن مسافر، حدثنا ابن أبي فديك، عن يحيى بن بشير بن خلاد، عن أمه، أنها دخلت على محمد بن كعب القرظي فسمعته يقول حدثني أبو هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ وسطوا الإمام وسدوا الخلل ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: Have the imam in the centre and close up the gaps.",
      "usc_msa_ref": "",
      "chain": [
        "38132",
        "20172",
        "13"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-1361",
      "hadith_no": "1361",
      "source": "Sunan Abi Da'ud",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا نصر بن علي، وجعفر بن مسافر، أن عبد الله بن يزيد المقرئ، أخبرهما عن سعيد بن أبي أيوب، عن جعفر بن ربيعة، عن عراك بن مالك، عن أبي سلمة، عن عائشة، ‏:‏ أن رسول الله صلى الله عليه وسلم صلى العشاء، ثم صلى ثماني ركعات قائما، وركعتين بين الأذانين ولم يكن يدعهما ‏.‏ قال جعفر بن مسافر في حديثه ‏:‏ وركعتين جالسا بين الأذانين، زاد ‏:‏ جالسا ‏.‏",
      "text_en": " Narrated 'Aishah:                     The Messenger of Allah (ﷺ) offered the night prayer and then prayed eight rak'ahs standing, and two rak'ahs between the two adhans (i.e. the adhan for the dawn prayer and the iqamah). He never left them.Jaf'ar b. Musafir said in his version: (He prayed) the two rak'ahs sitting between the two adhans. He added the word \"sitting\".",
      "usc_msa_ref": "",
      "chain": [
        "30395",
        "38132",
        "20375",
        "11407",
        "11204",
        "10567"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-1659",
      "hadith_no": "1659",
      "source": "Sunan Abi Da'ud",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا جعفر بن مسافر، حدثنا ابن أبي فديك، عن هشام بن سعد، عن زيد بن أسلم، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم نحوه ‏.‏ قال في قصة الإبل بعد قوله ‏\"‏ لا يؤدي حقها ‏\"‏ ‏.‏ قال ‏\"‏ ومن حقها حلبها يوم وردها ‏\"‏ ‏.‏",
      "text_en": " The above mentioned tradition has also been transmitted by Abu Hurairah through a different chain of narrators in a similar manner from the Prophet (SAWS). This version adds after the words “does not pay what is due on them” in the description of the camels the words “ One thing which is due being to milk them when they come down to drink water.”",
      "usc_msa_ref": "",
      "chain": [
        "38132",
        "20172",
        "20519",
        "11163",
        "11161",
        "13"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-1716",
      "hadith_no": "1716",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Book of Lost and Found Items - كتاب اللقطة",
      "chapter_no": "10",
      "text_ar": "حدثنا جعفر بن مسافر التنيسي، حدثنا ابن أبي فديك، حدثنا موسى بن يعقوب الزمعي، عن أبي حازم، عن سهل بن سعد، أخبره أن علي بن أبي طالب دخل على فاطمة وحسن وحسين يبكيان فقال ما يبكيهما قالت الجوع فخرج علي فوجد دينارا بالسوق فجاء إلى فاطمة فأخبرها فقالت اذهب إلى فلان اليهودي فخذ دقيقا فجاء اليهودي فاشترى به دقيقا فقال اليهودي أنت ختن هذا الذي يزعم أنه رسول الله قال نعم ‏.‏ قال فخذ دينارك ولك الدقيق ‏.‏ فخرج علي حتى جاء فاطمة فأخبرها فقالت اذهب إلى فلان الجزار فخذ لنا بدرهم لحما فذهب فرهن الدينار بدرهم لحم فجاء به فعجنت ونصبت وخبزت وأرسلت إلى أبيها فجاءهم فقالت يا رسول الله أذكر لك فإن رأيته لنا حلالا أكلناه وأكلت معنا من شأنه كذا وكذا ‏.‏ فقال ‏\"‏ كلوا باسم الله ‏\"‏ ‏.‏ فأكلوا فبينما هم مكانهم إذا غلام ينشد الله والإسلام الدينار فأمر رسول الله صلى الله عليه وسلم فدعي له فسأله ‏.‏ فقال سقط مني في السوق ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ يا علي اذهب إلى الجزار فقل له إن رسول الله صلى الله عليه وسلم يقول لك أرسل إلى بالدينار ودرهمك على ‏\"‏ ‏.‏ فأرسل به فدفعه رسول الله صلى الله عليه وسلم إليه ‏.‏",
      "text_en": " Sahl bin Sa’d said :                      `Ali bin Abi Talib entered upon Fatimah while Hasan and Husain were crying. He asked: Why are they crying?  She replied: Due to hunger.  ‘Ali went out and found a dinar in the market.  He then came to Fatima and told her about it.  She said:  Go to such and such a Jew and get some flour for us.  He came to the Jew and purchased flour with it.  He said : Are you the son-in-law of him who believes that he is the Messenger of Allah.  He said : Yes.  The Jew said : Have your dinar with you and you will get the flour.  Ali then went out and came to Fatima.  He told her about the matter.  She then said: Go to such and such a butcher and get some meat for us for a dirham.  Ali went out and pawned the dinar for a dirham with him and got the meat, and brought it (to her).  She then kneaded the flour, put the utensil on fire and baked the bread.  She sent for her father : (i.e. the Prophet (SWAS).  He came to them.  She said to him : Messenger of Allah, I tell you all the matter.  If you think it is lawful for us, we shall eat it and you will eat with us.  She said: The matter is such and such.  He said: eat in the name of Allah.  So they ate it.  While they were (eating) at their place, a boy cried adguring in the name of Allah and Islam: He was searching the dinar.  The Messenger of Allah (SWAS) commanded and he was called in.  He asked him.  The boy replied, I lost it somewhere in the market.  The Prophet (SWAS) said : `Ali, go to the butcher and tell him that the Messenger of Allah (SWAS) has asked you : send the dinar to me and one dirham of yours will be due on me.  The butcher returned it and the Messenger of Allah (SWAS) handed it to him (the boy).",
      "usc_msa_ref": "",
      "chain": [
        "38132",
        "20172",
        "20706",
        "11172",
        "399"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-2393",
      "hadith_no": "2393",
      "source": "Sunan Abi Da'ud",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا جعفر بن مسافر، حدثنا ابن أبي فديك، حدثنا هشام بن سعد، عن ابن شهاب، عن أبي سلمة بن عبد الرحمن، عن أبي هريرة، قال جاء رجل إلى النبي صلى الله عليه وسلم أفطر في رمضان بهذا الحديث ‏.‏ قال فأتي بعرق فيه تمر قدر خمسة عشر صاعا وقال فيه ‏\"‏ كله أنت وأهل بيتك وصم يوما واستغفر الله ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah said:                      A man came to the Prophet (ﷺ). He broke his fast during Ramadan. He then narrated the rest of this tradition adding: Then a huge basket containing fifteen sa's of dates was brought to him. He said: Eat it yourself and your family and keep one fast and beg pardon of Allah.",
      "usc_msa_ref": "",
      "chain": [
        "38132",
        "20172",
        "20519",
        "11013",
        "10567",
        "13"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-2412",
      "hadith_no": "2412",
      "source": "Sunan Abi Da'ud",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا عبيد الله بن عمر، حدثني عبد الله بن يزيد، ح وحدثنا جعفر بن مسافر، حدثنا عبد الله بن يحيى، - المعنى - حدثني سعيد بن أبي أيوب، وزاد، جعفر والليث حدثني يزيد بن أبي حبيب، أن كليب بن ذهل الحضرمي، أخبره عن عبيد، - قال جعفر ابن جبر - قال كنت مع أبي بصرة الغفاري صاحب النبي صلى الله عليه وسلم في سفينة من الفسطاط في رمضان فرفع ثم قرب غداه - قال جعفر في حديثه - فلم يجاوز البيوت حتى دعا بالسفرة قال اقترب ‏.‏ قلت ألست ترى البيوت قال أبو بصرة أترغب عن سنة رسول الله صلى الله عليه وسلم قال جعفر في حديثه فأكل ‏.‏",
      "text_en": " Narrated AbuBusrah al-Ghifari,:                     Ja'far ibn Jubayr said: I accompanied AbuBusrah al-Ghifari, a Companion of the Messenger of Allah (ﷺ), in a boat proceeding from al-Fustat (Cairo) during Ramadan. He was lifted (to the boat), then his meal was brought to him. The narrator Ja'far said in his version: He did not go beyond the houses (of the city) but he called for the dining sheet. He said (to me): Come near. I said: Do you not see the houses? AbuBusrah said: Do you detest the sunnah (practice) of the Messenger of Allah (ﷺ)? The narrator Ja'far said in his version: He then ate (it).",
      "usc_msa_ref": "",
      "chain": [
        "11201",
        "1945",
        "38132",
        "20375",
        "11411",
        "16090"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-2783",
      "hadith_no": "2783",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا جعفر بن مسافر التنيسي، حدثنا ابن أبي فديك، حدثنا الزمعي، عن الزبير بن عثمان بن عبد الله بن سراقة، أن محمد بن عبد الرحمن بن ثوبان، أخبره أن أبا سعيد الخدري أخبره أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إياكم والقسامة ‏\"‏ ‏.‏ قال فقلنا وما القسامة قال ‏\"‏ الشىء يكون بين الناس فيجيء فينتقص منه ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuSa'id al-Khudri:                     The Messenger of Allah (ﷺ) said: Beware of the wages of a distributor of booty (qusamah). We asked: What is qusamah (wages of a distributor)? He said: It means a thing which is shared by the people, and then it is reduced.",
      "usc_msa_ref": "",
      "chain": [
        "38132",
        "20172",
        "11218",
        "38"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-3087",
      "hadith_no": "3087",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا جعفر بن مسافر، حدثنا ابن أبي فديك، حدثنا الزمعي، عن عمته، قريبة بنت عبد الله بن وهب عن أمها، كريمة بنت المقداد عن ضباعة بنت الزبير بن عبد المطلب بن هاشم، أنها أخبرتها قالت، ذهب المقداد لحاجته ببقيع الخبخبة فإذا جرذ يخرج من جحر دينارا ثم لم يزل يخرج دينارا دينارا حتى أخرج سبعة عشر دينارا ثم أخرج خرقة حمراء - يعني فيها دينار - فكانت ثمانية عشر دينارا فذهب بها إلى النبي صلى الله عليه وسلم فأخبره وقال له خذ صدقتها ‏.‏ فقال له صلى الله عليه وسلم ‏\"‏ هل هويت إلى الجحر ‏\"‏ ‏.‏ قال لا ‏.‏ فقال له رسول الله صلى الله عليه وسلم ‏\"‏ بارك الله لك فيها ‏\"‏ ‏.‏",
      "text_en": " Narrated Duba'ah daughter of az-Zubayr ibn AbdulMuttalib:                     Al-Miqdad went to Baqi' al-Khabkhabah for a certain need. He found a mouse taking out a dinar from a hole. It then continued to take out dinars one by one until it took out seventeen dinars. It then took out a red purse containing a dinar. There were thus eighteen dinars. He took them to the Prophet (ﷺ), informed him and said to him: Take its sadaqah. The Prophet (ﷺ) asked him: Did you extend your hand toward the hole? He replied: No. The Messenger of Allah (ﷺ) then said: May Allah bless you in it.",
      "usc_msa_ref": "",
      "chain": [
        "38132",
        "20172"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-3322",
      "hadith_no": "3322",
      "source": "Sunan Abi Da'ud",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا جعفر بن مسافر التنيسي، عن ابن أبي فديك، قال حدثني طلحة بن يحيى الأنصاري، عن عبد الله بن سعيد بن أبي هند، عن بكير بن عبد الله بن الأشج، عن كريب، عن ابن عباس، أن رسول الله صلى الله عليه وسلم قال ‏:‏ ‏\"‏ من نذر نذرا لم يسمه فكفارته كفارة يمين، ومن نذر نذرا في معصية فكفارته كفارة يمين، ومن نذر نذرا لا يطيقه فكفارته كفارة يمين، ومن نذر نذرا أطاقه فليف به ‏\"‏ ‏.‏ قال أبو داود ‏:‏ روى هذا الحديث وكيع وغيره عن عبد الله بن سعيد بن أبي الهند أوقفوه على ابن عباس ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Prophet (ﷺ) said: If anyone takes a vow but does not name it, its atonement is the same as that for an oath, if anyone takes a vow to do an act of disobedience, its atonement is the same as that for an oath, if anyone takes a vow he is unable to fulfill, its atonement is the same as that for an oath, but if anyone takes a vow he is able to fulfill, he must do so.Abu Dawud said: This tradition has been transmitted by Waki' and others on the authority of 'Abd Allah b. Sa'id b. Abi al-Hind, but they traced it no farther back than Ibn 'Abbas.",
      "usc_msa_ref": "",
      "chain": [
        "38132",
        "20172",
        "11863",
        "11184",
        "11154",
        "11211",
        "17"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-3462",
      "hadith_no": "3462",
      "source": "Sunan Abi Da'ud",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا سليمان بن داود المهري، أخبرنا ابن وهب، أخبرني حيوة بن شريح، ح وحدثنا جعفر بن مسافر التنيسي، حدثنا عبد الله بن يحيى البرلسي، حدثنا حيوة بن شريح، عن إسحاق أبي عبد الرحمن، - قال سليمان عن أبي عبد الرحمن الخراساني، - أن عطاء الخراساني، حدثه أن نافعا حدثه عن ابن عمر، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إذا تبايعتم بالعينة وأخذتم أذناب البقر ورضيتم بالزرع وتركتم الجهاد سلط الله عليكم ذلا لا ينزعه حتى ترجعوا إلى دينكم ‏\"‏ ‏.‏ قال أبو داود الإخبار لجعفر وهذا لفظه ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     I heard the Messenger of Allah, (ﷺ) say: When you enter into the inah transaction, hold the tails of oxen, are pleased with agriculture, and give up conducting jihad (struggle in the way of Allah). Allah will make disgrace prevail over you, and will not withdraw it until you return to your original religion.",
      "usc_msa_ref": "",
      "chain": [
        "30584",
        "20029",
        "26010",
        "38132",
        "30354",
        "26010",
        "11005",
        "11359",
        "10947",
        "11014",
        "18"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-3956",
      "hadith_no": "3956",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Book of Manumission of Slaves - كتاب العتق",
      "chapter_no": "31",
      "text_ar": "حدثنا جعفر بن مسافر، حدثنا بشر بن بكر، أخبرنا الأوزاعي، حدثني عطاء بن أبي رباح، حدثني جابر بن عبد الله، بهذا زاد وقال - يعني النبي صلى الله عليه وسلم - ‏\"‏ أنت أحق بثمنه والله أغنى عنه ‏\"‏ ‏.‏",
      "text_en": " The tradition mentioned above also has been transmitted by Jabir b. 'Abd Allah through a different chain of narrators. This version added:                      The Prophet (ﷺ) said: You are more entitled to his price, and Allah has no need of it.",
      "usc_msa_ref": "",
      "chain": [
        "38132",
        "20413",
        "20024",
        "11029",
        "34"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-4007",
      "hadith_no": "4007",
      "source": "Sunan Abi Da'ud",
      "chapter": "Dialects and Readings of the Qur'an (Kitab Al-Huruf Wa Al-Qira'at) - كتاب الحروف والقراءات",
      "chapter_no": "32",
      "text_ar": "حدثنا جعفر بن مسافر، حدثنا ابن أبي فديك، عن هشام بن سعد، بإسناده مثله ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Hisham b. Sa'd with a different chain of narrators in a similar way.",
      "usc_msa_ref": "",
      "chain": [
        "38132",
        "20172"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-4305",
      "hadith_no": "4305",
      "source": "Sunan Abi Da'ud",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا جعفر بن مسافر التنيسي، حدثنا خلاد بن يحيى، حدثنا بشير بن المهاجر، حدثنا عبد الله بن بريدة، عن أبيه، عن النبي صلى الله عليه وسلم في حديث ‏\"‏ يقاتلكم قوم صغار الأعين ‏\"‏ ‏.‏ يعني الترك قال ‏\"‏ تسوقونهم ثلاث مرار حتى تلحقوهم بجزيرة العرب فأما في السياقة الأولى فينجو من هرب منهم وأما في الثانية فينجو بعض ويهلك بعض وأما في الثالثة فيصطلمون ‏\"‏ ‏.‏ أو كما قال ‏.‏",
      "text_en": " Buraidah said:                      In the tradition telling that people with small eyes, i.e. the Turks, will fight against you, the prophet (ﷺ) said: You will drive them off three times till you catch up with them in Arabia. On the first occasion when you drive them off those who fly will be safe, on the second occasion some will be safe and some will perish, but on the third occasion they will be extirpated, or he said words to that effect.",
      "usc_msa_ref": "",
      "chain": [
        "38132",
        "20191",
        "10747",
        "11432",
        "3131"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-4375",
      "hadith_no": "4375",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا جعفر بن مسافر، ومحمد بن سليمان الأنباري، قالا أخبرنا ابن أبي فديك، عن عبد الملك بن زيد، - نسبه جعفر إلى سعيد بن زيد بن عمرو بن نفيل - عن محمد بن أبي بكر، عن عمرة، عن عائشة، رضى الله عنها قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ أقيلوا ذوي الهيئات عثراتهم إلا الحدود ‏\"‏ ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     The Messenger of Allah (ﷺ) Said: Forgive the people of good qualities their slips, but not faults to which prescribed penalties apply.",
      "usc_msa_ref": "",
      "chain": [
        "38132",
        "31160",
        "20172",
        "11214",
        "11455",
        "53"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-4594",
      "hadith_no": "4594",
      "source": "Sunan Abi Da'ud",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا محمد بن المتوكل العسقلاني، حدثنا عبد الرزاق، ح وحدثنا جعفر بن مسافر التنيسي، حدثنا زيد بن المبارك، حدثنا عبد الملك الصنعاني، كلاهما عن معمر، عن همام بن منبه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ النار جبار ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: No recompense may be demanded if the fire spreads.",
      "usc_msa_ref": "",
      "chain": [
        "38581",
        "20121",
        "38132",
        "38224",
        "20115",
        "11447",
        "13"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-4700",
      "hadith_no": "4700",
      "source": "Sunan Abi Da'ud",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا جعفر بن مسافر الهذلي، حدثنا يحيى بن حسان، حدثنا الوليد بن رباح، عن إبراهيم بن أبي عبلة، عن أبي حفصة، قال قال عبادة بن الصامت لابنه يا بنى إنك لن تجد طعم حقيقة الإيمان حتى تعلم أن ما أصابك لم يكن ليخطئك وما أخطأك لم يكن ليصيبك سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن أول ما خلق الله القلم فقال له اكتب ‏.‏ قال رب وماذا أكتب قال اكتب مقادير كل شىء حتى تقوم الساعة ‏\"‏ ‏.‏ يا بنى إني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من مات على غير هذا فليس مني ‏\"‏ ‏.‏",
      "text_en": " Ubadah b. al Samit said to his son :                      Sonny! You will not get the taste of the reality of faith until you know that what has come to you could not miss you, and that what has missed you could not come to you. I heard the Messenger of Allah (May peace be upon him) say : The first thing Allah created was pen. He said to it : Write. It asked : What should I write, my lord? He said : Write what was decreed about everything till the Last hour comes. Sonny! I heard the Messenger of Allah (May peace be upon him) say : He who dies on something other than this does not does not belong to me.",
      "usc_msa_ref": "",
      "chain": [
        "38132",
        "20300",
        "11667",
        "40"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-4877",
      "hadith_no": "4877",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا جعفر بن مسافر، حدثنا عمرو بن أبي سلمة، قال حدثنا زهير، عن العلاء بن عبد الرحمن، عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن من أكبر الكبائر استطالة المرء في عرض رجل مسلم بغير حق ومن الكبائر السبتان بالسبة ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: The gravest sin is going to lengths in talking unjustly against a Muslim's honour, and it is a major sin to abuse twice for abusing once.",
      "usc_msa_ref": "",
      "chain": [
        "38132",
        "30286",
        "20321",
        "10606",
        "11884",
        "13"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-5054",
      "hadith_no": "5054",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا جعفر بن مسافر التنيسي، حدثنا يحيى بن حسان، حدثنا يحيى بن حمزة، عن ثور، عن خالد بن معدان، عن أبي الأزهر الأنماري، أن رسول الله صلى الله عليه وسلم كان إذا أخذ مضجعه من الليل قال ‏\"‏ بسم الله وضعت جنبي اللهم اغفر لي ذنبي وأخسئ شيطاني وفك رهاني واجعلني في الندي الأعلى ‏\"‏ ‏.‏ قال أبو داود رواه أبو همام الأهوازي عن ثور قال أبو زهير الأنماري ‏.‏",
      "text_en": " Narrated AbulAzhar al-Anmari:                     When the Messenger of Allah (ﷺ) went to his bed at night, he would say: in the name of Allah, I have laid down my side for Allah. O Allah! forgive me my sin, drive away my devil, free me from my responsibility, and place me in the highest assembly.Abu Dawud said: Abu Hammam al-Ahwazi transmitted it from Thawr. He mentioned Abu Zuhair al-Anmari (instead of Abu al-Azhar).",
      "usc_msa_ref": "",
      "chain": [
        "38132",
        "20300",
        "20402",
        "11155",
        "11422"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-an-nasai-5625",
      "hadith_no": "5625",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا جعفر بن مسافر، قال حدثنا يحيى بن حسان، قال حدثنا وهيب، قال حدثنا ابن طاوس، عن أبيه، عن ابن عمر، أن رسول الله صلى الله عليه وسلم نهى عن الدباء ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that:                     The Messenger of Allah [SAW] forbade Ad-Dubba' (gourds).",
      "usc_msa_ref": "",
      "chain": [
        "38132",
        "20300",
        "20299",
        "11433",
        "11053",
        "18"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-ibn-majah-455",
      "hadith_no": "455",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا جعفر بن مسافر، حدثنا إسماعيل بن قعنب أبو بشر، حدثنا عبد الله بن عرادة الشيباني، عن زيد بن الحواري، عن معاوية بن قرة، عن عبيد بن عمير، عن أبى بن كعب، أن رسول الله  صلى الله عليه وسلم  دعا بماء فتوضأ مرة مرة فقال ‏\"‏ هذا وظيفة الوضوء ‏\"‏ ‏.‏ أو قال ‏\"‏ وضوء من لم يتوضأه لم يقبل الله له صلاة ‏\"‏ ‏.‏ ثم توضأ مرتين مرتين ثم قال ‏\"‏ هذا وضوء من توضأه أعطاه الله كفلين من الأجر ‏\"‏ ‏.‏ ثم توضأ ثلاثا ثلاثا فقال ‏\"‏ هذا وضوئي ووضوء المرسلين من قبلي ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ubayy bin Ka'b that:                     The Messenger of Allah called for water and performed ablution once. He said: \"This is the minimum requirement of ablution' or he said: 'The ablution of one who, if he does not perform this ablution, Allah will not accept his prayer.\" Then he performed ablution washing each part twice, and he said: 'This is the ablution of one who, if he performs it, Allah will give him two shares of reward.\" Then he performed ablution washing each part three times, and said: 'This is my ablution and the ablution of the Messengers who were sent before me.\"",
      "usc_msa_ref": "",
      "chain": [
        "38132",
        "24241",
        "14135",
        "11306",
        "11259",
        "39"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-1085",
      "hadith_no": "1085",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا جعفر بن مسافر، حدثنا إسماعيل بن أبي أويس، أخبرني إبراهيم بن إسماعيل الأشهلي، عن عبد الله بن عبد الرحمن بن ثابت بن الصامت، عن أبيه، عن جده، أن رسول الله  صلى الله عليه وسلم  صلى في بني عبد الأشهل وعليه كساء متلفف به يضع يديه عليه يقيه برد الحصى ‏.‏",
      "text_en": " It wasnarrated from ‘Abdullah bin ‘Abdur-Rahman bin Thabit binSamit,from his father, from his grandfather, that the Messenger ofAllah(ﷺ) performed prayer among Banu ‘Abdul-Ashhal, wearing a cloakinwhich he was wrapped and putting his hands on it to protect themfromthe cold of the pebbles.",
      "usc_msa_ref": "",
      "chain": [
        "38132",
        "30103",
        "26500"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-1508",
      "hadith_no": "1508",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا جعفر بن مسافر، حدثني كثير بن هشام، حدثنا جعفر بن برقان، عن ميمون بن مهران، عن عمر بن الخطاب، قال قال لي النبي  صلى الله عليه وسلم  ‏\"‏ إذا دخلت على مريض فمره أن يدعو لك فإن دعاءه كدعاء الملائكة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Umar bin Al-Khattab said:                      “The Prophet (ﷺ)saidto me: ‘When you enter upon one who is sick, tell him to pray foryou, for his supplication is like the supplication of the angels.’”",
      "usc_msa_ref": "",
      "chain": [
        "38132",
        "20633",
        "20646",
        "11012",
        "3"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-2931",
      "hadith_no": "2931",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا جعفر بن مسافر، حدثنا أبو الأسود، حدثنا ابن لهيعة، عن زبان بن فائد، عن سهل بن معاذ بن أنس، عن أبيه، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ لأن أشيع مجاهدا في سبيل الله فأكفه على رحله غدوة أو روحة أحب إلى من الدنيا وما فيها ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Sahl bin Mu’adh bin Anas, from his father, thattheMessenger of Allah (ﷺ) said:                      “For me to hive a good send-off toawarrior who is going to fight in the cause of Allah, and to guardhisgoods when he goes out in the morning or evening, is dearer to methan this world and everything in it.”",
      "usc_msa_ref": "",
      "chain": [
        "38132",
        "11114",
        "20624",
        "16031",
        "16045"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-3293",
      "hadith_no": "3293",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Slaughtering - كتاب الذبائح",
      "chapter_no": "27",
      "text_ar": "حدثنا جعفر بن مسافر، حدثنا أبو الأسود، حدثنا ابن لهيعة، عن يزيد بن أبي حبيب، عن سالم، عن أبيه، عن النبي  صلى الله عليه وسلم  مثله ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "38132",
        "11114",
        "20624",
        "11411",
        "11011",
        "18"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-3385",
      "hadith_no": "3385",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا جعفر بن مسافر، حدثنا صاعد بن عبيد الجزري، حدثنا زهير بن معاوية، حدثنا محمد بن جحادة، حدثنا عمرو بن دينار المكي، عن عطاء بن يسار، عن أبي هريرة، عن رسول الله  صلى الله عليه وسلم  أنه خرج من الغائط فأتي بطعام فقال رجل يا رسول الله ألا آتيك بوضوء قال ‏\"‏ أريد الصلاة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)went outto toilet, then food was brought. A man said:                      “O Messenger ofAllah, are you not going to perform ablution?” He said: ‘Am Igoing topray?’",
      "usc_msa_ref": "",
      "chain": [
        "38132",
        "20321",
        "18897",
        "11081",
        "11020",
        "13"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-3585",
      "hadith_no": "3585",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا جعفر بن مسافر، حدثنا السري بن مسكين، حدثنا ذؤاد بن علبة، عن ليث، عن مجاهد، عن أبي هريرة، قال هجر النبي  صلى الله عليه وسلم  فهجرت فصليت ثم جلست فالتفت إلى النبي  صلى الله عليه وسلم  فقال ‏\"‏ اشكمت درد ‏\"‏ ‏.‏ قلت نعم يا رسول الله ‏.‏ قال ‏\"‏ قم فصل فإن في الصلاة شفاء ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Hurairah said:                      “The Prophet (ﷺ) set out intheearly morning and I did likewise. I prayed, then I sat. TheProphet(ﷺ) turned to me and said: ‘Do you have a stomach problem?’*Isaid: ‘Yes, O Messenger of Allah.’ He said: ‘Get up and pray,for inprayer there is healing.’”",
      "usc_msa_ref": "",
      "chain": [
        "38132",
        "22063",
        "20023",
        "11028",
        "13"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    }
  ],
  "total_hadiths": 27,
  "grade_display": {
    "en": "3rd Century AH [11th Generation]",
    "ar": "القرن الثالث الهجري [الجيل الحادي عشر]",
    "ckb": "سەدەی سێیەمی كۆچی [نەوەی یازدەیەم]"
  }
}