{
  "id": "38181",
  "name": "al-Husain bin Mnswr bin Ja'far الحسين بن منصور بن جعفر",
  "full_name": "al-Husain bin Mnswr bin Ja'far الحسين بن منصور بن جعفر",
  "grade": "3rd Century AH [10th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "238",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Nisapur"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [خ  س  البخاري  والنسائي]",
      "Fiqh"
    ],
    "tags": [
      "al-Salmi",
      "al-Nisapuri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20157",
      "name": "Abu Damra, Anas bin 'Ayyad أنس بن عياض الليثي - أبو ضمرة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20318",
      "name": "Hammad bin Usamah حماد بن أسامة - أبو أسامة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30212",
      "name": "Muhammad bin 'Abdullah bin Numayr محمد بن عبد الله بن نمير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20461",
      "name": "Mubashir bin Isma'i مبشر بن إسماعيل - أبو إسماعيل الكلبي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20172",
      "name": "Muhammad bin Abi Fadayk محمد بن إسماعيل بن مسلم بن أبي فديك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20354",
      "name": "Muhammad bin Khazim al-Darir محمد بن خازم أبو معاوية الضرير",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30006",
      "name": "Imam Nasa'i أحمد بن شعيب بن علي بن سنان النسائي",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30399",
      "name": "Yahya bin Yahya bin Bukayr يحيى بن يحيى بن بكير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30316",
      "name": "Bashr bin al-Hakam bin Habib بشر بن الحكم بن حبيب",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38545",
      "name": "Muhammad bin 'Abdul Wahab bin Habib محمد بن عبد الوهاب أبو أحمد الفراء",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "104",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا الحسين بن منصور، قال حدثنا أبو معاوية، حدثنا الأعمش، ح وأنبأنا الحسين بن منصور، قال حدثنا عبد الله بن نمير، قال حدثنا الأعمش، عن الحكم، عن عبد الرحمن بن أبي ليلى، عن كعب بن عجرة، عن بلال، قال رأيت النبي صلى الله عليه وسلم يمسح على الخفين والخمار ‏.‏",
      "text_en": " It was narrated that Bilal said:                      \"I saw the Prophet (ﷺ) wiping over the Khuff and the Khimar.\"[1] A head covering not limited to the common usage of \"turban\" as is clear from the first narration.",
      "chain": [
        "38181",
        "20354",
        "11060",
        "38181",
        "20331",
        "11060",
        "11069",
        "11196",
        "4052",
        "24"
      ]
    },
    {
      "hadith_no": "1664",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا الحسين بن منصور، قال حدثنا عبد الله بن نمير، قال حدثنا الأعمش، عن سعد بن عبيدة، عن المستورد بن الأحنف، عن صلة بن زفر، عن حذيفة، قال صليت مع النبي صلى الله عليه وسلم ليلة فافتتح البقرة فقلت يركع عند المائة فمضى فقلت يركع عند المائتين فمضى فقلت يصلي بها في ركعة فمضى فافتتح النساء فقرأها ثم افتتح آل عمران فقرأها يقرأ مترسلا إذا مر بآية فيها تسبيح سبح وإذا مر بسؤال سأل وإذا مر بتعوذ تعوذ ثم ركع فقال ‏\"‏ سبحان ربي العظيم ‏\"‏ ‏.‏ فكان ركوعه نحوا من قيامه ثم رفع رأسه فقال ‏\"‏ سمع الله لمن حمده ‏\"‏ ‏.‏ فكان قيامه قريبا من ركوعه ثم سجد فجعل يقول ‏\"‏ سبحان ربي الأعلى ‏\"‏ ‏.‏ فكان سجوده قريبا من ركوعه ‏.‏",
      "text_en": " It was narrated that Hudhaifah said:                     \"I prayed with the Prophet (ﷺ) one night. He started to recite Al-Baqarah and I thought, 'he will bow when he reaches one hundred,' but he carried on. I thought, 'he is going to recite the whole surah in one rak'ah,' but he carried on. He started to recite An-Nisa' and recited (the whole surah), then he started to recite Al Imran and recited (the whole surah), reciting slowly. When he reached a verse that spoke of glorifying Allah (SWT), he glorified Him. When he reached a verse that spoke of supplication, he made supplication. When he reached a verse that spoke of seeking refuge with Allah, he sought refuge with Him. Then he bowed and said: 'Subhana Rabbiyal-Azim.(Glory be to my Lord Almighty)', and he bowed for almost as long as he had stood. Then he raised his head and said: 'Sami Allahu liman hamidah (Allah hears those who praise Him)', and he stood for almost as long as he had bowed. Then he prostrated and started to say:  Subhana Rabbiyal-'Ala (Glory be to my Lord Most High),' and he prostrated for almost as long as he had bowed.'\"",
      "chain": [
        "38181",
        "20331",
        "11060",
        "11344",
        "10824",
        "11354",
        "145"
      ]
    },
    {
      "hadith_no": "1794",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا الحسين بن منصور بن جعفر النيسابوري، قال حدثنا إسحاق بن سليمان، قال حدثنا مغيرة بن زياد، عن عطاء، عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ من ثابر على اثنتى عشرة ركعة في اليوم والليلة دخل الجنة أربعا قبل الظهر وركعتين بعدها وركعتين بعد المغرب وركعتين بعد العشاء وركعتين قبل الفجر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Aishah said:                     \"The Messenger of Allah (ﷺ) said: 'Whoever persists in praying twelve rak'ahs each day and night will enter Paradise: Four before Zuhr and two after, two rak'ahs after Maghrib, two rak'ahs after Isha' and two rak'ahs before Fajr.'\"",
      "chain": [
        "38181",
        "20310",
        "11029",
        "53"
      ]
    },
    {
      "hadith_no": "4166",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of al-Bay'ah - كتاب البيعة",
      "chapter_no": "39",
      "text_ar": "أخبرنا الحسين بن منصور، قال حدثنا مبشر بن عبد الله، قال حدثنا سفيان بن حسين، عن يعلى بن مسلم، عن جابر بن زيد، قال قال ابن عباس إن رسول الله صلى الله عليه وسلم وأبا بكر وعمر كانوا من المهاجرين لأنهم هجروا المشركين وكان من الأنصار مهاجرون لأن المدينة كانت دار شرك فجاءوا إلى رسول الله صلى الله عليه وسلم ليلة العقبة ‏.‏",
      "text_en": " It was narrated that Jabir bin Zaid said:                      \"Ibn 'Abbas said:'The Messenger of Allah (ﷺ), Abu Bakr and 'Umar were among the Muhajirin (emigrants), because they forsook (hajaru) the idolators, andsome of the Ansar were Muhajirun because Al-Madinah was a land of shirk, and they came to the Messenger of Allah (ﷺ) on the Night of Al-'Aqabah.\"'",
      "chain": [
        "38181",
        "20655",
        "11568",
        "11271",
        "17"
      ]
    },
    {
      "hadith_no": "4244",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of al-Fara' and al-'Atirah - كتاب الفرع والعتيرة",
      "chapter_no": "41",
      "text_ar": "أخبرنا الحسين بن منصور بن جعفر النيسابوري، قال حدثنا الحسين بن محمد، قال حدثنا شريك، عن الأعمش، عن عمارة بن عمير، عن الأسود، عن عائشة، قالت سئل النبي صلى الله عليه وسلم عن جلود الميتة فقال ‏\"‏ دباغها طهورها ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"The Prophet was asked about the hides of dead animals.\" He said: \"Tanning it purifies it.\"",
      "chain": [
        "38181",
        "20587",
        "11060",
        "11378",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "4842",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا الحسين بن منصور، قال حدثنا حفص بن عبد الرحمن، قال حدثنا سعيد بن أبي عروبة، عن مطر، عن عمرو بن شعيب، عن أبيه، عن جده، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الأسنان سواء خمسا خمسا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr bin shu'aib, from his father, that his grandfather said:                     The Messenger of Allah said: \"For teeth (the Diyah is ) the same, five camels for each.'",
      "chain": [
        "38181",
        "28123",
        "11073",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "4845",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا الحسين بن منصور، قال حدثنا حفص، - وهو ابن عبد الرحمن البلخي - عن سعيد، عن غالب التمار، عن حميد بن هلال، عن مسروق بن أوس، عن أبي موسى، قال قضى رسول الله صلى الله عليه وسلم أن الأصابع سواء عشرا عشرا من الإبل ‏.‏",
      "text_en": " It was narrated that Abu Musa said:                     \"The Messenger of Allah ruled that the fingers are the same and (the Diyah is ) ten camels for each.",
      "chain": [
        "38181",
        "28123",
        "11168",
        "14310",
        "11281",
        "41"
      ]
    },
    {
      "hadith_no": "4846",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا الحسين بن منصور، قال حدثنا عبد الله بن نمير، قال حدثنا يحيى بن سعيد، عن سعيد بن المسيب، أنه لما وجد الكتاب الذي عند آل عمرو بن حزم الذي ذكروا أن رسول الله صلى الله عليه وسلم كتب لهم وجدوا فيه ‏\"‏ وفيما هنالك من الأصابع عشرا عشرا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Sa'eed bin al-Musayyab that:                     when the letter was found that was with the family of 'Amr bin Hazm, which they said the Messenger of Allah had written to them, they found in it, with regard to fingers, that the Diyahwas ten (Camels) for each.",
      "chain": [
        "38181",
        "20331",
        "11062",
        "11002"
      ]
    },
    {
      "hadith_no": "4969",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرنا الحسين بن منصور، قال حدثنا أبو أسامة، قال حدثنا يحيى بن سعيد، عن محمد بن يحيى بن حبان، عن رجل، من قومه عن رافع بن خديج، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا قطع في ثمر ولا كثر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Rafi bin Khadij said:                     \"I heard the Messenger of Allah say: 'The hand is not to be cut off for (stealing) produce or the spadix of palm trees.\"'",
      "chain": [
        "38181",
        "20318",
        "20031",
        "11222",
        "1986"
      ]
    },
    {
      "hadith_no": "5179",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا الحسين بن منصور بن جعفر النيسابوري، قال حدثنا حفص بن عبد الرحمن البلخي، قال حدثنا سعيد، عن أيوب، عن نافع، عن مولى، للعباس أن عليا، قال نهاني رسول الله صلى الله عليه وسلم عن لبس المعصفر وعن القسي وعن التختم بالذهب وأن أقرأ وأنا راكع ‏.‏",
      "text_en": " It was narrated from Nafi', from a freed slave of Ibn 'Abbas, that 'Ali said:                     \"The Messenger of Allah [SAW] forbade me from wearing garments dyed with safflower, and from Al-Qassi, and from gold rings, and that I recite Qur'an while I am bowing.\"",
      "chain": [
        "38181",
        "28123",
        "11168",
        "11015",
        "11014",
        "5"
      ]
    },
    {
      "hadith_no": "5409",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Etiquette of Judges - كتاب آداب القضاة",
      "chapter_no": "49",
      "text_ar": "أخبرنا الحسين بن منصور بن جعفر، قال حدثنا مبشر بن عبد الله بن رزين، قال حدثنا سفيان بن حسين، عن أبي بشر، جعفر بن إياس عن عباد بن شراحيل، قال قدمت مع عمومتي المدينة فدخلت حائطا من حيطانها ففركت من سنبله فجاء صاحب الحائط فأخذ كسائي وضربني فأتيت رسول الله صلى الله عليه وسلم أستعدي عليه فأرسل إلى الرجل فجاءوا به فقال ‏\"‏ ما حملك على هذا ‏\"‏ ‏.‏ فقال يا رسول الله إنه دخل حائطي فأخذ من سنبله ففركه ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ ما علمته إذ كان جاهلا ولا أطعمته إذ كان جائعا اردد عليه كساءه ‏\"‏ ‏.‏ وأمر لي رسول الله صلى الله عليه وسلم بوسق أو نصف وسق ‏.‏",
      "text_en": " It was narrated that 'Abbad bin Shurahbil said:                     \"I came to Al-Madinah with my paternal uncles and entered one of its gardens, where I rubbed an ear of grain (to take some grains). The owner of the garden came, took my cloak and hit me. I came to the Messenger of Allah [SAW] and sought his help against him. He sent for the man and they brought him. He said: 'What made you do that?' He said: 'O Messenger of Allah, he entered my garden and took one of the ears of grain and rubbed it.' The Messenger of Allah [SAW] said: 'You did not teach him if he was ignorant, nor feed him if he was hungry. Give him back his cloak.' And the Messenger of Allah [SAW] ordered me with a Wasq or half a Wasq.\"",
      "chain": [
        "38181",
        "20655"
      ]
    },
    {
      "hadith_no": "5421",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Etiquette of Judges - كتاب آداب القضاة",
      "chapter_no": "49",
      "text_ar": "أخبرنا الحسين بن منصور بن جعفر، قال حدثنا مبشر بن عبد الله، قال حدثنا سفيان بن حسين، عن جعفر بن إياس، عن عبد الرحمن بن أبي بكرة، - وكان عاملا على سجستان - قال كتب إلى أبو بكرة يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يقضين أحد في قضاء بقضاءين ولا يقضي أحد بين خصمين وهو غضبان ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Abi Bakrah, who was a governor in Sijistan, said:                     \"Abu Bakrah wrote to me, saying: 'I heard the Messenger of Allah [SAW] say: No one should pass two judgments on one issue, and no one should pass judgment between two disputing parties while he is angry.'\"",
      "chain": [
        "38181",
        "20655",
        "11419",
        "11294"
      ]
    },
    {
      "hadith_no": "5550",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا الحسين بن منصور بن جعفر، قال حدثنا عبد الله بن نمير، قال حدثنا الأعمش، عن حبيب، عن أبي أرطاة، عن أبي سعيد الخدري، قال نهى رسول الله صلى الله عليه وسلم عن الزهو والتمر والزبيب والتمر‏.‏",
      "text_en": " It was narrated that Abu Sa'eed Al-Khudri said:                     \"The Messenger of Allah [SAW] forbade (mixing) Az-Zahuw and At-Tamr, and raisins and dried dates (At-Tamr).\"",
      "chain": [
        "38181",
        "20331",
        "11060",
        "11276",
        "38"
      ]
    },
    {
      "hadith_no": "5583",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا الحسين بن منصور بن جعفر، قال حدثنا أحمد بن حنبل، قال حدثنا عبد الرحمن بن مهدي، قال حدثنا حماد بن زيد، عن أيوب، عن نافع، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ كل مسكر حرام وكل مسكر خمر ‏\"‏ ‏.‏ قال الحسين قال أحمد وهذا حديث صحيح ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                     \"The Messenger of Allah [SAW] said: 'Every intoxicant is unlawful and every intoxicant is Khamr.'\"",
      "chain": [
        "38181",
        "30007",
        "20033",
        "20022",
        "11015",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "5685",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا أحمد بن عبد الله بن الحكم، قال حدثنا محمد، ح وأنبأنا الحسين بن منصور، قال حدثنا أحمد بن حنبل، قال حدثنا محمد بن جعفر، قال حدثنا شعبة، عن مسعر، عن أبي عون، عن عبد الله بن شداد، عن ابن عباس، قال حرمت الخمر بعينها قليلها وكثيرها والسكر من كل شراب ‏.‏ لم يذكر ابن الحكم قليلها وكثيرها ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"Khamr was forbidden in and of itself, in small or large amounts, as was every kind of intoxicating drink.\"",
      "chain": [
        "30213",
        "38181",
        "30007",
        "20173",
        "20020",
        "20359",
        "11649",
        "169",
        "17"
      ]
    },
    {
      "hadith_no": "5686",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا الحسين بن منصور، قال حدثنا أحمد بن حنبل، قال حدثنا إبراهيم بن أبي العباس، قال حدثنا شريك، عن عباس بن ذريح، عن أبي عون، عن عبد الله بن شداد، عن ابن عباس، قال حرمت الخمر قليلها وكثيرها وما أسكر من كل شراب ‏.‏ قال أبو عبد الرحمن وهذا أولى بالصواب من حديث ابن شبرمة وهشيم بن بشير كان يدلس وليس في حديثه ذكر السماع من ابن شبرمة ورواية أبي عون أشبه بما رواه الثقات عن ابن عباس ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"Khamr was forbidden in small or large amounts, as was every kind of drink that intoxicates.\"",
      "chain": [
        "38181",
        "30007",
        "11858",
        "11649",
        "169",
        "17"
      ]
    },
    {
      "hadith_no": "5701",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا الحسين بن منصور، - يعني ابن جعفر النيسابوري - قال حدثنا يزيد بن هارون، قال أنبأنا محمد بن عمرو، عن أبي سلمة، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ كل مسكر حرام وكل مسكر خمر ‏\"‏ ‏.‏ قال أبو عبد الرحمن وهؤلاء أهل الثبت والعدالة مشهورون بصحة النقل وعبد الملك لا يقوم مقام واحد منهم ولو عاضده من أشكاله جماعة وبالله التوفيق ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                     \"The Messenger of Allah [SAW] said: 'Every intoxicant is unlawful and every intoxicant is Khamr.'\"",
      "chain": [
        "38181",
        "20472",
        "11220",
        "10567",
        "18"
      ]
    }
  ],
  "total_hadiths": 17
}