{
  "id": "38204",
  "name": "Khshysh bin Asrm bin al-'Aswad خشيش بن أصرم بن الأسود",
  "full_name": "Khshysh bin Asrm bin al-'Aswad خشيش بن أصرم بن الأسود",
  "grade": "3rd Century AH [11th generation]",
  "reliability_grade": "Thiqah Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "200",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Nisa'"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ د  س  -  ثقة حافظ ]"
    ],
    "tags": [
      "al-Nisa'i"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20229",
      "name": "Ruh bin 'Ubada bin al-'Ala' روح بن عبادة بن العلاء",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20244",
      "name": "'Abdullah bin Bakr عبد الله بن بكر بن حبيب السهمي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20218",
      "name": "Hiban bin Hilal حبان بن هلال",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20547",
      "name": "Sulaiman bin Da'ud bin al-Jarud سليمان بن داود أبو داود الطيالسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20241",
      "name": "al-Dahhak bin Mukhlad Abu 'Asim al-Nabil الضحاك بن مخلد أبو عاصم النبيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20121",
      "name": "'Abdur-Razzaq عبد الرزاق بن همام",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "36046",
      "name": "'Ali bin Ma'bd bin Shdad علي بن معبد بن شداد",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20034",
      "name": "Muhammad bin Yusuf al-Faryabi محمد بن يوسف الفريابي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20283",
      "name": "Muhammad bin al-Fadl 'Aram محمد بن الفضل السدوسي أبو النعمان عارم",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "38456",
      "name": "al-Qasim bin Kathir bin al-N'man القاسم بن كثير بن النعمان الإسكندراني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20300",
      "name": "Yahya bin Hsan يحيى بن حسان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20472",
      "name": "Yazid bin Harun يزيد بن هارون",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "30006",
      "name": "Imam Nasa'i أحمد بن شعيب بن علي بن سنان النسائي",
      "grade": "3rd Century AH [12th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sunan-abi-daud-1199",
      "hadith_no": "1199",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Rules of Law about the Prayer during Journey - كتاب صلاة السفر",
      "chapter_no": "4",
      "text_ar": "حدثنا أحمد بن حنبل، ومسدد، قالا حدثنا يحيى، عن ابن جريج، ح وحدثنا خشيش، - يعني ابن أصرم - حدثنا عبد الرزاق، عن ابن جريج، قال حدثني عبد الرحمن بن عبد الله بن أبي عمار، عن عبد الله بن بابيه، عن يعلى بن أمية، قال قلت لعمر بن الخطاب أرأيت إقصار الناس الصلاة وإنما قال تعالى ‏{‏ إن خفتم أن يفتنكم الذين كفروا ‏}‏ فقد ذهب ذلك اليوم ‏.‏ فقال عجبت مما عجبت منه فذكرت ذلك لرسول الله صلى الله عليه وسلم فقال ‏\"‏ صدقة تصدق الله بها عليكم فاقبلوا صدقته ‏\"‏ ‏.‏",
      "text_en": " Narrated Ya'la b. Umayyah:                     I remarked to 'Umar al-Khattab: Have you seen the shortening of the prayer by the people today while Allah has said: \"If you fear that those who are infidels may afflict you\", whereas those days are gone now? He replied: I have wondered about the same matter for which you wondered. So I mentioned this to the Messenger of Allah (ﷺ). He said: It is an act of charity which Allah has done to you, so accept his charity.",
      "usc_msa_ref": "",
      "chain": [
        "30007",
        "30175",
        "20031",
        "11070",
        "38204",
        "20121",
        "11070",
        "10647"
      ]
    },
    {
      "id": "sunan-abi-daud-2270",
      "hadith_no": "2270",
      "source": "Sunan Abi Da'ud",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا خشيش بن أصرم، حدثنا عبد الرزاق، أخبرنا الثوري، عن صالح الهمداني، عن الشعبي، عن عبد خير، عن زيد بن أرقم، قال أتي علي - رضى الله عنه - بثلاثة وهو باليمن وقعوا على امرأة في طهر واحد فسأل اثنين أتقران لهذا بالولد قالا لا ‏.‏ حتى سألهم جميعا فجعل كلما سأل اثنين قالا لا ‏.‏ فأقرع بينهم فألحق الولد بالذي صارت عليه القرعة وجعل عليه ثلثى الدية قال فذكر ذلك للنبي صلى الله عليه وسلم فضحك حتى بدت نواجذه ‏.‏",
      "text_en": " Narrated Zayd ibn Arqam:                     Three persons were brought to Ali (Allah be pleased with him) when he was in the Yemen. They and sexual intercourse with a woman during a single state of purity. He asked two of them: Do you acknowledge this child for this (man)? They replied: No. He then put this (question) to all of them. Whenever he asked two of them, they replied in the negative. He, therefore, cast a lot among them, and attributed the child to the one who received the lot. He imposed two-third of the blood-money (i.e. the price of the mother) on him. This was then mentioned to the Prophet (ﷺ) and he laughed so much that his molar teeth appeared.",
      "usc_msa_ref": "",
      "chain": [
        "38204",
        "20121",
        "20012",
        "11052",
        "19874",
        "384"
      ]
    },
    {
      "id": "sunan-abi-daud-2542",
      "hadith_no": "2542",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا أبو توبة، عن الهيثم بن حميد، ح وحدثنا خشيش بن أصرم، حدثنا أبو عاصم، جميعا عن ثور بن يزيد، عن نصر الكناني، عن رجلوقال أبو توبة ‏:‏ عن ثور بن يزيد، عن شيخ، من بني سليم عن عتبة بن عبد السلمي، - وهذا لفظه - أنه سمع رسول الله صلى الله عليه وسلم يقول ‏:‏ ‏\"‏ لا تقصوا نواصي الخيل ولا معارفها ولا أذنابها، فإن أذنابها مذابها، ومعارفها دفاؤها، ونواصيها معقود فيها الخير ‏\"‏ ‏.‏",
      "text_en": " Narrated Utbah ibn AbdusSulami:                     Utbah heard the Messenger of Allah (ﷺ) say: Do not cut the forelocks, manes, or tails of horse, for their tails are their means of driving flies, their manes provide them with warmth, and blessing is tide to their forelocks.",
      "usc_msa_ref": "",
      "chain": [
        "30335",
        "20744",
        "38204",
        "20241",
        "20415",
        "20415",
        "5166"
      ]
    },
    {
      "id": "sunan-abi-daud-3533",
      "hadith_no": "3533",
      "source": "Sunan Abi Da'ud",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا خشيش بن أصرم، حدثنا عبد الرزاق، حدثنا معمر، عن الزهري، عن عروة، عن عائشة، قالت جاءت هند إلى النبي صلى الله عليه وسلم فقالت يا رسول الله إن أبا سفيان رجل ممسك فهل على من حرج أن أنفق على عياله من ماله بغير إذنه فقال النبي صلى الله عليه وسلم ‏\"‏ لا حرج عليك أن تنفقي عليهم بالمعروف ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Aishah:                     Hind came to the Prophet (ﷺ) and said: Messenger of Allah, Abu Sufyan is a stingy person. Is there any harm to me if I spend on his dependants from his property without his permission ? The Prophet (ﷺ) replied: There is no harm to you if you spend according to the custom.",
      "usc_msa_ref": "",
      "chain": [
        "38204",
        "20121",
        "20115",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-4329",
      "hadith_no": "4329",
      "source": "Sunan Abi Da'ud",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا أبو عاصم، خشيش بن أصرم حدثنا عبد الرزاق، أخبرنا معمر، عن الزهري، عن سالم، عن ابن عمر، أن النبي صلى الله عليه وسلم مر بابن صائد في نفر من أصحابه فيهم عمر بن الخطاب وهو يلعب مع الغلمان عند أطم بني مغالة وهو غلام فلم يشعر حتى ضرب رسول الله صلى الله عليه وسلم ظهره بيده ثم قال ‏\"‏ أتشهد أني رسول الله ‏\"‏ ‏.‏ قال فنظر إليه ابن صياد فقال أشهد أنك رسول الأميين ‏.‏ ثم قال ابن صياد للنبي صلى الله عليه وسلم أتشهد أني رسول الله فقال له النبي صلى الله عليه وسلم ‏\"‏ آمنت بالله ورسله ‏\"‏ ‏.‏ ثم قال له النبي صلى الله عليه وسلم ‏\"‏ ما يأتيك ‏\"‏ ‏.‏ قال يأتيني صادق وكاذب ‏.‏ فقال له النبي صلى الله عليه وسلم ‏\"‏ خلط عليك الأمر ‏\"‏ ‏.‏ ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ إني قد خبأت لك خبيئة ‏\"‏ ‏.‏ وخبأ له ‏{‏ يوم تأتي السماء بدخان مبين ‏}‏ قال ابن صياد هو الدخ ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ اخسأ فلن تعدو قدرك ‏\"‏ ‏.‏ فقال عمر يا رسول الله ائذن لي فأضرب عنقه ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن يكن فلن تسلط عليه ‏\"‏ ‏.‏ يعني الدجال ‏\"‏ وإلا يكن هو فلا خير في قتله ‏\"‏ ‏.‏",
      "text_en": " Ibn ‘Umar said :                      The prophet (ﷺ) passed by Ibn Sa’Id along with some of his companions. ‘Umar b. al-Kattab was among them. He was playing with boys near the fortress of Banu Maghalah. He was near the age of puberty (i.e. a boy). Before he was aware,  the Messenger of Allah (ﷺ)  gave him a pat on the back and said : Do you testify that you are the Messenger of Allah Ibn Sayyad then looked at him and said: I testify that you are the Apostle of Gentiles. Ibn Sayyad then said the prophet (ﷺ) then asked him : What comes to you ? He replied: One who speaks the truth and one who lies come to me. The prophet (may peace upon him) said: You are confused. The Messenger of Allah (may peace upon him) said to him: I have concealed something (in my hand) and he concealed the verse “the day when the sky will bring forth smoke (dukhan) clearly visible Ibn Sayyad said: It is smoke (dukhan) .The Messenger of Allah (ﷺ) said: Away with you, You cannot get farther than your rank. ‘Umar said: “Messenger of Allah, permit me to cut off his head. The Messenger of Allah (ﷺ) said: If he is the one (the Dajjal), you will not be given power over him, and if he is not, you will not do well in killing him.",
      "usc_msa_ref": "",
      "chain": [
        "38204",
        "20121",
        "20115",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "id": "sunan-abi-daud-5030",
      "hadith_no": "5030",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن داود بن سفيان، وخشيش بن أصرم، قالا حدثنا عبد الرزاق، أخبرنا معمر، عن الزهري، عن ابن المسيب، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ خمس تجب للمسلم على أخيه رد السلام وتشميت العاطس وإجابة الدعوة وعيادة المريض واتباع الجنازة ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the Messenger of Allah (May peace be upon him) as saying:                      There are five qualities which a Muslim should display to his brother : return of salutation, response to the one who sneezes, acceptance of the invitation, paying sick visit to a patient, and accompanying the funeral.",
      "usc_msa_ref": "",
      "chain": [
        "38204",
        "20121",
        "20115",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-597",
      "hadith_no": "597",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا أبو عاصم، خشيش بن أصرم قال حدثنا حبان بن هلال، حدثنا حبيب، - وهو ابن أبي حبيب - عن عمرو بن هرم، عن جابر بن زيد، عن ابن عباس، أنه صلى بالبصرة الأولى والعصر ليس بينهما شىء والمغرب والعشاء ليس بينهما شىء فعل ذلك من شغل وزعم ابن عباس أنه صلى مع رسول الله صلى الله عليه وسلم بالمدينة الأولى والعصر ثمان سجدات ليس بينهما شىء ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that he prayed Al-Uula (Zuhr) and 'Asr together in Al-Basrah with nothing in between them, and he prayed Maghrib and 'Isha' together with nothing in between them. He did that because he was busy and Ibn 'Abbas said that he had prayed Zuhr and 'Isha' together with the Messenger of Allah (ﷺ) in Al-Madinah, eight Rak'ahs with nothing in between.",
      "usc_msa_ref": "",
      "chain": [
        "38204",
        "20218",
        "10708",
        "11271",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-631",
      "hadith_no": "631",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا أبو عاصم، خشيش بن أصرم قال حدثنا يحيى بن حسان، قال حدثنا حماد بن سلمة، عن عمرو بن دينار، عن نافع بن جبير، عن أبيه، أن رسول الله صلى الله عليه وسلم قال في سفر له ‏\"‏ من يكلؤنا الليلة لا نرقد عن صلاة الصبح ‏\"‏ ‏.‏ قال بلال أنا ‏.‏ فاستقبل مطلع الشمس فضرب على آذانهم حتى أيقظهم حر الشمس فقاموا فقال ‏\"‏ توضئوا ‏\"‏ ‏.‏ ثم أذن بلال فصلى ركعتين وصلوا ركعتى الفجر ثم صلوا الفجر ‏.‏",
      "text_en": " It was narrated from Nafi' bin Jubair, from his father, that the Messenger of Allah (ﷺ) said during a journey:                      \"Who will watch out for dawn for us, so that we do not sleep and miss the dawn prayer?\" Bilal said: 'I will.' He turned to face the direction where the sun woke them up, then they got up. He said: 'Perform Wudu'.' Then Bilal called the Adhan and he prayed two Rak'ahs, and they prayed the two (Sunnah) Rak'ahs of Fajr, then they prayed Fajr.\"",
      "usc_msa_ref": "",
      "chain": [
        "38204",
        "20300",
        "20021",
        "11081",
        "11059",
        "871"
      ]
    },
    {
      "id": "sunan-an-nasai-2873",
      "hadith_no": "2873",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا أبو عاصم، خشيش بن أصرم قال حدثنا عبد الرزاق، قال حدثنا جعفر بن سليمان، قال حدثنا ثابت، عن أنس، أن النبي صلى الله عليه وسلم دخل مكة في عمرة القضاء وعبد الله بن رواحة يمشي بين يديه وهو يقول خلوا بني الكفار عن سبيله اليوم نضربكم على تنزيله ضربا يزيل الهام عن مقيله ويذهل الخليل عن خليله فقال له عمر يا ابن رواحة بين يدى رسول الله صلى الله عليه وسلم وفي حرم الله عز وجل تقول الشعر قال النبي صلى الله عليه وسلم ‏\"‏ خل عنه فلهو أسرع فيهم من نضح النبل ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Anas that:                     the Prophet entered Makkah during the Umratul-Qada, and Abdullah bin Rawahah was walking in front of him and saying:Get out of his way, you unbelievers, make way.Today we will fight about its revelationWith blows that will remove beads from shouldersAnd make friend unmindful of friends.Umar said to him: \"O Ibn Rawahah! In front of the Messenger of Allah and in the Sancturary of Allah, the Might and Sublime, you recite poetry?\" The Prophet said: \"Let him do so, for what he is saying is more effective than shooting arrows at them.\"",
      "usc_msa_ref": "",
      "chain": [
        "38204",
        "20121",
        "20532",
        "11269",
        "19"
      ]
    },
    {
      "id": "sunan-an-nasai-3082",
      "hadith_no": "3082",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا أبو عاصم، خشيش بن أصرم عن علي بن معبد، قال حدثنا موسى بن أعين، عن عبد الكريم الجزري، عن سعيد بن جبير، عن ابن عباس، عن الفضل بن العباس، أنه كان رديف النبي صلى الله عليه وسلم فلم يزل يلبي حتى رمى جمرة العقبة ‏.‏",
      "text_en": " It was narrated from Al-Fadl bin 'Abbas that:                     he was riding behind the Prophet and he continued recite the Talbiyah until he stoned Jamratul Aqabah.",
      "usc_msa_ref": "",
      "chain": [
        "38204",
        "36046",
        "20465",
        "18655",
        "11050",
        "17",
        "135"
      ]
    },
    {
      "id": "sunan-an-nasai-3488",
      "hadith_no": "3488",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا أبو عاصم، خشيش بن أصرم قال أنبأنا عبد الرزاق، قال أنبأنا الثوري، عن صالح الهمداني، عن الشعبي، عن عبد خير، عن زيد بن أرقم، قال أتي علي رضى الله عنه بثلاثة وهو باليمن وقعوا على امرأة في طهر واحد فسأل اثنين أتقران لهذا بالولد قالا لا ‏.‏ ثم سأل اثنين أتقران لهذا بالولد قالا لا ‏.‏ فأقرع بينهم فألحق الولد بالذي صارت عليه القرعة وجعل عليه ثلثى الدية فذكر ذلك للنبي صلى الله عليه وسلم فضحك حتى بدت نواجذه ‏.‏",
      "text_en": " It was narrated that Zaid bin Arqam said:                      \"Three men were brought to 'Ali while he was in Yemen; they all had intercourse with a woman during a single menstrual cycle. He asked two of them: 'Do you affirm that this child belongs to (the third man)?' And they said: 'No.' He asked another two of them: 'Do you affirm that this child belongs to (the third man)?' And they said: 'No.' So he cast lots between them, and attributed the child to the one whom the lot fell, and obliged him to pay two-thirds of the Diyah. The Prophet was told of this, and he laughed so much that his back teeth became visible.\"",
      "usc_msa_ref": "",
      "chain": [
        "38204",
        "20121",
        "20012",
        "11052",
        "19874",
        "384"
      ]
    },
    {
      "id": "sunan-an-nasai-3759",
      "hadith_no": "3759",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of 'Umra - كتاب العمرى",
      "chapter_no": "34",
      "text_ar": "أخبرنا أبو عاصم، خشيش بن أصرم قال حدثنا عبد الرزاق، قال أنبأنا معمر، عن ابن عجلان، عن سعيد، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لقد هممت أن لا أقبل هدية إلا من قرشي أو أنصاري أو ثقفي أو دوسي ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah said:                      \"I was thinking of not accepting gifts except from a Quraishi, an Ansari, a Thaqafi or a Dawsi.\"",
      "usc_msa_ref": "",
      "chain": [
        "38204",
        "20121",
        "20115",
        "10616",
        "11168",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-4260",
      "hadith_no": "4260",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of al-Fara' and al-'Atirah - كتاب الفرع والعتيرة",
      "chapter_no": "41",
      "text_ar": "أخبرنا خشيش بن أصرم، قال حدثنا عبد الرزاق، قال أخبرني عبد الرحمن بن بؤذوية، أن معمرا، ذكره عن الزهري، عن عبيد الله بن عبد الله، عن ابن عباس، عن ميمونة، عن النبي صلى الله عليه وسلم أنه سئل عن الفأرة تقع في السمن فقال ‏\"‏ إن كان جامدا فألقوها وما حولها وإن كان مائعا فلا تقربوه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn' Abbas, from Maimunah, that:                     the Prophet was asked about a mouse that fell into the cooking fat. He said: \"If it (the fat) is solid, then throw it away, and whatever is around it. If it is liquid then do not use it at all.\"(Daif)",
      "usc_msa_ref": "",
      "chain": [
        "38204",
        "20121",
        "11013",
        "11004",
        "17",
        "61"
      ]
    },
    {
      "id": "sunan-an-nasai-5460",
      "hadith_no": "5460",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا أبو عاصم، خشيش بن أصرم قال حدثنا حبان، قال حدثنا حماد بن سلمة، عن إسحاق بن عبد الله بن أبي طلحة، عن سعيد بن يسار، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم كان يقول ‏\"‏ اللهم إني أعوذ بك من الفقر وأعوذ بك من القلة والذلة وأعوذ بك أن أظلم أو أظلم ‏\"‏ ‏.‏ خالفه الأوزاعي ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     The Messenger of Allah [SAW] used to say: \"Allahumma, inni a'udhu bika minal-faqri wa a'udhu bika min al-qillati wadh-dhillati, wa a'udhu bika an azlima aw uzlam (O Allah, I seek refuge with you from poverty, I seek refuge with You from want and humiliation, and I seek refuge with You from wronging others or being wronged.)\" Al-Awza'I contradicted him.",
      "usc_msa_ref": "",
      "chain": [
        "38204",
        "20218",
        "20021",
        "11151",
        "11170",
        "13"
      ]
    }
  ],
  "total_hadiths": 14
}