{
  "id": "38210",
  "name": "Da'ud bin Umayya al-Azdy داود بن أمية الأزدي",
  "full_name": "Da'ud bin Umayya al-Azdy داود بن أمية الأزدي",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ د  -  ثقة ]"
    ],
    "tags": [
      "al-Azdi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20460",
      "name": "Malik bin Sa'eer bin al-Khamus مالك بن سعير بن الخمس",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20286",
      "name": "Mua'dh bin Mua'dh bin Nsr معاذ بن معاذ بن نصر",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20287",
      "name": "Mua'dh bin Hisham bin Aby معاذ بن هشام بن أبي عبد الله",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1376",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Ramadan - كتاب شهر رمضان",
      "chapter_no": "6",
      "text_ar": "حدثنا نصر بن علي، وداود بن أمية، أن سفيان، أخبرهم عن أبي يعفور، - وقال داود عن ابن عبيد بن نسطاس، - عن أبي الضحى، عن مسروق، عن عائشة، أن النبي صلى الله عليه وسلم كان إذا دخل العشر أحيا الليل وشد المئزر وأيقظ أهله ‏.‏ قال أبو داود وأبو يعفور اسمه عبد الرحمن بن عبيد بن نسطاس ‏.‏",
      "text_en": " Narrated 'Aishah:                     When the last ten days of Ramadan came, the Prophet (ﷺ) kept vigil and prayed during the whole night, and tied the wrapper tightly, and awakened his family (to pray during the night).Abu Dawud said: The name of Abu Ya'fur is 'Abd al-Rahman b. 'Ubaid b. Nistas.",
      "chain": [
        "30395",
        "38210",
        "20005",
        "11403",
        "11365",
        "11392",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "1440",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا داود بن أمية، حدثنا معاذ، - يعني ابن هشام - حدثني أبي، عن يحيى بن أبي كثير، قال حدثني أبو سلمة بن عبد الرحمن، حدثنا أبو هريرة، قال والله لأقربن بكم صلاة رسول الله صلى الله عليه وسلم قال فكان أبو هريرة يقنت في الركعة الآخرة من صلاة الظهر وصلاة العشاء الآخرة وصلاة الصبح فيدعو للمؤمنين ويلعن الكافرين ‏.‏",
      "text_en": " Abu Hurairah said:                      By Allah, I shall offer prayer like that of the Messenger of Allah (ﷺ). The narrator said: Abu Hurairah used to recite the supplication in the last rak'ah of the noon, night and dawn prayers. He would supplicate for the believers and curse the disbelievers.",
      "chain": [
        "38210",
        "20287",
        "20295",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1503",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا داود بن أمية، حدثنا سفيان بن عيينة، عن محمد بن عبد الرحمن، مولى أبي طلحة عن كريب، عن ابن عباس، قال خرج رسول الله صلى الله عليه وسلم من عند جويرية - وكان اسمها برة فحول اسمها - فخرج وهي في مصلاها ورجع وهي في مصلاها فقال ‏\"‏ لم تزالي في مصلاك هذا ‏\"‏ ‏.‏ قالت نعم ‏.‏ قال ‏\"‏ قد قلت بعدك أربع كلمات ثلاث مرات لو وزنت بما قلت لوزنتهن سبحان الله وبحمده عدد خلقه ورضا نفسه وزنة عرشه ومداد كلماته ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah Ibn Abbas:                     The Messenger of Allah (ﷺ) went out from Juwayriyyah (wife of the Prophet). Earlier her name was Barrah, and he changed it. When he went out she was in her place of worship, and when he returned she was in her place of worship.  He asked: Have you been in your place of worship continuously?  She said: Yes.  He then said: Since leaving you I have said three times four phrases which, if weighed against all that you have said (during this period), would prove to be heavier: \"glory be to Allah\", and I begin with praise of Him to the number of His creatures, in accordance with His good pleasure, to the weight of His throne and to the ink (extent) of His words.",
      "chain": [
        "38210",
        "20005",
        "11211",
        "17"
      ]
    }
  ],
  "total_hadiths": 3
}