{
  "id": "38240",
  "name": "Sa'id bin Y'aqub al-Talqany سعيد بن يعقوب الطالقاني",
  "full_name": "Sa'id bin Y'aqub al-Talqany سعيد بن يعقوب الطالقاني",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "244",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ د  ت  س  -  ثقة ]"
    ],
    "tags": []
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20022",
      "name": "Hammad bin Zayd حماد بن زيد بن درهم الأزدي الأزرق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20423",
      "name": "Khalid bin 'Abdullah al-Tahan خالد بن عبد الله بن عبد الرحمن الطحان",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20288",
      "name": "Ma'tmar bin Sulaiman-al-Taufayl معتمر بن سليمان - الطفيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20183",
      "name": "Yahya bin Wadh يحيى بن واضح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20304",
      "name": "Yazid bin Zari' يزيد بن زريع",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "33018",
      "name": "'Uthman bin al-Yaman عثمان بن اليمان",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20468",
      "name": "Hashaym bin Bashayr bin al-Qasim هشيم بن بشير بن القاسم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20248",
      "name": "'Abdul Salam bin Harb bin Salm al-Mala'i عبد السلام بن حرب بن سلم النهدي الملائي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20678",
      "name": "Yahya bin al-Darays يحيى بن الضريس",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "25029",
      "name": "Ayoub bin Jabir bin Syar أيوب بن جابر بن سيار",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "students": [
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "30005",
      "name": "Imam Tirmidhi الترمذي محمد بن عيسى بن سورة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30006",
      "name": "Imam Nasa'i أحمد بن شعيب بن علي بن سنان النسائي",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30554",
      "name": "Abu Zara' al-Razi أبو زرعة الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30218",
      "name": "Musa bin Harun bin Bashyr موسى بن هارون بن بشير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38719",
      "name": "Y'aqub bin Sufyan يعقوب بن سفيان",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30585",
      "name": "'Abbas bin Muhammad bin Hatm عباس بن محمد بن حاتم",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "31513",
      "name": "al-Harith bin Muhammad bin Abi Usama الحارث بن محمد بن أبي أسامة",
      "grade": "3rd Century AH"
    },
    {
      "id": "30467",
      "name": "'Abdullah bin 'Amir عبد الله بن عامر بن زرارة الحضرمي",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "2641",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا سعيد بن يعقوب الطالقاني، حدثنا عبد الله بن المبارك، عن حميد، عن أنس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أمرت أن أقاتل الناس حتى يشهدوا أن لا إله إلا الله وأن محمدا عبده ورسوله وأن يستقبلوا قبلتنا وأن يأكلوا ذبيحتنا وأن يصلوا صلاتنا فإذا فعلوا ذلك حرمت علينا دماؤهم وأموالهم إلا بحقها لهم ما للمسلمين وعليهم ما على المسلمين ‏\"‏ ‏.‏",
      "text_en": " Narrated Anas ibn Malik:                     The Prophet (ﷺ) said: I am commanded to fight with men till they testify that there is no god but Allah, and that Muhammad is His servant and His Apostle, face our qiblah (direction of prayer), eat what we slaughter, and pray like us. When they do that, their life and property are unlawful for us except what is due to them. They will have the same rights as the Muslims have, and have the same responsibilities as the Muslims have.",
      "chain": [
        "38240",
        "20025",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "1217",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا سعيد بن يعقوب الطالقاني، حدثنا خالد بن عبد الله الواسطي، عن حسين بن قيس، عن عكرمة، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم لأصحاب المكيال والميزان ‏\"‏ إنكم قد وليتم أمرين هلكت فيه الأمم السالفة قبلكم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث لا نعرفه مرفوعا إلا من حديث حسين بن قيس ‏.‏ وحسين بن قيس يضعف في الحديث ‏.‏ وقد روي هذا بإسناد صحيح عن ابن عباس موقوفا ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     That the Messenger of Allah (ﷺ) said to the people of weights and measures: \"Indeed you have been entrusted with two matters that nations preceding you in the past were destroyed for.\"[Abu 'Eisa said:] We do not know this Hadith to be Marfu' except through the narration of Husain bin Qais, and Husain bin Qais was graded weak in Hadith. This has been reported as Maquf narration from Ibn 'Abbas with a Sahih chain of narration.",
      "chain": [
        "38240",
        "20423",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2041",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا سعيد بن يعقوب الطالقاني، حدثنا المعتمر بن سليمان، قال سمعت أبي يحدث، عن حنش، عن عكرمة، عن ابن عباس، أن النبي صلى الله عليه وسلم قال ‏\"‏ من قبض يتيما بين المسلمين إلى طعامه وشرابه أدخله الله الجنة البتة إلا أن يعمل ذنبا لا يغفر له ‏\"‏ ‏.‏ قال وفي الباب عن مرة الفهري وأبي هريرة وأبي أمامة وسهل بن سعد ‏.‏ قال أبو عيسى وحنش هو حسين بن قيس وهو أبو علي الرحبي وسليمان التيمي يقول حنش وهو ضعيف عند أهل الحديث ‏.‏",
      "text_en": " Ibn 'Abbas narrated that:                     the Prophet said: Whoever takes in an orphan among the Muslims to raise, to feed him and give him drink, Allah admits him into Paradise without a doubt, unless he has done a sin for which he is not forgiven.\"",
      "chain": [
        "38240",
        "20288",
        "11289",
        "15113",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2608",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Faith - كتاب الإيمان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "40",
      "text_ar": "حدثنا سعيد بن يعقوب الطالقاني، حدثنا ابن المبارك، أخبرنا حميد الطويل، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أمرت أن أقاتل الناس حتى يشهدوا أن لا إله إلا الله وأن محمدا عبده ورسوله وأن يستقبلوا قبلتنا ويأكلوا ذبيحتنا وأن يصلوا صلاتنا فإذا فعلوا ذلك حرمت علينا دماؤهم وأموالهم إلا بحقها لهم ما للمسلمين وعليهم ما على المسلمين ‏\"‏ ‏.‏ وفي الباب عن معاذ بن جبل وأبي هريرة ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه ‏.‏ وقد رواه يحيى بن أيوب عن حميد عن أنس نحو هذا ‏.‏",
      "text_en": " Narrated Anas bin Malik:                     that the Messenger of Allah (ﷺ) said: \"I have been ordered to fight the people until they bear witness to La Ilaha Illallah, and that Muhammad is His servant and Messenger, and they face our Qiblah, eat our slaughtered (meat), and perform our Salat. And if they do that, then their blood and wealth will be unlawful to us, except with its due right. For them shall be whatever is for the Muslims, and they shall be obliged with that which the Muslims are obliged.\"",
      "chain": [
        "38240",
        "20025",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "3335",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا سعيد بن يعقوب الطالقاني، حدثنا عبد الله بن المبارك، أخبرنا عتبة بن أبي حكيم، حدثنا عمرو بن جارية اللخمي، عن أبي أمية الشعباني، قال أتيت أبا ثعلبة الخشني فقلت له كيف تصنع في هذه الآية قال أية آية قلت قوله ‏:‏ ‏(‏ يا أيها الذين آمنوا عليكم أنفسكم لا يضركم من ضل إذا اهتديتم ‏)‏ قال أما والله لقد سألت عنها خبيرا سألت عنها رسول الله صلى الله عليه وسلم فقال ‏\"‏ بل ائتمروا بالمعروف وتناهوا عن المنكر حتى إذا رأيت شحا مطاعا وهوى متبعا ودنيا مؤثرة وإعجاب كل ذي رأى برأيه فعليك بخاصة نفسك ودع العوام فإن من ورائكم أياما الصبر فيهن مثل القبض على الجمر للعامل فيهن مثل أجر خمسين رجلا يعملون مثل عملكم ‏\"‏ ‏.‏ قال عبد الله بن المبارك وزادني غير عتبة قيل يا رسول الله أجر خمسين رجلا منا أو منهم قال ‏\"‏ لا بل أجر خمسين منكم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Narrated Abu Umayah Ash-Sha'bani:                     \"I went to Abu Tha'balah Al-Khushani and said to him: 'How do you deal with this Ayah?' He said: 'Which Ayah?' I said: 'Allah's saying: Take care of yourselves! If you follow the guidance no harm shall come to you (5:105).' He said: 'Well, by Allah! I asked one well-informed about it, I asked the Messenger of Allah (ﷺ) about it. [So] he said: \"Rather, comply with (and order) the good, and stay away from (and prohibit) the evil, until you see avarice obeyed, desires followed, and the world preferred, and everyone is amazed with his view. Then you should be worried about yourself in particular, and worry of the common folk. Ahead of you are the days in which patience is like holding onto an ember, for the doer (of righteous deeds) during them is the like of the reward of fifty of those who do the like of what you do.\" 'Abdullah bin Al-Mubarak said: \"It was added for me, by other than 'Utbah, that it was said: 'O Messenger of Allah! The reward of fifty men among us, or them?' He said: 'No! Rather the reward of fifty men among you.'\"",
      "chain": [
        "38240",
        "20025",
        "19928",
        "27030",
        "17556"
      ]
    },
    {
      "hadith_no": "4005",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا سعيد بن يعقوب الطالقاني، حدثنا أيوب بن جابر، عن سماك بن حرب، عن جابر بن سمرة، قال كان خاتم رسول الله صلى الله عليه وسلم - يعني الذي بين كتفيه غدة حمراء مثل بيضة الحمامة ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Jabir bin Samurah:                     \"The seal of the Messenger of Allah (ﷺ)\" - meaning the one which was between his two shoulder blades - \"was fleshy and red, resembling the egg of a pigeon.\"",
      "chain": [
        "38240",
        "25029",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "2310",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا سعيد بن يعقوب الطالقاني، قال حدثنا خالد، - وهو ابن عبد الله الواسطي - عن أبي مسلمة، عن أبي نضرة، عن أبي سعيد، قال كنا نسافر مع رسول الله صلى الله عليه وسلم فمنا الصائم ومنا المفطر ولا يعيب الصائم على المفطر ولا يعيب المفطر على الصائم ‏.‏",
      "text_en": " It was narrated that Abu Saeed said:                     \"We were traveling with the Prophet and among us were some who were fasting and some who were not criticize those who were not, and those who were not fasting did not criticize those who were.\"",
      "chain": [
        "38240",
        "20423",
        "10721",
        "38"
      ]
    }
  ],
  "total_hadiths": 7
}