{
  "id": "38349",
  "name": "'Abdul 'Aziz bin Yahya bin Yusuf عبد العزيز بن يحيى بن يوسف البكائي",
  "full_name": "'Abdul 'Aziz bin Yahya bin Yusuf عبد العزيز بن يحيى بن يوسف البكائي",
  "grade": "3rd Century AH [10th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "235",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Hiran"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ د  س  -  صدوق ]"
    ],
    "tags": [
      "al-Baka'i",
      "al-Hirani"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20733",
      "name": "al-Walid bin Muslim al-Quraishi الوليد بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20672",
      "name": "Muhammad bin Salmah محمد بن سلمة بن عبد الله الباهلي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20462",
      "name": "Mkhld bin Yazid al-Quraishi مخلد بن يزيد القرشي الحراني",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20405",
      "name": "Ibrahim bin Muhammad bin al-Harith إبراهيم بن محمد أبو اسحاق الفزاري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20446",
      "name": "'Atab bin Bashayr عتاب بن بشير",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "28402",
      "name": "Afyf bin Salm al-Mwsly عفيف بن سالم الموصلي البجلي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20347",
      "name": "'Isa bin Yonus bin Abi Ishaq عيسى بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "students": [
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "30170",
      "name": "Muhammad bin al-Muthna - al-Zaman محمد بن المثنى أبو موسى - الزمن",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30554",
      "name": "Abu Zara' al-Razi أبو زرعة الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "67",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن أبي شعيب، وعبد العزيز بن يحيى الحرانيان، قالا حدثنا محمد بن سلمة، عن محمد بن إسحاق، عن سليط بن أيوب، عن عبيد الله بن عبد الرحمن بن رافع الأنصاري، ثم العدوي عن أبي سعيد الخدري، قال سمعت رسول الله صلى الله عليه وسلم وهو يقال له إنه يستقى لك من بئر بضاعة وهي بئر يلقى فيها لحوم الكلاب والمحايض وعذر الناس ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الماء طهور لا ينجسه شىء ‏\"‏ ‏.‏ قال أبو داود وسمعت قتيبة بن سعيد قال سألت قيم بئر بضاعة عن عمقها قال أكثر ما يكون فيها الماء إلى العانة ‏.‏ قلت فإذا نقص قال دون العورة ‏.‏ قال أبو داود وقدرت أنا بئر بضاعة بردائي مددته عليها ثم ذرعته فإذا عرضها ستة أذرع وسألت الذي فتح لي باب البستان فأدخلني إليه هل غير بناؤها عما كانت عليه قال لا ‏.‏ ورأيت فيها ماء متغير اللون ‏.‏",
      "text_en": " Narrated AbuSa'id al-Khudri:                     I heard that the people asked the Prophet of Allah (ﷺ): Water is brought for you from the well of Buda'ah. It is a well in which dead dogs, menstrual clothes and excrement of people are thrown. The Messenger of Allah (ﷺ) replied: Verily water is pure and is not defiled by anything.Abu Dawud said I heard Qutaibah b. Sa'id say: I asked the person in charge of the well of Bud'ah about the depth of the well. He replied: At most the water reaches pubes. Then I asked: Where does it reach when its level goes down ? He replied: Below the private part of the body.Abu Dawud said: I measured the breadth of the well of Buda'ah with my sheet which I stretched over it. I them measured it with the hand. It measured six cubits in breadth. I then asked the man who opened the door of garden for me and admitted me to it: Has the condition of this well changed from what it had originally been in the past ? He replied: No. I saw the color of water in this well had changed.",
      "chain": [
        "30301",
        "38349",
        "20672",
        "11107",
        "12156",
        "38"
      ]
    },
    {
      "hadith_no": "117",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عبد العزيز بن يحيى الحراني، حدثنا محمد، - يعني ابن سلمة - عن محمد بن إسحاق، عن محمد بن طلحة بن يزيد بن ركانة، عن عبيد الله الخولاني، عن ابن عباس، قال دخل على علي - يعني ابن أبي طالب - وقد أهراق الماء فدعا بوضوء فأتيناه بتور فيه ماء حتى وضعناه بين يديه فقال يا ابن عباس ألا أريك كيف كان يتوضأ رسول الله صلى الله عليه وسلم قلت بلى ‏.‏ قال فأصغى الإناء على يده فغسلها ثم أدخل يده اليمنى فأفرغ بها على الأخرى ثم غسل كفيه ثم تمضمض واستنثر ثم أدخل يديه في الإناء جميعا فأخذ بهما حفنة من ماء فضرب بها على وجهه ثم ألقم إبهاميه ما أقبل من أذنيه ثم الثانية ثم الثالثة مثل ذلك ثم أخذ بكفه اليمنى قبضة من ماء فصبها على ناصيته فتركها تستن على وجهه ثم غسل ذراعيه إلى المرفقين ثلاثا ثلاثا ثم مسح رأسه وظهور أذنيه ثم أدخل يديه جميعا فأخذ حفنة من ماء فضرب بها على رجله وفيها النعل ففتلها بها ثم الأخرى مثل ذلك ‏.‏ قال قلت وفي النعلين قال وفي النعلين ‏.‏ قال قلت وفي النعلين قال وفي النعلين ‏.‏ قال قلت وفي النعلين قال وفي النعلين ‏.‏ قال أبو داود وحديث ابن جريج عن شيبة يشبه حديث علي لأنه قال فيه حجاج بن محمد عن ابن جريج ومسح برأسه مرة واحدة ‏.‏ وقال ابن وهب فيه عن ابن جريج ومسح برأسه ثلاثا ‏.‏",
      "text_en": " Ibn’Abbas said:                      ‘Ali b. Abi Talib entered upon me after he has passed water. He then called for water for ablution. We brought to him a vessel containing water, and placed it before him. He said: O Ibn’Abbas, may I not show you how the Messenger of Allah(ﷺ) used to perform ablution? I replied : Why not? He then inclined the vessel to his hand and washed it. He then put his right hand in the vessel and poured water over the other hand and washed his hands up to the wrist. He then rinsed his mouth and snuffed up water. He then put both of his hands together in the water and took out a handful of water and threw it upon the face. He then inserted both of his thumbs in the front part of the ears. He did like that twice and thrice. He then took a handful of water and poured it over his forehead and left it running down his face. He then washed his forearms up to the elbow three times. He then wiped his head and the back of his ears. He then put both of his hands together in the water and took a handful of it and threw it on his foot. He had a shoe foot like that. Do you wash your foot while it is in the shoe? He replied : Yes, while it is in the shoe. This question and answer were repeated thrice. Abu Dawud said: The version transmitted by Ibn Juraij from Shaibah is similar to the one narrated by ‘ Ali. In this version Hajjaj reported on the authority of Ibn Juraij the wording: He wiped his head once. Ibn Wahb narrated from Ibn Juraij the wording: he wiped his head three times.",
      "chain": [
        "38349",
        "20672",
        "11107",
        "13110",
        "11706",
        "17"
      ]
    },
    {
      "hadith_no": "295",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عبد العزيز بن يحيى، حدثني محمد بن سلمة، عن محمد بن إسحاق، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، أن سهلة بنت سهيل، استحيضت فأتت النبي صلى الله عليه وسلم فأمرها أن تغتسل عند كل صلاة فلما جهدها ذلك أمرها أن تجمع بين الظهر والعصر بغسل والمغرب والعشاء بغسل وتغتسل للصبح ‏.‏ قال أبو داود ورواه ابن عيينة عن عبد الرحمن بن القاسم عن أبيه أن امرأة استحيضت فسألت رسول الله صلى الله عليه وسلم فأمرها بمعناه ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     Sahlah daughter of Suhayl had a prolonged flow of blood. She came to the Prophet (ﷺ). He commanded her to take a bath for every prayer. When it became hard for her, he commanded her to combine the noon and afternoon prayers with one bath and the sunset and night prayer with one bath, and to take a bath (separately) for the dawn prayer.Abu Dawud said: Ibn 'Uyainah reported from 'Abd al-Rahman b. al-Qasim on the authority of his father, saying: A woman had a prolonged flow of blood. She asked the Prophet (ﷺ). He commanded her to the same effect.",
      "chain": [
        "38349",
        "20672",
        "11107",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "343",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا يزيد بن خالد بن يزيد بن عبد الله بن موهب الرملي الهمداني، ح وحدثنا عبد العزيز بن يحيى الحراني، قالا حدثنا محمد بن سلمة، ح وحدثنا موسى بن إسماعيل، حدثنا حماد، - وهذا حديث محمد بن سلمة - عن محمد بن إسحاق، عن محمد بن إبراهيم، عن أبي سلمة بن عبد الرحمن، - قال أبو داود قال يزيد وعبد العزيز في حديثهما عن أبي سلمة بن عبد الرحمن وأبي أمامة بن سهل - عن أبي سعيد الخدري وأبي هريرة قالا قال رسول الله صلى الله عليه وسلم ‏\"‏ من اغتسل يوم الجمعة ولبس من أحسن ثيابه ومس من طيب - إن كان عنده - ثم أتى الجمعة فلم يتخط أعناق الناس ثم صلى ما كتب الله له ثم أنصت إذا خرج إمامه حتى يفرغ من صلاته كانت كفارة لما بينها وبين جمعته التي قبلها ‏\"‏ ‏.‏ قال ويقول أبو هريرة ‏\"‏ وزيادة ثلاثة أيام ‏\"‏ ‏.‏ ويقول ‏\"‏ إن الحسنة بعشر أمثالها ‏\"‏ ‏.‏ قال أبو داود وحديث محمد بن سلمة أتم ولم يذكر حماد كلام أبي هريرة ‏.‏",
      "text_en": " Abu Sa'id al-Khudri and Abu Hurairah reported the Messenger of Allah (ﷺ) as saying:                      If anyone takes a bath on Friday, puts on his best clothes, applies a touch of perfume if has any, then goes to congregational prayer (in the mosque), and takes care not to step over people, then prayer what Allah has prescribes for him, then keeps silent from the time his Imam comes out until he finishes his prayer, it will atone for his sins during the previous week.Abu Hurairah said: (It will atone for his sins) for three days more. he further said: One is rewarded ten times for doing a good work.Abu Dawud said: The version narrated by Muhammad b. Salamah is perfect, and Hammad did not make a mention of the statement of Abu Hurairah.",
      "chain": [
        "38715",
        "38349",
        "20672",
        "20040",
        "20022",
        "11107",
        "11213",
        "10567",
        "38",
        "13"
      ]
    },
    {
      "hadith_no": "1359",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد العزيز بن يحيى الحراني، حدثني محمد بن سلمة، عن محمد بن إسحاق، عن محمد بن جعفر بن الزبير، عن عروة بن الزبير، عن عائشة، قالت ‏:‏ كان رسول الله صلى الله عليه وسلم يصلي ثلاث عشرة ركعة بركعتيه قبل الصبح ‏:‏ يصلي ستا مثنى مثنى، ويوتر بخمس لا يقعد بينهن إلا في آخرهن ‏.‏",
      "text_en": " Narrated 'Aishah:                     The Messenger of Allah (ﷺ) used to pray thirteen rak'ahs, observing six rak'ahs in pairs including the two rak'ahs of dawn prayer. He would observe witr and five rak'ahs. He sat only in the last of them.",
      "chain": [
        "38349",
        "20672",
        "11107",
        "11215",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1662",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا عبد العزيز بن يحيى الحراني، حدثني محمد بن سلمة، عن محمد بن إسحاق، عن محمد بن يحيى بن حبان، عن عمه، واسع بن حبان، عن جابر بن عبد الله، أن النبي صلى الله عليه وسلم أمر من كل جاد عشرة أوسق من التمر بقنو يعلق في المسجد للمساكين ‏.‏",
      "text_en": " Jabir bin ‘Abdallah said The bProphet (SWAS) commanded that he who plucks ten wasqs of dates from date palms should hang a bunch of dates in the mosque for the poor",
      "chain": [
        "38349",
        "20672",
        "11107",
        "11222",
        "1321",
        "34"
      ]
    },
    {
      "hadith_no": "2236",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا عبد العزيز بن يحيى الحراني، حدثني محمد، - يعني ابن سلمة - عن محمد بن إسحاق، عن أبي جعفر، وعن أبان بن صالح، عن مجاهد، وعن هشام بن عروة، عن أبيه، عن عائشة، أن بريرة، أعتقت وهي عند مغيث - عبد لآل أبي أحمد - فخيرها رسول الله صلى الله عليه وسلم وقال لها ‏\"‏ إن قربك فلا خيار لك ‏\"‏ ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     Barirah was emancipated, and she was the wife of Mughith, a slave of Aal AbuAhmad. The Messenger of Allah (ﷺ) gave her choice, and said to her: If he has intercourse with you, then there is no choice for you.",
      "chain": [
        "38349",
        "20672",
        "11107",
        "19897",
        "11028",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2246",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا عبد العزيز بن يحيى، حدثني محمد، - يعني ابن سلمة - عن محمد بن إسحاق، حدثني عباس بن سهل، عن أبيه، أن النبي صلى الله عليه وسلم قال لعاصم بن عدي ‏\"‏ أمسك المرأة عندك حتى تلد ‏\"‏ ‏.‏",
      "text_en": " ‘Abbas bin Sahl reported on the authority of his father “The Prophet (ﷺ) said to ‘Asim bin ‘Adl. Keep the woman with you till she begets the child.",
      "chain": [
        "38349",
        "20672",
        "11107",
        "11697",
        "399"
      ]
    },
    {
      "hadith_no": "2700",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا عبد العزيز بن يحيى الحراني، حدثني محمد، - يعني ابن سلمة - عن محمد بن إسحاق، عن أبان بن صالح، عن منصور بن المعتمر، عن ربعي بن حراش، عن علي بن أبي طالب، قال خرج عبدان إلى رسول الله صلى الله عليه وسلم - يعني يوم الحديبية - قبل الصلح فكتب إليه مواليهم فقالوا يا محمد والله ما خرجوا إليك رغبة في دينك وإنما خرجوا هربا من الرق فقال ناس صدقوا يا رسول الله ردهم إليهم ‏.‏ فغضب رسول الله صلى الله عليه وسلم وقال ‏\"‏ ما أراكم تنتهون يا معشر قريش حتى يبعث الله عليكم من يضرب رقابكم على هذا ‏\"‏ ‏.‏ وأبى أن يردهم وقال ‏\"‏ هم عتقاء الله عز وجل ‏\"‏ ‏.‏",
      "text_en": " Narrated Ali ibn AbuTalib:                     Some slaves (of the unbelievers) went out to the Messenger of Allah (ﷺ) on the day of al-Hudaybiyyah before treaty. Their masters wrote to him saying: O Muhammad, they have not gone out to you with an interest in your religion, but they have gone out to escape from slavery. Some people said: They have spoken the truth, Messenger of Allah, send them back to them. The Messenger of Allah (ﷺ) became angry and said: I do not see your restraining yourself from this action), group of Quraysh, but that Allah send someone to you who strike your necks. He then refused to return them, and said: They are emancipated (slaves) of Allah, the Exalted.",
      "chain": [
        "38349",
        "20672",
        "11107",
        "19897",
        "11067",
        "11334",
        "5"
      ]
    },
    {
      "hadith_no": "3094",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا عبد العزيز بن يحيى، حدثنا محمد بن سلمة، عن محمد بن إسحاق، عن الزهري، عن عروة، عن أسامة بن زيد، قال خرج رسول الله صلى الله عليه وسلم يعود عبد الله بن أبى في مرضه الذي مات فيه فلما دخل عليه عرف فيه الموت قال ‏\"‏ قد كنت أنهاك عن حب يهود ‏\"‏ ‏.‏ قال فقد أبغضهم أسعد بن زرارة فمه فلما مات أتاه ابنه فقال يا رسول الله إن عبد الله بن أبى قد مات فأعطني قميصك أكفنه فيه ‏.‏ فنزع رسول الله صلى الله عليه وسلم قميصه فأعطاه إياه ‏.‏",
      "text_en": " Narrated Usamah b. Zaid:                     The Messenger of Allah (ﷺ) went out to visit 'Abd Allah b. Ubayy during his illness of which he died. When he entered upon him, he realised death on him. He said: I used to forbid you from the love of Jews. He ('Abd Allah) said: As'ad b. Zurarah hated them. So what (the benefited) ? When he died, his son came and said: Prophet of Allah, 'Abd Allah b. Ubayy has died, give me your shirt, so that I shroud him in it. The Messenger of Allah (ﷺ) took off his shirt and gave it to him.",
      "chain": [
        "38349",
        "20672",
        "11107",
        "11013",
        "10511",
        "50"
      ]
    },
    {
      "hadith_no": "3199",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا عبد العزيز بن يحيى الحراني، حدثني محمد، - يعني ابن سلمة - عن محمد بن إسحاق، عن محمد بن إبراهيم، عن أبي سلمة بن عبد الرحمن، عن أبي هريرة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إذا صليتم على الميت فأخلصوا له الدعاء ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: When you pray over the dead, make a sincere supplication for him.",
      "chain": [
        "38349",
        "20672",
        "11107",
        "11213",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "4525",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا عبد العزيز بن يحيى الحراني، حدثني محمد، - يعني ابن سلمة - عن محمد بن إسحاق، عن محمد بن إبراهيم بن الحارث، عن عبد الرحمن بن بجيد، قال إن سهلا والله أوهم الحديث إن رسول الله صلى الله عليه وسلم كتب إلى يهود ‏\"‏ أنه قد وجد بين أظهركم قتيل فدوه ‏\"‏ ‏.‏ فكتبوا يحلفون بالله خمسين يمينا ما قتلناه ولا علمنا قاتلا ‏.‏ قال فوداه رسول الله صلى الله عليه وسلم من عنده مائة ناقة ‏.‏",
      "text_en": " Narrated 'Abd al-Rahman b. Bujaid:                     I swear by Allah, Sahl had a misunderstanding about this tradition. The Messenger of Allah (ﷺ) wrote to the Jews: A slain man has been found amongnst you, so pay his bloodwit. They wrote (to him): Swearing by Allah fifty oaths, we neither killed him nor do we know his slayer. He said: Then the Messenger of Allah (ﷺ) himself paid his bloodwit which consisted of one hundred she-camels.",
      "chain": [
        "38349",
        "20672",
        "11107",
        "11213",
        "5145"
      ]
    },
    {
      "hadith_no": "4670",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا عبد العزيز بن يحيى الحراني، قال حدثني محمد بن سلمة، عن محمد بن إسحاق، عن إسماعيل بن أبي حكيم، عن القاسم بن محمد، عن عبد الله بن جعفر، قال كان رسول الله صلى الله عليه وسلم يقول ‏\"‏ ما ينبغي لنبي أن يقول إني خير من يونس بن متى ‏\"‏ ‏.‏",
      "text_en": " ‘Abd Allah b. Ja’far reported the Messenger of Allah (May peace be upon him) as saying:                      It is not fitting for a prophet to say : I am better than Jonah son of matta.",
      "chain": [
        "38349",
        "20672",
        "11107",
        "11828",
        "10535",
        "108"
      ]
    },
    {
      "hadith_no": "4837",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا عبد العزيز بن يحيى الحراني، قال حدثني محمد، - يعني ابن سلمة - عن محمد بن إسحاق، عن يعقوب بن عتبة، عن عمر بن عبد العزيز، عن يوسف بن عبد الله بن سلام، عن أبيه، قال كان رسول الله صلى الله عليه وسلم إذا جلس يتحدث يكثر أن يرفع طرفه إلى السماء ‏.‏",
      "text_en": " Narrated Abdullah ibn Salam:                     When the Messenger of Allah (ﷺ) sat talking (to the people), he would often raise his eyes to the sky.",
      "chain": [
        "38349",
        "20672",
        "11107",
        "19192",
        "11010",
        "5335",
        "103"
      ]
    }
  ],
  "total_hadiths": 14
}