{
  "id": "38363",
  "name": "Abd al-Whab bin Njd'h عبد الوهاب بن نجدة",
  "full_name": "Abd al-Whab bin Njd'h عبد الوهاب بن نجدة",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "232",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ د  س  -  ثقة ]"
    ],
    "tags": [],
    "area_of_interest_display": [
      {
        "en": "Narrator[Grade:Thiqah] [ د  س  -  ثقة ]",
        "ar": "Narrator[Grade:Thiqah] [ د  س  -  ثقة ]",
        "ckb": "Narrator[Grade:Thiqah] [ د  س  -  ثقة ]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "NA",
        "ar": "NA",
        "ckb": "NA"
      }
    ],
    "tags_display": []
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "id": "sunan-abi-daud-655",
      "hadith_no": "655",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الوهاب بن نجدة، حدثنا بقية، وشعيب بن إسحاق، عن الأوزاعي، حدثني محمد بن الوليد، عن سعيد بن أبي سعيد، عن أبيه، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا صلى أحدكم فخلع نعليه فلا يؤذ بهما أحدا ليجعلهما بين رجليه أو ليصل فيهما ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the Messenger of Allah (ﷺ) as saying:                      when any of you prays and takes off his sandals, he should not harm anyone by them. He should place them between his feet or pray with them on",
      "usc_msa_ref": "",
      "chain": [
        "38363",
        "20644",
        "20239",
        "20024",
        "20459",
        "11168",
        "11212",
        "13"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-908",
      "hadith_no": "908",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الوهاب بن نجدة، حدثنا محمد بن يوسف الفريابي، عن يونس بن أبي إسحاق، عن أبي إسحاق، عن الحارث، عن علي، - رضى الله عنه - قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يا علي لا تفتح على الإمام في الصلاة ‏\"‏ ‏.‏ قال أبو داود أبو إسحاق لم يسمع من الحارث إلا أربعة أحاديث ليس هذا منها ‏.‏",
      "text_en": " Narrated Ali ibn AbuTalib:                     The Messenger of Allah (ﷺ) said: Ali, do not instruct the imam during the prayer.Abu Dawud said: The narrator Abu Ishaq heard only for traditions from al-Harith, this tradition is not one of them.",
      "usc_msa_ref": "",
      "chain": [
        "38363",
        "20034",
        "10846",
        "11049",
        "5"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-1007",
      "hadith_no": "1007",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الوهاب بن نجدة، حدثنا أشعث بن شعبة، عن المنهال بن خليفة، عن الأزرق بن قيس، قال صلى بنا إمام لنا يكنى أبا رمثة فقال صليت هذه الصلاة - أو مثل هذه الصلاة - مع النبي صلى الله عليه وسلم ‏.‏ قال وكان أبو بكر وعمر يقومان في الصف المقدم عن يمينه وكان رجل قد شهد التكبيرة الأولى من الصلاة فصلى نبي الله صلى الله عليه وسلم ثم سلم عن يمينه وعن يساره حتى رأينا بياض خديه ثم انفتل كانفتال أبي رمثة - يعني نفسه - فقام الرجل الذي أدرك معه التكبيرة الأولى من الصلاة يشفع فوثب إليه عمر فأخذ بمنكبه فهزه ثم قال اجلس فإنه لم يهلك أهل الكتاب إلا أنه لم يكن بين صلواتهم فصل ‏.‏ فرفع النبي صلى الله عليه وسلم بصره فقال ‏\"‏ أصاب الله بك يا ابن الخطاب ‏\"‏ ‏.‏ قال أبو داود وقد قيل أبو أمية مكان أبي رمثة ‏.‏",
      "text_en": " Narrated Al-Azraq ibn Qays:                     An imam of ours, whose kunyah (surname) was AbuRimthah, led us in prayer and said: I prayed this prayer, or one like it, with the Prophet (ﷺ). AbuBakr and Umar were standing in the front row on his right and there was a man who had been present at the first takbir in the prayer. The Prophet of Allah (ﷺ) offered the prayer, then gave the salutation to his right and his left so that we saw the whiteness of his cheeks, then turned away as AbuRimthah (meaning himself) had done.  The man who has been present with him at the first takbir in the prayer then got up to pray another prayer, whereupon Umar leaped up and, seizing him by the shoulders, shook him and said: Sit down, for the People of the Book perished for no other reason than that there was no interval between their prayers.  The Prophet (ﷺ) raised his eyes and said: Allah has made you say what is right, son of al-Khattab.Abu Dawud said: Sometimes the name of Abu Umayyah is narrated instead of Abu Rimthah.",
      "usc_msa_ref": "",
      "chain": [
        "38363",
        "28050",
        "25316",
        "11574"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-1433",
      "hadith_no": "1433",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الوهاب بن نجدة، حدثنا أبو اليمان، عن صفوان بن عمرو، عن أبي إدريس السكوني، عن جبير بن نفير، عن أبي الدرداء، قال ‏\"‏ أوصاني خليلي صلى الله عليه وسلم بثلاث لا أدعهن لشىء أوصاني بصيام ثلاثة أيام من كل شهر ولا أنام إلا على وتر وبسبحة الضحى في الحضر والسفر ‏.‏",
      "text_en": " Abu Al-Darda' said:                      My friend (i.e. \tthe Prophet) instructed me to observe three practices which I never leave: he instructed me to fast three days every month, and not to sleep but after observing the with, and to observe supererogatory prayer in the forenoon while traveling and while resident.",
      "usc_msa_ref": "",
      "chain": [
        "38363",
        "30330",
        "10921",
        "19204",
        "4097",
        "37"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-1802",
      "hadith_no": "1802",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا عبد الوهاب بن نجدة، حدثنا شعيب بن إسحاق، عن ابن جريج، ح حدثنا أبو بكر بن خلاد، حدثنا يحيى، - المعنى - عن ابن جريج، أخبرني الحسن بن مسلم، عن طاوس، عن ابن عباس، أن معاوية بن أبي سفيان، أخبره قال قصرت عن النبي صلى الله عليه وسلم بمشقص على المروة ‏.‏ أو رأيته يقصر عنه على المروة بمشقص ‏.‏ قال ابن خلاد إن معاوية لم يذكر أخبره ‏.‏",
      "text_en": " Ibn ‘Abbas said that Mu’awiyah reported to him I clipped some hair of the Prophet’s(ﷺ) head with a broad iron arrowhead at Al Marwah; or (he said) I saw him that the hair of his head was clipped with a broad iron arrowhead at Al Marwah.The narrator Ibn Khallad said in his version “Mu’awiyah said” and not the word “reported”.",
      "usc_msa_ref": "",
      "chain": [
        "38363",
        "20239",
        "11070",
        "30357",
        "11070",
        "11557",
        "11053",
        "17",
        "27"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-2499",
      "hadith_no": "2499",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا عبد الوهاب بن نجدة، حدثنا بقية بن الوليد، عن ابن ثوبان، عن أبيه، يرد إلى مكحول إلى عبد الرحمن بن غنم الأشعري أن أبا مالك الأشعري، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من فصل في سبيل الله فمات أو قتل فهو شهيد أو وقصه فرسه أو بعيره أو لدغته هامة أو مات على فراشه أو بأى حتف شاء الله فإنه شهيد وإن له الجنة ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuMalik al-Ash'ari:                     AbuMalik heard the Messenger of Allah (ﷺ) say: He who goes forth in Allah's path and dies or is killed is a martyr, or has his neck broken through being thrown by his horse or by his camel, or is stung by a poisonous creature, or dies on his bed by any kind of death Allah wishes is a martyr and will go to Paradise.",
      "usc_msa_ref": "",
      "chain": [
        "38363",
        "20644"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-2567",
      "hadith_no": "2567",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا عبد الوهاب بن نجدة، حدثنا ابن عياش، عن يحيى بن أبي عمرو السيباني، عن ابن أبي مريم، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إياكم أن تتخذوا ظهور دوابكم منابر فإن الله إنما سخرها لكم لتبلغكم إلى بلد لم تكونوا بالغيه إلا بشق الأنفس وجعل لكم الأرض فعليها فاقضوا حاجتكم ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the Prophet(ﷺ) as saying “Do not treat the backs of your beasts as pulpits, for Allaah has made them subject to you only to convey you to a town which you cannot reach without difficulty and He has appointed the earth (a floor to work) for you, so conduct your business on it.",
      "usc_msa_ref": "",
      "chain": [
        "38363",
        "19154",
        "30232",
        "13"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-2741",
      "hadith_no": "2741",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا عبد الوهاب بن نجدة، حدثنا الوليد بن مسلم، ح وحدثنا موسى بن عبد الرحمن الأنطاكي، قال حدثنا مبشر، ح وحدثنا محمد بن عوف الطائي، أن الحكم بن نافع، حدثهم - المعنى، - كلهم عن شعيب بن أبي حمزة، عن نافع، عن ابن عمر، قال بعثنا رسول الله صلى الله عليه وسلم في جيش قبل نجد وانبعثت سرية من الجيش فكان سهمان الجيش اثنى عشر بعيرا اثنى عشر بعيرا ونفل أهل السرية بعيرا بعيرا فكانت سهمانهم ثلاثة عشر ثلاثة عشر ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     The Messenger of Allah (ﷺ) sent us along with an army towards Najd, and he sent a detachment of that army (to face the enemy). The whole army got twelve camels per head as their portion, but he gave the detachment one additional camel (apart from the division made to the army). Thus they got thirteen camels each (as a reward).",
      "usc_msa_ref": "",
      "chain": [
        "38363",
        "20733",
        "38656",
        "20461",
        "38566",
        "30330",
        "20428",
        "11014",
        "18"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-2870",
      "hadith_no": "2870",
      "source": "Sunan Abi Da'ud",
      "chapter": "Wills (Kitab Al-Wasaya) - كتاب الوصايا",
      "chapter_no": "18",
      "text_ar": "حدثنا عبد الوهاب بن نجدة، حدثنا ابن عياش، عن شرحبيل بن مسلم، سمعت أبا أمامة، سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن الله قد أعطى كل ذي حق حقه فلا وصية لوارث ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     I heard the Messenger of Allah (ﷺ) say: Allah has appointed for everyone who has a right what is due to him, and no bequest must be made to an heir.",
      "usc_msa_ref": "",
      "chain": [
        "38363",
        "17036",
        "4048"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-3206",
      "hadith_no": "3206",
      "source": "Sunan Abi Da'ud",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا عبد الوهاب بن نجدة، حدثنا سعيد بن سالم، ح وحدثنا يحيى بن الفضل السجستاني، حدثنا حاتم، - يعني ابن إسماعيل - بمعناه عن كثير بن زيد المدني، عن المطلب، قال لما مات عثمان بن مظعون أخرج بجنازته فدفن أمر النبي صلى الله عليه وسلم رجلا أن يأتيه بحجر فلم يستطع حمله فقام إليها رسول الله صلى الله عليه وسلم وحسر عن ذراعيه - قال كثير قال المطلب قال الذي يخبرني ذلك عن رسول الله صلى الله عليه وسلم قال - كأني أنظر إلى بياض ذراعى رسول الله صلى الله عليه وسلم حين حسر عنهما ثم حملها فوضعها عند رأسه وقال ‏\"‏ أتعلم بها قبر أخي وأدفن إليه من مات من أهلي ‏\"‏ ‏.‏",
      "text_en": " Narrated Al-Muttalib:                     When Uthman ibn Maz'un died, he was brought out on his bier and buried. The Prophet (ﷺ) ordered a man to bring him a stone, but he was unable to carry it. The Messenger of Allah (ﷺ) got up and going over to it rolled up his sleeves. The narrator Kathir told that al-Muttalib remarked: The one who told me about the Messenger of Allah (ﷺ) said: I still seem to see the whiteness of the forearms of the Messenger of Allah (ﷺ) when he rolled up his sleeves. He then carried it and placed it at his head saying: I am marking my brother's grave with it, and I shall bury beside him those of my family who die.",
      "usc_msa_ref": "",
      "chain": [
        "38363",
        "23020",
        "20159",
        "22171"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-3565",
      "hadith_no": "3565",
      "source": "Sunan Abi Da'ud",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا عبد الوهاب بن نجدة الحوطي، حدثنا ابن عياش، عن شرحبيل بن مسلم، قال سمعت أبا أمامة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن الله عز وجل قد أعطى كل ذي حق حقه فلا وصية لوارث ولا تنفق المرأة شيئا من بيتها إلا بإذن زوجها ‏\"‏ ‏.‏ فقيل يا رسول الله ولا الطعام قال ‏\"‏ ذاك أفضل أموالنا ‏\"‏ ‏.‏ ثم قال ‏\"‏ العارية مؤداة والمنحة مردودة والدين مقضي والزعيم غارم ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuUmamah:                     I heard the Messenger of Allah (ﷺ) Said: Allah , Most Exalted, has appointed for everyone who has a right what is due to him, and no will be made to an heir, and a woman should not spend anything from her house except with the permission of her husband. He was asked: Even foodgrain, Messenger of Allah? He replied: That is the best of our property. He then said: A loan must be paid back, a she-camel lent for a time for milking must be returned, a debt must be discharged, one who stands surety is held responsible.",
      "usc_msa_ref": "",
      "chain": [
        "38363",
        "17036",
        "4048"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-3627",
      "hadith_no": "3627",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد الوهاب بن نجدة، وموسى بن مروان الرقي، قالا حدثنا بقية بن الوليد، عن بحير بن سعد، عن خالد بن معدان، عن سيف، عن عوف بن مالك، أنه حدثهم أن النبي صلى الله عليه وسلم قضى بين رجلين ‏.‏ فقال المقضي عليه لما أدبر حسبي الله ونعم الوكيل ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ إن الله يلوم على العجز ولكن عليك بالكيس فإذا غلبك أمر فقل حسبي الله ونعم الوكيل ‏\"‏ ‏.‏",
      "text_en": " Narrated Awf ibn Malik:                     The Holy Prophet (ﷺ) gave a decision between two men, and the one against whom the decision was given turned away and said: For me Allah sufficeth, and He is the best dispenser of affairs. The Holy Prophet (ﷺ) said: Allah, Most High, blames for falling short, but apply intelligence, and when the matter gets the better of you, say; For me Allah sufficeth, and He is the best disposer of affairs.",
      "usc_msa_ref": "",
      "chain": [
        "38363",
        "35154",
        "20644",
        "11422",
        "11558",
        "10805"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-3966",
      "hadith_no": "3966",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Book of Manumission of Slaves - كتاب العتق",
      "chapter_no": "31",
      "text_ar": "حدثنا عبد الوهاب بن نجدة، حدثنا بقية، حدثنا صفوان بن عمرو، حدثني سليم بن عامر، عن شرحبيل بن السمط، أنه قال لعمرو بن عبسة حدثنا حديثا، سمعته من، رسول الله صلى الله عليه وسلم قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من أعتق رقبة مؤمنة كانت فداءه من النار ‏\"‏ ‏.‏",
      "text_en": " Amr ibn Abasah, said that Marrah ibn Ka'b said:                      I heard the Messenger of Allah (ﷺ) say: If anyone emancipates a Muslim slave, that will be his ransom from Jahannam.",
      "usc_msa_ref": "",
      "chain": [
        "38363",
        "20644",
        "10921",
        "10915",
        "6225"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-4039",
      "hadith_no": "4039",
      "source": "Sunan Abi Da'ud",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا عبد الوهاب بن نجدة، حدثنا بشر بن بكر، عن عبد الرحمن بن يزيد بن جابر، حدثنا عطية بن قيس، قال سمعت عبد الرحمن بن غنم الأشعري، قال حدثني أبو عامر، أو أبو مالك - والله يمين أخرى ما كذبني - أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ ليكونن من أمتي أقوام يستحلون الخز والحرير ‏\"‏ ‏.‏ وذكر كلاما قال ‏\"‏ يمسخ منهم آخرون قردة وخنازير إلى يوم القيامة ‏\"‏ ‏.‏ قال أبو داود وعشرون نفسا من أصحاب رسول الله صلى الله عليه وسلم أو أكثر لبسوا الخز منهم أنس والبراء بن عازب ‏.‏",
      "text_en": " Narrated Abdur Rahman ibn Ghanam al-Ash'ari:                     Abu Amir or Abu Malik told me--I swear by Allah another oath that he did not believe me that he heard the Messenger of Allah (ﷺ) say: There will be among my community people who will make lawful (the use of) khazz and silk. Some of them will be transformed into apes and swine.Abu Dawud said: Twenty Companions of the Messenger of Allah (ﷺ) or more put on khazz. Anas and al-Bara' b. 'Azib were among them.",
      "usc_msa_ref": "",
      "chain": [
        "38363",
        "20413",
        "20395",
        "10877",
        "5152"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-4301",
      "hadith_no": "4301",
      "source": "Sunan Abi Da'ud",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا عبد الوهاب بن نجدة، حدثنا إسماعيل، ح وحدثنا هارون بن عبد الله، حدثنا الحسن بن سوار، حدثنا إسماعيل، حدثنا سليمان بن سليم، عن يحيى بن جابر الطائي، - قال هارون في حديثه - عن عوف بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لن يجمع الله على هذه الأمة سيفين سيفا منها وسيفا من عدوها ‏\"‏ ‏.‏",
      "text_en": " Narrated Awf ibn Malik:                     The Prophet (ﷺ) said: Allah will not gather two swords upon this community: Its own sword and the sword of its enemy.",
      "usc_msa_ref": "",
      "chain": [
        "38363",
        "30103",
        "30524",
        "28100",
        "11418",
        "20730",
        "10978",
        "10805"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-4382",
      "hadith_no": "4382",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا عبد الوهاب بن نجدة، حدثنا بقية، حدثنا صفوان، حدثنا أزهر بن عبد الله الحرازي، أن قوما، من الكلاعيين سرق لهم متاع فاتهموا أناسا من الحاكة فأتوا النعمان بن بشير صاحب النبي صلى الله عليه وسلم فحبسهم أياما ثم خلى سبيلهم فأتوا النعمان فقالوا خليت سبيلهم بغير ضرب ولا امتحان ‏.‏ فقال النعمان ما شئتم إن شئتم أن أضربهم فإن خرج متاعكم فذاك وإلا أخذت من ظهوركم مثل ما أخذت من ظهورهم ‏.‏ فقالوا هذا حكمك فقال هذا حكم الله وحكم رسوله صلى الله عليه وسلم ‏.‏ قال أبو داود إنما أرهبهم بهذا القول أى لا يجب الضرب إلا بعد الاعتراف ‏.‏",
      "text_en": " Azhar ibn Abdullah al-Harari said:                      Some goods of the people of Kila' were stolen. They accused some men of the weavers (of theft). They came to an-Nu'man ibn Bashir, the companion of the Prophet (ﷺ). He confined them for some days and then set them free.  They came to an-Nu'man and said: You have set them free without beating and investigation. An-Nu'man said: What do you want? You want me to beat them. If your goods are found with them, then it is all right; otherwise, I shall take (retaliation) from your back as I have taken from their backs.  They asked: Is this your decision?  He said: This is the decision of Allah and His Apostle (ﷺ).Abu Dawud said: By this statement he frightened them ; that is, beating is not necessary except after acknowledgement.",
      "usc_msa_ref": "",
      "chain": [
        "38363",
        "20644",
        "10921",
        "18019"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-4604",
      "hadith_no": "4604",
      "source": "Sunan Abi Da'ud",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا عبد الوهاب بن نجدة، حدثنا أبو عمرو بن كثير بن دينار، عن حريز بن عثمان، عن عبد الرحمن بن أبي عوف، عن المقدام بن معديكرب، عن رسول الله صلى الله عليه وسلم أنه قال ‏\"‏ ألا إني أوتيت الكتاب ومثله معه ألا يوشك رجل شبعان على أريكته يقول عليكم بهذا القرآن فما وجدتم فيه من حلال فأحلوه وما وجدتم فيه من حرام فحرموه ألا لا يحل لكم لحم الحمار الأهلي ولا كل ذي ناب من السبع ولا لقطة معاهد إلا أن يستغني عنها صاحبها ومن نزل بقوم فعليهم أن يقروه فإن لم يقروه فله أن يعقبهم بمثل قراه ‏\"‏ ‏.‏",
      "text_en": " Narrated Al-Miqdam ibn Ma'dikarib:                     The Prophet (ﷺ) said: Beware! I have been given the Qur'an and something like it, yet the time is coming when a man replete on his couch will say: Keep to the Qur'an; what you find in it to be permissible treat as permissible, and what you find in it to be prohibited treat as prohibited. Beware! The domestic ass, beasts of prey with fangs, a find belonging to confederate, unless its owner does not want it, are not permissible to you If anyone comes to some people, they must entertain him, but if they do not, he has a right to mulct them to an amount equivalent to his entertainment.",
      "usc_msa_ref": "",
      "chain": [
        "38363",
        "11684",
        "18639"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-4712",
      "hadith_no": "4712",
      "source": "Sunan Abi Da'ud",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا عبد الوهاب بن نجدة، حدثنا بقية، ح وحدثنا موسى بن مروان الرقي، وكثير بن عبيد المذحجي، قالا حدثنا محمد بن حرب، - المعنى - عن محمد بن زياد، عن عبد الله بن أبي قيس، عن عائشة، قالت قلت يا رسول الله ذراري المؤمنين فقال ‏\"‏ هم من آبائهم ‏\"‏ ‏.‏ فقلت يا رسول الله بلا عمل قال ‏\"‏ الله أعلم بما كانوا عاملين ‏\"‏ ‏.‏ قلت يا رسول الله فذراري المشركين قال ‏\"‏ من آبائهم ‏\"‏ ‏.‏ قلت بلا عمل قال ‏\"‏ الله أعلم بما كانوا عاملين ‏\"‏ ‏.‏",
      "text_en": " ‘A’ishah said :                      I said : Messenger of Allah (May peace be upon him) what happens to the offspring of believers ? He replied : They are joined to their parents. I asked : Messenger of Allah! Although they have done nothing ? He replied : Allah knows best what they were doing. I asked : what happens to the offspring of polytheists, Messenger of Allah ? he replied! They are joined to their parents. I asked : Although they have done nothing? He replied : Allah knows best what they were doing.",
      "usc_msa_ref": "",
      "chain": [
        "38363",
        "20644",
        "35154",
        "38462",
        "30373",
        "11216",
        "11515",
        "53"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    }
  ],
  "total_hadiths": 18,
  "grade_display": {
    "en": "3rd Century AH [10th Generation]",
    "ar": "القرن الثالث الهجري [الجيل العاشر]",
    "ckb": "سەدەی سێیەمی كۆچی [نەوەی دەیەم]"
  }
}