{
  "id": "38371",
  "name": "'Ubaidullah bin Muhammad al-'Aishi عبيد الله بن محمد بن حفص العيشي",
  "full_name": "'Ubaidullah bin Muhammad al-'Aishi عبيد الله بن محمد بن حفص العيشي",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "228",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ د  ت  س  -  ثقة ]"
    ],
    "tags": [
      "B.Taym",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "1797",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا علي بن عيسى بن يزيد البغدادي، حدثنا عبيد الله بن محمد العيشي، حدثنا حماد بن سلمة، عن أيوب، وقتادة، عن أبي قلابة، عن أبي أسماء الرحبي، عن أبي ثعلبة الخشني، أنه قال يا رسول الله إنا بأرض أهل الكتاب فنطبخ في قدورهم ونشرب في آنيتهم ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن لم تجدوا غيرها فارحضوها بالماء ‏\"‏ ‏.‏ ثم قال يا رسول الله إنا بأرض صيد فكيف نصنع قال ‏\"‏ إذا أرسلت كلبك المكلب وذكرت اسم الله فقتل فكل وإن كان غير مكلب فذكي فكل وإذا رميت بسهمك وذكرت اسم الله فقتل فكل ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Abu Tha'labah Al-Khushani:                     That he said: \"O Messenger of Allah! We live in a land of the People of Book and we cook in their containers, and drink in their vessels.\" The Messenger of Allah (ﷺ) said: \"If you do not find other than them, then rinse them with water.\"The he said: \"O Messenger of Allah! We live in a land of game, so what should we do ?\" He said: \"When you send your trained dog, and you mentioned the Name of Allah, and he kills it, then eat it. And when you shoot it with your bow, and it is killed, then eat it.'\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.",
      "chain": [
        "38371",
        "20021",
        "11015",
        "11019",
        "11047",
        "10883",
        "4056"
      ]
    }
  ],
  "total_hadiths": 1
}