{
  "id": "38402",
  "name": "'Ali bin Salmah bin 'Uqba علي بن سلمة بن عقبة القرشي اللبقي",
  "full_name": "'Ali bin Salmah bin 'Uqba علي بن سلمة بن عقبة القرشي اللبقي",
  "grade": "3rd Century AH [11th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "252",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Nisapur"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ ق  -  صدوق ]"
    ],
    "tags": [
      "Quraish",
      "al-Nisapuri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20650",
      "name": "Zayd bin al-Habab al-'Akli زيد بن الحباب أبو الحسين العكلي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20333",
      "name": "'Abdur Rahman bin Muhammad al-Maharbi عبد الرحمن بن محمد بن زياد المحاربي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20201",
      "name": "Marwan bin Mua'wiya al-Fazari مروان بن معاوية الفزاري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20609",
      "name": "Mua'wiya bin Hisham al-Qsar معاوية بن هشام القصار",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20291",
      "name": "al-Nadr bin Shumayl al-Maazni النضر بن شميل المازني أبو الحسن النحوي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20557",
      "name": "Abd al-Whab bin Ata'a عبد الوهاب بن عطاء الخفاف أبو نصر",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20184",
      "name": "Ya'qub bin Ibrahim bin Sa'd يعقوب بن إبراهيم بن سعد بن إبراهيم",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30472",
      "name": "'Ali bin 'Atham bin 'Ali علي بن عثام",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "students": [
    {
      "id": "30004",
      "name": "Ibn Maja ابن ماجة",
      "grade": "3rd Century AH [12th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "4656",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا علي بن سلمة، حدثنا مالك بن سعير، حدثنا هشام، عن أبيه، عن عائشة  رضى الله عنها  أنزلت هذه الآية ‏{‏لا يؤاخذكم الله باللغو في أيمانكم‏}‏ في قول الرجل لا والله، وبلى والله‏.‏",
      "text_en": " Narrated `Aisha:                     This Verse: \"Allah will not punish you for what is unintentional in your oaths.\" (5.89) was revealed about a man's state men (during his talk), \"No, by Allah,\" and \"Yes, by Allah.\"",
      "chain": [
        "38402",
        "20460",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2136",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Divorce - كتاب الطلاق",
      "chapter_no": "10",
      "text_ar": "حدثنا علي بن سلمة النيسابوري، حدثنا يعقوب بن إبراهيم بن سعد، حدثنا أبي، عن ابن إسحاق، أخبرني عبادة بن الوليد بن عبادة بن الصامت، عن الربيع بنت معوذ ابن عفراء، قال قلت لها حدثيني حديثك، ‏.‏ قالت اختلعت من زوجي ثم جئت عثمان ‏.‏ فسألت ماذا على من العدة فقال لا عدة عليك إلا أن يكون حديث عهد بك فتمكثين عنده حتى تحيضين حيضة ‏.‏ قالت وإنما تبع في ذلك قضاء رسول الله  صلى الله عليه وسلم  في مريم المغالية ‏.‏ وكانت تحت ثابت بن قيس فاختلعت منه ‏.‏",
      "text_en": " It was narrated from 'Ubadah bin Samit from Rubai' bint Mu'awwidh bin 'Afra'.:                     He said: \"I said to her: 'Tell me your Hadith.' She said: 'I got Khul' from my husband, then I came to 'Uthman and asked him: \"What waiting period do I have to observe?\" He said: \"You do not have to observe any waiting period, unless you had intercourse with him recently, in which case you should stay with him until you have menstruated.\" In that he was following the ruling of the Messenger of Allah (ﷺ) concerning Maryam Maghaliyyah, who was married to Thabit bin Qais and she got Khul' from him.' \"",
      "chain": [
        "38402",
        "20184",
        "20150",
        "11107",
        "12201",
        "617"
      ]
    },
    {
      "hadith_no": "2148",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Divorce - كتاب الطلاق",
      "chapter_no": "10",
      "text_ar": "حدثنا علي بن سلمة النيسابوري، حدثنا يعقوب بن إبراهيم بن سعد، حدثنا أبي، عن ابن إسحاق، قال ذكر طلحة بن نافع عن سعيد بن جبير، عن ابن عباس، قال تزوج رجل من الأنصار امرأة من بلعجلان فدخل بها فبات عندها فلما أصبح قال ما وجدتها عذراء فرفع شأنها إلى النبي  صلى الله عليه وسلم  فدعا الجارية فسألها فقالت بلى قد كنت عذراء ‏.‏ فأمر بهما فتلاعنا وأعطاها المهر ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"A man from among the Ansar manried a wornan from Bal'ijlan. He entered upon her and spent the night with her, then in the morning he said: 'I did not find her to be a virgin.' Her case was taken to the Prophet (ﷺ), and he called the girl and asked her. She said: 'No, I was a virgin.' So he told thern to go through the procedure of Li'an, and gave her the bridal-money.” (D a'if)",
      "chain": [
        "38402",
        "20184",
        "20150",
        "11107",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "2389",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا هدية بن عبد الوهاب، وأيوب بن حسان الواسطي، وعلي بن سلمة، قالوا حدثنا يحيى بن سليم الطائفي، عن عبيد الله بن عمر، عن نافع، عن ابن عمر، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إذا مر أحدكم بحائط فليأكل ولا يتخذ خبنة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that the Messenger of Allah (ﷺ) said:                     \"When anyone of you passes by a garden let him eat therefrom, but he should not carry any away in his garment.\"'",
      "chain": [
        "38119",
        "38402",
        "20204",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3578",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا علي بن سلمة، حدثنا زيد بن الحباب، حدثنا سفيان، عن أبي إسحاق، عن أبي الأحوص، عن عبد الله، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ عليكم بالشفاءين العسل والقرآن ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Abdullah that the Messenger of Allah (ﷺ)said:                     “You should take the two that bring healing: Honey and theQur’an.”",
      "chain": [
        "38402",
        "20650",
        "20012",
        "11049",
        "20327",
        "18"
      ]
    }
  ],
  "total_hadiths": 5
}