{
  "id": "38401",
  "name": "'Ali bin Sa'id bin Jryr علي بن سعيد بن جرير",
  "full_name": "'Ali bin Sa'id bin Jryr علي بن سعيد بن جرير",
  "grade": "3rd Century AH [11th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "250",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Nisa'",
      "Nisapur"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ س  فق  -  صدوق ]"
    ],
    "tags": [
      "al-Nisa'i",
      "Nisapur"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "649",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Zakat - كتاب الزكاة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "7",
      "text_ar": "حدثنا علي بن سعيد الكندي الكوفي، حدثنا حفص بن غياث، عن أشعث، عن عون بن أبي جحيفة، عن أبيه، قال قدم علينا مصدق النبي صلى الله عليه وسلم فأخذ الصدقة من أغنيائنا فجعلها في فقرائنا وكنت غلاما يتيما فأعطاني منها قلوصا ‏.‏ قال وفي الباب عن ابن عباس ‏.‏ قال أبو عيسى حديث أبي جحيفة حديث حسن ‏.‏",
      "text_en": " Awn bin Abi Jubaitah narrated from his father:                     \"The charity collector of the Prophet came to us. So he took the charity from our rich to our poor. I was a orphan boy, so he came to me and gave me a young she-camel from it.\"",
      "chain": [
        "38401",
        "20317",
        "11324",
        "11383",
        "4047"
      ]
    },
    {
      "hadith_no": "653",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Zakat - كتاب الزكاة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "7",
      "text_ar": "حدثنا علي بن سعيد الكندي، حدثنا عبد الرحيم بن سليمان، عن مجالد، عن عامر الشعبي، عن حبشي بن جنادة السلولي، قال سمعت رسول الله صلى الله عليه وسلم في حجة الوداع وهو واقف بعرفة أتاه أعرابي فأخذ بطرف ردائه فسأله إياه فأعطاه وذهب فعند ذلك حرمت المسألة فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن المسألة لا تحل لغني ولا لذي مرة سوي إلا لذي فقر مدقع أو غرم مفظع ومن سأل الناس ليثري به ماله كان خموشا في وجهه يوم القيامة ورضفا يأكله من جهنم فمن شاء فليقل ومن شاء فليكثر ‏\"‏ ‏.‏",
      "text_en": " Hubshi bin Junadah As-Saluli narrated:                     \"During the Farewell Hajj, while the Messener of allah was standing at Arafat, a Bedouin came to him begging while pulling on the edge of his Rida. He gave him something and he left. With that, begging was made unlawful, so the Messenger of Allah said: 'Begging is not lawful for the rich nor for the physically fit, except for the one who is severely poor or in perilous debt. And whoever begs the people (merely) to increase his wealth, then on the Day of Judgment (the wealth he begged for) will be lacerations on his face and heated coals from Hell will be provided for him to eat. Whoever wishes, let him take a little, and whoever wishes, then let him take a lot.'\"",
      "chain": [
        "38401",
        "20334",
        "10820",
        "11052",
        "4112"
      ]
    },
    {
      "hadith_no": "1386",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Blood Money - كتاب الديات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "16",
      "text_ar": "حدثنا علي بن سعيد الكندي الكوفي، أخبرنا ابن أبي زائدة، عن الحجاج، عن زيد بن جبير، عن خشف بن مالك، قال سمعت ابن مسعود، قال قضى رسول الله صلى الله عليه وسلم في دية الخطإ عشرين بنت مخاض وعشرين بني مخاض ذكورا وعشرين بنت لبون وعشرين جذعة وعشرين حقة ‏.‏ قال وفي الباب عن عبد الله بن عمرو ‏.‏  حدثنا أبو هشام الرفاعي، أخبرنا ابن أبي زائدة، وأبو خالد الأحمر عن الحجاج بن أرطاة، نحوه ‏.‏ قال أبو عيسى حديث ابن مسعود لا نعرفه مرفوعا إلا من هذا الوجه وقد روي عن عبد الله موقوفا ‏.‏ وقد ذهب بعض أهل العلم إلى هذا وهو قول أحمد وإسحاق ‏.‏ وقد أجمع أهل العلم على أن الدية تؤخذ في ثلاث سنين في كل سنة ثلث الدية ورأوا أن دية الخطإ على العاقلة ‏.‏ ورأى بعضهم أن العاقلة قرابة الرجل من قبل أبيه ‏.‏ وهو قول مالك والشافعي ‏.‏ وقال بعضهم إنما الدية على الرجال دون النساء والصبيان من العصبة يحمل كل رجل منهم ربع دينار ‏.‏ وقد قال بعضهم إلى نصف دينار فإن تمت الدية وإلا نظر إلى أقرب القبائل منهم فألزموا ذلك ‏.‏",
      "text_en": " Narrated Ibn Mas'ud:                     \"The Messenger of Allah (ﷺ) judged for the accidental blood-Money: Twenty Bint Makhad, twenty make Ibn Makhad, twenty Bint Labunm twenty Jadha'ah, and twenty Hiqqah.(Another chain) with similar meaning.",
      "chain": [
        "38401",
        "20366",
        "20381",
        "22061",
        "19907",
        "16"
      ]
    },
    {
      "hadith_no": "1410",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Blood Money - كتاب الديات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "16",
      "text_ar": "حدثنا علي بن سعيد الكندي الكوفي، حدثنا ابن أبي زائدة، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قضى رسول الله صلى الله عليه وسلم في الجنين بغرة عبد أو أمة ‏.‏ فقال الذي قضي عليه أنعطي من لا شرب ولا أكل ولا صاح فاستهل فمثل ذلك يطل ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ إن هذا ليقول بقول شاعر بل فيه غرة عبد أو أمة ‏\"‏ ‏.‏ وفي الباب عن حمل بن مالك بن النابغة والمغيرة بن شعبة ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن صحيح ‏.‏ والعمل على هذا عند أهل العلم ‏.‏ وقال بعضهم الغرة عبد أو أمة أو خمسمائة درهم ‏.‏ وقال بعضهم أو فرس أو بغل ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     \"The Messenger of Allah (ﷺ) judged that a Ghurrah male slave or female slave be given in the case of a fetus. The one of the judgement was made against said: 'Should we give something for one who did not drink, not eat, nor cry out to shed a tear, the likes of which is useless?' So the Prophet (ﷺ) said: 'This is the speech of a poet. Rather it requires a Ghurrah: a male slave or a female slave.'\"",
      "chain": [
        "38401",
        "20366",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1417",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Blood Money - كتاب الديات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "16",
      "text_ar": "حدثنا علي بن سعيد الكندي، حدثنا ابن المبارك، عن معمر، عن بهز بن حكيم، عن أبيه، عن جده، أن النبي صلى الله عليه وسلم حبس رجلا في تهمة ثم خلى عنه ‏.‏ قال وفي الباب عن أبي هريرة ‏.‏ قال أبو عيسى حديث بهز عن أبيه عن جده حديث حسن ‏.‏ وقد روى إسماعيل بن إبراهيم عن بهز بن حكيم هذا الحديث أتم من هذا وأطول ‏.‏",
      "text_en": " Narrated Bahz bin Hakim:                     from his father, from his grandfather, that the Prophet (ﷺ) imprisoned a man for an accusation, then he let him go.",
      "chain": [
        "38401",
        "20025",
        "20115",
        "19901",
        "19905"
      ]
    },
    {
      "hadith_no": "1576",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Military Expeditions - كتاب السير عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "21",
      "text_ar": "حدثنا علي بن سعيد الكندي، حدثنا عبد الرحيم بن سليمان، عن إسرائيل، عن ثوير، عن أبيه، عن علي، عن النبي صلى الله عليه وسلم أن كسرى أهدى إليه فقبل منه وأن الملوك أهدوا إليه فقبل منهم ‏.‏ قال وفي الباب عن جابر ‏.‏ وهذا حديث حسن غريب ‏.‏ وثوير هو ابن أبي فاختة وأبو فاختة اسمه سعيد بن علاقة وثوير يكنى أبا جهم ‏.‏",
      "text_en": " Narrated 'Ali:                     From the Prophet (ﷺ), that Kisra sent him a gift so he accepted, and that kings gave him gifts and he accepted them.There is something about this from Jabir. This is a Hasan Gharib Hadith. Thuwair (a narrator in the chain) is Ibn Abi Fakhitah, whose name was Sa'eed bin 'Illaqah, and Thuwair's Kunyah was Abu Jahm.",
      "chain": [
        "38401",
        "20334",
        "20311",
        "10846",
        "5"
      ]
    },
    {
      "hadith_no": "2344",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا علي بن سعيد الكندي، حدثنا ابن المبارك، عن حيوة بن شريح، عن بكر بن عمرو، عن عبد الله بن هبيرة، عن أبي تميم الجيشاني، عن عمر بن الخطاب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لو أنكم كنتم توكلون على الله حق توكله لرزقتم كما ترزق الطير تغدو خماصا وتروح بطانا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح لا نعرفه إلا من هذا الوجه ‏.‏ وأبو تميم الجيشاني اسمه عبد الله بن مالك ‏.‏",
      "text_en": " 'Umar bin Al-Khattab narrated that the Messenger of Allah (s.a.w) said:                     \"If you were to rely upon Allah with the required reliance, then He would provide for you just as a bird is provided for, it goes out in the morning empty, and returns full.\"",
      "chain": [
        "38401",
        "20025",
        "26010",
        "10850",
        "10864",
        "10863",
        "3"
      ]
    },
    {
      "hadith_no": "3565",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا علي بن سعيد الكندي، حدثنا أبو محياة، عن عبد الملك بن عمير، عن ابن أخي عبد الله بن سلام، لما أريد عثمان جاء عبد الله بن سلام فقال له عثمان ما جاء بك قال جئت في نصرك قال اخرج إلى الناس فاطردهم عني فإنك خارج خير لي منك داخل ‏.‏ فخرج عبد الله إلى الناس فقال أيها الناس إنه كان اسمي في الجاهلية فلان فسماني رسول الله صلى الله عليه وسلم عبد الله ونزل في آيات من كتاب الله نزلت في ‏:‏ ‏(‏ وشهد شاهد من بني إسرائيل على مثله فآمن واستكبرتم إن الله لا يهدي القوم الظالمين ‏)‏ ونزلت في ‏:‏ ‏(‏قل كفى بالله شهيدا بيني وبينكم ومن عنده علم الكتاب ‏)‏ إن لله سيفا مغمودا عنكم وإن الملائكة قد جاورتكم في بلدكم هذا الذي نزل فيه نبيكم فالله الله في هذا الرجل أن تقتلوه فوالله إن قتلتموه لتطردن جيرانكم الملائكة ولتسلن سيف الله المغمود عنكم فلا يغمد إلى يوم القيامة قال فقالوا اقتلوا اليهودي واقتلوا عثمان ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ وقد رواه شعيب بن صفوان عن عبد الملك بن عمير عن ابن محمد بن عبد الله بن سلام عن جده عبد الله بن سلام ‏.‏",
      "text_en": " Narrated 'Abdul-Malik bin 'Umair:                     from the nephew of 'Abdullah bin Salam who said: \"When they were after 'Uthman, 'Abdullah bin Salam came, and 'Uthman said to him: 'What did you come for?' He said: 'I came to assist you.' He said: 'Go to the people to repel their advances against me. For verily your going is better to me than your entering here.'\" He said: \"So 'Abdullah bin Salam went to the people and said: 'O you people! During Jahiliyyah I was named so-and-so, then the Messenger of Allah (ﷺ) named me 'Abdullah, and some Ayat from the Book of Allah were revealed about me. (The following) was revealed about me: 'A witness from among the Children of Isra'il has testified to something similar, and believed while you rejected. Verily, Allah does not guide the wrongdoing people. (46:10)\" And (the following) was revealed about me: 'Sufficient as a witness between me and you is Allah, and those too who have knowledge of the Scripture. (13:43)\" Allah has sheathed the sword from you and the angels are your neighbors in this city of yours, the one in which the Revelation came to your Prophet. But by Allah! (Fear) Allah regarding this man; if you kill him, then by Allah! If you kill him, then you will cause the angels to remove your goodness from you, and to raise Allah's sheathed sword against you, such that it will never be sheathed again until the Day of Resurrection.'\" He said: \"They said: 'Kill the Jew and kill 'Uthman.'\"",
      "chain": [
        "38401",
        "11368"
      ]
    },
    {
      "hadith_no": "4173",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا علي بن سعيد الكندي، حدثنا أبو محياة، يحيى بن يعلى بن عطاء عن عبد الملك بن عمير، عن ابن أخي عبد الله بن سلام، قال لما أريد قتل عثمان جاء عبد الله بن سلام فقال له عثمان ما جاء بك قال جئت في نصرك ‏.‏ قال اخرج إلى الناس فاطردهم عني فإنك خارجا خير لي منك داخلا ‏.‏ فخرج عبد الله إلى الناس فقال أيها الناس إنه كان اسمي في الجاهلية فلان فسماني رسول الله صلى الله عليه وسلم عبد الله ونزلت في آيات من كتاب الله فنزلت في ‏:‏ ‏(‏ وشهد شاهد من بني إسرائيل على مثله فآمن واستكبرتم إن الله لا يهدي القوم الظالمين ‏)‏ ونزلت في ‏:‏ ‏(‏ قل كفى بالله شهيدا بيني وبينكم ومن عنده علم الكتاب ‏)‏ إن لله سيفا مغمودا عنكم وإن الملائكة قد جاورتكم في بلدكم هذا الذي نزل فيه رسول الله صلى الله عليه وسلم فالله الله في هذا الرجل أن تقتلوه فوالله لئن قتلتموه لتطردن جيرانكم الملائكة ولتسلن سيف الله المغمود عنكم فلا يغمد عنكم إلى يوم القيامة ‏.‏ قالوا اقتلوا اليهودي واقتلوا عثمان ‏.‏ قال أبو عيسى هذا حديث غريب إنما نعرفه من حديث عبد الملك بن عمير ‏.‏ وقد روى شعيب بن صفوان هذا الحديث عن عبد الملك بن عمير فقال عن عمر بن محمد بن عبد الله بن سلام عن جده عبد الله بن سلام ‏.‏",
      "text_en": " Narrated 'Abdul-Malik bin 'Umair:                     from the nephew of 'Abdullah bin Salam who said: \"When they were about to kill 'Uthman, 'Abdullah bin Salam came and 'Uthman said to him: 'What did you come for?' He said: 'I came to assist you.' He said: 'Go to the people to repel their advances against me. For verily your going is better to me than your entering here.' So 'Abdullah went to the people and said: 'O you people! During Jahiliyyah I was named so-and-so, then the Messenger of Allah (ﷺ) named me 'Abdullah, and some Ayat from the Book of Allah were revealed about me. (The following) was revealed about me: \"A witness from among the Children of Isra'il has testified to something similar and believed while you rejected. Verily, Allah does not guide the wrongdoing people. (46:10)\" [And (the following) was revealed about me:] \"Sufficient as a witness between me and you is Allah, and those too who have knowledge of the Scripture. (13:43)\" Allah has sheathed the sword from you and the angels are your neighbors in this city of yours, the one in which the Revelation came to the Messenger of Allah (ﷺ). But by Allah! (Fear) Allah regarding this man; if you kill him, then by Allah! If you kill him, then you will cause the angels to remove your goodness from you, and to raise Allah's sheathed sword against you, such that it will never be sheathed again until the Day of Resurrection.'\" He said: \"They said: 'Kill the Jew and kill 'Uthman.'\"",
      "chain": [
        "38401",
        "11368"
      ]
    },
    {
      "hadith_no": "2147",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا علي بن سعيد بن جرير، - نسائي - قال حدثنا أبو الربيع، قال حدثنا منصور بن أبي الأسود، عن عبد الملك بن أبي سليمان، عن عطاء، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ تسحروا فإن في السحور بركة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah said; 'Take Sahur, for in Sahur there is blessing.\"\"",
      "chain": [
        "38401",
        "30137",
        "15551",
        "10945",
        "11029",
        "13"
      ]
    },
    {
      "hadith_no": "5559",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا محمد بن آدم، وعلي بن سعيد، قالا حدثنا عبد الرحيم، عن حبيب بن أبي عمرة، عن سعيد بن جبير، عن ابن عباس، قال نهى رسول الله صلى الله عليه وسلم عن خليط التمر والزبيب وعن التمر والبسر‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"The Messenger of Allah [SAW] forbade mixing dried dates and raisins, and dried dates and Al-Busr.\"",
      "chain": [
        "38401",
        "20334",
        "14069",
        "11050",
        "17"
      ]
    }
  ],
  "total_hadiths": 11
}