{
  "id": "38429",
  "name": "'Amr bin 'Uthman bin Sa'id bin Kahtir عمرو بن عثمان بن سعيد بن كثير",
  "full_name": "'Amr bin 'Uthman bin Sa'id bin Kahtir عمرو بن عثمان بن سعيد بن كثير",
  "grade": "3rd Century AH [10th generation]",
  "biography": {
    "birth": {
      "date_hijri": "170",
      "date_gregorian": "NA",
      "date_display": [
        "170 AH"
      ],
      "place": ""
    },
    "death": {
      "date_hijri": "250",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Hims"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ د  س  ق  -  صدوق ]"
    ],
    "tags": [
      "Quraish",
      "Client",
      "al-Himsi"
    ]
  },
  "parents": [
    {
      "id": "28388",
      "name": "'Uthman bin Sa'id bin Kathir bin Dinar عثمان بن سعيد بن كثير بن دينار",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "38705",
      "name": "Yahya bin 'Uthman bin Sa'id bin Kathir يحيى بن عثمان بن سعيد بن كثير",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "28388",
      "name": "'Uthman bin Sa'id bin Kathir bin Dinar عثمان بن سعيد بن كثير بن دينار",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20454",
      "name": "Muhammad bin Harb al-Khulani محمد بن حرب الخولاني الأبرش",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20733",
      "name": "al-Walid bin Muslim al-Quraishi الوليد بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20201",
      "name": "Marwan bin Mua'wiya al-Fazari مروان بن معاوية الفزاري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20640",
      "name": "Mrwan bin Muhammad bin Hsan مروان بن محمد بن حسان الأسدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20736",
      "name": "Isma'il bin Ayyash bin Saleem إسماعيل بن عياش بن سليم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20644",
      "name": "Baqiyya bin al-Walid bin Sa'aid بقية بن الوليد بن صائد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20734",
      "name": "Ahmed bin Khalid bin Musa al-Wahbi أحمد بن خالد بن موسى الوهبي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "30006",
      "name": "Imam Nasa'i أحمد بن شعيب بن علي بن سنان النسائي",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30004",
      "name": "Ibn Maja ابن ماجة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30023",
      "name": "Muhammad bin Yahya bin Faris al-Dhahli محمد بن يحيى بن فارس الذهلي",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "421",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عمرو بن عثمان الحمصي، حدثنا أبي، حدثنا حريز، عن راشد بن سعد، عن عاصم بن حميد السكوني، أنه سمع معاذ بن جبل، يقول ارتقبنا النبي صلى الله عليه وسلم في صلاة العتمة فأخر حتى ظن الظان أنه ليس بخارج والقائل منا يقول صلى فإنا لكذلك حتى خرج النبي صلى الله عليه وسلم فقالوا له كما قالوا فقال لهم ‏\"‏ أعتموا بهذه الصلاة فإنكم قد فضلتم بها على سائر الأمم ولم تصلها أمة قبلكم ‏\"‏ ‏.‏",
      "text_en": " Narrated Mu'adh ibn Jabal:                     We waited for the Prophet (ﷺ) to offer the night prayer. He delayed until people thought that he would not come out and some of us said that he had offered the prayer. At the moment when we were in this condition the Prophet (ﷺ) came out. People said to him as they were already saying. He said: Observe this prayer when it is dark, for by it you have been made superior to all the peoples, no people having observed it before you.",
      "chain": [
        "38429",
        "28388",
        "19909",
        "18471",
        "32"
      ]
    },
    {
      "hadith_no": "1190",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book Of The Prayer For Rain (Kitab al-Istisqa') - كتاب الاستسقاء",
      "chapter_no": "3",
      "text_ar": "حدثنا عمرو بن عثمان، حدثنا الوليد، حدثنا عبد الرحمن بن نمر، أنه سأل الزهري فقال الزهري أخبرني عروة، عن عائشة، قالت كسفت الشمس فأمر رسول الله صلى الله عليه وسلم رجلا فنادى أن الصلاة جامعة ‏.‏",
      "text_en": " Narrated A'ishah (May Allah be pleased with her):                     There was an eclipse of the sun.  The Messenger of Allah (ﷺ) commanded a man who summoned: \"The prayer will be held in congregation\"",
      "chain": [
        "38429",
        "20733",
        "20400",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2628",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا عمرو بن عثمان الحمصي، ويزيد بن قبيس، - من أهل جبلة ساحل حمص وهذا لفظ يزيد - قالا حدثنا الوليد بن مسلم عن عبد الله بن العلاء أنه سمع مسلم بن مشكم أبا عبيد الله يقول حدثنا أبو ثعلبة الخشني قال كان الناس إذا نزلوا منزلا - قال عمرو كان الناس إذا نزل رسول الله صلى الله عليه وسلم منزلا - تفرقوا في الشعاب والأودية فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن تفرقكم في هذه الشعاب والأودية إنما ذلكم من الشيطان ‏\"‏ ‏.‏ فلم ينزل بعد ذلك منزلا إلا انضم بعضهم إلى بعض حتى يقال لو بسط عليهم ثوب لعمهم ‏.‏",
      "text_en": " Narrated AbuTha'labah al-Khushani:                     When the people encamped, (the narrator Amr ibn Uthman al-Himsi) said: When the Messenger of Allah (ﷺ) encamped, the people scattered in the glens and wadis. The Messenger of Allah (ﷺ) said: Your scattering in these glens and wadis is only of the devil. They afterwards kept close together when they encamped to such an extent that it used to be said that if a cloth were spread over them, it would cover them all.",
      "chain": [
        "38429",
        "10725",
        "20399",
        "17540",
        "11081"
      ]
    },
    {
      "hadith_no": "2969",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا عمرو بن عثمان الحمصي، حدثنا أبي، حدثنا شعيب بن أبي حمزة، عن الزهري، حدثني عروة بن الزبير، أن عائشة، زوج النبي صلى الله عليه وسلم أخبرته بهذا الحديث قال وفاطمة عليها السلام حينئذ تطلب صدقة رسول الله صلى الله عليه وسلم التي بالمدينة وفدك وما بقي من خمس خيبر ‏.‏ قالت عائشة رضى الله عنها فقال أبو بكر رضى الله عنه إن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا نورث ما تركنا صدقة وإنما يأكل آل محمد في هذا المال ‏\"‏ ‏.‏ يعني مال الله ليس لهم أن يزيدوا على المأكل ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     Fatimah was demanding (the property of) sadaqah of the Messenger of Allah (ﷺ) at Medina and Fadak, and what remained from the fifth of Khaybar. Aisha quoted AbuBakr as saying: The Messenger of Allah (ﷺ) said: We are not inherited; whatever we leave is sadaqah. The family of Muhammad will eat from this property, that is, from the property of Allah. They will not take more then their sustenance.",
      "chain": [
        "38429",
        "28388",
        "20428",
        "11013",
        "10511"
      ]
    },
    {
      "hadith_no": "3773",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا عمرو بن عثمان الحمصي، حدثنا أبي، حدثنا محمد بن عبد الرحمن بن عرق، حدثنا عبد الله بن بسر، قال كان للنبي صلى الله عليه وسلم قصعة يقال لها الغراء يحملها أربعة رجال فلما أضحوا وسجدوا الضحى أتي بتلك القصعة - يعني وقد ثرد فيها - فالتفوا عليها فلما كثروا جثى رسول الله صلى الله عليه وسلم فقال أعرابي ما هذه الجلسة قال النبي صلى الله عليه وسلم ‏\"‏ إن الله جعلني عبدا كريما ولم يجعلني جبارا عنيدا ‏\"‏ ‏.‏ ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ كلوا من حواليها ودعوا ذروتها يبارك فيها ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Busr:                     The Prophet (ﷺ) had a bowl called gharra'. It was carried by four persons. When the sun rose high, and they performed the forenoon prayer, the bowl in which tharid was prepared was brought, and the people gathered round it. When they were numerous, the Messenger of Allah (ﷺ) said: Allah has made me a respectable servant, and He did not make me an obstinate tyrant. The Messenger of Allah (ﷺ) said: Eat from it sides and leave its top, the blessing will be conferred on it",
      "chain": [
        "38429",
        "28388",
        "18930",
        "3650"
      ]
    },
    {
      "hadith_no": "4067",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا عمرو بن عثمان الحمصي، حدثنا الوليد، قال قال هشام - يعني ابن الغاز - المضرجة التي ليست بمشبعة ولا الموردة ‏.‏",
      "text_en": " Hisham b. al-Ghaz said:                      The word mudarrajah mentioned in the previous tradition means a colour which is neither crimson nor pink.",
      "chain": [
        "38429",
        "20733"
      ]
    },
    {
      "hadith_no": "4131",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا عمرو بن عثمان بن سعيد الحمصي، حدثنا بقية، عن بحير، عن خالد، قال وفد المقدام بن معديكرب وعمرو بن الأسود ورجل من بني أسد من أهل قنسرين إلى معاوية بن أبي سفيان فقال معاوية للمقدام أعلمت أن الحسن بن علي توفي فرجع المقدام فقال له رجل أتراها مصيبة قال له ولم لا أراها مصيبة وقد وضعه رسول الله صلى الله عليه وسلم في حجره فقال ‏\"‏ هذا مني وحسين من علي ‏\"‏ ‏.‏ فقال الأسدي جمرة أطفأها الله عز وجل ‏.‏ قال فقال المقدام أما أنا فلا أبرح اليوم حتى أغيظك وأسمعك ما تكره ‏.‏ ثم قال يا معاوية إن أنا صدقت فصدقني وإن أنا كذبت فكذبني قال أفعل ‏.‏ قال فأنشدك بالله هل تعلم أن رسول الله صلى الله عليه وسلم نهى عن لبس الذهب قال نعم ‏.‏ قال فأنشدك بالله هل سمعت رسول الله صلى الله عليه وسلم ينهى عن لبس الحرير قال نعم ‏.‏ قال فأنشدك بالله هل تعلم أن رسول الله صلى الله عليه وسلم نهى عن لبس جلود السباع والركوب عليها قال نعم ‏.‏ قال فوالله لقد رأيت هذا كله في بيتك يا معاوية ‏.‏ فقال معاوية قد علمت أني لن أنجو منك يا مقدام قال خالد فأمر له معاوية بما لم يأمر لصاحبيه وفرض لابنه في المائتين ففرقها المقدام في أصحابه قال ولم يعط الأسدي أحدا شيئا مما أخذ فبلغ ذلك معاوية فقال أما المقدام فرجل كريم بسط يده وأما الأسدي فرجل حسن الإمساك لشيئه ‏.‏",
      "text_en": " Khalid said:                      Al-Miqdam ibn Ma'dikarib and a man of Banu Asad from the people of Qinnisrin went to Mu'awiyah ibn AbuSufyan.  Mu'awiyah said to al-Miqdam: Do you know that al-Hasan ibn Ali has died? Al-Miqdam recited the Qur'anic verse \"We belong to Allah and to Him we shall return.\"  A man asked him: Do you think it a calamity?  He replied: Why should I not consider it a calamity when it is a fact that the Messenger of Allah (ﷺ) used to take him on his lap, saying: This belongs to me and Husayn belongs to Ali?  The man of Banu Asad said: (He was) a live coal which Allah has extinguished.  Al-Miqdam said: Today I shall continue to make you angry and make you hear what you dislike. He then said: Mu'awiyah, if I speak the truth, declare me true, and if I tell a lie, declare me false.  He said: Do so.  He said: I adjure you by Allah, did you hear the Messenger of Allah (ﷺ) forbidding use to wear gold?  He replied: Yes.  He said: I adjure you by Allah, do you know that the Messenger of Allah (ﷺ) prohibited the wearing of silk?  He replied: Yes.  He said: I adjure you by Allah, do you know that the Messenger of Allah (ﷺ) prohibited the wearing of the skins of beasts of prey and riding on them?  He said: Yes. He said: I swear by Allah, I saw all this in your house, O Mu'awiyah.  Mu'awiyah said: I know that I cannot be saved from you, O Miqdam.  Khalid said: Mu'awiyah then ordered to give him what he did not order to give to his two companions, and gave a stipend of two hundred (dirhams) to his son. Al-Miqdam then divided it among his companions, and the man of Banu Asad did not give anything to anyone from the property he received. When Mu'awiyah was informed about it, he said: Al-Miqdam is a generous man; he has an open hand (for generosity). The man of Banu Asad withholds his things in a good manner.",
      "chain": [
        "38429",
        "20644",
        "11282",
        "30"
      ]
    },
    {
      "hadith_no": "5080",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا عمرو بن عثمان الحمصي، ومؤمل بن الفضل الحراني، وعلي بن سهل الرملي، ومحمد بن المصفى الحمصي، قالوا حدثنا الوليد، حدثنا عبد الرحمن بن حسان الكناني، قال حدثني مسلم بن الحارث بن مسلم التميمي، عن أبيه، أن النبي صلى الله عليه وسلم قال نحوه إلى قوله ‏\"‏ جوار منها ‏\"‏ ‏.‏ إلا أنه قال فيهما ‏\"‏ قبل أن تكلم أحدا ‏\"‏ ‏.‏ قال علي بن سهل فيه إن أباه حدثه وقال علي وابن المصفى بعثنا رسول الله صلى الله عليه وسلم في سرية فلما بلغنا المغار استحثثت فرسي فسبقت أصحابي وتلقاني الحى بالرنين فقلت لهم قولوا لا إله إلا الله تحرزوا فقالوها فلامني أصحابي وقالوا حرمتنا الغنيمة فلما قدمنا على رسول الله صلى الله عليه وسلم أخبروه بالذي صنعت فدعاني فحسن لي ما صنعت وقال ‏\"‏ أما إن الله قد كتب لك من كل إنسان منهم كذا وكذا ‏\"‏ ‏.‏ قال عبد الرحمن فأنا نسيت الثواب ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ أما إني سأكتب لك بالوصاة بعدي ‏\"‏ ‏.‏ قال ففعل وختم عليه فدفعه إلى وقال لي ثم ذكر معناهم وقال ابن المصفى قال سمعت الحارث بن مسلم بن الحارث التميمي يحدث عن أبيه ‏.‏",
      "text_en": " Narrated Muslim ibn al-Harith ibn Muslim at-Tamimi:                     A similar tradition (to No. 5061) has been transmitted by Muslim ibn al-Harith ibn Muslim at-Tamimi on the authority of his father from the Prophet (ﷺ) through a different chain of narrators, up to \"protection from it\". But this version says: \"before speaking to anyone\". In this version Ali ibn Sahl said that his father told him.  Ali and Ibn al-Musaffa said: The Messenger of Allah (ﷺ) sent us on an expedition. When we reached the place of attack, I galloped my horse and outstripped my companions, and the people of that locality received me with a great noise.  I said to them: Say \"There is no god but Allah,\" and you will be protected. They said this.  My companions blamed me, saying: You deprived us of the booty. When we came to the Messenger of Allah (ﷺ), they told him what I had done.  So he called me, appreciating what I had done, and said: Allah has recorded for you so and so (a reward) for every man of them.  AbdurRahman said: I forgot the reward.  The Messenger of Allah (ﷺ) then said: I shall write a will for you after me. He did this and stamped it, and gave it to me, saying....He then mentioned the rest of the tradition to the same effect. Ibn al-Musaffa said: I heard al-Harith ibn Muslim ibn al-Harith at-Tamimi transmitting it from his father.",
      "chain": [
        "38429",
        "38659",
        "38403",
        "20733",
        "28325"
      ]
    },
    {
      "hadith_no": "792",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا عمرو بن عثمان بن سعيد بن كثير، قال حدثنا محمد بن حرب، عن الزبيدي، عن الزهري، والوليد، عن الأوزاعي، عن الزهري، عن أبي سلمة، عن أبي هريرة، قال أقيمت الصلاة فصف الناس صفوفهم وخرج رسول الله صلى الله عليه وسلم حتى إذا قام في مصلاه ذكر أنه لم يغتسل فقال للناس ‏\"‏ مكانكم ‏\"‏ ‏.‏ ثم رجع إلى بيته فخرج علينا ينطف رأسه فاغتسل ونحن صفوف ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                      \"The Iqamah for prayer was said and the people stood in rows, and the Messenger of Allah (ﷺ) came out. Then when he stood in the place where he prayed, he remembered that he had not performed Ghusl. He said to the people: 'Stay where you are.' Then he went back to his house, then he came out with his head dripping with water. He performed Ghusl while we were standing in our rows.\"",
      "chain": [
        "38429",
        "30373",
        "20459",
        "11013",
        "20733",
        "20024",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1235",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا عمرو بن عثمان بن سعيد بن كثير بن دينار، قال حدثنا بقية، قال حدثنا شعبة، قال وحدثني ابن عون، وخالد الحذاء، عن ابن سيرين، عن أبي هريرة، أن النبي صلى الله عليه وسلم سجد في وهمه بعد التسليم ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that :                     The Prophet (ﷺ) prostrated after the salam when he was not sure.",
      "chain": [
        "38429",
        "20644",
        "20020",
        "11071",
        "11282",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "Grade",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرني عمرو بن عثمان بن سعيد بن كثير، قال حدثنا الوليد، عن عبد الرحمن بن يزيد بن جابر، أنه سمع أبا الأشعث، حدثه أنه، سمع أوس بن أوس، صاحب رسول الله صلى الله عليه وسلم يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ من اغتسل يوم الجمعة وغسل وغدا وابتكر ومشى ولم يركب ودنا من الإمام وأنصت ولم يلغ كان له بكل خطوة عمل سنة ‏\"‏ ‏.‏",
      "text_en": " Abu Al-Ash'ath narrated that:                     He heard Aws bin Aws, the Companion of the Messenger of Allah (ﷺ) say: \"The Messenger of Allah (ﷺ) said: 'Whoever performs Ghusl on Friday and washes (ghassala), and comes early to the masjid, walking not riding, and sits close to the imam and listens attentively and does not engage in idle speech, for every step he takes he will have (the reward of) a year's worth of good deeds.'\"",
      "chain": [
        "38429",
        "20733",
        "20395",
        "10917"
      ]
    },
    {
      "hadith_no": "1497",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "أخبرني عمرو بن عثمان بن سعيد بن كثير، عن الوليد، عن عبد الرحمن بن نمر، أنه سأل الزهري عن سنة، صلاة الكسوف فقال أخبرني عروة بن الزبير، عن عائشة، قالت كسفت الشمس فأمر رسول الله صلى الله عليه وسلم رجلا فنادى أن الصلاة جامعة فاجتمع الناس فصلى بهم رسول الله صلى الله عليه وسلم فكبر ثم قرأ قراءة طويلة ثم كبر فركع ركوعا طويلا مثل قيامه أو أطول ثم رفع رأسه وقال ‏\"‏ سمع الله لمن حمده ‏\"‏ ‏.‏ ثم قرأ قراءة طويلة هي أدنى من القراءة الأولى ثم كبر فركع ركوعا طويلا هو أدنى من الركوع الأول ثم رفع رأسه فقال ‏\"‏ سمع الله لمن حمده ‏\"‏ ‏.‏ ثم كبر فسجد سجودا طويلا مثل ركوعه أو أطول ثم كبر فرفع رأسه ثم كبر فسجد ثم كبر فقام فقرأ قراءة طويلة هي أدنى من الأولى ثم كبر ثم ركع ركوعا طويلا هو أدنى من الركوع الأول ثم رفع رأسه فقال ‏\"‏ سمع الله لمن حمده ‏\"‏ ‏.‏ ثم قرأ قراءة طويلة وهي أدنى من القراءة الأولى في القيام الثاني ثم كبر فركع ركوعا طويلا دون الركوع الأول ثم كبر فرفع رأسه فقال ‏\"‏ سمع الله لمن حمده ‏\"‏ ‏.‏ ثم كبر فسجد أدنى من سجوده الأول ثم تشهد ثم سلم فقام فيهم فحمد الله وأثنى عليه ثم قال ‏\"‏ إن الشمس والقمر لا ينخسفان لموت أحد ولا لحياته ولكنهما آيتان من آيات الله فأيهما خسف به أو بأحدهما فافزعوا إلى الله عز وجل بذكر الصلاة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Aishah said:                     \"There was an eclipse of the sun and the Messenger of Allah (ﷺ) ordered a man to call out: As-salatu jami'ah (prayer is about to begin in congregation). The people gathered and the Messenger of Allah (ﷺ) led them in prayer. He said the takbir, then he recited at length. Then he said the takbir and bowed for a long time, as long as he had recited or longer. Then he raised his head and said: Sami Allahu liman hamidah (Allah hears those who praise Him) Then he recited at length, but it was shorter than the first time, then he said the takbir and bowed for a long time, but it was shorter than the first time. Then he raised his head and said: 'Sami Allahu liman hamidah (Allah hears those who praise Him). Then he said the takbir and prostrated for a long time, as long as he had bowed or longer. Then he said the takbir and raised his head, then he said the takbir and prostrated. Then he said the takbir and stood up, and recited for a long time that was shorter than the first time. Then he said the takbir and bowed for a long time that was shorter than the first time. Then he raised his head and said: Sami' Allahu liman hamidah. (Allah hears those who praise Him). Then he recited for a long time that was shorter than the first recitation in the second standing. Then he said the takbir and bowed for a long time that was shorter than the first time. Then he raised his head and said: Sami Allahu liman hamidah (Allah hears those who praise Him). Then he said the takbir and prostrated for a long time that was shorter than the first time. Then he recited the tashahhud, then he said the taslim. Then he stood before them and praised and glorified Allah, then he said: 'The sun and the moon do not become eclipsed for the death or birth of anyone, but they are two of the signs of Allah (SWT). Whichever of them becomes eclipsed, turn to Allah (SWT), the Mighty and Sublime, and pray.'\"",
      "chain": [
        "38429",
        "20733",
        "20400",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1534",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Fear Prayer - كتاب صلاة الخوف",
      "chapter_no": "18",
      "text_ar": "أخبرني عمرو بن عثمان بن سعيد بن كثير، عن محمد، عن الزبيدي، عن الزهري، عن عبيد الله بن عبد الله بن عتبة، أن عبد الله بن عباس، قال قام رسول الله صلى الله عليه وسلم وقام الناس معه فكبر وكبروا ثم ركع وركع أناس منهم ثم سجد وسجدوا ثم قام إلى الركعة الثانية فتأخر الذين سجدوا معه وحرسوا إخوانهم وأتت الطائفة الأخرى فركعوا مع النبي صلى الله عليه وسلم وسجدوا والناس كلهم في صلاة يكبرون ولكن يحرس بعضهم بعضا ‏.‏",
      "text_en": " It was narrated from 'Ubaidullah bin Abdullah bin Utbah that:                     'Abdullah bin 'Abbas said: \"The Messenger of Allah (ﷺ) stood and the people stood with him, and he said the takbir and they said the takbir. Then he bowed, and some of them bowed, then he prostrated and they prostrated, then he stood for the second rak'ah and those who had prostrated with him moved back and guarded their brothers, and the other group came and bowed and prostrated with the Prophet (ﷺ). All the people were praying and saying the takbir, but they were guarding one another.\"",
      "chain": [
        "38429",
        "30213",
        "20459",
        "11013",
        "11004",
        "17"
      ]
    },
    {
      "hadith_no": "1638",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا عمرو بن عثمان بن سعيد بن كثير، قال حدثنا أبي وبقية، قالا حدثنا ابن أبي حمزة، قال حدثني الزهري، قال أخبرني عبيد الله بن عبد الله بن الحارث بن نوفل، عن عبد الله بن خباب بن الأرت، عن أبيه، وكان، قد شهد بدرا",
      "text_en": " It was narrated from 'Abdullah bin Khabbab bin Al-Aratt, from his father who had been present at Badr with the Messenger of Allah (ﷺ), that:                     He watched the Messenger of Allah (ﷺ) one night when he prayed all night until Fajr time. When the Messenger of Allah (ﷺ) said the taslim at the end of his prayer, Khabbab said to him: 'May my father and mother be ransomed for you O Messenger of Allah, last night you offered a prayer the like of which I have never seen you offer.\" The Messenger of Allah (ﷺ) said: \"Yes indeed. This is a prayer of hope and fear in which I asked my Lord, the Mighty and Sublime, for three things, of which He gave me two and did not grant me one. I asked my Lord not to destroy us with which he destroyed the nations before us, and He granted me that. And I asked my Lord not to let an enemy from without prevail over us, and He granted me that. And I asked my Lord not to divide us into warring factions and He did not grant me that.\"",
      "chain": [
        "38429",
        "11013",
        "11513",
        "2230",
        "149"
      ]
    },
    {
      "hadith_no": "2439",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرني عمرو بن عثمان بن سعيد بن كثير، قال حدثنا أبي، عن شعيب، عن الزهري، قال أخبرني حميد بن عبد الرحمن، أن أبا هريرة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من أنفق زوجين من شىء من الأشياء في سبيل الله دعي من أبواب الجنة يا عبد الله هذا خير لك وللجنة أبواب فمن كان من أهل الصلاة دعي من باب الصلاة ومن كان من أهل الجهاد دعي من باب الجهاد ومن كان من أهل الصدقة دعي من باب الصدقة ومن كان من أهل الصيام دعي من باب الريان ‏\"‏ ‏.‏ قال أبو بكر هل على من يدعى من تلك الأبواب من ضرورة فهل يدعى منها كلها أحد يا رسول الله قال ‏\"‏ نعم وإني أرجو أن تكون منهم ‏\"‏ ‏.‏ يعني أبا بكر ‏.‏",
      "text_en": " Abu Hurairah said:                     \"I heard the Messenger of Allah say\" 'Whoever spends on a pair of things in the cause of Allah, he will be called from the gates of Paradise: O slave of Allah, this is good for you. Paradise had (several) gates. Whoever is one of the people of Salah, he will be called from the gate of prayer. Whoever is one of the people of Jihad, will be called from the gate of Jihad. Whoever is one of the people of charity will be called from the gate of charity. And whoever is one of the people of fasting will be called from the gate of Ar-Rayyan.\" Abu Bakr said: \"Is there any need for anyone to be called from all of these gates? Will anyone be called from all of them, O Messenger of Allah?\" He said: \"Yes, and I hope that you will be among them.\"",
      "chain": [
        "38429",
        "28388",
        "20428",
        "11013",
        "10561",
        "13"
      ]
    },
    {
      "hadith_no": "3095",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا أحمد بن محمد بن المغيرة، قال حدثنا عثمان، عن شعيب، عن الزهري، ح وأخبرني عمرو بن عثمان بن سعيد بن كثير، قال حدثنا أبي قال، حدثنا شعيب، عن الزهري، قال حدثني سعيد بن المسيب، أن أبا هريرة، أخبره أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أمرت أن أقاتل الناس حتى يقولوا لا إله إلا الله فمن قالها فقد عصم مني نفسه وماله إلا بحقه وحسابه على الله ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah (ﷺ) said:                      \"I have been commanded to fight the people until they say La ilaha illallah (there is non worthy or worship except Allah). Whoever says it, his life and his property are safe from me, except for its right, and his reckoning will be with Allah.\"",
      "chain": [
        "30304",
        "30203",
        "20428",
        "11013",
        "38429",
        "28388",
        "20239",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "3124",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرني عمرو بن عثمان بن سعيد بن كثير بن دينار، قال حدثنا أبي، عن شعيب، عن الزهري، قال أخبرني سعيد بن المسيب، قال سمعت أبا هريرة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ مثل المجاهد في سبيل الله - والله أعلم بمن يجاهد في سبيل الله - كمثل الصائم القائم وتوكل الله للمجاهد في سبيله بأن يتوفاه فيدخله الجنة أو يرجعه سالما بما نال من أجر أو غنيمة ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah said:                      \"I heard the Messenger of Allah (ﷺ) say: 'The parable of Mujahid (who strives in the cause of Allah) - and Allah knows best who strives in teh cause of Allah - is that of one who fasts and prays Qiyam (continually). Allah has promised Mujahid (who strives in His cause), that He will either cause him to die and admit him to paradise, or, He will bring him back safely with whatever he had earned of reward or spoils of war.'\"",
      "chain": [
        "38429",
        "28388",
        "20428",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "3142",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا عمرو بن عثمان بن سعيد بن كثير، قال حدثنا بقية، عن صفوان، قال حدثني سليم بن عامر، عن شرحبيل بن السمط، أنه قال لعمرو بن عبسة يا عمرو حدثنا حديثا، سمعته من، رسول الله صلى الله عليه وسلم ‏.‏ قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من شاب شيبة في سبيل الله تعالى كانت له نورا يوم القيامة ومن رمى بسهم في سبيل الله تعالى بلغ العدو أولم يبلغ كان له كعتق رقبة ومن أعتق رقبة مؤمنة كانت له فداءه من النار عضوا بعضو ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Shurahbil bin As-Simt that he said to 'Amr bin 'Abasah:                      \"O 'Amr! Tell us a Hadith that you heard from the Messenger of Allah (ﷺ).\" He said: \"I heard the Messenger of Allah (ﷺ) say: 'Whoever develops one gray hair in the cause of Allah, Most High, it will be light for him on the Day of Resurrection. Whoever shoots an arrow in the cause of Allah, Most High, whether it reaches the enemy or not, it will be as if he freed a slave. Whoever frees a believing slave, it will be a ransom for him from the Fire, limb by limb.'\"",
      "chain": [
        "38429",
        "20644",
        "10921",
        "10915",
        "6225"
      ]
    },
    {
      "hadith_no": "3552",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا عمرو بن عثمان بن سعيد بن كثير بن دينار، قال حدثنا أبي، عن شعيب، قال قال الزهري أخبرني عبيد الله بن عبد الله بن عتبة، أن عبد الله بن عمرو بن عثمان، طلق ابنة سعيد بن زيد - وأمها حمنة بنت قيس - البتة فأمرتها خالتها فاطمة بنت قيس بالانتقال من بيت عبد الله بن عمرو وسمع بذلك، مروان فأرسل إليها فأمرها أن ترجع إلى مسكنها حتى تنقضي عدتها فأرسلت إليه تخبره أن خالتها فاطمة أفتتها بذلك وأخبرتها أن رسول الله صلى الله عليه وسلم أفتاها بالانتقال حين طلقها أبو عمرو بن حفص المخزومي فأرسل مروان قبيصة بن ذؤيب إلى فاطمة فسألها عن ذلك فزعمت أنها كانت تحت أبي عمرو لما أمر رسول الله صلى الله عليه وسلم علي بن أبي طالب على اليمن خرج معه فأرسل إليها بتطليقة وهي بقية طلاقها فأمر لها الحارث بن هشام وعياش بن أبي ربيعة بنفقتها فأرسلت إلى الحارث وعياش تسألهما النفقة التي أمر لها بها زوجها فقالا والله ما لها علينا نفقة إلا أن تكون حاملا وما لها أن تسكن في مسكننا إلا بإذننا ‏.‏ فزعمت فاطمة أنها أتت رسول الله صلى الله عليه وسلم فذكرت ذلك له فصدقهما قالت فقلت أين أنتقل يا رسول الله فقال ‏\"‏ انتقلي عند ابن أم مكتوم ‏\"‏ ‏.‏ وهو الأعمى الذي عاتبه الله عز وجل في كتابه فانتقلت عنده فكنت أضع ثيابي عنده حتى أنكحها رسول الله صلى الله عليه وسلم زعمت أسامة بن زيد ‏.‏",
      "text_en": " 'Ubaidullah bin 'Abdullah bin 'Utbah narrated that 'Abdullah bin 'Amr bin 'Uthman divorced the daughter of Sa'eed bin Zaid -whose mother was Hamnah bint Qais- irrevocably. Her maternal aunt Fatimah bint Qais told her to move from the house of 'Abdullah bin 'Amr. Marwan heard of that, so he sent word to her, telling her to go back to her home until her 'Iddah was over. She sent a word to him telling him that her maternal aunt Fatimah had issued a Fatwa to that effect, and she told her that the Messenger of Allah had issued a Fatwa to her, telling her to move when Abu 'Amr bin Hafs Al-Makhzumi divorced her. Marwan sent Qabisah bin Dhu'aib to Fatimah to ask her about that. She said that she had been married to Abu 'Amr when the Messenger of Allah appointed 'Ali bin Abi Talib as governor of Yemen, and he went out with him, then he sent word to her divorcing her, and that was the final divorce for her. He told her to ask Al-Harith bin Hisham and 'Ayyash for her provisions that her husband had allocated for her. They said:                      \"By Allah, she is not entitled to any provision. So, she sent to Al-Harith bin Hisham and 'Ayyash asking them for the provisions from us unless she is pregnant, and she has no right to live in our house unless we permit her.\" Fatimah said that she went to the Messenger of Allah and told him about that and he said that they had told the truth. She said: \"I said: 'Where shall I move to, O Messenger of Allah?' He said: 'Move to the house of Ibn Umm Maktum' -who was the blind man, concerning whom Allah rebuked him in His Book. I moved to his house, and I used to take off my outer garments.\" Then the Messenger of Allah married her to Usamah bin Zaid.",
      "chain": [
        "38429",
        "28388",
        "20428",
        "11013",
        "11004"
      ]
    },
    {
      "hadith_no": "3592",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Horses, Races and Shooting - كتاب الخيل",
      "chapter_no": "28",
      "text_ar": "أخبرني عمرو بن عثمان بن سعيد بن كثير، قال حدثنا بقية بن الوليد، قال حدثنى شعبة، قال حدثني حميد الطويل، عن أنس بن مالك، قال سابق رسول الله صلى الله عليه وسلم أعرابي فسبقه فكأن أصحاب رسول الله صلى الله عليه وسلم وجدوا في أنفسهم من ذلك فقيل له في ذلك فقال ‏\"‏ حق على الله أن لا يرفع شىء نفسه في الدنيا إلا وضعه الله ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                      \"The Messenger of Allah raced with a Bedouin and (the latter) won. It was as if the Companions of the Messenger of Allah were upset by this, so he said: 'It is a right upon Allah that there is nothing that raises itself in this world except that He lowers it.'\"",
      "chain": [
        "38429",
        "20644",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "4025",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرني عمرو بن عثمان بن سعيد بن كثير بن دينار، عن الوليد، عن الأوزاعي، عن يحيى، عن أبي قلابة، عن أنس، أن نفرا، من عكل قدموا على النبي صلى الله عليه وسلم فاجتووا المدينة فأمرهم النبي صلى الله عليه وسلم أن يأتوا إبل الصدقة فيشربوا من أبوالها وألبانها ففعلوا فقتلوا راعيها واستاقوها فبعث النبي صلى الله عليه وسلم في طلبهم - قال - فأتي بهم فقطع أيديهم وأرجلهم وسمر أعينهم ولم يحسمهم وتركهم حتى ماتوا فأنزل الله عز وجل ‏{‏ إنما جزاء الذين يحاربون الله ورسوله ‏}‏ الآية ‏.‏",
      "text_en": " It was narrated from Anas that :                     Some people from 'Ukl came to the Prophet [SAW] but the climate of Al-Madinah did not suit them. The Prophet [SAW] told them to go to the camels that had been given in Sadaqah and drink some of their milk and urine. They did that, then they killed their herdsman and drove off the camels. The Prophet [SAW] sent (men) after them, and they were brought to him. He had their hands and feet cut off, and their eyes gouged out, and he did not have (their wounds) cauterized, and he left them to die. Then Allah, the Mighty and Sublime, revealed: \"The recompense of those who wage war against Allah and His Messenger.\"",
      "chain": [
        "38429",
        "20733",
        "20024",
        "11449",
        "11047",
        "19"
      ]
    },
    {
      "hadith_no": "5735",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرني عمرو بن عثمان بن سعيد بن كثير، قال حدثنا بقية، قال حدثني الأوزاعي، عن يحيى بن أبي عمرو، عن عبد الله بن الديلمي، عن أبيه، فيروز قال قدمت على رسول الله صلى الله عليه وسلم فقلت يا رسول الله إنا أصحاب كرم وقد أنزل الله عز وجل تحريم الخمر فماذا نصنع قال ‏\"‏ تتخذونه زبيبا ‏\"‏ ‏.‏ قلت فنصنع بالزبيب ماذا قال ‏\"‏ تنقعونه على غدائكم وتشربونه على عشائكم وتنقعونه على عشائكم وتشربونه على غدائكم ‏\"‏ ‏.‏ قلت أفلا نؤخره حتى يشتد قال ‏\"‏ لا تجعلوه في القلل واجعلوه في الشنان فإنه إن تأخر صار خلا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah Ad-Dailami that his father Fairuz said:                     \"I came to the Messenger of Allah [SAW] and said: 'O Messenger of Allah, we have grapevines and Allah, the Mighty and Sublime, has revealed that Khamr (wine) is forbidden, so what should we do?' He said: 'Make raisins.' I said: 'What should we do with the raisins?' He said: 'Soak them in the morning and drink them in the evening, and soak them in the evening and drink them in the morning.' I said: 'Can we leave it until it gets stronger?' He said: 'Do not put it in clay vessels, rather put it in skins, for if it stays there for a long time, it will turn into vinegar.'\"",
      "chain": [
        "38429",
        "20644",
        "20024",
        "5136"
      ]
    }
  ],
  "total_hadiths": 22
}