{
  "id": "38437",
  "name": "'Imran bin Bakar al-Kula'i عمران بن بكار الكلاعي",
  "full_name": "'Imran bin Bakar al-Kula'i عمران بن بكار الكلاعي",
  "grade": "3rd Century AH [11th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "271",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Hims"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ س  -  ثقة ]"
    ],
    "tags": [
      "al-Kula'i",
      "al-Himsi",
      "Mua'dhan"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "38154",
      "name": "al-Hasan bin Khmyr الحسن بن خمير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30382",
      "name": "Muhammad bin al-Mubarak محمد بن المبارك",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30334",
      "name": "Khtab bin 'Uthman al-Ta'iy خطاب بن عثمان الطائي الفوزي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30330",
      "name": "al-Hakm bin Nafi', Abu al-Yaman الحكم بن نافع أبو اليمان الحمصي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20442",
      "name": "'Abdul Quddus bin al-Hajjaj al-Khulani عبد القدوس بن الحجاج الخولاني",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20448",
      "name": "'Ali bin 'Ayyash علي بن عياش",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "28177",
      "name": "al-Rabi' bin Rwh الربيع بن روح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30572",
      "name": "Yazid bin Abd Rbh يزيد بن عبد ربه الزبيدي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "28319",
      "name": "'Abdul Hameed bin Ibrahim عبد الحميد بن إبراهيم الحضرمي أبو تقي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20734",
      "name": "Ahmed bin Khalid bin Musa al-Wahbi أحمد بن خالد بن موسى الوهبي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30006",
      "name": "Imam Nasa'i أحمد بن شعيب بن علي بن سنان النسائي",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30349",
      "name": "'Abdullah bin 'Uthman - ''Aabadan عبد الله بن عثمان - عبدان",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "34251",
      "name": "Muhammad bin Yahya bin 'Abdul Karim محمد بن يحيى بن عبد الكريم",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "40010",
      "name": "Muhammad bin Jarir At-Tabari أبو جعفر محمد بن جرير الطبري",
      "grade": "4th Century AH [Other]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1541",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Fear Prayer - كتاب صلاة الخوف",
      "chapter_no": "18",
      "text_ar": "أخبرني عمران بن بكار، قال حدثنا محمد بن المبارك، قال أنبأنا الهيثم بن حميد، عن العلاء، وأبي، أيوب عن الزهري، عن عبد الله بن عمر، قال صلى رسول الله صلى الله عليه وسلم صلاة الخوف قام فكبر فصلى خلفه طائفة منا وطائفة مواجهة العدو فركع بهم رسول الله صلى الله عليه وسلم ركعة وسجد سجدتين ثم انصرفوا ولم يسلموا وأقبلوا على العدو فصفوا مكانهم وجاءت الطائفة الأخرى فصفوا خلف رسول الله صلى الله عليه وسلم فصلى بهم ركعة وسجدتين ثم سلم رسول الله صلى الله عليه وسلم وقد أتم ركعتين وأربع سجدات ثم قامت الطائفتان فصلى كل إنسان منهم لنفسه ركعة وسجدتين ‏.‏ قال أبو بكر بن السني الزهري سمع من ابن عمر حديثين ولم يسمع هذا منه ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Umar said:                     \"The Messenger of Allah (ﷺ) offered the fear prayer. He stood and said the takbir, and a group of us prayed behind him while another group was facing the enemy. The Messenger of Allah (ﷺ) bowed once and prostrated twice with them, then they moved away but did not say the taslim. They went to face the enemy and lined up in their places, and the other group came and formed a row behind the Messenger of Allah (ﷺ), and he led them in praying, bowing once and prostrating twice. Then the Messenger of Allah (ﷺ) said the taslim and he had bowed twice and prostrated four times. Then the two groups stood up and each man prayed by himself, bowing once and prostrating twice.\" Abu Bakr IB As-Sunni said: \"Az-Zuhri heard two hadiths from Ibn 'Umar, and he did not hear this from him.\"",
      "chain": [
        "38437",
        "30382",
        "20744",
        "10606",
        "33",
        "11013",
        "18"
      ]
    },
    {
      "hadith_no": "2300",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا عمران بن بكار، قال حدثنا أحمد بن خالد، قال حدثنا محمد، عن عمران بن أبي أنس، عن سليمان بن يسار، وحنظلة بن علي، قال حدثاني جميعا، عن حمزة بن عمرو، قال كنت أسرد الصيام على عهد رسول الله صلى الله عليه وسلم فقلت يا رسول الله إني أسرد الصيام في السفر فقال ‏\"‏ إن شئت فصم وإن شئت فأفطر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Hamzah bin 'Amr said:                     \"I used to fast continually at the time of the Messenger of Allah. I said: 'O continually while traveling.' He said: 'If you wish then fast, and if you wish then do not fast.\"'",
      "chain": [
        "38437",
        "20278",
        "10605",
        "11005",
        "4123"
      ]
    },
    {
      "hadith_no": "2448",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا عمران بن بكار، قال حدثنا علي بن عياش، قال حدثنا شعيب، قال حدثني أبو الزناد، مما حدثه عبد الرحمن الأعرج، مما ذكر أنه سمع أبا هريرة، يحدث به قال قال رسول الله صلى الله عليه وسلم ‏\"‏ تأتي الإبل على ربها على خير ما كانت إذا هي لم يعط فيها حقها تطؤه بأخفافها وتأتي الغنم على ربها على خير ما كانت إذا لم يعط فيها حقها تطؤه بأظلافها وتنطحه بقرونها - قال - ومن حقها أن تحلب على الماء ألا لا يأتين أحدكم يوم القيامة ببعير يحمله على رقبته له رغاء فيقول يا محمد ‏.‏ فأقول لا أملك لك شيئا قد بلغت ‏.‏ ألا لا يأتين أحدكم يوم القيامة بشاة يحملها على رقبته لها يعار فيقول يا محمد ‏.‏ فأقول لا أملك لك شيئا قد بلغت - قال - ويكون كنز أحدهم يوم القيامة شجاعا أقرع يفر منه صاحبه ويطلبه أنا كنزك فلا يزال حتى يلقمه أصبعه ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah said:                     \"The Messenger of Allah said: '(On the Day of Resurrection) camels will come to their owner in the best state of health that they ever had (in this world) and if he did not pay what was due on them, they will trample him with their hooves. Sheep willcome to their owner in the best state of health that they ever had (in this world) and if he did not pay what was due on them, they will trample him with their cloven hooves and gore him with their horns. And among their rights are that they should be milked with water in the front of them. I do not want any one of you to come on the Day of Resurrection with a groaning camel on his neck, saying , O Muhammad, and I will say: I cannot do anything for you, I conveyed the message. I do not  want any one of you to come on the Day of Resurrection with a bleating sheep on his neck, saying, \"O Muhammad,\" and I will say: \"I cannot do anything for you, I conveyed the message.\" And on the Day of Resurrection the hoarded treasure of one of you will be a blad-headed Shujaa[1]from which its owner will flee, but it will chase him (saying), I am your hoarded treasure, and it will keep (chasing him) until he gives it his finger to swallow.\"'",
      "chain": [
        "38437",
        "20448",
        "20428",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "2464",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرني عمران بن بكار، قال حدثنا علي بن عياش، قال حدثنا شعيب، قال حدثني أبو الزناد، مما حدثه عبد الرحمن الأعرج، مما ذكر أنه سمع أبا هريرة، يحدث قال وقال عمر أمر رسول الله صلى الله عليه وسلم بصدقة فقيل منع ابن جميل وخالد بن الوليد وعباس بن عبد المطلب ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ ما ينقم ابن جميل إلا أنه كان فقيرا فأغناه الله وأما خالد بن الوليد فإنكم تظلمون خالدا قد احتبس أدراعه وأعتده في سبيل الله وأما العباس بن عبد المطلب عم رسول الله صلى الله عليه وسلم فهي عليه صدقة ومثلها معها ‏\"‏ ‏.‏",
      "text_en": " Abu Hurariah said:                     \"Umar said: 'The Messenger of Allah enjoined Sadaqah and it was said that Ibn Jamil, Khalid bin Al-Walid and 'Abbas bin 'Abdul-Muttalib had withheld some. The Messenger of Allah said: What is the matter with Ibn Jamil? Was he not poor then Allah made him rich? As for Khalid bin Al-Walid, you are being unfair to Khalid, for he is saving his shields and weapons for the sake of Allah. As for Al-Abbas bin 'Abdul-Muttalib, the paternal uncle of the Messenger of Allah, it is and obligatory charity for him and he has to pay as much again.\"'",
      "chain": [
        "38437",
        "20448",
        "20428",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "2523",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا عمران بن بكار، قال حدثنا علي بن عياش، قال حدثنا شعيب، قال حدثني أبو الزناد، مما حدثه عبد الرحمن الأعرج، مما ذكر أنه سمع أبا هريرة، يحدث به عن رسول الله صلى الله عليه وسلم وقال ‏\"‏ قال رجل لأتصدقن بصدقة فخرج بصدقته فوضعها في يد سارق فأصبحوا يتحدثون تصدق على سارق فقال اللهم لك الحمد على سارق لأتصدقن بصدقة فخرج بصدقته فوضعها في يد زانية فأصبحوا يتحدثون تصدق الليلة على زانية فقال اللهم لك الحمد على زانية لأتصدقن بصدقة فخرج بصدقته فوضعها في يد غني فأصبحوا يتحدثون تصدق على غني قال اللهم لك الحمد على زانية وعلى سارق وعلى غني فأتي فقيل له أما صدقتك فقد تقبلت أما الزانية فلعلها أن تستعف به من زناها ولعل السارق أن يستعف به عن سرقته ولعل الغني أن يعتبر فينفق مما أعطاه الله عز وجل ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah said:                     \"A man said\" 'I am going to give some charity.' So he went out with his charity and put it in the hand of a thief. The next morning they started talking about how charity had been given to a thief. Then he said: 'O Allah, to You be praise for the thief. I am going to give some charity.' So he went out with his charity and put it in the hand of a prostitute. The next morning they started talking about how charity had been given to a prostitute. He said: 'O Allah, to You be praise for the prostitute. I am going to give some charity. So he went out with his charity and put it in the hand of a rich man. The next morning they started talking about how charity had been given to a rich man. He said: 'O Allah, th You be praise for the prostitute, the thief and the rich man. 'Then the message came to him: As for your charity, it is accepted. As for the prostitute, perhaps it will keep her from committing Zina. As for the thief, perhaps it will stop him from stealing. And as for the rich man, perhaps he will learn a lesson, and will spend from that which Allah, the Mighty and Sublime, has given him.\"'",
      "chain": [
        "38437",
        "20448",
        "20428",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "2877",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا عمران بن بكار، قال حدثنا بشر، أخبرني أبي، عن الزهري، أخبرني سحيم، أنه سمع أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ يغزو هذا البيت جيش فيخسف بهم بالبيداء ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah said:                     \"The Messenger of Allah said: This Hosue will be attacked by an army, and they will be swallowed up by the earth in Al-Baida'.\"",
      "chain": [
        "38437",
        "30126",
        "11013",
        "12121",
        "13"
      ]
    },
    {
      "hadith_no": "3223",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا عمران بن بكار بن راشد، قال حدثنا أبو اليمان، قال أنبأنا شعيب، عن الزهري، قال أخبرني عروة بن الزبير، عن عائشة، أن أبا حذيفة بن عتبة بن ربيعة بن عبد شمس، - وكان ممن شهد بدرا مع رسول الله صلى الله عليه وسلم - تبنى سالما وأنكحه ابنة أخيه هند بنت الوليد بن عتبة بن ربيعة بن عبد شمس وهو مولى لامرأة من الأنصار كما تبنى رسول الله صلى الله عليه وسلم زيدا وكان من تبنى رجلا في الجاهلية دعاه الناس ابنه فورث من ميراثه حتى أنزل الله عز وجل في ذلك ‏{‏ ادعوهم لآبائهم هو أقسط عند الله فإن لم تعلموا آباءهم فإخوانكم في الدين ومواليكم ‏}‏ فمن لم يعلم له أب كان مولى وأخا في الدين ‏.‏ مختصر ‏.‏",
      "text_en": " Narrated 'Aishah:                     It was narrated from 'Aishah that Abu Hudhaifah bin 'Utbah bin Rabi'ah bin 'Abd Shams --who was one of those who had been present at Badr with the Messenger of Allah-- adopted Salim and married him to his brother's daughter, Hind bint Al-Walid bin 'Utbah bin Rabi'ah bin 'Abd Shams, and he was a freed slave of an Ansari woman --as the Messenger of Allah had adopted Zaid. During the Jahiliyyah, if a man adopted someone, the people would call him his son, and he would inherit from his legacy, until Allah, the Mighty and Sublime, revealed about that: 'Call them by (the names of) their fathers, that is more just with Allah. But if you know not their fathers' (names, call them) your brothers in Faith and Mawalikum (your freed slaves).\" Then if a person's father's name was not known, he would be their freed slave and brother in faith.",
      "chain": [
        "38437",
        "30330",
        "20428",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "3284",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا عمران بن بكار، قال حدثنا أبو اليمان، قال أنبأنا شعيب، قال أخبرني الزهري، قال أخبرني عروة، أن زينب بنت أبي سلمة، - وأمها أم سلمة زوج النبي صلى الله عليه وسلم - أخبرته أن أم حبيبة بنت أبي سفيان أخبرتها أنها قالت يا رسول الله أنكح أختي بنت أبي سفيان ‏.‏ قالت فقال رسول الله صلى الله عليه وسلم ‏\"‏ أوتحبين ذلك ‏\"‏ ‏.‏ فقلت نعم لست لك بمخلية وأحب من يشاركني في خير أختي ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ إن أختك لا تحل لي ‏\"‏ ‏.‏ فقلت والله يا رسول الله إنا لنتحدث أنك تريد أن تنكح درة بنت أبي سلمة ‏.‏ فقال ‏\"‏ بنت أم سلمة ‏\"‏ ‏.‏ فقلت نعم ‏.‏ فقال ‏\"‏ والله لولا أنها ربيبتي في حجري ما حلت لي إنها لابنة أخي من الرضاعة أرضعتني وأبا سلمة ثويبة فلا تعرضن على بناتكن ولا أخواتكن ‏\"‏ ‏.‏",
      "text_en": " 'Urwah narrated that Zainab bint Abi Salamah -whose mother was Umm Salamah, the wife of the Prophet- told him that Umm Habibah bint Abi Sufyan told her that she said:                      \"O Messenger of Allah, marry my sister, the daughter of Abu Sufyan.\" She said: \"The Messenger of Allah said: 'Would you like that?' I said: 'Yes; I do not have you all to myself and I would like to share this goodness with my sister.' The Prophet said: 'Your sister is not permissible for me (to marry).' I said: 'By Allah, O Messenger of Allah, we have been saying that you want to marry Durrah bint Abi Salamah.' He said: 'The daughter of Umm Salamah?' I said: 'Yes.' He said: 'By Allah, even if she were not my stepdaughter who is in my care, she would not be permissible for me (to marry), because she is the daughter of my brother through breast-feeding. Thuwaibah breastfed Abu Salamah and I. So do not offer your daughters or sisters to me in marriage.'\"",
      "chain": [
        "38437",
        "30330",
        "20428",
        "11013",
        "10511"
      ]
    },
    {
      "hadith_no": "3438",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا عمران بن بكار، قال حدثنا علي بن عياش، قال حدثني شعيب، قال حدثني أبو الزناد، مما حدثه عبد الرحمن الأعرج، مما ذكر أنه سمع أبا هريرة، يحدث عن رسول الله صلى الله عليه وسلم قال قال ‏\"‏ انظروا كيف يصرف الله عني شتم قريش ولعنهم إنهم يشتمون مذمما ويلعنون مذمما وأنا محمد ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah said:                      \"Look at how Allah diverts the insults and curses of Quraish from me. They insult 'Mudhammam' and curse 'Mudhammam' -but I am Muhammad.\"",
      "chain": [
        "38437",
        "20448",
        "20428",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "3609",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Endowments - كتاب الإحباس",
      "chapter_no": "29",
      "text_ar": "أخبرنا عمران بن بكار بن راشد، قال حدثنا خطاب بن عثمان، قال حدثنا عيسى بن يونس، حدثني أبي، عن أبي إسحاق، عن أبي سلمة بن عبد الرحمن، أن عثمان، أشرف عليهم حين حصروه فقال أنشد بالله رجلا سمع من رسول الله صلى الله عليه وسلم يقول يوم الجبل حين اهتز فركله برجله وقال ‏\"‏ اسكن فإنه ليس عليك إلا نبي أو صديق أو شهيدان ‏\"‏ ‏.‏ وأنا معه فانتشد له رجال ثم قال أنشد بالله رجلا شهد رسول الله صلى الله عليه وسلم يوم بيعة الرضوان يقول ‏\"‏ هذه يد الله وهذه يد عثمان ‏\"‏ ‏.‏ فانتشد له رجال ثم قال أنشد بالله رجلا سمع رسول الله صلى الله عليه وسلم يوم جيش العسرة يقول ‏\"‏ من ينفق نفقة متقبلة ‏\"‏ ‏.‏ فجهزت نصف الجيش من مالي فانتشد له رجال ثم قال أنشد بالله رجلا سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ من يزيد في هذا المسجد ببيت في الجنة ‏\"‏ ‏.‏ فاشتريته من مالي فانتشد له رجال ثم قال أنشد بالله رجلا شهد رومة تباع فاشتريتها من مالي فأبحتها لابن السبيل فانتشد له رجال ‏.‏",
      "text_en": " It was narrated from Abu Salamah bin 'Abdur-Rahman that 'Uthman looked out over them when they besieged him and said:                      \"By Allah, I adjure a man who heard the Messenger of Allah, on the day when the mountain shook with him, and he kicked it with his foot and said: 'Be still, for there is no one upon you but a Prophet or a Siddiq or two martyrs,' and I was with him.\" Some men responded and affirmed that. Then he said: \"By Allah, I adjure a man who witnessed the Messenger of Allah, on the day of Bai'at Al-Ridwan, say: 'This is the Hand of Allah and this is the hand of 'Uthman.'\" Some men responded and affirmed that. He said: \"By Allah, I adjure a man who heard the Messenger of Allah say, on the day of the army of Al-'Usrah (i.e. Tabuk): 'Who sill spend and it will be accepted?' And I equipped half of the army from my own wealth.\" Some men responded and affirmed that. Then he said: \"By Allah, I adjure a man who heard the Messenger of Allah say: 'Who will add to this Masjid in return for a house in Paradise,' and I bought it with my own wealth.\" Some men responded and affirmed that. Then he said: \"By Allah, I adjure a man who witness Rumah being sold, and I bought it from my own wealth and allowed wayfarers to use it.\" Some men responded and affirmed that.",
      "chain": [
        "38437",
        "30334",
        "20347",
        "10846",
        "11049",
        "10567"
      ]
    },
    {
      "hadith_no": "3746",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of 'Umra - كتاب العمرى",
      "chapter_no": "34",
      "text_ar": "أخبرنا عمران بن بكار، قال حدثنا أبو اليمان، قال حدثنا شعيب، عن الزهري، قال حدثني أبو سلمة بن عبد الرحمن، أن جابرا، أخبره أن رسول الله صلى الله عليه وسلم قضى أنه من أعمر رجلا عمرى له ولعقبه فإنها للذي أعمرها يرثها من صاحبها الذي أعطاها ما وقع من مواريث الله وحقه ‏.‏",
      "text_en": " Shua'ib narrated from Az-Zuhri, who said:                      \"Abu Salamah bin 'Abdur-Rahman narrated to me, that Jabir told him: 'The Messenger of Allah ruled that whoever gives a lifelong gift to a man, it belongs to him and to his heirs. It belongs to the one to whom it was given, on the basis of 'Umra. It will be inherited from its recipient according to Allah's (injunctions on) inheritance and its rights.'\"",
      "chain": [
        "38437",
        "30330",
        "20428",
        "11013",
        "10567",
        "34"
      ]
    },
    {
      "hadith_no": "3831",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا عمران بن بكار، قال حدثنا علي بن عياش، قال أنبأنا شعيب، قال حدثني أبو الزناد، مما حدثه عبد الرحمن الأعرج، مما ذكر أنه سمع أبا هريرة، يحدث به عن رسول الله صلى الله عليه وسلم قال ‏\"‏ قال سليمان بن داود لأطوفن الليلة على تسعين امرأة كلهن يأتي بفارس يجاهد في سبيل الله عز وجل فقال له صاحبه إن شاء الله ‏.‏ فلم يقل إن شاء الله فطاف عليهن جميعا فلم تحمل منهن إلا امرأة واحدة جاءت بشق رجل وايم الذي نفس محمد بيده لو قال إن شاء الله لجاهدوا في سبيل الله فرسانا أجمعين ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah said:                      \"Sulaiman bin Dawud said: 'Tonight I will go around ninety women, each of whom will bear a horseman who will perform Jihad in the cause of Allah.' His companion said to him: 'If Allah wills.' But he did not say: 'If Allah wills.' Then he went around to them all, but none of them got pregnant except a woman who bore half a man. By the One in Whose Hand is my soul! If he had said, 'If Allah wills,' they would all have performed Jihad in the cause of Allah as horsemen.\"",
      "chain": [
        "38437",
        "20448",
        "20428",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "3945",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Kind Treatment of Women - كتاب عشرة النساء",
      "chapter_no": "36",
      "text_ar": "أخبرني عمران بن بكار الحمصي، قال حدثنا أبو اليمان، قال أنبأنا شعيب، عن الزهري، قال أخبرني محمد بن عبد الرحمن بن الحارث بن هشام، أن عائشة، قالت فذكرت نحوه وقالت أرسل أزواج النبي صلى الله عليه وسلم زينب فاستأذنت فأذن لها فدخلت فقالت نحوه ‏.‏ خالفهما معمر رواه عن الزهري عن عروة عن عائشة ‏.‏",
      "text_en": " It was narrated that 'Aishah mentioned a similar report and said:                      \"The wives of the Prophet sent Zainab and she asked him permission to enter and she entered.\" And she said something similar. Ma'mar contradicted the two of them; he reported it from Az-Zuhri, from 'Urwah, from 'Aishah.",
      "chain": [
        "38437",
        "30330",
        "20428",
        "11013",
        "53"
      ]
    },
    {
      "hadith_no": "4196",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of al-Bay'ah - كتاب البيعة",
      "chapter_no": "39",
      "text_ar": "أخبرنا عمران بن بكار، قال حدثنا علي بن عياش، قال حدثنا شعيب، قال حدثني أبو الزناد، مما حدثه عبد الرحمن الأعرج، مما ذكر أنه سمع أبا هريرة، يحدث عن رسول الله صلى الله عليه وسلم قال ‏\"‏ إنما الإمام جنة يقاتل من ورائه ويتقى به فإن أمر بتقوى الله وعدل فإن له بذلك أجرا وإن أمر بغيره فإن عليه وزرا ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah said:                     \"The Imam is like a shield whose orders should be obeyed when they (the Muslims) fight, and where they should seek protection. If he enjoins fear of Allah and behaves justly, then he will be rewarded, but if he enjoins otherwise, then it will be a burden (of sin) on him.\"",
      "chain": [
        "38437",
        "20448",
        "20428",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "4765",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا عمران بن بكار، قال أنبأنا أحمد بن خالد، قال حدثنا محمد، عن عطاء بن أبي رباح، عن صفوان بن عبد الله، عن عميه، سلمة ويعلى ابنى أمية قالا خرجنا مع رسول الله صلى الله عليه وسلم في غزوة تبوك ومعنا صاحب لنا فقاتل رجلا من المسلمين فعض الرجل ذراعه فجذبها من فيه فطرح ثنيته فأتى الرجل النبي صلى الله عليه وسلم يلتمس العقل فقال ‏\"‏ ينطلق أحدكم إلى أخيه فيعضه كعضيض الفحل ثم يأتي يطلب العقل لا عقل لها ‏\"‏ ‏.‏ فأبطلها رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated from Safwan bin 'Abdullah that his two paternal uncles, Salamah and Ya'la, the sons of Umayyah, said:                     \"We went out with the Messenger of Allah on the campaign of Tabuk, and there was a friend of ours with us, who fought with a man from among the Muslims. The man bit him on the forearm, so he pulled it away from his mouth and a tooth fell out. The man came to the Prophet, seeking blood money, but his brother and bite him like a stallion bites, then come and demand blood money? There is no blood money for that.\" And the Messenger of Allah juddgedit to be invalid.",
      "chain": [
        "38437",
        "20278",
        "11029",
        "10920"
      ]
    },
    {
      "hadith_no": "4898",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرنا عمران بن بكار، قال حدثنا بشر بن شعيب، قال أخبرني أبي، عن الزهري، عن عروة، عن عائشة، قالت استعارت امرأة على ألسنة أناس يعرفون - وهي لا تعرف - حليا فباعته وأخذت ثمنه فأتي بها رسول الله صلى الله عليه وسلم فسعى أهلها إلى أسامة بن زيد فكلم رسول الله صلى الله عليه وسلم فيها فتلون وجه رسول الله صلى الله عليه وسلم وهو يكلمه ثم قال له رسول الله صلى الله عليه وسلم ‏\"‏ أتشفع إلى في حد من حدود الله ‏\"‏ ‏.‏ فقال أسامة استغفر لي يا رسول الله ‏.‏ ثم قام رسول الله صلى الله عليه وسلم عشيتئذ فأثنى على الله عز وجل بما هو أهله ثم قال ‏\"‏ أما بعد فإنما هلك الناس قبلكم أنهم كانوا إذا سرق الشريف فيهم تركوه وإذا سرق الضعيف فيهم أقاموا عليه الحد والذي نفس محمد بيده لو أن فاطمة بنت محمد سرقت لقطعت يدها ‏\"‏ ‏.‏ ثم قطع تلك المرأة ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"A woman borrowed some jewelry, saying that other people whose names were known but hers was not then she sold it and kept the money. She was brought to the Messenger of Allah, and her people went to Usamah bin Zaid, who spoke to the Messenger of Allah concerning her. The face of ht Messenger of Allah changed color while he was speaking to him. Then the Messenger of Allah said to him: 'Are you interceding with me concerning one of ht Hadd punishments decreed by Allah?' Usamah said: 'Pray for forgiveness for me, O Messenger of Allah! Then the Messenger of Allah stood up that evening, he praised and glorified Allah, the mighty and sublime, as he deserves, then he said: 'The people who came before you were destroyed because, whenever a noble person among them stole, they let him go. But if a low-class person stole, they would carry out the punishment on him. By the One in whose hand is the soul of Muhammad, if Fatimah bint Muhammad were to steal, I would cut off her hand.' Then he cut off that woman.\"",
      "chain": [
        "38437",
        "30317",
        "20428",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "5015",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book Of Faith and its Signs - كتاب الإيمان وشرائعه",
      "chapter_no": "47",
      "text_ar": "أخبرنا عمران بن بكار قال حدثنا علي بن عياش قال حدثنا شعيب قال حدثنا أبو الزناد مما حدثه عبد الرحمن بن هرمز مما ذكر أنه سمع أبا هريرة يحدث به  عن رسول الله صلى الله عليه وسلم قال والذي نفسي بيده لا يؤمن أحدكم حتى أكون أحب إليه من ولده ووالده",
      "text_en": " Abu Hurairah narrated that:                     The Messenger of Allah [SAW] said: \"By the One in Whose hand is my soul, none of you has believed until I am dearer to him than his son or his father.'\"",
      "chain": [
        "38437",
        "20448",
        "20428",
        "13"
      ]
    },
    {
      "hadith_no": "5402",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Etiquette of Judges - كتاب آداب القضاة",
      "chapter_no": "49",
      "text_ar": "أخبرنا عمران بن بكار بن راشد، قال حدثنا علي بن عياش، قال حدثنا شعيب، قال حدثني أبو الزناد، مما حدثه عبد الرحمن الأعرج، مما ذكر أنه سمع أبا هريرة، يحدث به عن رسول الله صلى الله عليه وسلم قال وقال ‏\"‏ بينما امرأتان معهما ابناهما جاء الذئب فذهب بابن إحداهما فقالت هذه لصاحبتها إنما ذهب بابنك ‏.‏ وقالت الأخرى إنما ذهب بابنك ‏.‏ فتحاكمتا إلى داود عليه السلام فقضى به للكبرى فخرجتا إلى سليمان بن داود فأخبرتاه فقال ائتوني بالسكين أشقه بينهما ‏.‏ فقالت الصغرى لا تفعل يرحمك الله هو ابنها ‏.‏ فقضى به للصغرى ‏\"‏ ‏.‏ قال أبو هريرة والله ما سمعت بالسكين قط إلا يومئذ ما كنا نقول إلا المدية ‏.‏",
      "text_en": " Abu Hurairah narrated that:                     The Messenger of Allah [SAW] said: \"There were two woman who had two children, and the wolf came and took away the son of one of them. She said to her companion: 'It took away your son.' The other one said: 'No, it took away your son.' They referred the matter to Dawud, peace be upon him, for judgment (about the remaining child) and he ruled in favor of the older one. Then they went out to Sulaiman bin Dawud and told him (about that). He said: 'Give me a knife and I will cut him in half (to be shared) between you.' The younger one said: 'Do not do that, may Allah have mercy on you; he is her son.' So he ruled that (the child) belonged to the younger woman.\" Abu Hurairah said: \"By Allah! I never heard 'Sikkin' used until that day. We would only say: 'Mudyah.'\"",
      "chain": [
        "38437",
        "20448",
        "20428",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "5497",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا عمران بن بكار، قال حدثنا أحمد بن خالد، قال حدثنا يونس، عن أبي إسحاق، - يعني أباه - عن عمرو بن ميمون، قال حججت مع عمر فسمعته يقول بجمع ألا إن النبي صلى الله عليه وسلم كان يتعوذ من خمس ‏\"‏ اللهم إني أعوذ بك من البخل والجبن وأعوذ بك من سوء العمر وأعوذ بك من فتنة الصدر وأعوذ بك من عذاب القبر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Amr bin Maimun said:                     \"I went for Hajj with 'Umar, and in Muzdalifah, I heard him say that the Prophet [SAW] used to seek refuge from five things: 'Allahumma inni a'udhu bika minal-bukhli, wal-jubni, wa a'udhu bika min su'il-'umuri, wa a'udhu bika min fitnatis-sadri, wa a'udhu bika min 'adhabil-qabr (O Allah, I seek refuge with You from miserliness and cowardice, and I seek refuge with You from reaching the age of second childhood, and I seek refuge in You from the ills of the heart, and I seek refuge in You from the torment of the grave.'\"",
      "chain": [
        "38437",
        "20475",
        "11382"
      ]
    },
    {
      "hadith_no": "5524",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرني عمران بن بكار، قال حدثنا أبو المغيرة، قال حدثنا الأوزاعي، قال حدثني عبدة، قال حدثني ابن يساف، قال سئلت عائشة ما كان أكثر ما كان يدعو به النبي صلى الله عليه وسلم قالت كان أكثر دعائه أن يقول ‏\"‏ اللهم إني أعوذ بك من شر ما عملت ومن شر ما لم أعمل بعد ‏\"‏ ‏.‏",
      "text_en": " Ibn Yasaf said:                     \"I asked 'Aishah, what was the supplication that the Prophet [SAW] said the most? She said: 'The supplication that he said the most was: Allahumma, inni a'udhu bika min sharri ma 'amiltu wa min sharri ma lam a'mal ba'd (O Allah, I seek refuge with You from the evil of what I have done, and from the evil of what I have not done yet.)'\"",
      "chain": [
        "38437",
        "20442",
        "20024",
        "20337"
      ]
    }
  ],
  "total_hadiths": 20
}