{
  "id": "38462",
  "name": "Kathir bin 'Ubaid bin Nmyr كثير بن عبيد بن نمير المذحجي",
  "full_name": "Kathir bin 'Ubaid bin Nmyr كثير بن عبيد بن نمير المذحجي",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "250",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Hims"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ د  س  ق  -  ثقة ]"
    ],
    "tags": [
      "al-Himsi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "id": "sunan-abi-daud-706",
      "hadith_no": "706",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا كثير بن عبيد يعني المذحجي، حدثنا أبو حيوة، عن سعيد، بإسناده ومعناه زاد فقال ‏\"‏ قطع صلاتنا قطع الله أثره ‏\"‏ ‏.‏ قال أبو داود ورواه أبو مسهر عن سعيد قال فيه ‏\"‏ قطع صلاتنا ‏\"‏ ‏.‏",
      "text_en": " This tradition as also been reported by Sa’id through the same chain of narrators and to the same effect. He added:                      He cut off our prayer, may Allah cut off his walking.Abu Dawud said: This version narrated by Mushir on the authority of Sa’id has: He cut off our prayer.",
      "usc_msa_ref": "",
      "chain": [
        "38462",
        "30002",
        "30284",
        "11168"
      ]
    },
    {
      "id": "sunan-abi-daud-2126",
      "hadith_no": "2126",
      "source": "Sunan Abi Da'ud",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا كثير بن عبيد الحمصي، حدثنا أبو حيوة، عن شعيب، - يعني ابن أبي حمزة - حدثني غيلان بن أنس، حدثني محمد بن عبد الرحمن بن ثوبان، عن رجل، من أصحاب النبي صلى الله عليه وسلم أن عليا عليه السلام لما تزوج فاطمة بنت رسول الله صلى الله عليه وسلم ورضي الله عنها أراد أن يدخل بها فمنعه رسول الله صلى الله عليه وسلم حتى يعطيها شيئا فقال يا رسول الله ليس لي شىء ‏.‏ فقال له النبي صلى الله عليه وسلم ‏\"‏ أعطها درعك ‏\"‏ ‏.‏ فأعطاها درعه ثم دخل بها ‏.‏",
      "text_en": " Muhammad ibn Abdur Rahman ibn Thawban reported on the authority of a man from the Companions of the Prophet (ﷺ):                      When Ali married Fatimah, daughter of the Messenger of Allah (ﷺ), he intended to have intercourse with her. The Messenger of Allah (ﷺ) prohibited him to do so until he gave her something. Ali said: I have nothing with me, Messenger of Allah. The Prophet (ﷺ) said: Give her your coat of mail. So he gave her his coat of mail, and then cohabited with her.",
      "usc_msa_ref": "",
      "chain": [
        "38462",
        "20428",
        "17536",
        "11218"
      ]
    },
    {
      "id": "sunan-abi-daud-2127",
      "hadith_no": "2127",
      "source": "Sunan Abi Da'ud",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا كثير، - يعني ابن عبيد - حدثنا أبو حيوة، عن شعيب، عن غيلان، عن عكرمة، عن ابن عباس، مثله ‏.‏",
      "text_en": " A similar tradition has also been transmitted by  Ibn 'Abbas through a different chain of narrators.",
      "usc_msa_ref": "",
      "chain": [
        "38462",
        "20428",
        "11300",
        "11023"
      ]
    },
    {
      "id": "sunan-abi-daud-2178",
      "hadith_no": "2178",
      "source": "Sunan Abi Da'ud",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا كثير بن عبيد، حدثنا محمد بن خالد، عن معرف بن واصل، عن محارب بن دثار، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏\"‏ أبغض الحلال إلى الله تعالى الطلاق ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     The Prophet (ﷺ) said: Of all the lawful acts the most detestable to Allah is divorce.",
      "usc_msa_ref": "",
      "chain": [
        "38462",
        "38496",
        "11389",
        "18"
      ]
    },
    {
      "id": "sunan-abi-daud-3417",
      "hadith_no": "3417",
      "source": "Sunan Abi Da'ud",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا عمرو بن عثمان، وكثير بن عبيد، قالا حدثنا بقية، حدثني بشر بن عبد الله بن يسار، قال عمرو حدثني عبادة بن نسى، عن جنادة بن أبي أمية، عن عبادة بن الصامت، نحو هذا الخبر - والأول أتم - فقلت ما ترى فيها يا رسول الله فقال ‏\"‏ جمرة بين كتفيك تقلدتها ‏\"‏ ‏.‏ أو ‏\"‏ تعلقتها ‏\"‏ ‏.‏",
      "text_en": " A similar tradition has also been transmitted by 'Ubadah b. al-Samit through a different chain of narrators, but the former tradition is more perfect. This version has:                      I said: What do you think about it, Messenger of Allah? He said: A live coal between your shoulders which you have put around your neck or hanged it.",
      "usc_msa_ref": "",
      "chain": [
        "10581",
        "38462",
        "20644",
        "11081",
        "3205",
        "40"
      ]
    },
    {
      "id": "sunan-abi-daud-3859",
      "hadith_no": "3859",
      "source": "Sunan Abi Da'ud",
      "chapter": "Medicine (Kitab Al-Tibb) - كتاب الطب",
      "chapter_no": "29",
      "text_ar": "حدثنا عبد الرحمن بن إبراهيم الدمشقي، وكثير بن عبيد، قالا حدثنا الوليد، عن ابن ثوبان، عن أبيه، عن أبي كبشة الأنماري، - قال كثير إنه حدثه - أن النبي صلى الله عليه وسلم كان يحتجم على هامته وبين كتفيه وهو يقول ‏\"‏ من أهراق من هذه الدماء فلا يضره أن لا يتداوى بشىء لشىء ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Kabshah al-Ansari:                     The Messenger of Allah (ﷺ) used to have himself cupped on the top of his head and between his shoulders, and that he used to say: If anyone pours out any of his blood, he will not suffer if he applies no medical treatment for anything.",
      "usc_msa_ref": "",
      "chain": [
        "38462",
        "20733",
        "5371",
        "15476"
      ]
    },
    {
      "id": "sunan-abi-daud-4058",
      "hadith_no": "4058",
      "source": "Sunan Abi Da'ud",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا عمرو بن عثمان، وكثير بن عبيد الحمصيان، قالا حدثنا بقية، عن الزبيدي، عن الزهري، عن أنس بن مالك، أنه حدثه أنه، رأى على أم كلثوم بنت رسول الله صلى الله عليه وسلم بردا سيراء ‏.‏ قال والسيراء المضلع بالقز ‏.‏",
      "text_en": " Anas b. Malik said that he saw a striped garment over Umm Kulthum, daughter of the Messenger of Allah (ﷺ). He said:                      The word \"siyara\" means striped with silk.",
      "usc_msa_ref": "",
      "chain": [
        "10581",
        "38462",
        "20644",
        "20459",
        "11013",
        "19"
      ]
    },
    {
      "id": "sunan-abi-daud-4522",
      "hadith_no": "4522",
      "source": "Sunan Abi Da'ud",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا محمود بن خالد، وكثير بن عبيد، قالا حدثنا ح، وحدثنا محمد بن الصباح بن سفيان، أخبرنا الوليد، عن أبي عمرو، عن عمرو بن شعيب، عن رسول الله صلى الله عليه وسلم أنه قتل بالقسامة رجلا من بني نصر بن مالك ببحرة الرغاء على شط لية البحرة قال القاتل والمقتول منهم ‏.‏ وهذا لفظ محمود ببحرة أقامه محمود وحده على شط لية البحرة ‏.‏",
      "text_en": " Narrated 'Amr b. Shu'aib:                     The Messenger of Allah (ﷺ) killed a man of Banu Nadr ibn Malik at Harrah ar-Righa' at the bank of Layyat al-Bahrah. The transmitter Mahmud (ibn Khalid) also mentioned the words along with the words \"at Bahrah\" \"the slayer and the slain were from among them\". Mahmud alone transmitted in this tradition the words \"at the bank of Layyah\".",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "38462",
        "30269",
        "20733",
        "19934"
      ]
    },
    {
      "id": "sunan-abi-daud-4712",
      "hadith_no": "4712",
      "source": "Sunan Abi Da'ud",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا عبد الوهاب بن نجدة، حدثنا بقية، ح وحدثنا موسى بن مروان الرقي، وكثير بن عبيد المذحجي، قالا حدثنا محمد بن حرب، - المعنى - عن محمد بن زياد، عن عبد الله بن أبي قيس، عن عائشة، قالت قلت يا رسول الله ذراري المؤمنين فقال ‏\"‏ هم من آبائهم ‏\"‏ ‏.‏ فقلت يا رسول الله بلا عمل قال ‏\"‏ الله أعلم بما كانوا عاملين ‏\"‏ ‏.‏ قلت يا رسول الله فذراري المشركين قال ‏\"‏ من آبائهم ‏\"‏ ‏.‏ قلت بلا عمل قال ‏\"‏ الله أعلم بما كانوا عاملين ‏\"‏ ‏.‏",
      "text_en": " ‘A’ishah said :                      I said : Messenger of Allah (May peace be upon him) what happens to the offspring of believers ? He replied : They are joined to their parents. I asked : Messenger of Allah! Although they have done nothing ? He replied : Allah knows best what they were doing. I asked : what happens to the offspring of polytheists, Messenger of Allah ? he replied! They are joined to their parents. I asked : Although they have done nothing? He replied : Allah knows best what they were doing.",
      "usc_msa_ref": "",
      "chain": [
        "38363",
        "20644",
        "35154",
        "38462",
        "30373",
        "11216",
        "11515",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-4818",
      "hadith_no": "4818",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن عيسى بن الطباع، وكثير بن عبيد، قالا حدثنا مروان، - قال ابن عيسى قال - حدثنا حميد، عن أنس، قال جاءت امرأة إلى رسول الله صلى الله عليه وسلم فقالت يا رسول الله إن لي إليك حاجة ‏.‏ فقال لها ‏\"‏ يا أم فلان اجلسي في أى نواحي السكك شئت حتى أجلس إليك ‏\"‏ ‏.‏ قال فجلست فجلس النبي صلى الله عليه وسلم إليها حتى قضت حاجتها ‏.‏ ولم يذكر ابن عيسى حتى قضت حاجتها ‏.‏ وقال كثير عن حميد عن أنس ‏.‏",
      "text_en": " Narrated Anas ibn Malik:                     A woman came to the Messenger of Allah (ﷺ) and said: Messenger of Allah: I have some need with you. He said to her: Mother of so and so, sit in the corner of any street you wish and I shall sit with you. So she sat and the Messenger of Allah (ﷺ) also sat with her till she fulfilled her need.The narrator Ibn 'Isa did not mention \"till she fulfilled her need.\" And Kathir said: from Humaid on the authority of Anas.",
      "usc_msa_ref": "",
      "chain": [
        "36649",
        "38462",
        "20201",
        "11279",
        "19"
      ]
    },
    {
      "id": "sunan-abi-daud-5085",
      "hadith_no": "5085",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا كثير بن عبيد، حدثنا بقية بن الوليد، عن عمر بن جعثم، قال حدثني الأزهر بن عبد الله الحرازي، قال حدثني شريق الهوزني، قال دخلت على عائشة رضى الله عنها فسألتها بم كان رسول الله صلى الله عليه وسلم يفتتح إذا هب من الليل فقالت لقد سألتني عن شىء ما سألني عنه أحد قبلك كان إذا هب من الليل كبر عشرا وحمد عشرا وقال ‏\"‏ سبحان الله وبحمده ‏\"‏ ‏.‏ عشرا وقال ‏\"‏ سبحان الملك القدوس ‏\"‏ ‏.‏ عشرا واستغفر عشرا وهلل عشرا ثم قال ‏\"‏ اللهم إني أعوذ بك من ضيق الدنيا وضيق يوم القيامة ‏\"‏ ‏.‏ عشرا ثم يفتتح الصلاة ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     Shariq al-Hawzani and I came to Aisha (Allah be pleased with her) and asked her: By which (prayer) the Messenger of Allah (ﷺ) began when he woke up at night? She replied: You asked me about a thing which no one asked me before. When he woke up at night, he uttered: \"Allah is Most Great\" ten times, and uttered \"Praise be to Allah\" ten times, and said \"Glory be to Allah and I begin with His praise\" ten times, and said: \"Glory be to the King, the Most Holy\" ten times, and asked Allah's pardon ten times, and said: \"There is no god but Allah\" ten times, and then said: \"O Allah! I seek refuge in Thee from the strait of the Day of resurrection,\" ten times. He then began the prayer.",
      "usc_msa_ref": "",
      "chain": [
        "38462",
        "20644",
        "18019"
      ]
    },
    {
      "id": "sunan-an-nasai-197",
      "hadith_no": "197",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا كثير بن عبيد، عن محمد بن حرب، عن الزبيدي، عن الزهري، عن عروة، أن عائشة، أخبرته أن أم سليم كلمت رسول الله صلى الله عليه وسلم وعائشة جالسة فقالت له يا رسول الله إن الله لا يستحيي من الحق أرأيت المرأة ترى في النوم ما يرى الرجل أفتغتسل من ذلك فقال لها رسول الله صلى الله عليه وسلم ‏\"‏ نعم ‏\"‏ ‏.‏ قالت عائشة فقلت لها أف لك أوترى المرأة ذلك فالتفت إلى رسول الله صلى الله عليه وسلم فقال ‏\"‏ تربت يمينك فمن أين يكون الشبه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Urwah that 'Aishah told him that Umm Sulaim spoke to the Messenger of Allah (ﷺ) when 'Aishah was sitting there. She said to him:                      \"O Messenger of Allah! Allah is not shy to tell the truth. Inform me: if a women sees in a dream what men see should she perform Ghusl from that?\" The Messenger of Allah (ﷺ) said to her: \"Yes.\" 'Aishah said: \"I expressed my displeasure and said: 'Does a woman see that?' The Messenger of Allah (ﷺ) turned to me and said: 'May your right hand be covered with dust! How else would (her child) resemble her?'\"",
      "usc_msa_ref": "",
      "chain": [
        "38462",
        "30373",
        "20459",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-486",
      "hadith_no": "486",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Salah - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "أخبرنا كثير بن عبيد، قال حدثنا محمد بن حرب، عن الزبيدي، عن الزهري، عن سعيد بن المسيب، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ تفضل صلاة الجمع على صلاة أحدكم وحده بخمسة وعشرين جزءا ويجتمع ملائكة الليل والنهار في صلاة الفجر واقرءوا إن شئتم ‏{‏ وقرآن الفجر إن قرآن الفجر كان مشهودا ‏}‏ ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:                      \"Prayer in congregation is twenty-five times more virtuous than the prayer of any one of you offered on his own. The angels of the night and the day meet at Fajr prayer. Recite if you wish: Verily, the recitation of the Qur'an in the early dawn is ever witnessed.\"[1][1]Al-Isra' 17:78.",
      "usc_msa_ref": "",
      "chain": [
        "38462",
        "30373",
        "20459",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-500",
      "hadith_no": "500",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا كثير بن عبيد، قال حدثنا محمد بن حرب، عن الزبيدي، عن الزهري، قال أخبرني أنس، أن رسول الله صلى الله عليه وسلم خرج حين زاغت الشمس فصلى بهم صلاة الظهر ‏.‏",
      "text_en": " It was narrated from Az-Zuhri he said:                      \"Anas told me that the Messenger of Allah (ﷺ) went out when the sun had passed its zenith, and led them in Zuhr prayer.\"",
      "usc_msa_ref": "",
      "chain": [
        "38462",
        "30373",
        "20459",
        "11013",
        "19"
      ]
    },
    {
      "id": "sunan-an-nasai-694-2",
      "hadith_no": "694",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Masjids - كتاب المساجد",
      "chapter_no": "8",
      "text_ar": "أخبرنا كثير بن عبيد، قال حدثنا محمد بن حرب، عن الزبيدي، عن الزهري، عن أبي سلمة بن عبد الرحمن، وأبي عبد الله الأغر، مولى الجهنيين وكانا من أصحاب أبي هريرة أنهما سمعا أبا هريرة يقول صلاة في مسجد رسول الله صلى الله عليه وسلم أفضل من ألف صلاة فيما سواه من المساجد إلا المسجد الحرام فإن رسول الله صلى الله عليه وسلم آخر الأنبياء ومسجده آخر المساجد ‏.‏ قال أبو سلمة وأبو عبد الله لم نشك أن أبا هريرة كان يقول عن حديث رسول الله صلى الله عليه وسلم فمنعنا أن نستثبت أبا هريرة في ذلك الحديث حتى إذا توفي أبو هريرة ذكرنا ذلك وتلاومنا أن لا نكون كلمنا أبا هريرة في ذلك حتى يسنده إلى رسول الله صلى الله عليه وسلم إن كان سمعه منه فبينا نحن على ذلك جالسنا عبد الله بن إبراهيم بن قارظ فذكرنا ذلك الحديث والذي فرطنا فيه من نص أبي هريرة فقال لنا عبد الله بن إبراهيم أشهد أني سمعت أبا هريرة يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ فإني آخر الأنبياء وإنه آخر المساجد ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Salamah bin 'Abdur-Rahman and Abu 'Abdullah Al-Agharr, the freed slave of the Juhanis - better of whom were companions of Abu Hurairah - that they heard Abu Hurairah say:                      \"One prayer in the Masjid of the  Messenger of Allah (ﷺ) is better than one thousand prayers offered in other mosques, except Al-Masjid Al-Haram, for the Messenger of Allah (ﷺ) was the last of the prophets and his Masjid was the last of the Masjids.\" Abu Salamah and Abu 'Abdullah said: \"We do not doubt that Abu Hurairah was speaking on the basis of the Hadith of the Messenger of Allah (ﷺ), but we could not verify that Hadith with Abu Hurairah before he died. Then we remembered that and we blamed one another for not having spoken to Abu Hurairah about that, so that he could attribute it to the Messenger of Allah (ﷺ) if he had indeed heard it from him. While we were arguing, we went and sat down with 'Abdullah bin Ibrahim bin Qariz, and we told him about the Hadith and how we had been negligent in not checking it with Abu Hurairah. 'Abdullah bin Ibrahim said to us: 'I bear witness that I heard Abu Hurairah say: The Messenger of Allah (ﷺ) said: I am the last of the prophets and it is the last of the Masjids.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38462",
        "30373",
        "20459",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-1216",
      "hadith_no": "1216",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا كثير بن عبيد، قال حدثنا محمد بن حرب، عن الزبيدي، عن الزهري، عن أبي سلمة، أن أبا هريرة، قال قام رسول الله صلى الله عليه وسلم إلى الصلاة وقمنا معه فقال أعرابي وهو في الصلاة اللهم ارحمني ومحمدا ولا ترحم معنا أحدا ‏.‏ فلما سلم رسول الله صلى الله عليه وسلم قال للأعرابي ‏\"‏ لقد تحجرت واسعا ‏\"‏ ‏.‏ يريد رحمة الله عز وجل ‏.‏",
      "text_en": " It was narrated from Abu Salamah that :                     Abu Hurairah said: \"The Messenger of Allah (ﷺ) stood up to pray and we stood up with him. A Bedouin said- while he was praying- 'O Allah, have mercy on me and Muhammad and do not have mercy on anyone else.' When the Messenger of Allah (ﷺ) said the Salam, he said to the Bedouin: 'You have limited something vast,\" meaning the mercy of Allah (SWT).\"",
      "usc_msa_ref": "",
      "chain": [
        "38462",
        "30373",
        "20459",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-1539",
      "hadith_no": "1539",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Fear Prayer - كتاب صلاة الخوف",
      "chapter_no": "18",
      "text_ar": "أخبرني كثير بن عبيد، عن بقية، عن شعيب، قال حدثني الزهري، قال حدثني سالم بن عبد الله، عن أبيه، قال غزوت مع رسول الله صلى الله عليه وسلم قبل نجد فوازينا العدو وصاففناهم فقام رسول الله صلى الله عليه وسلم يصلي بنا فقامت طائفة منا معه وأقبل طائفة على العدو فركع رسول الله صلى الله عليه وسلم ومن معه ركعة وسجد سجدتين ثم انصرفوا فكانوا مكان أولئك الذين لم يصلوا وجاءت الطائفة التي لم تصل فركع بهم ركعة وسجدتين ثم سلم رسول الله صلى الله عليه وسلم فقام كل رجل من المسلمين فركع لنفسه ركعة وسجدتين ‏.‏",
      "text_en": " Salim bin 'Abdullah narrated that his father said:                     \"I went out on a campaign with the Messenger of Allah (ﷺ) toward Najd. We confronted the enemy and formed ranks facing them. The Messenger of Allah (ﷺ) stood up and led us in prayer. Some of us stood with him and some of us faced the enemy. The Messenger of Allah (ﷺ) bowed and those who were with him bowed, and prostrated twice. Then they moved away and took the place of the others, and the other group who had not prayed came and he led them in bowing once and prostrating twice. Then the Messenger of Allah (ﷺ) said the salam and each of the Muslims stood up and bowed once, and prostrated twice individually.\"",
      "usc_msa_ref": "",
      "chain": [
        "38462",
        "20644",
        "20428",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-2079",
      "hadith_no": "2079",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا كثير بن عبيد، قال حدثنا محمد بن حرب، عن الزبيدي، عن الزهري، عن حميد بن عبد الرحمن، عن أبي هريرة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ أسرف عبد على نفسه حتى حضرته الوفاة قال لأهله إذا أنا مت فأحرقوني ثم اسحقوني ثم اذروني في الريح في البحر فوالله لئن قدر الله على ليعذبني عذابا لا يعذبه أحدا من خلقه قال ففعل أهله ذلك قال الله عز وجل لكل شىء أخذ منه شيئا أد ما أخذت فإذا هو قائم قال الله عز وجل ما حملك على ما صنعت قال خشيتك ‏.‏ فغفر الله له ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"I heard the Messenger of Allah say: 'There was a man who wronged himself greatly, and when he was dying he said to his family: When I am dead, burn my body then grind my bones and scatter me in the wind and at sea, for by Allah , if Allah gets hold of me, he will punish me in a way that He will not punish anyone else. So his family did that, but Allah, the Mighty and Sublime, said to everything that had taken any part of him to give up what it had taken. Then there he was, standing Allah, the Mighty and Sublime, said: What made you do what you did? He said: Fear of You. So Allah forgave him.\"'",
      "usc_msa_ref": "",
      "chain": [
        "38462",
        "30373",
        "20459",
        "11013",
        "10561",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-2606",
      "hadith_no": "2606",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا كثير بن عبيد، قال حدثنا محمد بن حرب، عن الزبيدي، عن الزهري، عن السائب بن يزيد، أن حويطب بن عبد العزى، أخبره أن عبد الله بن السعدي أخبره أنه، قدم على عمر بن الخطاب في خلافته فقال له عمر ألم أحدث أنك تلي من أعمال الناس أعمالا فإذا أعطيت العمالة رددتها فقلت بلى ‏.‏ فقال عمر رضى الله عنه فما تريد إلى ذلك فقلت لي أفراس وأعبد وأنا بخير وأريد أن يكون عملي صدقة على المسلمين ‏.‏ فقال له عمر فلا تفعل فإني كنت أردت مثل الذي أردت كان رسول الله صلى الله عليه وسلم يعطيني العطاء فأقول أعطه أفقر إليه مني ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ خذه فتموله أو تصدق به ما جاءك من هذا المال وأنت غير مشرف ولا سائل فخذه وما لا فلا تتبعه نفسك ‏\"‏ ‏.‏",
      "text_en": " Abdullah bin As-Sa'di narrated that he came to 'Umar bin Al-Khattab during his Caliphate and 'Umar said to him:                     \"I heard that you do some jobs for the people but when payment is given to you, you refuse it.\" I said: \"(that is so).\" 'Umar, may Allah be pleased with him, said: \"Why do you do that? I said: \"I have horses and slaves and am well off, and I wanted my work to be an act of charity toward the Muslims.\" 'Umar said to him: \"Do not do that. I used to want the same thing as you. The Messenger of Allah used to give me payment and I would say, 'Give it to someone who is more in need of it that I am.' But the Messenger of Allah said: \"Take it and keep it or give it in charity. Whatever comes to you of this wealth when you are not hoping for it and not asking for it, take it, and whatever does not, then do not wish for it. \"'",
      "usc_msa_ref": "",
      "chain": [
        "38462",
        "30373",
        "20459",
        "11013",
        "3048",
        "2600",
        "2605"
      ]
    },
    {
      "id": "sunan-an-nasai-2707",
      "hadith_no": "2707",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرني كثير بن عبيد، عن بقية، عن شعبة، قال حدثني إسماعيل بن إبراهيم، قال حدثني عبد العزيز بن صهيب، عن أنس بن مالك، قال نهى رسول الله صلى الله عليه وسلم عن التزعفر ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                     \"The Messenger of Allah forbade perfuming oneself with saffron.",
      "usc_msa_ref": "",
      "chain": [
        "38462",
        "20644",
        "20020",
        "20208",
        "11295",
        "19"
      ]
    },
    {
      "id": "sunan-an-nasai-3089",
      "hadith_no": "3089",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا كثير بن عبيد، قال حدثنا محمد بن حرب، عن الزبيدي، عن الزهري، عن سعيد بن المسيب، وأبي، سلمة بن عبد الرحمن أن أبا هريرة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ بعثت بجوامع الكلم ونصرت بالرعب وبينا أنا نائم أتيت بمفاتيح خزائن الأرض فوضعت في يدي ‏\"‏ ‏.‏ فقال أبو هريرة فقد ذهب رسول الله صلى الله عليه وسلم وأنتم تنتثلونها ‏.‏",
      "text_en": " Narrated It was narrated from Sa’eed bin Al-Musayyab and Salamah bin Abdur-Rahman that Abu Hurairah said:                      :“I heard the Messenger of Allah said: ‘I have been sent with concise speech,  and I have been supported with fear. While I was sleeping, the keys to the treasures of the Earth were brought to me and placed in my hands.’ Abu Hurairah said: The Messenger of Allah has gone and you are acquiring them.”",
      "usc_msa_ref": "",
      "chain": [
        "38462",
        "30373",
        "20459",
        "11013",
        "11002",
        "10567",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-3091",
      "hadith_no": "3091",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا كثير بن عبيد، عن محمد بن حرب، عن الزبيدي، عن الزهري، عن عبيد الله بن عبد الله، عن أبي هريرة، قال لما توفي رسول الله صلى الله عليه وسلم واستخلف أبو بكر وكفر من كفر من العرب قال عمر يا أبا بكر كيف تقاتل الناس وقد قال رسول الله صلى الله عليه وسلم ‏\"‏ أمرت أن أقاتل الناس حتى يقولوا لا إله إلا الله فمن قال لا إله إلا الله عصم مني نفسه وماله إلا بحقه وحسابه على الله ‏\"‏ ‏.‏ قال أبو بكر رضى الله عنه والله لأقاتلن من فرق بين الصلاة والزكاة فإن الزكاة حق المال والله لو منعوني عناقا كانوا يؤدونها إلى رسول الله صلى الله عليه وسلم لقاتلتهم على منعها فوالله ما هو إلا أن رأيت الله عز وجل قد شرح صدر أبي بكر للقتال وعرفت أنه الحق ‏.‏",
      "text_en": " Narrated It was narrated that Abu Hurairah said:                     :“When the Messenger of Allah died and Abu Bakr was appointed as Khalifah, and some of the Arab’s disbelieved, Umar said: ‘O Abu Bakr! How can you fight the people when the Messenger of Allah said: I have been commanded to fight the people until they say La ilaha illallah (there is none worthy of worship except Allah). Whoever says La ilaha illallah, his life and his property are safe from me, except for its right, and his reckoning will be with Allah?’ Abu Bakr, may Allah be pleased with him, said: ‘By Allah, I will surely fight those who separate prayer and Zakah, for Zakah is what is due on wealth. By Allah, if they withhold from me a small she-goat that they used to give to the Messenger of Allah I will fight them for withholding it.’ (Umar said) ‘By Allah, when I realized that Allah, the Mighty and Sublime, had opened the chest of Abu Bakr to fighting, then I knew that it was the truth.’”",
      "usc_msa_ref": "",
      "chain": [
        "38462",
        "30373",
        "20459",
        "11013",
        "11004",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-3092",
      "hadith_no": "3092",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا أحمد بن محمد بن مغيرة، قال حدثنا عثمان بن سعيد، عن شعيب، عن الزهري، قال حدثنا عبيد الله، ح وأنبأنا كثير بن عبيد، قال حدثنا بقية، عن شعيب، قال حدثني الزهري، عن عبيد الله بن عبد الله بن عتبة بن مسعود، أن أبا هريرة، قال لما توفي رسول الله صلى الله عليه وسلم وكان أبو بكر بعده وكفر من كفر من العرب قال عمر رضى الله عنه يا أبا بكر كيف تقاتل الناس وقد قال رسول الله صلى الله عليه وسلم ‏\"‏ أمرت أن أقاتل الناس حتى يقولوا لا إله إلا الله فمن قال لا إله إلا الله فقد عصم مني ماله ونفسه إلا بحقه وحسابه على الله ‏\"‏ ‏.‏ قال أبو بكر رضى الله عنه لأقاتلن من فرق بين الصلاة والزكاة فإن الزكاة حق المال والله لو منعوني عناقا كانوا يؤدونها إلى رسول الله صلى الله عليه وسلم لقاتلتهم على منعها ‏.‏ قال عمر فوالله ما هو إلا أن رأيت أن الله عز وجل شرح صدر أبي بكر للقتال فعرفت أنه الحق ‏.‏ واللفظ لأحمد ‏.‏",
      "text_en": " It was narrated from 'Ubaidullah bin 'Abdullah bin 'Utbah bin Mas'ud that Abu Hurairah said:                      \"When the Messenger of Allah (ﷺ) died and Abu Bakr (was appointed Khalifah) after him, and some of the 'Arabs disbelieved, 'Umar, may Allah be pleased with him, said: 'O Abu Bakr, how can you fight the people when the Messenger of Allah (ﷺ) said: I have been commanded to fight the people until they say La ilaha illallah (there is none worthy of worship except Allah.) Whoever says La ilaha illallah, his life and his property are safe from me, except for its right, and his reckoning will be with Allah?'\" Abu Bakr, may Allah be pleased with him, said: \"I will surely fight those who separate prayer and Zakah, for Zakah is what is due on wealth. By Allah, if they withhold from me a small she-goat that they used to give to the Messenger of Allah (ﷺ) I will fight them for withholding it.' ('Umar said) 'By Allah, when I realized that Allah, the Mighty and Sublime, had opened the chest of Abu Bakr to fighting, then I knew that it was the truth.'\" The wording is that of Ahmad.",
      "usc_msa_ref": "",
      "chain": [
        "30304",
        "28388",
        "20428",
        "11013",
        "11201",
        "38462",
        "20644",
        "20239",
        "11013",
        "11004",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-3105",
      "hadith_no": "3105",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا كثير بن عبيد، قال حدثنا بقية، عن الزبيدي، عن الزهري، عن عطاء بن يزيد، عن أبي سعيد الخدري، أن رجلا، أتى رسول الله صلى الله عليه وسلم فقال يا رسول الله أى الناس أفضل قال ‏\"‏ من جاهد بنفسه وماله في سبيل الله ‏\"‏ ‏.‏ قال ثم من يا رسول الله قال ‏\"‏ ثم مؤمن في شعب من الشعاب يتقي الله ويدع الناس من شره ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Sa'eed Al-Khudri that a man came to the Messenger of Allah (ﷺ) and said:                      \"O Messenger of Allah! Which of the people is best?\" He said: \"One who strives with himself and his wealth in the cause of Allah.\" He said: \"Then who, O Messenger of Allah?\" He said: \"Then a believer (isolating himself) in one of the mountain passes, who fears Allah and spares the people his evil.\"",
      "usc_msa_ref": "",
      "chain": [
        "38462",
        "20644",
        "20459",
        "11013",
        "11206",
        "38"
      ]
    },
    {
      "id": "sunan-an-nasai-3222",
      "hadith_no": "3222",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا كثير بن عبيد، قال حدثنا محمد بن حرب، عن الزبيدي، عن الزهري، عن عبيد الله بن عبد الله بن عتبة، أن عبد الله بن عمرو بن عثمان، طلق وهو غلام شاب في إمارة مروان ابنة سعيد بن زيد وأمها بنت قيس البتة فأرسلت إليها خالتها فاطمة بنت قيس تأمرها بالانتقال من بيت عبد الله بن عمرو وسمع بذلك مروان فأرسل إلى ابنة سعيد فأمرها أن ترجع إلى مسكنها وسألها ما حملها على الانتقال من قبل أن تعتد في مسكنها حتى تنقضي عدتها فأرسلت إليه تخبره أن خالتها أمرتها بذلك فزعمت فاطمة بنت قيس أنها كانت تحت أبي عمرو بن حفص فلما أمر رسول الله صلى الله عليه وسلم علي بن أبي طالب على اليمن خرج معه وأرسل إليها بتطليقة هي بقية طلاقها وأمر لها الحارث بن هشام وعياش بن أبي ربيعة بنفقتها فأرسلت - زعمت - إلى الحارث وعياش تسألهما الذي أمر لها به زوجها فقالا والله ما لها عندنا نفقة إلا أن تكون حاملا وما لها أن تكون في مسكننا إلا بإذننا فزعمت أنها أتت رسول الله صلى الله عليه وسلم فذكرت ذلك له فصدقهما ‏.‏ قالت فاطمة فأين أنتقل يا رسول الله قال ‏\"‏ انتقلي عند ابن أم مكتوم الأعمى الذي سماه الله عز وجل في كتابه ‏\"‏ ‏.‏ قالت فاطمة فاعتددت عنده وكان رجلا قد ذهب بصره فكنت أضع ثيابي عنده حتى أنكحها رسول الله صلى الله عليه وسلم أسامة بن زيد فأنكر ذلك عليها مروان وقال لم أسمع هذا الحديث من أحد قبلك وسآخذ بالقضية التي وجدنا الناس عليها ‏.‏ مختصر ‏.‏",
      "text_en": " Narrated 'Ubaidullah bin 'Abdullah bin 'Utbah:                     It was narrated from 'Ubaidullah bin 'Abdullah bin 'Utbah that during the reign of Marwan, 'Abdullah bin 'Amr bin 'Uthman, who was a young man, issued a final divorce to the daughter of Sa'eed bin Zaid, whose mother was Bint Qais.  Her maternal aunt, Fatimah bint Qais, sent word to her telling her to move from the house of 'Abdullah bin 'Amr. Marwan heard of that and he sent word to the daughter of Sa'eed, telling her to go back to her home, and asking her why she had moved from her home before her 'Iddah was over? She sent word to him telling him that her maternal aunt had told her to do that. Fatimah bint Qais said that she had been married to Abu 'Amr bin Hafs, and when the Messenger of Allah appointed 'Ali bin Abi Talib as governor of Yemen, he went out with him and sent word to her that she was divorced with the third Talaq.  He told Al-Harith bin Hisham and 'Ayyash bin Abi Rai'ah to spend on her.  She sent word to Al-Harith and 'Ayyash asking them what her husband had told them to spend on her, and they said: 'By Allah, she has no right to any maintenance from us, unless she is pregnant, and she cannot come into our home without our permission.' She said that she came to the Messenger of Allah and told him about that, and he stated that they were correct. Fatimah said: 'Where should I move to, O Messenger of Allah?' He said: 'Move to the home of Ibn Umm Maktum, the blind man whom Allah, the Mighty and Sublime, named in His Book.' Fatimah said: 'So I observed my 'Iddah there.  He was a man who has lost his sight, so I used to take off my garments in his house, until the Messenger of Allah married me to Usamah bin Zaid.' Marwan criticized her for that and said: 'I have never heard this Hadith from anyone before you. I will continue to follow the ruling that the people have been following.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38462",
        "30373",
        "20459",
        "11013",
        "11004"
      ]
    },
    {
      "id": "sunan-an-nasai-3391",
      "hadith_no": "3391",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرني كثير بن عبيد، عن محمد بن حرب، قال حدثنا الزبيدي، قال سئل الزهري كيف الطلاق للعدة فقال أخبرني سالم بن عبد الله بن عمر أن عبد الله بن عمر قال طلقت امرأتي في حياة رسول الله صلى الله عليه وسلم وهي حائض ‏.‏ فذكر ذلك عمر لرسول الله صلى الله عليه وسلم فتغيظ رسول الله صلى الله عليه وسلم في ذلك فقال ‏\"‏ ليراجعها ثم يمسكها حتى تحيض حيضة وتطهر فإن بدا له أن يطلقها طاهرا قبل أن يمسها فذاك الطلاق للعدة كما أنزل الله عز وجل ‏\"‏ ‏.‏ قال عبد الله بن عمر فراجعتها وحسبت لها التطليقة التي طلقتها ‏.‏",
      "text_en": " Salim bin 'Abdullah bin 'Umar narrated that 'Abdullah bin 'Umar said:                      \"I divorced my wife during the lifetime of the Messenger of Allah while she was menstruating. 'Umar mentioned that to the Messenger of Allah, and the Messenger of Allah got angry about that and said: 'Let him take her back, then keep her until she has menstruated again and become pure again. Then if he wants to divorce her when she is pure and before he touches her (has intercourse with her), then that is divorce at the prescribed time as Allah, the Mighty and Sublime, has revealed.'\" 'Abdullah bin 'Umar said: \"So I took her back, but I still counted the divorce that I had issued to her.\"",
      "usc_msa_ref": "",
      "chain": [
        "38462",
        "30373",
        "20459",
        "11011",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-3520",
      "hadith_no": "3520",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا كثير بن عبيد، قال حدثنا محمد بن حرب، عن الزبيدي، عن الزهري، عن عبيد الله بن عبد الله، أن عبد الله بن عتبة، كتب إلى عمر بن عبد الله بن الأرقم الزهري أن ادخل، على سبيعة بنت الحارث الأسلمية فاسألها عما أفتاها به رسول الله صلى الله عليه وسلم في حملها ‏.‏ قال فدخل عليها عمر بن عبد الله فسألها فأخبرته أنها كانت تحت سعد ابن خولة - وكان من أصحاب رسول الله صلى الله عليه وسلم ممن شهد بدرا - فتوفي عنها في حجة الوداع فولدت قبل أن تمضي لها أربعة أشهر وعشرا من وفاة زوجها فلما تعلت من نفاسها دخل عليها أبو السنابل - رجل من بني عبد الدار - فرآها متجملة فقال لعلك تريدين النكاح قبل أن تمر عليك أربعة أشهر وعشرا ‏.‏ قالت فلما سمعت ذلك من أبي السنابل جئت رسول الله صلى الله عليه وسلم فحدثته حديثي ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ قد حللت حين وضعت حملك ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Ubaidullah bin 'Abdullah that 'Abdullah bin 'Utbah wrote to 'Umar bin 'Abdullah bin Al-Arqam Az-Zuhri, telling him:                      \"Go to Subai'ah bint Al-Harith Al-Aslamiyyah, and ask her about the ruling of the Messenger of Allah concerning her pregnancy.\" He said: \"So 'Umar bin 'Abdullah went to her and asked her. She told him that she was married to Sa'd bin Khawlah, who was one of the Companions of the Messenger of Allah who had been present at Badr. He died during the Farewell Pilgrimage, and she gave birth before four months and ten days had passed since her husband's death. When her Nifas ended, Abu As-Sanabil -a man from Banu 'Abd Ad-Dar- went to her and saw that she had adorned herself. He said: 'Perhaps you want to get married before four months and ten days has passed?' She said: 'When I heard that from Abu As-Sanabil, I went to the Messenger of Allah and told him my story. The Messenger of Allah said: 'It is permissible for you to marry when you gave birth.''\"",
      "usc_msa_ref": "",
      "chain": [
        "38462",
        "30373",
        "20459",
        "11013",
        "11004"
      ]
    },
    {
      "id": "sunan-an-nasai-3775",
      "hadith_no": "3775",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا كثير بن عبيد، قال حدثنا محمد بن حرب، عن الزبيدي، عن الزهري، عن حميد بن عبد الرحمن، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من حلف منكم فقال باللات فليقل لا إله إلا الله ومن قال لصاحبه تعال أقامرك فليتصدق ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                      \"The Messenger of Allah said: 'Whoever among you swears and says: By Al-Lat, let him say: La ilaha illallah (There is none worthy of worship except Allah). And whoever says to his companion: Come, let us gamble, then let him give in charity.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38462",
        "30373",
        "20459",
        "11013",
        "10561",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-3833",
      "hadith_no": "3833",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا كثير بن عبيد، قال حدثنا محمد بن حرب، عن الزبيدي، عن الزهري، أنه بلغه عن القاسم، عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ لا نذر في معصية ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                      \"The Messenger of Allah said: 'There is no vow to commit an act of disobedience.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38462",
        "30373",
        "20459",
        "11013",
        "10535",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-4276",
      "hadith_no": "4276",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا كثير بن عبيد، قال حدثنا محمد بن حرب، عن الزبيدي، عن الزهري، قال أخبرني ابن السباق، قال أخبرتني ميمونة، أن رسول الله صلى الله عليه وسلم قال له جبريل عليه السلام لكنا لا ندخل بيتا فيه كلب ولا صورة ‏.‏ فأصبح رسول الله صلى الله عليه وسلم يومئذ فأمر بقتل الكلاب حتى إنه ليأمر بقتل الكلب الصغير ‏.‏",
      "text_en": " It was narrated that Az-Zuhri said:                     \"Ibn As-Sabbaq said: \"Maimunah told me that Jibril, peace be upon him, said to the Messenger of Allah 'We (Angles) do not enter a house in which there is a dog or a picture, The next day the Messenger of Allah commanded that all dogs be killed, even small dogs.\"'",
      "usc_msa_ref": "",
      "chain": [
        "38462",
        "30373",
        "20459",
        "11013",
        "11203",
        "61"
      ]
    },
    {
      "id": "sunan-an-nasai-4316",
      "hadith_no": "4316",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا كثير بن عبيد، عن محمد بن حرب، عن الزبيدي، قال أخبرني الزهري، عن أبي أمامة بن سهل، عن عبد الله بن عباس، عن خالد بن الوليد، أن رسول الله صلى الله عليه وسلم أتي بضب مشوي فقرب إليه فأهوى إليه بيده ليأكل منه قال له من حضر يا رسول الله إنه لحم ضب ‏.‏ فرفع يده عنه فقال له خالد بن الوليد يا رسول الله أحرام الضب قال ‏\"‏ لا ولكن لم يكن بأرض قومي فأجدني أعافه ‏\"‏ ‏.‏ فأهوى خالد إلى الضب فأكل منه ورسول الله صلى الله عليه وسلم ينظر ‏.‏",
      "text_en": " It was narrated form Khaild bin Al-Walid that:                     a grilled mastigure was brought ot the Messenger of Allah and was placed near to him. He reached out his hand to eat it,m and someone who was present said: \"O Messenger of Allah, it is the meat of a mastigure: \" He withdrew his hand and Khaild bin Al-Walid said to him: \"O Messenger of Allah, is mastigure Haram?\" He said: \"No, but it is not found in the land of my p0eople, and I find it distasteful.\" He said: \"Then Khalid bent over the mastigure and ate some of it, and the Messenger of Allah was looking at him.\"",
      "usc_msa_ref": "",
      "chain": [
        "38462",
        "30373",
        "20459",
        "11013",
        "405",
        "17",
        "22"
      ]
    },
    {
      "id": "sunan-an-nasai-4332",
      "hadith_no": "4332",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا كثير بن عبيد، قال حدثنا بقية، عن ثور بن يزيد، عن صالح بن يحيى بن المقدام بن معديكرب، عن أبيه، عن جده، عن خالد بن الوليد، أن رسول الله صلى الله عليه وسلم نهى عن أكل لحوم الخيل والبغال والحمير وكل ذي ناب من السباع ‏.‏",
      "text_en": " It was narrated from Khalid bin Al-Walid that:                     the Messenger of Allah forbade eating the flesh of horses, mules and donkeys, and any predator that has fangs.",
      "usc_msa_ref": "",
      "chain": [
        "38462",
        "20644",
        "20415",
        "22"
      ]
    },
    {
      "id": "sunan-ibn-majah-1147",
      "hadith_no": "1147",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا كثير بن عبيد الحمصي، حدثنا عبد المجيد بن عبد العزيز، عن معمر، عن الأعمش، عن إبراهيم، عن علقمة، قال خرجت مع عبد الله إلى الجمعة فوجد ثلاثة قد سبقوه فقال رابع أربعة وما رابع أربعة ببعيد إني سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ إن الناس يجلسون من الله يوم القيامة على قدر رواحهم إلى الجمعات الأول والثاني والثالث ‏\"‏ ‏.‏ ثم قال رابع أربعة وما رابع أربعة ببعيد ‏.‏",
      "text_en": " It wasnarrated that ‘Alqamah said:                      “I went out with ‘Abdullah toFriday (prayer), and he found three men who arrived before him. Hesaid: ‘The fourth of four, and the fourth of four is not far away.Iheard the Messenger of Allah (ﷺ) say: “On the Day ofResurrectionpeople will gather near Allah according to how earlythey came toFriday (prayer), the first, second, and third.’”Then he said: ‘Thefourth of four, and the fourth of four is notfar away.’”",
      "usc_msa_ref": "",
      "chain": [
        "38462",
        "20660",
        "20115",
        "11060",
        "11051",
        "11017"
      ]
    },
    {
      "id": "sunan-ibn-majah-1495",
      "hadith_no": "1495",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا كثير بن عبيد الحمصي، حدثنا بقية، عن أبي عبد الرحمن التميمي، عن عثمان بن عطاء، عن أبيه، عن المغيرة، عن النبي  صلى الله عليه وسلم  نحوه ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "38462",
        "20644",
        "11359",
        "3690",
        "166"
      ]
    },
    {
      "id": "sunan-ibn-majah-1547",
      "hadith_no": "1547",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا كثير بن عبيد الحمصي، حدثنا بقية بن الوليد، عن أبي بكر بن أبي مريم، عن راشد بن سعد، عن ثوبان، مولى رسول الله  صلى الله عليه وسلم  قال رأى رسول الله  صلى الله عليه وسلم  ناسا ركبانا على دوابهم في جنازة فقال ‏\"‏ ألا تستحيون أن ملائكة الله يمشون على أقدامهم وأنتم ركبان ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Thawban, the freed slave of the Messenger ofAllah(ﷺ), said:                      “The Messenger of Allah (ﷺ) saw some peopleridingon their animals in a funeral (procession). He said: ‘Do younotfeel ashamed that the angels of Allah are walking on foot and youareriding?’”",
      "usc_msa_ref": "",
      "chain": [
        "38462",
        "20644",
        "27053",
        "19909"
      ]
    },
    {
      "id": "sunan-ibn-majah-2096",
      "hadith_no": "2096",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Divorce - كتاب الطلاق",
      "chapter_no": "10",
      "text_ar": "حدثنا كثير بن عبيد الحمصي، حدثنا محمد بن خالد، عن عبيد الله بن الوليد الوصافي، عن محارب بن دثار، عن عبد الله بن عمر، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ أبغض الحلال إلى الله الطلاق ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin 'Umar that:                     the Messenger of Allah said: \"The most hated of permissible things to Allah is divorce. \"",
      "usc_msa_ref": "",
      "chain": [
        "38462",
        "38496",
        "15348",
        "11389",
        "18"
      ]
    }
  ],
  "total_hadiths": 36
}