{
  "id": "38475",
  "name": "Muhammad bin Isma'il bin Samra محمد بن إسماعيل بن سمره الأحمسي",
  "full_name": "Muhammad bin Isma'il bin Samra محمد بن إسماعيل بن سمره الأحمسي",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "260",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ت  س  ق  -  ثقة ]"
    ],
    "tags": [
      "al-Ahamsi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20354",
      "name": "Muhammad bin Khazim al-Darir محمد بن خازم أبو معاوية الضرير",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20333",
      "name": "'Abdur Rahman bin Muhammad al-Maharbi عبد الرحمن بن محمد بن زياد المحاربي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20416",
      "name": "Ja'far bin Awn bin Ja'far جعفر بن عون بن جعفر",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "28390",
      "name": "'Uthman bin 'Abdur Rahman عثمان بن عبد الرحمن",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20032",
      "name": "Waki' bin al-Jarrah وكيع بن الجراح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20318",
      "name": "Hammad bin Usamah حماد بن أسامة - أبو أسامة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20650",
      "name": "Zayd bin al-Habab al-'Akli زيد بن الحباب أبو الحسين العكلي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20396",
      "name": "Muhammad bin al-Hasan bin 'Imran محمد بن الحسن بن عمران",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30005",
      "name": "Imam Tirmidhi الترمذي محمد بن عيسى بن سورة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30006",
      "name": "Imam Nasa'i أحمد بن شعيب بن علي بن سنان النسائي",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30004",
      "name": "Ibn Maja ابن ماجة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "36617",
      "name": "al-Qasim bin Zakaria bin Yahya القاسم بن زكريا بن يحيى البغدادي",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "34251",
      "name": "Muhammad bin Yahya bin 'Abdul Karim محمد بن يحيى بن عبد الكريم",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "2741",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of Paradise - كتاب صفة الجنة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "38",
      "text_ar": "حدثنا محمد بن إسماعيل بن سمرة الأحمسي، حدثنا أبو معاوية، عن واصل، هو ابن السائب عن أبي سورة، عن أبي أيوب، قال أتى النبي صلى الله عليه وسلم أعرابي فقال يا رسول الله إني أحب الخيل أفي الجنة خيل قال رسول الله صلى الله عليه وسلم ‏\"‏ إن أدخلت الجنة أتيت بفرس من ياقوتة له جناحان فحملت عليه ثم طار بك حيث شئت ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث ليس إسناده بالقوي ولا نعرفه من حديث أبي أيوب إلا من هذا الوجه ‏.‏ وأبو سورة هو ابن أخي أبي أيوب يضعف في الحديث ضعفه يحيى بن معين جدا قال وسمعت محمد بن إسماعيل يقول أبو سورة هذا منكر الحديث يروي مناكير عن أبي أيوب لا يتابع عليها ‏.‏",
      "text_en": " Abu Ayyub narrated that a Bedouin came to the Prophet (s.a.w) and said:                     \"O Messenger of Allah, indeed, I love horses. Are there horses in Paradise?\" The Messenger of Allah (s.a.w) said:  \"If you are admitted  into Paradise, you shall be brought a horse of rubies with two wings, then you shall be carried on it, then it will fly with you wherever you want.\"",
      "chain": [
        "38475",
        "20354",
        "33"
      ]
    },
    {
      "hadith_no": "1349",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا محمد بن إسماعيل بن سمرة، عن أسباط، قال حدثنا عمرو بن قيس، عن الحكم، عن عبد الرحمن بن أبي ليلى، عن كعب بن عجرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ معقبات لا يخيب قائلهن يسبح الله في دبر كل صلاة ثلاثا وثلاثين ويحمده ثلاثا وثلاثين ويكبره أربعا وثلاثين ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ka'b bin 'Ujrah said:                     \"The Messenger of Allah (ﷺ) said: 'There are statements of remembrance following the prayer of which the one who says them will never be deprive of the reward: Glorifying Allah (SWT) thirty-three times following each prayer, and praising Him thirty-three times, and magnifying Him thirty-four times.'\"",
      "chain": [
        "38475",
        "213",
        "11069",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "2224",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن إسماعيل بن سمرة، قال حدثنا المحاربي، عن فطر، أخبرني حبيب بن أبي ثابت، عن الحكم بن عتيبة، عن ميمون بن أبي شبيب، عن معاذ بن جبل، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الصوم جنة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Muadh bin Jabal said:                     \"The Messenger of Allah said: 'Fasting is a shield.\"'",
      "chain": [
        "38475",
        "20333",
        "11331",
        "11069",
        "10834",
        "32"
      ]
    },
    {
      "hadith_no": "1542",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن إسماعيل بن سمرة، حدثنا محمد بن الحسن، حدثنا أبو شيبة، عن أنس بن مالك، قال لما قبض إبراهيم ابن النبي  صلى الله عليه وسلم  قال لهم النبي  صلى الله عليه وسلم  ‏\"‏ لا تدرجوه في أكفانه حتى أنظر إليه ‏\"‏ ‏.‏ فأتاه فانكب عليه وبكى ‏.‏",
      "text_en": " It wasnarrated that Anas bin Malik said:                      “When Ibrahim the son oftheProphet (ﷺ) died, the Prophet (ﷺ) said to them: ‘Do not wraphim in his shroud until I look at him.’ He came to him, bent overandwept.”",
      "chain": [
        "38475",
        "20004",
        "19"
      ]
    },
    {
      "hadith_no": "1634",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن إسماعيل بن سمرة، حدثنا المحاربي، عن الليث بن سعد، عن يزيد بن أبي حبيب، عن أبي الخير، مرثد بن عبد الله اليزني عن عقبة بن عامر، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لأن أمشي على جمرة أو سيف أو أخصف نعلي برجلي أحب إلى من أن أمشي على قبر مسلم وما أبالي أوسط القبور قضيت حاجتي أو وسط السوق ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Uqbah bin ‘Amir that the Messenger of Allah(ﷺ)said:                      ‘If I were to walk on a live coal or a sword, or if I weretosew shows to my feet, that would be better for me than walking onthegrave of a Muslim. And I see no difference between relievingmyselfin the midst of graves or in the middle of the marketplace.”",
      "chain": [
        "38475",
        "20333",
        "20023",
        "11411",
        "11410",
        "189"
      ]
    },
    {
      "hadith_no": "1929",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن إسماعيل بن سمرة، حدثنا وكيع، عن عبد الله بن عمرو بن مرة، عن أبيه، عن سالم بن أبي الجعد، عن ثوبان، قال لما نزل في الفضة والذهب ما نزل قالوا فأى المال نتخذ قال عمر فأنا أعلم لكم ذلك ‏.‏ فأوضع على بعيره فأدرك النبي  صلى الله عليه وسلم  وأنا في أثره فقال يا رسول الله أى المال نتخذ فقال ‏\"‏ ليتخذ أحدكم قلبا شاكرا ولسانا ذاكرا وزوجة مؤمنة تعين أحدكم على أمر الآخرة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that:                     Thawban said: “When the Verse concerning silver and gold was revealed, they said: 'What kind of wealth should we acquire?' Umar said: 'I will tell you about that.' So he rode on his camel and caught up with the Prophet, and I followed him. He said: 'O Messenger of Allah what kind of wealth should we acquire?' He said: 'Let one of acquire a thankful heart, a tongue that remembers Allah and a believing wife who will help him with regard to the Hereafter.' ”",
      "chain": [
        "38475",
        "20032",
        "20645",
        "11342",
        "130"
      ]
    },
    {
      "hadith_no": "2179",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Expiation - كتاب الكفارات",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن إسماعيل بن سمرة، حدثنا أسباط بن محمد، عن محمد بن عجلان، عن نافع، عن ابن عمر، قال سمع النبي  صلى الله عليه وسلم  رجلا يحلف بأبيه فقال ‏\"‏ لا تحلفوا بآبائكم من حلف بالله فليصدق ومن حلف له بالله فليرض ومن لم يرض بالله فليس من الله ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                     \"The Messenger of Allah (ﷺ) heard a man taking an oath by his father and said: 'Do not make oaths by your forefathers. Whoever makes an oath by Allah, let him fulfill his oath, and if an oath is sworn for a person by Allah, let him accept it. Whoever is not content with Allah has nothing to do with Allah.'",
      "chain": [
        "38475",
        "20408",
        "10616",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2873",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن إسماعيل بن سمرة، حدثنا محمد بن يعلى السلمي، حدثنا عمر بن صبح، عن عبد الرحمن بن عمرو، عن مكحول، عن أبى بن كعب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لرباط يوم في سبيل الله من وراء عورة المسلمين محتسبا من غير شهر رمضان أعظم أجرا من عبادة مائة سنة صيامها وقيامها ورباط يوم في سبيل الله من وراء عورة المسلمين محتسبا من شهر رمضان أفضل عند الله وأعظم أجرا - أراه قال - من عبادة ألف سنة صيامها وقيامها فإن رده الله إلى أهله سالما لم تكتب عليه سيئة ألف سنة وتكتب له الحسنات ويجرى له أجر الرباط إلى يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Ubayy bin Ka’b said:                      “The Messenger of Allah(ﷺ)said: ‘For guarding the frontier for a day in the cause ofAllah,defending the Muslims, seeking reward, apart from in the monthofRamadan, there is a reward granted greater than worshipping for ahundred years, fasting and praying. Guarding the frontier for a dayinthe cause of Allah, defending the Muslims, seeking reward, in themonth of Ramadan, is better before Allah and brings a greater reward”– I think he said – “than worshipping for a thousand years,fastingand praying. If Allah returns him to his family safe andsound, no baddeed will be recorded for him for a thousand years, buthis good deedswill be recorded, and the reward for guarding thefrontier will cometo him until the Day of Resurrection.”",
      "chain": [
        "38475",
        "11066",
        "39"
      ]
    },
    {
      "hadith_no": "2916",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن إسماعيل بن سمرة، أنبأنا وكيع، عن سفيان، عن أبي إسحاق، عن أبي الخليل، عن علي بن أبي طالب، قال كان المغيرة بن شعبة إذا غزا مع النبي صلى الله عليه وسلم حمل معه رمحا فإذا رجع طرح رمحه حتى يحمل له ‏.‏ فقال له علي لأذكرن ذلك لرسول الله صلى الله عليه وسلم ‏.‏ فقال ‏\"‏ لا تفعل فإنك إن فعلت لم ترفع ضالة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Ali bin Abi Talib said:                      “When Mughirah binShu’bahfought alongside the Prophet (ﷺ) he would carry a spear, andwhenhe would come back he would throw his spear down so that someonewould pick it up and give it back to him.” ‘Ali said to him: “Iwilltell the Messenger of Allah (ﷺ) about that.” He (the Prophet(ﷺ))said: “Do not do that, for it you do that it will not bepicked up asa lost item to be returned.”",
      "chain": [
        "38475",
        "20032",
        "20012",
        "11049",
        "11291",
        "5"
      ]
    },
    {
      "hadith_no": "2917",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن إسماعيل بن سمرة، أنبأنا عبيد الله بن موسى، عن أشعث بن سعيد، عن عبد الله بن بسر، عن أبي راشد، عن علي، قال كانت بيد رسول الله صلى الله عليه وسلم قوس عربية فرأى رجلا بيده قوس فارسية فقال ‏\"‏ ما هذه ألقها وعليكم بهذه وأشباهها ورماح القنا فإنهما يزيد الله بهما في الدين ويمكن لكم في البلاد ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Ali said:                      “The Messenger of Allah (ﷺ) had anArabian bow in his hand, and he saw a man who had a Persian bow inhishand. He said: ‘What is this? Throw it away. You should usethis andothers like it, and Qana* spears. Perhaps Allah will supportHisreligion thereby and enable you to conquer lands.’”",
      "chain": [
        "38475",
        "20340",
        "3650",
        "5"
      ]
    },
    {
      "hadith_no": "2951",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن إسماعيل بن سمرة، حدثنا وكيع، عن صالح بن أبي الأخضر، عن الزهري، عن عروة بن الزبير، عن أسامة بن زيد، قال بعثني رسول الله صلى الله عليه وسلم إلى قرية يقال لها أبنى فقال ‏\"‏ ائت أبنى صباحا ثم حرق ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Usamah bin Said said:                      “The Messenger of Allah(ﷺ)sent me to a village called Ubna, and said: “Go to Ubna in themorning and burn it.’”",
      "chain": [
        "38475",
        "20032",
        "20714",
        "11013",
        "10511",
        "50"
      ]
    }
  ],
  "total_hadiths": 11
}