{
  "id": "38485",
  "name": "Muhammad bin Jabla محمد بن جبلة / بن خالد بن جبلة",
  "full_name": "Muhammad bin (Khalid bin) Jabla محمد بن جبلة / بن خالد بن جبلة",
  "grade": "3rd Century AH [11th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "255",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Khurasan",
      " Rafiq"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ س  -  صدوق ]"
    ],
    "tags": [
      "al-Rafiqi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "28280",
      "name": "'Abdullah bin Ja'far عبد الله بن جعفر الرقي المعيطي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "28464",
      "name": "al-'Ala' bin Hilal bin 'Umar bin Hilal العلاء بن هلال بن عمر بن هلال",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "38640",
      "name": "al-Ma'afa bin Sulaiman al-Jzry المعافى بن سليمان الجزري أبو محمد",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38642",
      "name": "Ma'mr bin Mkhld معمر بن مخلد",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30384",
      "name": "Muhammad bin Musa bin A'yn محمد بن موسى بن أعين الجزري",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38141",
      "name": "Hajjaj bin Abi Mani' حجاج بن يوسف بن أبي منيع",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30303",
      "name": "Ahmed bin 'Abdul Malik bin Waqid أحمد بن عبد الملك بن واقد",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30301",
      "name": "Ahmed bin 'Abdullah أحمد بن عبد الله بن أبي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30232",
      "name": "Sa'id bin Abi Maryam سعيد بن أبي مريم",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20340",
      "name": "'Ubaidullah bin Musa bin Abi al-Mukhtar عبيد الله بن موسى بن أبي المختار باذام",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30006",
      "name": "Imam Nasa'i أحمد بن شعيب بن علي بن سنان النسائي",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "36607",
      "name": "'Umar bin Ibrahim bin Sulaiman عمر بن إبراهيم بن سليمان البغدادي",
      "grade": "3rd Century AH [12th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sunan-an-nasai-1167",
      "hadith_no": "1167",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرني محمد بن جبلة الرافقي، قال حدثنا العلاء بن هلال، قال حدثنا عبيد الله، - وهو ابن عمرو - عن زيد بن أبي أنيسة، عن حماد، عن إبراهيم، عن علقمة بن قيس، عن عبد الله، قال كنا لا ندري ما نقول إذا صلينا فعلمنا نبي الله صلى الله عليه وسلم جوامع الكلم فقال لنا ‏\"‏ قولوا التحيات لله والصلوات والطيبات السلام عليك أيها النبي ورحمة الله وبركاته السلام علينا وعلى عباد الله الصالحين أشهد أن لا إله إلا الله وأشهد أن محمدا عبده ورسوله ‏\"‏ ‏.‏ قال عبيد الله قال زيد عن حماد عن إبراهيم عن علقمة قال لقد رأيت ابن مسعود يعلمنا هؤلاء الكلمات كما يعلمنا القرآن ‏.‏",
      "text_en": " It was narrated from 'Alqamah bin Qais that 'Abdullah said:                     \"We used not to know what to say when we prayed, then the Messenger of Allah (ﷺ) taught us some eloquent and concise words. He said to us: 'Say: \"At-tahiyyatu lillahi was-salawatu wat-tayyibat, as-salamu 'alaika ayyuhan-Nabiyyu wa rahmatAllahi wa baraktuhu. As-salamu 'alaina wa 'ala 'ibad illahis-salihin, ashahdu an la illaha ill-Allah wa ashhadu anna Muhammadan 'abduhu wa rasuluhu (Allah compliments, prayers and pure words are due to Allah. Peace be upon you, O Prophet, and the mercy of Allah (SWT) and his blessings. Peace be upon us and upon the righteous slaves of Allah (SWT). I bear witness that none has the right to be worshipped except Allah and I bear witness that Muhammad is His slave and Messenger).\" (One of the narrators) 'Ubaidullah said: \"Zaid bin Hammad said, narrating from Ibrahim, that 'Alqamah said: 'I saw Ibn Mas'ud teaching us these words just as he taught us the Quran.\"",
      "usc_msa_ref": "",
      "chain": [
        "38485",
        "28464",
        "30024",
        "11340",
        "20022",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "id": "sunan-an-nasai-1706",
      "hadith_no": "1706",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا محمد بن جبلة، قال حدثنا معمر بن مخلد، - ثقة - قال حدثنا عبيد الله بن عمرو، عن زيد، عن حبيب بن أبي ثابت، عن محمد بن علي، عن ابن عباس، قال استيقظ رسول الله صلى الله عليه وسلم فاستن وساق الحديث ‏.‏",
      "text_en": " 'Ubaidullah bin'Amr bin Zaid narrated from Habib bin Abi Thabit, from Muhammad bin Ali that Ibn 'Abbas said:                     \"The Messenger of Allah (ﷺ) woke up and cleaned his teeth,' and he quoted the hadith.",
      "usc_msa_ref": "",
      "chain": [
        "38485",
        "38642",
        "30024",
        "15",
        "11331",
        "11442",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-2192",
      "hadith_no": "2192",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن جبلة، قال حدثنا المعافى، قال حدثنا موسى، عن إسحاق بن راشد، عن الزهري، قال أخبرني عروة بن الزبير، أن عائشة، زوج النبي صلى الله عليه وسلم أخبرته أن رسول الله صلى الله عليه وسلم كان يرغب الناس في قيام رمضان من غير أن يأمرهم بعزيمة أمر فيه فيقول ‏\"‏ من قام رمضان إيمانا واحتسابا غفر له ما تقدم من ذنبه ‏\"‏ ‏.‏",
      "text_en": " 'Urwah bin Az-Zubair narrated that Aishah told him that:                     the Messenger of Allah used to encourage the people to pray Qiyam in Ramadan, without insisting on that. He said: \"Whoever spends the nights of Ramadan in prayer out of faith and in the hope of reward, he will be forgiven his previous sins.\" '",
      "usc_msa_ref": "",
      "chain": [
        "38485",
        "20040",
        "20409",
        "11013",
        "10511"
      ]
    },
    {
      "id": "sunan-an-nasai-3423",
      "hadith_no": "3423",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرني محمد بن جبلة، ومحمد بن يحيى بن محمد، قالا حدثنا محمد بن موسى بن أعين، قال حدثنا أبي، عن إسحاق بن راشد، عن الزهري، أخبرني عبد الرحمن بن عبد الله بن كعب بن مالك، عن أبيه، قال سمعت أبي كعب بن مالك، - قال وهو أحد الثلاثة الذين تيب عليهم - يحدث قال أرسل إلى رسول الله صلى الله عليه وسلم وإلى صاحبى أن رسول الله صلى الله عليه وسلم يأمركم أن تعتزلوا نساءكم ‏.‏ فقلت للرسول أطلق امرأتي أم ماذا أفعل قال لا بل تعتزلها فلا تقربها ‏.‏ فقلت لامرأتي الحقي بأهلك فكوني فيهم فلحقت بهم ‏.‏",
      "text_en": " 'Abdur-Rahman bin 'Abdullah bin Ka'b bin Malik narrated that his father said:                      \"I heard my father Ka'b bin Malik -who was one of the three whose repentance was accepted- say: 'The Messenger of Allah sent word to me and to my two companions saying: The Messenger of Allah commands you to keep away from your wives. I said to his envoy: Shall I divorce my wife, or what should I do? He said: No, just keep away from her, and do not approach her. I said to my wife: Go to your family and stay with them. So she went to them.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38485",
        "11222",
        "30384",
        "20409",
        "11013",
        "11519",
        "1131"
      ]
    },
    {
      "id": "sunan-an-nasai-4901",
      "hadith_no": "4901",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرنا محمد بن جبلة، قال حدثنا محمد بن موسى بن أعين، قال حدثنا أبي، عن إسحاق بن راشد، عن الزهري، عن عروة، عن عائشة، أن قريشا، أهمهم شأن المخزومية التي سرقت فقالوا من يكلم فيها قالوا من يجترئ عليه إلا أسامة بن زيد حب رسول الله صلى الله عليه وسلم ‏.‏ فكلمه أسامة فقال رسول الله صلى الله عليه وسلم ‏\"‏ إنما هلك الذين من قبلكم أنهم كانوا إذا سرق فيهم الشريف تركوه وإذا سرق فيهم الضعيف أقاموا عليه الحد وايم الله لو سرقت فاطمة بنت محمد لقطعت يدها ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Aishah the Quraish were worried about the case of the Makhzumi woman who stole, and they said:                     \"Who will speak concerning her?\" They said: \"Who would dare to do that except Usamah bin Zaid, the beloved of the Messenger of Allah?\" said: \"Those who came before you were destroyed because whenever a noble person among them stole they would let him go. But if a person who was weak stole, they would carry out the Hadd punishment. By Allah, if Fatimah, the daughter of Muhammad, were to steal, I would ct off her hand.\"",
      "usc_msa_ref": "",
      "chain": [
        "38485",
        "30384",
        "20409",
        "11013",
        "10511",
        "53"
      ]
    }
  ],
  "total_hadiths": 5
}