{
  "id": "38495",
  "name": "Muhammad bin Hmyd bin Hyan محمد بن حميد بن حيان",
  "full_name": "Muhammad bin Hmyd bin Hyan محمد بن حميد بن حيان",
  "grade": "3rd Century AH [10th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "248",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Weak] [ د  ت  ق  -  ضعيف ]"
    ],
    "tags": []
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20745",
      "name": "Y'aqub bin 'Abdullah يعقوب بن عبد الله بن سعد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20111",
      "name": "Ibrahim bin al-Mukhtar al-Tamimi إبراهيم بن المختار التميمي حبويه",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20028",
      "name": "Jarir bin 'Abdul Hameed al-Razi جرير بن عبد الحميد أبو عبد الله الضبي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "28586",
      "name": "Mhran bin Abi 'Umar al-Tar مهران بن أبي عمر العطار",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "28610",
      "name": "Harun bin al-Mughira bin Hkym هارون بن المغيرة بن حكيم البجلي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20183",
      "name": "Yahya bin Wadh يحيى بن واضح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "28221",
      "name": "Salmah bin al-Fadl al-Abrash سلمة بن الفضل الأبرش",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "25147",
      "name": "'Abdullah bin 'Abdul Quddus عبد الله بن عبد القدوس",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20725",
      "name": "'Abdur Rahman bin Mghra'a عبد الرحمن بن مغراء",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20452",
      "name": "al-Fadl bin Musa al-Synany الفضل بن موسى السيناني",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "25330",
      "name": "N'ym bin Mysrh نعيم بن ميسرة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20649",
      "name": "Hkam bin Slm حكام بن سلم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "25070",
      "name": "al-Hakam bin Bashyr الحكم بن بشير بن سلمان",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "26511",
      "name": "Zafr bin Suliaman al-Aayady Aw زافر بن سليمان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20650",
      "name": "Zayd bin al-Habab al-'Akli زيد بن الحباب أبو الحسين العكلي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20547",
      "name": "Sulaiman bin Da'ud bin al-Jarud سليمان بن داود أبو داود الطيالسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "28407",
      "name": "'Ali bin Abi Bakr علي بن أبي بكر بن سليمان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20678",
      "name": "Yahya bin al-Darays يحيى بن الضريس",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "30005",
      "name": "Imam Tirmidhi الترمذي محمد بن عيسى بن سورة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30004",
      "name": "Ibn Maja ابن ماجة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    },
    {
      "id": "30020",
      "name": "Yahya bin Ma'in يحيى بن معين",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38301",
      "name": "'Abdullah bin Abd عبد الله بن عبد الصمد بن أبي خداش",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30511",
      "name": "Muhammad bin Ishaq al-Saghani محمد بن إسحاق الصغاني",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30023",
      "name": "Muhammad bin Yahya bin Faris al-Dhahli محمد بن يحيى بن فارس الذهلي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30013",
      "name": "Ibn Abi Dunya ابن أبي الدنيا",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "36659",
      "name": "Muhammad bin Harun bin Ibrahim محمد بن هارون البزاز أبو نشيط",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "4397",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "وحدثناه إسحاق بن إبراهيم، أخبرنا جرير، ح وحدثني زهير بن حرب، حدثنا محمد بن حميد، - وهو المعمري - عن سفيان، ح وحدثني محمد بن رافع، حدثنا عبد، الرزاق أخبرنا سفيان، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا عفان، حدثنا أبو عوانة، كلهم عن الأعمش، بإسناد عبد الواحد ‏.‏ نحو حديثه ‏.‏ غير أن في حديث جرير فسقط من يدي السوط من هيبته ‏.‏",
      "text_en": " This hadith has been narrated on the authorityo A'mash but with this variation of words:                     \" There fell from my hand the whip on account of his (the Prophet's) awe.\"",
      "chain": [
        "30123",
        "20028",
        "30022",
        "38495",
        "20005",
        "30375",
        "20121",
        "20005",
        "30201",
        "30106"
      ]
    },
    {
      "hadith_no": "58",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن حميد الرازي، حدثنا سلمة بن الفضل، عن محمد بن إسحاق، عن حميد، عن أنس، أن النبي صلى الله عليه وسلم كان يتوضأ لكل صلاة طاهرا أو غير طاهر ‏.‏ قال قلت لأنس فكيف كنتم تصنعون أنتم قال كنا نتوضأ وضوءا واحدا ‏.‏ قال أبو عيسى وحديث حميد عن أنس حديث حسن غريب من هذا الوجه والمشهور عند أهل الحديث حديث عمرو بن عامر الأنصاري عن أنس ‏.‏ وقد كان بعض أهل العلم يرى الوضوء لكل صلاة استحبابا لا على الوجوب ‏.‏",
      "text_en": " Anas narrated that :                     \"The Prophet would perform wudu for every Salat, whether he was in state of purity or not in a state of purity.\"",
      "chain": [
        "38495",
        "28221",
        "11107",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "206",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن حميد الرازي، حدثنا أبو تميلة، حدثنا أبو حمزة، عن جابر، عن مجاهد، عن ابن عباس، أن النبي صلى الله عليه وسلم قال ‏\"‏ من أذن سبع سنين محتسبا كتبت له براءة من النار ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن عبد الله بن مسعود وثوبان ومعاوية وأنس وأبي هريرة وأبي سعيد ‏.‏ قال أبو عيسى حديث ابن عباس حديث غريب ‏.‏ وأبو تميلة اسمه يحيى بن واضح ‏.‏ وأبو حمزة السكري اسمه محمد بن ميمون ‏.‏ وجابر بن يزيد الجعفي ضعفوه تركه يحيى بن سعيد وعبد الرحمن بن مهدي ‏.‏ قال أبو عيسى سمعت الجارود يقول سمعت وكيعا يقول لولا جابر الجعفي لكان أهل الكوفة بغير حديث ولولا حماد لكان أهل الكوفة بغير فقه ‏.‏",
      "text_en": " Ibn Abbas narrated:                     \"The Prophet said: 'Whoever calls the Adhan for seven years, seeking reward for it, salvation from the Fire is written for him.'\"",
      "chain": [
        "38495",
        "20183",
        "20458",
        "34",
        "11028",
        "17"
      ]
    },
    {
      "hadith_no": "514",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on the Day of Friday - كِتَاب الْجُمُعَةِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
      "chapter_no": "4",
      "text_ar": "حدثنا محمد بن حميد الرازي، وعباس بن محمد الدوري، قالا حدثنا أبو عبد الرحمن المقرئ، عن سعيد بن أبي أيوب، حدثني أبو مرحوم، عن سهل بن معاذ، عن أبيه، أن النبي صلى الله عليه وسلم نهى عن الحبوة يوم الجمعة والإمام يخطب ‏.‏ قال أبو عيسى وهذا حديث حسن ‏.‏ وأبو مرحوم اسمه عبد الرحيم بن ميمون ‏.‏ وقد كره قوم من أهل العلم الحبوة يوم الجمعة والإمام يخطب ورخص في ذلك بعضهم منهم عبد الله بن عمر وغيره وبه يقول أحمد وإسحاق لا يريان بالحبوة والإمام يخطب بأسا ‏.‏",
      "text_en": " Sahl bin Ma'adh narrated from his father:                     \"The Prophet prohibited Al-Habwah on Friday while the Imam is delivering the Khutbah.\"",
      "chain": [
        "38495",
        "30585",
        "20375"
      ]
    },
    {
      "hadith_no": "606",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Traveling - أَبْوَابُ السَّفَرِ",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن حميد الرازي، حدثنا الحكم بن بشير بن سلمان، حدثنا خلاد الصفار، عن الحكم بن عبد الله النصري، عن أبي إسحاق، عن أبي جحيفة، عن علي بن أبي طالب، رضى الله عنه أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ستر ما بين أعين الجن وعورات بني آدم إذا دخل أحدهم الخلاء أن يقول بسم الله ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من هذا الوجه وإسناده ليس بذاك القوي ‏.‏ وقد روي عن أنس عن النبي صلى الله عليه وسلم أشياء في هذا ‏.‏",
      "text_en": " Ali bin Abi Talid (may Allah be pleased with him) narrated that :                     the Messenger of Allah said: \"The screen between the eyes of the jinns and nakedness of the children of Adam when one of you enters the area of relieving oneself is saying: 'Bismillah.'\"",
      "chain": [
        "38495",
        "25070",
        "18206",
        "11049",
        "4047",
        "5"
      ]
    },
    {
      "hadith_no": "612",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Traveling - أَبْوَابُ السَّفَرِ",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن حميد الرازي، قال حدثنا نعيم بن ميسرة النحوي، عن خالد بن زياد، نحوه ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه مثل هذا إلا من حديث مقاتل بن حيان عن شهر بن حوشب ‏.‏",
      "text_en": " Shahr bin Hawshab said:                     (Another chain) from Khalid bin Ziyad with similar.",
      "chain": [
        "38495",
        "25330"
      ]
    },
    {
      "hadith_no": "984",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن حميد الرازي، حدثنا حكام بن سلم، وهارون بن المغيرة، عن عنبسة، عن أبي حمزة، عن إبراهيم، عن علقمة، عن عبد الله، عن النبي صلى الله عليه وسلم قال ‏\"‏ إياكم والنعى فإن النعى من عمل الجاهلية ‏\"‏ ‏.‏ قال عبد الله والنعى أذان بالميت ‏.‏ وفي الباب عن حذيفة ‏.‏",
      "text_en": " Abdullah narrated that:                     The Prophet said: \"Beware of An-Na'i, for indeed announcing one's death is from the deeds of Jahliyyah.\"",
      "chain": [
        "38495",
        "20649",
        "28610",
        "11716",
        "20458",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "1677",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jihad - كتاب الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن حميد الرازي، حدثنا سلمة بن الفضل، عن محمد بن إسحاق، عن عكرمة، عن ابن عباس، عن عبد الرحمن بن عوف، قال عبأنا النبي صلى الله عليه وسلم ببدر ليلا ‏.‏ قال أبو عيسى وفي الباب عن أبي أيوب ‏.‏ وهذا حديث غريب لا نعرفه إلا من هذا الوجه ‏.‏ وسألت محمد بن إسماعيل عن هذا الحديث فلم يعرفه وقال محمد بن إسحاق سمع من عكرمة ‏.‏ وحين رأيته كان حسن الرأى في محمد بن حميد الرازي ثم ضعفه بعد ‏.‏",
      "text_en": " Narrated 'Abdur-Rahman bin 'Awf:                     \"The Messenger of Allah (ﷺ) positioned us during the night at Badr.\"[Abu 'Eisa said:] There is something on this topic from Abu Ayyub.This Hadith is Gharib, we do not know of it except from this route. I asked Muhammad bin Isma'il about this Hadith, but he did not know it, and he said: \"Muhammad bin Ishaq heard from 'Ikrimah.\" And when I saw him, he had a good opinion about Muhammad bin Humaid Ar-Razi, then he considered him weak later.",
      "chain": [
        "38495",
        "28221",
        "11107",
        "11023",
        "17",
        "8"
      ]
    },
    {
      "hadith_no": "1742",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Clothing - كتاب اللباس",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن حميد الرازي، حدثنا جرير، عن محمد بن إسحاق، عن الصلت بن عبد الله بن نوفل، قال رأيت ابن عباس يتختم في يمينه ولا إخاله إلا قال رأيت رسول الله صلى الله عليه وسلم يتختم في يمينه ‏.‏ قال أبو عيسى قال محمد بن إسماعيل حديث محمد بن إسحاق عن الصلت بن عبد الله بن نوفل حديث حسن صحيح ‏.‏",
      "text_en": " Narrated As-Salt bin 'Abdullah bin Nawfal:                     \"Ibn Abbas wore a ring on his right hand. And I do not doubt he said: 'I saw the Messenger of Allah (ﷺ) wearing a ring on his right hand.'\"[Abu 'Eisa said:] Muhammad bin Isma'il said: \"The Hadith is Muhammad bin Ishaq from As-Salt bin 'Abdullah bin Nawfal is a Hasan Sahih Hadith.\"",
      "chain": [
        "38495",
        "20028",
        "11107"
      ]
    },
    {
      "hadith_no": "1757",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Clothing - كتاب اللباس",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن حميد، حدثنا أبو داود، - هو الطيالسي عن عباد بن منصور، عن عكرمة، عن ابن عباس، أن النبي صلى الله عليه وسلم قال ‏\"‏ اكتحلوا بالإثمد فإنه يجلو البصر وينبت الشعر ‏\"‏ ‏.‏ وزعم أن النبي صلى الله عليه وسلم كانت له مكحلة يكتحل بها كل ليلة ثلاثة في هذه وثلاثة في هذه ‏.‏ وقد روي من غير وجه عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ عليكم بالإثمد فإنه يجلو البصر وينبت الشعر ‏\"‏ ‏.‏ قال وفي الباب عن جابر وابن عمر ‏.‏ قال أبو عيسى حديث ابن عباس حديث حسن لا نعرفه على هذا اللفظ إلا من حديث عباد بن منصور ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     That the Prophet (ﷺ) said: \"Use Ithmid for Kohl, for it clears the vision and grows the hair (eye-lashes).\" And he claimed that the Prophet (ﷺ) had a Kohl holder with which he would apply Kohl every night, three in this (eye) and three in this.Another chain with similar meaning.He said: There are narrations on this topic from Jabir and Ibn 'Umar[Abu 'Eisa said:] The Hadith of Ibn 'Abbas is a Hasan Gharib Hadith, we do not know of it with this wording except from the narration of 'Abbas bin Mansur.",
      "chain": [
        "38495",
        "20547",
        "19848",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "1762",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Clothing - كتاب اللباس",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن حميد الرازي، حدثنا أبو تميلة، والفضل بن موسى، وزيد بن حباب، عن عبد المؤمن بن خالد، عن عبد الله بن بريدة، عن أم سلمة، قالت كان أحب الثياب إلى النبي صلى الله عليه وسلم القميص ‏.‏ قال أبو عيسى هذا حديث حسن غريب إنما نعرفه من حديث عبد المؤمن بن خالد تفرد به وهو مروزي ‏.‏ وروى بعضهم هذا الحديث عن أبي تميلة عن عبد المؤمن بن خالد عن عبد الله بن بريدة عن أمه عن أم سلمة ‏.‏",
      "text_en": " Narrated Umm Salamah:                     \"The most loved garment to the Messenger to the Messenger of Allah (ﷺ) was the Qamis (long shirt).\"[Abu 'Eisa said:] This Hadith is Hasan Gharib. We only know of it as a narration of 'Abdul-Mu'min bin Khalid (a narrator in the chain of this Hadith) who was alone in narrating it, and he is from Al-Marwaz. Some of them report this Hadith from Abu Tumailah, from 'Abdul-Mu'min bin Khalid, from 'Abdullah bin Buraidah, from his mother, from Umm Salamah. He said: I heard Muhammad bin Ism'ail saying: \"The narration of Ibn Buraidah from his mother, from Umm Salamah is more correct, Abu Tumailah mentioned 'his mother' in it.\"",
      "chain": [
        "38495",
        "20183",
        "20452",
        "20650",
        "28375",
        "11432",
        "56"
      ]
    },
    {
      "hadith_no": "1785",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Clothing - كتاب اللباس",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن حميد، حدثنا زيد بن حباب، وأبو تميلة يحيى بن واضح عن عبد الله بن مسلم، عن عبد الله بن بريدة، عن أبيه، قال جاء رجل إلى النبي صلى الله عليه وسلم وعليه خاتم من حديد فقال ‏\"‏ ما لي أرى عليك حلية أهل النار ‏\"‏ ‏.‏ ثم جاءه وعليه خاتم من صفر فقال ‏\"‏ ما لي أجد منك ريح الأصنام ‏\"‏ ‏.‏ ثم أتاه وعليه خاتم من ذهب فقال ‏\"‏ ما لي أرى عليك حلية أهل الجنة ‏\"‏ ‏.‏ قال من أى شيء أتخذه قال ‏\"‏ من ورق ولا تتمه مثقالا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏ وفي الباب عن عبد الله بن عمرو ‏.‏ وعبد الله بن مسلم يكنى أبا طيبة وهو مروزي ‏.‏",
      "text_en": " Narrated 'Abdullah bin Buraidah:                     From his father who said: \"A man wearing an iron ring came to the Prophet (ﷺ). So he said to him: 'What is this I see on you, jewelry of the people of the Fire ?' Then he came wearing a ring of brass. So he said: 'What is this smell of idols I sense on you ?' Then he came wearing a ring of gold. So he said to him: 'What is this jewelry of the people of Paradise I see on you ?' So he said: 'What should I use then ?' He said: 'From silver, but not its entire weight.\"[Abu 'Eisa said:] This Hadith is Gharib and there are narrations on this topic from 'Abdullah bin 'Amr, and 'Abdullah bin Muslim's Kunyah is Abu Taibah, and he is from Al-Marwaz.",
      "chain": [
        "38495",
        "20650",
        "11872",
        "11432",
        "3131"
      ]
    },
    {
      "hadith_no": "1811",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن حميد، حدثنا زيد بن الحباب، عن أبي خلدة، عن أبي العالية، قال الثوم من طيبات الرزق ‏.‏ وأبو خلدة اسمه خالد بن دينار وهو ثقة عند أهل الحديث وقد أدرك أنس بن مالك وسمع منه وأبو العالية اسمه رفيع هو الرياحي قال عبد الرحمن بن مهدي كان أبو خلدة خيارا مسلما ‏.‏",
      "text_en": " Narrated Abu Khaldah:                     That Abu Al-'Aliyah said: \"garlic is among the good provisions.\" Abu Khaldah's name is Khalid bin Dinar, and he is trustworthy according to the people of Hadith. He saw Anas bin Malik and heard narrations from him. Abu Al-'Aliyah's name is Rufai' and he is Ar-Riyahi. 'Abdur-Rahman bin Mahdi said: \"Abu Khaldah was preferable, reliable.\"",
      "chain": [
        "38495",
        "20650",
        "11618",
        "20033"
      ]
    },
    {
      "hadith_no": "2289",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Qadar - كتاب القدر عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "32",
      "text_ar": "حدثنا محمد بن حميد الرازي، وسعيد بن يعقوب، قالا حدثنا يحيى بن الضريس، عن أبي مودود، عن سليمان التيمي، عن أبي عثمان النهدي، عن سلمان، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يرد القضاء إلا الدعاء ولا يزيد في العمر إلا البر ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن أبي أسيد ‏.‏ وهذا حديث حسن غريب من حديث سلمان لا نعرفه إلا من حديث يحيى بن الضريس ‏.‏ وأبو مودود اثنان أحدهما يقال له فضة وهو الذي روى هذا الحديث اسمه فضة بصري والآخر عبد العزيز بن أبي سليمان أحدهما بصري والآخر مدني وكانا في عصر واحد ‏.‏",
      "text_en": " 'Salman narrated that the Messenger of Allah (s.a.w) said:                     \"Nothing turns back the Decree except supplication, and nothing increases the life-span except righteousness.\"",
      "chain": [
        "38495",
        "20678",
        "11289",
        "11113",
        "14"
      ]
    },
    {
      "hadith_no": "2402",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا محمد بن حميد الرازي، ويوسف بن موسى القطان البغدادي، قالا حدثنا عبد الرحمن بن مغراء أبو زهير، عن الأعمش، عن أبي الزبير، عن جابر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يود أهل العافية يوم القيامة حين يعطى أهل البلاء الثواب لو أن جلودهم كانت قرضت في الدنيا بالمقاريض ‏\"‏ ‏.‏ وهذا حديث غريب لا نعرفه بهذا الإسناد إلا من هذا الوجه ‏.‏ وقد روى بعضهم هذا الحديث عن الأعمش عن طلحة بن مصرف عن مسروق قوله شيئا من هذا ‏.‏",
      "text_en": " Jabir narrated that the Prophet(s.a.w) said:                     \"On the Day of Judgement, when the people who were tried (in this world) are given their rewards, the people who were pardoned (in life), will wish that their skins had been cut off with scissors while they were in th world.\"",
      "chain": [
        "38495",
        "30224",
        "11060",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "2666",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا محمد بن حميد الرازي، حدثنا عبد العزيز بن عبد الله القرشي، حدثنا يحيى البكاء، عن ابن عمر، قال تجشأ رجل عند النبي صلى الله عليه وسلم فقال ‏\"‏ كف عنا جشاءك فإن أكثرهم شبعا في الدنيا أطولهم جوعا يوم القيامة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب من هذا الوجه ‏.‏ وفي الباب عن أبي جحيفة ‏.‏",
      "text_en": " Yahya Al-Bakka' narrated from Ibn 'Umar who said:                     \"A man belched in the presence of the Prophet(s.a.w), so he said: 'Restain your belching from us. For indeed those who are filled most in the world will be the hungriest on the Day of Judgement.'\"",
      "chain": [
        "38495",
        "14420",
        "18"
      ]
    },
    {
      "hadith_no": "2670",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا محمد بن حميد الرازي، حدثنا زافر بن سليمان، عن إسرائيل، عن شبيب بن بشير، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ النفقة كلها في سبيل الله إلا البناء فلا خير فيه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏ هكذا قال محمد بن حميد شبيب بن بشير وإنما هو شبيب بن بشر ‏.‏",
      "text_en": " Shahib bin Bashir narrated from Anas bin Malik that the Messenger of Allah (s.a.w) said:                     \"All expenditures are in Allah's Cause, except for buildings, for there is no good in it.\"",
      "chain": [
        "38495",
        "26511",
        "20311",
        "19"
      ]
    },
    {
      "hadith_no": "2648",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Knowledge - كتاب العلم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "41",
      "text_ar": "حدثنا محمد بن حميد الرازي، حدثنا محمد بن المعلى، حدثنا زياد بن خيثمة، عن أبي داود، عن عبد الله بن سخبرة، عن سخبرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من طلب العلم كان كفارة لما مضى ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث ضعيف الإسناد ‏.‏ أبو داود يضعف ولا نعرف لعبد الله بن سخبرة كبير شيء ولا لأبيه واسم أبي داود نفيع الأعمى تكلم فيه قتادة وغير واحد من أهل العلم ‏.‏",
      "text_en": " Narrated 'Abdullah bin Sakhbarah:                     narrated that the Prophet (ﷺ) said: \"Whoever seeks knowledge, he is atoning for what has passed (of sins while doing so).\"",
      "chain": [
        "38495",
        "20585",
        "30002",
        "11360"
      ]
    },
    {
      "hadith_no": "3187",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Recitation - كتاب القراءات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "46",
      "text_ar": "حدثنا محمد بن حميد الرازي، حدثنا نعيم بن ميسرة النحوي، عن فضيل بن مرزوق، عن عطية العوفي، عن ابن عمر، أنه قرأ على النبي صلى الله عليه وسلم ‏(‏خلقكم من ضعف ‏)‏ فقال من ضعف ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     that he recited the following to the Prophet (ﷺ): \"Who created you in the weakness (Min Da'f)\" So he said: \"Min Du'f\"",
      "chain": [
        "38495",
        "25330",
        "20598",
        "15373",
        "18"
      ]
    },
    {
      "hadith_no": "3639",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمد بن حميد الرازي، عن عبد الرحمن بن عبد الله بن سعد، عن والده عبد الله بن سعد، ‏.‏ حدثنا يحيى بن موسى، حدثنا عبد الرحمن بن عبد الله بن سعد الرازي، وهو الدشتكي أن أباه، أخبره أن أباه رحمه الله أخبره كذا، قال أخبره قال رأيت رجلا ببخارى على بغلة وعليه عمامة سوداء ويقول كسانيها رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Abdur-Rahman bin Abdullah bin Sa’d Ar-Razi [and he is Ad-Dashtaki] narrated :                     that his father informed him, that his father – may Allah have mercy upon him – informed him, he said: “I saw a man in Bukhara upon a mule wearing a black Imamah, saying: ‘It was given to me by the Messenger of Allah.’”",
      "chain": [
        "38495",
        "30221"
      ]
    },
    {
      "hadith_no": "3533",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا محمد بن حميد الرازي، حدثنا الفضل بن موسى، عن الأعمش، عن أنس، أن رسول الله صلى الله عليه وسلم مر بشجرة يابسة الورق فضربها بعصاه فتناثر الورق فقال ‏\"‏ إن الحمد لله وسبحان الله ولا إله إلا الله والله أكبر لتساقط من ذنوب العبد كما تساقط ورق هذه الشجرة ‏\"‏ ‏.‏ قال هذا حديث غريب ‏.‏ ولا نعرف للأعمش سماعا من أنس إلا أنه قد رآه ونظر إليه ‏.‏",
      "text_en": " Anas bin Malik narrated that:                     the Prophet passed by a tree with dry leaves, so he struck it with his staff, making the leaves fall. Then he said: “Indeed, all praise is due to Allah, (Al-Hamdulillah)’ ‘glory to Allah, (Subhan Allah)’ none has the right to be worshipped by Allah, (La Ilaha Illallah)’ and ‘Allah is the greatest (Allahu Akbar)’ cause the sins to fall from the worshipper, just as the leaves of this tree fall.”",
      "chain": [
        "38495",
        "20452",
        "11060",
        "19"
      ]
    },
    {
      "hadith_no": "3586",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا محمد بن حميد، حدثنا علي بن أبي بكر، عن الجراح بن الضحاك الكندي، عن أبي شيبة، عن عبد الله بن عكيم، عن عمر بن الخطاب، قال علمني رسول الله صلى الله عليه وسلم قال ‏\"‏ قل اللهم اجعل سريرتي خيرا من علانيتي واجعل علانيتي صالحة اللهم إني أسألك من صالح ما تؤتي الناس من المال والأهل والولد غير الضال ولا المضل ‏\"‏ ‏.‏ قال هذا حديث غريب لا نعرفه إلا من هذا الوجه وليس إسناده بالقوي ‏.‏",
      "text_en": " Umar bin Al-Khattab said:                     “The Messenger of Allah taught me, saying: ‘Say: “O Allah, make my secret better than my apparent condition, and make my apparent condition righteous. O Allah, I ask You for the righteous of what you give to the people, of weath, wives, and children, not (to be) misguided, nor misguiding. (Allahummaj’al Sarirati Khairan Min Alaniyati Waj’al Alaniyati Salihah. Allahumma Inni As’aluka Min Salihi Ma Tu’tin-Nasa Minal-Mali Wal-Ahli Wal Waladi Ghairad-Dali Wa Lal-Mudil).”",
      "chain": [
        "38495",
        "28407",
        "25040",
        "25007",
        "10786",
        "3"
      ]
    },
    {
      "hadith_no": "4042",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن حميد، حدثنا إبراهيم بن المختار، عن إسحاق بن راشد، عن الزهري، عن عروة، عن عائشة، أن النبي صلى الله عليه وسلم أمر بسد الأبواب إلا باب أبي بكر ‏.‏ هذا حديث غريب من هذا الوجه ‏.‏ وفي الباب عن أبي سعيد ‏.‏",
      "text_en": " Narrated 'Aishah:                     that the Prophet (ﷺ) ordered the closing of all the gates, except for the gate of Abu Bakr. And there is a nation on this topic from Abu Sa'eed.",
      "chain": [
        "38495",
        "20111",
        "20409",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "4058",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن حميد الرازي، حدثنا عبد الله بن عبد القدوس، حدثنا الأعمش، عن عمرو بن مرة، عن عبد الله بن سلمة، عن عبيدة السلماني، عن عبد الله بن مسعود، أن النبي صلى الله عليه وسلم قال ‏\"‏ يطلع عليكم رجل من أهل الجنة ‏\"‏ ‏.‏ فاطلع أبو بكر ثم قال ‏\"‏ يطلع عليكم رجل من أهل الجنة ‏\"‏ ‏.‏ فاطلع عمر ‏.‏ وفي الباب عن أبي موسى وجابر ‏.‏ قال هذا حديث غريب من حديث ابن مسعود ‏.‏",
      "text_en": " Narrated 'Abdullah bin Mas'ud:                     that the Prophet (ﷺ) said: \"A man among the inhabitants of Paradise will appear before you.\" So Abu Bakr appeared. Then he said: \"A man among the inhabitants of Paradise will appear before you.\" So 'Umar appeared.",
      "chain": [
        "38495",
        "25147",
        "11060",
        "11381",
        "16"
      ]
    },
    {
      "hadith_no": "4097",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن حميد الرازي، حدثنا إبراهيم بن المختار، عن شعبة، عن أبي بلج، عن عمرو بن ميمون، عن ابن عباس، أن رسول الله صلى الله عليه وسلم أمر بسد الأبواب إلا باب علي ‏.‏ قال هذا حديث غريب لا نعرفه عن شعبة بهذا الإسناد إلا من هذا الوجه ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     \"The Prophet (ﷺ) ordered that the gates be closed, except the gate of 'Ali.\"",
      "chain": [
        "38495",
        "20111",
        "20020",
        "11382",
        "17"
      ]
    },
    {
      "hadith_no": "4099",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن حميد، حدثنا إبراهيم بن المختار، عن شعبة، عن أبي بلج، عن عمرو بن ميمون، عن ابن عباس، قال أول من صلى علي ‏.‏ قال هذا حديث غريب من هذا الوجه لا نعرفه من حديث شعبة عن أبي بلج إلا من حديث محمد بن حميد ‏.‏ وأبو بلج اسمه يحيى بن أبي سليم ‏.‏ وقد اختلف أهل العلم في هذا فقال بعضهم أول من أسلم أبو بكر الصديق ‏.‏ وقال بعضهم أول من أسلم علي ‏.‏ وقال بعض أهل العلم أول من أسلم من الرجال أبو بكر وأسلم علي وهو غلام ابن ثمان سنين وأول من أسلم من النساء خديجة ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     Ibn 'Abbas said: \"The first to perform Salat was 'Ali.\"",
      "chain": [
        "38495",
        "20111",
        "20020",
        "11382",
        "17"
      ]
    },
    {
      "hadith_no": "314",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن حميد، حدثنا الحكم بن بشير بن سلمان، حدثنا خلاد الصفار، عن الحكم النصري، عن أبي إسحاق، عن أبي جحيفة، عن علي، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ ستر ما بين الجن وعورات بني آدم إذا دخل الكنيف أن يقول بسم الله ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Ali said:                     \"The Messenger of Allah said: 'The screen between the Jinn and the nakedness of the sons of Adam is that when a person enters the Kanif, he should say: Bismillah (in the name of Allah).'\"",
      "chain": [
        "38495",
        "25070",
        "11049",
        "4047",
        "5"
      ]
    },
    {
      "hadith_no": "368",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن حميد، حدثنا علي بن أبي بكر، عن سفيان الثوري، عن عكرمة بن عمار، عن يحيى بن أبي كثير، عن عياض بن عبد الله، نحوه ‏.‏",
      "text_en": "",
      "chain": [
        "38495",
        "28407",
        "20012",
        "10704",
        "11449",
        "11260"
      ]
    },
    {
      "hadith_no": "1360",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن حميد، حدثنا أبو تميلة، عن فليح بن سليمان، عن سعيد بن الحارث الزرقي، عن أبي هريرة، أن النبي  صلى الله عليه وسلم  كان إذا خرج إلى العيد رجع في غير الطريق الذي أخذ فيه ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that when the Prophet (ﷺ) wentout to‘Eid (prayers), he would return via another route than thefirstone he took.",
      "chain": [
        "38495",
        "20183",
        "20169",
        "11167",
        "13"
      ]
    },
    {
      "hadith_no": "1599",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن حميد، حدثنا مهران بن أبي عمر، عن أبي سنان، عن علقمة بن مرثد، عن ابن بريدة، عن أبيه، أن النبي  صلى الله عليه وسلم  صلى على ميت بعد ما دفن ‏.‏",
      "text_en": " It wasnarrated from Ibn Buraidah from his father that the Prophet(ﷺ)offered the funeral prayer for a deceased person after he hadbeenburied.",
      "chain": [
        "38495",
        "28586",
        "11374",
        "11432",
        "3131"
      ]
    },
    {
      "hadith_no": "2192",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Expiation - كتاب الكفارات",
      "chapter_no": "11",
      "text_ar": "حدثنا سفيان بن وكيع، حدثنا محمد بن حميد المعمري، عن معمر، عن همام، قال سمعت أبا هريرة، يقول قال أبو القاسم  صلى الله عليه وسلم  ‏\"‏ إذا استلج أحدكم في اليمين فإنه آثم له عند الله من الكفارة التي أمر بها ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Hammam heard Abu Hurairah saying that 'Abul-Qasim (ﷺ) said:                     \"If anyone of you insists on fulfilling what he swore to (after learning that it is wrong) then it is more sinful before Allah than (breaking the oath for which) the expiation that has been enjoined upon him.\"",
      "chain": [
        "35047",
        "38495",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "2535",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Pawning - كتاب الرهون",
      "chapter_no": "16",
      "text_ar": "حدثنا محمد بن حميد، حدثنا إبراهيم بن المختار، عن إسحاق بن راشد، عن الزهري، عن سعيد بن المسيب، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يغلق الرهن ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:                     “Do not forfeit items held in pledge.”",
      "chain": [
        "38495",
        "20111",
        "20409",
        "11013",
        "11002",
        "13"
      ]
    }
  ],
  "total_hadiths": 32
}