{
  "id": "38502",
  "name": "Muhammad bin Khlf bin Amar محمد بن خلف بن عمار",
  "full_name": "Muhammad bin Khlf bin Amar محمد بن خلف بن عمار",
  "grade": "3rd Century AH [11th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "260",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "'Asqalan"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ س  ق  -  صدوق ]"
    ],
    "tags": [
      "'Asqalan"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "id": "sunan-ibn-majah-1537",
      "hadith_no": "1537",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن خلف العسقلاني، حدثنا عمرو بن أبي سلمة، قال هذا ما سمعت من أبي معيد، حفص بن غيلان عن سليمان بن موسى، عن نافع، عن عبد الله بن عمر، قال كفن رسول الله  صلى الله عليه وسلم  في ثلاث رياط بيض سحولية ‏.‏",
      "text_en": " It wasnarrated that ‘Abdullah bin ‘Umar said:                      “The Messenger ofAllah(ﷺ) was shrouded in three thin white Suhuli cloths.”",
      "usc_msa_ref": "",
      "chain": [
        "38502",
        "30286",
        "10880",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-ibn-majah-1641",
      "hadith_no": "1641",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو بشر قالا حدثنا قبيصة، ح وحدثنا أبو كريب، حدثنا عبيد بن سعيد، ح وحدثنا محمد بن خلف العسقلاني، حدثنا الفريابي، وقبيصة، كلهم عن سفيان، عن عبد الله بن عثمان بن خثيم، عن عبد الرحمن بن بهمان، عن عبد الرحمن بن حسان بن ثابت، عن أبيه، قال لعن رسول الله  صلى الله عليه وسلم  زوارات القبور ‏.‏",
      "text_en": " It wasnarrated from ‘Abdur-Rahman bin Hassan bin Thabit that hisfathersaid:                      “The Messenger of Allah (ﷺ) cursed women who visitgraves.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "11419",
        "20351",
        "30216",
        "20665",
        "38502",
        "20034",
        "20351",
        "20012",
        "10644",
        "12272",
        "451",
        "452"
      ]
    },
    {
      "id": "sunan-ibn-majah-1969",
      "hadith_no": "1969",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن يحيى، ومحمد بن خلف العسقلاني، قالوا حدثنا عبيد الله بن موسى، عن الأوزاعي، عن قرة، عن الزهري، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ كل أمر ذي بال لا يبدأ فيه بالحمد أقطع ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     the Messenger of  Allah said: “Every important matter that does not start with praise of Allah, is devoid (of blessings).”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "11222",
        "38502",
        "20340",
        "20024",
        "11301",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-2039",
      "hadith_no": "2039",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن خلف العسقلاني، حدثنا الفريابي، عن أبان بن أبي حازم، عن أبي بكر بن حفص، عن ابن عمر، قال لما ولي عمر بن الخطاب خطب الناس فقال إن رسول الله  صلى الله عليه وسلم  أذن لنا في المتعة ثلاثا ثم حرمها والله لا أعلم أحدا تمتع وهو محصن إلا رجمته بالحجارة إلا أن يأتيني بأربعة يشهدون أن رسول الله أحلها بعد إذ حرمها ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                     \"When 'Umar bin Khattab was appointed caliph, he addressed the people and said: 'The Messenger of Allah permitted temporary marriage for us three times, then he forbade it. By Allah, If I hear of any married person entering a temporary marriage, I will stone him to death, unless he can bring me four witnesses who will testify that the Messenger of Allah, allowed it after he forbade it'.\"",
      "usc_msa_ref": "",
      "chain": [
        "38502",
        "20034",
        "11180",
        "18",
        "3"
      ]
    },
    {
      "id": "sunan-ibn-majah-2515",
      "hadith_no": "2515",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Charity - كتاب الصدقات",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن خلف العسقلاني، ومحمد بن يحيى، قالا حدثنا ابن أبي مريم، حدثنا يحيى بن أيوب، عن عبيد الله بن أبي جعفر، عن نافع، عن ابن عمر، وعائشة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من طلب حقا فليطلبه في عفاف واف أو غير واف ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar and 'Aishah that the Messenger of Allah (ﷺ) said:                     “Whoever demands his rights let him do so in a decent manner as much as he can.”",
      "usc_msa_ref": "",
      "chain": [
        "38502",
        "11222",
        "30232",
        "20379",
        "11409",
        "11014",
        "18",
        "53"
      ]
    },
    {
      "id": "sunan-ibn-majah-2524",
      "hadith_no": "2524",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Charity - كتاب الصدقات",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن خلف العسقلاني، حدثنا يعلى، حدثنا سليمان بن يسير، عن قيس بن رومي، قال كان سليمان بن أذنان يقرض علقمة ألف درهم إلى عطائه فلما خرج عطاؤه تقاضاها منه واشتد عليه فقضاه فكأن علقمة غضب فمكث أشهرا ثم أتاه فقال أقرضني ألف درهم إلى عطائي قال نعم وكرامة يا أم عتبة هلمي تلك الخريطة المختومة التي عندك ‏.‏ فجاءت بها فقال أما والله إنها لدراهمك التي قضيتني ما حركت منها درهما واحدا ‏.‏ قال فلله أبوك ما حملك على ما فعلت بي ‏.‏ قال ما سمعت منك ‏.‏ قال ما سمعت مني قال سمعتك تذكر عن ابن مسعود أن النبي صلى الله عليه وسلم قال ‏\"‏ ما من مسلم يقرض مسلما قرضا مرتين إلا كان كصدقتها مرة ‏\"‏ ‏.‏ قال كذلك أنبأني ابن مسعود ‏.‏",
      "text_en": " It was narrated that Qais bin Rumi said:                     “Sulaiman bin Udhunan lent 'Alqamah one thousand Dirham until he got his salary, When he got his salary, he demanded that he pay him back and treated him harshly. He paid him back, and it was as if 'Alqamah was angry. Several months passed then he came to him and said: 'Lend me one thousand Dirham until my salary comes.' He said 'Yes, it would be an honor. O Umm 'Utbah! Bring me that sealed leather bag that you have.' He said: 'By Allah(SWT), these are your Dirham that you paid back to me; I did not touch a single Dirham., ' What made you do what you did to me (i.e., treat me so harshly)?' He said: 'What I heard from you.' He said: 'What did you hear from me?' He said: 'I heard you narrated from Ibn Mas'ud that the Prophet (ﷺ) said: “There is no Muslim who lends something to another Muslim twice, but it will be like giving charity once.”He said: 'That is what Ibn Mas'ud told me.' ”",
      "usc_msa_ref": "",
      "chain": [
        "38502",
        "20372",
        "15214",
        "18866"
      ]
    },
    {
      "id": "sunan-ibn-majah-2629",
      "hadith_no": "2629",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Manumission (of Slaves) - كتاب العتق",
      "chapter_no": "19",
      "text_ar": "حدثنا محمد بن بشار، حدثنا حماد بن مسعدة، ح وحدثنا محمد بن خلف العسقلاني، وإسحاق بن منصور، قالا حدثنا عبيد الله بن عبد المجيد، حدثنا عبيد الله بن عبد الرحمن بن عبد الله بن موهب، عن القاسم بن محمد، عن عائشة، أنها كان لها غلام وجارية زوج فقالت يا رسول الله إني أريد أن أعتقهما ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن أعتقتهما فابدئي بالرجل قبل المرأة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that :                     `Aishah had a male slave and a female slave who were married. She said: “O Messenger of Allah (ﷺ), I want to free them both.” The Messenger of Allah (ﷺ) said: “If you free them, then start with the man before the woman.”",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20224",
        "38502",
        "30313",
        "10535",
        "53"
      ]
    },
    {
      "id": "sunan-ibn-majah-3247",
      "hadith_no": "3247",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Sacrifices - كتاب الأضاحي",
      "chapter_no": "26",
      "text_ar": "حدثنا محمد بن خلف العسقلاني، حدثنا آدم بن أبي إياس، حدثنا سلام بن مسكين، حدثنا عائذ الله، عن أبي داود، عن زيد بن أرقم، قال قال أصحاب رسول الله  صلى الله عليه وسلم  يا رسول الله ما هذه الأضاحي قال ‏\"‏ سنة أبيكم إبراهيم ‏\"‏ ‏.‏ قالوا فما لنا فيها يا رسول الله قال ‏\"‏ بكل شعرة حسنة ‏\"‏ ‏.‏ قالوا فالصوف يا رسول الله قال ‏\"‏ بكل شعرة من الصوف حسنة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Zaid bin Arqam said:                      “The Companions of theMessengerof Allah (ﷺ) said: ‘O Messenger of Allah, what are thesesacrifices?’ He said: ‘The Sunnah of your father Ibrahim.’ Theysaid:‘What is there for us in them, O Messenger of Allah?’ Hesaid: ‘Forevery hair, one merit.’ They said: ‘What about wool,O Messenger ofAllah?’ He said: ‘For every hair of wool, onemerit.’”",
      "usc_msa_ref": "",
      "chain": [
        "38502",
        "20404",
        "20237",
        "30002",
        "384"
      ]
    },
    {
      "id": "sunan-ibn-majah-3398",
      "hadith_no": "3398",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا محمد بن خلف العسقلاني، حدثنا عبيد الله، حدثنا عبد الأعلى، عن يحيى بن أبي كثير، عن عروة بن الزبير، عن ابن عمر، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إذا وضعت المائدة فليأكل مما يليه ولا يتناول من بين يدى جليسه ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Umar that the Messenger of Allah (ﷺ)said:                     “When food is served, eat from that which is in front of you,anddo not take from what is in front of your companion.’”",
      "usc_msa_ref": "",
      "chain": [
        "38502",
        "11201",
        "20246",
        "11449",
        "10511",
        "18"
      ]
    },
    {
      "id": "sunan-ibn-majah-3420",
      "hadith_no": "3420",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا محمد بن خلف العسقلاني، حدثنا عبيد الله، أنبأنا عبد الأعلى، عن يحيى بن أبي كثير، عن عروة بن الزبير، عن ابن عمر، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إذا وضعت المائدة فلا يقوم رجل حتى ترفع المائدة ولا يرفع يده وإن شبع حتى يفرغ القوم وليعذر فإن الرجل يخجل جليسه فيقبض يده وعسى أن يكون له في الطعام حاجة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Umar that the Messenger of Allah (ﷺ)said:                     “When a meal is served, a man should not stand up until it isremoved, and he should not take his hand away, even if he is full,until the people have finished. And let him continue eating.* For aman may make his companion shy, causing him to withhold his hand, andperhaps he has a need for the food.”",
      "usc_msa_ref": "",
      "chain": [
        "38502",
        "11201",
        "20246",
        "11449",
        "10511",
        "18"
      ]
    },
    {
      "id": "sunan-ibn-majah-3671",
      "hadith_no": "3671",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا أبو بكر، ومجاهد بن موسى، ومحمد بن خلف العسقلاني، قالوا حدثنا يونس بن محمد، حدثنا مفضل بن فضالة، عن حبيب بن الشهيد، عن محمد بن المنكدر، عن جابر بن عبد الله، أن رسول الله  صلى الله عليه وسلم  أخذ بيد رجل مجذوم فأدخلها معه في القصعة ثم قال ‏\"‏ كل ثقة بالله وتوكلا على الله ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Jabir bin ‘Abdullah that the Messenger of Allah(ﷺ)took the hand of a leper and made him eat with him, and said:                     “Eat,with trust in Allah and reliance upon Allah.”",
      "usc_msa_ref": "",
      "chain": [
        "20436",
        "30521",
        "38502",
        "20393",
        "20378",
        "11275",
        "11048",
        "34"
      ]
    }
  ],
  "total_hadiths": 11
}