{
  "id": "38554",
  "name": "Muhammad bin 'Ali bin al-Hasan محمد بن علي بن الحسن بن شقيق حلق",
  "full_name": "Muhammad bin 'Ali bin al-Hasan محمد بن علي بن الحسن بن شقيق حلق",
  "grade": "3rd Century AH [11th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "250",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Merv"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ت  س  -  ثقة ]"
    ],
    "tags": [
      "al-'Abdi",
      "Client",
      "al-Mervazi"
    ]
  },
  "parents": [
    {
      "id": "30362",
      "name": "'Ali bin al-Hasan bin Shaqayq علي بن الحسن بن شقيق",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "30362",
      "name": "'Ali bin al-Hasan bin Shaqayq علي بن الحسن بن شقيق",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20318",
      "name": "Hammad bin Usamah حماد بن أسامة - أبو أسامة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20408",
      "name": "Asbat bin Muhammad أسباط بن محمد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20291",
      "name": "al-Nadr bin Shumayl al-Maazni النضر بن شميل المازني أبو الحسن النحوي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20632",
      "name": "'Ali bin Hafs al-Mada'ini علي بن حفص المدائني",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30349",
      "name": "'Abdullah bin 'Uthman - ''Aabadan عبد الله بن عثمان - عبدان",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30322",
      "name": "Hiban bin Musa bin Sawar حبان بن موسى بن سوار",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "students": [
    {
      "id": "30005",
      "name": "Imam Tirmidhi الترمذي محمد بن عيسى بن سورة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30006",
      "name": "Imam Nasa'i أحمد بن شعيب بن علي بن سنان النسائي",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30004",
      "name": "Ibn Maja ابن ماجة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30554",
      "name": "Abu Zara' al-Razi أبو زرعة الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30013",
      "name": "Ibn Abi Dunya ابن أبي الدنيا",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30495",
      "name": "Ahmed bin al-Hasan bin Khrash أحمد بن الحسن بن خراش",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "2621",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Faith - كتاب الإيمان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "40",
      "text_ar": "حدثنا أبو عمار الحسين بن حريث، ويوسف بن عيسى، قالا حدثنا الفضل بن موسى، عن الحسين بن واقد، ح وحدثنا أبو عمار الحسين بن حريث، ومحمود بن غيلان، قالا حدثنا علي بن الحسين بن واقد، عن أبيه، ح وحدثنا محمد بن علي بن الحسن بن شقيق، ومحمود بن غيلان، قالا حدثنا علي بن الحسن بن شقيق، عن الحسين بن واقد، عن عبد الله بن بريدة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ العهد الذي بيننا وبينهم الصلاة فمن تركها فقد كفر ‏\"‏ ‏.‏ وفي الباب عن أنس وابن عباس ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏",
      "text_en": " Narrated Abdullah bin Buraidah narrated from his father:                     that the Messenger of Allah (ﷺ) said: \"The covenant between us and them is the Salat, so whoever abandons it he has committed disbelief.\"",
      "chain": [
        "30325",
        "30401",
        "20452",
        "20648",
        "30325",
        "30277",
        "30555",
        "20648",
        "38554",
        "30277"
      ]
    },
    {
      "hadith_no": "906",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا محمد بن علي بن الحسن بن شقيق، قال سمعت أبي يقول، أنبأنا أبو حمزة، عن منصور بن زاذان، عن أنس بن مالك، قال صلى بنا رسول الله صلى الله عليه وسلم فلم يسمعنا قراءة ‏{‏ بسم الله الرحمن الرحيم ‏}‏ وصلى بنا أبو بكر وعمر فلم نسمعها منهما ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                     \"The Messenger of Allah (ﷺ) led us in prayer, and we did not hear him recite: In the Name of Allah, the Most Gracious, the Most Merciful. And Abu Bakr and Umar led us in prayer and we did not hear it from them either.\"",
      "chain": [
        "38554",
        "30362",
        "20458",
        "11444",
        "19"
      ]
    },
    {
      "hadith_no": "999",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا محمد بن علي بن الحسن بن شقيق، قال حدثنا أبي قال، أنبأنا الحسين بن واقد، عن عبد الله بن بريدة، عن أبيه، أن رسول الله صلى الله عليه وسلم كان يقرأ في صلاة العشاء الآخرة بالشمس وضحاها وأشباهها من السور ‏.‏",
      "text_en": " It was narrated from Abdullah bin Buraidah, from his father, that:                     The Messenger of Allah (ﷺ) used to recite 'By the sun and its brightness' and similar surahs in Isha'.",
      "chain": [
        "38554",
        "30362",
        "20648",
        "11432",
        "3131"
      ]
    },
    {
      "hadith_no": "1439",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Shortening the Prayer When Traveling - كتاب تقصير الصلاة فى السفر",
      "chapter_no": "15",
      "text_ar": "أخبرنا محمد بن علي بن الحسن بن شقيق، قال أبي أنبأنا أبو حمزة، - وهو السكري - عن منصور، عن إبراهيم، عن علقمة، عن عبد الله، قال صليت مع رسول الله صلى الله عليه وسلم في السفر ركعتين ومع أبي بكر ركعتين ومع عمر ركعتين رضى الله عنهما ‏.‏",
      "text_en": " It was narrated that 'Abdullah said:                     \"I prayed two rak'ahs with the Messenger of Allah (ﷺ) on a journey, and two rak'ahs with Abu Bakr, and two rak'ahs with 'Umar, may Allah (SWT) be pleased with them both.\"",
      "chain": [
        "38554",
        "30362",
        "20458",
        "11067",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "1677",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا سليمان بن سلم، ومحمد بن علي بن الحسن بن شقيق، عن النضر بن شميل، قال أنبأنا شعبة، عن أبي شمر، عن أبي عثمان، عن أبي هريرة، قال أوصاني خليلي صلى الله عليه وسلم بثلاث النوم على وتر وصيام ثلاثة أيام من كل شهر وركعتى الضحى ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"My dearest friend advised me (to do) three things: 'To sleep after praying Witr, to fast three days each month, and to pray two rak'ahs of Fajr.'\"",
      "chain": [
        "38554",
        "20291",
        "20020",
        "11113",
        "13"
      ]
    },
    {
      "hadith_no": "2368",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن علي بن الحسن بن شقيق، قال أبي أنبأنا أبو حمزة، عن عاصم، عن زر، عن عبد الله بن مسعود، قال كان رسول الله صلى الله عليه وسلم يصوم ثلاثة أيام من غرة كل شهر وقلما يفطر يوم الجمعة ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Masud said:                     \"The Messenger of Allah used to fast three days in the middle of every month, and he rarely did not fast on Friday.\"",
      "chain": [
        "38554",
        "30362",
        "20458",
        "11080",
        "11337",
        "16"
      ]
    },
    {
      "hadith_no": "2736",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن علي بن الحسن بن شقيق، قال أنبأنا أبي قال، أنبأنا أبو حمزة، عن مطرف، عن سلمة بن كهيل، عن طاوس، عن ابن عباس، قال سمعت عمر، يقول والله إني لأنهاكم عن المتعة، وإنها، لفي كتاب الله ولقد فعلها رسول الله صلى الله عليه وسلم يعني العمرة في الحج ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"I heard 'Umar say\" 'By Allah, I forbid you to forbid you to perform Tamattur,' but it is mentioned in the Book of Allah and the Messenger of Allah did it\" meaning 'Umrah with Hajj.",
      "chain": [
        "38554",
        "30362",
        "20458",
        "11395",
        "11350",
        "11053",
        "17",
        "3"
      ]
    },
    {
      "hadith_no": "3086",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا محمد بن علي بن الحسن بن شقيق، قال أنبأنا أبي قال، أنبأنا الحسين بن واقد، عن عمرو بن دينار، عن عكرمة، عن ابن عباس، أن عبد الرحمن بن عوف، وأصحابا، له أتوا النبي صلى الله عليه وسلم بمكة فقالوا يا رسول الله إنا كنا في عز ونحن مشركون فلما آمنا صرنا أذلة ‏.‏ فقال ‏\"‏ إني أمرت بالعفو فلا تقاتلوا ‏\"‏ ‏.‏ فلما حولنا الله إلى المدينة أمرنا بالقتال فكفوا فأنزل الله عز وجل ‏{‏ ألم تر إلى الذين قيل لهم كفوا أيديكم وأقيموا الصلاة ‏}‏ ‏.‏",
      "text_en": " Narrated It was narrated from Ibn Abbas:                     that Abdur-Rahman bin Awf and some of his companions came to the Prophet in Makkah and said: “O Messenger of Allah! We were respected when we were idolaters and when we believed, we were humiliated.” He said: “I have been commanded to pardon, so do not fight.” Then, when Allah caused us to move to Al-Madinah, He commanded us to fight, but they refrained. Then Allah, the Mighty and Sublime, revealed: Have you not seen those who were told to hold back their hands (from fighting) and perform As-Salah”",
      "chain": [
        "38554",
        "30362",
        "20648",
        "11081",
        "11023",
        "17",
        "8"
      ]
    }
  ],
  "total_hadiths": 8
}