{
  "id": "38573",
  "name": "Muhammad bin Qdamh bin A'yn محمد بن قدامة بن أعين",
  "full_name": "Muhammad bin Qdamh bin A'yn محمد بن قدامة بن أعين",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "250",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Musaysa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ د  س  -  ثقة ]"
    ],
    "tags": [
      "B.Hashim",
      "Client",
      "al-Musaysi"
    ],
    "area_of_interest_display": [
      {
        "en": "Narrator[Grade:Thiqah] [ د  س  -  ثقة ]",
        "ar": "Narrator[Grade:Thiqah] [ د  س  -  ثقة ]",
        "ckb": "Narrator[Grade:Thiqah] [ د  س  -  ثقة ]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "Musaysa",
        "ar": "Musaysa",
        "ckb": "Musaysa"
      }
    ],
    "tags_display": [
      {
        "en": "Banu Hashim",
        "ar": "بنو هاشم",
        "ckb": "بەنی هاشم"
      },
      {
        "en": "Client (Mawla)",
        "ar": "مولى",
        "ckb": "مەولا"
      },
      {
        "en": "al-Musaysi",
        "ar": "al-Musaysi",
        "ckb": "al-Musaysi"
      }
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "id": "sunan-abi-daud-433",
      "hadith_no": "433",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن قدامة بن أعين، حدثنا جرير، عن منصور، عن هلال بن يساف، عن أبي المثنى، عن ابن أخت، عبادة بن الصامت عن عبادة بن الصامت، ح وحدثنا محمد بن سليمان الأنباري، حدثنا وكيع، عن سفيان، - المعنى - عن منصور، عن هلال بن يساف، عن أبي المثنى الحمصي، عن أبي أبى ابن امرأة، عبادة بن الصامت عن عبادة بن الصامت، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إنها ستكون عليكم بعدي أمراء تشغلهم أشياء عن الصلاة لوقتها حتى يذهب وقتها فصلوا الصلاة لوقتها ‏\"‏ ‏.‏ فقال رجل يا رسول الله أصلي معهم قال ‏\"‏ نعم إن شئت ‏\"‏ ‏.‏ وقال سفيان إن أدركتها معهم أأصلي معهم قال ‏\"‏ نعم إن شئت ‏\"‏ ‏.‏",
      "text_en": " Narrated Ubadah ibn as-Samit:                     After me you will come under rulers who will be detained from saying prayer at its proper time by (their) works until its time has run out, so offer prayer at its proper time. A man asked him: Messenger of Allah, may I offer prayer with them? He replied: Yes, if you wish (to do so). Sufyan (another narrator through a different chain)said: May I offer prayer with them if I get it with them? He said: Yes, if you wish to do so.",
      "usc_msa_ref": "",
      "chain": [
        "38573",
        "20028",
        "11067",
        "10835",
        "40",
        "31160",
        "20032",
        "11067",
        "10835"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-463",
      "hadith_no": "463",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن قدامة بن أعين، حدثنا إسماعيل، عن أيوب، عن نافع، قال قال عمر بن الخطاب - رضى الله عنه - فذكره بمعناه وهو أصح ‏.‏",
      "text_en": " This tradition has been reported by 'Umar b. al-Khattab through a different chain of narrators. He narrated it to the same effect and that is more correct.",
      "usc_msa_ref": "",
      "chain": [
        "38573",
        "30103",
        "11015",
        "11014",
        "3"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-757",
      "hadith_no": "757",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن قدامة، - يعني ابن أعين - عن أبي بدر، عن أبي طالوت عبد السلام، عن ابن جرير الضبي، عن أبيه، قال رأيت عليا - رضى الله عنه - يمسك شماله بيمينه على الرسغ فوق السرة ‏.‏ قال أبو داود وروي عن سعيد بن جبير فوق السرة ‏.‏ وقال أبو مجلز تحت السرة ‏.‏ وروي عن أبي هريرة وليس بالقوي ‏.‏",
      "text_en": " Jarir ad-Dabbi reported:                      I saw Ali (Allah be pleased with him) catching hold of his left hand) by his right hand on the wrist above the navel.Abu Dawud said: Sa'id b. Jubair narrated the words: \"above the navel\". Abu Mijlaz reported the words: \"below the navel\". This has also been narrated by Abu Hurairah. But that is not strong.",
      "usc_msa_ref": "",
      "chain": [
        "38573"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-950",
      "hadith_no": "950",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن قدامة بن أعين، حدثنا جرير، عن منصور، عن هلال، - يعني ابن يساف - عن أبي يحيى، عن عبد الله بن عمرو، قال حدثت أن رسول الله صلى الله عليه وسلم قال ‏\"‏ صلاة الرجل قاعدا نصف الصلاة ‏\"‏ ‏.‏ فأتيته فوجدته يصلي جالسا فوضعت يدى على رأسي فقال ما لك يا عبد الله بن عمرو قلت حدثت يا رسول الله أنك قلت ‏\"‏ صلاة الرجل قاعدا نصف الصلاة ‏\"‏ ‏.‏ وأنت تصلي قاعدا قال ‏\"‏ أجل ولكني لست كأحد منكم ‏\"‏ ‏.‏",
      "text_en": " ‘Abd Allah b. ‘Amr said :                      It has been narrated to me that the Messenger of Allah (ﷺ) said : The Prayer of a man in sitting condition is half the prayer (wins him half the reward of prayer). I came to him and found him prayer in sitting condition. I placed my hand on my head (in surprise). He said: what is the matter,’Abd Allah b. ‘Amr? I said; Messenger of Allah (ﷺ) you have been reported to me as saying : the prayer of a man in sitting condition is half the prayer , but you are praying in sitting condition. He said: yes, but I am not like one of you.",
      "usc_msa_ref": "",
      "chain": [
        "38573",
        "20028",
        "11067",
        "10835",
        "29"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-1502",
      "hadith_no": "1502",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا عبيد الله بن عمر بن ميسرة، ومحمد بن قدامة، - في آخرين - قالوا حدثنا عثام، عن الأعمش، عن عطاء بن السائب، عن أبيه، عن عبد الله بن عمرو، قال رأيت رسول الله صلى الله عليه وسلم - يعقد التسبيح قال ابن قدامة - بيمينه ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     I saw the Messenger of Allah (ﷺ) counting the glorification of Allah on fingers. Ibn Qudamah said (in his version: \"With his right hands\".",
      "usc_msa_ref": "",
      "chain": [
        "30024",
        "38573",
        "20343",
        "11060",
        "11068",
        "19867",
        "29"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-1560",
      "hadith_no": "1560",
      "source": "Sunan Abi Da'ud",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن قدامة بن أعين، حدثنا جرير، عن المغيرة، عن إبراهيم، قال الوسق ستون صاعا مختوما بالحجاجي ‏.‏",
      "text_en": " Ibrahim said The wasq contained sixty sa’s stamped with the stamp of Al Hajjaj.",
      "usc_msa_ref": "",
      "chain": [
        "38573",
        "20028",
        "166",
        "11051"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-1799",
      "hadith_no": "1799",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن قدامة بن أعين، وعثمان بن أبي شيبة، قالا حدثنا جرير بن عبد الحميد، عن منصور، عن أبي وائل، قال قال الصبى بن معبد كنت رجلا أعرابيا نصرانيا فأسلمت فأتيت رجلا من عشيرتي يقال له هذيم بن ثرملة فقلت له يا هناه إني حريص على الجهاد وإني وجدت الحج والعمرة مكتوبين على فكيف لي بأن أجمعهما قال اجمعهما واذبح ما استيسر من الهدى ‏.‏ فأهللت بهما معا فلما أتيت العذيب لقيني سلمان بن ربيعة وزيد بن صوحان وأنا أهل بهما جميعا فقال أحدهما للآخر ما هذا بأفقه من بعيره ‏.‏ قال فكأنما ألقي على جبل حتى أتيت عمر بن الخطاب فقلت له يا أمير المؤمنين إني كنت رجلا أعرابيا نصرانيا وإني أسلمت وأنا حريص على الجهاد وإني وجدت الحج والعمرة مكتوبين على فأتيت رجلا من قومي فقال لي اجمعهما واذبح ما استيسر من الهدى وإني أهللت بهما معا ‏.‏ فقال لي عمر رضى الله عنه هديت لسنة نبيك صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated As-Subayy ibn Ma'bad:                     I was a Christian Bedouin; then I embraced Islam. I came to a man of my tribe, who was called Hudhaym ibn Thurmulah. I said to him. O brother, I am eager to wage war in the cause of Allah (i.e. jihad), and I find that both hajj and umrah are due from me. How can I combine them?  He said: Combine them and sacrifice the animal made easily available for you. I, therefore, raised my voice in talbiyah for both of them (i.e. umrah and hajj). When I reached al-Udhayb, Salman ibn Rabi'ah and Zayd ibn Suhan met me while I was raising my voice in talbiyah for both of them.  One of them said to the other: This (man) does not have any more understanding than his camel. Thereupon it was as if a mountain fell on me.  I came to Umar ibn al-Khattab (may Allah be pleased with him) and said to him: Commander of the Faithful, I was a Christian Bedouin, and I have embraced Islam. I am eager to wage war in the cause of Allah (jihad), and I found that both hajj and umrah were due from me. I came to a man of my tribe who said to me: Combine both of them and sacrifice the animal easily available for you. I have raised my voice in talbiyah for both of them.  Umar thereupon said to me: You have been guided to the practice (sunnah) of your Prophet) (ﷺ).",
      "usc_msa_ref": "",
      "chain": [
        "38573",
        "30203",
        "20028",
        "11067",
        "11353"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-2085",
      "hadith_no": "2085",
      "source": "Sunan Abi Da'ud",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا محمد بن قدامة بن أعين، حدثنا أبو عبيدة الحداد، عن يونس، وإسرائيل، عن أبي إسحاق، عن أبي بردة، عن أبي موسى، أن النبي صلى الله عليه وسلم قال ‏\"‏ لا نكاح إلا بولي ‏\"‏ ‏.‏ قال أبو داود هو يونس عن أبي بردة وإسرائيل عن أبي إسحاق عن أبي بردة ‏.‏",
      "text_en": " Narrated Abu Musa:                     The Prophet (ﷺ) said: There is no marriage without the permission of a guardian.Abu Dawud said: The narrator Yunus also transmitted on the authority of Abu Burdah, and Isra'il narrated from Abu Ishaq on the authority of Abu Burdah.",
      "usc_msa_ref": "",
      "chain": [
        "38573",
        "20257",
        "20475",
        "20311",
        "11049",
        "11901",
        "41"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-5071",
      "hadith_no": "5071",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا وهب بن بقية، عن خالد، ح وحدثنا محمد بن قدامة بن أعين، حدثنا جرير، عن الحسن بن عبيد الله، عن إبراهيم بن سويد، عن عبد الرحمن بن يزيد، عن عبد الله، أن النبي صلى الله عليه وسلم كان يقول إذا أمسى ‏\"‏ أمسينا وأمسى الملك لله والحمد لله لا إله إلا الله وحده لا شريك له ‏\"‏ ‏.‏ زاد في حديث جرير وأما زبيد كان يقول كان إبراهيم بن سويد يقول ‏\"‏ لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شىء قدير رب أسألك خير ما في هذه الليلة وخير ما بعدها وأعوذ بك من شر ما في هذه الليلة وشر ما بعدها رب أعوذ بك من الكسل ومن سوء الكبر أو الكفر رب أعوذ بك من عذاب في النار وعذاب في القبر ‏\"‏ ‏.‏ وإذا أصبح قال ذلك أيضا ‏\"‏ أصبحنا وأصبح الملك لله ‏\"‏ ‏.‏ قال أبو داود رواه شعبة عن سلمة بن كهيل عن إبراهيم بن سويد قال ‏\"‏ من سوء الكبر ‏\"‏ ‏.‏ ولم يذكر سوء الكفر ‏.‏",
      "text_en": "  ‘Abd Allah (b. Mas’ud) told that when the evening came, the prophet (May peace be upon him) would say:                      we have come to the evening, and in the evening the dominion belongs to Allah: “Praise be to Allah; there is no god but Allah alone who has no partner”. The version of Jarir adds: Zubaid said that Ibrahim b. Suwaid said: There is no god but Allah alone who has no partner; to him belongs the dominion, to him praise is due, and He is omnipotent. O Allah! I ask thee for the good of what this night contains, and the good of what comes after it; and I seek refuge in Thee from the evil of what this night contains, and from the evil of what comes after it. My Lord! I seek refuge in Thee from indolence, the evil of old age or of disbelief. My Lord! I seek refuge in Thee from a punishment in Hell and a punishment in the grave. In the morning he said that also: we have come to the morning, and in the morning the dominion belongs to Allah.Abu Dawud said: Shu’bah transmitted from Salamah b. Kuhail, from Ibrahim b. Suwaid, saying: from the evil of old age. He did not mention the evil of disbelief.",
      "usc_msa_ref": "",
      "chain": [
        "30569",
        "20423",
        "38573",
        "20028",
        "10755",
        "10887",
        "20395",
        "18"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    }
  ],
  "total_hadiths": 9,
  "grade_display": {
    "en": "3rd Century AH [10th Generation]",
    "ar": "القرن الثالث الهجري [الجيل العاشر]",
    "ckb": "سەدەی سێیەمی كۆچی [نەوەی دەیەم]"
  }
}