{
  "id": "38613",
  "name": "Muhammad bin Hashim bin Sa'id محمد بن هاشم بن سعيد",
  "full_name": "Muhammad bin Hashim bin Sa'id محمد بن هاشم بن سعيد",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "254",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ س  -  صدوق ]"
    ],
    "tags": [
      "Quraish"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20733",
      "name": "al-Walid bin Muslim al-Quraishi الوليد بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20644",
      "name": "Baqiyya bin al-Walid bin Sa'aid بقية بن الوليد بن صائد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20732",
      "name": "Muhammad bin Shu'aib bin Shabur محمد بن شعيب بن شابور",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30006",
      "name": "Imam Nasa'i أحمد بن شعيب بن علي بن سنان النسائي",
      "grade": "3rd Century AH [12th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sunan-an-nasai-454",
      "hadith_no": "454",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Salah - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "أخبرنا محمد بن هاشم البعلبكي، قال أنبأنا الوليد، قال أخبرني أبو عمرو يعني الأوزاعي، أنه سأل الزهري عن صلاة، رسول الله صلى الله عليه وسلم بمكة قبل الهجرة إلى المدينة قال أخبرني عروة عن عائشة قالت فرض الله عز وجل الصلاة على رسوله صلى الله عليه وسلم أول ما فرضها ركعتين ركعتين ثم أتمت في الحضر أربعا وأقرت صلاة السفر على الفريضة الأولى ‏.‏",
      "text_en": " Abu 'Amr - meaning, Al-Awza'i - said that he asked Az-Zuhri about the prayer of the Messenger of Allah (ﷺ) in Makkah before the Hijrah to Al-Madinah. He said:                      \"Urwah told me that 'Aishah said: 'Allah enjoined the salah upon the Messenger of Allah (ﷺ), and the first thing that He enjoined was two Rak'ahs at a time, then it was made complete four Rak'ahs while in the state of residence but the prayer when traveling remained two Rak'ahs, as it was first enjoined.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38613",
        "20733",
        "20024",
        "11013"
      ]
    },
    {
      "id": "sunan-an-nasai-1190",
      "hadith_no": "1190",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا محمد بن هاشم البعلبكي، قال حدثنا محمد بن شعيب بن شابور، عن عمرو بن الحارث، قال أخبرني أبو الزبير، عن جابر، قال بعثني النبي صلى الله عليه وسلم فأتيته وهو يسير مشرقا أو مغربا فسلمت عليه فأشار بيده ثم سلمت عليه فأشار بيده فانصرفت فناداني ‏\"‏ يا جابر ‏\"‏ ‏.‏ فناداني الناس يا جابر ‏.‏ فأتيته فقلت يا رسول الله إني سلمت عليك فلم ترد على ‏.‏ فقال ‏\"‏ إني كنت أصلي ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Jabir said:                     \"The Messenger of Allah (ﷺ) sent me on an errand, then I came back to him while he was facing the east or the west. I greeted him with salam and he gestured to me. Then when he finished he called me and said: \"O Jabir!\" So I came and said: \"O Messenger of Allah, I greeted you with Salam but you did not answer.\" He said: 'I was praying.'",
      "usc_msa_ref": "",
      "chain": [
        "38613",
        "20732",
        "20377",
        "11263",
        "34"
      ]
    },
    {
      "id": "sunan-an-nasai-3742",
      "hadith_no": "3742",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of 'Umra - كتاب العمرى",
      "chapter_no": "34",
      "text_ar": "أخبرنا محمد بن هاشم البعلبكي، قال حدثنا الوليد، قال حدثنا الأوزاعي، عن الزهري، عن عروة، وأبي، سلمة عن جابر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ العمرى لمن أعمرها هي له ولعقبه يرثها من يرثه من عقبه ‏\"‏ ‏.‏",
      "text_en": " (A different chain) from Al-Awza'i, from Az-Zuhri, from 'Urwah and Abu Salamah, from Jabir, who said:                      \"The Messenger of Allah said: 'Umra (a lifelong gift) belongs to the one to whom it was given; it belongs to him and to his descendants, and is inherited by those who inherit from him.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38613",
        "20733",
        "20024",
        "11013",
        "10511",
        "10567",
        "34"
      ]
    }
  ],
  "total_hadiths": 3
}