{
  "id": "38636",
  "name": "Masraf bin 'Amr bin al-Sari مصرف بن عمرو بن السري",
  "full_name": "Masraf bin 'Amr bin al-Sari مصرف بن عمرو بن السري",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "240",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Hamadan"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ د  -  ثقة ]"
    ],
    "tags": [
      "al-Hamdani"
    ],
    "area_of_interest_display": [
      {
        "en": "Narrator[Grade:Thiqah] [ د  -  ثقة ]",
        "ar": "Narrator[Grade:Thiqah] [ د  -  ثقة ]",
        "ckb": "Narrator[Grade:Thiqah] [ د  -  ثقة ]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "Hamadan",
        "ar": "Hamadan",
        "ckb": "Hamadan"
      }
    ],
    "tags_display": [
      {
        "en": "al-Hamdani",
        "ar": "al-Hamdani",
        "ckb": "al-Hamdani"
      }
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20118",
      "name": "Yunus bin Bukayr al-Shaybani يونس بن بكير بن واصل الشيباني",
      "grade": "Succ. (Taba' Tabi') [9th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [9th Generation]",
        "ar": "تابع التابعين [الجيل التاسع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی نۆیەم]"
      }
    },
    {
      "id": "20102",
      "name": "'Abdullah bin Idris bin Yazid al-Audi عبد الله بن إدريس بن يزيد الأودي",
      "grade": "Succ. (Taba' Tabi') [8th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [8th Generation]",
        "ar": "تابع التابعين [الجيل الثامن]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی هەشتەم]"
      }
    },
    {
      "id": "20318",
      "name": "Hammad bin Usamah حماد بن أسامة - أبو أسامة",
      "grade": "Succ. (Taba' Tabi') [9th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [9th Generation]",
        "ar": "تابع التابعين [الجيل التاسع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی نۆیەم]"
      }
    }
  ],
  "students": [],
  "hadiths": [
    {
      "id": "sunan-abi-daud-1878",
      "hadith_no": "1878",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا مصرف بن عمرو اليامي، حدثنا يونس، - يعني ابن بكير - حدثنا ابن إسحاق، حدثني محمد بن جعفر بن الزبير، عن عبيد الله بن عبد الله بن أبي ثور، عن صفية بنت شيبة، قالت لما اطمأن رسول الله صلى الله عليه وسلم بمكة عام الفتح طاف على بعير يستلم الركن بمحجن في يده ‏.‏ قالت وأنا أنظر إليه ‏.‏",
      "text_en": " Narrated Safiyyah, daughter of Shaybah:                     When the Messenger of Allah (ﷺ) had some rest at Mecca in the year of its Conquest, he performed circumambulation on a camel and touched the corner (black Stone) with a crooked stick in his hand. She said: I was looking at him.",
      "usc_msa_ref": "",
      "chain": [
        "38636",
        "20118",
        "11107",
        "11215",
        "11200",
        "2802"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-3001",
      "hadith_no": "3001",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا مصرف بن عمرو الأيامي، حدثنا يونس، - يعني ابن بكير - قال حدثنا محمد بن إسحاق، حدثني محمد بن أبي محمد، مولى زيد بن ثابت عن سعيد بن جبير، وعكرمة، عن ابن عباس، قال لما أصاب رسول الله صلى الله عليه وسلم قريشا يوم بدر وقدم المدينة جمع اليهود في سوق بني قينقاع فقال ‏\"‏ يا معشر يهود أسلموا قبل أن يصيبكم مثل ما أصاب قريشا ‏\"‏ ‏.‏ قالوا يا محمد لا يغرنك من نفسك أنك قتلت نفرا من قريش كانوا أغمارا لا يعرفون القتال إنك لو قاتلتنا لعرفت أنا نحن الناس وأنك لم تلق مثلنا ‏.‏ فأنزل الله عز وجل في ذلك ‏{‏ قل للذين كفروا ستغلبون ‏}‏ قرأ مصرف إلى قوله ‏{‏ فئة تقاتل في سبيل الله ‏}‏ ببدر ‏{‏ وأخرى كافرة ‏}‏ ‏.‏",
      "text_en": " Ibn ‘Abbas said “When the Apostle of Allaah(ﷺ) had victory over Quraish in the batte of Badr and came to Madeenah he gathered the Jews in the market of Banu Qainuqa and said “O community of Jews embrace Islam before you suffer an injury as the Quraish suffered.” They said “Muhammad, you should not deceive yourself (taking pride) that you had killed a few persons of the Quariash who were inexperienced and did not know how to fight. Had you fought with us, you would have known us. You have never met people like us.” Allah Most High revealed about this the following verse “Say to those who reject faith, soon will ye be vanished... one army was fighting in the cause of Allaah, the other resisting Allaah.”",
      "usc_msa_ref": "",
      "chain": [
        "38636",
        "20118",
        "11107",
        "11050",
        "11023",
        "17"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-3002",
      "hadith_no": "3002",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا مصرف بن عمرو، حدثنا يونس، قال ابن إسحاق حدثني مولى، لزيد بن ثابت حدثتني ابنة محيصة، عن أبيها، محيصة أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من ظفرتم به من رجال يهود فاقتلوه ‏\"‏ ‏.‏ فوثب محيصة على شبيبة رجل من تجار يهود كان يلابسهم فقتله وكان حويصة إذ ذاك لم يسلم وكان أسن من محيصة فلما قتله جعل حويصة يضربه ويقول يا عدو الله أما والله لرب شحم في بطنك من ماله ‏.‏",
      "text_en": " Narrated Muhayyisah:                     The Messenger of Allah (ﷺ) said: If you gain a victory over the men of Jews, kill them. So Muhayyisah jumped over Shubaybah, a man of the Jewish merchants. He had close relations with them. He then killed him. At that time Huwayyisah (brother of Muhayyisah) had not embraced Islam. He was older than Muhayyisah. When he killed him, Huwayyisah beat him and said: O enemy of Allah, I swear by Allah, you have a good deal of fat in your belly from his property.",
      "usc_msa_ref": "",
      "chain": [
        "38636",
        "20475",
        "11107"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-3041",
      "hadith_no": "3041",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا مصرف بن عمرو اليامي، حدثنا يونس، - يعني ابن بكير - حدثنا أسباط بن نصر الهمداني، عن إسماعيل بن عبد الرحمن القرشي، عن ابن عباس، قال صالح رسول الله صلى الله عليه وسلم أهل نجران على ألفى حلة النصف في صفر والبقية في رجب يؤدونها إلى المسلمين وعارية ثلاثين درعا وثلاثين فرسا وثلاثين بعيرا وثلاثين من كل صنف من أصناف السلاح يغزون بها والمسلمون ضامنون لها حتى يردوها عليهم إن كان باليمن كيد أو غدرة على أن لا تهدم لهم بيعة ولا يخرج لهم قس ولا يفتنوا عن دينهم ما لم يحدثوا حدثا أو يأكلوا الربا ‏.‏ قال إسماعيل فقد أكلوا الربا ‏.‏ قال أبو داود إذا نقضوا بعض ما اشترط عليهم فقد أحدثوا ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Messenger of Allah (ﷺ) concluded peace with the people of Najran on condition that they would pay to Muslims two thousand suits of garments, half of Safar, and the rest in Rajab, and they would lend (Muslims) thirty coats of mail, thirty horses, thirty camels, and thirty weapons of each type used in battle. Muslims will stand surely for them until they return them in case there is any plot or treachery in the Yemen. No church of theirs will be demolished and no clergyman of theirs will be turned out. There will be no interruption in their religion until they bring something new or take usury. Isma'il said: They took usury.Abu Dawud said: If they violate any provision of the treaty, they will be deemed as bringing something new.",
      "usc_msa_ref": "",
      "chain": [
        "38636",
        "20118",
        "20643",
        "17"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    }
  ],
  "total_hadiths": 4,
  "grade_display": {
    "en": "3rd Century AH [10th Generation]",
    "ar": "القرن الثالث الهجري [الجيل العاشر]",
    "ckb": "سەدەی سێیەمی كۆچی [نەوەی دەیەم]"
  }
}