{
  "id": "38656",
  "name": "Musa bin 'Abdur Rahman موسى بن عبد الرحمن بن زياد الحلبي",
  "full_name": "Musa bin 'Abdur Rahman موسى بن عبد الرحمن بن زياد الحلبي",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Antioch"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ د  س  -  صدوق ]"
    ],
    "tags": [
      "al-Antaki"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20288",
      "name": "Ma'tmar bin Sulaiman-al-Taufayl معتمر بن سليمان - الطفيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20461",
      "name": "Mubashir bin Isma'i مبشر بن إسماعيل - أبو إسماعيل الكلبي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20354",
      "name": "Muhammad bin Khazim al-Darir محمد بن خازم أبو معاوية الضرير",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20644",
      "name": "Baqiyya bin al-Walid bin Sa'aid بقية بن الوليد بن صائد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "25191",
      "name": "'Ata'a bin Muslim al-Khafaf عطاء بن مسلم الخفاف",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20462",
      "name": "Mkhld bin Yazid al-Quraishi مخلد بن يزيد القرشي الحراني",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20672",
      "name": "Muhammad bin Salmah محمد بن سلمة بن عبد الله الباهلي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "30006",
      "name": "Imam Nasa'i أحمد بن شعيب بن علي بن سنان النسائي",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "36010",
      "name": "Ishaq bin Ibrahim bin Yonus إسحاق بن إبراهيم بن يونس",
      "grade": "3rd Century AH [12th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "336",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا موسى بن عبد الرحمن الأنطاكي، حدثنا محمد بن سلمة، عن الزبير بن خريق، عن عطاء، عن جابر، قال خرجنا في سفر فأصاب رجلا منا حجر فشجه في رأسه ثم احتلم فسأل أصحابه فقال هل تجدون لي رخصة في التيمم فقالوا ما نجد لك رخصة وأنت تقدر على الماء فاغتسل فمات فلما قدمنا على النبي صلى الله عليه وسلم أخبر بذلك فقال ‏\"‏ قتلوه قتلهم الله ألا سألوا إذ لم يعلموا فإنما شفاء العي السؤال إنما كان يكفيه أن يتيمم ويعصر ‏\"‏ ‏.‏ أو ‏\"‏ يعصب ‏\"‏ ‏.‏ شك موسى ‏\"‏ على جرحه خرقة ثم يمسح عليها ويغسل سائر جسده ‏\"‏ ‏.‏",
      "text_en": " Jabir said:                      We set out on a journey. One of our people was hurt by a stone, that injured his head. The then had a sexual dream. He asked his fellow travelers: Do you find a concession for me to perform tayammum? They said: We do not find any concession for you while you can use water. He took a bath and died. When we came to the Prophet (ﷺ), the incident was reported to him. He said: They killed him, may Allah kill them! Could they not ask when they did not know ? The fire of ignorance is inquiry. It was enough for him to perform tayammum and to our some drops of water or bind a bandage over the wound (the narrator Musa was doubtful); then he should have wiped over it and washed the rest of his body.",
      "chain": [
        "38656",
        "20672",
        "18295",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "2741",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا عبد الوهاب بن نجدة، حدثنا الوليد بن مسلم، ح وحدثنا موسى بن عبد الرحمن الأنطاكي، قال حدثنا مبشر، ح وحدثنا محمد بن عوف الطائي، أن الحكم بن نافع، حدثهم - المعنى، - كلهم عن شعيب بن أبي حمزة، عن نافع، عن ابن عمر، قال بعثنا رسول الله صلى الله عليه وسلم في جيش قبل نجد وانبعثت سرية من الجيش فكان سهمان الجيش اثنى عشر بعيرا اثنى عشر بعيرا ونفل أهل السرية بعيرا بعيرا فكانت سهمانهم ثلاثة عشر ثلاثة عشر ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     The Messenger of Allah (ﷺ) sent us along with an army towards Najd, and he sent a detachment of that army (to face the enemy). The whole army got twelve camels per head as their portion, but he gave the detachment one additional camel (apart from the division made to the army). Thus they got thirteen camels each (as a reward).",
      "chain": [
        "38363",
        "20733",
        "38656",
        "20461",
        "38566",
        "30330",
        "20428",
        "11014",
        "18"
      ]
    }
  ],
  "total_hadiths": 2
}