{
  "id": "38662",
  "name": "Nsr bin 'Asim al-Antaky نصر بن عاصم الأنطاكي",
  "full_name": "Nsr bin 'Asim al-Antaky نصر بن عاصم الأنطاكي",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Maqbool",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Antioch"
    ],
    "area_of_interest": [
      "Narrator[Grade:Maqbool] [ د  -  لين الحديث ]"
    ],
    "tags": [
      "al-Antaki"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20157",
      "name": "Abu Damra, Anas bin 'Ayyad أنس بن عياض الليثي - أبو ضمرة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20733",
      "name": "al-Walid bin Muslim al-Quraishi الوليد بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20031",
      "name": "Yahya bin Sa'id bin Farroukh al-Qatan يحيى بن سعيد بن فروخ القطان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20461",
      "name": "Mubashir bin Isma'i مبشر بن إسماعيل - أبو إسماعيل الكلبي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20732",
      "name": "Muhammad bin Shu'aib bin Shabur محمد بن شعيب بن شابور",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20463",
      "name": "Mskyn bin Bkyr al-Hrany مسكين بن بكير الحراني أبو عبد الرحمن",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "38383",
      "name": "'Uthman bin 'Abdullah عثمان بن عبد الله بن محمد بن خرزاذ",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sunan-abi-daud-337",
      "hadith_no": "337",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا نصر بن عاصم الأنطاكي، حدثنا محمد بن شعيب، أخبرني الأوزاعي، أنه بلغه عن عطاء بن أبي رباح، أنه سمع عبد الله بن عباس، قال أصاب رجلا جرح في عهد رسول الله صلى الله عليه وسلم ثم احتلم فأمر بالاغتسال فاغتسل فمات فبلغ رسول الله صلى الله عليه وسلم فقال ‏\"‏ قتلوه قتلهم الله ألم يكن شفاء العي السؤال ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     A man was injured during the lifetime of the Messenger of Allah (ﷺ); he then had a sexual dream, and he was advised to wash and he washed himself. Consequently he died. When this was reported to the Messenger of Allah (ﷺ) he said: They killed him; may Allah kill them! Is not inquiry the cure of ignorance?",
      "usc_msa_ref": "",
      "chain": [
        "38662",
        "20732",
        "20024",
        "11029",
        "17"
      ]
    },
    {
      "id": "sunan-abi-daud-1608",
      "hadith_no": "1608",
      "source": "Sunan Abi Da'ud",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا نصر بن عاصم الأنطاكي، حدثنا يحيى، - يعني القطان - عن عبد الحميد بن جعفر، حدثني صالح بن أبي عريب، عن كثير بن مرة، عن عوف بن مالك، قال دخل علينا رسول الله صلى الله عليه وسلم المسجد وبيده عصا وقد علق رجل منا قنا حشفا فطعن بالعصا في ذلك القنو وقال ‏\"‏ لو شاء رب هذه الصدقة تصدق بأطيب منها ‏\"‏ ‏.‏ وقال ‏\"‏ إن رب هذه الصدقة يأكل الحشف يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " Narrated Awf ibn Malik:                     The Messenger of Allah (ﷺ) entered upon us in the mosque, and he had a stick in his hand. A man hung there a bunch of hashaf. He struck the bunch with the stick, and said: If the owner of this sadaqah (alms) wishes to give a better one than it, he would give. The owner of this sadaqah will eat hashaf on the Day of Judgment.",
      "usc_msa_ref": "",
      "chain": [
        "38662",
        "20031",
        "11875",
        "18431",
        "19940",
        "10805"
      ]
    },
    {
      "id": "sunan-abi-daud-4436",
      "hadith_no": "4436",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا هشام بن عمار، حدثنا صدقة بن خالد، ح وحدثنا نصر بن عاصم الأنطاكي، حدثنا الوليد، جميعا قالا حدثنا محمد، - قال هشام محمد بن عبد الله الشعيثي - عن مسلمة بن عبد الله الجهني، عن خالد بن اللجلاج، عن أبيه، عن النبي صلى الله عليه وسلم ببعض هذا الحديث ‏.‏",
      "text_en": " A part of tradition has also been transmitted by al-Lajlaj from the Prophet (ﷺ) through a different chain of narrators.",
      "usc_msa_ref": "",
      "chain": [
        "30288",
        "20398",
        "38662",
        "20733",
        "11035",
        "17541",
        "18248",
        "6444"
      ]
    },
    {
      "id": "sunan-abi-daud-4484",
      "hadith_no": "4484",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا نصر بن عاصم الأنطاكي، حدثنا يزيد بن هارون الواسطي، حدثنا ابن أبي ذئب، عن الحارث بن عبد الرحمن، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا سكر فاجلدوه ثم إن سكر فاجلدوه ثم إن سكر فاجلدوه فإن عاد الرابعة فاقتلوه ‏\"‏ ‏.‏ قال أبو داود وكذا حديث عمر بن أبي سلمة عن أبيه عن أبي هريرة عن النبي صلى الله عليه وسلم ‏\"‏ إذا شرب الخمر فاجلدوه فإن عاد الرابعة فاقتلوه ‏\"‏ ‏.‏ قال أبو داود وكذا حديث سهيل عن أبي صالح عن أبي هريرة عن النبي صلى الله عليه وسلم ‏\"‏ إن شربوا الرابعة فاقتلوهم ‏\"‏ ‏.‏ وكذا حديث ابن أبي نعم عن ابن عمر عن النبي صلى الله عليه وسلم وكذا حديث عبد الله بن عمرو عن النبي صلى الله عليه وسلم والشريد عن النبي صلى الله عليه وسلم وفي حديث الجدلي عن معاوية أن النبي صلى الله عليه وسلم قال ‏\"‏ فإن عاد في الثالثة أو الرابعة فاقتلوه ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: If he is intoxicated, flog him; again if he is intoxicated, flog him; again if he is intoxicated, flog him if he does it again a fourth time, kill him. Abu Dawud said: And there is a similar tradition of Umar ibn AbuSalamah, from his father, on the authority of AbuHurayrah, from the Prophet (ﷺ): If he drinks wine, flog him if he does it so again, a fourth time, kill him.Abu Dawud said: And there is similar tradition of Suhail from Abu Salih on the authority of Abu Hurairah, from the Prophet (ﷺ): It they drink a fourth time, kill them. And there is similar tradition of Ibn Abi Nu'm on the authority of Ibn 'Umar from Prophet (ﷺ). There is also similar tradition of 'Abd Allah b. 'Amr from the Prophet (ﷺ), and from Sharid from the Prophet (ﷺ). And in the tradition of al-Jadli from Mu'awiyah, the Prophet (ﷺ) said: If he does so again third or fourth time, kill him.",
      "usc_msa_ref": "",
      "chain": [
        "38662",
        "20472",
        "20177",
        "19903",
        "10567",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-4586",
      "hadith_no": "4586",
      "source": "Sunan Abi Da'ud",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا نصر بن عاصم الأنطاكي، ومحمد بن الصباح بن سفيان، أن الوليد بن مسلم، أخبرهم عن ابن جريج، عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من تطبب ولا يعلم منه طب فهو ضامن ‏\"‏ ‏.‏ قال نصر قال حدثني ابن جريج ‏.‏ قال أبو داود هذا لم يروه إلا الوليد لا ندري هو صحيح أم لا ‏.‏",
      "text_en": " Narrated 'Amr b. Suh'aib:                     On his father's authority, said that his grandfather reported the Messenger of Allah (ﷺ) said: Anyone who practises medicine when he is not known as a practitioner will be held responsible.Abu Dawud said: This has been transmitted by al-Walid alone. We do not know whether it is sound or not.",
      "usc_msa_ref": "",
      "chain": [
        "38662",
        "30269",
        "20733",
        "11070",
        "19934",
        "19911"
      ]
    },
    {
      "id": "sunan-abi-daud-4765",
      "hadith_no": "4765",
      "source": "Sunan Abi Da'ud",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا نصر بن عاصم الأنطاكي، حدثنا الوليد، ومبشر، - يعني ابن إسماعيل الحلبي عن أبي عمرو، قال - يعني الوليد - حدثنا أبو عمرو، قال حدثني قتادة، عن أبي سعيد الخدري، وأنس بن مالك، عن رسول الله صلى الله عليه وسلم قال ‏:‏ ‏\"‏ سيكون في أمتي اختلاف وفرقة، قوم يحسنون القيل ويسيئون الفعل ويقرءون القرآن لا يجاوز تراقيهم، يمرقون من الدين مروق السهم من الرمية لا يرجعون حتى يرتد على فوقه هم شر الخلق والخليقة طوبى لمن قتلهم وقتلوه، يدعون إلى كتاب الله وليسوا منه في شىء، من قاتلهم كان أولى بالله منهم ‏\"‏ ‏.‏ قالوا ‏:‏ يا رسول الله ما سيماهم قال ‏:‏ ‏\"‏ التحليق ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuSa'id al-Khudri ; Anas ibn Malik:                     The Prophet (ﷺ) said: Soon there will appear disagreement and dissension in my people; there will be people who will be good in speech and bad in work. They recite the Qur'an, but it does not pass their collar-bones. They will swerve from the religion as an animal goes through the animal shot at. They will not return to it till the arrow comes back to its notch. They are worst of the people and animals. Happy is the one who kills them and they kill him. They call to the book of Allah, but they have nothing to do with it. He who fights against them will be nearer to Allah than them (the rest of the people). The people asked: What is their sign? He replied: They shave the head.",
      "usc_msa_ref": "",
      "chain": [
        "38662",
        "20733",
        "20461",
        "20733",
        "20024",
        "11019",
        "38",
        "19"
      ]
    },
    {
      "id": "sunan-abi-daud-5089",
      "hadith_no": "5089",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا نصر بن عاصم الأنطاكي، حدثنا أنس بن عياض، قال حدثني أبو مودود، عن محمد بن كعب، عن أبان بن عثمان، عن عثمان، عن النبي صلى الله عليه وسلم نحوه لم يذكر قصة الفالج ‏.‏",
      "text_en": " A similar tradition has been transmitted by Aban b. ‘Uthman, from ‘Uthman, from the prophet (May peace be upon him). This version does not mention the story of paralysis.",
      "usc_msa_ref": "",
      "chain": [
        "38662",
        "20157",
        "11221",
        "10582",
        "4"
      ]
    }
  ],
  "total_hadiths": 7
}