{
  "id": "38667",
  "name": "Nasayr bin al-Farj نصير بن الفرج",
  "full_name": "Nasayr bin al-Farj نصير بن الفرج",
  "grade": "3rd Century AH [11th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "245",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Syria"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ د  س  -  ثقة ]"
    ],
    "tags": [
      "al-Aslami",
      "al-Thughri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20381",
      "name": "Hajjaj bin Muhammad al-Musaysi حجاج بن محمد المصيصي الأعور",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20318",
      "name": "Hammad bin Usamah حماد بن أسامة - أبو أسامة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20315",
      "name": "al-Husain bin 'Ali bin al-Walid al-Ja'fi الحسين بن علي بن الوليد الجعفي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20287",
      "name": "Mua'dh bin Hisham bin Aby معاذ بن هشام بن أبي عبد الله",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "27028",
      "name": "'Umara bin Bashr al-Shami عمارة بن بشر الشامي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20255",
      "name": "'Abdul Malik bin al-Sbah al-Msm'y عبد الملك بن الصباح المسمعي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "23033",
      "name": "'Abdullah bin Yazid al-'Advi عبد الله بن يزيد العدوي المقري القصير",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "30006",
      "name": "Imam Nasa'i أحمد بن شعيب بن علي بن سنان النسائي",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30554",
      "name": "Abu Zara' al-Razi أبو زرعة الرازي",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "4023",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا نصير بن الفرج، حدثنا عبد الله بن يزيد، حدثنا سعيد، - يعني ابن أبي أيوب - عن أبي مرحوم، عن سهل بن معاذ بن أنس، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من أكل طعاما ثم قال الحمد لله الذي أطعمني هذا الطعام ورزقنيه من غير حول مني ولا قوة غفر له ما تقدم من ذنبه وما تأخر ومن لبس ثوبا فقال الحمد لله الذي كساني هذا الثوب ورزقنيه من غير حول مني ولا قوة غفر له ما تقدم من ذنبه وما تأخر ‏\"‏ ‏.‏",
      "text_en": " Narrated Mu'adh ibn Anas:                     The Prophet (ﷺ) said: If anyone eats food and then says: \"Praise be to Allah Who has fed me with this food and provided me with it through no might and power on my part,\" he will be forgiven his former and later sins. If anyone puts on a garment and says: \"Praise be to Allah Who has clothed me with this and provided me with it through no might and power on my part,\" he will be forgiven his former and later sins.",
      "chain": [
        "38667",
        "1945",
        "20375",
        "19814",
        "16045"
      ]
    },
    {
      "hadith_no": "4218",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Signet-Rings (Kitab Al-Khatam) - كتاب الخاتم",
      "chapter_no": "36",
      "text_ar": "حدثنا نصير بن الفرج، حدثنا أبو أسامة، عن عبيد الله، عن نافع، عن ابن عمر، قال اتخذ رسول الله صلى الله عليه وسلم خاتما من ذهب وجعل فصه مما يلي بطن كفه ونقش فيه ‏\"‏ محمد رسول الله ‏\"‏ ‏.‏ فاتخذ الناس خواتم الذهب فلما رآهم قد اتخذوها رمى به وقال ‏\"‏ لا ألبسه أبدا ‏\"‏ ‏.‏ ثم اتخذ خاتما من فضة نقش فيه ‏\"‏ محمد رسول الله ‏\"‏ ‏.‏ ثم لبس الخاتم بعده أبو بكر ثم لبسه بعد أبي بكر عمر ثم لبسه بعده عثمان حتى وقع في بئر أريس ‏.‏ قال أبو داود ولم يختلف الناس على عثمان حتى سقط الخاتم من يده ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     The Messenger of Allah (ﷺ) took a signet-ring of gold, and put the stone next the palm of his hand. He engraved on it \"Muhammad, the Messenger of Allah\". The people then took signet-rings of gold. When he saw that they had taken them (like his ring) he threw it away and said: I shall never wear it. He then fashioned a silver ring and engraved on it \"Muhammad, the Messenger of Allah\". Then Abu Bakr wore it after him, then 'Umar wore it after Abu Bakr, and the 'Uthman wore it after 'Umar till it fell down in a well called Aris.Abu Dawud said: The people did not disagree on 'Uthman till the signet-rin fell down from his hand.",
      "chain": [
        "38667",
        "20318",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "170",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا محمد بن عبد الله بن المبارك، ونصير بن الفرج، - واللفظ له - قالا حدثنا أبو أسامة، عن عبيد الله بن عمر، عن محمد بن يحيى بن حبان، عن الأعرج، عن أبي هريرة، عن عائشة، - رضى الله عنها - قالت فقدت النبي صلى الله عليه وسلم ذات ليلة فجعلت أطلبه بيدي فوقعت يدي على قدميه وهما منصوبتان وهو ساجد يقول ‏\"‏ أعوذ برضاك من سخطك وبمعافاتك من عقوبتك وأعوذ بك منك لا أحصي ثناء عليك أنت كما أثنيت على نفسك ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that 'Aishah said:                      \"I noticed the Prophet (ﷺ) was not there one night, so I started looking for him with my hand. My hand touched his feet and they were held upright, and he was prostrating and saying: 'I seek refuge in Your pleasure from Your anger, in Your forgiveness from Your punishment, and I seek refuge in You from You. I cannot praise You enough, You are as You have praised yourself.'\"",
      "chain": [
        "38667",
        "20318",
        "11201",
        "11222",
        "11197",
        "13",
        "53"
      ]
    },
    {
      "hadith_no": "3384",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا نصير بن الفرج، قال حدثنا أبو أسامة، عن زائدة، قال حدثنا عطاء بن السائب، عن أبيه، عن علي، رضى الله عنه قال جهز رسول الله صلى الله عليه وسلم فاطمة في خميل وقربة ووسادة حشوها إذخر ‏.‏",
      "text_en": " It was narrated that 'Ali, may Allah be pleased with him, said:                      \"The Messenger of Allah fitted out Fatimah with a velvet dress, a water-skin and a pillow stuffed with Idhkhar.\"",
      "chain": [
        "38667",
        "20318",
        "20320",
        "11068",
        "19867",
        "5"
      ]
    },
    {
      "hadith_no": "5156",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا نصير بن الفرج، قال حدثنا عمارة بن بشر، عن الأوزاعي، عن يحيى بن أبي كثير، قال حدثني أبو إسحاق، قال حدثني حمان، قال حج معاوية فدعا نفرا من الأنصار في الكعبة فقال أنشدكم بالله ألم تسمعوا رسول الله صلى الله عليه وسلم نهى عن الذهب قالوا اللهم نعم ‏.‏ قال وأنا أشهد ‏.‏",
      "text_en": " Himman said:                     XMu'awiyah went on Hajj and he called a group of Ansar to the Ka'bah. He said: 'I adjure you by Allah, did you hear the Messenger of Allah [SAW] forbid gold?' They said: 'Yes.' He said: 'And I bear witness to that.'\"",
      "chain": [
        "38667",
        "27028",
        "20024",
        "11449",
        "11049"
      ]
    }
  ],
  "total_hadiths": 5
}