{
  "id": "38673",
  "name": "Harun bin Zayd bin Abi al-Zarqa' هارون بن زيد بن أبي الزرقاء التغلبي",
  "full_name": "Harun bin Zayd bin Abi al-Zarqa' هارون بن زيد بن أبي الزرقاء التغلبي",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "250",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Musal",
      "al-Ramla"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ د  س  -  صدوق ]"
    ],
    "tags": [
      "al-Taghlabi",
      "al-Tha'labi",
      "al-Musali",
      "al-Ramla"
    ]
  },
  "parents": [
    {
      "id": "28194",
      "name": "Zayd bin Abi al-Zrqa'a زيد بن أبي الزرقاء يزيد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "28194",
      "name": "Zayd bin Abi al-Zrqa'a زيد بن أبي الزرقاء يزيد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20738",
      "name": "Dmrh bin Rabi'ya al-Flstyny ضمرة بن ربيعة الفلسطيني أبو عبد الله",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20615",
      "name": "Yahya bin 'Isa يحيى بن عيسى",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "30006",
      "name": "Imam Nasa'i أحمد بن شعيب بن علي بن سنان النسائي",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "31170",
      "name": "Muhammad bin Sulaiman al-Baghandi محمد بن سليمان بن الحارث الباغندي",
      "grade": "3rd Century AH"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "553",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا هارون بن زيد بن أبي الزرقاء، حدثنا أبي، حدثنا سفيان، عن عبد الرحمن بن عابس، عن عبد الرحمن بن أبي ليلى، عن ابن أم مكتوم، قال يا رسول الله إن المدينة كثيرة الهوام والسباع ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ أتسمع حى على الصلاة حى على الفلاح فحى هلا ‏\"‏ ‏.‏ قال أبو داود وكذا رواه القاسم الجرمي عن سفيان ليس في حديثه ‏\"‏ حى هلا ‏\"‏ ‏.‏",
      "text_en": " Narrated Ibn Umm Maktum:                     Messenger of Allah, there are many venomous creatures and wild beasts in Medina (so allow me to pray in my house because I am blind). The Prophet (ﷺ) said: Do you hear the call, \"Come to prayer,\" \"Come to salvation\"? (He said: Yes.) Then you must come.Abu Dawud said: Al-Qasim al-Jarmi has narrated this tradition from Sufyan in a similar manner. But his version does not contain the words \"Then you must come.\"",
      "chain": [
        "38673",
        "20005",
        "11638",
        "11196"
      ]
    },
    {
      "hadith_no": "994",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا هارون بن زيد بن أبي الزرقاء، حدثنا أبي ح، وحدثنا محمد بن سلمة، حدثنا ابن وهب، - وهذا لفظه - جميعا عن هشام بن سعد، عن نافع، عن ابن عمر، أنه رأى رجلا يتكئ على يده اليسرى وهو قاعد في الصلاة - وقال هارون بن زيد ساقطا على شقه الأيسر ثم اتفقا - فقال له لا تجلس هكذا فإن هكذا يجلس الذين يعذبون ‏.‏",
      "text_en": " Nafi said:                      Ibn ‘Umar saw a man resting on his left hand while he was sitting during prayer. The version of Harun b. Zaid goes: He was lying on his left side. the agreed version goes: he said to him: Do not sit like this, because those who are punished sit like this.",
      "chain": [
        "38673",
        "20672",
        "20029",
        "20519",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1578",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا هارون بن زيد بن أبي الزرقاء، حدثنا أبي، عن سفيان، عن الأعمش، عن أبي وائل، عن مسروق، عن معاذ بن جبل، قال بعثه النبي صلى الله عليه وسلم إلى اليمن فذكر مثله لم يذكر ثيابا تكون باليمن ‏.‏ ولا ذكر يعني محتلما ‏.‏ قال أبو داود ورواه جرير ويعلى ومعمر وشعبة وأبو عوانة ويحيى بن سعيد عن الأعمش عن أبي وائل عن مسروق - قال يعلى ومعمر - عن معاذ مثله ‏.‏",
      "text_en": " Narrated Mu’adh bin Jabal :                     that the Prophet (ﷺ) sent him to Yemen. He then narrated the tradition something similar. He did not mention in this version cloths made in the Yemen nor did he refer to adult (unbelievers).Abu Dawud said This tradition has been transmitted by Jarir, Ya’la, Ma’mar, Abu ‘Awanahand Yahya bin Sa’id from Al A’mash, from Abu Wa’il, on the authority of Masruq, and from Ya’la and Ma’mar on the authority of Mu’adh to the same effect.",
      "chain": [
        "38673",
        "20005",
        "11060",
        "11353",
        "11018",
        "32"
      ]
    },
    {
      "hadith_no": "2113",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا هارون بن زيد بن أبي الزرقاء، حدثنا أبي، حدثنا محمد بن راشد، عن مكحول، نحو خبر سهل قال وكان مكحول يقول ليس ذلك لأحد بعد رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Makhul has also transmitted a tradition like the one narrated by Sahl (b. Sa'd al-Sa'idi). Makhul used to say:                      This is not lawful for anyone after the Messenger of Allah (ﷺ).",
      "chain": [
        "38673",
        "20719",
        "11066"
      ]
    },
    {
      "hadith_no": "2951",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا هارون بن زيد بن أبي الزرقاء، حدثنا أبي، حدثنا هشام بن سعد، عن زيد بن أسلم، أن عبد الله بن عمر، دخل على معاوية فقال حاجتك يا أبا عبد الرحمن فقال عطاء المحررين فإني رأيت رسول الله صلى الله عليه وسلم أول ما جاءه شىء بدأ بالمحررين ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     Zayd ibn Aslam said: Abdullah ibn Umar entered upon Mu'awiyah. He asked: (Tell me) your need, AbuAbdurRahman. He replied: Give (the spoils) to those who were set free, for I saw the first thing the Messenger of Allah (ﷺ) did when anything came to him was to give something to those who had been set free.",
      "chain": [
        "38673",
        "20519",
        "11163"
      ]
    },
    {
      "hadith_no": "3006",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا هارون بن زيد بن أبي الزرقاء، حدثنا أبي، حدثنا حماد بن سلمة، عن عبيد الله بن عمر، قال - أحسبه - عن نافع، عن ابن عمر، أن النبي صلى الله عليه وسلم قاتل أهل خيبر فغلب على النخل والأرض وألجأهم إلى قصرهم فصالحوه على أن لرسول الله صلى الله عليه وسلم الصفراء والبيضاء والحلقة ولهم ما حملت ركابهم على أن لا يكتموا ولا يغيبوا شيئا فإن فعلوا فلا ذمة لهم ولا عهد فغيبوا مسكا لحيى بن أخطب وقد كان قتل قبل خيبر كان احتمله معه يوم بني النضير حين أجليت النضير فيه حليهم قال فقال النبي صلى الله عليه وسلم لسعية ‏\"‏ أين مسك حيى بن أخطب ‏\"‏ ‏.‏ قال أذهبته الحروب والنفقات ‏.‏ فوجدوا المسك فقتل ابن أبي الحقيق وسبى نساءهم وذراريهم وأراد أن يجليهم فقالوا يا محمد دعنا نعمل في هذه الأرض ولنا الشطر ما بدا لك ولكم الشطر ‏.‏ وكان رسول الله صلى الله عليه وسلم يعطي كل امرأة من نسائه ثمانين وسقا من تمر وعشرين وسقا من شعير ‏.‏",
      "text_en": " Narrated Abdullah Ibn Umar:                     The Prophet fought with the people of Khaybar, and captured their palm-trees and land, and forced them to remain confined to their fortresses. So they concluded a treaty of peace providing that gold, silver and weapons would go to the Messenger of Allah (ﷺ), and whatever they took away on their camels would belong to them, on condition that they would not hide and carry away anything. If they did (so), there would be no protection for them and no treaty (with Muslims).  They carried away a purse of Huyayy ibn Akhtab who was killed before (the battle of) Khaybar. He took away the ornaments of Banu an-Nadir when they were expelled.  The Prophet (ﷺ) asked Sa'yah: Where is the purse of Huyayy ibn Akhtab?  He replied: The contents of this purse were spent on battles and other expenses. (Later on) they found the purse. So he killed Ibn AbulHuqayq, captured their women and children, and intended to deport them.  They said: Muhammad, leave us to work on this land; we shall have half (of the produce) as you wish, and you will have half. The Messenger of Allah (ﷺ) used to make a contribution of eighty wasqs of dates and twenty wasqs of wheat to each of his wives.",
      "chain": [
        "38673",
        "20021",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3754",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا هارون بن زيد بن أبي الزرقاء، حدثنا أبي، حدثنا جرير بن حازم، عن الزبير بن خريت، قال سمعت عكرمة، يقول كان ابن عباس يقول إن النبي صلى الله عليه وسلم نهى عن طعام المتباريين أن يؤكل ‏.‏ قال أبو داود أكثر من رواه عن جرير لا يذكر فيه ابن عباس وهارون النحوي ذكر فيه ابن عباس أيضا وحماد بن زيد لم يذكر ابن عباس ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Prophet (ﷺ) forbade that the food of two people who were rivalling on another should be eatenAbu Dawud said: Most of those who narrated it from Jarir did not mention the name of Ibn Abbas. Harun al-Nahwi mentioned Ibn 'Abbas in it, and Hammad bin Zaid did not mention Ibn 'Abbas.",
      "chain": [
        "38673",
        "11272",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "3775",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا هارون بن زيد بن أبي الزرقاء، حدثنا أبي، حدثنا جعفر، أنه بلغه عن الزهري، بهذا الحديث ‏.‏",
      "text_en": " The tradition mentioned above has been transmitted by al-Zuhri from a different chain of narrators.",
      "chain": [
        "38673",
        "11407",
        "11013"
      ]
    },
    {
      "hadith_no": "4541",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا مسلم بن إبراهيم، قال حدثنا محمد بن راشد، ح وحدثنا هارون بن زيد بن أبي الزرقاء، حدثنا أبي، حدثنا محمد بن راشد، عن سليمان بن موسى، عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم قضى أن من قتل خطأ فديته مائة من الإبل ثلاثون بنت مخاض وثلاثون بنت لبون وثلاثون حقة وعشرة بني لبون ذكر ‏.‏",
      "text_en": " Narrated 'Amr b. Suh'aib:                     On his father's authority, said that his grandfather reported the  Messenger of Allah (ﷺ) gave judgment that if anyone is killed accidentally, his blood-wit should be one hundred camels: thirty she-camels which had entered their second year, thirty she-camels which had entered their third year, thirty she-camels which had entered their fourth year, and ten male camels which had entered their third year.",
      "chain": [
        "20285",
        "20719",
        "38673",
        "20719",
        "10880",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "4834",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا هارون بن زيد بن أبي الزرقاء، حدثنا أبي، حدثنا جعفر، - يعني ابن برقان - عن يزيد، - يعني ابن الأصم - عن أبي هريرة، يرفعه قال ‏\"‏ الأرواح جنود مجندة فما تعارف منها ائتلف وما تناكر منها اختلف ‏\"‏ ‏.‏",
      "text_en": " ABU HURAIRAH REPORTED THE PROPHET(MAY PEACE BE UPON HIM) AS SAYING:                      THE SPIRITS ARE IN MARSHALLED HOSTS; THOSE WHO KNOW ONE ANOTHER WILL BE FRIENDLY, AND THOSE WHO DO NOT, WILL KEEP APART.",
      "chain": [
        "38673",
        "20646",
        "10842"
      ]
    },
    {
      "hadith_no": "4907",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا هارون بن زيد بن أبي الزرقاء، حدثنا أبي، حدثنا هشام بن سعد، عن أبي حازم، وزيد بن أسلم، أن أم الدرداء، قالت سمعت أبا الدرداء، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يكون اللعانون شفعاء ولا شهداء ‏\"‏ ‏.‏",
      "text_en": " Abu al-Darda’ said :                      I heard the Messenger of Allah (May peace be upon him) say: Men given to cursing will not be witnesses or intercessors.",
      "chain": [
        "38673",
        "20519",
        "11172",
        "11163",
        "11457"
      ]
    },
    {
      "hadith_no": "4963",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا هارون بن زيد بن أبي الزرقاء، حدثنا أبي، حدثنا هشام بن سعد، عن زيد بن أسلم، عن أبيه، أن عمر بن الخطاب، رضى الله عنه ضرب ابنا له تكنى أبا عيسى وأن المغيرة بن شعبة تكنى بأبي عيسى فقال له عمر أما يكفيك أن تكنى بأبي عبد الله فقال إن رسول الله صلى الله عليه وسلم كناني فقال إن رسول الله صلى الله عليه وسلم قد غفر له ما تقدم من ذنبه وما تأخر وإنا في جلجلتنا فلم يزل يكنى بأبي عبد الله حتى هلك ‏.‏",
      "text_en": " Narrated Umar ibn al-Khattab:                     Zayd ibn Aslam quoted his father as saying: Umar ibn al-Khattab (Allah be pleased with him) struck one of his sons who was given the kunyah AbuIsa, and al-Mughirah ibn Shu'bah had the kunyah AbuIsa. Umar said to him: Is it not sufficient for you that you are called by the kunyah AbuAbdullah? He replied: The Messenger of Allah (ﷺ) gave me this kunyah. Thereupon he said: The Messenger of Allah (ﷺ) was forgiven all his sins, past and those followed. But we are among the people similar to us. Henceforth he was called by the kunyah AbuAbdullah until he died.",
      "chain": [
        "38673",
        "20519",
        "11163",
        "11416",
        "3"
      ]
    },
    {
      "hadith_no": "4987",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا هارون بن زيد بن أبي الزرقاء، حدثنا أبي، حدثنا هشام بن سعد، عن زيد بن أسلم، عن عائشة، رضى الله عنها، قالت ما سمعت رسول الله صلى الله عليه وسلم ينسب أحدا إلا إلى الدين ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     I never heard the Messenger of Allah (ﷺ) attributing anyone to anything except to religion.",
      "chain": [
        "38673",
        "20519",
        "11163",
        "53"
      ]
    },
    {
      "hadith_no": "851",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا هارون بن زيد بن أبي الزرقاء، قال حدثنا أبي قال، حدثنا سفيان، ح وأخبرني عبد الله بن محمد بن إسحاق، قال حدثنا قاسم بن يزيد، قال حدثنا سفيان، عن عبد الرحمن بن عابس، عن عبد الرحمن بن أبي ليلى، عن ابن أم مكتوم، أنه قال يا رسول الله إن المدينة كثيرة الهوام والسباع ‏.‏ قال ‏\"‏ هل تسمع حى على الصلاة حى على الفلاح ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ فحى هلا ‏\"‏ ‏.‏ ولم يرخص له ‏.‏",
      "text_en": " It was narrated from Ibn Umm Maktum that he said:                      \"0 Messenger of Allah (ﷺ), there are many (dangerous) pests and wild animals in Al-Madinah.\" He said: \"Can you hear (the words) 'Come prayer, come to prosperity'?\" He said \"Yes.\" He said: \"Then be quick to respond,\" and he did not grant him a dispensation.",
      "chain": [
        "38673",
        "20005",
        "20005",
        "11638",
        "11196"
      ]
    },
    {
      "hadith_no": "2088",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا هارون بن زيد، - وهو ابن أبي الزرقاء - قال حدثنا أبي قال، حدثنا خالد بن ميسرة، قال سمعت معاوية بن قرة، عن أبيه، قال كان نبي الله صلى الله عليه وسلم إذا جلس يجلس إليه نفر من أصحابه وفيهم رجل له ابن صغير يأتيه من خلف ظهره فيقعده بين يديه فهلك فامتنع الرجل أن يحضر الحلقة لذكر ابنه فحزن عليه ففقده النبي صلى الله عليه وسلم فقال ‏\"‏ ما لي لا أرى فلانا ‏\"‏ ‏.‏ قالوا يا رسول الله بنيه الذي رأيته هلك ‏.‏ فلقيه النبي صلى الله عليه وسلم فسأله عن بنيه فأخبره أنه هلك فعزاه عليه ثم قال ‏\"‏ يا فلان أيما كان أحب إليك أن تمتع به عمرك أو لا تأتي غدا إلى باب من أبواب الجنة إلا وجدته قد سبقك إليه يفتحه لك ‏\"‏ ‏.‏ قال يا نبي الله بل يسبقني إلى باب الجنة فيفتحها لي لهو أحب إلى ‏.‏ قال ‏\"‏ فذاك لك ‏\"‏ ‏.‏",
      "text_en": " Mu 'awiyah bin Qurrah narrated that his father said:                     \"When the Prophet of Allah sat, some of his  Companions would sit with him. Among them was a man who had a little son who used to come to him from behind, and he would make him sit in front of him. He (the child) died, and the man stopped attending the circle because it reminded him of his son, and made him feel sad. The Prophet missed him and said: 'Why do I not see so-and-so?' They said: O Messenger of Allah, his son whom you saw has died.' The Prophet met him and asked him about his son, and he told him that he had died. He offered his condolences and said: 'O son-and-so, which would you like better, to enjoy his company all you life, or to come to any of the gates of Paradise on the Day of Resurrection, and find that he arrived there before you, and he is opening the gate for you?' he said: 'O Prophet of Allah! For him to get to the gate of Paradise before me and open it for me is dearer to me.' He said: 'You will have that.\"'",
      "chain": [
        "38673",
        "24112",
        "11306",
        "5238"
      ]
    },
    {
      "hadith_no": "4516",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا هارون بن زيد بن أبي الزرقاء، قال حدثنا أبي قال، حدثنا جعفر بن برقان، قال بلغني عن الزهري، عن سالم، عن أبيه، قال نهى رسول الله صلى الله عليه وسلم عن لبستين ونهانا رسول الله صلى الله عليه وسلم عن بيعتين عن المنابذة والملامسة وهي بيوع كانوا يتبايعون بها في الجاهلية ‏.‏",
      "text_en": " It was narrated from Salim that his father said:                     \"The Messenger of Allah forbade two kinds of garments, and he forbade two kinds of transactions for us: Munabadhah and Mulamasah, which are kinds of transactions which were common during the Jahiliyyah.\"",
      "chain": [
        "38673",
        "20646",
        "11013",
        "11011",
        "18"
      ]
    }
  ],
  "total_hadiths": 16
}