{
  "id": "38684",
  "name": "Hilal bin al-'Ala' bin Hilal bin 'Umar هلال بن العلاء بن هلال بن عمر",
  "full_name": "Hilal bin al-'Ala' bin Hilal bin 'Umar هلال بن العلاء بن هلال بن عمر",
  "grade": "3rd Century AH [11th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "280",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "al-Raqqa",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Raqqa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ س  -  صدوق ]"
    ],
    "tags": [
      "Client",
      "al-Bahali",
      "al-Raqqi"
    ]
  },
  "parents": [
    {
      "id": "28464",
      "name": "al-'Ala' bin Hilal bin 'Umar bin Hilal العلاء بن هلال بن عمر بن هلال",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "28464",
      "name": "al-'Ala' bin Hilal bin 'Umar bin Hilal العلاء بن هلال بن عمر بن هلال",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "1199",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا هلال بن العلاء بن هلال، قال حدثنا المعافى بن سليمان، قال حدثنا القاسم، - وهو ابن معن - عن الأعمش، عن عمارة، عن أبي عطية، قال قالت عائشة إن الالتفات في الصلاة اختلاس يختلسه الشيطان من الصلاة ‏.‏",
      "text_en": " It was narrated that Abu 'Atiyyah said:                     \"Aishah said: 'Turning around during prayer is something that the Shaitan snatches from one's prayer.'\"",
      "chain": [
        "38684",
        "25240",
        "11060",
        "11379",
        "53"
      ]
    },
    {
      "hadith_no": "1484",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "أخبرنا هلال بن العلاء بن هلال، قال حدثنا الحسين بن عياش، قال حدثنا زهير، قال حدثنا الأسود بن قيس، قال حدثني ثعلبة بن عباد العبدي، من أهل البصرة أنه شهد خطبة يوما لسمرة بن جندب فذكر في خطبته حديثا عن رسول الله صلى الله عليه وسلم قال سمرة بن جندب بينا أنا يوما وغلام من الأنصار نرمي غرضين لنا على عهد رسول الله صلى الله عليه وسلم حتى إذا كانت الشمس قيد رمحين أو ثلاثة في عين الناظر من الأفق اسودت فقال أحدنا لصاحبه انطلق بنا إلى المسجد فوالله ليحدثن شأن هذه الشمس لرسول الله صلى الله عليه وسلم في أمته حدثا - قال - فدفعنا إلى المسجد - قال - فوافينا رسول الله صلى الله عليه وسلم حين خرج إلى الناس - قال - فاستقدم فصلى فقام كأطول قيام قام بنا في صلاة قط ما نسمع له صوتا ثم ركع بنا كأطول ركوع ما ركع بنا في صلاة قط ما نسمع له صوتا ثم سجد بنا كأطول سجود ما سجد بنا في صلاة قط لا نسمع له صوتا ثم فعل ذلك في الركعة الثانية مثل ذلك - قال - فوافق تجلي الشمس جلوسه في الركعة الثانية فسلم فحمد الله وأثنى عليه وشهد أن لا إله إلا الله وشهد أنه عبد الله ورسوله ‏.‏ مختصر ‏.‏",
      "text_en": " Tha'labah bin 'Abbad Al-'Abdi from the people of Al-Basrah narrated that:                     He attended a Khutbah one day that was delivered by Samurah bin Jundub. In his Khutbah he mentioned a hadith from the Messenger of Allah (ﷺ). Samurah bin Jundub said: \"One day a boy from among the Ansar and I were shooting at two targets of ours, during the time of the Messenger of Allah (ﷺ), when the sun was at a height of two or three spears as it appears to one who is looking at the horizon. The sun turned black, and we said to one another, let us go to the masjid, for by Allah (SWT) this must herald some event concerning the Messenger of Allah (ﷺ) and his ummah. We went to the masjid and we saw the Messenger of Allah (ﷺ) coming out to the people. He went forward and prayed. He stood for the longest time that he had ever stood in any prayer in which he led us, but we did not hear him saying anything. Then he bowed for the longest time that he had ever bowed in any prayer in which he led us, but we did not hear him saying anything. Then he prostrated for the longest time that he had ever prostrated in any prayer in which he led us, but we did not hear him saying anything. The he did likewise in the second rak'ah. And the eclipse ended as he was sitting at the end of the second rak'ah. The he said the salam, then he praised and glorified Allah (SWT), and bore witness that there is none worthy of worship but Allah (SWT) and he bore witness that he was the slave and Messenger of Allah.\" Narrated in abridged form.",
      "chain": [
        "38684",
        "20321",
        "11323",
        "19841"
      ]
    },
    {
      "hadith_no": "1813",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا هلال بن العلاء بن هلال، قال حدثنا أبي قال، حدثنا عبيد الله، عن زيد بن أبي أنيسة، قال حدثني أيوب، - رجل من أهل الشام - عن القاسم الدمشقي، عن عنبسة بن أبي سفيان، قال أخبرتني أختي أم حبيبة، زوج النبي صلى الله عليه وسلم أن حبيبها أبا القاسم صلى الله عليه وسلم أخبرها قال ‏\"‏ ما من عبد مؤمن يصلي أربع ركعات بعد الظهر فتمس وجهه النار أبدا إن شاء الله عز وجل ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Anbasah bin Abi Sufyan said:                     \"My sister Umm Habibah, the wife of the Prophet (ﷺ), told me that her beloved Abu Al-Qasim (ﷺ) told her: 'There is no believing slave who prays four rak'ahs after Zuhr whose face will ever be touched by the Fire, if Allah, the Mighty and Sublime, wills.'\"",
      "chain": [
        "38684",
        "28464",
        "11201",
        "11340",
        "846"
      ]
    },
    {
      "hadith_no": "2168",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرني هلال بن العلاء بن هلال، قال حدثنا حسين بن عياش، قال حدثنا زهير، قال حدثنا أبو إسحاق، عن البراء بن عازب، أن أحدهم، كان إذا نام قبل أن يتعشى لم يحل له أن يأكل شيئا ولا يشرب ليلته ويومه من الغد حتى تغرب الشمس حتى نزلت هذه الآية ‏{‏ وكلوا واشربوا ‏}‏ إلى ‏{‏ الخيط الأسود ‏}‏ قال ونزلت في أبي قيس بن عمرو أتى أهله وهو صائم بعد المغرب فقال هل من شىء فقالت امرأته ما عندنا شىء ولكن أخرج ألتمس لك عشاء ‏.‏ فخرجت ووضع رأسه فنام فرجعت إليه فوجدته نائما وأيقظته فلم يطعم شيئا وبات وأصبح صائما حتى انتصف النهار فغشي عليه وذلك قبل أن تنزل هذه الآية فأنزل الله فيه ‏.‏",
      "text_en": " It was narrated from Al-Bara bin Azib that:                     if one of them went to sleep before eating supper, it was not permissible for him to eat or drink anything that night or the following day, until the sun had set. (That continued) until this Verse was revealed: \"And eat and drink until the white thread (light) of dawn appears to you distinct from the black thread (darkness of night).\" He said: \"This was revealed concerning Abu Qais bin 'Amr who came to his family after Maghrib when he was fasting, and said: 'Is there anything to eat?\" His wife said: 'No , but I will go out, and he lay down and slept. She came back and found him sleeping, so she woke him up, but he did not eat anything. He spent the night fasting and woke up the next day fasting, until he passed out at midday. That was before this Verse was revealed, and Allah revealed it concerning him.\" '",
      "chain": [
        "38684",
        "20321",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "2211",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرني هلال بن العلاء، قال حدثنا أبي قال، حدثنا عبيد الله، عن زيد، عن أبي إسحاق، عن عبد الله بن الحارث، عن علي بن أبي طالب، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن الله تبارك وتعالى يقول الصوم لي وأنا أجزي به وللصائم فرحتان حين يفطر وحين يلقى ربه والذي نفسي بيده لخلوف فم الصائم أطيب عند الله من ريح المسك ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Ali bin Abi Talib that the Messenger of Allah said:                     \"Allah, may He be blessed and exalted, says: 'Fasting is for me and I shall reward for it. The fasting person has two moments of joy: When he breaks his fast and when he meets his Lord.' By the One in whose hand is my soul, the smell that comes from the mouth of the fasting person is better before Allah than the fragrance of musk.\" '",
      "chain": [
        "38684",
        "28464",
        "11201",
        "15",
        "11049",
        "912",
        "5"
      ]
    },
    {
      "hadith_no": "2242",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرني هلال بن العلاء بن هلال، قال حدثنا أبي قال، حدثنا علي بن هاشم، عن الأعمش، عن عمارة، عن عبد الرحمن بن يزيد، قال دخلنا على عبد الله ومعنا علقمة والأسود وجماعة فحدثنا بحديث ما رأيته حدث به القوم إلا من أجلي لأني كنت أحدثهم سنا قال رسول الله صلى الله عليه وسلم ‏\"‏ يا معشر الشباب من استطاع منكم الباءة فليتزوج فإنه أغض للبصر وأحصن للفرج ‏\"‏ ‏.‏ قال علي وسئل الأعمش عن حديث إبراهيم فقال عن إبراهيم عن علقمة عن عبد الله مثله قال نعم ‏.‏",
      "text_en": " It was narrated that 'Abdur-Rahman bin Yazid said:                     \"We entered upon 'Abdullah along with 'Alqamah, Al-Aswad and a group (of others). He told us a Hadith which he only narrated to the people because of me, as I was the youngest of them. The Messenger of Allah said: 'O young men, whoever among you can afford to get married let him do so, for it is more effective in lowering the gaze and guarding one's chastity.\"' (One of the narrators) 'Ali said: \"Al-Amash was asked about the narrated of Ibrahim, so he (the questioner) said: 'Form Ibrahim, from 'Alqamah, from 'Abdullah; similarly?. Which he (Al-'Amash) replied: 'Yes.",
      "chain": [
        "38684",
        "28464",
        "11060",
        "11379",
        "11055"
      ]
    },
    {
      "hadith_no": "2293",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرني هلال بن العلاء، قال حدثنا حسين، قال حدثنا زهير، قال حدثنا أبو إسحاق، قال أخبرني مجاهد، أن رسول الله صلى الله عليه وسلم صام في شهر رمضان وأفطر في السفر ‏.‏",
      "text_en": " Mujahid narrated:                     That the Messenger of Allah fasted during Ramadan and broke his fast when traveling.",
      "chain": [
        "38684",
        "11278",
        "20321",
        "11049",
        "11028"
      ]
    },
    {
      "hadith_no": "3081",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا هلال بن العلاء بن هلال، قال حدثنا حسين، قال حدثنا أبو خيثمة، قال حدثنا خصيف، عن مجاهد، وعطاء، وسعيد بن جبير، عن ابن عباس، أن الفضل، أخبره أنه، كان رديف رسول الله صلى الله عليه وسلم وأنه لم يزل يلبي حتى رمى الجمرة ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that:                     Al-Fadl to him that he roed behind the Messenger of Allah and he continued to recited the Talbiyah until eh stoned the Jamrat.",
      "chain": [
        "38684",
        "11278",
        "20321",
        "19908",
        "11028",
        "11029",
        "11050",
        "17",
        "20452"
      ]
    },
    {
      "hadith_no": "3353",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا هلال بن العلاء، قال حدثنا حجاج، قال ابن جريج حدثني عمرو بن شعيب، ح وأخبرني عبد الله بن محمد بن تميم، قال سمعت حجاجا، يقول قال ابن جريج عن عمرو بن شعيب، عن أبيه، عن عبد الله بن عمرو، أن النبي صلى الله عليه وسلم قال ‏\"‏ أيما امرأة نكحت على صداق أو حباء أو عدة قبل عصمة النكاح فهو لها وما كان بعد عصمة النكاح فهو لمن أعطيه وأحق ما أكرم عليه الرجل ابنته أو أخته ‏\"‏ ‏.‏ اللفظ لعبد الله ‏.‏",
      "text_en": " It was narrated from 'Abdur-Rahman bin 'Amr:                      \"The Messenger of Allah said: 'Whatever is given as a dowry, or gift or is promised her before the marriage belongs to her. Whatever is given after the marriage belongs to the one to whom it was given. And the most deserving for which a (man) is to be honored is (when marrying off) his daughter or sister.'\" This is the wording of 'Abdullah (one of the narrators).",
      "chain": [
        "38684",
        "20219",
        "11070",
        "19934",
        "20219",
        "11070",
        "19934",
        "19911",
        "29"
      ]
    },
    {
      "hadith_no": "3706",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of ar-Ruqba - كتاب الرقبى",
      "chapter_no": "33",
      "text_ar": "أخبرنا هلال بن العلاء، قال حدثنا أبي قال، حدثنا عبيد الله، - وهو ابن عمرو - عن سفيان، عن ابن أبي نجيح، عن طاوس، عن زيد بن ثابت، عن النبي صلى الله عليه وسلم قال ‏\"‏ الرقبى جائزة ‏\"‏ ‏.‏",
      "text_en": " Hilal bin Al-'Ala' informed us:                      \"My father narrated to us: Ubaidullah -he is, Ibn 'Amr- narrated to us, from Sufyan, from Ibn Abi Najih, from Tawus, from Zaid bin Thabit, that the Prophet said: 'Ar-Ruqba is permissible.'\"",
      "chain": [
        "38684",
        "28464",
        "30024",
        "20005",
        "11254",
        "11053",
        "49"
      ]
    },
    {
      "hadith_no": "3848",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا هلال بن العلاء، قال حدثنا أبو سليم، - وهو عبيد بن يحيى - قال حدثنا أبو بكر النهشلي، عن محمد بن الزبير، عن الحسن، عن عمران بن حصين، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا نذر في المعصية وكفارته كفارة اليمين ‏\"‏ ‏.‏ خالفه منصور بن زاذان في لفظه ‏.‏",
      "text_en": " It was narrated that 'Imran bin Husain said:                      The Messenger of Allah said: \"There is no vow to commit an act of disobedience and its expiation is the expiation for an oath.\" Mansur bin Zadhan contradicted him in his wording.",
      "chain": [
        "38684",
        "20619",
        "14340",
        "11016",
        "123"
      ]
    },
    {
      "hadith_no": "4018",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا هلال بن العلاء، قال حدثنا حسين، قال حدثنا زهير، قال حدثنا أبو إسحاق، عن عمرو بن غالب، قال قالت عائشة يا عمار أما إنك تعلم أنه لا يحل دم امرئ إلا ثلاثة النفس بالنفس أو رجل زنى بعد ما أحصن وساق الحديث ‏.‏",
      "text_en": " It was narrated that 'Amr bin Ghalib said:                     \"Aishah said: 'O 'Ammar! Do you not know that it is not permissible to shed the blood of a Muslim except in three cases: a life for a life, a man who commits adultery after being married.'\"",
      "chain": [
        "38684",
        "11278",
        "20321",
        "11049"
      ]
    },
    {
      "hadith_no": "4062",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرني هلال بن العلاء، قال حدثنا إسماعيل بن عبد الله بن زرارة، قال حدثنا عباد بن العوام، قال حدثنا سعيد، عن قتادة، عن عكرمة، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من بدل دينه فاقتلوه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"The Messenger of Allah [SAW] said: 'Whoever changes his religion, kill him.'\"",
      "chain": [
        "38684",
        "20431",
        "11168",
        "11019",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "4789",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا هلال بن العلاء بن هلال، قال حدثنا سعيد بن سليمان، قال أنبأنا سليمان بن كثير، قال حدثنا عمرو بن دينار، عن طاوس، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من قتل في عميا أو رميا تكون بينهم بحجر أو سوط أو بعصا فعقله عقل خطإ ومن قتل عمدا فقود يده فمن حال بينه وبينه فعليه لعنة الله والملائكة والناس أجمعين لا يقبل منه صرف ولا عدل ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"The Messenger of Allah said: 'Whoever is killed in the blind or by something thrown, while between them is a rock, a wipe, or a stick, then the blood money of be paid for him is the blood money for accidental killing. Whoever kills deliberately, then retaliation is upon him, and whoever tries to prevent that, upon him is the curse of Allah, the Angels, and all the people, and neither Sarf nor Adl will be accepted from him.\"",
      "chain": [
        "38684",
        "30252",
        "20235",
        "11081",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "4878",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرنا هلال بن العلاء، قال حدثني أبي قال، حدثنا يزيد بن زريع، عن سعيد، عن قتادة، عن عطاء، عن صفوان بن أمية، أن رجلا، سرق بردة له فرفعه إلى النبي صلى الله عليه وسلم فأمر بقطعه فقال يا رسول الله قد تجاوزت عنه ‏.‏ فقال ‏\"‏ أبا وهب أفلا كان قبل أن تأتينا به ‏\"‏ ‏.‏ فقطعه رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated from Safwan bin Umayyah, that:                     a man stole a Burdah of his, so he brought him before the Messenger of Allah, who ordered that his hand be cut off. He said: \"O Messenger of Allah, I will let him have it.\" He said: \"Abu Wahb! Why didn't you do that before you brought him to us?\" And the Messenger of Allah had (the man's) hand cut off.",
      "chain": [
        "38684",
        "28464",
        "20304",
        "11168",
        "11019",
        "11029",
        "449"
      ]
    },
    {
      "hadith_no": "4881",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرني هلال بن العلاء، قال حدثنا حسين، قال حدثنا زهير، قال حدثنا عبد الملك، - هو ابن أبي بشير - قال حدثني عكرمة، عن صفوان بن أمية، أنه طاف بالبيت وصلى ثم لف رداء له من برد فوضعه تحت رأسه فنام فأتاه لص فاستله من تحت رأسه فأخذه فأتى به النبي صلى الله عليه وسلم فقال إن هذا سرق ردائي ‏.‏ فقال له النبي صلى الله عليه وسلم ‏\"‏ أسرقت رداء هذا ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ اذهبا به فاقطعا يده ‏\"‏ ‏.‏ قال صفوان ما كنت أريد أن تقطع يده في ردائي ‏.‏ فقال له ‏\"‏ فلو ما قبل هذا ‏\"‏ ‏.‏ خالفه أشعث بن سوار ‏.‏",
      "text_en": " It was narrated from Safwan bin Umayyah that:                     he circumambulated theKa'bah and prayed, then he rolled up a Rid' of his and placed it beneath his head, and slept. A thief came and slid it out from beneath his head and took it. He brought him to the Prophet and said: \"This man stole my Rida. The Prophet said to him: Did you steal this man's Rida?\" He said: \"Yes.\" He said: \"Take him away and cut his hand off.\" Safwan said: \"I* did not want to have his hand cut off for my Rida'.\" He said: \"Why (did you not say that) before now?\"",
      "chain": [
        "38684",
        "11278",
        "20321",
        "14253",
        "11023",
        "449"
      ]
    },
    {
      "hadith_no": "5129",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرني هلال بن العلاء بن هلال، قال حدثنا معلى بن أسد، قال حدثنا وهيب، عن محمد بن عجلان، عن يعقوب بن عبد الله بن الأشج، عن بسر بن سعيد، عن زينب، امرأة عبد الله قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا شهدت إحداكن صلاة العشاء فلا تمس طيبا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Zainab, the wife of 'Abdullah, said:                     \"The Messenger of Allah [SAW] said: 'If one of you wants to attend 'Isha' prayer, let her not touch perfume.'\"",
      "chain": [
        "38684",
        "30457",
        "20299",
        "10616",
        "10629",
        "11153"
      ]
    },
    {
      "hadith_no": "5479",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرني هلال بن العلاء، قال حدثنا أبي قال، حدثنا عبيد الله، عن إسرائيل، عن عبد الملك بن عمير، عن مصعب بن سعد، وعمرو بن ميمون الأودي، قالا كان سعد يعلم بنيه هؤلاء الكلمات كما يعلم المكتب الغلمان ويقول إن رسول الله صلى الله عليه وسلم كان يتعوذ بهن في دبر كل صلاة ‏\"‏ اللهم إني أعوذ بك من البخل وأعوذ بك من الجبن وأعوذ بك من أن أرد إلى أرذل العمر وأعوذ بك من فتنة الدنيا وعذاب القبر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Mus'ab bin Sa'd and 'Amr bin Maimun Al-Awdi said:                     \"Sa'd used to teach his children these words as a teacher teaches his students, and he would say that the Messenger of Allah [SAW] used to seek refuge (with Allah) with these words at the end of every prayer: 'Allahumma inni a'udhu bika minal-bukhli, wa a'udhu bika mnal-jubni, wa a'udhu bika an uradda ila ardhalil-'umuri, wa a'udhu bika min fitnatid-dunya, wa min 'adhabil-qabr (O Allah, I seek refuge with You from miserliness, and I seek refuge with You from cowardice, and I seek refuge with You from reaching the age of senility, and I seek refuge with You from the trials of this life and the torment of the grave.)'\"",
      "chain": [
        "38684",
        "28464",
        "11201",
        "20311",
        "11368",
        "10556",
        "11382"
      ]
    },
    {
      "hadith_no": "5482",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرني هلال بن العلاء، قال حدثنا حسين، قال حدثنا زهير، قال حدثنا أبو إسحاق، عن عمرو بن ميمون، قال حدثني أصحاب، محمد صلى الله عليه وسلم أن رسول الله صلى الله عليه وسلم كان يتعوذ من الشح والجبن وفتنة الصدر وعذاب القبر ‏.‏",
      "text_en": " It was narrated that 'Amr bin Maimun said:                     \"The Companions of Muhammad [SAW] told me that the Messenger of Allah [SAW] used to seek refuge with Allah from stinginess, cowardice, the trials of the heart and the torment of the grave.\"",
      "chain": [
        "38684",
        "11278",
        "20321",
        "11049",
        "11382"
      ]
    },
    {
      "hadith_no": "5494",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا هلال بن العلاء، قال حدثنا سعيد بن سليمان، قال حدثنا عباد، عن الجريري، عن أبي نضرة، عن أبي سعيد، قال كان رسول الله صلى الله عليه وسلم يتعوذ من عين الجان وعين الإنس فلما نزلت المعوذتان أخذ بهما وترك ما سوى ذلك ‏.‏",
      "text_en": " It was narrated that Abu Sa'eed said:                     \"The Messenger of Allah [SAW] used to seek refuge from the evil eye of the Jinn and the evil eye of humans. When Al-Mu'awwadhatan were revealed, he started to recite them and stopped reciting anything else.\"",
      "chain": [
        "38684",
        "30252",
        "20431",
        "11286",
        "10721",
        "38"
      ]
    }
  ],
  "total_hadiths": 20
}