{
  "id": "38715",
  "name": "Yazid bin Khalid bin Yazid يزيد بن خالد بن يزيد",
  "full_name": "Yazid bin Khalid bin Yazid يزيد بن خالد بن يزيد",
  "grade": "3rd Century AH [10th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "232",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Ramla"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ د  س  ق  -  ثقة ]"
    ],
    "tags": [
      "al-Ramli"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20023",
      "name": "al-Laith bin Sa'd الليث بن سعد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20378",
      "name": "al-Mufadl bin Fadala bin 'Ubaid المفضل بن فضالة بن عبيد بن ثمامة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20402",
      "name": "Yahya bin Hamza bin Waqd يحيى بن حمزة بن واقد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20366",
      "name": "Yahya bin Zakaria bin Abi Zaida يحيى بن زكريا بن أبي زائدة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20032",
      "name": "Waki' bin al-Jarrah وكيع بن الجراح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20347",
      "name": "'Isa bin Yonus bin Abi Ishaq عيسى بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20029",
      "name": "'Abdullah bin Wahb عبد الله بن وهب بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20426",
      "name": "Shababa bin Sawar شبابة بن سوار الفزاري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "30006",
      "name": "Imam Nasa'i أحمد بن شعيب بن علي بن سنان النسائي",
      "grade": "3rd Century AH [12th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "36",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا يزيد بن خالد بن عبد الله بن موهب الهمداني، حدثنا المفضل، - يعني ابن فضالة المصري - عن عياش بن عباس القتباني، أن شييم بن بيتان، أخبره عن شيبان القتباني، قال إن مسلمة بن مخلد استعمل رويفع بن ثابت، على أسفل الأرض ‏.‏ قال شيبان فسرنا معه من كوم شريك إلى علقماء أو من علقماء إلى كوم شريك - يريد علقام - فقال رويفع إن كان أحدنا في زمن رسول الله صلى الله عليه وسلم ليأخذ نضو أخيه على أن له النصف مما يغنم ولنا النصف وإن كان أحدنا ليطير له النصل والريش وللآخر القدح ‏.‏ ثم قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ يا رويفع لعل الحياة ستطول بك بعدي فأخبر الناس أنه من عقد لحيته أو تقلد وترا أو استنجى برجيع دابة أو عظم فإن محمدا صلى الله عليه وسلم منه بريء ‏\"‏ ‏.‏",
      "text_en": " Narrated Ruwayfi' ibn Thabit:                     Shayban al-Qatbani reported that Maslamah ibn Mukhallad made Ruwayfi' ibn Thabit the governor of the lower parts (of Egypt). He added: We travelled with him from Kum Sharik to Alqamah or from Alqamah to Kum Sharik (the narrator doubts) for Alqam. Ruwayfi' said: Any one of us would borrow a camel during the lifetime of the Prophet (ﷺ) from the other, on condition that he would give him half the booty, and the other half he would retain himself. Further, one of us received an arrowhead and a feather, and the other an arrow-shaft as a share from the booty. He then reported: The Messenger of Allah (ﷺ) said: You may live for a long time after I am gone, Ruwayfi', so, tell people that if anyone ties his beard or wears round his neck a string to ward off the evil eye, or cleanses himself with animal dung or bone, Muhammad has nothing to do with him.",
      "chain": [
        "38715",
        "20378",
        "10871",
        "16050",
        "1455"
      ]
    },
    {
      "hadith_no": "37",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا يزيد بن خالد، حدثنا مفضل، عن عياش، أن شييم بن بيتان، أخبره بهذا الحديث، أيضا عن أبي سالم الجيشاني، عن عبد الله بن عمرو، يذكر ذلك وهو معه مرابط بحصن باب أليون ‏.‏ قال أبو داود حصن أليون على جبل بالفسطاط ‏.‏ قال أبو داود وهو شيبان بن أمية يكنى أبا حذيفة ‏.‏",
      "text_en": " This tradition has also been narrated by Abu Salim al-Jaishani on the authority of 'Abd Allaah b. 'Amr. He narrated this tradition at the time when he besieged the fort  at the gate of Alyun.Abu Dawud said:                      The fort of Alyun lies at the mountain in Fustat. Abu Dawud said: The kunyah (surname) of Shaiban b. Umayyah is Abu Hudhaifah.",
      "chain": [
        "38715",
        "20378",
        "30157",
        "16050",
        "10858"
      ]
    },
    {
      "hadith_no": "128",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا قتيبة بن سعيد، ويزيد بن خالد الهمداني، قالا حدثنا الليث، عن ابن عجلان، عن عبد الله بن محمد بن عقيل، عن الربيع بنت معوذ ابن عفراء، أن رسول الله صلى الله عليه وسلم توضأ عندها فمسح الرأس كله من قرن الشعر كل ناحية لمنصب الشعر لا يحرك الشعر عن هيئته ‏.‏",
      "text_en": " Al-Rubayyi’ daughter of Mu’awwidh b. ‘Afra’ reported:                      The Messenger of Allah (ﷺ) performed ablution in her presence. He wiped the whole of his head from its upper to the lower part moving every side. He did not move the hair from their original position.",
      "chain": [
        "30367",
        "38715",
        "20023",
        "10616",
        "12246",
        "617"
      ]
    },
    {
      "hadith_no": "267",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا يزيد بن خالد بن عبد الله بن موهب الرملي، حدثنا الليث بن سعد، عن ابن شهاب، عن حبيب، مولى عروة عن ندبة، مولاة ميمونة عن ميمونة، أن رسول الله صلى الله عليه وسلم كان يباشر المرأة من نسائه وهي حائض إذا كان عليها إزار إلى أنصاف الفخذين أو الركبتين تحتجز به ‏.‏",
      "text_en": " Maimunah said:                      The Prophet (ﷺ) would contact and embrace any of his wives while she was menstruating. She would wear the wrapper up to half the the thighs or cover her knees with it.",
      "chain": [
        "38715",
        "20023",
        "11013",
        "29264",
        "3159",
        "61"
      ]
    },
    {
      "hadith_no": "275",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا قتيبة بن سعيد، ويزيد بن خالد بن يزيد بن عبد الله بن موهب، قالا حدثنا الليث، عن نافع، عن سليمان بن يسار، أن رجلا، أخبره عن أم سلمة، أن امرأة، كانت تهراق الدم ‏.‏ فذكر معناه قال ‏\"‏ فإذا خلفت ذلك وحضرت الصلاة فلتغتسل ‏\"‏ ‏.‏ بمعناه ‏.‏",
      "text_en": " Sulaiman b. Yasar said that a man reported to him from Umm Salamah; There was a woman who had an issue of blood. And he narrated the rest of the tradition to the same effect saying; when the menstruation period is over and the time of prayer arrives, she should take a bath, as mentioned in the previous tradition.",
      "chain": [
        "30367",
        "38715",
        "20023",
        "11014",
        "11005",
        "56"
      ]
    },
    {
      "hadith_no": "290",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا يزيد بن خالد بن عبد الله بن موهب الهمداني، حدثني الليث بن سعد، عن ابن شهاب، عن عروة، عن عائشة، بهذا الحديث قال فيه فكانت تغتسل لكل صلاة ‏.‏ قال أبو داود رواه القاسم بن مبرور عن يونس عن ابن شهاب عن عمرة عن عائشة عن أم حبيبة بنت جحش وكذلك رواه معمر عن الزهري عن عمرة عن عائشة وربما قال معمر عن عمرة عن أم حبيبة بمعناه وكذلك رواه إبراهيم بن سعد وابن عيينة عن الزهري عن عمرة عن عائشة وقال ابن عيينة في حديثه ولم يقل إن النبي صلى الله عليه وسلم أمرها أن تغتسل ‏.‏ وكذلك رواه الأوزاعي أيضا قال فيه قالت عائشة فكانت تغتسل لكل صلاة ‏.‏",
      "text_en": " \t\t\t\t\t\t\t\t\tThis has bee\tn narrated though a different chain of narrators by 'Aishah. This version has the words:                      \"She used to take a bath for every prayer.\"Abu Dawud said: Al-Qasim b. Mabrur reported from Yunus from Ibn Shihab from 'Amrah from 'Aishah from Umm Habibah daughter of Jahsh. Similarly, it was reported by Ma'mar from al-Zuhri from 'Amrah from 'Aishah. Ma'mar sometimes reported from 'Amrah on the authority of Umm Habibah to the same effect. Similarly, it was reported by Ibrahim b. Sa'd and Ibn 'Uyainah from al-Zuhri from 'Amrah from 'Aishah. Ibn 'Uyainah said in his version: He (al-Zuhri) did not say that the Prophet (ﷺ) commanded her to take bath.It has also been transmitted by al-Awza'i in a similar way. In this version he said: 'Aishah said: She used to take bath for very prayer.",
      "chain": [
        "38715",
        "20023",
        "11013",
        "10511",
        "53",
        "30002",
        "28488",
        "20475",
        "11013",
        "11455",
        "53",
        "20115",
        "11013"
      ]
    },
    {
      "hadith_no": "342",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا يزيد بن خالد الرملي، أخبرنا المفضل، - يعني ابن فضالة - عن عياش بن عباس، عن بكير، عن نافع، عن ابن عمر، عن حفصة، عن النبي صلى الله عليه وسلم قال ‏\"‏ على كل محتلم رواح الجمعة وعلى كل من راح إلى الجمعة الغسل ‏\"‏ ‏.‏ قال أبو داود إذا اغتسل الرجل بعد طلوع الفجر أجزأه من غسل الجمعة وإن أجنب ‏.‏",
      "text_en": " Narrated Hafsah, Ummul Mu'minin:                     The Prophet (ﷺ) said: It is necessary for every adult (person) to go for (saying) Friday (prayer), and for everyone who goes for Friday (prayer) washing is necessary.Abu Dawud said: If one takes bath after sunrise, even though he washes because of seminal emission, that will be enough for him for his washing on Friday.",
      "chain": [
        "38715",
        "20378",
        "10871",
        "11154",
        "11014",
        "18",
        "54"
      ]
    },
    {
      "hadith_no": "343",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا يزيد بن خالد بن يزيد بن عبد الله بن موهب الرملي الهمداني، ح وحدثنا عبد العزيز بن يحيى الحراني، قالا حدثنا محمد بن سلمة، ح وحدثنا موسى بن إسماعيل، حدثنا حماد، - وهذا حديث محمد بن سلمة - عن محمد بن إسحاق، عن محمد بن إبراهيم، عن أبي سلمة بن عبد الرحمن، - قال أبو داود قال يزيد وعبد العزيز في حديثهما عن أبي سلمة بن عبد الرحمن وأبي أمامة بن سهل - عن أبي سعيد الخدري وأبي هريرة قالا قال رسول الله صلى الله عليه وسلم ‏\"‏ من اغتسل يوم الجمعة ولبس من أحسن ثيابه ومس من طيب - إن كان عنده - ثم أتى الجمعة فلم يتخط أعناق الناس ثم صلى ما كتب الله له ثم أنصت إذا خرج إمامه حتى يفرغ من صلاته كانت كفارة لما بينها وبين جمعته التي قبلها ‏\"‏ ‏.‏ قال ويقول أبو هريرة ‏\"‏ وزيادة ثلاثة أيام ‏\"‏ ‏.‏ ويقول ‏\"‏ إن الحسنة بعشر أمثالها ‏\"‏ ‏.‏ قال أبو داود وحديث محمد بن سلمة أتم ولم يذكر حماد كلام أبي هريرة ‏.‏",
      "text_en": " Abu Sa'id al-Khudri and Abu Hurairah reported the Messenger of Allah (ﷺ) as saying:                      If anyone takes a bath on Friday, puts on his best clothes, applies a touch of perfume if has any, then goes to congregational prayer (in the mosque), and takes care not to step over people, then prayer what Allah has prescribes for him, then keeps silent from the time his Imam comes out until he finishes his prayer, it will atone for his sins during the previous week.Abu Hurairah said: (It will atone for his sins) for three days more. he further said: One is rewarded ten times for doing a good work.Abu Dawud said: The version narrated by Muhammad b. Salamah is perfect, and Hammad did not make a mention of the statement of Abu Hurairah.",
      "chain": [
        "38715",
        "38349",
        "20672",
        "20040",
        "20022",
        "11107",
        "11213",
        "10567",
        "38",
        "13"
      ]
    },
    {
      "hadith_no": "402",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا يزيد بن خالد بن موهب الهمداني، وقتيبة بن سعيد الثقفي، أن الليث، حدثهم عن ابن شهاب، عن سعيد بن المسيب، وأبي، سلمة عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا اشتد الحر فأبردوا عن الصلاة ‏\"‏ ‏.‏ قال ابن موهب ‏\"‏ بالصلاة فإن شدة الحر من فيح جهنم ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the Messenger of Allah (ﷺ) as saying:                      When the heat is violent, offer (the Zuhr) prayer when it becomes fairly cool, for the violent heat comes from the bubbling over the Hell.",
      "chain": [
        "38715",
        "30367",
        "11013",
        "11002",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "606",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة بن سعيد، ويزيد بن خالد بن موهب، - المعنى - أن الليث، حدثهم عن أبي الزبير، عن جابر، قال اشتكى النبي صلى الله عليه وسلم فصلينا وراءه وهو قاعد وأبو بكر يكبر ليسمع الناس تكبيره ثم ساق الحديث ‏.‏",
      "text_en": " Jabir said :                      when the prophet (ﷺ) became seriously ill, we prayed behind him while he was sitting and Abu Bakr was calling “Allah is most great “ to cause the people to hear the TAKBIR. Then he (the narrators) narrated the rest of the tradition.",
      "chain": [
        "30367",
        "38715",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "925",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا يزيد بن خالد بن موهب، وقتيبة بن سعيد، أن الليث، حدثهم عن بكير، عن نابل، صاحب العباء عن ابن عمر، عن صهيب، أنه قال مررت برسول الله صلى الله عليه وسلم وهو يصلي فسلمت عليه فرد إشارة ‏.‏ قال ولا أعلمه إلا قال إشارة بأصبعه وهذا لفظ حديث قتيبة ‏.‏",
      "text_en": " Narrated Suhayb:                     I passed by the Messenger of Allah (ﷺ) who was praying. I saluted him and he returned it by making a sign. The narrator said: I do not know but that he said: He made a sign with his finger.  This is the version reported by Qutaybah.",
      "chain": [
        "38715",
        "30367",
        "11154",
        "18",
        "182"
      ]
    },
    {
      "hadith_no": "1208",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Rules of Law about the Prayer during Journey - كتاب صلاة السفر",
      "chapter_no": "4",
      "text_ar": "حدثنا يزيد بن خالد بن يزيد بن عبد الله بن موهب الرملي الهمداني، حدثنا المفضل بن فضالة، والليث بن سعد، عن هشام بن سعد، عن أبي الزبير، عن أبي الطفيل، عن معاذ بن جبل، أن رسول الله صلى الله عليه وسلم كان في غزوة تبوك إذا زاغت الشمس قبل أن يرتحل جمع بين الظهر والعصر وإن يرتحل قبل أن تزيغ الشمس أخر الظهر حتى ينزل للعصر وفي المغرب مثل ذلك إن غابت الشمس قبل أن يرتحل جمع بين المغرب والعشاء وإن يرتحل قبل أن تغيب الشمس أخر المغرب حتى ينزل للعشاء ثم جمع بينهما ‏.‏ قال أبو داود رواه هشام بن عروة عن حسين بن عبد الله عن كريب عن ابن عباس عن النبي صلى الله عليه وسلم نحو حديث المفضل والليث ‏.‏",
      "text_en": " Narrated Mu'adh ibn Jabal:                     On the expedition to Tabuk if the sun had passed the meridian before the apostle of Allah (ﷺ) moved off, he combined the noon and the afternoon prayers; but if he moved off before the sun had passed the meridian, he delayed the noon prayer till he halted for the afternoon prayer. He acted similarly for the sunset prayer; if the sun set before he moved off, he combined the sunset and the night prayers, but if he moved off before sunset, he delayed the sunset prayer till he halted for the night prayer and then combined them.Abu Dawud said: Hisham b. 'Urwah narrated this tradition from Husain b. 'Abd Allah, from Kuraib on the authority of Ibn 'Abbas from the Prophet (ﷺ) like the tradition narrated by Mufaddal and al-Laith.",
      "chain": [
        "38715",
        "20378",
        "20023",
        "20519",
        "11263",
        "3660",
        "32"
      ]
    },
    {
      "hadith_no": "1466",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا يزيد بن خالد بن موهب الرملي، حدثنا الليث، عن ابن أبي مليكة، عن يعلى بن مملك، أنه سأل أم سلمة عن قراءة، رسول الله صلى الله عليه وسلم وصلاته فقالت وما لكم وصلاته كان يصلي وينام قدر ما صلى ثم يصلي قدر ما نام ثم ينام قدر ما صلى حتى يصبح ونعتت قراءته فإذا هي تنعت قراءته حرفا حرفا ‏.‏",
      "text_en": " Narrated Umm Salamah, Ummul Mu'minin:                     Ya'la ibn Mumallak said that he asked Umm Salamah about the recitation and prayer of the Messenger of Allah (ﷺ). She said: What have you to do with his prayer? He would pray, then sleep as long as he had prayed, till morning. She then described his recitation and did so with an exposition word by word.",
      "chain": [
        "38715",
        "20023",
        "11090",
        "56"
      ]
    },
    {
      "hadith_no": "1469",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا أبو الوليد الطيالسي، وقتيبة بن سعيد، ويزيد بن خالد بن موهب الرملي، بمعناه أن الليث، حدثهم عن عبد الله بن أبي مليكة، عن عبيد الله بن أبي نهيك، عن سعد بن أبي وقاص، - وقال يزيد عن ابن أبي مليكة، - عن سعيد بن أبي سعيد، وقال، قتيبة هو في كتابي عن سعيد بن أبي سعيد، - قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ليس منا من لم يتغن بالقرآن ‏\"‏ ‏.‏",
      "text_en": " Narrated Sa'd ibn AbuWaqqas:                     (The narrator Qutaibah said: This tradition has been narrated by Sa'id b. Abu Sa'id in my collection): The Messenger of Allah (ﷺ) said: He who does not chant the Qur'an is not one of us.",
      "chain": [
        "20296",
        "30367",
        "38715",
        "11090",
        "9",
        "20472",
        "11090",
        "11168"
      ]
    },
    {
      "hadith_no": "1520",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا يزيد بن خالد الرملي، حدثنا ابن وهب، حدثنا عبد الرحمن بن شريح، عن أبي أمامة بن سهل بن حنيف، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من سأل الله الشهادة صادقا بلغه الله منازل الشهداء وإن مات على فراشه ‏\"‏ ‏.‏",
      "text_en": " Suhail b. Hunaif reported on the authority of his father:                      The Messenger of Allah (ﷺ) said: If anyone asks Allah for martyrdom sincerely, Allah make him reach the ranks of martyrs though he may die on his bed.",
      "chain": [
        "38715",
        "20029",
        "20438",
        "405",
        "403"
      ]
    },
    {
      "hadith_no": "1677",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا قتيبة بن سعيد، ويزيد بن خالد بن موهب الرملي، قالا حدثنا الليث، عن أبي الزبير، عن يحيى بن جعدة، عن أبي هريرة، أنه قال يا رسول الله أى الصدقة أفضل قال ‏\"‏ جهد المقل وابدأ بمن تعول ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported I asked Messenger of Allah (ﷺ), What kind of sadaqah is most excellent?  He replied What a man with little property can afford to give; and begin with those for whom you are responsible.",
      "chain": [
        "30367",
        "38715",
        "20023",
        "11263",
        "13"
      ]
    },
    {
      "hadith_no": "1719",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book of Lost and Found Items - كتاب اللقطة",
      "chapter_no": "10",
      "text_ar": "حدثنا يزيد بن خالد بن موهب، وأحمد بن صالح، قالا حدثنا ابن وهب، أخبرني عمرو، عن بكير، عن يحيى بن عبد الرحمن بن حاطب، عن عبد الرحمن بن عثمان التيمي، أن رسول الله صلى الله عليه وسلم نهى عن لقطة الحاج ‏.‏ قال أحمد قال ابن وهب يعني في لقطة الحاج يتركها حتى يجدها صاحبها قال ابن موهب عن عمرو ‏.‏",
      "text_en": " ‘Abd al-Rahman bin `Uthman al-Taime said:                      The Messenger of Allah (SWAS) prohibited taking the find of pilgrims.  Ibn Wahb said : One should leave the find of a pilgrim till its owner finds it.",
      "chain": [
        "38715",
        "30226",
        "20029",
        "20377",
        "11154",
        "10625",
        "2705"
      ]
    },
    {
      "hadith_no": "1758",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا يزيد بن خالد الرملي الهمداني، وقتيبة بن سعيد، أن الليث بن سعد، حدثهم عن ابن شهاب، عن عروة، وعمرة بنت عبد الرحمن، أن عائشة، - رضى الله عنها - قالت كان رسول الله صلى الله عليه وسلم يهدي من المدينة فأفتل قلائد هديه ثم لا يجتنب شيئا مما يجتنب المحرم ‏.‏",
      "text_en": " Ai’shah said:                      The Messenger of Allah (SWAS) would send the sacrificial animals as offerings (to Makkah) from Madinah.  I would twist the garlands of the sacrificial animals ; thereafter he would not abstain from anything  from which a pilgrim putting on Ihram abstains.",
      "chain": [
        "38715",
        "30367",
        "20023",
        "11013",
        "10511",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "1821",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا يزيد بن خالد بن عبد الله بن موهب الهمداني الرملي، قال حدثني الليث، عن عطاء بن أبي رباح، عن ابن يعلى ابن منية، عن أبيه، بهذا الخبر قال فيه فأمره رسول الله صلى الله عليه وسلم أن ينزعها نزعا ويغتسل مرتين أو ثلاثا ‏.‏ وساق الحديث ‏.‏",
      "text_en": " This tradition has also been transmitted by Ya’la bin Umayyah through a different chain of narrators. This version adds The Apostle of Allaah(ﷺ) commanded  him to take it off (the tunic) and to take a bath twice or thrice. The narrator then transmitted the rest of the tradition.",
      "chain": [
        "38715",
        "20023",
        "11029"
      ]
    },
    {
      "hadith_no": "2668",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا يزيد بن خالد بن موهب، وقتيبة، - يعني ابن سعيد - قالا حدثنا الليث، عن نافع، عن عبد الله، أن امرأة، وجدت، في بعض مغازي رسول الله صلى الله عليه وسلم مقتولة فأنكر رسول الله صلى الله عليه وسلم قتل النساء والصبيان ‏.‏",
      "text_en": " ‘Abd Allaah bin (mas’ud) said “A woman was found slain in one of the battles of the Apostle of Allaah(ﷺ). The Apostle of Allaah(ﷺ) forbade to kill women and children.",
      "chain": [
        "38715",
        "30367",
        "20023",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2674",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا يزيد بن خالد، وقتيبة، أن الليث بن سعد، حدثهم عن بكير، عن سليمان بن يسار، عن أبي هريرة، قال بعثنا رسول الله صلى الله عليه وسلم في بعث فقال ‏\"‏ إن وجدتم فلانا وفلانا ‏\"‏ ‏.‏ فذكر معناه ‏.‏",
      "text_en": " Abu Hurairah said:                      The Messenger of Allah (ﷺ) sent us along with a contingent, and said: If you find so-and-so. He then narrated the rest of the tradition to the same effect.",
      "chain": [
        "38715",
        "30367",
        "20023",
        "11154",
        "11005",
        "13"
      ]
    },
    {
      "hadith_no": "2739",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا هارون بن محمد بن بكار بن بلال، حدثنا يزيد بن خالد بن موهب الهمداني، قال حدثنا يحيى بن زكريا بن أبي زائدة، قال أخبرني داود، بهذا الحديث بإسناده قال فقسمها رسول الله صلى الله عليه وسلم بالسواء ‏.‏ وحديث خالد أتم ‏.‏",
      "text_en": " The tradition mentioned above has been transmitted by Dawud with a different chain of narrators. He said “The Apostle of Allaah(ﷺ) apportioned it (spoils of war) equally. The tradition of Khalid is more perfect.",
      "chain": [
        "37538",
        "38715",
        "20366"
      ]
    },
    {
      "hadith_no": "2744",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا عبد الله بن مسلمة القعنبي، عن مالك، ح وحدثنا عبد الله بن مسلمة، ويزيد بن خالد بن موهب، قالا حدثنا الليث، - المعنى - عن نافع، عن عبد الله بن عمر، أن رسول الله صلى الله عليه وسلم بعث سرية فيها عبد الله بن عمر قبل نجد فغنموا إبلا كثيرة فكانت سهمانهم اثنى عشر بعيرا ونفلوا بعيرا بعيرا ‏.‏ زاد ابن موهب فلم يغيره رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Nafi’ reported on the authority of ‘Abd Allaah bin ‘Umar “The Apostle of Allaah(ﷺ) sent a detachment towards Najd. ‘Abd Allaah bin ‘Umar also accompanied it. They gained a large number of Camels as a booty. Their portion was twelve Camels each and they were rewarded (in addition) one Camel each. The version of Ibn Mawhab added “The Apostle of Allaah(ﷺ) did not change it”",
      "chain": [
        "20164",
        "20001",
        "20164",
        "38715",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2918",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Shares of Inheritance (Kitab Al-Fara'id) - كتاب الفرائض",
      "chapter_no": "19",
      "text_ar": "حدثنا يزيد بن خالد بن موهب الرملي، وهشام بن عمار، قالا حدثنا يحيى، - قال أبو داود وهو ابن حمزة - عن عبد العزيز بن عمر، قال سمعت عبد الله بن موهب، يحدث عمر بن عبد العزيز عن قبيصة بن ذؤيب، - قال هشام عن تميم الداري، أنه قال يا رسول الله ‏.‏ وقال يزيد - إن تميما قال يا رسول الله ما السنة في الرجل يسلم على يدى الرجل من المسلمين قال ‏\"‏ هو أولى الناس بمحياه ومماته ‏\"‏ ‏.‏",
      "text_en": " Narrated Tamim ad-Dari:                     Tamim asked: Messenger of Allah), what is the sunnah about a man who accepts Islam by advice and persuasion of a Muslim? He replied: He is the nearest to him in life and in death.",
      "chain": [
        "38715",
        "30288",
        "20031",
        "19811",
        "11010",
        "11065",
        "382"
      ]
    },
    {
      "hadith_no": "2968",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا يزيد بن خالد بن عبد الله بن موهب الهمداني، حدثنا الليث بن سعد، عن عقيل بن خالد، عن ابن شهاب، عن عروة بن الزبير، عن عائشة، زوج النبي صلى الله عليه وسلم أنها أخبرته أن فاطمة بنت رسول الله صلى الله عليه وسلم أرسلت إلى أبي بكر الصديق رضى الله عنه تسأله ميراثها من رسول الله صلى الله عليه وسلم مما أفاء الله عليه بالمدينة وفدك وما بقي من خمس خيبر ‏.‏ فقال أبو بكر إن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا نورث ما تركنا صدقة إنما يأكل آل محمد من هذا المال ‏\"‏ ‏.‏ وإني والله لا أغير شيئا من صدقة رسول الله صلى الله عليه وسلم عن حالها التي كانت عليه في عهد رسول الله صلى الله عليه وسلم فلأعملن فيها بما عمل به رسول الله صلى الله عليه وسلم فأبى أبو بكر رضى الله عنه أن يدفع إلى فاطمة عليها السلام منها شيئا ‏.‏",
      "text_en": " Narrated 'Aishah, wife of Prophet (ﷺ):                     Fatimah daughter of Messenger of Allah (ﷺ) sent a messenger to Abu Bakr demanding from him in inheritance of the Messenger of Allah (ﷺ) from what Allah bestowed on him at Medina and Fadak, and what remained of the fifth of Khaibar. Abu Bakr said: The Messenger of Allah (ﷺ) has said: We are not inherited. Whatever we leave is sadaqah. The family of Muhammad will eat from this property. I swear by Allah I shall not change it from the former condition of its being sadaqah as it was in the time of the Messenger of Allah (ﷺ). I shall deal with it as the Messenger of Allah dealt with it. Abu Bakr, therefore, refused to give anything to Fatimah from it.",
      "chain": [
        "38715",
        "20023",
        "11207",
        "11013",
        "10511"
      ]
    },
    {
      "hadith_no": "3107",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا يزيد بن خالد الرملي، حدثنا ابن وهب، عن حيى بن عبد الله، عن أبي عبد الرحمن الحبلي، عن ابن عمرو، قال قال النبي صلى الله عليه وسلم ‏\"‏ إذا جاء الرجل يعود مريضا فليقل اللهم اشف عبدك ينكأ لك عدوا أو يمشي لك إلى جنازة ‏\"‏ ‏.‏ قال أبو داود وقال ابن السرح ‏\"‏ إلى صلاة ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     The Prophet (ﷺ) said: When a man comes to visit a sick person, he should say: O Allah, cure Thy servant, who may then wreak havoc on an enemy for your sake, or walk at a funeral for your sake.Abu Dawud said: Ibn As-Sarh (one of the narrators) said: \"Ilas-salat (To the Salat)\".",
      "chain": [
        "38715",
        "20029",
        "10938",
        "29"
      ]
    },
    {
      "hadith_no": "3123",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا يزيد بن خالد بن عبد الله بن موهب الهمداني، حدثنا المفضل، عن ربيعة بن سيف المعافري، عن أبي عبد الرحمن الحبلي، عن عبد الله بن عمرو بن العاص، قال قبرنا مع رسول الله صلى الله عليه وسلم - يعني ميتا - فلما فرغنا انصرف رسول الله صلى الله عليه وسلم وانصرفنا معه فلما حاذى بابه وقف فإذا نحن بامرأة مقبلة - قال أظنه عرفها - فلما ذهبت إذا هي فاطمة - عليها السلام - فقال لها رسول الله صلى الله عليه وسلم ‏\"‏ ما أخرجك يا فاطمة من بيتك ‏\"‏ ‏.‏ فقالت أتيت يا رسول الله أهل هذا البيت فرحمت إليهم ميتهم أو عزيتهم به ‏.‏ فقال لها رسول الله صلى الله عليه وسلم ‏\"‏ فلعلك بلغت معهم الكدى ‏\"‏ ‏.‏ قالت معاذ الله وقد سمعتك تذكر فيها ما تذكر ‏.‏ قال ‏\"‏ لو بلغت معهم الكدى ‏\"‏ ‏.‏ فذكر تشديدا في ذلك فسألت ربيعة عن الكدى فقال القبور فيما أحسب ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     We buried a deceased person in the company of the Messenger of Allah (ﷺ). When we had finished, the Messenger of Allah (ﷺ) returned and we also returned with him. When he approached his door, he stopped, and we saw a woman coming towards him.  He (the narrator) said: I think he recognized her. When she went away, we came to know that she was Fatimah.  The Messenger of Allah (ﷺ) said to her: What brought you out of your house, Fatimah?  She replied: I came to the people of this house, Messenger of Allah, and I showed pity and expressed my condolences to them for their deceased relation.  The Messenger of Allah (ﷺ) said: You might have gone to the graveyard with them.  She replied: I seek refuge in Allah! I heard you referring to what you mentioned.  He said: If you had gone to the graveyard...He then mentioned severe words about it.  I then asked Rabi'ah (a narrator of this tradition) about al-kuda (stony land). He replied: I think it means the graves.",
      "chain": [
        "38715",
        "18277",
        "10938",
        "29"
      ]
    },
    {
      "hadith_no": "3138",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا قتيبة بن سعيد، ويزيد بن خالد بن موهب، أن الليث، حدثهم عن ابن شهاب، عن عبد الرحمن بن كعب بن مالك، أن جابر بن عبد الله، أخبره أن رسول الله صلى الله عليه وسلم كان يجمع بين الرجلين من قتلى أحد ويقول ‏\"‏ أيهما أكثر أخذا للقرآن ‏\"‏ ‏.‏ فإذا أشير له إلى أحدهما قدمه في اللحد وقال ‏\"‏ أنا شهيد على هؤلاء يوم القيامة ‏\"‏ ‏.‏ وأمر بدفنهم بدمائهم ولم يغسلوا ‏.‏",
      "text_en": " Narrated Jabir b. 'Abd Allah :                     The Messenger of Allah (ﷺ) combined two persons from among the martyrs of Uhud (in one garment), and said: Which of the two has learnt the Qur'an more ? When one of them was pointed to him, he advanced him in the grave, saying: I shall be witness to all these (martyrs) on the Day of Judgement. He then ordered them to be buried without being washed.",
      "chain": [
        "30367",
        "38715",
        "11013",
        "1134",
        "34"
      ]
    },
    {
      "hadith_no": "3193",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا يزيد بن خالد بن موهب الرملي، حدثنا ابن وهب، عن ابن جريج، عن يحيى بن صبيح، حدثني عمار، مولى الحارث بن نوفل أنه شهد جنازة أم كلثوم وابنها فجعل الغلام مما يلي الإمام فأنكرت ذلك وفي القوم ابن عباس وأبو سعيد الخدري وأبو قتادة وأبو هريرة فقالوا هذه السنة ‏.‏",
      "text_en": " Yahya ibn Subayh said:                      Ammar client of al-Harith ibn Nawfal told me that he attended the funeral of Umm Kulthum, and her son. The body of the boy was placed near the imam. I objected to it. Among the people there were Ibn Abbas, AbuSa'id al-Khudri, AbuQatadah and AbuHurayrah. They said: This is the sunnah (established practice of the Prophet).",
      "chain": [
        "38715",
        "20029",
        "11070",
        "28632"
      ]
    },
    {
      "hadith_no": "3358",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا يزيد بن خالد الهمداني، وقتيبة بن سعيد الثقفي، أن الليث، حدثهم عن أبي الزبير، عن جابر، أن النبي صلى الله عليه وسلم اشترى عبدا بعبدين ‏.‏",
      "text_en": " Narrated Jabir:                     The Prophet (ﷺ) bought a slave for two slaves.",
      "chain": [
        "38715",
        "30367",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "3892",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Medicine (Kitab Al-Tibb) - كتاب الطب",
      "chapter_no": "29",
      "text_ar": "حدثنا يزيد بن خالد بن موهب الرملي، حدثنا الليث، عن زياد بن محمد، عن محمد بن كعب القرظي، عن فضالة بن عبيد، عن أبي الدرداء، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من اشتكى منكم شيئا أو اشتكاه أخ له فليقل ربنا الله الذي في السماء تقدس اسمك أمرك في السماء والأرض كما رحمتك في السماء فاجعل رحمتك في الأرض اغفر لنا حوبنا وخطايانا أنت رب الطيبين أنزل رحمة من رحمتك وشفاء من شفائك على هذا الوجع فيبرأ ‏\"‏ ‏.‏",
      "text_en": " Narrated AbudDarda':                     I heard the Messenger of Allah (ﷺ) say: If any of you is suffering from anything or his brother is suffering, he should say: Our Lord is Allah Who is in the heaven, holy is Thy name, Thy command reigns supreme in the heaven and the earth, as Thy mercy in the heaven, make Thy mercy  in the earth; forgive us our sins, and our errors; Thou art the Lord of good men; send down mercy from Thy mercy, and remedy, and remedy from Thy remedy on this pain so that it is healed up.",
      "chain": [
        "38715",
        "20023",
        "11221",
        "1935",
        "37"
      ]
    },
    {
      "hadith_no": "4028",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا قتيبة بن سعيد، ويزيد بن خالد بن موهب، - المعنى - أن الليث، - يعني ابن سعد - حدثهم عن عبد الله بن عبيد الله بن أبي مليكة، عن المسور بن مخرمة، أنه قال قسم رسول الله صلى الله عليه وسلم أقبية ولم يعط مخرمة شيئا فقال مخرمة يا بنى انطلق بنا إلى رسول الله صلى الله عليه وسلم فانطلقت معه قال ادخل فادعه لي قال فدعوته فخرج إليه وعليه قباء منها فقال ‏\"‏ خبأت هذا لك ‏\"‏ ‏.‏ قال فنظر إليه - زاد ابن موهب - مخرمة - ثم اتفقا - قال رضي مخرمة ‏.‏ قال قتيبة عن ابن أبي مليكة لم يسمه ‏.‏",
      "text_en": " Narrated Al-Miswar b. Makhramah:                     The Messenger of Allah (ﷺ) distributed outer garments with full-length sleeves but did not give Makhramah anything. Makhramah said: Go with us to the Messenger of Allah (ﷺ). So I went with him and he said: Enter and call him for me. I then called him. He came out to him and he had an outer garment with full-length sleeves over him from those garments. He said: I kept it for you. He looked at it, meaning Makhramah according to the addition of Ibn Mawhab. The agreed version then says: He said: Makhramah was pleased. Ibn Qutaibah said: From Ibn Abi Mulaikah, but he did not name it.",
      "chain": [
        "30367",
        "38715",
        "20023",
        "11090",
        "2201"
      ]
    },
    {
      "hadith_no": "4032",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا يزيد بن خالد بن يزيد بن عبد الله بن موهب الرملي، وحسين بن علي، قالا حدثنا ابن أبي زائدة، عن أبيه، عن مصعب بن شيبة، عن صفية بنت شيبة، عن عائشة، رضى الله عنها قالت خرج رسول الله صلى الله عليه وسلم وعليه مرط مرحل من شعر أسود ‏.‏ وقال حسين حدثنا يحيى بن زكريا ‏.‏ - حدثنا إبراهيم بن العلاء الزبيدي حدثنا إسماعيل بن عياش عن عقيل بن مدرك عن لقمان بن عامر عن عتبة بن عبد السلمي قال استكسيت رسول الله صلى الله عليه وسلم فكساني خيشتين فلقد رأيتني وأنا أكسى أصحابي ‏.‏",
      "text_en": " 'Aishah said:                      The Messenger of Allah (ﷺ) went out one morning wearing a variegated garment of black goat hair.Narrated Utbah ibn AbdusSulami:I asked the Messenger of Allah (ﷺ) to clothe me. He clothed me with two coarse clothes of linen.",
      "chain": [
        "38715",
        "20315",
        "20366",
        "11338",
        "10658",
        "2802",
        "53"
      ]
    },
    {
      "hadith_no": "4049",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا يزيد بن خالد بن عبد الله بن موهب الهمداني، أخبرنا المفضل، - يعني ابن فضالة - عن عياش بن عباس القتباني، عن أبي الحصين، - يعني الهيثم بن شفي - قال خرجت أنا وصاحب، لي يكنى أبا عامر - رجل من المعافر - لنصلي بإيلياء وكان قاصهم رجل من الأزد يقال له أبو ريحانة من الصحابة قال أبو الحصين فسبقني صاحبي إلى المسجد ثم ردفته فجلست إلى جنبه فسألني هل أدركت قصص أبي ريحانة قلت لا ‏.‏ قال سمعته يقول نهى رسول الله صلى الله عليه وسلم عن عشر عن الوشر والوشم والنتف وعن مكامعة الرجل الرجل بغير شعار وعن مكامعة المرأة المرأة بغير شعار وأن يجعل الرجل في أسفل ثيابه حريرا مثل الأعاجم أو يجعل على منكبيه حريرا مثل الأعاجم وعن النهبى وركوب النمور ولبوس الخاتم إلا لذي سلطان ‏.‏ قال أبو داود الذي تفرد به من هذا الحديث ذكر الخاتم ‏.‏",
      "text_en": " Narrated Abul Husayn, that is al-Haytham ibn Shafi I and a companion of mine called Abu 'Amir, a man from al-Ma'afir went to perform prayer in Bayt al-Maqdis (Jerusalem). Their preacher was a man of Azd called AbuRayhanah, who was a companion of the Prophet (ﷺ).  Abul Husayn said:                      my companion went to the mosque before me. I went there after him and sat beside him.  He asked me: Did you hear the preaching of AbuRayhanah?  I said: No.  He said: I heard him say: The Messenger of Allah (ﷺ) forbade ten things: Sharpening the ends of the teeth, tattooing, plucking hair, men sleeping together without an under garment, women sleeping together without an under-garment, men putting silk at the hem of their garments like the Persians, or putting silk on their shoulders like the Persians, plundering, riding on panther skins, wearing signet rings, except in the case of one in authority.Abu Dawud said: The solitary point in this tradition (not supported by other traditions) is the report about the signet-ring.",
      "chain": [
        "38715",
        "20378",
        "10871"
      ]
    },
    {
      "hadith_no": "4142",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا يزيد بن خالد الهمداني الرملي، حدثنا ابن وهب، عن أبي هانئ، عن أبي عبد الرحمن الحبلي، عن جابر بن عبد الله، قال ذكر رسول الله صلى الله عليه وسلم الفرش فقال ‏\"‏ فراش للرجل وفراش للمرأة وفراش للضيف والرابع للشيطان ‏\"‏ ‏.‏",
      "text_en": " Narrated Jabir bin ‘Abdullah :                     The Messenger of Allah (ﷺ) mentioned bedding and said: There should be bedding for a man, bedding for his wife, and third for a guest, but a fourth for the devil.",
      "chain": [
        "38715",
        "20029",
        "10938",
        "34"
      ]
    },
    {
      "hadith_no": "4257",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim) - كتاب الفتن والملاحم",
      "chapter_no": "37",
      "text_ar": "حدثنا يزيد بن خالد الرملي، حدثنا مفضل، عن عياش، عن بكير، عن بسر بن سعيد، عن حسين بن عبد الرحمن الأشجعي، أنه سمع سعد بن أبي وقاص، عن النبي صلى الله عليه وسلم في هذا الحديث قال فقلت يا رسول الله أرأيت إن دخل على بيتي وبسط يده ليقتلني قال فقال رسول الله صلى الله عليه وسلم ‏\"‏ كن كابنى آدم ‏\"‏ ‏.‏ وتلا يزيد ‏{‏ لئن بسطت إلى يدك ‏}‏ الآية ‏.‏",
      "text_en": " Narrated Sa'd ibn AbuWaqqas:                     I asked: Messenger of Allah! tell me if someone enters my house and extends his hands to kill me (what should I do?) The Messenger of Allah (ﷺ) replied: Be like the two sons of Adam. The narrator Yazid (ibn Khalid) then recited the verse: \"If thou dost stretch they hand against me to slay me.\" [5:28]",
      "chain": [
        "38715",
        "20378",
        "30157",
        "11154",
        "11153",
        "9"
      ]
    },
    {
      "hadith_no": "4373",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا يزيد بن خالد بن عبد الله بن موهب الهمداني، قال حدثني ح، وحدثنا قتيبة بن سعيد الثقفي، حدثنا الليث، عن ابن شهاب، عن عروة، عن عائشة، رضى الله عنها أن قريشا، أهمهم شأن المرأة المخزومية التي سرقت فقالوا من يكلم فيها تعني رسول الله صلى الله عليه وسلم ‏.‏ قالوا ومن يجترئ إلا أسامة بن زيد حب رسول الله صلى الله عليه وسلم فكلمه أسامة فقال رسول الله صلى الله عليه وسلم ‏\"‏ يا أسامة أتشفع في حد من حدود الله ‏\"‏ ‏.‏ ثم قام فاختطب فقال ‏\"‏ إنما هلك الذين من قبلكم أنهم كانوا إذا سرق فيهم الشريف تركوه وإذا سرق فيهم الضعيف أقاموا عليه الحد وايم الله لو أن فاطمة بنت محمد سرقت لقطعت يدها ‏\"‏ ‏.‏",
      "text_en": " ‘A’ishah said:                      The Quraish were anxious about the Makhzumi woman who had committed theft, They said : Who will speak to the Messenger of Allah(ﷺ) about her ? Then they said: Who will be bold enough for it but Uasmah bin Zaid,  the prophet’s (ﷺ) friend! So Usamah spoke to him, and the Messenger of Allah(ﷺ) said : Are you interceding regarding one of the punishments prescribed by  Allah ? He then got up and gave an address, saying : What destroyed your predecessors  was just that when a person of rank among them committed a theft, They left him alone , and when a weak one of them committed a theft, they inflicted the prescribed punishment on him . I swear by Allah that if Fatimah daughter of Muhammad should steal, I would have her hand cut off.",
      "chain": [
        "38715",
        "30367",
        "20023",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "4583",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا يزيد بن خالد بن موهب الرملي، حدثنا عيسى بن يونس، عن محمد بن إسحاق، عن عمرو بن شعيب، عن أبيه، عن جده، عن النبي صلى الله عليه وسلم قال ‏\"‏ دية المعاهد نصف دية الحر ‏\"‏ ‏.‏ قال أبو داود رواه أسامة بن زيد الليثي وعبد الرحمن بن الحارث عن عمرو بن شعيب مثله ‏.‏",
      "text_en": " Narrated 'Amr b. Suh'aib:                     On his father's authority, said that his grandfather reported the Messenger of Allah (ﷺ)  said: The blood-wit for a man who makes a covenant is half of the blood-wit for a free man.Abu Dawud said: It has been transmitted by Usamah b. Zaid al-Laithi and 'Abd al-Rahman b. al-Harith on the authority of 'Amr b. Suh'aib in similar manner.",
      "chain": [
        "38715",
        "20347",
        "11107",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "4611",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا يزيد بن خالد بن عبد الله بن موهب الهمداني، حدثنا الليث، عن عقيل، عن ابن شهاب، أن أبا إدريس الخولاني، عائذ الله أخبره أن يزيد بن عميرة وكان من أصحاب معاذ بن جبل أخبره قال كان لا يجلس مجلسا للذكر حين يجلس إلا قال الله حكم قسط هلك المرتابون فقال معاذ بن جبل يوما إن من ورائكم فتنا يكثر فيها المال ويفتح فيها القرآن حتى يأخذه المؤمن والمنافق والرجل والمرأة والصغير والكبير والعبد والحر فيوشك قائل أن يقول ما للناس لا يتبعوني وقد قرأت القرآن ما هم بمتبعي حتى أبتدع لهم غيره فإياكم وما ابتدع فإن ما ابتدع ضلالة وأحذركم زيغة الحكيم فإن الشيطان قد يقول كلمة الضلالة على لسان الحكيم وقد يقول المنافق كلمة الحق ‏.‏ قال قلت لمعاذ ما يدريني رحمك الله أن الحكيم قد يقول كلمة الضلالة وأن المنافق قد يقول كلمة الحق قال بلى اجتنب من كلام الحكيم المشتهرات التي يقال لها ما هذه ولا يثنينك ذلك عنه فإنه لعله أن يراجع وتلق الحق إذا سمعته فإن على الحق نورا ‏.‏ قال أبو داود قال معمر عن الزهري في هذا ولا ينئينك ذلك عنه مكان يثنينك ‏.‏ وقال صالح بن كيسان عن الزهري في هذا المشبهات مكان المشتهرات وقال لا يثنينك كما قال عقيل ‏.‏ وقال ابن إسحاق عن الزهري قال بلى ما تشابه عليك من قول الحكيم حتى تقول ما أراد بهذه الكلمة ‏.‏",
      "text_en": " Yazid b. ‘Umairah, who was one of the companions of Mu’adh b. Jabal said:                      Whenever he (mu’adh b. jabal) sat in a meeting for preaching, he would say: Allah is a just arbiter; those who doubt would perish. One day Mu’adh b. jabal said: In the times after you there would be trails in which riches would be abundant. During these trails the Quran would be easy so much so that every believer, hypocrite, man, woman, young, grown up, slave and free man will learn it. Then a man might say: What happened with the people that they do not follow me while I read the Quran? They are not going to follow me until I introduce a novelty for them other than it. So avoid that which is innovated (in religion), for whichever is innovated is an error. I warn you of the deviation of a scholar from right guidance, for sometimes Satan utters a word of error through the tongue of a scholar; and sometimes a hypocrites may speak a word of truth. I said to Mu’adh b. jabal: I am at a loss to understand may Allah have mercy on you that a learned man sometimes may speak a word of error and a hypocrite may speak a word of truth. He replied: Yes, avoid the speech of a learned man on distract you from him (the learned), for it is possible that he may withdraw (from these well-known things), and you get the truth when you hear it, for truth has light.Abu Dawud said: In this tradition Ma’mar on the authority of  al-Zuhrl said: The words “wa la yun iyannaka” instead of “wa la yuthniyannaka,” with the same meaning: “it may not distract you” salih b. Kaisan on the authority of al-Zurhrl said in this tradition the words “al-mushtaharat” (well-know things). He also said the word “La yuthniyannaka” as ‘Uqail mentioned. Ibn ishaq, on the authority of al-Zuhri, said: Yes, if you are doubtful about the speech of a scholar until you say: WHAT did he mean by this word?",
      "chain": [
        "38715",
        "20023",
        "11207",
        "11013",
        "11027"
      ]
    },
    {
      "hadith_no": "4653",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا قتيبة بن سعيد، ويزيد بن خالد الرملي، أن الليث، حدثهم عن أبي الزبير، عن جابر، عن رسول الله صلى الله عليه وسلم أنه قال ‏\"‏ لا يدخل النار أحد ممن بايع تحت الشجرة ‏\"‏ ‏.‏",
      "text_en": " Jabir reported the Messenger of Allah (ﷺ) as saying:                      No one of those who took the oath of allegiance under the tree will go to hell.",
      "chain": [
        "30367",
        "38715",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "5022",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا يزيد بن خالد الهمداني، وقتيبة بن سعيد الثقفي، قالا أخبرنا الليث، عن أبي الزبير، عن جابر، عن رسول الله صلى الله عليه وسلم أنه قال ‏\"‏ إذا رأى أحدكم الرؤيا يكرهها فليبصق عن يساره وليتعوذ بالله من الشيطان ثلاثا ويتحول عن جنبه الذي كان عليه ‏\"‏ ‏.‏",
      "text_en": " Jabir reported the Messenger of Allah (May peace be upon him) as saying :                      When one of you sees a vision which he dislikes, he must spit on his left (three times), seek refuge in Allah from the devil three times, and turn from the side on which he was lying.",
      "chain": [
        "38715",
        "30367",
        "20023",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "5056",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا قتيبة بن سعيد، ويزيد بن خالد بن موهب الهمداني، قالا حدثنا المفضل، - يعنيان ابن فضالة - عن عقيل، عن ابن شهاب، عن عروة، عن عائشة، رضى الله عنها أن النبي صلى الله عليه وسلم كان إذا أوى إلى فراشه كل ليلة جمع كفيه ثم نفث فيهما وقرأ فيهما ‏{‏ قل هو الله أحد ‏}‏ و ‏{‏ قل أعوذ برب الفلق ‏}‏ و ‏{‏ قل أعوذ برب الناس ‏}‏ ثم يمسح بهما ما استطاع من جسده يبدأ بهما على رأسه ووجهه وما أقبل من جسده يفعل ذلك ثلاث مرات ‏.‏",
      "text_en": " ‘A’ishah said :                      Every night when he prophet (May peace be upon him) went to his bed, he joined his hands and breathed into them, reciting into them:”say: he is Allah, One” and say ; I seek refuge in the Lord of the dawn and Say: I seek refuge in the Lord of men. Then he would wipe as much of his body as he could with his hands, beginning with his head, his face and the front of his body, doing that three times.",
      "chain": [
        "30367",
        "38715",
        "11207",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "4975",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرنا خالد بن روح الدمشقي، قال حدثنا يزيد، - يعني ابن خالد بن يزيد بن عبد الله بن موهب - قال حدثنا شبابة، عن المغيرة بن مسلم، عن أبي الزبير، عن جابر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ليس على مختلس ولا منتهب ولا خائن قطع ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Jabir said:                     \"The Messenger of Allah said: 'The hand of the pilferer, robber and traitor is not to be cut off.\"'",
      "chain": [
        "38715",
        "20426",
        "11263",
        "34"
      ]
    }
  ],
  "total_hadiths": 43
}