{
  "id": "38834",
  "name": "Hajjaj bin Yusuf bin al-Sha'ir حجاج بن يوسف الشاعر",
  "full_name": "Hajjaj bin Yusuf bin al-Sha'ir حجاج بن يوسف الشاعر",
  "grade": "3rd Century AH",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "259",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Baghdad"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [م  د  مسلم  وأبي  داود]"
    ],
    "tags": [
      "al-Thaqafi",
      "Baghdadi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20381",
      "name": "Hajjaj bin Muhammad al-Musaysi حجاج بن محمد المصيصي الأعور",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20383",
      "name": "al-Hasan bin Musa al-'Ashayb الحسن بن موسى الأشيب",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20260",
      "name": "'Ubaidullah bin Abd عبيد الله بن عبد المجيد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20426",
      "name": "Shababa bin Sawar شبابة بن سوار الفزاري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20262",
      "name": "'Uthman bin 'Umar bin Fars عثمان بن عمر بن فارس",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20472",
      "name": "Yazid bin Harun يزيد بن هارون",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20355",
      "name": "Muhammad bin 'Abdullah bin al-Zubair محمد بن عبد الله أبو أحمد الزبيري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20121",
      "name": "'Abdur-Razzaq عبد الرزاق بن همام",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20547",
      "name": "Sulaiman bin Da'ud bin al-Jarud سليمان بن داود أبو داود الطيالسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20443",
      "name": "Abu 'Amir al-'Aqdi عبد الملك بن عمرو القيسي أبو عامر العقدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "40",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "وحدثني حجاج بن الشاعر، حدثنا شبابة، قال قال شعبة وقد لقيت شهرا فلم أعتد به ‏.‏",
      "text_en": "",
      "chain": [
        "38834",
        "20426"
      ]
    },
    {
      "hadith_no": "54",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "وحدثني حجاج بن الشاعر، حدثنا أحمد، - يعني ابن يونس - حدثنا زائدة، عن الأعمش، عن إبراهيم، أن الحارث، قال تعلمت القرآن في ثلاث سنين والوحى في سنتين - أو قال الوحى في ثلاث سنين والقرآن في سنتين ‏.‏",
      "text_en": "",
      "chain": [
        "38834",
        "30184",
        "20320",
        "11060",
        "11051"
      ]
    },
    {
      "hadith_no": "63",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "وحدثني حجاج بن الشاعر، حدثنا أحمد بن يونس، قال سمعت زهيرا، يقول قال جابر - أو سمعت جابرا، يقول - إن عندي لخمسين ألف حديث ما حدثت منها بشىء ‏.‏ قال ثم حدث يوما بحديث فقال هذا من الخمسين ألفا ‏.‏",
      "text_en": "",
      "chain": [
        "38834",
        "30184",
        "20321",
        "34"
      ]
    },
    {
      "hadith_no": "69",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "حدثني حجاج بن الشاعر، حدثنا سليمان بن حرب، حدثنا حماد بن زيد، قال قال أيوب إن لي جارا - ثم ذكر من فضله - ولو شهد عندي على تمرتين ما رأيت شهادته جائزة ‏.‏",
      "text_en": "",
      "chain": [
        "38834",
        "20193",
        "20022",
        "11015"
      ]
    },
    {
      "hadith_no": "70",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "وحدثني محمد بن رافع، وحجاج بن الشاعر، قالا حدثنا عبد الرزاق، قال قال معمر ما رأيت أيوب اغتاب أحدا قط إلا عبد الكريم - يعني أبا أمية - فإنه ذكره فقال رحمه الله كان غير ثقة لقد سألني عن حديث لعكرمة ثم قال سمعت عكرمة ‏.‏",
      "text_en": "",
      "chain": [
        "30375",
        "38834",
        "20121"
      ]
    },
    {
      "hadith_no": "77",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "وحدثني حجاج بن الشاعر، حدثنا سليمان بن حرب، حدثنا ابن زيد، - يعني حمادا - قال قيل لأيوب إن عمرو بن عبيد روى عن الحسن قال لا يجلد السكران من النبيذ ‏.‏ فقال كذب أنا سمعت الحسن يقول يجلد السكران من النبيذ ‏.‏",
      "text_en": "",
      "chain": [
        "38834",
        "20193",
        "24341",
        "11016",
        "11016"
      ]
    },
    {
      "hadith_no": "105",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني حجاج بن الشاعر، حدثنا يونس بن محمد، حدثنا المعتمر، عن أبيه، عن يحيى بن يعمر، عن ابن عمر، عن عمر، عن النبي صلى الله عليه وسلم بنحو حديثهم ‏.‏",
      "text_en": "",
      "chain": [
        "38834",
        "20393",
        "20288",
        "11289",
        "11316",
        "18",
        "3"
      ]
    },
    {
      "hadith_no": "118",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني حجاج بن الشاعر، والقاسم بن زكرياء، قالا حدثنا عبيد الله بن موسى، عن شيبان، عن الأعمش، عن أبي صالح، وأبي، سفيان عن جابر، قال قال النعمان بن قوقل يا رسول الله ‏.‏ بمثله ‏.‏ وزاد فيه ولم أزد على ذلك شيئا ‏.‏",
      "text_en": " A similar hadith is narrated on Jabir's authority in which the following words are added:                      I will do nothing more.",
      "chain": [
        "38834",
        "20340",
        "20240",
        "11060",
        "11161",
        "116",
        "34"
      ]
    },
    {
      "hadith_no": "301",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنيه حجاج بن الشاعر، حدثنا عبد الصمد، قال حدثني أبي، حدثنا داود، - يعني ابن أبي هند - حدثنا عاصم، عن صفوان بن محرز، عن أبي موسى، عن النبي صلى الله عليه وسلم ح",
      "text_en": "",
      "chain": [
        "38834",
        "20250",
        "20258",
        "11585",
        "11080",
        "11693",
        "41"
      ]
    },
    {
      "hadith_no": "412",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا الوليد بن شجاع، وهارون بن عبد الله، وحجاج بن الشاعر، قالوا حدثنا حجاج، - وهو ابن محمد - عن ابن جريج، قال أخبرني أبو الزبير، أنه سمع جابر بن عبد الله، يقول سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ لا تزال طائفة من أمتي يقاتلون على الحق ظاهرين إلى يوم القيامة - قال - فينزل عيسى ابن مريم صلى الله عليه وسلم فيقول أميرهم تعال صل لنا ‏.‏ فيقول لا ‏.‏ إن بعضكم على بعض أمراء ‏.‏ تكرمة الله هذه الأمة ‏\"‏ ‏.‏",
      "text_en": " Jabir b. 'Abdullah reported:                      I heard the Messenger of Allah (may peace be upon him) say: A section of my people will not cease fighting for the Truth and will prevail till the Day of Resurrection. He said: Jesus son of Mary would then descend and their (Muslims') commander would invite him to come and lead them in prayer, but he would say: No, some amongst you are commanders over some (amongst you). This is the honour from Allah for this Ummah.",
      "chain": [
        "30482",
        "30524",
        "38834",
        "20381",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "462",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن بشار، حدثنا معاذ بن هشام، حدثنا أبي ح، وحدثني حجاج بن الشاعر، حدثنا عفان بن مسلم، حدثنا همام، كلاهما عن قتادة، عن عبد الله بن شقيق، قال قلت لأبي ذر لو رأيت رسول الله صلى الله عليه وسلم لسألته فقال عن أى شىء كنت تسأله قال كنت أسأله هل رأيت ربك قال أبو ذر قد سألت فقال ‏\"‏ رأيت نورا ‏\"‏ ‏.‏",
      "text_en": " Abdullah b. Shaqiq reported:                      I said to Abu Dharr: Had I seen the Messenger of Allah, I would have asked him. He (Abu Dharr) said: What is that thing that you wanted to inquire of him? He said: I wanted to ask him whether he had seen his Lord. Abu Dharr said: I, in fact, inquired of him, and he replied: I saw Light.",
      "chain": [
        "30160",
        "20287",
        "20295",
        "38834",
        "30106",
        "11019",
        "10694"
      ]
    },
    {
      "hadith_no": "476",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا عفان، حدثنا وهيب، ح وحدثنا حجاج بن الشاعر، حدثنا عمرو بن عون، أخبرنا خالد، كلاهما عن عمرو بن يحيى، بهذا الإسناد وقالا فيلقون في نهر يقال له الحياة ‏.‏ ولم يشكا ‏.‏ وفي حديث خالد كما تنبت الغثاءة في جانب السيل ‏.‏ وفي حديث وهيب كما تنبت الحبة في حمئة أو حميلة السيل ‏.‏",
      "text_en": " This hadith is transmitted by 'Amr b. Yahya with the same chain of transmitters who narrated:                      They would be cast into the river which is called (the river of) life, and (both the narrators) did not doubt the hadith. The text transmitted by Khalid is: just as seeds sprout beside the flood water; and in the hadith of Wuhaib it is: Just as the seed sprouts in the silt or deposit left by flood.",
      "chain": [
        "30201",
        "30106",
        "20299",
        "38834",
        "30154"
      ]
    },
    {
      "hadith_no": "492",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا حجاج بن الشاعر، حدثنا أبو أحمد الزبيري، حدثنا قيس بن سليم العنبري، قال حدثني يزيد الفقير، حدثنا جابر بن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن قوما يخرجون من النار يحترقون فيها إلا دارات وجوههم حتى يدخلون الجنة ‏\"‏ ‏.‏",
      "text_en": " Jabir b. 'Abdullah repotted:                      The Messenger of Allah (may peace be upon him) said: Verily people would be brought out from the Fire, and they would be burnt except the exterior (surfaces, fronts) of their faces; and they would enter Paradise.",
      "chain": [
        "38834",
        "20355",
        "20600",
        "11665",
        "34"
      ]
    },
    {
      "hadith_no": "493",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا حجاج بن الشاعر، حدثنا الفضل بن دكين، حدثنا أبو عاصم، - يعني محمد بن أبي أيوب - قال حدثني يزيد الفقير، قال كنت قد شغفني رأى من رأى الخوارج فخرجنا في عصابة ذوي عدد نريد أن نحج ثم نخرج على الناس - قال - فمررنا على المدينة فإذا جابر بن عبد الله يحدث القوم - جالس إلى سارية - عن رسول الله صلى الله عليه وسلم قال فإذا هو قد ذكر الجهنميين - قال - فقلت له يا صاحب رسول الله ما هذا الذي تحدثون والله يقول ‏{‏ إنك من تدخل النار فقد أخزيته‏}‏ و ‏{‏ كلما أرادوا أن يخرجوا منها أعيدوا فيها‏}‏ فما هذا الذي تقولون قال فقال أتقرأ القرآن قلت نعم ‏.‏ قال فهل سمعت بمقام محمد - عليه السلام - يعني الذي يبعثه الله فيه قلت نعم ‏.‏ قال فإنه مقام محمد صلى الله عليه وسلم المحمود الذي يخرج الله به من يخرج ‏.‏ - قال - ثم نعت وضع الصراط ومر الناس عليه - قال - وأخاف أن لا أكون أحفظ ذاك - قال - غير أنه قد زعم أن قوما يخرجون من النار بعد أن يكونوا فيها - قال - يعني فيخرجون كأنهم عيدان السماسم ‏.‏ قال فيدخلون نهرا من أنهار الجنة فيغتسلون فيه فيخرجون كأنهم القراطيس ‏.‏ فرجعنا قلنا ويحكم أترون الشيخ يكذب على رسول الله صلى الله عليه وسلم فرجعنا فلا والله ما خرج منا غير رجل واحد أو كما قال أبو نعيم ‏.‏",
      "text_en": " Yazid al-Faqir said:                      This view of the Khwarij (i. e. those who commit major sins and would be eternally doomed to Hell) had obsessed me, and we set out in a large group intending to perform the hajj and then going to the people (for the propagation of the views of the Khwarij). He (the narrator) said: We happened to past by Medina and found there Jabir b. 'Abdullah sitting near a column narrating to the people (the ahadith of) the Holy Prophet (may peace be upon him). When he mentioned the inhabitants of Hell, I said: O companion of the Messenger of Allah what is this that thou narrateth, whereas Allah sayeth:\" Verily whomsoever Thou shall commit to the Fire, Thou indeed humillateth him\" (al-Qur'an, iii. 192) ; and All those who endeavoured to get out of that would be thrown back into it\" (al-Qur'an, xxxi i. 20)? So what is it that you say? He said: Have you read the Qur'an? I said: Yes. He said: Have you heard about' the (exalted) position of Muhammad (may peace be upon him), i. e. to which Allah would raise, him? I said: Yes. He said: Verily the position of Muhammad (may peace be upon him) is that of great glory and that is by which Allah would bring out whornsoever He would wish to bring out. He then described the Path (the Bridge) and the passing of the people over it, and said: I am afraid I may not have remembered (other things) but this much is still in my memory that people would come out of the Hell after having gone into it, and he said: They would come out of it as if they were the wood of the ebony tree. He (the narrator said: They would enter a river, one or the rivers of Paradise, and would bathe in it, and then come out as if they were (white like) paper. We then turned back and said: Woe be upon you! How can this old man tell a lie against the Messenger of Allah (may peace be upon him)? We turned back (from the views of the Khwarij), and by God every one of us abandoned this (band of Khwarij) except one man. A similar statement has been made by Abu Nu'aim.",
      "chain": [
        "38834",
        "20348",
        "11665"
      ]
    },
    {
      "hadith_no": "1290",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني حجاج بن الشاعر، حدثنا عبد الرزاق، أخبرنا الثوري، عن علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، أن رجلا، نشد في المسجد فقال من دعا إلى الجمل الأحمر ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ لا وجدت ‏.‏ إنما بنيت المساجد لما بنيت له ‏\"‏ ‏.‏",
      "text_en": " Sulaiman b. Buraida narrated it on the authority of his father that a man cried out in the mosque saying:                      Who had called out for the red camel? Upon this the Apostle of Allah (may peace be upon him) said: May it not be restored to you! The mosques are built for what they are meant.",
      "chain": [
        "38834",
        "20121",
        "20012",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "hadith_no": "1319",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني حجاج بن الشاعر، حدثنا هارون بن إسماعيل الخزاز، حدثنا علي، - وهو ابن المبارك - حدثنا يحيى، حدثنا أبو سلمة، حدثنا أبو هريرة، أن رسول الله صلى الله عليه وسلم صلى ركعتين من صلاة الظهر ثم سلم فأتاه رجل من بني سليم فقال يا رسول الله أقصرت الصلاة أم نسيت وساق الحديث ‏.‏",
      "text_en": " Abu Huraira reported:                      The Messenger of Allah (may peace be upon him) said two rak'ahs of the noon prayer and then gave salutation when a man from Band Sulaim came to him and said: Messenger of Allah. has the prayer been shortened, or have you forgotten? -and the rest of the hadith is the same.",
      "chain": [
        "38834",
        "20449",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1477",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثني إسحاق بن إبراهيم، ومحمد بن حاتم، كلاهما عن محمد بن بكر، ح قال وحدثني هارون بن عبد الله، حدثنا حجاج بن محمد، ح قال وحدثني حجاج بن الشاعر، ومحمد بن رافع، قالا حدثنا عبد الرزاق، - وألفاظهم متقاربة - قالوا جميعا عن ابن جريج، قال أخبرني المغيرة بن حكيم، عن أم كلثوم بنت أبي بكر، أنها أخبرته عن عائشة، قالت أعتم النبي صلى الله عليه وسلم ذات ليلة حتى ذهب عامة الليل وحتى نام أهل المسجد ثم خرج فصلى فقال ‏\"‏ إنه لوقتها لولا أن أشق على أمتي ‏\"‏ ‏.‏ وفي حديث عبد الرزاق ‏\"‏ لولا أن يشق على أمتي ‏\"‏ ‏.‏",
      "text_en": " 'A'isha reported:                      The Apostle of Allah (may peace be upon him) one night delayed (observing the 'Isya' prayer) till a great part of the night was over and the people in the mosque had gone to sleep. He (the Holy Prophet) then came out and observed prayer and said: This is the proper time for it; were it not that I would impose a burden on my people (I would normally pray at this time). In the hadith transmitters by 'Abd al-Razzaq (the words are):\" Were it not that it would impose burden on my people.\"",
      "chain": [
        "30123",
        "38487",
        "20277",
        "30524",
        "20381",
        "38834",
        "30375",
        "11070",
        "10966",
        "10500"
      ]
    },
    {
      "hadith_no": "1481",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني حجاج بن الشاعر، حدثنا أبو زيد، سعيد بن الربيع حدثنا قرة بن خالد، عن قتادة، عن أنس بن مالك، قال نظرنا رسول الله صلى الله عليه وسلم ليلة حتى كان قريب من نصف الليل ثم جاء فصلى ثم أقبل علينا بوجهه فكأنما أنظر إلى وبيص خاتمه في يده من فضة ‏.‏",
      "text_en": " Anas b. Malik reported:                      We waited for the Messenger of Allah (may peace be upon hi n) one night, till it was about midnight. He (the Holy Prophet) came and observed prayer and then turned his face towards us, as it I was seeing the lustre of the silver ring on his finger.",
      "chain": [
        "38834",
        "20231",
        "11301",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "1550",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا حجاج بن الشاعر، حدثنا روح بن عبادة، حدثنا زكرياء بن إسحاق، حدثنا أبو الزبير، قال سمعت جابر بن عبد الله، قال كانت ديارنا نائية عن المسجد، فأردنا أن نبيع، بيوتنا فنقترب من المسجد فنهانا رسول الله صلى الله عليه وسلم فقال ‏\"‏ إن لكم بكل خطوة درجة ‏\"‏ ‏.‏",
      "text_en": " Jabir b. 'Abdullah narrated:                      Our houses were situated far away from the mosque; we, therefore, decided to sell our houses so that we may be able to come near the mosque. The Messenger of Allah (may peace be upon him) forbade us (to do so) and said: There is for every step (towards the mosque) a degree (of reward) for you.",
      "chain": [
        "38834",
        "20229",
        "11244",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "1703",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني حجاج بن الشاعر، حدثنا معلى بن أسد، حدثنا وهيب بن خالد، عن جعفر بن محمد، عن أبيه، عن أبي مرة، مولى عقيل عن أم هانئ، أن رسول الله صلى الله عليه وسلم صلى في بيتها عام الفتح ثماني ركعات في ثوب واحد قد خالف بين طرفيه ‏.‏",
      "text_en": " Abu Murra narrated on the authority of Umm Hani that the Messenger of Allah (may peace be upon him) on the day of the Conquest of Mecca observed in her house eight rak'abs of prayer in one cloth, its opposite corners having been tied from the opposite sides.",
      "chain": [
        "38834",
        "30457",
        "20299",
        "10898",
        "11442",
        "11237",
        "198"
      ]
    },
    {
      "hadith_no": "1811",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثني حجاج بن الشاعر، حدثنا محاضر أبو المورع، حدثنا سعد بن سعيد، قال أخبرني ابن مرجانة، قال سمعت أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ ينزل الله في السماء الدنيا لشطر الليل أو لثلث الليل الآخر فيقول من يدعوني فأستجيب له أو يسألني فأعطيه ‏.‏ ثم يقول من يقرض غير عديم ولا ظلوم ‏\"‏ ‏.‏ قال مسلم ابن مرجانة هو سعيد بن عبد الله ومرجانة أمه ‏.‏  حدثنا هارون بن سعيد الأيلي، حدثنا ابن وهب، قال أخبرني سليمان بن بلال، عن سعد بن سعيد، بهذا الإسناد وزاد ‏\"‏ ثم يبسط يديه تبارك وتعالى يقول من يقرض غير عدوم ولا ظلوم ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id and Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      Allah waits till when one-third of the first part of the night is over; He descends to the lowest heaven and says: It there any supplicator of forgiveness? Is there any penitant? Is there any petitioner (for mercy and favour)? Is there any solicitor? -till it is daybreak.",
      "chain": [
        "38834",
        "13"
      ]
    },
    {
      "hadith_no": "1841",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني حجاج بن الشاعر، حدثني محمد بن جعفر المدائني أبو جعفر، حدثنا ورقاء، عن محمد بن المنكدر، عن جابر بن عبد الله، قال كنت مع رسول الله صلى الله عليه وسلم في سفر فانتهينا إلى مشرعة فقال ‏\"‏ ألا تشرع يا جابر ‏\"‏ ‏.‏ قلت بلى - قال - فنزل رسول الله صلى الله عليه وسلم وأشرعت - قال - ثم ذهب لحاجته ووضعت له وضوءا - قال - فجاء فتوضأ ثم قام فصلى في ثوب واحد خالف بين طرفيه فقمت خلفه فأخذ بأذني فجعلني عن يمينه ‏.‏",
      "text_en": " 'A'isha reported that when the Messenger of Allah (may peace be upon him) stood up at night to pray, he began his prayer with two short rak'ahs.",
      "chain": [
        "38834",
        "20173",
        "20363",
        "11048",
        "34"
      ]
    },
    {
      "hadith_no": "1895",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني حسن بن علي الحلواني، وحجاج بن الشاعر، - وتقاربا في اللفظ - قالا حدثنا يعقوب بن إبراهيم، حدثنا أبي، حدثنا يزيد بن الهاد، أن عبد الله بن خباب، حدثه أن أبا سعيد الخدري حدثه أن أسيد بن حضير بينما هو ليلة يقرأ في مربده إذ جالت فرسه فقرأ ثم جالت أخرى فقرأ ثم جالت أيضا قال أسيد فخشيت أن تطأ يحيى فقمت إليها فإذا مثل الظلة فوق رأسي فيها أمثال السرج عرجت في الجو حتى ما أراها - قال - فغدوت على رسول الله صلى الله عليه وسلم فقلت يا رسول الله بينما أنا البارحة من جوف الليل أقرأ في مربدي إذ جالت فرسي ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ اقرإ ابن حضير ‏\"‏ ‏.‏ قال فقرأت ثم جالت أيضا ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ اقرإ ابن حضير ‏\"‏ ‏.‏ قال فقرأت ثم جالت أيضا ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ اقرإ ابن حضير ‏\"‏ ‏.‏ قال فانصرفت ‏.‏ وكان يحيى قريبا منها خشيت أن تطأه فرأيت مثل الظلة فيها أمثال السرج عرجت في الجو حتى ما أراها فقال رسول الله صلى الله عليه وسلم ‏\"‏ تلك الملائكة كانت تستمع لك ولو قرأت لأصبحت يراها الناس ما تستتر منهم ‏\"‏ ‏.‏",
      "text_en": " Abu Musa al-Ash'ari reported Allah's Messenger (may peace be upon him) as saying:                      A believer who recites the Qur'an is like an orange whose fragrance is sweet and whose taste is sweet; a believer who does not recite the Qur'an is like a date which has no fragrance but has a sweet taste; and the hypocrite who recites the Qur'an is like a basil whose fragrance is sweet, but whose taste is bitter; and a hypocrite who does not recite the Qur'an is like the colocynth which has no fragrance and has a bitter taste.",
      "chain": [
        "38834",
        "20184",
        "20150",
        "11234",
        "11182",
        "38",
        "45"
      ]
    },
    {
      "hadith_no": "2228",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "حدثنا هارون بن عبد الله، وحجاج بن الشاعر، قالا حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني أبو الزبير، أنه سمع جابر بن عبد الله، يحدث أن النبي صلى الله عليه وسلم خطب يوما فذكر رجلا من أصحابه قبض فكفن في كفن غير طائل وقبر ليلا فزجر النبي صلى الله عليه وسلم أن يقبر الرجل بالليل حتى يصلى عليه إلا أن يضطر إنسان إلى ذلك وقال النبي صلى الله عليه وسلم ‏\"‏ إذا كفن أحدكم أخاه فليحسن كفنه ‏\"‏ ‏.‏",
      "text_en": " Jabir b. 'Abdullah reported:                      Allah's Messenger (may peace be upon him) one day in the course of his sermon made mention of a person among his Companions who had died and had been wrapped in a shroud not long (enough to cover his whole body) and was buried during the night. The Apostle of Allah (may peace be upon him) reprimanded (the audience) that a person was buried during the night (in a state that) funeral prayer could not be offered (over him by the Messenger of Allah). (And this is permissible only) when it becomes a dire necessity for a man. The Apostle of Allah (may peace be upon him) also said: When any one of you shrouds his brother, he should shroud him well.",
      "chain": [
        "30524",
        "38834",
        "20381",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "2559",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثني حجاج بن الشاعر، حدثنا حسن الأشيب، حدثنا شيبان، عن يحيى، قال وأخبرني أبو سلمة، أنه سمع ابن عمر، - رضى الله عنهما - يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ الشهر تسع وعشرون ‏\"‏ ‏.‏",
      "text_en": " Ibn Umar (Allah be pleased with both of them) reported Allah's Messenger (may peace be upon him) as saying:                      The month may consist of twenty-nine days.",
      "chain": [
        "38834",
        "20240",
        "11449",
        "10567",
        "18"
      ]
    },
    {
      "hadith_no": "2574",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثني هارون بن عبد الله، وحجاج بن الشاعر، قالا حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني أبو الزبير، أنه سمع جابر بن عبد الله، - رضى الله عنهما - يقول اعتزل النبي صلى الله عليه وسلم نساءه شهرا فخرج إلينا صباح تسع وعشرين فقال بعض القوم يا رسول الله إنما أصبحنا لتسع وعشرين ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ إن الشهر يكون تسعا وعشرين ‏\"‏ ‏.‏ ثم طبق النبي صلى الله عليه وسلم بيديه ثلاثا مرتين بأصابع يديه كلها والثالثة بتسع منها ‏.‏",
      "text_en": " Abu Zubair is reported to have heard Jabir b. 'Abdullah (Allah be pleased with both of them) as saying:                      The Apostle of Allah (may peace be upon him) separated himself from his wives for a month. (His wives said: ) He came to us on the morning of the twenty-ninth. Upon this some, of the people said: It is the morning of twenty- ninth (according to our calculation). Upon this the Apostle of Allah (may peace be upon him) said: The month. may also consist of twenty-nine days. The Apostle of Allah (may peace be upon him) then flapped his bands thrice, twice with all the fingers of both his hand (to indicate twenty-nine) and by the third time with nine (fingers).",
      "chain": [
        "30524",
        "38834",
        "20381",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "3083",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا حجاج بن الشاعر، حدثنا معلى بن أسد، حدثنا وهيب بن خالد، عن داود، عن أبي نضرة، عن جابر، وعن أبي سعيد الخدري، - رضى الله عنهما - قالا قدمنا مع النبي صلى الله عليه وسلم ونحن نصرخ بالحج صراخا ‏.‏",
      "text_en": " jibir and Abil Salld al-Khudri (Allah be pleased with them) reported:                      We went with Allah's Apostle (may peace be upon him) and we were pronouncing Talbiya for Hajj loudly.",
      "chain": [
        "38834",
        "30457",
        "20299",
        "10721",
        "34",
        "38"
      ]
    },
    {
      "hadith_no": "3367",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني حجاج بن الشاعر، حدثنا الضحاك بن مخلد، أخبرنا ابن جريج، بهذا الإسناد مثله ‏.‏",
      "text_en": " Ibn Juraij narrated this hadith with the same chain of transmitters.",
      "chain": [
        "38834"
      ]
    },
    {
      "hadith_no": "3624",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثني حجاج بن الشاعر، حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن ابن عون، قال حدثت محمدا، عن إبراهيم، بحديث عبد الرحمن بن بشر - يعني حديث العزل - فقال إياى حدثه عبد الرحمن بن بشر، ‏.‏",
      "text_en": " Ibn 'Aun reported:                      I reported to Muhammad on the authority of Ibrahim the hadith reported by 'Abd al-Rahmann b. Bishr (the hadith concerning 'azl), where- upon he said: That (hadith) Abd al-Rahman b. Bishr had narrated to me (also).",
      "chain": [
        "38834",
        "20193",
        "20022",
        "11071"
      ]
    },
    {
      "hadith_no": "3631",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثنا حجاج بن الشاعر، حدثنا أبو أحمد الزبيري، حدثنا سعيد بن حسان، قاص أهل مكة أخبرني عروة بن عياض بن عدي بن الخيار النوفلي، عن جابر بن عبد، الله قال جاء رجل إلى النبي صلى الله عليه وسلم بمعنى حديث سفيان ‏.‏",
      "text_en": " Jabir b. 'Abdullah (Allah be pleased with them) reported:                      A person came to Allah's Apostle (the rest of the hadith is the same).",
      "chain": [
        "38834",
        "20355",
        "10639",
        "10650",
        "34"
      ]
    },
    {
      "hadith_no": "4004",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "وحدثني حجاج بن الشاعر، حدثنا عبيد الله بن عبد المجيد، حدثنا سليم بن، حيان حدثنا سعيد بن ميناء، قال سمعت جابر بن عبد الله، يقول إن رسول الله صلى الله عليه وسلم قال ‏\"‏ من كان له فضل أرض فليزرعها أو ليزرعها أخاه ولا تبيعوها ‏\"‏ ‏.‏ فقلت لسعيد ما قوله ولا تبيعوها يعني الكراء ‏.‏ قال نعم ‏.‏",
      "text_en": " Jabir b. Abdullah (Allah be pleased with them) heard Allah's Messenger (may peace be upon him) say:                      He who has surplus of land should either cultivate it himself, or let his brother cultivate it, an should not sell it. I (the narrator) said to Sa'id: What does his statement\" do not sell it\" mean? Does it imply\" rent\"? He said: Yes.",
      "chain": [
        "38834",
        "20234",
        "11510",
        "34"
      ]
    },
    {
      "hadith_no": "4023",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "وحدثني ابن أبي خلف، وحجاج بن الشاعر، قالا حدثنا زكرياء بن عدي، أخبرنا عبيد الله بن عمرو، عن زيد، عن الحكم، عن نافع، عن ابن عمر، أنه أتى رافعا فذكر هذا الحديث عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Nafi, reported from Ibn Umar (Allah be pleated with them) that he came to Rafi and he narrated this hadith from Allah's Apostle (may peace be upon him).",
      "chain": [
        "38834",
        "30464",
        "30024",
        "15",
        "11069",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "4075",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "وحدثني محمد بن أحمد بن أبي خلف، وحجاج بن الشاعر، قالا حدثنا أبو سلمة، الخزاعي - قال حجاج منصور بن سلمة - أخبرنا سليمان بن بلال، عن خثيم بن عراك، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا أفلس الرجل فوجد الرجل عنده سلعته بعينها فهو أحق بها ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      When a inan becomes insolvent, and the other person (seller) finds his goods intact with him, he is more entitled to get them than anyone else.",
      "chain": [
        "30560",
        "38834",
        "30279",
        "20160",
        "11504",
        "11204",
        "13"
      ]
    },
    {
      "hadith_no": "4472",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Oath; for Establishing the Responsibility of Murders; Fighting; Requital - كتاب القسامة والمحاربين والقصاص والديات",
      "chapter_no": "29",
      "text_ar": "وحدثني حجاج بن الشاعر، والقاسم بن زكرياء، قالا حدثنا عبيد الله بن موسى، عن شيبان، عن الأعمش، بالإسنادين جميعا ‏.‏ نحو حديث سفيان ولم يذكرا في الحديث قوله ‏\"‏ والذي لا إله غيره ‏\"‏ ‏.‏",
      "text_en": " This hadith has been reported on the authority of A'mash with the same chain of narrators but with a slight variation of words, i. e. he did not say:                      By Him besides Whom there is no god.",
      "chain": [
        "38834",
        "20340",
        "20240"
      ]
    },
    {
      "hadith_no": "4620",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "وحدثني حجاج بن الشاعر، حدثني عبد الصمد بن عبد الوارث، حدثنا شعبة، حدثني علقمة بن مرثد، أن سليمان بن بريدة، حدثه عن أبيه، قال كان رسول الله صلى الله عليه وسلم إذا بعث أميرا أو سرية دعاه فأوصاه ‏.‏ وساق الحديث بمعنى حديث سفيان ‏.‏",
      "text_en": " Sulaiman b. Buraida repotted on the authority of his father that when Allah's Messenger (may peace be upon him) sent an Amir with a detachment he called him and advised him. The rest of the hadith is the same.",
      "chain": [
        "38834",
        "20250",
        "20020",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "hadith_no": "4644",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "وحدثني حجاج بن الشاعر، حدثنا عبد الصمد، حدثنا حماد، عن ثابت، عن أنس، أن رسول الله صلى الله عليه وسلم كان يقول يوم أحد ‏\"‏ اللهم إنك إن تشأ لا تعبد في الأرض ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Anas that the Messenger of Allah (may peace be upon him) said on the day of the Battle of Ubud:                      O Allah, if Thou wilt (defeat Muslims), there will be none on the earth to worship Thee.",
      "chain": [
        "38834",
        "20250",
        "20022",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "4928",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثني حجاج بن الشاعر، ومحمد بن رافع، قالا حدثنا شبابة، حدثنا شعبة، عن قتادة، عن سعيد بن المسيب، عن أبيه، قال لقد رأيت الشجرة ثم أتيتها بعد فلم أعرفها.",
      "text_en": " The tradition has been narrated on the authority of Sa'id b. Musayyib who learnt it from his father. The latter said:                      I had seen the tree. When I came to the spot afterwards, I could not recognise it.",
      "chain": [
        "38834",
        "30375",
        "20426",
        "20020",
        "11019",
        "11002",
        "2070"
      ]
    },
    {
      "hadith_no": "5063",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثني هارون بن عبد الله، وحجاج بن الشاعر، قالا حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني أبو الزبير، أنه سمع جابر بن عبد الله، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا تزال طائفة من أمتي يقاتلون على الحق ظاهرين إلى يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Jabir b. 'Abdullah who said:                      I heard the Messenger of Allah (may peace be upon him) say: A group of people from my Umma will continue to fight In defence of truth and remain triumphant until the Day of judgment.",
      "chain": [
        "30524",
        "38834",
        "20381",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "5104",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثني حجاج بن الشاعر، حدثنا سهل بن حماد، حدثنا شعبة، بهذا الإسناد مثله ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Shu'ba.",
      "chain": [
        "38834"
      ]
    },
    {
      "hadith_no": "5115",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثني حجاج بن الشاعر، حدثنا عثمان بن عمر، ح وحدثني محمد بن رافع، حدثنا أبو المنذر القزاز، كلاهما عن داود بن قيس، عن عبيد الله بن مقسم، عن جابر بن، عبد الله قال بعث رسول الله صلى الله عليه وسلم بعثا إلى أرض جهينة واستعمل عليهم رجلا وساق الحديث بنحو حديثهم ‏.‏",
      "text_en": " Jabir b. Abdullah reported that Allah's Messenger (may peace be upon him) sent an expedition to the land of the tribe of Juhaina, and appointed a person as a chief over them.",
      "chain": [
        "38834",
        "20262",
        "30375",
        "11845",
        "11521",
        "34"
      ]
    },
    {
      "hadith_no": "5229",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "وحدثني حجاج بن الشاعر، حدثنا الضحاك بن مخلد، عن سفيان، عن علقمة، بن مرثد عن ابن بريدة، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ كنت نهيتكم ‏\"‏ ‏.‏ فذكر بمعنى حديث أبي سنان ‏.‏",
      "text_en": " Ibn Buraida, on the authority of his father, reported Allah's Messenger (may peace be upon him) having said this:                      I used to forbid you. The rest of the hadith is the same.",
      "chain": [
        "38834",
        "20012",
        "11374",
        "11432",
        "3131"
      ]
    },
    {
      "hadith_no": "5234",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "وحدثني حجاج بن الشاعر، حدثني يحيى بن كثير العنبري أبو غسان، حدثنا  شعبة، عن مالك بن أنس، عن عمر بن مسلم، عن سعيد بن المسيب، عن أم سلمة، أن النبي صلى الله عليه وسلم قال ‏\"‏ إذا رأيتم هلال ذي الحجة وأراد أحدكم أن يضحي فليمسك عن شعره وأظفاره ‏\"‏ ‏.‏",
      "text_en": " Umm Salama reported (these words) directly from Allah's Messenger (may peace be upon him):                      If anyone has in his possession a sacrificial animal to offer as a sacrifice (on 'Id al-Adha), he should not get his hair cut and nails trimmed after he has entered the first days of Dhu'l Hijja",
      "chain": [
        "38834",
        "20302",
        "20020",
        "20001",
        "11002",
        "56"
      ]
    },
    {
      "hadith_no": "5326",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثنا حجاج بن الشاعر، حدثنا ضحاك بن مخلد، عن سفيان، عن علقمة بن، مرثد عن ابن بريدة، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ نهيتكم عن الظروف وإن الظروف - أو ظرفا - لا يحل شيئا ولا يحرمه وكل مسكر حرام ‏\"‏ ‏.‏",
      "text_en": " Ibn Buraida, on the authority of his father, reported Allah's Messenger (may peace be upon him) as saying:                      I had forbidden you (from the preparation of Nabidh) and drinking it in certain vessels, (but now you may do so if you like) for it is not vessels or a vessel that makes a thing lawful or unlawful. It is every intoxicant that is unlawful.",
      "chain": [
        "38834",
        "20012",
        "11374",
        "11432",
        "3131"
      ]
    },
    {
      "hadith_no": "5436",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثني حجاج بن الشاعر، حدثني الضحاك بن مخلد، من رقعة عارض لي بها ثم قرأه على قال أخبرناه حنظلة بن أبي سفيان حدثنا سعيد بن ميناء قال سمعت جابر بن عبد الله يقول لما حفر الخندق رأيت برسول الله صلى الله عليه وسلم خمصا فانكفأت إلى امرأتي فقلت لها هل عندك شىء فإني رأيت برسول الله صلى الله عليه وسلم خمصا شديدا ‏.‏ فأخرجت لي جرابا فيه صاع من شعير ولنا بهيمة داجن - قال - فذبحتها وطحنت ففرغت إلى فراغي فقطعتها في برمتها ثم وليت إلى رسول الله صلى الله عليه وسلم فقالت لا تفضحني برسول الله صلى الله عليه وسلم ومن معه - قال - فجئته فساررته فقلت يا رسول الله إنا قد ذبحنا بهيمة لنا وطحنت صاعا من شعير كان عندنا فتعال أنت في نفر معك ‏.‏ فصاح رسول الله صلى الله عليه وسلم وقال ‏\"‏ يا أهل الخندق إن جابرا قد صنع لكم سورا فحيهلا بكم ‏\"‏ ‏.‏ وقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تنزلن برمتكم ولا تخبزن عجينتكم حتى أجيء ‏\"‏ ‏.‏ فجئت وجاء رسول الله صلى الله عليه وسلم يقدم الناس حتى جئت امرأتي فقالت بك وبك ‏.‏ فقلت قد فعلت الذي قلت لي ‏.‏ فأخرجت له عجينتنا فبصق فيها وبارك ثم عمد إلى برمتنا فبصق فيها وبارك ثم قال ‏\"‏ ادعي خابزة فلتخبز معك واقدحي من برمتكم ولا تنزلوها ‏\"‏ ‏.‏ وهم ألف فأقسم بالله لأكلوا حتى تركوه وانحرفوا وإن برمتنا لتغط كما هي وإن عجينتنا - أو كما قال الضحاك - لتخبز كما هو ‏.‏",
      "text_en": " Jabir b. 'Abdullah reported:                      When the ditch was dug, I saw Allah's Messenger (may peace he upon him) feeling very hungry. I came to my wife and said to her: Is there anything with you? I have seen Allah's Messenger (may peace be upon him) feeling extremely hungry. She brought out a bag of provisions which contained a sa', of barley. We had also with us a lamb. I slaughtered it. She ground the flour. She finished (this work) along with me. I cut it into pieces and put it in the earthen pot and then returned to Allah's Apostle (may peace be upon him) (for inviting him). She said: Do not humiliate me in the presence of Allah's Messenger (may peace be upon him) and those who are with him. When I came to him I whispered to him saying: Allah's Messenger, we have slaughtered a lamb for you and she has ground a sa' of barley which we had with us. So you come along with a group of people with you. Thereupon Allah's Messenger (may peace be upon him) said loudly: O people of the ditch, Jabir has arranged a feast for you, so (come along). Allah's Messenger (may peace be upon him) said: Do not remove your earthen pot from the hearth and do not bake the bread from the kneaded flour until I come. So I came and Allah's Messenger (may peace be upon him) came and he was ahead of the people; and I came to my wife and she said (to me): You will be humbled. I said: I did what you had asked me to do. She (his wife) said: I brought out the kneaded flour and Allah's Messenger (may peace be upon him) put some saliva of his in that and blessed It. He then put saliva in the earthen pot and blessed it and then said. Call another baker who can bake with you. and bring out the soup from it, but do not remove it from the hearth, and the guests were one thousand. (Jabir said): I take an oath by Allah that all of them ate (the food to their fill) until they left it and went away and our earthen pot was brimming over as before, and so was the case with our flour, or as Dahhak (another narrator) said: It (the flour) was in the same condition and loaves had been prepared from that.",
      "chain": [
        "38834",
        "11510",
        "34"
      ]
    },
    {
      "hadith_no": "5445",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثني حجاج بن الشاعر، حدثنا يونس بن محمد، حدثنا حرب بن ميمون، عن  النضر بن أنس، عن أنس بن مالك، عن النبي صلى الله عليه وسلم في طعام أبي طلحة نحو حديثهم ‏.‏",
      "text_en": " Anas b. Malik reported this hadith pertaining to the entertainment of Allah's Messenger (may peace be upon him) by Abu Talha through another chain of transmitters.",
      "chain": [
        "38834",
        "20393",
        "24075",
        "11310",
        "19"
      ]
    },
    {
      "hadith_no": "5448",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثني حجاج بن الشاعر، وعبد بن حميد، جميعا عن عبد الرزاق، أخبرنا معمر، عن ثابت البناني، وعاصم الأحول، عن أنس بن مالك، أن رجلا، خياطا دعا رسول الله صلى الله عليه وسلم ‏.‏ وزاد قال ثابت فسمعت أنسا يقول فما صنع لي طعام بعد أقدر على أن يصنع فيه دباء إلا صنع ‏.‏",
      "text_en": " Anas b. Malik rdported that a tailor invited Allah's Messenger (may peace be upon him) to a feast. There has been an addition to this that Thabit said:                      I heard Anas saying that any meal that was prepared for me after that I tried that it should contain pumpkin.",
      "chain": [
        "38834",
        "30553",
        "20121",
        "20115",
        "11269",
        "11080",
        "19"
      ]
    },
    {
      "hadith_no": "5479",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثني حجاج بن الشاعر، وأحمد بن سعيد بن صخر، - واللفظ منهما قريب - قالا حدثنا أبو النعمان، حدثنا ثابت، - في رواية حجاج بن يزيد أبو زيد الأحول - حدثنا عاصم، عن عبد الله بن الحارث، عن أفلح، مولى أبي أيوب عن أبي أيوب، أن النبي صلى الله عليه وسلم نزل عليه فنزل النبي صلى الله عليه وسلم في السفل وأبو أيوب في العلو - قال - فانتبه أبو أيوب ليلة فقال نمشي فوق رأس رسول الله صلى الله عليه وسلم ‏.‏ فتنحوا فباتوا في جانب ثم قال للنبي صلى الله عليه وسلم فقال النبي صلى الله عليه وسلم ‏\"‏ السفل أرفق ‏\"‏ ‏.‏ فقال لا أعلو سقيفة أنت تحتها ‏.‏ فتحول النبي صلى الله عليه وسلم في العلو وأبو أيوب في السفل فكان يصنع للنبي صلى الله عليه وسلم طعاما فإذا جيء به إليه سأل عن موضع أصابعه فيتتبع موضع أصابعه فصنع له طعاما فيه ثوم فلما رد إليه سأل عن موضع أصابع النبي صلى الله عليه وسلم فقيل له لم يأكل ‏.‏ ففزع وصعد إليه فقال أحرام هو فقال النبي صلى الله عليه وسلم ‏\"‏ لا ولكني أكرهه ‏\"‏ ‏.‏ قال فإني أكره ما تكره أو ما كرهت ‏.‏ قال وكان النبي صلى الله عليه وسلم يؤتى ‏.‏",
      "text_en": " Aflah, the freed slave of Abu Ayyub Ansiri, reported:                      Allah's Messnger (may peace be upon him) had alighted in his house (viz. of Abu Ayyub Ansari at the time of his emigration to Medina) and he occupied the lower storey, whereas Abu Ayyub Ansari lived in the upper storey. One night, Abu Ayyub Ansari got up and said (to himself): (How unfortunate it is) that we walk above the head of Allah's Messenger (may peace be upon him), so they went aside and spent the night in a nook and then told Allah's Apostle (may peace be upon him) about it whereupon Allah's Apostle (may peace be upon him) said: The lower storey is more comfortable (for me). but he (Abu Ayyub Ansari) said: We (would not live) over the roof under which you live. So Allah's Messenger (may peace be upon him) shifted to the upper storey, whereas Abu Ayyub Ansari shifted to the lower storey; and he (Abu Ayyub Ansari) used to prepare food for Allah's Apostle (may peace be upon him) ; and when it was brought (back) to him he asked (to locate) the part, where his fingers had touched (the food), and he followed his fingers on that part where his fingers (those of the Holy Prophet) had touched it. (One day) he prepared food which contained garlic, and when it was returned to him he asked (to locate) the part which the fingers of Allah's Apostle (may peace be upon him) had touched. It was said to him that he had not eaten (the food). He (Abd Ayyub Ansari) was distressed and went up to him (to the Holy Prophet) and said: Is it forbidden? But Allah's Messenger (may peace be upon him) said: No, (it is not forbidden), but I do not like it. and he (Abu Ayyub Ansari) said: I also do not like what you do not like or which you did not like. He (Abu Ayyub Ansari) said: (The Holy Prophet did not eat garlic) as Allah's Apostle (may peace be upon him) was visited (by angels) and brought him the message of Allah.",
      "chain": [
        "38834",
        "30296",
        "20283",
        "11080",
        "912",
        "11830",
        "33"
      ]
    },
    {
      "hadith_no": "5540",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، وإسحاق بن إبراهيم الحنظلي، ويحيى بن حبيب، وحجاج بن الشاعر - واللفظ لابن حبيب - قال إسحاق أخبرنا وقال الآخرون، حدثنا روح بن عبادة، حدثنا ابن جريج، أخبرني أبو الزبير، أنه سمع جابر بن عبد الله، يقول لبس النبي صلى الله عليه وسلم يوما قباء من ديباج أهدي له ثم أوشك أن نزعه فأرسل به إلى عمر بن الخطاب فقيل له قد أوشك ما نزعته يا رسول الله ‏.‏ فقال ‏\"‏ نهاني عنه جبريل ‏\"‏ ‏.‏ فجاءه عمر يبكي فقال يا رسول الله كرهت أمرا وأعطيتنيه فما لي قال ‏\"‏ إني لم أعطكه لتلبسه إنما أعطيتكه تبيعه ‏\"‏ ‏.‏ فباعه بألفى درهم ‏.‏",
      "text_en": " Jabir b. Abdullah reported that one day Allah's Apostle (may peace be upon him) put on a cloak made of brocade, which had been presented to him. He then quickly put it off and sent it to 'Umar b. Khattab, and it was said to him:                      Messenger of Allah. why is it that you put it of immediately. whereupon he said: Gabriel forbade me from it (i. e. wearing of Ods garment), and 'Umar came to him weeping and said: Messenger of Allah you disapproved a thing but you gave it to me. What about me, then? Thereupon be (the Holy Prophet) Wd: I did not give it to you to wear it, but I gave you that you might sell it; and so he (Hadrat Umar) sold it for two thousand dirhams.",
      "chain": [
        "30212",
        "30021",
        "38834",
        "30312",
        "20229",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "5684",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "وحدثني محمد بن رافع، وحجاج بن الشاعر، وعبد بن حميد، عن عبد الرزاق، عن معمر، عن أيوب، ح وحدثنا أبو جعفر الدارمي، حدثنا أبو النعمان، حدثنا حماد بن، زيد عن عبد الرحمن السراج، كلهم عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم بذلك ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Ibn 'Umar through another chain of transmitters.",
      "chain": [
        "30375",
        "38834",
        "30553",
        "20121",
        "20115",
        "11015",
        "20283",
        "20022",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "5788",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثني هارون بن عبد الله، وحجاج بن الشاعر، قالا حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني أبو الزبير، أنه سمع جابر بن عبد الله، يقول سلم ناس من يهود على رسول الله صلى الله عليه وسلم فقالوا السام عليك يا أبا القاسم ‏.‏ فقال ‏\"‏ وعليكم ‏\"‏ ‏.‏ فقالت عائشة وغضبت ألم تسمع ما قالوا قال ‏\"‏ بلى قد سمعت فرددت عليهم وإنا نجاب عليهم ولا يجابون علينا ‏\"‏ ‏.‏",
      "text_en": " Jabir b. Abdullah reported that some people from amongst the Jews said to Allah's Messenger (may peace be upon him) Abu'l-Qasim. as-Sam-u-'Alaikum, whereupon he said:                      Wa 'Alaikum, A'isha was enraged and asked him (Allah's Apostle) whether he had not heard what they had said. He said, I did hear and I retorted to them (and the curse that I invoked upon them would receive response from Allah), but (the curse that they invoked upon us) would not be responded.",
      "chain": [
        "30524",
        "38834",
        "20381",
        "11070",
        "11263",
        "34"
      ]
    }
  ],
  "total_hadiths": 68
}