{
  "id": "39",
  "name": "Ubayy ibn Ka'b ( أبي بن كعب بن قيس ( رضي الله عنه",
  "full_name": "Ubayy ibn Ka'b ( أبي بن كعب بن قيس ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medinah"
    },
    "death": {
      "date_hijri": "32",
      "date_gregorian": "652",
      "date_display": null,
      "place": "Medinah",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medinah"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Tafsir/Quran",
      "Narrator [ ع  -  صحابة ]",
      "Fiqh",
      "Theology"
    ],
    "tags": [
      "Ansar",
      "Khazraj",
      "B.Malik B.al-Najjar",
      "B.Hudayla",
      "Aqaba 2",
      "Badr",
      "Uhud",
      "khandaq",
      "Scribe"
    ]
  },
  "parents": [],
  "spouses": [
    {
      "id": "1249",
      "name": "Umm al-Tufayl bint Tufayl ( أم الطفيل بنت الطفيل بن عمرو ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "siblings": [],
  "children": [
    {
      "id": "1220",
      "name": "Muhammad bin Ubayy ibn Ka'b ( محمد بن أبي بن كعب الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "1221",
      "name": "al-Tufayl bin Ubayy ibn Ka'b ( الطفيل بن أبي بن كعب الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [2nd Generation]"
    },
    {
      "id": "1222",
      "name": "al-Rabi' bin Ubayy ibn Ka'b ( الربيع بن أبي بن كعب الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA)"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "students": [
    {
      "id": "3",
      "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3319",
      "name": "Al Aswad bin Abdullah ( الأسود بن عبدالله السدوسي اليمامي ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "33",
      "name": "Abu Ayyub al-Ansari ( أبو أيوب الأنصاري خالد بن زيد ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "383",
      "name": "Sulaiman bin Sard ( سليمان بن صرد أبو مطرف الخزاعي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "399",
      "name": "Sahl bin Sa'd bin Malik ( سهل بن سعد الساعدي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "41",
      "name": "Abu Musa al-Asha'ari ( أبو موسى الأشعري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "1220",
      "name": "Muhammad bin Ubayy ibn Ka'b ( محمد بن أبي بن كعب الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "1221",
      "name": "al-Tufayl bin Ubayy ibn Ka'b ( الطفيل بن أبي بن كعب الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [2nd Generation]"
    },
    {
      "id": "1222",
      "name": "al-Rabi' bin Ubayy ibn Ka'b ( الربيع بن أبي بن كعب الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "136",
      "name": "Umm Habib bint Jahsh ( أم حبيبة بنت جحش ( رضي الله عنها",
      "grade": "Comp.(RA) [4th generation]"
    },
    {
      "id": "90",
      "name": "Thuwaybah ( ثويبة ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "118",
      "name": "Ja'far ibn Abi Sufyan ( ‎جعفر بن أبي سفيان بن الحارث ( رضي الله عنه",
      "grade": "Comp.(RA)"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "122",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا عبد الله بن محمد، قال حدثنا سفيان، قال حدثنا عمرو، قال أخبرني سعيد بن جبير، قال قلت لابن عباس إن نوفا البكالي يزعم أن موسى ليس بموسى بني إسرائيل، إنما هو موسى آخر‏.‏ فقال كذب عدو الله، حدثنا أبى بن كعب عن النبي صلى الله عليه وسلم قال ‏\"‏ قام موسى النبي خطيبا في بني إسرائيل، فسئل أى الناس أعلم فقال أنا أعلم‏.‏ فعتب الله عليه، إذ لم يرد العلم إليه، فأوحى الله إليه أن عبدا من عبادي بمجمع البحرين هو أعلم منك‏.‏ قال يا رب وكيف به فقيل له احمل حوتا في مكتل فإذا فقدته فهو ثم، فانطلق وانطلق بفتاه يوشع بن نون، وحملا حوتا في مكتل، حتى كانا عند الصخرة وضعا رءوسهما وناما فانسل الحوت من المكتل فاتخذ سبيله في البحر سربا، وكان لموسى وفتاه عجبا، فانطلقا بقية ليلتهما ويومهما فلما أصبح قال موسى لفتاه آتنا غداءنا، لقد لقينا من سفرنا هذا نصبا، ولم يجد موسى مسا من النصب حتى جاوز المكان الذي أمر به‏.‏ فقال له فتاه أرأيت إذ أوينا إلى الصخرة فإني نسيت الحوت، قال موسى ذلك ما كنا نبغي، فارتدا على آثارهما قصصا، فلما انتهيا إلى الصخرة إذا رجل مسجى بثوب  أو قال تسجى بثوبه  فسلم موسى‏.‏ فقال الخضر وأنى بأرضك السلام فقال أنا موسى‏.‏ فقال موسى بني إسرائيل قال نعم‏.‏ قال هل أتبعك على أن تعلمني مما علمت رشدا قال إنك لن تستطيع معي صبرا، يا موسى إني على علم من علم الله علمنيه لا تعلمه أنت، وأنت على علم علمكه لا أعلمه‏.‏ قال ستجدني إن شاء الله صابرا، ولا أعصي لك أمرا، فانطلقا يمشيان على ساحل البحر ليس لهما سفينة، فمرت بهما سفينة، فكلموهم أن يحملوهما، فعرف الخضر، فحملوهما بغير نول، فجاء عصفور فوقع على حرف السفينة، فنقر نقرة أو نقرتين في البحر‏.‏ فقال الخضر يا موسى، ما نقص علمي وعلمك من علم الله إلا كنقرة هذا العصفور في البحر‏.‏ فعمد الخضر إلى لوح من ألواح السفينة فنزعه‏.‏ فقال موسى قوم حملونا بغير نول، عمدت إلى سفينتهم فخرقتها لتغرق أهلها قال ألم أقل إنك لن تستطيع معي صبرا قال لا تؤاخذني بما نسيت‏.‏ فكانت الأولى من موسى نسيانا‏.‏ فانطلقا فإذا غلام يلعب مع الغلمان، فأخذ الخضر برأسه من أعلاه فاقتلع رأسه بيده‏.‏ فقال موسى أقتلت نفسا زكية بغير نفس قال ألم أقل لك إنك لن تستطيع معي صبرا  قال ابن عيينة وهذا أوكد  فانطلقا حتى إذا أتيا أهل قرية استطعما أهلها، فأبوا أن يضيفوهما، فوجدا فيها جدارا يريد أن ينقض فأقامه‏.‏ قال الخضر بيده فأقامه‏.‏ فقال له موسى لو شئت لاتخذت عليه أجرا‏.‏ قال هذا فراق بيني وبينك ‏\"‏‏.‏ قال النبي صلى الله عليه وسلم ‏\"‏ يرحم الله موسى، لوددنا لو صبر حتى يقص علينا من أمرهما ‏\"‏‏.‏",
      "text_en": " Narrated Sa`id bin Jubair:                     I said to Ibn `Abbas, \"Nauf-Al-Bakali claims that Moses (the companion of Khadir) was not the Moses of Bani Israel but he was another Moses.\" Ibn `Abbas remarked that the enemy of Allah (Nauf) was a liar.Narrated Ubai bin Ka`b:The Prophet said, \"Once the Prophet Moses stood up and addressed Bani Israel. He was asked, \"Who is the most learned man amongst the people. He said, \"I am the most learned.\" Allah admonished Moses as he did not attribute absolute knowledge to Him (Allah). So Allah inspired to him \"At the junction of the two seas there is a slave amongst my slaves who is more learned than you.\" Moses said, \"O my Lord! How can I meet him?\" Allah said: Take a fish in a large basket (and proceed) and you will find him at the place where you will lose the fish. So Moses set out along with his (servant) boy, Yusha` bin Noon and carried a fish in a large basket till they reached a rock, where they laid their heads (i.e. lay down) and slept. The fish came out of the basket and it took its way into the sea as in a tunnel. So it was an amazing thing for both Moses and his (servant) boy. They proceeded for the rest of that night and the following day. When the day broke, Moses said to his (servant) boy: \"Bring us our early meal. No doubt, we have suffered much fatigue in this journey.\" Moses did not get tired till he passed the place about which he was told. There the (servant) boy told Moses, \"Do you remember when we betook ourselves to the rock, I indeed forgot the fish.\" Moses remarked, \"That is what we have been seeking. So they went back retracing their footsteps, till they reached the rock. There they saw a man covered with a garment (or covering himself with his own garment). Moses greeted him. Al-Khadir replied saying, \"How do people greet each other in your land?\" Moses said, \"I am Moses.\" He asked, \"The Moses of Bani Israel?\" Moses replied in the affirmative and added, \"May I follow you so that you teach me of that knowledge which you have been taught.\" Al-Khadir replied, \"Verily! You will not be able to remain patient with me, O Moses! I have some of the knowledge of Allah which He has taught me and which you do not know, while you have some knowledge which Allah has taught you which I do not know.\" Moses said, \"Allah willing, you will find me patient and I will disobey no order of yours. So both of them set out walking along the seashore, as they did not have a boat. In the meantime a boat passed by them and they requested the crew of the boat to take them on board. The crew recognized Al-Khadir and took them on board without fare. Then a sparrow came and stood on the edge of the boat and dipped its beak once or twice in the sea. Al-Khadir said: \"O Moses! My knowledge and your knowledge have not decreased Allah's knowledge except as much as this sparrow has decreased the water of the sea with its beak.\" Al- Khadir went to one of the planks of the boat and plucked it out. Moses said, \"These people gave us a free lift but you have broken their boat and scuttled it so as to drown its people.\" Al-Khadir replied, \"Didn't I tell you that you will not be able to remain patient with me.\" Moses said, \"Call me not to account for what I forgot.\" The first (excuse) of Moses was that he had forgotten. Then they proceeded further and found a boy playing with other boys. Al-Khadir took hold of the boy's head from the top and plucked it out with his hands (i.e. killed him). Moses said, \"Have you killed an innocent soul who has killed none.\" Al-Khadir replied, \"Did I not tell you that you cannot remain patient with me?\" Then they both proceeded till when they came to the people of a town, they asked them for food, but they refused to entertain them. Then they found there a wall on the point of collapsing. Al-Khadir repaired it with his own hands. Moses said, \"If you had wished, surely you could have taken wages for it.\" Al-Khadir replied, \"This is the parting between you and me.\" The Prophet added, \"May Allah be Merciful to Moses! Would that he could have been more patient to learn more about his story with Al-Khadir. \"",
      "chain": [
        "30351",
        "20005",
        "11081",
        "11050",
        "39"
      ]
    },
    {
      "hadith_no": "293",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن هشام بن عروة، قال أخبرني أبي قال، أخبرني أبو أيوب، قال أخبرني أبى بن كعب، أنه قال يا رسول الله إذا جامع الرجل المرأة فلم ينزل قال ‏\"‏ يغسل ما مس المرأة منه، ثم يتوضأ ويصلي ‏\"‏‏.‏ قال أبو عبد الله الغسل أحوط، وذاك الآخر، وإنما بينا لاختلافهم‏.‏",
      "text_en": " Narrated Ubai bin Ka`b:                     I asked Allah's Apostle about a man who engages in sexual intercourse with his wife but does not discharge. He replied, \"He should wash the parts which comes in contact with the private parts of the woman, perform ablution and then pray.\" (Abu `Abdullah said, \"Taking a bath is safer and is the last order.\")",
      "chain": [
        "30175",
        "20031",
        "11065",
        "10511",
        "33",
        "39"
      ]
    },
    {
      "hadith_no": "3278",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، حدثنا عمرو، قال أخبرني سعيد بن جبير، قال قلت لابن عباس فقال حدثنا أبى بن كعب، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن موسى قال لفتاه آتنا غداءنا، قال أرأيت إذ أوينا إلى الصخرة، فإني نسيت الحوت، وما أنسانيه إلا الشيطان أن أذكره، ولم يجد موسى النصب حتى جاوز المكان الذي أمر الله به ‏\"‏‏.‏",
      "text_en": " Narrated Ubai bin Ka`b:                     That he heard Allah's Apostle saying, \"(The prophet) Moses said to his attendant, \"Bring us our early meal' (18.62). The latter said, 'Did you remember when we betook ourselves to the rock? I indeed forgot the fish and none but Satan made me forget to remember it.\" (18.63) Moses did not feel tired till he had crossed the place which Allah ordered him to go to.\"",
      "chain": [
        "30418",
        "20005",
        "11081",
        "11050",
        "39"
      ]
    },
    {
      "hadith_no": "3401",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، حدثنا عمرو بن دينار، قال أخبرني سعيد بن جبير، قال قلت لابن عباس إن نوفا البكالي يزعم أن موسى صاحب الخضر ليس هو موسى بني إسرائيل، إنما هو موسى آخر‏.‏ فقال كذب عدو الله حدثنا أبى بن كعب عن النبي صلى الله عليه وسلم ‏\"‏ أن موسى قام خطيبا في بني إسرائيل، فسئل أى الناس أعلم فقال أنا‏.‏ فعتب الله عليه إذ لم يرد العلم إليه‏.‏ فقال له بلى، لي عبد بمجمع البحرين هو أعلم منك‏.‏ قال أى رب ومن لي به  وربما قال سفيان أى رب وكيف لي به  قال تأخذ حوتا، فتجعله في مكتل، حيثما فقدت الحوت فهو ثم  وربما قال فهو ثمه  وأخذ حوتا، فجعله في مكتل، ثم انطلق هو وفتاه يوشع بن نون، حتى أتيا الصخرة، وضعا رءوسهما فرقد موسى، واضطرب الحوت فخرج فسقط في البحر، فاتخذ سبيله في البحر سربا، فأمسك الله عن الحوت جرية الماء، فصار مثل الطاق، فقال هكذا مثل الطاق‏.‏ فانطلقا يمشيان بقية ليلتهما ويومهما، حتى إذا كان من الغد قال لفتاه آتنا غداءنا لقد لقينا من سفرنا هذا نصبا‏.‏ ولم يجد موسى النصب حتى جاوز حيث أمره الله‏.‏ قال له فتاه أرأيت إذ أوينا إلى الصخرة فإني نسيت الحوت، وما أنسانيه إلا الشيطان أن أذكره، واتخذ سبيله في البحر عجبا، فكان للحوت سربا ولهما عجبا‏.‏ قال له موسى ذلك ما كنا نبغي، فارتدا على آثارهما قصصا، رجعا يقصان آثارهما حتى انتهيا إلى الصخرة، فإذا رجل مسجى بثوب، فسلم موسى، فرد عليه‏.‏ فقال وأنى بأرضك السلام‏.‏ قال أنا موسى‏.‏ قال موسى بني إسرائيل قال نعم، أتيتك لتعلمني مما علمت رشدا‏.‏ قال يا موسى إني على علم من علم الله، علمنيه الله لا تعلمه وأنت على علم من علم الله علمكه الله لا أعلمه‏.‏ قال هل أتبعك قال ‏{‏إنك لن تستطيع معي صبرا * وكيف تصبر على ما لم تحط به خبرا‏}‏ إلى قوله ‏{‏إمرا‏}‏ فانطلقا يمشيان على ساحل البحر، فمرت بهما سفينة، كلموهم أن يحملوهم، فعرفوا الخضر، فحملوه بغير نول، فلما ركبا في السفينة جاء عصفور، فوقع على حرف السفينة، فنقر في البحر نقرة أو نقرتين، قال له الخضر يا موسى، ما نقص علمي وعلمك من علم الله إلا مثل ما نقص هذا العصفور بمنقاره من البحر‏.‏ إذ أخذ الفأس فنزع لوحا، قال فلم يفجأ موسى إلا وقد قلع لوحا بالقدوم‏.‏ فقال له موسى ما صنعت قوم حملونا بغير نول، عمدت إلى سفينتهم فخرقتها لتغرق أهلها، لقد جئت شيئا إمرا‏.‏ قال ألم أقل إنك لن تستطيع معي صبرا‏.‏ قال لا تؤاخذني بما نسيت ولا ترهقني من أمري عسرا، فكانت الأولى من موسى نسيانا‏.‏ فلما خرجا من البحر مروا بغلام يلعب مع الصبيان، فأخذ الخضر برأسه فقلعه بيده هكذا  وأومأ سفيان بأطراف أصابعه كأنه يقطف شيئا  فقال له موسى أقتلت نفسا زكية بغير نفس لقد جئت شيئا نكرا‏.‏ قال ألم أقل لك إنك لن تستطيع معي صبرا‏.‏ قال إن سألتك عن شىء بعدها فلا تصاحبني، قد بلغت من لدني عذرا‏.‏ فانطلقا حتى إذا أتيا أهل قرية استطعما أهلها فأبوا أن يضيفوهما فوجدا فيها جدارا يريد أن ينقض مائلا  أومأ بيده هكذا وأشار سفيان كأنه يمسح شيئا إلى فوق، فلم أسمع سفيان يذكر مائلا إلا مرة  قال قوم أتيناهم فلم يطعمونا ولم يضيفونا عمدت إلى حائطهم لو شئت لاتخذت عليه أجرا‏.‏ قال هذا فراق بيني وبينك، سأنبئك بتأويل ما لم تستطع عليه صبرا‏\"‏‏.‏ قال النبي صلى الله عليه وسلم ‏\"‏ وددنا أن موسى كان صبر، فقص الله علينا من خبرهما ‏\"‏‏.‏ قال سفيان قال النبي صلى الله عليه وسلم ‏\"‏ يرحم الله موسى، لو كان صبر يقص علينا من أمرهما ‏\"‏‏.‏ وقرأ ابن عباس أمامهم ملك يأخذ كل سفينة صالحة غصبا، وأما الغلام فكان كافرا وكان أبواه مؤمنين‏.‏ ثم قال لي سفيان سمعته منه مرتين وحفظته منه‏.‏ قيل لسفيان حفظته قبل أن تسمعه من عمرو، أو تحفظته من إنسان فقال ممن أتحفظه ورواه أحد عن عمرو غيري سمعته منه مرتين أو ثلاثا وحفظته منه‏.‏",
      "text_en": " Narrated Sa`id bin Jubair:                     I said to Ibn `Abbas, \"Nauf Al-Bukah claims that Moses, the companion of Al-Khadir was not Moses (the prophet) of the children of Israel, but some other Moses.\" Ibn `Abbas said, \"Allah's enemy (i.e. Nauf) has told a lie. Ubai bin Ka`b told us that the Prophet said, 'Once Moses stood up and addressed Bani Israel. He was asked who was the most learned man amongst the people. He said, 'I.' Allah admonished him as he did not attribute absolute knowledge to Him (Allah). So, Allah said to him, 'Yes, at the junction of the two seas there is a Slave of Mine who is more learned than you.' Moses said, 'O my Lord! How can I meet him?' Allah said, 'Take a fish and put it in a large basket and you will find him at the place where you will lose the fish.' Moses took a fish and put it in a basket and proceeded along with his (servant) boy, Yusha` bin Noon, till they reached the rock where they laid their heads (i.e. lay down). Moses slept, and the fish, moving out of the basket, fell into the sea. It took its way into the sea (straight) as in a tunnel. Allah stopped the flow of water over the fish and it became like an arch (the Prophet pointed out this arch with his hands). They travelled the rest of the night, and the next day Moses said to his boy (servant), 'Give us our food, for indeed, we have suffered much fatigue in this journey of ours.' Moses did not feel tired till he crossed that place which Allah had ordered him to seek after. His boy (servant) said to him, 'Do you know that when we were sitting near that rock, I forgot the fish, and none but Satan caused me to forget to tell (you) about it, and it took its course into the sea in an amazing way?.' So there was a path for the fish and that astonished them. Moses said, 'That was what we were seeking after.' So, both of them retraced their footsteps till they reached the rock. There they saw a man Lying covered with a garment. Moses greeted him and he replied saying, 'How do people greet each other in your land?' Moses said, 'I am Moses.' The man asked, 'Moses of Bani Israel?' Moses said, 'Yes, I have come to you so that you may teach me from those things which Allah has taught you.' He said, 'O Moses! I have some of the Knowledge of Allah which Allah has taught me, and which you do not know, while you have some of the Knowledge of Allah which Allah has taught you and which I do not know.' Moses asked, 'May I follow you?' He said, 'But you will not be able to remain patient with me for how can you be patient about things which you will not be able to understand?' (Moses said, 'You will find me, if Allah so will, truly patient, and I will not disobey you in aught.') So, both of them set out walking along the sea-shore, a boat passed by them and they asked the crew of the boat to take them on board. The crew recognized Al-Khadir and so they took them on board without fare. When they were on board the boat, a sparrow came and stood on the edge of the boat and dipped its beak once or twice into the sea. Al-Khadir said to Moses, 'O Moses! My knowledge and your knowledge have not decreased Allah's Knowledge except as much as this sparrow has decreased the water of the sea with its beak.' Then suddenly Al-Khadir took an adze and plucked a plank, and Moses did not notice it till he had plucked a plank with the adze. Moses said to him, 'What have you done? They took us on board charging us nothing; yet you I have intentionally made a hole in their boat so as to drown its passengers. Verily, you have done a dreadful thing.' Al-Khadir replied, 'Did I not tell you that you would not be able to remain patient with me?' Moses replied, 'Do not blame me for what I have forgotten, and do not be hard upon me for my fault.' So the first excuse of Moses was that he had forgotten. When they had left the sea, they passed by a boy playing with other boys. Al-Khadir took hold of the boys head and plucked it with his hand like this. (Sufyan, the sub narrator pointed with his fingertips as if he was plucking some fruit.) Moses said to him, \"Have you killed an innocent person who has not killed any person? You have really done a horrible thing.\" Al-Khadir said, \"Did I not tell you that you could not remain patient with me?' Moses said \"If I ask you about anything after this, don't accompany me. You have received an excuse from me.' Then both of them went on till they came to some people of a village, and they asked its inhabitant for wood but they refused to entertain them as guests. Then they saw therein a wall which was just going to collapse (and Al Khadir repaired it just by touching it with his hands). (Sufyan, the sub-narrator, pointed with his hands, illustrating how Al-Khadir passed his hands over the wall upwards.) Moses said, \"These are the people whom we have called on, but they neither gave us food, nor entertained us as guests, yet you have repaired their wall. If you had wished, you could have taken wages for it.\" Al-Khadir said, \"This is the parting between you and me, and I shall tell you the explanation of those things on which you could not remain patient.\" The Prophet added, \"We wished that Moses could have remained patient by virtue of which Allah might have told us more about their story. (Sufyan the sub-narrator said that the Prophet said, \"May Allah bestow His Mercy on Moses! If he had remained patient, we would have been told further about their case.\")",
      "chain": [
        "30026",
        "20005",
        "11081",
        "11050",
        "39"
      ]
    },
    {
      "hadith_no": "4772",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، حدثنا عمرو بن دينار، قال أخبرني سعيد بن جبير، قال قلت لابن عباس إن نوفا البكالي يزعم أن موسى صاحب الخضر ليس هو موسى صاحب بني إسرائيل‏.‏ فقال ابن عباس كذب عدو الله حدثني أبى بن كعب أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن موسى قام خطيبا في بني إسرائيل فسئل أى الناس أعلم فقال أنا فعتب الله عليه، إذ لم يرد العلم إليه فأوحى الله إليه إن لي عبدا بمجمع البحرين، هو أعلم منك قال موسى يا رب فكيف لي به قال تأخذ معك حوتا فتجعله في مكتل، فحيثما فقدت الحوت فهو ثم، فأخذ حوتا فجعله في مكتل ثم انطلق، وانطلق معه بفتاه يوشع بن نون، حتى إذا أتيا الصخرة وضعا رءوسهما فناما، واضطرب الحوت في المكتل، فخرج منه، فسقط في البحر فاتخذ سبيله في البحر سربا، وأمسك الله عن الحوت جرية الماء فصار عليه مثل الطاق فلما استيقظ، نسي صاحبه أن يخبره بالحوت، فانطلقا بقية يومهما وليلتهما، حتى إذا كان من الغد قال موسى لفتاه آتنا غداءنا لقد لقينا من سفرنا هذا نصبا قال ولم يجد موسى النصب حتى جاوز المكان الذي أمر الله به فقال له فتاه أرأيت إذ أوينا إلى الصخرة فإني نسيت الحوت وما أنسانيه إلا الشيطان أن أذكره، واتخذ سبيله في البحر عجبا قال فكان للحوت سربا ولموسى ولفتاه عجبا فقال موسى ذلك ما كنا نبغي فارتدا على آثارهما قصصا قال رجعا يقصان آثارهما حتى انتهيا إلى الصخرة، فإذا رجل مسجى ثوبا، فسلم عليه موسى‏.‏ فقال الخضر وأنى بأرضك السلام قال أنا موسى‏.‏ قال موسى بني إسرائيل قال نعم أتيتك لتعلمني مما علمت رشدا‏.‏ قال إنك لن تستطيع معي صبرا، يا موسى إني على علم من علم الله علمنيه لا تعلمه أنت وأنت على علم من علم الله علمك الله لا أعلمه‏.‏ فقال موسى ستجدني إن شاء الله صابرا، ولا أعصي لك أمرا‏.‏ فقال له الخضر، فإن اتبعتني فلا تسألني عن شىء حتى أحدث لك منه ذكرا، فانطلقا يمشيان على ساحل البحر، فمرت سفينة فكلموهم أن يحملوهم، فعرفوا الخضر، فحملوه بغير نول فلما ركبا في السفينة، لم يفجأ إلا والخضر قد قلع لوحا من ألواح السفينة بالقدوم‏.‏ فقال له موسى قوم حملونا بغير نول، عمدت إلى سفينتهم فخرقتها لتغرق أهلها لقد جئت شيئا إمرا‏.‏ قال ألم أقل إنك لن تستطيع معي صبرا‏.‏ قال لا تؤاخذني بما نسيت ولا ترهقني من أمري عسرا ‏\"‏‏.‏ قال وقال رسول الله صلى الله عليه وسلم ‏\"‏ وكانت الأولى من موسى نسيانا قال وجاء عصفور فوقع على حرف السفينة فنقر في البحر نقرة، فقال له الخضر ما علمي وعلمك من علم الله إلا مثل ما نقص هذا العصفور من هذا البحر ثم خرجا من السفينة، فبينا هما يمشيان على الساحل، إذ أبصر الخضر غلاما يلعب مع الغلمان، فأخذ الخضر رأسه بيده فاقتلعه بيده فقتله‏.‏ فقال له موسى أقتلت نفسا زاكية بغير نفس لقد جئت شيئا نكرا‏.‏ قال ألم أقل لك إنك لن تستطيع معي صبرا قال وهذا أشد من الأولى، قال إن سألتك عن شىء بعدها فلا تصاحبني قد بلغت من لدني عذرا فانطلقا حتى إذا أتيا أهل قرية استطعما أهلها فأبوا أن يضيفوهما فوجدا فيها جدارا يريد أن ينقض  قال مائل  فقام الخضر فأقامه بيده فقال موسى قوم أتيناهم فلم يطعمونا، ولم يضيفونا، لو شئت لاتخذت عليه أجرا‏.‏ قال ‏{‏هذا فراق بيني وبينك‏}‏ إلى قوله ‏{‏ذلك تأويل ما لم تسطع عليه صبرا‏}‏‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ وددنا أن موسى كان صبر حتى يقص الله علينا من خبرهما ‏\"‏‏.‏ قال سعيد بن جبير فكان ابن عباس يقرأ وكان أمامهم ملك يأخذ كل سفينة صالحة غصبا، وكان يقرأ وأما الغلام فكان كافرا وكان أبواه مؤمنين‏.‏",
      "text_en": " Narrated Sa`id bin Jubair:                     I said to Ibn `Abbas, \"Nauf Al-Bikali claims that Moses, the companion of Al-Khadir was not the Moses of the children of Israel\" Ibn `Abbas said, \"The enemy of Allah (Nauf) told a lie.\" Narrated Ubai bin Ka`b that he heard Allah's Apostle saying, \"Moses got up to deliver a speech before the children of Israel and he was asked, Who is the most learned person among the people?' Moses replied, 'I (am the most learned).' Allah admonished him for he did not ascribe knowledge to Allah alone. So Allah revealed to him: 'At the junction of the two seas there is a slave of Ours who is more learned than you.' Moses asked, 'O my Lord, how can I meet him?' Allah said, 'Take a fish and put it in a basket (and set out), and where you, will lose the fish, you will find him.' So Moses (took a fish and put it in a basket and) set out, along with his boy-servant Yusha` bin Noon, till they reached a rock (on which) they both lay their heads and slept. The fish moved vigorously in the basket and got out of it and fell into the sea and there it took its way through the sea (straight) as in a tunnel). (18.61) Allah stopped the current of water on both sides of the way created by the fish, and so that way was like a tunnel. When Moses got up, his companion forgot to tell him about the fish, and so they carried on their journey during the rest of the day and the whole night. The next morning Moses asked his boy-servant 'Bring us our early meal; no doubt, we have suffered much fatigue in this journey of ours.' (18.62) Moses did not get tired till he had passed the place which Allah had ordered him to seek after. His boy-servant then said to him,' 'Do you remember when we be-took ourselves to the rock I indeed forgot the fish, none but Satan made me forget to remember it. It took its course into the sea in a marvelous way.' (18.63) There was a tunnel for the fish and for Moses and his boy-servant there was astonishment. Moses said, 'That is what we have been seeking'. So they went back retracing their footsteps. (18.64) They both returned, retracing their steps till they reached the rock. Behold ! There they found a man covered with a garment. Moses greeted him. Al-Khadir said astonishingly. 'Is there such a greeting in your land?' Moses said, 'I am Moses.' He said, 'Are you the Moses of the children of Israel?' Moses said, 'I have come to you so that you may teach me of what you have been taught. Al-Khadir said, 'You will not be able to have patience with me. (18.66) O Moses! I have some of Allah's knowledge which He has bestowed upon me but you do not know it; and you too, have some of Allah's knowledge which He has bestowed upon you, but I do not know it.\" Moses said, \"Allah willing, you will find me patient, and I will not disobey you in anything.' (18.6) Al-Khadir said to him. 'If you then follow me, do not ask me about anything until I myself speak to you concerning it.' (18.70), After that both of them proceeded along the sea coast, till a boat passed by and they requested the crew to let them go on board. The crew recognized Al-Khadir and allowed them to get on board free of charge. When they got on board suddenly Moses saw that Al-Khadir had pulled out one of the planks of the boat with an adze. Moses said to him.' These people gave us a free lift, yet you have scuttled their boat so as to drown its people! Truly, you have done a dreadful thing.' (18.71) Al-Khadir said, 'Didn't I say that you can have no patience with me ?' (18.72) Moses said, 'Call me not to account for what I forgot and be not hard upon me for my affair (with you.)\" (18.73) Allah's Apostle said, \"The first excuse given by Moses, was that he had forgotten. Then a sparrow came and sat over the edge of the boat and dipped its beak once in the sea. Al-Khadir said to Moses, 'My knowledge and your knowledge, compared to Allah's knowledge is like what this sparrow has taken out of the sea.' Then they both got out of the boat, and while they were walking on the sea shore, Al-Khadir saw a boy playing with other boys. Al-Khadir got hold of the head of that boy and pulled it out with his hands and killed him. Moses said, 'Have you killed an innocent soul who has killed nobody! Truly, you have done an illegal thing.' (18.74) He said, \"Didn't I tell you that you can have no patience with me?' (18.75) (The sub narrator said, the second blame was stronger than the first one.) Moses said, 'If I ask you about anything after this, keep me not in your company, you have received an excuse from me.' (18.76) Then they both proceeded until they came to the inhabitants of a town. They asked them food but they refused to entertain them. (In that town) they found there a wall on the point of falling down. (18.77) Al-Khadir set it up straight with his own hands. Moses said, 'These are people to whom we came, but they neither fed us nor received us as guests. If you had wished, you could surely have exacted some recompense for it. Al-Khadir said, 'This is the parting between me and you ..that is the interpretation of (those things) over which you were unable to hold patience.' (18.78-82) Allah's Apostle said, \"We wished that Moses could have been more patient so that Allah might have described to us more about their story.\"",
      "chain": [
        "30418",
        "20005",
        "11081",
        "11050",
        "39"
      ]
    },
    {
      "hadith_no": "4774",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني قتيبة بن سعيد، قال حدثني سفيان بن عيينة، عن عمرو بن دينار، عن سعيد بن جبير، قال قلت لابن عباس إن نوفا البكالي يزعم أن موسى بني إسرائيل ليس بموسى الخضر‏.‏ فقال كذب عدو الله حدثنا أبى بن كعب عن رسول الله صلى الله عليه وسلم قال ‏\"‏ قام موسى خطيبا في بني إسرائيل فقيل له أى الناس أعلم قال أنا، فعتب الله عليه، إذ لم يرد العلم إليه، وأوحى إليه بلى عبد من عبادي بمجمع البحرين، هو أعلم منك قال أى رب كيف السبيل إليه قال تأخذ حوتا في مكتل فحيثما فقدت الحوت فاتبعه قال فخرج موسى، ومعه فتاه يوشع بن نون، ومعهما الحوت حتى انتهيا إلى الصخرة، فنزلا عندها قال فوضع موسى رأسه فنام  قال سفيان وفي حديث غير عمرو قال  وفي أصل الصخرة عين يقال لها الحياة لا يصيب من مائها شىء إلا حيي، فأصاب الحوت من ماء تلك العين، قال فتحرك، وانسل من المكتل، فدخل البحر فلما استيقظ موسى ‏{‏قال لفتاه آتنا غداءنا‏}‏ الآية قال ولم يجد النصب حتى جاوز ما أمر به، قال له فتاه يوشع بن نون ‏{‏أرأيت إذ أوينا إلى الصخرة فإني نسيت الحوت‏}‏ الآية قال فرجعا يقصان في آثارهما، فوجدا في البحر كالطاق ممر الحوت، فكان لفتاه عجبا، وللحوت سربا قال فلما انتهيا إلى الصخرة، إذ هما برجل مسجى بثوب، فسلم عليه موسى قال وأنى بأرضك السلام فقال أنا موسى‏.‏ قال موسى بني إسرائيل قال نعم هل أتبعك على أن تعلمني مما علمت رشدا‏.‏ قال له الخضر يا موسى إنك على علم من علم الله علمكه الله لا أعلمه، وأنا على علم من علم الله علمنيه الله لا تعلمه‏.‏ قال بل أتبعك‏.‏ قال فإن اتبعتني فلا تسألني عن شىء حتى أحدث لك منه ذكرا، فانطلقا يمشيان على الساحل فمرت بهما سفينة فعرف الخضر فحملوهم في سفينتهم بغير نول  يقول بغير أجر  فركبا السفينة قال ووقع عصفور على حرف السفينة، فغمس منقاره البحر فقال الخضر لموسى ما علمك وعلمي وعلم الخلائق في علم الله إلا مقدار ما غمس هذا العصفور منقاره قال فلم يفجأ موسى، إذ عمد الخضر إلى قدوم فخرق السفينة، فقال له موسى قوم حملونا بغير نول، عمدت إلى سفينتهم فخرقتها ‏{‏لتغرق أهلها لقد جئت‏}‏ الآية فانطلقا إذا هما بغلام يلعب مع الغلمان، فأخذ الخضر برأسه فقطعه‏.‏ قال له موسى ‏{‏أقتلت نفسا زكية بغير نفس لقد جئت شيئا نكرا * قال ألم أقل لك إنك لن تستطيع معي صبرا‏}‏ إلى قوله ‏{‏فأبوا أن يضيفوهما فوجدا فيها جدارا يريد أن ينقض‏}‏ فقال بيده هكذا فأقامه، فقال له موسى إنا دخلنا هذه القرية، فلم يضيفونا ولم يطعمونا، لو شئت لاتخذت عليه أجرا‏.‏ قال هذا فراق بيني وبينك سأنبئك بتأويل ما لم تستطع عليه صبرا‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ وددنا أن موسى صبر حتى يقص علينا من أمرهما ‏\"‏‏.‏ قال وكان ابن عباس يقرأ وكان أمامهم ملك يأخذ كل سفينة صالحة غصبا، وأما الغلام فكان كافرا‏.‏",
      "text_en": " Narrated Sa`id bin Jubair:                     I said to Ibn `Abbas, \"Nauf-al-Bakali \" claims that Moses of Bani Israel was not Moses, the companion of Al-Khadir.\" Ibn `Abbas said, \"Allah's enemy tells a lie! Ubai bin Ka`b narrated to us that Allah's Apostle said, 'Moses got up to deliver a sermon before Bani Israel and he was asked, 'Who is the most learned person among the people?' Moses replied, 'I (am the most learned).' Allah then admonished Moses for he did not ascribe all knowledge to Allah only (Then) came the Divine Inspiration:-- 'Yes, one of Our slaves at the junction of the two seas is more learned than you.' Moses said, 'O my Lord ! How can meet him?' Allah said, 'Take a fish in a basket and wherever the fish is lost, follow it (you will find him at that place). So Moses set out along with his attendant Yusha` bin Noon, and they carried with them a fish till they reached a rock and rested there. Moses put his head down and slept. (Sufyan, a sub-narrator said that somebody other than `Amr said) 'At the rock there was a water spring called 'Al-Hayat' and none came in touch with its water but became alive. So some of the water of that spring fell over that fish, so it moved and slipped out of the basket and entered the sea. When Moses woke up, he asked his attendant, 'Bring our early meal' (18.62). The narrator added: Moses did not suffer from fatigue except after he had passed the place he had been ordered to observe. His attendant Yusha` bin Noon said to him, 'Do you remember (what happened) when we betook ourselves to the rock? I did indeed forget (about) the fish ...' (18.63) The narrator added: So they came back, retracing their steps and then they found in the sea, the way of the fish looking like a tunnel. So there was an astonishing event for his attendant, and there was tunnel for the fish. When they reached the rock, they found a man covered with a garment. Moses greeted him. The man said astonishingly, 'Is there any such greeting in your land?' Moses said, 'I am Moses.' The man said, 'Moses of Bani Israel?' Moses said, 'Yes,' and added, 'may I follow you so that you teach me something of the Knowledge which you have been taught?' (18.66). Al-Khadir said to him, 'O Moses! You have something of Allah's knowledge which Allah has taught you and which I do not know; and I have something of Allah's knowledge which Allah has taught me and which you do not know.' Moses said, 'But I will follow you.' Al-Khadir said, 'Then if you follow me, ask me no question about anything until I myself speak to you concerning it.' (18.70). After that both of them proceeded along the seashore. There passed by them a boat whose crew recognized Al-Khadir and received them on board free of charge. So they both got on board. A sparrow came and sat on the edge of the boat and dipped its beak unto the sea. Al-Khadir said to Moses. 'My knowledge and your knowledge and all the creation's knowledge compared to Allah's knowledge is not more than the water taken by this sparrow's beak.' Then Moses was startled by Al-Khadir's action of taking an adze and scuttling the boat with it. Moses said to him, 'These people gave us a free lift, but you intentionally scuttled their boat so as to drown them. Surely you have...' (18.71) Then they both proceeded and found a boy playing with other boys. Al-Khadir took hold of him by the head and cut it off. Moses said to him, 'Have you killed an innocent soul who has killed nobody? Surely you have done an illegal thing! ' (18.74) He said, \"Didn't I tell you that you will not be able to have patient with me up to ..but they refused to entertain them as their guests. There they found a wall therein at the point of collapsing.' (18.75-77) Al-Khadir moved his hand thus and set it upright (repaired it). Moses said to him, 'When we entered this town, they neither gave us hospitality nor fed us; if you had wished, you could have taken wages for it,' Al- Khadir said, 'This is the parting between you and me I will tell you the interpretation of (those things) about which you were unable to hold patience.'...(18.78) Allah's Apostle said, 'We wished that Moses could have been more patient so that He (Allah) could have described to us more about their story.' Ibn `Abbas used to recite:-- 'And in front (ahead) of them there was a king who used to seize every (serviceable) boat by force. (18.79) ...and as for the boy he was a disbeliever. \"",
      "chain": [
        "30367",
        "20005",
        "11081",
        "11050",
        "39"
      ]
    },
    {
      "hadith_no": "5028",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا سفيان، عن عاصم، وعبدة، عن زر بن حبيش، قال سألت أبى بن كعب عن المعوذتين، فقال سألت رسول الله صلى الله عليه وسلم فقال قيل لي فقلت فنحن نقول كما قال رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Zirr bin Hubaish:                     I asked Ubai bin Ka`b regarding the two Muwwidhat (Surats of taking refuge with Allah). He said, \"I asked the Prophet about them, He said, 'These two Surats have been recited to me and I have recited them (and are present in the Qur'an).' So, we say as Allah's Apostle said (i.e., they are part of the Qur'an.\"",
      "chain": [
        "30367",
        "20005",
        "11080",
        "20337",
        "11337",
        "39"
      ]
    },
    {
      "hadith_no": "5029",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، حدثنا عبدة بن أبي لبابة، عن زر بن حبيش، وحدثنا عاصم، عن زر، قال سألت أبى بن كعب قلت يا أبا المنذر إن أخاك ابن مسعود يقول كذا وكذا‏.‏ فقال أبى سألت رسول الله صلى الله عليه وسلم فقال لي قيل لي‏.‏ فقلت، قال فنحن نقول كما قال رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Zirr bin Hubaish:                     I asked Ubai bin Ka`b, \"O Abu AlMundhir! Your brother, Ibn Mas`ud said so-and-so (i.e., the two Mu'awwidh-at do not belong to the Qur'an).\" Ubai said, \"I asked Allah's Apostle about them, and he said, 'They have been revealed to me, and I have recited them (as a part of the Qur'an),\" So Ubai added, \"So we say as Allah's Apostle has said.\"",
      "chain": [
        "30026",
        "20005",
        "10793",
        "11337",
        "11080",
        "11337",
        "39"
      ]
    },
    {
      "hadith_no": "6215",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، قال أخبرني أبو بكر بن عبد الرحمن، أن مروان بن الحكم، أخبره أن عبد الرحمن بن الأسود بن عبد يغوث أخبره أن أبى بن كعب أخبره أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن من الشعر حكمة ‏\"‏‏.‏",
      "text_en": " Narrated Ubai bin Ka`b:                     Allah's Apostle said, \"Some poetry contains wisdom.\"",
      "chain": [
        "30330",
        "20428",
        "11013",
        "11003",
        "858",
        "2206",
        "39"
      ]
    },
    {
      "hadith_no": "6753",
      "source": " Sahih Bukhari ",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، حدثنا عمرو بن دينار، أخبرني سعيد بن جبير، قال قلت لابن عباس فقال حدثنا أبى بن كعب، أنه سمع رسول الله صلى الله عليه وسلم ‏{‏لا تؤاخذني بما نسيت ولا ترهقني من أمري عسرا‏}‏ قال ‏\"‏ كانت الأولى من موسى نسيانا ‏\"‏‏.‏",
      "text_en": "      Narrated Ubai bin Ka'b:                          that he heard Allah's Apostle saying, \"(Moses) said, 'Call me not to      account for what I forget and be not hard upon me for my affair (with      you)' (18.73) the first excuse of Moses was his forgetfulness.\"",
      "chain": [
        "30418",
        "20005",
        "11081",
        "11050",
        "39"
      ]
    },
    {
      "hadith_no": "346",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثنا أبو الربيع الزهراني، حدثنا حماد، حدثنا هشام بن عروة، ح وحدثنا أبو كريب، محمد بن العلاء - واللفظ له - حدثنا أبو معاوية، حدثنا هشام، عن أبيه، عن أبي أيوب، عن أبى بن كعب، قال سألت رسول الله صلى الله عليه وسلم عن الرجل يصيب من المرأة ثم يكسل فقال ‏\"‏ يغسل ما أصابه من المرأة ثم يتوضأ ويصلي ‏\"‏ ‏.‏",
      "text_en": " Ubayy Ibn Ka'b reported:                      I arked the Messenger of Allah (may peace be upon him) about a man who has sexual intercourse with his wife, but leaves her before orgasm. Upon this he (the Holy Prophet) said: He should wash the secretion of his wife, and then perform ablution and ofier prayer.",
      "chain": [
        "30137",
        "20022",
        "11065",
        "20354",
        "11065",
        "10511",
        "33",
        "39"
      ]
    },
    {
      "hadith_no": "346",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثنا محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، عن هشام بن عروة، حدثني أبي، عن الملي، عن الملي، - يعني بقوله الملي عن الملي أبو أيوب، - عن أبى بن كعب، عن رسول الله صلى الله عليه وسلم أنه قال في الرجل يأتي أهله ثم لا ينزل قال ‏\"‏ يغسل ذكره ويتوضأ ‏\"‏ ‏.‏",
      "text_en": " Ubayy ibn Ka'b narrated it from the Messenger of Allah (may peace be upon him) that he said:                      If a person has sexual intercourse with his wife, but does not experience orgasm, he should wash his organ and perform an ablution.",
      "chain": [
        "30170",
        "20173",
        "20020",
        "11065",
        "10511",
        "39"
      ]
    },
    {
      "hadith_no": "1546",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا عبثر، عن سليمان التيمي، عن أبي عثمان النهدي، عن أبى بن كعب، قال كان رجل لا أعلم رجلا أبعد من المسجد منه وكان لا تخطئه صلاة - قال - فقيل له أو قلت له لو اشتريت حمارا تركبه في الظلماء وفي الرمضاء ‏.‏ قال ما يسرني أن منزلي إلى جنب المسجد إني أريد أن يكتب لي ممشاى إلى المسجد ورجوعي إذا رجعت إلى أهلي ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ قد جمع الله لك ذلك كله ‏\"‏ ‏.‏",
      "text_en": " Ubayy b. Ka'b reported:                      There was a man, and I do not know of any other man, whose house was farther than his from the mosque and he never missed the prayer (in congregation). It was said to him or I said to him: It you were to buy a donkey you could ride upon it In the dark nights and in the burning sand. He said: I do not like my house to be situated by the side of the mosque, for I (eagerly) desire that my steps towards the mosque and back from it, should be recorded when I return to my family. Upon this the Messenger of Allah (may peace be upon him) said: Allah has gathered all (rewards) for you.",
      "chain": [
        "30399",
        "11289",
        "11113",
        "39"
      ]
    },
    {
      "hadith_no": "1548",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن أبي بكر المقدمي، حدثنا عباد بن عباد، حدثنا عاصم، عن أبي عثمان، عن أبى بن كعب، قال كان رجل من الأنصار بيته أقصى بيت في المدينة فكان لا تخطئه الصلاة مع رسول الله صلى الله عليه وسلم - قال - فتوجعنا له فقلت له يا فلان لو أنك اشتريت حمارا يقيك من الرمضاء ويقيك من هوام الأرض ‏.‏ قال أما والله ما أحب أن بيتي مطنب ببيت محمد صلى الله عليه وسلم قال فحملت به حملا حتى أتيت نبي الله صلى الله عليه وسلم فأخبرته - قال - فدعاه فقال له مثل ذلك وذكر له أنه يرجو في أثره الأجر ‏.‏ فقال له النبي صلى الله عليه وسلم ‏\"‏ إن لك ما احتسبت ‏\"‏ ‏.‏",
      "text_en": " Ubayy b. Ka'b reported:                      There was a person among the Ansar whose house was situated at the farthest end of Medina, but he never in missed any prayer along with the Messenger of Allah (may peace be upon him). We felt pity for him and said to him: O, so and so, had you bought a donkey it would have saved you from the burning sand and would have saved you from the reptiles of the earth. He said: Listen I by Allah, I do not like my house to be situated by the side of Muhammad (may peace be upon him). I took (these words of his) ill and came to the Apostle of Allah (may peace be upon him) and informed him about (these words). He (the Holy Prophet) called him and he said exactly like that (which he had mentioned to Ubbay b. Ka'b), but made a mention of this (also) that he wanted a reward for his steps. Upon this the Apostle of Allah (may peace be upon him) said: In fact for you is the reward which you expect.",
      "chain": [
        "30161",
        "20243",
        "11080",
        "11113",
        "39"
      ]
    },
    {
      "hadith_no": "1821",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا محمد بن مهران الرازي، حدثنا الوليد بن مسلم، حدثنا الأوزاعي، حدثني عبدة، عن زر، قال سمعت أبى بن كعب، يقول - وقيل له إن عبد الله بن مسعود يقول من قام السنة أصاب ليلة القدر - فقال أبى والله الذي لا إله إلا هو إنها لفي رمضان - يحلف ما يستثني - ووالله إني لأعلم أى ليلة هي ‏.‏ هي الليلة التي أمرنا بها رسول الله صلى الله عليه وسلم بقيامها هي ليلة صبيحة سبع وعشرين وأمارتها أن تطلع الشمس في صبيحة يومها بيضاء لا شعاع لها ‏.‏",
      "text_en": " Ubayy b Ka'b reported:                      By Allah, I know about Lailat-ul Qadr and I know it fully well that it is the twenty-seventh night (during Ramadan) on which the Messenger of Allah (may peace be upon him) commanded us to observe prayer. (Shu'ba was in doubt about these words:\" the night on which the Messenger of Allah [may peace be upon him] commanded us to observe the prayer.\" This has been transmitted to me by a friend of mine.)",
      "chain": [
        "30383",
        "20733",
        "20024",
        "20337",
        "11337",
        "39",
        "16"
      ]
    },
    {
      "hadith_no": "1822",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، قال سمعت عبدة بن أبي لبابة، يحدث عن زر بن حبيش، عن أبى بن كعب، قال أبى في ليلة القدر والله إني لأعلمها وأكثر علمي هي الليلة التي أمرنا رسول الله صلى الله عليه وسلم بقيامها هي ليلة سبع وعشرين - وإنما شك شعبة في هذا الحرف - هي الليلة التي أمرنا بها رسول الله صلى الله عليه وسلم ‏.‏ قال وحدثني بها صاحب لي عنه ‏.‏",
      "text_en": " Shu'ba reported this hadith with the same chain of transmitters, but he made no mention that Shu'ba was in doubt and what follows subsequently.",
      "chain": [
        "30170",
        "20173",
        "20020",
        "10793",
        "11337",
        "39"
      ]
    },
    {
      "hadith_no": "1921",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الأعلى بن عبد الأعلى، عن الجريري، عن أبي السليل، عن عبد الله بن رباح الأنصاري، عن أبى بن كعب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يا أبا المنذر أتدري أى آية من كتاب الله معك أعظم ‏\"‏ ‏.‏ قال قلت الله ورسوله أعلم ‏.‏ قال ‏\"‏ يا أبا المنذر أتدري أى آية من كتاب الله معك أعظم ‏\"‏ ‏.‏ قال قلت الله لا إله إلا هو الحى القيوم ‏.‏ قال فضرب في صدري وقال ‏\"‏ والله ليهنك العلم أبا المنذر ‏\"‏ ‏.‏",
      "text_en": " Abu Darda' reported Allah's Apostle (may peace be upon him) as saying:                      Is any one of you incapable of reciting a third of the Qur'an in a night? They (the Companions) asked: How could one recite a third of the Qur'an (in a night)? Upon this he (the Holy Prophet) said:\" He is Allah, One\" (Qur'An. cxii.) is equivalent to a third of the Qur'an.",
      "chain": [
        "30201",
        "20246",
        "11286",
        "11865",
        "39"
      ]
    },
    {
      "hadith_no": "1941",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبي، حدثنا إسماعيل بن أبي خالد، عن عبد الله بن عيسى بن عبد الرحمن بن أبي ليلى، عن جده، عن أبى بن كعب، قال كنت في المسجد فدخل رجل يصلي فقرأ قراءة أنكرتها عليه ثم دخل آخر فقرأ قراءة سوى قراءة صاحبه فلما قضينا الصلاة دخلنا جميعا على رسول الله صلى الله عليه وسلم فقلت إن هذا قرأ قراءة أنكرتها عليه ودخل آخر فقرأ سوى قراءة صاحبه فأمرهما رسول الله صلى الله عليه وسلم فقرءا فحسن النبي صلى الله عليه وسلم شأنهما فسقط في نفسي من التكذيب ولا إذ كنت في الجاهلية فلما رأى رسول الله صلى الله عليه وسلم ما قد غشيني ضرب في صدري ففضت عرقا وكأنما أنظر إلى الله عز وجل فرقا فقال لي ‏\"‏ يا أبى أرسل إلى أن اقرإ القرآن على حرف فرددت إليه أن هون على أمتي ‏.‏",
      "text_en": " Ubayy b. Ka'b reported that he was sitting in a mosque that a person entered it and he observed prayer, and made recitation, the rest of the hadith is the same.",
      "chain": [
        "30212",
        "20331",
        "11418",
        "39"
      ]
    },
    {
      "hadith_no": "1942",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، حدثني إسماعيل بن أبي، خالد حدثني عبد الله بن عيسى، عن عبد الرحمن بن أبي ليلى، أخبرني أبى بن كعب، أنه كان جالسا في المسجد إذ دخل رجل فصلى فقرأ قراءة واقتص الحديث بمثل حديث ابن نمير ‏.‏",
      "text_en": " Ubayy b. Ka'b reported that the Apostle of Allah (may peace be upon him) was near the tank of Banu Ghifar that Gabriel came to him and said:                      Allah has commanded you to recite to your people the Qur'an in one dialect. Upon this he said: I ask from Allah pardon and forgiveness. My people are not capable of doing it. He then came for the second time and said: Allah has commanded you that you should recite the Qur'an to your people in two dialects. Upon this he (the Holy prophet) again said: I seek pardon and forgiveness from Allah, my people would not be able to do so. He (Gabriel) came for the third time and said: Allah has commanded you to recite the Qur'an to your people in three dialects. Upon this he said: I ask pardon and forgiveness from Allah. My people would not be able to do it. He then came to him for the fourth time and said: Allah has commanded you to recite the Qur'an to your people in seven dialects, and in whichever dialect they would recite, they would be right.",
      "chain": [
        "30201",
        "20352",
        "11418",
        "11361",
        "11196",
        "39"
      ]
    },
    {
      "hadith_no": "1943",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا غندر، عن شعبة، ح وحدثناه ابن المثنى، وابن بشار قال ابن المثنى حدثنا محمد بن جعفر، حدثنا شعبة، عن الحكم، عن مجاهد، عن ابن أبي ليلى، عن أبى بن كعب، أن النبي صلى الله عليه وسلم كان عند أضاة بني غفار - قال - فأتاه جبريل عليه السلام فقال إن الله يأمرك أن تقرأ أمتك القرآن على حرف ‏.‏ فقال ‏\"‏ أسأل الله معافاته ومغفرته وإن أمتي لا تطيق ذلك ‏\"‏ ‏.‏ ثم أتاه الثانية فقال إن الله يأمرك أن تقرأ أمتك القرآن على حرفين فقال ‏\"‏ أسأل الله معافاته ومغفرته وإن أمتي لا تطيق ذلك ‏\"‏ ‏.‏ ثم جاءه الثالثة فقال إن الله يأمرك أن تقرأ أمتك القرآن على ثلاثة أحرف ‏.‏ فقال ‏\"‏ أسأل الله معافاته ومغفرته وإن أمتي لا تطيق ذلك ‏\"‏ ‏.‏ ثم جاءه الرابعة فقال إن الله يأمرك أن تقرأ أمتك القرآن على سبعة أحرف فأيما حرف قرءوا عليه فقد أصابوا ‏.‏",
      "text_en": " This hadith has been narrated by Shu'ba with the same chain of transmitters.",
      "chain": [
        "30201",
        "20278",
        "20020",
        "30160",
        "20173",
        "20020",
        "11069",
        "11028",
        "11196",
        "39"
      ]
    },
    {
      "hadith_no": "2834",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا محمد بن حاتم، وابن أبي عمر، كلاهما عن ابن عيينة، - قال ابن حاتم حدثنا سفيان بن عيينة، - عن عبدة، وعاصم بن أبي النجود، سمعا زر بن حبيش، يقول سألت أبى بن كعب - رضى الله عنه - فقلت إن أخاك ابن مسعود يقول من يقم الحول يصب ليلة القدر ‏.‏ فقال رحمه الله أراد أن لا يتكل الناس أما إنه قد علم أنها في رمضان وأنها في العشر الأواخر وأنها ليلة سبع وعشرين ‏.‏ ثم حلف لا يستثني أنها ليلة سبع وعشرين فقلت بأى شىء تقول ذلك يا أبا المنذر قال بالعلامة أو بالآية التي أخبرنا رسول الله صلى الله عليه وسلم أنها تطلع يومئذ لا شعاع لها ‏.‏",
      "text_en": " Zirr b. Habaish reported:                      I thu asked Ubayy b. Ka'b (Allah be pleased with him): Your brother (in faith) Ibn Mas'ud says: He who stands (for the night prayer) throughout the year would find Lailat-ul-Qadr, whereupon he said: May Allah have mercy upon him; (he said these words) with the intention that people might not rely only (on one night), whereas he knew that it (Lailat-ul-Qadr) is in the month of Ramadan and it is the twenty-seventh night. He then took oath (without making any exception, i. e. without saying Innsha Allah) that it was the twenty-seventh night. I said to him: Abu Mundhir, on what ground do you say that? Thereupon he said: By the indication or by the sign which the Messenger of Allah (may peace be upon him) gave us, and that is that on that day (the sun) would rise without having any ray in it.",
      "chain": [
        "38487",
        "30421",
        "20005",
        "20005",
        "20337",
        "11358",
        "11337",
        "39"
      ]
    },
    {
      "hadith_no": "2835",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، قال سمعت عبدة، بن أبي لبابة يحدث عن زر بن حبيش، عن أبى بن كعب، - رضى الله عنه - قال قال أبى في ليلة القدر والله إني لأعلمها - قال شعبة وأكبر علمي - هي الليلة التي أمرنا رسول الله صلى الله عليه وسلم بقيامها هي ليلة سبع وعشرين ‏.‏ وإنما شك شعبة في هذا الحرف هي الليلة التي أمرنا بها رسول الله صلى الله عليه وسلم ‏.‏ قال وحدثني بها صاحب لي عنه ‏.‏",
      "text_en": " Zirr b. Hubaish reported that Ubayy b. Ka'b (Allah be pleased with him) said about Lailat-ul-Qadr:                      By Allah, I know well about it. Shu'ba said: To the best of my knowledge it was the twenty-seventh night for which the Messenger of Allah (may peace be upon him) commanded us to stand for prayer. Shu'ba doubted these words: That it was the night for which the Messenger of Allah (may peace be upon him) commanded us to stand for prayer. And (he further) said: This was narrated to me by a friend of mine from him (the Holy Prophet).",
      "chain": [
        "30170",
        "20173",
        "20020",
        "10793",
        "11337",
        "39"
      ]
    },
    {
      "hadith_no": "3579",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثني عمرو الناقد، حدثنا يعقوب بن إبراهيم بن سعد، حدثنا أبي، عن صالح، قال ابن شهاب إن أنس بن مالك قال أنا أعلم الناس، بالحجاب لقد كان أبى بن كعب يسألني عنه ‏.‏ قال أنس أصبح رسول الله صلى الله عليه وسلم عروسا بزينب بنت جحش - قال - وكان تزوجها بالمدينة فدعا الناس للطعام بعد ارتفاع النهار فجلس رسول الله صلى الله عليه وسلم وجلس معه رجال بعد ما قام القوم حتى قام رسول الله صلى الله عليه وسلم فمشى فمشيت معه حتى بلغ باب حجرة عائشة ثم ظن أنهم قد خرجوا فرجع ورجعت معه فإذا هم جلوس مكانهم فرجع فرجعت الثانية حتى بلغ حجرة عائشة فرجع فرجعت فإذا هم قد قاموا فضرب بيني وبينه بالستر وأنزل الله آية الحجاب.‏",
      "text_en": " Anas b. Malik (Allah be pleased with him) reported:                      I was the best informed among the people pertaining to Hijab (veil and seclusion). Ubayy b. Ka'b used to ask me about it. Anas (Allah be pleased with him) thus narrated: The Messenger of Allah (may peace be upon him) got up in the morning as a bridegroom of Zainab bint jahsh (Allah be pleased witt her) as he had married her at Medina. He invited people to the wedding feast after the day had well risen. There sat Allah's Messenger (may peace be upon him) and there kept sitting along with him some persons after the people had stood up (for departure) ; then Allah's Messenger (may peace be upon him) stood up and walked on and I also walked along with him until he reached the door of the apartment of 'A'isha (Allah be pleased with her). He then thought that they (those who had been sitting there after meal) had gone away. So he returned and I also returned with him, but they were still sitting at their places. So he returned for the second time and I also returned until he reached the apartment of 'A'isha. He again returned and I also returned and they had (by that time) stood up, and he hung a curtain between me and him (at the door of the apartment of Hadrat Zainab, where he had to stay), and Allah revealed the verse pertaining to veil.",
      "chain": [
        "30263",
        "20184",
        "20150",
        "11176",
        "11013",
        "19",
        "39"
      ]
    },
    {
      "hadith_no": "6315",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا أبى بن كعب، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إنه بينما موسى عليه السلام في قومه يذكرهم بأيام الله وأيام الله نعماؤه وبلاؤه إذ قال ما أعلم في الأرض رجلا خيرا أو أعلم مني ‏.‏ قال فأوحى الله إليه إني أعلم بالخير منه أو عند من هو إن في الأرض رجلا هو أعلم منك ‏.‏ قال يا رب فدلني عليه ‏.‏ قال فقيل له تزود حوتا مالحا فإنه حيث تفقد الحوت ‏.‏ قال فانطلق هو وفتاه حتى انتهيا إلى الصخرة فعمي عليه فانطلق وترك فتاه فاضطرب الحوت في الماء فجعل لا يلتئم عليه صار مثل الكوة قال فقال فتاه ألا ألحق نبي الله فأخبره قال فنسي ‏.‏ فلما تجاوزا قال لفتاه آتنا غداءنا لقد لقينا من سفرنا هذا نصبا ‏.‏ قال ولم يصبهم نصب حتى تجاوزا ‏.‏ قال فتذكر قال أرأيت إذ أوينا إلى الصخرة فإني نسيت الحوت وما أنسانيه إلا الشيطان أن أذكره واتخذ سبيله في البحر عجبا ‏.‏ قال ذلك ما كنا نبغي ‏.‏ فارتدا على آثارهما قصصا فأراه مكان الحوت قال ها هنا وصف لي ‏.‏ قال فذهب يلتمس فإذا هو بالخضر مسجى ثوبا مستلقيا على القفا أو قال على حلاوة القفا قال السلام عليكم ‏.‏ فكشف الثوب عن وجهه قال وعليكم السلام من أنت قال أنا موسى ‏.‏ قال ومن موسى قال موسى بني إسرائيل ‏.‏ قال مجيء ما جاء بك قال جئت لتعلمني مما علمت رشدا ‏.‏ قال إنك لن تستطيع معي صبرا وكيف تصبر على ما لم تحط به خبرا ‏.‏ شىء أمرت به أن أفعله إذا رأيته لم تصبر ‏.‏ قال ستجدني إن شاء الله صابرا ولا أعصي لك أمرا ‏.‏ قال فإن اتبعتني فلا تسألني عن شىء حتى أحدث لك منه ذكرا ‏.‏ فانطلقا حتى إذا ركبا في السفينة خرقها ‏.‏ قال انتحى عليها ‏.‏ قال له موسى عليه السلام أخرقتها لتغرق أهلها لقد جئت شيئا إمرا ‏.‏ قال ألم أقل إنك لن تستطيع معي صبرا قال لا تؤاخذني بما نسيت ولا ترهقني من أمري عسرا ‏.‏ فانطلقا حتى إذا لقيا غلمانا يلعبون ‏.‏ قال فانطلق إلى أحدهم بادي الرأى فقتله فذعر عندها موسى عليه السلام ذعرة منكرة ‏.‏ قال أقتلت نفسا زاكية بغير نفس لقد جئت شيئا نكرا ‏.‏ فقال رسول الله صلى الله عليه وسلم عند هذا المكان ‏\"‏ رحمة الله علينا وعلى موسى لولا أنه عجل لرأى العجب ولكنه أخذته من صاحبه ذمامة ‏.‏ قال إن سألتك عن شىء بعدها فلا تصاحبني قد بلغت من لدني عذرا ‏.‏ ولو صبر لرأى العجب - قال وكان إذا ذكر أحدا من الأنبياء بدأ بنفسه ‏\"‏ رحمة الله علينا وعلى أخي كذا رحمة الله علينا - ‏\"‏ فانطلقا حتى إذا أتيا أهل قرية لئاما فطافا في المجالس فاستطعما أهلها فأبوا أن يضيفوهما فوجدا فيها جدارا يريد أن ينقض فأقامه ‏.‏ قال لو شئت لاتخذت عليه أجرا ‏.‏ قال هذا فراق بيني وبينك وأخذ بثوبه ‏.‏ قال سأنبئك بتأويل ما لم تستطع عليه صبرا أما السفينة فكانت لمساكين يعملون في البحر إلى آخر الآية ‏.‏ فإذا جاء الذي يسخرها وجدها منخرقة فتجاوزها فأصلحوها بخشبة وأما الغلام فطبع يوم طبع كافرا وكان أبواه قد عطفا عليه فلو أنه أدرك أرهقهما طغيانا وكفرا فأردنا أن يبدلهما ربهما خيرا منه زكاة وأقرب رحما ‏.‏ وأما الجدار فكان لغلامين يتيمين في المدينة وكان تحته ‏\"‏ ‏.‏ إلى آخر الآية ‏.‏",
      "text_en": " Sa, id b. jubair reported that it was said to Ibn 'Abbas that Nauf al-Bikali was of the opinion that Moses who went in search of knowledge was not the Moses of Bani Isra'il. He said:                      Sa'id, did you hear it from him? I said: Yes. Thereupon he said that Nauf had not stated the fact. Ubayy b. Ka'b narrated to us that he had heard Allah's Messenger (may peace be upon him) as saying: Moses had been delivering sermons to his people. And he made this remark: No person upon the earth has better knowledge than I or nothing better than mine. Thereupon Allah revealed to him: I know one who is better than you (in knowledge) or there is a person on the earth having more knowledge than you. Thereupon he said: My Lord, direct me to him. It was said to him: Keep a salted fish as a provision for journey. The place where that fish would be lost (there you will find that man). So he set forth and a young slave along with him until they came to a place Sakhra. but he did not find any clue. So he proceeded on and left that young man there. The fish began to stir in water and the water assumed the form of an ark over the fish. The young man said: I should meet Allah's Apostle (peace be upon him) and inform him, but he was made to forget and when they had gone beyond that place, he (Moses) said to the young man: Bring breakfast. We have been exhausted because of the journey, and he (Moses) was not exhausted until he had crossed that (particular) place (where he had) to meet Khadir, and the youth was reminded and said: Did you not see that as we reached Sakhra I forgot the fish and it is satan alone who has made me forgetful of it'? It is strange that he has been able to find way in the ocean too. He said: This is what we sought for us. They returned retracing their steps, and he (his companion) pointed to him the location (where) the fish (had been lost). Moses began to search him there. He suddenly saw Khadir wrapped in a cloth and lying on his back. He said to him: As-Salamu-'Alaikum. He removed the cloth from his face and said: Wa 'Alaikum-us-Salam! Who are you? He said: I am Moses. He said: Who Moses? He said: Moses Of Bani Isra'il. He said: What brought you here? He said: I have come so that you may teach me what you have been taught of righteousness. He said: You shall have to bear with me, and how can you have patience about a thing of which you have no comprehensive knowledge? You will not have patience when you see me doing a thing I have been ordered to do. He said: If Allah pleases, you will find me patient, nor shall I disobey you in aught. Khadir said: If you follow me, don't ask me about anything until I explain it to you. So they went on until they embarked upon a boat. He (Khadir) made a hole in that. Thereupon he (Moses) said: You have done this so that you may drown the persons sitting in the boat. You have done something grievous. Thereupon he said: Did I not tell you that you will not be able to bear with me? Thereupon he (Moses) said: Blame me not for what I forgot and be not hard upon me for what I did. (Khadir gave him another chance.) So they went on until they reached a place where boys were playing. He went to one of them and caught hold'of one (apparently) at random and killed him. Moses (peace be upon him) felt agitated and said: You have killed an innocent person not guilty of slaying another. You have done something aboininable. Thereupon Allah's Messenger (may peace be upon him) said: May Allah have mercy upon us and Moses. Had he shown patience he would have seen wonderful things, but fear of blame, with respect to his companion, seized him and he said: If I ask anything after this, keep not company with me. You will then have a valid excuse in my case, and had he (Moses) shown patience he would have seen many wonderful things. He (the narrator) said: Whenever he (the Holy Prophet) made mention of any Prophet, he always said: May there be mercy of Allah upon us and upon my brother so and so. They, however, proceeded on until they came to the inhabitants of a village who were very miserly. They went to the meeting places and asked for hospitality but they refused to show any hospitality to them. They both found in that village a wall which was about to fall. He (Khadir) set it right. Thereupon he (Moses) said: If you so liked. you could get wages for it. Thereupon he said: This is the partince, of ways between me and you, and, taking hold of his cloth, he said: Now I will explain to you the real significance (of all these acts) for which you could not show patience. As for the boat, it belonged to the poor people working on the river and I intended to damage it for there was ahead of them (a king) who seized boats by force. (When he came) to catch hold of it he found it a damaged boat, so he spared it (and later on) it was set right with wood. So far as the boy is concerned, he has been, by very nature, an unbeliever, whereas his parents loved him very much. Had he grown up he would have involved them in wrongdoing and unbelief, so we wished that their Lord should give them in its place one better in purity and close to mercy. And as for the wall it belonged to two orphan boys in the city and there was beneath it a (treasure) belongin to them,... up to the last verse. This hadith has been transmitted on the authority of Abu Ishaq.",
      "chain": [
        "39"
      ]
    },
    {
      "hadith_no": "6317",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثنا عمرو الناقد، حدثنا سفيان بن عيينة، عن عمرو، عن سعيد بن جبير، عن ابن عباس، عن أبى بن كعب، أن النبي صلى الله عليه وسلم قرأ ‏{‏ لتخذت عليه أجرا‏}‏  ‏.‏",
      "text_en": " Ibn 'Abbas has reported this hadith on the authority of Ubayy b. ka'b that Allah's Apostle (may peace be upon him) used to recite this.",
      "chain": [
        "30263",
        "20005",
        "11081",
        "11050",
        "17",
        "39"
      ]
    },
    {
      "hadith_no": "6937",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Destiny - كتاب القدر",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد الله بن مسلمة بن قعنب، حدثنا معتمر بن سليمان، عن أبيه، عن رقبة، بن مسقلة عن أبي إسحاق، عن سعيد بن جبير، عن ابن عباس، عن أبى بن كعب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الغلام الذي قتله الخضر طبع كافرا ولو عاش لأرهق أبويه طغيانا وكفرا ‏\"‏ ‏.‏",
      "text_en": " Ubayy b. Ka'b reported that AUah's Messenger (may peace be upon him) said:                      The young man whom Khadir killed was a non-believer by his very nature and had he survived he would have involved his parents in defiance and unbelief.",
      "chain": [
        "20164",
        "20288",
        "11289",
        "11049",
        "11050",
        "17",
        "39"
      ]
    },
    {
      "hadith_no": "214",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، أخبرني عمرو، - يعني ابن الحارث - عن ابن شهاب، حدثني بعض، من أرضى أن سهل بن سعد الساعدي، أخبره أن أبى بن كعب أخبره أن رسول الله صلى الله عليه وسلم إنما جعل ذلك رخصة للناس في أول الإسلام لقلة الثياب ثم أمر بالغسل ونهى عن ذلك ‏.‏ قال أبو داود يعني ‏\"‏ الماء من الماء ‏\"‏ ‏.‏",
      "text_en": " Ubayy b. Ka’b reported :                      The Messenger of Allah (May peace be upon him) made a concession in the early days of Islam on account of the paucity of clothes that one should not take a bath if one has sexual intercourse (and has no seminal emission). But later on her commanded to take a bath in such a case and prohibited its omission.",
      "chain": [
        "30226",
        "20029",
        "20377",
        "11013",
        "399",
        "39"
      ]
    },
    {
      "hadith_no": "215",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن مهران البزاز الرازي، حدثنا مبشر الحلبي، عن محمد أبي غسان، عن أبي حازم، عن سهل بن سعد، حدثني أبى بن كعب، أن الفتيا التي، كانوا يفتون أن الماء من الماء كانت رخصة رخصها رسول الله صلى الله عليه وسلم في بدء الإسلام ثم أمر بالاغتسال بعد ‏.‏",
      "text_en": " Ubayy b. Ka’b said :                      The verdict that water (bath) is necessary when there is emission given by the people (in the early days of Islam) was due to the concession granted by the Messenger of Allah in the beginning of Islam. He then commanded to take a bath (in such a case).Abu Dawud said : By Abu Ghassan is meant Muhammad b. mutarrif.",
      "chain": [
        "30383",
        "11172",
        "399",
        "39"
      ]
    },
    {
      "hadith_no": "554",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن أبي إسحاق، عن عبد الله بن أبي بصير، عن أبى بن كعب، قال صلى بنا رسول الله صلى الله عليه وسلم يوما الصبح فقال ‏\"‏ أشاهد فلان ‏\"‏ ‏.‏ قالوا لا ‏.‏ قال ‏\"‏ أشاهد فلان ‏\"‏ ‏.‏ قالوا لا ‏.‏ قال ‏\"‏ إن هاتين الصلاتين أثقل الصلوات على المنافقين ولو تعلمون ما فيهما لأتيتموهما ولو حبوا على الركب وإن الصف الأول على مثل صف الملائكة ولو علمتم ما فضيلته لابتدرتموه وإن صلاة الرجل مع الرجل أزكى من صلاته وحده وصلاته مع الرجلين أزكى من صلاته مع الرجل وما كثر فهو أحب إلى الله تعالى ‏\"‏ ‏.‏",
      "text_en": " Narrated Ubayy ibn Ka'b:                     The Messenger of Allah (ﷺ) led us in the dawn prayer one day. And he said: Is so and so present? They said: No. He (again) asked: Is so and so present? They replied: No. He then said: These two prayers are the ones which are most burdensome to hypocrites. If you knew what they contain (i.e. blessings), you would come to them, even though you had to crawl on your knees. The first row is like that of the angels, and if you knew the nature of its excellence, you would race to join it.  A man's prayer said along with another is purer than his prayer said alone, and his prayer with two men is purer than his prayer with one, but if there are more it is more pleasing to Allah, the Almighty, the Majestic.",
      "chain": [
        "30329",
        "20020",
        "11049",
        "39"
      ]
    },
    {
      "hadith_no": "557",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا زهير، حدثنا سليمان التيمي، أن أبا عثمان، حدثه عن أبى بن كعب، قال كان رجل لا أعلم أحدا من الناس ممن يصلي القبلة من أهل المدينة أبعد منزلا من المسجد من ذلك الرجل وكان لا تخطئه صلاة في المسجد فقلت لو اشتريت حمارا تركبه في الرمضاء والظلمة ‏.‏ فقال ما أحب أن منزلي إلى جنب المسجد فنمي الحديث إلى رسول الله صلى الله عليه وسلم فسأله عن قوله ذلك فقال أردت يا رسول الله أن يكتب لي إقبالي إلى المسجد ورجوعي إلى أهلي إذا رجعت ‏.‏ فقال ‏\"‏ أعطاك الله ذلك كله أنطاك الله جل وعز ما احتسبت كله أجمع ‏\"‏ ‏.‏",
      "text_en": " Ubayy b. Ka’b said:                      There was a certain person, out of all people of Medina, who used to pray in the mosque. I do not know that any one of them lived at a farther distance than that man. Still he never missed the prayer in congregation in the mosque. I said: it would be better if you buy a donkey and ride it in heat and darkness. He said: I do not like that my house be by the side of the mosque. The discourse reached the Messenger of Allah (ﷺ). He said him about it. He said: I did it so that my walking to the mosque and return to my home when I return be recorded. He said: Allah has granted all this to you; Allah has granted all that you reckoned.",
      "chain": [
        "30352",
        "20321",
        "11289",
        "11113",
        "39"
      ]
    },
    {
      "hadith_no": "1182",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book Of The Prayer For Rain (Kitab al-Istisqa') - كتاب الاستسقاء",
      "chapter_no": "3",
      "text_ar": "حدثنا أحمد بن الفرات بن خالد أبو مسعود الرازي، أخبرنا محمد بن عبد الله بن أبي جعفر الرازي، عن أبيه، عن أبي جعفر الرازي، قال أبو داود وحدثت عن عمر بن شقيق، حدثنا أبو جعفر الرازي، - وهذا لفظه وهو أتم - عن الربيع بن أنس، عن أبي العالية، عن أبى بن كعب، قال انكسفت الشمس على عهد رسول الله صلى الله عليه وسلم وإن النبي صلى الله عليه وسلم صلى بهم فقرأ بسورة من الطول وركع خمس ركعات وسجد سجدتين ثم قام الثانية فقرأ سورة من الطول وركع خمس ركعات وسجد سجدتين ثم جلس كما هو مستقبل القبلة يدعو حتى انجلى كسوفها ‏.‏",
      "text_en": " Narrated Ubayy b. Ka'b:                     An eclipse of the sun took place in the time of the Messenger of Allah (ﷺ).  The Prophet (ﷺ) led them in prayer.  He recited one of the long surahs, bowing five times and prostrating himself twice.  He then stood up for the second rak'ah, recited one of the long surahs, bowed firve times, prostrated himself twice, then sat where he was facing the qiblah and made the supplication till the eclipse was over.",
      "chain": [
        "38044",
        "38528",
        "28281",
        "20746",
        "24332",
        "20746",
        "19844",
        "11618",
        "39"
      ]
    },
    {
      "hadith_no": "1378",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Ramadan - كتاب شهر رمضان",
      "chapter_no": "6",
      "text_ar": "حدثنا سليمان بن حرب، ومسدد، - المعنى - قالا حدثنا حماد بن زيد، عن عاصم، عن زر، قال قلت لأبى بن كعب أخبرني عن ليلة القدر، يا أبا المنذر فإن صاحبنا سئل عنها ‏.‏ فقال من يقم الحول يصبها ‏.‏ فقال رحم الله أبا عبد الرحمن والله لقد علم أنها في رمضان - زاد مسدد ولكن كره أن يتكلوا أو أحب أن لا يتكلوا ثم اتفقا - والله إنها لفي رمضان ليلة سبع وعشرين لا يستثني ‏.‏ قلت يا أبا المنذر أنى علمت ذلك قال بالآية التي أخبرنا رسول الله صلى الله عليه وسلم ‏.‏ قلت لزر ما الآية قال تصبح الشمس صبيحة تلك الليلة مثل الطست ليس لها شعاع حتى ترتفع ‏.‏",
      "text_en": " Zirr (b. Hubaish) said:                      I said to Ubayy b. Ka'b: Tell me about lailat al-qadr, O Abu al-Mundhir, for our companion (Ibn Mas'ud) was questioned about it, and he said: Anyone who gets up for prayer every night all the year round will hit upon it (i.e. lailat al-qadr). He replied: May Allah have mercy on Abu 'Abd al-Rahman. By Allah, he knew that it was in Ramadan, (Musaddad's version goes) but he disliked that the people should content themselves (with that night alone); or he liked that the people should not content themselves (with the night alone). According to the agreed version: By Allah, it is the twenty-seventh night of Ramadan, without any reservation. I said: How did you know that, Abu al-Mundhir? He replied: By the indication (or sign) of which the Messenger of Allah (ﷺ) informed us. I asked Zirr: What is the sign ? He replied: The sun rises like a vessel of water in the morning following that night; it has no rays until it rises high up.",
      "chain": [
        "20193",
        "30175",
        "20022",
        "11080",
        "11337",
        "39"
      ]
    },
    {
      "hadith_no": "1423",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا أبو حفص الأبار، ح وحدثنا إبراهيم بن موسى، أخبرنا محمد بن أنس، - وهذا لفظه - عن الأعمش، عن طلحة، وزبيد، عن سعيد بن عبد الرحمن بن أبزى، عن أبيه، عن أبى بن كعب، قال كان رسول الله صلى الله عليه وسلم يوتر ب ‏{‏ سبح اسم ربك الأعلى ‏}‏ و ‏{‏ قل للذين كفروا ‏}‏ والله الواحد الصمد ‏.‏",
      "text_en": " Narrated Ubayy ibn Ka'b:                     The Messenger of Allah (ﷺ) used to observe witr with (reciting) \"Glorify the name of thy Lord, the most High\" (Surah 87), \"Say O disbelievers\" (Surah 109), and \"Say, He is Allah, the One, Allah, the eternally besought of all\" (112).",
      "chain": [
        "30203",
        "25208",
        "30309",
        "11060",
        "11356",
        "11335",
        "11346",
        "4046",
        "39"
      ]
    },
    {
      "hadith_no": "1428",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا أحمد بن محمد بن حنبل، حدثنا محمد بن بكر، أخبرنا هشام، عن محمد، عن بعض، أصحابه أن أبى بن كعب، أمهم - يعني في رمضان - وكان يقنت في النصف الآخر من رمضان ‏.‏",
      "text_en": " Muhammad reported on the authority of some of his teachers that Ubayy b. Ka'b led them in prayer during Ramadan. He used to recite the supplication (in the with) during the second half of Ramadan.",
      "chain": [
        "30007",
        "20277",
        "20295",
        "20278",
        "39"
      ]
    },
    {
      "hadith_no": "1430",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا محمد بن أبي عبيدة، حدثنا أبي، عن الأعمش، عن طلحة الأيامي، عن ذر، عن سعيد بن عبد الرحمن بن أبزى، عن أبيه، عن أبى بن كعب، قال كان رسول الله صلى الله عليه وسلم إذا سلم في الوتر قال ‏\"‏ سبحان الملك القدوس ‏\"‏ ‏.‏",
      "text_en": " Narrated Ubayy ibn Ka'b:                     When the Messenger of Allah (ﷺ) offered salutation in the witr prayer, he said: Glorify be to the king most holy.",
      "chain": [
        "30203",
        "25250",
        "11060",
        "11423",
        "11346",
        "4046",
        "39"
      ]
    },
    {
      "hadith_no": "1460",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا عبد الأعلى، حدثنا سعيد بن إياس، عن أبي السليل، عن عبد الله بن رباح الأنصاري، عن أبى بن كعب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أبا المنذر أى آية معك من كتاب الله أعظم ‏\"‏ ‏.‏ قال قلت الله ورسوله أعلم ‏.‏ قال ‏\"‏ أبا المنذر أى آية معك من كتاب الله أعظم ‏\"‏ ‏.‏ قال قلت ‏{‏ الله لا إله إلا هو الحى القيوم ‏}‏ قال فضرب في صدري وقال ‏\"‏ ليهن لك يا أبا المنذر العلم ‏\"‏ ‏.‏",
      "text_en": " Ubayy b. Ka'b said:                      The Messenger of Allah (ﷺ) said: Abu al-Mundhir, which verse of Allah's Book that you have is creates ? I replied: Allah and His Apostle know best. He said: Abu al-Mundhir, which verse of Allah's that you have is greatest ? I said: Allah, there is no god but He, the Living, the Eternal. Thereupon he struck me on the beast and said: May knowledge be pleasant for you, Abu al-Mundhir.",
      "chain": [
        "30170",
        "20246",
        "11286",
        "10922",
        "11865",
        "39"
      ]
    },
    {
      "hadith_no": "1477",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا أبو الوليد الطيالسي، حدثنا همام بن يحيى، عن قتادة، عن يحيى بن يعمر، عن سليمان بن صرد الخزاعي، عن أبى بن كعب، قال قال النبي صلى الله عليه وسلم ‏\"‏ يا أبى إني أقرئت القرآن فقيل لي على حرف أو حرفين فقال الملك الذي معي قل على حرفين ‏.‏ قلت على حرفين ‏.‏ فقيل لي على حرفين أو ثلاثة ‏.‏ فقال الملك الذي معي قل على ثلاثة ‏.‏ قلت على ثلاثة ‏.‏ حتى بلغ سبعة أحرف ثم قال ليس منها إلا شاف كاف إن قلت سميعا عليما عزيزا حكيما ما لم تختم آية عذاب برحمة أو آية رحمة بعذاب ‏\"‏ ‏.‏",
      "text_en": " Ubayy b. Ka'b reported:                      The Prophet (ﷺ) said: \"Ubayy, I was asked to recite the Qur'an and I was asked: 'In one mode or two modes?' The angel that accompanied me said: 'Say, in two modes', I said: 'In two modes', I was asked again: 'In two or three modes'. The matter reached up to seven modes. He then said: 'Each mode is sufficiently health-giving, whether you utter 'all-hearing and all-knowing' or instead 'all-powerful and all-wise'. This is valid until you finish the verse indicating punishment on mercy and finish the verse indicating mercy on punishment.\"",
      "chain": [
        "20296",
        "20297",
        "11019",
        "11316",
        "383",
        "39"
      ]
    },
    {
      "hadith_no": "1478",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا ابن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، عن الحكم، عن مجاهد، عن ابن أبي ليلى، عن أبى بن كعب، أن النبي صلى الله عليه وسلم كان عند أضاة بني غفار فأتاه جبريل صلى الله عليه وسلم فقال إن الله عز وجل يأمرك أن تقرئ أمتك على حرف ‏.‏ قال ‏\"‏ أسأل الله معافاته ومغفرته إن أمتي لا تطيق ذلك ‏\"‏ ‏.‏ ثم أتاه ثانية فذكر نحو هذا حتى بلغ سبعة أحرف قال إن الله يأمرك أن تقرئ أمتك على سبعة أحرف فأيما حرف قرءوا عليه فقد أصابوا ‏.‏",
      "text_en": " Ubayy b. Ka'b said:                      The Prophet (ﷺ) was present at the pool of Banu Ghifar, Gabriel came to him and said: \"Allah has commanded you to make your community read (the Qur'an) in one harf. He (the Prophet) said: 'I beg Allah His pardon and forgiveness; my community has not strength to do so'. He then came for the second time and told him the same thing till he reached up to seven harfs. Finally, he said: 'Allah has commanded you to make your community read (the Qur'an) in seven harfs; in whichever mode they read, that will be correct.",
      "chain": [
        "30170",
        "20173",
        "20020",
        "11069",
        "11028",
        "11196",
        "39"
      ]
    },
    {
      "hadith_no": "1583",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن منصور، حدثنا يعقوب بن إبراهيم، حدثنا أبي، عن ابن إسحاق، قال حدثني عبد الله بن أبي بكر، عن يحيى بن عبد الله بن عبد الرحمن بن سعد بن زرارة، عن عمارة بن عمرو بن حزم، عن أبى بن كعب، قال بعثني النبي صلى الله عليه وسلم مصدقا فمررت برجل فلما جمع لي ماله لم أجد عليه فيه إلا ابنة مخاض فقلت له أد ابنة مخاض فإنها صدقتك ‏.‏ فقال ذاك ما لا لبن فيه ولا ظهر ولكن هذه ناقة فتية عظيمة سمينة فخذها ‏.‏ فقلت له ما أنا بآخذ ما لم أومر به وهذا رسول الله صلى الله عليه وسلم منك قريب فإن أحببت أن تأتيه فتعرض عليه ما عرضت على فافعل فإن قبله منك قبلته وإن رده عليك رددته ‏.‏ قال فإني فاعل فخرج معي وخرج بالناقة التي عرض على حتى قدمنا على رسول الله صلى الله عليه وسلم فقال له يا نبي الله أتاني رسولك ليأخذ مني صدقة مالي وايم الله ما قام في مالي رسول الله صلى الله عليه وسلم ولا رسوله قط قبله فجمعت له مالي فزعم أن ما على فيه ابنة مخاض وذلك ما لا لبن فيه ولا ظهر وقد عرضت عليه ناقة فتية عظيمة ليأخذها فأبى على وها هي ذه قد جئتك بها يا رسول الله ‏.‏ خذها فقال له رسول الله صلى الله عليه وسلم ‏\"‏ ذاك الذي عليك فإن تطوعت بخير آجرك الله فيه وقبلناه منك ‏\"‏ ‏.‏ قال فها هي ذه يا رسول الله قد جئتك بها فخذها ‏.‏ قال فأمر رسول الله صلى الله عليه وسلم بقبضها ودعا له في ماله بالبركة ‏.‏",
      "text_en": " Narrated Ubayy ibn Ka'b:                     The Messenger of Allah (ﷺ) commissioned me as a collector of zakat. I visited a man. When he had collected his property of camels, I found that a she-camel in her second year was due from him.  I said to him: Pay a she-camel in her second year, for she is to be paid as sadaqah (zakat) by you.  He said: That one is not worthy of milking and riding. Here is another she-camel which is young, grand and fat. So take it.  I said to him: I shall not take an animal for which I have not been commanded. The Messenger of Allah (ﷺ) is here near to you. If you like, go to him, and present to him what you presented to me. Do that; if he accepts it from you, I shall accept it; if he rejects it, I shall reject it.  He said: I shall do it. He accompanied me and took with him the she-camel which he had presented to me. We came to the Messenger of Allah (ﷺ). He said to him: Prophet of Allah, your messenger came to me to collect zakat on my property. By Allah, neither the Messenger of Allah nor his messenger has ever seen my property before. I gathered my property (camels), and he estimated that a she-camel in her second year would be payable by me. But that has neither milk nor is it worth riding. So I presented to him a grand young she-camel for acceptance as  zakat. But he has refused to take her. Look, she is here; I have brought her to you, Messenger of Allah. Take her.  The Messenger of Allah (ﷺ) said: That is what is due from you. If you give voluntarily a better (animal) Allah will give a reward to you for it. We accept her from you.  She is here, Messenger of Allah; I have brought her to you. So take her. The Messenger of Allah (ﷺ) then ordered me to take possession of it, and he prayed for a blessing on his property.",
      "chain": [
        "36658",
        "20184",
        "20150",
        "11107",
        "11104",
        "1212",
        "39"
      ]
    },
    {
      "hadith_no": "2463",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، أخبرنا ثابت، عن أبي رافع، عن أبى بن كعب، أن النبي صلى الله عليه وسلم كان يعتكف العشر الأواخر من رمضان فلم يعتكف عاما فلما كان العام المقبل اعتكف عشرين ليلة ‏.‏",
      "text_en": " Narrated Ubayy ibn Ka'b:                     The Prophet (ﷺ) used to observe i'tikaf during the last ten days of Ramadan. One year he did not observe i'tikaf. When the next year came, he observed i'tikaf for twenty nights (i.e. days).",
      "chain": [
        "20040",
        "20022",
        "11269",
        "479",
        "39"
      ]
    },
    {
      "hadith_no": "3980",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Dialects and Readings of the Qur'an (Kitab Al-Huruf Wa Al-Qira'at) - كتاب الحروف والقراءات",
      "chapter_no": "32",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، عن أسلم المنقري، عن عبد الله، عن أبيه عبد الرحمن بن أبزى، قال قال أبى بن كعب ‏{‏ بفضل الله وبرحمته فبذلك فلتفرحوا ‏}‏ ‏.‏ قال أبو داود بالتاء ‏.‏",
      "text_en": " Narrated Ubayy b. Ka'b:                     \"Say, in the bounty of Allah, and in His mercy- in that let you rejoice.\"",
      "chain": [
        "28531",
        "20012",
        "18034",
        "18",
        "39"
      ]
    },
    {
      "hadith_no": "3984",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Dialects and Readings of the Qur'an (Kitab Al-Huruf Wa Al-Qira'at) - كتاب الحروف والقراءات",
      "chapter_no": "32",
      "text_ar": "حدثنا إبراهيم بن موسى، أخبرنا عيسى، عن حمزة الزيات، عن أبي إسحاق، عن سعيد بن جبير، عن ابن عباس، عن أبى بن كعب، قال كان رسول الله صلى الله عليه وسلم إذا دعا بدأ بنفسه وقال ‏\"‏ رحمة الله علينا وعلى موسى لو صبر لرأى من صاحبه العجب ولكنه قال ‏{‏ إن سألتك عن شىء بعدها فلا تصاحبني قد بلغت من لدني ‏}‏ ‏\"‏ ‏.‏ طولها حمزة ‏.‏",
      "text_en": " Narrated Ubayy ibn Ka'b:                     :When the Messenger of Allah (ﷺ) prayed, he began with himself and said: May the mercy of Allah be upon us and upon Moses. If he had patience, he would have seen marvels from his Companion. But he said: \"(Moses) said: If ever I ask thee about anything after this, keep me not in they company: then wouldst thou have received (full) excuse from my side\". Hamzah lengthened it.",
      "chain": [
        "30309",
        "20347",
        "20583",
        "11049",
        "11050",
        "17",
        "39"
      ]
    },
    {
      "hadith_no": "3985",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Dialects and Readings of the Qur'an (Kitab Al-Huruf Wa Al-Qira'at) - كتاب الحروف والقراءات",
      "chapter_no": "32",
      "text_ar": "حدثنا محمد بن عبد الرحمن أبو عبد الله العنبري، حدثنا أمية بن خالد، حدثنا أبو الجارية العبدي، عن شعبة، عن أبي إسحاق، عن سعيد بن جبير، عن ابن عباس، عن أبى بن كعب، عن النبي صلى الله عليه وسلم أنه قرأها ‏{‏ قد بلغت من لدني ‏}‏ وثقلها ‏.‏",
      "text_en": " Narrated Ubayy ibn Ka'b:                     The Prophet (ﷺ) read the Qur'anic verse: \"Thou hast received (full) excuse from me (min ladunni)\" and put tashdid (doubling of consonants) on nun (n).",
      "chain": [
        "20530",
        "20020",
        "11049",
        "11050",
        "17",
        "39"
      ]
    },
    {
      "hadith_no": "4705",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا القعنبي، حدثنا المعتمر، عن أبيه، عن رقبة بن مصقلة، عن أبي إسحاق، عن سعيد بن جبير، عن ابن عباس، عن أبى بن كعب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الغلام الذي قتله الخضر طبع كافرا ولو عاش لأرهق أبويه طغيانا وكفرا ‏\"‏ ‏.‏",
      "text_en": " Ubayy b. Ka’b said :                      The boy whom al-Khidr had killed was created an infidel. Had he lived, he would have moved his parents to rebellion and unbelief.",
      "chain": [
        "20164",
        "20288",
        "11289",
        "11626",
        "11049",
        "11050",
        "17",
        "39"
      ]
    },
    {
      "hadith_no": "4706",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا محمود بن خالد، حدثنا الفريابي، عن إسرائيل، حدثنا أبو إسحاق، عن سعيد بن جبير، عن ابن عباس، قال حدثنا أبى بن كعب، قال سمعت رسول الله صلى الله عليه وسلم يقول في قوله ‏{‏ وأما الغلام فكان أبواه مؤمنين ‏}‏ ‏\"‏ وكان طبع يوم طبع كافرا ‏\"‏ ‏.‏",
      "text_en": " Ubayy b. Ka’b said :                      I heard the Messenger of Allah (May peace be upon him) explaining the verse “As for the youth his parents were people of Faith,” he was created infidel the day when he was created.",
      "chain": [
        "37534",
        "20034",
        "20311",
        "11049",
        "11050",
        "17",
        "39"
      ]
    },
    {
      "hadith_no": "4707",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا محمد بن مهران الرازي، حدثنا سفيان بن عيينة، عن عمرو، عن سعيد بن جبير، قال قال ابن عباس حدثني أبى بن كعب، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ أبصر الخضر غلاما يلعب مع الصبيان فتناول رأسه فقلعه فقال موسى ‏{‏ أقتلت نفسا زكية ‏}‏ ‏\"‏ ‏.‏ الآية ‏.‏",
      "text_en": " Ibn ‘Abbas said :                      Ubayy b. Ka’b told me that the Messenger of Allah (May peace be upon him) said : Al-khidr saw a youth playing with boys. He took him by his head and uprooted it. Moses then said : Hast thou slain an innocent person who had slain none.",
      "chain": [
        "30383",
        "20005",
        "11081",
        "11050",
        "17",
        "39"
      ]
    },
    {
      "hadith_no": "5010",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا ابن المبارك، عن يونس، عن الزهري، قال حدثنا أبو بكر بن عبد الرحمن بن الحارث بن هشام، عن مروان بن الحكم، عن عبد الرحمن بن الأسود بن عبد يغوث، عن أبى بن كعب، أن النبي صلى الله عليه وسلم قال ‏\"‏ إن من الشعر حكمة ‏\"‏ ‏.‏",
      "text_en": " Ubayy b. Ka’b reported the Prophet (May peace be upon him) as saying :                      In poetry there is wisdom.",
      "chain": [
        "30201",
        "20025",
        "20475",
        "11013",
        "11003",
        "858",
        "2206",
        "39"
      ]
    },
    {
      "hadith_no": "57",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو داود الطيالسي، حدثنا خارجة بن مصعب، عن يونس بن عبيد، عن الحسن، عن عتى بن ضمرة السعدي، عن أبى بن كعب، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن للوضوء شيطانا يقال له الولهان فاتقوا وسواس الماء ‏\"‏ ‏.‏ قال وفي الباب عن عبد الله بن عمرو وعبد الله بن مغفل ‏.‏ قال أبو عيسى حديث أبى بن كعب حديث غريب وليس إسناده بالقوي والصحيح عند أهل الحديث لأنا لا نعلم أحدا أسنده غير خارجة ‏.‏ وقد روي هذا الحديث من غير وجه عن الحسن قوله ولا يصح في هذا الباب عن النبي صلى الله عليه وسلم شيء ‏.‏ وخارجة ليس بالقوي عند أصحابنا وضعفه ابن المبارك ‏.‏",
      "text_en": " Ubayy bin Ka'b narrated that :                     the Prophet said: \"Indeed there is a Shaitan for Wudu' who is called \"AI-Walahan.\" So beware of having misgivings about water.\"",
      "chain": [
        "30160",
        "20547",
        "28147",
        "11075",
        "11016",
        "39"
      ]
    },
    {
      "hadith_no": "110",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا عبد الله بن المبارك، أخبرنا يونس بن يزيد، عن الزهري، عن سهل بن سعد، عن أبى بن كعب، قال إنما كان الماء من الماء رخصة في أول الإسلام ثم نهي عنها ‏.‏",
      "text_en": " Ubayy bin Ka'b narrated:                     \"Water is for water,' was only permitted in the beginning of Islam. Then it was prohibited.\"",
      "chain": [
        "30242",
        "20025",
        "20475",
        "11013",
        "399",
        "39"
      ]
    },
    {
      "hadith_no": "2252",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا إسحاق بن إبراهيم بن حبيب بن الشهيد البصري، حدثنا محمد بن فضيل، حدثنا الأعمش، عن حبيب بن أبي ثابت، عن ذر، عن سعيد بن عبد الرحمن بن أبزى، عن أبيه، عن أبى بن كعب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تسبوا الريح فإذا رأيتم ما تكرهون فقولوا اللهم إنا نسألك من خير هذه الريح وخير ما فيها وخير ما أمرت به ونعوذ بك من شر هذه الريح وشر ما فيها وشر ما أمرت به ‏\"‏ ‏.‏ قال وفي الباب عن عائشة وأبي هريرة وعثمان بن أبي العاصي وأنس وابن عباس وجابر ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " It was narrated from Ubayy bin Ka'b that the Messenger of Allah(s.a.w) said:                     \"Do not curse the wind. When you see what you dislike, then say: 'Allahumma inna nas-aluka min khairi hadhihir-rih, wa khairi ma fiha wa khairi ma  umirat bihi wa na'udhu bika min sharri hadhihir-rih wa sharri ma fiha wa sharri ma umirat bihi' ('O Allah! Indeed we ask you of the good of this wind, and the good of what is in it, and the good of what it has been commanded. And we seek refuge in You from the evil of this wind, and the evil of what is in it, and the evil of what it has been commanded.)\"",
      "chain": [
        "30123",
        "20356",
        "11060",
        "11331",
        "11423",
        "11346",
        "4046",
        "39"
      ]
    },
    {
      "hadith_no": "3184",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Recitation - كتاب القراءات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "46",
      "text_ar": "حدثنا أبو بكر بن نافع، - بصري - حدثنا أمية بن خالد، حدثنا أبو الجارية العبدي، عن شعبة، عن أبي إسحاق، عن سعيد بن جبير، عن ابن عباس، عن أبى بن كعب، عن النبي صلى الله عليه وسلم أنه قرأ قد ‏(‏بلغت من لدني عذرا‏)‏ مثقلة ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من هذا الوجه ‏.‏ وأمية بن خالد ثقة وأبو الجارية العبدي شيخ مجهول لا أدري من هو ولا يعرف اسمه ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     from 'Ubayy bin Ka'b, that the Prophet (ﷺ) would recite: \"Qad balaghta Min Ladunni 'Udhra\" (18:76) with heaviness (Muthaqqalah - meaning with Tashdid on the Nun in \"Ladunni\").\"",
      "chain": [
        "20530",
        "20020",
        "11049",
        "11050",
        "17",
        "39"
      ]
    },
    {
      "hadith_no": "3185",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Recitation - كتاب القراءات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "46",
      "text_ar": "حدثنا يحيى بن موسى، حدثنا معلى بن منصور، حدثنا محمد بن دينار، عن سعد بن أوس، عن مصدع أبي يحيى، عن ابن عباس، عن أبى بن كعب، أن النبي صلى الله عليه وسلم قرأ ‏(‏في عين حمئة ‏)‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من هذا الوجه والصحيح ما روي عن ابن عباس قراءته ‏.‏ ويروى أن ابن عباس وعمرو بن العاصي اختلفا في قراءة هذه الآية وارتفعا إلى كعب الأحبار في ذلك فلو كانت عنده رواية عن النبي صلى الله عليه وسلم لاستغنى بروايته ولم يحتج إلى كعب ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     from Ubay bin Ka'b that the Prophet (ﷺ) recited: \"Fi 'Ainin Hami'ah\" (18:86)",
      "chain": [
        "30221",
        "30278",
        "24396",
        "20722",
        "17",
        "39"
      ]
    },
    {
      "hadith_no": "3196",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Recitation - كتاب القراءات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "46",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا الحسن بن موسى، حدثنا شيبان، عن عاصم، عن زر بن حبيش، عن أبى بن كعب، قال لقي رسول الله صلى الله عليه وسلم جبريل فقال ‏\"‏ يا جبريل إني بعثت إلى أمة أميين منهم العجوز والشيخ الكبير والغلام والجارية والرجل الذي لم يقرأ كتابا قط ‏\"‏ ‏.‏ قال يا محمد إن القرآن أنزل على سبعة أحرف ‏.‏ وفي الباب عن عمر وحذيفة بن اليمان وأم أيوب وهي امرأة أبي أيوب وسمرة وابن عباس وأبي هريرة وأبي جهيم بن الحارث بن الصمة وعمرو بن العاص وأبي بكرة ‏.‏ قال أبو عيسى هذا حديث حسن صحيح وقد روي من غير وجه عن أبى بن كعب ‏.‏",
      "text_en": " Narrated Ubayy bin Ka'b:                     \"The Messenger of Allah (ﷺ) met Jibra'il and said: 'O Jibra'il! I have been sent to an illiterate nation among whom are the elderly woman, the old man, the boy and the girl, and the man who cannot read a book at all.' He said: 'O Muhammad! Indeed the Qur'an was revealed in seven modes.'\"",
      "chain": [
        "30242",
        "20383",
        "20240",
        "11080",
        "11337",
        "39"
      ]
    },
    {
      "hadith_no": "3416",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا الحسين بن حريث، حدثنا الفضل بن موسى، عن عبد الحميد بن جعفر، عن العلاء بن عبد الرحمن، عن أبيه، عن أبي هريرة، عن أبى بن كعب، قال قال النبي صلى الله عليه وسلم ‏\"‏ ما أنزل الله في التوراة ولا في الإنجيل مثل أم القرآن وهي السبع المثاني وهي مقسومة بيني وبين عبدي ولعبدي ما سأل ‏\"‏ ‏.‏",
      "text_en": " Narrated Ubayy bin Ka'b:                     that the Messenger of Allah (ﷺ) said: \"Allah has not revealed the likes of Umm Al-Kitab in the Tawrah, nor the Injil. It is the seven oft-repeated, and (Allah said) 'It is divided between Myself and My slave, and My slave shall have what he asks for.'\"",
      "chain": [
        "30325",
        "20452",
        "11875",
        "10606",
        "11884",
        "13",
        "39"
      ]
    },
    {
      "hadith_no": "3421",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا أبو عمار الحسين بن حريث، حدثنا الفضل بن موسى، عن عيسى بن عبيد، عن الربيع بن أنس، عن أبي العالية، قال حدثني أبى بن كعب، قال لما كان يوم أحد أصيب من الأنصار أربعة وستون رجلا ومن المهاجرين ستة فيهم حمزة فمثلوا بهم فقالت الأنصار لئن أصبنا منهم يوما مثل هذا لنربين عليهم قال فلما كان يوم فتح مكة فأنزل الله ‏(‏ وإن عاقبتم فعاقبوا بمثل ما عوقبتم به ولئن صبرتم لهو خير للصابرين ‏)‏ فقال رجل لا قريش بعد اليوم فقال رسول الله صلى الله عليه وسلم ‏\"‏ كفوا عن القوم إلا أربعة ‏\"‏ ‏.‏ قال هذا حديث حسن غريب من حديث أبى بن كعب ‏.‏",
      "text_en": " Narrated Ubayy bin Ka'b:                     \"On the Day of Uhud, sixty-four of the Ansar were killed, and six from the Muhajirin, one of whom was Hamzah, and they mutilated them, so the Ansar said: 'If, (in the future) we are able to kill them on a day like this, we would mutilate from among them as twice as they (mutilate from among us).'\" He said: \"So on the day of the Conquest of Makkah, Allah revealed: And if you punish them, then punish them with the like of that with which you were afflicted. But if you have patience, then it is better for those who are patient (16:126). So a man said: 'There shall be no Quraish after today.' But the Messenger of Allah (ﷺ) said: 'Leave the people, except for four.'\"",
      "chain": [
        "30325",
        "20452",
        "28471",
        "19844",
        "11618",
        "39"
      ]
    },
    {
      "hadith_no": "3442",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان، عن عمرو بن دينار، عن سعيد بن جبير، قال قلت لابن عباس إن نوفا البكالي يزعم أن موسى صاحب بني إسرائيل ليس بموسى صاحب الخضر قال كذب عدو الله سمعت أبى بن كعب يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ قام موسى خطيبا في بني إسرائيل فسئل أى الناس أعلم فقال أنا أعلم ‏.‏ فعتب الله عليه إذ لم يرد العلم إليه فأوحى الله إليه أن عبدا من عبادي بمجمع البحرين هو أعلم منك قال موسى أى رب فكيف لي به فقال له احمل حوتا في مكتل فحيث تفقد الحوت فهو ثم فانطلق وانطلق معه فتاه وهو يوشع بن نون ويقال يوسع فحمل موسى حوتا في مكتل فانطلق هو وفتاه يمشيان حتى إذا أتيا الصخرة فرقد موسى وفتاه فاضطرب الحوت في المكتل حتى خرج من المكتل فسقط في البحر قال وأمسك الله عنه جرية الماء حتى كان مثل الطاق وكان للحوت سربا وكان لموسى ولفتاه عجبا فانطلقا بقية يومهما وليلتهما ونسي صاحب موسى أن يخبره فلما أصبح موسى قال لفتاه‏:‏ ‏(‏آتنا غداءنا لقد لقينا من سفرنا هذا نصبا ‏)‏ قال ولم ينصب حتى جاوز المكان الذي أمر به ‏:‏ ‏(‏قال أرأيت إذ أوينا إلى الصخرة فإني نسيت الحوت وما أنسانيه إلا الشيطان أن أذكره واتخذ سبيله في البحر عجبا ‏)‏ قال موسى ‏:‏ ‏(‏ ذلك ما كنا نبغ فارتدا على آثارهما قصصا ‏)‏ قال فكانا يقصان آثارهما ‏.‏ قال سفيان يزعم ناس أن تلك الصخرة عندها عين الحياة ولا يصيب ماؤها ميتا إلا عاش ‏.‏ قال وكان الحوت قد أكل منه فلما قطر عليه الماء عاش ‏.‏ قال فقصا آثارهما حتى أتيا الصخرة فرأى رجلا مسجى عليه بثوب فسلم عليه موسى فقال أنى بأرضك السلام قال أنا موسى ‏.‏ قال موسى بني إسرائيل قال نعم ‏.‏ قال يا موسى إنك على علم من علم الله علمكه الله لا أعلمه وأنا على علم من علم الله علمنيه لا تعلمه فقال موسى ‏:‏ ‏(‏ هل أتبعك على أن تعلمني مما علمت رشدا * قال إنك لن تستطيع معي صبرا * وكيف تصبر على ما لم تحط به خبرا * قال ستجدني إن شاء الله صابرا ولا أعصي لك أمرا ‏)‏ قال له الخضر ‏:‏ ‏(‏فإن اتبعتني فلا تسألني عن شيء حتى أحدث لك منه ذكرا ‏)‏ قال نعم فانطلق الخضر وموسى يمشيان على ساحل البحر فمرت بهما سفينة فكلماه أن يحملوهما فعرفوا الخضر فحملوهما بغير نول فعمد الخضر إلى لوح من ألواح السفينة فنزعه فقال له موسى قوم حملونا بغير نول عمدت إلى سفينتهم فخرقتها ‏:‏ ‏(‏ لتغرق أهلها لقد جئت شيئا إمرا * قال ألم أقل إنك لن تستطيع معي صبرا * قال لا تؤاخذني بما نسيت ولا ترهقني من أمري عسرا ‏)‏ ثم خرجا من السفينة فبينما هما يمشيان على الساحل وإذا غلام يلعب مع الغلمان فأخذ الخضر برأسه فاقتلعه بيده فقتله فقال له موسى ‏:‏ ‏(‏ أقتلت نفسا زكية بغير نفس لقد جئت شيئا نكرا * قال ألم أقل لك إنك لن تستطيع معي صبرا ‏)‏ قال وهذه أشد من الأولى ‏:‏ ‏(‏ قال إن سألتك عن شيء بعدها فلا تصاحبني قد بلغت من لدني عذرا * فانطلقا حتى إذا أتيا أهل قرية استطعما أهلها فأبوا أن يضيفوهما فوجدا فيها جدارا يريد أن ينقض ‏)‏ يقول مائل فقال الخضر بيده هكذا ‏:‏ ‏(‏ فأقامه ‏)‏ فقال له موسى قوم أتيناهم فلم يضيفونا ولم يطعمونا ‏:‏ ‏(‏ إن شئت لاتخذت عليه أجرا * قال هذا فراق بيني وبينك سأنبئك بتأويل ما لم تستطع عليه صبرا ‏)‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ يرحم الله موسى لوددنا أنه كان صبر حتى يقص علينا من أخبارهما ‏\"‏ ‏.‏ قال وقال رسول الله صلى الله عليه وسلم ‏\"‏ الأولى كانت من موسى نسيان - قال وجاء عصفور حتى وقع على حرف السفينة ثم نقر في البحر فقال له الخضر ما نقص علمي وعلمك من علم الله إلا مثل ما نقص هذا العصفور من البحر ‏\"‏ ‏.‏ قال سعيد بن جبير وكان يعني ابن عباس يقرأ وكان أمامهم ملك يأخذ كل سفينة صالحة غصبا وكان يقرأ وأما الغلام فكان كافرا ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ ورواه الزهري عن عبيد الله بن عبد الله بن عتبة عن ابن عباس عن أبى بن كعب عن النبي صلى الله عليه وسلم وقد رواه أبو إسحاق الهمداني عن سعيد بن جبير عن ابن عباس عن أبى بن كعب عن النبي صلى الله عليه وسلم ‏.‏ قال أبو عيسى سمعت أبا مزاحم السمرقندي يقول سمعت علي بن المديني يقول حججت حجة وليس لي همة إلا أن أسمع من سفيان يذكر في هذا الحديث الخبر حتى سمعته يقول حدثنا عمرو بن دينار وقد كنت سمعت هذا من سفيان من قبل ذلك ولم يذكر فيه الخبر ‏.‏",
      "text_en": " Narrated Sa'eed bin Jubair:                     \"I said to Ibn 'Abbas: 'Nawf Al-Bikali claims that Musa, of Banu Isra'il is not the companion of Al-Khidr. He said: 'The enemy of Allah has lied. I heard Ubayy bin Ka'b saying: \"I heard the Messenger of Allah (ﷺ) say 'Musa stood to deliver a Khutbah to the children of Isra'il. He was asked: \"Who is the most knowledgeable among the people?\" He said: \"I am the most knowledgeable.\" So Allah admonished him, since he did not refer the knowledge back to Him. Allah revealed to him: \"A slave, among My slaves at the junction of the two seas, is more knowledgeable than you.\" So Musa said: \"O Lord! How can I meet him?\" He said to him: \"Carry a fish in a basket, wherever you lose the fish, then he is there.\" So he set off, and his boy set off with him - and he was Yusha' bin Nun. Musa put a fish in a basket, he and the boy set off walking, until when they reached a rock, Musa and his boy fell asleep. The fish was flopping around in the basket, falling into the sea.' He said: 'Allah held back the flow of water until it was like a tunnel, and the fish could glide. Musa and his boy were amazed. They set off the remainder of the day and the night, and Musa's companion forgot to inform him (of the escape of the fish). When Musa arose in the morning, he said to his boy: Bring us our morning meal; truly we have suffered much fatigue in this, our journey (18:62).' He said: 'He had not gotten tired until he passed the place which Allah had ordered him to go. He said: Do you remember when we betook ourselves to the rock? I indeed forgot the fish, none but Shaitan made me forget to remember it. It took its course into the sea in a strange way (18:63). Musa said: That is what we have been seeking. So they went back, retracing their tracks (18:64). He said: 'So they began retracing their tracks.'\" Sufyan (one of the narrators) said: \"People claim that there is a spring of life at that rock, no dying person has its water poured over him, but he becomes alive, and the fish came in contact with some of it, so when the water dropped on it he became alive.\" \"He [the Prophet (ﷺ)] said: 'They retraced their tracks until they arrived at the rock to see a man covered in a garment. Musa greeted him, and he replied: Is there such a greeting in your land? He said: I am Musa. He said: Musa of the children of Isra'il? He said: Yes. He said: O Musa! Indeed you have some knowledge from Allah, which Allah taught you, which I have not been taught, and I have some knowledge from Allah, which Allah taught me, which you have not been taught.' So Musa said: May I follow you so that you may teach me something of the knowledge which you have been taught? (18:66) He said: Verily, you will not be able to have patience with me! And how can you have patience about a thing which you know not? He said: If Allah wills, you will find me patient, and I will not disobey you at all (18:67-69). Al-Khadir said to him: Then if you follow me, ask me not about anything until I myself mention it to you (18:70). Musa said: Yes. So Musa and Al-Khadir set off walking along the shore of the sea. A boat was passing by them, and they spoke to them (the crew) asking them to let them get on board. They recognized Al-Khadir so they let the two of them ride without charge. Al-Khadir took one of the planks (in the boat) and removed it, so Musa said to him: These people gave us a ride free of charge, yet you sabotaged their boat so that its people will drown. Indeed you have done a dreadful thing (18:71). He said: Did I not tell you that you would not be able to have patience with me? (18:72). He said call me not to account for what I forgot, and be not hard upon me for my affair (18:73). Then they exited the boat, and while they were walking upon the shore, they saw a boy playing with two other boys. So Al-Khadir took him by his head, pulling it off with his hands, and he killed him. So Musa said to him: Have you killed an innocent person who killed no one! Verily you have done a horrendous thing (18:74). He said: Did I not tell you that you would not be able to have patience with me? (18:75) - he (the narrator) said: - \"This was more severe than the first one\" - He said: If I ask you about anything after this, you have received an excuse from me. So they both proceeded until they came to the inhabitants of a town. They asked them for food but they refused to entertain them. There they found a wall on the verge of falling down (18:76 & 77). He (the narrator) said: - meaning leaning over - 'So Al-Khadir took his hand like this, so he set it up straight (18:77) so Musa said to him: We arrived at these people, they did not treat us as guests nor feed us. If you wished, surely you could have taken wages for it! He said: \"This is the parting between you and I. I will tell you the interpretation of (those) things over which you were not able to be patient (18:77 & 78).'\" The Messenger of Allah (ﷺ) said: 'May Allah have mercy upon Musa! We wish that he would have had patience, so that we could have more knowledge about that two of them.' He said: 'So the Messenger of Allah (ﷺ) said: 'The first time Musa had forgotten.' He said: 'And a sparrow came, until it perched on the edge of a boat, and pecked at the sea. So Al-Khadir said to him: My knowledge and your knowledge do not diminish anything from the knowledge of Allah, but like what this sparrow diminishes of the sea.' Sa'eed bin Jubair said: \"and he would\" - meaning Ibn 'Abbas - \"recite: 'And there was before them a king who would take every useful boat by force (18:79).' And he would recite: 'As for the boy, he was a disbeliever (18:80).'\"",
      "chain": [
        "30421",
        "20005",
        "11081",
        "11050",
        "39"
      ]
    },
    {
      "hadith_no": "3443",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا أبو حفص، عمرو بن علي حدثنا أبو قتيبة، سلم بن قتيبة حدثنا عبد الجبار بن العباس الهمداني، عن أبي إسحاق، عن سعيد بن جبير، عن ابن عباس، عن أبى بن كعب، عن النبي صلى الله عليه وسلم قال ‏\"‏ الغلام الذي قتله الخضر طبع يوم طبع كافرا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     that Ubayy bin Ka'b narrated that the Prophet (ﷺ) said: \"The boy that Al-Khidr killed was destined to be a disbeliever the day he was created.'\"",
      "chain": [
        "30286",
        "20233",
        "30419",
        "11049",
        "11050",
        "17",
        "39"
      ]
    },
    {
      "hadith_no": "3536",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا علي بن حجر، أخبرنا الوليد بن مسلم، عن زهير بن محمد، عن رجل، عن أبي العالية، عن أبى بن كعب، قال سألت رسول الله صلى الله عليه وسلم عن قول الله تعالى ‏:‏ ‏(‏ وأرسلناه إلى مائة ألف أو يزيدون ‏)‏ قال ‏\"‏ عشرون ألفا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏",
      "text_en": " Narrated Ubayy bin Ka'b:                     \"I asked the Messenger of Allah (ﷺ) about the saying of Allah, Most High: 'And We sent him to a hundred thousand, or even more (37:147). He said: 'Twenty thousand (more).'\"",
      "chain": [
        "20387",
        "20733",
        "20394",
        "11618",
        "39"
      ]
    },
    {
      "hadith_no": "3690",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا أبو سعد، هو الصغاني عن أبي جعفر الرازي، عن الربيع بن أنس، عن أبي العالية، عن أبى بن كعب، أن المشركين، قالوا لرسول الله صلى الله عليه وسلم انسب لنا ربك ‏.‏ فأنزل الله ‏:‏ ‏(‏ قل هو الله أحد * الله الصمد ‏)‏ فالصمد الذي لم يلد ولم يولد لأنه ليس شيء يولد إلا سيموت وليس شيء يموت إلا سيورث وإن الله عز وجل لا يموت ولا يورث ‏:‏ ‏(‏ لم يكن له كفوا أحد ‏)‏ قال ‏\"‏ لم يكن له شبيه ولا عدل وليس كمثله شيء ‏\"‏ ‏.‏",
      "text_en": " Abu Al-Aliyah narrated from Ubayy bin Ka’b:                     “The idolaters were saying to the Messenger of Allah: ‘Name the lineage of your Lord for us.’ So Allah, Most High, revealed: Say: “He is Allah, the One. Allah As-Samad.” So As-Samad is ‘the One Who does not beget, nor is He begotten,’ because there is nothing born except it will die, and there is nothing that dies except that it will be inherited from, and verily. Allah, the Mighty and Sublime, does not die, nor is He inherited from. ‘And there is none comparable to Him.’ He said: ‘There is nothing similar to Him, nor equal to Him, nor is there anything like Him.’”",
      "chain": [
        "30242",
        "20746",
        "19844",
        "11618",
        "39"
      ]
    },
    {
      "hadith_no": "3385",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا نصر بن عبد الرحمن الكوفي، حدثنا أبو قطن، عن حمزة الزيات، عن أبي إسحاق، عن سعيد بن جبير، عن ابن عباس، عن أبى بن كعب، أن رسول الله صلى الله عليه وسلم كان إذا ذكر أحدا فدعا له بدأ بنفسه ‏.‏ قال أبو عيسى هذا حديث حسن غريب صحيح وأبو قطن اسمه عمرو بن الهيثم ‏.‏",
      "text_en": " Ibn Abbas narrated from Ubayy bin Ka’b that, :                     whenever the Messenger of Allah would mention someone and supplicate for him, he would begin with himself.",
      "chain": [
        "20563",
        "20583",
        "11049",
        "11050",
        "17",
        "39"
      ]
    },
    {
      "hadith_no": "4162",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود، أخبرنا شعبة، عن عاصم، قال سمعت زر بن حبيش، يحدث عن أبى بن كعب، أن رسول الله صلى الله عليه وسلم قال له ‏\"‏ إن الله أمرني أن أقرأ عليك ‏\"‏ ‏.‏ فقرأ عليه‏:‏ ‏(‏ لم يكن الذين كفروا من أهل الكتاب ‏)‏ فقرأ فيها ‏\"‏ إن ذات الدين عند الله الحنيفية المسلمة لا اليهودية ولا النصرانية من يعمل خيرا فلن يكفره ‏\"‏ ‏.‏ وقرأ عليه ‏\"‏ ولو أن لابن آدم واديا من مال لابتغى إليه ثانيا ولو كان له ثانيا لابتغى إليه ثالثا ولا يملأ جوف ابن آدم إلا التراب ويتوب الله على من تاب ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح وقد روي من غير هذا الوجه ‏.‏ رواه عبد الله بن عبد الرحمن بن أبزى عن أبيه عن أبى بن كعب أن النبي صلى الله عليه وسلم قال ‏\"‏ إن الله أمرني أن أقرأ عليك القرآن ‏\"‏ ‏.‏ وقد روى قتادة عن أنس أن النبي صلى الله عليه وسلم قال لأبى ‏\"‏ إن الله أمرني أن أقرأ عليك القرآن ‏\"‏ ‏.‏",
      "text_en": " Narrated Ubayy bin Ka'b:                     that the Messenger of Allah (ﷺ) said to him: \"Indeed, Allah ordered me to recite to you, so he recited in it: \"Those who disbelieve from amongst the Book were not going to...'\" (And he) also recited in it, \"Indeed, the religion with Allah is Al-Hanafiyyah, the Muslim, not Judaism, nor Christianity, whoever does good, it shall not be rejected from him.\" And he recited to him: \"And if the son of Adam had a valley-full of wealth, he would seek a second, and if he had a second, he would seek a third, and nothing fills the belly of the son of Adam except for dirt. And Allah pardons those who repent.\"",
      "chain": [
        "30277",
        "20547",
        "20020",
        "11080",
        "11337",
        "39"
      ]
    },
    {
      "hadith_no": "4272",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود، أخبرنا شعبة، عن عاصم، قال سمعت زر بن حبيش، يحدث عن أبى بن كعب، أن رسول الله صلى الله عليه وسلم قال له ‏\"‏ إن الله أمرني أن أقرأ عليك القرآن ‏\"‏ ‏.‏ فقرأ عليه ‏:‏ ‏(‏ لم يكن الذين كفروا ‏)‏ وفيها ‏\"‏ إن ذات الدين عند الله الحنيفية المسلمة لا اليهودية ولا النصرانية ولا المجوسية من يعمل خيرا فلن يكفره ‏\"‏ ‏.‏ وقرأ عليه ‏\"‏ لو أن لابن آدم واديا من مال لابتغى إليه ثانيا ولو كان له ثانيا لابتغى إليه ثالثا ولا يملأ جوف ابن آدم إلا التراب ويتوب الله على من تاب ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وقد روي من غير هذا الوجه رواه عبد الله بن عبد الرحمن بن أبزى عن أبيه عن أبى بن كعب رضى الله عنه أن النبي صلى الله عليه وسلم قال له ‏\"‏ إن الله أمرني أن أقرأ عليك القرآن ‏\"‏ ‏.‏ وقد رواه قتادة عن أنس أن النبي صلى الله عليه وسلم قال لأبى بن كعب ‏\"‏ إن الله أمرني أن أقرأ عليك القرآن ‏\"‏ ‏.‏",
      "text_en": " Narrated Ubayy bin Ka'b:                     that the Messenger of Allah (ﷺ) said to him: \"Indeed Allah has ordered me to recite the Qur'an to you.\" So he recited to him: \"Those who disbelieved were not going to... (98:1) and he recited in it: \"Indeed the religion with Allah is that which is Hanafiyyah, Muslim, not Judaism, nor Christianity, nor Zoroastrian, whoever does good then it shall not be rejected from him.\" And he recited to him: \"If the son of Adam had a valley of wealth he would seek a second, and if he had a second he would seek a third, and nothing fills the belly of the son of Adam except dirt. And Allah pardons those who repent.\"",
      "chain": [
        "30277",
        "20547",
        "20020",
        "11080",
        "11337",
        "39"
      ]
    },
    {
      "hadith_no": "843",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد بن الحارث، عن شعبة، عن أبي إسحاق، أنه أخبرهم عن عبد الله بن أبي بصير، عن أبيه، - قال شعبة وقال أبو إسحاق وقد سمعته منه، ومن أبيه - قال سمعت أبى بن كعب، يقول صلى رسول الله صلى الله عليه وسلم يوما صلاة الصبح فقال ‏\"‏ أشهد فلان الصلاة ‏\"‏ ‏.‏ قالوا لا ‏.‏ قال ‏\"‏ ففلان ‏\"‏ ‏.‏ قالوا لا ‏.‏ قال ‏\"‏ إن هاتين الصلاتين من أثقل الصلاة على المنافقين ولو يعلمون ما فيهما لأتوهما ولو حبوا والصف الأول على مثل صف الملائكة ولو تعلمون فضيلته لابتدرتموه وصلاة الرجل مع الرجل أزكى من صلاته وحده وصلاة الرجل مع الرجلين أزكى من صلاته مع الرجل وما كانوا أكثر فهو أحب إلى الله عز وجل ‏\"‏ ‏.‏",
      "text_en": " Ubay bin Ka'b said:                      \"One day the Messenger of Allah (ﷺ) prayed Fajr, then he said: 'Did so-and-so attend the prayer? They said: 'No.' He said: '(What about) so-and-so? They said:'No' He said: 'These two prayers. are the most burdensome for the hypocrites. If they knew what (virtue) there is in them, they would come, even if they had to crawl. And the virtue of the first row is like thatof the row of the angels. If you knew its virtue, you would compete for it. A man's prayer with another man is greater in reward than his prayer alone. And a man's prayer with two other men is greater in reward thanhis prayer with one other man; the more people there are, the more beloved that is to Allah, the Mighty and Sublime.\"'",
      "chain": [
        "34033",
        "20226",
        "20020",
        "11049",
        "20020",
        "39"
      ]
    },
    {
      "hadith_no": "914",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا الحسين بن حريث، قال حدثنا الفضل بن موسى، عن عبد الحميد بن جعفر، عن العلاء بن عبد الرحمن، عن أبيه، عن أبي هريرة، عن أبى بن كعب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما أنزل الله عز وجل في التوراة ولا في الإنجيل مثل أم القرآن وهي السبع المثاني وهي مقسومة بيني وبين عبدي ولعبدي ما سأل ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ubayy bin Ka'b said:                     \"The Messenger of Allah (ﷺ) said: 'Allah, the Mighty and Sublime, did not reveal in the Tawrah or the Injil anything like Umm Al-Quran (Al-Fatihah), which is the seven oft-recited, and (Allah said) it is divided between Myself and My slave will have what he asked for.'\"",
      "chain": [
        "30325",
        "20452",
        "11875",
        "10606",
        "11884",
        "13",
        "39"
      ]
    },
    {
      "hadith_no": "939",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا محمد بن جعفر، غندر قال حدثنا شعبة، عن الحكم، عن مجاهد، عن ابن أبي ليلى، عن أبى بن كعب، أن رسول الله صلى الله عليه وسلم كان عند أضاة بني غفار فأتاه جبريل عليه السلام فقال إن الله عز وجل يأمرك أن تقرئ أمتك القرآن على حرف ‏.‏ قال ‏\"‏ أسأل الله معافاته ومغفرته وإن أمتي لا تطيق ذلك ‏\"‏ ‏.‏ ثم أتاه الثانية فقال إن الله عز وجل يأمرك أن تقرئ أمتك القرآن على حرفين قال ‏\"‏ أسأل الله معافاته ومغفرته وإن أمتي لا تطيق ذلك ‏\"‏ ‏.‏ ثم جاءه الثالثة فقال إن الله عز وجل يأمرك أن تقرئ أمتك القرآن على ثلاثة أحرف ‏.‏ قال ‏\"‏ أسأل الله معافاته ومغفرته وإن أمتي لا تطيق ذلك ‏\"‏ ‏.‏ ثم جاءه الرابعة فقال إن الله عز وجل يأمرك أن تقرئ أمتك القرآن على سبعة أحرف فأيما حرف قرءوا عليه فقد أصابوا ‏.‏ قال أبو عبد الرحمن هذا الحديث خولف فيه الحكم خالفه منصور بن المعتمر رواه عن مجاهد عن عبيد بن عمير مرسلا ‏.‏",
      "text_en": " It was narrated from Ubayy bin Ka'b that:                     The Messenger of Allah (ﷺ) was by a pond belonging to Banu Ghifar when Jibril, peace be upon him, came to him and said: \"Allah commands you to teach your Ummah the Quran with one way of recitation.\" He said: \"I ask my Lord for protection and forgiveness, my Ummah cannot bear that.\" Then he came to him a second time and said: \"Allah commands you to teach your Ummah the Quran with two ways of recitation.\" He said: \"\"I ask my Lord for protection and forgiveness, my Ummah cannot bear that.\" Then he came to him a third time and said: \"Allah commands you to teach your Ummah the Quran with three ways of recitation.\" He said: \"I ask my Lord for protection and forgiveness, my Ummah cannot bear that.\" Then he came to him a fourth time and said: \"Allah commands you to teach your Ummah the Quran with seven ways of recitation, and whichever the way they recite it will be correct.\"",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11069",
        "11028",
        "11196",
        "39"
      ]
    },
    {
      "hadith_no": "940",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرني عمرو بن منصور، قال حدثنا أبو جعفر بن نفيل، قال قرأت على معقل بن عبيد الله عن عكرمة بن خالد، عن سعيد بن جبير، عن ابن عباس، عن أبى بن كعب، قال أقرأني رسول الله صلى الله عليه وسلم سورة فبينا أنا في المسجد جالس إذ سمعت رجلا يقرؤها يخالف قراءتي فقلت له من علمك هذه السورة فقال رسول الله صلى الله عليه وسلم ‏.‏ فقلت لا تفارقني حتى نأتي رسول الله صلى الله عليه وسلم فأتيته فقلت يا رسول الله إن هذا خالف قراءتي في السورة التي علمتني ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ اقرأ يا أبى ‏\"‏ ‏.‏ فقرأتها فقال لي رسول الله صلى الله عليه وسلم ‏\"‏ أحسنت ‏\"‏ ‏.‏ ثم قال للرجل ‏\"‏ اقرأ ‏\"‏ ‏.‏ فقرأ فخالف قراءتي فقال له رسول الله صلى الله عليه وسلم ‏\"‏ أحسنت ‏\"‏ ‏.‏ ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ يا أبى إنه أنزل القرآن على سبعة أحرف كلهن شاف كاف ‏\"‏ ‏.‏ قال أبو عبد الرحمن معقل بن عبيد الله ليس بذلك القوي ‏.‏",
      "text_en": " It was narrated that Ubayy bin Ka'b said:                     \"The Messenger of Allah (ﷺ) taught me a surah, and when I was sitting in the masjid I heard a man reciting it in a way that was different from mine. I said to him: 'Who taught you this surah?' He said: 'The Messenger of Allah (ﷺ).' I said: 'Stay with me until we go to the Messenger of Allah (ﷺ).' So we came to him and I said: 'O Messenger of Allah, this man recites a surah that you taught me differently.' The Messenger of Allah (ﷺ) said: 'Recite, O Ubayy.' So I recited it, and the Messenger of Allah (ﷺ) said to me: 'You have done well.' Then he said to the man: 'Recite.' So he recited it and it was different to my recitation. The Messenger of Allah (ﷺ) said to him: 'You have done well.' Then the Messenger of Allah (ﷺ) said: 'O Ubayy, the Quran has been revealed with seven different modes of reciation, all of which are good and sound.\"",
      "chain": [
        "38433",
        "11709",
        "11050",
        "17",
        "39"
      ]
    },
    {
      "hadith_no": "1699",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا علي بن ميمون، قال حدثنا مخلد بن يزيد، عن سفيان، عن زبيد، عن سعيد بن عبد الرحمن بن أبزى، عن أبيه، عن أبى بن كعب، أن رسول الله صلى الله عليه وسلم كان يوتر بثلاث ركعات كان يقرأ في الأولى ب ‏{‏ سبح اسم ربك الأعلى ‏}‏ وفي الثانية ب ‏{‏ قل يا أيها الكافرون ‏}‏ وفي الثالثة ب ‏{‏ قل هو الله أحد ‏}‏ ويقنت قبل الركوع فإذا فرغ قال عند فراغه ‏\"‏ سبحان الملك القدوس ‏\"‏ ‏.‏ ثلاث مرات يطيل في آخرهن ‏.‏",
      "text_en": " It was narrated from Ubayy bin Ka'b that:                     The Messenger of Allah (ﷺ) used to pray witr with three rak'ahs. In the first he would recite: \"Glorify the Name of Your Lord, the Most High\" in the second: \"Say: O you disbelievers!\", and in the third: \"Say: He is Allah, (the) One\". And he would say the Qunut before bowing, and when he finished he would say: Subhanal-Malikil-Quddus (Glory be to the Sovereign, the Most Holy) three times, elongating the words the last time.",
      "chain": [
        "20462",
        "20012",
        "11335",
        "11346",
        "4046",
        "39"
      ]
    },
    {
      "hadith_no": "1700",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا عيسى بن يونس، عن سعيد بن أبي عروبة، عن قتادة، عن سعيد بن عبد الرحمن بن أبزى، عن أبيه، عن أبى بن كعب، قال كان رسول الله صلى الله عليه وسلم يقرأ في الركعة الأولى من الوتر ب ‏{‏ سبح اسم ربك الأعلى ‏}‏ وفي الثانية ب ‏{‏ قل يا أيها الكافرون ‏}‏ وفي الثالثة ب ‏{‏ قل هو الله أحد ‏}‏",
      "text_en": " It was narrated that Ubayy bin Ka'b said:                     \"In the first rak'ah of witr, the Messenger of Allah (ﷺ) used to recite: \"GLorify the Name of your Lord, the Most High;\" in the second; \"Say: O you disbelievers!\" and in the third; \"Say: He is Allah, (the) One.\"",
      "chain": [
        "30123",
        "20347",
        "11073",
        "11019",
        "11346",
        "4046",
        "39"
      ]
    },
    {
      "hadith_no": "1701",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا يحيى بن موسى، قال أنبأنا عبد العزيز بن خالد، قال حدثنا سعيد بن أبي عروبة، عن قتادة، عن عزرة، عن سعيد بن عبد الرحمن بن أبزى، عن أبيه، عن أبى بن كعب، قال كان رسول الله صلى الله عليه وسلم يقرأ في الوتر ب ‏{‏ سبح اسم ربك الأعلى ‏}‏ وفي الركعة الثانية ب ‏{‏ قل يا أيها الكافرون ‏}‏ وفي الثالثة ب ‏{‏ قل هو الله أحد ‏}‏ ولا يسلم إلا في آخرهن ويقول يعني بعد التسليم ‏\"‏ سبحان الملك القدوس ‏\"‏ ‏.‏ ثلاثا ‏.‏",
      "text_en": " It was narrated that Ubayy bin Ka'b said:                     \"The Messenger of Allah (ﷺ) used to recite: \"Glorify the Name of Your Lord, the Most High;\" in witr, in the second rak'ah he would recite: \"Say: O you disbelievers!\"; and in the third \"Say: He is Allah, (the) One\". And he only said the taslim at the end, and he would say- meaning after the taslim: Subhanal-Malikil-Quddus (Glory be to the Sovereign, the Most Holy)' three times.\"",
      "chain": [
        "30221",
        "11073",
        "11019",
        "10799",
        "11346",
        "4046",
        "39"
      ]
    },
    {
      "hadith_no": "1729",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا محمد بن الحسين بن إبراهيم بن إشكاب النسائي، قال أنبأنا محمد بن أبي عبيدة، قال حدثنا أبي، عن الأعمش، عن طلحة، عن ذر، عن سعيد بن عبد الرحمن بن أبزى، عن أبيه، عن أبى بن كعب، قال كان رسول الله صلى الله عليه وسلم يقرأ في الوتر ب ‏{‏ سبح اسم ربك الأعلى ‏}‏ و ‏{‏ قل يا أيها الكافرون ‏}‏ و ‏{‏ قل هو الله أحد ‏}‏ فإذا سلم قال ‏\"‏ سبحان الملك القدوس ‏\"‏ ‏.‏ ثلاث مرات ‏.‏",
      "text_en": " Sa'eed bin 'Abdur-Rahman bin Abza narrated from his father, that:                     Ubayy bin Ka'b said: \"The Messenger of Allah (ﷺ) used to recite in Witr: \"Glorify the Name of your Lord, the Most High;\" and \"Say: O you disbelievers!;' and 'Say: He is Allah, (the) One.' And when he said the salam, he would say: Subhanal-Malikil-Quddus (Glory be to the Sovereign, the Most Holy) three times.\"",
      "chain": [
        "11060",
        "11356",
        "11423",
        "11346",
        "4046",
        "39"
      ]
    },
    {
      "hadith_no": "1730",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا يحيى بن موسى، قال حدثنا عبد الرحمن بن عبد الله بن سعد، قال حدثنا أبو جعفر الرازي، عن الأعمش، عن زبيد، وطلحة، عن ذر، عن سعيد بن عبد الرحمن بن أبزى، عن أبيه، عن أبى بن كعب، قال كان رسول الله صلى الله عليه وسلم يوتر ب ‏{‏ سبح اسم ربك الأعلى ‏}‏ و ‏{‏ قل يا أيها الكافرون ‏}‏ و ‏{‏ قل هو الله أحد ‏}‏ خالفهما حصين فرواه عن ذر عن ابن عبد الرحمن بن أبزى عن أبيه عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Sa'eed bin Abdur-Rahman bin Abza narrated from his father, that:                     Ubayy bin Ka'b said: \"The Messenger of Allah (ﷺ) used to recite in Witr: \"Glorify the Name of your Lord, the Most High;\" and \"Say: O you disbelievers!;' and 'Say: He is Allah, (the) One.'\"",
      "chain": [
        "30221",
        "20746",
        "11060",
        "11335",
        "11356",
        "11423",
        "11346",
        "4046",
        "39"
      ]
    },
    {
      "hadith_no": "5754",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا سويد، قال أنبأنا عبد الله، عن سفيان، عن سلمة بن كهيل، عن ذر بن عبد الله، عن سعيد بن عبد الرحمن بن أبزى، عن أبيه، قال سألت أبى بن كعب عن النبيذ، فقال اشرب الماء واشرب العسل واشرب السويق واشرب اللبن الذي نجعت به ‏.‏ فعاودته فقال الخمر تريد الخمر تريد ‏.‏",
      "text_en": " It was narrated from Sa'eed bin 'Abdur-Rahman bin Abza that his father said:                     \"I asked Ubayy bin Ka'b about Nabidh, and he said: 'Drink water, drink honey, drink Sawiq (barley gruel) and drink milk that you have been nourished with since childhood.' I repeated the question and he said: 'Is it wine you want? Is it wine you want?'\"",
      "chain": [
        "16",
        "20005",
        "11350",
        "11423",
        "11346",
        "4046",
        "39"
      ]
    },
    {
      "hadith_no": "109",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا إسماعيل بن محمد الطلحي، أنبأنا داود بن عطاء المديني، عن صالح بن كيسان، عن ابن شهاب، عن سعيد بن المسيب، عن أبى بن كعب، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ أول من يصافحه الحق عمر وأول من يسلم عليه وأول من يأخذ بيده فيدخله الجنة ‏\"‏ ‏.‏",
      "text_en": " It was narrted that Ubayy bin Ka'b said:                     \"The Messenger of Allah said: 'The first person with whom Allah will shake hands will be 'Umar, (and he is) the first person to be greeted with the Salam, and the first person who will be taken by the hand and admitted into Paradise.'\"",
      "chain": [
        "22054",
        "11176",
        "11013",
        "11002",
        "39"
      ]
    },
    {
      "hadith_no": "455",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا جعفر بن مسافر، حدثنا إسماعيل بن قعنب أبو بشر، حدثنا عبد الله بن عرادة الشيباني، عن زيد بن الحواري، عن معاوية بن قرة، عن عبيد بن عمير، عن أبى بن كعب، أن رسول الله  صلى الله عليه وسلم  دعا بماء فتوضأ مرة مرة فقال ‏\"‏ هذا وظيفة الوضوء ‏\"‏ ‏.‏ أو قال ‏\"‏ وضوء من لم يتوضأه لم يقبل الله له صلاة ‏\"‏ ‏.‏ ثم توضأ مرتين مرتين ثم قال ‏\"‏ هذا وضوء من توضأه أعطاه الله كفلين من الأجر ‏\"‏ ‏.‏ ثم توضأ ثلاثا ثلاثا فقال ‏\"‏ هذا وضوئي ووضوء المرسلين من قبلي ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ubayy bin Ka'b that:                     The Messenger of Allah called for water and performed ablution once. He said: \"This is the minimum requirement of ablution' or he said: 'The ablution of one who, if he does not perform this ablution, Allah will not accept his prayer.\" Then he performed ablution washing each part twice, and he said: 'This is the ablution of one who, if he performs it, Allah will give him two shares of reward.\" Then he performed ablution washing each part three times, and said: 'This is my ablution and the ablution of the Messengers who were sent before me.\"",
      "chain": [
        "38132",
        "24241",
        "14135",
        "11306",
        "11259",
        "39"
      ]
    },
    {
      "hadith_no": "456",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو داود، حدثنا خارجة بن مصعب، عن يونس بن عبيد، عن الحسن، عن عتى بن ضمرة السعدي، عن أبى بن كعب، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن للوضوء شيطانا يقال له ولهان فاتقوا وسواس الماء ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ubayy bin Ka'b said:                     \"The Messenger of Allah said: 'There is a devil for ablution who is called Walahan, so be on guard against the insinuating thoughts (Waswas) about water.'\"",
      "chain": [
        "30160",
        "20547",
        "28147",
        "11075",
        "11016",
        "39"
      ]
    },
    {
      "hadith_no": "652",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عثمان بن عمر، أنبأنا يونس، عن الزهري، قال قال سهل بن سعد الساعدي أنبأنا أبى بن كعب، قال إنما كانت رخصة في أول الإسلام ثم أمرنا بالغسل بعد ‏.‏",
      "text_en": " Ubayy bin Ka'b said:                     \"That was a concession that was granted in the early days of Islam, then we were commanded to have a bathe after that.\"",
      "chain": [
        "30160",
        "20262",
        "20475",
        "11013",
        "399",
        "39"
      ]
    },
    {
      "hadith_no": "783",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book On The Mosques And The Congregations - كتاب المساجد والجماعات",
      "chapter_no": "4",
      "text_ar": "حدثنا أحمد بن عبدة، حدثنا عباد بن عباد المهلبي، حدثنا عاصم الأحول، عن أبي عثمان النهدي، عن أبى بن كعب، قال كان رجل من الأنصار بيته أقصى بيت بالمدينة وكان لا تخطئه الصلاة مع رسول الله  صلى الله عليه وسلم  ‏.‏ قال فتوجعت له فقلت يا فلان لو أنك اشتريت حمارا يقيك الرمض ويرفعك من الوقع ويقيك هوام الأرض ‏.‏ فقال والله ما أحب أن بيتي بطنب بيت محمد  صلى الله عليه وسلم  ‏.‏ قال فحملت به حملا حتى أتيت بيت النبي  صلى الله عليه وسلم  فذكرت ذلك له فدعاه فسأله فذكر له مثل ذلك وذكر أنه يرجو في أثره فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن لك ما احتسبت ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ubayy bin Ka'b said:                     \"There was a man among the Ansar whose house was the furthest house in Al-Madinah, yet he never missed prayer with the Messenger of Allah. I felt sorry for him and said: 'O so-and-so, why do you not buy a donkey to spare yourself the heat of the scorching sand, to carry over the stony ground, and to keep you away from the vermin on the ground?' He said: 'By Allah! I do not want to live so close to Muhammed.' This troubled me until I came to the house of the Prophet and mentioned that to him. He called (the man) and asked him, and he said something similar, and said that he was hoping for the reward for his steps. The Messenger of Allah said, 'You will have that (reward) that you sought.'\"",
      "chain": [
        "30423",
        "20243",
        "11080",
        "11113",
        "39"
      ]
    },
    {
      "hadith_no": "790",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book On The Mosques And The Congregations - كتاب المساجد والجماعات",
      "chapter_no": "4",
      "text_ar": "حدثنا محمد بن معمر، حدثنا أبو بكر الحنفي، حدثنا يونس بن أبي إسحاق، عن أبيه، عن عبد الله بن أبي بصير، عن أبيه، عن أبى بن كعب، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ صلاة الرجل في جماعة تزيد على صلاة الرجل وحده أربعا وعشرين أو خمسا وعشرين درجة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ubayy bin Ka'b said:                     \"The Messenger of Allah said: 'The prayer of a man in congregation is higher than his prayer on his own by twenty-four or twenty-five levels.\"",
      "chain": [
        "30172",
        "20254",
        "10846",
        "11049",
        "39"
      ]
    },
    {
      "hadith_no": "1165",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محرز بن سلمة العدني، حدثنا عبد العزيز بن محمد الدراوردي، عن شريك بن عبد الله بن أبي نمر، عن عطاء بن يسار، عن أبى بن كعب، أن رسول الله  صلى الله عليه وسلم  قرأ يوم الجمعة تبارك وهو قائم فذكرنا بأيام الله وأبو الدرداء أو أبو ذر يغمزني فقال متى أنزلت هذه السورة إني لم أسمعها إلا الآن ‏.‏ فأشار إليه أن اسكت فلما انصرفوا قال سألتك متى أنزلت هذه السورة فلم تخبرني فقال أبى ليس لك من صلاتك اليوم إلا ما لغوت ‏.‏ فذهب إلى رسول الله  صلى الله عليه وسلم  فذكر ذلك له وأخبره بالذي قال أبى فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ صدق أبى ‏\"‏ ‏.‏",
      "text_en": " ‘Ata’bin Yasar narrated from Ubayy bin Ka’b:                      “The Messenger of Allah(ﷺ) recited Tabarak [Al-Mulk (67)] one Friday, while he wasstandingand reminding us of the Days of Allah (i.e., preaching tous). AbuDarda’ or Abu Dharr raised an eyebrow at me and said:‘When was thisSurah revealed? For I have not heard it before now.’He (Ubayy)gestured to him that he should remain silent. When theyfinished, hesaid: ‘I asked you when this Surah was revealed andyou did not answerme.” Ubayy said: ‘You have gained nothing fromyour prayer todayexcept the idle talk that you engaged in.’ Hewent to the Prophet(ﷺ) and told him about that, and what Ubayy hadsaid to him. TheMessenger of Allah (ﷺ) said: ‘Ubayy spoke thetruth.’”",
      "chain": [
        "20167",
        "11858",
        "11020",
        "39"
      ]
    },
    {
      "hadith_no": "1226",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا أبو حفص الأبار، حدثنا الأعمش، عن طلحة، وزبيد، عن ذر، عن سعيد بن عبد الرحمن بن أبزى، عن أبيه، عن أبى بن كعب، قال كان رسول الله  صلى الله عليه وسلم  يوتر ب ‏{سبح اسم ربك الأعلى}‏ و ‏{قل يا أيها الكافرون}‏ و ‏{قل هو الله أحد‏}‏ ‏.‏",
      "text_en": " It wasnarrated that Ubayy bin Ka’b said:                      “The Messenger of Allah(ﷺ)used to perform Witr and recite: ‘Glorify the Name of your LordtheMost High.’, [Al-A’la (87)] ‘Say: O you disbelievers!”[Al-Kafirun(109)] and ‘Say: Allah is One.”. [Al-Ikhlas (112)]",
      "chain": [
        "30203",
        "25208",
        "11060",
        "11356",
        "11335",
        "11423",
        "11346",
        "4046",
        "39"
      ]
    },
    {
      "hadith_no": "1238",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا علي بن ميمون الرقي، حدثنا مخلد بن يزيد، عن سفيان، عن زبيد اليامي، عن سعيد بن عبد الرحمن بن أبزى، عن أبيه، عن أبى بن كعب، أن رسول الله  صلى الله عليه وسلم  كان يوتر فيقنت قبل الركوع ‏.‏",
      "text_en": " It wasnarrated from Ubayy bin Ka’b that the Messenger of Allah (ﷺ)usedto pray Witr and he would recite Qunut before Ruku’.",
      "chain": [
        "38412",
        "20462",
        "20012",
        "11335",
        "11346",
        "4046",
        "39"
      ]
    },
    {
      "hadith_no": "1608",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا عبد الله بن سعيد، حدثنا عبد الرحمن المحاربي، عن حجاج بن أرطاة، عن عدي بن ثابت، عن زر بن حبيش، عن أبى بن كعب، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من صلى على جنازة فله قيراط ومن شهدها حتى تدفن فله قيراطان والذي نفس محمد بيده القيراط أعظم من أحد هذا ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Ubayy bin Ka’b that the Messenger of Allah (ﷺ)said:                      ‘Whoever offers the funeral prayer will have one Qirat; andwhoever attends until the burial is over, will have two Qirat. By theOne in Whose Hand is the soul of Muhammad! The Qirat is greater thanthis (mountain of) Uhud.”",
      "chain": [
        "11184",
        "20333",
        "20580",
        "11372",
        "11337",
        "39"
      ]
    },
    {
      "hadith_no": "1702",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا إسحاق بن منصور، أنبأنا عبد الوهاب بن عطاء العجلي، عن ابن عون، عن الحسن، عن أبى بن كعب، قال كنا مع رسول الله  صلى الله عليه وسلم  وإنما وجهنا واحد فلما قبض نظرنا هكذا وهكذا ‏.‏",
      "text_en": " It wasnarrated that Ubayy bin Ka’b said:                      “We were with the MessengerofAllah (ﷺ) and we all had a single focus, but when he passed awaywestarted to look here and there (i.e., have different interests).”",
      "chain": [
        "30313",
        "11071",
        "11016",
        "39"
      ]
    },
    {
      "hadith_no": "1842",
      "source": " Sunan Ibn Majah ",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا عبد الرحمن بن مهدي، عن حماد بن سلمة، عن ثابت، عن أبي رافع، عن أبى بن كعب، أن النبي  صلى الله عليه وسلم  كان يعتكف العشر الأواخر من رمضان فسافر عاما فلما كان من العام المقبل اعتكف عشرين يوما ‏.‏",
      "text_en": " It wasnarrated from Ubayy bin Ka’b that:                      The Prophet (ﷺ) used tospendthe last ten days of Ramadan in I’tikaf. One year he wastraveling,so the following year he spent twenty days in I’tikaf.",
      "chain": [
        "11222",
        "20033",
        "20021",
        "11269",
        "479",
        "39"
      ]
    },
    {
      "hadith_no": "2242",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا سهل بن أبي سهل، حدثنا يحيى بن سعيد، عن ثور بن يزيد، حدثنا خالد بن معدان، حدثني عبد الرحمن بن سلم، عن عطية الكلاعي، عن أبى بن كعب، قال علمت رجلا القرآن فأهدى إلى قوسا فذكرت ذلك لرسول الله  صلى الله عليه وسلم  فقال ‏\"‏ إن أخذتها أخذت قوسا من نار ‏\"‏ ‏.‏ فرددتها ‏.‏",
      "text_en": " It was narrated that Ubayy bin Ka'b said:                     \"I taught a man the Qur'an, and he gave me a bow. I mentioned that to the Messenger of Allah (ﷺ) and he said: 'If you accept it you will be accepting a bow of fire.' So I returned it.\"",
      "chain": [
        "38259",
        "20031",
        "20415",
        "11422",
        "39"
      ]
    },
    {
      "hadith_no": "2873",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن إسماعيل بن سمرة، حدثنا محمد بن يعلى السلمي، حدثنا عمر بن صبح، عن عبد الرحمن بن عمرو، عن مكحول، عن أبى بن كعب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لرباط يوم في سبيل الله من وراء عورة المسلمين محتسبا من غير شهر رمضان أعظم أجرا من عبادة مائة سنة صيامها وقيامها ورباط يوم في سبيل الله من وراء عورة المسلمين محتسبا من شهر رمضان أفضل عند الله وأعظم أجرا - أراه قال - من عبادة ألف سنة صيامها وقيامها فإن رده الله إلى أهله سالما لم تكتب عليه سيئة ألف سنة وتكتب له الحسنات ويجرى له أجر الرباط إلى يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Ubayy bin Ka’b said:                      “The Messenger of Allah(ﷺ)said: ‘For guarding the frontier for a day in the cause ofAllah,defending the Muslims, seeking reward, apart from in the monthofRamadan, there is a reward granted greater than worshipping for ahundred years, fasting and praying. Guarding the frontier for a dayinthe cause of Allah, defending the Muslims, seeking reward, in themonth of Ramadan, is better before Allah and brings a greater reward”– I think he said – “than worshipping for a thousand years,fastingand praying. If Allah returns him to his family safe andsound, no baddeed will be recorded for him for a thousand years, buthis good deedswill be recorded, and the reward for guarding thefrontier will cometo him until the Day of Resurrection.”",
      "chain": [
        "38475",
        "11066",
        "39"
      ]
    },
    {
      "hadith_no": "3755",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر، حدثنا عبد الله بن المبارك، عن يونس، عن الزهري، حدثنا أبو بكر بن عبد الرحمن بن الحارث، عن مروان بن الحكم، عن عبد الرحمن بن الأسود بن عبد يغوث، عن أبى بن كعب، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ إن من الشعر لحكمة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ubbay bin Ka'b that the Messenger of Allah(ﷺ) said:                     \"In some poetry there is wisdom.\"",
      "chain": [
        "20436",
        "20025",
        "20475",
        "11013",
        "11003",
        "858",
        "2206",
        "39"
      ]
    },
    {
      "hadith_no": "4166",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا هشام بن عمار، حدثنا الوليد بن مسلم، حدثنا سعيد بن بشير، عن قتادة، عن مجاهد، عن ابن عباس، عن أبى بن كعب، عن رسول الله  صلى الله عليه وسلم  أنه ليلة أسري به وجد ريحا طيبة فقال ‏\"‏ يا جبريل ما هذه الريح الطيبة قال هذه ريح قبر الماشطة وابنيها وزوجها ‏.‏ قال وكان بدء ذلك أن الخضر كان من أشراف بني إسرائيل وكان ممره براهب في صومعته فيطلع عليه الراهب فيعلمه الإسلام فلما بلغ الخضر زوجه أبوه امرأة فعلمها الخضر وأخذ عليها أن لا تعلمه أحدا وكان لا يقرب النساء فطلقها ثم زوجه أبوه أخرى فعلمها وأخذ عليها أن لا تعلمه أحدا فكتمت إحداهما وأفشت عليه الأخرى فانطلق هاربا حتى أتى جزيرة في البحر فأقبل رجلان يحتطبان فرأياه فكتم أحدهما وأفشى الآخر وقال قد رأيت الخضر ‏.‏ فقيل ومن رآه معك قال فلان فسئل فكتم وكان في دينهم أن من كذب قتل قال فتزوج المرأة الكاتمة فبينما هي تمشط ابنة فرعون إذ سقط المشط فقالت تعس فرعون ‏.‏ فأخبرت أباها وكان للمرأة ابنان وزوج فأرسل إليهم فراود المرأة وزوجها أن يرجعا عن دينهما فأبيا فقال إني قاتلكما ‏.‏ فقالا إحسانا منك إلينا إن قتلتنا أن تجعلنا في بيت ففعل فلما أسري بالنبي  صلى الله عليه وسلم  وجد ريحا طيبة فسأل جبريل فأخبره ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ubayy bin Ka’b that on the night when he (ﷺ)was taken on the Night Journey (Isra’), the Messenger of Allah(ﷺ)noticed a good fragrance and said:                      “O Jibril, what is thisgoodfragrance?” He said: “This is the fragrance of the grave ofthehairdresser and her two sons and her husband.” He said: “Thatbeganwhen Khadir, who was one of the nobles of the Children ofIsrael, usedto pass by a monk in his cell. The monk used to meet himand he taughthim Islam. When Khadir reached adolescence, his fathermarried him toa woman. He taught her and made her promise not toteach it to anyone.He used not to touch women, so he divorced her,then his fathermarried him to another woman, and he taught her andmade her promisenot to teach it to anyone. One of them kept thesecret but the otherdisclosed it, so he fled until he came to anisland in the sea. Twomen came, gathering firewood, and saw him. Oneof them kept the secretbut the other disclosed it and said: ‘Ihave seen Khadir.’ It wassaid: ‘Who else saw him besides you?’He said: ‘So-and-so.’ (The otherman) was questioned but he keptsilent. According to their religion,the liar was to be killed. Thewoman who had kept the secret gotmarried, and while she was combingthe hair of Pharoah’s daughter, shedropped the comb and said: ‘MayPharoah perish!’ (The daughter) toldher father about that. Thewoman had two sons and a husband. (Pharoah)sent for them, and triedto make the woman and her husband give uptheir religion, but theyrefused. He said: ‘I am going to kill you.’They said: ‘Itwould be an act of kindness on your part, if you killus, to put usin one grave.’ So he did that.” When the Prophet (ﷺ)was takenon the Night Journey (Isra’), he noticed a good fragranceand askedJibril about it and he told him.”",
      "chain": [
        "30288",
        "20733",
        "20710",
        "11019",
        "11028",
        "17",
        "39"
      ]
    }
  ],
  "total_hadiths": 88
}