{
  "id": "39005",
  "name": "Ahmed bin 'Umar al-Wky'y Abu أحمد بن عمر الوكيعي",
  "full_name": "Ahmed bin 'Umar al-Wky'y Abu أحمد بن عمر الوكيعي",
  "grade": "3rd Century AH",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah]"
    ],
    "tags": [
      "Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "2750",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثني أحمد بن عمر الوكيعي، حدثنا حسين بن علي، عن زائدة، عن سليمان، عن مسلم البطين، عن سعيد بن جبير، عن ابن عباس، - رضى الله عنهما - قال جاء رجل إلى النبي صلى الله عليه وسلم فقال يا رسول الله إن أمي ماتت وعليها صوم شهر أفأقضيه عنها فقال ‏\"‏ لو كان على أمك دين أكنت قاضيه عنها ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ فدين الله أحق أن يقضى ‏\"‏ ‏.‏ قال سليمان فقال الحكم وسلمة بن كهيل جميعا ونحن جلوس حين حدث مسلم بهذا الحديث فقالا سمعنا مجاهدا يذكر هذا عن ابن عباس‏.‏",
      "text_en": " Ibn 'Abbas (Allah be pleased with them) reported:                      A man came to the Apostle of Allah (may peace be upon him) and said: Messenger of Allah, my mother has died (in a state) that she had to observe fasts of a month (of Ramadan). Should I complete (them) on her behalf? thereupon he (the Holy Prophet) said: Would you not pay the debt if your mother had died (without paying it)? He said: Yes. He (the Holy Prophet) said: The debt of Allah deserves more that it should he paid.",
      "chain": [
        "39005",
        "20315",
        "20320",
        "11060",
        "11393",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "7365",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "حدثنا أبو كريب، وأحمد بن عمر الوكيعي، قالا حدثنا ابن فضيل، عن أبيه، عن  أبي حازم، عن أبي هريرة، يرفعه قال ‏\"‏ ما بين منكبى الكافر في النار مسيرة ثلاثة أيام للراكب المسرع ‏\"‏ ‏.‏ ولم يذكر الوكيعي ‏\"‏ في النار ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported directly from Allah's Messenger (may peace be upon him) that he said:                      The distance of the two shoulders of the non-believer in Hell will be a three-day journey for a swift rider.",
      "chain": [
        "30216",
        "39005",
        "20356",
        "20349",
        "11172"
      ]
    }
  ],
  "total_hadiths": 2
}