{
  "id": "391",
  "name": "Abu Qatada ibn Rab'i ( أبو قتادة بن ربعي الأنصاري ( رضي الله عنه",
  "full_name": "Abu Qatada ibn Rab'i ( أبو قتادة بن ربعي الأنصاري ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medinah"
    },
    "death": {
      "date_hijri": "54",
      "date_gregorian": "674",
      "date_display": null,
      "place": "Medinah",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina",
      "Kufa"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ ع  -  صحابة ]"
    ],
    "tags": [
      "Ansar",
      "Khazraj",
      "B.Jusham B.al-Khazraj",
      "B.Salima",
      "B.'Ubaid",
      "Uhud",
      "Ridhwan"
    ]
  },
  "parents": [],
  "spouses": [
    {
      "id": "1057",
      "name": "Sulafa bint al-Bara' bin Ma'rur ( سلافة بنت البراء بن معرور الأنصارية ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "siblings": [],
  "children": [
    {
      "id": "11804",
      "name": "'Abdullah bin Abi Qatada Ibn Rab'i عبد الله بن أبي قتادة الأنصاري السلمي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11805",
      "name": "'Abdur Rahman bin Abi Qatada Ibn Rab'i عبد الرحمن بن أبي قتادة الأنصاري السلمي",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "11806",
      "name": "Thabit bin Abi Qatada Ibn Rab'i ثابت بن أبي قتادة الأنصاري السلمي",
      "grade": "Follower(Tabi')"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "3",
      "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "32",
      "name": "Mu'adh ibn Jabal ( معاذ بن جبل بن عمرو بن أوس ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "34",
      "name": "Jabir ibn 'Abdullah ( جابر بن عبد الله بن عمرو السلمي الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11806",
      "name": "Thabit bin Abi Qatada Ibn Rab'i ثابت بن أبي قتادة الأنصاري السلمي",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "11804",
      "name": "'Abdullah bin Abi Qatada Ibn Rab'i عبد الله بن أبي قتادة الأنصاري السلمي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11224",
      "name": "Nafi' bin 'Abbas/'Ayyash نافع بن عباس/بن عياش الأقرع",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11865",
      "name": "'Abdullah bin Rbah عبد الله بن رباح الأنصاري أبو خالد",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "1134",
      "name": "'Abdur Rahman bin Ka'b bin Malik ( عبد الرحمن بن كعب بن مالك السلمي ( رضي الله عنه",
      "grade": "Comp.(RA) [2nd Generation]"
    },
    {
      "id": "10567",
      "name": "Abu Salama bin 'Abdur Rahman أبو سلمة بن عبد الرحمن بن عوف",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10697",
      "name": "'Abdullah bin Ma'bd عبد الله بن معبد الزماني",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11035",
      "name": "Ibn Sirin محمد بن سيرين الأنصاري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11726",
      "name": "Nubhan Abu Salah al-Madni نبهان الجمحي أبو صالح",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "1155",
      "name": "Kabsha bint Ka'b bin Malik ( كبشة بنت كعب بن مالك الأنصارية ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11020",
      "name": "'Ata ibn Yasar عطاء بن يسار أبو محمد مولى ميمونة",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11048",
      "name": "Muhammad bin al-Munkdar bin 'Abdullah محمد بن المنكدر بن عبد الله بن الهدير",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "153",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا معاذ بن فضالة، قال حدثنا هشام  هو الدستوائي  عن يحيى بن أبي كثير، عن عبد الله بن أبي قتادة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا شرب أحدكم فلا يتنفس في الإناء، وإذا أتى الخلاء فلا يمس ذكره بيمينه، ولا يتمسح بيمينه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Qatada:                     Allah's Apostle said, \"Whenever anyone of you drinks water, he should not breathe in the drinking utensil, and whenever anyone of you goes to a lavatory, he should neither touch his penis nor clean his private parts with his right hand.\"",
      "chain": [
        "30177",
        "20295",
        "11449",
        "11804",
        "391"
      ]
    },
    {
      "hadith_no": "154",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا محمد بن يوسف، قال حدثنا الأوزاعي، عن يحيى بن أبي كثير، عن عبد الله بن أبي قتادة، عن أبيه، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا بال أحدكم فلا يأخذن ذكره بيمينه، ولا يستنجي بيمينه، ولا يتنفس في الإناء ‏\"‏‏.‏",
      "text_en": " Narrated Abu Qatada:                     The Prophet said, \"Whenever anyone of you makes water he should not hold his penis or clean his private parts with his right hand. (And while drinking) one should not breathe in the drinking utensil .\"",
      "chain": [
        "30388",
        "20024",
        "11449",
        "11804",
        "391"
      ]
    },
    {
      "hadith_no": "516",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن عامر بن عبد الله بن الزبير، عن عمرو بن سليم الزرقي، عن أبي قتادة الأنصاري، أن رسول الله صلى الله عليه وسلم كان يصلي وهو حامل أمامة بنت زينب بنت رسول الله صلى الله عليه وسلم ولأبي العاص بن ربيعة بن عبد شمس، فإذا سجد وضعها، وإذا قام حملها‏.‏",
      "text_en": " Narrated Abu Qatada Al-Ansari:                     Allah's Apostle was praying and he was carrying Umama the daughters of Zainab, the daughter of Allah's Apostle and she was the daughter of 'As bin Rabi`a bin `Abd Shams. When he prostrated, he put her down and when he stood, he carried her (on his neck).",
      "chain": [
        "30355",
        "20001",
        "11178",
        "1544",
        "391"
      ]
    },
    {
      "hadith_no": "595",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا عمران بن ميسرة، قال حدثنا محمد بن فضيل، قال حدثنا حصين، عن عبد الله بن أبي قتادة، عن أبيه، قال سرنا مع النبي صلى الله عليه وسلم ليلة فقال بعض القوم لو عرست بنا يا رسول الله‏.‏ قال ‏\"‏ أخاف أن تناموا عن الصلاة ‏\"‏‏.‏ قال بلال أنا أوقظكم‏.‏ فاضطجعوا وأسند بلال ظهره إلى راحلته، فغلبته عيناه فنام، فاستيقظ النبي صلى الله عليه وسلم وقد طلع حاجب الشمس فقال ‏\"‏ يا بلال أين ما قلت ‏\"‏‏.‏ قال ما ألقيت على نومة مثلها قط‏.‏ قال ‏\"‏ إن الله قبض أرواحكم حين شاء، وردها عليكم حين شاء، يا بلال قم فأذن بالناس بالصلاة ‏\"‏‏.‏ فتوضأ فلما ارتفعت الشمس وابياضت قام فصلى‏.‏",
      "text_en": " Narrated `Abdullah bin Abi Qatada:                     My father said, \"One night we were traveling with the Prophet and some people said, 'We wish that Allah's Apostle would take a rest along with us during the last hours of the night.' He said, 'I am afraid that you will sleep and miss the (Fajr) prayer.' Bilal said, 'I will make you get up.' So all slept and Bilal rested his back against his Rahila and he too was overwhelmed (by sleep) and slept. The Prophet got up when the edge of the sun had risen and said, 'O Bilal! What about your statement?' He replied, 'I have never slept such a sleep.' The Prophet said, 'Allah captured your souls when He wished, and released them when He wished. O Bilal! Get up and pronounce the Adhan for the prayer.' The Prophet performed ablution and when the sun came up and became bright, he stood up and prayed.\"",
      "chain": [
        "30156",
        "20356",
        "15097",
        "11804",
        "391"
      ]
    },
    {
      "hadith_no": "635",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو نعيم، قال حدثنا شيبان، عن يحيى، عن عبد الله بن أبي قتادة، عن أبيه، قال بينما نحن نصلي مع النبي صلى الله عليه وسلم إذ سمع جلبة رجال فلما صلى قال ‏\"‏ ما شأنكم ‏\"‏‏.‏ قالوا استعجلنا إلى الصلاة‏.‏ قال ‏\"‏ فلا تفعلوا، إذا أتيتم الصلاة فعليكم بالسكينة، فما أدركتم فصلوا وما فاتكم فأتموا ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Abi Qatada:                     My father said, \"While we were praying with the Prophet he heard the noise of some people. After the prayer he said, 'What is the matter?' They replied 'We were hurrying for the prayer.' He said, 'Do not make haste for the prayer, and whenever you come for the prayer, you should come with calmness, and pray whatever you get (with the people) and complete the rest which you have missed.\"",
      "chain": [
        "20348",
        "20240",
        "11449",
        "11804",
        "391"
      ]
    },
    {
      "hadith_no": "637",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا مسلم بن إبراهيم، قال حدثنا هشام، قال كتب إلى يحيى عن عبد الله بن أبي قتادة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا أقيمت الصلاة فلا تقوموا حتى تروني ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Abi Qatada:                     My father said. \"Allah's Apostle said, 'If the Iqama is pronounced then do not stand for the prayer till you see me (in front of you).' \"",
      "chain": [
        "20285",
        "20295",
        "11804",
        "391"
      ]
    },
    {
      "hadith_no": "638",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو نعيم، قال حدثنا شيبان، عن يحيى، عن عبد الله بن أبي قتادة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا أقيمت الصلاة فلا تقوموا حتى تروني وعليكم بالسكينة ‏\"‏‏.‏ تابعه علي بن المبارك‏.‏",
      "text_en": " Narrated `Abdullah bin Abi Qatada:                      My father said, \"Allah's Apostle said, 'If the Iqama is pronounced, then do not stand for the prayer till you see me (in front of you) and do it calmly.' \"",
      "chain": [
        "20348",
        "20240",
        "11449",
        "11804",
        "391"
      ]
    },
    {
      "hadith_no": "759",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو نعيم، قال حدثنا شيبان، عن يحيى، عن عبد الله بن أبي قتادة، عن أبيه، قال كان النبي صلى الله عليه وسلم يقرأ في الركعتين الأوليين من صلاة الظهر بفاتحة الكتاب وسورتين، يطول في الأولى، ويقصر في الثانية، ويسمع الآية أحيانا، وكان يقرأ في العصر بفاتحة الكتاب وسورتين، وكان يطول في الأولى، وكان يطول في الركعة الأولى من صلاة الصبح، ويقصر في الثانية‏.‏",
      "text_en": " Narrated `Abdullah bin Abi Qatada:                     My father said, \"The Prophet in Zuhr prayers used to recite Al-Fatiha along with two other Suras in the first two rak`at: a long one in the first rak`a and a shorter (Sura) in the second, and at times the verses were audible. In the `Asr prayer the Prophet used to recite Al-Fatiha and two more Suras in the first two rak`at and used to prolong the first rak`a. And he used to prolong the first rak`a of the Fajr prayer and shorten the second.",
      "chain": [
        "20348",
        "20240",
        "11449",
        "11804",
        "391"
      ]
    },
    {
      "hadith_no": "762",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا المكي بن إبراهيم، عن هشام، عن يحيى بن أبي كثير، عن عبد الله بن أبي قتادة، عن أبيه، قال كان النبي صلى الله عليه وسلم يقرأ في الركعتين من الظهر والعصر بفاتحة الكتاب، وسورة سورة، ويسمعنا الآية أحيانا‏.‏",
      "text_en": " Narrated `Abdullah bin Abi Qatada:                     My father said, \"The Prophet used to recite Al-Fatiha along with another Sura in the first two rak`at of the Zuhr and the `Asr prayers and at times a t verse or so was audible to us.\"",
      "chain": [
        "20202",
        "20295",
        "11449",
        "11804",
        "391"
      ]
    },
    {
      "hadith_no": "776",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا موسى بن إسماعيل، قال حدثنا همام، عن يحيى، عن عبد الله بن أبي قتادة، عن أبيه، أن النبي صلى الله عليه وسلم كان يقرأ في الظهر في الأوليين بأم الكتاب وسورتين، وفي الركعتين الأخريين بأم الكتاب، ويسمعنا الآية، ويطول في الركعة الأولى ما لا يطول في الركعة الثانية، وهكذا في العصر وهكذا في الصبح‏.‏",
      "text_en": " Narrated `Abdullah bin Abi Qatada:                     My father said, \"The Prophet uses to recite Al-Fatiha followed by another Sura in the first two rak`at of the prayer and used to recite only Al-Fatiha in the last two rak`at of the Zuhr prayer. Sometimes a verse or so was audible and he used to prolong the first rak`a more than the second and used to do the same in the `Asr and Fajr prayers.\"",
      "chain": [
        "20040",
        "20297",
        "11449",
        "11804",
        "391"
      ]
    },
    {
      "hadith_no": "778",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا الأوزاعي، حدثني يحيى بن أبي كثير، حدثني عبد الله بن أبي قتادة، عن أبيه، أن النبي صلى الله عليه وسلم كان يقرأ بأم الكتاب وسورة معها في الركعتين الأوليين من صلاة الظهر وصلاة العصر، ويسمعنا الآية أحيانا، وكان يطيل في الركعة الأولى‏.‏",
      "text_en": " Narrated `Abdullah bin Abi Qatada:                     My father said, \"The Prophet used to recite Al-Fatiha along with another Sura in the first two rak`at of the Zuhr and `Asr prayers. A verse or so was audible at times and he used to prolong the first rak`a.\"",
      "chain": [
        "30388",
        "20024",
        "11449",
        "11804",
        "391"
      ]
    },
    {
      "hadith_no": "779",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو نعيم، حدثنا هشام، عن يحيى بن أبي كثير، عن عبد الله بن أبي قتادة، عن أبيه، أن النبي صلى الله عليه وسلم كان يطول في الركعة الأولى من صلاة الظهر، ويقصر في الثانية، ويفعل ذلك في صلاة الصبح‏.‏",
      "text_en": " Narrated `Abdullah bin Abi Qatada:                     My father said, \"The Prophet used to prolong the first rak`a of the Zuhr prayer and shorten the second one and used to do the same in the Fajr prayer.\"",
      "chain": [
        "20348",
        "20295",
        "11449",
        "11804",
        "391"
      ]
    },
    {
      "hadith_no": "1167",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا المكي بن إبراهيم، عن عبد الله بن سعيد، عن عامر بن عبد الله بن الزبير، عن عمرو بن سليم الزرقي، سمع أبا قتادة بن ربعي الأنصاري   رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ إذا دخل أحدكم المسجد فلا يجلس حتى يصلي ركعتين ‏\"‏‏.‏",
      "text_en": " Narrated Abu Qatada bin Rabi Al-Ansari;:                     The Prophet said, \"If anyone of you enters a Mosque, he should not sit until he has offered a tworak` at prayer.\"",
      "chain": [
        "20202",
        "11184",
        "11178",
        "1544",
        "391"
      ]
    },
    {
      "hadith_no": "1853",
      "source": " Sahih Bukhari ",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا سعيد بن الربيع، حدثنا علي بن المبارك، عن يحيى، عن عبد الله بن أبي قتادة، أن أباه، حدثه قال انطلقنا مع النبي صلى الله عليه وسلم عام الحديبية فأحرم أصحابه، ولم أحرم، فأنبئنا بعدو بغيقة فتوجهنا نحوهم، فبصر أصحابي بحمار وحش، فجعل بعضهم يضحك إلى بعض، فنظرت فرأيته فحملت عليه الفرس، فطعنته، فأثبته، فاستعنتهم، فأبوا أن يعينوني، فأكلنا منه، ثم لحقت برسول الله صلى الله عليه وسلم وخشينا أن نقتطع، أرفع فرسي شأوا، وأسير عليه شأوا، فلقيت رجلا من بني غفار في جوف الليل فقلت أين تركت رسول الله صلى الله عليه وسلم فقال تركته بتعهن وهو قائل السقيا‏.‏ فلحقت برسول الله صلى الله عليه وسلم حتى أتيته فقلت يا رسول الله، إن أصحابك أرسلوا يقرءون عليك السلام ورحمة الله وبركاته، وإنهم قد خشوا أن يقتطعهم العدو دونك، فانظرهم، ففعل فقلت يا رسول الله، إنا اصدنا حمار وحش، وإن عندنا فاضلة‏.‏ فقال رسول الله صلى الله عليه وسلم لأصحابه ‏\"‏ كلوا ‏\"‏‏.‏ وهم محرمون‏.‏",
      "text_en": " Narrated `Abdullah bin Abu Qatada:                     That his father said \"We proceeded with the Prophet in the year of Al-Hudaibiya and his companions assumed Ihram but I did not. We were informed that some enemies were at Ghaiqa and so we went on towards them. My companions saw an onager and some of them started laughing among themselves. I looked and saw it. I chased it with my horse and stabbed and caught it. I wanted some help from my companions but they refused. (I slaughtered it all alone). We all ate from it (i.e. its meat). Then I followed Allah's Apostle lest we should be left behind. At times I urged my horse to run at a galloping speed and at other times at an ordinary slow speed. On the way I met a man from the tribe of Bani Ghifar at midnight. I asked him where he had left Allah's Apostle . The man replied that he had left the Prophet at a place called Ta'hun and he had the intention of having the midday rest at As-Suqya. So, I followed Allah's Apostle till I reached him and said, \"O Allah's Apostle! I have been sent by my companions who send you their greetings and compliments and ask for Allah's Mercy and Blessings upon you. They were afraid lest the enemy might intervene between you and them; so please wait for them.\" So he did. Then I said, \"O Allah's Apostle! We have hunted an onager and have some of it (i.e. its meat) left over.\" Allah's Apostle told his companions to eat the meat although all of them were in a state of Ihram.\"",
      "chain": [
        "20231",
        "20449",
        "11449",
        "11804",
        "391"
      ]
    },
    {
      "hadith_no": "1854",
      "source": " Sahih Bukhari ",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا سفيان، حدثنا صالح بن كيسان، عن أبي محمد، نافع مولى أبي قتادة سمع أبا قتادة  رضى الله عنه  قال كنا مع النبي صلى الله عليه وسلم بالقاحة من المدينة على ثلاث ح‏.‏ وحدثنا علي بن عبد الله حدثنا سفيان حدثنا صالح بن كيسان عن أبي محمد عن أبي قتادة  رضى الله عنه  قال كنا مع النبي صلى الله عليه وسلم بالقاحة، ومنا المحرم، ومنا غير المحرم، فرأيت أصحابي يتراءون شيئا فنظرت، فإذا حمار وحش  يعني وقع سوطه  فقالوا لا نعينك عليه بشىء، إنا محرمون‏.‏ فتناولته فأخذته، ثم أتيت الحمار من وراء أكمة، فعقرته، فأتيت به أصحابي، فقال بعضهم كلوا‏.‏ وقال بعضهم لا تأكلوا‏.‏ فأتيت النبي صلى الله عليه وسلم وهو أمامنا، فسألته فقال ‏\"‏ كلوه حلال ‏\"‏‏.‏ قال لنا عمرو اذهبوا إلى صالح فسلوه عن هذا وغيره، وقدم علينا ها هنا‏.‏",
      "text_en": " Narrated Abu Qatada:                     We were in the company of the Prophet at a place called Al-Qaha (which is at a distance of three stages of journey from Medina). Abu Qatada narrated through another group of narrators: We were in the company of the Prophet at a place called Al-Qaha and some of us had assumed Ihram while the others had not. I noticed that some of my companions were watching something, so I looked up and saw an onager. (I rode my horse and took the spear and whip) but my whip fell down (and I asked them to pick it up for me) but they said, \"We will not help you by any means as we are in a state of Ihram.\" So, I picked up the whip myself and attacked the onager from behind a hillock and slaughtered it and brought it to my companions. Some of them said, \"Eat it.\" While some others said, \"Do not eat it.\" So, I went to the Prophet who was ahead of us and asked him about it, He replied, \"Eat it as it is Halal (i.e. it is legal to eat it).",
      "chain": [
        "30351",
        "20005",
        "11176",
        "11224",
        "391"
      ]
    },
    {
      "hadith_no": "1855",
      "source": " Sahih Bukhari ",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا أبو عوانة، حدثنا عثمان  هو ابن موهب  قال أخبرني عبد الله بن أبي قتادة، أن أباه، أخبره أن رسول الله صلى الله عليه وسلم خرج حاجا، فخرجوا معه فصرف طائفة منهم، فيهم أبو قتادة فقال خذوا ساحل البحر حتى نلتقي‏.‏ فأخذوا ساحل البحر، فلما انصرفوا أحرموا كلهم إلا أبو قتادة لم يحرم، فبينما هم يسيرون إذ رأوا حمر وحش، فحمل أبو قتادة على الحمر، فعقر منها أتانا، فنزلوا فأكلوا من لحمها، وقالوا أنأكل لحم صيد ونحن محرمون فحملنا ما بقي من لحم الأتان، فلما أتوا رسول الله صلى الله عليه وسلم قالوا يا رسول الله، إنا كنا أحرمنا وقد كان أبو قتادة لم يحرم، فرأينا حمر وحش فحمل عليها أبو قتادة، فعقر منها أتانا، فنزلنا فأكلنا من لحمها ثم قلنا أنأكل لحم صيد ونحن محرمون فحملنا ما بقي من لحمها‏.‏ قال ‏\"‏ منكم أحد أمره أن يحمل عليها، أو أشار إليها ‏\"‏‏.‏ قالوا لا‏.‏ قال ‏\"‏ فكلوا ما بقي من لحمها ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Abu Qatada:                     That his father had told him that Allah's Apostle set out for Hajj and so did his companions. He sent a batch of his companions by another route and Abu Qatada was one of them. The Prophet said to them, \"Proceed along the seashore till we meet all together.\" So, they took the route of the seashore, and when they started all of them assumed Ihram except Abu Qatada. While they were proceeding on, his companions saw a group of onagers. Abu Qatada chased the onagers and attacked and wounded a sheonager. They got down and ate some of its meat and said to each other: \"How do we eat the meat of the game while we are in a state of Ihram?\" So, we (they) carried the rest of the she-onager's meat, and when they met Allah's Apostle they asked, saying, \"O Allah's Apostle! We assumed Ihram with the exception of Abu Qatada and we saw (a group) of onagers. Abu Qatada attacked them and wounded a she-onager from them. Then we got down and ate from its meat. Later, we said, (to each other), 'How do we eat the meat of the game and we are in a state of Ihram?' So, we carried the rest of its meat. The Prophet asked, \"Did anyone of you order Abu Qatada to attack it or point at it?\" They replied in the negative. He said, \"Then eat what is left of its meat.\"",
      "chain": [
        "20040",
        "20469",
        "18716",
        "11804",
        "391"
      ]
    },
    {
      "hadith_no": "2100",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن يحيى بن سعيد، عن ابن أفلح، عن أبي محمد، مولى أبي قتادة عن أبي قتادة  رضى الله عنه  قال خرجنا مع رسول الله صلى الله عليه وسلم عام حنين، فأعطاه  يعني درعا  فبعت الدرع، فابتعت به مخرفا في بني سلمة، فإنه لأول مال تأثلته في الإسلام‏.‏",
      "text_en": " Narrated Abu Qatada:                     We set out with Allah's Apostle in the year of Hunain, (the Prophet gave me an armor). I sold that armor and bought a garden in the region of the tribe of Bani Salama and that was the first property I got after embracing Islam.",
      "chain": [
        "20164",
        "20001",
        "11062",
        "11224",
        "391"
      ]
    },
    {
      "hadith_no": "2854",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا محمد بن أبي بكر، حدثنا فضيل بن سليمان، عن أبي حازم، عن عبد الله بن أبي قتادة، عن أبيه، أنه خرج مع النبي صلى الله عليه وسلم فتخلف أبو قتادة مع بعض أصحابه وهم محرمون وهو غير محرم، فرأوا حمارا وحشيا قبل أن يراه، فلما رأوه تركوه حتى رآه أبو قتادة، فركب فرسا له يقال له الجرادة، فسألهم أن يناولوه سوطه فأبوا، فتناوله فحمل فعقره، ثم أكل فأكلوا، فندموا فلما أدركوه قال ‏\"‏ هل معكم منه شىء ‏\"‏‏.‏ قال معنا رجله، فأخذها النبي صلى الله عليه وسلم فأكلها‏.‏",
      "text_en": " Narrated `Abdullah bin Abi Qatada:                     (from his father) Abu Qatada went out (on a journey) with Allah's Apostle but he was left behind with some of his companions who were in the state of Ihram. He himself was not in the state of Ihram. They saw an opener before he could see it. When they saw the opener, they did not speak anything till Abu Qatada saw it. So, he rode over his horse called Al-Jarada and requested them to give him his lash, but they refused. So, he himself took it and then attacked the opener and slaughtered it. He ate of its meat and his companions ate, too, but they regretted their eating. When they met the Prophet (they asked him about it) and he asked, \"Have you some of its meat (left) with you?\" Abu Qatada replied, \"Yes, we have its leg with us.\" So, the Prophet took and ate it.",
      "chain": [
        "30161",
        "20271",
        "11172",
        "11804",
        "391"
      ]
    },
    {
      "hadith_no": "2914",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن أبي النضر، مولى عمر بن عبيد الله عن نافع، مولى أبي قتادة الأنصاري عن أبي قتادة  رضى الله عنه  أنه كان مع رسول الله صلى الله عليه وسلم حتى إذا كان ببعض طريق مكة تخلف مع أصحاب له محرمين وهو غير محرم، فرأى حمارا وحشيا فاستوى على فرسه، فسأل أصحابه أن يناولوه سوطه فأبوا، فسألهم رمحه فأبوا، فأخذه ثم شد على الحمار فقتله، فأكل منه بعض أصحاب النبي صلى الله عليه وسلم، وأبى بعض، فلما أدركوا رسول الله صلى الله عليه وسلم سألوه عن ذلك قال ‏\"‏ إنما هي طعمة أطعمكموها الله ‏\"‏‏.‏ وعن زيد بن أسلم عن عطاء بن يسار عن أبي قتادة في الحمار الوحشي مثل حديث أبي النضر قال ‏\"‏ هل معكم من لحمه شىء ‏\"‏‏.‏",
      "text_en": " Narrated Abu Qatada:                     That he was in the company of Allah's Apostle and when they had covered a portion of the road to Mecca, he and some of the companions lagged behind. The latter were in a state of Ihram, while he was not. He saw an onager and rode his horse and requested his companions to give him his lash but they refused. Then he asked them to give him his spear but they refused, so he took it himself, attacked the onager, and killed it. Some of the companions of the Prophet ate of it while some others refused to eat. When they caught up with Allah's Apostle they asked him about that, and he said, \"That was a meal Allah fed you with.\" (It is also said that Allah's Apostle asked, \"Have you got something of its meat?\")",
      "chain": [
        "30355",
        "20001",
        "11164",
        "11224",
        "391"
      ]
    },
    {
      "hadith_no": "3142",
      "source": " Sahih Bukhari ",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن يحيى بن سعيد، عن ابن أفلح، عن أبي محمد، مولى أبي قتادة عن أبي قتادة  رضى الله عنه  قال خرجنا مع رسول الله صلى الله عليه وسلم عام حنين، فلما التقينا كانت للمسلمين جولة، فرأيت رجلا من المشركين علا رجلا من المسلمين، فاستدرت حتى أتيته من ورائه حتى ضربته بالسيف على حبل عاتقه، فأقبل على فضمني ضمة وجدت منها ريح الموت، ثم أدركه الموت فأرسلني، فلحقت عمر بن الخطاب فقلت ما بال الناس قال أمر الله، ثم إن الناس رجعوا، وجلس النبي صلى الله عليه وسلم فقال ‏\"‏ من قتل قتيلا له عليه بينة فله سلبه ‏\"‏‏.‏ فقمت فقلت من يشهد لي ثم جلست ثم قال ‏\"‏ من قتل قتيلا له عليه بينة فله سلبه ‏\"‏ فقمت فقلت من يشهد لي ثم جلست، ثم قال الثالثة مثله فقال رجل صدق يا رسول الله، وسلبه عندي فأرضه عني‏.‏ فقال أبو بكر الصديق  رضى الله عنه لاها الله إذا يعمد إلى أسد من أسد الله يقاتل عن الله ورسوله صلى الله عليه وسلم يعطيك سلبه‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ صدق ‏\"‏‏.‏ فأعطاه فبعت الدرع، فابتعت به مخرفا في بني سلمة، فإنه لأول مال تأثلته في الإسلام‏.‏",
      "text_en": " Narrated Abu Qatada:                     We set out in the company of Allah's Apostle on the day (of the battle) of Hunain. When we faced the enemy, the Muslims retreated and I saw a pagan throwing himself over a Muslim. I turned around and came upon him from behind and hit him on the shoulder with the sword He (i.e. the pagan) came towards me and seized me so violently that I felt as if it were death itself, but death overtook him and he released me. I followed `Umar bin Al Khattab and asked (him), \"What is wrong with the people (fleeing)?\" He replied, \"This is the Will of Allah,\" After the people returned, the Prophet sat and said, \"Anyone who has killed an enemy and has a proof of that, will posses his spoils.\" I got up and said, \"Who will be a witness for me?\" and then sat down. The Prophet again said, \"Anyone who has killed an enemy and has proof of that, will possess his spoils.\" I (again) got up and said, \"Who will be a witness for me?\" and sat down. Then the Prophet said the same for the third time. I again got up, and Allah's Apostle said, \"O Abu Qatada! What is your story?\" Then I narrated the whole story to him. A man (got up and) said, \"O Allah's Apostle! He is speaking the truth, and the spoils of the killed man are with me. So please compensate him on my behalf.\" On that Abu Bakr As-Siddiq said, \"No, by Allah, he (i.e. Allah's Apostle ) will not agree to give you the spoils gained by one of Allah's Lions who fights on the behalf of Allah and His Apostle.\" The Prophet said, \"Abu Bakr has spoken the truth.\" So, Allah's Apostle gave the spoils to me. I sold that armor (i.e. the spoils) and with its price I bought a garden at Bani Salima, and this was my first property which I gained after my conversion to Islam.",
      "chain": [
        "20164",
        "20001",
        "11062",
        "11224",
        "391"
      ]
    },
    {
      "hadith_no": "3292",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا أبو المغيرة، حدثنا الأوزاعي، قال حدثني يحيى، عن عبد الله بن أبي قتادة، عن أبيه، عن النبي صلى الله عليه وسلم‏.‏ حدثني سليمان بن عبد الرحمن، حدثنا الوليد، حدثنا الأوزاعي، قال حدثني يحيى بن أبي كثير، قال حدثني عبد الله بن أبي قتادة، عن أبيه، قال قال النبي صلى الله عليه وسلم ‏\"‏ الرؤيا الصالحة من الله، والحلم من الشيطان فإذا حلم أحدكم حلما يخافه فليبصق عن يساره، وليتعوذ بالله من شرها، فإنها لا تضره ‏\"‏‏.‏",
      "text_en": " Narrated Abu Qatada:                     as below.Narrated Abu Qatada:The Prophet said, \"A good dream is from Allah, and a bad or evil dream is from Satan; so if anyone of you has a bad dream of which he gets afraid, he should spit on his left side and should seek Refuge with Allah from its evil, for then it will not harm him.\"",
      "chain": [
        "20442",
        "20024",
        "11449",
        "11804",
        "391"
      ]
    },
    {
      "hadith_no": "4202",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا سعيد بن الربيع، حدثنا علي بن المبارك، عن يحيى، عن عبد الله بن أبي قتادة، أن أباه، حدثه قال انطلقنا مع النبي صلى الله عليه وسلم عام الحديبية فأحرم أصحابه، ولم أحرم‏.‏",
      "text_en": " Narrated Abu Qatada:                     We set out with the Prophet in the year of Al-Hudaibiya, and all his companions assumed the state of Ihram but I did not.",
      "chain": [
        "20231",
        "20449",
        "11449",
        "11804",
        "391"
      ]
    },
    {
      "hadith_no": "4365",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن يحيى بن سعيد، عن عمر بن كثير بن أفلح، عن أبي محمد، مولى أبي قتادة عن أبي قتادة، قال خرجنا مع النبي صلى الله عليه وسلم عام حنين، فلما التقينا كانت للمسلمين جولة، فرأيت رجلا من المشركين، قد علا رجلا من المسلمين، فضربته من ورائه على حبل عاتقه بالسيف، فقطعت الدرع، وأقبل على فضمني ضمة وجدت منها ريح الموت، ثم أدركه الموت فأرسلني، فلحقت عمر فقلت ما بال الناس قال أمر الله عز وجل‏.‏ ثم رجعوا وجلس النبي صلى الله عليه وسلم فقال ‏\"‏ من قتل قتيلا له عليه بينة فله سلبه ‏\"‏‏.‏ فقلت من يشهد لي ثم جلست  قال  ثم قال النبي صلى الله عليه وسلم مثله فقمت فقلت من يشهد لي ثم جلست قال ثم قال النبي صلى الله عليه وسلم مثله، فقمت فقال ‏\"‏ مالك يا أبا قتادة ‏\"‏‏.‏ فأخبرته‏.‏ فقال رجل صدق وسلبه عندي، فأرضه مني‏.‏ فقال أبو بكر لاها الله، إذا لا يعمد إلى أسد من أسد الله يقاتل عن الله ورسوله صلى الله عليه وسلم فيعطيك سلبه‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ صدق فأعطه ‏\"‏‏.‏ فأعطانيه فابتعت به مخرفا في بني سلمة، فإنه لأول مال تأثلته في الإسلام‏.‏",
      "text_en": " Narrated Abu Qatada:                     We set out along with the Prophet during the year of (the battle of) Hunain, and when we faced the enemy, the Muslims (with the exception of the Prophet and some of his companions) retreated (before the enemy). I saw one of the pagans over-powering one of the Muslims, so I struck the pagan from behind his neck causing his armor to be cut off. The pagan headed towards me and pressed me so forcibly that I felt as if I was dying. Then death took him over and he released me. Afterwards I followed `Umar and said to him, \"What is wrong with the people?\" He said, \"It is the Order of Allah.\" Then the Muslims returned (to the battle after the flight) and (after overcoming the enemy) the Prophet sat and said, \"Whoever had killed an Infidel and has an evidence to this issue, will have the Salb (i.e. the belonging of the deceased e.g. clothes, arms, horse, etc).\" I (stood up) and said, \"Who will be my witness?\" and then sat down. Then the Prophet repeated his question. Then the Prophet said the same (for the third time). I got up and said, \"Who will be my witness?\" and then sat down. The Prophet asked his former question again. So I got up. The Prophet said, What is the matter, O Abu Qatada?\" So I narrated the whole story; A man said, \"Abu Qatada has spoken the truth, and the Salb of the deceased is with me, so please compensate Abu Qatada on my behalf.\" Abu Bakr said, \"No! By Allah, it will never happen that the Prophet will leave a Lion of Allah who fights for the Sake of Allah and His Apostle and give his spoils to you.\" The Prophet said, \"Abu Bakr has spoken the truth. Give it (the spoils) back to him (O man)!\" So he gave it to me and I bought a garden in (the land of) Banu Salama with it (i.e. the spoils) and that was the first property I got after embracing Islam.",
      "chain": [
        "30355",
        "20001",
        "11062",
        "10601",
        "11224",
        "391"
      ]
    },
    {
      "hadith_no": "4366",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "وقال الليث حدثني يحيى بن سعيد، عن عمر بن كثير بن أفلح، عن أبي محمد، مولى أبي قتادة أن أبا قتادة، قال لما كان يوم حنين نظرت إلى رجل من المسلمين يقاتل رجلا من المشركين، وآخر من المشركين يختله من ورائه ليقتله، فأسرعت إلى الذي يختله فرفع يده ليضربني، وأضرب يده، فقطعتها، ثم أخذني، فضمني ضما شديدا حتى تخوفت، ثم ترك فتحلل، ودفعته ثم قتلته، وانهزم المسلمون، وانهزمت معهم، فإذا بعمر بن الخطاب في الناس، فقلت له ما شأن الناس قال أمر الله، ثم تراجع الناس إلى رسول الله صلى الله عليه وسلم فقال رسول الله صلى الله عليه وسلم ‏\"‏ من أقام بينة على قتيل قتله فله سلبه ‏\"‏‏.‏ فقمت لألتمس بينة على قتيلي، فلم أر أحدا يشهد لي فجلست، ثم بدا لي، فذكرت أمره لرسول الله صلى الله عليه وسلم فقال رجل من جلسائه سلاح هذا القتيل الذي يذكر عندي فأرضه منه‏.‏ فقال أبو بكر كلا لا يعطه أصيبغ من قريش، ويدع أسدا من أسد الله يقاتل عن الله ورسوله صلى الله عليه وسلم قال فقام رسول الله صلى الله عليه وسلم فأداه إلى، فاشتريت منه خرافا فكان أول مال تأثلته في الإسلام‏.‏",
      "text_en": " Narrated Abu Qatada:                     When it was the day of (the battle of) Hunain, I saw a Muslim man fighting with one of the pagans and another pagan was hiding himself behind the Muslim in order to kill him. So I hurried towards the pagan who was hiding behind the Muslim to kill him, and he raised his hand to hit me but I hit his hand and cut it off. That man got hold of me and pressed me so hard that I was afraid (that I would die), then he knelt down and his grip became loose and I pushed him and killed him. The Muslims (excepting the Prophet and some of his companions) started fleeing and I too, fled with them. Suddenly I met `Umar bin Al-Khattab amongst the people and I asked him, \"What is wrong with the people?\" He said, \"It is the order of Allah\" Then the people returned to Allah's Apostle (after defeating the enemy). Allah's Apostle said, \"Whoever produces a proof that he has killed an infidel, will have the spoils of the killed man.\" So I got up to look for an evidence to prove that I had killed an infidel, but I could not find anyone to bear witness for me, so I sat down. Then it came to my mind (that I should speak of it) and I mentioned the case to Allah's Apostle. A man from the persons who were sitting with him (i.e. the Prophet), said, \"The arms of the deceased one whom he ( i.e. Abu Qatada) has mentioned, are with me, so please compensate him for it (i.e. the spoils),\" Abu Bakr said, \"No, Allah's Apostle will not give it (i.e. the spoils) to a weak humble person from Quraish and leave one of Allah's Lions who fights on behalf of Allah and His Apostle.\" Allah's Apostle then got up and gave that (spoils) to me, and I bought with it, a garden which was the first property I got after embracing Islam.",
      "chain": [
        "20023",
        "11062",
        "10601",
        "11224",
        "391"
      ]
    },
    {
      "hadith_no": "5461",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثني محمد بن المثنى، قال حدثني عثمان بن عمر، حدثنا فليح، حدثنا أبو حازم المدني، حدثنا عبد الله بن أبي قتادة، عن أبيه، قال خرجنا مع النبي صلى الله عليه وسلم نحو مكة‏.‏",
      "text_en": " Narrated Abu Qatada:                     We went out towards Mecca with the Prophet.",
      "chain": [
        "30170",
        "20262",
        "20169",
        "11172",
        "11804",
        "391"
      ]
    },
    {
      "hadith_no": "5548",
      "source": " Sahih Bukhari ",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن أبي النضر، مولى عمر بن عبيد الله عن نافع، مولى أبي قتادة عن أبي قتادة، أنه كان مع رسول الله صلى الله عليه وسلم حتى إذا كان ببعض طريق مكة تخلف مع أصحاب له محرمين، وهو غير محرم، فرأى حمارا وحشيا، فاستوى على فرسه، ثم سأل أصحابه أن يناولوه سوطا، فأبوا فسألهم رمحه فأبوا فأخذه ثم شد على الحمار، فقتله فأكل منه بعض أصحاب رسول الله صلى الله عليه وسلم وأبى بعضهم، فلما أدركوا رسول الله صلى الله عليه وسلم سألوه عن ذلك فقال ‏\"‏ إنما هي طعمة أطعمكموها الله ‏\"‏‏.‏",
      "text_en": " Narrated Abu Qatada:                     that once he was with Allah's Apostle (on the way to Mecca). When he had covered some of the way to Mecca, he and some companions of his, who were in the state of lhram. remained behind the Prophet while Abu Qatada himself was not in the state of Ihram. Abu Qatada, seeing an onager rode his horse and asked his companions to hand him a whip, but they refused. He then asked them to hand him his spear, but they refused. Then he took it himself and attacked the onager and killed it. Some of the Companions of Allah's Apostle ate of it, but some others refused to eat. When they met Allah's Apostle they asked him about that. He said, \"It was meal given to you by Allah.\"",
      "chain": [
        "30103",
        "20001",
        "11164",
        "11224",
        "391"
      ]
    },
    {
      "hadith_no": "5550",
      "source": " Sahih Bukhari ",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا يحيى بن سليمان، قال حدثني ابن وهب، أخبرنا عمرو، أن أبا النضر، حدثه عن نافع، مولى أبي قتادة وأبي صالح مولى التوأمة سمعت أبا قتادة، قال كنت مع النبي صلى الله عليه وسلم فيما بين مكة والمدينة وهم محرمون وأنا رجل حل على فرس، وكنت رقاء على الجبال، فبينا أنا على ذلك إذ رأيت الناس متشوفين لشىء، فذهبت أنظر، فإذا هو حمار وحش فقلت لهم ما هذا قالوا لا ندري‏.‏ قلت هو حمار وحشي‏.‏ فقالوا هو ما رأيت‏.‏ وكنت نسيت سوطي فقلت لهم ناولوني سوطي‏.‏ فقالوا لا نعينك عليه‏.‏ فنزلت فأخذته، ثم ضربت في أثره، فلم يكن إلا ذاك، حتى عقرته، فأتيت إليهم فقلت لهم قوموا فاحتملوا‏.‏ قالوا لا نمسه‏.‏ فحملته حتى جئتهم به، فأبى بعضهم، وأكل بعضهم، فقلت أنا أستوقف لكم النبي صلى الله عليه وسلم فأدركته فحدثته الحديث فقال لي ‏\"‏ أبقي معكم شىء منه ‏\"‏‏.‏ قلت نعم‏.‏ فقال ‏\"‏ كلوا فهو طعم أطعمكموها الله ‏\"‏‏.‏",
      "text_en": " Narrated Abu Qatada:                     I was with the Prophet (on a journey) between Mecca and Medina, and all of them, (i.e. the Prophet and his companions) were in the state of Ihram, while I was not in that state. I was riding my horse and I used to be fond of ascending mountains. So while I was doing so I noticed that the people were looking at something. I went to see what it was, and behold it was an onager. I asked my companions, \"What is that?\" They said, \"We do not know.\" I said, \"It is an onager.' They said, \"It is what you have seen.\" I had left my whip, so I said to them, \"Hand to me my whip.\" They said, \"We will not help you in that (in hunting the onager).\" I got down, took my whip and chased the animal (on my horse) and did not stop till I killed it. I went to them and said, \"Come on, carry it!\" But they said, \"We will not even touch it.\" At last I alone carried it and brought it to them. Some of them ate of it and some refused to eat of it. I said (to them), \"I will ask the Prophet about it (on your behalf).\" When I met the Prophet, I told him the whole story. He said to me, \"Has anything of it been left with you?\" I said, \"Yes.\" He said, \"Eat, for it is a meal Allah has offered to you.\"",
      "chain": [
        "30220",
        "20029",
        "20377",
        "20390",
        "391"
      ]
    },
    {
      "hadith_no": "5662",
      "source": " Sahih Bukhari ",
      "chapter": "Drinks - كتاب الأشربة",
      "chapter_no": "74",
      "text_ar": "حدثنا مسلم، حدثنا هشام، أخبرنا يحيى بن أبي كثير، عن عبد الله بن أبي قتادة، عن أبيه، قال نهى النبي صلى الله عليه وسلم أن يجمع بين التمر والزهو، والتمر والزبيب، ولينبذ كل واحد منهما على حدة‏.‏",
      "text_en": " Narrated Abu Qatada:                     The Prophet forbade the mixing of ripe and unripe dates and also the mixing of dates and raisins (for preparing a syrup) but the syrup of each kind of fruit should be prepared separately. ( One may have such drinks as long as it is fresh )",
      "chain": [
        "20285",
        "20295",
        "11449",
        "11804",
        "391"
      ]
    },
    {
      "hadith_no": "5690",
      "source": " Sahih Bukhari ",
      "chapter": "Drinks - كتاب الأشربة",
      "chapter_no": "74",
      "text_ar": "حدثنا أبو نعيم، حدثنا شيبان، عن يحيى، عن عبد الله بن أبي قتادة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا شرب أحدكم فلا يتنفس في الإناء، وإذا بال أحدكم فلا يمسح ذكره بيمينه، وإذا تمسح أحدكم فلا يتمسح بيمينه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Qatada:                     Allah's Apostle said, \"When you drink (water), do not breath in the vessel; and when you urinate, do not touch your penis with your right hand. And when you cleanse yourself after defecation, do not use your right hand.\"",
      "chain": [
        "20348",
        "20240",
        "11449",
        "11804",
        "391"
      ]
    },
    {
      "hadith_no": "5806",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا خالد بن مخلد، حدثنا سليمان، عن يحيى بن سعيد، قال سمعت أبا سلمة، قال سمعت أبا قتادة، يقول سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ الرؤيا من الله، والحلم من الشيطان، فإذا رأى أحدكم شيئا يكرهه فلينفث حين يستيقظ ثلاث مرات ويتعوذ من شرها، فإنها لا تضره ‏\"‏‏.‏ وقال أبو سلمة وإن كنت لأرى الرؤيا أثقل على من الجبل، فما هو إلا أن سمعت هذا الحديث فما أباليها‏.‏",
      "text_en": " Narrated Abu Qatada:                     I heard the Prophet saying, \"A good dream is from Allah, and a bad dream is from Satan. So if anyone of you sees (in a dream) something he dislikes, when he gets up he should blow thrice (on his left side) and seek refuge with Allah from its evil for then it will not harm him.\"",
      "chain": [
        "30463",
        "20160",
        "11062",
        "10567",
        "391"
      ]
    },
    {
      "hadith_no": "6062",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا أبو الوليد، حدثنا الليث، حدثنا سعيد المقبري، حدثنا عمرو بن سليم، حدثنا أبو قتادة، قال خرج علينا النبي صلى الله عليه وسلم وأمامة بنت أبي العاص على عاتقه، فصلى فإذا ركع وضعها، وإذا رفع رفعها‏.‏",
      "text_en": " Narrated Abu Qatada:                     The Prophet came out towards us, while carrying Umamah, the daughter of Abi Al-As (his granddaughter) over his shoulder. He prayed, and when he wanted to bow, he put her down, and when he stood up, he lifted her up.",
      "chain": [
        "20296",
        "20023",
        "11168",
        "1544",
        "391"
      ]
    },
    {
      "hadith_no": "6592",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن عبد ربه بن سعيد، عن محمد بن عمرو بن حلحلة، حدثني ابن كعب، عن أبي قتادة، عن النبي صلى الله عليه وسلم قال ‏\"‏ مستريح، ومستراح منه، المؤمن يستريح ‏\"‏‏.‏",
      "text_en": " Narrated Abu Qatada:                     The Prophet said, \"Relieved or relieving. And a believer is relieved (by death).",
      "chain": [
        "30175",
        "20031",
        "11191",
        "11537",
        "391"
      ]
    },
    {
      "hadith_no": "7070",
      "source": " Sahih Bukhari ",
      "chapter": "Interpretation of Dreams - كتاب التعبير",
      "chapter_no": "92",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زهير، حدثنا يحيى  هو ابن سعيد  قال سمعت أبا سلمة، قال سمعت أبا قتادة، عن النبي صلى الله عليه وسلم قال ‏\"‏ الرؤيا من الله، والحلم من الشيطان ‏\"‏‏.‏",
      "text_en": " Narrated Abu Qatada:                     The Prophet said, \"A true good dream is from Allah, and a bad dream is from Satan.\"",
      "chain": [
        "30184",
        "20321",
        "11062",
        "10567",
        "391"
      ]
    },
    {
      "hadith_no": "7072",
      "source": " Sahih Bukhari ",
      "chapter": "Interpretation of Dreams - كتاب التعبير",
      "chapter_no": "92",
      "text_ar": "حدثنا مسدد، حدثنا عبد الله بن يحيى بن أبي كثير  وأثنى عليه خيرا لقيته باليمامة  عن أبيه، حدثنا أبو سلمة، عن أبي قتادة، عن النبي صلى الله عليه وسلم قال ‏\"‏ الرؤيا الصالحة من الله، والحلم من الشيطان، فإذا حلم فليتعوذ منه وليبصق عن شماله، فإنها لا تضره ‏\"‏‏.‏ وعن أبيه حدثنا عبد الله بن أبي قتادة عن أبيه عن النبي صلى الله عليه وسلم مثله‏.‏",
      "text_en": " Narrated Abu Qatada:                     The Prophet said, \"A good dream that comes true is from Allah, and a bad dream is from Satan, so if anyone of you sees a bad dream, he should seek refuge with Allah from Satan and should spit on the left, for the bad dream will not harm him.\"",
      "chain": [
        "30175",
        "20435",
        "11449",
        "10567",
        "391"
      ]
    },
    {
      "hadith_no": "7081",
      "source": " Sahih Bukhari ",
      "chapter": "Interpretation of Dreams - كتاب التعبير",
      "chapter_no": "92",
      "text_ar": "حدثنا يحيى بن بكير، حدثنا الليث، عن عبيد الله بن أبي جعفر، أخبرني أبو سلمة، عن أبي قتادة، قال قال النبي صلى الله عليه وسلم ‏\"‏ الرؤيا الصالحة من الله، والحلم من الشيطان، فمن رأى شيئا يكرهه فلينفث عن شماله ثلاثا، وليتعوذ من الشيطان، فإنها لا تضره، وإن الشيطان لا يتزايا بي ‏\"‏‏.‏",
      "text_en": " Narrated Abu Qatada:                     The Prophet said, \"A good dream is from Allah, and a bad dream is from Satan. So whoever has seen (in a dream) something he dislike, then he should spit without saliva, thrice on his left and seek refuge with Allah from Satan, for it will not harm him, and Satan cannot appear in my shape.\"",
      "chain": [
        "30399",
        "20023",
        "11409",
        "10567",
        "391"
      ]
    },
    {
      "hadith_no": "7082",
      "source": " Sahih Bukhari ",
      "chapter": "Interpretation of Dreams - كتاب التعبير",
      "chapter_no": "92",
      "text_ar": "حدثنا خالد بن خلي، حدثنا محمد بن حرب، حدثني الزبيدي، عن الزهري، قال أبو سلمة قال أبو قتادة  رضى الله عنه  قال النبي صلى الله عليه وسلم ‏\"‏ من رآني فقد رأى الحق ‏\"‏‏.‏ تابعه يونس وابن أخي الزهري",
      "text_en": " Narrated Abu Qatada:                     The Prophet said, \"Whoever sees me (in a dream) then he indeed has seen the truth .\"",
      "chain": [
        "30333",
        "30373",
        "20459",
        "11013",
        "10567",
        "391"
      ]
    },
    {
      "hadith_no": "7091",
      "source": " Sahih Bukhari ",
      "chapter": "Interpretation of Dreams - كتاب التعبير",
      "chapter_no": "92",
      "text_ar": "حدثنا يحيى بن بكير، حدثنا الليث، عن عقيل، عن ابن شهاب، عن أبي سلمة، أن أبا قتادة الأنصاري   وكان من أصحاب النبي صلى الله عليه وسلم وفرسانه قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ الرؤيا من الله، والحلم من الشيطان، فإذا حلم أحدكم الحلم يكرهه فليبصق عن يساره وليستعذ بالله منه، فلن يضره ‏\"‏‏.‏",
      "text_en": " Narrated Abu Qatada Al-Ansari:                     (a companion of the Prophet and one of his cavalry men) \"I heard Allah's Apostle saying, \"A good dream is from Allah, and a bad dream is from Satan; so, if anyone of you had a bad dream which he disliked, then he should spit on his left and seek refuge with Allah from it, for it will not harm him.\"",
      "chain": [
        "30399",
        "20023",
        "11207",
        "11013",
        "10567",
        "391"
      ]
    },
    {
      "hadith_no": "7131",
      "source": " Sahih Bukhari ",
      "chapter": "Interpretation of Dreams - كتاب التعبير",
      "chapter_no": "92",
      "text_ar": "حدثنا سعيد بن الربيع، حدثنا شعبة، عن عبد ربه بن سعيد، قال سمعت أبا سلمة، يقول لقد كنت أرى الرؤيا فتمرضني حتى سمعت أبا قتادة يقول وأنا كنت لأرى الرؤيا تمرضني، حتى سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ الرؤيا الحسنة من الله، فإذا رأى أحدكم ما يحب فلا يحدث به إلا من يحب، وإذا رأى ما يكره فليتعوذ بالله من شرها، ومن شر الشيطان وليتفل ثلاثا ولا يحدث بها أحدا فإنها لن تضره ‏\"‏‏.‏",
      "text_en": " Narrated Abu Salama:                     I used to see a dream which would make me sick till I heard Abu Qatada saying, \"I too, used to see a dream which would make me sick till I heard the Prophet saying, \"A good dream is from Allah, so if anyone of you saw a dream which he liked, he should not tell it to anybody except to the one whom he loves, and if he saw a dream which he disliked, then he should seek refuge with Allah from its evil and from the evil of Satan, and spit three times (on his left) and should not tell it to anybody, for it will not harm him. \"",
      "chain": [
        "20231",
        "20020",
        "11191",
        "10567",
        "391"
      ]
    },
    {
      "hadith_no": "7258",
      "source": " Sahih Bukhari ",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثنا قتيبة، حدثنا الليث، عن يحيى، عن عمر بن كثير، عن أبي محمد، مولى أبي قتادة أن أبا قتادة، قال قال رسول الله صلى الله عليه وسلم يوم حنين ‏\"‏ من له بينة على قتيل قتله، فله سلبه ‏\"‏‏.‏ فقمت لألتمس بينة على قتيل، فلم أر أحدا يشهد لي، فجلست، ثم بدا لي فذكرت أمره إلى رسول الله صلى الله عليه وسلم فقال رجل من جلسائه سلاح هذا القتيل الذي يذكر عندي‏.‏ قال فأرضه منه‏.‏ فقال أبو بكر كلا لا يعطه أصيبغ من قريش ويدع أسدا من أسد الله يقاتل عن الله ورسوله‏.‏ قال فأمر رسول الله صلى الله عليه وسلم فأداه إلى فاشتريت منه خرافا فكان أول مال تأثلته‏.‏ قال لي عبد الله عن الليث فقام النبي صلى الله عليه وسلم فأداه إلى‏.‏ وقال أهل الحجاز الحاكم لا يقضي بعلمه، شهد بذلك في ولايته أو قبلها‏.‏ ولو أقر خصم عنده لآخر بحق في مجلس القضاء، فإنه لا يقضي عليه في قول بعضهم، حتى يدعو بشاهدين فيحضرهما إقراره‏.‏ وقال بعض أهل العراق ما سمع أو رآه في مجلس القضاء قضى به، وما كان في غيره لم يقض إلا بشاهدين‏.‏ وقال آخرون منهم بل يقضي به، لأنه مؤتمن، وإنما يراد من الشهادة معرفة الحق، فعلمه أكثر من الشهادة‏.‏ وقال بعضهم يقضي بعلمه في الأموال، ولا يقضي في غيرها‏.‏ وقال القاسم لا ينبغي للحاكم أن يمضي قضاء بعلمه دون علم غيره، مع أن علمه أكثر من شهادة غيره، ولكن فيه تعرضا لتهمة نفسه عند المسلمين، وإيقاعا لهم في الظنون، وقد كره النبي صلى الله عليه وسلم الظن فقال ‏\"‏ إنما هذه صفية ‏\"‏‏.‏",
      "text_en": " Narrated Abu Qatada:                     Allah's Apostle said on the Day of (the battle of) Hunain, \"Whoever has killed an infidel and has a proof or a witness for it, then the salb (arms and belongings of that deceased) will be for him.\" I stood up to seek a witness to testify that I had killed an infidel but I could not find any witness and then sat down. Then I thought that I should mention the case to Allah's Apostle I (and when I did so) a man from those who were sitting with him said, \"The arms of the killed person he has mentioned, are with me, so please satisfy him on my behalf.\" Abu Bakr said, \"No, he will not give the arms to a bird of Quraish and deprive one of Allah's lions of it who fights for the cause of Allah and His Apostle.\" Allah's Apostle I stood up and gave it to me, and I bought a garden with its price, and that was my first property which I owned through the war booty. The people of Hijaz said, \"A judge should not pass a judgment according to his knowledge, whether he was a witness at the time he was the judge or before that\" And if a litigant gives a confession in favor of his opponent in the court, in the opinion of some scholars, the judge should not pass a judgment against him till the latter calls two witnesses to witness his confession. And some people of Iraq said, \"A judge can pass a judgement according to what he hears or witnesses (the litigant's confession) in the court itself, but if the confession takes place outside the court, he should not pass the judgment unless two witnesses witness the confession.\" Some of them said, \"A judge can pass a judgement depending on his knowledge of the case as he is trust-worthy, and that a witness is Required just to reveal the truth. The judge's knowledge is more than the witness.\" Some said, \"A judge can judge according to his knowledge only in cases involving property, but in other cases he cannot.\" Al-Qasim said, \"A judge ought not to pass a judgment depending on his knowledge if other people do not know what he knows, although his knowledge is more than the witness of somebody else because he might expose himself to suspicion by the Muslims and cause the Muslims to have unreasonable doubt. \"",
      "chain": [
        "30367",
        "20023",
        "20031",
        "10601",
        "11224",
        "391"
      ]
    },
    {
      "hadith_no": "166",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا يحيى بن حبيب الحارثي، حدثنا حماد بن زيد، عن إسحاق، - وهو ابن سويد - أن أبا قتادة، حدث قال كنا عند عمران بن حصين في رهط منا وفينا بشير بن كعب فحدثنا عمران، يومئذ قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الحياء خير كله ‏\"‏ ‏.‏ قال أو قال ‏\"‏ الحياء كله خير ‏\"‏ ‏.‏ فقال بشير بن كعب إنا لنجد في بعض الكتب أو الحكمة أن منه سكينة ووقارا لله ومنه ضعف ‏.‏ قال فغضب عمران حتى احمرتا عيناه وقال ألا أراني أحدثك عن رسول الله صلى الله عليه وسلم وتعارض فيه ‏.‏ قال فأعاد عمران الحديث قال فأعاد بشير فغضب عمران قال فما زلنا نقول فيه إنه منا يا أبا نجيد إنه لا بأس به ‏.‏",
      "text_en": " It is narrated on the authority of Qatada. We were sitting with 'Imran b. Husain in a company and Bushair ibn Ka'b was also amongst us. 'Imran narrated to us that on a certain occasion the Messenger of Allah (may peace and blessings be upon him) said:                      Modesty is a virtue through and through, or said: Modesty is a goodness complete. Upon this Bushair ibn Ka'b said: Verily we find in certain books or books of (wisdom) that it is God-inspired peace of mind or sobriety for the sake of Allah and there is also a weakness in it. Imran was so much enraged that his eyes became red and he said: I am narrating to you the hadith of the Messenger of Allah (may peace be upon him) and you are contradicting it. He (the narrator) said: Imran reported the hadith, He (the narrator) said: Bushair repeated, (the same thing). Imran was enraged. He (the narrator) said: We asserted: Verily Bushair is one amongst us. Abu Nujaid! There is nothing wrong, with him (Bushair).",
      "chain": [
        "20022",
        "11575",
        "391"
      ]
    },
    {
      "hadith_no": "267",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا عبد الرحمن بن مهدي، عن همام، عن يحيى بن أبي كثير، عن عبد الله بن أبي قتادة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يمسكن أحدكم ذكره بيمينه وهو يبول ولا يتمسح من الخلاء بيمينه ولا يتنفس في الإناء ‏\"‏ ‏.‏",
      "text_en": " Abu Qatada reported it from his father:                      The Messenger of Allah (may peace be upon him) said: None of you should hold penis with his right hand while urinating, or wipe himself with his right hand in privy and should not breathe into the vessel (from which he drinks).",
      "chain": [
        "30399",
        "20033",
        "20297",
        "11449",
        "11804",
        "391"
      ]
    },
    {
      "hadith_no": "267",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا وكيع، عن هشام الدستوائي، عن يحيى بن أبي كثير، عن عبد الله بن أبي قتادة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا دخل أحدكم الخلاء فلا يمس ذكره بيمينه ‏\"‏ ‏.‏",
      "text_en": " Abu Qatada reported it from his father that the Messenger of Allah (may peace be upon him) said:                      When anyone amongst you enters the privy he should not touch his penis with his right hand.",
      "chain": [
        "30399",
        "20032",
        "20295",
        "11449",
        "11804",
        "391"
      ]
    },
    {
      "hadith_no": "267",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا الثقفي، عن أيوب، عن يحيى بن أبي كثير، عن عبد الله بن أبي قتادة، عن أبي قتادة، أن النبي صلى الله عليه وسلم نهى أن يتنفس في الإناء وأن يمس ذكره بيمينه وأن يستطيب بيمينه ‏.‏",
      "text_en": " Aba Qatada reported:                      The Messenger of Allah (way peace be upon him) forbade (us) to breathe into the venel, to touch the penis with the right hand and to wipe after relieving with right hand.",
      "chain": [
        "30421",
        "11015",
        "11449",
        "11804",
        "391"
      ]
    },
    {
      "hadith_no": "451",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "وحدثنا محمد بن المثنى العنزي، حدثنا ابن أبي عدي، عن الحجاج، - يعني الصواف - عن يحيى، - وهو ابن أبي كثير - عن عبد الله بن أبي قتادة، وأبي، سلمة عن أبي قتادة، قال كان رسول الله صلى الله عليه وسلم يصلي بنا فيقرأ في الظهر والعصر في الركعتين الأوليين بفاتحة الكتاب وسورتين ويسمعنا الآية أحيانا وكان يطول الركعة الأولى من الظهر ويقصر الثانية وكذلك في الصبح ‏.‏",
      "text_en": " Abu Qatada reported:                      The Messenger of Allah (may peace be upon him) led us in prayer and recited in the first two rak'ahs of the noon and afternoon prayers Surat al-Fitiha and two (other) surahs. And he would sometimes recite loud enough for us the verses. He would prolong the first rak'ah more than the second. And he acted similarly in the morning prayer.",
      "chain": [
        "30170",
        "20276",
        "11449",
        "11804",
        "10567",
        "391"
      ]
    },
    {
      "hadith_no": "451",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يزيد بن هارون، أخبرنا همام، وأبان بن يزيد، عن يحيى بن أبي كثير، عن عبد الله بن أبي قتادة، عن أبيه، أن النبي صلى الله عليه وسلم كان يقرأ في الركعتين الأوليين من الظهر والعصر بفاتحة الكتاب وسورة ويسمعنا الآية أحيانا ويقرأ في الركعتين الأخريين بفاتحة الكتاب ‏.‏",
      "text_en": " Abu Qatada reported it on the authority of his father:                      The Messenger of Allah (may peace be upon him) would recite in the first two rak'ahs of the noon and afternoon prayers the opening chapter of the Book and another surah. He would sometimes recite loud enough to make audible to us the verse and would recite in the last two rak'ahs Surat al-Faitiha (only).",
      "chain": [
        "30201",
        "20472",
        "20297",
        "20205",
        "11449",
        "11804",
        "391"
      ]
    },
    {
      "hadith_no": "1240",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا عبد الله بن مسلمة بن قعنب، وقتيبة بن سعيد، قالا حدثنا مالك، عن عامر بن عبد الله بن الزبير، ح وحدثنا يحيى بن يحيى، قال قلت لمالك حدثك عامر بن عبد الله بن الزبير، عن عمرو بن سليم الزرقي، عن أبي قتادة، أن رسول الله صلى الله عليه وسلم كان يصلي وهو حامل أمامة بنت زينب بنت رسول الله صلى الله عليه وسلم ولأبي العاص بن الربيع فإذا قام حملها وإذا سجد وضعها قال يحيى قال مالك نعم ‏.‏",
      "text_en": " Abu Qatadi reported:                      I saw the Messenger of Allah (may peace be upon him) saying the prayer while he was carrying Umama, daughter of Zainab, daughter of the Messenger of Allah (may peace be upon him). and Abu'l-'As b. al-Rabi'. When he stood up, he took her up and when he prostrated he put her down, Yahya said: Malik replied in the affirmative.",
      "chain": [
        "30367",
        "20001",
        "11178",
        "30399",
        "1544",
        "391"
      ]
    },
    {
      "hadith_no": "1241",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن أبي عمر، حدثنا سفيان، عن عثمان بن أبي سليمان، وابن، عجلان سمعا عامر بن عبد الله بن الزبير، يحدث عن عمرو بن سليم الزرقي، عن أبي قتادة الأنصاري، قال رأيت النبي صلى الله عليه وسلم يؤم الناس وأمامة بنت أبي العاص وهى ابنة زينب بنت النبي صلى الله عليه وسلم على عاتقه فإذا ركع وضعها وإذا رفع من السجود أعادها ‏.‏",
      "text_en": " Abu Qatada al-Ansari reported:                      I saw the Apostle (may peace be upon him) leading the people in prayer with Umima, daughter of Abu'l-'As and Zainab, daughter of the Apostle of Allah (may peace be upon him), on his shoulder. When he bowed, he put her down, and when he got up after prostration, he lifted her again.",
      "chain": [
        "20012",
        "10649",
        "10616",
        "11178",
        "1544",
        "391"
      ]
    },
    {
      "hadith_no": "1242",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثني أبو الطاهر، أخبرنا ابن وهب، عن مخرمة بن بكير، ح قال وحدثنا هارون بن سعيد الأيلي، حدثنا ابن وهب، أخبرني مخرمة، عن أبيه، عن عمرو بن سليم الزرقي، قال سمعت أبا قتادة الأنصاري، يقول رأيت رسول الله صلى الله عليه وسلم يصلي للناس وأمامة بنت أبي العاص على عنقه فإذا سجد وضعها ‏.‏",
      "text_en": " Abu Qatada reported:                      I saw the Messenger of Allah (may peace be upon him) leading the people in prayer with Umama daughter of Abu'l-'As on his neck; and when he prostrated he put her down.",
      "chain": [
        "20029",
        "20517",
        "30492",
        "20029",
        "1544",
        "391"
      ]
    },
    {
      "hadith_no": "1243",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا ليث، ح قال وحدثنا محمد بن المثنى، حدثنا أبو بكر الحنفي، حدثنا عبد الحميد بن جعفر، جميعا عن سعيد المقبري، عن عمرو بن سليم الزرقي، سمع أبا قتادة، يقول بينا نحن في المسجد جلوس خرج علينا رسول الله صلى الله عليه وسلم ‏.‏ بنحو حديثهم غير أنه لم يذكر أنه أم الناس في تلك الصلاة ‏.‏",
      "text_en": " Abu Qatada reported:                      As we were sitting in the mosque, the Messenger of Allah (may peace be upon him) came to us, and the rest of the hadith is the same except that he made no mention that he led people in this prayer.",
      "chain": [
        "30367",
        "20023",
        "30170",
        "20254",
        "11168",
        "1544",
        "391"
      ]
    },
    {
      "hadith_no": "1393",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثني إسحاق بن منصور، أخبرنا محمد بن المبارك الصوري، حدثنا معاوية بن سلام، عن يحيى بن أبي كثير، أخبرني عبد الله بن أبي قتادة، أن أباه، أخبره قال بينما نحن نصلي مع رسول الله صلى الله عليه وسلم فسمع جلبة ‏.‏ فقال ‏\"‏ ما شأنكم ‏\"‏ ‏.‏ قالوا استعجلنا إلى الصلاة ‏.‏ قال ‏\"‏ فلا تفعلوا إذا أتيتم الصلاة فعليكم السكينة فما أدركتم فصلوا وما سبقكم فأتموا ‏\"‏ ‏.‏",
      "text_en": " Abdullah b. Abu Qatada reported on the authority of his father:                      While we said our prayer with the Messenger of Allah (may peace be upon him) he heard tumult. (At the end of the prayer) he (the Holy Prophet) said: What is the matter with you? They said: We hastened to prayer. He (the Holy Prophet) said: Don't do that; when you come for prayer, there should be tranquillity upon you. Pray (along with the Imam) what you can find and complete what preceded you.",
      "chain": [
        "30313",
        "30382",
        "20401",
        "11449",
        "11804",
        "391"
      ]
    }
  ],
  "total_hadiths": 181
}