{
  "id": "393",
  "name": "Jabir bin Samra ( جابر بن سمرة السوائي ( رضي الله عنه",
  "full_name": "Jabir bin Samra ( جابر بن سمرة السوائي ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medinah"
    },
    "death": {
      "date_hijri": "74",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Kufa",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina",
      "Kufa"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ ع  -  صحابي ]"
    ],
    "tags": [
      "al-Sawa'i",
      "Ally B.Zuhrah"
    ]
  },
  "parents": [
    {
      "id": "392",
      "name": "Samra b. Junada ( سمرة بن جنادة السوائي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "392",
      "name": "Samra b. Junada ( سمرة بن جنادة السوائي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3",
      "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5",
      "name": "Ali ibn Abi Talib ( علي بن أبي طالب بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "33",
      "name": "Abu Ayyub al-Ansari ( أبو أيوب الأنصاري خالد بن زيد ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "2241",
      "name": "Nafi' bin 'Utba ibn Abi Waqqas ( نافع بن عتبة بن أبي وقاص ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "10770",
      "name": "Smak bin Hrb bin Aws سماك بن حرب بن أوس",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10894",
      "name": "Tmym bin Trfh تميم بن طرفة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10896",
      "name": "Ja'far bin Abi Thwr جعفر بن أبي ثور واسم",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11649",
      "name": "Muhammad bin 'Ubaidullah bin Sa'id محمد بن عبيد الله بن سعيد أبو عون الثقفي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11368",
      "name": "'Abdul Malik bin 'Umayr al-Qabti عبد الملك بن عمير بن سويد القبطي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "15097",
      "name": "Husayn bin 'Abdur Rahman al-Salmi حصين بن عبد الرحمن السلمي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11049",
      "name": "Abu Ishaq al-Sabay'ai' أبو إسحاق السبيعي عمرو بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "755",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا موسى، قال حدثنا أبو عوانة، قال حدثنا عبد الملك بن عمير، عن جابر بن سمرة، قال شكا أهل الكوفة سعدا إلى عمر  رضى الله عنه  فعزله واستعمل عليهم عمارا، فشكوا حتى ذكروا أنه لا يحسن يصلي، فأرسل إليه فقال يا أبا إسحاق إن هؤلاء يزعمون أنك لا تحسن تصلي قال أبو إسحاق أما أنا والله فإني كنت أصلي بهم صلاة رسول الله صلى الله عليه وسلم ما أخرم عنها، أصلي صلاة العشاء فأركد في الأوليين وأخف في الأخريين‏.‏ قال ذاك الظن بك يا أبا إسحاق‏.‏ فأرسل معه رجلا أو رجالا إلى الكوفة، فسأل عنه أهل الكوفة، ولم يدع مسجدا إلا سأل عنه، ويثنون معروفا، حتى دخل مسجدا لبني عبس، فقام رجل منهم يقال له أسامة بن قتادة يكنى أبا سعدة قال أما إذ نشدتنا فإن سعدا كان لا يسير بالسرية، ولا يقسم بالسوية، ولا يعدل في القضية‏.‏ قال سعد أما والله لأدعون بثلاث، اللهم إن كان عبدك هذا كاذبا، قام رياء وسمعة فأطل عمره، وأطل فقره، وعرضه بالفتن، وكان بعد إذا سئل يقول شيخ كبير مفتون، أصابتني دعوة سعد‏.‏ قال عبد الملك فأنا رأيته بعد قد سقط حاجباه على عينيه من الكبر، وإنه ليتعرض للجواري في الطرق يغمزهن‏.‏",
      "text_en": " Narrated Jabir bin Samura:                     The People of Kufa complained against Sa`d to `Umar and the latter dismissed him and appointed `Ammar as their chief . They lodged many complaints against Sa`d and even they alleged that he did not pray properly. `Umar sent for him and said, \"O Aba 'Is-haq! These people claim that you do not pray properly.\" Abu 'Is-haq said, \"By Allah, I used to pray with them a prayer similar to that of Allah's Apostle and I never reduced anything of it. I used to prolong the first two rak`at of `Isha prayer and shorten the last two rak`at.\" `Umar said, \"O Aba 'Is-haq, this was what I thought about you.\" And then he sent one or more persons with him to Kufa so as to ask the people about him. So they went there and did not leave any mosque without asking about him. All the people praised him till they came to the mosque of the tribe of Bani `Abs; one of the men called Usama bin Qatada with a surname of Aba Sa`da stood up and said, \"As you have put us under an oath; I am bound to tell you that Sa`d never went himself with the army and never distributed (the war booty) equally and never did justice in legal verdicts.\" (On hearing it) Sa`d said, \"I pray to Allah for three things: O Allah! If this slave of yours is a liar and got up for showing off, give him a long life, increase his poverty and put him to trials.\" (And so it happened). Later on when that person was asked how he was, he used to reply that he was an old man in trial as the result of Sa`d's curse. `Abdul Malik, the sub narrator, said that he had seen him afterwards and his eyebrows were overhanging his eyes owing to old age and he used to tease and assault the small girls in the way.",
      "chain": [
        "20040",
        "20469",
        "11368",
        "393"
      ]
    },
    {
      "hadith_no": "758",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو النعمان، حدثنا أبو عوانة، عن عبد الملك بن عمير، عن جابر بن سمرة، قال قال سعد كنت أصلي بهم صلاة رسول الله صلى الله عليه وسلم صلاتى العشي لا أخرم عنها، أركد في الأوليين وأحذف في الأخريين‏.‏ فقال عمر  رضى الله عنه  ذلك الظن بك‏.‏",
      "text_en": " Narrated Jabir bin Samura:                     Sa`d said, \"I used to pray with them a prayer similar to that of Allah's Apostle (the prayer of Zuhr and `Asr) reducing nothing from them. I used to prolong the first two rak`at and shorten the last two rak`at.\" `Umar said to Sa`d \"This was what we thought about you.\"",
      "chain": [
        "20283",
        "20469",
        "11368",
        "393"
      ]
    },
    {
      "hadith_no": "770",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا شعبة، عن أبي عون، قال سمعت جابر بن سمرة، قال قال عمر لسعد لقد شكوك في كل شىء حتى الصلاة‏.‏ قال أما أنا فأمد في الأوليين، وأحذف في الأخريين، ولا آلو ما اقتديت به من صلاة رسول الله صلى الله عليه وسلم‏.‏ قال صدقت، ذاك الظن بك، أو ظني بك‏.‏",
      "text_en": " Narrated Jabir bin Samura:                     `Umar said to Sa`d, \"The people complained against you in everything, even in prayer.\" Sa`d replied, \"Really I used to prolong the first two rak`at and shorten the last two and I will never shorten the prayer in which I follow Allah's Apostle.\" `Umar said, \"You are telling the truth and that is what I think a tout you.\"",
      "chain": [
        "20193",
        "20020",
        "11649",
        "393"
      ]
    },
    {
      "hadith_no": "3121",
      "source": " Sahih Bukhari ",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا إسحاق، سمع جريرا، عن عبد الملك، عن جابر بن سمرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا هلك كسرى فلا كسرى بعده، وإذا هلك قيصر فلا قيصر بعده، والذي نفسي بيده، لتنفقن كنوزهما في سبيل الله ‏\"‏‏.‏",
      "text_en": " Narrated Jabir bin Samura:                     Allah's Apostle said, \"When Khosrau is ruined, there will be no Khosrau after him; and when Caesar is ruined, their will be no Caesar after him. By Him in Whose Hands my life is, you will spend their treasures in Allah's Cause.\"",
      "chain": [
        "30312",
        "20028",
        "11368",
        "393"
      ]
    },
    {
      "hadith_no": "3662",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا قبيصة، حدثنا سفيان، عن عبد الملك بن عمير، عن جابر بن سمرة، رفعه قال ‏\"‏ إذا هلك كسرى فلا كسرى بعده  وذكر وقال  لتنفقن كنوزهما في سبيل الله ‏\"‏‏.‏",
      "text_en": " Narrated Jabir bin Samura:                     The Prophet said, \"When Khosrau perishes, there will be no more Khosrau a after him, and when Caesar perishes, there will be no more Caesar after him,\" The Prophet also said, \"You will spend the treasures of both of them in Allah's Cause.\"",
      "chain": [
        "20351",
        "20012",
        "11368",
        "393"
      ]
    },
    {
      "hadith_no": "6711",
      "source": " Sahih Bukhari ",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا موسى، حدثنا أبو عوانة، عن عبد الملك، عن جابر بن سمرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا هلك قيصر فلا قيصر بعده، وإذا هلك كسرى فلا كسرى بعده، والذي نفسي بيده لتنفقن كنوزهما في سبيل الله ‏\"‏‏.‏",
      "text_en": " Narrated Jabir bin Samura:                     The Prophet said, \"If Caesar is ruined, there will be no Caesar after him; and if Khosrau is ruined, there will be no Khosrau, after him; and, by Him in Whose Hand my soul is, surely you will spend their treasures in Allah's Cause.\"",
      "chain": [
        "20040",
        "20469",
        "11368",
        "393"
      ]
    },
    {
      "hadith_no": "7308",
      "source": " Sahih Bukhari ",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثني محمد بن المثنى، حدثنا غندر، حدثنا شعبة، عن عبد الملك، سمعت جابر بن سمرة، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ يكون اثنا عشر أميرا  فقال كلمة لم أسمعها فقال أبي إنه قال  كلهم من قريش ‏\"‏‏.‏",
      "text_en": " Narrated Jabir bin Samura:                     I heard the Prophet saying, \"There will be twelve Muslim rulers (who will rule all the Islamic world).\" He then said a sentence which I did not hear. My father said, \"All of them (those rulers) will be from Quraish.\"",
      "chain": [
        "30170",
        "20278",
        "20020",
        "11368",
        "393"
      ]
    },
    {
      "hadith_no": "360",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثنا أبو كامل، فضيل بن حسين الجحدري حدثنا أبو عوانة، عن عثمان بن عبد الله بن موهب، عن جعفر بن أبي ثور، عن جابر بن سمرة، أن رجلا، سأل رسول الله صلى الله عليه وسلم أأتوضأ من لحوم الغنم قال ‏\"‏ إن شئت فتوضأ وإن شئت فلا توضأ ‏\"‏ ‏.‏ قال أتوضأ من لحوم الإبل قال ‏\"‏ نعم فتوضأ من لحوم الإبل ‏\"‏ ‏.‏ قال أصلي في مرابض الغنم قال ‏\"‏ نعم ‏\"‏ ‏.‏ قال أصلي في مبارك الإبل قال ‏\"‏ لا ‏\"‏ ‏.‏",
      "text_en": " Jabir b. Samura reported:                      A man asked the Messenger of Allah (may peace he upon him) whether he should perform ablution after (eating) mutton. He (the Messenger of Allah) said: Perform ablution it you so desire, and if you do not wish, do not perform it. He (again) asked: Should I perform ablution (after eating) camel's flesh? He said: Yes, perform ablution (after eating) camel's flesh. He (again) said: May I say prayer in the sheepfolds? He (the Messenger of Allah) said: Yes. He (the narrator) again said: May I say prayer where camels lie down? He (the Holy Prophet) said: No.",
      "chain": [
        "30559",
        "20469",
        "11524",
        "10896",
        "393"
      ]
    },
    {
      "hadith_no": "360",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا معاوية بن عمرو، حدثنا زائدة، عن سماك، ح وحدثني القاسم بن زكرياء، حدثنا عبيد الله بن موسى، عن شيبان، عن عثمان بن عبد الله بن موهب، وأشعث بن أبي الشعثاء، كلهم عن جعفر بن أبي ثور، عن جابر بن سمرة، عن النبي صلى الله عليه وسلم بمثل حديث أبي كامل عن أبي عوانة ‏.‏",
      "text_en": " This hadith is also narrated by another chain of transmitters.",
      "chain": [
        "30201",
        "20389",
        "20320",
        "10770",
        "20340",
        "20240",
        "11524",
        "10896",
        "393"
      ]
    },
    {
      "hadith_no": "428",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا أبو معاوية، عن الأعمش، عن المسيب، عن تميم بن طرفة، عن جابر بن سمرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لينتهين أقوام يرفعون أبصارهم إلى السماء في الصلاة أو لا ترجع إليهم ‏\"‏ ‏.‏",
      "text_en": " Jabir b. Samura reported:                      The Messenger of Allah (may peace be upon him) said: The people who lift their eyes towards the sky in Prayer should avoid it or they would lose their eyesight.",
      "chain": [
        "30201",
        "30216",
        "20354",
        "11060",
        "10894",
        "393"
      ]
    },
    {
      "hadith_no": "430",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا أبو معاوية، عن الأعمش، عن المسيب بن رافع، عن تميم بن طرفة، عن جابر بن سمرة، قال خرج علينا رسول الله صلى الله عليه وسلم فقال ‏\"‏ ما لي أراكم رافعي أيديكم كأنها أذناب خيل شمس اسكنوا في الصلاة ‏\"‏ ‏.‏ قال ثم خرج علينا فرآنا حلقا فقال ‏\"‏ ما لي أراكم عزين ‏\"‏ ‏.‏ قال ثم خرج علينا فقال ‏\"‏ ألا تصفون كما تصف الملائكة عند ربها ‏\"‏ ‏.‏ فقلنا يا رسول الله وكيف تصف الملائكة عند ربها قال ‏\"‏ يتمون الصفوف الأول ويتراصون في الصف ‏\"‏ ‏.‏",
      "text_en": " Jabir b. Samura reported:                      The Messenger of Allah (may peace be upon him) came to us and said: How is it that I see you lifting your hands like the tails of headstrong horses? Be calm in prayer. He (the narrator) said: He then again came to us and saw us (sitting) in circles; he said: How is it that I see you in separate groups? He (the narrator) said: He again came to us and said: Why don't you draw yourselves up in rows as angels do in the presence of their Lord? We said: Messenger of Allah, bow do the angels draw themselves up in rows in the presence of their Lord? He (the Holy Prophet) said: They make the first rows complete and keep close together in the row.",
      "chain": [
        "30201",
        "30216",
        "20354",
        "11060",
        "11394",
        "10894",
        "393"
      ]
    },
    {
      "hadith_no": "431",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، قال حدثنا وكيع، عن مسعر، ح وحدثنا أبو كريب، - واللفظ له - قال أخبرنا ابن أبي زائدة، عن مسعر، حدثني عبيد الله ابن القبطية، عن جابر بن سمرة، قال كنا إذا صلينا مع رسول الله صلى الله عليه وسلم قلنا السلام عليكم ورحمة الله السلام عليكم ورحمة الله ‏.‏ وأشار بيده إلى الجانبين فقال رسول الله صلى الله عليه وسلم ‏\"‏ علام تومئون بأيديكم كأنها أذناب خيل شمس إنما يكفي أحدكم أن يضع يده على فخذه ثم يسلم على أخيه من على يمينه وشماله ‏\"‏ ‏.‏",
      "text_en": " Jabir b. Samura reported:                      When we said prayer with the Messenger of Allah (may peace be upon him), we pronounced: Peace be upon you and Mercy of Allah, peace be upon you and Mercy of Allah, and made gesture with the hand on both the sides. Upon this the Messenger of Allah (may peace be upon him said: What do you point out with your hands as if they are the tails of headstrong horses? This is enough for you that one should place one's hand on one's thigh and then pronounce salutation upon one's brother on the right side and then on the left.",
      "chain": [
        "30201",
        "20032",
        "20359",
        "20366",
        "20359",
        "10794",
        "393"
      ]
    },
    {
      "hadith_no": "431",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "وحدثنا القاسم بن زكرياء، حدثنا عبيد الله بن موسى، عن إسرائيل، عن فرات، - يعني القزاز - عن عبيد الله، عن جابر بن سمرة، قال صليت مع رسول الله صلى الله عليه وسلم فكنا إذا سلمنا قلنا بأيدينا السلام عليكم السلام عليكم فنظر إلينا رسول الله صلى الله عليه وسلم فقال ‏\"‏ ما شأنكم تشيرون بأيديكم كأنها أذناب خيل شمس إذا سلم أحدكم فليلتفت إلى صاحبه ولا يومئ بيده ‏\"‏ ‏.‏",
      "text_en": " Jabir b. Samura reported:                      We said our prayer with the Messenger of Allah (may peace be upon him) and, while pronouncing salutations, we made gestures with our hands (indicating)\" Peace be upon you, peace be upon you.\" The Messenger of Allah (may peace be upon him) looked towards us and said: Why is it that you make gestures with your hands like the tails of headstrong horses? When any one of you pro- nounces salutation (in prayer) he should only turn his face towards his companion and should not make a gesture with his hand.",
      "chain": [
        "20340",
        "20311",
        "11384",
        "11201",
        "393"
      ]
    },
    {
      "hadith_no": "453",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا هشيم، عن عبد الملك بن عمير، عن جابر بن سمرة، أن أهل الكوفة، شكوا سعدا إلى عمر بن الخطاب فذكروا من صلاته فأرسل إليه عمر فقدم عليه فذكر له ما عابوه به من أمر الصلاة فقال إني لأصلي بهم صلاة رسول الله صلى الله عليه وسلم ما أخرم عنها إني لأركد بهم في الأوليين وأحذف في الأخريين ‏.‏ فقال ذاك الظن بك أبا إسحاق ‏.‏",
      "text_en": " Jabir b. Samura reported:                      The people of Kufa complained to Umar b. Khattab about Sa'id and they made a mention of his prayer. 'Umar sent for him. He came to him. He ('Umar) totd him that the people had found fault with his prayer. He said: I lead them in prayer in accorance with the prayer of the Messenger of Allah (may peace be upon him). I make no decrease in it. I make them stand for a longer time in the first two (rak'ahs) and shorten it in the last two. Upon this 'Umar remarked: This is what I deemed of thee, O Abu Ishaq",
      "chain": [
        "30399",
        "20468",
        "11368",
        "393"
      ]
    },
    {
      "hadith_no": "453",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "وحدثنا محمد بن المثنى، حدثنا عبد الرحمن بن مهدي، حدثنا شعبة، عن أبي عون، قال سمعت جابر بن سمرة، قال عمر لسعد قد شكوك في كل شىء حتى في الصلاة ‏.‏ قال أما أنا فأمد في الأوليين وأحذف في الأخريين وما آلو ما اقتديت به من صلاة رسول الله صلى الله عليه وسلم ‏.‏ فقال ذاك الظن بك ‏.‏ أو ذاك ظني بك ‏.‏",
      "text_en": " Jabir b. Samura reported:                      'Umar said to Sa'd: They complain against you in every matter, even in prayer. He (Sa'd) said: I prolong (standing) in the first two (rak'ahs) and shorten it in the last two, and I make no negligence in following the prayer of the Messenger of Allah (may peace be upon him). He ('Umar) remarked: This is what is expected of you, or, that is what I deemed of you.",
      "chain": [
        "30170",
        "20033",
        "20020",
        "11649",
        "393"
      ]
    },
    {
      "hadith_no": "458",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا حسين بن علي، عن زائدة، حدثنا سماك بن حرب، عن جابر بن سمرة، قال إن النبي صلى الله عليه وسلم كان يقرأ في الفجر ب ‏{‏ ق والقرآن المجيد‏}‏ وكان صلاته بعد تخفيفا ‏.‏",
      "text_en": " Jabir b. Samura reported:                      The Apostle of Allah (may peace be upon him) used to recite in the morning prayer\" Qaf. By the Glorious Quran.\" and his prayer afterward shortened.",
      "chain": [
        "30201",
        "20315",
        "20320",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "458",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، ومحمد بن رافع، - واللفظ لابن رافع - قالا حدثنا يحيى بن آدم، حدثنا زهير، عن سماك، قال سألت جابر بن سمرة عن صلاة النبي، صلى الله عليه وسلم فقال كان يخفف الصلاة ولا يصلي صلاة هؤلاء ‏.‏ قال وأنبأني أن رسول الله صلى الله عليه وسلم كان يقرأ في الفجر ب ‏{‏ ق والقرآن‏}‏ ونحوها ‏.‏",
      "text_en": " Simak asked Jabir b. Samura about the prayer of the Apostle (may peace be upon him). He said:                      He (the Holy Prophet) shortened the prayer and he did not pray like these people then, and he informed me that the Messenger of Allah (may peace be upon him) used to recite\" Qaf. By the (Glorious) Qur'an,\" and a passage of similar length.",
      "chain": [
        "30201",
        "30375",
        "20364",
        "20321",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "459",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "وحدثنا محمد بن المثنى، حدثنا عبد الرحمن بن مهدي، حدثنا شعبة، عن سماك، عن جابر بن سمرة، قال كان النبي صلى الله عليه وسلم يقرأ في الظهر ب ‏{‏ الليل إذا يغشى‏}‏ وفي العصر نحو ذلك وفي الصبح أطول من ذلك ‏.‏",
      "text_en": " Jabir b. Samura reported:                      The Apostle of Allah (may peace be upon him) used to recite in the noon prayer:\" By the night when it envelopes\" (xcii.), and in the afternoon like this, but he prolonged the morning prayer as compared to that (noon and afternoon prayers).",
      "chain": [
        "30170",
        "20033",
        "20020",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "460",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو داود الطيالسي، عن شعبة، عن سماك، عن جابر بن سمرة، ‏.‏ أن النبي صلى الله عليه وسلم كان يقرأ في الظهر ب ‏{‏ سبح اسم ربك الأعلى‏}‏ وفي الصبح بأطول من ذلك ‏.‏",
      "text_en": " Jabir b. Samura reported:                      The Apostle of Allah (may peace be upon him) used to recite in the noon prayer:\" Glorify the name of thy Most High Lord in the morning prayer longer than this\" (lxxxvii.)",
      "chain": [
        "30201",
        "20547",
        "20020",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "1400",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني سلمة بن شبيب، حدثنا الحسن بن أعين، حدثنا زهير، حدثنا سماك بن حرب، عن جابر بن سمرة، قال كان بلال يؤذن إذا دحضت فلا يقيم حتى يخرج النبي صلى الله عليه وسلم فإذا خرج أقام الصلاة حين يراه ‏.‏",
      "text_en": " Jabir b. Samura reported:                      Bilal summoned to prayer as the sun declined but did not pronounce Iqama till the Apostle of Allah (may peace be upon him) came out and the Iqama was pronounced on seeing him.",
      "chain": [
        "30417",
        "20418",
        "20321",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "1435",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن المثنى، ومحمد بن بشار، كلاهما عن يحيى القطان، وابن، مهدي - قال ابن المثنى حدثني يحيى بن سعيد، - عن شعبة، قال حدثنا سماك بن حرب، عن جابر بن سمرة، قال ابن المثنى وحدثنا عبد الرحمن بن مهدي، عن شعبة، عن سماك، عن جابر بن سمرة، قال كان النبي صلى الله عليه وسلم يصلي الظهر إذا دحضت الشمس ‏.‏",
      "text_en": " Jabir b. Samura reported:                      The Apostle of Allah (may peace be upon him) used to offer the noon prayer when the sun declined.",
      "chain": [
        "30170",
        "30160",
        "20031",
        "20033",
        "11062",
        "20020",
        "10770",
        "393",
        "20033",
        "20020",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "1485",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا يحيى بن يحيى، وقتيبة بن سعيد، وأبو بكر بن أبي شيبة قال يحيى أخبرنا وقال الآخران، حدثنا أبو الأحوص، عن سماك، عن جابر بن سمرة، قال كان رسول الله صلى الله عليه وسلم يؤخر صلاة العشاء الآخرة ‏.‏",
      "text_en": " Jabir b. Samura reported that the Messenger of Allah (may peace be upon him) postponed the last 'Isha' prayer.",
      "chain": [
        "30399",
        "30367",
        "30201",
        "20031",
        "20327",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "1486",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا قتيبة بن سعيد، وأبو كامل الجحدري قالا حدثنا أبو عوانة، عن سماك، عن جابر بن سمرة، قال كان رسول الله صلى الله عليه وسلم يصلي الصلوات نحوا من صلاتكم وكان يؤخر العتمة بعد صلاتكم شيئا وكان يخف الصلاة ‏.‏ وفي رواية أبي كامل يخفف ‏.‏",
      "text_en": " Jabir b. Samura reported:                      The Messenger of Allah (may peace be upon him) used to observe prayers like your prayers, but he would delay the prayer after nightfall to a little after the time you observed it, and he would shorten the prayer.",
      "chain": [
        "30367",
        "30559",
        "20469",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "1558",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن سفيان، قال أبو بكر وحدثنا محمد بن بشر، عن زكرياء، كلاهما عن سماك، عن جابر بن سمرة، أن النبي صلى الله عليه وسلم كان إذا صلى الفجر جلس في مصلاه حتى تطلع الشمس حسنا ‏.‏",
      "text_en": " Simak narrated on the authority of Jabir b. Samura that when the Apostle of Allah (may peace be upon him) observed the dawn prayer, he sat at the place of worship till the sun had risen enough.",
      "chain": [
        "30201",
        "20032",
        "20012",
        "20436",
        "20352",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "1748",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا عبيد الله بن موسى، عن حسن بن صالح، عن سماك، قال أخبرني جابر بن سمرة، أن النبي صلى الله عليه وسلم لم يمت حتى صلى قاعدا ‏.‏",
      "text_en": " 'Abdullah b. 'Amr reported:                      It was narrated to me that the Messenger of Allah (may peace be upon him) had said: The prayer observed by a person sitting is half of the prayer. I came to him (may peace be upon him) and found him praying in a sitting position. I placed my hand on his head. He said: O 'Abdullah b. 'Amr, what is the matter with you? I said: Messenger of Allah, it has been narrated to me that you said: The prayer of a man in a sitting position is half of the prayer, whereas you are observing prayer sitting. He (the Holy Prophet) said: Yes, it is so, but I am not like anyone amongst you.",
      "chain": [
        "30201",
        "20340",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "2032",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "وحدثنا يحيى بن يحيى، وحسن بن الربيع، وأبو بكر بن أبي شيبة قال يحيى أخبرنا وقال الآخران، حدثنا أبو الأحوص، عن سماك، عن جابر بن سمرة، قال كانت للنبي صلى الله عليه وسلم خطبتان يجلس بينهما يقرأ القرآن ويذكر الناس ‏.‏",
      "text_en": " Jabir b. Samura said:                      The Apostle of Allah (may peace be upon him) gave two sermons between which he sat, recited the Qur'an and exhorted the people.",
      "chain": [
        "30399",
        "30201",
        "20031",
        "20327",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "2040",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "حدثنا حسن بن الربيع، وأبو بكر بن أبي شيبة قالا حدثنا أبو الأحوص، عن سماك، عن جابر بن سمرة، قال كنت أصلي مع رسول الله صلى الله عليه وسلم فكانت صلاته قصدا وخطبته قصدا ‏.‏",
      "text_en": " Jabir b. Samura reported:                      I used to pray with the Messenger of Allah (may peace be upon him) and both his prayer and sermon were of moderate length.",
      "chain": [
        "30201",
        "20327",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "2041",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وابن، نمير قالا حدثنا محمد بن بشر، حدثنا زكرياء، حدثني سماك بن حرب، عن جابر بن سمرة، قال كنت أصلي مع النبي صلى الله عليه وسلم الصلوات فكانت صلاته قصدا وخطبته قصدا ‏.‏ وفي رواية أبي بكر زكرياء عن سماك.",
      "text_en": " Jabir b. Samura reported:                      I used to observe prayer with the Apostle of Allah (may peace be upon him) and his prayer was of moderate length and his sermon too was of moderate length.",
      "chain": [
        "30201",
        "30212",
        "20352",
        "11338",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "2088",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Two Eids) - كتاب صلاة العيدين",
      "chapter_no": "9",
      "text_ar": "وحدثنا يحيى بن يحيى، وحسن بن الربيع، وقتيبة بن سعيد، وأبو بكر بن أبي شيبة قال يحيى أخبرنا وقال الآخرون، حدثنا أبو الأحوص، عن سماك، عن جابر بن، سمرة قال صليت مع رسول الله صلى الله عليه وسلم العيدين غير مرة ولا مرتين بغير أذان ولا إقامة ‏.‏",
      "text_en": " Jabir b. Samura said:                      I prayed with the Messenger of Allah (may peace be upon him) prayers on two I'ds wore than once or twice without there being Adhan and Iqama.",
      "chain": [
        "30399",
        "30367",
        "30201",
        "20031",
        "20327",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "2282",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "حدثنا يحيى بن يحيى، وأبو بكر بن أبي شيبة - واللفظ ليحيى - قال أبو بكر حدثنا وقال، يحيى أخبرنا وكيع، عن مالك بن مغول، عن سماك بن حرب، عن جابر بن، سمرة قال أتي النبي صلى الله عليه وسلم بفرس معرورى فركبه حين انصرف من جنازة ابن الدحداح ونحن نمشي حوله ‏.‏",
      "text_en": " It is reported on the authority of Jabir ibn Samura that an unsaddled horse was brought to the Holy Prophet (may peace be upon him) and he rode on it when he returned after having offered the funeral prayer of Ibn Dahdah and we walked on foot around him.",
      "chain": [
        "30399",
        "20436",
        "20031",
        "20032",
        "20358",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "2283",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثنا محمد بن المثنى، ومحمد بن بشار، - واللفظ لابن المثنى - قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن سماك بن حرب، عن جابر بن سمرة، قال صلى رسول الله صلى الله عليه وسلم على ابن الدحداح ثم أتي بفرس عرى فعقله رجل فركبه فجعل يتوقص به ونحن نتبعه نسعى خلفه - قال - فقال رجل من القوم إن النبي صلى الله عليه وسلم قال ‏\"‏ كم من عذق معلق - أو مدلى - في الجنة لابن الدحداح ‏\"‏ ‏.‏ أو قال شعبة ‏\"‏ لأبي الدحداح ‏\"‏ ‏.‏",
      "text_en": " Jabir ibn Samura reported that the Holy Prophet (may peace be upon him) said (funeral) prayer on Ibn Dahdah:                      then an unsaddled horse was brought to him and a person hobbled it, and he (the Messenger of Allah) rode upon it and it bounded and we followed it and ran after it. One of the people said that the Holy Prophet (may peace be upon him) remarked: How many among hanging bunches in the Paradise are meant for Ibn Dahdah?",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "2309",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "حدثنا عون بن سلام الكوفي، أخبرنا زهير، عن سماك، عن جابر بن سمرة، قال أتي النبي صلى الله عليه وسلم برجل قتل نفسه بمشاقص فلم يصل عليه ‏.‏",
      "text_en": " Jabir b. Samura reported:                      (The dead body) of a person who had killed himself with a broad-headed arrow was brought before the Apostle of Allah (may peace be upon him), but he did not offer prayers for him.",
      "chain": [
        "30474",
        "20321",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "2708",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبيد الله بن موسى، أخبرنا شيبان، عن أشعث، بن أبي الشعثاء عن جعفر بن أبي ثور، عن جابر بن سمرة، - رضى الله عنه - قال كان رسول الله صلى الله عليه وسلم يأمرنا بصيام يوم عاشوراء ويحثنا عليه ويتعاهدنا عنده فلما فرض رمضان لم يأمرنا ولم ينهنا ولم يتعاهدنا عنده ‏.‏",
      "text_en": " Jabir b Samura reported that the Messenger of Allah (may peace be upon him) commanded us to observe fast on the day of Ashura and exhorted us to do it and was particular about it But when (fasting) in Ramadan was made obligatory, he hence. forth neither commanded us nor forbade us, nor was he so particular about it.",
      "chain": [
        "30201",
        "20340",
        "20240",
        "11324",
        "10896",
        "393"
      ]
    },
    {
      "hadith_no": "3423",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا قتيبة بن سعيد، وهناد بن السري، وأبو بكر بن أبي شيبة قالوا حدثنا أبو الأحوص، عن سماك، عن جابر بن سمرة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن الله تعالى سمى المدينة طابة ‏\"‏ ‏.‏",
      "text_en": " Jabir b. Samura (Allah be pleased with him) reported that he heard Allah's Messenger (may peace be upon him) say:                      Allah named Medina as Tabba.",
      "chain": [
        "30367",
        "30480",
        "30201",
        "20327",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "4520",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Punishments Prescribed by Islam - كتاب الحدود",
      "chapter_no": "30",
      "text_ar": "وحدثني أبو كامل، فضيل بن حسين الجحدري حدثنا أبو عوانة، عن سماك بن، حرب عن جابر بن سمرة، قال رأيت ماعز بن مالك حين جيء به إلى النبي صلى الله عليه وسلم رجل قصير أعضل ليس عليه رداء فشهد على نفسه أربع مرات أنه زنى فقال رسول الله صلى الله عليه وسلم ‏\"‏ فلعلك ‏\"‏ ‏.‏ قال لا والله إنه قد زنى الأخر - قال - فرجمه ثم خطب فقال ‏\"‏ ألا كلما نفرنا غازين في سبيل الله خلف أحدهم له نبيب كنبيب التيس يمنح أحدهم الكثبة أما والله إن يمكني من أحدهم لأنكلنه عنه ‏\"‏ ‏.‏",
      "text_en": " Jabir b. Samura reported:                      As he was being brought to Allah's Apostle (may peace be upon him) I saw Ma'iz b. Malik-a short-statured person with strong sinews, having no cloak around him. He bore witness against his own self four times that he had committed adultery, whereupon Allah's Messenger (may peace be upon him) said: Perhaps (you kissed her or embraced her). He said: No. by God, one deviating (from the path of virtue) has committed adultery. He then got him stoned (to death), and then delivered the address: Behold, as we set out for Jihad in the cause of Allah, one of you lagged behind and shrieked like the bleating of a male goat, and gave a small quantity of milk. By Allah, in case I get hold of him, I shall certainly punish him.",
      "chain": [
        "30559",
        "20469",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "4521",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Punishments Prescribed by Islam - كتاب الحدود",
      "chapter_no": "30",
      "text_ar": "وحدثنا محمد بن المثنى، وابن، بشار - واللفظ لابن المثنى - قالا حدثنا محمد، بن جعفر حدثنا شعبة، عن سماك بن حرب، قال سمعت جابر بن سمرة، يقول أتي رسول الله صلى الله عليه وسلم برجل قصير أشعث ذي عضلات عليه إزار وقد زنى فرده مرتين ثم أمر به فرجم فقال رسول الله صلى الله عليه وسلم ‏\"‏ كلما نفرنا غازين في سبيل الله تخلف أحدكم ينب نبيب التيس يمنح إحداهن الكثبة إن الله لا يمكني من أحد منهم إلا جعلته نكالا ‏\"‏ ‏.‏ أو نكلته ‏.‏ قال فحدثته سعيد بن جبير فقال إنه رده أربع مرات ‏.‏",
      "text_en": " Jabir b. Samura reported that there was brought to Allah's Messenger (may peace be upon him) a short-statured person with thick uncombed hair, muscular body, having a mantle around him and he had committed adultery. He turned him away twice and then made pronouncement about him and he was stoned. Then Allah's Messenger (may peace be upon him) said:                      We set out for Jihad in the cause of Allah and one of you lagged behind and shrieked like the bleating of a male goat and one of then (goats' gave a small quantity of milk. In case Allah gives me power over one of them, I will punish him (in such a way that it may have a deterrent effect upon others). In another narration transmitted on the authority of Sa'id b Jubair (the words are), that He (the Holy Prophet) turned him away four times.\"",
      "chain": [
        "30170",
        "20173",
        "20020",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "4522",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Punishments Prescribed by Islam - كتاب الحدود",
      "chapter_no": "30",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا شبابة، ح وحدثنا إسحاق بن إبراهيم، أخبرنا أبو عامر العقدي، كلاهما عن شعبة، عن سماك، عن جابر بن سمرة، عن النبي صلى الله عليه وسلم ‏.‏ نحو حديث ابن جعفر ووافقه شبابة على قوله فرده مرتين ‏.‏ وفي حديث أبي عامر فرده مرتين أو ثلاثا ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Jabir b. Samura through another chain of transmitters with the difference that along with the mentioning (of the fact) that he (the Holy Prophet) turned him away twice, or thrice.",
      "chain": [
        "30201",
        "20426",
        "30123",
        "20443",
        "20020",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "4808",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا جرير، عن حصين، عن جابر بن سمرة، قال سمعت النبي صلى الله عليه وسلم يقول ح",
      "text_en": "",
      "chain": [
        "30367",
        "20028",
        "15097",
        "393"
      ]
    },
    {
      "hadith_no": "4809",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا رفاعة بن الهيثم الواسطي، - واللفظ له - حدثنا خالد، - يعني ابن عبد الله الطحان - عن حصين، عن جابر بن سمرة، قال دخلت مع أبي على النبي صلى الله عليه وسلم فسمعته يقول ‏\"‏ إن هذا الأمر لا ينقضي حتى يمضي فيهم اثنا عشر خليفة ‏\"‏ ‏.‏ قال ثم تكلم بكلام خفي على - قال - فقلت لأبي ما قال قال ‏\"‏ كلهم من قريش ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Jabir b. Samura who said:                      I joined the company of the Holy Prophet (may peace be upon him) with my father and I heard him say: This Caliphate will not end until there have been twelve Caliphs among them. The narrator said: Then he (the Holy Prophet) said something that I could not follow. I said to my father: What did he say? He said: He has said: All of them will be from the Quraish.",
      "chain": [
        "15097",
        "393"
      ]
    },
    {
      "hadith_no": "4810",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان، عن عبد الملك بن عمير، عن جابر بن سمرة، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ لا يزال أمر الناس ماضيا ما وليهم اثنا عشر رجلا ‏\"‏ ‏.‏ ثم تكلم النبي صلى الله عليه وسلم بكلمة خفيت على فسألت أبي ماذا قال رسول الله صلى الله عليه وسلم فقال ‏\"‏ كلهم من قريش ‏\"‏ ‏.‏",
      "text_en": " It has been reported on the authority of Jabir b. Samura who said:                      I heard the Messenger of Allah (may peace be upon him) say: The affairs of the people will continue to be conducted (well) as long as they are governed by twelve men. Then the Holy Prophet (may peace be upon him) said words which were obscure to me. I asked my father: What did the Messenger of Allah (may peace be upon him) say? He said: All of the (twelve men) will be from the Quraish.",
      "chain": [
        "30421",
        "20005",
        "11368",
        "393"
      ]
    },
    {
      "hadith_no": "4812",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا هداب بن خالد الأزدي، حدثنا حماد بن سلمة، عن سماك بن حرب، قال سمعت جابر بن سمرة، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يزال الإسلام عزيزا إلى اثنى عشر خليفة ‏\"‏ ‏.‏ ثم قال كلمة لم أفهمها فقلت لأبي ما قال فقال ‏\"‏ كلهم من قريش ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Jabir b. Samura who said:                      I heard the Messenger of Allah (may peace be upon him) say: Islam will continue to be triumphant until there have been twelve Caliphs. Then the Holy Prophet (may peace be upon him) said something which I could not understand. I asked my father: What did he say? He said: He has said that all of them (twelve Caliphs) will be from the Quraish.",
      "chain": [
        "20021",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "4813",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو معاوية، عن داود، عن الشعبي، عن جابر، بن سمرة قال قال النبي صلى الله عليه وسلم ‏\"‏ لا يزال هذا الأمر عزيزا إلى اثنى عشر خليفة ‏\"‏ ‏.‏ قال ثم تكلم بشىء لم أفهمه فقلت لأبي ما قال فقال ‏\"‏ كلهم من قريش ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Jabir b. Samura that the Holy Prophet (may peace be upon him) said:                      This order will continue to be dominant until there have been twelve Caliphs. The narrator says: Then he said something which I could not understand, and I said to my father: What did he say? My father told me that he said that all of them (Caliphs) would be from the Quraish.",
      "chain": [
        "30201",
        "20354",
        "11052",
        "393"
      ]
    },
    {
      "hadith_no": "4814",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا نصر بن علي الجهضمي، حدثنا يزيد بن زريع، حدثنا ابن عون، ح وحدثنا أحمد بن عثمان النوفلي، - واللفظ له - حدثنا أزهر، حدثنا ابن عون، عن الشعبي، عن جابر بن سمرة، قال انطلقت إلى رسول الله صلى الله عليه وسلم ومعي أبي فسمعته يقول ‏\"‏ لا يزال هذا الدين عزيزا منيعا إلى اثنى عشر خليفة ‏\"‏ ‏.‏ فقال كلمة صمنيها الناس فقلت لأبي ما قال قال ‏\"‏ كلهم من قريش ‏\"‏ ‏.‏",
      "text_en": " It has been reported on the authority of Jabir b. Samura who said:                      I went with my father to the Messenger of Allah (may peeace be upon him) and I heard him say: This religion would continue to remain powerful and dominant until there have been twelve Caliphs. Then he added something which I couldn't catch on account of the noise of the people. I asked my father: What did he say? My father said: He has said that all of them will be from the Quraish.",
      "chain": [
        "30395",
        "20304",
        "11071",
        "30185",
        "20206",
        "11071",
        "11052",
        "393"
      ]
    },
    {
      "hadith_no": "5062",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا محمد بن المثنى، ومحمد بن بشار، قالا حدثنا محمد بن جعفر، حدثنا  شعبة، عن سماك بن حرب، عن جابر بن سمرة، عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ لن يبرح هذا الدين قائما يقاتل عليه عصابة من المسلمين حتى تقوم الساعة ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Jabir b. Samura that the Holy Prophet (may peace be upon him) said:                      This religion will continue to exist, and a group of people from the Muslims will continue to fight for its protection until the Hour is established.",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "5477",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا محمد بن المثنى، وابن، بشار - واللفظ لابن المثنى - قالا حدثنا محمد، بن جعفر حدثنا شعبة، عن سماك بن حرب، عن جابر بن سمرة، عن أبي أيوب الأنصاري، قال كان رسول الله صلى الله عليه وسلم إذا أتي بطعام أكل منه وبعث بفضله إلى وإنه بعث إلى يوما بفضلة لم يأكل منها لأن فيها ثوما فسألته أحرام هو قال ‏\"‏ لا ولكني أكرهه من أجل ريحه ‏\"‏ ‏.‏ قال فإني أكره ما كرهت ‏.‏",
      "text_en": " Abd Ayydb Ansari reported that when food was brought to Allah's Messenger (may peace be upon him) he ate out of that, and sent the remaining part to me, and one day he sent to me the left-over; (I found that he) had not taken from it at all for it included garlic. I asked him whether that was forbidden, whereupon he said:                      No, but I do not like it because of its odour. He (Abu Ayyub Ansiri) said: Then I also do not like what you do not like.",
      "chain": [
        "30170",
        "20173",
        "20020",
        "10770",
        "393",
        "33"
      ]
    },
    {
      "hadith_no": "6078",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا يحيى بن أبي بكير، عن إبراهيم بن طهمان، حدثني سماك بن حرب، عن جابر بن سمرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إني لأعرف حجرا بمكة كان يسلم على قبل أن أبعث إني لأعرفه الآن ‏\"‏ ‏.‏",
      "text_en": " Jabir b. Samura reported Allah's Messenger (may peace be upon him) as saying:                      I recognise the stone in Mecca which used to pay me salutations before my advent as a Prophet and I recognise that even now.",
      "chain": [
        "30201",
        "20365",
        "20187",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "6142",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثني الوليد بن شجاع بن الوليد السكوني، حدثني أبي، - رحمه الله - حدثني  زياد بن خيثمة، عن سماك بن حرب، عن جابر بن سمرة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ ألا إني فرط لكم على الحوض وإن بعد ما بين طرفيه كما بين صنعاء وأيلة كأن الأباريق فيه النجوم ‏\"‏ ‏.‏",
      "text_en": " Jabir b. Samura reported Allah's Messenger (may peace be upon him) as saying:                      Behold, I shall be present ahead of you on the Cistern, and the distance between its different sides would be like that between Sana' and Aila, and its jugs would be like stars in the sky.",
      "chain": [
        "30482",
        "20585",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "6197",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا عمرو بن حماد بن طلحة القناد، حدثنا أسباط، - وهو ابن نصر الهمداني - عن سماك، عن جابر بن سمرة، قال صليت مع رسول الله صلى الله عليه وسلم صلاة الأولى ثم خرج إلى أهله وخرجت معه فاستقبله ولدان فجعل يمسح خدى أحدهم واحدا واحدا - قال - وأما أنا فمسح خدي - قال - فوجدت ليده بردا أو ريحا كأنما أخرجها من جؤنة عطار ‏.‏",
      "text_en": " Jabir b. Samura reported:                      I prayed along with Allah's Messenger (may peace be upon him) the first prayer. He then went to his family and I also went along with him when he met some children (on the way). He began to pat the cheeks of each one of them. He also patted my cheek and I experienced a coolness or a fragrance of his hand as if it had been brought out from the scent bag of a perfumer.",
      "chain": [
        "30473",
        "20643",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "6216",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا محمد بن المثنى، ومحمد بن بشار، - واللفظ لابن المثنى - قالا حدثنا  محمد بن جعفر، حدثنا شعبة، عن سماك بن حرب، قال سمعت جابر بن سمرة، قال كان رسول الله صلى الله عليه وسلم ضليع الفم أشكل العين منهوس العقبين ‏.‏ قال قلت لسماك ما ضليع الفم قال عظيم الفم ‏.‏ قال قلت ما أشكل العين قال طويل شق العين ‏.‏ قال قلت ما منهوس العقب قال قليل لحم العقب ‏.‏",
      "text_en": " Jabir b. Samura reported that Allah's Messenger (may peace be upon him) had a broad face with reddish (wide) eyes, and lean heels. Shu'ba reported:                      I said to Simak: What does this dali-ul-fam mean? And he said: This means broad face. I said: What does this ashkal mean? He said: Long in the slit of the eye. I said: What is this manhus-ul-aqibain? He said: It implies little flesh at the heels.",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "6229",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثنا محمد بن المثنى، حدثنا أبو داود، سليمان بن داود حدثنا شعبة، عن سماك، بن حرب قال سمعت جابر بن سمرة، سئل عن شيب النبي، صلى الله عليه وسلم فقال كان إذا دهن رأسه لم ير منه شىء وإذا لم يدهن رئي منه ‏.‏",
      "text_en": " Jabir b. Samura was asked about the old age of Allah's Apostle (may peace be upon him). He said:                      When he oiled his head nothing was seen (as a mark of old age) and when he did not apply oil something (of the old age) became visible.",
      "chain": [
        "30170",
        "20020",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "6230",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا عبيد الله، عن إسرائيل، عن سماك، أنه سمع  جابر بن سمرة، يقول كان رسول الله صلى الله عليه وسلم قد شمط مقدم رأسه ولحيته وكان إذا ادهن لم يتبين وإذا شعث رأسه تبين وكان كثير شعر اللحية فقال رجل وجهه مثل السيف قال لا بل كان مثل الشمس والقمر وكان مستديرا ورأيت الخاتم عند كتفه مثل بيضة الحمامة يشبه جسده ‏.‏",
      "text_en": " Jabir b. Samura reported that there had appeared some whiteness on the front part of the head and beard of Allah's Messenger (may peace be upon him). When he applied oil, it did not become visible, but when he did not (apply) oil, it became apparent. And he had a thick beard. A person said:                      His face was as (bright) as the sword. Thereupon he (Jabir) said: No, it was round and like the sun and the moon. And I saw the seal near his shoulder of the size of a pigeon's egg and its color was the same as that of his body.",
      "chain": [
        "30201",
        "11201",
        "20311",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "6231",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، عن سماك، قال سمعت  جابر بن سمرة، قال رأيت خاتما في ظهر رسول الله صلى الله عليه وسلم كأنه بيضة حمام ‏.‏",
      "text_en": " Jabir. Samura reported:                      I saw the seal on his back as if it were a pigeon's egg.",
      "chain": [
        "30170",
        "20173",
        "20020",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "7466",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا جرير، عن عبد الملك بن عمير، عن جابر بن سمرة، عن نافع بن عتبة، قال كنا مع رسول الله صلى الله عليه وسلم في غزوة - قال - فأتى النبي صلى الله عليه وسلم قوم من قبل المغرب عليهم ثياب الصوف فوافقوه عند أكمة فإنهم لقيام ورسول الله صلى الله عليه وسلم قاعد - قال - فقالت لي نفسي ائتهم فقم بينهم وبينه لا يغتالونه - قال - ثم قلت لعله نجي معهم ‏.‏ فأتيتهم فقمت بينهم وبينه - قال - فحفظت منه أربع كلمات أعدهن في يدي قال ‏\"‏ تغزون جزيرة العرب فيفتحها الله ثم فارس فيفتحها الله ثم تغزون الروم فيفتحها الله ثم تغزون الدجال فيفتحه الله ‏\"‏ ‏.‏ قال فقال نافع يا جابر لا نرى الدجال يخرج حتى تفتح الروم ‏.‏",
      "text_en": " Nafi' b. Utba reported:                      We were with Allah's Messenger (may peace be upon him) in an expedition that there came a people to Allah's Apostle (may peace be upon him) from the direction of the west. They were dressed in woollen clothes and they stood near a hillock and they met him as Allah's Messenger (may peace be upon him) was sitting. I said to myself: Better go to them and stand between him and them that they may not attack him. Then I thought that perhaps there had been going on secret negotiation amongst them. I however, went to them and btood between them and him and I remember four of the words (on that occasion) which I repeat (on the fingers of my hand) that he (Allah's Messenger) said: You will attack Arabia and Allah will enable you to conquer it, then you would attack Persia and He would make you to Conquer it. Then you would attack Rome and AllgLh will enable you to conquer it, then you would attack the Dajjal and Allah will enable you to conquer him. Nafi' said: Jabir, we thought that the Dajjal would appear after Rome (Syrian territory) would be conquered.",
      "chain": [
        "30367",
        "20028",
        "11368",
        "393"
      ]
    },
    {
      "hadith_no": "7514",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا جرير، عن عبد الملك بن عمير، عن جابر بن سمرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا هلك كسرى فلا كسرى بعده ‏\"‏ ‏.‏ فذكر بمثل حديث أبي هريرة سواء ‏.‏",
      "text_en": " Jabir b. Samura reported that Allah's Messenger (may peace be upon him) said:                      When Kisra would die there would be no Kisra after him; the rest of the hadith is the same as Abu Huraira reported.",
      "chain": [
        "30367",
        "20028",
        "11368",
        "393"
      ]
    },
    {
      "hadith_no": "7515",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا قتيبة بن سعيد، وأبو كامل الجحدري قالا حدثنا أبو عوانة، عن سماك، بن حرب عن جابر بن سمرة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لتفتحن عصابة من المسلمين أو من المؤمنين كنز آل كسرى الذي في الأبيض ‏\"‏ ‏.‏ قال قتيبة من المسلمين ‏.‏ ولم يشك ‏.‏",
      "text_en": " Jabir b. Samura reported:                      I heard Allah's Messenger (may peace be upon him) (as sayingt There would lie open for a group of Muslims, or for a group of believers, the treasures of the family of Kisra which would be in the whit (palace). In a version of Qutaiba there is definitely the word\" Muslim\".",
      "chain": [
        "30367",
        "30559",
        "20469",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "7516",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن  سماك بن حرب، قال سمعت جابر بن سمرة، قال سمعت رسول الله صلى الله عليه وسلم بمعنى حديث أبي عوانة ‏.‏",
      "text_en": " Jabir b. Samura reported:                      I heard Allah's Messenger (may peace be upon him) a hadith like this.",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "7524",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا يحيى بن يحيى، وأبو بكر بن أبي شيبة قال يحيى أخبرنا وقال أبو بكر حدثنا أبو الأحوص، ح وحدثنا أبو كامل الجحدري، حدثنا أبو عوانة، كلاهما عن  سماك، عن جابر بن سمرة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن بين يدى الساعة كذابين ‏\"‏ ‏.‏ وزاد في حديث أبي الأحوص قال فقلت له آنت سمعت هذا من رسول الله صلى الله عليه وسلم قال نعم ‏.‏",
      "text_en": " Jabir b. Samura reported:                      I heard Allah's Messenger (may peace be upon him) as saying: Before the Last Hour there would be many liars, and there is an addition in the badith transmitted on the authority of Abu Ahwas of these words:\" I said to him: Did you hear it from Allah's Messenger (may peace be upon him)? He said: Yes.\"",
      "chain": [
        "30399",
        "30201",
        "20031",
        "20436",
        "20327",
        "30559",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "403",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، عن سماك بن حرب، عن جابر بن سمرة، أن بلالا، كان يؤذن الظهر إذا دحضت الشمس ‏.‏",
      "text_en": " Jabir b. Samurah reported that Bilal used to call for the noon prayer when the sun had declined.",
      "chain": [
        "20040",
        "20022",
        "10770",
        "393",
        "24"
      ]
    },
    {
      "hadith_no": "537",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا شبابة، عن إسرائيل، عن سماك، عن جابر بن سمرة، قال كان بلال يؤذن ثم يمهل فإذا رأى النبي صلى الله عليه وسلم قد خرج أقام الصلاة ‏.‏",
      "text_en": " Jabir b. Samurah said:                      Bilal would call the Adhan, then he used come to wait. When he would see that the prophet (ﷺ) had come out (of his house), he would pronounce the iqama.",
      "chain": [
        "30203",
        "20426",
        "20311",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "661",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا زهير، قال سألت سليمان الأعمش عن جابر بن سمرة، في الصفوف المقدمة فحدثنا عن المسيب بن رافع، عن تميم بن طرفة، عن جابر بن سمرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ألا تصفون كما تصف الملائكة عند ربهم جل وعز ‏\"‏ ‏.‏ قلنا وكيف تصف الملائكة عند ربهم قال ‏\"‏ يتمون الصفوف المقدمة ويتراصون في الصف ‏\"‏ ‏.‏",
      "text_en": " jabir b. Samurah reported the Messenger of Allah (ﷺ) as saying:                      Why do you stand in rows as the angels do in the presence of their Lord? We asked: how do the angles stand in rows in the presence of their Lord? He replied: they make the first row complete and keep close together in the row.",
      "chain": [
        "30352",
        "20321",
        "11060",
        "393",
        "11394",
        "10894",
        "393"
      ]
    },
    {
      "hadith_no": "803",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن محمد بن عبيد الله أبي عون، عن جابر بن سمرة، قال قال عمر لسعد قد شكاك الناس في كل شىء حتى في الصلاة ‏.‏ قال أما أنا فأمد في الأوليين وأحذف في الأخريين ولا آلو ما اقتديت به من صلاة رسول الله صلى الله عليه وسلم ‏.‏ قال ذاك الظن بك ‏.‏",
      "text_en": " Jabir b. Samurah reported:                      ’Umar said to Sa’d: people complain against you for everything, even for prayer. He replied: I prolong the first two rak’ahs of prayer and make the last two rak’ahs brief; I do not fall short of following the prayer offered by the Messenger of Allah(May peace be upon him). He said: I think so about you.",
      "chain": [
        "30329",
        "20020",
        "30213",
        "393"
      ]
    },
    {
      "hadith_no": "805",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، عن سماك بن حرب، عن جابر بن سمرة، أن رسول الله صلى الله عليه وسلم كان يقرأ في الظهر والعصر بالسماء والطارق والسماء ذات البروج ونحوهما من السور ‏.‏",
      "text_en": " Narrated Jabir ibn Samurah:                     The Messenger of Allah (ﷺ) used to recite in the noon and afternoon prayer: \"By the Heaven and the Morning Star\" (Surah 86) and \"By the Heaven , holding mansions of the stars\" (Surah 85) and similar surahs of equal length.",
      "chain": [
        "20040",
        "20022",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "806",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن سماك، سمع جابر بن سمرة، قال كان رسول الله صلى الله عليه وسلم إذا دحضت الشمس صلى الظهر وقرأ بنحو من ‏{‏ والليل إذا يغشى ‏}‏ والعصر كذلك والصلوات كذلك إلا الصبح فإنه كان يطيلها ‏.‏",
      "text_en": " Jabir b. samurah said:                      When the sun declined, the Messenger of Allah (ﷺ) offered the noon prayer and recited surahs lie \"By the night when it covers over\" (92) and (recited similar surahs) in the afternoon prayer, and in the other prayers except the dawn prayer which he used to prolong.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "912",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، حدثنا أبو معاوية، ح وحدثنا عثمان بن أبي شيبة، حدثنا جرير، - وهذا حديثه وهو أتم - عن الأعمش، عن المسيب بن رافع، عن تميم بن طرفة الطائي، عن جابر بن سمرة، - قال عثمان - قال دخل رسول الله صلى الله عليه وسلم المسجد فرأى فيه ناسا يصلون رافعي أيديهم إلى السماء - ثم اتفقا - فقال ‏\"‏ لينتهين رجال يشخصون أبصارهم إلى السماء - قال مسدد في الصلاة - أو لا ترجع إليهم أبصارهم ‏\"‏ ‏.‏",
      "text_en": " Jabir b. Samurah said(this is the version of the narrator ‘Uthman):                      The Messenger of Allah(ﷺ) entered the mosque and saw there some people praying raising their hand towards the heaven. (This Is the common version: ) He said : People must stop raising their eyes to the heaven. The narrator Musaddad said: During prayer, otherwise their sight will be taken away.",
      "chain": [
        "30175",
        "20354",
        "30203",
        "20028",
        "11060",
        "11394",
        "10894",
        "393",
        "4"
      ]
    },
    {
      "hadith_no": "998",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا يحيى بن زكريا، ووكيع، عن مسعر، عن عبيد الله ابن القبطية، عن جابر بن سمرة، قال كنا إذا صلينا خلف رسول الله صلى الله عليه وسلم فسلم أحدنا أشار بيده من عن يمينه ومن عن يساره فلما صلى قال ‏\"‏ ما بال أحدكم يرمي بيده كأنها أذناب خيل شمس إنما يكفي أحدكم - أو ألا يكفي أحدكم - أن يقول هكذا ‏\"‏ ‏.‏ وأشار بأصبعه ‏\"‏ يسلم على أخيه من عن يمينه ومن عن شماله ‏\"‏ ‏.‏",
      "text_en": " Jabir b. Samurah said:                      When we prayed behind the Messenger of Allah(ﷺ), one of us gave the salutation and pointed with his hand to the man to his right side and left side. When he finished his prayer, he said: What is the matter that one of you points with his hand (during prayer) just like the tails of restive horses. It is sufficient for one of you, or is it not sufficient for one of you to say in this manner? And he pointed with his finger; one should salute his brother at his right and left side.",
      "chain": [
        "30203",
        "20032",
        "20359",
        "10794",
        "393"
      ]
    },
    {
      "hadith_no": "1000",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا زهير، حدثنا الأعمش، عن المسيب بن رافع، عن تميم الطائي، عن جابر بن سمرة، قال دخل علينا رسول الله صلى الله عليه وسلم والناس رافعو أيديهم - قال زهير أراه قال - في الصلاة فقال ‏\"‏ ما لي أراكم رافعي أيديكم كأنها أذناب خيل شمس اسكنوا في الصلاة ‏\"‏ ‏.‏",
      "text_en": " Jabir b. Samurah said:                      The Messenger of Allah (ﷺ) entered upon us while the people were raising their hands. The narrator Zubair said: I think( they were raising the hands) during prayer. He (the prophet) said: What is the matter, I see you raising your hands as if they are the tails of restive horses! Maintain tranquility during prayer.",
      "chain": [
        "30352",
        "20321",
        "11060",
        "11394",
        "393"
      ]
    },
    {
      "hadith_no": "1093",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا النفيلي عبد الله بن محمد، حدثنا زهير، عن سماك، عن جابر بن سمرة، أن رسول الله صلى الله عليه وسلم كان يخطب قائما ثم يجلس ثم يقوم فيخطب قائما فمن حدثك أنه كان يخطب جالسا فقد كذب فقال فقد والله صليت معه أكثر من ألفى صلاة ‏.‏",
      "text_en": " Jabir b. Samurah said:                      The Messenger of Allah (ﷺ) used to deliver the sermon standing, then he would sit down, then stand and preach standing. If anyone tells you he preached sitting, he is lying. I swear by Allah that I offered along with more than two thousand prayers.",
      "chain": [
        "20321",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "1094",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا إبراهيم بن موسى، وعثمان بن أبي شيبة، - المعنى - عن أبي الأحوص، حدثنا سماك، عن جابر بن سمرة، قال كان لرسول الله صلى الله عليه وسلم خطبتان كان يجلس بينهما يقرأ القرآن ويذكر الناس ‏.‏",
      "text_en": " Jabir b. Samurah said:                      The Messenger of Allah (ﷺ) gave two sermons between which he sat, recited the Quran and gave the people an exhortation.",
      "chain": [
        "30309",
        "20327",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "1095",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو كامل، حدثنا أبو عوانة، عن سماك بن حرب، عن جابر بن سمرة، قال رأيت النبي صلى الله عليه وسلم يخطب قائما ثم يقعد قعدة لا يتكلم ‏.‏ وساق الحديث ‏.‏",
      "text_en": " Jabir b. Samurah said:                      I saw the Prophet (ﷺ) would deliver the sermon standing, then sit down without saying anything. The narrator then reported the tradition in full.",
      "chain": [
        "30559",
        "20469",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "1101",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن سفيان، قال حدثني سماك، عن جابر بن سمرة، قال كانت صلاة رسول الله صلى الله عليه وسلم قصدا وخطبته قصدا يقرأ آيات من القرآن ويذكر الناس ‏.‏",
      "text_en": " Jabir b. Samurah said:                      The prayer offered by the Messenger of Allah (ﷺ) was moderate, and the sermon given by him was (also) moderate. He would recite a few verses from the Qur'an and exhort the people.",
      "chain": [
        "30175",
        "20031",
        "20012",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "1107",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمود بن خالد، حدثنا الوليد، أخبرني شيبان أبو معاوية، عن سماك بن حرب، عن جابر بن سمرة السوائي، قال كان رسول الله صلى الله عليه وسلم لا يطيل الموعظة يوم الجمعة إنما هن كلمات يسيرات ‏.‏",
      "text_en": " Narrated Jabir ibn Samurah as-Suwa'i:                     The Messenger of Allah (ﷺ) would not lengthen the sermon on Friday. He would say a few words.",
      "chain": [
        "37534",
        "20733",
        "20240",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "1148",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عثمان بن أبي شيبة، وهناد، - وهذا لفظه - قالا حدثنا أبو الأحوص، عن سماك، - يعني ابن حرب - عن جابر بن سمرة، قال صليت مع النبي صلى الله عليه وسلم غير مرة ولا مرتين العيدين بغير أذان ولا إقامة ‏.‏",
      "text_en": " Jabir b. Samurah said:                      I prayed the 'Id prayer with the Prophet (ﷺ) not once or twice (but many times) without the adhan and the iqamah.",
      "chain": [
        "30203",
        "30480",
        "20327",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "3178",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن سماك، سمع جابر بن سمرة، قال صلى النبي صلى الله عليه وسلم على ابن الدحداح ونحن شهود ثم أتي بفرس فعقل حتى ركبه فجعل يتوقص به ونحن نسعى حوله ‏.‏",
      "text_en": " Narrated Jabir b. Samurah:                     The Prophet (ﷺ) offered funeral prayer over Ibn al-Dahdah while we were present. He was then brought a horse, and it was tied until he rode it. It then began to gallop and we were running around it.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "3185",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا ابن نفيل، حدثنا زهير، حدثنا سماك، حدثني جابر بن سمرة، قال مرض رجل فصيح عليه فجاء جاره إلى رسول الله صلى الله عليه وسلم فقال له إنه قد مات ‏.‏ قال ‏\"‏ وما يدريك ‏\"‏ ‏.‏ قال أنا رأيته ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ إنه لم يمت ‏\"‏ ‏.‏ قال فرجع فصيح عليه فجاء إلى رسول الله صلى الله عليه وسلم فقال إنه قد مات ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ إنه لم يمت ‏\"‏ ‏.‏ فرجع فصيح عليه فقالت امرأته انطلق إلى رسول الله صلى الله عليه وسلم فأخبره ‏.‏ فقال الرجل اللهم العنه ‏.‏ قال ثم انطلق الرجل فرآه قد نحر نفسه بمشقص معه فانطلق إلى النبي صلى الله عليه وسلم فأخبره أنه قد مات فقال ‏\"‏ ما يدريك ‏\"‏ ‏.‏ قال رأيته ينحر نفسه بمشاقص معه ‏.‏ قال ‏\"‏ أنت رأيته ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ إذا لا أصلي عليه ‏\"‏ ‏.‏",
      "text_en": " Narrated Jabir ibn Samurah:                     A man fell ill and a cry was raised (for his death).  So his neighbour came to the Messenger of Allah (ﷺ) and said to him: He has died.  He asked: Who told you?  He said: I have seen him.  The Messenger of Allah (ﷺ) said: He has not died. He then returned. A cry was again raised (for his death).  He came to the Messenger of Allah (ﷺ) and said: He has died.  The Prophet (ﷺ) said: He has not died. He then returned. A cry was again raised over him. His wife said: Go to the Messenger of Allah (ﷺ) and inform him.  The man said: O Allah, curse him.  He said: The man then went and saw that he had killed himself with an arrowhead. So he went to the Prophet (ﷺ) and informed him that he had died.  He asked: Who told you?  He replied: I myself saw that he had killed himself with arrowheads.  He asked: Have you seen him?  He replied: Yes.  He then said: Then I shall not pray over him.",
      "chain": [
        "20321",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "3816",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، عن سماك بن حرب، عن جابر بن سمرة، أن رجلا، نزل الحرة ومعه أهله وولده فقال رجل إن ناقة لي ضلت فإن وجدتها فأمسكها ‏.‏ فوجدها فلم يجد صاحبها فمرضت فقالت امرأته انحرها ‏.‏ فأبى فنفقت فقالت اسلخها حتى نقدد شحمها ولحمها ونأكله ‏.‏ فقال حتى أسأل رسول الله صلى الله عليه وسلم فأتاه فسأله فقال ‏\"‏ هل عندك غنى يغنيك ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ فكلوها ‏\"‏ ‏.‏ قال فجاء صاحبها فأخبره الخبر فقال ‏\"‏ هلا كنت نحرتها ‏\"‏ ‏.‏ قال استحييت منك ‏.‏",
      "text_en": " Narrated Jabir ibn Samurah:                     A man alighted at Harrah with his wife and children.  A man said (to him): My she-camel has strayed; if you find it, detain it.  He found it, but did not find its owner, and it fell ill. His wife said: Slaughter it. But he refused and it died. She said: Skin it so that we may dry its fat and flesh and then eat them.  He said: Let me ask the Messenger of Allah (ﷺ). So he came to him (the Prophet) and asked him.  He said: Have you sufficient for your needs?  He replied: No.  He then said: Then eat it. Then its owner came and he told him the story.  He said: Why did you not slaughter it? He replied: I was ashamed (or afraid) of you.",
      "chain": [
        "20040",
        "20022",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "4143",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا وكيع، ح وحدثنا عبد الله بن الجراح، عن وكيع، عن إسرائيل، عن سماك، عن جابر بن سمرة، قال دخلت على النبي صلى الله عليه وسلم في بيته فرأيته متكئا على وسادة - زاد ابن الجراح - على يساره ‏.‏ قال أبو داود رواه إسحاق بن منصور عن إسرائيل أيضا على يساره ‏.‏",
      "text_en": " Narrated Jabir ibn Samurah:                     When I came to the Prophet (ﷺ) in his house, I saw him sitting reclining on a pillow. The narrator Ibn al-Jarrah added: \"on his left side\".Abu Dawud said: Ishaq b. Mansur transmitted it from Isra'il, also mentioning the words \"on his left side\".",
      "chain": [
        "30007",
        "20032",
        "20032",
        "20311",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "4279",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Promised Deliverer (Kitab Al-Mahdi) - كتاب المهدى",
      "chapter_no": "38",
      "text_ar": "حدثنا عمرو بن عثمان، حدثنا مروان بن معاوية، عن إسماعيل، - يعني ابن أبي خالد - عن أبيه، عن جابر بن سمرة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يزال هذا الدين قائما حتى يكون عليكم اثنا عشر خليفة كلهم تجتمع عليه الأمة ‏\"‏ ‏.‏ فسمعت كلاما من النبي صلى الله عليه وسلم لم أفهمه قلت لأبي ما يقول قال ‏\"‏ كلهم من قريش ‏\"‏ ‏.‏",
      "text_en": " Narrated Jabir ibn Samurah:                     The Prophet (ﷺ) said: The religion will continue to be established till there are twelve caliphs over you, and the whole community will agree on each of them. I then heard from the Prophet (ﷺ) some remarks which I could not understand. I asked my father: What is he saying: He said: all of them will belong to Quraysh.",
      "chain": [
        "10581",
        "20201",
        "11418",
        "19253",
        "393"
      ]
    },
    {
      "hadith_no": "4280",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Promised Deliverer (Kitab Al-Mahdi) - كتاب المهدى",
      "chapter_no": "38",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا وهيب، حدثنا داود، عن عامر، عن جابر بن سمرة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يزال هذا الدين عزيزا إلى اثنى عشر خليفة ‏\"‏ ‏.‏ قال فكبر الناس وضجوا ثم قال كلمة خفية قلت لأبي يا أبة ما قال قال ‏\"‏ كلهم من قريش ‏\"‏ ‏.‏",
      "text_en": " Narrated Jabir b. Samurah:                     I heard the Messenger of Allah (ﷺ) say: This religion will continue to be strong till the time of twelve caliphs. The people then uttered: Allah is more great and uproared. He then silently a word which I could not understand. So I said to my father: What did he say, father ? He said: All of them will belong to Quraish.",
      "chain": [
        "20040",
        "20299",
        "11052",
        "393"
      ]
    },
    {
      "hadith_no": "4281",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Promised Deliverer (Kitab Al-Mahdi) - كتاب المهدى",
      "chapter_no": "38",
      "text_ar": "حدثنا ابن نفيل، حدثنا زهير، حدثنا زياد بن خيثمة، حدثنا الأسود بن سعيد الهمداني، عن جابر بن سمرة، بهذا الحديث زاد فلما رجع إلى منزله أتته قريش فقالوا ثم يكون ماذا قال ‏\"‏ ثم يكون الهرج ‏\"‏ ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Jabir b. Samurah through a different chain of narrators. This version adds:                      When he came back to his home. the Quraish came to him and said: Then what will happen ? He said: Then turmoil will prevail.",
      "chain": [
        "20321",
        "20585",
        "15016",
        "393"
      ]
    },
    {
      "hadith_no": "4422",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا مسدد، حدثنا أبو عوانة، عن سماك، عن جابر بن سمرة، قال رأيت ماعز بن مالك حين جيء به إلى النبي صلى الله عليه وسلم رجلا قصيرا أعضل ليس عليه رداء فشهد على نفسه أربع مرات أنه قد زنى ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ فلعلك قبلتها ‏\"‏ ‏.‏ قال لا والله إنه قد زنى الآخر ‏.‏ قال فرجمه ثم خطب فقال ‏\"‏ ألا كلما نفرنا في سبيل الله عز وجل خلف أحدهم له نبيب كنبيب التيس يمنح إحداهن الكثبة أما إن الله إن يمكني من أحد منهم إلا نكلته عنهن ‏\"‏ ‏.‏",
      "text_en": " Jabir b. Samurah said:                      I saw Ma’iz b. Malik when he was brought to the Prophet (ﷺ). He was a small and muscular man. He did not wear the loose outer garment. He made confession about him four times that he committed fornication. The Messenger of Allah (ﷺ) said: Perhaps you kissed her. He said that this most discarded man has committed fornication. He said: So he had him stoned to death and gave an address, saying: Beware, whenever we go out on an expedition in the path of Allah, one of them (I.e. the people) lags behind with a bleating sound like that of a he-goat, and gives modicum of his milk(i.e. sperm) to one of the women. If Allah gives control over any of them, I shall deter him from them (i.e. women) by punishing him severely.",
      "chain": [
        "30175",
        "20469",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "4423",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا محمد بن المثنى، عن محمد بن جعفر، عن شعبة، عن سماك، قال سمعت جابر بن سمرة، بهذا الحديث والأول أتم قال فرده مرتين ‏.‏ قال سماك فحدثت به سعيد بن جبير فقال إنه رده أربع مرات ‏.‏",
      "text_en": " Simak said:                      I heard this tradition from Jabir b. Samurah. But the first version is more perfect. This version has: He repeated twice, Simak said: I narrated to Sa’id b. Jubair. He said: He repeated it four times.",
      "chain": [
        "30170",
        "20173",
        "20020",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "4823",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن الأعمش، قال حدثني المسيب بن رافع، عن تميم بن طرفة، عن جابر بن سمرة، قال دخل رسول الله صلى الله عليه وسلم المسجد وهم حلق فقال ‏\"‏ ما لي أراكم عزين ‏\"‏ ‏.‏",
      "text_en": " JABIR B. SAMURAH SAID:                      THE APOSTLE OF ALLAH(MAY PEACE BE UPON HIM) ENTERED THE MOSQUE, AND SAW THEM( HIS COMPANIONS) IN SEPARATE GROUPS. HE SAID: HOW IS IT THAT I SEE YOU IN SEPARATE GROUPS.",
      "chain": [
        "30175",
        "20031",
        "11060",
        "11394",
        "10894",
        "393"
      ]
    },
    {
      "hadith_no": "4825",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن جعفر الوركاني، وهناد، أن شريكا، أخبرهم عن سماك، عن جابر بن سمرة، قال كنا إذا أتينا النبي صلى الله عليه وسلم جلس أحدنا حيث ينتهي ‏.‏",
      "text_en": " Narrated Jabir ibn Samurah:                     When we came to the Prophet (ﷺ), each one would sit down where there was room.",
      "chain": [
        "30513",
        "30480",
        "20587",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "4850",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا أبو داود الحفري، حدثنا سفيان الثوري، عن سماك بن حرب، عن جابر بن سمرة، قال كان النبي صلى الله عليه وسلم إذا صلى الفجر تربع في مجلسه حتى تطلع الشمس حسناء ‏.‏",
      "text_en": " JABIR B. SAMURAH SAID:                      WHEN THE PROPHET(MAY PEACE BE UPON HIM) PRAYED THE DAWN PRAYER, HE SAT CROSS-LEGGED WHERE HE WAS TILL THE SUN HAD COME WELL UP.",
      "chain": [
        "30203",
        "20668",
        "20012",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "202",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا يحيى بن موسى، حدثنا عبد الرزاق، أخبرنا إسرائيل، أخبرني سماك بن حرب، سمع جابر بن سمرة، يقول كان مؤذن رسول الله صلى الله عليه وسلم يمهل فلا يقيم حتى إذا رأى رسول الله صلى الله عليه وسلم قد خرج أقام الصلاة حين يراه ‏.‏ قال أبو عيسى حديث جابر بن سمرة هو حديث حسن صحيح ‏.‏ وحديث إسرائيل عن سماك لا نعرفه إلا من هذا الوجه ‏.‏ وهكذا قال بعض أهل العلم إن المؤذن أملك بالأذان والإمام أملك بالإقامة ‏.‏",
      "text_en": " Jabir bin Samurah narrated:                     The Mu'adh-dhin of Allah's Messenger would wait and he would not call the Iqamah until he saw the Allah's Messenger had come out, he would call the Iqamah when he saw him.\"",
      "chain": [
        "30221",
        "20121",
        "20311",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "307",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا يزيد بن هارون، أخبرنا حماد بن سلمة، عن سماك بن حرب، عن جابر بن سمرة، أن رسول الله صلى الله عليه وسلم كان يقرأ في الظهر والعصر بالسماء ذات البروج والسماء والطارق وشبههما ‏.‏ قال وفي الباب عن خباب وأبي سعيد وأبي قتادة وزيد بن ثابت والبراء بن عازب ‏.‏ قال أبو عيسى حديث جابر بن سمرة حديث حسن ‏.‏ وقد روي عن النبي صلى الله عليه وسلم أنه قرأ في الظهر قدر تنزيل السجدة ‏.‏ وروي عنه أنه كان يقرأ في الركعة الأولى من الظهر قدر ثلاثين آية وفي الركعة الثانية قدر خمس عشرة آية ‏.‏ وروي عن عمر أنه كتب إلى أبي موسى أن اقرأ في الظهر بأوساط المفصل ‏.‏ ورأى بعض أهل العلم أن القراءة في صلاة العصر كنحو القراءة في صلاة المغرب يقرأ بقصار المفصل ‏.‏ وروي عن إبراهيم النخعي أنه قال تعدل صلاة العصر بصلاة المغرب في القراءة ‏.‏ وقال إبراهيم تضاعف صلاة الظهر على صلاة العصر في القراءة أربع مرار ‏.‏",
      "text_en": " Jabir bin Samurah narrated:                     \"For Zuhr and Asr, Allah's Messenger would recite: By the heavens, holding the Buruj and (By the heavens and At-Tariq) and similar to them.\"",
      "chain": [
        "30242",
        "20472",
        "20021",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "507",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on the Day of Friday - كِتَاب الْجُمُعَةِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
      "chapter_no": "4",
      "text_ar": "حدثنا قتيبة، وهناد، قالا حدثنا أبو الأحوص، عن سماك بن حرب، عن جابر بن سمرة، قال كنت أصلي مع النبي صلى الله عليه وسلم فكانت صلاته قصدا وخطبته قصدا ‏.‏ قال وفي الباب عن عمار بن ياسر وابن أبي أوفى ‏.‏ قال أبو عيسى حديث جابر بن سمرة حديث حسن صحيح ‏.‏",
      "text_en": " Jabir bin Samurah narrated:                     \"I would pray with the Prophet, and his prayer was moderate, and his Khutbah was moderate.\"",
      "chain": [
        "30367",
        "30480",
        "20327",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "532",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on the Two Eids - أَبْوَابُ الْعِيدَيْنِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
      "chapter_no": "5",
      "text_ar": "حدثنا قتيبة، حدثنا أبو الأحوص، عن سماك بن حرب، عن جابر بن سمرة، قال صليت مع النبي صلى الله عليه وسلم العيدين غير مرة ولا مرتين بغير أذان ولا إقامة ‏.‏ قال وفي الباب عن جابر بن عبد الله وابن عباس ‏.‏ قال أبو عيسى وحديث جابر بن سمرة حديث حسن صحيح ‏.‏ والعمل عليه عند أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم أنه لا يؤذن لصلاة العيدين ولا لشيء من النوافل ‏.‏",
      "text_en": " Jabir bin Samurah narrated:                     \"I prayed the two Eid prayers with the Prophet - not one time, not two times - without and Adhan nor an Iqamah.\"",
      "chain": [
        "30367",
        "20327",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "585",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Traveling - أَبْوَابُ السَّفَرِ",
      "chapter_no": "6",
      "text_ar": "حدثنا قتيبة، حدثنا أبو الأحوص، عن سماك بن حرب، عن جابر بن سمرة، قال كان النبي صلى الله عليه وسلم إذا صلى الفجر قعد في مصلاه حتى تطلع الشمس ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Jabir bin Samurah narrated:                     \"When the Prophet prayed Fajr he would remain seated where he had prayed until the sun had risen.\"",
      "chain": [
        "30367",
        "20327",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "1013",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود، حدثنا شعبة، عن سماك بن حرب، قال سمعت جابر بن سمرة، يقول كنا مع النبي صلى الله عليه وسلم في جنازة أبي الدحداح وهو على فرس له يسعى ونحن حوله وهو يتوقص به ‏.‏",
      "text_en": " Jabir bin Samurah narrated:                     \"We were with the Prophet (following) the funeral of Ibn Ad-Dahbah, and he was on a horse that was walking quickly, and we were around him, and he was trotting.\"",
      "chain": [
        "30277",
        "30002",
        "20020",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "1014",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد الله بن الصباح الهاشمي، حدثنا أبو قتيبة، عن الجراح، عن سماك، عن جابر بن سمرة، أن النبي صلى الله عليه وسلم اتبع جنازة أبي الدحداح ماشيا ورجع على فرس ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Jabir bin Samurah narrated:                     \"The Prophet followed the funeral of Ibn Ad-Dahdah walking and he returned on horseback.\"",
      "chain": [
        "30142",
        "20233",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "1068",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا يوسف بن عيسى، حدثنا وكيع، حدثنا إسرائيل، وشريك، عن سماك بن حرب، عن جابر بن سمرة، أن رجلا، قتل نفسه فلم يصل عليه النبي صلى الله عليه وسلم ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ واختلف أهل العلم في هذا فقال بعضهم يصلى على كل من صلى إلى القبلة وعلى قاتل النفس ‏.‏ وهو قول سفيان الثوري وإسحاق ‏.‏ وقال أحمد لا يصلي الإمام على قاتل النفس ويصلي عليه غير الإمام ‏.‏",
      "text_en": " Jabir bin Samurah narrated:                     \"A man killed himself, so the Prophet did not perform Salat over him.\"",
      "chain": [
        "30401",
        "20032",
        "20311",
        "11858",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "1437",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Legal Punishments (Al-Hudud) - كتاب الحدود عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "17",
      "text_ar": "حدثنا هناد، حدثنا شريك، عن سماك بن حرب، عن جابر بن سمرة، أن النبي صلى الله عليه وسلم رجم يهوديا ويهودية ‏.‏ قال وفي الباب عن ابن عمر والبراء وجابر وابن أبي أوفى وعبد الله بن الحارث بن جزء وابن عباس ‏.‏ قال أبو عيسى حديث جابر بن سمرة حديث حسن غريب ‏.‏ والعمل على هذا عند أكثر أهل العلم قالوا إذا اختصم أهل الكتاب وترافعوا إلى حكام المسلمين حكموا بينهم بالكتاب والسنة وبأحكام المسلمين وهو قول أحمد وإسحاق ‏.‏ وقال بعضهم لا يقام عليهم الحد في الزنا ‏.‏ والقول الأول أصح ‏.‏",
      "text_en": " Narrated Jabir bin Samurah:                     That the Prophet (ﷺ) stoned a Jew and a Jewess.",
      "chain": [
        "30480",
        "20587",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "1807",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود، أنبأنا شعبة، عن سماك بن حرب، سمع جابر بن سمرة، يقول نزل رسول الله صلى الله عليه وسلم على أبي أيوب وكان إذا أكل طعاما بعث إليه بفضله فبعث إليه يوما بطعام ولم يأكل منه النبي صلى الله عليه وسلم فلما أتى أبو أيوب النبي صلى الله عليه وسلم فذكر ذلك له فقال ‏\"‏ فيه ثوم ‏\"‏ ‏.‏ فقال يا رسول الله أحرام هو قال ‏\"‏ لا ولكني أكرهه من أجل ريحه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Jabir bin Samurah:                     \"The Messenger of Allah (ﷺ) was staying with Abu Ayyub. When he ate some food, he would send what was left to him. So one day he sent him some food but the Prophet (ﷺ) did not eat from it. So Abu Ayyub went to the Prophet (ﷺ) and mentioned that to him. The Prophet (ﷺ) said: 'It contained garlic.' So he said: 'O Messenger of Allah! Is it unlawful?' He said: 'No, I dislike it because of its odor.'\"He said: This Hadith is Hasan Sahih.",
      "chain": [
        "30277",
        "20547",
        "20020",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "2078",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا قتيبة، حدثنا يحيى بن يعلى، عن ناصح، عن سماك بن حرب، عن جابر بن سمرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لأن يؤدب الرجل ولده خير من أن يتصدق بصاع ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏ وناصح هو ابن العلاء كوفي ليس عند أهل الحديث بالقوي ولا يعرف هذا الحديث إلا من هذا الوجه وناصح شيخ آخر بصري يروي عن عمار بن أبي عمار وغيره هو أثبت من هذا ‏.‏",
      "text_en": " Jabir bin Sumurah narrated that the Messenger of Allah said :                     \"That a man should discipline his son is better for him than to have given a Sa' in charity.\"(Daif)",
      "chain": [
        "30367",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "2223",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو كريب، محمد بن العلاء حدثنا عمر بن عبيد الطنافسي، عن سماك بن حرب، عن جابر بن سمرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يكون من بعدي اثنا عشر أميرا ‏\"‏ ‏.‏ قال ثم تكلم بشيء لم أفهمه فسألت الذي يليني فقال قال ‏\"‏ كلهم من قريش ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح  ‏.‏ حدثنا أبو كريب، حدثنا عمر بن عبيد، عن أبيه، عن أبي بكر بن أبي موسى، عن جابر بن سمرة، عن النبي صلى الله عليه وسلم مثل هذا الحديث وقد روي من غير وجه عن جابر بن سمرة ‏.‏ قال أبو عيسى هذا حديث حسن غريب يستغرب من حديث أبي بكر بن أبي موسى عن جابر بن سمرة ‏.‏ وفي الباب عن ابن مسعود وعبد الله بن عمرو ‏.‏",
      "text_en": " Simak bin Harb narrated from Jabir bin Samurah who said \" The Messenger of Allah(s.a.w) said:                     'There will be twelve Amir after me.\"' He said: \"Then he said something that I did not understand. So I asked the one who was next to me, who said that he(s.a.w) had said: 'All of them are from Quraish.\"'",
      "chain": [
        "30216",
        "20346",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "2725",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Seeking Permission - كتاب الاستئذان والآداب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "42",
      "text_ar": "حدثنا علي بن حجر، أخبرنا شريك، عن سماك بن حرب، عن جابر بن سمرة، قال كنا إذا أتينا النبي صلى الله عليه وسلم جلس أحدنا حيث ينتهي ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏ وقد رواه زهير بن معاوية عن سماك أيضا ‏.‏",
      "text_en": " Narrated Jabir bin Samurah:                     \"When we went to the Prophet (ﷺ), each of us would sit wherever he wound up at.\"",
      "chain": [
        "20387",
        "20587",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "2997",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا عباس بن محمد الدوري البغدادي، حدثنا إسحاق بن منصور الكوفي، أخبرنا إسرائيل، عن سماك بن حرب، عن جابر بن سمرة، قال رأيت النبي صلى الله عليه وسلم متكئا على وسادة على يساره ‏.‏ قال أبو عيسى هذا حديث حسن غريب وروى غير واحد هذا الحديث عن إسرائيل عن سماك عن جابر بن سمرة قال رأيت النبي صلى الله عليه وسلم متكئا على وسادة ‏.‏ ولم يذكر على يساره ‏.‏",
      "text_en": " Narrated Jabir bin Samurah:                     \"I saw the Messenger of Allah (ﷺ) reclining upon as pillow, on his left side.\"",
      "chain": [
        "30313",
        "20311",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "2998",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا يوسف بن عيسى، حدثنا وكيع، عن إسرائيل، عن سماك بن حرب، عن جابر بن سمرة، قال رأيت النبي صلى الله عليه وسلم متكئا على وسادة ‏.‏ هذا حديث صحيح ‏.‏",
      "text_en": " Narrated Jabir bin Samurah:                     \"I saw the Prophet (ﷺ) reclining upon a pillow.\"",
      "chain": [
        "30401",
        "20032",
        "20311",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "3041",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا هناد، حدثنا عبثر بن القاسم، عن الأشعث، وهو ابن سوار عن أبي إسحاق، عن جابر بن سمرة، قال رأيت رسول الله صلى الله عليه وسلم في ليلة إضحيان فجعلت أنظر إلى رسول الله صلى الله عليه وسلم وإلى القمر وعليه حلة حمراء فإذا هو عندي أحسن من القمر ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من حديث الأشعث ‏.‏",
      "text_en": " Narrated Jabir Bin Samurah:                     \"I saw the Prophet (ﷺ) on a clear night, so I looked at the Messenger of Allah (ﷺ) and at the moon, and he was wearing a red Hullah, and he looked better than the moon to me.\"",
      "chain": [
        "30480",
        "20329",
        "485",
        "11049",
        "393"
      ]
    },
    {
      "hadith_no": "3087",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا علي بن حجر، أخبرنا شريك، عن سماك، عن جابر بن سمرة، قال جالست النبي صلى الله عليه وسلم أكثر من مائة مرة فكان أصحابه يتناشدون الشعر ويتذاكرون أشياء من أمر الجاهلية وهو ساكت فربما تبسم معهم ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وقد رواه زهير عن سماك أيضا ‏.‏",
      "text_en": " Narrated Jabir bin Samurah:                     \"I sat with the Prophet (ﷺ) more than one-hundred times. His Companions used to recite poetry and talk about things that occurred during Jahiliyyah, and he would remain silent, and sometimes he would smile along with them.\"",
      "chain": [
        "20387",
        "20587",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "3984",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن بشار، ومحمود بن غيلان، قالا أنبأنا أبو داود الطيالسي، حدثنا سليمان بن معاذ الضبي، عن سماك بن حرب، عن جابر بن سمرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن بمكة حجرا كان يسلم على ليالي بعثت إني لأعرفه الآن ‏\"‏ ‏.‏ قال هذا حديث حسن غريب ‏.‏",
      "text_en": " Narrated Simak bin Harb:                     from Jabir bin Samurah, that the Messenger of Allah (ﷺ) said: \"Indeed in Makkah there is a rock that used to give me Salam during the night of my advent, and I know it even now.\"",
      "chain": [
        "30160",
        "30277",
        "20547",
        "21277",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "4005",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا سعيد بن يعقوب الطالقاني، حدثنا أيوب بن جابر، عن سماك بن حرب، عن جابر بن سمرة، قال كان خاتم رسول الله صلى الله عليه وسلم - يعني الذي بين كتفيه غدة حمراء مثل بيضة الحمامة ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Jabir bin Samurah:                     \"The seal of the Messenger of Allah (ﷺ)\" - meaning the one which was between his two shoulder blades - \"was fleshy and red, resembling the egg of a pigeon.\"",
      "chain": [
        "38240",
        "25029",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "4006",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا عباد بن العوام، أخبرنا الحجاج، هو ابن أرطاة عن سماك بن حرب، عن جابر بن سمرة، قال كان في ساقى رسول الله صلى الله عليه وسلم حموشة وكان لا يضحك إلا تبسما وكنت إذا نظرت إليه قلت أكحل العينين وليس بأكحل ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه ‏.‏",
      "text_en": " Narrated Jabir bin Samurah:                     \"The two shins of the Messenger of Allah (ﷺ) were thin, and he would not laugh except as a smile, and whenever I looked at him I would say: \"He put kohl on his eyes,' but he (ﷺ) did not use kohl.\"",
      "chain": [
        "30242",
        "20431",
        "20580",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "4007",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا أبو قطن، حدثنا شعبة، عن سماك بن حرب، عن جابر بن سمرة، قال كان النبي صلى الله عليه وسلم ضليع الفم أشكل العينين منهوس العقب ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Jabir bin Samurah:                     \"The Messenger of Allah (ﷺ) had a wide mouth (Dali' Al-Fam), his eyes were Ashkal, and he had thin heals (Manhus Al-'Aqib).\"",
      "chain": [
        "30242",
        "20563",
        "20020",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "4008",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا أبو موسى، محمد بن المثنى قال حدثنا محمد بن جعفر، حدثنا شعبة، عن سماك بن حرب، عن جابر بن سمرة، قال كان رسول الله صلى الله عليه وسلم ضليع الفم أشكل العينين منهوش العقب ‏.‏ قال شعبة قلت لسماك ما ضليع الفم قال واسع الفم ‏.‏ قلت ما أشكل العين قال طويل شق العين ‏.‏ قال قلت ما منهوش العقب قال قليل اللحم ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Jabir bin Samurah:                     \"The Messenger of Allah (ﷺ) had a wide mouth (Dali' Al-Fam), his eyes were Ashkal, and he had thin heels (Manhus Al-'Aqib). Shu'bah (one of the narrators) said: \"I said to Simak: 'What is \"Dali' Al-Fam?\"' He said: 'A wide mouth.' I said: 'What is \"Ashkal Al-'Ainain?\"' He said: 'Having long eyes.'\" [He said:] \"I said: 'What is \"Manhus Al-'Aqib?\"' He said: 'Little flesh.'\"",
      "chain": [
        "20173",
        "20020",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "538",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا قتيبة، قال حدثنا أبو الأحوص، عن سماك، عن جابر بن سمرة، قال كان رسول الله صلى الله عليه وسلم يؤخر العشاء الآخرة ‏.‏",
      "text_en": " It was narrated that Jabir bin Samurah said:                      \"The Messenger of Allah (ﷺ) used to delay the later 'Isha'.\"[1][1] It is described as the later 'Isha' prayer because the Maghrib prayer is sometimes called 'Isha' prayer, but it is the first 'Isha'. Some scholars are of the opinion that it is disliked to call Maghrib 'Isha' without qualifying it as the first 'Isha'. See Fath Al-Bari.",
      "chain": [
        "30367",
        "20327",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "816",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا قتيبة، قال حدثنا الفضيل بن عياض، عن الأعمش، عن المسيب بن رافع، عن تميم بن طرفة، عن جابر بن سمرة، قال خرج إلينا رسول الله صلى الله عليه وسلم فقال ‏\"‏ ألا تصفون كما تصف الملائكة عند ربهم ‏\"‏ ‏.‏ قالوا وكيف تصف الملائكة عند ربهم قال ‏\"‏ يتمون الصف الأول ثم يتراصون في الصف ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Jabir bin Samurah said:                      \"The Messenger of Allah (ﷺ) came out to us and said:'Will you not form rows as the angels form rows before their Lord? They said: 'How do the angels form rows before their lord? He said: 'They complete the first row and fill the gaps in the rows.\"'",
      "chain": [
        "30367",
        "20200",
        "11060",
        "11394",
        "10894",
        "393"
      ]
    },
    {
      "hadith_no": "979",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا عبد الرحمن، قال حدثنا حماد بن سلمة، عن سماك، عن جابر بن سمرة، أن النبي صلى الله عليه وسلم كان يقرأ في الظهر والعصر بالسماء ذات البروج والسماء والطارق ونحوهما ‏.‏",
      "text_en": " It was narrated from Jabir bin Samurah that :                     The Prophet (ﷺ) used to recite \"By the heaven holding the big stars\" and: \"By the heaven, and At-Tariq (the night-comer, i.e. the bright star)\" and similar surahs in Zuhr and 'Asr.",
      "chain": [
        "30153",
        "20033",
        "20021",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "980",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا إسحاق بن منصور، قال حدثنا عبد الرحمن، عن شعبة، عن سماك، عن جابر بن سمرة، قال كان النبي صلى الله عليه وسلم يقرأ في الظهر ‏{‏ والليل إذا يغشى ‏}‏ وفي العصر نحو ذلك وفي الصبح بأطول من ذلك ‏.‏",
      "text_en": " It was narrated that Jabir bin Samurah said:                     \"The Prophet (ﷺ) used to recite \"By the night as it envelops\" in Zuhr and something similar in 'Asr, and he would recite something longer than that in subh.\"",
      "chain": [
        "30313",
        "20033",
        "20020",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "1002",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا يحيى بن سعيد، قال حدثنا شعبة، قال حدثني أبو عون، قال سمعت جابر بن سمرة، يقول قال عمر لسعد قد شكاك الناس في كل شىء حتى في الصلاة ‏.‏ فقال سعد أتئد في الأوليين وأحذف في الأخريين وما آلو ما اقتديت به من صلاة رسول الله صلى الله عليه وسلم ‏.‏ قال ذاك الظن بك ‏.‏",
      "text_en": " Abu 'Awn said:                     \"I heard Jabir bin Samurah say: 'Umar said to Sa'eed': \"The people are complaining about everything about you, even about your prayer.\" Sa'd said: \"I take my time in the first two rak'ahs and I make the other two shorter. I do my best to follow the example of the Messenger of Allah (ﷺ) in prayer.\" 'Umar said: 'That is what I thought about you.'\"",
      "chain": [
        "30153",
        "20031",
        "20020",
        "393"
      ]
    },
    {
      "hadith_no": "1003",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا حماد بن إسماعيل بن إبراهيم ابن علية أبو الحسن، قال حدثنا أبي، عن داود الطائي، عن عبد الملك بن عمير، عن جابر بن سمرة، قال وقع ناس من أهل الكوفة في سعد عند عمر فقالوا والله ما يحسن الصلاة ‏.‏ فقال أما أنا فأصلي بهم صلاة رسول الله صلى الله عليه وسلم لا أخرم عنها أركد في الأوليين وأحذف في الأخريين ‏.‏ قال ذاك الظن بك ‏.‏",
      "text_en": " It was narrated that Jabir bin Samurah said:                     \"Some of the peole of Al-Khufah complained about Sa'd to 'Umar. They said: 'By Allah, he does not pray properly.' He said: 'I lead them in prayer as the Messenger of Allah (ﷺ) did, and I do not deviate from that. I take my time in the first two rak'ahs and make the other two shorter.' He (Umar) said: 'That is what I thought about you.'\"",
      "chain": [
        "25086",
        "11368",
        "393"
      ]
    },
    {
      "hadith_no": "1184",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا قتيبة بن سعيد، قال حدثنا عبثر، عن الأعمش، عن المسيب بن رافع، عن تميم بن طرفة، عن جابر بن سمرة، قال خرج علينا رسول الله صلى الله عليه وسلم ونحن رافعو أيدينا في الصلاة فقال ‏\"‏ ما بالهم رافعين أيديهم في الصلاة كأنها أذناب الخيل الشمس اسكنوا في الصلاة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Jabir bin Samurah said:                     \"The Messenger of Allah (ﷺ) came out to us and we were raising our hands during the Salah. He said: 'Why are you raising your hands while praying, like the tails of wild horses? Stay still when you are praying.'\"",
      "chain": [
        "30367",
        "11060",
        "11394",
        "10894",
        "393"
      ]
    },
    {
      "hadith_no": "1185",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا يحيى بن آدم، عن مسعر، عن عبيد الله ابن القبطية، عن جابر بن سمرة، قال كنا نصلي خلف النبي صلى الله عليه وسلم فنسلم بأيدينا فقال ‏\"‏ ما بال هؤلاء يسلمون بأيديهم كأنها أذناب خيل شمس أما يكفي أحدهم أن يضع يده على فخذه ثم يقول السلام عليكم السلام عليكم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Jabir bin Samurah said:                     \"We used to pray behind the Messenger of Allah (ﷺ) and we would greet (others) with our hands. He said: 'What is the matter with those who greet (others) with their hands as if they were tails of wild horses? It is sufficient for any one of you to put his hand on his thigh and say: \"As-salamu 'alaikum, as-salamu 'alaikum.\"",
      "chain": [
        "38022",
        "20364",
        "20359",
        "10794",
        "393"
      ]
    },
    {
      "hadith_no": "1318",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا عمرو بن منصور، قال حدثنا أبو نعيم، عن مسعر، عن عبيد الله ابن القبطية، قال سمعت جابر بن سمرة، يقول كنا إذا صلينا خلف النبي صلى الله عليه وسلم قلنا السلام عليكم السلام عليكم ‏.‏ وأشار مسعر بيده عن يمينه وعن شماله فقال ‏\"‏ ما بال هؤلاء الذين يرمون بأيديهم كأنها أذناب الخيل الشمس أما يكفي أن يضع يده على فخذه ثم يسلم على أخيه عن يمينه وعن شماله ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ubaidullah bin Al-Qibtiyyah said:                     \"I heard Jabir bin Samurah say: 'When we prayed behind the Prophet (ﷺ) we used to say: As-salamu 'alaykum, as-salamu 'alaykum (peace be upon you, peace be upon you)\" - and Mis'ar (one of the narrators) pointed with his hand to the right and the left. He (ﷺ) said: 'What is the matter with these people who wave their hands as if they are the tails of wild horses? It is sufficient for one to place his hands on his thighs and to say the salam to his brother to his right and left.\"",
      "chain": [
        "38433",
        "20348",
        "20359",
        "10794",
        "393"
      ]
    },
    {
      "hadith_no": "1326",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا عبيد الله بن موسى، قال حدثنا إسرائيل، عن فرات القزاز، عن عبيد الله، - وهو ابن القبطية - عن جابر بن سمرة، قال صليت مع رسول الله صلى الله عليه وسلم فكنا إذا سلمنا قلنا بأيدينا السلام عليكم السلام عليكم - قال - فنظر إلينا رسول الله صلى الله عليه وسلم فقال ‏\"‏ ما شأنكم تشيرون بأيديكم كأنها أذناب خيل شمس إذا سلم أحدكم فليلتفت إلى صاحبه ولا يومئ بيده ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Jabir bin Samurah said:                     \"I prayed with the Messenger of Allah (ﷺ) and when we said the salam we used to gesture with our hands: 'Asalamu alaykum wa rahmatullah (peace be upon, peace be upon you).' The Messenger of Allah (ﷺ) looked at us and said: 'What is the matter with you, pointing with your hands as if they are the tails of wild horses? When any one of you says the salam, let him turn to his companions and not gesture with his hand.'\"",
      "chain": [
        "38022",
        "20340",
        "20311",
        "11384",
        "10794",
        "393"
      ]
    },
    {
      "hadith_no": "1357",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا قتيبة بن سعيد، قال حدثنا أبو الأحوص، عن سماك، عن جابر بن سمرة، قال كان رسول الله صلى الله عليه وسلم إذا صلى الفجر قعد في مصلاه حتى تطلع الشمس ‏.‏",
      "text_en": " It was narrated that Jabir bin Samurah said:                     \"When the Messenger of Allah (ﷺ) prayed fajr, he would sit in the place where he had prayed until the sun rose.\"",
      "chain": [
        "30367",
        "20327",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "Grade",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرنا علي بن حجر، قال حدثنا شريك، عن سماك، عن جابر بن سمرة، قال جالست النبي صلى الله عليه وسلم فما رأيته يخطب إلا قائما ويجلس ثم يقوم فيخطب الخطبة الآخرة ‏.‏",
      "text_en": " It was narrated that Jabir bin Samurah said:                     \"I sat with the Prophet (ﷺ) and I did not see him deliver the khutbah except standing, and he sat, then he stood up and delivered the second khutbah.\"",
      "chain": [
        "20387",
        "20587",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "Grade",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرنا محمد بن عبد الله بن بزيع، قال حدثنا يزيد، - يعني ابن زريع - قال حدثنا إسرائيل، قال حدثنا سماك، عن جابر بن سمرة، قال رأيت رسول الله صلى الله عليه وسلم يخطب يوم الجمعة قائما ثم يقعد قعدة لا يتكلم ثم يقوم فيخطب خطبة أخرى فمن حدثكم أن رسول الله صلى الله عليه وسلم كان يخطب قاعدا فقد كذب ‏.‏",
      "text_en": " It was narrated that Jabir bin Samurah said:                     \"I saw the Messenger of Allah (ﷺ) delivering the khutbah on Friday standing, then he sat briefly and did not speak, then he stood up and delivered a second khutbah. So whoever tells you that the Messenger of Allah (ﷺ) used to deliver the khutbah seated, he has lied.\"",
      "chain": [
        "30448",
        "20304",
        "20311",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "Grade",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرنا عمرو بن علي، عن عبد الرحمن، قال حدثنا سفيان، عن سماك، عن جابر بن سمرة، قال كان النبي صلى الله عليه وسلم يخطب قائما ثم يجلس ثم يقوم ويقرأ آيات ويذكر الله عز وجل وكانت خطبته قصدا وصلاته قصدا ‏.‏",
      "text_en": " It was narrated that Jabir bin Samurah said:                     \"The Prophet (ﷺ) used to deliver the khutbah standing, then he would sit, then he would stand up and recite some Verses and remember Allah (SWT), the Mighty and Sublime. His khutbah was moderate in length and his prayer was moderate in length.\"",
      "chain": [
        "30153",
        "20033",
        "20012",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "1582",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Prayer for the Two 'Eids - كتاب صلاة العيدين",
      "chapter_no": "19",
      "text_ar": "أخبرنا قتيبة، قال حدثنا أبو الأحوص، عن سماك، عن جابر بن سمرة، قال كنت أصلي مع النبي صلى الله عليه وسلم فكانت صلاته قصدا وخطبته قصدا ‏.‏",
      "text_en": " It was narrated that Jabir bin Samurah said:                     \"I used to pray with the Prophet (ﷺ) and his prayer was moderate in length and his Khutbah was moderate in length.\"",
      "chain": [
        "30367",
        "20327",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "1583",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Prayer for the Two 'Eids - كتاب صلاة العيدين",
      "chapter_no": "19",
      "text_ar": "أخبرنا قتيبة، قال حدثنا أبو عوانة، عن سماك، عن جابر بن سمرة، قال رأيت رسول الله صلى الله عليه وسلم يخطب قائما ثم يقعد قعدة لا يتكلم فيها ثم قام فخطب خطبة أخرى فمن خبرك أن النبي صلى الله عليه وسلم خطب قاعدا فلا تصدقه ‏.‏",
      "text_en": " It was narrated that Jabir bin Samurah said:                     \"I saw the Messenger of Allah (ﷺ) delivering the Khutbah standing up, then he sat down for a while and did not speak, then he stood up and delivered another Khutbah. Whoever tells you that the Prophet (ﷺ) delivered a Khutbah sitting do not believe him.\"",
      "chain": [
        "30367",
        "20469",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "1584",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Prayer for the Two 'Eids - كتاب صلاة العيدين",
      "chapter_no": "19",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا عبد الرحمن، قال حدثنا سفيان، عن سماك، عن جابر بن سمرة، قال كان النبي صلى الله عليه وسلم يخطب قائما ثم يجلس ثم يقوم ويقرأ آيات ويذكر الله وكانت خطبته قصدا وصلاته قصدا ‏.‏",
      "text_en": " It was narrated that Jabir bin Samurah said:                     \"The Prophet (ﷺ) used to deliver the Khutbah standing, then he would sit down, then he would stand up and recite some verses and remember Allah (SWT). And his Khutbah was moderate in length, and his prayer was moderate in length.\"",
      "chain": [
        "30160",
        "20033",
        "20012",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "1964",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا إسحاق بن منصور، قال أنبأنا أبو الوليد، قال حدثنا أبو خيثمة، زهير قال حدثنا سماك، عن جابر بن سمرة، أن رجلا، قتل نفسه بمشاقص فقال رسول الله صلى الله عليه وسلم ‏\"‏ أما أنا فلا أصلي عليه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Jabir bin Samurah that:                     a man killed himself with an arrowhead and the Messenger of Allah said: \"As for me, I will not pray for him.\"",
      "chain": [
        "30313",
        "20296",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "2026",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا أبو نعيم، ويحيى بن آدم، قالا حدثنا مالك بن مغول، عن سماك، عن جابر بن سمرة، قال ‏:‏ خرج رسول الله صلى الله عليه وسلم على جنازة أبي الدحداح، فلما رجع أتي بفرس معرورى فركب ومشينا معه ‏.‏",
      "text_en": " It was narrated that Jabir bin Samurah said:                     \"The Messenger of Allah went our to the funeral of Ibn Ad-Dahdah, and when he came back an unsaddled horse was brought to him, so he rode and we walked with him.\"",
      "chain": [
        "38022",
        "20348",
        "20364",
        "20358",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "5114",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا محمد بن المثنى، قال حدثنا أبو داود، قال حدثنا شعبة، عن سماك، قال سمعت جابر بن سمرة، سئل عن شيب، رسول الله صلى الله عليه وسلم قال كان إذا ادهن رأسه لم ير منه وإذا لم يدهن رئي منه ‏.‏",
      "text_en": " It was narrated that Simak said:                     \"I heard Jabir bin Samurah being asked about the gray hairs of the Prophet [SAW]. He said: 'If he put oil on his head they could not be seen, but if he did not put oil on his head, they could be seen.'\"",
      "chain": [
        "30170",
        "30002",
        "20020",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "534",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، حدثنا زائدة، وإسرائيل، عن أشعث بن أبي الشعثاء، عن جعفر بن أبي ثور، عن جابر بن سمرة، قال أمرنا رسول الله  صلى الله عليه وسلم  أن نتوضأ من لحوم الإبل ولا نتوضأ من لحوم الغنم ‏.‏",
      "text_en": " It was narrated that Jabir bin Samurah said:                     \"The Messenger of Allah commanded us to perform ablution after eating camel meat but not to perform ablution after eating the mutton.\"",
      "chain": [
        "30160",
        "20033",
        "20320",
        "20311",
        "11324",
        "10896",
        "393"
      ]
    },
    {
      "hadith_no": "585",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا يحيى بن يوسف الزمي، ح وحدثنا أحمد بن عثمان بن حكيم، حدثنا سليمان بن عبيد الله الرقي، قالا حدثنا عبيد الله بن عمرو، عن عبد الملك بن عمير، عن جابر بن سمرة، قال سأل رجل النبي  صلى الله عليه وسلم  يصلي في الثوب الذي يأتي فيه أهله قال ‏\"‏ نعم إلا أن يرى فيه شيئا فيغسله ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Jabir bin Samurah said:                     \"A man asked the Prophet whether he could perform prayer in a garment in which he had intercourse with his wife. He said: 'Yes, unless he sees something on it, in which case he should wash it.'\"",
      "chain": [
        "11222",
        "30282",
        "30185",
        "30024",
        "11368",
        "393"
      ]
    },
    {
      "hadith_no": "673",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Prayer - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، عن شعبة، عن سماك بن حرب، عن جابر بن سمرة، أن النبي  صلى الله عليه وسلم  كان يصلي الظهر إذا دحضت الشمس ‏.‏",
      "text_en": " It was narrated from Jabir bin Samurah that:                     The Prophet used to pray Zuhr when the sun had passed its zenith.",
      "chain": [
        "30160",
        "20031",
        "20020",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "713",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Adhan and the Sunnah Regarding It - كتاب الأذان والسنة فيها",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا أبو داود، حدثنا شريك، عن سماك بن حرب، عن جابر بن سمرة، قال كان بلال لا يؤخر الأذان عن الوقت وربما أخر الإقامة شيئا ‏.‏",
      "text_en": " It was narrated that Jabir bin Samurah said:                     \"Bilal did not delay the Adhan from its proper time, but he sometimes delayed the Iqamah a little.\"",
      "chain": [
        "30170",
        "30002",
        "20587",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "1045",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، حدثنا الأعمش، عن المسيب بن رافع، عن تميم بن طرفة، عن جابر بن سمرة السوائي، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ ألا تصفون كما تصف الملائكة عند ربها ‏\"‏ ‏.‏ قال قلنا وكيف تصف الملائكة عند ربها قال ‏\"‏ يتمون الصفوف الأول ويتراصون في الصف ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Jabir bin Samurah As-Suwa’i said:                      “The Messenger ofAllah (ﷺ) said: ‘Will you not form your rows as the angels formtheir rows before their Lord?’ We said: ‘How do the angels formtheir rows before their Lord?’ He said: ‘They complete the firstrow and they stand close of one another in the line (leaving no gapsbetween one another).’”",
      "chain": [
        "38409",
        "20032",
        "11060",
        "11394",
        "10894",
        "393"
      ]
    },
    {
      "hadith_no": "1098",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الرحمن، حدثنا سفيان، عن الأعمش، عن المسيب بن رافع، عن تميم بن طرفة، عن جابر بن سمرة، أن النبي  صلى الله عليه وسلم  قال ‏\"‏ لينتهين أقوام يرفعون أبصارهم إلى السماء أو لا ترجع أبصارهم ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Jabir bin Samurah that the Prophet (ﷺ) said:                     “Letthose who lift their gaze to the heavens desist, or their sightwillnot come back.”",
      "chain": [
        "30160",
        "20033",
        "20012",
        "11060",
        "11394",
        "10894",
        "393"
      ]
    },
    {
      "hadith_no": "1159",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن بشار، ومحمد بن الوليد، قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن سماك بن حرب، قال سمعت جابر بن سمرة، يقول كان رسول الله  صلى الله عليه وسلم  يخطب قائما غير أنه كان يقعد قعدة ثم يقوم ‏.‏",
      "text_en": " It wasnarrated that Simak bin Harb said:                      “I heard Jabir bin Samurahsay:‘The Messenger of Allah (ﷺ) used to deliver the sermonstanding,but he used to sit down briefly, then stand up.’”",
      "chain": [
        "30160",
        "30174",
        "20173",
        "20020",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "1160",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، ح وحدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، قالا حدثنا سفيان، عن سماك، عن جابر بن سمرة، قال كان النبي  صلى الله عليه وسلم  يخطب قائما ثم يجلس ثم يقوم فيقرأ آيات ويذكر الله وكانت خطبته قصدا وصلاته قصدا ‏.‏",
      "text_en": " It wasnarrated that Jabir bin Samurah said:                      “The Prophet (ﷺ) usedtodeliver the sermon standing, then he would sit down, then he wouldstand up and recite some Verses and remember Allah. His sermon wasmoderate (i.e., neither too long nor too short).”",
      "chain": [
        "38409",
        "20032",
        "30160",
        "20033",
        "20005",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "1593",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا عبد الله بن عامر بن زرارة، حدثنا شريك بن عبد الله، عن سماك بن حرب، عن جابر بن سمرة، أن رجلا، من أصحاب النبي  صلى الله عليه وسلم  جرح فآذته الجراحة فدب إلى مشاقصه فذبح به نفسه فلم يصل عليه النبي  صلى الله عليه وسلم  ‏.‏ قال وكان ذلك أدبا منه ‏.‏",
      "text_en": " It wasnarrated from Jabir bin Samurah that a man from among theCompanionsof the Prophet (ﷺ) was wounded, and the wound caused hima greatdeal of pain. He went and took a spearhead, and slaughteredhimselfwith it. The Prophet (ﷺ) did not offer the funeral prayerfor him,and that was as an admonition for others.",
      "chain": [
        "30467",
        "20587",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "2363",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Rulings - كتاب الأحكام",
      "chapter_no": "13",
      "text_ar": "حدثنا عبد الله بن الجراح، حدثنا جرير، عن عبد الملك بن عمير، عن جابر بن سمرة، قال خطبنا عمر بن الخطاب بالجابية فقال إن رسول الله صلى الله عليه وسلم قام فينا مثل مقامي فيكم فقال ‏\"‏ احفظوني في أصحابي ثم الذين يلونهم ثم الذين يلونهم ثم يفشو الكذب حتى يشهد الرجل وما يستشهد ويحلف وما يستحلف ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Jabir bin Samurah said:                     'Umar bin Khattab addressed us at Jabiyah and said: “The Messenger of Allah (ﷺ)  stood up among us as I stand among you, and said: 'Honor my Companions for my sake, then those who come after them, then those who come after them. Then lying will prevail until a man will give testimony without being asked to do so, and he will swear an oath without being asked to do so.' ”",
      "chain": [
        "20028",
        "11368",
        "393"
      ]
    },
    {
      "hadith_no": "2654",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا إسماعيل بن موسى، حدثنا شريك، عن سماك بن حرب، عن جابر بن سمرة، أن النبي صلى الله عليه وسلم رجم يهوديا ويهودية ‏.‏",
      "text_en": " It was narrated from Jabir bin Samurah that :                     the Prophet (ﷺ) stoned a Jewish man and a Jewish woman.",
      "chain": [
        "35016",
        "20587",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "4230",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا الحسين بن علي، عن زائدة، عن عبد الملك بن عمير، عن جابر بن سمرة، عن نافع بن عتبة بن أبي وقاص، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ ستقاتلون جزيرة العرب فيفتحها الله ثم تقاتلون الروم فيفتحها الله ثم تقاتلون الدجال فيفتحها الله ‏\"‏ ‏.‏ قال جابر فما يخرج الدجال حتى تفتح الروم ‏.‏",
      "text_en": " It was narrated from Jabir bin Samurah, that Nafi' bin 'Utbah bin AbuWaqqas narrated that the Prophet (ﷺ) said:                      \"You will fight theArabian Peninsula and victory will be granted by Allah. Then you willfight the Romans and victory will be granted (by Allah). Then youwill fight Dajjal and victory will be granted (by Allah).\"Jabir said: \"Dajjal will not appear until you have fought the Romans.\"",
      "chain": [
        "30201",
        "20315",
        "20320",
        "11368",
        "393"
      ]
    }
  ],
  "total_hadiths": 138
}