{
  "id": "394",
  "name": "Samra bin Jundub ( سمرة بن جندب الفزاري ( رضي الله عنه",
  "full_name": "Samra bin Jundub ( سمرة بن جندب الفزاري ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medinah"
    },
    "death": {
      "date_hijri": "59",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Basra/Kufa",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina",
      "Basra",
      "Kufa"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ ع  -  صحابي ]"
    ],
    "tags": [
      "al-Fazari",
      "Ally Ansar",
      "Uhud"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "10",
      "name": "Abu 'Ubaidah ibn al-Jarrah ( أبو عبيدة بن الجراح ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11432",
      "name": "'Abdullah bin Burayda bin al-Husayb عبد الله بن بريدة بن الحصيب الأسلمي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "15166",
      "name": "Zayd bin 'Uqba al-Fzary زيد بن عقبة الفزاري الكوفي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10761",
      "name": "al-Rabi' bin 'Amila الربيع بن عميلة",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "10835",
      "name": "Hilal bin Yasaf هلال بن يساف",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11440",
      "name": "'Imran bin Milhan, Abu Raja' al-Atardi عمران بن ملحان أبو رجاء العطاردي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11196",
      "name": "'Abdur Rahman bin Abi Layla عبد الرحمن بن أبي ليلى",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "10721",
      "name": "al-Mandhar bin Malik bin Qata' المنذر بن مالك بن قطعة - أبو نضرة العبدي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19841",
      "name": "Tha'laba bin 'Aabad ثعلبة بن عباد",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11016",
      "name": "al-Hasan al-Basri الحسن البصري",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "332",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا أحمد بن أبي سريج، قال أخبرنا شبابة، قال أخبرنا شعبة، عن حسين المعلم، عن ابن بريدة، عن سمرة بن جندب، أن امرأة، ماتت في بطن، فصلى عليها النبي صلى الله عليه وسلم فقام وسطها‏.‏",
      "text_en": " Narrated Samura bin Jundub:                     The Prophet offered the funeral prayer for the dead body of a woman who died during delivery (i.e. childbirth) and he stood by the middle of her body.",
      "chain": [
        "30298",
        "20426",
        "20020",
        "11278",
        "11432",
        "394"
      ]
    },
    {
      "hadith_no": "845",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا موسى بن إسماعيل، قال حدثنا جرير بن حازم، قال حدثنا أبو رجاء، عن سمرة بن جندب، قال كان النبي صلى الله عليه وسلم إذا صلى صلاة أقبل علينا بوجهه‏.‏",
      "text_en": " Narrated Samura bin Jundub:                     The Prophet used to face us on completion of the prayer.",
      "chain": [
        "20040",
        "11272",
        "11440",
        "394"
      ]
    },
    {
      "hadith_no": "1143",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا مؤمل بن هشام، قال حدثنا إسماعيل، قال حدثنا عوف، قال حدثنا أبو رجاء، قال حدثنا سمرة بن جندب  رضى الله عنه  عن النبي صلى الله عليه وسلم في الرؤيا قال ‏\"‏ أما الذي يثلغ رأسه بالحجر فإنه يأخذ القرآن فيرفضه وينام عن الصلاة المكتوبة ‏\"‏‏.‏",
      "text_en": " Narrated Samura bin Jundab:                     The Prophet said in his narration of a dream that he saw, \"He whose head was being crushed with a stone was one who learnt the Qur'an but never acted on it, and slept ignoring the compulsory prayers.\"",
      "chain": [
        "30180",
        "20208",
        "11298",
        "11440",
        "394"
      ]
    },
    {
      "hadith_no": "1331",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا مسدد، حدثنا يزيد بن زريع، حدثنا حسين، حدثنا عبد الله بن بريدة، عن سمرة  رضى الله عنه  قال صليت وراء النبي صلى الله عليه وسلم على امرأة ماتت في نفاسها، فقام عليها وسطها‏.‏",
      "text_en": " Narrated Samura bin Jundab:                     I offered the funeral prayer behind the Prophet for a woman who had died during childbirth and he stood up by the middle of the coffin.",
      "chain": [
        "30175",
        "20304",
        "11278",
        "11432",
        "394"
      ]
    },
    {
      "hadith_no": "1332",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا عمران بن ميسرة، حدثنا عبد الوارث، حدثنا حسين، عن ابن بريدة، حدثنا سمرة بن جندب  رضى الله عنه  قال صليت وراء النبي صلى الله عليه وسلم على امرأة ماتت في نفاسها فقام عليها وسطها‏.‏",
      "text_en": " Narrated Samura bin Jundab:                     I offered the funeral prayer behind the Prophet for a woman who had died during childbirth and he stood up by the middle of the coffin.",
      "chain": [
        "30156",
        "20258",
        "11278",
        "11432",
        "394"
      ]
    },
    {
      "hadith_no": "1386",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا جرير بن حازم، حدثنا أبو رجاء، عن سمرة بن جندب، قال كان النبي صلى الله عليه وسلم إذا صلى صلاة أقبل علينا بوجهه فقال ‏\"‏ من رأى منكم الليلة رؤيا ‏\"‏‏.‏ قال فإن رأى أحد قصها، فيقول ما شاء الله، فسألنا يوما، فقال ‏\"‏ هل رأى أحد منكم رؤيا ‏\"‏‏.‏ قلنا لا‏.‏ قال ‏\"‏ لكني رأيت الليلة رجلين أتياني فأخذا بيدي، فأخرجاني إلى الأرض المقدسة، فإذا رجل جالس، ورجل قائم بيده كلوب من حديد  قال بعض أصحابنا عن موسى إنه  يدخل ذلك الكلوب في شدقه، حتى يبلغ قفاه، ثم يفعل بشدقه الآخر مثل ذلك، ويلتئم شدقه هذا، فيعود فيصنع مثله‏.‏ قلت ما هذا قالا انطلق‏.‏ فانطلقنا حتى أتينا على رجل مضطجع على قفاه، ورجل قائم على رأسه بفهر أو صخرة، فيشدخ به رأسه، فإذا ضربه تدهده الحجر، فانطلق إليه ليأخذه، فلا يرجع إلى هذا حتى يلتئم رأسه، وعاد رأسه كما هو، فعاد إليه فضربه، قلت من هذا قالا انطلق‏.‏ فانطلقنا إلى ثقب مثل التنور، أعلاه ضيق وأسفله واسع، يتوقد تحته نارا، فإذا اقترب ارتفعوا حتى كاد أن يخرجوا، فإذا خمدت رجعوا فيها، وفيها رجال ونساء عراة‏.‏ فقلت من هذا قالا انطلق‏.‏ فانطلقنا حتى أتينا على نهر من دم، فيه رجل قائم على وسط النهر رجل بين يديه حجارة، فأقبل الرجل الذي في النهر، فإذا أراد أن يخرج رمى الرجل بحجر في فيه، فرده حيث كان، فجعل كلما جاء ليخرج رمى في فيه بحجر، فيرجع كما كان‏.‏ فقلت ما هذا قالا انطلق‏.‏ فانطلقنا حتى انتهينا إلى روضة خضراء، فيها شجرة عظيمة، وفي أصلها شيخ وصبيان، وإذا رجل قريب من الشجرة بين يديه نار يوقدها، فصعدا بي في الشجرة، وأدخلاني دارا لم أر قط أحسن منها، فيها رجال شيوخ وشباب، ونساء وصبيان، ثم أخرجاني منها فصعدا بي الشجرة فأدخلاني دارا هي أحسن وأفضل، فيها شيوخ وشباب‏.‏ قلت طوفتماني الليلة، فأخبراني عما رأيت‏.‏ قالا نعم، أما الذي رأيته يشق شدقه فكذاب يحدث بالكذبة، فتحمل عنه حتى تبلغ الآفاق، فيصنع به إلى يوم القيامة‏.‏ والذي رأيته يشدخ رأسه فرجل علمه الله القرآن، فنام عنه بالليل، ولم يعمل فيه بالنهار، يفعل به إلى يوم القيامة‏.‏ والذي رأيته في الثقب فهم الزناة‏.‏ والذي رأيته في النهر آكلو الربا‏.‏ والشيخ في أصل الشجرة إبراهيم  عليه السلام  والصبيان حوله فأولاد الناس، والذي يوقد النار مالك خازن النار‏.‏ والدار الأولى التي دخلت دار عامة المؤمنين، وأما هذه الدار فدار الشهداء، وأنا جبريل، وهذا ميكائيل، فارفع رأسك، فرفعت رأسي فإذا فوقي مثل السحاب‏.‏ قالا ذاك منزلك‏.‏ قلت دعاني أدخل منزلي‏.‏ قالا إنه بقي لك عمر لم تستكمله، فلو استكملت أتيت منزلك ‏\"‏‏.‏",
      "text_en": " Narrated Samura bin Jundab:                     Whenever the Prophet finished the (morning) prayer, he would face us and ask, \"Who amongst you had a dream last night?\" So if anyone had seen a dream he would narrate it. The Prophet would say: \"Ma sha'a-llah\" (An Arabic maxim meaning literally, 'What Allah wished,' and it indicates a good omen.) One day, he asked us whether anyone of us had seen a dream. We replied in the negative. The Prophet said, \"But I had seen (a dream) last night that two men came to me, caught hold of my hands, and took me to the Sacred Land (Jerusalem). There, I saw a person sitting and another standing with an iron hook in his hand pushing it inside the mouth of the former till it reached the jawbone, and then tore off one side of his cheek, and then did the same with the other side; in the meantime the first side of his cheek became normal again and then he repeated the same operation again. I said, 'What is this?' They told me to proceed on and we went on till we came to a man Lying flat on his back, and another man standing at his head carrying a stone or a piece of rock, and crushing the head of the Lying man, with that stone. Whenever he struck him, the stone rolled away. The man went to pick it up and by the time he returned to him, the crushed head had returned to its normal state and the man came back and struck him again (and so on). I said, 'Who is this?' They told me to proceed on; so we proceeded on and passed by a hole like an oven; with a narrow top and wide bottom, and the fire was kindling underneath that hole. Whenever the fire-flame went up, the people were lifted up to such an extent that they about to get out of it, and whenever the fire got quieter, the people went down into it, and there were naked men and women in it. I said, 'Who is this?' They told me to proceed on. So we proceeded on till we reached a river of blood and a man was in it, and another man was standing at its bank with stones in front of him, facing the man standing in the river. Whenever the man in the river wanted to come out, the other one threw a stone in his mouth and caused him to retreat to his original position; and so whenever he wanted to come out the other would throw a stone in his mouth, and he would retreat to his original position. I asked, 'What is this?' They told me to proceed on and we did so till we reached a well-flourished green garden having a huge tree and near its root was sitting an old man with some children. (I saw) Another man near the tree with fire in front of him and he was kindling it up. Then they (i.e. my two companions) made me climb up the tree and made me enter a house, better than which I have ever seen. In it were some old men and young men, women and children. Then they took me out of this house and made me climb up the tree and made me enter another house that was better and superior (to the first) containing old and young people. I said to them (i.e. my two companions), 'You have made me ramble all the night. Tell me all about that I have seen.' They said, 'Yes. As for the one whose cheek you saw being torn away, he was a liar and he used to tell lies, and the people would report those lies on his authority till they spread all over the world. So, he will be punished like that till the Day of Resurrection. The one whose head you saw being crushed is the one whom Allah had given the knowledge of Qur'an (i.e. knowing it by heart) but he used to sleep at night (i.e. he did not recite it then) and did not use to act upon it (i.e. upon its orders etc.) by day; and so this punishment will go on till the Day of Resurrection. And those you saw in the hole (like oven) were adulterers (those men and women who commit illegal sexual intercourse). And those you saw in the river of blood were those dealing in Riba (usury). And the old man who was sitting at the base of the tree was Abraham and the little children around him were the offspring of the people. And the one who was kindling the fire was Malik, the gatekeeper of the Hell-fire. And the first house in which you have gone was the house of the common believers, and the second house was of the martyrs. I am Gabriel and this is Michael. Raise your head.' I raised my head and saw a thing like a cloud over me. They said, 'That is your place.' I said, 'Let me enter my place.' They said, 'You still have some life which you have not yet completed, and when you complete (that remaining portion of your life) you will then enter your place.' \"",
      "chain": [
        "20040",
        "11272",
        "11440",
        "394"
      ]
    },
    {
      "hadith_no": "2085",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا جرير بن حازم، حدثنا أبو رجاء، عن سمرة بن جندب  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ رأيت الليلة رجلين أتياني، فأخرجاني إلى أرض مقدسة، فانطلقنا حتى أتينا على نهر من دم فيه رجل قائم، وعلى وسط النهر رجل بين يديه حجارة، فأقبل الرجل الذي في النهر فإذا أراد الرجل أن يخرج رمى الرجل بحجر في فيه فرده حيث كان، فجعل كلما جاء ليخرج رمى في فيه بحجر، فيرجع كما كان، فقلت ما هذا فقال الذي رأيته في النهر آكل الربا ‏\"‏‏.‏",
      "text_en": " Narrated Samura bin Jundab:                     The Prophet said, \"This night I dreamt that two men came and took me to a Holy land whence we proceeded on till we reached a river of blood, where a man was standing, and on its bank was standing another man with stones in his hands. The man in the middle of the river tried to come out, but the other threw a stone in his mouth and forced him to go back to his original place. So, whenever he tried to come out, the other man would throw a stone in his mouth and force him to go back to his former place. I asked, 'Who is this?' I was told, 'The person in the river was a Riba-eater.\"",
      "chain": [
        "20040",
        "11272",
        "11440",
        "394"
      ]
    },
    {
      "hadith_no": "2791",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا موسى، حدثنا جرير، حدثنا أبو رجاء، عن سمرة، قال النبي صلى الله عليه وسلم ‏\"‏ رأيت الليلة رجلين أتياني فصعدا بي الشجرة، فأدخلاني دارا هي أحسن وأفضل، لم أر قط أحسن منها قالا أما هذه الدار فدار الشهداء ‏\"‏‏.‏",
      "text_en": " Narrated Samura:                     The Prophet said, \"Last night two men came to me (in a dream) and made me ascend a tree and then admitted me into a better and superior house, better of which I have never seen. One of them said, 'This house is the house of martyrs.\"",
      "chain": [
        "20040",
        "20028",
        "11440",
        "394"
      ]
    },
    {
      "hadith_no": "3236",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا موسى، حدثنا جرير، حدثنا أبو رجاء، عن سمرة، قال قال النبي صلى الله عليه وسلم ‏\"‏ رأيت الليلة رجلين أتياني قالا الذي يوقد النار مالك خازن النار، وأنا جبريل، وهذا ميكائيل ‏\"‏‏.‏",
      "text_en": " Narrated Samura:                     The Prophet said, \"Last night I saw (in a dream) two men coming to me. One of them said, \"The person who kindles the fire is Malik, the gate-keeper of the (Hell) Fire, and I am Gabriel, and this is Michael.\"",
      "chain": [
        "20040",
        "20028",
        "11440",
        "394"
      ]
    },
    {
      "hadith_no": "3354",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا مؤمل، حدثنا إسماعيل، حدثنا عوف، حدثنا أبو رجاء، حدثنا سمرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أتاني الليلة آتيان، فأتينا على رجل طويل، لا أكاد أرى رأسه طولا، وإنه إبراهيم صلى الله عليه وسلم ‏\"‏‏.‏",
      "text_en": " Narrated Samura:                     Allah's Apostle said, \"Two persons came to me at night (in dream) (and took me along with them). We passed by a tall man who was so tall that I was not able to see his head and that person was Abraham.\"",
      "chain": [
        "30180",
        "20208",
        "11298",
        "11440",
        "394"
      ]
    },
    {
      "hadith_no": "4720",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا مؤمل  هو ابن هشام  حدثنا إسماعيل بن إبراهيم، وحدثنا عوف، حدثنا أبو رجاء، حدثنا سمرة بن جندب  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم لنا ‏\"‏ أتاني الليلة آتيان فابتعثاني، فانتهينا إلى مدينة مبنية بلبن ذهب ولبن فضة، فتلقانا رجال شطر من خلقهم كأحسن ما أنت راء، وشطر كأقبح ما أنت راء قالا لهم اذهبوا فقعوا في ذلك النهر‏.‏ فوقعوا فيه ثم رجعوا إلينا قد ذهب ذلك السوء عنهم، فصاروا في أحسن صورة قالا لي هذه جنة عدن، وهذاك منزلك قالا أما القوم الذين كانوا شطر منهم حسن وشطر منهم قبيح فإنهم خلطوا عملا صالحا وآخر سيئا تجاوز الله عنهم ‏\"‏‏.‏",
      "text_en": " Narrated Samura bin Jundab:                     Allah's Apostle said, \"Tonight two (visitors) came to me (in my dream) and took me to a town built with gold bricks and silver bricks. There we met men who, half of their bodies, look like the mosthandsome human beings you have ever seen, and the other half, the ugliest human beings you have ever seen. Those two visitors said to those men, 'Go and dip yourselves in that river. So they dipped themselves therein and then came to us, their ugliness having disappeared and they were in the mosthandsome shape. The visitors said, 'The first is the Garden of Eden and that is your dwelling place.' Then they added, 'As for those people who were half ugly and half handsome, they were those who mixed good deeds and bad deeds, but Allah forgave them.\"",
      "chain": [
        "30180",
        "20208",
        "11298",
        "11440",
        "394"
      ]
    },
    {
      "hadith_no": "6163",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا جرير، حدثنا أبو رجاء، عن سمرة بن جندب  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ رأيت رجلين أتياني قالا الذي رأيته يشق شدقه فكذاب يكذب بالكذبة تحمل عنه حتى تبلغ الآفاق فيصنع به إلى يوم القيامة ‏\"‏‏.‏",
      "text_en": " Narrated Samura bin Jundub:                     The Prophet said, \"I saw (in a dream), two men came to me.\" Then the Prophet narrated the story (saying), \"They said, 'The person, the one whose cheek you saw being torn away (from the mouth to the ear) was a liar and used to tell lies and the people would report those lies on his authority till they spread all over the world. So he will be punished like that till the Day of Resurrection.\"'",
      "chain": [
        "20040",
        "20028",
        "11440",
        "394"
      ]
    },
    {
      "hadith_no": "7134",
      "source": " Sahih Bukhari ",
      "chapter": "Interpretation of Dreams - كتاب التعبير",
      "chapter_no": "92",
      "text_ar": "حدثني مؤمل بن هشام أبو هشام، حدثنا إسماعيل بن إبراهيم، حدثنا عوف، حدثنا أبو رجاء، حدثنا سمرة بن جندب  رضى الله عنه  قال كان رسول الله صلى الله عليه وسلم مما يكثر أن يقول لأصحابه ‏\"‏ هل رأى أحد منكم من رؤيا ‏\"‏‏.‏ قال فيقص عليه من شاء الله أن يقص، وإنه قال ذات غداة ‏\"‏ إنه أتاني الليلة آتيان، وإنهما ابتعثاني، وإنهما قالا لي انطلق‏.‏ وإني انطلقت معهما، وإنا أتينا على رجل مضطجع، وإذا آخر قائم عليه بصخرة، وإذا هو يهوي بالصخرة لرأسه، فيثلغ رأسه فيتهدهد الحجر ها هنا، فيتبع الحجر فيأخذه، فلا يرجع إليه حتى يصح رأسه كما كان، ثم يعود عليه، فيفعل به مثل ما فعل المرة الأولى‏.‏ قال قلت لهما سبحان الله ما هذان قال قالا لي انطلق  قال  فانطلقنا فأتينا على رجل مستلق لقفاه، وإذا آخر قائم عليه بكلوب من حديد، وإذا هو يأتي أحد شقى وجهه فيشرشر شدقه إلى قفاه، ومنخره إلى قفاه وعينه إلى قفاه  قال وربما قال أبو رجاء فيشق  قال ثم يتحول إلى الجانب الآخر، فيفعل به مثل ما فعل بالجانب الأول، فما يفرغ من ذلك الجانب حتى يصح ذلك الجانب كما كان، ثم يعود عليه فيفعل مثل ما فعل المرة الأولى‏.‏ قال قلت سبحان الله ما هذان قال قالا لي انطلق‏.‏ فانطلقنا فأتينا على مثل التنور  قال فأحسب أنه كان يقول  فإذا فيه لغط وأصوات  قال  فاطلعنا فيه، فإذا فيه رجال ونساء عراة، وإذا هم يأتيهم لهب من أسفل منهم، فإذا أتاهم ذلك اللهب ضوضوا  قال  قلت لهما ما هؤلاء قال قالا لي انطلق انطلق‏.‏ قال فانطلقنا فأتينا على نهر  حسبت أنه كان يقول  أحمر مثل الدم، وإذا في النهر رجل سابح يسبح، وإذا على شط النهر رجل قد جمع عنده حجارة كثيرة، وإذا ذلك السابح يسبح ما يسبح، ثم يأتي ذلك الذي قد جمع عنده الحجارة فيفغر له فاه فيلقمه حجرا فينطلق يسبح، ثم يرجع إليه، كلما رجع إليه فغر له فاه فألقمه حجرا  قال  قلت لهما ما هذان قال قالا لي انطلق انطلق‏.‏ قال فانطلقنا فأتينا على رجل كريه المرآة كأكره ما أنت راء رجلا مرآة، وإذا عنده نار يحشها ويسعى حولها  قال  قلت لهما ما هذا قال قالا لي انطلق انطلق‏.‏ فانطلقنا فأتينا على روضة معتمة فيها من كل نور الربيع، وإذا بين ظهرى الروضة رجل طويل لا أكاد أرى رأسه طولا في السماء، وإذا حول الرجل من أكثر ولدان رأيتهم قط  قال  قلت لهما ما هذا ما هؤلاء قال قالا لي انطلق انطلق‏.‏  قال  فانطلقنا فانتهينا إلى روضة عظيمة لم أر روضة قط أعظم منها ولا أحسن‏.‏  قال  قالا لي ارق فيها‏.‏ قال فارتقينا فيها فانتهينا إلى مدينة مبنية بلبن ذهب ولبن فضة، فأتينا باب المدينة فاستفتحنا ففتح لنا، فدخلناها فتلقانا فيها رجال شطر من خلقهم كأحسن ما أنت راء، وشطر كأقبح ما أنت راء  قال  قالا لهم اذهبوا فقعوا في ذلك النهر‏.‏ قال وإذا نهر معترض يجري كأن ماءه المحض في البياض، فذهبوا فوقعوا فيه، ثم رجعوا إلينا قد ذهب ذلك السوء عنهم، فصاروا في أحسن صورة  قال  قالا لي هذه جنة عدن، وهذاك منزلك‏.‏ قال فسما بصري صعدا، فإذا قصر مثل الربابة البيضاء  قال  قالا هذاك منزلك‏.‏ قال قلت لهما بارك الله فيكما، ذراني فأدخله‏.‏ قالا أما الآن فلا وأنت داخله‏.‏ قال قلت لهما فإني قد رأيت منذ الليلة عجبا، فما هذا الذي رأيت قال قالا لي أما إنا سنخبرك، أما الرجل الأول الذي أتيت عليه يثلغ رأسه بالحجر، فإنه الرجل يأخذ القرآن فيرفضه وينام عن الصلاة المكتوبة، وأما الرجل الذي أتيت عليه يشرشر شدقه إلى قفاه، ومنخره إلى قفاه، وعينه إلى قفاه، فإنه الرجل يغدو من بيته فيكذب الكذبة تبلغ الآفاق، وأما الرجال والنساء العراة الذين في مثل بناء التنور فإنهم الزناة والزواني‏.‏ وأما الرجل الذي أتيت عليه يسبح في النهر ويلقم الحجر، فإنه آكل الربا، وأما الرجل الكريه المرآة الذي عند النار يحشها ويسعى حولها، فإنه مالك خازن جهنم، وأما الرجل الطويل الذي في الروضة فإنه إبراهيم صلى الله عليه وسلم وأما الولدان الذين حوله فكل مولود مات على الفطرة ‏\"‏‏.‏ قال فقال بعض المسلمين يا رسول الله وأولاد المشركين فقال رسول الله صلى الله عليه وسلم ‏\"‏ وأولاد المشركين‏.‏ وأما القوم الذين كانوا شطر منهم حسنا وشطر منهم قبيحا، فإنهم قوم خلطوا عملا صالحا وآخر سيئا، تجاوز الله عنهم ‏\"‏‏.‏",
      "text_en": " Narrated Samura bin Jundub:                     Allah's Apostle very often used to ask his companions, \"Did anyone of you see a dream?\" So dreams would be narrated to him by those whom Allah wished to tell. One morning the Prophet said, \"Last night two persons came to me (in a dream) and woke me up and said to me, 'Proceed!' I set out with them and we came across a man Lying down, and behold, another man was standing over his head, holding a big rock. Behold, he was throwing the rock at the man's head, injuring it. The rock rolled away and the thrower followed it and took it back. By the time he reached the man, his head returned to the normal state. The thrower then did the same as he had done before. I said to my two companions, 'Subhan Allah! Who are these two persons?' They said, 'Proceed!' So we proceeded and came to a man Lying flat on his back and another man standing over his head with an iron hook, and behold, he would put the hook in one side of the man's mouth and tear off that side of his face to the back (of the neck) and similarly tear his nose from front to back and his eye from front to back. Then he turned to the other side of the man's face and did just as he had done with the other side. He hardly completed this side when the other side returned to its normal state. Then he returned to it to repeat what he had done before. I said to my two companions, 'Subhan Allah! Who are these two persons?' They said to me, 'Proceed!' So we proceeded and came across something like a Tannur (a kind of baking oven, a pit usually clay-lined for baking bread).\" I think the Prophet said, \"In that oven t here was much noise and voices.\" The Prophet added, \"We looked into it and found naked men and women, and behold, a flame of fire was reaching to them from underneath, and when it reached them, they cried loudly. I asked them, 'Who are these?' They said to me, 'Proceed!' And so we proceeded and came across a river.\" I think he said, \".... red like blood.\" The Prophet added, \"And behold, in the river there was a man swimming, and on the bank there was a man who had collected many stones. Behold. while the other man was swimming, he went near him. The former opened his mouth and the latter (on the bank) threw a stone into his mouth whereupon he went swimming again. He returned and every time the performance was repeated. I asked my two companions, 'Who are these (two) persons?' They replied, 'Proceed! Proceed!' And we proceeded till we came to a man with a repulsive appearance, the most repulsive appearance, you ever saw a man having! Beside him there was a fire and he was kindling it and running around it. I asked my companions, 'Who is this (man)?' They said to me, 'Proceed! Proceed!' So we proceeded till we reached a garden of deep green dense vegetation, having all sorts of spring colors. In the midst of the garden there was a very tall man and I could hardly see his head because of his great height, and around him there were children in such a large number as I have never seen. I said to my companions, 'Who is this?' They replied, 'Proceed! Proceed!' So we proceeded till we came to a majestic huge garden, greater and better than I have ever seen! My two companions said to me, 'Go up and I went up' The Prophet added, \"So we ascended till we reached a city built of gold and silver bricks and we went to its gate and asked (the gatekeeper) to open the gate, and it was opened and we entered the city and found in it, men with one side of their bodies as handsome as the handsomest person you have ever seen, and the other side as ugly as the ugliest person you have ever seen. My two companions ordered those men to throw themselves into the river. Behold, there was a river flowing across (the city), and its water was like milk in whiteness. Those men went and threw themselves in it and then returned to us after the ugliness (of their bodies) had disappeared and they became in the best shape.\" The Prophet further added, \"My two companions (angels) said to me, 'This place is the Eden Paradise, and that is your place.' I raised up my sight, and behold, there I saw a palace like a white cloud! My two companions said to me, 'That (palace) is your place.' I said to them, 'May Allah bless you both! Let me enter it.' They replied, 'As for now, you will not enter it, but you shall enter it (one day) I said to them, 'I have seen many wonders tonight. What does all that mean which I have seen?' They replied, 'We will inform you: As for the first man you came upon whose head was being injured with the rock, he is the symbol of the one who studies the Qur'an and then neither recites it nor acts on its orders, and sleeps, neglecting the enjoined prayers. As for the man you came upon whose sides of mouth, nostrils and eyes were torn off from front to back, he is the symbol of the man who goes out of his house in the morning and tells so many lies that it spreads all over the world. And those naked men and women whom you saw in a construction resembling an oven, they are the adulterers and the adulteresses. And the man whom you saw swimming in the river and given a stone to swallow, is the eater of usury (Riba). aand the bad looking man whom you saw near the fire kindling it and going round it, is Malik, the gatekeeper of Hell. And the tall man whom you saw in the garden, is Abraham and the children around him are those children who die with Al-Fitra (the Islamic Faith). The narrator added: Some Muslims asked the Prophet, \"O Allah's Apostle! What about the children of pagans?\" The Prophet replied, \"And also the children of pagans.\" The Prophet added, \"My two companions added, 'The men you saw half handsome and half ugly were those persons who had mixed an act that was good with another that was bad, but Allah forgave them.'\"",
      "chain": [
        "30180",
        "20208",
        "11298",
        "11440",
        "394"
      ]
    },
    {
      "hadith_no": "1",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "‏\"‏ من حدث عني، بحديث يرى أنه كذب فهو أحد الكاذبين ‏\"‏ ‏.‏ حدثنا أبو بكر بن أبي شيبة حدثنا وكيع عن شعبة عن الحكم عن عبد الرحمن بن أبي ليلى عن سمرة بن جندب ‏.‏ ح وحدثنا أبو بكر بن أبي شيبة أيضا حدثنا وكيع عن شعبة وسفيان عن حبيب عن ميمون بن أبي شبيب عن المغيرة بن شعبة قالا قال رسول الله صلى الله عليه وسلم ذلك ‏.‏",
      "text_en": "",
      "chain": [
        "30201",
        "20032",
        "20020",
        "11069",
        "11196",
        "394",
        "20032",
        "11276"
      ]
    },
    {
      "hadith_no": "2279",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثنا يحيى بن يحيى التميمي، أخبرنا عبد الوارث بن سعيد، عن حسين بن، ذكوان قال حدثني عبد الله بن بريدة، عن سمرة بن جندب، قال صليت خلف النبي صلى الله عليه وسلم وصلى على أم كعب ماتت وهي نفساء فقام رسول الله صلى الله عليه وسلم للصلاة عليها وسطها ‏.‏",
      "text_en": " Samura b. Jundub said:                      I prayed behind the Messenger of Allah (may peace be upon him) and he prayed for a woman who had died in the state of delivery. He stood in front of her waist.",
      "chain": [
        "30399",
        "20258",
        "11278",
        "11432",
        "394"
      ]
    },
    {
      "hadith_no": "2596",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا عبد الوارث، عن عبد الله بن سوادة القشيري، حدثني والدي، أنه سمع سمرة بن جندب، يقول سمعت محمدا، صلى الله عليه وسلم يقول",
      "text_en": " Samura b. Jandub reported Muhammad (may peace be upon him) as saying. The call of Bilal may not mislead any one of you (and he may, under the wrong impression gathered from it, refrain) from taking meal before the commencement of the fast (for the streaks) of this whiteness (which are vertical indicate the false dawn and the true dawn with which the fast commences is that when the streaks of light are) spread.",
      "chain": [
        "20656",
        "20258",
        "10930",
        "394"
      ]
    },
    {
      "hadith_no": "2597",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا زهير بن حرب، حدثنا إسماعيل ابن علية، حدثني عبد الله بن سوادة، عن أبيه، عن سمرة بن جندب، - رضى الله عنه - قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يغرنكم أذان بلال ولا هذا البياض - لعمود الصبح - حتى يستطير هكذا ‏\"‏‏.‏",
      "text_en": " Samura b. Jundub reported Allah's Messenger (may peace be upon him) as saying:                      The Adhan of Bilal should not mislead you nor the whiteness (of the pillar) of dawn, for it is not the whiteness of the true dawn, but that of the false dawn which is vertical like a pillar and you can eat food till the streaks of whiteness spread like it.",
      "chain": [
        "30022",
        "20208",
        "10930",
        "394"
      ]
    },
    {
      "hadith_no": "2598",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثني أبو الربيع الزهراني، حدثنا حماد، - يعني ابن زيد - حدثنا عبد الله، بن سوادة القشيري عن أبيه، عن سمرة بن جندب، - رضى الله عنه - قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يغرنكم من سحوركم أذان بلال ولا بياض الأفق المستطيل هكذا حتى يستطير هكذا ‏\"‏ ‏.‏ وحكاه حماد بيديه قال يعني معترضا ‏.‏",
      "text_en": " Samura b. Jundub (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      The Adhan of Bilal may not mislead you with regard to your food at the commencement of the fast, nor the vertical (streaks) of whiteness in the horizon (for it is an indication of false dawn). You should stop eating (food) till (the whiteness) spreads like it. Hammad narrated it and with the gesture of his band he explained, the horizontal position (of the streaks of light).",
      "chain": [
        "30137",
        "20022",
        "10930",
        "394"
      ]
    },
    {
      "hadith_no": "2599",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن سوادة، قال سمعت سمرة، بن جندب - رضى الله عنه - وهو يخطب يحدث عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ لا يغرنكم نداء بلال ولا هذا البياض حتى يبدو الفجر - أو قال - حتى ينفجر الفجر ‏\"‏ ‏.‏",
      "text_en": " Samura b. Jundub addressed and narrated from the Apostle of Allah (may peace be upon him) having said (these words):                      Neither the call of Bilal should mislead you nor this whiteness (of false dawn) till (the true) dawn appears (or he said) till the dawn breaks.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "394"
      ]
    },
    {
      "hadith_no": "2600",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثناه ابن المثنى، حدثنا أبو داود، أخبرنا شعبة، أخبرني سوادة بن حنظلة، القشيري قال سمعت سمرة بن جندب، - رضى الله عنه - يقول قال رسول الله صلى الله عليه وسلم ‏.‏ فذكر هذا ‏.‏",
      "text_en": " A hadith like this has been narrated on the authority of Samura b. Jundub.",
      "chain": [
        "30002",
        "20020",
        "10687",
        "394"
      ]
    },
    {
      "hadith_no": "5722",
      "source": " Sahih Muslim ",
      "chapter": "The Book on General Behaviour - كتاب الآداب",
      "chapter_no": "39",
      "text_ar": "حدثنا يحيى بن يحيى، وأبو بكر بن أبي شيبة قال أبو بكر حدثنا معتمر بن، سليمان عن الركين، عن أبيه، عن سمرة، وقال، يحيى أخبرنا المعتمر بن سليمان، قال سمعت  الركين، يحدث عن أبيه، عن سمرة بن جندب، قال نهانا رسول الله صلى الله عليه وسلم أن نسمي رقيقنا بأربعة أسماء أفلح ورباح ويسار ونافع ‏.‏",
      "text_en": " Samura b. Jundub reported:                      Allah's Messenger (may peace be upon him) forbade us to give names to our servants as these four names: Aflah (Successful), Rabdh (Profit), Yasar (Wealth), and Nafi' (Beneficial).",
      "chain": [
        "30399",
        "30201",
        "20436",
        "20288",
        "11289",
        "394",
        "20031",
        "20288",
        "11289",
        "394"
      ]
    },
    {
      "hadith_no": "5723",
      "source": " Sahih Muslim ",
      "chapter": "The Book on General Behaviour - كتاب الآداب",
      "chapter_no": "39",
      "text_ar": "وحدثنا قتيبة بن سعيد، حدثنا جرير، عن الركين بن الربيع، عن أبيه، عن سمرة، بن جندب قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تسم غلامك رباحا ولا يسارا ولا أفلح ولا نافعا ‏\"‏ ‏.‏",
      "text_en": " Samura b. Jundub reported AUah's Messenger (may peace be upon him) as saying:                      Don't give names to your servants as Rabdh, 'Ya ar, Aflah and Nafi'.",
      "chain": [
        "30367",
        "20028",
        "10763",
        "10761",
        "394"
      ]
    },
    {
      "hadith_no": "5724",
      "source": " Sahih Muslim ",
      "chapter": "The Book on General Behaviour - كتاب الآداب",
      "chapter_no": "39",
      "text_ar": "حدثنا أحمد بن عبد الله بن يونس، حدثنا زهير، حدثنا منصور، عن هلال بن يساف، عن ربيع بن عميلة، عن سمرة بن جندب، قال قال رسول الله صلى الله عليه وسلم ‏\"أحب الكلام إلى الله أربع سبحان الله والحمد لله ولا إله إلا الله والله أكبر‏.‏ لا يضرك بأيهن بدأت.‏ ولا تسمين غلامك يسارا ولا رباحا ولا نجيحا ولا أفلح فإنك تقول أثم هو فلا يكون فيقول لا‏.\"‏‏ إنما هن أربع فلا تزيدن على ‏.‏",
      "text_en": " Samura b. Jundub reported:                      The Messenger of Allah (peace and blessings of Allah be upon him) said \"The dearest phrases to Allah are four: Subhan Allah (Hallowed be Allah), Al-Hamdulillah (Praise be to Allah), La ilaha illa-Allah (There is no deity but Allah), Allahu Akbar (Allah is Greater). There is no harm for you in which of them begin with (while remembering Allah). And do not give these names to your servants: Yasar and Rabah and Najih and Aflah.",
      "chain": [
        "30184",
        "20321",
        "11067",
        "10835",
        "394"
      ]
    },
    {
      "hadith_no": "6076",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Vision - كتاب الرؤيا",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن بشار، حدثنا وهب بن جرير، حدثنا أبي، عن أبي رجاء العطاردي، عن سمرة بن جندب، قال كان النبي صلى الله عليه وسلم إذا صلى الصبح أقبل عليهم بوجهه فقال ‏\"‏ هل رأى أحد منكم البارحة رؤيا ‏\"‏ ‏.‏",
      "text_en": " Samura b. Jundab reported that when Allah's Messenger (may peace be upon him) had performed his dawn prayer he turned his face towards them (that is towards his Companions) and said:                      Did any one of you see any vision last night?",
      "chain": [
        "30160",
        "20298",
        "11272",
        "11440",
        "394"
      ]
    },
    {
      "hadith_no": "7348",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يونس بن محمد، حدثنا شيبان بن عبد الرحمن، قال قال قتادة سمعت أبا نضرة، يحدث عن سمرة، أنه سمع نبي الله صلى الله عليه وسلم يقول ‏\"‏ إن منهم من تأخذه النار إلى كعبيه ومنهم من تأخذه إلى حجزته ومنهم من تأخذه إلى عنقه ‏\"‏ ‏.‏",
      "text_en": " Samura b. Jundub reported Allah's Apostle (may peace -be upon him) as saying:                      There will be some to whose ankels the fire will reach, some to whose knees, some to whose waist the fire will reach, and some to whose collar-bone the fire will reach.",
      "chain": [
        "30201",
        "20393",
        "20240",
        "11019",
        "10721",
        "394"
      ]
    },
    {
      "hadith_no": "7349",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "حدثني عمرو بن زرارة، أخبرنا عبد الوهاب، - يعني ابن عطاء - عن سعيد، عن قتادة، قال سمعت أبا نضرة، يحدث عن سمرة بن جندب، أن النبي صلى الله عليه وسلم قال ‏\"‏ منهم من تأخذه النار إلى كعبيه ومنهم من تأخذه النار إلى ركبتيه ومنهم من تأخذه النار إلى حجزته ومنهم من تأخذه النار إلى ترقوته ‏\"‏ ‏.‏",
      "text_en": " Samura b. Jundub reported Allah's Messenger (may peace be upon him) as saying:                      There would be among them those to whom the fire will reach up to their ankels and to some of them the fire would reach their knees and to some it would reach their waists and to some it would reach up to their collar-bones.",
      "chain": [
        "30365",
        "20557",
        "11168",
        "11019",
        "10721",
        "394"
      ]
    },
    {
      "hadith_no": "354",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو الوليد الطيالسي، حدثنا همام، عن قتادة، عن الحسن، عن سمرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من توضأ يوم الجمعة فبها ونعمت ومن اغتسل فهو أفضل ‏\"‏ ‏.‏",
      "text_en": " Narrated Samurah:                     If any one of you performs ablution (on Friday) that is all right; and if any of you takes a bath, that is better.",
      "chain": [
        "20296",
        "20297",
        "11019",
        "11016",
        "394"
      ]
    },
    {
      "hadith_no": "778",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن خلاد، حدثنا خالد بن الحارث، عن أشعث، عن الحسن، عن سمرة بن جندب، عن النبي صلى الله عليه وسلم أنه كان يسكت سكتتين إذا استفتح وإذا فرغ من القراءة كلها ‏.‏ فذكر معنى حديث يونس ‏.‏",
      "text_en": " Samurah b. Jundub said:                      The Prophet(ﷺ) had two periods of silence; when he began his prayer and when he finished the recitation (of the Qur’an). He then narrated the tradition like the version of Yunus.",
      "chain": [
        "30357",
        "20226",
        "11324",
        "11016",
        "394"
      ]
    },
    {
      "hadith_no": "779",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، حدثنا يزيد، حدثنا سعيد، حدثنا قتادة، عن الحسن، أن سمرة بن جندب، وعمران بن حصين، تذاكرا فحدث سمرة بن جندب، أنه حفظ عن رسول الله صلى الله عليه وسلم سكتتين سكتة إذا كبر وسكتة إذا فرغ من قراءة ‏{‏ غير المغضوب عليهم ولا الضالين ‏}‏ فحفظ ذلك سمرة وأنكر عليه عمران بن حصين فكتبا في ذلك إلى أبى بن كعب وكان في كتابه إليهما أو في رده عليهما أن سمرة قد حفظ ‏.‏",
      "text_en": " Narrated Samurah ibn Jundub; Ubayy ibn Ka'b:                     Samurah ibn Jundub and Imran ibn Husayn had a discussion (about the periods of silence in prayer). Samurah then said that he remembered two periods of silence from the Messenger of Allah (ﷺ); one when he uttered the takbir and the other when he finished reciting: \"Not of those with whom Thou art angry, nor of those who go astray\" (i.7). Samurah remembered that, but Imran ibn Husayn rejected it. Then they wrote about it to Ubayy ibn Ka'b. He wrote a letter to them and gave a reply to them that Samurah remembered correctly.",
      "chain": [
        "30175",
        "20304",
        "11168",
        "11019",
        "11016",
        "394",
        "123"
      ]
    },
    {
      "hadith_no": "780",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا ابن المثنى، حدثنا عبد الأعلى، حدثنا سعيد، بهذا قال عن قتادة، عن الحسن، عن سمرة، قال سكتتان حفظتهما عن رسول الله صلى الله عليه وسلم ‏.‏ قال فيه قال سعيد قلنا لقتادة ما هاتان السكتتان قال إذا دخل في صلاته وإذا فرغ من القراءة ثم قال بعد وإذا قال ‏{‏ غير المغضوب عليهم ولا الضالين ‏}‏ ‏.‏",
      "text_en": " Narrated Samurah ibn Jundub:                     I remember from the Messenger of Allah (ﷺ) two periods of silence. Sa'id said: We asked Qatadah: What are those two periods of silence? He said: (one) when he began his prayer, and (one) when he finished the recitation. Then he added: When he finished reciting (the closing verse of the Fatihah): \"Not of those with whom Thou art angry, nor of who go astray.\"",
      "chain": [
        "30170",
        "20246",
        "11168",
        "11019",
        "11016",
        "394"
      ]
    },
    {
      "hadith_no": "1001",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن عثمان أبو الجماهر، حدثنا سعيد بن بشير، عن قتادة، عن الحسن، عن سمرة، قال أمرنا النبي صلى الله عليه وسلم أن نرد على الإمام وأن نتحاب وأن يسلم بعضنا على بعض ‏.‏",
      "text_en": " Narrated Samurah ibn Jundub:                     The Prophet (ﷺ) commanded us to respond to the salutation of the imam. and to love each other, and to salute each other.",
      "chain": [
        "38550",
        "20710",
        "11019",
        "11016",
        "394"
      ]
    },
    {
      "hadith_no": "1053",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا الحسن بن علي، حدثنا يزيد بن هارون، أخبرنا همام، حدثنا قتادة، عن قدامة بن وبرة العجيفي، عن سمرة بن جندب، عن النبي صلى الله عليه وسلم قال ‏\"‏ من ترك الجمعة من غير عذر فليتصدق بدينار فإن لم يجد فبنصف دينار ‏\"‏ ‏.‏ قال أبو داود وهكذا رواه خالد بن قيس وخالفه في الإسناد ووافقه في المتن ‏.‏",
      "text_en": " Narrated Samurah ibn Jundub:                     The Prophet (ﷺ) said: If anyone omits the Friday prayer without excuse, he must give a dinar in alms, or if he does not have as much, then half a dinar.Abu Dawud said: Khalid b. Qais reported this tradition in this manner, but he disagreed in respect of chain (of transmitters) and agreed in respect of the text.",
      "chain": [
        "30115",
        "20472",
        "20297",
        "11019",
        "394"
      ]
    },
    {
      "hadith_no": "1108",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا معاذ بن هشام، قال وجدت في كتاب أبي بخط يده ولم أسمعه منه قال قتادة عن يحيى بن مالك عن سمرة بن جندب أن نبي الله صلى الله عليه وسلم قال ‏\"‏ احضروا الذكر وادنوا من الإمام فإن الرجل لا يزال يتباعد حتى يؤخر في الجنة وإن دخلها ‏\"‏ ‏.‏",
      "text_en": " Narrated Samurah ibn Jundub:                     The Prophet (ﷺ) said: Attend the sermon (on Friday) and sit near the imam, for a man keeps himself away until he will be left behind at the time of entering Paradise though he enters it.",
      "chain": [
        "30026",
        "20287",
        "11019",
        "394"
      ]
    },
    {
      "hadith_no": "1125",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، عن يحيى بن سعيد، عن شعبة، عن معبد بن خالد، عن زيد بن عقبة، عن سمرة بن جندب، أن رسول الله صلى الله عليه وسلم كان يقرأ في صلاة الجمعة ‏{‏ سبح اسم ربك الأعلى ‏}‏ و ‏{‏ هل أتاك حديث الغاشية ‏}‏ ‏.‏",
      "text_en": " Narrated Samurah ibn Jundub:                     The Messenger of Allah (ﷺ) used to recite in the Friday prayer: \"Glorify the name of your most high Lord\" (Surah 87) and Has the story of the overwhelming event reached you? (Surah 88).",
      "chain": [
        "30175",
        "20031",
        "20020",
        "11396",
        "15166",
        "394"
      ]
    },
    {
      "hadith_no": "1184",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book Of The Prayer For Rain (Kitab al-Istisqa') - كتاب الاستسقاء",
      "chapter_no": "3",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زهير، حدثنا الأسود بن قيس، حدثني ثعلبة بن عباد العبدي، من أهل البصرة أنه شهد خطبة يوما لسمرة بن جندب قال قال سمرة بينما أنا وغلام من الأنصار نرمي غرضين لنا حتى إذا كانت الشمس قيد رمحين أو ثلاثة في عين الناظر من الأفق اسودت حتى آضت كأنها تنومة فقال أحدنا لصاحبه انطلق بنا إلى المسجد فوالله ليحدثن شأن هذه الشمس لرسول الله صلى الله عليه وسلم في أمته حدثا قال فدفعنا فإذا هو بارز فاستقدم فصلى فقام بنا كأطول ما قام بنا في صلاة قط لا نسمع له صوتا قال ثم ركع بنا كأطول ما ركع بنا في صلاة قط لا نسمع له صوتا ثم سجد بنا كأطول ما سجد بنا في صلاة قط لا نسمع له صوتا ‏.‏ ثم فعل في الركعة الأخرى مثل ذلك قال فوافق تجلي الشمس جلوسه في الركعة الثانية قال ثم سلم ثم قام فحمد الله وأثنى عليه وشهد أن لا إله إلا الله وشهد أنه عبده ورسوله ثم ساق أحمد بن يونس خطبة النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Samurah ibn Jundub:                     When, a boy from the Ansar and I were shooting (arrows) towards two of our targets, the sun was sighted by the people at the height of two or three lances above the horizon. It became black like the black herb called tannumah.  One of us said to his companion: Let us go to the mosque; by Allah, this incident of the sun will surely bring something new in the community of the Messenger of Allah (ﷺ).  As we reached it, we suddenly saw that he (the Prophet) had already come out (of his house). He stepped forward for a long time as much as he could do so in the prayer. But we did not hear his voice. He then performed a bowing and prolonged it as much as he could do in the prayer. But we did not hear his voice. He then prostrated himself with us and prolonged it which he never did in the prayer before. But we did not hear his voice. He then did similarly in the second rak'ah. The sun became bright when he sat after the second rak'ah. Then he uttered the salutation. He then stood up, praised Allah, and extolled Him, and testified that there was no god but Allah and testified that he was His servant and apostle. Ahmad ibn Yunus then narrated the address of the Prophet (ﷺ).",
      "chain": [
        "30184",
        "20321",
        "11323",
        "19841",
        "394"
      ]
    },
    {
      "hadith_no": "1562",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن داود بن سفيان، حدثنا يحيى بن حسان، حدثنا سليمان بن موسى أبو داود، حدثنا جعفر بن سعد بن سمرة بن جندب، حدثني خبيب بن سليمان، عن أبيه، سليمان عن سمرة بن جندب، قال أما بعد فإن رسول الله صلى الله عليه وسلم كان يأمرنا أن نخرج الصدقة من الذي نعد للبيع ‏.‏",
      "text_en": " Narrated Samurah ibn Jundub:                     The Messenger of Allah (ﷺ) used to order us to pay the sadaqah (zakat) on what we prepared for trade.",
      "chain": [
        "20300",
        "10880",
        "18127",
        "394"
      ]
    },
    {
      "hadith_no": "1639",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا حفص بن عمر النمري، حدثنا شعبة، عن عبد الملك بن عمير، عن زيد بن عقبة الفزاري، عن سمرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ المسائل كدوح يكدح بها الرجل وجهه فمن شاء أبقى على وجهه ومن شاء ترك إلا أن يسأل الرجل ذا سلطان أو في أمر لا يجد منه بدا ‏\"‏ ‏.‏",
      "text_en": " Narrated Samurah ibn Jundub:                     The Prophet (ﷺ) said: Acts of begging are lacerations with which a man disfigures his face, so he who wishes may preserve his self-respect, and he who wishes may abandon it; but this does not apply to one who begs from a ruler, or in a situation which makes it necessary.",
      "chain": [
        "30329",
        "20020",
        "11368",
        "15166",
        "394"
      ]
    },
    {
      "hadith_no": "2088",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا هشام، ح وحدثنا محمد بن كثير، أخبرنا همام، ح وحدثنا موسى بن إسماعيل، حدثنا حماد، - المعنى - عن قتادة، عن الحسن، عن سمرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ أيما امرأة زوجها وليان فهي للأول منهما وأيما رجل باع بيعا من رجلين فهو للأول منهما ‏\"‏ ‏.‏",
      "text_en": " Narrated Samurah:                     The Prophet (ﷺ) said: Any woman who is married by two guardians (to two different men) belongs to the first woman who is married by two guardians (to two different men) belongs to the first of them and anything sold by a man to two persons belongs to the first of them.",
      "chain": [
        "20285",
        "20295",
        "28531",
        "11447",
        "20040",
        "11019",
        "11016",
        "394"
      ]
    },
    {
      "hadith_no": "2346",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا مسدد، حدثنا حماد بن زيد، عن عبد الله بن سوادة القشيري، عن أبيه، قال سمعت سمرة بن جندب، يخطب وهو يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يمنعن من سحوركم أذان بلال ولا بياض الأفق الذي هكذا حتى يستطير ‏\"‏ ‏.‏",
      "text_en": " Addressing (the people) Samurah b. Jundub reported the Messenger of Allah (ﷺ) as saying:                      The adhan (call to prayer) of Bilal should not prevent you from taking a meal shortly before dawn, not does the whiteness of horizon (before dawn) in this way (vertically) until it spreads out horizontally.",
      "chain": [
        "30175",
        "20022",
        "10930",
        "394"
      ]
    },
    {
      "hadith_no": "2589",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن بشار، حدثنا قريش بن أنس، حدثنا أشعث، عن الحسن، عن سمرة بن جندب، أن رسول الله صلى الله عليه وسلم نهى أن يقد السير بين أصبعين ‏.‏",
      "text_en": " Narrated Samurah ibn Jundub:                     The Messenger of Allah (ﷺ) prohibited to cut a piece of leather between two fingers.",
      "chain": [
        "30160",
        "20273",
        "11324",
        "11016",
        "394"
      ]
    },
    {
      "hadith_no": "2595",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا يزيد بن هارون، عن الحجاج، عن قتادة، عن الحسن، عن سمرة بن جندب، قال كان شعار المهاجرين عبد الله وشعار الأنصار عبد الرحمن ‏.‏",
      "text_en": " Samurah bin Jundub said “The war-cry of the Emigrants was ‘Abd Allah and that of the helpers ‘Abd Al Rahman.”",
      "chain": [
        "30116",
        "20472",
        "20381",
        "11019",
        "11016",
        "394"
      ]
    },
    {
      "hadith_no": "2619",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا عياش بن الوليد الرقام، حدثنا عبد الأعلى، حدثنا سعيد، عن قتادة، عن الحسن، عن سمرة بن جندب، أن نبي الله صلى الله عليه وسلم قال ‏\"‏ إذا أتى أحدكم على ماشية فإن كان فيها صاحبها فليستأذنه فإن أذن له فليحلب وليشرب فإن لم يكن فيها فليصوت ثلاثا فإن أجابه فليستأذنه وإلا فليحتلب وليشرب ولا يحمل ‏\"‏ ‏.‏",
      "text_en": " Narrated Samurah ibn Jundub:                     The Prophet (ﷺ) said: When one of you comes to the cattle, he should seek permission of their master if he is there; if he permits, he should milk (the animals) and drink. If he is not there, he should call three times. If he responds, he should seek his permission; otherwise, he may milk (the animals) and drink, but should not carry (with him).",
      "chain": [
        "30157",
        "20246",
        "11168",
        "11019",
        "11016",
        "394"
      ]
    },
    {
      "hadith_no": "2670",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا هشيم، حدثنا حجاج، حدثنا قتادة، عن الحسن، عن سمرة بن جندب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ اقتلوا شيوخ المشركين واستبقوا شرخهم ‏\"‏ ‏.‏",
      "text_en": " Narrated Samurah ibn Jundub:                     The Prophet (ﷺ) said: Kill the old men who are polytheists, but spare their children.",
      "chain": [
        "30116",
        "20468",
        "20219",
        "11019",
        "11016",
        "394"
      ]
    },
    {
      "hadith_no": "2716",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن داود بن سفيان، قال حدثنا يحيى بن حسان، قال حدثنا سليمان بن موسى أبو داود، قال حدثنا جعفر بن سعد بن سمرة بن جندب، حدثني خبيب بن سليمان، عن أبيه، سليمان بن سمرة عن سمرة بن جندب، قال أما بعد وكان رسول الله صلى الله عليه وسلم يقول ‏\"‏ من كتم غالا فإنه مثله ‏\"‏ ‏.‏",
      "text_en": " Narrated Samurah ibn Jundub:                     The Prophet (ﷺ) said: To begin with, anyone who conceals one who has been dishonest about booty is like him.",
      "chain": [
        "20300",
        "10880",
        "18127",
        "394"
      ]
    },
    {
      "hadith_no": "2787",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن داود بن سفيان، حدثنا يحيى بن حسان، أخبرنا سليمان بن موسى أبو داود، حدثنا جعفر بن سعد بن سمرة بن جندب، حدثني خبيب بن سليمان، عن أبيه، سليمان بن سمرة عن سمرة بن جندب، أما بعد قال رسول الله صلى الله عليه وسلم ‏\"‏ من جامع المشرك وسكن معه فإنه مثله ‏\"‏ ‏.‏",
      "text_en": " Narrated Samurah ibn Jundub:                     To proceed, the Messenger of Allah (ﷺ) said: Anyone who associates with a polytheist and lives with him is like him.",
      "chain": [
        "20300",
        "10880",
        "18127",
        "394"
      ]
    },
    {
      "hadith_no": "2837",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Sacrifice (Kitab Al-Dahaya) - كتاب الضحايا",
      "chapter_no": "16",
      "text_ar": "حدثنا حفص بن عمر النمري، حدثنا همام، حدثنا قتادة، عن الحسن، عن سمرة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ كل غلام رهينة بعقيقته تذبح عنه يوم السابع ويحلق رأسه ويدمى ‏\"‏ ‏.‏ فكان قتادة إذا سئل عن الدم كيف يصنع به قال إذا ذبحت العقيقة أخذت منها صوفة واستقبلت به أوداجها ثم توضع على يافوخ الصبي حتى يسيل على رأسه مثل الخيط ثم يغسل رأسه بعد ويحلق ‏.‏ قال أبو داود وهذا وهم من همام ‏\"‏ ويدمى ‏\"‏ ‏.‏ قال أبو داود خولف همام في هذا الكلام وهو وهم من همام وإنما قالوا ‏\"‏ يسمى ‏\"‏ ‏.‏ فقال همام ‏\"‏ يدمى ‏\"‏ ‏.‏ قال أبو داود وليس يؤخذ بهذا ‏.‏",
      "text_en": " Narrated Samurah ibn Jundub:                     The Prophet (ﷺ) said: A boy is in pledge for his Aqiqah. Sacrifice is made for him on the seventh day, his head is shaved and is smeared with blood.  When Qatadah was asked about smearing with blood, how that should be done, he said: When you cut the head (i.e. throat) of the animal (meant for Aqiqah), you may take a few hair of it, place them on its veins, and then place them in the middle of the head of the infant, so that the blood flows on the hair (of the infant) like a threat. Then its head may be washed and shaved off.Abu Dawud said: In narrating the word \"is smeared with blood\" (yudamma) there is a misunderstanding on the part of Hammam.Abu Dawud said: Hammam has been opposed in narrating the words \"is smeared with blood\". This is misunderstanding of Hammam. They narrated he word \"he is given a name (yusamma) and Hammam narrated it \"is smeared with blood\" (yudamma).Abu Dawud said: This tradition is not followed.",
      "chain": [
        "30329",
        "20297",
        "11019",
        "11016",
        "394"
      ]
    },
    {
      "hadith_no": "2838",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Sacrifice (Kitab Al-Dahaya) - كتاب الضحايا",
      "chapter_no": "16",
      "text_ar": "حدثنا ابن المثنى، حدثنا ابن أبي عدي، عن سعيد، عن قتادة، عن الحسن، عن سمرة بن جندب، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ كل غلام رهينة بعقيقته تذبح عنه يوم سابعه ويحلق ويسمى ‏\"‏ ‏.‏ قال أبو داود ويسمى أصح كذا قال سلام بن أبي مطيع عن قتادة وإياس بن دغفل وأشعث عن الحسن ‏.‏ قال ‏\"‏ ويسمى ‏\"‏ ‏.‏ ورواه أشعث عن الحسن عن النبي صلى الله عليه وسلم قال ‏\"‏ ويسمى ‏\"‏ ‏.‏",
      "text_en": " Narrated Samurah ibn Jundub:                     The Prophet (ﷺ) said: A boy is in pledge for his Aqiqah, Sacrifice is made for him on the seventh day, his head is shaved and he is given name.Abu Dawud said: The word wa yusamma is sounder as narrated by Salam b. Abi Muti' from Qatadah, and narrated by Iyas b. Daghfal and Ash'ath from al-Hassan who narrated wa yusamma (and he is given a name).",
      "chain": [
        "30170",
        "20276",
        "11168",
        "11019",
        "11016",
        "394"
      ]
    },
    {
      "hadith_no": "3077",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا محمد بن بشر، حدثنا سعيد، عن قتادة، عن الحسن، عن سمرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من أحاط حائطا على أرض فهي له ‏\"‏ ‏.‏",
      "text_en": " Narrated Samurah:                     The Prophet (ﷺ) said: If anyone surrounds a land with a wall, it belongs to him.",
      "chain": [
        "30007",
        "20352",
        "11168",
        "11019",
        "11016",
        "394"
      ]
    },
    {
      "hadith_no": "3195",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا مسدد، حدثنا يزيد بن زريع، حدثنا حسين المعلم، حدثنا عبد الله بن بريدة، عن سمرة بن جندب، قال صليت وراء النبي صلى الله عليه وسلم على امرأة ماتت في نفاسها فقام عليها للصلاة وسطها ‏.‏",
      "text_en": " Narrated Samurah bin Jundab:                     I prayed behing the Prophet (ﷺ) over a woman who died in childbirth, and he stood opposite her waist.",
      "chain": [
        "30175",
        "20304",
        "11278",
        "11432",
        "394"
      ]
    },
    {
      "hadith_no": "3341",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا أبو الأحوص، عن سعيد بن مسروق، عن الشعبي، عن سمعان، عن سمرة، قال خطبنا رسول الله صلى الله عليه وسلم فقال ‏\"‏ ها هنا أحد من بني فلان ‏\"‏ ‏.‏ فلم يجبه أحد ثم قال ‏\"‏ ها هنا أحد من بني فلان ‏\"‏ ‏.‏ فلم يجبه أحد ثم قال ‏\"‏ ها هنا أحد من بني فلان ‏\"‏ ‏.‏ فقام رجل فقال أنا يا رسول الله ‏.‏ فقال صلى الله عليه وسلم ‏\"‏ ما منعك أن تجيبني في المرتين الأوليين أما إني لم أنوه بكم إلا خيرا إن صاحبكم مأسور بدينه ‏\"‏ ‏.‏ فلقد رأيته أدى عنه حتى ما بقي أحد يطلبه بشىء ‏.‏ قال أبو داود سمعان بن مشنج ‏.‏",
      "text_en": " Narrated Samurah:                     The Messenger of Allah (ﷺ) addressed us and said: Is here any one of such and such tribe present? But no one replied. He again asked: Is here any one of such and such tribe present? But no one replied. He again asked: Is here any one of such and such tribe? Then a man stood and said: I am (here), Messenger of Allah. He said: What prevented you from replying the first two times? I wish to tell you something good. Your companion has been detained (from entering Paradise) on account of his debt. Then I saw him that he paid off all his debt on his behalf and there remained no one to demand from him anything.Abu Dawud said: The name of the narrator Sam'an is Sam'an b. Mushannaj.",
      "chain": [
        "30116",
        "20327",
        "20016",
        "11052",
        "394"
      ]
    }
  ],
  "total_hadiths": 145
}