{
  "id": "4",
  "name": "'Uthman ibn 'Affaan ( عثمان بن عفان ( رضي الله عنه",
  "full_name": "'Uthman ibn 'Affaan ( عثمان بن عفان ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "47",
      "date_gregorian": "579",
      "date_display": [
        "47 BH",
        "579 CE"
      ],
      "place": "Ta'if"
    },
    "death": {
      "date_hijri": "35",
      "date_gregorian": "655",
      "date_display": null,
      "place": "Medinah",
      "reason": "Martyred"
    },
    "places_of_stay": [
      "Makkah",
      "Abyssinia",
      "Medinah"
    ],
    "area_of_interest": [
      "Tafsir/Quran",
      "Narrator [ ع  -  صحابة ]",
      "Fiqh",
      "Commander",
      "Khalifah"
    ],
    "tags": [
      "Quraish",
      "B.'Abd Shams",
      "B.Umayya",
      "Early Muslim",
      "Abyssinia 1",
      "Abyssinia 2",
      "Promised Paradise",
      "Emigrant",
      "Scribe"
    ]
  },
  "parents": [
    {
      "id": "426",
      "name": "Arwa bint Kuraiz bin Rabi'a ( أروى بنت كريز بن ربيعة ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "spouses": [
    {
      "id": "102",
      "name": "Ruqayyah bint Muhammad ( رقية بنت محمد بن عبد الله ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "94",
      "name": "Umm Kulthum bint Muhammad ( أم كلثوم بنت سيد البشر رسول الله ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "576",
      "name": "Fakhitah bint Ghazwan ( فاختة بنت غزوان ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "572",
      "name": "Ramlah bint Shayba bin Rabi'a ( رملة بنت شيبة بن ربيعة بن عبد شمس ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "573",
      "name": "Umm 'Amr bint Jundub al-Dausi ( أم عمرو بنت جندب بن عمرو ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "574",
      "name": "Fatima bint al-Walid b. 'Abd Shams ( فاطمة بنت الوليد بن عبد شمس ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "575",
      "name": "Na'ilah bint al-Furafisah ( نائلة ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "siblings": [
    {
      "id": "570",
      "name": "Amnah bint Affaan ( آمنة بنت عفان بن أبي العاص ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "children": [
    {
      "id": "571",
      "name": "'Abdullah bin 'Uthman ( عبد الله بن عثمان بن عفان ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "10580",
      "name": "'Abdullah bin 'Uthman عبد الله بن عثمان بن عفان",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "10590",
      "name": "'Aishah bint 'Uthman عائشة بنت عثمان بن عفان",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "10591",
      "name": "Umm Aban bint 'Uthman أم أبان بنت عثمان بن عفان",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "10592",
      "name": "Umm 'Amr bint 'Uthman أم عمرو بنت عثمان بن عفان",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "10581",
      "name": "'Amr bin 'Uthman عمرو بن عثمان بن عفان",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10582",
      "name": "Aban bin 'Uthman أبان بن عثمان بن عفان",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10583",
      "name": "'Umar bin 'Uthman عمر بن عثمان بن عفان",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10584",
      "name": "Khalid bin 'Uthman خالد بن عثمان بن عفان",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "10585",
      "name": "Maryam bint 'Uthman مريم بنت عثمان بن عفان",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "10586",
      "name": "al-Walid bin 'Uthman الوليد بن عثمان بن عفان",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "10587",
      "name": "Sa'id bin 'Uthman سعيد بن عثمان بن عفان",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "10588",
      "name": "Umm 'Uthman bint 'Uthman أم عثمان بنت عثمان بن عفان",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "10593",
      "name": "Umm Khalid bint 'Uthman أم خالد بنت عثمان بن عفان",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "10594",
      "name": "Arwa bint 'Uthman أروى بنت عثمان بن عفان",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "10595",
      "name": "Umm Aban bint 'Uthman أم أبان بنت عثمان بن عفان",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "10596",
      "name": "Maryam bint 'Uthman مريم بنت عثمان بن عفان",
      "grade": "Follower(Tabi')"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "2",
      "name": "Abu Bakr As-Siddique ( أبو بكر الصديق ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3",
      "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "10582",
      "name": "Aban bin 'Uthman أبان بن عثمان بن عفان",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10587",
      "name": "Sa'id bin 'Uthman سعيد بن عثمان بن عفان",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "16",
      "name": "ibn Mas'ud ( عبد الله بن مسعود ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "49",
      "name": "Zayd ibn Thabit ( زيد بن ثابت بن الضحاك بن زيد ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "123",
      "name": "'Imran bin Husain ( عمران بن حصين ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "391",
      "name": "Abu Qatada ibn Rab'i ( أبو قتادة بن ربعي الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "16",
      "name": "ibn Mas'ud ( عبد الله بن مسعود ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "106",
      "name": "'Abdullah ibn al-Zubayr ( عبد الله بن الزبير بن العوام ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "858",
      "name": "Marwan bin al-Hakam bin Abi al-'As ( مروان بن الحكم بن أبي العاص بن أمية ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "237",
      "name": "Salma ibn al-Akwa ( سلمة بن الأكوع ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4048",
      "name": "Abu Umama al-Bahili ( أبو أمامة الباهلي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "405",
      "name": "Abu Umama bin Sahl ( أسعد أبو أمامة بن سهل بن حنيف ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "448",
      "name": "'Abdur Rahman ibn al-Harith ( عبد الرحمن بن الحارث بن هشام ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3048",
      "name": "al-Sa'ib bin Yazid bin Akht Namr ( السائب بن يزيد بن أخت النمر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3680",
      "name": "Tariq bin Shahab ( طارق بن شهاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5030",
      "name": "Malik bin Aws bin al-Hadathan ( مالك بن أوس بن الحدثان النصري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "1238",
      "name": "'Abdur Rahman bin Abi 'Amra ( عبد الرحمن بن أبي عمرة الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "880",
      "name": "'Ubaidullah bin 'Ady bin al-Khayyar ( عبيد الله بن عدي بن الخيار ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "989",
      "name": "Sa'id bin al-'As bin Sa'id bin al-'As ( سعيد بن العاص بن سعيد بن العاص بن أمية ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "1830",
      "name": "Mahmud bin Labid bin 'Uqba ( محمود بن لبيد بن عقبة بن رافع ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11002",
      "name": "Sa'id ibn al-Musayyib سعيد بن المسيب بن حزن أبو محمد القرشي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11112",
      "name": "al-Ahnaf bin Qays الأحنف بن قيس بن معاوية",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "10567",
      "name": "Abu Salama bin 'Abdur Rahman أبو سلمة بن عبد الرحمن بن عوف",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11353",
      "name": "Shaqayq bin Salmah al-Asadi شقيق بن سلمة الأسدي أبو وائل الكوفي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11359",
      "name": "Abu 'Abdur Rahman al-Salmi أبو عبد الرحمن السلمي",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "11017",
      "name": "'Alqama bin Qays علقمة بن قيس بن عبد الله",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "10694",
      "name": "'Abdullah bin Shaqayq al-Aqayli عبد الله بن شقيق العقيلي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10600",
      "name": "Muhammad bin 'Ali bin al-Hanfiyyah محمد بن الحنفية",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "10602",
      "name": "'Amr bin Sa'id bin al-As عمرو بن سعيد بن العاص- الأشدق",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11421",
      "name": "Hamran bin Aban حمران بن أبان",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "19103",
      "name": "Hani al-Bariri هانئ أبو سعيد البربري الدمشقي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19291",
      "name": "Abu Salah Maula 'Uthman أبو صالح مولى عثمان",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19282",
      "name": "Abu Sahlah Maula 'Uthman أبو سهلة مولى عثمان",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-179",
      "hadith_no": "179",
      "source": "Sahih Bukhari",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا سعد بن حفص، حدثنا شيبان، عن يحيى، عن أبي سلمة، أن عطاء بن يسار، أخبره أن زيد بن خالد أخبره أنه، سأل عثمان بن عفان  رضى الله عنه  قلت أرأيت إذا جامع فلم يمن قال عثمان يتوضأ كما يتوضأ للصلاة، ويغسل ذكره‏.‏ قال عثمان سمعته من رسول الله صلى الله عليه وسلم‏.‏ فسألت عن ذلك عليا، والزبير، وطلحة، وأبى بن كعب  رضى الله عنهم  فأمروه بذلك‏.‏",
      "text_en": " Narrated Zaid bin Khalid:                     I asked `Uthman bin `Affan about a person who engaged in intercourse but did no discharge. `Uthman replied, \"He should perform ablution like the one for an ordinary prayer but he must wash his penis.\" `Uthman added, \"I heard it from Allah's Apostle.\" I asked `Ali Az-Zubair, Talha and Ubai bin Ka`b about it and they, too, gave the same reply. (This order was canceled later on and taking a bath became necessary for such cases).",
      "usc_msa_ref": "",
      "chain": [
        "35043",
        "20240",
        "11449",
        "10567",
        "11020",
        "3625",
        "4"
      ]
    },
    {
      "id": "sahih-bukhari-292",
      "hadith_no": "292",
      "source": "Sahih Bukhari",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو معمر، حدثنا عبد الوارث، عن الحسين، قال يحيى وأخبرني أبو سلمة، أن عطاء بن يسار، أخبره أن زيد بن خالد الجهني أخبره أنه، سأل عثمان بن عفان فقال أرأيت إذا جامع الرجل امرأته فلم يمن‏.‏ قال عثمان يتوضأ كما يتوضأ للصلاة، ويغسل ذكره‏.‏ قال عثمان سمعته من رسول الله صلى الله عليه وسلم‏.‏ فسألت عن ذلك علي بن أبي طالب والزبير بن العوام وطلحة بن عبيد الله وأبى بن كعب  رضى الله عنهم  فأمروه بذلك‏.‏ قال يحيى وأخبرني أبو سلمة أن عروة بن الزبير أخبره أن أبا أيوب أخبره أنه سمع ذلك من رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Zaid bin Khalid Al-Juhani:                     I asked `Uthman bin `Affan about a man who engaged in the sexual intercourse with his wife but did not discharge. `Uthman replied, \"He should perform ablution like that for the prayer after washing his private parts.\" `Uthman added, \"I heard that from Allah's Apostle.\" I asked `Ali bin Abi Talib, Az- Zubair bin Al-`Awwam, Talha bin 'Ubaidullah and Ubai bin Ka`b and a gave the same reply. (Abu Aiyub said that he had heard that from Allah's Apostle ) (This order was canceled later on so one has to take a bath. See, Hadith No. 180).",
      "usc_msa_ref": "",
      "chain": [
        "30315",
        "20258",
        "11278",
        "11449",
        "10567",
        "11020",
        "3625",
        "4"
      ]
    },
    {
      "id": "sahih-bukhari-450",
      "hadith_no": "450",
      "source": "Sahih Bukhari",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا يحيى بن سليمان، حدثني ابن وهب، أخبرني عمرو، أن بكيرا، حدثه أن عاصم بن عمر بن قتادة حدثه أنه، سمع عبيد الله الخولاني، أنه سمع عثمان بن عفان، يقول عند قول الناس فيه حين بنى مسجد الرسول صلى الله عليه وسلم إنكم أكثرتم، وإني سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ من بنى مسجدا  قال بكير حسبت أنه قال  يبتغي به وجه الله، بنى الله له مثله في الجنة ‏\"‏‏.‏",
      "text_en": " Narrated 'Ubaidullah Al-Khaulani:                     I heard `Uthman bin `Affan saying, when people argued too much about his intention to reconstruct the mosque of Allah's Apostle, \"You have talked too much. I heard the Prophet saying, 'Whoever built a mosque, (Bukair thought that `Asim, another sub-narrator, added, \"Intending Allah's Pleasure\"), Allah would build for him a similar place in Paradise.' \"",
      "usc_msa_ref": "441",
      "chain": [
        "30220",
        "20029",
        "20377",
        "11154",
        "11103",
        "11706",
        "4"
      ]
    },
    {
      "id": "sahih-bukhari-955",
      "hadith_no": "955",
      "source": "Sahih Bukhari",
      "chapter": "The Two Festivals (Eids) - كتاب العيدين",
      "chapter_no": "13",
      "text_ar": "حدثنا عثمان، قال حدثنا جرير، عن منصور، عن الشعبي، عن البراء بن عازب  رضى الله عنهما  قال خطبنا النبي صلى الله عليه وسلم يوم الأضحى بعد الصلاة فقال ‏\"‏ من صلى صلاتنا ونسك نسكنا فقد أصاب النسك، ومن نسك قبل الصلاة فإنه قبل الصلاة، ولا نسك له ‏\"‏‏.‏ فقال أبو بردة بن نيار خال البراء يا رسول الله، فإني نسكت شاتي قبل الصلاة، وعرفت أن اليوم يوم أكل وشرب، وأحببت أن تكون شاتي أول ما يذبح في بيتي، فذبحت شاتي وتغديت قبل أن آتي الصلاة‏.‏ قال ‏\"‏ شاتك شاة لحم ‏\"‏‏.‏ قال يا رسول الله، فإن عندنا عناقا لنا جذعة هي أحب إلى من شاتين، أفتجزي عني قال ‏\"‏ نعم، ولن تجزي عن أحد بعدك ‏\"‏‏.‏",
      "text_en": " Narrated Al-Bara' bin `Azib:                     The Prophet delivered the Khutba after offering the prayer on the Day of Nahr and said, \"Whoever offers the prayer like us and slaughters like us then his Nusuk (sacrifice) will be accepted by Allah. And whoever slaughters his sacrifice before the `Id prayer then he has not done the sacrifice.\" Abi Burda bin Niyar, the uncle of Al-Bara' said, \"O Allah's Apostle! I have slaughtered my sheep before the `Id prayer and I thought today as a day of eating and drinking (not alcoholic drinks), and I liked that my sheep should be the first to be slaughtered in my house. So slaughtered my sheep and took my food before coming for the prayer.\" The Prophet said, \"The sheep which you have slaughtered is just mutton (not a Nusuk).\" He (Abu Burda) said, \"O Allah's Apostle! I have a young she-goat which is dearer to me than two sheep. Will that be sufficient as a Nusuk on my behalf? \"The Prophet (p.b.u.h) said, \"Yes, it will be sufficient for you but it will not be sufficient (as a Nusuk) for anyone else after you.\"",
      "usc_msa_ref": "75",
      "chain": [
        "4",
        "20028",
        "11067",
        "11052",
        "400"
      ]
    },
    {
      "id": "sahih-bukhari-1362",
      "hadith_no": "1362",
      "source": "Sahih Bukhari",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا عثمان، قال حدثني جرير، عن منصور، عن سعد بن عبيدة، عن أبي عبد الرحمن، عن علي  رضى الله عنه  قال كنا في جنازة في بقيع الغرقد، فأتانا النبي صلى الله عليه وسلم فقعد وقعدنا حوله، ومعه مخصرة فنكس، فجعل ينكت بمخصرته ثم قال ‏\"‏ ما منكم من أحد، ما من نفس منفوسة إلا كتب مكانها من الجنة والنار، وإلا قد كتب شقية أو سعيدة ‏\"‏‏.‏ فقال رجل يا رسول الله، أفلا نتكل على كتابنا وندع العمل، فمن كان منا من أهل السعادة فسيصير إلى عمل أهل السعادة، وأما من كان منا من أهل الشقاوة فسيصير إلى عمل أهل الشقاوة قال ‏\"‏ أما أهل السعادة فييسرون لعمل السعادة، وأما أهل الشقاوة فييسرون لعمل الشقاوة ‏\"‏، ثم قرأ ‏{‏فأما من أعطى واتقى‏}‏ الآية‏.‏",
      "text_en": " Narrated `Ali:                     \" We were accompanying a funeral procession in Baqi-I-Gharqad. The Prophet came to us and sat and we sat around him. He had a small stick in his hand then he bent his head and started scraping the ground with it. He then said, \"There is none among you, and not a created soul, but has place either in Paradise or in Hell assigned for him and it is also determined for him whether he will be among the blessed or wretched.\" A man said, \"O Allah's Apostle! Should we not depend on what has been written for us and leave the deeds as whoever amongst us is blessed will do the deeds of a blessed person and whoever amongst us will be wretched, will do the deeds of a wretched person?\" The Prophet said, \"The good deeds are made easy for the blessed, and bad deeds are made easy for the wretched.\" Then he recited the Verses:-- \"As for him who gives (in charity) and is Allah-fearing And believes in the Best reward from Allah. \" (92.5-6)",
      "usc_msa_ref": "444",
      "chain": [
        "4",
        "20028",
        "11067",
        "11344",
        "11359",
        "5"
      ]
    },
    {
      "id": "sahih-bukhari-2408",
      "hadith_no": "2408",
      "source": "Sahih Bukhari",
      "chapter": "Loans; Payment of Loans; Freezing of Property; Bankruptcy - كتاب فى الاستقراض",
      "chapter_no": "43",
      "text_ar": "حدثنا عثمان، حدثنا جرير، عن منصور، عن الشعبي، عن وراد، مولى المغيرة بن شعبة عن المغيرة بن شعبة، قال قال النبي صلى الله عليه وسلم ‏\"‏ إن الله حرم عليكم عقوق الأمهات، ووأد البنات، ومنع وهات، وكره لكم قيل وقال، وكثرة السؤال، وإضاعة المال ‏\"‏‏.‏",
      "text_en": " Narrated Al-Mughira bin Shu`ba:                     The Prophet said, \"Allah has forbidden for you, (1) to be undutiful to your mothers, (2) to bury your daughters alive, (3) to not to pay the rights of the others (e.g. charity, etc.) and (4) to beg of men (begging). And Allah has hated for you (1) vain, useless talk, or that you talk too much about others, (2) to ask too many questions, (in disputed religious matters) and (3) to waste the wealth (by extravagance).",
      "usc_msa_ref": "591",
      "chain": [
        "4",
        "20028",
        "11067",
        "11052",
        "166"
      ]
    },
    {
      "id": "sahih-bukhari-2778",
      "hadith_no": "2778",
      "source": "Sahih Bukhari",
      "chapter": "Wills and Testaments (Wasaayaa) - كتاب الوصايا",
      "chapter_no": "55",
      "text_ar": "وقال عبدان أخبرني أبي، عن شعبة، عن أبي إسحاق، عن أبي عبد الرحمن، أن عثمان  رضى الله عنه  حيث حوصر أشرف عليهم وقال أنشدكم ولا أنشد إلا أصحاب النبي صلى الله عليه وسلم، ألستم تعلمون أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من حفر رومة فله الجنة ‏\"‏‏.‏ فحفرتها، ألستم تعلمون أنه قال ‏\"‏ من جهز جيش العسرة فله الجنة ‏\"‏‏.‏ فجهزتهم‏.‏ قال فصدقوه بما قال‏.‏ وقال عمر في وقفه لا جناح على من وليه أن يأكل‏.‏ وقد يليه الواقف وغيره فهو واسع لكل‏.‏",
      "text_en": " Abu 'Abdur-Rahman narrated:                      When 'Uthman (ra) was circled (by the rebels), he looked upon them from above and said, \"Ias you by Allah, I ask nobody but the Companions of the Prophet (), dont you know that Allah's Messenger () said, 'Whoever  will (buy and) dig the well of Ruma will be granted Paradise,' and I (bought and) dug it? Don't you know that he said. 'Whoever equip the army of 'Usra (i.e., Tabuk's Ghazwa) will be granted Paradise,' and I equipped it ?\" They attested whatever he said.When 'Umar founded his endowment he said, \"Its administrator can eat from it.\" The management of the endowment can be taken over by the founder himself or any other person, for both cases are permissible.",
      "usc_msa_ref": "",
      "chain": [
        "30349",
        "30361",
        "20020",
        "11049",
        "11359",
        "4"
      ]
    },
    {
      "id": "sahih-bukhari-4115",
      "hadith_no": "4115",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبدان، أخبرنا أبو حمزة، عن عثمان بن موهب، قال جاء رجل حج البيت فرأى قوما جلوسا فقال من هؤلاء القعود قالوا هؤلاء قريش‏.‏ قال من الشيخ قالوا ابن عمر‏.‏ فأتاه فقال إني سائلك عن شىء أتحدثني، قال أنشدك بحرمة هذا البيت أتعلم أن عثمان بن عفان فر يوم أحد قال نعم‏.‏ قال فتعلمه تغيب عن بدر فلم يشهدها قال نعم‏.‏ قال فتعلم أنه تخلف عن بيعة الرضوان فلم يشهدها قال نعم‏.‏ قال فكبر‏.‏ قال ابن عمر تعال لأخبرك ولأبين لك عما سألتني عنه، أما فراره يوم أحد فأشهد أن الله عفا عنه، وأما تغيبه عن بدر فإنه كان تحته بنت رسول الله صلى الله عليه وسلم وكانت مريضة، فقال له النبي صلى الله عليه وسلم ‏\"‏ إن لك أجر رجل ممن شهد بدرا وسهمه ‏\"‏‏.‏ وأما تغيبه عن بيعة الرضوان فإنه لو كان أحد أعز ببطن مكة من عثمان بن عفان لبعثه مكانه، فبعث عثمان، وكان بيعة الرضوان بعد ما ذهب عثمان إلى مكة فقال النبي صلى الله عليه وسلم بيده اليمنى ‏\"‏ هذه يد عثمان ‏\"‏‏.‏ فضرب بها على يده فقال ‏\"‏ هذه لعثمان ‏\"‏‏.‏ اذهب بهذا الآن معك‏.‏",
      "text_en": " Narrated `Uthman bin Mauhab:                     A man came to perform the Hajj to (Allah's) House. Seeing some people sitting, he said, \"Who are these sitting people?\" Somebody said, \"They are the people of Quraish.\" He said, \"Who is the old man?\" They said, \"Ibn `Umar.\" He went to him and said, \"I want to ask you about something; will you tell me about it? I ask you with the respect due to the sanctity of this (Sacred) House, do you know that `Uthman bin `Affan fled on the day of Uhud?\" Ibn `Umar said, \"Yes.\" He said, \"Do you know that he (i.e. `Uthman) was absent from the Badr (battle) and did not join it?\" Ibn `Umar said, \"Yes.\" He said, \"Do you know that he failed to be present at the Ridwan Pledge of allegiance (i.e. Pledge of allegiance at Hudaibiya) and did not witness it?\" Ibn `Umar replied, \"Yes,\" He then said, \"Allahu- Akbar!\" Ibn `Umar said, \"Come along; I will inform you and explain to you what you have asked. As for the flight (of `Uthman) on the day of Uhud, I testify that Allah forgave him. As regards his absence from the Badr (battle), he was married to the daughter of Allah's Apostle and she was ill, so the Prophet said to him, 'You will have such reward as a man who has fought the Badr battle will get, and will also have the same share of the booty.' As for his absence from the Ridwan Pledge of allegiance if there had been anybody more respected by the Meccans than `Uthman bin `Affan, the Prophet would surely have sent that man instead of `Uthman. So the Prophet sent him (i.e. `Uthman to Mecca) and the Ridwan Pledge of allegiance took place after `Uthman had gone to Mecca. The Prophet raised his right hand saying. 'This is the hand of `Uthman,' and clapped it over his other hand and said, \"This is for `Uthman.'\" Ibn `Umar then said (to the man), \"Go now, after taking this information.\"",
      "usc_msa_ref": "",
      "chain": [
        "30349",
        "20458",
        "18716",
        "4"
      ]
    },
    {
      "id": "sahih-bukhari-5079",
      "hadith_no": "5079",
      "source": "Sahih Bukhari",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا حجاج بن منهال، حدثنا شعبة، قال أخبرني علقمة بن مرثد، سمعت سعد بن عبيدة، عن أبي عبد الرحمن السلمي، عن عثمان  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ خيركم من تعلم القرآن وعلمه ‏\"‏‏.‏ قال وأقرأ أبو عبد الرحمن في إمرة عثمان حتى كان الحجاج، قال وذاك الذي أقعدني مقعدي هذا‏.‏",
      "text_en": " Narrated `Uthman:                     The Prophet said, \"The best among you (Muslims) are those who learn the Qur'an and teach it.\"",
      "usc_msa_ref": "545",
      "chain": [
        "20219",
        "20020",
        "11374",
        "11344",
        "11359",
        "4"
      ]
    },
    {
      "id": "sahih-bukhari-5080",
      "hadith_no": "5080",
      "source": "Sahih Bukhari",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا أبو نعيم، حدثنا سفيان، عن علقمة بن مرثد، عن أبي عبد الرحمن السلمي، عن عثمان بن عفان، قال قال النبي صلى الله عليه وسلم ‏\"‏ إن أفضلكم من تعلم القرآن وعلمه ‏\"‏‏.‏",
      "text_en": " Narrated `Uthman bin `Affan:                     The Prophet said, \"The most superior among you (Muslims) are those who learn the Qur'an and teach it.\"",
      "usc_msa_ref": "546",
      "chain": [
        "20348",
        "20012",
        "11374",
        "11359",
        "4"
      ]
    },
    {
      "id": "sahih-muslim-145",
      "hadith_no": "145",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، كلاهما عن إسماعيل بن إبراهيم، - قال أبو بكر حدثنا ابن علية، - عن خالد، قال حدثني الوليد بن مسلم، عن حمران، عن عثمان، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من مات وهو يعلم أنه لا إله إلا الله دخل الجنة ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of 'Uthman that the Messenger of Allah (may peace be upon him) said. He who died knowing (fully well) that there is no god but Allah entered Paradise.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30022",
        "20208",
        "20436",
        "20208",
        "11282",
        "10725",
        "11421",
        "4"
      ]
    },
    {
      "id": "sahih-muslim-146",
      "hadith_no": "146",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن أبي بكر المقدمي، حدثنا بشر بن المفضل، حدثنا خالد الحذاء، عن الوليد أبي بشر، قال سمعت حمران، يقول سمعت عثمان، يقول سمعت رسول الله صلى الله عليه وسلم يقول مثله سواء ‏.‏",
      "text_en": " It is narrated on the authority of Humran that he heard Uthman saying this:                      I heard the Messenger of Allah (may peace be upon him) uttering these words (as stated above).",
      "usc_msa_ref": "",
      "chain": [
        "30161",
        "20212",
        "11282",
        "10725",
        "11421",
        "4"
      ]
    },
    {
      "id": "sahih-muslim-226-2",
      "hadith_no": "226",
      "source": "Sahih Muslim",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثني أبو الطاهر، أحمد بن عمرو بن عبد الله بن عمرو بن سرح وحرملة بن يحيى التجيبي قالا أخبرنا ابن وهب، عن يونس، عن ابن شهاب، أن عطاء بن يزيد الليثي، أخبره أن حمران مولى عثمان أخبره أن عثمان بن عفان - رضى الله عنه - دعا بوضوء فتوضأ فغسل كفيه ثلاث مرات ثم مضمض واستنثر ثم غسل وجهه ثلاث مرات ثم غسل يده اليمنى إلى المرفق ثلاث مرات ثم غسل يده اليسرى مثل ذلك ثم مسح رأسه ثم غسل رجله اليمنى إلى الكعبين ثلاث مرات ثم غسل اليسرى مثل ذلك ثم قال رأيت رسول الله صلى الله عليه وسلم توضأ نحو وضوئي هذا ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ من توضأ نحو وضوئي هذا ثم قام فركع ركعتين لا يحدث فيهما نفسه غفر له ما تقدم من ذنبه ‏\"‏ ‏.‏ قال ابن شهاب وكان علماؤنا يقولون هذا الوضوء أسبغ ما يتوضأ به أحد للصلاة ‏.‏",
      "text_en": " Humran, the freed slave of 'Uthman, said:                      Uthman b. 'Affan called for ablution water and this is how he performed the ablution. He washed his hands thrice. He then rinsed his mouth and cleaned his nose with water (three times). He then washed his face three times, then washed his right arm up to the elbow three times, then washed his left arm like that, then wiped his head; then washed his right foot up to the ankle three times, then washed his left foot like that, and then said: I saw the Messenger of Allah (may peace be upon him) perform ablution like this ablution of mine. Then the Messenger of Allah (may peace be upon him) said: He who performs ablution like this ablution of mine and then stood up (for prayer) and offered two rak'ahs of prayer without allowing his thoughts to be distracted, all his previous sins are expiated. Ibn Shihab said: Our scholars remarked: This is the most complete of the ablutions performed for prayer.",
      "usc_msa_ref": "",
      "chain": [
        "20029",
        "20475",
        "11013",
        "11206",
        "11421",
        "4"
      ]
    },
    {
      "id": "sahih-muslim-226-3",
      "hadith_no": "226",
      "source": "Sahih Muslim",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثني زهير بن حرب، حدثنا يعقوب بن إبراهيم، حدثنا أبي، عن ابن شهاب، عن عطاء بن يزيد الليثي، عن حمران، مولى عثمان أنه رأى عثمان دعا بإناء فأفرغ على كفيه ثلاث مرار فغسلهما ثم أدخل يمينه في الإناء فمضمض واستنثر ثم غسل وجهه ثلاث مرات ويديه إلى المرفقين ثلاث مرات ثم مسح برأسه ثم غسل رجليه ثلاث مرات ثم قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من توضأ نحو وضوئي هذا ثم صلى ركعتين لا يحدث فيهما نفسه غفر له ما تقدم من ذنبه ‏\"‏ ‏.‏",
      "text_en": " Humran, the freed slave of 'Uthman said:                      I saw Uthman call for a vessel (of water) and poured water over his hands three times and then washed them. Then he put his right hand in the vessel and rinsed his mouth and cleaned his nose. Then he washed his face three times and his hands up to the elbow three times; then wiped his head, then washed his feet three times. Then he said that the Messenger of Allah (may peace be upon him) had said: He who performed ablution like this ablution of mine and offered two raklahs of prayer without allowing his thoughts to be distracted, all his previous sins would be expiated.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "20184",
        "20150",
        "11013",
        "11206",
        "11421",
        "4"
      ]
    },
    {
      "id": "sahih-muslim-227-2",
      "hadith_no": "227",
      "source": "Sahih Muslim",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا قتيبة بن سعيد، وعثمان بن محمد بن أبي شيبة، وإسحاق بن إبراهيم الحنظلي، - واللفظ لقتيبة - قال إسحاق أخبرنا وقال الآخران، حدثنا جرير، عن هشام بن عروة، عن أبيه، عن حمران، مولى عثمان قال سمعت عثمان بن عفان، وهو بفناء المسجد فجاءه المؤذن عند العصر فدعا بوضوء فتوضأ ثم قال والله لأحدثنكم حديثا لولا آية في كتاب الله ما حدثتكم إني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يتوضأ رجل مسلم فيحسن الوضوء فيصلي صلاة إلا غفر الله له ما بينه وبين الصلاة التي تليها ‏\"‏ ‏.‏",
      "text_en": " Humran. the freed slave of 'Uthman. said:                      I heard from 'Uthman b. 'Affan and he was in the courtyard of the mosque, when the Mu'adhdhin (announcer of the prayer) came to him at the time of afternoon prayer. So the ('Uthman) called for the ablution water and performed ablution and then said: By Allah, I am narrating to you a hadith. If there were not a verse in the Book of Allah, I would have never narrated it to you. I heard Allah's Messenger (may peace be upon him) say: If a Muslim performs ablution and does it well and offers prayer, all his (sins) daring the period from one prayer to another would be pardoned by Allah.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "30203",
        "30123",
        "30312",
        "4057",
        "11065",
        "10511",
        "11421",
        "4"
      ]
    },
    {
      "id": "sahih-muslim-227-3",
      "hadith_no": "227",
      "source": "Sahih Muslim",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثناه أبو كريب، حدثنا أبو أسامة، ح وحدثنا زهير بن حرب، وأبو كريب قالا حدثنا وكيع، ح وحدثنا ابن أبي عمر، حدثنا سفيان، جميعا عن هشام، بهذا الإسناد وفي حديث أبي أسامة ‏\"‏ فيحسن وضوءه ثم يصلي المكتوبة ‏\"‏ ‏.‏",
      "text_en": " This hadith is also narrated on the authority with the same chain of transmitters and in the hadith of Abu Usama the words are:                     \" He who performed the ablution well and then offered the obligatory prayer.\"",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20318",
        "30022",
        "30216",
        "20032",
        "30421",
        "20005",
        "11065",
        "10511",
        "11421",
        "4"
      ]
    },
    {
      "id": "sahih-muslim-229-2",
      "hadith_no": "229",
      "source": "Sahih Muslim",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا قتيبة بن سعيد، وأحمد بن عبدة الضبي، قالا حدثنا عبد العزيز، - وهو الدراوردي - عن زيد بن أسلم، عن حمران، مولى عثمان قال أتيت عثمان بن عفان بوضوء فتوضأ ثم قال إن ناسا يتحدثون عن رسول الله صلى الله عليه وسلم أحاديث لا أدري ما هي إلا أني رأيت رسول الله صلى الله عليه وسلم توضأ مثل وضوئي هذا ثم قال ‏\"‏ من توضأ هكذا غفر له ما تقدم من ذنبه وكانت صلاته ومشيه إلى المسجد نافلة ‏\"‏ ‏.‏ وفي رواية ابن عبدة أتيت عثمان فتوضأ ‏.‏",
      "text_en": " Humran, the freed slave of 'Uthman reported:                      I brought for Uthman b. 'Affan the ablution water. He performed ablution and then said: Verily the people narrate from the Messenger of Allah (may peace be upon him) a hadith. I do not know what these are. but (I know this fact) that I saw the Messenger of Allah (may peace be upon him) perform ablution like this ablution of mine and then he said: He who performed ablution like this, all his previous sins would be expiated and his prayer and going towards the mosque would have an extra reward. In the tradition narrated by Ibn 'Abda (the words are):\" I came to Uthman and he performed ablution.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "30423",
        "20167",
        "11163",
        "11421",
        "4"
      ]
    },
    {
      "id": "sahih-muslim-230-2",
      "hadith_no": "230",
      "source": "Sahih Muslim",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا قتيبة بن سعيد، وأبو بكر بن أبي شيبة وزهير بن حرب - واللفظ لقتيبة وأبي بكر - قالوا حدثنا وكيع، عن سفيان، عن أبي النضر، عن أبي أنس، أن عثمان، توضأ بالمقاعد فقال ألا أريكم وضوء رسول الله صلى الله عليه وسلم ثم توضأ ثلاثا ثلاثا ‏.‏ وزاد قتيبة في روايته قال سفيان قال أبو النضر عن أبي أنس قال وعنده رجال من أصحاب رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Abu Anas reported that Uthman performed ablution at Maqi'aid and said:                      Should I not show you the ablution performed by Allah's Messenger (may peace be upon him)? And he then washed (the different parts of the body) three times. 4\" Qutaiba has added in his narration the words:\" There were with him (with Uthman) Companions of Allah's Messenger (may peace be upon him).\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "30022",
        "20032",
        "20012",
        "11164",
        "4"
      ]
    },
    {
      "id": "sahih-muslim-231-2",
      "hadith_no": "231",
      "source": "Sahih Muslim",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا أبو كريب، محمد بن العلاء وإسحاق بن إبراهيم جميعا عن وكيع، قال أبو كريب حدثنا وكيع، عن مسعر، عن جامع بن شداد أبي صخرة، قال سمعت حمران بن أبان، قال كنت أضع لعثمان طهوره فما أتى عليه يوم إلا وهو يفيض عليه نطفة ‏.‏ وقال عثمان حدثنا رسول الله صلى الله عليه وسلم عند انصرافنا من صلاتنا هذه - قال مسعر أراها العصر - فقال ‏\"‏ ما أدري أحدثكم بشىء أو أسكت ‏\"‏ ‏.‏ فقلنا يا رسول الله إن كان خيرا فحدثنا وإن كان غير ذلك فالله ورسوله أعلم ‏.‏ قال ‏\"‏ ما من مسلم يتطهر فيتم الطهور الذي كتب الله عليه فيصلي هذه الصلوات الخمس إلا كانت كفارات لما بينها ‏\"‏ ‏.‏",
      "text_en": " Humran b. Abin reported:                      I used to fetch water for 'Uthman for his purification. Never was there a day that he did not take a bath with a small quantity of water. And Uthman said: The Messenger of Allah (may peace be upon him) at the time of our returning from our prayer told us (certain things pertaining to purification). Mis'ar said: I find that it was afternoon prayer. He said: I do not know whether I should tell you a thing or keep quiet. We said: Messenger of Allah, tell us if it is good and if it is otherwise, Allah and His Apostle know better. Upon this he said: A Muslim who purifies (himself) and completes purification as enjoined upon him by Allah and then offers the prayers, that will be expiatious (of his sins he committed) between these (prayers).",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20032",
        "20359",
        "11328",
        "11421",
        "4"
      ]
    },
    {
      "id": "sahih-muslim-231-3",
      "hadith_no": "231",
      "source": "Sahih Muslim",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي ح، وحدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، قالا جميعا حدثنا شعبة، عن جامع بن شداد، قال سمعت حمران بن أبان، يحدث أبا بردة في هذا المسجد في إمارة بشر أن عثمان بن عفان قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أتم الوضوء كما أمره الله تعالى فالصلوات المكتوبات كفارات لما بينهن ‏\"‏ ‏.‏ هذا حديث ابن معاذ وليس في حديث غندر في إمارة بشر ولا ذكر المكتوبات ‏.‏",
      "text_en": " Jami' b. Shaddad reported:                      I heard Humran b. Aban narrate to Abu Burda in this very mosque during the governorship of Bishr that 'Uthman b. Alfan said: The Messenger of Allah (may peace be upon him) observed: He who completed ablution as Allah, the Exalted, enjoined upon him, his obligatory prayers would be explatious (for his minor sins that he would commit) during (the interval) between them. This hadith is transmitted by Ibn Mu'adh, and in the hadith narrated by Ghundar, the words\" during the governorship of Bishr\" are omitted and there is no mention of the obligatory prayers.",
      "usc_msa_ref": "",
      "chain": [
        "30150",
        "20286",
        "30170",
        "30160",
        "20173",
        "20020",
        "11328",
        "11421",
        "4"
      ]
    },
    {
      "id": "sahih-muslim-232-2",
      "hadith_no": "232",
      "source": "Sahih Muslim",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا هارون بن سعيد الأيلي، حدثنا ابن وهب، قال وأخبرني مخرمة بن بكير، عن أبيه، عن حمران، مولى عثمان قال توضأ عثمان بن عفان يوما وضوءا حسنا ثم قال رأيت رسول الله صلى الله عليه وسلم توضأ فأحسن الوضوء ثم قال ‏\"‏ من توضأ هكذا ثم خرج إلى المسجد لا ينهزه إلا الصلاة غفر له ما خلا من ذنبه ‏\"‏ ‏.‏",
      "text_en": " Humran, the freed slave of Uthman reported:                      One day Uthman b. Affan performed the ablution well, and then said: I saw Allah's Messenger (may peace be upon him) perform ablution, the best ablution, and then observed: He who performed ablution like this and then went towards the mosque and nothing (but the love of) prayer urged him (to do so), all his previous (minor) sins would be expiated.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "20029",
        "20517",
        "11154",
        "11421",
        "4"
      ]
    },
    {
      "id": "sahih-muslim-232-3",
      "hadith_no": "232",
      "source": "Sahih Muslim",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثني أبو الطاهر، ويونس بن عبد الأعلى، قالا أخبرنا عبد الله بن وهب، عن عمرو بن الحارث، أن الحكيم بن عبد الله القرشي، حدثه أن نافع بن جبير وعبد الله بن أبي سلمة حدثاه أن معاذ بن عبد الرحمن حدثهما عن حمران، مولى عثمان بن عفان عن عثمان بن عفان، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من توضأ للصلاة فأسبغ الوضوء ثم مشى إلى الصلاة المكتوبة فصلاها مع الناس أو مع الجماعة أو في المسجد غفر الله له ذنوبه ‏\"‏ ‏.‏",
      "text_en": " Humran, the freed slave of 'Uthman b. 'Affan, reported on the authority of 'Uthman b. 'Affan that he heard Allah's Messenger (may peace be upon him) say:                      He who performed ablution for prayer and performed it properly and then went (to observe) obligatory prayer and offered it along with people or with the congregation or in the mosque, Allah would pardon his sins.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "30493",
        "20029",
        "20377",
        "11059",
        "10929",
        "11421",
        "4"
      ]
    },
    {
      "id": "sahih-muslim-245-2",
      "hadith_no": "245",
      "source": "Sahih Muslim",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن معمر بن ربعي القيسي، حدثنا أبو هشام المخزومي، عن عبد الواحد، - وهو ابن زياد - حدثنا عثمان بن حكيم، حدثنا محمد بن المنكدر، عن حمران، عن عثمان بن عفان، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من توضأ فأحسن الوضوء خرجت خطاياه من جسده حتى تخرج من تحت أظفاره ‏\"‏ ‏.‏",
      "text_en": " Uthman b. 'Affan reported:                      The Messenger of Allah (way peace be upon him) said: He who performed ablution well, his sins would come out from his body, even coming out from under his nails.",
      "usc_msa_ref": "",
      "chain": [
        "30172",
        "11034",
        "20256",
        "11889",
        "11048",
        "11421",
        "4"
      ]
    },
    {
      "id": "sahih-muslim-347-2",
      "hadith_no": "347",
      "source": "Sahih Muslim",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثني زهير بن حرب، وعبد بن حميد، قالا حدثنا عبد الصمد بن عبد الوارث، ح وحدثنا عبد الوارث بن عبد الصمد، - واللفظ له - حدثني أبي، عن جدي، عن الحسين بن ذكوان، عن يحيى بن أبي كثير، أخبرني أبو سلمة، أن عطاء بن يسار، أخبره أن زيد بن خالد الجهني أخبره أنه، سأل عثمان بن عفان قال قلت أرأيت إذا جامع الرجل امرأته ولم يمن قال عثمان ‏\"‏ يتوضأ كما يتوضأ للصلاة ويغسل ذكره ‏\"‏ ‏.‏ قال عثمان سمعته من رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Zaid b. Khalid al-Jubani reported that he askad Uthman b. 'Affan:                      What is your opinion about the man who has sexual intercourse with his wife, but does not experience orgasm? Uthman said: He should perform ablution as he does for prayer, and wash his organ. 'Uthmin also said: I have heard it from the Messenger of Allah (may peace be upon him).",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "30553",
        "20250",
        "20258",
        "11449",
        "10567",
        "11020",
        "3625",
        "4"
      ]
    },
    {
      "id": "sahih-muslim-1218",
      "hadith_no": "1218",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا زهير بن حرب، ومحمد بن المثنى، - واللفظ لابن المثنى - قالا حدثنا الضحاك بن مخلد، أخبرنا عبد الحميد بن جعفر، حدثني أبي، عن محمود بن لبيد، أن عثمان بن عفان، أراد بناء المسجد فكره الناس ذلك فأحبوا أن يدعه على هيئته فقال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من بنى مسجدا لله بنى الله له في الجنة مثله ‏\"‏ ‏.‏",
      "text_en": " Mahmud b. Labid reported:                      When 'Uthman b. 'Affan intended to build the mosque (of the Prophet) the people did not approve of it. They liked that it should be kept in the same state. Thereupon he said: I heard the Messenger of Allah (may peace be upon him) say: He who built a mosque for Allah, Allah would build a house for him like it in Paradise.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "30170",
        "11875",
        "11833",
        "1830",
        "4"
      ]
    },
    {
      "id": "sahih-muslim-2945",
      "hadith_no": "2945",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثناه إسحاق بن إبراهيم الحنظلي، حدثنا عبد الصمد بن عبد الوارث، حدثني أبي، حدثنا أيوب بن موسى، حدثني نبيه بن وهب، أن عمر بن عبيد الله بن معمر، رمدت عينه فأراد أن يكحلها، فنهاه أبان بن عثمان وأمره أن يضمدها بالصبر وحدث عن عثمان بن عفان عن النبي صلى الله عليه وسلم أنه فعل ذلك ‏.‏",
      "text_en": " Nubaih b Wahb reported that the eyes of Umar b. Ubaidnllah b. Ma'mar were swollen, and he decided to use antimony. Aban b. 'Uthman forbade him to do so and commanded him to apply aloes on them, and reported on the authority of 'Uthman b. Affan that the Apostle of Allah (may peace be upon him) had done that.",
      "usc_msa_ref": "",
      "chain": [
        "30021",
        "20250",
        "20258",
        "11241",
        "19965",
        "10582",
        "4"
      ]
    },
    {
      "id": "sahih-muslim-3512",
      "hadith_no": "3512",
      "source": "Sahih Muslim",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن نافع، عن نبيه بن وهب، أنفقال أبان سمعت عثمان بن عفان يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ لا ينكح المحرم ولا ينكح ولا يخطب ‏\"‏ ‏.‏",
      "text_en": " Nubaih b. Wahb reported that 'Umar b. Ubaidullah intended to marry Talha b. 'Umar with the daughter of Shaiba b. Jubair; so he sent a messenger to Aban b. Uthman to attend the marriage, and he was at that time the Amir of Hajj. Aban said:                      I heard 'Uthman b. 'Affan say that Allah's Messenger (may peace be upon him) had stated: A Muhrim must neither marry himself, nor arrange the marriage of another one, nor should he make the proposal of marriage.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "11014",
        "4"
      ]
    },
    {
      "id": "sahih-muslim-3514",
      "hadith_no": "3514",
      "source": "Sahih Muslim",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثني أبو غسان المسمعي، حدثنا عبد الأعلى، ح وحدثني أبو الخطاب، زياد بن يحيى حدثنا محمد بن سواء، قالا جميعا حدثنا سعيد، عن مطر، ويعلى بن حكيم، عن نافع، عن نبيه بن وهب، عن أبان بن عثمان، عن عثمان بن عفان، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا ينكح المحرم ولا ينكح ولا يخطب ‏\"‏ ‏.‏",
      "text_en": " Uthman b. 'Affan reported that Allah's Messenger (may peace be upon him) had said:                      A Muhrim should neither marry himself, nor should he be got married to anyone, nor should he make the proposal of marriage.",
      "usc_msa_ref": "",
      "chain": [
        "30456",
        "20246",
        "30135",
        "20565",
        "11168",
        "11567",
        "11014",
        "10582",
        "4"
      ]
    },
    {
      "id": "sahih-muslim-4142",
      "hadith_no": "4142",
      "source": "Sahih Muslim",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا أبو الطاهر، وهارون بن سعيد الأيلي، وأحمد بن عيسى، قالوا حدثنا ابن، وهب أخبرني مخرمة، عن أبيه، قال سمعت سليمان بن يسار، يقول إنه سمع مالك بن، أبي عامر يحدث عن عثمان بن عفان، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا تبيعوا الدينار بالدينارين ولا الدرهم بالدرهمين ‏\"‏ ‏.‏",
      "text_en": " 'Uthman b. 'Affan reported Allah's Messenger (may peace be upon him) as saying:                      Do not sell a dinar for two dinars and one dirham for two dirhams.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "30227",
        "11005",
        "4"
      ]
    },
    {
      "id": "sahih-muslim-7662",
      "hadith_no": "7662",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "حدثنا زهير بن حرب، ومحمد بن المثنى، كلاهما عن الضحاك، - قال ابن المثنى حدثنا الضحاك بن مخلد، - أخبرنا عبد الحميد بن جعفر، حدثني أبي، عن محمود بن لبيد، أن عثمان بن عفان، أراد بناء المسجد فكره الناس ذلك وأحبوا أن يدعه على هيئته فقال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من بنى مسجدا لله بنى الله له في الجنة مثله ‏\"‏ ‏.‏",
      "text_en": " Mahmud b. Labid reported that 'Uthman b. 'Affan decided to rebuild the mosque (of Allah's Apostle in Medina) but the people did not like this idea and they wished that it should be preserved in the same (old) form. Thereupon he (Hadrat 'Uthman) said:                      I heard Allah's Messenger (may peace be upon him) as saying: He who builds a mosque for Allah, Allah would build for him (a house) in Paradise like it.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "30170",
        "11875",
        "11833",
        "1830",
        "4"
      ]
    },
    {
      "id": "sunan-abi-daud-16",
      "hadith_no": "16",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عثمان، وأبو بكر ابنا أبي شيبة قالا حدثنا عمر بن سعد، عن سفيان، عن الضحاك بن عثمان، عن نافع، عن ابن عمر، قال مر رجل على النبي صلى الله عليه وسلم وهو يبول فسلم عليه فلم يرد عليه ‏.‏ قال أبو داود وروي عن ابن عمر وغيره أن النبي صلى الله عليه وسلم تيمم ثم رد على الرجل السلام ‏.‏",
      "text_en": " Narrated Ibn 'Umar :                     A man passed by the Prophet (sal Allaahu alayhi wa sallam ) while he was urinating, and saluted him. The Prophet (sal Allaahu alayhi wa sallam) did not return the salutation to him.Abu Dawud said : It is narrated on the authority of Ibn 'Umar that the  Prophet (sal Allaahu alayhi wa sallam) performed tayammum, then he returned the salutation to the man.",
      "usc_msa_ref": "",
      "chain": [
        "4",
        "20668",
        "20012",
        "20504",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-abi-daud-555",
      "hadith_no": "555",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا إسحاق بن يوسف، حدثنا سفيان، عن أبي سهل، - يعني عثمان بن حكيم - حدثنا عبد الرحمن بن أبي عمرة، عن عثمان بن عفان، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من صلى العشاء في جماعة كان كقيام نصف ليلة ومن صلى العشاء والفجر في جماعة كان كقيام ليلة ‏\"‏ ‏.‏",
      "text_en": " ‘Uthman b. ‘Affan reported the Messenger of Allah (may peace be him) as saying; if anyone says the night prayer in congregation, he is like one who keeps vigil (in prayer) till midnight; and he who says both the night and dawn prayer in congregation is like one who keeps vigil (in prayer) the whole night.",
      "usc_msa_ref": "",
      "chain": [
        "30007",
        "20411",
        "20012",
        "1238",
        "4"
      ]
    },
    {
      "id": "sunan-abi-daud-692",
      "hadith_no": "692",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عثمان بن أبي شيبة، ووهب بن بقية، وابن أبي خلف، وعبد الله بن سعيد، - قال عثمان - حدثنا أبو خالد، حدثنا عبيد الله، عن نافع، عن ابن عمر، أن النبي صلى الله عليه وسلم كان يصلي إلى بعيره ‏.‏",
      "text_en": " Ibn 'Umar said:                      The Prophet (ﷺ) used to pray facing his camel.",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "30569",
        "11184",
        "4",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-abi-daud-786",
      "hadith_no": "786",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "أخبرنا عمرو بن عون، أخبرنا هشيم، عن عوف، عن يزيد الفارسي، قال سمعت ابن عباس، قال قلت لعثمان بن عفان ما حملكم أن عمدتم، إلى براءة وهي من المئين وإلى الأنفال وهي من المثاني فجعلتموهما في السبع الطول ولم تكتبوا بينهما سطر ‏{‏ بسم الله الرحمن الرحيم ‏}‏ قال عثمان كان النبي صلى الله عليه وسلم مما ينزل عليه الآيات فيدعو بعض من كان يكتب له ويقول له ‏\"‏ ضع هذه الآية في السورة التي يذكر فيها كذا وكذا ‏\"‏ ‏.‏ وتنزل عليه الآية والآيتان فيقول مثل ذلك وكانت الأنفال من أول ما أنزل عليه بالمدينة وكانت براءة من آخر ما نزل من القرآن وكانت قصتها شبيهة بقصتها فظننت أنها منها فمن هناك وضعتهما في السبع الطول ولم أكتب بينهما سطر ‏{‏ بسم الله الرحمن الرحيم ‏}‏ ‏.‏",
      "text_en": " Narrated Uthman ibn Affan:                     :Yazid al-Farisi said: I heard Ibn Abbas say: I asked Uthman ibn Affan: What moved you to put the (Surah) al-Bara'ah which belongs to the mi'in (surahs) (containing one hundred verses) and the (Surah) al-Anfal which belongs to the mathani (Surahs) in the category of as-sab'u at-tiwal (the first long surah or chapters of the Qur'an), and you did not write \"In the name of Allah, the Compassionate, the Merciful\" between them?  Uthman replied: When the verses of the Qur'an were revealed to the Prophet (ﷺ), he called someone to write them down for him and said to him: Put this verse in the surah in which such and such has been mentioned; and when one or two verses were revealed, he used to say similarly (regarding them). (Surah) al-Anfal is the first surah that was revealed at Medina, and (Surah) al-Bara'ah was revealed last in the Qur'an, and its contents were similar to those of al-Anfal. I, therefore, thought that it was a part of al-Anfal. Hence I put them in the category of as-sab'u at-tiwal (the seven lengthy surahs), and I did not write \"In the name of Allah, the Compassionate, the Merciful\" between them.",
      "usc_msa_ref": "",
      "chain": [
        "30154",
        "20468",
        "11298",
        "14432",
        "17",
        "4"
      ]
    },
    {
      "id": "sunan-abi-daud-912",
      "hadith_no": "912",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، حدثنا أبو معاوية، ح وحدثنا عثمان بن أبي شيبة، حدثنا جرير، - وهذا حديثه وهو أتم - عن الأعمش، عن المسيب بن رافع، عن تميم بن طرفة الطائي، عن جابر بن سمرة، - قال عثمان - قال دخل رسول الله صلى الله عليه وسلم المسجد فرأى فيه ناسا يصلون رافعي أيديهم إلى السماء - ثم اتفقا - فقال ‏\"‏ لينتهين رجال يشخصون أبصارهم إلى السماء - قال مسدد في الصلاة - أو لا ترجع إليهم أبصارهم ‏\"‏ ‏.‏",
      "text_en": " Jabir b. Samurah said(this is the version of the narrator ‘Uthman):                      The Messenger of Allah(ﷺ) entered the mosque and saw there some people praying raising their hand towards the heaven. (This Is the common version: ) He said : People must stop raising their eyes to the heaven. The narrator Musaddad said: During prayer, otherwise their sight will be taken away.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20354",
        "30203",
        "20028",
        "11060",
        "11394",
        "10894",
        "393",
        "4"
      ]
    },
    {
      "id": "sunan-abi-daud-1452",
      "hadith_no": "1452",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن علقمة بن مرثد، عن سعد بن عبيدة، عن أبي عبد الرحمن، عن عثمان، عن النبي صلى الله عليه وسلم قال ‏\"‏ خيركم من تعلم القرآن وعلمه ‏\"‏ ‏.‏",
      "text_en": " 'Uthman reported the Prophet (ﷺ) as saying:                      The best among you is he who learns and teaches the Qur'an.",
      "usc_msa_ref": "",
      "chain": [
        "30329",
        "20020",
        "11374",
        "11344",
        "11359",
        "4"
      ]
    },
    {
      "id": "sunan-abi-daud-1838",
      "hadith_no": "1838",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا سفيان، عن أيوب بن موسى، عن نبيه بن وهب، قال اشتكى عمر بن عبيد الله بن معمر عينيه فأرسل إلى أبان بن عثمان - قال سفيان وهو أمير الموسم - ما يصنع بهما قال اضمدهما بالصبر فإني سمعت عثمان - رضى الله عنه - يحدث ذلك عن رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Nubaih bin Wahb said ‘Umar bin ‘Ubaid Allah bin Ma’mar had a complaint in his eyes. He sent (someone) to  Aban bin ‘Uthman  - the narrator Sufyan said that he was the chief of pilgrims during the season of Hajj – asking him what he should do with them. He said Apply aloes to them, for I heard ‘Uthaman narrating this on the authority of the Apostle of Allaah(ﷺ).",
      "usc_msa_ref": "",
      "chain": [
        "30007",
        "20005",
        "11241",
        "19965",
        "4"
      ]
    },
    {
      "id": "sunan-abi-daud-1842",
      "hadith_no": "1842",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا قتيبة بن سعيد، أن محمد بن جعفر، حدثهم حدثنا سعيد، عن مطر، ويعلى بن حكيم، عن نافع، عن نبيه بن وهب، عن أبان بن عثمان، عن عثمان، أن رسول الله صلى الله عليه وسلم ذكر مثله زاد ‏\"‏ ولا يخطب ‏\"‏ ‏.‏",
      "text_en": " The aforesaid tradition has also been transmitted by Aban bin ‘Uthman on the authority of ‘Uthman from the Apostle of Allaah(ﷺ) in a similar manner. This version adds “And he should not make a betrothal”",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20173",
        "11168",
        "11567",
        "11014",
        "19965",
        "10582",
        "4"
      ]
    },
    {
      "id": "sunan-abi-daud-1964",
      "hadith_no": "1964",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، عن أيوب، عن الزهري، أن عثمان بن عفان، أتم الصلاة بمنى من أجل الأعراب لأنهم كثروا عامئذ فصلى بالناس أربعا ليعلمهم أن الصلاة أربع ‏.‏",
      "text_en": " Narrated Az-Zuhri:                     Uthman offered complete prayer at Mina for the sake of bedouins who attended (hajj) in large numbers that year. He led the people four rak'ahs in prayer in order to teach them that the prayer (i.e. noon or afternoon prayer) essentially contained four rak'ahs.",
      "usc_msa_ref": "",
      "chain": [
        "20040",
        "20022",
        "11015",
        "11013",
        "4"
      ]
    },
    {
      "id": "sunan-abi-daud-2684",
      "hadith_no": "2684",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن العلاء، قال حدثنا زيد بن حباب، قال أخبرنا عمرو بن عثمان بن عبد الرحمن بن سعيد بن يربوع المخزومي، قال حدثني جدي، عن أبيه، أن رسول الله صلى الله عليه وسلم قال يوم فتح مكة ‏\"‏ أربعة لا أؤمنهم في حل ولا حرم ‏\"‏ ‏.‏ فسماهم ‏.‏ قال وقينتين كانتا لمقيس فقتلت إحداهما وأفلتت الأخرى فأسلمت ‏.‏ قال أبو داود لم أفهم إسناده من ابن العلاء كما أحب ‏.‏",
      "text_en": " Narrated Sa'id ibn Yarbu' al-Makhzumi:                     The Prophet (ﷺ) said: on the day of the conquest of Mecca: There are four persons whom I shall not give protection in the sacred and non-sacred territory. He then named them. There were two singing girls of al-Maqis; one of them was killed and the other escaped and embraced Islam.Abu Dawud said: I could not understand its chain of narrators from Ibn al-'Ala' as I liked.",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20650",
        "10581",
        "4"
      ]
    },
    {
      "id": "sunan-abi-daud-3221",
      "hadith_no": "3221",
      "source": "Sunan Abi Da'ud",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا إبراهيم بن موسى الرازي، حدثنا هشام، عن عبد الله بن بحير، عن هانئ، مولى عثمان عن عثمان بن عفان، قال كان النبي صلى الله عليه وسلم إذا فرغ من دفن الميت وقف عليه فقال ‏\"‏ استغفروا لأخيكم وسلوا له التثبيت فإنه الآن يسأل ‏\"‏ ‏.‏ قال أبو داود بحير بن ريسان ‏.‏",
      "text_en": " Narrated Uthman ibn Affan:                     Whenever the Prophet (ﷺ) became free from burying the dead, he used to stay at him (i.e. his grave) and say: Seek forgiveness for your brother, and beg steadfastness for him, for he will be questioned now.Abu Dawud said: The full name of the narrator Buhair is Buhair b. Raisan.",
      "usc_msa_ref": "",
      "chain": [
        "30309",
        "20295",
        "28278",
        "4"
      ]
    },
    {
      "id": "sunan-abi-daud-3344",
      "hadith_no": "3344",
      "source": "Sunan Abi Da'ud",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا عثمان بن أبي شيبة، وقتيبة بن سعيد، عن شريك، عن سماك، عن عكرمة، رفعه - قال عثمان وحدثنا وكيع، عن شريك، عن سماك، عن عكرمة، - عن ابن عباس، عن النبي صلى الله عليه وسلم مثله قال اشترى من عير تبيعا وليس عنده ثمنه فأربح فيه فباعه فتصدق بالربح على أرامل بني عبد المطلب وقال لا أشتري بعدها شيئا إلا وعندي ثمنه ‏.‏",
      "text_en": " A similar tradition has also been transmitted by Ibn 'Abbas though a different chain of narrators. This version says:                      \"He (the Prophet) purchased a calf from a caravan, but he had no money with him. He then sold it with some profit and gave the profit in charity to the poor and widows of Banu 'Abd al-Muttalib. He then said: I shall not buy anything after this but only when I have money with me.",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "30367",
        "20587",
        "10770",
        "4",
        "20032",
        "11858",
        "10770",
        "11023",
        "17"
      ]
    },
    {
      "id": "sunan-abi-daud-4258",
      "hadith_no": "4258",
      "source": "Sunan Abi Da'ud",
      "chapter": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim) - كتاب الفتن والملاحم",
      "chapter_no": "37",
      "text_ar": "حدثنا عمرو بن عثمان، حدثنا أبي، حدثنا شهاب بن خراش، عن القاسم بن غزوان، عن إسحاق بن راشد الجزري، عن سالم، حدثني عمرو بن وابصة الأسدي، عن أبيه، وابصة، عن ابن مسعود، قال سمعت رسول الله صلى الله عليه وسلم يقول فذكر بعض حديث أبي بكرة قال ‏\"‏ قتلاها كلهم في النار ‏\"‏ ‏.‏ قال فيه قلت متى ذلك يا ابن مسعود قال تلك أيام الهرج حيث لا يأمن الرجل جليسه ‏.‏ قلت فما تأمرني إن أدركني ذلك الزمان قال تكف لسانك ويدك وتكون حلسا من أحلاس بيتك ‏.‏ فلما قتل عثمان طار قلبي مطاره فركبت حتى أتيت دمشق فلقيت خريم بن فاتك فحدثته فحلف بالله الذي لا إله إلا هو لسمعه من رسول الله صلى الله عليه وسلم كما حدثنيه ابن مسعود ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud ; Khuraym ibn Fatik:                     The tradition mentioned above (No. 4243) has also been transmitted by Ibn Mas'ud through a different chain of narrators.  Ibn Mas'ud said: I heard the Prophet (ﷺ) say: He then mentioned a portion of the tradition narrated by AbuBakrah (No. 4243).  This version adds: He (the Prophet) said: All their slain will go to Hell.  I (Wabisah) asked: When will this happen Ibn Mas'ud?  He replied: This is the period of turmoil (harj) when a man will not be safe from his associates.  I asked: What do you command me (to do) if I happen to live during that period?  He replied: You should restrain your tongue and hand and stay at home.  When Uthman was slain, I recollected this tradition. I then rode (on a camel) and came to Damascus. There I met Khuraym ibn Fatik and mentioned this tradition to him. He swore by Allah, there was no god but He, he had heard it from the Messenger of Allah (ﷺ), as Ibn Mas'ud transmitted it to me (Wabisah).",
      "usc_msa_ref": "",
      "chain": [
        "10581",
        "4",
        "25124",
        "28486",
        "20409",
        "11011",
        "18",
        "16"
      ]
    },
    {
      "id": "sunan-abi-daud-4554",
      "hadith_no": "4554",
      "source": "Sunan Abi Da'ud",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا محمد بن عبد الله، حدثنا سعيد، عن قتادة، عن عبد ربه، عن أبي عياض، عن عثمان بن عفان، وزيد بن ثابت، في المغلظة أربعون جذعة خلفة وثلاثون حقة وثلاثون بنات لبون وفي الخطإ ثلاثون حقة وثلاثون بنات لبون وعشرون بنو لبون ذكور وعشرون بنات مخاض ‏.‏",
      "text_en": " Narrated Zaid b. Thabit:                     About the bloodwit for quasi-intentional murder..... He then mentioned a similar tradition as mentioned above.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "30561",
        "11168",
        "11019",
        "11714",
        "4"
      ]
    },
    {
      "id": "sunan-abi-daud-4808",
      "hadith_no": "4808",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا عثمان، وأبو بكر ابنا أبي شيبة ومحمد بن الصباح البزاز قالوا حدثنا شريك، عن المقدام بن شريح، عن أبيه، قال سألت عائشة عن البداوة، فقالت كان رسول الله صلى الله عليه وسلم يبدو إلى هذه التلاع وإنه أراد البداوة مرة فأرسل إلى ناقة محرمة من إبل الصدقة فقال لي ‏\"‏ يا عائشة ارفقي فإن الرفق لم يكن في شىء قط إلا زانه ولا نزع من شىء قط إلا شانه ‏\"‏ ‏.‏ قال ابن الصباح في حديثه محرمة يعني لم تركب ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     Al-Miqdam ibn Shurayh, quoting his father, said: I asked Aisha about living in the desert. She said: The Messenger of Allah (ﷺ) used to go to the desert to these rivulets. Once he intended to go to the desert and he sent to me a she-camel from the camel of sadaqah which had not been used for riding so far. He said to me: Aisha! show gentleness, for if gentleness is found in anything, it beautifies it and when it is taken out from anything it damages it.Ibn al-Sabbah said in his version: Muharramah means a mount which has not been used for riding.",
      "usc_msa_ref": "",
      "chain": [
        "4",
        "11858",
        "10830",
        "10774",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-5088",
      "hadith_no": "5088",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا عبد الله بن مسلمة، حدثنا أبو مودود، عمن سمع أبان بن عثمان، يقول سمعت عثمان، - يعني ابن عفان - يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من قال بسم الله الذي لا يضر مع اسمه شىء في الأرض ولا في السماء وهو السميع العليم ثلاث مرات لم تصبه فجأة بلاء حتى يصبح ومن قالها حين يصبح ثلاث مرات لم تصبه فجأة بلاء حتى يمسي ‏\"‏ ‏.‏ قال فأصاب أبان بن عثمان الفالج فجعل الرجل الذي سمع منه الحديث ينظر إليه فقال له ما لك تنظر إلى فوالله ما كذبت على عثمان ولا كذب عثمان على النبي صلى الله عليه وسلم ولكن اليوم الذي أصابني فيه ما أصابني غضبت فنسيت أن أقولها ‏.‏",
      "text_en": " Narrated Uthman ibn Affan:                     Aban ibn Uthman said: I heard Uthman ibn Affan (his father) say: I heard the Messenger of Allah (ﷺ) say: If anyone says three times: \"In the name of Allah, when Whose name is mentioned nothing on Earth or in Heaven can cause harm, and He is the Hearer, the Knower\" he will not suffer sudden affliction till the morning, and if anyone says this in the morning, he will not suffer sudden affliction till the evening.  Aban was afflicted by some paralysis and when a man who heard the tradition began to look at him, he said to him: Why are you looking at me? I swear by Allah, I did not tell a lie about Uthman, nor did Uthman tell a lie about the Prophet (ﷺ), but that day when I was afflicted by it, I became angry and forgot to say them.",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "10582",
        "4"
      ]
    },
    {
      "id": "sunan-abi-daud-5089",
      "hadith_no": "5089",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا نصر بن عاصم الأنطاكي، حدثنا أنس بن عياض، قال حدثني أبو مودود، عن محمد بن كعب، عن أبان بن عثمان، عن عثمان، عن النبي صلى الله عليه وسلم نحوه لم يذكر قصة الفالج ‏.‏",
      "text_en": " A similar tradition has been transmitted by Aban b. ‘Uthman, from ‘Uthman, from the prophet (May peace be upon him). This version does not mention the story of paralysis.",
      "usc_msa_ref": "",
      "chain": [
        "38662",
        "20157",
        "11221",
        "10582",
        "4"
      ]
    },
    {
      "id": "jami-al-tirmidhi-31",
      "hadith_no": "31",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا يحيى بن موسى، حدثنا عبد الرزاق، عن إسرائيل، عن عامر بن شقيق، عن أبي وائل، عن عثمان بن عفان، أن النبي صلى الله عليه وسلم كان يخلل لحيته ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " 'Uthman bin Affan narrated that :                     the Prophet would go through his beard.\"",
      "usc_msa_ref": "",
      "chain": [
        "30221",
        "20121",
        "20311",
        "15261",
        "11353",
        "4"
      ]
    },
    {
      "id": "jami-al-tirmidhi-221",
      "hadith_no": "221",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا بشر بن السري، حدثنا سفيان، عن عثمان بن حكيم، عن عبد الرحمن بن أبي عمرة، عن عثمان بن عفان، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من شهد العشاء في جماعة كان له قيام نصف ليلة ومن صلى العشاء والفجر في جماعة كان له كقيام ليلة ‏\"‏ ‏.‏ قال وفي الباب عن ابن عمر وأبي هريرة وأنس وعمارة بن رويبة وجندب بن عبد الله بن سفيان البجلي وأبى بن كعب وأبي موسى وبريدة ‏.‏ قال أبو عيسى حديث عثمان حديث حسن ‏.‏ وقد روي هذا الحديث عن عبد الرحمن بن أبي عمرة عن عثمان موقوفا وروي من غير وجه عن عثمان مرفوعا ‏.‏",
      "text_en": " Uthman bin Affan narrated that :                     Allah's Messenger said: \"Whoever attends Isha (prayer) in congregation, then he has (the reward as if he had) stood half of the night. And whoever prays Isha and Fajr in congregation, then he has (the reward as if he had) spend the entire night standing (in prayer).\"",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20190",
        "20012",
        "11889",
        "1238",
        "4"
      ]
    },
    {
      "id": "jami-al-tirmidhi-318",
      "hadith_no": "318",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا بندار، حدثنا أبو بكر الحنفي، حدثنا عبد الحميد بن جعفر، عن أبيه، عن محمود بن لبيد، عن عثمان بن عفان، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ من بنى لله مسجدا بنى الله له مثله في الجنة ‏\"‏ ‏.‏ قال وفي الباب عن أبي بكر وعمر وعلي وعبد الله بن عمرو وأنس وابن عباس وعائشة وأم حبيبة وأبي ذر وعمرو بن عبسة وواثلة بن الأسقع وأبي هريرة وجابر بن عبد الله ‏.‏ قال أبو عيسى حديث عثمان حديث حسن صحيح ‏.‏ ومحمود بن لبيد قد أدرك النبي صلى الله عليه وسلم ومحمود بن الربيع قد رأى النبي صلى الله عليه وسلم وهما غلامان صغيران مدنيان ‏.‏",
      "text_en": " Uthman bin Affan narrated that :                     he heard Allah's Messenger say: \"Whoever builds a Masjid for (the sake of) Allah, then Allah will build a similar house for him in Paradise.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20254",
        "11875",
        "11833",
        "1830",
        "4"
      ]
    },
    {
      "id": "jami-al-tirmidhi-411",
      "hadith_no": "411",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا يحيى بن موسى، حدثنا شبابة بن سوار، حدثنا عمر بن الرماح البلخي، عن كثير بن زياد، عن عمرو بن عثمان بن يعلى بن مرة، عن أبيه، عن جده، أنهم كانوا مع النبي صلى الله عليه وسلم في مسير فانتهوا إلى مضيق وحضرت الصلاة فمطروا السماء من فوقهم والبلة من أسفل منهم فأذن رسول الله صلى الله عليه وسلم وهو على راحلته وأقام - أو أقام - فتقدم على راحلته فصلى بهم يومئ إيماء يجعل السجود أخفض من الركوع ‏.‏ قال أبو عيسى هذا حديث غريب تفرد به عمر بن الرماح البلخي لا يعرف إلا من حديثه ‏.‏ وقد روى عنه غير واحد من أهل العلم ‏.‏ وكذلك روي عن أنس بن مالك أنه صلى في ماء وطين على دابته ‏.‏ والعمل على هذا عند أهل العلم وبه يقول أحمد وإسحاق ‏.‏",
      "text_en": " Amr bin Uthman bin Ya'la bin Murrah narrated from his father, from his grand-father that :                     They were with the Prophet (S) on a journey. They wound up in a narrow area when Salat became due. Then it began raining from the sky above them, and it was wet beneath them. So Allah's Messenger (S) called the Adhan while he was on his mount, and then the Iqamah, going forward on his mount. He let them in Salat by making gestures, making his prostrations lower than his bowing.",
      "usc_msa_ref": "",
      "chain": [
        "30221",
        "20426",
        "14330",
        "10581",
        "4"
      ]
    },
    {
      "id": "jami-al-tirmidhi-952",
      "hadith_no": "952",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان بن عيينة، عن أيوب بن موسى، عن نبيه بن وهب، أن عمر بن عبيد الله بن معمر، اشتكى عينيه وهو محرم فسأل أبان بن عثمان فقال اضمدهما بالصبر فإني سمعت عثمان بن عفان، يذكرها عن رسول الله صلى الله عليه وسلم يقول ‏\"‏ اضمدهما بالصبر ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ والعمل على هذا عند أهل العلم لا يرون بأسا أن يتداوى المحرم بدواء ما لم يكن فيه طيب ‏.‏",
      "text_en": " Nubaih bin Wahb narrated that :                     Umar bin Ubaidullah bin Ma'mar was complaining about his eyes while he was a Muhrim. He asked Aban bin Uthman about it and he said: \"Bandage it with some aloes, for I heard Uthman bin Affan mentioning that the Messenger of Allah said: 'Bandage it with aloes.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30421",
        "20005",
        "11241",
        "19965",
        "4"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1322",
      "hadith_no": "1322",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Chapters On Judgements From The Messenger of Allah - كتاب الأحكام عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن عبد الأعلى الصنعاني، حدثنا المعتمر بن سليمان، قال سمعت عبد الملك، يحدث عن عبد الله بن موهب، أن عثمان، قال لابن عمر اذهب فاقض بين الناس ‏.‏ قال أوتعافيني يا أمير المؤمنين ‏.‏ قال وما تكره من ذلك وقد كان أبوك يقضي قال إني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من كان قاضيا فقضى بالعدل فبالحري أن ينقلب منه كفافا ‏\"‏ ‏.‏ فما أرجو بعد ذلك وفي الحديث قصة ‏.‏ وفي الباب عن أبي هريرة ‏.‏ قال أبو عيسى حديث ابن عمر حديث غريب وليس إسناده عندي بمتصل ‏.‏ وعبد الملك الذي روى عنه المعتمر هذا هو عبد الملك بن أبي جميلة ‏.‏",
      "text_en": " 'Abdullah bin Mawhab narrated that 'Uthman said to Ibn 'Umar:                      \"Go and judge between the people.\" So he said: \"Perhaps you can excuse me (from that) O Commander of the Believers!\" He said: \"Why do you have an aversion for that when your father judged?\" He said: \"I heard the Messenger of Allah saying: 'Whoever was a judge and judged with justice, it still would have been better for him to have turned away from it completely.' What do I want after that?'\" (Daif).",
      "usc_msa_ref": "",
      "chain": [
        "20288",
        "11368",
        "19811",
        "4"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1667",
      "hadith_no": "1667",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Virtues of Jihad - كتاب فضائل الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "22",
      "text_ar": "حدثنا الحسن بن علي الخلال، حدثنا هشام بن عبد الملك، حدثنا الليث بن سعد، حدثني أبو عقيل، زهرة بن معبد عن أبي صالح، مولى عثمان بن عفان قال سمعت عثمان، وهو على المنبر يقول إني كتمتكم حديثا سمعته من رسول الله صلى الله عليه وسلم كراهية تفرقكم عني ثم بدا لي أن أحدثكموه ليختار امرؤ لنفسه ما بدا له سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ رباط يوم في سبيل الله خير من ألف يوم فيما سواه من المنازل ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏ وقال محمد بن إسماعيل أبو صالح مولى عثمان اسمه تركان ‏.‏",
      "text_en": " Narrated Abu Salih, the Freed slave of Uthman :                     \"I heard Uthman while on the Minbar saying: 'I did not inform you about a Hadith I had heard from the Messenger of Allah (ﷺ), out of dismay that you might part from me. Then it occurred to me that I should narrate to you so that one may choose from these matters accordingly. I heard the Messenger of Allah (ﷺ) saying: \"(Ribat) Guarding the frontier for a day in Allah's cause is beter in status than thousand days doing other than that.'\"[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib.Muhammad bin Ism'ail said: \"Abu Salih, the freed slave of 'Uthman's name is Burkan.\"",
      "usc_msa_ref": "",
      "chain": [
        "30115",
        "20023",
        "11507",
        "4"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2158-2",
      "hadith_no": "2158",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا أحمد بن عبدة الضبي، حدثنا حماد بن زيد، عن يحيى بن سعيد، عن أبي أمامة بن سهل بن حنيف، أن عثمان بن عفان، أشرف يوم الدار فقال أنشدكم الله أتعلمون أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يحل دم امرئ مسلم إلا بإحدى ثلاث زنا بعد إحصان أو ارتداد بعد إسلام أو قتل نفس بغير حق فقتل به ‏\"‏ ‏.‏ فوالله ما زنيت في جاهلية ولا في إسلام ولا ارتددت منذ بايعت رسول الله صلى الله عليه وسلم ولا قتلت النفس التي حرم الله فبم تقتلونني قال أبو عيسى وفي الباب عن ابن مسعود وعائشة وابن عباس ‏.‏ وهذا حديث حسن ‏.‏ ورواه حماد بن سلمة عن يحيى بن سعيد فرفعه ‏.‏ وروى يحيى بن سعيد القطان وغير واحد عن يحيى بن سعيد هذا الحديث فأوقفوه ولم يرفعوه وقد روي هذا الحديث من غير وجه عن عثمان عن النبي صلى الله عليه وسلم مرفوعا ‏.",
      "text_en": " Abu Umamah bin Sahl bin Hunaif narrated that on the day of siege, 'Uthman bin 'Affan stood overlooking the people, and he said:                     \"I swear to you by Allah! You know that the Messenger of Allah (s.a.w) said:'The blood of a Muslim man is not lawful, except for one of three (cases):Illegitimate sexual relations after Ihsan (having been married), or apostasy after Islam, or taking a life without right, for which he is killed.'\tBy Allah! I have never committed illegitimate sexual relations, not during Jahiliyyah nor during Islam, and I have not committed apostasy since I gave my pledge to the Messenger of Allah (s.a.w), and I have not taken a life that Allah had made unlawful. So for what do you fight me?\"'",
      "usc_msa_ref": "",
      "chain": [
        "30423",
        "20022",
        "20031",
        "405",
        "4"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2341",
      "hadith_no": "2341",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا عبد بن حميد، حدثنا عبد الصمد بن عبد الوارث، حدثنا حريث بن السائب، قال سمعت الحسن، يقول حدثني حمران بن أبان، عن عثمان بن عفان، أن النبي صلى الله عليه وسلم قال ‏\"‏ ليس لابن آدم حق في سوى هذه الخصال بيت يسكنه وثوب يواري عورته وجلف الخبز والماء ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح وهو حديث الحريث بن السائب ‏.‏ وسمعت أبا داود سليمان بن سلم البلخي يقول قال النضر بن شميل جلف الخبز يعني ليس معه إدام ‏.‏",
      "text_en": " 'Uthman bin 'Affan narrated that the Prophet (s.a.w) said:                     \"There is no right for the son of Adam in other than these things: A house which he lives in, a garment which covers his nakedness, and Jilf (a piece of bread) and water.\"",
      "usc_msa_ref": "",
      "chain": [
        "30553",
        "20250",
        "11016",
        "11421",
        "4"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3154",
      "hadith_no": "3154",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on The Virtues of the Qur'an - كتاب فضائل القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود، أنبأنا شعبة، أخبرني علقمة بن مرثد، قال سمعت سعد بن عبيدة، يحدث عن أبي عبد الرحمن، عن عثمان بن عفان، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ خيركم من تعلم القرآن وعلمه ‏\"‏ ‏.‏ قال أبو عبد الرحمن فذاك الذي أقعدني مقعدي هذا ‏.‏ وعلم القرآن في زمن عثمان حتى بلغ الحجاج بن يوسف ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Abu 'Abdur-Rahman:                     from 'Uthman bin 'Affan that the Messenger of Allah (ﷺ) said: \"The best of you is he who learns the Qur'an and teaches it.\" Abu 'Abdur-Rahman said: \"So that is why I sit at this seat of mine.\" And he taught the Qur'an during the time of 'Uthman until Al-Hajjaj bin Yusuf came.",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20547",
        "20020",
        "11374",
        "11344",
        "11359",
        "4"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3155",
      "hadith_no": "3155",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on The Virtues of the Qur'an - كتاب فضائل القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا بشر بن السري، حدثنا سفيان، عن علقمة بن مرثد، عن أبي عبد الرحمن السلمي، عن عثمان بن عفان، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ خيركم - أو أفضلكم - من تعلم القرآن وعلمه ‏\"‏ ‏.‏ هذا حديث حسن صحيح ‏.‏ وهكذا روى عبد الرحمن بن مهدي وغير واحد عن سفيان الثوري عن علقمة بن مرثد عن أبي عبد الرحمن عن عثمان عن النبي صلى الله عليه وسلم وسفيان لا يذكر فيه عن سعد بن عبيدة ‏.‏",
      "text_en": " Narrated 'Uthman [bin 'Affan]:                     that the Messenger of Allah (ﷺ) said: \"The best of you - or the most virtuous of you - is he who learns the Qur'an and teaches it.\"",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20190",
        "20012",
        "11374",
        "11359",
        "4"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3156",
      "hadith_no": "3156",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on The Virtues of the Qur'an - كتاب فضائل القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "45",
      "text_ar": "وقد روى يحيى بن سعيد القطان، هذا الحديث عن سفيان، وشعبة، عن علقمة بن مرثد، عن سعد بن عبيدة، عن أبي عبد الرحمن، عن عثمان، عن النبي صلى الله عليه وسلم حدثنا بذلك، محمد بن بشار حدثنا يحيى بن سعيد، عن سفيان، وشعبة، ‏.‏ قال محمد بن بشار وهكذا ذكره يحيى بن سعيد عن سفيان، وشعبة، غير مرة عن علقمة بن مرثد، عن سعد بن عبيدة، عن أبي عبد الرحمن، عن عثمان، عن النبي صلى الله عليه وسلم قال محمد بن بشار وأصحاب سفيان لا يذكرون فيه عن سفيان عن سعد بن عبيدة ‏.‏ قال محمد بن بشار وهو أصح ‏.‏ قال أبو عيسى وقد زاد شعبة في إسناد هذا الحديث سعد بن عبيدة وكأن حديث سفيان أصح ‏.‏ قال علي بن عبد الله قال يحيى بن سعيد ما أحد يعدل عندي شعبة وإذا خالفه سفيان أخذت بقول سفيان ‏.‏ قال أبو عيسى سمعت أبا عمار يذكر عن وكيع قال قال شعبة سفيان أحفظ مني وما حدثني سفيان عن أحد بشيء فسألته إلا وجدته كما حدثني ‏.‏ وفي الباب عن علي وسعد ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "20012",
        "20020",
        "11374",
        "11344",
        "11359",
        "4"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3388-2",
      "hadith_no": "3388",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو داود، - وهو الطيالسي حدثنا عبد الرحمن بن أبي الزناد، عن أبيه، عن أبان بن عثمان، قال سمعت عثمان بن عفان، رضى الله عنه يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ ما من عبد يقول في صباح كل يوم ومساء كل ليلة بسم الله الذي لا يضر مع اسمه شيء في الأرض ولا في السماء وهو السميع العليم ثلاث مرات فيضره شيء ‏\"‏ ‏.‏ وكان أبان قد أصابه طرف فالج فجعل الرجل ينظر إليه فقال له أبان ما تنظر أما إن الحديث كما حدثتك ولكني لم أقله يومئذ ليمضي الله على قدره ‏.‏ قال هذا حديث حسن صحيح غريب ‏.‏",
      "text_en": " Aban bin Uthman said:                      “I heard Uthman bin Affan [may Allah be pleased with him] saying:‘The Messenger of Allah said: “There is no worshipper who says, in the morning of every day, and the evening of every night: ‘In the Name of Allah, who with His Name, nothing in the earth or the heavens can cause harm, and He is the Hearing, the Knowing (Bismillah, Alladhi La Yadurru Ma`a Ismihi Shai'un Fil-Ardi Wa La Fis-Sama', Wa Huwas-Sami`ul Alim)’ – three times, (except that) nothing shall harm him.”And Aban had been stricken with a type of semi-paralysis, so a man began to look at him, so Aban said to him, “What are you looking at? Indeed the Hadith is as I reported it to you, but I did not say it one day, so Allah brought about His decree upon me.”",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20547",
        "20509",
        "11061",
        "10582",
        "4"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4307",
      "hadith_no": "4307",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا عبد بن حميد، حدثنا محمد بن بشر العبدي، حدثنا عبد الله بن عبد الله بن الأسود، عن حصين بن عمر الأحمسي، عن مخارق بن عبد الله، عن طارق بن شهاب، عن عثمان بن عفان، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من غش العرب لم يدخل في شفاعتي ولم تنله مودتي ‏\"‏ ‏.‏ قال هذا حديث غريب لا نعرفه إلا من حديث حصين بن عمر الأحمسي عن مخارق ‏.‏ وليس حصين عند أهل الحديث بذاك القوي ‏.‏",
      "text_en": " Narrated 'Uthman bin 'Affan:                     that the Messenger of Allah (ﷺ) said: \"Whoever cheats the Arabs, he will not be included in my intercession, and my love shall not reach him.\"",
      "usc_msa_ref": "",
      "chain": [
        "30553",
        "20352",
        "25146",
        "25062",
        "11652",
        "3680",
        "4"
      ]
    },
    {
      "id": "sunan-an-nasai-146",
      "hadith_no": "146",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا خالد، عن شعبة، عن جامع بن شداد، قال سمعت حمران بن أبان، أخبر أبا بردة، في المسجد أنه سمع عثمان، يحدث عن رسول الله صلى الله عليه وسلم يقول ‏\"‏ من أتم الوضوء كما أمره الله عز وجل فالصلوات الخمس كفارات لما بينهن ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Jami' bin Shaddad said:                      \"I heard Humran bin Aban tell Abu Burdah in the Masjid that he heard 'Uthman narrating that the Messenger of Allah (ﷺ) said: 'Whoever performs Wudu' completely as commanded by Allah, the five daily prayers will be an expiation for whatever comes in between them.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30449",
        "20423",
        "20020",
        "11328",
        "11421",
        "4"
      ]
    },
    {
      "id": "sunan-an-nasai-147",
      "hadith_no": "147",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا قتيبة، عن مالك، عن هشام بن عروة، عن أبيه، عن حمران، مولى عثمان أن عثمان، - رضى الله عنه - قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ما من امرئ يتوضأ فيحسن وضوءه ثم يصلي الصلاة إلا غفر له ما بينه وبين الصلاة الأخرى حتى يصليها ‏\"‏ ‏.‏",
      "text_en": " 'Uthman said:                      \"I heard the Messenger of Allah (ﷺ) say: 'There is no man who performs Wudu' and does it well, then prays, but when he prays it, he will be forgiven whatever (sins he commits) between that and the next prayer.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20001",
        "11065",
        "10511",
        "11421",
        "4"
      ]
    },
    {
      "id": "sunan-an-nasai-540",
      "hadith_no": "540",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرني عمرو بن عثمان، قال حدثنا ابن حمير، قال حدثنا ابن أبي عبلة، عن الزهري، وأخبرني عمرو بن عثمان، قال حدثني أبي، عن شعيب، عن الزهري، عن عروة، عن عائشة، قالت أعتم رسول الله صلى الله عليه وسلم ليلة بالعتمة فناداه عمر رضى الله عنه نام النساء والصبيان ‏.‏ فخرج رسول الله صلى الله عليه وسلم وقال ‏\"‏ ما ينتظرها غيركم ‏\"‏ ‏.‏ ولم يكن يصلى يومئذ إلا بالمدينة ثم قال ‏\"‏ صلوها فيما بين أن يغيب الشفق إلى ثلث الليل ‏\"‏ ‏.‏ واللفظ لابن حمير ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                      \"The Messenger of Allah (ﷺ) delayed A;-'Atamah one night, and 'Umar, may Allah be pleased with him, called out to him: 'The women and children have gone to sleep.' The Messenger of Allah (ﷺ) came out and said: 'No one is waiting for it except you.' At that time no prayer was offered except in Al-Madinah. Then he said: 'Pray it between the time when the twilight disappears and when one-third of the night has passed.'\"",
      "usc_msa_ref": "",
      "chain": [
        "10581",
        "11013",
        "10581",
        "4",
        "20428",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-856",
      "hadith_no": "856",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا سليمان بن داود، عن ابن وهب، قال أخبرني عمرو بن الحارث، أن الحكيم بن عبد الله القرشي، حدثه أن نافع بن جبير وعبد الله بن أبي سلمة حدثاه أن معاذ بن عبد الرحمن حدثهما عن حمران، مولى عثمان بن عفان عن عثمان بن عفان، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من توضأ للصلاة فأسبغ الوضوء ثم مشى إلى الصلاة المكتوبة فصلاها مع الناس أو مع الجماعة أو في المسجد غفر الله له ذنوبه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Uthman bin 'Affan said:                      \"I heard the Messenger of Allah (ﷺ) say: 'Whoever does wudu' properly, then walks to (attend) the prescribed prayer, and prays with the people or with the congregation or in the Masjid, Allah will forgive him his sins.\"",
      "usc_msa_ref": "",
      "chain": [
        "30584",
        "20029",
        "20377",
        "11059",
        "11421",
        "4"
      ]
    },
    {
      "id": "sunan-an-nasai-1118",
      "hadith_no": "1118",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا أبو داود، سليمان بن سيف قال حدثنا أبو علي الحنفي، وعثمان بن عمر، قال أبو علي حدثنا وقال، عثمان أنبأنا داود بن قيس، عن إبراهيم بن عبد الله بن حنين، عن أبيه، عن ابن عباس، عن علي بن أبي طالب، - رضى الله عنه - قال نهاني حبي صلى الله عليه وسلم عن ثلاث - لا أقول نهى الناس - نهاني عن تختم الذهب وعن لبس القسي وعن المعصفر المفدمة ولا أقرأ ساجدا ولا راكعا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Ali bin Abi Talib said:                     \"My beloved (ﷺ) forbade me from doing three things, but I do not say that he forbade the people. He forbade me from wearing gold rings, wearing Qassi, wearing clothes dyed with safflower Mufaddamah, and from reciting the Quran when prostrating or bowing.",
      "usc_msa_ref": "",
      "chain": [
        "20260",
        "20262",
        "4",
        "11845",
        "11150",
        "11181",
        "17",
        "5"
      ]
    },
    {
      "id": "sunan-an-nasai-1309",
      "hadith_no": "1309",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا عمرو بن عثمان، قال حدثنا أبي، عن شعيب، عن الزهري، قال أخبرني عروة بن الزبير، أن عائشة، أخبرته أن رسول الله صلى الله عليه وسلم كان يدعو في الصلاة ‏\"‏ اللهم إني أعوذ بك من عذاب القبر وأعوذ بك من فتنة المسيح الدجال وأعوذ بك من فتنة المحيا والممات اللهم إني أعوذ بك من المأثم والمغرم ‏\"‏ ‏.‏ فقال له قائل ما أكثر ما تستعيذ من المغرم فقال ‏\"‏ إن الرجل إذا غرم حدث فكذب ووعد فأخلف ‏\"‏ ‏.‏",
      "text_en": " Urwah bin Az-Zbair narrated that:                     Aishah told him that the Messenger of Allah (ﷺ) used to say the following supplication in his prayer: Allahumma inni audhu bika min 'adhab ilqabri wa 'audhu bika min fitnatil-masihid-dajjal, wa 'audhu bika min fitnatil-mahya walmamati, Allahumma inni 'audhu bika min al-ma'thami wal-maghram ( O Allah, I seek refuge with You from the torment of the grave, and I seek refuge in You from the tribulation of the Al-Masihid-Dajjal, and I seek refuge with You from the trials of life and death. O Allah, I seek refuge in You from sin and debt.) Someone said to him: \"How often you seek refuge from debt!\" He said: \"If a man gets into debt, when he speaks lies, and when he makes a promise, he betrays it.\"",
      "usc_msa_ref": "",
      "chain": [
        "10581",
        "4",
        "20239",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-2240",
      "hadith_no": "2240",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا بشر بن خالد، قال حدثنا محمد بن جعفر، عن شعبة، عن سليمان، عن إبراهيم، عن علقمة، أن ابن مسعود، لقي عثمان بعرفات فخلا به فحدثه وأن، عثمان قال لابن مسعود هل لك في فتاة أزوجكها فدعا عبد الله علقمة فحدثه أن النبي صلى الله عليه وسلم قال ‏\"‏ من استطاع منكم الباءة فليتزوج فإنه أغض للبصر وأحصن للفرج ومن لم يستطع فليصم فإن الصوم له وجاء ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Alqamah that:                     Ibn Masud met 'Uthman at 'Arafat and spoke to him in private. Uthman said to Ibn Masud: \"Are you interested in a girl so that I marry her to you?\" 'Abdullah called 'Alqamah and he told him that the Prophet said: 'Whoever among you can afford to get married, let him do so. Whoever cannot afford it, let him fast, for fasting will be a restraint (Wija) for him.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30126",
        "20173",
        "20020",
        "11060",
        "11051",
        "11017",
        "4"
      ]
    },
    {
      "id": "sunan-an-nasai-2711",
      "hadith_no": "2711",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا قتيبة، قال حدثنا سفيان، عن أيوب بن موسى، عن نبيه بن وهب، عن أبان بن عثمان، عن أبيه، قال قال رسول الله صلى الله عليه وسلم في المحرم ‏\"‏ إذا اشتكى رأسه وعينيه أن يضمدهما بصبر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abn bin 'Uthman that his father said:                     'the messenger of Allah said concerning a Muhrim whose head or yes hurt: 'Let him smudge them with aloes, (sahih):",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20005",
        "11241",
        "19965",
        "10582",
        "4"
      ]
    },
    {
      "id": "sunan-an-nasai-2842",
      "hadith_no": "2842",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا قتيبة، عن مالك، عن نافع، عن نبيه بن وهب، أن أبان بن عثمان، قال سمعت عثمان بن عفان، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ لا ينكح المحرم ولا يخطب ولا ينكح ‏\"‏ ‏.‏",
      "text_en": " Uthman bin Affan said:                     \"The Messenger of Allah said: 'The Muhrim should not get married, or propose marriage, or arrange a marriage for some else.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20001",
        "11014",
        "19965",
        "10582",
        "4"
      ]
    },
    {
      "id": "sunan-an-nasai-2843",
      "hadith_no": "2843",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا يحيى، عن مالك، أخبرني نافع، عن نبيه بن وهب، عن أبان بن عثمان، عن أبيه، عن النبي صلى الله عليه وسلم أنه نهى أن ينكح المحرم أو ينكح أو يخطب ‏.‏",
      "text_en": " It was narrated from Aban bin Uthamn, from his father:                     That the Prophet forbade the Muhrim to get married, arrange a marriage for anyone else, or propose marriage.",
      "usc_msa_ref": "",
      "chain": [
        "30359",
        "20031",
        "20001",
        "11014",
        "19965",
        "10582",
        "4"
      ]
    },
    {
      "id": "sunan-an-nasai-2844",
      "hadith_no": "2844",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن عبد الله بن يزيد، عن سفيان، عن أيوب بن موسى، عن نبيه بن وهب، قال أرسل عمر بن عبيد الله بن معمر إلى أبان بن عثمان يسأله أينكح المحرم فقال أبان إن عثمان بن عفان حدث أن النبي صلى الله عليه وسلم قال ‏\"‏ لا ينكح المحرم ولا يخطب ‏\"‏ ‏.‏",
      "text_en": " Uthaman bin Affan narrated that the Prohet said:                     \"The Muhrim should not get or propose marriage.\"",
      "usc_msa_ref": "",
      "chain": [
        "20012",
        "11241",
        "19965",
        "4"
      ]
    },
    {
      "id": "sunan-an-nasai-2968",
      "hadith_no": "2968",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرني عمرو بن عثمان، قال حدثنا أبي، عن شعيب، عن الزهري، عن عروة، قال سألت عائشة عن قول الله، عز وجل ‏{‏ فلا جناح عليه أن يطوف بهما ‏}‏ فوالله ما على أحد جناح أن لا يطوف بالصفا والمروة ‏.‏ قالت عائشة بئسما قلت يا ابن أختي إن هذه الآية لو كانت كما أولتها كانت فلا جناح عليه أن لا يطوف بهما ولكنها نزلت في الأنصار قبل أن يسلموا كانوا يهلون لمناة الطاغية التي كانوا يعبدون عند المشلل وكان من أهل لها يتحرج أن يطوف بالصفا والمروة فلما سألوا رسول الله صلى الله عليه وسلم عن ذلك أنزل الله عز وجل ‏{‏ إن الصفا والمروة من شعائر الله فمن حج البيت أو اعتمر فلا جناح عليه أن يطوف بهما ‏}‏ ثم قد سن رسول الله صلى الله عليه وسلم الطواف بينهما فليس لأحد أن يترك الطواف بهما ‏.‏",
      "text_en": " It was narrated that Urwah said:                     \"I asked Aishah about the words of Allah, the Mighty and Sublime: 'So it sin not a sin on him who perform Hajj or Umrah (Pilgrimage) of the House (the Kabah at Makkah) to perform the going (Tawaf) between them (as-Safa and Al-Marwah) and (I said): 'By Allah, there is no sin on anyone if he does not go between As-Safa and Al-Marwa.' Aishah said: 'What a bad thing you said, O son of my brother! If this Ayah was as you have interpreted it, there would be no sin on a person if he did not go between them. But it was revealed concering the Ansar. Before they accepted Islam, they sued to enter Ihram for the false goddess Manat whom they used to worship at Al-Mushallal. Whoever enter Ihram for her would refrain from going between As-Safa and Al-Marwah. When they asked the Messenger of Allah about that, Allah, the Might and Sublime, revealed: 'Verily As-Safa and Al-Marwah (Two mountains in Makkah) are of the Symbols of Allah. So it is not a sin on him who performs Hajj or Urmrah (Pilgrimage) of the House (the Kabah at Makkah) to perform the going (Tawaf) between them (As-Safa and Al-Marwah). Then the Messenger of Allah enjoined going between them so no one has the right to refrain from going between them.'\"",
      "usc_msa_ref": "",
      "chain": [
        "10581",
        "4",
        "20239",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-3152",
      "hadith_no": "3152",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا عمرو بن عثمان بن سعيد، قال حدثنا أبي، عن شعيب، عن الزهري، قال حدثني سعيد بن المسيب، عن أبي هريرة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ والذي نفسي بيده لولا أن رجالا من المؤمنين لا تطيب أنفسهم بأن يتخلفوا عني ولا أجد ما أحملهم عليه ما تخلفت عن سرية تغزو في سبيل الله والذي نفسي بيده لوددت أني أقتل في سبيل الله ثم أحيا ثم أقتل ثم أحيا ثم أقتل ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                      \"I heard the Messenger of Allah (ﷺ) say: 'By the One in Whose hand is my soul, were it not that some men among the believers would not like to stay behind when I went out (to fight), and I could not find any mounts for them, I would not have stayed behind from any campaign that fought in the cause of Allah. By the One in Whose hand is my soul, I wish that I could be killed in the cause of Allah, then brought back to life, then killed, then be brought back to life, then killed.'\"",
      "usc_msa_ref": "",
      "chain": [
        "10581",
        "4",
        "20239",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-3169",
      "hadith_no": "3169",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا عمرو بن منصور، قال حدثنا عبد الله بن يوسف، قال حدثنا الليث، عن زهرة بن معبد، قال حدثني أبو صالح، مولى عثمان قال سمعت عثمان بن عفان، رضى الله عنه يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ رباط يوم في سبيل الله خير من ألف يوم فيما سواه من المنازل ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Zurah bin Ma'bad:                      \"Abu Salih, the freed slave of 'Uthman, said: 'I heard 'Uthman bin 'Affan say: I heard the Messenger of Allah (ﷺ) say: Ribat (guarding the frontier) for one day in the cause of Allah is better in rank than a thousand days spent within the residence.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38433",
        "30355",
        "20023",
        "11507",
        "4"
      ]
    },
    {
      "id": "sunan-an-nasai-3170",
      "hadith_no": "3170",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا عبد الرحمن بن مهدي، قال حدثنا ابن المبارك، قال حدثنا أبو معن، قال حدثنا زهرة بن معبد، عن أبي صالح، مولى عثمان قال قال عثمان بن عفان رضي الله عنه سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ يوم في سبيل الله خير من ألف يوم فيما سواه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Salih, the freed slace of 'Uthman, said:                      \"uthman bin 'Affan said: 'I heard the Messenger of Allah (ﷺ) say: A day in the cause of Allah is better than a thousand days doing anything else.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20033",
        "20025",
        "11507",
        "19291",
        "4"
      ]
    },
    {
      "id": "sunan-an-nasai-3207",
      "hadith_no": "3207",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا بشر بن خالد، قال حدثنا محمد بن جعفر، عن شعبة، عن سليمان، عن إبراهيم، عن علقمة، أن عثمان، قال لابن مسعود هل لك في فتاة أزوجكها ‏.‏ فدعا عبد الله علقمة فحدث أن النبي صلى الله عليه وسلم قال ‏\"‏ من استطاع الباءة فليتزوج فإنه أغض للبصر وأحصن للفرج ومن لم يستطع فليصم فإنه له وجاء ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Alqamah:                     It was narrated from 'Alqamah, that 'Uthman said to Ibn Mas'ud: \"Shall I arrange for you to marry a young girl?\" 'Abdullah called 'Alqamah and he told the people that the Prophet said: \"Whoever among you can afford it, let him get married, for it is more effective in lowering the gaze and guarding chastity. And whoever cannot afford it, then let him fast, for it will be a restraint for him.\"",
      "usc_msa_ref": "",
      "chain": [
        "30126",
        "20173",
        "20020",
        "11060",
        "11051",
        "11017",
        "4"
      ]
    },
    {
      "id": "sunan-an-nasai-3275",
      "hadith_no": "3275",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا هارون بن عبد الله، قال حدثنا معن، قال حدثنا مالك، والحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن القاسم، قال حدثني مالك، عن نافع، عن نبيه بن وهب، أن أبان بن عثمان، قال سمعت عثمان بن عفان، رضى الله عنه يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ لا ينكح المحرم ولا ينكح ولا يخطب ‏\"‏ ‏.‏",
      "text_en": " 'Uthman bin 'Affan, may Allah be pleased with him, said:                      \"The Messenger of Allah said: 'The Muhrim should not get married, or arrange a marriage for someone else, or propose marriage.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "30112",
        "20001",
        "36017",
        "30234",
        "20001",
        "11014",
        "19965",
        "10582",
        "4"
      ]
    },
    {
      "id": "sunan-an-nasai-3276",
      "hadith_no": "3276",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "حدثنا أبو الأشعث، قال حدثنا يزيد، - وهو ابن زريع - قال حدثنا سعيد، عن مطر، ويعلى بن حكيم، عن نبيه بن وهب، عن أبان بن عثمان، أن عثمان بن عفان، رضى الله عنه حدث عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ لا ينكح المحرم ولا ينكح ولا يخطب ‏\"‏ ‏.‏",
      "text_en": " 'Uthman bin 'Affan, may Allah be pleased with him, narrated that the Prophet said:                      \"The Muhrim should not get married, arrange a marriage for someone else, nor propose marriage.\"",
      "usc_msa_ref": "",
      "chain": [
        "10917",
        "20304",
        "11168",
        "11567",
        "19965",
        "10582",
        "4"
      ]
    },
    {
      "id": "sunan-an-nasai-4057",
      "hadith_no": "4057",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا أبو الأزهر، أحمد بن الأزهر النيسابوري قال حدثنا إسحاق بن سليمان الرازي، قال أنبأنا المغيرة بن مسلم، عن مطر الوراق، عن نافع، عن ابن عمر، أن عثمان، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يحل دم امرئ مسلم إلا بإحدى ثلاث رجل زنى بعد إحصانه فعليه الرجم أو قتل عمدا فعليه القود أو ارتد بعد إسلامه فعليه القتل ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that:                     'Uthman said: \"I heard the Messenger of Allah [SAW] say: 'It is not permissible to shed the blood of a Muslim except in three cases: A man who commits adultery after having married; or one who kills intentionally, in which case he deserves retaliation; or one who apostatizes after having become Muslim, in which case he deserves to be killed.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20310",
        "10719",
        "11014",
        "18",
        "4"
      ]
    },
    {
      "id": "sunan-an-nasai-4058",
      "hadith_no": "4058",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا مؤمل بن إهاب، قال حدثنا عبد الرزاق، قال أخبرني ابن جريج، عن أبي النضر، عن بسر بن سعيد، عن عثمان بن عفان، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يحل دم امرئ مسلم إلا بثلاث أن يزني بعد ما أحصن أو يقتل إنسانا فيقتل أو يكفر بعد إسلامه فيقتل ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Uthman bin 'Affan said:                     \"I heard the Messenger of Allah [SAW] say: 'It is not permissible to shed the blood of a Muslim except in three cases: A man who commits adultery after having married; or one who kills another person, who is to be killed; or who reverts to Kufr after having accepted Islam, who is to be killed.'\"",
      "usc_msa_ref": "",
      "chain": [
        "35156",
        "20121",
        "11070",
        "11164",
        "11153",
        "4"
      ]
    },
    {
      "id": "sunan-an-nasai-4696",
      "hadith_no": "4696",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا عبد الله بن محمد بن إسحاق، عن إسماعيل ابن علية، عن يونس، عن عطاء بن فروخ، عن عثمان بن عفان، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أدخل الله عز وجل رجلا كان سهلا مشتريا وبائعا وقاضيا ومقتضيا الجنة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Uthman bin  'Affan said:                     \"The Messenger of Allah said: 'Allah, the Mighty and Sublime, admitted to paradise a man who was easygoing in buying and selling, in paying off debts and asking for repayment.\"' (Sahaih)",
      "usc_msa_ref": "",
      "chain": [
        "20208",
        "20475",
        "12360",
        "4"
      ]
    },
    {
      "id": "sunan-an-nasai-5172",
      "hadith_no": "5172",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا أبو داود، قال حدثنا أبو علي الحنفي، وعثمان بن عمر، قال أبو علي حدثنا وقال، عثمان أنبأنا داود بن قيس، عن إبراهيم بن عبد الله بن حنين، عن أبيه، عن ابن عباس، عن علي، قال نهاني حبي صلى الله عليه وسلم عن ثلاث لا أقول نهى الناس نهاني عن تختم الذهب وعن لبس القسي وعن المعصفر المفدمة ولا أقرأ ساجدا ولا راكعا ‏.‏ تابعه الضحاك بن عثمان ‏.‏",
      "text_en": " It was narrated that 'Ali said:                     \"My beloved, the Messenger of Allah [SAW], forbade me three things but I do not say that he forbade them to the people. He forbade me from wearing rings of gold, from wearing Al-Qassi, and Al-Mu'asfar Al-Mufaddam (garments that are deeply dyed with safflower), and (he forbade me) from reciting Qur'an when prostrating or bowing.\" He was followed (in that narration) by Ad-Dahhak bin 'Uthman.",
      "usc_msa_ref": "",
      "chain": [
        "30002",
        "20260",
        "20262",
        "4",
        "11845",
        "11150",
        "11181",
        "17",
        "5"
      ]
    },
    {
      "id": "sunan-an-nasai-5666",
      "hadith_no": "5666",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا سويد، قال أنبأنا عبد الله، عن معمر، عن الزهري، عن أبي بكر بن عبد الرحمن بن الحارث، عن أبيه، قال سمعت عثمان، رضى الله عنه يقول اجتنبوا الخمر فإنها أم الخبائث إنه كان رجل ممن خلا قبلكم تعبد فعلقته امرأة غوية فأرسلت إليه جاريتها فقالت له إنا ندعوك للشهادة فانطلق مع جاريتها فطفقت كلما دخل بابا أغلقته دونه حتى أفضى إلى امرأة وضيئة عندها غلام وباطية خمر فقالت إني والله ما دعوتك للشهادة ولكن دعوتك لتقع على أو تشرب من هذه الخمرة كأسا أو تقتل هذا الغلام ‏.‏ قال فاسقيني من هذا الخمر كأسا فسقته كأسا ‏.‏ قال زيدوني فلم يرم حتى وقع عليها وقتل النفس فاجتنبوا الخمر فإنها والله لا يجتمع الإيمان وإدمان الخمر إلا ليوشك أن يخرج أحدهما صاحبه ‏.‏",
      "text_en": " It was narrated from Abu Bakr bin 'Abdur-Rahman bin Al-Harith that his father said:                     \"I heard 'Uthman, may Allah be pleased with him, say: 'Avoid Khamr for it is the mother of all evils. There was a man among those who came before you who was a devoted worshipper. An immoral woman fell in love with him. She sent her slave girl to him, saying: We are calling you to bear witness. So he set out with her slave girl, and every time he entered a door, she locked it behind him, until he reached a beautiful woman who has with her a boy and a vessel of wine. She said: 'By Allah, I did not call you to bear witness, rather I called you to have intercourse with me, or to drink a cup of this wine, or to kill this boy.' He said: 'Pour me a cup of this wine.' So she poured him a cup. He said: 'Give me more.' And soon he had intercourse with her and killed the boy. So avoid Khamr, for by Allah faith and addiction to Khamr cannot coexist but, one of them will soon expel the other.\"",
      "usc_msa_ref": "",
      "chain": [
        "18",
        "20115",
        "11013",
        "11003",
        "448",
        "4"
      ]
    },
    {
      "id": "sunan-an-nasai-5667",
      "hadith_no": "5667",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا سويد، قال أنبأنا عبد الله، - يعني ابن المبارك - عن يونس، عن الزهري، قال حدثني أبو بكر بن عبد الرحمن بن الحارث، أن أباه، قال سمعت عثمان، يقول اجتنبوا الخمر فإنها أم الخبائث فإنه كان رجل ممن خلا قبلكم يتعبد ويعتزل الناس فذكر مثله قال فاجتنبوا الخمر فإنه والله لا يجتمع والإيمان أبدا إلا يوشك أحدهما أن يخرج صاحبه ‏.‏",
      "text_en": " Abu Bakr bin 'Abdur-Rahman bin Al-Harith narrated that his father said:                     \"I heard 'Uthman say: 'Avoid Khamr for it is the mother of all evils. There was a man among those who came before you who was a devoted worshipper and used to stay away from people.'\" And he mentioned something similar. He said: \"Avoid Khamr for, by Allah, it can never coexist with Faith, but soon one of them will expel the other.\"",
      "usc_msa_ref": "",
      "chain": [
        "20025",
        "20475",
        "11013",
        "11003",
        "448",
        "4"
      ]
    },
    {
      "id": "sunan-ibn-majah-216",
      "hadith_no": "216",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد القطان، حدثنا شعبة، وسفيان، عن علقمة بن مرثد، عن سعد بن عبيدة، عن أبي عبد الرحمن السلمي، عن عثمان بن عفان، قال قال رسول الله  صلى الله عليه وسلم  قال شعبة ‏\"‏ خيركم ‏\"‏ ‏.‏ وقال سفيان ‏\"‏ أفضلكم من تعلم القرآن وعلمه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Uthman bin 'Affan said that:                     The Messenger of Allah said: (According to one of the narrators) Shu'bah (he) said: 'The best of you' (and according to) Sufyan (he) said: \"The most excellent of you is the one who learns the Qur'an and teaches it.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20031",
        "20020",
        "20005",
        "11374",
        "11344",
        "11359",
        "4"
      ]
    },
    {
      "id": "sunan-ibn-majah-217",
      "hadith_no": "217",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، حدثنا سفيان، عن علقمة بن مرثد، عن أبي عبد الرحمن السلمي، عن عثمان بن عفان، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ أفضلكم من تعلم القرآن وعلمه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Uthmaan bin 'Affan said:                     \"The Messenger of Allah said: 'The most excellent of you is the one who learns the Qur'an and teaches it.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20032",
        "20012",
        "11374",
        "11359",
        "4"
      ]
    },
    {
      "id": "sunan-ibn-majah-300",
      "hadith_no": "300",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا هشام بن عمار، حدثنا عبد الحميد بن حبيب، حدثنا الأوزاعي، حدثني يحيى، حدثني محمد بن إبراهيم، حدثني عيسى بن طلحة، حدثني حمران، عن عثمان، عن النبي  صلى الله عليه وسلم  نحوه ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30288",
        "20024",
        "11449",
        "11213",
        "10573",
        "11421",
        "4"
      ]
    },
    {
      "id": "sunan-ibn-majah-332",
      "hadith_no": "332",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، حدثنا الصلت بن دينار، عن عقبة بن صهبان، قال سمعت عثمان بن عفان، يقول ما تغنيت ولا تمنيت ولا مسست ذكري بيميني منذ بايعت بها رسول الله  صلى الله عليه وسلم  ‏.‏",
      "text_en": " It was narrated that 'Uqbah bin Suhban said:                     \"I heard 'Uthman bin 'Affan say: 'I never sang a song or told a lie or touched my penis with my right hand after I swore on oath of allegiance to the Messenger of Allah to that effect.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20032",
        "14188",
        "11602",
        "4"
      ]
    },
    {
      "id": "sunan-ibn-majah-465",
      "hadith_no": "465",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن أبي خالد القزويني، حدثنا عبد الرزاق، عن إسرائيل، عن عامر بن شقيق الأسدي، عن أبي وائل، عن عثمان، أن رسول الله  صلى الله عليه وسلم  توضأ فخلل لحيته ‏.‏",
      "text_en": " It was narrated from 'Uthman that:                     The Messenger of Allah performed ablution and ran his fingers through his beard.",
      "usc_msa_ref": "",
      "chain": [
        "20121",
        "20311",
        "15261",
        "11353",
        "4"
      ]
    },
    {
      "id": "sunan-ibn-majah-470",
      "hadith_no": "470",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عباد بن العوام، عن حجاج، عن عطاء، عن عثمان بن عفان، قال رأيت رسول الله  صلى الله عليه وسلم  توضأ فمسح رأسه مرة ‏.‏",
      "text_en": " It was narrated that 'Uthman bin 'Affan said:                     \"I saw the Messenger of Allah performing ablution and he wiped his head once.\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20431",
        "20219",
        "11029",
        "4"
      ]
    },
    {
      "id": "sunan-ibn-majah-495",
      "hadith_no": "495",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن جامع بن شداد أبي صخرة، قال سمعت حمران، يحدث أبا بردة في المسجد أنه سمع عثمان بن عفان، يحدث عن النبي  صلى الله عليه وسلم  قال ‏\"‏ من أتم الوضوء كما أمره الله فالصلوات المكتوبات كفارات لما بينهن ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Jami' bin Shaddad - AbuSakhrah - said:                     \"I heard Humran telling Abu Burdah in the mosque that he had heard 'Uthman bin 'Affan narrating that the Prophet had said\" 'Whoever performs ablution perfectly as Allah has enjoined, then his prescribed prayer will serve as expiation for what is between them.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11328",
        "11421",
        "4"
      ]
    },
    {
      "id": "sunan-ibn-majah-734",
      "hadith_no": "734",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Adhan and the Sunnah Regarding It - كتاب الأذان والسنة فيها",
      "chapter_no": "3",
      "text_ar": "حدثنا حرملة بن يحيى، حدثنا عبد الله بن وهب، أنبأنا عبد الجبار بن عمر، عن ابن أبي فروة، عن محمد بن يوسف، مولى عثمان بن عفان عن أبيه، عن عثمان، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من أدركه الأذان في المسجد ثم خرج لم يخرج لحاجة وهو لا يريد الرجعة فهو منافق ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Uthman said:                     \"The Messenger of Allah said: 'Whoever hears the Adhan when he is in the mosque, then goes out and does not go out for any (legitimate) need and does not intend to return, is a hypocrite.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30487",
        "20029",
        "28317",
        "30388",
        "4"
      ]
    },
    {
      "id": "sunan-ibn-majah-736",
      "hadith_no": "736",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book On The Mosques And The Congregations - كتاب المساجد والجماعات",
      "chapter_no": "4",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو بكر الحنفي، حدثنا عبد الحميد بن جعفر، عن أبيه، عن محمود بن لبيد، عن عثمان بن عفان، قال سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ من بنى لله مسجدا بنى الله له مثله في الجنة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Uthman bin 'Affan said:                     \"I heard the Messenger of Allah say: 'Whoever builds a mosque for the sake of Allah, Allah will build something similar for him in Paradise.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20254",
        "11875",
        "11833",
        "1830",
        "4"
      ]
    },
    {
      "id": "sunan-ibn-majah-1461",
      "hadith_no": "1461",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الله بن أبي زياد، حدثنا يعقوب بن إبراهيم بن سعد، حدثني ابن أخي ابن شهاب، عن عمه، حدثني صالح بن عبد الله بن أبي فروة، أن عامر بن سعد، أخبره قال سمعت أبان بن عثمان، يقول قال عثمان سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ أرأيت لو كان بفناء أحدكم نهر يجري يغتسل فيه كل يوم خمس مرات ما كان يبقى من درنه ‏\"‏ قال لا شىء ‏.‏ قال ‏\"‏ فإن الصلاة تذهب الذنوب كما يذهب الماء الدرن ‏\"‏ ‏.‏",
      "text_en": " ‘Uthmansaid:                      “I heard the Messenger of Allah (ﷺ) say: ‘Do youthinkthat if there was a river in the courtyard of anyone of you, andhebathed in it five times each day, would there be any dirt left onhim?’ They said: ‘(There would be) nothing.’ He said: ‘Prayertakesaway sins like water takes away dirt.’”",
      "usc_msa_ref": "",
      "chain": [
        "20184",
        "20176",
        "12181",
        "10554",
        "10582",
        "4"
      ]
    },
    {
      "id": "sunan-ibn-majah-1569",
      "hadith_no": "1569",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا المغيرة بن عبد الرحمن، حدثنا خالد بن إلياس، عن إسماعيل بن عمرو بن سعيد بن العاص، عن عثمان بن عبد الله بن الحكم بن الحارث، عن عثمان بن عفان، ‏.‏ أن النبي  صلى الله عليه وسلم  صلى على عثمان بن مظعون وكبر عليه أربعا ‏.‏",
      "text_en": " It wasnarrated from ‘Uthman bin ‘Affan that the Prophet (ﷺ)offeredthe funeral prayer for ‘Uthman bin Maz’un, and he said fourTakbir over him.",
      "usc_msa_ref": "",
      "chain": [
        "32048",
        "20182",
        "22048",
        "18046",
        "13535",
        "4"
      ]
    },
    {
      "id": "sunan-ibn-majah-2042",
      "hadith_no": "2042",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن الصباح، حدثنا عبد الله بن رجاء المكي، عن مالك بن أنس، عن نافع، عن نبيه بن وهب، عن أبان بن عثمان بن عفان، عن أبيه، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ المحرم لا ينكح ولا ينكح ولا يخطب ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Aban bin 'Uthman bin 'Affan' that his father said:                     \"The Messenger of Allah said: 'The one in lhram should not get married, nor arrange a marriage for anyone else, nor Propose marriage''",
      "usc_msa_ref": "",
      "chain": [
        "30269",
        "23027",
        "20001",
        "11014",
        "19965",
        "10582",
        "4"
      ]
    },
    {
      "id": "sunan-ibn-majah-2286",
      "hadith_no": "2286",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا محمد بن أبان البلخي أبو بكر، حدثنا إسماعيل ابن علية، عن يونس بن عبيد، عن عطاء بن فروخ، قال قال عثمان بن عفان قال رسول الله  صلى الله عليه وسلم  ‏\"‏ أدخل الله رجلا الجنة كان سهلا بائعا ومشتريا ‏\"‏ ‏.‏",
      "text_en": " 'Uthman bin 'Affan narrated that the Messenger of Allah (ﷺ) said:                     “Allah will admit to Paradise a man who was lenient when he sold and when he bought. \"",
      "usc_msa_ref": "",
      "chain": [
        "30369",
        "20208",
        "11075",
        "12360",
        "4"
      ]
    },
    {
      "id": "sunan-ibn-majah-2287",
      "hadith_no": "2287",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا عمرو بن عثمان بن سعيد بن كثير بن دينار الحمصي، حدثنا أبي، حدثنا أبو غسان، محمد بن مطرف عن محمد بن المنكدر، عن جابر بن عبد الله، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ رحم الله عبدا سمحا إذا باع سمحا إذا اشترى سمحا إذا اقتضى ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Jabir bin 'Abdullah that the Messenger of Allah (ﷺ) said:                     \"May Allah have mercy on a person who is lenient when he sells, lenient when he buys, and lenient when he asks for payment. \"",
      "usc_msa_ref": "",
      "chain": [
        "10581",
        "4",
        "20179",
        "11048",
        "34"
      ]
    },
    {
      "id": "sunan-ibn-majah-2315",
      "hadith_no": "2315",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا علي بن ميمون الرقي، حدثنا عبد الله بن يزيد، عن ابن لهيعة، عن موسى بن وردان، عن سعيد بن المسيب، عن عثمان بن عفان، قال كنت أبيع التمر في السوق فأقول كلت في وسقي هذا كذا ‏.‏ فأدفع أوساق التمر بكيله وآخذ شفي فدخلني من ذلك شىء فسألت رسول الله  صلى الله عليه وسلم  فقال ‏\"‏ إذا سميت الكيل فكله ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Uthman bin 'Affan said:                     \"I used to sell dates in the marketplace, and I would say: 'This was such and such an amount (when I bought it).' I Would give the purchaser a specific amount of dates according to the way it had been measured for me, and take my profit. Then I began to have some doubts about that, so I asked the Messenger of Allah (ﷺ), and he said: ‘When you name the amount, measure it in front of the purchaser.\"'",
      "usc_msa_ref": "",
      "chain": [
        "38412",
        "1945",
        "20624",
        "11002",
        "4"
      ]
    },
    {
      "id": "sunan-ibn-majah-2630",
      "hadith_no": "2630",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا أحمد بن عبدة، أنبأنا حماد بن زيد، عن يحيى بن سعيد، عن أبي أمامة بن سهل بن حنيف، أن عثمان بن عفان، أشرف عليهم فسمعهم وهم، يذكرون القتل فقال إنهم ليتواعدوني بالقتل فلم يقتلوني وقد سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يحل دم امرئ مسلم إلا في إحدى ثلاث رجل زنى وهو محصن فرجم أو رجل قتل نفسا بغير نفس أو رجل ارتد بعد إسلامه ‏\"‏ ‏.‏ فوالله ما زنيت في جاهلية ولا في إسلام ولا قتلت نفسا مسلمة ولا ارتددت منذ أسلمت ‏.‏",
      "text_en": " It was narrated from Abu Umamah bin Sahl bin Hunaif that:                     `Uthman bin 'Affan looked at them when they spoke of killing. He said: “Are they kill threatening to kill me? Why would they kill me? I heard the Messenger of Allah (ﷺ) say: “It is not lawful to shed the blood of a Muslim except in one of three (cases): a man who commits adultery when he is a married person, then he should be stoned; a man who kills a soul not in retaliation for murder; and a man who apostatizes after becoming Muslim.' By Allah (SWT), I never committed adultery either during Ignorance days nor in Islam, and I have never killed a Muslim soul, and I have not apostatized since I became Muslim.”",
      "usc_msa_ref": "",
      "chain": [
        "30423",
        "20022",
        "20031",
        "405",
        "4"
      ]
    },
    {
      "id": "sunan-ibn-majah-3387",
      "hadith_no": "3387",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا عمرو بن عثمان بن سعيد بن كثير بن دينار الحمصي، حدثنا أبي، أنبأنا محمد بن عبد الرحمن بن عرق، حدثنا عبد الله بن بسر، قال أهديت للنبي  صلى الله عليه وسلم  شاة فجثى رسول الله  صلى الله عليه وسلم  على ركبتيه يأكل فقال أعرابي ما هذه الجلسة فقال ‏\"‏ إن الله جعلني عبدا كريما ولم يجعلني جبارا عنيدا ‏\"‏ ‏.‏",
      "text_en": " ‘Abdullah bin Busr said:                      “I gave the Prophet (ﷺ) a gift of asheep,and the Messenger of Allah (ﷺ) sat on his knees to eat. ABedouinsaid: ‘What is this sitting?’ He said: ‘Allah has mademe a humble andgenerous slave (of Allah) and has not made mearrogant and stubborn.’”",
      "usc_msa_ref": "",
      "chain": [
        "10581",
        "4",
        "18930",
        "3650"
      ]
    },
    {
      "id": "sunan-ibn-majah-3400",
      "hadith_no": "3400",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا عمرو بن عثمان بن سعيد بن كثير بن دينار الحمصي، حدثنا أبي، حدثنا محمد بن عبد الرحمن بن عرق اليحصبي، حدثنا عبد الله بن بسر، أن رسول الله  صلى الله عليه وسلم  أتي بقصعة فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ كلوا من جوانبها ودعوا ذروتها يبارك فيها ‏\"‏ ‏.‏",
      "text_en": " ‘Abdullah bin Busr narrated that the Messenger of Allah (ﷺ) wasbrought a bowl (of food). The Messenger of Allah (ﷺ) said:                      “Eatfromthe sides and leave the top, so that it may be blessed.”",
      "usc_msa_ref": "",
      "chain": [
        "10581",
        "4",
        "3650"
      ]
    },
    {
      "id": "sunan-ibn-majah-3493",
      "hadith_no": "3493",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا عمرو بن عثمان بن سعيد بن كثير بن دينار الحمصي، حدثنا أبي، حدثنا محمد بن عبد الرحمن بن عرق، عن أبيه، عن النعمان بن بشير، قال أهدي للنبي  صلى الله عليه وسلم  عنب من الطائف فدعاني فقال ‏\"‏ خذ هذا العنقود فأبلغه أمك ‏\"‏ ‏.‏ فأكلته قبل أن أبلغه إياها فلما كان بعد ليال قال لي ‏\"‏ ما فعل العنقود هل أبلغته أمك ‏\"‏ ‏.‏ قلت لا ‏.‏ قال فسماني غدر ‏.‏",
      "text_en": " It wasnarrated that Nu’man bin Bashir said:                      “The Prophet (ﷺ) wasgiven a gift of some grapes from Ta’if. He called me and said:‘Takethis bunch of grapes and give it to your mother.’ But I ateit beforeI gave it to her. A few night later he said to me: ‘Whathappened tothe bunch of grapes? Did you give it to your mother?’ Isaid: ‘No, Sohe called me treacherous.’”",
      "usc_msa_ref": "",
      "chain": [
        "10581",
        "4",
        "18930",
        "274"
      ]
    },
    {
      "id": "sunan-ibn-majah-3657",
      "hadith_no": "3657",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا عمرو بن عثمان بن سعيد بن كثير بن دينار الحمصي، حدثنا أبي، عن ابن ثوبان، عن عمير، أنه سمع جنادة بن أبي أمية، قال سمعت عبادة بن الصامت، يقول أتى جبرائيل عليه السلام النبي  صلى الله عليه وسلم  وهو يوعك فقال بسم الله أرقيك من كل شىء يؤذيك من حسد حاسد ومن كل عين الله يشفيك ‏.‏",
      "text_en": " It wasnarrated from ‘Aishah that the Prophet (ﷺ) used to blow whenperforming Ruqyah.",
      "usc_msa_ref": "",
      "chain": [
        "10581",
        "4",
        "3205",
        "40"
      ]
    },
    {
      "id": "sunan-ibn-majah-3766",
      "hadith_no": "3766",
      "source": "Sunan Ibn Majah",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا هشام بن عمار، حدثنا يحيى بن سليم الطائفي، حدثنا ابن جريج، عن الحسن بن أبي الحسن، عن عثمان بن عفان، أن رسول الله  صلى الله عليه وسلم  رأى رجلا وراء حمامة فقال ‏\"‏ شيطان يتبع شيطانة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Uthman bin Affan that the Messenger of Allah(ﷺ) saw a man following a pigeon and said:                     \"A male devil chasing a female devil.\"",
      "usc_msa_ref": "",
      "chain": [
        "30288",
        "20204",
        "11070",
        "11016",
        "4"
      ]
    },
    {
      "id": "sunan-ibn-majah-3818",
      "hadith_no": "3818",
      "source": "Sunan Ibn Majah",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا عمرو بن عثمان بن سعيد بن كثير بن دينار الحمصي، حدثنا أبي، حدثنا محمد بن عبد الرحمن بن عرق، سمعت عبد الله بن بسر، يقول قال النبي  صلى الله عليه وسلم  ‏\"‏ طوبى لمن وجد في صحيفته استغفارا كثيرا ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah bin Busr said that :                     the Prophet (saas) said: \"Glad tidings to those who find a lot of seeking forgiveness in the record of their deeds.\"",
      "usc_msa_ref": "",
      "chain": [
        "10581",
        "4",
        "18930",
        "3650"
      ]
    },
    {
      "id": "sunan-ibn-majah-3869",
      "hadith_no": "3869",
      "source": "Sunan Ibn Majah",
      "chapter": "Supplication - كتاب الدعاء",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو داود، حدثنا ابن أبي الزناد، عن أبيه، عن أبان بن عثمان، قال سمعت عثمان بن عفان، يقول سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ ما من عبد يقول في صباح كل يوم ومساء كل ليلة بسم الله الذي لا يضر مع اسمه شىء في الأرض ولا في السماء وهو السميع العليم ثلاث مرات - فيضره شىء ‏\"‏ ‏.‏ قال وكان أبان قد أصابه طرف من الفالج فجعل الرجل ينظر إليه فقال له أبان ما تنظر إلى أما إن الحديث كما قد حدثتك ولكني لم أقله يومئذ ليمضي الله على قدره ‏.‏",
      "text_en": " 'Uthman bin 'Affan said:                     \"I heard the Messenger of Allah (saas) say: \"There is no person who says, in the morning and evening of every day: Bismillahil-ladhi la yadurru ma'a ismihi shay'un fil-ardi wa la fis-sama'i wa Huwas-Sami'ul-'Alim (In the name of Allah with Whose Name nothing on earth or in heaven harms, and He is the All-Seeing, All-Knowing), three times, and is then harmed by anything.'\" (Hasan)He (one of the narrators) said: \"Aban had been stricken with paralysis on one side of his body, and a man started looking at him. Aban said: 'Why are you looking at me? The Hadith is as I have narrated it to you, but I did not say it that day, so that the decree of Allah might be implemented.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20547",
        "20509",
        "11061",
        "10582",
        "4"
      ]
    }
  ],
  "total_hadiths": 108
}