{
  "id": "40",
  "name": "'Ubada bin As-Samit ( عبادة بن الصامت بن قيس بن أصرم ( رضي الله عنه",
  "full_name": "'Ubada bin As-Samit ( عبادة بن الصامت بن قيس بن أصرم ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medinah"
    },
    "death": {
      "date_hijri": "34",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Syria",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah",
      "Medinah",
      "Palestine",
      "Syria"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ ع  -  صحابة ]",
      "Qadhi(Judge)"
    ],
    "tags": [
      "Ansar",
      "Khazraj",
      "B.'Auf B.al-Khazraj",
      "B.Qauqal",
      "Aqaba 1",
      "Aqaba 2",
      "Aqaba Chief",
      "Badr",
      "Uhud",
      "Khandaq",
      "Ridwan"
    ]
  },
  "parents": [
    {
      "id": "161",
      "name": "Qurratu'l-'Ayn bint 'Ubada bin Nadla ( قرة العين بنت عبادة بن نضلة ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "spouses": [
    {
      "id": "630",
      "name": "Jamila bint Abi Sa'sa'a ( جميلة بنت أبي صعصعة ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "209",
      "name": "Umm Haram bint Milhan ( أم حرام بنت ملحان ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "siblings": [
    {
      "id": "170",
      "name": "Aus bin As-Samit ( أوس بن الصامت بن قيس بن أصرم ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "226",
      "name": "Thabit bin As-Samit ( ثابت بن الصامت بن قيس بن أصرم ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "220",
      "name": "Umama bint As-Samit ( أمامة بنت الصامت بن قيس بن أصرم ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "228",
      "name": "Khawla bint As-Samit ( خولة بنت الصامت بن قيس بن أصرم ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "children": [
    {
      "id": "631",
      "name": "al-Walid bin 'Ubada bin As-Samit ( الوليد بن عبادة بن الصامت ( رضي الله عنه",
      "grade": "Comp.(RA) [2nd Generation]"
    },
    {
      "id": "17230",
      "name": "Muhammad bin al-Walid bin ''Aabadh محمد بن الوليد بن عبادة بن الصامت",
      "grade": "Follower(Tabi')"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "students": [
    {
      "id": "631",
      "name": "al-Walid bin 'Ubada bin As-Samit ( الوليد بن عبادة بن الصامت ( رضي الله عنه",
      "grade": "Comp.(RA) [2nd Generation]"
    },
    {
      "id": "19161",
      "name": "Yahya bin al-Waleed bin 'Ubada يحيى بن الوليد بن عبادة بن الصامت",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "12201",
      "name": "'Ubada bin al-Waleed bin 'Ubada عبادة بن الوليد بن عبادة بن الصامت",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "18030",
      "name": "Ishaq bin Yahya bin al-Walid إسحاق بن يحيى بن الوليد",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "34",
      "name": "Jabir ibn 'Abdullah ( جابر بن عبد الله بن عمرو السلمي الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "323",
      "name": "Rifa'a bin Rafi' bin Malik bin al-'Ajlan ( رفاعة بن رافع بن مالك بن العجلان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "722",
      "name": "Shurahbil bin Hasana ( شرحبيل بن حسنة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5071",
      "name": "Salmah bin al-Mahbaq ( سلمة بن المحبق ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4048",
      "name": "Abu Umama al-Bahili ( أبو أمامة الباهلي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5152",
      "name": "'Abdur Rahman bin Ghnm ( عبد الرحمن بن غنم ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "1935",
      "name": "Fadala bin 'Ubaid bin Naqid ( فضالة بن عبيد بن نافذ ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5278",
      "name": "Mahmud bin al-Rabi' bin Saraqa ( محمود بن الربيع بن سراقة بن عمرو ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "18",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو اليمان، قال أخبرنا شعيب، عن الزهري، قال أخبرني أبو إدريس، عائذ الله بن عبد الله أن عبادة بن الصامت  رضى الله عنه  وكان شهد بدرا، وهو أحد النقباء ليلة العقبة  أن رسول الله صلى الله عليه وسلم قال وحوله عصابة من أصحابه ‏\"‏ بايعوني على أن لا تشركوا بالله شيئا، ولا تسرقوا، ولا تزنوا، ولا تقتلوا أولادكم، ولا تأتوا ببهتان تفترونه بين أيديكم وأرجلكم، ولا تعصوا في معروف، فمن وفى منكم فأجره على الله، ومن أصاب من ذلك شيئا فعوقب في الدنيا فهو كفارة له، ومن أصاب من ذلك شيئا ثم ستره الله، فهو إلى الله إن شاء عفا عنه، وإن شاء عاقبه ‏\"‏‏.‏ فبايعناه على ذلك‏.‏",
      "text_en": "      Narrated 'Ubada bin As-Samit:                          who took part in the battle of Badr and was a Naqib (a person heading      a group of six persons), on the night of Al-'Aqaba pledge: Allah's      Apostle said while a group of his companions were around him, \"Swear      allegiance to me for:     1. Not to join anything in worship along with Allah.     2. Not to steal.     3. Not to commit illegal sexual intercourse.     4. Not to kill your children.     5. Not to accuse an innocent person (to spread such an accusation      among people).     6. Not to be disobedient (when ordered) to do good deed.\"     The Prophet added: \"Whoever among you fulfills his pledge will be      rewarded by Allah. And whoever indulges in any one of them (except the     ascription of partners to Allah) and gets the punishment in this      world, that punishment will be an expiation for that sin. And if one      indulges in any of them, and Allah conceals his sin, it is up to Him      to forgive or punish him (in the Hereafter).\" 'Ubada bin As-Samit      added: \"So we swore allegiance for these.\" (points to Allah's      Apostle)",
      "chain": [
        "30330",
        "20428",
        "11013",
        "11027",
        "40"
      ]
    },
    {
      "hadith_no": "49",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "أخبرنا قتيبة بن سعيد، حدثنا إسماعيل بن جعفر، عن حميد، عن أنس، قال أخبرني عبادة بن الصامت، أن رسول الله صلى الله عليه وسلم خرج يخبر بليلة القدر، فتلاحى رجلان من المسلمين فقال ‏\"‏ إني خرجت لأخبركم بليلة القدر، وإنه تلاحى فلان وفلان فرفعت وعسى أن يكون خيرا لكم التمسوها في السبع والتسع والخمس ‏\"‏‏.‏",
      "text_en": " Narrated 'Ubada bin As-Samit:                           \"Allah's Apostle went out to inform the people about the (date of the)     night of decree (Al-Qadr) but there happened a quarrel between two      Muslim men. The Prophet said, \"I came out to inform you about (the      date of) the night of Al-Qadr, but as so and so and so and so      quarrelled, its knowledge was taken away (I forgot it) and maybe it      was better for you. Now look for it in the 7th, the 9th and the 5th      (of the last 10 nights of the month of Ramadan).\"",
      "chain": [
        "30367",
        "20155",
        "11279",
        "19",
        "40"
      ]
    },
    {
      "hadith_no": "756",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا علي بن عبد الله، قال حدثنا سفيان، قال حدثنا الزهري، عن محمود بن الربيع، عن عبادة بن الصامت، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا صلاة لمن لم يقرأ بفاتحة الكتاب ‏\"‏‏.‏",
      "text_en": " Narrated 'Ubada bin As-Samit:                     Allah's Apostle said, \"Whoever does not recite Al-Fatiha in his prayer, his prayer is invalid.\"",
      "chain": [
        "30026",
        "20005",
        "11013",
        "5278",
        "40"
      ]
    },
    {
      "hadith_no": "1154",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا صدقة بن الفضل، أخبرنا الوليد، عن الأوزاعي، قال حدثني عمير بن هانئ، قال حدثني جنادة بن أبي أمية، حدثني عبادة بن الصامت، عن النبي صلى الله عليه وسلم قال ‏\"‏ من تعار من الليل فقال لا إله إلا الله وحده لا شريك له، له الملك، وله الحمد، وهو على كل شىء قدير‏.‏ الحمد لله، وسبحان الله، ولا إله إلا الله، والله أكبر، ولا حول ولا قوة إلا بالله‏.‏ ثم قال اللهم اغفر لي‏.‏ أو دعا استجيب، فإن توضأ وصلى قبلت صلاته ‏\"‏‏.‏",
      "text_en": " Narrated 'Ubada bin As-Samit:                     The Prophet \"Whoever gets up at night and says: -- 'La ilaha il-lallah Wahdahu la Sharika lahu Lahu-lmulk, waLahu-l-hamd wahuwa 'ala kullishai'in Qadir. Al hamdu lil-lahi wa subhanal-lahi wa la-ilaha il-lal-lah wa-l-lahu akbar wa la hawla Wala Quwata il-la-bil-lah.' (None has the right to be worshipped but Allah. He is the Only One and has no partners . For Him is the Kingdom and all the praises are due for Him. He is Omnipotent. All the praises are for Allah. All the glories are for Allah. And none has the right to be worshipped but Allah, And Allah is Great And there is neither Might nor Power Except with Allah). And then says: -- Allahumma, Ighfir li (O Allah! Forgive me). Or invokes (Allah), he will be responded to and if he performs ablution (and prays), his prayer will be accepted.\"",
      "chain": [
        "30343",
        "20733",
        "20024",
        "11415",
        "3205",
        "40"
      ]
    },
    {
      "hadith_no": "2023",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Night of Qadr - كتاب فضل ليلة القدر",
      "chapter_no": "32",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا خالد بن الحارث، حدثنا حميد، حدثنا أنس، عن عبادة بن الصامت، قال خرج النبي صلى الله عليه وسلم ليخبرنا بليلة القدر، فتلاحى رجلان من المسلمين، فقال ‏\"‏ خرجت لأخبركم بليلة القدر، فتلاحى فلان وفلان، فرفعت، وعسى أن يكون خيرا لكم، فالتمسوها في التاسعة والسابعة والخامسة ‏\"‏‏.‏",
      "text_en": " Narrated 'Ubada bin As-Samit:                     The Prophet came out to inform us about the Night of Qadr but two Muslims were quarreling with each other. So, the Prophet said, \"I came out to inform you about the Night of Qadr but such-and-such persons were quarreling, so the news about it had been taken away; yet that might be for your own good, so search for it on the 29th, 27th and 25th (of Ramadan).",
      "chain": [
        "30170",
        "20226",
        "11279",
        "19",
        "40"
      ]
    },
    {
      "hadith_no": "3941",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا قتيبة، حدثنا الليث، عن يزيد بن أبي حبيب، عن أبي الخير، عن الصنابحي، عن عبادة بن الصامت  رضى الله عنه  أنه قال إني من النقباء الذين بايعوا رسول الله صلى الله عليه وسلم‏.‏ وقال بايعناه على أن لا نشرك بالله شيئا، ولا نسرق، ولا نزني، ولا نقتل النفس التي حرم الله، ولا ننتهب، ولا نعصي بالجنة إن فعلنا ذلك، فإن غشينا من ذلك شيئا كان قضاء ذلك إلى الله‏.‏",
      "text_en": " Narrated 'Ubada bin As Samit:                     I was one of the Naqibs who gave the ('Aqaba) Pledge of Allegiance to Allah's Apostle . We gave the pledge of allegiance to him that we would not worship anything other than Allah, would not steal, would not commit illegal sexual intercourse, would not kill a person whose killing Allah has made illegal except rightfully, would not rob each other, and we would not be promised Paradise jf we did the above sins, then if we committed one of the above sins, Allah will give His Judgment concerning it.",
      "chain": [
        "30367",
        "20023",
        "11411",
        "11410",
        "5144",
        "40"
      ]
    },
    {
      "hadith_no": "4049",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، قال أخبرني أبو إدريس، عائذ الله بن عبد الله أن عبادة بن الصامت، وكان، شهد بدرا أن رسول الله صلى الله عليه وسلم قال ‏\"‏ بايعوني ‏\"‏‏.‏",
      "text_en": " Narrated 'Ubada bin As-Samit:                     (who was one of the Badr warriors) Allah's Apostle said, \"Give me the pledge of allegiance.\"",
      "chain": [
        "30330",
        "20428",
        "11013",
        "11027",
        "40"
      ]
    },
    {
      "hadith_no": "4943",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، قال الزهري حدثناه قال حدثني أبو إدريس، سمع عبادة بن الصامت  رضى الله عنه  قال كنا عند النبي صلى الله عليه وسلم فقال ‏\"‏ أتبايعوني على أن لا تشركوا بالله شيئا ولا تزنوا ولا تسرقوا ‏\"‏‏.‏ وقرأ آية النساء  وأكثر لفظ سفيان قرأ الآية  ‏\"‏ فمن وفى منكم فأجره على الله، ومن أصاب من ذلك شيئا فعوقب فهو كفارة له، ومن أصاب منها شيئا من ذلك فستره الله فهو إلى الله، إن شاء عذبه وإن شاء غفر له‏}‏ ‏\"‏‏.‏ تابعه عبد الرزاق عن معمر في الآية‏.‏",
      "text_en": " Narrated 'Ubada bin As-Samit:                     While we were with the Prophet, he said, \"Will you swear to me the pledge of allegiance that you will not worship any thing besides Allah, will not commit illegal sexual intercourse, and will not steal?\" Then he recited the Verse concerning the women. (Sufyan, the subnarrator, often said that the Prophet: added, \"Whoever among you fulfills his pledge, will receive his reward from Allah, and whoever commits any of those sins and receives the legal punishment (in this life), his punishment will be an expiation for that sin; and whoever commits any of those sins and Allah screens him, then it is up to Allah to punish or forgive them.\"",
      "chain": [
        "30026",
        "20005",
        "11027",
        "40"
      ]
    },
    {
      "hadith_no": "6118",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا مسدد، حدثنا بشر بن المفضل، عن حميد، قال قال أنس حدثني عبادة بن الصامت، قال خرج رسول الله صلى الله عليه وسلم ليخبر الناس بليلة القدر، فتلاحى رجلان من المسلمين، قال النبي صلى الله عليه وسلم ‏\"‏ خرجت لأخبركم، فتلاحى فلان وفلان وإنها رفعت، وعسى أن يكون خيرا لكم، فالتمسوها في التاسعة والسابعة والخامسة ‏\"‏‏.‏",
      "text_en": " Narrated 'Ubada bin As-Samit:                     Allah's Apostle went out to inform the people about the (date of the Night of decree (Al-Qadr). There happened a quarrel between two Muslim men. The Prophet said, \"I came out to inform you about the Night of Al-Qadr, but as so-and-so and so-and-so quarrelled, so the news about it had been taken away; and may be it was better for you. So look for it in the ninth, the seventh, or the fifth (of the last ten days of Ramadan).",
      "chain": [
        "30175",
        "20212",
        "11279",
        "19",
        "40"
      ]
    },
    {
      "hadith_no": "6586",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا حجاج، حدثنا همام، حدثنا قتادة، عن أنس، عن عبادة بن الصامت، عن النبي صلى الله عليه وسلم قال ‏\"‏ من أحب لقاء الله أحب الله لقاءه، ومن كره لقاء الله كره الله لقاءه ‏\"‏‏.‏ قالت عائشة أو بعض أزواجه إنا لنكره الموت‏.‏ قال ‏\"‏ ليس ذاك، ولكن المؤمن إذا حضره الموت بشر برضوان الله وكرامته، فليس شىء أحب إليه مما أمامه، فأحب لقاء الله وأحب الله لقاءه، وإن الكافر إذا حضر بشر بعذاب الله وعقوبته، فليس شىء أكره إليه مما أمامه، كره لقاء الله وكره الله لقاءه ‏\"‏‏.‏ اختصره أبو داود وعمرو عن شعبة‏.‏ وقال سعيد عن قتادة عن زرارة عن سعد عن عائشة عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated 'Ubada bin As-Samit:                     The Prophet said, \"Who-ever loves to meet Allah, Allah (too) loves to meet him and who-ever hates to meet Allah, Allah (too) hates to meet him\". `Aisha, or some of the wives of the Prophet said, \"But we dislike death.\" He said: It is not like this, but it is meant that when the time of the death of a believer approaches, he receives the good news of Allah's pleasure with him and His blessings upon him, and so at that time nothing is dearer to him than what is in front of him. He therefore loves the meeting with Allah, and Allah (too) loves the meeting with him. But when the time of the death of a disbeliever approaches, he receives the evil news of Allah's torment and His Requital, whereupon nothing is more hateful to him than what is before him. Therefore, he hates the meeting with Allah, and Allah too, hates the meeting with him.\"",
      "chain": [
        "20219",
        "20297",
        "11019",
        "19",
        "40"
      ]
    },
    {
      "hadith_no": "6871",
      "source": " Sahih Bukhari ",
      "chapter": "Limits and Punishments set by Allah (Hudood) - كتاب الحدود",
      "chapter_no": "86",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا ابن عيينة، عن الزهري، عن أبي إدريس الخولاني، عن عبادة بن الصامت  رضى الله عنه  قال كنا عند النبي صلى الله عليه وسلم في مجلس فقال ‏\"‏ بايعوني على أن لا تشركوا بالله شيئا ولا تسرقوا، ولا تزنوا ‏\"‏‏.‏ وقرأ هذه الآية كلها ‏\"‏ فمن وفى منكم فأجره على الله ومن أصاب من ذلك شيئا فعوقب به، فهو كفارته، ومن أصاب من ذلك شيئا، فستره الله عليه، إن شاء غفر له، وإن شاء عذبه ‏\"‏‏.‏",
      "text_en": " Narrated 'Ubada bin As-Samit:                     We were with the Prophet in a gathering and he said, 'Swear allegiance to me that you will not worship anything besides Allah, Will not steal, and will not commit illegal sexual intercourse.\" And then (the Prophet) recited the whole Verse (i.e. 60:12). The Prophet added, 'And whoever among you fulfills his pledge, his reward is with Allah; and whoever commits something of such sins and receives the legal punishment for it, that will be considered as the expiation for that sin, and whoever commits something of such sins and Allah screens him, it is up to Allah whether to excuse or punish him.\"",
      "chain": [
        "30388",
        "20005",
        "11013",
        "11027",
        "40"
      ]
    },
    {
      "hadith_no": "6889",
      "source": " Sahih Bukhari ",
      "chapter": "Limits and Punishments set by Allah (Hudood) - كتاب الحدود",
      "chapter_no": "86",
      "text_ar": "حدثنا عبد الله بن محمد الجعفي، حدثنا هشام بن يوسف، أخبرنا معمر، عن الزهري، عن أبي إدريس، عن عبادة بن الصامت  رضى الله عنه  قال بايعت رسول الله صلى الله عليه وسلم في رهط، فقال ‏\"‏ أبايعكم على أن لا تشركوا بالله شيئا، ولا تسرقوا، ولا تقتلوا أولادكم، ولا تأتوا ببهتان تفترونه بين أيديكم وأرجلكم، ولا تعصوني في معروف، فمن وفى منكم فأجره على الله، ومن أصاب من ذلك شيئا فأخذ به في الدنيا فهو كفارة له وطهور، ومن ستره الله فذلك إلى الله، إن شاء عذبه وإن شاء غفر له ‏\"‏‏.‏ قال أبو عبد الله إذا تاب السارق بعد ما قطع يده، قبلت شهادته، وكل محدود كذلك إذا تاب قبلت شهادته‏.‏",
      "text_en": " Narrated Ubada bin As-Samit:                     I gave the pledge of allegiance to the Prophet with a group of people, and he said, \"I take your pledge that you will not worship anything besides Allah, will not steal, will not commit infanticide, will not slander others by forging false statements and spreading it, and will not disobey me in anything good. And whoever among you fulfill all these (obligations of the pledge), his reward is with Allah. And whoever commits any of the above crimes and receives his legal punishment in this world, that will be his expiation and purification. But if Allah screens his sin, it will be up to Allah, Who will either punish or forgive him according to His wish.\" Abu `Abdullah said: \"If a thief repents after his hand has been cut off, the his witness well be accepted. Similarly, if any person upon whom any legal punishment has been inflicted, repents, his witness will be accepted.\"",
      "chain": [
        "30351",
        "20467",
        "20115",
        "11013",
        "11027",
        "40"
      ]
    },
    {
      "hadith_no": "6957",
      "source": " Sahih Bukhari ",
      "chapter": "Blood Money (Ad-Diyat) - كتاب الديات",
      "chapter_no": "88",
      "text_ar": "حدثنا عبد الله بن يوسف، حدثنا الليث، حدثنا يزيد، عن أبي الخير، عن الصنابحي، عن عبادة بن الصامت  رضى الله عنه  قال إني من النقباء الذين بايعوا رسول الله صلى الله عليه وسلم بايعناه على أن لا نشرك بالله شيئا، ولا نسرق ولا نزني، ولا نقتل النفس التي حرم الله، ولا ننتهب، ولا نعصي، بالجنة إن فعلنا ذلك، فإن غشينا من ذلك شيئا كان قضاء ذلك إلى الله‏.‏",
      "text_en": " Narrated 'Ubada bin As-Samat:                     I was among those Naqibs (selected leaders) who gave the Pledge of allegiance to Allah's Apostle. We gave the oath of allegiance, that we would not join partners in worship besides Allah, would not steal, would not commit illegal sexual intercourse, would not kill a life which Allah has forbidden, would not commit robbery, would not disobey (Allah and His Apostle), and if we fulfilled this pledge we would have Paradise, but if we committed any one of these (sins), then our case will be decided by Allah.",
      "chain": [
        "30355",
        "20023",
        "20472",
        "11410",
        "5144",
        "40"
      ]
    },
    {
      "hadith_no": "7073",
      "source": " Sahih Bukhari ",
      "chapter": "Interpretation of Dreams - كتاب التعبير",
      "chapter_no": "92",
      "text_ar": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن قتادة، عن أنس بن مالك، عن عبادة بن الصامت، عن النبي صلى الله عليه وسلم قال ‏\"‏ رؤيا المؤمن جزء من ستة وأربعين جزءا من النبوة ‏\"‏‏.‏",
      "text_en": " Narrated 'Ubada bin As-Samit:                     The Prophet said, \"The (good) dreams of a faithful believer is a part of the forty-six parts of prophetism:'",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11019",
        "19",
        "40"
      ]
    },
    {
      "hadith_no": "7285",
      "source": " Sahih Bukhari ",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثنا إسماعيل، حدثني مالك، عن يحيى بن سعيد، قال أخبرني عبادة بن الوليد، أخبرني أبي، عن عبادة بن الصامت، قال بايعنا رسول الله صلى الله عليه وسلم على السمع والطاعة في المنشط والمكره‏.‏",
      "text_en": " Narrated 'Ubada bin As-Samit:                     We gave the oath of allegiance to Allah's Apostle that we would listen to and obey him both at the time when we were active and at the time when we were tired and that we would not fight against the ruler or disobey him, and would stand firm for the truth or say the truth wherever we might be, and in the Way of Allah we would not be afraid of the blame of the blamers. (See Hadith No. 178 and 320)",
      "chain": [
        "30103",
        "20001",
        "11062",
        "12201",
        "631",
        "40"
      ]
    },
    {
      "hadith_no": "7299",
      "source": " Sahih Bukhari ",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، وقال الليث، حدثني يونس، عن ابن شهاب، أخبرني أبو إدريس الخولاني، أنه سمع عبادة بن الصامت، يقول قال لنا رسول الله صلى الله عليه وسلم ونحن في مجلس ‏\"‏ تبايعوني على أن لا تشركوا بالله شيئا، ولا تسرقوا، ولا تزنوا، ولا تقتلوا أولادكم، ولا تأتوا ببهتان تفترونه بين أيديكم وأرجلكم ولا تعصوا في معروف، فمن وفى منكم فأجره على الله، ومن أصاب من ذلك شيئا فعوقب في الدنيا فهو كفارة له، ومن أصاب من ذلك شيئا فستره الله فأمره إلى الله إن شاء عاقبه وإن شاء عفا عنه ‏\"‏، فبايعناه على ذلك‏.‏",
      "text_en": " Narrated 'Ubada bin As-Samit:                     Allah's Apostle said to us while we were in a gathering, \"Give me the oath (Pledge of allegiance for: (1) Not to join anything in worship along with Allah, (2) Not to steal, (3) Not to commit illegal sexual intercourse, (4) Not to kill your children, (5) Not to accuse an innocent person (to spread such an accusation among people), (6) Not to be disobedient (when ordered) to do good deeds. The Prophet added: Whoever amongst you fulfill his pledge, his reward will be with Allah, and whoever commits any of those sins and receives the legal punishment in this world for that sin, then that punishment will be an expiation for that sin, and whoever commits any of those sins and Allah does not expose him, then it is up to Allah if He wishes He will punish him or if He wishes, He will forgive him.\" So we gave the Pledge for that. (See Hadith No. 17, Vol. 1)",
      "chain": [
        "30330",
        "20428",
        "11013",
        "20023",
        "20475",
        "11013",
        "11027",
        "40"
      ]
    },
    {
      "hadith_no": "7558",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا عبد الله المسندي، حدثنا هشام، أخبرنا معمر، عن الزهري، عن أبي إدريس، عن عبادة بن الصامت، قال بايعت رسول الله صلى الله عليه وسلم في رهط فقال ‏\"‏ أبايعكم على أن لا تشركوا بالله شيئا، ولا تسرقوا، ولا تزنوا، ولا تقتلوا أولادكم، ولا تأتوا ببهتان تفترونه بين أيديكم وأرجلكم ولا تعصوني في معروف، فمن وفى منكم فأجره على الله، ومن أصاب من ذلك شيئا فأخذ به في الدنيا فهو له كفارة وطهور، ومن ستره الله فذلك إلى الله إن شاء عذبه وإن شاء غفر له ‏\"‏‏.‏",
      "text_en": " Narrated 'Ubada bin As-Samit:                     I, along with a group of people, gave the pledge of allegiance to Allah's Apostle. He said, \"I take your Pledge on the condition that you (1) will not join partners in worship with Allah, (2) will not steal, (3) will not commit illegal sexual intercourse, (4) will not kill your offspring, (5) will not slander, (6) and will not disobey me when I order you to do good. Whoever among you will abide by his pledge, his reward will be with Allah, and whoever commits any of those sins and receives the punishment in this world, that punishment will be an expiation for his sins and purification; but if Allah screens him, then it will be up to Allah to punish him if He will or excuse Him, if He will.\"",
      "chain": [
        "30351",
        "20295",
        "20115",
        "11013",
        "11027",
        "40"
      ]
    },
    {
      "hadith_no": "149",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا داود بن رشيد، حدثنا الوليد، - يعني ابن مسلم - عن ابن جابر، قال حدثني عمير بن هانئ، قال حدثني جنادة بن أبي أمية، حدثنا عبادة بن الصامت، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من قال أشهد أن لا إله إلا الله وحده لا شريك له وأن محمدا عبده ورسوله وأن عيسى عبد الله وابن أمته وكلمته ألقاها إلى مريم وروح منه وأن الجنة حق وأن النار حق أدخله الله من أى أبواب الجنة الثمانية شاء ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Ubadah b. Samit that the messenger of Allah (may peace be upon him) observed:                      He who said:\" There is no god but Allah, He is One and there is no associate with Him, that Muhammad is his servant and His messenger, that Christ is servant and the son of His slave-girl and he (Christ) His word which He communicated to Mary and is His Spirit, that Paradise is a fact and Hell is a fact,\" Allah would make him (he who affirms these truths enter Paradise through any one of its eight doors which he would like.",
      "chain": [
        "30248",
        "20733",
        "11415",
        "3205",
        "40"
      ]
    },
    {
      "hadith_no": "151",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا ليث، عن ابن عجلان، عن محمد بن يحيى بن حبان، عن ابن محيريز، عن الصنابحي، عن عبادة بن الصامت، أنه قال دخلت عليه وهو في الموت فبكيت فقال مهلا لم تبكي فوالله لئن استشهدت لأشهدن لك ولئن شفعت لأشفعن لك ولئن استطعت لأنفعنك ثم قال والله ما من حديث سمعته من رسول الله صلى الله عليه وسلم لكم فيه خير إلا حدثتكموه إلا حديثا واحدا وسوف أحدثكموه اليوم وقد أحيط بنفسي سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من شهد أن لا إله إلا الله وأن محمدا رسول الله حرم الله عليه النار ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Sunabihi that he went to Ubada b. Samit when he was about to die. I burst into tears. Upon this he said to me:                      Allow me some time (so that I may talk with you). Why do you weep? By Allah, if I am asked to bear witness, I would certainly testify for you (that you are a believer). Should I be asked to intercede, I would certainly intercede for you, and if I have the power, I would certainly do good to you, and then observed: By Allah, never did I hear anything from the Messenger of Allah (may peace be upon him) which could have been a source of benefit to you and then not conveyed it to you except this single hadith. That I intend to narrate to you today, since I am going to breathe my last. I heard the Messenger of Allah (may peace be upon him) say: He who testifies that there is no god but Allah and that Muhammad is the messenger of Allah, Allah would prohibit the fire of Hell for him.",
      "chain": [
        "30367",
        "20023",
        "10616",
        "11222",
        "5144",
        "40"
      ]
    },
    {
      "hadith_no": "394",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثني أبو الطاهر، حدثنا ابن وهب، عن يونس، ح وحدثني حرملة بن يحيى، أخبرنا ابن وهب، أخبرني يونس، عن ابن شهاب، أخبرني محمود بن الربيع، عن عبادة بن الصامت، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا صلاة لمن لم يقترئ بأم القرآن ‏\"‏ ‏.‏",
      "text_en": " Ubada b. as-Samit reported:                      The Messenger of Allah (may peace be upon him) said: He who does not recite Umm al-Qur'an is not credited with having observed the prayer.",
      "chain": [
        "20029",
        "20475",
        "30487",
        "20029",
        "20475",
        "11013",
        "5278",
        "40"
      ]
    },
    {
      "hadith_no": "4147",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعمرو الناقد، وإسحاق بن إبراهيم، - واللفظ لابن أبي شيبة - قال إسحاق أخبرنا وقال الآخران، حدثنا وكيع، حدثنا سفيان، عن خالد، الحذاء عن أبي قلابة، عن أبي الأشعث، عن عبادة بن الصامت، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الذهب بالذهب والفضة بالفضة والبر بالبر والشعير بالشعير والتمر بالتمر والملح بالملح مثلا بمثل سواء بسواء يدا بيد فإذا اختلفت هذه الأصناف فبيعوا كيف شئتم إذا كان يدا بيد ‏\"‏ ‏.‏",
      "text_en": " Ubida b. al-Simit (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      Gold is to be paid for by gold, silver by silver, wheat by wheat, barley by barley, dates by dates, and salt by salt, like for like and equal for equal, payment being made hand to hand. If these classes differ, then sell as you wish if payment is made hand to hand.",
      "chain": [
        "30201",
        "30263",
        "30123",
        "30312",
        "20032",
        "20012",
        "11282",
        "11047",
        "30121",
        "40"
      ]
    },
    {
      "hadith_no": "4509",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Punishments Prescribed by Islam - كتاب الحدود",
      "chapter_no": "30",
      "text_ar": "وحدثنا يحيى بن يحيى التميمي، أخبرنا هشيم، عن منصور، عن الحسن، عن حطان، بن عبد الله الرقاشي عن عبادة بن الصامت، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ خذوا عني خذوا عني قد جعل الله لهن سبيلا البكر بالبكر جلد مائة ونفى سنة والثيب بالثيب جلد مائة والرجم ‏\"‏ ‏.‏",
      "text_en": " 'Ubada b. as-Samit reported:                      Allah's Messenger (may peace be upon him) as saying: Receive (teaching) from me, receive (teaching) from me. Allah has ordained a way for those (women). When an unmarried male commits adultery with an unmarried female (they should receive) one hundred lashes and banishment for one year. And in case of married male committing adultery with a married female, they shall receive one hundred lashes and be stoned to death.",
      "chain": [
        "30399",
        "20468",
        "11067",
        "11016",
        "10676",
        "40"
      ]
    },
    {
      "hadith_no": "4511",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Punishments Prescribed by Islam - كتاب الحدود",
      "chapter_no": "30",
      "text_ar": "حدثنا محمد بن المثنى، وابن، بشار جميعا عن عبد الأعلى، قال ابن المثنى حدثنا عبد الأعلى، حدثنا سعيد، عن قتادة، عن الحسن، عن حطان بن عبد الله الرقاشي، عن عبادة بن الصامت، قال كان نبي الله صلى الله عليه وسلم إذا أنزل عليه كرب لذلك وتربد له وجهه - قال - فأنزل عليه ذات يوم فلقي كذلك فلما سري عنه قال ‏\"‏ خذوا عني فقد جعل الله لهن سبيلا الثيب بالثيب والبكر بالبكر الثيب جلد مائة ثم رجم بالحجارة والبكر جلد مائة ثم نفى سنة ‏\"‏ ‏.‏",
      "text_en": " 'Ubada b. as-Samit reported that whenever Allah's Apostle (may peace be upon him) received revelation, he felt its rigour and the complexion of his face changed. One day revelation descended upon him, he felt the same rigour. When it was over and he felt relief, he said:                      Take from me. Verily Allah has ordained a way for them (the women who commit fornication),: (When) a married man (commits adultery) with a married woman, and an unmarried male with an unmarried woman, then in case of married (persons) there is (a punishment) of one hundred lashes and then stoning (to death). And in case of unmarried persons, (the punishment) is one hundred lashes and exile for one year.",
      "chain": [
        "30170",
        "20246",
        "20246",
        "11168",
        "11019",
        "11016",
        "10676",
        "40"
      ]
    },
    {
      "hadith_no": "4558",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Punishments Prescribed by Islam - كتاب الحدود",
      "chapter_no": "30",
      "text_ar": "حدثنا يحيى بن يحيى التميمي، وأبو بكر بن أبي شيبة وعمرو الناقد وإسحاق بن إبراهيم وابن نمير كلهم عن ابن عيينة، - واللفظ لعمرو قال حدثنا سفيان بن عيينة، عن الزهري، عن أبي إدريس، عن عبادة بن الصامت، قال كنا مع رسول الله صلى الله عليه وسلم في مجلس فقال ‏\"‏ تبايعوني على أن لا تشركوا بالله شيئا ولا تزنوا ولا تسرقوا ولا تقتلوا النفس التي حرم الله إلا بالحق فمن وفى منكم فأجره على الله ومن أصاب شيئا من ذلك فعوقب به فهو كفارة له ومن أصاب شيئا من ذلك فستره الله عليه فأمره إلى الله إن شاء عفا عنه وإن شاء عذبه ‏\"‏ ‏.‏",
      "text_en": " Ubida b. as-Samit reported:                      While we were in the company of Allah's Messenger (may peace be upoi him) he said: Swear allegiance to me that you will not associate anything with Allah, that you will not commit adultery, that you will not steal, that you will not take any life which it is forbidden by Allah to take but with (legal) justification; and whoever among you fulfils it, his reward is with Allah and he who commits any such thing and is punished for it, that will be all atonement for it And if anyone commits anything and Allah conceals (his faultfls), his matter rests with Allah. He may forgive if He likes, and He may punish him if He likes.",
      "chain": [
        "30399",
        "20005",
        "11013",
        "11027",
        "40"
      ]
    },
    {
      "hadith_no": "4560",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Punishments Prescribed by Islam - كتاب الحدود",
      "chapter_no": "30",
      "text_ar": "وحدثني إسماعيل بن سالم، أخبرنا هشيم، أخبرنا خالد، عن أبي قلابة، عن أبي الأشعث الصنعاني، عن عبادة بن الصامت، قال أخذ علينا رسول الله صلى الله عليه وسلم كما أخذ على النساء أن لا نشرك بالله شيئا ولا نسرق ولا نزني ولا نقتل أولادنا ولا يعضه بعضنا بعضا ‏\"‏ فمن وفى منكم فأجره على الله ومن أتى منكم حدا فأقيم عليه فهو كفارته ومن ستره الله عليه فأمره إلى الله إن شاء عذبه وإن شاء غفر له ‏\"‏ ‏.‏",
      "text_en": " 'Ubida b. as-Samit reported:                      Allah's Messenger (may peace be upon him) took (a pledge) from us as he took from the women that we will not associate anything with Allah and we will not steal, and we will not commit adultery, and we will not kill our children, and we will not bring calumny upon one another. And he who amongst you fulfils (this pledge), his reward rests with Allah, and he upon whom amongst you is imposed the prescribed punishment and that is carried out, that is his expiation (for that sin), and he whose (sins) were covered by Allah, his matter rests with Allah. He may punish him if He likes or may forgive him if He so likes.",
      "chain": [
        "30415",
        "20468",
        "11282",
        "11047",
        "10917",
        "40"
      ]
    },
    {
      "hadith_no": "4561",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Punishments Prescribed by Islam - كتاب الحدود",
      "chapter_no": "30",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا ليث، ح وحدثنا محمد بن رمح، أخبرنا الليث، عن يزيد بن أبي حبيب، عن أبي الخير، عن الصنابحي، عن عبادة بن الصامت، أنه قال إني لمن النقباء الذين بايعوا رسول الله صلى الله عليه وسلم وقال بايعناه على أن لا نشرك بالله شيئا ولا نزني ولا نسرق ولا نقتل النفس التي حرم الله إلا بالحق ولا ننتهب ولا نعصي فالجنة إن فعلنا ذلك فإن غشينا من ذلك شيئا كان قضاء ذلك إلى الله ‏.‏ وقال ابن رمح كان قضاؤه إلى الله ‏.‏",
      "text_en": " Ubida b. as-Samit repnrted:                      I was one of those headmen who swore allegiance to Allah's Messenger (may peace be upon him) that we will not associate anything with Allah, and will not commit adultery, and will not steal, and will not kill any soul which Allah has forbidden, but with justice nor plunder, nor disobey (Allah and His Apostle), then Paradise (will be the reward) in case we do these (acts) ; and if we commit any outrage (and that goes unpunished in the world), it is Allah Who would decide about it. Ibn Rumh said: Its judgment lies with Allah.",
      "chain": [
        "30367",
        "20023",
        "30490",
        "20023",
        "11411",
        "11410",
        "5144",
        "40"
      ]
    },
    {
      "hadith_no": "6046",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Vision - كتاب الرؤيا",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، وأبو داود ح وحدثني زهير بن حرب، حدثنا عبد الرحمن بن مهدي، كلهم عن شعبة، ح وحدثنا عبيد، الله بن معاذ - واللفظ له - حدثنا أبي، حدثنا شعبة، عن قتادة، عن أنس بن مالك، عن  عبادة بن الصامت، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ رؤيا المؤمن جزء من ستة وأربعين جزءا من النبوة ‏\"‏ ‏.‏",
      "text_en": " Ubida b. as-Samit reported Allah's Messenger (may peace be upon him) as saying:                      The vision of a believer is the forty-sixth part of Prophecy.",
      "chain": [
        "30170",
        "30160",
        "20173",
        "30002",
        "30022",
        "20020",
        "13898",
        "20020",
        "11019",
        "19",
        "40"
      ]
    },
    {
      "hadith_no": "6206",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثنا محمد بن المثنى، حدثنا عبد الأعلى، حدثنا سعيد، عن قتادة، عن الحسن، عن حطان بن عبد الله، عن عبادة بن الصامت، قال كان نبي الله صلى الله عليه وسلم إذا أنزل عليه الوحى كرب لذلك وتربد وجهه ‏.‏",
      "text_en": " 'Ubida b. Samit reported that when wahi (inspiration) descended upon Allah's Messenger (may peace be upon him), he felt a burden on that account and the colour of his face underwent a change.",
      "chain": [
        "30170",
        "20246",
        "11168",
        "11019",
        "11016",
        "40"
      ]
    },
    {
      "hadith_no": "6207",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا محمد بن بشار، حدثنا معاذ بن هشام، حدثنا أبي، عن قتادة، عن الحسن، عن حطان بن عبد الله الرقاشي، عن عبادة بن الصامت، قال كان النبي صلى الله عليه وسلم إذا أنزل عليه الوحى نكس رأسه ونكس أصحابه رءوسهم فلما أتلي عنه رفع رأسه ‏.‏",
      "text_en": " 'Ubida b. Samit reported that when wahi descended upon Allah's Apostle (may peace be upon him), he lowered his head and so lowered his Companions their heads, and when (this state) was over, he raised his head.",
      "chain": [
        "30160",
        "20287",
        "20295",
        "11019",
        "11016",
        "10676",
        "40"
      ]
    },
    {
      "hadith_no": "6996",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا هداب بن خالد، حدثنا همام، حدثنا قتادة، عن أنس بن مالك، عن عبادة، بن الصامت أن نبي الله صلى الله عليه وسلم قال ‏\"‏ من أحب لقاء الله أحب الله لقاءه ومن كره لقاء الله كره الله لقاءه ‏\"‏ ‏.‏",
      "text_en": " Ubida b. Samit reported Allah's Messenger (may peace be upon him) as saying:                      He who loves to meet Allah, Allah also loves to meet him, and he who dislikes to meet Allah, Allah also abhors to meet him.",
      "chain": [
        "20297",
        "11019",
        "19",
        "40"
      ]
    },
    {
      "hadith_no": "6997",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "وحدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن قتادة، قال سمعت أنس بن مالك، يحدث عن عبادة بن الصامت، عن النبي صلى الله عليه وسلم مثله ‏.‏",
      "text_en": " This hadith has been narrated on the authority of 'Ubada b. Samit through another chain of transmitters.",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "11019",
        "19",
        "40"
      ]
    },
    {
      "hadith_no": "433",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن قدامة بن أعين، حدثنا جرير، عن منصور، عن هلال بن يساف، عن أبي المثنى، عن ابن أخت، عبادة بن الصامت عن عبادة بن الصامت، ح وحدثنا محمد بن سليمان الأنباري، حدثنا وكيع، عن سفيان، - المعنى - عن منصور، عن هلال بن يساف، عن أبي المثنى الحمصي، عن أبي أبى ابن امرأة، عبادة بن الصامت عن عبادة بن الصامت، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إنها ستكون عليكم بعدي أمراء تشغلهم أشياء عن الصلاة لوقتها حتى يذهب وقتها فصلوا الصلاة لوقتها ‏\"‏ ‏.‏ فقال رجل يا رسول الله أصلي معهم قال ‏\"‏ نعم إن شئت ‏\"‏ ‏.‏ وقال سفيان إن أدركتها معهم أأصلي معهم قال ‏\"‏ نعم إن شئت ‏\"‏ ‏.‏",
      "text_en": " Narrated Ubadah ibn as-Samit:                     After me you will come under rulers who will be detained from saying prayer at its proper time by (their) works until its time has run out, so offer prayer at its proper time. A man asked him: Messenger of Allah, may I offer prayer with them? He replied: Yes, if you wish (to do so). Sufyan (another narrator through a different chain)said: May I offer prayer with them if I get it with them? He said: Yes, if you wish to do so.",
      "chain": [
        "38573",
        "20028",
        "11067",
        "10835",
        "40",
        "31160",
        "20032",
        "11067",
        "10835"
      ]
    },
    {
      "hadith_no": "823",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا محمد بن سلمة، عن محمد بن إسحاق، عن مكحول، عن محمود بن الربيع، عن عبادة بن الصامت، قال كنا خلف رسول الله صلى الله عليه وسلم في صلاة الفجر فقرأ رسول الله صلى الله عليه وسلم فثقلت عليه القراءة فلما فرغ قال ‏\"‏ لعلكم تقرءون خلف إمامكم ‏\"‏ ‏.‏ قلنا نعم هذا يا رسول الله ‏.‏ قال ‏\"‏ لا تفعلوا إلا بفاتحة الكتاب فإنه لا صلاة لمن لم يقرأ بها ‏\"‏ ‏.‏",
      "text_en": " Narrated Ubadah ibn as-Samit:                     We were behind the Messenger of Allah (ﷺ) at the dawn prayer, and he recited (the passage), but the recitation became difficult for him. Then when he finished, he said: Perhaps you recite behind your imam? We replied: Yes, it is so, Messenger of Allah. He said: Do not do so except when it is Fatihat al-Kitab, for he who does not recite it is not credited with having prayed.",
      "chain": [
        "30352",
        "20672",
        "11107",
        "11066",
        "5278",
        "40"
      ]
    },
    {
      "hadith_no": "3156",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا أحمد بن صالح، حدثني ابن وهب، حدثني هشام بن سعد، عن حاتم بن أبي نصر، عن عبادة بن نسى، عن أبيه، عن عبادة بن الصامت، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ خير الكفن الحلة وخير الأضحية الكبش الأقرن ‏\"‏ ‏.‏",
      "text_en": " Narrated Ubadah ibn as-Samit:                     The Prophet (ﷺ) said: The best shroud is a lower garment and one which covers the whole body, and the best sacrifice is a horned ram.",
      "chain": [
        "30226",
        "20029",
        "20519",
        "40"
      ]
    },
    {
      "hadith_no": "3176",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا هشام بن بهرام المدائني، أخبرنا حاتم بن إسماعيل، حدثنا أبو الأسباط الحارثي، عن عبد الله بن سليمان بن جنادة بن أبي أمية، عن أبيه، عن جده، عن عبادة بن الصامت، قال كان رسول الله صلى الله عليه وسلم يقوم في الجنازة حتى توضع في اللحد فمر به حبر من اليهود فقال هكذا نفعل ‏.‏ فجلس النبي صلى الله عليه وسلم وقال ‏\"‏ اجلسوا خالفوهم ‏\"‏ ‏.‏",
      "text_en": " Narrated Ubadah ibn as-Samit:                     The Messenger of Allah (ﷺ) used to stand up for a funeral until the corpse was placed in the grave. A learned Jew (once) passed him and said: This is how we do. The Prophet (ﷺ) sat down and said: Sit down and act differently from them.",
      "chain": [
        "38681",
        "20159",
        "18523",
        "40"
      ]
    },
    {
      "hadith_no": "3349",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا الحسن بن علي، حدثنا بشر بن عمر، حدثنا همام، عن قتادة، عن أبي الخليل، عن مسلم المكي، عن أبي الأشعث الصنعاني، عن عبادة بن الصامت، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ الذهب بالذهب تبرها وعينها والفضة بالفضة تبرها وعينها والبر بالبر مدى بمدى والشعير بالشعير مدى بمدى والتمر بالتمر مدى بمدى والملح بالملح مدى بمدى فمن زاد أو ازداد فقد أربى ولا بأس ببيع الذهب بالفضة - والفضة أكثرهما - يدا بيد وأما نسيئة فلا ولا بأس ببيع البر بالشعير والشعير أكثرهما يدا بيد وأما نسيئة فلا ‏\"‏ ‏.‏ قال أبو داود روى هذا الحديث سعيد بن أبي عروبة وهشام الدستوائي عن قتادة عن مسلم بن يسار بإسناده ‏.‏",
      "text_en": " Narrated Ubadah ibn as-Samit:                     The Messenger of Allah (ﷺ) said: Gold is to be paid for with gold, raw and coined, silver with silver, raw and coined (in equal weight), wheat with wheat in equal measure, barley with barley in equal measure, dates with dates in equal measure, salt by salt with equal measure; if anyone gives more or asks more, he has dealt in usury. But there is no harm in selling gold for silver and silver (for gold), in unequal weight, payment being made on the spot. Do not sell them if they are to be paid for later. There is no harm in selling wheat for barley and barley (for wheat) in unequal measure, payment being made on the spot. If the payment is to be made later, then do not sell them.Abu Dawud said: This tradition has also been transmitted by Sa'id b. Abi 'Arubah, Hisham al-Dastawa'i and Qatadah from Muslim b. Yasar through his chain.",
      "chain": [
        "30115",
        "20211",
        "20297",
        "11019",
        "11291",
        "13118",
        "10917",
        "40"
      ]
    },
    {
      "hadith_no": "3350",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، حدثنا سفيان، عن خالد، عن أبي قلابة، عن أبي الأشعث الصنعاني، عن عبادة بن الصامت، عن النبي صلى الله عليه وسلم بهذا الخبر يزيد وينقص وزاد قال فإذا اختلفت هذه الأصناف فبيعوا كيف شئتم إذا كان يدا بيد ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by 'Ubadah b. al-Samit through a different chain of transmitters with some alternation. This version adds:                      \"He said: If these classes differ, sell as you wish if payment is made on the spot.\"",
      "chain": [
        "30201",
        "20032",
        "20012",
        "11282",
        "11047",
        "10917",
        "40"
      ]
    },
    {
      "hadith_no": "3416",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، وحميد بن عبد الرحمن الرؤاسي، عن مغيرة بن زياد، عن عبادة بن نسى، عن الأسود بن ثعلبة، عن عبادة بن الصامت، قال علمت ناسا من أهل الصفة الكتاب والقرآن فأهدى إلى رجل منهم قوسا فقلت ليست بمال وأرمي عنها في سبيل الله عز وجل لآتين رسول الله صلى الله عليه وسلم فلأسألنه فأتيته فقلت يا رسول الله رجل أهدى إلى قوسا ممن كنت أعلمه الكتاب والقرآن وليست بمال وأرمي عنها في سبيل الله ‏.‏ قال ‏\"‏ إن كنت تحب أن تطوق طوقا من نار فاقبلها ‏\"‏ ‏.‏",
      "text_en": " Narrated Ubaydah ibn as-Samit:                     I taught some persons of the people of Suffah writing and the Qur'an. A man of them presented to me a bow. I said: It cannot be reckoned  property; may I shoot with it in Allah's path? I must come to the Apostle of of Allah (ﷺ) and ask him (about it). So I came to him and said : Messenger of Allah (ﷺ), one of those whom I have been teaching writing and the Qur'an has presented me a bow, and as it cannot be reckoned property, may I shoot with it in Allah's path? He said: If you want to have a necklace of fire on you, accept it.",
      "chain": [
        "30201",
        "20032",
        "17002",
        "40"
      ]
    },
    {
      "hadith_no": "3417",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا عمرو بن عثمان، وكثير بن عبيد، قالا حدثنا بقية، حدثني بشر بن عبد الله بن يسار، قال عمرو حدثني عبادة بن نسى، عن جنادة بن أبي أمية، عن عبادة بن الصامت، نحو هذا الخبر - والأول أتم - فقلت ما ترى فيها يا رسول الله فقال ‏\"‏ جمرة بين كتفيك تقلدتها ‏\"‏ ‏.‏ أو ‏\"‏ تعلقتها ‏\"‏ ‏.‏",
      "text_en": " A similar tradition has also been transmitted by 'Ubadah b. al-Samit through a different chain of narrators, but the former tradition is more perfect. This version has:                      I said: What do you think about it, Messenger of Allah? He said: A live coal between your shoulders which you have put around your neck or hanged it.",
      "chain": [
        "10581",
        "38462",
        "20644",
        "11081",
        "3205",
        "40"
      ]
    },
    {
      "hadith_no": "4320",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا حيوة بن شريح، حدثنا بقية، حدثني بحير، عن خالد بن معدان، عن عمرو بن الأسود، عن جنادة بن أبي أمية، عن عبادة بن الصامت، أنه حدثهم أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إني قد حدثتكم عن الدجال حتى خشيت أن لا تعقلوا إن مسيح الدجال رجل قصير أفحج جعد أعور مطموس العين ليس بناتئة ولا جحراء فإن ألبس عليكم فاعلموا أن ربكم ليس بأعور ‏\"‏ ‏.‏ قال أبو داود عمرو بن الأسود ولي القضاء ‏.‏",
      "text_en": " Narrated Ubadah ibn as-Samit:                     The Prophet (ﷺ) said: I have told you so much about the Dajjal (Antichrist) that I am afraid you may not understand. The Antichrist is short, hen-toed, woolly-haired, one-eyed, an eye-sightless, and neither protruding nor deep-seated. If you are confused about him, know that your Lord is not one-eyed.Abu Dawud said: 'Amr bin Al-Aswad was appointed a judge.",
      "chain": [
        "26010",
        "20644",
        "11422",
        "11714",
        "3205",
        "40"
      ]
    },
    {
      "hadith_no": "4415",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن سعيد بن أبي عروبة، عن قتادة، عن الحسن، عن حطان بن عبد الله الرقاشي، عن عبادة بن الصامت، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ خذوا عني خذوا عني قد جعل الله لهن سبيلا الثيب بالثيب جلد مائة ورمى بالحجارة والبكر بالبكر جلد مائة ونفى سنة ‏\"‏ ‏.‏",
      "text_en": " ‘Ubadah b. al-Samit reported the Messenger of Allah(ﷺ) as sayings:                      Receive my teachings, receive my teachings. Allah has appointed a way for those women. If the parties have been married, they shall receive a hundred lashes and stoned to death. If the parties are unmarried, they shall receive a hundred lashes and banished for a year.",
      "chain": [
        "30175",
        "20031",
        "11073",
        "11019",
        "11016",
        "10676",
        "40"
      ]
    },
    {
      "hadith_no": "4417",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا محمد بن عوف الطائي، حدثنا الربيع بن روح بن خليد، حدثنا محمد بن خالد، - يعني الوهبي - حدثنا الفضل بن دلهم، عن الحسن، عن سلمة بن المحبق، عن عبادة بن الصامت، عن النبي صلى الله عليه وسلم بهذا الحديث فقال ناس لسعد بن عبادة يا أبا ثابت قد نزلت الحدود لو أنك وجدت مع امرأتك رجلا كيف كنت صانعا قال كنت ضاربهما بالسيف حتى يسكتا أفأنا أذهب فأجمع أربعة شهداء فإلى ذلك قد قضى الحاجة ‏.‏ فانطلقوا فاجتمعوا عند رسول الله صلى الله عليه وسلم فقالوا يا رسول الله ألم تر إلى أبي ثابت قال كذا وكذا فقال رسول الله صلى الله عليه وسلم ‏\"‏ كفى بالسيف شاهدا ‏\"‏ ‏.‏ ثم قال ‏\"‏ لا لا أخاف أن يتتايع فيها السكران والغيران ‏\"‏ ‏.‏ قال أبو داود روى وكيع أول هذا الحديث عن الفضل بن دلهم عن الحسن عن قبيصة بن حريث عن سلمة بن المحبق عن النبي صلى الله عليه وسلم ‏.‏ وإنما هذا إسناد حديث ابن المحبق أن رجلا وقع على جارية امرأته ‏.‏ قال أبو داود الفضل بن دلهم ليس بالحافظ كان قصابا بواسط ‏.‏",
      "text_en": " Narrated Ubadah ibn as-Samit:                     The tradition mentioned above (No. 4401) has also been transmitted by Ubadah ibn as-Samit through a different chain of narrators.  This version has: The people said to Sa'd ibn Ubadah: AbuThabit, the prescribed punishments have been revealed: if you find a man with your wife, what will you do?  He said: I shall strike them with a sword so much that they become silent (i.e. die). Should I go and gather four witnesses? Until that (time) the need would be fulfilled.  So they went away and gathered with the Messenger of Allah (ﷺ) and said: Messenger of Allah! did you not see AbuThabit. He said so-and-so.  The Messenger of Allah (ﷺ) said: The sword is a sufficient witness. He then said: No, no, a furious and a jealous man may follow this course.Abu Dawud said: This tradition has been transmitted by Waki' from al-Fadl b. Dilham from al-Hasan, from Qabisah b. Huraith, from Salamah b. al-Muhabbaq, from the Prophet (ﷺ). And this is the chain of the tradition narrated by Ibn al-Muhabbaq to the effect that a man had sexual intercourse with a slave girl of his wife.Abu Dawud said: Al-Fadl b. Dilham was not the memoriser of traditions. He was a butcher in Wasit.",
      "chain": [
        "38566",
        "28177",
        "28506",
        "24365",
        "11016",
        "5071",
        "40"
      ]
    },
    {
      "hadith_no": "4700",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا جعفر بن مسافر الهذلي، حدثنا يحيى بن حسان، حدثنا الوليد بن رباح، عن إبراهيم بن أبي عبلة، عن أبي حفصة، قال قال عبادة بن الصامت لابنه يا بنى إنك لن تجد طعم حقيقة الإيمان حتى تعلم أن ما أصابك لم يكن ليخطئك وما أخطأك لم يكن ليصيبك سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن أول ما خلق الله القلم فقال له اكتب ‏.‏ قال رب وماذا أكتب قال اكتب مقادير كل شىء حتى تقوم الساعة ‏\"‏ ‏.‏ يا بنى إني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من مات على غير هذا فليس مني ‏\"‏ ‏.‏",
      "text_en": " Ubadah b. al Samit said to his son :                      Sonny! You will not get the taste of the reality of faith until you know that what has come to you could not miss you, and that what has missed you could not come to you. I heard the Messenger of Allah (May peace be upon him) say : The first thing Allah created was pen. He said to it : Write. It asked : What should I write, my lord? He said : Write what was decreed about everything till the Last hour comes. Sonny! I heard the Messenger of Allah (May peace be upon him) say : He who dies on something other than this does not does not belong to me.",
      "chain": [
        "38132",
        "20300",
        "11667",
        "40"
      ]
    },
    {
      "hadith_no": "5018",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا شعبة، عن قتادة، عن أنس، عن عبادة بن الصامت، عن النبي صلى الله عليه وسلم قال ‏\"‏ رؤيا المؤمن جزء من ستة وأربعين جزءا من النبوة ‏\"‏ ‏.‏",
      "text_en": " ‘Ubadah b. al-Samit reported the Prophet (May peace be upon him) as saying :                      A believer’s vision is the forty-sixth part of Prophecy.",
      "chain": [
        "28531",
        "20020",
        "11019",
        "19",
        "40"
      ]
    },
    {
      "hadith_no": "5060",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا عبد الرحمن بن إبراهيم الدمشقي، حدثنا الوليد، قال قال الأوزاعي حدثني عمير بن هانئ، قال حدثني جنادة بن أبي أمية، عن عبادة بن الصامت، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من تعار من الليل فقال حين يستيقظ لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شىء قدير سبحان الله والحمد لله ولا إله إلا الله والله أكبر ولا حول ولا قوة إلا بالله ثم دعا رب اغفر لي ‏\"‏ ‏.‏ قال الوليد أو قال ‏\"‏ دعا استجيب له فإن قام فتوضأ ثم صلى قبلت صلاته ‏\"‏ ‏.‏",
      "text_en": " ‘Ubadah b. al-Samit reported the Messenger of Allah (May peace be upon him) as saying; If anyone is alarmed while asleep and he says when awakes :                      there is no god but Allah alone Who has no partner, to whom dominion belongs, to whom praise is due, and who has power over everything (omnipotent). Glory be to Allah, and praise be to Allah, and there is no god but Allah, and then he prays: O my Lord, forgive me. Abu Dawud said : Al-Walid’s version has; and he prays, his prayer will be answered. If he gets up, performs ablution, and prays, his prayer will be accepted.",
      "chain": [
        "20733",
        "20024",
        "11415",
        "3205",
        "40"
      ]
    },
    {
      "hadith_no": "247",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن يحيى بن أبي عمر المكي أبو عبد الله العدني، وعلي بن حجر، قالا حدثنا سفيان بن عيينة، عن الزهري، عن محمود بن الربيع، عن عبادة بن الصامت، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا صلاة لمن لم يقرأ بفاتحة الكتاب ‏\"‏ ‏.‏ قال وفي الباب عن أبي هريرة وعائشة وأنس وأبي قتادة وعبد الله بن عمرو ‏.‏ قال أبو عيسى حديث عبادة حديث حسن صحيح ‏.‏ والعمل عليه عند أكثر أهل العلم من أصحاب النبي صلى الله عليه وسلم منهم عمر بن الخطاب وعلي بن أبي طالب وجابر بن عبد الله وعمران بن حصين وغيرهم قالوا لا تجزئ صلاة إلا بقراءة فاتحة الكتاب ‏.‏ وقال علي بن أبي طالب كل صلاة لم يقرأ فيها بفاتحة الكتاب فهي خداج غير تمام ‏.‏ وبه يقول ابن المبارك والشافعي وأحمد وإسحاق ‏.‏ سمعت ابن أبي عمر يقول اختلفت إلى ابن عيينة ثمانية عشر سنة وكان الحميدي أكبر مني بسنة ‏.‏ وسمعت ابن أبي عمر يقول حججت سبعين حجة ماشيا على قدمى ‏.‏",
      "text_en": " Ubadah bin As-Samil narrated that :                     the Prophet said: \"There is no Salat for the one who does not recite Fatihatil-Kitab.\"",
      "chain": [
        "11222",
        "20387",
        "20005",
        "11013",
        "5278",
        "40"
      ]
    },
    {
      "hadith_no": "311",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا هناد، حدثنا عبدة بن سليمان، عن محمد بن إسحاق، عن مكحول، عن محمود بن الربيع، عن عبادة بن الصامت، قال صلى رسول الله صلى الله عليه وسلم الصبح فثقلت عليه القراءة فلما انصرف قال ‏\"‏ إني أراكم تقرءون وراء إمامكم ‏\"‏ ‏.‏ قال قلنا يا رسول الله إي والله ‏.‏ قال ‏\"‏ فلا تفعلوا إلا بأم القرآن فإنه لا صلاة لمن لم يقرأ بها ‏\"‏ ‏.‏ قال وفي الباب عن أبي هريرة وعائشة وأنس وأبي قتادة وعبد الله بن عمرو ‏.‏ قال أبو عيسى حديث عبادة حديث حسن ‏.‏ وروى هذا الحديث الزهري عن محمود بن الربيع عن عبادة بن الصامت عن النبي صلى الله عليه وسلم قال ‏\"‏ لا صلاة لمن لم يقرأ بفاتحة الكتاب ‏\"‏ ‏.‏ قال وهذا أصح ‏.‏ والعمل على هذا الحديث في القراءة خلف الإمام عند أكثر أهل العلم من أصحاب النبي صلى الله عليه وسلم والتابعين وهو قول مالك بن أنس وابن المبارك والشافعي وأحمد وإسحاق يرون القراءة خلف الإمام ‏.‏",
      "text_en": " Ubadah bin As-Samit narrated:                     \"Allah's Messenger prayed the Subh prayer, and he had difficulty with the recitation. When turned (after finishing) he said: 'I think that you are reciting behind your Imam?'\" He said: \"We said: 'Yes, Messenger of Allah, by Allah!' He said: 'Do not do that, except for Umm Al-Kitab, for there is no Salat for one who does not recite it.'\"",
      "chain": [
        "30480",
        "20337",
        "11107",
        "11066",
        "5278",
        "40"
      ]
    },
    {
      "hadith_no": "1020",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن بشار، حدثنا صفوان بن عيسى، عن بشر بن رافع، عن عبد الله بن سليمان بن جنادة بن أبي أمية، عن أبيه، عن جده، عن عبادة بن الصامت، قال كان رسول الله صلى الله عليه وسلم إذا اتبع الجنازة لم يقعد حتى توضع في اللحد فعرض له حبر فقال هكذا نصنع يا محمد ‏.‏ قال فجلس رسول الله صلى الله عليه وسلم وقال ‏\"‏ خالفوهم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏ وبشر بن رافع ليس بالقوي في الحديث ‏.‏",
      "text_en": " Ubadah bin As-Samit said:                     \"When the Messenger of Allah follows a corpse, he would not sit until (the deceased was) placed in the Lahd. A rabbi came upon him and said: 'This is what we do, O Muhammad'\" He said: \"So the Messenger of Allah sat, and he said: 'Differ from them.'\"",
      "chain": [
        "30160",
        "20553",
        "28061",
        "18523",
        "40"
      ]
    },
    {
      "hadith_no": "1066",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا أحمد بن مقدام أبو الأشعث العجلي، حدثنا المعتمر بن سليمان، قال سمعت أبي يحدث، عن قتادة، عن أنس، عن عبادة بن الصامت، عن النبي صلى الله عليه وسلم قال ‏\"‏ من أحب لقاء الله أحب الله لقاءه ومن كره لقاء الله كره الله لقاءه ‏\"‏ ‏.‏ وفي الباب عن أبي موسى وأبي هريرة وعائشة ‏.‏ قال أبو عيسى حديث عبادة بن الصامت حديث حسن صحيح ‏.‏",
      "text_en": " Ubadah bin As-Samit narrated that:                     The Prophet said: \"Whoever loves to meet Allah, then Allah loves to meet him. And whoever dislikes meeting Allah, then Allah dislikes meeting him.\"",
      "chain": [
        "20288",
        "11289",
        "11019",
        "19",
        "40"
      ]
    },
    {
      "hadith_no": "1240",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا سويد بن نصر، حدثنا عبد الله بن المبارك، أخبرنا سفيان، عن خالد الحذاء، عن أبي قلابة، عن أبي الأشعث، عن عبادة بن الصامت، عن النبي صلى الله عليه وسلم قال ‏\"‏ الذهب بالذهب مثلا بمثل والفضة بالفضة مثلا بمثل والتمر بالتمر مثلا بمثل والبر بالبر مثلا بمثل والملح بالملح مثلا بمثل والشعير بالشعير مثلا بمثل فمن زاد أو ازداد فقد أربى بيعوا الذهب بالفضة كيف شئتم يدا بيد وبيعوا البر بالتمر كيف شئتم يدا بيد وبيعوا الشعير بالتمر كيف شئتم يدا بيد ‏\"‏ ‏.‏ قال وفي الباب عن أبي سعيد وأبي هريرة وبلال وأنس ‏.‏ قال أبو عيسى حديث عبادة حديث حسن صحيح ‏.‏ وقد روى بعضهم هذا الحديث عن خالد بهذا الإسناد وقال ‏\"‏ بيعوا البر بالشعير كيف شئتم يدا بيد ‏\"‏ ‏.‏ وروى بعضهم هذا الحديث عن خالد عن أبي قلابة عن أبي الأشعث عن عبادة عن النبي صلى الله عليه وسلم الحديث وزاد فيه قال خالد قال أبو قلابة ‏\"‏ بيعوا البر بالشعير كيف شئتم ‏\"‏ فذكر الحديث ‏.‏ والعمل على هذا عند أهل العلم لا يرون أن يباع البر بالبر إلا مثلا بمثل والشعير بالشعير إلا مثلا بمثل فإذا اختلف الأصناف فلا بأس أن يباع متفاضلا إذا كان يدا بيد ‏.‏ وهذا قول أكثر أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم وهو قول سفيان الثوري والشافعي وأحمد وإسحاق ‏.‏ قال الشافعي والحجة في ذلك قول النبي صلى الله عليه وسلم ‏\"‏ بيعوا الشعير بالبر كيف شئتم يدا بيد ‏\"‏ ‏.‏ قال أبو عيسى وقد كره قوم من أهل العلم أن تباع الحنطة بالشعير إلا مثلا بمثل ‏.‏ وهو قول مالك بن أنس والقول الأول أصح ‏.‏",
      "text_en": " Narrated 'Ubadah bin As-Samit:                     That the Prophet (ﷺ) said: \"Gold for gold, kind for kind; silver for silver, kind for kind; dried-dates for dried-dates, kind for kind; wheat for wheat, kind for kind; salt for salt, kind for kind; and barley for barley, kind for kind. Whoever increases or seeks an increase, then he dealt with Riba. Sell gold for silver as you wish, hand to hand; and sell wheat for dried-dates as you wish, hand to hand; and sell barley for dried-dates as you wish, hand to hand.\"[He said:] There are narrations on this topic from Abu Sa'eed, Abu Hurairah, Bilal, And Anas.[Abu 'Eisa said:] The Hadith of 'Ubadah bin As-Samit is Hasan Sahih. Some of them reported this Hadith from Khalid, with this chain, and he said: \"Sell wheat for barley as you wish, hand to hand.\"Some of them reported this Hadith from Khalid, from Abu Qilabah, from Ash'ath, from 'Ubadah from the Prophet (ﷺ). In that Hadith, they added that Khalid said: \"Abu Qilabah said: \"Sell wheat for barley as you wish, hand to hand.\"This Hadith is acted upon according to the people of knowledge, they do not think that one may sell wheat for wheat except when it is the same kind for the same kind, and (the same for) barely in exchange for barley, kind for kind. When the items are themselves different, then there is no harm in one being more than the other if it is hand to hand. This is saying of most of the people of knowledge among the Companions of the Prophet (ﷺ) and others. It is the view of Sufyan Ath-Thawri, Ash-Shafi'i, Ahmad, and Ishaq. Ash-Shafi'i said: \"And the proof for that is the saying of the Prophet (ﷺ): 'Sell barley for wheat as you wish, hand to hand.'\"[Abu 'Eisa said:] Some of the people of knowledge considered it disliked that wheat be sold for barely unless it was kind for kind. This is the view of Malik bin Anas, but the first view is more correct.",
      "chain": [
        "38265",
        "20025",
        "20012",
        "11282",
        "11047",
        "30121",
        "40"
      ]
    },
    {
      "hadith_no": "1434",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Legal Punishments (Al-Hudud) - كتاب الحدود عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "17",
      "text_ar": "حدثنا قتيبة، حدثنا هشيم، عن منصور بن زاذان، عن الحسن، عن حطان بن عبد الله، عن عبادة بن الصامت، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ خذوا عني فقد جعل الله لهن سبيلا الثيب بالثيب جلد مائة ثم الرجم والبكر بالبكر جلد مائة ونفى سنة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ والعمل على هذا عند بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم منهم علي بن أبي طالب وأبى بن كعب وعبد الله بن مسعود وغيرهم قالوا الثيب تجلد وترجم ‏.‏ وإلى هذا ذهب بعض أهل العلم وهو قول إسحاق ‏.‏ وقال بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم منهم أبو بكر وعمر وغيرهما الثيب إنما عليه الرجم ولا يجلد ‏.‏ وقد روي عن النبي صلى الله عليه وسلم مثل هذا في غير حديث في قصة ماعز وغيره أنه أمر بالرجم ولم يأمر أن يجلد قبل أن يرجم ‏.‏ والعمل على هذا عند بعض أهل العلم وهو قول سفيان الثوري وابن المبارك والشافعي وأحمد ‏.‏",
      "text_en": " Narrated 'Ubadah bin As-Samit:                     \"The Messenger of Allah (ﷺ) said: 'Take from me. For Allah has a way made for them : For the married person who commits adultery with a married person is one hundred lashes, then stoning. And for the virgin who commits adultery with a virgin is one hundred lashes and banishment for a year.\"",
      "chain": [
        "30367",
        "20468",
        "11444",
        "11016",
        "40"
      ]
    },
    {
      "hadith_no": "1439",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Legal Punishments (Al-Hudud) - كتاب الحدود عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "17",
      "text_ar": "حدثنا قتيبة، حدثنا سفيان بن عيينة، عن الزهري، عن أبي إدريس الخولاني، عن عبادة بن الصامت، قال كنا عند النبي صلى الله عليه وسلم في مجلس فقال ‏\"‏ تبايعوني على أن لا تشركوا بالله شيئا ولا تسرقوا ولا تزنوا قرأ عليهم الآية فمن وفى منكم فأجره على الله ومن أصاب من ذلك شيئا فعوقب عليه فهو كفارة له ومن أصاب من ذلك شيئا فستره الله عليه فهو إلى الله إن شاء عذبه وإن شاء غفر له ‏\"‏ ‏.‏ قال وفي الباب عن علي وجرير بن عبد الله وخزيمة بن ثابت ‏.‏ قال أبو عيسى حديث عبادة بن الصامت حديث حسن صحيح ‏.‏ وقال الشافعي لم أسمع في هذا الباب أن الحدود تكون كفارة لأهلها شيئا أحسن من هذا الحديث ‏.‏ قال الشافعي وأحب لمن أصاب ذنبا فستره الله عليه أن يستر على نفسه ويتوب فيما بينه وبين ربه ‏.‏ وكذلك روي عن أبي بكر وعمر أنهما أمرا رجلا أن يستر على نفسه ‏.‏",
      "text_en": " Narrated 'Ubadah bin As-Samit:                     \"We were with the Prophet (ﷺ) [in a gathering] and he said: 'Pledge to me that you will not associate [anything as] partners with Allah, and that you will not steal nor commit adultery.' He recited to them the Ayah. (And he said:)'Whoever among you dies, then this reward is with Allah, and whoever among you does some of this and then he is punished, it is atonement for him. And whoever does some of this and Allah covers it for him, then it is up to Allah; if He wills, He will punish them, and if He wills, He will forgive him.'\"",
      "chain": [
        "30367",
        "20005",
        "11013",
        "11027",
        "40"
      ]
    },
    {
      "hadith_no": "1561",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Military Expeditions - كتاب السير عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "21",
      "text_ar": "حدثني محمد بن بشار، حدثنا عبد الرحمن بن مهدي، حدثنا سفيان، عن عبد الرحمن بن الحارث، عن سليمان بن موسى، عن مكحول، عن أبي سلام، عن أبي أمامة، عن عبادة بن الصامت، أن النبي صلى الله عليه وسلم كان ينفل في البدأة الربع وفي القفول الثلث ‏.‏ وفي الباب عن سعد وابن عباس وحبيب بن مسلمة ومعن بن يزيد وابن عمر وسلمة بن الأكوع ‏.‏ وحديث عبادة حديث حسن ‏.‏ وقد روي هذا الحديث عن أبي سلام عن رجل من أصحاب النبي صلى الله عليه وسلم.",
      "text_en": " Narrated 'Ubadah bin As-Samit:                     \"The Prophet (ﷺ) used to confer a fourth of spoils of war in the early part of the expedition, and a third during the return.\"There are narrations on this topic from Ibn 'Abbas, Habib bin Maslamh, Ma'n bin Yazid, Ibn 'Umar, and Salamah bin Al-Akwa'. This Hadith of 'Ubadah is a Hasan Hadith. This Hadith has also been reported from Abu Salam from a man among the Companions of the Prophet (ﷺ).",
      "chain": [
        "30160",
        "20033",
        "20012",
        "448",
        "10880",
        "11066",
        "405",
        "40"
      ]
    },
    {
      "hadith_no": "2440",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Dreams - كتاب الرؤيا عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "34",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود، عن شعبة، عن قتادة، أنه سمع أنسا، عن عبادة بن الصامت، أن النبي صلى الله عليه وسلم قال ‏\"‏ رؤيا المؤمن جزء من ستة وأربعين جزءا من النبوة ‏\"‏ ‏.‏ قال وفي الباب عن أبي هريرة وأبي رزين العقيلي وأبي سعيد وعبد الله بن عمرو وعوف بن مالك وابن عمر وأنس ‏.‏ قال وحديث عبادة حديث صحيح ‏.‏",
      "text_en": " 'Ubadah bin As-Samit narrated that the Prophet (s.a.w) said:                     \"The dreams of the believer are a portion of the forty-six portions of Prophet-hood\".",
      "chain": [
        "30277",
        "20547",
        "20020",
        "11019",
        "19",
        "40"
      ]
    },
    {
      "hadith_no": "2444",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Dreams - كتاب الرؤيا عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو داود، حدثنا حرب بن شداد، وعمران القطان، عن يحيى بن أبي كثير، عن أبي سلمة، قال نبئت عن عبادة بن الصامت، قال سألت رسول الله صلى الله عليه وسلم عن قوله ‏(‏لهم البشرى في الحياة الدنيا ‏)‏ قال ‏\"‏ هي الرؤيا الصالحة يراها المؤمن أو ترى له ‏\"‏ ‏.‏ قال حرب في حديثه حدثني يحيى بن أبي كثير ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏",
      "text_en": " It is narrated from 'Ubadah bin As-Samit, who said:                     \"[I asked]  the Messenger of Allah (s.a.w) about For them are glad tidings in the life of the present world. He said: 'This refers to the righteous dreams which the Muslim sees or which are seen about him.'\"",
      "chain": [
        "30160",
        "20547",
        "20220",
        "20718",
        "11449",
        "10567",
        "40"
      ]
    },
    {
      "hadith_no": "2309",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود، أخبرنا شعبة، عن قتادة، قال سمعت أنسا، يحدث عن عبادة بن الصامت، عن النبي صلى الله عليه وسلم قال ‏\"‏ من أحب لقاء الله أحب الله لقاءه ومن كره لقاء الله كره الله لقاءه ‏\"‏ ‏.‏ قال وفي الباب عن أبي هريرة وعائشة وأنس وأبي موسى ‏.‏ قال حديث عبادة حديث حسن صحيح ‏.‏",
      "text_en": " 'Ubadah bin As-Samit narrated that the Messenger of Allah (s.a.w)  said:                     \"Whoever loves to meet Allah,  Allah loves to meet him. Whoever is averse to meeting Allah, Allah is averse to meeting him.\"",
      "chain": [
        "30277",
        "20547",
        "20020",
        "11019",
        "19",
        "40"
      ]
    },
    {
      "hadith_no": "2723",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of Paradise - كتاب صفة الجنة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "38",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن، أخبرنا يزيد بن هارون، أخبرنا همام، حدثنا زيد بن أسلم، عن عطاء بن يسار، عن عبادة بن الصامت، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ في الجنة مائة درجة ما بين كل درجتين كما بين السماء والأرض والفردوس أعلاها درجة ومنها تفجر أنهار الجنة الأربعة ومن فوقها يكون العرش فإذا سألتم الله فسلوه الفردوس ‏\"‏ ‏.‏",
      "text_en": " 'Ubadah bin As-Samit narrated that the Messenger of Allah (s.a.w) said:                     \"In Paradise, there are a hundred levels, what is between every two levels is like what is between the heavens and the earth. Al-Firdaus is ts highest level, and from it the four rivers of Paradise are made to flow forth. So when you ask Allah, ask Him for Al-Firdaus.\"",
      "chain": [
        "30025",
        "20472",
        "20297",
        "11163",
        "11020",
        "40"
      ]
    },
    {
      "hadith_no": "2638",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Faith - كتاب الإيمان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "40",
      "text_ar": "حدثنا قتيبة، حدثنا الليث، عن ابن عجلان، عن محمد بن يحيى بن حبان، عن ابن محيريز، عن الصنابحي، عن عبادة بن الصامت، أنه قال دخلت عليه وهو في الموت فبكيت فقال مهلا لم تبكي فوالله لئن استشهدت لأشهدن لك ولئن شفعت لأشفعن لك ولئن استطعت لأنفعنك ثم قال والله ما من حديث سمعته من رسول الله صلى الله عليه وسلم لكم فيه خير إلا حدثتكموه إلا حديثا واحدا وسوف أحدثكموه اليوم وقد أحيط بنفسي سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من شهد أن لا إله إلا الله وأن محمدا رسول الله حرم الله عليه النار ‏\"‏ ‏.‏ وفي الباب عن أبي بكر وعمر وعثمان وعلي وطلحة وجابر وابن عمر وزيد بن خالد ‏.‏ قال سمعت ابن أبي عمر يقول سمعت ابن عيينة يقول محمد بن عجلان كان ثقة مأمونا في الحديث ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه والصنابحي هو عبد الرحمن بن عسيلة أبو عبد الله ‏.‏ وقد روي عن الزهري أنه سئل عن قول النبي صلى الله عليه وسلم ‏\"‏ من قال لا إله إلا الله دخل الجنة ‏\"‏ ‏.‏ فقال إنما كان هذا في أول الإسلام قبل نزول الفرائض والأمر والنهى ‏.‏ قال أبو عيسى ووجه هذا الحديث عند بعض أهل العلم أن أهل التوحيد سيدخلون الجنة وإن عذبوا بالنار بذنوبهم فإنهم لا يخلدون في النار ‏.‏ وقد روي عن عبد الله بن مسعود وأبي ذر وعمران بن حصين وجابر بن عبد الله وابن عباس وأبي سعيد الخدري وأنس بن مالك عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ سيخرج قوم من النار من أهل التوحيد ويدخلون الجنة ‏\"‏ ‏.‏ هكذا روي عن سعيد بن جبير وإبراهيم النخعي وغير واحد من التابعين وقد روي من غير وجه عن أبي هريرة عن النبي صلى الله عليه وسلم في تفسير هذه الآية‏:‏ ‏(‏ربما يود الذين كفروا لو كانوا مسلمين‏)‏ قالوا إذا أخرج أهل التوحيد من النار وأدخلوا الجنة يود الذين كفروا لو كانوا مسلمين ‏.‏",
      "text_en": " Narrated As-Sunabihi:                     from Ubadah bin As-Samit, he said: \"I entered upon him while he was dying, so I cried, and he said: \"There now, why are you crying? For by Allah, if I am a martyr , then I will intercede for you, and if I can I will benefit you,' then he said: 'By Allah! There is no Hadith which I heard from the Messenger of Allah (ﷺ) which is good for you but I narrate it to you today, while I am near death. I heard the Messenger of Allah (ﷺ) say: \"Whoever testifies to La Ilaha Illallah and that Muhammad is the Messenger of Allah, then Allah has forbidden the fire for him.\"",
      "chain": [
        "30367",
        "20023",
        "10616",
        "11222",
        "5144",
        "40"
      ]
    },
    {
      "hadith_no": "3414",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا الوليد بن مسلم، حدثنا الأوزاعي، حدثني عمير بن هانئ، قال حدثني جنادة بن أبي أمية، حدثني عبادة بن الصامت، رضى الله عنه عن رسول الله صلى الله عليه وسلم قال ‏\"‏ من تعار من الليل فقال لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شيء قدير وسبحان الله والحمد لله ولا إله إلا الله والله أكبر ولا حول ولا قوة إلا بالله ثم قال رب اغفر لي أو قال ثم دعا استجيب له فإن عزم فتوضأ ثم صلى قبلت صلاته ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏",
      "text_en": " Ubadah bin As-Samit, may Allah be pleased with him, narrated that:                     The Messenger of Allah said: “Whoever wakes up in the night and say, ‘None has the right to be worshipped but Allah, alone, without partner, to Him belongs the Dominion, and to Him is the praise, and He has power over all things. And Glory is to Allah, and all the praise is to Allah, and ‘None has the right to be worshipped but Allah, and Allah is the greatest, and there is no might nor power except by Allah (La Ilaha Illallah, Wahdahu La Sharika Lahu, Lahul-Mulku Wa Lahul-Hamdu, Wa Huwa ala Kulli Shai’in Qadir. Wa Subhan Allah, Walhamdullilah, Wa La Ilaha Illallah, Wa Allahu Akbar, Wa La Hawla Wa La Quwwata Illa Billah.)’ – then he said: ‘O my Lord, forgive me (Rabbighfirli)’ – or he said – ‘then he supplicates, he shall be responded to. So he makes a firm determination, then performs Wudu, then he performs Salat, his Salat shall be accepted.”",
      "chain": [
        "20733",
        "20024",
        "11415",
        "3205",
        "40"
      ]
    },
    {
      "hadith_no": "3573",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن الدارمي، أخبرنا محمد بن يوسف، عن ابن ثوبان، عن أبيه، عن مكحول، عن جبير بن نفير، أن عبادة بن الصامت، حدثهم أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ما على الأرض مسلم يدعو الله بدعوة إلا آتاه الله إياها أو صرف عنه من السوء مثلها ما لم يدع بمأثم أو قطيعة رحم ‏\"‏ ‏.‏ فقال رجل من القوم إذا نكثر ‏.‏ قال ‏\"‏ الله أكثر ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه وابن ثوبان هو عبد الرحمن بن ثابت بن ثوبان العابد الشامي ‏.‏",
      "text_en": " Jubair bin Nufair narrated that Ubadah bin As-Samit narrated to them that, the Messenger of Allah said:                     “There is not a Muslim upon the earth who calls upon Allah with any supplication, except that Allah grants it to him, or he turns away from him the like of it in evil; as long as he does not supplicate for something sinful, or the severing of the ties of kinship.” So a man from the people said: “What if we should increase (in it)” He said: “(With) Allah is more.”",
      "chain": [
        "30025",
        "30388",
        "11066",
        "4097",
        "40"
      ]
    },
    {
      "hadith_no": "910",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا محمد بن منصور، عن سفيان، عن الزهري، عن محمود بن الربيع، عن عبادة بن الصامت، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا صلاة لمن لم يقرأ بفاتحة الكتاب ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ubadah bin As-Samit that :                     The Prophet (ﷺ) said: \"There is no Salah for one who does not recite Fatihatil-Kitab.\"",
      "chain": [
        "36658",
        "20005",
        "11013",
        "5278",
        "40"
      ]
    },
    {
      "hadith_no": "911",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا سويد بن نصر، قال أنبأنا عبد الله، عن معمر، عن الزهري، عن محمود بن الربيع، عن عبادة بن الصامت، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا صلاة لمن لم يقرأ بفاتحة الكتاب فصاعدا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ubadah bin As-Samit said:                     \"The Messenger of Allah (ﷺ) said: \"There is no Salah for one who does not recite Fatihatil-Kitab or more.'\"",
      "chain": [
        "38265",
        "20025",
        "20115",
        "11013",
        "5278",
        "40"
      ]
    },
    {
      "hadith_no": "920",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا هشام بن عمار، عن صدقة، عن زيد بن واقد، عن حرام بن حكيم، عن نافع بن محمود بن ربيعة، عن عبادة بن الصامت، قال صلى بنا رسول الله صلى الله عليه وسلم بعض الصلوات التي يجهر فيها بالقراءة فقال ‏\"‏ لا يقرأن أحد منكم إذا جهرت بالقراءة إلا بأم القرآن ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ubadah bin As-Samit said:                     \"The Messenger of Allah (ﷺ) led us in one of the prayers in which the recitation is done out loud, and he said: 'None of you should recite when I recite out loud, apart from the Umm Al_quran (Al Fatihah).'\"",
      "chain": [
        "30288",
        "30343",
        "11671",
        "40"
      ]
    },
    {
      "hadith_no": "1837",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا أبو الأشعث، قال حدثنا المعتمر، قال سمعت أبي يحدث، عن قتادة، عن أنس بن مالك، عن عبادة بن الصامت، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أحب لقاء الله أحب الله لقاءه ومن كره لقاء الله كره الله لقاءه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Ubadah bin As-Samit said:                     \"The Messenger of Allah said: 'whoever loves to meet Allah, Allah loves to meet him, and whoever hates to meet Allah, Allah, hates to meet him.\"'",
      "chain": [
        "10917",
        "20288",
        "11289",
        "11019",
        "19",
        "40"
      ]
    },
    {
      "hadith_no": "3139",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرني هارون بن عبد الله، قال حدثنا يزيد بن هارون، قال أنبأنا حماد بن سلمة، عن جبلة بن عطية، عن يحيى بن الوليد، عن عبادة بن الصامت، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من غزا وهو لا يريد إلا عقالا فله ما نوى ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Ubadah bin As-Samit that the Messenger of Allah (ﷺ) said:                      \"Whoever fights seeking only an 'Iqbal, then he will have what he intended.\"",
      "chain": [
        "30524",
        "20472",
        "20021",
        "18116",
        "25357",
        "40"
      ]
    },
    {
      "hadith_no": "3159",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا هارون بن محمد بن بكار، قال حدثنا محمد بن عيسى، - وهو ابن القاسم بن سميع - قال حدثنا زيد بن واقد، عن كثير بن مرة، أن عبادة بن الصامت، حدثهم أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ما على الأرض من نفس تموت ولها عند الله خير تحب أن ترجع إليكم ولها الدنيا إلا القتيل فإنه يحب أن يرجع فيقتل مرة أخرى ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Kathir bin Murrah that the Messenger of Allah (ﷺ) said:                      \"There is no soul on Earth that dies, and is in a good position before Allah, that would like to come back to you, even if it had all this world, except the one who is killed (in the cause of Allah); he wishes that he could come back and be killed again.\"",
      "chain": [
        "37538",
        "27542",
        "11671",
        "19940",
        "40"
      ]
    },
    {
      "hadith_no": "4138",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Distribution of Al-Fay' - كتاب قسم الفىء",
      "chapter_no": "38",
      "text_ar": "أخبرنا عمرو بن يحيى بن الحارث، قال حدثنا محبوب، - يعني ابن موسى - قال أنبأنا أبو إسحاق، - وهو الفزاري - عن عبد الرحمن بن عياش، عن سليمان بن موسى، عن مكحول، عن أبي سلام، عن أبي أمامة الباهلي، عن عبادة بن الصامت، قال أخذ رسول الله صلى الله عليه وسلم يوم حنين وبرة من جنب بعير فقال ‏\"‏ يا أيها الناس إنه لا يحل لي مما أفاء الله عليكم قدر هذه إلا الخمس والخمس مردود عليكم ‏\"‏ ‏.‏ قال أبو عبد الرحمن اسم أبي سلام ممطور وهو حبشي واسم أبي أمامة صدى بن عجلان والله تعالى أعلم ‏.‏",
      "text_en": " It was narrated that 'Ubadah bin Al-Samit said:                     \"On the day of Hunain the Messenger of Allah took a hair from the side of a camel and said: 'O you people, it is not permissible for me to take even the equivalent of this from the Fay' that Allah has bestowed upon you, except the Khumus, and the Khumus will come back to you.\" (Sahih)Abu 'Abdur-Rahman (An-Nasa'i) said: Abu Sallam's name is Mamtur and he is Ethiopian, and Abu Umamah's name is Sudai bin 'Ajlan.",
      "chain": [
        "11210",
        "38625",
        "20405",
        "10880",
        "11066",
        "4048",
        "40"
      ]
    },
    {
      "hadith_no": "4149",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of al-Bay'ah - كتاب البيعة",
      "chapter_no": "39",
      "text_ar": "أخبرنا الإمام أبو عبد الرحمن النسائي، من لفظه قال أنبأنا قتيبة بن سعيد، قال حدثنا الليث، عن يحيى بن سعيد، عن عبادة بن الوليد بن عبادة بن الصامت، عن عبادة بن الصامت، قال بايعنا رسول الله صلى الله عليه وسلم على السمع والطاعة في اليسر والعسر والمنشط والمكره وأن لا ننازع الأمر أهله وأن نقوم بالحق حيث كنا لا نخاف لومة لائم ‏.‏",
      "text_en": " It was narrated that 'Ubadah bin As-Samit said:                     \"We pledged to the Messenger of Allah to hear and obey, both in times of ease and hardship, when we felt energetic and when we felt tired, that we would not contend with the orders of whomever was entrusted with it, that we would was entrusted with it, that we would stand firm in the way of truth wherever we may be, and that we would not fear the blame of the blamers.\"",
      "chain": [
        "30367",
        "20023",
        "11062",
        "12201",
        "40"
      ]
    },
    {
      "hadith_no": "4150",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of al-Bay'ah - كتاب البيعة",
      "chapter_no": "39",
      "text_ar": "أخبرنا عيسى بن حماد، قال أنبأنا الليث، عن يحيى بن سعيد، عن عبادة بن الوليد بن عبادة بن الصامت، عن أبيه، أن عبادة بن الصامت، قال بايعنا رسول الله صلى الله عليه وسلم على السمع والطاعة في العسر واليسر ‏.‏ وذكر مثله ‏.‏",
      "text_en": " It was narrated that 'Ubadah bin As-Samit said:                     \"We pledged to the Messenger of Allah to hear and obey, both in times of hardship and ease.\" And he mentioned similarly.",
      "chain": [
        "30412",
        "20023",
        "11062",
        "12201",
        "631",
        "40"
      ]
    },
    {
      "hadith_no": "4153",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of al-Bay'ah - كتاب البيعة",
      "chapter_no": "39",
      "text_ar": "أخبرنا هارون بن عبد الله، قال حدثنا أبو أسامة، قال حدثني الوليد بن كثير، قال حدثني عبادة بن الوليد، أن أباه الوليد، حدثه عن جده، عبادة بن الصامت قال بايعنا رسول الله صلى الله عليه وسلم على السمع والطاعة في عسرنا ويسرنا ومنشطنا ومكارهنا وعلى أن لا ننازع الأمر أهله وعلى أن نقول بالعدل أين كنا لا نخاف في الله لومة لائم ‏.‏",
      "text_en": " It was narrated that 'Ubadah bin As-Samit said:                     \"We pledged to the Messenger of Allah to hear and obey during our hardship and our ease, when we felt energetic and when we felt tired, that we would not contend with the orders of  whomever was entrusted with it, that we would stand for justice wherever we may be, and that we would not fear the blame of any blamer for the sake of Allah.",
      "chain": [
        "30524",
        "20318",
        "11230",
        "12201",
        "40"
      ]
    },
    {
      "hadith_no": "4161",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of al-Bay'ah - كتاب البيعة",
      "chapter_no": "39",
      "text_ar": "أخبرنا عبيد الله بن سعد بن إبراهيم بن سعد، قال حدثني عمي، قال حدثنا أبي، عن صالح، عن ابن شهاب، قال حدثني أبو إدريس الخولاني، أن عبادة بن الصامت، قال إن رسول الله صلى الله عليه وسلم قال وحوله عصابة من أصحابه ‏\"‏ تبايعوني على أن لا تشركوا بالله شيئا ولا تسرقوا ولا تزنوا ولا تقتلوا أولادكم ولا تأتوا ببهتان تفترونه بين أيديكم وأرجلكم ولا تعصوني في معروف فمن وفى فأجره على الله ومن أصاب منكم شيئا فعوقب به فهو له كفارة ومن أصاب من ذلك شيئا ثم ستره الله فأمره إلى الله إن شاء عفا عنه وإن شاء عاقبه ‏\"‏ ‏.‏ خالفه أحمد بن سعيد ‏.‏",
      "text_en": " It was narrated that 'Ubadah bin As-Samit said:                     \"While there was a group of his companions around him, the Messenger of Allah said: 'Pledge to me, that you will not associate anything with Allah, nor steal, nor commit unlawful sexual relations, nor kill your children; you will not utter slander, fabricating from between your hands and feet, and you will not disobey me in goodness (Ma'ruf). Whoever fulfills (this pledge), his reward will be with Allah, and whoever commits any of these actions and is punished for it, it will be an expiation for him. Whoever commits any of these actions then Allah conceals him, then his affair is up to Allah; if He wills He will forgive him, and if He wills punish him.\"' (Sahih)Ahmed bin Sa'eed contradicted him.",
      "chain": [
        "11176",
        "11013",
        "11027",
        "40"
      ]
    },
    {
      "hadith_no": "4162",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of al-Bay'ah - كتاب البيعة",
      "chapter_no": "39",
      "text_ar": "أخبرني أحمد بن سعيد، قال حدثنا يعقوب، قال حدثنا أبي، عن صالح بن كيسان، عن الحارث بن فضيل، أن ابن شهاب، حدثه عن عبادة بن الصامت، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ألا تبايعوني على ما بايع عليه النساء أن لا تشركوا بالله شيئا ولا تسرقوا ولا تزنوا ولا تقتلوا أولادكم ولا تأتوا ببهتان تفترونه بين أيديكم وأرجلكم ولا تعصوني في معروف ‏\"‏ ‏.‏ قلنا بلى يا رسول الله فبايعناه على ذلك فقال رسول الله صلى الله عليه وسلم ‏\"‏ فمن أصاب بعد ذلك شيئا فنالته عقوبة فهو كفارة ومن لم تنله عقوبة فأمره إلى الله إن شاء غفر له وإن شاء عاقبه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Ubadah bin As-Samit that the Messenger of Allah said:                     \"Why don't you pledge to me upon that which the women have pledged: That you will not associate anything with Allah, that you will not steal, that you will not have unlawful sexual relations, that you will not utter slander, fabricating from between your hands and feet, and that you will not disobey me in goodness (Ma'ruf)?\" We said: \"yes, O Messenger of Allah.\" So we gave him our pledge, on that basis. The Messenger of Allah said: \"Whoever commits any of these actions after that, and is punished, that will be an expiation. Whoever is not punished, then his affair is up to Allah; if He wills, He will forgive him, and if He wills, He will punish him.\"",
      "chain": [
        "30296",
        "20184",
        "20150",
        "11176",
        "11835",
        "11013",
        "40"
      ]
    },
    {
      "hadith_no": "4178",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of al-Bay'ah - كتاب البيعة",
      "chapter_no": "39",
      "text_ar": "أخبرنا يعقوب بن إبراهيم، قال حدثنا غندر، قال أنبأنا معمر، قال أنبأنا ابن شهاب، عن أبي إدريس الخولاني، قال سمعت عبادة بن الصامت، قال بايعت رسول الله صلى الله عليه وسلم في رهط فقال ‏\"‏ أبايعكم على أن لا تشركوا بالله شيئا ولا تسرقوا ولا تزنوا ولا تقتلوا أولادكم ولا تأتوا ببهتان تفترونه بين أيديكم وأرجلكم ولا تعصوني في معروف فمن وفى منكم فأجره على الله ومن أصاب من ذلك شيئا فعوقب فيه فهو طهوره ومن ستره الله فذاك إلى الله إن شاء عذبه وإن شاء غفر له ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Idris Al-Khawlani said:                     \"I heard 'Ubadah bin As-Samit say: 'I pledged to the Messenger of Allah among a group of people, and he said: I accept your pledge that you will not associate anything with Allah, you will not steal, you will not have unlawful sexual relations, you will not kill you children, you will not utter slander, fabricating from between your hands and feet, and you will not disobey me when commanded with goodness. Whoever fulfills (this pledge), his reward will be with Allah, and whoever commits any of these actions and is punished for it, it will be purification for him. Whoever (commits any of these action then) Allah conceals him, it is up to Allah; if He wills He will forgive him, and if He wills, He will punish him.\"'",
      "chain": [
        "20184",
        "20278",
        "20115",
        "11013",
        "11027",
        "40"
      ]
    },
    {
      "hadith_no": "4210",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of al-Bay'ah - كتاب البيعة",
      "chapter_no": "39",
      "text_ar": "أخبرنا قتيبة، قال حدثنا سفيان، عن الزهري، عن أبي إدريس الخولاني، عن عبادة بن الصامت، قال كنا عند النبي صلى الله عليه وسلم في مجلس فقال ‏\"‏ بايعوني على أن لا تشركوا بالله شيئا ولا تسرقوا ولا تزنوا ‏\"‏ ‏.‏ وقرأ عليهم الآية ‏\"‏ فمن وفى منكم فأجره على الله ومن أصاب من ذلك شيئا فستر الله عليه فهو إلى الله عز وجل إن شاء عذبه وإن شاء غفر له ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Ubadah bin As-Samit said:                     \"We were with the Prophet in a gathering and he said: 'Pledge to me that you will not associate anything with Allah, you will not steal, and you will not have unlawful sexual relations.' He recited the Verse to them (and said) Whoever does any of these things, and Allah conceals him then it is up to Allah, the mighty and Sublime: If He wills, He will punish him, and if He wills, He will forgive him.",
      "chain": [
        "30367",
        "20005",
        "11013",
        "11027",
        "40"
      ]
    },
    {
      "hadith_no": "4563",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرني محمد بن آدم، عن عبدة، عن ابن أبي عروبة، عن قتادة، عن مسلم بن يسار، عن أبي الأشعث الصنعاني، عن عبادة بن الصامت، - وكان بدريا وكان بايع النبي صلى الله عليه وسلم أن لا يخاف في الله لومة لائم - أن عبادة قام خطيبا فقال أيها الناس إنكم قد أحدثتم بيوعا لا أدري ما هي ألا إن الذهب بالذهب وزنا بوزن تبرها وعينها وإن الفضة بالفضة وزنا بوزن تبرها وعينها ولا بأس ببيع الفضة بالذهب يدا بيد والفضة أكثرهما ولا تصلح النسيئة ألا إن البر بالبر والشعير بالشعير مديا بمدى ولا بأس ببيع الشعير بالحنطة يدا بيد والشعير أكثرهما ولا يصلح نسيئة ألا وإن التمر بالتمر مديا بمدى حتى ذكر الملح مدا بمد فمن زاد أو استزاد فقد أربى ‏.‏",
      "text_en": " It was narrated from 'Ubdah bin As-Samit-who had been present at Badar and had given his pledge to the Prophet swearing not to fear the blame of any blamer for the sake of Allah that 'Ubadah stood up to deliver a speech and said:                     \"O people, you have invented kinds of transactions, I do not know what they are, but make sure it is gold for gold, of the same weight, or silver for silver, of the same weight. There is nothing wrong with selling silver for gold, hand to hand, giving more silver than gold, but no credit is allowed. When you sell wheat for wheat and barley for barley, it should be measure for measure, but there is nothing wrong with selling barley for wheat, hand to hand, giving more barley than wheat, but no credit is allowed. And when you sell dates for dates, it should be measure for measure\" And he mentioned salt, \"measure for measure, and whoever gives more or asks for more has engaged in Riba.",
      "chain": [
        "20337",
        "11073",
        "11019",
        "13118",
        "10917",
        "40"
      ]
    },
    {
      "hadith_no": "4564",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا محمد بن المثنى، ويعقوب بن إبراهيم، قالا حدثنا عمرو بن عاصم، قال حدثنا همام، قال حدثنا قتادة، عن أبي الخليل، عن مسلم المكي، عن أبي الأشعث الصنعاني، عن عبادة بن الصامت، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الذهب بالذهب تبره وعينه وزنا بوزن والفضة بالفضة تبره وعينه وزنا بوزن والملح بالملح والتمر بالتمر والبر بالبر والشعير بالشعير سواء بسواء مثلا بمثل فمن زاد أو ازداد فقد أربى ‏\"‏ ‏.‏ واللفظ لمحمد لم يذكر يعقوب ‏\"‏ والشعير بالشعير ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Ubadah bin As-Samit said:                     \"The messenger of Allah said: 'Gold for gold, of equal measure; silver for silver, of equal measure; salt for salt, dates for dates wheat for wheat, barley for barley, like for like. Whoever gives more or  takes more has engaged in Riba.\"' (Sahih)The wording is that of Muhammad Yaqub did not mention - \"Wheat for wheat\".",
      "chain": [
        "30170",
        "20184",
        "20267",
        "11447",
        "11019",
        "11291",
        "13118",
        "10917",
        "40"
      ]
    },
    {
      "hadith_no": "4566",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرني هارون بن عبد الله، قال حدثنا أبو أسامة، قال قال إسماعيل حدثنا حكيم بن جابر، ح وأنبأنا يعقوب بن إبراهيم، قال حدثنا يحيى، عن إسماعيل، قال حدثنا حكيم بن جابر، عن عبادة بن الصامت، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ الذهب الكفة بالكفة ‏\"‏ ‏.‏ ولم يذكر يعقوب ‏\"‏ الكفة بالكفة ‏\"‏ ‏.‏ فقال معاوية إن هذا لا يقول شيئا ‏.‏ قال عبادة إني والله ما أبالي أن لا أكون بأرض يكون بها معاوية إني أشهد أني سمعت رسول الله صلى الله عليه وسلم يقول ذلك ‏.‏",
      "text_en": " It was narrated that 'Ubadah bin As-Samit said:                     \"I heard the Messenger of Allah say: 'Gold, equal amount.\"' (One of the narrators) Yaqub did not mention: \"Equal amount.\" Muawiyah said: \"This does not mean anything.\" 'Ubadah said; \"By Allah I do not care if I am in a land where Muawiyah is not present. I bear witness that I heard the Messenger of Allah say that.\"",
      "chain": [
        "30524",
        "20318",
        "11418",
        "20184",
        "11449",
        "11418",
        "40"
      ]
    },
    {
      "hadith_no": "5002",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book Of Faith and its Signs - كتاب الإيمان وشرائعه",
      "chapter_no": "47",
      "text_ar": "أخبرنا قتيبة، قال حدثنا سفيان، عن الزهري، عن أبي إدريس الخولاني، عن عبادة بن الصامت، قال كنا عند النبي صلى الله عليه وسلم في مجلس فقال ‏\"‏ تبايعوني على أن لا تشركوا بالله شيئا ولا تسرقوا ولا تزنوا ‏\"‏ ‏.‏ قرأ عليهم الآية ‏\"‏ فمن وفى منكم فأجره على الله ومن أصاب من ذلك شيئا فستره الله عز وجل فهو إلى الله إن شاء عذبه وإن شاء غفر له ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Ubadah bin As-Samit said:                     \"We were with the Prophet [SAW] in a gathering and he said: 'Give me your pledge that you will not associate anything with Allah, you will not steal and you will not have unlawful sexual relations'- and then he recited the Verse to them. 'Whoever among you fulfills this pledge, his reward will be with Allah, and whoever commits any of those actions and Allah, the Mighty and Sublime, conceals him, it is up to Allah: If He wills, He will punish him, and if He wills, He will forgive him.\"",
      "chain": [
        "30367",
        "20005",
        "11013",
        "11027",
        "40"
      ]
    },
    {
      "hadith_no": "886",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا هشام بن عمار، وسهل بن أبي سهل، وإسحاق بن إسماعيل، قالوا حدثنا سفيان بن عيينة، عن الزهري، عن محمود بن الربيع، عن عبادة بن الصامت، أن النبي  صلى الله عليه وسلم  قال ‏\"‏ لا صلاة لمن لم يقرأ فيها بفاتحة الكتاب ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Ubadah bin Samit that the Prophet (ﷺ) said:                     “Thereis no prayer for the one who does not recite Fatihatil-Kitab init.”",
      "chain": [
        "30288",
        "38259",
        "20005",
        "11013",
        "5278",
        "40"
      ]
    },
    {
      "hadith_no": "1315",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو أحمد، حدثنا سفيان، عن منصور، عن هلال بن يساف، عن أبي المثنى، عن أبي أبى ابن امرأة، عبادة بن الصامت يعني عن عبادة بن الصامت، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ سيكون أمراء تشغلهم أشياء يؤخرون الصلاة عن وقتها فاجعلوا صلاتكم معهم تطوعا ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Ubadah bin Samit that the Prophet (ﷺ) said:                     “Therewill be leaders who will be distracted by matters and they willdelaythe prayer until after its proper time. So make your prayer withthemvoluntary.”",
      "chain": [
        "30160",
        "20355",
        "20012",
        "11067",
        "10835",
        "40"
      ]
    },
    {
      "hadith_no": "1465",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن بشار، حدثنا ابن أبي عدي، عن شعبة، عن عبد ربه بن سعيد، عن محمد بن يحيى بن حبان، عن ابن محيريز، عن المخدجي، عن عبادة بن الصامت، قال سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ خمس صلوات افترضهن الله على عباده فمن جاء بهن لم ينتقص منهن شيئا استخفافا بحقهن فإن الله جاعل له يوم القيامة عهدا أن يدخله الجنة ومن جاء بهن قد انتقص منهن شيئا استخفافا بحقهن لم يكن له عند الله عهد إن شاء عذبه وإن شاء غفر له ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Ubadah bin Samit said:                      “I heard the MessengerofAllah (ﷺ) say: ‘Five prayers that Allah has enjoined upon Hisslaves, so whoever does them, and does not omit anything out ofnegligence, on the Day of Resurrection Allah will make a covenantwithhim that He will admit him to Paradise. But whoever does thembutomits something from them out of negligence, will not have such acovenant with Allah; if He wills He will punish him, and if He wills,He will forgive him.’”",
      "chain": [
        "30160",
        "20276",
        "20020",
        "11191",
        "11222",
        "40"
      ]
    },
    {
      "hadith_no": "1490",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا العباس بن عثمان الدمشقي، حدثنا الوليد بن مسلم، عن خالد بن يزيد المري، عن يونس بن ميسرة بن حلبس، عن الصنابحي، عن عبادة بن الصامت، أنه سمع رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ ما من عبد يسجد لله سجدة إلا كتب الله له بها حسنة ومحا عنه بها سيئة ورفع له بها درجة فاستكثروا من السجود ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Ubadah bin Samit that he heard the Messenger ofAllah (ﷺ) say:                      “No one prostrates to Allah but Allah will recordoneHasanah (good reward) for him, and will erase thereby one baddeed andraise him in status one degree. So prostrate a great deal.”",
      "chain": [
        "20733",
        "27507",
        "19201",
        "5144",
        "40"
      ]
    },
    {
      "hadith_no": "1540",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا يونس بن عبد الأعلى، حدثنا ابن وهب، أنبأنا هشام بن سعد، عن حاتم بن أبي نصر، عن عبادة بن نسى، عن أبيه، عن عبادة بن الصامت، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ خير الكفن الحلة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Ubadah bin Samit that the Messenger of Allah(ﷺ)said:                      “The best of shrouds is the Hullah (two-piecer).”",
      "chain": [
        "30493",
        "20029",
        "20519",
        "40"
      ]
    },
    {
      "hadith_no": "1612",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن بشار، وعقبة بن مكرم، قالا حدثنا صفوان بن عيسى، حدثنا بشر بن رافع، عن عبد الله بن سليمان بن جنادة بن أبي أمية، عن أبيه، عن جده، عن عبادة بن الصامت، قال كان رسول الله  صلى الله عليه وسلم  إذا اتبع جنازة لم يقعد حتى توضع في اللحد فعرض له حبر فقال هكذا نصنع يا محمد ‏.‏ فجلس رسول الله  صلى الله عليه وسلم  وقال ‏\"‏ خالفوهم ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Ubadah bin Samit said:                      “When the Messenger ofAllah (ﷺ) followed a funeral, he would not sit down until it hadbeen placed in the niche-grave. A rabbi came to him and said: ‘Thisiswhat we do, O Muhammad!’ So the Messenger of Allah (ﷺ) satdown andsaid: ‘Be different from them.’”",
      "chain": [
        "30160",
        "30441",
        "20553",
        "28061",
        "18523",
        "40"
      ]
    },
    {
      "hadith_no": "2241",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا علي بن محمد، ومحمد بن إسماعيل، قالا حدثنا وكيع، حدثنا مغيرة بن زياد الموصلي، عن عبادة بن نسى، عن الأسود بن ثعلبة، عن عبادة بن الصامت، قال علمت ناسا من أهل الصفة القرآن والكتابة فأهدى إلى رجل منهم قوسا فقلت ليست بمال وأرمي عنها في سبيل الله فسألت رسول الله  صلى الله عليه وسلم  عنها فقال ‏\"‏ إن سرك أن تطوق بها طوقا من نار فاقبلها ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Ubadah bin Samit said:                     \"I taught people from Ahtus-Suffah\" Qur'an and how to write, and one of them gave me a bow. I said: 'It is not money, and I can shoot (with it) for the sake of Allah., I asked the Messenger of Allah (ﷺ) about it and he said: 'If it would please you to have a necklace of fire placed around your neck, then accept it.'\"",
      "chain": [
        "38409",
        "34188",
        "20032",
        "19947",
        "17002",
        "40"
      ]
    },
    {
      "hadith_no": "2298",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا عبد ربه بن خالد النميري أبو المغلس، حدثنا الفضيل بن سليمان، عن موسى بن عقبة، حدثني إسحاق بن يحيى بن الوليد بن عبادة بن الصامت، عن عبادة بن الصامت، قال قضى رسول الله  صلى الله عليه وسلم  أن ثمر النخل لمن أبرها إلا أن يشترط المبتاع وأن مال المملوك لمن باعه إلا أن يشترط المبتاع ‏.‏",
      "text_en": " It was narrated that 'Ubadah bin Samit said:                     \"The Messenger of Allah (ﷺ) ruled that the fruit of a palm tree belongs to the one who pollinated it, and that the wealth of a slave belongs to the one who sold him, unless the purchaser stipulated a condition.\"",
      "chain": [
        "20271",
        "11106",
        "40"
      ]
    },
    {
      "hadith_no": "2340",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Rulings - كتاب الأحكام",
      "chapter_no": "13",
      "text_ar": "حدثنا عبد ربه بن خالد النميري أبو المغلس، حدثنا فضيل بن سليمان، حدثنا موسى بن عقبة، حدثنا إسحاق بن يحيى بن الوليد، عن عبادة بن الصامت، أن رسول الله صلى الله عليه وسلم قضى أن ‏\"‏ لا ضرر ولا ضرار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Ubadah bin Samit that the Messenger of Allah (ﷺ) ruled:                     “There should be neither harming nor reciprocating harm.”",
      "chain": [
        "20271",
        "11106",
        "40"
      ]
    },
    {
      "hadith_no": "2577",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Pawning - كتاب الرهون",
      "chapter_no": "16",
      "text_ar": "حدثنا أبو المغلس، حدثنا فضيل بن سليمان، حدثنا موسى بن عقبة، عن إسحاق بن يحيى بن الوليد، عن عبادة بن الصامت، أن رسول الله صلى الله عليه وسلم قضى في شرب النخل من السيل أن الأعلى فالأعلى يشرب قبل الأسفل ويترك الماء إلى الكعبين ثم يرسل الماء إلى الأسفل الذي يليه وكذلك حتى تنقضي الحوائط أو يفنى الماء ‏.‏",
      "text_en": " It was narrated from 'Ubadah bin Samit that :                     the Messenger of Allah (ﷺ) ruled concerning the irrigation of palm trees from streams, that the higher ground should be irrigated before the lower, and that the water should be allowed to reach the ankles, then released to flow the nearest lower ground, and so on, until all the fields were watered or until the water ran out.",
      "chain": [
        "20271",
        "11106",
        "40"
      ]
    },
    {
      "hadith_no": "2582",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Pawning - كتاب الرهون",
      "chapter_no": "16",
      "text_ar": "حدثنا عبد ربه بن خالد النميري أبو المغلس، حدثنا الفضيل بن سليمان، حدثنا موسى بن عقبة، أخبرني إسحاق بن يحيى بن الوليد، عن عبادة بن الصامت، أن رسول الله صلى الله عليه وسلم قضى في النخلة والنخلتين والثلاثة للرجل في النخل فيختلفون في حقوق ذلك فقضى أن لكل نخلة من أولئك من الأرض مبلغ جريدها حريم لها ‏.‏",
      "text_en": " It was narrated from 'Ubadah bin Samit that :                     the Messenger of Allah (ﷺ) ruled concerning one, two or three date palms belonging to a man among other palm trees - when they differ concerning entitlement to the surrounding land. He ruled that the land around each of those trees, as far as their leaves reach, measured from the bottom of the tree, belongs to the owner of the tree.",
      "chain": [
        "20271",
        "11106",
        "40"
      ]
    },
    {
      "hadith_no": "2637",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا عبد الله بن سالم المفلوج، حدثنا عبيدة بن الأسود، عن القاسم بن الوليد، عن أبي صادق، عن ربيعة بن ناجد، عن عبادة بن الصامت، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أقيموا حدود الله في القريب والبعيد ولا تأخذكم في الله لومة لائم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from `Ubadah bin Samit that the Messenger of Allah (ﷺ) said:                     “Carry out the legal punishments on relatives and strangers, and do not let the fear of blame stop you from carrying out the command of Allah (SWT).”",
      "chain": [
        "15143",
        "40"
      ]
    },
    {
      "hadith_no": "2647",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا بكر بن خلف أبو بشر، حدثنا يحيى بن سعيد، عن سعيد بن أبي عروبة، عن قتادة، عن يونس بن جبير، عن حطان بن عبد الله، عن عبادة بن الصامت، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ خذوا عني خذوا عني قد جعل الله لهن سبيلا البكر بالبكر جلد مائة وتغريب سنة والثيب بالثيب جلد مائة والرجم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from `Ubadah bin Samit that the Messenger of Allah (ﷺ) said:                     “Learn from me. Allah (SWT) has ordained for them (women) another way. (If) a virgin (commits illegal sexual intercourse)  with a virgin, (the punishment is) one hundred lashes and exile for one year. (If) a Thayyib (commits adultery) with a Thayyib (the punishment is) one hundred lashes and stoning.”",
      "chain": [
        "34043",
        "20031",
        "11073",
        "11019",
        "11320",
        "40"
      ]
    },
    {
      "hadith_no": "2701",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا عبد الوهاب، وابن أبي عدي، عن خالد الحذاء، عن أبي قلابة، عن أبي الأشعث، عن عبادة بن الصامت، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أصاب منكم حدا فعجلت له عقوبته فهو كفارته وإلا فأمره إلى الله ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ubadah bin Samit that the Messenger of Allah (ﷺ) said:                     “Whoever among you undergoes a Hadd, his punishment has been brought forward, and it is an expiation for him otherwise his case rests with Allah.”",
      "chain": [
        "30170",
        "20259",
        "20276",
        "11282",
        "11047",
        "30121",
        "40"
      ]
    },
    {
      "hadith_no": "2745",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا عبد ربه بن خالد النميري، حدثنا الفضيل بن سليمان، حدثنا موسى بن عقبة، عن إسحاق بن يحيى بن الوليد، عن عبادة بن الصامت، أن النبي صلى الله عليه وسلم قضى لحمل بن مالك الهذلي اللحياني بميراثه من امرأته التي قتلتها امرأته الأخرى ‏.‏",
      "text_en": " It was narrated from 'Ubadah bin Samit:                     That the Prophet (ﷺ) ruled that Hamal bin Malik Hudhali Al-Lihyani should inherit from his wife who was killed by his other wife.",
      "chain": [
        "20271",
        "11106",
        "40"
      ]
    },
    {
      "hadith_no": "2777",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا عبد ربه بن خالد النميري، حدثنا فضيل بن سليمان، حدثني موسى بن عقبة، حدثني إسحاق بن يحيى بن الوليد، عن عبادة بن الصامت، قال قضى رسول الله صلى الله عليه وسلم أن المعدن جبار والبئر جبار والعجماء جرحها جبار ‏.‏ والعجماء البهيمة من الأنعام وغيرها ‏.‏ والجبار هو الهدر الذي لا يغرم ‏.‏",
      "text_en": " It was narrated that 'Ubadah bin Samit said:                     “The Messenger of Allah (ﷺ) ruled that there is no liability for injuries caused by falling into a mines or a well, nor those caused by a beast.”",
      "chain": [
        "20271",
        "11106",
        "40"
      ]
    },
    {
      "hadith_no": "2958",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا علي بن محمد، حدثنا أبو أسامة، عن أبي سنان، عيسى بن سنان عن يعلى بن شداد، عن عبادة بن الصامت، قال صلى بنا رسول الله صلى الله عليه وسلم يوم حنين إلى جنب بعير من المقاسم ثم تناول شيئا من البعير فأخذ منه قردة - يعني وبرة - فجعل بين إصبعيه ثم قال ‏\"‏ يا أيها الناس إن هذا من غنائمكم أدوا الخيط والمخيط فما فوق ذلك فما دون ذلك فإن الغلول عار على أهله يوم القيامة وشنار ونار ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Ubadah bin Samit said:                      “The Messenger of Allah(ﷺ) led us in prayer on the Day of Hunain, beside a camel that waspart of the spoils of war. Then he took something from the camel, andextracted from it a hair, which he placed between two of his fingers.Then he said: ‘O people, this is part of your spoils of war. Handovera needle and thread and anything greater than that or less thanthat.For stealing from the spoils of war will be a source of shameforthose who do it, and ignominy and Fire, on the Day ofResurrection.’”",
      "chain": [
        "38409",
        "20318",
        "40"
      ]
    },
    {
      "hadith_no": "2960",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، عن سفيان، عن عبد الرحمن بن الحارث الزرقي، عن سليمان بن موسى، عن مكحول، عن أبي سلام الأعرج، عن أبي أمامة، عن عبادة بن الصامت، أن النبي صلى الله عليه وسلم نفل في البدأة الربع وفي الرجعة الثلث ‏.‏",
      "text_en": " It wasnarrated from ‘Ubadah bin Samit that the Prophet (ﷺ) awardedonequarter of the spoils to those who attacked the enemy at thebeginning and one third to those who attacked at the end.",
      "chain": [
        "38409",
        "20032",
        "20012",
        "10880",
        "11066",
        "405",
        "40"
      ]
    },
    {
      "hadith_no": "2976",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا علي بن محمد، حدثنا عبد الله بن إدريس، عن محمد بن إسحاق، ويحيى بن سعيد، وعبيد الله بن عمر، وابن، عجلان عن عبادة بن الوليد بن عبادة بن الصامت، عن أبيه، عن عبادة بن الصامت، قال بايعنا رسول الله صلى الله عليه وسلم على السمع والطاعة في العسر واليسر والمنشط والمكره والأثرة علينا وأن لا ننازع الأمر أهله وأن نقول الحق حيثما كنا لا نخاف في الله لومة لائم ‏.‏",
      "text_en": " It wasnarrated that ‘Ubadah bin Samit said:                      “We gave our pledge totheMessenger of Allah (ﷺ), pledging to listen and obey in times ofhardship and times of ease, willingly or reluctantly, and when othersare shown preference over us, and that we would not dispute the orderof those in charge, that we would speak the truth wherever we are,andthat we would not fear the blame of anyone when acting orspeaking forthe sake of Allah.”",
      "chain": [
        "38409",
        "20102",
        "11107",
        "11062",
        "11201",
        "10616",
        "12201",
        "631",
        "40"
      ]
    },
    {
      "hadith_no": "3510",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Drinks - كتاب الأشربة",
      "chapter_no": "30",
      "text_ar": "حدثنا الحسين بن أبي السري، حدثنا عبيد الله، حدثنا سعد بن أوس العبسي، عن بلال بن يحيى العبسي، عن أبي بكر بن حفص، عن ابن محيريز، عن ثابت بن السمط، عن عبادة بن الصامت، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ يشرب ناس من أمتي الخمر باسم يسمونها إياه ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Ubadah bin Samit that the Messenger of Allah(ﷺ)said:                      “People among my nation will drink wine, under some othername that they will give it.”",
      "chain": [
        "11201",
        "20722",
        "19863",
        "11180",
        "40"
      ]
    },
    {
      "hadith_no": "3657",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا عمرو بن عثمان بن سعيد بن كثير بن دينار الحمصي، حدثنا أبي، عن ابن ثوبان، عن عمير، أنه سمع جنادة بن أبي أمية، قال سمعت عبادة بن الصامت، يقول أتى جبرائيل عليه السلام النبي  صلى الله عليه وسلم  وهو يوعك فقال بسم الله أرقيك من كل شىء يؤذيك من حسد حاسد ومن كل عين الله يشفيك ‏.‏",
      "text_en": " It wasnarrated from ‘Aishah that the Prophet (ﷺ) used to blow whenperforming Ruqyah.",
      "chain": [
        "10581",
        "4",
        "3205",
        "40"
      ]
    },
    {
      "hadith_no": "3681",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أحمد بن ثابت الجحدري، حدثنا سفيان بن عيينة، عن الأحوص بن حكيم، عن خالد بن معدان، عن عبادة بن الصامت، أن رسول الله  صلى الله عليه وسلم  صلى في شملة قد عقد عليها ‏.‏",
      "text_en": " It wasnarrated from ‘Ubadah bin Samit that the Messenger of Allah(ﷺ)prayed in a Shamlah tied with a knot.",
      "chain": [
        "34002",
        "20005",
        "18014",
        "11422",
        "40"
      ]
    },
    {
      "hadith_no": "3692",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا محمد بن عثمان بن كرامة، حدثنا أبو أسامة، حدثنا الأحوص بن حكيم، عن خالد بن معدان، عن عبادة بن الصامت، قال خرج علينا رسول الله  صلى الله عليه وسلم  ذات يوم وعليه جبة رومية من صوف ضيقة الكمين فصلى بنا فيها ليس عليه شىء غيرها ‏.‏",
      "text_en": " It wasnarrated that ‘Ubadah bin Samit said:                      “The Messenger of Allah(ﷺ) came out to us one day, wearing a Roman cloak of wool withnarrow sleeves. He led us in prayer wearing that, and nothing else.”",
      "chain": [
        "30214",
        "20318",
        "18014",
        "11422",
        "40"
      ]
    },
    {
      "hadith_no": "3878",
      "source": " Sunan Ibn Majah ",
      "chapter": "Supplication - كتاب الدعاء",
      "chapter_no": "34",
      "text_ar": "حدثنا عبد الرحمن بن إبراهيم الدمشقي، حدثنا الوليد بن مسلم، حدثنا الأوزاعي، حدثني عمير بن هانئ، حدثني جنادة بن أبي أمية، عن عبادة بن الصامت، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من تعار من الليل فقال حين يستيقظ لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شىء قدير سبحان الله والحمد لله ولا إله إلا الله والله أكبر ولا حول ولا قوة إلا بالله العلي العظيم ثم دعا رب اغفر لي - غفر له ‏\"‏ ‏.‏ قال الوليد أو قال ‏\"‏ دعا استجيب له فإن قام فتوضأ ثم صلى قبلت صلاته ‏\"‏ ‏.‏",
      "text_en": " It was narrated that ‘Ubadah bin As-Samit said:                      “The Messenger of Allah (ﷺ) said: ‘Whoever wakes up in the morning and says upon waking: La ilaha illallah wahdahu la sharika lahu, lahul-mulku wa lahul-hamdu, wa Huwa ‘ala kulli shay’in Qadir; Subhan-Allah walhamdu lillahi, wa la ilaha illallahu, wa Allahu Akbar, wa la hawla wa la quwwata illa billahil-‘Aliyil-‘Azim (None has the right to be worshipped but Allah alone, with no partner or associate. His is the dominion and all praise is to Him, and He is Able to do all things. Glory is to Allah, praise is to Allah, none has the right to be worshiped but Allah, Allah is the Most Great, and there is no power and no strength except with Allah, the Most High, the Most Supreme), then he supplicates Rabbighfirli (O Lord, forgive me), he will be forgiven.’”Walid said: “Or he said: then if he supplicated, it will be answered for him then if he stood up and performed ablution and then performed prayer, his prayer would be accepted.”",
      "chain": [
        "30285",
        "20733",
        "20024",
        "11415",
        "3205",
        "40"
      ]
    },
    {
      "hadith_no": "3898",
      "source": " Sunan Ibn Majah ",
      "chapter": "Interpretation of Dreams - كتاب تعبير الرؤيا",
      "chapter_no": "35",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، عن علي بن المبارك، عن يحيى بن أبي كثير، عن أبي سلمة، عن عبادة بن الصامت، قال سألت رسول الله  صلى الله عليه وسلم  عن قول الله سبحانه ‏{لهم البشرى في الحياة الدنيا وفي الآخرة}‏ ‏.‏ قال ‏\"‏ هي الرؤيا الصالحة يراها المسلم أو ترى له ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Ubadah bin Samit said:                      “I asked the MessengerofAllah (ﷺ) the about the Saying of Allah, Glorious is He: ‘Forthem are glad tidings, in the life of the present world, and in theHereafter.”[10:64] He said: ‘Those are good dreams that a Muslimseesor are seen about him.’”",
      "chain": [
        "38409",
        "20032",
        "20449",
        "11449",
        "10567",
        "40"
      ]
    }
  ],
  "total_hadiths": 103
}