{
  "id": "400",
  "name": "al-Bara' bin Azib bin al-Harith ( البراء بن عازب بن الحارث ( رضي الله عنه",
  "full_name": "al-Bara' bin Azib bin al-Harith ( البراء بن عازب بن الحارث ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medina"
    },
    "death": {
      "date_hijri": "72",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Medina",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina",
      "Kufa"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ ع  -  صحابي ]",
      "Fiqh"
    ],
    "tags": [
      "Ansar",
      "Aws",
      "B.Haritha"
    ]
  },
  "parents": [
    {
      "id": "1925",
      "name": "Azib bin al-Harith ( عازب بن الحارث بن عدي ( رضي الله عنه",
      "grade": "Comp.(RA)"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "401",
      "name": "'Ubaid bin Azib bin al-Harith ( عبيد بن عازب بن الحارث ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "1979",
      "name": "Umm 'Abdullah bint 'Azib ( أم عبد الله بنت عازب الأنصارية ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "children": [
    {
      "id": "15635",
      "name": "Yazid bin al-Bra'a bin Aazb يزيد بن البراء بن عازب الأنصاري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10795",
      "name": "'Ubaid bin al-Bra'a bin Aazb عبيد بن البراء بن عازب الأنصاري الحارثي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "13305",
      "name": "Yahya bin al-Bra'a bin Aazb يحيى بن البراء بن عازب",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "15138",
      "name": "al-Rabi' bin al-Bara' bin Azib الربيع بن البراء بن عازب",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "15700",
      "name": "Ibrahim bin al-Bara' bin 'Aazib إبراهيم بن البراء بن عازب الأنصاري",
      "grade": "Follower(Tabi')"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "2",
      "name": "Abu Bakr Al-Siddique ( أبو بكر الصديق ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3",
      "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5",
      "name": "Ali ibn Abi Talib ( علي بن أبي طالب بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "33",
      "name": "Abu Ayyub al-Ansari ( أبو أيوب الأنصاري خالد بن زيد ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "24",
      "name": "Bilal ibn Ribah ( بلال بن رباح الحبشي المؤذن ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "1820",
      "name": "Abu Burda bin Niyar ( أبو بردة بن نيار ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "1945",
      "name": "'Abdullah bin Yazid bin Zayd ( عبد الله بن يزيد بن زيد الخطمي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4047",
      "name": "Abu Juhayfa al-Sawai' ( أبو جحيفة السوائي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "15635",
      "name": "Yazid bin al-Bra'a bin Aazb يزيد بن البراء بن عازب الأنصاري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10795",
      "name": "'Ubaid bin al-Bra'a bin Aazb عبيد بن البراء بن عازب الأنصاري الحارثي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "15138",
      "name": "al-Rabi' bin al-Bara' bin Azib الربيع بن البراء بن عازب",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11196",
      "name": "'Abdur Rahman bin Abi Layla عبد الرحمن بن أبي ليلى",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11372",
      "name": "Ady bin Thabit al-Ansari عدي بن ثابت الأنصاري الكوفي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11049",
      "name": "Abu Ishaq al-Sabay'ai' أبو إسحاق السبيعي عمرو بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "3117",
      "name": "Mu'awiya bint Suwayd al-Mazni ( معاوية بن سويد بن مقرن المزني ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "1820",
      "name": "Abu Burda bin Niyar ( أبو بردة بن نيار ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11900",
      "name": "Abu Bakr bin Abi Musa al-Asha'ari أبو بكر بن أبى موسى الأشعري",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "40",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا عمرو بن خالد، قال حدثنا زهير، قال حدثنا أبو إسحاق، عن البراء، أن النبي صلى الله عليه وسلم كان أول ما قدم المدينة نزل على أجداده  أو قال أخواله  من الأنصار، وأنه صلى قبل بيت المقدس ستة عشر شهرا، أو سبعة عشر شهرا، وكان يعجبه أن تكون قبلته قبل البيت، وأنه صلى أول صلاة صلاها صلاة العصر، وصلى معه قوم، فخرج رجل ممن صلى معه، فمر على أهل مسجد، وهم راكعون فقال أشهد بالله لقد صليت مع رسول الله صلى الله عليه وسلم قبل مكة، فداروا كما هم قبل البيت، وكانت اليهود قد أعجبهم إذ كان يصلي قبل بيت المقدس، وأهل الكتاب، فلما ولى وجهه قبل البيت أنكروا ذلك‏.‏ قال زهير حدثنا أبو إسحاق عن البراء في حديثه هذا أنه مات على القبلة قبل أن تحول رجال وقتلوا، فلم ندر ما نقول فيهم، فأنزل الله تعالى ‏{‏وما كان الله ليضيع إيمانكم‏}‏",
      "text_en": "      Narrated Al-Bara' (bin 'Azib):                          When the Prophet came to Medina, he stayed first with his grandfathers     or maternal uncles from Ansar. He offered his prayers facing      Baitul-Maqdis (Jerusalem) for sixteen or seventeen months, but he      wished that he could pray facing the Ka'ba (at Mecca). The first      prayer which he offered facing the Ka'ba was the 'Asr prayer in the      company of some people. Then one of those who had offered that prayer      with him came out and passed by some people in a mosque who were      bowing during their prayers (facing Jerusalem). He said addressing      them, \"By Allah, I testify that I have prayed with Allah's Apostle      facing Mecca (Ka'ba).' Hearing that, those people changed their      direction towards the Ka'ba immediately. Jews and the people of the      scriptures used to be pleased to see the Prophet facing Jerusalem in      prayers but when he changed his direction towards the Ka'ba, during      the prayers, they disapproved of it.     Al-Bara' added, \"Before we changed our direction towards the Ka'ba      (Mecca) in prayers, some Muslims had died or had been killed and we      did not know what to say about them (regarding their prayers.) Allah      then revealed: And Allah would never make your faith (prayers) to be      lost (i.e. the prayers of those Muslims were valid).' \" (2:143).",
      "chain": [
        "30237",
        "20321",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "247",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا محمد بن مقاتل، قال أخبرنا عبد الله، قال أخبرنا سفيان، عن منصور، عن سعد بن عبيدة، عن البراء بن عازب، قال قال النبي صلى الله عليه وسلم ‏\"‏ إذا أتيت مضجعك فتوضأ وضوءك للصلاة، ثم اضطجع على شقك الأيمن، ثم قل اللهم أسلمت وجهي إليك، وفوضت أمري إليك، وألجأت ظهري إليك، رغبة ورهبة إليك، لا ملجأ ولا منجا منك إلا إليك، اللهم آمنت بكتابك الذي أنزلت، وبنبيك الذي أرسلت‏.‏ فإن مت من ليلتك فأنت على الفطرة، واجعلهن آخر ما تتكلم به ‏\"‏‏.‏ قال فرددتها على النبي صلى الله عليه وسلم فلما بلغت ‏\"‏ اللهم آمنت بكتابك الذي أنزلت ‏\"‏‏.‏ قلت ورسولك‏.‏ قال ‏\"‏ لا، ونبيك الذي أرسلت ‏\"‏‏.‏",
      "text_en": " Narrated Al-Bara 'bin `Azib:                     The Prophet said to me, \"Whenever you go to bed perform ablution like that for the prayer, lie or your right side and say, \"Allahumma aslamtu wajhi ilaika, wa fauwadtu `Amri ilaika, wa alja'tu Zahri ilaika raghbatan wa rahbatan ilaika. La Malja'a wa la manja minka illa ilaika. Allahumma amantu bikitabika-l-ladhi anzalta wa bina-biyika-l ladhi arsalta\" (O Allah! I surrender to You and entrust all my affairs to You and depend upon You for Your Blessings both with hope and fear of You. There is no fleeing from You, and there is no place of protection and safety except with You O Allah! I believe in Your Book (the Qur'an) which You have revealed and in Your Prophet (Muhammad) whom You have sent). Then if you die on that very night, you will die with faith (i.e. or the religion of Islam). Let the aforesaid words be your last utterance (before sleep).\" I repeated it before the Prophet and when I reached \"Allahumma amantu bikitabika-l-ladhi anzalta (O Allah I believe in Your Book which You have revealed).\" I said, \"Wa-rasulika (and your Apostle).\" The Prophet said, \"No, (but say): 'Wanabiyika-l-ladhi arsalta (Your Prophet whom You have sent), instead.\"",
      "chain": [
        "30118",
        "20025",
        "20012",
        "11067",
        "11344",
        "400"
      ]
    },
    {
      "hadith_no": "399",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الله بن رجاء، قال حدثنا إسرائيل، عن أبي إسحاق، عن البراء بن عازب  رضى الله عنهما  قال كان رسول الله صلى الله عليه وسلم صلى نحو بيت المقدس ستة عشر أو سبعة عشر شهرا، وكان رسول الله صلى الله عليه وسلم يحب أن يوجه إلى الكعبة، فأنزل الله ‏{‏قد نرى تقلب وجهك في السماء‏}‏ فتوجه نحو الكعبة، وقال السفهاء من الناس  وهم اليهود  ما ولاهم عن قبلتهم التي كانوا عليها ‏{‏قل لله المشرق والمغرب يهدي من يشاء إلى صراط مستقيم‏}‏ فصلى مع النبي صلى الله عليه وسلم رجل ثم خرج بعد ما صلى، فمر على قوم من الأنصار في صلاة العصر نحو بيت المقدس فقال هو يشهد أنه صلى مع رسول الله صلى الله عليه وسلم، وأنه توجه نحو الكعبة‏.‏ فتحرف القوم حتى توجهوا نحو الكعبة‏.‏",
      "text_en": " Narrated Bara' bin `Azib:                     Allah's Apostle prayed facing Baitul-Maqdis for sixteen or seventeen months but he loved to face the Ka`ba (at Mecca) so Allah revealed: \"Verily, We have seen the turning of your face to the heaven!\" (2:144) So the Prophet faced the Ka`ba and the fools amongst the people namely \"the Jews\" said, \"What has turned them from their Qibla (Baitul-Maqdis) which they formerly observed\"\" (Allah revealed): \"Say: 'To Allah belongs the East and the West. He guides whom he will to a straight path'.\" (2:142) A man prayed with the Prophet (facing the Ka`ba) and went out. He saw some of the Ansar praying the `Asr prayer with their faces towards Baitul-Maqdis, he said, \"I bear witness that I prayed with Allah's Apostle facing the Ka`ba.\" So all the people turned their faces towards the Ka`ba.",
      "chain": [
        "20245",
        "20311",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "747",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا حجاج، حدثنا شعبة، قال أنبأنا أبو إسحاق، قال سمعت عبد الله بن يزيد، يخطب قال حدثنا البراء، وكان، غير كذوب أنهم كانوا إذا صلوا مع النبي صلى الله عليه وسلم فرفع رأسه من الركوع قاموا قياما حتى يرونه قد سجد‏.‏",
      "text_en": " Narrated Al-Bara:                     (And Al-Bara was not a liar) Whenever we offered prayer with the Prophet and he raised his head from the bowing, we used to remain standing till we saw him prostrating .",
      "chain": [
        "20219",
        "20020",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "767",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو الوليد، قال حدثنا شعبة، عن عدي، قال سمعت البراء، أن النبي صلى الله عليه وسلم كان في سفر فقرأ في العشاء في إحدى الركعتين بالتين والزيتون‏.‏",
      "text_en": " Narrated Al-Bara:                     The Prophet was on a journey and recited in one of the first two rak`at of the `Isha' prayer \"Wa t-teeni wa z-zaitun.\" (95)",
      "chain": [
        "20296",
        "20020",
        "11372",
        "400"
      ]
    },
    {
      "hadith_no": "769",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا خلاد بن يحيى، قال حدثنا مسعر، قال حدثنا عدي بن ثابت، سمع البراء، رضى الله عنه قال سمعت النبي صلى الله عليه وسلم يقرأ ‏{‏والتين والزيتون‏}‏ في العشاء، وما سمعت أحدا أحسن صوتا منه أو قراءة‏.‏",
      "text_en": " Narrated Al-Bara:                     I heard the Prophet reciting wa t-teeni wa z-zaitun\" (95) in the `Isha' prayer, and I never heard a sweeter voice or a better way of recitation than that of the Prophet.",
      "chain": [
        "20191",
        "20359",
        "11372",
        "400"
      ]
    },
    {
      "hadith_no": "792",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا بدل بن المحبر، قال حدثنا شعبة، قال أخبرني الحكم، عن ابن أبي ليلى، عن البراء، قال كان ركوع النبي صلى الله عليه وسلم وسجوده وبين السجدتين وإذا رفع من الركوع، ما خلا القيام والقعود، قريبا من السواء‏.‏",
      "text_en": " Narrated Al-Bara:                     The bowing, the prostration the sitting in between the two prostrations and the standing after the bowing of the Prophet but not qiyam (standing in the prayer) and qu`ud (sitting in the prayer) used to be approximately equal (in duration).",
      "chain": [
        "20210",
        "20020",
        "11069",
        "11196",
        "400"
      ]
    },
    {
      "hadith_no": "801",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو الوليد، قال حدثنا شعبة، عن الحكم، عن ابن أبي ليلى، عن البراء  رضى الله عنه  قال كان ركوع النبي صلى الله عليه وسلم وسجوده وإذا رفع رأسه من الركوع وبين السجدتين قريبا من السواء‏.‏",
      "text_en": " Narrated Al-Bara':                     The bowing, the prostrations, the period of standing after bowing and the interval between the two prostrations of the Prophet used to be equal in duration .",
      "chain": [
        "20296",
        "20020",
        "11069",
        "11196",
        "400"
      ]
    },
    {
      "hadith_no": "811",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا آدم، حدثنا إسرائيل، عن أبي إسحاق، عن عبد الله بن يزيد الخطمي، حدثنا البراء بن عازب  وهو غير كذوب  قال كنا نصلي خلف النبي صلى الله عليه وسلم فإذا قال سمع الله لمن حمده‏.‏ لم يحن أحد منا ظهره حتى يضع النبي صلى الله عليه وسلم جبهته على الأرض‏.‏",
      "text_en": " Narrated Al-Bara' bin `Azib:                     (He was not a liar) We used to pray behind the Prophet and when he said, \"Sami`a l-lahu liman hamidah\", none of us would bend his back (to go for prostration) till the Prophet had placed his, forehead on the ground.",
      "chain": [
        "20404",
        "20311",
        "11049",
        "1945",
        "400"
      ]
    },
    {
      "hadith_no": "820",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن عبد الرحيم، قال حدثنا أبو أحمد، محمد بن عبد الله الزبيري قال حدثنا مسعر، عن الحكم، عن عبد الرحمن بن أبي ليلى، عن البراء، قال كان سجود النبي صلى الله عليه وسلم وركوعه، وقعوده بين السجدتين قريبا من السواء‏.‏",
      "text_en": " Narrated Al-Bara':                     The time taken by the Prophet in prostrations, bowing, and the sitting interval between the two prostrations was about the same.",
      "chain": [
        "30272",
        "20355",
        "20359",
        "11069",
        "11196",
        "400"
      ]
    },
    {
      "hadith_no": "951",
      "source": " Sahih Bukhari ",
      "chapter": "The Two Festivals (Eids) - كتاب العيدين",
      "chapter_no": "13",
      "text_ar": "حدثنا حجاج، قال حدثنا شعبة، قال أخبرني زبيد، قال سمعت الشعبي، عن البراء، قال سمعت النبي صلى الله عليه وسلم يخطب فقال ‏\"‏ إن أول ما نبدأ من يومنا هذا أن نصلي، ثم نرجع فننحر، فمن فعل فقد أصاب سنتنا ‏\"‏‏.‏",
      "text_en": " Narrated Al-Bara':                     I heard the Prophet (p.b.u.h) delivering a Khutba saying, \"The first thing to be done on this day (first day of `Id ul Adha) is to pray; and after returning from the prayer we slaughter our sacrifices (in the name of Allah) and whoever does so, he acted according to our Sunna (traditions).\"",
      "chain": [
        "20219",
        "20020",
        "11335",
        "11052",
        "400"
      ]
    },
    {
      "hadith_no": "955",
      "source": " Sahih Bukhari ",
      "chapter": "The Two Festivals (Eids) - كتاب العيدين",
      "chapter_no": "13",
      "text_ar": "حدثنا عثمان، قال حدثنا جرير، عن منصور، عن الشعبي، عن البراء بن عازب  رضى الله عنهما  قال خطبنا النبي صلى الله عليه وسلم يوم الأضحى بعد الصلاة فقال ‏\"‏ من صلى صلاتنا ونسك نسكنا فقد أصاب النسك، ومن نسك قبل الصلاة فإنه قبل الصلاة، ولا نسك له ‏\"‏‏.‏ فقال أبو بردة بن نيار خال البراء يا رسول الله، فإني نسكت شاتي قبل الصلاة، وعرفت أن اليوم يوم أكل وشرب، وأحببت أن تكون شاتي أول ما يذبح في بيتي، فذبحت شاتي وتغديت قبل أن آتي الصلاة‏.‏ قال ‏\"‏ شاتك شاة لحم ‏\"‏‏.‏ قال يا رسول الله، فإن عندنا عناقا لنا جذعة هي أحب إلى من شاتين، أفتجزي عني قال ‏\"‏ نعم، ولن تجزي عن أحد بعدك ‏\"‏‏.‏",
      "text_en": " Narrated Al-Bara' bin `Azib:                     The Prophet delivered the Khutba after offering the prayer on the Day of Nahr and said, \"Whoever offers the prayer like us and slaughters like us then his Nusuk (sacrifice) will be accepted by Allah. And whoever slaughters his sacrifice before the `Id prayer then he has not done the sacrifice.\" Abi Burda bin Niyar, the uncle of Al-Bara' said, \"O Allah's Apostle! I have slaughtered my sheep before the `Id prayer and I thought today as a day of eating and drinking (not alcoholic drinks), and I liked that my sheep should be the first to be slaughtered in my house. So slaughtered my sheep and took my food before coming for the prayer.\" The Prophet said, \"The sheep which you have slaughtered is just mutton (not a Nusuk).\" He (Abu Burda) said, \"O Allah's Apostle! I have a young she-goat which is dearer to me than two sheep. Will that be sufficient as a Nusuk on my behalf? \"The Prophet (p.b.u.h) said, \"Yes, it will be sufficient for you but it will not be sufficient (as a Nusuk) for anyone else after you.\"",
      "chain": [
        "4",
        "20028",
        "11067",
        "11052",
        "400"
      ]
    },
    {
      "hadith_no": "965",
      "source": " Sahih Bukhari ",
      "chapter": "The Two Festivals (Eids) - كتاب العيدين",
      "chapter_no": "13",
      "text_ar": "حدثنا آدم، قال حدثنا شعبة، قال حدثنا زبيد، قال سمعت الشعبي، عن البراء بن عازب، قال قال النبي صلى الله عليه وسلم ‏\"‏ إن أول ما نبدأ في يومنا هذا أن نصلي، ثم نرجع فننحر، فمن فعل ذلك فقد أصاب سنتنا، ومن نحر قبل الصلاة فإنما هو لحم قدمه لأهله، ليس من النسك في شىء ‏\"‏‏.‏ فقال رجل من الأنصار يقال له أبو بردة بن نيار يا رسول الله، ذبحت وعندي جذعة خير من مسنة‏.‏ فقال ‏\"‏ اجعله مكانه، ولن توفي أو تجزي عن أحد بعدك ‏\"‏‏.‏",
      "text_en": " Narrated Al-Bara' bin `Azib:                     The Prophet (p.b.u.h) said, \"The first thing that we should do on this day of ours is to pray and then return to slaughter the sacrifice. So anyone who does so, he acted according to our Sunna (tradition), and whoever slaughtered the sacrifice before the prayer, it was just meat which he presented to his family and would not be considered as Nusuk.\" A person from the Ansar named Abu Burda bin Niyyar said, \"O Allah's Apostle! I slaughtered the Nusuk (before the prayer) but I have a young shegoat which is better than an older sheep.\" The Prophet I said, \"Sacrifice it in lieu of the first, but it will be not sufficient (as a sacrifice) for anybody else after you.\"",
      "chain": [
        "20404",
        "20020",
        "11335",
        "11052",
        "400"
      ]
    },
    {
      "hadith_no": "968",
      "source": " Sahih Bukhari ",
      "chapter": "The Two Festivals (Eids) - كتاب العيدين",
      "chapter_no": "13",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا شعبة، عن زبيد، عن الشعبي، عن البراء، قال خطبنا النبي صلى الله عليه وسلم يوم النحر قال ‏\"‏ إن أول ما نبدأ به في يومنا هذا أن نصلي ثم نرجع فننحر، فمن فعل ذلك فقد أصاب سنتنا، ومن ذبح قبل أن يصلي فإنما هو لحم عجله لأهله، ليس من النسك في شىء ‏\"‏‏.‏ فقام خالي أبو بردة بن نيار فقال يا رسول الله، أنا ذبحت قبل أن أصلي وعندي جذعة خير من مسنة‏.‏ قال ‏\"‏ اجعلها مكانها  أو قال اذبحها  ولن تجزي جذعة عن أحد بعدك ‏\"‏‏.‏",
      "text_en": " Narrated Al-Bara':                     The Prophet delivered the Khutba on the day of Nahr (`Id-ul-Adha) and said, \"The first thing we should do on this day of ours is to pray and then return and slaughter (our sacrifices). So anyone who does so he acted according to our Sunna; and whoever slaughtered before the prayer then it was just meat that he offered to his family and would not be considered as a sacrifice in any way. My uncle Abu Burda bin Niyyar got up and said, \"O, Allah's Apostle! I slaughtered the sacrifice before the prayer but I have a young she-goat which is better than an older sheep.\" The Prophet said, \"Slaughter it in lieu of the first and such a goat will not be considered as a sacrifice for anybody else after you.\"",
      "chain": [
        "20193",
        "20020",
        "11335",
        "11052",
        "400"
      ]
    },
    {
      "hadith_no": "976",
      "source": " Sahih Bukhari ",
      "chapter": "The Two Festivals (Eids) - كتاب العيدين",
      "chapter_no": "13",
      "text_ar": "حدثنا أبو نعيم، قال حدثنا محمد بن طلحة، عن زبيد، عن الشعبي، عن البراء، قال خرج النبي صلى الله عليه وسلم يوم أضحى إلى البقيع فصلى ركعتين، ثم أقبل علينا بوجهه وقال ‏\"‏ إن أول نسكنا في يومنا هذا أن نبدأ بالصلاة، ثم نرجع فننحر، فمن فعل ذلك فقد وافق سنتنا، ومن ذبح قبل ذلك فإنما هو شىء عجله لأهله، ليس من النسك في شىء ‏\"‏‏.‏ فقام رجل فقال يا رسول الله، إني ذبحت وعندي جذعة خير من مسنة‏.‏ قال ‏\"‏ اذبحها، ولا تفي عن أحد بعدك ‏\"‏‏.‏",
      "text_en": " Narrated Al-Bara':                     The Prophet went towards Al-Baqi (the graveyard at Medina) on the day of Id-ul-Adha and offered a two-rak`at prayer (of `Id-ul-Adha) and then faced us and said, \"On this day of ours, our first act of worship is the offering of prayer and then we will return and slaughter the sacrifice, and whoever does this concords with our Sunna; and whoever slaughtered his sacrifice before that (i.e. before the prayer) then that was a thing which he prepared earlier for his family and it would not be considered as a Nusuk (sacrifice.)\" A man stood up and said, \"O, Allah's Apostle! I slaughtered (the animal before the prayer) but I have a young she-goat which is better than an older sheep.\" The Prophet (p.b.u.h) said to him, \"Slaughter it. But a similar sacrifice will not be sufficient for anybody else after you.\"",
      "chain": [
        "20348",
        "20604",
        "11335",
        "11052",
        "400"
      ]
    },
    {
      "hadith_no": "983",
      "source": " Sahih Bukhari ",
      "chapter": "The Two Festivals (Eids) - كتاب العيدين",
      "chapter_no": "13",
      "text_ar": "حدثنا مسدد، قال حدثنا أبو الأحوص، قال حدثنا منصور بن المعتمر، عن الشعبي، عن البراء بن عازب، قال خطبنا رسول الله صلى الله عليه وسلم يوم النحر بعد الصلاة فقال ‏\"‏ من صلى صلاتنا ونسك نسكنا فقد أصاب النسك، ومن نسك قبل الصلاة فتلك شاة لحم ‏\"‏‏.‏ فقام أبو بردة بن نيار فقال يا رسول الله والله لقد نسكت قبل أن أخرج إلى الصلاة، وعرفت أن اليوم يوم أكل وشرب فتعجلت وأكلت وأطعمت أهلي وجيراني‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ تلك شاة لحم ‏\"‏‏.‏ قال فإن عندي عناق جذعة، هي خير من شاتى لحم، فهل تجزي عني قال ‏\"‏ نعم، ولن تجزي عن أحد بعدك ‏\"‏‏.‏",
      "text_en": " Narrated Al-Bara' bin `Azib:                     On the day of Nahr Allah's Apostle delivered the Khutba after the `Id prayer and said, \"Anyone who prayed like us and slaughtered the sacrifice like we did then he acted according to our (Nusuk) tradition of sacrificing, and whoever slaughtered the sacrifice before the prayer, then that was just mutton (i.e. not sacrifice).\" Abu Burda bin Naiyar stood up and said, \"O Allah's Apostle! By Allah, I slaughtered my sacrifice before I offered the (Id) prayer and thought that today was the day of eating and drinking (nonalcoholic drinks) and so I made haste (in slaughtering) and ate and also fed my family and neighbors.\" Allah's Apostle said, \"That was just mutton (not a sacrifice).\" Then Abu Burda said, \"I have a young she-goat and no doubt, it is better than two sheep. Will that be sufficient as a sacrifice for me?\" The Prophet replied, \"Yes. But it will not be sufficient for anyone else (as a sacrifice), after you.\"",
      "chain": [
        "30175",
        "20327",
        "11067",
        "11052",
        "400"
      ]
    },
    {
      "hadith_no": "1239",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا أبو الوليد، حدثنا شعبة، عن الأشعث، قال سمعت معاوية بن سويد بن مقرن، عن البراء  رضى الله عنه  قال أمرنا النبي صلى الله عليه وسلم بسبع، ونهانا عن سبع أمرنا باتباع الجنائز، وعيادة المريض، وإجابة الداعي، ونصر المظلوم، وإبرار القسم، ورد السلام، وتشميت العاطس‏.‏ ونهانا عن آنية الفضة، وخاتم الذهب، والحرير، والديباج، والقسي، والإستبرق‏.‏",
      "text_en": " Narrated Al-Bara' bin `Azib:                     Allah's Apostle ordered us to do seven things and forbade us to do other seven. He ordered us: to follow the funeral procession. to visit the sick, to accept invitations, to help the oppressed, to fulfill the oaths, to return the greeting and to reply to the sneezer: (saying, \"May Allah be merciful on you,\" provided the sneezer says, \"All the praises are for Allah,\"). He forbade us to use silver utensils and dishes and to wear golden rings, silk (clothes), Dibaj (pure silk cloth), Qissi and Istabraq (two kinds of silk cloths).",
      "chain": [
        "20296",
        "20020",
        "485",
        "3117",
        "400"
      ]
    },
    {
      "hadith_no": "1369",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن علقمة بن مرثد، عن سعد بن عبيدة، عن البراء بن عازب  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا أقعد المؤمن في قبره أتي، ثم شهد أن لا إله إلا الله، وأن محمدا رسول الله، فذلك قوله ‏{‏يثبت الله الذين آمنوا بالقول الثابت‏}‏ ‏\"‏‏.‏ حدثنا محمد بن بشار حدثنا غندر حدثنا شعبة بهذا وزاد ‏{‏يثبت الله الذين آمنوا‏}‏ نزلت في عذاب القبر‏.‏",
      "text_en": "      Narrated Al-Bara' bin 'Azib :                          The Prophet (p.b.u.h) said, \"When a faithful believer is made to sit      in his grave, then (the angels) come to him and he testifies that none     has the right to be worshipped but Allah and Muhammad is Allah's      Apostle. And that corresponds to Allah's statement: Allah will keep      firm those who believe with the word that stands firm . . . (14.27).      Narrated Shu'ba:     Same as above and added, \"Allah will keep firm those who believe . . .     (14.27) was revealed concerning the punishment of the grave.\"",
      "chain": [
        "30329",
        "20020",
        "11374",
        "11344",
        "400"
      ]
    },
    {
      "hadith_no": "1375",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا يحيى، حدثنا شعبة، قال حدثني عون بن أبي جحيفة، عن أبيه، عن البراء بن عازب، عن أبي أيوب  رضى الله عنهم  قال خرج النبي صلى الله عليه وسلم وقد وجبت الشمس، فسمع صوتا فقال ‏\"‏ يهود تعذب في قبورها ‏\"‏‏.‏   وقال النضر أخبرنا شعبة، حدثنا عون، سمعت أبي، سمعت البراء، عن أبي أيوب  رضى الله عنهما  عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Abi Aiyub:                     Once the Prophet went out after sunset and heard a dreadful voice, and said, \"The Jews are being punished in their graves.\"",
      "chain": [
        "30170",
        "20031",
        "20020",
        "11383",
        "4047",
        "400",
        "33"
      ]
    },
    {
      "hadith_no": "1382",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا أبو الوليد، حدثنا شعبة، عن عدي بن ثابت، أنه سمع البراء  رضى الله عنه  قال لما توفي إبراهيم  عليه السلام  قال رسول الله صلى الله عليه وسلم ‏\"‏ إن له مرضعا في الجنة ‏\"‏‏.‏",
      "text_en": " Narrated Al-Bara':                     When Ibrahim (the son of Prophet) expired, Allah's Apostle said, \"There is a wet-nurse for him in Paradise.\"",
      "chain": [
        "20296",
        "20020",
        "11372",
        "400"
      ]
    },
    {
      "hadith_no": "1832",
      "source": " Sahih Bukhari ",
      "chapter": "`Umrah (Minor pilgrimage) - كتاب العمرة",
      "chapter_no": "26",
      "text_ar": "حدثنا أبو الوليد، حدثنا شعبة، عن أبي إسحاق، قال سمعت البراء  رضى الله عنه  يقول نزلت هذه الآية فينا، كانت الأنصار إذا حجوا فجاءوا لم يدخلوا من قبل أبواب بيوتهم، ولكن من ظهورها، فجاء رجل من الأنصار، فدخل من قبل بابه، فكأنه عير بذلك، فنزلت ‏{‏وليس البر بأن تأتوا البيوت من ظهورها ولكن البر من اتقى وأتوا البيوت من أبوابها‏}‏‏.‏",
      "text_en": " Narrated Abu 'Is-haq:                     I heard Al-Bara' saying, \"The above Verse was revealed regarding us, for the Ansar on returning from Hajj never entered their houses through the proper doors but from behind. One of the Ansar came and entered through the door and he was taunted for it. Therefore, the following was revealed: -- \"It is not righteousness That you enter the houses from the back, But the righteous man is He who fears Allah, Obeys His order and keeps away from What He has forbidden So, enter houses through the proper doors.\" (2.189)",
      "chain": [
        "20296",
        "20020",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "1875",
      "source": " Sahih Bukhari ",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا عبيد الله، عن إسرائيل، عن أبي إسحاق، عن البراء  رضى الله عنه  اعتمر النبي صلى الله عليه وسلم في ذي القعدة، فأبى أهل مكة أن يدعوه يدخل مكة، حتى قاضاهم لا يدخل مكة سلاحا إلا في القراب‏.‏",
      "text_en": " Narrated Al-Bara:                     The Prophet assumed Ihram for Umra in the month of Dhul-Qa'da but the (pagan) people of Mecca refused to admit him into Mecca till he agreed on the condition that he would not bring into Mecca any arms but sheathed.",
      "chain": [
        "11201",
        "20311",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "1915",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا عبيد الله بن موسى، عن إسرائيل، عن أبي إسحاق، عن البراء  رضى الله عنه  قال كان أصحاب محمد صلى الله عليه وسلم إذا كان الرجل صائما، فحضر الإفطار، فنام قبل أن يفطر لم يأكل ليلته ولا يومه، حتى يمسي، وإن قيس بن صرمة الأنصاري كان صائما، فلما حضر الإفطار أتى امرأته، فقال لها أعندك طعام قالت لا ولكن أنطلق، فأطلب لك‏.‏ وكان يومه يعمل، فغلبته عيناه، فجاءته امرأته، فلما رأته قالت خيبة لك‏.‏ فلما انتصف النهار غشي عليه، فذكر ذلك للنبي صلى الله عليه وسلم فنزلت هذه الآية ‏{‏أحل لكم ليلة الصيام الرفث إلى نسائكم‏}‏ ففرحوا بها فرحا شديدا، ونزلت ‏{‏وكلوا واشربوا حتى يتبين لكم الخيط الأبيض من الخيط الأسود‏}‏‏.‏",
      "text_en": " Narrated Al-Bara:                     It was the custom among the companions of Muhammad that if any of them was fasting and the food was presented (for breaking his fast), but he slept before eating, he would not eat that night and the following day till sunset. Qais bin Sirma-al-Ansari was fasting and came to his wife at the time of Iftar (breaking one's fast) and asked her whether she had anything to eat. She replied, \"No, but I would go and bring some for you.\" He used to do hard work during the day, so he was overwhelmed by sleep and slept. When his wife came and saw him, she said, \"Disappointment for you.\" When it was midday on the following day, he fainted and the Prophet was informed about the whole matter and the following verses were revealed: \"You are permitted To go to your wives (for sexual relation) At the night of fasting.\" So, they were overjoyed by it. And then Allah also revealed: \"And eat and drink Until the white thread Of dawn appears to you Distinct from the black thread (of the night).\" (2.187)",
      "chain": [
        "20340",
        "20311",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "2181",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، قال أخبرني حبيب بن أبي ثابت، قال سمعت أبا المنهال، قال سألت البراء بن عازب وزيد بن أرقم  رضى الله عنهم  عن الصرف،، فكل واحد منهما يقول هذا خير مني‏.‏ فكلاهما يقول نهى رسول الله صلى الله عليه وسلم عن بيع الذهب بالورق دينا‏.‏",
      "text_en": " Narrated Abu Al-Minhal:                     I asked Al-Bara' bin `Azib and Zaid bin Arqam about money exchanges. Each of them said, \"This is better than I,\" and both of them said, \"Allah's Apostle forbade the selling of silver for gold on credit. \"",
      "chain": [
        "30329",
        "20020",
        "11331",
        "11290",
        "400"
      ]
    },
    {
      "hadith_no": "2439",
      "source": " Sahih Bukhari ",
      "chapter": "Lost Things Picked up by Someone (Luqatah) - كتاب فى اللقطة",
      "chapter_no": "45",
      "text_ar": "حدثنا إسحاق بن إبراهيم، أخبرنا النضر، أخبرنا إسرائيل، عن أبي إسحاق، قال أخبرني البراء، عن أبي بكر  رضى الله عنهما ‏.‏ حدثنا عبد الله بن رجاء، حدثنا إسرائيل، عن أبي إسحاق، عن البراء، عن أبي بكر  رضى الله عنهما  قال انطلقت، فإذا أنا براعي غنم يسوق غنمه فقلت لمن أنت قال لرجل من قريش‏.‏ فسماه فعرفته‏.‏ فقلت هل في غنمك من لبن فقال نعم‏.‏ فقلت هل أنت حالب لي قال نعم‏.‏ فأمرته فاعتقل شاة من غنمه، ثم أمرته أن ينفض ضرعها من الغبار، ثم أمرته أن ينفض كفيه، فقال هكذا  ضرب إحدى كفيه بالأخرى  فحلب كثبة من لبن وقد جعلت لرسول الله صلى الله عليه وسلم إداوة على فمها خرقة، فصببت على اللبن، حتى برد أسفله، فانتهيت إلى النبي صلى الله عليه وسلم فقلت اشرب يا رسول الله‏.‏ فشرب حتى رضيت‏.‏",
      "text_en": " Narrated Abu Bakr:                     While I was on my way, all of a sudden I saw a shepherd driving his sheep, I asked him whose servant he was. He replied that he was the servant of a man from Quraish, and then he mentioned his name and I recognized him. I asked, \"Do your sheep have some milk?\" He replied in the affirmative. I said, \"Are you going to milk for me?\" He replied in the affirmative. I ordered him and he tied the legs of one of the sheep. Then I told him to clean the udder (teats) of dust and to remove dust off his hands. He removed the dust off his hands by clapping his hands. He then milked a little milk. I put the milk for Allah's Apostle in a pot and closed its mouth with a piece of cloth and poured water over it till it became cold. I took it to the Prophet and said, \"Drink, O Allah's Apostle!\" He drank it till I was pleased.",
      "chain": [
        "30123",
        "20291",
        "20311",
        "11049",
        "400",
        "2"
      ]
    },
    {
      "hadith_no": "2445",
      "source": " Sahih Bukhari ",
      "chapter": "Oppressions - كتاب المظالم",
      "chapter_no": "46",
      "text_ar": "حدثنا سعيد بن الربيع، حدثنا شعبة، عن الأشعث بن سليم، قال سمعت معاوية بن سويد، سمعت البراء بن عازب  رضى الله عنهما  قال أمرنا النبي صلى الله عليه وسلم بسبع، ونهانا عن سبع‏.‏ فذكر عيادة المريض، واتباع الجنائز، وتشميت العاطس، ورد السلام، ونصر المظلوم، وإجابة الداعي، وإبرار المقسم‏.‏",
      "text_en": " Narrated Muawiya bin Suwaid:                     I heard Al-Bara' bin `Azib saying, \"The Prophet orders us to do seven things and prohibited us from doing seven other things.\" Then Al-Bara' mentioned the following:-- (1) To pay a visit to the sick (inquiring about his health), (2) to follow funeral processions, (3) to say to a sneezer, \"May Allah be merciful to you\" (if he says, \"Praise be to Allah!\"), (4) to return greetings, (5) to help the oppressed, (6) to accept invitations, (7) to help others to fulfill their oaths. (See Hadith No. 753, Vol. 7)",
      "chain": [
        "20231",
        "20020",
        "11324",
        "400"
      ]
    },
    {
      "hadith_no": "2698",
      "source": " Sahih Bukhari ",
      "chapter": "Peacemaking - كتاب الصلح",
      "chapter_no": "53",
      "text_ar": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن أبي إسحاق، قال سمعت البراء بن عازب  رضى الله عنهما  قال لما صالح رسول الله صلى الله عليه وسلم أهل الحديبية كتب علي بينهم كتابا فكتب محمد رسول الله صلى الله عليه وسلم‏.‏ فقال المشركون لا تكتب محمد رسول الله، لو كنت رسولا لم نقاتلك‏.‏ فقال لعلي ‏\"‏ امحه ‏\"‏‏.‏ فقال علي ما أنا بالذي أمحاه‏.‏ فمحاه رسول الله صلى الله عليه وسلم بيده، وصالحهم على أن يدخل هو وأصحابه ثلاثة أيام، ولا يدخلوها إلا بجلبان السلاح، فسألوه ما جلبان السلاح فقال القراب بما فيه‏.‏",
      "text_en": " Narrated Al-Bara bin `Azib:                     When Allah's Apostle concluded a peace treaty with the people of Hudaibiya, `Ali bin Abu Talib wrote the document and he mentioned in it, \"Muhammad, Allah's Apostle .\" The pagans said, \"Don't write: 'Muhammad, Allah's Apostle', for if you were an apostle we would not fight with you.\" Allah's Apostle asked `Ali to rub it out, but `Ali said, \"I will not be the person to rub it out.\" Allah's Apostle rubbed it out and made peace with them on the condition that the Prophet and his companions would enter Mecca and stay there for three days, and that they would enter with their weapons in cases.",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "2699",
      "source": " Sahih Bukhari ",
      "chapter": "Peacemaking - كتاب الصلح",
      "chapter_no": "53",
      "text_ar": "حدثنا عبيد الله بن موسى، عن إسرائيل، عن أبي إسحاق، عن البراء  رضى الله عنه  قال اعتمر النبي صلى الله عليه وسلم في ذي القعدة، فأبى أهل مكة أن يدعوه يدخل مكة، حتى قاضاهم على أن يقيم بها ثلاثة أيام، فلما كتبوا الكتاب كتبوا هذا ما قاضى عليه محمد رسول الله صلى الله عليه وسلم‏.‏ فقالوا لا نقر بها، فلو نعلم أنك رسول الله ما منعناك، لكن أنت محمد بن عبد الله‏.‏ قال ‏\"‏ أنا رسول الله وأنا محمد بن عبد الله ‏\"‏‏.‏ ثم قال لعلي ‏\"‏ امح رسول الله ‏\"‏‏.‏ قال لا، والله لا أمحوك أبدا، فأخذ رسول الله صلى الله عليه وسلم الكتاب، فكتب هذا ما قاضى عليه محمد بن عبد الله، لا يدخل مكة سلاح إلا في القراب، وأن لا يخرج من أهلها بأحد، إن أراد أن يتبعه، وأن لا يمنع أحدا من أصحابه أراد أن يقيم بها‏.‏ فلما دخلها، ومضى الأجل أتوا عليا، فقالوا قل لصاحبك اخرج عنا فقد مضى الأجل‏.‏ فخرج النبي صلى الله عليه وسلم فتبعتهم ابنة حمزة يا عم يا عم‏.‏ فتناولها علي فأخذ بيدها، وقال لفاطمة عليها السلام دونك ابنة عمك، احمليها‏.‏ فاختصم فيها علي وزيد وجعفر، فقال علي أنا أحق بها وهى ابنة عمي‏.‏ وقال جعفر ابنة عمي وخالتها تحتي‏.‏ وقال زيد ابنة أخي‏.‏ فقضى بها النبي صلى الله عليه وسلم لخالتها‏.‏ وقال ‏\"‏ الخالة بمنزلة الأم ‏\"‏‏.‏ وقال لعلي ‏\"‏ أنت مني وأنا منك ‏\"‏‏.‏ وقال لجعفر ‏\"‏ أشبهت خلقي وخلقي ‏\"‏‏.‏ وقال لزيد ‏\"‏ أنت أخونا ومولانا ‏\"‏‏.‏",
      "text_en": " Narrated Al-Bara:                     When the Prophet intended to perform `Umra in the month of Dhul-Qada, the people of Mecca did not let him enter Mecca till he settled the matter with them by promising to stay in it for three days only. When the document of treaty was written, the following was mentioned: 'These are the terms on which Muhammad, Allah's Apostle agreed (to make peace).' They said, \"We will not agree to this, for if we believed that you are Allah's Apostle we would not prevent you, but you are Muhammad bin `Abdullah.\" The Prophet said, \"I am Allah's Apostle and also Muhammad bin `Abdullah.\" Then he said to `Ali, \"Rub off (the words) 'Allah's Apostle' \", but `Ali said, \"No, by Allah, I will never rub off your name.\" So, Allah's Apostle took the document and wrote, 'This is what Muhammad bin `Abdullah has agreed upon: No arms will be brought into Mecca except in their cases, and nobody from the people of Mecca will be allowed to go with him (i.e. the Prophet ) even if he wished to follow him and he (the Prophet ) will not prevent any of his companions from staying in Mecca if the latter wants to stay.' When the Prophet entered Mecca and the time limit passed, the Meccans went to `Ali and said, \"Tell your Friend (i.e. the Prophet ) to go out, as the period (agreed to) has passed.\" So, the Prophet went out of Mecca. The daughter of Hamza ran after them (i.e. the Prophet and his companions), calling, \"O Uncle! O Uncle!\" `Ali received her and led her by the hand and said to Fatima, \"Take your uncle's daughter.\" Zaid and Ja`far quarreled about her. `Ali said, \"I have more right to her as she is my uncle's daughter.\" Ja`far said, \"She is my uncle's daughter, and her aunt is my wife.\" Zaid said, \"She is my brother's daughter.\" The Prophet judged that she should be given to her aunt, and said that the aunt was like the mother. He then said to 'All, \"You are from me and I am from you\", and said to Ja`far, \"You resemble me both in character and appearance\", and said to Zaid, \"You are our brother (in faith) and our freed slave.\"",
      "chain": [
        "20340",
        "20311",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "2700",
      "source": " Sahih Bukhari ",
      "chapter": "Peacemaking - كتاب الصلح",
      "chapter_no": "53",
      "text_ar": "وقال موسى بن مسعود حدثنا سفيان بن سعيد، عن أبي إسحاق، عن البراء بن عازب  رضى الله عنهما  قال صالح النبي صلى الله عليه وسلم المشركين يوم الحديبية على ثلاثة أشياء على أن من أتاه من المشركين رده إليهم، ومن أتاهم من المسلمين لم يردوه، وعلى أن يدخلها من قابل ويقيم بها ثلاثة أيام، ولا يدخلها إلا بجلبان السلاح السيف والقوس ونحوه‏.‏ فجاء أبو جندل يحجل في قيوده فرده إليهم‏.‏ قال لم يذكر مؤمل عن سفيان أبا جندل وقال إلا بجلب السلاح‏.‏",
      "text_en": " Narrated Al-Bara' bin 'Azib (ra):                      On the day of Hudaibiya, the Prophet (), the Prophet () made a peace treaty with the Al-Mushrikun on three conditions:1. The Prophet () would return to them any person from Al-Mushrikun (polytheists, idolaters, pagans).2. Al-Mushrikun pagans would not return any of the Muslims going to them, and 3. The Prophet () and his companions would come to Makkah the following year and would stay there for three days and would enter with their weapons in cases, e.g., swords, arrows, bows, etc.Abu Jandal came hopping, his legs being chained, but the Prophet () returned him to Al-Mushrikun.",
      "chain": [
        "20290",
        "20012",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "2808",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا محمد بن عبد الرحيم، حدثنا شبابة بن سوار الفزاري، حدثنا إسرائيل، عن أبي إسحاق، قال سمعت البراء  رضى الله عنه  يقول أتى النبي صلى الله عليه وسلم رجل مقنع بالحديد فقال يا رسول الله أقاتل وأسلم‏.‏ قال ‏\"‏ أسلم ثم قاتل ‏\"‏‏.‏ فأسلم ثم قاتل، فقتل، فقال رسول الله صلى الله عليه وسلم ‏\"‏ عمل قليلا وأجر كثيرا ‏\"‏‏.‏",
      "text_en": " Narrated Al-Bara:                     A man whose face was covered with an iron mask (i.e. clad in armor) came to the Prophet and said, \"O Allah's Apostle! Shall I fight or embrace Islam first? \"The Prophet said, \"Embrace Islam first and then fight.\" So he embraced Islam, and was martyred. Allah's Apostle said, A Little work, but a great reward. \"(He did very little (after embracing Islam), but he will be rewarded in abundance).",
      "chain": [
        "30272",
        "20426",
        "20311",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "2831",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا أبو الوليد، حدثنا شعبة، عن أبي إسحاق، قال سمعت البراء  رضى الله عنه  يقول لما نزلت ‏{‏لا يستوي القاعدون من المؤمنين‏}‏ دعا رسول الله صلى الله عليه وسلم زيدا، فجاء بكتف فكتبها، وشكا ابن أم مكتوم ضرارته فنزلت ‏{‏لا يستوي القاعدون من المؤمنين غير أولي الضرر ‏}‏‏.‏",
      "text_en": " Narrated Al-Bara:                     When the Divine Inspiration: \"Those of the believers who sit (at home), was revealed the Prophet sent for Zaid (bin Thabit) who came with a shoulder-blade and wrote on it. Ibn Um-Maktum complained about his blindness and on that the following revelation came: \"Not equal are those believers who sit (at home) except those who are disabled (by injury, or are blind or lame etc.) and those who strive hard and fight in the Way of Allah with their wealth and lives).\" (4.95)",
      "chain": [
        "20296",
        "20020",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "2836",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا أبو الوليد، حدثنا شعبة، عن أبي إسحاق، سمعت البراء  رضى الله عنه  كان النبي صلى الله عليه وسلم ينقل ويقول ‏\"‏ لولا أنت ما اهتدينا ‏\"‏‏.‏",
      "text_en": " Narrated Al-Bara:                     The Prophet went on carrying (i.e. the earth) and saying, \"Without You (O Allah!) we would have got no guidance.\"",
      "chain": [
        "20296",
        "20020",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "2837",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن أبي إسحاق، عن البراء  رضى الله عنه  قال رأيت رسول الله صلى الله عليه وسلم يوم الأحزاب ينقل التراب وقد وارى التراب بياض بطنه، وهو يقول لولا أنت ما اهتدينا ولا تصدقنا ولا صلينا‏.‏ فأنزل السكينة علينا وثبت الأقدام إن لاقينا‏.‏ إن الألى قد بغوا علينا إذا أرادوا فتنة أبينا‏.‏",
      "text_en": " Narrated Al-Bara:                     On the day (of the battle) of Al-Ahzab (i.e. clans) I saw the Prophet carrying earth, and the earth was covering the whiteness of his `Abdomen. And he was saying, \"Without You (O Allah!) we would have got no guidance, nor given in charity, nor prayed. So please bless us with tranquility and make firm our feet when we meet our enemies. Indeed (these) people have rebelled against (oppressed) us but never shall we yield if they try to bring affliction upon us.\"",
      "chain": [
        "30329",
        "20020",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "2874",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا يحيى بن سعيد، عن سفيان، قال حدثني أبو إسحاق، عن البراء  رضى الله عنه  قال له رجل يا أبا عمارة وليتم يوم حنين قال لا، والله ما ولى النبي صلى الله عليه وسلم ولكن ولى سرعان الناس، فلقيهم هوازن بالنبل والنبي صلى الله عليه وسلم على بغلته البيضاء، وأبو سفيان بن الحارث آخذ بلجامها، والنبي صلى الله عليه وسلم يقول ‏\"‏ أنا النبي لا كذب أنا ابن عبد المطلب‏\"‏",
      "text_en": " Narrated Al-Bara:                     that a man asked him. \"O Abu '`Umara! Did you flee on the day (of the battle) of Hunain?\" He replied, \"No, by Allah, the Prophet did not flee but the hasty people fled and the people of the Tribe of Hawazin attacked them with arrows, while the Prophet was riding his white mule and Abu Sufyan bin Al-Harith was holding its reins, and the Prophet was saying, 'I am the Prophet in truth, I am the son of `Abdul Muttalib.' \"",
      "chain": [
        "30170",
        "20031",
        "20012",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "2930",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عمرو بن خالد، حدثنا زهير، حدثنا أبو إسحاق، قال سمعت البراء، وسأله، رجل أكنتم فررتم يا أبا عمارة يوم حنين قال لا، والله ما ولى رسول الله صلى الله عليه وسلم، ولكنه خرج شبان أصحابه وأخفاؤهم حسرا ليس بسلاح، فأتوا قوما رماة، جمع هوازن وبني نصر، ما يكاد يسقط لهم سهم، فرشقوهم رشقا ما يكادون يخطئون، فأقبلوا هنالك إلى النبي صلى الله عليه وسلم وهو على بغلته البيضاء، وابن عمه أبو سفيان بن الحارث بن عبد المطلب يقود به، فنزل واستنصر ثم قال أنا النبي لا كذب أنا ابن عبد المطلب ثم صف أصحابه‏.‏",
      "text_en": " Narrated Abu 'Is-haq:                     A man asked Al-Bara', \"O Abu '`Umara! Did you all flee on the day (of the battle) of Hunain?\" He replied, \"No, by Allah! Allah's Apostle did not flee, but his young unarmed companions passed by the archers of the tribe of Hawazin and Bani Nasr whose arrows hardly missed a target, and they threw arrows at them hardly missing a shot. So the Muslims retreated towards the Prophet while he was riding his white mule which was being led by his cousin Abu Sufyan bin Al-Harith bin `Abdul Muttalib. The Prophet dismounted and invoked Allah for victory; then he said, 'I am the Prophet, without a lie; I am the son of `Abdul Muttalib, and then he arranged his companions in rows.\"",
      "chain": [
        "30237",
        "20321",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "3022",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا علي بن مسلم، حدثنا يحيى بن زكرياء بن أبي زائدة، قال حدثني أبي، عن أبي إسحاق، عن البراء بن عازب  رضى الله عنهما  قال بعث رسول الله صلى الله عليه وسلم رهطا من الأنصار إلى أبي رافع ليقتلوه، فانطلق رجل منهم فدخل حصنهم قال فدخلت في مربط دواب لهم، قال وأغلقوا باب الحصن، ثم إنهم فقدوا حمارا لهم، فخرجوا يطلبونه، فخرجت فيمن خرج أريهم أنني أطلبه معهم، فوجدوا الحمار، فدخلوا ودخلت، وأغلقوا باب الحصن ليلا، فوضعوا المفاتيح في كوة حيث أراها، فلما ناموا أخذت المفاتيح، ففتحت باب الحصن ثم دخلت عليه فقلت يا أبا رافع‏.‏ فأجابني، فتعمدت الصوت، فضربته فصاح، فخرجت ثم جئت، ثم رجعت كأني مغيث فقلت يا أبا رافع، وغيرت صوتي، فقال ما لك لأمك الويل قلت ما شأنك قال لا أدري من دخل على فضربني‏.‏ قال فوضعت سيفي في بطنه، ثم تحاملت عليه حتى قرع العظم، ثم خرجت وأنا دهش، فأتيت سلما لهم لأنزل منه فوقعت فوثئت رجلي، فخرجت إلى أصحابي فقلت ما أنا ببارح حتى أسمع الناعية، فما برحت حتى سمعت نعايا أبي رافع تاجر أهل الحجاز‏.‏ قال فقمت وما بي قلبة حتى أتينا النبي صلى الله عليه وسلم فأخبرناه‏.‏",
      "text_en": " Narrated Al-Bara bin Azib:                     Allah's Apostle sent a group of Ansari men to kill Abu-Rafi`. One of them set out and entered their (i.e. the enemies) fort. That man said, \"I hid myself in a stable for their animals. They closed the fort gate. Later they lost a donkey of theirs, so they went out in its search. I, too, went out along with them, pretending to look for it. They found the donkey and entered their fort. And I, too, entered along with them. They closed the gate of the fort at night, and kept its keys in a small window where I could see them. When those people slept, I took the keys and opened the gate of the fort and came upon Abu Rafi` and said, 'O Abu Rafi`. When he replied me, I proceeded towards the voice and hit him. He shouted and I came out to come back, pretending to be a helper. I said, 'O Abu Rafi`, changing the tone of my voice. He asked me, 'What do you want; woe to your mother?' I asked him, 'What has happened to you?' He said, 'I don't know who came to me and hit me.' Then I drove my sword into his belly and pushed it forcibly till it touched the bone. Then I came out, filled with puzzlement and went towards a ladder of theirs in order to get down but I fell down and sprained my foot. I came to my companions and said, 'I will not leave till I hear the wailing of the women.' So, I did not leave till I heard the women bewailing Abu Rafi`, the merchant pf Hijaz. Then I got up, feeling no ailment, (and we proceeded) till we came upon the Prophet and informed him.\"",
      "chain": [
        "30261",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "3023",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثني عبد الله بن محمد، حدثنا يحيى بن آدم، حدثنا يحيى بن أبي زائدة، عن أبيه، عن أبي إسحاق، عن البراء بن عازب  رضى الله عنهما  قال بعث رسول الله صلى الله عليه وسلم رهطا من الأنصار إلى أبي رافع فدخل عليه عبد الله بن عتيك بيته ليلا، فقتله وهو نائم‏.‏",
      "text_en": " Narrated Al-Bara bin Azib:                     Allah's Apostle sent a group of the Ansar to Abu Rafi`. `Abdullah bin Atik entered his house at night and killed him while he was sleeping.",
      "chain": [
        "30351",
        "20364",
        "20366",
        "11338",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "3034",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا مسدد، حدثنا أبو الأحوص، حدثنا أبو إسحاق، عن البراء  رضى الله عنه  قال رأيت النبي صلى الله عليه وسلم يوم الخندق وهو ينقل التراب حتى وارى التراب شعر صدره، وكان رجلا كثير الشعر وهو يرتجز برجز عبد الله اللهم لولا أنت ما اهتدينا ولا تصدقنا ولا صلينا فأنزلن سكينة علينا وثبت الأقدام إن لاقينا إن الأعداء قد بغوا علينا إذا أرادوا فتنة أبينا يرفع بها صوته‏.‏",
      "text_en": " Narrated Al-Bara:                     I saw Allah's Apostle on the day (of the battle) of the Trench carrying earth till the hair of his chest were covered with dust and he was a hairy man. He was reciting the following verses of `Abdullah (bin Rawaha): \"O Allah, were it not for You, We would not have been guided, Nor would we have given in charity, nor prayed. So, bestow on us calmness, and when we meet the enemy. Then make our feet firm, for indeed, Yet if they want to put us in affliction, (i.e. want to fight against us) we would not (flee but withstand them).\" The Prophet used to raise his voice while reciting these verses. (See Hadith No. 432, Vol. 5).",
      "chain": [
        "30175",
        "20327",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "3039",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عمرو بن خالد، حدثنا زهير، حدثنا أبو إسحاق، قال سمعت البراء بن عازب  رضى الله عنهما  يحدث قال جعل النبي صلى الله عليه وسلم على الرجالة يوم أحد  وكانوا خمسين رجلا  عبد الله بن جبير فقال ‏\"‏ إن رأيتمونا تخطفنا الطير، فلا تبرحوا مكانكم هذا حتى أرسل إليكم، وإن رأيتمونا هزمنا القوم وأوطأناهم فلا تبرحوا حتى أرسل إليكم ‏\"‏ فهزموهم‏.‏ قال فأنا والله رأيت النساء يشتددن قد بدت خلاخلهن وأسوقهن رافعات ثيابهن، فقال أصحاب عبد الله بن جبير الغنيمة  أى قوم  الغنيمة، ظهر أصحابكم فما تنتظرون فقال عبد الله بن جبير أنسيتم ما قال لكم رسول الله صلى الله عليه وسلم قالوا والله لنأتين الناس فلنصيبن من الغنيمة‏.‏ فلما أتوهم صرفت وجوههم فأقبلوا منهزمين، فذاك إذ يدعوهم الرسول في أخراهم، فلم يبق مع النبي صلى الله عليه وسلم غير اثنى عشر رجلا، فأصابوا منا سبعين، وكان النبي صلى الله عليه وسلم وأصحابه أصاب من المشركين يوم بدر أربعين ومائة سبعين أسيرا وسبعين قتيلا، فقال أبو سفيان أفي القوم محمد ثلاث مرات، فنهاهم النبي صلى الله عليه وسلم أن يجيبوه ثم قال أفي القوم ابن أبي قحافة ثلاث مرات، ثم قال أفي القوم ابن الخطاب ثلاث مرات، ثم رجع إلى أصحابه فقال أما هؤلاء فقد قتلوا‏.‏ فما ملك عمر نفسه فقال كذبت والله يا عدو الله، إن الذين عددت لأحياء كلهم، وقد بقي لك ما يسوؤك‏.‏ قال يوم بيوم بدر، والحرب سجال، إنكم ستجدون في القوم مثلة لم آمر بها ولم تسؤني، ثم أخذ يرتجز أعل هبل، أعل هبل‏.‏ قال النبي صلى الله عليه وسلم ‏\"‏ ألا تجيبوا له ‏\"‏‏.‏ قالوا يا رسول الله، ما نقول قال ‏\"‏ قولوا الله أعلى وأجل ‏\"‏‏.‏ قال إن لنا العزى ولا عزى لكم‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ ألا تجيبوا له ‏\"‏‏.‏ قال قالوا يا رسول الله، ما نقول قال ‏\"‏ قولوا الله مولانا ولا مولى لكم ‏\"‏‏.‏",
      "text_en": " Narrated Al-Bara bin Azib:                     The Prophet appointed `Abdullah bin Jubair as the commander of the infantry men (archers) who were fifty on the day (of the battle) of Uhud. He instructed them, \"Stick to your place, and don't leave it even if you see birds snatching us, till I send for you; and if you see that we have defeated the infidels and made them flee, even then you should not leave your place till I send for you.\" Then the infidels were defeated. By Allah, I saw the women fleeing lifting up their clothes revealing their leg-bangles and their legs. So, the companions of `Abdullah bin Jubair said, \"The booty! O people, the booty ! Your companions have become victorious, what are you waiting for now?\" `Abdullah bin Jubair said, \"Have you forgotten what Allah's Apostle said to you?\" They replied, \"By Allah! We will go to the people (i.e. the enemy) and collect our share from the war booty.\" But when they went to them, they were forced to turn back defeated. At that time Allah's Apostle in their rear was calling them back. Only twelve men remained with the Prophet and the infidels martyred seventy men from us. On the day (of the battle) of Badr, the Prophet and his companions had caused the 'Pagans to lose 140 men, seventy of whom were captured and seventy were killed. Then Abu Sufyan asked thrice, \"Is Muhammad present amongst these people?\" The Prophet ordered his companions not to answer him. Then he asked thrice, \"Is the son of Abu Quhafa present amongst these people?\" He asked again thrice, \"Is the son of Al-Khattab present amongst these people?\" He then returned to his companions and said, \"As for these (men), they have been killed.\" `Umar could not control himself and said (to Abu Sufyan), \"You told a lie, by Allah! O enemy of Allah! All those you have mentioned are alive, and the thing which will make you unhappy is still there.\" Abu Sufyan said, \"Our victory today is a counterbalance to yours in the battle of Badr, and in war (the victory) is always undecided and is shared in turns by the belligerents, and you will find some of your (killed) men mutilated, but I did not urge my men to do so, yet I do not feel sorry for their deed\" After that he started reciting cheerfully, \"O Hubal, be high! (1) On that the Prophet said (to his companions), \"Why don't you answer him back?\" They said, \"O Allah's Apostle What shall we say?\" He said, \"Say, Allah is Higher and more Sublime.\" (Then) Abu Sufyan said, \"We have the (idol) Al `Uzza, and you have no `Uzza.\" The Prophet said (to his companions), \"Why don't you answer him back?\" They asked, \"O Allah's Apostle! What shall we say?\" He said, \"Says Allah is our Helper and you have no helper.\"",
      "chain": [
        "30237",
        "20321",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "3184",
      "source": " Sahih Bukhari ",
      "chapter": "Jizyah and Mawaada'ah - كتاب الجزية والموادعة",
      "chapter_no": "58",
      "text_ar": "حدثنا أحمد بن عثمان بن حكيم، حدثنا شريح بن مسلمة، حدثنا إبراهيم بن يوسف بن أبي إسحاق، قال حدثني أبي، عن أبي إسحاق، قال حدثني البراء  رضى الله عنه أن النبي صلى الله عليه وسلم لما أراد أن يعتمر أرسل إلى أهل مكة يستأذنهم ليدخل مكة، فاشترطوا عليه أن لا يقيم بها إلا ثلاث ليال، ولا يدخلها إلا بجلبان السلاح، ولا يدعو منهم أحدا، قال فأخذ يكتب الشرط بينهم علي بن أبي طالب، فكتب هذا ما قاضى عليه محمد رسول الله‏.‏ فقالوا لو علمنا أنك رسول الله لم نمنعك ولبايعناك، ولكن اكتب هذا ما قاضى عليه محمد بن عبد الله‏.‏ فقال ‏\"‏ أنا والله محمد بن عبد الله وأنا والله رسول الله ‏\"‏‏.‏ قال وكان لا يكتب قال فقال لعلي ‏\"‏ امح رسول الله ‏\"‏‏.‏ فقال علي والله لا أمحاه أبدا‏.‏ قال ‏\"‏ فأرنيه ‏\"‏‏.‏ قال فأراه إياه، فمحاه النبي صلى الله عليه وسلم بيده، فلما دخل ومضى الأيام أتوا عليا فقالوا مر صاحبك فليرتحل‏.‏ فذكر ذلك لرسول الله صلى الله عليه وسلم فقال ‏\"‏ نعم ‏\"‏ ثم ارتحل‏.‏",
      "text_en": " Narrated Al-Bara:                     When the Prophet intended to perform the `Umra he sent a person to the people of Mecca asking their permission to enter Mecca. They stipulated that he would not stay for more than three days and would not enter it except with sheathed arms and would not preach (Islam) to any of them. So `Ali bin Abi- Talib started writing the treaty between them. He wrote, \"This is what Muhammad, Apostle of Allah has agreed to.\" The (Meccans) said, \"If we knew that you (Muhammad) are the Apostle of Allah, then we would not have prevented you and would have followed you. But write, 'This is what Muhammad bin `Abdullah has agreed to..' \" On that Allah's Apostle said, \"By Allah, I am Muhammad bin `Abdullah, and, by Allah, I am Apostle of 'Allah.\" Allah's Apostle used not to write; so he asked `Ali to erase the expression of Apostle of Allah. On that `Ali said, \"By Allah I will never erase it.\" Allah's Apostle said (to `Ali), \"Let me see the paper.\" When `Ali showed him the paper, the Prophet erased the expression with his own hand. When Allah's Apostle had entered Mecca and three days had elapsed, the Meccans came to `Ali and said, \"Let your friend (i.e. the Prophet) quit Mecca.\" `Ali informed Allah's Apostle about it and Allah's Apostle said, \"Yes,\" and then he departed.",
      "chain": [
        "30185",
        "20427",
        "20406",
        "20473",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "3213",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن عدي بن ثابت، عن البراء  رضى الله عنه  قال قال النبي صلى الله عليه وسلم لحسان ‏\"‏ اهجهم  أو هاجهم  وجبريل معك ‏\"‏‏.‏",
      "text_en": " Narrated Al Bara:                     The Prophet said to Hassan, \"Lampoon them (i.e. the pagans) and Gabriel is with you.\"",
      "chain": [
        "30329",
        "20020",
        "11372",
        "400"
      ]
    },
    {
      "hadith_no": "3249",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا مسدد، حدثنا يحيى بن سعيد، عن سفيان، قال حدثني أبو إسحاق، قال سمعت البراء بن عازب  رضى الله عنهما  قال أتي رسول الله صلى الله عليه وسلم بثوب من حرير، فجعلوا يعجبون من حسنه ولينه، فقال رسول الله صلى الله عليه وسلم ‏\"‏ لمناديل سعد بن معاذ في الجنة أفضل من هذا ‏\"‏‏.‏",
      "text_en": " Narrated Al-Bara bin Azib:                     Allah's Apostle was given a silken garment, and its beauty and delicacy astonished the people. On that, Allah's Apostle said, \"No doubt, the handkerchiefs of Sa`d bin Mu`adh in Paradise are better than this.\"",
      "chain": [
        "30175",
        "20031",
        "20012",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "3255",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا حجاج بن منهال، حدثنا شعبة، قال عدي بن ثابت أخبرني قال سمعت البراء  رضى الله عنه  عن النبي صلى الله عليه وسلم قال لما مات إبراهيم قال ‏\"‏ إن له مرضعا في الجنة ‏\"‏‏.‏",
      "text_en": " Narrated Al-Bara (bin Azib):                     The Prophet, after the death of his son Ibrahim, said, \"There is a wet-nurse for him (i.e. Ibrahim) in Paradise.\"",
      "chain": [
        "20219",
        "20020",
        "11372",
        "400"
      ]
    },
    {
      "hadith_no": "3589",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا أحمد بن سعيد أبو عبد الله، حدثنا إسحاق بن منصور، حدثنا إبراهيم بن يوسف، عن أبيه، عن أبي إسحاق، قال سمعت البراء، يقول كان رسول الله صلى الله عليه وسلم أحسن الناس وجها وأحسنه خلقا، ليس بالطويل البائن ولا بالقصير‏.‏",
      "text_en": " Narrated Al-Bara:                     Allah's Apostle was the handsomest of all the people, and had the best appearance. He was neither very tall nor short.",
      "chain": [
        "30296",
        "30313",
        "20406",
        "20473",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "3591",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن أبي إسحاق، عن البراء بن عازب  رضى الله عنهما  قال كان النبي صلى الله عليه وسلم مربوعا، بعيد ما بين المنكبين، له شعر يبلغ شحمة أذنه، رأيته في حلة حمراء، لم أر شيئا قط أحسن منه‏.‏ قال يوسف بن أبي إسحاق عن أبيه إلى منكبيه‏.‏",
      "text_en": " Narrated Al-Bara:                     The Prophet was of moderate height having broad shoulders (long) hair reaching his ear-lobes. Once I saw him in a red cloak and I had never seen a more handsome than him.\"",
      "chain": [
        "30329",
        "20020",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "3618",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا مالك بن إسماعيل، حدثنا إسرائيل، عن أبي إسحاق، عن البراء  رضى الله عنه  قال كنا يوم الحديبية أربع عشرة مائة، والحديبية بئر فنزحناها حتى لم نترك فيها قطرة، فجلس النبي صلى الله عليه وسلم على شفير البئر، فدعا بماء فمضمض ومج في البئر، فمكثنا غير بعيد ثم استقينا حتى روينا وروت  أو صدرت  ركائبنا‏.‏",
      "text_en": " Narrated Al-Bara:                     We were one-thousand-and-four-hundred persons on the day of Al-Hudaibiya (Treaty), and (at) Al- Hudaibiya (there) was a well. We drew out its water not leaving even a single drop. The Prophet sat at the edge of the well and asked for some water with which he rinsed his mouth and then he threw it out into the well. We stayed for a short while and then drew water from the well and quenched our thirst, and even our riding animals drank water to their satisfaction.",
      "chain": [
        "20357",
        "20311",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "3657",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثني محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن أبي إسحاق، سمعت البراء بن عازب  رضى الله عنهما  قرأ رجل الكهف وفي الدار الدابة فجعلت تنفر فسلم، فإذا ضبابة  أو سحابة  غشيته، فذكره للنبي صلى الله عليه وسلم فقال ‏\"‏ اقرأ فلان، فإنها السكينة نزلت للقرآن، أو تنزلت للقرآن ‏\"‏‏.‏",
      "text_en": " Narrated Al-Bara' bin `Azib:                     A man recited Surat-al-Kahf (in his prayer) and in the house there was a (riding) animal which got frightened and started jumping. The man finished his prayer with Taslim, but behold! A mist or a cloud hovered over him. He informed the Prophet of that and the Prophet said, \"O so-and-so! Recite, for this (mist or cloud) was a sign of peace descending for the recitation of Qur'an.\"",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "3658",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا أحمد بن يزيد بن إبراهيم أبو الحسن الحراني، حدثنا زهير بن معاوية، حدثنا أبو إسحاق، سمعت البراء بن عازب، يقول جاء أبو بكر  رضى الله عنه  إلى أبي في منزله، فاشترى منه رحلا فقال لعازب ابعث ابنك يحمله معي‏.‏ قال فحملته معه، وخرج أبي ينتقد ثمنه، فقال له أبي يا أبا بكر حدثني كيف صنعتما حين سريت مع رسول الله صلى الله عليه وسلم قال نعم أسرينا ليلتنا، ومن الغد حتى قام قائم الظهيرة، وخلا الطريق لا يمر فيه أحد، فرفعت لنا صخرة طويلة، لها ظل لم تأت عليه الشمس فنزلنا عنده، وسويت للنبي صلى الله عليه وسلم مكانا بيدي ينام عليه، وبسطت فيه فروة، وقلت نم يا رسول الله، وأنا أنفض لك ما حولك‏.‏ فنام وخرجت أنفض ما حوله، فإذا أنا براع مقبل بغنمه إلى الصخرة يريد منها مثل الذي أردنا فقلت لمن أنت يا غلام فقال لرجل من أهل المدينة أو مكة‏.‏ قلت أفي غنمك لبن قال نعم‏.‏ قلت أفتحلب قال نعم‏.‏ فأخذ شاة‏.‏ فقلت انفض الضرع من التراب والشعر والقذى‏.‏ قال فرأيت البراء يضرب إحدى يديه على الأخرى ينفض، فحلب في قعب كثبة من لبن، ومعي إداوة حملتها للنبي صلى الله عليه وسلم يرتوي منها، يشرب ويتوضأ، فأتيت النبي صلى الله عليه وسلم فكرهت أن أوقظه، فوافقته حين استيقظ، فصببت من الماء على اللبن حتى برد أسفله، فقلت اشرب يا رسول الله  قال  فشرب، حتى رضيت ثم قال ‏\"‏ ألم يأن للرحيل ‏\"‏‏.‏ قلت بلى  قال  فارتحلنا بعد ما مالت الشمش، واتبعنا سراقة بن مالك، فقلت أتينا يا رسول الله‏.‏ فقال ‏\"‏ لا تحزن، إن الله معنا ‏\"‏‏.‏ فدعا عليه النبي صلى الله عليه وسلم فارتطمت به فرسه إلى بطنها  أرى في جلد من الأرض، شك زهير  فقال إني أراكما قد دعوتما على فادعوا لي، فالله لكما أن أرد عنكما الطلب‏.‏ فدعا له النبي صلى الله عليه وسلم فنجا فجعل لا يلقى أحدا إلا قال كفيتكم ما هنا‏.‏ فلا يلقى أحدا إلا رده‏.‏ قال ووفى لنا‏.‏",
      "text_en": " Narrated Al-Bara' bin `Azib:                     Abu Bakr came to my father who was at home and purchased a saddle from him. He said to `Azib. \"Tell your son to carry it with me.\" So I carried it with him and my father followed us so as to take the price (of the saddle). My father said, \"O Abu Bakr! Tell me what happened to you on your night journey with Allah's Apostle (during Migration).\" He said, \"Yes, we travelled the whole night and also the next day till midday. when nobody could be seen on the way ( because of the severe heat) . Then there appeared a long rock having shade beneath it, and the sunshine had not come to it yet. So we dismounted there and I levelled a place and covered it with an animal hide or dry grass for the Prophet to sleep on (for a while). I then said, 'Sleep, O Allah's Apostle, and I will guard you.' So he slept and I went out to guard him. Suddenly I saw a shepherd coming with his sheep to that rock with the same intention we had when we came to it. I asked (him). 'To whom do you belong, O boy?' He replied, 'I belong to a man from Medina or Mecca.' I said, 'Do your sheep have milk?' He said, 'Yes.' I said, 'Will you milk for us?' He said, 'Yes.' He caught hold of a sheep and I asked him to clean its teat from dust, hairs and dirt. (The sub-narrator said that he saw Al-Bara' striking one of his hands with the other, demonstrating how the shepherd removed the dust.) The shepherd milked a little milk in a wooden container and I had a leather container which I carried for the Prophet to drink and perform the ablution from. I went to the Prophet, hating to wake him up, but when I reached there, the Prophet had already awakened; so I poured water over the middle part of the milk container, till the milk was cold. Then I said, 'Drink, O Allah's Apostle!' He drank till I was pleased. Then he asked, 'Has the time for our departure come?' I said, 'Yes.' So we departed after midday. Suraqa bin Malik followed us and I said, 'We have been discovered, O Allah's Apostle!' He said, Don't grieve for Allah is with us.' The Prophet invoked evil on him (i.e. Suraqa) and so the legs of his horse sank into the earth up to its belly. (The subnarrator, Zuhair is not sure whether Abu Bakr said, \"(It sank) into solid earth.\") Suraqa said, 'I see that you have invoked evil on me. Please invoke good on me, and by Allah, I will cause those who are seeking after you to return.' The Prophet invoked good on him and he was saved. Then, whenever he met somebody on the way, he would say, 'I have looked for him here in vain.' So he caused whomever he met to return. Thus Suraqa fulfilled his promise.\"",
      "chain": [
        "30388",
        "20321",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "3695",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا عبد الله بن رجاء، حدثنا إسرائيل، عن أبي إسحاق، عن البراء، قال اشترى أبو بكر  رضى الله عنه  من عازب رحلا بثلاثة عشر درهما فقال أبو بكر لعازب مر البراء فليحمل إلى رحلي‏.‏ فقال عازب لا حتى تحدثنا كيف صنعت أنت ورسول الله صلى الله عليه وسلم حين خرجتما من مكة والمشركون يطلبونكم قال ارتحلنا من مكة، فأحيينا أو سرينا ليلتنا ويومنا حتى أظهرنا وقام قائم الظهيرة، فرميت ببصري هل أرى من ظل فآوي إليه، فإذا صخرة أتيتها فنظرت بقية ظل لها فسويته، ثم فرشت للنبي صلى الله عليه وسلم فيه، ثم قلت له اضطجع يا نبي الله‏.‏ فاضطجع النبي صلى الله عليه وسلم ثم انطلقت أنظر ما حولي، هل أرى من الطلب أحدا فإذا أنا براعي غنم يسوق غنمه إلى الصخرة يريد منها الذي أردنا، فسألته فقلت له لمن أنت يا غلام قال لرجل من قريش سماه فعرفته‏.‏ فقلت هل في غنمك من لبن قال نعم‏.‏ قلت فهل أنت حالب لبنا قال نعم‏.‏ فأمرته فاعتقل شاة من غنمه، ثم أمرته أن ينفض ضرعها من الغبار، ثم أمرته أن ينفض كفيه، فقال هكذا ضرب إحدى كفيه بالأخرى فحلب لي كثبة من لبن، وقد جعلت لرسول الله صلى الله عليه وسلم إداوة على فمها خرقة، فصببت على اللبن حتى برد أسفله، فانطلقت به إلى النبي صلى الله عليه وسلم فوافقته قد استيقظ، فقلت اشرب يا رسول الله‏.‏ فشرب حتى رضيت ثم قلت قد آن الرحيل يا رسول الله‏.‏ قال ‏\"‏ بلى ‏\"‏‏.‏ فارتحلنا والقوم يطلبونا، فلم يدركنا أحد منهم غير سراقة بن مالك بن جعشم على فرس له‏.‏ فقلت هذا الطلب قد لحقنا يا رسول الله‏.‏ فقال ‏\"‏ لا تحزن إن الله معنا ‏\"‏‏.‏",
      "text_en": " Narrated Al-Bara:                     Abu Bakr bought a (camel) saddle from `Azib for thirteen Dirhams. Abu Bakr said to `Azib, \"Tell Al- Bara' to carry the saddle for me.\" `Azib said, \"No, unless you relate to me what happened to you and Allah 's Apostle when you left Mecca while the pagans were in search of you.\" Abu Bakr said, \"We left Mecca and we travel led continuously for that night and the following day till it was midday. I looked (around) searching for shade to take as shelter, and suddenly I came across a rock, and found a little shade there. So I cleaned the place and spread a bed for the Prophet in the shade and said to him, 'Lie down, O Allah's Apostle.' So the Prophet lay down and I went out, looking around to see if there was any person pursuing us. Suddenly I saw a shepherd driving his sheep towards the rock, seeking what we had already sought from it. I asked him, 'To whom do you belong, O boy?' He said, 'I belong to a man from Quraish.' He named the man and I recognized him. I asked him, 'Is there any milk with your sheep?' He said, 'Yes.' I said, 'Will you then milk (some) for us?' He said, 'Yes.' Then I asked him to tie the legs of one of the sheep and clean its udder, and then ordered him to clean his hands from dust. Then the shepherd cleaned his hands by striking his hands against one another. After doing so, he milked a small amount of milk. I used to keep for Allah's Apostle a leather water-container, the mouth of which was covered with a piece of cloth. I poured water on the milk container till its lower part was cold. Then I took the milk to the Prophet whom I found awake. I said to him, 'Drink, O Allah's Apostle.' So he drank till I became pleased. Then I said, 'It is time for us to move, O Allahs Apostle!' He said, 'Yes.' So we set out while the people (i.e. Quraish pagans) were searching for us, but none found us except Suraiqa bin Malik bin Jushum who was riding his horse. I said, 'These are our pursuers who have found us. O Allah's Apostle!' He said, 'Do not grieve, for Allah is with us.\"",
      "chain": [
        "20245",
        "20311",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "3794",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا حجاج بن المنهال، حدثنا شعبة، قال أخبرني عدي، قال سمعت البراء  رضى الله عنه  قال رأيت النبي صلى الله عليه وسلم والحسن على عاتقه يقول ‏\"‏ اللهم إني أحبه فأحبه ‏\"‏‏.‏",
      "text_en": " Narrated Al-Bara:                     I saw the Prophet carrying Al-Hasan on his shoulder an saying, \"O Allah! I love him, so please love him.\"",
      "chain": [
        "20219",
        "20020",
        "11372",
        "400"
      ]
    }
  ],
  "total_hadiths": 358
}