{
  "id": "4000",
  "name": "Usama bin Sharek al-Tha'labi ( أسامة بن شريك الثعلبي العامري ( رضي الله عنه",
  "full_name": "Usama bin Sharek al-Tha'labi ( أسامة بن شريك الثعلبي العامري ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Kufa"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ 4  -  صحابي ]"
    ],
    "tags": [
      "Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "2015",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن الشيباني، عن زياد بن علاقة، عن أسامة بن شريك، قال خرجت مع النبي صلى الله عليه وسلم حاجا فكان الناس يأتونه فمن قال يا رسول الله سعيت قبل أن أطوف أو قدمت شيئا أو أخرت شيئا ‏.‏ فكان يقول ‏\"‏ لا حرج لا حرج إلا على رجل اقترض عرض رجل مسلم وهو ظالم فذلك الذي حرج وهلك ‏\"‏ ‏.‏",
      "text_en": " Usamah bin Sharik said “I went out with the Prophet (ﷺ) to perform Hajj, and the people were coming to him. One would say “Apostle of Allaah(ﷺ) I ran between Al Safa’ and Al Marwah before going round the Ka’bah or I did something before the its proper time or did something after its proper time. He would reply “No harm will come; no harm will come except to one who defames a Muslim acting wrongfully. That is the one who will be in trouble and will perish.",
      "chain": [
        "30203",
        "20028",
        "11352",
        "11339",
        "4000"
      ]
    },
    {
      "hadith_no": "3855",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Medicine (Kitab Al-Tibb) - كتاب الطب",
      "chapter_no": "29",
      "text_ar": "حدثنا حفص بن عمر النمري، حدثنا شعبة، عن زياد بن علاقة، عن أسامة بن شريك، قال أتيت النبي صلى الله عليه وسلم وأصحابه كأنما على رءوسهم الطير فسلمت ثم قعدت فجاء الأعراب من ها هنا وها هنا فقالوا يا رسول الله أنتداوى فقال ‏\"‏ تداووا فإن الله عز وجل لم يضع داء إلا وضع له دواء غير داء واحد الهرم ‏\"‏ ‏.‏",
      "text_en": " Narrated Usamah ibn Sharik:                     I came to the Prophet (ﷺ) and his Companions were sitting as if they had birds on their heads. I saluted and sat down. The desert Arabs then came from here and there. They asked: Messenger of Allah, should we make use of medical treatment? He replied: Make use of medical treatment, for Allah has not made a disease without appointing a remedy for it, with the exception of one disease, namely old age.",
      "chain": [
        "30329",
        "20020",
        "11339",
        "4000"
      ]
    },
    {
      "hadith_no": "2172",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Medicine - كتاب الطب عن رسول اللَّهِ صلى الله عليه وسلم",
      "chapter_no": "28",
      "text_ar": "حدثنا بشر بن معاذ العقدي، حدثنا أبو عوانة، عن زياد بن علاقة، عن أسامة بن شريك، قال قالت الأعراب يا رسول الله ألا نتداوى قال ‏\"‏ نعم يا عباد الله تداووا فإن الله لم يضع داء إلا وضع له شفاء أو قال دواء إلا داء واحدا ‏\"‏ ‏.‏ قالوا يا رسول الله وما هو قال ‏\"‏ الهرم ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن ابن مسعود وأبي هريرة وأبي خزامة عن أبيه وابن عباس ‏.‏ وهذا حديث حسن صحيح ‏.‏",
      "text_en": " Usamah bin Sharik said:                     \"Some Bedouins asked: 'O Messenger of Allah (s.a.w) shall we treat (our ill)?' He said: 'Yes, O worshipers of Allah! Use remedies. For indeed Allah did not make a disease but He made a cure for it' - or - 'a remedy. Except for one disease.' They said: 'O Messenger of Allah (s.a.w)! What is it?' He said: 'Old age.'\"",
      "chain": [
        "34041",
        "20469",
        "11339",
        "4000"
      ]
    },
    {
      "hadith_no": "4023",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا محمد بن قدامة، قال حدثنا جرير، عن زيد بن عطاء بن السائب، عن زياد بن علاقة، عن أسامة بن شريك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أيما رجل خرج يفرق بين أمتي فاضربوا عنقه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Usamah bin Sharik said:                     \"The Messenger of Allah [SAW] said: 'Any man who goes out and tries to create division among my Ummah, strike his neck (kill him).'\"",
      "chain": [
        "4057",
        "11339",
        "4000"
      ]
    },
    {
      "hadith_no": "2774",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا محمد بن عبد الله بن عبيد بن عقيل، حدثنا عمرو بن عاصم، حدثنا أبو العوام القطان، عن محمد بن جحادة، عن زياد بن علاقة، عن أسامة بن شريك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تجني نفس على أخرى ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Usamah bin Sharik that the Messenger of Allah (ﷺ) said:                     “No person will be punished because of another's crime.”",
      "chain": [
        "34214",
        "20267",
        "18897",
        "11339",
        "4000"
      ]
    },
    {
      "hadith_no": "3562",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وهشام بن عمار، قالا حدثنا سفيان بن عيينة، عن زياد بن علاقة، عن أسامة بن شريك، قال شهدت الأعراب يسألون النبي  صلى الله عليه وسلم  أعلينا حرج في كذا أعلينا حرج في كذا فقال لهم ‏\"‏ عباد الله وضع الله الحرج إلا من اقترض من عرض أخيه شيئا فذاك الذي حرج ‏\"‏ ‏.‏ فقالوا يا رسول الله هل علينا جناح أن نتداوى قال ‏\"‏ تداووا عباد الله فإن الله سبحانه لم يضع داء إلا وضع معه شفاء إلا الهرم ‏\"‏ ‏.‏ قالوا يا رسول الله ما خير ما أعطي العبد قال ‏\"‏ خلق حسن ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Usamah bin Sharik said:                      “I saw the Bedouinsaskingthe Prophet (ﷺ): ‘Is there any harm in such and such, isthereany harm in such and such?’ He said to them: ‘O slaves of Allah!Allah has only made harm in that which transgresses the honor ofone’sbrother. That is what is sinful.’ They said: ‘O Messengerof Allah! Isthere any sin if we do not seek treatment?’ He said:‘Seek treatment,O slaves of Allah! For Allah does not create anydisease but He alsocreates with it the cure, except for old age.’They said: ‘O Messengerof Allah, what is the best thing that aperson may be given?’ He said:‘Good manners.’”",
      "chain": [
        "30201",
        "30288",
        "20005",
        "11339",
        "4000"
      ]
    }
  ],
  "total_hadiths": 6
}