{
  "id": "4001",
  "name": "Usama bin 'Umayr al-Hadhali ( أسامة بن عمير الهذلي ( رضي الله عنه",
  "full_name": "Usama bin 'Umayr al-Hadhali ( أسامة بن عمير الهذلي ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina",
      "Basra"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ 4  -  صحابي ]"
    ],
    "tags": [
      "al-Hadhali",
      "Basri",
      "Hunain"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "59",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا شعبة، عن قتادة، عن أبي المليح، عن أبيه، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يقبل الله عز وجل صدقة من غلول ولا صلاة بغير طهور ‏\"‏ ‏.‏",
      "text_en": " Narrated AbulMalih:                     The Prophet (ﷺ) said: Allah does not accept charity from goods acquired by embezzlement as He does not accept prayer without purification.",
      "chain": [
        "20285",
        "20020",
        "11019",
        "11453",
        "4001"
      ]
    },
    {
      "hadith_no": "1057",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا همام، عن قتادة، عن أبي المليح، عن أبيه، أن يوم، حنين كان يوم مطر فأمر النبي صلى الله عليه وسلم مناديه أن الصلاة في الرحال ‏.‏",
      "text_en": " Narrated Usamah ibn Umayr al-Huzali:                     The rain was falling on the day when the Battle of Hunayn took place. The Prophet (ﷺ), therefore, commanded that the people should offer their prayer in their camps.",
      "chain": [
        "28531",
        "20297",
        "11019",
        "11453",
        "4001"
      ]
    },
    {
      "hadith_no": "1059",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا نصر بن علي، قال سفيان بن حبيب خبرنا عن خالد الحذاء، عن أبي قلابة، عن أبي المليح، عن أبيه، أنه شهد النبي صلى الله عليه وسلم زمن الحديبية في يوم جمعة وأصابهم مطر لم تبتل أسفل نعالهم فأمرهم أن يصلوا في رحالهم ‏.‏",
      "text_en": " Narrated Usamah ibn Umayr al-Huzali:                     Usamah attended the Prophet (ﷺ) on the occasion of the treaty of al-Hudaybiyyah on Friday. The rain fell as little as the soles of the shoes of the people were not set. He (the Prophet) commanded them to offer Friday prayer in their dwellings.",
      "chain": [
        "30395",
        "20711",
        "11282",
        "11047",
        "11453",
        "4001"
      ]
    },
    {
      "hadith_no": "4132",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا مسدد بن مسرهد، أن يحيى بن سعيد، وإسماعيل بن إبراهيم، حدثاهم - المعنى، - عن سعيد بن أبي عروبة، عن قتادة، عن أبي المليح بن أسامة، عن أبيه، أن رسول الله صلى الله عليه وسلم نهى عن جلود السباع ‏.‏",
      "text_en": " Abu al-Malih b. Usamah quoting his father said:                      The Messenger of Allah (ﷺ) forbade (the use of) the skins of beasts of prey.",
      "chain": [
        "30175",
        "20031",
        "20208",
        "11073",
        "11019",
        "11453",
        "4001"
      ]
    },
    {
      "hadith_no": "1770",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Clothing - كتاب اللباس",
      "chapter_no": "24",
      "text_ar": "حدثنا أبو كريب، حدثنا ابن المبارك، ومحمد بن بشر، وعبد الله بن إسماعيل بن أبي خالد، عن سعيد بن أبي عروبة، عن قتادة، عن أبي المليح، عن أبيه، أن النبي صلى الله عليه وسلم نهى عن جلود السباع أن تفترش ‏.‏",
      "text_en": " Narrated Abu Al-Malih:                     From his father: \"The Prophet (ﷺ) prohibited using predator skins as a spread.\"",
      "chain": [
        "30216",
        "20025",
        "20352",
        "11073",
        "11019",
        "11453",
        "4001"
      ]
    },
    {
      "hadith_no": "1770",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Clothing - كتاب اللباس",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، حدثنا سعيد، عن قتادة، عن أبي المليح، عن أبيه، أن النبي صلى الله عليه وسلم نهى عن جلود السباع ‏.‏",
      "text_en": " Another chain from Abu Al-Malih from his father:                      \"The Prophet (ﷺ) prohibited predator skins.\"",
      "chain": [
        "30160",
        "20031",
        "11168",
        "11019",
        "11453",
        "4001"
      ]
    },
    {
      "hadith_no": "140",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا قتيبة، قال حدثنا أبو عوانة، عن قتادة، عن أبي المليح، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يقبل الله صلاة بغير طهور ولا صدقة من غلول ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Al-Malih, that his father said:                      \"The Messenger of Allah (ﷺ) said: 'Allah does not accept Salah without purification, nor charity from Ghulul.'\" [1][1] That which is taken from the spoils of war prior to their distribution.",
      "chain": [
        "30367",
        "20469",
        "11019",
        "11453",
        "4001"
      ]
    },
    {
      "hadith_no": "854",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا محمد بن المثنى، قال حدثنا محمد بن جعفر، قال حدثنا شعبة، عن قتادة، عن أبي المليح، عن أبيه، قال كنا مع رسول الله صلى الله عليه وسلم بحنين فأصابنا مطر فنادى منادي رسول الله صلى الله عليه وسلم أن صلوا في رحالكم ‏.‏",
      "text_en": " It was narrated from Abu Al Malih that his father said:                      \"We were with the Messenger of Allah (ﷺ) in Hunain and it rained. The caller of the Messenger of Allah (ﷺ)called out, telling us: 'Pray whereyou are.\"'",
      "chain": [
        "30170",
        "20173",
        "20020",
        "11019",
        "11453",
        "4001"
      ]
    },
    {
      "hadith_no": "2524",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا الحسين بن محمد الذارع، قال حدثنا يزيد، - وهو ابن زريع - قال حدثنا شعبة، ‏.‏ قال وأنبأنا إسماعيل بن مسعود، قال حدثنا بشر، - وهو ابن المفضل - قال حدثنا شعبة، - واللفظ لبشر - عن قتادة، عن أبي المليح، عن أبيه، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن الله عز وجل لا يقبل صلاة بغير طهور ولا صدقة من غلول ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Al-Malib that his father said:                     \"I heard the Messenger of Allah say: 'Allah, the Mighty and Sublime, does not accept prayer without purification or charity from Ghulul.\"",
      "chain": [
        "34059",
        "20304",
        "34033",
        "20212",
        "11019",
        "11453",
        "4001"
      ]
    },
    {
      "hadith_no": "4253",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of al-Fara' and al-'Atirah - كتاب الفرع والعتيرة",
      "chapter_no": "41",
      "text_ar": "أخبرنا عبيد الله بن سعيد، عن يحيى، عن ابن أبي عروبة، عن قتادة، عن أبي المليح، عن أبيه، أن النبي صلى الله عليه وسلم نهى عن جلود السباع ‏.‏",
      "text_en": " It was narrated from Abu Al-Malih, from his father, that:                     the Prophet forbade (the use of) the hides of Predators. (Hassan)",
      "chain": [
        "30359",
        "20031",
        "11073",
        "11019",
        "11453",
        "4001"
      ]
    }
  ],
  "total_hadiths": 10
}