{
  "id": "4018",
  "name": "Umm al-Husayn al-Ahmasiyya ( أم الحصين الأحمسية ( رضي الله عنها",
  "full_name": "Umm al-Husayn al-Ahmasiyya ( أم الحصين الأحمسية ( رضي الله عنها",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Medina",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ م  4  -  صحابي ]"
    ],
    "tags": [
      "Female",
      "al-Ahmas",
      "Farewell Hajj"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "4019",
      "name": "Husayn bin Umm al-Husayn ( حصين بن أم الحصين الأحمسية ( رضي الله عنه",
      "grade": "Comp.(RA)"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "students": [
    {
      "id": "10808",
      "name": "al-Yzar bin Hryth al-Bdy al-Kwfy العيزار بن حريث",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "id": "jami-al-tirmidhi-1706",
      "hadith_no": "1706",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Jihad - كتاب الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن يحيى النيسابوري، حدثنا محمد بن يوسف، حدثنا يونس بن أبي إسحاق، عن العيزار بن حريث، عن أم الحصين الأحمسية، قالت سمعت رسول الله صلى الله عليه وسلم يخطب في حجة الوداع وعليه برد قد التفع به من تحت إبطه قالت فأنا أنظر إلى عضلة عضده ترتج سمعته يقول ‏\"‏ يا أيها الناس اتقوا الله وإن أمر عليكم عبد حبشي مجدع فاسمعوا له وأطيعوا ما أقام لكم كتاب الله ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن أبي هريرة وعرباض بن سارية ‏.‏ وهذا حديث حسن صحيح وقد روي من غير وجه عن أم حصين ‏.‏",
      "text_en": " Narrated Umm Al-Husain Al-Ahmasiyyah:                     I heard the Messenger of Allah (ﷺ) delivering Khutbah during the farewell Hajj, and he was wearing a Burd which he had wrapped from under his armpit.\" She said: \"I was look at muscle of his upper arm quivering and I heard him saying: O you people! Have Taqwa of Allah. If a mutilated Ethiopian slave is put in command over you, then listen to him and obey him, as long as he upholds the Book of Allah among you.'\"[Abu 'Eisa said:] There are narrations on this topic from Abu Hurairah and 'Irbad bin Sariyah. This Hadith is Hasan Sahih, it has been reported through other routes from Umm Husain.",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "30388",
        "10846",
        "10808",
        "4018"
      ]
    }
  ],
  "total_hadiths": 1
}