{
  "id": "402",
  "name": "Abu Mas'ud al-Badri ( أبو مسعود الأنصاري البدري ,عقبة بن عمر ( رضي الله عنه",
  "full_name": "Abu Mas'ud al-Badri ( أبو مسعود الأنصاري البدري ,عقبة بن عمر ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medinah"
    },
    "death": {
      "date_hijri": "40",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Madinah/Kufa",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina",
      "Kufa"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ ع  -  صحابي ]"
    ],
    "tags": [
      "Ansar",
      "Khazraj",
      "B.al-Harith B.al-Khazraj",
      "B.Jadara",
      "Aqaba 2",
      "Uhud",
      "Khandaq"
    ]
  },
  "parents": [],
  "spouses": [
    {
      "id": "1664",
      "name": "Huzayla bint Thabit bin Tha'laba ( هزيلة بنت ثابت بن ثعلبة ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "1659",
      "name": "Umm al-Hakam bint 'Abdur Rahman ( أم الحكم بنت عبد الرحمن بن مسعود ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "siblings": [],
  "children": [
    {
      "id": "1615",
      "name": "Basheer bin Abi Mas'ud ( بشير بن أبي مسعود ( رضي الله عنه",
      "grade": "Comp.(RA)"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "students": [
    {
      "id": "1945",
      "name": "'Abdullah bin Yazid bin Zayd ( عبد الله بن يزيد بن زيد الخطمي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11353",
      "name": "Shaqayq bin Salmah al-Asadi شقيق بن سلمة الأسدي أبو وائل الكوفي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11017",
      "name": "'Alqama bin Qays علقمة بن قيس بن عبد الله",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11046",
      "name": "Qays bin Abi Hazim قيس بن أبي حازم",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11055",
      "name": "'Abdur Rahman bin Yazid al-Nakha'i عبد الرحمن بن يزيد النخعي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11405",
      "name": "Yazid bin Sharayk bin Tariq يزيد بن شريك بن طارق التيمي الكوفي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "10805",
      "name": "'Auf bin Malik bin Nadlah عوف بن مالك بن نضلة - أبو الأحوص",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10744",
      "name": "Aws bin Dm'j أوس بن ضمعج",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11003",
      "name": "Abu Bakr bin 'Abdur Rahman أبو بكر بن عبد الرحمن بن الحارث بن هشام",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "55",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا حجاج بن منهال، قال حدثنا شعبة، قال أخبرني عدي بن ثابت، قال سمعت عبد الله بن يزيد، عن أبي مسعود، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا أنفق الرجل على أهله يحتسبها فهو له صدقة ‏\"‏‏.‏",
      "text_en": "      Narrated Abu Mas'ud:                          The Prophet said, \"If a man spends on his family (with the intention      of having a reward from Allah) sincerely for Allah's sake then it is a     (kind of) alms-giving in reward for him.",
      "chain": [
        "20219",
        "20020",
        "11372",
        "1945",
        "402"
      ]
    },
    {
      "hadith_no": "90",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن كثير، قال أخبرنا سفيان، عن ابن أبي خالد، عن قيس بن أبي حازم، عن أبي مسعود الأنصاري، قال قال رجل يا رسول الله، لا أكاد أدرك الصلاة مما يطول بنا فلان، فما رأيت النبي صلى الله عليه وسلم في موعظة أشد غضبا من يومئذ فقال ‏\"‏ أيها الناس، إنكم منفرون، فمن صلى بالناس فليخفف، فإن فيهم المريض والضعيف وذا الحاجة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Mas`ud Al-Ansari:                     Once a man said to Allah's Apostle \"O Allah's Apostle! I may not attend the (compulsory congregational) prayer because so and so (the Imam) prolongs the prayer when he leads us for it. The narrator added: \"I never saw the Prophet more furious in giving advice than he was on that day. The Prophet said, \"O people! Some of you make others dislike good deeds (the prayers). So whoever leads the people in prayer should shorten it because among them there are the sick the weak and the needy (having some jobs to do).",
      "chain": [
        "28531",
        "20012",
        "11418",
        "11046",
        "402"
      ]
    },
    {
      "hadith_no": "702",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أحمد بن يونس، قال حدثنا زهير، قال حدثنا إسماعيل، قال سمعت قيسا، قال أخبرني أبو مسعود، أن رجلا، قال والله يا رسول الله إني لأتأخر عن صلاة الغداة من أجل فلان مما يطيل بنا‏.‏ فما رأيت رسول الله صلى الله عليه وسلم في موعظة أشد غضبا منه يومئذ ثم قال ‏\"‏ إن منكم منفرين، فأيكم ما صلى بالناس فليتجوز، فإن فيهم الضعيف والكبير وذا الحاجة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Mas`ud:                     A man came and said, \"O Allah's Apostle! By Allah, I keep away from the morning prayer only because So and so prolongs the prayer when he leads us in it.\" The narrator said, \"I never saw Allah's Apostle more furious in giving advice than he was at that time. He then said, \"Some of you make people dislike good deeds (the prayer). So whoever among you leads the people in prayer should shorten it because among them are the weak, the old and the needy.\"",
      "chain": [
        "30184",
        "20321",
        "20208",
        "11046",
        "402"
      ]
    },
    {
      "hadith_no": "704",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن إسماعيل بن أبي خالد، عن قيس بن أبي حازم، عن أبي مسعود، قال قال رجل يا رسول الله إني لأتأخر عن الصلاة في الفجر مما يطيل بنا فلان فيها‏.‏ فغضب رسول الله صلى الله عليه وسلم ما رأيته غضب في موضع كان أشد غضبا منه يومئذ ثم قال ‏\"‏ يا أيها الناس إن منكم منفرين، فمن أم الناس فليتجوز، فإن خلفه الضعيف والكبير وذا الحاجة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Mas`ud:                     A man came and said, \"O Allah's Apostle! I keep away from the morning prayer because so-and-so (Imam) prolongs it too much.\" Allah's Apostle became furious and I had never seen him more furious than he was on that day. The Prophet said, \"O people! Some of you make others dislike the prayer, so whoever becomes an Imam he should shorten the prayer, as behind him are the weak, the old and the needy.''",
      "chain": [
        "30388",
        "20005",
        "11418",
        "11046",
        "402"
      ]
    },
    {
      "hadith_no": "1041",
      "source": " Sahih Bukhari ",
      "chapter": "Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "حدثنا شهاب بن عباد، حدثنا إبراهيم بن حميد، عن إسماعيل، عن قيس، قال سمعت أبا مسعود، يقول قال النبي صلى الله عليه وسلم ‏\"‏ إن الشمس والقمر لا ينكسفان لموت أحد من الناس، ولكنهما آيتان من آيات الله، فإذا رأيتموهما فقوموا فصلوا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Mas`ud:                     The Prophet said, \"The sun and the moon do not eclipse because of the death of someone from the people but they are two signs amongst the signs of Allah. When you see them stand up and pray.\"",
      "chain": [
        "30196",
        "20308",
        "11418",
        "11046",
        "402"
      ]
    },
    {
      "hadith_no": "1057",
      "source": " Sahih Bukhari ",
      "chapter": "Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "حدثنا مسدد، قال حدثنا يحيى، عن إسماعيل، قال حدثني قيس، عن أبي مسعود، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الشمس والقمر لا ينكسفان لموت أحد ولا لحياته، ولكنهما آيتان من آيات الله، فإذا رأيتموهما فصلوا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Mas`ud:                     Allah's Apostle said, \"The sun and the moon do not eclipse because of someone's death or life but they are two signs amongst the signs of Allah, so pray whenever you see them.\"",
      "chain": [
        "30175",
        "20031",
        "11418",
        "11046",
        "402"
      ]
    },
    {
      "hadith_no": "1436",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا عبيد الله بن سعيد، حدثنا أبو النعمان الحكم  هو ابن عبد الله البصري  حدثنا شعبة، عن سليمان، عن أبي وائل، عن أبي مسعود  رضى الله عنه  قال لما نزلت آية الصدقة كنا نحامل، فجاء رجل فتصدق بشىء كثير فقالوا مرائي‏.‏ وجاء رجل فتصدق بصاع فقالوا إن الله لغني عن صاع هذا‏.‏ فنزلت ‏{‏الذين يلمزون المطوعين من المؤمنين في الصدقات والذين لا يجدون إلا جهدهم‏}‏ الآية‏.‏",
      "text_en": " Narrated Abu Mas`ud:                     When the verses of charity were revealed, we used to work as porters. A man came and distributed objects of charity in abundance. And they (the people) said, \"He is showing off.\" And another man came and gave a Sa (a small measure of food grains); they said, \"Allah is not in need of this small amount of charity.\" And then the Divine Inspiration came: \"Those who criticize such of the believers who give in charity voluntarily and those who could not find to give in charity except what is available to them.\" (9.79).",
      "chain": [
        "30359",
        "20020",
        "11060",
        "11353",
        "402"
      ]
    },
    {
      "hadith_no": "1437",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا سعيد بن يحيى، حدثنا أبي، حدثنا الأعمش، عن شقيق، عن أبي مسعود الأنصاري  رضى الله عنه  قال كان رسول الله صلى الله عليه وسلم إذا أمرنا بالصدقة انطلق أحدنا إلى السوق فتحامل فيصيب المد، وإن لبعضهم اليوم لمائة ألف‏.‏",
      "text_en": " Narrated Abu Mas`ud Al-Ansari:                     Whenever Allah's Apostle (p.b.u.h) ordered us to give in charity, we used to go to the market and work as porters and get a Mudd (a special measure of grain) and then give it in charity. (Those were the days of poverty) and today some of us have one hundred thousand.",
      "chain": [
        "30254",
        "20367",
        "11060",
        "11353",
        "402"
      ]
    },
    {
      "hadith_no": "2081",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، قال حدثني شقيق، عن أبي مسعود، قال جاء رجل من الأنصار يكنى أبا شعيب فقال لغلام له قصاب اجعل لي طعاما يكفي خمسة، فإني أريد أن أدعو النبي صلى الله عليه وسلم خامس خمسة، فإني قد عرفت في وجهه الجوع‏.‏ فدعاهم، فجاء معهم رجل فقال النبي صلى الله عليه وسلم ‏\"‏ إن هذا قد تبعنا، فإن شئت أن تأذن له فأذن له، وإن شئت أن يرجع رجع ‏\"‏‏.‏ فقال لا، بل قد أذنت له‏.‏",
      "text_en": " Narrated Abu Mas`ud:                     An Ansari man, called Abu Shu'aib, came and told his butcher slave, \"Prepare meals sufficient for five persons, for I want to invite the Prophet along with four other persons as I saw signs of hunger on his face.\" Abu Shu'aib invited them and another person came along with them. The Prophet said (to Abu Shu'aib), This man followed us, so if you allow him, he will join us, and if you want him to return, he will go back.\" Abu Shu'aib said, \"No, I have allowed him (i.e. he, too, is welcomed to the meal).",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11353",
        "402"
      ]
    },
    {
      "hadith_no": "2237",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن ابن شهاب، عن أبي بكر بن عبد الرحمن، عن أبي مسعود الأنصاري  رضى الله عنه أن رسول الله صلى الله عليه وسلم نهى عن ثمن الكلب ومهر البغي وحلوان الكاهن‏.‏",
      "text_en": " Narrated Abu Mas`ud Al-Ansari:                     Allah's Apostle forbade taking the price of a dog, money earned by prostitution and the earnings of a soothsayer.",
      "chain": [
        "30355",
        "20001",
        "11013",
        "11003",
        "402"
      ]
    },
    {
      "hadith_no": "2273",
      "source": " Sahih Bukhari ",
      "chapter": "Hiring - كتاب الإجارة",
      "chapter_no": "37",
      "text_ar": "حدثنا سعيد بن يحيى بن سعيد، حدثنا أبي، حدثنا الأعمش، عن شقيق، عن أبي مسعود الأنصاري  رضى الله عنه  قال كان رسول الله صلى الله عليه وسلم إذا أمر بالصدقة انطلق أحدنا إلى السوق فيحامل فيصيب المد، وإن لبعضهم لمائة ألف، قال ما نراه إلا نفسه‏.‏",
      "text_en": " Narrated Abu May' id Al-Ansari:                     Whenever Allah's Apostle ordered us to give in charity we would go to the market and work as porters to earn a Mudd (two handfuls) (of foodstuff) but now some of us have one-hundred thousand Dirhams or Diners. (The sub-narrator) Shaqiq said, \"I think Abu Mas`ud meant himself by saying (some of us) .",
      "chain": [
        "30254",
        "20367",
        "11060",
        "11353",
        "402"
      ]
    },
    {
      "hadith_no": "2282",
      "source": " Sahih Bukhari ",
      "chapter": "Hiring - كتاب الإجارة",
      "chapter_no": "37",
      "text_ar": "حدثنا قتيبة بن سعيد، عن مالك، عن ابن شهاب، عن أبي بكر بن عبد الرحمن بن الحارث بن هشام، عن أبي مسعود الأنصاري  رضى الله عنه  أن رسول الله صلى الله عليه وسلم نهى عن ثمن الكلب ومهر البغي وحلوان الكاهن‏.‏",
      "text_en": " Narrated Abu Mas`ud Al-Ansari:                     Allah's Apostle regarded illegal the price of a dog, the earnings of a prostitute, and the charges taken by a soothsayer.",
      "chain": [
        "30367",
        "20001",
        "11013",
        "11003",
        "402"
      ]
    },
    {
      "hadith_no": "2456",
      "source": " Sahih Bukhari ",
      "chapter": "Oppressions - كتاب المظالم",
      "chapter_no": "46",
      "text_ar": "حدثنا أبو النعمان، حدثنا أبو عوانة، عن الأعمش، عن أبي وائل، عن أبي مسعود، أن رجلا، من الأنصار يقال له أبو شعيب كان له غلام لحام فقال له أبو شعيب اصنع لي طعام خمسة لعلي أدعو النبي صلى الله عليه وسلم خامس خمسة‏.‏ وأبصر في وجه النبي صلى الله عليه وسلم الجوع  فدعاه، فتبعهم رجل لم يدع فقال النبي صلى الله عليه وسلم ‏\"‏ إن هذا قد اتبعنا أتأذن له ‏\"‏‏.‏ قال نعم‏.‏",
      "text_en": " Narrated Abu Mas`ud:                     There was an Ansari man called Abu Shu'aib who had a slave butcher. Abu Shu'aib said to him, \"Prepare a meal sufficient for five persons so that I might invite the Prophet besides other four persons.\" Abu Shu'aib had seen the signs of hunger on the face of the Prophet and so he invited him. Another man who was not invited, followed the Prophet. The Prophet said to Abu Shu'aib, \"This man has followed us. Do you allow him to share the meal?\" Abu Shu'aib said, \"Yes.\"",
      "chain": [
        "20283",
        "20469",
        "11060",
        "11353",
        "402"
      ]
    },
    {
      "hadith_no": "3204",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثني محمد بن المثنى، حدثنا يحيى، عن إسماعيل، قال حدثني قيس، عن أبي مسعود  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ الشمس والقمر لا ينكسفان لموت أحد ولا لحياته، ولكنهما آيتان من آيات الله، فإذا رأيتموهما فصلوا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Mas`ud:                     The Prophet said, \"the sun and the moon do not eclipse because of the death or life of someone, but they are two signs amongst the Signs of Allah. So, if you see them, offer the Prayer (of eclipse).",
      "chain": [
        "30170",
        "20031",
        "11418",
        "11046",
        "402"
      ]
    },
    {
      "hadith_no": "3483",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا أحمد بن يونس، عن زهير، حدثنا منصور، عن ربعي بن حراش، حدثنا أبو مسعود، عقبة قال قال النبي صلى الله عليه وسلم ‏\"‏ إن مما أدرك الناس من كلام النبوة، إذا لم تستحي فافعل ما شئت ‏\"‏‏.‏",
      "text_en": " Narrated Abu Masud `Uqba:                     The Prophet said, \"One of the sayings of the prophets which the people have got, is. 'If you do not feel ashamed, then do whatever you like.\"",
      "chain": [
        "30184",
        "20321",
        "11067",
        "11334",
        "402"
      ]
    },
    {
      "hadith_no": "3484",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا آدم، حدثنا شعبة، عن منصور، قال سمعت ربعي بن حراش، يحدث عن أبي مسعود، قال النبي صلى الله عليه وسلم ‏\"‏ إن مما أدرك الناس من كلام النبوة إذا لم تستحي فاصنع ما شئت ‏\"‏‏.‏",
      "text_en": " Narrated Abu Mus'ud:                     The Prophet said, \"One of the sayings of the prophets which the people have got is, 'If you do not feel ashamed, then do whatever you like.\"",
      "chain": [
        "20404",
        "20020",
        "11067",
        "11334",
        "402"
      ]
    },
    {
      "hadith_no": "4058",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا موسى، حدثنا أبو عوانة، عن الأعمش، عن إبراهيم، عن عبد الرحمن بن يزيد، عن علقمة، عن أبي مسعود البدري  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الآيتان من آخر سورة البقرة من قرأهما في ليلة كفتاه ‏\"‏‏.‏ قال عبد الرحمن فلقيت أبا مسعود وهو يطوف بالبيت، فسألته فحدثنيه‏.‏",
      "text_en": " Narrated Abu Masud Al-Badri:                     Allah's Apostle said, \"It is sufficient for one to recite the last two Verses of Surat-al-Baqara at night.\"",
      "chain": [
        "20040",
        "20469",
        "11060",
        "11051",
        "11055",
        "11017",
        "402"
      ]
    },
    {
      "hadith_no": "4430",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني عبد الله بن محمد الجعفي، حدثنا وهب بن جرير، حدثنا شعبة، عن إسماعيل بن أبي خالد، عن قيس بن أبي حازم، عن أبي مسعود، أن النبي صلى الله عليه وسلم قال ‏\"‏ الإيمان ها هنا ‏\"‏‏.‏ وأشار بيده إلى اليمن ‏\"‏ والجفاء وغلظ القلوب في الفدادين، عند أصول أذناب الإبل من حيث يطلع قرنا الشيطان ربيعة ومضر ‏\"‏‏.‏",
      "text_en": " Narrated Abu Masud:                     The Prophet beckoned with his hand towards Yemen and said, \"Belief is there.\" The harshness and mercilessness are the qualities of those farmers etc, who are busy with their camels and pay no attention to the religion (is towards the east) from where the side of the head of Satan will appear; those are the tribes of Rabi`a and Mudar.",
      "chain": [
        "30351",
        "20298",
        "20020",
        "11418",
        "11046",
        "402"
      ]
    },
    {
      "hadith_no": "4714",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني بشر بن خالد أبو محمد، أخبرنا محمد بن جعفر، عن شعبة، عن سليمان، عن أبي وائل، عن أبي مسعود، قال لما أمرنا بالصدقة كنا نتحامل فجاء أبو عقيل بنصف صاع، وجاء إنسان بأكثر منه، فقال المنافقون إن الله لغني عن صدقة هذا، وما فعل هذا الآخر إلا رئاء‏.‏ فنزلت ‏{‏الذين يلمزون المطوعين من المؤمنين في الصدقات والذين لا يجدون إلا جهدهم‏}‏ الآية‏.‏",
      "text_en": " Narrated Abu Musud:                     When we were ordered to give alms, we began to work as porters (to earn something we could give in charity). Abu Uqail came with one half of a Sa (special measure for food grains) and another person brought more than he did. So the hypocrites said, \"Allah is not in need of the alms of this (i.e. 'Uqail); and this other person did not give alms but for showing off.\" Then Allah revealed:-- 'Those who criticize such of the Believers who give charity voluntarily and those who could not find to give in charity except what is available to them.' (9.79)",
      "chain": [
        "30126",
        "20173",
        "20020",
        "11060",
        "11353",
        "402",
        "30343"
      ]
    },
    {
      "hadith_no": "4715",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا إسحاق بن إبراهيم، قال قلت لأبي أسامة أحدثكم زائدة عن سليمان عن شقيق عن أبي مسعود الأنصاري قال كان رسول الله صلى الله عليه وسلم يأمر بالصدقة، فيحتال أحدنا حتى يجيء بالمد، وإن لأحدهم اليوم مائة ألف‏.‏ كأنه يعرض بنفسه‏.‏",
      "text_en": " Narrated Shaqiq:                     Abu Mas`ud Al-Ansari said, \"Allah's Apostle, used to order us to give alms. So one of us would exert himself to earn one Mud (special measure of wheat or dates, etc.,) to give in charity; while today one of us may have one hundred thousand.\" Shaqiq said: As if Abu Masud referred to himself.",
      "chain": [
        "30123",
        "20160",
        "11353",
        "402"
      ]
    },
    {
      "hadith_no": "5060",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا شعبة، عن سليمان، عن إبراهيم، عن عبد الرحمن، عن أبي مسعود، عن النبي صلى الله عليه وسلم قال من قرأ بالآيتين‏.‏ ‏.‏‏.‏ ‏.‏",
      "text_en": "",
      "chain": [
        "28531",
        "20020",
        "20160",
        "11051",
        "10530",
        "402"
      ]
    },
    {
      "hadith_no": "5061",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا أبو نعيم، حدثنا سفيان، عن منصور، عن إبراهيم، عن عبد الرحمن بن يزيد، عن أبي مسعود  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ من قرأ بالآيتين من آخر سورة البقرة في ليلة كفتاه‏\"‏‏.‏",
      "text_en": "     Narrated Abu Mas'ud:                       The Prophet said, \"If somebody recited the last two Verses of Surat Al-Baqara at night, that will be sufficient for him.\"",
      "chain": [
        "20348",
        "20012",
        "11067",
        "11051",
        "20395",
        "402"
      ]
    },
    {
      "hadith_no": "5094",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، قال حدثني إبراهيم، عن علقمة، وعبد الرحمن بن يزيد، عن أبي مسعود الأنصاري، قال قال النبي صلى الله عليه وسلم ‏\"‏ الآيتان من آخر سورة البقرة من قرأ بهما في ليلة كفتاه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Mas`ud Al-Ansari:                     The Prophet said, \"If one recites the last two Verses of Surat-al-Baqara at night, it is sufficient for him (for that night).",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11051",
        "11017",
        "20395",
        "402"
      ]
    },
    {
      "hadith_no": "5106",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "قال علي قال سفيان أخبرنا منصور، عن إبراهيم، عن عبد الرحمن بن يزيد، أخبره علقمة، عن أبي مسعود، ولقيته، وهو يطوف بالبيت فذكر قول النبي صلى الله عليه وسلم ‏\"‏ أن من قرأ بالآيتين من آخر سورة البقرة في ليلة كفتاه ‏\"‏‏.‏",
      "text_en": "     Narrated Abu Mas'ud:                      The Prophet said, \"If somebody recites the last two Verses of Surat al-Baqara at night, it will be sufficient for him.",
      "chain": [
        "5",
        "20005",
        "11067",
        "11051",
        "11055",
        "11017",
        "402"
      ]
    },
    {
      "hadith_no": "5360",
      "source": " Sahih Bukhari ",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا يحيى بن سعيد، عن إسماعيل، عن قيس، عن أبي مسعود، قال وأشار النبي صلى الله عليه وسلم بيده نحو اليمن ‏\"‏ الإيمان ها هنا  مرتين  ألا وإن القسوة وغلظ القلوب في الفدادين حيث يطلع قرنا الشيطان ربيعة ومضر ‏\"‏‏.‏",
      "text_en": " Narrated Abu Masud:                     The Prophet pointed with his hand towards Yemen and said twice, \"Faith is there,\" and then pointed towards the East, and said, \"Verily, sternness and mercilessness are the qualities of those who are busy with their camels and pay no attention to their religion, where the two sides of the head of Satan will appear,\" namely, the tribes of Rabl'a and Muqar.",
      "chain": [
        "30170",
        "20031",
        "11418",
        "11046",
        "402"
      ]
    },
    {
      "hadith_no": "5400",
      "source": " Sahih Bukhari ",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، عن الزهري، عن أبي بكر بن عبد الرحمن، عن أبي مسعود  رضى الله عنه  قال نهى النبي صلى الله عليه وسلم عن ثمن الكلب، وحلوان الكاهن، ومهر البغي‏.‏",
      "text_en": " Narrated Abu Mas`ud:                     The Prophet prohibited taking the price of a dog, the earnings of a soothsayer and the money earned by prostitution.",
      "chain": [
        "30026",
        "20005",
        "11013",
        "11003",
        "402"
      ]
    },
    {
      "hadith_no": "5405",
      "source": " Sahih Bukhari ",
      "chapter": "Supporting the Family - كتاب النفقات",
      "chapter_no": "69",
      "text_ar": "حدثنا آدم بن أبي إياس، حدثنا شعبة، عن عدي بن ثابت، قال سمعت عبد الله بن يزيد الأنصاري، عن أبي مسعود الأنصاري، فقلت عن النبي فقال عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا أنفق المسلم نفقة على أهله وهو يحتسبها، كانت له صدقة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Mas`ud Al-Ansari:                     The Prophet said, \"When a Muslim spends something on his family intending to receive Allah's reward it is regarded as Sadaqa for him.\"",
      "chain": [
        "20404",
        "20020",
        "11372",
        "402"
      ]
    },
    {
      "hadith_no": "5489",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن الأعمش، عن أبي وائل، عن أبي مسعود الأنصاري، قال كان من الأنصار رجل يقال له أبو شعيب، وكان له غلام لحام فقال اصنع لي طعاما أدعو رسول الله صلى الله عليه وسلم خامس خمسة، فدعا رسول الله صلى الله عليه وسلم خامس خمسة، فتبعهم رجل فقال النبي صلى الله عليه وسلم ‏\"‏ إنك دعوتنا خامس خمسة وهذا رجل قد تبعنا، فإن شئت أذنت له، وإن شئت تركته ‏\"‏‏.‏ قال بل أذنت له‏.‏",
      "text_en": " Narrated Abu Mas`ud Al-Ansari:                     There was a man called Abu Shu'aib, and he had a slave who was a butcher. He said (to his slave), \"Prepare a meal to which I may invite Allah's Apostle along with four other men.\" So he invited Allah's Apostle and four other men, but another man followed them whereupon the Prophet said, \"You have invited me as one of five guests, but now another man has followed us. If you wish you can admit him, and if you wish you can refuse him.\" On that the host said, \"But I admit him.\" Narrated Muhammad bin Isma`il: If guests are sitting at a dining table, they do not have the right to carry food from other tables to theirs, but they can pass on food from their own table to each other; otherwise they should leave it.",
      "chain": [
        "30388",
        "20005",
        "11060",
        "11353",
        "402"
      ]
    },
    {
      "hadith_no": "5820",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا ابن عيينة، عن الزهري، عن أبي بكر بن عبد الرحمن بن الحارث، عن أبي مسعود، قال نهى النبي صلى الله عليه وسلم عن ثمن الكلب، ومهر البغي، وحلوان الكاهن‏.‏",
      "text_en": " Narrated Abu Mas`ud:                     The Prophet forbade the utilization of the price of a dog, the earnings of prostitute and the earnings of a foreteller.",
      "chain": [
        "30351",
        "20005",
        "11013",
        "11003",
        "402"
      ]
    },
    {
      "hadith_no": "6178",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن إسماعيل بن أبي خالد، حدثنا قيس بن أبي حازم، عن أبي مسعود  رضى الله عنه  قال أتى رجل النبي صلى الله عليه وسلم فقال إني لأتأخر عن صلاة الغداة من أجل فلان مما يطيل بنا قال فما رأيت رسول الله صلى الله عليه وسلم قط أشد غضبا في موعظة منه يومئذ قال فقال ‏\"‏ يا أيها الناس إن منكم منفرين، فأيكم ما صلى بالناس فليتجوز، فإن فيهم المريض والكبير وذا الحاجة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Mas`ud:                     A man came to the Prophet and said \"I keep away from the morning prayer only because such and such person prolongs the prayer when he leads us in it. The narrator added: I had never seen Allah's Apostle more furious in giving advice than he was on that day. He said, \"O people! There are some among you who make others dislike good deeds) cause the others to have aversion (to congregational prayers). Beware! Whoever among you leads the people in prayer should not prolong it, because among them there are the sick, the old, and the needy.\" (See Hadith No. 670, Vol 1)",
      "chain": [
        "30175",
        "20031",
        "11418",
        "11046",
        "402"
      ]
    },
    {
      "hadith_no": "6188",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زهير، حدثنا منصور، عن ربعي بن حراش، حدثنا أبو مسعود، قال قال النبي صلى الله عليه وسلم ‏\"‏ إن مما أدرك الناس من كلام النبوة الأولى إذا لم تستحي فاصنع ما شئت ‏\"‏‏.‏",
      "text_en": " Narrated Abu Mas`ud:                     The Prophet said, 'One of the sayings of the early Prophets which the people have got is: If you don't feel ashamed (from Haya': pious shyness from committing religeous indiscretions) do whatever you like.\" (See Hadith No 690, 691, Vol 4)",
      "chain": [
        "30184",
        "20321",
        "11067",
        "11334",
        "402"
      ]
    },
    {
      "hadith_no": "7247",
      "source": " Sahih Bukhari ",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثنا محمد بن مقاتل، أخبرنا عبد الله، أخبرنا إسماعيل بن أبي خالد، عن قيس بن أبي حازم، عن أبي مسعود الأنصاري، قال جاء رجل إلى رسول الله صلى الله عليه وسلم فقال يا رسول الله، إني والله لأتأخر عن صلاة الغداة من أجل فلان، مما يطيل بنا فيها‏.‏ قال فما رأيت النبي صلى الله عليه وسلم قط أشد غضبا في موعظة منه يومئذ، ثم قال ‏\"‏ يا أيها الناس، إن منكم منفرين، فأيكم ما صلى بالناس فليوجز، فإن فيهم الكبير والضعيف وذا الحاجة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Mas`ud Al-Ansari:                     A man came to Allah's Apostle and said, \"O Allah's Apostle! By Allah, I fail to attend the morning congregational prayer because so-and-so (i.e., Mu`adh bin Jabal) prolongs the prayer when he leads us for it.\" I had never seen the Prophet more furious in giving advice than he was on that day. He then said, \"O people! some of you make others dislike (good deeds, i.e. prayers etc). So whoever among you leads the people in prayer, he should shorten it because among them there are the old, the weak and the busy (needy having some jobs to do). (See Hadith No. 90, Vol. 1)",
      "chain": [
        "30118",
        "20025",
        "11418",
        "11046",
        "402"
      ]
    },
    {
      "hadith_no": "190",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، ح وحدثنا ابن نمير، حدثنا أبي ح، وحدثنا أبو كريب، حدثنا ابن إدريس، كلهم عن إسماعيل بن أبي خالد، ح وحدثنا يحيى بن حبيب الحارثي، - واللفظ له - حدثنا معتمر، عن إسماعيل، قال سمعت قيسا، يروي عن أبي مسعود، قال أشار النبي صلى الله عليه وسلم بيده نحو اليمن فقال ‏\"‏ ألا إن الإيمان ها هنا وإن القسوة وغلظ القلوب في الفدادين عند أصول أذناب الإبل حيث يطلع قرنا الشيطان في ربيعة ومضر ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Ibn Mas'ud that the Apostle of Allah (may peace and blessings be upon him) pointed towards Yemen with his hand and said:                      Verily Iman is towards this side, and harshness and callousness of the hearts is found amongst the rude owners of the camels who drive them behind their tails (to the direction) where emerge the two horns of Satan, they are the tribes of Rabi'a and Mudar.",
      "chain": [
        "30201",
        "20318",
        "30212",
        "20331",
        "30216",
        "11418",
        "20288",
        "11418",
        "402"
      ]
    },
    {
      "hadith_no": "405",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا يحيى بن يحيى التميمي، قال قرأت على مالك عن نعيم بن عبد الله المجمر، أن محمد بن عبد الله بن زيد الأنصاري، - وعبد الله بن زيد هو الذي كان أري النداء بالصلاة - أخبره عن أبي مسعود الأنصاري قال أتانا رسول الله صلى الله عليه وسلم ونحن في مجلس سعد بن عبادة فقال له بشير بن سعد أمرنا الله تعالى أن نصلي عليك يا رسول الله فكيف نصلي عليك قال فسكت رسول الله صلى الله عليه وسلم حتى تمنينا أنه لم يسأله ثم قال رسول الله صلى الله عليه وسلم قولوا ‏\"‏ اللهم صل على محمد وعلى آل محمد كما صليت على آل إبراهيم وبارك على محمد وعلى آل محمد كما باركت على آل إبراهيم في العالمين إنك حميد مجيد ‏.‏ والسلام كما قد علمتم ‏\"‏ ‏.‏",
      "text_en": " Abdullah b. Zaid-he who was shown the call (for prayer in a dream) narrated it on the authority of Mas'ad al-Ansiri who said:                      We were sitting in the company of Sa'id b. 'Ubida when the Messenger of Allah (may peace be upon him) came to us. Bashir b. S'ad said: Allah has commanded us to bless you. Messenger of Allah! But how should we bless you? He (the narrator) said: The Messenger of Allah (may peace be upon him) kept quiet (and we were so much perturbed over his silence) that we wished we had not asked him. The Messenger of Allah (may peace be upon him) then said: (For blessing me) say:\" 0 Allah, bless Muhammad and the members of his household as Thou didst bless the mernbers of Ibrahim's household. Grant favours to Muhammad and the members of his household as Thou didst grant favours to the members of the household of Ibrahim in the world. Thou art indeed Praiseworthy and Glorious\" ; and salutation as you know.",
      "chain": [
        "30399",
        "11225",
        "402"
      ]
    },
    {
      "hadith_no": "432",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن إدريس، وأبو معاوية ووكيع عن الأعمش، عن عمارة بن عمير التيمي، عن أبي معمر، عن أبي مسعود، قال كان رسول الله صلى الله عليه وسلم يمسح مناكبنا في الصلاة ويقول ‏\"‏ استووا ولا تختلفوا فتختلف قلوبكم ليلني منكم أولو الأحلام والنهى ثم الذين يلونهم ثم الذين يلونهم ‏\"‏ ‏.‏ قال أبو مسعود فأنتم اليوم أشد اختلافا ‏.‏",
      "text_en": " Abu Mas'ud reported:                      The Messenger of Allah (may peace he upon him) used to touch our shoulders in prayer and say: Keep straight, don't be irregular, for there would be dissension in your hearts. Let those of you who are sedate and prudent be near me, then those who are next to them, then those who are next to them. Abu Mas'ud said: Now-a-days there is much dissension amongst you.",
      "chain": [
        "30201",
        "20102",
        "11060",
        "11378",
        "11360",
        "402"
      ]
    },
    {
      "hadith_no": "466",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "وحدثنا يحيى بن يحيى، أخبرنا هشيم، عن إسماعيل بن أبي خالد، عن قيس، عن أبي مسعود الأنصاري، قال جاء رجل إلى رسول الله صلى الله عليه وسلم فقال إني لأتأخر عن صلاة الصبح من أجل فلان مما يطيل بنا ‏.‏ فما رأيت النبي صلى الله عليه وسلم غضب في موعظة قط أشد مما غضب يومئذ فقال ‏\"‏ يا أيها الناس إن منكم منفرين فأيكم أم الناس فليوجز فإن من ورائه الكبير والضعيف وذا الحاجة ‏\"‏ ‏.‏",
      "text_en": " Abu Mas'ud al-Ainsari reported:                      A person came to the Messenger of Allah (may peace be upon him) and said: I keep away from the morning prayer on account of such and such (a man), because; he keeps us so long. I never saw God's Messenger (may peace be upon him) more angry when giving an exhortation than he was that day. He said: 0 people, some of you are scaring people away. So whoever of you leads the people in prayer he must be brief, for behind him are the weak, the aged, and the people who have (argent) business to attend.",
      "chain": [
        "30399",
        "20468",
        "11418",
        "11046",
        "402"
      ]
    },
    {
      "hadith_no": "1564",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وأبو سعيد الأشج كلاهما عن أبي خالد، - قال أبو بكر حدثنا أبو خالد الأحمر، - عن الأعمش، عن إسماعيل بن رجاء، عن أوس بن ضمعج، عن أبي مسعود الأنصاري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يؤم القوم أقرؤهم لكتاب الله فإن كانوا في القراءة سواء فأعلمهم بالسنة فإن كانوا في السنة سواء فأقدمهم هجرة فإن كانوا في الهجرة سواء فأقدمهم سلما ولا يؤمن الرجل الرجل في سلطانه ولا يقعد في بيته على تكرمته إلا بإذنه ‏\"‏ ‏.‏ قال الأشج في روايته مكان سلما سنا ‏.‏",
      "text_en": " Abu Mas'ud al-Ansari reported Allah's Messenger (may peace be upon him) as saying:                      The one who is most versed in Allah's Book should act as Imam for the people, but If they are equally versed in reciting it, then the one who has most knowledge regarding Sunnah if they are equal regarding the Sunnah, then the earliest one to emigrate; it they emigrated at the same time, then the earliest one to embrace Islam. No man must lead another in prayer where (the latter) has authority, or sit in his place of honour in his house, without his permission. Ashajj in his narration used the word,\" age\" in place of\" Islam\".",
      "chain": [
        "30201",
        "30200",
        "20436",
        "20326",
        "11060",
        "10740",
        "10744",
        "402"
      ]
    },
    {
      "hadith_no": "1566",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا محمد بن المثنى، وابن، بشار قال ابن المثنى حدثنا محمد بن جعفر، عن شعبة، عن إسماعيل بن رجاء، قال سمعت أوس بن ضمعج، يقول سمعت أبا مسعود، يقول قال لنا رسول الله صلى الله عليه وسلم ‏\"‏ يؤم القوم أقرؤهم لكتاب الله وأقدمهم قراءة فإن كانت قراءتهم سواء فليؤمهم أقدمهم هجرة فإن كانوا في الهجرة سواء فليؤمهم أكبرهم سنا ولا تؤمن الرجل في أهله ولا في سلطانه ولا تجلس على تكرمته في بيته إلا أن يأذن لك أو بإذنه ‏\"‏ ‏.‏",
      "text_en": " Abu Mas'ud al-Ansari reported:                      The Messenger of Allah (may peace be upon him) said to us: The one who is well grounded in Allah's Book and is distinguished among them in recitation should act as; Imam for the people. and if they are equally versed in reciting it, then the one who has most knowledge regarding Sunnah; if they are equal regarding the Sunnah, then the earliest one to emigrate; If they emigrated at the same time, then the oldest one in age. No man must lead another in prayer in latter's house or where (the latter) has authority, or sit in his place of honour in his house, except that he gives you permission or with his permission.",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "10740",
        "10744",
        "402"
      ]
    },
    {
      "hadith_no": "1916",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا منجاب بن الحارث التميمي، أخبرنا ابن مسهر، عن الأعمش، عن إبراهيم، عن عبد الرحمن بن يزيد، عن علقمة بن قيس، عن أبي مسعود الأنصاري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من قرأ هاتين الآيتين من آخر سورة البقرة في ليلة كفتاه ‏\"‏ ‏.‏ قال عبد الرحمن فلقيت أبا مسعود وهو يطوف بالبيت فسألته فحدثني به عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " A hadith like this has been narrated by Abu Mas'ud from the Apostle of Allah (may peace be upon him) through another chain of transmitters.",
      "chain": [
        "30479",
        "11060",
        "11051",
        "20395",
        "11017",
        "402"
      ]
    },
    {
      "hadith_no": "1917",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني علي بن خشرم، أخبرنا عيسى يعني ابن يونس، ح وحدثنا أبو بكر، بن أبي شيبة حدثنا عبد الله بن نمير، جميعا عن الأعمش، عن إبراهيم، عن علقمة، وعبد، الرحمن بن يزيد عن أبي مسعود، عن النبي صلى الله عليه وسلم مثله ‏.‏",
      "text_en": " It is through another chain of transmitters that this hadith has been reported by Abu Mas'ud from the Apostle of Allah (may peace be upon him).",
      "chain": [
        "30556",
        "20347",
        "30201",
        "11060",
        "11051",
        "11017",
        "20395",
        "402"
      ]
    },
    {
      "hadith_no": "1918",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا حفص، وأبو معاوية عن الأعمش، عن إبراهيم، عن عبد الرحمن بن يزيد، عن أبي مسعود، عن النبي صلى الله عليه وسلم مثله ‏.‏",
      "text_en": " Abu Darda' reported Allah's Apostle (may peace be upon him) as saying:                      If anyone learns by heart the first ten verses of the Surah al-Kahf, he will be protected from the Dajjal.",
      "chain": [
        "30201",
        "20354",
        "11060",
        "11051",
        "20395",
        "402"
      ]
    },
    {
      "hadith_no": "2153",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Eclipse) - كتاب الكسوف",
      "chapter_no": "11",
      "text_ar": "وحدثنا يحيى بن يحيى، أخبرنا هشيم، عن إسماعيل، عن قيس بن أبي حازم، عن أبي مسعود الأنصاري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الشمس والقمر آيتان من آيات الله يخوف الله بهما عباده وإنهما لا ينكسفان لموت أحد من الناس فإذا رأيتم منها شيئا فصلوا وادعوا الله حتى يكشف ما بكم ‏\"‏ ‏.‏",
      "text_en": " Abu Mas'ud al-Ansari reported Allah's Messenger (may peace be upon him) as saying:                      Verily the sun and the moon are the two signs among the signs of Allah by which He frightens his servants and they do not eclipse on account of the death of any one of the people. So when you see anything about them, observe prayer, supplicate Allah till it is cleared from you.",
      "chain": [
        "30399",
        "20468",
        "11418",
        "11046",
        "402"
      ]
    },
    {
      "hadith_no": "2154",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Eclipse) - كتاب الكسوف",
      "chapter_no": "11",
      "text_ar": "وحدثنا عبيد الله بن معاذ العنبري، ويحيى بن حبيب، قالا حدثنا معتمر، عن إسماعيل، عن قيس، عن أبي مسعود، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن الشمس والقمر ليس ينكسفان لموت أحد من الناس ولكنهما آيتان من آيات الله فإذا رأيتموه فقوموا فصلوا ‏\"‏ ‏.‏",
      "text_en": " Abu Mas'ud reported that the Messenger of Allah (may peace be upon him) said:                      Verily the sun and the moon do not eclipse on account of the death of any one of the people, but they are the two signs among the signs of Allah. So when you see it, stand up and observe prayer.",
      "chain": [
        "30150",
        "20288",
        "11418",
        "11046",
        "402"
      ]
    },
    {
      "hadith_no": "2369",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، عن عدي، - وهو ابن ثابت - عن عبد الله بن يزيد، عن أبي مسعود البدري، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن المسلم إذا أنفق على أهله نفقة وهو يحتسبها كانت له صدقة ‏\"‏ ‏.‏",
      "text_en": " Abu Mas'ud reported Allah's Messenger (way peace be upon him) as saying:                      When a Muslim spends on his family seeking reward for it from Allah, it counts for him as sadaqa.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11372",
        "1945",
        "402"
      ]
    },
    {
      "hadith_no": "2402",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثني يحيى بن معين، حدثنا غندر، حدثنا شعبة، ح وحدثنيه بشر بن خالد، - واللفظ له - أخبرنا محمد، - يعني ابن جعفر - عن شعبة، عن سليمان، عن أبي وائل، عن أبي مسعود، قال أمرنا بالصدقة ‏.‏ قال كنا نحامل - قال - فتصدق أبو عقيل بنصف صاع - قال - وجاء إنسان بشىء أكثر منه فقال المنافقون إن الله لغني عن صدقة هذا وما فعل هذا الآخر إلا رياء فنزلت ‏{‏ الذين يلمزون المطوعين من المؤمنين في الصدقات والذين لا يجدون إلا جهدهم‏}‏ ولم يلفظ بشر بالمطوعين ‏.‏",
      "text_en": " Abu Mas'ud reported:                      We were commanded to give charity (despite the fact.) that we were coolies. Abu 'Aqil donated half a sa'. And there came another man with more than this. The hypocrites said: Verily Allah does not stand in need of the charity of this, and the second one has done nothing but only made a show (of his charity). Then this verse was revealed.\" Those who scoff at the voluntary givers of charity among the believers as well as those who cannot find anything (to give) but with their hard labour\" (ix. 80). And Bishr did not utter the word Muttawwi'in.",
      "chain": [
        "30020",
        "20278",
        "20020",
        "20173",
        "20020",
        "11005",
        "11353",
        "402"
      ]
    },
    {
      "hadith_no": "4080",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا يحيى بن يحيى، وأبو بكر بن أبي شيبة وأبو كريب وإسحاق بن إبراهيم - واللفظ ليحيى - قال يحيى أخبرنا وقال الآخرون، حدثنا أبو معاوية، عن الأعمش، عن شقيق، عن أبي مسعود، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ حوسب رجل ممن كان قبلكم فلم يوجد له من الخير شىء إلا أنه كان يخالط الناس وكان موسرا فكان يأمر غلمانه أن يتجاوزوا عن المعسر قال قال الله عز وجل نحن أحق بذلك منه تجاوزوا عنه ‏\"‏ ‏.‏",
      "text_en": " Abu Mas'ud (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      A person from people who lived before you was called to account (by Allah at the Day of Judgment) and no good was found in his account except this that lie being a rich man had (financial) dealings with people and had commanded his servants to show leniency to the straitened ones. Upon this Allah, the Exalted and Majestic, said: We have more right to this, so overlook (his faults).",
      "chain": [
        "30399",
        "20031",
        "20354",
        "11060",
        "11353",
        "402"
      ]
    },
    {
      "hadith_no": "4092",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن ابن شهاب، عن أبي بكر بن، عبد الرحمن عن أبي مسعود الأنصاري، أن رسول الله صلى الله عليه وسلم نهى عن ثمن الكلب ومهر البغي وحلوان الكاهن ‏\"‏ ‏.‏",
      "text_en": " Aba Mas'ud al-Ansari (Allah be pleased with him) reported that Allah's Messenger (may peace be upon him) forbade the charging of price of the dog, and earnings of a prostitute and sweets offered to a kahin.",
      "chain": [
        "30399",
        "11013",
        "11003",
        "402"
      ]
    },
    {
      "hadith_no": "4398",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "وحدثنا أبو كريب، محمد بن العلاء حدثنا أبو معاوية، حدثنا الأعمش، عن إبراهيم، التيمي عن أبيه، عن أبي مسعود الأنصاري، قال كنت أضرب غلاما لي فسمعت من خلفي صوتا ‏\"‏ اعلم أبا مسعود لله أقدر عليك منك عليه ‏\"‏ ‏.‏ فالتفت فإذا هو رسول الله صلى الله عليه وسلم فقلت يا رسول الله هو حر لوجه الله ‏.‏ فقال ‏\"‏ أما لو لم تفعل للفحتك النار أو لمستك النار ‏\"‏ ‏.‏",
      "text_en": " Abu Mas'ud al-Ansari reported:                      When I was beating my servant, I heard a voice behind me (saying): Abu Mas'ud, bear in mind Allah has more dominance over you than you have upon him. I turned and (found him) to be Allah's Messenger (may peace be upon him). I said: Allah's Messenger, I set him free for the sake of Allah. Thereupon he said: Had you not done that, (the gates of) Hell would have opened for you, or the fire would have burnt you.",
      "chain": [
        "30216",
        "20354",
        "11060",
        "11322",
        "11405",
        "402"
      ]
    },
    {
      "hadith_no": "4399",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "وحدثنا محمد بن المثنى، وابن، بشار - واللفظ لابن المثنى - قالا حدثنا ابن، أبي عدي عن شعبة، عن سليمان، عن إبراهيم التيمي، عن أبيه، عن أبي مسعود، أنه كان يضرب غلامه فجعل يقول أعوذ بالله - قال - فجعل يضربه فقال أعوذ برسول الله ‏.‏ فتركه فقال رسول الله صلى الله عليه وسلم ‏\"‏ والله لله أقدر عليك منك عليه ‏\"‏ ‏.‏ قال فأعتقه ‏.‏",
      "text_en": " Abu Mas'ud reported that he had been beating his slave and he had been saying:                      I seek refuge with Allah, but he continued beating him, whereupon he said: I seek refuge with Allah's Messenger, and he spared him. Thereupon Allah's Messenger (may peace be upon him) said: By Allah, God has more dominance over you than you have over him (the slave). He said that he set him free. This hadith has been narrated on the authority of Shu'ba with the same chain of transmitters, but made no mention of (these words) of his: I seek refuge with Allah, I seek refuge with Allah's Messenger (may peace be upon him).",
      "chain": [
        "30170",
        "20276",
        "20020",
        "11005",
        "11322",
        "11405",
        "402"
      ]
    },
    {
      "hadith_no": "5005",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا إسحاق بن إبراهيم الحنظلي، أخبرنا جرير، عن الأعمش، عن أبي عمرو، الشيباني عن أبي مسعود الأنصاري، قال جاء رجل بناقة مخطومة فقال هذه في سبيل الله ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لك بها يوم القيامة سبعمائة ناقة كلها مخطومة ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Abu Mas'ud al-Ansari who said A man brought a muzzled she-camel and said:                      It is (offered) in the way of Allah. The Messenger of Allah (may peace be upon him) said: For this you will have seven hundred she-camels on the Day of Judgment all of which will be muzzled.",
      "chain": [
        "30021",
        "20028",
        "11060",
        "11343",
        "402"
      ]
    },
    {
      "hadith_no": "5007",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وأبو كريب وابن أبي عمر - واللفظ لأبي كريب - قالوا حدثنا أبو معاوية، عن الأعمش، عن أبي عمرو الشيباني، عن أبي مسعود الأنصاري، قال جاء رجل إلى النبي صلى الله عليه وسلم فقال إني أبدع بي فاحملني فقال ‏\"‏ ما عندي ‏\"‏ ‏.‏ فقال رجل يا رسول الله أنا أدله على من يحمله فقال رسول الله صلى الله عليه وسلم ‏\"‏ من دل على خير فله مثل أجر فاعله ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Abu Mas'ud al-Ansari who said:                      A man came to the Messenger of Allah (may peace be upon him) and said: My riding beast has been killed, so give me some animal to ride upon. He (the Holy Prophet) said: I have none with me. A man said: Messenger of Allah, I can guide him to one who will provide him with a riding beast. The Messenger of Allah (may peace be upon him) said: One who guides to something good has a reward similar to that of its doer.",
      "chain": [
        "30201",
        "20354",
        "11060",
        "11343",
        "402"
      ]
    },
    {
      "hadith_no": "5429",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا قتيبة بن سعيد، وعثمان بن أبي شيبة، - وتقاربا في اللفظ - قالا حدثنا  جرير، عن الأعمش، عن أبي وائل، عن أبي مسعود الأنصاري، قال كان رجل من الأنصار يقال له أبو شعيب وكان له غلام لحام فرأى رسول الله صلى الله عليه وسلم فعرف في وجهه الجوع فقال لغلامه ويحك اصنع لنا طعاما لخمسة نفر فإني أريد أن أدعو النبي صلى الله عليه وسلم خامس خمسة ‏.‏ قال فصنع ثم أتى النبي صلى الله عليه وسلم فدعاه خامس خمسة واتبعهم رجل فلما بلغ الباب قال النبي صلى الله عليه وسلم ‏\"‏ إن هذا اتبعنا فإن شئت أن تأذن له وإن شئت رجع ‏\"‏ ‏.‏ قال لا بل آذن له يا رسول الله ‏.‏",
      "text_en": " Abu Mas'ud Ansari reported that a person from the Ansar who was called Abu Shu'aib had a slave who was a butcher (by profession). He (Abu Mas'ud) saw Allah's Messenger (may peace be upon him) and found signs of hunger on his face. He said to the servant:                      0 ye, prepare for us food sufficient for five persons, for I intend to invite Allah's Apostle (may peace be upon him) who would be the fifth amongst the five. He (the narrator) reported that he then prepared the food and came to Allah's Apostle (may peace be upon him) and invited all the five (including him) who was the fifth amongst them to the feast. A man followed him and when Allah's Apostle (may peace be upon him) reached the door, he said: This man has followed us; if you like you may permit him (to join the meal) and if you like he can go back. Thereupon the person said: Allah's Messenger, I permit him.",
      "chain": [
        "30367",
        "20028",
        "11060",
        "11353",
        "402"
      ]
    },
    {
      "hadith_no": "5432",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثني سلمة بن شبيب، حدثنا الحسن بن أعين، حدثنا زهير، حدثنا الأعمش، عن شقيق، عن أبي مسعود، عن النبي صلى الله عليه وسلم وعن الأعمش، عن أبي سفيان، عن جابر، بهذا الحديث ‏.‏",
      "text_en": "",
      "chain": [
        "30417",
        "20418",
        "20321",
        "11060",
        "11353",
        "402"
      ]
    },
    {
      "hadith_no": "582",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو الوليد الطيالسي، حدثنا شعبة، أخبرني إسماعيل بن رجاء، سمعت أوس بن ضمعج، يحدث عن أبي مسعود البدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يؤم القوم أقرؤهم لكتاب الله وأقدمهم قراءة فإن كانوا في القراءة سواء فليؤمهم أقدمهم هجرة فإن كانوا في الهجرة سواء فليؤمهم أكبرهم سنا ولا يؤم الرجل في بيته ولا في سلطانه ولا يجلس على تكرمته إلا بإذنه ‏\"‏ ‏.‏ قال شعبة فقلت لإسماعيل ما تكرمته قال فراشه ‏.‏",
      "text_en": " Abu Mas’ud al-Badri reported the Messenger of Allah (ﷺ) as saying:                      The one of you who is most versed in the Books of Allah should act as imam for the people; and the one who is the earliest of them in reciting (the Qur’an); if they are equally versed in reciting it, then the earliest of them to emigrate (to Medina); if they emigrated at the same time, then the oldest of them. No man must lead another in prayer in his house (i.e. in the house of a latter) or where the latter has authority, or sit in his place of honor without his permission. Shu’bah said: I asked Isma’il: what is the meaning of his place of honor? He replied: his throne.",
      "chain": [
        "20296",
        "20020",
        "10740",
        "10744",
        "402"
      ]
    },
    {
      "hadith_no": "584",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا الحسن بن علي، حدثنا عبد الله بن نمير، عن الأعمش، عن إسماعيل بن رجاء، عن أوس بن ضمعج الحضرمي، قال سمعت أبا مسعود، عن النبي صلى الله عليه وسلم بهذا الحديث قال ‏\"‏ فإن كانوا في القراءة سواء فأعلمهم بالسنة فإن كانوا في السنة سواء فأقدمهم هجرة ‏\"‏ ‏.‏ ولم يقل ‏\"‏ فأقدمهم قراءة ‏\"‏ ‏.‏ قال أبو داود رواه حجاج بن أرطاة عن إسماعيل قال ‏\"‏ ولا تقعد على تكرمة أحد إلا بإذنه ‏\"‏ ‏.‏",
      "text_en": " This tradition has been transmitted through a different chain by Abu Mas’ud This version has words ; “If they are equally versed in recitation, then the one who has most knowledge of the Sunnah ; if they are equal with regard to (the knowledge of) the Sunnah, then the earliest of them to emigrate (to medina)”. He did not narrate the words; “ The earliest of them in recitation”.Abu Dawud said:                      Hajjaj b. Artata reported from Isma’il: Do not sit in the place of honour of anyone except with his permission.",
      "chain": [
        "30115",
        "20331",
        "11060",
        "10740",
        "10744",
        "402"
      ]
    },
    {
      "hadith_no": "674",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا ابن كثير، أخبرني سفيان، عن الأعمش، عن عمارة بن عمير، عن أبي معمر، عن أبي مسعود، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ليلني منكم أولو الأحلام والنهى ثم الذين يلونهم ثم الذين يلونهم ‏\"‏ ‏.‏",
      "text_en": " Abu Ma’sud reported the Messenger of Allah (ﷺ) as saying:                      let those of your who are sedate and prudent be near me, then those who are next to them, then those who are next to them.",
      "chain": [
        "30169",
        "20012",
        "11060",
        "11378",
        "11360",
        "402"
      ]
    },
    {
      "hadith_no": "855",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا حفص بن عمر النمري، حدثنا شعبة، عن سليمان، عن عمارة بن عمير، عن أبي معمر، عن أبي مسعود البدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تجزئ صلاة الرجل حتى يقيم ظهره في الركوع والسجود ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuMas'ud al-Badri:                     The Prophet (ﷺ) said: A man's prayer does not avail him unless he keeps his back steady when bowing and prostrating.",
      "chain": [
        "30329",
        "20020",
        "20160",
        "11378",
        "11360",
        "402"
      ]
    },
    {
      "hadith_no": "980",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا القعنبي، عن مالك، عن نعيم بن عبد الله المجمر، أن محمد بن عبد الله بن زيد، - وعبد الله بن زيد هو الذي أري النداء بالصلاة - أخبره عن أبي مسعود الأنصاري، أنه قال أتانا رسول الله صلى الله عليه وسلم في مجلس سعد بن عبادة فقال له بشير بن سعد أمرنا الله أن نصلي عليك يا رسول الله فكيف نصلي عليك فسكت رسول الله صلى الله عليه وسلم حتى تمنينا أنه لم يسأله ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ قولوا ‏\"‏ ‏.‏ فذكر معنى حديث كعب بن عجرة زاد في آخره ‏\"‏ في العالمين إنك حميد مجيد ‏\"‏ ‏.‏",
      "text_en": " Abu Mas’ud al-Ansari said:                      The Messenger of Allah (ﷺ) came to us in a meeting of Sa’d b. ‘Ubadah. Bashir b. Sa’d said to him: Allah has commanded us to invoke blessings on you, Messenger of Allah. How should we invoke blessings on you? The Messenger of Allah (ﷺ) kept silence so much so that we wished he would not ask him. Then the Messenger of Allah (ﷺ) said: Say. He then narrated the tradition like that of Ka’b b. ‘Ujrah. This version adds in the end: In the universe, Thou art praiseworthy and glorious.",
      "chain": [
        "20164",
        "20001",
        "11225",
        "402"
      ]
    },
    {
      "hadith_no": "1730",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن الفرات، - يعني أبا مسعود الرازي - ومحمد بن عبد الله المخرمي - وهذا لفظه - قالا حدثنا شبابة، عن ورقاء، عن عمرو بن دينار، عن عكرمة، عن ابن عباس، قال كانوا يحجون ولا يتزودون - قال أبو مسعود كان أهل اليمن أو ناس من أهل اليمن يحجون ولا يتزودون - ويقولون نحن المتوكلون فأنزل الله سبحانه ‏{‏ وتزودوا فإن خير الزاد التقوى ‏}‏ الآية ‏.‏",
      "text_en": " Ibn `Abbas said :                      People used to perform Hajj and not bring provisions with them.  Abu Mas’ud said the inhabitants of Yemen or people of Yemen used to perform Hajj and not bring provisions with them.  They would declare we put our trust in Allah.  So Allah most high sent down “ and bring provisions, but the best provision is piety”.",
      "chain": [
        "20426",
        "11081",
        "11023",
        "17",
        "402"
      ]
    },
    {
      "hadith_no": "2947",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن مطرف، عن أبي الجهم، عن أبي مسعود الأنصاري، قال بعثني النبي صلى الله عليه وسلم ساعيا ثم قال ‏\"‏ انطلق أبا مسعود ولا ألفينك يوم القيامة تجيء على ظهرك بعير من إبل الصدقة له رغاء قد غللته ‏\"‏ ‏.‏ قال إذا لا أنطلق ‏.‏ قال ‏\"‏ إذا لا أكرهك ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuMas'ud al-Ansari:                     The Prophet (ﷺ) appointed me to collect sadaqah and then said: Go, AbuMas'ud, I should not find you on the Day of Judgment carrying a camel of sadaqah on your back, which rumbles, the one you have taken by unfaithful dealing in sadaqah. He said: If it is so, I will not go. He said: Then I do not force you.",
      "chain": [
        "30203",
        "20028",
        "11395",
        "402"
      ]
    },
    {
      "hadith_no": "3428",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا قتيبة، عن سفيان، عن الزهري، عن أبي بكر بن عبد الرحمن، عن أبي مسعود، عن النبي صلى الله عليه وسلم أنه نهى عن ثمن الكلب ومهر البغي وحلوان الكاهن ‏.‏",
      "text_en": " Narrated AbuMas'ud:                     The Prophet (ﷺ) forbade the price paid for a dog, the hire paid to a prostitute, and the gift given to a soothsayer.",
      "chain": [
        "30367",
        "20005",
        "11013",
        "11003",
        "402"
      ]
    },
    {
      "hadith_no": "3481",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا سفيان، عن الزهري، عن أبي بكر بن عبد الرحمن، عن أبي مسعود، عن النبي صلى الله عليه وسلم أنه نهى عن ثمن الكلب ومهر البغي وحلوان الكاهن ‏.‏",
      "text_en": " Narrated Abu Mas'ud:                     The Prophet (ﷺ) forbade the price paid for a dog, the hire paid to prostitute, and the gift given to a soothsayer.",
      "chain": [
        "30367",
        "20005",
        "11013",
        "11003",
        "402"
      ]
    },
    {
      "hadith_no": "4797",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا عبد الله بن مسلمة، حدثنا شعبة، عن منصور، عن ربعي بن حراش، عن أبي مسعود، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن مما أدرك الناس من كلام النبوة الأولى إذا لم تستح فافعل ما شئت ‏\"‏ ‏.‏",
      "text_en": " ABU MASUD REPORTED THE APOSTLE OF ALLAH (MAY PEACE BE UPON HIM) AS SAYING :                      ONE OF THE THINGS PEOPLE HAVE LEARNT FROM THE WORDS OF THE EARLIEST PROPHECY IS : IF YOU HAVE NO SHAME, DO WHAT YOU LIKE.",
      "chain": [
        "20164",
        "20020",
        "11067",
        "11334",
        "402"
      ]
    },
    {
      "hadith_no": "5129",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، عن الأعمش، عن أبي عمرو الشيباني، عن أبي مسعود الأنصاري، قال جاء رجل إلى النبي صلى الله عليه وسلم فقال يا رسول الله إني أبدع بي فاحملني ‏.‏ قال ‏\"‏ لا أجد ما أحملك عليه ولكن ائت فلانا فلعله أن يحملك ‏\"‏ ‏.‏ فأتاه فحمله فأتى رسول الله صلى الله عليه وسلم فأخبره فقال رسول الله صلى الله عليه وسلم ‏\"‏ من دل على خير فله مثل أجر فاعله ‏\"‏ ‏.‏",
      "text_en": " Abu Mas’ud al-Ansari said :                      A man came to the prophet (May peace be upon him) and said: Messenger of Allah! I have been left without a mount. So give me a mount. He replied: I have no mount to give, but go to so and so; he may perhaps give you a mount. He then went to him and he gave him a mount. He came to the Messenger of Allah (May peace be upon him) and informed him about it. Thereupon the Messenger of Allah (May peace be upon him) said: if anyone guides someone to a good (deed), he will get the reward like the reward of the one who does it.",
      "chain": [
        "28531",
        "20012",
        "11060",
        "11343",
        "402"
      ]
    },
    {
      "hadith_no": "5159",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن العلاء، قال حدثنا أبو معاوية، ح وحدثنا ابن المثنى، قال حدثنا أبو معاوية، عن الأعمش، عن إبراهيم التيمي، عن أبيه، عن أبي مسعود الأنصاري، قال كنت أضرب غلاما لي فسمعت من خلفي صوتا ‏\"‏ اعلم أبا مسعود ‏\"‏ ‏.‏ قال ابن المثنى مرتين ‏\"‏ لله أقدر عليك منك عليه ‏\"‏ ‏.‏ فالتفت فإذا هو النبي صلى الله عليه وسلم فقلت يا رسول الله هو حر لوجه الله ‏.‏ قال ‏\"‏ أما إنك لو لم تفعل للفعتك النار أو ‏\"‏ لمستك النار ‏\"‏ ‏.‏",
      "text_en": " Abu Mas’ud al-Ansari said:                      when I was beating a servant of mine, I heard a voice behind me saying: know, Abu Mas’ud-Ibn al-Muthanna said: “twice”-that Allah has more power over you than you have over him. I turned round and saw that it was that it was the prophet (May peace be upon him). I said : Messenger of Allah! He is free for Allah’s sake. He said : If you had not done it, fire would have burned you or the fire would have touched you.",
      "chain": [
        "30216",
        "20354",
        "30170",
        "20354",
        "11060",
        "11322",
        "11405",
        "402"
      ]
    },
    {
      "hadith_no": "265",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا أبو معاوية، عن الأعمش، عن عمارة بن عمير، عن أبي معمر، عن أبي مسعود الأنصاري البدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تجزئ صلاة لا يقيم فيها الرجل يعني صلبه في الركوع والسجود ‏\"‏ ‏.‏ قال وفي الباب عن علي بن شيبان وأنس وأبي هريرة ورفاعة الزرقي ‏.‏ قال أبو عيسى حديث أبي مسعود الأنصاري حديث حسن صحيح ‏.‏ والعمل على هذا عند أهل العلم من أصحاب النبي صلى الله عليه وسلم ومن بعدهم يرون أن يقيم الرجل صلبه في الركوع والسجود ‏.‏ وقال الشافعي وأحمد وإسحاق من لم يقم صلبه في الركوع والسجود فصلاته فاسدة لحديث النبي صلى الله عليه وسلم ‏\"‏ لا تجزئ صلاة لا يقيم الرجل فيها صلبه في الركوع والسجود ‏\"‏ ‏.‏ وأبو معمر اسمه عبد الله بن سخبرة ‏.‏ وأبو مسعود الأنصاري البدري اسمه عقبة بن عمرو ‏.‏",
      "text_en": " Abu Mas'ud Al-Ansari [Al-Badri] narrated that :                     Allah's Messenger said: \"The Salat is not acceptable if a man is not at rest - meaning his back - while bowing and prostrating.\"",
      "chain": [
        "30242",
        "20354",
        "11060",
        "11378",
        "11360",
        "402"
      ]
    },
    {
      "hadith_no": "1099",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Marriage - كتاب النكاح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "11",
      "text_ar": "حدثنا هناد، حدثنا أبو معاوية، عن الأعمش، عن شقيق، عن أبي مسعود، قال جاء رجل يقال له أبو شعيب إلى غلام له لحام فقال اصنع لي طعاما يكفي خمسة فإني رأيت في وجه رسول الله صلى الله عليه وسلم الجوع ‏.‏ قال فصنع طعاما ثم أرسل إلى النبي صلى الله عليه وسلم فدعاه وجلساءه الذين معه فلما قام النبي صلى الله عليه وسلم اتبعهم رجل لم يكن معهم حين دعوا فلما انتهى رسول الله صلى الله عليه وسلم إلى الباب قال لصاحب المنزل ‏\"‏ إنه اتبعنا رجل لم يكن معنا حين دعوتنا فإن أذنت له دخل ‏\"‏ ‏.‏ قال فقد أذنا له فليدخل ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ قال وفي الباب عن ابن عمر ‏.‏",
      "text_en": " Abu Mas'ud narrated:                     \"A man named Abu Shu'aib came to a slave of his, who was a butcher, and said: 'Prepare some food for me that will be sufficient for five, for I have seen hunger in the face of the Messenger of Allah.' So he prepared some food. Then he sent a message to the Prophet inviting him and those who were sitting with him. When the Prophet stood, he was followed by a man who was not with them when they were invited. When the Messenger of Allah arrive at the door he said to the owner of the house: 'A man who was not with us when you invited us followed us, if you permit him, he will enter.'\" He said: We have permitted him, let him enter.\"",
      "chain": [
        "30480",
        "20354",
        "11060",
        "11353",
        "402"
      ]
    },
    {
      "hadith_no": "1133",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Marriage - كتاب النكاح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "11",
      "text_ar": "حدثنا قتيبة، حدثنا الليث، عن ابن شهاب، عن أبي بكر بن عبد الرحمن، عن أبي مسعود الأنصاري، قال نهى رسول الله صلى الله عليه وسلم عن ثمن الكلب ومهر البغي وحلوان الكاهن ‏.‏ قال وفي الباب عن رافع بن خديج وأبي جحيفة وأبي هريرة وابن عباس ‏.‏ قال أبو عيسى حديث أبي مسعود حديث حسن صحيح ‏.‏",
      "text_en": " Abu Mas'ud Al-Ansari narrated:                     \"The Messenger of Allah prohibited the price of a dog, the dowry of a fornicator, and the payment made to the fortune-teller.\"",
      "chain": [
        "30367",
        "20023",
        "11013",
        "11003",
        "402"
      ]
    },
    {
      "hadith_no": "1276",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا قتيبة، حدثنا الليث، عن ابن شهاب، ح وحدثنا سعيد بن عبد الرحمن المخزومي، وغير، واحد، قالوا حدثنا سفيان بن عيينة، عن الزهري، عن أبي بكر بن عبد الرحمن، عن أبي مسعود الأنصاري، قال نهى رسول الله صلى الله عليه وسلم عن ثمن الكلب ومهر البغي وحلوان الكاهن ‏.‏ هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Abu Mas'ud Al-Ansari:                     \"The Messenger of Allah (ﷺ) prohibited the price of a dog, the earnings of the fornicator (from harlotry), and the news of the fortune-teller.\"This Hadith is Hasan Sahih.",
      "chain": [
        "30367",
        "20023",
        "11013",
        "38231",
        "20005",
        "11013",
        "11003",
        "402"
      ]
    },
    {
      "hadith_no": "1307",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا هناد، حدثنا أبو معاوية، عن الأعمش، عن شقيق، عن أبي مسعود، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ حوسب رجل ممن كان قبلكم فلم يوجد له من الخير شيء إلا أنه كان رجلا موسرا وكان يخالط الناس وكان يأمر غلمانه أن يتجاوزوا عن المعسر فقال الله عز وجل نحن أحق بذلك منه تجاوزوا عنه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وأبو اليسر كعب بن عمرو ‏.‏",
      "text_en": " Narrated Abu Mas'ud:                     That the Messenger of Allah (ﷺ) said: \"A man among those before you was called to reckon and nothing good was found with him. Except that he was a wealthy man so he used to mix with the pople and he would tell his servant to be lenient with the insolvent. So Allah, Mighty and Sublime is He, said: 'We are more worthy of that than him, so be lenient with him.'\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. Abu Al-Yasar is Ka'b bin 'Amr.",
      "chain": [
        "30480",
        "20354",
        "11060",
        "11353",
        "402"
      ]
    },
    {
      "hadith_no": "2074",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا مؤمل، حدثنا سفيان، عن الأعمش، عن إبراهيم التيمي، عن أبيه، عن أبي مسعود الأنصاري، قال كنت أضرب مملوكا لي فسمعت قائلا من خلفي يقول ‏\"‏ اعلم أبا مسعود اعلم أبا مسعود ‏\"‏ ‏.‏ فالتفت فإذا أنا برسول الله صلى الله عليه وسلم فقال ‏\"‏ لله أقدر عليك منك عليه ‏\"‏ ‏.‏ قال أبو مسعود فما ضربت مملوكا لي بعد ذلك ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وإبراهيم التيمي هو إبراهيم بن يزيد بن شريك ‏.‏",
      "text_en": " Abu Mas'ud [Al-Ansari] said:                     \"I was beating a slave of mine and I heard someone behind me saying: 'Beware O Abu Mas'ud! Beware O Abu Mas'ud!' So I turned around and saw that it was the Messenger of Allah. He said: 'Allah has more power over you than you do over him.\" Abu Mas'ud said: \"I have not beaten any slave of mine since then.\"",
      "chain": [
        "30277",
        "30180",
        "20012",
        "11060",
        "11322",
        "11405",
        "402"
      ]
    },
    {
      "hadith_no": "2092",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا أحمد بن محمد، أخبرنا عبد الله بن المبارك، عن شعبة، عن عدي بن ثابت، عن عبد الله بن يزيد، عن أبي مسعود الأنصاري، عن النبي صلى الله عليه وسلم قال ‏\"‏ نفقة الرجل على أهله صدقة ‏\"‏ ‏.‏ وفي الباب عن عبد الله بن عمرو وعمرو بن أمية الضمري وأبي هريرة ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Abu  Mas'ud Al-Ansari narrated that the Messenger of Allah said:                     \"A man's spending on his family is charity.\"",
      "chain": [
        "30304",
        "20025",
        "20020",
        "11372",
        "1945",
        "402"
      ]
    },
    {
      "hadith_no": "2213",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Medicine - كتاب الطب عن رسول اللَّهِ صلى الله عليه وسلم",
      "chapter_no": "28",
      "text_ar": "حدثنا قتيبة، حدثنا الليث، عن ابن شهاب، عن أبي بكر بن عبد الرحمن، عن أبي مسعود الأنصاري، قال نهى رسول الله صلى الله عليه وسلم عن ثمن الكلب ومهر البغي وحلوان الكاهن ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " \"Abu Masud Al-Ansari narrated:                     \"The Messenger of Allah (S.A.W) prohibited the price of a dog,the earnings of a fornicator (from fornication), and the payment made to the fortune-teller.\"",
      "chain": [
        "30367",
        "20023",
        "11013",
        "11003",
        "402"
      ]
    },
    {
      "hadith_no": "2671",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Knowledge - كتاب العلم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "41",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود، أنبأنا شعبة، عن الأعمش، قال سمعت أبا عمرو الشيباني، يحدث عن أبي مسعود البدري، أن رجلا، أتى النبي صلى الله عليه وسلم يستحمله فقال إنه قد أبدع بي ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ ائت فلانا ‏\"‏ ‏.‏ فأتاه فحمله فقال رسول الله صلى الله عليه وسلم ‏\"‏ من دل على خير فله مثل أجر فاعله أو قال عامله ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح وأبو عمرو الشيباني اسمه سعد بن إياس وأبو مسعود البدري اسمه عقبة بن عمرو ‏.‏ حدثنا الحسن بن علي الخلال، حدثنا عبد الله بن نمير، عن الأعمش، عن أبي عمرو الشيباني، عن أبي مسعود، عن النبي صلى الله عليه وسلم نحوه وقال ‏\"‏ مثل أجر فاعله ‏\"‏ ‏.‏ ولم يشك فيه ‏.‏",
      "text_en": " Narrated Abu Mas'ud Al-Badri:                     that a man came to the Prophet (ﷺ) looking for a mount, he said: 'Mine has been ruined.' So the Messenger of Allah (ﷺ) said: 'Go to so-and-so.' So he went to him and he gave him a mount. The Messenger of Allah (ﷺ) said: 'Whoever leads to good, then for him is the same reward as the one who does it - or - who acts upon it.'\"",
      "chain": [
        "30277",
        "20547",
        "20020",
        "11060",
        "15580",
        "402"
      ]
    },
    {
      "hadith_no": "2999",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا هناد، حدثنا أبو معاوية، عن الأعمش، عن إسماعيل بن رجاء، عن أوس بن ضمعج، عن أبي مسعود، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يؤم الرجل في سلطانه ولا يجلس على تكرمته في بيته إلا بإذنه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Abu Mas'ud:                     that the Messenger of Allah (ﷺ) said: \"A man is not lead in his Sultanah, and his seat of honor in his house is not sat in without his permission.\"",
      "chain": [
        "30480",
        "20354",
        "11060",
        "10740",
        "10744",
        "402"
      ]
    },
    {
      "hadith_no": "3123",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on The Virtues of the Qur'an - كتاب فضائل القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "45",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا جرير بن عبد الحميد، عن منصور بن المعتمر، عن إبراهيم، عن عبد الرحمن بن يزيد، عن أبي مسعود الأنصاري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من قرأ الآيتين من آخر سورة البقرة في ليلة كفتاه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Abu Mas'ud Al-Ansari:                     that the Messenger of Allah (ﷺ) said: \"Whoever recites the last two Ayat of Surat Al-Baqarah during the night, they shall suffice him.\"",
      "chain": [
        "30242",
        "20028",
        "11067",
        "11051",
        "11055",
        "402"
      ]
    },
    {
      "hadith_no": "3526",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا إسحاق بن موسى الأنصاري، حدثنا معن، حدثنا مالك بن أنس، عن نعيم بن عبد الله المجمر، أن محمد بن عبد الله بن زيد الأنصاري، وعبد الله بن زيد الذي، كان أري النداء بالصلاة أخبره عن أبي مسعود الأنصاري، أنه قال أتانا رسول الله صلى الله عليه وسلم ونحن في مجلس سعد بن عبادة فقال له بشير بن سعد أمرنا الله أن نصلي عليك فكيف نصلي عليك قال فسكت رسول الله صلى الله عليه وسلم حتى تمنينا أنه لم يسأله ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ قولوا اللهم صل على محمد وعلى آل محمد كما صليت على آل إبراهيم وبارك على محمد وعلى آل محمد كما باركت على آل إبراهيم في العالمين إنك حميد مجيد والسلام كما قد علمتم ‏\"‏ ‏.‏ قال وفي الباب عن علي وأبي حميد وكعب بن عجرة وطلحة بن عبيد الله وأبي سعيد وزيد بن خارجة ويقال ابن جارية وبريدة ‏.‏ قال هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Abu Mas'ud Al-Ansari:                     \"The Messenger of Allah (ﷺ) came to us while we were sitting in a gathering of Sa'd bin 'Ubadah. Bashir bin Sa'd said: 'Allah ordered us to say Salat upon you, so how do we say Salat upon you?'\" The Messenger of Allah (ﷺ) was silent, until we thought that we had not even asked him. Then the Messenger of Allah (ﷺ) said: 'Say: O Allah! Send Salat upon Muhammad and upon Muhammad's family just as you have sent [upon Ibrahim and] upon Ibrahim's family. And bless Muhammad and Muhammad's family just as you have blessed [Ibrahim and] Ibrahim's family among the nations. Indeed you are praised, the glorious.' And the Salam is as you have learned.'\"",
      "chain": [
        "30410",
        "30112",
        "20001",
        "11225",
        "10615",
        "402"
      ]
    },
    {
      "hadith_no": "780",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا قتيبة، قال أنبأنا فضيل بن عياض، عن الأعمش، عن إسماعيل بن رجاء، عن أوس بن ضمعج، عن أبي مسعود، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يؤم القوم أقرؤهم لكتاب الله فإن كانوا في القراءة سواء فأقدمهم في الهجرة فإن كانوا في الهجرة سواء فأعلمهم بالسنة فإن كانوا في السنة سواء فأقدمهم سنا ولا تؤم الرجل في سلطانه ولا تقعد على تكرمته إلا أن يأذن لك ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Masud said:                      \"The Messenger of Allah(ﷺ)said: 'Let the one who has most knowledge of the Book of Allah lead the people in prayer. If they are equal in terms of knowledge of the Qur'h, let the one who emigrated first (lead them). If they are equal in terms of emigration, let the one who has more knowledge of the Sunnah, (lead them). If they are equal in terms of knowledge of the Sunnah, let the one who is oldest (lead them). Do not lead a man in prayer in his place of authority, and do not sit in his place of honor, unless hegives you permission.\"'",
      "chain": [
        "30367",
        "20200",
        "11060",
        "10740",
        "10744",
        "402"
      ]
    },
    {
      "hadith_no": "783",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا إبراهيم بن محمد التيمي، قال حدثنا يحيى بن سعيد، عن شعبة، عن إسماعيل بن رجاء، عن أوس بن ضمعج، عن أبي مسعود، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يؤم الرجل في سلطانه ولا يجلس على تكرمته إلا بإذنه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Masud said:                      \"The Messenger of Allah (ﷺ) said: 'A man should not be led in prayer in his place of authority, and no one should sit in his place of honor except with his permission.\"'",
      "chain": [
        "20031",
        "20020",
        "10740",
        "10744",
        "402"
      ]
    },
    {
      "hadith_no": "807",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا هناد بن السري، عن أبي معاوية، عن الأعمش، عن عمارة بن عمير، عن أبي معمر، عن أبي مسعود، قال كان رسول الله صلى الله عليه وسلم يمسح مناكبنا في الصلاة ويقول ‏\"‏ لا تختلفوا فتختلف قلوبكم ليليني منكم أولو الأحلام والنهى ثم الذين يلونهم ثم الذين يلونهم ‏\"‏ ‏.‏ قال أبو مسعود فأنتم اليوم أشد اختلافا ‏.‏ قال أبو عبد الرحمن أبو معمر اسمه عبد الله بن سخبرة ‏.‏",
      "text_en": " It was narrated that Abu Mas'ud Al-Ansiri said:                      \"The Messenger of Allah (ﷺ) used to gently pat our shoulders (to make sure the row was straight) at the time of prayer, and he-would say:'Keep (the rows) straight; do not differ from one another lest your hearts would be afflicted with discord. Let those who are mature and wise stand closest to me, then those who are next to them, then those who are next to them.\"' Abu Mas'ud said: Today, there is much disharmony among you. ,Abu 'Abdur-Rabin (An-Nasai)said: (One of the narrators) Abu Ma'mar's name is 'Abdullah bin Sakhbarah.",
      "chain": [
        "30480",
        "20354",
        "11060",
        "11378",
        "11360",
        "402"
      ]
    },
    {
      "hadith_no": "812",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا بشر بن خالد العسكري، قال حدثنا غندر، عن شعبة، عن سليمان، عن عمارة بن عمير، عن أبي معمر، عن أبي مسعود، قال كان رسول الله صلى الله عليه وسلم يمسح عواتقنا ويقول ‏\"‏ استووا ولا تختلفوا فتختلف قلوبكم وليليني منكم أولو الأحلام والنهى ثم الذين يلونهم ثم الذين يلونهم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Mas'ad Al-Ansari said:                      \"The Messenger of Allah (ﷺ) used to gently pat our shoulders (to make sure the row was straight) at the time of prayer, and he would say: 'Keep (the rows) straight; do not differ from one another lest your hearts should suffer from discord. Let those who are mature and wise stand closest to me, then those who are next to them, then those who are next to them.\"'",
      "chain": [
        "30126",
        "20278",
        "20020",
        "11060",
        "11378",
        "11360",
        "402"
      ]
    },
    {
      "hadith_no": "1027",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا قتيبة، قال حدثنا الفضيل، عن الأعمش، عن عمارة بن عمير، عن أبي معمر، عن أبي مسعود، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تجزئ صلاة لا يقيم الرجل فيها صلبه في الركوع والسجود ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Mas'ud said:                     \"The Messenger of Allah (ﷺ) said: 'The prayer is not valid if a man does not bring his backbone to rest while bowing and prostrating.'\"",
      "chain": [
        "30367",
        "20271",
        "11060",
        "11378",
        "11360",
        "402"
      ]
    },
    {
      "hadith_no": "1111",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا علي بن خشرم المروزي، قال أنبأنا عيسى، - وهو ابن يونس - عن الأعمش، عن عمارة، عن أبي معمر، عن أبي مسعود، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تجزئ صلاة لا يقيم الرجل فيها صلبه في الركوع والسجود ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Mas'ud said:                     \"The Messenger of Allah (ﷺ) said: 'No prayer is valid in which a man does not maintain his back (at ease) when bowing and prostrating.'\"",
      "chain": [
        "30556",
        "20347",
        "11060",
        "11379",
        "11360",
        "402"
      ]
    },
    {
      "hadith_no": "1285",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن القاسم، قال حدثني مالك، عن نعيم بن عبد الله المجمر، أن محمد بن عبد الله بن زيد الأنصاري، - وعبد الله بن زيد الذي أري النداء بالصلاة - أخبره عن أبي مسعود الأنصاري، أنه قال أتانا رسول الله صلى الله عليه وسلم في مجلس سعد بن عبادة فقال له بشير بن سعد أمرنا الله عز وجل أن نصلي عليك يا رسول الله فكيف نصلي عليك فسكت رسول الله صلى الله عليه وسلم حتى تمنينا أنه لم يسأله ثم قال ‏\"‏ قولوا اللهم صل على محمد وعلى آل محمد كما صليت على آل إبراهيم وبارك على محمد وعلى آل محمد كما باركت على آل إبراهيم في العالمين إنك حميد مجيد والسلام كما علمتم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Mas'ud Al-Ansari siad:                     \"The Messenger of Allah (ﷺ) came to us in the Majlis of Sa'd bin 'Ubadah and Bashir bin Sa'd said to him: 'Allah has commanded us to send Salah upon you, O Messenger of Allah; so how should we send salah upon you?' The Messenger of Allah (ﷺ) remained silent until we wished that he had not asked him. Then he said: 'Say: 'Alahumma salli 'ala Muhammad wa 'ala ali Muhammad, kama sallaita 'ala Ibrahima wa barik 'ala Muhammad kama barakta 'ala ali Ibrahim fil-'alamin, innaka hamidun majid (O Allah, send salah upon Muhammad and upon the family of Muhammad, as You sent salah upon the family of Ibrahim, and send blessings upon Muhammad and upon the family of Muhammad as You sent blessings upon the family of Ibrahim among the nations. You are indeed Worthy of praise, Full of glory.)\" And the salam is as you know.'\"",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11225",
        "402"
      ]
    },
    {
      "hadith_no": "1286",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا زياد بن يحيى، قال حدثنا عبد الوهاب بن عبد المجيد، قال حدثنا هشام بن حسان، عن محمد، عن عبد الرحمن بن بشر، عن أبي مسعود الأنصاري، قال قيل للنبي صلى الله عليه وسلم أمرنا أن نصلي عليك ونسلم أما السلام فقد عرفناه فكيف نصلي عليك قال ‏\"‏ قولوا اللهم صل على محمد كما صليت على آل إبراهيم اللهم بارك على محمد كما باركت على آل إبراهيم ‏\"‏ ‏.‏",
      "text_en": " XIt was narrated that Abu Mas'ud Al-Ansari said:                     \"It was said to the Prophet (ﷺ): We have been commanded to send salah and salams upon you. We know how to send salams, but how should we send salah?' He said: Say: 'Alahumma salli 'ala Muhammad wa 'ala ali Muhammad, kama sallaita 'ala Ibrahima wa barik 'ala Muhammad kama barakta 'ala ali Ibrahim fil-'alamin, innaka hamidun majid (O Allah, send salah upon Muhammad and upon the family of Muhammad, as You sent salah upon the family of Ibrahim).'\"",
      "chain": [
        "20259",
        "11311",
        "11035",
        "30356",
        "402"
      ]
    },
    {
      "hadith_no": "1462",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "أخبرنا يعقوب بن إبراهيم، قال حدثنا يحيى، عن إسماعيل، قال حدثني قيس، عن أبي مسعود، قال قال رسول الله صلى الله عليه وسلم ‏‏\"‏‏ إن الشمس والقمر لا ينكسفان لموت أحد ولكنهما آيتان من آيات الله عز وجل فإذا رأيتموهما فصلوا ‏‏\"‏‏ ‏‏.‏‏",
      "text_en": " It was narrated that Abu Mas'ud said:                     \"The Messenger of Allah (ﷺ) said: \"The sun and the moon do not become eclipsed for the death or birth of anyone, rather they are two of the signs of Allah (SWT), the Mighty and Sublime, so when you see that then pray.'\"",
      "chain": [
        "20184",
        "20031",
        "11418",
        "11046",
        "402"
      ]
    },
    {
      "hadith_no": "2529",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا الحسين بن حريث، قال أنبأنا الفضل بن موسى، عن الحسين، عن منصور، عن شقيق، عن أبي مسعود، قال كان رسول الله صلى الله عليه وسلم يأمرنا بالصدقة فما يجد أحدنا شيئا يتصدق به حتى ينطلق إلى السوق فيحمل على ظهره فيجيء بالمد فيعطيه رسول الله صلى الله عليه وسلم إني لأعرف اليوم رجلا له مائة ألف ما كان له يومئذ درهم ‏.‏",
      "text_en": " It was narrated that Abu Mas'ud said:                     \"The Messenger of Allah used to tell us to give in charity, and one of us could not find anything to give until he went to the market place and hired himself out to carry loads for people. Then he would bring a Mudd and give it to the Messenger of Allah. I know a man who has a hundred thousand now, but on that day he had (only) one Dirham.\"",
      "chain": [
        "30325",
        "20452",
        "11278",
        "11067",
        "11353",
        "402"
      ]
    },
    {
      "hadith_no": "2530",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا بشر بن خالد، قال حدثنا غندر، عن شعبة، عن سليمان، عن أبي وائل، عن أبي مسعود، قال لما أمرنا رسول الله صلى الله عليه وسلم بالصدقة فتصدق أبو عقيل بنصف صاع وجاء إنسان بشىء أكثر منه فقال المنافقون إن الله عز وجل لغني عن صدقة هذا وما فعل هذا الآخر إلا رياء فنزلت ‏{‏ الذين يلمزون المطوعين من المؤمنين في الصدقات والذين لا يجدون إلا جهدهم ‏}‏ ‏.‏",
      "text_en": " It was narrated that Abu Mas 'ud said:                     \"When the Messenger of Allah commanded us to give in charity, Abu 'Aqil give half a Sa', and another man brought much more than that. The hypocrites said: 'Allah has no need of the charity of the former, and the latter only did it to show off. Then the following was revealed: 'Those who defame such of the believers who give charity voluntarily, and such who could not find to give charity except what is available to them.\"'[1]",
      "chain": [
        "30126",
        "20278",
        "20020",
        "11060",
        "11353",
        "402"
      ]
    },
    {
      "hadith_no": "2545",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا محمد، قال حدثنا شعبة، عن عدي بن ثابت، قال سمعت عبد الله بن يزيد الأنصاري، يحدث عن أبي مسعود، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا أنفق الرجل على أهله وهو يحتسبها كانت له صدقة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Mas'ud that the Prophet said:                     \"When a man spends on his family, seeking reward for that, that is an act of charity on his part.\"",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11372",
        "402"
      ]
    },
    {
      "hadith_no": "3187",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا بشر بن خالد، قال حدثنا محمد بن جعفر، قال حدثنا شعبة، عن سليمان، قال سمعت أبا عمرو الشيباني، عن أبي مسعود، أن رجلا، تصدق بناقة مخطومة في سبيل الله فقال رسول الله صلى الله عليه وسلم ‏\"‏ ليأتين يوم القيامة بسبعمائة ناقة مخطومة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Mas'ud that a man gave a bridled camel in charity in the cause of Allah. The Messenger of Allah (ﷺ) said:                      \"On the Day of Resurrection seven hundred bridled camels will come to you.\"",
      "chain": [
        "30126",
        "20173",
        "20020",
        "11060",
        "15580",
        "402"
      ]
    },
    {
      "hadith_no": "4292",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا قتيبة، قال حدثنا الليث، عن ابن شهاب، عن أبي بكر بن عبد الرحمن بن الحارث بن هشام، أنه سمع أبا مسعود، عقبة قال نهى رسول الله صلى الله عليه وسلم عن ثمن الكلب ومهر البغي وحلوان الكاهن ‏.‏",
      "text_en": " It was narrated from Abu Bakr bin 'Abdur-Rahman bin Al-Harith bin Hisham that her heard Abu Mas ud 'Uqbah say:                     \"The Messenger of Allah forbade the price of a dog, the gift of a female fornicator and the fees of a fortuneteller.\"( Sahih)",
      "chain": [
        "30367",
        "20023",
        "11013",
        "11003",
        "402"
      ]
    },
    {
      "hadith_no": "4666",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "حدثنا قتيبة، قال حدثنا الليث، عن ابن شهاب، عن أبي بكر بن عبد الرحمن بن الحارث بن هشام، أنه سمع أبا مسعود، عقبة بن عمرو قال نهى رسول الله صلى الله عليه وسلم عن ثمن الكلب ومهر البغي وحلوان الكاهن ‏.‏",
      "text_en": " Abu Mas'us 'Uqbah bin 'Amr said:                     \"The Messenger of Allah forbade the price of a dog, the gift of a female fornicator, and the fee of a fortuneteller.\"",
      "chain": [
        "30367",
        "20023",
        "11013",
        "11003",
        "402"
      ]
    },
    {
      "hadith_no": "5703",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا الحسن بن إسماعيل بن سليمان، قال أنبأنا يحيى بن يمان، عن سفيان، عن منصور، عن خالد بن سعد، عن أبي مسعود، قال عطش النبي صلى الله عليه وسلم حول الكعبة فاستسقى فأتي بنبيذ من السقاية فشمه فقطب فقال ‏\"‏ على بذنوب من زمزم ‏\"‏ ‏.‏ فصب عليه ثم شرب فقال رجل أحرام هو يا رسول الله قال ‏\"‏ لا ‏\"‏ ‏.‏ وهذا خبر ضعيف لأن يحيى بن يمان انفرد به دون أصحاب سفيان ويحيى بن يمان لا يحتج بحديثه لسوء حفظه وكثرة خطئه ‏.‏",
      "text_en": " It was narrated that Abu Mas'ud said:                     \"The Prophet [SAW] became thirsty around the Ka'bah so he called for a drink. Some Nabidh was brought in a water skin and he smelled it and frowned. He said: 'Bring me a bucket of Zamzam (water).' He poured it over it and drank some. A man said: 'Is it unlawful, O Messenger of Allah?' He said: 'No.'\"",
      "chain": [
        "20617",
        "20012",
        "11067",
        "11625",
        "402"
      ]
    },
    {
      "hadith_no": "919",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا علي بن محمد، وعمرو بن عبد الله، قالا حدثنا وكيع، عن الأعمش، عن عمارة، عن أبي معمر، عن أبي مسعود، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا تجزئ صلاة لا يقيم الرجل فيها صلبه في الركوع والسجود ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Mas’ud said:                      “The Messenger of Allah (ﷺ)said: ‘No prayer is acceptable in which a man does not settle hisspine when bowing and when prostrating.’”",
      "chain": [
        "38409",
        "20032",
        "11060",
        "11379",
        "11360",
        "402"
      ]
    },
    {
      "hadith_no": "1029",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن الصباح، أنبأنا سفيان بن عيينة، عن الأعمش، عن عمارة بن عمير، عن أبي معمر، عن أبي مسعود الأنصاري، قال كان رسول الله  صلى الله عليه وسلم  يمسح مناكبنا في الصلاة ويقول ‏\"‏ لا تختلفوا فتختلف قلوبكم ليليني منكم أولو الأحلام والنهى ثم الذين يلونهم ثم الذين يلونهم ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Mas’ud Al-Ansari said:                      “The Messenger ofAllah(ﷺ) used to gently pat our shoulders (to make sure the row wasstraight) at the time of prayer, saying: ‘Keep (the rows) straight,donot differ from one another lest your hearts should suffer fromdiscord. Let those who are forbearing and wise stand closest to me,then those who are next to them, then those who are next to them.’”",
      "chain": [
        "30269",
        "20005",
        "11060",
        "11378",
        "11360",
        "402"
      ]
    },
    {
      "hadith_no": "1033",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن إسماعيل بن رجاء، قال سمعت أوس بن ضمعج، قال سمعت أبا مسعود، يقول قال رسول الله  صلى الله عليه وسلم  ‏\"‏ يؤم القوم أقرؤهم لكتاب الله فإن كانت قراءتهم سواء فليؤمهم أقدمهم هجرة فإن كانت الهجرة سواء فليؤمهم أكبرهم سنا ولا يؤم الرجل في أهله ولا في سلطانه ولا يجلس على تكرمته في بيته إلا بإذن أو بإذنه ‏\"‏ ‏.‏",
      "text_en": " AbuMas’ud said:                      “The Messenger of Allah (ﷺ) said: ‘The peopleshould be lead by the one who is most well-Versed in recitation oftheBook of Allah. If they are equal in recitation, then they shouldbeled by the one who emigrated first. If they are equal inemigration,then they should be led by the eldest. A man should notbe led amonghis family or in his place of authority; no one shouldbe sat in hisplace of honour in his house without permission, orwithout hispermission.’”",
      "chain": [
        "30160",
        "20173",
        "20020",
        "10740",
        "10744",
        "402"
      ]
    },
    {
      "hadith_no": "1037",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبي، حدثنا إسماعيل، عن قيس، عن أبي مسعود، قال أتى النبي  صلى الله عليه وسلم  رجل فقال يا رسول الله إني لأتأخر في صلاة الغداة من أجل فلان لما يطيل بنا فيها ‏.‏ قال فما رأيت رسول الله  صلى الله عليه وسلم  قط في موعظة أشد غضبا منه يومئذ ‏\"‏ يا أيها الناس إن منكم منفرين فأيكم ما صلى بالناس فليجوز فإن فيهم الضعيف والكبير وذا الحاجة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Mas’ud said:                      “A man came to the Prophet(ﷺ)and said: ‘O Messenger of Allah! I stay behind and do notperformthe morning prayer (in congregation) because of so-and-so, forhemakes it too long for us.’ I never saw the Messenger of Allah (ﷺ)preaching with such anger as he did that day. He said; ‘O people!There are among you those who repel others. Whoever among you leadsothers in prayer, let him keep it short, for among them are those whoare weak and elderly, and those who have pressing needs.’”",
      "chain": [
        "30212",
        "20331",
        "20208",
        "11046",
        "402"
      ]
    },
    {
      "hadith_no": "1319",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبي، حدثنا إسماعيل بن أبي خالد، عن قيس بن أبي حازم، عن أبي مسعود، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن الشمس والقمر لا ينكسفان لموت أحد من الناس فإذا رأيتموه فقوموا فصلوا ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Mas’ud said:                      The Messenger of Allah (ﷺ)said:“The sun and the moon do not become eclipsed for the death ofanyone among mankind. If you see that, then stand and performprayer.”",
      "chain": [
        "30212",
        "20331",
        "11418",
        "11046",
        "402"
      ]
    },
    {
      "hadith_no": "1430",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا حفص بن غياث، وأسباط بن محمد، قالا حدثنا الأعمش، عن إبراهيم، عن عبد الرحمن بن يزيد، عن علقمة، عن أبي مسعود، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ الآيتان من آخر سورة البقرة من قرأهما في ليلة كفتاه ‏\"‏ ‏.‏ قال حفص في حديثه قال عبد الرحمن فلقيت أبا مسعود وهو يطوف فحدثني به ‏.‏",
      "text_en": " It wasnarrated that Abu Mas’ud said:                      The Messenger of Allah (ﷺ)said:“Whoever recites the last two Verses of Surat Al-Baqarah atnight,that will be sufficient for him.”",
      "chain": [
        "30212",
        "20317",
        "20408",
        "11060",
        "11051",
        "11055",
        "11017",
        "402"
      ]
    },
    {
      "hadith_no": "1431",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن منصور، عن إبراهيم، عن عبد الرحمن بن يزيد، عن أبي مسعود، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ من قرأ الآيتين من آخر سورة البقرة في ليلة كفتاه ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Mas’ud that the Messenger of Allah (ﷺ)said:                     “Whoever recites the last two Verses of Surat Al-Baqarah atnight,that will be sufficient for him.”",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11051",
        "11055",
        "402"
      ]
    },
    {
      "hadith_no": "1501",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بشر، بكر بن خلف ومحمد بن بشار قالا حدثنا يحيى بن سعيد، حدثنا عبد الحميد بن جعفر، عن أبيه، عن حكيم بن أفلح، عن أبي مسعود، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ للمسلم على المسلم أربع خلال يشمته إذا عطس ويجيبه إذا دعاه ويشهده إذا مات ويعوده إذا مرض ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Mas’ud that the Prophet (ﷺ) said:                      “TheMuslimhas four things due from the Muslim: He should answer [bysayingYarhamuk-Allah (may Allah have mercy on you)] to him if hesneezes(and says Al-Hamdulillah); he should accept his invitation ifheinvites him; he should attend his funeral if he dies; and he shouldvisit him if he falls sick.”",
      "chain": [
        "20031",
        "11875",
        "11833",
        "402"
      ]
    },
    {
      "hadith_no": "2243",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا هشام بن عمار، ومحمد بن الصباح، قالا حدثنا سفيان بن عيينة، عن الزهري، عن أبي بكر بن عبد الرحمن، عن أبي مسعود، أن النبي  صلى الله عليه وسلم  نهى عن ثمن الكلب ومهر البغي وحلوان الكاهن ‏.‏",
      "text_en": " It was narrated from Abu Mas'ud that :                     the Prophet (ﷺ) forbade the price of a dog, the payment (given to a prostitute) and the payment made to a soothsayer.",
      "chain": [
        "30288",
        "30269",
        "20005",
        "11013",
        "11003",
        "402"
      ]
    },
    {
      "hadith_no": "3437",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا إسماعيل بن أسد، حدثنا جعفر بن عون، حدثنا إسماعيل بن أبي خالد، عن قيس بن أبي حازم، عن أبي مسعود، قال أتى النبي  صلى الله عليه وسلم  رجل فكلمه فجعل ترعد فرائصه فقال له ‏\"‏ هون عليك فإني لست بملك إنما أنا ابن امرأة تأكل القديد ‏\"‏ ‏.‏ قال أبو عبد الله إسماعيل وحده وصله ‏.‏",
      "text_en": " It wasnarrated that Ibn Mas’ud said:                      “A man came to the Prophet(ﷺ),so he spoke to him, and he started to tremble with awe. He saidtohim: ‘Take it easy. I am not a king; I am just a man whose motherate dried meat.’”",
      "chain": [
        "20416",
        "11418",
        "11046",
        "402"
      ]
    },
    {
      "hadith_no": "3746",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أسود بن عامر، عن شريك، عن الأعمش، عن أبي عمرو الشيباني، عن أبي مسعود، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ المستشار مؤتمن ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Mas'ud that the Messenger of Allah(ﷺ) said:                     \"One who is consulted is entrusted.\"",
      "chain": [
        "30201",
        "20380",
        "20587",
        "11060",
        "11343",
        "402"
      ]
    },
    {
      "hadith_no": "3789",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، عن سفيان، عن أبي قيس الأودي، عن عمرو بن ميمون، عن أبي مسعود الأنصاري، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ الله أحد الواحد الصمد تعدل ثلث القرآن ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Masud Al Ansari said:                     \"The Messenger of Allah(ﷺ) said: \"Allahu ahad, Al-Wahidus-Samad [Allah (the) One, the One the Self-Sufficient Master] is equivalent to one third of the Quran.\"",
      "chain": [
        "38409",
        "20032",
        "20012",
        "11382",
        "402"
      ]
    }
  ],
  "total_hadiths": 105
}