{
  "id": "403",
  "name": "Sahl bin Hunayf ( سهل بن حنيف ( رضي الله عنه",
  "full_name": "Sahl bin Hunayf ( سهل بن حنيف ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medinah"
    },
    "death": {
      "date_hijri": "38",
      "date_gregorian": "658",
      "date_display": null,
      "place": "Kufa",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina",
      "Kufa"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ ع  -  صحابي ]"
    ],
    "tags": [
      "Ansar",
      "Aws",
      "B.'Amr B.'Auf",
      "B.Hanash",
      "Badr",
      "Uhud",
      "Khandaq"
    ]
  },
  "parents": [],
  "spouses": [
    {
      "id": "1252",
      "name": "Habiba bint As'ad bin Zurara ( حبيبة بنت أسعد بن زرارة ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "siblings": [
    {
      "id": "404",
      "name": "'Uthman bin Hunayf ( عثمان بن حنيف ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "406",
      "name": "'Abbad bin Hunayf ( عباد بن حنيف ( رضي الله عنه",
      "grade": "Comp.(RA)"
    }
  ],
  "children": [
    {
      "id": "405",
      "name": "Abu Umama bin Sahl ( أسعد أبو أمامة بن سهل بن حنيف ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "49",
      "name": "Zayd ibn Thabit ( زيد بن ثابت بن الضحاك بن زيد ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "405",
      "name": "Abu Umama bin Sahl ( أسعد أبو أمامة بن سهل بن حنيف ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11353",
      "name": "Shaqayq bin Salmah al-Asadi شقيق بن سلمة الأسدي أبو وائل الكوفي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11004",
      "name": "'Ubaydullah bin 'Abdullah bin 'Utba عبيد الله بن عبد الله بن عتبة بن مسعود",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11203",
      "name": "'Ubaid bin al-Sabaq عبيد بن السباق الثقفي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11570",
      "name": "Yasayr bin 'Amr يسير بن عمرو الشيباني",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "19476",
      "name": "al-Rbab Jd'h 'Uthman bin الرباب جدة عثمان",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11196",
      "name": "'Abdur Rahman bin Abi Layla عبد الرحمن بن أبي ليلى",
      "grade": "Follower(Tabi') [2nd Generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-1312",
      "hadith_no": "1312",
      "source": "Sahih Bukhari",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا آدم، حدثنا شعبة، حدثنا عمرو بن مرة، قال سمعت عبد الرحمن بن أبي ليلى، قال كان سهل بن حنيف وقيس بن سعد قاعدين بالقادسية، فمروا عليهما بجنازة فقاما‏.‏ فقيل لهما إنها من أهل الأرض، أى من أهل الذمة فقالا إن النبي صلى الله عليه وسلم مرت به جنازة فقام فقيل له إنها جنازة يهودي‏.‏ فقال ‏\"‏ أليست نفسا ‏\"‏‏.‏   وقال أبو حمزة عن الأعمش، عن عمرو، عن ابن أبي ليلى، قال كنت مع قيس وسهل  رضى الله عنهما  فقالا كنا مع النبي صلى الله عليه وسلم‏.‏ وقال زكرياء عن الشعبي عن ابن أبي ليلى كان أبو مسعود وقيس يقومان للجنازة‏.‏",
      "text_en": " Narrated `Abdur Rahman bin Abi Laila:                     Sahl bin Hunaif and Qais bin Sa`d were sitting in the city of Al-Qadisiya. A funeral procession passed in front of them and they stood up. They were told that funeral procession was of one of the inhabitants of the land i.e. of a non-believer, under the protection of Muslims. They said, \"A funeral procession passed in front of the Prophet and he stood up. When he was told that it was the coffin of a Jew, he said, \"Is it not a living being (soul)?\"",
      "usc_msa_ref": "399",
      "chain": [
        "20404",
        "20020",
        "11381",
        "11196",
        "403"
      ]
    },
    {
      "id": "sahih-bukhari-6250",
      "hadith_no": "6250",
      "source": "Sahih Bukhari",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا عبدان، أخبرنا عبد الله، عن يونس، عن الزهري، عن أبي أمامة بن سهل، عن أبيه، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يقولن أحدكم خبثت نفسي، ولكن ليقل لقست نفسي ‏\"‏‏.‏ تابعه عقيل‏.‏",
      "text_en": " Narrated Sal:                     The Prophet said, \"None of you should say Khabuthat Nafsi but he is recommended to say 'Laqisat Nafsi (See Hadith No. 202)",
      "usc_msa_ref": "199",
      "chain": [
        "30349",
        "20025",
        "20475",
        "11013",
        "405",
        "403"
      ]
    },
    {
      "id": "sahih-bukhari-7394",
      "hadith_no": "7394",
      "source": "Sahih Bukhari",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا عبدان، أخبرنا أبو حمزة، سمعت الأعمش، قال سألت أبا وائل هل شهدت صفين قال نعم‏.‏ فسمعت سهل بن حنيف، يقول ح وحدثنا موسى بن إسماعيل، حدثنا أبو عوانة، عن الأعمش، عن أبي وائل، قال قال سهل بن حنيف يا أيها الناس اتهموا رأيكم على دينكم، لقد رأيتني يوم أبي جندل ولو أستطيع أن أرد أمر رسول الله صلى الله عليه وسلم لرددته، وما وضعنا سيوفنا على عواتقنا إلى أمر يفظعنا إلا أسهلن بنا إلى أمر نعرفه غير هذا الأمر‏.‏ قال وقال أبو وائل شهدت صفين وبئست صفون‏.‏",
      "text_en": " Narrated Al-A`mash:                     I asked Abu Wail, \"Did you witness the battle of Siffin between `Ali and Muawiya?\" He said, \"Yes,\" and added, \"Then I heard Sahl bin Hunaif saying, 'O people! Blame your personal opinions in your religion. No doubt, I remember myself on the day of Abi Jandal; if I had the power to refuse the order of Allah's Apostle, I would have refused it. We have never put our swords on our shoulders to get involved in a situation that might have been horrible for us, but those swords brought us to victory and peace, except this present situation.' \" Abu Wail said, \"I witnessed the battle of Siffin, and how nasty Siffin was!\"",
      "usc_msa_ref": "411",
      "chain": [
        "30349",
        "20458",
        "11060",
        "20040",
        "20469",
        "11060",
        "11353",
        "403"
      ]
    },
    {
      "id": "sahih-muslim-2269",
      "hadith_no": "2269",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا غندر، عن شعبة، ح وحدثنا محمد بن المثنى، وابن بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن عمرو بن مرة، عن ابن أبي ليلى، أن قيس بن سعد، وسهل بن حنيف، كانا بالقادسية فمرت بهما جنازة فقاما فقيل لهما إنها من أهل الأرض ‏.‏ فقالا إن رسول الله صلى الله عليه وسلم مرت به جنازة فقام فقيل إنه يهودي ‏.‏ فقال ‏\"‏ أليست نفسا ‏\"‏ ‏.‏ وحدثنيه القاسم بن زكرياء، حدثنا عبيد الله بن موسى، عن شيبان، عن الأعمش، عن عمرو بن مرة، بهذا الإسناد وفيه فقالا كنا مع رسول الله صلى الله عليه وسلم فمرت علينا جنازة ‏.‏",
      "text_en": " It is narrated on the authority of Ibn Abu Laila that while Qais b. Sa'd and Sahl b. Hunaif were both in Qadislyya a bier passed by them and they both stood up. They were told that it was the bier of one of the people of the land (non-Muslim). They said that a bier passed before the Holy Prophet (may peace be upon him) and he stood up. He was told that he (the dead man) was a Jew. Upon this he remarked:                      Was he not a human being or did he not have a soul? And in the hadith narrated by 'Amr b. Murra with the same chain of transmitters, (the words) are:\" There passed a bier before us.\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20278",
        "20020",
        "30170",
        "30160",
        "20173",
        "20020",
        "11381",
        "11196",
        "172",
        "403"
      ]
    },
    {
      "id": "sahih-muslim-2519",
      "hadith_no": "2519",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن الشيباني، عن يسير بن، عمرو قال سألت سهل بن حنيف هل سمعت النبي صلى الله عليه وسلم يذكر الخوارج فقال سمعته - وأشار بيده نحو المشرق ‏\"‏ قوم يقرءون القرآن بألسنتهم لا يعدو تراقيهم يمرقون من الدين كما يمرق السهم من الرمية ‏\"‏ ‏.‏",
      "text_en": " Yusair b. 'Amr reported that he inquired of Sahl b. Hunaif:                      Did you hear the Apostle of Allah (may peace be upon him) making a mention of the Khwarij? He said: I heard him say (and he pointed with his hand towards the east) that these would be a people who would recite the Qur'an with their tongues and it would not go beyond their collar bones. They would pass clean through their religion just as the arrow passes through the prey.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20345",
        "11352",
        "11570",
        "403"
      ]
    },
    {
      "id": "sahih-muslim-2521",
      "hadith_no": "2521",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وإسحاق، جميعا عن يزيد، - قال أبو بكر حدثنا يزيد بن هارون، - عن العوام بن حوشب، حدثنا أبو إسحاق الشيباني، عن أسير بن عمرو، عن سهل بن حنيف، عن النبي صلى الله عليه وسلم قال ‏\"‏ يتيه قوم قبل المشرق محلقة رءوسهم ‏\"‏ ‏.‏",
      "text_en": " Sahl b. Hunaif reported Allah's Apostle (may peace be upon him) as saying:                      There would arise from the east a people with shaven heads.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20472",
        "20436",
        "20472",
        "11441",
        "11352",
        "403"
      ]
    },
    {
      "id": "sahih-muslim-3407",
      "hadith_no": "3407",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن الشيباني، عن يسير، بن عمرو عن سهل بن حنيف، قال أهوى رسول الله صلى الله عليه وسلم بيده إلى المدينة فقال ‏\"‏ إنها حرم آمن ‏\"‏ ‏.‏",
      "text_en": " Sahl b. Hunif reported that Allah's Messenger (may peace be upon him) pointed with his hands towards Medina and said:                      That is a sacred territory and a place of safety.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20345",
        "11352",
        "11570",
        "403"
      ]
    },
    {
      "id": "sahih-muslim-4734",
      "hadith_no": "4734",
      "source": "Sahih Muslim",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "وحدثنا أبو كريب، محمد بن العلاء ومحمد بن عبد الله بن نمير قالا حدثنا أبو معاوية عن الأعمش، عن شقيق، قال سمعت سهل بن حنيف، يقول بصفين أيها الناس اتهموا رأيكم والله لقد رأيتني يوم أبي جندل ولو أني أستطيع أن أرد أمر رسول الله صلى الله عليه وسلم لرددته والله ما وضعنا سيوفنا على عواتقنا إلى أمر قط إلا أسهلن بنا إلى أمر نعرفه إلا أمركم هذا ‏.‏ لم يذكر ابن نمير إلى أمر قط ‏.‏",
      "text_en": " It has been narrated on the authority of Shaqiq who said:                      I heard Sahl b. Hunaif say at Siffin: O ye people, find fault with your (own) discretion. By Allah, on the Day of Abu Jandal (i. e. the day of Hudaibiya), I thought to myself that, if I could, I would reverse the order of the Messenger of Allah (may peace be upon him) (the terms of the truce being unpalatable). By Allah, we have never hung our swords on our shoulders in any situation whatsoever except when they made easy for us to realise the goal envisaged by us, but this battle of yours (seems to be an exception). Ibn Numair (in his version) did not mention the words:\" In any situation whatsoever\"",
      "usc_msa_ref": "",
      "chain": [
        "20354",
        "11060",
        "11353",
        "403"
      ]
    },
    {
      "id": "sahih-muslim-4736",
      "hadith_no": "4736",
      "source": "Sahih Muslim",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "وحدثني إبراهيم بن سعيد الجوهري، حدثنا أبو أسامة، عن مالك بن مغول، عن أبي حصين، عن أبي وائل، قال سمعت سهل بن حنيف، بصفين يقول اتهموا رأيكم على دينكم فلقد رأيتني يوم أبي جندل ولو أستطيع أن أرد أمر رسول الله صلى الله عليه وسلم - ما فتحنا منه في خصم إلا انفجر علينا منه خصم ‏.‏",
      "text_en": " It has been narrated through a different chain of transmitters on the authority of Abu Wa'il who said:                      I heard Sahl b. Hunaif say at Siffin: Blame (the hollowness) of your views about your religion. I thought to myself on the day of Abu Jandal that if I could turn down the order of the Messenger of Allah (may peace be upon him), I would. The situation was so difficult that if we mended it at one place, it was rent at another.",
      "usc_msa_ref": "",
      "chain": [
        "30498",
        "20318",
        "20358",
        "11371",
        "11353",
        "403"
      ]
    },
    {
      "id": "sahih-muslim-6017",
      "hadith_no": "6017",
      "source": "Sahih Muslim",
      "chapter": "The Book Concerning the Use of Correct Words - كتاب الألفاظ من الأدب وغيرها",
      "chapter_no": "41",
      "text_ar": "وحدثني أبو الطاهر، وحرملة، قالا أخبرنا ابن وهب، أخبرني يونس، عن ابن، شهاب عن أبي أمامة بن سهل بن حنيف، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يقل أحدكم خبثت نفسي ‏.‏ وليقل لقست نفسي ‏\"‏ ‏.‏",
      "text_en": " Abu Umama b. Sahl b. Hunaif, on the authority of his father, reported Allah's Messenger (may peace be upon him) as saying:                      None of you should say:\" My soul has become evil,\" but he should say:\" My soul has become remorseless.\"",
      "usc_msa_ref": "",
      "chain": [
        "30487",
        "20029",
        "20475",
        "11013",
        "405",
        "403"
      ]
    },
    {
      "id": "sunan-abi-daud-210",
      "hadith_no": "210",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا مسدد، حدثنا إسماعيل، - يعني ابن إبراهيم - أخبرنا محمد بن إسحاق، حدثني سعيد بن عبيد بن السباق، عن أبيه، عن سهل بن حنيف، قال كنت ألقى من المذى شدة وكنت أكثر منه الاغتسال فسألت رسول الله صلى الله عليه وسلم عن ذلك فقال ‏\"‏ إنما يجزيك من ذلك الوضوء ‏\"‏ ‏.‏ قلت يا رسول الله فكيف بما يصيب ثوبي منه قال ‏\"‏ يكفيك بأن تأخذ كفا من ماء فتنضح بها من ثوبك حيث ترى أنه أصابه ‏\"‏ ‏.‏",
      "text_en": " Narrated Sahl ibn Hunayf:                     I felt greatly distressed by the frequent flowing of prostatic fluid. For this reason I used to take a bath very often. I asked the apostle of Allah (ﷺ) about this. He replied: Ablution will be sufficient for you because of this. I asked: Messenger of Allah, what should I do if it smears my clothes. He replied: It is sufficient if you take a handful of water  and sprinkle it on your clothe when you find it has smeared it.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20208",
        "11107",
        "12138",
        "11203",
        "403"
      ]
    },
    {
      "id": "sunan-abi-daud-1520",
      "hadith_no": "1520",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا يزيد بن خالد الرملي، حدثنا ابن وهب، حدثنا عبد الرحمن بن شريح، عن أبي أمامة بن سهل بن حنيف، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من سأل الله الشهادة صادقا بلغه الله منازل الشهداء وإن مات على فراشه ‏\"‏ ‏.‏",
      "text_en": " Suhail b. Hunaif reported on the authority of his father:                      The Messenger of Allah (ﷺ) said: If anyone asks Allah for martyrdom sincerely, Allah make him reach the ranks of martyrs though he may die on his bed.",
      "usc_msa_ref": "",
      "chain": [
        "38715",
        "20029",
        "20438",
        "405",
        "403"
      ]
    },
    {
      "id": "sunan-abi-daud-1607",
      "hadith_no": "1607",
      "source": "Sunan Abi Da'ud",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن يحيى بن فارس، حدثنا سعيد بن سليمان، حدثنا عباد، عن سفيان بن حسين، عن الزهري، عن أبي أمامة بن سهل، عن أبيه، قال نهى رسول الله صلى الله عليه وسلم عن الجعرور ولون الحبيق أن يؤخذا في الصدقة ‏.‏ قال الزهري لونين من تمر المدينة ‏.‏ قال أبو داود وأسنده أيضا أبو الوليد عن سليمان بن كثير عن الزهري ‏.‏",
      "text_en": " Abu Umamah bin Sahl reported on the authority of his father:                      The Messenger of Allah (ﷺ) prohibited to accept ja'rur and habiq dates as zakat. Az-Zuhri said: These are two kinds of the dates of Medina.Abu Dawud said: This has also been transmited by Abu al-Walid from Sulaiman bin Kathir from Az-Zuhri.",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "30252",
        "20431",
        "20655",
        "11013",
        "405",
        "403"
      ]
    },
    {
      "id": "sunan-abi-daud-3888",
      "hadith_no": "3888",
      "source": "Sunan Abi Da'ud",
      "chapter": "Medicine (Kitab Al-Tibb) - كتاب الطب",
      "chapter_no": "29",
      "text_ar": "حدثنا مسدد، حدثنا عبد الواحد بن زياد، حدثنا عثمان بن حكيم، حدثتني جدتي الرباب، قالت سمعت سهل بن حنيف، يقول مررنا بسيل فدخلت فاغتسلت فيه فخرجت محموما فنمي ذلك إلى رسول الله صلى الله عليه وسلم فقال ‏\"‏ مروا أبا ثابت يتعوذ ‏\"‏ ‏.‏ قالت فقلت يا سيدي والرقى صالحة فقال ‏\"‏ لا رقية إلا في نفس أو حمة أو لدغة ‏\"‏ ‏.‏ قال أبو داود الحمة من الحيات وما يلسع ‏.‏",
      "text_en": " Narrated Sahl ibn Hunayf:                     I passed by a river. I entered it and took a bath in it. When I came out, I had fever. The Messenger of Allah (ﷺ) was informed about it. He said: Ask AbuThabit to seek refuge in Allah from that I asked: O my Lord, will the spell be useful? He replied: No, the spell is to be used except for the evil eye or a snake bite or a scorpion sting.Abu Dawud said: Humah means the biting of snakes and sting of the poisonous insects.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20256",
        "11889",
        "403"
      ]
    },
    {
      "id": "sunan-abi-daud-4978",
      "hadith_no": "4978",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، قال أخبرني يونس، عن ابن شهاب، عن أبي أمامة بن سهل بن حنيف، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يقولن أحدكم خبثت نفسي وليقل لقست نفسي ‏\"‏ ‏.‏",
      "text_en": " Abu Umamah b. Sahl b. Hunaif quoted his father as saying :                      None of you must say Khabuthat nafsi (My heart is heaving), but one should say Laqisat nafsi (My heart is being annoyed).",
      "usc_msa_ref": "",
      "chain": [
        "30226",
        "20029",
        "20475",
        "11013",
        "405",
        "403"
      ]
    },
    {
      "id": "jami-al-tirmidhi-115",
      "hadith_no": "115",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا هناد، حدثنا عبدة، عن محمد بن إسحاق، عن سعيد بن عبيد، هو ابن السباق عن أبيه، عن سهل بن حنيف، قال كنت ألقى من المذى شدة وعناء فكنت أكثر منه الغسل فذكرت ذلك لرسول الله صلى الله عليه وسلم وسألته عنه فقال ‏\"‏ إنما يجزئك من ذلك الوضوء ‏\"‏ ‏.‏ فقلت يا رسول الله كيف بما يصيب ثوبي منه قال ‏\"‏ يكفيك أن تأخذ كفا من ماء فتنضح به ثوبك حيث ترى أنه أصاب منه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ولا نعرفه إلا من حديث محمد بن إسحاق في المذى مثل هذا ‏.‏ وقد اختلف أهل العلم في المذى يصيب الثوب فقال بعضهم لا يجزئ إلا الغسل وهو قول الشافعي وإسحاق ‏.‏ وقال بعضهم يجزئه النضح ‏.‏ وقال أحمد أرجو أن يجزئه النضح بالماء ‏.‏",
      "text_en": " Sahl bin Hunaif said:                     \"I suffered from a severe and troubling case of Al-Madhi. I was performing Ghusl often because of it. So I mentioned that to Allah's Messenger and asked him about it. He said: \"You only need to perform Wudu for that.\" I said: \"O Messenger of Allah! How about when it gets on my clothes?\" He said: \"It is sufficient for you to take a handful of water and sprinkle it n your garment wherever you see that it has touched it.\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20337",
        "11107",
        "12138",
        "11203",
        "403"
      ]
    },
    {
      "id": "sunan-an-nasai-699",
      "hadith_no": "699",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Masjids - كتاب المساجد",
      "chapter_no": "8",
      "text_ar": "أخبرنا قتيبة، قال حدثنا مجمع بن يعقوب، عن محمد بن سليمان الكرماني، قال سمعت أبا أمامة بن سهل بن حنيف، قال قال أبي قال رسول الله صلى الله عليه وسلم ‏\"‏ من خرج حتى يأتي هذا المسجد مسجد قباء فصلى فيه كان له عدل عمرة ‏\"‏ ‏.‏",
      "text_en": " Abu Umamah bin Sahl bin Hunaif said:                      \"My father said: 'The Messenger of Allah (ﷺ) said: 'Whoever goes out to his Masjid - the Masjid of Quba' and prays therein, that will be equivalent to 'Umrah.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "22207",
        "12461",
        "405",
        "403"
      ]
    },
    {
      "id": "sunan-ibn-majah-545",
      "hadith_no": "545",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو كريب، حدثنا عبد الله بن المبارك، وعبدة بن سليمان، عن محمد بن إسحاق، حدثنا سعيد بن عبيد بن السباق، عن أبيه، عن سهل بن حنيف، قال كنت ألقى من المذى شدة فأكثر منه الاغتسال فسألت رسول الله  صلى الله عليه وسلم  فقال ‏\"‏ إنما يجزيك من ذلك الوضوء ‏\"‏ ‏.‏ قلت يا رسول الله كيف بما يصيب ثوبي قال ‏\"‏ إنما يكفيك كف من ماء تنضح به من ثوبك حيث ترى أنه أصاب ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Sahl bin Hunaif said:                     \"I used to suffer from a great deal of prostatic fluid, and I took many baths because of that. I asked the messenger of Allah about that, and he said: 'Ablution is sufficient for you in this case.' I said: 'O Messenger of Allah! What about the prostatic fluid that gets onto my clothes?' he said: 'it is sufficient for you to pour a handful of water on the part of your clothes wherever you see it has reached.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20025",
        "20337",
        "11107",
        "12138",
        "11203",
        "403"
      ]
    },
    {
      "id": "sunan-ibn-majah-1477",
      "hadith_no": "1477",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا هشام بن عمار، حدثنا حاتم بن إسماعيل، وعيسى بن يونس، قالا حدثنا محمد بن سليمان الكرماني، قال سمعت أبا أمامة بن سهل بن حنيف، يقول قال سهل بن حنيف قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من تطهر في بيته ثم أتى مسجد قباء فصلى فيه صلاة كان له كأجر عمرة ‏\"‏ ‏.‏",
      "text_en": " (Sahl)bin Hunaif said:                      “The Messenger of Allah (ﷺ) said: ‘Whoeverpurifies himself in his house, then comes to the Quba’ Mosque andoffers one prayer therein, will have a reward like that for ‘Umrah.”",
      "usc_msa_ref": "",
      "chain": [
        "30288",
        "20159",
        "20347",
        "12461",
        "405",
        "403"
      ]
    }
  ],
  "total_hadiths": 19
}