{
  "id": "404",
  "name": "'Uthman bin Hunayf ( عثمان بن حنيف ( رضي الله عنه",
  "full_name": "'Uthman bin Hunayf ( عثمان بن حنيف ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medinah"
    },
    "death": {
      "date_hijri": "50",
      "date_gregorian": "670",
      "date_display": null,
      "place": "Medina/Kufa",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina",
      "Kufa"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ بخ  ت  س  ق  -  صحابي ]",
      "Governor"
    ],
    "tags": [
      "Ansar",
      "Aws",
      "B.'Amr B.'Auf",
      "B.Hanash",
      "Uhud",
      "Khandaq"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [
    {
      "id": "403",
      "name": "Sahl bin Hunayf ( سهل بن حنيف ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "406",
      "name": "'Abbad bin Hunayf ( عباد بن حنيف ( رضي الله عنه",
      "grade": "Comp.(RA)"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "students": [
    {
      "id": "405",
      "name": "Abu Umama bin Sahl ( أسعد أبو أمامة بن سهل بن حنيف ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11004",
      "name": "'Ubaydullah bin 'Abdullah bin 'Utba عبيد الله بن عبد الله بن عتبة بن مسعود",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19817",
      "name": "'Ammara bin Khuzayma bin Thabit عمارة بن خزيمة بن ثابت الأنصاري الأوسي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "12552",
      "name": "Nawful bin Masahiq bin 'Abdullah نوفل بن مساحق بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "id": "jami-al-tirmidhi-3578-2",
      "hadith_no": "3578",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا عثمان بن عمر، حدثنا شعبة، عن أبي جعفر، عن عمارة بن خزيمة بن ثابت، عن عثمان بن حنيف، أن رجلا، ضرير البصر أتى النبي صلى الله عليه وسلم فقال ادع الله أن يعافيني ‏.‏ قال ‏\"‏ إن شئت دعوت وإن شئت صبرت فهو خير لك ‏\"‏ ‏.‏ قال فادعه ‏.‏ قال فأمره أن يتوضأ فيحسن وضوءه ويدعو بهذا الدعاء ‏\"‏ اللهم إني أسألك وأتوجه إليك بنبيك محمد نبي الرحمة إني توجهت بك إلى ربي في حاجتي هذه لتقضى لي اللهم فشفعه في ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح غريب لا نعرفه إلا من هذا الوجه من حديث أبي جعفر وهو غير الخطمي وعثمان بن حنيف هو أخو سهل بن حنيف ‏.‏",
      "text_en": " Uthman bin Hunaif narrated that a blind man came to the Prophet and said:                     “Supplicate to Allah to heal me.” He said: “If you wish I will supplicate for you, and if you wish, you can be patient, for that is better for you.” He said: “Then supplicate to Him.” He said: “So he ordered him to perform Wudu and to make his Wudu complete, and to supplicate with this supplication: ‘O Allah, I ask You and turn towards You by Your Prophet Muhammad, the Prophet of Mercy. Indeed, I have turned to my Lord, by means of You, concerning this need of mine, so that it can be resolved, so O Allah so accept his intercession for me (Allahumma Inni As’aluka Wa Atawajjahu Ilaika Binabiyyka Muhammadin Nabi-Ir-Rahmati Tawajjahtu Bika Ila Rabbi Fi Hajati Hadhihi Lituqda Li, Allahumma Fashaffi’hu Fiya).’”",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20262",
        "20020",
        "19817",
        "404"
      ]
    },
    {
      "id": "sunan-ibn-majah-1448",
      "hadith_no": "1448",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أحمد بن منصور بن سيار، حدثنا عثمان بن عمر، حدثنا شعبة، عن أبي جعفر المدني، عن عمارة بن خزيمة بن ثابت، عن عثمان بن حنيف، أن رجلا، ضرير البصر أتى النبي  صلى الله عليه وسلم  فقال ادع الله لي أن يعافيني ‏.‏ فقال ‏\"‏ إن شئت أخرت لك وهو خير وإن شئت دعوت ‏\"‏ ‏.‏ فقال ادعه ‏.‏ فأمره أن يتوضأ فيحسن وضوءه ويصلي ركعتين ويدعو بهذا الدعاء ‏\"‏ اللهم إني أسألك وأتوجه إليك بمحمد نبي الرحمة يا محمد إني قد توجهت بك إلى ربي في حاجتي هذه لتقضى اللهم فشفعه في ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Uthman bin Hunaif that a blind man came to theProphet (ﷺ) and said:                      “Pray to Allah to heal me.” He said: “Ifyouwish to store your reward for the Hereafter, that is better, orif youwish, I will supplicate for you.” He said: “Supplicate.”So he toldhim to perform ablution and do it well, and to pray twoRak’ah, and tosay this supplication: “Allahumma inni as’alukawa atawajjahu ilaikabimuhammadin nabiyyir-rahman. Ya Muhammadu inniqad tawajjahtu bikaila rabbi fi hajati hadhihi lituqda. Allahummafashaffi’hu fiya (OAllah, I ask of You and I turn my face towardsYou by virtue of theintercession of Muhammad the Prophet of mercy. OMuhammad, I haveturned to my Lord by virtue of your intercessionconcerning this needof mine so that it may be met. O Allah, accepthis intercessionconcerning me)”.",
      "usc_msa_ref": "",
      "chain": [
        "20262",
        "20020",
        "19817",
        "404"
      ]
    }
  ],
  "total_hadiths": 2
}