{
  "id": "4044",
  "name": "Abu Waqid al-Laithi ( أبو واقد الليثي ( رضي الله عنه",
  "full_name": "Abu Waqid al-Laithi ( أبو واقد الليثي ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Hijaz"
    },
    "death": {
      "date_hijri": "65",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Medina/Funj",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina",
      "Makkah"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ ع  -  صحابي ]"
    ],
    "tags": [
      "B.Kinan",
      "Laith",
      "Non-Quraish",
      "Early Muslim",
      "Conquest",
      "Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "2",
      "name": "Abu Bakr Al-Siddique ( أبو بكر الصديق ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3",
      "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "19124",
      "name": "Waqd bin Abi Waqd واقد بن أبي واقد الليثي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11004",
      "name": "'Ubaydullah bin 'Abdullah bin 'Utba عبيد الله بن عبد الله بن عتبة بن مسعود",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11237",
      "name": "Abu Murrah, Client of Umm Hani يزيد أبو مرة مولى",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11020",
      "name": "'Ata ibn Yasar عطاء بن يسار أبو محمد مولى ميمونة",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11511",
      "name": "Sinan bin Abi Sinan سنان بن أبي سنان الديلي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10511",
      "name": "'Urwa ibn al-Zubayr عروة بن الزبير",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "66",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن إسحاق بن عبد الله بن أبي طلحة، أن أبا مرة، مولى عقيل بن أبي طالب أخبره عن أبي واقد الليثي، أن رسول الله صلى الله عليه وسلم بينما هو جالس في المسجد والناس معه، إذ أقبل ثلاثة نفر، فأقبل اثنان إلى رسول الله صلى الله عليه وسلم وذهب واحد، قال فوقفا على رسول الله صلى الله عليه وسلم فأما أحدهما فرأى فرجة في الحلقة فجلس فيها، وأما الآخر فجلس خلفهم، وأما الثالث فأدبر ذاهبا، فلما فرغ رسول الله صلى الله عليه وسلم قال ‏\"‏ ألا أخبركم عن النفر الثلاثة أما أحدهم فأوى إلى الله، فآواه الله، وأما الآخر فاستحيا، فاستحيا الله منه، وأما الآخر فأعرض، فأعرض الله عنه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Waqid Al-Laithi:                     While Allah's Apostle was sitting in the mosque with some people, three men came. Two of them came in front of Allah's Apostle and the third one went away. The two persons kept on standing before Allah's Apostle for a while and then one of them found a place in the circle and sat there while the other sat behind the gathering, and the third one went away. When Allah's Apostle finished his preaching, he said, \"Shall I tell you about these three persons? One of them betook himself to Allah, so Allah took him into His grace and mercy and accommodated him, the second felt shy from Allah, so Allah sheltered Him in His mercy (and did not punish him), while the third turned his face from Allah and went away, so Allah turned His face from him likewise. \"",
      "chain": [
        "30103",
        "20001",
        "11151",
        "11237",
        "4044"
      ]
    },
    {
      "hadith_no": "474",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن إسحاق بن عبد الله بن أبي طلحة، أن أبا مرة، مولى عقيل بن أبي طالب أخبره عن أبي واقد الليثي، قال بينما رسول الله صلى الله عليه وسلم في المسجد فأقبل ثلاثة نفر، فأقبل اثنان إلى رسول الله صلى الله عليه وسلم وذهب واحد، فأما أحدهما فرأى فرجة فجلس، وأما الآخر فجلس خلفهم، فلما فرغ رسول الله صلى الله عليه وسلم قال ‏\"‏ ألا أخبركم عن الثلاثة أما أحدهم فأوى إلى الله، فآواه الله، وأما الآخر فاستحيا، فاستحيا الله منه، وأما الآخر فأعرض، فأعرض الله عنه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Waqid al-Laithi:                     While Allah's Apostle was sitting in the mosque (with some people) three men came, two of them came in front of Allah's Apostle and the third one went away, and then one of them found a place in the circle and sat there while the second man sat behind the gathering, and the third one went away. When Allah's Apostle finished his preaching, he said, \"Shall I tell you about these three persons? One of them betook himself to Allah and so Allah accepted him and accommodated him; the second felt shy before Allah so Allah did the same for him and sheltered him in His Mercy (and did not punish him), while the third turned his face from Allah, and went away, so Allah turned His face from him likewise.",
      "chain": [
        "30355",
        "20001",
        "11151",
        "11237",
        "4044"
      ]
    },
    {
      "hadith_no": "2096",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Two Eids) - كتاب صلاة العيدين",
      "chapter_no": "9",
      "text_ar": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن ضمرة بن سعيد المازني، عن عبيد الله بن عبد الله، أن عمر بن الخطاب، سأل أبا واقد الليثي ما كان يقرأ به رسول الله صلى الله عليه وسلم في الأضحى والفطر فقال كان يقرأ فيهما ب ‏{‏ ق والقرآن المجيد‏}‏  و ‏{‏ اقتربت الساعة وانشق القمر‏}‏",
      "text_en": " 'Abdullah b. 'Umar reported that (his father) 'Umar b. Khattab asked Abu Waqid al-Laithi what the Messenger of Allah (may peace be upon him) used to recite on 'Id-ul-Adha and 'Id-ul-Fitr. He said:                      He used to recite in them:\" Qaf. By the Glorious Qur'an\" (Surah 1),\" The Hour drew near, and the moon was rent asunder\" (Surah liv.).",
      "chain": [
        "30399",
        "11861",
        "11004",
        "3",
        "4044"
      ]
    },
    {
      "hadith_no": "2097",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Two Eids) - كتاب صلاة العيدين",
      "chapter_no": "9",
      "text_ar": "وحدثنا إسحاق بن إبراهيم، أخبرنا أبو عامر العقدي، حدثنا فليح، عن ضمرة، بن سعيد عن عبيد الله بن عبد الله بن عتبة، عن أبي واقد الليثي، قال سألني عمر بن الخطاب عما قرأ به رسول الله صلى الله عليه وسلم في يوم العيد فقلت ب ‏{‏ اقتربت الساعة‏}‏ و ‏{‏ ق والقرآن المجيد‏}‏",
      "text_en": " 'Utba reported that his father Waqid al-Laithi said:                      'Umar b. Khattab asked me what the Messenger of Allah (may peace be upon him) recited on 'Id day. I said:\" The Hour drew near\" and Qaf. By the Glorious Qur'an\".",
      "chain": [
        "30123",
        "20443",
        "20169",
        "11861",
        "11004",
        "4044"
      ]
    },
    {
      "hadith_no": "1154",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا القعنبي، عن مالك، عن ضمرة بن سعيد المازني، عن عبيد الله بن عبد الله بن عتبة بن مسعود، أن عمر بن الخطاب، سأل أبا واقد الليثي ماذا كان يقرأ به رسول الله صلى الله عليه وسلم في الأضحى والفطر قال كان يقرأ فيهما ‏{‏ ق والقرآن المجيد ‏}‏ و ‏{‏ اقتربت الساعة وانشق القمر ‏}‏ ‏.‏",
      "text_en": " 'Ubaid Allah b. 'Abd Allah b. 'Utbah b. Mas'ud said:                      'Umar b. al-Khattab asked Abu Waqid al-Laithi: What did the Messenger of Allah (ﷺ) recite during the prayer on the day of sacrifice and on the breaking of the fast ? He replied: He recited at both of them Surah al-Qaf, \"By the Glorious Quran\" [50] and the Surah \"The Hour is nigh\" (54).",
      "chain": [
        "20164",
        "20001",
        "11861",
        "11004",
        "3",
        "4044"
      ]
    },
    {
      "hadith_no": "1722",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا النفيلي، حدثنا عبد العزيز بن محمد، عن زيد بن أسلم، عن ابن لأبي، واقد الليثي، عن أبيه، قال سمعت رسول الله صلى الله عليه وسلم يقول لأزواجه في حجة الوداع ‏\"‏ هذه ثم ظهور الحصر ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Waqid al-Laythi:                     I heard the Messenger of Allah (ﷺ) saying to his wives during the Farewell Pilgrimage: This (is the pilgrimage for you); afterwards stick to the surface of the mats (i.e. should stay at home).",
      "chain": [
        "30352",
        "20167",
        "11163",
        "4044"
      ]
    },
    {
      "hadith_no": "534",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on the Two Eids - أَبْوَابُ الْعِيدَيْنِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
      "chapter_no": "5",
      "text_ar": "حدثنا إسحاق بن موسى الأنصاري، حدثنا معن بن عيسى، حدثنا مالك بن أنس، عن ضمرة بن سعيد المازني، عن عبيد الله بن عبد الله بن عتبة، أن عمر بن الخطاب، سأل أبا واقد الليثي ما كان رسول الله صلى الله عليه وسلم يقرأ به في الفطر والأضحى قال كان يقرأ ب‏(‏ق والقرآن المجيد ‏)‏ ‏(‏اقتربت الساعة وانشق القمر ‏)‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Ubaidullah bin Abdullah bin Utbah narrated:                     \"Umar bin Al-Khattab asked Abu Waqid Al-Laithi what Allah's Messenger would recite during Al-Fitr and Al-Adha, so he said: 'He would recite: Qaf, By the Glorious Quran and the Hour has drawn near, and the moon has been cleft asunder.'\"",
      "chain": [
        "30410",
        "30112",
        "20001",
        "11861",
        "11004",
        "3",
        "4044"
      ]
    },
    {
      "hadith_no": "1480",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hunting - كتاب الصيد والذبائح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "18",
      "text_ar": "حدثنا محمد بن عبد الأعلى الصنعاني، حدثنا سلمة بن رجاء، قال حدثنا عبد الرحمن بن عبد الله بن دينار، عن زيد بن أسلم، عن عطاء بن يسار، عن أبي واقد الليثي، قال قدم النبي صلى الله عليه وسلم المدينة وهم يجبون أسنمة الإبل ويقطعون أليات الغنم قال ‏\"‏ ما قطع من البهيمة وهي حية فهو ميتة ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Waqid Al-Laithi:                     \"The Prophet (ﷺ) came to Al-Madinah and they were in the habit of cutting the humps off of the camels and cutting the buttocks from the sheep. He said: 'Whatever is cut from an animal while it is alive, then it is dead flesh.'\"",
      "chain": [
        "20325",
        "20439",
        "11163",
        "11020",
        "4044"
      ]
    },
    {
      "hadith_no": "2180",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا سعيد بن عبد الرحمن المخزومي، حدثنا سفيان، عن الزهري، عن سنان بن أبي سنان، عن أبي واقد الليثي، أن رسول الله صلى الله عليه وسلم لما خرج إلى خيبر مر بشجرة للمشركين يقال لها ذات أنواط يعلقون عليها أسلحتهم فقالوا يا رسول الله اجعل لنا ذات أنواط كما لهم ذات أنواط ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ سبحان الله هذا كما قال قوم موسى ‏:‏ ‏(‏اجعل لنا إلها كما لهم آلهة ‏)‏ والذي نفسي بيده لتركبن سنة من كان قبلكم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وأبو واقد الليثي اسمه الحارث بن عوف ‏.‏ وفي الباب عن أبي سعيد وأبي هريرة ‏.‏",
      "text_en": " Abu Waqid Al-Laithi narrated that when the Messenger of Allah (s.a.w) went out to Hunain he passed a tree that the idolaters called Dhat Anwat upon which they hung their weapons. They(the Companions) said:                     \"O Messenger of Allah! Make a Dhat Anwat for us as they have a Dhat Anwat.' The Prophet (s.a.w) said: \"Subhan Allah! This is like what Musa's people said: Make for us a god like their gods. By the One in Whose is my soul! You shall follow the way of those who were before you.\"",
      "chain": [
        "38231",
        "20005",
        "11013",
        "11511",
        "4044"
      ]
    },
    {
      "hadith_no": "2724",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Seeking Permission - كتاب الاستئذان والآداب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "42",
      "text_ar": "حدثنا الأنصاري، حدثنا معن، حدثنا مالك، عن إسحاق بن عبد الله بن أبي طلحة، عن أبي مرة، مولى عقيل بن أبي طالب عن أبي واقد الليثي، أن رسول الله صلى الله عليه وسلم بينما هو جالس في المسجد والناس معه إذ أقبل ثلاثة نفر فأقبل اثنان إلى رسول الله صلى الله عليه وسلم وذهب واحد فلما وقفا على رسول الله صلى الله عليه وسلم سلما فأما أحدهما فرأى فرجة في الحلقة فجلس فيها وأما الآخر فجلس خلفهم وأما الآخر فأدبر ذاهبا فلما فرغ رسول الله صلى الله عليه وسلم قال ‏\"‏ ألا أخبركم عن النفر الثلاثة أما أحدهم فأوى إلى الله فآواه الله وأما الآخر فاستحيا فاستحيا الله منه وأما الآخر فأعرض فأعرض الله عنه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وأبو واقد الليثي اسمه الحارث بن عوف وأبو مرة مولى أم هانئ بنت أبي طالب واسمه يزيد ويقال مولى عقيل بن أبي طالب ‏.‏",
      "text_en": " Narrated Abu Waqid Al-Laithi:                     \"The Messenger of Allah (ﷺ) was sitting in the Masjid and the people were with him when three people came. Two of them came near the Messenger of Allah (ﷺ) and one went away. When the two stopped at the Messenger of Allah (ﷺ) the said the Salam. One of them saw an opening in the circle so he sat there. As for the other one, he sat behind them, and the other one went way in the rear. When the Messenger of Allah (ﷺ) had finished, he said: 'Shall I inform you about the three people? As for one of them, he took himself to Allah so Allah took him. The other, he was shy so Allah (had mercy) on him. As for the other one, he turned away, so Allah turned away from him.'\"",
      "chain": [
        "20280",
        "30112",
        "20001",
        "11151",
        "11237",
        "4044"
      ]
    }
  ],
  "total_hadiths": 10
}