{
  "id": "4047",
  "name": "Abu Juhayfa al-Sawai' ( أبو جحيفة السوائي ( رضي الله عنه",
  "full_name": "Abu Juhayfa al-Sawai' ( أبو جحيفة السوائي ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Hijaz"
    },
    "death": {
      "date_hijri": "74",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Kufa",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina",
      "Kufa"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ ع  -  صحابي ]"
    ],
    "tags": [
      "B.'Amir B.Sa'sa'a",
      "al-Sawai'",
      "Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "11383",
      "name": "Awn bin Abi Juhayfa عون بن أبي جحيفة",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "5",
      "name": "Ali ibn Abi Talib ( علي بن أبي طالب بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "400",
      "name": "al-Bara' bin Azib bin al-Harith ( البراء بن عازب بن الحارث ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11383",
      "name": "Awn bin Abi Juhayfa عون بن أبي جحيفة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11350",
      "name": "Salmah bin Kahayl al-Hadrami سلمة بن كهيل بن حصين",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11052",
      "name": "'Amir al-Sha'bi عامر الشعبي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11049",
      "name": "Abu Ishaq al-Sabay'ai' أبو إسحاق السبيعي عمرو بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11418",
      "name": "Isma'il bin Abi Khalid al-Ahmsi إسماعيل بن أبي خالد الأحمسي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11375",
      "name": "'Ali bin al-Aqmar bin 'Amr علي بن الأقمر بن عمرو",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11069",
      "name": "al-Hakam bin 'Utayba الحكم بن عتيبة",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "111",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن سلام، قال أخبرنا وكيع، عن سفيان، عن مطرف، عن الشعبي، عن أبي جحيفة، قال قلت لعلي هل عندكم كتاب قال لا، إلا كتاب الله، أو فهم أعطيه رجل مسلم، أو ما في هذه الصحيفة‏.‏ قال قلت فما في هذه الصحيفة قال العقل، وفكاك الأسير، ولا يقتل مسلم بكافر‏.‏",
      "text_en": " Narrated Ash-Shu`bi:                     Abu Juhaifa said, \"I asked `Ali, 'Have you got any book (which has been revealed to the Prophet apart from the Qur'an)?' `Ali replied, 'No, except Allah's Book or the power of understanding which has been bestowed (by Allah) upon a Muslim or what is (written) in this sheet of paper (with me).' Abu Juhaifa said, \"I asked, 'What is (written) in this sheet of paper?' `Ali replied, it deals with The Diyya (compensation (blood money) paid by the killer to the relatives of the victim), the ransom for the releasing of the captives from the hands of the enemies, and the law that no Muslim should be killed in Qisas (equality in punishment) for the killing of (a disbeliever).",
      "chain": [
        "30376",
        "20032",
        "20012",
        "11395",
        "11052",
        "4047"
      ]
    },
    {
      "hadith_no": "187",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا آدم، قال حدثنا شعبة، قال حدثنا الحكم، قال سمعت أبا جحيفة، يقول خرج علينا رسول الله صلى الله عليه وسلم بالهاجرة، فأتي بوضوء فتوضأ، فجعل الناس يأخذون من فضل وضوئه فيتمسحون به، فصلى النبي صلى الله عليه وسلم الظهر ركعتين والعصر ركعتين، وبين يديه عنزة‏.‏",
      "text_en": " Narrated Abu Juhaifa:                     Allah's Apostle came to us at noon and water for ablution was brought to him. After he had performed ablution, the remaining water was taken by the people and they started smearing their bodies with it (as a blessed thing). The Prophet offered two rak`at of the Zuhr prayer and then two rak`at of the `Asr prayer while a short spear (or stick) was there (as a Sutra) in front of him.",
      "chain": [
        "20404",
        "20020",
        "11069",
        "4047"
      ]
    },
    {
      "hadith_no": "376",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا محمد بن عرعرة، قال حدثني عمر بن أبي زائدة، عن عون بن أبي جحيفة، عن أبيه، قال رأيت رسول الله صلى الله عليه وسلم في قبة حمراء من أدم، ورأيت بلالا أخذ وضوء رسول الله صلى الله عليه وسلم ورأيت الناس يبتدرون ذاك الوضوء، فمن أصاب منه شيئا تمسح به، ومن لم يصب منه شيئا أخذ من بلل يد صاحبه، ثم رأيت بلالا أخذ عنزة فركزها، وخرج النبي صلى الله عليه وسلم في حلة حمراء مشمرا، صلى إلى العنزة بالناس ركعتين، ورأيت الناس والدواب يمرون من بين يدى العنزة‏.‏",
      "text_en": " Narrated Abu Juhaifa:                     I saw Allah's Apostle in a red leather tent and I saw Bilal taking the remaining water with which the Prophet had performed ablution. I saw the people taking the utilized water impatiently and whoever got some of it rubbed it on his body and those who could not get any took the moisture from the others' hands. Then I saw Bilal carrying a short spear (or stick) which he planted in the ground. The Prophet came out tucking up his red cloak, and led the people in prayer and offered two rak`at (facing the Ka`ba) taking a short spear (or stick) as a Sutra for his prayer. I saw the people and animals passing in front of him beyond the stick.",
      "chain": [
        "20282",
        "11643",
        "11383",
        "4047"
      ]
    },
    {
      "hadith_no": "495",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا أبو الوليد، قال حدثنا شعبة، عن عون بن أبي جحيفة، قال سمعت أبي أن النبي صلى الله عليه وسلم صلى بهم بالبطحاء  وبين يديه عنزة  الظهر ركعتين، والعصر ركعتين، تمر بين يديه المرأة والحمار‏.‏",
      "text_en": " Narrated `Aun bin Abi Juhaifa:                     I heard my father saying, \"The Prophet led us, and prayed a two-rak`at Zuhr prayer and then a tworak` at `Asr prayer at Al-Batha' [??] with a short spear (planted) in front of him (as a Sutra) while women and donkeys were passing in front of him (beyond that stick).",
      "chain": [
        "20296",
        "20020",
        "11383",
        "4047"
      ]
    },
    {
      "hadith_no": "499",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا آدم، قال حدثنا شعبة، قال حدثنا عون بن أبي جحيفة، قال سمعت أبي قال، خرج علينا رسول الله صلى الله عليه وسلم بالهاجرة، فأتي بوضوء فتوضأ فصلى بنا الظهر والعصر وبين يديه عنزة، والمرأة والحمار يمرون من ورائها‏.‏",
      "text_en": " Narrated `Aun bin Abi Juhaifa:                     that he had heard his father saying, \"Allah's Apostle came to us at midday and water was brought for his ablution. He performed ablution and led us in Zuhr and `Asr prayers with a short stpear (or stick) planted in front of him (as a Sutra), while women and donkeys were passing beyond it.\"",
      "chain": [
        "20404",
        "20020",
        "11383",
        "4047"
      ]
    },
    {
      "hadith_no": "501",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا شعبة، عن الحكم، عن أبي جحيفة، قال خرج رسول الله صلى الله عليه وسلم بالهاجرة فصلى بالبطحاء الظهر والعصر ركعتين، ونصب بين يديه عنزة، وتوضأ، فجعل الناس يتمسحون بوضوئه‏.‏",
      "text_en": " Narrated Abu Juhaifa:                     Allah's Apostle came out at midday and offered a two-rak`at Zuhr and `Asr prayers at Al-Batha and a short spear (or stick) was planted in front of him (as a Sutra). He performed ablution and the people took the remaining water left after his ablution and rubbed their bodies with it.",
      "chain": [
        "20193",
        "20020",
        "11069",
        "4047"
      ]
    },
    {
      "hadith_no": "633",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا إسحاق، قال أخبرنا جعفر بن عون، قال حدثنا أبو العميس، عن عون بن أبي جحيفة، عن أبيه، قال رأيت رسول الله صلى الله عليه وسلم بالأبطح فجاءه بلال فآذنه بالصلاة، ثم خرج بلال بالعنزة حتى ركزها بين يدى رسول الله صلى الله عليه وسلم بالأبطح وأقام الصلاة‏.‏",
      "text_en": " Narrated `Aun bin Abi Juhaifa:                     My father said, \"I saw Allah's Apostle at a place called Al-Abtah. Bilal came and informed him about the prayer and then came out with a short spear (or stick) and planted it in front of Allah's Apostle at Al-Abtah and pronounced the Iqama.\"",
      "chain": [
        "30021",
        "20416",
        "20342",
        "11383",
        "4047"
      ]
    },
    {
      "hadith_no": "634",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن يوسف، قال حدثنا سفيان، عن عون بن أبي جحيفة، عن أبيه، أنه رأى بلالا يؤذن فجعلت أتتبع فاه ها هنا وها هنا بالأذان‏.‏",
      "text_en": " Narrated `Aun bin Abi Juhaifa:                     My father said, \"I saw Bilal turning his face from side to side while pronouncing the Adhan for the prayer.\"",
      "chain": [
        "30388",
        "20005",
        "11383",
        "4047"
      ]
    },
    {
      "hadith_no": "1375",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا يحيى، حدثنا شعبة، قال حدثني عون بن أبي جحيفة، عن أبيه، عن البراء بن عازب، عن أبي أيوب  رضى الله عنهم  قال خرج النبي صلى الله عليه وسلم وقد وجبت الشمس، فسمع صوتا فقال ‏\"‏ يهود تعذب في قبورها ‏\"‏‏.‏   وقال النضر أخبرنا شعبة، حدثنا عون، سمعت أبي، سمعت البراء، عن أبي أيوب  رضى الله عنهما  عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Abi Aiyub:                     Once the Prophet went out after sunset and heard a dreadful voice, and said, \"The Jews are being punished in their graves.\"",
      "chain": [
        "30170",
        "20031",
        "20020",
        "11383",
        "4047",
        "400",
        "33"
      ]
    },
    {
      "hadith_no": "1968",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا محمد بن بشار، حدثنا جعفر بن عون، حدثنا أبو العميس، عن عون بن أبي جحيفة، عن أبيه، قال آخى النبي صلى الله عليه وسلم بين سلمان، وأبي الدرداء، فزار سلمان أبا الدرداء، فرأى أم الدرداء متبذلة‏.‏ فقال لها ما شأنك قالت أخوك أبو الدرداء ليس له حاجة في الدنيا‏.‏ فجاء أبو الدرداء، فصنع له طعاما‏.‏ فقال كل‏.‏ قال فإني صائم‏.‏ قال ما أنا بآكل حتى تأكل‏.‏ قال فأكل‏.‏ فلما كان الليل ذهب أبو الدرداء يقوم‏.‏ قال نم‏.‏ فنام، ثم ذهب يقوم‏.‏ فقال نم‏.‏ فلما كان من آخر الليل قال سلمان قم الآن‏.‏ فصليا، فقال له سلمان إن لربك عليك حقا، ولنفسك عليك حقا، ولأهلك عليك حقا، فأعط كل ذي حق حقه‏.‏ فأتى النبي صلى الله عليه وسلم فذكر ذلك له، فقال النبي صلى الله عليه وسلم ‏\"‏ صدق سلمان ‏\"‏‏.‏",
      "text_en": " Narrated Abu Juhaifa:                     The Prophet made a bond of brotherhood between Salman and Abu Ad-Darda.' Salman paid a visit to Abu Ad-Darda' and found Um Ad-Darda' dressed in shabby clothes and asked her why she was in that state. She replied, \"Your brother Abu Ad-Darda' is not interested in (the luxuries of) this world.\" In the meantime Abu Ad-Darda' came and prepared a meal for Salman. Salman requested Abu Ad- Darda' to eat (with him), but Abu Ad-Darda' said, \"I am fasting.\" Salman said, \"I am not going to eat unless you eat.\" So, Abu Ad-Darda' ate (with Salman). When it was night and (a part of the night passed), Abu Ad-Darda' got up (to offer the night prayer), but Salman told him to sleep and Abu Ad- Darda' slept. After sometime Abu Ad-Darda' again got up but Salman told him to sleep. When it was the last hours of the night, Salman told him to get up then, and both of them offered the prayer. Salman told Abu Ad-Darda', \"Your Lord has a right on you, your soul has a right on you, and your family has a right on you; so you should give the rights of all those who has a right on you.\" Abu Ad- Darda' came to the Prophet and narrated the whole story. The Prophet said, \"Salman has spoken the truth.\"",
      "chain": [
        "30160",
        "20416",
        "20342",
        "11383",
        "4047"
      ]
    },
    {
      "hadith_no": "3047",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زهير، حدثنا مطرف، أن عامرا، حدثهم عن أبي جحيفة  رضى الله عنه  قال قلت لعلي  رضى الله عنه هل عندكم شىء من الوحى إلا ما في كتاب الله قال والذي فلق الحبة وبرأ النسمة ما أعلمه إلا فهما يعطيه الله رجلا في القرآن، وما في هذه الصحيفة‏.‏ قلت وما في الصحيفة قال العقل وفكاك الأسير، وأن لا يقتل مسلم بكافر‏.‏",
      "text_en": " Narrated Abu Juhaifa:                     I asked `Ali, \"Do you have the knowledge of any Divine Inspiration besides what is in Allah's Book?\" `Ali replied, \"No, by Him Who splits the grain of corn and creates the soul. I don't think we have such knowledge, but we have the ability of understanding which Allah may endow a person with, so that he may understand the Qur'an, and we have what is written in this paper as well.\" I asked, \"What is written in this paper?\" He replied, \"(The regulations of) blood-money, the freeing of captives, and the judgment that no Muslim should be killed for killing an infidel.\"",
      "chain": [
        "30184",
        "20321",
        "11395",
        "4047"
      ]
    },
    {
      "hadith_no": "3583",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زهير، حدثنا إسماعيل، عن أبي جحيفة  رضى الله عنه  قال رأيت النبي صلى الله عليه وسلم وكان الحسن يشبهه‏.‏",
      "text_en": " Narrated Abu Juhaifa:                     I saw the Prophet, and Al-Hasan resembled him.",
      "chain": [
        "30184",
        "20321",
        "20208",
        "4047"
      ]
    },
    {
      "hadith_no": "3584",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثني عمرو بن علي، حدثنا ابن فضيل، حدثنا إسماعيل بن أبي خالد، قال سمعت أبا جحيفة  رضى الله عنه  قال رأيت النبي صلى الله عليه وسلم وكان الحسن بن علي  عليهما السلام  يشبهه قلت لأبي جحيفة صفه لي‏.‏ قال كان أبيض قد شمط‏.‏ وأمر لنا النبي صلى الله عليه وسلم بثلاث عشرة قلوصا قال فقبض النبي صلى الله عليه وسلم قبل أن نقبضها‏.‏",
      "text_en": " Narrated Isma`il bin Abi Khalid:                     I heard Abii Juhaifa saying, \"I saw the Prophet, and Al-Hasan bin `Ali resembled him.\" I said to Abu- Juhaifa, \"Describe him for me.\" He said, \"He was white and his beard was black with some white hair. He promised to give us 13 young she-camels, but he expired before we could get them.\"",
      "chain": [
        "30153",
        "20356",
        "11418",
        "4047"
      ]
    },
    {
      "hadith_no": "3593",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا الحسن بن منصور أبو علي، حدثنا حجاج بن محمد الأعور، بالمصيصة حدثنا شعبة، عن الحكم، قال سمعت أبا جحيفة، قال خرج رسول الله صلى الله عليه وسلم بالهاجرة إلى البطحاء فتوضأ ثم صلى الظهر ركعتين، والعصر ركعتين، وبين يديه عنزة‏.‏ ‏{‏قال شعبة‏}‏ وزاد فيه عون عن أبيه أبي جحيفة قال كان يمر من ورائها المرأة، وقام الناس فجعلوا يأخذون يديه، فيمسحون بها وجوههم، قال فأخذت بيده، فوضعتها على وجهي، فإذا هي أبرد من الثلج، وأطيب رائحة من المسك‏.‏",
      "text_en": " Narrated Abu Juhaifa:                     Once Allah's Apostle went to Al-Batha' at noon, performed the ablution and offered' a two rak`at Zuhr prayer and a two-rak`at `Asr prayer while a spearheaded stick was planted before him and the passersby were passing in front of it. (After the prayer), the people got up and held the hands of the Prophet and passed them on their faces. I also took his hand and kept it on my face and noticed that it was colder than ice, and its smell was nicer than musk.",
      "chain": [
        "20381",
        "20020",
        "11069",
        "4047"
      ]
    },
    {
      "hadith_no": "3607",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا الحسن بن الصباح، حدثنا محمد بن سابق، حدثنا مالك بن مغول، قال سمعت عون بن أبي جحيفة، ذكر عن أبيه، قال دفعت إلى النبي صلى الله عليه وسلم وهو بالأبطح في قبة كان بالهاجرة، خرج بلال فنادى بالصلاة، ثم دخل فأخرج فضل وضوء رسول الله صلى الله عليه وسلم، فوقع الناس عليه يأخذون منه، ثم دخل فأخرج العنزة، وخرج رسول الله صلى الله عليه وسلم كأني أنظر إلى وبيص ساقيه فركز العنزة، ثم صلى الظهر ركعتين والعصر ركعتين، يمر بين يديه الحمار والمرأة‏.‏",
      "text_en": " Narrated Abu Juhaifa:                     By chance I went to the Prophet at noon while he was at Al-Abtah (resting) in a tent. Bilal came out (of the tent) and pronounced the Adhan for the prayer, and entering again, he brought out the water which was left after Allah's Apostle had performed the ablution. The people rushed to take some of the water. Bilal again went in and brought out a spear-headed stick, and then Allah's Apostle came out. As if I were now looking at the whiteness of his leg. Bilal fixed the stick and the Prophet offered a two-rak`at Zuhr prayer and a two-rak`at `Asr prayer, while women and donkeys were passing in front of the Prophet (beyond the stick) .",
      "chain": [
        "30244",
        "30209",
        "20358",
        "11383",
        "4047"
      ]
    },
    {
      "hadith_no": "5401",
      "source": " Sahih Bukhari ",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا آدم، حدثنا شعبة، حدثنا عون بن أبي جحيفة، عن أبيه، قال لعن النبي صلى الله عليه وسلم الواشمة، والمستوشمة، وآكل الربا وموكله، ونهى عن ثمن الكلب، وكسب البغي، ولعن المصورين‏.‏",
      "text_en": " Narrated Abu Juhaifa:                     The Prophet cursed the lady who practices tattooing and the one who gets herself tattooed, and one who eats (takes) Riba' (usury) and the one who gives it. And he prohibited taking the price of a dog, and the money earned by prostitution, and cursed the makers of pictures.",
      "chain": [
        "20404",
        "20020",
        "11383",
        "4047"
      ]
    },
    {
      "hadith_no": "5453",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا أبو نعيم، حدثنا مسعر، عن علي بن الأقمر، سمعت أبا جحيفة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ لا آكل متكئا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Juhaifa:                     Allah's Apostle said, \"I do not take my meals while leaning (against something).",
      "chain": [
        "20348",
        "20359",
        "11375",
        "4047"
      ]
    },
    {
      "hadith_no": "5454",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثني عثمان بن أبي شيبة، أخبرنا جرير، عن منصور، عن علي بن الأقمر، عن أبي جحيفة، قال كنت عند النبي صلى الله عليه وسلم فقال لرجل عنده ‏\"‏ لا آكل وأنا متكئ ‏\"‏‏.‏",
      "text_en": " Narrated Abu Juhaifa:                     While I was with the Prophet he said to a man who was with him, \"I do not take my meals while leaning.\"",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11375",
        "4047"
      ]
    },
    {
      "hadith_no": "5615",
      "source": " Sahih Bukhari ",
      "chapter": "Al-Adha Festival Sacrifice (Adaahi) - كتاب الأضاحي",
      "chapter_no": "73",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن سلمة، عن أبي جحيفة، عن البراء، قال ذبح أبو بردة قبل الصلاة فقال له النبي صلى الله عليه وسلم ‏\"‏ أبدلها ‏\"‏‏.‏ قال ليس عندي إلا جذعة  قال شعبة وأحسبه قال  هي خير من مسنة‏.‏ قال ‏\"‏ اجعلها مكانها، ولن تجزي عن أحد بعدك ‏\"‏‏.‏",
      "text_en": " Narrated Al-Bara':                     Abu Burda slaughtered (the sacrifice) before the (`Id) prayer whereupon the Prophet said to him, \"Slaughter another sacrifice instead of that.\" Abu Burda said, \"I have nothing except a Jadha'a.\" (Shu`ba said: Perhaps Abu Burda also said that Jadha'a was better than an old sheep in his opinion.) The Prophet said, \"(Never mind), slaughter it to make up for the other one, but it will not be sufficient for anyone else after you.\"",
      "chain": [
        "30160",
        "20173",
        "20020",
        "237",
        "4047",
        "400"
      ]
    },
    {
      "hadith_no": "5920",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا محمد بن عرعرة، قال حدثني عمر بن أبي زائدة، عن عون بن أبي جحيفة، عن أبيه، قال أتيت النبي صلى الله عليه وسلم وهو في قبة حمراء من أدم، ورأيت بلالا أخذ وضوء النبي صلى الله عليه وسلم والناس يبتدرون الوضوء، فمن أصاب منه شيئا تمسح به، ومن لم يصب منه شيئا أخذ من بلل يد صاحبه‏.‏",
      "text_en": " Narrated Abu Juhaifa:                     I came to the Prophet while he was inside a red leather tent, and I saw Bilal taking the remaining water of the ablution of the Prophet, and the people were taking of that water and rubbing it on their faces; and whoever could not get anything of it, would share the moisture of the hand of his companion (and then rub it on his face).",
      "chain": [
        "20282",
        "11643",
        "11383",
        "4047"
      ]
    },
    {
      "hadith_no": "6028",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا محمد بن المثنى، قال حدثني غندر، حدثنا شعبة، عن عون بن أبي جحيفة، عن أبيه، أنه اشترى غلاما حجاما فقال إن النبي صلى الله عليه وسلم نهى عن ثمن الدم، وثمن الكلب، وكسب البغي، ولعن آكل الربا وموكله والواشمة والمستوشمة والمصور‏.‏",
      "text_en": " Narrated Abu Juhaifa:                     that he had bought a slave whose profession was cupping. The Prophet forbade taking the price of blood and the price of a dog and the earnings of a prostitute, and cursed the one who took or gave (Riba') usury, and the lady who tattooed others or got herself tattooed, and the picture-maker.",
      "chain": [
        "30170",
        "20278",
        "20020",
        "11383",
        "4047"
      ]
    },
    {
      "hadith_no": "6209",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا محمد بن بشار، حدثنا جعفر بن عون، حدثنا أبو العميس، عن عون بن أبي جحيفة، عن أبيه، قال آخى النبي صلى الله عليه وسلم بين سلمان وأبي الدرداء‏.‏ فزار سلمان أبا الدرداء فرأى أم الدرداء متبذلة فقال لها ما شأنك قالت أخوك أبو الدرداء ليس له حاجة في الدنيا‏.‏ فجاء أبو الدرداء فصنع له طعاما فقال كل فإني صائم‏.‏ قال ما أنا بآكل حتى تأكل‏.‏ فأكل، فلما كان الليل ذهب أبو الدرداء يقوم فقال نم‏.‏ فنام، ثم ذهب يقوم فقال نم‏.‏ فلما كان آخر الليل قال سلمان قم الآن‏.‏ قال فصليا فقال له سلمان إن لربك عليك حقا، ولنفسك عليك حقا، ولأهلك عليك حقا، فأعط كل ذي حق حقه‏.‏ فأتى النبي صلى الله عليه وسلم فذكر ذلك له‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ صدق سلمان ‏\"‏‏.‏ أبو جحيفة وهب السوائي، يقال وهب الخير‏.‏",
      "text_en": " Narrated Abu Juhaifa:                     The Prophet established a bond of brotherhood between Salman and Abu Darda'. Salman paid a visit to Abu ad-Darda and found Um Ad-Darda' dressed in shabby clothes and asked her why she was in that state.?\" She replied, \"Your brother, Abu Ad-Darda is not interested in the luxuries of this world.\" In the meantime Abu Ad-Darda came and prepared a meal for him (Salman), and said to him, \"(Please) eat for I am fasting.\" Salman said, \"I am not going to eat, unless you eat.\" So Abu Ad-Darda' ate. When it was night, Abu Ad-Darda' got up (for the night prayer). Salman said (to him), \"Sleep,\" and he slept. Again Abu- Ad-Darda' got up (for the prayer), and Salman said (to him), \"Sleep.\" When it was the last part of the night, Salman said to him, \"Get up now (for the prayer).\" So both of them offered their prayers and Salman said to Abu Ad-Darda',\"Your Lord has a right on you; and your soul has a right on you; and your family has a right on you; so you should give the rights of all those who have a right on you). Later on Abu Ad-Darda' visited the Prophet and mentioned that to him. The Prophet, said, \"Salman has spoken the truth.\"",
      "chain": [
        "30160",
        "20416",
        "20342",
        "11383",
        "4047"
      ]
    },
    {
      "hadith_no": "6988",
      "source": " Sahih Bukhari ",
      "chapter": "Blood Money (Ad-Diyat) - كتاب الديات",
      "chapter_no": "88",
      "text_ar": "حدثنا صدقة بن الفضل، أخبرنا ابن عيينة، حدثنا مطرف، قال سمعت الشعبي، قال سمعت أبا جحيفة، قال سألت عليا  رضى الله عنه  هل عندكم شىء ما ليس في القرآن وقال مرة ما ليس عند الناس فقال والذي فلق الحب وبرأ النسمة ما عندنا إلا ما في القرآن، إلا فهما يعطى رجل في كتابه، وما في الصحيفة‏.‏ قلت وما في الصحيفة قال العقل، وفكاك الأسير، وأن لا يقتل مسلم بكافر‏.‏",
      "text_en": " Narrated Ash-Shu`bi:                     I heard Abu Juhaifa saying, \"I asked `Ali 'Have you got any Divine literature apart from the Qur'an?' (Once he said...apart from what the people have?) `Ali replied, 'By Him Who made the grain split (germinate) and created the soul, we have nothing except what is in the Qur'an and the ability (gift) of understanding Allah's Book which He may endow a man with and we have what is written in this paper.' I asked, 'What is written in this paper?' He replied, 'Al-`Aql (the regulation of Diya), about the ransom of captives, and the Judgment that a Muslim should not be killed in Qisas (equality in punishment) for killing a disbeliever.\" (See Hadith No. 283,Vol. 4)",
      "chain": [
        "30343",
        "20005",
        "11395",
        "11052",
        "4047",
        "5"
      ]
    },
    {
      "hadith_no": "7001",
      "source": " Sahih Bukhari ",
      "chapter": "Blood Money (Ad-Diyat) - كتاب الديات",
      "chapter_no": "88",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زهير، حدثنا مطرف، أن عامرا، حدثهم عن أبي جحيفة، قال قلت لعلي‏.‏ وحدثنا صدقة بن الفضل، أخبرنا ابن عيينة، حدثنا مطرف، سمعت الشعبي، يحدث قال سمعت أبا جحيفة، قال سألت عليا  رضى الله عنه  هل عندكم شىء مما ليس في القرآن  وقال ابن عيينة مرة ما ليس عند الناس  فقال والذي فلق الحبة وبرأ النسمة ما عندنا إلا ما في القرآن إلا فهما يعطى رجل في كتابه وما في الصحيفة‏.‏ قلت وما في الصحيفة قال العقل، وفكاك الأسير، وأن لا يقتل مسلم بكافر‏.‏",
      "text_en": " Narrated Abu Juhaifa:                     I asked `Ali \"Do you have anything Divine literature besides what is in the Qur'an?\" Or, as Uyaina once said, \"Apart from what the people have?\" `Ali said, \"By Him Who made the grain split (germinate) and created the soul, we have nothing except what is in the Qur'an and the ability (gift) of understanding Allah's Book which He may endow a man, with and what is written in this sheet of paper.\" I asked, \"What is on this paper?\" He replied, \"The legal regulations of Diya (Blood-money) and the (ransom for) releasing of the captives, and the judgment that no Muslim should be killed in Qisas (equality in punishment) for killing a Kafir (disbeliever).",
      "chain": [
        "30184",
        "20321",
        "11395",
        "4047",
        "30343",
        "20005",
        "11395",
        "11052",
        "4047",
        "5"
      ]
    },
    {
      "hadith_no": "503",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، جميعا عن وكيع، - قال زهير حدثنا وكيع، - حدثنا سفيان، حدثنا عون بن أبي جحيفة، عن أبيه، قال أتيت النبي صلى الله عليه وسلم بمكة وهو بالأبطح في قبة له حمراء من أدم - قال - فخرج بلال بوضوئه فمن نائل وناضح - قال - فخرج النبي صلى الله عليه وسلم عليه حلة حمراء كأني أنظر إلى بياض ساقيه - قال - فتوضأ وأذن بلال - قال - فجعلت أتتبع فاه ها هنا وها هنا - يقول يمينا وشمالا - يقول حى على الصلاة حى على الفلاح - قال - ثم ركزت له عنزة فتقدم فصلى الظهر ركعتين يمر بين يديه الحمار والكلب لا يمنع ثم صلى العصر ركعتين ثم لم يزل يصلي ركعتين حتى رجع إلى المدينة ‏.‏",
      "text_en": " Abu Juhaifa reported it on the authority of his father:                      I came to the Apostle of Allah (may peace be upon him) in Mecca and he was (at that time) at al- Abtah in a red leather tent. And Bilal stepped out with ablution water for him. (And what was left out of that water) some of them got it (whereas others could not get it) and (those who got it) rubbed themselves with it. Then the Apostle of Allah (may peace be upon him) stepped out with a red mantle on him and I was catching a glimpse of the whiteness of his shanks. The narrator said: He (the Holy Prophet) performed the ablution. and Bilal pronounced Adhan and I followed his mouth (as he turned) this side and that as he said on the right and the left:\" Come to prayer, come to success.\" ' A spear was then fixed for him (on the ground). He stepped forward and said two rak'ahs of Zuhr, while there passed in front of him a donkey and a dog, and these were not checked. He then said two rak'ahs of the 'Asr prayer, and he then continued saying two rak'ahs till he came back to Medina.",
      "chain": [
        "30201",
        "30022",
        "20032",
        "20321",
        "20032",
        "20012",
        "11383",
        "4047"
      ]
    },
    {
      "hadith_no": "503",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثني إسحاق بن منصور، وعبد بن حميد، قالا أخبرنا جعفر بن عون، أخبرنا أبو عميس، ح قال وحدثني القاسم بن زكرياء، حدثنا حسين بن علي، عن زائدة، قال حدثنا مالك بن مغول، كلاهما عن عون بن أبي جحيفة، عن أبيه، عن النبي صلى الله عليه وسلم بنحو حديث سفيان وعمر بن أبي زائدة يزيد بعضهم على بعض وفي حديث مالك بن مغول فلما كان بالهاجرة خرج بلال فنادى بالصلاة ‏.‏",
      "text_en": " 'Aun b. Abu Juhaifa narrated from the Apostle of Allah (may peace be upon him) on the authority of his father a hadith like that of Sufyan, and 'Umar b. Abu Za'ida made this addition:                      Some of them tried to excel the others (in obtaining water), and in the hadith transmitted by Malik b. Mighwal (the words are): When it was noon, Bilal came out and summoned (people) to (noon) prayer.",
      "chain": [
        "30313",
        "30553",
        "20416",
        "20315",
        "20320",
        "20358",
        "11383",
        "4047"
      ]
    },
    {
      "hadith_no": "503",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن المثنى، ومحمد بن بشار، قال ابن المثنى حدثنا محمد بن جعفر، حدثنا شعبة، عن الحكم، قال سمعت أبا جحيفة، قال خرج رسول الله صلى الله عليه وسلم بالهاجرة إلى البطحاء فتوضأ فصلى الظهر ركعتين والعصر ركعتين وبين يديه عنزة ‏.‏ قال شعبة وزاد فيه عون عن أبيه أبي جحيفة وكان يمر من ورائها المرأة والحمار ‏.‏",
      "text_en": " Abu Juhaifa reported:                      The Messenger of Allah (may peace be upon him) went at noon towards al-Batha', he performed ablution, and said two rak'ahs of the Zuhr prayer and two of the 'Asr prayer, and there was a spear in front of him. Shu'ba said and Aun made this addition to it on the authority of his father Abu Juhaifa: And the woman and the donkey passed behind it.",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "11069",
        "4047"
      ]
    },
    {
      "hadith_no": "5189",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد، - يعني ابن جعفر - حدثنا شعبة، عن سلمة، عن أبي جحيفة، عن البراء بن عازب، قال ذبح أبو بردة قبل الصلاة فقال النبي صلى الله عليه وسلم ‏\"‏ أبدلها ‏\"‏ ‏.‏ فقال يا رسول الله ليس عندي إلا جذعة - قال شعبة وأظنه قال - وهي خير من مسنة ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ اجعلها مكانها ولن تجزي عن أحد بعدك ‏\"‏ ‏.‏",
      "text_en": " Al-Bara' b. 'Azib reported that Abu Burda slaughtered the animal as a sacrifice before the ('Id) prayer. Thereupon Allah's Apostle (may peace be upon him) said:                      Offer a substitute for it (since it does not absolve you of the responsibility of sacrifice). Thereupon he said: Allah's Messenger. I have nothing with me but a goat of less than six months. Shu'ba (one of the narrators) said: I think he (al-Bara' b. 'Azib also) said: And it is better than a goat of one year. Thereupon Allah's Messenger (may peace be upon him) said: Make it a substitute for that (and sacrifice it), but it will not suffice for anyone (as a sacrifice) after you.",
      "chain": [
        "30160",
        "20173",
        "20020",
        "237",
        "4047",
        "400"
      ]
    },
    {
      "hadith_no": "6226",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زهير، حدثنا أبو إسحاق، ح وحدثنا يحيى بن، يحيى أخبرنا أبو خيثمة، عن أبي إسحاق، عن أبي جحيفة، قال رأيت رسول الله صلى الله عليه وسلم هذه منه بيضاء ووضع زهير بعض أصابعه على عنفقته قيل له مثل من أنت يومئذ قال أبري النبل وأريشها ‏.‏",
      "text_en": " Abu Juhaifa reported:                      I saw Allah's Messenger (may peace be upon him) having some whiteness (in hair) at this place, and Zuhair placed one of his fingers at his chin. Juhaifa was asked how old he had been at that time. He said: I made arrows and put feathers to them (i. e. I had passed my childhood).",
      "chain": [
        "30184",
        "20321",
        "11049",
        "30399",
        "20321",
        "11049",
        "4047"
      ]
    },
    {
      "hadith_no": "6227",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا واصل بن عبد الأعلى، حدثنا محمد بن فضيل، عن إسماعيل بن أبي خالد، عن أبي جحيفة، قال رأيت رسول الله صلى الله عليه وسلم أبيض قد شاب كان الحسن بن علي يشبهه ‏.‏",
      "text_en": " Abu Juhaifa reported:                      I saw Allah's Messenger (may peace be upon him) that he had white complexion and had some white hair, and Hasan b. 'Ali resembled him.",
      "chain": [
        "30481",
        "20356",
        "11418",
        "4047"
      ]
    },
    {
      "hadith_no": "520",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا قيس يعني ابن الربيع، ح وحدثنا محمد بن سليمان الأنباري، حدثنا وكيع، عن سفيان، جميعا عن عون بن أبي جحيفة، عن أبيه، قال أتيت النبي صلى الله عليه وسلم بمكة وهو في قبة حمراء من أدم فخرج بلال فأذن فكنت أتتبع فمه ها هنا وها هنا ‏.‏ قال ثم خرج رسول الله صلى الله عليه وسلم وعليه حلة حمراء برود يمانية قطري ‏.‏ وقال موسى قال رأيت بلالا خرج إلى الأبطح فأذن فلما بلغ حى على الصلاة حى على الفلاح ‏.‏ لوى عنقه يمينا وشمالا ولم يستدر ثم دخل فأخرج العنزة وساق حديثه ‏.‏",
      "text_en": " Abu Juhaifah reported:                      I came to the prophet (ﷺ) at Mecca; he was sitting in a tent made of leather. Then Bilal came out and called to prayer. I looked at his mouth following him this side and that side (i.e., right and left). Later at his Messenger of Allah (ﷺ) came out clad in a red suit, i.e, wearing the sheets of the Yemen, of the Qatri design. The version narrated by Musa has the word; “I saw Bilal going towards al-Abtah”.He then made a call to prayer. When he reached the words “ come to prayer, come to salvation”. He turned his neck right and left, respectively; he did not turn himself (with his whole body). He then entered (his house) and came out with a lancet. The narrator then reported the rest of the tradition.",
      "chain": [
        "20040",
        "25246",
        "31160",
        "20032",
        "20012",
        "11383",
        "4047"
      ]
    },
    {
      "hadith_no": "688",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن عون بن أبي جحيفة، عن أبيه، أن النبي صلى الله عليه وسلم صلى بهم بالبطحاء وبين يديه عنزة الظهر ركعتين والعصر ركعتين يمر خلف العنزة المرأة والحمار ‏.‏",
      "text_en": " Abu Juhaifah said:                      The Prophet (ﷺ) led them in prayer at al-Batha', with a staff set up in front of him. (He prayed) two rak'ahs of the Zuhr prayer and two rak'ahs of the 'Asr prayer. The women and the donkeys would pass in front of the staff.",
      "chain": [
        "30329",
        "20020",
        "11383",
        "4047"
      ]
    },
    {
      "hadith_no": "756",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن محبوب، حدثنا حفص بن غياث، عن عبد الرحمن بن إسحاق، عن زياد بن زيد، عن أبي جحيفة، أن عليا، - رضى الله عنه - قال السنة وضع الكف على الكف في الصلاة تحت السرة ‏.‏",
      "text_en": " Narrated Ali ibn AbuTalib:                     AbuJuhayfah said: Ali said that it is a sunnah to place one hand on the other in prayer below the navel.",
      "chain": [
        "30171",
        "20317",
        "11876",
        "4047",
        "5"
      ]
    },
    {
      "hadith_no": "3483",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا أبو الوليد الطيالسي، حدثنا شعبة، أخبرني عون بن أبي جحيفة، أن أباه، قال إن رسول الله صلى الله عليه وسلم نهى عن ثمن الكلب ‏.‏",
      "text_en": " Narrated Abu Juhaifah:                     The Messenger of Allah (ﷺ)forbade the price paid for a dog.",
      "chain": [
        "20296",
        "20020",
        "11383",
        "4047"
      ]
    },
    {
      "hadith_no": "3769",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، عن علي بن الأقمر، قال سمعت أبا جحيفة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا آكل متكئا ‏\"‏ ‏.‏",
      "text_en": " Abu Juhaifah reported the Prophet (ﷺ) as sayings:                      I do not eat while reclining.",
      "chain": [
        "28531",
        "20012",
        "11375",
        "4047"
      ]
    },
    {
      "hadith_no": "197",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا عبد الرزاق، أخبرنا سفيان الثوري، عن عون بن أبي جحيفة، عن أبيه، قال رأيت بلالا يؤذن ويدور ويتبع فاه ها هنا وها هنا وإصبعاه في أذنيه ورسول الله صلى الله عليه وسلم في قبة له حمراء أراه قال من أدم فخرج بلال بين يديه بالعنزة فركزها بالبطحاء فصلى إليها رسول الله صلى الله عليه وسلم يمر بين يديه الكلب والحمار وعليه حلة حمراء كأني أنظر إلى بريق ساقيه ‏.‏ قال سفيان نراه حبرة ‏.‏ قال أبو عيسى حديث أبي جحيفة حديث حسن صحيح ‏.‏ وعليه العمل عند أهل العلم يستحبون أن يدخل المؤذن إصبعيه في أذنيه في الأذان ‏.‏ وقال بعض أهل العلم وفي الإقامة أيضا يدخل إصبعيه في أذنيه ‏.‏ وهو قول الأوزاعي ‏.‏ وأبو جحيفة اسمه وهب بن عبد الله السوائي ‏.‏",
      "text_en": " Abu Juhaifah narrated:                     \"I saw Bilal calling the Adhan, and turning, and his (face) was following here and there, and his (index) fingers were in his ears, and Allah's Messenger was in a small red tent\" - \"I think,\" he (one of the narrators) said, \"it was made from a hide\" - so Bilal went out in front of him with an Anazah which he planted (in the ground) at Batha. Allah's Messenger prayed facing it, and a dog and a donkey passed in front of him; he was wearing a red Hullah, and it is as if I am now looking at the radiance of his shins.\" Sufyan said: \"We think that it was a Hibrah.\"",
      "chain": [
        "30277",
        "20121",
        "20012",
        "11383",
        "4047"
      ]
    },
    {
      "hadith_no": "606",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Traveling - أَبْوَابُ السَّفَرِ",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن حميد الرازي، حدثنا الحكم بن بشير بن سلمان، حدثنا خلاد الصفار، عن الحكم بن عبد الله النصري، عن أبي إسحاق، عن أبي جحيفة، عن علي بن أبي طالب، رضى الله عنه أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ستر ما بين أعين الجن وعورات بني آدم إذا دخل أحدهم الخلاء أن يقول بسم الله ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من هذا الوجه وإسناده ليس بذاك القوي ‏.‏ وقد روي عن أنس عن النبي صلى الله عليه وسلم أشياء في هذا ‏.‏",
      "text_en": " Ali bin Abi Talid (may Allah be pleased with him) narrated that :                     the Messenger of Allah said: \"The screen between the eyes of the jinns and nakedness of the children of Adam when one of you enters the area of relieving oneself is saying: 'Bismillah.'\"",
      "chain": [
        "38495",
        "25070",
        "18206",
        "11049",
        "4047",
        "5"
      ]
    },
    {
      "hadith_no": "649",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Zakat - كتاب الزكاة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "7",
      "text_ar": "حدثنا علي بن سعيد الكندي الكوفي، حدثنا حفص بن غياث، عن أشعث، عن عون بن أبي جحيفة، عن أبيه، قال قدم علينا مصدق النبي صلى الله عليه وسلم فأخذ الصدقة من أغنيائنا فجعلها في فقرائنا وكنت غلاما يتيما فأعطاني منها قلوصا ‏.‏ قال وفي الباب عن ابن عباس ‏.‏ قال أبو عيسى حديث أبي جحيفة حديث حسن ‏.‏",
      "text_en": " Awn bin Abi Jubaitah narrated from his father:                     \"The charity collector of the Prophet came to us. So he took the charity from our rich to our poor. I was a orphan boy, so he came to me and gave me a young she-camel from it.\"",
      "chain": [
        "38401",
        "20317",
        "11324",
        "11383",
        "4047"
      ]
    },
    {
      "hadith_no": "1412",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Blood Money - كتاب الديات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "16",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا هشيم، أنبأنا مطرف، عن الشعبي، حدثنا أبو جحيفة، قال قلت لعلي يا أمير المؤمنين هل عندكم سوداء في بيضاء ليس في كتاب الله قال لا والذي فلق الحبة وبرأ النسمة ما علمته إلا فهما يعطيه الله رجلا في القرآن وما في الصحيفة ‏.‏ قلت وما في الصحيفة قال فيها العقل وفكاك الأسير وأن لا يقتل مؤمن بكافر ‏.‏ قال وفي الباب عن عبد الله بن عمرو ‏.‏ قال أبو عيسى حديث علي حديث حسن صحيح ‏.‏ والعمل على هذا عند بعض أهل العلم وهو قول سفيان الثوري ومالك بن أنس والشافعي وأحمد وإسحاق قالوا لا يقتل مؤمن بكافر ‏.‏ وقال بعض أهل العلم يقتل المسلم بالمعاهد ‏.‏ والقول الأول أصح ‏.‏",
      "text_en": " Abu Juhaifah said:                      \"I said to 'Ali: O Commander of the Believers! Do you have anything written that is not in Allah's Book?' He said: 'By the One Who splits the seed and creates the soul, I have not learned from it except what understanding of the Qur'an Allah gives to a man, and what is in this sheet of paper.' I said: 'What is in the paper?' He said: 'It is the 'Aql, the (ransom for) release of captives, and the judgement that no believer is killed for a disbeliever.'\"",
      "chain": [
        "30242",
        "20468",
        "11395",
        "11052",
        "4047"
      ]
    },
    {
      "hadith_no": "1830",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا قتيبة، حدثنا شريك، عن علي بن الأقمر، عن أبي جحيفة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أما أنا فلا آكل متكئا ‏\"‏ ‏.‏ قال وفي الباب عن علي وعبد الله بن عمرو وعبد الله بن عباس ‏.‏ قال أبو عيسى هذا حديث حسن صحيح لا نعرفه إلا من حديث علي بن الأقمر ‏.‏ وروى زكريا بن أبي زائدة وسفيان الثوري وغير واحد عن علي بن الأقمر هذا الحديث وروى شعبة عن سفيان الثوري هذا الحديث عن علي بن الأقمر ‏.‏",
      "text_en": " Narrated Abu Juhaidah:                     That the Messenger of Allah (ﷺ) said: \"As for me, I do not eat while reclining.\"He said: There are narrations on this topic from 'Ali, 'Abdullah bin 'Amr, and 'Abdullah bin Al-'Abbas.[Abu 'Eisa said:] This Hadith is Hasan Sahih, we do not know of it except as a narration of 'Ali bin Al-Aqmar. Zakariyya bin Abi Za'idah,  Sufyan bin Sa'eed, and other reported this Hadith from 'Ali bin Al-Aqmar. And Shu'bah reported this Hadith from Sufyan Ath-Thawri from 'Ali bin Al-Aqmar.",
      "chain": [
        "30367",
        "20587",
        "11375",
        "4047"
      ]
    },
    {
      "hadith_no": "2413",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا محمد بن بشار، حدثنا جعفر بن عون، حدثنا أبو العميس، عن عون بن أبي جحيفة، عن أبيه، قال آخى رسول الله صلى الله عليه وسلم بين سلمان وبين أبي الدرداء فزار سلمان أبا الدرداء فرأى أم الدرداء متبذلة فقال ما شأنك متبذلة قالت إن أخاك أبا الدرداء ليس له حاجة في الدنيا ‏.‏ قال فلما جاء أبو الدرداء قرب إليه طعاما فقال كل فإني صائم ‏.‏ قال ما أنا بآكل حتى تأكل ‏.‏ قال فأكل فلما كان الليل ذهب أبو الدرداء ليقوم فقال له سلمان نم ‏.‏ فنام ثم ذهب يقوم فقال له نم ‏.‏ فنام فلما كان عند الصبح قال له سلمان قم الآن فقاما فصليا فقال إن لنفسك عليك حقا ولربك عليك حقا ولضيفك عليك حقا وإن لأهلك عليك حقا فأعط كل ذي حق حقه ‏.‏ فأتيا النبي صلى الله عليه وسلم فذكرا ذلك فقال له ‏\"‏ صدق سلمان ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث صحيح ‏.‏ وأبو العميس اسمه عتبة بن عبد الله وهو أخو عبد الرحمن بن عبد الله المسعودي ‏.‏",
      "text_en": " Ubu Juhaifah narrated from his father who said:                     \"The Messenger of Allah (s.a.w) made a bond of brotherhood  between Salman and Abu Ad-Darda. Salman went to visit Abu Ad-Darda, and saw Umm Ad-Darda wearing shabby clothes, So he said: 'Why are you wearing such shabby clothes?' She said: 'Your brother Abu Ad-Darda has no interest in the world.' So when Abu Ad-Darda arrived, he prepared some food for him (Salman) and said: 'Eat, for I am fasting.' He said: 'I shall not eat until you eat.'\" He said: \"So he ate. When night came Abu Ad-Darda started to leave and stand (in prayer), but Salman said to him: 'Sleep.' So he slept. Then he went to stand (in prayer) but he said to him: 'Sleep'. So he slept. When the morning (Fajr) came,Salman said: 'Get up now.'So he got up to perform Salat. Then he (Salman) said: 'Indeed your self has a right upon you, your Lord has a right upon you, your guest has a right upon you, and your family has a right upon you. So give each the right they are due. The Prophet (s.a.w), and that was mentioned to him, so he said: 'Salman has told the truth.'\"",
      "chain": [
        "30160",
        "20416",
        "20342",
        "11383",
        "4047"
      ]
    },
    {
      "hadith_no": "2626",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Faith - كتاب الإيمان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "40",
      "text_ar": "حدثنا أبو عبيدة بن أبي السفر، - واسمه أحمد بن عبد الله الهمداني الكوفي قال حدثنا حجاج بن محمد، عن يونس بن أبي إسحاق، عن أبي إسحاق الهمداني، عن أبي جحيفة، عن علي، عن النبي صلى الله عليه وسلم قال ‏\"‏ من أصاب حدا فعجل عقوبته في الدنيا فالله أعدل من أن يثني على عبده العقوبة في الآخرة ومن أصاب حدا فستره الله عليه وعفا عنه فالله أكرم من أن يعود في شيء قد عفا عنه ‏\"‏ ‏.‏ قال أبو عيسى وهذا حديث حسن غريب صحيح ‏.‏ وهذا قول أهل العلم لا نعلم أحدا كفر أحدا بالزنا أو السرقة وشرب الخمر ‏.‏",
      "text_en": " Narrated Ali bin Abu Talib:                     that the Prophet (ﷺ) said: \"Whoever is penalized (for a crime) then his punishment has been hastened for him in the world, for Allah is more just than to double the punishment upon His slave in the Hereafter. And whoever does a punishable act and then Allah covers it for him and forgives him, then Allah is more kind than to recount something which He has already forgiven.\"",
      "chain": [
        "20381",
        "10846",
        "11049",
        "4047",
        "5"
      ]
    },
    {
      "hadith_no": "3060",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا واصل بن عبد الأعلى الكوفي، حدثنا محمد بن فضيل، عن إسماعيل بن أبي خالد، عن أبي جحيفة، قال رأيت رسول الله صلى الله عليه وسلم أبيض قد شاب وكان الحسن بن علي يشبهه وأمر لنا بثلاثة عشر قلوصا فذهبنا نقبضها فأتانا موته فلم يعطونا شيئا فلما قام أبو بكر قال من كانت له عند رسول الله صلى الله عليه وسلم عدة فليجئ ‏.‏ فقمت إليه فأخبرته فأمر لنا بها ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ وقد روى مروان بن معاوية هذا الحديث بإسناد له عن أبي جحيفة نحو هذا ‏.‏ وقد روى غير واحد عن إسماعيل بن أبي خالد عن أبي جحيفة قال رأيت النبي صلى الله عليه وسلم وكان الحسن بن علي يشبهه ولم يزيدوا على هذا ‏.‏",
      "text_en": " Narrated Isma'il bin Abi Khalid:                     that Abu Juhaifah said: \"I saw the Messenger of Allah (ﷺ) (he was) white and turning grey. Al-Hasan bin 'Ali resembles him most. He had promised thirteen young she-camels for us, so we went to get them. When we arrived he had died without giving us anything. So when Abu Bakr (became the Khalifah) he said: 'If there is anyone to whom the Messenger of Allah (ﷺ) made a promise, then let him come forth.' I stood to inform him about it, and he ordered that they be given to us.\"",
      "chain": [
        "20356",
        "11418",
        "4047"
      ]
    },
    {
      "hadith_no": "3061",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، عن إسماعيل بن أبي خالد، حدثنا أبو جحيفة، قال رأيت النبي صلى الله عليه وسلم وكان الحسن بن علي يشبهه ‏.‏ قال أبو عيسى وهكذا روى غير واحد عن إسماعيل بن أبي خالد نحو هذا ‏.‏ وفي الباب عن جابر ‏.‏ وأبو جحيفة اسمه وهب السوائي ‏.‏",
      "text_en": " Narrated Isma'il bin Abi Khalid:                     that Abu Juhaifah said: \"I saw the Prophet (ﷺ), and Al-Hasan bin 'Ali resembles him the most.\"",
      "chain": [
        "30160",
        "20031",
        "11418",
        "4047"
      ]
    },
    {
      "hadith_no": "4146",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، حدثنا إسماعيل بن أبي خالد، عن أبي جحيفة، قال رأيت رسول الله صلى الله عليه وسلم وكان الحسن بن علي يشبهه ‏.‏ هذا حديث حسن صحيح ‏.‏ قال وفي الباب عن أبي بكر الصديق وابن عباس وابن الزبير ‏.‏",
      "text_en": " Narrated Abu Juhaifah:                     \"I saw the Messenger of Allah (ﷺ), and Al-Hasan bin 'Ali used to resemble him.\"",
      "chain": [
        "30160",
        "20031",
        "11418",
        "4047"
      ]
    },
    {
      "hadith_no": "138",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا محمد بن منصور، عن سفيان، قال حدثنا مالك بن مغول، عن عون بن أبي جحيفة، عن أبيه، قال شهدت النبي صلى الله عليه وسلم بالبطحاء وأخرج بلال فضل وضوئه فابتدره الناس فنلت منه شيئا وركزت له العنزة فصلى بالناس والحمر والكلاب والمرأة يمرون بين يديه ‏.‏",
      "text_en": " It was narrated from 'Awn bin Abi Juhaifah that his father said:                      \"I saw the Prophet (ﷺ) in Al-Batha'. Bilal brought out the water left over from his Wudu' and the people rushed toward it and I got some of it. Then a short spear was planted in the ground and he led the people in prayer, while donkeys, dogs and women were passing in front of him.\"",
      "chain": [
        "36658",
        "20005",
        "20358",
        "11383",
        "4047"
      ]
    },
    {
      "hadith_no": "470",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Salah - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "أخبرنا محمد بن المثنى، ومحمد بن بشار، قالا حدثنا محمد بن جعفر، قال حدثنا شعبة، عن الحكم بن عتيبة، قال سمعت أبا جحيفة، قال خرج رسول الله صلى الله عليه وسلم بالهاجرة - قال ابن المثنى إلى البطحاء - فتوضأ وصلى الظهر ركعتين والعصر ركعتين وبين يديه عنزة ‏.‏",
      "text_en": " It was narrated that Al-Hakam bin 'Utaibah said:                      \"I heard Abu Juhaifah say: 'The Messenger of Allah (ﷺ) set off at midday, during the time of intense heat' - (One of the narrators) Ibn Al-Muthanna said, to Al-Batha' - and he performed Wudu', and prayed Zuhr, two Rak'ahs, and 'Asr, two Rak'ahs, with a short spear ('Anzah) in front of him.",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "11069",
        "4047"
      ]
    },
    {
      "hadith_no": "650",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Adhan (The Call to Prayer) - كتاب الأذان",
      "chapter_no": "7",
      "text_ar": "أخبرنا محمود بن غيلان، قال حدثنا وكيع، قال حدثنا سفيان، عن عون بن أبي جحيفة، عن أبيه، قال أتيت النبي صلى الله عليه وسلم فخرج بلال فأذن فجعل يقول في أذانه هكذا ينحرف يمينا وشمالا ‏.‏",
      "text_en": " It was narrated from 'Awn bin Abi Juhaifah that his father said:                      \"I came to the Prophet (ﷺ) and Bilal came out and called the Adhan and he started doing like this in his Adhan, turning to his right and left.\"",
      "chain": [
        "30277",
        "20032",
        "20012",
        "11383",
        "4047"
      ]
    },
    {
      "hadith_no": "772",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Qiblah - كتاب القبلة",
      "chapter_no": "9",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا عبد الرحمن، قال حدثنا سفيان، عن عون بن أبي جحيفة، عن أبيه، أن رسول الله صلى الله عليه وسلم خرج في حلة حمراء فركز عنزة فصلى إليها يمر من ورائها الكلب والمرأة والحمار ‏.‏",
      "text_en": " It was narrated from Awn bin Abi Juhaifah, from his father that, the Messenger of Allah(ﷺ)went out in a red Hullah, and he set up a short spear (Anazah) and prayed facing toward it, while dogs, women and donkeys were passing beyond it.",
      "chain": [
        "30160",
        "20033",
        "20012",
        "11383",
        "4047"
      ]
    },
    {
      "hadith_no": "2059",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا يحيى، عن شعبة، قال أخبرني عون بن أبي جحيفة، عن أبيه، عن البراء بن عازب، عن أبي أيوب، قال خرج رسول الله صلى الله عليه وسلم بعد ما غربت الشمس فسمع صوتا فقال ‏\"‏ يهود تعذب في قبورها ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Ayyub said:                     \"The Messenger of Allah went out after the sun had set, and heard a sound. He said '(It is ) Jews being tormented in their graves.",
      "chain": [
        "30359",
        "20031",
        "20020",
        "11383",
        "4047",
        "400",
        "33"
      ]
    }
  ],
  "total_hadiths": 62
}