{
  "id": "4052",
  "name": "Ka'b bin 'Ajra al-Salmi, al-Ansari ( كعب بن عجرة الأنصاري ( رضي الله عنه",
  "full_name": "Ka'b bin 'Ajra al-Salmi, al-Ansari ( كعب بن عجرة الأنصاري ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Hijaz"
    },
    "death": {
      "date_hijri": "52",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Medina",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ ع  -  صحابي ]"
    ],
    "tags": [
      "Ansar",
      "Ally Khazraj",
      "Ridwan",
      "Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "3154",
      "name": "Zaynab bint Ka'b bin 'Ajra al-Ansariyya ( زنيب بنت كعب بن عجرة الأنصارية ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18028",
      "name": "Ishaq bin Ka'b bin Ajrah إسحاق بن كعب بن عجرة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "12840",
      "name": "'Abdul Malik bin K'ab bin Ajrh عبد الملك بن كعب بن عجرة السالمي",
      "grade": "Follower(Tabi')"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "3",
      "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "24",
      "name": "Bilal ibn Ribah ( بلال بن رباح الحبشي المؤذن ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "18028",
      "name": "Ishaq bin Ka'b bin Ajrah إسحاق بن كعب بن عجرة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "12840",
      "name": "'Abdul Malik bin K'ab bin Ajrh عبد الملك بن كعب بن عجرة السالمي",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "29",
      "name": "'Abdullah bin 'Amr bin al-'Aas ( عبد الله بن عمرو بن العاص ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "34",
      "name": "Jabir ibn 'Abdullah ( جابر بن عبد الله بن عمرو السلمي الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3119",
      "name": "'Abdullah bin Ma'qil al-Mazni ( عبد الله بن معقل بن مقرن ( رضي الله عنه",
      "grade": "Comp.(RA) [3rd Generation]"
    },
    {
      "id": "11196",
      "name": "'Abdur Rahman bin Abi Layla عبد الرحمن بن أبي ليلى",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11353",
      "name": "Shaqayq bin Salmah al-Asadi شقيق بن سلمة الأسدي أبو وائل الكوفي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11035",
      "name": "Ibn Sirin محمد بن سيرين الأنصاري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "15681",
      "name": "Abu 'Ubaida bin 'Abdullah bin Mas'ud أبو عبيدة بن عبد الله بن مسعود",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "3680",
      "name": "Tariq bin Shahab ( طارق بن شهاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11221",
      "name": "Muhammad bin Ka'b bin Sulaym al-Qarzi محمد بن كعب بن سليم بن أسد القرظي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "13559",
      "name": "Abu Thamama al-Hanat/al-Khiyat أبو ثمامة الحناط",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11168",
      "name": "Sa'id bin Abi Sa'id سعيد بن أبي سعيد كيسان المقبري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "15260",
      "name": "'Asim al-Dwy عاصم العدوي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "18012",
      "name": "Ibrahim al-Nakha'i إبراهيم النخعي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19823",
      "name": "Musa bin Wardan موسى بن وردان القرشي العامري",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1845",
      "source": " Sahih Bukhari ",
      "chapter": "Pilgrims Prevented from Completing the Pilgrimage - كتاب المحصر",
      "chapter_no": "27",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن حميد بن قيس، عن مجاهد، عن عبد الرحمن بن أبي ليلى، عن كعب بن عجرة  رضى الله عنه  عن رسول الله صلى الله عليه وسلم أنه قال ‏\"‏ لعلك آذاك هوامك ‏\"‏‏.‏ قال نعم يا رسول الله‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ احلق رأسك وصم ثلاثة أيام، أو أطعم ستة مساكين، أو انسك بشاة ‏\"‏‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Abu Layla:                     Ka`b bin 'Ujra said that Allah's Apostle said to him (Ka`b), \"Perhaps your lice have troubled you?\" Ka`b replied, \"Yes! O Allah's Apostle.\" Allah's Apostle said, \"Have your head shaved and then either fast three days or feed six poor persons or slaughter one sheep as a sacrifice.\"",
      "chain": [
        "30355",
        "20001",
        "11242",
        "11028",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "1846",
      "source": " Sahih Bukhari ",
      "chapter": "Pilgrims Prevented from Completing the Pilgrimage - كتاب المحصر",
      "chapter_no": "27",
      "text_ar": "حدثنا أبو نعيم، حدثنا سيف، قال حدثني مجاهد، قال سمعت عبد الرحمن بن أبي ليلى، أن كعب بن عجرة، حدثه قال وقف على رسول الله صلى الله عليه وسلم بالحديبية، ورأسي يتهافت قملا فقال ‏\"‏ يؤذيك هوامك ‏\"‏‏.‏ قلت نعم‏.‏ قال ‏\"‏ فاحلق رأسك  أو قال  احلق ‏\"‏‏.‏ قال في نزلت هذه الآية ‏{‏فمن كان منكم مريضا أو به أذى من رأسه‏}‏ إلى آخرها‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ صم ثلاثة أيام، أو تصدق بفرق بين ستة، أو انسك بما تيسر ‏\"‏‏.‏",
      "text_en": " Narrated Ka`b bin `Umra:                     Allah's Apostle stood beside me at Al-Hudaibiya and the lice were falling from my head in great number. He asked me, \"Have your lice troubled you?\" I replied in the affirmative. He ordered me to get my head shaved. Ka`b added, \"This Holy Verse:--'And if any of you is ill, or has ailment in his scalp (2.196), etc. was revealed regarding me. \"The Prophet then ordered me either to fast three days, or to feed six poor persons with one Faraq (three Sas) (of dates), or to slaughter a sheep, etc. (sacrifice) whatever was available.",
      "chain": [
        "20348",
        "11558",
        "11028",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "1848",
      "source": " Sahih Bukhari ",
      "chapter": "Pilgrims Prevented from Completing the Pilgrimage - كتاب المحصر",
      "chapter_no": "27",
      "text_ar": "حدثنا إسحاق، حدثنا روح، حدثنا شبل، عن ابن أبي نجيح، عن مجاهد، قال حدثني عبد الرحمن بن أبي ليلى، عن كعب بن عجرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم رآه وأنه يسقط على وجهه فقال ‏\"‏ أيؤذيك هوامك ‏\"‏‏.‏ قال نعم‏.‏ فأمره أن يحلق وهو بالحديبية، ولم يتبين لهم أنهم يحلون بها، وهم على طمع أن يدخلوا مكة، فأنزل الله الفدية، فأمره رسول الله صلى الله عليه وسلم أن يطعم فرقا بين ستة، أو يهدي شاة، أو يصوم ثلاثة أيام‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Abu Layla:                     (Reporting the speech of Ka`b bin Umra) Allah's Apostle saw him (i.e. Ka`b) while the lice were falling on his face. He asked (him), \"Have your lice troubled you?\" He replied in the affirmative. So, he ordered him to get his head shaved while he was at Al-Hudaibiya. At that time they were not permitted to finish their Ihram, and were still hoping to enter Mecca. So, Allah revealed the verses of Al-Fidya. Allah's Apostle ordered him to feed six poor persons with one Faraq of food or to slaughter one sheep (as a sacrifice) or to fast for three days.",
      "chain": [
        "30312",
        "20229",
        "11559",
        "11254",
        "11028",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "1849",
      "source": " Sahih Bukhari ",
      "chapter": "Pilgrims Prevented from Completing the Pilgrimage - كتاب المحصر",
      "chapter_no": "27",
      "text_ar": "وعن محمد بن يوسف، حدثنا ورقاء، عن ابن أبي نجيح، عن مجاهد، أخبرنا عبد الرحمن بن أبي ليلى، عن كعب بن عجرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم رآه، وقمله يسقط على وجهه‏.‏ مثله‏.‏",
      "text_en": " Narrated Ka'b bin 'Ujra (ra):                      Allah's Messenger () saw him (i.e. Ka'b) while the lice were falling on his face.",
      "chain": [
        "30388",
        "20363",
        "11254",
        "11028",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "4211",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا الحسن بن خلف، قال حدثنا إسحاق بن يوسف، عن أبي بشر، ورقاء، عن ابن أبي نجيح، عن مجاهد، قال حدثني عبد الرحمن بن أبي ليلى، عن كعب بن عجرة، أن رسول الله صلى الله عليه وسلم رآه وقمله يسقط على وجهه فقال ‏\"‏ أيؤذيك هوامك ‏\"‏‏.‏ قال نعم‏.‏ فأمره رسول الله صلى الله عليه وسلم أن يحلق وهو بالحديبية، لم يبين لهم أنهم يحلون بها، وهم على طمع أن يدخلوا مكة، فأنزل الله الفدية، فأمره رسول الله صلى الله عليه وسلم أن يطعم فرقا بين ستة مساكين، أو يهدي شاة، أو يصوم ثلاثة أيام‏.‏",
      "text_en": " Narrated Ka`b bin Ujra:                     That Allah's Apostle saw him with the lice falling (from his head) on his face. Allah's Apostle said, \"Are your lice troubling you? Ka`b said, \"Yes.\" Allah's Apostle thus ordered him to shave his head while he was at Al-Hudaibiya. Up to then there was no indication that all of them would finish their state of Ihram and they hoped that they would enter Mecca. Then the order of Al-Fidya was revealed, so Allah's Apostle ordered Ka`b to feed six poor persons with one Faraq of food or slaughter a sheep or fast for three days.",
      "chain": [
        "30324",
        "20411",
        "11419",
        "11254",
        "11028",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "4239",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن أيوب، عن مجاهد، عن ابن أبي ليلى، عن كعب بن عجرة  رضى الله عنه  قال أتى على النبي صلى الله عليه وسلم زمن الحديبية، والقمل يتناثر على وجهي فقال ‏{‏أيؤذيك هوام رأسك‏}‏‏.‏ قلت نعم‏.‏ قال ‏\"‏ فاحلق، وصم ثلاثة أيام، أو أطعم ستة مساكين، أو انسك نسيكة ‏\"‏‏.‏ قال أيوب لا أدري بأى هذا بدأ‏.‏",
      "text_en": " Narrated Ka`b bin Ujra:                     The Prophet came to me at the time of Al-Hudaibiya Pledge while lice were falling on my face. He said, \"Are the lice of your head troubling you?\" I said, \"Yes.\" He said, \"Shave your head and fast for three days, or feed six poor persons, or slaughter a sheep as sacrifice.\" (The sub-narrator, Aiyub said, \"I do not know with which of these three options he started.\")",
      "chain": [
        "20193",
        "20022",
        "11015",
        "11028",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "4240",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني محمد بن هشام أبو عبد الله، حدثنا هشيم، عن أبي بشر، عن مجاهد، عن عبد الرحمن بن أبي ليلى، عن كعب بن عجرة، قال كنا مع رسول الله صلى الله عليه وسلم بالحديبية ونحن محرمون، وقد حصرنا المشركون  قال  وكانت لي وفرة فجعلت الهوام تساقط على وجهي، فمر بي النبي صلى الله عليه وسلم فقال ‏\"‏ أيؤذيك هوام رأسك ‏\"‏‏.‏ قلت نعم‏.‏ قال وأنزلت هذه الآية ‏{‏فمن كان منكم مريضا أو به أذى من رأسه ففدية من صيام أو صدقة أو نسك‏}‏",
      "text_en": " Narrated Ka`b bin Ujra:                     We were in the company of Allah's Apostle at Al-Hudaibiya in the state of Ihram and the pagans did not allow us to proceed (to the Ka`ba). I had thick hair and lice started falling on my face. The Prophet passed by me and said, \"Are the lice of your head troubling you?\" I replied, Yes.\" (The sub-narrator added, \"Then the following Divine Verse was revealed:-- \"And if anyone of you is ill or has an ailment in his scalp, (necessitating shaving) must pay a ransom (Fida) of either fasting or feeding the poor, Or offering a sacrifice.\" (2.196)",
      "chain": [
        "30276",
        "20468",
        "11419",
        "11028",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "4844",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني سعيد بن يحيى، حدثنا أبي، حدثنا مسعر، عن الحكم، عن ابن أبي ليلى، عن كعب بن عجرة  رضى الله عنه  قيل يا رسول الله، أما السلام عليك فقد عرفناه فكيف الصلاة قال ‏\"‏ قولوا اللهم صل على محمد وعلى آل محمد، كما صليت على آل إبراهيم، إنك حميد مجيد، اللهم بارك على محمد وعلى آل محمد، كما باركت على آل إبراهيم، إنك حميد مجيد ‏\"‏‏.‏",
      "text_en": " Narrated Ka`b bin Ujra:                     It was said, \"O Allah's Apostle! We know how to greet you, but how to invoke Allah for you?\" The Prophet said, \"Say: Allahumma salli ala Muhammadin wa'ala `Ali Muhammaddin, kama sallaita 'ala all Ibrahim, innaka Hamidun Majid.\"",
      "chain": [
        "30254",
        "20367",
        "20359",
        "11069",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "5727",
      "source": " Sahih Bukhari ",
      "chapter": "Patients - كتاب المرضى",
      "chapter_no": "75",
      "text_ar": "حدثنا قبيصة، حدثنا سفيان، عن ابن أبي نجيح، وأيوب، عن مجاهد، عن عبد الرحمن بن أبي ليلى، عن كعب بن عجرة  رضى الله عنه‏.‏ مر بي النبي صلى الله عليه وسلم وأنا أوقد تحت القدر فقال ‏\"‏ أيؤذيك هوام رأسك ‏\"‏‏.‏ قلت نعم‏.‏ فدعا الحلاق فحلقه ثم أمرني بالفداء‏.‏",
      "text_en": " Narrated Ka`b bin 'Ujara:                     The Prophet passed by me while I was kindling a fire under a (cooking) pot. He said, \"Do the lice of your head trouble you?\" I said, \"Yes.\" So he called a barber to shave my head and ordered me to make expiation for that.\"",
      "chain": [
        "20351",
        "20012",
        "11254",
        "11015",
        "11028",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "5765",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا مسدد، حدثنا حماد، عن أيوب، قال سمعت مجاهدا، عن ابن أبي ليلى، عن كعب، هو ابن عجرة قال أتى على النبي صلى الله عليه وسلم زمن الحديبية، وأنا أوقد تحت برمة، والقمل يتناثر عن رأسي فقال ‏\"‏ أيؤذيك هوامك ‏\"‏‏.‏ قلت نعم‏.‏ قال ‏\"‏ فاحلق وصم ثلاثة أيام، أو أطعم ستة، أو انسك نسيكة ‏\"‏‏.‏ قال أيوب لا أدري بأيتهن بدأ‏.‏",
      "text_en": " Narrated Ka`b bin Ujrah:                     The Prophet came to me during the period of Al-Hudaibiya, while I was lighting fire underneath a cooking pot and lice were falling down my head. He said, \"Do your lice hurt your?\" I said, \"Yes.\" He said, \"Shave your head and fast for three days or feed six poor persons or slaughter a sheep as a sacrifice:\"",
      "chain": [
        "30175",
        "20022",
        "11015",
        "11028",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "6793",
      "source": " Sahih Bukhari ",
      "chapter": "Expiation for Unfulfilled Oaths - كتاب كفارات الأيمان",
      "chapter_no": "84",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا أبو شهاب، عن ابن عون، عن مجاهد، عن عبد الرحمن بن أبي ليلى، عن كعب بن عجرة، قال أتيته يعني النبي صلى الله عليه وسلم فقال ‏\"‏ ادن ‏\"‏‏.‏ فدنوت فقال ‏\"‏ أيؤذيك هوامك ‏\"‏‏.‏ قلت نعم‏.‏ قال ‏\"‏ فدية من صيام أو صدقة أو نسك ‏\"‏‏.‏ وأخبرني ابن عون عن أيوب قال صيام ثلاثة أيام، والنسك شاة، والمساكين ستة‏.‏",
      "text_en": " Narrated Ka`b bin 'Ujra:                     I came to the Prophet and he said to me, \"Come near.\" So I went near to him and he said, \"Are your lice troubling you?\" I replied, \"Yes.\" He said, \"(Shave your head and) make expiation in the form of fasting, Sadaqa (giving in charity), or offering a sacrifice.\" (The sub-narrator) Aiyub said, \"Fasting should be for three days, and the Nusuk (sacrifice) is to be a sheep, and the Sadaqa is to be given to six poor persons.\"",
      "chain": [
        "30184",
        "11613",
        "11071",
        "11028",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "275",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، ومحمد بن العلاء، قالا حدثنا أبو معاوية، ح وحدثنا إسحاق، أخبرنا عيسى بن يونس، كلاهما عن الأعمش، عن الحكم، عن عبد الرحمن بن أبي ليلى، عن كعب بن عجرة، عن بلال، أن رسول الله صلى الله عليه وسلم مسح على الخفين والخمار ‏.‏ وفي حديث عيسى حدثني الحكم حدثني بلال وحدثنيه سويد بن سعيد حدثنا علي - يعني ابن مسهر - عن الأعمش بهذا الإسناد وقال في الحديث رأيت رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " It is narrated from Bilal that the Messenger of Allah (may peace be upon him) wiped over the socks and turban, and in the hadith transmitted by 'Isa b. Yaunus the words are:                     \" Bilal narrated it to me.\"This tradition is transmitted by A'mash with this addition;, I saw the Messenger of Allah (may peace be upon him).\"",
      "chain": [
        "30201",
        "30216",
        "20354",
        "30312",
        "20347",
        "11060",
        "11069",
        "11196",
        "4052",
        "24"
      ]
    },
    {
      "hadith_no": "1377",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا الحسن بن عيسى، أخبرنا ابن المبارك، أخبرنا مالك بن مغول، قال سمعت الحكم بن عتيبة، يحدث عن عبد الرحمن بن أبي ليلى، عن كعب بن عجرة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ معقبات لا يخيب قائلهن - أو فاعلهن - دبر كل صلاة مكتوبة ثلاث وثلاثون تسبيحة وثلاث وثلاثون تحميدة وأربع وثلاثون تكبيرة ‏\"‏ ‏.‏",
      "text_en": " Ka'b b. 'Ujra reported Allah's Messenger (may peace be upon him) as saying:                      There are certain ejaculations, the repeaters of which or the performers of which after every prescribed prayer will never be caused disappointment:\" Glory be to Allah\" thirty-three times.\" Praise be to Allah\" thirty-three times, and\" Allah is most Great\" thirty-four times.",
      "chain": [
        "20025",
        "20358",
        "11069",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "1378",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا نصر بن علي الجهضمي، حدثنا أبو أحمد، حدثنا حمزة الزيات، عن الحكم، عن عبد الرحمن بن أبي ليلى، عن كعب بن عجرة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ معقبات لا يخيب قائلهن - أو فاعلهن - ثلاث وثلاثون تسبيحة وثلاث وثلاثون تحميدة وأربع وثلاثون تكبيرة في دبر كل صلاة ‏\"‏ ‏.‏  حدثني محمد بن حاتم، حدثنا أسباط بن محمد، حدثنا عمرو بن قيس الملائي، عن الحكم، بهذا الإسناد مثله ‏.‏",
      "text_en": " Ka'b b. 'Ujra reported Allah's Messenger (may peace be upon him) as saying:                      There are certain ejaculations, the repeaters of which or the performers of which at the end of every prayer will never be caused disappointment:\" Glory be to Allah\" thirty-three times,\" Praise be to Allah\" thirty-three times, and\" Allah is most Great\" thirty-four times.",
      "chain": [
        "30395",
        "20355",
        "20583",
        "11069",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "2038",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "وحدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن منصور، عن عمرو بن مرة، عن أبي عبيدة، عن كعب بن عجرة، قال دخل المسجد وعبد الرحمن بن أم الحكم يخطب قاعدا فقال انظروا إلى هذا الخبيث يخطب قاعدا وقال الله تعالى ‏{‏ وإذا رأوا تجارة أو لهوا انفضوا إليها وتركوك قائما‏}‏",
      "text_en": " Ka'b b. 'Ujra reported that he entered the mosque and saw Abd al-Rahman b. Umm Hakam delivering the sermon in a sitting posture. Upon this he said:                      Look at this wretched person; he delivers the sermon while sitting, whereas Allah said:\" And when they see merchandise or sport, they break away to it and leave thee standing.\"",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "11067",
        "11381",
        "10",
        "4052"
      ]
    },
    {
      "hadith_no": "2934",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني عبيد الله بن عمر القواريري، حدثنا حماد، - يعني ابن زيد - عن أيوب، ح وحدثني أبو الربيع، حدثنا حماد، حدثنا أيوب، قال سمعت مجاهدا، يحدث عن عبد الرحمن، بن أبي ليلى عن كعب بن عجرة، - رضى الله عنه - قال أتى على رسول الله صلى الله عليه وسلم زمن الحديبية وأنا أوقد تحت - قال القواريري قدر لي ‏.‏ وقال أبو الربيع برمة لي - والقمل يتناثر على وجهي فقال ‏\"‏ أيؤذيك هوام رأسك ‏\"‏ ‏.‏ قال قلت نعم ‏.‏ قال ‏\"‏ فاحلق وصم ثلاثة أيام أو أطعم ستة مساكين أو انسك نسيكة ‏\"‏ ‏.‏ قال أيوب فلا أدري بأى ذلك بدأ ‏.‏",
      "text_en": " Ka'b b. 'Ujra (Allah be pleased with him) reported:                      The Messenger of Allah (may peace be upon him) came to me on the occasion of Hudaibiya and I was kindling fire under my cooking pot and lice were creeping on my face. Thereupon he (the Holy Prophet) said: Do the vermins harm your head? I said: Yes. He said: Get your head shaved and (in lieu of it) observe fasts for three days or feed six needy persons, or offer sacrifice (of an animal). Ayyub said: I do not know with what (type of expiation) did he commence (the statement).",
      "chain": [
        "30024",
        "20022",
        "11015",
        "30137",
        "20022",
        "11015",
        "11028",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "2936",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا محمد بن المثنى، حدثنا ابن أبي عدي، عن ابن عون، عن مجاهد، عن عبد الرحمن بن أبي ليلى، عن كعب بن عجرة، - رضى الله عنه - قال في أنزلت هذه الآية ‏{‏ فمن كان منكم مريضا أو به أذى من رأسه ففدية من صيام أو صدقة أو نسك‏}‏ قال فأتيته فقال ‏\"‏ ادنه ‏\"‏ ‏.‏ فدنوت فقال ‏\"‏ ادنه ‏\"‏ ‏.‏ فدنوت ‏.‏ فقال صلى الله عليه وسلم ‏\"‏ أيؤذيك هوامك ‏\"‏ ‏.‏ قال ابن عون وأظنه قال نعم ‏.‏ قال فأمرني بفدية من صيام أو صدقة أو نسك ما تيسر ‏.‏",
      "text_en": " Kalb b. Ujra (Allah be pleased with him) reported:                      It was I for whom this verse was revealed (to the Holy Prophet):\" Whoever among you is sick or has an ail- ment of the head, he (may effect) a compensation by lasting or alms or a sacrifice\" He said: I came to him (the Holy Prophet) and he said: Come Dear. So I went near. He (again) said: Come near. So I went near. Thereupon the Messenger of Allah (may peace be upon him) said: Do the vermins trouble you? Ibn Aun (one of the narrators) said: I think he (Ka'b b. Ujra) replied in the affirmative. He (the Holy Prophet) then commanded to do compensation by fasting or by giving sadaqa (feeding six needy persons) or by sacrifice (of a animal) that is available.",
      "chain": [
        "30170",
        "20276",
        "11071",
        "11028",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "2937",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا ابن نمير، حدثنا أبي، حدثنا سيف، قال سمعت مجاهدا، يقول حدثني عبد، الرحمن بن أبي ليلى حدثني كعب بن عجرة، - رضى الله عنه - أن رسول الله صلى الله عليه وسلم وقف عليه ورأسه يتهافت قملا فقال ‏\"‏ أيؤذيك هوامك ‏\"‏ ‏.‏ قلت نعم ‏.‏ قال ‏\"‏ فاحلق رأسك ‏\"‏ ‏.‏ قال ففي نزلت هذه الآية ‏{‏ فمن كان منكم مريضا أو به أذى من رأسه ففدية من صيام أو صدقة أو نسك‏}‏ فقال لي رسول الله صلى الله عليه وسلم ‏\"‏ صم ثلاثة أيام أو تصدق بفرق بين ستة مساكين أو انسك ما تيسر ‏\"‏ ‏.‏",
      "text_en": " Ka'b b. 'Ujra (Allah be pleased with him) reported that the Messenger of Allah (may peace be, upon him) stood near him and lice were falling from his head. Thereupon he (the Holy Prophet) said:                      Do these vermins trouble you? I said: Yes. Thereupon he said: Then shave your head; and it was in connection with me that this verse was revealed:\" Whoever among you is sick or has an ailment of the head, he (may effect) a compensation by fasting or alms or a sacrifice\". He (the Holy Prophet, therefore) said to me: Observe fast for three days or give a quantity of alms enough to feed six needy persons or offer sacrifice (of an animal) that is available.",
      "chain": [
        "30212",
        "20331",
        "11558",
        "11028",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "2938",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا محمد بن أبي عمر، حدثنا سفيان، عن ابن أبي نجيح، وأيوب، وحميد، وعبد، الكريم عن مجاهد، عن ابن أبي ليلى، عن كعب بن عجرة، - رضى الله عنه - أن النبي صلى الله عليه وسلم مر به وهو بالحديبية قبل أن يدخل مكة وهو محرم وهو يوقد تحت قدر والقمل يتهافت على وجهه فقال ‏\"‏ أيؤذيك هوامك هذه ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ فاحلق رأسك وأطعم فرقا بين ستة مساكين - والفرق ثلاثة آصع - أو صم ثلاثة أيام أو انسك نسيكة ‏\"‏ ‏.‏ قال ابن أبي نجيح ‏\"‏ أو اذبح شاة ‏\"‏ ‏.‏",
      "text_en": " Ka'b b. 'Ujra (Allah be pleased with him) reported that the Apostle of Allah (may peace be upon him) happened to pass by him at Hudaibiya before entering Mecca in a state of Ibrim and he (Ka'b) was kindling fire under the cooking pot and virmins were creeping on his (Kalb's) face. Thereupon (the Holy Prophet) said:                      Dothese vermins trouble you? He (Ka'b) said: Yes. The Messenger of Allah (way peace be upon him) said: Shave your head and give some quantity of food enough to feed six needy persons (faraq is equal to three sa's), or observe fast for three days or offer sacri- fice of a sacrificial animal. Ibn Najih (one of the narrators) said:\" Or sacrifice a goat.\"",
      "chain": [
        "20012",
        "11254",
        "11015",
        "11279",
        "18655",
        "11028",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "2939",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا يحيى بن يحيى، أخبرنا خالد بن عبد الله، عن خالد، عن أبي قلابة، عن عبد الرحمن بن أبي ليلى، عن كعب بن عجرة، رضى الله عنه أن رسول الله صلى الله عليه وسلم مر به زمن الحديبية فقال له ‏\"‏ آذاك هوام رأسك ‏\"‏ ‏.‏ قال نعم ‏.‏ فقال له النبي صلى الله عليه وسلم ‏\"‏ احلق رأسك ثم اذبح شاة نسكا أو صم ثلاثة أيام أو أطعم ثلاثة آصع من تمر على ستة مساكين ‏\"‏ ‏.‏",
      "text_en": " Ka'b b. Ujra (Allah be pleased with him) reported that the Messenger of Allah (may peace be upon him) happened to pass by him during the period of Hudaibiya. Thereupon he (the Holy Prophet) said to him (Ka'b b. Ujra):                      Do these vermins trouble your head? He said: Yes. Thereupon he (the Holy Prophet) said: Shave your head. Then sacrifice a goat or observe fasts for three days or give three sits of dates to feed six needy persons.",
      "chain": [
        "30399",
        "20423",
        "11282",
        "11047",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "2941",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن نمير، عن زكرياء بن أبي زائدة، حدثنا عبد الرحمن بن الأصبهاني، حدثني عبد الله بن معقل، حدثني كعب بن عجرة، - رضى الله عنه - أنه خرج مع النبي صلى الله عليه وسلم محرما فقمل رأسه ولحيته فبلغ ذلك النبي صلى الله عليه وسلم فأرسل إليه فدعا الحلاق فحلق رأسه ثم قال له ‏\"‏ هل عندك نسك ‏\"‏ ‏.‏ قال ما أقدر عليه ‏.‏ فأمره أن يصوم ثلاثة أيام أو يطعم ستة مساكين لكل مسكينين صاع فأنزل الله عز وجل فيه خاصة ‏{‏ فمن كان منكم مريضا أو به أذى من رأسه‏}‏ ثم كانت للمسلمين عامة ‏.‏",
      "text_en": " Ka'b b. Ujra (Allah be pleased with him) reported that he went out with the Apostle of Allah (may peace be upon him) in the state of Ihram, and his (Ka'b's) head and beard were infested with lice. This was conveyed to the Apostle of Allah (may peace be upon him). He sent for him (Ka'b) and called a barber (who) shaved his head. He (the Holy Prophet) said. Is there any sacrificial animal with you? He (Kalb) said:                      I cannot afford it. He then commanded him to observe fasts for three days or feed six needy persons, one sa' for every two needy persons. And Allah the Exalted and Majestic revealed this (verse) particular with regard to him:\" So whosoever among you is sick and has an ailment of the head..\" ; then (its application) became general for the Muslims.",
      "chain": [
        "30201",
        "20331",
        "11338",
        "11364",
        "18580",
        "4052"
      ]
    },
    {
      "hadith_no": "562",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن سليمان الأنباري، أن عبد الملك بن عمرو، حدثهم عن داود بن قيس، قال حدثني سعد بن إسحاق، عن أبي سعيد المقبري، حدثني أبو ثمامة الحناط، أن كعب بن عجرة، أدركه وهو يريد المسجد أدرك أحدهما صاحبه قال فوجدني وأنا مشبك بيدى فنهاني عن ذلك وقال إن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا توضأ أحدكم فأحسن وضوءه ثم خرج عامدا إلى المسجد فلا يشبكن يديه فإنه في صلاة ‏\"‏ ‏.‏",
      "text_en": " Narrated Ka'b ibn Ujrah:                     AbuThumamah al-Hannat said that Ka'b ibn Ujrah met him while he was going to the mosque; one of the two (companions) met his companion (on his way to the mosque) And he met crossing the fingers of my both hands. He prohibited me to do so, and said: The Messenger of Allah (ﷺ) has said: If any of you performs ablution, and performs his ablution perfectly, and then goes out intending for the mosque, he should not cross the fingers of his hand because he is already in prayer.",
      "chain": [
        "31160",
        "11845",
        "11212",
        "13559",
        "4052"
      ]
    },
    {
      "hadith_no": "976",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن الحكم، عن ابن أبي ليلى، عن كعب بن عجرة، قال قلنا أو قالوا يا رسول الله أمرتنا أن نصلي عليك وأن نسلم عليك فأما السلام فقد عرفناه فكيف نصلي عليك قال ‏\"‏ قولوا اللهم صل على محمد وآل محمد كما صليت على إبراهيم وبارك على محمد وآل محمد كما باركت على آل إبراهيم إنك حميد مجيد ‏\"‏ ‏.‏",
      "text_en": " Ka’b b. ‘Ujrah said:                      We said or the people said: Messenger of Allah, you have commanded us to invoke blessing on you and to salute you. As regards salutation we have already learnt it. How should we invoke blessing? He said: Say: “O Allah, bless Muhammad and Muhammad’s family as Thou didst bless Abraham and Abraham’s family. O Allah, grant favours to Muhammad and Muhammad’s family as Thou didst grant favours to Abraham; Thou art indeed praiseworthy and glorious.",
      "chain": [
        "30329",
        "20020",
        "11069",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "1856",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا وهب بن بقية، عن خالد الطحان، عن خالد الحذاء، عن أبي قلابة، عن عبد الرحمن بن أبي ليلى، عن كعب بن عجرة، أن رسول الله صلى الله عليه وسلم مر به زمن الحديبية فقال ‏\"‏ قد آذاك هوام رأسك ‏\"‏ ‏.‏ قال نعم ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ احلق ثم اذبح شاة نسكا أو صم ثلاثة أيام أو أطعم ثلاثة آصع من تمر على ستة مساكين ‏\"‏ ‏.‏",
      "text_en": " Ka’ab bin ‘Ujrah said that the Apostle of Allaah(ﷺ) came upon him (during their stay) at Al Hudaibiyyah. He asked do the insects of your head (lice) annoy you? He said Yes. The Prophet (ﷺ) said Shave your head, then sacrifice a sheep as offering or fast three days or give three sa’s of dates to six poor people.",
      "chain": [
        "30569",
        "20423",
        "11282",
        "11047",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "1857",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، عن داود، عن الشعبي، عن عبد الرحمن بن أبي ليلى، عن كعب بن عجرة، أن رسول الله صلى الله عليه وسلم قال له ‏\"‏ إن شئت فانسك نسيكة وإن شئت فصم ثلاثة أيام وإن شئت فأطعم ثلاثة آصع من تمر لستة مساكين ‏\"‏ ‏.‏",
      "text_en": " Ka’ab bin ‘Ujrah said that the Apostle of Allaah(ﷺ) said to him, If you like sacrifice an animal or if you like fast three days or if you like give three sa’s of dates to six poor people.",
      "chain": [
        "20040",
        "20022",
        "11052",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "1858",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا ابن المثنى، حدثنا عبد الوهاب، ح وحدثنا نصر بن علي، حدثنا يزيد بن زريع، - وهذا لفظ ابن المثنى - عن داود، عن عامر، عن كعب بن عجرة، أن رسول الله صلى الله عليه وسلم مر به زمن الحديبية فذكر القصة فقال ‏\"‏ أمعك دم ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ فصم ثلاثة أيام أو تصدق بثلاثة آصع من تمر على ستة مساكين بين كل مسكينين صاع ‏\"‏ ‏.‏",
      "text_en": " Narrated Ka'b ibn Ujrah:                     The Messenger of Allah (ﷺ) came upon him (during their stay) at al-Hudaybiyyah. He then narrated the rest of the tradition. This version adds: \"He asked: Do you have a sacrificial animal? He replied: No. He then said: Fast three days or give three sa's of dates to six poor people, giving one sa' to every two persons.\"",
      "chain": [
        "30170",
        "20259",
        "30395",
        "20304",
        "11052",
        "4052"
      ]
    },
    {
      "hadith_no": "1859",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا الليث، عن نافع، أن رجلا، من الأنصار أخبره عن كعب بن عجرة، - وكان قد أصابه في رأسه أذى فحلق فأمره النبي صلى الله عليه وسلم أن يهدي هديا بقرة ‏.‏",
      "text_en": " A man from the Ansar said on the authority of Ka'b ibn Ujrah that he was feeling pain in his head (due to lice); so he shaved his head. The Prophet (ﷺ) ordered him to sacrifice a cow as offering.",
      "chain": [
        "30367",
        "20023",
        "11014",
        "4052"
      ]
    },
    {
      "hadith_no": "1860",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن منصور، حدثنا يعقوب، حدثني أبي، عن ابن إسحاق، حدثني أبان، - يعني ابن صالح - عن الحكم بن عتيبة، عن عبد الرحمن بن أبي ليلى، عن كعب بن عجرة، قال أصابني هوام في رأسي وأنا مع، رسول الله صلى الله عليه وسلم عام الحديبية حتى تخوفت على بصري فأنزل الله سبحانه وتعالى ‏{‏ فمن كان منكم مريضا أو به أذى من رأسه ‏}‏ الآية فدعاني رسول الله صلى الله عليه وسلم فقال لي ‏\"‏ احلق رأسك وصم ثلاثة أيام أو أطعم ستة مساكين فرقا من زبيب أو انسك شاة ‏\"‏ ‏.‏ فحلقت رأسي ثم نسكت ‏.‏",
      "text_en": " Ka’b bin ‘Ujrah said I had lice in my head when I accompanied the Apostle of Allaah(ﷺ) in the year of Al Hudaibiyyah so much so that I feared about my eyesight. So Allaah, the exalted revealed these verses about me. “And whoever among you is sick or hath an aliment of the head.” The Apostle of Allaah(ﷺ) called me and said “Shave your head and fast three days or give a faraq of raisins to six poor men or sacrifice a goat. So, I shaved my head and sacrificed.",
      "chain": [
        "36658",
        "20184",
        "20150",
        "11107",
        "19897",
        "11069",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "101",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا هناد، حدثنا علي بن مسهر، عن الأعمش، عن الحكم، عن عبد الرحمن بن أبي ليلى، عن كعب بن عجرة، عن بلال، أن النبي صلى الله عليه وسلم مسح على الخفين والخمار ‏.‏",
      "text_en": " BilaI narrated:                     \"The Prophet wiped over the Khuff and the Khimar.\"",
      "chain": [
        "30480",
        "20345",
        "11060",
        "11069",
        "11196",
        "4052",
        "24"
      ]
    },
    {
      "hadith_no": "386",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة، حدثنا الليث، عن ابن عجلان، عن سعيد المقبري، عن رجل، عن كعب بن عجرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا توضأ أحدكم فأحسن وضوءه ثم خرج عامدا إلى المسجد فلا يشبكن بين أصابعه فإنه في صلاة ‏\"‏ ‏.‏ قال أبو عيسى حديث كعب بن عجرة رواه غير واحد عن ابن عجلان مثل حديث الليث ‏.‏ وروى شريك عن محمد بن عجلان عن أبيه عن أبي هريرة عن النبي صلى الله عليه وسلم نحو هذا الحديث وحديث شريك غير محفوظ ‏.‏",
      "text_en": " Ka'b bun Ujrah narrated that:                     Allah's Messenger (S) said: \"When one of you performs Wudu and does so well, then he leaves intending to go to the Masjid, then let him not intertwine his fingers, for indeed he is in Salat.\"",
      "chain": [
        "30367",
        "20023",
        "10616",
        "11168",
        "4052"
      ]
    },
    {
      "hadith_no": "483",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Al-Witr - أَبْوَابُ الْوِتْرِ",
      "chapter_no": "3",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو أسامة، عن مسعر، والأجلح، ومالك بن مغول، عن الحكم بن عتيبة، عن عبد الرحمن بن أبي ليلى، عن كعب بن عجرة، قال قلنا يا رسول الله هذا السلام عليك قد علمنا فكيف الصلاة عليك قال ‏\"‏ قولوا اللهم صل على محمد وعلى آل محمد كما صليت على إبراهيم إنك حميد مجيد وبارك على محمد وعلى آل محمد كما باركت على إبراهيم إنك حميد مجيد ‏\"‏ ‏.‏ قال محمود قال أبو أسامة وزادني زائدة عن الأعمش عن الحكم عن عبد الرحمن بن أبي ليلى قال ونحن نقول وعلينا معهم ‏.‏ قال وفي الباب عن علي وأبي حميد وأبي مسعود وطلحة وأبي سعيد وبريدة وزيد بن خارجة ويقال ابن جارية وأبي هريرة ‏.‏ قال أبو عيسى حديث كعب بن عجرة حديث حسن صحيح ‏.‏ وعبد الرحمن بن أبي ليلى كنيته أبو عيسى وأبو ليلى اسمه يسار ‏.‏",
      "text_en": " Ka'b bin Ujrah narrated:                     \"We said: 'O Messenger of Allah! We have learned about saying the Salam to you, but how about As-Salat upon you?' He said: 'Say: (Allahumma salli ala Muhammadin Wa Ala ali Muhammadin kama sallaita Ala Ibrahim, Innaka hamidan MAjid, Wa barik Ala Muhammadin wa Ala ali Muhammadin kamma barakta Ala Ibrahim Innaka Hamidan Majid)\" O Allah! Send Salat upon Muhammad and upon Muhammad's family just as You have sent Salat upon Ibrahim, indeed You are the Praise and Majestic. And send blessings upon Muhammad and Muhammad's family just as You have sent blessing upon Ibrahim, indeed You are the Praised and Majestic.'Mahmud said: \"Abu Usamah said: Za'idah added something for me, from Al-Amash, from Al-Hakam, from Abdur-Rahman bin Abi Laila, that he said: \"We would say 'And upon us along with them.'\"",
      "chain": [
        "30277",
        "20318",
        "20359",
        "20358",
        "11069",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "614",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Traveling - أَبْوَابُ السَّفَرِ",
      "chapter_no": "6",
      "text_ar": "حدثنا عبد الله بن أبي زياد القطواني الكوفي، حدثنا عبيد الله بن موسى، حدثنا غالب أبو بشر، عن أيوب بن عائذ الطائي، عن قيس بن مسلم، عن طارق بن شهاب، عن كعب بن عجرة، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ أعيذك بالله يا كعب بن عجرة من أمراء يكونون من بعدي فمن غشي أبوابهم فصدقهم في كذبهم وأعانهم على ظلمهم فليس مني ولست منه ولا يرد على الحوض ومن غشي أبوابهم أو لم يغش فلم يصدقهم في كذبهم ولم يعنهم على ظلمهم فهو مني وأنا منه وسيرد على الحوض يا كعب بن عجرة الصلاة برهان والصوم جنة حصينة والصدقة تطفئ الخطيئة كما يطفئ الماء النار ‏.‏ يا كعب بن عجرة إنه لا يربو لحم نبت من سحت إلا كانت النار أولى به ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه لا نعرفه إلا من حديث عبيد الله بن موسى ‏.‏ وأيوب بن عائذ الطائي يضعف ويقال كان يرى رأى الإرجاء ‏.‏ وسألت محمدا عن هذا الحديث فلم يعرفه إلا من حديث عبيد الله بن موسى واستغربه جدا ‏.‏",
      "text_en": " Ka'b bin Ujrah narrated:                     \"The Messenger of Allah said to me: 'I seek refuge in Allah for you O Ka'b bin Ujrah from leader that will be after me. Whoever comes to their doors to approve of their lies and supports them in their oppression, then he is not of me and I am not of him, and he will not meet me at the Hawd. And whoever comes to their doors, or he does not come, and he does not approve of their lies and he does not support them in their oppression, then he is from me and I am from him, and he will meet me at the Hawd.  Ka'ab bin Ujrah! Salat is clear proof, and Sawm (fasting) is an impregnable shield, and Sadaqah (charity) extinguishes sins just as water extinguishes fire. O Ka'b bin Ujrah! There is no flesh raised that sprouts from the unlawful except that the Fire is more appropriate for it.'\"",
      "chain": [
        "20340",
        "11621",
        "11386",
        "3680",
        "4052"
      ]
    },
    {
      "hadith_no": "953",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان بن عيينة، عن أيوب السختياني، وابن أبي نجيح، وحميد الأعرج، وعبد الكريم، عن مجاهد، عن عبد الرحمن بن أبي ليلى، عن كعب بن عجرة، أن النبي صلى الله عليه وسلم مر به وهو بالحديبية قبل أن يدخل مكة وهو محرم وهو يوقد تحت قدر والقمل يتهافت على وجهه فقال ‏\"‏ أتؤذيك هوامك هذه ‏\"‏ ‏.‏ فقال نعم ‏.‏ فقال ‏\"‏ احلق وأطعم فرقا بين ستة مساكين ‏\"‏ ‏.‏ والفرق ثلاثة آصع ‏\"‏ أو صم ثلاثة أيام أو انسك نسيكة ‏\"‏ ‏.‏ قال ابن أبي نجيح ‏\"‏ أو اذبح شاة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ والعمل عليه عند بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم أن المحرم إذا حلق رأسه أو لبس من الثياب ما لا ينبغي له أن يلبس في إحرامه أو تطيب فعليه الكفارة بمثل ما روي عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Abdur-Rahman bin Abu Laila narrated from Ka'b bin Ujrah that:                     The Prophet passed by him while he was at Al-Hudaibiyah, before entering Makkah, and he was a Muhrim. He had lit a fire under a cooking pot and lice were falling all over his face. So he (the Prophet) said: \"Have these lice of yours troubled you?\" He said: \"Yes.\" He said: \"Shave and feed six of the poor with a Faraq\" and a Faraq is three Sa - \"or fast three days, or slaughter a sacrifice.\" Ibn Abi Najih (one of the narrators) said: \"Or slaughter a sheep.\"",
      "chain": [
        "30421",
        "20005",
        "11015",
        "11254",
        "18655",
        "11028",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "2259",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا هارون بن إسحاق الهمداني، حدثني محمد بن عبد الوهاب، عن مسعر، عن أبي حصين، عن الشعبي، عن عاصم العدوي، عن كعب بن عجرة، قال خرج إلينا رسول الله صلى الله عليه وسلم ونحن تسعة خمسة وأربعة أحد العددين من العرب والآخر من العجم فقال ‏\"‏ اسمعوا هل سمعتم أنه سيكون بعدي أمراء فمن دخل عليهم فصدقهم بكذبهم وأعانهم على ظلمهم فليس مني ولست منه وليس بوارد على الحوض ومن لم يدخل عليهم ولم يعنهم على ظلمهم ولم يصدقهم بكذبهم فهو مني وأنا منه وهو وارد على الحوض ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث صحيح غريب لا نعرفه من حديث مسعر إلا من هذا الوجه ‏.‏ قال هارون فحدثني محمد بن عبد الوهاب، عن سفيان، عن أبي حصين، عن الشعبي، عن عاصم العدوي، عن كعب بن عجرة، عن النبي صلى الله عليه وسلم نحوه ‏.‏قال هارون وحدثني محمد، عن سفيان، عن زبيد، عن إبراهيم، وليس، بالنخعي عن كعب بن عجرة، عن النبي صلى الله عليه وسلم نحو حديث مسعر ‏.‏ قال وفي الباب عن حذيفة ‏.‏",
      "text_en": " It was narrated from Ka'b bin 'Ujrah who said:                     \"The Messenger of Allah(s.a.w) came out to us, we were made up of nine; five and four. The first of the numbers for the Arabs, and the latter for the non-Arabs. He said: 'Listen, have you heard that after me there will leaders, whoever enters upon them and condones to their lies, and supports them in their oppression, then he is not from me and I am not from him, and he shall not drink with me from the Hawd. And whoever does not enter upon them, nor help them in their oppression, nor condones to their lies, then he is from me, and I am from him, and he shall drink with me at the Hawd.'\"",
      "chain": [
        "35158",
        "20359",
        "11371",
        "11052",
        "15260",
        "4052"
      ]
    },
    {
      "hadith_no": "3237",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا علي بن حجر، أخبرنا هشيم، أخبرنا مغيرة، عن مجاهد، قال قال كعب بن عجرة والذي نفسي بيده لفي أنزلت هذه الآية وإياى عنى بها ‏:‏ ‏(‏فمن كان منكم مريضا أو به أذى من رأسه ففدية من صيام أو صدقة أو نسك ‏)‏ قال كنا مع النبي صلى الله عليه وسلم بالحديبية ونحن محرمون وقد حصرنا المشركون وكانت لي وفرة فجعلت الهوام تساقط على وجهي فمر بي النبي صلى الله عليه وسلم فقال ‏\"‏ كأن هوام رأسك تؤذيك ‏\"‏ ‏.‏ قال قلت نعم ‏.‏ قال ‏\"‏ فاحلق ‏\"‏ ‏.‏ ونزلت هذه الآية ‏.‏ قال مجاهد الصيام ثلاثة أيام والطعام ستة مساكين والنسك شاة فصاعدا ‏.‏",
      "text_en": " Narrated Mujahid:                     that Ka'b bin 'Ujrah said: \"By the one in Whose Hand is my soul! This Ayah was revealed referring to my case: 'And whosoever of you is ill or has an ailment on his scalp (necessitating shaving) he must pay Fidyah of either fasting or giving charity, or a sacrifice. (2:196)'\" He said: \"We were with the Messenger of Allah (ﷺ) at Al-Hudaibiyyah and we were in a state of Ihram. The idolaters had held us back, and I had a good deal of hair, and the lice were falling on my face. The Prophet (ﷺ) passed by me and said: 'The lice on your head are bothering you?'\" He said: \"I said: 'Yes.' He said: 'Then shave.' And this Ayah was revealed.\" Mujahid said: \"The fasting is for three days, the feeding is six needy people, and the sacrifice is a sheep or more.\"",
      "chain": [
        "20387",
        "20468",
        "11072",
        "11028",
        "4052"
      ]
    },
    {
      "hadith_no": "3238",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا علي بن حجر، حدثنا هشيم، عن أبي بشر، عن مجاهد، عن عبد الرحمن بن أبي ليلى، عن كعب بن عجرة، عن النبي صلى الله عليه وسلم بنحو ذلك ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": "",
      "chain": [
        "20387",
        "20468",
        "11419",
        "11028",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "3239",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا علي بن حجر، حدثنا هشيم، عن أشعث بن سوار، عن الشعبي، عن عبد الله بن معقل، عن كعب بن عجرة، عن النبي صلى الله عليه وسلم بنحو ذلك ‏.‏ قال أبو عيسى هذا حديث حسن صحيح وقد رواه عبد الرحمن بن الأصبهاني عن عبد الله بن معقل أيضا ‏.‏",
      "text_en": "",
      "chain": [
        "20387",
        "20468",
        "10891",
        "11052",
        "18580",
        "4052"
      ]
    },
    {
      "hadith_no": "3240",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا علي بن حجر، أخبرنا إسماعيل بن إبراهيم، عن أيوب، عن مجاهد، عن عبد الرحمن بن أبي ليلى، عن كعب بن عجرة، قال أتى على رسول الله صلى الله عليه وسلم وأنا أوقد تحت قدر والقمل تتناثر على جبهتي أو قال حاجبي فقال ‏\"‏ أتؤذيك هوام رأسك ‏\"‏ ‏.‏ قال قلت نعم ‏.‏ قال ‏\"‏ فاحلق رأسك وانسك نسيكة أو صم ثلاثة أيام أو أطعم ستة مساكين ‏\"‏ ‏.‏ قال أيوب لا أدري بأيتهن بدأ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated 'Abdur-Rahman bin Abi Laila:                     from Ka'b bin 'Ujrah who said: \"The Messenger of Allah (ﷺ) came to me while I was lighting a fire under a pot, and lice were falling on my face, or on my eye-brows. He said: 'Are your lice bothering you?'\" [He said:] \"I said: 'Yes.' He said: 'Then shave your head and offer a sacrifice, or fast three days, or feed six needy people.'\" Ayyub said: \"I do not know which of them he started with.\"",
      "chain": [
        "20387",
        "20208",
        "11015",
        "11028",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "3412",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا محمد بن إسماعيل بن سمرة الأحمسي الكوفي، حدثنا أسباط بن محمد، حدثنا عمرو بن قيس الملائي، عن الحكم بن عتيبة، عن عبد الرحمن بن أبي ليلى، عن كعب بن عجرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ معقبات لا يخيب قائلهن يسبح الله في دبر كل صلاة ثلاثا وثلاثين ويحمده ثلاثا وثلاثين ويكبره أربعا وثلاثين ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ وعمرو بن قيس الملائي ثقة حافظ ‏.‏ وروى شعبة هذا الحديث عن الحكم ولم يرفعه ‏.‏ ورواه منصور بن المعتمر عن الحكم ورفعه ‏.‏",
      "text_en": " Ka’b bin Ujrah narrated that:                     The Prophet said: “There are Mu’aqqibat, he who says them shall not be miserable. Glorify Allah at the end of every prayer thirty-three times, and praise him thirty-three times, and extol His greatness thirty-four times.”",
      "chain": [
        "34188",
        "20408",
        "10803",
        "11069",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "104",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا الحسين بن منصور، قال حدثنا أبو معاوية، حدثنا الأعمش، ح وأنبأنا الحسين بن منصور، قال حدثنا عبد الله بن نمير، قال حدثنا الأعمش، عن الحكم، عن عبد الرحمن بن أبي ليلى، عن كعب بن عجرة، عن بلال، قال رأيت النبي صلى الله عليه وسلم يمسح على الخفين والخمار ‏.‏",
      "text_en": " It was narrated that Bilal said:                      \"I saw the Prophet (ﷺ) wiping over the Khuff and the Khimar.\"[1] A head covering not limited to the common usage of \"turban\" as is clear from the first narration.",
      "chain": [
        "38181",
        "20354",
        "11060",
        "38181",
        "20331",
        "11060",
        "11069",
        "11196",
        "4052",
        "24"
      ]
    },
    {
      "hadith_no": "1287",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا القاسم بن زكريا بن دينار، من كتابه قال حدثنا حسين بن علي، عن زائدة، عن سليمان، عن عمرو بن مرة، عن عبد الرحمن بن أبي ليلى، عن كعب بن عجرة، قال قلنا يا رسول الله السلام عليك قد عرفناه فكيف الصلاة قال ‏\"‏ قولوا اللهم صل على محمد وعلى آل محمد كما صليت على آل إبراهيم إنك حميد مجيد اللهم بارك على محمد وعلى آل محمد كما باركت على آل إبراهيم إنك حميد مجيد ‏\"‏ ‏.‏ قال ابن أبي ليلى ونحن نقول وعلينا معهم ‏.‏ قال أبو عبد الرحمن حدثنا به من كتابه وهذا خطأ ‏.‏",
      "text_en": " It was narrated that Ka'b bin 'Ujrah said:                     \"We said: 'O Messenger of Allah (ﷺ), we know about sending salams upon you, but how should we send salah upon you?' He said: \"Say: 'Alahumma salli 'ala Muhammad wa 'ala ali Muhammad, kama sallaita 'ala Ibrahima wa barik 'ala Muhammad kama barakta 'ala ali Ibrahim fil-'alamin, innaka hamidun majid (O Allah, send salah upon Muhammad and upon the family of Muhammad, as You sent salah upon the family of Ibrahim, and send blessings upon Muhammad and upon the family of Muhammad as You sent blessings upon the family of Ibrahim among the nations. You are indeed Worthy of praise, Full of glory.)'\" (One of the narrators) Ibn Abi Laila said: \"We used to say: 'And also upon us.'\" Abu Abdur-Rahman (An-Nasa'I) said: It was narrated from his book, and this is a mistake.",
      "chain": [
        "36617",
        "20315",
        "20320",
        "11060",
        "11381",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "1288",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا القاسم بن زكريا، قال حدثنا حسين، عن زائدة، عن سليمان، عن الحكم، عن عبد الرحمن بن أبي ليلى، عن كعب بن عجرة، قال قلنا يا رسول الله السلام عليك قد عرفناه فكيف الصلاة عليك قال ‏\"‏ قولوا اللهم صل على محمد وعلى آل محمد كما صليت على إبراهيم وآل إبراهيم إنك حميد مجيد وبارك على محمد وعلى آل محمد كما باركت على إبراهيم وآل إبراهيم إنك حميد مجيد ‏\"‏ ‏.‏ قال عبد الرحمن ونحن نقول وعلينا معهم ‏.‏ قال أبو عبد الرحمن وهذا أولى بالصواب من الذي قبله ولا نعلم أحدا قال فيه عمرو بن مرة غير هذا والله تعالى أعلم ‏.‏",
      "text_en": " It was narrated that Ka'b bin 'Ujrah said:                     'We said: \"O Messenger of Allah (ﷺ), we know about sending salams upon you, but how should we send salah upon you?\" He said: 'Say: Alahumma salli 'ala Muhammad wa 'ala ali Muhammad, kama sallaita 'ala Ibrahima wa barik 'ala Muhammad kama barakta 'ala ali Ibrahim fil-'alamin, innaka hamidun majid (O Allah, send salah upon Muhammad and upon the family of Muhammad, as You sent salah upon the family of Ibrahim, and send blessings upon Muhammad and upon the family of Muhammad as You sent blessings upon the family of Ibrahim among the nations. You are indeed Worthy of praise, Full of glory.)'\" (One of the narrators) 'abdur Rahman said: \"We used to say: 'And also upon us.'\" Abu Abdur-rahman (An Nasa'i) said: This is more worthy of being correct than the one that is before it. And we do not know of anyone who said \"Amr bin Murrah\" in it other than in this case. And Allah (SWT) knows best.",
      "chain": [
        "36617",
        "11278",
        "20320",
        "11060",
        "11069",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "1349",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا محمد بن إسماعيل بن سمرة، عن أسباط، قال حدثنا عمرو بن قيس، عن الحكم، عن عبد الرحمن بن أبي ليلى، عن كعب بن عجرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ معقبات لا يخيب قائلهن يسبح الله في دبر كل صلاة ثلاثا وثلاثين ويحمده ثلاثا وثلاثين ويكبره أربعا وثلاثين ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ka'b bin 'Ujrah said:                     \"The Messenger of Allah (ﷺ) said: 'There are statements of remembrance following the prayer of which the one who says them will never be deprive of the reward: Glorifying Allah (SWT) thirty-three times following each prayer, and praising Him thirty-three times, and magnifying Him thirty-four times.'\"",
      "chain": [
        "38475",
        "213",
        "11069",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "Grade",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرنا أحمد بن عبد الله بن الحكم، قال حدثنا محمد بن جعفر، قال حدثنا شعبة، عن منصور، عن عمرو بن مرة، عن أبي عبيدة، عن كعب بن عجرة، قال دخل المسجد وعبد الرحمن بن أم الحكم يخطب قاعدا فقال انظروا إلى هذا يخطب قاعدا وقد قال الله عز وجل ‏{‏ وإذا رأوا تجارة أو لهوا انفضوا إليها وتركوك قائما ‏}‏ ‏.‏",
      "text_en": " It was narrated that Ka'b bin 'Ujrah said that:                     He entered the masjid and 'Abdur-Rahman bin Umm Al-Hakam was delivering the Khutbah while seated. \"He said: 'Look at this man who is delivering the khutbah while seated when Allah (SWT) says: And when they see some merchandise or some amusement they disperse headlong to it, and leave you standing.'\"",
      "chain": [
        "20173",
        "20020",
        "11067",
        "11381",
        "10",
        "4052"
      ]
    },
    {
      "hadith_no": "2851",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن القاسم، قال حدثني مالك، عن عبد الكريم بن مالك الجزري، عن مجاهد، عن عبد الرحمن بن أبي ليلى، عن كعب بن عجرة، أنه كان مع رسول الله صلى الله عليه وسلم محرما فآذاه القمل في رأسه فأمره رسول الله صلى الله عليه وسلم أن يحلق رأسه وقال ‏\"‏ صم ثلاثة أيام أو أطعم ستة مساكين مدين مدين أو انسك شاة أى ذلك فعلت أجزأ عنك ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Kab bin Ujra:                     That he was with the Messenger of Allah in Ihram and he suffered an infestation of head lice. The Messenger of Allah commanded him to shave his head and told him: \"Fast for three days, or fed six poor persons two Mudds earch, or sacrifice a sheep. Whichever one of these you do will be sufficient for you.'\"",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "18655",
        "11028",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "2852",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرني أحمد بن سعيد الرباطي، قال أنبأنا عبد الرحمن بن عبد الله، - وهو الدشتكي - قال أنبأنا عمرو، - وهو ابن أبي قيس - عن الزبير، - وهو ابن عدي - عن أبي وائل، عن كعب بن عجرة، قال أحرمت فكثر قمل رأسي فبلغ ذلك النبي صلى الله عليه وسلم فأتاني وأنا أطبخ قدرا لأصحابي فمس رأسي بأصبعه فقال ‏\"‏ انطلق فاحلقه وتصدق على ستة مساكين ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Kab bin Ujrah said:                     \"I entered Ihram, then I had a severe infestation of head lice. News of that reached Prophet, and he came to me when I was cooking something in a pot for my companions, he touched my head with his finger and said: 'Go and shave it, and give charity to six poor persions.'\".",
      "chain": [
        "30295",
        "30588",
        "20726",
        "11336",
        "11353",
        "4052"
      ]
    },
    {
      "hadith_no": "4207",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of al-Bay'ah - كتاب البيعة",
      "chapter_no": "39",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا يحيى، عن سفيان، عن أبي حصين، عن الشعبي، عن عاصم العدوي، عن كعب بن عجرة، قال خرج علينا رسول الله صلى الله عليه وسلم ونحن تسعة فقال ‏\"‏ إنه ستكون بعدي أمراء من صدقهم بكذبهم وأعانهم على ظلمهم فليس مني ولست منه وليس بوارد على الحوض ومن لم يصدقهم بكذبهم ولم يعنهم على ظلمهم فهو مني وأنا منه وهو وارد على الحوض ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Kab bin Ujrah said:                     \"The Messenger of Allah came out to us, and there were nine of us. He said; 'After me there will be rulers, whoever believes in their lies and helps them in their wrongdoing is not of me, and I am not of him, and he will not come to me at the Cistern. Whoever does not believe their lies and does not help them in their wrongdoing, he is of me, and I am of hi, and he will come to me at the Cistern.\"'",
      "chain": [
        "30153",
        "20031",
        "20012",
        "11371",
        "11052",
        "15260",
        "4052"
      ]
    },
    {
      "hadith_no": "4208",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of al-Bay'ah - كتاب البيعة",
      "chapter_no": "39",
      "text_ar": "أخبرنا هارون بن إسحاق، قال حدثنا محمد، - يعني ابن عبد الوهاب - قال حدثنا مسعر، عن أبي حصين، عن الشعبي، عن عاصم العدوي، عن كعب بن عجرة، قال خرج إلينا رسول الله صلى الله عليه وسلم ونحن تسعة خمسة وأربعة أحد العددين من العرب والآخر من العجم فقال ‏\"‏ اسمعوا هل سمعتم أنه ستكون بعدي أمراء من دخل عليهم فصدقهم بكذبهم وأعانهم على ظلمهم فليس مني ولست منه وليس يرد على الحوض ومن لم يدخل عليهم ولم يصدقهم بكذبهم ولم يعنهم على ظلمهم فهو مني وأنا منه وسيرد على الحوض ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Kab bin Ujrah said:                     \"The Messenger of Allah came out to us and we were nine, fie and four, some 'Arabs and some non- 'Arabs. He said: 'Listen. Have you heard that after me there will be rulers, whoever enters upon them and believes their lies and help them in their wrongdoing is not of me, and I am not of him, and he will not come to me at the Cistern? Whoever does not enter upon them or belive their lies or help them in their wrongdoing is of me and I am of him, and he will come to me at the Cistern.\"'",
      "chain": [
        "35158",
        "20359",
        "11371",
        "11052",
        "15260",
        "4052"
      ]
    },
    {
      "hadith_no": "116",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا علي بن محمد، حدثنا عبد الله بن إدريس، عن هشام بن حسان، عن محمد بن سيرين، عن كعب بن عجرة، قال ذكر رسول الله  صلى الله عليه وسلم  فتنة فقربها فمر رجل مقنع رأسه فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ هذا يومئذ على الهدى ‏\"‏ ‏.‏ فوثبت فأخذت بضبعى عثمان ثم استقبلت رسول الله  صلى الله عليه وسلم  فقلت هذا قال ‏\"‏ هذا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ka'b bin 'Ujrah said:                     \"The Messenger of Allah mentioned a Fitnah (tribulation) that had drawn nigh. Then a man passed by with his head covered. The Messenger of Allah said: 'On that day, this man will be following right guidance.' I leapt up and took hold of 'Uthman's arms, then I turned to face the Messenger of Allah and said: 'This man?' He said: 'This man.'\"",
      "chain": [
        "38409",
        "20102",
        "11311",
        "11035",
        "4052"
      ]
    },
    {
      "hadith_no": "604",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا هشام بن عمار، حدثنا عيسى بن يونس، عن الأعمش، عن الحكم، عن عبد الرحمن بن أبي ليلى، عن كعب بن عجرة، عن بلال، أن رسول الله  صلى الله عليه وسلم  مسح على الخفين والخمار ‏.‏",
      "text_en": " It was narrated from Bilal that:                     The Messenger of Allah wiped over his leather socks and his head cover (i.e., over the Imamah).",
      "chain": [
        "30288",
        "20347",
        "11060",
        "11069",
        "11196",
        "4052",
        "24"
      ]
    },
    {
      "hadith_no": "1020",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا علقمة بن عمرو الدارمي، حدثنا أبو بكر بن عياش، عن محمد بن عجلان، عن سعيد المقبري، عن كعب بن عجرة، أن رسول الله  صلى الله عليه وسلم  رأى رجلا قد شبك أصابعه في الصلاة ففرج رسول الله  صلى الله عليه وسلم  بين أصابعه ‏.‏",
      "text_en": " It wasnarrated from Ka’b bin ‘Ujrah that the Messenger of Allah(ﷺ)saw a man who had interlocked his fingers during the prayer, sotheMessenger of Allah (ﷺ) separated his fingers.",
      "chain": [
        "20373",
        "10616",
        "11168",
        "4052"
      ]
    },
    {
      "hadith_no": "1117",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا محمد بن بشر، أنبأنا يزيد بن زياد بن أبي الجعد، عن زبيد، عن عبد الرحمن بن أبي ليلى، عن كعب بن عجرة، عن عمر، قال صلاة السفر ركعتان وصلاة الجمعة ركعتان والفطر والأضحى ركعتان تمام غير قصر على لسان محمد  صلى الله عليه وسلم  ‏.‏",
      "text_en": " ‘Umarsaid:                      “The prayer when traveling is two Rak’ah, and Friday istwoRak’ah, and Al-Fitr and Al-Adha are two Rak’ah, complete, notshortened, as told by Muhammad (ﷺ).”",
      "chain": [
        "30212",
        "20352",
        "25362",
        "11335",
        "11196",
        "4052",
        "3"
      ]
    },
    {
      "hadith_no": "3198",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد الرحمن بن إبراهيم، حدثنا عبد الله بن نافع، عن أسامة بن زيد، عن محمد بن كعب، عن كعب بن عجرة، قال أمرني النبي  صلى الله عليه وسلم  حين آذاني القمل أن أحلق رأسي وأصوم ثلاثة أيام أو أطعم ستة مساكين وقد علم أن ليس عندي ما أنسك ‏.‏",
      "text_en": " It wasnarrated that Ka’b bin ‘Ujrah said:                      “The Prophet (ﷺ)commanded me, when I was suffering, from live, to shave my head andfast for three days or feed six poor persons. He knew that I did nothave an animal I could sacrifice.”",
      "chain": [
        "30285",
        "30411",
        "50",
        "11221",
        "4052"
      ]
    }
  ],
  "total_hadiths": 53
}