{
  "id": "4056",
  "name": "Abu Tha'laba al-Khushni ( أبو ثعلبة الخشني ( رضي الله عنه",
  "full_name": "Abu Tha'laba al-Khushni ( أبو ثعلبة الخشني ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Hijaz"
    },
    "death": {
      "date_hijri": "75",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Syria",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina",
      "Syria"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ ع  -  صحابي ]"
    ],
    "tags": [
      "B.Quda'a",
      "Khaybar",
      "Ridwan"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "32",
      "name": "Mu'adh ibn Jabal ( معاذ بن جبل بن عمرو بن أوس ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "10",
      "name": "Abu 'Ubaidah ibn al-Jarrah ( أبو عبيدة بن الجراح ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11027",
      "name": "Abu Idrees al-Khulani أبو إدريس الخولاني",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "17556",
      "name": "Abu Umayya al-Sha'bani أبو أمية الشعباني",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11002",
      "name": "Sa'id ibn al-Musayyib سعيد بن المسيب بن حزن أبو محمد القرشي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11206",
      "name": "Ata'a bin Yazid al-Laithi al-Junda'i عطاء بن يزيد الليثي الجندعي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10883",
      "name": "'Amr bin Marthad, Abu Asma' al-Rahbi عمرو بن مرثد أبو أسماء الرحبي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "4097",
      "name": "Jubayr bin Nufayr al-Hadrami ( جبير بن نفير الحضرمي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11066",
      "name": "Makhul al-Shami/al-Damashiqi مكحول الشامي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11047",
      "name": "Abu Qalaba, 'Abdullah bin Zayd al-Jarmi عبد الله بن زيد بن عمرو",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "5536",
      "source": " Sahih Bukhari ",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا عبد الله بن يزيد، حدثنا حيوة، قال أخبرني ربيعة بن يزيد الدمشقي، عن أبي إدريس، عن أبي ثعلبة الخشني، قال قلت يا نبي الله إنا بأرض قوم أهل الكتاب، أفنأكل في آنيتهم وبأرض صيد، أصيد بقوسي وبكلبي الذي ليس بمعلم، وبكلبي المعلم، فما يصلح لي قال ‏\"‏ أما ما ذكرت من أهل الكتاب فإن وجدتم غيرها فلا تأكلوا فيها، وإن لم تجدوا فاغسلوها وكلوا فيها، وما صدت بقوسك فذكرت اسم الله فكل، وما صدت بكلبك المعلم فذكرت اسم الله فكل، وما صدت بكلبك غير معلم فأدركت ذكاته فكل ‏\"‏‏.‏",
      "text_en": " Narrated Abu Tha`laba Al-Khushani:                     I said, \"O Allah's Prophet! We are living in a land ruled by the people of the Scripture; Can we take our meals in their utensils? In that land there is plenty of game and I hunt the game with my bow and with my hound that is not trained and with my trained hound. Then what is lawful for me to eat?\" He said, \"As for what you have mentioned about the people of the Scripture, if you can get utensils other than theirs, do not eat out of theirs, but if you cannot get other than theirs, wash their utensils and eat out of it. If you hunt an animal with your bow after mentioning Allah's Name, eat of it. and if you hunt something with your trained hound after mentioning Allah's Name, eat of it, and if you hunt something with your untrained hound (and get it before it dies) and slaughter it, eat of it.\"",
      "chain": [
        "1945",
        "26010",
        "11414",
        "11027",
        "4056"
      ]
    },
    {
      "hadith_no": "5588",
      "source": " Sahih Bukhari ",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن ابن شهاب، عن أبي إدريس الخولاني، عن أبي ثعلبة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم نهى عن أكل كل ذي ناب من السباع‏.‏ تابعه يونس ومعمر وابن عيينة والماجشون عن الزهري‏.‏",
      "text_en": " Narrated Abu Tha`laba:                     Allah's Apostle forbade the eating of the meat of beasts having fangs.",
      "chain": [
        "30355",
        "20001",
        "11013",
        "11027",
        "4056"
      ]
    },
    {
      "hadith_no": "5839",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثني عبد الله بن محمد، حدثنا سفيان، عن الزهري، عن أبي إدريس الخولاني، عن أبي ثعلبة الخشني، رضى الله عنه قال نهى النبي صلى الله عليه وسلم عن أكل كل ذي ناب من السبع‏.‏ قال الزهري ولم أسمعه حتى أتيت الشأم‏.‏   وزاد الليث قال حدثني يونس، عن ابن شهاب، قال وسألته هل نتوضأ أو نشرب ألبان الأتن أو مرارة السبع أو أبوال الإبل‏.‏ قال قد كان المسلمون يتداوون بها، فلا يرون بذلك بأسا، فأما ألبان الأتن فقد بلغنا أن رسول الله صلى الله عليه وسلم نهى عن لحومها، ولم يبلغنا عن ألبانها أمر ولا نهى، وأما مرارة السبع قال ابن شهاب أخبرني أبو إدريس الخولاني أن أبا ثعلبة الخشني أخبره أن رسول الله صلى الله عليه وسلم نهى عن أكل كل ذي ناب من السبع‏.‏",
      "text_en": " Narrated Abu Tha`laba Al-Khushani:                     The Prophet forbade the eating of wild animals having fangs. (Az-Zuhri said: I did not hear this narration except when I went to Sham.) Al-Laith said: Narrated Yunus: I asked Ibn Shihab, \"May we perform the ablution with the milk of she-asses or drink it, or drink the bile of wild animals or urine of camels?\" He replied, \"The Muslims used to treat themselves with that and did not see any harm in it. As for the milk of she-asses, we have learnt that Allah's Apostle forbade the eating of their meat, but we have not received any information whether drinking of their milk is allowed or forbidden.\" As for the bile of wild animals, Ibn Shihab said, \"Abu Idris Al-Khaulani told me that Allah's Apostle forbade the eating of the flesh of every wild beast having fangs . \"",
      "chain": [
        "30351",
        "20005",
        "11013",
        "11027",
        "4056"
      ]
    },
    {
      "hadith_no": "5094",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "حدثنا محمد بن مهران الرازي، حدثنا أبو عبد الله، حماد بن خالد الخياط عن  معاوية بن صالح، عن عبد الرحمن بن جبير، عن أبيه، عن أبي ثعلبة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا رميت بسهمك فغاب عنك فأدركته فكله ما لم ينتن ‏\"‏ ‏.‏",
      "text_en": " Abu Tha'laba reported Allah's Messenger (may peace be upon him) having said this:                      If you shoot with your arrow and (the game) goes out of your sight and you find it (later on), then eat that if it has not gone rotten.",
      "chain": [
        "30383",
        "30184",
        "20675",
        "10865",
        "4056"
      ]
    },
    {
      "hadith_no": "5095",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثني محمد بن أحمد بن أبي خلف، حدثنا معن بن عيسى، حدثني معاوية، عن  عبد الرحمن بن جبير بن نفير، عن أبيه، عن أبي ثعلبة، عن النبي صلى الله عليه وسلم في الذي يدرك صيده بعد ثلاث ‏\"‏ فكله ما لم ينتن ‏\"‏ ‏.‏",
      "text_en": " Abu Tha'laba reported Allah's Apostle (may peace be upon him) as saying about one who comes three days later on the game he has shot:                      Eat it, provided it has not gone rotten.",
      "chain": [
        "30560",
        "30112",
        "27",
        "10942",
        "4056"
      ]
    },
    {
      "hadith_no": "5096",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثني محمد بن حاتم، حدثنا عبد الرحمن بن مهدي، عن معاوية بن صالح، عن العلاء، عن مكحول، عن أبي ثعلبة الخشني، عن النبي صلى الله عليه وسلم حديثه في الصيد ثم قال ابن حاتم حدثنا ابن مهدي عن معاوية عن عبد الرحمن بن جبير وأبي الزاهرية عن جبير بن نفير عن أبي ثعلبة الخشني ‏.‏ بمثل حديث العلاء غير أنه لم يذكر نتونته وقال في الكلب ‏\"‏ كله بعد ثلاث إلا أن ينتن فدعه ‏\"‏ ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Abu Tha'laba al- Khushani with a slight variation of (words):                      He (the Holy Prophet) said in regard to the game killed by (a trained) dog: Eat after three days provided it has not gone rotten.",
      "chain": [
        "38487",
        "20033",
        "20675",
        "10606",
        "11066",
        "4056"
      ]
    },
    {
      "hadith_no": "5097",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وإسحاق بن إبراهيم، وابن أبي عمر، قال إسحاق أخبرنا وقال الآخران، حدثنا سفيان بن عيينة، عن الزهري، عن أبي إدريس، عن أبي، ثعلبة قال نهى النبي صلى الله عليه وسلم عن أكل كل ذي ناب من السبع ‏.‏ زاد إسحاق وابن أبي عمر في حديثهما قال الزهري ولم نسمع بهذا حتى قدمنا الشام ‏.‏",
      "text_en": " Abu Tha'laba reported that Allah's Apostle (may peace be upon prohibited the eating of every fanged beast of prey. Zuhri added:                      We did not bear of it until we came to Syria.",
      "chain": [
        "30201",
        "30123",
        "30421",
        "30312",
        "20005",
        "11013",
        "11027",
        "4056"
      ]
    },
    {
      "hadith_no": "5099",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثني هارون بن سعيد الأيلي، حدثنا ابن وهب، أخبرنا عمرو، - يعني ابن الحارث - أن ابن شهاب، حدثه عن أبي إدريس الخولاني، عن أبي ثعلبة الخشني، أنالله عليه وسلم نهى عن أكل كل ذي ناب من السباع ‏.‏",
      "text_en": " Abu Tha'laba al-Khushani reported Allah's Messenger (may peace be upon him) having prohibited the eating of all fanged beasts of prey. This hadith has been narrated through another chain of transmitters, but with a slight variation of words.",
      "chain": [
        "30492",
        "20029",
        "20377",
        "11013",
        "11027",
        "4056"
      ]
    },
    {
      "hadith_no": "2852",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Game (Kitab Al-Said) - كتاب الصيد",
      "chapter_no": "17",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا هشيم، حدثنا داود بن عمرو، عن بسر بن عبيد الله، عن أبي إدريس الخولاني، عن أبي ثعلبة الخشني، قال قال رسول الله صلى الله عليه وسلم في صيد الكلب ‏\"‏ إذا أرسلت كلبك وذكرت اسم الله فكل وإن أكل منه وكل ما ردت عليك يداك ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuTha'labah al-Khushani:                     The Messenger of Allah (ﷺ) said about the game hunted by a dog: If you set off your dog and have mentioned Allah's name, eat (it),  even if it eats any of it; and eat what your hands return you.",
      "chain": [
        "31167",
        "20468",
        "30504",
        "11412",
        "11027",
        "4056"
      ]
    },
    {
      "hadith_no": "2861",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Game (Kitab Al-Said) - كتاب الصيد",
      "chapter_no": "17",
      "text_ar": "حدثنا يحيى بن معين، حدثنا حماد بن خالد الخياط، عن معاوية بن صالح، عن عبد الرحمن بن جبير بن نفير، عن أبيه، عن أبي ثعلبة الخشني، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا رميت الصيد فأدركته بعد ثلاث ليال وسهمك فيه فكله ما لم ينتن ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuTha'labah al-Khushani:                     The Prophet (ﷺ) said: When you shoot your arrow (and the animal goes out of your sight) and you come three days later on it, and in it there is your arrow, then eat provided it has not stench.",
      "chain": [
        "30020",
        "20537",
        "20675",
        "10942",
        "4056"
      ]
    },
    {
      "hadith_no": "3802",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا القعنبي، عن مالك، عن ابن شهاب، عن أبي إدريس الخولاني، عن أبي ثعلبة الخشني، أن رسول الله صلى الله عليه وسلم نهى عن أكل كل ذي ناب من السبع ‏.‏",
      "text_en": " Abu Tha’labah al-Khushani said:                      The Messenger of Allah (ﷺ) prohibited eating fanged beasts of prey.",
      "chain": [
        "20164",
        "20001",
        "11013",
        "11027",
        "4056"
      ]
    },
    {
      "hadith_no": "3839",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا نصر بن عاصم، حدثنا محمد بن شعيب، أخبرنا عبد الله بن العلاء بن زبر، عن أبي عبيد الله، مسلم بن مشكم عن أبي ثعلبة الخشني، أنه سأل رسول الله صلى الله عليه وسلم قال إنا نجاور أهل الكتاب وهم يطبخون في قدورهم الخنزير ويشربون في آنيتهم الخمر ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن وجدتم غيرها فكلوا فيها واشربوا وإن لم تجدوا غيرها فارحضوها بالماء وكلوا واشربوا ‏\"‏ ‏.‏",
      "text_en": " Abu  Tha’labah al-khushani said that he asked the Messenger of Allah(ﷺ):                      We live in the neighbourhood of the People of the Book and they cook in their pots(the flesh of) swine and drink wine in their vessels. The Messenger of Allah(ﷺ) said: If you find any other pots, then eat in them and drink. But if you do not find any others, then wash them with water and eat and drink (In them).",
      "chain": [
        "10724",
        "20732",
        "20399",
        "4056"
      ]
    },
    {
      "hadith_no": "4349",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا موسى بن سهل، حدثنا حجاج بن إبراهيم، حدثنا ابن وهب، حدثني معاوية بن صالح، عن عبد الرحمن بن جبير، عن أبيه، عن أبي ثعلبة الخشني، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لن يعجز الله هذه الأمة من نصف يوم ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Tha'labat al-Khushani:                     The Prophet (ﷺ) said: Allah will not fail to detain this community for less than half a day.",
      "chain": [
        "20029",
        "20675",
        "10865",
        "4056"
      ]
    },
    {
      "hadith_no": "1464",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hunting - كتاب الصيد والذبائح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "18",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا يزيد بن هارون، حدثنا الحجاج، عن مكحول، عن أبي ثعلبة، والحجاج، عن الوليد بن أبي مالك، عن عائذ الله بن عبد الله، أنه سمع أبا ثعلبة الخشني، قال قلت يا رسول الله إنا أهل صيد ‏.‏ قال ‏\"‏ إذا أرسلت كلبك وذكرت اسم الله عليه فأمسك عليك فكل ‏\"‏ ‏.‏ قلت وإن قتل قال ‏\"‏ وإن قتل ‏\"‏ ‏.‏ قلت إنا أهل رمى ‏.‏ قال ‏\"‏ ما ردت عليك قوسك فكل ‏\"‏ ‏.‏ قال قلت إنا أهل سفر نمر باليهود والنصارى والمجوس فلا نجد غير آنيتهم ‏.‏ قال ‏\"‏ فإن لم تجدوا غيرها فاغسلوها بالماء ثم كلوا فيها واشربوا ‏\"‏ ‏.‏ قال وفي الباب عن عدي بن حاتم ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وعائذ الله بن عبد الله هو أبو إدريس الخولاني واسم أبي ثعلبة الخشني جرثوم ويقال جرثم بن ناشر ويقال ابن قيس ‏.‏",
      "text_en": " Narrated Abu Tha'labah Al-Khushani:                     \"I said: 'O Messenger of Allah! We are a people who hunt.' He said: 'If you send your dog and you mentioned the Name of Allah upon it, and he catches something for you, then eat it.' I said: 'Even if he kills it?' He said: 'Even if he kills it.' I said: 'We are a people who shoot (at game).' He said: 'What you catch with your bow, then eat it.'\" He said: \"Then I said:'Indeed we are a people who travel. We come across Jews, Christians, and Zoroastrians, and we do not find vessels other than theirs.' He said: 'If you do not find other than them, then wash them with water, then eat and drink from it.'\"",
      "chain": [
        "30242",
        "20472",
        "20381",
        "11066",
        "4056",
        "20381"
      ]
    },
    {
      "hadith_no": "1477",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hunting - كتاب الصيد والذبائح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "18",
      "text_ar": "حدثنا أحمد بن الحسن، حدثنا عبد الله بن مسلمة، عن مالك بن أنس، عن ابن شهاب، عن أبي إدريس الخولاني، عن أبي ثعلبة الخشني، قال نهى رسول الله صلى الله عليه وسلم عن كل ذي ناب من السباع ‏.‏",
      "text_en": " Narrated Abu Tha'labah Al-Khushani:                     \"The Messenger of Allah (ﷺ) prohibited (eating) every predator possessing canine teeth.\"",
      "chain": [
        "30292",
        "20164",
        "20001",
        "11013",
        "11027",
        "4056"
      ]
    },
    {
      "hadith_no": "1560",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Military Expeditions - كتاب السير عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "21",
      "text_ar": "حدثنا زيد بن أخزم الطائي، حدثنا أبو قتيبة، سلم بن قتيبة حدثنا شعبة، عن أيوب، عن أبي قلابة، عن أبي ثعلبة الخشني، قال سئل رسول الله صلى الله عليه وسلم عن قدور المجوس فقال ‏\"‏ أنقوها غسلا واطبخوا فيها ‏\"‏ ‏.‏ ونهى عن كل سبع وذي ناب ‏.‏ وقد روي هذا الحديث من غير هذا الوجه عن أبي ثعلبة رواه أبو إدريس الخولاني عن أبي ثعلبة ‏.‏ وأبو قلابة لم يسمع من أبي ثعلبة إنما رواه عن أبي أسماء عن أبي ثعلبة ‏.‏",
      "text_en": " Narrated Abu Tha'labah Al-Khushani:                     \"The Messenger of Allah (ﷺ) was asked about the pots of the Zorastrians. He said: 'Clean them by washing them, and then cook in them.' And he prohibited every predator and possessor of canines.\"This Hadith has been reported through routes other than this from Abu Tha'labah. Abu Idris Al-Khawlani reported it from Abu Tha'labah. Abu Qilabah did not hear from Abu Tha'labah, he only reported it from Abu Asma', from Abu Tha'labah.",
      "chain": [
        "30136",
        "20233",
        "20020",
        "11015",
        "11047",
        "4056"
      ]
    },
    {
      "hadith_no": "1796",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا زيد بن أخزم الطائي، حدثنا سلم بن قتيبة، حدثنا شعبة، عن أيوب، عن أبي قلابة، عن أبي ثعلبة، قال سئل رسول الله صلى الله عليه وسلم عن قدور المجوس فقال ‏\"‏ أنقوها غسلا واطبخوا فيها ‏\"‏ ‏.‏ ونهى عن كل سبع ذي ناب ‏.‏ قال أبو عيسى هذا حديث مشهور من حديث أبي ثعلبة وروي عنه من غير هذا الوجه ‏.‏ وأبو ثعلبة اسمه جرثوم ويقال جرهم ويقال ناشب ‏.‏ وقد ذكر هذا الحديث عن أبي قلابة عن أبي أسماء الرحبي عن أبي ثعلبة ‏.‏",
      "text_en": " Narrated Abu Tha'labah Al-Khushani:                     \"The Messenger of Allah (ﷺ) was asked about the pots of Zorastrians. He said: 'Clean them by washing them, and then cook in them.\" And he prohibited every predator possessing canines.\"This is a well known Hadith of Abu Tha'labah, and it has been reported from him through routes other than this. And Abu Tha'labah's name is Jurthum, and they say: Jurhum, and they say: Nashib. This Hadith has also been mentioned by Abu Qilabah from Abu 'Asma Ar-Rahbi, from Abu Tha'labah.",
      "chain": [
        "30136",
        "20020",
        "11015",
        "11047",
        "4056"
      ]
    },
    {
      "hadith_no": "1797",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا علي بن عيسى بن يزيد البغدادي، حدثنا عبيد الله بن محمد العيشي، حدثنا حماد بن سلمة، عن أيوب، وقتادة، عن أبي قلابة، عن أبي أسماء الرحبي، عن أبي ثعلبة الخشني، أنه قال يا رسول الله إنا بأرض أهل الكتاب فنطبخ في قدورهم ونشرب في آنيتهم ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن لم تجدوا غيرها فارحضوها بالماء ‏\"‏ ‏.‏ ثم قال يا رسول الله إنا بأرض صيد فكيف نصنع قال ‏\"‏ إذا أرسلت كلبك المكلب وذكرت اسم الله فقتل فكل وإن كان غير مكلب فذكي فكل وإذا رميت بسهمك وذكرت اسم الله فقتل فكل ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Abu Tha'labah Al-Khushani:                     That he said: \"O Messenger of Allah! We live in a land of the People of Book and we cook in their containers, and drink in their vessels.\" The Messenger of Allah (ﷺ) said: \"If you do not find other than them, then rinse them with water.\"The he said: \"O Messenger of Allah! We live in a land of game, so what should we do ?\" He said: \"When you send your trained dog, and you mentioned the Name of Allah, and he kills it, then eat it. And when you shoot it with your bow, and it is killed, then eat it.'\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.",
      "chain": [
        "38371",
        "20021",
        "11015",
        "11019",
        "11047",
        "10883",
        "4056"
      ]
    },
    {
      "hadith_no": "4303",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرني أحمد بن خالد الخلال، قال حدثنا معن، قال أنبأنا معاوية، - وهو ابن صالح - عن عبد الرحمن بن جبير بن نفير، عن أبيه، عن أبي ثعلبة، عن النبي صلى الله عليه وسلم في الذي يدرك صيده بعد ثلاث فليأكله إلا أن ينتن ‏.‏",
      "text_en": " It was narrated from Abu Tha'labah from the Prophet that:                     the one who catches up with the game (he shot) after three days may eat from it, unless it has turned rotten.",
      "chain": [
        "36504",
        "30112",
        "20675",
        "10942",
        "4056"
      ]
    },
    {
      "hadith_no": "4325",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا إسحاق بن منصور، ومحمد بن المثنى، عن سفيان، عن الزهري، عن أبي إدريس، عن أبي ثعلبة الخشني، أن النبي صلى الله عليه وسلم نهى عن أكل كل ذي ناب من السباع ‏.‏",
      "text_en": " It was narrated from Abu Tha labah Al-Khushani that:                     the Prophet forbade eating any predator that has fangs.\"",
      "chain": [
        "30313",
        "30170",
        "20005",
        "11013",
        "11027",
        "4056"
      ]
    },
    {
      "hadith_no": "4326",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا عمرو بن عثمان، قال حدثنا بقية، عن بحير، عن خالد، عن جبير بن نفير، عن أبي ثعلبة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تحل النهبى ولا يحل من السباع كل ذي ناب ولا تحل المجثمة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Tha'labah said:                     \"The Messenger of Allah said: 'Wealth taken by force is (not permissible), any predator that has fangs is not permissible, and any animal used for target practice is not permissible.\"",
      "chain": [
        "10581",
        "20644",
        "11282",
        "4097",
        "4056"
      ]
    },
    {
      "hadith_no": "4341",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا عمرو بن عثمان، أنبأنا بقية، عن بحير، عن خالد بن معدان، عن جبير بن نفير، عن أبي ثعلبة الخشني، أنه حدثهم أنهم، غزوا مع رسول الله صلى الله عليه وسلم إلى خيبر والناس جياع فوجدوا فيها حمرا من حمر الإنس فذبح الناس منها فحدث بذلك النبي صلى الله عليه وسلم فأمر عبد الرحمن بن عوف فأذن في الناس ‏\"‏ ألا إن لحوم الحمر الإنس لا تحل لمن يشهد أني رسول الله ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Tha''Aabah Al-Khushani that:                     they went on a military campaign with the Messenger of Allah to Khaibar, and the people were starving. They found some domesticated donkeys there, so the people slaughtered some of them. The Prophet was told about that, and he ordered 'Abdur-rahman bin 'Awf to announce to the people: \"The flesh of domesticated donkeys is not permissible for the one who testifies that I am the Messenger of Allah.\"",
      "chain": [
        "10581",
        "20644",
        "11422",
        "4097",
        "4056"
      ]
    },
    {
      "hadith_no": "4342",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا عمرو بن عثمان، عن بقية، قال حدثني الزبيدي، عن الزهري، عن أبي إدريس الخولاني، عن أبي ثعلبة الخشني، أن رسول الله صلى الله عليه وسلم نهى عن أكل كل ذي ناب من السباع وعن لحوم الحمر الأهلية ‏.‏",
      "text_en": " It was narrated from Abu Tha'labah Al-khushani that:                     the Messenger of Allah forbade eating any -predator with fangs, and the flesh of domesticated donkeys.",
      "chain": [
        "10581",
        "20644",
        "20459",
        "11013",
        "11027",
        "4056"
      ]
    },
    {
      "hadith_no": "4438",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا عمرو بن عثمان، قال حدثنا بقية، عن بحير، عن خالد، عن جبير بن نفير، عن أبي ثعلبة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تحل المجثمة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Tha'labah said:                     \"The Messenger of Allah said: An animal that has been taken as a target is not lawful.\"",
      "chain": [
        "10581",
        "20644",
        "11282",
        "4097",
        "4056"
      ]
    },
    {
      "hadith_no": "5190",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا عمرو بن منصور، قال حدثنا عفان، قال حدثنا وهيب، عن النعمان بن راشد، عن الزهري، عن عطاء بن يزيد، عن أبي ثعلبة الخشني، أن النبي صلى الله عليه وسلم أبصر في يده خاتما من ذهب فجعل يقرعه بقضيب معه فلما غفل النبي صلى الله عليه وسلم ألقاه قال ‏\"‏ ما أرانا إلا قد أوجعناك وأغرمناك ‏\"‏ ‏.‏ خالفه يونس رواه عن الزهري عن أبي إدريس مرسلا ‏.‏",
      "text_en": " It was narrated from Abu Tha'labah Al-Khushani that :                     The Prophet [SAW] saw a gold ring on his hand, and he started to smack him with a stick that he had in his hand. When the Prophet [SAW] looked away, he threw it away. He said: \"I think that he hurt you or we made you lose money.\"",
      "chain": [
        "38433",
        "30106",
        "20299",
        "10971",
        "11013",
        "11206",
        "4056"
      ]
    },
    {
      "hadith_no": "2938",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا علي بن محمد، حدثنا أبو أسامة، حدثني أبو فروة، يزيد بن سنان حدثني عروة بن، رويم اللخمي، عن أبي ثعلبة الخشني، - قال ولقيه وكلمه - قال أتيت رسول الله صلى الله عليه وسلم فسألته فقلت يا رسول الله قدور المشركين نطبخ فيها قال ‏\"‏ لا تطبخوا فيها ‏\"‏ ‏.‏ قلت فإن احتجنا إليها فلم نجد منها بدا قال ‏\"‏ فارحضوها رحضا حسنا ثم اطبخوا وكلوا ‏\"‏ ‏.‏",
      "text_en": " ‘Urwahbin Ruwaim Al-Lakhmi narrated that Abu Tha’labah Al-Khushani –whom he said he met and spoke with – said:                      “I came to theMessenger ofAllah (ﷺ) and asked him: ‘O Messenger of Allah! Canwe cook in thevessels of the idolaters?’ He said: ‘Do not cookin them.’ I said:‘What if we need them and cannot find anythingelse?’ He said: ‘Washthem well, then cook and eat.’”",
      "chain": [
        "38409",
        "20318",
        "28643",
        "4056"
      ]
    },
    {
      "hadith_no": "3328",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hunting - كتاب الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا الضحاك بن مخلد، حدثنا حيوة بن شريح، حدثني ربيعة بن يزيد، أخبرني أبو إدريس الخولاني، عن أبي ثعلبة الخشني، قال أتيت رسول الله  صلى الله عليه وسلم  فقلت يا رسول الله إنا بأرض أهل كتاب نأكل في آنيتهم وبأرض صيد أصيد بقوسي وأصيد بكلبي المعلم وأصيد بكلبي الذي ليس بمعلم ‏.‏ قال فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ أما ما ذكرت أنكم في أرض أهل كتاب فلا تأكلوا في آنيتهم إلا أن لا تجدوا منها بدا فإن لم تجدوا منها بدا فاغسلوها وكلوا فيها وأما ما ذكرت من أمر الصيد فما أصبت بقوسك فاذكر اسم الله وكل وما صدت بكلبك المعلم فاذكر اسم الله وكل وما صدت بكلبك الذي ليس بمعلم فأدركت ذكاته فكل ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Tha’labah Al-Khushani said:                      “I came to theMessenger of Allah (ﷺ) and said: ‘O Messenger of Allah, we livein aland of the People of the Book and we eat from their vessels.And welive in a land (where there is) game, so I hunt with my bowand withmy trained dog and with my untrained dog.’ The Messengerof Allah(ﷺ) said: ‘As for what you say about living in a land ofthe Peopleof the Book, do not eat from their vessels unless you canfind noalternative. If you can fidn no alternative then wash themand eatfrom them. With regard to what you say about hunting,whatever youcatch with your bow, say the Name of Allah over it andeat. Whateveryou catch with your trained dog, say the Name of Allahover it andeat. But whatever you catch with your untrained dog, thencatch it,slaughter it, then eat.’”",
      "chain": [
        "30170",
        "26010",
        "11414",
        "11027",
        "4056"
      ]
    },
    {
      "hadith_no": "3332",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hunting - كتاب الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا أبو عمير، عيسى بن محمد النحاس وعيسى بن يونس الرملي قالا حدثنا ضمرة بن ربيعة، عن الأوزاعي، عن يحيى بن سعيد، عن سعيد بن المسيب، عن أبي ثعلبة الخشني، أن النبي  صلى الله عليه وسلم  قال ‏\"‏ كل ما ردت عليك قوسك ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Tha’labah that the Prophet (ﷺ) said:                      “Eatwhat your bow brings you.”",
      "chain": [
        "20738",
        "20024",
        "11062",
        "11002",
        "4056"
      ]
    },
    {
      "hadith_no": "3354",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hunting - كتاب الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا محمد بن الصباح، أنبأنا سفيان بن عيينة، عن الزهري، أخبرني أبو إدريس، عن أبي ثعلبة الخشني، أن النبي  صلى الله عليه وسلم  نهى عن أكل كل ذي ناب من السباع ‏.‏ قال الزهري ولم أسمع بهذا حتى دخلت الشام ‏.‏",
      "text_en": " It wasnarrated from Abu Tha’labah Al-Khushani that the Prophet (ﷺ)forbade eating any predatory animal that has fangs.",
      "chain": [
        "30269",
        "20005",
        "11013",
        "11027",
        "4056"
      ]
    }
  ],
  "total_hadiths": 29
}