{
  "id": "4087",
  "name": "Hamil/Jamil bin Basra ( حميل بن بصرة أبو بصرة الغفاري ( رضي الله عنه",
  "full_name": "Hamil/Jamil bin Basra ( حميل بن بصرة أبو بصرة الغفاري ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Hijaz"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Egypt",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Hijaz",
      " Egypt"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ بخ  م  د  س  -  صحابي ]"
    ],
    "tags": [
      "al-Ghaffari"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "4086",
      "name": "Basra bin Abi Basra ( بصرة بن أبي بصرة الغفاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "23",
      "name": "Abu Dharr al-Ghaffari ( جندب بن جنادة أبو ذر الغفاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "28",
      "name": "'Amr bin al-'Aas ( عمرو بن العاص بن وائل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11410",
      "name": "Marthad bin 'Abdullah al-Yazni مرثد بن عبد الله اليزني",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10867",
      "name": "'Abdur Rahman bin Shmas'h عبد الرحمن بن شماسة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10863",
      "name": "Abu Tamim al-Jayshani أبو تميم الجيشاني, عبد الله بن مالك",
      "grade": "Follower(Tabi') [1st Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1964",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا قتيبة بن سعيد، حدثنا ليث، عن خير بن نعيم الحضرمي، عن ابن هبيرة، عن أبي تميم الجيشاني، عن أبي بصرة الغفاري، قال صلى بنا رسول الله صلى الله عليه وسلم العصر بالمخمص فقال ‏\"‏ إن هذه الصلاة عرضت على من كان قبلكم فضيعوها فمن حافظ عليها كان له أجره مرتين ولا صلاة بعدها حتى يطلع الشاهد ‏\"‏ ‏.‏ والشاهد النجم ‏.‏",
      "text_en": " This hadith has been narrated by Abu Basra Ghifari through another chain of transmitters.",
      "chain": [
        "30367",
        "20023",
        "10857",
        "10863",
        "4087"
      ]
    },
    {
      "hadith_no": "1965",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني زهير بن حرب، حدثنا يعقوب بن إبراهيم، حدثنا أبي، عن ابن إسحاق، قال حدثني يزيد بن أبي حبيب، عن خير بن نعيم الحضرمي، عن عبد الله بن هبيرة السبائي، - وكان ثقة - عن أبي تميم الجيشاني، عن أبي بصرة الغفاري، قال صلى بنا رسول الله صلى الله عليه وسلم العصر ‏.‏ بمثله ‏.‏",
      "text_en": " Uqba b. 'Amir said:                      There were the times at which Allah's Messenger (may peace be upon him) forbade us to pray, or bury our dead: When the sun begins to rise till it is fully up, when the sun is at its height at midday till it passes over the meridian, and when the sun draws near to setting till it sets.",
      "chain": [
        "30022",
        "20184",
        "20150",
        "11107",
        "11411",
        "10857",
        "10864",
        "10863",
        "4087"
      ]
    },
    {
      "hadith_no": "526",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا قتيبة، قال حدثنا الليث، عن خير بن نعيم الحضرمي، عن ابن هبيرة، عن أبي تميم الجيشاني، عن أبي بصرة الغفاري، قال صلى بنا رسول الله صلى الله عليه وسلم العصر بالمخمص قال ‏\"‏ إن هذه الصلاة عرضت على من كان قبلكم فضيعوها ومن حافظ عليها كان له أجره مرتين ولا صلاة بعدها حتى يطلع الشاهد ‏\"‏ ‏.‏ والشاهد النجم ‏.‏",
      "text_en": " It was narrated that Abu Basrah Al-Ghifari said:                      \"The Messenger of Allah (ﷺ) led us in praying 'Asr in Al-Mukhammas. He said: 'This prayer was enjoined upon those who came before you, but they neglected it. Whoever prays it regularly will have a two-fold reward, and there is no prayer after it until the Shahid appears.\" And the Shahid is \"the star.\" [1][1] This is a statement of one of the narrators, and Allah knows best.",
      "chain": [
        "30367",
        "20023",
        "10857",
        "10863",
        "4087"
      ]
    }
  ],
  "total_hadiths": 3
}