{
  "id": "4097",
  "name": "Jubayr bin Nufayr al-Hadrami ( جبير بن نفير الحضرمي ( رضي الله عنه",
  "full_name": "Jubayr bin Nufayr al-Hadrami ( جبير بن نفير الحضرمي ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Yeman/Hijaz",
      "place_display": {
        "en": "Yeman/Hijaz",
        "ar": "Yeman/الحجاز",
        "ckb": "Yeman/حیجاز"
      }
    },
    "death": {
      "date_hijri": "80",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Syria",
      "reason": "Natural",
      "place_display": {
        "en": "Syria",
        "ar": "الشام",
        "ckb": "شام"
      }
    },
    "places_of_stay": [
      "Hijaz",
      "Syria"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ بخ  م  4  -  صحبة ]"
    ],
    "tags": [
      "al-Hadrami",
      "Makhdaram"
    ],
    "area_of_interest_display": [
      {
        "en": "Recitation/Quran",
        "ar": "تلاوة القرآن",
        "ckb": "خوێندنەوە/قورئان"
      },
      {
        "en": "Narrator [ بخ  م  4  -  صحبة ]",
        "ar": "Narrator [ بخ  م  4  -  صحبة ]",
        "ckb": "Narrator [ بخ  م  4  -  صحبة ]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "Hijaz",
        "ar": "الحجاز",
        "ckb": "حیجاز"
      },
      {
        "en": "Syria",
        "ar": "الشام",
        "ckb": "شام"
      }
    ],
    "tags_display": [
      {
        "en": "al-Hadrami",
        "ar": "al-Hadrami",
        "ckb": "al-Hadrami"
      },
      {
        "en": "Makhdaram",
        "ar": "Makhdaram",
        "ckb": "Makhdaram"
      }
    ]
  },
  "parents": [
    {
      "id": "4098",
      "name": "Nufayr bin Malik al-Hadrami ( نفير بن مالك بن عامر الحضرمي ( رضي الله عنه",
      "grade": "Comp.(RA)",
      "grade_display": {
        "en": "Companion (RA)",
        "ar": "صحابي (رضي الله عنه)",
        "ckb": "هاوەڵ (رەزای خوای لێبێت)"
      }
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah",
      "grade_display": {
        "en": "Messenger of Allah",
        "ar": "رسول الله",
        "ckb": "پێغەمبەری خودا"
      }
    },
    {
      "id": "2",
      "name": "Abu Bakr As-Siddique ( أبو بكر الصديق ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "3",
      "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "4098",
      "name": "Nufayr bin Malik al-Hadrami ( نفير بن مالك بن عامر الحضرمي ( رضي الله عنه",
      "grade": "Comp.(RA)",
      "grade_display": {
        "en": "Companion (RA)",
        "ar": "صحابي (رضي الله عنه)",
        "ckb": "هاوەڵ (رەزای خوای لێبێت)"
      }
    },
    {
      "id": "23",
      "name": "Abu Dharr al-Ghaffari ( جندب بن جنادة أبو ذر الغفاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "37",
      "name": "Abu al-Darda ( أبو الدرداء عويمر بن زيد بن قيس الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "22",
      "name": "Khalid bin al-Walid ( خالد بن الوليد بن المغيرة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "40",
      "name": "'Ubada bin As-Samit ( عبادة بن الصامت بن قيس بن أصرم ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    },
    {
      "id": "27",
      "name": "Mu'awiya ibn Abu Sufyan ( معاوية بن أبي سفيان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    }
  ],
  "students": [],
  "hadiths": [
    {
      "id": "sahih-muslim-234-2",
      "hadith_no": "234",
      "source": "Sahih Muslim",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثني محمد بن حاتم بن ميمون، حدثنا عبد الرحمن بن مهدي، حدثنا معاوية بن صالح، عن ربيعة، - يعني ابن يزيد - عن أبي إدريس الخولاني، عن عقبة بن عامر، ح وحدثني أبو عثمان، عن جبير بن نفير، عن عقبة بن عامر، قال كانت علينا رعاية الإبل فجاءت نوبتي فروحتها بعشي فأدركت رسول الله صلى الله عليه وسلم قائما يحدث الناس فأدركت من قوله ‏\"‏ ما من مسلم يتوضأ فيحسن وضوءه ثم يقوم فيصلي ركعتين مقبل عليهما بقلبه ووجهه إلا وجبت له الجنة ‏\"‏ ‏.‏ قال فقلت ما أجود هذه ‏.‏ فإذا قائل بين يدى يقول التي قبلها أجود ‏.‏ فنظرت فإذا عمر قال إني قد رأيتك جئت آنفا قال ‏\"‏ ما منكم من أحد يتوضأ فيبلغ - أو فيسبغ - الوضوء ثم يقول أشهد أن لا إله إلا الله وأن محمدا عبد الله ورسوله إلا فتحت له أبواب الجنة الثمانية يدخل من أيها شاء ‏\"‏ ‏.‏",
      "text_en": " 'Uqba b. 'Amir reported:                      We were entrusted with the task of tending the camels. On my turn when I came back in the evening after grazing them in the pastures, I found Allah's Messenger (may peace be upon him) stand and address the people. I heard these words of his: If any Muslim performs ablution well, then stands and prays two rak'ahs setting about them with his heart as well as his face, Paradise would be guaranteed to him. I said: What a fine thing is this! And a narrator who was before me said: The first was better than even this. When I cast a glance, I saw that it was 'Umair who said: I see that you have just come and observed: If anyone amongst you performs the ablution, and then completes the ablution well and then says: I testify that there is no god but Allah and that Muhammad is the servant of Allah and His Messenger, the eight gates of Paradise would be opened for him and he may enter by whichever of them he wishes.",
      "usc_msa_ref": "",
      "chain": [
        "30514",
        "20033",
        "20675",
        "11414",
        "11027",
        "189",
        "11113",
        "4097",
        "189"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-234-3",
      "hadith_no": "234",
      "source": "Sahih Muslim",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثناه أبو بكر بن أبي شيبة، حدثنا زيد بن الحباب، حدثنا معاوية بن صالح، عن ربيعة بن يزيد، عن أبي إدريس الخولاني، وأبي، عثمان عن جبير بن نفير بن مالك الحضرمي، عن عقبة بن عامر الجهني، أن رسول الله صلى الله عليه وسلم ‏.‏ قال فذكر مثله غير أنه قال ‏\"‏ من توضأ فقال أشهد أن لا إله إلا الله وحده لا شريك له وأشهد أن محمدا عبده ورسوله ‏\"‏ ‏.‏",
      "text_en": " Uqba b. 'Amir al-Juhani reported:                      Verily the Messenger of Allah (may peace be upon him) said and then narrated (the hadith) like one (mentioned above) except (this) that he said: He who performed ablution and said: I testify that there is no god but Allah, the One, there is no associate with Him and I testify that Muhammad is His servant and His Messenger.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20650",
        "20675",
        "11414",
        "11027",
        "11113",
        "4097",
        "189"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-1616",
      "hadith_no": "1616",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا زهير بن حرب، ومحمد بن بشار، جميعا عن ابن مهدي، - قال زهير حدثنا عبد الرحمن بن مهدي، - حدثنا شعبة، عن يزيد بن خمير، عن حبيب بن عبيد، عن جبير بن نفير، قال خرجت مع شرحبيل بن السمط إلى قرية على رأس سبعة عشر أو ثمانية عشر ميلا فصلى ركعتين ‏.‏ فقلت له فقال رأيت عمر صلى بذي الحليفة ركعتين فقلت له فقال إنما أفعل كما رأيت رسول الله صلى الله عليه وسلم يفعل ‏.‏",
      "text_en": " Jubair b. Nufair reported:                      I went along with Shurahbil b. al-Simt to a village which was situated at a distance of seventeen or eighteen miles, and he said only two rak'ahs of prayer. I said to him (about it) and he said: I saw 'Umar observing two rak'ahs at Dhu'l-Hulaifa and I (too) said to him (about it) and he said: I am doing the same as I saw the Messenger of Allah (may peace be upon him) doing.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "30160",
        "20033",
        "20321",
        "20033",
        "20020",
        "10981",
        "10899",
        "4097"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-1912",
      "hadith_no": "1912",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثني إسحاق بن منصور، أخبرنا يزيد بن عبد ربه، حدثنا الوليد بن مسلم، عن محمد بن مهاجر، عن الوليد بن عبد الرحمن الجرشي، عن جبير بن نفير، قال سمعت النواس، بن سمعان الكلابي يقول سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ يؤتى بالقرآن يوم القيامة وأهله الذين كانوا يعملون به تقدمه سورة البقرة وآل عمران ‏\"‏ ‏.‏ وضرب لهما رسول الله صلى الله عليه وسلم ثلاثة أمثال ما نسيتهن بعد قال ‏\"‏ كأنهما غمامتان أو ظلتان سوداوان بينهما شرق أو كأنهما حزقان من طير صواف تحاجان عن صاحبهما",
      "text_en": " Ibn 'Abbas reported that while Gabriel was sitting with the Apostle (may peace be upon him) he heard a creaking sound above him. He lifted his head and said:                      This As a gate opened in heaven today which had never been opened before. Then when an angel descended through it, he said: This is an angel who came down to the earth who had-never come down before. He greeted and said: Rejoice in two lights given to you which have not been given to any prophet before you: Falihat al-Kitab and the concluding verses of Suarah al-Baqara. You will never recite a letter from them for which you will not be given (a reward).",
      "usc_msa_ref": "",
      "chain": [
        "30313",
        "30572",
        "20733",
        "20637",
        "10975",
        "4097",
        "3600"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-2276",
      "hadith_no": "2276",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثني هارون بن سعيد الأيلي، أخبرنا ابن وهب، أخبرني معاوية بن صالح، عن حبيب بن عبيد، عن جبير بن نفير، سمعه يقول سمعت عوف بن مالك، يقول صلى رسول الله صلى الله عليه وسلم على جنازة فحفظت من دعائه وهو يقول ‏\"‏ اللهم اغفر له وارحمه وعافه واعف عنه وأكرم نزله ووسع مدخله واغسله بالماء والثلج والبرد ونقه من الخطايا كما نقيت الثوب الأبيض من الدنس وأبدله دارا خيرا من داره وأهلا خيرا من أهله وزوجا خيرا من زوجه وأدخله الجنة وأعذه من عذاب القبر أو من عذاب النار ‏\"‏ ‏.‏ قال حتى تمنيت أن أكون أنا ذلك الميت ‏.‏ قال وحدثني عبد الرحمن بن جبير حدثه عن أبيه عن عوف بن مالك عن النبي صلى الله عليه وسلم بنحو هذا الحديث أيضا ‏.‏",
      "text_en": " Jubair b. Nufair says:                      I heard it from 'Auf b. Malik that the Holy Prophet (may peace be upon him) said prayer on the dead body, and I remembered his prayer:\" O Allah! forgive him, have mercy upon him, give him peace and absolve him. Receive him with honour and make his grave spacious; wash him with water, snow and hail. Cleanse him from faults as Thou wouldst cleanse a white garment from impurity. Requite him with an abode more excellent than his abode, with a family better than his family, and with a mate better than his mate. Admit him to the Garden, and protect him from the torment of the grave and the torment of the Fire.\" ('Auf bin Malik) said: I earnestly desired that I were this dead body.",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "20029",
        "20675",
        "10899",
        "4097",
        "10805"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-5223",
      "hadith_no": "5223",
      "source": "Sahih Muslim",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "حدثني زهير بن حرب، حدثنا معن بن عيسى، حدثنا معاوية بن صالح، عن أبي، الزاهرية عن جبير بن نفير، عن ثوبان، قال ذبح رسول الله صلى الله عليه وسلم ضحيته ثم قال ‏\"‏ يا ثوبان أصلح لحم هذه ‏\"‏ ‏.‏ فلم أزل أطعمه منها حتى قدم المدينة ‏.‏",
      "text_en": " Thauban reported that Allah's Messenger (way peace be upon him) slaughtered his sacrificial animal and then said:                      Thauban, make his meat usable (for journey), and I continuously served him that until he arrived in Medina.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "30112",
        "20675",
        "10901",
        "4097",
        "130"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-5555",
      "hadith_no": "5555",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا معاذ بن هشام، حدثني أبي، عن يحيى، حدثني محمد بن إبراهيم بن الحارث، أن ابن معدان، أخبره أن جبير بن نفير أخبره أن عبد اللهبن عمرو بن العاص أخبره قال رأى رسول الله صلى الله عليه وسلم على ثوبين معصفرينفقال ‏\"‏ إن هذه من ثياب الكفار فلا تلبسها ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. 'Amr b. al-As reported:                      Allah's Messenger (may peace be upon him) saw me wearing two clothes dyed in saffron. whereupon he said: These are the clothes (usually worn by) the non-believers, so do not wear them.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20287",
        "20295",
        "20031",
        "11213",
        "4097"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sunan-abi-daud-169",
      "hadith_no": "169",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن سعيد الهمداني، حدثنا ابن وهب، سمعت معاوية، - يعني ابن صالح - يحدث عن أبي عثمان، عن جبير بن نفير، عن عقبة بن عامر، قال كنا مع رسول الله صلى الله عليه وسلم خدام أنفسنا نتناوب الرعاية رعاية إبلنا فكانت على رعاية الإبل فروحتها بالعشي فأدركت رسول الله صلى الله عليه وسلم يخطب الناس فسمعته يقول ‏\"‏ ما منكم من أحد يتوضأ فيحسن الوضوء ثم يقوم فيركع ركعتين يقبل عليهما بقلبه ووجهه إلا قد أوجب ‏\"‏ ‏.‏ فقلت بخ بخ ما أجود هذه ‏.‏ فقال رجل من بين يدى التي قبلها يا عقبة أجود منها ‏.‏ فنظرت فإذا هو عمر بن الخطاب فقلت ما هي يا أبا حفص قال إنه قال آنفا قبل أن تجيء ‏\"‏ ما منكم من أحد يتوضأ فيحسن الوضوء ثم يقول حين يفرغ من وضوئه أشهد أن لا إله إلا الله وحده لا شريك له وأن محمدا عبده ورسوله إلا فتحت له أبواب الجنة الثمانية يدخل من أيها شاء ‏\"‏ ‏.‏ قال معاوية وحدثني ربيعة بن يزيد عن أبي إدريس عن عقبة بن عامر ‏.‏",
      "text_en": " ‘Uqbah b. ‘Amir said:                      We served ourselves in the company of Messenger of Allah (ﷺ). We tended our camels by turn. One day I had my turn to tend the camels, and I drove them in the afternoon. I found the Messenger of Allah (ﷺ) addressing the people. I heard him say: Anyone amongst you who performs ablution, and does it well, then he stands and offers two rak’ahs of prayer, concentrating on it with his heart and body, Paradise will be his lot by all means. I said: Ha-ha! How fine it is! A man in front of me said: The action (mentioned by the Prophet) earlier, O ‘Uqbah, is finer that this one. I looked at him and found him to be ‘Umar b. al-Khattab. I asked him: What is that, O Abu Hafs? He replied: He (the Prophet) had said before you came: If any one of you performs ablution, and does it well, and when he finishes the ablution, he utters the words : I bear witness that there is no deity except Allah, He has no associate, and I bear witness that Muhammad is His Servant and His Messenger, all the eight doors of Paradise will be opened for him; he may enter (through) any of them. Mu’awiyah said: Rabi’ah b. Yazid narrated this tradition to me from Abu Idris and the authority of  ‘Uqbah b.’Amir.",
      "usc_msa_ref": "",
      "chain": [
        "30296",
        "20029",
        "20675",
        "11113",
        "4097",
        "189"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-906",
      "hadith_no": "906",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا زيد بن الحباب، حدثنا معاوية بن صالح، عن ربيعة بن يزيد، عن أبي إدريس الخولاني، عن جبير بن نفير الحضرمي، عن عقبة بن عامر الجهني، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ما من أحد يتوضأ فيحسن الوضوء ويصلي ركعتين يقبل بقلبه ووجهه عليهما إلا وجبت له الجنة ‏\"‏ ‏.‏",
      "text_en": " Uqbah. B Amir al-Juhani reported the Messenger of Allah(ﷺ) as saying:                      Any one performs ablution and performs the ablution perfectly and then offers two rak’ahs of prayers concentrating on them with his heart and face but paradise will necessarily fall to his lot.",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20650",
        "20675",
        "11414",
        "11027",
        "4097",
        "189"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-1375",
      "hadith_no": "1375",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Ramadan - كتاب شهر رمضان",
      "chapter_no": "6",
      "text_ar": "حدثنا مسدد، حدثنا يزيد بن زريع، أخبرنا داود بن أبي هند، عن الوليد بن عبد الرحمن، عن جبير بن نفير، عن أبي ذر، قال صمنا مع رسول الله صلى الله عليه وسلم رمضان فلم يقم بنا شيئا من الشهر حتى بقي سبع فقام بنا حتى ذهب ثلث الليل فلما كانت السادسة لم يقم بنا فلما كانت الخامسة قام بنا حتى ذهب شطر الليل فقلت يا رسول الله لو نفلتنا قيام هذه الليلة ‏.‏ قال فقال ‏\"‏ إن الرجل إذا صلى مع الإمام حتى ينصرف حسب له قيام ليلة ‏\"‏ ‏.‏ قال فلما كانت الرابعة لم يقم فلما كانت الثالثة جمع أهله ونساءه والناس فقام بنا حتى خشينا أن يفوتنا الفلاح ‏.‏ قال قلت ما الفلاح قال السحور ثم لم يقم بنا بقية الشهر ‏.‏",
      "text_en": " Narrated AbuDharr:                     We fasted with the Messenger of Allah (ﷺ) during Ramadan, but he did not make us get up at night for prayer at any time during the month till seven nights remained; then he made us get up for prayer till a third of the night had passed. When the sixth remaining night came, he did not make us get up for prayer. When the fifth remaining night came, he made us stand in prayer till a half of the night had gone.  So I said: Messenger of Allah, I wish you had led us in supererogatory prayers during the whole of tonight.  He said: When a man prays with an imam till he goes he is reckoned as having spent a whole night in prayer. On the fourth remaining night he did not make us get up. When the third remaining night came, he gathered his family, his wives, and the people and prayed with us till we were afraid we should miss the falah (success).  I said: What is falah?  He said: The meal before daybreak. Then he did not make us get up for prayer during the remainder of the month.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20304",
        "11585",
        "10975",
        "4097",
        "23"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-1433",
      "hadith_no": "1433",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الوهاب بن نجدة، حدثنا أبو اليمان، عن صفوان بن عمرو، عن أبي إدريس السكوني، عن جبير بن نفير، عن أبي الدرداء، قال ‏\"‏ أوصاني خليلي صلى الله عليه وسلم بثلاث لا أدعهن لشىء أوصاني بصيام ثلاثة أيام من كل شهر ولا أنام إلا على وتر وبسبحة الضحى في الحضر والسفر ‏.‏",
      "text_en": " Abu Al-Darda' said:                      My friend (i.e. \tthe Prophet) instructed me to observe three practices which I never leave: he instructed me to fast three days every month, and not to sleep but after observing the with, and to observe supererogatory prayer in the forenoon while traveling and while resident.",
      "usc_msa_ref": "",
      "chain": [
        "38363",
        "30330",
        "10921",
        "19204",
        "4097",
        "37"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-1582",
      "hadith_no": "1582",
      "source": "Sunan Abi Da'ud",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن يونس النسائي، حدثنا روح، حدثنا زكرياء بن إسحاق، بإسناده بهذا الحديث قال مسلم بن شعبة ‏.‏ قال فيه والشافع التي في بطنها الولد ‏.‏ قال أبو داود وقرأت في كتاب عبد الله بن سالم بحمص عند آل عمرو بن الحارث الحمصي عن الزبيدي قال وأخبرني يحيى بن جابر عن جبير بن نفير عن عبد الله بن معاوية الغاضري - من غاضرة قيس - قال قال النبي صلى الله عليه وسلم ‏\"‏ ثلاث من فعلهن فقد طعم طعم الإيمان من عبد الله وحده وأنه لا إله إلا الله وأعطى زكاة ماله طيبة بها نفسه رافدة عليه كل عام ولا يعطي الهرمة ولا الدرنة ولا المريضة ولا الشرط اللئيمة ولكن من وسط أموالكم فإن الله لم يسألكم خيره ولم يأمركم بشره ‏\"‏ ‏.‏",
      "text_en": " This tradition has also been narrated by Zakariyya bin Ishaq through his chain of narrators. In this version Mulsim bin Shu'bah said:                      Shafi' means a goat which has a baby in its womb.Abu Dawud said: I read in a document possessed by Abdullah ibn Salim at Hims: Abdullah ibn Mu'awiyah al-Ghadiri reported the Prophet (ﷺ) as saying: He who performs three things will have the taste of the faith. (They are:) One who worships Allah alone and one believes that there is no god but Allah; and one who pays the zakat on his property agreeably every year. One should not give an aged animal, nor one suffering from itch or ailing, and one most condemned, but one should give animals of medium quality, for Allah did not demand from you the best of your animals, nor did He command you to give the animals of worst quality.",
      "usc_msa_ref": "",
      "chain": [
        "38623",
        "20229",
        "11244",
        "30002",
        "20459",
        "10978",
        "4097"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-2594",
      "hadith_no": "2594",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا مؤمل بن الفضل الحراني، حدثنا الوليد، حدثنا ابن جابر، عن زيد بن أرطاة الفزاري، عن جبير بن نفير الحضرمي، أنه سمع أبا الدرداء، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ابغوني الضعفاء فإنما ترزقون وتنصرون بضعفائكم ‏\"‏ ‏.‏ قال أبو داود زيد بن أرطاة أخو عدي بن أرطاة ‏.‏",
      "text_en": " Narrated AbudDarda':                     I heard the Messenger of Allah (ﷺ) say: Seek for me weak persons, for you are provided means of subsistence and helped through your weaklings.Abu Dawud said: Zaid b. Artat is the brother of 'Adi b. Artat.",
      "usc_msa_ref": "",
      "chain": [
        "38659",
        "20733",
        "17510",
        "4097"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-2720",
      "hadith_no": "2720",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا أحمد بن محمد بن حنبل، قال حدثنا الوليد، قال سألت ثورا عن هذا الحديث، فحدثني عن خالد بن معدان، عن جبير بن نفير، عن أبيه، عن عوف بن مالك الأشجعي، نحوه ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by ‘Awf bin Malik Al Ashja’I through a different chain of narrators.",
      "usc_msa_ref": "",
      "chain": [
        "30007",
        "20733",
        "11155",
        "11422",
        "4097",
        "4098",
        "3051"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-2767",
      "hadith_no": "2767",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا عيسى بن يونس، حدثنا الأوزاعي، عن حسان بن عطية، قال مال مكحول وابن أبي زكرياء إلى خالد بن معدان وملت معهما فحدثنا عن جبير بن نفير، قال قال جبير انطلق بنا إلى ذي مخبر - رجل من أصحاب النبي صلى الله عليه وسلم - فأتيناه فسأله جبير عن الهدنة فقال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ستصالحون الروم صلحا آمنا وتغزون أنتم وهم عدوا من ورائكم ‏\"‏ ‏.‏",
      "text_en": " Narrated Dhu Mikhbar:                     Hassan ibn Atiyyah said: Makhul and Ibn Zakariyya went to Khalid ibn Ma'dan, and I also went along with them. He reported a tradition on the authority of Jubayr ibn Nufayr. He said: Go with us to Dhu Mikhbar, a man from the Companions of the Prophet (ﷺ). We came to him and Jubayr asked him about peace. He said: I heard the Messenger of Allah (ﷺ) say: You will make a secure peace with the Byzantines, then you and they will fight an enemy behind you.",
      "usc_msa_ref": "",
      "chain": [
        "30352",
        "20347",
        "20024",
        "11413",
        "4097"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-2814",
      "hadith_no": "2814",
      "source": "Sunan Abi Da'ud",
      "chapter": "Sacrifice (Kitab Al-Dahaya) - كتاب الضحايا",
      "chapter_no": "16",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا حماد بن خالد الخياط، قال حدثنا معاوية بن صالح، عن أبي الزاهرية، عن جبير بن نفير، عن ثوبان، قال ضحى رسول الله صلى الله عليه وسلم ثم قال ‏\"‏ يا ثوبان أصلح لنا لحم هذه الشاة ‏\"‏ ‏.‏ قال فما زلت أطعمه منها حتى قدمنا المدينة ‏.‏",
      "text_en": " Narrated Thawban:                     The Messenger of Allah (ﷺ) sacrificed during a journey and then said: Thawban, mend the meat of this goat. I then kept on supplying its meat until we reached Medina.",
      "usc_msa_ref": "",
      "chain": [
        "30352",
        "20537",
        "20675",
        "10901",
        "4097",
        "130"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-2945",
      "hadith_no": "2945",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا موسى بن مروان الرقي، حدثنا المعافى، حدثنا الأوزاعي، عن الحارث بن يزيد، عن جبير بن نفير، عن المستورد بن شداد، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ من كان لنا عاملا فليكتسب زوجة فإن لم يكن له خادم فليكتسب خادما فإن لم يكن له مسكن فليكتسب مسكنا ‏\"‏ ‏.‏ قال قال أبو بكر أخبرت أن النبي صلى الله عليه وسلم قال ‏\"‏ من اتخذ غير ذلك فهو غال أو سارق ‏\"‏ ‏.‏",
      "text_en": " Narrated Al-Mustawrid ibn Shaddad:                     Al-Mustawrid heard the Prophet (ﷺ) say: He who acts as an employee for us must get a wife; if he has not a servant, he must get one, and if he has not a dwelling, he must get one. He said that AbuBakr reported: I was told that the Prophet (ﷺ) said: He who takes anything else he is unfaithful or thief.He said that Abu Bakr reported: I was told that the Prophet (ﷺ) said: He who takes anything else he is unfaithful or thief.",
      "usc_msa_ref": "",
      "chain": [
        "35154",
        "20024",
        "4097",
        "2904"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-4292",
      "hadith_no": "4292",
      "source": "Sunan Abi Da'ud",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا النفيلي، حدثنا عيسى بن يونس، حدثنا الأوزاعي، عن حسان بن عطية، قال مال مكحول وابن أبي زكريا إلى خالد بن معدان وملت معهم فحدثنا عن جبير بن نفير، عن الهدنة، قال قال جبير انطلق بنا إلى ذي مخبر - رجل من أصحاب النبي صلى الله عليه وسلم - فأتيناه فسأله جبير عن الهدنة فقال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ستصالحون الروم صلحا آمنا فتغزون أنتم وهم عدوا من ورائكم فتنصرون وتغنمون وتسلمون ثم ترجعون حتى تنزلوا بمرج ذي تلول فيرفع رجل من أهل النصرانية الصليب فيقول غلب الصليب فيغضب رجل من المسلمين فيدقه فعند ذلك تغدر الروم وتجمع للملحمة ‏\"‏ ‏.‏",
      "text_en": " Dhu Mikhbar said:                      I heard the Messenger of Allah (ﷺ) say: you will make a secure peace with the Byzantines, then you and they will fight an enemy behind you, and you will be victorious, take booty, and be safe. You will then return and alight in a meadow with mounds and one of the Christians will raise the cross and say: The cross has conquered. One of the Muslims will become angry and smash it, and the Byzantines will act treacherously and prepare for the battle.",
      "usc_msa_ref": "",
      "chain": [
        "30352",
        "20347",
        "20024",
        "11413",
        "4097"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-4294",
      "hadith_no": "4294",
      "source": "Sunan Abi Da'ud",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا عباس العنبري، حدثنا هاشم بن القاسم، حدثنا عبد الرحمن بن ثابت بن ثوبان، عن أبيه، عن مكحول، عن جبير بن نفير، عن مالك بن يخامر، عن معاذ بن جبل، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ عمران بيت المقدس خراب يثرب وخراب يثرب خروج الملحمة وخروج الملحمة فتح قسطنطينية وفتح القسطنطينية خروج الدجال ‏\"‏ ‏.‏ ثم ضرب بيده على فخذ الذي حدث - أو منكبه - ثم قال إن هذا لحق كما أنك ها هنا أو كما أنك قاعد ‏.‏ يعني معاذ بن جبل ‏.‏",
      "text_en": " Narrated Mu'adh ibn Jabal:                     The Prophet (ﷺ) said: The flourishing state of Jerusalem will be when Yathrib is in ruins, the ruined state of Yathrib will be when the great war comes, the outbreak of the great war will be at the conquest of Constantinople and the conquest of Constantinople when the Dajjal (Antichrist) comes forth. He (the Prophet) struck his thigh or his shoulder with his hand and said: This is as true as you are here or as you are sitting (meaning Mu'adh ibn Jabal).",
      "usc_msa_ref": "",
      "chain": [
        "30437",
        "20390",
        "20731",
        "11066",
        "4097",
        "11722",
        "32"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-4298",
      "hadith_no": "4298",
      "source": "Sunan Abi Da'ud",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا هشام بن عمار، حدثنا يحيى بن حمزة، حدثنا ابن جابر، حدثني زيد بن أرطاة، قال سمعت جبير بن نفير، يحدث عن أبي الدرداء، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن فسطاط المسلمين يوم الملحمة بالغوطة إلى جانب مدينة يقال لها دمشق من خير مدائن الشام ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu al-Darda':                     The Prophet (ﷺ) said: The place of assembly of the Muslims at the time of the war will be in al-Ghutah near a city called Damascus, one of the best cities in Syria.",
      "usc_msa_ref": "",
      "chain": [
        "30288",
        "20402",
        "17510",
        "4097",
        "37"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-4889",
      "hadith_no": "4889",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا سعيد بن عمرو الحضرمي، حدثنا إسماعيل بن عياش، حدثنا ضمضم بن زرعة، عن شريح بن عبيد، عن جبير بن نفير، وكثير بن مرة، وعمرو بن الأسود، والمقدام بن معديكرب، وأبي، أمامة عن النبي صلى الله عليه وسلم قال ‏\"‏ إن الأمير إذا ابتغى الريبة في الناس أفسدهم ‏\"‏ ‏.‏",
      "text_en": " Narrated Miqdam ibn Ma'dikarib ; AbuUmamah:                     The Prophet (ﷺ) said: When a ruler seeks to make imputations against the people, he corrupts them.",
      "usc_msa_ref": "",
      "chain": [
        "11509",
        "20736",
        "18459",
        "18414",
        "4097",
        "19940",
        "11714",
        "405"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "jami-al-tirmidhi-475",
      "hadith_no": "475",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Al-Witr - أَبْوَابُ الْوِتْرِ",
      "chapter_no": "3",
      "text_ar": "حدثنا أبو جعفر السمناني، حدثنا أبو مسهر، حدثنا إسماعيل بن عياش، عن بحير بن سعد، عن خالد بن معدان، عن جبير بن نفير، عن أبي الدرداء، وأبي، ذر عن رسول الله صلى الله عليه وسلم ‏\"‏ عن الله، عز وجل أنه قال ابن آدم اركع لي من أول النهار أربع ركعات أكفك آخره ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Jubair narrated from Abu Ad-Darda, or Abu Dharr, that :                     Allah's Messenger narrated that Allah, Blessed and Most High said: \"Son of Adam: Perform four Rak'ah for Me in the beginning of the day it will suffice you for the latter part of it.\"",
      "usc_msa_ref": "",
      "chain": [
        "30284",
        "20736",
        "11422",
        "4097",
        "37",
        "23"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-806",
      "hadith_no": "806",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا هناد، حدثنا محمد بن الفضيل، عن داود بن أبي هند، عن الوليد بن عبد الرحمن الجرشي، عن جبير بن نفير، عن أبي ذر، قال صمنا مع رسول الله صلى الله عليه وسلم فلم يصل بنا حتى بقي سبع من الشهر فقام بنا حتى ذهب ثلث الليل ثم لم يقم بنا في السادسة وقام بنا في الخامسة حتى ذهب شطر الليل فقلنا له يا رسول الله لو نفلتنا بقية ليلتنا هذه فقال ‏\"‏ إنه من قام مع الإمام حتى ينصرف كتب له قيام ليلة ‏\"‏ ‏.‏ ثم لم يصل بنا حتى بقي ثلاث من الشهر وصلى بنا في الثالثة ودعا أهله ونساءه فقام بنا حتى تخوفنا الفلاح ‏.‏ قلت له وما الفلاح قال السحور ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ واختلف أهل العلم في قيام رمضان فرأى بعضهم أن يصلي إحدى وأربعين ركعة مع الوتر ‏.‏ وهو قول أهل المدينة والعمل على هذا عندهم بالمدينة ‏.‏ وأكثر أهل العلم على ما روي عن عمر وعلي وغيرهما من أصحاب النبي صلى الله عليه وسلم عشرين ركعة ‏.‏ وهو قول سفيان الثوري وابن المبارك والشافعي ‏.‏ وقال الشافعي وهكذا أدركت ببلدنا بمكة يصلون عشرين ركعة ‏.‏ وقال أحمد روي في هذا ألوان ‏.‏ ولم يقض فيه بشيء ‏.‏ وقال إسحاق بل نختار إحدى وأربعين ركعة على ما روي عن أبى بن كعب ‏.‏ واختار ابن المبارك وأحمد وإسحاق الصلاة مع الإمام في شهر رمضان ‏.‏ واختار الشافعي أن يصلي الرجل وحده إذا كان قارئا ‏.‏ وفي الباب عن عائشة والنعمان بن بشير وابن عباس ‏.‏",
      "text_en": " Abu Dharr narrated:                     \"We fasted with the Prophet, so he did not pray (the night prayer) with us until seven (nights) of the month remained. Then he (pbuh) led us in prayer until a third of the night had gone, then he did not lead us in prayer on the sixth. Then he led us in prayer on the fifth until half of the night had gone. We said to him: 'O Messenger of Allah! Wouldn't you lead us in prayer for the remainder of the night?' He said: 'Indeed, whoever stands (praying) with the Imam until he finished, then it is recorded for him that he prayed the whole night.; Then he did not lead us in prayer until three (nights) of the month remained. Then he led us in prayer on the third and he called his family and his women to pray with us until we feared missing the Falah\" I (Jubair bin Nufair) said to him: \"What is the Falah\" He said: \"The Suhur.\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "11585",
        "10975",
        "4097",
        "23"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-1702",
      "hadith_no": "1702",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Jihad - كتاب الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "23",
      "text_ar": "حدثنا أحمد بن محمد بن موسى، حدثنا عبد الله بن المبارك، قال أخبرنا عبد الرحمن بن يزيد بن جابر، حدثنا زيد بن أرطاة، عن جبير بن نفير، عن أبي الدرداء، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ ابغوني ضعفاءكم فإنما ترزقون وتنصرون بضعفائكم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Abu Ad-Darda':                     That he heard the Prophet (ﷺ) saying: \"Seek your weak for me. For indeed you sustenance and aid is only by your weak.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.",
      "usc_msa_ref": "",
      "chain": [
        "30304",
        "20025",
        "20395",
        "17510",
        "4097",
        "37"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-3098",
      "hadith_no": "3098",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Parables - كتاب الأمثال عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "44",
      "text_ar": "حدثنا علي بن حجر السعدي، حدثنا بقية بن الوليد، عن بحير بن سعد، عن خالد بن معدان، عن جبير بن نفير، عن النواس بن سمعان الكلابي، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله ضرب مثلا صراطا مستقيما على كنفى الصراط داران لهما أبواب مفتحة على الأبواب ستور وداع يدعو على رأس الصراط وداع يدعو فوقه‏:‏ ‏(‏والله يدعو إلى دار السلام ويهدي من يشاء إلى صراط مستقيم‏)‏ والأبواب التي على كنفى الصراط حدود الله فلا يقع أحد في حدود الله حتى يكشف الستر والذي يدعو من فوقه واعظ ربه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ قال سمعت عبد الله بن عبد الرحمن يقول سمعت زكريا بن عدي يقول قال أبو إسحاق الفزاري خذوا عن بقية ما حدثكم عن الثقات ولا تأخذوا عن إسماعيل بن عياش ما حدثكم عن الثقات ولا غير الثقات ‏.‏",
      "text_en": " Narrated An-Nawwas bin Sam'an Al-Kilabi:                     that the Messenger of Allah (ﷺ) said: \"Indeed Allah has made a parable of the straight path: At the sides of the path there are walls with open doors, each door having a curtain. There is a caller at the head of the path calling, and a caller above it calling. And Allah invites to the abode of peace and guides whomever He wills to the straight path. The doors which are on the sides of the path are the Hudud (legal limitations) of Allah; no one breaches the Hudud of Allah except that curtain is lifted, and the one calling from above it is his Lord.\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20644",
        "11422",
        "4097",
        "3600"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-3125",
      "hadith_no": "3125",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on The Virtues of the Qur'an - كتاب فضائل القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمد بن إسماعيل، أخبرنا هشام بن إسماعيل أبو عبد الملك العطار، حدثنا محمد بن شعيب، حدثنا إبراهيم بن سليمان، عن الوليد بن عبد الرحمن، أنه حدثهم عن جبير بن نفير، عن نواس بن سمعان، عن النبي صلى الله عليه وسلم قال ‏\"‏ يأتي القرآن وأهله الذين يعملون به في الدنيا تقدمه سورة البقرة وآل عمران ‏\"‏ ‏.‏ قال نواس وضرب لهما رسول الله صلى الله عليه وسلم ثلاثة أمثال ما نسيتهن بعد قال ‏\"‏ تأتيان كأنهما غيايتان وبينهما شرق أو كأنهما غمامتان سوداوان أو كأنهما ظلة من طير صواف تجادلان عن صاحبهما ‏\"‏ ‏.‏ وفي الباب عن بريدة وأبي أمامة ‏.‏ قال أبو عيسى هذا حديث غريب من هذا الوجه ‏.‏ ومعنى هذا الحديث عند أهل العلم أنه يجيء ثواب قراءته كذا فسر بعض أهل العلم هذا الحديث وما يشبه هذا من الأحاديث أنه يجيء ثواب قراءة القرآن ‏.‏ وفي حديث النواس عن النبي صلى الله عليه وسلم ما يدل على ما فسروا إذ قال النبي صلى الله عليه وسلم ‏\"‏ وأهله الذين يعملون به في الدنيا ‏\"‏ ‏.‏ ففي هذا دلالة أنه يجيء ثواب العمل ‏.‏",
      "text_en": " Narrated An-Nawwas bin Sam'an:                     that the Prophet (ﷺ) said: \"The Qur'an shall come, and its people who acted according to it in the world. Surat Al-Baqarah and Al 'Imran shall be in front of it. An-Nawwas said: \"The Messenger of Allah (ﷺ) stated three parables about them which I have not since forgotten, he said: \"They will come as if they are two shades between which there is illumination, or as if they are two shady clouds, or as if they are shadows of lines of birds arguing on behalf of their people.\"",
      "usc_msa_ref": "",
      "chain": [
        "34188",
        "37539",
        "20732",
        "10975",
        "4097"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-3160",
      "hadith_no": "3160",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on The Virtues of the Qur'an - كتاب فضائل القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "45",
      "text_ar": "وقد روي هذا الحديث، عن زيد بن أرطاة، عن جبير بن نفير، عن النبي صلى الله عليه وسلم مرسل ‏.‏ حدثنا بذلك، إسحاق بن منصور حدثنا عبد الرحمن بن مهدي، عن معاوية، عن العلاء بن الحارث، عن زيد بن أرطاة، عن جبير بن نفير، قال قال النبي صلى الله عليه وسلم ‏\"‏ إنكم لن ترجعوا إلى الله بأفضل مما خرج منه ‏\"‏ ‏.‏ يعني القرآن ‏.‏",
      "text_en": " Narrated Jubair bin Nufair:                     that the Prophet (ﷺ) said: \"You shall not return to Allah with what is more virtuous than what came from Him.\" Meaning the Qur'an.",
      "usc_msa_ref": "",
      "chain": [
        "17510",
        "4097"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-3537-2",
      "hadith_no": "3537",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا إبراهيم بن يعقوب، حدثنا علي بن عياش، حدثنا عبد الرحمن بن ثابت بن ثوبان، عن أبيه، عن مكحول، عن جبير بن نفير، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن الله يقبل توبة العبد ما لم يغرغر ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ حدثنا محمد بن بشار، حدثنا أبو عامر العقدي، عن عبد الرحمن بن ثابت بن ثوبان، عن أبيه، عن مكحول، عن جبير بن نفير، عن ابن عمر، عن النبي صلى الله عليه وسلم نحوه بمعناه ‏.‏",
      "text_en": " Ibn Umar narrated that the Prophet said:                     “Indeed Allah accepts the repentance of a slave as long as (his soul does not reach his throat).”",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "20448",
        "20731",
        "11066",
        "4097",
        "18"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-3573-2",
      "hadith_no": "3573",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن الدارمي، أخبرنا محمد بن يوسف، عن ابن ثوبان، عن أبيه، عن مكحول، عن جبير بن نفير، أن عبادة بن الصامت، حدثهم أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ما على الأرض مسلم يدعو الله بدعوة إلا آتاه الله إياها أو صرف عنه من السوء مثلها ما لم يدع بمأثم أو قطيعة رحم ‏\"‏ ‏.‏ فقال رجل من القوم إذا نكثر ‏.‏ قال ‏\"‏ الله أكثر ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه وابن ثوبان هو عبد الرحمن بن ثابت بن ثوبان العابد الشامي ‏.‏",
      "text_en": " Jubair bin Nufair narrated that Ubadah bin As-Samit narrated to them that, the Messenger of Allah said:                     “There is not a Muslim upon the earth who calls upon Allah with any supplication, except that Allah grants it to him, or he turns away from him the like of it in evil; as long as he does not supplicate for something sinful, or the severing of the ties of kinship.” So a man from the people said: “What if we should increase (in it)” He said: “(With) Allah is more.”",
      "usc_msa_ref": "",
      "chain": [
        "30025",
        "30388",
        "11066",
        "4097",
        "40"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "sunan-an-nasai-62",
      "hadith_no": "62",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرني هارون بن عبد الله، قال حدثنا معن، قال حدثنا معاوية بن صالح، عن حبيب بن عبيد، عن جبير بن نفير، قال شهدت عوف بن مالك يقول سمعت رسول الله صلى الله عليه وسلم يصلي على ميت فسمعت من دعائه وهو يقول ‏\"‏ اللهم اغفر له وارحمه وعافه واعف عنه وأكرم نزله وأوسع مدخله واغسله بالماء والثلج والبرد ونقه من الخطايا كما ينقى الثوب الأبيض من الدنس ‏\"‏ ‏.‏",
      "text_en": " 'Awf bin Malik said:                      \"I heard the Messenger of Allah (ﷺ) offering the (funeral) prayer for one who had died, and I heard him say in his supplication: 'Allahummaghfir lahu warhamhu wa 'afihi was a'fu 'anhu, wa akrim nuzulahu wa wassi' ,adkhalahu waghsilhu bil-ma'i wath-thalji wal-baradi wa naqqihi min al-khataya kama ynaqqath-thawb al-abyad min ad-danas. (O Allah, forgive him and have mercy on him, keep him safe and sound and forgive him, honor the place where he settles and make his entrance wide; wash him with water and snow and hail, and cleanse him of sin as a white garment is cleansed of dirt).\"",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "30112",
        "20675",
        "10899",
        "4097"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-152",
      "hadith_no": "152",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا موسى بن عبد الرحمن المسروقي، قال حدثنا زيد بن الحباب، قال حدثنا معاوية بن صالح، قال حدثنا ربيعة بن يزيد الدمشقي، عن أبي إدريس الخولاني، وأبي، عثمان عن جبير بن نفير الحضرمي، عن عقبة بن عامر الجهني، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من توضأ فأحسن الوضوء ثم صلى ركعتين يقبل عليهما بقلبه ووجهه وجبت له الجنة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Uqbah bin 'Amir Al-Juhani said:                      \"The Messenger of Allah (ﷺ) said: 'Whoever performs Wudu' and does it well, then prays two Rak'ahs in which his heart and face are focused, Paradise will be his.\"",
      "usc_msa_ref": "",
      "chain": [
        "35153",
        "20650",
        "20675",
        "11414",
        "11027",
        "11113",
        "4097",
        "189"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-817",
      "hadith_no": "817",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرني يحيى بن عثمان الحمصي، قال حدثنا بقية، عن بحير بن سعد، عن خالد بن معدان، عن جبير بن نفير، عن العرباض بن سارية، عن رسول الله صلى الله عليه وسلم كان يصلي على الصف الأول ثلاثا وعلى الثاني واحدة ‏.‏",
      "text_en": " It was narrated from Al'Irbad bin Sariyah that the Messenger of Allah (ﷺ) used to send Salah on the first row three times and on the second row once.",
      "usc_msa_ref": "",
      "chain": [
        "20644",
        "11422",
        "4097",
        "5172"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-1364",
      "hadith_no": "1364",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا بشر، - وهو ابن المفضل - قال حدثنا داود بن أبي هند، عن الوليد بن عبد الرحمن، عن جبير بن نفير، عن أبي ذر، قال صمنا مع رسول الله صلى الله عليه وسلم رمضان فلم يقم بنا النبي صلى الله عليه وسلم حتى بقي سبع من الشهر فقام بنا حتى ذهب نحو من ثلث الليل ثم كانت سادسة فلم يقم بنا فلما كانت الخامسة قام بنا حتى ذهب نحو من شطر الليل قلنا يا رسول الله لو نفلتنا قيام هذه الليلة ‏.‏ قال ‏\"‏ إن الرجل إذا صلى مع الإمام حتى ينصرف حسب له قيام ليلة ‏\"‏ ‏.‏ قال ثم كانت الرابعة فلم يقم بنا فلما بقي ثلث من الشهر أرسل إلى بناته ونسائه وحشد الناس فقام بنا حتى خشينا أن يفوتنا الفلاح ثم لم يقم بنا شيئا من الشهر ‏.‏ قال داود قلت ما الفلاح قال السحور ‏.‏",
      "text_en": " It was narrated that Abu Dharr said:                     \"We fasted Ramadan with the Messenger of Allah (ﷺ), and the Prophet (ﷺ) did not lead us in Qiyam until there were seven days left of the month, then he led us in Qiyam until one-third of the night had passed. Then, when there were six days left, he did not lead us in Qiyam. When there were five days left, he led us in praying Qiyam until half the night had passed. We said: 'O Messenger of Allah (SA), why don't you lead us in praying Qiyam for the rest of the night?' He said: 'If a man prays with the Imam until he leaves, that will be continued for him as if he spent the whole night in prayer.' Then, when there were four days left, he did not lead us in praying Qiyam. When there were three days left he sent for his daughters and women, and gathered the people, and he led us in praying Qiyam until we feared that we would miss Al-Falah. Then he did not lead us in praying Qiyam for the rest of the month.\" Dawud (one of the narrators) said: \"I said: ' What is falah?' He said: 'Sahur.'",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20212",
        "11585",
        "10975",
        "4097",
        "23"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-1437",
      "hadith_no": "1437",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Shortening the Prayer When Traveling - كتاب تقصير الصلاة فى السفر",
      "chapter_no": "15",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال حدثنا النضر بن شميل، قال حدثنا شعبة، عن يزيد بن خمير، قال سمعت حبيب بن عبيد، يحدث عن جبير بن نفير، عن ابن السمط، قال رأيت عمر بن الخطاب يصلي بذي الحليفة ركعتين فسألته عن ذلك، فقال إنما أفعل كما رأيت رسول الله صلى الله عليه وسلم يفعل ‏.‏",
      "text_en": " It was narrated that Ibn Al-Simt said:                     \"I saw 'Umar bin Al-Khattab praying two rak'ahs in Dhul-Hulaifah and I asked him about that. He said: 'I am simply doing that which I saw the Messenger of Allah (ﷺ) doing.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20291",
        "20020",
        "10981",
        "10899",
        "4097"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-1605",
      "hadith_no": "1605",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا محمد بن الفضيل، عن داود بن أبي هند، عن الوليد بن عبد الرحمن، عن جبير بن نفير، عن أبي ذر، قال صمنا مع رسول الله صلى الله عليه وسلم في رمضان فلم يقم بنا حتى بقي سبع من الشهر فقام بنا حتى ذهب ثلث الليل ثم لم يقم بنا في السادسة فقام بنا في الخامسة حتى ذهب شطر الليل فقلت يا رسول الله لو نفلتنا بقية ليلتنا هذه ‏.‏ قال ‏\"‏ إنه من قام مع الإمام حتى ينصرف كتب الله له قيام ليلة ‏\"‏ ‏.‏ ثم لم يصل بنا ولم يقم حتى بقي ثلاث من الشهر فقام بنا في الثالثة وجمع أهله ونساءه حتى تخوفنا أن يفوتنا الفلاح ‏.‏ قلت وما الفلاح قال السحور ‏.‏",
      "text_en": " It was narrated that Abu Dharr said:                     \"We fasted with the Messenger of Allah (ﷺ) in Ramadan and he did not lead us in praying Qiyam until there were seven days left in the month, when he led us in praying Qiyam until one-third of the night had passed. Then he did not lead us in praying Qiyam when there were six days left. Then he led us praying Qiyam when there were five days left until one-half of the night had passed. I said: \"O Messenger of Allah! What if we spend the rest of this night praying Nafl?\" He said: \"Whoever prays Qiyam with the Imam until he finishes, Allah (SWT) will record for him the Qiyam of a (whole) night.\" Then he did not lead us in prayer or pray Qiyam until there were three days of the month left. Then he led us in praying Qiyam when there were three days left. He gathered his family and wives (and led us in prayer) until we feared that we would miss Al-Falah. I (one of the narrators) said: \"What is Al-Falah?\" He said: \"The suhur\".",
      "usc_msa_ref": "",
      "chain": [
        "30359",
        "11585",
        "10975",
        "4097",
        "23"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-1984",
      "hadith_no": "1984",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا هارون بن عبد الله، قال حدثنا معن، قال حدثنا معاوية بن صالح، عن حبيب بن عبيد الكلاعي، عن جبير بن نفير الحضرمي، قال سمعت عوف بن مالك، يقول سمعت رسول الله صلى الله عليه وسلم يصلي على ميت فسمعت في دعائه وهو يقول ‏\"‏ اللهم اغفر له وارحمه وعافه واعف عنه وأكرم نزله ووسع مدخله واغسله بالماء والثلج والبرد ونقه من الخطايا كما نقيت الثوب الأبيض من الدنس وأبدله دارا خيرا من داره وأهلا خيرا من أهله وزوجا خيرا من زوجه وأدخله الجنة ونجه من النار - أو قال - وأعذه من عذاب القبر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Jubair bin Nufair Al-Hadrami said:                     \"I heard 'Awf bin Malik say: \"I heard the Messenger of Allah offering the funeral prayer for one who had died, and I heard him say in his supplication: Allahummaghfir lahu warhamhu wa 'afihi, wa a'fu 'anhu, wa akrim nuzulahu wa wassi' mudkhalahu waghsilhu bil-ma wath-thalji wal-barad, wa naqqihi min al-khataya kama naqqaita-thawb al-abyad min ad-danas. Wa abdihu daran khairan min darhi, wa ahlan khayran min ahlihi, wa zawjan khayran min zawjihi. Wa adkhilahul-jannah wa najjhi min an-nar\" (O Allah, forgive him and have mercy on him, keep him safe and sound and forgive him, honor the place where he settles and make his entrance wide; wash hm with water and snow and hail, and cleanse him of his sin as you cleanse a white garment of dirt. O Allah, give him a house better than his house and a family better than his house and a family better than his family and a wife better than his wife, and admit him to Paradise and save him from Hellfire).''' Or he said: \"Wa a'idhhu al-qabr (And protect him from the torment of the grave.)\"",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "30112",
        "20675",
        "10899",
        "4097",
        "10805"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-2186",
      "hadith_no": "2186",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرني عمرو بن عثمان، عن بقية، قال حدثنا بحير، عن خالد، عن جبير بن نفير، أن رجلا، سأل عائشة عن الصيام، فقالت إن رسول الله صلى الله عليه وسلم كان يصوم شعبان كله ويتحرى صيام الاثنين والخميس ‏.‏",
      "text_en": " It was narrated from Jubair bin Nufair that a man asked Aishah about fasting and she said:                     \"The Messenger of Allah used to fast all of Shaban, and he made sure to fast on Mondays and Thursdays.\" '",
      "usc_msa_ref": "",
      "chain": [
        "10581",
        "20644",
        "11282",
        "4097",
        "53"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-2356",
      "hadith_no": "2356",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا عمرو بن عثمان، قال حدثنا بقية، قال حدثنا بحير، عن خالد بن معدان، عن جبير بن نفير، أن عائشة، قالت إن رسول الله صلى الله عليه وسلم كان يصوم شعبان كله ‏.‏",
      "text_en": " It was narrated from Jubair bin Nufair that 'Aishah said:                     \"The Messenger of Allah used to fast all of Shaban.\"",
      "usc_msa_ref": "",
      "chain": [
        "10581",
        "20644",
        "11422",
        "4097",
        "53"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-2360",
      "hadith_no": "2360",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا عمرو بن عثمان، عن بقية، قال حدثنا بحير، عن خالد بن معدان، عن جبير بن نفير، أن عائشة، قالت إن رسول الله صلى الله عليه وسلم كان يتحرى صيام الاثنين والخميس ‏.‏",
      "text_en": " It was narrate from Jubair bin Nufair that 'Aishah said:                     \"The Messenger of Allah used to be keen to fast on Mondays and Thursday.\"",
      "usc_msa_ref": "",
      "chain": [
        "10581",
        "20644",
        "11422",
        "4097",
        "53"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3153",
      "hadith_no": "3153",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا عمرو بن عثمان، قال حدثنا بقية، عن بحير بن سعد، عن خالد بن معدان، عن جبير بن نفير، عن ابن أبي عميرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ما من الناس من نفس مسلمة يقبضها ربها تحب أن ترجع إليكم وأن لها الدنيا وما فيها غير الشهيد ‏\"‏ ‏.‏ قال ابن أبي عميرة قال رسول الله صلى الله عليه وسلم ‏\"‏ ولأن أقتل في سبيل الله أحب إلى من أن يكون لي أهل الوبر والمدر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn Abi 'Amirah that the Messenger of Allah (ﷺ) said:                      \"There is no Muslim soul among the people that is taken by its Lord and wishes it could come back to you, even if it had this world and everything in it, except the martyr.\" Ibn Abi 'Amirah said: \"The Messenger of Allah (ﷺ) said: 'If I were to be killed in the cause of Allah, that would be dearer to me that if all the people of the deserts and the cities were to be mine.'\"[1][1] Meaning: If they were all my slaves and I set them free.",
      "usc_msa_ref": "",
      "chain": [
        "10581",
        "20644",
        "11422",
        "4097"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3179",
      "hadith_no": "3179",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا يحيى بن عثمان، قال حدثنا عمر بن عبد الواحد، قال حدثنا ابن جابر، قال حدثني زيد بن أرطاة الفزاري، عن جبير بن نفير الحضرمي، أنه سمع أبا الدرداء، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ابغوني الضعيف فإنكم إنما ترزقون وتنصرون بضعفائكم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Jubair bin Nufair Al-Hadrami that he heard Abu Ad-Darda' say:                      \"I heard the Messenger of Allah (ﷺ) say: 'Bring me the weak, for you only receive provision and Divine support by virtue of your weak ones.'\"",
      "usc_msa_ref": "",
      "chain": [
        "27536",
        "17510",
        "4097"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3561",
      "hadith_no": "3561",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Horses, Races and Shooting - كتاب الخيل",
      "chapter_no": "28",
      "text_ar": "أخبرنا أحمد بن عبد الواحد، قال حدثنا مروان، - وهو ابن محمد - قال حدثنا خالد بن يزيد بن صالح بن صبيح المري، قال حدثنا إبراهيم بن أبي عبلة، عن الوليد بن عبد الرحمن الجرشي، عن جبير بن نفير، عن سلمة بن نفيل الكندي، قال كنت جالسا عند رسول الله صلى الله عليه وسلم فقال رجل يا رسول الله أذال الناس الخيل ووضعوا السلاح وقالوا لا جهاد قد وضعت الحرب أوزارها فأقبل رسول الله صلى الله عليه وسلم بوجهه وقال ‏\"‏ كذبوا الآن الآن جاء القتال ولا يزال من أمتي أمة يقاتلون على الحق ويزيغ الله لهم قلوب أقوام ويرزقهم منهم حتى تقوم الساعة وحتى يأتي وعد الله والخيل معقود في نواصيها الخير إلى يوم القيامة وهو يوحى إلى أني مقبوض غير ملبث وأنتم تتبعوني أفنادا يضرب بعضكم رقاب بعض وعقر دار المؤمنين الشام ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Salamah bin Nufail Al-Kindi said:                      \"I was sitting with the Messenger of Allah when a man said: 'O Messenger of Allah! The people have lost interest in horses and put down their weapons, and they say there is no Jihad, and that war has ended.' The Messenger of Allah turned to face him and said: 'They are lying, now the fighting is to come. There will always be a group among my Ummah who will fight for the truth, for whom Allah will cause some people to deviate, and grant them provision from them, until the Hour begins and until the promise of Allah comes. Goodness is tied to the forelocks of horses until the Day of Resurrection. It has been revealed to me that I am going to die and will not stay long, and you will follow me group after group, striking one another's necks. And the place of safety for the believers is Ash-Sham.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20640",
        "27507",
        "11667",
        "10975",
        "4097"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-4326",
      "hadith_no": "4326",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا عمرو بن عثمان، قال حدثنا بقية، عن بحير، عن خالد، عن جبير بن نفير، عن أبي ثعلبة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تحل النهبى ولا يحل من السباع كل ذي ناب ولا تحل المجثمة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Tha'labah said:                     \"The Messenger of Allah said: 'Wealth taken by force is (not permissible), any predator that has fangs is not permissible, and any animal used for target practice is not permissible.\"",
      "usc_msa_ref": "",
      "chain": [
        "10581",
        "20644",
        "11282",
        "4097",
        "4056"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-4341",
      "hadith_no": "4341",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا عمرو بن عثمان، أنبأنا بقية، عن بحير، عن خالد بن معدان، عن جبير بن نفير، عن أبي ثعلبة الخشني، أنه حدثهم أنهم، غزوا مع رسول الله صلى الله عليه وسلم إلى خيبر والناس جياع فوجدوا فيها حمرا من حمر الإنس فذبح الناس منها فحدث بذلك النبي صلى الله عليه وسلم فأمر عبد الرحمن بن عوف فأذن في الناس ‏\"‏ ألا إن لحوم الحمر الإنس لا تحل لمن يشهد أني رسول الله ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Tha''Aabah Al-Khushani that:                     they went on a military campaign with the Messenger of Allah to Khaibar, and the people were starving. They found some domesticated donkeys there, so the people slaughtered some of them. The Prophet was told about that, and he ordered 'Abdur-rahman bin 'Awf to announce to the people: \"The flesh of domesticated donkeys is not permissible for the one who testifies that I am the Messenger of Allah.\"",
      "usc_msa_ref": "",
      "chain": [
        "10581",
        "20644",
        "11422",
        "4097",
        "4056"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-4438",
      "hadith_no": "4438",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا عمرو بن عثمان، قال حدثنا بقية، عن بحير، عن خالد، عن جبير بن نفير، عن أبي ثعلبة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تحل المجثمة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Tha'labah said:                     \"The Messenger of Allah said: An animal that has been taken as a target is not lawful.\"",
      "usc_msa_ref": "",
      "chain": [
        "10581",
        "20644",
        "11282",
        "4097",
        "4056"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-5316",
      "hadith_no": "5316",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، - وهو ابن الحارث - قال حدثنا هشام، عن يحيى بن أبي كثير، عن محمد بن إبراهيم، أن خالد بن معدان، أخبره أن جبير بن نفير أخبره أن عبد الله بن عمرو أخبره أنه، رآه رسول الله صلى الله عليه وسلم وعليه ثوبان معصفران فقال ‏\"‏ هذه ثياب الكفار فلا تلبسها ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah bin 'Amr narrated that:                     The Messenger of Allah [SAW] saw him wearing two garments dyed with safflower and he said: \"This is the clothing of disbelievers; do not wear it.\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20226",
        "20295",
        "11449",
        "11213",
        "11422",
        "4097",
        "29"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-5433",
      "hadith_no": "5433",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرني عمرو بن عثمان، قال حدثنا بقية، قال حدثنا بحير بن سعد، عن خالد بن معدان، عن جبير بن نفير، عن عقبة بن عامر، قال أهديت للنبي صلى الله عليه وسلم بغلة شهباء فركبها وأخذ عقبة يقودها به فقال رسول الله صلى الله عليه وسلم لعقبة ‏\"‏ اقرأ ‏\"‏ ‏.‏ قال وما أقرأ يا رسول الله قال ‏\"‏ اقرأ ‏{‏ قل أعوذ برب الفلق * من شر ما خلق ‏}‏ ‏\"‏ ‏.‏ فأعادها على حتى قرأتها فعرف أني لم أفرح بها جدا قال ‏\"‏ لعلك تهاونت بها ‏\"‏ ‏.‏ فما قمت يعني بمثلها ‏.‏",
      "text_en": " It was narrated that 'Uqbah bin 'Amir said:                     \"The Prophet [SAW] was given a gray mule which he rode, and 'Uqbah led it. The Messenger of Allah [SAW] said to 'Uqbah: 'Recite.' He said: 'What should I recite, O Messenger of Allah?' He said: 'Recite: 'Say: I seek refuge with (Allah) the Lord of the daybreak, from the evil of what He has created.' And he repeated it until I had learned it.\"",
      "usc_msa_ref": "",
      "chain": [
        "10581",
        "20644",
        "11422",
        "4097",
        "189"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-ibn-majah-5",
      "hadith_no": "5",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا هشام بن عمار الدمشقي، حدثنا محمد بن عيسى بن سميع، حدثنا إبراهيم بن سليمان الأفطس، عن الوليد بن عبد الرحمن الجرشي، عن جبير بن نفير، عن أبي الدرداء، قال خرج علينا رسول الله  صلى الله عليه وسلم  ونحن نذكر الفقر ونتخوفه فقال ‏\"‏ آلفقر تخافون والذي نفسي بيده لتصبن عليكم الدنيا صبا حتى لا يزيغ قلب أحد منكم إزاغة إلا هيه وايم الله لقد تركتكم على مثل البيضاء ليلها ونهارها سواء ‏\"‏ ‏.‏ قال أبو الدرداء صدق والله رسول الله  صلى الله عليه وسلم  تركنا والله على مثل البيضاء ليلها ونهارها سواء ‏.‏",
      "text_en": " Abu Darda' said:                     \"The Messanger of Allah (ﷺ) came out to us when we were speaking of poverty and how we feared it. He said: 'Is it poverty that you fear? By the One in Whose Hand is my soul, (the delights and luxuries of) this world will come to you in plenty, and nothing will cause the heart of anyone of you to deviate except that. By Allah, I am leaving you upon something like Bayda (white, bright, clear path) the night and day of which are the same.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30288",
        "27542",
        "27500",
        "10975",
        "4097",
        "37"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-1388",
      "hadith_no": "1388",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن عبد الملك بن أبي الشوارب، حدثنا مسلمة بن علقمة، عن داود بن أبي هند، عن الوليد بن عبد الرحمن الجرشي، عن جبير بن نفير الحضرمي، عن أبي ذر، قال صمنا مع رسول الله  صلى الله عليه وسلم  رمضان فلم يقم بنا شيئا منه حتى بقي سبع ليال فقام بنا ليلة السابعة حتى مضى نحو من ثلث الليل ثم كانت الليلة السادسة التي تليها فلم يقمها حتى كانت الخامسة التي تليها ثم قام بنا حتى مضى نحو من شطر الليل فقلت يا رسول الله لو نفلتنا بقية ليلتنا هذه ‏.‏ فقال ‏\"‏ إنه من قام مع الإمام حتى ينصرف فإنه يعدل قيام ليلة ‏\"‏ ‏.‏ ثم كانت الرابعة التي تليها فلم يقمها حتى كانت الثالثة التي تليها ‏.‏ قال فجمع نساءه وأهله واجتمع الناس ‏.‏ قال فقام بنا حتى خشينا أن يفوتنا الفلاح ‏.‏ قيل وما الفلاح قال السحور ‏.‏ قال ثم لم يقم بنا شيئا من بقية الشهر ‏.‏",
      "text_en": " It wasnarrated that Abu Dharr said:                      “We fasted Ramadan with theMessengerof Allah (ﷺ) and he did not lead us in praying Qiyam(prayers atnight) during any part of it, until there were sevennights left. Heled us in praying Qiyam on the seventh night untilapproximately onethird of the night had passed. Then on the sixthnight which followedit he did not lead us in prayer. Then he led usin praying Qiyam onthe fifth night which followed it until almosthalf the night hadpassed. I said: ‘O Messenger of Allah, would thatwe had offeredvoluntary prayers throughout the whole night.’ He said:‘Whoeverstands with the Imam until he finishes, it is equivalent tospendingthe whole night in prayer.’ Then on the fourth night whichfollowedit, he did not lead us in prayer, until the third night thatfollowedit, when he gathered his wives and family, and he peoplegathered,and he led us in prayer until we feared that we would misstheFalah.” It was asked: “What is the Falah?” He said: “Suhur.”Hesaid: “Then he did not lead us in prayer at night for the restof themonth.”",
      "usc_msa_ref": "",
      "chain": [
        "30450",
        "20568",
        "11585",
        "10975",
        "4097",
        "23"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-2811",
      "hadith_no": "2811",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Wills - كتاب الوصايا",
      "chapter_no": "22",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يزيد بن هارون، أنبأنا حريز بن عثمان، حدثني عبد الرحمن بن ميسرة، عن جبير بن نفير، عن بسر بن جحاش القرشي، قال بزق النبي صلى الله عليه وسلم في كفه ثم وضع أصبعه السبابة وقال ‏\"‏ يقول الله عز وجل أنى تعجزني ابن آدم وقد خلقتك من مثل هذه فإذا بلغت نفسك هذه - وأشار إلى حلقه - قلت أتصدق وأنى أوان الصدقة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Busr bin Jahhash Al-Quraishi that :                     the Prophet (ﷺ) spat in his palm then pointed to it with his index finger and said: “Allah (SWT) says: 'Do you think you can escape from My punishment, O son of Adam, when I have created you from something like this? When your soul reaches here' - and (the Prophet (ﷺ)) pointed to his throat - 'You say: I give charity.' But it is too late for charity?”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20472",
        "11684",
        "18651",
        "4097"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-4227",
      "hadith_no": "4227",
      "source": "Sunan Ibn Majah",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عيسى بن يونس، عن الأوزاعي، عن حسان بن عطية، قال مال مكحول وابن أبي زكريا إلى خالد بن معدان وملت معهما فحدثنا عن جبير بن نفير، قال قال لي جبير انطلق بنا إلى ذي مخمر - وكان رجلا من أصحاب النبي  صلى الله عليه وسلم  - فانطلقت معهما فسأله عن الهدنة فقال سمعت النبي  صلى الله عليه وسلم  يقول ‏\"‏ ستصالحكم الروم صلحا آمنا ثم تغزون أنتم وهم عدوا فتنصرون وتغنمون وتسلمون ثم تنصرفون حتى تنزلوا بمرج ذي تلول فيرفع رجل من أهل الصليب الصليب فيقول غلب الصليب ‏.‏ فيغضب رجل من المسلمين فيقوم إليه فيدقه فعند ذلك تغدر الروم ويجتمعون للملحمة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Jubair bin Nufair said:                      “Jubair said to me:‘Let’s go to Dhu Mikhmar, who was a man from among the Companionsofthe Prophet (ﷺ).’ So I went with them and he asked him aboutthepeace treaty (with the Romans). He said: ‘I heard the Prophet(ﷺ)say: “The Romans will enter into a peace treaty with you,then you andthey will fight one another as enemies, and you will bevictorious;you will collect the spoils of war and be safe. Then youwill comeback until you stop in a meadow with many hillocks. A manfrom amongthe people of the Cross will raise the Cross and will say:‘The Crosshas prevailed.’ Then a man among the Muslims willbecome angry andwill go and break the Cross. Then the Romans willprove treacherous(breaking the treaty) (and will gather) for thefierce battle.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20347",
        "20024",
        "11413",
        "4097"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    }
  ],
  "total_hadiths": 51,
  "grade_display": {
    "en": "Companion (RA) [1st Generation]",
    "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
    "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
  }
}