{
  "id": "41",
  "name": "Abu Musa al-Asha'ari ( أبو موسى الأشعري ( رضي الله عنه",
  "full_name": "Abu Musa al-Asha'ari ( أبو موسى الأشعري ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Yemen"
    },
    "death": {
      "date_hijri": "52",
      "date_gregorian": "672",
      "date_display": null,
      "place": "Makkah",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Yemen",
      "Makkah",
      "Medina",
      "Basra",
      "Kufa"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ ع  -  صحابي ]",
      "Fiqh",
      "Commander"
    ],
    "tags": [
      "B.Tamim",
      "al-Asha'ri",
      "Early Muslim",
      "Abyssinia",
      "Messenger",
      "Imam"
    ]
  },
  "parents": [
    {
      "id": "440",
      "name": "Zabiya bint Wahb ( ظبية بنت وهب ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "spouses": [
    {
      "id": "534",
      "name": "Umm Khultum bint Fadl ibn al-'Abbas ( أم كلثوم بنت الفضل بن العباس ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "5392",
      "name": "Umm 'Abdullah bint Abi Duma ( أم عبد الله بنت أبي دومة امرأة أبي موسى ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "siblings": [
    {
      "id": "407",
      "name": "Abu Burda al-Asha'ari ( أبو بردة بن قيس الأشعري ( رضي الله عنه",
      "grade": "Comp.(RA)"
    }
  ],
  "children": [
    {
      "id": "409",
      "name": "Ibrahim bin Abi Musa al-Asha'ari ( إبراهيم بن أبي موسى الأشعري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11900",
      "name": "Abu Bakr bin Abi Musa al-Asha'ari أبو بكر بن أبى موسى الأشعري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11901",
      "name": "Abu Barda bin Abi Musa al-Asha'ari أبو بردة / الحارث بن أبي موسى الأشعري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11902",
      "name": "Musa bin Abi Musa al-Asha'ari موسى بن أبي موسى الأشعري",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "2",
      "name": "Abu Bakr Al-Siddique ( أبو بكر الصديق ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3",
      "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5",
      "name": "Ali ibn Abi Talib ( علي بن أبي طالب بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "39",
      "name": "Ubayy ibn Ka'b ( أبي بن كعب بن قيس ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "25",
      "name": "'Ammar ibn Yasir ( عمار بن ياسر بن عامر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "32",
      "name": "Mu'adh ibn Jabal ( معاذ بن جبل بن عمرو بن أوس ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "409",
      "name": "Ibrahim bin Abi Musa al-Asha'ari ( إبراهيم بن أبي موسى الأشعري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11900",
      "name": "Abu Bakr bin Abi Musa al-Asha'ari أبو بكر بن أبى موسى الأشعري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11901",
      "name": "Abu Barda bin Abi Musa al-Asha'ari أبو بردة / الحارث بن أبي موسى الأشعري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11902",
      "name": "Musa bin Abi Musa al-Asha'ari موسى بن أبي موسى الأشعري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "5392",
      "name": "Umm 'Abdullah bint Abi Duma ( أم عبد الله بنت أبي دومة امرأة أبي موسى ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "38",
      "name": "Abu Sa'id al-Khudri ( أبو سعيد سعد بن مالك بن سنان الخدري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3680",
      "name": "Tariq bin Shahab ( طارق بن شهاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11359",
      "name": "Abu 'Abdur Rahman al-Salmi أبو عبد الرحمن السلمي",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "11337",
      "name": "Zar bin Habaysh bin Habasha زر بن حبيش بن حباشة",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11341",
      "name": "Zayd bin Wahb al-Jhny زيد بن وهب الجهني",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11259",
      "name": "'Ubaid bin 'Umayr bin Qatada عبيد بن عمير بن قتادة",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "10805",
      "name": "'Auf bin Malik bin Nadlah عوف بن مالك بن نضلة - أبو الأحوص",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11114",
      "name": "Abu al-Aswad al-Du'ali أبو الأسود الديلي/الدؤلي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11002",
      "name": "Sa'id ibn al-Musayyib سعيد بن المسيب بن حزن أبو محمد القرشي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11113",
      "name": "Abu 'Uthman al-Nahdi عبد الرحمن بن مل - أبو عثمان النهدي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11046",
      "name": "Qays bin Abi Hazim قيس بن أبي حازم",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11226",
      "name": "Abu Rafi' al-Sa'agh نفيع بن رافع أبو رافع الصائغ",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "15681",
      "name": "Abu 'Ubaida bin 'Abdullah bin Mas'ud أبو عبيدة بن عبد الله بن مسعود",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "18984",
      "name": "Msrwq bin Aws مسروق بن أوس",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11660",
      "name": "Hzyl bin Shrhbyl al-Awdy al-Kwfy هزيل بن شرحبيل",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11391",
      "name": "Murrah bin Shrahayl al-Hamdani مرة بن شراحيل الهمداني - الطيب - الخير",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "10676",
      "name": "Htan bin 'Abdullah حطان بن عبد الله الرقاشي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11334",
      "name": "Raba'i bin Harash bin Jahsh ربعي بن حراش",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11589",
      "name": "Zahdam bin Madrab, Abu Muslim زهدم بن مضرب أبو مسلم الجرمي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11353",
      "name": "Shaqayq bin Salmah al-Asadi شقيق بن سلمة الأسدي أبو وائل الكوفي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11693",
      "name": "Safwan bin Mhrz bin Ziyad صفوان بن محرز بن زياد المازني",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11054",
      "name": "al-Aswad bin Yazid الأسود بن يزيد بن قيس النخعي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11055",
      "name": "'Abdur Rahman bin Yazid al-Nakha'i عبد الرحمن بن يزيد النخعي",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "11",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا سعيد بن يحيى بن سعيد القرشي، قال حدثنا أبي قال، حدثنا أبو بردة بن عبد الله بن أبي بردة، عن أبي بردة، عن أبي موسى  رضى الله عنه  قال قالوا يا رسول الله أى الإسلام أفضل قال ‏\"‏ من سلم المسلمون من لسانه ويده ‏\"‏‏.‏",
      "text_en": "      Narrated Abu Musa:                          Some people asked Allah's Apostle, \"Whose Islam is the best? i.e. (Who     is a very good Muslim)?\" He replied, \"One who avoids harming the      Muslims with his tongue and hands.\"",
      "chain": [
        "30254",
        "20367",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "79",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن العلاء، قال حدثنا حماد بن أسامة، عن بريد بن عبد الله، عن أبي بردة، عن أبي موسى، عن النبي صلى الله عليه وسلم قال ‏\"‏ مثل ما بعثني الله به من الهدى والعلم كمثل الغيث الكثير أصاب أرضا، فكان منها نقية قبلت الماء، فأنبتت الكلأ والعشب الكثير، وكانت منها أجادب أمسكت الماء، فنفع الله بها الناس، فشربوا وسقوا وزرعوا، وأصابت منها طائفة أخرى، إنما هي قيعان لا تمسك ماء، ولا تنبت كلأ، فذلك مثل من فقه في دين الله ونفعه ما بعثني الله به، فعلم وعلم، ومثل من لم يرفع بذلك رأسا، ولم يقبل هدى الله الذي أرسلت به ‏\"‏‏.‏ قال أبو عبد الله قال إسحاق وكان منها طائفة قيلت الماء‏.‏ قاع يعلوه الماء، والصفصف المستوي من الأرض‏.‏",
      "text_en": " Narrated Abu Musa:                     The Prophet said, \"The example of guidance and knowledge with which Allah has sent me is like abundant rain falling on the earth, some of which was fertile soil that absorbed rain water and brought forth vegetation and grass in abundance. (And) another portion of it was hard and held the rain water and Allah benefited the people with it and they utilized it for drinking, making their animals drink from it and for irrigation of the land for cultivation. (And) a portion of it was barren which could neither hold the water nor bring forth vegetation (then that land gave no benefits). The first is the example of the person who comprehends Allah's religion and gets benefit (from the knowledge) which Allah has revealed through me (the Prophets and learns and then teaches others. The last example is that of a person who does not care for it and does not take Allah's guidance revealed through me (He is like that barren land.)\"",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "92",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن العلاء، قال حدثنا أبو أسامة، عن بريد، عن أبي بردة، عن أبي موسى، قال سئل النبي صلى الله عليه وسلم عن أشياء كرهها، فلما أكثر عليه غضب، ثم قال للناس ‏\"‏ سلوني عما شئتم ‏\"‏‏.‏ قال رجل من أبي قال ‏\"‏ أبوك حذافة ‏\"‏‏.‏ فقام آخر فقال من أبي يا رسول الله فقال ‏\"‏ أبوك سالم مولى شيبة ‏\"‏‏.‏ فلما رأى عمر ما في وجهه قال يا رسول الله، إنا نتوب إلى الله عز وجل‏.‏",
      "text_en": " Narrated Abu Musa:                     The Prophet was asked about things which he did not like, but when the questioners insisted, the Prophet got angry. He then said to the people, \"Ask me anything you like.\" A man asked, \"Who is my father?\" The Prophet replied, \"Your father is Hudhafa.\" Then another man got up and said, \"Who is my father, O Allah's Apostle ?\" He replied, \"Your father is Salim, Maula (the freed slave) of Shaiba.\" So when `Umar saw that (the anger) on the face of the Prophet he said, \"O Allah's Apostle! We repent to Allah (Our offending you).",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "97",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "أخبرنا محمد  هو ابن سلام  حدثنا المحاربي، قال حدثنا صالح بن حيان، قال قال عامر الشعبي حدثني أبو بردة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ثلاثة لهم أجران رجل من أهل الكتاب آمن بنبيه، وآمن بمحمد صلى الله عليه وسلم والعبد المملوك إذا أدى حق الله وحق مواليه، ورجل كانت عنده أمة ‏{‏يطؤها‏}‏ فأدبها، فأحسن تأديبها، وعلمها فأحسن تعليمها، ثم أعتقها فتزوجها، فله أجران ‏\"‏‏.‏ثم قال عامر أعطيناكها بغير شىء، قد كان يركب فيما دونها إلى المدينة‏.‏",
      "text_en": "      Narrated Abu Burda's father:                          Allah's Apostle said \"Three persons will have a double reward:     1. A Person from the people of the scriptures who believed in his      prophet (Jesus or Moses) and then believed in the Prophet Muhammad (i      .e. has embraced Islam).     2. A slave who discharges his duties to Allah and his master.     3. A master of a woman-slave who teaches her good manners and educates     her in the best possible way (the religion) and manumits her and then      marries her.\"",
      "chain": [
        "30376",
        "20333",
        "15239",
        "11052",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "123",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا عثمان، قال أخبرنا جرير، عن منصور، عن أبي وائل، عن أبي موسى، قال جاء رجل إلى النبي صلى الله عليه وسلم فقال يا رسول الله، ما القتال في سبيل الله فإن أحدنا يقاتل غضبا، ويقاتل حمية‏.‏ فرفع إليه رأسه  قال وما رفع إليه رأسه إلا أنه كان قائما  فقال ‏\"‏ من قاتل لتكون كلمة الله هي العليا فهو في سبيل الله عز وجل ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa:                     A man came to the Prophet and asked, \"O Allah's Apostle! What kind of fighting is in Allah's cause? (I ask this), for some of us fight because of being enraged and angry and some for the sake of his pride and haughtiness.\" The Prophet raised his head (as the questioner was standing) and said, \"He who fights so that Allah's Word (Islam) should be superior, then he fights in Allah's cause.\"",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11353",
        "41"
      ]
    },
    {
      "hadith_no": "188",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "وقال أبو موسى دعا النبي صلى الله عليه وسلم بقدح فيه ماء، فغسل يديه ووجهه فيه، ومج فيه ثم قال لهما اشربا منه، وأفرغا على وجوهكما ونحوركما‏.‏",
      "text_en": " Abu Musa said:                      The Prophet asked for a tumbler containing water and washed both his hands and face in it and then threw a mouthful of water in the tumbler and said to both of us (Abu Musa and Bilal), \"Drink from the tumbler and pour some of its water on your faces and chests.\"",
      "chain": [
        "41"
      ]
    },
    {
      "hadith_no": "196",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا محمد بن العلاء، قال حدثنا أبو أسامة، عن بريد، عن أبي بردة، عن أبي موسى، أن النبي صلى الله عليه وسلم دعا بقدح فيه ماء، فغسل يديه ووجهه فيه ومج فيه‏.‏",
      "text_en": " Narrated Abu Musa:                     Once the Prophet asked for a tumbler containing water. He washed his hands and face in it and also threw a mouthful of water in it.",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "226",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا محمد بن عرعرة، قال حدثنا شعبة، عن منصور، عن أبي وائل، قال كان أبو موسى الأشعري يشدد في البول ويقول إن بني إسرائيل كان إذا أصاب ثوب أحدهم قرضه‏.‏ فقال حذيفة ليته أمسك، أتى رسول الله صلى الله عليه وسلم سباطة قوم فبال قائما‏.‏",
      "text_en": " Narrated Abu Wail:                     Abu Musa Al-Ash`ari used to lay great stress on the question of urination and he used to say, \"If anyone from Bani Israel happened to soil his clothes with urine, he used to cut that portion away.\" Hearing that, Hudhaifa said to Abu Wail, \"I wish he (Abu Musa) didn't (lay great stress on that matter).\" Hudhaifa added, \"Allah's Apostle went to the dumps of some people and urinated while standing.\"",
      "chain": [
        "20282",
        "20020",
        "11067",
        "11353",
        "41"
      ]
    },
    {
      "hadith_no": "244",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا أبو النعمان، قال حدثنا حماد بن زيد، عن غيلان بن جرير، عن أبي بردة، عن أبيه، قال أتيت النبي صلى الله عليه وسلم فوجدته يستن بسواك بيده يقول ‏\"‏ أع أع ‏\"‏، والسواك في فيه، كأنه يتهوع‏.‏",
      "text_en": " Narrated Abu Burda:                     My father said, \"I came to the Prophet and saw him carrying a Siwak in his hand and cleansing his teeth, saying, 'U' U',\" as if he was retching while the Siwak was in his mouth.\"",
      "chain": [
        "20283",
        "20022",
        "11300",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "558",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو كريب، قال حدثنا أبو أسامة، عن بريد، عن أبي بردة، عن أبي موسى، عن النبي صلى الله عليه وسلم ‏\"‏ مثل المسلمين واليهود والنصارى كمثل رجل استأجر قوما يعملون له عملا إلى الليل، فعملوا إلى نصف النهار، فقالوا لا حاجة لنا إلى أجرك، فاستأجر آخرين فقال أكملوا بقية يومكم، ولكم الذي شرطت، فعملوا حتى إذا كان حين صلاة العصر قالوا لك ما عملنا‏.‏ فاستأجر قوما فعملوا بقية يومهم حتى غابت الشمس، واستكملوا أجر الفريقين ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa:                     The Prophet said, \"The example of Muslims, Jews and Christians is like the example of a man who employed laborers to work for him from morning till night. They worked till midday and they said, 'We are not in need of your reward.' SO the man employed another batch and said to them, 'Complete the rest of the day and yours will be the wages I had fixed (for the first batch). They worked Up till the time of the `Asr prayer and said, 'Whatever we have done is for you.' He employed another batch. They worked for the rest of the day till sunset, and they received the wages of the two former batches.\"",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "567",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن العلاء، قال أخبرنا أبو أسامة، عن بريد، عن أبي بردة، عن أبي موسى، قال كنت أنا وأصحابي الذين، قدموا معي في السفينة نزولا في بقيع بطحان، والنبي صلى الله عليه وسلم بالمدينة، فكان يتناوب النبي صلى الله عليه وسلم عند صلاة العشاء كل ليلة نفر منهم، فوافقنا النبي  عليه السلام  أنا وأصحابي وله بعض الشغل في بعض أمره فأعتم بالصلاة حتى ابهار الليل، ثم خرج النبي صلى الله عليه وسلم فصلى بهم، فلما قضى صلاته قال لمن حضره ‏\"‏ على رسلكم، أبشروا إن من نعمة الله عليكم أنه ليس أحد من الناس يصلي هذه الساعة غيركم ‏\"‏‏.‏ أو قال ‏\"‏ ما صلى هذه الساعة أحد غيركم ‏\"‏‏.‏ لا يدري أى الكلمتين قال‏.‏ قال أبو موسى فرجعنا ففرحنا بما سمعنا من رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Abu Musa:                     My companions, who came with me in the boat and I landed at a place called Baqi [??] Buthan [??] . The Prophet was in Medina at that time. One of us used to go to the Prophet by turns every night at the time of the `Isha prayer. Once I along with my companions went to the Prophet and he was busy in some of his affairs, so the `Isha' prayer was delayed to the middle of the night He then came out and led the people (in prayer). After finishing from the prayer, he addressed the people present there saying, \"Be patient! Don't go away. Have the glad tiding. It is from the blessing of Allah upon you that none amongst mankind has prayed at this time save you.\" Or said, \"None except you has prayed at this time.\" Abu Musa added, 'So we returned happily after what we heard from Allah's Apostle .\"",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "574",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا هدبة بن خالد، قال حدثنا همام، حدثني أبو جمرة، عن أبي بكر بن أبي موسى، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من صلى البردين دخل الجنة ‏\"‏‏.‏ وقال ابن رجاء حدثنا همام عن أبي جمرة أن أبا بكر بن عبد الله بن قيس أخبره بهذا‏.‏ حدثنا إسحاق، عن حبان، حدثنا همام، حدثنا أبو جمرة، عن أبي بكر بن عبد الله، عن أبيه، عن النبي صلى الله عليه وسلم مثله‏.‏",
      "text_en": " Narrated Abu Bakr bin Abi Musa:                     My father said, \"Allah's Apostle said, 'Whoever prays the two cool prayers (`Asr and Fajr) will go to Paradise.' \"",
      "chain": [
        "20294",
        "20297",
        "11309",
        "11900",
        "41"
      ]
    },
    {
      "hadith_no": "651",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن العلاء، قال حدثنا أبو أسامة، عن بريد بن عبد الله، عن أبي بردة، عن أبي موسى، قال قال النبي صلى الله عليه وسلم ‏\"‏ أعظم الناس أجرا في الصلاة أبعدهم فأبعدهم ممشى، والذي ينتظر الصلاة حتى يصليها مع الإمام أعظم أجرا من الذي يصلي ثم ينام ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa:                     The Prophet said, \"The people who get tremendous reward for the prayer are those who are farthest away (from the mosque) and then those who are next farthest and so on. Similarly one who waits to pray with the Imam has greater reward than one who prays and goes to bed. \"",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "678",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا إسحاق بن نصر، قال حدثنا حسين، عن زائدة، عن عبد الملك بن عمير، قال حدثني أبو بردة، عن أبي موسى، قال مرض النبي صلى الله عليه وسلم فاشتد مرضه فقال ‏\"‏ مروا أبا بكر فليصل بالناس ‏\"‏‏.‏ قالت عائشة إنه رجل رقيق، إذا قام مقامك لم يستطع أن يصلي بالناس‏.‏ قال ‏\"‏ مروا أبا بكر فليصل بالناس ‏\"‏ فعادت فقال ‏\"‏ مري أبا بكر فليصل بالناس، فإنكن صواحب يوسف ‏\"‏‏.‏ فأتاه الرسول فصلى بالناس في حياة النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Abu Musa:                     \"The Prophet became sick and when his disease became aggravated, he said, \"Tell Abu Bakr to lead the prayer.\" `Aisha said, \"He is a softhearted man and would not be able to lead the prayer in your place.\" The Prophet said again, \"Tell Abu Bakr to lead the people in prayer.\" She repeated the same reply but he said, \"Tell Abu Bakr to lead the people in prayer. You are the companions of Joseph.\" So the messenger went to Abu Bakr (with that order) and he led the people in prayer in the lifetime of the Prophet.",
      "chain": [
        "30311",
        "11278",
        "20320",
        "11368",
        "1820",
        "41"
      ]
    },
    {
      "hadith_no": "1059",
      "source": " Sahih Bukhari ",
      "chapter": "Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "حدثنا محمد بن العلاء، قال حدثنا أبو أسامة، عن بريد بن عبد الله، عن أبي بردة، عن أبي موسى، قال خسفت الشمس، فقام النبي صلى الله عليه وسلم فزعا، يخشى أن تكون الساعة، فأتى المسجد، فصلى بأطول قيام وركوع وسجود رأيته قط يفعله وقال ‏\"‏ هذه الآيات التي يرسل الله لا تكون لموت أحد ولا لحياته، ولكن يخوف الله به عباده، فإذا رأيتم شيئا من ذلك فافزعوا إلى ذكره ودعائه واستغفاره ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa:                     The sun eclipsed and the Prophet got up, being afraid that it might be the Hour (i.e. Day of Judgment). He went to the Mosque and offered the prayer with the longest Qiyam, bowing and prostration that I had ever seen him doing. Then he said, \"These signs which Allah sends do not occur because of the life or death of somebody, but Allah makes His worshipers afraid by them. So when you see anything thereof, proceed to remember Allah, invoke Him and ask for His forgiveness.\"",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "1290",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا إسماعيل بن خليل، حدثنا علي بن مسهر، حدثنا أبو إسحاق  وهو الشيباني  عن أبي بردة، عن أبيه، قال لما أصيب عمر  رضى الله عنه  جعل صهيب يقول واأخاه‏.‏ فقال عمر أما علمت أن النبي صلى الله عليه وسلم قال ‏\"‏ إن الميت ليعذب ببكاء الحى ‏\"‏‏.‏",
      "text_en": " Narrated Abu Burda:                     That his father said, \"When `Umar was stabbed, Suhaib started crying: O my brother! `Umar said, 'Don't you know that the Prophet said: The deceased is tortured for the weeping of the living'?\"",
      "chain": [
        "30186",
        "20345",
        "11352",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "1435",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا أبو أسامة، عن بريد، عن أبي بردة، عن أبي موسى  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ ليأتين على الناس زمان يطوف الرجل فيه بالصدقة من الذهب ثم لا يجد أحدا يأخذها منه، ويرى الرجل الواحد يتبعه أربعون امرأة، يلذن به من قلة الرجال وكثرة النساء ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa:                     Thy Prophet (p.b.u.h) said, \"A time will come upon the people when a person will wander about with gold as Zakat and will not find anybody to accept it, and one man will be seen followed by forty women to be their guardian because of scarcity of men and great number of women. \"",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "1453",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا عبد الواحد، حدثنا أبو بردة بن عبد الله بن أبي بردة، حدثنا أبو بردة بن أبي موسى، عن أبيه  رضى الله عنه  قال كان رسول الله صلى الله عليه وسلم إذا جاءه السائل، أو طلبت إليه حاجة قال ‏\"‏ اشفعوا تؤجروا، ويقضي الله على لسان نبيه صلى الله عليه وسلم ما شاء ‏\"‏‏.‏",
      "text_en": " Narrated Abu Burda bin Abu Musa:                     that his father said, \"Whenever a beggar came to Allah's Apostle or he was asked for something, he used to say (to his companions), \"Help and recommend him and you will receive the reward for it; and Allah will bring about what He will through His Prophet's tongue.\"",
      "chain": [
        "20040",
        "20256",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "1460",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا أبو أسامة، عن بريد بن عبد الله، عن أبي بردة، عن أبي موسى، عن النبي صلى الله عليه وسلم قال ‏\"‏ الخازن المسلم الأمين الذي ينفذ  وربما قال يعطي  ما أمر به كاملا موفرا طيب به نفسه، فيدفعه إلى الذي أمر له به، أحد المتصدقين ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa:                     The Prophet said, \"An honest Muslim storekeeper who carries out the orders of his master and pays fully what he has been ordered to give with a good heart and pays to that person to whom he was ordered to pay, is regarded as one of the two charitable persons.\"",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "1584",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن قيس بن مسلم، عن طارق بن شهاب، عن أبي موسى  رضى الله عنه  قال بعثني النبي صلى الله عليه وسلم إلى قوم باليمن فجئت وهو بالبطحاء فقال ‏\"‏ بما أهللت ‏\"‏‏.‏ قلت أهللت كإهلال النبي صلى الله عليه وسلم قال ‏\"‏ هل معك من هدى ‏\"‏‏.‏ قلت لا‏.‏ فأمرني فطفت بالبيت وبالصفا والمروة ثم أمرني فأحللت فأتيت امرأة من قومي فمشطتني، أو غسلت رأسي، فقدم عمر  رضى الله عنه  فقال إن نأخذ بكتاب الله فإنه يأمرنا بالتمام قال الله ‏{‏وأتموا الحج والعمرة‏}‏ وإن نأخذ بسنة النبي صلى الله عليه وسلم فإنه لم يحل حتى نحر الهدى‏.‏",
      "text_en": " Narrated Abu Musa:                     The Prophet sent me to some people in Yemen and when I returned, I found him at Al-Batha. He asked me, \"With what intention have you assumed Ihram (i.e. for Hajj or for Umra or for both?\") I replied, \"I have assumed Ihram with an intention like that of the Prophet.\" He asked, \"Have you a Hadi with you?\" I replied in the negative. He ordered me to perform Tawaf round the Ka`ba and between Safa and Marwa and then to finish my Ihram. I did so and went to a woman from my tribe who combed my hair or washed my head. Then, when `Umar came (i.e. became Caliph) he said, \"If we follow Allah's Book, it orders us to complete Hajj and Umra; as Allah says: \"Perform the Hajj and Umra for Allah.\" (2.196). And if we follow the tradition of the Prophet who did not finish his Ihram till he sacrificed his Hadi.\"",
      "chain": [
        "30388",
        "20005",
        "11386",
        "3680",
        "41"
      ]
    },
    {
      "hadith_no": "1590",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا غندر، حدثنا شعبة، عن قيس بن مسلم، عن طارق بن شهاب، عن أبي موسى  رضى الله عنه  قال قدمت على النبي صلى الله عليه وسلم‏.‏ فأمره بالحل‏.‏",
      "text_en": " Narrated Abu Musa:                     came to the Prophet (from Yemen and was assuming Ihram for Hajj) and he ordered me to finish the Ihram (after performing the `Umra).",
      "chain": [
        "30170",
        "20278",
        "20020",
        "11386",
        "3680",
        "41"
      ]
    },
    {
      "hadith_no": "1751",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عبدان، قال أخبرني أبي، عن شعبة، عن قيس بن مسلم، عن طارق بن شهاب، عن أبي موسى  رضى الله عنه  قال قدمت على رسول الله صلى الله عليه وسلم وهو بالبطحاء‏.‏ فقال ‏\"‏ أحججت ‏\"‏‏.‏ قلت نعم‏.‏ قال ‏\"‏ بما أهللت ‏\"‏‏.‏ قلت لبيك بإهلال كإهلال النبي صلى الله عليه وسلم‏.‏ قال ‏\"‏ أحسنت، انطلق فطف بالبيت وبالصفا والمروة ‏\"‏‏.‏ ثم أتيت امرأة من نساء بني قيس، ففلت رأسي، ثم أهللت بالحج، فكنت أفتي به الناس، حتى خلافة عمر  رضى الله عنه  فذكرته له‏.‏ فقال إن نأخذ بكتاب الله فإنه يأمرنا بالتمام، وإن نأخذ بسنة رسول الله صلى الله عليه وسلم فإن رسول الله صلى الله عليه وسلم لم يحل حتى بلغ الهدى محله‏.‏",
      "text_en": " Narrated Abu Musa:                     I came upon Allah's Apostle when he was at Al-Batha. He asked me, \"Have you intended to perform the Hajj?\" I replied in the affirmative. He asked, \"For what have you assumed lhram?\" I replied,\" I have assumed Ihram with the same intention as that of the Prophet .\" The Prophet said, \"You have done well! Go and perform Tawaf round the Ka`ba and between Safa and Marwa.\" Then I went to one of the women of Bani Qais and she took out lice from my head. Later, I assumed the Ihram for Hajj. So, I used to give this verdict to the people till the caliphate of `Umar. When I told him about it, he said, \"If we take (follow) the Holy Book, then it orders us to complete Hajj and `Umra (Hajj-at- Tamattu`) and if we follow the tradition of Allah's Apostle then Allah's Apostle did not finish his lhram till the Hadi had reached its destination (had been slaughtered). (i.e. Hajj-al-Qiran). (See Hadith No. 630)",
      "chain": [
        "30349",
        "30361",
        "20020",
        "11386",
        "3680",
        "41"
      ]
    },
    {
      "hadith_no": "1823",
      "source": " Sahih Bukhari ",
      "chapter": "`Umrah (Minor pilgrimage) - كتاب العمرة",
      "chapter_no": "26",
      "text_ar": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن قيس بن مسلم، عن طارق بن شهاب، عن أبي موسى الأشعري  رضى الله عنه  قال قدمت على النبي صلى الله عليه وسلم بالبطحاء وهو منيخ فقال ‏\"‏ أحججت ‏\"‏‏.‏ قلت نعم‏.‏ قال ‏\"‏ بما أهللت ‏\"‏‏.‏ قلت لبيك بإهلال كإهلال النبي صلى الله عليه وسلم قال ‏\"‏ أحسنت‏.‏ طف بالبيت وبالصفا والمروة ثم أحل ‏\"‏‏.‏ فطفت بالبيت، وبالصفا والمروة، ثم أتيت امرأة من قيس، ففلت رأسي، ثم أهللت بالحج‏.‏ فكنت أفتي به، حتى كان في خلافة عمر فقال إن أخذنا بكتاب الله فإنه يأمرنا بالتمام، وإن أخذنا بقول النبي صلى الله عليه وسلم فإنه لم يحل حتى يبلغ الهدى محله‏.‏",
      "text_en": " Narrated Abu Musa Al-Ash`ari:                     I came to the Prophet at Al-Batha' while his camel was kneeling down and he asked me, \"Have you intended to perform the Hajj?\" I replied in the affirmative. He asked me, 'With what intention have you assumed Ihram?\" I replied, \"I have assumed Ihram with the same intention as that of the Prophet. He said, \"You have done well. Perform the Tawaf of the Ka`ba and (the Sai) between As-Safa and Al- Marwa and then finish the Ihram.\" So, I performed the Tawaf around the Ka`ba and the Sai) between As-Safa and Al-Marwa and then went to a woman of the tribe of Qais who cleaned my head from lice. Later I assumed the Ihram for Hajj. I used to give the verdict of doing the same till the caliphate of `Umar who said, \"If you follow the Holy Book then it orders you to remain in the state of Ihram till you finish from Hajj, if you follow the Prophet then he did not finish his Ihram till the Hadi (sacrifice) had reached its place of slaughtering (Hajj-al-Qiran).",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11386",
        "3680",
        "41"
      ]
    },
    {
      "hadith_no": "2005",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا أبو أسامة، عن أبي عميس، عن قيس بن مسلم، عن طارق بن شهاب، عن أبي موسى  رضى الله عنه  قال كان يوم عاشوراء تعده اليهود عيدا، قال النبي صلى الله عليه وسلم ‏\"‏ فصوموه أنتم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa:                     The day of 'Ashura' was considered as `Id day by the Jews. So the Prophet ordered, \"I recommend you (Muslims) to fast on this day.\"",
      "chain": [
        "30026",
        "20318",
        "11386",
        "3680",
        "41"
      ]
    },
    {
      "hadith_no": "2062",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد بن سلام، أخبرنا مخلد بن يزيد، أخبرنا ابن جريج، قال أخبرني عطاء، عن عبيد بن عمير، أن أبا موسى الأشعري، استأذن على عمر بن الخطاب  رضى الله عنه  فلم يؤذن له، وكأنه كان مشغولا فرجع أبو موسى، ففرغ عمر فقال ألم أسمع صوت عبد الله بن قيس ائذنوا له قيل قد رجع‏.‏ فدعاه‏.‏ فقال كنا نؤمر بذلك‏.‏ فقال تأتيني على ذلك بالبينة‏.‏ فانطلق إلى مجلس الأنصار، فسألهم‏.‏ فقالوا لا يشهد لك على هذا إلا أصغرنا أبو سعيد الخدري‏.‏ فذهب بأبي سعيد الخدري‏.‏ فقال عمر أخفي على من أمر رسول الله صلى الله عليه وسلم ألهاني الصفق بالأسواق‏.‏ يعني الخروج إلى تجارة‏.‏",
      "text_en": " Narrated 'Ubaid bin `Umair:                     Abu Musa asked `Umar to admit him but he was not admitted as `Umar was busy, so Abu Musa went back. When `Umar finished his job he said, \"Didn't I hear the voice of `Abdullah bin Qais? Let him come in.\" `Umar was told that he had left. So, he sent for him and on his arrival, he (Abu Musa) said, \"We were ordered to do so (i.e. to leave if not admitted after asking permission thrice). `Umar told him, \"Bring witness in proof of your statement.\" Abu Musa went to the Ansar's meeting places and asked them. They said, \"None amongst us will give this witness except the youngest of us, Abu Sa`id Al-Khudri. Abu Musa then took Abu Sa`id Al-Khudri (to `Umar) and `Umar said, surprisingly, \"Has this order of Allah's Apostle been hidden from me?\" (Then he added), \"I used to be busy trading in markets.\"",
      "chain": [
        "30376",
        "20462",
        "11070",
        "11029",
        "11259",
        "41"
      ]
    },
    {
      "hadith_no": "2101",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثني موسى بن إسماعيل، حدثنا عبد الواحد، حدثنا أبو بردة بن عبد الله، قال سمعت أبا بردة بن أبي موسى، عن أبيه  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ مثل الجليس الصالح والجليس السوء كمثل صاحب المسك، وكير الحداد، لا يعدمك من صاحب المسك إما تشتريه، أو تجد ريحه، وكير الحداد يحرق بدنك أو ثوبك أو تجد منه ريحا خبيثة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa:                     Allah's Apostle said, \"The example of a good companion (who sits with you) in comparison with a bad one, is I like that of the musk seller and the blacksmith's bellows (or furnace); from the first you would either buy musk or enjoy its good smell while the bellows would either burn your clothes or your house, or you get a bad nasty smell thereof.\"",
      "chain": [
        "20040",
        "20256",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "2261",
      "source": " Sahih Bukhari ",
      "chapter": "Hiring - كتاب الإجارة",
      "chapter_no": "37",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن قرة بن خالد، قال حدثني حميد بن هلال، حدثنا أبو بردة، عن أبي موسى  رضى الله عنه  قال أقبلت إلى النبي صلى الله عليه وسلم ومعي رجلان من الأشعريين، فقلت ما علمت أنهما يطلبان العمل‏.‏ فقال ‏\"‏ لن أو لا نستعمل على عملنا من أراده ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa:                     I went to the Prophet with two men from Ash`ari tribe. I said (to the Prophet), \"I do not know that they want employment.\" The Prophet said, \"No, we do not appoint for our jobs anybody who demands it earnestly.\"",
      "chain": [
        "30175",
        "20031",
        "11301",
        "11281",
        "1820",
        "41"
      ]
    },
    {
      "hadith_no": "2271",
      "source": " Sahih Bukhari ",
      "chapter": "Hiring - كتاب الإجارة",
      "chapter_no": "37",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا أبو أسامة، عن بريد، عن أبي بردة، عن أبي موسى  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ مثل المسلمين واليهود والنصارى كمثل رجل استأجر قوما يعملون له عملا يوما إلى الليل على أجر معلوم، فعملوا له إلى نصف النهار فقالوا لا حاجة لنا إلى أجرك الذي شرطت لنا، وما عملنا باطل، فقال لهم لا تفعلوا أكملوا بقية عملكم، وخذوا أجركم كاملا، فأبوا وتركوا، واستأجر أجيرين بعدهم فقال لهما أكملا بقية يومكما هذا، ولكما الذي شرطت لهم من الأجر‏.‏ فعملوا حتى إذا كان حين صلاة العصر قالا لك ما عملنا باطل، ولك الأجر الذي جعلت لنا فيه‏.‏ فقال لهما أكملا بقية عملكما، فإن ما بقي من النهار شىء يسير‏.‏ فأبيا، واستأجر قوما أن يعملوا له بقية يومهم، فعملوا بقية يومهم حتى غابت الشمس، واستكملوا أجر الفريقين كليهما، فذلك مثلهم ومثل ما قبلوا من هذا النور ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa:                     The Prophet said, \"The example of Muslims, Jews and Christians is like the example of a man who employed laborers to work for him from morning till night for specific wages. They worked till midday and then said, 'We do not need your money which you have fixed for us and let whatever we have done be annulled.' The man said to them, 'Don't quit the work, but complete the rest of it and take your full wages.' But they refused and went away. The man employed another batch after them and said to them, 'Complete the rest of the day and yours will be the wages I had fixed for the first batch.' So, they worked till the time of `Asr prayer. Then they said, \"Let what we have done be annulled and keep the wages you have promised us for yourself.' The man said to them, 'Complete the rest of the work, as only a little of the day remains,' but they refused. Thereafter he employed another batch to work for the rest of the day and they worked for the rest of the day till the sunset, and they received the wages of the two former batches. So, that was the example of those people (Muslims) and the example of this light (guidance) which they have accepted willingly.",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "2319",
      "source": " Sahih Bukhari ",
      "chapter": "Representation; Authorization; Business by Proxy - كتاب الوكالة",
      "chapter_no": "40",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا أبو أسامة، عن بريد بن عبد الله، عن أبي بردة، عن أبي موسى  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ الخازن الأمين الذي ينفق  وربما قال الذي يعطي  ما أمر به كاملا موفرا، طيب نفسه، إلى الذي أمر به، أحد المتصدقين ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa:                     The Prophet said, \"An honest treasurer who gives what he is ordered to give fully, perfectly and willingly to the person to whom he is ordered to give, is regarded as one of the two charitable persons.\"",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "2446",
      "source": " Sahih Bukhari ",
      "chapter": "Oppressions - كتاب المظالم",
      "chapter_no": "46",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا أبو أسامة، عن بريد، عن أبي بردة، عن أبي موسى  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ المؤمن للمؤمن كالبنيان يشد بعضه بعضا ‏\"‏‏.‏ وشبك بين أصابعه‏.‏",
      "text_en": " Narrated Abu Musa:                     The Prophet said, \"A believer to another believer is like a building whose different parts enforce each other.\" The Prophet then clasped his hands with the fingers interlaced (while saying that).",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "2486",
      "source": " Sahih Bukhari ",
      "chapter": "Partnership - كتاب الشركة",
      "chapter_no": "47",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا حماد بن أسامة، عن بريد، عن أبي بردة، عن أبي موسى، قال قال النبي صلى الله عليه وسلم ‏\"‏ إن الأشعريين إذا أرملوا في الغزو، أو قل طعام عيالهم بالمدينة جمعوا ما كان عندهم في ثوب واحد، ثم اقتسموه بينهم في إناء واحد بالسوية، فهم مني وأنا منهم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa:                     The Prophet said, \"When the people of Ash`ari tribe ran short of food during the holy battles, or the food of their families in Medina ran short, they would collect all their remaining food in one sheet and then distribute it among themselves equally by measuring it with a bowl. So, these people are from me, and I am from them.\"",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "2544",
      "source": " Sahih Bukhari ",
      "chapter": "Manumission of Slaves - كتاب العتق",
      "chapter_no": "49",
      "text_ar": "حدثنا إسحاق بن إبراهيم، سمع محمد بن فضيل، عن مطرف، عن الشعبي، عن أبي بردة، عن أبي موسى  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من كانت له جارية فعالها، فأحسن إليها ثم أعتقها وتزوجها، كان له أجران ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa:                     Allah's Apostle said, \"He who has a slave-girl and educates and treats her nicely and then manumits and marries her, will get a double reward.\"",
      "chain": [
        "30123",
        "20356",
        "11395",
        "11052",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "2547",
      "source": " Sahih Bukhari ",
      "chapter": "Manumission of Slaves - كتاب العتق",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، عن صالح، عن الشعبي، عن أبي بردة، عن أبي موسى الأشعري  رضى الله عنه  قال النبي صلى الله عليه وسلم ‏\"‏ أيما رجل كانت له جارية فأدبها فأحسن تأديبها، وأعتقها وتزوجها، فله أجران، وأيما عبد أدى حق الله وحق مواليه، فله أجران ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa Al-Ash`ari:                     The Prophet said, \"He who has a slave-girl and teaches her good manners and improves her education and then manumits and marries her, will get a double reward; and any slave who observes Allah's right and his master's right will get a double reward.\"",
      "chain": [
        "28531",
        "20012",
        "11176",
        "11052",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "2551",
      "source": " Sahih Bukhari ",
      "chapter": "Manumission of Slaves - كتاب العتق",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا أبو أسامة، عن بريد، عن أبي بردة، عن أبي موسى  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ المملوك الذي يحسن عبادة ربه، ويؤدي إلى سيده الذي له عليه من الحق والنصيحة والطاعة، له أجران ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa:                     The Prophet said, \"The Mamluk (slave) who worships his Lord in a perfect manner, and is dutiful, sincere and obedient to his Saiyid (master), will get a double reward.\"",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "2663",
      "source": " Sahih Bukhari ",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا محمد بن صباح، حدثنا إسماعيل بن زكرياء، حدثنا بريد بن عبد الله، عن أبي بردة، عن أبي موسى  رضى الله عنه  قال سمع النبي صلى الله عليه وسلم رجلا يثني على رجل، ويطريه في مدحه فقال ‏\"‏ أهلكتم  أو قطعتم  ظهر الرجل ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa Al-Ash`ari:                     The Prophet heard someone praising another and exaggerating in his praise. The Prophet said, \"You have ruined or cut the man's back (by praising him so much).",
      "chain": [
        "30269",
        "20313",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "2810",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن عمرو، عن أبي وائل، عن أبي موسى  رضى الله عنه  قال جاء رجل إلى النبي صلى الله عليه وسلم فقال الرجل يقاتل للمغنم، والرجل يقاتل للذكر، والرجل يقاتل ليرى مكانه، فمن في سبيل الله قال ‏\"‏ من قاتل لتكون كلمة الله هي العليا فهو في سبيل الله ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa:                     A man came to the Prophet and asked, \"A man fights for war booty; another fights for fame and a third fights for showing off; which of them fights in Allah's Cause?\" The Prophet said, \"He who fights that Allah's Word (i.e. Islam) should be superior, fights in Allah's Cause.\"",
      "chain": [
        "20193",
        "20020",
        "20377",
        "11353",
        "41"
      ]
    },
    {
      "hadith_no": "2884",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا أبو أسامة، عن بريد بن عبد الله، عن أبي بردة، عن أبي موسى  رضى الله عنه  قال رمي أبو عامر في ركبته، فانتهيت إليه قال انزع هذا السهم‏.‏ فنزعته، فنزا منه الماء، فدخلت على النبي صلى الله عليه وسلم فأخبرته، فقال ‏\"‏ اللهم اغفر لعبيد أبي عامر ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa:                     Abu 'Amir was hit with an arrow in his knee, so I went to him and he asked me to remove the arrow. When I removed it, the water started dribbling from it. Then I went to the Prophet and told him about it. He said, \"O Allah! Forgive `Ubaid Abu 'Amir.\"",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "2992",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن عاصم، عن أبي عثمان، عن أبي موسى الأشعري  رضى الله عنه  قال كنا مع رسول الله صلى الله عليه وسلم، فكنا إذا أشرفنا على واد هللنا وكبرنا ارتفعت أصواتنا، فقال النبي صلى الله عليه وسلم ‏\"‏ يا أيها الناس، اربعوا على أنفسكم، فإنكم لا تدعون أصم ولا غائبا، إنه معكم، إنه سميع قريب، تبارك اسمه وتعالى جده ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa Al-Ash`ari:                     We were in the company of Allah's Apostle (during Hajj). Whenever we went up a high place we used to say: \"None has the right to be worshipped but Allah, and Allah is Greater,\" and our voices used to rise, so the Prophet said, \"O people! Be merciful to yourselves (i.e. don't raise your voice), for you are not calling a deaf or an absent one, but One Who is with you, no doubt He is All-Hearer, ever Near (to all things).",
      "chain": [
        "30388",
        "20005",
        "11080",
        "11113",
        "41"
      ]
    },
    {
      "hadith_no": "3046",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا جرير، عن منصور، عن أبي وائل، عن أبي موسى  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ فكوا العاني  يعني الأسير  وأطعموا الجائع وعودوا المريض ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa:                     The Prophet said, \"Free the captives, feed the hungry and pay a visit to the sick.\"",
      "chain": [
        "30367",
        "20028",
        "11067",
        "11353",
        "41"
      ]
    },
    {
      "hadith_no": "3126",
      "source": " Sahih Bukhari ",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثني محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن عمرو، قال سمعت أبا وائل، قال حدثنا أبو موسى الأشعري  رضى الله عنه  قال قال أعرابي للنبي صلى الله عليه وسلم الرجل يقاتل للمغنم، والرجل يقاتل ليذكر، ويقاتل ليرى مكانه، من في سبيل الله فقال ‏\"‏ من قاتل لتكون كلمة الله هي العليا فهو في سبيل الله ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa Al-Ash`ari:                     A bedouin asked the Prophet, \"A man may fight for the sake of booty, and another may fight so that he may be mentioned by the people, and a third may fight to show his position (i.e. bravery); which of these regarded as fighting in Allah's Cause?\" The Prophet said, \"He who fights so that Allah's Word (i.e. Islam) should be superior, fights for Allah's Cause.\"",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11439",
        "11353",
        "41"
      ]
    },
    {
      "hadith_no": "3136",
      "source": " Sahih Bukhari ",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا أبو أسامة، حدثنا بريد بن عبد الله، عن أبي بردة، عن أبي موسى  رضى الله عنه  قال بلغنا مخرج النبي صلى الله عليه وسلم ونحن باليمن فخرجنا مهاجرين إليه، أنا وأخوان لي، أنا أصغرهم، أحدهما أبو بردة والآخر أبو رهم، إما قال في بضع، وإما قال في ثلاثة وخمسين أو اثنين وخمسين رجلا من قومي فركبنا سفينة، فألقتنا سفينتنا إلى النجاشي بالحبشة، ووافقنا جعفر بن أبي طالب وأصحابه عنده فقال جعفر إن رسول الله صلى الله عليه وسلم بعثنا ها هنا، وأمرنا بالإقامة فأقيموا معنا‏.‏ فأقمنا معه، حتى قدمنا جميعا، فوافقنا النبي صلى الله عليه وسلم حين افتتح خيبر، فأسهم لنا‏.‏ أو قال فأعطانا منها‏.‏ وما قسم لأحد غاب عن فتح خيبر منها شيئا، إلا لمن شهد معه، إلا أصحاب سفينتنا مع جعفر وأصحابه، قسم لهم معهم‏.‏",
      "text_en": " Narrated Abu Musa:                     We got the news of the migration of the Prophet while we were in Yemen, so we set out migrating to him. We were, I and my two brothers, I being the youngest, and one of my brothers was Abu Burda and the other was Abu Ruhm. We were over fifty (or fifty-three or fifty two) men from our people. We got on board a ship which took us to An-Najashi in Ethiopia, and there we found Ja`far bin Abu Talib and his companions with An-Najaishi. Ja`far said (to us), \"Allah's Apostle has sent us here and ordered us to stay here, so you too, stay with us.\" We stayed with him till we all left (Ethiopia) and met the Prophet at the time when he had conquered Khaibar. He gave us a share from its booty (or gave us from its booty). He gave only to those who had taken part in the Ghazwa with him. but he did not give any share to any person who had not participated in Khaibar's conquest except the people of our ship, besides Ja`far and his companions, whom he gave a share as he did them (i.e. the people of the ship).",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "3385",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا الربيع بن يحيى البصري، حدثنا زائدة، عن عبد الملك بن عمير، عن أبي بردة بن أبي موسى، عن أبيه، قال مرض النبي صلى الله عليه وسلم فقال ‏\"‏ مروا أبا بكر فليصل بالناس ‏\"‏‏.‏ فقالت إن أبا بكر رجل‏.‏ فقال مثله فقالت مثله‏.‏ فقال ‏\"‏ مروه فإنكن صواحب يوسف ‏\"‏‏.‏ فأم أبو بكر في حياة رسول الله صلى الله عليه وسلم‏.‏ فقال حسين عن زائدة رجل رقيق‏.‏",
      "text_en": " Narrated Abu Musa:                     When the Prophet fell ill, he said, \"Order Abu Bakr to lead the people in prayer.\" `Aisha said, \"Abu Bakr is a soft-hearted person. The Prophet gave the same order again and she again gave the same reply. He again said, \"Order Abu Bakr (to lead the prayer)! You are (like) the female companions of Joseph.\" Consequently Abu Bakr led the people in prayer in the life-time of the Prophet.",
      "chain": [
        "30133",
        "20320",
        "11368",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "3411",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا يحيى بن جعفر، حدثنا وكيع، عن شعبة، عن عمرو بن مرة، عن مرة الهمداني، عن أبي موسى  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ كمل من الرجال كثير، ولم يكمل من النساء إلا آسية امرأة فرعون، ومريم بنت عمران، وإن فضل عائشة على النساء كفضل الثريد على سائر الطعام ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa:                     Allah's Apostle said, \"Many amongst men reached (the level of) perfection but none amongst the women reached this level except Asia, Pharaoh's wife, and Mary, the daughter of `Imran. And no doubt, the superiority of `Aisha to other women is like the superiority of Tharid (i.e. a meat and bread dish) to other meals.\"",
      "chain": [
        "30397",
        "20032",
        "20020",
        "11381",
        "9759",
        "41"
      ]
    },
    {
      "hadith_no": "3433",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا آدم، حدثنا شعبة، عن عمرو بن مرة، قال سمعت مرة الهمداني، يحدث عن أبي موسى الأشعري  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ فضل عائشة على النساء كفضل الثريد على سائر الطعام، كمل من الرجال كثير، ولم يكمل من النساء إلا مريم بنت عمران وآسية امرأة فرعون ‏\"‏‏.‏",
      "text_en": "  Narrated Abu Musa Al-Ash`ari:                      The Prophet said, \"The superiority of `Aisha to other ladies is like the superiority of Tharid (i.e. meat and bread dish) to other meals. Many men reached the level of perfection, but no woman reached such a level except Mary, the daughter of `Imran and Asia, the wife of Pharaoh.\"",
      "chain": [
        "20404",
        "20020",
        "11381",
        "9759",
        "41"
      ]
    },
    {
      "hadith_no": "3446",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا محمد بن مقاتل، أخبرنا عبد الله، أخبرنا صالح بن حى، أن رجلا، من أهل خراسان قال للشعبي‏.‏ فقال الشعبي أخبرني أبو بردة عن أبي موسى الأشعري  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا أدب الرجل أمته فأحسن تأديبها، وعلمها فأحسن تعليمها ثم أعتقها فتزوجها، كان له أجران، وإذا آمن بعيسى ثم آمن بي، فله أجران، والعبد إذا اتقى ربه وأطاع مواليه، فله أجران ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa Al-Ash`ari:                     Allah's Apostle said, \"If a person teaches his slave girl good manners properly, educates her properly, and then manumits and marries her, he will get a double reward. And if a man believes in Jesus and then believes in me, he will get a double reward. And if a slave fears his Lord (i.e. Allah) and obeys his masters, he too will get a double reward.\"",
      "chain": [
        "30118",
        "20025",
        "11431",
        "1820",
        "41"
      ]
    },
    {
      "hadith_no": "3665",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثني محمد بن العلاء، حدثنا حماد بن أسامة، عن بريد بن عبد الله بن أبي بردة، عن جده أبي بردة، عن أبي موسى  أراه  عن النبي صلى الله عليه وسلم قال ‏\"‏ رأيت في المنام أني أهاجر من مكة إلى أرض بها نخل، فذهب وهلي إلى أنها اليمامة أو هجر، فإذا هي المدينة يثرب، ورأيت في رؤياى هذه أني هززت سيفا فانقطع صدره، فإذا هو ما أصيب من المؤمنين يوم أحد، ثم هززته بأخرى فعاد أحسن ما كان، فإذا هو ما جاء الله به من الفتح واجتماع المؤمنين، ورأيت فيها بقرا والله خير فإذا هم المؤمنون يوم أحد، وإذا الخير ما جاء الله من الخير، وثواب الصدق الذي آتانا الله بعد يوم بدر ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa:                     The Prophet said, \"In a dream I saw myself migrating from Mecca to a place having plenty of date trees. I thought that it was Al-Yamama or Hajar, but it came to be Medina i.e. Yathrib. In the same dream I saw myself moving a sword and its blade got broken. It came to symbolize the defeat which the Muslims suffered from, on the Day of Uhud. I moved the sword again, and it became normal as before, and that was the symbol of the victory Allah bestowed upon Muslims and their gathering together. I saw cows in my dream, and by Allah, that was a blessing, and they symbolized the believers on the Day of Uhud. And the blessing was the good Allah bestowed upon us and the reward of true belief which Allah gave us after the day of Badr.",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "3718",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا محمد بن مسكين أبو الحسن، حدثنا يحيى بن حسان، حدثنا سليمان، عن شريك بن أبي نمر، عن سعيد بن المسيب، قال أخبرني أبو موسى الأشعري، أنه توضأ في بيته ثم خرج، فقلت لألزمن رسول الله صلى الله عليه وسلم، ولأكونن معه يومي هذا‏.‏ قال فجاء المسجد، فسأل عن النبي صلى الله عليه وسلم فقالوا خرج ووجه ها هنا، فخرجت على إثره أسأل عنه، حتى دخل بئر أريس، فجلست عند الباب، وبابها من جريد حتى قضى رسول الله صلى الله عليه وسلم حاجته، فتوضأ فقمت إليه، فإذا هو جالس على بئر أريس، وتوسط قفها، وكشف عن ساقيه ودلاهما في البئر، فسلمت عليه ثم انصرفت، فجلست عند الباب، فقلت لأكونن بواب رسول الله صلى الله عليه وسلم اليوم، فجاء أبو بكر فدفع الباب‏.‏ فقلت من هذا فقال أبو بكر‏.‏ فقلت على رسلك‏.‏ ثم ذهبت فقلت يا رسول الله هذا أبو بكر يستأذن‏.‏ فقال ‏\"‏ ائذن له وبشره بالجنة ‏\"‏‏.‏ فأقبلت حتى قلت لأبي بكر ادخل، ورسول الله صلى الله عليه وسلم يبشرك بالجنة‏.‏ فدخل أبو بكر فجلس عن يمين رسول الله صلى الله عليه وسلم معه في القف، ودلى رجليه في البئر، كما صنع النبي صلى الله عليه وسلم، وكشف عن ساقيه، ثم رجعت فجلست وقد تركت أخي يتوضأ ويلحقني، فقلت إن يرد الله بفلان خيرا  يريد أخاه  يأت به‏.‏ فإذا إنسان يحرك الباب‏.‏ فقلت من هذا فقال عمر بن الخطاب‏.‏ فقلت على رسلك‏.‏ ثم جئت إلى رسول الله صلى الله عليه وسلم فسلمت عليه، فقلت هذا عمر بن الخطاب يستأذن‏.‏ فقال ‏\"‏ ائذن له وبشره بالجنة ‏\"‏‏.‏ فجئت فقلت ادخل وبشرك رسول الله صلى الله عليه وسلم بالجنة‏.‏ فدخل، فجلس مع رسول الله صلى الله عليه وسلم في القف عن يساره، ودلى رجليه في البئر، ثم رجعت فجلست، فقلت إن يرد الله بفلان خيرا يأت به‏.‏ فجاء إنسان يحرك الباب، فقلت من هذا فقال عثمان بن عفان‏.‏ فقلت على رسلك‏.‏ فجئت إلى رسول الله صلى الله عليه وسلم فأخبرته‏.‏ فقال ‏\"‏ ائذن له وبشره بالجنة على بلوى تصيبه ‏\"‏ فجئته فقلت له ادخل وبشرك رسول الله صلى الله عليه وسلم بالجنة على بلوى تصيبك‏.‏ فدخل فوجد القف قد ملئ، فجلس وجاهه من الشق الآخر‏.‏ قال شريك قال سعيد بن المسيب فأولتها قبورهم‏.‏",
      "text_en": " Narrated Abu Musa Al-Ash`ari:                     I performed ablution in my house and then went out and said, \"Today I shall stick to Allah's Apostle and stay with him all this day of mine (in his service).\" I went to the Mosque and asked about the Prophet . They said, \"He had gone in this direction.\" So I followed his way, asking about him till he entered a place called Bir Aris. I sat at its gate that was made of date-palm leaves till the Prophet finished answering the call of nature and performed ablution. Then I went up to him to see him sitting at the well of Aris at the middle of its edge with his legs uncovered, hanging in the well. I greeted him and went back and sat at the gate. I said, \"Today I will be the gatekeeper of the Prophet.\" Abu Bakr came and pushed the gate. I asked, \"Who is it?\" He said, \"Abu Bakr.\" I told him to wait, went in and said, \"O Allah's Apostle! Abu Bakr asks for permission to enter.\" He said, \"Admit him and give him the glad tidings that he will be in Paradise.\" So I went out and said to Abu Bakr, \"Come in, and Allah's Apostle gives you the glad tidings that you will be in Paradise\" Abu Bakr entered and sat on the right side of Allah's Apostle on the built edge of the well and hung his legs n the well as the Prophet did and uncovered his legs. I then returned and sat (at the gate). I had left my brother performing ablution and he intended to follow me. So I said (to myself). \"If Allah wants good for so-and-so (i.e. my brother) He will bring him here.\" Suddenly somebody moved the door. I asked, \"Who is it?\" He said, \"`Umar bin Al-Khattab.\" I asked him to wait, went to Allah's Apostle, greeted him and said, `Umar bin Al-Khattab asks the permission to enter.\" He said, \"Admit him, and give him the glad tidings that he will be in Paradise.\" I went to \"`Umar and said \"Come in, and Allah's Apostle, gives you the glad tidings that you will be in Paradise.\" So he entered and sat beside Allah's Apostle on the built edge of the well on the left side and hung his legs in the well. I returned and sat (at the gate) and said, (to myself), \"If Allah wants good for so-and-so, He will bring him here.\" Somebody came and moved the door. I asked \"Who is it?\" He replied, \"Uthman bin `Affan.\" I asked him to wait and went to the Prophet and informed him. He said, \"Admit him, and give him the glad tidings of entering Paradise, I asked him to wait and went to the Prophet and informed him. He said, \"Adult him, and give him the glad tidings of entering Paradise after a calamity that will befall him.\" So I went up to him and said to him, \"Come in; Allah's Apostle gives you the glad tidings of entering Paradise after a calamity that will befall you. \"Uthman then came in and found that the built edge of the well was occupied, so he sat opposite to the Prophet on the other side. Sa`id bin Al-Musaiyab said, \"I interpret this (narration) in terms of their graves.\"",
      "chain": [
        "30275",
        "20300",
        "20160",
        "11858",
        "11002",
        "41"
      ]
    },
    {
      "hadith_no": "3739",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا يوسف بن موسى، حدثنا أبو أسامة، قال حدثني عثمان بن غياث، حدثنا أبو عثمان النهدي، عن أبي موسى  رضى الله عنه  قال كنت مع النبي صلى الله عليه وسلم في حائط من حيطان المدينة، فجاء رجل فاستفتح، فقال النبي صلى الله عليه وسلم ‏\"‏ افتح له وبشره بالجنة ‏\"‏‏.‏ ففتحت له، فإذا أبو بكر، فبشرته بما قال النبي صلى الله عليه وسلم فحمد الله، ثم جاء رجل فاستفتح، فقال النبي صلى الله عليه وسلم ‏\"‏ افتح له وبشره بالجنة ‏\"‏‏.‏ ففتحت له، فإذا هو عمر، فأخبرته بما قال النبي صلى الله عليه وسلم فحمد الله، ثم استفتح رجل، فقال لي ‏\"‏ افتح له وبشره بالجنة على بلوى تصيبه ‏\"‏‏.‏ فإذا عثمان، فأخبرته بما قال رسول الله صلى الله عليه وسلم فحمد الله ثم قال الله المستعان‏.‏",
      "text_en": " Narrated Abu Musa:                     While I was with the Prophet in one of the gardens of Medina, a man came and asked me to open the gate. The Prophet said to me, \"Open the gate for him and give him the glad tidings that he will enter Paradise.\" I opened (the gate) for him, and behold! It was Abu Bakr. I informed him of the glad tidings the Prophet had said, and he praised Allah. Then another man came and asked me to open the gate. The Prophet said to me \"Open (the gate) and give him the glad tidings of entering Paradise.\" I opened (the gate) for him, and behold! It was `Umar. I informed him of what the Prophet had said, and he praised Allah. Then another man came and asked me to open the gate. The Prophet said to me. \"Open (the gate) for him and inform him of the glad tidings, of entering Paradise with a calamity which will befall him. \" Behold ! It was `Uthman, I informed him of what Allah's Apostle had said. He praised Allah and said, \"I seek Allah's Aid.\"",
      "chain": [
        "30224",
        "20318",
        "11600",
        "11113",
        "41"
      ]
    },
    {
      "hadith_no": "3741",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد، عن أيوب، عن أبي عثمان، عن أبي موسى  رضى الله عنه  أن النبي صلى الله عليه وسلم دخل حائطا وأمرني بحفظ باب الحائط، فجاء رجل يستأذن، فقال ‏\"‏ ائذن له وبشره بالجنة ‏\"‏‏.‏ فإذا أبو بكر، ثم جاء آخر يستأذن فقال ‏\"‏ ائذن له وبشره بالجنة ‏\"‏‏.‏ فإذا عمر، ثم جاء آخر يستأذن، فسكت هنيهة ثم قال ‏\"‏ ائذن له وبشره بالجنة على بلوى ستصيبه ‏\"‏‏.‏ فإذا عثمان بن عفان‏.‏ قال حماد وحدثنا عاصم الأحول، وعلي بن الحكم، سمعا أبا عثمان، يحدث عن أبي موسى، بنحوه، وزاد فيه عاصم أن النبي صلى الله عليه وسلم كان قاعدا في مكان فيه ماء، قد انكشفت عن ركبتيه أو ركبته، فلما دخل عثمان غطاها‏.‏",
      "text_en": " Narrated Abu Musa:                     The Prophet entered a garden and ordered me to guard its gate. A man came and asked permission to enter. The Prophet said, \"Admit him and give him the glad tidings of entering Paradise.\" Behold! It was Abu Bakr. Another man came and asked the permission to enter. The Prophet said, \"Admit him and give him the glad tidings of entering Paradise.\" Behold! It was `Umar. Then another man came, asking the permission to enter. The Prophet kept silent for a short while and then said, \"Admit him and give him the glad tidings of entering Paradise with a calamity which will befall him.\" Behold! It was `Uthman bin `Affan. `Asim, in another narration, said that the Prophet was sitting in a place where there was water, and he was uncovering both his knees or his knee, and when `Uthman entered, he covered them (or it).",
      "chain": [
        "20193",
        "20022",
        "11015",
        "11113",
        "41"
      ]
    },
    {
      "hadith_no": "3809",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثني محمد بن العلاء، حدثنا إبراهيم بن يوسف بن أبي إسحاق، قال حدثني أبي، عن أبي إسحاق، قال حدثني الأسود بن يزيد، قال سمعت أبا موسى الأشعري  رضى الله عنه  يقول قدمت أنا وأخي من اليمن، فمكثنا حينا ما نرى إلا أن عبد الله بن مسعود رجل من أهل بيت النبي صلى الله عليه وسلم، لما نرى من دخوله ودخول أمه على النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Abu Musa Al-Ash`ari:                     My brother and I came from Yemen, and for some time we continued to consider `Abdullah bin Mas`ud as one of the members of the family of the Prophet because we used to see him and his mother going in the house of the Prophet very often.",
      "chain": [
        "30216",
        "20406",
        "20473",
        "11049",
        "11054",
        "41"
      ]
    }
  ],
  "total_hadiths": 342
}