{
  "id": "410",
  "name": "Khuzayma bin Thabit ( خزيمة بن ثابت بن الفاكه ( رضي الله عنه",
  "full_name": "Khuzayma bin Thabit ( خزيمة بن ثابت بن الفاكه ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medinah"
    },
    "death": {
      "date_hijri": "37",
      "date_gregorian": "658",
      "date_display": null,
      "place": "Siffin, Jamal",
      "reason": "Martyred"
    },
    "places_of_stay": [
      "Medina",
      "Kufa"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ م  4  -  صحابة ]"
    ],
    "tags": [
      "Ansar",
      "Aws",
      "B.Khutama",
      "Uhud",
      "Khandaq"
    ]
  },
  "parents": [
    {
      "id": "1783",
      "name": "Kabsha bint Aws bin 'Adi ( كبشة بنت أوس بن عدي ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "411",
      "name": "'Abdullah bin Thabit ( عبد الله بن ثابت بن الفاكه الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "1786",
      "name": "Safiyya bint Thabit ( صفية بنت ثابت بن الفاكه ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "1787",
      "name": "Mulayka bint Thabit ( مليكة بنت ثابت بن الفاكه ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "1788",
      "name": "Rifa'a bint Thabit ( رفاعة بنت ثابت بن الفاكه ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "1789",
      "name": "Hasana bint Thabit ( الرائعة / حسنة بنت ثابت بن الفاكه ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "children": [
    {
      "id": "19817",
      "name": "'Ammara bin Khuzayma bin Thabit عمارة بن خزيمة بن ثابت الأنصاري الأوسي",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "students": [
    {
      "id": "19817",
      "name": "'Ammara bin Khuzayma bin Thabit عمارة بن خزيمة بن ثابت الأنصاري الأوسي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "34",
      "name": "Jabir ibn 'Abdullah ( جابر بن عبد الله بن عمرو السلمي الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "12378",
      "name": "Amarh bin 'Uthman bin Hnyf عمارة بن عثمان بن حنيف الأنصاري المدني",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11382",
      "name": "'Amr bin Maymun al-Aw'di عمرو بن ميمون الأودي أبو عبد الله",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "10557",
      "name": "Ibrahim bin Sa'd ibn Abi Waqqas إبراهيم بن سعد بن أبى وقاص الزهرى",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19307",
      "name": "Abu 'Abdullah al-Jdly أبو عبد الله الجدلي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11196",
      "name": "'Abdur Rahman bin Abi Layla عبد الرحمن بن أبي ليلى",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11020",
      "name": "'Ata ibn Yasar عطاء بن يسار أبو محمد مولى ميمونة",
      "grade": "Follower(Tabi') [2nd Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "5912",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن سفيان، عن حبيب، عن إبراهيم، بن سعد عن سعد بن مالك، وخزيمة بن ثابت، وأسامة بن زيد، قالوا قال رسول الله صلى الله عليه وسلم بمعنى حديث شعبة ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Sa'd b. Malik, Khuzaima b. Thabit and Usama b. Zaid.",
      "chain": [
        "30201",
        "20032",
        "20012",
        "11276",
        "20150",
        "410",
        "50"
      ]
    },
    {
      "hadith_no": "41",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا أبو معاوية، عن هشام بن عروة، عن عمرو بن خزيمة، عن عمارة بن خزيمة، عن خزيمة بن ثابت، قال سئل رسول الله صلى الله عليه وسلم عن الاستطابة فقال ‏\"‏ بثلاثة أحجار ليس فيها رجيع ‏\"‏ ‏.‏ قال أبو داود كذا رواه أبو أسامة وابن نمير عن هشام يعني ابن عروة ‏.‏",
      "text_en": " Narrated Khuzaymah ibn Thabit:                     The Prophet (ﷺ) was asked about cleansing (after relieving oneself). He said: (One should cleanse oneself) with three stones which should be free from dung.Abu Dawud said: A similar tradition has been narrated by Abu Usamah and Ibn Numair from Hisham.",
      "chain": [
        "30352",
        "20354",
        "11065",
        "18791",
        "19817",
        "410"
      ]
    },
    {
      "hadith_no": "157",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن الحكم، وحماد، عن إبراهيم، عن أبي عبد الله الجدلي، عن خزيمة بن ثابت، عن النبي صلى الله عليه وسلم قال ‏\"‏ المسح على الخفين للمسافر ثلاثة أيام وللمقيم يوم وليلة ‏\"‏ ‏.‏ قال أبو داود رواه منصور بن المعتمر عن إبراهيم التيمي بإسناده قال فيه ولو استزدناه لزادنا ‏.‏",
      "text_en": " Narrated Khuzaymah ibn Thabit:                     The Prophet (ﷺ) said: The time limit for wiping over the socks for a traveller is three days (and three nights) and for a resident it is one day and one night.Abu Dawud said: Another version adds: Had we requested him to extend (the period of wiping), he would have extended.",
      "chain": [
        "30329",
        "20020",
        "11069",
        "20022",
        "11051",
        "19307",
        "410"
      ]
    },
    {
      "hadith_no": "95",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا قتيبة، حدثنا أبو عوانة، عن سعيد بن مسروق، عن إبراهيم التيمي، عن عمرو بن ميمون، عن أبي عبد الله الجدلي، عن خزيمة بن ثابت، عن النبي صلى الله عليه وسلم أنه سئل عن المسح على الخفين فقال ‏\"‏ للمسافر ثلاثة وللمقيم يوم ‏\"‏ ‏.‏ وذكر عن يحيى بن معين أنه صحح حديث خزيمة بن ثابت في المسح ‏.‏ وأبو عبد الله الجدلي اسمه عبد بن عبد ويقال عبد الرحمن بن عبد ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وفي الباب عن علي وأبي بكرة وأبي هريرة وصفوان بن عسال وعوف بن مالك وابن عمر وجرير ‏.‏",
      "text_en": " Khuzaimah bin Thabit narrated:                     \"The Prophet was asked about wiping over the Khuff.  So he said: \"Three (days) for the traveler, and one day for the resident.\"",
      "chain": [
        "30367",
        "20469",
        "20016",
        "11322",
        "11382",
        "19307",
        "410"
      ]
    },
    {
      "hadith_no": "336",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن الصباح، أنبأنا سفيان بن عيينة، ح وحدثنا علي بن محمد، حدثنا وكيع، جميعا عن هشام بن عروة، عن أبي خزيمة، عن عمارة بن خزيمة، عن خزيمة بن ثابت، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ في الاستنجاء ثلاثة أحجار ليس فيها رجيع ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Khuzaimah bin Thabit said:                     \"The Messenger of Allah said: 'For cleaning yourself you need three stones, no one of them being dung.'\"",
      "chain": [
        "30269",
        "20005",
        "38409",
        "20032",
        "11065",
        "19817",
        "410"
      ]
    },
    {
      "hadith_no": "596",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، حدثنا سفيان، عن أبيه، عن إبراهيم التيمي، عن عمرو بن ميمون، عن خزيمة بن ثابت، قال جعل رسول الله  صلى الله عليه وسلم  للمسافر ثلاثا ولو مضى السائل على مسألته لجعلها خمسا ‏.‏",
      "text_en": " It was narrated that Khuzaimah bin Thabit said:                     \"The Messenger of Allah set a time limit for the traveler of three days, and if the questioner had persisted in asking, he would have made it five (days).\"",
      "chain": [
        "38409",
        "20032",
        "20012",
        "20016",
        "11322",
        "11382",
        "410"
      ]
    },
    {
      "hadith_no": "597",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن سلمة بن كهيل، قال سمعت إبراهيم التيمي، يحدث عن الحارث بن سويد، عن عمرو بن ميمون، عن خزيمة بن ثابت، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ ثلاثة أيام - أحسبه قال - ولياليهن للمسافر في المسح على الخفين ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Khuzaimah bin Thabit that:                     The Prophet said: \"Three days.\" I think he said, \"And three nights during which the traveler may wipe over his leather socks.\"",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11350",
        "11322",
        "11330",
        "11382",
        "410"
      ]
    },
    {
      "hadith_no": "1999",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا أحمد بن عبدة، أنبأنا عبد الواحد بن زياد، عن حجاج بن أرطاة، عن عمرو بن شعيب، عن عبد الله بن هرمي، عن خزيمة بن ثابت، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن الله لا يستحيي من الحق ‏\"‏ ‏.‏ ثلاث مرات لا تأتوا النساء في أدبارهن ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Khuzaimah bin Thabit:                     that the Messenger of Allah said: “Allah is not too shy to tell the truth,” three times. ” Do not have intercourse with women in their buttocks.”",
      "chain": [
        "30423",
        "20256",
        "20580",
        "19934",
        "410"
      ]
    }
  ],
  "total_hadiths": 8
}