{
  "id": "4109",
  "name": "Harithh bin Wahb al-Khza'y ( حارثة بن وهب الخزاعي ( رضي الله عنه",
  "full_name": "Harithh bin Wahb al-Khza'y ( حارثة بن وهب الخزاعي ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Hijaz"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "k",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Hijaz",
      "Kufa"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ ع  -  صحابي ]"
    ],
    "tags": []
  },
  "parents": [
    {
      "id": "186",
      "name": "Umm Kulthum bint 'Amr ( أم كلثوم بنت عمرو بن جرول الخزاعية ( رضي الله عنه",
      "grade": "Comp.(RA)"
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "3204",
      "name": "Jundub al-Azdi ( جندب الأزدي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "54",
      "name": "Hafsa bint Umar ( حفصة بنت عمر بن الخطاب أم المؤمنين ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11396",
      "name": "Ma'bad bin Khalid al-Jadli معبد بن خالد الجدلي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11049",
      "name": "Abu Ishaq al-Sabay'ai' أبو إسحاق السبيعي عمرو بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11394",
      "name": "al-Musayb bin Rafa'i al-Asadi المسيب بن رافع الأسدي الكاهلي أبو العلاء",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-1083",
      "hadith_no": "1083",
      "source": "Sahih Bukhari",
      "chapter": "Shortening the Prayers (At-Taqseer) - كتاب التقصير",
      "chapter_no": "18",
      "text_ar": "حدثنا أبو الوليد، قال حدثنا شعبة، أنبأنا أبو إسحاق، قال سمعت حارثة بن وهب، قال صلى بنا النبي صلى الله عليه وسلم آمن ما كان بمنى ركعتين‏.‏",
      "text_en": " Narrated Haritha bin Wahab:                     The Prophet I led us in the prayer at Mina during the peace period by offering two rak`at.",
      "usc_msa_ref": "189",
      "chain": [
        "20296",
        "20020",
        "11049",
        "4109"
      ]
    },
    {
      "id": "sahih-bukhari-1432",
      "hadith_no": "1432",
      "source": "Sahih Bukhari",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا آدم، حدثنا شعبة، حدثنا معبد بن خالد، قال سمعت حارثة بن وهب، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ تصدقوا فإنه يأتي عليكم زمان يمشي الرجل بصدقته، فلا يجد من يقبلها يقول الرجل لو جئت بها بالأمس لقبلتها، فأما اليوم فلا حاجة لي بها ‏\"‏‏.‏",
      "text_en": " Narrated Haritha bin Wahab:                     I heard the Prophet saying, \"O people! Give in charity as a time will come upon you when a person will wander about with his object of charity and will not find anybody to accept it, and one (who will be requested to take it) will say, \"If you had brought it yesterday, would have taken it, but today I am not in need of it.\"",
      "usc_msa_ref": "492",
      "chain": [
        "20404",
        "20020",
        "11396",
        "4109"
      ]
    },
    {
      "id": "sahih-bukhari-1445",
      "hadith_no": "1445",
      "source": "Sahih Bukhari",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا علي بن الجعد، أخبرنا شعبة، قال أخبرني معبد بن خالد، قال سمعت حارثة بن وهب الخزاعي  رضى الله عنه  يقول سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ تصدقوا، فسيأتي عليكم زمان يمشي الرجل بصدقته فيقول الرجل لو جئت بها بالأمس لقبلتها منك، فأما اليوم فلا حاجة لي فيها ‏\"‏‏.‏",
      "text_en": " Narrated Haritha bin Wahab Al-Khuza`i:                     I heard the Prophet (p.b.u.h) saying, \"(O people!) Give in charity (for Allah's cause) because a time will come when a person will carry his object of charity from place to place (and he will not find any person to take it) and any person whom he shall request to take it, I will reply, 'If you had brought it yesterday I would have taken it, but today I am not in need of it.\"",
      "usc_msa_ref": "505",
      "chain": [
        "20386",
        "20020",
        "11396",
        "4109"
      ]
    },
    {
      "id": "sahih-bukhari-1682",
      "hadith_no": "1682",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا آدم، حدثنا شعبة، عن أبي إسحاق الهمداني، عن حارثة بن وهب الخزاعي  رضى الله عنه  قال صلى بنا النبي صلى الله عليه وسلم ونحن أكثر ما كنا قط وآمنه بمنى ركعتين‏.‏",
      "text_en": " Narrated Haritha bin Wahab Al-Khuza`i:                     The Prophet led us in a two-rak`at prayer at Mina although our number was more than ever and we were in better security than ever.",
      "usc_msa_ref": "718",
      "chain": [
        "20404",
        "20020",
        "11049",
        "4109"
      ]
    },
    {
      "id": "sahih-bukhari-4967",
      "hadith_no": "4967",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا أبو نعيم، حدثنا سفيان، عن معبد بن خالد، قال سمعت حارثة بن وهب الخزاعي، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ ألا أخبركم بأهل الجنة كل ضعيف متضعف لو أقسم على الله لأبره، ألا أخبركم بأهل النار كل عتل جواظ مستكبر ‏\"‏‏.‏",
      "text_en": " Narrated Haritha bin Wahb Al-Khuza`i:                     I heard the Prophet saying. \"May I tell you of the people of Paradise? Every weak and poor obscure person whom the people look down upon but his oath is fulfilled by Allah when he takes an oath to do something. And may I inform you of the people of the Hell-Fire? They are all those violent, arrogant and stubborn people.\"",
      "usc_msa_ref": "440",
      "chain": [
        "20348",
        "20012",
        "11396",
        "4109"
      ]
    },
    {
      "id": "sahih-bukhari-6140",
      "hadith_no": "6140",
      "source": "Sahih Bukhari",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، حدثنا معبد بن خالد القيسي، عن حارثة بن وهب الخزاعي، عن النبي صلى الله عليه وسلم قال ‏\"‏ ألا أخبركم بأهل الجنة، كل ضعيف متضاعف، لو أقسم على الله لأبره، ألا أخبركم بأهل النار كل عتل جواظ مستكبر ‏\"‏‏.‏",
      "text_en": "      Narrated Haritha bin Wahb:                          Al-Khuzai: The Prophet said, \"Shall I inform you about the people of      Paradise? They comprise every obscure unimportant humble person, and      if he takes Allah's Oath that he will do that thing, Allah will      fulfill his oath (by doing that). Shall I inform you about the people      of the Fire? They comprise every cruel, violent, proud and conceited      person.\"",
      "usc_msa_ref": "",
      "chain": [
        "28531",
        "20012",
        "11396",
        "4109"
      ]
    },
    {
      "id": "sahih-bukhari-6671",
      "hadith_no": "6671",
      "source": "Sahih Bukhari",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا حرمي بن عمارة، حدثنا شعبة، عن معبد بن خالد، أنه سمع حارثة بن وهب، يقول سمعت النبي صلى الله عليه وسلم وذكر الحوض فقال ‏\"‏ كما بين المدينة وصنعاء ‏\"‏‏.‏",
      "text_en": " Narrated Haritha bin Wahb:                     I heard the Prophet mentioning the Lake-Fount (Al-Kauthar), saying, \"(The width of the Lake-Fount) is equal to the distance between Medina and Sana' (capital of Yemen).\" Haritha said that he heard the Prophet saying that his Lake-Fount would be as large as the distance between Sana' and Medina. Al- Mustaurid said to Haritha, \"Didn't you hear him talking about the vessels?\" He said, \"No.\" Al- Mustaurid said, \"The vessels are seen in it as (numberless as) the stars.\"",
      "usc_msa_ref": "",
      "chain": [
        "30026",
        "20221",
        "20020",
        "11396",
        "4109"
      ]
    },
    {
      "id": "sahih-bukhari-6672",
      "hadith_no": "6672",
      "source": "Sahih Bukhari",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "وزاد ابن أبي عدي عن شعبة، عن معبد بن خالد، عن حارثة، سمع النبي صلى الله عليه وسلم قوله حوضه ما بين صنعاء والمدينة‏.‏ فقال له المستورد ألم تسمعه قال الأواني‏.‏ قال لا‏.‏ قال المستورد ترى فيه الآنية مثل الكواكب‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "20020",
        "11396",
        "4109"
      ]
    },
    {
      "id": "sahih-bukhari-6738",
      "hadith_no": "6738",
      "source": "Sahih Bukhari",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا محمد بن المثنى، حدثني غندر، حدثنا شعبة، عن معبد بن خالد، سمعت حارثة بن وهب، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ ألا أدلكم على أهل الجنة، كل ضعيف متضعف، لو أقسم على الله لأبره، وأهل النار كل جواظ عتل مستكبر ‏\"‏‏.‏",
      "text_en": " Narrated Haritha bin Wahb:                     I heard the Prophet saying, \"Shall I tell you of the people of Paradise? They comprise every poor humble person, and if he swears by Allah to do something, Allah will fulfill it; while the people of the fire comprise every violent, cruel arrogant person.\"",
      "usc_msa_ref": "651",
      "chain": [
        "30170",
        "20278",
        "20020",
        "11396",
        "4109"
      ]
    },
    {
      "id": "sahih-bukhari-7206",
      "hadith_no": "7206",
      "source": "Sahih Bukhari",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن شعبة، حدثنا معبد، سمعت حارثة بن وهب، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ تصدقوا، فسيأتي على الناس زمان يمشي الرجل بصدقته، فلا يجد من يقبلها ‏\"‏‏.‏ قال مسدد حارثة أخو عبيد الله بن عمر لأمه‏.‏",
      "text_en": " Narrated Haritha bin Wahb:                     I heard Allah's Apostle saying, \"Give in charity because there will come a time on the people when a person will go out with his alms from place to place but will not find anybody to accept it.\"",
      "usc_msa_ref": "236",
      "chain": [
        "30175",
        "20031",
        "20020",
        "4109"
      ]
    },
    {
      "id": "sahih-muslim-1630",
      "hadith_no": "1630",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا يحيى بن يحيى، وقتيبة، قال يحيى أخبرنا وقال، قتيبة حدثنا أبو الأحوص، عن أبي إسحاق، عن حارثة بن وهب، قال صليت مع رسول الله صلى الله عليه وسلم بمنى - آمن ما كان الناس وأكثره - ركعتين ‏.‏",
      "text_en": " Haritha b. Wahb reported:                      I prayed with the Messenger of Allah (may peace be upon him) two rak'abs and most of them offered two rak'ahs only in Mina, while the people felt secure.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "30367",
        "20031",
        "30367",
        "20327",
        "11049",
        "4109"
      ]
    },
    {
      "id": "sahih-muslim-1631",
      "hadith_no": "1631",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا أحمد بن عبد الله بن يونس، حدثنا زهير، حدثنا أبو إسحاق، حدثني حارثة بن وهب الخزاعي، قال صليت خلف رسول الله صلى الله عليه وسلم بمنى والناس أكثر ما كانوا فصلى ركعتين في حجة الوداع ‏.‏ قال مسلم حارثة بن وهب الخزاعي هو أخو عبيد الله بن عمر بن الخطاب لأمه ‏.‏",
      "text_en": " Wahb al-Khuza'i reported:                      I prayed behind the Messenger of Allah (way peace be upon him) at Mina, and there was the greatest number of people, and they prayed two rak'ahs on the occasion of the Farwell Pilgrmage. (Muslim said: Haritha b. Wahb al-Khuza'i is the brother of 'Ubaidullah b. 'Umar son of Khattab from the side of mother.)",
      "usc_msa_ref": "",
      "chain": [
        "30184",
        "20321",
        "11049",
        "4109"
      ]
    },
    {
      "id": "sahih-muslim-2384",
      "hadith_no": "2384",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وابن، نمير قالا حدثنا وكيع، حدثنا شعبة، ح وحدثنا محمد بن المثنى، - واللفظ له - حدثنا محمد بن جعفر، حدثنا شعبة، عن معبد بن خالد، قال سمعت حارثة بن وهب، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ تصدقوا فيوشك الرجل يمشي بصدقته فيقول الذي أعطيها لو جئتنا بها بالأمس قبلتها فأما الآن فلا حاجة لي بها ‏.‏ فلا يجد من يقبلها ‏\"‏ ‏.‏",
      "text_en": " Haritha b. Wahb reported Allah's Messenger (may peace be upon him) as saying:                      Give Sadaqa for a time is about to come when a person would walk with alms and the one whom it is to be given would say: Had you brought it yesterday, I would have accepted it. For the present I do not need it. (And the giver of Sadaqa) I would not find anyone to accept it.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30212",
        "20032",
        "20020",
        "30170",
        "20173",
        "20020",
        "11396",
        "4109"
      ]
    },
    {
      "id": "sahih-muslim-6122",
      "hadith_no": "6122",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثني محمد بن عبد الله بن بزيع، حدثنا ابن أبي عدي، عن شعبة، عن معبد، بن خالد عن حارثة، أنه سمع النبي صلى الله عليه وسلم قال ‏\"‏ حوضه ما بين صنعاء والمدينة ‏\"‏ ‏.‏ فقال له المستورد ألم تسمعه قال ‏\"‏ الأواني ‏\"‏ ‏.‏ قال لا ‏.‏ فقال المستورد ‏\"‏ ترى فيه الآنية مثل الكواكب ‏\"‏ ‏.‏",
      "text_en": " Haritha reported that he heard Allah's Messenger (may peace be upon him) as saying:                      His Cistern would be as extensive as the distance between San'a' and Medina. Mustaurid (one of the narrators) said: Did you not hear anything about the utensils? Thereupon he said. No. Mustaurid said: You would find that the utensils would be like stars.",
      "usc_msa_ref": "",
      "chain": [
        "30448",
        "20276",
        "20020",
        "11396",
        "4109"
      ]
    },
    {
      "id": "sahih-muslim-6123",
      "hadith_no": "6123",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثني إبراهيم بن محمد بن عرعرة، حدثنا حرمي بن عمارة، حدثنا شعبة، عن معبد بن خالد، أنه سمع حارثة بن وهب الخزاعي، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏.‏ وذكر الحوض بمثله ولم يذكر قول المستورد وقوله ‏.‏",
      "text_en": " Haritha b. Wahb al-Khuza'i reported Allah's Messeiiger's (may peace be upon him) words concerning the Cistern like it, but he made no mention of the words of Mustaurid.",
      "usc_msa_ref": "",
      "chain": [
        "30426",
        "20221",
        "20020",
        "11396",
        "4109"
      ]
    },
    {
      "id": "sahih-muslim-7366",
      "hadith_no": "7366",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "حدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، حدثني معبد بن خالد، أنه سمع حارثة بن وهب، أنه سمع النبي صلى الله عليه وسلم قال ‏\"‏ ألا أخبركم بأهل الجنة ‏\"‏ ‏.‏ قالوا بلى ‏.‏ قال صلى الله عليه وسلم ‏\"‏ كل ضعيف متضعف لو أقسم على الله لأبره ‏\"‏ ‏.‏ ثم قال ‏\"‏ ألا أخبركم بأهل النار ‏\"‏ ‏.‏ قالوا بلى ‏.‏ قال ‏\"‏ كل عتل جواظ مستكبر ‏\"‏ ‏.‏",
      "text_en": " Haritha b. Wahb reported that he heard Allah's Apostle (may peace be upon him) as saying:                      May I not inform you about the inmates of Paradise? They said: Do this, of course. Thereupon Allah's Apostle (may peace be upon him) said: Every humble person who is considered to be humble if he were to adjure In the name of Allah, He would fulfil it. He then said: May I not inform you about the denizens of Hell-Fire? They said: Yes. And he said: Every haughty, fat and proud (person).",
      "usc_msa_ref": "",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11396",
        "4109"
      ]
    },
    {
      "id": "sahih-muslim-7368",
      "hadith_no": "7368",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "وحدثنا محمد بن عبد الله بن نمير، حدثنا وكيع، حدثنا سفيان، عن معبد بن خالد، قال سمعت حارثة بن وهب الخزاعي، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ ألا أخبركم بأهل الجنة كل ضعيف متضعف لو أقسم على الله لأبره ألا أخبركم بأهل النار كل جواظ زنيم متكبر ‏\"‏ ‏.‏",
      "text_en": " Haritha b. Wahb al-KhuzaIi reported Allah's Messenger (may peace be upon him) as saying:                      May I not inform you about the inmates of Paradise? (And then informing about them) said: Every meek person who is considered to be humble and if they were to adjure in the name of Allah, Allah would certainly fulfil it. May I not inform you about the inmates of Hell-Fire? They are all proud, mean and haughty.",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20032",
        "20012",
        "11396",
        "4109"
      ]
    },
    {
      "id": "sunan-abi-daud-32",
      "hadith_no": "32",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن آدم بن سليمان المصيصي، حدثنا ابن أبي زائدة، قال حدثني أبو أيوب، - يعني الإفريقي - عن عاصم، عن المسيب بن رافع، ومعبد، عن حارثة بن وهب الخزاعي، قال حدثتني حفصة، زوج النبي صلى الله عليه وسلم أن النبي صلى الله عليه وسلم كان يجعل يمينه لطعامه وشرابه وثيابه ويجعل شماله لما سوى ذلك ‏.‏",
      "text_en": " Narrated Hafsah, Ummul Mu'minin:                     The Prophet (ﷺ) used his right hand for taking his food and drink and used his left hand for other purposes.",
      "usc_msa_ref": "",
      "chain": [
        "38474",
        "20366",
        "15293",
        "11080",
        "11394",
        "11396",
        "4109"
      ]
    },
    {
      "id": "sunan-abi-daud-1965",
      "hadith_no": "1965",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا النفيلي، حدثنا زهير، حدثنا أبو إسحاق، حدثني حارثة بن وهب الخزاعي، - وكانت أمه تحت عمر فولدت له عبيد الله بن عمر - قال صليت خلف رسول الله صلى الله عليه وسلم بمنى والناس أكثر ما كانوا فصلى بنا ركعتين في حجة الوداع ‏.‏ قال أبو داود حارثة من خزاعة ودارهم بمكة ‏.‏",
      "text_en": " Narrated Harithah ibn Wahb al-Khuza'i,:                     I prayed along with the Messenger of Allah (ﷺ) at Mina and the people gathered there in large numbers. He led us two rak'ahs in prayer in the Farewell Pilgrimage.Abu Dawud said: Harithah belonged to the tribe of Khuza'ah, and they had their houses in Mecca.",
      "usc_msa_ref": "",
      "chain": [
        "30352",
        "20321",
        "11049",
        "4109"
      ]
    },
    {
      "id": "sunan-abi-daud-4801",
      "hadith_no": "4801",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أبو بكر، وعثمان، ابنا أبي شيبة قالا حدثنا وكيع، عن سفيان، عن معبد بن خالد، عن حارثة بن وهب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يدخل الجنة الجواظ ولا الجعظري ‏\"‏ ‏.‏ قال والجواظ الغليظ الفظ ‏.‏",
      "text_en": " HARITHAH B. WAHAB REPORTED THE APOSTLE OF ALLAH (MAY PEACE BE UPON HIM) AS SAYING :                      NEITHER THE JAWWAZ NOR THE JAZARI WILL ENTER PARADISE. HE SAID THAT THE JAWWAZ IS THE ONE WHO IS COARSE AND UNCIVIL.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30203",
        "20032",
        "20012",
        "11396",
        "4109"
      ]
    },
    {
      "id": "jami-al-tirmidhi-882",
      "hadith_no": "882",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا قتيبة، حدثنا أبو الأحوص، عن أبي إسحاق، عن حارثة بن وهب، قال صليت مع النبي صلى الله عليه وسلم بمنى آمن ما كان الناس وأكثره ركعتين ‏.‏ قال وفي الباب عن ابن مسعود وابن عمر وأنس ‏.‏ قال أبو عيسى حديث حارثة بن وهب حديث حسن صحيح ‏.‏ وروي عن ابن مسعود أنه قال صليت مع النبي صلى الله عليه وسلم بمنى ركعتين ومع أبي بكر ومع عمر ومع عثمان ركعتين صدرا من إمارته ‏.‏ وقد اختلف أهل العلم في تقصير الصلاة بمنى لأهل مكة فقال بعض أهل العلم ليس لأهل مكة أن يقصروا الصلاة بمنى إلا من كان بمنى مسافرا ‏.‏ وهو قول ابن جريج وسفيان الثوري ويحيى بن سعيد القطان والشافعي وأحمد وإسحاق ‏.‏ وقال بعضهم لا بأس لأهل مكة أن يقصروا الصلاة بمنى ‏.‏ وهو قول الأوزاعي ومالك وسفيان بن عيينة وعبد الرحمن بن مهدي ‏.‏",
      "text_en": " Harithah bin Wahb said:                     \"I prayed two Rak'ah with the Prophet at Mina, and the people were as secure as they ever were, and even more so.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20327",
        "11049",
        "4109"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2809",
      "hadith_no": "2809",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on the Description of Hellfire - كتاب صفة جهنم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "39",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو نعيم، حدثنا سفيان، عن معبد بن خالد، قال سمعت حارثة بن وهب الخزاعي، يقول سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ ألا أخبركم بأهل الجنة كل ضعيف متضعف لو أقسم على الله لأبره ألا أخبركم بأهل النار كل عتل جواظ متكبر ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Harithah bin Wahb Al-Khuzai narrated that the Messenger Of Allah (s.a.w) said:                     \"Should I not inform you about the people of Paradise: They are every humble and weak person, who if he  were to make an Oath by Allah, He  would fulfill it. Should I not inform  you about  the people of the Fire: They are every prideful swaggering ill-speaking person.\"",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20348",
        "20012",
        "11396",
        "4109"
      ]
    },
    {
      "id": "sunan-an-nasai-1445",
      "hadith_no": "1445",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Shortening the Prayer When Traveling - كتاب تقصير الصلاة فى السفر",
      "chapter_no": "15",
      "text_ar": "أخبرنا قتيبة، قال حدثنا أبو الأحوص، عن أبي إسحاق، عن حارثة بن وهب الخزاعي، قال صليت مع النبي صلى الله عليه وسلم بمنى آمن ما كان الناس وأكثره ركعتين ‏.‏",
      "text_en": " It was narrated that Harithah bin Wahab Al-Khuza'i said:                     \"I prayed two rak'ahs with the Prophet (ﷺ) in Mina when the people were more secure and greater in number.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20327",
        "11049",
        "4109"
      ]
    },
    {
      "id": "sunan-an-nasai-1446",
      "hadith_no": "1446",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Shortening the Prayer When Traveling - كتاب تقصير الصلاة فى السفر",
      "chapter_no": "15",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا يحيى بن سعيد، قال حدثنا شعبة، قال حدثنا أبو إسحاق، ح وأنبأنا عمرو بن علي، قال حدثنا يحيى بن سعيد، قال حدثنا سفيان، قال أخبرني أبو إسحاق، عن حارثة بن وهب، قال صلى بنا رسول الله صلى الله عليه وسلم بمنى أكثر ما كان الناس وآمنه ركعتين ‏.‏",
      "text_en": " It was narrated that Harithah bin Wahab said:                     \"The Messenger of Allah (ﷺ) led us in prayer in Mina, two rak'ahs, when the people were greater in number and  more secure.\"",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20031",
        "20020",
        "11049",
        "30153",
        "20031",
        "20012",
        "11049",
        "4109"
      ]
    },
    {
      "id": "sunan-an-nasai-2555",
      "hadith_no": "2555",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا خالد، قال حدثنا شعبة، عن معبد بن خالد، عن حارثة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ تصدقوا فإنه سيأتي عليكم زمان يمشي الرجل بصدقته فيقول الذي يعطاها لو جئت بها بالأمس قبلتها فأما اليوم فلا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Harithah said:                      \"I heard the Messenger of Allah (ﷺ) say: 'Give charity, for there will come a time when a man will walk about with his charity, and the one to whom he wants to give it will say: If you had brought ityesterday I would have accepted it, but today (I have no need of it).\"",
      "usc_msa_ref": "",
      "chain": [
        "30449",
        "20423",
        "20020",
        "11396",
        "4109"
      ]
    },
    {
      "id": "sunan-ibn-majah-398",
      "hadith_no": "398",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا عمرو بن رافع، وإسماعيل بن توبة، قالا حدثنا يحيى بن زكريا بن أبي زائدة، عن حارثة، عن عمرة، عن عائشة، قالت كنت أتوضأ أنا ورسول الله،  صلى الله عليه وسلم  من إناء واحد قد أصابت منه الهرة قبل ذلك ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"The Messenger of Allah and I used to perform ablution from a single vessel, when the cat had drunk from it beforehand.\"",
      "usc_msa_ref": "",
      "chain": [
        "18792",
        "38108",
        "20366",
        "4109",
        "11455",
        "53"
      ]
    },
    {
      "id": "sunan-ibn-majah-2573",
      "hadith_no": "2573",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Pawning - كتاب الرهون",
      "chapter_no": "16",
      "text_ar": "حدثنا عبد الله بن سعيد، حدثنا عبدة بن سليمان، عن حارثة، عن عمرة، عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يمنع فضل الماء ولا يمنع نقع البئر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Aishah that the Messenger of Allah (ﷺ) said:                     “Surplus water should not be withheld, and neither should surplus water from a well.",
      "usc_msa_ref": "",
      "chain": [
        "11184",
        "20337",
        "4109",
        "11455",
        "53"
      ]
    }
  ],
  "total_hadiths": 27
}