{
  "id": "4123",
  "name": "Hamza bin 'Amr al-Aslami ( حمزة بن عمرو ( رضي الله عنه",
  "full_name": "Hamza bin 'Amr al-Aslami ( حمزة بن عمرو ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Hijaz"
    },
    "death": {
      "date_hijri": "61",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Hijaz",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Hijaz"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ خت  م  د  س  -  صحابي ]"
    ],
    "tags": [
      "al-Aslami",
      "Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "2",
      "name": "Abu Bakr As-Siddique ( أبو بكر الصديق ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3",
      "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11842",
      "name": "Hanzalah bin 'Ali bin al-Aslami حنظلة بن علي بن الأسقع",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11005",
      "name": "Sulayman ibn Yasar سليمان بن يسار مولى ميمونة بنت الحارث",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11551",
      "name": "Abu Mrawh al-Ghfary أبو مراوح الغفاري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10567",
      "name": "Abu Salama bin 'Abdur Rahman أبو سلمة بن عبد الرحمن بن عوف",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-1942",
      "hadith_no": "1942",
      "source": "Sahih Bukhari",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن هشام، قال حدثني أبي، عن عائشة، أن حمزة بن عمرو الأسلمي، قال يا رسول الله إني أسرد الصوم‏.‏",
      "text_en": " Narrated `Aisha:                     Hamza bin `Amr Al-Aslami said, \"O Allah's Apostle! I fast continuously.\"",
      "usc_msa_ref": "163",
      "chain": [
        "30175",
        "20031",
        "11065",
        "10511",
        "53",
        "4123"
      ]
    },
    {
      "id": "sahih-muslim-2685",
      "hadith_no": "2685",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثني أبو الطاهر، وهارون بن سعيد الأيلي، - قال هارون حدثنا وقال أبو الطاهر أخبرنا ابن وهب، أخبرني عمرو بن الحارث، عن أبي الأسود، عن عروة بن الزبير، عن أبي مراوح، عن حمزة بن عمرو الأسلمي، - رضى الله عنه - أنه قال يا رسول الله أجد بي قوة على الصيام في السفر فهل على جناح فقال رسول الله صلى الله عليه وسلم ‏\"‏ هي رخصة من الله فمن أخذ بها فحسن ومن أحب أن يصوم فلا جناح عليه ‏\"‏ ‏.‏ قال هارون في حديثه ‏\"‏ هي رخصة ‏\"‏ ‏.‏ ولم يذكر من الله ‏.‏",
      "text_en": " Hamza b. 'Amr al-Aslami (Allah be pleased with him) said:                      Messenger of Allah, I find strength in me for fasting on a journey; is there any sin upon me (in doing it)? Thereupon the Messenger of Allah (may peace be upon him) said: It is a concession from Allah. He who took advantage of it, it is good for him, and he who preferred to observe fast, there is no sin upon him. Harun (one of the narrators) in his narration said: 'lt is a concession, and he made no mention of\" from Allah\".",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "20029",
        "20377",
        "11105",
        "10511",
        "4123"
      ]
    },
    {
      "id": "jami-al-tirmidhi-711",
      "hadith_no": "711",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا هارون بن إسحاق الهمداني، حدثنا عبدة بن سليمان، عن هشام بن عروة، عن أبيه، عن عائشة، أن حمزة بن عمرو الأسلمي، سأل رسول الله صلى الله عليه وسلم عن الصوم في السفر وكان يسرد الصوم فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن شئت فصم وإن شئت فأفطر ‏\"‏ ‏.‏ قال وفي الباب عن أنس بن مالك وأبي سعيد وعبد الله بن مسعود وعبد الله بن عمرو وأبي الدرداء وحمزة بن عمرو الأسلمي ‏.‏ قال أبو عيسى حديث عائشة أن حمزة بن عمرو سأل النبي صلى الله عليه وسلم حديث حسن صحيح ‏.‏",
      "text_en": " Aishah narrated that :                     Hamzah bin Amr Al-Aslami asked the Messenger of Allah about fasting while traveling, and he fasted regularly. So the Messenger of Allah said: 'If you wish then fast, and if you wish then break (the fast).'\"",
      "usc_msa_ref": "",
      "chain": [
        "35158",
        "20337",
        "11065",
        "10511",
        "53",
        "4123"
      ]
    },
    {
      "id": "sunan-an-nasai-2294",
      "hadith_no": "2294",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن رافع، قال حدثنا أزهر بن القاسم، قال حدثنا هشام، عن قتادة، عن سليمان بن يسار، عن حمزة بن عمرو الأسلمي، أنه سأل رسول الله صلى الله عليه وسلم عن الصوم في السفر قال ‏\"‏ إن - ثم ذكر كلمة معناها إن - شئت صمت وإن شئت أفطرت ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Hamza bin 'Amr Al-Aslami that:                     he asked the Messenger of Allah about fasting while traveling. He said: \"If,\" then he said something to the effect that: \"If you want, then fast, and if you want, then do not fast.",
      "usc_msa_ref": "",
      "chain": [
        "30375",
        "23006",
        "20295",
        "11019",
        "11005",
        "4123"
      ]
    },
    {
      "id": "sunan-an-nasai-2295",
      "hadith_no": "2295",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا قتيبة، قال حدثنا الليث، عن بكير، عن سليمان بن يسار، أن حمزة بن عمرو، قال يا رسول الله مثله مرسل ‏.‏",
      "text_en": " It was narrated from Sulaiman bin Yasar that Hamzah bin 'Amr said:                     \"O Messenger of Allah.\" (And he narrated) something similar, in Mursal from.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "11154",
        "11005",
        "4123"
      ]
    },
    {
      "id": "sunan-an-nasai-2297",
      "hadith_no": "2297",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا أبو بكر، قال حدثنا عبد الحميد بن جعفر، عن عمران بن أبي أنس، عن سليمان بن يسار، عن حمزة بن عمرو، قال سألت رسول الله صلى الله عليه وسلم عن الصوم في السفر فقال ‏\"‏ إن شئت أن تصوم فصم وإن شئت أن تفطر فأفطر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Hamzah bin 'Amr said:                     \"I asked the Messenger of Allah about fasting while traveling. He said: 'If you wish to fast then fast, and if you wish not to fast then do not fast.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20436",
        "11875",
        "10605",
        "11005",
        "4123"
      ]
    },
    {
      "id": "sunan-an-nasai-2298",
      "hadith_no": "2298",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا الربيع بن سليمان، قال حدثنا ابن وهب، قال أخبرني عمرو بن الحارث، والليث، وذكر، آخر عن بكير، عن سليمان بن يسار، عن حمزة بن عمرو الأسلمي، قال يا رسول الله إني أجد قوة على الصيام في السفر قال ‏\"‏ إن شئت فصم وإن شئت فأفطر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Hamzah bin 'Amr Al-Aslami said:                     \"O Messenger of Allah, I feel able to fast while traveling.\" He said: \"If you wish then fast and if you wish then do not fast.\"",
      "usc_msa_ref": "",
      "chain": [
        "30583",
        "20029",
        "20377",
        "20023",
        "11154",
        "11005",
        "4123"
      ]
    },
    {
      "id": "sunan-an-nasai-2299",
      "hadith_no": "2299",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرني هارون بن عبد الله، قال حدثنا محمد بن بكر، قال أنبأنا عبد الحميد بن جعفر، قال أخبرني عمران بن أبي أنس، عن أبي سلمة بن عبد الرحمن، عن حمزة بن عمرو، أنه سأل رسول الله صلى الله عليه وسلم عن الصوم في السفر قال ‏\"‏ إن شئت أن تصوم فصم وإن شئت أن تفطر فأفطر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Hamzah bin 'Amr that:                     he asked the Messenger of Allah about fasting while traveling. He said: \"If you wish to fast then fast, and if you wish not to fast then do not fast.\"",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20277",
        "11875",
        "10605",
        "10567",
        "4123"
      ]
    },
    {
      "id": "sunan-an-nasai-2300",
      "hadith_no": "2300",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا عمران بن بكار، قال حدثنا أحمد بن خالد، قال حدثنا محمد، عن عمران بن أبي أنس، عن سليمان بن يسار، وحنظلة بن علي، قال حدثاني جميعا، عن حمزة بن عمرو، قال كنت أسرد الصيام على عهد رسول الله صلى الله عليه وسلم فقلت يا رسول الله إني أسرد الصيام في السفر فقال ‏\"‏ إن شئت فصم وإن شئت فأفطر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Hamzah bin 'Amr said:                     \"I used to fast continually at the time of the Messenger of Allah. I said: 'O continually while traveling.' He said: 'If you wish then fast, and if you wish then do not fast.\"'",
      "usc_msa_ref": "",
      "chain": [
        "38437",
        "20278",
        "10605",
        "11005",
        "4123"
      ]
    },
    {
      "id": "sunan-an-nasai-2302",
      "hadith_no": "2302",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا عبيد الله بن سعد، قال حدثنا عمي، قال حدثنا أبي، عن ابن إسحاق، قال حدثني عمران بن أبي أنس، أن سليمان بن يسار، حدثه أن أبا مراوح حدثه أن حمزة بن عمرو حدثه أنه، سأل رسول الله صلى الله عليه وسلم وكان رجلا يصوم في السفر فقال ‏\"‏ إن شئت فصم وإن شئت فأفطر ‏\"‏ ‏.‏",
      "text_en": " Hamzah bin 'Amr narrated that he asked the Messenger of Allah, and he wsa a man who used to fast while traveling. He said:                     \"If you wish then fast, and if you wish then fast, and if you wish then do not fast.\"",
      "usc_msa_ref": "",
      "chain": [
        "30258",
        "20385",
        "11107",
        "10605",
        "11005",
        "11551",
        "4123"
      ]
    },
    {
      "id": "sunan-an-nasai-2303",
      "hadith_no": "2303",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا الربيع بن سليمان، قال أنبأنا ابن وهب، قال أنبأنا عمرو، وذكر، آخر عن أبي الأسود، عن عروة، عن أبي مراوح، عن حمزة بن عمرو، أنه قال لرسول الله صلى الله عليه وسلم أجد في قوة على الصيام في السفر فهل على جناح قال ‏\"‏ هي رخصة من الله عز وجل فمن أخذ بها فحسن ومن أحب أن يصوم فلا جناح عليه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Hamzah bin 'Amr that he said to the Messenger of Allah:                     \"I feel able to fast while traveling; is there any sin on me?\" He said: \"It is a concession from Allah, the mighty and sublime, so whoever accepts it has done well, and whoever wants to fast, there is no sin on him.\"",
      "usc_msa_ref": "",
      "chain": [
        "30583",
        "20029",
        "20377",
        "11105",
        "10511",
        "4123"
      ]
    },
    {
      "id": "sunan-an-nasai-2304",
      "hadith_no": "2304",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن إسماعيل بن إبراهيم، عن محمد بن بشر، عن هشام بن عروة، عن أبيه، عن حمزة بن عمرو الأسلمي، أنه سأل رسول الله صلى الله عليه وسلم أصوم في السفر قال ‏\"‏ إن شئت فصم وإن شئت فأفطر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Hamzah bin 'Amr Al-Aslami that he asked the Messenger of Allah:                     \"Should I fast while traveling?\" He said: \"If you wish then fast, and if you wish then do not fast.\"",
      "usc_msa_ref": "",
      "chain": [
        "34188",
        "20352",
        "11065",
        "10511",
        "4123"
      ]
    },
    {
      "id": "sunan-an-nasai-2305",
      "hadith_no": "2305",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا علي بن الحسن اللاني، بالكوفة قال حدثنا عبد الرحيم الرازي، عن هشام، عن عروة، عن عائشة، عن حمزة بن عمرو، أنه قال يا رسول الله إني رجل أصوم أفأصوم في السفر قال ‏\"‏ إن شئت فصم وإن شئت فأفطر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Aishah that Hamzah bin 'Amr said:                     O Messenger of Allah, I am a man who fasts, so should I fast while traveling? He said: \"If you wish then fast, and if you wish then do not fast.\"",
      "usc_msa_ref": "",
      "chain": [
        "20295",
        "10511",
        "53",
        "4123"
      ]
    },
    {
      "id": "sunan-an-nasai-2384",
      "hadith_no": "2384",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا يحيى بن حبيب بن عربي، قال حدثنا حماد، عن هشام، عن أبيه، عن عائشة، أن حمزة بن عمرو الأسلمي، سأل رسول الله صلى الله عليه وسلم فقال يا رسول الله إني رجل أسرد الصوم أفأصوم في السفر قال ‏\"‏ صم إن شئت أو أفطر إن شئت ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Aishah that Hamzah bin 'Amr Al-Aslami asked the Messenger of Allah:                     \"O Messenger of Allah, I am a man who fasts continually: shoud I fast when traveling?\" He said: \"Fast if you wish and break you fast if you wish.\" 'Ata said: \"someone who heard him told me that Ibn 'Umar (said) that the Prophet said: 'Whoever fasts every day of his life, and then he has not fasted.\"",
      "usc_msa_ref": "",
      "chain": [
        "30459",
        "20022",
        "11065",
        "10511",
        "53",
        "4123"
      ]
    }
  ],
  "total_hadiths": 14
}