{
  "id": "414",
  "name": "Fatima bint Abi Hubaysh ( فاطمة بنت أبي حبيش ( رضي الله عنها",
  "full_name": "Fatima bint Abi Hubaysh ( فاطمة بنت أبي حبيش ( رضي الله عنها",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Makkah"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Medina",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah",
      "Medina"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ د  س  -  صحابي ]"
    ],
    "tags": [
      "Female",
      "Quraish",
      "B.Asad"
    ]
  },
  "parents": [],
  "spouses": [
    {
      "id": "26",
      "name": "'Abdullah bin Jahsh ( عبد الله بن جحش بن رياب ( رضي الله عنه",
      "grade": "Comp.(RA)"
    }
  ],
  "siblings": [
    {
      "id": "2315",
      "name": "al-Sa'ib bin Abi Hubaysh ( السائب بن أبي حبيش بن المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "children": [
    {
      "id": "413",
      "name": "Muhammad bin 'Abdullah bin Jahsh ( محمد بن عبد الله بن جحش ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "students": [
    {
      "id": "10511",
      "name": "'Urwa ibn al-Zubayr عروة بن الزبير",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "280",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عيسى بن حماد، أخبرنا الليث، عن يزيد بن أبي حبيب، عن بكير بن عبد الله، عن المنذر بن المغيرة، عن عروة بن الزبير، أن فاطمة بنت أبي حبيش، حدثته أنها، سألت رسول الله صلى الله عليه وسلم فشكت إليه الدم فقال لها رسول الله صلى الله عليه وسلم ‏\"‏ إنما ذلك عرق فانظري إذا أتى قرؤك فلا تصلي فإذا مر قرؤك فتطهري ثم صلي ما بين القرء إلى القرء ‏\"‏ ‏.‏",
      "text_en": " Narrated Fatimah daughter of AbuHubaysh:                     Urwah ibn az-Zubayr said that Fatimah daughter of AbuHubaysh narrated to him that she asked the Messenger of Allah (ﷺ) and complained to him about the flowing of (her) blood. The Messenger of Allah (ﷺ) said to her: That is only (due to) a vein: look, when your menstruation comes, do not pray; and when your menstruation ends, wash yourself and then offer prayer during the period from one menstruation to another.",
      "chain": [
        "30412",
        "20023",
        "11411",
        "11154",
        "12518",
        "10511",
        "414"
      ]
    },
    {
      "hadith_no": "0",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا يوسف بن موسى، حدثنا جرير، عن سهيل، - يعني ابن أبي صالح - عن الزهري، عن عروة بن الزبير، حدثتني فاطمة بنت أبي حبيش، أنها أمرت أسماء - أو أسماء حدثتني أنها، أمرتها فاطمة بنت أبي حبيش - أن تسأل، رسول الله صلى الله عليه وسلم فأمرها أن تقعد الأيام التي كانت تقعد ثم تغتسل ‏.1قال أبو داود ورواه قتادة عن عروة بن الزبير عن زينب بنت أم سلمة أن أم حبيبة بنت جحش استحيضت فأمرها النبي صلى الله عليه وسلم أن تدع الصلاة أيام أقرائها ثم تغتسل وتصلي ‏.‏قال أبو داود لم يسمع قتادة من عروة شيئا ‏.2وزاد ابن عيينة في حديث الزهري عن عمرة عن عائشة أن أم حبيبة كانت تستحاض فسألت النبي صلى الله عليه وسلم فأمرها أن تدع الصلاة أيام أقرائها ‏.‏قال أبو داود وهذا وهم من ابن عيينة ليس هذا في حديث الحفاظ عن الزهري إلا ما ذكر سهيل بن أبي صالح وقد روى الحميدي هذا الحديث عن ابن عيينة لم يذكر فيه ‏\"‏ تدع الصلاة أيام أقرائها ‏\"‏ ‏.1وروت قمير بنت عمرو زوج مسروق عن عائشة المستحاضة تترك الصلاة أيام أقرائها ثم تغتسل ‏.3وقال عبد الرحمن بن القاسم عن أبيه إن النبي صلى الله عليه وسلم أمرها أن تترك الصلاة قدر أقرائها ‏.2وروى أبو بشر جعفر بن أبي وحشية عن عكرمة عن النبي صلى الله عليه وسلم أن أم حبيبة بنت جحش استحيضت فذكر مثله وروى شريك عن أبي اليقظان عن عدي بن ثابت عن أبيه عن جده عن النبي صلى الله عليه وسلم ‏\"‏ المستحاضة تدع الصلاة أيام أقرائها ثم تغتسل وتصلي ‏\"‏ ‏.1وروى العلاء بن المسيب عن الحكم عن أبي جعفر أن سودة استحيضت فأمرها النبي صلى الله عليه وسلم إذا مضت أيامها اغتسلت وصلت ‏.1وروى سعيد بن جبير عن علي وابن عباس ‏\"‏ المستحاضة تجلس أيام قرئها ‏\"‏ ‏.1وكذلك رواه عمار مولى بني هاشم وطلق بن حبيب عن ابن عباس 1وكذلك رواه معقل الخثعمي عن علي رضي الله عنه 4وكذلك روى الشعبي عن قمير امرأة مسروق عن عائشة رضى الله عنها ‏.قال أبو داود وهو قول الحسن وسعيد بن المسيب وعطاء ومكحول وإبراهيم وسالم والقاسم إن المستحاضة تدع الصلاة أيام أقرائها ‏.‏ قال أبو داود لم يسمع قتادة من عروة شيئا ‏.‏ 1",
      "text_en": " 'Urwah b. al-Zubair said:                      Fatimah daughter of Abu Hubaish narrated to me that she asked Asma' (daughter of Abu Bakr), or Asma' narrated to me that Fatimah daughter of Abu Hubaish asked her to question the Messenger of Allah (ﷺ). He advised her to refrain (from prayer) equal to the period she refrained previously. She then should wash herself.1Abu Dawud said: Qatadah narrated it from 'Urwah b. al-Zubair, from Zainab daughter of Umm Salamah, that Umm Habibah daughter of Jahsh had a prolonged flow of blood. The Prophet (ﷺ) commanded her to abandon prayer for the period of her menses. She then should take a bath, and offer prayer.Abu Dawud said: Qatadah did not hear anything from 'Urwah. 2And Ibn 'Uyainah added in the tradition narrated by al-Zuhri from 'Umrah on the authority of 'Aishah. Umm Habibah had a prolonged flow of blood. She asked the Prophet (ﷺ). He commanded her to abandon prayer during her menstrual period.Abu Dawud said: This is a misunderstanding on the part of Ibn 'Uyainah. This is not found in the tradition reported by the transmitter from al-Zuhri except that mentioned by Suhail b. Abu Salih. Al-Humaidi also narrated this tradition from Ibn 'Uyainah, but he did not mention the words \"she should abandon prayer during her menstrual period.\"1Qumair daughter of Masruq reported on the authority of 'Aishah: The woman who has prolonged flow of blood should abandon prayer during her menstrual period.3'Abd al-Rahman b. al-Qasim reported on the authority of his father: The Prophet (ﷺ) commanded her to abandon prayers equal (to the length of time) that she has her (usual) menses.2Abu Bishr Ja'far b. Abi Wahshiyyah reported on the authority of 'Ikrimah from the Prophet (ﷺ) saying: Umm Habibah daughter of Jahsh had a prolonged flow of blood; and he transmitted like that.1Sharik narrated from Abu al-Yaqzan from  'Adi b. Thabit from his father on the authority of his grandfather from the Prophet (ﷺ): The woman suffering from a prolonged flow of blood should abandon prayer during her menstrual period ; she then should was herself and pray. 1Al-'Ala b. al-Musayyab reported from al-Hakam on the authority of Abu Ja'far, saying: Saudah had a prolonged flow of blood. The Prophet (ﷺ) commanded that when he menstruation was finished, she should take bath and pray.1Sa'id b. Jubair reported from 'Ali and Ibn 'Abbas : A woman suffering from a prolonged flow of blood should refrain from prayers during her menstrual period.1'Ammar, the freed slave of Banu Hashim and Talq b. Habib narrated in a similar way.1Similarly, it was reported by Ma'qil al-Khath'ami from 'Ali4, al-Sha'bi also transmitted it in a similar manner from Qumair, the wife of Masruq, on the authority of 'Aishah.1Abu Dawud said: Al-Hasan, Sa'id b. al-Musayyab, 'Ata, Makhul, Ibrahim, Salim and al-Qasim also hold that a woman suffering from a prolonged flow of blood should abandon prayer during her menstrual period.Abu Dawud said: Qatadah did not hear anything from 'Urwah.",
      "chain": [
        "30224",
        "20028",
        "11173",
        "11013",
        "10511",
        "414"
      ]
    },
    {
      "hadith_no": "0",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا محمد بن أبي عدي، عن محمد، - يعني ابن عمرو - قال حدثني ابن شهاب، عن عروة بن الزبير، عن فاطمة بنت أبي حبيش، أنها كانت تستحاض فقال لها النبي صلى الله عليه وسلم ‏\"‏ إذا كان دم الحيضة فإنه دم أسود يعرف فإذا كان ذلك فأمسكي عن الصلاة فإذا كان الآخر فتوضئي وصلي فإنما هو عرق ‏\"‏ ‏.1قال أبو داود قال ابن المثنى حدثنا به ابن أبي عدي من كتابه هكذا ثم حدثنا به بعد حفظا قال حدثنا محمد بن عمرو عن الزهري عن عروة عن عائشة أن فاطمة كانت تستحاض ‏.‏ فذكر معناه ‏.‏قال أبو داود وقد روى أنس بن سيرين عن ابن عباس في المستحاضة قال إذا رأت الدم البحراني فلا تصلي وإذا رأت الطهر ولو ساعة فلتغتسل وتصلي ‏.‏2وقال مكحول إن النساء لا تخفى عليهن الحيضة إن دمها أسود غليظ فإذا ذهب ذلك وصارت صفرة رقيقة فإنها مستحاضة فلتغتسل ولتصلي ‏.3قال أبو داود وروى حماد بن زيد عن يحيى بن سعيد عن القعقاع بن حكيم عن سعيد بن المسيب في المستحاضة إذا أقبلت الحيضة تركت الصلاة وإذا أدبرت اغتسلت وصلت ‏.2‏‏ وروى سمى وغيره عن سعيد بن المسيب تجلس أيام أقرائها ‏.2‏وكذلك رواه حماد بن سلمة عن يحيى بن سعيد عن سعيد بن المسيب ‏.‏ قال أبو داود وروى يونس عن الحسن الحائض إذا مد بها الدم تمسك بعد حيضتها يوما أو يومين فهي مستحاضة ‏.‏ وقال التيمي عن قتادة إذا زاد على أيام حيضها خمسة أيام فلتصلي ‏.‏ قال التيمي فجعلت أنقص حتى بلغت يومين فقال إذا كان يومين فهو من حيضها ‏.‏ وسئل ابن سيرين عنه فقال النساء أعلم بذلك ‏.‏",
      "text_en": " Narrated Fatimah daughter of AbuHubaysh:                     Urwah ibn az-Zubayr reported from Fatimah daughter of AbuHubaysh that her blood kept flowing, so the Prophet (ﷺ) said to her: When the blood of the menses comes, it is black blood which can be recognised; so when that comes, refrain from prayer; but when a different type of blood comes, perform ablution and pray, for it is (due only to) a vein.Abu Dawud said: Ibn al-Muthanna narrates this tradition from his book on the authority of Ibn 'Adi in a similar way. Later on he transmitted it to us from his memory: Muhammad b. 'Amr reported to us from al-Zuhri from 'Urwah on the authority of 'Aishah who said: Fatimah used to have her blood flowing. He then reported the tradition conveying the same meaning.Abu Dawud said: Anas b. Sirin reported from Ibn 'Abbas about the woman who has a prolonged flow of blood. He said: If she sees thick blood, she should not pray; if she finds herself purified even for a moment, she should was an pray.Makhul said: Menses are not hidden from women. Their blood is black and thick. When it (blackness and thickness) goes away and there appears yellowness and liquidness, that is the flow of blood (from vein). She should wash and pray.Abu Dawud said: This tradition has been transmitted by Sa'id b. al-Musayyab through a different chain of narrators, saying: The woman who has a prolonged flow of blood should abandon prayer when the menstruation begins; when it is finished, she should wash and pray.Sumayy and others have also reported it from Sa'id b. al-Musayyab. This version adds: She should refrain (from prayer) during her menstrual period.Hammad b. Salamah has reported it similarly from Yahya b. Sa'id on the authority of Sa'id b. al-Musayyab.Abu Dawud said: Yunus has reported from Al-Hasan: When the bleeding of a menstruating woman extends (beyond the normal period), she should refrain (from prayer), after her menses are over, for one or two days. Now she becomes the woman who has a prolonged flow of blood.Al-Taimi reported from Qatadah: If her menstrual period is prolonged by five days, she should pray. Al-Taimi said: I kept on reducing (the number of days) until I reached two days. He said: If the period extends by two days, they will be counted from the menstrual period. When Ibn Sirin was questioned about it, he said: Women have better knowledge of that.",
      "chain": [
        "30170",
        "20276",
        "11220",
        "11013",
        "10511",
        "414"
      ]
    },
    {
      "hadith_no": "304",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا ابن أبي عدي، عن محمد، - يعني ابن عمرو - حدثني ابن شهاب، عن عروة بن الزبير، عن فاطمة بنت أبي حبيش، أنها كانت تستحاض فقال لها النبي صلى الله عليه وسلم ‏\"‏ إذا كان دم الحيض فإنه دم أسود يعرف فإذا كان ذلك فأمسكي عن الصلاة فإذا كان الآخر فتوضئي وصلي ‏\"‏ ‏.‏ قال أبو داود قال ابن المثنى وحدثنا به ابن أبي عدي حفظا فقال عن عروة عن عائشة أن فاطمة ‏.‏ قال أبو داود وروي عن العلاء بن المسيب وشعبة عن الحكم عن أبي جعفر قال العلاء عن النبي صلى الله عليه وسلم وأوقفه شعبة على أبي جعفر توضأ لكل صلاة ‏.‏",
      "text_en": " \t\t\t\t\t\t\t\t\t\t'Urwah b. al-Zubair said the Fatimah daughter of Abu Hubaish had a prolonged flow of blood. The Prophet (ﷺ) said to her:                      When the blood of menses comes, it is black blood with can be recognized; so when that comes, refrain from prayer, but when a different type comes, perform ablution and pray.Abu Dawud said: Ibn al-Muthanna said: Ibn 'Adi narrated this tradition from his memory on the authority of 'Urwah from 'Aishah.Abu Dawud said: This tradition has also been transmitted by al-'Ala b. al-Musayyab and Shu'bah from al-Hakam on the authority of Abu Ja'far. Al-'Ala reported it as a statement of the Prophet (ﷺ), and Shu'bah as a statement of Abu Ja'far, saying: She should perform ablution for every prayer.",
      "chain": [
        "30170",
        "20276",
        "11220",
        "11013",
        "10511",
        "414"
      ]
    },
    {
      "hadith_no": "217",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا محمد بن المثنى، حدثنا ابن أبي عدي، عن محمد، - وهو ابن عمرو بن علقمة بن وقاص - عن ابن شهاب، عن عروة بن الزبير، عن فاطمة بنت أبي حبيش، أنها كانت تستحاض فقال لها رسول الله صلى الله عليه وسلم ‏\"‏ إذا كان دم الحيض - فإنه دم أسود يعرف - فأمسكي عن الصلاة فإذا كان الآخر فتوضئي فإنما هو عرق ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Fatimah bint Abi Hubaish that she suffered from Istihadah and the Messenger of Allah (ﷺ) said to her:                      \"If it is menstrual blood then it is blood that is black and recognizable, so stop praying, and if it is other than that then perform Wudu', for it is just a vein.\"",
      "chain": [
        "30170",
        "20276",
        "11220",
        "11013",
        "10511",
        "414"
      ]
    },
    {
      "hadith_no": "358",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Menstruation and Istihadah - كتاب الحيض والاستحاضة",
      "chapter_no": "3",
      "text_ar": "أخبرنا عيسى بن حماد، قال أنبأنا الليث، عن يزيد بن أبي حبيب، عن بكير بن عبد الله، عن المنذر بن المغيرة، عن عروة، أن فاطمة بنت أبي حبيش، حدثته أنها، أتت رسول الله صلى الله عليه وسلم فشكت إليه الدم فقال لها رسول الله صلى الله عليه وسلم ‏\"‏ إنما ذلك عرق فانظري إذا أتاك قرؤك فلا تصلي وإذا مر قرؤك فلتطهري ثم صلي ما بين القرء إلى القرء ‏\"‏ ‏.‏ قال أبو عبد الرحمن قد روى هذا الحديث هشام بن عروة عن عروة ولم يذكر فيه ما ذكر المنذر ‏.‏",
      "text_en": " It was narrated from 'Urwah that Fatimah bint Abi Hubaish narrated that she came to the Messenger of Allah (ﷺ) and complained to him about bleeding. The Messenger of Allah (ﷺ) said to her:                      \"That is a vein, so when your period comes, do not pray, and when your period is over, purify yourself and pray in between one period and the next.\"Abu 'Abdur-Rahman said: Hisham bin 'Urwah reported this Hadith from 'Urwah, and he did not mention what Al-Mundhir mentioned in it.",
      "chain": [
        "30412",
        "20023",
        "11411",
        "11154",
        "12518",
        "10511",
        "414"
      ]
    },
    {
      "hadith_no": "362",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Menstruation and Istihadah - كتاب الحيض والاستحاضة",
      "chapter_no": "3",
      "text_ar": "أخبرنا محمد بن المثنى، قال حدثنا ابن أبي عدي، عن محمد بن عمرو، - وهو ابن علقمة بن وقاص - عن ابن شهاب، عن عروة بن الزبير، عن فاطمة بنت أبي حبيش، أنها كانت تستحاض فقال لها رسول الله صلى الله عليه وسلم ‏\"‏ إذا كان دم الحيض - فإنه دم أسود يعرف - فأمسكي عن الصلاة وإذا كان الآخر فتوضئي فإنما هو عرق ‏\"‏ ‏.‏ قال محمد بن المثنى حدثنا ابن أبي عدي هذا من كتابه ‏.‏",
      "text_en": " It was narrated from Fatimah bint Abi Hubaish that she suffered from Istihadah and the Messenger of Allah (ﷺ) said to her:                      \"If it is menstrual blood then it is blood that is black and recognizable, so stop prying, and if it is other than that then perform Wudu', for it is just a vein.\"",
      "chain": [
        "30170",
        "20276",
        "11220",
        "11013",
        "10511",
        "414"
      ]
    },
    {
      "hadith_no": "3553",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا عمرو بن منصور، قال حدثنا عبد الله بن يوسف، قال حدثنا الليث، قال حدثني يزيد بن أبي حبيب، عن بكير بن عبد الله بن الأشج، عن المنذر بن المغيرة، عن عروة بن الزبير، أن فاطمة ابنة أبي حبيش، حدثته أنها، أتت رسول الله صلى الله عليه وسلم فشكت إليه الدم فقال لها رسول الله صلى الله عليه وسلم ‏\"‏ إنما ذلك عرق فانظري إذا أتاك قرؤك فلا تصلي فإذا مر قرؤك فلتطهري - قال - ثم صلي ما بين القرء إلى القرء ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr bin Az-Zubair that Fatimah bint Abi Hubaish told him that she came to the Messenger of Allah and complained to him about (continual) bleeding. The Messenger of Allah said to her:                      \"That is a vein. Look and when your period comes, do not pray, and when your period ends, then purify yourself and pray during the time between one period and the next.\"",
      "chain": [
        "38433",
        "30355",
        "20023",
        "11411",
        "11154",
        "12518",
        "10511",
        "414"
      ]
    },
    {
      "hadith_no": "663",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن رمح، أنبأنا الليث بن سعد، عن يزيد بن أبي حبيب، عن بكير بن عبد الله، عن المنذر بن المغيرة، عن عروة بن الزبير، أن فاطمة بنت أبي حبيش، حدثته أنها، أتت رسول الله  صلى الله عليه وسلم  فشكت إليه الدم فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ إنما ذلك عرق فانظري إذا أتى قرؤك فلا تصلي فإذا مر القرء فتطهري ثم صلي ما بين القرء إلى القرء ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Urwah bin Zubair that Fatimah bint Abi Hubaish narrated to him that:                     She went to the Messenger of Allah and complained to him about bleeding. The Messenger of Allah said: \"Rather that is a vein, so look and see when your period comes, then do not perform the prayer. When the period is over, then purify yourself and perform the prayer between one period to the next.\"",
      "chain": [
        "30490",
        "20023",
        "11411",
        "11154",
        "12518",
        "10511",
        "414"
      ]
    }
  ],
  "total_hadiths": 9
}