{
  "id": "4140",
  "name": "Abu al-Hasan ( يسار والد الحسن ( رضي الله عنه",
  "full_name": "Abu al-Hasan ( يسار والد الحسن ( رضي الله عنه",
  "grade": "Comp.(RA)",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medina"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Medina",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Recitation/Quran"
    ],
    "tags": [
      "Ansar",
      "Client"
    ]
  },
  "parents": [],
  "spouses": [
    {
      "id": "10737",
      "name": "Khayra Umm al-Hasan al-'Abbassri خيرة أم الحسن البصري",
      "grade": "Follower(Tabi') [2nd Generation]"
    }
  ],
  "siblings": [],
  "children": [
    {
      "id": "11287",
      "name": "Sa'id bin Abi al-Hasan سعيد بن أبي الحسن",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11016",
      "name": "al-Hasan al-Basri الحسن البصري",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "274",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثنا محمد بن عبد الأعلى، حدثنا المعتمر، عن أبيه، عن بكر، عن الحسن، عن ابن المغيرة، عن أبيه، عن النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " This hadith has been transmitted by Ibn Mughira on the authority of his father by another chain of transmitters.",
      "chain": [
        "30449",
        "20288",
        "11289",
        "11267",
        "11016",
        "4140"
      ]
    },
    {
      "hadith_no": "100",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد القطان، عن سليمان التيمي، عن بكر بن عبد الله المزني، عن الحسن، عن ابن المغيرة بن شعبة، عن أبيه، قال توضأ النبي صلى الله عليه وسلم ومسح على الخفين والعمامة ‏.‏ قال بكر وقد سمعت من ابن المغيرة ‏.‏ قال وذكر محمد بن بشار في هذا الحديث في موضع آخر أنه مسح على ناصيته وعمامته ‏.‏ وقد روي هذا الحديث من غير وجه عن المغيرة بن شعبة ذكر بعضهم المسح على الناصية والعمامة ولم يذكر بعضهم الناصية ‏.‏ وسمعت أحمد بن الحسن يقول سمعت أحمد بن حنبل يقول ما رأيت بعيني مثل يحيى بن سعيد القطان ‏.‏ قال وفي الباب عن عمرو بن أمية وسلمان وثوبان وأبي أمامة ‏.‏ قال أبو عيسى حديث المغيرة بن شعبة حديث حسن صحيح ‏.‏ وهو قول غير واحد من أهل العلم من أصحاب النبي صلى الله عليه وسلم منهم أبو بكر وعمر وأنس ‏.‏ وبه يقول الأوزاعي وأحمد وإسحاق قالوا يمسح على العمامة ‏.‏ وقال غير واحد من أهل العلم من أصحاب النبي صلى الله عليه وسلم والتابعين لا يمسح على العمامة إلا أن يمسح برأسه مع العمامة ‏.‏ وهو قول سفيان الثوري ومالك بن أنس وابن المبارك والشافعي ‏.‏ قال أبو عيسى وسمعت الجارود بن معاذ يقول سمعت وكيع بن الجراح يقول إن مسح على العمامة يجزئه للأثر ‏.‏",
      "text_en": " Ibn Al-Mughirah bin Shu'bah narrated from his father:                     \"The Prophet performed Wudu and wiped over the Khuff and 'Imamah.\" Abu Bakr (one of the narrators) said: \"And indeed I heard it from Ibn Al Mughirah.\"",
      "chain": [
        "30160",
        "20031",
        "11289",
        "11267",
        "11016",
        "4140"
      ]
    }
  ],
  "total_hadiths": 2
}