{
  "id": "4143",
  "name": "Safwan bin 'Assal ( صفوان بن عسال ( رضي الله عنه",
  "full_name": "Safwan bin 'Assal ( صفوان بن عسال ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Hijaz"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina",
      "Kufa"
    ],
    "area_of_interest": [
      "Narrator [ ت  س  ق  -  صحابي ]"
    ],
    "tags": [
      "al-Muradi",
      "Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "96",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا هناد، حدثنا أبو الأحوص، عن عاصم بن أبي النجود، عن زر بن حبيش، عن صفوان بن عسال، قال كان رسول الله صلى الله عليه وسلم يأمرنا إذا كنا سفرا أن لا ننزع خفافنا ثلاثة أيام ولياليهن إلا من جنابة ولكن من غائط وبول ونوم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وقد روى الحكم بن عتيبة وحماد عن إبراهيم النخعي عن أبي عبد الله الجدلي عن خزيمة بن ثابت ولا يصح ‏.‏ قال علي بن المديني قال يحيى بن سعيد قال شعبة لم يسمع إبراهيم النخعي من أبي عبد الله الجدلي حديث المسح ‏.‏ وقال زائدة عن منصور كنا في حجرة إبراهيم التيمي ومعنا إبراهيم النخعي فحدثنا إبراهيم التيمي عن عمرو بن ميمون عن أبي عبد الله الجدلي عن خزيمة بن ثابت عن النبي صلى الله عليه وسلم في المسح على الخفين ‏.‏ قال محمد بن إسماعيل أحسن شيء في هذا الباب حديث صفوان بن عسال المرادي ‏.‏ قال أبو عيسى وهو قول أكثر العلماء من أصحاب النبي صلى الله عليه وسلم والتابعين ومن بعدهم من الفقهاء مثل سفيان الثوري وابن المبارك والشافعي وأحمد وإسحاق قالوا يمسح المقيم يوما وليلة والمسافر ثلاثة أيام ولياليهن ‏.‏ قال أبو عيسى وقد روي عن بعض أهل العلم أنهم لم يوقتوا في المسح على الخفين وهو قول مالك بن أنس ‏.‏ قال أبو عيسى والتوقيت أصح ‏.‏ وقد روي هذا الحديث عن صفوان بن عسال أيضا من غير حديث عاصم ‏.‏",
      "text_en": " Safwan bin Assal narrated:                     'When we were traveling, Allah's Messenger would order us not to remove our Khuff for three days and nights, except for Janabah, but not for defecating, urinating, and sleep.\"",
      "chain": [
        "30480",
        "20327",
        "11358",
        "11337",
        "4143"
      ]
    },
    {
      "hadith_no": "2387",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا يحيى بن آدم، حدثنا سفيان، عن عاصم، عن زر بن حبيش، عن صفوان بن عسال، قال جاء أعرابي جهوري الصوت فقال يا محمد الرجل يحب القوم ولما يلحق بهم ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ المرء مع من أحب ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏  حدثنا أحمد بن عبدة الضبي، حدثنا حماد بن زيد، عن عاصم، عن زر، عن صفوان بن عسال، عن النبي صلى الله عليه وسلم نحو حديث محمود ‏.‏",
      "text_en": " Safwan bin Assal narrated that a Bedouin with a loud voice and said:                     \" O Muhammad! A man loves the people but does not catch up to them (in deeds).\" So the Messenger of Allah(s.a.w) said: \"A man shall be with whomever he loves.\"",
      "chain": [
        "30277",
        "20364",
        "20012",
        "11080",
        "11337",
        "4143"
      ]
    },
    {
      "hadith_no": "2733",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Seeking Permission - كتاب الاستئذان والآداب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "42",
      "text_ar": "حدثنا أبو كريب، حدثنا عبد الله بن إدريس، وأبو أسامة عن شعبة، عن عمرو بن مرة، عن عبد الله بن سلمة، عن صفوان بن عسال، قال قال يهودي لصاحبه اذهب بنا إلى هذا النبي ‏.‏ فقال صاحبه لا تقل نبي إنه لو سمعك كان له أربعة أعين ‏.‏ فأتيا رسول الله صلى الله عليه وسلم فسألاه عن تسع آيات بينات ‏.‏ فقال لهم ‏\"‏ لا تشركوا بالله شيئا ولا تسرقوا ولا تزنوا ولا تقتلوا النفس التي حرم الله إلا بالحق ولا تمشوا ببريء إلى ذي سلطان ليقتله ولا تسحروا ولا تأكلوا الربا ولا تقذفوا محصنة ولا تولوا الفرار يوم الزحف وعليكم خاصة اليهود أن لا تعتدوا في السبت ‏\"‏ ‏.‏ قال فقبلوا يده ورجله فقالا نشهد أنك نبي ‏.‏ قال ‏\"‏ فما يمنعكم أن تتبعوني ‏\"‏ ‏.‏ قالوا إن داود دعا ربه أن لا يزال في ذريته نبي وإنا نخاف إن تبعناك أن تقتلنا اليهود ‏.‏ وفي الباب عن يزيد بن الأسود وابن عمر وكعب بن مالك ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Safwan bin Assal:                     \"A Jew said to his companion: 'Accompany us to this Prophet.' So his companion said: 'Do not say: \"Prophet\". For if he hears you (say that) then he will be very happy.' So they went to the Messenger of Allah (ﷺ) to question him about nine clear signs. So he said to them: 'Do not associate anything with Allah, nor steal, nor commit unlawful intercourse, nor take a life which Allah has made prohibited prohibited, except for what is required (in the law), nor hasten to damage the reputation of one of power so that he will be killed, nor practice magic, nor consume Riba, nor falsely accuse the chaste woman, nor turn to flee on the day of the march, and for you Jews particularly, to not violate the Sabbath.'\" He said: \"So they kissed his hands and his feet, and they said: 'We bear witness that you are a Prophet.' So he (ﷺ) said: 'Then what prevents you from following me?' They said: 'Because Dawud supplicated to his Lord that his offspring never be devoid of Prophets and we feared that if we follow you then the Jews will kill us.'\"",
      "chain": [
        "30216",
        "20102",
        "20318",
        "20020",
        "11381",
        "4143"
      ]
    },
    {
      "hadith_no": "3437",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود، ويزيد بن هارون، وأبو الوليد، واللفظ، لفظ يزيد والمعنى واحد عن شعبة، عن عمرو بن مرة، عن عبد الله بن سلمة، عن صفوان بن عسال المرادي، أن يهوديين، قال أحدهما لصاحبه اذهب بنا إلى هذا النبي نسأله فقال لا تقل له نبي فإنه إن سمعنا نقول نبي كانت له أربعة أعين فأتيا النبي صلى الله عليه وسلم فسألاه عن قول الله عز وجل ‏:‏ ‏(‏ ولقد آتينا موسى تسع آيات بينات ‏)‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تشركوا بالله شيئا ولا تزنوا ولا تقتلوا النفس التي حرم الله إلا بالحق ولا تسرقوا ولا تسحروا ولا تمشوا ببريء إلى سلطان فيقتله ولا تأكلوا الربا ولا تقذفوا محصنة ولا تفروا من الزحف شك شعبة وعليكم اليهود خاصة أن لا تعدوا في السبت ‏\"‏ ‏.‏ فقبلا يديه ورجليه وقالا نشهد أنك نبي ‏.‏ قال ‏\"‏ فما يمنعكما أن تسلما ‏\"‏ ‏.‏ قالا إن داود دعا الله أن لا يزال في ذريته نبي وإنا نخاف إن أسلمنا أن تقتلنا اليهود ‏.‏ قال هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Safwan bin 'Assal Al-Muradi:                     \"A Jew said to his companion: 'Accompany us to this Prophet.' So his companion said: 'Do not say: \"Prophet,\" for if he hears you calling him a Prophet then he will be happy.' So they went to the Prophet (ﷺ) to question him about Allah, the Most High, saying: And indeed we gave Musa nine clear signs (17:101). So the Messenger of Allah (ﷺ) said to them: 'Do not associate anything with Allah, nor commit unlawful intercourse, nor take a life which Allah has made prohibited, except for what is required (in the law), nor steal, nor practice magic, nor hasten to damage the reputation of an innocent person in front of a ruler, so that he will be killed, nor consume Riba, nor falsely accuse the chaste woman, nor turn to flee on the day of the march (i.e. flee from war).' - Shu'bah was in doubt - 'and for you Jews particularly, to not violate the Sabbath.'\" He said: \"So they kissed his hands and his feet and they said: 'We bear witness that you are a Prophet.' So he said: 'Then what prevents you from accepting Islam?' They said: 'Because Dawud supplicated to his Lord, that his offspring never be devoid of Prophets, and we feared that if we follow you then the Jews will kill us.'\"",
      "chain": [
        "30277",
        "20547",
        "20472",
        "20296",
        "20020",
        "11381",
        "4143"
      ]
    },
    {
      "hadith_no": "127",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا قتيبة، قال حدثنا سفيان، عن عاصم، عن زر، عن صفوان بن عسال، قال رخص لنا النبي صلى الله عليه وسلم إذا كنا مسافرين أن لا ننزع خفافنا ثلاثة أيام ولياليهن ‏.‏",
      "text_en": " It was narrated that Safwan bin 'Assal said:                      \"The Prophet (ﷺ) granted us a dispensation when traveling, allowing us not to take off our Khuffs for three days and three nights.\"",
      "chain": [
        "30367",
        "20005",
        "11080",
        "11337",
        "4143"
      ]
    },
    {
      "hadith_no": "128",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا أحمد بن سليمان الرهاوي، قال حدثنا يحيى بن آدم، قال حدثنا سفيان الثوري، ومالك بن مغول، وزهير، وأبو بكر بن عياش وسفيان بن عيينة عن عاصم، عن زر، قال سألت صفوان بن عسال عن المسح، على الخفين فقال كان رسول الله صلى الله عليه وسلم يأمرنا إذا كنا مسافرين أن نمسح على خفافنا ولا ننزعها ثلاثة أيام من غائط وبول ونوم إلا من جنابة ‏.‏",
      "text_en": " It was narrated that Zirr said:                      \"I asked Safwan bin 'Assal about wiping over the Khuffs, and he said: 'The Messenger of Allah (ﷺ) used to tell us, when we were travelling, to wipe over our Khuffs and not take them off for three nights in the event of defecating, urinating or sleeping; only in the case of Janabah.'\"",
      "chain": [
        "38022",
        "20364",
        "20012",
        "20358",
        "20321",
        "11080",
        "11337",
        "4143"
      ]
    },
    {
      "hadith_no": "4078",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا محمد بن العلاء، عن ابن إدريس، قال أنبأنا شعبة، عن عمرو بن مرة، عن عبد الله بن سلمة، عن صفوان بن عسال، قال قال يهودي لصاحبه اذهب بنا إلى هذا النبي ‏.‏ قال له صاحبه لا تقل نبي لو سمعك كان له أربعة أعين ‏.‏ فأتيا رسول الله صلى الله عليه وسلم وسألاه عن تسع آيات بينات فقال لهم ‏\"‏ لا تشركوا بالله شيئا ولا تسرقوا ولا تزنوا ولا تقتلوا النفس التي حرم الله إلا بالحق ولا تمشوا ببريء إلى ذي سلطان ولا تسحروا ولا تأكلوا الربا ولا تقذفوا المحصنة ولا تولوا يوم الزحف وعليكم خاصة يهود أن لا تعدوا في السبت ‏\"‏ ‏.‏ فقبلوا يديه ورجليه وقالوا نشهد أنك نبي ‏.‏ قال ‏\"‏ فما يمنعكم أن تتبعوني ‏\"‏ ‏.‏ قالوا إن داود دعا بأن لا يزال من ذريته نبي وإنا نخاف إن اتبعناك أن تقتلنا يهود ‏.‏",
      "text_en": " It was narrated that Safwan bin 'Assal said:                     \"A Jew said to his companion: 'Let us go to this Prophet.' His companion said to him: 'Do not say Prophet; if he hears you, he will become big-headed.' So they came to the Messenger of Allah [SAW] and asked him about nine clear signs. He said to them: 'Do not associate anything with Allah, do not steal, do not commit adultery, do not kill any soul whom Allah has forbidden you to kill, except by right, do not speak falsely about an innocent man before a ruler, do not engage in magic, do not consume Riba (usury), do not slander chaste women, and do not flee on the day of the march (to battle). And for you Jews especially, do not break the Sabbath.' They kissed his hands and feet and said: 'We bear witness that you are a Prophet.' He said: 'What is keeping you from following me?' They said: 'Dawud prayed that there would always be a Prophet among his descendants, and we are afraid that if we follow you, the Jews will kill us.'\"",
      "chain": [
        "30216",
        "20102",
        "20020",
        "11381",
        "4143"
      ]
    },
    {
      "hadith_no": "423",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا بشر بن آدم، حدثنا زيد بن الحباب، حدثني الوليد بن عقبة، حدثني حذيفة بن أبي حذيفة الأزدي، عن صفوان بن عسال، قال صببت على النبي  صلى الله عليه وسلم  الماء في السفر والحضر في الوضوء ‏.‏",
      "text_en": " It was narrated that Safwan bin 'Assal said:                     \"I poured water for the Prophet on journeys and as a resident, when he performed ablution.\"",
      "chain": [
        "30125",
        "20650",
        "18169",
        "4143"
      ]
    },
    {
      "hadith_no": "516",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا سفيان بن عيينة، عن عاصم، عن زر، عن صفوان بن عسال، قال كان رسول الله  صلى الله عليه وسلم  يأمرنا أن لا ننزع خفافنا ثلاثة أيام إلا من جنابة لكن من غائط وبول ونوم ‏.‏",
      "text_en": " It was narrated that Safwan bin 'Assal said:                     \"The Messenger of Allah used to command us not to take off our leather socks for three days except in the case of sexual impurity, but not in the case of defecation, urine or sleep (i.e. during travel).\"",
      "chain": [
        "30201",
        "20005",
        "11080",
        "11337",
        "4143"
      ]
    },
    {
      "hadith_no": "2966",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا الحسن بن علي الخلال، حدثنا أبو أسامة، حدثني عطية بن الحارث أبو روق الهمداني، حدثني أبو الغريف، عبيد الله بن خليفة عن صفوان بن عسال، قال بعثنا رسول الله صلى الله عليه وسلم في سرية فقال ‏\"‏ سيروا باسم الله وفي سبيل الله قاتلوا من كفر بالله ولا تمثلوا ولا تغدروا ولا تغلوا ولا تقتلوا وليدا ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Safwan bin ‘Assil said:                      “The Messenger of Allah(ﷺ) sent us in a military detachment and said: ‘Go in the Name ofAllah, and in the cause of Allah. Fight those who disbelieve inAllah.Do not mutilate, do not be treacherous, do not steal from thespoilsof war, and do not kill children.’”",
      "chain": [
        "30115",
        "20318",
        "4143"
      ]
    },
    {
      "hadith_no": "3705",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر، حدثنا عبد الله بن إدريس، وغندر، وأبو أسامة عن شعبة، عن عمرو بن مرة، عن عبد الله بن سلمة، عن صفوان بن عسال، أن قوما، من اليهود قبلوا يد النبي  صلى الله عليه وسلم  ورجليه ‏.‏",
      "text_en": " It was narrated from Safwan bin 'Assal that:                     \"Some people among the Jews kissed the hands and feet of the Prophet(ﷺ).\"",
      "chain": [
        "20436",
        "20102",
        "20278",
        "20318",
        "20020",
        "11381",
        "4143"
      ]
    },
    {
      "hadith_no": "4208",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبيد الله بن موسى، عن إسرائيل، عن عاصم، عن زر، عن صفوان بن عسال، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن من قبل مغرب الشمس بابا مفتوحا عرضه سبعون سنة فلا يزال ذلك الباب مفتوحا للتوبة حتى تطلع الشمس من نحوه فإذا طلعت من نحوه لم ينفع نفسا إيمانها لم تكن آمنت من قبل أو كسبت في إيمانها خيرا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Safwan bin ‘Assal that the Messenger of Allah(ﷺ) said:                      “Towards the west (i.e., the place of the setting ofthesun) there is an open door, seventy years wide. That door willremainopen for repentance until the sun rises from this direction.When itrises from this direction, faith will not benefit any soulthat didnot believe before or earn anything good through its faith.”",
      "chain": [
        "30201",
        "20340",
        "20311",
        "11080",
        "11337",
        "4143"
      ]
    }
  ],
  "total_hadiths": 12
}