{
  "id": "434",
  "name": "Hisham bin Hakim ibn Hizam ( هشام بن حكيم بن حزام القرشي الأسدي ( رضي الله عنه",
  "full_name": "Hisham bin Hakim ibn Hizam ( هشام بن حكيم بن حزام القرشي الأسدي ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Makkah"
    },
    "death": {
      "date_hijri": "41",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Medinah",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah",
      "Medina",
      "Syria"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ م  د  س  -  صحابي ]"
    ],
    "tags": [
      "Quraish",
      "B.Asad",
      "Late Muslim"
    ]
  },
  "parents": [
    {
      "id": "423",
      "name": "Hakim ibn Hizam ( حكيم بن حزام بن خويلد ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "431",
      "name": "Zaynab bint al-'Awwam bin Khuwaylid ( زينب بنت العوام بن خويلد بن أسد القرشية ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "432",
      "name": "'Abdullah bin Hakim ibn Hizam ( عبد الله بن حكيم بن حزام القرشي الأسدي ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "433",
      "name": "Khalid bin Hakim ibn Hizam ( خالد بن حكيم بن حزام القرشي الأسدي ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "435",
      "name": "Yahya bin Hakim ibn Hizam ( يحيى بن حكيم بن حزام القرشي الأسدي ( رضي الله عنه",
      "grade": "Comp.(RA)"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "students": [
    {
      "id": "4097",
      "name": "Jubayr bin Nufayr al-Hadrami ( جبير بن نفير الحضرمي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "10511",
      "name": "'Urwa ibn al-Zubayr عروة بن الزبير",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "6823",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا حفص بن غياث، عن هشام بن عروة، عن  أبيه، عن هشام بن حكيم بن حزام، قال مر بالشام على أناس وقد أقيموا في الشمس وصب على رءوسهم الزيت فقال ما هذا قيل يعذبون في الخراج ‏.‏ فقال أما إني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن الله يعذب الذين يعذبون في الدنيا ‏\"‏ ‏.‏",
      "text_en": " 'Urwa reported on the authority of his father that Hisham b. Hakim b. Hizam happened to pass by some people in Syria who had been made to stand in the sun and olive-oil was being poured upon their heads. He said:                      What is this? It was said: They are being punished for (not paying) the Kharaj (the government revenue). Thereupon he said: Allah would punish those who torment people in this world (without any genuine reason).",
      "chain": [
        "30201",
        "20317",
        "11065",
        "10511",
        "434"
      ]
    },
    {
      "hadith_no": "3045",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا سليمان بن داود المهري، أخبرنا ابن وهب، أخبرني يونس بن يزيد، عن ابن شهاب، عن عروة بن الزبير، أن هشام بن حكيم بن حزام، وجد رجلا وهو على حمص يشمس ناسا من النبط في أداء الجزية فقال ما هذا سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن الله يعذب الذين يعذبون الناس في الدنيا ‏\"‏ ‏.‏",
      "text_en": " ‘Urwa bin Al Zubair said “Hisham bin Halim bin Hizam found a man who was the governor of Hims making some Copts stand in the sun for the payment of jizyah. He said “What is this?” I heard the Apostle (ﷺ) as saying “Allaah Most High will punish those who punish the people in this world.”",
      "chain": [
        "30584",
        "20029",
        "20475",
        "11013",
        "10511",
        "434"
      ]
    }
  ],
  "total_hadiths": 2
}