{
  "id": "448",
  "name": "'Abdur Rahman ibn al-Harith ( عبد الرحمن بن الحارث بن هشام ( رضي الله عنه",
  "full_name": "'Abdur Rahman ibn al-Harith ( عبد الرحمن بن الحارث بن هشام ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "1",
      "date_gregorian": "NA",
      "date_display": [
        "1 AH"
      ],
      "place": "Makkah"
    },
    "death": {
      "date_hijri": "43",
      "date_gregorian": "663",
      "date_display": null,
      "place": "Medinah",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah",
      "Medina"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ خ  4  -  صحابة ]"
    ],
    "tags": [
      "Quraish",
      "B.Makhzum",
      "Child"
    ]
  },
  "parents": [
    {
      "id": "2011",
      "name": "al-Harith bin Hisham ( الحارث بن هشام بن المغيرة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "454",
      "name": "Fatima bint al-Walid b. al-Mughirah ( فاطمة بنت الوليد بن المغيرة ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "spouses": [
    {
      "id": "582",
      "name": "Suada bint 'Auf al-Murriya ( سعدى بنت عوف المرية ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "10515",
      "name": "Ummul Hasan bint al-Zubayr",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "10585",
      "name": "Maryam bint 'Uthman مريم بنت عثمان بن عفان",
      "grade": "Follower(Tabi')"
    }
  ],
  "siblings": [
    {
      "id": "93",
      "name": "Umm Hakim ( أم حكيم بنت الحارث بن هشام بن المغيرة ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "2012",
      "name": "Abu Sa'd/Sa'id bin al-Harith bin Hisham ( أبو سعد أو أبو سعيد بن الحارث بن هشام ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "2013",
      "name": "al-Mughira bin al-Harith bin Hisham ( المغيرة بن الحارث بن هشام المخزومي ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "2014",
      "name": "'Abdullah bin al-Harith bin Hisham ( عبد الله بن الحارث بن هشام المخزومي ( رضي الله عنه",
      "grade": "Comp.(RA)"
    }
  ],
  "children": [
    {
      "id": "11003",
      "name": "Abu Bakr bin 'Abdur Rahman أبو بكر بن عبد الرحمن بن الحارث بن هشام",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11030",
      "name": "Ikramah bin 'Abdur Rahman عكرمة بن عبد الرحمن بن الحارث",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11031",
      "name": "Muhammad bin 'Abdur Rahman محمد بن عبد الرحمن بن الحارث",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11032",
      "name": "'Umar bin 'Abdur Rahman bin al-Harith عمر بن عبد الرحمن بن الحارث بن هشام",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11033",
      "name": "Abu Sa'id bin 'Abdur Rahman أبو سعيد بن عبد الرحمن بن الحارث",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "11034",
      "name": "al-Mughira bin 'Abdur Rahman المغيرة بن عبد الرحمن بن الحارث",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "2011",
      "name": "al-Harith bin Hisham ( الحارث بن هشام بن المغيرة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3",
      "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4",
      "name": "'Uthman ibn 'Affaan ( عثمان بن عفان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5",
      "name": "Ali ibn Abi Talib ( علي بن أبي طالب بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "479",
      "name": "Abu Rafi' ( أسلم أبو رافع مولى رسول الله ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "54",
      "name": "Hafsa bint Umar ( حفصة بنت عمر بن الخطاب أم المؤمنين ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "56",
      "name": "Umm Salamah ( أم سلمة بنت أبي أمية ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11505",
      "name": "Dhakwan Abu 'Amr ذكوان أبو عمرو",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19067",
      "name": "Naf' Mwla Umm Salmah نافع مولى أم سلمة",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "11003",
      "name": "Abu Bakr bin 'Abdur Rahman أبو بكر بن عبد الرحمن بن الحارث بن هشام",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11030",
      "name": "Ikramah bin 'Abdur Rahman عكرمة بن عبد الرحمن بن الحارث",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11034",
      "name": "al-Mughira bin 'Abdur Rahman المغيرة بن عبد الرحمن بن الحارث",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11023",
      "name": "'Ikrama عكرمة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "166",
      "name": "al-Mughira ibn Shu'ba ( المغيرة بن شعبة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11446",
      "name": "Hisham bin 'Amr al-Fzary هشام بن عمرو الفزاري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11052",
      "name": "'Amir al-Sha'bi عامر الشعبي",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1427",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، عن هشام بن عمرو الفزاري، عن عبد الرحمن بن الحارث بن هشام، عن علي بن أبي طالب، رضى الله عنه أن رسول الله صلى الله عليه وسلم كان يقول في آخر وتره ‏\"‏ اللهم إني أعوذ برضاك من سخطك وبمعافاتك من عقوبتك وأعوذ بك منك لا أحصي ثناء عليك أنت كما أثنيت على نفسك ‏\"‏ ‏.‏ قال أبو داود هشام أقدم شيخ لحماد وبلغني عن يحيى بن معين أنه قال لم يرو عنه غير حماد بن سلمة ‏.‏ قال أبو داود روى عيسى بن يونس عن سعيد بن أبي عروبة عن قتادة عن سعيد بن عبد الرحمن بن أبزى عن أبيه عن أبى بن كعب أن رسول الله صلى الله عليه وسلم قنت - يعني في الوتر - قبل الركوع ‏.‏ قال أبو داود روى عيسى بن يونس هذا الحديث أيضا عن فطر بن خليفة عن زبيد عن سعيد بن عبد الرحمن بن أبزى عن أبيه عن أبى عن النبي صلى الله عليه وسلم مثله وروي عن حفص بن غياث عن مسعر عن زبيد عن سعيد بن عبد الرحمن بن أبزى عن أبيه عن أبى بن كعب أن رسول الله صلى الله عليه وسلم قنت في الوتر قبل الركوع ‏.‏ قال أبو داود حديث سعيد عن قتادة رواه يزيد بن زريع عن سعيد عن قتادة عن عزرة عن سعيد بن عبد الرحمن بن أبزى عن أبيه عن النبي صلى الله عليه وسلم لم يذكر القنوت ولا ذكر أبيا وكذلك رواه عبد الأعلى ومحمد بن بشر العبدي وسماعه بالكوفة مع عيسى بن يونس ولم يذكروا القنوت وقد رواه أيضا هشام الدستوائي وشعبة عن قتادة ولم يذكرا القنوت وحديث زبيد رواه سليمان الأعمش وشعبة وعبد الملك بن أبي سليمان وجرير بن حازم كلهم عن زبيد لم يذكر أحد منهم القنوت إلا ما روي عن حفص بن غياث عن مسعر عن زبيد فإنه قال في حديثه إنه قنت قبل الركوع ‏.‏ قال أبو داود وليس هو بالمشهور من حديث حفص نخاف أن يكون عن حفص عن غير مسعر ‏.‏ قال أبو داود ويروى أن أبيا كان يقنت في النصف من شهر رمضان ‏.‏",
      "text_en": " Narrated Ali ibn AbuTalib:                     The Messenger of Allah (ﷺ) used to say at the end of his witr: \"O Allah, I seek refuge in Thy good pleasure from Thy anger, and in Thy forgiveness from Thy punishment, and I seek refuge in Thy mercy from Thy wrath. I cannot reckon the praise due to Thee. Thou art as Thou hast praised Thyself.\"Abu Dawud said: Hisham is the earliest teacher of Hammad. Yahya b. Ma'in said: No one is reported to have narrated traditions form him except Hammad b. Salamah.Abu Dawud said: Ubayy b. Ka'b said: The Messenger of Allah (ﷺ) recited supplication in the witr before bowing.Abu Dawud said: This tradition has also been narrated by 'Isa b. Yunus through a different chain of narrators from Ubayy b. Ka'b. He also narrated it through a different chain of narrators on the authority of Ubayy b. Ka'b that the Messenger of Allah (ﷺ) recited the supplication in the witr before bowing.Abu Dawud said: The chain of narrators of the tradition of Sa'id from Qatadah goes: Yazid b. Zurai' narrated from Sa'id, from Qatadah, from 'Azrah, from Sa'id b. 'Abd al-Rahman b. Abza, on the authority of his father, from the Prophet (ﷺ). This version does not mention the supplication and the name of Ubayy. This tradition has also been narrated by 'Abd al-A'la and Muhammad b. Bishr al-'Abdi. He heard the traditions from 'Isa b. Yunus at Kufah. They did not mention the supplication in their version.This tradition has also been narrated by Hisham al-Dastuwa'i and Shu'bah from Qatadah. They did not mention the supplication in their version. The tradition of Zubaid has been narrated by Sulaiman al-A'mash, Shu'bah, 'Abd al-Malik b. Abi Sulaiman, and Jarir b. Hazim; all of them narrated on the authority of Zubaid. None of them mention the supplication in his version, except in the tradition transmitted by Hafs b. Ghiyath from Mis'ar from Zubaid; he narrated in his version that he (the Prophet) recited supplication before bowing.Abu Dawud said: This version of tradition is not well know. There is doubt that Hafs might have narrated this tradition from some other narrator than Mis'ar.Abu Dawud said: It is reported that Ubayy (b. Ka'b) used to recited the supplication )in the witr) in the second half of Ramadan.",
      "chain": [
        "20040",
        "20021",
        "11446",
        "448",
        "5"
      ]
    },
    {
      "hadith_no": "2191",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا محمد بن العلاء، أخبرنا أبو أسامة، عن الوليد بن كثير، حدثني عبد الرحمن بن الحارث، عن عمرو بن شعيب، بإسناده ومعناه زاد ‏\"‏ من حلف على معصية فلا يمين له ومن حلف على قطيعة رحم فلا يمين له ‏\"‏ ‏.‏",
      "text_en": " The above tradition has also been transmitted by ‘Amr bin Shu’aib through a different chain of narrators to the same effect. This version adds “If anyone swears an oath to do an act of disobedience to GOD, his oath is not valid, and if anyone swears an oath to sever relationship, his oath is not valid(i.e., he must not fulfill it)",
      "chain": [
        "30216",
        "20318",
        "11230",
        "448"
      ]
    },
    {
      "hadith_no": "2395",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا محمد بن عوف، حدثنا سعيد بن أبي مريم، حدثنا ابن أبي الزناد، عن عبد الرحمن بن الحارث، عن محمد بن جعفر بن الزبير، عن عباد بن عبد الله، عن عائشة، بهذه القصة قال فأتي بعرق فيه عشرون صاعا ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by 'Aishah through a different chain of narrators. This version adds:                      A huge basket containing twenty sa's (of dates) was brought.",
      "chain": [
        "38566",
        "30232",
        "20509",
        "448",
        "11215"
      ]
    },
    {
      "hadith_no": "3084",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا عبد العزيز بن محمد، عن عبد الرحمن بن الحارث، عن ابن شهاب، عن عبيد الله بن عبد الله، عن عبد الله بن عباس، عن الصعب بن جثامة، أن النبي صلى الله عليه وسلم حمى النقيع وقال ‏\"‏ لا حمى إلا لله عز وجل ‏\"‏ ‏.‏",
      "text_en": " Narrated As-Sa'b ibn Jaththamah:                     The Prophet (ﷺ) protected Naqi and said: There is no (permission for) protected land except for Allah Most High.",
      "chain": [
        "30116",
        "20167",
        "448",
        "11013",
        "11004",
        "17",
        "3661"
      ]
    },
    {
      "hadith_no": "4503",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، قال حدثنا محمد بن إسحاق، فحدثني محمد بن جعفر بن الزبير، قال سمعت زياد بن ضميرة الضمري، ح وحدثنا وهب بن بيان، وأحمد بن سعيد الهمداني، قالا حدثنا ابن وهب، أخبرني عبد الرحمن بن أبي الزناد، عن عبد الرحمن بن الحارث، عن محمد بن جعفر، أنه سمع زياد بن سعد بن ضميرة السلمي، - وهذا حديث وهب وهو أتم - يحدث عروة بن الزبير عن أبيه - قال موسى - وجده وكانا شهدا مع رسول الله صلى الله عليه وسلم حنينا - ثم رجعنا إلى حديث وهب - أن محلم بن جثامة الليثي قتل رجلا من أشجع في الإسلام وذلك أول غير قضى به رسول الله صلى الله عليه وسلم فتكلم عيينة في قتل الأشجعي لأنه من غطفان وتكلم الأقرع بن حابس دون محلم لأنه من خندف فارتفعت الأصوات وكثرت الخصومة واللغط فقال رسول الله صلى الله عليه وسلم ‏\"‏ يا عيينة ألا تقبل الغير ‏\"‏ ‏.‏ فقال عيينة لا والله حتى أدخل على نسائه من الحرب والحزن ما أدخل على نسائي ‏.‏ قال ثم ارتفعت الأصوات وكثرت الخصومة واللغط فقال رسول الله صلى الله عليه وسلم ‏\"‏ يا عيينة ألا تقبل الغير ‏\"‏ ‏.‏ فقال عيينة مثل ذلك أيضا إلى أن قام رجل من بني ليث يقال له مكيتل عليه شكة وفي يده درقة فقال يا رسول الله إني لم أجد لما فعل هذا في غرة الإسلام مثلا إلا غنما وردت فرمي أولها فنفر آخرها اسنن اليوم وغير غدا فقال رسول الله صلى الله عليه وسلم ‏\"‏ خمسون في فورنا هذا وخمسون إذا رجعنا إلى المدينة ‏\"‏ ‏.‏ وذلك في بعض أسفاره ومحلم رجل طويل آدم وهو في طرف الناس فلم يزالوا حتى تخلص فجلس بين يدى رسول الله صلى الله عليه وسلم وعيناه تدمعان فقال يا رسول الله إني قد فعلت الذي بلغك وإني أتوب إلى الله تبارك وتعالى فاستغفر الله عز وجل لي يا رسول الله ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أقتلته بسلاحك في غرة الإسلام اللهم لا تغفر لمحلم ‏\"‏ ‏.‏ بصوت عال زاد أبو سلمة فقام وإنه ليتلقى دموعه بطرف ردائه قال ابن إسحاق فزعم قومه أن رسول الله صلى الله عليه وسلم استغفر له بعد ذلك ‏.‏ قال أبو داود قال النضر بن شميل الغير الدية ‏.‏",
      "text_en": " Narrated Ziyad ibn Sa'd ibn Dumayrah as-Sulami:                     On the authority of his father (Sa'd) and his grandfather (Dumayrah) (according to Musa's version) who were present in the battle of Hunayn with the Messenger of Allah (ﷺ): After the advent of Islam, Muhallam ibn Jaththamah al-Laythi killed a man of Ashja'. That was the first blood-money decided by the Messenger of Allah (ﷺ) (for payment). Uyaynah spoke about the killing of al-Ashja'i, for he belonged to Ghatafan, and al-Aqra' ibn Habis spoke on behalf of Muhallam, for he belonged to Khunduf. The voices rose high, and the dispute and noise grew.  So the Messenger of Allah (ﷺ) said: Do you not accept blood-money, Uyaynah?  Uyaynah then said: No, I swear by Allah, until I cause his women to suffer the same fighting and grief as he caused my women to suffer. Again the voices rose high, and the dispute and noise grew.  The Messenger of Allah (ﷺ) said: Do you not accept the blood-money Uyaynah? Uyaynah gave the same reply as before, and a man of Banu Layth called Mukaytil stood up. He had a weapon and a skin shield in his hand.  He said: I do not find in the beginning of Islam any illustration for what he has done except the one that \"some sheep came on, and those in the front were shot; hence those in the rear ran away\". (The other example is that) \"make a law today and change it.\"  The Messenger of Allah (ﷺ) said: Fifty (camels) here immediately and fifty when we return to Medina. This happened during some of his journeys. Muhallam was a tall man of dark complexion. He was with the people. They continued (to make effort for him) until he was released. He sat before the Messenger of Allah (ﷺ), with his eyes flowing.  He said: Messenger of Allah! I have done (the act) of which you have been informed. I repent to Allah, the Exalted, so ask Allah's forgiveness for me. Messenger of Allah!  The Messenger of Allah (ﷺ) then said: Did you kill him with your weapon at the beginning of Islam. O Allah! do not forgive Muhallam. He said these words loudly.  AbuSalamah added: He (Muhallam) then got up while he was wiping his tears with the end of his garment.  Ibn Ishaq said: His people alleged that the Messenger of Allah (ﷺ) asked forgiveness for him after that.Abu Dawud said: Al-Nadr b. Shumail said: al-ghiyar means blood-wit.",
      "chain": [
        "20040",
        "20022",
        "11107",
        "36063",
        "30296",
        "20029",
        "20509",
        "448",
        "20173"
      ]
    },
    {
      "hadith_no": "1561",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Military Expeditions - كتاب السير عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "21",
      "text_ar": "حدثني محمد بن بشار، حدثنا عبد الرحمن بن مهدي، حدثنا سفيان، عن عبد الرحمن بن الحارث، عن سليمان بن موسى، عن مكحول، عن أبي سلام، عن أبي أمامة، عن عبادة بن الصامت، أن النبي صلى الله عليه وسلم كان ينفل في البدأة الربع وفي القفول الثلث ‏.‏ وفي الباب عن سعد وابن عباس وحبيب بن مسلمة ومعن بن يزيد وابن عمر وسلمة بن الأكوع ‏.‏ وحديث عبادة حديث حسن ‏.‏ وقد روي هذا الحديث عن أبي سلام عن رجل من أصحاب النبي صلى الله عليه وسلم.",
      "text_en": " Narrated 'Ubadah bin As-Samit:                     \"The Prophet (ﷺ) used to confer a fourth of spoils of war in the early part of the expedition, and a third during the return.\"There are narrations on this topic from Ibn 'Abbas, Habib bin Maslamh, Ma'n bin Yazid, Ibn 'Umar, and Salamah bin Al-Akwa'. This Hadith of 'Ubadah is a Hasan Hadith. This Hadith has also been reported from Abu Salam from a man among the Companions of the Prophet (ﷺ).",
      "chain": [
        "30160",
        "20033",
        "20012",
        "448",
        "10880",
        "11066",
        "405",
        "40"
      ]
    },
    {
      "hadith_no": "2249",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Inheritance - كتاب الفرائض عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "29",
      "text_ar": "حدثنا بندار، حدثنا أبو أحمد الزبيري، حدثنا سفيان، عن عبد الرحمن بن الحارث، عن حكيم بن حكيم بن عباد بن حنيف، عن أبي أمامة بن سهل بن حنيف، قال كتب عمر بن الخطاب إلى أبي عبيدة أن رسول الله صلى الله عليه وسلم قال ‏\"‏ الله ورسوله مولى من لا مولى له والخال وارث من لا وارث له ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن عائشة والمقدام بن معديكرب ‏.‏ وهذا حديث حسن صحيح ‏.‏",
      "text_en": " Abu Umamah bin Sahl bin Hunaif said:                     \" 'Umar bin Al-Khattab sent me with a letter to Abu'Ubaidah (saying) that The Messenger of Allah(S.A.W) said : 'Allah and His Messenger are responsible for the one who has no patron. And the maternal uncle inherits from the one who has no heirs.'\"",
      "chain": [
        "30160",
        "20355",
        "20012",
        "448",
        "19803",
        "405"
      ]
    },
    {
      "hadith_no": "3566",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا يزيد بن هارون، أخبرنا حماد بن سلمة، عن هشام بن عمرو الفزاري، عن عبد الرحمن بن الحارث بن هشام، عن علي بن أبي طالب، أن النبي صلى الله عليه وسلم كان يقول في وتره ‏\"‏ اللهم إني أعوذ برضاك من سخطك وأعوذ بمعافاتك من عقوبتك وأعوذ بك منك لا أحصي ثناء عليك أنت كما أثنيت على نفسك ‏\"‏ ‏.‏ قال هذا حديث حسن غريب من حديث علي لا نعرفه إلا من هذا الوجه من حديث حماد بن سلمة ‏.‏",
      "text_en": " Ali bin Abi Talib narrated:                     that the Prophet used to say in his Witr: “O Allah, I seek refuge in your pardon from Your Punishment, and I seek refuge in You from You, I am not capable of extolling You as You have extolled Yourself (Allahumma Inni A’udhu Bi-Ridaka Min Sakhatika, Wa A’udhu Bi-Mu’afatika Min Uqubatika, Wa A’udhu Bika Minka La Uhsi Thana’an Alaika Anta Kama Athnaita Ala Nafsik).”",
      "chain": [
        "30242",
        "20472",
        "20021",
        "448",
        "5"
      ]
    },
    {
      "hadith_no": "1747",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا محمد بن عبد الله بن المبارك، قال حدثنا سليمان بن حرب، وهشام بن عبد الملك، قالا حدثنا حماد بن سلمة، عن هشام بن عمرو الفزاري، عن عبد الرحمن بن الحارث بن هشام، عن علي بن أبي طالب، أن النبي صلى الله عليه وسلم كان يقول في آخر وتره ‏\"‏ اللهم إني أعوذ برضاك من سخطك وبمعافاتك من عقوبتك وأعوذ بك منك لا أحصي ثناء عليك أنت كما أثنيت على نفسك ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ali bin Abi Talib that:                     The Prophet (ﷺ) used to say at the end of witr: Allahumma inni audhu bi ridaka min sakhatika wa bi mu'afatika min uqubatika, wa audhu bika minka la uhsi thana'an 'alayka, anta kama athwart ala nafsik ( O Allah, I seek refuge in Your pleasure from Your wrath and in Your forgiveness from Your punishment. And I seek refuge in You from You; I cannot praise You enough; You are as You have praised Yourself.).\"",
      "chain": [
        "20193",
        "20021",
        "448",
        "5"
      ]
    },
    {
      "hadith_no": "5666",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا سويد، قال أنبأنا عبد الله، عن معمر، عن الزهري، عن أبي بكر بن عبد الرحمن بن الحارث، عن أبيه، قال سمعت عثمان، رضى الله عنه يقول اجتنبوا الخمر فإنها أم الخبائث إنه كان رجل ممن خلا قبلكم تعبد فعلقته امرأة غوية فأرسلت إليه جاريتها فقالت له إنا ندعوك للشهادة فانطلق مع جاريتها فطفقت كلما دخل بابا أغلقته دونه حتى أفضى إلى امرأة وضيئة عندها غلام وباطية خمر فقالت إني والله ما دعوتك للشهادة ولكن دعوتك لتقع على أو تشرب من هذه الخمرة كأسا أو تقتل هذا الغلام ‏.‏ قال فاسقيني من هذا الخمر كأسا فسقته كأسا ‏.‏ قال زيدوني فلم يرم حتى وقع عليها وقتل النفس فاجتنبوا الخمر فإنها والله لا يجتمع الإيمان وإدمان الخمر إلا ليوشك أن يخرج أحدهما صاحبه ‏.‏",
      "text_en": " It was narrated from Abu Bakr bin 'Abdur-Rahman bin Al-Harith that his father said:                     \"I heard 'Uthman, may Allah be pleased with him, say: 'Avoid Khamr for it is the mother of all evils. There was a man among those who came before you who was a devoted worshipper. An immoral woman fell in love with him. She sent her slave girl to him, saying: We are calling you to bear witness. So he set out with her slave girl, and every time he entered a door, she locked it behind him, until he reached a beautiful woman who has with her a boy and a vessel of wine. She said: 'By Allah, I did not call you to bear witness, rather I called you to have intercourse with me, or to drink a cup of this wine, or to kill this boy.' He said: 'Pour me a cup of this wine.' So she poured him a cup. He said: 'Give me more.' And soon he had intercourse with her and killed the boy. So avoid Khamr, for by Allah faith and addiction to Khamr cannot coexist but, one of them will soon expel the other.\"",
      "chain": [
        "18",
        "20115",
        "11013",
        "11003",
        "448",
        "4"
      ]
    },
    {
      "hadith_no": "5667",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا سويد، قال أنبأنا عبد الله، - يعني ابن المبارك - عن يونس، عن الزهري، قال حدثني أبو بكر بن عبد الرحمن بن الحارث، أن أباه، قال سمعت عثمان، يقول اجتنبوا الخمر فإنها أم الخبائث فإنه كان رجل ممن خلا قبلكم يتعبد ويعتزل الناس فذكر مثله قال فاجتنبوا الخمر فإنه والله لا يجتمع والإيمان أبدا إلا يوشك أحدهما أن يخرج صاحبه ‏.‏",
      "text_en": " Abu Bakr bin 'Abdur-Rahman bin Al-Harith narrated that his father said:                     \"I heard 'Uthman say: 'Avoid Khamr for it is the mother of all evils. There was a man among those who came before you who was a devoted worshipper and used to stay away from people.'\" And he mentioned something similar. He said: \"Avoid Khamr for, by Allah, it can never coexist with Faith, but soon one of them will expel the other.\"",
      "chain": [
        "20025",
        "20475",
        "11013",
        "11003",
        "448",
        "4"
      ]
    },
    {
      "hadith_no": "2125",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Divorce - كتاب الطلاق",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو كريب، حدثنا هشيم، أنبأنا عامر الأحول، ح وحدثنا أبو كريب، حدثنا حاتم بن إسماعيل، عن عبد الرحمن بن الحارث، جميعا عن عمرو بن شعيب، عن أبيه، عن جده، ‏.‏ أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ لا طلاق فيما لا يملك ‏\"‏ ‏.‏",
      "text_en": " It was narrated from \"Amr bin Shu'aib, from his father, from his grandfather, that:                     the Messenger of Allah said : \"There is no divorce regarding that which one does not possess.\"",
      "chain": [
        "30216",
        "20468",
        "10693",
        "30216",
        "20159",
        "448",
        "19934",
        "19911"
      ]
    }
  ],
  "total_hadiths": 12
}