{
  "id": "449",
  "name": "Safwan bin Umayyah ( صفوان بن أمية بن خلف ( رضي الله عنه",
  "full_name": "Safwan bin Umayyah ( صفوان بن أمية بن خلف ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Makkah"
    },
    "death": {
      "date_hijri": "41",
      "date_gregorian": "661",
      "date_display": null,
      "place": "Makkah",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah",
      "Medinah"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ خت  م  4  -  صحابي ]"
    ],
    "tags": [
      "Quraish",
      "B.Jumah",
      "Late Muslim"
    ]
  },
  "parents": [],
  "spouses": [
    {
      "id": "80",
      "name": "Najiyah/'Atika/Fakhta bint al-Walid ( ناجية/عاتكة/فاختة بنت الوليد بن المغيرة ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "845",
      "name": "Umiama/Umayna bint Abi Sufyan ( أميمة بنت أبي سفيان بن حرب بن أمية ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "489",
      "name": "Barza bint Mad'ud ibn 'Amr al-Thaqafiyya ( برزة بنت مسعود بن عمرو الثقفي ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "494",
      "name": "al-Baghum bint al-Mu'adhil ( البغوم بنت المعذل ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "2352",
      "name": "Fakhta bint al-Aswad ( فاختة بنت الأسود بن المطلب ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "siblings": [
    {
      "id": "2400",
      "name": "Rabi'a bin Umayyah ( ربيعة بن أمية بن خلف ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "2401",
      "name": "Salamah bin Umayyah ( سلمة بن أمية بن خلف الجمحي ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "2402",
      "name": "Ahyah bin Umayyah ( أحيحة بن أمية بن خلف ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "2403",
      "name": "Mas'ud bin Umayyah ( مسعود بن أمية بن خلف الجمحي ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "2404",
      "name": "Muslim bin Umayyah ( مسلم بن أمية بن خلف الجمحي ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "2405",
      "name": "Ma'bad bin Umayyah ( معبد بن أمية بن خلف الجمحي ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "2450",
      "name": "al-Taw'ama bint Umayya ( التوأمة بنت أمية بن خلف ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "children": [
    {
      "id": "487",
      "name": "'Abdullah bin Safwan bin Umayyah ( عبد الله بن صفوان بن أمية ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "488",
      "name": "'Abdur Rahman bin Safwan bin Umayyah ( عبد الرحمن بن صفوان بن أمية الجمحي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "2409",
      "name": "Ya'la bin Safwan bin Umayyah ( يعلى بن صفوان بن أمية الجمحي ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "13005",
      "name": "Umayya bin Safwan bin Umayyah أمية بن صفوان بن أمية الجمحي",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "students": [
    {
      "id": "487",
      "name": "'Abdullah bin Safwan bin Umayyah ( عبد الله بن صفوان بن أمية ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "488",
      "name": "'Abdur Rahman bin Safwan bin Umayyah ( عبد الرحمن بن صفوان بن أمية الجمحي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "13005",
      "name": "Umayya bin Safwan bin Umayyah أمية بن صفوان بن أمية الجمحي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10920",
      "name": "Safwan bin 'Abdullah صفوان بن عبد الله بن صفوان بن أمية",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11002",
      "name": "Sa'id ibn al-Musayyib سعيد بن المسيب بن حزن أبو محمد القرشي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11029",
      "name": "'Ata' bin Abi Rabah عطاء بن أبي رباح",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11053",
      "name": "Tawus bin Kaysan طاوس",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11023",
      "name": "'Ikrama عكرمة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "13523",
      "name": "Tariq bin al-Marqa' Hijazi طارق بن المرقع حجازي",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sunan-abi-daud-3562",
      "hadith_no": "3562",
      "source": "Sunan Abi Da'ud",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا الحسن بن محمد، وسلمة بن شبيب، قالا حدثنا يزيد بن هارون، حدثنا شريك، عن عبد العزيز بن رفيع، عن أمية بن صفوان بن أمية، عن أبيه، أن رسول الله صلى الله عليه وسلم استعار منه أدراعا يوم حنين فقال أغصب يا محمد فقال ‏\"‏ لا بل عارية مضمونة ‏\"‏ ‏.‏ قال أبو داود وهذه رواية يزيد ببغداد وفي روايته بواسط تغير على غير هذا ‏.‏",
      "text_en": " Narrated Safwan ibn Umayyah:                     The Messenger of Allah (ﷺ) borrowed coats of mail from him on the day of (the battle of) Hunayn. He asked: Are you taking them by force. Muhammad? He replied: No, it is a loan with a guarantee of their return.Abu Dawud said: This tradition narrated by Yazid (b. Harun) at Baghdad. There is some change in the tradition narrated by him at Wasit, which is something different.",
      "usc_msa_ref": "",
      "chain": [
        "30245",
        "30417",
        "20472",
        "11858",
        "11257",
        "13005",
        "449"
      ]
    },
    {
      "id": "sunan-abi-daud-3779",
      "hadith_no": "3779",
      "source": "Sunan Abi Da'ud",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا ابن علية، عن عبد الرحمن بن إسحاق، عن عبد الرحمن بن معاوية، عن عثمان بن أبي سليمان، عن صفوان بن أمية، قال كنت آكل مع النبي صلى الله عليه وسلم فآخذ اللحم بيدي من العظم فقال ‏\"‏ أدن العظم من فيك فإنه أهنأ وأمرأ ‏\"‏ ‏.‏ قال أبو داود عثمان لم يسمع من صفوان وهو مرسل ‏.‏",
      "text_en": " Narrated Safwan ibn Umayyah:                     I was eating with the Prophet (ﷺ) and snatching the meat from the bone with my hand. He said: bring the bone near your mouth, for it is more beneficial and wholesome.Abu Dawud said: 'Uthman did not hear (traditions) from Safwan. This is a mursal tradition.",
      "usc_msa_ref": "",
      "chain": [
        "31167",
        "20208",
        "11876",
        "10649",
        "449"
      ]
    },
    {
      "id": "sunan-abi-daud-4394",
      "hadith_no": "4394",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا محمد بن يحيى بن فارس، حدثنا عمرو بن حماد بن طلحة، حدثنا أسباط، عن سماك بن حرب، عن حميد ابن أخت، صفوان عن صفوان بن أمية، قال كنت نائما في المسجد على خميصة لي ثمن ثلاثين درهما فجاء رجل فاختلسها مني فأخذ الرجل فأتي به رسول الله صلى الله عليه وسلم فأمر به ليقطع ‏.‏ قال فأتيته فقلت أنقطعه من أجل ثلاثين درهما أنا أبيعه وأنسئه ثمنها قال ‏\"‏ فهلا كان هذا قبل أن تأتيني به ‏\"‏ ‏.‏ قال أبو داود ورواه زائدة عن سماك عن جعيد بن جحير قال نام صفوان ‏.‏ ورواه مجاهد وطاوس أنه كان نائما فجاء سارق فسرق خميصة من تحت رأسه ‏.‏ ورواه أبو سلمة بن عبد الرحمن قال فاستله من تحت رأسه فاستيقظ فصاح به فأخذ ‏.‏ ورواه الزهري عن صفوان بن عبد الله قال فنام في المسجد وتوسد رداءه فجاءه سارق فأخذ رداءه فأخذ السارق فجيء به إلى النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Safwan bin Umayyah:                     I was sleeping in the mosque on a cloak mine whose price was thirty dirhams. A man came and pinched it away from me. The man was seized and brought to the Messenger of Allah (ﷺ). He ordered that his hand should be cut off. I came to him and said: Do you cut off only for thirty dirhams ? I sell it to him and make the payment of its price a loan ? He said: Why did you not do so before bringing him to me ?Abu Dawud said: Za'idah has also transmitted it from Simak from Ju'ayd ibn Hujayr. He said: Safwan slept. Mujahid and Tawus said: While he was sleeping a thief came and stole the cloak from beneath his head. The version of AbuSalamah ibn AbdurRahman has: He snatched it away from beneath his head and he awoke. He cried and he (the thief) was seized. Az-Zuhri narrated from Safwan ibn Abdullah. His version has: He slept in the mosque and used his cloak as pillow. A thief came and took his cloak. The thief was seized and brought to the Prophet (ﷺ).",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "30473",
        "10770",
        "449"
      ]
    },
    {
      "id": "jami-al-tirmidhi-666",
      "hadith_no": "666",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Zakat - كتاب الزكاة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "7",
      "text_ar": "حدثنا الحسن بن علي الخلال، حدثنا يحيى بن آدم، عن ابن المبارك، عن يونس بن يزيد، عن الزهري، عن سعيد بن المسيب، عن صفوان بن أمية، قال أعطاني رسول الله صلى الله عليه وسلم يوم حنين وإنه لأبغض الخلق إلى فما زال يعطيني حتى إنه لأحب الخلق إلى ‏.‏ قال أبو عيسى حدثني الحسن بن علي بهذا أو شبهه في المذاكرة ‏.‏ قال وفي الباب عن أبي سعيد ‏.‏ قال أبو عيسى حديث صفوان رواه معمر وغيره عن الزهري عن سعيد بن المسيب أن صفوان بن أمية قال أعطاني رسول الله صلى الله عليه وسلم ‏.‏ وكأن هذا الحديث أصح وأشبه إنما هو سعيد بن المسيب أن صفوان ‏.‏ وقد اختلف أهل العلم في إعطاء المؤلفة قلوبهم فرأى أكثر أهل العلم أن لا يعطوا ‏.‏ وقالوا إنما كانوا قوما على عهد النبي صلى الله عليه وسلم كان يتألفهم على الإسلام حتى أسلموا ‏.‏ ولم يروا أن يعطوا اليوم من الزكاة على مثل هذا المعنى وهو قول سفيان الثوري وأهل الكوفة وغيرهم وبه يقول أحمد وإسحاق ‏.‏ وقال بعضهم من كان اليوم على مثل حال هؤلاء ورأى الإمام أن يتألفهم على الإسلام فأعطاهم جاز ذلك ‏.‏ وهو قول الشافعي ‏.‏",
      "text_en": " Sa'eed bin Al-Musayyab narrated from Safwan bin Umayyah who said:                     \"The Messenger of Allah gave to me on the Day of Hunain, and he was the most hated creature to me. But he did not stop giving to me until he was the most loved creature to me.\"",
      "usc_msa_ref": "",
      "chain": [
        "30115",
        "20364",
        "20025",
        "20475",
        "11013",
        "11002",
        "449"
      ]
    },
    {
      "id": "sunan-an-nasai-2054",
      "hadith_no": "2054",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا يحيى، عن التيمي، عن أبي عثمان، عن عامر بن مالك، عن صفوان بن أمية، قال الطاعون والمبطون والغريق والنفساء شهادة ‏.‏ قال وحدثنا أبو عثمان مرارا ورفعه مرة إلى النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated that Safwan bin Umayyah said:                     \"The plague, abdominal illness, drowning and dying in childbirth are martyrdom.\" (One of the narrators) said: Abu 'Uthman narrated this to us several times, and on one occasion he attributed it to the Prophet.",
      "usc_msa_ref": "",
      "chain": [
        "30359",
        "20031",
        "11289",
        "11113",
        "449"
      ]
    },
    {
      "id": "sunan-an-nasai-4169",
      "hadith_no": "4169",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of al-Bay'ah - كتاب البيعة",
      "chapter_no": "39",
      "text_ar": "أخبرني محمد بن داود، قال حدثنا معلى بن أسد، قال حدثنا وهيب بن خالد، عن عبد الله بن طاوس، عن أبيه، عن صفوان بن أمية، قال قلت يا رسول الله إنهم يقولون إن الجنة لا يدخلها إلا مهاجر ‏.‏ قال ‏\"‏ لا هجرة بعد فتح مكة ولكن جهاد ونية فإذا استنفرتم فانفروا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Safwan bin Umayyah said:                     \"I said: 'O Messenger of Allah, they are saying that no one will enter Paradise except a Muhajir.\"' He said: \"There is no more emigration  (Hijrah) after the Conquest of Makkah, rather there is Jihad and intention. When you are called to moblize (for Jihad) then do so.\"",
      "usc_msa_ref": "",
      "chain": [
        "30457",
        "20299",
        "11433",
        "11053",
        "449"
      ]
    },
    {
      "id": "sunan-an-nasai-4878",
      "hadith_no": "4878",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرنا هلال بن العلاء، قال حدثني أبي قال، حدثنا يزيد بن زريع، عن سعيد، عن قتادة، عن عطاء، عن صفوان بن أمية، أن رجلا، سرق بردة له فرفعه إلى النبي صلى الله عليه وسلم فأمر بقطعه فقال يا رسول الله قد تجاوزت عنه ‏.‏ فقال ‏\"‏ أبا وهب أفلا كان قبل أن تأتينا به ‏\"‏ ‏.‏ فقطعه رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated from Safwan bin Umayyah, that:                     a man stole a Burdah of his, so he brought him before the Messenger of Allah, who ordered that his hand be cut off. He said: \"O Messenger of Allah, I will let him have it.\" He said: \"Abu Wahb! Why didn't you do that before you brought him to us?\" And the Messenger of Allah had (the man's) hand cut off.",
      "usc_msa_ref": "",
      "chain": [
        "38684",
        "28464",
        "20304",
        "11168",
        "11019",
        "11029",
        "449"
      ]
    },
    {
      "id": "sunan-an-nasai-4879",
      "hadith_no": "4879",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرني عبد الله بن أحمد بن محمد بن حنبل، قال حدثنا أبي قال، حدثنا محمد بن جعفر، قال حدثنا سعيد، عن قتادة، عن عطاء، عن طارق بن مرقع، عن صفوان بن أمية، أن رجلا، سرق بردة فرفعه إلى النبي صلى الله عليه وسلم فأمر بقطعه فقال يا رسول الله قد تجاوزت عنه ‏.‏ قال ‏\"‏ فلولا كان هذا قبل أن تأتيني به يا أبا وهب ‏\"‏ ‏.‏ فقطعه رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated from Safwan bin Umayyah that:                     a man stole his Burdah, so he brought him before the Prophet, who ordered that his hand be cut off. He said: \"O Messenger of Allah, I will let him have it.\" He said: \"O Abu Wahb! Why didn't you do that before you brought him to me?\" And the Messenger of Allah had (the man's) hand cut off.",
      "usc_msa_ref": "",
      "chain": [
        "20173",
        "11168",
        "11019",
        "11029",
        "449"
      ]
    },
    {
      "id": "sunan-an-nasai-4881",
      "hadith_no": "4881",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرني هلال بن العلاء، قال حدثنا حسين، قال حدثنا زهير، قال حدثنا عبد الملك، - هو ابن أبي بشير - قال حدثني عكرمة، عن صفوان بن أمية، أنه طاف بالبيت وصلى ثم لف رداء له من برد فوضعه تحت رأسه فنام فأتاه لص فاستله من تحت رأسه فأخذه فأتى به النبي صلى الله عليه وسلم فقال إن هذا سرق ردائي ‏.‏ فقال له النبي صلى الله عليه وسلم ‏\"‏ أسرقت رداء هذا ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ اذهبا به فاقطعا يده ‏\"‏ ‏.‏ قال صفوان ما كنت أريد أن تقطع يده في ردائي ‏.‏ فقال له ‏\"‏ فلو ما قبل هذا ‏\"‏ ‏.‏ خالفه أشعث بن سوار ‏.‏",
      "text_en": " It was narrated from Safwan bin Umayyah that:                     he circumambulated theKa'bah and prayed, then he rolled up a Rid' of his and placed it beneath his head, and slept. A thief came and slid it out from beneath his head and took it. He brought him to the Prophet and said: \"This man stole my Rida. The Prophet said to him: Did you steal this man's Rida?\" He said: \"Yes.\" He said: \"Take him away and cut his hand off.\" Safwan said: \"I* did not want to have his hand cut off for my Rida'.\" He said: \"Why (did you not say that) before now?\"",
      "usc_msa_ref": "",
      "chain": [
        "38684",
        "11278",
        "20321",
        "14253",
        "11023",
        "449"
      ]
    },
    {
      "id": "sunan-an-nasai-4883",
      "hadith_no": "4883",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرني أحمد بن عثمان بن حكيم، قال حدثنا عمرو، عن أسباط، عن سماك، عن حميد بن أخت، صفوان عن صفوان بن أمية، قال كنت نائما في المسجد على خميصة لي ثمنها ثلاثون درهما فجاء رجل فاختلسها مني فأخذ الرجل فأتي به النبي صلى الله عليه وسلم فأمر به ليقطع فأتيته فقلت أتقطعه من أجل ثلاثين درهما أنا أبيعه وأنسئه ثمنها ‏.‏ قال ‏\"‏ فهلا كان هذا قبل أن تأتيني به ‏\"‏ ‏.‏",
      "text_en": " It was knarrated that Safwan bin Umayyah said:                     \"I was sleeping in the Masjid on a Khmaishah of mine that was worth thirty dirhams, and a man came and stole it from me. The man was caught and taken to the Prophet, who ordered that his hand be cut off. I came to him and said: \"Will you cut off his hand for the sake of only thirty Dirhams? I will sell it to him on credit.\" He said:\" Why did you not say this before you brought him to me?\"",
      "usc_msa_ref": "",
      "chain": [
        "30185",
        "20377",
        "10770",
        "449"
      ]
    },
    {
      "id": "sunan-an-nasai-4884",
      "hadith_no": "4884",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرنا محمد بن عبد الله بن عبد الرحيم، قال حدثنا أسد بن موسى، قال حدثنا - وذكر، - حماد بن سلمة عن عمرو بن دينار، عن طاوس، عن صفوان بن أمية، أنه سرقت خميصته من تحت رأسه وهو نائم في مسجد النبي صلى الله عليه وسلم فأخذ اللص فجاء به إلى النبي صلى الله عليه وسلم فأمر بقطعه فقال صفوان أتقطعه قال ‏\"‏ فهلا قبل أن تأتيني به تركته ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Safwan bin Umayyah that:                     a Khamisah was stolen from beneath his head while he slept in the Masjid of the Prophet. He caught there thief and brought him to the Prophet, who ordered that his hand be cut off. Safwan said: \"Are you going to cut off his hand?\" He said \"Why didn't you let him go before you b brought him to me?\" (Daif)",
      "usc_msa_ref": "",
      "chain": [
        "28040",
        "20021",
        "11081",
        "11053",
        "449"
      ]
    },
    {
      "id": "sunan-ibn-majah-2693",
      "hadith_no": "2693",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا شبابة، عن مالك بن أنس، عن الزهري، عن عبد الله بن صفوان، عن أبيه، أنه نام في المسجد وتوسد رداءه فأخذ من تحت رأسه فجاء بسارقه إلى النبي صلى الله عليه وسلم فأمر به النبي صلى الله عليه وسلم أن يقطع فقال صفوان يا رسول الله لم أرد هذا ردائي عليه صدقة فقال رسول الله صلى الله عليه وسلم ‏\"‏ فهلا قبل أن تأتيني به ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abdullah bin Safwan that :                     his father slept in the mosque, using his upper wrap as a pillow, and it was taken from beneath his head. He brought the thief to the Prophet (ﷺ) and the Prophet (ﷺ) ordered that his hand be cut off. Safwan said: “O Messenger of Allah , (ﷺ) I did not want this! I give my upper wrap to him in charity.” The Messenger of Allah (ﷺ) said: “Why did you not give it to him before you brought him to me?”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20426",
        "20001",
        "11013",
        "487",
        "449"
      ]
    },
    {
      "id": "sunan-ibn-majah-2711",
      "hadith_no": "2711",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا الحسن بن أبي الربيع الجرجاني، أنبأنا عبد الرزاق، أخبرني يحيى بن العلاء، أنه سمع بشر بن نمير، أنه سمع مكحولا، يقول إنه سمع يزيد بن عبد الله، أنه سمع صفوان بن أمية، قال كنا عند رسول الله صلى الله عليه وسلم فجاء عمرو بن قرة فقال يا رسول الله إن الله قد كتب على الشقوة فما أراني أرزق إلا من دفي بكفي فأذن لي في الغناء في غير فاحشة ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا آذن لك ولا كرامة ولا نعمة عين كذبت أى عدو الله لقد رزقك الله طيبا حلالا فاخترت ما حرم الله عليك من رزقه مكان ما أحل الله عز وجل لك من حلاله ‏.‏ ولو كنت تقدمت إليك لفعلت بك وفعلت قم عني وتب إلى الله أما إنك إن فعلت بعد التقدمة إليك ضربتك ضربا وجيعا وحلقت رأسك مثلة ونفيتك من أهلك وأحللت سلبك نهبة لفتيان أهل المدينة ‏\"‏ ‏.‏ فقام عمرو وبه من الشر والخزى ما لا يعلمه إلا الله فلما ولى قال النبي صلى الله عليه وسلم ‏\"‏ هؤلاء العصاة من مات منهم بغير توبة حشره الله عز وجل يوم القيامة كما كان في الدنيا مخنثا عريانا لا يستتر من الناس بهدبة كلما قام صرع ‏\"‏ ‏.‏",
      "text_en": " Safwan bin Umayyah said:                     “We were with the Messenger of Allah (ﷺ) and Amr bin Murrah came and said: 'O Messenger of Allah (ﷺ), Allah (SWT) has decreed that I be doomed, and He has not guided me to earn a living except by beating my tambourine with my hand; give me permission to sing without doing anything immoral.' The Messenger of Allah (ﷺ) said: 'I will not give you permission, or honor you nor give you, what you want. You are lying, O enemy of Allah. Allah (SWT) has granted you a good, lawful provision, but you have chosen the provision that Allah (SWT) has forbidden to you instead of that which He has permitted. If I had warned you before, I would have done such and such to you. Get away from me and repent to Allah (SWT). If you do that again, after this warning, I will give you a painful beating and shave your head, to make an example of you, and I will banish you from among your people, and tell the young men of Al-Madinah to come and take your goods,'Amr stood up, suffering grief and humiliation that is known only to Allah (SWT).When he went away, the Prophet (ﷺ) said: 'Those sinners, whoever among them dies without having repented, Allah (SWT) will gather him on the Day of Resurrection just as he was in this world, effeminate and naked, with not even a piece of cloth to conceal him from the people. Every time he gets up, he will fall to the ground.'”",
      "usc_msa_ref": "",
      "chain": [
        "20121",
        "28635",
        "24039",
        "11066",
        "11318",
        "449"
      ]
    }
  ],
  "total_hadiths": 13
}