{
  "id": "45",
  "name": "Usaid bin Hudair bin Sammak ( أسيد بن الحضير بن سماك ( رضي الله عنه",
  "full_name": "Usaid bin Hudair bin Sammak ( أسيد بن الحضير بن سماك ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medinah"
    },
    "death": {
      "date_hijri": "20",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Medinah",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medinah"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Commander",
      "Narrator [ ع  -  صحابة ]"
    ],
    "tags": [
      "Ansar",
      "Aws",
      "B.'Abdul Ashhal",
      "Aqaba 2",
      "Aqaba Chief",
      "Uhud",
      "Khandaq"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "students": [
    {
      "id": "38",
      "name": "Abu Sa'id al-Khudri ( أبو سعيد سعد بن مالك بن سنان الخدري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "1937",
      "name": "Abu Layla ( أبو ليلى الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "390",
      "name": "Ka'b bin Malik bin Abi Ka'b ( كعب بن مالك بن أبى كعب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11196",
      "name": "'Abdur Rahman bin Abi Layla عبد الرحمن بن أبي ليلى",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11213",
      "name": "Muhammad bin Ibrahim bin al-Harith محمد بن إبراهيم بن الحارث",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "15097",
      "name": "Husayn bin 'Abdur Rahman al-Salmi حصين بن عبد الرحمن السلمي",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "3839",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، قال سمعت قتادة، عن أنس بن مالك، عن أسيد بن حضير، أن رجلا، من الأنصار قال يا رسول الله، ألا تستعملني كما استعملت فلانا قال ‏\"‏ ستلقون بعدي أثرة فاصبروا حتى تلقوني على الحوض ‏\"‏‏.‏",
      "text_en": " Narrated Usaid bin Hudair:                     A man from the Ansar said, \"O Allah's Apostle! Will you appoint me as you have appointed so-andso?\" The Prophet said, \"After me you will see others given preference to you; so be patient till you meet me at the Tank (i.e. Lake of Kauthar). (on the Day of Resurrection).",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11019",
        "19",
        "45"
      ]
    },
    {
      "hadith_no": "5070",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "وقال الليث حدثني يزيد بن الهاد، عن محمد بن إبراهيم، عن أسيد بن حضير، قال بينما هو يقرأ من الليل سورة البقرة وفرسه مربوط عنده إذ جالت الفرس فسكت فسكتت فقرأ فجالت الفرس، فسكت وسكتت الفرس ثم قرأ فجالت الفرس، فانصرف وكان ابنه يحيى قريبا منها فأشفق أن تصيبه فلما اجتره رفع رأسه إلى السماء حتى ما يراها فلما أصبح حدث النبي صلى الله عليه وسلم فقال ‏\"‏ اقرأ يا ابن حضير اقرأ يا ابن حضير ‏\"‏‏.‏ قال فأشفقت يا رسول الله أن تطأ يحيى وكان منها قريبا فرفعت رأسي فانصرفت إليه فرفعت رأسي إلى السماء فإذا مثل الظلة فيها أمثال المصابيح فخرجت حتى لا أراها‏.‏ قال ‏\"‏ وتدري ما ذاك ‏\"‏‏.‏ قال لا‏.‏ قال ‏\"‏ تلك الملائكة دنت لصوتك ولو قرأت لأصبحت ينظر الناس إليها لا تتوارى منهم ‏\"‏‏.‏ قال ابن الهاد وحدثني هذا الحديث عبد الله بن خباب عن أبي سعيد الخدري عن أسيد بن حضير‏.‏",
      "text_en": "      Narrated Usaid bin Hudair:                          That while he was reciting Surat Al-Baqara (The Cow) at night, and his     horse was tied beside him, the horse was suddenly startled and      troubled. When he stopped reciting, the horse became quiet, and when      he started again, the horse was startled again. Then he stopped      reciting and the horse became quiet too. He started reciting again and     the horse was startled and troubled once again. Then he stopped      reciting and his son, Yahya was beside the horse. He was afraid that      the horse might trample on him. When he took the boy away and looked      towards the sky, he could not see it. The next morning he informed the     Prophet who said, \"Recite, O Ibn Hudair! Recite, O Ibn Hudair!\" Ibn      Hudair replied, \"O Allah's Apostle! My son, Yahya was near the horse      and I was afraid that it might trample on him, so I looked towards the     sky, and went to him. When I looked at the sky, I saw something like a     cloud containing what looked like lamps, so I went out in order not to     see it.\" The Prophet said, \"Do you know what that was?\" Ibn Hudair      replied, \"No.\" The Prophet said, \"Those were Angels who came near to      you for your voice and if you had kept on reciting till dawn, it would     have remained there till morning when people would have seen it as it      would not have disappeared.",
      "chain": [
        "20023",
        "11234",
        "11213",
        "45"
      ]
    },
    {
      "hadith_no": "7144",
      "source": " Sahih Bukhari ",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا محمد بن عرعرة، حدثنا شعبة، عن قتادة، عن أنس بن مالك، عن أسيد بن حضير، أن رجلا، أتى النبي صلى الله عليه وسلم فقال يا رسول الله استعملت فلانا ولم تستعملني‏.‏ قال ‏\"‏ إنكم سترون بعدي أثرة، فاصبروا حتى تلقوني ‏\"‏‏.‏",
      "text_en": " Narrated Usaid bin Hudair:                     A man came to the Prophet and said, \"O Allah's Apostle! You appointed such-and-such person and you did not appoint me?\" The Prophet said, \"After me you will see rulers not giving you your right (but you should give them their right) and be patient till you meet me.\"",
      "chain": [
        "20282",
        "20020",
        "11019",
        "19",
        "45"
      ]
    },
    {
      "hadith_no": "1895",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني حسن بن علي الحلواني، وحجاج بن الشاعر، - وتقاربا في اللفظ - قالا حدثنا يعقوب بن إبراهيم، حدثنا أبي، حدثنا يزيد بن الهاد، أن عبد الله بن خباب، حدثه أن أبا سعيد الخدري حدثه أن أسيد بن حضير بينما هو ليلة يقرأ في مربده إذ جالت فرسه فقرأ ثم جالت أخرى فقرأ ثم جالت أيضا قال أسيد فخشيت أن تطأ يحيى فقمت إليها فإذا مثل الظلة فوق رأسي فيها أمثال السرج عرجت في الجو حتى ما أراها - قال - فغدوت على رسول الله صلى الله عليه وسلم فقلت يا رسول الله بينما أنا البارحة من جوف الليل أقرأ في مربدي إذ جالت فرسي ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ اقرإ ابن حضير ‏\"‏ ‏.‏ قال فقرأت ثم جالت أيضا ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ اقرإ ابن حضير ‏\"‏ ‏.‏ قال فقرأت ثم جالت أيضا ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ اقرإ ابن حضير ‏\"‏ ‏.‏ قال فانصرفت ‏.‏ وكان يحيى قريبا منها خشيت أن تطأه فرأيت مثل الظلة فيها أمثال السرج عرجت في الجو حتى ما أراها فقال رسول الله صلى الله عليه وسلم ‏\"‏ تلك الملائكة كانت تستمع لك ولو قرأت لأصبحت يراها الناس ما تستتر منهم ‏\"‏ ‏.‏",
      "text_en": " Abu Musa al-Ash'ari reported Allah's Messenger (may peace be upon him) as saying:                      A believer who recites the Qur'an is like an orange whose fragrance is sweet and whose taste is sweet; a believer who does not recite the Qur'an is like a date which has no fragrance but has a sweet taste; and the hypocrite who recites the Qur'an is like a basil whose fragrance is sweet, but whose taste is bitter; and a hypocrite who does not recite the Qur'an is like the colocynth which has no fragrance and has a bitter taste.",
      "chain": [
        "38834",
        "20184",
        "20150",
        "11234",
        "11182",
        "38",
        "45"
      ]
    },
    {
      "hadith_no": "4885",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد بن المثنى، ومحمد بن بشار، قالا حدثنا محمد بن جعفر، حدثنا شعبة، قال سمعت قتادة، يحدث عن أنس بن مالك، عن أسيد بن حضير، أن رجلا، من الأنصار خلا برسول الله صلى الله عليه وسلم فقال ألا تستعملني كما استعملت فلانا فقال ‏\"‏ إنكم ستلقون بعدي أثرة فاصبروا حتى تلقوني على الحوض ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Usaid b. Hudair that a man from the Ansar took the Messenger of Allah (may peace be upon him) aside and said to him:                      Will you not appoint me governor as you have appointed so and so? He (the Messenger of Allah) said: You will surely come across preferential treatment after me, so you should be patient until you meet me at the Cistern (Haud-i-Kauthar).",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "11019",
        "19",
        "45"
      ]
    },
    {
      "hadith_no": "4886",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثني يحيى بن حبيب الحارثي، حدثنا خالد، - يعني ابن الحارث - حدثنا شعبة بن الحجاج، عن قتادة، قال سمعت أنسا، يحدث عن أسيد بن حضير، أن رجلا، من الأنصار خلا برسول الله صلى الله عليه وسلم بمثله ‏.‏ وحدثنيه عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، بهذا الإسناد ولم يقل خلا برسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " This tradition has been narrated on the same authority through a different chain of transmitters. Another version of the tradition narrated on the authority of Shu'ba does not include the words:                     \" He took the Messenger of Allah (may peace be upon him) aside.\"",
      "chain": [
        "20226",
        "20020",
        "11019",
        "19",
        "45"
      ]
    },
    {
      "hadith_no": "607",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبدة بن عبد الله، أخبرنا زيد، - يعني ابن الحباب - عن محمد بن صالح، حدثني حصين، من ولد سعد بن معاذ عن أسيد بن حضير، أنه كان يؤمهم - قال - فجاء رسول الله صلى الله عليه وسلم يعوده فقالوا يا رسول الله إن إمامنا مريض ‏.‏ فقال ‏\"‏ إذا صلى قاعدا فصلوا قعودا ‏\"‏ ‏.‏ قال أبو داود هذا الحديث ليس بمتصل ‏.‏",
      "text_en": " Husain reported on the authority of the children of Sa’d b. Mu’adh that Usaid b. Hudair used to act as their Imam. (when he fell ill) the Messenger of Allah (ﷺ) came to him inquiring about his illness. They said:                      Messenger of Allah, our Imam is ill. He said : When he prays sitting, pray sitting.Abu Dawud said : The chain of this tradition is not continuous (muttasil)",
      "chain": [
        "30149",
        "20650",
        "45"
      ]
    },
    {
      "hadith_no": "5224",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا عمرو بن عون، أخبرنا خالد، عن حصين، عن عبد الرحمن بن أبي ليلى، عن أسيد بن حضير، - رجل من الأنصار - قال بينما هو يحدث القوم وكان فيه مزاح بينا يضحكهم فطعنه النبي صلى الله عليه وسلم في خاصرته بعود فقال أصبرني ‏.‏ فقال ‏\"‏ اصطبر ‏\"‏ ‏.‏ قال إن عليك قميصا وليس على قميص ‏.‏ فرفع النبي صلى الله عليه وسلم عن قميصه فاحتضنه وجعل يقبل كشحه قال إنما أردت هذا يا رسول الله ‏.‏",
      "text_en": " Narrated Usayd ibn Hudayr,:                     AbdurRahman ibn AbuLayla, quoting Usayd ibn Hudayr, a man of the Ansar, said that while he was given to jesting and was talking to the people and making them laugh, the Prophet (ﷺ) poked him under the ribs with a stick. He said: Let me take retaliation. He said: Take retaliation. He said: You are wearing a shirt but I am not. The Prophet (ﷺ) then raised his shirt and the man embraced him and began to kiss his side. Then he said: This is what I wanted, Messenger of Allah!",
      "chain": [
        "30154",
        "20423",
        "15097",
        "11196",
        "45"
      ]
    },
    {
      "hadith_no": "2189",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود، حدثنا شعبة، عن قتادة، حدثنا أنس بن مالك، عن أسيد بن حضير، أن رجلا، من الأنصار قال يا رسول الله استعملت فلانا ولم تستعملني ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إنكم سترون بعدي أثرة فاصبروا حتى تلقوني على الحوض ‏\"‏ ‏.‏ قال أبو عيسى وهذا حديث حسن صحيح ‏.‏",
      "text_en": " Usaid bin Hudair said:                     \"A man from Ansar said, 'O Messenger of Allah! You appointed so-and-so and did not appoint me. So, the Prophet(s.a.w) said, 'After me you will see preferential treatment, so be patient till you meet me at Al-Hawd.\"'",
      "chain": [
        "30277",
        "20547",
        "20020",
        "11019",
        "19",
        "45"
      ]
    },
    {
      "hadith_no": "4679",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرني هارون بن عبد الله، قال حدثنا حماد بن مسعدة، عن ابن جريج، عن عكرمة بن خالد، قال حدثني أسيد بن حضير بن سماك، أن رسول الله صلى الله عليه وسلم قضى أنه إذا وجدها في يد الرجل غير المتهم فإن شاء أخذها بما اشتراها وإن شاء اتبع سارقه وقضى بذلك أبو بكر وعمر ‏.‏",
      "text_en": " Usaid bin Hudair bin Simak narrated that:                     the Messenger of Allah ruled that if a man found (his goods) in the possession of a man who was not guilty, then if he wished he could give the man what he had paid for it, or if he wished he could go after the one who had stolen it. Abu Bakr and 'Umar passed similar judgments.",
      "chain": [
        "30524",
        "20224",
        "11070",
        "11709",
        "45"
      ]
    },
    {
      "hadith_no": "4680",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا عمرو بن منصور، قال حدثنا سعيد بن ذؤيب، قال حدثنا عبد الرزاق، عن ابن جريج، ولقد، أخبرني عكرمة بن خالد، أن أسيد بن حضير الأنصاري، ثم أحد بني حارثة أخبره أنه، كان عاملا على اليمامة وأن مروان كتب إليه أن معاوية كتب إليه أن أيما رجل سرق منه سرقة فهو أحق بها حيث وجدها ‏.‏ ثم كتب بذلك مروان إلى فكتبت إلى مروان أن النبي صلى الله عليه وسلم قضى بأنه إذا كان الذي ابتاعها من الذي سرقها غير متهم يخير سيدها فإن شاء أخذ الذي سرق منه بثمنها وإن شاء اتبع سارقه ثم قضى بذلك أبو بكر وعمر وعثمان فبعث مروان بكتابي إلى معاوية وكتب معاوية إلى مروان إنك لست أنت ولا أسيد تقضيان على ولكني أقضي فيما وليت عليكما فأنفذ لما أمرتك به ‏.‏ فبعث مروان بكتاب معاوية فقلت لا أقضي به ما وليت بما قال معاوية ‏.‏",
      "text_en": " Usaid bin Zubair Al-Ansari, who was one of Banu Harithah narrated that:                     there was the governor of Al-Yamamah, and Marwan wrote to him saying that Mu'awiyah had written to him, saying that any man who had something stolen from him had more right to it wherever he found it. Then Marwan wrote saying that to me (Usaid). I wrote to Marwan saying that the Prophet had ruled that if the one who bought it from the one who stole it is ot guilty of anything (and did not realize that it was stolen goods), then the owner has the choice: If he wishes, he may buy it from the one who bought it from the thief, or if he wishes he may go after the thief. Abu Bakr, 'Umar and 'Uthman also passed judgment along these lines. Marwan sent my letter to Mu'awiyah, and Mu'awiyah wrote to Marwan (saying): 'Neither you nor Usaid are in a position to tell me what to do, rather I am the one who tells you what to do because I am superior in rank to you, so do what I tell you.' Marwan sent the letter of Mu'awiyah to me, and I said: I will not judge according to Mu'awiyah's opinion as long as I am the governor.\"'",
      "chain": [
        "38433",
        "20121",
        "11070",
        "11709",
        "45"
      ]
    },
    {
      "hadith_no": "5383",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Etiquette of Judges - كتاب آداب القضاة",
      "chapter_no": "49",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا خالد، قال حدثنا شعبة، عن قتادة، قال سمعت أنسا، يحدث عن أسيد بن حضير، أن رجلا، من الأنصار جاء رسول الله صلى الله عليه وسلم فقال ألا تستعملني كما استعملت فلانا قال ‏\"‏ إنكم ستلقون بعدي أثرة فاصبروا حتى تلقوني على الحوض ‏\"‏‏.‏",
      "text_en": " It was narrated from Usaid bin Hudair that:                     A man from among the Ansar came to the Messenger of Allah [SAW] and said: \"Will you not appoint me as you appointed so-and-so?\" He said: \"You will encounter selfishness after I am gone, so be patient until you meet me at the cistern (Al-Hawd).\"",
      "chain": [
        "30449",
        "20423",
        "20020",
        "11019",
        "19",
        "45"
      ]
    },
    {
      "hadith_no": "535",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو إسحاق الهروي، إبراهيم بن عبد الله بن حاتم حدثنا عباد بن العوام، عن حجاج، عن عبد الله بن عبد الله، مولى بني هاشم - وكان ثقة وكان الحكم يأخذ عنه - حدثنا عبد الرحمن بن أبي ليلى عن أسيد بن حضير قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا توضئوا من ألبان الغنم وتوضئوا من ألبان الإبل ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Usaid bin Hudair said:                     \"The Messenger of Allah said: 'Do not perform ablution after (drinking) sheep's milk, but perform ablution after (drinking) camel's milk.'\"",
      "chain": [
        "20431",
        "20219",
        "11196",
        "45"
      ]
    }
  ],
  "total_hadiths": 13
}