{
  "id": "452",
  "name": "Hassan ibn Thabit ( حسان بن ثابت ( رضي الله عنه",
  "full_name": "Hassan ibn Thabit ( حسان بن ثابت ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medinah"
    },
    "death": {
      "date_hijri": "54",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Medinah",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medinah"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ خ  م  د  س  ق  -  صحابة ]",
      "Art/Poetry"
    ],
    "tags": [
      "Ansar",
      "Khazraj",
      "B.Malik B.al-Najjar",
      "Poet"
    ]
  },
  "parents": [
    {
      "id": "1243",
      "name": "Thabit b. al-Mandhur ( ثابت بن المنذر بن حرام ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "1454",
      "name": "al-Furay'a bint Khalid b. Khunays ( الفريعة بنت خالد بن خنيس بن لوذان ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "spouses": [
    {
      "id": "88",
      "name": "Sirin ( سيرين أم ولد حسان بن ثابت ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "siblings": [
    {
      "id": "351",
      "name": "Aus bin Thabit ( أوس بن ثابت بن المنذر ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "352",
      "name": "Abu Shaykh bin Thabit ( أبو شيخ , أبي بن ثابت ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "1244",
      "name": "'Abdur Rahman bin Thabit ( عبد الرحمن بن ثابت بن المنذر ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "1268",
      "name": "Kabsha bint bint Thabit ( كبشة بنت ثابت بن المنذر ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "1269",
      "name": "Lubna bint bint Thabit ( لبنى بنت ثابت بن المنذر ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "1245",
      "name": "Layla bint bint Thabit ( ليلى بنت ثابت بن المنذر ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "1246",
      "name": "Fari'a bint bint Thabit ( فارعة بنت ثابت بن المنذر ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "1247",
      "name": "Khawla bint Thabit ( خولة بنت ثابت بن المنذر ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "children": [
    {
      "id": "451",
      "name": "'Abdur Rahman bin Hassan ibn Thabit ( عبد الرحمن بن حسان بن ثابت ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "students": [
    {
      "id": "400",
      "name": "al-Bara' bin Azib bin al-Harith ( البراء بن عازب بن الحارث ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11002",
      "name": "Sa'id ibn al-Musayyib سعيد بن المسيب بن حزن أبو محمد القرشي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "10567",
      "name": "Abu Salama bin 'Abdur Rahman أبو سلمة بن عبد الرحمن بن عوف",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10990",
      "name": "Abu al-Hasan Mwla biny أبو الحسن مولى بني",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11006",
      "name": "Kharija ibn Zayd ibn Thabit خارجة بن زيد بن ثابت الأنصاري",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-453",
      "hadith_no": "453",
      "source": "Sahih Bukhari",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا أبو اليمان الحكم بن نافع، قال أخبرنا شعيب، عن الزهري، قال أخبرني أبو سلمة بن عبد الرحمن بن عوف، أنه سمع حسان بن ثابت الأنصاري، يستشهد أبا هريرة أنشدك الله هل سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ يا حسان، أجب عن رسول الله صلى الله عليه وسلم، اللهم أيده بروح القدس ‏\"‏‏.‏ قال أبو هريرة نعم‏.‏",
      "text_en": " Narrated Hassan bin Thabit Al-Ansari:                     I asked Abu Huraira \"By Allah! Tell me the truth whether you heard the Prophet saying, 'O Hassan! Reply on behalf of Allah's Apostle. O Allah! Help him with the Holy Spirit.\" Abu Huraira said, \"Yes . \"",
      "usc_msa_ref": "444",
      "chain": [
        "30330",
        "20428",
        "11013",
        "10567",
        "452"
      ]
    },
    {
      "id": "sahih-bukhari-6222",
      "hadith_no": "6222",
      "source": "Sahih Bukhari",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري،‏.‏ وحدثنا إسماعيل، قال حدثني أخي، عن سليمان، عن محمد بن أبي عتيق، عن ابن شهاب، عن أبي سلمة بن عبد الرحمن بن عوف، أنه سمع حسان بن ثابت الأنصاري، يستشهد أبا هريرة فيقول يا أبا هريرة نشدتك بالله هل سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ يا حسان أجب عن رسول الله، اللهم أيده بروح القدس ‏\"‏‏.‏ قال أبو هريرة نعم‏.‏",
      "text_en": " Narrated Abu Salama bin `Abdur-Rahman bin `Auf:                     that he heard Hassan bin Thabit Al-Ansari asking the witness of Abu Huraira, saying, \"O Abu- Huraira! I beseech you by Allah (to tell me). Did you hear Allah's Apostle saying' 'O Hassan ! Reply on behalf of Allah's Apostle. O Allah ! Support him (Hassan) with the Holy Spirit (Gabriel).'?\" Abu Huraira said, \"Yes.\"",
      "usc_msa_ref": "173",
      "chain": [
        "30330",
        "20428",
        "11013",
        "20208",
        "24131",
        "11005",
        "11013",
        "10567",
        "452"
      ]
    },
    {
      "id": "sahih-muslim-6541",
      "hadith_no": "6541",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن الدارمي، أخبرنا أبو اليمان، أخبرنا شعيب، عن  الزهري، أخبرني أبو سلمة بن عبد الرحمن، أنه سمع حسان بن ثابت الأنصاري، يستشهد أبا هريرة أنشدك الله هل سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ يا حسان أجب عن رسول الله صلى الله عليه وسلم اللهم أيده بروح القدس ‏\"‏ ‏.‏ قال أبو هريرة نعم ‏.‏",
      "text_en": " 'Abd al-Rahman reported that he heard Hassin b. Thabit al-Ansari call Abu Huraira to bear witness by saying:                      I adjure you by Allah if you had not heard Allah's Apostle (may peace be upon him) saying: Hassin, give a reply on behalf of the Messenger of Allah. O Allah, help him with Ruh-ul-Qudus. Abu Huraira said: Yes, it is so.",
      "usc_msa_ref": "",
      "chain": [
        "30025",
        "30330",
        "20428",
        "11013",
        "10567",
        "452"
      ]
    },
    {
      "id": "sahih-muslim-6544",
      "hadith_no": "6544",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا أبو أسامة، عن هشام، عن  أبيه، أن حسان بن ثابت، كان ممن كثر على عائشة فسببته فقالت يا ابن أختي دعه فإنه كان ينافح عن رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Hisham reported on the authority of his father that Hassan b. Thabit talked much about 'A'isha. I scolded him, whereupon she said:                      My nephew, leave him for he defended Allah's Messenger (may peace be upon him).",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30216",
        "20318",
        "11065",
        "10511",
        "452"
      ]
    },
    {
      "id": "sunan-ibn-majah-1641",
      "hadith_no": "1641",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو بشر قالا حدثنا قبيصة، ح وحدثنا أبو كريب، حدثنا عبيد بن سعيد، ح وحدثنا محمد بن خلف العسقلاني، حدثنا الفريابي، وقبيصة، كلهم عن سفيان، عن عبد الله بن عثمان بن خثيم، عن عبد الرحمن بن بهمان، عن عبد الرحمن بن حسان بن ثابت، عن أبيه، قال لعن رسول الله  صلى الله عليه وسلم  زوارات القبور ‏.‏",
      "text_en": " It wasnarrated from ‘Abdur-Rahman bin Hassan bin Thabit that hisfathersaid:                      “The Messenger of Allah (ﷺ) cursed women who visitgraves.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "11419",
        "20351",
        "30216",
        "20665",
        "38502",
        "20034",
        "20351",
        "20012",
        "10644",
        "12272",
        "451",
        "452"
      ]
    }
  ],
  "total_hadiths": 5
}