{
  "id": "464",
  "name": "Rabi'ah ibn Kab al-Aslami ( ربيعة بن كعب بن مالك الأسلمي ( رضي الله عنه",
  "full_name": "Rabi'ah ibn Kab al-Aslami ( ربيعة بن كعب بن مالك الأسلمي ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "63",
      "date_gregorian": "681",
      "date_display": null,
      "place": "Medinah",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah",
      "Medinah"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ بخ  م  4  -  صحابي ]"
    ],
    "tags": [
      "al-Aslami",
      "Early Muslim",
      "Servant",
      "Client"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "students": [
    {
      "id": "10567",
      "name": "Abu Salama bin 'Abdur Rahman أبو سلمة بن عبد الرحمن بن عوف",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11842",
      "name": "Hanzalah bin 'Ali bin al-Aslami حنظلة بن علي بن الأسقع",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11225",
      "name": "Na'eem bin 'Abdullah al-Majmar نعيم بن عبد الله المجمر",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-muslim-489-2",
      "hadith_no": "489",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا الحكم بن موسى أبو صالح، حدثنا هقل بن زياد، قال سمعت الأوزاعي، قال حدثني يحيى بن أبي كثير، حدثني أبو سلمة، حدثني ربيعة بن كعب الأسلمي، قال كنت أبيت مع رسول الله صلى الله عليه وسلم فأتيته بوضوئه وحاجته فقال لي ‏\"‏ سل ‏\"‏ ‏.‏ فقلت أسألك مرافقتك في الجنة ‏.‏ قال ‏\"‏ أوغير ذلك ‏\"‏ ‏.‏ قلت هو ذاك ‏.‏ قال ‏\"‏ فأعني على نفسك بكثرة السجود ‏\"‏ ‏.‏",
      "text_en": " Rabi'a b. Ka'b said:                      I was with Allah's Messenger (may peace be upon him) one night. and I brought him water and what he required. He said to me: Ask (anything you like). I said: I ask your company in Paradise. He (the Holy Prophet) said: Or anything else besides it. I said: That is all (what I require). He said: Then help me to achieve this for you by deyoting yourself often to prostration.",
      "usc_msa_ref": "",
      "chain": [
        "30502",
        "20641",
        "20024",
        "11449",
        "10567",
        "464"
      ]
    },
    {
      "id": "sunan-abi-daud-1320",
      "hadith_no": "1320",
      "source": "Sunan Abi Da'ud",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا هشام بن عمار، حدثنا الهقل بن زياد السكسكي، حدثنا الأوزاعي، عن يحيى بن أبي كثير، عن أبي سلمة، قال سمعت ربيعة بن كعب الأسلمي، يقول ‏:‏ كنت أبيت مع رسول الله صلى الله عليه وسلم آتيه بوضوئه وبحاجته، فقال ‏:‏ ‏\"‏ سلني ‏\"‏ ‏.‏ فقلت ‏:‏ مرافقتك في الجنة ‏.‏ قال ‏:‏ ‏\"‏ أوغير ذلك ‏\"‏ ‏.‏ قلت ‏:‏ هو ذاك ‏.‏ قال ‏:‏ ‏\"‏ فأعني على نفسك بكثرة السجود ‏\"‏ ‏.‏",
      "text_en": " Narrated Rab'iah b. Ka'b al-Aslami:                     I used to live with the Messenger of Allah (ﷺ) at night. I would bring water for his ablution and his need. He asked: Ask me. I said: Your company in Paradise. He said: Is there anything other than that ? I said: It is only that. He said: Help me for yourself by making prostrations abundantly.",
      "usc_msa_ref": "",
      "chain": [
        "30288",
        "20641",
        "20024",
        "11449",
        "10567",
        "464"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3416-2",
      "hadith_no": "3416",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا إسحاق بن منصور، أخبرنا النضر بن شميل، ووهب بن جرير، وأبو عامر العقدي وعبد الصمد بن عبد الوارث قالوا حدثنا هشام الدستوائي، عن يحيى بن أبي كثير، عن أبي سلمة، حدثني ربيعة بن كعب الأسلمي، قال كنت أبيت عند باب النبي صلى الله عليه وسلم فأعطيه وضوءه فأسمعه الهوي من الليل يقول ‏\"‏ سمع الله لمن حمده ‏\"‏ ‏.‏ وأسمعه الهوي من الليل يقول ‏\"‏ الحمد لله رب العالمين ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Rabi’ah bin Ka’b Al-Aslami said:                     “I used to spend the night at the door of the Prophet, so that I may give him his water for Wudu, and I would hear him, for a long period of the night, saying: ‘Allah hears the one who praise Him (Sami Allahu Liman Hamidah).’ And I would hear him, for a long period saying: ‘All praise is due to Allah, Lord of the all that exists. (Al-Hamdullilahi Rabbil-Alamin).’”",
      "usc_msa_ref": "",
      "chain": [
        "30313",
        "20291",
        "20298",
        "20443",
        "20295",
        "11449",
        "10567",
        "464"
      ]
    },
    {
      "id": "sunan-an-nasai-1138",
      "hadith_no": "1138",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا هشام بن عمار، عن هقل بن زياد الدمشقي، قال حدثنا الأوزاعي، قال حدثنا يحيى بن أبي كثير، عن أبي سلمة بن عبد الرحمن، قال حدثني ربيعة بن كعب الأسلمي، قال كنت آتي رسول الله صلى الله عليه وسلم بوضوئه وبحاجته فقال ‏\"‏ سلني ‏\"‏ ‏.‏ قلت مرافقتك في الجنة ‏.‏ قال ‏\"‏ أوغير ذلك ‏\"‏ ‏.‏ قلت هو ذاك قال ‏\"‏ فأعني على نفسك بكثرة السجود ‏\"‏ ‏.‏",
      "text_en": " Rabi'ah bin Ka'b Al-Aslami said:                     \"I used to bring to the Messenger of Allah (ﷺ) water for wudu and serve him. He said: 'Ask of me.' I said: 'I want to be with you in Paradise.' He said: 'Is there anything else?' I said: 'That is all.' He said: 'Help me to fulfill your wish by prostrating a great deal.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30288",
        "20641",
        "20024",
        "11449",
        "10567",
        "464"
      ]
    },
    {
      "id": "sunan-an-nasai-1618",
      "hadith_no": "1618",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا سويد بن نصر، قال أنبأنا عبد الله، عن معمر، والأوزاعي، عن يحيى بن أبي كثير، عن أبي سلمة، عن ربيعة بن كعب الأسلمي، قال كنت أبيت عند حجرة النبي صلى الله عليه وسلم فكنت أسمعه إذا قام من الليل يقول ‏\"‏ سبحان الله رب العالمين ‏\"‏ ‏.‏ الهوي ثم يقول ‏\"‏ سبحان الله وبحمده ‏\"‏ ‏.‏ الهوي ‏.‏",
      "text_en": " It was narrated that Rabi'ah bin Ka'b Al-Aslami said:                     \"I used to stay overnight at the Prophet's (ﷺ) apartment and I used to hear him when he prayed Qiyam at night saying: 'Subhan Allahi Rabil-Alamin (Glory be to Allah, the Lord of the worlds)' for a long time, then he said: 'Subhan Allah wa bi hamdih (Glory and praise be to Allah) for a long time.\"",
      "usc_msa_ref": "",
      "chain": [
        "38265",
        "20025",
        "20115",
        "20024",
        "11449",
        "10567",
        "464"
      ]
    },
    {
      "id": "sunan-ibn-majah-3879",
      "hadith_no": "3879",
      "source": "Sunan Ibn Majah",
      "chapter": "Supplication - كتاب الدعاء",
      "chapter_no": "34",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا معاوية بن هشام، أنبأنا شيبان، عن يحيى، عن أبي سلمة، أن ربيعة بن كعب الأسلمي، أخبره أنه، كان يبيت عند باب رسول الله  صلى الله عليه وسلم  وكان يسمع رسول الله  صلى الله عليه وسلم  يقول من الليل ‏\"‏ سبحان الله رب العالمين ‏\"‏ ‏.‏ الهوي ثم يقول ‏\"‏ سبحان الله وبحمده ‏\"‏ ‏.‏",
      "text_en": " Rabi’ah bin Ka’b Al-Aslami narrated that he used to spend the night outside the door of the Messenger of Allah (ﷺ), and he used to hear the Messenger of Allah (ﷺ) saying at night:                      “Subhan Allahi Rabbil-‘alamin (Glory is to Allah, the Lord of the worlds),” repeating that for a while, then he said: Subhan Allahi wa bihamdihi (Glory and praise is to Allah).”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20609",
        "20240",
        "11449",
        "10567",
        "464"
      ]
    }
  ],
  "total_hadiths": 6
}