{
  "id": "47",
  "name": "'Abdullah bin Zayd ( عبد الله بن زيد بن ثعلبة ( رضي الله عنه",
  "full_name": "'Abdullah bin Zayd ( عبد الله بن زيد بن ثعلبة ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medinah"
    },
    "death": {
      "date_hijri": "32",
      "date_gregorian": "654",
      "date_display": null,
      "place": "Madinah",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medinah"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ عخ  4  -  صحابي ]"
    ],
    "tags": [
      "Ansar",
      "Khazraj",
      "B.al-Harith B.al-Khazraj",
      "Aqaba 2",
      "Badr",
      "Uhud",
      "Khandaq"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [
    {
      "id": "283",
      "name": "Hurayth bin Zayd ( حريث بن زيد بن ثعلبة ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "296",
      "name": "Qurayba bint Zayd ( قريبة بنت زيد بن عبد ربه الأنصارية ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "children": [
    {
      "id": "10615",
      "name": "Muhammad bin 'Abdullah bin Zayd محمد بن عبد الله بن زيد بن عبد ربه",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "4",
      "name": "'Uthman ibn 'Affaan ( عثمان بن عفان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "10615",
      "name": "Muhammad bin 'Abdullah bin Zayd محمد بن عبد الله بن زيد بن عبد ربه",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "12245",
      "name": "'Abdullah bin Muh.b. 'Abdullah b. Zayd عبد الله بن محمد بن عبد الله بن زيد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11002",
      "name": "Sa'id ibn al-Musayyib سعيد بن المسيب بن حزن أبو محمد القرشي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11196",
      "name": "'Abdur Rahman bin Abi Layla عبد الرحمن بن أبي ليلى",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11239",
      "name": "Abu Bakr bin Muhammad bin 'Amr bin Hazm أبو بكر بن محمد بن عمرو بن حزم",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "jami-al-tirmidhi-189",
      "hadith_no": "189",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا سعيد بن يحيى بن سعيد الأموي، حدثنا أبي، حدثنا محمد بن إسحاق، عن محمد بن إبراهيم بن الحارث التيمي، عن محمد بن عبد الله بن زيد، عن أبيه، قال لما أصبحنا أتينا رسول الله صلى الله عليه وسلم فأخبرته بالرؤيا فقال ‏\"‏ إن هذه لرؤيا حق فقم مع بلال فإنه أندى وأمد صوتا منك فألق عليه ما قيل لك وليناد بذلك ‏\"‏ ‏.‏ قال فلما سمع عمر بن الخطاب نداء بلال بالصلاة خرج إلى رسول الله صلى الله عليه وسلم وهو يجر إزاره وهو يقول يا رسول الله والذي بعثك بالحق لقد رأيت مثل الذي قال ‏.‏ قال فقال رسول الله صلى الله عليه وسلم ‏\"‏ فلله الحمد فذلك أثبت ‏\"‏ ‏.‏ قال وفي الباب عن ابن عمر ‏.‏ قال أبو عيسى حديث عبد الله بن زيد حديث حسن صحيح ‏.‏ وقد روى هذا الحديث إبراهيم بن سعد عن محمد بن إسحاق أتم من هذا الحديث وأطول وذكر فيه قصة الأذان مثنى مثنى والإقامة مرة مرة ‏.‏ وعبد الله بن زيد هو ابن عبد ربه ويقال ابن عبد رب ولا نعرف له عن النبي صلى الله عليه وسلم شيئا يصح إلا هذا الحديث الواحد في الأذان ‏.‏ وعبد الله بن زيد بن عاصم المازني له أحاديث عن النبي صلى الله عليه وسلم وهو عم عباد بن تميم ‏.‏",
      "text_en": " Albdullah bin Zaid narrated:                     \"When we awoke, we went to Allah's Messenger to inform him of the dream. He said: 'Indeed this dream is true. So go to Bilal, for he has a better and louder voice than you. Convey to him what was said to you, so that he may call (to the prayer) with that.'\" He said: \"When Umar bin Al-Khattab heard Bilal calling for the prayer he went to Allah's Messenger, and he was dragging his Izar, (as he was hurrying) saying: 'O Allah's Messenger! By the One Who sent you with the truth! I dreamt the same as what he said.''' He said: \"So Allah's Messenger said: 'To Allah is the praise, so that confirms it even more.'''",
      "usc_msa_ref": "",
      "chain": [
        "30254",
        "20367",
        "11107",
        "11213",
        "10615",
        "47"
      ]
    },
    {
      "id": "sunan-ibn-majah-706-2",
      "hadith_no": "706",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Adhan and the Sunnah Regarding It - كتاب الأذان والسنة فيها",
      "chapter_no": "3",
      "text_ar": "حدثنا أبو عبيد، محمد بن عبيد بن ميمون المدني حدثنا محمد بن سلمة الحراني، حدثنا محمد بن إسحاق، حدثنا محمد بن إبراهيم التيمي، عن محمد بن عبد الله بن زيد، عن أبيه، قال كان رسول الله  صلى الله عليه وسلم  قد هم بالبوق وأمر بالناقوس فنحت فأري عبد الله بن زيد في المنام قال رأيت رجلا عليه ثوبان أخضران يحمل ناقوسا فقلت له يا عبد الله تبيع الناقوس قال وما تصنع به قلت أنادي به إلى الصلاة ‏.‏ قال أفلا أدلك على خير من ذلك قلت وما هو قال تقول الله أكبر الله أكبر الله أكبر الله أكبر أشهد أن لا إله إلا الله أشهد أن لا إله إلا الله أشهد أن محمدا رسول الله أشهد أن محمدا رسول الله حى على الصلاة حى على الصلاة حى على الفلاح حى على الفلاح ‏.‏ الله أكبر الله أكبر لا إله إلا الله ‏.‏ قال فخرج عبد الله بن زيد حتى أتى رسول الله  صلى الله عليه وسلم  فأخبره بما رأى ‏.‏ قال يا رسول الله رأيت رجلا عليه ثوبان أخضران يحمل ناقوسا ‏.‏ فقص عليه الخبر فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن صاحبكم قد رأى رؤيا فاخرج مع بلال إلى المسجد فألقها عليه وليناد بلال فإنه أندى صوتا منك ‏\"‏ ‏.‏ قال فخرجت مع بلال إلى المسجد فجعلت ألقيها عليه وهو ينادي بها ‏.‏ قال فسمع عمر بن الخطاب بالصوت فخرج فقال يا رسول الله والله لقد رأيت مثل الذي رأى ‏.‏ قال أبو عبيد فأخبرني أبو بكر الحكمي أن عبد الله بن زيد الأنصاري قال في ذلك أحمد الله ذا الجلال وذا الإكرام حمدا على الأذان كثيرا إذ أتاني به البشير من الله فأكرم به لدى بشيرا في ليال والى بهن ثلاث كلما جاء زادني توقيرا",
      "text_en": " It was narrated from Muhammed bin 'Abdullah bin Zaid that his father said that:                     The Messenger of Allah was thinking of a horn, and he commanded that a bell be made and it was done. Then 'Abdullah bin Zaid had a dream. He said: \"I saw a man wearing two green garments, carrying a bell. I said to him, 'O slave of Allah, will you sell the bell?' He said; 'What will you do with it?' I said, 'I will call (the people) to prayer.' He said, 'Shall I not tell you of something better than that?' I said, 'What is it?' he said, 'Say: Allahu Akbar Allahu Akbar, Allahu Akbar Allahu Akbar; Ash-hadu an la ilaha illallah, Ash-hadu an la ilaha illallah; Ash-hadu anna Muhammadan Rasulullah, Ash-hadu anna Muhammadan Rasulullah; Hayya 'alas-salah,  Hayya 'alas-salah; Hayya 'alal-falah, Hayya 'alal-falah;  Allahu Akbar Allahu Akbar; La ilaha illallah (Allah is The Most Great, Allah is The Most Great; Allah is The Most Great, Allah is The Most Great; I bear witness that none has the right to be worshipped but Allah, I bear witness that none has the right to be worshipped but Allah; I bear witness that Muhammed is the Messenger of Allah, I bear witness that Muhammed is the Messenger of Allah; Come to the Prayer, Come to the Prayer; Come to the prosperity, Come to the prosperity; Allah is the Most great, Allah is the Most Great; None has the right to be worshipped but Allah).\" 'Abdullah bin Zaid went out and came to the Messenger of Allah, and told him what he had seen. He said, \"O Messenger of Allah, I saw a man wearing two green garments carrying a bell,\" and he told him the story. The Messenger of Allah said, \"Your companion has had a dream. Go out with Bilal to the mosque and teach it to him, for he has a louder voice than you.\" I ('Abdullah) went out with Bilal to the mosque, and I started teaching him the words and he was calling them out. 'Umar Al-Khattab heard the voice and came out saying, \"O Messenger of Allah! By Allah, I saw the same (dream) as him.\" (Hasan)Abu 'Ubaid said: \"Abu Bakr Al-Hakami told me that 'Abdullah bin Zaid Al-Ansari said concerning that:'I praise Allah, the Possessor of majesty and honor,A great deal of praise for the Adhan.Since the news of it came to me from Allah,So due to it, I was honored by the information.During the three nights.Each of which increased me in honor.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "11107",
        "11213",
        "10615",
        "47"
      ]
    }
  ],
  "total_hadiths": 2
}