{
  "id": "479",
  "name": "Abu Rafi' ( أسلم أبو رافع مولى رسول الله ( رضي الله عنه",
  "full_name": "Abu Rafi' ( أسلم أبو رافع مولى رسول الله ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Makkah"
    },
    "death": {
      "date_hijri": "40",
      "date_gregorian": "660",
      "date_display": null,
      "place": "Kufa",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah",
      "Medinah",
      "Kufa"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ ع  -  صحابة ]"
    ],
    "tags": [
      "Client",
      "Freed Slave",
      "Uhud",
      "Khandaq",
      "Khaybar"
    ]
  },
  "parents": [],
  "spouses": [
    {
      "id": "171",
      "name": "Salma ( سلمى أم رافع امرأة أبي رافع ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "siblings": [],
  "children": [
    {
      "id": "11199",
      "name": "'Ubaidullah bin Abi Rafi' عبيد الله بن أبي رافع",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "3710",
      "name": "al-Mughira bin Abi Rafi' ( مغيرة بن أبي رافع ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "3711",
      "name": "'Ali bin Abi Rafi' ( علي بن أبي رافع ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "3712",
      "name": "al-Fadl bin Abi Rafi' ( الفضل بن أبي رافع ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "3713",
      "name": "al-Hasan bin Abi Rafi' ( الحسن بن أبي رافع ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "3714",
      "name": "Rafi' bin Abi Rafi' ( رافع بن أبي رافع ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "3715",
      "name": "Zaynab bint Abi Rafi' ( زينب بنت أبي رافع ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "5",
      "name": "Ali ibn Abi Talib ( علي بن أبي طالب بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "16",
      "name": "ibn Mas'ud ( عبد الله بن مسعود ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "3712",
      "name": "al-Fadl bin Abi Rafi' ( الفضل بن أبي رافع ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "3713",
      "name": "al-Hasan bin Abi Rafi' ( الحسن بن أبي رافع ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "3714",
      "name": "Rafi' bin Abi Rafi' ( رافع بن أبي رافع ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "11199",
      "name": "'Ubaidullah bin Abi Rafi' عبيد الله بن أبي رافع",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "3710",
      "name": "al-Mughira bin Abi Rafi' ( مغيرة بن أبي رافع ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "11045",
      "name": "'Ali bin al-Husain bin 'Ali علي بن الحسين بن علي - زين العابدين",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11212",
      "name": "Kaysan Abu Sa'id al-Muqbari كيسان أبو سعيد المقبري المدني",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11005",
      "name": "Sulayman ibn Yasar سليمان بن يسار مولى ميمونة بنت الحارث",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11020",
      "name": "'Ata ibn Yasar عطاء بن يسار أبو محمد مولى ميمونة",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "10952",
      "name": "'Amr bin al-Shryd عمرو بن الشريد",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "18197",
      "name": "Husayn Wald Da'ud حصين والد داود",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "16225",
      "name": "S'aid bin Abi S'aid Mwla سعيد بن أبي سعيد مولى أبي بكر",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "11101",
      "name": "Sharhbayl bin Sa'd شرحبيل بن سعد أبو سعد الخطمي",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-283",
      "hadith_no": "283",
      "source": "Sahih Bukhari",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا علي بن عبد الله، قال حدثنا يحيى، قال حدثنا حميد، قال حدثنا بكر، عن أبي رافع، عن أبي هريرة، أن النبي صلى الله عليه وسلم لقيه في بعض طريق المدينة وهو جنب، فانخنست منه، فذهب فاغتسل، ثم جاء فقال ‏\"‏ أين كنت يا أبا هريرة ‏\"‏‏.‏ قال كنت جنبا، فكرهت أن أجالسك وأنا على غير طهارة‏.‏ فقال ‏\"‏ سبحان الله، إن المؤمن لا ينجس ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet came across me in one of the streets of Medina and at that time I was Junub. So I slipped away from him and went to take a bath. On my return the Prophet said, \"O Abu Huraira! Where have you been?\" I replied, \"I was Junub, so I disliked to sit in your company.\" The Prophet said, \"Subhan Allah! A believer never becomes impure.\"",
      "usc_msa_ref": "281",
      "chain": [
        "30026",
        "20031",
        "11279",
        "11267",
        "479",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-285",
      "hadith_no": "285",
      "source": "Sahih Bukhari",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا عياش، قال حدثنا عبد الأعلى، حدثنا حميد، عن بكر، عن أبي رافع، عن أبي هريرة، قال لقيني رسول الله صلى الله عليه وسلم وأنا جنب، فأخذ بيدي، فمشيت معه حتى قعد فانسللت، فأتيت الرحل، فاغتسلت ثم جئت وهو قاعد فقال ‏\"‏ أين كنت يا أبا هر ‏\"‏ فقلت له‏.‏ فقال ‏\"‏ سبحان الله يا أبا هر إن المؤمن لا ينجس ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle came across me and I was Junub He took my hand and I went along with him till he sat down I slipped away, went home and took a bath. When I came back. he was still sitting there. He then said to me, \"O Abu Huraira! Where have you been?' I told him about it The Prophet said, \"Subhan Allah! O Abu Huraira! A believer never becomes impure.\"",
      "usc_msa_ref": "",
      "chain": [
        "30157",
        "20246",
        "11279",
        "11267",
        "479",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-291",
      "hadith_no": "291",
      "source": "Sahih Bukhari",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا معاذ بن فضالة، قال حدثنا هشام، ح وحدثنا أبو نعيم، عن هشام، عن قتادة، عن الحسن، عن أبي رافع، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا جلس بين شعبها الأربع ثم جهدها، فقد وجب الغسل ‏\"‏‏.‏ تابعه عمرو بن مرزوق عن شعبة مثله‏.‏ وقال موسى حدثنا أبان قال حدثنا قتادة أخبرنا الحسن مثله‏.‏",
      "text_en": " Narrated Hisham:                     as the following Hadith 290.Narrated Abu Huraira:The Prophet said, \"When a man sits in between the four parts of a woman and did the sexual intercourse with her, bath becomes compulsory.\"",
      "usc_msa_ref": "",
      "chain": [
        "30177",
        "20295",
        "20348",
        "20295",
        "11019",
        "11016",
        "479",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-458",
      "hadith_no": "458",
      "source": "Sahih Bukhari",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا حماد بن زيد، عن ثابت، عن أبي رافع، عن أبي هريرة، أن رجلا، أسود  أو امرأة سوداء  كان يقم المسجد، فمات، فسأل النبي صلى الله عليه وسلم عنه فقالوا مات‏.‏ قال ‏\"‏ أفلا كنتم آذنتموني به دلوني على قبره ‏\"‏‏.‏  أو قال قبرها  فأتى قبره فصلى عليه‏.‏",
      "text_en": " Narrated Abu Huraira:                     A black man or a black woman used to sweep the mosque and he or she died. The Prophet asked about her (or him). He was told that she (or he) had died. He said, \"Why did you not inform me? Show me his grave (or her grave).\" So he went to her (his) grave and offered her (his) funeral prayer.\"",
      "usc_msa_ref": "448",
      "chain": [
        "20193",
        "20022",
        "11269",
        "479",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-460",
      "hadith_no": "460",
      "source": "Sahih Bukhari",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا أحمد بن واقد، قال حدثنا حماد، عن ثابت، عن أبي رافع، عن أبي هريرة، أن امرأة  أو رجلا  كانت تقم المسجد  ولا أراه إلا امرأة  فذكر حديث النبي صلى الله عليه وسلم أنه صلى على قبره‏.‏",
      "text_en": "      Narrated Abu Rafi:                          Abu Huraira said, \"A man or a woman used to clean the mosque.\" (A      sub-narrator said, 'Most probably a woman..') Then he narrated the      Hadith of the Prophet",
      "usc_msa_ref": "450",
      "chain": [
        "20022",
        "11269",
        "479",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-766",
      "hadith_no": "766",
      "source": "Sahih Bukhari",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو النعمان، قال حدثنا معتمر، عن أبيه، عن بكر، عن أبي رافع، قال صليت مع أبي هريرة العتمة فقرأ ‏{‏إذا السماء انشقت‏}‏ فسجد فقلت له قال سجدت خلف أبي القاسم صلى الله عليه وسلم فلا أزال أسجد بها حتى ألقاه‏.‏",
      "text_en": " Narrated Abu Rafi`:                     I offered the `Isha' prayer behind Abu Huraira and he recited, \"Idha s-samaa'u n-shaqqat\" (84) and prostrated. On my inquiring, he said, \"I prostrated behind Abul-Qasim (the Prophet) (when he recited that Sura) and I will go on doing it till I meet him.\"",
      "usc_msa_ref": "",
      "chain": [
        "20283",
        "20288",
        "11289",
        "11267",
        "479"
      ]
    },
    {
      "id": "sahih-bukhari-768",
      "hadith_no": "768",
      "source": "Sahih Bukhari",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا مسدد، قال حدثنا يزيد بن زريع، قال حدثني التيمي، عن بكر، عن أبي رافع، قال صليت مع أبي هريرة العتمة فقرأ ‏{‏إذا السماء انشقت‏}‏ فسجد فقلت ما هذه قال سجدت بها خلف أبي القاسم صلى الله عليه وسلم فلا أزال أسجد بها حتى ألقاه‏.‏",
      "text_en": " Narrated Abu Rafi`:                     Once I prayed the `Isha' prayer with Abu Huraira and he recited, \"Idha s-samaa'u n-shaqqat\" (84) and prostrated. I said, \"What is that?\" He said, \"I prostrated behind Abul-Qasim, (the Prophet) (when he recited that Sura) and I will go on doing it till I meet him.\"",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20304",
        "11289",
        "11267",
        "479"
      ]
    },
    {
      "id": "sahih-bukhari-1078",
      "hadith_no": "1078",
      "source": "Sahih Bukhari",
      "chapter": "Prostration During Recital of Qur'an - كتاب سجود القرآن",
      "chapter_no": "17",
      "text_ar": "حدثنا مسدد، قال حدثنا معتمر، قال سمعت أبي قال، حدثني بكر، عن أبي رافع، قال صليت مع أبي هريرة العتمة فقرأ ‏{‏إذا السماء انشقت‏}‏ فسجد فقلت ما هذه قال سجدت بها خلف أبي القاسم صلى الله عليه وسلم فلا أزال أسجد فيها حتى ألقاه‏.‏",
      "text_en": " Narrated Abu Rafi`:                     I offered the `Isha' prayer behind Abu Huraira and he recited Idhas-Sama' Un-Shaqqat, and prostrated. I said, \"What is this?\" Abu Huraira said, \"I prostrated behind Abul-Qasim and I will do the same till I meet him.\"",
      "usc_msa_ref": "184",
      "chain": [
        "30175",
        "20288",
        "11289",
        "11267",
        "479"
      ]
    },
    {
      "id": "sahih-bukhari-1337",
      "hadith_no": "1337",
      "source": "Sahih Bukhari",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن الفضل، حدثنا حماد بن زيد، عن ثابت، عن أبي رافع، عن أبي هريرة  رضى الله عنه  أن أسود  رجلا أو امرأة  كان يقم المسجد فمات، ولم يعلم النبي صلى الله عليه وسلم بموته فذكره ذات يوم فقال ‏\"‏ ما فعل ذلك الإنسان ‏\"‏‏.‏ قالوا مات يا رسول الله‏.‏ قال ‏\"‏ أفلا آذنتموني ‏\"‏‏.‏ فقالوا إنه كان كذا وكذا قصته‏.‏ قال فحقروا شأنه‏.‏ قال ‏\"‏ فدلوني على قبره ‏\"‏‏.‏ فأتى قبره فصلى عليه‏.‏",
      "text_en": " Narrated Abu Huraira:                     A black person, a male or a female used to clean the Mosque and then died. The Prophet (p.b.u.h) did not know about it . One day the Prophet remembered him and said, \"What happened to that person?\" The people replied, \"O Allah's Apostle! He died.\" He said, \"Why did you not inform me?\" They said, \"His story was so and so (i.e. regarded him as insignificant).\" He said, \"Show me his grave.\" He then went to his grave and offered the funeral prayer.",
      "usc_msa_ref": "421",
      "chain": [
        "20283",
        "20022",
        "11269",
        "479",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-6263",
      "hadith_no": "6263",
      "source": "Sahih Bukhari",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا صدقة بن الفضل، أخبرنا محمد بن جعفر، عن شعبة، عن عطاء بن أبي ميمونة، عن أبي رافع، عن أبي هريرة، أن زينب، كان اسمها برة، فقيل تزكي نفسها‏.‏ فسماها رسول الله صلى الله عليه وسلم زينب‏.‏",
      "text_en": " Narrated Abu Huraira:                     Zainab's original name was \"Barrah,\" but it was said' \"By that she is giving herself the prestige of piety.\" So the Prophet changed her name to Zainab.",
      "usc_msa_ref": "212",
      "chain": [
        "30343",
        "20173",
        "20020",
        "11601",
        "479",
        "13",
        "57"
      ]
    },
    {
      "id": "sahih-bukhari-6318",
      "hadith_no": "6318",
      "source": "Sahih Bukhari",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "قال سعيد عن قتادة، عن أبي رافع، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ هو إذنه ‏\"‏‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "11168",
        "11019",
        "479",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-7064",
      "hadith_no": "7064",
      "source": "Sahih Bukhari",
      "chapter": "Tricks - كتاب الحيل",
      "chapter_no": "91",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن إبراهيم بن ميسرة، عن عمرو بن الشريد، عن أبي رافع، أن سعدا، ساومه بيتا بأربعمائة مثقال فقال لولا أني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ الجار أحق بصقبه ‏\"‏‏.‏ لما أعطيتك‏.‏ وقال بعض الناس إن اشترى نصيب دار، فأراد أن يبطل الشفعة، وهب لابنه الصغير ولا يكون عليه يمين‏.‏",
      "text_en": "      Narrated 'Amr bin Ash-Sharid:                     Abu Rafi' said that Sa'd offered him      four hundred Mithqal of gold for a house. Abu Rafi ' said, \"If I had      not heard Allah's Apostle saying, 'A neighbor has more right to be      taken care of by his neighbor,' then I would not have given it to      you.\" Some people said, \"If one has bought a portion of a house and      wants to cancel the right of preemption, he may give it as a present      to his little son and he will not be obliged to take an oath.\"",
      "usc_msa_ref": "",
      "chain": [
        "30388",
        "20005",
        "11240",
        "10952",
        "479"
      ]
    },
    {
      "id": "sahih-bukhari-7066",
      "hadith_no": "7066",
      "source": "Sahih Bukhari",
      "chapter": "Tricks - كتاب الحيل",
      "chapter_no": "91",
      "text_ar": "حدثنا أبو نعيم، حدثنا سفيان، عن إبراهيم بن ميسرة، عن عمرو بن الشريد، عن أبي رافع، قال قال النبي صلى الله عليه وسلم ‏\"‏ الجار أحق بصقبه ‏\"‏‏.‏ وقال بعض الناس إن اشترى دارا بعشرين ألف درهم، فلا بأس أن يحتال حتى يشتري الدار بعشرين ألف درهم، وينقده تسعة آلاف درهم وتسعمائة درهم وتسعة وتسعين، وينقده دينارا بما بقي من العشرين الألف، فإن طلب الشفيع أخذها بعشرين ألف درهم، وإلا فلا سبيل له على الدار، فإن استحقت الدار، رجع المشتري على البائع بما دفع إليه، وهو تسعة آلاف درهم وتسعمائة وتسعة وتسعون درهما ودينار، لأن البيع حين استحق انتقض الصرف في الدينار، فإن وجد بهذه الدار عيبا ولم تستحق، فإنه يردها عليه بعشرين ألف درهم‏.‏ قال فأجاز هذا الخداع بين المسلمين وقال النبي صلى الله عليه وسلم ‏\"‏ لا داء ولا خبثة ولا غائلة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Rafi`:                     The Prophet said, \"The neighbor has more right to be taken care of by his neighbor (than anyone else).\" Some men said, \"If one wants to buy a house for 20,000 Dirhams then there is no harm to play a trick to deprive somebody of preemption by buying it (just on paper) with 20,000 Dirhams but paying to the seller only 9,999 Dirhams in cash and then agree with the seller to pay only one Dinar in cash for the rest of the price (i.e. 10,001 Dirhams). If the preemptor offers 20,000 Dirhams for the house, he can buy it otherwise he has no right to buy it (by this trick he got out of preemption). If the house proves to belong to somebody else other than the seller, the buyer should take back from the seller what he has paid, i.e., 9,999 Dirhams and one Dinar, because if the house proves to belong to somebody else, so the whole bargain (deal) is unlawful. If the buyer finds a defect in the house and it does not belong to somebody other than the seller, the buyer may return it and receive 20,000 Dirhams (instead of 9999 Dirham plus one Dinar) which he actually paid.' Abu `Abdullah said, \"So that man allows (some people) the playing of tricks amongst the Muslims (although) the Prophet said, 'In dealing with Muslims one should not sell them sick (animals) or bad things or stolen things.\"",
      "usc_msa_ref": "109",
      "chain": [
        "20348",
        "20012",
        "11240",
        "10952",
        "479"
      ]
    },
    {
      "id": "sahih-bukhari-7648",
      "hadith_no": "7648",
      "source": "Sahih Bukhari",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "وقال لي خليفة بن خياط حدثنا معتمر، سمعت أبي، عن قتادة، عن أبي رافع، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لما قضى الله الخلق كتب كتابا عنده غلبت  أو قال سبقت  رحمتي غضبي‏.‏ فهو عنده فوق العرش ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     I heard Allah's Apostle saying, \"Before Allah created the creations, He wrote a Book (wherein He has written): My Mercy has preceded my Anger.\" and that (Book) is written with Him over the Throne.\"",
      "usc_msa_ref": "643",
      "chain": [
        "30132",
        "20288",
        "11289",
        "11019",
        "479",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-188",
      "hadith_no": "188",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثني عمرو الناقد، وأبو بكر بن النضر وعبد بن حميد - واللفظ لعبد - قالوا حدثنا يعقوب بن إبراهيم بن سعد، قال حدثني أبي، عن صالح بن كيسان، عن الحارث، عن جعفر بن عبد الله بن الحكم، عن عبد الرحمن بن المسور، عن أبي رافع، عن عبد الله بن مسعود، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ما من نبي بعثه الله في أمة قبلي إلا كان له من أمته حواريون وأصحاب يأخذون بسنته ويقتدون بأمره ثم إنها تخلف من بعدهم خلوف يقولون ما لا يفعلون ويفعلون ما لا يؤمرون فمن جاهدهم بيده فهو مؤمن ومن جاهدهم بلسانه فهو مؤمن ومن جاهدهم بقلبه فهو مؤمن وليس وراء ذلك من الإيمان حبة خردل ‏\"‏ ‏.‏ قال أبو رافع فحدثته عبد الله بن عمر فأنكره على فقدم ابن مسعود فنزل بقناة فاستتبعني إليه عبد الله بن عمر يعوده فانطلقت معه فلما جلسنا سألت ابن مسعود عن هذا الحديث فحدثنيه كما حدثته ابن عمر ‏.‏ قال صالح وقد تحدث بنحو ذلك عن أبي رافع ‏.‏",
      "text_en": " It is narrated on the authority 'Abdullah b. Mas'ud that the Messenger of Allah (may peace and blessings be upon him) observed:                      Never a Prophet had been sent before me by Allah towards his nation who had not among his people (his) disciples and companions who followed his ways and obeyed his command. Then there came after them their successors who said whatever they did not practise, and practised whatever they were not commanded to do. He who strove against them with his hand was a believer: he who strove against them with his tongue was a believer, and he who strove against them with his heart was a believer and beyond that there is no faith even to the extent of a mustard seed. Abu Rafi' said: I narrated this hadith to 'Abdullah b. 'Umar; he contradicted me. There happened to come 'Abdullah b. Mas'ud who stayed at Qanat, and 'Abdullah b 'Umar wanted me to accompany him for visiting him (as 'Abdullah b. Mas'ud was ailing), so I went along with him and as we sat (before him) I asked Ibn Mas'ud about this hadith. He narrated it in the same way as I narrated it to Ibn 'Umar.",
      "usc_msa_ref": "",
      "chain": [
        "30263",
        "20184",
        "20150",
        "11176",
        "11833",
        "479",
        "16"
      ]
    },
    {
      "id": "sahih-muslim-348-2",
      "hadith_no": "348",
      "source": "Sahih Muslim",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثني زهير بن حرب، وأبو غسان المسمعي ح وحدثناه محمد بن المثنى، وابن، بشار قالوا حدثنا معاذ بن هشام، قال حدثني أبي، عن قتادة، ومطر، عن الحسن، عن أبي رافع، عن أبي هريرة، أن نبي الله صلى الله عليه وسلم قال ‏\"‏ إذا جلس بين شعبها الأربع ثم جهدها فقد وجب عليه الغسل ‏\"‏ ‏.‏ وفي حديث مطر ‏\"‏ وإن لم ينزل ‏\"‏ ‏.‏ قال زهير من بينهم ‏\"‏ بين أشعبها الأربع ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      The Apostle of Allah (may peace be upon him) said: When a man has sexual intercourse, bathing becomes obligatory (both for the male and the female). In the hadith of Matar the words are: Even if there is no orgasm. Zuhair has narrated it with a minor alteration of words.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "30456",
        "30170",
        "30160",
        "20287",
        "20295",
        "11019",
        "11016",
        "479",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-357-2",
      "hadith_no": "357",
      "source": "Sahih Muslim",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "قال عمرو حدثني سعيد بن أبي هلال، عن عبد الله بن عبيد الله بن أبي رافع، عن أبي غطفان، عن أبي رافع، قال أشهد لكنت أشوي لرسول الله صلى الله عليه وسلم بطن الشاة ثم صلى ولم يتوضأ ‏.‏",
      "text_en": " Abu Rafi' reported:                      I testify that I used to roast the liver of the goat for the Messenger of Allah (may peace be tipcn him) and then he offered praver but did not perform ablution.",
      "usc_msa_ref": "",
      "chain": [
        "20377",
        "11169",
        "11869",
        "479"
      ]
    },
    {
      "id": "sahih-muslim-371-2",
      "hadith_no": "371",
      "source": "Sahih Muslim",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثني زهير بن حرب، حدثنا يحيى، - يعني ابن سعيد - قال حميد حدثنا ح، وحدثنا أبو بكر بن أبي شيبة، - واللفظ له - حدثنا إسماعيل ابن علية، عن حميد الطويل، عن أبي رافع، عن أبي هريرة، أنه لقيه النبي صلى الله عليه وسلم في طريق من طرق المدينة وهو جنب فانسل فذهب فاغتسل فتفقده النبي صلى الله عليه وسلم فلما جاءه قال ‏\"‏ أين كنت يا أبا هريرة ‏\"‏ ‏.‏ قال يا رسول الله لقيتني وأنا جنب فكرهت أن أجالسك حتى أغتسل ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ سبحان الله إن المؤمن لا ينجس ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported that he met the Apostle of Allah (may peace be upon him) on one of the paths leading to Medina in a state of (sexual) defilement and he slipped away and took a bath. The Apostle of Allah (may peace be upon him) searched for him and when he came, he said to him:                      0 Abu Huraira, where were you? He said: Messenger of Allah, you met when I was (sexually) defiled and I did not like to sit in your company before taking a bath. Upon this the Messenger of Allah (may peace be upon him) said: Hallowed be Allah, verily a believer is never defiled.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "20031",
        "11279",
        "20208",
        "11279",
        "479",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-439-2",
      "hadith_no": "439",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا إبراهيم بن دينار، ومحمد بن حرب الواسطي، قالا حدثنا عمرو بن الهيثم أبو قطن، حدثنا شعبة، عن قتادة، عن خلاس، عن أبي رافع، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لو تعلمون - أو يعلمون - ما في الصف المقدم لكانت قرعة ‏\"‏ ‏.‏ وقال ابن حرب ‏\"‏ الصف الأول ما كانت إلا قرعة ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      The Messenger of Allah (may peace be upon him) said: If you were to know, or if they were to know, what (excellence) lies in the first rows, there would have been drawing of lots (for filling them) ; and Ibn Harb said: For (occupying) the first row there would have been drawing of lots.",
      "usc_msa_ref": "",
      "chain": [
        "30496",
        "30373",
        "20020",
        "11019",
        "11283",
        "479",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-1256",
      "hadith_no": "1256",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، جميعا عن ابن علية، قال زهير حدثنا ابن علية، عن القاسم بن مهران، عن أبي رافع، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم رأى نخامة في قبلة المسجد فأقبل على الناس فقال ‏\"‏ ما بال أحدكم يقوم مستقبل ربه فيتنخع أمامه أيحب أحدكم أن يستقبل فيتنخع في وجهه فإذا تنخع أحدكم فليتنخع عن يساره تحت قدمه فإن لم يجد فليقل هكذا ‏\"‏ ‏.‏ ووصف القاسم فتفل في ثوبه ثم مسح بعضه على بعض ‏.‏",
      "text_en": " Abu Huraira reported that the Messenger of Allah (may peace be upon him) saw some sputum in the direction of the Qibla of the mosque. He turned towards people and said:                      How Is it that someone amongst you stands before his Lord and then spits out in front of Him? Does any one of you like that he should be made to stand in front of someone and then spit at his face? So when any one of you spits, he must spit on his left side under his foot. But if he does not find (space to spit) he should do like this. Qasim (one of the narrators) spat in his cloth and then folded it and rubbed it.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30022",
        "20208",
        "20321",
        "20208",
        "10956",
        "479",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-1257",
      "hadith_no": "1257",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا شيبان بن فروخ، حدثنا عبد الوارث، ح قال وحدثنا يحيى بن يحيى، أخبرنا هشيم، ح قال وحدثنا محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، كلهم عن القاسم بن مهران، عن أبي رافع، عن أبي هريرة، عن النبي صلى الله عليه وسلم ‏.‏ نحو حديث ابن علية وزاد في حديث هشيم قال أبو هريرة كأني أنظر إلى رسول الله صلى الله عليه وسلم يرد ثوبه بعضه على بعض ‏.‏",
      "text_en": " Abu Huraira reported:                      I perceive as if I am looking at the Messenger of Allah (may peace be upon him) folding up a part of his cloth with another one.",
      "usc_msa_ref": "",
      "chain": [
        "20656",
        "20258",
        "30399",
        "20468",
        "30170",
        "20173",
        "10956",
        "479",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-1332",
      "hadith_no": "1332",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا عبيد الله بن معاذ، ومحمد بن عبد الأعلى، قالا حدثنا المعتمر، عن أبيه، عن بكر، عن أبي رافع، قال صليت مع أبي هريرة صلاة العتمة فقرأ ‏{‏ إذا السماء انشقت‏}‏ فسجد فيها ‏.‏ فقلت له ما هذه السجدة فقال سجدت بها خلف أبي القاسم صلى الله عليه وسلم فلا أزال أسجد بها حتى ألقاه ‏.‏ وقال ابن عبد الأعلى فلا أزال أسجدها ‏.‏",
      "text_en": " Abu Rafi' reported:                      I said the night prayer along with Abu Huraira and -as he recited:\" When the heaven burst asunder,\" he performed prostration. Isaid to him: What prostration is this? He said: I prostrated myself (on this occasion of recital) behind Abu'I-Qasim (Muhammad. may peace be upon him), and Iwould go on doing this till I meet him (in the next world). Ibn 'Abu al-A'la said: (Abu Huraira uttered this: ) I would not abandon performing prostration.",
      "usc_msa_ref": "",
      "chain": [
        "30150",
        "30449",
        "20288",
        "11289",
        "11267",
        "479"
      ]
    },
    {
      "id": "sahih-muslim-1334",
      "hadith_no": "1334",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن عطاء بن أبي ميمونة، عن أبي رافع، قال رأيت أبا هريرة يسجد في ‏{‏ إذا السماء انشقت‏}‏ فقلت تسجد فيها فقال نعم رأيت خليلي صلى الله عليه وسلم يسجد فيها فلا أزال أسجد فيها حتى ألقاه ‏.‏ قال شعبة قلت النبي صلى الله عليه وسلم ‏.‏ قال نعم ‏.‏",
      "text_en": " Abu Rafi' reported:                      I saw Abu Huraira performing prostration (while reciting this verse: )\" When the heaven burst asunder.\" I said to him: Do you prostrate yourself (while reciting) i? He said: Yes, I saw my best Friend (may peace be upon him) prostrating himself on (the recital of this verse) and I shall continue prostrating till I meet him. Shu'ba asked: Do you mean (by Friend) the Apostle of Allah (may peace be upon him)? He said: Yes.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "11601",
        "479"
      ]
    },
    {
      "id": "sahih-muslim-1541",
      "hadith_no": "1541",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني محمد بن حاتم، حدثنا بهز، حدثنا حماد بن سلمة، عن ثابت، عن أبي رافع، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يزال العبد في صلاة ما كان في مصلاه ينتظر الصلاة وتقول الملائكة اللهم اغفر له اللهم ارحمه ‏.‏ حتى ينصرف أو يحدث ‏\"‏ ‏.‏ قلت ما يحدث قال يفسو أو يضرط ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      The servant is constantly in prayer so long as he is in a place of worship waiting for the prayer (to be observed in congregation), and the angels invoke (blessings upon him in these words): O Allah! pardon him. O Allah! show mercy to him, (and they continue to do so) till he returns (from the mosque having completed the prayer) or his ablution breaks. I said: How is the ablution broken? He said: By breaking of the wind noiselessly or with noise.",
      "usc_msa_ref": "",
      "chain": [
        "38487",
        "20214",
        "20021",
        "11269",
        "479",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-2259",
      "hadith_no": "2259",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثني أبو الربيع الزهراني، وأبو كامل فضيل بن حسين الجحدري - واللفظ لأبي كامل - قالا حدثنا حماد، - وهو ابن زيد عن ثابت البناني، عن أبي رافع، عن أبي، هريرة أن امرأة، سوداء كانت تقم المسجد - أو شابا - ففقدها رسول الله صلى الله عليه وسلم فسأل عنها - أو عنه - فقالوا مات ‏.‏ قال ‏\"‏ أفلا كنتم آذنتموني ‏\"‏ ‏.‏ قال فكأنهم صغروا أمرها - أو أمره - فقال ‏\"‏ دلوني على قبره ‏\"‏ ‏.‏ فدلوه فصلى عليها ثم قال ‏\"‏ إن هذه القبور مملوءة ظلمة على أهلها وإن الله عز وجل ينورها لهم بصلاتي عليهم ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Huraira that a dark-complexioned woman (or a youth) used to sweep the mosque. The Messenger of Allah (may peace be upon him) missed her (or him) and inquired about her (or him). The people told him that she (or he) had died. He asked why they did not inform him, and it appears as if they had treated her (or him) or her (or his) affairs as of little account. He (the Holy Prophet) said:                      Lead me to her (or his) gtave. They led him to that place and he said prayer over her (or him) and then remarked: Verily, these graves are full of darkness for their dwellers. Verily, the Mighty and Glorious Allah illuminates them for their occupants by reason of my prayer over them.",
      "usc_msa_ref": "",
      "chain": [
        "30137",
        "20022",
        "11269",
        "479",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-4192",
      "hadith_no": "4192",
      "source": "Sahih Muslim",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا أبو الطاهر، أحمد بن عمرو بن سرح أخبرنا ابن وهب، عن مالك بن، أنس عن زيد بن أسلم، عن عطاء بن يسار، عن أبي رافع، أن رسول الله صلى الله عليه وسلم استسلف من رجل بكرا فقدمت عليه إبل من إبل الصدقة فأمر أبا رافع أن يقضي الرجل بكره فرجع إليه أبو رافع فقال لم أجد فيها إلا خيارا رباعيا ‏.‏ فقال ‏\"‏ أعطه إياه إن خيار الناس أحسنهم قضاء ‏\"‏ ‏.‏",
      "text_en": " Abu Rafi' reported that Allah's Messenger (may peace be upon him) took from a man as a loan a young camel (below six years). Then the camels of Sadaqa were brought to him. He ordered Abu Rafi' to return to that person the young camel (as a return of the loan). Abu Rafi' returned to him and said:                      I did not find among them but better camels above the age of six. He (the Holy Prophet) said: Give that to him for the best men are those who are best in paying off the debt.",
      "usc_msa_ref": "",
      "chain": [
        "20029",
        "20001",
        "11163",
        "11020",
        "479"
      ]
    },
    {
      "id": "sahih-muslim-5590",
      "hadith_no": "5590",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عفان، حدثنا حماد بن سلمة، عن ثابت، عن أبي رافع، عن أبي هريرة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن رجلاممن كان قبلكم يتبختر في حلة ‏\"‏ ‏.‏ ثم ذكر مثل حديثهم ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      There was a person (living before you) who took pride in his cloak. the rest of the hadith is the same.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30106",
        "20021",
        "11269",
        "479",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-5730",
      "hadith_no": "5730",
      "source": "Sahih Muslim",
      "chapter": "The Book on General Behaviour - كتاب الآداب",
      "chapter_no": "39",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن المثنى، ومحمد بن بشار، قالوا حدثنا  محمد بن جعفر، حدثنا شعبة، عن عطاء بن أبي ميمونة، سمعت أبا رافع، يحدث عن أبي، هريرة ح  وحدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن عطاء بن أبي ميمونة، عن أبي رافع، عن أبي هريرة، أن زينب، كان اسمها برة فقيل تزكي نفسها ‏.‏ فسماها رسول الله صلى الله عليه وسلم زينب ‏.‏ ولفظ الحديث لهؤلاء دون ابن بشار ‏.‏ وقال ابن أبي شيبة حدثنا محمد بن جعفر عن شعبة ‏.‏",
      "text_en": " Abu Huraira reported that the name of Zainab was Barra. It was said of her:                      She presents herself to be innocent. Allah's Messenger (may peace be upon him) gave her the name of Zainab.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30170",
        "30160",
        "20173",
        "20020",
        "11601",
        "13",
        "30150",
        "20286",
        "20020",
        "11601",
        "479",
        "13",
        "57"
      ]
    },
    {
      "id": "sahih-muslim-6312",
      "hadith_no": "6312",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا هداب بن خالد، حدثنا حماد بن سلمة، عن ثابت، عن أبي رافع، عن أبي، هريرة أن رسول الله صلى الله عليه وسلم قال ‏\"‏ كان زكرياء نجارا ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      Zakariyya (peace be upon him) was a carpenter.",
      "usc_msa_ref": "",
      "chain": [
        "20021",
        "11269",
        "479",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-6672",
      "hadith_no": "6672",
      "source": "Sahih Muslim",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا سليمان بن المغيرة، حدثنا حميد بن هلال، عن  أبي رافع، عن أبي هريرة، أنه قال كان جريج يتعبد في صومعة فجاءت أمه ‏.‏ قال حميد فوصف لنا أبو رافع صفة أبي هريرة لصفة رسول الله صلى الله عليه وسلم أمه حين دعته كيف جعلت كفها فوق حاجبها ثم رفعت رأسها إليه تدعوه فقالت يا جريج أنا أمك كلمني ‏.‏ فصادفته يصلي فقال اللهم أمي وصلاتي ‏.‏ فاختار صلاته فرجعت ثم عادت في الثانية فقالت يا جريج أنا أمك فكلمني ‏.‏ قال اللهم أمي وصلاتي ‏.‏ فاختار صلاته فقالت اللهم إن هذا جريج وهو ابني وإني كلمته فأبى أن يكلمني اللهم فلا تمته حتى تريه المومسات ‏.‏ قال ولو دعت عليه أن يفتن لفتن ‏.‏ قال وكان راعي ضأن يأوي إلى ديره - قال - فخرجت امرأة من القرية فوقع عليها الراعي فحملت فولدت غلاما فقيل لها ما هذا قالت من صاحب هذا الدير ‏.‏ قال فجاءوا بفئوسهم ومساحيهم فنادوه فصادفوه يصلي فلم يكلمهم - قال - فأخذوا يهدمون ديره فلما رأى ذلك نزل إليهم فقالوا له سل هذه - قال - فتبسم ثم مسح رأس الصبي فقال من أبوك قال أبي راعي الضأن ‏.‏ فلما سمعوا ذلك منه قالوا نبني ما هدمنا من ديرك بالذهب والفضة ‏.‏ قال لا ولكن أعيدوه ترابا كما كان ثم علاه ‏.‏",
      "text_en": " Abu Huraira reported that Juraij was one who was devoted to (prayer) in the temple. His mother came to him. Humaid said that Abu Rafi' demonstrated before us like the demonstration made by abu Huraira to whom Allah's Messenger (may peace be upon him) had demonstrated as his mother called him placing her palms upon the eyebrows and lifting her head for calling him and said:                      Juraij, it is your mother, so talk to her. She found him at that time absorbed in prayer, so he said (to himself): O Lord, my mother (is calling me) (whereas I am absorbed) in my prayer. He opted for prayer. She (his mother) went back, then came again for the second time and said: O Juraij, it is your mother (calling you), so talk to me. He said: O Allah. there is my mother also and my prayer, and he opted for prayer. She said: O Allah, this Juraij is my son. I pray to talk to him but he refuses to talk to me. O Allah, don't bring death to him unless he has seen the prostitutes, and had she invoked the curse upon him (from the heart of her heart) he would have been involved in some turmoil. There was a shepherd living near by his temple (the temple where Juraij was engaged in prayer). It so happened that a woman of that village came there and that shepherd committed fornication with her and she became pregnant and gave birth to a child. It was said to her: Whose child is this? She said: He is the child of one who is living in this temple. So there came persons with hatchets and spades. They called Juraij. He was absorbed in prayer and he did not talk to them and they were about to demolish that temple that he saw them and then came to them and they said: Ask her (this woman) what she says. He smiled and then touched the head of the child and said: Who is your father? He (the child) said: My father is the shepherd of the sheep, and when they heard this, they said: We are prepared to rebuild with gold and silver what we have demolished from your temple. He said: No, rebuild it with clay as it had been before. He then went up (to his room and absorbed himself in prayer).",
      "usc_msa_ref": "",
      "chain": [
        "20656",
        "20236",
        "11281",
        "479",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-6714",
      "hadith_no": "6714",
      "source": "Sahih Muslim",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثني عبد الأعلى بن حماد، حدثنا حماد بن سلمة، عن ثابت، عن أبي رافع، عن أبي هريرة، عن النبي صلى الله عليه وسلم ‏\"‏ أن رجلا زار أخا له في قرية أخرى فأرصد الله له على مدرجته ملكا فلما أتى عليه قال أين تريد قال أريد أخا لي في هذه القرية ‏.‏ قال هل لك عليه من نعمة تربها قال لا غير أني أحببته في الله عز وجل ‏.‏ قال فإني رسول الله إليك بأن الله قد أحبك كما أحببته فيه ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Apostle (may peace be upon him) as saying:                      A person visited his brother in another town and Allah deputed an Angel to wait for him on his way and when he came to him he said: Where do you intend to go? He said: I intend to go to my brother in this town. He said: Have you done any favour to him (the repayment of which you intend to get)? He said: No, excepting this that I love Mm for the sake of Allah, the Exalted and Glorious. Thereupon he said: I am a meesenger to you from, Allah: (to inform you) that Allah loves you as you love him (for His sake) This hadith has been narrated on the authority of Hammid b. Salama with the same of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30146",
        "20021",
        "11269",
        "479",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-6721",
      "hadith_no": "6721",
      "source": "Sahih Muslim",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثني محمد بن حاتم بن ميمون، حدثنا بهز، حدثنا حماد بن سلمة، عن ثابت، عن أبي رافع، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله عز وجل يقول يوم القيامة يا ابن آدم مرضت فلم تعدني ‏.‏ قال يا رب كيف أعودك وأنت رب العالمين ‏.‏ قال أما علمت أن عبدي فلانا مرض فلم تعده أما علمت أنك لو عدته لوجدتني عنده يا ابن آدم استطعمتك فلم تطعمني ‏.‏ قال يا رب وكيف أطعمك وأنت رب العالمين ‏.‏ قال أما علمت أنه استطعمك عبدي فلان فلم تطعمه أما علمت أنك لو أطعمته لوجدت ذلك عندي يا ابن آدم استسقيتك فلم تسقني ‏.‏ قال يا رب كيف أسقيك وأنت رب العالمين قال استسقاك عبدي فلان فلم تسقه أما إنك لو سقيته وجدت ذلك عندي ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      Verily, Allah, the Exalted and Glorious, would say on the Day of Resurrection: O son of Adam, I was sick but you did not visit Me. He would say: O my Lord; how could I visit Thee whereas Thou art the Lord of the worlds? Thereupon He would say: Didn't you know that such and such servant of Mine was sick but you did not visit him and were you not aware of this that if you had visited him, you would have found Me by him? O son of Adam, I asked food from you but you did not feed Me. He would say: My Lord, how could I feed Thee whereas Thou art the Lord of the worlds? He said: Didn't you know that such and such servant of Mine asked food from you but you did not feed him, and were you not aware that if you had fed him you would have found him by My side? (The Lord would again say: ) O son of Adam, I asked drink from you but you did not provide Me. He would say: My Lord, how could I provide Thee whereas Thou art the Lord of the worlds? Thereupon He would say: Such and such of servant of Mine asked you for a drink but you did not provide him, and had you provided him drink you would have found him near Me.",
      "usc_msa_ref": "",
      "chain": [
        "30514",
        "20214",
        "20021",
        "11269",
        "479",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-6838",
      "hadith_no": "6838",
      "source": "Sahih Muslim",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثني محمد بن حاتم، حدثنا بهز، حدثنا حماد بن سلمة، عن ثابت، عن أبي رافع، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن شجرة كانت تؤذي المسلمين فجاء رجل فقطعها فدخل الجنة ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying that there was a tree which caused inconvenience to the Muslims; a person came there and cut that (tree) (and thus entered ) Paradise).",
      "usc_msa_ref": "",
      "chain": [
        "38487",
        "20214",
        "20021",
        "11269",
        "479",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-7335",
      "hadith_no": "7335",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "حدثني زهير بن حرب، حدثنا عبد الرحمن بن مهدي، حدثنا حماد بن سلمة، عن  ثابت، عن أبي رافع، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من يدخل الجنة ينعم لا يبأس لا تبلى ثيابه ولا يفنى شبابه ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Apostle (may peace be upon him) as saying:                      He who would get into Paradise (would be made to enjoy such an everlasting) bliss that he would neither become destitute, nor would his clothes wear out, nor his youth would decline.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "20033",
        "20021",
        "11269",
        "479",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-216",
      "hadith_no": "216",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا مسلم بن إبراهيم الفراهيدي، حدثنا هشام، وشعبة، عن قتادة، عن الحسن، عن أبي رافع، عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏\"‏ إذا قعد بين شعبها الأربع وألزق الختان بالختان فقد وجب الغسل ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the Prophet (May peace be upon him) as saying :                      when anyone sits between the four parts of a woman and the parts (of the male and female) which are circumscised join together, then bath becomes obligatory.",
      "usc_msa_ref": "",
      "chain": [
        "20285",
        "20295",
        "20020",
        "11019",
        "11016",
        "479",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-219",
      "hadith_no": "219",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، عن عبد الرحمن بن أبي رافع، عن عمته، سلمى عن أبي رافع، أن النبي صلى الله عليه وسلم طاف ذات يوم على نسائه يغتسل عند هذه وعند هذه ‏.‏ قال فقلت له يا رسول الله ألا تجعله غسلا واحدا قال ‏\"‏ هذا أزكى وأطيب وأطهر ‏\"‏ ‏.‏ قال أبو داود وحديث أنس أصح من هذا ‏.‏",
      "text_en": " Narrated AbuRafi':                     One day the Prophet (ﷺ) had intercourse with all his wives. He took a bath after each intercourse. I asked him: Messenger of Allah, why don't you make it a single bath? He replied: This is more purifying, better and cleaning.Abu Dawud said: The tradition narrated by Anas is more sound that this tradition.",
      "usc_msa_ref": "",
      "chain": [
        "20040",
        "20022",
        "479"
      ]
    },
    {
      "id": "sunan-abi-daud-231",
      "hadith_no": "231",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، وبشر، عن حميد، عن بكر، عن أبي رافع، عن أبي هريرة، قال لقيني رسول الله صلى الله عليه وسلم في طريق من طرق المدينة وأنا جنب فاختنست فذهبت فاغتسلت ثم جئت فقال ‏\"‏ أين كنت يا أبا هريرة ‏\"‏ ‏.‏ قال قلت إني كنت جنبا فكرهت أن أجالسك على غير طهارة ‏.‏ فقال ‏\"‏ سبحان الله إن المسلم لا ينجس ‏\"‏ ‏.‏ وقال في حديث بشر حدثنا حميد حدثني بكر ‏.‏",
      "text_en": " Abu Hudhaifah reported :                      The Messenger of Allah (ﷺ) met me on one of the streets of medina while I was sexually defiled. I retreated and went away. I then took a bath and came to him. He asked : Where were you, O Abu Hurairah? I replied : As I was sexually defiled, I disliked to sit in your company without purification. He exclaimed: Glory be to Allah! A Muslim is not defiled.He (Abu Dawud) said : The version of this tradition reported by Bishr has the chain: Humaid reported from Bakr.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20031",
        "20212",
        "11279",
        "11267",
        "479",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-471",
      "hadith_no": "471",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، عن ثابت، عن أبي رافع، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يزال العبد في صلاة ما كان في مصلاه ينتظر الصلاة تقول الملائكة اللهم اغفر له اللهم ارحمه حتى ينصرف أو يحدث ‏\"‏ ‏.‏ فقيل ما يحدث قال يفسو أو يضرط ‏.‏",
      "text_en": " Abu Hurairah reported the apostle of Allah (May peace be upon him) as saying; The servant (of Allah) is considered to he at prayer so long as he remains at the place of prayer waiting for prayer. The angels say:                      O Allah, forgive him? O Allah, take mercy on him, until he turns away, or he is defiled. He was asked: what is meant by defilement? He replied: he breaks wind gently or loudly.",
      "usc_msa_ref": "",
      "chain": [
        "20040",
        "20022",
        "11269",
        "479",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-1408",
      "hadith_no": "1408",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prostration while reciting the Qur'an - كتاب سجود القرآن",
      "chapter_no": "7",
      "text_ar": "حدثنا مسدد، حدثنا المعتمر، قال سمعت أبي، حدثنا بكر، عن أبي رافع، قال صليت مع أبي هريرة العتمة فقرأ ‏{‏ إذا السماء انشقت ‏}‏ فسجد فقلت ما هذه السجدة قال سجدت بها خلف أبي القاسم صلى الله عليه وسلم فلا أزال أسجد بها حتى ألقاه ‏.‏",
      "text_en": " Narrated Abu Rafi':                     I offered the night prayer behind Abu Hurairah. He recited Surah Inshiqaq (\"When the sky is rent asunder\") and prostrated himself. I asked him: What is this prostration ? He replied: I prostrated myself on account of this (surah) behind Abu al-Qasim (i.e. the Prophet). I shall continue prostrating on account of this till I meet him.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20288",
        "11289",
        "11267",
        "479"
      ]
    },
    {
      "id": "sunan-abi-daud-1650",
      "hadith_no": "1650",
      "source": "Sunan Abi Da'ud",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا شعبة، عن الحكم، عن ابن أبي رافع، عن أبي رافع، أن النبي صلى الله عليه وسلم بعث رجلا على الصدقة من بني مخزوم فقال لأبي رافع اصحبني فإنك تصيب منها ‏.‏ قال حتى آتي النبي صلى الله عليه وسلم فأسأله فأتاه فسأله فقال ‏\"‏ مولى القوم من أنفسهم وإنا لا تحل لنا الصدقة ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuRafi':                     The Prophet (ﷺ) sent a man of the Banu Makhzum to collect sadaqah. He said to AbuRafi': Accompany me so that you may get some of it. He said: (I cannot take it) until I go to the Prophet (ﷺ) and ask him. Then he went to him and asked him. He said: The sadaqah is not lawful for us, and the client of a people is treated as one of them.",
      "usc_msa_ref": "",
      "chain": [
        "28531",
        "20020",
        "11069",
        "479"
      ]
    },
    {
      "id": "sunan-abi-daud-1853",
      "hadith_no": "1853",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا حماد، عن ميمون بن جابان، عن أبي رافع، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ الجراد من صيد البحر ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the Prophet (ﷺ) as saying “Locusts are counted along with what is caught in the sea (i.e., the game of the sea).”",
      "usc_msa_ref": "",
      "chain": [
        "31167",
        "20022",
        "479",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-1855",
      "hadith_no": "1855",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، عن ميمون بن جابان، عن أبي رافع، عن كعب، قال الجراد من صيد البحر ‏.‏",
      "text_en": " Ka’ab said “Locusts are counted along with the game of the sea.”",
      "usc_msa_ref": "",
      "chain": [
        "20040",
        "20022",
        "479"
      ]
    },
    {
      "id": "sunan-abi-daud-2463",
      "hadith_no": "2463",
      "source": "Sunan Abi Da'ud",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، أخبرنا ثابت، عن أبي رافع، عن أبى بن كعب، أن النبي صلى الله عليه وسلم كان يعتكف العشر الأواخر من رمضان فلم يعتكف عاما فلما كان العام المقبل اعتكف عشرين ليلة ‏.‏",
      "text_en": " Narrated Ubayy ibn Ka'b:                     The Prophet (ﷺ) used to observe i'tikaf during the last ten days of Ramadan. One year he did not observe i'tikaf. When the next year came, he observed i'tikaf for twenty nights (i.e. days).",
      "usc_msa_ref": "",
      "chain": [
        "20040",
        "20022",
        "11269",
        "479",
        "39"
      ]
    },
    {
      "id": "sunan-abi-daud-3203",
      "hadith_no": "3203",
      "source": "Sunan Abi Da'ud",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا سليمان بن حرب، ومسدد، قالا حدثنا حماد، عن ثابت، عن أبي رافع، عن أبي هريرة، أن امرأة، سوداء أو رجلا كان يقم المسجد ففقده النبي صلى الله عليه وسلم فسأل عنه فقيل مات ‏.‏ فقال ‏\"‏ ألا آذنتموني به ‏\"‏ ‏.‏ قال ‏\"‏ دلوني على قبره ‏\"‏ ‏.‏ فدلوه فصلى عليه ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     A negress (or a youth) used to sweep the mosque. The Prophet (ﷺ) missed him, and when he asked about him the people told him that he had died. He said: Why have you not informed me ? He said: Lead me to his grave. So they led him and he prayed over him.",
      "usc_msa_ref": "",
      "chain": [
        "20193",
        "30175",
        "20022",
        "11269",
        "479",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-3346",
      "hadith_no": "3346",
      "source": "Sunan Abi Da'ud",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا القعنبي، عن مالك، عن زيد بن أسلم، عن عطاء بن يسار، عن أبي رافع، قال استسلف رسول الله صلى الله عليه وسلم بكرا فجاءته إبل من الصدقة فأمرني أن أقضي الرجل بكره فقلت لم أجد في الإبل إلا جملا خيارا رباعيا ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ أعطه إياه فإن خيار الناس أحسنهم قضاء ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Rafi':                     The Messenger of Allah (ﷺ) borrowed a young camel, and when the camels of the sadaqah (alms) came to him, he ordered me to pay the man his young camel. I said: I find only an excellent camel in its seventh year. So the Prophet (ﷺ) said: Give it to him, for the best person is he who discharges his debt in the best manner.",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "20001",
        "11163",
        "11020",
        "479"
      ]
    },
    {
      "id": "sunan-abi-daud-3616",
      "hadith_no": "3616",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن منهال، حدثنا يزيد بن زريع، حدثنا ابن أبي عروبة، عن قتادة، عن خلاس، عن أبي رافع، عن أبي هريرة، أن رجلين، اختصما في متاع إلى النبي صلى الله عليه وسلم ليس لواحد منهما بينة فقال النبي صلى الله عليه وسلم ‏\"‏ استهما على اليمين ما كان أحبا ذلك أو كرها ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     Two men disputed about some property and brought the case to the Holy Prophet (ﷺ), but neither of them could produce any proof. So the Holy Prophet (ﷺ) said: Cast lots about the oath whatever it may be, whether they like it or dislike it.",
      "usc_msa_ref": "",
      "chain": [
        "30173",
        "20304",
        "11073",
        "11019",
        "11283",
        "479",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-4605",
      "hadith_no": "4605",
      "source": "Sunan Abi Da'ud",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا أحمد بن محمد بن حنبل، وعبد الله بن محمد النفيلي، قالا حدثنا سفيان، عن أبي النضر، عن عبيد الله بن أبي رافع، عن أبيه، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا ألفين أحدكم متكئا على أريكته يأتيه الأمر من أمري مما أمرت به أو نهيت عنه فيقول لا ندري ما وجدنا في كتاب الله اتبعناه ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuRafi':                     The Prophet (ﷺ) said: Let me not find one of you reclining on his couch when he hears something regarding me which I have commanded or forbidden and saying: We do not know. What we found in Allah's Book we have followed.",
      "usc_msa_ref": "",
      "chain": [
        "30007",
        "30352",
        "20012",
        "11164",
        "11199",
        "479"
      ]
    },
    {
      "id": "sunan-abi-daud-5105",
      "hadith_no": "5105",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن سفيان، قال حدثني عاصم بن عبيد الله، عن عبيد الله بن أبي رافع، عن أبيه، قال رأيت رسول الله صلى الله عليه وسلم أذن في أذن الحسن بن علي - حين ولدته فاطمة - بالصلاة ‏.‏",
      "text_en": " Narrated AbuRafi':                     I saw the Messenger of Allah (ﷺ) uttering the call to prayer (Adhan) in the ear of al-Hasan ibn Ali when Fatimah gave birth to him.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20031",
        "20012",
        "19808",
        "11199",
        "479"
      ]
    },
    {
      "id": "jami-al-tirmidhi-121",
      "hadith_no": "121",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا إسحاق بن منصور، حدثنا يحيى بن سعيد القطان، حدثنا حميد الطويل، عن بكر بن عبد الله المزني، عن أبي رافع، عن أبي هريرة، أن النبي صلى الله عليه وسلم لقيه وهو جنب قال فانبجست أى فانخنست فاغتسلت ثم جئت فقال ‏\"‏ أين كنت أو أين ذهبت ‏\"‏ ‏.‏ قلت إني كنت جنبا ‏.‏ قال ‏\"‏ إن المسلم لا ينجس ‏\"‏ ‏.‏ قال وفي الباب عن حذيفة وابن عباس ‏.‏ قال أبو عيسى وحديث أبي هريرة أنه لقي النبي صلى الله عليه وسلم وهو جنب حديث حسن صحيح ‏.‏ وقد رخص غير واحد من أهل العلم في مصافحة الجنب ولم يروا بعرق الجنب والحائض بأسا ‏.‏ ومعنى قوله فانخنست يعني تنحيت عنه ‏.‏",
      "text_en": " Abu Hurairah narrated that :                     the Prophet met him while he was Junub. He said: \"[So I slipped away from him - meaning:] I withdrew - to perform Ghusl. Then he returned, so he said: 'Where have you been?' Or: 'Where did you go?' I replied: 'I was Junub.' So he said: 'Indeed the believer is not defiled.'''",
      "usc_msa_ref": "",
      "chain": [
        "30313",
        "20031",
        "11279",
        "11267",
        "479",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-384",
      "hadith_no": "384",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا يحيى بن موسى، حدثنا عبد الرزاق، أخبرنا ابن جريج، عن عمران بن موسى، عن سعيد بن أبي سعيد المقبري، عن أبيه، عن أبي رافع، أنه مر بالحسن بن علي وهو يصلي وقد عقص ضفرته في قفاه فحلها فالتفت إليه الحسن مغضبا فقال أقبل على صلاتك ولا تغضب فإني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ذلك كفل الشيطان ‏\"‏ ‏.‏ قال وفي الباب عن أم سلمة وعبد الله بن عباس ‏.‏ قال أبو عيسى حديث أبي رافع حديث حسن ‏.‏ والعمل على هذا عند أهل العلم كرهوا أن يصلي الرجل وهو معقوص شعره ‏.‏ قال أبو عيسى وعمران بن موسى هو القرشي المكي وهو أخو أيوب بن موسى ‏.‏",
      "text_en": " Abu Rafi narrated that :                     He passed by Al-Hasan bin Ali while he was performing Salat and he had gathered his locks at the back of his head, so he (Abu Rafi) undid them, and Al-Hasan turned to him angrily. He said: \"Resume your Salat and do not be angry, for indeed I heard Allah's Messenger (S) saying: 'That is the seat of Ash-Shaitan.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30221",
        "20121",
        "11070",
        "28454",
        "11168",
        "11212",
        "479"
      ]
    },
    {
      "id": "jami-al-tirmidhi-482",
      "hadith_no": "482",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Al-Witr - أَبْوَابُ الْوِتْرِ",
      "chapter_no": "3",
      "text_ar": "حدثنا أبو كريب، محمد بن العلاء حدثنا زيد بن حباب العكلي، حدثنا موسى بن عبيدة، حدثني سعيد بن أبي سعيد، مولى أبي بكر بن محمد بن عمرو بن حزم عن أبي رافع، قال قال رسول الله صلى الله عليه وسلم للعباس ‏\"‏ يا عم ألا أصلك ألا أحبوك ألا أنفعك ‏\"‏ ‏.‏ قال بلى يا رسول الله ‏.‏ قال ‏\"‏ يا عم صل أربع ركعات تقرأ في كل ركعة بفاتحة الكتاب وسورة فإذا انقضت القراءة فقل الله أكبر والحمد لله وسبحان الله ولا إله إلا الله خمس عشرة مرة قبل أن تركع ثم اركع فقلها عشرا ثم ارفع رأسك فقلها عشرا ثم اسجد فقلها عشرا ثم ارفع رأسك فقلها عشرا ثم اسجد الثانية فقلها عشرا ثم ارفع رأسك فقلها عشرا قبل أن تقوم فتلك خمس وسبعون في كل ركعة وهي ثلاثمائة في أربع ركعات فلو كانت ذنوبك مثل رمل عالج لغفرها الله لك ‏\"‏ ‏.‏ قال يا رسول الله ومن يستطيع أن يقولها في كل يوم قال ‏\"‏ فإن لم تستطع أن تقولها في كل يوم فقلها في جمعة فإن لم تستطع أن تقولها في جمعة فقلها في شهر ‏\"‏ ‏.‏ فلم يزل يقول له حتى قال ‏\"‏ فقلها في سنة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب من حديث أبي رافع ‏.‏",
      "text_en": " Abu Rafi narrated that :                     Allah's Messenger said to Al-Abbas: \"O uncle! Shall I not give to you, shall I not present to you, shall I not benefit you?\" He said: \"Of course, O Messenger of Allah!\" He said: \"O uncle! Pray four Rak'ah, reciting in each Rak'ah Fatihatil-Kitab and a Surah. When you are finished your recitation then say: Allahu Akbar, wal-hamdulilah, wa Subhan-Allah, [Wa La Ilaha illallah] 'Allah is Greatest, and all praise is due to Allah, and Glorious is Allah, [and there is none worthy of worship except Allah].' fifteen times before you bow. Then bow and say it ten times, then raise your head and say it ten times. Then prostrate [the second time] and say it ten times. Then raise your head and say it ten times before standing. That is seventy-five in every Rak'ah, which is three-hundred in four Rak'ah. If your sins were like a heap of sand then Allah would forgive you.\" He said: \"O Messenger if Allah! Who is able to say that every day?\" He said: \"If you can not say it every day then say it every Friday, and if you are not able to say it every Friday then say it every month.\" And he did not stop saying that until he said: \"Then say it every year.\"",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20650",
        "12527",
        "479"
      ]
    },
    {
      "id": "jami-al-tirmidhi-657",
      "hadith_no": "657",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Zakat - كتاب الزكاة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "7",
      "text_ar": "حدثنا محمد بن المثنى، قال حدثنا محمد بن جعفر، حدثنا شعبة، عن الحكم، عن ابن أبي رافع، عن أبي رافع، رضى الله عنه أن النبي صلى الله عليه وسلم بعث رجلا من بني مخزوم على الصدقة فقال لأبي رافع اصحبني كيما تصيب منها ‏.‏ فقال لا ‏.‏ حتى آتي رسول الله صلى الله عليه وسلم فأسأله ‏.‏ فانطلق إلى النبي صلى الله عليه وسلم فسأله فقال ‏\"‏ إن الصدقة لا تحل لنا وإن موالي القوم من أنفسهم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وأبو رافع مولى النبي صلى الله عليه وسلم اسمه أسلم وابن أبي رافع هو عبيد الله بن أبي رافع كاتب علي بن أبي طالب رضى الله عنه ‏.‏",
      "text_en": " Abu Rafi (may Allah be pleased with him) narrated that :                     the Messenger of Allah sent a man from Banu Makhzun to collect charity, so he said to Abu Rafi: \"Accompany me so that perhaps you may have some of it.\" So he said: \"Not until I ask the Messenger of Allah.\" So he went to the Prophet to ask him, and he said: \"Charity is not lawful for us, and to be the Mawda of a people to be the same as them.\"",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20173",
        "20020",
        "11069",
        "479"
      ]
    },
    {
      "id": "jami-al-tirmidhi-841",
      "hadith_no": "841",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا قتيبة، أخبرنا حماد بن زيد، عن مطر الوراق، عن ربيعة بن أبي عبد الرحمن، عن سليمان بن يسار، عن أبي رافع، قال تزوج رسول الله صلى الله عليه وسلم ميمونة وهو حلال وبنى بها وهو حلال وكنت أنا الرسول فيما بينهما ‏.‏ قال أبو عيسى هذا حديث حسن ولا نعلم أحدا أسنده غير حماد بن زيد عن مطر الوراق عن ربيعة ‏.‏ وروى مالك بن أنس عن ربيعة عن سليمان بن يسار أن النبي صلى الله عليه وسلم تزوج ميمونة وهو حلال ‏.‏ رواه مالك مرسلا ‏.‏ قال ورواه أيضا سليمان بن بلال عن ربيعة مرسلا ‏.‏ قال أبو عيسى وروي عن يزيد بن الأصم عن ميمونة قالت تزوجني رسول الله صلى الله عليه وسلم وهو حلال ‏.‏ ويزيد بن الأصم هو ابن أخت ميمونة ‏.‏",
      "text_en": " Abu Rafi narrated:                     \"The Messenger of Allah married Maimunah while he was Halal, and he stayed with her while he was Halal, and I was the messenger between the two of them.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20022",
        "10719",
        "11162",
        "11005",
        "479"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1514",
      "hadith_no": "1514",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Sacrifices - كتاب الأضاحى عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "19",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، وعبد الرحمن بن مهدي، قالا أخبرنا سفيان، عن عاصم بن عبيد الله، عن عبيد الله بن أبي رافع، عن أبيه، قال رأيت رسول الله صلى الله عليه وسلم أذن في أذن الحسن بن علي حين ولدته فاطمة بالصلاة ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ والعمل عند أهل العلم في العقيقة على ما روي عن النبي صلى الله عليه وسلم من غير وجه عن الغلام شاتان مكافئتان وعن الجارية شاة ‏.‏ - وروي عن النبي صلى الله عليه وسلم أيضا أنه عق عن الحسن بشاة وقد ذهب بعض أهل العلم إلى هذا الحديث ‏.‏",
      "text_en": " Narrated 'Ubaidullah bin Abi Rafi':                     That his father said: \"I saw the Messenger of Allah (ﷺ) say the Adhan in the ear of Al-Hasan bin 'Ali - when he was born to Fatimah - the Adhan of Salat.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20031",
        "20033",
        "20012",
        "19808",
        "11199",
        "479"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2663-2",
      "hadith_no": "2663",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Knowledge - كتاب العلم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "41",
      "text_ar": "حدثنا قتيبة، حدثنا سفيان بن عيينة، عن محمد بن المنكدر، وسالم أبي النضر، عن عبيد الله بن أبي رافع، عن أبي رافع، وغيره، رفعه قال ‏\"‏ لا ألفين أحدكم متكئا على أريكته يأتيه أمر مما أمرت به أو نهيت عنه فيقول لا أدري ما وجدنا في كتاب الله اتبعناه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ وروى بعضهم عن سفيان عن ابن المنكدر عن النبي صلى الله عليه وسلم مرسلا وسالم أبي النضر عن عبيد الله بن أبي رافع عن أبيه عن النبي صلى الله عليه وسلم ‏.‏ وكان ابن عيينة إذا روى هذا الحديث على الانفراد بين حديث محمد بن المنكدر من حديث سالم أبي النضر وإذا جمعهما روى هكذا ‏.‏ وأبو رافع مولى النبي صلى الله عليه وسلم اسمه أسلم ‏.‏",
      "text_en": " Narrated 'Ubaidullah bin Abu Rafi:                     from Abu Rafi' and others, from the Prophet (ﷺ) who said: \"Let me not find one of you reclining on his couch when a command I ordered, or a prohibition from me comes to him, and he says: 'I do not know. What we find in the Book of Allah, we follow it.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20005",
        "11048",
        "11164",
        "11199",
        "479"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3447",
      "hadith_no": "3447",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمد بن بشار، وغير، واحد، - المعنى واحد واللفظ لابن بشار قالوا حدثنا هشام بن عبد الملك حدثنا أبو عوانة عن قتادة عن أبي رافع عن حديث أبي هريرة عن النبي صلى الله عليه وسلم في السد قال ‏\"‏ يحفرونه كل يوم حتى إذا كادوا يخرقونه قال الذي عليهم ارجعوا فستخرقونه غدا فيعيده الله كأمثل ما كان حتى إذا بلغ مدتهم وأراد الله أن يبعثهم على الناس قال الذي عليهم ارجعوا فستخرقونه غدا إن شاء الله واستثنى ‏.‏ قال فيرجعون فيجدونه كهيئته حين تركوه فيخرقونه فيخرجون على الناس فيستقون المياه ويفر الناس منهم فيرمون بسهامهم في السماء فترجع مخضبة بالدماء فيقولون قهرنا من في الأرض وعلونا من في السماء قسوة وعلوا ‏.‏ فيبعث الله عليهم نغفا في أقفائهم فيهلكون قال فوالذي نفس محمد بيده إن دواب الأرض تسمن وتبطر وتشكر شكرا من لحومهم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب إنما نعرفه من هذا الوجه مثل هذا ‏.‏",
      "text_en": " Narrated Abu Rafi':                     a Hadith of Abu Hurairah, from the Prophet (ﷺ), regarding the 'barrier (18:93).' \"They excavated each day, until when they are just about to penetrate it, their leader says: 'Go back so that you can penetrate it tomorrow!'\" He said: \"But Allah makes it return just as it was, until their appointed time, when Allah ordains to send them upon the people, and their leader says: 'Go back so you can penetrate it tomorrow, if Allah wills.' So he makes this exception.\" He said: \"So they return, and find it just as it was when they left it. Then they penetrate it, and [they (Ya'juj & Ma'juj)] are released upon the people drinking up the water, and the people flee from them. They shoot their arrows into the heavens so they returned dyed with blood, and they say - crudely and arrogantly - 'We vanquished those in the earth, let us dominate the inhabitants of the heavens.' Then Allah sends Naghaf upon them, attaching to the nape of their necks, destroying them.\" He said: \"By the One in Whose Hand is the soul of Muhammad! The beasts of the earth will become very fat and bloated with milk from their flesh.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20469",
        "11019",
        "479"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3506-2",
      "hadith_no": "3506",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا يوسف بن حماد البصري، حدثنا عبد الأعلى، عن سعيد، عن قتادة، عن أبي رافع، عن أبي هريرة، رضي الله عنه عن النبي صلى الله عليه وسلم قال ‏\"‏ إن لله تسعة وتسعين اسما مائة غير واحد من أحصاها دخل الجنة ‏\"‏ ‏.‏ قال يوسف وحدثنا عبد الأعلى، عن هشام بن حسان، عن محمد، عن أبي هريرة، رضى الله عنه عن النبي صلى الله عليه وسلم ‏.‏ هذا حديث حسن صحيح ‏.‏ وقد روي من غير وجه عن أبي هريرة عن النبي صلى الله عليه وسلم.",
      "text_en": " Abu Hurairah [may Allah be pleased with him] narrated the the Prophet said:                     “Indeed Allah has ninety-nine Names, one hundred less one, whoever counts them shall enter Paradise.”",
      "usc_msa_ref": "",
      "chain": [
        "30573",
        "20246",
        "11168",
        "11019",
        "479",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-192",
      "hadith_no": "192",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا خالد، قال حدثنا شعبة، عن قتادة، قال سمعت الحسن، يحدث عن أبي رافع، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا جلس بين شعبها الأربع ثم اجتهد فقد وجب الغسل ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:                      \"When (a man) sits between the four parts of his wife's body and exerts himself, then Ghusl becomes obligatory.\"",
      "usc_msa_ref": "",
      "chain": [
        "30449",
        "20423",
        "20020",
        "11019",
        "11016",
        "479",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-271",
      "hadith_no": "271",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا حميد بن مسعدة، قال حدثنا بشر، - وهو ابن المفضل - قال حدثنا حميد، عن بكر، عن أبي رافع، عن أبي هريرة، أن النبي صلى الله عليه وسلم لقيه في طريق من طرق المدينة وهو جنب فانسل عنه فاغتسل ففقده النبي صلى الله عليه وسلم فلما جاء قال ‏\"‏ أين كنت يا أبا هريرة ‏\"‏ ‏.‏ قال يا رسول الله إنك لقيتني وأنا جنب فكرهت أن أجالسك حتى أغتسل ‏.‏ فقال ‏\"‏ سبحان الله إن المؤمن لا ينجس ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Prophet (ﷺ) met him in one of the streets of Al-Madinah while he was Junub, so he slipped away from him and performed Ghusl. The Prophet (ﷺ) noticed he was not there, and when he came he said:                      'Where were you, O Abu Hurairah?' He said: 'O Messenger of Allah, you met us but I was Junub, and I did not want to sit in your presence until I had performed Ghusl.' He said: 'Subhan Allah! The believer is not made impure (Najis).'\"",
      "usc_msa_ref": "",
      "chain": [
        "30430",
        "20212",
        "11279",
        "11267",
        "479",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-311",
      "hadith_no": "311",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا محمد بن بشار، عن محمد، قال حدثنا شعبة، قال سمعت القاسم بن مهران، يحدث عن أبي رافع، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا صلى أحدكم فلا يبزق بين يديه ولا عن يمينه ولكن عن يساره أو تحت قدمه وإلا ‏\"‏ ‏.‏ فبزق النبي صلى الله عليه وسلم هكذا في ثوبه ودلكه ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Prophet (ﷺ) said:                      \"When any one of you prays, let him not spit in front of him or to his right, rather let him spit to his left or beneath his feet.\" Then the Prophet (ﷺ) spat like this on his garment and rubbed it.",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20278",
        "20020",
        "10956",
        "479",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-338",
      "hadith_no": "338",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Water - كتاب المياه",
      "chapter_no": "2",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا معاذ بن هشام، قال حدثني أبي، عن قتادة، عن خلاس، عن أبي رافع، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا ولغ الكلب في إناء أحدكم فليغسله سبع مرات أولاهن بالتراب ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:                      \"If a dog licks the vessel of any one of you, let him wash it seven times, the first time with dust.\"",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20287",
        "20295",
        "11019",
        "11283",
        "479",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-466",
      "hadith_no": "466",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Salah - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "أخبرنا أبو داود، قال حدثنا شعيب، - يعني ابن زياد بن ميمون - قال كتب علي بن المديني عنه - أخبرنا أبو العوام، عن قتادة، عن الحسن، عن أبي رافع، عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏\"‏ إن أول ما يحاسب به العبد يوم القيامة صلاته فإن وجدت تامة كتبت تامة وإن كان انتقص منها شىء قال انظروا هل تجدون له من تطوع يكمل له ما ضيع من فريضة من تطوعه ثم سائر الأعمال تجري على حسب ذلك ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Prophet (ﷺ) said:                      \"The first thing for which a person will be brought to account on the Day of Resurrection will be his Salah. If it is found to be complete then it will be recorded as complete, and if anything is lacking He will say: 'Look and see if you can find any voluntary prayers with which to complete what he neglected of his obligatory prayers.' Then the rest of his deeds will be reckoned in like manner.\"",
      "usc_msa_ref": "",
      "chain": [
        "30002",
        "11019",
        "11016",
        "479",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-862",
      "hadith_no": "862",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا عمرو بن سواد بن الأسود بن عمرو، قال أنبأنا ابن وهب، قال أنبأنا ابن جريج، عن منبوذ، عن الفضل بن عبيد الله، عن أبي رافع، قال كان رسول الله صلى الله عليه وسلم إذا صلى العصر ذهب إلى بني عبد الأشهل فيتحدث عندهم حتى ينحدر للمغرب ‏.‏ قال أبو رافع فبينما النبي صلى الله عليه وسلم يسرع إلى المغرب مررنا بالبقيع فقال ‏\"‏ أف لك أف لك ‏\"‏ ‏.‏ قال فكبر ذلك في ذرعي فاستأخرت وظننت أنه يريدني فقال ‏\"‏ ما لك امش ‏\"‏ ‏.‏ فقلت أحدثت حدثا ‏.‏ قال ‏\"‏ ما ذاك ‏\"‏ ‏.‏ قلت أففت بي ‏.‏ قال ‏\"‏ لا ولكن هذا فلان بعثته ساعيا على بني فلان فغل نمرة فدرع الآن مثلها من نار ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Rafi said:                       \"After the Messenger of Allah (ﷺ) had prayed Asr, he would go to Banu 'Abdul-Ashhal to speak to them, until the time for Maghrib came.\" Abu Rafi said: \"While the Prophet (ﷺ) was hastening to prayMaghrib, we passed by and he said: 'Fie on you, fie on you!' That upset me so I slowed down because I thought hat he meant me. He said: 'What is the matter with you? Keep up!' I said: 'Is there something wrong?' Hesaid: 'Why are you asking that? I said: 'Because you said: \"Fie on you\" to me.' He said: 'No, that was so-and-so whom I had sent to collect Zakat from the tribe of so-and-so, and he stole a Namirah and nowhe is clothed with something similarmade of Fire.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30443",
        "20029",
        "11070",
        "479"
      ]
    },
    {
      "id": "sunan-an-nasai-863",
      "hadith_no": "863",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا هارون بن عبد الله، قال حدثنا معاوية بن عمرو، قال حدثنا أبو إسحاق، عن ابن جريج، قال أخبرني منبوذ، - رجل من آل أبي رافع - عن الفضل بن عبيد الله بن أبي رافع، عن أبي رافع، نحوه ‏.‏",
      "text_en": " (Another chain) with similar from  Abu Rafi.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20389",
        "11049",
        "11070",
        "479"
      ]
    },
    {
      "id": "sunan-an-nasai-968",
      "hadith_no": "968",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا حميد بن مسعدة، عن سليم، - وهو ابن أخضر - عن التيمي، قال حدثني بكر بن عبد الله المزني، عن أبي رافع، قال صليت خلف أبي هريرة صلاة العشاء - يعني العتمة - فقرأ سورة ‏{‏ إذا السماء انشقت ‏}‏ فسجد فيها فلما فرغ قلت يا أبا هريرة هذه - يعني سجدة - ما كنا نسجدها ‏.‏ قال سجد بها أبو القاسم صلى الله عليه وسلم وأنا خلفه فلا أزال أسجد بها حتى ألقى أبا القاسم صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated that Abu Rafi' said:                     \"I prayed Isha' prayer- meaning Al-'Atamah behind Abu Hurairah and he recited: 'When the heaven is split asunder' and prostrated during it. When he had finished praying, I said: 'O Abu Hurairah, (this is) a prostration that we are not used to.' He said: 'Abu Al-Qasim (ﷺ) did this prostration and I was (praying) behind him, and I will continue to do this prostration until I meet Abu Al-Qasim.",
      "usc_msa_ref": "",
      "chain": [
        "30430",
        "20546",
        "11289",
        "11267",
        "479"
      ]
    },
    {
      "id": "sunan-an-nasai-4617",
      "hadith_no": "4617",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا عبد الرحمن، قال حدثنا مالك، عن زيد بن أسلم، عن عطاء بن يسار، عن أبي رافع، أن رسول الله صلى الله عليه وسلم استسلف من رجل بكرا فأتاه يتقاضاه بكره فقال لرجل ‏\"‏ انطلق فابتع له بكرا ‏\"‏ ‏.‏ فأتاه فقال ما أصبت إلا بكرا رباعيا خيارا ‏.‏ فقال ‏\"‏ أعطه فإن خير المسلمين أحسنهم قضاء ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Rafi that the Messenger of Allah borrowed a young camel from a man, and then he came to get his camel back. He said to a man:                     \"Go and buy a young camel for him.\" He came and said: \"I could only get a Raba camel of good quality.\" He said: \"Give it to him, for the best of the Muslims is the one who is best in repaying.\"",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20033",
        "20001",
        "11163",
        "11020",
        "479"
      ]
    },
    {
      "id": "sunan-an-nasai-4702",
      "hadith_no": "4702",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا علي بن حجر، قال حدثنا سفيان، عن إبراهيم بن ميسرة، عن عمرو بن الشريد، عن أبي رافع، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الجار أحق بسقبه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Rafi said:                     \"The Messenger of Allah said\" \"The neighbor has more right to property that is near.\"'",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20012",
        "11240",
        "10952",
        "479"
      ]
    },
    {
      "id": "sunan-an-nasai-5705",
      "hadith_no": "5705",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا سويد، قال أنبأنا عبد الله، عن السري بن يحيى، قال حدثنا أبو حفص، - إمام لنا وكان من أسنان الحسن - عن أبي رافع أن عمر بن الخطاب رضى الله عنه قال إذا خشيتم من نبيذ شدته فاكسروه بالماء - قال عبد الله - من قبل أن يشتد ‏.‏",
      "text_en": " It was narrated from Abu Rafi' that :                     'Umar bin Al-Khattab, may Allah be pleased with him, said: \"If you fear that Nabidh may be too strong, then weaken it with water.\" 'Abdullah (one of the narrators) said: \"Before it gets strong.\"",
      "usc_msa_ref": "",
      "chain": [
        "20025",
        "24155",
        "479",
        "3"
      ]
    },
    {
      "id": "sunan-ibn-majah-13",
      "hadith_no": "13",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا نصر بن علي الجهضمي، حدثنا سفيان بن عيينة، في بيته أنا سألته، عن سالم أبي النضر، ثم مر في الحديث قال أو زيد بن أسلم عن عبيد الله بن أبي رافع عن أبيه أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ لا ألفين أحدكم متكئا على أريكته يأتيه الأمر مما أمرت به أو نهيت عنه فيقول لا أدري ما وجدنا في كتاب الله اتبعناه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ubaidullah bin Abu Rafi from his father, that:                     The Messenger of Allah (ﷺ) said: \"I do not want to find anyone of you reclining on his pillow, and when bad news comes to him of something that I have commanded or forbidden, he says, 'I do not know, whatever we find in the Book of Allah, we will follow.\"",
      "usc_msa_ref": "",
      "chain": [
        "30395",
        "20005",
        "11164",
        "11199",
        "479"
      ]
    },
    {
      "id": "sunan-ibn-majah-485",
      "hadith_no": "485",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا عبد الملك بن محمد الرقاشي، حدثنا معمر بن محمد بن عبيد الله بن أبي رافع، حدثني أبي، عن عبيد الله بن أبي رافع، عن أبيه، أن رسول الله  صلى الله عليه وسلم  كان إذا توضأ حرك خاتمه ‏.‏",
      "text_en": " 'Ubaidullah bin Abu Rafi' narrated from his father that:                     Whenever the Messenger of Allah performed ablution, he moved his ring.",
      "usc_msa_ref": "",
      "chain": [
        "32041",
        "15492",
        "11199",
        "479"
      ]
    },
    {
      "id": "sunan-ibn-majah-577",
      "hadith_no": "577",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا إسماعيل ابن علية، عن حميد، عن بكر بن عبد الله، عن أبي رافع، عن أبي هريرة، أنه لقيه النبي  صلى الله عليه وسلم  في طريق من طرق المدينة وهو جنب فانسل ففقده النبي  صلى الله عليه وسلم  فلما جاء قال ‏\"‏ أين كنت يا أبا هريرة ‏\"‏ ‏.‏ قال يا رسول الله لقيتني وأنا جنب فكرهت أن أجالسك حتى أغتسل ‏.‏ فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ المؤمن لا ينجس ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Rafi' that :                     Abu Hurairah was met by the Prophet in one of the streets of Al-Madinah when he was in a state of sexual impurity, so he slipped away. The Prophet missed him, so when he came (later on), he said: 'Where were you O Abu Hurairah?' He said: 'O Messenger of Allah, you met me when I was in a state of sexual impurity, and I did not want to sit with you until I had a bath. The Messenger of Allah said: 'The believer does not become impure.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20208",
        "11279",
        "11267",
        "479",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-633",
      "hadith_no": "633",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا إسحاق بن منصور، أنبأنا عبد الصمد، حدثنا حماد، حدثنا عبد الرحمن بن أبي رافع، عن عمته، سلمى عن أبي رافع، أن النبي  صلى الله عليه وسلم  طاف على نسائه في ليلة وكان يغتسل عند كل واحدة منهن فقيل له يا رسول الله ألا تجعله غسلا واحدا فقال ‏\"‏ هو أزكى وأطيب وأطهر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Rafi' that:                     The Prophet went around to all of his wives in one night, and he had a bath after each one of them. It was said to him: \"O Messenger of Allah, why not make it one bath?\" He said: \"This is purer, better and cleaner.\"",
      "usc_msa_ref": "",
      "chain": [
        "30313",
        "20250",
        "20022",
        "479"
      ]
    },
    {
      "id": "sunan-ibn-majah-653",
      "hadith_no": "653",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا الفضل بن دكين، عن هشام الدستوائي، عن قتادة، عن الحسن، عن أبي رافع، عن أبي هريرة، عن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ إذا جلس الرجل بين شعبها الأربع ثم جهدها فقد وجب الغسل ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     The Messenger of Allah said: \"When a man sits between the four parts (arms and legs of his wife) and has intercourse, then bath is obligatory.\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20348",
        "20295",
        "11019",
        "11016",
        "479",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-1051",
      "hadith_no": "1051",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو ثور، إبراهيم بن خالد حدثنا أبو قطن، حدثنا شعبة، عن قتادة، عن خلاس، عن أبي رافع، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لو يعلمون ما في الصف الأول لكانت قرعة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Hurairah said:                      “The Messenger of Allah (ﷺ)said: ‘If they knew what (goodness) there is in the first row, theywould cast lots for it.’”",
      "usc_msa_ref": "",
      "chain": [
        "38072",
        "20563",
        "20020",
        "11019",
        "11283",
        "479",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-1075",
      "hadith_no": "1075",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا إسماعيل ابن علية، عن القاسم بن مهران، عن أبي رافع، عن أبي هريرة، أن رسول الله  صلى الله عليه وسلم  رأى نخامة في قبلة المسجد فأقبل على الناس فقال ‏\"‏ ما بال أحدكم يقوم مستقبله - يعني ربه - فيتنخع أمامه أيحب أحدكم أن يستقبل فيتنخع في وجهه إذا بزق أحدكم فليبزقن عن شماله أو ليقل هكذا في ثوبه ‏\"‏ ‏.‏ ثم أراني إسماعيل يبزق في ثوبه ثم يدلكه ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)saw somesputum in the direction of the Qiblah of the mosque. Heturned to thepeople and said:                      “What is wrong with one of you that hestandsfacing Him (meaning his Lord) and spits in front of Him? Wouldanyonelike to be faced by someone who spits in his face? If anyone ofyouneeds to spit, then let him spit to his left, or let him do likethisin his garment.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20208",
        "10956",
        "479",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-1449",
      "hadith_no": "1449",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا موسى بن عبد الرحمن أبو عيسى المسروقي، حدثنا زيد بن الحباب، حدثنا موسى بن عبيدة، حدثني سعيد بن أبي سعيد، مولى أبي بكر بن عمرو بن حزم عن أبي رافع، قال قال رسول الله  صلى الله عليه وسلم  للعباس ‏\"‏ يا عم ألا أحبوك ألا أنفعك ألا أصلك ‏\"‏ قال بلى يا رسول الله ‏.‏ قال ‏\"‏ تصلي أربع ركعات تقرأ في كل ركعة بفاتحة الكتاب وسورة فإذا انقضت القراءة فقل سبحان الله والحمد لله ولا إله إلا الله والله أكبر خمس عشرة مرة قبل أن تركع ثم اركع فقلها عشرا ثم ارفع رأسك فقلها عشرا ثم اسجد فقلها عشرا ثم ارفع رأسك فقلها عشرا ثم اسجد فقلها عشرا ثم ارفع رأسك فقلها عشرا قبل أن تقوم فتلك خمس وسبعون في كل ركعة وهي ثلاثمائة في أربع ركعات فلو كانت ذنوبك مثل رمل عالج غفرها الله لك ‏\"‏ ‏.‏ قال يا رسول الله ومن لم يستطع يقولها في يوم قال ‏\"‏ قلها في جمعة فإن لم تستطع فقلها في شهر ‏\"‏ ‏.‏ حتى قال ‏\"‏ فقلها في سنة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Rafi’ said:                      “The Messenger of Allah (ﷺ)saidto ‘Abbas: ‘O uncle, shall I not give you a gift, shall I notbenefit you, shall I not uphold my ties of kinship with you?’ Hesaid:‘Of course, O Messenger of Allah.’ He said: ‘Pray fourRak’ah, andrecite in each Rak’ah the Opening of the Book(Al-Fatihah) and aSurah. When you have finished reciting, say:Subhan-Allah wal-hamduLillah wa la ilaha illallah wa Allahu Akbar(Glory is to Allah, praiseis to Allah, none has the right to beworshipped but Allah and Allahis the Most Great) fifteen timesbefore you bow in Ruku’. Then bow andsay it ten times; then raiseyour head and say it ten times; thenprostrate and say it ten times;then raise your head and say it tentimes; then prostrate and say itten times; then raise your head andsay it ten times before you standup. That wil be seventy-five timesin each Rak’ah and three hundredtimes in the four Rak’ah, and even ifyour sins are like the grainsof sand, Allah will forgive you forthem.’ He said: ‘O Messengerof Allah, what if someone cannot say itin one day?’ He said: ‘Thensay it once in a week; if you cannot, thensay it once in a month’until he said: ‘Once in a year.’”",
      "usc_msa_ref": "",
      "chain": [
        "20650",
        "12527",
        "479"
      ]
    },
    {
      "id": "sunan-ibn-majah-1594",
      "hadith_no": "1594",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا أحمد بن عبدة، أنبأنا حماد بن زيد، حدثنا ثابت، عن أبي رافع، عن أبي هريرة، ‏.‏ أن امرأة، سوداء كانت تقم المسجد ففقدها رسول الله  صلى الله عليه وسلم  فسأل عنها بعد أيام فقيل له إنها ماتت ‏.‏ قال ‏\"‏ فهلا آذنتموني ‏\"‏ ‏.‏ فأتى قبرها فصلى عليها ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that a black woman used to sweepthemosque. The Messenger of Allah (ﷺ) noticed she was missing andheasked about her after a few days. He was told that she had died. Hesaid:                      “Why did you not tell me?” Then he went to her grave andofferedthe funeral prayer for her.",
      "usc_msa_ref": "",
      "chain": [
        "30423",
        "20022",
        "11269",
        "479"
      ]
    },
    {
      "id": "sunan-ibn-majah-1618",
      "hadith_no": "1618",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا عبد الملك بن محمد الرقاشي، حدثنا عبد العزيز بن الخطاب، حدثنا مندل بن علي، أخبرني محمد بن عبيد الله بن أبي رافع، عن داود بن الحصين، عن أبيه، عن أبي رافع، قال سل رسول الله  صلى الله عليه وسلم  سعدا ورش على قبره ماء ‏.‏",
      "text_en": " It wasnarrated that Abu Rafi’ said:                      “The Messenger of Allah (ﷺ)placed Sa’d gently in his grave and sprinkled water on it.”",
      "usc_msa_ref": "",
      "chain": [
        "34136",
        "25314",
        "15492",
        "11160",
        "479"
      ]
    },
    {
      "id": "sunan-ibn-majah-1842",
      "hadith_no": "1842",
      "source": "Sunan Ibn Majah",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا عبد الرحمن بن مهدي، عن حماد بن سلمة، عن ثابت، عن أبي رافع، عن أبى بن كعب، أن النبي  صلى الله عليه وسلم  كان يعتكف العشر الأواخر من رمضان فسافر عاما فلما كان من العام المقبل اعتكف عشرين يوما ‏.‏",
      "text_en": " It wasnarrated from Ubayy bin Ka’b that:                      The Prophet (ﷺ) used tospendthe last ten days of Ramadan in I’tikaf. One year he wastraveling,so the following year he spent twenty days in I’tikaf.",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "20033",
        "20021",
        "11269",
        "479",
        "39"
      ]
    },
    {
      "id": "sunan-ibn-majah-2233",
      "hadith_no": "2233",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا محمد بن عبد الله الخزاعي، والحجاج، والهيثم بن جميل، قالوا حدثنا حماد، عن ثابت، عن أبي رافع، عن أبي هريرة، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ كان زكريا نجارا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:                     \"Zakariyya was a carpenter.\"",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "37563",
        "20381",
        "20391",
        "20022",
        "11269",
        "479",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-2373",
      "hadith_no": "2373",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا هشام بن عمار، حدثنا مسلم بن خالد، حدثنا زيد بن أسلم، عن عطاء بن يسار، عن أبي رافع، أن النبي  صلى الله عليه وسلم  استسلف من رجل بكرا وقال ‏\"‏ إذا جاءت إبل الصدقة قضيناك ‏\"‏ ‏.‏ فلما قدمت قال ‏\"‏ يا أبا رافع اقض هذا الرجل بكره ‏\"‏ ‏.‏ فلم أجد إلا رباعيا فصاعدا فأخبرت النبي  صلى الله عليه وسلم  فقال ‏\"‏ أعطه فإن خير الناس أحسنهم قضاء ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Rafi' that:                     the Prophet (ﷺ) asked a man to give as a loan a young camel and said: “When the camels of the Sadaqah come, we will pay you back.” When the camels came, he said: \" O Abu Rafi', pay this man back for his Young camel.\" But all I could find was a seven-year-old camel or that which is better. I told the Prophet  (ﷺ) and he said: \"Give it to him, for the best of People are those who are best in repaying.\"",
      "usc_msa_ref": "",
      "chain": [
        "30288",
        "23063",
        "11163",
        "11020",
        "479"
      ]
    },
    {
      "id": "sunan-ibn-majah-2329-2",
      "hadith_no": "2329",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Rulings - كتاب الأحكام",
      "chapter_no": "13",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا خالد بن الحارث، حدثنا سعيد بن أبي عروبة، عن قتادة، عن خلاس، عن أبي رافع، عن أبي هريرة، أنه ذكر أن رجلين، ادعيا دابة ولم يكن بينهما بينة فأمرهما النبي صلى الله عليه وسلم أن يستهما على اليمين ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     he said that two men laid claim to an animal, and neither of them had any proof, so the Prophet (ﷺ) commanded them to cast lots as to which of them should swear an oath.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20226",
        "11073",
        "11019",
        "11283",
        "479",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-2346-2",
      "hadith_no": "2346",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Rulings - كتاب الأحكام",
      "chapter_no": "13",
      "text_ar": "حدثنا جميل بن الحسن العتكي، حدثنا عبد الأعلى، حدثنا سعيد، عن قتادة، عن خلاس، عن أبي رافع، عن أبي هريرة، أن رجلين، تدارءا في بيع ليس لواحد منهما بينة فأمرهما رسول الله صلى الله عليه وسلم أن يستهما على اليمين أحبا ذلك أم كرها ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that :                     two men disputed concerning a transaction, and neither of them had proof. The Messenger of Allah commanded them to draw lots as to which of them should swear an oath, whether they liked it or not.",
      "usc_msa_ref": "",
      "chain": [
        "34046",
        "20246",
        "11168",
        "11019",
        "11283",
        "479",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-2590",
      "hadith_no": "2590",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Pre-emption - كتاب الشفعة",
      "chapter_no": "17",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعلي بن محمد، قالا حدثنا سفيان بن عيينة، عن إبراهيم بن ميسرة، عن عمرو بن الشريد، عن أبي رافع، أن النبي صلى الله عليه وسلم قال ‏\"‏ الجار أحق بسقبه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Rafi' that the Prophet (ﷺ) said:                     “The neighbor has more right to property that is near.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "38409",
        "20005",
        "11240",
        "10952",
        "479"
      ]
    },
    {
      "id": "sunan-ibn-majah-2594",
      "hadith_no": "2594",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Pre-emption - كتاب الشفعة",
      "chapter_no": "17",
      "text_ar": "حدثنا عبد الله بن الجراح، حدثنا سفيان بن عيينة، عن إبراهيم بن ميسرة، عن عمرو بن الشريد، عن أبي رافع، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الشريك أحق بسقبه ما كان ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Rafi' that the Messenger of Allah (ﷺ) said:                     “The partner has more right to what is near him, so long as he is still a partner.”",
      "usc_msa_ref": "",
      "chain": [
        "20005",
        "11240",
        "10952",
        "479"
      ]
    },
    {
      "id": "sunan-ibn-majah-2721",
      "hadith_no": "2721",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "قال همام فحدثني حميد الطويل، عن بكر بن عبد الله، عن أبي رافع، قال فبعث الله عز وجل ملكا فاختصموا إليه ثم رجعوا فقال انظروا أى القريتين كانت أقرب فألحقوه بأهلها ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "11267",
        "479"
      ]
    }
  ],
  "total_hadiths": 86
}