{
  "id": "5",
  "name": "Ali ibn Abi Talib ( علي بن أبي طالب بن عبد المطلب ( رضي الله عنه",
  "full_name": "Ali ibn Abi Talib ( علي بن أبي طالب بن عبد المطلب ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "biography": {
    "birth": {
      "date_hijri": "23",
      "date_gregorian": "600",
      "date_display": [
        "23 BH",
        "600 CE",
        "13 R"
      ],
      "place": "13 Rajab, Makkah"
    },
    "death": {
      "date_hijri": "40",
      "date_gregorian": "661",
      "date_display": null,
      "place": "21 Ramadhan, Kufa",
      "reason": "Martyred"
    },
    "places_of_stay": [
      "Makkah",
      "Medina",
      "kufa"
    ],
    "area_of_interest": [
      "Tafsir/Quran",
      "Recitation/Quran",
      "Narrator [ ع  -  صحابة ]",
      "Commander",
      "Khalifah"
    ],
    "tags": [
      "Quraish",
      "B.Hashim",
      "Cousin",
      "Early Muslim",
      "Emigrant",
      "Badr",
      "Uhud",
      "Khaybar",
      "Scribe",
      "Promised Paradise"
    ]
  },
  "parents": [
    {
      "id": "9992",
      "name": "Abu Talib ibn 'Abd al-Muttalib أبو طالب بن عبد المطلب بن هاشم",
      "grade": "Prophet's Relative [Non-Muslim]"
    },
    {
      "id": "77",
      "name": "Fatima bint Asad ( فاطمة بنت أسد بن هاشم بن عبد مناف ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "spouses": [
    {
      "id": "63",
      "name": "Fatima bint Muhammad ( فاطمة الزهراء بنت محمد بن عبد الله ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "565",
      "name": "Khawlah bint Ja'far ( خولة الحنفية ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "69",
      "name": "Asma bint 'Umays ( أسماء بنت عميس بن معد ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "siblings": [
    {
      "id": "164",
      "name": "Talib ibn Abi Talib ( طالب بن ابي طالب ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "165",
      "name": "'Aqeel ibn Abi Talib ( عقيل بن أبي طالب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "21",
      "name": "Ja'far ibn Abi Talib ( جعفر بن أبي طالب بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "198",
      "name": "Umm Hani bint Abi Talib ( ام هانى بنت أبي طالب ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "199",
      "name": "Jumanah bint Abi Talib ( جمانة بنت أبي طالب بن عبد المطلب ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "children": [
    {
      "id": "30",
      "name": "Hassan ibn Ali bin Abi Talib ( الحسن بن علي بن أﺑﻲ طالب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "31",
      "name": "Hussain ibn 'Ali ibn Abi Talib ( حسين بن علي بن أﺑﻲ طالب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "98",
      "name": "Zaynab bint 'Ali bin Abi Talib ( زينب بنت على بن أبي طالب ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "99",
      "name": "Umm Kulthum bint 'Ali bin Abi Talib ( أم كلثوم بنت علي بن أبي طالب ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "10600",
      "name": "Muhammad bin 'Ali bin al-Hanfiyyah محمد بن الحنفية",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "19933",
      "name": "'Umar bin 'Ali bin Abi Talib عمر بن علي بن أبي طالب",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19508",
      "name": "Fatima bint 'Ali bin Abi Talib فاطمة بنت علي بن أبي طالب",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "2",
      "name": "Abu Bakr As-Siddique ( أبو بكر الصديق ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3",
      "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "63",
      "name": "Fatima bint Muhammad ( فاطمة الزهراء بنت محمد بن عبد الله ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "163",
      "name": "al-Miqdad ibn al-Aswad ( المقداد بن الأسود الكندي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "30",
      "name": "Hassan ibn Ali bin Abi Talib ( الحسن بن علي بن أﺑﻲ طالب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "31",
      "name": "Hussain ibn 'Ali ibn Abi Talib ( حسين بن علي بن أﺑﻲ طالب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "16",
      "name": "ibn Mas'ud ( عبد الله بن مسعود ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "400",
      "name": "al-Bara' bin Azib bin al-Harith ( البراء بن عازب بن الحارث ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "38",
      "name": "Abu Sa'id al-Khudri ( أبو سعيد سعد بن مالك بن سنان الخدري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "182",
      "name": "Suhayb bin Sinan ar-Rumi ( صهيب بن سنان بن مالك الرومي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "438",
      "name": "Safinah ( سفينة مولى رسول الله صلى الله عليه وسلم ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "106",
      "name": "'Abdullah ibn al-Zubayr ( عبد الله بن الزبير بن العوام ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "108",
      "name": "'Abdullah ibn Ja'far ( عبد الله بن جعفر بن أبي طالب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "34",
      "name": "Jabir ibn 'Abdullah ( جابر بن عبد الله بن عمرو السلمي الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "393",
      "name": "Jabir bin Samra ( جابر بن سمرة السوائي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "384",
      "name": "Zayd bin Arqam ( زيد بن أرقم الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "41",
      "name": "Abu Musa al-Asha'ari ( أبو موسى الأشعري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "405",
      "name": "Abu Umama bin Sahl ( أسعد أبو أمامة بن سهل بن حنيف ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "1937",
      "name": "Abu Layla ( أبو ليلى الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "2080",
      "name": "Ja'dah bin Hubayra bin Abi Wahb ( جعدة بن هبيرة بن أبي وهب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4081",
      "name": "Bashr bin Sahaym ( بشر بن سحيم ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5202",
      "name": "'Amr bin Hurayth bin 'Amr bin 'Uthman ( عمرو بن حريث بن عمرو بن عثمان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4047",
      "name": "Abu Juhayfa al-Sawai' ( أبو جحيفة السوائي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3660",
      "name": "Abu al-Tufayl, 'Amir bin Wathla ( أبو الطفيل عامر بن واثلة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "10600",
      "name": "Muhammad bin 'Ali bin al-Hanfiyyah محمد بن الحنفية",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "19933",
      "name": "'Umar bin 'Ali bin Abi Talib عمر بن علي بن أبي طالب",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19508",
      "name": "Fatima bint 'Ali bin Abi Talib فاطمة بنت علي بن أبي طالب",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11045",
      "name": "'Ali bin al-Husain bin 'Ali علي بن الحسين بن علي - زين العابدين",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19566",
      "name": "Umm Musa أم موسى",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11659",
      "name": "al-Nazal bin Sabra النزال بن سبرة",
      "grade": "Follower(Tabi') [2nd Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "106",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا علي بن الجعد، قال أخبرنا شعبة، قال أخبرني منصور، قال سمعت ربعي بن حراش، يقول سمعت عليا، يقول قال النبي صلى الله عليه وسلم ‏\"‏ لا تكذبوا على، فإنه من كذب على فليلج النار ‏\"‏‏.‏",
      "text_en": " Narrated `Ali:                     The Prophet said, \"Do not tell a lie against me for whoever tells a lie against me (intentionally) then he will surely enter the Hell-fire.\"",
      "chain": [
        "20386",
        "20020",
        "11067",
        "11334",
        "5"
      ]
    },
    {
      "hadith_no": "132",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا مسدد، قال حدثنا عبد الله بن داود، عن الأعمش، عن منذر الثوري، عن محمد ابن الحنفية، عن علي، قال كنت رجلا مذاء فأمرت المقداد أن يسأل النبي صلى الله عليه وسلم فسأله فقال ‏\"‏ فيه الوضوء ‏\"‏‏.‏",
      "text_en": " Narrated `Ali:                     I used to get the emotional urethral discharge frequently so I requested Al-Miqdad to ask the Prophet about it. Al-Miqdad asked him and he replied, \"One has to perform ablution (after it).\" (See Hadith No. 269).",
      "chain": [
        "30175",
        "20330",
        "11060",
        "11398",
        "10600",
        "5"
      ]
    },
    {
      "hadith_no": "269",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو الوليد، قال حدثنا زائدة، عن أبي حصين، عن أبي عبد الرحمن، عن علي، قال كنت رجلا مذاء فأمرت رجلا أن يسأل النبي صلى الله عليه وسلم لمكان ابنته فسأل فقال ‏\"‏ توضأ واغسل ذكرك ‏\"‏‏.‏",
      "text_en": " Narrated `Ali:                     I used to get emotional urethral discharge frequently. Being the son-in-law of the Prophet I requested a man to ask him about it. So the man asked the Prophet about it. The Prophet replied, \"Perform ablution after washing your organ (penis).",
      "chain": [
        "20296",
        "20320",
        "11371",
        "11359",
        "5"
      ]
    },
    {
      "hadith_no": "880",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا علي، قال حدثنا حرمي بن عمارة، قال حدثنا شعبة، عن أبي بكر بن المنكدر، قال حدثني عمرو بن سليم الأنصاري، قال أشهد على أبي سعيد قال أشهد على رسول الله صلى الله عليه وسلم قال ‏\"‏ الغسل يوم الجمعة واجب على كل محتلم، وأن يستن وأن يمس طيبا إن وجد ‏\"‏‏.‏ قال عمرو أما الغسل فأشهد أنه واجب، وأما الاستنان والطيب فالله أعلم أواجب هو أم لا، ولكن هكذا في الحديث‏.‏ قال أبو عبد الله هو أخو محمد بن المنكدر ولم يسم أبو بكر هذا‏.‏ رواه عنه بكير بن الأشج وسعيد بن أبي هلال وعدة‏.‏ وكان محمد بن المنكدر يكنى بأبي بكر وأبي عبد الله‏.‏",
      "text_en": " Narrated Abu Sa`id:                     I testify that Allah's Apostle said, \"The taking of a bath on Friday is compulsory for every male Muslim who has attained the age of puberty and (also) the cleaning of his teeth with Siwak, and the using of perfume if it is available.\" `Amr (a sub-narrator) said, \"I confirm that the taking of a bath is compulsory, but as for the Siwak and the using of perfume, Allah knows better whether it is obligatory or not, but according to the Hadith it is as above.\")",
      "chain": [
        "5",
        "20221",
        "20020",
        "1544"
      ]
    },
    {
      "hadith_no": "1127",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا أبو اليمان، قال أخبرنا شعيب، عن الزهري، قال أخبرني علي بن حسين، أن حسين بن علي، أخبره أن علي بن أبي طالب أخبره أن رسول الله صلى الله عليه وسلم طرقه وفاطمة بنت النبي  عليه السلام  ليلة فقال ‏\"‏ ألا تصليان ‏\"‏‏.‏ فقلت يا رسول الله، أنفسنا بيد الله، فإذا شاء أن يبعثنا بعثنا‏.‏ فانصرف حين قلنا ذلك ولم يرجع إلى شيئا‏.‏ ثم سمعته وهو مول يضرب فخذه وهو يقول ‏\"‏وكان الإنسان أكثر شىء جدلا‏}‏‏\"‏‏.‏",
      "text_en": " Narrated `Ali bin Abi Talib:                     One night Allah's Apostle came to me and Fatima, the daughter of the Prophet and asked, \"Won't you pray (at night)?\" I said, \"O Allah's Apostle! Our souls are in the hands of Allah and if He wants us to get up He will make us get up.\" When I said that, he left us without saying anything and I heard that he was hitting his thigh and saying, \"But man is more quarrelsome than anything.\" (18.54)",
      "chain": [
        "30330",
        "20428",
        "11013",
        "11045",
        "31",
        "5"
      ]
    },
    {
      "hadith_no": "1189",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of Prayer at Masjid Makkah and Madinah - كتاب فضل الصلاة فى مسجد مكة والمدينة",
      "chapter_no": "20",
      "text_ar": "حدثنا علي، حدثنا سفيان، عن الزهري، عن سعيد، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ لا تشد الرحال إلا إلى ثلاثة مساجد المسجد الحرام، ومسجد الرسول صلى الله عليه وسلم ومسجد الأقصى ‏\"‏‏.‏",
      "text_en": "      Narrated Abu Huraira:                        The Prophet said, \"Do not set out on a journey     except for three Mosques i.e. Al-Masjid-AI-Haram, the Mosque of      Allah's Apostle , and the Mosque of Al-Aqsa, (Mosque of Jerusalem).\"",
      "chain": [
        "5",
        "20005",
        "11013",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "1251",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا علي، حدثنا سفيان، قال سمعت الزهري، عن سعيد بن المسيب، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يموت لمسلم ثلاثة من الولد، فيلج النار إلا تحلة القسم ‏\"‏‏.‏ قال أبو عبد الله ‏{‏وإن منكم إلا واردها‏}‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"No Muslim whose three children died will go to the Fire except for Allah's oath (i.e. everyone has to pass over the bridge above the lake of fire).\"",
      "chain": [
        "5",
        "20005",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "1362",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا عثمان، قال حدثني جرير، عن منصور، عن سعد بن عبيدة، عن أبي عبد الرحمن، عن علي  رضى الله عنه  قال كنا في جنازة في بقيع الغرقد، فأتانا النبي صلى الله عليه وسلم فقعد وقعدنا حوله، ومعه مخصرة فنكس، فجعل ينكت بمخصرته ثم قال ‏\"‏ ما منكم من أحد، ما من نفس منفوسة إلا كتب مكانها من الجنة والنار، وإلا قد كتب شقية أو سعيدة ‏\"‏‏.‏ فقال رجل يا رسول الله، أفلا نتكل على كتابنا وندع العمل، فمن كان منا من أهل السعادة فسيصير إلى عمل أهل السعادة، وأما من كان منا من أهل الشقاوة فسيصير إلى عمل أهل الشقاوة قال ‏\"‏ أما أهل السعادة فييسرون لعمل السعادة، وأما أهل الشقاوة فييسرون لعمل الشقاوة ‏\"‏، ثم قرأ ‏{‏فأما من أعطى واتقى‏}‏ الآية‏.‏",
      "text_en": " Narrated `Ali:                     \" We were accompanying a funeral procession in Baqi-I-Gharqad. The Prophet came to us and sat and we sat around him. He had a small stick in his hand then he bent his head and started scraping the ground with it. He then said, \"There is none among you, and not a created soul, but has place either in Paradise or in Hell assigned for him and it is also determined for him whether he will be among the blessed or wretched.\" A man said, \"O Allah's Apostle! Should we not depend on what has been written for us and leave the deeds as whoever amongst us is blessed will do the deeds of a blessed person and whoever amongst us will be wretched, will do the deeds of a wretched person?\" The Prophet said, \"The good deeds are made easy for the blessed, and bad deeds are made easy for the wretched.\" Then he recited the Verses:-- \"As for him who gives (in charity) and is Allah-fearing And believes in the Best reward from Allah. \" (92.5-6)",
      "chain": [
        "4",
        "20028",
        "11067",
        "11344",
        "11359",
        "5"
      ]
    },
    {
      "hadith_no": "1426",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا علي، سمع هشيما، أخبرنا حصين، عن زيد بن وهب، قال مررت بالربذة فإذا أنا بأبي، ذر  رضى الله عنه  فقلت له ما أنزلك منزلك هذا قال كنت بالشأم، فاختلفت أنا ومعاوية في الذين يكنزون الذهب والفضة ولا ينفقونها في سبيل الله‏.‏ قال معاوية نزلت في أهل الكتاب‏.‏ فقلت نزلت فينا وفيهم‏.‏ فكان بيني وبينه في ذاك، وكتب إلى عثمان  رضى الله عنه  يشكوني، فكتب إلى عثمان أن اقدم المدينة‏.‏ فقدمتها فكثر على الناس حتى كأنهم لم يروني قبل ذلك، فذكرت ذاك لعثمان فقال لي إن شئت تنحيت فكنت قريبا‏.‏ فذاك الذي أنزلني هذا المنزل، ولو أمروا على حبشيا لسمعت وأطعت‏.‏",
      "text_en": " Narrated Zaid bin Wahab:                     I passed by a place called Ar-Rabadha and by chance I met Abu Dhar and asked him, \"What has brought you to this place?\" He said, \"I was in Sham and differed with Muawiya on the meaning of (the following verses of the Qur'an): 'They who hoard up gold and silver and spend them not in the way of Allah.' (9.34). Muawiya said, 'This verse is revealed regarding the people of the scriptures.\" I said, It was revealed regarding us and also the people of the scriptures.\" So we had a quarrel and Mu'awiya sent a complaint against me to `Uthman. `Uthman wrote to me to come to Medina, and I came to Medina. Many people came to me as if they had not seen me before. So I told this to `Uthman who said to me, \"You may depart and live nearby if you wish.\" That was the reason for my being here for even if an Ethiopian had been nominated as my ruler, I would have obeyed him .",
      "chain": [
        "5",
        "20468",
        "15097",
        "11341"
      ]
    },
    {
      "hadith_no": "1704",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا علي، حدثنا سفيان، قال أخبرني عبيد الله بن أبي يزيد، سمع ابن عباس  رضى الله عنهما  يقول أنا ممن، قدم النبي صلى الله عليه وسلم ليلة المزدلفة في ضعفة أهله‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     I as among those whom the Prophet sent on the night of Al-Muzdalifa early being among the weak members of his family.",
      "chain": [
        "5",
        "20005",
        "11258",
        "17"
      ]
    },
    {
      "hadith_no": "1732",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا قبيصة، حدثنا سفيان، عن ابن أبي نجيح، عن مجاهد، عن عبد الرحمن بن أبي ليلى، عن علي  رضى الله عنه  قال أمرني رسول الله صلى الله عليه وسلم أن أتصدق بجلال البدن التي نحرت وبجلودها‏.‏",
      "text_en": " Narrated `Ali:                     Allah's Apostle ordered me to give in charity the skin and the coverings of the Budn which I had slaughtered.",
      "chain": [
        "20351",
        "20012",
        "11254",
        "11028",
        "11196",
        "5"
      ]
    },
    {
      "hadith_no": "1741",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، قال أخبرني ابن أبي نجيح، عن مجاهد، عن عبد الرحمن بن أبي ليلى، عن علي  رضى الله عنه  قال بعثني النبي صلى الله عليه وسلم فقمت على البدن، فأمرني فقسمت لحومها، ثم أمرني فقسمت جلالها وجلودها‏.‏   قال سفيان وحدثني عبد الكريم، عن مجاهد، عن عبد الرحمن بن أبي ليلى، عن علي  رضى الله عنه  قال أمرني النبي صلى الله عليه وسلم أن أقوم على البدن، ولا أعطي عليها شيئا في جزارتها‏.‏",
      "text_en": " Narrated `Ali:                     The Prophet sent me to supervise the (slaughtering of) Budn (Hadi camels) and ordered me to distribute their meat, and then he ordered me to distribute their covering sheets and skins. 'All added, \"The Prophet ordered me to supervise the slaughtering (of the Budn) and not to give anything (of their bodies) to the butcher as wages for slaughtering.\"",
      "chain": [
        "28531",
        "20012",
        "11254",
        "11028",
        "11196",
        "5"
      ]
    },
    {
      "hadith_no": "1743",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن ابن جريج، قال أخبرني الحسن بن مسلم، وعبد الكريم الجزري، أن مجاهدا، أخبرهما أن عبد الرحمن بن أبي ليلى أخبره أن عليا  رضى الله عنه  أخبره أن النبي صلى الله عليه وسلم أمره أن يقوم على بدنه، وأن يقسم بدنه كلها، لحومها وجلودها وجلالها، ولا يعطي في جزارتها شيئا‏.‏",
      "text_en": " Narrated `Ali:                     The Prophet ordered me to supervise the (slaughtering) of Budn (Hadi camel) and to distribute their meat, skins and covering sheets in charity and not to give anything (of their bodies) to the butcher as wages for slaughtering.",
      "chain": [
        "30175",
        "20031",
        "11070",
        "11557",
        "18655",
        "11196",
        "5"
      ]
    },
    {
      "hadith_no": "1744",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو نعيم، حدثنا سيف بن أبي سليمان، قال سمعت مجاهدا، يقول حدثني ابن أبي ليلى، أن عليا  رضى الله عنه  حدثه قال أهدى النبي صلى الله عليه وسلم مائة بدنة، فأمرني بلحومها فقسمتها، ثم أمرني بجلالها فقسمتها، ثم بجلودها فقسمتها‏.‏",
      "text_en": " Narrated `Ali:                     The Prophet offered one hundred Budn as Hadi and ordered me to distribute their meat (in charity) and I did so. Then he ordered me to distribute their covering sheets in charity and I did so. Then he ordered me to distribute their skins in charity and I did so.",
      "chain": [
        "20348",
        "11558",
        "11028",
        "11196",
        "5"
      ]
    },
    {
      "hadith_no": "1903",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of Madinah - كتاب فضائل المدينة",
      "chapter_no": "29",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الرحمن، حدثنا سفيان، عن الأعمش، عن إبراهيم التيمي، عن أبيه، عن علي  رضى الله عنه  قال ما عندنا شىء إلا كتاب الله، وهذه الصحيفة عن النبي صلى الله عليه وسلم ‏\"‏ المدينة حرم، ما بين عائر إلى كذا، من أحدث فيها حدثا، أو آوى محدثا، فعليه لعنة الله والملائكة والناس أجمعين، لا يقبل منه صرف ولا عدل ‏\"‏‏.‏ وقال ‏\"‏ ذمة المسلمين واحدة، فمن أخفر مسلما فعليه لعنة الله والملائكة والناس أجمعين، لا يقبل منه صرف ولا عدل، ومن تولى قوما بغير إذن مواليه، فعليه لعنة الله والملائكة والناس أجمعين، لا يقبل منه صرف ولا عدل ‏\"‏‏.‏",
      "text_en": " Narrated `Ali:                     We have nothing except the Book of Allah and this written paper from the Prophet (wherein is written:) Medina is a sanctuary from the 'Air Mountain to such and such a place, and whoever innovates in it an heresy or commits a sin, or gives shelter to such an innovator in it will incur the curse of Allah, the angels, and all the people, none of his compulsory or optional good deeds of worship will be accepted. And the asylum (of protection) granted by any Muslim is to be secured (respected) by all the other Muslims; and whoever betrays a Muslim in this respect incurs the curse of Allah, the angels, and all the people, and none of his compulsory or optional good deeds of worship will be accepted, and whoever (freed slave) befriends (take as masters) other than his manumitters without their permission incurs the curse of Allah, the angels, and all the people, and none of his compulsory or optional good deeds of worship will be accepted.",
      "chain": [
        "30160",
        "20033",
        "20012",
        "11060",
        "11322",
        "11405",
        "5"
      ]
    },
    {
      "hadith_no": "2099",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا علي، حدثنا سفيان، قال عمرو كان ها هنا رجل اسمه نواس، وكانت عنده إبل هيم، فذهب ابن عمر  رضى الله عنهما  فاشترى تلك الإبل من شريك له، فجاء إليه شريكه فقال بعنا تلك الإبل‏.‏ فقال ممن بعتها قال من شيخ، كذا وكذا‏.‏ فقال ويحك ذاك  والله  ابن عمر‏.‏ فجاءه فقال إن شريكي باعك إبلا هيما، ولم يعرفك‏.‏ قال فاستقها‏.‏ قال فلما ذهب يستاقها فقال دعها، رضينا بقضاء رسول الله صلى الله عليه وسلم لا عدوى‏.‏ سمع سفيان عمرا‏.‏",
      "text_en": " Narrated `Amr:                     Here (i.e. in Mecca) there was a man called Nawwas and he had camels suffering from the disease of excessive and unquenchable thirst. Ibn `Umar went to the partner of Nawwas and bought those camels. The man returned to Nawwas and told him that he had sold those camels. Nawwas asked him, \"To whom have you sold them?\" He replied, \"To such and such Sheikh.\" Nawwas said, \"Woe to you; By Allah, that Sheikh was Ibn `Umar.\" Nawwas then went to Ibn `Umar and said to him, \"My partner sold you camels suffering from the disease of excessive thirst and he had not known you.\" Ibn `Umar told him to take them back. When Nawwas went to take them, Ibn `Umar said to him, \"Leave them there as I am happy with the decision of Allah's Apostle that there is no oppression . \"",
      "chain": [
        "5",
        "20005",
        "11081"
      ]
    },
    {
      "hadith_no": "2134",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا علي، حدثنا سفيان، كان عمرو بن دينار يحدثه عن الزهري، عن مالك بن أوس، أنه قال من عنده صرف فقال طلحة أنا حتى يجيء خازننا من الغابة‏.‏ قال سفيان هو الذي حفظناه من الزهري ليس فيه زيادة‏.‏ فقال أخبرني مالك بن أوس سمع عمر بن الخطاب  رضى الله عنه  يخبر عن رسول الله صلى الله عليه وسلم قال ‏\"‏ الذهب بالذهب ربا إلا هاء وهاء، والبر بالبر ربا إلا هاء وهاء، والتمر بالتمر ربا إلا هاء وهاء، والشعير بالشعير ربا إلا هاء وهاء ‏\"‏‏.‏",
      "text_en": " Narrated Az-Zuhri from Malik bin Aus:                     that the latter said, \"Who has change?\" Talha said, \"I (will have change) when our storekeeper comes from the forest.\" Narrated `Umar bin Al-Khattab: Allah's Apostle said, \"The bartering of gold for silver is Riba, (usury), except if it is from hand to hand and equal in amount, and wheat grain for wheat grain is usury except if it is form hand to hand and equal in amount, and dates for dates is usury except if it is from hand to hand and equal in amount, and barley for barley is usury except if it is from hand to hand and equal in amount.\" (See Riba-Fadl in the glossary).",
      "chain": [
        "5",
        "20005",
        "11081",
        "11013",
        "3"
      ]
    },
    {
      "hadith_no": "2299",
      "source": " Sahih Bukhari ",
      "chapter": "Representation; Authorization; Business by Proxy - كتاب الوكالة",
      "chapter_no": "40",
      "text_ar": "حدثنا قبيصة، حدثنا سفيان، عن ابن أبي نجيح، عن مجاهد، عن عبد الرحمن بن أبي ليلى، عن علي  رضى الله عنه  قال أمرني رسول الله صلى الله عليه وسلم أن أتصدق بجلال البدن التي نحرت وبجلودها‏.‏",
      "text_en": " Narrated `Ali:                     Allah's Apostle ordered me to distribute the saddles and skins of the Budn which I had slaughtered.",
      "chain": [
        "20351",
        "20012",
        "11254",
        "11028",
        "11196",
        "5"
      ]
    },
    {
      "hadith_no": "2375",
      "source": " Sahih Bukhari ",
      "chapter": "Distribution of Water - كتاب المساقاة",
      "chapter_no": "42",
      "text_ar": "حدثنا إبراهيم بن موسى، أخبرنا هشام، أن ابن جريج، أخبرهم قال أخبرني ابن شهاب، عن علي بن حسين بن علي، عن أبيه، حسين بن علي عن علي بن أبي طالب  رضى الله عنهم  أنه قال أصبت شارفا مع رسول الله صلى الله عليه وسلم في مغنم يوم بدر قال وأعطاني رسول الله صلى الله عليه وسلم شارفا أخرى، فأنختهما يوما عند باب رجل من الأنصار، وأنا أريد أن أحمل عليهما إذخرا لأبيعه، ومعي صائغ من بني قينقاع فأستعين به على وليمة فاطمة، وحمزة بن عبد المطلب يشرب في ذلك البيت معه قينة، فقالت ألا يا حمز للشرف النواء‏.‏ فثار إليهما حمزة بالسيف، فجب أسنمتهما، وبقر خواصرهما، ثم أخذ من أكبادهما‏.‏ قلت لابن شهاب ومن السنام قال قد جب أسنمتهما فذهب بها‏.‏ قال ابن شهاب قال علي  رضى الله عنه  فنظرت إلى منظر أفظعني فأتيت نبي الله صلى الله عليه وسلم وعنده زيد بن حارثة فأخبرته الخبر فخرج ومعه زيد، فانطلقت معه، فدخل على حمزة فتغيظ عليه فرفع حمزة بصره وقال هل أنتم إلا عبيد لآبائي فرجع رسول الله صلى الله عليه وسلم يقهقر حتى خرج عنهم، وذلك قبل تحريم الخمر‏.‏",
      "text_en": " Narrated Husain bin `Ali:                     `Ali bin Abi Talib said: \"I got a she-camel as my share of the war booty on the day (of the battle) of Badr, and Allah's Apostle gave me another she-camel. I let both of them kneel at the door of one of the Ansar, intending to carry Idhkhir on them to sell it and use its price for my wedding banquet on marrying Fatima. A goldsmith from Bani Qainqa' was with me. Hamza bin `Abdul-Muttalib was in that house drinking wine and a lady singer was reciting: \"O Hamza! (Kill) the (two) fat old she camels (and serve them to your guests). So Hamza took his sword and went towards the two she-camels and cut off their humps and opened their flanks and took a part of their livers.\" (I said to Ibn Shihab, \"Did he take part of the humps?\" He replied, \"He cut off their humps and carried them away.\") `Ali further said, \"When I saw that dreadful sight, I went to the Prophet and told him the news. The Prophet came out in the company of Zaid bin Haritha who was with him then, and I too went with them. He went to Hamza and spoke harshly to him. Hamza looked up and said, 'Aren't you only the slaves of my forefathers?' The Prophet retreated and went out. This incident happened before the prohibition of drinking.\"",
      "chain": [
        "30309",
        "20295",
        "11070",
        "11013",
        "11045",
        "5"
      ]
    },
    {
      "hadith_no": "2614",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا حجاج بن منهال، حدثنا شعبة، قال أخبرني عبد الملك بن ميسرة، قال سمعت زيد بن وهب، عن علي  رضى الله عنه  قال أهدى إلى النبي صلى الله عليه وسلم حلة سيراء فلبستها، فرأيت الغضب في وجهه، فشققتها بين نسائي‏.‏",
      "text_en": " Narrated `Ali:                     The Prophet gave me a silken dress as a gift and I wore it. When I saw the signs of anger on his face, I cut it into pieces and distributed it among my wives.\"",
      "chain": [
        "20219",
        "20020",
        "11369",
        "11341",
        "5"
      ]
    },
    {
      "hadith_no": "2905",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن سفيان، قال حدثني سعد بن إبراهيم، عن عبد الله بن شداد، عن علي، حدثنا قبيصة، حدثنا سفيان، عن سعد بن إبراهيم، قال حدثني عبد الله بن شداد، قال سمعت عليا  رضى الله عنه  يقول ما رأيت النبي صلى الله عليه وسلم يفدي رجلا بعد سعد، سمعته يقول ‏\"‏ ارم فداك أبي وأمي ‏\"‏‏.‏",
      "text_en": " Narrated `Ali:                     I never saw the Prophet saying, \"Let my parents sacrifice their lives for you,\" to any man after Sa`d. I heard him saying (to him), \"Throw (the arrows)! Let my parents sacrifice their lives for you.\"",
      "chain": [
        "30175",
        "20031",
        "20012",
        "11063",
        "169",
        "5",
        "20351",
        "20012",
        "11063",
        "169",
        "5"
      ]
    },
    {
      "hadith_no": "2931",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا إبراهيم بن موسى، أخبرنا عيسى، حدثنا هشام، عن محمد، عن عبيدة، عن علي  رضى الله عنه  قال لما كان يوم الأحزاب قال رسول الله صلى الله عليه وسلم ‏\"‏ ملأ الله بيوتهم وقبورهم نارا، شغلونا عن الصلاة الوسطى حين غابت الشمس ‏\"‏‏.‏",
      "text_en": " Narrated `Ali:                     When it was the day of the battle of Al-Ahzab (i.e. the clans), Allah's Apostle said, \"O Allah! Fill their (i.e. the infidels') houses and graves with fire as they busied us so much that we did not perform the prayer (i.e. `Asr) till the sun set.\"",
      "chain": [
        "30309",
        "20347",
        "11065",
        "20278",
        "11370",
        "5"
      ]
    },
    {
      "hadith_no": "3007",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، حدثنا عمرو بن دينار، سمعته منه، مرتين قال أخبرني حسن بن محمد، قال أخبرني عبيد الله بن أبي رافع، قال سمعت عليا  رضى الله عنه  يقول بعثني رسول الله صلى الله عليه وسلم أنا والزبير والمقداد بن الأسود قال ‏\"‏ انطلقوا حتى تأتوا روضة خاخ، فإن بها ظعينة ومعها كتاب، فخذوه منها ‏\"‏‏.‏ فانطلقنا تعادى بنا خيلنا حتى انتهينا إلى الروضة، فإذا نحن بالظعينة فقلنا أخرجي الكتاب‏.‏ فقالت ما معي من كتاب‏.‏ فقلنا لتخرجن الكتاب أو لنلقين الثياب‏.‏ فأخرجته من عقاصها، فأتينا به رسول الله صلى الله عليه وسلم، فإذا فيه من حاطب بن أبي بلتعة إلى أناس من المشركين من أهل مكة، يخبرهم ببعض أمر رسول الله صلى الله عليه وسلم، فقال رسول الله صلى الله عليه وسلم ‏\"‏ يا حاطب، ما هذا ‏\"‏‏.‏ قال يا رسول الله، لا تعجل على، إني كنت امرأ ملصقا في قريش، ولم أكن من أنفسها، وكان من معك من المهاجرين لهم قرابات بمكة، يحمون بها أهليهم وأموالهم، فأحببت إذ فاتني ذلك من النسب فيهم أن أتخذ عندهم يدا يحمون بها قرابتي، وما فعلت كفرا ولا ارتدادا ولا رضا بالكفر بعد الإسلام‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لقد صدقكم ‏\"‏‏.‏ قال عمر يا رسول الله دعني أضرب عنق هذا المنافق‏.‏ قال ‏\"‏ إنه قد شهد بدرا، وما يدريك لعل الله أن يكون قد اطلع على أهل بدر فقال اعملوا ما شئتم، فقد غفرت لكم ‏\"‏‏.‏ قال سفيان وأى إسناد هذا‏.‏",
      "text_en": " Narrated 'Ubaidullah bin Abi Rafi`:                     I heard `Ali saying, \"Allah's Apostle sent me, Az-Zubair and Al-Miqdad somewhere saying, 'Proceed till you reach Rawdat Khakh. There you will find a lady with a letter. Take the letter from her.' \" So, we set out and our horses ran at full pace till we got at Ar-Rawda where we found the lady and said (to her). \"Take out the letter.\" She replied, \"I have no letter with me.\" We said, \"Either you take out the letter or else we will take off your clothes.\" So, she took it out of her braid. We brought the letter to Allah's Apostle and it contained a statement from Hatib bin Abi Balta a to some of the Meccan pagans informing them of some of the intentions of Allah's Apostle. Then Allah's Apostle said, \"O Hatib! What is this?\" Hatib replied, \"O Allah's Apostle! Don't hasten to give your judgment about me. I was a man closely connected with the Quraish, but I did not belong to this tribe, while the other emigrants with you, had their relatives in Mecca who would protect their dependents and property . So, I wanted to recompense for my lacking blood relation to them by doing them a favor so that they might protect my dependents. I did this neither because of disbelief not apostasy nor out of preferring Kufr (disbelief) to Islam.\" Allah's Apostle, said, \"Hatib has told you the truth.\" `Umar said, O Allah's Apostle! Allow me to chop off the head of this hypocrite.\" Allah's Apostle said, \"Hatib participated in the battle of Badr, and who knows, perhaps Allah has already looked at the Badr warriors and said, 'Do whatever you like, for I have forgiven you.\"",
      "chain": [
        "30026",
        "20005",
        "11081",
        "11199",
        "5"
      ]
    },
    {
      "hadith_no": "3017",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، عن أيوب، عن عكرمة، أن عليا  رضى الله عنه  حرق قوما، فبلغ ابن عباس فقال لو كنت أنا لم أحرقهم، لأن النبي صلى الله عليه وسلم قال ‏\"‏ لا تعذبوا بعذاب الله ‏\"‏‏.‏ ولقتلتهم كما قال النبي صلى الله عليه وسلم ‏\"‏ من بدل دينه فاقتلوه ‏\"‏‏.‏",
      "text_en": " Narrated `Ikrima:                     `Ali burnt some people and this news reached Ibn `Abbas, who said, \"Had I been in his place I would not have burnt them, as the Prophet said, 'Don't punish (anybody) with Allah's Punishment.' No doubt, I would have killed them, for the Prophet said, 'If somebody (a Muslim) discards his religion, kill him.' \"",
      "chain": [
        "30026",
        "20005",
        "11015",
        "11023",
        "5"
      ]
    },
    {
      "hadith_no": "3091",
      "source": " Sahih Bukhari ",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا عبدان، أخبرنا عبد الله، أخبرنا يونس، عن الزهري، قال أخبرني علي بن الحسين، أن حسين بن علي، عليهما السلام أخبره أن عليا قال كانت لي شارف من نصيبي من المغنم يوم بدر، وكان النبي صلى الله عليه وسلم أعطاني شارفا من الخمس، فلما أردت أن أبتني بفاطمة بنت رسول الله صلى الله عليه وسلم واعدت رجلا صواغا من بني قينقاع، أن يرتحل معي فنأتي بإذخر أردت أن أبيعه الصواغين، وأستعين به في وليمة عرسي، فبينا أنا أجمع لشارفى متاعا من الأقتاب والغرائر والحبال، وشارفاى مناخان إلى جنب حجرة رجل من الأنصار، رجعت حين جمعت ما جمعت، فإذا شارفاى قد اجتب أسنمتهما وبقرت خواصرهما، وأخذ من أكبادهما، فلم أملك عينى حين رأيت ذلك المنظر منهما، فقلت من فعل هذا فقالوا فعل حمزة بن عبد المطلب، وهو في هذا البيت في شرب من الأنصار‏.‏ فانطلقت حتى أدخل على النبي صلى الله عليه وسلم وعنده زيد بن حارثة، فعرف النبي صلى الله عليه وسلم في وجهي الذي لقيت، فقال النبي صلى الله عليه وسلم ‏\"‏ ما لك ‏\"‏ فقلت يا رسول الله، ما رأيت كاليوم قط، عدا حمزة على ناقتى، فأجب أسنمتهما وبقر خواصرهما، وها هو ذا في بيت معه شرب‏.‏ فدعا النبي صلى الله عليه وسلم بردائه فارتدى ثم انطلق يمشي، واتبعته أنا وزيد بن حارثة حتى جاء البيت الذي فيه حمزة، فاستأذن فأذنوا لهم فإذا هم شرب، فطفق رسول الله صلى الله عليه وسلم يلوم حمزة فيما فعل، فإذا حمزة قد ثمل محمرة عيناه، فنظر حمزة إلى رسول الله صلى الله عليه وسلم، ثم صعد النظر فنظر إلى ركبته، ثم صعد النظر فنظر إلى سرته، ثم صعد النظر فنظر إلى وجهه ثم قال حمزة هل أنتم إلا عبيد لأبي فعرف رسول الله صلى الله عليه وسلم أنه قد ثمل، فنكص رسول الله صلى الله عليه وسلم على عقبيه القهقرى وخرجنا معه‏.‏",
      "text_en": " Narrated `Ali:                     I got a she-camel in my share of the war booty on the day (of the battle) of Badr, and the Prophet had given me a she-camel from the Khumus. When I intended to marry Fatima, the daughter of Allah's Apostle, I had an appointment with a goldsmith from the tribe of Bani Qainuqa' to go with me to bring Idhkhir (i.e. grass of pleasant smell) and sell it to the goldsmiths and spend its price on my wedding party. I was collecting for my she-camels equipment of saddles, sacks and ropes while my two shecamels were kneeling down beside the room of an Ansari man. I returned after collecting whatever I collected, to see the humps of my two she-camels cut off and their flanks cut open and some portion of their livers was taken out. When I saw that state of my two she-camels, I could not help weeping. I asked, \"Who has done this?\" The people replied, \"Hamza bin `Abdul Muttalib who is staying with some Ansari drunks in this house.\" I went away till I reached the Prophet and Zaid bin Haritha was with him. The Prophet noticed on my face the effect of what I had suffered, so the Prophet asked. \"What is wrong with you.\" I replied, \"O Allah's Apostle! I have never seen such a day as today. Hamza attacked my two she-camels, cut off their humps, and ripped open their flanks, and he is sitting there in a house in the company of some drunks.\" The Prophet then asked for his covering sheet, put it on, and set out walking followed by me and Zaid bin Haritha till he came to the house where Hamza was. He asked permission to enter, and they allowed him, and they were drunk. Allah's Apostle started rebuking Hamza for what he had done, but Hamza was drunk and his eyes were red. Hamza looked at Allah's Apostle and then he raised his eyes, looking at his knees, then he raised up his eyes looking at his umbilicus, and again he raised up his eyes look in at his face. Hamza then said, \"Aren't you but the slaves of my father?\" Allah's Apostle realized that he was drunk, so Allah's Apostle retreated, and we went out with him.",
      "chain": [
        "30349",
        "20025",
        "20475",
        "11013",
        "11045",
        "31",
        "5"
      ]
    },
    {
      "hadith_no": "3111",
      "source": " Sahih Bukhari ",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا سفيان، عن محمد بن سوقة، عن منذر، عن ابن الحنفية، قال لو كان علي  رضى الله عنه  ذاكرا عثمان  رضى الله عنه  ذكره يوم جاءه ناس فشكوا سعاة عثمان، فقال لي علي اذهب إلى عثمان فأخبره أنها صدقة رسول الله صلى الله عليه وسلم، فمر سعاتك يعملون فيها‏.‏ فأتيته بها فقال أغنها عنا‏.‏ فأتيت بها عليا فأخبرته فقال ضعها حيث أخذتها‏.‏",
      "text_en": " Narrated Ibn Al-Hanafiya:                     If `Ali had spoken anything bad about `Uthman then he would have mentioned the day when some persons came to him and complained about the Zakat officials of `Uthman. `Ali then said to me, \"Go to `Uthman and say to him, 'This document contains the regulations of spending the Sadaqa of Allah's Apostle so order your Zakat officials to act accordingly.\" I took the document to `Uthman. `Uthman said, \"Take it away, for we are not in need of it.\" I returned to `Ali with it and informed him of that. He said, \"Put it whence you took it.\"",
      "chain": [
        "30367",
        "20005",
        "11387",
        "11398",
        "10600",
        "5"
      ]
    },
    {
      "hadith_no": "3113",
      "source": " Sahih Bukhari ",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا بدل بن المحبر، أخبرنا شعبة، قال أخبرني الحكم، قال سمعت ابن أبي ليلى، حدثنا علي، أن فاطمة  عليها السلام  اشتكت ما تلقى من الرحى مما تطحن، فبلغها أن رسول الله صلى الله عليه وسلم أتي بسبى، فأتته تسأله خادما فلم توافقه، فذكرت لعائشة، فجاء النبي صلى الله عليه وسلم فذكرت ذلك عائشة له، فأتانا وقد دخلنا مضاجعنا، فذهبنا لنقوم فقال ‏\"‏ على مكانكما ‏\"‏ حتى وجدت برد قدميه على صدري فقال ‏\"‏ ألا أدلكما على خير مما سألتماه، إذا أخذتما مضاجعكما فكبرا الله أربعا وثلاثين، واحمدا ثلاثا وثلاثين، وسبحا ثلاثا وثلاثين، فإن ذلك خير لكما مما سألتماه ‏\"‏‏.‏",
      "text_en": " Narrated `Ali:                     Fatima complained of what she suffered from the hand mill and from grinding, when she got the news that some slave girls of the booty had been brought to Allah's Apostle. She went to him to ask for a maid-servant, but she could not find him, and told `Aisha of her need. When the Prophet came, Aisha informed him of that. The Prophet came to our house when we had gone to our beds. (On seeing the Prophet) we were going to get up, but he said, 'Keep at your places,' I felt the coolness of the Prophet's feet on my chest. Then he said, \"Shall I tell you a thing which is better than what you asked me for? When you go to your beds, say: 'Allahu Akbar (i.e. Allah is Greater)' for 34 times, and 'Al hamdu Li llah (i.e. all the praises are for Allah)' for 33 times, and Subhan Allah (i.e. Glorified be Allah) for 33 times. This is better for you than what you have requested.\"",
      "chain": [
        "20210",
        "20020",
        "11069",
        "11196",
        "5"
      ]
    },
    {
      "hadith_no": "3137",
      "source": " Sahih Bukhari ",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا علي، حدثنا سفيان، حدثنا محمد بن المنكدر، سمع جابرا  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لو قد جاءني مال البحرين لقد أعطيتك هكذا وهكذا وهكذا ‏\"‏‏.‏ فلم يجئ حتى قبض النبي صلى الله عليه وسلم، فلما جاء مال البحرين أمر أبو بكر مناديا فنادى من كان له عند رسول الله صلى الله عليه وسلم دين أو عدة فليأتنا‏.‏ فأتيته فقلت إن رسول الله صلى الله عليه وسلم قال لي كذا وكذا‏.‏ فحثا لي ثلاثا  وجعل سفيان يحثو بكفيه جميعا، ثم قال لنا هكذا قال لنا ابن المنكدر  وقال مرة فأتيت أبا بكر فسألت فلم يعطني، ثم أتيته فلم يعطني، ثم أتيته الثالثة فقلت سألتك فلم تعطني، ثم سألتك فلم تعطني، ثم سألتك فلم تعطني، فإما أن تعطيني، وإما أن تبخل عني‏.‏ قال قلت تبخل على ما منعتك من مرة إلا وأنا أريد أن أعطيك‏.‏ قال سفيان وحدثنا عمرو عن محمد بن علي عن جابر فحثا لي حثية وقال عدها‏.‏ فوجدتها خمسمائة قال فخذ مثلها مرتين‏.‏ وقال يعني ابن المنكدر وأى داء أدوأ من البخل",
      "text_en": " Narrated Jabir:                     Allah's Apostle said (to me), \"If the property of Bahrain had come to us, I would have given you so much and so much.\" But the Bahrain property did not come till the Prophet had died. When the Bahrain property came. Abu Bakr ordered somebody to announce, \"Any person who has money claim on Allah's Apostle or whom Allah's Apostle had promised something, should come to us.\" So, I went to him and said, \"Allah's Apostle had promised to give me so much an so much.\" Abu Bakr scooped up money with both hands thrice for me.\" (The sub-narrator Sufyan illustrated this action by scooping up with both hands and said, \"Ibn Munkadir, another sub-narrator, used to illustrate it in this way.\") Narrated Jabir: Once I went to Abu Bakr and asked for the money but he did not give me, and I went to him again, but he did not give me, so I went to him for the third time and said, \"I asked you, but you did not give me; then I asked you (for the second time) and you did not give me; then I asked you (for the third time) but you did not give me. You should either give me or allow yourself to be considered a miser regarding my case.\" Abu Bakr said, \"You tell me that I am a miser with regard to you. But really, whenever I rejected your request, I had the inclination to give you.\" (In another narration Jabir added:) So, Abu Bakr scooped up money with both hands for me and asked me to count it. I found out that It was five hundred. Abu Bakr told me to take twice that amount.",
      "chain": [
        "5",
        "20005",
        "11048",
        "34"
      ]
    },
    {
      "hadith_no": "3179",
      "source": " Sahih Bukhari ",
      "chapter": "Jizyah and Mawaada'ah - كتاب الجزية والموادعة",
      "chapter_no": "58",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، عن الأعمش، عن إبراهيم التيمي، عن أبيه، عن علي  رضى الله عنه  قال ما كتبنا عن النبي صلى الله عليه وسلم إلا القرآن، وما في هذه الصحيفة، قال النبي صلى الله عليه وسلم ‏\"‏ المدينة حرام ما بين عائر إلى كذا، فمن أحدث حدثا، أو آوى محدثا، فعليه لعنة الله والملائكة والناس أجمعين، لا يقبل منه عدل ولا صرف، وذمة المسلمين واحدة يسعى بها أدناهم‏.‏ فمن أخفر مسلما فعليه لعنة الله والملائكة والناس أجمعين، لا يقبل منه صرف ولا عدل، ومن والى قوما بغير إذن مواليه فعليه لعنة الله والملائكة والناس أجمعين، لا يقبل منه صرف ولا عدل ‏\"‏‏.‏",
      "text_en": " Narrated `Ali:                     We did not, write anything from the Prophet except the Qur'an and what is written in this paper, (wherein) the Prophet said, \"Medina is a sanctuary from (the mountain of) Air to so and-so, therefore, whoever innovates (in it) an heresy or commits a sin, or gives shelter to such an innovator, will incur the Curse of Allah. the angels and all the people; and none of his compulsory or optional good deeds of worship will be accepted And the asylum granted by any Muslim Is to be secured by all the Muslims even if it is granted by one of the lowest social status among them. And whoever betrays a Muslim in this respect will incur the Curse of Allah, the angels and all the people, and his compulsory and optional good deeds of worship will not be accepted. And any freed slave will take as masters (befriends) people other than his own real masters who freed him without taking the permission of the latter, will incur the Curse of Allah, the angels and all the people, and his compulsory and optional good deeds of worship will not be accepted.\"",
      "chain": [
        "28531",
        "20012",
        "11060",
        "11322",
        "11405",
        "5"
      ]
    },
    {
      "hadith_no": "3432",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثني أحمد بن أبي رجاء، حدثنا النضر، عن هشام، قال أخبرني أبي قال، سمعت عبد الله بن جعفر، قال سمعت عليا  رضى الله عنه  يقول سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ خير نسائها مريم ابنة عمران، وخير نسائها خديجة ‏\"‏‏.‏",
      "text_en": " Narrated `Ali:                     I heard the Prophet saying, \"Mary, the daughter of `Imran, was the best among the women (of the world of her time) and Khadija is the best amongst the women. (of this nation).",
      "chain": [
        "30300",
        "20291",
        "11065",
        "10511",
        "108",
        "5"
      ]
    },
    {
      "hadith_no": "3654",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، عن الأعمش، عن خيثمة، عن سويد بن غفلة، قال قال علي  رضى الله عنه  إذا حدثتكم عن رسول الله صلى الله عليه وسلم فلأن أخر من السماء أحب إلى من أن أكذب عليه، وإذا حدثتكم فيما بيني وبينكم، فإن الحرب خدعة، سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ يأتي في آخر الزمان قوم حدثاء الأسنان، سفهاء الأحلام، يقولون من خير قول البرية، يمرقون من الإسلام كما يمرق السهم من الرمية، لا يجاوز إيمانهم حناجرهم، فأينما لقيتموهم فاقتلوهم، فإن قتلهم أجر لمن قتلهم يوم القيامة ‏\"‏‏.‏",
      "text_en": " Narrated `Ali:                     I relate the traditions of Allah's Apostle to you for I would rather fall from the sky than attribute something to him falsely. But when I tell you a thing which is between you and me, then no doubt, war is guile. I heard Allah's Apostle saying, \"In the last days of this world there will appear some young foolish people who will use (in their claim) the best speech of all people (i.e. the Qur'an) and they will abandon Islam as an arrow going through the game. Their belief will not go beyond their throats (i.e. they will have practically no belief), so wherever you meet them, kill them, for he who kills them shall get a reward on the Day of Resurrection.\"",
      "chain": [
        "28531",
        "20012",
        "11060",
        "11332",
        "11174",
        "5"
      ]
    },
    {
      "hadith_no": "3752",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثني محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن الحكم، سمعت ابن أبي ليلى، قال حدثنا علي، أن فاطمة، عليها السلام شكت ما تلقى من أثر الرحا، فأتى النبي صلى الله عليه وسلم سبى، فانطلقت فلم تجده، فوجدت عائشة، فأخبرتها، فلما جاء النبي صلى الله عليه وسلم أخبرته عائشة بمجيء فاطمة، فجاء النبي صلى الله عليه وسلم إلينا، وقد أخذنا مضاجعنا، فذهبت لأقوم فقال ‏\"‏ على مكانكما ‏\"‏‏.‏ فقعد بيننا حتى وجدت برد قدميه على صدري وقال ‏\"‏ ألا أعلمكما خيرا مما سألتماني إذا أخذتما مضاجعكما تكبرا أربعا وثلاثين، وتسبحا ثلاثا وثلاثين، وتحمدا ثلاثة وثلاثين، فهو خير لكما من خادم ‏\"‏‏.‏",
      "text_en": " Narrated `Ali:                     Fatima complained of the suffering caused to her by the hand mill. Some Captives were brought to the Prophet, she came to him but did not find him at home `Aisha was present there to whom she told (of her desire for a servant). When the Prophet came, Aisha informed him about Fatima's visit. `Ali added \"So the Prophet came to us, while we had gone to our bed I wanted to get up but the Prophet said, \"Remain at your place\". Then he sat down between us till I found the coolness of his feet on my chest. Then he said, \"Shall I teach you a thing which is better than what you have asked me? When you go to bed, say, 'Allahu-Akbar' thirty-four times, and 'Subhan Allah thirty-three times, and 'Al hamdu-li l-lah thirty-three times for that is better for you both than a servant.\"",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11069",
        "11196",
        "5"
      ]
    },
    {
      "hadith_no": "3754",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا علي بن الجعد، أخبرنا شعبة، عن أيوب، عن ابن سيرين، عن عبيدة، عن علي  رضى الله عنه  قال اقضوا كما كنتم تقضون، فإني أكره الاختلاف حتى يكون للناس جماعة، أو أموت كما مات أصحابي‏.‏ فكان ابن سيرين يرى أن عامة ما يروى على علي الكذب‏.‏",
      "text_en": "  Narrated Ubaida:                       Ali said (to the people of 'Iraq), \"Judge as you used to judge, for I hate differences (and I do my best ) till the people unite as one group, or I die as my companions have died.\"",
      "chain": [
        "20386",
        "20020",
        "11015",
        "11035",
        "11370",
        "5"
      ]
    },
    {
      "hadith_no": "3863",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثني محمد، أخبرنا عبدة، عن هشام بن عروة، عن أبيه، قال سمعت عبد الله بن جعفر، قال سمعت عليا  رضى الله عنه  يقول سمعت رسول الله صلى الله عليه وسلم يقول حدثني صدقة أخبرنا عبدة عن هشام عن أبيه قال سمعت عبد الله بن جعفر عن علي  رضى الله عنهم  عن النبي صلى الله عليه وسلم قال ‏\"‏ خير نسائها مريم، وخير نسائها خديجة ‏\"‏‏.‏",
      "text_en": " Narrated `Ali:                     The Prophet said, \"The best of the world's women is Mary (at her lifetime), and the best of the world's women is Khadija (at her lifetime).",
      "chain": [
        "30213",
        "20337",
        "11065",
        "10511",
        "108",
        "5"
      ]
    },
    {
      "hadith_no": "4014",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني محمد بن عبد الله الرقاشي، حدثنا معتمر، قال سمعت أبي يقول، حدثنا أبو مجلز، عن قيس بن عباد، عن علي بن أبي طالب  رضى الله عنه  أنه قال أنا أول، من يجثو بين يدى الرحمن للخصومة يوم القيامة‏.‏ وقال قيس بن عباد وفيهم أنزلت ‏{‏هذان خصمان اختصموا في ربهم‏}‏ قال هم الذين تبارزوا يوم بدر حمزة وعلي وعبيدة أو أبو عبيدة بن الحارث وشيبة بن ربيعة وعتبة والوليد بن عتبة‏.‏",
      "text_en": " Narrated Abu Mijlaz:                     From Qais bin Ubad: `Ali bin Abi Talib said, \"I shall be the first man to kneel down before (Allah), the Beneficent to receive His judgment on the day of Resurrection (in my favor).\" Qais bin Ubad also said, \"The following Verse was revealed in their connection:-- \"These two opponents believers and disbelievers) Dispute with each other About their Lord.\" (22.19) Qais said that they were those who fought on the day of Badr, namely, Hamza, `Ali, 'Ubaida or Abu 'Ubaida bin Al-Harith, Shaiba bin Rabi`a, `Utba and Al-Wahd bin `Utba.",
      "chain": [
        "30168",
        "20288",
        "11289",
        "11313",
        "11609",
        "5"
      ]
    },
    {
      "hadith_no": "4016",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا إسحاق بن إبراهيم الصواف، حدثنا يوسف بن يعقوب  كان ينزل في بني ضبيعة وهو مولى لبني سدوس  حدثنا سليمان التيمي، عن أبي مجلز، عن قيس بن عباد، قال قال علي  رضى الله عنه فينا نزلت هذه الآية ‏{‏هذان خصمان اختصموا في ربهم ‏}‏",
      "text_en": " Narrated `Ali:                     The following Holy Verse:-- \"These two opponents (believers and disbelievers) dispute with each other about their Lord.\" (22.19) was revealed concerning us.",
      "chain": [
        "30123",
        "20305",
        "11289",
        "11313",
        "11609",
        "5"
      ]
    },
    {
      "hadith_no": "4032",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني إسحاق بن إبراهيم، أخبرنا عبد الله بن إدريس، قال سمعت حصين بن عبد الرحمن، عن سعد بن عبيدة، عن أبي عبد الرحمن السلمي، عن علي  رضى الله عنه  قال بعثني رسول الله صلى الله عليه وسلم وأبا مرثد والزبير وكلنا فارس قال ‏\"‏ انطلقوا حتى تأتوا روضة خاخ، فإن بها امرأة من المشركين، معها كتاب من حاطب بن أبي بلتعة إلى المشركين ‏\"‏‏.‏ فأدركناها تسير على بعير لها حيث قال رسول الله صلى الله عليه وسلم فقلنا الكتاب‏.‏ فقالت ما معنا كتاب‏.‏ فأنخناها فالتمسنا فلم نر كتابا، فقلنا ما كذب رسول الله صلى الله عليه وسلم، لتخرجن الكتاب أو لنجردنك‏.‏ فلما رأت الجد أهوت إلى حجزتها وهى محتجزة بكساء فأخرجته، فانطلقنا بها إلى رسول الله صلى الله عليه وسلم فقال عمر يا رسول الله، قد خان الله ورسوله والمؤمنين، فدعني فلأضرب عنقه‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ ما حملك على ما صنعت ‏\"‏‏.‏ قال حاطب والله ما بي أن لا أكون مؤمنا بالله ورسوله صلى الله عليه وسلم أردت أن يكون لي عند القوم يد يدفع الله بها عن أهلي ومالي، وليس أحد من أصحابك إلا له هناك من عشيرته من يدفع الله به عن أهله وماله‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ صدق، ولا تقولوا له إلا خيرا ‏\"‏‏.‏ فقال عمر إنه قد خان الله ورسوله والمؤمنين، فدعني فلأضرب عنقه‏.‏ فقال ‏\"‏ أليس من أهل بدر ‏\"‏‏.‏ فقال ‏\"‏ لعل الله اطلع إلى أهل بدر فقال اعملوا ما شئتم فقد وجبت لكم الجنة، أو فقد غفرت لكم ‏\"‏‏.‏ فدمعت عينا عمر وقال الله ورسوله أعلم‏.‏",
      "text_en": " Narrated `Ali:                     Allah's Apostle sent me, Abu Marthad and Az-Zubair, and all of us were riding horses, and said, \"Go till you reach Raudat-Khakh where there is a pagan woman carrying a letter from Hatib bin Abi Balta' a to the pagans of Mecca.\" So we found her riding her camel at the place which Allah's Apostle had mentioned. We said (to her),\"(Give us) the letter.\" She said, \"I have no letter.\" Then we made her camel kneel down and we searched her, but we found no letter. Then we said, \"Allah's Apostle had not told us a lie, certainly. Take out the letter, otherwise we will strip you naked.\" When she saw that we were determined, she put her hand below her waist belt, for she had tied her cloak round her waist, and she took out the letter, and we brought her to Allah's Apostle Then `Umar said, \"O Allah's Apostle! (This Hatib) has betrayed Allah, His Apostle and the believers! Let me cut off his neck!\" The Prophet asked Hatib, \"What made you do this?\" Hatib said, \"By Allah, I did not intend to give up my belief in Allah and His Apostle but I wanted to have some influence among the (Mecca) people so that through it, Allah might protect my family and property. There is none of your companions but has some of his relatives there through whom Allah protects his family and property.\" The Prophet said, \"He has spoken the truth; do no say to him but good.\" `Umar said, \"He as betrayed Allah, His Apostle and the faithful believers. Let me cut off his neck!\" The Prophet said, \"Is he not one of the Badr warriors? May be Allah looked at the Badr warriors and said, 'Do whatever you like, as I have granted Paradise to you, or said, 'I have forgiven you.\"' On this, tears came out of `Umar's eyes, and he said, \"Allah and His Apostle know better.\"",
      "chain": [
        "30123",
        "20102",
        "15097",
        "11344",
        "11359",
        "5"
      ]
    },
    {
      "hadith_no": "4053",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبدان، أخبرنا عبد الله، أخبرنا يونس،‏.‏ حدثنا أحمد بن صالح، حدثنا عنبسة، حدثنا يونس، عن الزهري، أخبرنا علي بن حسين، أن حسين بن علي  عليهم السلام  أخبره أن عليا قال كانت لي شارف من نصيبي من المغنم يوم بدر، وكان النبي صلى الله عليه وسلم أعطاني مما أفاء الله عليه من الخمس يومئذ، فلما أردت أن أبتني بفاطمة  عليها السلام  بنت النبي صلى الله عليه وسلم واعدت رجلا صواغا في بني قينقاع أن يرتحل معي فنأتي بإذخر، فأردت أن أبيعه من الصواغين فنستعين به في وليمة عرسي، فبينا أنا أجمع لشارفى من الأقتاب والغرائر والحبال، وشارفاى مناخان إلى جنب حجرة رجل من الأنصار، حتى جمعت ما جمعت فإذا أنا بشارفى قد أجبت أسنمتها، وبقرت خواصرهما، وأخذ من أكبادهما، فلم أملك عينى حين رأيت المنظر، قلت من فعل هذا قالوا فعله حمزة بن عبد المطلب، وهو في هذا البيت، في شرب من الأنصار، عنده قينة وأصحابه فقالت في غنائها ألا يا حمز للشرف النواء، فوثب حمزة إلى السيف، فأجب أسنمتهما، وبقر خواصرهما، وأخذ من أكبادهما قال علي فانطلقت حتى أدخل على النبي صلى الله عليه وسلم وعنده زيد بن حارثة، وعرف النبي صلى الله عليه وسلم الذي لقيت فقال ‏\"‏ ما لك ‏\"‏‏.‏ قلت يا رسول الله، ما رأيت كاليوم، عدا حمزة على ناقتى، فأجب أسنمتهما، وبقر خواصرهما وها هو ذا في بيت معه شرب، فدعا النبي صلى الله عليه وسلم بردائه، فارتدى ثم انطلق يمشي، واتبعته أنا وزيد بن حارثة، حتى جاء البيت الذي فيه حمزة، فاستأذن عليه فأذن له، فطفق النبي صلى الله عليه وسلم يلوم حمزة فيما فعل، فإذا حمزة ثمل محمرة عيناه، فنظر حمزة إلى النبي صلى الله عليه وسلم ثم صعد النظر، فنظر إلى ركبته، ثم صعد النظر، فنظر إلى وجهه، ثم قال حمزة وهل أنتم إلا عبيد لأبي فعرف النبي صلى الله عليه وسلم أنه ثمل، فنكص رسول الله صلى الله عليه وسلم على عقبيه القهقرى، فخرج وخرجنا معه‏.‏",
      "text_en": " Narrated `Ali:                     I had a she-camel which I got in my share from the booty of the battle of Badr, and the Prophet had given me another she camel from the Khumus which Allah had bestowed on him that day. And when I intended to celebrate my marriage to Fatima, the daughter of the Prophet, I made an arrangement with a goldsmith from Bani Qainuqa 'that he should go with me to bring Idhkhir (i.e. a kind of grass used by gold-smiths) which I intended to sell to gold-smiths in order to spend its price on the marriage banquet. While I was collecting ropes and sacks of pack saddles for my two she-camels which were kneeling down beside an Ansari's dwelling and after collecting what I needed, I suddenly found that the humps of the two she-camels had been cut off and their flanks had been cut open and portions of their livers had been taken out. On seeing that, I could not help weeping. I asked, \"Who has done that?\" They (i.e. the people) said, \"Hamza bin `Abdul Muttalib has done it. He is present in this house with some Ansari drinkers, a girl singer, and his friends. The singer said in her song, \"O Hamza, get at the fat she-camels!\" On hearing this, Hamza rushed to his sword and cut of the camels' humps and cut their flanks open and took out portions from their livers.\" Then I came to the Prophet, with whom Zaid bin Haritha was present. The Prophet noticed my state and asked, \"What is the matter?\" I said, \"O Allah's Apostle, I have never experienced such a day as today! Hamza attacked my two she-camels, cut off their humps and cut their flanks open, and he is still present in a house along some drinkers.\" The Prophet asked for his cloak, put it on, and proceeded, followed by Zaid bin Haritha and myself, till he reached the house where Hamza was. He asked the permission to enter, and he was permitted. The Prophet started blaming Hamza for what he had done. Hamza was drunk and his eyes were red. He looked at the Prophet then raised his eyes to look at his knees and raised his eves more to look at his face and then said, \"You are not but my father's slaves.\" When the Prophet understood that Hamza was drunk, he retreated, walking backwards went out and we left with him.",
      "chain": [
        "30349",
        "20025",
        "30226",
        "11716",
        "20475",
        "11013",
        "11045",
        "31",
        "5"
      ]
    },
    {
      "hadith_no": "4054",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني محمد بن عباد، أخبرنا ابن عيينة، قال أنفذه لنا ابن الأصبهاني سمعه من ابن معقل، أن عليا  رضى الله عنه  كبر على سهل بن حنيف فقال إنه شهد بدرا‏.‏",
      "text_en": " Narrated Ibn Maqal:                     `Ali led the funeral prayer of Sahl bin Hunaif and said, \"He was one of the warriors of Badr.\"",
      "chain": [
        "30377",
        "20005",
        "11364",
        "5"
      ]
    },
    {
      "hadith_no": "4108",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا أبو نعيم، حدثنا مسعر، عن سعد، عن ابن شداد، قال سمعت عليا  رضى الله عنه  يقول ما سمعت النبي صلى الله عليه وسلم يجمع أبويه لأحد غير سعد‏.‏",
      "text_en": " Narrated `Ali:                     I have never heard the Prophet mentioning both his father and mother for anybody other than Sa`d.",
      "chain": [
        "20348",
        "20359",
        "9",
        "5"
      ]
    },
    {
      "hadith_no": "4109",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا يسرة بن صفوان، حدثنا إبراهيم، عن أبيه، عن عبد الله بن شداد، عن علي  رضى الله عنه  قال ما سمعت النبي صلى الله عليه وسلم جمع أبويه لأحد إلا لسعد بن مالك، فإني سمعته يقول يوم أحد ‏\"‏ يا سعد ارم، فداك أبي وأمي ‏\"‏‏.‏",
      "text_en": " Narrated `Ali:                     I have never heard the Prophet mentioning his father and mother for anybody other than Sa`d bin Malik. I heard him saying on the day of Uhud, \"O Sa`d throw (arrows)! Let my father and mother be sacrificed for you !\"",
      "chain": [
        "27558",
        "20150",
        "11063",
        "169",
        "5"
      ]
    },
    {
      "hadith_no": "4161",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا إسحاق، حدثنا روح، حدثنا هشام، عن محمد، عن عبيدة، عن علي  رضى الله عنه  عن النبي صلى الله عليه وسلم أنه قال يوم الخندق ‏\"‏ ملأ الله عليهم بيوتهم وقبورهم نارا كما شغلونا عن صلاة الوسطى حتى غابت الشمس ‏\"‏‏.‏",
      "text_en": " Narrated `Ali:                     On the day of Al-Khandaq (i.e. Trench), the Prophet said '(Let) Allah fill their (i.e. the infidels') houses and graves with fire just as they have prevented us from offering the Middle Prayer (i.e. `Asr prayer) till the sun had set.\"",
      "chain": [
        "30021",
        "20229",
        "20295",
        "11263",
        "11370",
        "5"
      ]
    },
    {
      "hadith_no": "4194",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني عبد الله بن محمد، قال أملى على هشام بن يوسف من حفظه أخبرنا معمر، عن الزهري، قال قال لي الوليد بن عبد الملك أبلغك أن عليا، كان فيمن قذف عائشة قلت لا‏.‏ ولكن قد أخبرني رجلان من قومك أبو سلمة بن عبد الرحمن وأبو بكر بن عبد الرحمن بن الحارث أن عائشة  رضى الله عنها  قالت لهما كان علي مسلما في شأنها‏.‏",
      "text_en": " Narrated Az-Zuhri:                     Al-Walid bin `Abdul Malik said to me, \"Have you heard that `Ali' was one of those who slandered `Aisha?\" I replied, \"No, but two men from your people (named) Abu Salama bin `Abdur-Rahman and Abu Bakr bin `Abdur-Rahman bin Al-Harith have informed me that Aisha told them that `Ali remained silent about her case.\"",
      "chain": [
        "30351",
        "20115",
        "11013",
        "5",
        "53"
      ]
    },
    {
      "hadith_no": "4265",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني يحيى بن قزعة، حدثنا مالك، عن ابن شهاب، عن عبد الله، والحسن، ابنى محمد بن علي عن أبيهما، عن علي بن أبي طالب  رضى الله عنه  أن رسول الله صلى الله عليه وسلم نهى عن متعة النساء يوم خيبر، وعن أكل الحمر الإنسية‏.‏",
      "text_en": " Narrated `Ali bin Abi Talib:                     On the day of Khaibar, Allah's Apostle forbade the Mut'a (i.e. temporary marriage) and the eating of donkey-meat.",
      "chain": [
        "30119",
        "20001",
        "11013",
        "18",
        "11156",
        "5"
      ]
    },
    {
      "hadith_no": "4319",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا قتيبة، حدثنا سفيان، عن عمرو بن دينار، قال أخبرني الحسن بن محمد، أنه سمع عبيد الله بن أبي رافع، يقول سمعت عليا  رضى الله عنه  يقول بعثني رسول الله صلى الله عليه وسلم أنا والزبير والمقداد فقال ‏\"‏ انطلقوا حتى تأتوا روضة خاخ، فإن بها ظعينة معها كتاب، فخذوا منها ‏\"‏‏.‏ قال فانطلقنا تعادى بنا خيلنا حتى أتينا الروضة، فإذا نحن بالظعينة قلنا لها أخرجي الكتاب‏.‏ قالت ما معي كتاب‏.‏ فقلنا لتخرجن الكتاب أو لنلقين الثياب، قال فأخرجته من عقاصها، فأتينا به رسول الله صلى الله عليه وسلم فإذا فيه من حاطب بن أبي بلتعة إلى ناس بمكة من المشركين، يخبرهم ببعض أمر رسول الله صلى الله عليه وسلم فقال رسول الله صلى الله عليه وسلم ‏\"‏ يا حاطب ما هذا ‏\"‏‏.‏ قال يا رسول الله لا تعجل على، إني كنت امرأ ملصقا في قريش  يقول كنت حليفا ولم أكن من أنفسها  وكان من معك من المهاجرين من لهم قرابات، يحمون أهليهم وأموالهم، فأحببت إذ فاتني ذلك من النسب فيهم أن أتخذ عندهم يدا يحمون قرابتي، ولم أفعله ارتدادا عن ديني، ولا رضا بالكفر بعد الإسلام‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أما إنه قد صدقكم ‏\"‏‏.‏ فقال عمر يا رسول الله دعني أضرب عنق هذا المنافق‏.‏ فقال ‏\"‏ إنه قد شهد بدرا، وما يدريك لعل الله اطلع على من شهد بدرا قال اعملوا ما شئتم فقد غفرت لكم ‏\"‏‏.‏ فأنزل الله السورة ‏{‏يا أيها الذين آمنوا لا تتخذوا عدوي وعدوكم أولياء تلقون إليهم بالمودة‏}‏ إلى قوله ‏{‏فقد ضل سواء السبيل ‏}‏‏.‏",
      "text_en": " Narrated `Ali:                     Allah's Apostle sent me, Az-Zubair and Al-Miqdad saying, \"Proceed till you reach Rawdat Khakh where there is a lady carrying a letter, and take that (letter) from her.\" So we proceeded on our way with our horses galloping till we reached the Rawda, and there we found the lady and said to her, \"Take out the letter.\" She said, \"I have no letter.\" We said, \"Take out the letter, or else we will take off your clothes.\" So she took it out of her braid, and we brought the letter to Allah's Apostle . The letter was addressed from Hatib, bin Abi Balta'a to some pagans of Mecca, telling them about what Allah's Apostle intended to do. Allah's Apostle said, \"O Hatib! What is this?\" Hatib replied, \"O Allah's Apostle! Do not make a hasty decision about me. I was a person not belonging to Quraish but I was an ally to them from outside and had no blood relation with them, and all the Emigrants who were with you, have got their kinsmen (in Mecca) who can protect their families and properties. So I liked to do them a favor so that they might protect my relatives as I have no blood relation with them. I did not do this to renegade from my religion (i.e. Islam) nor did I do it to choose Heathenism after Islam.\" Allah's Apostle said to his companions.\" As regards him, he (i.e. Hatib) has told you the truth.\" `Umar said, \"O Allah's Apostle! Allow me to chop off the head of this hypocrite!\" The Prophet said, \"He (i.e. Hatib) has witnessed the Badr battle (i.e. fought in it) and what could tell you, perhaps Allah looked at those who witnessed Badr and said, \"O the people of Badr (i.e. Badr Muslim warriors), do what you like, for I have forgiven you. \"Then Allah revealed the Sura:-- \"O you who believe! Take not my enemies And your enemies as friends offering them (Your) love even though they have disbelieved in that Truth (i.e. Allah, Prophet Muhammad and this Qur'an) which has come to you ....(to the end of Verse)....(And whosoever of you (Muslims) does that, then indeed he has gone (far) astray (away) from the Straight Path.\" (60.1",
      "chain": [
        "30367",
        "20005",
        "11081",
        "30245",
        "11199",
        "5"
      ]
    },
    {
      "hadith_no": "4384",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا مسدد، حدثنا عبد الواحد، حدثنا الأعمش، قال حدثني سعد بن عبيدة، عن أبي عبد الرحمن، عن علي  رضى الله عنه  قال بعث النبي صلى الله عليه وسلم سرية فاستعمل رجلا من الأنصار، وأمرهم أن يطيعوه، فغضب فقال أليس أمركم النبي صلى الله عليه وسلم أن تطيعوني‏.‏ قالوا بلى‏.‏ قال فاجمعوا لي حطبا‏.‏ فجمعوا، فقال أوقدوا نارا‏.‏ فأوقدوها، فقال ادخلوها‏.‏ فهموا، وجعل بعضهم يمسك بعضا، ويقولون فررنا إلى النبي صلى الله عليه وسلم من النار‏.‏ فما زالوا حتى خمدت النار، فسكن غضبه، فبلغ النبي صلى الله عليه وسلم فقال ‏\"‏ لو دخلوها ما خرجوا منها إلى يوم القيامة، الطاعة في المعروف ‏\"‏‏.‏",
      "text_en": " Narrated `Ali:                     The Prophet sent a Sariya under the command of a man from the Ansar and ordered the soldiers to obey him. He (i.e. the commander) became angry and said \"Didn't the Prophet order you to obey me!\" They replied, \"Yes.\" He said, \"Collect fire-wood for me.\" So they collected it. He said, \"Make a fire.\" When they made it, he said, \"Enter it (i.e. the fire).\" So they intended to do that and started holding each other and saying, \"We run towards (i.e. take refuge with) the Prophet from the fire.\" They kept on saying that till the fire was extinguished and the anger of the commander abated. When that news reached the Prophet he said, \"If they had entered it (i.e. the fire), they would not have come out of it till the Day of Resurrection. Obedience (to somebody) is required when he enjoins what is good.\"",
      "chain": [
        "30175",
        "20256",
        "11060",
        "11344",
        "11359",
        "5"
      ]
    },
    {
      "hadith_no": "4490",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني إسحاق، أخبرنا بشر بن شعيب بن أبي حمزة، قال حدثني أبي، عن الزهري، قال أخبرني عبد الله بن كعب بن مالك الأنصاري  وكان كعب بن مالك أحد الثلاثة الذين تيب عليهم أن عبد الله بن عباس أخبره أن علي بن أبي طالب  رضى الله عنه  خرج من عند رسول الله صلى الله عليه وسلم في وجعه الذي توفي فيه، فقال الناس يا أبا حسن، كيف أصبح رسول الله صلى الله عليه وسلم فقال أصبح بحمد الله بارئا، فأخذ بيده عباس بن عبد المطلب، فقال له أنت والله بعد ثلاث عبد العصا، وإني والله لأرى رسول الله صلى الله عليه وسلم سوف يتوفى من وجعه هذا، إني لأعرف وجوه بني عبد المطلب عند الموت، اذهب بنا إلى رسول الله صلى الله عليه وسلم فلنسأله فيمن هذا الأمر، إن كان فينا علمنا ذلك، وإن كان في غيرنا علمناه فأوصى بنا‏.‏ فقال علي إنا والله لئن سألناها رسول الله صلى الله عليه وسلم فمنعناها لا يعطيناها الناس بعده، وإني والله لا أسألها رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated `Abdullah bin `Abbas:                     `Ali bin Abu Talib came out of the house of Allah's Apostle during his fatal illness. The people asked, \"O Abu Hasan (i.e. `Ali)! How is the health of Allah's Apostle this morning?\" `Ali replied, \"He has recovered with the Grace of Allah.\" `Abbas bin `Abdul Muttalib held him by the hand and said to him, \"In three days you, by Allah, will be ruled (by somebody else ), And by Allah, I feel that Allah's Apostle will die from this ailment of his, for I know how the faces of the offspring of `Abdul Muttalib look at the time of their death. So let us go to Allah's Apostle and ask him who will take over the Caliphate. If it is given to us we will know as to it, and if it is given to somebody else, we will inform him so that he may tell the new ruler to take care of us.\" `Ali said, \"By Allah, if we asked Allah's Apostle for it (i.e. the Caliphate) and he denied it us, the people will never give it to us after that. And by Allah, I will not ask Allah's Apostle for it.\"",
      "chain": [
        "30021",
        "30317",
        "20428",
        "11013",
        "1131",
        "17",
        "5"
      ]
    },
    {
      "hadith_no": "4575",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا يزيد، أخبرنا هشام، عن محمد، عن عبيدة، عن علي  رضى الله عنه  قال النبي صلى الله عليه وسلم‏.‏ حدثني عبد الرحمن حدثنا يحيى بن سعيد قال هشام حدثنا قال حدثنا محمد عن عبيدة عن علي  رضى الله عنه  أن النبي صلى الله عليه وسلم قال يوم الخندق ‏\"‏ حبسونا عن صلاة الوسطى حتى غابت الشمس ملأ الله قبورهم وبيوتهم أو أجوافهم  شك يحيى  نارا ‏\"‏‏.‏",
      "text_en": " Narrated `Ali:                     On the day of Al-Khandaq (the battle of the Trench). the Prophet said, \"They (i.e. pagans prevented us from offering the middle (the Best) Prayer till the sun had set. May Allah fill their graves, their houses (or their bodies) with fire.\"",
      "chain": [
        "30351",
        "20472",
        "20295",
        "20278",
        "11370",
        "5"
      ]
    },
    {
      "hadith_no": "4771",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا يعقوب بن إبراهيم بن سعد، حدثنا أبي، عن صالح، عن ابن شهاب، قال أخبرني علي بن حسين، أن حسين بن علي، أخبره عن علي  رضى الله عنه  أن رسول الله صلى الله عليه وسلم طرقه وفاطمة قال ‏\"‏ ألا تصليان ‏\"‏‏.‏ ‏{‏رجما بالغيب‏}‏ لم يستبن‏.‏ ‏{‏فرطا‏}‏ ندما ‏{‏سرادقها‏}‏ مثل السرادق، والحجرة التي تطيف بالفساطيط، ‏{‏يحاوره‏}‏ من المحاورة ‏{‏لكنا هو الله ربي‏}‏ أى لكن أنا هو الله ربي ثم حذف الألف وأدغم إحدى النونين في الأخرى‏.‏ ‏{‏زلقا‏}‏ لا يثبت فيه قدم‏.‏ ‏{‏هنالك الولاية‏}‏ مصدر الولي‏.‏ ‏{‏عقبا‏}‏ عاقبة وعقبى وعقبة واحد وهى الآخرة قبلا وقبلا وقبلا استئنافا ‏{‏ليدحضوا‏}‏ ليزيلوا، الدحض الزلق‏.‏",
      "text_en": " Narrated `Ali:                     That one night Allah's Apostle came to him and Fatima and said, \"Don't you (both offer the (Tahajjud) prayer?\" `Ali said, 'When Allah wishes us to get up, we get up.\" The Prophet then recited: 'But man is more quarrelsome than anything.' (18.54) (See Hadith No. 227,Vol. 2)",
      "chain": [
        "30026",
        "20184",
        "20150",
        "11176",
        "11013",
        "11045",
        "31",
        "5"
      ]
    },
    {
      "hadith_no": "4791",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا حجاج بن منهال، حدثنا معتمر بن سليمان، قال سمعت أبي قال، حدثنا أبو مجلز، عن قيس بن عباد، عن علي بن أبي طالب  رضى الله عنه  قال أنا أول، من يجثو بين يدى الرحمن للخصومة يوم القيامة‏.‏ قال قيس وفيهم نزلت ‏{‏هذان خصمان اختصموا في ربهم‏}‏ قال هم الذين بارزوا يوم بدر علي وحمزة وعبيدة وشيبة بن ربيعة وعتبة بن ربيعة والوليد بن عتبة‏.‏",
      "text_en": " Narrated Qais bin Ubad:                     `Ali said, \"I will be the first to kneel before the Beneficent on the Day of Resurrection because of the dispute.\" Qais said; This Verse: 'These two opponents (believers and disbelievers dispute with each other about their Lord,' (22.19) was revealed in connection with those who came out for the Battle of Badr, i.e. `Ali, Hamza, 'Ubaida, Shaiba bin Rabi`a, `Utba bin Rabi`a and Al-Walid bin `Utba.",
      "chain": [
        "20219",
        "20288",
        "11289",
        "11313",
        "11609",
        "5"
      ]
    }
  ],
  "total_hadiths": 555
}