{
  "id": "5004",
  "name": "Tha'laba bin Abi Malik ( ثعلبة بن أبي مالك القرظي ( رضي الله عنه",
  "full_name": "Tha'laba bin Abi Malik ( ثعلبة بن أبي مالك القرظي ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Yemen"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Medina",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator [ خ  د  ق  -  ثقة ]"
    ],
    "tags": [
      "B.Qurayza",
      "al-'Ajli",
      "al-Madni",
      "Ally Ansar",
      "Imam"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "3",
      "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4",
      "name": "'Uthman ibn 'Affaan ( عثمان بن عفان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "34",
      "name": "Jabir ibn 'Abdullah ( جابر بن عبد الله بن عمرو السلمي الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "333",
      "name": "Haritha bin al-Nu'man ( حارثة بن النعمان بن نفع ( رضي الله عنه",
      "grade": "Comp.(RA)"
    }
  ],
  "students": [
    {
      "id": "14379",
      "name": "Manzur bin Siyar al-Fazari منظور بن سيار",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "19000",
      "name": "al-Mswr bin Rfa'h bin Aby المسور بن رفاعة بن أبي مالك القرظي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "18937",
      "name": "Muhammad bin 'Uqba bin Aby محمد بن عقبة بن أبي مالك القرظي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11177",
      "name": "Safwan bin Slym al-Madni صفوان بن سليم المدني أبو عبد الله",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-2881",
      "hadith_no": "2881",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عبدان، أخبرنا عبد الله، أخبرنا يونس، عن ابن شهاب، قال ثعلبة بن أبي مالك إن عمر بن الخطاب  رضى الله عنه  قسم مروطا بين نساء من نساء المدينة، فبقي مرط جيد فقال له بعض من عنده يا أمير المؤمنين أعط هذا ابنة رسول الله صلى الله عليه وسلم التي عندك‏.‏ يريدون أم كلثوم بنت علي‏.‏ فقال عمر أم سليط أحق‏.‏ وأم سليط من نساء الأنصار، ممن بايع رسول الله صلى الله عليه وسلم‏.‏ قال عمر فإنها كانت تزفر لنا القرب يوم أحد‏.‏ قال أبو عبد الله تزفر تخيط‏.‏",
      "text_en": " Narrated Tha`laba bin Abi Malik:                     `Umar bin Al-Khattab distributed some garments amongst the women of Medina. One good garment remained, and one of those present with him said, \"O chief of the believers! Give this garment to your wife, the (grand) daughter of Allah's Apostle.\" They meant Um Kulthum, the daughter of `Ali. `Umar said, Um Salit has more right (to have it).\" Um Salit was amongst those Ansari women who had given the pledge of allegiance to Allah's Apostle.' `Umar said, \"She (i.e. Um Salit) used to carry the water skins for us on the day of Uhud.\"",
      "usc_msa_ref": "132",
      "chain": [
        "30349",
        "20025",
        "20475",
        "11013",
        "5004",
        "3"
      ]
    },
    {
      "id": "sahih-bukhari-2974",
      "hadith_no": "2974",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا سعيد بن أبي مريم، قال حدثني الليث، قال أخبرني عقيل، عن ابن شهاب، قال أخبرني ثعلبة بن أبي مالك القرظي، أن قيس بن سعد الأنصاري   رضى الله عنه  وكان صاحب لواء رسول الله صلى الله عليه وسلم أراد الحج فرجل‏.‏",
      "text_en": " Narrated Tha`laba bin Abi Malik Al-Qurazi:                     When Qais bin Sa`d Al-Ansari, who used to carry the flag of the Prophet, intended to perform Hajj, he combed his hair.",
      "usc_msa_ref": "218",
      "chain": [
        "30232",
        "20023",
        "11207",
        "11013",
        "5004",
        "172"
      ]
    },
    {
      "id": "sahih-bukhari-4120",
      "hadith_no": "4120",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا يحيى بن بكير، حدثنا الليث، عن يونس، عن ابن شهاب، وقال ثعلبة بن أبي مالك إن عمر بن الخطاب  رضى الله عنه  قسم مروطا بين نساء من نساء أهل المدينة، فبقي منها مرط جيد، فقال له بعض من عنده يا أمير المؤمنين أعط هذا بنت رسول الله صلى الله عليه وسلم التي عندك‏.‏ يريدون أم كلثوم بنت علي‏.‏ فقال عمر أم سليط أحق به‏.‏ وأم سليط من نساء الأنصار ممن بايع رسول الله صلى الله عليه وسلم، قال عمر فإنها كانت تزفر لنا القرب يوم أحد‏.‏",
      "text_en": " Narrated Tha`laba bin Abi Malik:                     `Umar bin Al-Khattab distributed woolen clothes amongst some women of Medina, and a nice woolen garment remained. Some of those who were sitting with him, said, \"O chief of the believers! Give it to the daughter of Allah's Apostle who is with you,\" and by that, they meant Um Kulthum, the daughter of `Ali. `Umar said, \"Um Salit has got more right than she.\" Um Saht was amongst those Ansari women who had given the pledge of allegiance to Allah's Apostle . `Umar added, \"She (i.e. Um Salit) used to carry the filled water skins for us on the day of the battle of Uhud.\"",
      "usc_msa_ref": "398",
      "chain": [
        "30399",
        "20023",
        "20475",
        "11013",
        "5004",
        "3"
      ]
    },
    {
      "id": "sunan-ibn-majah-2575",
      "hadith_no": "2575",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Pawning - كتاب الرهون",
      "chapter_no": "16",
      "text_ar": "حدثنا إبراهيم بن المنذر الحزامي، حدثنا زكريا بن منظور بن ثعلبة بن أبي مالك، حدثني محمد بن عقبة بن أبي مالك، عن عمه، ثعلبة بن أبي مالك قال قضى رسول الله صلى الله عليه وسلم في سيل مهزور الأعلى فوق الأسفل يسقي الأعلى إلى الكعبين ثم يرسل إلى من هو أسفل منه ‏.‏",
      "text_en": " It was narrated that Tha'labah bin Abu Malik said:                     “The Messenger of Allah (ﷺ) ruled concerning the stream of Mahzur that the higher ground took precedence over the lower, so the higher ground should be irrigated until the water reached the ankles, then it should be released to those who were lower.",
      "usc_msa_ref": "",
      "chain": [
        "30308",
        "22059",
        "18937",
        "5004"
      ]
    }
  ],
  "total_hadiths": 4
}