{
  "id": "5030",
  "name": "Malik bin Aws bin al-Hadathan ( مالك بن أوس بن الحدثان النصري ( رضي الله عنه",
  "full_name": "Malik bin Aws bin al-Hadathan ( مالك بن أوس بن الحدثان النصري ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Hijaz"
    },
    "death": {
      "date_hijri": "72",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Medina",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Madni"
    ]
  },
  "parents": [
    {
      "id": "5043",
      "name": "Aws bin al-Hadathan ( أوس بن الحدثان النصري ( رضي الله عنه",
      "grade": "Comp.(RA)"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "5035",
      "name": "Zufar bin Aws bin al-Hadathan ( زفر بن أوس بن الحدثان النصري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "3",
      "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4",
      "name": "'Uthman ibn 'Affaan ( عثمان بن عفان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5",
      "name": "Ali ibn Abi Talib ( علي بن أبي طالب بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "6",
      "name": "Talha ibn 'Ubaidullah ( طلحة بن عبيد الله ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "100",
      "name": "al-'Abbas ibn 'Abd al-Muttalib ( العباس بن عبد المطلب بن هاشم ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "7",
      "name": "Zubayr ibn al-Awwam ( الزبير بن العوام بن خويلد ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "8",
      "name": "'Abdur Rahman Ibn 'Awf ( عبد الرحمن بن عوف ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "9",
      "name": "Sa'd ibn Abi Waqqas ( سعد بن أبي وقاص ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "23",
      "name": "Abu Dharr al-Ghaffari ( جندب بن جنادة أبو ذر الغفاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11709",
      "name": "'Ikrama bin Khalid bin al-Aas عكرمة بن خالد بن العاص بن هشام",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11058",
      "name": "Muhammad bin Jubayr bin Mut'im محمد بن جبير بن مطعم بن عدي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "16521",
      "name": "al-Dahhak bin Sharhbayl al-Mashraqi الضحاك بن شرحبيل المشرقي",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "11521",
      "name": "'Ubaidullah bin Mqsm عبيد الله بن مقسم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "12154",
      "name": "Salmah bin Wrdan al-Lythy سلمة بن وردان الليثي",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "2904",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، عن عمرو، عن الزهري، عن مالك بن أوس بن الحدثان، عن عمر  رضى الله عنه  قال كانت أموال بني النضير مما أفاء الله على رسوله صلى الله عليه وسلم مما لم يوجف المسلمون عليه بخيل ولا ركاب، فكانت لرسول الله صلى الله عليه وسلم خاصة، وكان ينفق على أهله نفقة سنته، ثم يجعل ما بقي في السلاح والكراع، عدة في سبيل الله‏.‏",
      "text_en": " Narrated `Umar:                     The properties of Bani An-Nadir which Allah had transferred to His Apostle as Fai Booty were not gained by the Muslims with their horses and camels. The properties therefore, belonged especially to Allah's Apostle who used to give his family their yearly expenditure and spend what remained thereof on arms and horses to be used in Allah's Cause.",
      "chain": [
        "30026",
        "20005",
        "11081",
        "11013",
        "5030",
        "3"
      ]
    },
    {
      "hadith_no": "3094",
      "source": " Sahih Bukhari ",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا إسحاق بن محمد الفروي، حدثنا مالك بن أنس، عن ابن شهاب، عن مالك بن أوس بن الحدثان،، وكان، محمد بن جبير ذكر لي ذكرا من حديثه ذلك، فانطلقت حتى أدخل على مالك بن أوس، فسألته عن ذلك الحديث فقال مالك بينا أنا جالس في أهلي حين متع النهار، إذا رسول عمر بن الخطاب يأتيني فقال أجب أمير المؤمنين‏.‏ فانطلقت معه حتى أدخل على عمر، فإذا هو جالس على رمال سرير، ليس بينه وبينه فراش متكئ على وسادة من أدم، فسلمت عليه ثم جلست فقال يا مال، إنه قدم علينا من قومك أهل أبيات، وقد أمرت فيهم برضخ فاقبضه فاقسمه بينهم‏.‏ فقلت يا أمير المؤمنين، لو أمرت به غيري‏.‏ قال اقبضه أيها المرء‏.‏ فبينا أنا جالس عنده أتاه حاجبه يرفا فقال هل لك في عثمان وعبد الرحمن بن عوف والزبير وسعد بن أبي وقاص يستأذنون قال نعم‏.‏ فأذن لهم فدخلوا فسلموا وجلسوا، ثم جلس يرفا يسيرا ثم قال هل لك في علي وعباس قال نعم‏.‏ فأذن لهما، فدخلا فسلما فجلسا، فقال عباس يا أمير المؤمنين، اقض بيني وبين هذا‏.‏ وهما يختصمان فيما أفاء الله على رسوله صلى الله عليه وسلم من بني النضير‏.‏ فقال الرهط عثمان وأصحابه يا أمير المؤمنين، اقض بينهما وأرح أحدهما من الآخر‏.‏ قال عمر تيدكم، أنشدكم بالله الذي بإذنه تقوم السماء والأرض، هل تعلمون أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا نورث ما تركنا صدقة ‏\"‏‏.‏ يريد رسول الله صلى الله عليه وسلم نفسه‏.‏ قال الرهط قد قال ذلك‏.‏ فأقبل عمر على علي وعباس فقال أنشدكما الله، أتعلمان أن رسول الله صلى الله عليه وسلم قد قال ذلك قالا قد قال ذلك‏.‏ قال عمر فإني أحدثكم عن هذا الأمر، إن الله قد خص رسوله صلى الله عليه وسلم في هذا الفىء بشىء لم يعطه أحدا غيره  ثم قرأ ‏{‏وما أفاء الله على رسوله منهم‏}‏ إلى قوله ‏{‏قدير‏}‏  فكانت هذه خالصة لرسول الله صلى الله عليه وسلم‏.‏ والله ما احتازها دونكم، ولا استأثر بها عليكم قد أعطاكموه، وبثها فيكم حتى بقي منها هذا المال، فكان رسول الله صلى الله عليه وسلم ينفق على أهله نفقة سنتهم من هذا المال، ثم يأخذ ما بقي فيجعله مجعل مال الله، فعمل رسول الله صلى الله عليه وسلم بذلك حياته، أنشدكم بالله هل تعلمون ذلك قالوا نعم‏.‏ ثم قال لعلي وعباس أنشدكما بالله هل تعلمان ذلك قال عمر ثم توفى الله نبيه صلى الله عليه وسلم فقال أبو بكر أنا ولي رسول الله صلى الله عليه وسلم‏.‏ فقبضها أبو بكر، فعمل فيها بما عمل رسول الله صلى الله عليه وسلم، والله يعلم إنه فيها لصادق بار راشد تابع للحق، ثم توفى الله أبا بكر، فكنت أنا ولي أبي بكر، فقبضتها سنتين من إمارتي، أعمل فيها بما عمل رسول الله صلى الله عليه وسلم وما عمل فيها أبو بكر، والله يعلم إني فيها لصادق بار راشد تابع للحق، ثم جئتماني تكلماني وكلمتكما واحدة، وأمركما واحد، جئتني يا عباس تسألني نصيبك من ابن أخيك، وجاءني هذا  يريد عليا  يريد نصيب امرأته من أبيها، فقلت لكما إن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا نورث ما تركنا صدقة ‏\"‏‏.‏ فلما بدا لي أن أدفعه إليكما قلت إن شئتما دفعتها إليكما على أن عليكما عهد الله وميثاقه لتعملان فيها بما عمل فيها رسول الله صلى الله عليه وسلم، وبما عمل فيها أبو بكر، وبما عملت فيها منذ وليتها، فقلتما ادفعها إلينا‏.‏ فبذلك دفعتها إليكما، فأنشدكم بالله، هل دفعتها إليهما بذلك قال الرهط نعم‏.‏ ثم أقبل على علي وعباس فقال أنشدكما بالله هل دفعتها إليكما بذلك قالا نعم‏.‏ قال فتلتمسان مني قضاء غير ذلك فوالله الذي بإذنه تقوم السماء والأرض، لا أقضي فيها قضاء غير ذلك، فإن عجزتما عنها فادفعاها إلى، فإني أكفيكماها‏.‏",
      "text_en": " Narrated Malik bin Aus:                     While I was at home, the sun rose high and it got hot. Suddenly the messenger of `Umar bin Al- Khattab came to me and said, \"The chief of the believers has sent for you.\" So, I went along with him till I entered the place where `Umar was sitting on a bedstead made of date-palm leaves and covered with no mattress, and he was leaning over a leather pillow. I greeted him and sat down. He said, \"O Malik! Some persons of your people who have families came to me and I have ordered that a gift should be given to them, so take it and distribute it among them.\" I said, \"O chief of the believers! I wish that you order someone else to do it.\" He said, \"O man! Take it.\" While I was sitting there with him, his doorman Yarfa' came saying, \"`Uthman, `Abdur-Rahman bin `Auf, Az-Zubair and Sa`d bin Abi Waqqas are asking your permission (to see you); may I admit them?\" `Umar said, \"Yes\", So they were admitted and they came in, greeted him, and sat down. After a while Yarfa' came again and said, \"May I admit `Ali and `Abbas?\" `Umar said, \"yes.\" So, they were admitted and they came in and greeted (him) and sat down. Then `Abbas said, \"O chief of the believers! Judge between me and this (i.e. `Ali).\" They had a dispute regarding the property of Bani An-Nadir which Allah had given to His Apostle as Fai. The group (i.e. `Uthman and his companions) said, \"O chief of the believers! Judge between them and relieve both of them front each other.\" `Umar said, \"Be patient! I beseech you by Allah by Whose Permission the Heaven and the Earth exist, do you know that Allah's Apostle said, 'Our (i.e. prophets') property will not be inherited, and whatever we leave, is Sadaqa (to be used for charity),' and Allah's Apostle meant himself (by saying \"we'')?\" The group said, \"He said so.\" `Umar then turned to `Ali and `Abbas and said, \"I beseech you by Allah, do you know that Allah's Apostle said so?\" They replied, \" He said so.\" `Umar then said, \"So, I will talk to you about this matter. Allah bestowed on His Apostle with a special favor of something of this Fai (booty) which he gave to nobody else.\" `Umar then recited the Holy Verses: \"What Allah bestowed as (Fai) Booty on his Apostle (Muhammad) from them --- for this you made no expedition with either cavalry or camelry: But Allah gives power to His Apostles over whomever He will 'And Allah is able to do all things.\" 9:6) `Umar added \"So this property was especially given to Allah's Apostle, but, by Allah, neither did he take possession of it and leave your, nor did he favor himself with it to your exclusion, but he gave it to all of you and distributed it amongst you till this property remained out of it. Allah's Apostle used to spend the yearly expenses of his family out of this property and used to keep the rest of its revenue to be spent on Allah 's Cause. Allah 's Apostle kept on doing this during all his lifetime. I ask you by Allah do you know this?\" They replies in the affirmative. `Umar then said to `Ali and `Abbas. \"I ask you by Allah, do you know this?\" `Umar added, \"When Allah had taken His Prophet unto Him, 'Abu Bakr said, 'I am the successor of Allah's Apostle so, Abu Bakr took over that property and managed it in the same way as Allah's Apostle used to do, and Allah knows that he was true, pious and rightlyguided, and he was a follower of what was right. Then Allah took Abu Bakr unto Him and I became Abu Bakr's successor, and I kept that property in my possession for the first two years of my Caliphate, managing it in the same way as Allah's Apostle used to do and as Abu Bakr used to do, and Allah knows that I have been true, pious, rightly guided, and a follower of what is right. Now you both (i.e. 'Ah and `Abbas) came to talk to me, bearing the same claim and presenting the same case; you, `Abbas, came to me asking for your share from your nephew's property, and this man, i.e. `Ali, came to me asking for his wife's share from her father's property. I told you both that Allah's Apostle said, 'Our (prophets') properties are not to be inherited, but what we leave is Sadaqa (to be used for charity).' When I thought it right that I should hand over this property to you, I said to you, 'I am ready to hand over this property to you if you wish, on the condition that you would take Allah's Pledge and Convention that you would manage it in the same way as Allah's Apostle used to, and as Abu Bakr used to do, and as I have done since I was in charge of it.' So, both of you said (to me), 'Hand it over to us,' and on that condition I handed it over to you. So, I ask you by Allah, did I hand it over to them on this condition?\" The group aid, \"Yes.\" Then `Umar faced `Ali and `Abbas saying, \"I ask you by Allah, did I hand it over to you on this condition?\" They said, \"Yes. \" He said, \" Do you want now to give a different decision? By Allah, by Whose Leave both the Heaven and the Earth exist, I will never give any decision other than that (I have already given). And if you are unable to manage it, then return it to me, and I will do the job on your behalf.\"",
      "chain": [
        "20001",
        "11013",
        "5030",
        "11058"
      ]
    },
    {
      "hadith_no": "4083",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، قال أخبرني مالك بن أوس بن الحدثان النصري، أن عمر بن الخطاب  رضى الله عنه  دعاه إذ جاءه حاجبه يرفا فقال هل لك في عثمان، وعبد الرحمن، والزبير وسعد يستأذنون فقال نعم، فأدخلهم‏.‏ فلبث قليلا، ثم جاء فقال هل لك في عباس وعلي يستأذنان قال نعم‏.‏ فلما دخلا قال عباس يا أمير المؤمنين، اقض بيني وبين هذا، وهما يختصمان في الذي أفاء الله على رسوله صلى الله عليه وسلم من بني النضير، فاستب علي وعباس، فقال الرهط يا أمير المؤمنين، اقض بينهما وأرح أحدهما من الآخر‏.‏ فقال عمر اتئدوا، أنشدكم بالله الذي بإذنه تقوم السماء والأرض، هل تعلمون أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا نورث، ما تركنا صدقة ‏\"‏‏.‏ يريد بذلك نفسه‏.‏ قالوا قد قال ذلك‏.‏ فأقبل عمر على عباس وعلي فقال أنشدكما بالله هل تعلمان أن رسول الله صلى الله عليه وسلم قد قال ذلك قالا نعم‏.‏ قال فإني أحدثكم عن هذا الأمر، إن الله سبحانه كان خص رسوله صلى الله عليه وسلم في هذا الفىء بشىء لم يعطه أحدا غيره فقال جل ذكره ‏{‏وما أفاء الله على رسوله منهم فما أوجفتم عليه من خيل ولا ركاب‏}‏ إلى قوله ‏{‏قدير‏}‏ فكانت هذه خالصة لرسول الله صلى الله عليه وسلم، ثم والله ما احتازها دونكم، ولا استأثرها عليكم، لقد أعطاكموها وقسمها فيكم، حتى بقي هذا المال منها، فكان رسول الله صلى الله عليه وسلم ينفق على أهله نفقة سنتهم من هذا المال، ثم يأخذ ما بقي فيجعله مجعل مال الله، فعمل ذلك رسول الله صلى الله عليه وسلم حياته، ثم توفي النبي صلى الله عليه وسلم فقال أبو بكر فأنا ولي رسول الله صلى الله عليه وسلم‏.‏ فقبضه أبو بكر، فعمل فيه بما عمل به رسول الله صلى الله عليه وسلم وأنتم حينئذ‏.‏ فأقبل على علي وعباس وقال تذكران أن أبا بكر عمل فيه كما تقولان، والله يعلم إنه فيه لصادق بار راشد تابع للحق ثم توفى الله أبا بكر فقلت أنا ولي رسول الله صلى الله عليه وسلم وأبي بكر‏.‏ فقبضته سنتين من إمارتي أعمل فيه بما عمل رسول الله صلى الله عليه وسلم وأبو بكر، والله يعلم أني فيه صادق بار راشد تابع للحق، ثم جئتماني كلاكما وكلمتكما واحدة وأمركما جميع، فجئتني  يعني عباسا  فقلت لكما إن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا نورث، ما تركنا صدقة ‏\"‏‏.‏ فلما بدا لي أن أدفعه إليكما قلت إن شئتما دفعته إليكما على أن عليكما عهد الله وميثاقه لتعملان فيه بما عمل فيه رسول الله صلى الله عليه وسلم وأبو بكر، وما عملت فيه مذ وليت، وإلا فلا تكلماني، فقلتما ادفعه إلينا بذلك‏.‏ فدفعته إليكما، أفتلتمسان مني قضاء غير ذلك فوالله الذي بإذنه تقوم السماء والأرض لا أقضي فيه بقضاء غير ذلك حتى تقوم الساعة، فإن عجزتما عنه، فادفعا إلى فأنا أكفيكماه‏.‏   قال فحدثت هذا الحديث، عروة بن الزبير فقال صدق مالك بن أوس، أنا سمعت عائشة  رضى الله عنها  زوج النبي صلى الله عليه وسلم تقول أرسل أزواج النبي صلى الله عليه وسلم عثمان إلى أبي بكر يسألنه ثمنهن مما أفاء الله على رسوله صلى الله عليه وسلم، فكنت أنا أردهن، فقلت لهن ألا تتقين الله، ألم تعلمن أن النبي صلى الله عليه وسلم كان يقول ‏\"‏ لا نورث، ما تركنا صدقة  يريد بذلك نفسه  إنما يأكل آل محمد صلى الله عليه وسلم في هذا المال ‏\"‏‏.‏ فانتهى أزواج النبي صلى الله عليه وسلم إلى ما أخبرتهن‏.‏ قال فكانت هذه الصدقة بيد علي، منعها علي عباسا فغلبه عليها، ثم كان بيد حسن بن علي، ثم بيد حسين بن علي، ثم بيد علي بن حسين وحسن بن حسن، كلاهما كانا يتداولانها، ثم بيد زيد بن حسن، وهى صدقة رسول الله صلى الله عليه وسلم حقا‏.‏",
      "text_en": " Narrated Malik bin Aus Al-Hadathan An-Nasri:                     That once `Umar bin Al-Khattab called him and while he was sitting with him, his gatekeeper, Yarfa came and said, \"Will you admit `Uthman, `Abdur-Rahman bin `Auf, AzZubair and Sa`d (bin Abi Waqqas) who are waiting for your permission?\" `Umar said, \"Yes, let them come in.\" After a while, Yarfa- came again and said, \"Will you admit `Ali and `Abbas who are asking your permission?\" `Umar said, \"Yes.\" So, when the two entered, `Abbas said, \"O chief of the believers! Judge between me and this (i.e. `Ali). \"Both of them had a dispute regarding the property of Bani An-Nadir which Allah had given to His Apostle as Fai (i.e. booty gained without fighting), `Ali and `Abbas started reproaching each other. The (present) people (i.e. `Uthman and his companions) said, \"O chief of the believers! Give your verdict in their case and relieve each from) the other.\" `Umar said, \"Wait I beseech you, by Allah, by Whose Permission both the heaven and the earth stand fast! Do you know that Allah's Apostle said, 'We (Prophets) our properties are not to be inherited, and whatever we leave, is to be spent in charity,' and he said it about himself?\" They (i.e. `Uthman and his company) said, \"He did say it. \"`Umar then turned towards `Ali and `Abbas and said, \"I beseech you both, by Allah! Do you know that Allah's Apostle said this?\" They replied in the affirmative. He said, \"Now I am talking to you about this matter. Allah the Glorified favored His Apostle with something of this Fai (i.e. booty won without fighting) which He did not give to anybody else. Allah said:-- \"And what Allah gave to His Apostle (\"Fai\"\" Booty) from them--For which you made no expedition With either Calvary or camelry. But Allah gives power to His Apostles Over whomsoever He will And Allah is able to do all things.\" (59.6) So this property was especially granted to Allah's Apostle . But by Allah, the Prophet neither took it all for himself only, nor deprived you of it, but he gave it to all of you and distributed it amongst you till only this remained out of it. And from this Allah's Apostle used to spend the yearly maintenance for his family, and whatever used to remain, he used to spend it where Allah's Property is spent (i.e. in charity), Allah's Apostle kept on acting like that during all his life, Then he died, and Abu Bakr said, 'I am the successor of Allah's Apostle.' So he (i.e. Abu Bakr) took charge of this property and disposed of it in the same manner as Allah's Apostle used to do, and all of you (at that time) knew all about it.\" Then `Umar turned towards `Ali and `Abbas and said, \"You both remember that Abu Bakr disposed of it in the way you have described and Allah knows that, in that matter, he was sincere, pious, rightly guided and the follower of the right. Then Allah caused Abu Bakr to die and I said, 'I am the successor of Allah's Apostle and Abu Bakr.' So I kept this property in my possession for the first two years of my rule (i.e. Caliphate and I used to dispose of it in the same wa as Allah's Apostle and Abu Bakr used to do; and Allah knows that I have been sincere, pious, rightly guided an the follower of the right (in this matte Later on both of you (i.e. `Ali and `Abbas) came to me, and the claim of you both was one and the same, O `Abbas! You also came to me. So I told you both that Allah's Apostle said, \"Our property is not inherited, but whatever we leave is to be given in charity.' Then when I thought that I should better hand over this property to you both or the condition that you will promise and pledge before Allah that you will dispose it off in the same way as Allah's Apostle and Abu Bakr did and as I have done since the beginning of my caliphate or else you should not speak to me (about it).' So, both of you said to me, 'Hand it over to us on this condition.' And on this condition I handed it over to you. Do you want me now to give a decision other than that (decision)? By Allah, with Whose Permission both the sky and the earth stand fast, I will never give any decision other than that (decision) till the Last Hour is established. But if you are unable to manage it (i.e. that property), then return it to me, and I will manage on your behalf.\" The sub-narrator said, \"I told `Urwa bin Az-Zubair of this Hadith and he said, 'Malik bin Aus has told the truth\" I heard `Aisha, the wife of the Prophet saying, 'The wives of the Prophet sent `Uthman to Abu Bakr demanding from him their 1/8 of the Fai which Allah had granted to his Apostle. But I used to oppose them and say to them: Will you not fear Allah? Don't you know that the Prophet used to say: Our property is not inherited, but whatever we leave is to be given in charity? The Prophet mentioned that regarding himself. He added: 'The family of Muhammad can take their sustenance from this property. So the wives of the Prophet stopped demanding it when I told them of that.' So, this property (of Sadaqa) was in the hands of `Ali who withheld it from `Abbas and overpowered him. Then it came in the hands of Hasan bin `Ali, then in the hands of Husain bin `Ali, and then in the hands of `Ali bin Husain and Hasan bin Hasan, and each of the last two used to manage it in turn, then it came in the hands of Zaid bin Hasan, and it was truly the Sadaqa of Allah's Apostle .\"",
      "chain": [
        "30330",
        "20428",
        "11013",
        "5030",
        "3"
      ]
    },
    {
      "hadith_no": "4934",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان   غير مرة  عن عمرو، عن الزهري، عن مالك بن أوس بن الحدثان، عن عمر  رضى الله عنه  قال كانت أموال بني النضير مما أفاء الله على رسوله صلى الله عليه وسلم مما لم يوجف المسلمون عليه بخيل ولا ركاب، فكانت لرسول الله صلى الله عليه وسلم خاصة، ينفق على أهله منها نفقة سنته، ثم يجعل ما بقي في السلاح والكراع، عدة في سبيل الله‏.‏",
      "text_en": " Narrated `Umar:                     The properties of Bam An-Nadir were among the booty that Allah gave to His Apostle such Booty were not obtained by any expedition on the part of Muslims, neither with cavalry, nor with camelry. So those properties were for Allah's Apostle only, and he used to provide thereof the yearly expenditure for his wives, and dedicate the rest of its revenues for purchasing arms and horses as war material to be used in Allah's Cause.",
      "chain": [
        "30026",
        "20377",
        "11013",
        "5030",
        "3"
      ]
    },
    {
      "hadith_no": "5412",
      "source": " Sahih Bukhari ",
      "chapter": "Supporting the Family - كتاب النفقات",
      "chapter_no": "69",
      "text_ar": "حدثنا سعيد بن عفير، قال حدثني الليث، قال حدثني عقيل، عن ابن شهاب، قال أخبرني مالك بن أوس بن الحدثان، وكان، محمد بن جبير بن مطعم ذكر لي ذكرا من حديثه، فانطلقت حتى دخلت على مالك بن أوس فسألته فقال مالك انطلقت حتى أدخل على عمر، إذ أتاه حاجبه يرفا فقال هل لك في عثمان وعبد الرحمن والزبير وسعد يستأذنون قال نعم‏.‏ فأذن لهم  قال  فدخلوا وسلموا فجلسوا، ثم لبث يرفا قليلا فقال لعمر هل لك في علي وعباس قال نعم‏.‏ فأذن لهما، فلما دخلا سلما وجلسا، فقال عباس يا أمير المؤمنين اقض بيني وبين هذا‏.‏ فقال الرهط عثمان وأصحابه يا أمير المؤمنين اقض بينهما، وأرح أحدهما من الآخر‏.‏ فقال عمر اتئدوا أنشدكم بالله الذي به تقوم السماء والأرض، هل تعلمون أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا نورث ما تركنا صدقة ‏\"‏‏.‏ يريد رسول الله صلى الله عليه وسلم نفسه‏.‏ قال الرهط قد قال ذلك‏.‏ فأقبل عمر على علي وعباس فقال أنشدكما بالله هل تعلمان أن رسول الله صلى الله عليه وسلم قال ذلك قالا قد قال ذلك‏.‏ قال عمر فإني أحدثكم عن هذا الأمر، إن الله كان خص رسوله صلى الله عليه وسلم في هذا المال بشىء لم يعطه أحدا غيره، قال الله ‏{‏ما أفاء الله على رسوله منهم فما أوجفتم عليه من خيل‏}‏ إلى قوله ‏{‏قدير‏}‏‏.‏ فكانت هذه خالصة لرسول الله صلى الله عليه وسلم والله ما احتازها دونكم ولا استأثر بها عليكم، لقد أعطاكموها وبثها فيكم، حتى بقي منها هذا المال، فكان رسول الله صلى الله عليه وسلم ينفق على أهله نفقة سنتهم من هذا المال، ثم يأخذ ما بقي، فيجعله مجعل مال الله، فعمل بذلك رسول الله صلى الله عليه وسلم حياته، أنشدكم بالله، هل تعلمون ذلك قالوا نعم‏.‏ قال لعلي وعباس أنشدكما بالله هل تعلمان ذلك قالا نعم‏.‏ ثم توفى الله نبيه صلى الله عليه وسلم فقال أبو بكر أنا ولي رسول الله صلى الله عليه وسلم فقبضها أبو بكر يعمل فيها بما عمل به فيها رسول الله صلى الله عليه وسلم وأنتما حينئذ  وأقبل على علي وعباس  تزعمان أن أبا بكر كذا وكذا، والله يعلم أنه فيها صادق بار راشد تابع للحق، ثم توفى الله أبا بكر فقلت أنا ولي رسول الله صلى الله عليه وسلم وأبي بكر، فقبضتها سنتين أعمل فيها بما عمل رسول الله صلى الله عليه وسلم وأبو بكر، ثم جئتماني وكلمتكما واحدة وأمركما جميع، جئتني تسألني نصيبك من ابن أخيك، وأتى هذا يسألني نصيب امرأته من أبيها، فقلت إن شئتما دفعته إليكما على أن عليكما عهد الله وميثاقه لتعملان فيها بما عمل به رسول الله صلى الله عليه وسلم وبما عمل به فيها أبو بكر، وبما عملت به فيها، منذ وليتها، وإلا فلا تكلماني فيها فقلتما ادفعها إلينا بذلك‏.‏ فدفعتها إليكما بذلك، أنشدكم بالله هل دفعتها إليهما بذلك فقال الرهط نعم‏.‏ قال فأقبل على علي وعباس فقال أنشدكما بالله هل دفعتها إليكما بذلك قالا نعم‏.‏ قال أفتلتمسان مني قضاء غير ذلك، فوالذي بإذنه تقوم السماء والأرض لا أقضي فيها قضاء غير ذلك، حتى تقوم الساعة، فإن عجزتما عنها فادفعاها فأنا أكفيكماها‏.‏",
      "text_en": " Narrated Malik bin Aus bin Al-Hadathan:                     Once I set out to visit `Umar (bin Al-Khattab). (While I was sitting there with him his gate-keeper, Yarfa, came and said, \"Uthman `AbdurRahman (bin `Auf), Az-Zubair and Sa`d (bin Abi Waqqas) are seeking permission (to meet you).\" `Umar said, \"Yes. So he admitted them and they entered, greeted, and sat down. After a short while Yarfa came again and said to `Umar 'Shall I admit `Ali and `Abbas?\" `Umar said, \"Yes.\" He admitted them and when they entered, they greeted and sat down. `Abbas said, \"O Chief of the Believers! Judge between me and this (`Ali).\" The group, `Uthman and his companions Sa`d, 'O Chief of the Believers! Judge between them and relieve one from the other.\" `Umar said. Wait! I beseech you by Allah, by Whose permission both the Heaven and the Earth stand fast ! Do you know that Allah's Apostle said. 'We (Apostles) do not bequeath anything to our heirs, but whatever we leave is to be given in charity.' And by that Allah's Apostles meant himself?\" The group said, \"He did say so.\" `Umar then turned towards 'All and `Abbas and said. \"I beseech you both by Allah, do you know that Allah's Apostle said that?\" They said, 'Yes \" `Umar said, \"Now, let me talk to you about this matter. Allah favored His Apostle with something of this property (war booty) which He did not give to anybody else. And Allah said:-- 'And what Allah has bestowed on His Apostle (as Fai Booty) from them for which you made no expedition with either cavalry or camelry . . . Allah is Able to do all things.' (59.6) So this property was especially granted to Allah's Apostle. But by Allah he neither withheld it from you, nor did he keep it for himself and deprive you of it, but he gave it all to you and distributed it among you till only this remained out of it. And out of this property Allah's Apostle used to provide his family with their yearly needs, and whatever remained, he would spend where Allah's Property (the revenues of Zakat) used to be spent. Allah's Apostle kept on acting like this throughout his lifetime. Now I beseech you by Allah, do you know that?\" They said, \"Yes.\" Then `Umar said to `Ali and `Abbas, \"I beseech you by Allah, do you both know that?\" They said, \"Yes.\" `Umar added, \"When Allah had taken His Apostle unto Him, Abu Bakr said, 'I am the successor of Allah's Apostle. So he took charge of that property and did with it the same what Allah's Apostle used to do, and both of you knew all about it then.\" Then `Umar turned towards `Ali and `Abbas and said, \"You both claim that Abu- Bakr was so-and-so! But Allah knows that he was honest, sincere, pious and right (in that matter). Then Allah caused Abu Bakr to die, and I said, 'I am the successor of Allah's Apostle and Abu Bakr.' So I kept this property in my possession for the first two years of my rule, and I used to do the same with it as Allah's Apostle and Abu Bakr used to do. Later both of you (`Ali and `Abbas) came to me with the same claim and the same problem. (O `Abbas!) You came to me demanding your share from (the inheritance of) the son of your brother, and he (`Ali) came to me demanding his wives share from (the inheritance of) her father. So I said to you, 'If you wish I will hand over this property to you, on condition that you both promise me before Allah that you will manage it in the same way as Allah's Apostle and Abu Bakr did, and as I have done since the beginning of my rule; otherwise you should not speak to me about it.' So you both said, 'Hand over this property to us on this condition.' And on this condition I handed it over to you. I beseech you by Allah, did I hand it over to them on that condition?\" The group said, \"Yes.\" `Umar then faced `Ali and `Abbas and said, \"I beseech you both by Allah, did I hand it over to you both on that condition?\" They both said, \"Yes.\" `Umar added, \"Do you want me now to give a decision other than that? By Him with Whose permission (order) both the Heaven and the Earth stand fast, I will never give any decision other than that till the Hour is established! But if you are unable to manage it (that property), then return it to me and I will be sufficient for it on your behalf . \"",
      "chain": [
        "30233",
        "20023",
        "11207",
        "11013",
        "5030",
        "11058"
      ]
    },
    {
      "hadith_no": "6814",
      "source": " Sahih Bukhari ",
      "chapter": "Laws of Inheritance (Al-Faraa'id) - كتاب الفرائض",
      "chapter_no": "85",
      "text_ar": "حدثنا يحيى بن بكير، حدثنا الليث، عن عقيل، عن ابن شهاب، قال أخبرني مالك بن أوس بن الحدثان،، وكان، محمد بن جبير بن مطعم ذكر لي من حديثه ذلك، فانطلقت حتى دخلت عليه فسألته فقال انطلقت حتى أدخل على عمر فأتاه حاجبه يرفأ فقال هل لك في عثمان وعبد الرحمن والزبير وسعد قال نعم‏.‏ فأذن لهم، ثم قال هل لك في علي وعباس قال نعم‏.‏ قال عباس يا أمير المؤمنين اقض بيني وبين هذا‏.‏ قال أنشدكم بالله الذي بإذنه تقوم السماء والأرض هل تعلمون أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا نورث ما تركنا صدقة ‏\"‏‏.‏ يريد رسول الله صلى الله عليه وسلم نفسه‏.‏ فقال الرهط قد قال ذلك‏.‏ فأقبل على علي وعباس فقال هل تعلمان أن رسول الله صلى الله عليه وسلم قال ذلك قالا قد قال ذلك‏.‏ قال عمر فإني أحدثكم عن هذا الأمر، إن الله قد كان خص رسوله صلى الله عليه وسلم في هذا الفىء بشىء لم يعطه أحدا غيره، فقال عز وجل ‏{‏ما أفاء الله على رسوله‏}‏ إلى قوله ‏{‏قدير‏}‏ فكانت خالصة لرسول الله صلى الله عليه وسلم والله ما احتازها دونكم، ولا استأثر بها عليكم، لقد أعطاكموه وبثها فيكم، حتى بقي منها هذا المال، فكان النبي صلى الله عليه وسلم ينفق على أهله من هذا المال نفقة سنته، ثم يأخذ ما بقي فيجعله مجعل مال الله، فعمل بذلك رسول الله صلى الله عليه وسلم حياته، أنشدكم بالله هل تعلمون ذلك قالوا نعم‏.‏ ثم قال لعلي وعباس أنشدكما بالله هل تعلمان ذلك قالا نعم‏.‏ فتوفى الله نبيه صلى الله عليه وسلم فقال أبو بكر أنا ولي رسول الله صلى الله عليه وسلم فقبضها فعمل بما عمل به رسول الله صلى الله عليه وسلم ثم توفى الله أبا بكر فقلت أنا ولي ولي رسول الله صلى الله عليه وسلم فقبضتها سنتين أعمل فيها ما عمل رسول الله صلى الله عليه وسلم وأبو بكر، ثم جئتماني وكلمتكما واحدة، وأمركما جميع، جئتني تسألني نصيبك من ابن أخيك، وأتاني هذا يسألني نصيب امرأته من أبيها فقلت إن شئتما دفعتها إليكما بذلك، فتلتمسان مني قضاء غير ذلك، فوالله الذي بإذنه تقوم السماء والأرض، لا أقضي فيها قضاء غير ذلك حتى تقوم الساعة، فإن عجزتما فادفعاها إلى، فأنا أكفيكماها‏.‏",
      "text_en": " Narrated Malik bin Aus:                     'I went and entered upon `Umar, his doorman, Yarfa came saying `Uthman, `Abdur-Rahman, Az- Zubair and Sa`d are asking your permission (to see you). May I admit them? `Umar said, 'Yes.' So he admitted them Then he came again and said, 'May I admit `Ali and `Abbas?' He said, 'Yes.' `Abbas said, 'O, chief of the believers! Judge between me and this man (Ali ). `Umar said, 'I beseech you by Allah by Whose permission both the heaven and the earth exist, do you know that Allah's Apostle said, 'Our (the Apostles') property will not be inherited, and whatever we leave (after our death) is to be spent in charity?' And by that Allah's Apostle meant himself.' The group said, '(No doubt), he said so.' `Umar then faced `Ali and `Abbas and said, 'Do you both know that Allah's Apostle said that?' They replied, '(No doubt), he said so.' `Umar said, 'So let me talk to you about this matter. Allah favored His Apostle with something of this Fai' (i.e. booty won by the Muslims at war without fighting) which He did not give to anybody else; Allah said:-- 'And what Allah gave to His Apostle ( Fai' Booty) .........to do all things....(59.6) And so that property was only for Allah's Apostle . Yet, by Allah, he neither gathered that property for himself nor withheld it from you, but he gave its income to you, and distributed it among you till there remained the present property out of which the Prophet used to spend the yearly maintenance for his family, and whatever used to remain, he used to spend it where Allah's property is spent (i.e. in charity etc.). Allah's Apostle followed that throughout his life. Now I beseech you by Allah, do you know all that?' They said, 'Yes.' `Umar then said to `Ali and `Abbas, 'I beseech you by Allah, do you know that?' Both of them said, 'Yes.' `Umar added, 'And when the Prophet died, Abu Bakr said, ' I am the successor of Allah's Apostle, and took charge of that property and managed it in the same way as Allah's Apostle did. Then I took charge of this property for two years during which I managed it as Allah's Apostle and Abu Bakr did. Then you both (`Ali and `Abbas) came to talk to me, bearing the same claim and presenting the same case. (O `Abbas!) You came to me asking for your share from the property of your nephew, and this man (Ali) came to me, asking for the share of h is wife from the property of her father. I said, 'If you both wish, I will give that to you on that condition (i.e. that you would follow the way of the Prophet and Abu Bakr and as I (`Umar) have done in man aging it).' Now both of you seek of me a verdict other than that? Lo! By Allah, by Whose permission both the heaven and the earth exist, I will not give any verdict other than that till the Hour is established. If you are unable to manage it, then return it to me, and I will be sufficient to manage it on your behalf.' \"",
      "chain": [
        "30399",
        "20023",
        "11207",
        "11013",
        "5030",
        "11058"
      ]
    },
    {
      "hadith_no": "7391",
      "source": " Sahih Bukhari ",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا عبد الله بن يوسف، حدثنا الليث، حدثني عقيل، عن ابن شهاب، قال أخبرني مالك بن أوس النصري، وكان، محمد بن جبير بن مطعم ذكر لي ذكرا من ذلك فدخلت على مالك فسألته فقال انطلقت حتى أدخل على عمر أتاه حاجبه يرفا فقال هل لك في عثمان وعبد الرحمن والزبير وسعد يستأذنون‏.‏ قال نعم‏.‏ فدخلوا فسلموا وجلسوا‏.‏ فقال هل لك في علي وعباس‏.‏ فأذن لهما‏.‏ قال العباس يا أمير المؤمنين اقض بيني وبين الظالم‏.‏ استبا‏.‏ فقال الرهط عثمان وأصحابه يا أمير المؤمنين اقض بينهما وأرح أحدهما من الآخر‏.‏ فقال اتئدوا أنشدكم بالله الذي بإذنه تقوم السماء والأرض، هل تعلمون أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا نورث ما تركنا صدقة ‏\"‏‏.‏ يريد رسول الله صلى الله عليه وسلم نفسه‏.‏ قال الرهط قد قال ذلك‏.‏ فأقبل عمر على علي وعباس فقال أنشدكما بالله هل تعلمان أن رسول الله صلى الله عليه وسلم قال ذلك‏.‏ قالا نعم‏.‏ قال عمر فإني محدثكم عن هذا الأمر، إن الله كان خص رسوله صلى الله عليه وسلم في هذا المال بشىء لم يعطه أحدا غيره، فإن الله يقول ‏{‏ما أفاء الله على رسوله منهم فما أوجفتم‏}‏ الآية، فكانت هذه خالصة لرسول الله صلى الله عليه وسلم، ثم والله ما احتازها دونكم ولا استأثر بها عليكم، وقد أعطاكموها وبثها فيكم، حتى بقي منها هذا المال، وكان النبي صلى الله عليه وسلم ينفق على أهله نفقة سنتهم من هذا المال، ثم يأخذ ما بقي فيجعله مجعل مال الله، فعمل النبي صلى الله عليه وسلم بذلك حياته، أنشدكم بالله هل تعلمون ذلك فقالوا نعم‏.‏ ثم قال لعلي وعباس أنشدكما الله هل تعلمان ذلك قالا نعم‏.‏ ثم توفى الله نبيه صلى الله عليه وسلم فقال أبو بكر أنا ولي رسول الله صلى الله عليه وسلم، فقبضها أبو بكر فعمل فيها بما عمل فيها رسول الله صلى الله عليه وسلم، وأنتما حينئذ  وأقبل على علي وعباس  تزعمان أن أبا بكر فيها كذا، والله يعلم أنه فيها صادق بار راشد تابع للحق، ثم توفى الله أبا بكر فقلت أنا ولي رسول الله صلى الله عليه وسلم وأبي بكر‏.‏ فقبضتها سنتين أعمل فيها بما عمل به رسول الله صلى الله عليه وسلم وأبو بكر، ثم جئتماني وكلمتكما على كلمة واحدة وأمركما جميع، جئتني تسألني نصيبك من ابن أخيك، وأتاني هذا يسألني نصيب امرأته من أبيها فقلت إن شئتما دفعتها إليكما، على أن عليكما عهد الله وميثاقه تعملان فيها بما عمل به رسول الله صلى الله عليه وسلم وبما عمل فيها أبو بكر وبما عملت فيها منذ وليتها، وإلا فلا تكلماني فيها‏.‏ فقلتما ادفعها إلينا بذلك‏.‏ فدفعتها إليكما بذلك، أنشدكم بالله هل دفعتها إليهما بذلك قال الرهط نعم‏.‏ فأقبل على علي وعباس فقال أنشدكما بالله هل دفعتها إليكما بذلك‏.‏ قالا نعم‏.‏ قال أفتلتمسان مني قضاء غير ذلك فوالذي بإذنه تقوم السماء والأرض لا أقضي فيها قضاء غير ذلك حتى تقوم الساعة، فإن عجزتما عنها فادفعاها إلى، فأنا أكفيكماها‏.‏",
      "text_en": " Narrated Malik bin Aus An-Nasri:                     I proceeded till I entered upon `Umar (and while I was sitting there), his gate-keeper Yarfa came to him and said, \" `Uthman, `Abdur-Rahman, Az-Zubair and Sa`d ask your permission to come in.\" `Umar allowed them. So they entered, greeted, and sat down. (After a while the gatekeeper came) and said, \"Shall I admit `Ali and `Abbas?'' `Umar allowed them to enter. Al-`Abbas said \"O Chief of the believers! Judge between me and the oppressor (`Ali).\" Then there was a dispute (regarding the property of Bani Nadir) between them (`Abbas and `Ali). `Uthman and his companions said, \"O Chief of the Believers! Judge between them and relieve one from the other.\" `Umar said, \"Be patient! beseech you by Allah, with Whose permission the Heaven and the Earth Exist! Do you know that Allah's Apostle said, 'Our property is not to be inherited, and whatever we leave is to be given in charity,' and by this Allah's Apostle meant himself?\" On that the group said, \"He verily said so.\" `Umar then faced `Ali and `Abbas and said, \"I beseech you both by Allah, do you both know that Allah's Apostle said so?\" They both replied, \"Yes\". `Umar then said, \"Now I am talking to you about this matter (in detail) . Allah favored Allah's Apostle with some of this wealth which He did not give to anybody else, as Allah said: 'What Allah bestowed as Fai (Booty on His Apostle for which you made no expedition... ' (59.6) So that property was totally meant for Allah's Apostle, yet he did not collect it and ignore you, nor did he withhold it with your exclusion, but he gave it to you and distributed it among you till this much of it was left behind, and the Prophet, used to spend of this as the yearly expenditures of his family and then take what remained of it and spent it as he did with (other) Allah's wealth. The Prophet did so during all his lifetime, and I beseech you by Allah, do you know that?\" They replied, \"Yes.\" `Umar then addressed `Ali and `Abbas, saying, \"I beseech you both by Allah, do you know that?\" Both of them replied, \"Yes.\" `Umar added, \"Then Allah took His Apostle unto Him. Abu Bakr then said 'I am the successor of Allah's Apostle' and took over all the Prophet's property and disposed of it in the same way as Allah's Apostle used to do, and you were present then.\" Then he turned to `Ali and `Abbas and said, \"You both claim that Abu Bakr did so-and-so in managing the property, but Allah knows that Abu Bakr was honest, righteous, intelligent, and a follower of what is right in managing it. Then Allah took Abu Bakr unto Him, 'I said: I am the successor of Allah's Apostle and Abu Bakr.' So I took over the property for two years and managed it in the same way as Allah's Apostle, and Abu Bakr used to do. Then you both (`Ali and `Abbas) came to me and asked for the same thing! (O `Abbas! You came to me to ask me for your share from nephew's property; and this (`Ali) came to me asking for his wives share from her father's property, and I said to you both, 'If you wish, I will place it in your custody on condition that you both will manage it in the same way as Allah's Apostle and Abu Bakr did and as I have been doing since I took charge of managing it; otherwise, do not speak to me anymore about it.' Then you both said, 'Give it to us on that (condition).' So I gave it to you on that condition. Now I beseech you by Allah, did I not give it to them on that condition?\" The group (whom he had been addressing) replied, \"Yes.\" `Umar then addressed `Abbas and `Ali saying, \"I beseech you both by Allah, didn't I give you all that property on that condition?\" They said, \"Yes.\" `Umar then said, \"Are you now seeking a verdict from me other than that? By Him with Whose Permission the Heaven and the Earth exists I will not give any verdict other than that till the Hour is established; and if you both are unable to manage this property, then you can hand it back to me, and I will be sufficient for it on your behalf.\" (See, Hadith No. 326, Vol. 4)",
      "chain": [
        "30355",
        "20023",
        "11207",
        "11013",
        "5030",
        "11058"
      ]
    },
    {
      "hadith_no": "4143",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا ليث، ح وحدثنا محمد بن رمح، أخبرنا الليث، عن ابن شهاب، عن مالك بن أوس بن الحدثان، أنه قال أقبلت أقول من يصطرف الدراهم فقال طلحة بن عبيد الله وهو عند عمر بن الخطاب أرنا ذهبك ثم ائتنا إذا جاء خادمنا نعطك ورقك ‏.‏ فقال عمر بن الخطاب كلا والله لتعطينه ورقه أو لتردن إليه ذهبه فإن رسول الله صلى الله عليه وسلم قال ‏\"‏ الورق بالذهب ربا إلا هاء وهاء والبر بالبر ربا إلا هاء وهاء والشعير بالشعير ربا إلا هاء وهاء والتمر بالتمر ربا إلا هاء وهاء‏\"‏ ‏.‏",
      "text_en": " Malik b. Aus b. al-Hadathan reported:                      I came saying who was prepared toexchange dirhams (for my gold), whereupon Talha b. Ubaidullah (Allah be pleased with him) (as he was sitting with 'Umar b. Khattib) said: Show us your gold and then come to us (at a later time). When our servant would come we would give you your silver (dirhams due to you). Thereupon 'Umar b. al-Khattib (Allah be pleased with him) said: Not at all. By Allah, either give him his silver (coins). or return his gold to him, for Allah's Messenger (may peace be upon him) said: Exchange of silver for gold (has an element of) interest in it. except when (it is exchanged) on the spot;and wheat for wheat is an interest unless both are handed over on the spot: barley for barley is interest unless both are handed over on the spot; dates for dates is interest unless both are handed over on the Spot.",
      "chain": [
        "30367",
        "20023",
        "30490",
        "20023",
        "11013",
        "5030"
      ]
    },
    {
      "hadith_no": "4677",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا إسحاق بن إبراهيم، ومحمد بن رافع، وعبد بن حميد، - قال ابن رافع حدثنا وقال الآخران، أخبرنا عبد الرزاق، - أخبرنا معمر، عن الزهري، عن مالك بن أوس، بن الحدثان قال أرسل إلى عمر بن الخطاب فقال إنه قد حضر أهل أبيات من قومك ‏.‏ بنحو حديث مالك ‏.‏ غير أن فيه، فكان ينفق على أهله منه سنة وربما قال معمر يحبس قوت أهله منه سنة ثم يجعل ما بقي منه مجعل مال الله عز وجل ‏.‏",
      "text_en": " The same hadith has been narrated by a different chain of transmitters with a slight variation in wording:                      'Umar b. al-Khattab sent for me and said: Some families from your tribe have come to me (then follows the foregoing hadith) by Malik with the difference that the Messenger of Allah (may peace be upon him) would spend on his family for a year. And sometimes Ma'mar said: He would retain sustenance for his family for a year, and what was left of that he spent in the cause of Allah, the Majestic and Exalted.",
      "chain": [
        "30123",
        "30375",
        "30553",
        "20121",
        "20115",
        "11013",
        "5030"
      ]
    },
    {
      "hadith_no": "2950",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا النفيلي، حدثنا محمد بن سلمة، عن محمد بن إسحاق، عن محمد بن عمرو بن عطاء، عن مالك بن أوس بن الحدثان، قال ذكر عمر بن الخطاب يوما الفىء فقال ما أنا بأحق، بهذا الفىء منكم وما أحد منا بأحق به من أحد إلا أنا على منازلنا من كتاب الله عز وجل وقسم رسول الله صلى الله عليه وسلم فالرجل وقدمه والرجل وبلاؤه والرجل وعياله والرجل وحاجته ‏.‏",
      "text_en": " Narrated Umar ibn al-Khattab:                     Malik ibn Aws ibn al-Hadthan said: One day Umar ibn al-Khattab mentioned the spoils of war and said: I am not more entitled to this spoil of war than you; and none of us is more entitled to it than another, except that we occupy our positions fixed by the Book of Allah, Who is Great and Glorious, and the division made by the Messenger of Allah (ﷺ), people being arranged according to their precedence in accepting Islam, the hardship they have endured their having children and their need.",
      "chain": [
        "30352",
        "20672",
        "11107",
        "11220",
        "5030",
        "3"
      ]
    },
    {
      "hadith_no": "2963",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا الحسن بن علي، ومحمد بن يحيى بن فارس المعنى، قالا حدثنا بشر بن عمر الزهراني، حدثني مالك بن أنس، عن ابن شهاب، عن مالك بن أوس بن الحدثان، قال أرسل إلى عمر حين تعالى النهار فجئته فوجدته جالسا على سرير مفضيا إلى رماله فقال حين دخلت عليه يا مال إنه قد دف أهل أبيات من قومك وإني قد أمرت فيهم بشىء فاقسم فيهم ‏.‏ قلت لو أمرت غيري بذلك ‏.‏ فقال خذه ‏.‏ فجاءه يرفأ فقال يا أمير المؤمنين هل لك في عثمان بن عفان وعبد الرحمن بن عوف والزبير بن العوام وسعد بن أبي وقاص قال نعم ‏.‏ فأذن لهم فدخلوا ثم جاءه يرفأ فقال يا أمير المؤمنين هل لك في العباس وعلي قال نعم ‏.‏ فأذن لهم فدخلوا فقال العباس يا أمير المؤمنين اقض بيني وبين هذا - يعني عليا - فقال بعضهم أجل يا أمير المؤمنين اقض بينهما وارحمهما ‏.‏ قال مالك بن أوس خيل إلى أنهما قدما أولئك النفر لذلك ‏.‏ فقال عمر رحمه الله اتئدا ‏.‏ ثم أقبل على أولئك الرهط فقال أنشدكم بالله الذي بإذنه تقوم السماء والأرض هل تعلمون أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا نورث ما تركنا صدقة ‏\"‏ ‏.‏ قالوا نعم ‏.‏ ثم أقبل على علي والعباس رضى الله عنهما فقال أنشدكما بالله الذي بإذنه تقوم السماء والأرض هل تعلمان أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا نورث ما تركنا صدقة ‏\"‏ ‏.‏ فقالا نعم ‏.‏ قال فإن الله خص رسوله صلى الله عليه وسلم بخاصة لم يخص بها أحدا من الناس فقال الله تعالى ‏{‏ وما أفاء الله على رسوله منهم فما أوجفتم عليه من خيل ولا ركاب ولكن الله يسلط رسله على من يشاء والله على كل شىء قدير ‏}‏ وكان الله أفاء على رسوله بني النضير فوالله ما استأثر بها عليكم ولا أخذها دونكم فكان رسول الله صلى الله عليه وسلم يأخذ منها نفقة سنة أو نفقته ونفقة أهله سنة ويجعل ما بقي أسوة المال ‏.‏ ثم أقبل على أولئك الرهط فقال أنشدكم بالله الذي بإذنه تقوم السماء والأرض هل تعلمون ذلك قالوا نعم ‏.‏ ثم أقبل على العباس وعلي رضى الله عنهما فقال أنشدكما بالله الذي بإذنه تقوم السماء والأرض هل تعلمان ذلك قالا نعم ‏.‏ فلما توفي رسول الله صلى الله عليه وسلم قال أبو بكر أنا ولي رسول الله صلى الله عليه وسلم فجئت أنت وهذا إلى أبي بكر تطلب أنت ميراثك من ابن أخيك ويطلب هذا ميراث امرأته من أبيها فقال أبو بكر رحمه الله قال رسول الله صلى الله عليه وسلم ‏\"‏ لا نورث ما تركنا صدقة ‏\"‏ ‏.‏ والله يعلم إنه لصادق بار راشد تابع للحق فوليها أبو بكر فلما توفي أبو بكر قلت أنا ولي رسول الله صلى الله عليه وسلم وولي أبي بكر فوليتها ما شاء الله أن أليها فجئت أنت وهذا وأنتما جميع وأمركما واحد فسألتمانيها فقلت إن شئتما أن أدفعها إليكما على أن عليكما عهد الله أن تلياها بالذي كان رسول الله صلى الله عليه وسلم يليها فأخذتماها مني على ذلك ثم جئتماني لأقضي بينكما بغير ذلك والله لا أقضي بينكما بغير ذلك حتى تقوم الساعة فإن عجزتما عنها فرداها إلى ‏.‏ قال أبو داود إنما سألاه أن يكون يصيره بينهما نصفين لا أنهما جهلا أن النبي صلى الله عليه وسلم قال ‏\"‏ لا نورث ما تركنا صدقة ‏\"‏ ‏.‏ فإنهما كانا لا يطلبان إلا الصواب ‏.‏ فقال عمر لا أوقع عليه اسم القسم أدعه على ما هو عليه ‏.‏",
      "text_en": " Narrated Malik b. Aws b. Al-Hadathan:                     'Umar sent for me when the day rose high. I found him sitting on a couch without cover. When I entered upon him, he said: Malik, some people of you tribe gradually came here, and I have ordered to give them something, so distribute it among them. I said: If you assigned this (work) to some other person, (it would be better). He said: Take it. Then Yarfa' came to him and said: Commander of the Faithful, will you permit 'Uthman b. 'Affan, 'Abd al-Rahman b. 'Awf, al-Zubair b. al-'Awwam, and Sa'd b, Abi Waqqas (to enter) ? He said:  Yes. So he permitted them and they entered. Yarfa' again came to him and said: Commander of the Faithful, would you permit al-'Abbas and 'Ali ? He said: Yes. He then permitted them and they entered. Al-'Abbas said: Commander of Faithful, decide between me and this, referring to 'Ali. Some of them said: Yes, Commander of the Faithful, decide between them and give them comfort. Malik b. Aws said: It occurred to me that both of them brought the other people for this. 'Umar said: Show patience (do not make haste). He then turned towards those people and said: I adjure you by Allah by Whose order the heaven and earth stand. Do you know that Messenger of Allah (ﷺ) said: We are not inherited whatever we leave is sadaqah (alms). They said: Yes. He then turned towards 'Ali and al-'Abbas and said: I adjure you by Allah by Whose order the heaven and earth stand. Do you know that Messenger of Allah (ﷺ) said: We are not inherited whatever we leave is sadaqah (alms). They said: Yes. He then said: Allah has appointed for the Messenger of Allah (ﷺ) a special portion (in the booty) which he did not do for anyone. Allah, Most High, said: What Allah has bestowed on His Apostle (and taken away) from them - for this ye made no expedition with either cavalry or camelry. But Allah gives power to His apostles over any He pleases ; and Allah has power over all things\". Allah bestowed (the property of) Banu al-Nadir on His Apostle. I swear by Allah, he did not reserve it for himself, nor did he take it over and above you. The Messenger of Allah (ﷺ) used to his share for his maintenance annually, or used to take his contribution and give his family their annual contribution (from this property), then take what remained and deal with it as he did with Allah's property. He then turned towards those people and said: I adjure you by Allah by Whose order the heaven and earth stand. Do you know that ? They said: Yes.  He then turned towards 'Ali and al-'Abbas and said: I adjure you by Allah by Whose order the heaven and earth stand. Do you know that ? They said: Yes. When the Messenger of Allah (ﷺ)  died, Abu Bakr said: I am the protector of the Messenger of Allah (ﷺ). Then you and this ('Ali) came to Abu Bakr, demanding a share from the inheritance of your cousin, and this ('Ali) demanding the share of his wife from (the property of her) father. Abu Bakr then said: The Messenger of Allah (ﷺ)  said: We are not inherited. Whatever we leave is sadaqah. Allah knows that he (Abu Bakr) was true, faithful, rightly-guided, and the follower of Triuth. Abu Bakr then administered it (property of the Prophet). When Abu Bakr died, I said: I am the protector of the Messenger of Allah (ﷺ) and Abu Bakr. So I administered whatever Allah wished. Then you and this ('Ali) came. Both of you are at one, and your matter is the same. So they asked me for it (property), and I said: If you wish I give it to you on condition that you are bound by the covenant of Allah, meaning that you will administer it as the Messenger of Allah (ﷺ)  used to administer. So you took it from me on that condition. Then again you have come to me so that I decide between you other than that. I swear by Allah, I shall not decide between you other than that till the Last Hour comes. If you helpless, return it to me.Abu Dawud said: They asked him for making it half between them, and not that they were ignorant of the fact the Prophet (ﷺ) said: We are not inherited. Whatever we leave is sadaqah (alms). They were also seeking the truth. 'Umar then said: I do not apply the name of division to it ; It leave it on its former condition.",
      "chain": [
        "30",
        "11222",
        "20211",
        "20001",
        "11013",
        "5030"
      ]
    },
    {
      "hadith_no": "2965",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا عثمان بن أبي شيبة، وأحمد بن عبدة، - المعنى - أن سفيان بن عيينة، أخبرهم عن عمرو بن دينار، عن الزهري، عن مالك بن أوس بن الحدثان، عن عمر، قال كانت أموال بني النضير مما أفاء الله على رسوله مما لم يوجف المسلمون عليه بخيل ولا ركاب كانت لرسول الله صلى الله عليه وسلم خالصا ينفق على أهل بيته - قال ابن عبدة ينفق على أهله قوت سنة - فما بقي جعل في الكراع وعدة في سبيل الله عز وجل قال ابن عبدة في الكراع والسلاح ‏.‏",
      "text_en": " Narrated 'Umar:                     The properties of Banu al-Nadir were part of what Allah bestowed on His Apostle from what the Muslims has not ridden on horses or camels to get; so they belonged specially to the Messenger of Allah (ﷺ) who gave his family their annual contribution.Ibn 'Abdah said: His family (ahlihi) and not the members of his houses (ahl baitihi) ; then applied what remained for horses and weapons in Allah's path.",
      "chain": [
        "30203",
        "30423",
        "20005",
        "11081",
        "11013",
        "5030",
        "3"
      ]
    },
    {
      "hadith_no": "2967",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا هشام بن عمار، حدثنا حاتم بن إسماعيل، ح وحدثنا سليمان بن داود المهري، أخبرنا ابن وهب، أخبرني عبد العزيز بن محمد، ح وحدثنا نصر بن علي، حدثنا صفوان بن عيسى، - وهذا لفظ حديثه - كلهم عن أسامة بن زيد، عن الزهري، عن مالك بن أوس بن الحدثان، قال كان فيما احتج به عمر رضى الله عنه أنه قال كانت لرسول الله صلى الله عليه وسلم ثلاث صفايا بنو النضير وخيبر وفدك فأما بنو النضير فكانت حبسا لنوائبه وأما فدك فكانت حبسا لأبناء السبيل وأما خيبر فجزأها رسول الله صلى الله عليه وسلم ثلاثة أجزاء جزءين بين المسلمين وجزءا نفقة لأهله فما فضل عن نفقة أهله جعله بين فقراء المهاجرين ‏.‏",
      "text_en": " Narrated Umar ibn al-Khattab:                     Malik ibn Aws al-Hadthan said: One of the arguments put forward by Umar was that he said that the Messenger of Allah (ﷺ) received three things exclusively to himself: Banu an-Nadir, Khaybar and Fadak. The Banu an-Nadir property was kept wholly for his emergent needs, Fadak for travellers, and Khaybar was divided by the Messenger of Allah (ﷺ) into three sections: two for Muslims, and one as a contribution for his family. If anything remained after making the contribution of his family, he divided it among the poor Emigrants.",
      "chain": [
        "30288",
        "20159",
        "30584",
        "20029",
        "20167",
        "30395",
        "20553",
        "50",
        "11013",
        "5030"
      ]
    },
    {
      "hadith_no": "1243",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا قتيبة، حدثنا الليث، عن ابن شهاب، عن مالك بن أوس بن الحدثان، أنه قال أقبلت أقول من يصطرف الدراهم فقال طلحة بن عبيد الله وهو عند عمر بن الخطاب أرنا ذهبك ثم ائتنا إذا جاء خادمنا نعطك ورقك ‏.‏ فقال عمر كلا والله لتعطينه ورقه أو لتردن إليه ذهبه فإن رسول الله صلى الله عليه وسلم قال ‏\"‏ الورق بالذهب ربا إلا هاء وهاء والبر بالبر ربا إلا هاء وهاء والشعير بالشعير ربا إلا هاء وهاء والتمر بالتمر ربا إلا هاء وهاء ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ والعمل على هذا عند أهل العلم ‏.‏ ومعنى قوله ‏\"‏ إلا هاء وهاء ‏\"‏ يقول يدا بيد ‏.‏",
      "text_en": " Narrated Ibn Shihab:                     From Malik bin Aws bin Hadathan that he said: \"I once said: 'Who can change some Dirham?' So Talhah bin 'Ubaidullah - and he was with 'Umar bin Al-Khattab - said: \"Leave your gold with us, then return to us when our servant comes and we will give you your silver.\" 'Umar bin Al-Khattab said: \"No! By Allah! Either give him his silver or return his gold to him. Indeed the Messenger of Allah (ﷺ) said: 'Silver for gold is Riba,  except for hand to hand; and wheat for wheat is Riba except for hand to hand; and barley for barley is Riba except hand to hand; and dried-dates for dried-dates is Riba except for hand to hand.'\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. This is acted upon according to the people of knowledge. And the meaning of Ha' Wa Ha' is hand to hand.",
      "chain": [
        "30367",
        "20023",
        "11013",
        "5030"
      ]
    },
    {
      "hadith_no": "1610",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Military Expeditions - كتاب السير عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "21",
      "text_ar": "حدثنا الحسن بن علي الخلال، أخبرنا بشر بن عمر، حدثنا مالك بن أنس، عن ابن شهاب، عن مالك بن أوس بن الحدثان، قال دخلت على عمر بن الخطاب ودخل عليه عثمان بن عفان والزبير بن العوام وعبد الرحمن بن عوف وسعد بن أبي وقاص ثم جاء علي والعباس يختصمان فقال عمر لهم أنشدكم بالله الذي بإذنه تقوم السماء والأرض تعلمون أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا نورث ما تركناه صدقة ‏\"‏ ‏.‏ قالوا نعم ‏.‏ قال عمر فلما توفي رسول الله صلى الله عليه وسلم قال أبو بكر أنا ولي رسول الله صلى الله عليه وسلم ‏.‏ فجئت أنت وهذا إلى أبي بكر تطلب أنت ميراثك من ابن أخيك ويطلب هذا ميراث امرأته من أبيها فقال أبو بكر إن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا نورث ما تركناه صدقة ‏\"‏ ‏.‏ والله يعلم إنه لصادق بار راشد تابع للحق ‏.‏ قال أبو عيسى وفي الحديث قصة طويلة ‏.‏ وهذا حديث حسن صحيح غريب من حديث مالك بن أنس ‏.‏",
      "text_en": " Narrated Malik bin Aws bin Al-Hadathan:                     \"I entered upon 'Umar bin Al-Khattab. (Then) Uthman bin 'Affan, Az-Zubair, 'Abdur-Rahman bin Awf, and Sa'd bin Abi Waqqas entered. Then 'Ali and Al-'Abbas came disputing. 'Umar said to them: ' I ask you, by Allah the One by Whose Will the heavens and the earth are maintained, do you know that the Messenger of Allah (ﷺ) said: \"We are not inherited from, what we leave is charity?\" They said: 'Yes.' 'Umar said: 'When the Messenger of Allah (ﷺ) died, Abu Bakr said: \"I am the caretaker of the Messenger of Allah (ﷺ)\" So you and he went to Abu Bakr and you sought your inheritance from the son of your brother, and he sought the inheritance of his wife from her father. So Abu Bakr said that the Messenger of Allah (ﷺ) said: \"We are not inherited from, what we leave is charity.\" And Allah knows that he is truthful, innocent, instructing and following the truth.'\"[Abu 'Eisa said:] There is a lengthy story along with the Hadith. And this Hadith is Hasan Sahih Gharib as a narration of Malik bin Anas.",
      "chain": [
        "30115",
        "20211",
        "20001",
        "11013",
        "5030"
      ]
    },
    {
      "hadith_no": "1719",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jihad - كتاب الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "23",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان بن عيينة، عن عمرو بن دينار، عن ابن شهاب، عن مالك بن أوس بن الحدثان، قال سمعت عمر بن الخطاب، يقول كانت أموال بني النضير مما أفاء الله على رسوله مما لم يوجف المسلمون عليه بخيل ولا ركاب وكانت لرسول الله صلى الله عليه وسلم خالصا وكان رسول الله صلى الله عليه وسلم يعزل نفقة أهله سنة ثم يجعل ما بقي في الكراع والسلاح عدة في سبيل الله ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وروى سفيان بن عيينة هذا الحديث عن معمر عن ابن شهاب ‏.‏",
      "text_en": " Narrated 'Umar bin Al-Khattab:                     \"The wealth of Banu An-Nadir was among the spoils of war which Allah granted upon His Messenger (ﷺ) which the Muslims did not gain with the rush of their horses nor camel. So it was purely for the Messenger of Allah (ﷺ), and the Messenger of Allah (ﷺ) would set aside a year's worth of expenditure for his family, then he would use what remained of it for horses and weapons to be used in Allah's cause.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. Sufyan bin 'Uyainah reported this Hadith from Ma'mar, from Ibn Shihab.",
      "chain": [
        "30421",
        "20005",
        "11081",
        "11013",
        "5030",
        "3"
      ]
    },
    {
      "hadith_no": "4140",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Distribution of Al-Fay' - كتاب قسم الفىء",
      "chapter_no": "38",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا سفيان، عن عمرو، - يعني ابن دينار - عن الزهري، عن مالك بن أوس بن الحدثان، عن عمر، قال كانت أموال بني النضير مما أفاء الله على رسوله مما لم يوجف المسلمون عليه بخيل ولا ركاب فكان ينفق على نفسه منها قوت سنة وما بقي جعله في الكراع والسلاح عدة في سبيل الله ‏.‏",
      "text_en": " It was narrated that 'Umar said:                     \"The wealth of Banu An-Nadir was among the Fay' that Allah bestowed upon His Messenger, in cases where the Muslims did not go out on and expedition with horses and camels. From it he kept for himself food for one year, and what was left he spent on cavalry and weapons equipment for the cause of Allah.\"",
      "chain": [
        "30359",
        "20005",
        "11081",
        "11013",
        "5030",
        "3"
      ]
    },
    {
      "hadith_no": "4148",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Distribution of Al-Fay' - كتاب قسم الفىء",
      "chapter_no": "38",
      "text_ar": "أخبرنا علي بن حجر، قال حدثنا إسماعيل، - يعني ابن إبراهيم - عن أيوب، عن عكرمة بن خالد، عن مالك بن أوس بن الحدثان، قال جاء العباس وعلي إلى عمر يختصمان فقال العباس اقض بيني وبين هذا ‏.‏ فقال الناس افصل بينهما ‏.‏ فقال عمر لا أفصل بينهما قد علما أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا نورث ما تركنا صدقة ‏\"‏ ‏.‏ قال فقال الزهري وليها رسول الله صلى الله عليه وسلم فأخذ منها قوت أهله وجعل سائره سبيله سبيل المال ثم وليها أبو بكر بعده ثم وليتها بعد أبي بكر فصنعت فيها الذي كان يصنع ثم أتياني فسألاني أن أدفعها إليهما على أن يلياها بالذي وليها به رسول الله صلى الله عليه وسلم والذي وليها به أبو بكر والذي وليتها به فدفعتها إليهما وأخذت على ذلك عهودهما ثم أتياني يقول هذا اقسم لي بنصيبي من ابن أخي ‏.‏ ويقول هذا اقسم لي بنصيبي من امرأتي ‏.‏ وإن شاءا أن أدفعها إليهما على أن يلياها بالذي وليها به رسول الله صلى الله عليه وسلم والذي وليها به أبو بكر والذي وليتها به دفعتها إليهما وإن أبيا كفيا ذلك ثم قال ‏{‏ واعلموا أنما غنمتم من شىء فأن لله خمسه وللرسول ولذي القربى واليتامى والمساكين وابن السبيل ‏}‏ هذا لهؤلاء ‏{‏ إنما الصدقات للفقراء والمساكين والعاملين عليها والمؤلفة قلوبهم وفي الرقاب والغارمين وفي سبيل الله ‏}‏ هذه لهؤلاء ‏{‏ وما أفاء الله على رسوله منهم فما أوجفتم عليه من خيل ولا ركاب ‏}‏ قال الزهري هذه لرسول الله صلى الله عليه وسلم خاصة قرى عربية فدك كذا وكذا ‏{‏ ما أفاء الله على رسوله من أهل القرى فلله وللرسول ولذي القربى واليتامى والمساكين وابن السبيل ‏}‏ و ‏{‏ للفقراء المهاجرين الذين أخرجوا من ديارهم وأموالهم ‏}‏ ‏{‏ والذين تبوءوا الدار والإيمان من قبلهم ‏}‏ ‏{‏ والذين جاءوا من بعدهم ‏}‏ فاستوعبت هذه الآية الناس فلم يبق أحد من المسلمين إلا له في هذا المال حق - أو قال حظ - إلا بعض من تملكون من أرقائكم ولئن عشت إن شاء الله ليأتين على كل مسلم حقه أو قال حظه ‏.‏",
      "text_en": " It was narrated that Malik bin Aws bin Al-Hadathan said:                     \"Al-Abbas and Ali came to 'Umar with a dispute. Al-Abbas said: 'Pass judgment between him and I.' the people said: 'Pass judgment between them.' 'Umar said: 'I will not pass judgment between them. They know that the Messenger of Allah said: We are not inherited from, what we leave behind is charity. He said: And (in this narration of it) Az-Zuhri said: 'It (the Khumus) was under the control of the Messenger of Allah , and he took provision for himself and for his family from it, and disposed to the rest of it as he disposed of other wealth (belonging to the Muslims). Then Abu Bakr took control of it, then I took control of it after Abu Bakr, and I did with it what he sued to do. Then these two came to me and asked me to give it to them so that they could dispose of it as the Messenger of Allah disposed of it, and as Abu Bakr disposed of it, and as I disposed of it. So I gave it to them and I took promises from them that they would take proper care of it. Then they came to me and this one said. Give me my share from my brothers son: and this one said: Give me my share from my wife. If they want me to give it to them on the condition that they would dispose of it in the same manner as the Messenger of Allah did, and as Abu Bakr did, and as I did, I would give it to them, but if they refuse, then they do not have to worry about it.' Then he said: 'And know that whatever of spoils of war that you may gain, verily, one-fifth of it is assigned to Allah, and to the Messenger, and to the near relatives (of the Messenger (Muhammad), (and also) the orphans, Al-Masakin (the poor) and the wayfarer' (Al-Anfal 8:41) this if for them. 'As-Sadaqat (here it means Zakah) are only for the Fuqara (poor), and Al-Masakin (the poor) and those employed to collect (the funds); and to attract the hearts of those who have been inclined (toward Islam); and to free the captives; and for those in debt; and for Allah's cause (I.e. for Mujahidun - those fighting in a holy battle)' - this is for them. 'And what Allah gave as booty (Fay') to His Messenger (Muhammad) from them - for this you made no expeditin with either cavalry or camels.' Az-Zuhri said: This applies exclusively to the Messenger of Allah and refers to an 'Arab village called Fadak, and so on. What Allah gave as booty (Fay') to His Messenger (Muhammad) from the people of the townships - it is for Allah, His Messenger (Muhammad), the kindred (of Messenger Muhammad), the orphans, Al-Masakin (the poor), and the wayfarer (And there is also a share in this booty) for the poor emigrants, who were expelled from their homes and their property And (it is also for) those who, before them, had homes (in Al-Madinah) and had adopted the Faith And those who came after them. These is no one left among the Muslims but he has some rights to this wealth, except for some of the slaved whom you own. If I live, if Allah wills, I will give every Muslim his right.\" Or he said: \"His share.\"",
      "chain": [
        "20387",
        "20208",
        "11015",
        "11709",
        "5030"
      ]
    },
    {
      "hadith_no": "4558",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال حدثنا سفيان، عن الزهري، عن مالك بن أوس بن الحدثان، أنه سمع عمر بن الخطاب، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ الذهب بالورق ربا إلا هاء وهاء والتمر بالتمر ربا إلا هاء وهاء والبر بالبر ربا إلا هاء وهاء والشعير بالشعير ربا إلا هاء و هاء ‏\"‏ ‏.‏",
      "text_en": " Umar bin Al-Khattab said:                     \"The Messenger of Allah said: '(Exchanging) gold for silver is Riba unless it is done on the spot. (Exchanging) dates for dates is Riba unless it is done on the spot. (Exchanging) wheat for wheat is Riba unless it is done on the spot. (Exchanging) barley is Riba unless it is done on the spot.\"'",
      "chain": [
        "30123",
        "20012",
        "11013",
        "5030",
        "3"
      ]
    },
    {
      "hadith_no": "2338",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعلي بن محمد، وهشام بن عمار، ونصر بن علي، ومحمد بن الصباح، قالوا حدثنا سفيان بن عيينة، عن الزهري، عن مالك بن أوس بن الحدثان النصري، قال سمعت عمر بن الخطاب، يقول قال رسول الله  صلى الله عليه وسلم  ‏\"‏ الذهب بالذهب ربا إلا هاء وهاء والبر بالبر ربا إلا هاء وهاء والشعير بالشعير ربا إلا هاء وهاء والتمر بالتمر ربا إلا هاء وهاء ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Malik bin Aws bin Hadathan Nasri said:                     \"I heard 'Umar bin Al-Khattab say: 'The Messenger of Allah (ﷺ) said: \"Exchanging gold for gold is usury  unless it is done on the spot. (Exchanging) wheat for wheat is usury, unless it is done on the spot. (Exchanging) barley for barley is usury unless it is done on the spot. (Exchanging) dates for dates is usury, unless it is done on the spot.\"",
      "chain": [
        "30201",
        "38409",
        "30288",
        "30395",
        "30269",
        "20005",
        "11013",
        "5030",
        "3"
      ]
    },
    {
      "hadith_no": "2344",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا سفيان بن عيينة، عن الزهري، سمع مالك بن أوس بن الحدثان، يقول سمعت عمر، يقول قال رسول الله  صلى الله عليه وسلم  ‏\"‏ الذهب بالورق ربا إلا هاء وهاء ‏\"‏ ‏.‏ قال أبو بكر بن أبي شيبة سمعت سفيان يقول الذهب بالورق احفظوا ‏.‏",
      "text_en": " It was narrated that Zuhri heard Malik bin Aws bin Hadathan say:                     \"I heard 'Umar say: \"The Messenger of Allah (ﷺ), said: 'Gold for silver is usury, unless it is exchanged on the spot.\"' (Sahih) Abu Bakr bin Abu-Shaibah said: \"I heard sufyan saying: 'Gold for silver.\" memorize (this).",
      "chain": [
        "30201",
        "20005",
        "11013",
        "5030",
        "3"
      ]
    },
    {
      "hadith_no": "2345",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا محمد بن رمح، أنبأنا الليث بن سعد، عن ابن شهاب، عن مالك بن أوس بن الحدثان، قال أقبلت أقول من يصطرف الدراهم فقال طلحة بن عبيد الله وهو عند عمر بن الخطاب أرنا ذهبك ثم ائتنا إذا جاء خازننا نعطك ورقك ‏.‏ فقال عمر كلا والله لتعطينه ورقه أو لتردن إليه ذهبه فإن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ الورق بالذهب ربا إلا هاء وهاء ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Malik bin Aws bin Hadathan said:                     \"I came saying. 'Who will exchange Dirham?' Talhah bin 'Ubaidullah, who was with 'Umar bin Khattab, said: 'Show us your gold, then come to us; when our treasure comes, we will give you your silver.' 'Umar said: 'No, by Allah, you will give him silver (now), or give him back his gold, for the Messenger of Allah (ﷺ) said: \"Silver for gold is usury, unless it is exchanged on the spot.\"'",
      "chain": [
        "30490",
        "20023",
        "11013",
        "5030"
      ]
    }
  ],
  "total_hadiths": 22
}