{
  "id": "5048",
  "name": "Saba' bin Thabit ( سباع بن ثابت حليف بني زهرة ( رضي الله عنه",
  "full_name": "Saba' bin Thabit ( سباع بن ثابت حليف بني زهرة  ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator [ 4  -  صحابة ]"
    ],
    "tags": [
      "Ally B.Zuhrah"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "students": [],
  "hadiths": [
    {
      "id": "sunan-abi-daud-2835",
      "hadith_no": "2835",
      "source": "Sunan Abi Da'ud",
      "chapter": "Sacrifice (Kitab Al-Dahaya) - كتاب الضحايا",
      "chapter_no": "16",
      "text_ar": "حدثنا مسدد، حدثنا سفيان، عن عبيد الله بن أبي يزيد، عن أبيه، عن سباع بن ثابت، عن أم كرز، قالت سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ أقروا الطير على مكناتها ‏\"‏ ‏.‏ قالت وسمعته يقول ‏\"‏ عن الغلام شاتان وعن الجارية شاة لا يضركم أذكرانا كن أم إناثا ‏\"‏ ‏.‏",
      "text_en": " Narrated Umm Kurz:                     I heard the Prophet (nay peace be upon him) say: Let the birds stay in their roosts. She said: I also heard him say: Two sheep are to be sacrificed for a boy and one for a girl, but it does you no harm whether they are male or female.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20012",
        "11258",
        "13153",
        "5048"
      ]
    },
    {
      "id": "sunan-abi-daud-2836",
      "hadith_no": "2836",
      "source": "Sunan Abi Da'ud",
      "chapter": "Sacrifice (Kitab Al-Dahaya) - كتاب الضحايا",
      "chapter_no": "16",
      "text_ar": "حدثنا مسدد، حدثنا حماد بن زيد، عن عبيد الله بن أبي يزيد، عن سباع بن ثابت، عن أم كرز، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ عن الغلام شاتان مثلان وعن الجارية شاة ‏\"‏ ‏.‏ قال أبو داود هذا هو الحديث وحديث سفيان وهم ‏.‏",
      "text_en": " Narrated Umm Kurz:                     The Messenger of Allah (ﷺ) said: Two sheep which resemble each other are to be sacrificed for a boy and one for a girl.Abu Dawud said: This is a sound tradition, and the tradition narrated by Sufyan is misunderstanding.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20022",
        "11258",
        "5048"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1516",
      "hadith_no": "1516",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Sacrifices - كتاب الأضاحى عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "19",
      "text_ar": "حدثنا الحسن بن علي الخلال، حدثنا عبد الرزاق، عن ابن جريج، أخبرنا عبيد الله بن أبي يزيد، عن سباع بن ثابت، أن محمد بن ثابت بن سباع، أخبره أن أم كرز أخبرته أنها، سألت رسول الله صلى الله عليه وسلم عن العقيقة فقال ‏\"‏ عن الغلام شاتان وعن الجارية واحدة ولا يضركم ذكرانا كن أم إناثا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Umm Kurz:                     That she asked the Messenger of Allah (ﷺ) about the 'Aqiqah. He said: \"For the boy is two sheep, and for the girl is one, it will not harm you if they (i.e. the sheep) are male or female.\"",
      "usc_msa_ref": "",
      "chain": [
        "30115",
        "20121",
        "11070",
        "11258",
        "5048",
        "18895"
      ]
    },
    {
      "id": "sunan-an-nasai-4217",
      "hadith_no": "4217",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of al-'Aqiqah - كتاب العقيقة",
      "chapter_no": "40",
      "text_ar": "أخبرنا قتيبة، قال حدثنا سفيان، عن عبيد الله، - وهو ابن أبي يزيد - عن سباع بن ثابت، عن أم كرز، قالت أتيت النبي صلى الله عليه وسلم بالحديبية أسأله عن لحوم الهدى فسمعته يقول ‏\"‏ على الغلام شاتان وعلى الجارية شاة لا يضركم ذكرانا كن أم إناثا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that umm Kurz said:                     \"I came to the Prophet and asked him about the sacrificial meat. I heard him say: 'For a boy, two sheep, and for a girl, one sheep, and it does not matter if they are male or female.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20005",
        "11258",
        "5048"
      ]
    },
    {
      "id": "sunan-an-nasai-4218",
      "hadith_no": "4218",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of al-'Aqiqah - كتاب العقيقة",
      "chapter_no": "40",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا يحيى، قال حدثنا ابن جريج، قال حدثني عبيد الله بن أبي يزيد، عن سباع بن ثابت، عن أم كرز، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ عن الغلام شاتان وعن الجارية شاة لا يضركم ذكرانا كن أم إناثا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Umma Kurz that the Messenger of Allah said:                     \"For a boy, two sheep, and or a girl, one sheep, and it does not matter if they are male or female",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20031",
        "11070",
        "11258",
        "5048"
      ]
    },
    {
      "id": "sunan-ibn-majah-3282",
      "hadith_no": "3282",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Slaughtering - كتاب الذبائح",
      "chapter_no": "27",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وهشام بن عمار، قالا حدثنا سفيان بن عيينة، عن عبيد الله بن أبي يزيد، عن أبيه، عن سباع بن ثابت، عن أم كرز، قالت سمعت النبي  صلى الله عليه وسلم  يقول ‏\"‏ عن الغلام، شاتان مكافئتان وعن الجارية، شاة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Umm Kurz said:                      “I heard the Prophet (ﷺ) say:‘Onbehalf of a boy, two sheep of equal age and on behalf of a girlonesheep.’”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30288",
        "20005",
        "11258",
        "13153",
        "5048"
      ]
    },
    {
      "id": "sunan-ibn-majah-3896",
      "hadith_no": "3896",
      "source": "Sunan Ibn Majah",
      "chapter": "Interpretation of Dreams - كتاب تعبير الرؤيا",
      "chapter_no": "35",
      "text_ar": "حدثنا هارون بن عبد الله الحمال، حدثنا سفيان بن عيينة، عن عبيد الله بن أبي يزيد، عن أبيه، عن سباع بن ثابت، عن أم كرز الكعبية، قالت سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ ذهبت النبوة وبقيت المبشرات ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Umm Kurz Al-Ka’biyyah said:                      “I heard theMessengerof Allah (ﷺ) say: ‘Prophecy is gone, but good dreamsremain.’”",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20005",
        "11258",
        "13153",
        "5048",
        "3182"
      ]
    }
  ],
  "total_hadiths": 7
}