{
  "id": "5066",
  "name": "Sufyan bin 'Abdullah bin Rabi'a ( سفيان بن عبد الله بن ربيعة ( رضي الله عنه",
  "full_name": "Sufyan bin 'Abdullah bin Rabi'a ( سفيان بن عبد الله بن ربيعة ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Ta'if"
    ],
    "area_of_interest": [
      "Narrator [ م  ت  س  ق  -  صحابي ]"
    ],
    "tags": [
      "al-Thaqifi",
      "al-Ta'ifi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "18795",
      "name": "'Amr bin Sufyan bin 'Abdullah bin Rabi'a عمرو بن سفيان بن عبد الله بن ربيعة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "18738",
      "name": "'Atiyya bin Sufyan bin 'Abdullah عطية بن سفيان بن عبد الله بن ربيعة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19915",
      "name": "'Asim bin Sufyan bin 'Abdullah b. Rabi'a عاصم بن سفيان بن عبد الله الثقفي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "18519",
      "name": "'Abdullah bin Sufyan bin 'Abdullah عبد الله بن سفيان بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "168",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا ابن نمير، ح وحدثنا قتيبة بن سعيد، وإسحاق بن إبراهيم، جميعا عن جرير، ح وحدثنا أبو كريب، حدثنا أبو أسامة، كلهم عن هشام بن عروة، عن أبيه، عن سفيان بن عبد الله الثقفي، قال قلت يا رسول الله قل لي في الإسلام قولا لا أسأل عنه أحدا بعدك - وفي حديث أبي أسامة غيرك - قال ‏\"‏ قل آمنت بالله فاستقم ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Sufyan b. 'Abdulla al-Thaqafi that he said:                      I asked the Messenger of Allah to tell me about Islam a thing which might dispense with the necessity of my asking anybody after you. In the hadith of Abu Usama the (words) are: other than you. He (the Holy Prophet) remarked: Say I affirm my faith in Allah and then remain steadfast to it.",
      "chain": [
        "30201",
        "30216",
        "30212",
        "30367",
        "30123",
        "4057",
        "30216",
        "11065",
        "10511",
        "5066"
      ]
    },
    {
      "hadith_no": "1601",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا أحمد بن عبدة الضبي، حدثنا المغيرة، - ونسبه إلى عبد الرحمن بن الحارث المخزومي - قال حدثني أبي، عن عمرو بن شعيب، عن أبيه، عن جده، أن شبابة، - بطن من فهم - فذكر نحوه قال من كل عشر قرب قربة وقال سفيان بن عبد الله الثقفي قال وكان يحمي لهم واديين زاد فأدوا إليه ما كانوا يؤدون إلى رسول الله صلى الله عليه وسلم وحمى لهم وادييهم ‏.‏",
      "text_en": " 'Amr bin Shu'aib, on his father's authority, said that his grandfather reported:                      That was Banu Shababah, a sub-clan of the tribe Fahm. The narrator then transmitted the tradition something similar. He added:(They used to pay) one bag (of honey) out of ten bags. Sufyan ibn Abdullah ath-Thaqafi gave them two woods as protected lands. They used to give as much honey (as zakat) as they gave to the Messenger of Allah (ﷺ). He (Sufyan) used to protect their woods.",
      "chain": [
        "30423",
        "19934",
        "19911",
        "5066"
      ]
    },
    {
      "hadith_no": "2410",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا سويد بن نصر، أخبرنا عبد الله بن المبارك، عن معمر، عن الزهري، عن عبد الرحمن بن ماعز، عن سفيان بن عبد الله الثقفي، قال قلت يا رسول الله حدثني بأمر أعتصم به ‏.‏ قال ‏\"‏ قل ربي الله ثم استقم ‏\"‏ ‏.‏ قلت يا رسول الله ما أخوف ما تخاف على فأخذ بلسان نفسه ثم قال ‏\"‏ هذا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح وقد روي من غير وجه عن سفيان بن عبد الله الثقفي ‏.‏",
      "text_en": " Sufyan bin 'Abdullah Ath-Thaqafi said:                      I said: \"O Messenger of Allah! Inform me about a matter that I may hold fast to.\" He said:'Say: My Lord is Allah, then be steadfast.' I said: \"O Messenger of Allah! What do you fear most for me?\" So he took hold of his tongue and said: 'This.'\"",
      "chain": [
        "38265",
        "20025",
        "20115",
        "11013",
        "5066"
      ]
    },
    {
      "hadith_no": "4107",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا أبو مروان، محمد بن عثمان العثماني حدثنا إبراهيم بن سعد، عن ابن شهاب، عن محمد بن عبد الرحمن بن ماعز العامري، أن سفيان بن عبد الله الثقفي، قال قلت يا رسول الله حدثني بأمر أعتصم به ‏.‏ قال ‏\"‏ قل ربي الله ثم استقم ‏\"‏ ‏.‏ قلت يا رسول الله ما أكثر ما تخاف على فأخذ رسول الله  صلى الله عليه وسلم  بلسان نفسه ثم قال ‏\"‏ هذا ‏\"‏ ‏.‏",
      "text_en": " Sufyan bin ‘Abdullah Thaqafi said:                      “I said: ‘O Messenger ofAllah,tell me of something that I can adhere to.’ He said: ‘Say:“Allah ismy Lord,” then stand straight (adhere steadfastly toIslam).’ He said:‘O Messenger of Allah, what is the thing thatyou fear most for me?’The Messenger of Allah (ﷺ) took hold ofhis own tongue, then hesaid: ‘This.’”",
      "chain": [
        "32032",
        "20150",
        "11013",
        "5066"
      ]
    }
  ],
  "total_hadiths": 4
}