{
  "id": "5077",
  "name": "Sulaiman bin Ms'hr al-Fzary ( سليمان بن مسهر الفزاري الكوفي ( رضي الله عنه",
  "full_name": "Sulaiman bin Ms'hr al-Fzary ( سليمان بن مسهر الفزاري الكوفي ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator [ م  د  س  -  صحابة ]"
    ],
    "tags": [
      "al-Fazari",
      "al-Kufa"
    ],
    "area_of_interest_display": [
      {
        "en": "Narrator [ م  د  س  -  صحابة ]",
        "ar": "Narrator [ م  د  س  -  صحابة ]",
        "ckb": "Narrator [ م  د  س  -  صحابة ]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "Kufa",
        "ar": "الكوفة",
        "ckb": "كوفە"
      }
    ],
    "tags_display": [
      {
        "en": "al-Fazari",
        "ar": "al-Fazari",
        "ckb": "al-Fazari"
      },
      {
        "en": "al-Kufa",
        "ar": "al-Kufa",
        "ckb": "al-Kufa"
      }
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah",
      "grade_display": {
        "en": "Messenger of Allah",
        "ar": "رسول الله",
        "ckb": "پێغەمبەری خودا"
      }
    },
    {
      "id": "4026",
      "name": "Kharsha bin al-Hurr al-Fazari ( خرشة بن الحر الفزاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    }
  ],
  "students": [
    {
      "id": "11051",
      "name": "Ibrahim al-Nakha'i إبراهيم النخعي",
      "grade": "Follower(Tabi') [3rd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [3rd Generation]",
        "ar": "تابعي [الجيل الثالث]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
      }
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [5th Generation]",
        "ar": "تابعي [الجيل الخامس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی پێنجەم]"
      }
    }
  ],
  "hadiths": [
    {
      "id": "sahih-muslim-307",
      "hadith_no": "307",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني أبو بكر بن خلاد الباهلي، حدثنا يحيى، - وهو القطان - حدثنا سفيان، حدثنا سليمان الأعمش، عن سليمان بن مسهر، عن خرشة بن الحر، عن أبي ذر، عن النبي صلى الله عليه وسلم قال ‏\"‏ ثلاثة لا يكلمهم الله يوم القيامة المنان الذي لا يعطي شيئا إلا منه والمنفق سلعته بالحلف الفاجر والمسبل إزاره ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Dharr who narrates that the Prophet (may peace be upon him) observed:                      Three are the persons with whom Allah would not speak on the Day of Resurrection: the bestower of gift who does not give anything but by laying obligation on him, the seller of goods who sells them by taking false oath and one who hangs low his lower garment.",
      "usc_msa_ref": "",
      "chain": [
        "30357",
        "20031",
        "20012",
        "11060",
        "5077",
        "4026",
        "23"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-6538",
      "hadith_no": "6538",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا قتيبة بن سعيد، وإسحاق بن إبراهيم، - واللفظ لقتيبة - حدثنا جرير، عن الأعمش، عن سليمان بن مسهر، عن خرشة بن الحر، قال كنت جالسا في حلقة في مسجد المدينة - قال - وفيها شيخ حسن الهيئة وهو عبد الله بن سلام - قال - فجعل يحدثهم حديثا حسنا - قال - فلما قام قال القوم من سره أن ينظر إلى رجل من أهل الجنة فلينظر إلى هذا ‏.‏ قال فقلت والله لأتبعنه فلأعلمن مكان بيته ‏.‏ قال فتبعته فانطلق حتى كاد أن يخرج من المدينة ثم دخل منزله - قال - فاستأذنت عليه فأذن لي فقال ما حاجتك يا ابن أخي قال فقلت له سمعت القوم يقولون لك لما قمت من سره أن ينظر إلى رجل من أهل الجنة فلينظر إلى هذا ‏.‏ فأعجبني أن أكون معك قال الله أعلم بأهل الجنة وسأحدثك مم قالوا ذاك إني بينما أنا نائم إذ أتاني رجل فقال لي قم ‏.‏ فأخذ بيدي فانطلقت معه - قال - فإذا أنا بجواد عن شمالي - قال - فأخذت لآخذ فيها فقال لي لا تأخذ فيها فإنها طرق أصحاب الشمال - قال - فإذا جواد منهج على يميني فقال لي خذ ها هنا ‏.‏ فأتى بي جبلا فقال لي اصعد - قال - فجعلت إذا أردت أن أصعد خررت على استي - قال - حتى فعلت ذلك مرارا - قال - ثم انطلق بي حتى أتى بي عمودا رأسه في السماء وأسفله في الأرض في أعلاه حلقة فقال لي ‏.‏ اصعد فوق هذا ‏.‏ قال قلت كيف أصعد هذا ورأسه في السماء - قال - فأخذ بيدي فزجل بي - قال - فإذا أنا متعلق بالحلقة - قال - ثم ضرب العمود فخر - قال - وبقيت متعلقا بالحلقة حتى أصبحت - قال - فأتيت النبي صلى الله عليه وسلم فقصصتها عليه فقال ‏\"‏ أما الطرق التي رأيت عن يسارك فهي طرق أصحاب الشمال - قال - وأما الطرق التي رأيت عن يمينك فهي طرق أصحاب اليمين وأما الجبل فهو منزل الشهداء ولن تناله وأما العمود فهو عمود الإسلام وأما العروة فهي عروة الإسلام ولن تزال متمسكا بها حتى تموت ‏\"‏ ‏.‏",
      "text_en": " Kharasha b. Hurr reported:                      I was sitting in a circle in the mosque of Medina and there was an old man, quite handsome. He was 'Abdullah b. Salim. He was telling good things to them (to the people sitting in that company). As he stood up (to depart) the people said: He who is desirous of looking at a person from amongst the people of Paradise should see him. I said: By Allah, I will follow him, and would try to know his residence. So I followed him and he walked on until he reached the outskirts of Medina. He then entered his house. I sought permission from him to get in, and he granted me the permission, saying: My nephew, what is the need (that has brought you here)? I said to him: As you stood up, I heard people say about you: He who is desirous of seeing a person from among the people of Paradise should look at him. So I became desirous of accompanying you. He ('Abdullah b. Salim) said: It is Allah Who knows best about the people of Paradise. I would, however, narrate to you as to why they said like it. (The story is) that while I was asleep (one night) there came to me a person (in the dream) who asked me to stand up. (So I stood up) and he caught hold of my hand and I walked along with him, and, lo, I found some paths on my left and I was about to set out upon them. Thereupon he said to me Do not set yourself on (them) for these are the paths of the leftists (denizens of Hell-fire). Then there were paths leading to the right side, whereupon he said: Set yourself on these paths. We came across a hill and he said to me: Climb up, and I attempted to climb up that I fell upon my buttocks. I made several attempts (but failed to succeed). He led until he came to a pillar (so high) that its upper end touched the sky and its base was in the earth. And there was a handhold at its upper end. He said to me Climb over it. I said: How can I climb upon it, as its upper end touches the sky? He cought hold of my hand and pushed me up and I found myself suspended with the handhold. He then struck the pillar and it fell down, but I remained attached to that handhold until it was morning (and the dream was thus over). I came to Allah's Apostle (may peace be upon him) and narrated it to him. He said: So far as the paths which you saw on your left are concerned, these are paths of the leftists (denizens of Hell) and the paths which you saw on your right, these are the paths of the rightists (the dwellers of Paradise) and the mountain represents the destination of the martyrs which you would not be able to attain. The pillar implies the pillar of Islam. and so far as the handhold is concerned, it implies the handhold of Islam, and you would hold to it fastly until you would meet death.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "30123",
        "20028",
        "11060",
        "5077",
        "4026"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sunan-abi-daud-4088",
      "hadith_no": "4088",
      "source": "Sunan Abi Da'ud",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن سفيان، عن الأعمش، عن سليمان بن مسهر، عن خرشة بن الحر، عن أبي ذر، عن النبي صلى الله عليه وسلم بهذا والأول أتم قال ‏\"‏ المنان الذي لا يعطي شيئا إلا منه ‏\"‏ ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Abu Dharr though a different chain of narrators, but the former is more perfect. This version has:                      Mannan is the one takes account of anything he gives.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20031",
        "20012",
        "11060",
        "5077",
        "4026",
        "23"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-an-nasai-2564",
      "hadith_no": "2564",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا بشر بن خالد، قال حدثنا غندر، عن شعبة، قال سمعت سليمان، - وهو الأعمش - عن سليمان بن مسهر، عن خرشة بن الحر، عن أبي ذر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ثلاثة لا يكلمهم الله عز وجل يوم القيامة ولا ينظر إليهم ولا يزكيهم ولهم عذاب أليم المنان بما أعطى والمسبل إزاره والمنفق سلعته بالحلف الكاذب ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Dharr said:                     \"The Messenger of Allah said: \"There are three to whom of Allah will not speak on the Day of Resurrection or look at them or purify them, and theirs will be a painful torment: the one who reminds people of what he has given them, the one who lets his garment hang beneath his ankles, and a vendor who tries to sell his product by means of false oaths.\"",
      "usc_msa_ref": "",
      "chain": [
        "30126",
        "20278",
        "20020",
        "11060",
        "5077",
        "4026",
        "23"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-4459",
      "hadith_no": "4459",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا يحيى، قال حدثنا سفيان، قال حدثني سليمان الأعمش، عن سليمان بن مسهر، عن خرشة بن الحر، عن أبي ذر، عن النبي صلى الله عليه وسلم قال ‏\"‏ ثلاثة لا ينظر الله إليهم يوم القيامة ولا يزكيهم ولهم عذاب أليم الذي لا يعطي شيئا إلا منه والمسبل إزاره والمنفق سلعته بالكذب ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Dharr that the Prophet said:                     \"There are three at whom Allah will not look on the Day of Resurrection, or will He sanctify them, and theirs will be a painful torment: the one ho does not give anything but he reminds (the recipient of his gift), the on who drags his Izar (below the ankles), and the one who sells his product by means of false oaths,\" (Sahih )",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20031",
        "20012",
        "11060",
        "5077",
        "4026",
        "23"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-5333",
      "hadith_no": "5333",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا بشر بن خالد، قال حدثنا غندر، عن شعبة، قال سمعت سليمان بن مهران الأعمش، عن سليمان بن مسهر، عن خرشة بن الحر، عن أبي ذر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ثلاثة لا يكلمهم الله عز وجل يوم القيامة ولا يزكيهم ولهم عذاب أليم المنان بما أعطى والمسبل إزاره والمنفق سلعته بالحلف الكاذب ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Dharr said:                     \"The Messenger of Allah [SAW] said: 'There are three to whom Allah (the Mighty and Sublime) will not speak on the Day of Resurrection, nor will He sanctify them, and theirs will be a painful torment: The one who reminds others of what he has given them (Al-Mannan), the one who lets his Izar come below his ankles, and the one who sells his product by means of false oaths.\"",
      "usc_msa_ref": "",
      "chain": [
        "30126",
        "20278",
        "20020",
        "5077",
        "4026",
        "23"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    }
  ],
  "total_hadiths": 6,
  "grade_display": {
    "en": "Companion (RA) [1st Generation]",
    "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
    "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
  }
}