{
  "id": "5098",
  "name": "Tariq bin Ashaym al-Ashja'i ( طارق بن أشيم بن مسعود الأشجعي ( رضي الله عنه",
  "full_name": "Tariq bin Ashaym al-Ashja'i ( طارق بن أشيم بن مسعود الأشجعي ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Hijaz",
      " Kufa"
    ],
    "area_of_interest": [
      "Narrator [ بخ  م  ت  س  ق  -  صحابي ]"
    ],
    "tags": [
      "al-Ashja'i"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "10766",
      "name": "Sa'd bin Tariq, Abu Malik سعد بن طارق بن أشيم أبو مالك الأشجعي",
      "grade": "Follower(Tabi')"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "2",
      "name": "Abu Bakr Al-Siddique ( أبو بكر الصديق ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3",
      "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4",
      "name": "'Uthman ibn 'Affaan ( عثمان بن عفان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5",
      "name": "Ali ibn Abi Talib ( علي بن أبي طالب بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "10766",
      "name": "Sa'd bin Tariq, Abu Malik سعد بن طارق بن أشيم أبو مالك الأشجعي",
      "grade": "Follower(Tabi')"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "139",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا سويد بن سعيد، وابن أبي عمر، قالا حدثنا مروان، - يعنيان الفزاري - عن أبي مالك، عن أبيه، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من قال لا إله إلا الله وكفر بما يعبد من دون الله حرم ماله ودمه وحسابه على الله ‏\"‏ ‏.‏",
      "text_en": " It Is narrated on the authority of Abu Malik:                      I heard the Messenger of Allah (may peace be upon him) say: He who professed that there is no god but Allah and made a denial of everything which the people worship beside Allah, his property and blood became inviolable, an their affairs rest with Allah.",
      "chain": [
        "30547",
        "30421",
        "20201",
        "10766",
        "5098"
      ]
    },
    {
      "hadith_no": "140",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو خالد الأحمر، ح وحدثنيه زهير بن حرب، حدثنا يزيد بن هارون، كلاهما عن أبي مالك، عن أبيه، أنه سمع النبي صلى الله عليه وسلم يقول ‏\"‏ من وحد الله ‏\"‏ ثم ذكر بمثله ‏.‏",
      "text_en": " Abu Malik narrated on the authority of his father that he heard the Apostle (may peace be upon him) say:                      He who held belief in the unity of Allah, and then narrated what has been stated above.",
      "chain": [
        "30201",
        "20326",
        "20472",
        "10766",
        "5098"
      ]
    },
    {
      "hadith_no": "7024",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا أبو كامل الجحدري، حدثنا عبد الواحد، - يعني ابن زياد - حدثنا أبو مالك الأشجعي عن أبيه، قال كان رسول الله صلى الله عليه وسلم يعلم من أسلم يقول ‏\"‏ اللهم اغفر لي وارحمني واهدني وارزقني ‏\"‏ ‏.‏",
      "text_en": " Abu Malik Ashaja'i reported on the authority of his father that whenever a person embraced Islam, Allah's Messenger (may peace be upon him) instructed him to recilte:                     \" O Allah, grant me pardon, have mercy upon me, direct me to the path of righteousness and provide me sustenance.\"",
      "chain": [
        "30559",
        "20256",
        "10766",
        "5098"
      ]
    },
    {
      "hadith_no": "7025",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا سعيد بن أزهر الواسطي، حدثنا أبو معاوية، حدثنا أبو مالك الأشجعي، عن أبيه، قال كان الرجل إذا أسلم علمه النبي صلى الله عليه وسلم الصلاة ثم أمره أن يدعو بهؤلاء الكلمات ‏\"‏ اللهم اغفر لي وارحمني واهدني وعافني وارزقني ‏\"‏ ‏.‏",
      "text_en": " Abu Malik reported on the authority of his father that when a person embraced Islam, Allah's Messenger (may peace be upon him) used to teach him how to observe prayer and then commanded him to supplicate in these words:                     \" O Allah, grant me pardon, have mercy upon me, direct me to the path of righteousness, grant me protection and provide me sustenance.\"",
      "chain": [
        "20354",
        "10766",
        "5098"
      ]
    },
    {
      "hadith_no": "1080",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا قتيبة، عن خلف، - وهو ابن خليفة - عن أبي مالك الأشجعي، عن أبيه، قال صليت خلف رسول الله صلى الله عليه وسلم فلم يقنت وصليت خلف أبي بكر فلم يقنت وصليت خلف عمر فلم يقنت وصليت خلف عثمان فلم يقنت وصليت خلف علي فلم يقنت ثم قال يا بنى إنها بدعة ‏.‏",
      "text_en": " It was narrated from Abu Malik Al-Ashja'i that his father said:                     \"I prayed behind the Messenger of Allah (ﷺ) and he did not say the Qunut, and I prayed behind Abu Bakr and he did not say the Qunut, and I prayed behind Umar and he did not say the Qunut, and I prayed behind Uthman and he did not say the Qunut, and I prayed behind Ali and he did not say the Qunut.\" Then he said: \"O my son, this is an innovation.\"",
      "chain": [
        "30367",
        "20584",
        "10766",
        "5098"
      ]
    }
  ],
  "total_hadiths": 5
}