{
  "id": "5105",
  "name": "'Amir bin Shhr al-Hmdany ( عامر بن شهر الهمداني أبو الكنود ( رضي الله عنه",
  "full_name": "'Amir bin Shhr al-Hmdany ( عامر بن شهر الهمداني أبو الكنود ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Hamadan",
      "Kufa"
    ],
    "area_of_interest": [
      "Narrator [ د  -  صحابي ]"
    ],
    "tags": [
      "al-Hamdani",
      "Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "3027",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا هناد بن السري، عن أبي أسامة، عن مجالد، عن الشعبي، عن عامر بن شهر، قال خرج رسول الله صلى الله عليه وسلم فقالت لي همدان هل أنت آت هذا الرجل ومرتاد لنا فإن رضيت لنا شيئا قبلناه وإن كرهت شيئا كرهناه قلت نعم ‏.‏ فجئت حتى قدمت على رسول الله صلى الله عليه وسلم فرضيت أمره وأسلم قومي وكتب رسول الله صلى الله عليه وسلم هذا الكتاب إلى عمير ذي مران قال وبعث مالك بن مرارة الرهاوي إلى اليمن جميعا فأسلم عك ذو خيوان ‏.‏ قال فقيل لعك انطلق إلى رسول الله صلى الله عليه وسلم فخذ منه الأمان على قريتك ومالك فقدم وكتب له رسول الله صلى الله عليه وسلم ‏\"‏ بسم الله الرحمن الرحيم من محمد رسول الله لعك ذي خيوان إن كان صادقا في أرضه وماله ورقيقه فله الأمان وذمة الله وذمة محمد رسول الله ‏\"‏ ‏.‏ وكتب خالد بن سعيد بن العاص ‏.‏",
      "text_en": " Narrated Amir ibn Shahr:                     When the Messenger of Allah (ﷺ) appeared as a prophet, Hamdan said to me: Will you go to this man and negotiate for us (with him)? If you accept something, we shall accept it, and if you disapprove of something, we shall disapprove of it.  I said: Yes. So I proceeded until I came to the Messenger of Allah (ﷺ). I liked his motive and my people embraced Islam. The Messenger of Allah (ﷺ) wrote the document for Umayr Dhu Marran. He also sent Malik ibn Murarah ar-Rahawi to all the (people of) Yemen. So Akk Dhu Khaywan embraced Islam.  Akk was told: Go to the Messenger of Allah (ﷺ), and obtain his protection for your town and property. He therefore came (to him) and the Messenger of Allah (ﷺ) wrote a document for him:  \"In the name of Allah, Most Beneficent, Most Merciful. From Muhammad, the Messenger of Allah, to Akk Dhu Khaywan. If he is true his land, property and slave, he has the security and the protection of Allah, and Muhammad, the Messenger of Allah. Written by Khalid ibn Sa'id ibn al-'As.\"",
      "chain": [
        "30480",
        "20318",
        "11052",
        "5105"
      ]
    },
    {
      "hadith_no": "4736",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا إسماعيل بن عمر، أخبرنا إبراهيم بن موسى، أخبرنا ابن أبي زائدة، عن مجالد، عن عامر، - يعني الشعبي - عن عامر بن شهر، قال ‏:‏ كنت عند النجاشي فقرأ ابن له آية من الإنجيل فضحكت فقال ‏:‏ أتضحك من كلام الله",
      "text_en": " ‘Amir b. Shahr said :                      I was with the Negus when his son recited a verse of the Gospel. So I laughed. Thereupon he said : Do you laugh at the word of Allah, the Exalted?",
      "chain": [
        "38114",
        "30309",
        "20366",
        "11052",
        "5105"
      ]
    }
  ],
  "total_hadiths": 2
}