{
  "id": "5115",
  "name": "'Abdullah bin Abi Awfa ( عبد الله بن أبي أوفي ( رضي الله عنه",
  "full_name": "'Abdullah bin Abi Awfa ( عبد الله بن أبي أوفي ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "87",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Hijaz",
      " Kufa"
    ],
    "area_of_interest": [
      "Narrator [ ع  -  صحابة ]"
    ],
    "tags": [
      "al-Aslami",
      "Ridwan",
      "Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "students": [
    {
      "id": "11619",
      "name": "Ibrahim bin 'Abdur Rahman al-Saksaki إبراهيم بن عبد الرحمن السكسكي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "18010",
      "name": "Ibrahim bin Muslim al-'Abdi إبراهيم بن مسلم العبدي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11418",
      "name": "Isma'il bin Abi Khalid al-Ahmsi إسماعيل بن أبي خالد الأحمسي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11069",
      "name": "al-Hakam bin 'Utayba الحكم بن عتيبة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11164",
      "name": "Salm Abi al-Nadr سالم بن أبي أمية - أبو النضر",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11350",
      "name": "Salmah bin Kahayl al-Hadrami سلمة بن كهيل بن حصين",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11355",
      "name": "Tarq bin 'Abdur Rahman طارق بن عبد الرحمن البجلي الأحمسي الكوفي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11356",
      "name": "Talha bin Msrf bin 'Amr طلحة بن مصرف بن عمرو بن كعب",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11701",
      "name": "'Abdullah bin Abi al-Mujalad عبد الله بن أبي المجالد",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10796",
      "name": "'Ubaid bin al-Hasan al-Mzny عبيد بن الحسن المزني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11372",
      "name": "Ady bin Thabit al-Ansari عدي بن ثابت الأنصاري الكوفي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11068",
      "name": "Ata'a bin al-Sa'ib al-Thaqifi عطاء بن السائب الثقفي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11381",
      "name": "'Amr bin Murrah bin 'Abdullah عمرو بن مرة بن عبد الله بن طارق",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10811",
      "name": "al-Qasim bin Awf al-Shybany القاسم بن عوف الشيباني",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11650",
      "name": "Mjz'ah bin Zahr bin al-Aswad مجزأة بن زاهر",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10837",
      "name": "al-Walid bin Sry' الوليد بن سريع",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10726",
      "name": "Yahya bin Aqyl يحيى بن عقيل",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11352",
      "name": "Sulaiman bin Abi Sulaiman سليمان بن أبي سليمان",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "15693",
      "name": "Abu al-Mukhtar al-Asady al-Kwfy أبو المختار الأسدي الكوفي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11403",
      "name": "Waqdan Abu Ya'fur al-Abdi وقدان أبو يعفور العبدي",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1522",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن عمرو، عن عبد الله بن أبي أوفى، قال كان النبي صلى الله عليه وسلم إذا أتاه قوم بصدقتهم قال ‏\"‏ اللهم صل على آل فلان ‏\"‏‏.‏ فأتاه أبي بصدقته، فقال ‏\"‏ اللهم صل على آل أبي أوفى ‏\"‏‏.‏",
      "text_en": "      Narrated 'Abdullah bin Abu Aufa :                          Whenever a person came to the Prophet with his alms, the Prophet would     say, \"O Allah! Send your Blessings upon so and so.\" My father went to      the Prophet with his alms and the Prophet said, \"O Allah! Send your      blessings upon the offspring of Abu Aufa.\"",
      "chain": [
        "30329",
        "20020",
        "20377",
        "5115"
      ]
    },
    {
      "hadith_no": "1625",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا مسدد، حدثنا خالد بن عبد الله، حدثنا إسماعيل بن أبي خالد، عن عبد الله بن أبي أوفى، قال اعتمر رسول الله صلى الله عليه وسلم فطاف بالبيت وصلى خلف المقام ركعتين، ومعه من يستره من الناس فقال له رجل أدخل رسول الله صلى الله عليه وسلم الكعبة قال لا‏.‏",
      "text_en": " Narrated Isma'li bin Abu Khalid:                     `Abdullah bin Abu `Aufa said, \"Allah's Apostle performed the `Umra. He performed Tawaf of the Ka`ba and offered two rak`at behind the Maqam (Abraham's place) and was accompanied by those who were screening him from the people.\" Somebody asked `Abdullah, \"Did Allah's Apostle enter the Ka`ba?\" `Abdullah replied in the negative.",
      "chain": [
        "30175",
        "20423",
        "11418",
        "5115"
      ]
    },
    {
      "hadith_no": "1819",
      "source": " Sahih Bukhari ",
      "chapter": "`Umrah (Minor pilgrimage) - كتاب العمرة",
      "chapter_no": "26",
      "text_ar": "حدثنا إسحاق بن إبراهيم، عن جرير، عن إسماعيل، عن عبد الله بن أبي أوفى، قال اعتمر رسول الله صلى الله عليه وسلم واعتمرنا معه فلما دخل مكة طاف وطفنا معه، وأتى الصفا والمروة وأتيناها معه، وكنا نستره من أهل مكة أن يرميه أحد‏.‏ فقال له صاحب لي أكان دخل الكعبة قال لا‏.‏ قال فحدثنا ما، قال لخديجة‏.‏ قال ‏\"‏ بشروا خديجة ببيت في الجنة من قصب لا صخب فيه ولا نصب ‏\"‏‏.‏",
      "text_en": " Narrated Isma`il:                     `Abdullah bin Abu `Aufa said: \"Allah's Apostle performed `Umra and we too performed `Umra along with him. When he entered Mecca he performed the Tawaf (of Ka`ba) and we too performed it along with him, and then he came to the As-Safa and Al-Marwa (i.e. performed the Sai) and we also came to them along with him. We were shielding him from the people of Mecca lest they may hit him with an arrow.\" A friend of his asked him (i.e. `Abdullah bin `Aufa), \"Did the Prophet enter the Ka`ba (during that `Umra)?\" He replied in the negative. Then he said, \"What did he (the Prophet ) say about Khadija?\" He (Abdullah bin `Aufa) said, \"(He said) 'Give Khadija the good tidings that she will have a palace made of Qasab in Paradise and there will be neither noise nor any trouble in it.\"",
      "chain": [
        "30123",
        "20028",
        "11418",
        "5115"
      ]
    },
    {
      "hadith_no": "1941",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، عن أبي إسحاق الشيباني، سمع ابن أبي أوفى  رضى الله عنه  قال كنا مع رسول الله صلى الله عليه وسلم في سفر فقال لرجل ‏\"‏ انزل فاجدح لي ‏\"‏‏.‏ قال يا رسول الله الشمس‏.‏ قال ‏\"‏ انزل فاجدح لي ‏\"‏‏.‏ قال يا رسول الله الشمس‏.‏ قال ‏\"‏ انزل فاجدح لي ‏\"‏‏.‏ فنزل، فجدح له، فشرب، ثم رمى بيده ها هنا، ثم قال ‏\"‏ إذا رأيتم الليل أقبل من ها هنا فقد أفطر الصائم ‏\"‏‏.‏ تابعه جرير وأبو بكر بن عياش عن الشيباني عن ابن أبي أوفى قال كنت مع النبي صلى الله عليه وسلم في سفر‏.‏",
      "text_en": " Narrated Ibn Abi `Aufa:                     We were in the company of Allah's Apostle on a journey. He said to a man, \"Get down and mix Sawiq (powdered barley) with water for me.\" The man said, \"The sun (has not set yet), O Allah's Apostle.\" The Prophet again said to him, \"Get down and mix Sawiq with water for me.\" The man again said, \"O Allah's Apostle! The sun!\" The Prophet said to him (for the third time) \"Get down and mix Sawiq with water for me.\" The man dismounted and mixed Sawiq with water for him. The Prophet drank it and then beckoned with his hand (towards the East) and said, \"When you see the night falling from this side, then a fasting person should break his fast.\"",
      "chain": [
        "30026",
        "20005",
        "11352",
        "5115"
      ]
    },
    {
      "hadith_no": "1955",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا إسحاق الواسطي، حدثنا خالد، عن الشيباني، عن عبد الله بن أبي أوفى  رضى الله عنه  قال كنا مع رسول الله صلى الله عليه وسلم في سفر، وهو صائم، فلما غربت الشمس قال لبعض القوم ‏\"‏ يا فلان قم، فاجدح لنا ‏\"‏‏.‏ فقال يا رسول الله، لو أمسيت‏.‏ قال ‏\"‏ انزل، فاجدح لنا ‏\"‏‏.‏ قال يا رسول الله فلو أمسيت‏.‏ قال ‏\"‏ انزل، فاجدح لنا ‏\"‏‏.‏ قال إن عليك نهارا‏.‏ قال ‏\"‏ انزل، فاجدح لنا ‏\"‏‏.‏ فنزل فجدح لهم، فشرب النبي صلى الله عليه وسلم ثم قال ‏\"‏ إذا رأيتم الليل قد أقبل من ها هنا، فقد أفطر الصائم ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Abi `Aufa:                     We were in the company of the Prophet on a journey and he was fasting, and when the sun set, he addressed somebody, \"O so-and-so, get up and mix Sawiq with water for us.\" He replied, \"O Allah's Apostle! (Will you wait) till it is evening?\" The Prophet said, \"Get down and mix Sawiq with water for us.\" He replied, \"O Allah's Apostle! (If you wait) till it is evening.\" The Prophet said again, \"Get down and mix Sawiq with water for us.\" He replied, \"It is still daytime.\"(1) The Prophet said again, \"Get down and mix Sawiq with water for us.\" He got down and mixed Sawiq for them. The Prophet drank it and then said, \"When you see night falling from this side, the fasting person should break his fast.\"",
      "chain": [
        "30312",
        "20423",
        "11352",
        "5115"
      ]
    },
    {
      "hadith_no": "1956",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا مسدد، حدثنا عبد الواحد، حدثنا الشيباني، قال سمعت عبد الله بن أبي أوفى  رضى الله عنه  قال سرنا مع رسول الله صلى الله عليه وسلم وهو صائم، فلما غربت الشمس قال ‏\"‏ انزل، فاجدح لنا ‏\"‏‏.‏ قال يا رسول الله، لو أمسيت‏.‏ قال ‏\"‏ انزل، فاجدح لنا ‏\"‏‏.‏ قال يا رسول الله، إن عليك نهارا‏.‏ قال ‏\"‏ انزل، فاجدح لنا ‏\"‏‏.‏ فنزل، فجدح، ثم قال ‏\"‏ إذا رأيتم الليل أقبل من ها هنا فقد أفطر الصائم ‏\"‏‏.‏ وأشار بإصبعه قبل المشرق‏.‏",
      "text_en": " Narrated `Abdullah bin Abi `Aufa:                     We were traveling with Allah's Apostle and he was fasting, and when the sun set, he said to (someone), \"Get down and mix Sawiq with water for us.\" He replied, \"O Allah's Apostle! (Will you wait) till it is evening?\" The Prophet again said, \"Get down and mix Sawiq with water for us.\" He replied, \"O Allah's Apostle! It is still daytime.\" The Prophet said again, \"Get down and mix Sawiq with water for us.\" So, he got down and carried out that order. The Prophet then said, \"When you see night falling from this side, the fasting person should break his fast,\" and he beckoned with his finger towards the east.",
      "chain": [
        "30175",
        "20256",
        "11352",
        "5115"
      ]
    },
    {
      "hadith_no": "1958",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا أبو بكر، عن سليمان، عن ابن أبي أوفى  رضى الله عنه  قال كنت مع النبي صلى الله عليه وسلم في سفر، فصام حتى أمسى، قال لرجل ‏\"‏ انزل، فاجدح لي ‏\"‏‏.‏ قال لو انتظرت حتى تمسي‏.‏ قال ‏\"‏ انزل، فاجدح لي، إذا رأيت الليل قد أقبل من ها هنا فقد أفطر الصائم ‏\"‏‏.‏",
      "text_en": " Narrated Ibn Abi `Aufa:                     I was with the Prophet on a journey, and he observed the fast till evening. The Prophet said to a man, \"Get down and mix Sawiq with water for me.\" He replied, \"Will you wait till it is evening?\" The Prophet said, \"Get down and mix Sawiq with water for me; when you see night falling from this side, the fasting person should break his fast.\"",
      "chain": [
        "30184",
        "20436",
        "20160",
        "5115"
      ]
    },
    {
      "hadith_no": "2088",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا عمرو بن محمد، حدثنا هشيم، أخبرنا العوام، عن إبراهيم بن عبد الرحمن، عن عبد الله بن أبي أوفى  رضى الله عنه  أن رجلا، أقام سلعة، وهو في السوق، فحلف بالله لقد أعطى بها ما لم يعط، ليوقع فيها رجلا من المسلمين، فنزلت ‏{‏إن الذين يشترون بعهد الله وأيمانهم ثمنا قليلا ‏}‏",
      "text_en": " Narrated `Abdullah bin Abu `Aufa:                     A man displayed some goods in the market and swore by Allah that he had been offered so much for that, that which was not offered, and he said so, so as to cheat a Muslim. On that occasion the following Verse was revealed: \"Verily! Those who purchase a small gain at the cost of Allah's covenant and their oaths (They shall have no portion in the Hereafter ..etc.)' (3.77)",
      "chain": [
        "30263",
        "20468",
        "11441",
        "11619",
        "5115"
      ]
    },
    {
      "hadith_no": "2675",
      "source": " Sahih Bukhari ",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثني إسحاق، أخبرنا يزيد بن هارون، أخبرنا العوام، قال حدثني إبراهيم أبو إسماعيل السكسكي، سمع عبد الله بن أبي أوفى  رضى الله عنهما  يقول أقام رجل سلعته فحلف بالله لقد أعطي بها ما لم يعطها فنزلت ‏{‏إن الذين يشترون بعهد الله وأيمانهم ثمنا قليلا‏}‏ وقال ابن أبي أوفى الناجش آكل ربا خائن‏.‏",
      "text_en": " Narrated `Abdullah bin Abu `Aufa:                     A man displayed some goods in the market and took a false oath that he had been offered so much for them though he was not offered that amount Then the following Divine Verse was revealed:-- \"Verily! Those who purchase a little gain at the cost of Allah's covenant and their oaths . . . Will get painful punishment.\" (3.77) Ibn Abu `Aufa added, \"Such person as described above is a treacherous Riba eater (i.e. eater of usury).",
      "chain": [
        "30021",
        "20472",
        "11441",
        "11619",
        "5115"
      ]
    },
    {
      "hadith_no": "2740",
      "source": " Sahih Bukhari ",
      "chapter": "Wills and Testaments (Wasaayaa) - كتاب الوصايا",
      "chapter_no": "55",
      "text_ar": "حدثنا خلاد بن يحيى، حدثنا مالك، حدثنا طلحة بن مصرف، قال سألت عبد الله بن أبي أوفى  رضى الله عنهما  هل كان النبي صلى الله عليه وسلم أوصى فقال لا‏.‏ فقلت كيف كتب على الناس الوصية أو أمروا بالوصية قال أوصى بكتاب الله‏.‏",
      "text_en": " Narrated Talha bin Musarrif:                     I asked `Abdullah bin Abu `Aufa \"Did the Prophet make a will?\" He replied, \"No,\" I asked him, \"How is it then that the making of a will has been enjoined on people, (or that they are ordered to make a will)?\" He replied, \"The Prophet bequeathed Allah's Book (i.e. Qur'an).",
      "chain": [
        "20191",
        "20001",
        "11356",
        "5115"
      ]
    },
    {
      "hadith_no": "2933",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا أحمد بن محمد، أخبرنا عبد الله، أخبرنا إسماعيل بن أبي خالد، أنه سمع عبد الله بن أبي أوفى  رضى الله عنهما  يقول دعا رسول الله صلى الله عليه وسلم يوم الأحزاب على المشركين فقال ‏\"‏ اللهم منزل الكتاب سريع الحساب، اللهم اهزم الأحزاب، اللهم اهزمهم وزلزلهم ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Abi `Aufa:                     Allah's Apostle invoked evil upon the pagans on the ay (of the battle) of Al-Ahzab, saying, \"O Allah! The Revealer of the Holy Book, the Swift-Taker of Accounts, O Allah, defeat Al-Ahzab (i.e. the clans), O Allah, defeat them and shake them.\"",
      "chain": [
        "30304",
        "20025",
        "11418",
        "5115"
      ]
    },
    {
      "hadith_no": "3155",
      "source": " Sahih Bukhari ",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا عبد الواحد، حدثنا الشيباني، قال سمعت ابن أبي أوفى  رضى الله عنهما  يقول أصابتنا مجاعة ليالي خيبر، فلما كان يوم خيبر وقعنا في الحمر الأهلية، فانتحرناها فلما غلت القدور، نادى منادي رسول الله صلى الله عليه وسلم اكفئوا القدور، فلا تطعموا من لحوم الحمر شيئا‏.‏ قال عبد الله فقلنا إنما نهى النبي صلى الله عليه وسلم لأنها لم تخمس‏.‏ قال وقال آخرون حرمها البتة‏.‏ وسألت سعيد بن جبير فقال حرمها البتة‏.‏",
      "text_en": " Narrated Ibn Abi `Aufa:                     We were afflicted with hunger during the besiege of Khaibar, and when it was the day of (the battle of) Khaibar, we slaughtered the donkeys and when the pots got boiling (with their meat). Allah's Apostle made an announcement that all the pots should be upset and that nobody should eat anything of the meat of the donkeys. We thought that the Prophet prohibited that because the Khumus had not been taken out of the booty (i.e. donkeys); other people said, \"He prohibited eating them for ever.\" The sub-narrator added, \"I asked Sa`id bin Jubair who said, 'He has made the eating of donkeys' meat illegal for ever.\")",
      "chain": [
        "20040",
        "20256",
        "11352",
        "5115"
      ]
    },
    {
      "hadith_no": "4165",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا محمد، أخبرنا الفزاري، وعبدة، عن إسماعيل بن أبي خالد، قال سمعت عبد الله بن أبي أوفى  رضى الله عنهما  يقول دعا رسول الله صلى الله عليه وسلم على الأحزاب فقال ‏\"‏ اللهم منزل الكتاب، سريع الحساب، اهزم الأحزاب، اللهم اهزمهم وزلزلهم ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Abi `Aufa:                     Allah's Apostle invoked evil upon the clans saying, \"Allah, the Revealer of the Holy Book (i.e. the Qur'an), the Quick Taker of the accounts! Please defeat the clans. O Allah! Defeat them and shake them.\"",
      "chain": [
        "30213",
        "20405",
        "20337",
        "11418",
        "5115"
      ]
    },
    {
      "hadith_no": "4208",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "وقال عبيد الله بن معاذ حدثنا أبي، حدثنا شعبة، عن عمرو بن مرة، حدثني عبد الله بن أبي أوفى  رضى الله عنهما  كان أصحاب الشجرة ألفا وثلاثمائة، وكانت أسلم ثمن المهاجرين‏.‏ تابعه محمد بن بشار حدثنا أبو داود حدثنا شعبة‏.‏",
      "text_en": "",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11381",
        "5115"
      ]
    },
    {
      "hadith_no": "4217",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا آدم بن أبي إياس، حدثنا شعبة، عن عمرو بن مرة، قال سمعت عبد الله بن أبي أوفى  وكان من أصحاب الشجرة  قال كان النبي صلى الله عليه وسلم إذا أتاه قوم بصدقة قال ‏\"‏ اللهم صل عليهم ‏\"‏‏.‏ فأتاه أبي بصدقته فقال ‏\"‏ اللهم صل على آل أبي أوفى ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Abi `Aufa:                     (Who was one of those who had given the Pledge of allegiance to the Prophet beneath the Tree) When the people brought Sadaqa (i.e. rak`at) to the Prophet he used to say, \"O Allah! Bless them with your Mercy.\" Once my father came with his Sadaqa to him whereupon he (i.e. the Prophet) said. \"O Allah! Bless the family of Abu `Aufa.\"",
      "chain": [
        "20404",
        "20020",
        "11381",
        "5115"
      ]
    },
    {
      "hadith_no": "4237",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا ابن نمير، حدثنا يعلى، حدثنا إسماعيل، قال سمعت عبد الله بن أبي أوفى  رضى الله عنهما  قال كنا مع النبي صلى الله عليه وسلم حين اعتمر فطاف فطفنا معه، وصلى وصلينا معه، وسعى بين الصفا والمروة، فكنا نستره من أهل مكة، لا يصيبه أحد بشىء‏.‏",
      "text_en": " Narrated `Abdullah bin Abi `Aufa:                     We were in the company of the Prophet when he performed the `Umra. He performed the Tawaf and we did the same; he offered the prayer and we also offered the prayer with him. Then he performed the Sai between Safa and Marwa and we were guarding him against the people of Mecca so that nobody should harm him.",
      "chain": [
        "30212",
        "20372",
        "11418",
        "5115"
      ]
    },
    {
      "hadith_no": "4269",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا سعيد بن سليمان، حدثنا عباد، عن الشيباني، قال سمعت ابن أبي أوفى  رضى الله عنهما  أصابتنا مجاعة يوم خيبر، فإن القدور لتغلي  قال وبعضها نضجت  فجاء منادي النبي صلى الله عليه وسلم لا تأكلوا من لحوم الحمر شيئا وأهريقوها‏.‏ قال ابن أبي أوفى فتحدثنا أنه إنما نهى عنها لأنها لم تخمس‏.‏ وقال بعضهم نهى عنها البتة، لأنها كانت تأكل العذرة‏.‏",
      "text_en": " Narrated Ibn Abi `Aufa:                     We where afflicted with severe hunger on the day of Khaibar. While the cooking pots were boiling and some of the food was well-cooked, the announcer of the Prophet came to say, \"Do not eat anything the donkey-meat and upset the cooking pots.\" We then thought that the Prophet had prohibited such food because the Khumus had not been taken out of it. Some others said, \"He prohibited the meat of donkeys from the point of view of principle, because donkeys used to eat dirty things.\"",
      "chain": [
        "30252",
        "20431",
        "11352",
        "5115"
      ]
    },
    {
      "hadith_no": "4270",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا حجاج بن منهال، حدثنا شعبة، قال أخبرني عدي بن ثابت، عن البراء، وعبد الله بن أبي أوفى، رضى الله عنهم أنهم كانوا مع النبي صلى الله عليه وسلم فأصابوا حمرا فطبخوها، فنادى منادي النبي صلى الله عليه وسلم أكفئوا القدور‏.‏",
      "text_en": " Narrated Al-Bara and `Abdullah bin Abl `Aufa:                     That when they were in the company of the Prophet, they got some donkeys which they (slaughtered and) cooked. Then the announcer of the Prophet said, \"Turn the cooking pots upside down (i.e. throw out the meat).",
      "chain": [
        "20219",
        "20020",
        "11372",
        "400",
        "5115"
      ]
    },
    {
      "hadith_no": "4271",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني إسحاق، حدثنا عبد الصمد، حدثنا شعبة، حدثنا عدي بن ثابت، سمعت البراء، وابن أبي أوفى، يحدثان عن النبي صلى الله عليه وسلم أنه قال يوم خيبر وقد نصبوا القدور أكفئوا القدور‏.‏",
      "text_en": " Narrated Al-Bara' and Ibn Abi `Aufa:                     On the day of Khaibar when the cooking pots were put on the fire, the Prophet said, \"Turn the cooking pots upside down.\"",
      "chain": [
        "30021",
        "20250",
        "20020",
        "11372",
        "400",
        "5115"
      ]
    },
    {
      "hadith_no": "4300",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، عن إسماعيل بن أبي خالد، سمع ابن أبي أوفى، يقول لما اعتمر رسول الله صلى الله عليه وسلم سترناه من غلمان المشركين ومنهم، أن يؤذوا رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Ibn Abi `Aufa:                     When Allah's Apostle performed the `Umra (which he performed in the year following the treaty of Al-Hudaibiya) we were screening Allah's Apostle from the infidels and their boys lest they should harm him.",
      "chain": [
        "30026",
        "20005",
        "11418",
        "5115"
      ]
    },
    {
      "hadith_no": "4501",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا أبو نعيم، حدثنا مالك بن مغول، عن طلحة، قال سألت عبد الله بن أبي أوفى  رضى الله عنهما  أوصى النبي صلى الله عليه وسلم فقال لا‏.‏ فقلت كيف كتب على الناس الوصية أو أمروا بها قال أوصى بكتاب الله‏.‏",
      "text_en": " Narrated Talha:                     I asked `Abdullah bin Abu `Aufa \"Did the Prophet make a will? ' He replied, \"No.\" I further asked, \"How comes it that the making of a will was enjoined on the people or that they were ordered to make it? \" He said, \"The Prophet made a will concerning Allah's Book.\"",
      "chain": [
        "20348",
        "20358",
        "11356",
        "5115"
      ]
    },
    {
      "hadith_no": "4593",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا علي  هو ابن أبي هاشم  سمع هشيما، أخبرنا العوام بن حوشب، عن إبراهيم بن عبد الرحمن، عن عبد الله بن أبي أوفى  رضى الله عنهما  أن رجلا، أقام سلعة في السوق فحلف فيها لقد أعطى بها ما لم يعطه‏.‏ ليوقع فيها رجلا من المسلمين، فنزلت ‏{‏إن الذين يشترون بعهد الله وأيمانهم ثمنا قليلا‏}‏ إلى آخر الآية‏.‏",
      "text_en": " Narrated `Abdullah bin Abu `Aufa:                     A man displayed some merchandise in the market and took an oath that he had been offered a certain price for it while in fact he had not, in order to cheat a man from the Muslims. So then was revealed:-- \"Verily! Those who purchase a small gain at the cost of Allah's Covenant and their oaths...\"(3.77)",
      "chain": [
        "30364",
        "20468",
        "11441",
        "11619",
        "5115"
      ]
    },
    {
      "hadith_no": "5354",
      "source": " Sahih Bukhari ",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا جرير بن عبد الحميد، عن أبي إسحاق الشيباني، عن عبد الله بن أبي أوفى، قال كنا في سفر مع رسول الله صلى الله عليه وسلم فلما غربت الشمس قال لرجل ‏\"‏ انزل فاجدح لي ‏\"‏‏.‏ قال يا رسول الله لو أمسيت‏.‏ ثم قال ‏\"‏ انزل فاجدح ‏\"‏‏.‏ قال يا رسول الله لو أمسيت إن عليك نهارا‏.‏ ثم قال ‏\"‏ انزل فاجدح ‏\"‏‏.‏ فنزل فجدح له في الثالثة، فشرب رسول الله صلى الله عليه وسلم ثم أومأ بيده إلى المشرق فقال ‏\"‏ إذا رأيتم الليل قد أقبل من ها هنا فقد أفطر الصائم ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Abi A'ufa:                     We were with Allah's Apostle on a journey, and when the sun set, he said to a man, \"Get down and prepare a drink of Sawiq for me.\" The man said, \"O Allah's Apostle! Will you wait till it is evening?\" Allah's Apostle again said, \"Get down and prepare a drink of Sawiq.\" The man said, \"O Allah's Apostle! Will you wait till it is evening, for it is still daytime. \" The Prophet again said, \"Get down and prepare a drink of Sawiq.\" So the third time the man got down and prepared a drink of sawiq for him. Allah's Apostle drank thereof and pointed with his hand towards the East, saying, \"When you see the night falling from this side, then a fasting person should break his fast.\"",
      "chain": [
        "30026",
        "20028",
        "11352",
        "5115"
      ]
    },
    {
      "hadith_no": "5553",
      "source": " Sahih Bukhari ",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا أبو الوليد، حدثنا شعبة، عن أبي يعفور، قال سمعت ابن أبي أوفى  رضى الله عنهما  قال غزونا مع النبي صلى الله عليه وسلم سبع غزوات أو ستا، كنا نأكل معه الجراد‏.‏ قال سفيان وأبو عوانة وإسرائيل عن أبي يعفور عن ابن أبي أوفى سبع غزوات‏.‏",
      "text_en": " Narrated Ibn Abi `Aufa:                     We participated with the Prophet in six or seven Ghazawat, and we used to eat locusts with him.",
      "chain": [
        "20296",
        "20020",
        "11403",
        "5115"
      ]
    },
    {
      "hadith_no": "5584",
      "source": " Sahih Bukhari ",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن شعبة، قال حدثني عدي، عن البراء، وابن أبي أوفى، رضى الله عنهم قالا نهى النبي صلى الله عليه وسلم عن لحوم الحمر‏.‏",
      "text_en": " Narrated Al-Bara' and Ibn Abi `Aufa:                     The Prophet prohibited the eating of donkey's meat.",
      "chain": [
        "30175",
        "20031",
        "20020",
        "11372",
        "400",
        "5115"
      ]
    },
    {
      "hadith_no": "5656",
      "source": " Sahih Bukhari ",
      "chapter": "Drinks - كتاب الأشربة",
      "chapter_no": "74",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا عبد الواحد، حدثنا الشيباني، قال سمعت عبد الله بن أبي أوفى  رضى الله عنهما  قال نهى النبي صلى الله عليه وسلم عن الجر الأخضر‏.‏ قلت أنشرب في الأبيض قال لا‏.‏",
      "text_en": " Narrated Ash-Shaibani:                     I heard `Abdullah bin Abi `Aufa saying, \"The Prophet forbade the use of green jars.\" I said, \"Shall we drink out of white jars?\" He said, \"No.\"",
      "chain": [
        "20040",
        "20256",
        "11352",
        "5115"
      ]
    },
    {
      "hadith_no": "6406",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا مسلم، حدثنا شعبة، عن عمرو، سمعت ابن أبي أوفى  رضى الله عنهما كان النبي صلى الله عليه وسلم إذا أتاه رجل بصدقة قال ‏\"‏ اللهم صل على آل فلان ‏\"‏‏.‏ فأتاه أبي فقال ‏\"‏ اللهم صل على آل أبي أوفى ‏\"‏‏.‏",
      "text_en": " Narrated Ibn Abi `Aufa:                     Whenever a man brought his alms to the Prophet, the Prophet would say, \"O Allah! Bestow Your Blessing upon the family of so-and-so.\" When my father came to him (with his alms), he said, \"O Allah! Bestow Your Blessings upon the family of Abi `Aufa.\"",
      "chain": [
        "20285",
        "20020",
        "20377",
        "5115"
      ]
    },
    {
      "hadith_no": "6433",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن عمرو بن مرة، عن ابن أبي أوفى، قال كان إذا أتى رجل النبي صلى الله عليه وسلم بصدقته قال ‏\"‏ اللهم صل عليه‏\"‏ فأتاه أبي بصدقته فقال ‏\"‏ اللهم صل على آل أبي أوفى‏\"‏",
      "text_en": " Narrated Ibn Abi `Aufa:                     Whenever somebody brought alms to the Prophet the used to say, \"Allahumma Salli 'Alaihi (O Allah! Send Your Salat (Grace and Honor) on him).\" Once when my father brought his alms to him, he said, \"O Allah! Send Your Salat (Grace and Honor) on the family of Abi `Aufa.\"",
      "chain": [
        "20193",
        "20020",
        "11381",
        "5115"
      ]
    },
    {
      "hadith_no": "6465",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا ابن سلام، أخبرنا وكيع، عن ابن أبي خالد، قال سمعت ابن أبي أوفى  رضى الله عنهما  قال دعا رسول الله صلى الله عليه وسلم على الأحزاب فقال ‏\"‏ اللهم منزل الكتاب، سريع الحساب، اهزم الأحزاب، اهزمهم وزلزلهم ‏\"‏‏.‏",
      "text_en": " Narrated Ibn Abi `Aufa:                     Allah's Apostle asked for Allah's wrath upon the Ahzab (confederates), saying, \"O Allah, the Revealer of the Holy Book, and the One swift at reckoning! Defeat the confederates; Defeat them and shake them.\"",
      "chain": [
        "30376",
        "20032",
        "11418",
        "5115"
      ]
    },
    {
      "hadith_no": "6926",
      "source": " Sahih Bukhari ",
      "chapter": "Punishment of Disbelievers at War with Allah and His Apostle - كتاب المحاربين من أهل الكفر والردة",
      "chapter_no": "87",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا عبد الواحد، حدثنا الشيباني، سألت عبد الله بن أبي أوفى عن الرجم، فقال رجم النبي صلى الله عليه وسلم‏.‏ فقلت أقبل النور أم بعده قال لا أدري‏.‏ تابعه علي بن مسهر وخالد بن عبد الله والمحاربي وعبيدة بن حميد عن الشيباني‏.‏ وقال بعضهم المائدة‏.‏ والأول أصح‏.‏",
      "text_en": " Narrated Ash-Shaibani:                     I asked `Abdullah bin Abi `Aufa about the Rajam (stoning somebody to death for committing illegal sexual intercourse). He replied, \"The Prophet carried out the penalty of Rajam,\" I asked, \"Was that before or after the revelation of Surat-an-Nur?\" He replied, \"I do not know.\"",
      "chain": [
        "20040",
        "20256",
        "11352",
        "5115"
      ]
    },
    {
      "hadith_no": "7580",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا سفيان، عن إسماعيل بن أبي خالد، عن عبد الله بن أبي أوفى، قال قال رسول الله صلى الله عليه وسلم يوم الأحزاب ‏\"‏ اللهم منزل الكتاب، سريع الحساب، اهزم الأحزاب وزلزل بهم ‏\"‏‏.‏ زاد الحميدي حدثنا سفيان، حدثنا ابن أبي خالد، سمعت عبد الله، سمعت النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated `Abdullah bin Abi `Aufa:                     Allah's Apostle said on the Day of (the battle of) the Clans, \"O Allah! The Revealer of the Holy Book, The Quick Taker of Accounts! Defeat the clans and shake them.\"",
      "chain": [
        "30367",
        "20005",
        "11418",
        "5115"
      ]
    },
    {
      "hadith_no": "476",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو معاوية، ووكيع، عن الأعمش، عن عبيد بن الحسن، عن ابن أبي أوفى، قال كان رسول الله صلى الله عليه وسلم إذا رفع ظهره من الركوع قال ‏\"‏ سمع الله لمن حمده اللهم ربنا لك الحمد ملء السموات وملء الأرض وملء ما شئت من شىء بعد ‏\"‏ ‏.‏",
      "text_en": " ('Abdullah b ) Ibn Abi Aufa reported:                      When the Messenger of Allah (may peace be upon him) raised his back from the rukd' he pronounced: Allah listened to him who praised Him. O Allah! our Lord! unto Thee be praise that would fill the heavens and the earth and fill that which will please Thee besides them.",
      "chain": [
        "30201",
        "20354",
        "20032",
        "11060",
        "10796",
        "5115"
      ]
    },
    {
      "hadith_no": "476",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن عبيد بن الحسن، قال سمعت عبد الله بن أبي أوفى، قال كان رسول الله صلى الله عليه وسلم يدعو بهذا الدعاء ‏\"‏ اللهم ربنا لك الحمد ملء السموات وملء الأرض وملء ما شئت من شىء بعد ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. Aufa reported:                      The Messenger of Allah (may peace be upon him) used to recite this supplication: O Allah! our Lord, unto Thee be praise that would fill the heavens and the earth and fill that which will please Thee besides them.",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "10796",
        "5115"
      ]
    },
    {
      "hadith_no": "476",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثني محمد بن المثنى، وابن، بشار قال ابن المثنى حدثنا محمد بن جعفر، حدثنا شعبة، عن مجزأة بن زاهر، قال سمعت عبد الله بن أبي أوفى، يحدث عن النبي صلى الله عليه وسلم أنه كان يقول ‏\"‏ اللهم لك الحمد ملء السماء وملء الأرض وملء ما شئت من شىء بعد اللهم طهرني بالثلج والبرد والماء البارد اللهم طهرني من الذنوب والخطايا كما ينقى الثوب الأبيض من الوسخ ‏\"‏ ‏.‏",
      "text_en": " Abdullah b. Abu Aufa reported that the Apostle of Allah (may peace be upon him) used to recite (this supplication):                      O Allah! our Lord, unto Thee be praise that would fill the heavens and the earth and fill that which will please Thee besides (them). O Allah! purify me with snow, (water of) hail and with cold water; O Allah. cleanse me from the sins and errors just as a white garment is cleansed from dirt.",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "11650",
        "5115"
      ]
    },
    {
      "hadith_no": "2543",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا يحيى بن يحيى، وأبو بكر بن أبي شيبة وعمرو الناقد وإسحاق بن إبراهيم قال يحيى أخبرنا وكيع، عن شعبة، عن عمرو بن مرة، قال سمعت عبد الله بن أبي أوفى، ح . وحدثنا عبيد الله بن معاذ، - واللفظ له - حدثنا أبي، عن شعبة، عن عمرو، - وهو ابن مرة - حدثنا عبد الله بن أبي أوفى، قال كان رسول الله صلى الله عليه وسلم إذا أتاه قوم بصدقتهم قال ‏\"‏ اللهم صل عليهم ‏\"‏ ‏.‏ فأتاه أبي أبو أوفى بصدقته فقال ‏\"‏ اللهم صل على آل أبي أوفى ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. Abu Aufa said that it was the common practice of the Mes- senger of Allah (may peace be upon him) that when the people brought to him sadaqa he blessed them:                      0 Allah, bless them. So when Abu Aufa brought to him Sadaqa he (the Holy Prophet) said: 0 Allah, bless, the posterity of Abu Aufa.",
      "chain": [
        "30399",
        "20031",
        "20032",
        "20020",
        "11381",
        "5115",
        "11201",
        "11905",
        "20020",
        "11381"
      ]
    },
    {
      "hadith_no": "2613",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا يحيى بن يحيى، أخبرنا هشيم، عن أبي إسحاق الشيباني، عن عبد الله، بن أبي أوفى - رضى الله عنه - قال كنا مع رسول الله صلى الله عليه وسلم في سفر في شهر رمضان فلما غابت الشمس قال ‏\"‏ يا فلان انزل فاجدح لنا ‏\"‏ ‏.‏ قال يا رسول الله إن عليك نهارا ‏.‏ قال ‏\"‏ انزل فاجدح لنا ‏\"‏ ‏.‏ قال فنزل فجدح فأتاه به فشرب النبي صلى الله عليه وسلم ثم قال بيده ‏\"‏ إذا غابت الشمس من ها هنا وجاء الليل من ها هنا فقد أفطر الصائم ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. Abi Aufa reported:                      We were with the Messenger of Allah (may peace be upon him) on a journey during the month of Ramadan. When the sun had sunk he said: So and so, get down (from your ride) and prepare the meal of parched barley for us. He said: Messenger of Allah, still (there is light of) day. He (the Holy Prophet) said: Get down and prepare meal of parched barley for us. So he got down and prepared the meal of parched barley and offered him, and the apostle of Allah (may peace be upon him) drank that (liquid meal). He then told with the gesture of his hand that when the sun sank from that side and the night appeared from that side, then the observer of the fast should break it.",
      "chain": [
        "30399",
        "20468",
        "11352",
        "5115"
      ]
    },
    {
      "hadith_no": "2614",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، وعباد بن العوام، عن الشيباني، عن ابن أبي أوفى، - رضى الله عنه - قال كنا مع رسول الله صلى الله عليه وسلم في سفر فلما غابت الشمس قال لرجل ‏\"‏ انزل فاجدح لنا ‏\"‏ ‏.‏ فقال يا رسول الله لو أمسيت ‏.‏ قال ‏\"‏ انزل فاجدح لنا ‏\"‏ ‏.‏ قال إن علينا نهارا ‏.‏ فنزل فجدح له فشرب ثم قال ‏\"‏ إذا رأيتم الليل قد أقبل من ها هنا - وأشار بيده نحو المشرق - فقد أفطر الصائم ‏\"‏ ‏.‏",
      "text_en": " Ibn Abi Aufa (Allah be pleased with him) reported:                      We were with the Messenger of Allah (may peace be upon him) on a journey. When the sun sank he said to a person: Get down and prepare barley meal for us. Upon this he said: Messenger of Allah, let there be dusk. (He the Holy Prophet) said: Get down and prepare barley meal for us. He (the person) said: There is still (the light of) day upon us. (But) he got down (in obedience to the command of the Holy Prophet) and prepared a barley meal for him and he (the Holy Prophet) drank that (liquid meal) and then said: When you see the night approaching from that side (west) (and he pointed towards the east with his hand), then the observer of the fast should break it.",
      "chain": [
        "30201",
        "20345",
        "20431",
        "11352",
        "5115"
      ]
    },
    {
      "hadith_no": "2615",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا أبو كامل، حدثنا عبد الواحد، حدثنا سليمان الشيباني، قال سمعت عبد، الله بن أبي أوفى - رضى الله عنه - يقول سرنا مع رسول الله صلى الله عليه وسلم وهو صائم فلما غربت الشمس قال ‏\"‏ يا فلان انزل فاجدح لنا ‏\"‏ ‏.‏ مثل حديث ابن مسهر وعباد بن العوام ‏.‏",
      "text_en": " Abdullah b. Abi Aufa (Allah be pleased with him) reported:                      We travelled with the Messenger of Allah (may peace be upon him) as he had been observing fast. When the sun sank he said: So and so, get down and prepare barley meal for us. The rest of the hadith is the same.",
      "chain": [
        "20256",
        "11352",
        "5115"
      ]
    },
    {
      "hadith_no": "2616",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا ابن أبي عمر، أخبرنا سفيان، ح وحدثنا إسحاق، أخبرنا جرير، كلاهما عن الشيباني، عن ابن أبي أوفى، ح . وحدثنا عبيد الله بن معاذ، حدثنا أبي ح، وحدثنا ابن المثنى، حدثنا محمد بن، جعفر قالا حدثنا شعبة، عن الشيباني، عن ابن أبي أوفى، - رضى الله عنه - عن النبي صلى الله عليه وسلم بمعنى حديث ابن مسهر وعباد وعبد الواحد وليس في حديث أحد منهم في شهر رمضان ولا قوله ‏\"‏ وجاء الليل من ها هنا ‏\"‏ ‏.‏ إلا في رواية هشيم وحده ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Ibn Abi Aufa (Allah be pleased with him) through another chain of transmitters (but with a sight alteration of words):                      In this hadith transmitted by one of the narrators (neither these words are found): During the month of Ramadan.\" nor his statement:\" And the night prevails from that side (the eastern side).\" (These words are found in the narration of) Hushaim only.",
      "chain": [
        "30421",
        "20005",
        "30312",
        "11352",
        "5115",
        "30150",
        "20286",
        "20173",
        "20020",
        "11352",
        "5115"
      ]
    },
    {
      "hadith_no": "4641",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا خالد بن عبد الله، عن إسماعيل بن أبي خالد، عن عبد الله بن أبي أوفى، قال دعا رسول الله صلى الله عليه وسلم على الأحزاب فقال ‏\"‏ اللهم منزل الكتاب سريع الحساب اهزم الأحزاب اللهم اهزمهم وزلزلهم ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Ibn Abu Aufa that the Messenger of Allah (may peace be upon him) cursed the tribes (who had marched upon Medina with a combined force in 5 H) and said:                      O Allah, Revealer of the Book, swift in (taking) account, put the tribes to rout. O Lord, defeat them and shake them.",
      "chain": [
        "30116",
        "20423",
        "11418",
        "5115"
      ]
    },
    {
      "hadith_no": "4642",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا وكيع بن الجراح، عن إسماعيل بن أبي، خالد قال سمعت ابن أبي أوفى، يقول دعا رسول الله صلى الله عليه وسلم ‏.‏ بمثل حديث خالد غير أنه قال ‏\"‏ هازم الأحزاب ‏\"‏ ‏.‏ ولم يذكر قوله ‏\"‏ اللهم ‏\"‏ ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Ibn Abu Aufa with a slight variation of words.",
      "chain": [
        "30201",
        "20032",
        "11418",
        "5115"
      ]
    },
    {
      "hadith_no": "4922",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، عن عمرو، - يعني ابن مرة - حدثني عبد الله بن أبي أوفى، قال كان أصحاب الشجرة ألفا وثلاثمائة وكانت أسلم ثمن المهاجرين ‏.‏",
      "text_en": " It has been narrated on the authority of 'Abdullah b. Abu Aufa who said:                      The Companions of the Tree (i e. those who swore fealty under the tree) were one thousand and three hundred, and the people of Aslam tribe were one-eighth of the Muhajirs.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "11381",
        "5115"
      ]
    },
    {
      "hadith_no": "5122",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن الشيباني، قال سألت عبد الله بن أبي أوفى عن لحوم الحمر الأهلية، فقال أصابتنا مجاعة يوم خيبر ونحن مع رسول الله صلى الله عليه وسلم وقد أصبنا للقوم حمرا خارجة من المدينة فنحرناها فإن قدورنا لتغلي إذ نادى منادي رسول الله صلى الله عليه وسلم أن اكفئوا القدور ولا تطعموا من لحوم الحمر شيئا فقلت حرمها تحريم ماذا قال تحدثنا بيننا فقلنا حرمها ألبتة وحرمها من أجل أنها لم تخمس ‏.‏",
      "text_en": " Shaibani reported:                      I asked 'Abdullah b. Abu Aufa about (the lawfulness or unlawfulness of) the flesh of the domestic asses. He said: We experienced hunger on the Day of Khaibar as we were with the Messenger of Allah (may peace be upon him). We found domestic asses in the exterior of Medina. We slaughtered them and our earthen pots were boiling when the announcer of the Messenger of Allah (may peace be upon him) made an announcement that the earthen pots should be turned upside down and nothing of the flesh of the domestic asses should be eaten. I said: What kind of prohibition is it that he (the Holy Prophet) has made? He said: We discussed it amongst -ourselves. Some of us aaid that it has been declared unlawful for ever, (whereas others said) it has been declared unlawful since one-fifth (of the booty) has not been given (to the treasury, as is legally required).",
      "chain": [
        "30201",
        "20345",
        "11352",
        "5115"
      ]
    },
    {
      "hadith_no": "5123",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثنا أبو كامل، فضيل بن حسين حدثنا عبد الواحد، - يعني ابن زياد - حدثنا  سليمان الشيباني، قال سمعت عبد الله بن أبي أوفى، يقول أصابتنا مجاعة ليالي خيبر فلما كان يوم خيبر وقعنا في الحمر الأهلية فانتحرناها فلما غلت بها القدور نادى منادي رسول الله صلى الله عليه وسلم أن اكفئوا القدور ولا تأكلوا من لحوم الحمر شيئا - قال - فقال ناس إنما نهى عنها رسول الله صلى الله عليه وسلم لأنها لم تخمس ‏.‏ وقال آخرون نهى عنها ألبتة ‏.‏",
      "text_en": " Sulaiman Shaibini reported:                      I heard Abdullah b. Abu Aufa say: We were smitten with hunger during the nights of Khaibar. On the Day of Khaibar, we fell upon domestic asses and we slaughtered them, and when our earthen pots boiled with them, the announcer of Allah's Messenger (may peace be upon him) made an annoancement that the earthen pots should be turned over, and nothing should be eaten of the flesh of the domestic asses. Some of the people said that Allah's Messenger (may peace be upon him) had forbidden (the use of this flesh) for one-fifth (due to the State) has not been paid, while others said: He prohibited it for ever.",
      "chain": [
        "20256",
        "11352",
        "5115"
      ]
    },
    {
      "hadith_no": "5157",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "حدثنا أبو كامل الجحدري، حدثنا أبو عوانة، عن أبي يعفور، عن عبد الله بن، أبي أوفى قال غزونا مع رسول الله صلى الله عليه وسلم سبع غزوات نأكل الجراد ‏.‏",
      "text_en": " Ibn Abu Aufa reported:                      We went on seven expeditions with Allah's Messenger (may peace be upon him) and ate locusts.",
      "chain": [
        "30559",
        "20469",
        "11403",
        "5115"
      ]
    },
    {
      "hadith_no": "6428",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا أبو معاوية، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، ح وحدثنا إسحاق بن إبراهيم، أخبرنا المعتمر بن سليمان، وجرير، ح وحدثنا  ابن أبي عمر، حدثنا سفيان، كلهم عن إسماعيل بن أبي خالد، عن ابن أبي أوفى، عن النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " This hadith has been narrated on the a tliority of Ibn Abi Aufa through other chains of transmitters.",
      "chain": [
        "30399",
        "20354",
        "30201",
        "20032",
        "30123",
        "20288",
        "4057",
        "30421",
        "11418",
        "5115"
      ]
    },
    {
      "hadith_no": "802",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا عفان، حدثنا همام، حدثنا محمد بن جحادة، عن رجل، عن عبد الله بن أبي أوفى، أن النبي صلى الله عليه وسلم كان يقوم في الركعة الأولى من صلاة الظهر حتى لا يسمع وقع قدم ‏.‏",
      "text_en": " Abd Allah b. Abl Awfa said:                      The prophet (ﷺ) used to stand in the rak’ah of prayer so much so that no sound of steps heard.",
      "chain": [
        "30203",
        "30106",
        "20297",
        "18897",
        "5115"
      ]
    },
    {
      "hadith_no": "832",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا وكيع بن الجراح، حدثنا سفيان الثوري، عن أبي خالد الدالاني، عن إبراهيم السكسكي، عن عبد الله بن أبي أوفى، قال جاء رجل إلى النبي صلى الله عليه وسلم فقال إني لا أستطيع أن آخذ من القرآن شيئا فعلمني ما يجزئني منه ‏.‏ قال ‏\"‏ قل سبحان الله والحمد لله ولا إله إلا الله والله أكبر ولا حول ولا قوة إلا بالله ‏\"‏ ‏.‏ قال يا رسول الله هذا لله عز وجل فما لي قال ‏\"‏ قل اللهم ارحمني وارزقني وعافني واهدني ‏\"‏ ‏.‏ فلما قام قال هكذا بيده فقال رسول الله صلى الله عليه وسلم ‏\"‏ أما هذا فقد ملأ يده من الخير ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn AbuAwfa:                     A man came to the Prophet (ﷺ) and said: I cannot memorise anything from the Qur'an: so teach me something which is sufficient for me. He said: Say Glory be to Allah, and praise be to Allah, and there is no god but Allah, and Allah is most great, and there is no might and no strength but in Allah.  :He said: Messenger of Allah, this is for Allah, but what is for me? He said: Say: O Allah have mercy on me, and sustain me, and keep me well, and guide me. When he stood up, he made a sign with his hand (indicating that he had earned a lot). The Messenger of Allah (ﷺ) said: He filed up his hand with virtues.",
      "chain": [
        "30203",
        "20032",
        "20012",
        "20728",
        "5115"
      ]
    },
    {
      "hadith_no": "846",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا عبد الله بن نمير، وأبو معاوية ووكيع ومحمد بن عبيد كلهم عن الأعمش، عن عبيد بن الحسن، سمعت عبد الله بن أبي أوفى، يقول كان رسول الله صلى الله عليه وسلم إذا رفع رأسه من الركوع يقول ‏\"‏ سمع الله لمن حمده اللهم ربنا لك الحمد ملء السموات وملء الأرض وملء ما شئت من شىء بعد ‏\"‏ ‏.‏ قال أبو داود قال سفيان الثوري وشعبة بن الحجاج عن عبيد أبي الحسن بهذا الحديث ليس فيه بعد الركوع ‏.‏ قال سفيان لقينا الشيخ عبيدا أبا الحسن بعد فلم يقل فيه بعد الركوع ‏.‏ قال أبو داود ورواه شعبة عن أبي عصمة عن الأعمش عن عبيد قال ‏\"‏ بعد الركوع ‏\"‏ ‏.‏",
      "text_en": " Abd Allah b. Abi Awfa said:                      When the Messenger of Allah (ﷺ) raised his head after bowing, he said: Allah listens to him who praises Him. O Allah, our lord, to Thee be the praise in the heavens and in all the earth, and all that it please Thee to create afterwards.Abu Dawud said: Sufyan al-Thawri and Shu’bah b. al-Hajjaj reported on authority of Ubaid b. al-Hasan: There is no mention of the words “after bowing” in this tradition. Sufyan said: we met al-shaikh ‘Ubaid b. al-Hasan; he did not say the words “bowing” in it.Abu dawud said: Shu’bah narrated this from Abi ‘Ismah, from al-A’mash, on the authority of ‘Ubaid, saying: “after bowing”.",
      "chain": [
        "31167",
        "20331",
        "11060",
        "10796",
        "5115"
      ]
    },
    {
      "hadith_no": "1590",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا حفص بن عمر النمري، وأبو الوليد الطيالسي، - المعنى - قالا أخبرنا شعبة، عن عمرو بن مرة، عن عبد الله بن أبي أوفى، قال كان أبي من أصحاب الشجرة وكان النبي صلى الله عليه وسلم إذا أتاه قوم بصدقتهم قال ‏\"‏ اللهم صل على آل فلان ‏\"‏ ‏.‏ قال فأتاه أبي بصدقته فقال ‏\"‏ اللهم صل على آل أبي أوفى ‏\"‏ ‏.‏",
      "text_en": " Narrated ‘Abdallah bin Abi Awfa :                     My father was one of those Companions who took the oath of allegiance at the hand of the Prophet (ﷺ) beneath the tree. The Prophet (ﷺ) said when the people brought him their sadaqah : O Allah, bless the family of so and so. When my father brought him his sadaqah he said O Allah bless the family of Abu Awfa.",
      "chain": [
        "30329",
        "20296",
        "20020",
        "11381",
        "5115"
      ]
    },
    {
      "hadith_no": "1902",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا مسدد، حدثنا خالد بن عبد الله، حدثنا إسماعيل بن أبي خالد، عن عبد الله بن أبي أوفى، أن رسول الله صلى الله عليه وسلم اعتمر فطاف بالبيت وصلى خلف المقام ركعتين ومعه من يستره من الناس فقيل لعبد الله أدخل رسول الله صلى الله عليه وسلم الكعبة قال لا ‏.‏",
      "text_en": " ‘Abd Allaah bin Abi Aufa said the Apostle of Allaah(ﷺ) performed ‘Umrah and went round the House(the Ka’bah) and prayed behind the station (Maqam Ibrahim) two rak’ahs and he was accompanied by so many people that he was hidden by them. ‘Abd Allaah bin Abi Aufa was asked Did the Apostle of Allaah(ﷺ) enter the Ka’bah ? He replied “No”.",
      "chain": [
        "30175",
        "20423",
        "11418",
        "5115"
      ]
    },
    {
      "hadith_no": "1903",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا تميم بن المنتصر، أخبرنا إسحاق بن يوسف، أخبرنا شريك، عن إسماعيل بن أبي خالد، قال سمعت عبد الله بن أبي أوفى، بهذا الحديث زاد ثم أتى الصفا والمروة فسعى بينهما سبعا ثم حلق رأسه ‏.‏",
      "text_en": " Isma’il bin Abi Khalid said I heard ‘Abd Allaah bin Abi Aufa narrated this tradition. His version added “He then came to Al Safa’ and Al Marwah and ran between them seven times and then shaved his head.",
      "chain": [
        "20411",
        "20587",
        "11418",
        "5115"
      ]
    },
    {
      "hadith_no": "2352",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا مسدد، حدثنا عبد الواحد، حدثنا سليمان الشيباني، قال سمعت عبد الله بن أبي أوفى، يقول سرنا مع رسول الله صلى الله عليه وسلم وهو صائم فلما غربت الشمس قال ‏\"‏ يا بلال انزل فاجدح لنا ‏\"‏ ‏.‏ قال يا رسول الله لو أمسيت ‏.‏ قال ‏\"‏ انزل فاجدح لنا ‏\"‏ ‏.‏ قال يا رسول الله إن عليك نهارا ‏.‏ قال ‏\"‏ انزل فاجدح لنا ‏\"‏ ‏.‏ فنزل فجدح فشرب رسول الله صلى الله عليه وسلم ثم قال ‏\"‏ إذا رأيتم الليل قد أقبل من ها هنا فقد أفطر الصائم ‏\"‏ ‏.‏ وأشار بأصبعه قبل المشرق ‏.‏",
      "text_en": " Narrated 'Abd Allah b. Abi Awfa:                     We went along with the Messenger of Allah (ﷺ) while he was fasting. When the sun set, he said to Bilal: Bilal, come down and prepare barley beverage for us. He said: Messenger of Allah, would  that you waited for the evening. He said: Come down and prepare barley beverage for us. He said: Messenger of Allah, the say still remains on you (i.e. there remains the brightness of the day). He said: Come down and prepare barley drink for us. So he came down and prepared barley drink. The Messenger of Allah (ﷺ) drank it and said: When you see that the night approaches from this side, he who fasts has reached the time to break it ; and he pointed to the east with his finger.",
      "chain": [
        "30175",
        "20256",
        "11352",
        "5115"
      ]
    },
    {
      "hadith_no": "2704",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا أبو معاوية، حدثنا أبو إسحاق الشيباني، عن محمد بن أبي مجالد، عن عبد الله بن أبي أوفى، قال قلت هل كنتم تخمسون - يعني الطعام - في عهد رسول الله صلى الله عليه وسلم فقال أصبنا طعاما يوم خيبر فكان الرجل يجيء فيأخذ منه مقدار ما يكفيه ثم ينصرف ‏.‏",
      "text_en": " Narrated Abdullah ibn AbuAwfa:                     Muhammad ibn AbulMujahid reported Abdullah ibn AbuAwfa as saying: I asked: Did you set aside the fifth of the food in the time of the Messenger of Allah (ﷺ)? He replied: On the day of Khaybar we captured food and a man would come and take as much food of it as needed and then go away.",
      "chain": [
        "30216",
        "20354",
        "11352",
        "5115"
      ]
    },
    {
      "hadith_no": "3725",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Drinks (Kitab Al-Ashribah) - كتاب الأشربة",
      "chapter_no": "27",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا شعبة، عن أبي المختار، عن عبد الله بن أبي أوفى، أن النبي صلى الله عليه وسلم قال ‏\"‏ ساقي القوم آخرهم شربا ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn AbuAwfa:                     The Prophet (ﷺ) said: The supplier of the people is the last (man) to drink.",
      "chain": [
        "20285",
        "20020",
        "5115"
      ]
    },
    {
      "hadith_no": "3812",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا حفص بن عمر النمري، حدثنا شعبة، عن أبي يعفور، قال سمعت ابن أبي أوفى، وسألته، عن الجراد، فقال غزوت مع رسول الله صلى الله عليه وسلم ست أو سبع غزوات فكنا نأكله معه ‏.‏",
      "text_en": " Abu Ya’fur said:                      I heard Ibn Abi Awfa say when I asked him about (eating) locusts: I went on six or seven expeditions along with the Messenger of Allah (ﷺ) and we ate them (locusts) along with him.",
      "chain": [
        "30329",
        "20020",
        "11403",
        "5115"
      ]
    },
    {
      "hadith_no": "479",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Al-Witr - أَبْوَابُ الْوِتْرِ",
      "chapter_no": "3",
      "text_ar": "حدثنا علي بن عيسى بن يزيد البغدادي، حدثنا عبد الله بن بكر السهمي، ‏.‏ وحدثنا عبد الله بن منير، عن عبد الله بن بكر، عن فائد بن عبد الرحمن، عن عبد الله بن أبي أوفى، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من كانت له إلى الله حاجة أو إلى أحد من بني آدم فليتوضأ وليحسن الوضوء ثم ليصل ركعتين ثم ليثن على الله وليصل على النبي صلى الله عليه وسلم ثم ليقل لا إله إلا الله الحليم الكريم سبحان الله رب العرش العظيم الحمد لله رب العالمين أسألك موجبات رحمتك وعزائم مغفرتك والغنيمة من كل بر والسلامة من كل إثم لا تدع لي ذنبا إلا غفرته ولا هما إلا فرجته ولا حاجة هي لك رضا إلا قضيتها يا أرحم الراحمين ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب وفي إسناده مقال ‏.‏ فائد بن عبد الرحمن يضعف في الحديث وفائد هو أبو الورقاء ‏.‏",
      "text_en": " Abdullah bin Abi Awfa narrated that :                     Allah's Messenger said: \"Whomever has a need from Allah, or from one of the sons of Adam, then let him perform Wudu, performing it well, then pry two Rak'ah, then pray Allah and say Salat upon the Prophet. Then let him say: (L ilaha illallah Al-Halimul-Karim. Subhan Alla Rabbil-Arshil-Azim. Al-Hamdulillahi Rabbil-Alamin. Asaluka mujibati rahmatika wa aza'im maghfiratika, wal-ghanimata min kulli birrin, was-salamata min kulli ithmin la tada li dhanban illa ghafartahu, wa la hamman illa farrajtahu, wa la Hajatan hiya laka radan Illa Qadaitaha, ya arham ar-rahimin.) 'None has the right t be worshiped but Allah. Al-Halim (the Forbearing) Al-Karim (the Generous). Glorious is Allah, Lord of the Magnificent Throne. All praise is due to Allah, Lord of the worlds. I ask You for that which warrants Your mercy, and that which will determine Your forgiveness, and the spoils (fruits) of every righteous deed, and safety from every sin; do not leave a sin for me without forgiving it, nor a worry without relieving it. Or a need that pleases you without granting it. O Most-Merciful of those who have mercy.'\"",
      "chain": [
        "30353",
        "20244",
        "5115"
      ]
    },
    {
      "hadith_no": "1330",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Chapters On Judgements From The Messenger of Allah - كتاب الأحكام عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "15",
      "text_ar": "حدثنا عبد القدوس بن محمد أبو بكر العطار، حدثنا عمرو بن عاصم، حدثنا عمران القطان، عن أبي إسحاق الشيباني، عن عبد الله بن أبي أوفى، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله مع القاضي ما لم يجر فإذا جار تخلى عنه ولزمه الشيطان ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من حديث عمران القطان ‏.‏",
      "text_en": " ['Abdullah] Ibn Abi Al-Awfa narrated that the Messenger of Allah (ﷺ) said:                      \"[Indeed] Allah is with the judge as long as he is not unjust. So when he is unjust, He leaves him and he is attended by Shaitan.\"",
      "chain": [
        "20267",
        "20718",
        "11352",
        "5115"
      ]
    },
    {
      "hadith_no": "1678",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jihad - كتاب الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "23",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا يزيد بن هارون، أنبأنا إسماعيل بن أبي خالد، عن ابن أبي أوفى، قال سمعته يقول يعني النبي صلى الله عليه وسلم يدعو على الأحزاب فقال ‏\"‏ اللهم منزل الكتاب سريع الحساب اهزم الأحزاب اللهم اهزمهم وزلزلهم ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن ابن مسعود ‏.‏ وهذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Ibn Abi Awfa:                     \"I heard him saying\" - meaning the Prophet (ﷺ) - \"while supplicating against the Ahzab: 'O Allah, Revealer of Book! Severe is reckoning! Rout the Ahzab and shake them.'\"[Abu 'Eisa said:] There is something on this topic from Ibn Masu'dThis Hadith is Hasan Sahih.",
      "chain": [
        "30242",
        "20472",
        "11418",
        "5115"
      ]
    },
    {
      "hadith_no": "1821",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا سفيان، عن أبي يعفور العبدي، عن عبد الله بن أبي أوفى، أنه سئل عن الجراد، فقال غزوت مع النبي صلى الله عليه وسلم ست غزوات نأكل الجراد ‏.‏ قال أبو عيسى هكذا روى سفيان بن عيينة عن أبي يعفور هذا الحديث وقال ست غزوات وروى سفيان الثوري وغير واحد هذا الحديث عن أبي يعفور فقال سبع غزوات ‏. قال وفي الباب عن ابن عمر وجابر ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وأبو يعفور اسمه واقد ويقال وقدان أيضا وأبو يعفور الآخر اسمه عبد الرحمن بن عبيد بن نسطاس ‏.‏",
      "text_en": " Narrated Abu Ya'fur Al-'Abdi:                     That 'Abdullah bin Abi Awfa was asked about locust. He said: \"I participated in six military expeditions with the Messenger of Allah (saws, (and) we ate locust.\"[Abu 'Eisa said:] This is how Sufyan bin 'Uyainah reported this Hadith from Abu Ya'fur. He said: \"Six military expeditions,\" while Sufyan Ath-Thawri reported this Hadith from Abu Ya'fur, and he said: \"Seven military expeditions.\"He said: There are narrations on this topic from Ibn 'Umar and Jabir.He said: This Hadith is Hasan Sahih. Abu Yu'fur's name is Waqid. They also call him Waqdan. There is another Abu Ya'fur whose name is 'Adbur-Rahman bin 'Ubaid bin Nistas.",
      "chain": [
        "30242",
        "20005",
        "5115"
      ]
    },
    {
      "hadith_no": "1822",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو أحمد، والمؤمل، قالا حدثنا سفيان، عن أبي يعفور، عن ابن أبي أوفى، قال غزونا مع رسول الله صلى الله عليه وسلم سبع غزوات نأكل الجراد ‏.‏  قال أبو عيسى وروى شعبة، هذا الحديث عن أبي يعفور، عن ابن أبي أوفى، قال غزوت مع رسول الله صلى الله عليه وسلم غزوات نأكل الجراد ‏.‏ حدثنا بذلك محمد بن بشار حدثنا محمد بن جعفر حدثنا شعبة بهذا ‏.‏",
      "text_en": " Narrated Abu Ya'fur:                     That Ibn Abi Awfa said: \"We participated in seven military expeditions with the Messenger of Allah (ﷺ), (and) we ate locust.\"[Abu 'Eisa said:] Shu'bah reported this Hadith from Abu Ya'fur, from Ibn Awfa and said: \"We participated in military expeditions with the Messenger of Allah (ﷺ) (and) we ate locust.\"This was narrated to us by Muhammad bin Bash-shar (who said): \"Muhammad bin Ja'far narrated to us from Shu'bah.\"",
      "chain": [
        "30277",
        "20355",
        "20012",
        "11403",
        "5115"
      ]
    },
    {
      "hadith_no": "3547",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا أحمد بن إبراهيم الدورقي، حدثنا عمر بن حفص بن غياث، حدثنا أبي، عن الحسن بن عبيد الله، عن عطاء بن السائب، عن عبد الله بن أبي أوفى، قال كان رسول الله صلى الله عليه وسلم يقول ‏\"‏ اللهم برد قلبي بالثلج والبرد والماء البارد اللهم نق قلبي من الخطايا كما نقيت الثوب الأبيض من الدنس ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏",
      "text_en": " Abdullah bin [Abi] Awfa narrated that the Messenger of Allah used to say:                     “O Allah, cool my heart with snow and hail and cold water. O Allah, cleanse my heart of sins as You cleanse a white garment of filth (Allahumma Barrid Qalbi Bith-Thalji Wal-Baradi Wal-Ma’il-Barid. Allahumma Naqqi Qalbi Min Al-Khataya Kama Naqaitath-Thawbal-Abyada Min Ad-Dannas).”",
      "chain": [
        "30494",
        "30204",
        "20317",
        "10755",
        "11068",
        "5115"
      ]
    },
    {
      "hadith_no": "402",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Ghusl and Tayammum - كتاب الغسل والتيمم",
      "chapter_no": "4",
      "text_ar": "أخبرنا محمد بن إبراهيم، قال حدثنا بشر بن المفضل، قال حدثنا شعبة، عن مجزأة بن زاهر، أنه سمع عبد الله بن أبي أوفى، يحدث عن النبي صلى الله عليه وسلم أنه كان يدعو ‏‏\"‏‏ اللهم طهرني من الذنوب والخطايا اللهم نقني منها كما ينقى الثوب الأبيض من الدنس اللهم طهرني بالثلج والبرد والماء البارد ‏‏\"‏‏ ‏‏.‏‏",
      "text_en": " 'Abdullah bin Abi Awfa narrated that the Prophet (ﷺ) would supplicate:                      \"Allahumma tahhirni min adh-dhunub wal-khataya. Allahumma naqqini minha kama yunaqqa ath-thawb al-abyad min ad-danas, Allahumma tahhirni bith-thalji wal-barad wal-ma' al-barid (O Allah, purify me of sin and error, O Allah cleanse me of it as a white garment is cleansed of dirt, O Allah purify me with snow and hail and cold water).\"",
      "chain": [
        "11213",
        "20212",
        "20020",
        "11650",
        "5115"
      ]
    },
    {
      "hadith_no": "403",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Ghusl and Tayammum - كتاب الغسل والتيمم",
      "chapter_no": "4",
      "text_ar": "أخبرنا محمد بن يحيى بن محمد، حدثنا محمد بن موسى، قال حدثنا إبراهيم بن يزيد، عن رقبة، عن مجزأة الأسلمي، عن ابن أبي أوفى، قال كان النبي صلى الله عليه وسلم يقول ‏‏\"‏‏ اللهم طهرني بالثلج والبرد والماء البارد اللهم طهرني من الذنوب كما يطهر الثوب الأبيض من الدنس ‏‏\"‏‏ ‏‏.‏‏",
      "text_en": " It was narrated that Ibn Abi Awfa said:                      \"The Prophet (ﷺ) used to say: 'Allahumma tahhirni bith-thalji wal-barad wal-ma' al-barid, Allahumma tahhirni min adh-dhunub kama yutahhar ath-thawb al-abyad min ad-danas (O Allah, purify me with snow and hail and cold water, O Allah, purify me of sin as a white garment is cleansed of dirt).\"",
      "chain": [
        "11222",
        "11322",
        "5115"
      ]
    },
    {
      "hadith_no": "924",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا يوسف بن عيسى، ومحمود بن غيلان، عن الفضل بن موسى، قال حدثنا مسعر، عن إبراهيم السكسكي، عن ابن أبي أوفى، قال جاء رجل إلى النبي صلى الله عليه وسلم فقال إني لا أستطيع أن آخذ شيئا من القرآن فعلمني شيئا يجزئني من القرآن ‏.‏ فقال ‏\"‏ قل سبحان الله والحمد لله ولا إله إلا الله والله أكبر ولا حول ولا قوة إلا بالله ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn Abi Awfa said:                     \"A man came to the Prophet (ﷺ) and said: 'I cannot learn anything of the Quran; teach me something that I can say instead of reciting the Quran.' He said: 'Say: SubhanAllah, wal-hamdulilah, wa la illaha ill-Allah, wa Allahu Akbar, wa la hawla wa la quwwata illa Billahil-aliy al-azim (Glory be to Allah, praise be to Allah, there is none worthy of worship except Allah, Allah is Most Great, and there is no power and no strength except with Allah the Exalted and Magnificent ).'\"",
      "chain": [
        "30401",
        "30277",
        "20452",
        "20359",
        "5115"
      ]
    },
    {
      "hadith_no": "Grade",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرنا محمد بن عبد العزيز بن غزوان، قال أنبأنا الفضل بن موسى، عن الحسين بن واقد، قال حدثني يحيى بن عقيل، قال سمعت عبد الله بن أبي أوفى، يقول كان رسول الله صلى الله عليه وسلم يكثر الذكر ويقل اللغو ويطيل الصلاة ويقصر الخطبة ولا يأنف أن يمشي مع الأرملة والمسكين فيقضي له الحاجة ‏.‏",
      "text_en": " 'Abdullah bin Abi Awfa said:                     \"The Messenger of Allah (ﷺ) used to recite a great deal of remembrance, engage little in idle talk, make the prayer long and keep the khutbah short, and he would not refrain from walking with a widow or poor person and tending to their needs.\"",
      "chain": [
        "20452",
        "20648",
        "10726",
        "5115"
      ]
    },
    {
      "hadith_no": "2459",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا عمرو بن يزيد، قال حدثنا بهز بن أسد، قال حدثنا شعبة، قال عمرو بن مرة أخبرني قال سمعت عبد الله بن أبي أوفى، قال كان رسول الله صلى الله عليه وسلم إذا أتاه قوم بصدقتهم قال ‏\"‏ اللهم صل على آل فلان ‏\"‏ ‏.‏ فأتاه أبي بصدقته فقال ‏\"‏ اللهم صل على آل أبي أوفى ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Abi Awfa said:                     \"When people brought their Zakah to him, the Messenger of Allah would say: 'O Allah, send salah upon the family of so-and-so,' My father brought his Sadaqah to him and he said: 'O Allah, send Salah upon the family of Abu Awfa.\"'",
      "chain": [
        "20214",
        "20020",
        "11381",
        "5115"
      ]
    },
    {
      "hadith_no": "4339",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا محمد بن عبد الله بن يزيد المقرئ، قال حدثنا سفيان، عن أبي إسحاق الشيباني، عن عبد الله بن أبي أوفى، قال أصبنا يوم خيبر حمرا خارجا من القرية فطبخناها فنادى منادي النبي صلى الله عليه وسلم إن رسول الله صلى الله عليه وسلم قد حرم لحوم الحمر فأكفئوا القدور بما فيها ‏.‏ فأكفأناها ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Awfa said:                     \"On the Day of khaiber we caught some donkeys outside the village and we cooked them. Then the caller of the Prophet called out: 'The Messenger of Allah has forbidden the flesh of donkeys, so turn over your cooking pots with whatever is in them.' So we turned them over.\"",
      "chain": [
        "20012",
        "11352",
        "5115"
      ]
    },
    {
      "hadith_no": "4356",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا حميد بن مسعدة، عن سفيان، - وهو ابن حبيب - عن شعبة، عن أبي يعفور، سمع عبد الله بن أبي أوفى، قال غزونا مع رسول الله صلى الله عليه وسلم سبع غزوات فكنا نأكل الجراد ‏.‏",
      "text_en": " It was narrated from Abu Ya fur that he heard 'Abdullah bin Abi Awfa says:                     \"We went on seven campaigns with the Messenger of Allah and we used to eat locusts.\"",
      "chain": [
        "30430",
        "20711",
        "20020",
        "11403",
        "5115"
      ]
    },
    {
      "hadith_no": "4357",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا قتيبة، عن سفيان، - وهو ابن عيينة - عن أبي يعفور، قال سألت عبد الله بن أبي أوفى عن قتل الجراد، فقال غزوت مع رسول الله صلى الله عليه وسلم ست غزوات نأكل الجراد ‏.‏",
      "text_en": " It was narrated that Abuy ya fur said:                     \"I asked 'Abdullah bin Abu Awfa about killing locusts and he said: I went on six campaigns with the Messenger of Allah hand we ate locusts.\"",
      "chain": [
        "30367",
        "20005",
        "11403",
        "5115"
      ]
    },
    {
      "hadith_no": "4614",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا يحيى، عن شعبة، عن عبد الله بن أبي المجالد، قال سألت ابن أبي أوفى عن السلف، قال كنا نسلف على عهد رسول الله صلى الله عليه وسلم وأبي بكر وعمر في البر والشعير والتمر إلى قوم لا أدري أعندهم أم لا ‏.‏ وابن أبزى قال مثل ذلك ‏.‏",
      "text_en": " It was narrated that 'Abdullah Ibn Abi Awfa about paying in advance. He said:                     'We used to pay in advance during the time of the Messenger of Allah and Abu Bakr and 'Umar, for wheat, barley and dates, paying people whom we did not know if they had those things or not.'''Ibn Abza said meaning, similarly.",
      "chain": [
        "30359",
        "20031",
        "20020",
        "11701",
        "5115"
      ]
    },
    {
      "hadith_no": "5621",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا محمود بن غيلان، قال حدثنا أبو داود، قال أنبأنا شعبة، عن الشيباني، قال سمعت ابن أبي أوفى، يقول نهى رسول الله صلى الله عليه وسلم عن نبيذ الجر الأخضر ‏.‏ قلت فالأبيض قال لا أدري ‏.‏",
      "text_en": " It was narrated that Ash-Shaibani said:                     \"I heard Ibn Abi Awfa say: 'The Messenger of Allah [SAW] forbade Nabidh made in green earthenware jars.' I said: 'And white ones?' He said: 'I do not know.'\"",
      "chain": [
        "30277",
        "20547",
        "20020",
        "11352",
        "5115"
      ]
    },
    {
      "hadith_no": "5622",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا أبو عبد الرحمن، قال أنبأنا محمد بن منصور، قال حدثنا سفيان، قال حدثنا أبو إسحاق الشيباني، قال سمعت ابن أبي أوفى، يقول نهى رسول الله صلى الله عليه وسلم عن نبيذ الجر الأخضر والأبيض ‏.‏",
      "text_en": " Abu Ishaq Ash-Shaibani said:                     \"I heard Ibn Abi Awfa say: 'The Messenger of Allah [SAW] forbade Nabidh made in green and white earthenware jars.'\"",
      "chain": [
        "36658",
        "20005",
        "11352",
        "5115"
      ]
    },
    {
      "hadith_no": "178",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا إسحاق الأزرق، عن الأعمش، عن ابن أبي أوفى، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ الخوارج كلاب النار ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn Awfa said:                     \"The Messenger of Allah said: 'The Khawarij are the dogs of Hell.'\"",
      "chain": [
        "30201",
        "20411",
        "11060",
        "5115"
      ]
    },
    {
      "hadith_no": "451",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا سفيان بن وكيع، حدثنا عيسى بن يونس، عن فائد أبي الورقاء بن عبد الرحمن، عن عبد الله بن أبي أوفى، قال رأيت رسول الله  صلى الله عليه وسلم  توضأ ثلاثا ثلاثا ومسح رأسه مرة ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Awfa said:                     \"I saw the Messenger of Allah performing ablution, washing each part three times, and wiping his head once.\"",
      "chain": [
        "35047",
        "20347",
        "15446",
        "5115"
      ]
    },
    {
      "hadith_no": "927",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا وكيع، حدثنا الأعمش، عن عبيد بن الحسن، عن ابن أبي أوفى، قال كان النبي  صلى الله عليه وسلم  إذا رفع رأسه من الركوع قال ‏\"‏ سمع الله لمن حمده اللهم ربنا لك الحمد ملء السموات وملء الأرض وملء ما شئت من شىء بعد ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Ibn Abu Awfa said:                      “When the Messenger of Allah(ﷺ)raised his head from Ruku’, he said: ‘Sami’ Allahu limanhamidah, Allahumma, Rabbana lakal-hamd, mil’ as-samawati wa mil’al-ard wa mil’ ma shi’ta min shay’in ba’d (Allah hears thosewho praiseHim. O Allah! O our Lord, to You is the praise as much asfills theheavens, as much as fills the earth and as much as You willafterthat).’”",
      "chain": [
        "30212",
        "20032",
        "11060",
        "10796",
        "5115"
      ]
    },
    {
      "hadith_no": "1455",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بشر، بكر بن خلف حدثنا سلمة بن رجاء، حدثتني شعثاء، عن عبد الله بن أبي أوفى، أن رسول الله  صلى الله عليه وسلم  صلى يوم بشر برأس أبي جهل ركعتين ‏.‏",
      "text_en": " It wasnarrated from ‘Abdullah bin Abu Awfa that the Messenger ofAllah(ﷺ) prayed two Rak’ah on the day when he was given the gladtidings of the head (death) of Abu Jahl.",
      "chain": [
        "34043",
        "20325",
        "5115"
      ]
    },
    {
      "hadith_no": "1660",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا هشام بن عمار، حدثنا سفيان، عن إبراهيم الهجري، عن ابن أبي أوفى، قال نهى رسول الله  صلى الله عليه وسلم  عن المراثي ‏.‏",
      "text_en": " It wasnarrated that Ibn Abi Awfa said:                      “The Messenger of Allah (ﷺ)forbade eulogies.”",
      "chain": [
        "30288",
        "20012",
        "18010",
        "5115"
      ]
    },
    {
      "hadith_no": "1868",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters Regarding Zakat - كتاب الزكاة",
      "chapter_no": "8",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، عن شعبة، عن عمرو بن مرة، قال سمعت عبد الله بن أبي أوفى، يقول كان رسول الله  صلى الله عليه وسلم  إذا أتاه الرجل بصدقة ماله صلى عليه فأتيته بصدقة مالي فقال ‏\"‏ اللهم صل على آل أبي أوفى ‏\"‏ ‏.‏",
      "text_en": " Abdullah bin Abu Awfa said:                     “Whenever a man brought Sadaqah to the Messenger of Allah, he would bless him. I brought him the Sadaqah of my wealth and he said: 'Allhumma, salli ala ali abi awfa(O Allah! Send blessing upon the family of Abu Awfa).' ”",
      "chain": [
        "38409",
        "20032",
        "20020",
        "11381",
        "5115"
      ]
    },
    {
      "hadith_no": "1926",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا أزهر بن مروان، حدثنا حماد بن زيد، عن أيوب، عن القاسم الشيباني، عن عبد الله بن أبي أوفى، قال لما قدم معاذ من الشام سجد للنبي  صلى الله عليه وسلم  قال ‏\"‏ ما هذا يا معاذ ‏\"‏ ‏.‏ قال أتيت الشام فوافقتهم يسجدون لأساقفتهم وبطارقتهم فوددت في نفسي أن نفعل ذلك بك ‏.‏ فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ فلا تفعلوا فإني لو كنت آمرا أحدا أن يسجد لغير الله لأمرت المرأة أن تسجد لزوجها والذي نفس محمد بيده لا تؤدي المرأة حق ربها حتى تؤدي حق زوجها ولو سألها نفسها وهي على قتب لم تمنعه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that:                     Abdullah bin Abu Awfa said” When Muadh bin Jabal came from Sham, he prostrated to the Prophet who said: 'What is this, O Muadh?' He said: 'I went to Sham and saw them prostrating their bishops and patricians and I wanted to do that for you.' The messenger of Allah said: 'Do not do that. If I were to command anyone to prostrate to anyone other than Allah, I would have commanded women to prostrate to their husbands. By the one in who hand is the soul of Muhammad! No woman can fulfill her duty towards Allah until she fulfills her duty towards her husband. If he asks her (for intimacy) even if she is on her camel saddle, she should not refuse.' “",
      "chain": [
        "38091",
        "20022",
        "11015",
        "5115"
      ]
    },
    {
      "hadith_no": "2312",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Rulings - كتاب الأحكام",
      "chapter_no": "13",
      "text_ar": "حدثنا أحمد بن سنان، حدثنا محمد بن بلال، عن عمران القطان، عن حسين، - يعني ابن عمران - عن أبي إسحاق الشيباني، عن عبد الله بن أبي أوفى، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله مع القاضي ما لم يجر فإذا جار وكله إلى نفسه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin Abu Awfa that the Messenger of Allah (ﷺ) said:                     “Allah is with the judge so long as he is not unjust, but if he rules unjustly, He entrusts him to himself.”",
      "chain": [
        "30297",
        "24388",
        "20718",
        "11352",
        "5115"
      ]
    },
    {
      "hadith_no": "2902",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا يعلى بن عبيد، حدثني إسماعيل بن أبي خالد، سمعت عبد الله بن أبي أوفى، يقول دعا رسول الله صلى الله عليه وسلم على الأحزاب فقال ‏\"‏ اللهم منزل الكتاب سريع الحساب اهزم الأحزاب اللهم اهزمهم وزلزلهم ‏\"‏ ‏.‏",
      "text_en": " Isma’ilbin Abu Khalid said:                      “I heard ‘Abdullah bin Abu Awfa say:‘TheMessenger of Allah (ﷺ) supplicated to Allah against theConfederates (Al-Ahzab) and said: ‘O Allah, Who has sent down theBookand is Swift in bringing to account, destroy the Confederates. OAllah, destroy them and shake them.’”",
      "chain": [
        "30212",
        "20372",
        "11418",
        "5115"
      ]
    },
    {
      "hadith_no": "3104",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا يعلى، حدثنا إسماعيل، سمعت عبد الله بن أبي أوفى، يقول كنا مع رسول الله  صلى الله عليه وسلم  حين اعتمر فطاف وطفنا معه وصلى وصلينا معه وكنا نستره من أهل مكة لا يصيبه أحد بشىء ‏.‏",
      "text_en": " Isma’ilnarrated:                      “I heard ‘Abdullah bin Abu Awfa say: ‘We were withthe Messenger of Allah (ﷺ) when he performed ‘Umrah. He performedTawaf (around the Ka’bah) and we performed Tawaf with him. Heprayedand we prayed with him, and we were shielding him from thepeople ofMakkah lest anyone harm him.’”",
      "chain": [
        "30212",
        "20372",
        "11418",
        "5115"
      ]
    },
    {
      "hadith_no": "3313",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Slaughtering - كتاب الذبائح",
      "chapter_no": "27",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا علي بن مسهر، عن أبي إسحاق الشيباني، قال سألت عبد الله بن أبي أوفى عن لحوم الحمر الأهلية، فقال أصابتنا مجاعة يوم خيبر ونحن مع النبي  صلى الله عليه وسلم  وقد أصاب القوم حمرا خارجا من المدينة فنحرناها وإن قدورنا لتغلي إذ نادى منادي النبي  صلى الله عليه وسلم  أن اكفئوا القدور ولا تطعموا من لحوم الحمر شيئا ‏.‏ فأكفأناها ‏.‏ فقلت لعبد الله بن أبي أوفى حرمها تحريما قال تحدثنا أنما حرمها رسول الله  صلى الله عليه وسلم  ألبتة من أجل أنها تأكل العذرة ‏.‏",
      "text_en": " It wasnarrated that Abu Ishaq Shaibani said:                      “I asked ‘Abdullah binAbuAwfa about the flesh of domesticated donkeys and he said: ‘We werestarving on the Day of Khaibar, when we were with the Prophet (ﷺ).The people had gotten some donkeys as spoils of war on the way outfrom Al-Madinah, so we slaughtered them and our cooking pots wereboiling when the caller of the Messenger of Allah (ﷺ) cried out,telling us to overturn out pots and not to eat anything of the fleshof donkeys. So we overturned them.’ I said to ‘Abdullah bin AbuAwfa:‘Was it made unlawful?’ He said: ‘We think that theMessenger of Allah(ﷺ) forbade it altogether because it eatsexcrement.’”",
      "chain": [
        "30547",
        "20345",
        "11352",
        "5115"
      ]
    }
  ],
  "total_hadiths": 84
}