{
  "id": "5127",
  "name": "'Abdullah bin Sa'd ( عبد الله بن سعد الأنصاري ( رضي الله عنه",
  "full_name": "'Abdullah bin Sa'd ( عبد الله بن سعد الأنصاري ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medina"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina",
      "Damascus"
    ],
    "area_of_interest": [
      "Narrator [ د  ت  ق  -  صحابي ]"
    ],
    "tags": [
      "Ansar",
      "Quraish",
      "B. Azd"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "3656",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Knowledge (Kitab Al-Ilm) - كتاب العلم",
      "chapter_no": "26",
      "text_ar": "حدثنا إبراهيم بن موسى الرازي، حدثنا عيسى، عن الأوزاعي، عن عبد الله بن سعد، عن الصنابحي، عن معاوية، أن النبي صلى الله عليه وسلم نهى عن الغلوطات ‏.‏",
      "text_en": " Narrated Mu'awiyah:                     The Holy Prophet (ﷺ) forbade the discussion of thorny  questions.",
      "chain": [
        "30309",
        "20347",
        "20024",
        "5127",
        "5144",
        "27"
      ]
    },
    {
      "hadith_no": "133",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا عباس العنبري، ومحمد بن عبد الأعلى، قالا حدثنا عبد الرحمن بن مهدي، حدثنا معاوية بن صالح، عن العلاء بن الحارث، عن حرام بن معاوية، عن عمه عبد الله بن سعد، قال سألت النبي صلى الله عليه وسلم عن مواكلة الحائض فقال ‏\"‏ واكلها ‏\"‏ ‏.‏ قال وفي الباب عن عائشة وأنس ‏.‏ قال أبو عيسى حديث عبد الله بن سعد حديث حسن غريب ‏.‏ وهو قول عامة أهل العلم لم يروا بمواكلة الحائض بأسا ‏.‏ واختلفوا في فضل وضوئها فرخص في ذلك بعضهم وكره بعضهم فضل طهورها ‏.‏",
      "text_en": " Abdullah bin Sa'd narrated:                     I asked the Prophet about eating with a menstruating woman. He said: \"Eat with her.\"",
      "chain": [
        "30437",
        "30449",
        "20033",
        "20675",
        "10884",
        "5127"
      ]
    },
    {
      "hadith_no": "695",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بشر، بكر بن خلف حدثنا عبد الرحمن بن مهدي، عن معاوية بن صالح، عن العلاء بن الحارث، عن حرام بن حكيم، عن عمه عبد الله بن سعد، قال سألت رسول الله  صلى الله عليه وسلم  عن مواكلة الحائض فقال ‏\"‏ واكلها ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Sa'd said:                     \"I asked the Messenger of Allah about eating with a menstruating woman and he said: 'Eat with her.'\"",
      "chain": [
        "34043",
        "20033",
        "20675",
        "10884",
        "5127"
      ]
    },
    {
      "hadith_no": "1441",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بشر، بكر بن خلف حدثنا عبد الرحمن بن مهدي، عن معاوية بن صالح، عن العلاء بن الحارث، عن حرام بن معاوية، عن عمه عبد الله بن سعد، قال سألت رسول الله  صلى الله عليه وسلم  أيما أفضل الصلاة في بيتي أو الصلاة في المسجد قال ‏\"‏ ألا ترى إلى بيتي ما أقربه من المسجد فلأن أصلي في بيتي أحب إلى من أن أصلي في المسجد إلا أن تكون صلاة مكتوبة ‏\"‏ ‏.‏",
      "text_en": " ‘Abdullah bin Sa’d said:                      “I asked the Messenger of Allah (ﷺ):‘Which is better prayer in my house or prayer in the mosque?’ Hesaid:‘Do you not see how close my house is to the mosque?’ Butpraying inmy house is dearer to me than praying in the mosque, apartfrom theprescribed prayers.’”",
      "chain": [
        "34043",
        "20033",
        "20675",
        "10884",
        "5127"
      ]
    }
  ],
  "total_hadiths": 4
}