{
  "id": "5136",
  "name": "'Abdullah bin al-Dayli ( عبد الله بن فيروز الديلمي ( رضي الله عنه",
  "full_name": "'Abdullah bin al-Dayli ( عبد الله بن فيروز الديلمي ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Hijaz",
      "Palestine",
      " Egypt"
    ],
    "area_of_interest": [
      "Narrator [ د  س  ق  -  صحابة ]"
    ],
    "tags": [
      "al-Dayli"
    ]
  },
  "parents": [
    {
      "id": "5229",
      "name": "Fyrwz al-Dylmy ( فيروز الديلمي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "18453",
      "name": "al-Dhak bin Fyrwz al-Dylmy الضحاك بن فيروز الديلمي",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "5229",
      "name": "Fyrwz al-Dylmy ( فيروز الديلمي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "39",
      "name": "Ubayy ibn Ka'b ( أبي بن كعب بن قيس ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "49",
      "name": "Zayd ibn Thabit ( زيد بن ثابت بن الضحاك بن زيد ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "16",
      "name": "ibn Mas'ud ( عبد الله بن مسعود ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "145",
      "name": "Hudhayfah ibn al-Yaman ( حذيفة بن اليمان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "29",
      "name": "'Abdullah bin 'Amr bin al-'Aas ( عبد الله بن عمرو بن العاص ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "897",
      "name": "Ya'la bin Umayya ( يعلى بن أمية ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11414",
      "name": "Rabi'a bin Yazid al-Damashqi ربيعة بن يزيد الدمشقي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11027",
      "name": "Abu Idrees al-Khulani أبو إدريس الخولاني",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "18724",
      "name": "'Urwa bin Ruwaym al-Lakhmi عروة بن رويم عروة بن روىم",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20299",
      "name": "Wahayb bin Khalid bin 'Ajlan al-Bahli وهيب بن خالد بن عجلان الباهلي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "19154",
      "name": "Yahya bin Abi 'Amr يحيى بن أبي عمرو السيباني",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "39",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا حيوة بن شريح الحمصي، حدثنا ابن عياش، عن يحيى بن أبي عمرو السيباني، عن عبد الله بن الديلمي، عن عبد الله بن مسعود، قال قدم وفد الجن على رسول الله صلى الله عليه وسلم فقالوا يا محمد انه أمتك أن يستنجوا بعظم أو روثة أو حممة فإن الله تعالى جعل لنا فيها رزقا ‏.‏ قال فنهى النبي صلى الله عليه وسلم عن ذلك ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     A deputation of the jinn came to the Prophet (ﷺ) and said: O Muhammad, forbid your community to cleans themselves with a bone or dung or charcoal, for in them Allah has provided sustenance for us.  So the Prophet (ﷺ) forbade them to do so.",
      "chain": [
        "26010",
        "19154",
        "5136",
        "16"
      ]
    },
    {
      "hadith_no": "2527",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عبد الله بن وهب، أخبرني عاصم بن حكيم، عن يحيى بن أبي عمرو السيباني، عن عبد الله بن الديلمي، أن يعلى بن منية، قال ‏:‏ آذن رسول الله صلى الله عليه وسلم بالغزو وأنا شيخ كبير ليس لي خادم، فالتمست أجيرا يكفيني وأجري له سهمه، فوجدت رجلا، فلما دنا الرحيل أتاني فقال ‏:‏ ما أدري ما السهمان وما يبلغ سهمي فسم لي شيئا كان السهم أو لم يكن ‏.‏ فسميت له ثلاثة دنانير، فلما حضرت غنيمته أردت أن أجري له سهمه، فذكرت الدنانير، فجئت النبي صلى الله عليه وسلم فذكرت له أمره، فقال ‏:‏ ‏\"‏ ما أجد له في غزوته هذه في الدنيا والآخرة إلا دنانيره التي سمى ‏\"‏ ‏.‏",
      "text_en": " Narrated Ya'la ibn Munyah:                     The Messenger of Allah (ﷺ) announced an expedition, and I was a very old man and I had no servant. I, therefore, sought a hireling who would serve instead of me, and I would give him his portion. So I found a man. When the time of departure arrived, he came to me and said: I do not know what would be the portions, and how much would be my portion. So offer something (as wages) to me, whether there would be any portion or not. I offered three dinars (as his wages) for him. When some booty arrived, I wanted to offer him his portion. But I remembered the dinars, so I went to the Prophet (ﷺ) and mentioned the matter to him. He said: All I can find for him regarding this expedition of his in this world and the next is three dinars which were offered him.",
      "chain": [
        "30226",
        "20029",
        "28258",
        "19154",
        "5136"
      ]
    },
    {
      "hadith_no": "3710",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Drinks (Kitab Al-Ashribah) - كتاب الأشربة",
      "chapter_no": "27",
      "text_ar": "حدثنا عيسى بن محمد، حدثنا ضمرة، عن السيباني، عن عبد الله بن الديلمي، عن أبيه، قال أتينا رسول الله صلى الله عليه وسلم فقلنا يا رسول الله قد علمت من نحن ومن أين نحن فإلى من نحن قال ‏\"‏ إلى الله وإلى رسوله ‏\"‏ ‏.‏ فقلنا يا رسول الله إن لنا أعنابا ما نصنع بها قال ‏\"‏ زببوها ‏\"‏ ‏.‏ قلنا ما نصنع بالزبيب قال ‏\"‏ انبذوه على غدائكم واشربوه على عشائكم وانبذوه على عشائكم واشربوه على غدائكم وانبذوه في الشنان ولا تنبذوه في القلل فإنه إذا تأخر عن عصره صار خلا ‏\"‏ ‏.‏",
      "text_en": " Narrated Ad-Daylami:                     We came to the Prophet (ﷺ) and said to him: Messenger of Allah, you know who we are, from where we are and to whom we have come. He said: To Allah and His Apostle. We said: Messenger of Allah, we have grapes; what should we do with them? He said: Make them raisins. We then asked: What should we do with raisins? He replied: Steep them in the morning and drink in the evening, and steep them in the evening and drink in the morning. Steep them in skin vessels and do not steep them in earthen jar, for it it is delayed in pressing, it becomes vinegar.",
      "chain": [
        "20738",
        "19340",
        "5136",
        "5229"
      ]
    },
    {
      "hadith_no": "4699",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، عن أبي سنان، عن وهب بن خالد الحمصي، عن ابن الديلمي، قال أتيت أبى بن كعب فقلت له وقع في نفسي شىء من القدر فحدثني بشىء لعل الله أن يذهبه من قلبي ‏.‏ فقال لو أن الله عذب أهل سمواته وأهل أرضه عذبهم وهو غير ظالم لهم ولو رحمهم كانت رحمته خيرا لهم من أعمالهم ولو أنفقت مثل أحد ذهبا في سبيل الله ما قبله الله منك حتى تؤمن بالقدر وتعلم أن ما أصابك لم يكن ليخطئك وأن ما أخطأك لم يكن ليصيبك ولو مت على غير هذا لدخلت النار ‏.‏ قال ثم أتيت عبد الله بن مسعود فقال مثل ذلك - قال - ثم أتيت حذيفة بن اليمان فقال مثل ذلك - قال - ثم أتيت زيد بن ثابت فحدثني عن النبي صلى الله عليه وسلم مثل ذلك ‏.‏",
      "text_en": " Ibn al-Dailami said :                      I went to Ubayy b. Ka’b and said him : I am confused about Divine decree, so tell me something by means of which Allah may remove the confusion from my mind. He replied : were Allah to punish everyone in the heavens and in the earth. He would do so without being unjust to them, and were he to show mercy to them his mercy would be much better than their actions merited. Were you to spend in support of Allah’s cause an amount of gold equivalent to Uhud, Allah would not accept it from you till you believed in divine decree and knew that what has come to you could not miss you and that what has missed you could not come to you. Were you to die believing anything else you would enter Hell. He said : I then went to ‘Abd Allah b. MAs’ud and he said something to the same effect. I next went to Hudhaifah b. al-Yaman and he said something to the same effect. I next went to Zaid b. Thabit who told me something from the Prophet (May peace be upon him) to the same effect.",
      "chain": [
        "28531",
        "20012",
        "28625",
        "5136"
      ]
    },
    {
      "hadith_no": "2642",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Faith - كتاب الإيمان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "40",
      "text_ar": "حدثنا الحسن بن عرفة، حدثنا إسماعيل بن عياش، عن يحيى بن أبي عمرو السيباني، عن عبد الله بن الديلمي، قال سمعت عبد الله بن عمرو، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن الله عز وجل خلق خلقه في ظلمة فألقى عليهم من نوره فمن أصابه من ذلك النور اهتدى ومن أخطأه ضل فلذلك أقول جف القلم على علم الله ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏",
      "text_en": " Narrated 'Abdullah bin 'Amr:                     that the Messenger of Allah (ﷺ) said: \"Indeed Allah, the Blessed and Exalted, created His creation in darkness, then He cast His Light upon them, so whoever is touched by that light he is guided, and whoever is not, he goes astray. It is for this reason that I say that the pens have dried with Allah's knowledge.\"",
      "chain": [
        "36540",
        "20736",
        "19154",
        "5136",
        "29"
      ]
    },
    {
      "hadith_no": "693",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Masjids - كتاب المساجد",
      "chapter_no": "8",
      "text_ar": "أخبرنا عمرو بن منصور، قال حدثنا أبو مسهر، قال حدثنا سعيد بن عبد العزيز، عن ربيعة بن يزيد، عن أبي إدريس الخولاني، عن ابن الديلمي، عن عبد الله بن عمرو، عن رسول الله صلى الله عليه وسلم ‏\"‏ أن سليمان بن داود صلى الله عليه وسلم لما بنى بيت المقدس سأل الله عز وجل خلالا ثلاثة سأل الله عز وجل حكما يصادف حكمه فأوتيه وسأل الله عز وجل ملكا لا ينبغي لأحد من بعده فأوتيه وسأل الله عز وجل حين فرغ من بناء المسجد أن لا يأتيه أحد لا ينهزه إلا الصلاة فيه أن يخرجه من خطيئته كيوم ولدته أمه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin 'Amr that the Messenger of Allah (ﷺ) said:                      \"When Sulaiman bin Dawud finished building BAir Al-Maqdis, he asked Allah for three things: Judgement that was in harmony with His judgement, and he was given that. And he asked Allah for a dominion that no one after him would have, and he was given that. And when he finished building the Masjid he asked Allah, the Mighty and Sublime, that no one should come to it, intending only to pray there, but he would emerge free of sin as the day his mother bore him.\"",
      "chain": [
        "38433",
        "30284",
        "20638",
        "11414",
        "11027",
        "5136",
        "29"
      ]
    },
    {
      "hadith_no": "5670",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا القاسم بن زكريا بن دينار، قال حدثنا معاوية بن عمرو، حدثنا أبو إسحاق، قال حدثنا الأوزاعي، قال حدثني ربيعة بن يزيد، ح وأخبرني عمرو بن عثمان بن سعيد، عن بقية، عن أبي عمرو، - وهو الأوزاعي - عن ربيعة بن يزيد، عن عبد الله بن الديلمي، قال دخلت على عبد الله بن عمرو بن العاص وهو في حائط له بالطائف يقال له الوهط وهو مخاصر فتى من قريش يزن ذلك الفتى بشرب الخمر فقال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من شرب الخمر شربة لم تقبل له توبة أربعين صباحا فإن تاب تاب الله عليه فإن عاد لم تقبل توبته أربعين صباحا فإن تاب تاب الله عليه فإن عاد كان حقا على الله أن يسقيه من طينة الخبال يوم القيامة ‏\"‏ ‏.‏ اللفظ لعمرو ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Ad-Dailami said:                     \"I entered upon 'Abdullah bin 'Amr bin Al-'As when he was in a garden of his in At-Ta'if called Al-Waht. He was walking and holding hands with a young man of Quraish who was suspected of drinking Khamr. He said: 'I heard the Messenger of Allah [SAW] say: Whoever drinks Khamr once, his repentance will not be accepted for 40 days, then if he repents, Allah will accept his repentance. If he does it again, his repentance will not be accepted for 40 days, then if he repents, Allah will accept his repentance. If he does it again, his repentance will not be accepted for 40 days, then if he repents, Allah will accept his repentance. If he does it again (a fourth time), then it is a right upon Allah to make him drink from the mud of Khibal on the Day of Resurrection.\" This is the wording of 'Amr.",
      "chain": [
        "30475",
        "20389",
        "11049",
        "20024",
        "11414",
        "10581",
        "20644",
        "11414",
        "5136"
      ]
    },
    {
      "hadith_no": "5735",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرني عمرو بن عثمان بن سعيد بن كثير، قال حدثنا بقية، قال حدثني الأوزاعي، عن يحيى بن أبي عمرو، عن عبد الله بن الديلمي، عن أبيه، فيروز قال قدمت على رسول الله صلى الله عليه وسلم فقلت يا رسول الله إنا أصحاب كرم وقد أنزل الله عز وجل تحريم الخمر فماذا نصنع قال ‏\"‏ تتخذونه زبيبا ‏\"‏ ‏.‏ قلت فنصنع بالزبيب ماذا قال ‏\"‏ تنقعونه على غدائكم وتشربونه على عشائكم وتنقعونه على عشائكم وتشربونه على غدائكم ‏\"‏ ‏.‏ قلت أفلا نؤخره حتى يشتد قال ‏\"‏ لا تجعلوه في القلل واجعلوه في الشنان فإنه إن تأخر صار خلا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah Ad-Dailami that his father Fairuz said:                     \"I came to the Messenger of Allah [SAW] and said: 'O Messenger of Allah, we have grapevines and Allah, the Mighty and Sublime, has revealed that Khamr (wine) is forbidden, so what should we do?' He said: 'Make raisins.' I said: 'What should we do with the raisins?' He said: 'Soak them in the morning and drink them in the evening, and soak them in the evening and drink them in the morning.' I said: 'Can we leave it until it gets stronger?' He said: 'Do not put it in clay vessels, rather put it in skins, for if it stays there for a long time, it will turn into vinegar.'\"",
      "chain": [
        "38429",
        "20644",
        "20024",
        "5136"
      ]
    },
    {
      "hadith_no": "5736",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا عيسى بن محمد أبو عمير بن النحاس، عن ضمرة، عن الشيباني، عن ابن الديلمي، عن أبيه، قال قلنا يا رسول الله إن لنا أعنابا فماذا نصنع بها قال ‏\"‏ زببوها ‏\"‏ ‏.‏ قلنا فما نصنع بالزبيب قال ‏\"‏ انبذوه على غدائكم واشربوه على عشائكم وانبذوه على عشائكم واشربوه على غدائكم وانبذوه في الشنان ولا تنبذوه في القلال فإنه إن تأخر صار خلا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn Al-Dailami that his father said:                     \"We said: 'O Messenger of Allah, we have grapevines; what should we do with them?' He said: 'Make raisins.' We said: 'What should we do with the raisins?' He said: 'Soak them in the morning and drink them in the evening, and soak them in the evening and drink them in the morning.' I said: 'Can we leave it until it gets stronger?' He said: 'Do not put it in clay vessels, rather put it in skins, for if it stays there for a long time, it will turn into vinegar.'\"",
      "chain": [
        "20738",
        "11352",
        "5136",
        "5229"
      ]
    },
    {
      "hadith_no": "51",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا داود بن سليمان العسكري، حدثنا محمد بن علي أبو هاشم بن أبي خداش الموصلي، قال حدثنا محمد بن محصن، عن إبراهيم بن أبي عبلة، عن عبد الله بن الديلمي، عن حذيفة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا يقبل الله لصاحب بدعة صوما ولا صلاة ولا صدقة ولا حجا ولا عمرة ولا جهادا ولا صرفا ولا عدلا يخرج من الإسلام كما تخرج الشعرة من العجين ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Hudhaifah said:                     \"The Messenger of Allah (ﷺ) said: 'Allah will not accept any fasting, prayer, charity, Hajj, 'Umrah, Jihad, or any other obligatory or voluntary action from a person who follows innovation (Bid'ah). He comes out of Islam like a hair pulled out of dough.\" (Maudu')",
      "chain": [
        "38211",
        "11442",
        "11667",
        "5136",
        "145"
      ]
    },
    {
      "hadith_no": "81",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا علي بن محمد، حدثنا إسحاق بن سليمان، قال سمعت أبا سنان، عن وهب بن خالد الحمصي، عن ابن الديلمي، قال وقع في نفسي شىء من هذا القدر خشيت أن يفسد على ديني وأمري فأتيت أبى بن كعب فقلت أبا المنذر إنه قد وقع في قلبي شىء من هذا القدر فخشيت على ديني وأمري فحدثني من ذلك بشىء لعل الله أن ينفعني به ‏.‏ فقال لو أن الله عذب أهل سمواته وأهل أرضه لعذبهم وهو غير ظالم لهم ولو رحمهم لكانت رحمته خيرا لهم من أعمالهم ‏.‏ ولو كان لك مثل جبل أحد ذهبا أو مثل جبل أحد تنفقه في سبيل الله ما قبل منك حتى تؤمن بالقدر ‏.‏ فتعلم أن ما أصابك لم يكن ليخطئك وأن ما أخطأك لم يكن ليصيبك ‏.‏ وأنك إن مت على غير هذا دخلت النار ولا عليك أن تأتي أخي عبد الله بن مسعود فتسأله ‏.‏ فأتيت عبد الله فسألته فذكر مثل ما قال أبى وقال لي ولا عليك أن تأتي حذيفة ‏.‏ فأتيت حذيفة فسألته فقال مثل ما قالا وقال ائت زيد بن ثابت فاسأله ‏.‏ فأتيت زيد بن ثابت فسألته فقال سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ لو أن الله عذب أهل سمواته وأهل أرضه لعذبهم وهو غير ظالم لهم ولو رحمهم لكانت رحمته خيرا لهم من أعمالهم ولو كان لك مثل أحد ذهبا أو مثل جبل أحد ذهبا تنفقه في سبيل الله ما قبله منك حتى تؤمن بالقدر كله فتعلم أن ما أصابك لم يكن ليخطئك وما أخطأك لم يكن ليصيبك وأنك إن مت على غير هذا دخلت النار ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn Dailami said:                     \"I was confused about this Divine Decree (Qadar), and I was afraid lest that adversely affect my religion and my affairs. So I went to Ubayy bin Ka'b and said: 'O Abu Mundhir! I am confused about the Divine Decree, and I fear for my religion and my affairs, so tell me something about that through which Allah may benefit me.' He said: 'If Allah were to punish the inhabitants of His heavens and of his earth, He would do so and He would not be unjust towards them. And if He were to have mercy on them, His mercy would be better for them than their own deeds. If you had the equivalent of Mount Uhud which you spent in the cause of Allah, that would not be accepted from you until you believed in the Divine Decree and you know that whatever has befallen you, could not have passed you by; and whatever has passed you by, could not have befallen you; and that if you were to die believing anything other than this, you would enter Hell. And it will not harm you to go to my brother, 'Abdullah bin Mas'ud, and ask him (about this).' So I went to 'Abdullah and asked him , and he said something similar to what Ubayy had said, and he told me: 'It will not harm you to go to Hudhaifah.' So I went to Hudhaifah and asked him, and he said something similar to what they had said. And he told me: 'Go to Zaid bin Thabit and ask him.' So I went to Zaid bun Thabit and asked him, and he said: 'I heard the Messenger of Allah (ﷺ) say: \"If Allah were to punish the inhabitants of His heavens and of His earth, he would do so and He would not be unjust towards them. And if He were to have mercy on them, His mercy would be better for them than their own deeds. If you had the equivalent of Mount Uhud which you spent in the cause of Allah, that would not be accepted from you until you believed in the Divine Decree and you know that whatever has befallen you, could not have passed you by; and whatever has passed you by, could not have befallen you; and that if you were to die believing anything other than this, you would enter Hell\"",
      "chain": [
        "38409",
        "20310",
        "28625",
        "5136"
      ]
    },
    {
      "hadith_no": "1473",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا عبيد الله بن الجهم الأنماطي، حدثنا أيوب بن سويد، عن أبي زرعة السيباني، يحيى بن أبي عمرو حدثنا عبد الله بن الديلمي، عن عبد الله بن عمرو، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ لما فرغ سليمان بن داود من بناء بيت المقدس سأل الله ثلاثا حكما يصادف حكمه وملكا لا ينبغي لأحد من بعده وألا يأتي هذا المسجد أحد لا يريد إلا الصلاة فيه إلا خرج من ذنوبه كيوم ولدته أمه ‏\"‏ ‏.‏ فقال النبي  صلى الله عليه وسلم  ‏\"‏ أما اثنتان فقد أعطيهما وأرجو أن يكون قد أعطي الثالثة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Abdullah bin ‘Amr that the Prophet (ﷺ) said:                     “When Sulaiman bin Dawud finished building Baitil-Maqdis, he askedAllah for three things: judgment that was in harmony with Hisjudgment, a dominion that no one after him would have, and that nooneshould come to this mosque, intending only to pray there, but hewouldemerge free of sin as the day his mother bore him.” TheProphet (ﷺ)said: “Two prayers were granted, and I hope that thethird was alsogranted.”",
      "chain": [
        "34144",
        "28053",
        "5136",
        "29"
      ]
    },
    {
      "hadith_no": "3502",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Drinks - كتاب الأشربة",
      "chapter_no": "30",
      "text_ar": "حدثنا عبد الرحمن بن إبراهيم الدمشقي، حدثنا الوليد بن مسلم، حدثنا الأوزاعي، عن ربيعة بن يزيد، عن ابن الديلمي، عن عبد الله بن عمرو، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من شرب الخمر وسكر لم تقبل له صلاة أربعين صباحا وإن مات دخل النار فإن تاب تاب الله عليه وإن عاد فشرب فسكر لم تقبل له صلاة أربعين صباحا فإن مات دخل النار فإن تاب تاب الله عليه وإن عاد فشرب فسكر لم تقبل له صلاة أربعين صباحا فإن مات دخل النار فإن تاب تاب الله عليه وإن عاد كان حقا على الله أن يسقيه من ردغة الخبال يوم القيامة ‏\"‏ ‏.‏ قالوا يا رسول الله وما ردغة الخبال قال ‏\"‏ عصارة أهل النار ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Abdullah bin ‘Amr that the Messenger of Allah(ﷺ) said:                      “Whoever drinks wine and gets drunk, his prayer willnotbe accepted for forty days, and if he dies he will enter Hell,but ifhe repents, Allah will accept his repentance. If he drinkswine againand gets drunk, his prayer will not be accepted for fortydays, and ifhe dies he will enter Hell, but if he repents, Allahwill accept hisrepentance. If he drinks wine again and gets drunk,his prayer willnot be accepted for forty days, and if he dies hewill enter Hell, butif he repents Allah will accept his repentance.But if he does itagain, then Allah will most certainly make himdrink of the mire ofthe puss or sweat on the Day of Resurrection.”They said: “O Messengerof Allah, what is the mire of the pus orsweat? He said: “Thedrippings of the people of Hell.”",
      "chain": [
        "30285",
        "20733",
        "20024",
        "11414",
        "5136",
        "29"
      ]
    }
  ],
  "total_hadiths": 13
}