{
  "id": "5146",
  "name": "'Abdur Rahman bin Hasanh ( عبد الرحمن بن حسنة ( رضي الله عنه",
  "full_name": "'Abdur Rahman bin Hasanh ( عبد الرحمن بن حسنة ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator [ د  س  ق  -  صحابي ]"
    ],
    "tags": []
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "30",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا هناد بن السري، عن أبي معاوية، عن الأعمش، عن زيد بن وهب، عن عبد الرحمن ابن حسنة، قال خرج علينا رسول الله صلى الله عليه وسلم وفي يده كهيئة الدرقة فوضعها ثم جلس خلفها فبال إليها فقال بعض القوم انظروا يبول كما تبول المرأة فسمعه فقال ‏\"‏ أوما علمت ما أصاب صاحب بني إسرائيل كانوا إذا أصابهم شىء من البول قرضوه بالمقاريض فنهاهم صاحبهم فعذب في قبره ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdur-Rahman bin Hasanah said:                      \"The Messenger of Allah (ﷺ) came out to us with a small leather shield in his hand. He put it down, then he sat behind it and urinated toward it. Some of the people said: 'Look, he is urinating like a woman.' He heard that and said: 'Do you not know what happened to the companion of the Children of Israel? If they got any urine on themselves they would clip that part of their garments off. Their companion told them not to do that and he was punished in his grave.'\"",
      "chain": [
        "30480",
        "20354",
        "11060",
        "11341",
        "5146"
      ]
    },
    {
      "hadith_no": "372",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو معاوية، عن الأعمش، عن زيد بن وهب، عن عبد الرحمن ابن حسنة، قال خرج علينا رسول الله  صلى الله عليه وسلم  وفي يده الدرقة فوضعها ثم جلس فبال إليها فقال بعضهم انظروا إليه يبول كما تبول المرأة ‏.‏ فسمعه النبي  صلى الله عليه وسلم  فقال ‏\"‏ ويحك أما علمت ما أصاب صاحب بني إسرائيل كانوا إذا أصابهم البول قرضوه بالمقاريض فنهاهم عن ذلك فعذب في قبره ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdur-Rahman bin Hasanah said:                     \"The Messenger of Allah came out to us holding a small shield in his hand. He put it down, then he sat down and urinated towards it. Some of the people said: 'Look at him, he urinates like a woman!' The Prophet heard that and said: 'Woe to you! Do you not know what happened to one of the children of Israel? If any urine touched any part of their clothes, they would cut that out with scissors. He told them not to do that, so he was tormented in his grave.'\" (Da'if)Another chain with similar wording.",
      "chain": [
        "30201",
        "20354",
        "11060",
        "11341",
        "5146"
      ]
    }
  ],
  "total_hadiths": 2
}