{
  "id": "5172",
  "name": "'Arbad bin Sariyya al-Salmi ( عرباض بن سارية السلمي ( رضي الله عنه",
  "full_name": "'Arbad bin Sariyya al-Salmi ( عرباض بن سارية السلمي ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Hijaz"
    },
    "death": {
      "date_hijri": "75",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Syria",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Hijaz",
      "Hims",
      "Syria"
    ],
    "area_of_interest": [
      "Narrator [ 4  -  صحابي ]"
    ],
    "tags": [
      "al-Salmi",
      "al-Saffa",
      "Hims"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "10",
      "name": "Abu 'Ubaidah ibn al-Jarrah ( أبو عبيدة بن الجراح ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "59",
      "name": "Umm Habibah bint Abi Sufyan ( أم حبيبة ,رملة بنت أبي سفيان ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17046",
      "name": "'Abdur Rahman bin 'Amr bin 'Absa عبد الرحمن بن عمرو بن عبسة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "16037",
      "name": "Sa'id bin Han'i al-Khwlany سعيد بن هانئ الخولاني",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "12036",
      "name": "Jbyr bin Abi Sulaiman جبير بن أبي سليمان بن جبير",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "18164",
      "name": "Hjr bin Hjr حجر بن حجر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "17017",
      "name": "Hkym bin 'Umayr bin al-Ahws حكيم بن عمير بن الأحوص",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "17040",
      "name": "'Abdullah bin Aby عبد الله بن أبي بلال الخزاعي الشامي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "19159",
      "name": "Yahya bin Abi al-Mta' يحيى بن أبي المطاع القرشي الأردني",
      "grade": "Follower(Tabi')"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "2344",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا عمرو بن محمد الناقد، حدثنا حماد بن خالد الخياط، حدثنا معاوية بن صالح، عن يونس بن سيف، عن الحارث بن زياد، عن أبي رهم، عن العرباض بن سارية، قال دعاني رسول الله صلى الله عليه وسلم إلى السحور في رمضان فقال ‏\"‏ هلم إلى الغداء المبارك ‏\"‏ ‏.‏",
      "text_en": " Narrated Al-Irbad ibn Sariyyah:                     The Messenger of Allah (ﷺ) invited me to a meal shortly before dawn in Ramadan saying: Come to the blessed morning meal.",
      "chain": [
        "30263",
        "20537",
        "20675",
        "19199",
        "17011",
        "5172"
      ]
    },
    {
      "hadith_no": "3050",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا أشعث بن شعبة، حدثنا أرطاة بن المنذر، قال سمعت حكيم بن عمير أبا الأحوص، يحدث عن العرباض بن سارية السلمي، قال نزلنا مع النبي صلى الله عليه وسلم خيبر ومعه من معه من أصحابه وكان صاحب خيبر رجلا ماردا منكرا فأقبل إلى النبي صلى الله عليه وسلم فقال يا محمد ألكم أن تذبحوا حمرنا وتأكلوا ثمرنا وتضربوا نساءنا فغضب يعني النبي صلى الله عليه وسلم وقال ‏\"‏ يا ابن عوف اركب فرسك ثم ناد ألا إن الجنة لا تحل إلا لمؤمن وأن اجتمعوا للصلاة ‏\"‏ ‏.‏ قال فاجتمعوا ثم صلى بهم النبي صلى الله عليه وسلم ثم قام فقال ‏\"‏ أيحسب أحدكم متكئا على أريكته قد يظن أن الله لم يحرم شيئا إلا ما في هذا القرآن ألا وإني والله قد وعظت وأمرت ونهيت عن أشياء إنها لمثل القرآن أو أكثر وأن الله عز وجل لم يحل لكم أن تدخلوا بيوت أهل الكتاب إلا بإذن ولا ضرب نسائهم ولا أكل ثمارهم إذا أعطوكم الذي عليهم ‏\"‏ ‏.‏",
      "text_en": " Narrated Al-Irbad ibn Sariyah as-Sulami:                     We alighted with the Prophet (ﷺ) at Khaybar, and he had his companions with him. The chief of Khaybar was a defiant and abominable man.  He came to the Prophet (ﷺ) and said: Is it proper for you, Muhammad, that you slaughter our donkeys, eat our fruit, and beat our women?  The Prophet (ﷺ) became angry and said: Ibn Awf, ride your horse, and call loudly: Beware, Paradise is lawful only for a believer, and that they (the people) should gather for prayer.  They gathered and the Prophet (ﷺ) led them in prayer, stood up and said: Does any of you, while reclining on his couch, imagine that Allah has prohibited only that which is to be found in this Qur'an? By Allah, I have preached, commanded and prohibited various matters as numerous as that which is found in the Qur'an, or more numerous. Allah has not permitted you to enter the houses of the people of the Book without permission, or beat their women, or eat their fruits when they give you that which is imposed on them.",
      "chain": [
        "31167",
        "28050",
        "18017",
        "17017",
        "5172"
      ]
    },
    {
      "hadith_no": "2676",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Knowledge - كتاب العلم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "41",
      "text_ar": "حدثنا علي بن حجر، حدثنا بقية بن الوليد، عن بحير بن سعد، عن خالد بن معدان، عن عبد الرحمن بن عمرو السلمي، عن العرباض بن سارية، قال وعظنا رسول الله صلى الله عليه وسلم يوما بعد صلاة الغداة موعظة بليغة ذرفت منها العيون ووجلت منها القلوب فقال رجل إن هذه موعظة مودع فماذا تعهد إلينا يا رسول الله قال ‏\"‏ أوصيكم بتقوى الله والسمع والطاعة وإن عبد حبشي فإنه من يعش منكم يرى اختلافا كثيرا وإياكم ومحدثات الأمور فإنها ضلالة فمن أدرك ذلك منكم فعليه بسنتي وسنة الخلفاء الراشدين المهديين عضوا عليها بالنواجذ ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏  وقد روى ثور بن يزيد، عن خالد بن معدان، عن عبد الرحمن بن عمرو السلمي، عن العرباض بن سارية، عن النبي صلى الله عليه وسلم نحو هذا ‏.‏ حدثنا بذلك الحسن بن علي الخلال وغير واحد قالوا حدثنا أبو عاصم عن ثور بن يزيد عن خالد بن معدان عن عبد الرحمن بن عمرو السلمي عن العرباض بن سارية عن النبي صلى الله عليه وسلم نحوه والعرباض بن سارية يكنى أبا نجيح ‏.‏ وقد روي هذا الحديث عن حجر بن حجر عن عرباض بن سارية عن النبي صلى الله عليه وسلم نحوه ‏.‏",
      "text_en": " Narrated Al-'Irbad bin Sariyah:                     \"One day after the morning Salat, the Messenger of Allah (ﷺ) exhorted us to the extent that the eyes wept and the hearts shuddered with fear. A man said: 'Indeed this is a farewell exhortation. [So what] do you order us O Messenger of Allah?' He said: 'I order you to have Taqwa of Allah, and to listen and obey, even in the case of a Ethiopian slave. Indeed, whomever among you lives, he will see much difference. Beware of the newly invented matters, for indeed they are astray. Whoever among you sees that, then he must stick to my Sunnah and the Sunnah of the rightly guided Khulafa', click to it with the molars.'\"",
      "chain": [
        "20387",
        "20644",
        "11422",
        "17046",
        "5172"
      ]
    },
    {
      "hadith_no": "3406",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا علي بن حجر، أخبرنا بقية بن الوليد، عن بحير بن سعد، عن خالد بن معدان، عن عبد الله بن أبي بلال، عن العرباض بن سارية، رضى الله عنه أن النبي صلى الله عليه وسلم كان لا ينام حتى يقرأ المسبحات ويقول ‏\"‏ فيها آية خير من ألف آية ‏\"‏ ‏.‏ هذا حديث حسن غريب ‏.‏",
      "text_en": " Ar-Irbad bin Sariyah [may Allah be pleased with him] narrated that:                     The Prophet would not sleepy until he had recite Al-Musabbihat, and he would say: “In them is an Ayah that is better than a thousand Ayah.”",
      "chain": [
        "20387",
        "20644",
        "11422",
        "17040",
        "5172"
      ]
    },
    {
      "hadith_no": "817",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرني يحيى بن عثمان الحمصي، قال حدثنا بقية، عن بحير بن سعد، عن خالد بن معدان، عن جبير بن نفير، عن العرباض بن سارية، عن رسول الله صلى الله عليه وسلم كان يصلي على الصف الأول ثلاثا وعلى الثاني واحدة ‏.‏",
      "text_en": " It was narrated from Al'Irbad bin Sariyah that the Messenger of Allah (ﷺ) used to send Salah on the first row three times and on the second row once.",
      "chain": [
        "20644",
        "11422",
        "4097",
        "5172"
      ]
    },
    {
      "hadith_no": "2163",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا شعيب بن يوسف، - بصري - قال حدثنا عبد الرحمن، عن معاوية بن صالح، عن يونس بن سيف، عن الحارث بن زياد، عن أبي رهم، عن العرباض بن سارية، قال سمعت رسول الله صلى الله عليه وسلم وهو يدعو إلى السحور في شهر رمضان وقال ‏\"‏ هلموا إلى الغداء المبارك ‏\"‏ ‏.‏",
      "text_en": " It was narrated that AL-'Irbad bin Sariyah said:                     \"I heard the Messenger of Allah inviting people to have Sahur in Ramadan. He said: 'Come to the blessed breakfast.\" (Hasan)Chatper 26. Calling Sahur \"Ghada\" (Breakfast)",
      "chain": [
        "20033",
        "20675",
        "19199",
        "17011",
        "5172"
      ]
    },
    {
      "hadith_no": "3164",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرني عمرو بن عثمان، قال حدثنا بقية، قال حدثنا بحير، عن خالد، عن ابن أبي بلال، عن العرباض بن سارية، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ يختصم الشهداء والمتوفون على فرشهم إلى ربنا في الذين يتوفون من الطاعون فيقول الشهداء إخواننا قتلوا كما قتلنا ‏.‏ ويقول المتوفون على فرشهم إخواننا ماتوا على فرشهم كما متنا فيقول ربنا انظروا إلى جراحهم فإن أشبه جراحهم جراح المقتولين فإنهم منهم ومعهم فإذا جراحهم قد أشبهت جراحهم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Al-'Irbad bin Sariyah that the Messenger of Allah (ﷺ) said:                      \"The martyrs and those who dies in their beds referred a dispute to our Lord concerning those who dies of the plague. The martyrs said: 'Our brothers were killed as we were killed.' And those who dies in their beds said: 'Our brothers dies on their beds as we died.' Our Lord said: 'Look at their wounds; if their wounds; if their wounds are like the wounds of those who were killed then they are of them and belong with them.' And their wounds were like their (the martyrs') wounds.\"",
      "chain": [
        "10581",
        "20644",
        "11282",
        "5172"
      ]
    },
    {
      "hadith_no": "44",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا عبد الله بن أحمد بن بشير بن ذكوان الدمشقي، حدثنا الوليد بن مسلم، حدثنا عبد الله بن العلاء، - يعني ابن زبر - حدثني يحيى بن أبي المطاع، قال سمعت العرباض بن سارية، يقول قام فينا رسول الله  صلى الله عليه وسلم  ذات يوم فوعظنا موعظة بليغة وجلت منها القلوب وذرفت منها العيون فقيل يا رسول الله وعظتنا موعظة مودع فاعهد إلينا بعهد فقال ‏\"‏ عليكم بتقوى الله والسمع والطاعة وإن عبدا حبشيا وسترون من بعدي اختلافا شديدا فعليكم بسنتي وسنة الخلفاء الراشدين المهديين عضوا عليها بالنواجذ وإياكم والأمور المحدثات فإن كل بدعة ضلالة ‏\"‏ ‏.‏",
      "text_en": " Yahya bin Abu Muta' said:                     I heard 'Irbad bin Sariyah say: 'One day, the Messenger of Allah (ﷺ) stood up among us and delivered a deeply moving speech to us that melted our hearts and caused our eyes to overflow with tears. It was said to him: 'O Messenger of Allah, you have delivered a speech of farewell, so enjoin something upon us.' He said: 'I urge you to fear Allah, and to listen and obey, even if (your leader) is an Abyssinian slave. After I am gone, you will see great conflict. I urge you to adhere to my Sunnah and the path of the Rightly-Guided Caliphs, and cling stubbornly to it. And beware of newly-invented matters, for every innovation is a going astray.'\"",
      "chain": [
        "20733",
        "20399",
        "19159",
        "5172"
      ]
    },
    {
      "hadith_no": "45",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا إسماعيل بن بشر بن منصور، وإسحاق بن إبراهيم السواق، قالا حدثنا عبد الرحمن بن مهدي، عن معاوية بن صالح، عن ضمرة بن حبيب، عن عبد الرحمن بن عمرو السلمي، أنه سمع العرباض بن سارية، يقول وعظنا رسول الله  صلى الله عليه وسلم  موعظة ذرفت منها العيون ووجلت منها القلوب فقلنا يا رسول الله إن هذه لموعظة مودع فماذا تعهد إلينا قال ‏\"‏ قد تركتكم على البيضاء ليلها كنهارها لا يزيغ عنها بعدي إلا هالك من يعش منكم فسيرى اختلافا كثيرا فعليكم بما عرفتم من سنتي وسنة الخلفاء الراشدين المهديين عضوا عليها بالنواجذ وعليكم بالطاعة وإن عبدا حبشيا فإنما المؤمن كالجمل الأنف حيثما قيد انقاد ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdur-Rahman bin 'Amr As-Sulami that:                     He heard Al-'Irbad bin Sariyah say: \"The Messenger of Allah (ﷺ) delivered a moving speech to us which made our eyes flow with tears and made our hearts melt. We said: 'O Messenger of Allah. This is a speech of farewell. What did you enjoin upon us?' He said: 'I am leaving you upon a (path of) brightness whose night is like its day. No one will deviate from it after I am gone but one who is doomed. Whoever among you lives will see great conflict. I urge you to adhere to what you know of my Sunnah and the path of the Rightly-Guided Caliphs, and cling stubbornly to it. And you must obey, even if (your leader is) an Abyssinian leader. For the true believer is like a camel with a ring in its nose; wherever it is driven, it complies.\"",
      "chain": [
        "30123",
        "20033",
        "20675",
        "19913",
        "17046",
        "5172"
      ]
    },
    {
      "hadith_no": "46",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا يحيى بن حكيم، حدثنا عبد الملك بن الصباح المسمعي، حدثنا ثور بن يزيد، عن خالد بن معدان، عن عبد الرحمن بن عمرو، عن العرباض بن سارية، قال صلى بنا رسول الله  صلى الله عليه وسلم  صلاة الصبح ثم أقبل علينا بوجهه فوعظنا موعظة بليغة ‏.‏ فذكر نحوه ‏.‏",
      "text_en": " It was narrated from 'Irbad bin Sariyah said:                     \"The Messenger of Allah (ﷺ) led us in Fajr (morning) prayer, then he turned to us and delivered an eloquent speech\". And he mentioned something similar (as no.43)",
      "chain": [
        "34280",
        "20415",
        "11422",
        "5172"
      ]
    },
    {
      "hadith_no": "2374",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا زيد بن الحباب، حدثنا معاوية بن صالح، حدثني سعيد بن هانئ، قال سمعت العرباض بن سارية، يقول كنت عند النبي  صلى الله عليه وسلم  فقال أعرابي اقضني بكري ‏.‏ فأعطاه بعيرا مسنا فقال الأعرابي يا رسول الله هذا أسن من بعيري ‏.‏ فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ خير الناس خيرهم قضاء ‏\"‏ ‏.‏",
      "text_en": " Sa'eed bin Hani' said:                     \"I heard 'Irbad bin Sariyah say: 'I was with the Prophet (ﷺ) and a Bedouin said: \"Pay me back for my young camel, and he gave him an older (i.e., better) camel.\" He said: 'O Messenger of Allah! It is older (i.e., better) than my camel.' The Messenger of Allah (ﷺ) said: 'The best of people are those who are best in repaying.\"'",
      "chain": [
        "30201",
        "20650",
        "20675",
        "5172"
      ]
    }
  ],
  "total_hadiths": 11
}