{
  "id": "5177",
  "name": "'Urwa bin 'Amir ( عروة بن عامر ( رضي الله عنه",
  "full_name": "'Urwa bin 'Amir ( عروة بن عامر ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah"
    ],
    "area_of_interest": [
      "Narrator [ 4  -  صحبة ]"
    ],
    "tags": [
      "al-Makki"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "3919",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divination and Omens (Kitab Al-Kahanah Wa Al-Tatayyur) - كتاب الكهانة و التطير",
      "chapter_no": "30",
      "text_ar": "حدثنا أحمد بن حنبل، وأبو بكر بن أبي شيبة المعنى قالا حدثنا وكيع، عن سفيان، عن حبيب بن أبي ثابت، عن عروة بن عامر، - قال أحمد القرشي - قال ذكرت الطيرة عند النبي صلى الله عليه وسلم فقال ‏\"‏ أحسنها الفأل ولا ترد مسلما فإذا رأى أحدكم ما يكره فليقل اللهم لا يأتي بالحسنات إلا أنت ولا يدفع السيئات إلا أنت ولا حول ولا قوة إلا بك ‏\"‏ ‏.‏",
      "text_en": " Narrated Urwah ibn Amir al-Qurashi:                     When taking omens was mentioned in the presence of the Prophet (ﷺ), he said: The best type is the good omen, and it does not turn back a Muslim. If one of you sees anything he dislikes, he should say: O Allah, no one brings good things except Thee, and no one averts evil things except Thee and there is no might and power but in Allah.",
      "chain": [
        "30007",
        "20032",
        "20012",
        "11331",
        "5177"
      ]
    },
    {
      "hadith_no": "2200",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Medicine - كتاب الطب عن رسول اللَّهِ صلى الله عليه وسلم",
      "chapter_no": "28",
      "text_ar": "وقد روي هذا، عن أيوب، عن عمرو بن دينار، عن عروة بن عامر، عن عبيد بن رفاعة، عن أسماء بنت عميس، عن النبي صلى الله عليه وسلم ‏.‏ حدثنا بذلك الحسن بن علي الخلال، حدثنا عبد الرزاق، عن معمر، عن أيوب، بهذا ‏.‏",
      "text_en": "",
      "chain": [
        "11015",
        "11081",
        "5177",
        "19828",
        "69"
      ]
    },
    {
      "hadith_no": "3639",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا سفيان بن عيينة، عن عمرو بن دينار، عن عروة بن عامر، عن عبيد بن رفاعة الزرقي، قال قالت أسماء يا رسول الله إن بني جعفر تصيبهم العين فأسترقي لهم قال ‏\"‏ نعم فلو كان شىء سابق القدر سبقته العين ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Ubaid bin Rifa’ah Az-Zuraqi said:                      “Asma’ said:‘O Messenger of Allah! The children of Ja’far have been afflictedbythe evil eye, shall I recite Ruqyah* for them?’ He said: ‘Yes,for ifanything were to overtake the Divine decree it would be theevileye.’”",
      "chain": [
        "30201",
        "20005",
        "11081",
        "5177",
        "19828"
      ]
    }
  ],
  "total_hadiths": 3
}