{
  "id": "5184",
  "name": "Atyh al-Qrzy Bdm ( عطية القرظي ( رضي الله عنه",
  "full_name": "Atyh al-Qrzy Bdm ( عطية القرظي ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Ray",
      "Kufa"
    ],
    "area_of_interest": [
      "Narrator [ 4  -  صحابي ]"
    ],
    "tags": [
      "al-Ra'",
      "Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "students": [
    {
      "id": "11368",
      "name": "'Abdul Malik bin 'Umayr al-Qabti عبد الملك بن عمير بن سويد القبطي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11028",
      "name": "Mujahid bin Jabir مجاهد بن جبر",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sunan-abi-daud-4404",
      "hadith_no": "4404",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، أخبرنا عبد الملك بن عمير، حدثني عطية القرظي، قال كنت من سبى بني قريظة فكانوا ينظرون فمن أنبت الشعر قتل ومن لم ينبت لم يقتل فكنت فيمن لم ينبت ‏.‏",
      "text_en": " Narrated Atiyyah al-Qurazi:                     I was among the captives of Banu Qurayzah. They (the Companions) examined us, and those who had begun to grow hair (pubes) were killed, and those who had not were not killed. I was among those who had not grown hair.",
      "usc_msa_ref": "",
      "chain": [
        "28531",
        "20012",
        "11368",
        "5184"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1584",
      "hadith_no": "1584",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Military Expeditions - كتاب السير عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "21",
      "text_ar": "حدثنا هناد، حدثنا وكيع، عن سفيان، عن عبد الملك بن عمير، عن عطية القرظي، قال عرضنا على النبي صلى الله عليه وسلم يوم قريظة فكان من أنبت قتل ومن لم ينبت خلي سبيله فكنت ممن لم ينبت فخلي سبيلي ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ والعمل على هذا عند بعض أهل العلم أنهم يرون الإنبات بلوغا إن لم يعرف احتلامه ولا سنه وهو قول أحمد وإسحاق ‏.‏",
      "text_en": " Narrated 'Atiyyah Al-Qurazi:                     \"We were presented to the Messenger of Allah (ﷺ) on the day of (the battle of) Quraizah. Whoever had pubic hair was killed and whoever did not was left to his way. I was of those who did not have pubic hair so I was left to my way.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. This is acted upon according to some of the people of knowledge. They consider pubic hair an indication of the age of responsibility, if it is not known whether he has had a wet dream, or his age. This is the view of Ahmad and Ishaq.",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20032",
        "20012",
        "11368",
        "5184"
      ]
    },
    {
      "id": "sunan-an-nasai-3430",
      "hadith_no": "3430",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا محمد بن منصور، قال حدثنا سفيان، عن عبد الملك بن عمير، عن عطية القرظي، قال كنت يوم حكم سعد في بني قريظة غلاما فشكوا في فلم يجدوني أنبت فاستبقيت فها أنا ذا بين أظهركم ‏.‏",
      "text_en": " It was narrated that 'Atiyyah Al-Qurazi said:                      \"On the day that Sa'd passed judgment on Banu Quraizah I was a young boy and they were not sure about me, but they did not find any pubic hair, so they let me live, and here I am among you.\"",
      "usc_msa_ref": "",
      "chain": [
        "36658",
        "20005",
        "11368",
        "5184"
      ]
    },
    {
      "id": "sunan-ibn-majah-2638",
      "hadith_no": "2638",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعلي بن محمد، قالا حدثنا وكيع، عن سفيان، عن عبد الملك بن عمير، قال سمعت عطية القرظي، يقول عرضنا على رسول الله صلى الله عليه وسلم يوم قريظة فكان من أنبت قتل ومن لم ينبت خلي سبيله فكنت فيمن لم ينبت فخلي سبيلي ‏.‏",
      "text_en": " It was narrated that 'Abdul-Malik bin`Umair said:                     “I heard 'Atiyyah Al-Quazi say: 'We were presented to the Messenger of Allah (ﷺ) on the Day of Quraizah. Those whose public hair had grown were killed, and those whose public hair had not yet grown were let go. I was one of those whose pubic hair had not yet grown, so I was let go.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "38409",
        "20032",
        "20012",
        "11368",
        "5184"
      ]
    },
    {
      "id": "sunan-ibn-majah-2639",
      "hadith_no": "2639",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا محمد بن الصباح، أنبأنا سفيان بن عيينة، عن عبد الملك بن عمير، قال سمعت عطية القرظي، يقول فها أنا ذا، بين أظهركم ‏.‏",
      "text_en": " It was narrated that 'Abdul-Malik bin 'Umair said:                     “I heard 'Atiyyah Al-Qurazi say: Here I am still among you,' ”",
      "usc_msa_ref": "",
      "chain": [
        "30269",
        "20005",
        "11368",
        "5184"
      ]
    }
  ],
  "total_hadiths": 5
}