{
  "id": "5200",
  "name": "'Amr bin Tghlb ( عمرو بن تغلب ( رضي الله عنه",
  "full_name": "'Amr bin Tghlb ( عمرو بن تغلب ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator [ خ  س  ق  -  صحابي ]"
    ],
    "tags": []
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "students": [
    {
      "id": "11016",
      "name": "al-Hasan al-Basri الحسن البصري",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "923",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن معمر، قال حدثنا أبو عاصم، عن جرير بن حازم، قال سمعت الحسن، يقول حدثنا عمرو بن تغلب، أن رسول الله صلى الله عليه وسلم أتي بمال أو سبى فقسمه، فأعطى رجالا وترك رجالا فبلغه أن الذين ترك عتبوا، فحمد الله ثم أثنى عليه، ثم قال ‏\"‏ أما بعد، فوالله إني لأعطي الرجل، وأدع الرجل، والذي أدع أحب إلى من الذي أعطي ولكن أعطي أقواما لما أرى في قلوبهم من الجزع والهلع، وأكل أقواما إلى ما جعل الله في قلوبهم من الغنى والخير، فيهم عمرو بن تغلب ‏\"‏‏.‏ فوالله ما أحب أن لي بكلمة رسول الله صلى الله عليه وسلم حمر النعم‏.‏ تابعه يونس‏.‏",
      "text_en": " Narrated `Amr bin Taghlib:                     Some property or something was brought to Allah's Apostle and he distributed it. He gave to some men and ignored the others. Later he got the news of his being admonished by those whom he had ignored. So he glorified and praised Allah and said, \"Amma ba'du. By Allah, I may give to a man and ignore another, although the one whom I ignore is more beloved to me than the one whom I give. But I give to some people as I feel that they have no patience and no contentment in their hearts and I leave those who are patient and self-content with the goodness and wealth which Allah has put into their hearts and `Amr bin Taghlib is one of them.\" `Amr added, By Allah! Those words of Allah's Apostle are more beloved to me than the best red camels.",
      "chain": [
        "30172",
        "20241",
        "11272",
        "11016",
        "5200"
      ]
    },
    {
      "hadith_no": "2927",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا أبو النعمان، حدثنا جرير بن حازم، قال سمعت الحسن، يقول حدثنا عمرو بن تغلب، قال قال النبي صلى الله عليه وسلم ‏\"‏ إن من أشراط الساعة أن تقاتلوا قوما ينتعلون نعال الشعر، وإن من أشراط الساعة أن تقاتلوا قوما عراض الوجوه، كأن وجوههم المجان المطرقة ‏\"‏‏.‏",
      "text_en": " Narrated `Amr bin Taghlib:                     The Prophet said, \"One of the portents of the Hour is that you will fight with people wearing shoes made of hair; and one of the portents of the Hour is that you will fight with broad-faced people whose faces will look like shields coated with leather.\"",
      "chain": [
        "20283",
        "11272",
        "11016",
        "5200"
      ]
    },
    {
      "hadith_no": "3145",
      "source": " Sahih Bukhari ",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا جرير بن حازم، حدثنا الحسن، قال حدثني عمرو بن تغلب  رضى الله عنه  قال أعطى رسول الله صلى الله عليه وسلم قوما ومنع آخرين، فكأنهم عتبوا عليه فقال ‏\"‏ إني أعطي قوما أخاف ظلعهم وجزعهم، وأكل أقواما إلى ما جعل الله في قلوبهم من الخير والغنى، منهم عمرو بن تغلب ‏\"‏‏.‏ فقال عمرو بن تغلب ما أحب أن لي بكلمة رسول الله صلى الله عليه وسلم حمر النعم‏.‏ وزاد أبو عاصم عن جرير قال سمعت الحسن يقول حدثنا عمرو بن تغلب أن رسول الله صلى الله عليه وسلم أتي بمال أو بسبى فقسمه‏.‏ بهذا‏.‏",
      "text_en": " Narrated `Amr bin Taghlib:                     Allah's Apostle gave (gifts) to some people to the exclusion of some others. The latter seemed to be displeased by that. The Prophet said, \"I give to some people, lest they should deviate from True Faith or lose patience, while I refer other people to the goodness and contentment which Allah has put in their hearts, and `Amr bin Taghlib is amongst them.\" `Amr bin Taghlib said, \"The statement of Allah's Apostle is dearer to me than red camels.\" Narrated Al-Hasan: `Amr bin Taghlib told us that Allah's Apostle got some property or some war prisoners and he distributed them in the above way (i.e. giving to some people to the exclusion of others) .",
      "chain": [
        "20040",
        "11272",
        "11016",
        "5200"
      ]
    },
    {
      "hadith_no": "3634",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا جرير بن حازم، سمعت الحسن، يقول حدثنا عمرو بن تغلب، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ بين يدى الساعة تقاتلون قوما ينتعلون الشعر، وتقاتلون قوما كأن وجوههم المجان المطرقة ‏\"‏‏.‏",
      "text_en": " Narrated `Umar bin Taghlib:                     I heard Allah's Apostle saying, \"Near the Hour you will fight with people who will wear hairy shoes; and you will also fight people with flat faces like shields.\"",
      "chain": [
        "20193",
        "11272",
        "11016",
        "5200"
      ]
    },
    {
      "hadith_no": "7629",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا أبو النعمان، حدثنا جرير بن حازم، عن الحسن، حدثنا عمرو بن تغلب، قال أتى النبي صلى الله عليه وسلم مال فأعطى قوما ومنع آخرين فبلغه أنهم عتبوا فقال ‏\"‏ إني أعطي الرجل وأدع الرجل، والذي أدع أحب إلى من الذي أعطي، أعطي أقواما لما في قلوبهم من الجزع والهلع، وأكل أقواما إلى ما جعل الله في قلوبهم من الغنى والخير منهم عمرو بن تغلب ‏\"‏‏.‏ فقال عمرو ما أحب أن لي بكلمة رسول الله صلى الله عليه وسلم حمر النعم‏.‏",
      "text_en": " Narrated Al-Hasan:                     `Amr bin Taghlib said, \"Some property was given to the Prophet and he gave it to some people and withheld it from some others. Then he came to know that they (the latter) were dissatisfied. So the Prophet said, 'I give to one man and leave (do not give) another, and the one to whom I do not give is dearer to me than the one to whom I give. I give to some people because of the impatience and discontent present in their hearts, and leave other people because of the content and goodness Allah has bestowed on them, and one of them is `Amr bin Taghlib.\" `Amr bin Taghlib said, \"The sentence which Allah's Apostle said in my favor is dearer to me than the possession of nice red camels.\"",
      "chain": [
        "20283",
        "11272",
        "11016",
        "5200"
      ]
    },
    {
      "hadith_no": "4456",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا عمرو بن علي، قال أنبأنا وهب بن جرير، قال حدثني أبي، عن يونس، عن الحسن، عن عمرو بن تغلب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن من أشراط الساعة أن يفشو المال ويكثر وتفشو التجارة ويظهر العلم ويبيع الرجل البيع فيقول لا حتى أستأمر تاجر بني فلان ويلتمس في الحى العظيم الكاتب فلا يوجد ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Amr bin Taghilb said:                     \"The Messenger of Allah said: 'One of the portents of the Hour will be that wealth becomes widespread and abundant, and trade will become widespread, but knowledge will disappear. A man will try to sell something and will say: \"No, not until I consult the merchant of banu so and so: and People will look throughout a vast area for a scribe and will not find one.\" (Sahih )",
      "chain": [
        "30153",
        "20298",
        "11272",
        "20475",
        "11016",
        "5200"
      ]
    },
    {
      "hadith_no": "4237",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أسود بن عامر، حدثنا جرير بن حازم، حدثنا الحسن، عن عمرو بن تغلب، قال سمعت النبي  صلى الله عليه وسلم  يقول ‏\"‏ إن من أشراط الساعة أن تقاتلوا قوما عراض الوجوه كأن وجوههم المجان المطرقة وإن من أشراط الساعة أن تقاتلوا قوما ينتعلون الشعر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that ‘Amr bin Taghlib said:                      “I heard the Prophet(ﷺ) say: ‘One of the portents of the Hour is that you fightpeoplewith broad faces, as if their faces are hammered shields. Andone ofhte portents of the Hour is that you will fight people whowear shoesof hair.’”",
      "chain": [
        "30201",
        "20380",
        "11272",
        "11016",
        "5200"
      ]
    }
  ],
  "total_hadiths": 7
}