{
  "id": "5201",
  "name": "'Amr bin al-Harith bin Abi Darar ( عمرو بن الحارث بن أبي ضرار المصطلقي ( رضي الله عنه",
  "full_name": "'Amr bin al-Harith bin Abi Darar ( عمرو بن الحارث بن أبي ضرار المصطلقي ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "50",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator [ ع  -  صحابي ]"
    ],
    "tags": [
      "al-Khuza'i"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [
    {
      "id": "58",
      "name": "Juwayriya bint al-Harith ( جويرية بنت الحارث ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "16",
      "name": "ibn Mas'ud ( عبد الله بن مسعود ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "498",
      "name": "Zaynab bint. Abi Mu'awiya ( زينب بنت أبي معاوية الثقفية ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "15681",
      "name": "Abu 'Ubaida bin 'Abdullah bin Mas'ud أبو عبيدة بن عبد الله بن مسعود",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11049",
      "name": "Abu Ishaq al-Sabay'ai' أبو إسحاق السبيعي عمرو بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11353",
      "name": "Shaqayq bin Salmah al-Asadi شقيق بن سلمة الأسدي أبو وائل الكوفي",
      "grade": "Follower(Tabi') [1st Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "2322",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا أحمد بن منيع، عن ابن أبي زائدة، عن عيسى بن دينار، عن أبيه، عن عمرو بن الحارث بن أبي ضرار، عن ابن مسعود، قال لما صمنا مع النبي صلى الله عليه وسلم تسعا وعشرين أكثر مما صمنا معه ثلاثين ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     We kept fast for twenty-nine days along with the Prophet (ﷺ) more often than we kept fast for thirty days.",
      "chain": [
        "30242",
        "20366",
        "25226",
        "5201",
        "16"
      ]
    },
    {
      "hadith_no": "359",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا هناد، حدثنا جرير، عن منصور، عن هلال بن يساف، عن زياد بن أبي الجعد، عن عمرو بن الحارث بن المصطلق، قال كان يقال أشد الناس عذابا يوم القيامة اثنان امرأة عصت زوجها وإمام قوم وهم له كارهون ‏.‏ قال هناد قال جرير قال منصور فسألنا عن أمر الإمام فقيل لنا إنما عنى بهذا أئمة ظلمة فأما من أقام السنة فإنما الإثم على من كرهه ‏.‏",
      "text_en": " Amr bin Al-Harith Al-Mustaliq said:                     \"It used to be said that the people with the worst punishment [on the Day of Judgment] are two: A woman who disobeyed her husband, and a people's Imam whom they dislike.\"",
      "chain": [
        "30480",
        "20028",
        "11067",
        "10835",
        "15158",
        "5201",
        "30480",
        "4057"
      ]
    },
    {
      "hadith_no": "635",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Zakat - كتاب الزكاة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "7",
      "text_ar": "حدثنا هناد، حدثنا أبو معاوية، عن الأعمش، عن أبي وائل، عن عمرو بن الحارث بن المصطلق، عن ابن أخي، زينب امرأة عبد الله عن زينب، امرأة عبد الله بن مسعود قالت خطبنا رسول الله صلى الله عليه وسلم فقال ‏\"‏ يا معشر النساء تصدقن ولو من حليكن فإنكن أكثر أهل جهنم يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " Amr bin Al-Harith bin Al-Mustaliq narrated from the nephew of Zainab, the wife of Abdullah (Ibn Mas'ud) who said:                     \"The Messenger of Allah delivered a sermon to us, and said: 'O you women! Give charity, even if it is from your jewelry, for indeed you will make up most of the people of Hell on the Day of Judgment.'\"",
      "chain": [
        "30480",
        "20354",
        "11060",
        "11353",
        "5201"
      ]
    },
    {
      "hadith_no": "689",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا يحيى بن زكريا بن أبي زائدة، أخبرني عيسى بن دينار، عن أبيه، عن عمرو بن الحارث بن أبي ضرار، عن ابن مسعود، قال ما صمت مع النبي صلى الله عليه وسلم تسعا وعشرين أكثر مما صمنا ثلاثين ‏.‏ قال وفي الباب عن عمر وأبي هريرة وعائشة وسعد بن أبي وقاص وابن عباس وابن عمر وأنس وجابر وأم سلمة وأبي بكرة أن النبي صلى الله عليه وسلم قال ‏\"‏ الشهر يكون تسعا وعشرين ‏\"‏ ‏.‏",
      "text_en": " Ibn Mas'ud said:                     \"What I fasted with the Prophet hat was twenty-nine (days), was more than what we fasted that was thirty.\"",
      "chain": [
        "30242",
        "20366",
        "25226",
        "5201",
        "16"
      ]
    }
  ],
  "total_hadiths": 4
}