{
  "id": "5202",
  "name": "'Amr bin Hurayth bin 'Amr bin 'Uthman ( عمرو بن حريث بن عمرو بن عثمان ( رضي الله عنه",
  "full_name": "'Amr bin Hurayth bin 'Amr bin 'Uthman ( عمرو بن حريث بن عمرو بن عثمان ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "2",
      "date_gregorian": "NA",
      "date_display": [
        "2 BH"
      ],
      "place": "Makkah"
    },
    "death": {
      "date_hijri": "85",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Hijaz",
      "Kufa"
    ],
    "area_of_interest": [
      "Narrator [ ع  -  صحابي ]"
    ],
    "tags": [
      "Quraish",
      "B.Makhzum",
      "Child",
      "al-Kufi"
    ]
  },
  "parents": [
    {
      "id": "6117",
      "name": "Hurayth bin 'Amr bin 'Uthman ( حريث بن عمرو بن عثمان ( رضي الله عنه",
      "grade": "Comp.(RA)"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "5061",
      "name": "Sa'id bin Hurayth bin 'Amr bin 'Uthman ( سعيد بن حريث بن عمرو ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "5061",
      "name": "Sa'id bin Hurayth bin 'Amr bin 'Uthman ( سعيد بن حريث بن عمرو ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "2",
      "name": "Abu Bakr Al-Siddique ( أبو بكر الصديق ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3",
      "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5",
      "name": "Ali ibn Abi Talib ( علي بن أبي طالب بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "16",
      "name": "ibn Mas'ud ( عبد الله بن مسعود ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11",
      "name": "Sa'id bin Zayd ( سعيد بن زيد ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "212",
      "name": "'Adi ibn Hatim al-Tayyi' ( عدي بن حاتم الطائي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "4438",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا أبو عوانة، حدثنا عبد الملك، عن عمرو بن حريث، عن عدي بن حاتم، قال أتينا عمر في وفد، فجعل يدعو رجلا رجلا ويسميهم فقلت أما تعرفني يا أمير المؤمنين قال بلى، أسلمت إذ كفروا، وأقبلت إذ أدبروا، ووفيت إذ غدروا، وعرفت إذ أنكروا‏.‏ فقال عدي فلا أبالي إذا‏.‏",
      "text_en": " Narrated `Adi bin Hatim:                     We came to `Umar in a delegation (during his rule). He started calling the men one by one, calling each by his name. (As he did not call me early) I said to him. \"Don't you know me, O chief of the Believers?\" He said, \"Yes, you embraced Islam when they (i.e. your people) disbelieved; you have come (to the Truth) when they ran away; you fulfilled your promises when they broke theirs; and you recognized it (i.e. the Truth of Islam) when they denied it.\" On that, `Adi said, \"I therefore don't care.\"",
      "chain": [
        "20040",
        "20469",
        "11368",
        "5202",
        "212"
      ]
    },
    {
      "hadith_no": "4518",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا أبو نعيم، حدثنا سفيان، عن عبد الملك، عن عمرو بن حريث، عن سعيد بن زيد  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الكمأة من المن، وماؤها شفاء للعين ‏\"‏‏.‏",
      "text_en": " Narrated Sa`id bin Zaid:                     Allah's Apostle said, \"The Kam'a (i.e. a kind of edible fungus) is like the Manna (in that it is obtained without effort) and its water is a (medicine) cure for eye trouble.\"",
      "chain": [
        "20348",
        "20012",
        "11368",
        "5202",
        "11"
      ]
    },
    {
      "hadith_no": "4684",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا مسلم، حدثنا شعبة، عن عبد الملك، عن عمرو بن حريث، عن سعيد بن زيد، عن النبي صلى الله عليه وسلم قال ‏\"‏ الكمأة من المن وماؤها شفاء العين ‏\"‏‏.‏",
      "text_en": " Narrated Sa`id Ibn Zaid:                     The Prophet said, \"Al-Kam'a is like the Mann (sweet resin or gum) (in that it grows naturally without human care) and its water is a cure for the eye diseases.\"",
      "chain": [
        "20285",
        "20020",
        "11368",
        "5202",
        "11"
      ]
    },
    {
      "hadith_no": "5770",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا غندر، حدثنا شعبة، عن عبد الملك، سمعت عمرو بن حريث، قال سمعت سعيد بن زيد، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ الكمأة من المن، وماؤها شفاء للعين ‏\"‏‏.‏ قال شعبة وأخبرني الحكم بن عتيبة عن الحسن العرني عن عمرو بن حريث عن سعيد بن زيد عن النبي صلى الله عليه وسلم‏.‏ قال شعبة لما حدثني به الحكم لم أنكره من حديث عبد الملك‏.‏",
      "text_en": " Narrated Sa`id bin Zaid:                     I heard the Prophet saying, \"Truffles are like Manna (i.e. they grow naturally without man's care) and their water heals eye diseases.\"",
      "chain": [
        "30170",
        "20278",
        "20020",
        "11368",
        "5202",
        "11"
      ]
    },
    {
      "hadith_no": "456",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثني زهير بن حرب، حدثنا يحيى بن سعيد، ح قال وحدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، ح وحدثني أبو كريب، - واللفظ له - أخبرنا ابن بشر، عن مسعر، قال حدثني الوليد بن سريع، عن عمرو بن حريث، أنه سمع النبي صلى الله عليه وسلم يقرأ في الفجر ‏{‏ والليل إذا عسعس‏}‏",
      "text_en": " 'Amr b. Huwairith reported:                      I heard the Apostle of Allah (may peace be upon him) recite in the morning prayer\" Wa'l-lail-i-idhd 'As'asa\" (ixxxi. 17).",
      "chain": [
        "30022",
        "20031",
        "30201",
        "20032",
        "20359",
        "10837",
        "5202"
      ]
    },
    {
      "hadith_no": "475",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا محرز بن عون بن أبي عون، حدثنا خلف بن خليفة الأشجعي أبو أحمد، عن الوليد بن سريع، مولى آل عمرو بن حريث عن عمرو بن حريث، قال صليت خلف النبي صلى الله عليه وسلم الفجر فسمعته يقرأ ‏{‏ فلا أقسم بالخنس * الجوار الكنس‏}‏ وكان لا يحني رجل منا ظهره حتى يستتم ساجدا ‏.‏",
      "text_en": " 'Amr b. Huraith reported:                      I said the dawn prayer behind the Apostle of (may peace be upon him) and heard him reciting: 'Nay. I call to witness the stars, running their courses and setting\" (al-Qur'an, lxxxi. 15-16) and Done of us bent his back till he completed prostration.",
      "chain": [
        "20584",
        "10837",
        "5202"
      ]
    },
    {
      "hadith_no": "5463",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا جرير، ح وحدثنا إسحاق بن إبراهيم، أخبرنا جرير، وعمر بن عبيد عن عبد الملك بن عمير، عن عمرو بن حريث، عن سعيد بن زيد بن عمرو، بن نفيل قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ الكمأة من المن وماؤها شفاء للعين ‏\"‏ ‏.‏",
      "text_en": " Sa'id b. Zaid b. 'Amr b. Nufail reported:                      I heard Allah's Apostle (may peace be upon him) as saying: Truffles are a kind of 'Manna' and their juice is a medicine for the eyes.",
      "chain": [
        "30367",
        "20028",
        "30123",
        "11368",
        "5202",
        "11"
      ]
    },
    {
      "hadith_no": "5464",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثنا محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، عن عبد الملك بن، عمير قال سمعت عمرو بن حريث، قال سمعت سعيد بن زيد، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ الكمأة من المن وماؤها شفاء للعين ‏\"‏ ‏.‏",
      "text_en": "",
      "chain": [
        "30170",
        "20173",
        "20020",
        "11368",
        "5202",
        "11"
      ]
    },
    {
      "hadith_no": "5465",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثنا محمد بن المثنى، حدثني محمد بن جعفر، حدثنا شعبة، قال وأخبرني  الحكم بن عتيبة، عن الحسن العرني، عن عمرو بن حريث، عن سعيد بن زيد، عن النبي صلى الله عليه وسلم ‏.‏ قال شعبة لما حدثني به الحكم لم أنكره من حديث عبد الملك ‏.‏",
      "text_en": " Sa'id b. Zaid reported:                      I heard Allah's Messenger (may peace be upon him) as saying: Truffles are a kind of blessing and their juice is a medicine for the eyes. Shu'ba said: When Hakam narrated this hadith to me, I did not deem it as a Munkar hadith because of the narration of Abd al-Malik.",
      "chain": [
        "30170",
        "20173",
        "20020",
        "11069",
        "11623",
        "5202",
        "11"
      ]
    },
    {
      "hadith_no": "5466",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا سعيد بن عمرو الأشعثي، أخبرنا عبثر، عن مطرف، عن الحكم، عن الحسن، عن عمرو بن حريث، عن سعيد بن زيد بن عمرو بن نفيل، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الكمأة من المن الذي أنزل الله تبارك وتعالى على بني إسرائيل وماؤها شفاء للعين ‏\"‏ ‏.‏",
      "text_en": " Sa'id b. Zaid b. 'Amr b. Nufail reported Allah's Messenger (may peace be upon him) as saying:                      Truffles are a kind of 'Manna' which Allah the Glorious and Exalted, sent down upon the people of Israil, and its juice is a medicine for the eyes.",
      "chain": [
        "30465",
        "11395",
        "11069",
        "11016",
        "5202",
        "11"
      ]
    },
    {
      "hadith_no": "5467",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثنا إسحاق بن إبراهيم، أخبرنا جرير، عن مطرف، عن الحكم بن عتيبة، عن  الحسن العرني، عن عمرو بن حريث، عن سعيد بن زيد، عن النبي صلى الله عليه وسلم قال ‏\"‏ الكمأة من المن الذي أنزل الله على موسى وماؤها شفاء للعين ‏\"‏ ‏.‏",
      "text_en": " Sa'id b. Zaid reported Allal a Messenger (may peace be upon him) as saying:                      Truffles are a kind of 'Manna' which Allah sent down upon Moses and their juice is a medicine for the eyes.",
      "chain": [
        "30123",
        "20028",
        "11395",
        "11069",
        "11623",
        "5202",
        "11"
      ]
    },
    {
      "hadith_no": "5468",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان، عن عبد الملك بن عمير، قال سمعت عمرو، بن حريث يقول قال سمعت سعيد بن زيد، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ الكمأة من المن الذي أنزل الله عز وجل على بني إسرائيل وماؤها شفاء للعين ‏\"‏ ‏.‏",
      "text_en": " Sa'id b. Zaid reported Allah's Messenger (may peace be upon him) as saying:                      Truffles are 'Manna' which Allah, the Exalted the Majestic, sent to the people of Israil, and its juice is a medicine for the eyes.",
      "chain": [
        "30421",
        "20005",
        "11368",
        "5202",
        "11"
      ]
    },
    {
      "hadith_no": "5469",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثنا يحيى بن حبيب الحارثي، حدثنا حماد بن زيد، حدثنا محمد بن شبيب، قال سمعته من، شهر بن حوشب فسألته فقال سمعته من عبد الملك بن عمير، قال فلقيت عبد الملك فحدثني عن عمرو بن حريث، عن سعيد بن زيد، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الكمأة من المن وماؤها شفاء للعين ‏\"‏ ‏.‏",
      "text_en": " Sa'id b. Zaid reported Allah's Messenger (may peace be upon him) as saying:                      Truffles are 'Manna' and its juice is the medicine for the eyes.",
      "chain": [
        "20022",
        "10714",
        "5202",
        "11"
      ]
    },
    {
      "hadith_no": "817",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا إبراهيم بن موسى الرازي، أخبرنا عيسى، - يعني ابن يونس - عن إسماعيل، عن أصبغ، مولى عمرو بن حريث عن عمرو بن حريث، قال كأني أسمع صوت النبي صلى الله عليه وسلم يقرأ في صلاة الغداة ‏{‏ فلا أقسم بالخنس * الجوار الكنس ‏}‏ ‏.‏",
      "text_en": " ‘Amr b. Huraith said:                      As if I am hearing the voice of the prophet (may peace by upon him) who would recite at the morning prayer “Oh, but I call to witness the planets, the stars which rise and set”(surah 81:15-16)",
      "chain": [
        "30309",
        "20347",
        "11418",
        "5202"
      ]
    },
    {
      "hadith_no": "3060",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا مسدد، حدثنا عبد الله بن داود، عن فطر، حدثني أبي، عن عمرو بن حريث، قال خط لي رسول الله صلى الله عليه وسلم دارا بالمدينة بقوس وقال ‏\"‏ أزيدك أزيدك ‏\"‏ ‏.‏",
      "text_en": " Narrated Amr ibn Hurayth:                     The Messenger of Allah (ﷺ) demarcated a house with a bow at Medina for me. He said: I shall give you more. I shall give you more.",
      "chain": [
        "30175",
        "20330",
        "5202"
      ]
    },
    {
      "hadith_no": "2209",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Medicine - كتاب الطب عن رسول اللَّهِ صلى الله عليه وسلم",
      "chapter_no": "28",
      "text_ar": "حدثنا أبو كريب، حدثنا عمر بن عبيد الطنافسي، عن عبد الملك بن عمير، ح وحدثنا محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، عن عبد الملك بن عمير، عن عمرو بن حريث، عن سعيد بن زيد، عن النبي صلى الله عليه وسلم قال ‏\"‏ الكمأة من المن وماؤها شفاء للعين ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " \"Sa'eed bin Zaid narrated that the Prophet (S.A.W) said:                     \"Truffles are a form of manna, and its liquid is a cure for the eye.\"",
      "chain": [
        "30216",
        "20346",
        "11368",
        "30170",
        "20173",
        "20020",
        "11368",
        "5202",
        "11"
      ]
    },
    {
      "hadith_no": "2237",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا محمد بن بشار، وأحمد بن منيع، قالا حدثنا روح بن عبادة، حدثنا سعيد بن أبي عروبة، عن أبي التياح، عن المغيرة بن سبيع، عن عمرو بن حريث، عن أبي بكر الصديق، قال حدثنا رسول الله صلى الله عليه وسلم قال ‏\"‏ الدجال يخرج من أرض بالمشرق يقال لها خراسان يتبعه أقوام كأن وجوههم المجان المطرقة ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن أبي هريرة وعائشة ‏.‏ وهذا حديث حسن غريب ‏.‏ وقد رواه عبد الله بن شوذب وغير واحد عن أبي التياح ولا نعرفه إلا من حديث أبي التياح ‏.‏",
      "text_en": " Abu Bakr As-Siddiq said:                     \"The Messenger of Allah(s.a.w) narrated to us, saying: 'The Dajjal shall emerge from a land in the east called Khurasan. He is followed by a people whom appear as if their f aces are shields coated with leather. '\"",
      "chain": [
        "30160",
        "30242",
        "20229",
        "11073",
        "11317",
        "19031",
        "5202",
        "2"
      ]
    },
    {
      "hadith_no": "951",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا محمد بن أبان البلخي، قال حدثنا وكيع بن الجراح، عن مسعر، والمسعودي، عن الوليد بن سريع، عن عمرو بن حريث، قال سمعت النبي صلى الله عليه وسلم يقرأ في الفجر ‏{‏ إذا الشمس كورت ‏}‏ ‏.‏",
      "text_en": " It was narrated that Amr bin Huraith said:                     \"I heard the Prophet (ﷺ) reciting: 'When the sun is wound round.' in fajr. \"",
      "chain": [
        "30369",
        "20032",
        "20359",
        "20724",
        "10837",
        "5202"
      ]
    },
    {
      "hadith_no": "866",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبي، حدثنا إسماعيل بن أبي خالد، عن أصبغ، مولى عمرو بن حريث عن عمرو بن حريث، قال صلينا مع النبي  صلى الله عليه وسلم  فكان يقرأ في الفجر فكأني أسمع قراءته ‏{فلا أقسم بالخنس  الجوار الكنس}‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Amr bin Huraith said:                      “I performed prayer withtheProphet (ﷺ) when he was reciting in the Fajr, and it is as if Icanhear him reciting: ‘So verily, I swear by the planets that recede.And by the planets that move swiftly and hide themselves.’”[81:15-16]",
      "chain": [
        "30212",
        "20331",
        "11418",
        "5202"
      ]
    },
    {
      "hadith_no": "2585",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Pawning - كتاب الرهون",
      "chapter_no": "16",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبيد الله بن عبد المجيد، حدثني إسماعيل بن إبراهيم بن مهاجر، عن عبد الملك بن عمير، عن عمرو بن حريث، عن أخيه، سعيد بن حريث عن النبي صلى الله عليه وسلم مثله ‏.‏",
      "text_en": "",
      "chain": [
        "30160",
        "20208",
        "11368",
        "5202",
        "5061"
      ]
    },
    {
      "hadith_no": "3581",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا محمد بن الصباح، أنبأنا سفيان بن عيينة، عن عبد الملك بن عمير، سمع عمرو بن حريث، يقول سمعت سعيد بن زيد بن عمرو بن نفيل، يحدث عن النبي  صلى الله عليه وسلم  أن ‏\"‏ الكمأة من المن الذي أنزل الله على بني إسرائيل وماؤها شفاء للعين ‏\"‏ ‏.‏",
      "text_en": " ‘Amrbin Huraith said:                      “I heard Sa’eed bin Zaid bin ‘Amr bin Nufailnarrating from the Prophet (ﷺ) that: ‘Truffles are a type ofmannathat Allah sent down to the Children of Israel, and their wateris ahealing for eye (diseases).’”",
      "chain": [
        "30269",
        "20005",
        "11368",
        "5202",
        "11"
      ]
    },
    {
      "hadith_no": "4210",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا نصر بن علي الجهضمي، ومحمد بن بشار، ومحمد بن المثنى، قالوا حدثنا روح بن عبادة، حدثنا سعيد بن أبي عروبة، عن أبي التياح، عن المغيرة بن سبيع، عن عمرو بن حريث، عن أبي بكر الصديق، قال حدثنا رسول الله  صلى الله عليه وسلم  ‏\"‏ أن الدجال يخرج من أرض بالمشرق يقال لها خراسان يتبعه أقوام كأن وجوههم المجان المطرقة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Bakr Siddiq said:                      \"The Messenger ofAllah(ﷺ) told us: 'Dajjal will emerge in a land in the east calledKhorasan, and will be followed by people with faces like hammeredshields.'\"",
      "chain": [
        "30395",
        "30160",
        "30170",
        "20229",
        "11073",
        "11317",
        "19031",
        "5202",
        "2"
      ]
    }
  ],
  "total_hadiths": 22
}