{
  "id": "5206",
  "name": "'Amr bin Salmah bin Qays ( عمرو بن سلمة بن قيس الجرمي ( رضي الله عنه",
  "full_name": "'Amr bin Salmah bin Qays ( عمرو بن سلمة بن قيس الجرمي ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator [ خ  د  س  -  صحابي ]"
    ],
    "tags": [
      "al-Jarmi",
      "al-Basra"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "students": [
    {
      "id": "11047",
      "name": "Abu Qalaba, 'Abdullah bin Zayd al-Jarmi عبد الله بن زيد بن عمرو",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11080",
      "name": "'Asim al-Ahwal عاصم الأحول",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11263",
      "name": "Muhammad bin Muslim bin Tadras محمد بن مسلم بن تدرس أبو الزبير",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "14360",
      "name": "Ms'r bin Habib al-Jrmy Abu مسعر بن حبيب",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "4347",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن أيوب، عن أبي قلابة، عن عمرو بن سلمة، قال قال لي أبو قلابة ألا تلقاه فتسأله، قال فلقيته فسألته فقال كنا بماء ممر الناس، وكان يمر بنا الركبان فنسألهم ما للناس ما للناس ما هذا الرجل فيقولون يزعم أن الله أرسله أوحى إليه، أو أوحى الله بكذا‏.‏ فكنت أحفظ ذلك الكلام، وكأنما يغرى في صدري، وكانت العرب تلوم بإسلامهم الفتح، فيقولون اتركوه وقومه، فإنه إن ظهر عليهم فهو نبي صادق‏.‏ فلما كانت وقعة أهل الفتح بادر كل قوم بإسلامهم، وبدر أبي قومي بإسلامهم، فلما قدم قال جئتكم والله من عند النبي صلى الله عليه وسلم حقا فقال ‏\"‏ صلوا صلاة كذا في حين كذا، وصلوا كذا في حين كذا، فإذا حضرت الصلاة، فليؤذن أحدكم، وليؤمكم أكثركم قرآنا ‏\"‏‏.‏ فنظروا فلم يكن أحد أكثر قرآنا مني، لما كنت أتلقى من الركبان، فقدموني بين أيديهم، وأنا ابن ست أو سبع، سنين وكانت على بردة، كنت إذا سجدت تقلصت عني، فقالت امرأة من الحى ألا تغطوا عنا است قارئكم‏.‏ فاشتروا فقطعوا لي قميصا، فما فرحت بشىء فرحي بذلك القميص‏.‏",
      "text_en": " Narrated `Amr bin Salama:                     We were at a place which was a thoroughfare for the people, and the caravans used to pass by us and we would ask them, \"What is wrong with the people? What is wrong with the people? Who is that man?. They would say, \"That man claims that Allah has sent him (as an Apostle), that he has been divinely inspired, that Allah has revealed to him such-and-such.\" I used to memorize that (Divine) Talk, and feel as if it was inculcated in my chest (i.e. mind) And the 'Arabs (other than Quraish) delayed their conversion to Islam till the Conquest (of Mecca). They used to say.\" \"Leave him (i.e. Muhammad) and his people Quraish: if he overpowers them then he is a true Prophet. So, when Mecca was conquered, then every tribe rushed to embrace Islam, and my father hurried to embrace Islam before (the other members of) my tribe. When my father returned (from the Prophet) to his tribe, he said, \"By Allah, I have come to you from the Prophet for sure!\" The Prophet afterwards said to them, 'Offer such-and-such prayer at such-and-such time, and when the time for the prayer becomes due, then one of you should pronounce the Adhan (for the prayer), and let the one amongst you who knows Qur'an most should, lead the prayer.\" So they looked for such a person and found none who knew more Qur'an than I because of the Qur'anic material which I used to learn from the caravans. They therefore made me their Imam ((to lead the prayer) and at that time I was a boy of six or seven years, wearing a Burda (i.e. a black square garment) proved to be very short for me (and my body became partly naked). A lady from the tribe said, \"Won't you cover the anus of your reciter for us?\" So they bought (a piece of cloth) and made a shirt for me. I had never been so happy with anything before as I was with that shirt.",
      "chain": [
        "20193",
        "20022",
        "11015",
        "11047",
        "5206"
      ]
    },
    {
      "hadith_no": "585",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، أخبرنا أيوب، عن عمرو بن سلمة، قال كنا بحاضر يمر بنا الناس إذا أتوا النبي صلى الله عليه وسلم فكانوا إذا رجعوا مروا بنا فأخبرونا أن رسول الله صلى الله عليه وسلم قال كذا وكذا وكنت غلاما حافظا فحفظت من ذلك قرآنا كثيرا فانطلق أبي وافدا إلى رسول الله صلى الله عليه وسلم في نفر من قومه فعلمهم الصلاة فقال ‏\"‏ يؤمكم أقرؤكم ‏\"‏ ‏.‏ وكنت أقرأهم لما كنت أحفظ فقدموني فكنت أؤمهم وعلى بردة لي صغيرة صفراء فكنت إذا سجدت تكشفت عني فقالت امرأة من النساء واروا عنا عورة قارئكم ‏.‏ فاشتروا لي قميصا عمانيا فما فرحت بشىء بعد الإسلام فرحي به فكنت أؤمهم وأنا ابن سبع سنين أو ثمان سنين ‏.‏",
      "text_en": " ‘Amr b. Salamah said ; we lived at a place where the people would pass by us when they came to the prophet (ﷺ). When they returned they would again pass by us. And they used to inform us that the Messenger of Allah (ﷺ) said so –and-so. I was a boy with a good memory. From the( process) I memorized a large portion of the Qur’an. Then my father went to the Messenger of Allah(ﷺ) along with a group of his clan. He (the Prophet) taught them prayer. And he said:                      The one of you who knows most of the Qur’an should act as your imam. I knew the Qur’an better than most of them because I had memorized it. They, therefore, put me in front of them, and I would lead them in prayer. I wore a small yellow mantle which, when I prostrated myself, went up on me, and a woman of the clan said: Cover the back side of your leader from us. So they bought an ‘Ammani shirt for me, and I have never been so pleased about anything after embracing Islam as I was about that (shirt). I used to lead them in prayer and I was only seven or eight year old.",
      "chain": [
        "20040",
        "20022",
        "11015",
        "5206"
      ]
    },
    {
      "hadith_no": "586",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا النفيلي، حدثنا زهير، حدثنا عاصم الأحول، عن عمرو بن سلمة، بهذا الخبر قال فكنت أؤمهم في بردة موصلة فيها فتق فكنت إذا سجدت خرجت استي ‏.‏",
      "text_en": " This tradition has also been transmitted through a different chain by ‘Amr b. Salamah. This version says:                      “I used to lead them in prayer with a sheet of cloth on me that was patched and torn. When I prostrated myself, my buttocks were disclosed.",
      "chain": [
        "30352",
        "20321",
        "11080",
        "5206"
      ]
    },
    {
      "hadith_no": "587",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة، حدثنا وكيع، عن مسعر بن حبيب الجرمي، حدثنا عمرو بن سلمة، عن أبيه، أنهم وفدوا إلى النبي صلى الله عليه وسلم فلما أرادوا أن ينصرفوا قالوا يا رسول الله من يؤمنا قال ‏\"‏ أكثركم جمعا للقرآن ‏\"‏ ‏.‏ أو ‏\"‏ أخذا للقرآن ‏\"‏ ‏.‏ قال فلم يكن أحد من القوم جمع ما جمعته - قال - فقدموني وأنا غلام وعلى شملة لي فما شهدت مجمعا من جرم إلا كنت إمامهم وكنت أصلي على جنائزهم إلى يومي هذا ‏.‏ قال أبو داود ورواه يزيد بن هارون عن مسعر بن حبيب الجرمي عن عمرو بن سلمة قال لما وفد قومي إلى النبي صلى الله عليه وسلم لم يقل عن أبيه ‏.‏",
      "text_en": " ‘Amr b. Salamah reported on the authority of his father (Salamah) that they visited the Prophet (ﷺ). When they intended to return, they said:                      Messenger of Allah, who will lead us in prayer? He said: The one of you who knows most of the Qur’an, or memorizes most of the Qur’an, (should act as your imam). There was none in the clan who knew more of the Qur’an than I did. They, therefore, put me in front of them and I was only a boy. And I wore a mantle, Whenever I was present in the gathering of Jarm (name of his clan), I would act as their Imam, and lead them in their funeral prayer until today.Abu Dawud said: This tradition has been narrated by ‘Amr b. Salamah through a different chain of transmitter. This version has: “When my clan visited the Prophet( may peace be upon him) ....” He did not report it on the authority of his father.",
      "chain": [
        "30367",
        "20032",
        "14360",
        "5206"
      ]
    },
    {
      "hadith_no": "643",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Adhan (The Call to Prayer) - كتاب الأذان",
      "chapter_no": "7",
      "text_ar": "أخبرني إبراهيم بن يعقوب، قال حدثنا سليمان بن حرب، قال حدثنا حماد بن زيد، عن أيوب، عن أبي قلابة، عن عمرو بن سلمة، فقال لي أبو قلابة هو حى أفلا تلقاه ‏.‏ قال أيوب فلقيته فسألته فقال لما كان وقعة الفتح بادر كل قوم بإسلامهم فذهب أبي بإسلام أهل حوائنا فلما قدم استقبلناه فقال جئتكم والله من عند رسول الله صلى الله عليه وسلم حقا فقال ‏\"‏ صلوا صلاة كذا في حين كذا وصلاة كذا في حين كذا فإذا حضرت الصلاة فليؤذن لكم أحدكم وليؤمكم أكثركم قرآنا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ayyub, from Abu Qilabah, from 'Amr bin Salamah:                      \"Abu Qilabah said to me (Ayyub): He ('Amr) is still alive, do you want to meet him?\" I met him and asked him, and he said: \"When Makkah was conquered, all the people hastened to announce their Islam. My father went to announce the Islam of the poeple of our village, and when he came back we went to see him and he said: 'By Allah, I have indeed come to you from the Messenger of Allah (ﷺ)'. He said: 'Pray such and such a prayer at such and such a time, pray such and such a prayer at such and such a time. When the time for prayer comes let one of you call the Adhan and let the one who knows the most Qur'an lead the prayer.'\"",
      "chain": [
        "38088",
        "20193",
        "20022",
        "11015",
        "11047",
        "5206"
      ]
    },
    {
      "hadith_no": "767",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Qiblah - كتاب القبلة",
      "chapter_no": "9",
      "text_ar": "أخبرنا شعيب بن يوسف، قال حدثنا يزيد بن هارون، قال أنبأنا عاصم، عن عمرو بن سلمة، قال لما رجع قومي من عند النبي صلى الله عليه وسلم قالوا إنه قال ‏\"‏ ليؤمكم أكثركم قراءة للقرآن ‏\"‏ ‏.‏ قال فدعوني فعلموني الركوع والسجود فكنت أصلي بهم وكانت على بردة مفتوقة فكانوا يقولون لأبي ألا تغطي عنا است ابنك ‏.‏",
      "text_en": " It was narrated that 'Amr bin Salamah said:                      \"When my people came back from the Prophet (ﷺ)they said that he had said: 'Let the one who recites the Quran most lead you in prayer.' So they called me and taught me how to bow and prostrate, and I used to lead them in prayer, wearing a torn cloak, and they used to say to my father: 'Will you not conceal your son's backside from us?\"'",
      "chain": [
        "20472",
        "11080",
        "5206"
      ]
    },
    {
      "hadith_no": "789",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا موسى بن عبد الرحمن المسروقي، حدثنا حسين بن علي، عن زائدة، عن سفيان، عن أيوب، قال حدثني عمرو بن سلمة الجرمي، قال كان يمر علينا الركبان فنتعلم منهم القرآن فأتى أبي النبي صلى الله عليه وسلم فقال ‏\"‏ ليؤمكم أكثركم قرآنا ‏\"‏ ‏.‏ فجاء أبي فقال إن رسول الله صلى الله عليه وسلم قال ‏\"‏ ليؤمكم أكثركم قرآنا ‏\"‏ ‏.‏ فنظروا فكنت أكثرهم قرآنا فكنت أؤمهم وأنا ابن ثمان سنين ‏.‏",
      "text_en": " 'Amr bin Salamah Al-Jarmi said:                      \"Riders used to pass by us and we would leam the Qur'an from them. My father came to the Prophet (ﷺ) and he said: 'Let the one of you who knows most Qur'an leads the prayer.' My father came and said that the Messenger of Allah (ﷺ) had said: 'Let the one of you who knows most Quran lead you in prayer.' They looked and found that I was the one who knew most Qur'an, so I used to lead them in prayer when I was eight years old.'",
      "chain": [
        "35153",
        "20315",
        "20320",
        "20005",
        "11015",
        "5206"
      ]
    }
  ],
  "total_hadiths": 7
}