{
  "id": "5219",
  "name": "Ghalb bin Abjr ( غالب بن أبجر ( رضي الله عنه",
  "full_name": "Ghalb bin Abjr ( غالب بن أبجر ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Kufa"
    ],
    "area_of_interest": [
      "Narrator [ د  -  صحابي ]"
    ],
    "tags": [
      "al-Mazni",
      "Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "students": [
    {
      "id": "11625",
      "name": "Khalid bin Sa'd al-Kwfy خالد بن سعد الكوفي",
      "grade": "Follower(Tabi') [2nd Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "3809",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا عبد الله بن أبي زياد، حدثنا عبيد الله، عن إسرائيل، عن منصور، عن عبيد أبي الحسن، عن عبد الرحمن، عن غالب بن أبجر، قال أصابتنا سنة فلم يكن في مالي شىء أطعم أهلي إلا شىء من حمر وقد كان رسول الله صلى الله عليه وسلم حرم لحوم الحمر الأهلية فأتيت النبي صلى الله عليه وسلم فقلت يا رسول الله أصابتنا السنة ولم يكن في مالي ما أطعم أهلي إلا سمان الحمر وإنك حرمت لحوم الحمر الأهلية ‏.‏ فقال ‏\"‏ أطعم أهلك من سمين حمرك فإنما حرمتها من أجل جوال القرية ‏\"‏ ‏.‏ يعني الجلالة ‏.‏ قال أبو داود عبد الرحمن هذا هو ابن معقل ‏.‏ قال أبو داود روى شعبة هذا الحديث عن عبيد أبي الحسن عن عبد الرحمن بن معقل عن عبد الرحمن بن بشر عن ناس من مزينة أن سيد مزينة أبجر أو ابن أبجر سأل النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Ghalib ibn Abjar:                     We faced a famine, and I had nothing from my property which I could feed my family ex except a few asses, and the Prophet (ﷺ) forbade the flesh of domestic asses. So I came to the Prophet (ﷺ) and said: Messenger of Allah (may peace be upon) , we are suffering from famine, and I have no property which I feed my family except some fat asses, and you have forbidden the flesh of domestic asses. He said: Feed your family on the fat asses of yours, for I forbade them on account of the animal which feeds on the filth of the town, that is, the animal which feeds on filth.Abu Dawud said: This 'Abd al-Rahman is Ibn Ma'qil.Abu Dawud said: Suh'bah transmitted this tradition from 'Ubaid Abi al-Hasan, from 'Abd al-Rahman bin Maq'il, from'Abd al-Rahman bin Bishr, from some people of Muzainah stating that Abjar, the chief of Muzainah, or Ibn Abjar asked the Prophet (ﷺ).",
      "chain": [
        "11201",
        "20311",
        "11067",
        "10796",
        "10530",
        "5219"
      ]
    }
  ],
  "total_hadiths": 1
}