{
  "id": "5226",
  "name": "Frwh bin Msyk ( فروة بن مسيك ( رضي الله عنه",
  "full_name": "Frwh bin Msyk ( فروة بن مسيك ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Kufa"
    ],
    "area_of_interest": [
      "Narrator [ د  ت  -  صحابي ]"
    ],
    "tags": [
      "Kufa"
    ],
    "area_of_interest_display": [
      {
        "en": "Narrator [ د  ت  -  صحابي ]",
        "ar": "Narrator [ د  ت  -  صحابي ]",
        "ckb": "Narrator [ د  ت  -  صحابي ]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "Kufa",
        "ar": "الكوفة",
        "ckb": "كوفە"
      }
    ],
    "tags_display": [
      {
        "en": "Kufa",
        "ar": "Kufa",
        "ckb": "Kufa"
      }
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah",
      "grade_display": {
        "en": "Messenger of Allah",
        "ar": "رسول الله",
        "ckb": "پێغەمبەری خودا"
      }
    },
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah",
      "grade_display": {
        "en": "Messenger of Allah",
        "ar": "رسول الله",
        "ckb": "پێغەمبەری خودا"
      }
    }
  ],
  "students": [
    {
      "id": "15674",
      "name": "Abu Sbrh أبو سبرة",
      "grade": "Follower(Tabi') [3rd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [3rd Generation]",
        "ar": "تابعي [الجيل الثالث]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
      }
    },
    {
      "id": "11052",
      "name": "'Amir al-Sha'bi عامر الشعبي",
      "grade": "Follower(Tabi') [3rd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [3rd Generation]",
        "ar": "تابعي [الجيل الثالث]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
      }
    },
    {
      "id": "18348",
      "name": "Sa'id bin 'Ubaid bin Hamal سعيد بن أبيض بن حمال",
      "grade": "Follower(Tabi') [3rd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [3rd Generation]",
        "ar": "تابعي [الجيل الثالث]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
      }
    }
  ],
  "hadiths": [
    {
      "id": "sunan-abi-daud-3923",
      "hadith_no": "3923",
      "source": "Sunan Abi Da'ud",
      "chapter": "Divination and Omens (Kitab Al-Kahanah Wa Al-Tatayyur) - كتاب الكهانة و التطير",
      "chapter_no": "30",
      "text_ar": "حدثنا مخلد بن خالد، وعباس العنبري، قالا حدثنا عبد الرزاق، أخبرنا معمر، عن يحيى بن عبد الله بن بحير، قال أخبرني من، سمع فروة بن مسيك، قال قلت يا رسول الله أرض عندنا يقال لها أرض أبين هي أرض ريفنا وميرتنا وإنها وبئة أو قال وباؤها شديد ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ دعها عنك فإن من القرف التلف ‏\"‏ ‏.‏",
      "text_en": " Yahya ibn Abdullah ibn Buhayr said that he was informed by one who had heard Farwah ibn Musayk tell that he said:                      Messenger of Allah! we have land called Abyan, which is the land where we have our fields and grow our crops, but it is very unhealthy. The Prophet (ﷺ) said: Leave it, for destruction comes from being near disease.",
      "usc_msa_ref": "",
      "chain": [
        "30567",
        "30437",
        "20121",
        "20115",
        "5226"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-3988",
      "hadith_no": "3988",
      "source": "Sunan Abi Da'ud",
      "chapter": "Dialects and Readings of the Qur'an (Kitab Al-Huruf Wa Al-Qira'at) - كتاب الحروف والقراءات",
      "chapter_no": "32",
      "text_ar": "حدثنا عثمان بن أبي شيبة، وهارون بن عبد الله، قالا حدثنا أبو أسامة، حدثني الحسن بن الحكم النخعي، حدثنا أبو سبرة النخعي، عن فروة بن مسيك الغطيفي، قال أتيت النبي صلى الله عليه وسلم فذكر الحديث فقال رجل من القوم يا رسول الله أخبرنا عن سبإ ما هو أرض أم امرأة فقال ‏\"‏ ليس بأرض ولا امرأة ولكنه رجل ولد عشرة من العرب فتيامن ستة وتشاءم أربعة ‏\"‏ ‏.‏ قال عثمان الغطفاني مكان الغطيفي وقال حدثنا الحسن بن الحكم النخعي ‏.‏",
      "text_en": " Narrated Farwah ibn Musayk al-Ghutayfi:                     I came to the Prophet (ﷺ). He then narrated the rest of the tradition. A man from the people said: \"Messenger of Allah! tell us about Saba'; what is it: land or woman? He replied: It is neither land nor woman; it is a man to whom ten children of the Arabs were born: six of them lived in the Yemen and four lived in Syria. The narrator Uthman said al-Ghatafani instead of al-Ghutayfi. He said: It has been transmitted to us by al-Hasan ibn al-Hakam an-Nakha'i.",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "30524",
        "20318",
        "15089",
        "15674",
        "5226"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "jami-al-tirmidhi-3528",
      "hadith_no": "3528",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا أبو كريب، وعبد بن حميد، وغير، واحد، قالوا أخبرنا أبو أسامة، عن الحسن بن الحكم النخعي، حدثنا أبو سبرة النخعي، عن فروة بن مسيك المرادي، قال أتيت النبي صلى الله عليه وسلم فقلت يا رسول الله ألا أقاتل من أدبر من قومي بمن أقبل منهم فأذن لي في قتالهم وأمرني فلما خرجت من عنده سأل عني ما فعل الغطيفي فأخبر أني قد سرت قال فأرسل في أثري فردني فأتيته وهو في نفر من أصحابه فقال ‏\"‏ ادع القوم فمن أسلم منهم فاقبل منه ومن لم يسلم فلا تعجل حتى أحدث إليك ‏\"‏ ‏.‏ قال وأنزل في سبإ ما أنزل فقال رجل يا رسول الله وما سبأ أرض أو امرأة قال ‏\"‏ ليس بأرض ولا امرأة ولكنه رجل ولد عشرة من العرب فتيامن منهم ستة وتشاءم منهم أربعة فأما الذين تشاءموا فلخم وجذام وغسان وعاملة وأما الذين تيامنوا فالأزد والأشعريون وحمير ومذحج وأنمار وكندة ‏\"‏ ‏.‏ فقال رجل يا رسول الله وما أنمار قال ‏\"‏ الذين منهم خثعم وبجيلة ‏\"‏ ‏.‏ وروي هذا عن ابن عباس عن النبي صلى الله عليه وسلم ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Narrated Farwah bin Musaik Al-Muradi:                     \"I went to the Prophet (ﷺ) and said: 'O Messenger of Allah! Shall I not fight those who turn away among my people, along with those who believe? So he permitted me to fight them and made me their commander.' When I left him, he asked me, saying: 'What has Al-Ghutaifi done?' He was informed that I set off on my journey.\" He said: \"So he sent a message on my route that I should return. I went to him and he was with a group of his Companions. He said: 'Invite your people. Whoever accepts Islam among them then accept it from him. And whoever does not accept Islam, then do not be hasty until new news reaches you.'\" He said: \"And what was revealed about Saba was revealed, so a man said: 'O Messenger of Allah! What is Saba; is it a land or a woman?' He said: 'It is neither a land nor a woman, but it is a man who had ten sons among the Arabs. Six of them went south (in Yemen) and four of them went north (toward Ash-Sham). As for those who went north, they are Lakhm, Judham, Ghassan and 'Amilah. As for those who sent south, they are Azad, Al-'Ash'ariyyun, Himyar, Kindah, Madhhij, and Anmar.' A man said: 'O Messenger of Allah! Who are Anmar?' He said: 'Those among whom are Khath'am and Bajilah.'\" [This Hadith has been related from Ibn 'Abbas from the Prophet (ﷺ)].",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "30553",
        "20318",
        "15089",
        "15674",
        "5226"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    }
  ],
  "total_hadiths": 3,
  "grade_display": {
    "en": "Companion (RA) [1st Generation]",
    "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
    "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
  }
}