{
  "id": "5229",
  "name": "Fyrwz al-Dylmy ( فيروز الديلمي ( رضي الله عنه",
  "full_name": "Fyrwz al-Dylmy ( فيروز الديلمي ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "0",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Yemen"
    ],
    "area_of_interest": [
      "Narrator [ 4  -  صحابي ]"
    ],
    "tags": [
      "al-Yemeni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "students": [],
  "hadiths": [
    {
      "id": "sunan-abi-daud-3710",
      "hadith_no": "3710",
      "source": "Sunan Abi Da'ud",
      "chapter": "Drinks (Kitab Al-Ashribah) - كتاب الأشربة",
      "chapter_no": "27",
      "text_ar": "حدثنا عيسى بن محمد، حدثنا ضمرة، عن السيباني، عن عبد الله بن الديلمي، عن أبيه، قال أتينا رسول الله صلى الله عليه وسلم فقلنا يا رسول الله قد علمت من نحن ومن أين نحن فإلى من نحن قال ‏\"‏ إلى الله وإلى رسوله ‏\"‏ ‏.‏ فقلنا يا رسول الله إن لنا أعنابا ما نصنع بها قال ‏\"‏ زببوها ‏\"‏ ‏.‏ قلنا ما نصنع بالزبيب قال ‏\"‏ انبذوه على غدائكم واشربوه على عشائكم وانبذوه على عشائكم واشربوه على غدائكم وانبذوه في الشنان ولا تنبذوه في القلل فإنه إذا تأخر عن عصره صار خلا ‏\"‏ ‏.‏",
      "text_en": " Narrated Ad-Daylami:                     We came to the Prophet (ﷺ) and said to him: Messenger of Allah, you know who we are, from where we are and to whom we have come. He said: To Allah and His Apostle. We said: Messenger of Allah, we have grapes; what should we do with them? He said: Make them raisins. We then asked: What should we do with raisins? He replied: Steep them in the morning and drink in the evening, and steep them in the evening and drink in the morning. Steep them in skin vessels and do not steep them in earthen jar, for it it is delayed in pressing, it becomes vinegar.",
      "usc_msa_ref": "",
      "chain": [
        "20738",
        "19340",
        "5136",
        "5229"
      ]
    },
    {
      "id": "sunan-an-nasai-5736",
      "hadith_no": "5736",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا عيسى بن محمد أبو عمير بن النحاس، عن ضمرة، عن الشيباني، عن ابن الديلمي، عن أبيه، قال قلنا يا رسول الله إن لنا أعنابا فماذا نصنع بها قال ‏\"‏ زببوها ‏\"‏ ‏.‏ قلنا فما نصنع بالزبيب قال ‏\"‏ انبذوه على غدائكم واشربوه على عشائكم وانبذوه على عشائكم واشربوه على غدائكم وانبذوه في الشنان ولا تنبذوه في القلال فإنه إن تأخر صار خلا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn Al-Dailami that his father said:                     \"We said: 'O Messenger of Allah, we have grapevines; what should we do with them?' He said: 'Make raisins.' We said: 'What should we do with the raisins?' He said: 'Soak them in the morning and drink them in the evening, and soak them in the evening and drink them in the morning.' I said: 'Can we leave it until it gets stronger?' He said: 'Do not put it in clay vessels, rather put it in skins, for if it stays there for a long time, it will turn into vinegar.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20738",
        "11352",
        "5136",
        "5229"
      ]
    }
  ],
  "total_hadiths": 2
}