{
  "id": "5265",
  "name": "Malik bin al-Hwyrth ( مالك بن الحويرث ( رضي الله عنه",
  "full_name": "Malik bin al-Hwyrth ( مالك بن الحويرث ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "74",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator [ ع  -  صحابي ]"
    ],
    "tags": [
      "al-Laithi",
      "al-Basra"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "students": [
    {
      "id": "11047",
      "name": "Abu Qalaba, 'Abdullah bin Zayd al-Jarmi عبد الله بن زيد بن عمرو",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19331",
      "name": "Abu Atyh Mwla biny Aqyl أبو عطية مولى بني عقيل",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10724",
      "name": "Nsr bin 'Asim al-Lythy نصر بن عاصم الليثي البصري",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "630",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن يوسف، قال حدثنا سفيان، عن خالد الحذاء، عن أبي قلابة، عن مالك بن الحويرث، قال أتى رجلان النبي صلى الله عليه وسلم يريدان السفر فقال النبي صلى الله عليه وسلم ‏\"‏ إذا أنتما خرجتما فأذنا ثم أقيما ثم ليؤمكما أكبركما ‏\"‏‏.‏",
      "text_en": " Narrated Malik bin Huwairith:                     Two men came to the Prophet with the intention of a journey. The Prophet said, \"When (both of) you set out, pronounce Adhan and then Iqama and the oldest of you should lead the prayer.\"",
      "chain": [
        "30388",
        "20005",
        "11282",
        "11047",
        "5265"
      ]
    },
    {
      "hadith_no": "658",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا مسدد، قال حدثنا يزيد بن زريع، قال حدثنا خالد، عن أبي قلابة، عن مالك بن الحويرث، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا حضرت الصلاة فأذنا وأقيما، ثم ليؤمكما أكبركما ‏\"‏‏.‏",
      "text_en": " Narrated Malik bin Huwairith:                     Prophet said (to two persons), \"Whenever the prayer time becomes due, you should pronounce Adhan and then Iqama and the older of you should lead the prayer.\"",
      "chain": [
        "30175",
        "20304",
        "11282",
        "11047",
        "5265"
      ]
    },
    {
      "hadith_no": "685",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا حماد بن زيد، عن أيوب، عن أبي قلابة، عن مالك بن الحويرث، قال قدمنا على النبي صلى الله عليه وسلم ونحن شببة، فلبثنا عنده نحوا من عشرين ليلة، وكان النبي صلى الله عليه وسلم رحيما فقال ‏\"‏ لو رجعتم إلى بلادكم فعلمتموهم، مروهم فليصلوا صلاة كذا في حين كذا، وصلاة كذا في حين كذا، وإذا حضرت الصلاة فليؤذن لكم أحدكم، وليؤمكم أكبركم ‏\"‏‏.‏",
      "text_en": " Narrated Malik bin Huwairith:                     We went to the Prophet and we were all young men and stayed with him for about twenty nights. The Prophet was very merciful. He said, \"When you return home, impart religious teachings to your families and tell them to offer perfectly such and such a prayer at such and such a time and such and such a prayer at such and such a time. And al the time of the prayer one of you should pronounce the Adhan and the oldest of you should lead the prayer.\"",
      "chain": [
        "20193",
        "20022",
        "11015",
        "11047",
        "5265"
      ]
    },
    {
      "hadith_no": "802",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا حماد بن زيد، عن أيوب، عن أبي قلابة، قال كان مالك بن الحويرث يرينا كيف كان صلاة النبي صلى الله عليه وسلم وذاك في غير وقت صلاة، فقام فأمكن القيام، ثم ركع فأمكن الركوع، ثم رفع رأسه فأنصت هنية، قال فصلى بنا صلاة شيخنا هذا أبي بريد‏.‏ وكان أبو بريد إذا رفع رأسه من السجدة الآخرة استوى قاعدا ثم نهض‏.‏",
      "text_en": " Narrated Aiyub:                     Abu Qilaba said, \"Malik bin Huwairith used to demonstrate to us the prayer of the Prophet at times other than that of the compulsory prayers. So (once) he stood up for prayer and performed a perfect Qiyam (standing and reciting from the Holy Qur'an) and then bowed and performed bowing perfectly; then he raised his head and stood straight for a while.\" Abu Qilaba added, \"Malik bin Huwairith in that demonstration prayed like this Sheikh of ours, Abu Yazid.\" Abu, Yazid used to sit (for a while) on raising his head from the second prostration before getting up.",
      "chain": [
        "20193",
        "20022",
        "11015",
        "11047",
        "5265"
      ]
    },
    {
      "hadith_no": "819",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو النعمان، قال حدثنا حماد، عن أيوب، عن أبي قلابة، أن مالك بن الحويرث، قال لأصحابه ألا أنبئكم صلاة رسول الله صلى الله عليه وسلم قال وذاك في غير حين صلاة، فقام، ثم ركع فكبر ثم رفع رأسه، فقام هنية، ثم سجد ثم رفع رأسه هنية، فصلى صلاة عمرو بن سلمة شيخنا هذا‏.‏ قال أيوب كان يفعل شيئا لم أرهم يفعلونه، كان يقعد في الثالثة والرابعة‏.‏ قال فأتينا النبي صلى الله عليه وسلم فأقمنا عنده فقال ‏\"‏ لو رجعتم إلى أهليكم صلوا صلاة كذا في حين كذا، صلوا صلاة كذا في حين كذا، فإذا حضرت الصلاة فليؤذن أحدكم وليؤمكم أكبركم ‏\"‏",
      "text_en": " Narrated Abu Qilaba:                     Once Malik bin Huwairith said to his friends, \"Shall I show you how Allah's Apostle used to offer his prayers?\" And it was not the time for any of the compulsory congregational prayers. So he stood up (for the prayer) bowed and said the Takbir, then he raised his head and remained standing for a while and then prostrated and raised his head for a while (sat up for a while). He prayed like our Sheikh `Amr Ibn Salama. (Aiyub said, \"The latter used to do a thing which I did not see the people doing i.e. he used to sit between the third and the fourth rak`a). Malik bin Huwairith said, \"We came to the Prophet (after embracing Islam) and stayed with him. He said to us, 'When you go back to your families, pray such and such a prayer at such and such a time, pray such and such a prayer at such and such a time, and when there is the time for the prayer then only of you should pronounce the Adhan for the prayer and the oldest of you should lead the prayer.\"",
      "chain": [
        "20283",
        "20022",
        "11015",
        "11047",
        "5265"
      ]
    },
    {
      "hadith_no": "823",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن الصباح، قال أخبرنا هشيم، قال أخبرنا خالد الحذاء، عن أبي قلابة، قال أخبرنا مالك بن الحويرث الليثي، أنه رأى النبي صلى الله عليه وسلم يصلي، فإذا كان في وتر من صلاته لم ينهض حتى يستوي قاعدا‏.‏",
      "text_en": " Narrated Malik bin Huwairith Al-Laithi:                     I saw the Prophet praying and in the odd rak`at, he used to sit for a moment before getting up.",
      "chain": [
        "30269",
        "20468",
        "11282",
        "11047",
        "5265"
      ]
    },
    {
      "hadith_no": "2848",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا أبو شهاب، عن خالد الحذاء، عن أبي قلابة، عن مالك بن الحويرث، قال انصرفت من عند النبي صلى الله عليه وسلم، فقال لنا أنا وصاحب لي ‏\"‏ أذنا وأقيما، وليؤمكما أكبركما ‏\"‏‏.‏",
      "text_en": " Narrated Malik bin Al-Huwairith:                     On my departure from the Prophet he said to me and to a friend of mine, \"You two, pronounce the Adhan and the Iqama for the prayer and let the elder of you lead the prayer.\"",
      "chain": [
        "30184",
        "11613",
        "11282",
        "11047",
        "5265"
      ]
    },
    {
      "hadith_no": "6076",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا مسدد، حدثنا إسماعيل، حدثنا أيوب، عن أبي قلابة، عن أبي سليمان، مالك بن الحويرث قال أتينا النبي صلى الله عليه وسلم ونحن شببة متقاربون، فأقمنا عنده عشرين ليلة، فظن أنا اشتقنا أهلنا، وسألنا عمن تركنا في أهلنا، فأخبرناه، وكان رفيقا رحيما فقال ‏\"‏ ارجعوا إلى أهليكم فعلموهم ومروهم، وصلوا كما رأيتموني أصلي، وإذا حضرت الصلاة فليؤذن لكم أحدكم، ثم ليؤمكم أكبركم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sulaiman and Malik bin Huwairith:                     We came to the Prophet and we were (a few) young men of approximately equal age and stayed with him for twenty nights. Then he thought that we were anxious for our families, and he asked us whom we had left behind to look after our families, and we told him. He was kindhearted and merciful, so he said, \"Return to your families and teach them (religious knowledge) and order them (to do good deeds) and offer your prayers in the way you saw me offering my prayers, and when the stated time for the prayer becomes due, then one of you should pronounce its call (i.e. the Adhan), and the eldest of you should lead you in prayer.",
      "chain": [
        "30175",
        "20208",
        "11015",
        "11047",
        "5265"
      ]
    },
    {
      "hadith_no": "391",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثني أبو كامل الجحدري، حدثنا أبو عوانة، عن قتادة، عن نصر بن عاصم، عن مالك بن الحويرث، أن رسول الله صلى الله عليه وسلم كان إذا كبر رفع يديه حتى يحاذي بهما أذنيه وإذا ركع رفع يديه حتى يحاذي بهما أذنيه وإذا رفع رأسه من الركوع فقال ‏\"‏ سمع الله لمن حمده ‏\"‏ ‏.‏ فعل مثل ذلك ‏.‏",
      "text_en": " Malik b. Huwairith reported:                      The Messenger of Allah (may peace be upon him) raised his hands apposite his ears at the time of reciting the takbir (i. e. at the time of beginning the prayer) and then again raised his hands apposite the ears at the time of bowing and when he lifted his head after bowing he said: Allah listened to him who praised Him, and did like it (raised his hands up to the ears).",
      "chain": [
        "30559",
        "20469",
        "11019",
        "10724",
        "5265"
      ]
    },
    {
      "hadith_no": "1567",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني زهير بن حرب، حدثنا إسماعيل بن إبراهيم، حدثنا أيوب، عن أبي قلابة، عن مالك بن الحويرث، قال أتينا رسول الله صلى الله عليه وسلم ونحن شببة متقاربون فأقمنا عنده عشرين ليلة وكان رسول الله صلى الله عليه وسلم رحيما رقيقا فظن أنا قد اشتقنا أهلنا فسألنا عن من تركنا من أهلنا فأخبرناه فقال ‏\"‏ ارجعوا إلى أهليكم فأقيموا فيهم وعلموهم ومروهم فإذا حضرت الصلاة فليؤذن لكم أحدكم ثم ليؤمكم أكبركم ‏\"‏ ‏.‏",
      "text_en": " Malik b. Huwairith rejected:                      We came to the Messenger of Allah (may peace be upon him) and we were all young men of nearly equal age. We stayed with him (the Holy Prophet) for twenty nights, and as the Messenger of Allah may peace be upon him) was extremely kind and tender of heart, he. therefore, thought that we were eager (to see) our family (we felt home-sickness). So he asked us about the members of the family that we had left behind and when we informed him, he said: Go back to your family, stay with them, and teach them (beliefs and practices of Islam) and exhort them to good, and when the time for prayer comes, one amongst you should-announce Adzan and then the oldest among you should lead the prayer.",
      "chain": [
        "30022",
        "20208",
        "11015",
        "11047",
        "5265"
      ]
    },
    {
      "hadith_no": "1569",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثناه ابن أبي عمر، حدثنا عبد الوهاب، عن أيوب، قال قال لي أبو قلابة حدثنا مالك بن الحويرث أبو سليمان، قال أتيت رسول الله صلى الله عليه وسلم في ناس ونحن شببة متقاربون ‏.‏ واقتصا جميعا الحديث بنحو حديث ابن علية ‏.‏",
      "text_en": " Malik b. Huwairith Abu Sulaiman reported:                      I came to the Messenger of Allah (may peace be upon him) along with other persons and we were young men of nearly equal age, and the rest of the hadith was transmitted like the hadith narrated before.",
      "chain": [
        "30421",
        "20259",
        "11015",
        "11047",
        "5265"
      ]
    },
    {
      "hadith_no": "1570",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا إسحاق بن إبراهيم الحنظلي، أخبرنا عبد الوهاب الثقفي، عن خالد الحذاء، عن أبي قلابة، عن مالك بن الحويرث، قال أتيت النبي صلى الله عليه وسلم أنا وصاحب لي فلما أردنا الإقفال من عنده قال لنا ‏\"‏ إذا حضرت الصلاة فأذنا ثم أقيما وليؤمكما أكبركما ‏\"‏ ‏.‏",
      "text_en": " Malik b Huwairith reported:                      I came to the Apostle of Allah (may peace be upon him) along with a companion of mine, and when we intended to return from him, he said: When there is time for prayer, announce prayer, pronounce Iqama, and the oldest amongst you should lead the prayer.",
      "chain": [
        "30021",
        "20259",
        "11282",
        "11047",
        "5265"
      ]
    },
    {
      "hadith_no": "589",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، حدثنا إسماعيل، ح وحدثنا مسدد، حدثنا مسلمة بن محمد، - المعنى واحد - عن خالد، عن أبي قلابة، عن مالك بن الحويرث، أن النبي صلى الله عليه وسلم قال له أو لصاحب له ‏\"‏ إذا حضرت الصلاة فأذنا ثم أقيما ثم ليؤمكما أكبركما ‏\"‏ ‏.‏ وفي حديث مسلمة قال وكنا يومئذ متقاربين في العلم ‏.‏ وقال في حديث إسماعيل قال خالد قلت لأبي قلابة فأين القرآن قال إنهما كانا متقاربين ‏.‏",
      "text_en": " Malik b. al-Huwairith said that the Prophet( may peace be upon him) told him or some of his companions:                      When the time of prayer comes, call the Adhan, then call the iqamah, then the one who is oldest of you should act as your imam.The version narrated by Maslamah goes : He said: On that day we were almost equal in knowledge.The version narrated by Isma’il says: Khalid said: I said to Abu Qilabah: where is the Qur’an(i.e. why did the Prophet(ﷺ)  not say: The one who knows the Qur’an most should act as imam)? He replied: Both of them were equal in the knowledge of the Qur’an.",
      "chain": [
        "30175",
        "20208",
        "30175",
        "20423",
        "11047",
        "5265"
      ]
    },
    {
      "hadith_no": "745",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن قتادة، عن نصر بن عاصم، عن مالك بن الحويرث، قال رأيت النبي صلى الله عليه وسلم يرفع يديه إذا كبر وإذا ركع وإذا رفع رأسه من الركوع حتى يبلغ بهما فروع أذنيه ‏.‏",
      "text_en": " Malik b. al-Huwairith said:                      I saw the Prophet (ﷺ) raise his hands when he uttered the takbir (Allah is most great), when he bowed and when he raised his head after bowing until he brought them to the lobes of his ears.",
      "chain": [
        "30329",
        "20020",
        "11019",
        "10724",
        "5265"
      ]
    },
    {
      "hadith_no": "844",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، حدثنا هشيم، عن خالد، عن أبي قلابة، عن مالك بن الحويرث، أنه رأى النبي صلى الله عليه وسلم إذا كان في وتر من صلاته لم ينهض حتى يستوي قاعدا ‏.‏",
      "text_en": " Abu Qilabah said:                      Malik b. al-Huwairith saw that the prophet (may peace by upon him) would not stand at the end of the first or the third rak’ah until he sat down straight.",
      "chain": [
        "30175",
        "20468",
        "11282",
        "11047",
        "5265"
      ]
    },
    {
      "hadith_no": "205",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا وكيع، عن سفيان، عن خالد الحذاء، عن أبي قلابة، عن مالك بن الحويرث، قال قدمت على رسول الله صلى الله عليه وسلم أنا وابن عم لي فقال لنا ‏\"‏ إذا سافرتما فأذنا وأقيما وليؤمكما أكبركما ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ والعمل عليه عند أكثر أهل العلم اختاروا الأذان في السفر ‏.‏ وقال بعضهم تجزئ الإقامة إنما الأذان على من يريد أن يجمع الناس ‏.‏ والقول الأول أصح ‏.‏ وبه يقول أحمد وإسحاق ‏.‏",
      "text_en": " Malik bin Al-Huwairih said:                     \"A cousin of mine and I arrived as guests of Allah's Messenger. He said to us: 'When you travel then call the Adhan and Iqamah and let the eldest of you lead the prayer.'\"",
      "chain": [
        "30277",
        "20032",
        "20012",
        "11282",
        "11047",
        "5265"
      ]
    },
    {
      "hadith_no": "256",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "قال أبو عيسى حدثنا الفضل بن الصباح البغدادي، حدثنا سفيان بن عيينة، حدثنا الزهري، بهذا الإسناد نحو حديث ابن أبي عمر ‏.‏ قال وفي الباب عن عمر، وعلي، ووائل بن حجر، ومالك بن الحويرث، وأنس، وأبي، هريرة وأبي حميد وأبي أسيد وسهل بن سعد ومحمد بن مسلمة وأبي قتادة وأبي موسى الأشعري وجابر وعمير الليثي ‏.‏ قال أبو عيسى حديث ابن عمر حديث حسن صحيح ‏.‏ وبهذا يقول بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم منهم ابن عمر وجابر بن عبد الله وأبو هريرة وأنس وابن عباس وعبد الله بن الزبير وغيرهم ومن التابعين الحسن البصري وعطاء وطاوس ومجاهد ونافع وسالم بن عبد الله وسعيد بن جبير وغيرهم ‏.‏ وبه يقول مالك ومعمر والأوزاعي وابن عيينة وعبد الله بن المبارك والشافعي وأحمد وإسحاق ‏.‏ وقال عبد الله بن المبارك قد ثبت حديث من يرفع يديه وذكر حديث الزهري عن سالم عن أبيه ولم يثبت حديث ابن مسعود أن النبي صلى الله عليه وسلم لم يرفع يديه إلا في أول مرة ‏.‏ حدثنا بذلك أحمد بن عبدة الآملي حدثنا وهب بن زمعة عن سفيان بن عبد الملك عن عبد الله بن المبارك ‏.‏ قال وحدثنا يحيى بن موسى قال حدثنا إسماعيل بن أبي أويس قال كان مالك بن أنس يرى رفع اليدين في الصلاة ‏.‏ وقال يحيى وحدثنا عبد الرزاق قال كان معمر يرى رفع اليدين في الصلاة ‏.‏ وسمعت الجارود بن معاذ يقول كان سفيان بن عيينة وعمر بن هارون والنضر بن شميل يرفعون أيديهم إذا افتتحوا الصلاة وإذا ركعوا وإذا رفعوا رءوسهم ‏.‏",
      "text_en": " Salim narrated:                     Same as 255 (above) with a different chain",
      "chain": [
        "36613",
        "20005",
        "11013",
        "3",
        "5",
        "3045",
        "5265",
        "19"
      ]
    },
    {
      "hadith_no": "287",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا علي بن حجر، أخبرنا هشيم، عن خالد الحذاء، عن أبي قلابة، عن مالك بن الحويرث الليثي، أنه رأى النبي صلى الله عليه وسلم يصلي فكان إذا كان في وتر من صلاته لم ينهض حتى يستوي جالسا ‏.‏ قال أبو عيسى حديث مالك بن الحويرث حديث حسن صحيح ‏.‏ والعمل عليه عند بعض أهل العلم ‏.‏ وبه يقول إسحاق وبعض أصحابنا ‏.‏ ومالك يكنى أبا سليمان ‏.‏",
      "text_en": " Malik bin Al-Huwairith Al-Laithi narrated that he saw :                     Allah's Messenger performing Salat. When he was in an odd number of his Salat, he would not get up until he had sat completely.",
      "chain": [
        "20387",
        "20468",
        "11282",
        "11047",
        "5265"
      ]
    },
    {
      "hadith_no": "356",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمود بن غيلان، وهناد، قالا حدثنا وكيع، عن أبان بن يزيد العطار، عن بديل بن ميسرة العقيلي، عن أبي عطية، رجل منهم قال كان مالك بن الحويرث يأتينا في مصلانا يتحدث فحضرت الصلاة يوما فقلنا له تقدم ‏.‏ فقال ليتقدم بعضكم حتى أحدثكم لم لا أتقدم سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من زار قوما فلا يؤمهم وليؤمهم رجل منهم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ والعمل على هذا عند أكثر أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم قالوا صاحب المنزل أحق بالإمامة من الزائر ‏.‏ وقال بعض أهل العلم إذا أذن له فلا بأس أن يصلي به ‏.‏ وقال إسحاق بحديث مالك بن الحويرث وشدد في أن لا يصلي أحد بصاحب المنزل وإن أذن له صاحب المنزل ‏.‏ قال وكذلك في المسجد لا يصلي بهم في المسجد إذا زارهم يقول ليصل بهم رجل منهم ‏.‏",
      "text_en": " Abu Atiyyah narrated that :                     a man among them said: \"Malik bin Al-Huwairith came to us in our Musalla to narrate. One day when it was time for Salat, we told him to go ahead (to lead the prayer). He said: 'Let one of you go forward, until I narrate to you why I would not go forward (to lead prayer): I heard Allah's Messenger saying: \"Whoever visits a people, then he does not lead them, but a man among them leads them.\"",
      "chain": [
        "30277",
        "30480",
        "20032",
        "20205",
        "10672",
        "5265"
      ]
    },
    {
      "hadith_no": "641",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Adhan (The Call to Prayer) - كتاب الأذان",
      "chapter_no": "7",
      "text_ar": "أخبرنا حاجب بن سليمان، عن وكيع، عن سفيان، عن خالد الحذاء، عن أبي قلابة، عن مالك بن الحويرث، قال أتيت النبي صلى الله عليه وسلم أنا وابن عم لي وقال مرة أخرى أنا وصاحب لي فقال ‏\"‏ إذا سافرتما فأذنا وأقيما وليؤمكما أكبركما ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Malik bin Al-Huwairith said:                      \"I came to the Prophet (ﷺ) with a cousin of mine\" - on an another occasion he said: \"with a companion of mine\" - \"and he said: 'When the two of you travel, call the Adhan and the Iqamah, and let the older of you lead the prayer.'\"",
      "chain": [
        "38136",
        "20032",
        "20012",
        "11282",
        "11047",
        "5265"
      ]
    },
    {
      "hadith_no": "642",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Adhan (The Call to Prayer) - كتاب الأذان",
      "chapter_no": "7",
      "text_ar": "أخبرني زياد بن أيوب، قال حدثنا إسماعيل، قال حدثنا أيوب، عن أبي قلابة، عن مالك بن الحويرث، قال أتينا رسول الله صلى الله عليه وسلم ونحن شببة متقاربون فأقمنا عنده عشرين ليلة وكان رسول الله صلى الله عليه وسلم رحيما رفيقا فظن أنا قد اشتقنا إلى أهلنا فسألنا عمن تركناه من أهلنا فأخبرناه فقال ‏\"‏ ارجعوا إلى أهليكم فأقيموا عندهم وعلموهم ومروهم إذا حضرت الصلاة فليؤذن لكم أحدكم وليؤمكم أكبركم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Malik bin Al-Huwairith said:                      \"We came to the Messenger of Allah (ﷺ) and we were young men close in age. He let us stay with him for twenty days. The Messenger of Allah (ﷺ) was merciful and compassionate, and he thought that we were missing our families; he asked us about those whom we had left behind of our families, so we told him, and he said: 'Go back to your families, stay with them and teach them. Tell them when the time for prayer comes; let one of you call the Adhan and let the oldest of you lead the prayer.'\"",
      "chain": [
        "30249",
        "20208",
        "11015",
        "11047",
        "5265"
      ]
    },
    {
      "hadith_no": "677",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Adhan (The Call to Prayer) - كتاب الأذان",
      "chapter_no": "7",
      "text_ar": "أخبرنا علي بن حجر، قال أنبأنا إسماعيل، عن خالد الحذاء، عن أبي قلابة، عن مالك بن الحويرث، قال قال لي رسول الله صلى الله عليه وسلم ولصاحب لي ‏\"‏ إذا حضرت الصلاة فأذنا ثم أقيما ثم ليؤمكما أحدكما ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Malik bin Al-Huwayrith said:                      \"The Messenger of Allah (ﷺ) said to me and to a companion of mine: 'When the time for prayer comes, let the two of you call the Adhan then the two of you say Iqamah, then let one of you lead the prayer.'\"",
      "chain": [
        "20387",
        "20208",
        "11282",
        "11047",
        "5265"
      ]
    },
    {
      "hadith_no": "781",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا حاجب بن سليمان المنبجي، عن وكيع، عن سفيان، عن خالد الحذاء، عن أبي قلابة، عن مالك بن الحويرث، قال أتيت رسول الله صلى الله عليه وسلم أنا وابن عم لي - وقال مرة أنا وصاحب لي - فقال ‏\"‏ إذا سافرتما فأذنا وأقيما وليؤمكما أكبركما ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Milik bin Al-Huwairith said:                      \"I came to the Messenger of Allih (ﷺ) with a cousin of mine\" - once he said, \"with a  friend of mine\"-and he said: 'When you travel, call the Adhan and Iqamah, and let the older of you lead the prayer.\"'",
      "chain": [
        "38136",
        "20032",
        "20012",
        "11282",
        "11047",
        "5265"
      ]
    },
    {
      "hadith_no": "787",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا سويد بن نصر، قال أنبأنا عبد الله، عن أبان بن يزيد، قال حدثنا بديل بن ميسرة، قال حدثنا أبو عطية، مولى لنا عن مالك بن الحويرث، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إذا زار أحدكم قوما فلا يصلين بهم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Malik bin Al-Huwairith said:                      \"I heard the Messenger of Allah (ﷺ) say: 'When any one of you visits some people,he should not lead them in prayer.\"'",
      "chain": [
        "38265",
        "20025",
        "20205",
        "10672",
        "5265"
      ]
    },
    {
      "hadith_no": "880",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا خالد، قال حدثنا شعبة، عن قتادة، قال سمعت نصر بن عاصم، عن مالك بن الحويرث، وكان، من أصحاب النبي صلى الله عليه وسلم أن رسول الله صلى الله عليه وسلم كان إذا صلى رفع يديه حين يكبر حيال أذنيه وإذا أراد أن يركع وإذا رفع رأسه من الركوع ‏.‏",
      "text_en": " It was narrated from Malik bin Al-Huwairith- who was one of the companions of the Prophet (ﷺ)- that:                     When the Messenger of Allah (ﷺ) prayed he would raise his hands-when he said the Takbir- until they were parallel to his ears, and when he wanted to bow and when he raised his head from bowing.",
      "chain": [
        "30449",
        "20423",
        "20020",
        "11019",
        "10724",
        "5265"
      ]
    },
    {
      "hadith_no": "881",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا يعقوب بن إبراهيم، قال حدثنا ابن علية، عن ابن أبي عروبة، عن قتادة، عن نصر بن عاصم، عن مالك بن الحويرث، قال رأيت رسول الله صلى الله عليه وسلم حين دخل في الصلاة رفع يديه وحين ركع وحين رفع رأسه من الركوع حتى حاذتا فروع أذنيه ‏.‏",
      "text_en": " It was narrated from Malik bin Al-Huwairith said:                     \"I saw the Messenger of Allah (ﷺ), when he started to pray, raise his hands, and when he bowed, and when he raised his head from bowing, until they were parallel with the top of his ears.\"",
      "chain": [
        "20184",
        "20208",
        "11073",
        "11019",
        "10724",
        "5265"
      ]
    },
    {
      "hadith_no": "1024",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا علي بن حجر، قال أنبأنا إسماعيل، عن سعيد، عن قتادة، عن نصر بن عاصم الليثي، عن مالك بن الحويرث، قال رأيت رسول الله صلى الله عليه وسلم يرفع يديه إذا كبر وإذا ركع وإذا رفع رأسه من الركوع حتى بلغتا فروع أذنيه ‏.‏",
      "text_en": " It was narrated that Malik bin Al-Huwairith said:                     \"I saw the Messenger of Allah (ﷺ) raise his hands until they reached the highest part of his ears, when he said the takbir, when he bowed and when he raised his head from bowing.\"",
      "chain": [
        "20387",
        "20208",
        "11168",
        "11019",
        "10724",
        "5265"
      ]
    },
    {
      "hadith_no": "1056",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا يزيد، - وهو ابن زريع - قال حدثنا سعيد، عن قتادة، عن نصر بن عاصم، أنه حدثهم عن مالك بن الحويرث، أنه رأى رسول الله صلى الله عليه وسلم يرفع يديه إذا ركع وإذا رفع رأسه من الركوع حتى يحاذي بهما فروع أذنيه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Malik bin Al-Huwairith that:                     He saw the Prophet (ﷺ) raise his hands when he bowed, and when he raised his head from bowing, until they were in level with the highest part of his ears.",
      "chain": [
        "34033",
        "20304",
        "11168",
        "11019",
        "10724",
        "5265"
      ]
    },
    {
      "hadith_no": "1085",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا محمد بن المثنى، قال حدثنا ابن أبي عدي، عن شعبة، عن قتادة، عن نصر بن عاصم، عن مالك بن الحويرث، أنه رأى النبي صلى الله عليه وسلم رفع يديه في صلاته وإذا ركع وإذا رفع رأسه من الركوع وإذا سجد وإذا رفع رأسه من السجود حتى يحاذي بهما فروع أذنيه ‏.‏",
      "text_en": " It was narrated from Malik bin Al-Huwairith that:                     He saw the Prophet (ﷺ) raise his hands when praying, when he bowed, when he raised his head from bowing, when he prostrated and when he raised his head from prostrating, until they were in level with the top part of his ears.",
      "chain": [
        "30170",
        "20276",
        "20020",
        "11019",
        "10724",
        "5265"
      ]
    },
    {
      "hadith_no": "1086",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "حدثنا محمد بن المثنى، قال حدثنا عبد الأعلى، قال حدثنا سعيد، عن قتادة، عن نصر بن عاصم، عن مالك بن الحويرث، أنه رأى النبي صلى الله عليه وسلم رفع يديه فذكر مثله ‏.‏",
      "text_en": " It was narrated from Malik bin Al-Huwairith that:                     He saw the Prophet (ﷺ) raise his hands, a similar report.",
      "chain": [
        "30170",
        "20246",
        "11168",
        "11019",
        "10724",
        "5265"
      ]
    },
    {
      "hadith_no": "1087",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا محمد بن المثنى، قال حدثنا معاذ بن هشام، قال حدثني أبي، عن قتادة، عن نصر بن عاصم، عن مالك بن الحويرث، أن نبي الله صلى الله عليه وسلم كان إذا دخل في الصلاة فذكر نحوه وزاد فيه وإذا ركع فعل مثل ذلك وإذا رفع رأسه من الركوع فعل مثل ذلك وإذا رفع رأسه من السجود فعل مثل ذلك ‏.‏",
      "text_en": " It was narrated from Malik bin Al-Huwairith that:                     He saw the Prophet of Allah (ﷺ) raise his hands when he started to pray, and he narrated a similar report and added: \"When he bowed he did likewise, and when he raised his head from bowing he did likewise, and when he raised his head from prostration he did likewise.\"",
      "chain": [
        "30170",
        "20287",
        "20295",
        "11019",
        "10724",
        "5265"
      ]
    },
    {
      "hadith_no": "1143",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا محمد بن المثنى، قال حدثنا معاذ بن هشام، قال حدثني أبي، عن قتادة، عن نصر بن عاصم، عن مالك بن الحويرث، أن نبي الله صلى الله عليه وسلم كان إذا دخل في الصلاة رفع يديه وإذا ركع فعل مثل ذلك وإذا رفع رأسه من الركوع فعل مثل ذلك وإذا رفع رأسه من السجود فعل مثل ذلك كله يعني رفع يديه ‏.‏",
      "text_en": " It was narrated from Malik bin Al-Huwairith that:                     When the Prophet of Allah (ﷺ) started to pray, he raised his hands, and when he bowed, he did likewise, and when he raised his head from bowing he did likewise, and when he raised his head from prostration, he did likewise, meaning he raised his hands.",
      "chain": [
        "30170",
        "20287",
        "20295",
        "11019",
        "10724",
        "5265"
      ]
    },
    {
      "hadith_no": "1152",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا علي بن حجر، قال أنبأنا هشيم، عن خالد، عن أبي قلابة، عن مالك بن الحويرث، قال رأيت رسول الله صلى الله عليه وسلم يصلي فإذا كان في وتر من صلاته لم ينهض حتى يستوي جالسا ‏.‏",
      "text_en": " It was narrated that Malik bin Al-Huwairith said:                     \"I saw the Messenger of Allah (ﷺ) pray, and when he was in an odd-numbered rak'ah, he did not get up until he had settled in a sitting position.\"",
      "chain": [
        "20387",
        "20468",
        "11282",
        "11047",
        "5265"
      ]
    },
    {
      "hadith_no": "1153",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا عبد الوهاب، قال حدثنا خالد، عن أبي قلابة، قال كان مالك بن الحويرث يأتينا فيقول ألا أحدثكم عن صلاة، رسول الله صلى الله عليه وسلم فيصلي في غير وقت الصلاة فإذا رفع رأسه من السجدة الثانية في أول الركعة استوى قاعدا ثم قام فاعتمد على الأرض ‏.‏",
      "text_en": " It was narrated that Abu Qibalah said:                     \"Malik bin Al-Huwairith used to come to us and say: \"Shall I not tell you about the prayer of the Messenger of Allah (ﷺ)?\" He was praying at a time other than the time of prayer, and when he raised his head from the second prostration in the first rak'ah, he settled in a seated position, then he stood up, and he supported himself on the ground (while doing so).\"",
      "chain": [
        "30160",
        "20259",
        "11282",
        "11047",
        "5265"
      ]
    },
    {
      "hadith_no": "908",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا حميد بن مسعدة، حدثنا يزيد بن زريع، حدثنا هشام، عن قتادة، عن نصر بن عاصم، عن مالك بن الحويرث، أن رسول الله  صلى الله عليه وسلم  كان إذا كبر رفع يديه حتى يجعلهما قريبا من أذنيه وإذا ركع صنع مثل ذلك وإذا رفع رأسه من الركوع صنع مثل ذلك ‏.‏",
      "text_en": " It wasnarrated that Malik bin Huwairith said that when the MessengerofAllah (ﷺ) said Allahu Akbar, he would raise his hands until theywere close to his ears; when he bowed in Ruku’ he did likewise, andwhen he raised his head from Ruku’ he did likewise.",
      "chain": [
        "30430",
        "20304",
        "20295",
        "11019",
        "10724",
        "5265"
      ]
    },
    {
      "hadith_no": "1032",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا بشر بن هلال الصواف، حدثنا يزيد بن زريع، عن خالد الحذاء، عن أبي قلابة، عن مالك بن الحويرث، قال أتيت النبي  صلى الله عليه وسلم  أنا وصاحب لي فلما أردنا الانصراف قال لنا ‏\"‏ إذا حضرت الصلاة فأذنا وأقيما وليؤمكما أكبركما ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Malik bin Huwairith said:                      “I came to the Prophet(ﷺ) with a friend of mine, and when we wanted to leave, he said tous: ‘When the time for prayer comes, say the Adhan and Iqamah, thenlet the older of you lead the prayer.’”",
      "chain": [
        "30537",
        "20304",
        "11282",
        "11047",
        "5265"
      ]
    }
  ],
  "total_hadiths": 36
}