{
  "id": "5271",
  "name": "Mjash' bin Mas'ud bin Tha'lbah ( مجاشع بن مسعود بن ثعلبة ( رضي الله عنه",
  "full_name": "Mjash' bin Mas'ud bin Tha'lbah ( مجاشع بن مسعود بن ثعلبة ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "36",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator [ خ  م  د  ق  -  صحابي ]"
    ],
    "tags": [
      "al-Salmi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "students": [
    {
      "id": "11113",
      "name": "Abu 'Uthman al-Nahdi عبد الرحمن بن مل - أبو عثمان النهدي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11368",
      "name": "'Abdul Malik bin 'Umayr al-Qabti عبد الملك بن عمير بن سويد القبطي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19941",
      "name": "Kulayb bin Shahab كليب بن شهاب",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "10902",
      "name": "Hdyn bin al-Mndhr bin al-Harith حضين بن المنذر بن الحارث",
      "grade": "Follower(Tabi') [2nd Generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-3079",
      "hadith_no": "3079",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا إبراهيم بن موسى، أخبرنا يزيد بن زريع، عن خالد، عن أبي عثمان النهدي، عن مجاشع بن مسعود، قال جاء مجاشع بأخيه مجالد بن مسعود إلى النبي صلى الله عليه وسلم فقال هذا مجالد يبايعك على الهجرة‏.‏ فقال ‏\"‏ لا هجرة بعد فتح مكة، ولكن أبايعه على الإسلام ‏\"‏‏.‏",
      "text_en": " Narrated Abu `Uthman An-Nahdi:                     Mujashi (bin Mas`ud) took his brother Mujalid bin Musud to the Prophet and said, \"This is Mujalid and he will give a pledge of allegiance to you for migration.\" The Prophet said, \"There is no migration after the Conquest of Mecca, but I will take his pledge of allegiance for Islam.\"",
      "usc_msa_ref": "312",
      "chain": [
        "30309",
        "20304",
        "11282",
        "11113",
        "5271"
      ]
    },
    {
      "id": "sahih-muslim-4933",
      "hadith_no": "4933",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد بن الصباح أبو جعفر، حدثنا إسماعيل بن زكرياء، عن عاصم الأحول، عن أبي عثمان النهدي، حدثني مجاشع بن مسعود السلمي، قال أتيت النبي صلى الله عليه وسلم أبايعه على الهجرة فقال ‏\"‏ إن الهجرة قد مضت لأهلها ولكن على الإسلام والجهاد والخير ‏\"‏ ‏.‏",
      "text_en": " It has been reported on the authority of Mujashi' b. Mas'ud as-Sulami who said:                      I came to the Holy Prophet (may peace be upon him) to offer him my pledge of migration. He said: The period of migration has expired (and those who wereto get the reward for this great act of devotion have got it). You may now give your pledge to serve the cause of Islam, to strive in the way of Allah and to follow the path of virtue.",
      "usc_msa_ref": "",
      "chain": [
        "30269",
        "20313",
        "11080",
        "11113",
        "5271"
      ]
    },
    {
      "id": "sahih-muslim-4934",
      "hadith_no": "4934",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثني سويد بن سعيد، حدثنا علي بن مسهر، عن عاصم، عن أبي عثمان، قال أخبرني مجاشع بن مسعود السلمي، قال جئت بأخي أبي معبد إلى رسول الله صلى الله عليه وسلم بعد الفتح فقلت يا رسول الله بايعه على الهجرة ‏.‏ قال ‏\"‏ قد مضت الهجرة بأهلها ‏\"‏ ‏.‏ قلت فبأى شىء تبايعه قال ‏\"‏ على الإسلام والجهاد والخير ‏\"‏ ‏.‏ قال أبو عثمان فلقيت أبا معبد فأخبرته بقول مجاشع فقال صدق ‏.‏",
      "text_en": " It has been reported on the authority of Mujashi' b. Mas'ud who said:                      I brought my brother Abu Ma'bad to the Messenger of Allah (may peace he upon him) after the conquest of Mecca and said: Messenger of Allah, allow him to swear his pledge of migration at your hand. He said: The period of migration is over with those who had to do it (and now nobody can get this meritorious distinctions) I said: For what actions will you allow him to bind himself in oath? He said: (He can do so) for serving the cause of Islam, for fighting in the way of Allah and for fighting in the cause of virtue. Abd Uthman said: I met Abd Ma'bad and told him what I had heard from Mujashi'. He said: He has told the truth.",
      "usc_msa_ref": "",
      "chain": [
        "30547",
        "20345",
        "11080",
        "11113",
        "5271"
      ]
    }
  ],
  "total_hadiths": 3
}