{
  "id": "5275",
  "name": "Mihjan bin al-Adra' al-'Aslmi ( محجن بن الأدرع الأسلمي ( رضي الله عنه",
  "full_name": "Mihjan bin al-Adra' al-'Aslmi ( محجن بن الأدرع الأسلمي ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "59",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Medina",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina",
      " al-Basra"
    ],
    "area_of_interest": [
      "Narrator [ بخ  د  س  -  صحابي ]"
    ],
    "tags": [
      "al-Aslami",
      "al-Basra"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "students": [
    {
      "id": "11842",
      "name": "Hanzalah bin 'Ali bin al-Aslami حنظلة بن علي بن الأسقع",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "14118",
      "name": "Rja'a bin Abi Rja'a al-Bahali رجاء بن أبي رجاء الباهلي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10694",
      "name": "'Abdullah bin Shaqayq al-Aqayli عبد الله بن شقيق العقيلي",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "985",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الله بن عمرو أبو معمر، حدثنا عبد الوارث، حدثنا الحسين المعلم، عن عبد الله بن بريدة، عن حنظلة بن علي، أن محجن بن الأدرع، حدثه قال دخل رسول الله صلى الله عليه وسلم المسجد فإذا هو برجل قد قضى صلاته وهو يتشهد وهو يقول اللهم إني أسألك يا الله الأحد الصمد الذي لم يلد ولم يولد ولم يكن له كفوا أحد أن تغفر لي ذنوبي إنك أنت الغفور الرحيم ‏.‏ قال فقال ‏\"‏ قد غفر له قد غفر له ‏\"‏ ‏.‏ ثلاثا ‏.‏",
      "text_en": " Narrated Mihjan ibn al-Adra':                     The Messenger of Allah (ﷺ) entered the mosque and saw a man who had finished his prayer, and was reciting the tashahhud saying: O Allah, I ask you, O Allah, the One, the eternally besought of all, He begetteth not, nor was He begotten, and there is none comparable unto Him, that you may forgive me my sins, you are Most Forgiving, Merciful. He (the Prophet) said: He was forgiven (repeating three times.)",
      "chain": [
        "20258",
        "11278",
        "11432",
        "5275"
      ]
    },
    {
      "hadith_no": "1301",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا عمرو بن يزيد أبو بريد البصري، عن عبد الصمد بن عبد الوارث، قال حدثنا أبي قال، حدثنا حسين المعلم، عن ابن بريدة، قال حدثني حنظلة بن علي، أن محجن بن الأدرع، حدثه أن رسول الله صلى الله عليه وسلم دخل المسجد إذا رجل قد قضى صلاته وهو يتشهد فقال اللهم إني أسألك يا الله بأنك الواحد الأحد الصمد الذي لم يلد ولم يولد ولم يكن له كفوا أحد أن تغفر لي ذنوبي إنك أنت الغفور الرحيم ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ قد غفر له ‏\"‏ ‏.‏ ثلاثا ‏.‏",
      "text_en": " Hanzalah bin 'Ali narrated that:                     Mihjan bin Al-Adra' narrated to him that the Messenger of Allah (ﷺ) entered the masjid and there was a man who had finished his prayer and he was reciting the tashahhud. He said: \"Allahumma inni as'aluka ya Allah! Bi-annakal-Wahidul-Ahad us-Samad, alladhi lam yalid wa lam yowled, wa lam yakun lahu kufuwan ahad, an taghfirali dhunubi, innaka antal-Ghafurur-Rahim (O Allah, I ask of You, O Allah, as You are the One, the Only, the Self-Sufficient Master, Who begets not nor was He begotten, and there is None equal or comparable to Him, forgive me my sins, for You are the Oft-Forgiving, Most Merciful.)\" The Messenger of Allah (ﷺ) said: \"He has been forgiven,\" three times.",
      "chain": [
        "20250",
        "20258",
        "11278",
        "11432",
        "5275"
      ]
    }
  ],
  "total_hadiths": 2
}