{
  "id": "5278",
  "name": "Mahmud bin al-Rabi' bin Saraqa ( محمود بن الربيع بن سراقة بن عمرو ( رضي الله عنه",
  "full_name": "Mahmud bin al-Rabi' bin Saraqa ( محمود بن الربيع بن سراقة بن عمرو ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "biography": {
    "birth": {
      "date_hijri": "7",
      "date_gregorian": "NA",
      "date_display": [
        "7 AH"
      ],
      "place": ""
    },
    "death": {
      "date_hijri": "99",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator [ ع  -  صحابة ]"
    ],
    "tags": [
      "Ansar",
      "Khazraj",
      "al-Madni",
      "Child"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "251",
      "name": "'Itban bin Malik bin 'Amr ( عتبان بن مالك بن عمرو بن العجلان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "40",
      "name": "'Ubada bin As-Samit ( عبادة بن الصامت بن قيس بن أصرم ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "33",
      "name": "Abu Ayyub al-Ansari ( أبو أيوب الأنصاري خالد بن زيد ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "19102",
      "name": "Han'i bin Khultum bin Abd هانئ بن كلثوم بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11066",
      "name": "Makhul al-Shami/al-Damashiqi مكحول الشامي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "17018",
      "name": "Hameed al-Shamy al-Hmsy حميد الشامي الحمصي",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "77",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثني محمد بن يوسف، قال حدثنا أبو مسهر، قال حدثني محمد بن حرب، حدثني الزبيدي، عن الزهري، عن محمود بن الربيع، قال عقلت من النبي صلى الله عليه وسلم مجة مجها في وجهي وأنا ابن خمس سنين من دلو‏.‏",
      "text_en": " Narrated Mahmud bin Rabi`a:                     When I was a boy of five, I remember, the Prophet took water from a bucket (used far getting water out of a well) with his mouth and threw it on my face.",
      "chain": [
        "30388",
        "30284",
        "30373",
        "20459",
        "11013",
        "5278"
      ]
    },
    {
      "hadith_no": "189",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا علي بن عبد الله، قال حدثنا يعقوب بن إبراهيم بن سعد، قال حدثنا أبي، عن صالح، عن ابن شهاب، قال أخبرني محمود بن الربيع، قال وهو الذي مج رسول الله صلى الله عليه وسلم في وجهه وهو غلام من بئرهم‏.‏ وقال عروة عن المسور وغيره يصدق كل واحد منهما صاحبه وإذا توضأ النبي صلى الله عليه وسلم كادوا يقتتلون على وضوئه‏.‏",
      "text_en": " Narrated Ibn Shihab:                     Mahmud bin Ar-Rabi` who was the person on whose face the Prophet had ejected a mouthful of water from his family's well while he was a boy, and `Urwa (on the authority of Al-Miswar and others) who testified each other, said, \"Whenever the Prophet , performed ablution, his companions were nearly fighting for the remains of the water.\"",
      "chain": [
        "30026",
        "20184",
        "20150",
        "11176",
        "11013",
        "5278"
      ]
    },
    {
      "hadith_no": "424",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الله بن مسلمة، قال حدثنا إبراهيم بن سعد، عن ابن شهاب، عن محمود بن الربيع، عن عتبان بن مالك، أن النبي صلى الله عليه وسلم أتاه في منزله فقال ‏\"‏ أين تحب أن أصلي لك من بيتك ‏\"‏‏.‏ قال فأشرت له إلى مكان، فكبر النبي صلى الله عليه وسلم وصففنا خلفه، فصلى ركعتين‏.‏",
      "text_en": " Narrated `Itban bin Malik:                     The Prophet came to my house and said, \"Where do you like me to pray?\" I pointed to a place. The Prophet then said, \"Allahu Akbar\", and we aligned behind him and he offered a two-rak`at prayer.",
      "chain": [
        "20164",
        "20150",
        "11013",
        "5278",
        "251"
      ]
    },
    {
      "hadith_no": "425",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا سعيد بن عفير، قال حدثني الليث، قال حدثني عقيل، عن ابن شهاب، قال أخبرني محمود بن الربيع الأنصاري، أن عتبان بن مالك  وهو من أصحاب رسول الله صلى الله عليه وسلم ممن شهد بدرا من الأنصار  أنه أتى رسول الله صلى الله عليه وسلم فقال يا رسول الله، قد أنكرت بصري، وأنا أصلي لقومي، فإذا كانت الأمطار سال الوادي الذي بيني وبينهم، لم أستطع أن آتي مسجدهم فأصلي بهم، ووددت يا رسول الله أنك تأتيني فتصلي في بيتي، فأتخذه مصلى‏.‏ قال فقال له رسول الله صلى الله عليه وسلم ‏\"‏ سأفعل إن شاء الله ‏\"‏‏.‏ قال عتبان فغدا رسول الله صلى الله عليه وسلم وأبو بكر حين ارتفع النهار، فاستأذن رسول الله صلى الله عليه وسلم فأذنت له، فلم يجلس حتى دخل البيت ثم قال ‏\"‏ أين تحب أن أصلي من بيتك ‏\"‏‏.‏ قال فأشرت له إلى ناحية من البيت، فقام رسول الله صلى الله عليه وسلم فكبر، فقمنا فصفنا، فصلى ركعتين ثم سلم، قال وحبسناه على خزيرة صنعناها له‏.‏ قال فثاب في البيت رجال من أهل الدار ذوو عدد فاجتمعوا، فقال قائل منهم أين مالك بن الدخيشن أو ابن الدخشن فقال بعضهم ذلك منافق لا يحب الله ورسوله‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تقل ذلك، ألا تراه قد قال لا إله إلا الله‏.‏ يريد بذلك وجه الله ‏\"‏‏.‏ قال الله ورسوله أعلم‏.‏ قال فإنا نرى وجهه ونصيحته إلى المنافقين‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ فإن الله قد حرم على النار من قال لا إله إلا الله‏.‏ يبتغي بذلك وجه الله ‏\"‏‏.‏ قال ابن شهاب ثم سألت الحصين بن محمد الأنصاري  وهو أحد بني سالم وهو من سراتهم  عن حديث محمود بن الربيع، فصدقه بذلك‏.‏",
      "text_en": " Narrated `Itban bin Malik:                     who was one of the companions of Allah's Apostle and one of the Ansar's who took part in the battle of Badr: I came to Allah's Apostle and said, \"O Allah's Apostle I have weak eyesight and I lead my people in prayers. When it rains the water flows in the valley between me and my people so I cannot go to their mosque to lead them in prayer. O Allah's Apostle! I wish you would come to my house and pray in it so that I could take that place as a Musalla. Allah's Apostle said. \"Allah willing, I will do so.\" Next day after the sun rose high, Allah's Apostle and Abu Bakr came and Allah's Apostle asked for permission to enter. I gave him permission and he did not sit on entering the house but said to me, \"Where do you like me to pray?\" I pointed to a place in my house. So Allah's Apostle stood there and said, 'Allahu Akbar', and we all got up and aligned behind him and offered a two-rak`at prayer and ended it with Taslim. We requested him to stay for a meal called \"Khazira\" which we had prepared for him. Many members of our family gathered in the house and one of them said, \"Where is Malik bin Al-Dukhaishin or Ibn Al-Dukhshun?\" One of them replied, \"He is a hypocrite and does not love Allah and His Apostle.\" Hearing that, Allah's Apostle said, \"Do not say so. Haven't you seen that he said, 'None has the right to be worshipped but Allah' for Allah's sake only?\" He said, \"Allah and His Apostle know better. We have seen him helping and advising hypocrites.\" Allah's Apostle said, \"Allah has forbidden the (Hell) fire for those who say, 'None has the right to be worshipped but Allah' for Allah's sake only.\"",
      "chain": [
        "30233",
        "20023",
        "11207",
        "11013",
        "5278"
      ]
    },
    {
      "hadith_no": "667",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن ابن شهاب، عن محمود بن الربيع الأنصاري، أن عتبان بن مالك، كان يؤم قومه وهو أعمى، وأنه قال لرسول الله صلى الله عليه وسلم يا رسول الله، إنها تكون الظلمة والسيل وأنا رجل ضرير البصر، فصل يا رسول الله في بيتي مكانا أتخذه مصلى، فجاءه رسول الله صلى الله عليه وسلم فقال ‏\"‏ أين تحب أن أصلي ‏\"‏‏.‏ فأشار إلى مكان من البيت، فصلى فيه رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Mahmud bin Rabi` Al-Ansari:                     `Itban bin Malik used to lead his people (tribe) in prayer and was a blind man, he said to Allah's Apostle , \"O Allah's Apostle! At times it is dark and flood water is flowing (in the valley) and I am blind man, so please pray at a place in my house so that I can take it as a Musalla (praying place).\" So Allah's Apostle went to his house and said, \"Where do you like me to pray?\" 'Itban pointed to a place in his house and Allah's Apostle, offered the prayer there.",
      "chain": [
        "30103",
        "20001",
        "11013",
        "5278",
        "251"
      ]
    },
    {
      "hadith_no": "686",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا معاذ بن أسد، أخبرنا عبد الله، أخبرنا معمر، عن الزهري، قال أخبرني محمود بن الربيع، قال سمعت عتبان بن مالك الأنصاري، قال استأذن النبي صلى الله عليه وسلم فأذنت له فقال ‏\"‏ أين تحب أن أصلي من بيتك ‏\"‏‏.‏ فأشرت له إلى المكان الذي أحب، فقام وصففنا خلفه ثم سلم وسلمنا‏.‏",
      "text_en": " Narrated `Itban bin Malik Al-Ansari:                     The Prophet (came to my house and) asked permission for entering and I allowed him. He asked, \"Where do you like me to pray in your house?\" I pointed to a place which I liked. He stood up for prayer and we aligned behind him and he finished the prayer with Taslim and we did the same.",
      "chain": [
        "30176",
        "20025",
        "20115",
        "11013",
        "5278",
        "251"
      ]
    },
    {
      "hadith_no": "756",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا علي بن عبد الله، قال حدثنا سفيان، قال حدثنا الزهري، عن محمود بن الربيع، عن عبادة بن الصامت، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا صلاة لمن لم يقرأ بفاتحة الكتاب ‏\"‏‏.‏",
      "text_en": " Narrated 'Ubada bin As-Samit:                     Allah's Apostle said, \"Whoever does not recite Al-Fatiha in his prayer, his prayer is invalid.\"",
      "chain": [
        "30026",
        "20005",
        "11013",
        "5278",
        "40"
      ]
    },
    {
      "hadith_no": "838",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا حبان بن موسى، قال أخبرنا عبد الله، قال أخبرنا معمر، عن الزهري، عن محمود بن الربيع، عن عتبان، قال صلينا مع النبي صلى الله عليه وسلم فسلمنا حين سلم‏.‏",
      "text_en": " Narrated `Itban bin Malik:                     We prayed with the Prophet and used to finish our prayer with the Taslim along with him.",
      "chain": [
        "30322",
        "20025",
        "20115",
        "11013",
        "5278"
      ]
    },
    {
      "hadith_no": "840",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبدان، قال أخبرنا عبد الله، قال أخبرنا معمر، عن الزهري، قال أخبرني محمود بن الربيع،، وزعم، أنه عقل رسول الله صلى الله عليه وسلم وعقل مجة مجها من دلو كان في دارهم‏.‏ قال سمعت عتبان بن مالك الأنصاري، ثم أحد بني سالم قال كنت أصلي لقومي بني سالم، فأتيت النبي صلى الله عليه وسلم فقلت إني أنكرت بصري، وإن السيول تحول بيني وبين مسجد قومي، فلوددت أنك جئت فصليت في بيتي مكانا، حتى أتخذه مسجدا فقال ‏\"‏ أفعل إن شاء الله ‏\"‏‏.‏ فغدا على رسول الله صلى الله عليه وسلم وأبو بكر معه بعد ما اشتد النهار، فاستأذن النبي صلى الله عليه وسلم فأذنت له، فلم يجلس حتى قال ‏\"‏ أين تحب أن أصلي من بيتك ‏\"‏‏.‏ فأشار إليه من المكان الذي أحب أن يصلي فيه، فقام فصففنا خلفه ثم سلم، وسلمنا حين سلم‏.‏",
      "text_en": " Narrated Mahmud bin Ar-Rabi`:                     I remember Allah's Apostle and also the mouthful of water which he took from a bucket in our house and ejected (on me). I heard from `Itban bin Malik Al-Ansari, who was one from Bani Salim, saying, \"I used to lead my tribe of Bani Salim in prayer. Once I went to the Prophet and said to him, 'I have weak eyesight and at times the rainwater flood intervenes between me and the mosque of my tribe and I wish that you would come to my house and pray at some place so that I could take that place as a place for praying (mosque). He said, \"Allah willing, I shall do that.\" Next day Allah's Apostle along with Abu Bakr, came to my house after the sun had risen high and he asked permission to enter. I gave him permission, but he didn't sit till he said to me, \"Where do you want me to pray in your house?\" I pointed to a place in the house where I wanted him to pray. So he stood up for the prayer and we aligned behind him. He completed the prayer with Taslim and we did the same simultaneously.\"",
      "chain": [
        "30349",
        "20025",
        "20115",
        "11013",
        "5278"
      ]
    },
    {
      "hadith_no": "1185",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثني إسحاق، حدثنا يعقوب بن إبراهيم، حدثنا أبي، عن ابن شهاب، قال أخبرني محمود بن الربيع الأنصاري، أنه عقل رسول الله صلى الله عليه وسلم، وعقل مجة مجها في وجهه من بئر كانت في دارهم‏.‏ فزعم محمود أنه سمع عتبان بن مالك الأنصاري   رضى الله عنه  وكان ممن شهد بدرا مع رسول الله صلى الله عليه وسلم يقول كنت أصلي لقومي ببني سالم، وكان يحول بيني وبينهم واد إذا جاءت الأمطار فيشق على اجتيازه قبل مسجدهم، فجئت رسول الله صلى الله عليه وسلم فقلت له إني أنكرت بصري، وإن الوادي الذي بيني وبين قومي يسيل إذا جاءت الأمطار فيشق على اجتيازه، فوددت أنك تأتي فتصلي من بيتي مكانا أتخذه مصلى‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ سأفعل ‏\"‏‏.‏ فغدا على رسول الله صلى الله عليه وسلم وأبو بكر  رضى الله عنه  بعد ما اشتد النهار فاستأذن رسول الله صلى الله عليه وسلم فأذنت له فلم يجلس حتى قال ‏\"‏ أين تحب أن أصلي من بيتك ‏\"‏‏.‏ فأشرت له إلى المكان الذي أحب أن أصلي فيه، فقام رسول الله صلى الله عليه وسلم فكبر وصففنا وراءه، فصلى ركعتين، ثم سلم وسلمنا حين سلم، فحبسته على خزير يصنع له فسمع أهل الدار رسول الله صلى الله عليه وسلم في بيتي فثاب رجال منهم حتى كثر الرجال في البيت‏.‏ فقال رجل منهم ما فعل مالك لا أراه‏.‏ فقال رجل منهم ذاك منافق لا يحب الله ورسوله‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تقل ذاك ألا تراه قال لا إله إلا الله‏.‏ يبتغي بذلك وجه الله ‏\"‏‏.‏ فقال الله ورسوله أعلم‏.‏ أما نحن فوالله لا نرى وده ولا حديثه إلا إلى المنافقين‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ فإن الله قد حرم على النار من قال لا إله إلا الله‏.‏ يبتغي بذلك وجه الله ‏\"‏‏.‏ قال محمود فحدثتها قوما فيهم أبو أيوب صاحب رسول الله صلى الله عليه وسلم في غزوته التي توفي فيها ويزيد بن معاوية عليهم بأرض الروم، فأنكرها على أبو أيوب قال والله ما أظن رسول الله صلى الله عليه وسلم قال ما قلت قط‏.‏ فكبر ذلك على فجعلت لله على إن سلمني حتى أقفل من غزوتي أن أسأل عنها عتبان بن مالك  رضى الله عنه  إن وجدته حيا في مسجد قومه، فقفلت فأهللت بحجة أو بعمرة، ثم سرت حتى قدمت المدينة فأتيت بني سالم، فإذا عتبان شيخ أعمى يصلي لقومه فلما سلم من الصلاة سلمت عليه وأخبرته من أنا، ثم سألته عن ذلك الحديث فحدثنيه كما حدثنيه أول مرة‏.‏",
      "text_en": " Narrated Mahmud bin Ar-rabi' Al-Ansari:                     that he remembered Allah's Apostle and he also remembered a mouthful of water which he had thrown on his face, after taking it from a well that was in their house. Mahmud said that he had heard `Itban bin Malik, who was present with Allah's Apostle in the battle of Badr saying, \"I used to lead my people at Bani Salim in the prayer and there was a valley between me and those people. Whenever it rained it used to be difficult for me to cross it to go to their mosque. So I went to Allah's Apostle and said, 'I have weak eyesight and the valley between me and my people flows during the rainy season and it becomes difficult for me to cross it; I wish you would come to my house and pray at a place so that I could take that place as a praying place.' Allah's Apostle said, 'I will do so.' So Allah's Apostle and Abu Bakr came to my house in the (next) morning after the sun had risen high. Allah's Apostle asked my permission to let him in and I admitted him. He did not sit before saying, 'Where do you want us to offer the prayer in your house?' I pointed to the place where I wanted him to pray. So Allah's Apostle stood up for the prayer and started the prayer with Takbir and we aligned in rows behind him; and he offered two rak`at, and finished them with Taslim, and we also performed Taslim with him. I detained him for a meal called \"Khazir\" which I had prepared for him.--(\"Khazir\" is a special type of dish prepared from barley flour and meat soup)-- When the neighbors got the news that Allah's Apostle was in my house, they poured it till there were a great number of men in the house. One of them said, 'What is wrong with Malik, for I do not see him?' One of them replied, 'He is a hypocrite and does not love Allah and His Apostle.' On that Allah's Apostle said, 'Don't say this. Haven't you seen that he said, 'None has the right to be worshipped but Allah for Allah's sake only.' The man replied, 'Allah and His Apostle know better; but by Allah, we never saw him but helping and talking with the hypocrites.' Allah's Apostle replied, 'No doubt, whoever says. None has the right to be worshipped but Allah, and by that he wants the pleasures of Allah, then Allah will save him from Hell.\" Mahmud added, \"I told the above narration to some people, one of whom was Abu Aiyub, the companion of Allah's Apostle in the battle in which he (Abu Aiyub) died and Yazid bin Mu'awiya was their leader in Roman Territory. Abu Aiyub denounced the narration and said, 'I doubt that Allah's Apostle ever said what you have said.' I felt that too much, and I vowed to Allah that if I remained alive in that holy battle, I would (go to Medina and) ask `Itban bin Malik if he was still living in the mosque of his people. So when he returned, I assumed Ihram for Hajj or `Umra and then I proceeded on till I reached Medina. I went to Bani Salim and `Itban bin Malik, who was by then an old blind man, was leading his people in the prayer. When he finished the prayer, I greeted him and introduced myself to him and then asked him about that narration. He told that narration again in the same manner as he had narrated it the first time.\"",
      "chain": [
        "30312",
        "20184",
        "20150",
        "11013",
        "5278"
      ]
    },
    {
      "hadith_no": "4059",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا يحيى بن بكير، حدثنا الليث، عن عقيل، عن ابن شهاب، أخبرني محمود بن الربيع، أن عتبان بن مالك، وكان، من أصحاب النبي صلى الله عليه وسلم ممن شهد بدرا من الأنصار أنه أتى رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Mahmud bin Ar-Rabi:                     That `Itban bin Malik who was one of the companions of the Prophet and one of the warriors of Badr, came to Allah's Apostle.",
      "chain": [
        "30399",
        "20023",
        "11207",
        "11013",
        "5278",
        "251"
      ]
    },
    {
      "hadith_no": "5456",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثني يحيى بن بكير، حدثنا الليث، عن عقيل، عن ابن شهاب، قال أخبرني محمود بن الربيع الأنصاري، أن عتبان بن مالك  وكان من أصحاب النبي صلى الله عليه وسلم ممن شهد بدرا من الأنصار  أنه أتى رسول الله صلى الله عليه وسلم فقال يا رسول الله إني أنكرت بصري وأنا أصلي لقومي، فإذا كانت الأمطار سال الوادي الذي بيني وبينهم، لم أستطع أن آتي مسجدهم فأصلي لهم، فوددت يا رسول الله أنك تأتي فتصلي في بيتي، فأتخذه مصلى‏.‏ فقال ‏\"‏ سأفعل إن شاء الله ‏\"‏‏.‏ قال عتبان فغدا رسول الله صلى الله عليه وسلم وأبو بكر حين ارتفع النهار، فاستأذن النبي صلى الله عليه وسلم فأذنت له فلم يجلس حتى دخل البيت، ثم قال لي ‏\"‏ أين تحب أن أصلي من بيتك ‏\"‏‏.‏ فأشرت إلى ناحية من البيت فقام النبي صلى الله عليه وسلم فكبر، فصففنا، فصلى ركعتين، ثم سلم وحبسناه على خزير صنعناه، فثاب في البيت رجال من أهل الدار ذوو عدد فاجتمعوا، فقال قائل منهم أين مالك بن الدخشن فقال بعضهم ذلك منافق لا يحب الله ورسوله‏.‏ قال النبي صلى الله عليه وسلم ‏\"‏ لا تقل، ألا تراه قال لا إله إلا الله‏.‏ يريد بذلك وجه الله ‏\"‏‏.‏ قال الله ورسوله أعلم‏.‏ قال قلنا فإنا نرى وجهه ونصيحته إلى المنافقين‏.‏ فقال ‏\"‏ فإن الله حرم على النار من قال لا إله إلا الله‏.‏ يبتغي بذلك وجه الله ‏\"‏‏.‏ قال ابن شهاب ثم سألت الحصين بن محمد الأنصاري أحد بني سالم وكان من سراتهم عن حديث محمود فصدقه‏.‏",
      "text_en": " Narrated 'Urban bin Malik:                     who attended the Badr battle and was from the Ansar, that he came to the Prophet and said, \"O Allah's Apostle! I have lost my eyesight and I lead my people in the prayer (as an Imam). When it rains, the valley which is between me and my people, flows with water, and then I cannot go to their mosque to lead them in the prayer. O Allah's Apostle! I wish that you could come and pray in my house so that I may take it as a praying place. The Prophet said, \"Allah willing, I will do that.\" The next morning, soon after the sun had risen, Allah's Apostle came with Abu Bakr. The Prophet asked for the permission to enter and I admitted him. The Prophet had not sat till he had entered the house and said to me, \"Where do you like me to pray in your house?\" I pointed at a place in my house whereupon he stood and said, \"Allahu Akbar.\" We lined behind him and he prayed two rak`at and finished it with Taslim. We then requested him to stay for a special meal of Khazira which we had prepared. A large number of men from the adjoining area gathered in the house. One of them said, \"Where is Malik bin Ad-Dukhshun?\" Another man said, \"He is a hypocrite and does not love Allah and His Apostle.\" The Prophet said, \"Do not say so. Do you not think that he has said: \"None has the right to be worshipped but Allah,\" seeking Allah's pleasure? The man said, \"Allah and His Apostle know better, but we have always seen him mixing with hypocrites and giving them advice.\" The Prophet said, \"Allah has forbidden the (Hell) Fire for those who testify that none has the right to be worshipped but Allah, seeking Allah's pleasure. \"",
      "chain": [
        "30399",
        "20023",
        "11207",
        "11013",
        "5278",
        "251"
      ]
    },
    {
      "hadith_no": "6428",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا إبراهيم بن سعد، عن صالح بن كيسان، عن ابن شهاب، قال أخبرني محمود بن الربيع، وهو الذي مج رسول الله صلى الله عليه وسلم في وجهه وهو غلام من بئرهم‏.‏",
      "text_en": " Narrated Mahmud bin Ar-Rabi:                     On whose face Allah's Apostle had thrown water from his mouth, the water having been taken from their well while he was still a young boy (who has not yet attained the age of puberty).",
      "chain": [
        "30105",
        "20150",
        "11176",
        "11013",
        "5278"
      ]
    },
    {
      "hadith_no": "6498",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا معاذ بن أسد، أخبرنا عبد الله، أخبرنا معمر، عن الزهري، قال أخبرني محمود بن الربيع، وزعم، محمود أنه عقل رسول الله صلى الله عليه وسلم وقال وعقل مجة مجها من دلو كانت في دارهم‏.‏",
      "text_en": "",
      "chain": [
        "30176",
        "20025",
        "20115",
        "11013",
        "5278"
      ]
    },
    {
      "hadith_no": "7024",
      "source": " Sahih Bukhari ",
      "chapter": "Dealing with Apostates - كتاب استتابة المرتدين والمعاندين وقتالهم",
      "chapter_no": "89",
      "text_ar": "حدثنا عبدان، أخبرنا عبد الله، أخبرنا معمر، عن الزهري، أخبرني محمود بن الربيع، قال سمعت عتبان بن مالك، يقول غدا على رسول الله صلى الله عليه وسلم فقال رجل أين مالك بن الدخشن فقال رجل منا ذلك منافق لا يحب الله ورسوله‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ ألا تقولوه يقول لا إله إلا الله يبتغي‏.‏ بذلك وجه الله ‏\"‏‏.‏ قال بلى‏.‏ قال ‏\"‏ فإنه لا يوافى عبد يوم القيامة به إلا حرم الله عليه النار ‏\"‏‏.‏",
      "text_en": " Narrated `Itban bin Malik:                     Once Allah's Apostle came to me in the morning, and a man among us said, \"Where is Malik bin Ad- Dukhshun?\" Another man from us replied, \"He is a hypocrite who does not love Allah and His Apostle.\" The Prophet said, \"Don't you think that he says: None has the right to be worshipped but Allah, only for Allah's sake?\" They replied, \"Yes\" The Prophet said, \"Nobody will meet Allah with that saying on the Day of Resurrection, but Allah will save him from the Fire.\"",
      "chain": [
        "30349",
        "20025",
        "20115",
        "11013",
        "5278",
        "251"
      ]
    },
    {
      "hadith_no": "158",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا سليمان، - يعني ابن المغيرة - قال حدثنا ثابت، عن أنس بن مالك، قال حدثني محمود بن الربيع، عن عتبان بن مالك، قال قدمت المدينة فلقيت عتبان فقلت حديث بلغني عنك قال أصابني في بصري بعض الشىء فبعثت إلى رسول الله صلى الله عليه وسلم أني أحب أن تأتيني فتصلي في منزلي فأتخذه مصلى - قال - فأتى النبي صلى الله عليه وسلم ومن شاء الله من أصحابه فدخل وهو يصلي في منزلي وأصحابه يتحدثون بينهم ثم أسندوا عظم ذلك وكبره إلى مالك بن دخشم قالوا ودوا أنه دعا عليه فهلك وودوا أنه أصابه شر ‏.‏ فقضى رسول الله صلى الله عليه وسلم الصلاة وقال ‏\"‏ أليس يشهد أن لا إله إلا الله وأني رسول الله ‏\"‏ ‏.‏ قالوا إنه يقول ذلك وما هو في قلبه ‏.‏ قال ‏\"‏ لا يشهد أحد أن لا إله إلا الله وأني رسول الله فيدخل النار أو تطعمه ‏\"‏ ‏.‏ قال أنس فأعجبني هذا الحديث فقلت لابني اكتبه فكتبه ‏.‏",
      "text_en": " It is narrated on the authority of 'Itban b. Malik that he came to Medina and said:                      Something had gone wrong with my eyesight. I, therefore, sent (a message to the Holy Prophet): Verily it is my ardent desire that you should kindly grace my house with your presence and observe prayer there so, that I should make that corner a place of worship. He said: The Prophet (may peace be upon him) came there, and those amongst the Companions whom Allah willed also accompanied him. He entered (my place) and offered prayer at my residence and his Companions began to talk amongst themselves (and this conversation centered round hypocrites), and then the conspicuous one, Malik b. Dukhshum was made the target and they wished that he (the Holy Prophet) should curse him and he should die or he should meet some calamity. In the meanwhile the Messenger of Allah (may peace and blessings be upon him) completed his prayer and said: Does Malik b. Dukhshum not testify the fact that there is no god but Allah and verily I am the messenger of Allah. They replied: He makes a profession of it (no doubt) but does not do it out of (sincere) heart. He (the Holy Prophet) said: He who testifies that there is no god but Allah and I am the messenger of Allah would not enter Hell or its (flames) would not consume him. Anas said: This hadith impressed me very much and I told my son to write it down.",
      "chain": [
        "20656",
        "20236",
        "11269",
        "19",
        "5278",
        "251"
      ]
    },
    {
      "hadith_no": "394",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعمرو الناقد، وإسحاق بن إبراهيم، جميعا عن سفيان، - قال أبو بكر حدثنا سفيان بن عيينة، - عن الزهري، عن محمود بن الربيع، عن عبادة بن الصامت، يبلغ به النبي صلى الله عليه وسلم ‏\"‏ لا صلاة لمن لم يقرأ بفاتحة الكتاب ‏\"‏ ‏.‏",
      "text_en": " 'Ubada b. as-Samit reported from the Apostle of Allah (may peace be upon him ):                      He who does not recite Fatihat al-Kitab is not credited with having observed the prayer.",
      "chain": [
        "30201",
        "30263",
        "30123",
        "20005",
        "20436",
        "20005",
        "11013",
        "5278"
      ]
    },
    {
      "hadith_no": "394",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثني أبو الطاهر، حدثنا ابن وهب، عن يونس، ح وحدثني حرملة بن يحيى، أخبرنا ابن وهب، أخبرني يونس، عن ابن شهاب، أخبرني محمود بن الربيع، عن عبادة بن الصامت، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا صلاة لمن لم يقترئ بأم القرآن ‏\"‏ ‏.‏",
      "text_en": " Ubada b. as-Samit reported:                      The Messenger of Allah (may peace be upon him) said: He who does not recite Umm al-Qur'an is not credited with having observed the prayer.",
      "chain": [
        "20029",
        "20475",
        "30487",
        "20029",
        "20475",
        "11013",
        "5278",
        "40"
      ]
    },
    {
      "hadith_no": "1528",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثني حرملة بن يحيى التجيبي، أخبرنا ابن وهب، أخبرني يونس، عن ابن شهاب، أن محمود بن الربيع الأنصاري، حدثه أن عتبان بن مالك وهو من أصحاب النبي صلى الله عليه وسلم ممن شهد بدرا من الأنصار أنه أتى رسول الله صلى الله عليه وسلم فقال يا رسول الله إني قد أنكرت بصري وأنا أصلي لقومي وإذا كانت الأمطار سال الوادي الذي بيني وبينهم ولم أستطع أن آتي مسجدهم فأصلي لهم وددت أنك يا رسول الله تأتي فتصلي في مصلى ‏.‏ فأتخذه مصلى ‏.‏ قال فقال رسول الله صلى الله عليه وسلم ‏\"‏ سأفعل إن شاء الله ‏\"‏ ‏.‏ قال عتبان فغدا رسول الله صلى الله عليه وسلم وأبو بكر الصديق حين ارتفع النهار فاستأذن رسول الله صلى الله عليه وسلم فأذنت له فلم يجلس حتى دخل البيت ثم قال ‏\"‏ أين تحب أن أصلي من بيتك ‏\"‏ ‏.‏ قال فأشرت إلى ناحية من البيت فقام رسول الله صلى الله عليه وسلم فكبر فقمنا وراءه فصلى ركعتين ثم سلم - قال - وحبسناه على خزير صنعناه له - قال - فثاب رجال من أهل الدار حولنا حتى اجتمع في البيت رجال ذوو عدد فقال قائل منهم أين مالك بن الدخشن فقال بعضهم ذلك منافق لا يحب الله ورسوله ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تقل له ذلك ألا تراه قد قال لا إله إلا الله ‏.‏ يريد بذلك وجه الله ‏\"‏ ‏.‏ قال قالوا الله ورسوله أعلم ‏.‏ قال فإنما نرى وجهه ونصيحته للمنافقين ‏.‏ قال فقال رسول الله صلى الله عليه وسلم ‏\"‏ فإن الله قد حرم على النار من قال لا إله إلا الله ‏.‏ يبتغي بذلك وجه الله ‏\"‏ ‏.‏ قال ابن شهاب ثم سألت الحصين بن محمد الأنصاري - وهو أحد بني سالم وهو من سراتهم - عن حديث محمود بن الربيع فصدقه بذلك ‏.‏",
      "text_en": " Mahmud b. al-Rabi' reported that 'Ibn b. Malik, who was one of the Companions of the Apostle of Allah (may peace be upon him) and who participated in the (Battle of) Badr and was among the Ansar (of Medina), told that he came to the Messenger of Allah (may peace be upon him) and said:                      Messenger of Allah, I have lost my eyesight and I lead my people in prayer. When there is a downpour there is then a current (of water) in the valley that stands between me and them and I find it impossible to go to their mosque and lead them in prayer. Messenger of Allah, I earnestly beg of you that you should come and observe prayer at a place of worship (in my house) so that I should then use it as a place of worship. The Messenger of Allah (may peace be upon him) said: Well, it God so wills. I would soon do so. 'Itban said: On the following day when the day dawned, the Messenger of Allah (may peace he upon him) came along with Abu Bakr at-Siddiq, and the Messenger of Allah (may peace be upon him) asked permission (to get into the house). I gave him the permission, and be did not sit after entering the house, when he said: At what place in your house you desire me to say prayer? I ('Itban b. Malik) said: I pointed to a corner in the house, The Messenger of Allah (may peace be upon him) stood (at that place for prayer) and pronounced Allah-o-Akbar (Allah is the Greatest) (as an expression for the commencement of prayer). We too stood behind him, and he said two rak'ahs and then pronounced salutation (marking the end of the prayer). We detained him (the Holy Prophet) for the meat curry we had prepared for, him. The people of the neighbouring houses came and thus there was a good gathering in (our house). One of them said: Where is Malik b. Dukhshun? Upon this one of them remarked: He is a hypocrite; he does not love Allah and His Messenger. Thereupon the Messenger of Allah (may peace be upon him) said: Do not say so about him. Don't you see that he utters La ilaha ill-Allah (There is no god but Allah) and seeks the pleasure of Allah through it? They said: Allah and His Messenger know beet. One (among the audience) said: We see his inclination and wellwishing for hypocrites only. Upon this the Messenger of Allah' (may peace be upon him) again said: Verily Allah has forbidden the Fire for one who says: There is no god but Allah, thereby seeking Allah's pleasure. Ibn Shihab said: I asked Husain b. Muhammad al-Ansar (he was one of the leaders of Banu Salim) about the hadith transmitted by Mahmud b. Rabi' and he testified it.",
      "chain": [
        "30487",
        "20029",
        "20475",
        "11013",
        "5278"
      ]
    },
    {
      "hadith_no": "1530",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا إسحاق بن إبراهيم، أخبرنا الوليد بن مسلم، عن الأوزاعي، قال حدثني الزهري، عن محمود بن الربيع، قال إني لأعقل مجة مجها رسول الله صلى الله عليه وسلم من دلو في دارنا ‏.‏ قال محمود فحدثني عتبان بن مالك قال قلت يا رسول الله إن بصري قد ساء ‏.‏ وساق الحديث إلى قوله فصلى بنا ركعتين وحبسنا رسول الله صلى الله عليه وسلم على جشيشة صنعناها له ‏.‏ ولم يذكر ما بعده من زيادة يونس ومعمر ‏.‏",
      "text_en": " Mahmud b. Rabi' reported:                      I well remember the disgorge of the Messenger of Allah (may peace be upon him) that he did (with water) from a bucket of our house. Mahmud said: 'Itban b. Malik narrated it to me that he had said: Messenger of Allah, I have lost my eyesight, and the rest of the hadith is the same up to these words:\" He led us in two rak'ahs of prayer and we detained the Messenger of Allah (may peace be upon him) for serving him the pudding that we had prepared for him,\" and no mention has been made of what follows next from the addition made by Yunus and Ma'mar.",
      "chain": [
        "30123",
        "20733",
        "20024",
        "11013",
        "5278"
      ]
    },
    {
      "hadith_no": "822",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة بن سعيد، وابن السرح، قالا حدثنا سفيان، عن الزهري، عن محمود بن الربيع، عن عبادة بن الصامت، يبلغ به النبي صلى الله عليه وسلم قال ‏\"‏ لا صلاة لمن لم يقرأ بفاتحة الكتاب فصاعدا ‏\"‏ ‏.‏ قال سفيان لمن يصلي وحده ‏.‏",
      "text_en": " 'Ubadah b. al-Samit reported the Messenger of Allah (ﷺ) as saying :                      the prayer is not valid I one does not recite fatihat al-kitab and something more, sufyan( the narrator) said: This applies to a man who prays alone.",
      "chain": [
        "30367",
        "30485",
        "20005",
        "11013",
        "5278"
      ]
    },
    {
      "hadith_no": "823",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا محمد بن سلمة، عن محمد بن إسحاق، عن مكحول، عن محمود بن الربيع، عن عبادة بن الصامت، قال كنا خلف رسول الله صلى الله عليه وسلم في صلاة الفجر فقرأ رسول الله صلى الله عليه وسلم فثقلت عليه القراءة فلما فرغ قال ‏\"‏ لعلكم تقرءون خلف إمامكم ‏\"‏ ‏.‏ قلنا نعم هذا يا رسول الله ‏.‏ قال ‏\"‏ لا تفعلوا إلا بفاتحة الكتاب فإنه لا صلاة لمن لم يقرأ بها ‏\"‏ ‏.‏",
      "text_en": " Narrated Ubadah ibn as-Samit:                     We were behind the Messenger of Allah (ﷺ) at the dawn prayer, and he recited (the passage), but the recitation became difficult for him. Then when he finished, he said: Perhaps you recite behind your imam? We replied: Yes, it is so, Messenger of Allah. He said: Do not do so except when it is Fatihat al-Kitab, for he who does not recite it is not credited with having prayed.",
      "chain": [
        "30352",
        "20672",
        "11107",
        "11066",
        "5278",
        "40"
      ]
    },
    {
      "hadith_no": "247",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن يحيى بن أبي عمر المكي أبو عبد الله العدني، وعلي بن حجر، قالا حدثنا سفيان بن عيينة، عن الزهري، عن محمود بن الربيع، عن عبادة بن الصامت، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا صلاة لمن لم يقرأ بفاتحة الكتاب ‏\"‏ ‏.‏ قال وفي الباب عن أبي هريرة وعائشة وأنس وأبي قتادة وعبد الله بن عمرو ‏.‏ قال أبو عيسى حديث عبادة حديث حسن صحيح ‏.‏ والعمل عليه عند أكثر أهل العلم من أصحاب النبي صلى الله عليه وسلم منهم عمر بن الخطاب وعلي بن أبي طالب وجابر بن عبد الله وعمران بن حصين وغيرهم قالوا لا تجزئ صلاة إلا بقراءة فاتحة الكتاب ‏.‏ وقال علي بن أبي طالب كل صلاة لم يقرأ فيها بفاتحة الكتاب فهي خداج غير تمام ‏.‏ وبه يقول ابن المبارك والشافعي وأحمد وإسحاق ‏.‏ سمعت ابن أبي عمر يقول اختلفت إلى ابن عيينة ثمانية عشر سنة وكان الحميدي أكبر مني بسنة ‏.‏ وسمعت ابن أبي عمر يقول حججت سبعين حجة ماشيا على قدمى ‏.‏",
      "text_en": " Ubadah bin As-Samil narrated that :                     the Prophet said: \"There is no Salat for the one who does not recite Fatihatil-Kitab.\"",
      "chain": [
        "11222",
        "20387",
        "20005",
        "11013",
        "5278",
        "40"
      ]
    },
    {
      "hadith_no": "311",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا هناد، حدثنا عبدة بن سليمان، عن محمد بن إسحاق، عن مكحول، عن محمود بن الربيع، عن عبادة بن الصامت، قال صلى رسول الله صلى الله عليه وسلم الصبح فثقلت عليه القراءة فلما انصرف قال ‏\"‏ إني أراكم تقرءون وراء إمامكم ‏\"‏ ‏.‏ قال قلنا يا رسول الله إي والله ‏.‏ قال ‏\"‏ فلا تفعلوا إلا بأم القرآن فإنه لا صلاة لمن لم يقرأ بها ‏\"‏ ‏.‏ قال وفي الباب عن أبي هريرة وعائشة وأنس وأبي قتادة وعبد الله بن عمرو ‏.‏ قال أبو عيسى حديث عبادة حديث حسن ‏.‏ وروى هذا الحديث الزهري عن محمود بن الربيع عن عبادة بن الصامت عن النبي صلى الله عليه وسلم قال ‏\"‏ لا صلاة لمن لم يقرأ بفاتحة الكتاب ‏\"‏ ‏.‏ قال وهذا أصح ‏.‏ والعمل على هذا الحديث في القراءة خلف الإمام عند أكثر أهل العلم من أصحاب النبي صلى الله عليه وسلم والتابعين وهو قول مالك بن أنس وابن المبارك والشافعي وأحمد وإسحاق يرون القراءة خلف الإمام ‏.‏",
      "text_en": " Ubadah bin As-Samit narrated:                     \"Allah's Messenger prayed the Subh prayer, and he had difficulty with the recitation. When turned (after finishing) he said: 'I think that you are reciting behind your Imam?'\" He said: \"We said: 'Yes, Messenger of Allah, by Allah!' He said: 'Do not do that, except for Umm Al-Kitab, for there is no Salat for one who does not recite it.'\"",
      "chain": [
        "30480",
        "20337",
        "11107",
        "11066",
        "5278",
        "40"
      ]
    },
    {
      "hadith_no": "788",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا هارون بن عبد الله، قال حدثنا معن، قال حدثنا مالك، ح قال وحدثنا الحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن القاسم، قال حدثني مالك، عن ابن شهاب، عن محمود بن الربيع، ‏.‏ أن عتبان بن مالك، كان يؤم قومه وهو أعمى وأنه قال لرسول الله صلى الله عليه وسلم إنها تكون الظلمة والمطر والسيل وأنا رجل ضرير البصر فصل يا رسول الله في بيتي مكانا أتخذه مصلى ‏.‏ فجاء رسول الله صلى الله عليه وسلم فقال ‏\"‏ أين تحب أن أصلي لك ‏\"‏ ‏.‏ فأشار إلى مكان من البيت فصلى فيه رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated from Mahmiid bin Ar-Rabi' that 'Itbk bin Milk used to lead his people in prayer, and he was blind. He said to theMessenger of Allah (ﷺ):                     \"Sometimes it is dark or rainy or there is a flood, and I am a blindman; 0 Messenger of Allah (ﷺ), (come and) pray in a place in my house that I may take as a prayer-place.\" He said: \"Where would you likeme to pray for you?\" He showed him a place in his house, and the Messenger of Allah (ﷺ) prayed there.",
      "chain": [
        "30524",
        "30112",
        "20001",
        "36017",
        "30234",
        "20001",
        "11013",
        "5278",
        "251"
      ]
    },
    {
      "hadith_no": "910",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا محمد بن منصور، عن سفيان، عن الزهري، عن محمود بن الربيع، عن عبادة بن الصامت، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا صلاة لمن لم يقرأ بفاتحة الكتاب ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ubadah bin As-Samit that :                     The Prophet (ﷺ) said: \"There is no Salah for one who does not recite Fatihatil-Kitab.\"",
      "chain": [
        "36658",
        "20005",
        "11013",
        "5278",
        "40"
      ]
    },
    {
      "hadith_no": "911",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا سويد بن نصر، قال أنبأنا عبد الله، عن معمر، عن الزهري، عن محمود بن الربيع، عن عبادة بن الصامت، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا صلاة لمن لم يقرأ بفاتحة الكتاب فصاعدا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ubadah bin As-Samit said:                     \"The Messenger of Allah (ﷺ) said: \"There is no Salah for one who does not recite Fatihatil-Kitab or more.'\"",
      "chain": [
        "38265",
        "20025",
        "20115",
        "11013",
        "5278",
        "40"
      ]
    },
    {
      "hadith_no": "1327",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا سويد بن نصر، قال أنبأنا عبد الله بن المبارك، عن معمر، عن الزهري، أخبره قال أخبرني محمود بن الربيع، قال سمعت عتبان بن مالك، يقول كنت أصلي بقومي بني سالم فأتيت رسول الله صلى الله عليه وسلم فقلت إني قد أنكرت بصري وإن السيول تحول بيني وبين مسجد قومي فلوددت أنك جئت فصليت في بيتي مكانا أتخذه مسجدا ‏.‏ قال النبي صلى الله عليه وسلم ‏\"‏ سأفعل إن شاء الله ‏\"‏ ‏.‏ فغدا على رسول الله صلى الله عليه وسلم وأبو بكر - رضى الله عنه - معه بعد ما اشتد النهار فاستأذن النبي صلى الله عليه وسلم فأذنت له فلم يجلس حتى قال ‏\"‏ أين تحب أن أصلي من بيتك ‏\"‏ ‏.‏ فأشرت له إلى المكان الذي أحب أن يصلي فيه فقام رسول الله صلى الله عليه وسلم وصففنا خلفه ثم سلم وسلمنا حين سلم ‏.‏",
      "text_en": " 'Itban bin Malik said:                     \"I used to lead my people Bani Salim in prayer. I came to the Messenger of Allah (ﷺ) and said: 'I have lost my eyesight and the rainwater prevents me from reaching the masjid of my people. I would like you to come and pray in my house in a place that I can take as a masjid.' The Prophet (ﷺ) said: 'I will do that, if Allah (SWT) wills.' The next day, the Messenger of Allah (ﷺ) came, and Abu Bakr was with him, after the day had grown hot. The Prophet (ﷺ) asked for permission to enter, and I gave him permission. He did not sit own until he asked: 'Where would you like me to pray in your house?' I showed him the place where I wanted him to pray, so the Messenger of Allah (ﷺ) stood there and formed a row behind him, then he said the salam and we said the salam when he did.\"",
      "chain": [
        "38265",
        "20025",
        "20115",
        "11013",
        "5278",
        "251"
      ]
    },
    {
      "hadith_no": "705",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو مروان، حدثنا إبراهيم بن سعد، عن الزهري، عن محمود بن الربيع، وكان، قد عقل مجة مجها رسول الله  صلى الله عليه وسلم  في دلو من بئر لهم ‏.‏",
      "text_en": " It was narrated from Zuhri that:                     Mahmud bin Rabi' remembered that the Prophet spat into a bucket from a well that belonged to them.",
      "chain": [
        "20150",
        "11013",
        "5278"
      ]
    },
    {
      "hadith_no": "754",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book On The Mosques And The Congregations - كتاب المساجد والجماعات",
      "chapter_no": "4",
      "text_ar": "حدثنا أبو مروان، محمد بن عثمان حدثنا إبراهيم بن سعد، عن ابن شهاب، عن محمود بن الربيع الأنصاري، - وكان قد عقل مجة مجها رسول الله  صلى الله عليه وسلم  من دلو في بئر لهم - عن عتبان بن مالك السالمي - وكان إمام قومه بني سالم وكان شهد بدرا مع رسول الله  صلى الله عليه وسلم  - قال جئت رسول الله  صلى الله عليه وسلم  فقلت يا رسول الله إني قد أنكرت من بصري وإن السيل يأتيني فيحول بيني وبين مسجد قومي ويشق على اجتيازه فإن رأيت أن تأتيني فتصلي في بيتي مكانا أتخذه مصلى فافعل ‏.‏ قال ‏\"‏ أفعل ‏\"‏ ‏.‏ فغدا على رسول الله  صلى الله عليه وسلم  وأبو بكر بعد ما اشتد النهار واستأذن فأذنت له ولم يجلس حتى قال ‏\"‏ أين تحب أن أصلي لك من بيتك ‏\"‏ ‏.‏ فأشرت له إلى المكان الذي أحب أن أصلي فيه فقام رسول الله  صلى الله عليه وسلم  وصففنا خلفه فصلى بنا ركعتين ثم احتبسته على خزيرة تصنع لهم ‏.‏",
      "text_en": " Mahmud bin Rabi' Al-Ansari, who remembered that the Messenger of Allah spat a mouthful of water from a bucket into a well that belonged to them, narrated that :                     'Itban bin Malik As-Salimi who was the chief of his people Banu Salim and had participated in (the battle of) Badr with the Messenger of Allah said: \"I came to the Messenger of Allah and said: 'O Messenger of Allah, my sight is failing and the flood comes and prevents me from reaching the mosque of my people, and it is too hard for me to cross the water. Do you think you could come and perform prayer in my house in a place which I can then take as a place of prayer?' He said: 'I will do that.' The following day, the Messenger of Allah and Abu Bakr came, when the heat of the day had grown intense. He asked permission to enter, and I gave him permission. He did not sit down until he said: 'Where would you like me to perform prayer for you in your house?' I showed him the place where I wanted him to pray, so the Messenger of Allah stood and we lined up behind him, and he led us in praying two Rak'ah (units). Then I asked him to stay and eat some Khazirah that had been prepared for them.'\"",
      "chain": [
        "20150",
        "11013",
        "5278"
      ]
    },
    {
      "hadith_no": "886",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا هشام بن عمار، وسهل بن أبي سهل، وإسحاق بن إسماعيل، قالوا حدثنا سفيان بن عيينة، عن الزهري، عن محمود بن الربيع، عن عبادة بن الصامت، أن النبي  صلى الله عليه وسلم  قال ‏\"‏ لا صلاة لمن لم يقرأ فيها بفاتحة الكتاب ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Ubadah bin Samit that the Prophet (ﷺ) said:                     “Thereis no prayer for the one who does not recite Fatihatil-Kitab init.”",
      "chain": [
        "30288",
        "38259",
        "20005",
        "11013",
        "5278",
        "40"
      ]
    }
  ],
  "total_hadiths": 31
}