{
  "id": "5281",
  "name": "Makhnaf bin Sulaym bin al-Harith ( مخنف بن سليم ( رضي الله عنه",
  "full_name": "Makhnaf bin Sulaym bin al-Harith ( مخنف بن سليم ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Kufa"
    ],
    "area_of_interest": [
      "Narrator [ 4  -  صحابي ]"
    ],
    "tags": [
      "al-Azdi",
      "Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "5",
      "name": "Ali ibn Abi Talib ( علي بن أبي طالب بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "33",
      "name": "Abu Ayyub al-Ansari ( أبو أيوب الأنصاري خالد بن زيد ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11383",
      "name": "Awn bin Abi Juhayfa عون بن أبي جحيفة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "19917",
      "name": "'Amir Abu Rmlh عامر أبو رملة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "15677",
      "name": "Abu Sadq al-Azdy al-Kwfy أبو صادق الأزدي الكوفي",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "2788",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Sacrifice (Kitab Al-Dahaya) - كتاب الضحايا",
      "chapter_no": "16",
      "text_ar": "حدثنا مسدد، حدثنا يزيد، ح وحدثنا حميد بن مسعدة، حدثنا بشر، عن عبد الله بن عون، عن عامر أبي رملة، قال أخبرنا مخنف بن سليم، قال ونحن وقوف مع رسول الله صلى الله عليه وسلم بعرفات قال ‏\"‏ يا أيها الناس إن على كل أهل بيت في كل عام أضحية وعتيرة أتدرون ما العتيرة هذه التي يقول الناس الرجبية ‏\"‏ ‏.‏ قال أبو داود العتيرة منسوخة هذا خبر منسوخ ‏.‏",
      "text_en": " Narrated Mikhnaf ibn Sulaym:                     We were staying with the Messenger of Allah (ﷺ) at Arafat; he said: O people, every family must offer a sacrifice and an atirah. Do you know what  the atirah is? It is what you call the Rajab sacrifice.Abu Dawud said: 'Atirah has been abrogated, and this tradition is an abrogated one.",
      "chain": [
        "30175",
        "20304",
        "30430",
        "20212",
        "11071",
        "5281"
      ]
    },
    {
      "hadith_no": "1518",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Sacrifices - كتاب الأضاحى عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "19",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا روح بن عبادة، حدثنا ابن عون، حدثنا أبو رملة، عن مخنف بن سليم، قال كنا وقوفا مع النبي صلى الله عليه وسلم بعرفات فسمعته يقول ‏\"‏ يا أيها الناس على كل أهل بيت في كل عام أضحية وعتيرة هل تدرون ما العتيرة هي التي تسمونها الرجبية ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ولا نعرف هذا الحديث إلا من هذا الوجه من حديث ابن عون ‏.‏",
      "text_en": " Narrated Mikhnaf bin Sulaim:                     \"We were standing with the Prophet (ﷺ) at 'Arafat when I heard him say: 'O you people! For every household each year is Udhiyah (sacrifice) and 'Atirah. Do you know what an 'Atirah is ? It is that which you call Ar-Rajabiyyah.'\"",
      "chain": [
        "30242",
        "20229",
        "11071",
        "5281"
      ]
    },
    {
      "hadith_no": "4224",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of al-Fara' and al-'Atirah - كتاب الفرع والعتيرة",
      "chapter_no": "41",
      "text_ar": "أخبرنا عمرو بن زرارة، قال حدثنا معاذ، - وهو ابن معاذ - قال حدثنا ابن عون، قال حدثنا أبو رملة، قال أنبأنا مخنف بن سليم، قال بينا نحن وقوف مع النبي صلى الله عليه وسلم بعرفة فقال ‏\"‏ يا أيها الناس إن على أهل بيت في كل عام أضحاة وعتيرة ‏\"‏ ‏.‏ قال معاذ كان ابن عون يعتر أبصرته عيني في رجب ‏.‏",
      "text_en": " Mikhnaf bin Sulaim said:                     \"While we were standing with the Messenger of Allah at 'Arafat, he said: 'O people, it is upon each family to offer a sacrifice (Udhiyah) and an 'Atirah each year.\" (One of the narrators) Muadh said: \"Ibn 'Awn used to offer slaughter the 'Atirah, and I saw that with my own eyes during Rajab.\" (Daif)",
      "chain": [
        "30365",
        "20286",
        "11071",
        "5281"
      ]
    },
    {
      "hadith_no": "3245",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Sacrifices - كتاب الأضاحي",
      "chapter_no": "26",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا معاذ بن معاذ، عن ابن عون، قال أنبأنا أبو رملة، عن مخنف بن سليم، قال كنا وقوفا عند النبي  صلى الله عليه وسلم  بعرفة فقال ‏\"‏ يا أيها الناس إن على كل أهل بيت في كل عام أضحية وعتيرة ‏\"‏ ‏.‏ أتدرون ما العتيرة هي التي يسميها الناس الرجبية ‏.‏",
      "text_en": " It wasnarrated that Mikhnaf bin Sulaim said:                      “We were standing with theProphet (ﷺ) at ‘Arafat and he said: ‘O people, each family,each year, must offer Udhiyah and ‘Atirah.’",
      "chain": [
        "30201",
        "20286",
        "11071",
        "5281"
      ]
    }
  ],
  "total_hadiths": 4
}