{
  "id": "53",
  "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
  "full_name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
  "grade": "Comp.(RA) [1st Generation]",
  "biography": {
    "birth": {
      "date_hijri": "9",
      "date_gregorian": "614",
      "date_display": [
        "9 BH",
        "614 CE"
      ],
      "place": "Makkah"
    },
    "death": {
      "date_hijri": "57",
      "date_gregorian": "678",
      "date_display": null,
      "place": "17 Ramadan, Medina",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah",
      "Medina"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Tafsir/Quran",
      "Narrator [ ع  -  صحابة ]",
      "Fiqh",
      "Seerah"
    ],
    "tags": [
      "Female",
      "Quraish",
      "B.Taym",
      "Mother of the Believers",
      "Emigrant",
      "Baqi'"
    ]
  },
  "parents": [
    {
      "id": "2",
      "name": "Abu Bakr As-Siddique ( أبو بكر الصديق ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "91",
      "name": "Umm Ruman ( أم رومان زينب بنت عامر ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "spouses": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "siblings": [
    {
      "id": "107",
      "name": "'Abdur Rahman bin Abi Bakr ( عبد الرحمن بن أبي بكر الصديق ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "2",
      "name": "Abu Bakr As-Siddique ( أبو بكر الصديق ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3",
      "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "6",
      "name": "Talha ibn 'Ubaidullah ( طلحة بن عبيد الله ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "9",
      "name": "Sa'd ibn Abi Waqqas ( سعد بن أبي وقاص ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "63",
      "name": "Fatima bint Muhammad ( فاطمة الزهراء بنت محمد بن عبد الله ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "961",
      "name": "Judhama bint Jandal al-Asadiyya ( جذامة بنت جندل/جدامة بنت وهب الأسدية ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "70",
      "name": "Asma' bint Abi Bakr ( أسماء بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "106",
      "name": "'Abdullah ibn al-Zubayr ( عبد الله بن الزبير بن العوام ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "41",
      "name": "Abu Musa al-Asha'ari ( أبو موسى الأشعري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "28",
      "name": "'Amr bin al-'Aas ( عمرو بن العاص بن وائل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "10535",
      "name": "al-Qasim ibn Muhammad القاسم بن محمد بن أبي بكر الصديق",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10511",
      "name": "'Urwa ibn al-Zubayr عروة بن الزبير",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10520",
      "name": "'Abdullah ibn 'Abdur-Rahman ibn Abi Bakr عبد الله بن عبد الرحمن بن أبي بكر الصديق",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10521",
      "name": "Hafsa bint 'Abdur-Rahman ibn Abi Bakr حفصة بنت عبد الرحمن بن أبي بكر الصديق",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10522",
      "name": "Asma bint 'Abdur-Rahman أسماء بنت عبد الرحمن بن أبى بكر الصديق",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11002",
      "name": "Sa'id ibn al-Musayyib سعيد بن المسيب بن حزن أبو محمد القرشي",
      "grade": "Follower(Tabi') [2nd Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "2",
      "source": " Sahih Bukhari ",
      "chapter": "Revelation - كتاب بدء الوحى",
      "chapter_no": "1",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن هشام بن عروة، عن أبيه، عن عائشة أم المؤمنين  رضى الله عنها  أن الحارث بن هشام  رضى الله عنه  سأل رسول الله صلى الله عليه وسلم فقال يا رسول الله كيف يأتيك الوحى فقال رسول الله صلى الله عليه وسلم ‏\"‏ أحيانا يأتيني مثل صلصلة الجرس  وهو أشده على  فيفصم عني وقد وعيت عنه ما قال، وأحيانا يتمثل لي الملك رجلا فيكلمني فأعي ما يقول ‏\"‏‏.‏ قالت عائشة رضى الله عنها ولقد رأيته ينزل عليه الوحى في اليوم الشديد البرد، فيفصم عنه وإن جبينه ليتفصد عرقا‏.‏",
      "text_en": "      Narrated 'Aisha:                          (the mother of the faithful believers) Al-Harith bin Hisham asked Allah's Apostle \"O Allah's Apostle! How is the Divine Inspiration revealed to you?\" Allah's Apostle replied, \"Sometimes it is (revealed) like the ringing of a bell, this form of Inspiration is the hardest of all and then this state passes off after I have grasped what is inspired. Sometimes the Angel comes in the form of a man and talks to me and I grasp whatever he says.\" 'Aisha added: Verily I saw the Prophet being inspired divinely on a very cold day and noticed the sweat dropping from his forehead (as the Inspiration was over).",
      "chain": [
        "30355",
        "20001",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "3",
      "source": " Sahih Bukhari ",
      "chapter": "Revelation - كتاب بدء الوحى",
      "chapter_no": "1",
      "text_ar": "حدثنا يحيى بن بكير، قال حدثنا الليث، عن عقيل، عن ابن شهاب، عن عروة بن الزبير، عن عائشة أم المؤمنين، أنها قالت أول ما بدئ به رسول الله صلى الله عليه وسلم من الوحى الرؤيا الصالحة في النوم، فكان لا يرى رؤيا إلا جاءت مثل فلق الصبح، ثم حبب إليه الخلاء، وكان يخلو بغار حراء فيتحنث فيه  وهو التعبد  الليالي ذوات العدد قبل أن ينزع إلى أهله، ويتزود لذلك، ثم يرجع إلى خديجة، فيتزود لمثلها، حتى جاءه الحق وهو في غار حراء، فجاءه الملك فقال اقرأ‏.‏ قال ‏\"‏ ما أنا بقارئ ‏\"‏‏.‏ قال ‏\"‏ فأخذني فغطني حتى بلغ مني الجهد، ثم أرسلني فقال اقرأ‏.‏ قلت ما أنا بقارئ‏.‏ فأخذني فغطني الثانية حتى بلغ مني الجهد، ثم أرسلني فقال اقرأ‏.‏ فقلت ما أنا بقارئ‏.‏ فأخذني فغطني الثالثة، ثم أرسلني فقال ‏{‏اقرأ باسم ربك الذي خلق * خلق الإنسان من علق * اقرأ وربك الأكرم‏}‏ ‏\"‏‏.‏ فرجع بها رسول الله صلى الله عليه وسلم يرجف فؤاده، فدخل على خديجة بنت خويلد رضى الله عنها فقال ‏\"‏ زملوني زملوني ‏\"‏‏.‏ فزملوه حتى ذهب عنه الروع، فقال لخديجة وأخبرها الخبر ‏\"‏ لقد خشيت على نفسي ‏\"‏‏.‏ فقالت خديجة كلا والله ما يخزيك الله أبدا، إنك لتصل الرحم، وتحمل الكل، وتكسب المعدوم، وتقري الضيف، وتعين على نوائب الحق‏.‏ فانطلقت به خديجة حتى أتت به ورقة بن نوفل بن أسد بن عبد العزى ابن عم خديجة  وكان امرأ تنصر في الجاهلية، وكان يكتب الكتاب العبراني، فيكتب من الإنجيل بالعبرانية ما شاء الله أن يكتب، وكان شيخا كبيرا قد عمي  فقالت له خديجة يا ابن عم اسمع من ابن أخيك‏.‏ فقال له ورقة يا ابن أخي ماذا ترى فأخبره رسول الله صلى الله عليه وسلم خبر ما رأى‏.‏ فقال له ورقة هذا الناموس الذي نزل الله على موسى صلى الله عليه وسلم يا ليتني فيها جذعا، ليتني أكون حيا إذ يخرجك قومك‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أومخرجي هم ‏\"‏‏.‏ قال نعم، لم يأت رجل قط بمثل ما جئت به إلا عودي، وإن يدركني يومك أنصرك نصرا مؤزرا‏.‏ ثم لم ينشب ورقة أن توفي وفتر الوحى‏.‏",
      "text_en": " Narrated 'Aisha:                       (the mother of the faithful believers) The commencement of the Divine Inspiration to Allah's Apostle was in the form of good dreams which came true like bright daylight, and then the love of seclusion was bestowed upon him. He used to go in seclusion in the cave of Hira where he used to worship (Allah alone) continuously for many days before his desire to see his family. He used to take with him the journey food for the stay and then come back to (his wife) Khadija to take his food likewise again till suddenly the Truth descended upon him while he was in the cave of Hira. The angel came to him and asked him to read. The Prophet replied, \"I do not know how to read.\" The Prophet added, \"The angel caught me (forcefully) and pressed me so hard that I could not bear it any more. He then released me and again asked me to read and I replied, 'I do not know how to read.' Thereupon he caught me again and pressed me a second time till I could not bear it any more. He then released me and again asked me to read but again I replied, 'I do not know how to read (or what shall I read)?' Thereupon he caught me for the third time and pressed me, and then released me and said, 'Read in the name of your Lord, who has created (all that exists), created man from a clot. Read! And your Lord is the Most Generous.\" (96.1, 96.2, 96.3) Then Allah's Apostle returned with the Inspiration and with his heart beating severely. Then he went to Khadija bint Khuwailid and said, \"Cover me! Cover me!\" They covered him till his fear was over and after that he told her everything that had happened and said, \"I fear that something may happen to me.\" Khadija replied, \"Never! By Allah, Allah will never disgrace you. You keep good relations with your kith and kin, help the poor and the destitute, serve your guests generously and assist the deserving calamity-afflicted ones.\"  Khadija then accompanied him to her cousin Waraqa bin Naufal bin Asad bin 'Abdul 'Uzza, who, during the pre-Islamic Period became a Christian and used to write the writing with Hebrew letters. He would write from the Gospel in Hebrew as much as Allah wished him to write. He was an old man and had lost his eyesight. Khadija said to Waraqa, \"Listen to the story of your nephew, O my cousin!\" Waraqa asked, \"O my nephew! What have you seen?\" Allah's Apostle described whatever he had seen. Waraqa said, \"This is the same one who keeps the secrets (angel Gabriel) whom Allah had sent to Moses. I wish I were young and could live up to the time when your people would turn you out.\" Allah's Apostle asked, \"Will they drive me out?\" Waraqa replied in the affirmative and said, \"Anyone (man) who came with something similar to what you have brought was treated with hostility; and if I should remain alive till the day when you will be turned out then I would support you strongly.\" But after a few days Waraqa died and the Divine Inspiration was also paused for a while.",
      "chain": [
        "30399",
        "20023",
        "11207",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "20",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن سلام، قال أخبرنا عبدة، عن هشام، عن أبيه، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم إذا أمرهم أمرهم من الأعمال بما يطيقون قالوا إنا لسنا كهيئتك يا رسول الله، إن الله قد غفر لك ما تقدم من ذنبك وما تأخر‏.‏ فيغضب حتى يعرف الغضب في وجهه ثم يقول ‏\"‏ إن أتقاكم وأعلمكم بالله أنا ‏\"‏‏.‏",
      "text_en": "      Narrated 'Aisha:                          Whenever Allah's Apostle ordered the Muslims to do something, he used      to order them deeds which were easy for them to do, (according to      their strength endurance). They said, \"O Allah's Apostle! We are not      like you. Allah  has forgiven your past and future sins.\" So Allah's      Apostle became angry and it was apparent on his face. He said, \"I am      the most Allah fearing, and know Allah better than all of you do.\"",
      "chain": [
        "30376",
        "20337",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "43",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا يحيى، عن هشام، قال أخبرني أبي، عن عائشة، أن النبي صلى الله عليه وسلم دخل عليها وعندها امرأة قال ‏\"‏ من هذه ‏\"‏‏.‏ قالت فلانة‏.‏ تذكر من صلاتها‏.‏ قال ‏\"‏ مه، عليكم بما تطيقون، فوالله لا يمل الله حتى تملوا ‏\"‏‏.‏ وكان أحب الدين إليه ما دام عليه صاحبه‏.‏",
      "text_en": "      Narrated 'Aisha:                          Once the Prophet came while a woman was sitting with me. He said, \"Who     is she?\" I replied, \"She is so and so,\" and told him about her      (excessive) praying. He said disapprovingly, \"Do (good) deeds which is     within your capacity (without being overtaxed) as Allah does not get      tired (of giving rewards) but (surely) you will get tired and the best     deed (act of Worship) in the sight of Allah is that which is done      regularly.\"",
      "chain": [
        "30170",
        "20031",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "103",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا سعيد بن أبي مريم، قال أخبرنا نافع بن عمر، قال حدثني ابن أبي مليكة، أن عائشة، زوج النبي صلى الله عليه وسلم كانت لا تسمع شيئا لا تعرفه إلا راجعت فيه حتى تعرفه، وأن النبي صلى الله عليه وسلم قال ‏\"‏ من حوسب عذب ‏\"‏‏.‏ قالت عائشة فقلت أو ليس يقول الله تعالى ‏{‏فسوف يحاسب حسابا يسيرا‏}‏ قالت فقال ‏\"‏ إنما ذلك العرض، ولكن من نوقش الحساب يهلك ‏\"‏‏.‏",
      "text_en": " Narrated Ibn Abu Mulaika:                     Whenever `Aisha (the wife of the Prophet) heard anything which she did not understand, she used to ask again till she understood it completely. Aisha said: \"Once the Prophet said, \"Whoever will be called to account (about his deeds on the Day of Resurrection) will surely be punished.\" I said, \"Doesn't Allah say: \"He surely will receive an easy reckoning.\" (84.8) The Prophet replied, \"This means only the presentation of the accounts but whoever will be argued about his account, will certainly be ruined.\"",
      "chain": [
        "30232",
        "20203",
        "11090",
        "53"
      ]
    },
    {
      "hadith_no": "146",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا يحيى بن بكير، قال حدثنا الليث، قال حدثني عقيل، عن ابن شهاب، عن عروة، عن عائشة، أن أزواج النبي، صلى الله عليه وسلم كن يخرجن بالليل إذا تبرزن إلى المناصع  وهو صعيد أفيح  فكان عمر يقول للنبي صلى الله عليه وسلم احجب نساءك‏.‏ فلم يكن رسول الله صلى الله عليه وسلم يفعل، فخرجت سودة بنت زمعة زوج النبي صلى الله عليه وسلم ليلة من الليالي عشاء، وكانت امرأة طويلة، فناداها عمر ألا قد عرفناك يا سودة‏.‏ حرصا على أن ينزل الحجاب، فأنزل الله آية الحجاب‏.‏",
      "text_en": " Narrated `Aisha:                     The wives of the Prophet used to go to Al-Manasi, a vast open place (near Baqi` at Medina) to answer the call of nature at night. `Umar used to say to the Prophet \"Let your wives be veiled,\" but Allah's Apostle did not do so. One night Sauda bint Zam`a the wife of the Prophet went out at `Isha' time and she was a tall lady. `Umar addressed her and said, \"I have recognized you, O Sauda.\" He said so, as he desired eagerly that the verses of Al-Hijab (the observing of veils by the Muslim women) may be revealed. So Allah revealed the verses of \"Al-Hijab\" (A complete body cover excluding the eyes).",
      "chain": [
        "30399",
        "20023",
        "11207",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "147",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا زكرياء، قال حدثنا أبو أسامة، عن هشام بن عروة، عن أبيه، عن عائشة، عن النبي صلى الله عليه وسلم قال ‏\"‏ قد أذن أن تخرجن في حاجتكن ‏\"‏‏.‏ قال هشام يعني البراز‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet said to his wives, \"You are allowed to go out to answer the call of nature. \"",
      "chain": [
        "11338",
        "20318",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "168",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا حفص بن عمر، قال حدثنا شعبة، قال أخبرني أشعث بن سليم، قال سمعت أبي، عن مسروق، عن عائشة، قالت كان النبي صلى الله عليه وسلم يعجبه التيمن في تنعله وترجله وطهوره وفي شأنه كله‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet used to like to start from the right side on wearing shoes, combing his hair and cleaning or washing himself and on doing anything else.",
      "chain": [
        "30329",
        "20020",
        "11324",
        "11351",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "198",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا أبو اليمان، قال أخبرنا شعيب، عن الزهري، قال أخبرني عبيد الله بن عبد الله بن عتبة، أن عائشة، قالت لما ثقل النبي صلى الله عليه وسلم واشتد به وجعه، استأذن أزواجه في أن يمرض في بيتي، فأذن له، فخرج النبي صلى الله عليه وسلم بين رجلين تخط رجلاه في الأرض بين عباس ورجل آخر‏.‏ قال عبيد الله فأخبرت عبد الله بن عباس فقال أتدري من الرجل الآخر قلت لا‏.‏ قال هو علي‏.‏ وكانت عائشة  رضى الله عنها  تحدث أن النبي صلى الله عليه وسلم قال بعد ما دخل بيته واشتد وجعه ‏\"‏ هريقوا على من سبع قرب، لم تحلل أوكيتهن، لعلي أعهد إلى الناس ‏\"‏‏.‏ وأجلس في مخضب لحفصة زوج النبي صلى الله عليه وسلم، ثم طفقنا نصب عليه تلك حتى طفق يشير إلينا أن قد فعلتن، ثم خرج إلى الناس‏.‏",
      "text_en": " Narrated `Aisha:                     When the ailment of the Prophet became aggravated and his disease became severe, he asked his wives to permit him to be nursed (treated) in my house. So they gave him the permission. Then the Prophet came (to my house) with the support of two men, and his legs were dragging on the ground, between `Abbas, and another man.\" 'Ubaidullah (the sub narrator) said, \"I informed `Abdullah bin `Abbas of what `Aisha said. Ibn `Abbas said: 'Do you know who was the other man?' I replied in the negative. Ibn `Abbas said, 'He was `Ali (bin Abi Talib).\" `Aisha further said, \"When the Prophet came to my house and his sickness became aggravated he ordered us to pour seven skins full of water on him, so that he might give some advice to the people. So he was seated in a Mikhdab (brass tub) belonging to Hafsa, the wife of the Prophet. Then, all of us started pouring water on him from the water skins till he beckoned to us to stop and that we have done (what he wanted us to do). After that he went out to the people.\"",
      "chain": [
        "30330",
        "20428",
        "11013",
        "11004",
        "53"
      ]
    },
    {
      "hadith_no": "212",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن هشام، عن أبيه، عن عائشة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا نعس أحدكم وهو يصلي فليرقد حتى يذهب عنه النوم، فإن أحدكم إذا صلى وهو ناعس لا يدري لعله يستغفر فيسب نفسه ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     Allah's Apostle said, \"If anyone of you feels drowsy while praying he should go to bed (sleep) till his slumber is over because in praying while drowsy one does not know whether one is asking for forgiveness or for a bad thing for oneself.\"",
      "chain": [
        "30355",
        "20001",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "222",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن هشام بن عروة، عن أبيه، عن عائشة أم المؤمنين، أنها قالت أتي رسول الله صلى الله عليه وسلم بصبي، فبال على ثوبه، فدعا بماء فأتبعه إياه‏.‏",
      "text_en": " Narrated `Aisha:                     (the mother of faithful believers) A child was brought to Allah's Apostle and it urinated on the garment of the Prophet. The Prophet asked for water and poured it over the soiled place.",
      "chain": [
        "30355",
        "20001",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "228",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا محمد، قال حدثنا أبو معاوية، حدثنا هشام بن عروة، عن أبيه، عن عائشة، قالت جاءت فاطمة ابنة أبي حبيش إلى النبي صلى الله عليه وسلم فقالت يا رسول الله إني امرأة أستحاض فلا أطهر، أفأدع الصلاة فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا، إنما ذلك عرق، وليس بحيض، فإذا أقبلت حيضتك فدعي الصلاة، وإذا أدبرت فاغسلي عنك الدم ثم صلي ‏\"‏‏.‏ قال وقال أبي ‏\"‏ ثم توضئي لكل صلاة، حتى يجيء ذلك الوقت ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     Fatima bint Abi Hubaish came to the Prophet and said, \"O Allah's Apostle I get persistent bleeding from the uterus and do not become clean. Shall I give up my prayers?\" Allah's Apostle replied, \"No, because it is from a blood vessel and not the menses. So when your real menses begins give up your prayers and when it has finished wash off the blood (take a bath) and offer your prayers.\" Hisham (the sub narrator) narrated that his father had also said, (the Prophet told her): \"Perform ablution for every prayer till the time of the next period comes.\"",
      "chain": [
        "30213",
        "20354",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "229",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا عبدان، قال أخبرنا عبد الله، قال أخبرنا عمرو بن ميمون الجزري، عن سليمان بن يسار، عن عائشة، قالت كنت أغسل الجنابة من ثوب النبي صلى الله عليه وسلم، فيخرج إلى الصلاة، وإن بقع الماء في ثوبه‏.‏",
      "text_en": " Narrated `Aisha:                     I used to wash the traces of Janaba (semen) from the clothes of the Prophet and he used to go for prayers while traces of water were still on it (water spots were still visible).",
      "chain": [
        "30349",
        "20025",
        "11439",
        "11005",
        "53"
      ]
    },
    {
      "hadith_no": "230",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا قتيبة، قال حدثنا يزيد، قال حدثنا عمرو، عن سليمان، قال سمعت عائشة، ح وحدثنا مسدد، قال حدثنا عبد الواحد، قال حدثنا عمرو بن ميمون، عن سليمان بن يسار، قال سألت عائشة عن المني، يصيب الثوب فقالت كنت أغسله من ثوب رسول الله صلى الله عليه وسلم، فيخرج إلى الصلاة وأثر الغسل في ثوبه بقع الماء‏.‏",
      "text_en": " Narrated `Aisha:                     as above (229).",
      "chain": [
        "30367",
        "20304",
        "11439",
        "11005",
        "53",
        "30175",
        "20256",
        "11439",
        "11005",
        "53"
      ]
    },
    {
      "hadith_no": "232",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا عمرو بن خالد، قال حدثنا زهير، قال حدثنا عمرو بن ميمون بن مهران، عن سليمان بن يسار، عن عائشة، أنها كانت تغسل المني من ثوب النبي صلى الله عليه وسلم، ثم أراه فيه بقعة أو بقعا‏.‏",
      "text_en": " Narrated `Amr bin Maimun:                     I heard Sulaiman bin Yasar talking about the clothes soiled with semen. He said that `Aisha had said, \"I used to wash it off the clothes of Allah's Apostle and he would go for the prayers while water spots were still visible on them.",
      "chain": [
        "30237",
        "20321",
        "11439",
        "11005",
        "53"
      ]
    },
    {
      "hadith_no": "242",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا علي بن عبد الله، قال حدثنا سفيان، قال حدثنا الزهري، عن أبي سلمة، عن عائشة، عن النبي صلى الله عليه وسلم قال ‏\"‏ كل شراب أسكر فهو حرام ‏\"‏‏.‏",
      "text_en": " Narrated Aisha:                     The Prophet said, \"All drinks that produce intoxication are Haram (forbidden to drink).",
      "chain": [
        "30026",
        "20005",
        "11013",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "248",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن هشام، عن أبيه، عن عائشة، زوج النبي صلى الله عليه وسلم أن النبي صلى الله عليه وسلم كان إذا اغتسل من الجنابة بدأ فغسل يديه، ثم يتوضأ كما يتوضأ للصلاة، ثم يدخل أصابعه في الماء، فيخلل بها أصول شعره ثم يصب على رأسه ثلاث غرف بيديه، ثم يفيض الماء على جلده كله‏.‏",
      "text_en": " Narrated `Aisha:                     Whenever the Prophet took a bath after Janaba he started by washing his hands and then performed ablution like that for the prayer. After that he would put his fingers in water and move the roots of his hair with them, and then pour three handfuls of water over his head and then pour water all over his body.",
      "chain": [
        "30355",
        "20001",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "250",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا آدم بن أبي إياس، قال حدثنا ابن أبي ذئب، عن الزهري، عن عروة، عن عائشة، قالت كنت أغتسل أنا والنبي، صلى الله عليه وسلم من إناء واحد من قدح يقال له الفرق‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet and I used to take a bath from a single pot called 'Faraq'.",
      "chain": [
        "20404",
        "20177",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "251",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الله بن محمد، قال حدثني عبد الصمد، قال حدثني شعبة، قال حدثني أبو بكر بن حفص، قال سمعت أبا سلمة، يقول دخلت أنا وأخو، عائشة على عائشة فسألها أخوها عن غسل النبي، صلى الله عليه وسلم فدعت بإناء نحوا من صاع، فاغتسلت وأفاضت على رأسها، وبيننا وبينها حجاب‏.‏ قال أبو عبد الله قال يزيد بن هارون وبهز والجدي عن شعبة قدر صاع‏.‏",
      "text_en": " Narrated Abu Salama:                     `Aisha's brother and I went to `Aisha and he asked her about the bath of the Prophet. She brought a pot containing about a Sa` of water and took a bath and poured it over her head and at what time there was a screen between her and us.",
      "chain": [
        "30351",
        "20250",
        "20020",
        "11180",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "258",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن المثنى، قال حدثنا أبو عاصم، عن حنظلة، عن القاسم، عن عائشة، قالت كان النبي صلى الله عليه وسلم إذا اغتسل من الجنابة دعا بشىء نحو الحلاب، فأخذ بكفه، فبدأ بشق رأسه الأيمن ثم الأيسر، فقال بهما على رأسه‏.‏",
      "text_en": " Narrated `Aisha:                     Whenever the Prophet took the bath of Janaba (sexual relation or wet dream) he asked for the Hilab or some other scent. He used to take it in his hand, rub it first over the right side of his head and then over the left and then rub the middle of his head with both hands.",
      "chain": [
        "30170",
        "20241",
        "11243",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "261",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الله بن مسلمة، أخبرنا أفلح، عن القاسم، عن عائشة، قالت كنت أغتسل أنا والنبي، صلى الله عليه وسلم من إناء واحد تختلف أيدينا فيه‏.‏",
      "text_en": " Narrated Aisha:                     The Prophet and I used to take a bath from a single pot of water and our hands used to go in the pot after each other in turn.",
      "chain": [
        "20164",
        "20156",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "262",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا مسدد، قال حدثنا حماد، عن هشام، عن أبيه، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم إذا اغتسل من الجنابة غسل يده‏.‏",
      "text_en": " Narrated `Aisha:                     Whenever Allah's Apostle took a bath of Janaba, he washed his hands first.",
      "chain": [
        "30175",
        "20022",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "263",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو الوليد، قال حدثنا شعبة، عن أبي بكر بن حفص، عن عروة، عن عائشة، قالت كنت أغتسل أنا والنبي، صلى الله عليه وسلم من إناء واحد من جنابة‏.‏ وعن عبد الرحمن بن القاسم عن أبيه عن عائشة مثله‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet and I used to take a bath from a single pot of water after Janaba.",
      "chain": [
        "20296",
        "20020",
        "11180",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "270",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو النعمان، قال حدثنا أبو عوانة، عن إبراهيم بن محمد بن المنتشر، عن أبيه، قال سألت عائشة فذكرت لها قول ابن عمر ما أحب أن أصبح، محرما أنضخ طيبا‏.‏ فقالت عائشة أنا طيبت رسول الله صلى الله عليه وسلم ثم طاف في نسائه ثم أصبح محرما‏.‏",
      "text_en": " Narrated Muhammad bin Al-Muntathir:                     on the authority of his father that he had asked `Aisha about the saying of Ibn `Umar (i.e. he did not like to be a Muhrim while the smell of scent was still coming from his body). `Aisha said, \"I scented Allah's Apostle and he went round (had sexual intercourse with) all his wives, and in the morning he was Muhrim (after taking a bath).",
      "chain": [
        "20283",
        "20469",
        "11321",
        "11388",
        "53"
      ]
    },
    {
      "hadith_no": "271",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا آدم، قال حدثنا شعبة، قال حدثنا الحكم، عن إبراهيم، عن الأسود، عن عائشة، قالت كأني أنظر إلى وبيص الطيب في مفرق النبي صلى الله عليه وسلم وهو محرم‏.‏",
      "text_en": " Narrated `Aisha:                     It is as if I am just looking at the glitter of scent in the parting of the Prophet's head hair while he was a Muhrim.",
      "chain": [
        "20404",
        "20020",
        "11069",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "272",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا عبدان، قال أخبرنا عبد الله، قال أخبرنا هشام بن عروة، عن أبيه، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم إذا اغتسل من الجنابة غسل يديه، وتوضأ وضوءه للصلاة ثم اغتسل، ثم يخلل بيده شعره، حتى إذا ظن أن قد أروى بشرته، أفاض عليه الماء ثلاث مرات، ثم غسل سائر جسده‏.‏ وقالت كنت أغتسل أنا ورسول الله، صلى الله عليه وسلم من إناء واحد نغرف منه جميعا‏.‏",
      "text_en": " Narrated Hisham bin `Urwa:                     (on the authority of his father) `Aisha said, \"Whenever Allah's Apostle took the bath of Janaba, he cleaned his hands and performed ablution like that for prayer and then took a bath and rubbed his hair, till he felt that the whole skin of the head had become wet, then he would pour water thrice and wash the rest of the body.\" `Aisha further said, \"I and Allah's Apostle used to take a bath from a single water container, from which we took water simultaneously.\"",
      "chain": [
        "30349",
        "20025",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "277",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا خلاد بن يحيى، قال حدثنا إبراهيم بن نافع، عن الحسن بن مسلم، عن صفية بنت شيبة، عن عائشة، قالت كنا إذا أصابت إحدانا جنابة، أخذت بيديها ثلاثا فوق رأسها، ثم تأخذ بيدها على شقها الأيمن، وبيدها الأخرى على شقها الأيسر‏.‏",
      "text_en": " Narrated Aisha:                     Whenever any one of us was Junub, she poured water over her head thrice with both her hands and then rubbed the right side of her head with one hand and rubbed the left side of the head with the other hand.",
      "chain": [
        "20191",
        "20189",
        "11557",
        "2802",
        "53"
      ]
    },
    {
      "hadith_no": "288",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا يحيى بن بكير، قال حدثنا الليث، عن عبيد الله بن أبي جعفر، عن محمد بن عبد الرحمن، عن عروة، عن عائشة، قالت كان النبي صلى الله عليه وسلم إذا أراد أن ينام وهو جنب، غسل فرجه، وتوضأ للصلاة‏.‏",
      "text_en": " Narrated `Aisha:                     Whenever the Prophet intended to sleep while he was Junub, he used to wash his private parts and perform ablution like that for the prayer.",
      "chain": [
        "30399",
        "20023",
        "11409",
        "11105",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "295",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا عبد الله بن يوسف، قال حدثنا مالك، عن هشام بن عروة، عن أبيه، عن عائشة، قالت كنت أرجل رأس رسول الله صلى الله عليه وسلم وأنا حائض‏.‏",
      "text_en": " Narrated `Aisha:                     While in menses, I used to comb the hair of Allah's Apostle .",
      "chain": [
        "30355",
        "20001",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "296",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا إبراهيم بن موسى، قال أخبرنا هشام بن يوسف، أن ابن جريج، أخبرهم قال أخبرني هشام، عن عروة، أنه سئل أتخدمني الحائض أو تدنو مني المرأة وهى جنب فقال عروة كل ذلك على هين، وكل ذلك تخدمني، وليس على أحد في ذلك بأس، أخبرتني عائشة أنها كانت ترجل  تعني  رأس رسول الله صلى الله عليه وسلم وهي حائض، ورسول الله صلى الله عليه وسلم حينئذ مجاور في المسجد، يدني لها رأسه وهى في حجرتها، فترجله وهى حائض‏.‏",
      "text_en": " Narrated `Urwa:                     A person asked me, \"Can a woman in menses serve me? And can a Junub woman come close to me?\" I replied, \"All this is easy for me. All of them can serve me, and there is no harm for any other person to do the same. `Aisha told me that she used to comb the hair of Allah's Apostle while she was in her menses, and he was in I`tikaf (in the mosque). He would bring his head near her in her room and she would comb his hair, while she used to be in her menses.\"",
      "chain": [
        "30309",
        "20467",
        "11070",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "297",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو نعيم الفضل بن دكين، سمع زهيرا، عن منصور ابن صفية، أن أمه، حدثته أن عائشة حدثتها أن النبي صلى الله عليه وسلم كان يتكئ في حجري وأنا حائض، ثم يقرأ القرآن‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet used to lean on my lap and recite Qur'an while I was in menses.",
      "chain": [
        "20348",
        "20321",
        "11565",
        "2802",
        "53"
      ]
    },
    {
      "hadith_no": "301",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا قبيصة، قال حدثنا سفيان، عن منصور، عن إبراهيم، عن الأسود، عن عائشة، قالت كنت أغتسل أنا والنبي، صلى الله عليه وسلم من إناء واحد، كلانا جنب‏.‏   وكان يأمرني فأتزر، فيباشرني وأنا حائض‏.‏  وكان يخرج رأسه إلى وهو معتكف، فأغسله وأنا حائض‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet and I used to take a bath from a single pot while we were Junub. During the menses, he used to order me to put on an Izar (dress worn below the waist) and used to fondle me. While in I`tikaf, he used to bring his head near me and I would wash it while I used to be in my periods (menses).",
      "chain": [
        "20351",
        "20012",
        "11067",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "302",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا إسماعيل بن خليل، قال أخبرنا علي بن مسهر، قال أخبرنا أبو إسحاق  هو الشيباني  عن عبد الرحمن بن الأسود، عن أبيه، عن عائشة، قالت كانت إحدانا إذا كانت حائضا، فأراد رسول الله صلى الله عليه وسلم أن يباشرها، أمرها أن تتزر في فور حيضتها ثم يباشرها‏.‏ قالت وأيكم يملك إربه كما كان النبي صلى الله عليه وسلم يملك إربه‏.‏ تابعه خالد وجرير عن الشيباني‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Al-Aswad:                     (on the authority of his father) `Aisha said: \"Whenever Allah's Apostle wanted to fondle anyone of us during her periods (menses), he used to order her to put on an Izar and start fondling her.\" `Aisha added, \"None of you could control his sexual desires as the Prophet could.\"",
      "chain": [
        "30186",
        "20345",
        "11352",
        "11056",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "305",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو نعيم، قال حدثنا عبد العزيز بن أبي سلمة، عن عبد الرحمن بن القاسم، عن القاسم بن محمد، عن عائشة، قالت خرجنا مع النبي صلى الله عليه وسلم لا نذكر إلا الحج، فلما جئنا سرف طمثت، فدخل على النبي صلى الله عليه وسلم وأنا أبكي فقال ‏{‏ما يبكيك‏}‏‏.‏ قلت لوددت والله أني لم أحج العام‏.‏ قال ‏{‏لعلك نفست‏}‏‏.‏ قلت نعم‏.‏ قال ‏\"‏ فإن ذلك شىء كتبه الله على بنات آدم، فافعلي ما يفعل الحاج، غير أن لا تطوفي بالبيت حتى تطهري ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     We set out with the Prophet for Hajj and when we reached Sarif I got my menses. When the Prophet came to me, I was weeping. He asked, \"Why are you weeping?\" I said, \"I wish if I had not performed Hajj this year.\" He asked, \"May be that you got your menses?\" I replied, \"Yes.\" He then said, \"This is the thing which Allah has ordained for all the daughters of Adam. So do what all the pilgrims do except that you do not perform the Tawaf round the Ka`ba till you are clean.\"",
      "chain": [
        "20348",
        "32017",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "306",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن هشام بن عروة، عن أبيه، عن عائشة، أنها قالت قالت فاطمة بنت أبي حبيش لرسول الله صلى الله عليه وسلم يا رسول الله إني لا أطهر، أفأدع الصلاة فقال رسول الله صلى الله عليه وسلم ‏\"‏ إنما ذلك عرق وليس بالحيضة، فإذا أقبلت الحيضة فاتركي الصلاة، فإذا ذهب قدرها فاغسلي عنك الدم وصلي ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     Fatima bint Abi Hubaish said to Allah's Apostle, \"O Allah's Apostle! I do not become clean (from bleeding). Shall I give up my prayers?\" Allah's Apostle replied: \"No, because it is from a blood vessel and not the menses. So when the real menses begins give up your prayers and when it (the period) has finished wash the blood off your body (take a bath) and offer your prayers.\"",
      "chain": [
        "30355",
        "20001",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "308",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا أصبغ، قال أخبرني ابن وهب، قال أخبرني عمرو بن الحارث، عن عبد الرحمن بن القاسم، حدثه عن أبيه، عن عائشة، قالت كانت إحدانا تحيض، ثم تقترص الدم من ثوبها عند طهرها فتغسله، وتنضح على سائره، ثم تصلي فيه‏.‏",
      "text_en": " Narrated `Aisha:                     Whenever anyone of us got her menses, she, on becoming clean, used to take hold of the blood spot and rub the blood off her garment, and pour water over it and wash that portion thoroughly and sprinkle water over the rest of the garment. After that she would pray in (with) it.",
      "chain": [
        "30228",
        "20029",
        "20377",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "309",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا إسحاق، قال حدثنا خالد بن عبد الله، عن خالد، عن عكرمة، عن عائشة، أن النبي صلى الله عليه وسلم اعتكف معه بعض نسائه وهى مستحاضة ترى الدم، فربما وضعت الطست تحتها من الدم‏.‏ وزعم أن عائشة رأت ماء العصفر فقالت كأن هذا شىء كانت فلانة تجده‏.‏",
      "text_en": " Narrated `Aisha:                     Once one of the wives of the Prophet did I`tikaf along with him and she was getting bleeding in between her periods. She used to see the blood (from her private parts) and she would perhaps put a dish under her for the blood. (The sub-narrator `Ikrima added, `Aisha once saw the liquid of safflower and said, \"It looks like what so and so used to have.\")",
      "chain": [
        "30312",
        "20423",
        "11282",
        "11023",
        "53"
      ]
    },
    {
      "hadith_no": "310",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا قتيبة، قال حدثنا يزيد بن زريع، عن خالد، عن عكرمة، عن عائشة، قالت اعتكفت مع رسول الله صلى الله عليه وسلم امرأة من أزواجه، فكانت ترى الدم والصفرة، والطست تحتها وهى تصلي‏.‏",
      "text_en": " Narrated `Aisha:                     \"One of the wives of Allah's Apostle joined him in I`tikaf and she noticed blood and yellowish discharge (from her private parts) and put a dish under her when she prayed.\"",
      "chain": [
        "30367",
        "20304",
        "11282",
        "11023",
        "53"
      ]
    },
    {
      "hadith_no": "311",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا مسدد، قال حدثنا معتمر، عن خالد، عن عكرمة، عن عائشة، أن بعض، أمهات المؤمنين اعتكفت وهى مستحاضة‏.‏",
      "text_en": " Narrated `Aisha:                     One of the mothers of the faithful believers (i.e. the wives of the Prophet ) did I`tikaf while she was having bleeding in between her periods.",
      "chain": [
        "30175",
        "20288",
        "11282",
        "11023",
        "53"
      ]
    },
    {
      "hadith_no": "314",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا يحيى، قال حدثنا ابن عيينة، عن منصور ابن صفية، عن أمه، عن عائشة، أن امرأة، سألت النبي صلى الله عليه وسلم عن غسلها من المحيض، فأمرها كيف تغتسل قال ‏\"‏ خذي فرصة من مسك فتطهري بها ‏\"‏‏.‏ قالت كيف أتطهر قال ‏\"‏ تطهري بها ‏\"‏‏.‏ قالت كيف قال ‏\"‏ سبحان الله تطهري ‏\"‏‏.‏ فاجتبذتها إلى فقلت تتبعي بها أثر الدم‏.‏",
      "text_en": " Narrated `Aisha:                     A woman asked the Prophet about the bath which is take after finishing from the menses. The Prophet told her what to do and said, \"Purify yourself with a piece of cloth scented with musk.\" The woman asked, \"How shall I purify myself with it\" He said, \"Subhan Allah! Purify yourself (with it).\" I pulled her to myself and said, \"Rub the place soiled with blood with it.\"",
      "chain": [
        "30020",
        "20005",
        "11565",
        "2802",
        "53"
      ]
    },
    {
      "hadith_no": "315",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا مسلم، قال حدثنا وهيب، حدثنا منصور، عن أمه، عن عائشة، أن امرأة، من الأنصار قالت للنبي صلى الله عليه وسلم كيف أغتسل من المحيض قال ‏\"‏ خذي فرصة ممسكة، فتوضئي ثلاثا ‏\"‏‏.‏ ثم إن النبي صلى الله عليه وسلم استحيا فأعرض بوجهه أو قال ‏\"‏ توضئي بها ‏\"‏ فأخذتها فجذبتها فأخبرتها بما يريد النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated `Aisha:                     An Ansari woman asked the Prophet how to take a bath after finishing from the menses. He replied, \"Take a piece a cloth perfumed with musk and clean the private parts with it thrice.\" The Prophet felt shy and turned his face. So pulled her to me and told her what the Prophet meant.",
      "chain": [
        "20285",
        "20299",
        "11067",
        "53"
      ]
    },
    {
      "hadith_no": "316",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا إبراهيم، حدثنا ابن شهاب، عن عروة، أن عائشة، قالت أهللت مع رسول الله صلى الله عليه وسلم في حجة الوداع، فكنت ممن تمتع، ولم يسق الهدى، فزعمت أنها حاضت، ولم تطهر حتى دخلت ليلة عرفة فقالت يا رسول الله، هذه ليلة عرفة، وإنما كنت تمتعت بعمرة‏.‏ فقال لها رسول الله صلى الله عليه وسلم ‏\"‏ انقضي رأسك، وامتشطي، وأمسكي عن عمرتك ‏\"‏‏.‏ ففعلت، فلما قضيت الحج أمر عبد الرحمن ليلة الحصبة فأعمرني من التنعيم مكان عمرتي التي نسكت‏.‏",
      "text_en": " Narrated `Aisha:                     In the last Hajj of Allah's Apostle I assume the Ihram for Hajj along with Allah Apostle. I was one of those who intended Tamattu` (to perform Hajj an `Umra) and did not take the Hadi (animal for sacrifice) with me. I got my menses and was not clean till the night of `Arafa I said, \"O Allah's Apostle! It is the night of the day of `Arafat and I intended to perform the Hajj Tamattu` with `Umra Allah's Apostle told me to undo my hair and comb it and to postpone the `Umra. I did the same and completed the Hajj. On the night of Al-Hasba (i.e. place outside Mecca where the pilgrims go after finishing all the ceremonies Hajj at Mina) he (the Prophet ordered `Abdur Rahman (`Aisha's brother) to take me to at-Tan`im to assume the lhram for `Umra in lieu of that of Hajj-at-Tamattu` which I had intended to perform.",
      "chain": [
        "20040",
        "20150",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "317",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا عبيد بن إسماعيل، قال حدثنا أبو أسامة، عن هشام، عن أبيه، عن عائشة، قالت خرجنا موافين لهلال ذي الحجة، فقال رسول الله صلى الله عليه وسلم ‏\"‏ من أحب أن يهل بعمرة فليهلل، فإني لولا أني أهديت لأهللت بعمرة ‏\"‏‏.‏ فأهل بعضهم بعمرة، وأهل بعضهم بحج، وكنت أنا ممن أهل بعمرة، فأدركني يوم عرفة وأنا حائض، فشكوت إلى النبي صلى الله عليه وسلم فقال ‏\"‏ دعي عمرتك، وانقضي رأسك وامتشطي، وأهلي بحج ‏\"‏‏.‏ ففعلت حتى إذا كان ليلة الحصبة أرسل معي أخي عبد الرحمن بن أبي بكر، فخرجت إلى التنعيم، فأهللت بعمرة مكان عمرتي‏.‏ قال هشام ولم يكن في شىء من ذلك هدى ولا صوم ولا صدقة‏.‏",
      "text_en": " Narrated `Aisha:                     On the 1st of Dhul-Hijja we set out with the intention of performing Hajj. Allah's Apostle said, \"Any one who likes to assume the Ihram for `Umra he can do so. Had I not brought the Hadi with me, I would have assumed the Ihram for `Umra. \"Some of us assumed the Ihram for `Umra while the others assumed the Ihram for Hajj. I was one of those who assumed the Ihram for `Umra. I got menses and kept on menstruating until the day of `Arafat and complained of that to the Prophet . He told me to postpone my `Umra, undo and comb my hair, and to assure the Ihram of Hajj and I did so. On the right of Hasba, he sent my brother `Abdur-Rahman bin Abi Bakr with me to at-Tan`im, where I assumed the Ihram for `Umra in lieu of the previous one. Hisham said, \"For that (`Umra) no Hadi, fasting or alms were required.",
      "chain": [
        "30360",
        "20318",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "319",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا يحيى بن بكير، قال حدثنا الليث، عن عقيل، عن ابن شهاب، عن عروة، عن عائشة، قالت خرجنا مع النبي صلى الله عليه وسلم في حجة الوداع، فمنا من أهل بعمرة، ومنا من أهل بحج، فقدمنا مكة فقال رسول الله صلى الله عليه وسلم ‏\"‏ من أحرم بعمرة ولم يهد فليحلل، ومن أحرم بعمرة وأهدى فلا يحل حتى يحل بنحر هديه، ومن أهل بحج فليتم حجه ‏\"‏‏.‏ قالت فحضت فلم أزل حائضا حتى كان يوم عرفة، ولم أهلل إلا بعمرة، فأمرني النبي صلى الله عليه وسلم أن أنقض رأسي وأمتشط، وأهل بحج، وأترك العمرة، ففعلت ذلك حتى قضيت حجي، فبعث معي عبد الرحمن بن أبي بكر، وأمرني أن أعتمر مكان عمرتي من التنعيم‏.‏",
      "text_en": " Narrated `Urwa:                     `Aisha said, \"We set out with the Prophet in his last Hajj. Some of us intended to perform `Umra while others Hajj. When we reached Mecca, Allah's Apostle said, 'Those who had assumed the lhram for `Umra and had not brought the Hadi should finish his lhram and whoever had assumed the Ihram for `Umra and brought the Hadi should not finish the Ihram till he has slaughtered his Hadi and whoever had assumed the lhram for Hajj should complete his Hajj.\" `Aisha further said, \"I got my periods (menses) and kept on menstruating till the day of `Arafat, and I had assumed the Ihram for `Umra only (Tamattu`). The Prophet ordered me to undo and comb my head hair and assume the lhram for Hajj only and leave the `Umra. I did the same till I completed the Hajj. Then the Prophet sent `Abdur Rahman bin Abi Bakr with me and ordered me to perform `Umra from at-Tan`im in lieu of the missed `Umra.\"",
      "chain": [
        "30399",
        "20023",
        "11207",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "320",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا عبد الله بن محمد، قال حدثنا سفيان، عن هشام، عن أبيه، عن عائشة، أن فاطمة بنت أبي حبيش، كانت تستحاض فسألت النبي صلى الله عليه وسلم فقال ‏\"‏ ذلك عرق، وليست بالحيضة، فإذا أقبلت الحيضة فدعي الصلاة، وإذا أدبرت فاغتسلي وصلي ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     Fatima bint Abi Hubaish used to have bleeding in between the periods, so she asked the Prophet about it . He replied, \"The bleeding is from a blood vessel and not the menses. So give up the prayers when the (real) menses begin and when it has finished, take a bath and start praying.\"",
      "chain": [
        "30351",
        "20005",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "331",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا أحمد بن يونس، عن زهير، قال حدثنا هشام، عن عروة، عن عائشة، قالت قال النبي صلى الله عليه وسلم ‏\"‏ إذا أقبلت الحيضة فدعي الصلاة، وإذا أدبرت فاغسلي عنك الدم وصلي ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet said to me, \"Give up the prayer when your menses begin and when it has finished, wash the blood off your body (take a bath) and start praying.\"",
      "chain": [
        "30184",
        "20321",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "336",
      "source": " Sahih Bukhari ",
      "chapter": "Rubbing hands and feet with dust (Tayammum) - كتاب التيمم",
      "chapter_no": "7",
      "text_ar": "حدثنا زكرياء بن يحيى، قال حدثنا عبد الله بن نمير، قال حدثنا هشام بن عروة، عن أبيه، عن عائشة، أنها استعارت من أسماء قلادة فهلكت، فبعث رسول الله صلى الله عليه وسلم رجلا، فوجدها فأدركتهم الصلاة وليس معهم ماء فصلوا، فشكوا ذلك إلى رسول الله صلى الله عليه وسلم فأنزل الله آية التيمم‏.‏ فقال أسيد بن حضير لعائشة جزاك الله خيرا، فوالله ما نزل بك أمر تكرهينه إلا جعل الله ذلك لك وللمسلمين فيه خيرا‏.‏",
      "text_en": " Narrated `Urwa's father:                     Aisha said, \"I borrowed a necklace from Asma' and it was lost. So Allah's Apostle sent a man to search for it and he found it. Then the time of the prayer became due and there was no water. They prayed (without ablution) and informed Allah's Apostle about it, so the verse of Tayammum was revealed.\" Usaid bin Hudair said to `Aisha, \"May Allah reward you. By Allah, whenever anything happened which you did not like, Allah brought good for you and for the Muslims in that.\" Al-Jurf and the time for the `Asr prayer became due while he was at Marbad-An-Na`am (sheepfold), so he (performed Tayammum) and prayed there and then entered Medina when the sun was still high but he did not repeat that prayer.",
      "chain": [
        "30193",
        "20331",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "350",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن صالح بن كيسان، عن عروة بن الزبير، عن عائشة أم المؤمنين، قالت ‏\"‏ فرض الله الصلاة حين فرضها ركعتين ركعتين في الحضر والسفر، فأقرت صلاة السفر، وزيد في صلاة الحضر ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     the mother of believers: Allah enjoined the prayer when He enjoined it, it was two rak`at only (in every prayer) both when in residence or on journey. Then the prayers offered on journey remained the same, but (the rak`at of) the prayers for non-travelers were increased.",
      "chain": [
        "30355",
        "20001",
        "11176",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "372",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا أبو اليمان، قال أخبرنا شعيب، عن الزهري، قال أخبرني عروة، أن عائشة، قالت لقد كان رسول الله صلى الله عليه وسلم يصلي الفجر، فيشهد معه نساء من المؤمنات متلفعات في مروطهن ثم يرجعن إلى بيوتهن ما يعرفهن أحد‏.‏",
      "text_en": " Narrated `Aisha:                     Allah's Apostle used to offer the Fajr prayer and some believing women covered with their veiling sheets used to attend the Fajr prayer with him and then they would return to their homes unrecognized .",
      "chain": [
        "30330",
        "20428",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "373",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا أحمد بن يونس، قال حدثنا إبراهيم بن سعد، قال حدثنا ابن شهاب، عن عروة، عن عائشة، أن النبي صلى الله عليه وسلم صلى في خميصة لها أعلام، فنظر إلى أعلامها نظرة، فلما انصرف قال ‏\"‏ اذهبوا بخميصتي هذه إلى أبي جهم وائتوني بأنبجانية أبي جهم، فإنها ألهتني آنفا عن صلاتي ‏\"‏‏.‏ وقال هشام بن عروة عن أبيه عن عائشة قال النبي صلى الله عليه وسلم ‏\"‏ كنت أنظر إلى علمها وأنا في الصلاة فأخاف أن تفتنني ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     the Prophet prayed in a Khamisa (a square garment) having marks. During the prayer, he looked at its marks. So when he finished the prayer he said, \"Take this Khamisa of mine to Abu Jahm and get me his Inbijaniya (a woolen garment without marks) as it (the Khamisa) has diverted my attention from the prayer.\"Narrated `Aisha:The Prophet said, 'I was looking at its (Khamisa's) marks during the prayers and I was afraid that it may put me in trial (by taking away my attention).",
      "chain": [
        "30184",
        "20150",
        "11013",
        "10511",
        "53"
      ]
    }
  ],
  "total_hadiths": 2731
}