{
  "id": "5300",
  "name": "Mua'wiya bin al-Hakam al-Slmy ( معاوية بن الحكم السلمي ( رضي الله عنه",
  "full_name": "Mua'wiya bin al-Hakam al-Slmy ( معاوية بن الحكم السلمي ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator [ م  د  س  -  صحابي ]"
    ],
    "tags": [
      "al-Salmi",
      "al-Medini"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "students": [
    {
      "id": "11020",
      "name": "'Ata ibn Yasar عطاء بن يسار أبو محمد مولى ميمونة",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "10567",
      "name": "Abu Salama bin 'Abdur Rahman أبو سلمة بن عبد الرحمن بن عوف",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1227",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو جعفر، محمد بن الصباح وأبو بكر بن أبي شيبة - وتقاربا في لفظ الحديث - قالا حدثنا إسماعيل بن إبراهيم، عن حجاج الصواف، عن يحيى بن أبي كثير، عن هلال بن أبي ميمونة، عن عطاء بن يسار، عن معاوية بن الحكم السلمي، قال بينا أنا أصلي، مع رسول الله صلى الله عليه وسلم إذ عطس رجل من القوم فقلت يرحمك الله ‏.‏ فرماني القوم بأبصارهم فقلت واثكل أمياه ما شأنكم تنظرون إلى ‏.‏ فجعلوا يضربون بأيديهم على أفخاذهم فلما رأيتهم يصمتونني لكني سكت فلما صلى رسول الله صلى الله عليه وسلم فبأبي هو وأمي ما رأيت معلما قبله ولا بعده أحسن تعليما منه فوالله ما كهرني ولا ضربني ولا شتمني قال ‏\"‏ إن هذه الصلاة لا يصلح فيها شىء من كلام الناس إنما هو التسبيح والتكبير وقراءة القرآن ‏\"‏ ‏.‏ أو كما قال رسول الله صلى الله عليه وسلم قلت يا رسول الله إني حديث عهد بجاهلية وقد جاء الله بالإسلام وإن منا رجالا يأتون الكهان ‏.‏ قال ‏\"‏ فلا تأتهم ‏\"‏ ‏.‏ قال ومنا رجال يتطيرون ‏.‏ قال ‏\"‏ ذاك شىء يجدونه في صدورهم فلا يصدنهم ‏\"‏ ‏.‏ قال ابن الصباح ‏\"‏ فلا يصدنكم ‏\"‏ ‏.‏ قال قلت ومنا رجال يخطون ‏.‏ قال ‏\"‏ كان نبي من الأنبياء يخط فمن وافق خطه فذاك ‏\"‏ ‏.‏ قال وكانت لي جارية ترعى غنما لي قبل أحد والجوانية فاطلعت ذات يوم فإذا الذيب قد ذهب بشاة من غنمها وأنا رجل من بني آدم آسف كما يأسفون لكني صككتها صكة فأتيت رسول الله صلى الله عليه وسلم فعظم ذلك على قلت يا رسول الله أفلا أعتقها قال ‏\"‏ ائتني بها ‏\"‏ ‏.‏ فأتيته بها فقال لها ‏\"‏ أين الله ‏\"‏ ‏.‏ قالت في السماء ‏.‏ قال ‏\"‏ من أنا ‏\"‏ ‏.‏ قالت أنت رسول الله ‏.‏ قال ‏\"‏ أعتقها فإنها مؤمنة ‏\"‏ ‏.‏",
      "text_en": " Mu'awiya b. al-Hakam said:                      While I was praying with the Messenger of Allah (may peace be upon him), a man in the company sneezed. I said: Allah have mercy on you! The people stared at me with disapproving looks, so I said: Woe be upon me, why is it that you stare at me? They began to strike their hands on their thighs, and when I saw them urging me to observe silence (I became angry) but I said nothing. When the Messenger of Allah (may peace be upon him) had said the prayer (and I declare that neither before him nor after him have I seen a leader who gave better instruction than he for whom I would give my father and mother as ransom). I swear that he did not scold, beat or revile me but said: Talking to persons is not fitting during the prayer, for it consists of glorifying Allah, declaring his Greatness. and recitation of the Qur'an or words to that effect. I said: Messenger of Allah. I was till recently a pagan, but Allah has brought Islam to us; among us there are men who have recourse to Kahins. He said, Do not have recourse to them. I said. There are men who take omens. That is something which they find in their breasts, but let it not turn their way (from freedom of action). I said: Among us there are men who draw lines. He said: There was a prophet who drew lines, so if they do it as they did, that is allowable. I had a maid-servant who tended goats by the side of Uhud and Jawwaniya. One day I happened to pass that way and found that a wolf had carried a goat from her flock. I am after all a man from the posterity of Adam. I felt sorry as they (human beings) feel sorry. So I slapped her. I came to the Messenger of Allah (may peace be upon him) and felt (this act of mine) as something grievous I said: Messenger of Allah, should I not grant her freedom? He (the Holy Prophet) said: Bring her to me. So I brought her to him. He said to her: Where is Allah? She said: He is in the heaven. He said: Who am I? She said: Thou art the Messenger of Allah. He said: Grant her freedom, she is a believing woman.",
      "chain": [
        "20208",
        "11449",
        "11229",
        "11020",
        "5300"
      ]
    },
    {
      "hadith_no": "5949",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثني أبو الطاهر، وحرملة بن يحيى، قالا أخبرنا ابن وهب، أخبرني يونس، عن ابن شهاب، عن أبي سلمة بن عبد الرحمن بن عوف، عن معاوية بن الحكم السلمي، قال قلت يا رسول الله أمورا كنا نصنعها في الجاهلية كنا نأتي الكهان ‏.‏ قال ‏\"‏ فلا تأتوا الكهان ‏\"‏ ‏.‏ قال قلت كنا نتطير ‏.‏ قال ‏\"‏ ذاك شىء يجده أحدكم في نفسه فلا يصدنكم ‏\"‏ ‏.‏",
      "text_en": " Mu'awiya b. al-Hakam as-Sulami reported:                      I said: Messenger of Allah, there were things we used to do in the pre-Islamic days. We used to visit Kahins, whereupon he said: Don't visit Kahins. I said: We used to take omens. He said: That is a sort of personal whim of yours, so let it not prevent you (from doing a thing).",
      "chain": [
        "30487",
        "20029",
        "20475",
        "11013",
        "10567",
        "5300"
      ]
    },
    {
      "hadith_no": "5951",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "وحدثنا محمد بن الصباح، وأبو بكر بن أبي شيبة قالا حدثنا إسماعيل، - وهو ابن علية - عن حجاج الصواف، ح وحدثنا إسحاق بن إبراهيم، أخبرنا عيسى بن يونس، حدثنا الأوزاعي، كلاهما عن يحيى بن أبي كثير، عن هلال بن أبي ميمونة، عن عطاء بن، يسار عن معاوية بن الحكم السلمي، عن النبي صلى الله عليه وسلم ‏.‏ بمعنى حديث الزهري عن أبي سلمة عن معاوية وزاد في حديث يحيى بن أبي كثير قال قلت ومنا رجال يخطون قال ‏\"‏ كان نبي من الأنبياء يخط فمن وافق خطه فذاك ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Mu'awiya b. Hakam as-Sulami through another chain of transmitters. The hadith transmitted on the authority of Yahya b. Abu Kathir (there is an addition of these words):                      I said: Among us there are men who draw lines and thus make divination. What about this? Thereupon he (the Holy Prophet) said: There was a Prophet who drew lines, so whose lines agree with his line for him it is allowable.",
      "chain": [
        "30269",
        "30201",
        "20208",
        "30123",
        "20347",
        "11449",
        "11229",
        "11020",
        "5300"
      ]
    },
    {
      "hadith_no": "930",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، ح وحدثنا عثمان بن أبي شيبة، حدثنا إسماعيل بن إبراهيم، - المعنى - عن حجاج الصواف، حدثني يحيى بن أبي كثير، عن هلال بن أبي ميمونة، عن عطاء بن يسار، عن معاوية بن الحكم السلمي، قال صليت مع رسول الله صلى الله عليه وسلم فعطس رجل من القوم فقلت يرحمك الله فرماني القوم بأبصارهم فقلت واثكل أمياه ما شأنكم تنظرون إلى فجعلوا يضربون بأيديهم على أفخاذهم فعرفت أنهم يصمتوني - فقال عثمان - فلما رأيتهم يسكتوني لكني سكت قال فلما صلى رسول الله صلى الله عليه وسلم - بأبي وأمي - ما ضربني ولا كهرني ولا سبني ثم قال ‏\"‏ إن هذه الصلاة لا يحل فيها شىء من كلام الناس هذا إنما هو التسبيح والتكبير وقراءة القرآن ‏\"‏ ‏.‏ أو كما قال رسول الله صلى الله عليه وسلم ‏.‏ قلت يا رسول الله إنا قوم حديث عهد بجاهلية وقد جاءنا الله بالإسلام ومنا رجال يأتون الكهان ‏.‏ قال ‏\"‏ فلا تأتهم ‏\"‏ ‏.‏ قال قلت ومنا رجال يتطيرون ‏.‏ قال ‏\"‏ ذاك شىء يجدونه في صدورهم فلا يصدهم ‏\"‏ ‏.‏ قلت ومنا رجال يخطون ‏.‏ قال ‏\"‏ كان نبي من الأنبياء يخط فمن وافق خطه فذاك ‏\"‏ ‏.‏ قال قلت جارية لي كانت ترعى غنيمات قبل أحد والجوانية إذ اطلعت عليها إطلاعة فإذا الذئب قد ذهب بشاة منها وأنا من بني آدم آسف كما يأسفون لكني صككتها صكة فعظم ذاك على رسول الله صلى الله عليه وسلم فقلت أفلا أعتقها قال ‏\"‏ ائتني بها ‏\"‏ ‏.‏ قال فجئته بها فقال ‏\"‏ أين الله ‏\"‏ ‏.‏ قالت في السماء ‏.‏ قال ‏\"‏ من أنا ‏\"‏ ‏.‏ قالت أنت رسول الله ‏.‏ قال ‏\"‏ أعتقها فإنها مؤمنة ‏\"‏ ‏.‏",
      "text_en": " Mu’awiyah b. al-Hakam al-Sulami said:                      I was praying with the Messenger of Allah(ﷺ). A man in the company sneezed, and I said: May Allah have mercy on you! The people gave me disapproving looks, so I said: Woe is to me! What do you mean by looking at me? They began to strike their hand on their thighs; then I realised that they were urging me to be silent. When the Messenger of Allah (ﷺ) finished his prayer – for whom I would give my father and mother as ransom-he did not beat, scold or revile me, but said: No talk to people in lawful in this prayer, for it consists only in glorifying Allah, declaring His greatness, and reciting the Qur'an or words to that effect said by the Messenger of Allah (ﷺ). I said: Messenger of Allah, we were only recently pagans, but Allah has brought Islam to us, and among us there are men who have recourse to soothsayers (kahins). He replied: Do not have recourse to them. I said: Among us are there are men who take omens. He replied: That is something which they find, but let it not turn them away (from what they intended to do). I said: among us there are men who draw lines. He replied: There was a prophet who drew lines; so if the line of anyone tallies with this line, that might come true. I said: A slave-girl of mine used to tend goats before (the mountain) Uhud and al-Jawaniyyah. Once when I reached her (suddenly) I found that a wolf had taken away a goat of them. I am a human being; I feel grieved as others do. But I gave her a good knocking. This was unbearable for the Messenger of Allah (ﷺ). I asked: Should I set her free ? He replied: Bring her to me. So I brought her to him. He asked (her): Where is Allah ? She said: In the heaven. He said: Who am I ? She replied: You are the Messenger of Allah. He said: Set her free, for she is believer.",
      "chain": [
        "30175",
        "20031",
        "30203",
        "20208",
        "11449",
        "11229",
        "11020",
        "5300"
      ]
    },
    {
      "hadith_no": "931",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن يونس النسائي، حدثنا عبد الملك بن عمرو، حدثنا فليح، عن هلال بن علي، عن عطاء بن يسار، عن معاوية بن الحكم السلمي، قال لما قدمت على رسول الله صلى الله عليه وسلم علمت أمورا من أمور الإسلام فكان فيما علمت أن قال لي ‏\"‏ إذا عطست فاحمد الله وإذا عطس العاطس فحمد الله فقل يرحمك الله ‏\"‏ ‏.‏ قال فبينما أنا قائم مع رسول الله صلى الله عليه وسلم في الصلاة إذ عطس رجل فحمد الله فقلت يرحمك الله رافعا بها صوتي فرماني الناس بأبصارهم حتى احتملني ذلك فقلت ما لكم تنظرون إلى بأعين شزر قال فسبحوا فلما قضى رسول الله صلى الله عليه وسلم الصلاة قال ‏\"‏ من المتكلم ‏\"‏ ‏.‏ قيل هذا الأعرابي فدعاني رسول الله صلى الله عليه وسلم فقال لي ‏\"‏ إنما الصلاة لقراءة القرآن وذكر الله جل وعز فإذا كنت فيها فليكن ذلك شأنك ‏\"‏ ‏.‏ فما رأيت معلما قط أرفق من رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Mu’awiyah b. al-Hakam al-Sulami said ; when I came to the Messenger of Allah (ﷺ) I learnt many things about islam. One of the things that I was taught was that it was that it was pointed out me. When you sneeze, praise Allah (I,e, say “praise be to Allah”); and when someone sneezes and praises Allah, say “ May Allah have mercy on you. Meanwhile I was standing along with the Messenger of Allah (may peace be upon  him) during prayer, all of a sudden a man sneezed, and he praised Allah. So I said, “may Allah have mercy on you”, in a loud voice. The people  gave me disapproving looks so much so that I took ill of it. So I said :                      what do you mean by looking at me with furtive glances. Then they glorified Allah. When the prophet (ﷺ) finished his prayer, he asked; who was the speaker? The Prophet told him; this Bedouin. The Messenger of Allah (ﷺ) called me and said to me: Prayer is meant for the recitation of the Quran, and making mention of Allah. When you are in it (prayer), this should be your work therein. I never saw an instructor more lenient than the Messenger of Allah (ﷺ)",
      "chain": [
        "38623",
        "20443",
        "20169",
        "11229",
        "11020",
        "5300"
      ]
    },
    {
      "hadith_no": "3282",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن الحجاج الصواف، حدثني يحيى بن أبي كثير، عن هلال بن أبي ميمونة، عن عطاء بن يسار، عن معاوية بن الحكم السلمي، قال قلت ‏:‏ يا رسول الله جارية لي صككتها صكة ‏.‏ فعظم ذلك على رسول الله صلى الله عليه وسلم فقلت أفلا أعتقها قال ‏:‏ ‏\"‏ ائتني بها ‏\"‏ ‏.‏ قال ‏:‏ فجئت بها قال ‏:‏ ‏\"‏ أين الله ‏\"‏ ‏.‏ قالت ‏:‏ في السماء ‏.‏ قال ‏:‏ ‏\"‏ من أنا ‏\"‏ ‏.‏ قالت ‏:‏ أنت رسول الله ‏.‏ قال ‏:‏ ‏\"‏ أعتقها فإنها مؤمنة ‏\"‏ ‏.‏",
      "text_en": " Narrated Mu'awiyah b. al-Hakam al-Sulami:                     I said: Messenger of Allah, I have a slave girl whom I slapped. This grieved the Messenger of Allah (ﷺ). I said to him: Should I not emancipate her? He said: Bring her to me. He said: Then I brought her. He asked: Where is Allah ? She replied: In the heaven. He said: Who am I ? She replied: You are the Messenger of Allah. He said: Emancipate her, she is a believer.",
      "chain": [
        "30175",
        "20031",
        "11449",
        "11229",
        "11020",
        "5300"
      ]
    },
    {
      "hadith_no": "3909",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divination and Omens (Kitab Al-Kahanah Wa Al-Tatayyur) - كتاب الكهانة و التطير",
      "chapter_no": "30",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن الحجاج الصواف، حدثني يحيى بن أبي كثير، عن هلال بن أبي ميمونة، عن عطاء بن يسار، عن معاوية بن الحكم السلمي، قال قلت يا رسول الله ومنا رجال يخطون ‏.‏ قال ‏\"‏ كان نبي من الأنبياء يخط فمن وافق خطه فذاك ‏\"‏ ‏.‏",
      "text_en": " Narrated Mu'awiyah b. al-Hakam al-Sulami:                     I said: Messenger of Allah! among us there are men who practice divination by drawing lines. He said: There was a Prophet who drew lines, so if anyone does it as he drew lines, that is right.",
      "chain": [
        "30175",
        "20031",
        "11449",
        "11229",
        "11020",
        "5300"
      ]
    },
    {
      "hadith_no": "1218",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا إسحاق بن منصور، قال حدثنا محمد بن يوسف، قال حدثنا الأوزاعي، قال حدثني يحيى بن أبي كثير، عن هلال بن أبي ميمونة، قال حدثني عطاء بن يسار، عن معاوية بن الحكم السلمي، قال قلت يا رسول الله إنا حديث عهد بجاهلية فجاء الله بالإسلام وإن رجالا منا يتطيرون ‏.‏ قال ‏\"‏ ذاك شىء يجدونه في صدورهم فلا يصدنهم ‏\"‏ ‏.‏ ورجال منا يأتون الكهان ‏.‏ قال ‏\"‏ فلا تأتوهم ‏\"‏ ‏.‏ قال يا رسول الله ورجال منا يخطون ‏.‏ قال ‏\"‏ كان نبي من الأنبياء يخط فمن وافق خطه فذاك ‏\"‏ ‏.‏ قال وبينا أنا مع رسول الله صلى الله عليه وسلم في الصلاة إذ عطس رجل من القوم فقلت يرحمك الله فحدقني القوم بأبصارهم فقلت واثكل أمياه ما لكم تنظرون إلى قال فضرب القوم بأيديهم على أفخاذهم فلما رأيتهم يسكتوني لكني سكت فلما انصرف رسول الله صلى الله عليه وسلم دعاني بأبي وأمي هو ما ضربني ولا كهرني ولا سبني ما رأيت معلما قبله ولا بعده أحسن تعليما منه قال ‏\"‏ إن صلاتنا هذه لا يصلح فيها شىء من كلام الناس إنما هو التسبيح والتكبير وتلاوة القرآن ‏\"‏ ‏.‏ قال ثم اطلعت إلى غنيمة لي ترعاها جارية لي في قبل أحد والجوانية وإني اطلعت فوجدت الذئب قد ذهب منها بشاة وأنا رجل من بني آدم آسف كما يأسفون فصككتها صكة ثم انصرفت إلى رسول الله صلى الله عليه وسلم فأخبرته فعظم ذلك على فقلت يا رسول الله أفلا أعتقها قال ‏\"‏ ادعها ‏\"‏ ‏.‏ فقال لها رسول الله صلى الله عليه وسلم ‏\"‏ أين الله عز وجل ‏\"‏ ‏.‏ قالت في السماء ‏.‏ قال ‏\"‏ فمن أنا ‏\"‏ ‏.‏ قالت أنت رسول الله صلى الله عليه وسلم ‏.‏ قال ‏\"‏ إنها مؤمنة فاعتقها ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Mu'awiyah bin Al-Hakam As-Sulami said:                     \"I said: 'O Messenger of Allah (ﷺ), we were recently in a state of ignorance, then Allah (SWT) brought Islam. Some men among us follow omens.' He said: 'That is something that they find in their own hearts; it should not deter them from going ahead.' I said: 'And some men among us go to fortune tellers.' He said: 'Do not go to them.' He said: 'Some men among us draw lines.' He said: 'One of the Prophets used to draw lines. So whoever is in accord with his drawing of lines, then so it is.'\" He said: \"While I was praying with the Messenger of Allah (ﷺ), a man sneezed and I said: 'Yarhamuk-Allah (May Allah have mercy on you).' The people glared at me and I said: 'May my mother be bereft of me, why are you looking at me?' The people struck their hands against their thighs, and when I saw that they were telling me to be quiet, I fell silent. When the Messenger of Allah (ﷺ) finished, he called me. May my father and mother be ransomed for him, he neither did hit me nor rebuke me nor revile me. I have never seen a better teacher than him, before or after. He said: 'This prayer of ours is not the place for ordinary human speech, rather it is glorification and magnification of Allah (SWT), and reciting Qur'an.' Then I went out to a flock of sheep of mine that was tended by a slave woman of mine beside Uhud and Al-Jawwaniyyah, and I found that the wolf had taken one of the sheep. I am a man from the sons of Adam and I get upset as they get upset. So I slapped her. Then I came to the Messenger of Allah (ﷺ) and told him what happened. He regarded that as a serious action on my part. I said: 'O Messenger of Allah (ﷺ), should I set her free?' He said: 'Call her.' The Messenger of Allah (ﷺ) said to her: 'Where is Allah (SWT), the Mighty and Sublime?' She said: 'Above the heavens.' He said: 'And who am I?' She said: 'The Messenger of Allah (ﷺ).' He said: 'She is a believer, set her free.'\"",
      "chain": [
        "30313",
        "30388",
        "20024",
        "11449",
        "11229",
        "11020",
        "5300"
      ]
    }
  ],
  "total_hadiths": 8
}