{
  "id": "5318",
  "name": "Niyar bin Mukarrurm ( نيار بن مكرم الأسلمي ( رضي الله عنه",
  "full_name": "Niyar bin Mukarrurm ( نيار بن مكرم الأسلمي ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator [ ت  -  صحابي ]"
    ],
    "tags": [
      "al-Aslami"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "3498",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمد بن إسماعيل، حدثنا إسماعيل بن أبي أويس، حدثني ابن أبي الزناد، عن أبي الزناد، عن عروة بن الزبير، عن نيار بن مكرم الأسلمي، قال لما نزلت ‏:‏ ‏(‏ الم * غلبت الروم * في أدنى الأرض وهم من بعد غلبهم سيغلبون * في بضع سنين ‏)‏ فكانت فارس يوم نزلت هذه الآية قاهرين للروم وكان المسلمون يحبون ظهور الروم عليهم لأنهم وإياهم أهل كتاب وفي ذلك قول الله تعالى ‏:‏ ‏(‏يومئذ يفرح المؤمنون * بنصر الله ينصر من يشاء وهو العزيز الرحيم ‏)‏ فكانت قريش تحب ظهور فارس لأنهم وإياهم ليسوا بأهل كتاب ولا إيمان ببعث فلما أنزل الله تعالى هذه الآية خرج أبو بكر الصديق رضى الله عنه يصيح في نواحي مكة ‏:‏ ‏(‏ الم * غلبت الروم * في أدنى الأرض وهم من بعد غلبهم سيغلبون * في بضع سنين ‏)‏ قال ناس من قريش لأبي بكر فذلك بيننا وبينكم زعم صاحبكم أن الروم ستغلب فارسا في بضع سنين أفلا نراهنك على ذلك قال بلى ‏.‏ وذلك قبل تحريم الرهان فارتهن أبو بكر والمشركون وتواضعوا الرهان وقالوا لأبي بكر كم تجعل البضع ثلاث سنين إلى تسع سنين فسم بيننا وبينك وسطا تنتهي إليه ‏.‏ قال فسموا بينهم ست سنين قال فمضت الست سنين قبل أن يظهروا فأخذ المشركون رهن أبي بكر فلما دخلت السنة السابعة ظهرت الروم على فارس فعاب المسلمون على أبي بكر تسمية ست سنين لأن الله تعالى قال ‏:‏ ‏(‏في بضع سنين ‏)‏ قال وأسلم عند ذلك ناس كثير ‏.‏ قال هذا حديث صحيح حسن غريب من حديث نيار بن مكرم لا نعرفه إلا من حديث عبد الرحمن بن أبي الزناد ‏.‏",
      "text_en": " Narrated Niyar bin Mukram Al-Aslami:                     \"When (the following) was revealed: 'Alif Lam Mim. The Romans have been defeated. In the nearest land, and they, after their defeat, will be victorious in Bid' years (30:1-4).' - on the day that these Ayat were revealed, the Persians had defeated the Romans, and the Muslims had wanted the Romans to be victorious over them, because they were the people of the Book. So Allah said about that: 'And on that day, the believers will rejoice - with the help of Allah. He helps whom He wills, and He is the Almighty, the Most Merciful (30:4 & 5). The Quraish wanted the Persians to be victorious since they were not people of the Book, nor did they believe in the Resurrection. So when Allah revealed these Ayat, Abu Bakr As-Siddiq, may Allah be pleased with him, went out, proclaiming throughout Makkah: 'Alif Lam Mim. The Romans have been defeated. In the nearest land, and they, after their defeat, will be victorious, in Bid' years (30:1-4).' Some of the Quraish said: 'Then this is (a bet) between us and you. Your companion claims that the Romans will defeat the Persians in Bid' years, so why have have a bet on that between us and you?' Abu Bakr said: 'Yes.' This was before betting has been forbidden. So Abu Bakr and the idolaters made a bet, and they said to Abu Bakr: 'What do you think - Bid' means something between three and nine years, so let us agree on the middle.' So they agreed on six years; Then six years passed without the Romans being victorious. The idolaters took what they won in the bet from Abu Bakr. When the seventh year came and the Romans were finally victorious over the Persians, the Muslims rebuked Abu Bakr for agreeing to six years. He said: 'Because Allah said: 'In Bid' years.' At that time, many people became Muslims.\"",
      "chain": [
        "34188",
        "30103",
        "20509",
        "11061",
        "10511",
        "5318"
      ]
    }
  ],
  "total_hadiths": 1
}