{
  "id": "5350",
  "name": "Abu S'ad bin Fdalh al-Ansari ( أبو سعد بن فضالة ( رضي الله عنه",
  "full_name": "Abu S'ad bin Fdalh al-Ansari ( أبو سعد بن فضالة ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator [ ت  ق  -  صحابي ]"
    ],
    "tags": []
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "3448",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمد بن بشار، وغير، واحد، قالوا حدثنا محمد بن بكر البرساني، عن عبد الحميد بن جعفر، أخبرني أبي، عن ابن ميناء، عن أبي سعد بن أبي فضالة الأنصاري، وكان، من الصحابة قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إذا جمع الله الناس ليوم القيامة ليوم لا ريب فيه نادى مناد من كان أشرك في عمل عمله لله أحدا فليطلب ثوابه من عند غير الله فإن الله أغنى الشركاء عن الشرك ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من حديث محمد بن بكر ‏.‏",
      "text_en": " Narrated 'Abdul-Hamid bin Ja'far:                     \"My father informed me, from Ibn Mina, from ABu Sa'eed bin Abi Fadalah Al-Ansari - and he was one of the Companions - who said: 'I heard the Messenger of Allah (ﷺ) said: \"When Allah gathers the people on the Day of Judgement - a Day in which there is no doubt in - a caller will call out: 'Whoever committed Shirk in any of his deeds he did for Allah - then let him seek his reward from other than Allah. For indeed Allah is the most free of the partners from any need of Shirk.\"",
      "chain": [
        "30160",
        "20277",
        "11875",
        "11833",
        "5350"
      ]
    }
  ],
  "total_hadiths": 1
}