{
  "id": "5355",
  "name": "Abu Sharih al-Khuza'i,al-Ka'bi ( أبو شريح الخزاعي خويلد بن عمرو ( رضي الله عنه",
  "full_name": "Abu Sharih al-Khuza'i,al-Ka'bi ( أبو شريح الخزاعي خويلد بن عمرو ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "68",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator [ ع  -  صحابي ]"
    ],
    "tags": [
      "al-Khuza'i",
      "al-ka'bi",
      "al-Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "16",
      "name": "ibn Mas'ud ( عبد الله بن مسعود ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11212",
      "name": "Kaysan Abu Sa'id al-Muqbari كيسان أبو سعيد المقبري المدني",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11168",
      "name": "Sa'id bin Abi Sa'id سعيد بن أبي سعيد كيسان المقبري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11059",
      "name": "Nafi' bin Jubayr bin Mut'im نافع بن جبير بن مطعم",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "13514",
      "name": "Sufyan bin Abi al-Wja'a سفيان بن أبي العوجاء",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "104",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا عبد الله بن يوسف، قال حدثني الليث، قال حدثني سعيد، عن أبي شريح، أنه قال لعمرو بن سعيد وهو يبعث البعوث إلى مكة ائذن لي أيها الأمير أحدثك قولا قام به النبي صلى الله عليه وسلم الغد من يوم الفتح، سمعته أذناى ووعاه قلبي، وأبصرته عيناى، حين تكلم به، حمد الله وأثنى عليه ثم قال ‏\"‏ إن مكة حرمها الله، ولم يحرمها الناس، فلا يحل لامرئ يؤمن بالله واليوم الآخر أن يسفك بها دما، ولا يعضد بها شجرة، فإن أحد ترخص لقتال رسول الله صلى الله عليه وسلم فيها فقولوا إن الله قد أذن لرسوله، ولم يأذن لكم‏.‏ وإنما أذن لي فيها ساعة من نهار، ثم عادت حرمتها اليوم كحرمتها بالأمس، وليبلغ الشاهد الغائب ‏\"‏‏.‏ فقيل لأبي شريح ما قال عمرو قال أنا أعلم منك يا أبا شريح، لا يعيذ عاصيا، ولا فارا بدم، ولا فارا بخربة‏.‏",
      "text_en": " Narrated Sa`id:                     Abu Shuraih said, \"When `Amr bin Sa`id was sending the troops to Mecca (to fight `Abdullah bin Az- Zubair) I said to him, 'O chief! Allow me to tell you what the Prophet said on the day following the conquests of Mecca. My ears heard and my heart comprehended, and I saw him with my own eyes, when he said it. He glorified and praised Allah and then said, \"Allah and not the people has made Mecca a sanctuary. So anybody who has belief in Allah and the Last Day (i.e. a Muslim) should neither shed blood in it nor cut down its trees. If anybody argues that fighting is allowed in Mecca as Allah's Apostle did fight (in Mecca), tell him that Allah gave permission to His Apostle, but He did not give it to you. The Prophet added: Allah allowed me only for a few hours on that day (of the conquest) and today (now) its sanctity is the same (valid) as it was before. So it is incumbent upon those who are present to convey it (this information) to those who are absent.\" Abu- Shuraih was asked, \"What did `Amr reply?\" He said `Amr said, \"O Abu Shuraih! I know better than you (in this respect). Mecca does not give protection to one who disobeys (Allah) or runs after committing murder, or theft (and takes refuge in Mecca).",
      "chain": [
        "30355",
        "20023",
        "11168",
        "5355"
      ]
    },
    {
      "hadith_no": "1863",
      "source": " Sahih Bukhari ",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا قتيبة، حدثنا الليث، عن سعيد بن أبي سعيد المقبري، عن أبي شريح العدوي، أنه قال لعمرو بن سعيد، وهو يبعث البعوث إلى مكة ائذن لي أيها الأمير أحدثك قولا قام به رسول الله صلى الله عليه وسلم للغد من يوم الفتح، فسمعته أذناى، ووعاه قلبي، وأبصرته عيناى حين تكلم به، إنه حمد الله، وأثنى عليه، ثم قال ‏\"‏ إن مكة حرمها الله ولم يحرمها الناس، فلا يحل لامرئ يؤمن بالله واليوم الآخر أن يسفك بها دما ولا يعضد بها شجرة، فإن أحد ترخص لقتال رسول الله صلى الله عليه وسلم فقولوا له إن الله أذن لرسوله صلى الله عليه وسلم ولم يأذن لكم، وإنما أذن لي ساعة من نهار، وقد عادت حرمتها اليوم كحرمتها بالأمس، وليبلغ الشاهد الغائب ‏\"‏‏.‏ فقيل لأبي شريح ما قال لك عمرو قال أنا أعلم بذلك منك يا أبا شريح، إن الحرم لا يعيذ عاصيا، ولا فارا بدم، ولا فارا بخربة‏.‏ خربة بلية‏.‏",
      "text_en": " Narrated Sa`id bin Abu Sa`id Al-Maqburi:                     Abu Shuraih, Al-`Adawi said that he had said to `Amr bin Sa`id when he was sending the troops to Mecca (to fight `Abdullah bin Az-Zubair), \"O Chief! Allow me to tell you what Allah's Apostle said on the day following the Conquest of Mecca. My ears heard that and my heart understood it thoroughly and I saw with my own eyes the Prophet when he, after Glorifying and Praising Allah, started saying, 'Allah, not the people, made Mecca a sanctuary, so anybody who has belief in Allah and the Last Day should neither shed blood in it, nor should he cut down its trees. If anybody tells (argues) that fighting in it is permissible on the basis that Allah's Apostle did fight in Mecca, say to him, 'Allah allowed His Apostle and did not allow you.' \"Allah allowed me only for a few hours on that day (of the conquest) and today its sanctity is valid as it was before. So, those who are present should inform those who are absent (concerning this fact.\" Abu Shuraih was asked, \"What did `Amr reply?\" He said, (`Amr said) 'O Abu Shuraih! I know better than you in this respect Mecca does not give protection to a sinner, a murderer or a thief.\"",
      "chain": [
        "30367",
        "20023",
        "11168",
        "5355"
      ]
    },
    {
      "hadith_no": "4340",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا سعيد بن شرحبيل، حدثنا الليث، عن المقبري، عن أبي شريح العدوي، أنه قال لعمرو بن سعيد وهو يبعث البعوث إلى مكة ائذن لي أيها الأمير أحدثك قولا قام به رسول الله صلى الله عليه وسلم الغد يوم الفتح، سمعته أذناى ووعاه قلبي، وأبصرته عيناى، حين تكلم به حمد الله وأثنى عليه ثم قال ‏\"‏ إن مكة حرمها الله ولم يحرمها الناس، لا يحل لامرئ يؤمن بالله واليوم الآخر أن يسفك بها دما، ولا يعضد بها شجرا، فإن أحد ترخص لقتال رسول الله صلى الله عليه وسلم فيها فقولوا له إن الله أذن لرسوله، ولم يأذن لكم‏.‏ وإنما أذن لي فيها ساعة من نهار، وقد عادت حرمتها اليوم كحرمتها بالأمس، وليبلغ الشاهد الغائب ‏\"‏‏.‏ فقيل لأبي شريح ماذا قال لك عمرو قال قال أنا أعلم بذلك منك يا أبا شريح، إن الحرم لا يعيذ عاصيا، ولا فارا بدم، ولا فارا بخربة‏.‏",
      "text_en": " Narrated Abu Shuraih:                     Al-Adawi that he said to `Amr bin Sa`id while the latter was sending troops in batches to Mecca, \"O chief! Allow me to tell you a statement which Allah's Apostle said on the second day of the Conquest of Mecca. My two ears heard it and my heart remembered it and my two eyes saw him when he said it. He (i.e. the Prophet) praised Allah and then said, 'Mecca has been made a sanctuary by Allah and not by the people, so it is not lawful for a person, who believes in Allah and the Last Day to shed blood in it, or to cut its trees and if someone asks the permission to fight in Mecca because Allah's Apostle was allowed to fight in it, say to him; Allah permitted His Apostle and did not allow you, and even he (i.e. the Apostle) was allowed for a short period of the day, and today its (Mecca's sanctity has become the same as it was before (of old) so those who are present should inform those who are absent (this Hadith).\" Then Abu Shuraih, was asked, \"What did `Amr say to you? Abu Shuraih said, \"He said, \"I knew that better than you, O Abu Shuraih! The Haram (i.e. Mecca) does not give refuge to a sinner or a fleeing murderer or a person running away after causing destruction.\"",
      "chain": [
        "30194",
        "20023",
        "11168",
        "5355"
      ]
    },
    {
      "hadith_no": "6084",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا عاصم بن علي، حدثنا ابن أبي ذئب، عن سعيد، عن أبي شريح، أن النبي صلى الله عليه وسلم قال ‏\"‏ والله لا يؤمن، والله لا يؤمن، والله لا يؤمن ‏\"‏‏.‏ قيل ومن يا رسول الله قال ‏\"‏ الذي لا يأمن جاره بوايقه ‏\"‏‏.‏ تابعه شبابة وأسد بن موسى‏.‏",
      "text_en": " Narrated Abu Shuraih:                     The Prophet said, \"By Allah, he does not believe! By Allah, he does not believe! By Allah, he does not believe!\" It was said, \"Who is that, O Allah's Apostle?\" He said, \"That person whose neighbor does not feel safe from his evil.\"",
      "chain": [
        "20430",
        "20177",
        "11168",
        "5355"
      ]
    },
    {
      "hadith_no": "6088",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا عبد الله بن يوسف، حدثنا الليث، قال حدثني سعيد المقبري، عن أبي شريح العدوي، قال سمعت أذناى، وأبصرت، عيناى حين تكلم النبي صلى الله عليه وسلم فقال ‏\"‏ من كان يؤمن بالله واليوم الآخر فليكرم جاره، ومن كان يؤمن بالله واليوم الآخر فليكرم ضيفه جائزته ‏\"‏‏.‏ قال وما جائزته يا رسول الله قال ‏\"‏ يوم وليلة والضيافة ثلاثة أيام، فما كان وراء ذلك فهو صدقة عليه، ومن كان يؤمن بالله واليوم الآخر فليقل خيرا أو ليصمت ‏\"‏‏.‏",
      "text_en": " Narrated Abu Shuraih Al-Adawi:                     My ears heard and my eyes saw the Prophet when he spoke, \"Anybody who believes in Allah and the Last Day, should serve his neighbor generously, and anybody who believes in Allah and the Last Day should serve his guest generously by giving him his reward.\" It was asked. \"What is his reward, O Allah's Apostle?\" He said, \"(To be entertained generously) for a day and a night with high quality of food and the guest has the right to be entertained for three days (with ordinary food) and if he stays longer, what he will be provided with will be regarded as Sadaqa (a charitable gift). And anybody who believes in Allah and the Last Day should talk what is good or keep quite (i.e. abstain from all kinds of dirty and evil talks).",
      "chain": [
        "30355",
        "20023",
        "11168",
        "5355"
      ]
    },
    {
      "hadith_no": "6554",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا أبو الوليد، حدثنا ليث، حدثنا سعيد المقبري، عن أبي شريح الخزاعي، قال سمع أذناى، ووعاه، قلبي النبي صلى الله عليه وسلم يقول ‏\"‏ الضيافة ثلاثة أيام جائزته ‏\"‏‏.‏ قيل ما جائزته قال ‏\"‏ يوم وليلة، ومن كان يؤمن بالله واليوم الآخر فليكرم ضيفه، ومن كان يؤمن بالله واليوم الآخر فليقل خيرا، أو ليسكت ‏\"‏‏.‏",
      "text_en": " Narrated Abu Shuraih Al-Khuza`i:                     My ears heard and my heart grasped (the statement which) the Prophet said, \"The period for keeping one's guest is three days (and don't forget) his reward.\" It was asked, \"What is his reward?\" He said, \"In the first night and the day he should be given a high class quality of meals; and whoever believes in Allah and the Last Day, should entertain his guest generously; and whoever believes in Allah and the Last Day should talk what is good (sense) or keep quiet.\"",
      "chain": [
        "20296",
        "20023",
        "11168",
        "5355"
      ]
    },
    {
      "hadith_no": "16",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "وحدثني حرملة بن يحيى بن عبد الله بن حرملة بن عمران التجيبي، قال حدثنا ابن وهب، قال حدثني أبو شريح، أنه سمع شراحيل بن يزيد، يقول أخبرني مسلم بن يسار، أنه سمع أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ يكون في آخر الزمان دجالون كذابون يأتونكم من الأحاديث بما لم تسمعوا أنتم ولا آباؤكم فإياكم وإياهم لا يضلونكم ولا يفتنونكم ‏\"‏ ‏.‏",
      "text_en": "",
      "chain": [
        "30487",
        "20029",
        "5355",
        "10861",
        "13118",
        "13"
      ]
    },
    {
      "hadith_no": "185",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا زهير بن حرب، ومحمد بن عبد الله بن نمير، جميعا عن ابن عيينة، - قال ابن نمير حدثنا سفيان، - عن عمرو، أنه سمع نافع بن جبير، يخبر عن أبي شريح الخزاعي، أن النبي صلى الله عليه وسلم قال ‏\"‏ من كان يؤمن بالله واليوم الآخر فليحسن إلى جاره ومن كان يؤمن بالله واليوم الآخر فليكرم ضيفه ومن كان يؤمن بالله واليوم الآخر فليقل خيرا أو ليسكت ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Shuraih al-Khuzai' that the Prophet (may peace and blessings of Allah be upon him) observed:                      He who believes in Allah and the Last Day should do good to his neighbour and he who believes in Allah and the Last Day should show hospitality to the guest and he who believes in Allah and the Last Day should either speak good or better remain silent.",
      "chain": [
        "30022",
        "20005",
        "30212",
        "20005",
        "11081",
        "11059",
        "5355"
      ]
    },
    {
      "hadith_no": "3370",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا ليث، عن سعيد بن أبي سعيد، عن أبي شريح العدوي، أنه قال لعمرو بن سعيد وهو يبعث البعوث إلى مكة ائذن لي أيها الأمير أحدثك قولا قام به رسول الله صلى الله عليه وسلم الغد من يوم الفتح سمعته أذناى ووعاه قلبي وأبصرته عيناى حين تكلم به أنه حمد الله وأثنى عليه ثم قال ‏\"‏ إن مكة حرمها الله ولم يحرمها الناس فلا يحل لامرئ يؤمن بالله واليوم الآخر أن يسفك بها دما ولا يعضد بها شجرة فإن أحد ترخص بقتال رسول الله صلى الله عليه وسلم فيها فقولوا له إن الله أذن لرسوله ولم يأذن لكم وإنما أذن لي فيها ساعة من نهار وقد عادت حرمتها اليوم كحرمتها بالأمس وليبلغ الشاهد الغائب ‏\"‏ ‏.‏ فقيل لأبي شريح ما قال لك عمرو قال أنا أعلم بذلك منك يا أبا شريح إن الحرم لا يعيذ عاصيا ولا فارا بدم ولا فارا بخربة ‏.‏",
      "text_en": " Abu Shuraih al-'Adawi reported that he said to Amr b. Sa'id when he was sending troops to Mecca:                      Let me tell you something. O Commander, which Allah's Messenger (may peace be upon him) said on the day following, the Conquest which my ears heard and my heart has retained, and my eyes saw as he spoke it. He praised Allah and extolled Him and then said: Allah, not men, has made Mecca sacred; so it is not permissible for any person believing in Allah and the Last Day to shed blood in it, or lop a tree in it. If anyone seeks a concession on the basis of fighting of Allah's Messenger (may peace be upon him), tell him that Allah permitted His Messenger, but not you, and He gave him permission only for an hour on one day, and its sacredness was restored on the very day like that of yesterday. Let him who is present convey the information to him who is absent. It was said to Abu Shuraih: What did Amr say to you? He said: I am better informed of that than you, Abu Shuraih, but the sacred territory does not grant protection to one who is disobedient, or one who runs away after shedding blood, or one who runs away after committing",
      "chain": [
        "30367",
        "20023",
        "11168",
        "5355"
      ]
    },
    {
      "hadith_no": "4610",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Luqatah - كتاب اللقطة",
      "chapter_no": "32",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا ليث، عن سعيد بن أبي سعيد، عن أبي شريح العدوي، أنه قال سمعت أذناى، وأبصرت، عيناى حين تكلم رسول الله صلى الله عليه وسلم فقال ‏\"‏ من كان يؤمن بالله واليوم الآخر فليكرم ضيفه جائزته ‏\"‏ ‏.‏ قالوا وما جائزته يا رسول الله قال ‏\"‏ يومه وليلته والضيافة ثلاثة أيام فما كان وراء ذلك فهو صدقة عليه - وقال - من كان يؤمن بالله واليوم الآخر فليقل خيرا أو ليصمت ‏\"‏ ‏.‏",
      "text_en": " Abd Shuraib al-Adawi reported:                      My eare listened and my eye saw when Allah's Messenger (may peace be upon him) spoke and said: He who believes In Allah and the eireafter should show respect to the guest even with utmost kindness and courtesy. They said: Messenger of Allah, what is this utmost kindness and courtesy? He replied: It is for a day and a night. Hospitality extends for three days, and what is beyond that is a Sadaqa for him; and he who believes in Allah and the Hereafter should say something good or keep quiet.",
      "chain": [
        "30367",
        "20023",
        "11168",
        "5355"
      ]
    },
    {
      "hadith_no": "4611",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Luqatah - كتاب اللقطة",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو كريب، محمد بن العلاء حدثنا وكيع، حدثنا عبد الحميد بن جعفر، عن سعيد بن أبي سعيد المقبري، عن أبي شريح الخزاعي، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الضيافة ثلاثة أيام وجائزته يوم وليلة ولا يحل لرجل مسلم أن يقيم عند أخيه حتى يؤثمه ‏\"‏ ‏.‏ قالوا يا رسول الله وكيف يؤثمه قال ‏\"‏ يقيم عنده ولا شىء له يقريه به ‏\"‏ ‏.‏",
      "text_en": " Abu Shuriah al-Khuza'i reported Allah's Messenger (may peace be upon him) as saying:                      (The period of the entertainment of a guest is three days, and utmost kindness and courtesy is for a day and a night. =\" It is not permissible for a Muslim to stay with, his brother until he makes him sinful. They said: Messenger of Allah, how he would make him sinful? He (the Holy Prophet) said: He stays with him (so long) that nothing is left with him to entertain him.",
      "chain": [
        "30216",
        "20032",
        "11875",
        "11168",
        "5355"
      ]
    },
    {
      "hadith_no": "4612",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Luqatah - كتاب اللقطة",
      "chapter_no": "32",
      "text_ar": "وحدثناه محمد بن المثنى، حدثنا أبو بكر، - يعني الحنفي - حدثنا عبد الحميد، بن جعفر حدثنا سعيد المقبري، أنه سمع أبا شريح الخزاعي، يقول سمعت أذناى، وبصر، عيني ووعاه قلبي حين تكلم به رسول الله صلى الله عليه وسلم ‏.‏ فذكر بمثل حديث الليث وذكر فيه ‏\"‏ ولا يحل لأحدكم أن يقيم عند أخيه حتى يؤثمه ‏\"‏ ‏.‏ بمثل ما في حديث وكيع ‏.‏",
      "text_en": " Sa'id al-Maqburi reported:                      I heard Abu Shuraih al-Khuzill saying: My ears heard and my eyes saw and my mind retained it, when Allah's Messenger (may peace be upon him) spok this, and he then narrated the hadith and made mention of this:\" It is not permissible for any one of you to stay with his brother until he makes him sinful.\"",
      "chain": [
        "30170",
        "20254",
        "11875",
        "11168",
        "5355"
      ]
    },
    {
      "hadith_no": "5039",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثني أبو الطاهر، وحرملة بن يحيى، - واللفظ لحرملة - قال أبو الطاهر أخبرنا  وقال، حرملة حدثنا عبد الله بن وهب، حدثني أبو شريح، أن سهل بن أبي أمامة بن سهل، بن حنيف حدثه عن أبيه، عن جده، أن النبي صلى الله عليه وسلم قال ‏\"‏ من سأل الله الشهادة بصدق بلغه الله منازل الشهداء وإن مات على فراشه ‏\"‏ ‏.‏ ولم يذكر أبو الطاهر في حديثه ‏\"‏ بصدق ‏\"‏ ‏.‏",
      "text_en": " It has been reported on the authority of Sahl b. Aba Umama b. Sahl b. Hunaif who learned the tradition from his father who (in turn) learned it from his grandfather-that the Messenger of Allah (may peace be upon him) said:                      Who sought martyrdom with sincerity will be ranked by Allah among the martyrs even if he died on his bed. In his version of the tradition Abd Tahir did not mention the words:\" with sincerity\".",
      "chain": [
        "30487",
        "30487",
        "20029",
        "5355",
        "11857",
        "405"
      ]
    },
    {
      "hadith_no": "6974",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Knowledge - كتاب العلم",
      "chapter_no": "48",
      "text_ar": "حدثنا حرملة بن يحيى التجيبي، أخبرنا عبد الله بن وهب، حدثني أبو شريح، أن أبا الأسود، حدثه عن عروة بن الزبير، قال قالت لي عائشة يا ابن أختي بلغني أنحمل عن النبي صلى الله عليه وسلم علما كثيرا - قال - فلقيته فساءلته عن أشياء يذكرها عن رسول الله صلى الله عليه وسلم ‏.‏ قال عروة فكان فيما ذكر أن النبي صلى الله عليه وسلم قال ‏\"‏ إن الله لا ينتزع العلم من الناس انتزاعا ولكن يقبض العلماء فيرفع العلم معهم ويبقي في الناس رءوسا جهالا يفتونهم بغير علم فيضلون ويضلون ‏\"‏ ‏.‏ قال عروة فلما حدثت عائشة بذلك أعظمت ذلك وأنكرته قالت أحدثك أنه سمع النبي صلى الله عليه وسلم يقول هذا قال عروة حتى إذا كان قابل قالت له إن ابن عمرو قد قدم فالقه ثم فاتحه حتى تسأله عن الحديث الذي ذكره لك في العلم - قال - فلقيته فساءلته فذكره لي نحو ما حدثني به في مرته الأولى ‏.‏ قال عروة فلما أخبرتها بذلك قالت ما أحسبه إلا قد صدق أراه لم يزد فيه شيئا ولم ينقص ‏.‏",
      "text_en": " 'Urwa b. Zubair reported that 'A'isha said to him:                      This news has reached me that 'Abdullah b. 'Amr al-'As would pass by us during the Hajj season, so you meet him and ask him (about religious matters) as he has acquired great knowledge from Allah's Messenger (may peace be upon him). I thus met him and asked him about things which he narrated from Allah's Messenger (may peace be upon him). And amongst these the one he mentioned was that Allah's Apostle (may peace be upon him) said: Verily, Allah does not take away knowledge from people directly but he takes away the scholars and consequently takes away (knowledge) along with them and leaves amongst persons the ignorant as their leaders who deliver religious verdicts without (adequate) knowledge and themselves go astray and lead others astray. 'Urwa said: When I narrated this to 'A'isha, she deemed it too much (to believe) and thus showed reluctance to accept that (as perfectly true) and said to, 'Urwa: Did he ('Abdullah b. 'Amr) say to you that he had heard Allah's Apostle (may peace be upon him) as saying: ('Urwa had forgotten to ask this from 'Abdullah b. 'Amr). So when it was the next year, she ('A'isha) said to him ('Urwa): Ibn Amr has come (for Hajj), so meet him. talk to him and ask him about this hadith that he narrated to You (last year on the occasion of the Hajj) pertaining to knowledge. He ('Urwa), said: So I met him, and asked about it and he narrated to me exactly like one that he had narrated (to me) for the first time. So when I informed her ('A'isha) about that, she said: I do not think but this that he has certainly told the truth and I find that be has neither made any addition to it, nor missed anything from it.",
      "chain": [
        "30487",
        "20029",
        "5355",
        "11114",
        "10511"
      ]
    },
    {
      "hadith_no": "7462",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثني حرملة بن يحيى التجيبي، حدثنا عبد الله بن وهب، حدثني أبو شريح، أن عبد الكريم بن الحارث، حدثه أن المستورد القرشي قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ تقوم الساعة والروم أكثر الناس ‏\"‏ ‏.‏ قال فبلغ ذلك عمرو بن العاص فقال ما هذه الأحاديث التي تذكر عنك أنك تقولها عن رسول الله صلى الله عليه وسلم فقال له المستورد قلت الذي سمعت من رسول الله صلى الله عليه وسلم قال فقال عمرو لئن قلت ذلك إنهم لأحلم الناس عند فتنة وأجبر الناس عند مصيبة وخير الناس لمساكينهم وضعفائهم ‏.‏",
      "text_en": " Mustaurid Qurashi reported:                      I heard Allah's Messenger (may peace be upon him) as saying: The Last Hour would come when the Romans would form a majority amongst people. This reached 'Amr b. al-'As and he said: What are these ahadith which are being transmitted from you and which you claim to have heard from Allah's Messenger (may peace be upon him)? Mustaurid said to him: I stated only that which I heard from Allah's Messenger (may peace be upon him). Thereupon 'Amr said: If you state this (it is true), for they have the power of tolerance amongst people at the time of turmoil and restore themselves to sanity after trouble, and are good amongst people so far as the destitute and the weak are concerned.",
      "chain": [
        "30487",
        "20029",
        "5355",
        "10869"
      ]
    },
    {
      "hadith_no": "4496",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، أخبرنا محمد بن إسحاق، عن الحارث بن فضيل، عن سفيان بن أبي العوجاء، عن أبي شريح الخزاعي، أن النبي صلى الله عليه وسلم قال ‏\"‏ من أصيب بقتل أو خبل فإنه يختار إحدى ثلاث إما أن يقتص وإما أن يعفو وإما أن يأخذ الدية فإن أراد الرابعة فخذوا على يديه ومن اعتدى بعد ذلك فله عذاب أليم ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuShurayh al-Khuza'i:                     The Prophet (ﷺ) said: If a relative of anyone is killed, or if he suffers khabl, which means a wound, he may choose one of the three things: he may retaliate, or forgive, or receive compensation. But if he wishes a fourth (i.e. something more), hold his hands. After this whoever exceeds the limits shall be in grave penalty.",
      "chain": [
        "20040",
        "20022",
        "11107",
        "11835",
        "13514",
        "5355"
      ]
    },
    {
      "hadith_no": "809",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا قتيبة، حدثنا الليث بن سعد، عن سعيد بن أبي سعيد المقبري، عن أبي شريح العدوي، أنه قال لعمرو بن سعيد وهو يبعث البعوث إلى مكة ائذن لي أيها الأمير أحدثك قولا قام به رسول الله صلى الله عليه وسلم الغد من يوم الفتح سمعته أذناى ووعاه قلبي وأبصرته عيناى حين تكلم به أنه حمد الله وأثنى عليه ثم قال ‏\"‏ إن مكة حرمها الله ولم يحرمها الناس ولا يحل لامرئ يؤمن بالله واليوم الآخر أن يسفك فيها دما أو يعضد بها شجرة فإن أحد ترخص بقتال رسول الله صلى الله عليه وسلم فيها فقولوا له إن الله أذن لرسوله صلى الله عليه وسلم ولم يأذن لك وإنما أذن لي فيه ساعة من النهار وقد عادت حرمتها اليوم كحرمتها بالأمس وليبلغ الشاهد الغائب ‏\"‏ ‏.‏ فقيل لأبي شريح ما قال لك عمرو بن سعيد قال أنا أعلم منك بذلك يا أبا شريح إن الحرم لا يعيذ عاصيا ولا فارا بدم ولا فارا بخربة ‏.‏ قال أبو عيسى ويروى ولا فارا بخزية ‏.‏ قال وفي الباب عن أبي هريرة وابن عباس ‏.‏ قال أبو عيسى حديث أبي شريح حديث حسن صحيح ‏.‏ وأبو شريح الخزاعي اسمه خويلد بن عمرو وهو العدوي وهو الكعبي ‏.‏ ومعنى قوله ‏\"‏ ولا فارا بخربة ‏\"‏ يعني الجناية يقول من جنى جناية أو أصاب دما ثم لجأ إلى الحرم فإنه يقام عليه الحد ‏.‏",
      "text_en": " Sa'eed bin Abi Sa'eed Al Maqbury narrated:                     \"Abu Shuraih Al-Adawi said tat when Amr bin Sa'eed was sending troops to Makkah he said to him: 'O Amr! Allow me to tell you what the Messenger of Allah said on the day following the Conquest of Makkah. My ears heard it, my heard understood it thoroughly, and with my own eyes, I saw the Prophet when he - after glorifying and praising Allah - said: \"Indeed Allah, the Most High, made Makkah a sanctuary, it was not made a sanctuary by the people. So it is not lawful for a man who believes in Allah and the Last Day to shed blood it, nor to cut down its trees. If anybody tries to use the Messenger of Allah to make an excuse for fighting in it, then say to him: 'Indeed Allah permitted His Messenger and He did not permit you.' Allah only allowed it for me for a few hours of one day, and today its sanctity has returned as it was before. So let the one who is present convey to the one who is absent.\" Abu Shuraih was asked: \"What was Amr bin Sa'eeds reply to you?\" He said: \"I am more knowledgeable about that than you Abu Shuraih! The Haram does not give protection to a disobedient person, nor a person fleeing for murder, nor fleeing for (Kharbah) lawlessness.\"",
      "chain": [
        "30367",
        "20023",
        "11168",
        "5355"
      ]
    },
    {
      "hadith_no": "2094",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا قتيبة، حدثنا الليث بن سعد، عن سعيد بن أبي سعيد المقبري، عن أبي شريح العدوي، أنه قال أبصرت عيناى رسول الله صلى الله عليه وسلم وسمعته أذناى حين تكلم به قال ‏\"‏ من كان يؤمن بالله واليوم الآخر فليكرم ضيفه جائزته ‏\"‏ ‏.‏ قالوا وما جائزته قال ‏\"‏ يوم وليلة والضيافة ثلاثة أيام وما كان بعد ذلك فهو صدقة ومن كان يؤمن بالله واليوم الآخر فليقل خيرا أو ليسكت ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Abu  Shuraih Al-'Adawf said:                     \"My eyes saw the Messenger of Allah, and my ears  heard him speaking when he was speaking and he said: 'Whoever believes in Allah and the Last Day, then let him honor his guest with his reward.' They said: 'What is the reward?' He said: ' A day and a night.' He said: 'And hospitality is for three days, whatever is beyond that is charity. And whoever believes in Allah and the Last Day, then let him say what is good or keep silent.\"",
      "chain": [
        "30367",
        "20023",
        "11168",
        "5355"
      ]
    },
    {
      "hadith_no": "2876",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا قتيبة، قال حدثنا الليث، عن سعيد بن أبي سعيد، عن أبي شريح، أنه قال لعمرو بن سعيد وهو يبعث البعوث إلى مكة ائذن لي أيها الأمير أحدثك قولا قام به رسول الله صلى الله عليه وسلم الغد من يوم الفتح سمعته أذناى ووعاه قلبي وأبصرته عيناى حين تكلم به حمد الله وأثنى عليه ثم قال ‏\"‏ إن مكة حرمها الله ولم يحرمها الناس ولا يحل لامرئ يؤمن بالله واليوم الآخر أن يسفك بها دما ولا يعضد بها شجرا فإن ترخص أحد لقتال رسول الله صلى الله عليه وسلم فيها فقولوا له إن الله أذن لرسوله ولم يأذن لكم وإنما أذن لي فيها ساعة من نهار وقد عادت حرمتها اليوم كحرمتها بالأمس وليبلغ الشاهد الغائب ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Shuraih, that he said to Amr bin Sad when he was sending troops in batches to Makkah:                     \"O Commander! Permit me to tell you of a statement that the Messenger of Allah said the day after the Conquest of Makkah, which my ears heard, my hear understood, and my eyes saw, when he said it. He (the Prophet) praised Allah, then he said: 'Makkah has been made sacred by Allah, not by the people. It is not permissible for any man who believes in Allah and the Last Day to shed blood in it, or to cut its trees. If any one seeks permission to fight in it because the Messenger of Allah fought in it, say to him: Allah allowed his Messenger (to fight therein) but He did not allow you. Rather permission was given to me (to fight therein) for a short period one day, and now its sanctity has been restored as it as before. Let those who are present convey (this mews) to those who are absent.'\"",
      "chain": [
        "30367",
        "20023",
        "11168",
        "5355"
      ]
    },
    {
      "hadith_no": "606",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يونس بن محمد، عن داود بن أبي الفرات، عن محمد بن زيد، عن أبي شريح، عن أبي مسلم، مولى زيد بن صوحان قال كنت مع سلمان فرأى رجلا ينزع خفيه للوضوء فقال له سلمان امسح على خفيك وعلى خمارك وبناصيتك فإني رأيت رسول الله  صلى الله عليه وسلم  يمسح على الخفين والخمار ‏.‏",
      "text_en": " It was narrated that Abu Muslim, the freed slave of Zaid bin Suhan, said:                     \"I was with Salman, and he saw a man removing his leather socks for ablution. Salman said to him\" 'Wipe over your leather socks and your head cover, and your forehead, for I saw the Messenger of Allah wiping over his leather socks and head cover.'\"",
      "chain": [
        "30201",
        "20393",
        "20424",
        "11217",
        "5355"
      ]
    },
    {
      "hadith_no": "2724",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا عثمان، وأبو بكر ابنا أبي شيبة قالا حدثنا أبو خالد الأحمر، ح وحدثنا عثمان بن أبي شيبة، قال حدثنا جرير، وعبد الرحيم بن سليمان، جميعا عن محمد بن إسحاق، عن الحارث بن فضيل، أظنه عن ابن أبي العوجاء، واسمه، سفيان عن أبي شريح الخزاعي، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أصيب بدم أو خبل - والخبل الجرح - فهو بالخيار بين إحدى ثلاث فإن أراد الرابعة فخذوا على يديه أن يقتل أو يعفو أو يأخذ الدية فمن فعل شيئا من ذلك فعاد فإن له نار جهنم خالدا مخلدا فيها أبدا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Sharaih Al-Khuzai that the Messenger of Allah (ﷺ) said:                     “Whoever suffers from killing or wounding, has the choice of three things, and if he wants the fourth then restrain him. He may kill (the killer), or forgive him, or take the blood money. Whoever accepts any of these (options), then kills (the killer) after that will have the fire of hell to abide therein forever.”",
      "chain": [
        "30203",
        "20326",
        "30203",
        "20028",
        "20334",
        "11107",
        "11835",
        "5355"
      ]
    },
    {
      "hadith_no": "3490",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا حرملة بن يحيى، حدثنا عبد الله بن وهب، أنبأنا أبو شريح، عن عبد الرحمن بن نمران الحجري، عن أبي الزبير، عن جابر، أن نفرا، أتوا النبي  صلى الله عليه وسلم  فوجد منهم ريح الكراث فقال ‏\"‏ ألم أكن نهيتكم عن أكل هذه الشجرة إن الملائكة تتأذى مما يتأذى منه الإنسان ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Jabir that a group of people came to the Prophet(ﷺ)and he noticed the smell of leeks coming from them. He said:                     “Did Inot forbid you to eat these vegetables? For the angels areoffendedby that which offends people.”",
      "chain": [
        "30487",
        "20029",
        "5355",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "3672",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا سفيان بن عيينة، عن عمرو بن دينار، سمع نافع بن جبير، يخبر عن أبي شريح الخزاعي، أن النبي  صلى الله عليه وسلم  قال ‏\"‏ من كان يؤمن بالله واليوم الآخر فليحسن إلى جاره ومن كان يؤمن بالله واليوم الآخر فليكرم ضيفه ومن كان يؤمن بالله واليوم الآخر فليقل خيرا أو ليسكت ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Shuraih Al-Khuzai that the Prophet(ﷺ) said:                     \"Whoever believes in the Last Day, let him treat his neighbour well. Whoever believes in Allah and Last Day, let him honor his guest. Whoever believes in Allah and the Last Day, let him say something good or else remain silent\"",
      "chain": [
        "30201",
        "20005",
        "11081",
        "11059",
        "5355"
      ]
    },
    {
      "hadith_no": "3675",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا سفيان بن عيينة، عن ابن عجلان، عن سعيد بن أبي سعيد، عن أبي شريح الخزاعي، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ من كان يؤمن بالله واليوم الآخر فليكرم ضيفه وجائزته يوم وليلة ولا يحل له أن يثوي عند صاحبه حتى يحرجه الضيافة ثلاثة أيام وما أنفق عليه بعد ثلاثة أيام فهو صدقة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Shuraih Al-Khuza'i that the Messenger of Allah(ﷺ) said:                     \"Whoever believes in the Last Day, let him honor his guest, and grant him reward for a day and a night. And it is not permissible for him to stay so long that he causes annoyance to his host. Hospitality is for three days, and whatever he spends on him after three days is charity.\"",
      "chain": [
        "30201",
        "20005",
        "10616",
        "11168",
        "5355"
      ]
    }
  ],
  "total_hadiths": 24
}