{
  "id": "5371",
  "name": "Abu Kabsha al-Anmari ( أبو كبشة الأنماري ( رضي الله عنه",
  "full_name": "Abu Kabsha al-Anmari ( أبو كبشة الأنماري ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Hijaz"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Hijaz",
      "al-Syria"
    ],
    "area_of_interest": [
      "Narrator [ د  ت  ق  -  صحابي ]"
    ],
    "tags": [
      "al-Anmari",
      "al-Sham"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "19432",
      "name": "Bin Abi Kabsha al-Anmari بن أبي كبشة الأنماري",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "2",
      "name": "Abu Bakr As-Siddique ( أبو بكر الصديق ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "19432",
      "name": "Bin Abi Kabsha al-Anmari بن أبي كبشة الأنماري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "18572",
      "name": "Abu 'Amir al-Huzani أبو عامر الهوزني",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "14205",
      "name": "'Abdullah bin Bsr عبد الله بن بسر",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "18018",
      "name": "Azhar bin Sa'id al-Harazi أزهر بن سعيد الحرازي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11342",
      "name": "Salm bin Abi al-Ja'd سالم بن أبي الجعد",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "17008",
      "name": "Thabit bin Thwban al-Nsy ثابت بن ثوبان العنسي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11347",
      "name": "Sa'id bin Fyrwz Abu al-Bakhtari al-Tai'i سعيد بن فيروز أبو البختري",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-3461",
      "hadith_no": "3461",
      "source": "Sahih Bukhari",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا أبو عاصم الضحاك بن مخلد، أخبرنا الأوزاعي، حدثنا حسان بن عطية، عن أبي كبشة، عن عبد الله بن عمرو، أن النبي صلى الله عليه وسلم قال ‏\"‏ بلغوا عني ولو آية، وحدثوا عن بني إسرائيل ولا حرج، ومن كذب على متعمدا فليتبوأ مقعده من النار ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr:                     The Prophet said, \"Convey (my teachings) to the people even if it were a single sentence, and tell others the stories of Bani Israel (which have been taught to you), for it is not sinful to do so. And whoever tells a lie on me intentionally, will surely take his place in the (Hell) Fire.\"",
      "usc_msa_ref": "667",
      "chain": [
        "20241",
        "20024",
        "11413",
        "5371",
        "29"
      ]
    },
    {
      "id": "sunan-abi-daud-3859",
      "hadith_no": "3859",
      "source": "Sunan Abi Da'ud",
      "chapter": "Medicine (Kitab Al-Tibb) - كتاب الطب",
      "chapter_no": "29",
      "text_ar": "حدثنا عبد الرحمن بن إبراهيم الدمشقي، وكثير بن عبيد، قالا حدثنا الوليد، عن ابن ثوبان، عن أبيه، عن أبي كبشة الأنماري، - قال كثير إنه حدثه - أن النبي صلى الله عليه وسلم كان يحتجم على هامته وبين كتفيه وهو يقول ‏\"‏ من أهراق من هذه الدماء فلا يضره أن لا يتداوى بشىء لشىء ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Kabshah al-Ansari:                     The Messenger of Allah (ﷺ) used to have himself cupped on the top of his head and between his shoulders, and that he used to say: If anyone pours out any of his blood, he will not suffer if he applies no medical treatment for anything.",
      "usc_msa_ref": "",
      "chain": [
        "38462",
        "20733",
        "5371",
        "15476"
      ]
    },
    {
      "id": "sunan-abi-daud-4262",
      "hadith_no": "4262",
      "source": "Sunan Abi Da'ud",
      "chapter": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim) - كتاب الفتن والملاحم",
      "chapter_no": "37",
      "text_ar": "حدثنا محمد بن يحيى بن فارس، حدثنا عفان بن مسلم، حدثنا عبد الواحد بن زياد، حدثنا عاصم الأحول، عن أبي كبشة، قال سمعت أبا موسى، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ إن بين أيديكم فتنا كقطع الليل المظلم يصبح الرجل فيها مؤمنا ويمسي كافرا ويمسي مؤمنا ويصبح كافرا القاعد فيها خير من القائم والقائم فيها خير من الماشي والماشي فيها خير من الساعي ‏\"‏ ‏.‏ قالوا فما تأمرنا قال ‏\"‏ كونوا أحلاس بيوتكم ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuMusa al-Ash'ari:                     The Prophet (ﷺ) said: Before you there will be commotions like pieces of a dark night in which a man will be a believer in the morning and an infidel in the evening. He who sits during them will be better than he who gets up, and he who gets up during them is better than he who walks, and he who walks during them is better than he who runs. They (the people) said: What do you order us to do? He replied: Keep to your houses.",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "30106",
        "20256",
        "11080",
        "5371",
        "30170"
      ]
    },
    {
      "id": "sunan-ibn-majah-3613",
      "hadith_no": "3613",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا محمد بن المصفى الحمصي، حدثنا الوليد بن مسلم، حدثنا ابن ثوبان، عن أبيه، عن أبي كبشة الأنماري، أنه حدثه أن النبي  صلى الله عليه وسلم  كان يحتجم على هامته وبين كتفيه ويقول ‏\"‏ من أهراق منه هذه الدماء فلا يضره أن لا يتداوى بشىء لشىء ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Kabshah Al-Anmari that the Prophet (ﷺ)used to becupped on his head between his shoulders, and he said:                     “Whoeverlets blood from these places, it does not matter if he doesnot seektreatment for anything else.”",
      "usc_msa_ref": "",
      "chain": [
        "20733",
        "5371"
      ]
    }
  ],
  "total_hadiths": 4
}