{
  "id": "54",
  "name": "Hafsa bint Umar ( حفصة بنت عمر بن الخطاب أم المؤمنين ( رضي الله عنها",
  "full_name": "Hafsa bint Umar ( حفصة بنت عمر بن الخطاب أم المؤمنين ( رضي الله عنها",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "14",
      "date_gregorian": "606",
      "date_display": [
        "14 BH",
        "606 CE"
      ],
      "place": "Makkah"
    },
    "death": {
      "date_hijri": "41",
      "date_gregorian": "665",
      "date_display": null,
      "place": "Medinah",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah",
      "Medina"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Tafsir/Quran",
      "Narrator [ ع  -  صحابة ]",
      "Fiqh"
    ],
    "tags": [
      "Female",
      "Quraish",
      "B.'Adi",
      "Mother of the Believers"
    ]
  },
  "parents": [
    {
      "id": "3",
      "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "124",
      "name": "Zaynab bint Maz'un ( زينب بنت مظعون بن حبيب الجمحية ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "spouses": [
    {
      "id": "152",
      "name": "Khunays ibn Hudhaifa ( خنيس بن حذافة بن قيس ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "siblings": [
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "560",
      "name": "'Abdur Rahman bin 'Umar ( عبد الرحمن الأكبر بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA)"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "3",
      "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11818",
      "name": "Hamza bin 'Abdullah bin 'Umar حمزة بن عبد الله بن عمر بن الخطاب",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11811",
      "name": "Safiyya bint Abi 'Ubaid al-Thaqafi صفية بنت أبي عبيد بن مسعود الثقفية",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "1293",
      "name": "Umm Mubashir al-Ansariyya ( أم مبشر الأنصارية ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5295",
      "name": "al-Mtlb bin Abi Wda'h ( المطلب بن أبي وداعة الحارث ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4109",
      "name": "Harithh bin Wahb al-Khza'y ( حارثة بن وهب الخزاعي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "10773",
      "name": "Shtyr bin Shkl bin Hameed شتير بن شكل",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "487",
      "name": "'Abdullah bin Safwan bin Umayyah ( عبد الله بن صفوان بن أمية ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18400",
      "name": "Swa'a al-Khza'y Akhw Mghyth سواء الخزاعي أخو",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "448",
      "name": "'Abdur Rahman ibn al-Harith ( عبد الرحمن بن الحارث بن هشام ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11394",
      "name": "al-Musayb bin Rafa'i al-Asadi المسيب بن رافع الأسدي الكاهلي أبو العلاء",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11313",
      "name": "Lahaaq bin Hameed bin Sa'id لاحق بن حميد بن سعيد أبو مجلز",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "618",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن نافع، عن عبد الله بن عمر، قال أخبرتني حفصة، أن رسول الله صلى الله عليه وسلم كان إذا اعتكف المؤذن للصبح وبدا الصبح صلى ركعتين خفيفتين قبل أن تقام الصلاة‏.‏",
      "text_en": " Narrated Hafsa:                     When the Mu'adh-dhin pronounced the Adhan for Fajr prayer and the dawn became evident the Prophet ordered a two rak`at light prayer (Sunna) before the Iqama of the compulsory (congregational) prayer.",
      "chain": [
        "30355",
        "20001",
        "11014",
        "18",
        "54"
      ]
    },
    {
      "hadith_no": "1591",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك،‏.‏ وحدثنا عبد الله بن يوسف، أخبرنا مالك، عن نافع، عن ابن عمر، عن حفصة  رضى الله عنهم  زوج النبي صلى الله عليه وسلم أنها قالت يا رسول الله، ما شأن الناس حلوا بعمرة ولم تحلل أنت من عمرتك قال ‏\"‏ إني لبدت رأسي، وقلدت هديي فلا أحل حتى أنحر ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     Hafsa the wife of the Prophet said, \"O Allah's Apostle! Why have the people finished their Ihram after performing `Umra but you have not finished your Ihram after performing `Umra?\" He replied, \"I have matted my hair and garlanded my Hadi. So I will not finish my Ihram till I have slaughtered (my Hadi). \"",
      "chain": [
        "30103",
        "30355",
        "20001",
        "11014",
        "18",
        "54"
      ]
    },
    {
      "hadith_no": "1721",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن عبيد الله، قال أخبرني نافع، عن ابن عمر، عن حفصة، رضى الله عنهم قالت قلت يا رسول الله ما شأن الناس حلوا ولم تحلل أنت قال ‏\"‏ إني لبدت رأسي، وقلدت هديي، فلا أحل حتى أحل من الحج ‏\"‏‏.‏",
      "text_en": " Narrated Hafsa:                     I said, \"O Allah's Apostle! What is wrong with the people, they have finished their Ihram but you have not?\" He said, \"I matted my hair and I have garlanded my Hadi, so I will not finish my Ihram till I finished my Hajj .\"",
      "chain": [
        "30175",
        "20031",
        "11201",
        "11014",
        "18",
        "54"
      ]
    },
    {
      "hadith_no": "1752",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن نافع، عن ابن عمر، عن حفصة  رضى الله عنهم  أنها قالت يا رسول الله، ما شأن الناس حلوا بعمرة ولم تحلل أنت من عمرتك قال ‏\"‏ إني لبدت رأسي، وقلدت هديي، فلا أحل حتى أنحر ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     Hafsa said, \"O Allah's Apostle! What is wrong with the people; they finished their Ihram after performing `Umra, but you have not finished it after your `Umra?\" He replied, \"I matted my hair and have garlanded my Hadi. So, I cannot finish my Ihram till I slaughter (my Hadi). \"",
      "chain": [
        "30355",
        "20001",
        "11014",
        "18",
        "54"
      ]
    },
    {
      "hadith_no": "3786",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا يحيى بن سليمان، حدثنا ابن وهب، عن يونس، عن الزهري، عن سالم، عن ابن عمر، عن أخته، حفصة أن النبي صلى الله عليه وسلم قال لها ‏\"‏ إن عبد الله رجل صالح ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar from Hafsa his sister:                     That the Prophet had said to her, \"`Abdullah is a pious man.\"",
      "chain": [
        "30220",
        "20029",
        "20475",
        "11013",
        "11011",
        "18",
        "54"
      ]
    },
    {
      "hadith_no": "4442",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني إبراهيم بن المنذر، أخبرنا أنس بن عياض، حدثنا موسى بن عقبة، عن نافع، أن ابن عمر، أخبره أن حفصة  رضى الله عنها  زوج النبي صلى الله عليه وسلم أخبرته أن النبي صلى الله عليه وسلم أمر أزواجه أن يحللن عام حجة الوداع، فقالت حفصة فما يمنعك فقال ‏\"‏ لبدت رأسي وقلدت هديي، فلست أحل حتى أنحر هديي ‏\"‏‏.‏",
      "text_en": " Narrated Hafsa:                     (the wife of the Prophet) The Prophet ordered all his wives to finish their Ihram during the year of Hajjat-ul-Wada`. On that, I asked the Prophet \"What stops you from finishing your lhram?\" He said, \"I have matted my hair and garlanded my Hadi. So I will not finish my Ihram unless I have slaughtered my Hadi.\"",
      "chain": [
        "30308",
        "20157",
        "11106",
        "11014",
        "18",
        "54"
      ]
    },
    {
      "hadith_no": "5977",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثني إسماعيل، قال حدثني مالك، عن نافع، عن عبد الله بن عمر، عن حفصة  رضى الله عنها  زوج النبي صلى الله عليه وسلم قالت قلت يا رسول الله ما شأن الناس حلوا بعمرة، ولم تحلل أنت من عمرتك قال ‏\"‏ إني لبدت رأسي، وقلدت هديي، فلا أحل حتى أنحر ‏\"‏‏.‏",
      "text_en": " Narrated Hafsa:                     (the wife of the Prophet) I said, \"O Allah's Apostle! Why have the people finished their Ihram after performing the `Umra while you have not finished your lhram after your `Umra?\" He said, \"I have done Talbid (of my hair) and have decorated my Hadis with garlands, so I shall not finish my lhram till l have slaughtered my Hadi (animal for sacrifice).",
      "chain": [
        "30103",
        "20001",
        "11014",
        "18",
        "54"
      ]
    },
    {
      "hadith_no": "1711",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني أحمد بن عبد الله بن الحكم، حدثنا محمد بن جعفر، حدثنا شعبة، عن زيد بن محمد، قال سمعت نافعا، يحدث عن ابن عمر، عن حفصة، قالت كان رسول الله صلى الله عليه وسلم إذا طلع الفجر لا يصلي إلا ركعتين خفيفتين ‏.‏",
      "text_en": " Hafsa reported that when it was dawn, the Messenger of Allah (may peace be upon him) did not observe (any other prayers) but two short rak'ahs.",
      "chain": [
        "20173",
        "20020",
        "11014",
        "18",
        "54"
      ]
    },
    {
      "hadith_no": "1713",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا محمد بن عباد، حدثنا سفيان، عن عمرو، عن الزهري، عن سالم، عن أبيه، أخبرتني حفصة، أن النبي صلى الله عليه وسلم كان إذا أضاء له الفجر صلى ركعتين ‏.‏",
      "text_en": " Hafsa reported:                      When the dawn appeared, the Apostle of Allah (may peace be upon him) observed two rak'ahs (of Sunnah prayers).",
      "chain": [
        "30377",
        "20005",
        "11081",
        "11013",
        "11011",
        "18",
        "54"
      ]
    },
    {
      "hadith_no": "1746",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن ابن شهاب، عن السائب بن يزيد، عن المطلب بن أبي وداعة السهمي، عن حفصة، أنها قالت ما رأيت رسول الله صلى الله عليه وسلم صلى في سبحته قاعدا حتى كان قبل وفاته بعام فكان يصلي في سبحته قاعدا وكان يقرأ بالسورة فيرتلها حتى تكون أطول من أطول منها ‏.‏",
      "text_en": " Zuhri reported this hadith with the same chain of transmitters, except this that he made a mention of one year or two years.",
      "chain": [
        "30399",
        "11013",
        "3048",
        "5295",
        "54"
      ]
    },
    {
      "hadith_no": "2210",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، ح وحدثنا إسحاق بن إبراهيم، أخبرنا عيسى بن يونس، كلاهما عن هشام، عن حفصة، عن أم عطية، قالت نهينا عن اتباع الجنائز، ولم يعزم علينا ‏.‏",
      "text_en": " Umm 'Atiyya reported:                      We were refrained from following the bier, but it was not made absolute on us.",
      "chain": [
        "30201",
        "20318",
        "30123",
        "20347",
        "11065",
        "54",
        "71"
      ]
    },
    {
      "hadith_no": "2642",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا يحيى بن يحيى، وأبو بكر بن أبي شيبة وأبو كريب قال يحيى أخبرنا وقال الآخران، حدثنا أبو معاوية، عن الأعمش، عن مسلم، عن شتير بن شكل، عن حفصة، - رضى الله عنها - قالت كان رسول الله صلى الله عليه وسلم يقبل وهو صائم ‏.‏",
      "text_en": " Hafsa (Allah be pleased with her) reported that the Messenger of Allah (may peace be upon him) kissed (his wives) while fasting.",
      "chain": [
        "30399",
        "20031",
        "20354",
        "11060",
        "20285",
        "10773",
        "54"
      ]
    },
    {
      "hadith_no": "2643",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا أبو الربيع الزهراني، حدثنا أبو عوانة، ح وحدثنا أبو بكر بن أبي شيبة، وإسحاق بن إبراهيم عن جرير، كلاهما عن منصور، عن مسلم، عن شتير بن شكل، عن حفصة، - رضى الله عنها - عن النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " A hadith like this has been narrated by Hafsa (Allah be pleased with her) through another chain of transmitters.",
      "chain": [
        "30137",
        "20469",
        "30201",
        "30123",
        "11067",
        "20285",
        "10773",
        "54"
      ]
    },
    {
      "hadith_no": "3043",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن نافع، عن عبد الله بن عمر، أن حفصة، - رضى الله عنهم - زوج النبي صلى الله عليه وسلم قالت يا رسول الله ما شأن الناس حلوا ولم تحلل أنت من عمرتك قال ‏\"‏ إني لبدت رأسي وقلدت هديي فلا أحل حتى أنحر ‏\"‏ ‏.‏",
      "text_en": " Hafsa (Allah be pleased with her), the wife of Allah's Apostle (may peace be upon him), said:                      Messenger of Allah. what about people who have put off Ihram whereas you have not put it off after your 'Umra? He said: I have stuck my hair and have driven my sacrificial animal, and would not, therefore, put off Ihram until I have sacrificed the animal.",
      "chain": [
        "30399",
        "11014",
        "18",
        "54"
      ]
    },
    {
      "hadith_no": "3044",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثناه ابن نمير، حدثنا خالد بن مخلد، عن مالك، عن نافع، عن ابن عمر، عن حفصة، - رضى الله عنهم - قالت قلت يا رسول الله ما لك لم تحل بنحوه ‏.‏",
      "text_en": " Hafsa (Allah be pleased with her) reported:                      I said: Messenger of Allah what is the matter with you that you have not put off Ihram? The rest of the hadith is the same.",
      "chain": [
        "30212",
        "30463",
        "20001",
        "11014",
        "18",
        "54"
      ]
    },
    {
      "hadith_no": "3045",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا يحيى بن سعيد، عن عبيد الله، قال أخبرني نافع، عن ابن عمر، عن حفصة، - رضى الله عنهم - قالت قلت للنبي صلى الله عليه وسلم ما شأن الناس حلوا ولم تحل من عمرتك قال ‏\"‏ إني قلدت هديي ولبدت رأسي فلا أحل حتى أحل من الحج ‏\"‏ ‏.‏",
      "text_en": " Hafsa (Allah be pleased with her) reported:                      I said to Allah's Messenger (may peace be upon him): What is the matter with people that they have put off Ihram, whereas you have not put it off after your Umra'? He said: I have driven my sacrificial animal and stuck my hair, and it is not permissible for me to put off Ihram unless I have completed the Hajj.",
      "chain": [
        "30170",
        "20031",
        "11201",
        "11014",
        "18",
        "54"
      ]
    },
    {
      "hadith_no": "3046",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، حدثنا عبيد الله، عن نافع، عن ابن عمر، أن حفصة، - رضى الله عنها - قالت يا رسول الله ‏.‏ بمثل حديث مالك ‏\"‏ فلا أحل حتى أنحر ‏\"‏ ‏.‏",
      "text_en": " Hafsa (Allah be pleased with her) said:                      Messenger of Allah; the rest of the hadith is the same and (the concluding words of the Holy Prophet):\" I won't put off Ihram until I have sacrificed the animal.\"",
      "chain": [
        "30201",
        "20318",
        "11201",
        "11014",
        "18",
        "54"
      ]
    },
    {
      "hadith_no": "3047",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا ابن أبي عمر، حدثنا هشام بن سليمان المخزومي، وعبد المجيد، عن ابن جريج، عن نافع، عن ابن عمر، قال حدثتني حفصة، - رضى الله عنها - أن النبي صلى الله عليه وسلم أمر أزواجه أن يحللن عام حجة الوداع ‏.‏ قالت حفصة فقلت ما يمنعك أن تحل قال ‏\"‏ إني لبدت رأسي وقلدت هديي فلا أحل حتى أنحر هديي ‏\"‏ ‏.‏",
      "text_en": " Hafsa (Allah be pleased with her) said that Allah's Apostle (may peace be upon him) commanded his wives that they should put off Ihram during the year of Hajj (at-ul-Wada'). whereupon she (Hafsa) said:                      What hinders you that you have not put off Ihram? Thereupon he said: I have stuck my hair and driven my sacrificial animal along with men and it is not permissible to put off Ihram (under this condition until I have sacrificed the animal.",
      "chain": [
        "30421",
        "20526",
        "11070",
        "11014",
        "18",
        "54"
      ]
    },
    {
      "hadith_no": "3813",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "وحدثنا حسن بن الربيع، حدثنا ابن إدريس، عن هشام، عن حفصة، عن أم عطية، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا تحد امرأة على ميت فوق ثلاث إلا على زوج أربعة أشهر وعشرا ولا تلبس ثوبا مصبوغا إلا ثوب عصب ولا تكتحل ولا تمس طيبا إلا إذا طهرت نبذة من قسط أو أظفار ‏\"‏ ‏.‏",
      "text_en": " Umm 'Atiyya (Allah be pleased with her) reported that Allah's Messenger (may peace be upon him) had said:                      A woman must not observe mouriaing for one who had died for more than three (days) except for four months and ten days in the case of her husband. and she must not wear a dyed garment except one of the types made of dyed yarn, or apply collyrium, or touch perfume except a little perfume or incense, when she has been purified after her courses.",
      "chain": [
        "20102",
        "11065",
        "54",
        "71"
      ]
    },
    {
      "hadith_no": "7423",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا عمرو الناقد، وابن أبي عمر، - واللفظ لعمرو - قالا حدثنا سفيان بن، عيينة عن أمية بن صفوان، سمع جده عبد الله بن صفوان، يقول أخبرتني حفصة، أنها سمعت  النبي صلى الله عليه وسلم يقول ‏\"‏ ليؤمن هذا البيت جيش يغزونه حتى إذا كانوا ببيداء من الأرض يخسف بأوسطهم وينادي أولهم آخرهم ثم يخسف بهم فلا يبقى إلا الشريد الذي يخبر عنهم ‏\"‏ ‏.‏ فقال رجل أشهد عليك أنك لم تكذب على حفصة وأشهد على حفصة أنها لم تكذب على النبي صلى الله عليه وسلم",
      "text_en": " Abdullah b. Safwan reported that Hafsa told him that she had heard Allah's Apostle (may peace be upon him) as saying:                      An army would attack this House in order to fight against the inhabitants of this House and when it would be at the plain ground the ranks in the centre of the army would be sunk and the vanguard would call the rear flanks of the army and they would also be sunk and no flank would be left except some people who would go to inform them (their kith and kin). A person (who had been listening to this badith from Abdullah b. Safwan) said: I bear testimony in regard to you that you are not imputing a lie to Hafsa. And I bear testimony to the fact that Hafsa is not telling a lie about Allah's Apostle (may peace be upon him).",
      "chain": [
        "30263",
        "30421",
        "20005",
        "13005",
        "487",
        "54"
      ]
    },
    {
      "hadith_no": "342",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا يزيد بن خالد الرملي، أخبرنا المفضل، - يعني ابن فضالة - عن عياش بن عباس، عن بكير، عن نافع، عن ابن عمر، عن حفصة، عن النبي صلى الله عليه وسلم قال ‏\"‏ على كل محتلم رواح الجمعة وعلى كل من راح إلى الجمعة الغسل ‏\"‏ ‏.‏ قال أبو داود إذا اغتسل الرجل بعد طلوع الفجر أجزأه من غسل الجمعة وإن أجنب ‏.‏",
      "text_en": " Narrated Hafsah, Ummul Mu'minin:                     The Prophet (ﷺ) said: It is necessary for every adult (person) to go for (saying) Friday (prayer), and for everyone who goes for Friday (prayer) washing is necessary.Abu Dawud said: If one takes bath after sunrise, even though he washes because of seminal emission, that will be enough for him for his washing on Friday.",
      "chain": [
        "38715",
        "20378",
        "10871",
        "11154",
        "11014",
        "18",
        "54"
      ]
    },
    {
      "hadith_no": "1137",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن عبيد، حدثنا حماد، حدثنا أيوب، عن محمد، عن أم عطية، بهذا الخبر قال ‏\"‏ ويعتزل الحيض مصلى المسلمين ‏\"‏ ‏.‏ ولم يذكر الثوب ‏.‏ قال وحدث عن حفصة عن امرأة تحدثه عن امرأة أخرى قالت قيل يا رسول الله فذكر معنى حديث موسى في الثوب ‏.‏",
      "text_en": " This tradition has also been narrated by Umm 'Atiyyah in a similar manner through a different chain. She added:                      The menstruating women should keep themselves away from the place of prayer of the Muslims. She did not mention the garment. She narrated this tradition from Hafsah mentioning a woman who asked about another woman saying: O Messenger of Allah ....She then reported the tradition like that narrated by Musa mentioning the garment.",
      "chain": [
        "30213",
        "20022",
        "11015",
        "20278",
        "71",
        "54"
      ]
    },
    {
      "hadith_no": "2302",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا يعقوب بن إبراهيم الدورقي، حدثنا يحيى بن أبي بكير، حدثنا إبراهيم بن طهمان، حدثني هشام بن حسان، ح وحدثنا عبد الله بن الجراح القهستاني، عن عبد الله، - يعني ابن بكر - السهمي عن هشام، - وهذا لفظ ابن الجراح - عن حفصة، عن أم عطية، أن النبي صلى الله عليه وسلم قال ‏\"‏ لا تحد المرأة فوق ثلاث إلا على زوج فإنها تحد عليه أربعة أشهر وعشرا لا تلبس ثوبا مصبوغا إلا ثوب عصب ولا تكتحل ولا تمس طيبا إلا أدنى طهرتها إذا طهرت من محيضها بنبذة من قسط أو أظفار ‏\"‏ ‏.‏ قال يعقوب مكان عصب ‏\"‏ إلا مغسولا ‏\"‏ ‏.‏ وزاد يعقوب ‏\"‏ ولا تختضب ‏\"‏ ‏.‏",
      "text_en": " ‘Umm Athiyah reported the Prophet(ﷺ) as saying “A woman must not observe mourning for more than three (days) except for four months and ten days in the case of a husband  and she must not wear a dyed garment except one of the types made of dyed yarn or apply collyrium or touch perfume except for a little costus or azfar when she has been purified after her menstrual courses.The narrator Ya’qub mentioned the words “except washed clothes” instead of the words “one of the types made of dyed yarn”. Ya’qub also added “She must not apply Henna”",
      "chain": [
        "30400",
        "20365",
        "20187",
        "11311",
        "38293",
        "20244",
        "11065",
        "54",
        "71"
      ]
    },
    {
      "hadith_no": "2303",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا هارون بن عبد الله، ومالك بن عبد الواحد المسمعي، قالا حدثنا يزيد بن هارون، عن هشام، عن حفصة، عن أم عطية، عن النبي صلى الله عليه وسلم بهذا الحديث وليس في تمام حديثهما ‏.‏ قال المسمعي قال يزيد ولا أعلمه إلا قال فيه ‏\"‏ ولا تختضب ‏\"‏ ‏.‏ وزاد فيه هارون ‏\"‏ ولا تلبس ثوبا مصبوغا إلا ثوب عصب ‏\"‏ ‏.‏",
      "text_en": " The tradition mentioned above has also been narrated by Al ‘Umm Athiyah from the Prophet (ﷺ) through a different chain of narrators. The tradition narrated by Yazid bin Harun from Hisham does perfectly correspond to the tradition transmitted by Ibrahim bin Tahman and ‘Abd Allah Al Shami from Hisham. The narrator Al Misma’I reported Yazid as saying “I do not know but that he said “she should not dye herself.” To this the narrator Harun added “She should not wear colored clothes except one of the types made of dyed yarn.”",
      "chain": [
        "30524",
        "20472",
        "20295",
        "54",
        "71"
      ]
    },
    {
      "hadith_no": "2451",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، عن عاصم بن بهدلة، عن سواء الخزاعي، عن حفصة، قالت كان رسول الله صلى الله عليه وسلم يصوم ثلاثة أيام من الشهر الاثنين والخميس والاثنين من الجمعة الأخرى ‏.‏",
      "text_en": " Narrated Hafsah, Ummul Mu'minin:                     The apostle of Allah (ﷺ) used to fast three days every month: Monday, Thursday and Monday in the next week.",
      "chain": [
        "20040",
        "20022",
        "11358",
        "18400",
        "54"
      ]
    },
    {
      "hadith_no": "730",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا إسحاق بن منصور، أخبرنا ابن أبي مريم، أخبرنا يحيى بن أيوب، عن عبد الله بن أبي بكر، عن ابن شهاب، عن سالم بن عبد الله، عن أبيه، عن حفصة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من لم يجمع الصيام قبل الفجر فلا صيام له ‏\"‏ ‏.‏ قال أبو عيسى حديث حفصة حديث لا نعرفه مرفوعا إلا من هذا الوجه ‏.‏ وقد روي عن نافع عن ابن عمر قوله وهو أصح وهكذا أيضا روي هذا الحديث عن الزهري موقوفا ولا نعلم أحدا رفعه إلا يحيى بن أيوب ‏.‏ وإنما معنى هذا عند أهل العلم لا صيام لمن لم يجمع الصيام قبل طلوع الفجر في رمضان أو في قضاء رمضان أو في صيام نذر إذا لم ينوه من الليل لم يجزه وأما صيام التطوع فمباح له أن ينويه بعد ما أصبح وهو قول الشافعي وأحمد وإسحاق ‏.‏",
      "text_en": " Hafsah narrated that:                     the Prophet said: \"Whoever did not decide to fast before Fajr then there is no fast for him.\"",
      "chain": [
        "30313",
        "30232",
        "20379",
        "11104",
        "11013",
        "11011",
        "18",
        "54"
      ]
    },
    {
      "hadith_no": "4268",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا إسحاق بن منصور، وعبد بن حميد، قالا أخبرنا عبد الرزاق، أخبرنا معمر، عن ثابت، عن أنس، قال بلغ صفية أن حفصة، قالت بنت يهودي ‏.‏ فبكت فدخل عليها النبي صلى الله عليه وسلم وهي تبكي فقال ‏\"‏ ما يبكيك ‏\"‏ ‏.‏ فقالت قالت لي حفصة إني بنت يهودي ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ إنك لابنة نبي وإن عمك لنبي وإنك لتحت نبي ففيم تفخر عليك ‏\"‏ ‏.‏ ثم قال ‏\"‏ اتقي الله يا حفصة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه ‏.‏",
      "text_en": " Narrated Anas:                     said: \"It reached Safiyyah that Hafsah said: 'The daughter of a Jew' so she wept. Then the Prophet (ﷺ) entered upon her while she was crying, so he said: 'What makes you cry?' She said: 'Hafsah said to me that I am the daughter of a Jew.' So the Prophet (ﷺ) said: 'And you are the daughter of a Prophet, and your uncle is a Prophet, and you are married to a Prophet, so what is she boasting to you about?' Then he said: 'Fear Allah, O Hafsah.'\"",
      "chain": [
        "30313",
        "30553",
        "20121",
        "20115",
        "11269",
        "19",
        "54"
      ]
    },
    {
      "hadith_no": "590",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا أحمد بن عبد الله بن الحكم، قال حدثنا محمد بن جعفر، قال حدثنا شعبة، عن زيد بن محمد، قال سمعت نافعا، يحدث عن ابن عمر، عن حفصة، أنها قالت كان رسول الله صلى الله عليه وسلم إذا طلع الفجر لا يصلي إلا ركعتين خفيفتين ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that Hafsah said:                      \"When the dawn appears, the Messenger of Allah (ﷺ) would only pray two short Rak'ahs.\"",
      "chain": [
        "20173",
        "20020",
        "11014",
        "18",
        "54"
      ]
    },
    {
      "hadith_no": "1658",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا قتيبة، عن مالك، عن ابن شهاب، عن السائب بن يزيد، عن المطلب بن أبي وداعة، عن حفصة، قالت ما رأيت رسول الله صلى الله عليه وسلم صلى في سبحته قاعدا قط حتى كان قبل وفاته بعام فكان يصلي قاعدا يقرأ بالسورة فيرتلها حتى تكون أطول من أطول منها ‏.‏",
      "text_en": " It was narrated that Hafsah said:                     \"I never saw the Messenger of Allah (ﷺ) offer his voluntary prayers sitting down until one year before his death. Then he used to pray sitting down, reciting the surah so slowly that it seemed to be longer than a surah that is longer.\"",
      "chain": [
        "30367",
        "20001",
        "11013",
        "3048",
        "5295",
        "54"
      ]
    },
    {
      "hadith_no": "1760",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا قتيبة بن سعيد، قال حدثنا الليث، عن نافع، عن ابن عمر، عن حفصة، عن رسول الله صلى الله عليه وسلم أنه كان إذا نودي لصلاة الصبح ركع ركعتين خفيفتين قبل أن يقوم إلى الصلاة ‏.‏",
      "text_en": " It was narrated from Hafsah that:                     When the call for Subh prayer was given, the Messenger of Allah (ﷺ) would pray two brief rak'ahs before going to the prayer.",
      "chain": [
        "30367",
        "20023",
        "11014",
        "18",
        "54"
      ]
    },
    {
      "hadith_no": "1761",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا محمد بن منصور، قال حدثنا سفيان، قال حدثنا عمرو، عن الزهري، عن سالم، عن ابن عمر، قال أخبرتني حفصة، أن النبي صلى الله عليه وسلم كان إذا أضاء له الفجر صلى ركعتين ‏.‏",
      "text_en": " It was narrated that Ibn Umar said:                     \"Hafsah told me that when dawn glowed, the Prophet (ﷺ) would pray two rak'ahs.",
      "chain": [
        "36658",
        "20005",
        "11081",
        "11013",
        "11011",
        "18",
        "54"
      ]
    },
    {
      "hadith_no": "1765",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا محمد بن إبراهيم البصري، قال حدثنا خالد بن الحارث، قال قرأت على عبد الحميد بن جعفر عن نافع، عن صفية، عن حفصة، عن النبي صلى الله عليه وسلم أنه كان يصلي ركعتى الفجر ركعتين خفيفتين ‏.‏",
      "text_en": " It was narrated from Hafsah that:                     The Prophet (ﷺ) used to pray the two rak'ahs of Fajr, two brief rak'ahs.",
      "chain": [
        "11213",
        "20226",
        "11014",
        "2802",
        "54"
      ]
    },
    {
      "hadith_no": "1766",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا شعيب بن شعيب بن إسحاق، قال حدثنا عبد الوهاب، قال أنبأنا شعيب، قال حدثنا الأوزاعي، قال حدثني يحيى، قال حدثني نافع، قال حدثني ابن عمر، قال حدثتني حفصة، أن رسول الله صلى الله عليه وسلم كان يركع ركعتين خفيفتين بين النداء والإقامة من صلاة الفجر ‏.‏ قال أبو عبد الرحمن كلا الحديثين عندنا خطأ والله تعالى أعلم ‏.‏",
      "text_en": " Ibn 'Umar said:                      \"Hafsah told me thatThe Messenger of Allah (ﷺ) used to pray two brief rak'ahs between the call (the Adhan) and the Iqamah for Fajr prayer.\"",
      "chain": [
        "37510",
        "20259",
        "20428",
        "20024",
        "11449",
        "11014",
        "18",
        "54"
      ]
    },
    {
      "hadith_no": "1767",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا إسحاق بن منصور، قال أنبأنا يحيى، قال حدثنا الأوزاعي، قال حدثني يحيى، عن نافع، عن ابن عمر، عن حفصة، قالت كان رسول الله صلى الله عليه وسلم يركع بين النداء والصلاة ركعتين خفيفتين ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that Hafsah said:                     \"The Messenger of Allah (ﷺ) used to pray two brief rak'ahs between the call (the Adhan) and the prayer.\"",
      "chain": [
        "30313",
        "30020",
        "20024",
        "11449",
        "11014",
        "18",
        "54"
      ]
    },
    {
      "hadith_no": "1768",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا هشام بن عمار، قال حدثنا يحيى، - يعني ابن حمزة - قال حدثنا الأوزاعي، عن يحيى، عن أبي سلمة، قال هو ونافع عن ابن عمر، عن حفصة، أن النبي صلى الله عليه وسلم كان يصلي بين النداء والإقامة ركعتين خفيفتين ركعتى الفجر ‏.‏",
      "text_en": " It was narrated from Abu Salamah and Nafi', from Ibn Umar, from Hafsah that:                     The Prophet (ﷺ) used to pray two brief rak'ahs between the call (The adhan) and the Iqamah, the two rak'ahs of Fajr.",
      "chain": [
        "30288",
        "20402",
        "20024",
        "11449",
        "10567",
        "11014",
        "18",
        "54"
      ]
    },
    {
      "hadith_no": "1769",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا إسحاق بن منصور، قال حدثنا معاذ بن هشام، قال حدثني أبي، عن يحيى بن أبي كثير، قال حدثني نافع، أن ابن عمر، حدثه أن حفصة حدثته أن رسول الله صلى الله عليه وسلم كان يصلي ركعتين خفيفتين بين النداء والإقامة من صلاة الصبح ‏.‏",
      "text_en": " Ibn Umar narrated that Hafsah had told him that the:                     Messenger of Allah (ﷺ) used to pray two brief rak'ahs between the adhan and the Iqamah of Subh prayer.",
      "chain": [
        "30313",
        "20287",
        "20295",
        "11449",
        "11014",
        "18",
        "54"
      ]
    },
    {
      "hadith_no": "1770",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا يحيى بن محمد، قال حدثنا محمد بن جهضم، قال إسماعيل حدثنا عن عمر بن نافع، عن أبيه، عن ابن عمر، قال أخبرتني حفصة، أن رسول الله صلى الله عليه وسلم كان يصلي قبل الصبح ركعتين ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                     \"Hafsah told me that the Messenger of Allah (ﷺ) used to pray two rak'ahs beore Subh.\"",
      "chain": [
        "30162",
        "20208",
        "11713",
        "18",
        "54"
      ]
    },
    {
      "hadith_no": "1771",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا محمد بن عبد الله بن عبد الحكم، قال أنبأنا إسحاق بن الفرات، عن يحيى بن أيوب، قال حدثني يحيى بن سعيد، قال أنبأنا نافع، عن ابن عمر، عن حفصة، أنها أخبرته أن رسول الله صلى الله عليه وسلم كان إذا نودي لصلاة الصبح سجد سجدتين قبل صلاة الصبح ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that Hafsah told him:                     \"When he was called to Subh prayer, the Messenger of Allah (ﷺ) would do two prostrations before Subh prayer.\"",
      "chain": [
        "36056",
        "26001",
        "20379",
        "11062",
        "11014",
        "18",
        "54"
      ]
    },
    {
      "hadith_no": "1775",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا محمد بن عبد الله بن يزيد، قال حدثنا أبي قال، حدثنا جويرية بن أسماء، عن نافع، عن عبد الله بن عمر، عن حفصة، أن رسول الله صلى الله عليه وسلم كان يصلي ركعتين إذا طلع الفجر ‏.‏",
      "text_en": " It was narrated from Abdullah bin Umar, from Hafsah, that:                     The Messenger of Allah (ﷺ) used to pray two rak'ahs when dawn had broken.",
      "chain": [
        "20216",
        "11014",
        "18",
        "54"
      ]
    },
    {
      "hadith_no": "1776",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا أحمد بن عبد الله بن الحكم، قال حدثنا محمد بن جعفر، قال حدثنا شعبة، عن زيد بن محمد، قال سمعت نافعا، عن ابن عمر، عن حفصة، أنها قالت كان رسول الله صلى الله عليه وسلم إذا طلع الفجر لا يصلي إلا ركعتين خفيفتين ‏.‏",
      "text_en": " It was narrated from Ibn Umar that Hafsah said:                     \"When dawn came, the Messenger of Allah (ﷺ) would not pray anything but two brief rak'ahs.\"",
      "chain": [
        "20173",
        "20020",
        "11014",
        "18",
        "54"
      ]
    },
    {
      "hadith_no": "1777",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا قتيبة بن سعيد، قال حدثنا الليث، عن نافع، عن ابن عمر، عن حفصة، عن رسول الله صلى الله عليه وسلم أنه كان إذا نودي لصلاة الصبح ركع ركعتين خفيفتين قبل أن يقوم إلى الصلاة ‏.‏ وروى سالم عن ابن عمر عن حفصة ‏.‏",
      "text_en": " It was narrated from Ibn Umar, from Hafsah, that:                     When the call to Subh prayer was given, the Messenger of Allah (ﷺ) would pray two brief rak'ahs before going to pray.",
      "chain": [
        "30367",
        "20023",
        "11014",
        "18",
        "54"
      ]
    },
    {
      "hadith_no": "1778",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا عبد الرزاق، قال حدثنا معمر، عن الزهري، عن سالم، قال ابن عمر أخبرتني حفصة، أن رسول الله صلى الله عليه وسلم كان يركع ركعتين قبل الفجر وذلك بعد ما يطلع الفجر ‏.‏",
      "text_en": " Ibn Umar said:                     \"Hafsah told me that the Messenger of Allah (ﷺ) used to pray two brief rak'ahs before Fajr, and that was after dawn had broken.\"",
      "chain": [
        "30123",
        "20121",
        "20115",
        "11013",
        "11011",
        "18",
        "54"
      ]
    },
    {
      "hadith_no": "1779",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا الحسين بن عيسى، قال حدثنا سفيان، عن عمرو، عن الزهري، عن سالم، عن أبيه، قال أخبرتني حفصة، أن رسول الله صلى الله عليه وسلم كان إذا أضاء له الفجر صلى ركعتين ‏.‏",
      "text_en": " It was narrated from Salim that his father said:                     \"Hafsah told me that when dawn glowed, the Messenger of Allah (ﷺ) would pray two rak'ahs.\"",
      "chain": [
        "20012",
        "11081",
        "11013",
        "11011",
        "18",
        "54"
      ]
    },
    {
      "hadith_no": "1885",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا يحيى، قال حدثنا هشام، قال حدثتنا حفصة، عن أم عطية، قالت ماتت إحدى بنات النبي صلى الله عليه وسلم فأرسل إلينا فقال ‏\"‏ اغسلنها بماء وسدر واغسلنها وترا ثلاثا أو خمسا أو سبعا إن رأيتن ذلك واجعلن في الآخرة شيئا من كافور فإذا فرغتن فآذنني ‏\"‏ ‏.‏ فلما فرغنا آذناه فألقى إلينا حقوه وقال ‏\"‏ أشعرنها إياه ‏\"‏ ‏.‏ ومشطناها ثلاثة قرون وألقيناها من خلفها ‏.‏",
      "text_en": " It was narrated that Umm 'Atiyyah said:                     \"One of the daughters of the Prophet died, and he sent word to us saying: 'Wash her with water and lotus leaves, and wash her an odd number of times, three, or five, or seven if you think (that is needed), and put some camphor in it the last time. And when you have finished, inform me.' When we finished, we finished, we informed him, and he threw his informed him, and he threw his waist-wrap to us and said: 'Shroud her in it.' And we combed her hair and put it in three braids, and put it behind her.\"",
      "chain": [
        "30153",
        "20031",
        "11065",
        "54",
        "71"
      ]
    },
    {
      "hadith_no": "1891",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا محمد بن منصور، قال حدثنا سفيان، قال حدثنا أيوب، عن محمد، قال أخبرتني حفصة، عن أم عطية، قالت وجعلنا رأسها ثلاثة قرون ‏.‏",
      "text_en": " Ayyub narrated from Muhammad, who said:                     \"Hafsah informed me that Umm 'Atiyyah said: 'We put her hair in three braids.\"'",
      "chain": [
        "36658",
        "20005",
        "11015",
        "20278",
        "54",
        "71"
      ]
    },
    {
      "hadith_no": "2331",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرني القاسم بن زكريا بن دينار، قال حدثنا سعيد بن شرحبيل، قال أنبأنا الليث، عن يحيى بن أيوب، عن عبد الله بن أبي بكر، عن سالم بن عبد الله، عن عبد الله بن عمر، عن حفصة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من لم يبيت الصيام قبل الفجر فلا صيام له ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Hafsah that the Prophet said:                     \"Whoever does not have the intention of fasting before dawn, then there is no fast for him.\"(Daif)",
      "chain": [
        "30475",
        "30194",
        "20023",
        "20379",
        "11104",
        "11011",
        "18",
        "54"
      ]
    },
    {
      "hadith_no": "2332",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا عبد الملك بن شعيب بن الليث بن سعد، قال حدثني أبي، عن جدي، قال حدثني يحيى بن أيوب، عن عبد الله بن أبي بكر، عن ابن شهاب، عن سالم، عن عبد الله، عن حفصة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من لم يبيت الصيام قبل الفجر فلا صيام له ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Hafsah that the Prophet said:                     \"Whoever does not have the intention of fasting before dawn, then there is no fast for him.\" (Daif)",
      "chain": [
        "20379",
        "11104",
        "11013",
        "11011",
        "18",
        "54"
      ]
    },
    {
      "hadith_no": "2333",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرني محمد بن عبد الله بن عبد الحكم، عن أشهب، قال أخبرني يحيى بن أيوب، وذكر، آخر أن عبد الله بن أبي بكر بن محمد بن عمرو بن حزم، حدثهما عن ابن شهاب، عن سالم بن عبد الله، عن أبيه، عن حفصة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من لم يجمع الصيام قبل طلوع الفجر فلا يصوم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Hafsah that the Prophet said:                     \"Whoever does not intend to fast before dawn comes, should not fast.\" (Daif)",
      "chain": [
        "36056",
        "36012",
        "20379",
        "11013",
        "11011",
        "18",
        "54"
      ]
    },
    {
      "hadith_no": "2334",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا أحمد بن الأزهر، قال حدثنا عبد الرزاق، عن ابن جريج، عن ابن شهاب، عن سالم، عن ابن عمر، عن حفصة، أن النبي صلى الله عليه وسلم قال ‏\"‏ من لم يبيت الصيام من الليل فلا صيام له ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Hafsah that the Prophet said:                     \"Whoever does not have the intention of fasting from the night before, then there is no fast for him.\" (Daif)",
      "chain": [
        "38001",
        "20121",
        "11070",
        "11013",
        "11011",
        "18",
        "54"
      ]
    },
    {
      "hadith_no": "2335",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا معتمر، قال سمعت عبيد الله، عن ابن شهاب، عن سالم، عن عبد الله، عن حفصة، أنها كانت تقول من لم يجمع الصيام من الليل فلا يصوم ‏.‏",
      "text_en": " It was narrated from Hafsah that she used to say:                     \"Whoever does not intend to fast from the night before, should not fast.\" (Daif)",
      "chain": [
        "30449",
        "20288",
        "11201",
        "11013",
        "11011",
        "18",
        "54"
      ]
    },
    {
      "hadith_no": "2337",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرني زكريا بن يحيى، قال حدثنا الحسن بن عيسى، قال أنبأنا ابن المبارك، قال أنبأنا معمر، عن الزهري، عن حمزة بن عبد الله، عن عبد الله بن عمر، عن حفصة، قالت لا صيام لمن لم يجمع قبل الفجر ‏.‏",
      "text_en": " It was narrated from Hafsah that:                     \"There is no fast for one who does not intend (to fast) before dawn.\"",
      "chain": [
        "20025",
        "20115",
        "11013",
        "11818",
        "18",
        "54"
      ]
    },
    {
      "hadith_no": "2338",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن حاتم، قال أنبأنا حبان، قال أنبأنا عبد الله، عن سفيان بن عيينة، ومعمر، عن الزهري، عن حمزة بن عبد الله بن عمر، عن أبيه، عن حفصة، قالت لا صيام لمن لم يجمع الصيام قبل الفجر ‏.‏",
      "text_en": " It was narrated that Hafsah that:                     \"There is no fast for the one who does not intend to fast before dawn.\"",
      "chain": [
        "30514",
        "20218",
        "20025",
        "20005",
        "20115",
        "11013",
        "11818",
        "18",
        "54"
      ]
    },
    {
      "hadith_no": "2339",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا سفيان، عن الزهري، عن حمزة بن عبد الله بن عمر، عن حفصة، قالت لا صيام لمن لم يجمع الصيام قبل الفجر ‏.‏",
      "text_en": " It was narrated that Hafsah said:                     \"There is no fast for the one who does not intend to fast before dawn.",
      "chain": [
        "30123",
        "20012",
        "11013",
        "11818",
        "54"
      ]
    },
    {
      "hadith_no": "2340",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا أحمد بن حرب، حدثنا سفيان، عن الزهري، عن حمزة بن عبد الله، عن حفصة، قالت لا صيام لمن لم يجمع الصيام قبل الفجر ‏.‏ أرسله مالك بن أنس ‏.‏",
      "text_en": " It was narrated that Hafsah said:                     \"There is no fast for the one who does not intend to fast before dawn.\" Malik bin Anas narrated it in Mursla from.",
      "chain": [
        "38011",
        "20005",
        "11013",
        "11818",
        "54"
      ]
    },
    {
      "hadith_no": "2366",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرني زكريا بن يحيى، قال حدثنا إسحاق، قال أنبأنا النضر، قال أنبأنا حماد، عن عاصم بن أبي النجود، عن سواء، عن حفصة، قالت كان رسول الله صلى الله عليه وسلم يصوم من كل شهر يوم الخميس ويوم الاثنين ومن الجمعة الثانية يوم الاثنين ‏.‏",
      "text_en": " It was narrated that Hafsah said:                     \"The Messenger of Allah used to fast Thursday and Monday of each month, and Monday of the following week.\"",
      "chain": [
        "30021",
        "20291",
        "20022",
        "11358",
        "54"
      ]
    },
    {
      "hadith_no": "2416",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا أبو بكر بن أبي النضر، قال حدثنا أبو إسحاق الأشجعي، - كوفي - عن عمرو بن قيس الملائي، عن الحر بن الصياح، عن هنيدة بن خالد الخزاعي، عن حفصة، قالت أربع لم يكن يدعهن النبي صلى الله عليه وسلم صيام عاشوراء والعشر وثلاثة أيام من كل شهر وركعتين قبل الغداة ‏.‏",
      "text_en": " It was narrated that Hafsah said:                     \"There are four things which the Prophet never gave up: Fasting 'Ashura', (fasting during) the ten days, (fasting) three days of each month, and praying two Rak'ahs before Al-Ghadah (Fajr).\"",
      "chain": [
        "30528",
        "25372",
        "10803",
        "5408",
        "54"
      ]
    },
    {
      "hadith_no": "2582",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا خالد، قال حدثنا ابن عون، عن حفصة، عن أم الرائح، عن سلمان بن عامر، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن الصدقة على المسكين صدقة وعلى ذي الرحم اثنتان صدقة وصلة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Salman bin 'Amir that the Prophet said:                     \"Giving charity to a poor person is charity, and (giving) to a relative is two things, charity and upholding the ties of kinship.\"",
      "chain": [
        "30449",
        "20423",
        "11071",
        "54"
      ]
    },
    {
      "hadith_no": "2682",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا يحيى، عن عبيد الله، قال أخبرني نافع، عن عبد الله بن عمر، عن أخته، حفصة قالت قلت للنبي صلى الله عليه وسلم يا رسول الله ما شأن الناس حلوا ولم تحل من عمرتك قال ‏\"‏ إني لبدت رأسي وقلدت هديي فلا أحل حتى أحل من الحج ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin 'Umar that his sister, Hafsah, said;\"I said to the Prophet;'O Messenger of Allah! Why is it that the people have exited Ihram and you have not exited Ihram following your 'Umrah?'He said:                      'I have matted my hair and garlanded my Hadi (sacrificial animal), so I will not exit Ihram until I exit Ihram after Hajj.'''",
      "chain": [
        "30359",
        "20031",
        "11201",
        "11014",
        "18",
        "54"
      ]
    },
    {
      "hadith_no": "2879",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرني محمد بن داود المصيصي، قال حدثنا يحيى بن محمد بن سابق، قال حدثنا أبو أسامة، قال حدثنا عبد السلام، عن الدالاني، عن عمرو بن مرة، عن سالم بن أبي الجعد، عن أخيه، قال حدثني ابن أبي ربيعة، عن حفصة بنت عمر، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ يبعث جند إلى هذا الحرم فإذا كانوا ببيداء من الأرض خسف بأولهم وآخرهم ولم ينج أوسطهم ‏\"‏ ‏.‏ قلت أرأيت إن كان فيهم مؤمنون قال ‏\"‏ تكون لهم قبورا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Hafshah bint Umar said:                     \"The Messenger of Allah sadi: 'An army will be sent toward this House, and when they are in Al-Baida, they first and the last of them will be swallowed up by the earth, and those in the middle will be saved.' I said: \"What if there are believers among them?\" He said: 'It will be graves for them.'\" (Daif)",
      "chain": [
        "38505",
        "35172",
        "20318",
        "11381",
        "11342",
        "15158",
        "54"
      ]
    },
    {
      "hadith_no": "2880",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا الحسين بن عيسى، قال حدثنا سفيان، عن أمية بن صفوان بن عبد الله بن صفوان، سمع جده، يقول حدثتني حفصة، أنه قال صلى الله عليه وسلم ‏\"‏ ليؤمن هذا البيت جيش يغزونه حتى إذا كانوا ببيداء من الأرض خسف بأوسطهم فينادي أولهم وآخرهم فيخسف بهم جميعا ولا ينجو إلا الشريد الذي يخبر عنهم ‏\"‏ ‏.‏ فقال له رجل أشهد عليك أنك ما كذبت على جدك وأشهد على جدك أنه ما كذب على حفصة وأشهد على حفصة أنها لم تكذب على النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Hafsah narrated that he said:                     An invading army will come toward this House until when they are in Al-Baida, the middle of them will be swallowed up by the earth. The first of them will call out to the last of them, and they will be wallowed up, until there is no one left of them except a fugitive who will tell of what happened to them.\" A man (hearing the narration) said: \"I bear witness that you did not attribute a lie to your grandfather, and I bear witness that your grandfather did not attribute a lie to Hafsah, and I bear witness that Hafsh, did not attribute a lie to the Prophet.",
      "chain": [
        "20012",
        "13005",
        "54"
      ]
    },
    {
      "hadith_no": "3542",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا العباس بن محمد، - هو الدوري - قال حدثنا الأسود بن عامر، عن زائدة، عن هشام، عن حفصة، عن أم عطية، عن النبي صلى الله عليه وسلم أنه رخص للمتوفى عنها عند طهرها في القسط والأظفار ‏.‏",
      "text_en": " It was narrated from Hafsah, from Umm 'Atiyyah, from the Prophet, that he granted a concession to the woman whose husband has died, allowing her to use Qust and Azfar when purifying herself following her menses.",
      "chain": [
        "20380",
        "20320",
        "11065",
        "54",
        "71"
      ]
    },
    {
      "hadith_no": "1199",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن رمح، أنبأنا الليث بن سعد، عن نافع، عن ابن عمر، عن حفصة بنت عمر، أن رسول الله  صلى الله عليه وسلم  كان إذا نودي لصلاة الصبح ركع ركعتين خفيفتين قبل أن يقوم إلى الصلاة ‏.‏",
      "text_en": " It wasnarrated from Hafsah bint ‘Umar that when the call for theSubhprayer was given, the Messenger of Allah (ﷺ) would pray twoshortRak’ah before going to the prayer.",
      "chain": [
        "30490",
        "20023",
        "11014",
        "18",
        "54"
      ]
    },
    {
      "hadith_no": "1644",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، عن هشام، عن حفصة، عن أم عطية، قالت نهينا عن اتباع الجنائز، ولم يعزم علينا ‏.‏",
      "text_en": " It wasnarrated that Umm ‘Atiyyah said:                      “We were prevented fromfollowing the funeral, but that was not made binding on us.”",
      "chain": [
        "30201",
        "20318",
        "11065",
        "54",
        "71"
      ]
    },
    {
      "hadith_no": "1755",
      "source": " Sunan Ibn Majah ",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعلي بن محمد، قالا حدثنا أبو معاوية، عن الأعمش، عن مسلم، عن شتير بن شكل، عن حفصة، أن النبي  صلى الله عليه وسلم  كان يقبل وهو صائم ‏.‏",
      "text_en": " It wasnarrated from Hafsah that:                      The Messenger of Allah (ﷺ) used to kiss when he was fasting.",
      "chain": [
        "30201",
        "38409",
        "20354",
        "11060",
        "11392",
        "10773",
        "54"
      ]
    },
    {
      "hadith_no": "1770",
      "source": " Sunan Ibn Majah ",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا خالد بن مخلد القطواني، عن إسحاق بن حازم، عن عبد الله بن أبي بكر بن عمرو بن حزم، عن سالم، عن ابن عمر، عن حفصة، قالت قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا صيام لمن لم يفرضه من الليل ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Hafsah that the Messenger of Allah (ﷺ) said:                     \"Thereis no fast for the one who did not make it incumbent uponhimselffrom the night before.\"",
      "chain": [
        "30201",
        "30463",
        "11104",
        "11011",
        "18",
        "54"
      ]
    },
    {
      "hadith_no": "4200",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا هشام بن عمار، حدثنا سفيان بن عيينة، عن أمية بن صفوان بن عبد الله بن صفوان، سمع جده عبد الله بن صفوان، يقول أخبرتني حفصة، أنها سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ ليؤمن هذا البيت جيش يغزونه حتى إذا كانوا ببيداء من الأرض خسف بأوسطهم ويتنادى أولهم آخرهم فيخسف بهم فلا يبقى منهم إلا الشريد الذي يخبر عنهم ‏\"‏ ‏.‏ فلما جاء جيش الحجاج ظننا أنهم هم فقال رجل أشهد عليك أنك لم تكذب على حفصة و أن حفصة لم تكذب على النبي  صلى الله عليه وسلم  ‏.‏",
      "text_en": " Hafsah narrated that she heard the Messenger of Allah (ﷺ) say:                      “Aninvading army will come towards this House until, when they are inBayda’, the middle of them will be swallowed up by the earth, andthefirst of them will call out to the last of them, and they will beswallowed up, until there is no one left of them except a fugitivewhowill tell them of what happened to them.” When the army ofHajjajcame, we thought that they were (the ones mentioned in thisHadith). Aman said: “I bear witness that you did not attribute alie to Hafsahand that Hafsah did not attribute a lie to the Prophet(ﷺ).”",
      "chain": [
        "30288",
        "20005",
        "13005",
        "487",
        "54"
      ]
    }
  ],
  "total_hadiths": 66
}