{
  "id": "56",
  "name": "Umm Salamah ( أم سلمة بنت أبي أمية ( رضي الله عنها",
  "full_name": "Umm Salamah ( أم سلمة بنت أبي أمية ( رضي الله عنها",
  "grade": "Comp.(RA) [1st Generation]",
  "biography": {
    "birth": {
      "date_hijri": "25",
      "date_gregorian": "NA",
      "date_display": [
        "25 BH"
      ],
      "place": "Makkah"
    },
    "death": {
      "date_hijri": "62",
      "date_gregorian": "680",
      "date_display": null,
      "place": "Medinah",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah",
      "Medina"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ ع  -  صحابة ]",
      "Fiqh"
    ],
    "tags": [
      "Female",
      "Quraish",
      "B.Makhzum",
      "Abyssinia 1",
      "Abyssinia 2",
      "Mother of the Believers",
      "Emigrant",
      "Baqi'"
    ]
  },
  "parents": [],
  "spouses": [
    {
      "id": "101",
      "name": "Abu Salamah ( عبد الله بن عبد الأسد أبو سلمة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "siblings": [
    {
      "id": "81",
      "name": "Qaraybah bint Abi Umayyah al-Sugra ( قريبة بنت أبي أمية ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "2088",
      "name": "al-Muhajir bin Abi Umayyah ( المهاجر بن أبي أمية المخزومي ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "2089",
      "name": "Rayta bint Abi Umayyah ( ريطة بنت أبي أمية المخزومية ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "children": [
    {
      "id": "244",
      "name": "Zaynab bint Abi Salamah ( زينب بنت أبي سلمة ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "245",
      "name": "Salamah bin Abi Salamah ( سلمة بن أبي سلمة بن عبدالأسد ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "246",
      "name": "'Umar bin Abi Salamah ( عمر بن أبي سلمة بن عبد الأسد ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "247",
      "name": "Durrah bintt Abi Salamah ( درة بنت أبي سلمة بن عبدالأسد ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "students": [
    {
      "id": "244",
      "name": "Zaynab bint Abi Salamah ( زينب بنت أبي سلمة ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "246",
      "name": "'Umar bin Abi Salamah ( عمر بن أبي سلمة بن عبد الأسد ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "2086",
      "name": "'Amir bin Abi Umayyah ( عامر بن أبي أمية المخزومي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "19824",
      "name": "Nabhan Abu Yahya al-Makhzumi نبهان المخزومي أبو يحيى",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11005",
      "name": "Sulayman ibn Yasar سليمان بن يسار مولى ميمونة بنت الحارث",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10511",
      "name": "'Urwa ibn al-Zubayr عروة بن الزبير",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19004",
      "name": "Mus'ab bin 'Abdullah مصعب بن عبد الله بن أبي أمية",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11864",
      "name": "'Abdullah bin Rafa'i عبد الله بن رافع المخزومي أبو رافع",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19067",
      "name": "Naf' Mwla Umm Salmah نافع مولى أم سلمة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "438",
      "name": "Safinah ( سفينة مولى رسول الله صلى الله عليه وسلم ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "19466",
      "name": "Abu Kathir أبو كثير مولى أم سلمة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10737",
      "name": "Khayra Umm al-Hasan al-'Abbassri خيرة أم الحسن البصري",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "50",
      "name": "Usamah ibn Zayd ( أسامة بن زيد بن حارثة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11734",
      "name": "Hind bint al-Harith al-Farasiyya هند بنت الحارث الفراسية",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "2808",
      "name": "Barra bint Abi Tajra ( برة بنت أبي تجراة العبدرية ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "11113",
      "name": "Abu 'Uthman al-Nahdi عبد الرحمن بن مل - أبو عثمان النهدي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "10561",
      "name": "Humaid bin 'Abdur Rahman حميد بن عبد الرحمن بن عوف الزهرى",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "10567",
      "name": "Abu Salama bin 'Abdur Rahman أبو سلمة بن عبد الرحمن بن عوف",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11002",
      "name": "Sa'id ibn al-Musayyib سعيد بن المسيب بن حزن أبو محمد القرشي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11353",
      "name": "Shaqayq bin Salmah al-Asadi شقيق بن سلمة الأسدي أبو وائل الكوفي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11052",
      "name": "'Amir al-Sha'bi عامر الشعبي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "107",
      "name": "'Abdur Rahman bin Abi Bakr ( عبد الرحمن بن أبي بكر الصديق ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "448",
      "name": "'Abdur Rahman ibn al-Harith ( عبد الرحمن بن الحارث بن هشام ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11030",
      "name": "Ikramah bin 'Abdur Rahman عكرمة بن عبد الرحمن بن الحارث",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11003",
      "name": "Abu Bakr bin 'Abdur Rahman أبو بكر بن عبد الرحمن بن الحارث بن هشام",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11211",
      "name": "Karayb bin Abi Muslim كريب بن أبي مسلم الهاشمي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "5232",
      "name": "Qubaysa bin Zuwayb ( قبيصة بن ذؤيب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11014",
      "name": "Nafie' نافع مولى ابن عمر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "13144",
      "name": "Ya'la bin Mamulk يعلى بن مملك",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "115",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا صدقة، أخبرنا ابن عيينة، عن معمر، عن الزهري، عن هند، عن أم سلمة، وعمرو، ويحيى بن سعيد، عن الزهري، عن هند، عن أم سلمة، قالت استيقظ النبي صلى الله عليه وسلم ذات ليلة فقال ‏\"‏ سبحان الله ماذا أنزل الليلة من الفتن وماذا فتح من الخزائن أيقظوا صواحبات الحجر، فرب كاسية في الدنيا عارية في الآخرة ‏\"‏‏.‏",
      "text_en": " Narrated Um Salama:                     One night Allah's Apostle got up and said, \"Subhan Allah! How many afflictions have been descended tonight and how many treasures have been disclosed! Go and wake the sleeping lady occupants of these dwellings (his wives) up (for prayers). A well-dressed (soul) in this world may be naked in the Hereafter. \"",
      "chain": [
        "30343",
        "20005",
        "20115",
        "11013",
        "11734",
        "56",
        "11210",
        "11062",
        "11013",
        "11734",
        "56"
      ]
    },
    {
      "hadith_no": "130",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن سلام، قال أخبرنا أبو معاوية، قال حدثنا هشام، عن أبيه، عن زينب ابنة أم سلمة، عن أم سلمة، قالت جاءت أم سليم إلى رسول الله صلى الله عليه وسلم فقالت يا رسول الله إن الله لا يستحيي من الحق، فهل على المرأة من غسل إذا احتلمت قال النبي صلى الله عليه وسلم ‏\"‏ إذا رأت الماء ‏\"‏‏.‏ فغطت أم سلمة  تعني وجهها  وقالت يا رسول الله وتحتلم المرأة قال ‏\"‏ نعم تربت يمينك فبم يشبهها ولدها ‏\"‏‏.‏",
      "text_en": " Narrated Um Salama:                     Um-Sulaim came to Allah's Apostle and said, \"Verily, Allah is not shy of (telling you) the truth. Is it necessary for a woman to take a bath after she has a wet dream (nocturnal sexual discharge?) The Prophet replied, \"Yes, if she notices a discharge.\" Um Salama, then covered her face and asked, \"O Allah's Apostle! Does a woman get a discharge?\" He replied, \"Yes, let your right hand be in dust (An Arabic expression you say to a person when you contradict his statement meaning \"you will not achieve goodness\"), and that is why the son resembles his mother.\"",
      "chain": [
        "30376",
        "20354",
        "20295",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "298",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا المكي بن إبراهيم، قال حدثنا هشام، عن يحيى بن أبي كثير، عن أبي سلمة، أن زينب ابنة أم سلمة، حدثته أن أم سلمة حدثتها قالت، بينا أنا مع النبي، صلى الله عليه وسلم مضطجعة في خميصة إذ حضت، فانسللت فأخذت ثياب حيضتي قال ‏\"‏ أنفست ‏\"‏‏.‏ قلت نعم‏.‏ فدعاني فاضطجعت معه في الخميلة‏.‏",
      "text_en": " Narrated Um Salama:                     While I was laying with the Prophet under a single woolen sheet, I got the menses. I slipped away and put on the clothes for menses. He said, \"Have you got \"Nifas\" (menses)?\" I replied, \"Yes.\" He then called me and made me lie with him under the same sheet.",
      "chain": [
        "20202",
        "20295",
        "11449",
        "10567",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "322",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا سعد بن حفص، قال حدثنا شيبان، عن يحيى، عن أبي سلمة، عن زينب ابنة أبي سلمة، حدثته أن أم سلمة قالت حضت وأنا مع النبي، صلى الله عليه وسلم في الخميلة، فانسللت فخرجت منها، فأخذت ثياب حيضتي فلبستها، فقال لي رسول الله صلى الله عليه وسلم ‏\"‏ أنفست ‏\"‏‏.‏ قلت نعم، فدعاني فأدخلني معه في الخميلة‏.‏ قالت وحدثتني أن النبي صلى الله عليه وسلم كان يقبلها وهو صائم، وكنت أغتسل أنا والنبي صلى الله عليه وسلم من إناء واحد من الجنابة‏.‏",
      "text_en": " Narrated Zainab bint Abi Salama:                     Um-Salama said, \"I got my menses while I was lying with the Prophet under a woolen sheet. So I slipped away, took the clothes for menses and put them on. Allah's Apostle said, 'Have you got your menses?' I replied, 'Yes.' Then he called me and took me with him under the woolen sheet.\" Um Salama further said, \"The Prophet used to kiss me while he was fasting. The Prophet and I used to take the bath of Janaba from a single pot.\"",
      "chain": [
        "35043",
        "20240",
        "11449",
        "10567",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "323",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا معاذ بن فضالة، قال حدثنا هشام، عن يحيى، عن أبي سلمة، عن زينب ابنة أبي سلمة، عن أم سلمة، قالت بينا أنا مع النبي، صلى الله عليه وسلم مضطجعة في خميلة حضت، فانسللت فأخذت ثياب حيضتي فقال ‏\"‏ أنفست ‏\"‏‏.‏ فقلت نعم‏.‏ فدعاني فاضطجعت معه في الخميلة‏.‏",
      "text_en": " Narrated Um Salama:                     While I was lying with the Prophet under a woolen sheet, I got my menses. I slipped away and put on the clothes for menses. The Prophet said, \"Have you got your menses?\" I replied, \"Yes.\" He called me and I slept with him under the woolen sheet.",
      "chain": [
        "30177",
        "20295",
        "20031",
        "10567",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "464",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن محمد بن عبد الرحمن بن نوفل، عن عروة، عن زينب بنت أبي سلمة، عن أم سلمة، قالت شكوت إلى رسول الله صلى الله عليه وسلم أني أشتكي‏.‏ قال ‏\"‏ طوفي من وراء الناس وأنت راكبة ‏\"‏‏.‏ فطفت ورسول الله صلى الله عليه وسلم يصلي إلى جنب البيت، يقرأ بالطور وكتاب مسطور‏.‏",
      "text_en": " Narrated Um Salama:                     I complained to Allah's Apostle that I was sick. He told me to perform the Tawaf behind the people while riding. So I did so and Allah's Apostle was praying beside the Ka`ba and reciting the Sura starting with \"Wat-tur wa kitabin mastur.\"",
      "chain": [
        "30355",
        "20001",
        "11105",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "837",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا إبراهيم بن سعد، حدثنا الزهري، عن هند بنت الحارث، أن أم سلمة  رضى الله عنها  قالت كان رسول الله صلى الله عليه وسلم إذا سلم قام النساء حين يقضي تسليمه، ومكث يسيرا قبل أن يقوم‏.‏ قال ابن شهاب فأرى  والله أعلم  أن مكثه لكى ينفذ النساء قبل أن يدركهن من انصرف من القوم‏.‏",
      "text_en": " Narrated Um Salama:                     Whenever Allah's Apostle finished his prayers with Taslim, the women would get up and he would stay on for a while in his place before getting up. Ibn Shihab said, \"I think (and Allah knows better), that the purpose of his stay was that the women might leave before the men who had finished their prayer. \"",
      "chain": [
        "20040",
        "20150",
        "11013",
        "11734",
        "56"
      ]
    },
    {
      "hadith_no": "850",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو الوليد، حدثنا إبراهيم بن سعد، حدثنا الزهري، عن هند بنت الحارث، عن أم سلمة، أن النبي صلى الله عليه وسلم كان إذا سلم يمكث في مكانه يسيرا‏.‏ قال ابن شهاب فنرى  والله أعلم  لكى ينفذ من ينصرف من النساء‏.‏ وقال ابن أبي مريم أخبرنا نافع بن يزيد، قال أخبرني جعفر بن ربيعة، أن ابن شهاب، كتب إليه قال حدثتني هند بنت الحارث الفراسية، عن أم سلمة، زوج النبي صلى الله عليه وسلم وكانت من صواحباتها قالت كان يسلم فينصرف النساء، فيدخلن بيوتهن من قبل أن ينصرف رسول الله صلى الله عليه وسلم‏.‏ وقال ابن وهب عن يونس عن ابن شهاب أخبرتني هند الفراسية‏.‏ وقال عثمان بن عمر أخبرنا يونس عن الزهري حدثتني هند الفراسية‏.‏ وقال الزبيدي أخبرني الزهري أن هند بنت الحارث القرشية أخبرته، وكانت تحت معبد بن المقداد  وهو حليف بني زهرة  وكانت تدخل على أزواج النبي صلى الله عليه وسلم‏.‏ وقال شعيب عن الزهري حدثتني هند القرشية‏.‏ وقال ابن أبي عتيق عن الزهري عن هند الفراسية‏.‏ وقال الليث حدثني يحيى بن سعيد حدثه عن ابن شهاب عن امرأة من قريش حدثته عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Um Salama:                     \"The Prophet after finishing the prayer with Taslim used to stay at his place for a while.\" Ibn Shihab said, \"I think (and Allah knows better), that he used to wait for the departure of the women who had prayed.\" Ibn Shihab wrote that he had heard it from Hind bint Al-Harith Al-Firasiya from Um Salama, the wife of the Prophet (Hind was from the companions of Um Salama) who said, \"When the Prophet finished the prayer with Taslim, the women would depart and enter their houses before Allah's Apostle departed.\"",
      "chain": [
        "20296",
        "20150",
        "11013",
        "11734",
        "56"
      ]
    },
    {
      "hadith_no": "870",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا يحيى بن قزعة، قال حدثنا إبراهيم بن سعد، عن الزهري، عن هند بنت الحارث، عن أم سلمة  رضى الله عنها  قالت كان رسول الله صلى الله عليه وسلم إذا سلم قام النساء حين يقضي تسليمه، ويمكث هو في مقامه يسيرا قبل أن يقوم‏.‏ قال نرى  والله أعلم  أن ذلك كان لكى ينصرف النساء قبل أن يدركهن أحد من الرجال‏.‏",
      "text_en": " Narrated Um Salama:                     Whenever Allah's Apostle completed the prayer with Taslim, the women used to get up immediately and Allah's Apostle would remain at his place for someone before getting up. (The sub-narrator (Az- Zuhri) said, \"We think, and Allah knows better, that he did so, so that the women might leave before men could get in touch with them).",
      "chain": [
        "30119",
        "20150",
        "11013",
        "11734",
        "56"
      ]
    },
    {
      "hadith_no": "875",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا يحيى بن قزعة، حدثنا إبراهيم بن سعد، عن الزهري، عن هند بنت الحارث، عن أم سلمة، قالت كان رسول الله صلى الله عليه وسلم إذا سلم قام النساء حين يقضي تسليمه، وهو يمكث في مقامه يسيرا قبل أن يقوم‏.‏ قالت نرى  والله أعلم  أن ذلك كان لكى ينصرف النساء قبل أن يدركهن الرجال‏.‏",
      "text_en": " Narrated Umm Salama:                      Whenever Allah's Messenger () completed the Salat with Taslim, the women used to get up immediately and Allah's Messenger ()  would remain at his place for sometime before getting up. The subnarrator (Az-Zuhri) said, \"We think, and Allah knows better, that he did so, so that the women might leave before the men could catch up with them.\"",
      "chain": [
        "30119",
        "20150",
        "11013",
        "11734",
        "56"
      ]
    },
    {
      "hadith_no": "1126",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا ابن مقاتل، أخبرنا عبد الله، أخبرنا معمر، عن الزهري، عن هند بنت الحارث، عن أم سلمة  رضى الله عنها  أن النبي صلى الله عليه وسلم استيقظ ليلة فقال ‏\"‏ سبحان الله ماذا أنزل الليلة من الفتنة، ماذا أنزل من الخزائن من يوقظ صواحب الحجرات، يا رب كاسية في الدنيا عارية في الآخرة ‏\"‏‏.‏",
      "text_en": " Narrated Um Salama:                     One night the Prophet got up and said, \"Subhan Allah! How many afflictions Allah has revealed tonight and how many treasures have been sent down (disclosed). Go and wake the sleeping lady occupants of these dwellings up (for prayers), perhaps a well dressed in this world may be naked in the Hereafter.\"",
      "chain": [
        "30118",
        "20025",
        "20115",
        "11013",
        "11734",
        "56"
      ]
    },
    {
      "hadith_no": "1644",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا إسماعيل، حدثنا مالك، عن محمد بن عبد الرحمن بن نوفل، عن عروة بن الزبير، عن زينب بنت أبي سلمة، عن أم سلمة  رضى الله عنها  زوج النبي صلى الله عليه وسلم قالت شكوت إلى رسول الله صلى الله عليه وسلم أني أشتكي‏.‏ فقال ‏\"‏ طوفي من وراء الناس، وأنت راكبة ‏\"‏‏.‏ فطفت ورسول الله صلى الله عليه وسلم حينئذ يصلي إلى جنب البيت، وهو يقرأ ‏{‏والطور * وكتاب مسطور‏}‏",
      "text_en": " Narrated Um Salama:                     (the wife of the Prophet) I informed Allah's Apostle that I was ill. So he said, \"Perform the Tawaf while riding behind the people.\" I did so, and at that time the Prophet was praying beside the Ka`ba and reciting Surat-at-Tur.",
      "chain": [
        "30103",
        "20001",
        "11105",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "1651",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن محمد بن عبد الرحمن، عن عروة، عن زينب، عن أم سلمة  رضى الله عنها  شكوت إلى رسول الله صلى الله عليه وسلم‏.‏ وحدثني محمد بن حرب حدثنا أبو مروان يحيى بن أبي زكرياء الغساني عن هشام عن عروة عن أم سلمة  رضى الله عنها  زوج النبي صلى الله عليه وسلم أن رسول الله صلى الله عليه وسلم قال وهو بمكة، وأراد الخروج، ولم تكن أم سلمة طافت بالبيت وأرادت الخروج، فقال لها رسول الله صلى الله عليه وسلم ‏\"‏ إذا أقيمت صلاة الصبح فطوفي على بعيرك، والناس يصلون ‏\"‏‏.‏ ففعلت ذلك، فلم تصل حتى خرجت‏.‏",
      "text_en": " Narrated Um Salama:                     (the wife of the Prophet) I informed Allah's Apostle (about my illness). (Through other sub-narrators, Um Salama narrated that when Allah's Apostle was at Mecca and had just decided to leave (Mecca) while she had not yet done Tawaf of the Ka`ba (and after listening to her). The Prophet said, \"When the morning prayer is established, perform the Tawaf on your camel while the people are in prayer.\" So she did the same and did not offer the two rak`at of Tawaf until she came out of the Mosque.",
      "chain": [
        "30355",
        "20001",
        "11105",
        "10511",
        "57",
        "56"
      ]
    },
    {
      "hadith_no": "1658",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد الله بن مسلمة، حدثنا مالك، عن محمد بن عبد الرحمن بن نوفل، عن عروة، عن زينب ابنة أم سلمة، عن أم سلمة  رضى الله عنها  قالت شكوت إلى رسول الله صلى الله عليه وسلم أني أشتكي‏.‏ فقال ‏\"‏ طوفي من وراء الناس وأنت راكبة ‏\"‏‏.‏ فطفت ورسول الله صلى الله عليه وسلم يصلي إلى جنب البيت، وهو يقرأ بالطور وكتاب مسطور‏.‏",
      "text_en": " Narrated Um Salama:                     I informed Allah's Apostle that I was sick. He said, \"Perform Tawaf (of the Ka`ba) while riding behind the people.\" So, I performed the Tawaf while Allah's Apostle was offering the prayer beside the Ka`ba and was reciting Surat-at-Tur.",
      "chain": [
        "20164",
        "20001",
        "11105",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "1910",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا أبو عاصم، عن ابن جريج، عن يحيى بن عبد الله بن صيفي، عن عكرمة بن عبد الرحمن، عن أم سلمة  رضى الله عنها  أن النبي صلى الله عليه وسلم آلى من نسائه شهرا، فلما مضى تسعة وعشرون يوما غدا أو راح فقيل له إنك حلفت أن لا تدخل شهرا‏.‏ فقال ‏\"‏ إن الشهر يكون تسعة وعشرين يوما ‏\"‏‏.‏",
      "text_en": " Narrated Um Salama:                     The Prophet vowed to keep aloof from his wives for a period of one month, and after the completion of 29 days he went either in the morning or in the afternoon to his wives. Someone said to him \"You vowed that you would not go to your wives for one month.\" He replied, \"The month is of 29 days.\"",
      "chain": [
        "20241",
        "11070",
        "11448",
        "56"
      ]
    },
    {
      "hadith_no": "1929",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن هشام بن أبي عبد الله، حدثنا يحيى بن أبي كثير، عن أبي سلمة، عن زينب ابنة أم سلمة، عن أمها  رضى الله عنهما  قالت بينما أنا مع، رسول الله صلى الله عليه وسلم في الخميلة إذ حضت فانسللت، فأخذت ثياب حيضتي فقال ‏\"‏ ما لك أنفست ‏\"‏‏.‏ قلت نعم‏.‏ فدخلت معه في الخميلة، وكانت هي ورسول الله صلى الله عليه وسلم يغتسلان من إناء واحد، وكان يقبلها وهو صائم‏.‏",
      "text_en": " Narrated Zainab:                     (daughter of Um Salama) that her mother said, \"While I was (lying) with Allah's Apostle underneath a woolen sheet, I got the menstruation, and then slipped away and put on the clothes (which I used to wear) in menses. He asked, \"What is the matter? Did you get your menses?\" I replied in the affirmative and then entered underneath that woolen sheet. I and Allah's Apostle used to take a bath from one water pot and he used to kiss me while he was fasting.\"",
      "chain": [
        "30175",
        "20031",
        "11449",
        "10567",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "2680",
      "source": " Sahih Bukhari ",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن هشام بن عروة، عن أبيه، عن زينب، عن أم سلمة  رضى الله عنها  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إنكم تختصمون إلى، ولعل بعضكم ألحن بحجته من بعض، فمن قضيت له بحق أخيه شيئا بقوله، فإنما أقطع له قطعة من النار فلا يأخذها ‏\"‏‏.‏",
      "text_en": " Narrated Um Salama:                     Once Allah's Apostle said, \"You people present your cases to me and some of you may be more eloquent and persuasive in presenting their argument. So, if I give some one's right to another (wrongly) because of the latter's (tricky) presentation of the case, I am really giving him a piece of fire; so he should not take it.\"",
      "chain": [
        "20164",
        "20001",
        "11065",
        "10511",
        "57",
        "56"
      ]
    },
    {
      "hadith_no": "3328",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن هشام بن عروة، عن أبيه، عن زينب بنت أبي سلمة، عن أم سلمة، أن أم سليم، قالت يا رسول الله، إن الله لا يستحيي من الحق، فهل على المرأة الغسل إذا احتلمت قال ‏\"‏ نعم، إذا رأت الماء ‏\"‏‏.‏ فضحكت أم سلمة، فقالت تحتلم المرأة فقال رسول الله صلى الله عليه وسلم ‏\"‏ فبما يشبه الولد ‏\"‏‏.‏",
      "text_en": " Narrated Abu Salama:                     Um Salama said, \"Um Sulaim said, 'O Allah's Apostle! Allah does not refrain from saying the truth! Is it obligatory for a woman to take a bath after she gets nocturnal discharge?' He said, 'Yes, if she notices the water (i.e. discharge).' Um Salama smiled and said, 'Does a woman get discharge?' Allah's Apostle said. 'Then why does a child resemble (its mother)?\"",
      "chain": [
        "30175",
        "20031",
        "11065",
        "10511",
        "244",
        "56",
        "83"
      ]
    },
    {
      "hadith_no": "3642",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "وعن الزهري، حدثتني هند بنت الحارث، أن أم سلمة، قالت استيقظ النبي صلى الله عليه وسلم فقال ‏\"‏ سبحان الله، ماذا أنزل من الخزائن وماذا أنزل من الفتن ‏\"‏‏.‏",
      "text_en": " Um Salama:                     The Prophet woke up and said, \"Glorified be Allah: What great (how many) treasures have been sent down, and what great (how many ) afflictions have been sent down!\"",
      "chain": [
        "11013",
        "11734",
        "56"
      ]
    },
    {
      "hadith_no": "4902",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن محمد بن عبد الرحمن بن نوفل، عن عروة، عن زينب ابنة أبي سلمة، عن أم سلمة، قالت شكوت إلى رسول الله صلى الله عليه وسلم أني أشتكي فقال ‏\"‏ طوفي من وراء الناس، وأنت راكبة ‏\"‏‏.‏ فطفت ورسول الله صلى الله عليه وسلم يصلي إلى جنب البيت يقرأ بالطور وكتاب مسطور‏.‏",
      "text_en": " Narrated Um Salama:                     I complained to Allah's Apostle that I was sick, so he said, \"Perform the Tawaf (of Ka`ba at Mecca) while riding behind the people (who are performing the Tawaf on foot).\" So I performed the Tawaf while Allah's Apostle was offering the prayer by the side of the Ka`ba and was reciting: 'By the Mount (Saini) and by a Decree Inscribed.'",
      "chain": [
        "30355",
        "20001",
        "11105",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "5257",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا أبو عاصم، عن ابن جريج،‏.‏ وحدثني محمد بن مقاتل، أخبرنا عبد الله، أخبرنا ابن جريج، قال أخبرني يحيى بن عبد الله بن صيفي، أن عكرمة بن عبد الرحمن بن الحارث، أخبره أن أم سلمة أخبرته أن النبي صلى الله عليه وسلم حلف لا يدخل على بعض أهله شهرا، فلما مضى تسعة وعشرون يوما غدا عليهن أو راح فقيل له يا نبي الله حلفت أن لا تدخل عليهن شهرا قال ‏\"‏ إن الشهر يكون تسعة وعشرين يوما ‏\"‏‏.‏",
      "text_en": " Narrated Um Salama:                     The Prophet took an oath that he would not enter upon some of his wives for one month. But when twenty nine days had elapsed, he went to them in the morning or evening. It was said to him, \"O Allah's Prophet! You had taken an oath that you would not enter upon them for one month.\" He replied, \"The month can be of twenty nine days.\"",
      "chain": [
        "20241",
        "30118",
        "20025",
        "11070",
        "11448",
        "56"
      ]
    },
    {
      "hadith_no": "5290",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا عبدة، عن هشام بن عروة، عن أبيه، عن زينب ابنة أم سلمة، عن أم سلمة، أن النبي صلى الله عليه وسلم كان عندها وفي البيت مخنث، فقال المخنث لأخي أم سلمة عبد الله بن أبي أمية إن فتح الله عليكم الطائف غدا أدلك على ابنة غيلان، فإنها تقبل بأربع وتدبر بثمان‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ لا يدخلن هذا عليكن ‏\"‏‏.‏",
      "text_en": " Narrated Um Salama:                     that while the Prophet was with her, there was an effeminate man in the house. The effeminate man said to Um Salama's brother, `Abdullah bin Abi Umaiyya, \"If Allah should make you conquer Ta'if tomorrow, I recommend that you take the daughter of Ghailan (in marriage) for (she is so fat) that she shows four folds of flesh when facing you and eight when she turns her back.\" Thereupon the Prophet said (to us), \"This (effeminate man) should not enter upon you (anymore).",
      "chain": [
        "30203",
        "20337",
        "11065",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "5392",
      "source": " Sahih Bukhari ",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا آدم بن أبي إياس، حدثنا شعبة، حدثنا حميد بن نافع، عن زينب ابنة أم سلمة، عن أمها، أن امرأة، توفي زوجها فخشوا على عينيها فأتوا رسول الله صلى الله عليه وسلم فاستأذنوه في الكحل فقال ‏\"‏ لا تكحل قد كانت إحداكن تمكث في شر أحلاسها أو شر بيتها، فإذا كان حول فمر كلب رمت ببعرة، فلا حتى تمضي أربعة أشهر وعشر ‏\"‏‏.‏",
      "text_en": "",
      "chain": [
        "20404",
        "20020",
        "11157",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "5423",
      "source": " Sahih Bukhari ",
      "chapter": "Supporting the Family - كتاب النفقات",
      "chapter_no": "69",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا وهيب، أخبرنا هشام، عن أبيه، عن زينب ابنة أبي سلمة، عن أم سلمة، قلت يا رسول الله هل لي من أجر في بني أبي سلمة أن أنفق عليهم، ولست بتاركتهم هكذا وهكذا، إنما هم بني‏.‏ قال ‏\"‏ نعم لك أجر ما أنفقت عليهم ‏\"‏‏.‏",
      "text_en": " Narrated Um Salama:                     I said, \"O Allah's Apostle! Shall I get a reward (in the Hereafter) if I spend on the children of Abu Salama and do not leave them like this and like this (i.e., poor) but treat them like my children?\" The Prophet said, \"Yes, you will be rewarded for that which you will spend on them.\"",
      "chain": [
        "20040",
        "20299",
        "11065",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "5768",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن شعبة، قال حدثني حميد بن نافع، عن زينب، عن أم سلمة  رضى الله عنها  أن امرأة توفي زوجها فاشتكت عينها، فذكروها للنبي صلى الله عليه وسلم وذكروا له الكحل، وأنه يخاف على عينها، فقال ‏\"‏ لقد كانت إحداكن تمكث في بيتها في شر أحلاسها  أو في أحلاسها في شر بيتها  فإذا مر كلب رمت بعرة، فلا، أربعة أشهر وعشرا ‏\"‏‏.‏",
      "text_en": " Narrated Um Salama:                     The husband of a lady died and her eyes became sore and the people mentioned her story to the Prophet They asked him whether it was permissible for her to use kohl as her eyes were exposed to danger. He said, \"Previously, when one of you was bereaved by a husband she would stay in her dirty clothes in a bad unhealthy house (for one year), and when a dog passed by, she would throw a globe of dung. No, (she should observe the prescribed period Idda) for four months and ten days.'",
      "chain": [
        "30175",
        "20031",
        "20020",
        "11157",
        "57",
        "56"
      ]
    },
    {
      "hadith_no": "5798",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثني محمد بن خالد، حدثنا محمد بن وهب بن عطية الدمشقي، حدثنا محمد بن حرب، حدثنا محمد بن الوليد الزبيدي، أخبرنا الزهري، عن عروة بن الزبير، عن زينب ابنة أبي سلمة، عن أم سلمة  رضى الله عنها  أن النبي صلى الله عليه وسلم رأى في بيتها جارية في وجهها سفعة فقال ‏\"‏ استرقوا لها، فإن بها النظرة ‏\"‏‏.‏ وقال عقيل عن الزهري أخبرني عروة عن النبي صلى الله عليه وسلم‏.‏ تابعه عبد الله بن سالم عن الزبيدي‏.‏",
      "text_en": " Narrated Um Salama:                     that the Prophet saw in her house a girl whose face had a black spot. He said. \"She is under the effect of an evil eye; so treat her with a Ruqya.\"",
      "chain": [
        "38496",
        "30287",
        "30373",
        "20459",
        "11013",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "5905",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا هشام، أخبرنا معمر، عن الزهري، أخبرتني هند بنت الحارث، عن أم سلمة، قالت استيقظ النبي صلى الله عليه وسلم من الليل وهو يقول ‏\"‏ لا إله إلا الله، ماذا أنزل الليلة من الفتنة، ماذا أنزل من الخزائن، من يوقظ صواحب الحجرات، كم من كاسية في الدنيا عارية يوم القيامة ‏\"‏‏.‏ قال الزهري وكانت هند لها أزرار في كميها بين أصابعها‏.‏",
      "text_en": " Narrated Um Salama:                     One night the Prophet woke up, saying, \"None has the right to be worshipped but Allah! How many afflictions have been sent down tonight, and how many treasures have been sent down (disclosed)! Who will go and wake up (for prayers) the lady dwellers of these rooms? Many well dressed soul (people) in this world, will be naked on the Day of Resurrection.\"",
      "chain": [
        "30351",
        "20295",
        "20115",
        "11013",
        "11734",
        "56"
      ]
    },
    {
      "hadith_no": "5948",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا مالك بن إسماعيل، حدثنا زهير، حدثنا هشام بن عروة، أن عروة، أخبره أن زينب ابنة أبي سلمة أخبرته أن أم سلمة أخبرتها أن النبي صلى الله عليه وسلم كان عندها وفي البيت مخنث، فقال لعبد الله أخي أم سلمة يا عبد الله إن فتح لكم غدا الطائف، فإني أدلك على بنت غيلان، فإنها تقبل بأربع وتدبر بثمان‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ لا يدخلن هؤلاء عليكن ‏\"‏‏.‏ قال أبو عبد الله تقبل بأربع وتدبر بثمان يعني أربع عكن بطنها، فهى تقبل بهن، وقوله وتدبر بثمان‏.‏ يعني أطراف هذه العكن الأربع، لأنها محيطة بالجنبين حتى لحقت وإنما قال بثمان‏.‏ ولم يقل بثمانية‏.‏ وواحد الأطراف وهو ذكر، لأنه لم يقل ثمانية أطراف‏.‏",
      "text_en": " Narrated Um Salama:                     that once the Prophet was in her house, and an effeminate man was there too. The effeminate man said to `Abdullah, (Um Salama's brother) \"0 `Abdullah! If Ta'if should be conquered tomorrow, I recommend you the daughter of Ghailan, for she is so fat that she has four curves in the front (of her belly) and eight at the back.\" So the Prophet said (to his wives) \"These effeminate (men) should not enter upon you (your houses).",
      "chain": [
        "20357",
        "20321",
        "11065",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "6158",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا يحيى، عن هشام، قال أخبرني أبي، عن زينب بنت أم سلمة، عن أم سلمة، أن أم سليم، قالت يا رسول الله إن الله لا يستحي من الحق، هل على المرأة غسل إذا احتلمت قال ‏\"‏ نعم إذا رأت الماء ‏\"‏‏.‏ فضحكت أم سلمة فقالت أتحتلم المرأة فقال النبي صلى الله عليه وسلم ‏\"‏ فبم شبه الولد ‏\"‏‏.‏",
      "text_en": " Narrated Zainab bint Um Salama:                     Um Sulaim said, \"O Allah's Apostle! Verily Allah is not shy of (telling you) the truth. Is it essential for a woman to take a bath after she had a wet dream (nocturnal sexual discharge)?\" He said, \"Yes, if she notices discharge. On that Um Salama laughed and said, \"Does a woman get a (nocturnal sexual) discharge?\" He said, \"How then does (her) son resemble her (his mother)?\"",
      "chain": [
        "30170",
        "20031",
        "11065",
        "10511",
        "244",
        "56",
        "83"
      ]
    },
    {
      "hadith_no": "6189",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن هشام بن عروة، عن أبيه، عن زينب ابنة أبي سلمة، عن أم سلمة  رضى الله عنها  قالت جاءت أم سليم إلى رسول الله صلى الله عليه وسلم فقالت يا رسول الله إن الله لا يستحي من الحق، فهل على المرأة غسل إذا احتلمت فقال ‏\"‏ نعم إذا رأت الماء ‏\"‏‏.‏",
      "text_en": " Narrated Um Salama:                     Um Sulaim came to Allah's Apostle and said, \"O Allah's Apostle! Verily, Allah does not feel shy to tell the truth. If a woman gets a nocturnal sexual discharge (has a wet dream), is it essential for her to take a bath? He replied, \"Yes if she notices a discharge.\"",
      "chain": [
        "30103",
        "20001",
        "11065",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "6289",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، حدثتني هند بنت الحارث، أن أم سلمة  رضى الله عنها  قالت استيقظ النبي صلى الله عليه وسلم فقال ‏\"‏ سبحان الله ماذا أنزل من الخزائن، وماذا أنزل من الفتن، من يوقظ صواحب الحجر  يريد به أزواجه  حتى يصلين، رب كاسية في الدنيا، عارية في الآخرة ‏\"‏‏.‏ وقال ابن أبي ثور عن ابن عباس، عن عمر، قال قلت للنبي صلى الله عليه وسلم طلقت نساءك قال ‏\"‏ لا ‏\"‏‏.‏ قلت الله أكبر‏.‏",
      "text_en": " Narrated Um Salama:                     (One night) the Prophet woke up and said, \"Subhan Allah ! How many treasures have been (disclosed) sent down! And how many afflictions have been descended! Who will go and wake the sleeping ladyoccupants up of these dwellings (for praying)?\" (He meant by this his wives.) The Prophet added, \"A well-dressed soul (person) in this world may be naked in the \"Hereafter.\" `Umar said, \"I asked the Prophet, 'Have you divorced your wives?' He said, 'No.' I said, 'Allahu Akbar.' \"",
      "chain": [
        "30330",
        "20428",
        "11013",
        "11734",
        "56"
      ]
    },
    {
      "hadith_no": "7053",
      "source": " Sahih Bukhari ",
      "chapter": "Tricks - كتاب الحيل",
      "chapter_no": "91",
      "text_ar": "حدثنا محمد بن كثير، عن سفيان، عن هشام، عن عروة، عن زينب ابنة أم سلمة، عن أم سلمة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إنما أنا بشر، وإنكم تختصمون، ولعل بعضكم أن يكون ألحن بحجته من بعض، وأقضي له على نحو ما أسمع، فمن قضيت له من حق أخيه شيئا، فلا يأخذ، فإنما أقطع له قطعة من النار ‏\"‏‏.‏",
      "text_en": " Narrated Um Salama:                     The Prophet said, \"I am only a human being, and you people have disputes. May be some one amongst you can present his case in a more eloquent and convincing manner than the other, and I give my judgment in his favor according to what I hear. Beware! If ever I give (by error) somebody something of his brother's right then he should not take it as I have only, given him a piece of Fire.\" (See Hadith No. 638. Vol. 3)",
      "chain": [
        "28531",
        "20012",
        "11065",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "7257",
      "source": " Sahih Bukhari ",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن هشام، عن أبيه، عن زينب ابنة أبي سلمة، عن أم سلمة  رضى الله عنها  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إنما أنا بشر، وإنكم تختصمون إلى، ولعل بعضكم أن يكون ألحن بحجته من بعض فأقضي نحو ما أسمع، فمن قضيت له بحق أخيه شيئا فلا يأخذه، فإنما أقطع له قطعة من النار ‏\"‏‏.‏",
      "text_en": " Narrated Um Salama:                     Allah's Apostle said, \"I am only a human being, and you people (opponents) come to me with your cases; and it may be that one of you can present his case eloquently in a more convincing way than the other, and I give my verdict according to what I hear. So if ever I judge (by error) and give the right of a brother to his other (brother) then he (the latter) should not take it, for I am giving him only a piece of Fire.\" (See Hadith No. 638, Vol. 3).",
      "chain": [
        "20164",
        "20001",
        "11065",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "296",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا معاذ بن هشام، حدثني أبي، عن يحيى بن أبي كثير، حدثنا أبو سلمة بن عبد الرحمن، أن زينب بنت أم سلمة، حدثته أن أم سلمة حدثتها قالت، بينما أنا مضطجعة، مع رسول الله صلى الله عليه وسلم في الخميلة إذ حضت فانسللت فأخذت ثياب حيضتي فقال لي رسول الله صلى الله عليه وسلم ‏\"‏ أنفست ‏\"‏ ‏.‏ قلت نعم ‏.‏ فدعاني فاضطجعت معه في الخميلة ‏.‏ قالت وكانت هي ورسول الله صلى الله عليه وسلم يغتسلان في الإناء الواحد من الجنابة ‏.‏",
      "text_en": " Umm Salama reported:                      While I was lying with the Messenger of Allah (may peace be upon him) in a bed cover I menstruated, so I slipped away and I took up the clothes (which I wore) in menses. Upon this the Messenger of Allah (may peace be upon him) said: Have you menstruated? I said: Yes. He called me and I lay down",
      "chain": [
        "30170",
        "20287",
        "20295",
        "11449",
        "10567",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "313",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثنا يحيى بن يحيى التميمي، أخبرنا أبو معاوية، عن هشام بن عروة، عن أبيه، عن زينب بنت أبي سلمة، عن أم سلمة، قالت جاءت أم سليم إلى النبي صلى الله عليه وسلم فقالت يا رسول الله إن الله لا يستحيي من الحق فهل على المرأة من غسل إذا احتلمت فقال رسول الله صلى الله عليه وسلم ‏\"‏ نعم إذا رأت الماء ‏\"‏ ‏.‏ فقالت أم سلمة يا رسول الله وتحتلم المرأة فقال ‏\"‏ تربت يداك فبم يشبهها ولدها ‏\"‏ ‏.‏",
      "text_en": " Umm Salama reported:                      Umm Sulaim went to the Apostle of Allah (may peace be upon him) and said: Apostle of Allah, Allah is not ashamed of the truth. Is bathing necessary for a woman when she has a sexual dream? Upon this the Messenger of Allah (may peace be upon him) said: Yes, when she sees the liquid (vaginal secretion). Umm Salama said: Messenger of Allah, does a woman have sexual dream? He (the Holy Prophet) said: Let your hand be covered with dust, in what way does her child resemble her?",
      "chain": [
        "30399",
        "20354",
        "11065",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "324",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا معاذ بن هشام، قال حدثني أبي، عن يحيى بن أبي كثير، حدثنا أبو سلمة بن عبد الرحمن، أن زينب بنت أم سلمة، حدثته أن أم سلمة حدثتها قالت، كانت هي ورسول الله صلى الله عليه وسلم يغتسلان في الإناء الواحد من الجنابة ‏.‏",
      "text_en": " Zainab bint Umm Salama (the wife of the Holy Prophet) reported that Umm Salama and the Messenger of Allah (may peace be upon him) took a bath from the same vessel.",
      "chain": [
        "30170",
        "20287",
        "20295",
        "11449",
        "10567",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "330",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعمرو الناقد، وإسحاق بن إبراهيم، وابن أبي عمر، كلهم عن ابن عيينة، قال إسحاق أخبرنا سفيان، عن أيوب بن موسى، عن سعيد بن أبي سعيد المقبري، عن عبد الله بن رافع، مولى أم سلمة عن أم سلمة، قالت قلت يا رسول الله إني امرأة أشد ضفر رأسي فأنقضه لغسل الجنابة قال ‏\"‏ لا إنما يكفيك أن تحثي على رأسك ثلاث حثيات ثم تفيضين عليك الماء فتطهرين ‏\"‏ ‏.‏",
      "text_en": " Umm Salama reported:                      I said: Messenger of Allah, I am a woman who has closely plaited hair on my head; should I undo it for taking a bath, because of sexual intercourse? He (the Holy Prophet) said: No, it is enough for you to throw three handfuls of water on your head and then pour water over yourself, and you shall be purified.",
      "chain": [
        "30201",
        "30263",
        "30123",
        "30421",
        "20005",
        "30312",
        "20005",
        "11241",
        "11168",
        "11864",
        "56"
      ]
    },
    {
      "hadith_no": "2165",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "حدثنا يحيى بن أيوب، وقتيبة، وابن، حجر جميعا عن إسماعيل بن جعفر، - قال ابن أيوب حدثنا إسماعيل، - أخبرني سعد بن سعيد، عن عمر بن كثير بن أفلح، عن ابن، سفينة عن أم سلمة، أنها قالت سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ما من مسلم تصيبه مصيبة فيقول ما أمره الله إنا لله وإنا إليه راجعون اللهم أجرني في مصيبتي وأخلف لي خيرا منها ‏.‏ إلا أخلف الله له خيرا منها ‏\"‏ ‏.‏ قالت فلما مات أبو سلمة قلت أى المسلمين خير من أبي سلمة أول بيت هاجر إلى رسول الله صلى الله عليه وسلم ‏.‏ ثم إني قلتها فأخلف الله لي رسول الله صلى الله عليه وسلم ‏.‏ قالت أرسل إلى رسول الله صلى الله عليه وسلم حاطب بن أبي بلتعة يخطبني له فقلت إن لي بنتا وأنا غيور ‏.‏ فقال ‏\"‏ أما ابنتها فندعو الله أن يغنيها عنها وأدعو الله أن يذهب بالغيرة ‏\"‏ ‏.‏",
      "text_en": " Umm Salama reported Allah's Messenger (may peace be upon him) as saying:                      If any Muslim who suffers some calamity says, what Allah has commanded him,\" We belong to Allah and to Him shall we return; O Allah, reward me for my affliction and give me something better than it in exchange for it,\" Allah will give him something better than it in exchange. When Abu Salama died she said: What Muslim is better than Abu Salama whose family was the first to emigrate to the Messenger of Allah (may peace be upon him). I then said the words, and Allah gave me God's Messenger (may peace be upon him) in exchange. She said: The Messenger of Allah (may peace be upon him) sent Hatib b. Abu Balta'a to deliver me the message of marriage with him. I said to him: I have a daughter (as my dependant) and I am of jealous temperament. He (the Holy Prophet) said: So far as her daughter is concerned, we would supplicate Allah, that He may free her (of her responsibility) and I would also supplicate Allah to do away with (her) jealous (temperament).",
      "chain": [
        "20379",
        "30367",
        "20155",
        "11418",
        "10601",
        "56"
      ]
    },
    {
      "hadith_no": "2168",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا أبو معاوية، عن الأعمش، عن شقيق، عن أم سلمة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا حضرتم المريض أو الميت فقولوا خيرا فإن الملائكة يؤمنون على ما تقولون ‏\"‏ ‏.‏ قالت فلما مات أبو سلمة أتيت النبي صلى الله عليه وسلم فقلت يا رسول الله إن أبا سلمة قد مات قال ‏\"‏ قولي اللهم اغفر لي وله وأعقبني منه عقبى حسنة ‏\"‏ ‏.‏ قالت فقلت فأعقبني الله من هو خير لي منه محمدا صلى الله عليه وسلم ‏.‏",
      "text_en": " Umm Salama reported Allah's Messenger (may peace be upon him) as saying:                      Whenever you visit the sick or the dead, supplicate for good because angels say\" Amen\" to whatever you say. She added: When Abu Salama died, I went to the Apostle of Allah (may peace be upon him) and said: Messenger of Allah, Abu Salama has died. He told me to recite:\" O Allah! forgive me and him (Abu Salama) and give me a better substitute than he.\" So I said (this), and Allah gave me in exchange Muhammad, who is better for me than him (Abu Salama).",
      "chain": [
        "30201",
        "30216",
        "20354",
        "11060",
        "11353",
        "56"
      ]
    },
    {
      "hadith_no": "2169",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "حدثني زهير بن حرب، حدثنا معاوية بن عمرو، حدثنا أبو إسحاق الفزاري، عن خالد الحذاء، عن أبي قلابة، عن قبيصة بن ذؤيب، عن أم سلمة، قالت دخل رسول الله صلى الله عليه وسلم على أبي سلمة وقد شق بصره فأغمضه ثم قال ‏\"‏ إن الروح إذا قبض تبعه البصر ‏\"‏ ‏.‏ فضج ناس من أهله فقال ‏\"‏ لا تدعوا على أنفسكم إلا بخير فإن الملائكة يؤمنون على ما تقولون ‏\"‏ ‏.‏ ثم قال ‏\"‏ اللهم اغفر لأبي سلمة وارفع درجته في المهديين واخلفه في عقبه في الغابرين واغفر لنا وله يا رب العالمين وافسح له في قبره ‏.‏ ونور له فيه ‏\"‏ ‏.‏",
      "text_en": " Umm Salama reported:                      The Messenger of Allah (may peace be upon came to Abu Salama (as he died). His eyes were fixedly open. He closed them, and then said: When the soul is taken away the sight follows it. Some of the people of his family wept and wailed. So he said: Do not supplicate for yourselves anything but good, for angels say\" Amen\" to what you say. He then said: O Allah, forgive Abu Salama, raise his degree among those who are rightly guided, grant him a successor in his descendants who remain. Forgive us and him, O Lord of the Universe, and make his grave spacious, and grant him light in it.",
      "chain": [
        "30022",
        "20389",
        "20405",
        "11282",
        "11047",
        "56"
      ]
    },
    {
      "hadith_no": "2367",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا أبو كريب، محمد بن العلاء حدثنا أبو أسامة، حدثنا هشام، عن أبيه، عن زينب بنت أبي سلمة، عن أم سلمة، قالت قلت يا رسول الله هل لي أجر في بني أبي سلمة أنفق عليهم ولست بتاركتهم هكذا وهكذا إنما هم بني ‏.‏ فقال ‏\"‏ نعم لك فيهم أجر ما أنفقت عليهم ‏\"‏ ‏.‏",
      "text_en": " Umm Salama said:                      I asked the Messenger of Allah (may peace be upon him) whether there is a reward for me if I spend oh Abu Salama's sons, and I am not going to abandon them in this state (of helplessness) for they are my sons. He (the Holy Prophet) said: Yes. For you is the reward for what you spend on them.",
      "chain": [
        "30216",
        "20318",
        "11065",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "2575",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثني هارون بن عبد الله، حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني يحيى بن عبد الله بن محمد بن صيفي، أن عكرمة بن عبد الرحمن بن الحارث، أخبره أن أم سلمة - رضى الله عنها - أخبرته أن النبي صلى الله عليه وسلم حلف أن لا يدخل على بعض أهله شهرا فلما مضى تسعة وعشرون يوما غدا عليهم - أو راح - فقيل له حلفت يا نبي الله أن لا تدخل علينا شهرا ‏.‏ قال ‏\"‏ إن الشهر يكون تسعة وعشرين يوما ‏\"‏ ‏.‏",
      "text_en": " Umm Salama (Allah be pleased with him) reported that the Apostle of Allah (may peace be upon him) took an oath that he would not go to some of his wives for the whole of the month. When twenty-nine days bad passed he (the Holy Prophet) went to them in the morning or in the evening. Upon this it was said to him:                      Apostle of Allah, you took an oath that you would not come to us for a month, whereupon he said: The month may also consist of twenty-nine days.",
      "chain": [
        "30524",
        "20381",
        "11070",
        "11448",
        "56"
      ]
    },
    {
      "hadith_no": "2650",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا أحمد بن عثمان النوفلي، حدثنا أبو عاصم، حدثنا ابن جريج، أخبرني محمد بن يوسف، عن سليمان بن يسار، أنه سأل أم سلمة - رضى الله عنها - عن الرجل يصبح جنبا أيصوم قالت كان رسول الله صلى الله عليه وسلم يصبح جنبا من غير احتلام ثم يصوم ‏.‏",
      "text_en": " Sulaiman b. Yasar reported that he asked Umm Salama whether a person (who gets up) in the morning in a state of junub should observe fast. She said:                      The Messenger of Allah (may peace be upon him) (at times) got up in the morning in a state of junub, not because of sexual dreams (but on account of intercourse at night), and then observed fast.",
      "chain": [
        "30185",
        "20241",
        "11070",
        "30388",
        "11005",
        "56"
      ]
    },
    {
      "hadith_no": "3137",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن محمد بن عبد الرحمن بن نوفل، عن عروة، عن زينب بنت أبي سلمة، عن أم سلمة، أنها قالت شكوت إلى رسول الله صلى الله عليه وسلم أني أشتكي فقال ‏\"‏ طوفي من وراء الناس وأنت راكبة ‏\"‏ ‏.‏ قالت فطفت ورسول الله صلى الله عليه وسلم حينئذ يصلي إلى جنب البيت وهو يقرأ ب ‏{‏ الطور * وكتاب مسطور‏}‏ ‏.‏",
      "text_en": " Umm Salama reported:                      I made a complaint to Allah's Messenger (may peace be upon him) of my ailment, whereupon be said: Circumambulate behind the people while riding. She said: So I circumambulated and Allah's Messenger (may peace be upon him) was at that time praying towards the side of the House and he was reciting al-Tur and a Book Inscribed (i. e. Sura Iii. of the Qur'un).",
      "chain": [
        "30399",
        "11105",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "3694",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن حاتم، ويعقوب بن إبراهيم، - واللفظ لأبي بكر - قالوا حدثنا يحيى بن سعيد، عن سفيان، عن محمد بن أبي بكر، عن عبد الملك، بن أبي بكر بن عبد الرحمن بن الحارث بن هشام عن أبيه، عن أم سلمة، أن رسول الله صلى الله عليه وسلم لما تزوج أم سلمة أقام عندها ثلاثا وقال ‏\"‏ إنه ليس بك على أهلك هوان إن شئت سبعت لك وإن سبعت لك سبعت لنسائي ‏\"‏ ‏.",
      "text_en": " 'Abd al-Malik b. Abu Bakr b. Abd al-Rahman b. al-Harith b. Hisham reported on the authority of his father from Umm Salama (Allah be pleased with her) that when Allah's Messenger (may peace be upon him) married Umm Salama, he stayed with her for three nights, and said:                      There is no lack of estimation on the part of your husband for you. If you wish I can stay with you for a week, but in case I stay with you for a week, then I shall have to stay for a week with all my wives.",
      "chain": [
        "30201",
        "38487",
        "20184",
        "11062",
        "20012",
        "11214",
        "11239",
        "56"
      ]
    },
    {
      "hadith_no": "3698",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "حدثني أبو كريب، محمد بن العلاء حدثنا حفص، - يعني ابن غياث - عن عبد، الواحد بن أيمن عن أبي بكر بن عبد الرحمن بن الحارث بن هشام، عن أم سلمة، ذكر أنصلى الله عليه وسلم تزوجها وذكر أشياء هذا فيه قال ‏\"‏ إن شئت أن أسبع لك وأسبع لنسائي وإن سبعت لك سبعت لنسائي ‏\"‏ ‏.‏",
      "text_en": " Umm Salama (Allah be pleased with her) reported that Allah's Messenger (may peace be upon him) married her, and he (the narrator) made mention of so many things in this connection (and one of them was this) that he said:                      If you desire that I spend a week with you, I shall have to spend a week with my (other) wives, and if spend a week with you, I shall have to spend a week with my (other) wives.",
      "chain": [
        "30216",
        "20317",
        "11560",
        "11003",
        "56"
      ]
    },
    {
      "hadith_no": "3806",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وعمرو الناقد، قالا حدثنا يزيد بن هارون، أخبرنا يحيى بن سعيد، عن حميد بن نافع، أنه سمع زينب بنت أبي سلمة، تحدث عن أم سلمة، وأم حبيبة تذكران أن امرأة أتت رسول الله صلى الله عليه وسلم فذكرت له أن بنتا لها توفي عنها زوجها فاشتكت عينها فهى تريد أن تكحلها فقال رسول الله صلى الله عليه وسلم ‏\"‏ قد كانت إحداكن ترمي بالبعرة عند رأس الحول وإنما هي أربعة أشهر وعشر ‏\"‏ ‏.‏",
      "text_en": " Zainab bint Abu Salama reported:                      Umm Salama and Umm Habiba (Allah be pleased with them) were talking with each other (and saying) that a woman came to Allah's Messenger (may peace be upon him) and mentioned to him that her daughter had lost her husband, and her eyes were sore and she wnted to use collyrium, whereupon Allah's Messenger (may peace be upon him) said: One among you used to throw dung at the end of a year, and now (this abstinence from adornment) is only for four months and ten days.",
      "chain": [
        "30201",
        "30263",
        "20472",
        "11062",
        "11157",
        "56"
      ]
    },
    {
      "hadith_no": "4570",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Judicial Decisions - كتاب الأقضية",
      "chapter_no": "31",
      "text_ar": "حدثنا يحيى بن يحيى التميمي، أخبرنا أبو معاوية، عن هشام بن عروة، عن أبيه، عن زينب بنت أبي سلمة، عن أم سلمة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ إنكم تختصمون إلى ولعل بعضكم أن يكون ألحن بحجته من بعض فأقضي له على نحو مما أسمع منه فمن قطعت له من حق أخيه شيئا فلا يأخذه فإنما أقطع له به قطعة من النار ‏\"‏ ‏.‏",
      "text_en": " Umm Salama reported Allah's Messenger (may peace be upon him) as saying:                      You bring to me, for (judgment) your disputes, some of you perhaps being more eloquent in their plea than others, so I give judgment on their behalf according to what I hear from them. (Bear in mind, in my judgment) if I slice off anything for him from the right of his brother, he should not accept that, for I sliced off for him a portion from the Hell.",
      "chain": [
        "30399",
        "20354",
        "11065",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "4906",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا هداب بن خالد الأزدي، حدثنا همام بن يحيى، حدثنا قتادة، عن الحسن، عن ضبة بن محصن، عن أم سلمة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ستكون أمراء فتعرفون وتنكرون فمن عرف برئ ومن أنكر سلم ولكن من رضي وتابع ‏\"‏ ‏.‏ قالوا أفلا نقاتلهم قال ‏\"‏ لا ما صلوا ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Umm Salama that the Messenger of Allah (may peace be upon him) said:                      In the near future there will be Amirs and you will like their good deeds and dislike their bad deeds. One who sees through their bad deeds (and tries to prevent their repetition by his band or through his speech), is absolved from blame, but one who hates their bad deeds (in the heart of his heart, being unable to prevent their recurrence by his hand or his tongue), is (also) fafe ( so far as God's wrath is concerned). But one who approves of their bad deeds and imitates them is spiritually ruined. People asked (the Holy Prophet): Shouldn't we fight against them? He replied: No, as long as they say their prayers.",
      "chain": [
        "20297",
        "11019",
        "11016",
        "56"
      ]
    },
    {
      "hadith_no": "4908",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثني أبو الربيع العتكي، حدثنا حماد، - يعني ابن زيد - حدثنا المعلى بن، زياد وهشام عن الحسن، عن ضبة بن محصن، عن أم سلمة، قالت قال رسول الله صلى الله عليه وسلم ‏.‏ بنحو ذلك غير أنه قال ‏\"‏ فمن أنكر فقد برئ ومن كره فقد سلم ‏\"‏ ‏.‏",
      "text_en": " Another version of the tradition narrated on the same authority attributes the same words to the Messenger of Allah (may peace be upon him) except that it replaces kariha with ankhara and vice versa.",
      "chain": [
        "20022",
        "11016",
        "56"
      ]
    }
  ],
  "total_hadiths": 216
}