{
  "id": "56",
  "name": "Umm Salamah ( أم سلمة بنت أبي أمية ( رضي الله عنها",
  "full_name": "Umm Salamah ( أم سلمة بنت أبي أمية ( رضي الله عنها",
  "grade": "Comp.(RA) [1st Generation]",
  "biography": {
    "birth": {
      "date_hijri": "25",
      "date_gregorian": "NA",
      "date_display": [
        "25 BH"
      ],
      "place": "Makkah"
    },
    "death": {
      "date_hijri": "62",
      "date_gregorian": "680",
      "date_display": null,
      "place": "Medinah",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah",
      "Medina"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ ع  -  صحابة ]",
      "Fiqh"
    ],
    "tags": [
      "Female",
      "Quraish",
      "B.Makhzum",
      "Abyssinia 1",
      "Abyssinia 2",
      "Mother of the Believers",
      "Emigrant",
      "Baqi'"
    ]
  },
  "parents": [],
  "spouses": [
    {
      "id": "101",
      "name": "Abu Salamah ( عبد الله بن عبد الأسد أبو سلمة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "siblings": [
    {
      "id": "81",
      "name": "Qaraybah bint Abi Umayyah al-Sugra ( قريبة بنت أبي أمية ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "2088",
      "name": "al-Muhajir bin Abi Umayyah ( المهاجر بن أبي أمية المخزومي ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "2089",
      "name": "Rayta bint Abi Umayyah ( ريطة بنت أبي أمية المخزومية ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "children": [
    {
      "id": "244",
      "name": "Zaynab bint Abi Salamah ( زينب بنت أبي سلمة ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "245",
      "name": "Salamah bin Abi Salamah ( سلمة بن أبي سلمة بن عبدالأسد ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "246",
      "name": "'Umar bin Abi Salamah ( عمر بن أبي سلمة بن عبد الأسد ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "247",
      "name": "Durrah bintt Abi Salamah ( درة بنت أبي سلمة بن عبدالأسد ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "students": [
    {
      "id": "244",
      "name": "Zaynab bint Abi Salamah ( زينب بنت أبي سلمة ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "246",
      "name": "'Umar bin Abi Salamah ( عمر بن أبي سلمة بن عبد الأسد ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "2086",
      "name": "'Amir bin Abi Umayyah ( عامر بن أبي أمية المخزومي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "19824",
      "name": "Nabhan Abu Yahya al-Makhzumi نبهان المخزومي أبو يحيى",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11005",
      "name": "Sulayman ibn Yasar سليمان بن يسار مولى ميمونة بنت الحارث",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10511",
      "name": "'Urwa ibn al-Zubayr عروة بن الزبير",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19004",
      "name": "Mus'ab bin 'Abdullah مصعب بن عبد الله بن أبي أمية",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11864",
      "name": "'Abdullah bin Rafa'i عبد الله بن رافع المخزومي أبو رافع",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19067",
      "name": "Naf' Mwla Umm Salmah نافع مولى أم سلمة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "438",
      "name": "Safinah ( سفينة مولى رسول الله صلى الله عليه وسلم ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "19466",
      "name": "Abu Kathir أبو كثير مولى أم سلمة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10737",
      "name": "Khayra Umm al-Hasan al-'Abbassri خيرة أم الحسن البصري",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "50",
      "name": "Usamah ibn Zayd ( أسامة بن زيد بن حارثة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11734",
      "name": "Hind bint al-Harith al-Farasiyya هند بنت الحارث الفراسية",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "2808",
      "name": "Barra bint Abi Tajra ( برة بنت أبي تجراة العبدرية ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "11113",
      "name": "Abu 'Uthman al-Nahdi عبد الرحمن بن مل - أبو عثمان النهدي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "10561",
      "name": "Humaid bin 'Abdur Rahman حميد بن عبد الرحمن بن عوف الزهرى",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "10567",
      "name": "Abu Salama bin 'Abdur Rahman أبو سلمة بن عبد الرحمن بن عوف",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11002",
      "name": "Sa'id ibn al-Musayyib سعيد بن المسيب بن حزن أبو محمد القرشي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11353",
      "name": "Shaqayq bin Salmah al-Asadi شقيق بن سلمة الأسدي أبو وائل الكوفي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11052",
      "name": "'Amir al-Sha'bi عامر الشعبي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "107",
      "name": "'Abdur Rahman bin Abi Bakr ( عبد الرحمن بن أبي بكر الصديق ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "448",
      "name": "'Abdur Rahman ibn al-Harith ( عبد الرحمن بن الحارث بن هشام ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11030",
      "name": "Ikramah bin 'Abdur Rahman عكرمة بن عبد الرحمن بن الحارث",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11003",
      "name": "Abu Bakr bin 'Abdur Rahman أبو بكر بن عبد الرحمن بن الحارث بن هشام",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11211",
      "name": "Karayb bin Abi Muslim كريب بن أبي مسلم الهاشمي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "5232",
      "name": "Qubaysa bin Zuwayb ( قبيصة بن ذؤيب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11014",
      "name": "Nafie' نافع مولى ابن عمر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "13144",
      "name": "Ya'la bin Mamulk يعلى بن مملك",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "115",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا صدقة، أخبرنا ابن عيينة، عن معمر، عن الزهري، عن هند، عن أم سلمة، وعمرو، ويحيى بن سعيد، عن الزهري، عن هند، عن أم سلمة، قالت استيقظ النبي صلى الله عليه وسلم ذات ليلة فقال ‏\"‏ سبحان الله ماذا أنزل الليلة من الفتن وماذا فتح من الخزائن أيقظوا صواحبات الحجر، فرب كاسية في الدنيا عارية في الآخرة ‏\"‏‏.‏",
      "text_en": " Narrated Um Salama:                     One night Allah's Apostle got up and said, \"Subhan Allah! How many afflictions have been descended tonight and how many treasures have been disclosed! Go and wake the sleeping lady occupants of these dwellings (his wives) up (for prayers). A well-dressed (soul) in this world may be naked in the Hereafter. \"",
      "chain": [
        "30343",
        "20005",
        "20115",
        "11013",
        "11734",
        "56",
        "11210",
        "11062",
        "11013",
        "11734",
        "56"
      ]
    },
    {
      "hadith_no": "130",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن سلام، قال أخبرنا أبو معاوية، قال حدثنا هشام، عن أبيه، عن زينب ابنة أم سلمة، عن أم سلمة، قالت جاءت أم سليم إلى رسول الله صلى الله عليه وسلم فقالت يا رسول الله إن الله لا يستحيي من الحق، فهل على المرأة من غسل إذا احتلمت قال النبي صلى الله عليه وسلم ‏\"‏ إذا رأت الماء ‏\"‏‏.‏ فغطت أم سلمة  تعني وجهها  وقالت يا رسول الله وتحتلم المرأة قال ‏\"‏ نعم تربت يمينك فبم يشبهها ولدها ‏\"‏‏.‏",
      "text_en": " Narrated Um Salama:                     Um-Sulaim came to Allah's Apostle and said, \"Verily, Allah is not shy of (telling you) the truth. Is it necessary for a woman to take a bath after she has a wet dream (nocturnal sexual discharge?) The Prophet replied, \"Yes, if she notices a discharge.\" Um Salama, then covered her face and asked, \"O Allah's Apostle! Does a woman get a discharge?\" He replied, \"Yes, let your right hand be in dust (An Arabic expression you say to a person when you contradict his statement meaning \"you will not achieve goodness\"), and that is why the son resembles his mother.\"",
      "chain": [
        "30376",
        "20354",
        "20295",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "298",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا المكي بن إبراهيم، قال حدثنا هشام، عن يحيى بن أبي كثير، عن أبي سلمة، أن زينب ابنة أم سلمة، حدثته أن أم سلمة حدثتها قالت، بينا أنا مع النبي، صلى الله عليه وسلم مضطجعة في خميصة إذ حضت، فانسللت فأخذت ثياب حيضتي قال ‏\"‏ أنفست ‏\"‏‏.‏ قلت نعم‏.‏ فدعاني فاضطجعت معه في الخميلة‏.‏",
      "text_en": " Narrated Um Salama:                     While I was laying with the Prophet under a single woolen sheet, I got the menses. I slipped away and put on the clothes for menses. He said, \"Have you got \"Nifas\" (menses)?\" I replied, \"Yes.\" He then called me and made me lie with him under the same sheet.",
      "chain": [
        "20202",
        "20295",
        "11449",
        "10567",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "322",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا سعد بن حفص، قال حدثنا شيبان، عن يحيى، عن أبي سلمة، عن زينب ابنة أبي سلمة، حدثته أن أم سلمة قالت حضت وأنا مع النبي، صلى الله عليه وسلم في الخميلة، فانسللت فخرجت منها، فأخذت ثياب حيضتي فلبستها، فقال لي رسول الله صلى الله عليه وسلم ‏\"‏ أنفست ‏\"‏‏.‏ قلت نعم، فدعاني فأدخلني معه في الخميلة‏.‏ قالت وحدثتني أن النبي صلى الله عليه وسلم كان يقبلها وهو صائم، وكنت أغتسل أنا والنبي صلى الله عليه وسلم من إناء واحد من الجنابة‏.‏",
      "text_en": " Narrated Zainab bint Abi Salama:                     Um-Salama said, \"I got my menses while I was lying with the Prophet under a woolen sheet. So I slipped away, took the clothes for menses and put them on. Allah's Apostle said, 'Have you got your menses?' I replied, 'Yes.' Then he called me and took me with him under the woolen sheet.\" Um Salama further said, \"The Prophet used to kiss me while he was fasting. The Prophet and I used to take the bath of Janaba from a single pot.\"",
      "chain": [
        "35043",
        "20240",
        "11449",
        "10567",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "323",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا معاذ بن فضالة، قال حدثنا هشام، عن يحيى، عن أبي سلمة، عن زينب ابنة أبي سلمة، عن أم سلمة، قالت بينا أنا مع النبي، صلى الله عليه وسلم مضطجعة في خميلة حضت، فانسللت فأخذت ثياب حيضتي فقال ‏\"‏ أنفست ‏\"‏‏.‏ فقلت نعم‏.‏ فدعاني فاضطجعت معه في الخميلة‏.‏",
      "text_en": " Narrated Um Salama:                     While I was lying with the Prophet under a woolen sheet, I got my menses. I slipped away and put on the clothes for menses. The Prophet said, \"Have you got your menses?\" I replied, \"Yes.\" He called me and I slept with him under the woolen sheet.",
      "chain": [
        "30177",
        "20295",
        "20031",
        "10567",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "464",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن محمد بن عبد الرحمن بن نوفل، عن عروة، عن زينب بنت أبي سلمة، عن أم سلمة، قالت شكوت إلى رسول الله صلى الله عليه وسلم أني أشتكي‏.‏ قال ‏\"‏ طوفي من وراء الناس وأنت راكبة ‏\"‏‏.‏ فطفت ورسول الله صلى الله عليه وسلم يصلي إلى جنب البيت، يقرأ بالطور وكتاب مسطور‏.‏",
      "text_en": " Narrated Um Salama:                     I complained to Allah's Apostle that I was sick. He told me to perform the Tawaf behind the people while riding. So I did so and Allah's Apostle was praying beside the Ka`ba and reciting the Sura starting with \"Wat-tur wa kitabin mastur.\"",
      "chain": [
        "30355",
        "20001",
        "11105",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "837",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا إبراهيم بن سعد، حدثنا الزهري، عن هند بنت الحارث، أن أم سلمة  رضى الله عنها  قالت كان رسول الله صلى الله عليه وسلم إذا سلم قام النساء حين يقضي تسليمه، ومكث يسيرا قبل أن يقوم‏.‏ قال ابن شهاب فأرى  والله أعلم  أن مكثه لكى ينفذ النساء قبل أن يدركهن من انصرف من القوم‏.‏",
      "text_en": " Narrated Um Salama:                     Whenever Allah's Apostle finished his prayers with Taslim, the women would get up and he would stay on for a while in his place before getting up. Ibn Shihab said, \"I think (and Allah knows better), that the purpose of his stay was that the women might leave before the men who had finished their prayer. \"",
      "chain": [
        "20040",
        "20150",
        "11013",
        "11734",
        "56"
      ]
    },
    {
      "hadith_no": "850",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو الوليد، حدثنا إبراهيم بن سعد، حدثنا الزهري، عن هند بنت الحارث، عن أم سلمة، أن النبي صلى الله عليه وسلم كان إذا سلم يمكث في مكانه يسيرا‏.‏ قال ابن شهاب فنرى  والله أعلم  لكى ينفذ من ينصرف من النساء‏.‏ وقال ابن أبي مريم أخبرنا نافع بن يزيد، قال أخبرني جعفر بن ربيعة، أن ابن شهاب، كتب إليه قال حدثتني هند بنت الحارث الفراسية، عن أم سلمة، زوج النبي صلى الله عليه وسلم وكانت من صواحباتها قالت كان يسلم فينصرف النساء، فيدخلن بيوتهن من قبل أن ينصرف رسول الله صلى الله عليه وسلم‏.‏ وقال ابن وهب عن يونس عن ابن شهاب أخبرتني هند الفراسية‏.‏ وقال عثمان بن عمر أخبرنا يونس عن الزهري حدثتني هند الفراسية‏.‏ وقال الزبيدي أخبرني الزهري أن هند بنت الحارث القرشية أخبرته، وكانت تحت معبد بن المقداد  وهو حليف بني زهرة  وكانت تدخل على أزواج النبي صلى الله عليه وسلم‏.‏ وقال شعيب عن الزهري حدثتني هند القرشية‏.‏ وقال ابن أبي عتيق عن الزهري عن هند الفراسية‏.‏ وقال الليث حدثني يحيى بن سعيد حدثه عن ابن شهاب عن امرأة من قريش حدثته عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Um Salama:                     \"The Prophet after finishing the prayer with Taslim used to stay at his place for a while.\" Ibn Shihab said, \"I think (and Allah knows better), that he used to wait for the departure of the women who had prayed.\" Ibn Shihab wrote that he had heard it from Hind bint Al-Harith Al-Firasiya from Um Salama, the wife of the Prophet (Hind was from the companions of Um Salama) who said, \"When the Prophet finished the prayer with Taslim, the women would depart and enter their houses before Allah's Apostle departed.\"",
      "chain": [
        "20296",
        "20150",
        "11013",
        "11734",
        "56"
      ]
    },
    {
      "hadith_no": "870",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا يحيى بن قزعة، قال حدثنا إبراهيم بن سعد، عن الزهري، عن هند بنت الحارث، عن أم سلمة  رضى الله عنها  قالت كان رسول الله صلى الله عليه وسلم إذا سلم قام النساء حين يقضي تسليمه، ويمكث هو في مقامه يسيرا قبل أن يقوم‏.‏ قال نرى  والله أعلم  أن ذلك كان لكى ينصرف النساء قبل أن يدركهن أحد من الرجال‏.‏",
      "text_en": " Narrated Um Salama:                     Whenever Allah's Apostle completed the prayer with Taslim, the women used to get up immediately and Allah's Apostle would remain at his place for someone before getting up. (The sub-narrator (Az- Zuhri) said, \"We think, and Allah knows better, that he did so, so that the women might leave before men could get in touch with them).",
      "chain": [
        "30119",
        "20150",
        "11013",
        "11734",
        "56"
      ]
    },
    {
      "hadith_no": "875",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا يحيى بن قزعة، حدثنا إبراهيم بن سعد، عن الزهري، عن هند بنت الحارث، عن أم سلمة، قالت كان رسول الله صلى الله عليه وسلم إذا سلم قام النساء حين يقضي تسليمه، وهو يمكث في مقامه يسيرا قبل أن يقوم‏.‏ قالت نرى  والله أعلم  أن ذلك كان لكى ينصرف النساء قبل أن يدركهن الرجال‏.‏",
      "text_en": " Narrated Umm Salama:                      Whenever Allah's Messenger () completed the Salat with Taslim, the women used to get up immediately and Allah's Messenger ()  would remain at his place for sometime before getting up. The subnarrator (Az-Zuhri) said, \"We think, and Allah knows better, that he did so, so that the women might leave before the men could catch up with them.\"",
      "chain": [
        "30119",
        "20150",
        "11013",
        "11734",
        "56"
      ]
    },
    {
      "hadith_no": "1126",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا ابن مقاتل، أخبرنا عبد الله، أخبرنا معمر، عن الزهري، عن هند بنت الحارث، عن أم سلمة  رضى الله عنها  أن النبي صلى الله عليه وسلم استيقظ ليلة فقال ‏\"‏ سبحان الله ماذا أنزل الليلة من الفتنة، ماذا أنزل من الخزائن من يوقظ صواحب الحجرات، يا رب كاسية في الدنيا عارية في الآخرة ‏\"‏‏.‏",
      "text_en": " Narrated Um Salama:                     One night the Prophet got up and said, \"Subhan Allah! How many afflictions Allah has revealed tonight and how many treasures have been sent down (disclosed). Go and wake the sleeping lady occupants of these dwellings up (for prayers), perhaps a well dressed in this world may be naked in the Hereafter.\"",
      "chain": [
        "30118",
        "20025",
        "20115",
        "11013",
        "11734",
        "56"
      ]
    },
    {
      "hadith_no": "1644",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا إسماعيل، حدثنا مالك، عن محمد بن عبد الرحمن بن نوفل، عن عروة بن الزبير، عن زينب بنت أبي سلمة، عن أم سلمة  رضى الله عنها  زوج النبي صلى الله عليه وسلم قالت شكوت إلى رسول الله صلى الله عليه وسلم أني أشتكي‏.‏ فقال ‏\"‏ طوفي من وراء الناس، وأنت راكبة ‏\"‏‏.‏ فطفت ورسول الله صلى الله عليه وسلم حينئذ يصلي إلى جنب البيت، وهو يقرأ ‏{‏والطور * وكتاب مسطور‏}‏",
      "text_en": " Narrated Um Salama:                     (the wife of the Prophet) I informed Allah's Apostle that I was ill. So he said, \"Perform the Tawaf while riding behind the people.\" I did so, and at that time the Prophet was praying beside the Ka`ba and reciting Surat-at-Tur.",
      "chain": [
        "30103",
        "20001",
        "11105",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "1651",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن محمد بن عبد الرحمن، عن عروة، عن زينب، عن أم سلمة  رضى الله عنها  شكوت إلى رسول الله صلى الله عليه وسلم‏.‏ وحدثني محمد بن حرب حدثنا أبو مروان يحيى بن أبي زكرياء الغساني عن هشام عن عروة عن أم سلمة  رضى الله عنها  زوج النبي صلى الله عليه وسلم أن رسول الله صلى الله عليه وسلم قال وهو بمكة، وأراد الخروج، ولم تكن أم سلمة طافت بالبيت وأرادت الخروج، فقال لها رسول الله صلى الله عليه وسلم ‏\"‏ إذا أقيمت صلاة الصبح فطوفي على بعيرك، والناس يصلون ‏\"‏‏.‏ ففعلت ذلك، فلم تصل حتى خرجت‏.‏",
      "text_en": " Narrated Um Salama:                     (the wife of the Prophet) I informed Allah's Apostle (about my illness). (Through other sub-narrators, Um Salama narrated that when Allah's Apostle was at Mecca and had just decided to leave (Mecca) while she had not yet done Tawaf of the Ka`ba (and after listening to her). The Prophet said, \"When the morning prayer is established, perform the Tawaf on your camel while the people are in prayer.\" So she did the same and did not offer the two rak`at of Tawaf until she came out of the Mosque.",
      "chain": [
        "30355",
        "20001",
        "11105",
        "10511",
        "57",
        "56"
      ]
    },
    {
      "hadith_no": "1658",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد الله بن مسلمة، حدثنا مالك، عن محمد بن عبد الرحمن بن نوفل، عن عروة، عن زينب ابنة أم سلمة، عن أم سلمة  رضى الله عنها  قالت شكوت إلى رسول الله صلى الله عليه وسلم أني أشتكي‏.‏ فقال ‏\"‏ طوفي من وراء الناس وأنت راكبة ‏\"‏‏.‏ فطفت ورسول الله صلى الله عليه وسلم يصلي إلى جنب البيت، وهو يقرأ بالطور وكتاب مسطور‏.‏",
      "text_en": " Narrated Um Salama:                     I informed Allah's Apostle that I was sick. He said, \"Perform Tawaf (of the Ka`ba) while riding behind the people.\" So, I performed the Tawaf while Allah's Apostle was offering the prayer beside the Ka`ba and was reciting Surat-at-Tur.",
      "chain": [
        "20164",
        "20001",
        "11105",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "1910",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا أبو عاصم، عن ابن جريج، عن يحيى بن عبد الله بن صيفي، عن عكرمة بن عبد الرحمن، عن أم سلمة  رضى الله عنها  أن النبي صلى الله عليه وسلم آلى من نسائه شهرا، فلما مضى تسعة وعشرون يوما غدا أو راح فقيل له إنك حلفت أن لا تدخل شهرا‏.‏ فقال ‏\"‏ إن الشهر يكون تسعة وعشرين يوما ‏\"‏‏.‏",
      "text_en": " Narrated Um Salama:                     The Prophet vowed to keep aloof from his wives for a period of one month, and after the completion of 29 days he went either in the morning or in the afternoon to his wives. Someone said to him \"You vowed that you would not go to your wives for one month.\" He replied, \"The month is of 29 days.\"",
      "chain": [
        "20241",
        "11070",
        "11448",
        "56"
      ]
    },
    {
      "hadith_no": "1929",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن هشام بن أبي عبد الله، حدثنا يحيى بن أبي كثير، عن أبي سلمة، عن زينب ابنة أم سلمة، عن أمها  رضى الله عنهما  قالت بينما أنا مع، رسول الله صلى الله عليه وسلم في الخميلة إذ حضت فانسللت، فأخذت ثياب حيضتي فقال ‏\"‏ ما لك أنفست ‏\"‏‏.‏ قلت نعم‏.‏ فدخلت معه في الخميلة، وكانت هي ورسول الله صلى الله عليه وسلم يغتسلان من إناء واحد، وكان يقبلها وهو صائم‏.‏",
      "text_en": " Narrated Zainab:                     (daughter of Um Salama) that her mother said, \"While I was (lying) with Allah's Apostle underneath a woolen sheet, I got the menstruation, and then slipped away and put on the clothes (which I used to wear) in menses. He asked, \"What is the matter? Did you get your menses?\" I replied in the affirmative and then entered underneath that woolen sheet. I and Allah's Apostle used to take a bath from one water pot and he used to kiss me while he was fasting.\"",
      "chain": [
        "30175",
        "20031",
        "11449",
        "10567",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "2680",
      "source": " Sahih Bukhari ",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن هشام بن عروة، عن أبيه، عن زينب، عن أم سلمة  رضى الله عنها  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إنكم تختصمون إلى، ولعل بعضكم ألحن بحجته من بعض، فمن قضيت له بحق أخيه شيئا بقوله، فإنما أقطع له قطعة من النار فلا يأخذها ‏\"‏‏.‏",
      "text_en": " Narrated Um Salama:                     Once Allah's Apostle said, \"You people present your cases to me and some of you may be more eloquent and persuasive in presenting their argument. So, if I give some one's right to another (wrongly) because of the latter's (tricky) presentation of the case, I am really giving him a piece of fire; so he should not take it.\"",
      "chain": [
        "20164",
        "20001",
        "11065",
        "10511",
        "57",
        "56"
      ]
    },
    {
      "hadith_no": "3328",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن هشام بن عروة، عن أبيه، عن زينب بنت أبي سلمة، عن أم سلمة، أن أم سليم، قالت يا رسول الله، إن الله لا يستحيي من الحق، فهل على المرأة الغسل إذا احتلمت قال ‏\"‏ نعم، إذا رأت الماء ‏\"‏‏.‏ فضحكت أم سلمة، فقالت تحتلم المرأة فقال رسول الله صلى الله عليه وسلم ‏\"‏ فبما يشبه الولد ‏\"‏‏.‏",
      "text_en": " Narrated Abu Salama:                     Um Salama said, \"Um Sulaim said, 'O Allah's Apostle! Allah does not refrain from saying the truth! Is it obligatory for a woman to take a bath after she gets nocturnal discharge?' He said, 'Yes, if she notices the water (i.e. discharge).' Um Salama smiled and said, 'Does a woman get discharge?' Allah's Apostle said. 'Then why does a child resemble (its mother)?\"",
      "chain": [
        "30175",
        "20031",
        "11065",
        "10511",
        "244",
        "56",
        "83"
      ]
    },
    {
      "hadith_no": "3642",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "وعن الزهري، حدثتني هند بنت الحارث، أن أم سلمة، قالت استيقظ النبي صلى الله عليه وسلم فقال ‏\"‏ سبحان الله، ماذا أنزل من الخزائن وماذا أنزل من الفتن ‏\"‏‏.‏",
      "text_en": " Um Salama:                     The Prophet woke up and said, \"Glorified be Allah: What great (how many) treasures have been sent down, and what great (how many ) afflictions have been sent down!\"",
      "chain": [
        "11013",
        "11734",
        "56"
      ]
    },
    {
      "hadith_no": "4902",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن محمد بن عبد الرحمن بن نوفل، عن عروة، عن زينب ابنة أبي سلمة، عن أم سلمة، قالت شكوت إلى رسول الله صلى الله عليه وسلم أني أشتكي فقال ‏\"‏ طوفي من وراء الناس، وأنت راكبة ‏\"‏‏.‏ فطفت ورسول الله صلى الله عليه وسلم يصلي إلى جنب البيت يقرأ بالطور وكتاب مسطور‏.‏",
      "text_en": " Narrated Um Salama:                     I complained to Allah's Apostle that I was sick, so he said, \"Perform the Tawaf (of Ka`ba at Mecca) while riding behind the people (who are performing the Tawaf on foot).\" So I performed the Tawaf while Allah's Apostle was offering the prayer by the side of the Ka`ba and was reciting: 'By the Mount (Saini) and by a Decree Inscribed.'",
      "chain": [
        "30355",
        "20001",
        "11105",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "5257",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا أبو عاصم، عن ابن جريج،‏.‏ وحدثني محمد بن مقاتل، أخبرنا عبد الله، أخبرنا ابن جريج، قال أخبرني يحيى بن عبد الله بن صيفي، أن عكرمة بن عبد الرحمن بن الحارث، أخبره أن أم سلمة أخبرته أن النبي صلى الله عليه وسلم حلف لا يدخل على بعض أهله شهرا، فلما مضى تسعة وعشرون يوما غدا عليهن أو راح فقيل له يا نبي الله حلفت أن لا تدخل عليهن شهرا قال ‏\"‏ إن الشهر يكون تسعة وعشرين يوما ‏\"‏‏.‏",
      "text_en": " Narrated Um Salama:                     The Prophet took an oath that he would not enter upon some of his wives for one month. But when twenty nine days had elapsed, he went to them in the morning or evening. It was said to him, \"O Allah's Prophet! You had taken an oath that you would not enter upon them for one month.\" He replied, \"The month can be of twenty nine days.\"",
      "chain": [
        "20241",
        "30118",
        "20025",
        "11070",
        "11448",
        "56"
      ]
    },
    {
      "hadith_no": "5290",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا عبدة، عن هشام بن عروة، عن أبيه، عن زينب ابنة أم سلمة، عن أم سلمة، أن النبي صلى الله عليه وسلم كان عندها وفي البيت مخنث، فقال المخنث لأخي أم سلمة عبد الله بن أبي أمية إن فتح الله عليكم الطائف غدا أدلك على ابنة غيلان، فإنها تقبل بأربع وتدبر بثمان‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ لا يدخلن هذا عليكن ‏\"‏‏.‏",
      "text_en": " Narrated Um Salama:                     that while the Prophet was with her, there was an effeminate man in the house. The effeminate man said to Um Salama's brother, `Abdullah bin Abi Umaiyya, \"If Allah should make you conquer Ta'if tomorrow, I recommend that you take the daughter of Ghailan (in marriage) for (she is so fat) that she shows four folds of flesh when facing you and eight when she turns her back.\" Thereupon the Prophet said (to us), \"This (effeminate man) should not enter upon you (anymore).",
      "chain": [
        "30203",
        "20337",
        "11065",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "5392",
      "source": " Sahih Bukhari ",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا آدم بن أبي إياس، حدثنا شعبة، حدثنا حميد بن نافع، عن زينب ابنة أم سلمة، عن أمها، أن امرأة، توفي زوجها فخشوا على عينيها فأتوا رسول الله صلى الله عليه وسلم فاستأذنوه في الكحل فقال ‏\"‏ لا تكحل قد كانت إحداكن تمكث في شر أحلاسها أو شر بيتها، فإذا كان حول فمر كلب رمت ببعرة، فلا حتى تمضي أربعة أشهر وعشر ‏\"‏‏.‏",
      "text_en": "",
      "chain": [
        "20404",
        "20020",
        "11157",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "5423",
      "source": " Sahih Bukhari ",
      "chapter": "Supporting the Family - كتاب النفقات",
      "chapter_no": "69",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا وهيب، أخبرنا هشام، عن أبيه، عن زينب ابنة أبي سلمة، عن أم سلمة، قلت يا رسول الله هل لي من أجر في بني أبي سلمة أن أنفق عليهم، ولست بتاركتهم هكذا وهكذا، إنما هم بني‏.‏ قال ‏\"‏ نعم لك أجر ما أنفقت عليهم ‏\"‏‏.‏",
      "text_en": " Narrated Um Salama:                     I said, \"O Allah's Apostle! Shall I get a reward (in the Hereafter) if I spend on the children of Abu Salama and do not leave them like this and like this (i.e., poor) but treat them like my children?\" The Prophet said, \"Yes, you will be rewarded for that which you will spend on them.\"",
      "chain": [
        "20040",
        "20299",
        "11065",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "5768",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن شعبة، قال حدثني حميد بن نافع، عن زينب، عن أم سلمة  رضى الله عنها  أن امرأة توفي زوجها فاشتكت عينها، فذكروها للنبي صلى الله عليه وسلم وذكروا له الكحل، وأنه يخاف على عينها، فقال ‏\"‏ لقد كانت إحداكن تمكث في بيتها في شر أحلاسها  أو في أحلاسها في شر بيتها  فإذا مر كلب رمت بعرة، فلا، أربعة أشهر وعشرا ‏\"‏‏.‏",
      "text_en": " Narrated Um Salama:                     The husband of a lady died and her eyes became sore and the people mentioned her story to the Prophet They asked him whether it was permissible for her to use kohl as her eyes were exposed to danger. He said, \"Previously, when one of you was bereaved by a husband she would stay in her dirty clothes in a bad unhealthy house (for one year), and when a dog passed by, she would throw a globe of dung. No, (she should observe the prescribed period Idda) for four months and ten days.'",
      "chain": [
        "30175",
        "20031",
        "20020",
        "11157",
        "57",
        "56"
      ]
    },
    {
      "hadith_no": "5798",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثني محمد بن خالد، حدثنا محمد بن وهب بن عطية الدمشقي، حدثنا محمد بن حرب، حدثنا محمد بن الوليد الزبيدي، أخبرنا الزهري، عن عروة بن الزبير، عن زينب ابنة أبي سلمة، عن أم سلمة  رضى الله عنها  أن النبي صلى الله عليه وسلم رأى في بيتها جارية في وجهها سفعة فقال ‏\"‏ استرقوا لها، فإن بها النظرة ‏\"‏‏.‏ وقال عقيل عن الزهري أخبرني عروة عن النبي صلى الله عليه وسلم‏.‏ تابعه عبد الله بن سالم عن الزبيدي‏.‏",
      "text_en": " Narrated Um Salama:                     that the Prophet saw in her house a girl whose face had a black spot. He said. \"She is under the effect of an evil eye; so treat her with a Ruqya.\"",
      "chain": [
        "38496",
        "30287",
        "30373",
        "20459",
        "11013",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "5905",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا هشام، أخبرنا معمر، عن الزهري، أخبرتني هند بنت الحارث، عن أم سلمة، قالت استيقظ النبي صلى الله عليه وسلم من الليل وهو يقول ‏\"‏ لا إله إلا الله، ماذا أنزل الليلة من الفتنة، ماذا أنزل من الخزائن، من يوقظ صواحب الحجرات، كم من كاسية في الدنيا عارية يوم القيامة ‏\"‏‏.‏ قال الزهري وكانت هند لها أزرار في كميها بين أصابعها‏.‏",
      "text_en": " Narrated Um Salama:                     One night the Prophet woke up, saying, \"None has the right to be worshipped but Allah! How many afflictions have been sent down tonight, and how many treasures have been sent down (disclosed)! Who will go and wake up (for prayers) the lady dwellers of these rooms? Many well dressed soul (people) in this world, will be naked on the Day of Resurrection.\"",
      "chain": [
        "30351",
        "20295",
        "20115",
        "11013",
        "11734",
        "56"
      ]
    },
    {
      "hadith_no": "5948",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا مالك بن إسماعيل، حدثنا زهير، حدثنا هشام بن عروة، أن عروة، أخبره أن زينب ابنة أبي سلمة أخبرته أن أم سلمة أخبرتها أن النبي صلى الله عليه وسلم كان عندها وفي البيت مخنث، فقال لعبد الله أخي أم سلمة يا عبد الله إن فتح لكم غدا الطائف، فإني أدلك على بنت غيلان، فإنها تقبل بأربع وتدبر بثمان‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ لا يدخلن هؤلاء عليكن ‏\"‏‏.‏ قال أبو عبد الله تقبل بأربع وتدبر بثمان يعني أربع عكن بطنها، فهى تقبل بهن، وقوله وتدبر بثمان‏.‏ يعني أطراف هذه العكن الأربع، لأنها محيطة بالجنبين حتى لحقت وإنما قال بثمان‏.‏ ولم يقل بثمانية‏.‏ وواحد الأطراف وهو ذكر، لأنه لم يقل ثمانية أطراف‏.‏",
      "text_en": " Narrated Um Salama:                     that once the Prophet was in her house, and an effeminate man was there too. The effeminate man said to `Abdullah, (Um Salama's brother) \"0 `Abdullah! If Ta'if should be conquered tomorrow, I recommend you the daughter of Ghailan, for she is so fat that she has four curves in the front (of her belly) and eight at the back.\" So the Prophet said (to his wives) \"These effeminate (men) should not enter upon you (your houses).",
      "chain": [
        "20357",
        "20321",
        "11065",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "6158",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا يحيى، عن هشام، قال أخبرني أبي، عن زينب بنت أم سلمة، عن أم سلمة، أن أم سليم، قالت يا رسول الله إن الله لا يستحي من الحق، هل على المرأة غسل إذا احتلمت قال ‏\"‏ نعم إذا رأت الماء ‏\"‏‏.‏ فضحكت أم سلمة فقالت أتحتلم المرأة فقال النبي صلى الله عليه وسلم ‏\"‏ فبم شبه الولد ‏\"‏‏.‏",
      "text_en": " Narrated Zainab bint Um Salama:                     Um Sulaim said, \"O Allah's Apostle! Verily Allah is not shy of (telling you) the truth. Is it essential for a woman to take a bath after she had a wet dream (nocturnal sexual discharge)?\" He said, \"Yes, if she notices discharge. On that Um Salama laughed and said, \"Does a woman get a (nocturnal sexual) discharge?\" He said, \"How then does (her) son resemble her (his mother)?\"",
      "chain": [
        "30170",
        "20031",
        "11065",
        "10511",
        "244",
        "56",
        "83"
      ]
    },
    {
      "hadith_no": "6189",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن هشام بن عروة، عن أبيه، عن زينب ابنة أبي سلمة، عن أم سلمة  رضى الله عنها  قالت جاءت أم سليم إلى رسول الله صلى الله عليه وسلم فقالت يا رسول الله إن الله لا يستحي من الحق، فهل على المرأة غسل إذا احتلمت فقال ‏\"‏ نعم إذا رأت الماء ‏\"‏‏.‏",
      "text_en": " Narrated Um Salama:                     Um Sulaim came to Allah's Apostle and said, \"O Allah's Apostle! Verily, Allah does not feel shy to tell the truth. If a woman gets a nocturnal sexual discharge (has a wet dream), is it essential for her to take a bath? He replied, \"Yes if she notices a discharge.\"",
      "chain": [
        "30103",
        "20001",
        "11065",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "6289",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، حدثتني هند بنت الحارث، أن أم سلمة  رضى الله عنها  قالت استيقظ النبي صلى الله عليه وسلم فقال ‏\"‏ سبحان الله ماذا أنزل من الخزائن، وماذا أنزل من الفتن، من يوقظ صواحب الحجر  يريد به أزواجه  حتى يصلين، رب كاسية في الدنيا، عارية في الآخرة ‏\"‏‏.‏ وقال ابن أبي ثور عن ابن عباس، عن عمر، قال قلت للنبي صلى الله عليه وسلم طلقت نساءك قال ‏\"‏ لا ‏\"‏‏.‏ قلت الله أكبر‏.‏",
      "text_en": " Narrated Um Salama:                     (One night) the Prophet woke up and said, \"Subhan Allah ! How many treasures have been (disclosed) sent down! And how many afflictions have been descended! Who will go and wake the sleeping ladyoccupants up of these dwellings (for praying)?\" (He meant by this his wives.) The Prophet added, \"A well-dressed soul (person) in this world may be naked in the \"Hereafter.\" `Umar said, \"I asked the Prophet, 'Have you divorced your wives?' He said, 'No.' I said, 'Allahu Akbar.' \"",
      "chain": [
        "30330",
        "20428",
        "11013",
        "11734",
        "56"
      ]
    },
    {
      "hadith_no": "7053",
      "source": " Sahih Bukhari ",
      "chapter": "Tricks - كتاب الحيل",
      "chapter_no": "91",
      "text_ar": "حدثنا محمد بن كثير، عن سفيان، عن هشام، عن عروة، عن زينب ابنة أم سلمة، عن أم سلمة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إنما أنا بشر، وإنكم تختصمون، ولعل بعضكم أن يكون ألحن بحجته من بعض، وأقضي له على نحو ما أسمع، فمن قضيت له من حق أخيه شيئا، فلا يأخذ، فإنما أقطع له قطعة من النار ‏\"‏‏.‏",
      "text_en": " Narrated Um Salama:                     The Prophet said, \"I am only a human being, and you people have disputes. May be some one amongst you can present his case in a more eloquent and convincing manner than the other, and I give my judgment in his favor according to what I hear. Beware! If ever I give (by error) somebody something of his brother's right then he should not take it as I have only, given him a piece of Fire.\" (See Hadith No. 638. Vol. 3)",
      "chain": [
        "28531",
        "20012",
        "11065",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "7257",
      "source": " Sahih Bukhari ",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن هشام، عن أبيه، عن زينب ابنة أبي سلمة، عن أم سلمة  رضى الله عنها  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إنما أنا بشر، وإنكم تختصمون إلى، ولعل بعضكم أن يكون ألحن بحجته من بعض فأقضي نحو ما أسمع، فمن قضيت له بحق أخيه شيئا فلا يأخذه، فإنما أقطع له قطعة من النار ‏\"‏‏.‏",
      "text_en": " Narrated Um Salama:                     Allah's Apostle said, \"I am only a human being, and you people (opponents) come to me with your cases; and it may be that one of you can present his case eloquently in a more convincing way than the other, and I give my verdict according to what I hear. So if ever I judge (by error) and give the right of a brother to his other (brother) then he (the latter) should not take it, for I am giving him only a piece of Fire.\" (See Hadith No. 638, Vol. 3).",
      "chain": [
        "20164",
        "20001",
        "11065",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "296",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا معاذ بن هشام، حدثني أبي، عن يحيى بن أبي كثير، حدثنا أبو سلمة بن عبد الرحمن، أن زينب بنت أم سلمة، حدثته أن أم سلمة حدثتها قالت، بينما أنا مضطجعة، مع رسول الله صلى الله عليه وسلم في الخميلة إذ حضت فانسللت فأخذت ثياب حيضتي فقال لي رسول الله صلى الله عليه وسلم ‏\"‏ أنفست ‏\"‏ ‏.‏ قلت نعم ‏.‏ فدعاني فاضطجعت معه في الخميلة ‏.‏ قالت وكانت هي ورسول الله صلى الله عليه وسلم يغتسلان في الإناء الواحد من الجنابة ‏.‏",
      "text_en": " Umm Salama reported:                      While I was lying with the Messenger of Allah (may peace be upon him) in a bed cover I menstruated, so I slipped away and I took up the clothes (which I wore) in menses. Upon this the Messenger of Allah (may peace be upon him) said: Have you menstruated? I said: Yes. He called me and I lay down",
      "chain": [
        "30170",
        "20287",
        "20295",
        "11449",
        "10567",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "313",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثنا يحيى بن يحيى التميمي، أخبرنا أبو معاوية، عن هشام بن عروة، عن أبيه، عن زينب بنت أبي سلمة، عن أم سلمة، قالت جاءت أم سليم إلى النبي صلى الله عليه وسلم فقالت يا رسول الله إن الله لا يستحيي من الحق فهل على المرأة من غسل إذا احتلمت فقال رسول الله صلى الله عليه وسلم ‏\"‏ نعم إذا رأت الماء ‏\"‏ ‏.‏ فقالت أم سلمة يا رسول الله وتحتلم المرأة فقال ‏\"‏ تربت يداك فبم يشبهها ولدها ‏\"‏ ‏.‏",
      "text_en": " Umm Salama reported:                      Umm Sulaim went to the Apostle of Allah (may peace be upon him) and said: Apostle of Allah, Allah is not ashamed of the truth. Is bathing necessary for a woman when she has a sexual dream? Upon this the Messenger of Allah (may peace be upon him) said: Yes, when she sees the liquid (vaginal secretion). Umm Salama said: Messenger of Allah, does a woman have sexual dream? He (the Holy Prophet) said: Let your hand be covered with dust, in what way does her child resemble her?",
      "chain": [
        "30399",
        "20354",
        "11065",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "324",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا معاذ بن هشام، قال حدثني أبي، عن يحيى بن أبي كثير، حدثنا أبو سلمة بن عبد الرحمن، أن زينب بنت أم سلمة، حدثته أن أم سلمة حدثتها قالت، كانت هي ورسول الله صلى الله عليه وسلم يغتسلان في الإناء الواحد من الجنابة ‏.‏",
      "text_en": " Zainab bint Umm Salama (the wife of the Holy Prophet) reported that Umm Salama and the Messenger of Allah (may peace be upon him) took a bath from the same vessel.",
      "chain": [
        "30170",
        "20287",
        "20295",
        "11449",
        "10567",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "330",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعمرو الناقد، وإسحاق بن إبراهيم، وابن أبي عمر، كلهم عن ابن عيينة، قال إسحاق أخبرنا سفيان، عن أيوب بن موسى، عن سعيد بن أبي سعيد المقبري، عن عبد الله بن رافع، مولى أم سلمة عن أم سلمة، قالت قلت يا رسول الله إني امرأة أشد ضفر رأسي فأنقضه لغسل الجنابة قال ‏\"‏ لا إنما يكفيك أن تحثي على رأسك ثلاث حثيات ثم تفيضين عليك الماء فتطهرين ‏\"‏ ‏.‏",
      "text_en": " Umm Salama reported:                      I said: Messenger of Allah, I am a woman who has closely plaited hair on my head; should I undo it for taking a bath, because of sexual intercourse? He (the Holy Prophet) said: No, it is enough for you to throw three handfuls of water on your head and then pour water over yourself, and you shall be purified.",
      "chain": [
        "30201",
        "30263",
        "30123",
        "30421",
        "20005",
        "30312",
        "20005",
        "11241",
        "11168",
        "11864",
        "56"
      ]
    },
    {
      "hadith_no": "2165",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "حدثنا يحيى بن أيوب، وقتيبة، وابن، حجر جميعا عن إسماعيل بن جعفر، - قال ابن أيوب حدثنا إسماعيل، - أخبرني سعد بن سعيد، عن عمر بن كثير بن أفلح، عن ابن، سفينة عن أم سلمة، أنها قالت سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ما من مسلم تصيبه مصيبة فيقول ما أمره الله إنا لله وإنا إليه راجعون اللهم أجرني في مصيبتي وأخلف لي خيرا منها ‏.‏ إلا أخلف الله له خيرا منها ‏\"‏ ‏.‏ قالت فلما مات أبو سلمة قلت أى المسلمين خير من أبي سلمة أول بيت هاجر إلى رسول الله صلى الله عليه وسلم ‏.‏ ثم إني قلتها فأخلف الله لي رسول الله صلى الله عليه وسلم ‏.‏ قالت أرسل إلى رسول الله صلى الله عليه وسلم حاطب بن أبي بلتعة يخطبني له فقلت إن لي بنتا وأنا غيور ‏.‏ فقال ‏\"‏ أما ابنتها فندعو الله أن يغنيها عنها وأدعو الله أن يذهب بالغيرة ‏\"‏ ‏.‏",
      "text_en": " Umm Salama reported Allah's Messenger (may peace be upon him) as saying:                      If any Muslim who suffers some calamity says, what Allah has commanded him,\" We belong to Allah and to Him shall we return; O Allah, reward me for my affliction and give me something better than it in exchange for it,\" Allah will give him something better than it in exchange. When Abu Salama died she said: What Muslim is better than Abu Salama whose family was the first to emigrate to the Messenger of Allah (may peace be upon him). I then said the words, and Allah gave me God's Messenger (may peace be upon him) in exchange. She said: The Messenger of Allah (may peace be upon him) sent Hatib b. Abu Balta'a to deliver me the message of marriage with him. I said to him: I have a daughter (as my dependant) and I am of jealous temperament. He (the Holy Prophet) said: So far as her daughter is concerned, we would supplicate Allah, that He may free her (of her responsibility) and I would also supplicate Allah to do away with (her) jealous (temperament).",
      "chain": [
        "20379",
        "30367",
        "20155",
        "11418",
        "10601",
        "56"
      ]
    },
    {
      "hadith_no": "2168",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا أبو معاوية، عن الأعمش، عن شقيق، عن أم سلمة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا حضرتم المريض أو الميت فقولوا خيرا فإن الملائكة يؤمنون على ما تقولون ‏\"‏ ‏.‏ قالت فلما مات أبو سلمة أتيت النبي صلى الله عليه وسلم فقلت يا رسول الله إن أبا سلمة قد مات قال ‏\"‏ قولي اللهم اغفر لي وله وأعقبني منه عقبى حسنة ‏\"‏ ‏.‏ قالت فقلت فأعقبني الله من هو خير لي منه محمدا صلى الله عليه وسلم ‏.‏",
      "text_en": " Umm Salama reported Allah's Messenger (may peace be upon him) as saying:                      Whenever you visit the sick or the dead, supplicate for good because angels say\" Amen\" to whatever you say. She added: When Abu Salama died, I went to the Apostle of Allah (may peace be upon him) and said: Messenger of Allah, Abu Salama has died. He told me to recite:\" O Allah! forgive me and him (Abu Salama) and give me a better substitute than he.\" So I said (this), and Allah gave me in exchange Muhammad, who is better for me than him (Abu Salama).",
      "chain": [
        "30201",
        "30216",
        "20354",
        "11060",
        "11353",
        "56"
      ]
    },
    {
      "hadith_no": "2169",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "حدثني زهير بن حرب، حدثنا معاوية بن عمرو، حدثنا أبو إسحاق الفزاري، عن خالد الحذاء، عن أبي قلابة، عن قبيصة بن ذؤيب، عن أم سلمة، قالت دخل رسول الله صلى الله عليه وسلم على أبي سلمة وقد شق بصره فأغمضه ثم قال ‏\"‏ إن الروح إذا قبض تبعه البصر ‏\"‏ ‏.‏ فضج ناس من أهله فقال ‏\"‏ لا تدعوا على أنفسكم إلا بخير فإن الملائكة يؤمنون على ما تقولون ‏\"‏ ‏.‏ ثم قال ‏\"‏ اللهم اغفر لأبي سلمة وارفع درجته في المهديين واخلفه في عقبه في الغابرين واغفر لنا وله يا رب العالمين وافسح له في قبره ‏.‏ ونور له فيه ‏\"‏ ‏.‏",
      "text_en": " Umm Salama reported:                      The Messenger of Allah (may peace be upon came to Abu Salama (as he died). His eyes were fixedly open. He closed them, and then said: When the soul is taken away the sight follows it. Some of the people of his family wept and wailed. So he said: Do not supplicate for yourselves anything but good, for angels say\" Amen\" to what you say. He then said: O Allah, forgive Abu Salama, raise his degree among those who are rightly guided, grant him a successor in his descendants who remain. Forgive us and him, O Lord of the Universe, and make his grave spacious, and grant him light in it.",
      "chain": [
        "30022",
        "20389",
        "20405",
        "11282",
        "11047",
        "56"
      ]
    },
    {
      "hadith_no": "2367",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا أبو كريب، محمد بن العلاء حدثنا أبو أسامة، حدثنا هشام، عن أبيه، عن زينب بنت أبي سلمة، عن أم سلمة، قالت قلت يا رسول الله هل لي أجر في بني أبي سلمة أنفق عليهم ولست بتاركتهم هكذا وهكذا إنما هم بني ‏.‏ فقال ‏\"‏ نعم لك فيهم أجر ما أنفقت عليهم ‏\"‏ ‏.‏",
      "text_en": " Umm Salama said:                      I asked the Messenger of Allah (may peace be upon him) whether there is a reward for me if I spend oh Abu Salama's sons, and I am not going to abandon them in this state (of helplessness) for they are my sons. He (the Holy Prophet) said: Yes. For you is the reward for what you spend on them.",
      "chain": [
        "30216",
        "20318",
        "11065",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "2575",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثني هارون بن عبد الله، حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني يحيى بن عبد الله بن محمد بن صيفي، أن عكرمة بن عبد الرحمن بن الحارث، أخبره أن أم سلمة - رضى الله عنها - أخبرته أن النبي صلى الله عليه وسلم حلف أن لا يدخل على بعض أهله شهرا فلما مضى تسعة وعشرون يوما غدا عليهم - أو راح - فقيل له حلفت يا نبي الله أن لا تدخل علينا شهرا ‏.‏ قال ‏\"‏ إن الشهر يكون تسعة وعشرين يوما ‏\"‏ ‏.‏",
      "text_en": " Umm Salama (Allah be pleased with him) reported that the Apostle of Allah (may peace be upon him) took an oath that he would not go to some of his wives for the whole of the month. When twenty-nine days bad passed he (the Holy Prophet) went to them in the morning or in the evening. Upon this it was said to him:                      Apostle of Allah, you took an oath that you would not come to us for a month, whereupon he said: The month may also consist of twenty-nine days.",
      "chain": [
        "30524",
        "20381",
        "11070",
        "11448",
        "56"
      ]
    },
    {
      "hadith_no": "2650",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا أحمد بن عثمان النوفلي، حدثنا أبو عاصم، حدثنا ابن جريج، أخبرني محمد بن يوسف، عن سليمان بن يسار، أنه سأل أم سلمة - رضى الله عنها - عن الرجل يصبح جنبا أيصوم قالت كان رسول الله صلى الله عليه وسلم يصبح جنبا من غير احتلام ثم يصوم ‏.‏",
      "text_en": " Sulaiman b. Yasar reported that he asked Umm Salama whether a person (who gets up) in the morning in a state of junub should observe fast. She said:                      The Messenger of Allah (may peace be upon him) (at times) got up in the morning in a state of junub, not because of sexual dreams (but on account of intercourse at night), and then observed fast.",
      "chain": [
        "30185",
        "20241",
        "11070",
        "30388",
        "11005",
        "56"
      ]
    },
    {
      "hadith_no": "3137",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن محمد بن عبد الرحمن بن نوفل، عن عروة، عن زينب بنت أبي سلمة، عن أم سلمة، أنها قالت شكوت إلى رسول الله صلى الله عليه وسلم أني أشتكي فقال ‏\"‏ طوفي من وراء الناس وأنت راكبة ‏\"‏ ‏.‏ قالت فطفت ورسول الله صلى الله عليه وسلم حينئذ يصلي إلى جنب البيت وهو يقرأ ب ‏{‏ الطور * وكتاب مسطور‏}‏ ‏.‏",
      "text_en": " Umm Salama reported:                      I made a complaint to Allah's Messenger (may peace be upon him) of my ailment, whereupon be said: Circumambulate behind the people while riding. She said: So I circumambulated and Allah's Messenger (may peace be upon him) was at that time praying towards the side of the House and he was reciting al-Tur and a Book Inscribed (i. e. Sura Iii. of the Qur'un).",
      "chain": [
        "30399",
        "11105",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "3694",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن حاتم، ويعقوب بن إبراهيم، - واللفظ لأبي بكر - قالوا حدثنا يحيى بن سعيد، عن سفيان، عن محمد بن أبي بكر، عن عبد الملك، بن أبي بكر بن عبد الرحمن بن الحارث بن هشام عن أبيه، عن أم سلمة، أن رسول الله صلى الله عليه وسلم لما تزوج أم سلمة أقام عندها ثلاثا وقال ‏\"‏ إنه ليس بك على أهلك هوان إن شئت سبعت لك وإن سبعت لك سبعت لنسائي ‏\"‏ ‏.",
      "text_en": " 'Abd al-Malik b. Abu Bakr b. Abd al-Rahman b. al-Harith b. Hisham reported on the authority of his father from Umm Salama (Allah be pleased with her) that when Allah's Messenger (may peace be upon him) married Umm Salama, he stayed with her for three nights, and said:                      There is no lack of estimation on the part of your husband for you. If you wish I can stay with you for a week, but in case I stay with you for a week, then I shall have to stay for a week with all my wives.",
      "chain": [
        "30201",
        "38487",
        "20184",
        "11062",
        "20012",
        "11214",
        "11239",
        "56"
      ]
    },
    {
      "hadith_no": "3698",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "حدثني أبو كريب، محمد بن العلاء حدثنا حفص، - يعني ابن غياث - عن عبد، الواحد بن أيمن عن أبي بكر بن عبد الرحمن بن الحارث بن هشام، عن أم سلمة، ذكر أنصلى الله عليه وسلم تزوجها وذكر أشياء هذا فيه قال ‏\"‏ إن شئت أن أسبع لك وأسبع لنسائي وإن سبعت لك سبعت لنسائي ‏\"‏ ‏.‏",
      "text_en": " Umm Salama (Allah be pleased with her) reported that Allah's Messenger (may peace be upon him) married her, and he (the narrator) made mention of so many things in this connection (and one of them was this) that he said:                      If you desire that I spend a week with you, I shall have to spend a week with my (other) wives, and if spend a week with you, I shall have to spend a week with my (other) wives.",
      "chain": [
        "30216",
        "20317",
        "11560",
        "11003",
        "56"
      ]
    },
    {
      "hadith_no": "3806",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وعمرو الناقد، قالا حدثنا يزيد بن هارون، أخبرنا يحيى بن سعيد، عن حميد بن نافع، أنه سمع زينب بنت أبي سلمة، تحدث عن أم سلمة، وأم حبيبة تذكران أن امرأة أتت رسول الله صلى الله عليه وسلم فذكرت له أن بنتا لها توفي عنها زوجها فاشتكت عينها فهى تريد أن تكحلها فقال رسول الله صلى الله عليه وسلم ‏\"‏ قد كانت إحداكن ترمي بالبعرة عند رأس الحول وإنما هي أربعة أشهر وعشر ‏\"‏ ‏.‏",
      "text_en": " Zainab bint Abu Salama reported:                      Umm Salama and Umm Habiba (Allah be pleased with them) were talking with each other (and saying) that a woman came to Allah's Messenger (may peace be upon him) and mentioned to him that her daughter had lost her husband, and her eyes were sore and she wnted to use collyrium, whereupon Allah's Messenger (may peace be upon him) said: One among you used to throw dung at the end of a year, and now (this abstinence from adornment) is only for four months and ten days.",
      "chain": [
        "30201",
        "30263",
        "20472",
        "11062",
        "11157",
        "56"
      ]
    },
    {
      "hadith_no": "4570",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Judicial Decisions - كتاب الأقضية",
      "chapter_no": "31",
      "text_ar": "حدثنا يحيى بن يحيى التميمي، أخبرنا أبو معاوية، عن هشام بن عروة، عن أبيه، عن زينب بنت أبي سلمة، عن أم سلمة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ إنكم تختصمون إلى ولعل بعضكم أن يكون ألحن بحجته من بعض فأقضي له على نحو مما أسمع منه فمن قطعت له من حق أخيه شيئا فلا يأخذه فإنما أقطع له به قطعة من النار ‏\"‏ ‏.‏",
      "text_en": " Umm Salama reported Allah's Messenger (may peace be upon him) as saying:                      You bring to me, for (judgment) your disputes, some of you perhaps being more eloquent in their plea than others, so I give judgment on their behalf according to what I hear from them. (Bear in mind, in my judgment) if I slice off anything for him from the right of his brother, he should not accept that, for I sliced off for him a portion from the Hell.",
      "chain": [
        "30399",
        "20354",
        "11065",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "4906",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا هداب بن خالد الأزدي، حدثنا همام بن يحيى، حدثنا قتادة، عن الحسن، عن ضبة بن محصن، عن أم سلمة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ستكون أمراء فتعرفون وتنكرون فمن عرف برئ ومن أنكر سلم ولكن من رضي وتابع ‏\"‏ ‏.‏ قالوا أفلا نقاتلهم قال ‏\"‏ لا ما صلوا ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Umm Salama that the Messenger of Allah (may peace be upon him) said:                      In the near future there will be Amirs and you will like their good deeds and dislike their bad deeds. One who sees through their bad deeds (and tries to prevent their repetition by his band or through his speech), is absolved from blame, but one who hates their bad deeds (in the heart of his heart, being unable to prevent their recurrence by his hand or his tongue), is (also) fafe ( so far as God's wrath is concerned). But one who approves of their bad deeds and imitates them is spiritually ruined. People asked (the Holy Prophet): Shouldn't we fight against them? He replied: No, as long as they say their prayers.",
      "chain": [
        "20297",
        "11019",
        "11016",
        "56"
      ]
    },
    {
      "hadith_no": "4908",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثني أبو الربيع العتكي، حدثنا حماد، - يعني ابن زيد - حدثنا المعلى بن، زياد وهشام عن الحسن، عن ضبة بن محصن، عن أم سلمة، قالت قال رسول الله صلى الله عليه وسلم ‏.‏ بنحو ذلك غير أنه قال ‏\"‏ فمن أنكر فقد برئ ومن كره فقد سلم ‏\"‏ ‏.‏",
      "text_en": " Another version of the tradition narrated on the same authority attributes the same words to the Messenger of Allah (may peace be upon him) except that it replaces kariha with ankhara and vice versa.",
      "chain": [
        "20022",
        "11016",
        "56"
      ]
    },
    {
      "hadith_no": "4909",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثناه حسن بن الربيع البجلي، حدثنا ابن المبارك، عن هشام، عن الحسن، عن ضبة بن محصن، عن أم سلمة، قالت قال رسول الله صلى الله عليه وسلم ‏.‏ فذكر مثله إلا قوله ‏\"‏ ولكن من رضي وتابع ‏\"‏ ‏.‏ لم يذكره ‏.‏",
      "text_en": " Another version omits a portion at the end of the tradition-a portion which begins with man radiya wa taba and ends with the last word of the tradition.",
      "chain": [
        "20025",
        "11065",
        "11016",
        "56"
      ]
    },
    {
      "hadith_no": "5232",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "حدثنا ابن أبي عمر المكي، حدثنا سفيان، عن عبد الرحمن بن حميد بن عبد الرحمن، بن عوف سمع سعيد بن المسيب، يحدث عن أم سلمة، أن النبي صلى الله عليه وسلم قال ‏\"‏ إذا دخلت العشر وأراد أحدكم أن يضحي فلا يمس من شعره وبشره شيئا ‏\"‏ ‏.‏ قيل لسفيان فإن بعضهم لا يرفعه قال لكني أرفعه ‏.‏",
      "text_en": " Umm Salama reported Allah's Messenger (may peace be upon him) having said this:                      When any one of you intending to sacrifice the animal enters in the month (of Dhu'l-Hijja) he should not get his hair or nails touched (cut). It was said to Sufyan that some of the (scholars) did not deem this hadith to be Maffu'. He said: But I deem it as Marfu' (i. e. chain of narration traceable right up to the Holy Prophet).",
      "chain": [
        "30421",
        "20005",
        "11193",
        "11002",
        "56"
      ]
    },
    {
      "hadith_no": "5234",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "وحدثني حجاج بن الشاعر، حدثني يحيى بن كثير العنبري أبو غسان، حدثنا  شعبة، عن مالك بن أنس، عن عمر بن مسلم، عن سعيد بن المسيب، عن أم سلمة، أن النبي صلى الله عليه وسلم قال ‏\"‏ إذا رأيتم هلال ذي الحجة وأراد أحدكم أن يضحي فليمسك عن شعره وأظفاره ‏\"‏ ‏.‏",
      "text_en": " Umm Salama reported (these words) directly from Allah's Messenger (may peace be upon him):                      If anyone has in his possession a sacrificial animal to offer as a sacrifice (on 'Id al-Adha), he should not get his hair cut and nails trimmed after he has entered the first days of Dhu'l Hijja",
      "chain": [
        "38834",
        "20302",
        "20020",
        "20001",
        "11002",
        "56"
      ]
    },
    {
      "hadith_no": "5509",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "وحدثني زيد بن يزيد أبو معن الرقاشي، حدثنا أبو عاصم، عن عثمان، - يعني ابن مرة - حدثنا عبد الله بن عبد الرحمن، عن خالته أم سلمة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ من شرب في إناء من ذهب أو فضة فإنما يجرجر في بطنه نارا من جهنم ‏\"‏ ‏.‏",
      "text_en": " Abd al-Rahman reported on the authority of his mother's sister Umm Salama who said that Allah's Messenger (may peace be upon him) said:                      He who drank in vessels of gold or silver he in fact drank down in his belly the fire of Hell.",
      "chain": [
        "20241",
        "30025",
        "56"
      ]
    },
    {
      "hadith_no": "5819",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا وكيع، ح وحدثنا إسحاق، بن إبراهيم أخبرنا جرير، ح وحدثنا أبو كريب، حدثنا أبو معاوية، كلهم عن هشام، ح وحدثنا أبو كريب، أيضا - واللفظ هذا - حدثنا ابن نمير، حدثنا هشام، عن أبيه، عن زينب، بنت أم سلمة عن أم سلمة، أن مخنثا، كان عندها ورسول الله صلى الله عليه وسلم في البيت فقال لأخي أم سلمة يا عبد الله بن أبي أمية إن فتح الله عليكم الطائف غدا فإني أدلك على بنت غيلان فإنها تقبل بأربع وتدبر بثمان ‏.‏ قال فسمعه رسول الله صلى الله عليه وسلم فقال ‏\"‏ لا يدخل هؤلاء عليكم ‏\"‏ ‏.‏",
      "text_en": " Umm Salama reported that she had a eunuch (as a slave) in her house. Allah's Messenger imay peace be upon him) was once in the house that he (the eunuch) said to the brother of Umm Salama:                      Abdullahb. Aba Umayya. if Allah grants you victory in Ta'if on the next day, I will show you the daughter of Ghailan for she has four folds (upon her body) on the front side of her stomach and eight folds on the back. Allah's Messenger (may peace be upon him) heard this and he said: Such (people) should not visit you.",
      "chain": [
        "30201",
        "30216",
        "20032",
        "30123",
        "4057",
        "30216",
        "20295",
        "30212",
        "20295",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "7506",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "وحدثني محمد بن عمرو بن جبلة، حدثنا محمد بن جعفر، ح وحدثنا عقبة بن، مكرم العمي وأبو بكر بن نافع قال عقبة حدثنا وقال أبو بكر، أخبرنا غندر، حدثنا شعبة، قال سمعت خالدا، يحدث عن سعيد بن أبي الحسن، عن أمه، عن أم سلمة، أن رسول الله صلى الله عليه وسلم قال لعمار ‏\"‏ تقتلك الفئة الباغية ‏\"‏ ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Umm Salama that Allah's Messenger (may peace be upon him) said to 'Ammar:                      A group of rebels would kill you.",
      "chain": [
        "38562",
        "20173",
        "30441",
        "189",
        "20436",
        "20278",
        "20020",
        "11282",
        "11287",
        "10737",
        "56"
      ]
    },
    {
      "hadith_no": "7507",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "وحدثني إسحاق بن منصور، أخبرنا عبد الصمد بن عبد الوارث، حدثنا شعبة، حدثنا خالد الحذاء، عن سعيد بن أبي الحسن، والحسن، عن أمهما، عن أم سلمة، عن النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Umm Salam through another chain of transmitters.",
      "chain": [
        "30313",
        "20250",
        "20020",
        "11282",
        "11287",
        "11016",
        "56"
      ]
    },
    {
      "hadith_no": "7508",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا إسماعيل بن إبراهيم، عن ابن عون، عن  الحسن، عن أمه، عن أم سلمة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ تقتل عمارا الفئة الباغية ‏\"‏ ‏.‏",
      "text_en": " Unmm Salama reported that Allah's Messenger (may peace be upon him) said:                      A band of rebels would kill 'Ammar.",
      "chain": [
        "30201",
        "20208",
        "11071",
        "11016",
        "10737",
        "56"
      ]
    },
    {
      "hadith_no": "251",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا زهير بن حرب، وابن السرح، قالا حدثنا سفيان بن عيينة، عن أيوب بن موسى، عن سعيد بن أبي سعيد، عن عبد الله بن رافع، مولى أم سلمة عن أم سلمة، أن امرأة، من المسلمين - وقال زهير إنها - قالت يا رسول الله إني امرأة أشد ضفر رأسي أفأنقضه للجنابة قال ‏\"‏ إنما يكفيك أن تحفني عليه ثلاثا ‏\"‏ ‏.‏ وقال زهير ‏\"‏ تحثي عليه ثلاث حثياث من ماء ثم تفيضي على سائر جسدك فإذا أنت قد طهرت ‏\"‏ ‏.‏",
      "text_en": " Umm Salamah said:                      one of the Muslims asked, and Zubair reported: Umm Salamah (herself) asked: Messenger of Allah. I am a women who keeps her hair closely plaited; should I undo it when I wash after sexual defilement? He replied (no), it is enough for you to throw three handfuls over it. Then pour water over all your body and will be purified.",
      "chain": [
        "30022",
        "30485",
        "20005",
        "11241",
        "11168",
        "11864",
        "56"
      ]
    },
    {
      "hadith_no": "252",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن عمرو بن السرح، حدثنا ابن نافع، - يعني الصائغ - عن أسامة، عن المقبري، عن أم سلمة، أن امرأة، جاءت إلى أم سلمة بهذا الحديث ‏.‏ قالت فسألت لها النبي صلى الله عليه وسلم بمعناه قال فيه ‏\"‏ واغمزي قرونك عند كل حفنة ‏\"‏ ‏.‏",
      "text_en": " Umm Salamah said:                      A women came to her, this is according to the version of the former tradition. I asked the Prophet (May peace be upon him) a similar question (as in the former tradition). But this version adds: “And wring out your locks after every handful of water”.",
      "chain": [
        "30485",
        "50",
        "11168",
        "56"
      ]
    },
    {
      "hadith_no": "275",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا قتيبة بن سعيد، ويزيد بن خالد بن يزيد بن عبد الله بن موهب، قالا حدثنا الليث، عن نافع، عن سليمان بن يسار، أن رجلا، أخبره عن أم سلمة، أن امرأة، كانت تهراق الدم ‏.‏ فذكر معناه قال ‏\"‏ فإذا خلفت ذلك وحضرت الصلاة فلتغتسل ‏\"‏ ‏.‏ بمعناه ‏.‏",
      "text_en": " Sulaiman b. Yasar said that a man reported to him from Umm Salamah; There was a woman who had an issue of blood. And he narrated the rest of the tradition to the same effect saying; when the menstruation period is over and the time of prayer arrives, she should take a bath, as mentioned in the previous tradition.",
      "chain": [
        "30367",
        "38715",
        "20023",
        "11014",
        "11005",
        "56"
      ]
    },
    {
      "hadith_no": "311",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن يونس، أخبرنا زهير، حدثنا علي بن عبد الأعلى، عن أبي سهل، عن مسة، عن أم سلمة، قالت كانت النفساء على عهد رسول الله صلى الله عليه وسلم تقعد بعد نفاسها أربعين يوما أو أربعين ليلة وكنا نطلي على وجوهنا الورس يعني من الكلف ‏.‏",
      "text_en": " Narrated Umm Salamah, Ummul Mu'minin:                     The woman having bleeding after delivery (puerperal haemorrhage) would refrain (from prayer) for forty days or forty nights; and we would anoint our faces with an aromatic herb called wars to remove dark spots.",
      "chain": [
        "30184",
        "20321",
        "19877",
        "14330",
        "19523",
        "56"
      ]
    },
    {
      "hadith_no": "312",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا الحسن بن يحيى، أخبرنا محمد بن حاتم، - يعني حبي - حدثنا عبد الله بن المبارك، عن يونس بن نافع، عن كثير بن زياد، قال حدثتني الأزدية، - يعني مسة - قالت حججت فدخلت على أم سلمة فقلت يا أم المؤمنين إن سمرة بن جندب يأمر النساء يقضين صلاة المحيض ‏.‏ فقالت لا يقضين كانت المرأة من نساء النبي صلى الله عليه وسلم تقعد في النفاس أربعين ليلة لا يأمرها النبي صلى الله عليه وسلم بقضاء صلاة النفاس ‏.‏ قال محمد يعني ابن حاتم واسمها مسة تكنى أم بسة ‏.‏ قال أبو داود كثير بن زياد كنيته أبو سهل ‏.‏",
      "text_en": " \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAl-Azdiyyah, viz. Mussah, said:                      I performed Hajj and came to Umm Salamah and said (to her): Mother of the believers, Samurah b. Jundub commands women to complete the prayers abandoned during their menstrual period. She said: They should not do so. The wives of the Prophet (ﷺ) would refrain (from prayer) for forty nights (i.e. days) during the course of bleeding after child birth. The Prophet (ﷺ) would not command them to complete the prayers abandoned during the period of bleeding.Muhammad b. Hatim said: The name of Al-Azdiyyah is Mussah and her patronymic name is Umm Busrah.Abu Dawud said: The patronymic names of Kathir b. Ziyad s Abu Sahl.",
      "chain": [
        "34057",
        "30514",
        "20025",
        "28664",
        "14330",
        "19523",
        "56"
      ]
    },
    {
      "hadith_no": "530",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مؤمل بن إهاب، حدثنا عبد الله بن الوليد العدني، حدثنا القاسم بن معن، حدثنا المسعودي، عن أبي كثير، مولى أم سلمة عن أم سلمة، قالت علمني رسول الله صلى الله عليه وسلم أن أقول عند أذان المغرب ‏\"‏ اللهم إن هذا إقبال ليلك وإدبار نهارك وأصوات دعاتك فاغفر لي ‏\"‏ ‏.‏",
      "text_en": " Narrated Umm Salamah, Ummul Mu'minin:                     The Messenger of Allah (ﷺ) taught me to say when the adhan for the sunset prayer was called; \"O Allah, this is the time when Thy night comes on, Thy day retires, and the voices of Thy summoners are heard, so forgive me.\"",
      "chain": [
        "35156",
        "33014",
        "25240",
        "20724",
        "56"
      ]
    },
    {
      "hadith_no": "640",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مجاهد بن موسى، حدثنا عثمان بن عمر، حدثنا عبد الرحمن بن عبد الله، - يعني ابن دينار - عن محمد بن زيد، بهذا الحديث قال عن أم سلمة، أنها سألت النبي صلى الله عليه وسلم أتصلي المرأة في درع وخمار ليس عليها إزار قال ‏\"‏ إذا كان الدرع سابغا يغطي ظهور قدميها ‏\"‏ ‏.‏ قال أبو داود روى هذا الحديث مالك بن أنس وبكر بن مضر وحفص بن غياث وإسماعيل بن جعفر وابن أبي ذئب وابن إسحاق عن محمد بن زيد عن أمه عن أم سلمة لم يذكر أحد منهم النبي صلى الله عليه وسلم قصروا به على أم سلمة رضى الله عنها ‏.‏",
      "text_en": " Umm Salamah said that she asked the prophet (ﷺ); Can a woman pray in a shirt and veil without wearing a lower garment? He replied:                      if the shirt is ample and covers the surface of her feet.Abu Dawud said: This tradition has been transmitted by Malik b. Anas, Bakr b. Mudar, Hafs b. Ghiyaht, Isma'il b. Ja'far, Ibn Abu Dhi'b, and Ibn Ishaq from Muhammad b. Zaid on the authority of his mother who narrated from Umm Salamah. None of these narrators mention the name of the Prophet (ﷺ). They reported it directly from Umm Salamah.",
      "chain": [
        "30521",
        "20262",
        "20439",
        "11217",
        "56"
      ]
    },
    {
      "hadith_no": "1040",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن يحيى، ومحمد بن رافع، قالا حدثنا عبد الرزاق، أخبرنا معمر، عن الزهري، عن هند بنت الحارث، عن أم سلمة، قالت كان رسول الله صلى الله عليه وسلم إذا سلم مكث قليلا وكانوا يرون أن ذلك كيما ينفذ النساء قبل الرجال ‏.‏",
      "text_en": " Umm Salamah said; When the Messenger of Allah (ﷺ) gave the salutation, he stayed for a while. By this people thought that women should return earlier than men.",
      "chain": [
        "11222",
        "30375",
        "20121",
        "20115",
        "11013",
        "11734",
        "56"
      ]
    },
    {
      "hadith_no": "1466",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا يزيد بن خالد بن موهب الرملي، حدثنا الليث، عن ابن أبي مليكة، عن يعلى بن مملك، أنه سأل أم سلمة عن قراءة، رسول الله صلى الله عليه وسلم وصلاته فقالت وما لكم وصلاته كان يصلي وينام قدر ما صلى ثم يصلي قدر ما نام ثم ينام قدر ما صلى حتى يصبح ونعتت قراءته فإذا هي تنعت قراءته حرفا حرفا ‏.‏",
      "text_en": " Narrated Umm Salamah, Ummul Mu'minin:                     Ya'la ibn Mumallak said that he asked Umm Salamah about the recitation and prayer of the Messenger of Allah (ﷺ). She said: What have you to do with his prayer? He would pray, then sleep as long as he had prayed, till morning. She then described his recitation and did so with an exposition word by word.",
      "chain": [
        "38715",
        "20023",
        "11090",
        "56"
      ]
    },
    {
      "hadith_no": "1564",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا عتاب، - يعني ابن بشير - عن ثابت بن عجلان، عن عطاء، عن أم سلمة، قالت كنت ألبس أوضاحا من ذهب فقلت يا رسول الله أكنز هو فقال ‏\"‏ ما بلغ أن تؤدى زكاته فزكي فليس بكنز ‏\"‏ ‏.‏",
      "text_en": " Narrated Umm Salamah, Ummul Mu'minin:                     I used to wear gold ornaments. I asked: Is that a treasure (kanz), Messenger of Allah? He replied: whatever reaches a quantity on which zakat is payable is not a treasure (kanz) when the zakat is paid.",
      "chain": [
        "31167",
        "20446",
        "11676",
        "11029",
        "56"
      ]
    },
    {
      "hadith_no": "2056",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا زهير، عن هشام بن عروة، عن عروة، عن زينب بنت أم سلمة، عن أم سلمة، أن أم حبيبة، قالت يا رسول الله هل لك في أختي قال ‏\"‏ فأفعل ماذا ‏\"‏ ‏.‏ قالت فتنكحها ‏.‏ قال ‏\"‏ أختك ‏\"‏ ‏.‏ قالت نعم ‏.‏ قال ‏\"‏ أوتحبين ذاك ‏\"‏ ‏.‏ قالت لست بمخلية بك وأحب من شركني في خير أختي ‏.‏ قال ‏\"‏ فإنها لا تحل لي ‏\"‏ ‏.‏ قالت فوالله لقد أخبرت أنك تخطب درة - أو ذرة شك زهير - بنت أبي سلمة ‏.‏ قال ‏\"‏ بنت أم سلمة ‏\"‏ ‏.‏ قالت نعم ‏.‏ قال ‏\"‏ أما والله لو لم تكن ربيبتي في حجري ما حلت لي إنها ابنة أخي من الرضاعة أرضعتني وأباها ثويبة فلا تعرضن على بناتكن ولا أخواتكن ‏\"‏ ‏.‏",
      "text_en": " Umm Salamah reported Umm Habibah said “Are you interested in my sister, Apostle of Allaah(ﷺ)?” He said “What should I do?” She said “You marry her” He said “Your sister?” She said “Yes”. He said “Do you like that?” she said “I am not alone with you of those who share me in this good, my sister is most to my liking. He said “She is not lawful for me.” She said “By Allaah, I was told that you were going to betroth with you Darrah to Durrah , the narrator Zuhair doubted the daughter of Abu Salamah. He said “The daughter of Umm Salamah? She said “Yes”. He said “(She is my step daughter). Even if she had not been my step daughter under my protection, she would not have been lawful for me. She is my foster niece (daughter of my brother by fosterage). Thuwaibah suckled me as well as his father (Abu Salamah). So do not present to me your daughters and your sisters.",
      "chain": [
        "30352",
        "20321",
        "11065",
        "10511",
        "244",
        "56",
        "59"
      ]
    },
    {
      "hadith_no": "2122",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا زهير بن حرب، حدثنا يحيى، عن سفيان، قال حدثني محمد بن أبي بكر، عن عبد الملك بن أبي بكر، عن أبيه، عن أم سلمة، أن رسول الله صلى الله عليه وسلم لما تزوج أم سلمة أقام عندها ثلاثا ثم قال ‏\"‏ ليس بك على أهلك هوان إن شئت سبعت لك وإن سبعت لك سبعت لنسائي ‏\"‏ ‏.‏",
      "text_en": " 'Abd al-Malik b. Abi Bakr reported from his father on the authority of Umm Salamah:                      When the Messenger of Allah (ﷺ) married Umm Salamah, he stayed with her three night, and said: Your people (i.e. clan) are not being humbled for you in my estimation. If you wish I shall stay with you seven nights ; and if I stay you seven nights, I shall stay with my other wives seven nights.",
      "chain": [
        "30022",
        "20031",
        "20012",
        "11214",
        "11239",
        "56"
      ]
    },
    {
      "hadith_no": "2336",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا محمد بن جعفر، حدثنا شعبة، عن توبة العنبري، عن محمد بن إبراهيم، عن أبي سلمة، عن أم سلمة، عن النبي صلى الله عليه وسلم أنه لم يكن يصوم من السنة شهرا تاما إلا شعبان يصله برمضان ‏.‏",
      "text_en": " Narrated Umm Salamah, Ummul Mu'minin:                     She never saw the Prophet (ﷺ) fasting the whole month except Sha'ban which he combined with Ramadan.",
      "chain": [
        "30007",
        "20173",
        "20020",
        "11579",
        "11213",
        "10567",
        "56"
      ]
    },
    {
      "hadith_no": "3115",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، عن الأعمش، عن أبي وائل، عن أم سلمة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا حضرتم الميت فقولوا خيرا فإن الملائكة يؤمنون على ما تقولون ‏\"‏ ‏.‏ فلما مات أبو سلمة قلت يا رسول الله ما أقول قال ‏\"‏ قولي اللهم اغفر له وأعقبنا عقبى صالحة ‏\"‏ ‏.‏ قالت فأعقبني الله تعالى به محمدا صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Umm Salamah:                     The Messenger of Allah (ﷺ): When you attend dying man, you should say good words, for the angels say Amin to what you say. When Abu Salamah died, I said: What should I say, Messenger of Allah? He said: O Allah forgive him, and give us something good in exchange. She said: So Allah gave me Muhammad (ﷺ) in exchange for him.",
      "chain": [
        "28531",
        "20012",
        "11060",
        "11353",
        "56"
      ]
    },
    {
      "hadith_no": "3118",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا عبد الملك بن حبيب أبو مروان، حدثنا أبو إسحاق، - يعني الفزاري - عن خالد الحذاء، عن أبي قلابة، عن قبيصة بن ذؤيب، عن أم سلمة، قالت دخل رسول الله صلى الله عليه وسلم على أبي سلمة وقد شق بصره فأغمضه فصيح ناس من أهله فقال ‏\"‏ لا تدعوا على أنفسكم إلا بخير فإن الملائكة يؤمنون على ما تقولون ‏\"‏ ‏.‏ ثم قال ‏\"‏ اللهم اغفر لأبي سلمة وارفع درجته في المهديين واخلفه في عقبه في الغابرين واغفر لنا وله رب العالمين اللهم افسح له في قبره ونور له فيه ‏\"‏ ‏.‏ قال أبو داود وتغميض الميت بعد خروج الروح سمعت محمد بن محمد بن النعمان المقرئ قال سمعت أبا ميسرة رجلا عابدا يقول غمضت جعفرا المعلم وكان رجلا عابدا في حالة الموت فرأيته في منامي ليلة مات يقول أعظم ما كان على تغميضك لي قبل أن أموت ‏.‏",
      "text_en": " Narrated Umm Salamah:                     When the Messenger of Allah (ﷺ) entered upon Abu Salamah, his eyes were fixedly open. So he closed them. The members of his family cried. He said: Do not pray for yourself anything but good, for the angels utter Amin to what you say. He then said: O Allah, forgive Abu Salamah, raise his rank among those who are guided, and grant him a succession in his descendants who remain. Forgive both us and him, Lord of the universe. O Allah,make his grave spacious for him, and grant him light in it.Abu Dawud said: The eyes of the deceased should be closed after his expiry. I heard Muhammad b. al-Nu'man al-Muqri say: I heard a man who was devoted to Allah say: I closed the eyes of Ja'far al-Mu'allim when he was dying. He was a man devoted to Allah. I saw him in a dream on the night he died. He said: The biggest thing for me was closing the eyes by you before I died.",
      "chain": [
        "20405",
        "11282",
        "11047",
        "56"
      ]
    },
    {
      "hadith_no": "3119",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، أخبرنا ثابت، عن ابن عمر بن أبي سلمة، عن أبيه، عن أم سلمة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا أصابت أحدكم مصيبة فليقل ‏{‏ إنا لله وإنا إليه راجعون ‏}‏ اللهم عندك أحتسب مصيبتي فآجرني فيها وأبدل لي خيرا منها ‏\"‏ ‏.‏",
      "text_en": " Narrated Umm Salamah:                     The Messenger of Allah (ﷺ) as saying: When one of you is afflicted with a calamity, he should say: \"We belong to Allah, and to Him we do return.\" O Allah, I expect reward from Thee from this affliction, so give me reward for it, and give me a better compensation.",
      "chain": [
        "20040",
        "20022",
        "11269",
        "56"
      ]
    },
    {
      "hadith_no": "3583",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، عن هشام بن عروة، عن عروة، عن زينب بنت أم سلمة، عن أم سلمة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ إنما أنا بشر وإنكم تختصمون إلى ولعل بعضكم أن يكون ألحن بحجته من بعض فأقضي له على نحو ما أسمع منه فمن قضيت له من حق أخيه بشىء فلا يأخذ منه شيئا فإنما أقطع له قطعة من النار ‏\"‏ ‏.‏",
      "text_en": " Umm Salamah reported the Messenger of Allah (ﷺ) as saying:                      \"I am only a human being, and you bring your disputes to me, some perhaps being more eloquent in their plea than others, so that I give judgement on their behalf according to what I hear from them. Therefore, whatever I decide for anyone which by right belongs to his brother, he must not take anything, for I am granting him only a portion of Hell.",
      "chain": [
        "28531",
        "20012",
        "11065",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "3584",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا الربيع بن نافع أبو توبة، حدثنا ابن المبارك، عن أسامة بن زيد، عن عبد الله بن رافع، مولى أم سلمة عن أم سلمة، قالت أتى رسول الله صلى الله عليه وسلم رجلان يختصمان في مواريث لهما لم تكن لهما بينة إلا دعواهما فقال النبي صلى الله عليه وسلم فذكر مثله فبكى الرجلان وقال كل واحد منهما حقي لك ‏.‏ فقال لهما النبي صلى الله عليه وسلم ‏\"‏ أما إذ فعلتما ما فعلتما فاقتسما وتوخيا الحق ‏.‏ ثم استهما ثم تحالا ‏\"‏ ‏.‏",
      "text_en": " Umm Salamah said:                      Two men came to the Messenger of Allah (ﷺ) who were disputing over their inheritance. They had no evidence except their claim. The Prophet (ﷺ) then said in a similar way. Thereupon both the men wept and each of them said: This right of mine go to you. The Prophet (ﷺ) then said: Now you have done whatever you have done ; do divide it up, aiming at what is right, then drew lots, and let each of you consider the other to have what is legitimately his\"",
      "chain": [
        "30335",
        "20025",
        "50",
        "11864",
        "56"
      ]
    },
    {
      "hadith_no": "3585",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا إبراهيم بن موسى الرازي، أخبرنا عيسى، حدثنا أسامة، عن عبد الله بن رافع، قال سمعت أم سلمة، عن النبي صلى الله عليه وسلم بهذا الحديث قال يختصمان في مواريث وأشياء قد درست فقال ‏\"‏ إني إنما أقضي بينكم برأيي فيما لم ينزل على فيه ‏\"‏ ‏.‏",
      "text_en": " Umm Salamah reported the Prophet (ﷺ) as saying when two men were disputing over inheritance and old things:                      I decide between you on the basis of my opinion in cases about which no revelation has been sent down to me.",
      "chain": [
        "30309",
        "20347",
        "50",
        "11864",
        "56"
      ]
    },
    {
      "hadith_no": "3686",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Drinks (Kitab Al-Ashribah) - كتاب الأشربة",
      "chapter_no": "27",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا أبو شهاب عبد ربه بن نافع، عن الحسن بن عمرو الفقيمي، عن الحكم بن عتيبة، عن شهر بن حوشب، عن أم سلمة، قالت نهى رسول الله صلى الله عليه وسلم عن كل مسكر ومفتر ‏.‏",
      "text_en": " Narrated Umm Salamah, Ummul Mu'minin:                     The Messenger of Allah (ﷺ) forbade every intoxicant and everything which produces languidness.",
      "chain": [
        "30116",
        "20437",
        "11624",
        "11069",
        "11044",
        "56"
      ]
    },
    {
      "hadith_no": "4001",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Dialects and Readings of the Qur'an (Kitab Al-Huruf Wa Al-Qira'at) - كتاب الحروف والقراءات",
      "chapter_no": "32",
      "text_ar": "حدثنا سعيد بن يحيى الأموي، حدثني أبي، حدثنا ابن جريج، عن عبد الله بن أبي مليكة، عن أم سلمة، أنها ذكرت - أو كلمة غيرها - قراءة رسول الله صلى الله عليه وسلم ‏{‏ بسم الله الرحمن الرحيم * الحمد لله رب العالمين * الرحمن الرحيم * ملك يوم الدين ‏}‏ يقطع قراءته آية آية ‏.‏ قال أبو داود سمعت أحمد يقول القراءة القديمة ‏{‏ مالك يوم الدين ‏}‏ ‏.‏",
      "text_en": " Narrated Umm Salamah, Ummul Mu'minin:                     The Messenger of Allah (ﷺ) used to recite: \"In the name of Allah, the Cherisher and Sustainer of the worlds; most Gracious, most Merciful; Master of the Day of Judgment,\" breaking its recitation into verses, one after another.Abu Dawud said: I heard Ahmad (b. Hanbal) say: The early reading is: Maliki yawmi'l-din.",
      "chain": [
        "30254",
        "20367",
        "11070",
        "11090",
        "56"
      ]
    },
    {
      "hadith_no": "4025",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا إبراهيم بن موسى، حدثنا الفضل بن موسى، عن عبد المؤمن بن خالد الحنفي، عن عبد الله بن بريدة، عن أم سلمة، قالت كان أحب الثياب إلى رسول الله صلى الله عليه وسلم القميص ‏.‏",
      "text_en": " Narrated Umm Salamah, Ummul Mu'minin:                     The clothing which the Messenger of Allah (ﷺ) liked best was shirt.",
      "chain": [
        "30309",
        "20452",
        "28375",
        "11432",
        "56"
      ]
    },
    {
      "hadith_no": "4026",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا زياد بن أيوب، حدثنا أبو تميلة، قال حدثني عبد المؤمن بن خالد، عن عبد الله بن بريدة، عن أبيه، عن أم سلمة، قالت لم يكن ثوب أحب إلى رسول الله صلى الله عليه وسلم من قميص ‏.‏",
      "text_en": " Narrated Umm Salamah, Ummul Mu'minin:                     No clothing was dearer to be Messenger of Allah (ﷺ) than shirt.",
      "chain": [
        "30249",
        "20183",
        "28375",
        "11432",
        "3131",
        "56"
      ]
    },
    {
      "hadith_no": "4101",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد بن عبيد، حدثنا محمد بن ثور، عن معمر، عن ابن خثيم، عن صفية بنت شيبة، عن أم سلمة، قالت لما نزلت ‏{‏ يدنين عليهن من جلابيبهن ‏}‏ خرج نساء الأنصار كأن على رءوسهن الغربان من الأكسية ‏.‏",
      "text_en": " Narrated Umm Salamah, Ummul Mu'minin:                     When the verse \"That they should cast their outer garments over their persons\" was revealed, the women of Ansar came out as if they had crows over their heads by wearing outer garments.",
      "chain": [
        "30213",
        "28500",
        "20115",
        "2802",
        "56"
      ]
    },
    {
      "hadith_no": "4112",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا ابن المبارك، عن يونس، عن الزهري، قال حدثني نبهان، مولى أم سلمة عن أم سلمة، قالت كنت عند رسول الله صلى الله عليه وسلم وعنده ميمونة فأقبل ابن أم مكتوم وذلك بعد أن أمرنا بالحجاب فقال النبي صلى الله عليه وسلم ‏\"‏ احتجبا منه ‏\"‏ ‏.‏ فقلنا يا رسول الله أليس أعمى لا يبصرنا ولا يعرفنا فقال النبي صلى الله عليه وسلم ‏\"‏ أفعمياوان أنتما ألستما تبصرانه ‏\"‏ ‏.‏ قال أبو داود هذا لأزواج النبي صلى الله عليه وسلم خاصة ألا ترى إلى اعتداد فاطمة بنت قيس عند ابن أم مكتوم قد قال النبي صلى الله عليه وسلم لفاطمة بنت قيس ‏\"‏ اعتدي عند ابن أم مكتوم فإنه رجل أعمى تضعين ثيابك عنده ‏\"‏ ‏.‏",
      "text_en": " Narrated Umm Salamah, Ummul Mu'minin:                     I was with the Messenger of Allah (ﷺ) while Maymunah was with him. Then Ibn Umm Maktum came. This happened when we were ordered to observe veil (purdah). The Prophet (ﷺ) said: Observe veil from him. We asked: Messenger of Allah! is he not blind? He can neither see us nor recognise us. The Prophet (ﷺ) said: Are both of you blind? Do you not see him? AbuDawud said: This was peculiar to the wives of the Prophet (ﷺ). Do you not see that Fatimah daughter of Qays passed her waiting period with Ibn Umm Maktum. The Prophet (ﷺ) said to Fatimah daughter of Qays: Pass your waiting period with Ibn Umm Maktum, for he is a blind man. You can put off your clothes with him.",
      "chain": [
        "30216",
        "20025",
        "20475",
        "11013",
        "56"
      ]
    },
    {
      "hadith_no": "4115",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا زهير بن حرب، حدثنا عبد الرحمن، ح وحدثنا مسدد، حدثنا يحيى، عن سفيان، عن حبيب بن أبي ثابت، عن وهب، مولى أبي أحمد عن أم سلمة، أن النبي صلى الله عليه وسلم دخل عليها وهي تختمر فقال ‏\"‏ لية لا ليتين ‏\"‏ ‏.‏ قال أبو داود معنى قوله ‏\"‏ لية لا ليتين ‏\"‏ ‏.‏ يقول لا تعتم مثل الرجل لا تكرره طاقا أو طاقين ‏.‏",
      "text_en": " Narrated Umm Salamah, Ummul Mu'minin:                     The Prophet (ﷺ) came to visit her when she was veiled, and said: use one fold and not two.Abu Dawud said: \"Use one fold and not two\" means: \"Do not fold it like the turban of a man. Do not double it up manifolds.\"",
      "chain": [
        "30022",
        "20033",
        "30175",
        "20031",
        "20012",
        "11331",
        "56"
      ]
    },
    {
      "hadith_no": "4118",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا إبراهيم بن موسى، أخبرنا عيسى، عن عبيد الله، عن نافع، عن سليمان بن يسار، عن أم سلمة، عن النبي صلى الله عليه وسلم بهذا الحديث ‏.‏ قال أبو داود رواه ابن إسحاق وأيوب بن موسى عن نافع عن صفية ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Umm Salamah from the Prophet (ﷺ) through a different chain of narrators.Abu Dawud said:                      Ibn Ishaq and Ayyub b. Musa transmitted it from Nafi' from Safiyyah.",
      "chain": [
        "30309",
        "20347",
        "11201",
        "11014",
        "11005",
        "56"
      ]
    },
    {
      "hadith_no": "4148",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا مسدد، حدثنا يزيد بن زريع، حدثنا خالد الحذاء، عن أبي قلابة، عن زينب بنت أم سلمة، عن أم سلمة، قالت كان فراشها حيال مسجد رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Umm Salamah, Ummul Mu'minin:                     Her bedding was in front of the place of prayer of the Prophet (ﷺ).",
      "chain": [
        "30175",
        "20304",
        "11282",
        "11047",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "4284",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Promised Deliverer (Kitab Al-Mahdi) - كتاب المهدى",
      "chapter_no": "38",
      "text_ar": "حدثنا أحمد بن إبراهيم، حدثنا عبد الله بن جعفر الرقي، حدثنا أبو المليح الحسن بن عمر، عن زياد بن بيان، عن علي بن نفيل، عن سعيد بن المسيب، عن أم سلمة، قالت سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ المهدي من عترتي من ولد فاطمة ‏\"‏ ‏.‏ قال عبد الله بن جعفر وسمعت أبا المليح يثني على علي بن نفيل ويذكر منه صلاحا ‏.‏",
      "text_en": " Narrated Umm Salamah, Ummul Mu'minin:                     The Prophet (ﷺ) said: The Mahdi will be of my family, of the descendants of Fatimah. Abdullah ibn Ja'far said: I heard AbulMalih praising Ali ibn Nufayl and describing his good qualities.",
      "chain": [
        "30494",
        "30346",
        "18303",
        "18760",
        "11002",
        "56"
      ]
    },
    {
      "hadith_no": "4288",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Promised Deliverer (Kitab Al-Mahdi) - كتاب المهدى",
      "chapter_no": "38",
      "text_ar": "حدثنا ابن المثنى، حدثنا عمرو بن عاصم، حدثنا أبو العوام، حدثنا قتادة، عن أبي الخليل، عن عبد الله بن الحارث، عن أم سلمة، عن النبي صلى الله عليه وسلم بهذا الحديث وحديث معاذ أتم ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Umm Salamah from the Prophet (ﷺ) through a different chain of narrators. The tradition of Mu'adh is more perfect.",
      "chain": [
        "30170",
        "20267",
        "11019",
        "11291",
        "912",
        "56"
      ]
    },
    {
      "hadith_no": "4289",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Promised Deliverer (Kitab Al-Mahdi) - كتاب المهدى",
      "chapter_no": "38",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن عبد العزيز بن رفيع، عن عبيد الله ابن القبطية، عن أم سلمة، عن النبي صلى الله عليه وسلم بقصة جيش الخسف قلت يا رسول الله فكيف بمن كان كارها قال ‏\"‏ يخسف بهم ولكن يبعث يوم القيامة على نيته ‏\"‏ ‏.‏",
      "text_en": " Umm salamah reported the Prophet (ﷺ) as saying about the swallowing up an army by the earth. I asked:                      How will a man who comes against his will (be swallowed up by the earth), Messenger of Allah ? He replied:  All will be swallowed up, but each will be raised according to his intention on the Day of Resurrection.",
      "chain": [
        "30203",
        "20028",
        "11257",
        "10794",
        "56"
      ]
    },
    {
      "hadith_no": "4761",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا ابن بشار، حدثنا معاذ بن هشام، قال حدثني أبي، عن قتادة، قال حدثنا الحسن، عن ضبة بن محصن العنزي، عن أم سلمة، عن النبي صلى الله عليه وسلم بمعناه قال ‏:‏ ‏\"‏ فمن كره فقد برئ، ومن أنكر فقد سلم ‏\"‏ ‏.‏ قال قتادة ‏:‏ يعني من أنكر بقلبه، ومن كره بقلبه ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Umm Salamah through a different chain of narrators to the same effect. This version has :                      He who disapproves is guiltless, and he who disapproves is safe. Qatadah said : it means one who feels its disapproval in his heart, and one who expresses disapproval in his heart.",
      "chain": [
        "30160",
        "20287",
        "20295",
        "11019",
        "11016",
        "56"
      ]
    },
    {
      "hadith_no": "4929",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن هشام، - يعني ابن عروة - عن أبيه، عن زينب بنت أم سلمة، عن أم سلمة، أن النبي صلى الله عليه وسلم دخل عليها وعندها مخنث وهو يقول لعبد الله أخيها إن يفتح الله الطائف غدا دللتك على امرأة تقبل بأربع وتدبر بثمان ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ أخرجوهم من بيوتكم ‏\"‏ ‏.‏ قال أبو داود المرأة كان لها أربع عكن في بطنها ‏.‏",
      "text_en": " Umm Salamah said that the Prophet (May peace be upon him) came upon her when there was with her a hermaohrodite (mukhannath) who said to her brother ‘Abd Allah (b. Abi Umayyah) :                      if Allah conquers al-Ta’if for you tomorrow, I shall lead you to a woman who has four folds of fats in front and eight behind. Thereupon the Prophet (May peace be upon him) said: Put them out of your houses.Abu Dawud said : The woman had four folds of fat on her belly.",
      "chain": [
        "30201",
        "20032",
        "11065",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "5094",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا شعبة، عن منصور، عن الشعبي، عن أم سلمة، قالت ما خرج النبي صلى الله عليه وسلم من بيتي قط إلا رفع طرفه إلى السماء فقال ‏\"‏ اللهم إني أعوذ بك أن أضل أو أضل أو أزل أو أزل أو أظلم أو أظلم أو أجهل أو يجهل على ‏\"‏ ‏.‏",
      "text_en": " Narrated Umm Salamah, Ummul Mu'minin:                     The Messenger of Allah (ﷺ) never went out of my house without raising his eye to the sky and saying: \"O Allah! I seek refuge in Thee lest I stray or be led astray, or slip or made to slip, or cause injustice, or suffer injustice, or do wrong, or have wrong done to me.\"",
      "chain": [
        "20285",
        "20020",
        "11067",
        "11052",
        "56"
      ]
    },
    {
      "hadith_no": "105",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان، عن أيوب بن موسى، عن سعيد المقبري، عن عبد الله بن رافع، عن أم سلمة، قالت قلت يا رسول الله إني امرأة أشد ضفر رأسي أفأنقضه لغسل الجنابة قال ‏\"‏ لا إنما يكفيك أن تحثين على رأسك ثلاث حثيات من ماء ثم تفيضين على سائر جسدك الماء فتطهرين ‏\"‏ ‏.‏ أو قال ‏\"‏ فإذا أنت قد تطهرت ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ والعمل على هذا عند أهل العلم أن المرأة إذا اغتسلت من الجنابة فلم تنقض شعرها أن ذلك يجزئها بعد أن تفيض الماء على رأسها ‏.‏",
      "text_en": " Umm Salamah narrated :                     \"I said: 'O Messenger of Allah! I am woman with tight braids on my head, should I undo it to perform Ghusl for Janabah? He said: 'No. It is sufficient that you only pour three scoops of water (with hands held together) over your head, then pour water over the rest of your body, to be purified.'\" Or he said: \"Then you will be purified.\"",
      "chain": [
        "30421",
        "20005",
        "11241",
        "11168",
        "11864",
        "56"
      ]
    },
    {
      "hadith_no": "122",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان بن عيينة، عن هشام بن عروة، عن أبيه، عن زينب بنت أبي سلمة، عن أم سلمة، قالت جاءت أم سليم بنت ملحان إلى النبي صلى الله عليه وسلم فقالت يا رسول الله إن الله لا يستحيي من الحق فهل على المرأة تعني غسلا إذا هي رأت في المنام مثل ما يرى الرجل قال ‏\"‏ نعم إذا هي رأت الماء فلتغتسل ‏\"‏ ‏.‏ قالت أم سلمة قلت لها فضحت النساء يا أم سليم ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وهو قول عامة الفقهاء أن المرأة إذا رأت في المنام مثل ما يرى الرجل فأنزلت أن عليها الغسل ‏.‏ وبه يقول سفيان الثوري والشافعي ‏.‏ قال وفي الباب عن أم سليم وخولة وعائشة وأنس ‏.‏",
      "text_en": " Umm Salamah narrated:                     Umm Sulaim bint Milhan came to the Prophet and she said: 'O Messenger of Allah! Indeed Allah is not embarrassed of the truth. So is it required of a woman - meaning Ghusl - when she sees in her sleep similar to what a man sees?' He replied: 'Yes. When she finds water (wetness), then she is perform Ghusl.'\" Umm Salamah said: \"I said to her: 'O Umm SuIaim! You have disgraced the women!'\"",
      "chain": [
        "30421",
        "20005",
        "11065",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "139",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا نصر بن علي الجهضمي، حدثنا شجاع بن الوليد أبو بدر، عن علي بن عبد الأعلى، عن أبي سهل، عن مسة الأزدية، عن أم سلمة، قالت كانت النفساء تجلس على عهد رسول الله صلى الله عليه وسلم أربعين يوما فكنا نطلي وجوهنا بالورس من الكلف ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من حديث أبي سهل عن مسة الأزدية عن أم سلمة ‏.‏ واسم أبي سهل كثير بن زياد ‏.‏ قال محمد بن إسماعيل علي بن عبد الأعلى ثقة وأبو سهل ثقة ‏.‏ ولم يعرف محمد هذا الحديث إلا من حديث أبي سهل ‏.‏ وقد أجمع أهل العلم من أصحاب النبي صلى الله عليه وسلم والتابعين ومن بعدهم على أن النفساء تدع الصلاة أربعين يوما إلا أن ترى الطهر قبل ذلك فإنها تغتسل وتصلي ‏.‏ فإذا رأت الدم بعد الأربعين فإن أكثر أهل العلم قالوا لا تدع الصلاة بعد الأربعين وهو قول أكثر الفقهاء ‏.‏ وبه يقول سفيان الثوري وابن المبارك والشافعي وأحمد وإسحاق ‏.‏ ويروى عن الحسن البصري أنه قال إنها تدع الصلاة خمسين يوما إذا لم تر الطهر ‏.‏ ويروى عن عطاء بن أبي رباح والشعبي ستين يوما ‏.‏",
      "text_en": " Umm Salamah narrated:                     \"The time of waiting for Nifas during the time of AIlah's Messenger was forty days. We used to cover our faces with reddish-brown Wars.\"",
      "chain": [
        "30395",
        "20328",
        "19877",
        "14330",
        "19523",
        "56"
      ]
    },
    {
      "hadith_no": "161",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا علي بن حجر، حدثنا إسماعيل ابن علية، عن أيوب، عن ابن أبي مليكة، عن أم سلمة، أنها قالت كان رسول الله صلى الله عليه وسلم أشد تعجيلا للظهر منكم وأنتم أشد تعجيلا للعصر منه ‏.‏",
      "text_en": " Umm Salamah narrated:                     \"Allah's Messenger would hasten Zuhr more than you (people), while you (people) hasten Asr more than him.\"",
      "chain": [
        "20387",
        "20208",
        "11015",
        "11090",
        "56"
      ]
    },
    {
      "hadith_no": "162",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "قال أبو عيسى وقد روي هذا الحديث، عن إسماعيل ابن علية، عن ابن جريج، عن ابن أبي مليكة، عن أم سلمة، نحوه ‏.‏ ووجدت في كتابي أخبرني علي بن حجر، عن إسماعيل بن إبراهيم، عن ابن جريج، ‏.‏",
      "text_en": " Narrator not mentioned:                     [And I have in my book: \"Ali bin Hujr informed me from lsma'il bin Ibrahim, from Ibn Juraij.\"]",
      "chain": [
        "20208",
        "11070",
        "11090",
        "56",
        "20387",
        "20208"
      ]
    },
    {
      "hadith_no": "381",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا عباد بن العوام، أخبرنا ميمون أبو حمزة، عن أبي صالح، مولى طلحة عن أم سلمة، قالت رأى النبي صلى الله عليه وسلم غلاما لنا يقال له أفلح إذا سجد نفخ فقال ‏\"‏ يا أفلح ترب وجهك ‏\"‏ ‏.‏ قال أحمد بن منيع وكره عباد بن العوام النفخ في الصلاة وقال إن نفخ لم يقطع صلاته ‏.‏ قال أحمد بن منيع وبه نأخذ ‏.‏ قال أبو عيسى وروى بعضهم عن أبي حمزة هذا الحديث وقال مولى لنا يقال له رباح ‏.‏",
      "text_en": " Umm Salamah narrated:                     \"The Prophet (S) saw a boy of ours - called Aflah - blowing when he prostrated. So he said: 'O Aflah! Put your face in the dirt.'\"",
      "chain": [
        "30242",
        "20431",
        "19060",
        "19290",
        "56"
      ]
    },
    {
      "hadith_no": "458",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Al-Witr - أَبْوَابُ الْوِتْرِ",
      "chapter_no": "3",
      "text_ar": "حدثنا هناد، حدثنا أبو معاوية، عن الأعمش، عن عمرو بن مرة، عن يحيى بن الجزار، عن أم سلمة، قالت كان النبي صلى الله عليه وسلم يوتر بثلاث عشرة ركعة فلما كبر وضعف أوتر بسبع ‏.‏ قال وفي الباب عن عائشة ‏.‏ قال أبو عيسى حديث أم سلمة حديث حسن ‏.‏ وقد روي عن النبي صلى الله عليه وسلم الوتر بثلاث عشرة وإحدى عشرة وتسع وسبع وخمس وثلاث وواحدة ‏.‏ قال إسحاق بن إبراهيم معنى ما روي أن النبي صلى الله عليه وسلم كان يوتر بثلاث عشرة قال إنما معناه أنه كان يصلي من الليل ثلاث عشرة ركعة مع الوتر فنسبت صلاة الليل إلى الوتر ‏.‏ وروى في ذلك حديثا عن عائشة واحتج بما روي عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ أوتروا يا أهل القرآن ‏\"‏ ‏.‏ قال إنما عنى به قيام الليل يقول إنما قيام الليل على أصحاب القرآن ‏.‏",
      "text_en": " Aishah narrated:                     \"The night prayer of Allah's Messenger was thirteen Rak'ah, five of which were his Witr, not sitting in any of them except at the end of them. When the Mu'adh-dhin called the Adhan he would stand to perform two light (Rak'ah).\"",
      "chain": [
        "30480",
        "20354",
        "11060",
        "11381",
        "10839",
        "56"
      ]
    },
    {
      "hadith_no": "471",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Al-Witr - أَبْوَابُ الْوِتْرِ",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن بشار، حدثنا حماد بن مسعدة، عن ميمون بن موسى المرئي، عن الحسن، عن أمه، عن أم سلمة، أن النبي صلى الله عليه وسلم كان يصلي بعد الوتر ركعتين ‏.‏ قال أبو عيسى وقد روي نحو هذا عن أبي أمامة وعائشة وغير واحد عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Umm Salamah narrated:                     \"The Prophet would pray two Rak'ah after Al-Witr.\"",
      "chain": [
        "30160",
        "20224",
        "24453",
        "11016",
        "10737",
        "56"
      ]
    },
    {
      "hadith_no": "736",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، عن سفيان، عن منصور، عن سالم بن أبي الجعد، عن أبي سلمة، عن أم سلمة، قالت ما رأيت النبي صلى الله عليه وسلم يصوم شهرين متتابعين إلا شعبان ورمضان ‏.‏ وفي الباب عن عائشة ‏.‏ قال أبو عيسى حديث أم سلمة حديث حسن ‏.‏ وقد روي هذا الحديث، أيضا عن أبي سلمة، عن عائشة، أنها قالت ما رأيت النبي صلى الله عليه وسلم في شهر أكثر صياما منه في شعبان كان يصومه إلا قليلا بل كان يصومه كله ‏.‏",
      "text_en": " Umm Salamah narrated:                     \"I did not see the Prophet fasting two consecutive months except for Sha'ban and Ramadan.\"",
      "chain": [
        "30160",
        "20033",
        "20012",
        "11067",
        "11342",
        "10567",
        "56"
      ]
    },
    {
      "hadith_no": "977",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا هناد، حدثنا أبو معاوية، عن الأعمش، عن شقيق، عن أم سلمة، قالت قال لنا رسول الله صلى الله عليه وسلم ‏\"‏ إذا حضرتم المريض أو الميت فقولوا خيرا فإن الملائكة يؤمنون على ما تقولون ‏\"‏ ‏.‏ قالت فلما مات أبو سلمة أتيت النبي صلى الله عليه وسلم فقلت يا رسول الله إن أبا سلمة مات ‏.‏ قال ‏\"‏ فقولي اللهم اغفر لي وله وأعقبني منه عقبى حسنة ‏\"‏ ‏.‏ قالت فقلت فأعقبني الله منه من هو خير منه رسول الله صلى الله عليه وسلم ‏.‏ قال أبو عيسى شقيق هو ابن سلمة أبو وائل الأسدي ‏.‏ قال أبو عيسى حديث أم سلمة حديث حسن صحيح ‏.‏ وقد كان يستحب أن يلقن المريض عند الموت قول لا إله إلا الله ‏.‏ وقال بعض أهل العلم إذا قال ذلك مرة فما لم يتكلم بعد ذلك فلا ينبغي أن يلقن ولا يكثر عليه في هذا ‏.‏ وروي عن ابن المبارك أنه لما حضرته الوفاة جعل رجل يلقنه لا إله إلا الله وأكثر عليه فقال له عبد الله إذا قلت مرة فأنا على ذلك ما لم أتكلم بكلام ‏.‏ وإنما معنى قول عبد الله إنما أراد ما روي عن النبي صلى الله عليه وسلم ‏\"‏ من كان آخر قوله لا إله إلا الله دخل الجنة ‏\"‏ ‏.‏",
      "text_en": " Umm Salamah narrated:                     \"The Messenger of Allah said to us: 'When you attend to the sick or dying then say only good, for indeed the angels say \"Amin\" to what you say.'\" She said: \"When Abu Salamah died I went to the Prophet and said: 'O Messenger of Allah! Abu Salamah has died.' He said: 'Then say: \"O Allah forgive me and him, and give me a good replacement for him.\" She said: \"I said tat, and Allah gave a replace that was better than him: The Messenger of Allah.\"",
      "chain": [
        "30480",
        "20354",
        "11060",
        "11353",
        "56"
      ]
    },
    {
      "hadith_no": "1185",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Suckling - كتاب الرضاع",
      "chapter_no": "12",
      "text_ar": "حدثنا قتيبة، حدثنا أبو عوانة، عن هشام بن عروة، عن فاطمة بنت المنذر، عن أم سلمة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يحرم من الرضاعة إلا ما فتق الأمعاء في الثدى وكان قبل الفطام ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ والعمل على هذا عند أكثر أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم أن الرضاعة لا تحرم إلا ما كان دون الحولين وما كان بعد الحولين الكاملين فإنه لا يحرم شيئا ‏.‏ وفاطمة بنت المنذر بن الزبير بن العوام هي امرأة هشام بن عروة ‏.‏",
      "text_en": " Umm Salamah narrated that The Messenger of Allah said:                      “No prohibition results from suckling except for what penetrates the intestines while on the breast before weaning.”",
      "chain": [
        "30367",
        "20469",
        "11065",
        "10526",
        "56"
      ]
    },
    {
      "hadith_no": "1194",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Suckling - كتاب الرضاع",
      "chapter_no": "12",
      "text_ar": "حدثنا واصل بن عبد الأعلى الكوفي، حدثنا محمد بن فضيل، عن عبد الله بن عبد الرحمن أبي نصر، عن مساور الحميري، عن أمه، عن أم سلمة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ أيما امرأة ماتت وزوجها عنها راض دخلت الجنة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Umm Salamah narrated that The Messenger of Allah said:                      “Whichever woman dies while her husband is pleased with her, then she enters Paradise.”",
      "chain": [
        "20356",
        "18981",
        "56"
      ]
    },
    {
      "hadith_no": "1261",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا سعيد بن عبد الرحمن المخزومي، قال حدثنا سفيان بن عيينة، عن الزهري، عن نبهان، مولى أم سلمة عن أم سلمة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا كان عند مكاتب إحداكن ما يؤدي فلتحتجب منه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ ومعنى هذا الحديث عند أهل العلم على التورع وقالوا لا يعتق المكاتب وإن كان عنده ما يؤدي حتى يؤدي ‏.‏",
      "text_en": " Narrated Umm Salamah:                     That the Messenger of Allah (ﷺ) said: \"When one of you (women) has a Mukatab ho has with him what will fulfill (the Kitabah) then observe Hijab from him.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. And the meaning of this Hadith according to the people of knowledge is that of caution. They say that the Mukatab is not freed, even if he has the amount to pay, until he pays it.",
      "chain": [
        "38231",
        "20005",
        "11013",
        "56"
      ]
    },
    {
      "hadith_no": "1339",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Chapters On Judgements From The Messenger of Allah - كتاب الأحكام عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "15",
      "text_ar": "حدثنا هارون بن إسحاق الهمداني، حدثنا عبدة بن سليمان، عن هشام بن عروة، عن أبيه، عن زينب بنت أم سلمة، عن أم سلمة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ إنكم تختصمون إلى وإنما أنا بشر ولعل بعضكم أن يكون ألحن بحجته من بعض فإن قضيت لأحد منكم بشيء من حق أخيه فإنما أقطع له قطعة من النار فلا يأخذ منه شيئا ‏\"‏ ‏.‏ قال وفي الباب عن أبي هريرة وعائشة ‏.‏ قال أبو عيسى حديث أم سلمة حديث حسن صحيح ‏.‏",
      "text_en": " Umm Salamah narrated that the Messenger of Allah (ﷺ) said:                      \"Indeed you come to me with your disputes, and I am only a human being, perhaps one of you is more eloquent at presenting his argument than the other. If I judge for one of you, giving him something from the rights of his brother, then it is only a piece of the Fire that I am giving him, so do not take anything from it.\"",
      "chain": [
        "35158",
        "20337",
        "11065",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "1523",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Sacrifices - كتاب الأضاحى عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "19",
      "text_ar": "حدثنا أحمد بن الحكم البصري، حدثنا محمد بن جعفر، عن شعبة، عن مالك بن أنس، عن عمرو، أو عمر بن مسلم عن سعيد بن المسيب، عن أم سلمة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من رأى هلال ذي الحجة وأراد أن يضحي فلا يأخذن من شعره ولا من أظفاره ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ والصحيح هو عمرو بن مسلم قد روى عنه محمد بن عمرو بن علقمة وغير واحد ‏.‏ وقد روي هذا الحديث عن سعيد بن المسيب عن أم سلمة عن النبي صلى الله عليه وسلم من غير هذا الوجه نحو هذا ‏.‏ وهو قول بعض أهل العلم وبه كان يقول سعيد بن المسيب وإلى هذا الحديث ذهب أحمد وإسحاق ‏.‏ ورخص بعض أهل العلم في ذلك فقالوا لا بأس أن يأخذ من شعره وأظفاره ‏.‏ وهو قول الشافعي واحتج بحديث عائشة أن النبي صلى الله عليه وسلم كان يبعث بالهدى من المدينة فلا يجتنب شيئا مما يجتنب منه المحرم ‏.‏",
      "text_en": " Narrated Umm Salamah:                     That the Prophet (ﷺ) said: \"Whoever sees the crescent of Dhul-Hijjah, and wants to slaughter a sacrifice he should not take from his hair nor from his nails.\"",
      "chain": [
        "20173",
        "20020",
        "20001",
        "11002",
        "56"
      ]
    },
    {
      "hadith_no": "1762",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Clothing - كتاب اللباس",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن حميد الرازي، حدثنا أبو تميلة، والفضل بن موسى، وزيد بن حباب، عن عبد المؤمن بن خالد، عن عبد الله بن بريدة، عن أم سلمة، قالت كان أحب الثياب إلى النبي صلى الله عليه وسلم القميص ‏.‏ قال أبو عيسى هذا حديث حسن غريب إنما نعرفه من حديث عبد المؤمن بن خالد تفرد به وهو مروزي ‏.‏ وروى بعضهم هذا الحديث عن أبي تميلة عن عبد المؤمن بن خالد عن عبد الله بن بريدة عن أمه عن أم سلمة ‏.‏",
      "text_en": " Narrated Umm Salamah:                     \"The most loved garment to the Messenger to the Messenger of Allah (ﷺ) was the Qamis (long shirt).\"[Abu 'Eisa said:] This Hadith is Hasan Gharib. We only know of it as a narration of 'Abdul-Mu'min bin Khalid (a narrator in the chain of this Hadith) who was alone in narrating it, and he is from Al-Marwaz. Some of them report this Hadith from Abu Tumailah, from 'Abdul-Mu'min bin Khalid, from 'Abdullah bin Buraidah, from his mother, from Umm Salamah. He said: I heard Muhammad bin Ism'ail saying: \"The narration of Ibn Buraidah from his mother, from Umm Salamah is more correct, Abu Tumailah mentioned 'his mother' in it.\"",
      "chain": [
        "38495",
        "20183",
        "20452",
        "20650",
        "28375",
        "11432",
        "56"
      ]
    },
    {
      "hadith_no": "1763",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Clothing - كتاب اللباس",
      "chapter_no": "24",
      "text_ar": "حدثنا زياد بن أيوب البغدادي، حدثنا أبو تميلة، عن عبد المؤمن بن خالد، عن عبد الله بن بريدة، عن أمه، عن أم سلمة، قالت كان أحب الثياب إلى النبي صلى الله عليه وسلم القميص ‏.‏  قال وسمعت محمد بن إسمعيل يقول حديث عبد الله بن بريدة عن أمه عن أم سلمة أصح وإنما يذكر فيه أبو تميلة عن أمه",
      "text_en": " Narrated Umm Salamah:                     \"The most loved garment to the Messenger of Allah (ﷺ) was the Qamis (long shirt).\"",
      "chain": [
        "30249",
        "20183",
        "28375",
        "11432",
        "56"
      ]
    },
    {
      "hadith_no": "1764",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Clothing - كتاب اللباس",
      "chapter_no": "24",
      "text_ar": "حدثنا علي بن حجر، أخبرنا الفضل بن موسى، عن عبد المؤمن بن خالد، عن عبد الله بن بريدة، عن أم سلمة، قالت كان أحب الثياب إلى رسول الله صلى الله عليه وسلم القميص ‏.‏",
      "text_en": " Narrated Umm Salamah:                     \"The most loved garment to the Messenger of Allah (ﷺ) was the Qamis (long shirt).\"",
      "chain": [
        "20387",
        "20452",
        "28375",
        "11432",
        "56"
      ]
    },
    {
      "hadith_no": "1829",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا الحسن بن محمد الزعفراني، حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني محمد بن يوسف، أن عطاء بن يسار، أخبره أن أم سلمة أخبرته أنها، قربت إلى رسول الله صلى الله عليه وسلم جنبا مشويا فأكل منه ثم قام إلى الصلاة وما توضأ ‏.‏ قال وفي الباب عن عبد الله بن الحارث والمغيرة وأبي رافع ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه ‏.‏",
      "text_en": " Narrated Umm Salamah:                     That she brought a side of roasted meat to the Messenger of Allah (ﷺ), so he ate it from it and stood for Salat, and did not perform Wudu'He said: There are narrations on this topic from 'Abdullah bin Al-Harith, Al-Mughirah, and Abu Rafi'[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib from this route.",
      "chain": [
        "30245",
        "20381",
        "11070",
        "30388",
        "11020",
        "56"
      ]
    },
    {
      "hadith_no": "2171",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا نصر بن علي الجهضمي، حدثنا سفيان، عن محمد بن سوقة، عن نافع بن جبير، عن أم سلمة، عن النبي صلى الله عليه وسلم أنه ذكر الجيش الذي يخسف بهم فقالت أم سلمة لعل فيهم المكره ‏.‏ قال ‏\"‏ إنهم يبعثون على نياتهم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه وقد روي هذا الحديث عن نافع بن جبير عن عائشة أيضا عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Umm Salamah narrated that the Prophet (s.a.w) mentioned the army that the earth would swallow, so Umm Salamah said:                     'Perhaps there are those among them who are averse to it.\" He said: \"They will be resurrected on their intentions.\"",
      "chain": [
        "30395",
        "20012",
        "11387",
        "11059",
        "56"
      ]
    },
    {
      "hadith_no": "2196",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا سويد بن نصر، حدثنا عبد الله بن المبارك، أخبرنا معمر، عن الزهري، عن هند بنت الحارث، عن أم سلمة، أن النبي صلى الله عليه وسلم استيقظ ليلة فقال ‏\"‏ سبحان الله ماذا أنزل الليلة من الفتنة ماذا أنزل من الخزائن من يوقظ صواحب الحجرات يا رب كاسية في الدنيا عارية في الآخرة ‏\"‏ ‏.‏ هذا حديث حسن صحيح ‏.‏",
      "text_en": " Umm Salamah narrated:                     \"One night the Prophet(s.a.w) awoke and said, 'Subhan Allah! How many Fitan(trials and afflictions) have descended tonight. And how many trasures have been disclosed? Who will awaken the women sleeping in these dwellings? O! How many are clothed in this world, yet naked in the Hereafter.\"'",
      "chain": [
        "38265",
        "20025",
        "20115",
        "11013",
        "11734",
        "56"
      ]
    },
    {
      "hadith_no": "2265",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا الحسن بن علي الخلال، حدثنا يزيد بن هارون، أخبرنا هشام بن حسان، عن الحسن، عن ضبة بن محصن، عن أم سلمة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إنه سيكون عليكم أئمة تعرفون وتنكرون فمن أنكر فقد برئ ومن كره فقد سلم ولكن من رضي وتابع ‏\"‏ ‏.‏ فقيل يا رسول الله أفلا نقاتلهم قال ‏\"‏ لا ما صلوا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Umm Salamah narrated that the Prophet(s.a.w) said:                     \"Indeed there shall come upon you A'immah whom you like (what they do) and some (of what they do) you dislike. So whoever rejects, then he is innocent, and whoever loathes, then he is safe. But whoever is pleased and follows.\" It was said: \"O Messenger of Allah! Shall we fight them?\" He said: \"No, as long as they offer Salat.\"",
      "chain": [
        "30115",
        "20472",
        "11311",
        "11016",
        "56"
      ]
    },
    {
      "hadith_no": "3005",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا سويد، حدثنا عبد الله، أخبرنا يونس بن يزيد، عن ابن شهاب، عن نبهان، مولى أم سلمة أنه حدثه أن أم سلمة حدثته أنها، كانت عند رسول الله صلى الله عليه وسلم وميمونة قالت فبينا نحن عنده أقبل ابن أم مكتوم فدخل عليه وذلك بعد ما أمرنا بالحجاب فقال رسول الله صلى الله عليه وسلم ‏\"‏ احتجبا منه ‏\"‏ ‏.‏ فقلت يا رسول الله أليس هو أعمى لا يبصرنا ولا يعرفنا فقال رسول الله صلى الله عليه وسلم ‏\"‏ أفعمياوان أنتما ألستما تبصرانه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Nabhan the freed slave of Umm Salamah:                     to Ibn Shihab, that Umm Salamah narrated to him, that she and Maimunah were with the Messenger of Allah (ﷺ), she said: \"So when we were with him, Ibn Umm Maktum came, and he entered upon him, and that was after veiling had been ordered for us. So the Messenger of Allah (ﷺ) said: 'Veil yourselves from him.' So I said: 'O Messenger of Allah! Is he not blind such that he can not see us or recognize us?' So the Messenger of Allah (ﷺ) said: 'Are you two blind such that you can not see him?'\"",
      "chain": [
        "18",
        "20475",
        "11013",
        "56"
      ]
    },
    {
      "hadith_no": "3055",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا أبو كريب، حدثنا وكيع، عن داود بن أبي عبد الله، عن ابن جدعان، عن جدته، عن أم سلمة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ المستشار مؤتمن ‏\"‏ ‏.‏ وفي الباب عن ابن مسعود وأبي هريرة وابن عمر ‏.‏ قال أبو عيسى هذا حديث غريب من حديث أم سلمة ‏.‏",
      "text_en": " Narrated Umm Salamah:                     \"The Messenger of Allah (ﷺ) said: 'The one whose council is sought is entrusted.'\"",
      "chain": [
        "30216",
        "20032",
        "56"
      ]
    },
    {
      "hadith_no": "3177",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Recitation - كتاب القراءات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "46",
      "text_ar": "حدثنا علي بن حجر، أخبرنا يحيى بن سعيد الأموي، عن ابن جريج، عن ابن أبي مليكة، عن أم سلمة، قالت كان رسول الله صلى الله عليه وسلم يقطع قراءته يقول ‏(‏الحمد لله رب العالمين ‏)‏ ثم يقف ‏(‏ الرحمن الرحيم ‏)‏ ثم يقف وكان يقرؤها ‏(‏ملك يوم الدين ‏)‏ قال أبو عيسى هذا حديث غريب وبه يقول أبو عبيد ويختاره هكذا روى يحيى بن سعيد الأموي وغيره عن ابن جريج عن ابن أبي مليكة عن أم سلمة وليس إسناده بمتصل لأن الليث بن سعد روى هذا الحديث عن ابن أبي مليكة عن يعلى بن مملك عن أم سلمة أنها وصفت قراءة النبي صلى الله عليه وسلم حرفا حرفا وحديث الليث أصح وليس في حديث الليث وكان يقرأ ‏(‏ملك يوم الدين ‏)‏ ‏.‏",
      "text_en": " Narrated Ibn Abi Mulaikah:                     that Umm Salah said: \"The Messenger of Allah (SA) would separate recitation reciting: 'Al-Hamdulillahi Rabbil-'Alamin' then he would stop. 'Ar-Rahmanir-Rahim' then he would stop. And he would recite it: 'Maliki Yawmid-Din.'\"",
      "chain": [
        "20387",
        "20367",
        "11070",
        "11090",
        "56"
      ]
    },
    {
      "hadith_no": "3182",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Recitation - كتاب القراءات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "46",
      "text_ar": "حدثنا الحسين بن محمد البصري، حدثنا عبد الله بن حفص، حدثنا ثابت البناني، عن شهر بن حوشب، عن أم سلمة، أن النبي صلى الله عليه وسلم كان يقرؤها ‏(‏إنه عمل غير صالح ‏)‏ ‏.‏ قال أبو عيسى هذا حديث قد رواه غير واحد عن ثابت البناني نحو هذا وهو حديث ثابت البناني وروي هذا الحديث أيضا عن شهر بن حوشب عن أسماء بنت يزيد ‏.‏ قال وسمعت عبد بن حميد يقول أسماء بنت يزيد هي أم سلمة الأنصارية ‏.‏ قال أبو عيسى كلا الحديثين عندي واحد وقد روى شهر بن حوشب غير حديث عن أم سلمة الأنصارية وهي أسماء بنت يزيد وقد روي عن عائشة عن النبي صلى الله عليه وسلم نحو هذا ‏.‏",
      "text_en": " Narrated Umm Salamah:                     \"The Prophet (ﷺ) would recite: 'Innahu 'Amila Ghaira Salih.'\"",
      "chain": [
        "11269",
        "11044",
        "56"
      ]
    },
    {
      "hadith_no": "3183",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Recitation - كتاب القراءات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "46",
      "text_ar": "حدثنا يحيى بن موسى، حدثنا وكيع، وحبان بن هلال، قالا حدثنا هارون النحوي، عن ثابت البناني، عن شهر بن حوشب، عن أم سلمة، أن رسول الله صلى الله عليه وسلم قرأ هذه الآية ‏:‏ ‏(‏إنه عمل غير صالح ‏)‏‏.‏",
      "text_en": " Narrated Umm Salamah:                     \"The Messenger of Allah (ﷺ) recited this Ayah: 'Innahu 'Amalun Ghairu Salih'\" (11:46)",
      "chain": [
        "30221",
        "20032",
        "20218",
        "11269",
        "11044",
        "56"
      ]
    },
    {
      "hadith_no": "3246",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، حدثنا سفيان، عن ابن خثيم، عن ابن سابط، عن حفصة بنت عبد الرحمن، عن أم سلمة، عن النبي صلى الله عليه وسلم في قوله ‏:‏ ‏(‏نساؤكم حرث لكم فأتوا حرثكم أنى شئتم ‏)‏ يعني صماما واحدا ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ وابن خثيم هو عبد الله بن عثمان وابن سابط هو عبد الرحمن بن عبد الله بن سابط الجمحي المكي وحفصة هي بنت عبد الرحمن بن أبي بكر الصديق ويروى في سمام واحد ‏.‏",
      "text_en": " Narrated Umm Salamah:                     from the Prophet (SA), regarding: Your wives are a tilth for you, so go to your tilth when or how you will (2:223). [He (ﷺ) said]: \"Meaning one valve.\"",
      "chain": [
        "30160",
        "20033",
        "20012",
        "56"
      ]
    },
    {
      "hadith_no": "3295",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان، عن ابن أبي نجيح، عن مجاهد، عن أم سلمة، أنها قالت يغزو الرجال ولا يغزو النساء وإنما لنا نصف الميراث ‏.‏ فأنزل الله ‏:‏ ‏(‏ولا تتمنوا ما فضل الله به بعضكم على بعض ‏)‏ ‏.‏ قال مجاهد فأنزل فيها ‏:‏ ‏(‏ إن المسلمين والمسلمات ‏)‏ وكانت أم سلمة أول ظعينة قدمت المدينة مهاجرة ‏.‏ قال أبو عيسى هذا حديث مرسل ‏.‏ ورواه بعضهم عن ابن أبي نجيح عن مجاهد مرسل أن أم سلمة قالت كذا وكذا ‏.‏",
      "text_en": " Narrated Mujahid:                     from Umm Salamah that she said: \"The men fight and the women do not fight, and we only get half the inheritance.' So Allah, Blessed and Most High, revealed: 'And wish not for things in which Allah has made some of you excell over others... (4:32)' Mujahid said: \"And the following was revealed about that: 'Verily the Muslim men and the Muslim women... (33:35). And Umm Salamah was the first camel-borne woman to arrive in Al-Madinah as an emigrant.",
      "chain": [
        "30421",
        "20005",
        "11254",
        "11028",
        "56"
      ]
    },
    {
      "hadith_no": "3296",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان، عن عمرو بن دينار، عن رجل، من ولد أم سلمة عن أم سلمة، قالت يا رسول الله لا أسمع الله ذكر النساء في الهجرة ‏.‏ فأنزل الله تعالى ‏:‏ ‏(‏ إني لا أضيع عمل عامل منكم من ذكر أو أنثى بعضكم من بعض ‏)‏ ‏.‏",
      "text_en": " Narrated 'Amr bin Dinar:                     from a man among the children of Umm Salamah, from Umm Salamah that she said: \"O Messenger of Allah! I have not heard Allah mentioning anything about women and emigration.\" So Allah, Blessed and Most High, revealed: \"Never will I allow to be lost the work of any of you, be he male or female. You are members one of another (3:195).\"",
      "chain": [
        "30421",
        "20005",
        "11081",
        "56"
      ]
    },
    {
      "hadith_no": "3427",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا وكيع، حدثنا سفيان، عن منصور، عن عامر الشعبي، عن أم سلمة، أن النبي صلى الله عليه وسلم كان إذا خرج من بيته قال ‏\"‏ بسم الله توكلت على الله اللهم إنا نعوذ بك من أن نزل أو نضل أو نظلم أو نظلم أو نجهل أو يجهل علينا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Umm Salamah narrated that :                     When the Prophet would leave his house, he would say: “In the Name of Allah, I place my trust in Allah. O Allah! We seek refuge in You from slipping unintentionally or becoming misguided, or committing oppression or being oppressed, or acting ignorantly or being treated ignorantly (Bismillah, Tawwakultu Alallah. Allahumma, Inna Na’udhu Bika Min An Nazilla Aw Nadilla, Aw Nazlima Aw Nuzlam, Aw Najhala Aw Yujhal Alaina).”",
      "chain": [
        "30277",
        "20032",
        "20012",
        "11067",
        "11052",
        "56"
      ]
    },
    {
      "hadith_no": "3511",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا إبراهيم بن يعقوب، حدثنا عمرو بن عاصم، حدثنا حماد بن سلمة، عن ثابت، عن عمرو بن أبي سلمة، عن أمه أم سلمة، عن أبي سلمة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا أصاب أحدكم مصيبة فليقل ‏:‏ ‏(‏ إنا لله وإنا إليه راجعون ‏)‏ اللهم عندك احتسبت مصيبتي فأجرني فيها وأبدلني منها خيرا ‏\"‏ ‏.‏ فلما احتضر أبو سلمة قال اللهم اخلف في أهلي خيرا مني فلما قبض قالت أم سلمة ‏:‏ ‏(‏ إنا لله وإنا إليه راجعون ‏)‏ عند الله احتسبت مصيبتي فأجرني فيها ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه ‏.‏ وروي هذا الحديث من غير هذا الوجه عن أم سلمة عن النبي صلى الله عليه وسلم وأبو سلمة اسمه عبد الله بن عبد الأسد ‏.‏",
      "text_en": " Umar bin Abu Salamah narrated from his mother, Umm Salamah, that the Messenger of Allah said:                     “When a calamity strikes one of you, then let him say: ‘Indeed, to Allah we belong and to Him we shall return. O Allah, I seek reward with You for my affliction, so reward me for it, and replace it for me with something better (Inna Lillahi Wa Inna Ilaihi Raji’un, Allahumma Indaka Ahtasibu Musibati Fa’jurni Fiha Wa Abdilni Minha Khair).’” When the time of death was near Abu Salamah, he said: ‘O Allah, replace me for my wife, with better than me.” So when he died, Umm Salamah said: “Indeed, to Allah we belong and to Him we shall return. I seek reward with  allah for my affliction, so reward me for it.”",
      "chain": [
        "38088",
        "20267",
        "20021",
        "11269",
        "30286",
        "56",
        "10567"
      ]
    },
    {
      "hadith_no": "3589",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا حسين بن علي بن الأسود البغدادي، حدثنا محمد بن فضيل، عن عبد الرحمن بن إسحاق، عن حفصة بنت أبي كثير، عن أبيها أبي كثير، عن أم سلمة، قالت علمني رسول الله صلى الله عليه وسلم قال ‏\"‏ قولي اللهم هذا استقبال ليلك وإدبار نهارك وأصوات دعاتك وحضور صلواتك أسألك أن تغفر لي ‏\"‏ ‏.‏ قال هذا حديث غريب إنما نعرفه من هذا الوجه ‏.‏ وحفصة بنت أبي كثير لا نعرفها ولا أباها ‏.‏",
      "text_en": " Umm Salamah said:                     “The Messenger of Allah taught me, saying: ‘Say: “O Allah, this is the coming of Your night, and the departing of Your day, the voices of those calling to You, and the time of prayers to You, I ask You to forgive me (Allahumma Hadhastiqbalu Lailika, Wastidbaru Naharika, Wa Aswatu Du’atika Wa Huduru Salawatika, As’aluka An Taghfira Li).”",
      "chain": [
        "20315",
        "20356",
        "11876",
        "19467",
        "56"
      ]
    },
    {
      "hadith_no": "4245",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو أحمد الزبيري، حدثنا سفيان، عن زبيد، عن شهر بن حوشب، عن أم سلمة، أن النبي صلى الله عليه وسلم جلل على الحسن والحسين وعلي وفاطمة كساء ثم قال ‏\"‏ اللهم هؤلاء أهل بيتي وخاصتي أذهب عنهم الرجس وطهرهم تطهيرا ‏\"‏ ‏.‏ فقالت أم سلمة وأنا معهم يا رسول الله قال ‏\"‏ إنك إلى خير ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح وهو أحسن شيء روي في هذا الباب ‏.‏ وفي الباب عن عمر بن أبي سلمة وأنس بن مالك وأبي الحمراء ومعقل بن يسار وعائشة ‏.‏",
      "text_en": " Narrated Umm Salamah:                     \"The Prophet (ﷺ) put a garment over Al-Hasan, Al-Hussain, 'Ali and Fatimah, then he said: 'O Allah, these are the people of my house and the close ones, so remove the Rijs from them and purify them thoroughly.\" So Umm Salamah said: 'And am I with them, O Messenger of Allah?' He said: \"You are upon good.\"'",
      "chain": [
        "30277",
        "20355",
        "20012",
        "11335",
        "11044",
        "56"
      ]
    },
    {
      "hadith_no": "4247",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "أخبرنا محمد بن بشار، حدثنا محمد بن خالد ابن عثمة، قال حدثني موسى بن يعقوب الزمعي، عن هاشم بن هاشم، أن عبد الله بن وهب، أخبره أن أم سلمة أخبرته أن رسول الله صلى الله عليه وسلم دعا فاطمة يوم الفتح فناجاها فبكت ثم حدثها فضحكت ‏.‏ قالت فلما توفي رسول الله صلى الله عليه وسلم سألتها عن بكائها وضحكها قالت أخبرني رسول الله صلى الله عليه وسلم أنه يموت فبكيت ثم أخبرني أني سيدة نساء أهل الجنة إلا مريم ابنت عمران فضحكت ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه ‏.‏",
      "text_en": " Narrated Umm Salamah:                     that the Messenger of Allah (ﷺ) called Fatimah on the Day of the Conquest (of Makkah) and he spoke to her, so she cried. Then he spoke to her and she laughed. She said: \"So when the Messenger of Allah (ﷺ) died, I asked her about her crying and laughing. She said: \"The Messenger of Allah (ﷺ) told me that he will die, so I cried, then he told me that I was the master over all the women of the inhabitants of Paradise, except for Mariam the daughter of 'Imran, so I laughed.\"",
      "chain": [
        "30160",
        "30581",
        "20706",
        "11227",
        "20029",
        "56"
      ]
    },
    {
      "hadith_no": "4267",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن خالد ابن عثمة، حدثني موسى بن يعقوب الزمعي، عن هاشم بن هاشم، أن عبد الله بن وهب بن زمعة، أخبره أن أم سلمة أخبرته أن رسول الله صلى الله عليه وسلم دعا فاطمة عام الفتح فناجاها فبكت ثم حدثها فضحكت قالت فلما توفي رسول الله صلى الله عليه وسلم سألتها عن بكائها وضحكها ‏.‏ قالت أخبرني رسول الله صلى الله عليه وسلم أنه يموت فبكيت ثم أخبرني أني سيدة نساء أهل الجنة إلا مريم بنت عمران فضحكت ‏.‏ قال هذا حديث حسن غريب من هذا الوجه ‏.‏",
      "text_en": " Narrated Umm Salamah:                     that the Messenger of Allah (ﷺ) called for Fatimah in the Year of the Conquest to him to speak to her, and she cried. Then he spoke to her and she laughed. She said: \"When the Messenger of Allah (ﷺ) died I asked her about her crying and her laughing. She said: 'The Messenger of Allah (SAW0 informed me that he would (soon) die, so I cried. Then, he informed me that I was the master over all of the women among the inhabitants of Paradise, except for Mariam bint 'Imran, so I laughed.'\"",
      "chain": [
        "30160",
        "30581",
        "20706",
        "11227",
        "2308",
        "56"
      ]
    },
    {
      "hadith_no": "183",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا محمد بن المثنى، قال حدثنا يحيى، عن جعفر بن محمد، عن أبيه، عن علي بن الحسين، عن زينب بنت أم سلمة، عن أم سلمة، أن رسول الله صلى الله عليه وسلم أكل كتفا فجاءه بلال فخرج إلى الصلاة ولم يمس ماء ‏.‏",
      "text_en": " It was narrated from Umm Salamah that the Messenger of Allah (ﷺ) at (meat from) a shoulder, then Bilal came to him and he went out to pray, and he did not touch water.",
      "chain": [
        "30170",
        "20031",
        "10898",
        "11442",
        "11045",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "198",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا شعيب بن يوسف، قال حدثنا يحيى، عن هشام، قال أخبرني أبي، عن زينب بنت أم سلمة، عن أم سلمة، أن امرأة، قالت يا رسول الله إن الله لا يستحيي من الحق هل على المرأة غسل إذا هي احتلمت قال ‏\"‏ نعم إذا رأت الماء ‏\"‏ ‏.‏ فضحكت أم سلمة فقالت أتحتلم المرأة فقال رسول الله صلى الله عليه وسلم ‏\"‏ ففيم يشبهها الولد ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Umm Salamah that a woman said:                      \"O Messenger of Allah, Allah is not shy to tell the truth. Does a women have to perform Ghusl if she has a wet dream?\" He said: \"Yes, if she sees water.\"[1] Umm Salamah laughed and said: \"Do women really have wet dreams?\" The Messenger of Allah (ﷺ) said: \"How else would her child resemble her?\"[1] That is, if she has an emission of the fluid of an orgasm.",
      "chain": [
        "30020",
        "20295",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "243",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا سليمان بن منصور، عن سفيان، عن أيوب بن موسى، عن سعيد بن أبي سعيد، عن عبد الله بن رافع، عن أم سلمة، - رضى الله عنها - زوج النبي صلى الله عليه وسلم قالت قلت يا رسول الله إني امرأة أشد ضفر رأسي أفأنقضها عند غسلها من الجنابة قال ‏\"‏ إنما يكفيك أن تحثي على رأسك ثلاث حثيات من ماء ثم تفيضين على جسدك ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Umm Salamah, the wife of the Prophet (ﷺ), said:                      \"I said: 'O Messenger of Allah, I am a woman with tightly braided hair; should I undo it when performing Ghusl from Janabah?' He said: 'No it is sufficient for you to pour three handfuls of water over your body.'\"",
      "chain": [
        "20012",
        "11241",
        "11168",
        "11864",
        "56"
      ]
    },
    {
      "hadith_no": "285",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، قال حدثنا هشام، ح وأنبأنا عبيد الله بن سعيد، وإسحاق بن إبراهيم، قالا حدثنا معاذ بن هشام، - واللفظ له - قال حدثني أبي، عن يحيى، قال حدثنا أبو سلمة، أن زينب بنت أبي سلمة، حدثته أن أم سلمة حدثتها قالت، بينما أنا مضطجعة، مع رسول الله صلى الله عليه وسلم في الخميلة إذ حضت فانسللت فأخذت ثياب حيضتي فقال رسول الله صلى الله عليه وسلم ‏\"‏ أنفست ‏\"‏ ‏.‏ قلت نعم فدعاني فاضطجعت معه في الخميلة ‏.‏",
      "text_en": " Umm Salamah narrated:                      \"While I was lying down with the Messenger of Allah (ﷺ) under a blanket, my period came, so I slipped away and put on the clothes I used to wear when I was menstruating. The Messenger of Allah (ﷺ) said: 'Are you menstruating?' I said: 'Yes.' Then he called me and I lied down with him under the blanket.\"",
      "chain": [
        "34033",
        "20423",
        "20295",
        "30359",
        "30123",
        "20287",
        "20295",
        "11449",
        "10567",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "354",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Menstruation and Istihadah - كتاب الحيض والاستحاضة",
      "chapter_no": "3",
      "text_ar": "أنبأنا محمد بن عبد الله بن المبارك، قال حدثنا أبو أسامة، قال حدثنا عبيد الله بن عمر، قال أخبرني عن نافع، عن سليمان بن يسار، عن أم سلمة، قالت سألت امرأة النبي صلى الله عليه وسلم قالت إني أستحاض فلا أطهر أفأدع الصلاة قال ‏\"‏ لا ولكن دعي قدر تلك الأيام والليالي التي كنت تحيضين فيها ثم اغتسلي واستثفري وصلي ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Umm Salamah said:                      \"A woman asked the Prophet (ﷺ): 'I suffer from Istihadah and I never become pure; should I stop praying?' He said: 'No. Stop praying for the number of days and nights that you used to menstruate, then perform Ghusl, wrap a cloth around yourself, and pray.'\"",
      "chain": [
        "20318",
        "11201",
        "11014",
        "11005",
        "56"
      ]
    },
    {
      "hadith_no": "355",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Menstruation and Istihadah - كتاب الحيض والاستحاضة",
      "chapter_no": "3",
      "text_ar": "أخبرنا قتيبة، عن مالك، عن نافع، عن سليمان بن يسار، عن أم سلمة، أن امرأة، كانت تهراق الدم على عهد رسول الله صلى الله عليه وسلم استفتت لها أم سلمة رسول الله صلى الله عليه وسلم فقال ‏\"‏ لتنظر عدد الليالي والأيام التي كانت تحيض من الشهر قبل أن يصيبها الذي أصابها فلتترك الصلاة قدر ذلك من الشهر فإذا خلفت ذلك فلتغتسل ثم لتستثفر بالثوب ثم لتصلي ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Umm Salamah that a woman suffered from constant bleeding during the time of the Messenger of Allah (ﷺ), so Umm Salamah consulted the Prophet (ﷺ) for her. He said:                      \"Let her count the number of nights and days that she used to menstruate each month before this happened to her, and let her stop praying for that period of time each month. Then when that is over let her perform Ghusl, then wrap a cloth around herself, and pray.\"",
      "chain": [
        "30367",
        "20001",
        "11014",
        "11005",
        "56"
      ]
    },
    {
      "hadith_no": "586",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرني محمد بن عبد الأعلى، قال حدثنا المعتمر، قال سمعت معمرا، عن يحيى بن أبي كثير، عن أبي سلمة بن عبد الرحمن، عن أم سلمة، أن النبي صلى الله عليه وسلم صلى في بيتها بعد العصر ركعتين مرة واحدة وأنها ذكرت ذلك له فقال ‏\"‏ هما ركعتان كنت أصليهما بعد الظهر فشغلت عنهما حتى صليت العصر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Umm Salamah that the Prophet (ﷺ) once prayed two Rak'ahs after 'Asr in her house. She asked him about that and he said:                      \"They are two Rak'ahs that I used to pray after Zuhr, but I got distracted and forgot them until I prayed 'Asr.\"",
      "chain": [
        "30449",
        "20288",
        "20115",
        "11449",
        "10567",
        "56"
      ]
    },
    {
      "hadith_no": "587",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا وكيع، قال حدثنا طلحة بن يحيى، عن عبيد الله بن عبد الله بن عتبة، عن أم سلمة، قالت شغل رسول الله صلى الله عليه وسلم عن الركعتين قبل العصر فصلاهما بعد العصر ‏.‏",
      "text_en": " It was narrated that Umm Salamah said:                      \"The Messenger of Allah (ﷺ) got distracted and did not pray the two Rak'ahs before 'Asr so he prayed them after 'Asr.\"",
      "chain": [
        "30123",
        "20032",
        "11863",
        "11004",
        "56"
      ]
    },
    {
      "hadith_no": "696",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Masjids - كتاب المساجد",
      "chapter_no": "8",
      "text_ar": "أخبرنا قتيبة، قال حدثنا سفيان، عن عمار الدهني، عن أبي سلمة، عن أم سلمة، أن النبي صلى الله عليه وسلم قال ‏\"‏ إن قوائم منبري هذا رواتب في الجنة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Umm Salamah that the Prophet (ﷺ) said:                      \"The columns of this Minbar of mine will be in Paradise.\"",
      "chain": [
        "30367",
        "20005",
        "10802",
        "10567",
        "56"
      ]
    },
    {
      "hadith_no": "1022",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا قتيبة، قال حدثنا الليث بن سعد، عن عبد الله بن عبيد الله بن أبي مليكة، عن يعلى بن مملك، أنه سأل أم سلمة عن قراءة، رسول الله صلى الله عليه وسلم وصلاته قالت ما لكم وصلاته ثم نعتت فإذا هي تنعت قراءته مفسرة حرفا حرفا ‏.‏",
      "text_en": " It was narrated from Ya'la bin Mamlak that :                     He asked Umm Salamah about the recitation and prayer of the Messenger of Allah (ﷺ) and she said: \"Why do you want to know about his prayer?\" Then she described his recitation and as being so measured and clear that each letter could be distinguished.",
      "chain": [
        "30367",
        "20023",
        "11090",
        "56"
      ]
    },
    {
      "hadith_no": "1333",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا محمد بن سلمة، قال حدثنا ابن وهب، عن يونس، قال ابن شهاب أخبرتني هند بنت الحارث الفراسية، أن أم سلمة، أخبرتها أن النساء في عهد رسول الله صلى الله عليه وسلم كن إذا سلمن من الصلاة قمن وثبت رسول الله صلى الله عليه وسلم ومن صلى من الرجال ما شاء الله فإذا قام رسول الله صلى الله عليه وسلم قام الرجال ‏.‏",
      "text_en": " Hind bint Al-Harith Al-Farrasiyyah narrated that:                     Umm Salamah told her that during the time of the Messenger of Allah (ﷺ), when the women said the taslim at the end of the prayer, the Messenger of Allah (ﷺ) and the men who had prayed with him would stay put for as long as Allah (ﷺ) willed. Then, when the Messenger of Allah (ﷺ) got up, the men did too.",
      "chain": [
        "20672",
        "20029",
        "20475",
        "11013",
        "11734",
        "56"
      ]
    },
    {
      "hadith_no": "1628",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا هارون بن عبد الله، قال حدثنا حجاج، قال قال ابن جريج عن أبيه، أخبرني ابن أبي مليكة، أن يعلى بن مملك، أخبره أنه، سأل أم سلمة عن صلاة، رسول الله صلى الله عليه وسلم فقالت كان يصلي العتمة ثم يسبح ثم يصلي بعدها ما شاء الله من الليل ثم ينصرف فيرقد مثل ما صلى ثم يستيقظ من نومه ذلك فيصلي مثل ما نام وصلاته تلك الآخرة تكون إلى الصبح ‏.‏",
      "text_en": " Ya'la bin Mamlak said that he asked Umm Salamah about the prayer of the Messenger of Allah (ﷺ) and she said:                     \"He used to pray 'Isha, then he would recite tasbih, then after that he would pray whatever Allah (SWT) willed (he should pray) of night prayer. Then he would go and sleep for as long as he had prayed. Then he would get up from sleep and pray for as long as he had slept, and this last prayer of his would continue until dawn.\"",
      "chain": [
        "30524",
        "20219",
        "11070",
        "19831",
        "11090",
        "56"
      ]
    },
    {
      "hadith_no": "1653",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا سليمان بن سلم البلخي، قال حدثنا النضر، قال أنبأنا يونس، عن أبي إسحاق، عن الأسود، عن أم سلمة، قالت ما قبض رسول الله صلى الله عليه وسلم حتى كان أكثر صلاته جالسا إلا المكتوبة ‏.‏ خالفه شعبة وسفيان وقالا عن أبي إسحاق عن أبي سلمة عن أم سلمة ‏.‏",
      "text_en": " It was narrated from Al-Aswad, that Umm Salamah said:                     \"The Messenger of Allah (ﷺ) did not pass away until most of his prayers were offered sitting down, except for the obligatory prayers.\"",
      "chain": [
        "20291",
        "20475",
        "11049",
        "11054",
        "56"
      ]
    },
    {
      "hadith_no": "1654",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا إسماعيل بن مسعود، حدثنا خالد، عن شعبة، عن أبي إسحاق، قال سمعت أبا سلمة، عن أم سلمة، قالت ما مات رسول الله صلى الله عليه وسلم حتى كان أكثر صلاته قاعدا إلا الفريضة وكان أحب العمل إليه أدومه وإن قل ‏.‏",
      "text_en": " It was narrated from Abu Salamah, that Umm Salamah said:                     \"The Messenger of Allah (ﷺ) did not pass away until most of his prayers were offered sitting down, except for the obligatory prayers, and the dearest of actions to him were those which were done persistently, even if they were few.\"",
      "chain": [
        "34033",
        "20423",
        "20020",
        "11049",
        "10567",
        "56"
      ]
    },
    {
      "hadith_no": "1655",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا عبد الله بن عبد الصمد، قال حدثنا يزيد، قال حدثنا سفيان، عن أبي إسحاق، عن أبي سلمة، عن أم سلمة، قالت والذي نفسي بيده ما مات رسول الله صلى الله عليه وسلم حتى كان أكثر صلاته قاعدا إلا المكتوبة وكان أحب العمل إليه ما داوم عليه وإن قل ‏.‏ خالفه عثمان بن أبي سليمان فرواه عن أبي سلمة عن عائشة ‏.‏",
      "text_en": " It was narrated from Abu Salamah, that Umm Salamah said:                     \"By the One in Whose Hand is my soul. The Messenger of Allah (ﷺ) did not pass away until most of his prayers were offered sitting down, except for the obligatory prayers, and the dearest of actions to him were those which were done persistently, even if they were few.\"",
      "chain": [
        "20472",
        "20012",
        "11049",
        "10567",
        "56"
      ]
    },
    {
      "hadith_no": "1708",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا أحمد بن حرب، قال حدثنا أبو معاوية، عن الأعمش، عن عمرو بن مرة، عن يحيى بن الجزار، عن أم سلمة، قالت كان رسول الله صلى الله عليه وسلم يوتر بثلاث عشرة ركعة فلما كبر وضعف أوتر بتسع ‏.‏ خالفه عمارة بن عمير فرواه عن يحيى بن الجزار عن عائشة ‏.‏",
      "text_en": " It was narrated that Umm Salamah said:                     \"The Messenger of Allah (ﷺ) used to pray witr with thirteen rak'ahs, and when he grew older and weaker he prayed witr with nine.\"",
      "chain": [
        "38011",
        "20354",
        "11060",
        "11381",
        "10839",
        "56"
      ]
    },
    {
      "hadith_no": "1714",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا قتيبة، قال حدثنا جرير، عن منصور، عن الحكم، عن مقسم، عن أم سلمة، قالت كان رسول الله صلى الله عليه وسلم يوتر بخمس وبسبع لا يفصل بينها بسلام ولا بكلام ‏.‏",
      "text_en": " Mansur reported from Al-Hakam, from Miqsam, that Umm Salamah said:                     \"The Messenger of Allah (ﷺ) used to pray witr with five and seven rak'ahs which he did not separate with any taslim nor talk.\"",
      "chain": [
        "30367",
        "20028",
        "11067",
        "11069",
        "11725",
        "56"
      ]
    },
    {
      "hadith_no": "1715",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا القاسم بن زكريا بن دينار، قال حدثنا عبيد الله، عن إسرائيل، عن منصور، عن الحكم، عن مقسم، عن ابن عباس، عن أم سلمة، قالت كان رسول الله صلى الله عليه وسلم يوتر بسبع أو بخمس ولا يفصل بينهن بتسليم ‏.‏",
      "text_en": " Mansur reported from Al-Hakam, from Miqsam, from Ibn 'Abbas that Umm Salamah said:                     \"The Messenger of Allah (ﷺ) used to pray witr with seven or five (rak'ahs), not separating between them with the taslim.\"",
      "chain": [
        "30475",
        "11201",
        "20311",
        "11067",
        "11069",
        "11725",
        "17",
        "56"
      ]
    },
    {
      "hadith_no": "1727",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا أحمد بن حرب، قال حدثنا أبو معاوية، عن الأعمش، عن عمرو بن مرة، عن يحيى بن الجزار، عن أم سلمة، قالت كان رسول الله صلى الله عليه وسلم يوتر بثلاث عشرة ركعة فلما كبر وضعف أوتر بتسع ‏.‏",
      "text_en": " It was narrated that Umm Salamah said:                     \"The Messenger of Allah (ﷺ) used to pray witr with thirteen rak'ahs, but when he grew older and weaker he prayed witr with nine.\"",
      "chain": [
        "38011",
        "20354",
        "11060",
        "11381",
        "10839",
        "56"
      ]
    },
    {
      "hadith_no": "1825",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا محمد بن المثنى، عن يحيى، عن الأعمش، قال حدثني شقيق، عن أم سلمة، قالت سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إذا حضرتم المريض فقولوا خيرا فإن الملائكة يؤمنون على ما تقولون ‏\"‏ ‏.‏ فلما مات أبو سلمة قلت يا رسول الله كيف أقول قال ‏\"‏ قولي اللهم اغفر لنا وله وأعقبني منه عقبى حسنة ‏\"‏ ‏.‏ فأعقبني الله عز وجل منه محمدا صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated that Umm Salamah said:                     \"I heard the Messenger of Allah say: 'When you see the dead, say something good, for the angels say Amin to whatever you say; When Abu Salamah died, I said: 'O Messenger of Allah, what should I say?' He said: 'Say\" Allahummaghfirlanaa wa lahu wa a 'qibni minhu 'uqbai hasanah (O Allah, forgive us and him, and compensate me well for this loss.)\"' Then Allah, the Mighty and Sublime, compensated me with Muhammad.\"",
      "chain": [
        "30170",
        "20031",
        "11060",
        "11353",
        "56"
      ]
    },
    {
      "hadith_no": "2175",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا شعيب بن يوسف، ومحمد بن بشار، - واللفظ له - قالا حدثنا عبد الرحمن، قال حدثنا سفيان، عن منصور، عن سالم، عن أبي سلمة، عن أم سلمة، قالت ما رأيت رسول الله صلى الله عليه وسلم يصوم شهرين متتابعين إلا أنه كان يصل شعبان برمضان ‏.‏",
      "text_en": " It was narrated from Abu Salamah that Umm Salamah said:                     \"U never saw the Messenger  of Allah fast two consecutive months, but he used to join shaban to Ramadan.\" '",
      "chain": [
        "30160",
        "20033",
        "20012",
        "11067",
        "11011",
        "10567",
        "56"
      ]
    },
    {
      "hadith_no": "2176",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا النضر، قال أنبأنا شعبة، عن توبة العنبري، عن محمد بن إبراهيم، عن أبي سلمة، عن أم سلمة، قالت كان رسول الله صلى الله عليه وسلم يصل شعبان برمضان ‏.‏",
      "text_en": " It was narrated that Umm Salamah said:                     \"The Messenger of Allah used to join Shaban to Ramadan.\" '",
      "chain": [
        "30123",
        "20291",
        "20020",
        "11579",
        "11213",
        "10567",
        "56"
      ]
    },
    {
      "hadith_no": "2352",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمود بن غيلان، قال حدثنا أبو داود، قال أنبأنا شعبة، عن منصور، قال سمعت سالم بن أبي الجعد، عن أبي سلمة، عن أم سلمة، أن رسول الله صلى الله عليه وسلم كان لا يصوم شهرين متتابعين إلا شعبان ورمضان ‏.‏",
      "text_en": " It was narrated from Umm Salamah:                     That the Messenger of Allah would not fast any two consecutive months except Shaban and Ramadan.",
      "chain": [
        "30277",
        "20547",
        "20020",
        "11067",
        "11342",
        "10567",
        "56"
      ]
    },
    {
      "hadith_no": "2353",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن الوليد، قال حدثنا محمد، قال حدثنا شعبة، عن توبة، عن محمد بن إبراهيم، عن أبي سلمة، عن أم سلمة، عن النبي صلى الله عليه وسلم أنه لم يكن يصوم من السنة شهرا تاما إلا شعبان ويصل به رمضان ‏.‏",
      "text_en": " It was narrated from Umm Salamah:                     That the Prophet would not fast any month of the year in full except Shaban and he used to join it to Ramadan.",
      "chain": [
        "30174",
        "20278",
        "20020",
        "11579",
        "11213",
        "10567",
        "56"
      ]
    },
    {
      "hadith_no": "2365",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرني أبو بكر بن علي، قال حدثنا أبو نصر التمار، قال حدثنا حماد بن سلمة، عن عاصم، عن سواء، عن أم سلمة، قالت كان رسول الله صلى الله عليه وسلم يصوم من كل شهر ثلاثة أيام الاثنين والخميس من هذه الجمعة والاثنين من المقبلة ‏.‏",
      "text_en": " It was narrated that Umm Salamah said:                     \"The Messenger of Allah used to fast three days of every month: the Monday and Thursday of the first week and the Monday of the following week.\"",
      "chain": [
        "20663",
        "20021",
        "11080",
        "56"
      ]
    },
    {
      "hadith_no": "2419",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا إبراهيم بن سعيد الجوهري، قال حدثنا محمد بن فضيل، عن الحسن بن عبيد الله، عن هنيدة الخزاعي، عن أمه، عن أم سلمة، قالت كان رسول الله صلى الله عليه وسلم يأمر بصيام ثلاثة أيام أول خميس والاثنين والاثنين ‏.‏",
      "text_en": " It was narrated that Umm Salamah said:                     \"The Messenger of Allah used to enjoin fasting three days: The first Thursday, and Monday and Monday.\"",
      "chain": [
        "30498",
        "20356",
        "10755",
        "56"
      ]
    },
    {
      "hadith_no": "2925",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن القاسم، قال حدثني مالك، عن محمد بن عبد الرحمن بن نوفل، عن عروة، عن زينب بنت أبي سلمة، عن أم سلمة، قالت شكوت إلى رسول الله صلى الله عليه وسلم إني أشتكي فقال ‏\"‏ طوفي من وراء الناس وأنت راكبة ‏\"‏ ‏.‏ فطفت ورسول الله صلى الله عليه وسلم يصلي إلى جنب البيت يقرأ ب ‏{‏ الطور * وكتاب مسطور ‏}‏ ‏.‏",
      "text_en": " It was narrated from Zainab bint Abi Salamah that Umm Salamah said:                     \"I complained to the Messenger of Allah that I was sick, and he said: 'Perform Tawaf behind the people while you are riding.' So I performed Tawaf while the Messenger of Allah was praying beside the House, and reciting: 'The Tur (Mount), and by the Book Inscribed.'\"",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11105",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "2926",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن آدم، عن عبدة، عن هشام بن عروة، عن أبيه، عن أم سلمة، قالت يا رسول الله والله ما طفت طواف الخروج ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ إذا أقيمت الصلاة فطوفي على بعيرك من وراء الناس ‏\"‏ ‏.‏ عروة لم يسمعه من أم سلمة ‏.‏",
      "text_en": " It was narrated from HIsham bin Urwah, from his father, from Umm Salamah, that she said:                     \"O Messenger of Allah, by Allah! I have not performed the Farewell Tawaf.\" The Prophet said: \"When the Iqamah is said for prayer, perform Tawaf on your camel behind the people.\" Urwah did not hear from Umm Salamah.",
      "chain": [
        "20337",
        "11065",
        "10511",
        "56"
      ]
    },
    {
      "hadith_no": "2927",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا عبد الرحمن، عن مالك، عن أبي الأسود، عن عروة، عن زينب بنت أم سلمة، عن أم سلمة، أنها قدمت مكة وهي مريضة فذكرت ذلك لرسول الله صلى الله عليه وسلم فقال ‏\"‏ طوفي من وراء المصلين وأنت راكبة ‏\"‏ ‏.‏ قالت فسمعت رسول الله صلى الله عليه وسلم وهو عند الكعبة يقرأ ‏{‏ والطور ‏}‏ ‏.‏",
      "text_en": " It was narrated from Urwah from Zainab bint Umm Salamab, from Umm Salamah, that:                     she came to Makkah when she was sick. She mentioned that to the Messenger of Allah and he said: \"Perform Tawaf behind those who are praying while you are riding.\" She said: \"And I heard the Messenger of Allah, at the Kabah, reciting 'By the Tur (Mount).\"",
      "chain": [
        "30359",
        "20033",
        "20001",
        "11105",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "3501",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا خالد، قال حدثنا شعبة، عن حميد بن نافع، عن زينب بنت أم سلمة، قلت عن أمها، قال نعم إن النبي صلى الله عليه وسلم سئل عن امرأة توفي عنها زوجها فخافوا على عينها أتكتحل فقال ‏\"‏ قد كانت إحداكن تمكث في بيتها في شر أحلاسها حولا ثم خرجت فلا أربعة أشهر وعشرا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Zainab bint Umm Salamah -I (the narrator) said:                      \"From her mother?\" He said: \"Yes\" - \"that the Prophet was asked about a woman whose husband had died but they were worried about her eyes - could she use kohl?\" He said: \"One of you used to stay in her house wearing her shabbiest clothes for a year, then she would come out. No, (the mourning period is) four months and ten (days).\"",
      "chain": [
        "30449",
        "20423",
        "20020",
        "11157",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "3513",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا عبد الأعلى بن واصل بن عبد الأعلى، قال حدثنا يحيى بن آدم، عن سفيان، عن يحيى بن سعيد، عن سليمان بن يسار، عن كريب، عن أم سلمة، ومحمد بن عمرو، عن أبي سلمة، عن كريب، عن أم سلمة، قالت وضعت سبيعة بعد وفاة زوجها بأيام فأمرها رسول الله صلى الله عليه وسلم أن تزوج ‏.‏",
      "text_en": " It was narrated that Umm Salamah said:                      \"Subai'ah gave birth a few days after her husband died, and the Messenger of Allah told her to get married.\"",
      "chain": [
        "20364",
        "20012",
        "11062",
        "11005",
        "11211",
        "56",
        "11220",
        "10567",
        "11211",
        "56"
      ]
    },
    {
      "hadith_no": "3539",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا محمد بن عبد الله بن يزيد، قال حدثنا سفيان، عن يحيى بن سعيد، عن حميد بن نافع، عن زينب بنت أبي سلمة، عن أمها، أن امرأة، أتت النبي صلى الله عليه وسلم فسألته عن ابنتها مات زوجها وهي تشتكي قال ‏\"‏ قد كانت إحداكن تحد السنة ثم ترمي البعرة على رأس الحول وإنما هي أربعة أشهر وعشرا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Zainab bint Abi Salamah, from her mother, that a woman came to the Prophet and asked him about her daughter whose husband had died and she was ill. He said:                      \"One of you used to mourn for a year, then throw a piece of dung when a year had passed. Rather it (the mourning period) is four months and ten days.\"",
      "chain": [
        "20012",
        "11062",
        "11157",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "3540",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا محمد بن معدان بن عيسى بن معدان، قال حدثنا ابن أعين، قال حدثنا زهير بن معاوية، قال حدثنا يحيى بن سعيد، عن حميد بن نافع، مولى الأنصار عن زينب بنت أبي سلمة، عن أم سلمة، أن امرأة، من قريش جاءت إلى رسول الله صلى الله عليه وسلم فقالت إن ابنتي توفي عنها زوجها وقد خفت على عينها وهي تريد الكحل فقال ‏\"‏ قد كانت إحداكن ترمي بالبعرة على رأس الحول وإنما هي أربعة أشهر وعشرا ‏\"‏ ‏.‏ فقلت لزينب ما رأس الحول قالت كانت المرأة في الجاهلية إذا هلك زوجها عمدت إلى شر بيت لها فجلست فيه حتى إذا مرت بها سنة خرجت فرمت وراءها ببعرة ‏.‏",
      "text_en": " It was narrated from Zainab bint Abi Salamah, from Umm Salamah that a woman from the Quraish came to the Messenger of Allah and said:                      \"My daughter's husband has died, and I am worried about her eyes; she needs kohl.\" He said: \"One of you used to throw a piece of dung after a year had passed. Rather it (the mourning period) is four months and ten days.\" I (the narrator) said to Zainab: \"What does 'after a year had passed' mean?\" She said: \"During the Jahiliyyah, if a woman's husband died she would go to the worst room she had and stay there, then, when a year had passed, she would come out and throw a piece of dung behind her.\"",
      "chain": [
        "20321",
        "11062",
        "11157",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "3950",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Kind Treatment of Women - كتاب عشرة النساء",
      "chapter_no": "36",
      "text_ar": "أخبرني محمد بن آدم، عن عبدة، عن هشام، عن عوف بن الحارث، عن رميثة، عن أم سلمة، أن نساء النبي، صلى الله عليه وسلم كلمنها أن تكلم النبي صلى الله عليه وسلم أن الناس كانوا يتحرون بهداياهم يوم عائشة وتقول له إنا نحب الخير كما تحب عائشة فكلمته فلم يجبها فلما دار عليها كلمته أيضا فلم يجبها وقلن ما رد عليك قالت لم يجبني ‏.‏ قلن لا تدعيه حتى يرد عليك أو تنظرين ما يقول ‏.‏ فلما دار عليها كلمته فقال ‏\"‏ لا تؤذيني في عائشة فإنه لم ينزل على الوحى وأنا في لحاف امرأة منكن إلا في لحاف عائشة ‏\"‏ ‏.‏ قال أبو عبد الرحمن هذان الحديثان صحيحان عن عبدة ‏.‏",
      "text_en": " It was narrated from Umm Salamah that the wives of the Prophet asked her to speak to the Prophet and tell him, that the people were trying to bring their gifts to him when it was 'Aishah's day, and to say to him:                      \"We love good things as much as 'Aishah does.\" So she spoke to him, but he did not reply her. When her turn came again, she spoke to him again, but he did not reply her. They said to her: \"How did he respond?\" She said: \"He did not answer me.\" They said: \"Do not leave him alone until he answers you or you comprehend what he says.\" When her turn came again, she spoke to him and he said: 'Do not bother me about 'Aishah, for the Revelation has never come to me under the blanket of any of you apart from the blanket of 'Aishah.'\"",
      "chain": [
        "20337",
        "11065",
        "11717",
        "56"
      ]
    },
    {
      "hadith_no": "3956",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Kind Treatment of Women - كتاب عشرة النساء",
      "chapter_no": "36",
      "text_ar": "أخبرنا الربيع بن سليمان، قال حدثنا أسد بن موسى، قال حدثنا حماد بن سلمة، عن ثابت، عن أبي المتوكل، عن أم سلمة، أنها - يعني - أتت بطعام في صحفة لها إلى رسول الله صلى الله عليه وسلم وأصحابه فجاءت عائشة متزرة بكساء ومعها فهر ففلقت به الصحفة فجمع النبي صلى الله عليه وسلم بين فلقتى الصحفة ويقول ‏\"‏ كلوا غارت أمكم ‏\"‏ ‏.‏ مرتين ثم أخذ رسول الله صلى الله عليه وسلم صحفة عائشة فبعث بها إلى أم سلمة وأعطى صحفة أم سلمة عائشة ‏.‏",
      "text_en": " It was narrated from Umm Salamah that she brought some food in a dish of hers to the Messenger of Allah and his Companions, then 'Aishah came, wrapped up in a garment, with a stone pestle and broke the dish. The Prophet gathered the broken pieces of the dish and said:                      \"Eat; your mother got jealous,\" twice. Then the Messenger of Allah took the dish of 'Aishah and sent it to Umm Salamah and he gave the dish of Umm Salamah to 'Aishah.",
      "chain": [
        "30583",
        "28040",
        "20021",
        "11269",
        "11297",
        "56"
      ]
    },
    {
      "hadith_no": "4361",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا سليمان بن سلم البلخي، قال حدثنا النضر، - وهو ابن شميل - قال أنبأنا شعبة، عن مالك بن أنس، عن ابن مسلم، عن سعيد بن المسيب، عن أم سلمة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من رأى هلال ذي الحجة فأراد أن يضحي فلا يأخذ من شعره ولا من أظفاره حتى يضحي ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ummm Salamah that the Prophet said:                     \"Whoever sees the new crescent of Dhul-Hijjah and wants to offer a sacrifice, let him not remove any of his hair or nails until he has offered the sacrifice.\"",
      "chain": [
        "20291",
        "20020",
        "20001",
        "11002",
        "56"
      ]
    },
    {
      "hadith_no": "4364",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا عبد الله بن محمد بن عبد الرحمن، قال حدثنا سفيان، قال حدثني عبد الرحمن بن حميد بن عبد الرحمن بن عوف، عن سعيد بن المسيب، عن أم سلمة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا دخلت العشر فأراد أحدكم أن يضحي فلا يمس من شعره ولا من بشره شيئا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Umm Salamah that the Messenger of Allah said:                     \"when the (first) ten (days of Dhul-Jijjah) begin, and one of you wants to offer a sacrifice, let him not remove anything from his hair or skin.\"",
      "chain": [
        "20012",
        "11193",
        "11002",
        "56"
      ]
    },
    {
      "hadith_no": "5337",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "حدثنا العباس بن الوليد بن مزيد، قال أخبرني أبي قال، حدثنا الأوزاعي، قال حدثنا يحيى بن أبي كثير، عن نافع، عن أم سلمة، أنها ذكرت لرسول الله صلى الله عليه وسلم ذيول النساء فقال رسول الله صلى الله عليه وسلم ‏\"‏ يرخين شبرا ‏\"‏ ‏.‏ قالت أم سلمة إذا ينكشف عنها ‏.‏ قال ‏\"‏ ترخي ذراعا لا تزيد عليه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Umm Salamah that:                     She mentioned women's hems to the Messenger of Allah [SAW], and the Messenger of Allah [SAW] said: \"Let it down a hand span.\" Umm Salamah said: \"But that will uncover (her feet).\" He said: \"Let it down a forearm's length, but no more than that.\"",
      "chain": [
        "20024",
        "11449",
        "11014",
        "56"
      ]
    },
    {
      "hadith_no": "5338",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا عبد الجبار بن العلاء بن عبد الجبار، عن سفيان، قال حدثني أيوب بن موسى، عن نافع، عن صفية، عن أم سلمة، أن النبي صلى الله عليه وسلم لما ذكر في الإزار ما ذكر قالت أم سلمة فكيف بالنساء قال ‏\"‏ يرخين شبرا ‏\"‏ ‏.‏ قالت إذا تبدو أقدامهن ‏.‏ قال ‏\"‏ فذراعا لا يزدن عليه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Umm Salamah that:                     When the Prophet [SAW] said what he said about the Izar, Umm Salamah said: \"What about women?\" He said: \"Let it down a hand span.\" She said: \"But then their feet will show.\" He said: \"Then (let it down) a forearm's length, but no more than that.\"",
      "chain": [
        "30419",
        "20005",
        "11241",
        "11014",
        "2802",
        "56"
      ]
    },
    {
      "hadith_no": "5339",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا النضر، قال حدثنا المعتمر، - وهو ابن سليمان - قال حدثنا عبيد الله، عن نافع، عن سليمان بن يسار، عن أم سلمة، قالت سئل رسول الله صلى الله عليه وسلم كم تجر المرأة من ذيلها قال ‏\"‏ شبرا ‏\"‏ ‏.‏ قالت إذا ينكشف عنها ‏.‏ قال ‏\"‏ ذراع لا تزيد عليها ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Umm Salamah said:                     \"The Messenger of Allah [SAW] was asked how much a woman should let her hem drag. He said: 'A hand span.' She said: 'But then it will uncover her (feet).' He said: 'A forearm's length, and no more than that.'\"",
      "chain": [
        "30449",
        "20291",
        "20288",
        "11201",
        "11014",
        "11005",
        "56"
      ]
    },
    {
      "hadith_no": "5401",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Etiquette of Judges - كتاب آداب القضاة",
      "chapter_no": "49",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا يحيى، قال حدثنا هشام بن عروة، قال حدثني أبي، عن زينب بنت أبي سلمة، عن أم سلمة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إنكم تختصمون إلى وإنما أنا بشر ولعل بعضكم ألحن بحجته من بعض فمن قضيت له من حق أخيه شيئا فلا يأخذه فإنما أقطعه به قطعة من النار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Umm Salamah that:                     The Messenger of Allah [SAW] said: \"You refer your disputes to me, but I am only human, and some of you may be more eloquent in arguing their case than others. If I pass judgment in favor of one of you, against his brother's rights, let him not take it, for it is a piece of fire that I am giving him.\"",
      "chain": [
        "30153",
        "20031",
        "11065",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "5422",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Etiquette of Judges - كتاب آداب القضاة",
      "chapter_no": "49",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال حدثنا وكيع، عن هشام بن عروة، عن أبيه، عن زينب بنت أم سلمة، عن أم سلمة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ إنكم تختصمون إلى وإنما أنا بشر ولعل بعضكم ألحن بحجته من بعض فإنما أقضي بينكما على نحو ما أسمع فمن قضيت له من حق أخيه شيئا فإنما أقطع له قطعة من النار ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Umm Salamah said:                     \"The Messenger of Allah [SAW] said: 'You refer your disputes to me, but I am only human. And some of you may be more eloquent in arguing their case than others, and I may pass judgment on the basis of what I hear. If I pass judgment in favor of one of you against his brother's rights, then it is a piece of the fire that I am giving him.'\"",
      "chain": [
        "30123",
        "20032",
        "11065",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "5486",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرني محمد بن قدامة، قال حدثنا جرير، عن منصور، عن الشعبي، عن أم سلمة، أن النبي صلى الله عليه وسلم كان إذا خرج من بيته قال ‏\"‏ بسم الله رب أعوذ بك من أن أزل أو أضل أو أظلم أو أظلم أو أجهل أو يجهل على ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Umm Salamah that :                     When the Prophet [SAW] went out of his house, he said: \"Bismillahi Rabbi! A'udhu bika min an azilla aw adilla aw azlima aw uzlama, aw ajhala aw yujhala 'alayya (In the name of Allah, my Lord, I seek refuge in You from falling into error or going astray, or wrongdoing (others) or being wronged, and from behaving or being treated in an ignorant manner.)\"",
      "chain": [
        "20028",
        "11067",
        "11052",
        "56"
      ]
    },
    {
      "hadith_no": "5539",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا عبد الرحمن، قال حدثنا سفيان، عن منصور، عن الشعبي، عن أم سلمة، أن النبي صلى الله عليه وسلم كان إذا خرج من بيته قال ‏\"‏ بسم الله رب أعوذ بك من أن أزل أو أضل أو أظلم أو أظلم أو أجهل أو يجهل على ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Umm Salamah that:                     When the Prophet [SAW] went out of his house, he said: \"Bismillahi Rabbi. A'udhu bika min an azilla aw adilla aw azlima aw uzlama, aw ajhala aw yujhala 'alayya (In the name of Allah my Lord, I seek refuge in You from falling into error or going astray, or wronging (others) or being wronged, and from behaving or being treated in an ignorant manner.)\"",
      "chain": [
        "30160",
        "20033",
        "20012",
        "11067",
        "11052",
        "56"
      ]
    },
    {
      "hadith_no": "411",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا إسماعيل ابن علية، عن هشام الدستوائي، عن يحيى بن أبي كثير، عن أبي سلمة، عن زينب بنت أم سلمة، عن أم سلمة، أنها كانت ورسول الله  صلى الله عليه وسلم  يغتسلان من إناء واحد ‏.‏",
      "text_en": " Zainab the daughter of Umm Salamah narrated from Umm Salamah that:                     She and the Messenger of Allah used to take a bath from a single vessel.",
      "chain": [
        "30201",
        "20208",
        "20295",
        "11449",
        "10567",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "530",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن الصباح، حدثنا حاتم بن إسماعيل، عن جعفر بن محمد، عن أبيه، عن علي بن الحسين، عن زينب بنت أم سلمة، عن أم سلمة، قالت أتي رسول الله  صلى الله عليه وسلم  بكتف شاة فأكل منه وصلى ولم يمس ماء ‏.‏",
      "text_en": " It was narrated that Umm Salamah said:                     \"Some meat from the shoulder of a sheep was brought to the Messenger of Allah and he ate some of it, then he performed prayer without touching water (for ablution).\"",
      "chain": [
        "30269",
        "20159",
        "10898",
        "11442",
        "11045",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "646",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا سفيان بن عيينة، عن أيوب بن موسى، عن سعيد بن أبي سعيد المقبري، عن عبد الله بن رافع، عن أم سلمة، قالت قلت يا رسول الله إني امرأة أشد ضفر رأسي أفأنقضه لغسل الجنابة فقال ‏\"‏ إنما يكفيك أن تحثي عليه ثلاث حثيات من ماء ثم تفيضي عليك من الماء فتطهرين ‏\"‏ ‏.‏ أو قال ‏\"‏ فإذا أنت قد طهرت ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Umm Salamah said:                     \"I said, O Messenger of Allah! I am a woman with tight braids. Should I undo them when I take a bath to cleanse myself from the state of sexual impurity?\" He said: \"Rather it is sufficient for you to pour three handfuls of water over yourself, and you will be purified,\" or he said: \"In that case you would have become purified.\"",
      "chain": [
        "30201",
        "20005",
        "11241",
        "11168",
        "11864",
        "56"
      ]
    },
    {
      "hadith_no": "666",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعلي بن محمد، قالا حدثنا أبو أسامة، عن عبيد الله بن عمر، عن نافع، عن سليمان بن يسار، عن أم سلمة، قالت سألت امرأة النبي  صلى الله عليه وسلم  قالت إني أستحاض فلا أطهر أفأدع الصلاة قال ‏\"‏ لا ولكن دعي قدر الأيام والليالي التي كنت تحيضين ‏\"‏ ‏.‏ قال أبو بكر في حديثه ‏\"‏ وقدرهن من الشهر ثم اغتسلي واستثفري بثوب وصلي ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Umm Salamah said:                     \"A woman asked the Prophet: 'I bleed continuously and I do not become pure. Should I give up the prayer?' He said: 'No, but leave off praying for the number of days and nights that used to menstruate.'\" (One of the narrators) Abu Bakr (Ibn Abu Shaibah) said in this Hadith: \"Estimate the number of days in the month, then take a bath and cover your private part with a cloth and perform prayer.\"",
      "chain": [
        "30201",
        "38409",
        "20318",
        "11201",
        "11014",
        "11005",
        "56"
      ]
    },
    {
      "hadith_no": "680",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، حدثنا محمد بن عمرو، حدثنا أبو سلمة، عن أم سلمة، قالت كنت مع رسول الله  صلى الله عليه وسلم  في لحافه فوجدت ما تجد النساء من الحيضة فانسللت من اللحاف فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ أنفست ‏\"‏ ‏.‏ قلت وجدت ما تجد النساء من الحيضة ‏.‏ قال ‏\"‏ ذلك ما كتب الله على بنات آدم ‏\"‏ ‏.‏ قالت فانسللت فأصلحت من شأني ثم رجعت فقال لي رسول الله  صلى الله عليه وسلم  ‏\"‏ تعالى فادخلي معي في اللحاف ‏\"‏ ‏.‏ قالت فدخلت معه ‏.‏",
      "text_en": " It was narrated that Umm Salamah said:                     \"I was with the Messenger of Allah under his blanket, then I felt that I was menstruating as women do, so I slipped out from under the cover. The Messenger of Allah said: 'Are you menstruating?' I said: 'I feel that I am menstruating as women do.' He said: 'That is what Allah has decreed for the daughters of Adam.' So I slipped out and sorted myself out, then I came back, and the Messenger of Allah said to me: 'Come under the cover with me,' so I went in with him.'\"",
      "chain": [
        "30201",
        "20352",
        "11220",
        "10567",
        "56"
      ]
    },
    {
      "hadith_no": "688",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن يحيى، قالا حدثنا أبو نعيم، حدثنا ابن أبي غنية، عن أبي الخطاب الهجري، عن محدوج الذهلي، عن جسرة، قالت أخبرتني أم سلمة، قالت دخل رسول الله  صلى الله عليه وسلم  صرحة هذا المسجد فنادى بأعلى صوته ‏\"‏ إن المسجد لا يحل لجنب ولا لحائض ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Jasrah said:                     \"Umm Salamah told me: 'The Messenger of Allah entered the courtyard of this mosque and called out at the top of his voice: 'The mosque is not permissible for anyone who is sexually impure or any woman who is menstruating.''\"",
      "chain": [
        "30201",
        "11222",
        "20348",
        "28680",
        "18969",
        "56"
      ]
    },
    {
      "hadith_no": "692",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا نصر بن علي الجهضمي، حدثنا شجاع بن الوليد، عن علي بن عبد الأعلى، عن أبي سهل، عن مسة الأزدية، عن أم سلمة، قالت كانت النفساء على عهد رسول الله  صلى الله عليه وسلم  تجلس أربعين يوما وكنا نطلي وجوهنا بالورس من الكلف ‏.‏",
      "text_en": " It was narrated that Umm Salamah said:                     \"At the time of the Messenger of Allah, women in postnatal bleeding (after childbirth) used to wait for forty days, and we used to put Wars on our faces because of freckles.\"",
      "chain": [
        "30395",
        "20328",
        "19877",
        "14330",
        "19523",
        "56"
      ]
    },
    {
      "hadith_no": "978",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا شبابة، حدثنا شعبة، عن موسى بن أبي عائشة، عن مولى، لأم سلمة عن أم سلمة، أن النبي  صلى الله عليه وسلم  كان يقول إذا صلى الصبح حين يسلم ‏\"‏ اللهم إني أسألك علما نافعا ورزقا طيبا وعملا متقبلا ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Umm Salamah that when the Prophet (ﷺ)performed theSubh (morning prayer), while he said the Salam, he would say:                      ‘Allahummainnias’aluka ‘ilman nafi’an, wa rizqan tayyiban, wa ‘amalanmutaqabbalan (O Allah, I ask You for beneficial knowledge, goodlyprovision and acceptable deeds).’”",
      "chain": [
        "30201",
        "20426",
        "20020",
        "11399",
        "56"
      ]
    },
    {
      "hadith_no": "985",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أحمد بن عبد الملك بن واقد، حدثنا إبراهيم بن سعد، عن ابن شهاب، عن هند بنت الحارث، عن أم سلمة، قالت كان رسول الله  صلى الله عليه وسلم  إذا سلم قام النساء حين يقضي تسليمه ثم يلبث في مكانه يسيرا قبل أن يقوم ‏.‏",
      "text_en": " It wasnarrated that Umm Salamah said:                      “When the Messenger of Allah(ﷺ)said the Salam, the women would stand up when he finished hisTaslim,and he would stay where he was for a little while beforestanding up.(i.e. to depart).”",
      "chain": [
        "30201",
        "30303",
        "20150",
        "11013",
        "11734",
        "56"
      ]
    },
    {
      "hadith_no": "1001",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن أسامة بن زيد، عن محمد بن قيس، - هو قاص عمر بن عبد العزيز - عن أبيه، عن أم سلمة، قالت كان النبي  صلى الله عليه وسلم  يصلي في حجرة أم سلمة فمر بين يديه عبد الله أو عمر بن أبي سلمة فقال بيده فرجع فمرت زينب بنت أم سلمة فقال بيده هكذا فمضت فلما صلى رسول الله  صلى الله عليه وسلم  قال ‏\"‏ هن أغلب ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Umm Salamah said:                      “The Prophet (ﷺ) wasperformingprayer in the house of Umm Salamah, and ‘Abdullah or ‘UmarbinAbu Salamah passed in front of him; he gestured his hand, and hewentback. Then Zainab bint Umm Salamah passed in front of him, and hegestured his hand, but she kept going. When the Messenger of Allah(ﷺ) finished his prayer, he said: ‘These (women) are morestubborn.’”",
      "chain": [
        "30201",
        "20032",
        "50",
        "15",
        "56"
      ]
    },
    {
      "hadith_no": "1010",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا بكر بن خلف، وسويد بن سعيد، قالا حدثنا يزيد بن زريع، حدثنا خالد الحذاء، عن أبي قلابة، عن زينب بنت أبي سلمة، عن أمها، قالت كان فراشها بحيال مسجد رسول الله  صلى الله عليه وسلم  ‏.‏",
      "text_en": " It wasnarrated from Zainab bint Umm Salamah that her mother saidthat herbed was in front of the place where the Messenger of Allah(ﷺ)prostrated.",
      "chain": [
        "34043",
        "30547",
        "20304",
        "11282",
        "11047",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "1248",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا حميد بن عبد الرحمن، عن زهير، عن منصور، عن الحكم، عن مقسم، عن أم سلمة، قالت كان رسول الله  صلى الله عليه وسلم  يوتر بسبع أو بخمس لا يفصل بينهن بتسليم ولا كلام ‏.‏",
      "text_en": " It wasnarrated that Umm Salamah said:                      “The Messenger of Allah (ﷺ)usedto pray Witr with seven or five Rak’ah, and he would not saySalamor speak in between them.”",
      "chain": [
        "30201",
        "10561",
        "20321",
        "11067",
        "11069",
        "11725",
        "56"
      ]
    },
    {
      "hadith_no": "1251",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن بشار، حدثنا حماد بن مسعدة، حدثنا ميمون بن موسى المرئي، عن الحسن، عن أمه، عن أم سلمة، أن النبي  صلى الله عليه وسلم  كان يصلي بعد الوتر ركعتين خفيفتين وهو جالس ‏.‏",
      "text_en": " It wasnarrated from Umm Salamah that the Prophet (ﷺ) used to praytwoshort Rak’ah after Witr, sitting down.",
      "chain": [
        "30160",
        "20224",
        "24453",
        "11016",
        "10737",
        "56"
      ]
    },
    {
      "hadith_no": "1283",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو الأحوص، عن أبي إسحاق، عن أبي سلمة، عن أم سلمة، قالت والذي ذهب بنفسه  صلى الله عليه وسلم  ما مات حتى كان أكثر صلاته وهو جالس وكان أحب الأعمال إليه العمل الصالح الذي يدوم عليه العبد وإن كان يسيرا ‏.‏",
      "text_en": " It wasnarrated that Umm Salamah said:                      ‘By the One Who took his soul(i.e., the soul of the Prophet (ﷺ)), he did not die until heofferedmost of his prayers sitting down. And the dearest of theactions tohim was the righteous action that the person doesregularly, even ifit were a little.”",
      "chain": [
        "30201",
        "20327",
        "11049",
        "10567",
        "56"
      ]
    },
    {
      "hadith_no": "1300",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا حاتم بن بكر الضبي، حدثنا محمد بن يعلى، زنبور حدثنا عنبسة بن عبد الرحمن، عن عبد الله بن نافع، عن أبيه، عن أم سلمة، قالت نهى رسول الله  صلى الله عليه وسلم  عن القنوت في الفجر ‏.‏",
      "text_en": " It wasnarrated that Umm Salamah said:                      “The Messenger of Allah (ﷺ)wasforbidden to recite Qunut in Fajr.”",
      "chain": [
        "28459",
        "30411",
        "56"
      ]
    },
    {
      "hadith_no": "1514",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعلي بن محمد، قالا حدثنا أبو معاوية، عن الأعمش، عن شقيق، عن أم سلمة، قالت قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إذا حضرتم المريض أو الميت فقولوا خيرا فإن الملائكة يؤمنون على ما تقولون ‏\"‏ ‏.‏ فلما مات أبو سلمة أتيت النبي  صلى الله عليه وسلم  فقلت يا رسول الله إن أبا سلمة قد مات ‏.‏ قال ‏\"‏ قولي اللهم اغفر لي وله وأعقبني منه عقبى حسنة ‏\"‏ ‏.‏ قالت ففعلت فأعقبني الله من هو خير منه ‏.‏ محمد رسول الله  صلى الله عليه وسلم  ‏.‏",
      "text_en": " It wasnarrated that Umm Salamah said:                      “The Messenger of Allah (ﷺ)said:‘When you visit one who is sick or dying, say good things, fortheangels say: Amin to whatever you say.’ When Abu Salamah died, Icame to the Prophet (ﷺ) and said: ‘O Messenger of Allah! AbuSalamahhas died.’ He said: ‘Say: “Allahummaghfir li wa lahu,wa a’qibni minhu‘uqba hasanah (O Allah, forgive me and him, andcompensate me withsomeone better than him).’” She said: ‘Isaid that, and Allahcompensated me with someone better than him:Muhammad the Messenger ofAllah (ﷺ).’”",
      "chain": [
        "30201",
        "38409",
        "20354",
        "11060",
        "11353",
        "56"
      ]
    },
    {
      "hadith_no": "1521",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا إسماعيل بن أسد، حدثنا معاوية بن عمرو، حدثنا أبو إسحاق الفزاري، عن خالد الحذاء، عن أبي قلابة، عن قبيصة بن ذؤيب، عن أم سلمة، قالت دخل رسول الله  صلى الله عليه وسلم  على أبي سلمة وقد شق بصره فأغمضه ثم قال ‏\"‏ إن الروح إذا قبض تبعه البصر ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Umm Salamah said:                      “The Messenger of Allah (ﷺ)entered upon Abu Salamah (after he had died), and his eyes were wideopen. He closed his eyes, then he said: ‘When the soul is taken,thesight follows it.’”",
      "chain": [
        "20389",
        "20405",
        "11282",
        "11047",
        "56"
      ]
    },
    {
      "hadith_no": "1646",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن يزيد بن عبد الله، مولى الصهباء عن شهر بن حوشب، عن أم سلمة، عن النبي  صلى الله عليه وسلم  ‏{ولا يعصينك في معروف}‏ قال ‏\"‏ النوح ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Umm Salamah from the Prophet (ﷺ) regarding:                     “Andthat they will not disobey you in Ma’ruf (all that is good inIslam);” he said: “(It is about) wailing.”",
      "chain": [
        "30201",
        "20032",
        "11044",
        "56"
      ]
    },
    {
      "hadith_no": "1666",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يزيد بن هارون، أنبأنا عبد الملك بن قدامة الجمحي، عن أبيه، عن عمر بن أبي سلمة، عن أم سلمة، أن أبا سلمة، حدثها أنه، سمع رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ ما من مسلم يصاب بمصيبة فيفزع إلى ما أمر الله به من قوله إنا لله وإنا إليه راجعون اللهم عندك احتسبت مصيبتي فأجرني فيها وعضني منها - إلا آجره الله عليها وعاضه خيرا منها ‏\"‏ ‏.‏ قالت فلما توفي أبو سلمة ذكرت الذي حدثني عن رسول الله  صلى الله عليه وسلم  فقلت إنا لله وإنا إليه راجعون اللهم عندك احتسبت مصيبتي هذه فأجرني عليها ‏.‏ فإذا أردت أن أقول وعضني خيرا منها قلت في نفسي أعاض خيرا من أبي سلمة ثم قلتها فعاضني الله محمدا  صلى الله عليه وسلم  ‏.‏ وآجرني في مصيبتي ‏.‏",
      "text_en": " It wasnarrated from Umm Salamah that Abu Salamah told her that heheard theMessenger of Allah (ﷺ) say:                      “There is no Muslim who isstrickenwith a calamity and reacts by saying as Allah has commanded:‘Innalillahi, wa inna ilayhi raji’un. Allahumma indakah-tasabtumusibati, fajurni iha, wa ‘awwidni minha (Truly, to Allah we belongand truly, to Him we shall return. O Allah, with You I seek rewardformy calamity, so reward me for it and compensate me),’ but Allahwillreward him for that and compensate him with something betterthan it.”She said: “When Abu Salamah died, I remembered what hehad told mefrom the Messenger of Allah (ﷺ) and I said: ‘Innalillahi, wa innailayhi raji’un. Allahumma indakah-tasabtumusibati, fajurni ihaiha(Truly, to Allah we belong and truly, to Himwe shall return. O Allah,with You I seek reward for my calamity, soreward me for it).’ Butwhen I wanted to say wa ‘awwidni minha(and compensate me withbetter), I said to myself: ‘How can I becompensated with somethingbetter than Abu Salamah?’ Then I saidit, and Allah compensated mewith Muhammad (ﷺ) and rewarded me formy calamity.”",
      "chain": [
        "30201",
        "20472",
        "22137",
        "18860",
        "246",
        "56"
      ]
    },
    {
      "hadith_no": "1685",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن معمر، حدثنا محمد بن بكر، حدثنا عبد الله بن زياد، أخبرني أبو عبيدة بن عبد الله بن زمعة، عن أمه، عن أم سلمة، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ كسر عظم الميت ككسر عظم الحى في الإثم ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Umm Salamah that the Prophet (ﷺ) said:                     “Breakingthe bones of the deceased is, in sin, like breaking hisbones when heis alive.”",
      "chain": [
        "30172",
        "20277",
        "56"
      ]
    },
    {
      "hadith_no": "1693",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يزيد بن هارون، حدثنا همام، عن قتادة، عن صالح أبي الخليل، عن سفينة، عن أم سلمة، أن رسول الله  صلى الله عليه وسلم  كان يقول في مرضه الذي توفي فيه ‏\"‏ الصلاة وما ملكت أيمانكم ‏\"‏ ‏.‏ فما زال يقولها حتى ما يفيض بها لسانه ‏.‏",
      "text_en": " It wasnarrated from Umm Salamah that the Messenger of Allah (ﷺ)used tosay, during the illness that would be his last:                      “The prayer,andthose whom your hands possess.”* And he kept on saying it untilhistongue could no longer utter any words.",
      "chain": [
        "30201",
        "20472",
        "20297",
        "11019",
        "11291",
        "438",
        "56"
      ]
    },
    {
      "hadith_no": "1717",
      "source": " Sunan Ibn Majah ",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا زيد بن الحباب، عن شعبة، عن منصور، عن سالم بن أبي الجعد، عن أبي سلمة، عن أم سلمة، قالت كان رسول الله  صلى الله عليه وسلم  يصل شعبان برمضان ‏.‏",
      "text_en": " It wasnarrated that Umm Salamah said:                      “The Messenger of Allah (ﷺ)usedto join Sha’ban to Ramadan.”",
      "chain": [
        "30201",
        "20650",
        "20020",
        "11067",
        "11342",
        "10567",
        "56"
      ]
    },
    {
      "hadith_no": "1774",
      "source": " Sunan Ibn Majah ",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا علي بن محمد، حدثنا عبد الله بن نمير، عن عبيد الله، عن نافع، قال سألت أم سلمة عن الرجل، يصبح وهو جنب يريد الصوم قالت كان رسول الله  صلى الله عليه وسلم  يصبح جنبا من الوقاع لا من احتلام ثم يغتسل ويتم صومه ‏.‏",
      "text_en": " It wasnarrated that Nafi’ said:                      “I asked Umm Salamah about a man whogets up in the morning when he is in a state of sexual impurity andwants to fast. She said: “The Messenger of Allah (ﷺ) used to getupin the morning in a state of sexual impurity after havingintercourse,not from a wet dream, then he would take a bath andcomplete hisfast.’”",
      "chain": [
        "38409",
        "20331",
        "11201",
        "11014",
        "56"
      ]
    },
    {
      "hadith_no": "1908",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters Regarding Zakat - كتاب الزكاة",
      "chapter_no": "8",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يحيى بن آدم، حدثنا حفص بن غياث، عن هشام بن عروة، عن أبيه، عن زينب بنت أم سلمة، عن أم سلمة، قالت أمرنا رسول الله  صلى الله عليه وسلم  بالصدقة ‏.‏ فقالت زينب امرأة عبد الله أيجزيني من الصدقة أن أتصدق على زوجي وهو فقير وبني أخ لي أيتام وأنا أنفق عليهم هكذا وهكذا وعلى كل حال قال ‏\"‏ نعم ‏\"‏ ‏.‏ قال وكانت صناع اليدين ‏.‏",
      "text_en": " It was narrated that:                     Umm Salmah said: “The Messenger of Allah enjoined charity upon us. Zainab, the wife of Abdullah said: 'Will it accepted as charity on my part if I give charity to my husband who is poor, and to children of a brother of mine who are orphans, spending such and such on them, and in all circumstances?' He said: 'Yes.' ”",
      "chain": [
        "30201",
        "20364",
        "20317",
        "11065",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "1977",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن هشام بن عروة، عن أبيه، عن زينب بنت أم سلمة، عن أم سلمة، أن النبي  صلى الله عليه وسلم  دخل عليها فسمع مخنثا وهو يقول لعبد الله بن أبي أمية إن يفتح الله الطائف غدا دللتك على امرأة تقبل بأربع وتدبر بثمان ‏.‏ فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ أخرجوه من بيوتكم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Umm Salamah:                     that the Prophet Mohammad entered upon her, and he heard an effeminate man say to 'Abdullah bin Abu Umayyah: “If  Allah enables you to conquer Ta'if tommorrow, I will show you a woman who comes in on four (rolls of fat) and goes out on eight.” The Messenger of Allah said: “Throw them out of your houses.”",
      "chain": [
        "30201",
        "20032",
        "11065",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "1992",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يحيى بن سعيد القطان، عن سفيان، عن محمد بن أبي بكر، عن عبد الملك، - يعني ابن أبي بكر بن الحارث بن هشام - عن أبيه، عن أم سلمة، أن رسول الله  صلى الله عليه وسلم  لما تزوج أم سلمة أقام عندها ثلاثا وقال ‏\"‏ ليس بك على أهلك هوان إن شئت سبعت لك وإن سبعت لك سبعت لنسائي ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Al-Harith from his father that when married Umm Salamah, he stayed with her for three days, then he said:                     “You are not insignificant in your husband's eyes. If you wish, I will stay with you for seven days, but then I will stay with my other wives for seven days too.”",
      "chain": [
        "30201",
        "20031",
        "20012",
        "11214",
        "11239",
        "56"
      ]
    },
    {
      "hadith_no": "2073",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "قال الزهري فحدثني أبو عبيدة بن عبد الله بن زمعة، أن جدته، زينب حدثته عن أم سلمة، أنها كانت تعد هؤلاء الثلاثة وتزيد معهن السيف ‏.‏",
      "text_en": "",
      "chain": [
        "56"
      ]
    },
    {
      "hadith_no": "2139",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Divorce - كتاب الطلاق",
      "chapter_no": "10",
      "text_ar": "حدثنا أحمد بن يوسف السلمي، حدثنا أبو عاصم، عن ابن جريج، عن يحيى بن عبد الله بن محمد بن صيفي، عن عكرمة بن عبد الرحمن، عن أم سلمة، أن رسول الله  صلى الله عليه وسلم  آلى من بعض نسائه شهرا فلما كان تسعة وعشرين راح أو غدا ‏.‏ فقيل يا رسول الله إنما مضى تسع وعشرون ‏.‏ فقال ‏\"‏ الشهر تسع وعشرون ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Umm Salamah that:                     the Messenger of Allah (ﷺ) swore to keep away from some of his wives for a month. On the twenty-ninth day, in the evening or the morning, it was said: \"O Messenger of Allah, only twenty-nine days have passed.\" He said: \"The month is twenty-nine days.\"",
      "chain": [
        "30535",
        "20241",
        "11070",
        "11448",
        "56"
      ]
    },
    {
      "hadith_no": "2162",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Divorce - كتاب الطلاق",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يزيد بن هارون، أنبأنا يحيى بن سعيد، عن حميد بن نافع، ‏.‏ أنه سمع زينب ابنة أم سلمة، تحدث أنها سمعت أم سلمة، وأم حبيبة تذكران أن امرأة أتت النبي  صلى الله عليه وسلم  فقالت إن ابنة لها توفي عنها زوجها فاشتكت عينها فهي تريد أن تكحلها ‏.‏ فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ قد كانت إحداكن ترمي بالبعرة عند رأس الحول وإنما هي أربعة أشهر وعشرا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Humaid bin Nafi' that:                     he heard Zainab the daughter of Umm Salamah narrating that she heard Umm Salamah and Umm Habibah mention that a woman carne to the Prophet (ﷺ) and said that her daughter's husband had died, and she was suffering from an eye disease, and she wanted to apply kohl to her eyes (as a remedy). The Messenger of Allah (ﷺ) said: \"One of you would throw a she-camel's dropping when a year had passed (since the death of her husband. Rather it is four months and ten (days).\"",
      "chain": [
        "30201",
        "20472",
        "11062",
        "11157",
        "56"
      ]
    },
    {
      "hadith_no": "2317",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Rulings - كتاب الأحكام",
      "chapter_no": "13",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، حدثنا هشام بن عروة، عن أبيه، عن زينب بنت أم سلمة، عن أم سلمة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ إنكم تختصمون إلى وإنما أنا بشر ولعل بعضكم أن يكون ألحن بحجته من بعض وإنما أقضي بينكم على نحو مما أسمع منكم فمن قضيت له من حق أخيه شيئا فلا يأخذه فإنما أقطع له قطعة من النار يأتي بها يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Umm Salamah that the Messenger of Allah (ﷺ) said:                     “You refer your disputes to me and I am only human. Perhaps some of you may be more eloquent in presenting your case than others, so I rule in your favor because of what I hear from you. If I pass a judgement in favor of one of you that detracts from his brother's rights, then he should not take it, because it is a piece of fire that is given to him which he will bring forth on the Day Resurrection.”",
      "chain": [
        "30201",
        "20032",
        "11065",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "2616",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Manumission (of Slaves) - كتاب العتق",
      "chapter_no": "19",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا سفيان بن عيينة، عن الزهري، عن نبهان، - مولى أم سلمة - عن أم سلمة، أنها أخبرت عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ إذا كان لإحداكن مكاتب وكان عنده ما يؤدي فلتحتجب منه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Umm Salamah that the Prophet (ﷺ) said:                     “If anyone of you (women) has a Mukatab, and he has enough (wealth) to pay off (his contact of manumission), she must veil herself from him.”",
      "chain": [
        "30201",
        "20005",
        "11013",
        "56"
      ]
    },
    {
      "hadith_no": "2712",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن هشام بن عروة، عن أبيه، عن زينب بنت أم سلمة، عن أم سلمة، أن النبي صلى الله عليه وسلم دخل عليها فسمع مخنثا وهو يقول لعبد الله بن أبي أمية إن يفتح الله الطائف غدا دللتك على امرأة تقبل بأربع وتدبر بثمان ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ أخرجوهم من بيوتكم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Umm Salamah that :                     the Prophet (ﷺ) entered upon her, and heard an effeminate man saying to Abdullah bin Abu Umayyah: “If Allah enable us to conquer Ta'if tomorrow, I will show you a woman who comes in on four (roll of fat) and goes out on eight” The Prophet (ﷺ) said: “Throw them out of your houses.”",
      "chain": [
        "30201",
        "20032",
        "11065",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "3014",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن القاسم بن الفضل الحداني، عن أبي جعفر، عن أم سلمة، قالت قال رسول الله  صلى الله عليه وسلم  ‏\"‏ الحج جهاد كل ضعيف ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Umm Salamah that the Messenger of Allah (ﷺ)said:                     “Hajj is the Jihad of every weak person.”",
      "chain": [
        "30201",
        "20032",
        "20564",
        "56"
      ]
    },
    {
      "hadith_no": "3074",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا معلى بن منصور، ح وحدثنا إسحاق بن منصور، وأحمد بن سنان، قالا حدثنا عبد الرحمن بن مهدي، قالا حدثنا مالك بن أنس، عن محمد بن عبد الرحمن بن نوفل، عن عروة، عن زينب، عن أم سلمة، أنها مرضت فأمرها رسول الله  صلى الله عليه وسلم  أن تطوف من وراء الناس وهي راكبة ‏.‏ قالت فرأيت رسول الله  صلى الله عليه وسلم  يصلي إلى البيت وهو يقرأ ‏{والطور * وكتاب مسطور}‏ ‏.‏ قال ابن ماجه هذا حديث أبي بكر ‏.‏",
      "text_en": " It wasnarrated from Umm Salamah that she fell sick, so the MessengerofAllah (ﷺ) told her to perform Tawaf from behind the people,riding.She said:                      “I saw the Messenger of Allah (ﷺ) praying facingtheHouse, and reciting: “By the Tur (Mount), And by the BookInscribed.’” [52:1-2]",
      "chain": [
        "30201",
        "30278",
        "30313",
        "30297",
        "20033",
        "20001",
        "11105",
        "10511",
        "57",
        "56"
      ]
    },
    {
      "hadith_no": "3115",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الأعلى بن عبد الأعلى، عن محمد بن إسحاق، حدثني سليمان بن سحيم، عن أم حكيم بنت أمية، عن أم سلمة، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ من أهل بعمرة من بيت المقدس غفر له ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Umm Salamah that the Messenger of Allah (ﷺ)said:                     “Whoever begins the Talbiyah for ‘Umrah from Baitul-Maqdis, willbe forgiven.”",
      "chain": [
        "30201",
        "20246",
        "11107",
        "11855",
        "19469",
        "56"
      ]
    },
    {
      "hadith_no": "3269",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Sacrifices - كتاب الأضاحي",
      "chapter_no": "26",
      "text_ar": "حدثنا هارون بن عبد الله الحمال، حدثنا سفيان بن عيينة، عن عبد الرحمن بن حميد بن عبد الرحمن بن عوف، عن سعيد بن المسيب، عن أم سلمة، أن النبي  صلى الله عليه وسلم  قال ‏\"‏ إذا دخل العشر وأراد أحدكم أن يضحي فلا يمس من شعره ولا بشره شيئا ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Umm Salamah that the Prophet (ﷺ) said:                      “Whentheten days (of Dhul-Hijjah) begin, and one of you wants to offer asacrifice, let him not remove anything from his hair or skin.”",
      "chain": [
        "30524",
        "20005",
        "11193",
        "11002",
        "56"
      ]
    },
    {
      "hadith_no": "3270",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Sacrifices - كتاب الأضاحي",
      "chapter_no": "26",
      "text_ar": "حدثنا حاتم بن بكر الضبي أبو عمرو، حدثنا محمد بن بكر البرساني، ح وحدثنا محمد بن سعيد بن يزيد بن إبراهيم، حدثنا أبو قتيبة، ويحيى بن كثير، قالوا حدثنا شعبة، عن مالك بن أنس، عن عمرو بن مسلم، عن سعيد بن المسيب، عن أم سلمة، قالت قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من رأى منكم هلال ذي الحجة فأراد أن يضحي فلا يقربن له شعرا ولا ظفرا ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Umm Salamah that the Messenger of Allah (ﷺ)said:                     “Whoever among you sees the new crescent of Dhul-Hijjah andwantsto offer a sacrifice, let him not take anything from his hair ornails.”",
      "chain": [
        "20277",
        "20233",
        "20302",
        "20020",
        "20001",
        "10953",
        "11002",
        "56"
      ]
    },
    {
      "hadith_no": "3539",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Drinks - كتاب الأشربة",
      "chapter_no": "30",
      "text_ar": "حدثنا محمد بن رمح، أنبأنا الليث بن سعد، عن نافع، عن زيد بن عبد الله بن عمر، عن عبد الله بن عبد الرحمن بن أبي بكر، عن أم سلمة، أنها أخبرته عن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ إن الذي يشرب في إناء الفضة إنما يجرجر في بطنه نار جهنم ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Umm Salamah that the Messenger of Allah (ﷺ)said:                     “The one who drinks from a silver vessel is swallowing Hell-fireinto his belly.”",
      "chain": [
        "30490",
        "20023",
        "11014",
        "11819",
        "10520",
        "56"
      ]
    },
    {
      "hadith_no": "3706",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا يعقوب بن إبراهيم الدورقي، حدثنا أبو تميلة، عن عبد المؤمن بن خالد، عن ابن بريدة، عن أمه، عن أم سلمة، قالت لم يكن ثوب أحب إلى رسول الله  صلى الله عليه وسلم  من القميص ‏.‏",
      "text_en": " It wasnarrated that Umm Salamah said:                      There was no garment morebeloved tothe Messenger of Allah (ﷺ) than the shirt.”",
      "chain": [
        "30400",
        "20183",
        "28375",
        "11432",
        "56"
      ]
    },
    {
      "hadith_no": "3711",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو بكر، حدثنا المعتمر بن سليمان، عن عبيد الله بن عمر، عن نافع، عن سليمان بن يسار، عن أم سلمة، قالت سئل رسول الله  صلى الله عليه وسلم  كم تجر المرأة من ذيلها قال ‏\"‏ شبرا ‏\"‏ ‏.‏ قلت إذا ينكشف عنها ‏.‏ قال ذراع لا تزيد عليه ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Umm Salamah said:                      “The Messenger of Allah (ﷺ)wasasked about how long a woman’s hem should hang down. He said: ‘Ahand span.’ I said: ‘But then (her legs and feet) will beuncovered.’He said: ‘Then a forearm’s length, but no more thanthat.’”",
      "chain": [
        "20436",
        "20288",
        "11201",
        "11014",
        "11005",
        "56"
      ]
    },
    {
      "hadith_no": "3719",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر، حدثنا وكيع، عن زمعة بن صالح، عن الزهري، عن وهب بن عبد بن زمعة، عن أم سلمة، ح وحدثنا علي بن محمد، حدثنا وكيع، حدثنا زمعة بن صالح، عن الزهري، عن عبد الله بن وهب بن زمعة، عن أم سلمة، قالت خرج أبو بكر في تجارة إلى بصرى قبل موت النبي  صلى الله عليه وسلم  بعام ومعه نعيمان وسويبط بن حرملة وكانا شهدا بدرا وكان نعيمان على الزاد وكان سويبط رجلا مزاحا فقال لنعيمان أطعمني ‏.‏ قال حتى يجيء أبو بكر ‏.‏ قال فلأغيظنك ‏.‏ قال فمروا بقوم فقال لهم سويبط تشترون مني عبدا لي قالوا نعم ‏.‏ قال إنه عبد له كلام وهو قائل لكم إني حر ‏.‏ فإن كنتم إذا قال لكم هذه المقالة تركتموه فلا تفسدوا على عبدي ‏.‏ قالوا لا بل نشتريه منك ‏.‏ فاشتروه منه بعشر قلائص ثم أتوه فوضعوا في عنقه عمامة أو حبلا ‏.‏ فقال نعيمان إن هذا يستهزئ بكم وإني حر لست بعبد ‏.‏ فقالوا قد أخبرنا خبرك ‏.‏ فانطلقوا به فجاء أبو بكر فأخبروه بذلك ‏.‏ قال فاتبع القوم ورد عليهم القلائص وأخذ نعيمان ‏.‏ قال فلما قدموا على النبي  صلى الله عليه وسلم  وأخبروه ‏.‏ قال فضحك النبي  صلى الله عليه وسلم  وأصحابه منه حولا ‏.‏",
      "text_en": " It was narrated that Umm Salamah said:                     \"Abu Bakr went our to trade in Busra, one year before the Prophet(ﷺ) died, and with him were Nu'aiman and Suwaibit the sons of Harmalah, who had been present at Badr. Nu'iaman was in charge of the provisions, and Suwaibit was a man who joked a lot. He said to Nu'iman: 'Feed me'. He said: 'Not until Abu Bakr comes'. He said: 'Then I will have to annoy you'. Then they passed by some people, and Suwaibit said to them: 'Will you buy a slave from me?' They said: 'Yes'. He said ' He is a slave who talks a lot and he will tell you, \"I am a free man\". If you are going to let him go when says that to you, do not bother buying him.' They said: 'We will buy him from you.' So they bought him from him in return for ten young she-camels, then they brought him and tied a turban or a rope around his neck. Nu'aiman said: 'This man is making fun of you. I am a free man, not a slave.' They said: 'He has already told us about you; and they took him off.' THen Abu Bakr came and he (Suwaibit) told him about that. So he followed those people and returned their camels to them, and took Nu'iaman back. Whent hey came to the Prophet(ﷺ) they told him what had happened, and the Prophet(ﷺ) and his companions laughed about it for a year.\"",
      "chain": [
        "20436",
        "20032",
        "10636",
        "11013",
        "56",
        "38409",
        "20032",
        "10636",
        "11013",
        "2308",
        "56"
      ]
    },
    {
      "hadith_no": "3751",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا علي بن محمد، حدثنا عبد الرحمن بن عبد الله، حدثنا حماد بن سلمة، عن أبي هاشم الرماني، عن حبيب بن أبي ثابت، عن أم سلمة، أن النبي  صلى الله عليه وسلم  كان إذا اطلى بدأ بعورته فطلاها بالنورة وسائر جسده أهله ‏.‏",
      "text_en": " It was narrated from Umm Salamah that when the Prophet(ﷺ) would apply (it):                     he began with his private area, coating it with hair removing chemical. And his wife would do the remainder of his body.",
      "chain": [
        "38409",
        "20439",
        "20021",
        "11454",
        "11331",
        "56"
      ]
    },
    {
      "hadith_no": "3752",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا علي بن محمد، حدثني إسحاق بن منصور، عن كامل أبي العلاء، عن حبيب بن أبي ثابت، عن أم سلمة، أن النبي اطلى وولي عانته بيده ‏.‏",
      "text_en": " It was narrated from Umm Salamah that:                     \"the Prophet(ﷺ) would coat (with hair removing chemical) and remove the pubic hairs with his hand.\"",
      "chain": [
        "38409",
        "30313",
        "11331",
        "56"
      ]
    },
    {
      "hadith_no": "4202",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا محمد بن الصباح، ونصر بن علي، وهارون بن عبد الله الحمال، قالوا حدثنا سفيان بن عيينة، عن محمد بن سوقة، سمع نافع بن جبير، يخبر عن أم سلمة، قالت ذكر النبي  صلى الله عليه وسلم  الجيش الذي يخسف بهم فقالت أم سلمة يا رسول الله لعل فيهم المكره قال ‏\"‏ إنهم يبعثون على نياتهم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Umm Salamah said:                      “The Prophet (ﷺ) mentionedthe army that would be swallowed up by the earth, and Umm Salamahsaid: ‘O Messenger of Allah, perhaps there will be some among themwho were forced (to join them)?’ He said: ‘They will beresurrected according to their intentions.’”",
      "chain": [
        "30269",
        "30395",
        "30524",
        "20005",
        "11387",
        "11059",
        "56"
      ]
    }
  ],
  "total_hadiths": 216
}