{
  "id": "58",
  "name": "Juwayriya bint al-Harith ( جويرية بنت الحارث ( رضي الله عنها",
  "full_name": "Juwayriya bint al-Harith ( جويرية بنت الحارث ( رضي الله عنها",
  "grade": "Comp.(RA) [1st Generation]",
  "biography": {
    "birth": {
      "date_hijri": "12",
      "date_gregorian": "608",
      "date_display": [
        "12 BH",
        "608 CE"
      ],
      "place": "Medinah"
    },
    "death": {
      "date_hijri": "56",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Medinah",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medinah"
    ],
    "area_of_interest": [
      "Narrator [ ع  -  صحابي ]"
    ],
    "tags": [
      "Female",
      "B.al-Mustaliq",
      "B.Khuza'a",
      "Mother of the Believers",
      "Baqi'"
    ]
  },
  "parents": [],
  "spouses": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "students": [
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11203",
      "name": "'Ubaid bin al-Sabaq عبيد بن السباق الثقفي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11730",
      "name": "Abu Ayoub al-Maraghi al-Azdi أبو أيوب المراغي الأزدي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11028",
      "name": "Mujahid bin Jabir مجاهد بن جبر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11211",
      "name": "Karayb bin Abi Muslim كريب بن أبي مسلم الهاشمي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "18881",
      "name": "Khultum bin al-Mstlq Whw Khultum كلثوم بن المصطلق",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "169",
      "name": "'Abdullah ibn Shaddad ( عبد الله بن شداد بن الهاد الليثي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1986",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن شعبة، ح‏.‏ وحدثني محمد، حدثنا غندر، حدثنا شعبة، عن قتادة، عن أبي أيوب، عن جويرية بنت الحارث  رضى الله عنها  أن النبي صلى الله عليه وسلم دخل عليها يوم الجمعة وهى صائمة فقال ‏\"‏ أصمت أمس ‏\"‏‏.‏ قالت لا‏.‏ قال ‏\"‏ تريدين أن تصومي غدا ‏\"‏‏.‏ قالت لا‏.‏ قال ‏\"‏ فأفطري ‏\"‏‏.‏  وقال حماد بن الجعد سمع قتادة حدثني أبو أيوب أن جويرية حدثته فأمرها فأفطرت.",
      "text_en": " Narrated Abu Aiyub from Juwairiya bint Al-Harith:                     The Prophet visited her (Juwairiya) on a Friday and she was fasting. He asked her, \"Did you fast yesterday?\" She said, \"No.\" He said, \"Do you intend to fast tomorrow?\" She said, \"No.\" He said, \"Then break your fast.\" Through another series of narrators, Abu Aiyub is reported to have said, \"He ordered her and she broke her fast.\"",
      "chain": [
        "30175",
        "20031",
        "20020",
        "20278",
        "20278",
        "20020",
        "11019",
        "33",
        "58"
      ]
    },
    {
      "hadith_no": "2422",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا محمد بن كثير، حدثنا همام، عن قتادة، ح وحدثنا حفص بن عمر، حدثنا همام، حدثنا قتادة، عن أبي أيوب، - قال حفص العتكي - عن جويرية بنت الحارث، أن النبي صلى الله عليه وسلم دخل عليها يوم الجمعة وهي صائمة فقال ‏\"‏ أصمت أمس ‏\"‏ ‏.‏ قالت لا ‏.‏ قال ‏\"‏ تريدين أن تصومي غدا ‏\"‏ ‏.‏ قالت لا ‏.‏ قال ‏\"‏ فأفطري ‏\"‏ ‏.‏",
      "text_en": " Narrated Juwairiyah, daughter of al-Harith:                     That the Prophet (ﷺ) entered upon her on Friday while she was fasting. He asked: Did you fast yesterday ? She said: No. He again asked: Do you intend to fast tomorrow ? She said: No. He said: So break your fast.",
      "chain": [
        "28531",
        "20297",
        "11019",
        "30329",
        "20297",
        "11019",
        "33",
        "58"
      ]
    },
    {
      "hadith_no": "3555",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، عن شعبة، عن محمد بن عبد الرحمن، قال سمعت كريبا، يحدث عن ابن عباس، عن جويرية بنت الحارث، أن النبي صلى الله عليه وسلم مر عليها وهي في مسجد ثم مر النبي صلى الله عليه وسلم بها قريبا من نصف النهار فقال لها ‏\"‏ ما زلت على حالك ‏\"‏ ‏.‏ فقالت نعم ‏.‏ قال ‏\"‏ ألا أعلمك كلمات تقولينها سبحان الله عدد خلقه سبحان الله عدد خلقه سبحان الله عدد خلقه سبحان الله رضا نفسه سبحان الله رضا نفسه سبحان الله رضا نفسه سبحان الله زنة عرشه سبحان الله زنة عرشه سبحان الله زنة عرشه سبحان الله مداد كلماته سبحان الله مداد كلماته سبحان الله مداد كلماته ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ ومحمد بن عبد الرحمن هو مولى آل طلحة وهو شيخ مدني ثقة وقد روى عنه المسعودي وسفيان الثوري هذا الحديث ‏.‏",
      "text_en": " Ibn Abbas narrated from Juwairiyyah bint Al-Harith, that:                     the Prophet passed by her while she was in her place of prayer, then the Prophet passed by her near midday, so he said to her: “You have not ceased to be in this state?” She said: “Yes.” He said: “Should I not teach you worlds to say: ‘Glory to Allah according to the number of His creation, Glory to Allah according to the number of His creation, Glory to Allah according to the number of His creation (Subhan Allahi Adada Khalqihi, Subhan Allahi Adada Khalqihi, Subhan Allahi Adada Khalqihi,). Glory to Allah accord to what pleases Him, Glory to Allah accord to what pleases Him, Glory to Allah accord to what pleases Him (Subhan Allahi Rida Nafsihi, Subhan Allahi Rida Nafsihi, Subhan Allahi Rida Nafsihi). Glory to Allah according to the weight of His Throne, Glory to Allah according to the weight of His Throne, Glory to Allah according to the weight of His Throne (Subhan Allahi Zinata Arshihi, Subhan Allahi Zinata Arshihi, Subhan Allahi Zinata Arshihi). Glory to Allah according to the amount of His Words, Glory to Allah according to the amount of His Words, Glory to Allah according to the amount of His Words (Subhan Allahi Midada Kalimatihi, Subhan Allahi Midada Kalimatihi, Subhan Allahi Midada Kalimatihi)”",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11105",
        "11211",
        "17",
        "58"
      ]
    },
    {
      "hadith_no": "1352",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا محمد، قال حدثنا شعبة، عن محمد بن عبد الرحمن، مولى آل طلحة قال سمعت كريبا، عن ابن عباس، عن جويرية بنت الحارث، أن النبي صلى الله عليه وسلم مر عليها وهي في المسجد تدعو ثم مر بها قريبا من نصف النهار فقال لها ‏\"‏ ما زلت على حالك ‏\"‏ ‏.‏ قالت نعم ‏.‏ قال ‏\"‏ ألا أعلمك - يعني - كلمات تقولينهن سبحان الله عدد خلقه سبحان الله عدد خلقه سبحان الله عدد خلقه سبحان الله رضا نفسه سبحان الله رضا نفسه سبحان الله رضا نفسه سبحان الله زنة عرشه سبحان الله زنة عرشه سبحان الله زنة عرشه سبحان الله مداد كلماته سبحان الله مداد كلماته سبحان الله مداد كلماته ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Juwayriyah bint Al-Harith said that:                     The Prophet (ﷺ) passed by her while she was in the masjid, supplicating, then he passed by her again when it was almost midday. He said to her: \"Are you still here?\" She said: \"Yes.\" He said: \"Shall I not teach you some words which you can say? Subhan Allah adada khalqihi, subhan Allah adada khalqihi, subhan Allah adada khalqihi; subhan Allah rida nafsihi, subhan Allah rida nafsihi, subhan Allah rida nafsihi; Subhan Allah zinata 'arshihi, Subhan Allah zinata 'arshihi, Subhan Allah zinata 'arshihi; Subhan Allah midada Kalamatihi, Subhan Allah midada Kalamatihi, Subhan Allah midada Kalamatihi (Glory be to Allah the number of His creation, glory be to Allah the number of His creation, glory be to Allah the number of His creation; glory be to Allah as much as pleases Him, glory be to Allah as much as pleases Him, glory be to Allah as much as pleases Him; glory be to Allah the weight of His throne, glory be to Allah the weight of His throne, glory be to Allah the weight of His throne; glory be to Allah the number of His words, glory be to Allah the number of His words, glory be to Allah the number of His words).'",
      "chain": [
        "30160",
        "20278",
        "20020",
        "10818",
        "11211",
        "17",
        "58"
      ]
    }
  ],
  "total_hadiths": 4
}