{
  "id": "584",
  "name": "Ibrahim bin 'Abdur Rahman ( إبراهيم بن عبد الرحمن بن عوف الزهرى ( رضي الله عنه",
  "full_name": "Ibrahim bin 'Abdur Rahman ( إبراهيم بن عبد الرحمن بن عوف الزهرى ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "biography": {
    "birth": {
      "date_hijri": "6",
      "date_gregorian": "NA",
      "date_display": [
        "6 AH"
      ],
      "place": "Medinah"
    },
    "death": {
      "date_hijri": "97",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Medinah",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medinah"
    ],
    "area_of_interest": [
      "Narrator [ خ  م  د  س  ق  -  صحبة ]",
      "Fiqh"
    ],
    "tags": [
      "Quraish",
      "B.Zuhrah",
      "Born Muslim",
      "Child",
      "Imam"
    ]
  },
  "parents": [
    {
      "id": "8",
      "name": "'Abdur Rahman Ibn 'Awf ( عبد الرحمن بن عوف ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "95",
      "name": "Umm Kulthum bint 'Uqba ( أم كلثوم بنت عقبة بن أبي معيط ( رضي الله عنها",
      "grade": "Comp.(RA) [3rd Generation]"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "588",
      "name": "Muhammad bin 'Abdur-Rahman ( محمد بن عبد الرحمن بن عوف الزهرى ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "10561",
      "name": "Humaid bin 'Abdur Rahman حميد بن عبد الرحمن بن عوف الزهرى",
      "grade": "Follower(Tabi') [2nd Generation]"
    }
  ],
  "children": [
    {
      "id": "11063",
      "name": "Sa'd bin Ibrahim سعد بن إبراهيم بن عبد الرحمن",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11064",
      "name": "Salah bin Ibrahim صالح بن إبراهيم بن عبد الرحمن",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "18999",
      "name": "al-Maswar bin Ibrahim المسور بن إبراهيم بن عبد الرحمن",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "8",
      "name": "'Abdur Rahman Ibn 'Awf ( عبد الرحمن بن عوف ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3",
      "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4",
      "name": "'Uthman ibn 'Affaan ( عثمان بن عفان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5",
      "name": "Ali ibn Abi Talib ( علي بن أبي طالب بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "6",
      "name": "Talha ibn 'Ubaidullah ( طلحة بن عبيد الله ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "9",
      "name": "Sa'd ibn Abi Waqqas ( سعد بن أبي وقاص ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "25",
      "name": "'Ammar ibn Yasir ( عمار بن ياسر بن عامر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "28",
      "name": "'Amr bin al-'Aas ( عمرو بن العاص بن وائل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "871",
      "name": "Jubayr bin Mut'im ( جبير بن مطعم ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "182",
      "name": "Suhayb bin Sinan ar-Rumi ( صهيب بن سنان بن مالك الرومي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3229",
      "name": "Abu Bakra al-Thaqafi ( أبو بكرة الثقفي الطائفي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11063",
      "name": "Sa'd bin Ibrahim سعد بن إبراهيم بن عبد الرحمن",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11064",
      "name": "Salah bin Ibrahim صالح بن إبراهيم بن عبد الرحمن",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "2301",
      "source": " Sahih Bukhari ",
      "chapter": "Representation; Authorization; Business by Proxy - كتاب الوكالة",
      "chapter_no": "40",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، قال حدثني يوسف بن الماجشون، عن صالح بن إبراهيم بن عبد الرحمن بن عوف، عن أبيه، عن جده عبد الرحمن بن عوف  رضى الله عنه  قال كاتبت أمية بن خلف كتابا بأن يحفظني في صاغيتي بمكة، وأحفظه في صاغيته بالمدينة، فلما ذكرت الرحمن قال لا أعرف الرحمن، كاتبني باسمك الذي كان في الجاهلية‏.‏ فكاتبته عبد عمرو فلما كان في يوم بدر خرجت إلى جبل لأحرزه حين نام الناس فأبصره بلال فخرج حتى وقف على مجلس من الأنصار فقال أمية بن خلف، لا نجوت إن نجا أمية‏.‏ فخرج معه فريق من الأنصار في آثارنا، فلما خشيت أن يلحقونا خلفت لهم ابنه، لأشغلهم فقتلوه ثم أبوا حتى يتبعونا، وكان رجلا ثقيلا، فلما أدركونا قلت له ابرك‏.‏ فبرك، فألقيت عليه نفسي لأمنعه، فتخللوه بالسيوف من تحتي، حتى قتلوه، وأصاب أحدهم رجلي بسيفه، وكان عبد الرحمن بن عوف يرينا ذلك الأثر في ظهر قدمه‏.‏ قال أبو عبد الله سمع يوسف صالحا وإبراهيم أباه",
      "text_en": " Narrated `Abdur-Rahman bin `Auf:                     I got an agreement written between me and Umaiya bin Khalaf that Umaiya would look after my property (or family) in Mecca and I would look after his in Medina. When I mentioned the word 'Ar64 Rahman' in the documents, Umaiya said, \"I do not know 'Ar-Rahman.' Write down to me your name, (with which you called yourself) in the Pre-Islamic Period of Ignorance.\" So, I wrote my name ' `Abdu `Amr'. On the day (of the battle) of Badr, when all the people went to sleep, I went up the hill to protect him. Bilal(1) saw him (i.e. Umaiya) and went to a gathering of Ansar and said, \"(Here is) Umaiya bin Khalaf! Woe to me if he escapes!\" So, a group of Ansar went out with Bilal to follow us (`Abdur-Rahman and Umaiya). Being afraid that they would catch us, I left Umaiya's son for them to keep them busy but the Ansar killed the son and insisted on following us. Umaiya was a fat man, and when they approached us, I told him to kneel down, and he knelt, and I laid myself on him to protect him, but the Ansar killed him by passing their swords underneath me, and one of them injured my foot with his sword. (The sub narrator said, \" `Abdur-Rahman used to show us the trace of the wound on the back of his foot.\")",
      "chain": [
        "30105",
        "20027",
        "11064",
        "584",
        "8"
      ]
    },
    {
      "hadith_no": "3141",
      "source": " Sahih Bukhari ",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا مسدد، حدثنا يوسف بن الماجشون، عن صالح بن إبراهيم بن عبد الرحمن بن عوف، عن أبيه، عن جده، قال بينا أنا واقف، في الصف يوم بدر فنظرت عن يميني، وشمالي، فإذا أنا بغلامين، من الأنصار حديثة أسنانهما، تمنيت أن أكون بين أضلع منهما، فغمزني أحدهما فقال يا عم، هل تعرف أبا جهل قلت نعم، ما حاجتك إليه يا ابن أخي قال أخبرت أنه يسب رسول الله صلى الله عليه وسلم، والذي نفسي بيده لئن رأيته لا يفارق سوادي سواده حتى يموت الأعجل منا‏.‏ فتعجبت لذلك، فغمزني الآخر فقال لي مثلها، فلم أنشب أن نظرت إلى أبي جهل يجول في الناس، قلت ألا إن هذا صاحبكما الذي سألتماني‏.‏ فابتدراه بسيفيهما فضرباه حتى قتلاه، ثم انصرفا إلى رسول الله صلى الله عليه وسلم فأخبراه فقال ‏\"‏ أيكما قتله ‏\"‏‏.‏ قال كل واحد منهما أنا قتلته‏.‏ فقال ‏\"‏ هل مسحتما سيفيكما ‏\"‏‏.‏ قالا لا‏.‏ فنظر في السيفين فقال ‏\"‏ كلاكما قتله ‏\"‏‏.‏ سلبه لمعاذ بن عمرو بن الجموح‏.‏ وكانا معاذ ابن عفراء ومعاذ بن عمرو بن الجموح‏.‏ قال محمد سمع يوسف صالحا وإبراهيم أباه (عبد الرحمن بن عوف)",
      "text_en": " Narrated `Abdur-Rahman bin `Auf:                     While I was standing in the row on the day (of the battle) of Badr, I looked to my right and my left and saw two young Ansari boys, and I wished I had been stronger than they. One of them called my attention saying, \"O Uncle! Do you know Abu Jahl?\" I said, \"Yes, What do you want from him, O my nephew?\" He said, \"I have been informed that he abuses Allah's Apostle. By Him in Whose Hands my life is, if I should see him, then my body will not leave his body till either of us meet his fate.\" I was astonished at that talk. Then the other boy called my attention saying the same as the other had said. After a while I saw Abu Jahl walking amongst the people. I said (to the boys), \"Look! This is the man you asked me about.\" So, both of them attacked him with their swords and struck him to death and returned to Allah'S Apostle to inform him of that. Allah's Apostle asked, \"Which of you has killed him?\" Each of them said, \"I Have killed him.\" Allah's Apostle asked, \"Have you cleaned your swords?\" They said, \"No. \" He then looked at their swords and said, \"No doubt, you both have killed him and the spoils of the deceased will be given to Mu`adh bin `Amr bin Al-Jamuh.\" The two boys were Mu`adh bin 'Afra and Mu`adh bin `Amr bin Al-Jamuh.",
      "chain": [
        "30175",
        "20027",
        "11064",
        "584"
      ]
    },
    {
      "hadith_no": "3826",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا إسماعيل بن عبد الله، قال حدثني إبراهيم بن سعد، عن أبيه، عن جده، قال لما قدموا المدينة آخى رسول الله صلى الله عليه وسلم بين عبد الرحمن وسعد بن الربيع، قال لعبد الرحمن إني أكثر الأنصار مالا فأقسم مالي نصفين، ولي امرأتان، فانظر أعجبهما إليك فسمها لي أطلقها، فإذا انقضت عدتها فتزوجها‏.‏ قال بارك الله لك في أهلك ومالك، أين سوقكم فدلوه على سوق بني قينقاع، فما انقلب إلا ومعه فضل من أقط وسمن، ثم تابع الغدو، ثم جاء يوما وبه أثر صفرة فقال النبي صلى الله عليه وسلم ‏\"‏ مهيم ‏\"‏‏.‏ قال تزوجت‏.‏ قال ‏\"‏ كم سقت إليها ‏\"‏‏.‏ قال نواة من ذهب‏.‏ أو وزن نواة من ذهب، شك إبراهيم‏.‏",
      "text_en": " Narrated Sa`d's father:                     When the emigrants reached Medina. Allah's Apostle established the bond of fraternity between `Abdur-Rahman and Sa`d bin Ar-Rabi. Sa`d said to `Abdur-Rahman, \"I am the richest of all the Ansar, so I want to divide my property (between us), and I have two wives, so see which of the two you like and tell me, so that I may divorce her, and when she finishes her prescribed period (i.e. 'Idda) of divorce, then marry her.\" `Abdur-Rahman said, \"May Allah bless your family and property for you; where is your market?\" So they showed him the Qainuqa' market. (He went there and) returned with a profit in the form of dried yogurt and butter. He continued going (to the market) till one day he came, bearing the traces of yellow scent. The Prophet asked, \"What is this (scent)?\" He replied, \"I got married.\" The Prophet asked, \"How much Mahr did you give her?\" He replied, \"I gave her a datestone of gold or a gold piece equal to the weight of a date-stone.\" (The narrator, Ibrahim, is in doubt as to which is correct.)",
      "chain": [
        "30103",
        "20150",
        "11063",
        "584"
      ]
    },
    {
      "hadith_no": "4013",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا علي بن عبد الله، قال كتبت عن يوسف بن الماجشون، عن صالح بن إبراهيم، عن أبيه، عن جده، في بدر‏.‏ يعني حديث ابنى عفراء‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin `Auf:                     (the grandfather of Salih bin Ibrahim) the story of Badr, namely, the narration regarding the sons of 'Afra'.",
      "chain": [
        "30026",
        "20027",
        "11064",
        "584"
      ]
    },
    {
      "hadith_no": "4020",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، قال حدثني يوسف بن الماجشون، عن صالح بن إبراهيم بن عبد الرحمن بن عوف، عن أبيه، عن جده عبد الرحمن، قال كاتبت أمية بن خلف، فلما كان يوم بدر، فذكر قتله وقتل ابنه، فقال بلال لا نجوت إن نجا أمية‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin `Auf:                     \"I had an agreement with Umaiya bin Khalaf (that he would look after my relatives and property in Mecca, and I would look after his relatives and property in Medina).\" `Abdur-Rahman then mentioned the killing of Umaiya and his son on the day of Badr, and Bilal said, \"Woe to me if Umaiya remains safe (i.e. alive) . \"",
      "chain": [
        "30105",
        "20027",
        "11064",
        "584",
        "20033"
      ]
    },
    {
      "hadith_no": "5885",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا إسحاق بن إبراهيم الحنظلي، أخبرنا محمد بن بشر، حدثنا مسعر، عن سعد بن إبراهيم، عن أبيه، عن سعد، قال رأيت بشمال النبي صلى الله عليه وسلم وبيمينه رجلين عليهما ثياب بيض يوم أحد، ما رأيتهما قبل ولا بعد‏.‏",
      "text_en": " Narrated Sa`d:                     On the day of the battle of Uhud, on the right and on the left of the Prophet were two men wearing white clothes, and I had neither seen them before, nor did I see them afterwards.",
      "chain": [
        "30021",
        "20352",
        "20359",
        "11063",
        "584",
        "9"
      ]
    },
    {
      "hadith_no": "7212",
      "source": " Sahih Bukhari ",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا محمد بن بشر، حدثنا مسعر، حدثنا سعد بن إبراهيم، عن أبيه، عن أبي بكرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يدخل المدينة رعب المسيح، لها يومئذ سبعة أبواب، على كل باب ملكان ‏\"‏‏.‏",
      "text_en": "",
      "chain": [
        "30026",
        "20352",
        "20359",
        "11063",
        "584",
        "3229"
      ]
    },
    {
      "hadith_no": "7213",
      "source": " Sahih Bukhari ",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "قال وقال ابن إسحاق عن صالح بن إبراهيم، عن أبيه، قال قدمت البصرة فقال لي أبو بكرة سمعت النبي صلى الله عليه وسلم بهذا‏.‏",
      "text_en": "",
      "chain": [
        "11107",
        "11064",
        "584",
        "3229"
      ]
    },
    {
      "hadith_no": "4668",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا يحيى بن يحيى التميمي، أخبرنا يوسف بن الماجشون، عن صالح بن إبراهيم، بن عبد الرحمن بن عوف عن أبيه، عن عبد الرحمن بن عوف، أنه قال بينا أنا واقف، في الصف يوم بدر نظرت عن يميني، وشمالي، فإذا أنا بين، غلامين من الأنصار حديثة أسنانهما تمنيت لو كنت بين أضلع منهما فغمزني أحدهما ‏.‏ فقال يا عم هل تعرف أبا جهل قال قلت نعم وما حاجتك إليه يا ابن أخي قال أخبرت أنه يسب رسول الله صلى الله عليه وسلم والذي نفسي بيده لئن رأيته لا يفارق سوادي سواده حتى يموت الأعجل منا ‏.‏ قال فتعجبت لذلك فغمزني الآخر فقال مثلها - قال - فلم أنشب أن نظرت إلى أبي جهل يزول في الناس فقلت ألا تريان هذا صاحبكما الذي تسألان عنه قال فابتدراه فضرباه بسيفيهما حتى قتلاه ثم انصرفا إلى رسول الله صلى الله عليه وسلم فأخبراه ‏.‏ فقال ‏\"‏ أيكما قتله ‏\"‏ ‏.‏ فقال كل واحد منهما أنا قتلت ‏.‏ فقال ‏\"‏ هل مسحتما سيفيكما ‏\"‏ ‏.‏ قالا لا ‏.‏ فنظر في السيفين فقال ‏\"‏ كلاكما قتله ‏\"‏ ‏.‏ وقضى بسلبه لمعاذ بن عمرو بن الجموح والرجلان معاذ بن عمرو بن الجموح ومعاذ ابن عفراء ‏.‏",
      "text_en": " It has been narrated on the authority of 'Abd al-Rahman b. Auf who said:                      While I was standing in the battle array on the Day of Badr, I looked towards my right and my left, and found myself between two boys from the Ansar quite young in age. I wished I were between stronger persons. One of them made a sign to me and. said: Uncle, do you recognise Abu Jahl? 1 said: Yes. What do you want to do with him, O my nephew? He said: I have been told that he abuses the Messenger of Allah (may peace be upon him). By Allah, in Whose Hand is my life, if I see him (I will grapple with him) and will not leave him until one of us who is destined to die earlier is killed. The narrator said: I wondered at this. Then the other made a sign to me and said similar words. Soon after I saw Abu Jahl. He was moving about among men. I said to the two boys: Don't you see? He is the man you were inquiring about. (As soon as they heard this), they dashed towards him, struck him with their swords until he was killed. Then they returned to the Messenger of Allah (may peace be upon him) and informed him (to this effect). He asked: Which of you has killed him? Each one of them said: I have killed him. He said: Have you wiped your swords? They said: No. He examined their swords and said: Both of you have killed him. He then decided that the belongings of Abu Jahl he handed over to Mu'adh b. Amr b. al-Jamuh. And the two boys were Mu'adh b. Amr b. Jawth and Mu'adh b. Afra.",
      "chain": [
        "30399",
        "20027",
        "11064",
        "584",
        "8"
      ]
    },
    {
      "hadith_no": "5416",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، ومحمد بن حاتم، قالوا حدثنا ابن، مهدي عن سفيان، عن سعد بن إبراهيم، عن ابن كعب بن مالك، عن أبيه، قال رأيت النبي صلى الله عليه وسلم يلعق أصابعه الثلاث من الطعام ‏.‏ ولم يذكر ابن حاتم الثلاث ‏.‏ وقال ابن أبي شيبة في روايته عن عبد الرحمن بن كعب عن أبيه ‏.‏",
      "text_en": " Ibn Ka'b b. Malik reported on the authority of his father that he saw Allah's Messenger (may peace be upon him) licking his three fingers (after having finished the food). Ibn Hatim made no mention of\" three\". This hadith is also narrated through another chain of transmitters.",
      "chain": [
        "30201",
        "30022",
        "38487",
        "20033",
        "20005",
        "11063",
        "584"
      ]
    },
    {
      "hadith_no": "6144",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، وأبو أسامة عن مسعر، عن  سعد بن إبراهيم، عن أبيه، عن سعد، قال رأيت عن يمين، رسول الله صلى الله عليه وسلم وعن شماله يوم أحد رجلين عليهما ثياب بياض ما رأيتهما قبل ولا بعد ‏.‏ يعني جبريل وميكائيل عليهما السلام ‏.‏",
      "text_en": " Sa'd reported that on the Day of Ubud I saw on the right side of Allah's Messenger (may peace be upon him) and on his left side two persons dressed in white clothes and whom I did not see before nor after that, and they were Gabriel and Michael (Allah be pleased with both of them).",
      "chain": [
        "30201",
        "20352",
        "20318",
        "20359",
        "11063",
        "584",
        "9"
      ]
    },
    {
      "hadith_no": "6628",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن نمير، وأبو أسامة عن زكرياء، عن سعد بن إبراهيم، عن أبيه، عن جبير بن مطعم، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا حلف في الإسلام وأيما حلف كان في الجاهلية لم يزده الإسلام إلا شدة ‏\"‏ ‏.‏",
      "text_en": " Jubair b. Mut'im reported Allah's Messenger (may peace be upon him) as saying:                      There is no alliance (hilf) in Islam but (the hilf) established in the pre-Islamic days (for good). Islam intensifies and strengthens it.",
      "chain": [
        "30201",
        "20331",
        "20318",
        "11338",
        "11063",
        "584",
        "871"
      ]
    },
    {
      "hadith_no": "2925",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Shares of Inheritance (Kitab Al-Fara'id) - كتاب الفرائض",
      "chapter_no": "19",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا محمد بن بشر، وابن، نمير وأبو أسامة عن زكريا، عن سعد بن إبراهيم، عن أبيه، عن جبير بن مطعم، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا حلف في الإسلام وأيما حلف كان في الجاهلية لم يزده الإسلام إلا شدة ‏\"‏ ‏.‏",
      "text_en": " Narrated Jubair b. Mu'tim:                     The Messenger of Allah (ﷺ) as saying: There is no alliance in Islam, and Islam strengthened the alliance made during pre-Islamic days.",
      "chain": [
        "30203",
        "20352",
        "11338",
        "11063",
        "584",
        "871"
      ]
    },
    {
      "hadith_no": "1052",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن المصفى الحمصي، حدثنا أنس بن عياض، حدثنا محمد بن عمرو بن علقمة، عن إبراهيم بن عبد الرحمن بن عوف، عن أبيه، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن الله وملائكته يصلون على الصف الأول ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Ibrahim bin ‘Abdur-Rahman bin ‘Awf that hisfathersaid:                      “The Messenger of Allah (ﷺ) said: ‘Allah and the angelssend blessings upon the first row.’”",
      "chain": [
        "20157",
        "11220",
        "584",
        "8"
      ]
    },
    {
      "hadith_no": "2690",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا محمد بن عاصم بن جعفر المصري، حدثنا المفضل بن فضالة، عن يونس بن يزيد، عن ابن شهاب، عن إبراهيم بن عبد الرحمن بن عوف، عن أبيه، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ليس على المختلس قطع ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibrahim bin Abdur-Rahman bin Awf that his father said:                     “I heard the Messenger of Allah (ﷺ) say: 'The hand of the pilferer is not to be cut off”.",
      "chain": [
        "11222",
        "38520",
        "20378",
        "20475",
        "11013",
        "584",
        "8"
      ]
    }
  ],
  "total_hadiths": 15
}