{
  "id": "586",
  "name": "al-'Ala' bin al-Hadrami ( العلاء بن الحضرمي ( رضي الله عنه",
  "full_name": "al-'Ala' bin al-Hadrami ( العلاء بن الحضرمي ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Yemen"
    },
    "death": {
      "date_hijri": "14",
      "date_gregorian": "636",
      "date_display": null,
      "place": "Bahrain",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah",
      "Medinah",
      "Bahrain"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ ع  -  صحابي ]"
    ],
    "tags": [
      "Ally B. Shams",
      "Hadrami",
      "Early Muslim",
      "Messenger"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [
    {
      "id": "585",
      "name": "as-Sa'bah bint al-Hadrami ( الصعبة بنت الحضرمي ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "students": [
    {
      "id": "3048",
      "name": "al-Sa'ib bin Yazid bin Akht Namr ( السائب بن يزيد بن أخت النمر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "29306",
      "name": "Hyan al-A'rj حيان الأعرج",
      "grade": "Succ. (Taba' Tabi')"
    },
    {
      "id": "10772",
      "name": "S'hm bin Mnjab bin Rashid سهم بن منجاب بن راشد",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "18306",
      "name": "Ziyad bin Hdyr زياد بن حدير",
      "grade": "Follower(Tabi') [2nd Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "3981",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثني إبراهيم بن حمزة، حدثنا حاتم، عن عبد الرحمن بن حميد الزهري، قال سمعت عمر بن عبد العزيز، يسأل السائب ابن أخت النمر ما سمعت في، سكنى مكة قال سمعت العلاء بن الحضرمي، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ثلاث للمهاجر بعد الصدر ‏\"‏‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Humaid Az-Zuhri:                     I heard `Umar bin `Abdul-Aziz asking As-Sa'ib, the nephew of An-Nimr. \"What have you heard about residing in Mecca?\" The other said, \"I heard Al-Ala bin Al-Hadrami saying, Allah's Apostle said: An Emigrant is allowed to stay in Mecca for three days after departing from Mina (i.e. after performing all the ceremonies of Hajj)\"",
      "chain": [
        "30101",
        "20159",
        "586"
      ]
    },
    {
      "hadith_no": "3363",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا عبد الله بن مسلمة بن قعنب، حدثنا سليمان، - يعني ابن بلال - عن عبد الرحمن بن حميد، أنه سمع عمر بن عبد العزيز، يسأل السائب بن يزيد يقول هل سمعت في الإقامة، بمكة شيئا فقال السائب سمعت العلاء بن الحضرمي، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ للمهاجر إقامة ثلاث بعد الصدر بمكة ‏\"‏ ‏.‏ كأنه يقول لا يزيد عليها ‏.‏",
      "text_en": " Al-'Ali' b. al-Hadrami reported Allah's Messenger (may peace he upon as saying:                      For a Mahijir, it is only three (days') stay at Mecca, after completing (the Hajj or 'Umra) that is allowed, and it seemed as if he was saying that he should not (stay) beyond this (period).",
      "chain": [
        "20160",
        "11193",
        "586"
      ]
    },
    {
      "hadith_no": "3364",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا سفيان بن عيينة، عن عبد الرحمن بن حميد، قال سمعت عمر بن عبد العزيز، يقول لجلسائه ما سمعتم في، سكنى مكة فقال السائب بن يزيد سمعت العلاء، - أو قال العلاء بن الحضرمي - قال رسول الله صلى الله عليه وسلم ‏\"‏ يقيم المهاجر بمكة بعد قضاء نسكه ثلاثا ‏\"‏ ‏.‏",
      "text_en": " Al-'Ala' b. al-Hadrami reported Allah's Messenger (may peace be upon him) as saying:                      The Muhijir should stay at Mecca after performing the rituals (of Hajj) but for three (days) only.",
      "chain": [
        "30399",
        "20005",
        "11193",
        "11010",
        "586"
      ]
    },
    {
      "hadith_no": "3365",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا حسن الحلواني، وعبد بن حميد، جميعا عن يعقوب بن إبراهيم بن سعد، حدثنا أبي، عن صالح، عن عبد الرحمن بن حميد، أنه سمع عمر بن عبد العزيز، يسأل السائب بن يزيد فقال السائب سمعت العلاء بن الحضرمي، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ثلاث ليال يمكثهن المهاجر بمكة بعد الصدر ‏\"‏ ‏.‏",
      "text_en": " Al-'Ala' b. al-Hadrami reported Allah's Messenger (may peace be upon him) as saying:                      It is only for three nights that a Muhajir should stay at Mecca after the completion of the rituals of Hajj.",
      "chain": [
        "130115",
        "30553",
        "20184",
        "20150",
        "11176",
        "11193",
        "586"
      ]
    },
    {
      "hadith_no": "3366",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا إسحاق بن إبراهيم، أخبرنا عبد الرزاق، أخبرنا ابن جريج، وأملاه، علينا إملاء أخبرني إسماعيل بن محمد بن سعد، أن حميد بن عبد الرحمن بن عوف، أخبره أن السائب بن يزيد أخبره أن العلاء بن الحضرمي أخبره عن رسول الله صلى الله عليه وسلم قال ‏\"‏ مكث المهاجر بمكة بعد قضاء نسكه ثلاث ‏\"‏ ‏.‏",
      "text_en": " Al-\" Ala' b. al-Hadrami reported Allah's Messenger (may peace be upon him) as saying:                      The stay at Mecca after the completion of his rituals (of Hajj) is only for three days.",
      "chain": [
        "30123",
        "20121",
        "11070",
        "11500",
        "10561",
        "3048",
        "586"
      ]
    },
    {
      "hadith_no": "5134",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا هشيم، عن منصور، عن ابن سيرين، - قال أحمد قال مرة يعني هشيما - عن بعض ولد العلاء أن العلاء بن الحضرمي كان عامل النبي صلى الله عليه وسلم على البحرين فكان إذا كتب إليه بدأ بنفسه ‏.‏",
      "text_en": " Narrated al-Ala' ibn al-Hadrami:                     Some of the children of al-Ala' ibn al-Hadrami said: Al-Ala' ibn al-Hadrami was the governor of the Prophet (ﷺ) at al-Bahrayn, and when he wrote to him he began with his won name.",
      "chain": [
        "30007",
        "20468",
        "11067",
        "11035",
        "30007",
        "586"
      ]
    },
    {
      "hadith_no": "5135",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن عبد الرحيم، حدثنا المعلى بن منصور، أخبرنا هشيم، عن منصور، عن ابن سيرين، عن ابن العلاء، عن العلاء، - يعني ابن الحضرمي - أنه كتب إلى النبي صلى الله عليه وسلم فبدأ باسمه ‏.‏",
      "text_en": " Ibn al-Ala said :                      Al-Ala b. al-Hadrami wrote to the prophet (May peace be upon him), and he began with his name.",
      "chain": [
        "30272",
        "20468",
        "11067",
        "11035",
        "586"
      ]
    },
    {
      "hadith_no": "949",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا سفيان بن عيينة، عن عبد الرحمن بن حميد، سمع السائب بن يزيد، عن العلاء بن الحضرمي يعني مرفوعا، قال ‏\"‏ يمكث المهاجر بعد قضاء نسكه بمكة ثلاثا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح وقد روي من غير هذا الوجه بهذا الإسناد مرفوعا ‏.‏",
      "text_en": " Al-Ala bin Al-Hadrami narrated :                     (that the Prophet said): \"The Muhajir may stay for three (days) in Makkah after carrying out his rites.\"",
      "chain": [
        "30242",
        "20005",
        "11193",
        "3048",
        "586"
      ]
    },
    {
      "hadith_no": "1454",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Shortening the Prayer When Traveling - كتاب تقصير الصلاة فى السفر",
      "chapter_no": "15",
      "text_ar": "أخبرنا محمد بن عبد الملك بن زنجويه، عن عبد الرزاق، عن ابن جريج، قال أخبرني إسماعيل بن محمد بن سعد، أن حميد بن عبد الرحمن، أخبره أن السائب بن يزيد أخبره أنه، سمع العلاء بن الحضرمي، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ يمكث المهاجر بعد قضاء نسكه ثلاثا ‏\"‏ ‏.‏",
      "text_en": " Al-'Ala bin Al-Hadrami said:                     \"The Messenger of Allah (ﷺ) said: 'The Muhajir may stay for three days after completing his rituals.'\"",
      "chain": [
        "30586",
        "20121",
        "11070",
        "11500",
        "10561",
        "3048",
        "586"
      ]
    },
    {
      "hadith_no": "1455",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Shortening the Prayer When Traveling - كتاب تقصير الصلاة فى السفر",
      "chapter_no": "15",
      "text_ar": "أخبرنا أبو عبد الرحمن، قال الحارث بن مسكين قراءة عليه وأنا أسمع، في حديثه عن سفيان، عن عبد الرحمن بن حميد، عن السائب بن يزيد، عن العلاء بن الحضرمي، قال قال النبي صلى الله عليه وسلم ‏\"‏ يمكث المهاجر بمكة بعد نسكه ثلاثا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Al-'Ala bin Al-Hadrami said:                     \"The Prophet (ﷺ) said: 'The Muhajir may stay for three days after his rituals.'\"",
      "chain": [
        "36017",
        "20005",
        "11193",
        "3048",
        "586"
      ]
    },
    {
      "hadith_no": "1126",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا حاتم بن إسماعيل، عن عبد الرحمن بن حميد الزهري، قال سألت السائب بن يزيد ماذا سمعت في، سكنى مكة قال سمعت العلاء بن الحضرمي، يقول قال النبي  صلى الله عليه وسلم  ‏\"‏ ثلاثا للمهاجر بعد الصدر ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Abdur-Rahman bin Humaid Az-Zuhri said:                      “I askedSa’ib bin Yazid: ‘What have you heard about staying in Makkah?’Hesaid: ‘I heard ‘Ala’ bin Hadrami say: “The Prophet (ﷺ)said: ‘Three(days) for the Muhajir after departing (from Mina).’”*",
      "chain": [
        "30201",
        "20159",
        "3048",
        "586"
      ]
    },
    {
      "hadith_no": "1903",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters Regarding Zakat - كتاب الزكاة",
      "chapter_no": "8",
      "text_ar": "حدثنا الحسين بن جنيد الدامغاني، حدثنا عتاب بن زياد المروزي، حدثنا أبو حمزة، قال سمعت مغيرة الأزدي، يحدث عن محمد بن زيد، عن حيان الأعرج، عن العلاء بن الحضرمي، قال بعثني رسول الله  صلى الله عليه وسلم  إلى البحرين - أو إلى هجر - فكنت آتي الحائط يكون بين الإخوة يسلم أحدهم فآخذ من المسلم العشر ومن المشرك الخراج ‏.‏",
      "text_en": " It was narrated:                     that Ala bin Hadrami said: “The Messenger of Allah sent me to Bahrain or Hajar. I used to go to a garden that was shared by some brothers, one of whom had become Muslim. I would take the Ushr (one-tenth of the harvest) from the Muslim, and Kharaj from the Mushrik.”",
      "chain": [
        "38379",
        "20458",
        "11217",
        "29306",
        "586"
      ]
    }
  ],
  "total_hadiths": 12
}