{
  "id": "6",
  "name": "Talha ibn 'Ubaidullah ( طلحة بن عبيد الله ( رضي الله عنه",
  "full_name": "Talha ibn 'Ubaidullah ( طلحة بن عبيد الله ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "biography": {
    "birth": {
      "date_hijri": "28",
      "date_gregorian": "596",
      "date_display": [
        "28 BH",
        "596 CE"
      ],
      "place": "Makkah"
    },
    "death": {
      "date_hijri": "36",
      "date_gregorian": "656",
      "date_display": null,
      "place": "Medinah, Jamal",
      "reason": "Martyred"
    },
    "places_of_stay": [
      "Makkah",
      "Medinah"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ ع  -  صحابة ]",
      "Commander"
    ],
    "tags": [
      "Quraish",
      "B.Taym",
      "Early Muslim",
      "Emigrant",
      "Uhud",
      "Khandaq",
      "Promised Paradise"
    ]
  },
  "parents": [
    {
      "id": "585",
      "name": "as-Sa'bah bint al-Hadrami ( الصعبة بنت الحضرمي ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "spouses": [
    {
      "id": "72",
      "name": "Hamnah bint Jahsh ( حمنة بنت جحش الأسدية ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "580",
      "name": "Khawla bint al-Qa'Qa' ( خولة بنت القعقاع بن معبد ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "581",
      "name": "Umm Aban bint 'Utba b. Rabi'a ( أم أبان بنت عتبة بن ربيعة بنت عبد شمس ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "10500",
      "name": "Umm Khultum bint Abi Bakr أم كلثوم بنت أبي بكر الصديق",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "582",
      "name": "Suada bint 'Auf al-Murriya ( سعدى بنت عوف المرية ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "583",
      "name": "al-Jarba' bint Qasama al-Tayyi' ( الجرباء بنت قسامة بن قيس ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "siblings": [
    {
      "id": "2704",
      "name": "'Uthman bin 'Ubaidullah ( عثمان بن عبيد الله بن عثمان التيمي ( رضي الله عنه",
      "grade": "Comp.(RA)"
    }
  ],
  "children": [
    {
      "id": "577",
      "name": "Muhammad As-Sajjad ibn Talha ( محمد بن طلحة بن عبيد الله القرشي التيمي ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "578",
      "name": "'Imran ibn Talha ( عمران بن طلحة بن عبيد الله التيمي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "579",
      "name": "Musa ibn Talha ( موسى بن طلحة بن عبيد الله التيمى ( رضي الله عنه",
      "grade": "Comp.(RA) [2nd Generation]"
    },
    {
      "id": "10597",
      "name": "Ya'qub ibn Talha يعقوب بن طلحة بن عبيد الله التيمي",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "10598",
      "name": "Isma'il ibn Talha إسماعيل بن طلحة بن عبيد الله التيمي",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "10599",
      "name": "Ishaq ibn Talha إسحاق بن طلحة بن عبيد الله التيمي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10502",
      "name": "Zakariyya bin Talha زكريا بن طلحة بن عبيد الله",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "10503",
      "name": "Yusuf ibn Talha يوسف بن طلحة بن عبيد الله التيمى",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "10504",
      "name": "'Aisha bint Talha عائشة بنت طلحة بن عبيد الله التيمى",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10573",
      "name": "'Isa bin Talha bin 'Ubaidullah عيسى بن طلحة بن عبيد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10574",
      "name": "Yahya ibn Talha يحيى بن طلحة بن عبيد الله القرشي",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "2",
      "name": "Abu Bakr As-Siddique ( أبو بكر الصديق ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3",
      "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "577",
      "name": "Muhammad As-Sajjad ibn Talha ( محمد بن طلحة بن عبيد الله القرشي التيمي ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "578",
      "name": "'Imran ibn Talha ( عمران بن طلحة بن عبيد الله التيمي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "579",
      "name": "Musa ibn Talha ( موسى بن طلحة بن عبيد الله التيمى ( رضي الله عنه",
      "grade": "Comp.(RA) [2nd Generation]"
    },
    {
      "id": "10598",
      "name": "Isma'il ibn Talha إسماعيل بن طلحة بن عبيد الله التيمي",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "10573",
      "name": "'Isa bin Talha bin 'Ubaidullah عيسى بن طلحة بن عبيد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10574",
      "name": "Yahya ibn Talha يحيى بن طلحة بن عبيد الله القرشي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10504",
      "name": "'Aisha bint Talha عائشة بنت طلحة بن عبيد الله التيمى",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "34",
      "name": "Jabir ibn 'Abdullah ( جابر بن عبد الله بن عمرو السلمي الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "2705",
      "name": "'Abdur Rahman bin 'Uthman ( عبد الرحمن بن عثمان بن عبيد الله ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3048",
      "name": "al-Sa'ib bin Yazid bin Akht Namr ( السائب بن يزيد بن أخت النمر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "2711",
      "name": "Rabi'a bin 'Abdullah bin al-Hudayr ( ربيعة بن عبد الله بن الهدير ( رضي الله عنه",
      "grade": "Comp.(RA) [2nd Generation]"
    },
    {
      "id": "169",
      "name": "'Abdullah ibn Shaddad ( عبد الله بن شداد بن الهاد الليثي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "10567",
      "name": "Abu Salama bin 'Abdur Rahman أبو سلمة بن عبد الرحمن بن عوف",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11046",
      "name": "Qays bin Abi Hazim قيس بن أبي حازم",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "5030",
      "name": "Malik bin Aws bin al-Hadathan ( مالك بن أوس بن الحدثان النصري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11113",
      "name": "Abu 'Uthman al-Nahdi عبد الرحمن بن مل - أبو عثمان النهدي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11443",
      "name": "Malik bin Abi 'Amir مالك بن أبي عامر الأصبحي",
      "grade": "Follower(Tabi') [2nd Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "46",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك بن أنس، عن عمه أبي سهيل بن مالك، عن أبيه، أنه سمع طلحة بن عبيد الله، يقول جاء رجل إلى رسول الله صلى الله عليه وسلم من أهل نجد، ثائر الرأس، يسمع دوي صوته، ولا يفقه ما يقول حتى دنا، فإذا هو يسأل عن الإسلام فقال رسول الله  صلى الله عليه وسلم ‏\"‏ خمس صلوات في اليوم والليلة ‏\"‏‏.‏ فقال هل على غيرها قال ‏\"‏ لا، إلا أن تطوع ‏\"‏‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ وصيام رمضان ‏\"‏‏.‏ قال هل على غيره قال ‏\"‏ لا، إلا أن تطوع ‏\"‏‏.‏ قال وذكر له رسول الله صلى الله عليه وسلم الزكاة‏.‏ قال هل على غيرها قال ‏\"‏ لا، إلا أن تطوع ‏\"‏‏.‏ قال فأدبر الرجل وهو يقول والله لا أزيد على هذا ولا أنقص‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ أفلح إن صدق ‏\"‏‏.‏",
      "text_en": "      Narrated Talha bin 'Ubaidullah:                          A man from Najd with unkempt hair came to Allah's Apostle and we heard     his loud voice but could not understand what he was saying, till he      came near and then we came to know that he was asking about Islam.      Allah's Apostle said, \"You have to offer prayers perfectly five times      in a day and night (24 hours).\" The man asked, \"Is there any more      (praying)?\" Allah's Apostle replied, \"No, but if you want to offer the     Nawafil prayers (you can).\" Allah's Apostle further said to him: \"You      have to observe fasts during the month of Ramadan.\" The man asked,      \"Is there any more fasting?\" Allah's Apostle replied, \"No, but if you      want to observe the Nawafil fasts (you can.)\" Then Allah's Apostle      further said to him, \"You have to pay the Zakat (obligatory charity).\"     The man asked, \"Is there any thing other than the Zakat for me to      pay?\" Allah's Apostle replied, \"No, unless you want to give alms of      your own.\" And then that man retreated saying, \"By Allah! I will      neither do less nor more than this.\" Allah's Apostle said, \"If what he     said is true, then he will be successful (i.e. he will be granted      Paradise).\"",
      "chain": [
        "30103",
        "20001",
        "11445",
        "11443",
        "6"
      ]
    },
    {
      "hadith_no": "1891",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا إسماعيل بن جعفر، عن أبي سهيل، عن أبيه، عن طلحة بن عبيد الله، أن أعرابيا، جاء إلى رسول الله صلى الله عليه وسلم ثائر الرأس فقال يا رسول الله أخبرني ماذا فرض الله على من الصلاة فقال ‏\"‏ الصلوات الخمس، إلا أن تطوع شيئا ‏\"‏‏.‏ فقال أخبرني ما فرض الله على من الصيام فقال ‏\"‏ شهر رمضان، إلا أن تطوع شيئا ‏\"‏‏.‏ فقال أخبرني بما فرض الله على من الزكاة فقال فأخبره رسول الله صلى الله عليه وسلم شرائع الإسلام‏.‏ قال والذي أكرمك لا أتطوع شيئا، ولا أنقص مما فرض الله على شيئا‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أفلح إن صدق، أو دخل الجنة إن صدق ‏\"‏‏.‏",
      "text_en": " Narrated Talha bin 'Ubaidullah:                     A bedouin with unkempt hair came to Allah's Apostle and said, \"O Allah's Apostle! Inform me what Allah has made compulsory for me as regards the prayers.\" He replied: \"You have to offer perfectly the five compulsory prayers in a day and night (24 hours), unless you want to pray Nawafil.\" The bedouin further asked, \"Inform me what Allah has made compulsory for me as regards fasting.\" He replied, \"You have to fast during the whole month of Ramadan, unless you want to fast more as Nawafil.\" The bedouin further asked, \"Tell me how much Zakat Allah has enjoined on me.\" Thus, Allah's Apostle informed him about all the rules (i.e. fundamentals) of Islam. The bedouin then said, \"By Him Who has honored you, I will neither perform any Nawafil nor will I decrease what Allah has enjoined on me. Allah's Apostle said, \"If he is saying the truth, he will succeed (or he will be granted Paradise).",
      "chain": [
        "30367",
        "20155",
        "11445",
        "11443",
        "6"
      ]
    },
    {
      "hadith_no": "2678",
      "source": " Sahih Bukhari ",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا إسماعيل بن عبد الله، قال حدثني مالك، عن عمه أبي سهيل، عن أبيه، أنه سمع طلحة بن عبيد الله، يقول جاء رجل إلى رسول الله صلى الله عليه وسلم فإذا هو يسأله عن الإسلام، فقال رسول الله صلى الله عليه وسلم ‏\"‏ خمس صلوات في اليوم والليلة ‏\"‏‏.‏ فقال هل على غيرها قال ‏\"‏ لا، إلا أن تطوع ‏\"‏‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ وصيام رمضان ‏\"‏‏.‏ قال هل على غيره قال ‏\"‏ لا، إلا أن تطوع ‏\"‏‏.‏ قال وذكر له رسول الله صلى الله عليه وسلم الزكاة‏.‏ قال هل على غيرها قال ‏\"‏ لا، إلا أن تطوع ‏\"‏‏.‏ فأدبر الرجل وهو يقول والله لا أزيد على هذا ولا أنقص‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ أفلح إن صدق ‏\"‏‏.‏",
      "text_en": " Narrated Talha bin 'Ubaidullah:                     A man came to Allah's Apostle asking him about Islam, Allah's Apostle said, \"You have to offer five compulsory prayers in a day and a night (24 hours).\" The man asked, \"Is there any more compulsory prayers for me?\" Allah's Apostle said, \"No, unless you like to offer Nawafil (i.e. optional prayers).\" Allah's Apostle then added, \"You have to observe fasts during the month of Ramadan.\" The man said, \"Am I to fast any other days?' Allah's Apostle said, \"No, unless you wish to observe the optional fast voluntarily.\" Then Allah's Apostle told him about the compulsory Zakat. The man asked, \"Do I have to give anything besides?\" Allah's Apostle said, \"No, unless you wish to give in charity voluntarily.\" So, the man departed saying, \"By Allah I will neither do more nor less than that.\" Allah's Apostle said, \"If he has said the truth he will be successful.\"",
      "chain": [
        "30103",
        "20001",
        "11445",
        "11443",
        "6"
      ]
    },
    {
      "hadith_no": "7042",
      "source": " Sahih Bukhari ",
      "chapter": "Tricks - كتاب الحيل",
      "chapter_no": "91",
      "text_ar": "حدثنا قتيبة، حدثنا إسماعيل بن جعفر، عن أبي سهيل، عن أبيه، عن طلحة بن عبيد الله، أن أعرابيا، جاء إلى رسول الله صلى الله عليه وسلم ثائر الرأس فقال يا رسول الله أخبرني ماذا فرض الله على من الصلاة فقال ‏\"‏ الصلوات الخمس، إلا أن تطوع شيئا ‏\"‏‏.‏ فقال أخبرني بما فرض الله على من الصيام قال ‏\"‏ شهر رمضان، إلا أن تطوع شيئا ‏\"‏‏.‏ قال أخبرني بما فرض الله على من الزكاة قال فأخبره رسول الله صلى الله عليه وسلم شرائع الإسلام‏.‏ قال والذي أكرمك لا أتطوع شيئا ولا أنقص مما فرض الله على شيئا‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أفلح إن صدق ‏\"‏‏.‏ أو ‏\"‏ دخل الجنة إن صدق ‏\"‏‏.‏ وقال بعض الناس في عشرين ومائة بعير حقتان‏.‏ فإن أهلكها متعمدا، أو وهبها أو احتال فيها فرارا من الزكاة، فلا شىء عليه‏.‏",
      "text_en": " Narrated Talha bin 'Ubaidullah:                     A bedouin with unkempt hair came to Allah's Apostle and said, \"O Allah's Apostle! Tell me what Allah has enjoined on me as regards prayers.\" The Prophet said, \"You have to offer perfectly the five (compulsory) prayers in a day and a night (24 hrs.), except if you want to perform some extra optional prayers.\" The bedouin said, \"Tell me what Allah has enjoined on me as regards fasting.\" The Prophet said, \"You have to observe fast during the month of Ramadan except if you fast some extra optional fast.\" The bedouin said, \"Tell me what Allah has enjoined on me as regard Zakat.\" The Prophet then told him the Islamic laws and regulations whereupon the bedouin said, \"By Him Who has honored you, I will not perform any optional deeds of worship and I will not leave anything of what Allah has enjoined on me.\" Allah's Apostle said, \"He will be successful if he has told the truth (or he will enter Paradise if he said the truth).\" And some people said, \"The Zakat for one-hundred and twenty camels is two Hiqqas, and if the Zakat payer slaughters the camels intentionally or gives them as a present or plays some other trick in order to avoid the Zakat, then there is no harm (in it) for him.",
      "chain": [
        "30367",
        "20155",
        "11445",
        "11443",
        "6"
      ]
    },
    {
      "hadith_no": "109",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة بن سعيد بن جميل بن طريف بن عبد الله الثقفي، عن مالك بن أنس، - فيما قرئ عليه - عن أبي سهيل، عن أبيه، أنه سمع طلحة بن عبيد الله، يقول جاء رجل إلى رسول الله صلى الله عليه وسلم من أهل نجد ثائر الرأس نسمع دوي صوته ولا نفقه ما يقول حتى دنا من رسول الله صلى الله عليه وسلم فإذا هو يسأل عن الإسلام فقال رسول الله صلى الله عليه وسلم ‏\"‏ خمس صلوات في اليوم والليلة ‏\"‏ ‏.‏ فقال هل على غيرهن قال ‏\"‏ لا ‏.‏ إلا أن تطوع وصيام شهر رمضان ‏\"‏ ‏.‏ فقال هل على غيره فقال ‏\"‏ لا ‏.‏ إلا أن تطوع ‏\"‏ ‏.‏ وذكر له رسول الله صلى الله عليه وسلم الزكاة فقال هل على غيرها قال ‏\"‏ لا ‏.‏ إلا أن تطوع ‏\"‏ قال فأدبر الرجل وهو يقول والله لا أزيد على هذا ولا أنقص منه ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أفلح إن صدق ‏\"‏ ‏.‏",
      "text_en": " It is reported on the authority of Talha b. 'Ubaidullah that a person with dishevelled hair, one of the people of Nejd, came to the Messenger of Allah (may peace be upon him). We heard the humming of his voice but could not fully discern what he had been saying, till he came nigh to the Messenger of Allah (may peace be upon him). It was then (disclosed to us) that he was asking questions pertaining to Islam. The Messenger of Allah (may peace be upon him) said:                      Five prayers during the day and the night. (Upon this he said: Am I obliged to say any other (prayer) besides these? He (the Holy Prophet, ) said: No, but whatever you observe voluntarily, out of your own free will, and the fasts of Ramadan. The inquirer said: Am I obliged to do anything else besides this? He (the Holy Prophet) said: No, but whatever you do out of your own free will. And the Messenger of Allah told him about the Zakat (poor-rate). The inquirer said: Am I obliged to pay anything else besides this? He (the Holy Prophet) said: No, but whatever you pay voluntarily out of your own free will. The man turned back and was saying: I would neither make any addition to this, nor will decrease anything out of it. The Prophet remarked: He is successful, if he is true to what he affirms.",
      "chain": [
        "30367",
        "20001",
        "11445",
        "11443",
        "6"
      ]
    },
    {
      "hadith_no": "110",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثني يحيى بن أيوب، وقتيبة بن سعيد، جميعا عن إسماعيل بن جعفر، عن أبي سهيل، عن أبيه، عن طلحة بن عبيد الله، عن النبي صلى الله عليه وسلم بهذا الحديث نحو حديث مالك غير أنه قال فقال رسول الله صلى الله عليه وسلم ‏\"‏ أفلح وأبيه إن صدق ‏\"‏ ‏.‏ أو ‏\"‏ دخل الجنة وأبيه إن صدق ‏\"‏ ‏.‏",
      "text_en": " Another hadith, the like of which has been narrated by Malik (b. Anas) (and mentioned above) is also reported by Talha b. 'Ubaidullah, with the only variation that the Holy Prophet remarked:                      By his father, he shall succeed if he were true (to what he professed), or: By his father, he would enter heaven if he were true (to what he professed).",
      "chain": [
        "20379",
        "30367",
        "20155",
        "11445",
        "11443",
        "6"
      ]
    },
    {
      "hadith_no": "499",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا يحيى بن يحيى، وقتيبة بن سعيد، وأبو بكر بن أبي شيبة قال يحيى أخبرنا وقال الآخران، حدثنا أبو الأحوص، عن سماك، عن موسى بن طلحة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا وضع أحدكم بين يديه مثل مؤخرة الرحل فليصل ولا يبال من مر وراء ذلك ‏\"‏ ‏.‏",
      "text_en": " Musa b. Talha reported it on the authority of his father:                      The Messenger of Allah (may peace be upon him) said: When one of you places in front of him so me. thing such as the back of a saddle, he should pray without caring who passes on the other side of it.",
      "chain": [
        "30399",
        "30367",
        "30201",
        "20031",
        "20327",
        "10770",
        "579",
        "6"
      ]
    },
    {
      "hadith_no": "499",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "وحدثنا محمد بن عبد الله بن نمير، وإسحاق بن إبراهيم، قال إسحاق أخبرنا وقال ابن نمير، حدثنا عمر بن عبيد الطنافسي، عن سماك بن حرب، عن موسى بن طلحة، عن أبيه، قال كنا نصلي والدواب تمر بين أيدينا فذكرنا ذلك لرسول الله صلى الله عليه وسلم فقال ‏\"‏ مثل مؤخرة الرحل تكون بين يدى أحدكم ثم لا يضره ما مر بين يديه ‏\"‏ ‏.‏ وقال ابن نمير ‏\"‏ فلا يضره من مر بين يديه ‏\"‏ ‏.‏",
      "text_en": " Musa b. Talha reported on the authority of his father:                      We used to say prayer and the animals moved in front of us. We mentioned it to the Messenger of Allah (may peace be upon him) and he said: If anything equal to the back of a saddle is in front of you, then what walks in front, no harm would come to him. Ibn Numair said: No harm would come whosoever walks in front.",
      "chain": [
        "30212",
        "30123",
        "30312",
        "30212",
        "20346",
        "10770",
        "579",
        "6"
      ]
    },
    {
      "hadith_no": "6275",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا قتيبة بن سعيد الثقفي، وأبو كامل الجحدري - وتقاربا في اللفظ وهذا حديث قتيبة - قالا حدثنا أبو عوانة عن سماك عن موسى بن طلحة عن أبيه قال مررت مع رسول الله صلى الله عليه وسلم بقوم على رءوس النخل فقال ‏\"‏ ما يصنع هؤلاء ‏\"‏ ‏.‏ فقالوا يلقحونه يجعلون الذكر في الأنثى فيلقح ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ ما أظن يغني ذلك شيئا ‏\"‏ ‏.‏ قال فأخبروا بذلك فتركوه فأخبر رسول الله صلى الله عليه وسلم بذلك فقال ‏\"‏ إن كان ينفعهم ذلك فليصنعوه فإني إنما ظننت ظنا فلا تؤاخذوني بالظن ولكن إذا حدثتكم عن الله شيئا فخذوا به فإني لن أكذب على الله عز وجل ‏\"‏ ‏.‏",
      "text_en": " Musa b. Talha reported:                      I and Allah's Messenger (may peace be upon him) happened to pass by people near the date-palm trees. He (the Holy Prophet) said: What are these people doing? They said: They are grafting, i. e. they combine the male with the female (tree) and thus they yield more fruit. Thereupon Allah's Messenger (may peace be upon him) said: I do not find it to be of any use. The people were informed about it and they abandoned this practice. Allah's Messenger (may peace be upon him) (was later) on informed (that the yield had dwindled), whereupon he said: If there is any use of it, then they should do it, for it was just a personal opinion of mine, and do not go after my personal opinion; but when I say to you anything on behalf of Allah, then do accept it, for I do not attribute lie to Allah, the Exalted and Glorious.",
      "chain": [
        "30367",
        "30559",
        "20469",
        "10770",
        "579",
        "6"
      ]
    },
    {
      "hadith_no": "391",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن عمه أبي سهيل بن مالك، عن أبيه، أنه سمع طلحة بن عبيد الله، يقول جاء رجل إلى رسول الله صلى الله عليه وسلم من أهل نجد ثائر الرأس يسمع دوي صوته ولا يفقه ما يقول حتى دنا فإذا هو يسأل عن الإسلام فقال رسول الله صلى الله عليه وسلم ‏\"‏ خمس صلوات في اليوم والليلة ‏\"‏ ‏.‏ قال هل على غيرهن قال ‏\"‏ لا إلا أن تطوع ‏\"‏ ‏.‏ قال وذكر له رسول الله صلى الله عليه وسلم صيام شهر رمضان قال هل على غيره قال ‏\"‏ لا إلا أن تطوع ‏\"‏ ‏.‏ قال وذكر له رسول الله صلى الله عليه وسلم الصدقة ‏.‏ قال فهل على غيرها قال ‏\"‏ لا إلا أن تطوع ‏\"‏ ‏.‏ فأدبر الرجل وهو يقول والله لا أزيد على هذا ولا أنقص ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أفلح إن صدق ‏\"‏ ‏.‏",
      "text_en": " Talhah b. 'Ubaid Allah said:                      A man from among the people of Najd with disheveled hair came to the Messenger of Allah (ﷺ). The humming sound of his voice could be heard but what he was suing could not be understood he came near and it was then known that he was asking about Islam. The Messenger of Allah (ﷺ) said: Five times of prayer each day and night: He asked: Must I observe any more than them ? He replied: No, unless you do it voluntarily. He (Talhah) said that the Messenger of Allah (ﷺ) mentioned fasting during the month of Ramadan. He asked: Must I observe anything else ? He replied: No, unless you do it voluntarily. The Messenger of Allah (ﷺ) mentioned Zakat to him. He asked: Must I pay anything else ? He replied: No, unless you do it voluntarily. The man then turned away saying: I swear any Allah, I shall not add anything to this or fall short of it. The Messenger of Allah (ﷺ) said: The man will be successful if he speaks truth.",
      "chain": [
        "20164",
        "20001",
        "11445",
        "11443",
        "6"
      ]
    },
    {
      "hadith_no": "2043",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا حامد بن يحيى، حدثنا محمد بن معن المديني، أخبرني داود بن خالد، عن ربيعة بن أبي عبد الرحمن، عن ربيعة، - يعني ابن الهدير - قال ما سمعت طلحة بن عبيد الله، يحدث عن رسول الله صلى الله عليه وسلم حديثا قط غير حديث واحد ‏.‏ قال قلت وما هو قال خرجنا مع رسول الله صلى الله عليه وسلم يريد قبور الشهداء حتى إذا أشرفنا على حرة واقم فلما تدلينا منها وإذا قبور بمحنية قال قلنا يا رسول الله أقبور إخواننا هذه قال ‏\"‏ قبور أصحابنا ‏\"‏ ‏.‏ فلما جئنا قبور الشهداء قال ‏\"‏ هذه قبور إخواننا ‏\"‏ ‏.‏",
      "text_en": " Narrated Rabi'ah ibn al-Hudayr:                     Rabi'ah ibn al-Hudayr said: I did not hear Talhah ibn Ubaydullah narrating any tradition from the Messenger of Allah (ﷺ) except one tradition. I (Rabi'ah ibn AbuAbdurRahman) asked: What is that? He said: We went out along with the Messenger of Allah (ﷺ) who was going to visit the graves of the martyrs. When we ascended Harrah Waqim, and then descended from it, we found there some graves at the turning of the valley. We asked: Messenger of Allah, are these the graves of our brethren? He replied: Graves of our companions. When we came to the graves of martyrs, he said: These are the graves of our brethren.",
      "chain": [
        "20180",
        "11162",
        "12180",
        "6"
      ]
    },
    {
      "hadith_no": "335",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة، وهناد، قالا حدثنا أبو الأحوص، عن سماك بن حرب، عن موسى بن طلحة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا وضع أحدكم بين يديه مثل مؤخرة الرحل فليصل ولا يبالي من مر وراء ذلك ‏\"‏ ‏.‏ قال وفي الباب عن أبي هريرة وسهل بن أبي حثمة وابن عمر وسبرة بن معبد الجهني وأبي جحيفة وعائشة ‏.‏ قال أبو عيسى حديث طلحة حديث حسن صحيح ‏.‏ والعمل على هذا عند أهل العلم وقالوا سترة الإمام سترة لمن خلفه ‏.‏",
      "text_en": " Muba bin Talhah narrated from his father (Talhah) that :                     Allah's Messenger said: \"When one of you placed something like the post (handle) of the camel saddle in front of him, then let him perform Salat and not concern himself with who passes beyond that.\"",
      "chain": [
        "30367",
        "30480",
        "20327",
        "10770",
        "579",
        "6"
      ]
    },
    {
      "hadith_no": "3451",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عامر العقدي، حدثنا سليمان بن سفيان المدني، حدثني بلال بن يحيى بن طلحة بن عبيد الله، عن أبيه، عن جده، طلحة بن عبيد الله أن النبي صلى الله عليه وسلم كان إذا رأى الهلال قال ‏\"‏ اللهم أهلله علينا باليمن والإيمان والسلامة والإسلام ربي وربك الله ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Bilal bin Yahya bin Talhah bin Ubaidullah narrated :                     from his father, from his grandfather Talhah bin Ubaidullah that when the Prophet would see a crescent moon, he would say: “O Allah, bring it over us with blessing and faith, and security and Islam. My Lord and your Lord is Allah (Allahumma Ahlilhu Alaina Bil-Wal-Islam, Rabbi Wa Rabuk Allah).”",
      "chain": [
        "30160",
        "20443",
        "22032",
        "6"
      ]
    },
    {
      "hadith_no": "4063",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا أبو هشام الرفاعي، حدثنا يحيى بن اليمان، عن شيخ، من بني زهرة عن الحارث بن عبد الرحمن بن أبي ذباب، عن طلحة بن عبيد الله، قال قال النبي صلى الله عليه وسلم ‏\"‏ لكل نبي رفيق ورفيقي - يعني في الجنة عثمان ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب ليس إسناده بالقوي وهو منقطع ‏.‏",
      "text_en": " Narrated Talhah bin 'Ubaidullah:                     that the Messenger of Allah (ﷺ) said: \"For every Prophet there is a friend (Rafiq), and my friend\" - meaning in Paradise - \"is 'Uthman.\"",
      "chain": [
        "30478",
        "11834",
        "6"
      ]
    },
    {
      "hadith_no": "4216",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا إسحاق بن منصور، أخبرنا أبو أسامة، عن نافع بن عمر الجمحي، عن ابن أبي مليكة، قال قال طلحة بن عبيد الله سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن عمرو بن العاصي من صالحي قريش ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث إنما نعرفه من حديث نافع بن عمر الجمحي ‏.‏ ونافع ثقة وليس إسناده بمتصل وابن أبي مليكة لم يدرك طلحة ‏.‏",
      "text_en": " Narrated Talhah bin 'Ubaidullah:                     \"I heard the Messenger of Allah (ﷺ) saying: 'Indeed, 'Amr bin Al-'As is from among the righteous of the Quraish.'\"",
      "chain": [
        "30313",
        "20318",
        "20203",
        "11090",
        "6"
      ]
    },
    {
      "hadith_no": "458",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Salah - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "أخبرنا قتيبة، عن مالك بن أنس، عن أبي سهيل، عن أبيه، أنه سمع طلحة بن عبيد الله، يقول جاء رجل إلى رسول الله صلى الله عليه وسلم من أهل نجد ثائر الرأس نسمع دوي صوته ولا نفهم ما يقول حتى دنا فإذا هو يسأل عن الإسلام فقال له رسول الله صلى الله عليه وسلم ‏\"‏ خمس صلوات في اليوم والليلة ‏\"‏ ‏.‏ قال هل على غيرهن قال ‏\"‏ لا إلا أن تطوع ‏\"‏ ‏.‏ قال ‏\"‏ وصيام شهر رمضان ‏\"‏ ‏.‏ قال هل على غيره قال ‏\"‏ لا إلا أن تطوع ‏\"‏ ‏.‏ وذكر له رسول الله صلى الله عليه وسلم الزكاة قال هل على غيرها قال ‏\"‏ لا إلا أن تطوع ‏\"‏ ‏.‏ فأدبر الرجل وهو يقول والله لا أزيد على هذا ولا أنقص منه ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ أفلح إن صدق ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Suhail, from his fatehr, that he heard Talhah bin 'Ubaidullah say:                      \"A man from the people of Najd came to the Messenger of Allah (ﷺ) with unkempt hair. We could hear him talking loudly but we could not understand what he was saying until he came closer. He was asking about Islam. The Messenger of Allah (ﷺ) said to him: 'Five prayers each day and night.' He said: 'Do I have to do anything else' He said: 'No, unless you do it voluntarily.' He said: 'And fasting the month of Ramadan.' He said: 'Do I have to do anything else?' He said: 'No, unless you do it voluntarily.' And the Messenger of Allah (ﷺ) mentioned Zakah to him, and he said: 'Do I have to do anything else?' He said: 'No, unless you do it voluntarily.' The man left saying: 'By Allah, I will not do any more than this or any less.' The Messenger of Allah (ﷺ) said: 'He will achieve salvation, if he is speaking the truth.'\"",
      "chain": [
        "30367",
        "20001",
        "11445",
        "11443",
        "6"
      ]
    },
    {
      "hadith_no": "1290",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا محمد بن بشر، قال حدثنا مجمع بن يحيى، عن عثمان بن موهب، عن موسى بن طلحة، عن أبيه، قال قلنا يا رسول الله كيف الصلاة عليك قال ‏\"‏ قولوا اللهم صل على محمد وعلى آل محمد كما صليت على إبراهيم وآل إبراهيم إنك حميد مجيد وبارك على محمد وعلى آل محمد كما باركت على إبراهيم وآل إبراهيم إنك حميد مجيد ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Musa bin Talha that:                     His father said: \"We said: 'O Messenger of Allah, how should we send salah upon you?' He said: 'Say: Alahumma salli 'ala Muhammad wa 'ala ali Muhammad, kama sallaita 'ala Ibrahima wa barik 'ala Muhammad kama barakta 'ala ali Ibrahim fil-'alamin, innaka hamidun majid (O Allah, send salah upon Muhammad and upon the family of Muhammad, as You sent salah upon the family of Ibrahim, and send blessings upon Muhammad and upon the family of Muhammad as You sent blessings upon the family of Ibrahim among the nations. You are indeed Worthy of praise, Full of glory.)'\"",
      "chain": [
        "30123",
        "20352",
        "10821",
        "18716",
        "579",
        "6"
      ]
    },
    {
      "hadith_no": "1291",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا عبيد الله بن سعد بن إبراهيم بن سعد، قال حدثنا عمي، قال حدثنا شريك، عن عثمان بن موهب، عن موسى بن طلحة، عن أبيه، أن رجلا، أتى نبي الله صلى الله عليه وسلم فقال كيف نصلي عليك يا نبي الله قال ‏\"‏ قولوا اللهم صل على محمد وعلى آل محمد كما صليت على إبراهيم إنك حميد مجيد وبارك على محمد وعلى آل محمد كما باركت على إبراهيم إنك حميد مجيد ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Musa bin Talha, from his father, that:                     A man came to the Prophet of Allah (ﷺ) and said: \"How should we send blessings upon you, O Prophet of Allah?' He said: 'Say: Alahumma salli 'ala Muhammad wa 'ala ali Muhammad, kama sallaita 'ala Ibrahima wa barik 'ala Muhammad kama barakta 'ala ali Ibrahim fil-'alamin, innaka hamidun majid (O Allah, send salah upon Muhammad and upon the family of Muhammad, as You sent salah upon the family of Ibrahim, and send blessings upon Muhammad and upon the family of Muhammad as You sent blessings upon the family of Ibrahim among the nations. You are indeed Worthy of praise, Full of glory.)'\"",
      "chain": [
        "20587",
        "18716",
        "579",
        "6"
      ]
    },
    {
      "hadith_no": "2090",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا علي بن حجر، قال حدثنا إسماعيل، - وهو ابن جعفر - قال حدثنا أبو سهيل، عن أبيه، عن طلحة بن عبيد الله، أن أعرابيا، جاء إلى رسول الله صلى الله عليه وسلم ثائر الرأس فقال يا رسول الله أخبرني ماذا فرض الله على من الصلاة قال ‏\"‏ الصلوات الخمس إلا أن تطوع شيئا ‏\"‏ ‏.‏ قال أخبرني بما افترض الله على من الصيام قال ‏\"‏ صيام شهر رمضان إلا أن تطوع شيئا ‏\"‏ ‏.‏ قال أخبرني بما افترض الله على من الزكاة فأخبره رسول الله صلى الله عليه وسلم بشرائع الإسلام ‏.‏ فقال والذي أكرمك لا أتطوع شيئا ولا أنقص مما فرض الله على شيئا ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أفلح إن صدق ‏\"‏ ‏.‏ أو ‏\"‏ دخل الجنة إن صدق ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Talhah bin 'Ubaidullah that:                     a Bedouin came to the Messenger of Allah with unkempt hair and said: \"O Allah has enjoined upon me of Salah.\" He said: \"The five daily prayers, unless you do any more voluntarily.\" He said: \"Tell me what Allah has enjoined upon me voluntarily.\" He said: \"Tell me what Allah has enjoined upon me of fasting.\" He said: \"Fasting the month of Ramadan, unless you do any more voluntarily.\" He said: \"Tell me what Allah has enjoined upon me of Zakah.\" The Messenger of Allah told him of the laws of Islam, He said: \"By the One Who has honored you, I will not do anything voluntarily, and I will not do anything voluntarily, and I will not do less than that which Allah has enjoined upon, me: The Messenger of Allah said: \"He will succeed if he is sincere,\" or \"He will enter Paradise if he is sincere.\"",
      "chain": [
        "20387",
        "20155",
        "29225",
        "6"
      ]
    },
    {
      "hadith_no": "5028",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book Of Faith and its Signs - كتاب الإيمان وشرائعه",
      "chapter_no": "47",
      "text_ar": "أخبرنا محمد بن سلمة قال حدثنا ابن القاسم عن مالك قال حدثني أبو سهيل عن أبيه أنه سمع طلحة بن عبيد الله يقول جاء رجل إلى رسول الله صلى الله عليه وسلم من أهل نجد ثائر الرأس يسمع دوي صوته ولا يفهم ما يقول حتى دنا فإذا هو يسأل عن الإسلام قال له رسول الله صلى الله عليه وسلم خمس صلوات في اليوم والليلة قال هل علي غيرهن قال لا إلا أن تطوع قال رسول الله صلى الله عليه وسلم وصيام شهر رمضان قال هل علي غيره قال لا إلا أن تطوع وذكر له رسول الله صلى الله عليه وسلم الزكاة فقال هل علي غيرها قال لا إلا أن تطوع فأدبر الرجل وهو يقول لا أزيد على هذا ولا أنقص منه فقال رسول الله صلى الله عليه وسلم أفلح إن صدق",
      "text_en": " Abu Suhail narrated from his father,:                     That he heard Talhah bin 'Ubaidullah say: \"A man from Najd with unkempt hair came to the Messenger of Allah [SAW]; he was speaking loudly but his speech could not be understood until he came close. He was asking about Islam. The Messenger of Allah [SAW] said: 'Five prayers every day and night.' He said: 'Do I have to do any more than that? He said: 'No, not unless you do it voluntarily.' The Messenger of Allah [SAW] said: 'Fasting the month of Ramadan.' He said: 'Do I have to do any more than that?' He said: 'No, not unless you do it voluntarily.' Then the Messenger of Allah [SAW] told him about Zakah. He said: 'Do I have to do any more than that?' He said: 'No, not unless you do it voluntarily.' The man left saying, 'I will not do any more than that or any less.' The Messenger of Allah [SAW] said: 'He will succeed, if he is telling the truth.'\"",
      "chain": [
        "20672",
        "30234",
        "20001",
        "25510",
        "6"
      ]
    },
    {
      "hadith_no": "993",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا عمر بن عبيد، عن سماك بن حرب، عن موسى بن طلحة، عن أبيه، قال كنا نصلي والدواب تمر بين أيدينا فذكر ذلك لرسول الله  صلى الله عليه وسلم  فقال ‏\"‏ مثل مؤخرة الرحل تكون بين يدى أحدكم فلا يضره من مر بين يديه ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Musa bin Talhah that his father said:                      “We usedtoperform prayer while the beasts were passing in front of us. Thatwasmentioned to the Messenger of Allah (ﷺ) and he said: ‘Ifsomething like the hand of a saddle* is placed in front of anyone ofyou, it will not matter whoever passes in front of him.”",
      "chain": [
        "30212",
        "10770",
        "579",
        "6"
      ]
    },
    {
      "hadith_no": "2564",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Pawning - كتاب الرهون",
      "chapter_no": "16",
      "text_ar": "حدثنا علي بن محمد، حدثنا عبيد الله بن موسى، عن إسرائيل، عن سماك، أنه سمع موسى بن طلحة بن عبيد الله، يحدث عن أبيه، قال مررت مع رسول الله صلى الله عليه وسلم في نخل فرأى قوما يلقحون النخل فقال ‏\"‏ ما يصنع هؤلاء ‏\"‏ ‏.‏ قالوا يأخذون من الذكر فيجعلونه في الأنثى ‏.‏ قال ‏\"‏ ما أظن ذاك يغني شيئا ‏\"‏ ‏.‏ فبلغهم فتركوه ونزلوا عنها فبلغ النبي صلى الله عليه وسلم فقال ‏\"‏ إنما هو ظن إن كان يغني شيئا فاصنعوه فإنما أنا بشر مثلكم وإن الظن يخطئ ويصيب ولكن ما قلت لكم قال الله فلن أكذب على الله ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Simak that the heard Musa bin Talhah bin `Ubaidullah narrating that his father said:                     “I passed by some palm trees with the Messenger of Allah (ﷺ) and he saw some people  pollinating the trees. He said: 'What are these people doing?' They said: 'They are taking something from the male part (of the plant) and putting it in the female part.' He said: 'I do not think that this will do any good.' News of that reached them, so they stopped doing it, and their yield declined. News of that reached the Prophet (ﷺ) and he said: 'That was only my thought. If it will do any good, then do it. I am only a human being like you, and what I think may be right or wrong. But When I tell you: “Allah (SWT) says,” I will never tell lies about Allah (SWT).' ”",
      "chain": [
        "38409",
        "20340",
        "20311",
        "10770",
        "579",
        "6"
      ]
    },
    {
      "hadith_no": "3103",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا هشام بن عمار، حدثنا الحسن بن يحيى الخشني، حدثنا عمر بن قيس، أخبرني طلحة بن يحيى، عن عمه، إسحاق بن طلحة عن طلحة بن عبيد الله، أنه سمع رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ الحج جهاد والعمرة تطوع ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Talhah bin ‘Ubaidullah that he heard theMessenger ofAllah 9saw) say:                      “Hajj is Jihad and ‘Umrah is voluntary.”",
      "chain": [
        "30288",
        "27503",
        "23043",
        "11863",
        "6"
      ]
    },
    {
      "hadith_no": "3211",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا هشام بن عمار، حدثنا سفيان بن عيينة، عن يحيى بن سعيد، عن محمد بن إبراهيم التيمي، عن عيسى بن طلحة، عن طلحة بن عبيد الله، أن النبي  صلى الله عليه وسلم  أعطاه حمار وحش وأمره أن يفرقه في الرفاق وهم محرمون ‏.‏",
      "text_en": " It wasnarrated from Talhah bin ‘Ubaidullah that the Prophet (ﷺ)gavehim some wild donkey meat, and told him to distribute it amonghisCompanions, who were in Ihram.",
      "chain": [
        "30288",
        "20005",
        "11062",
        "11213",
        "10573",
        "6"
      ]
    },
    {
      "hadith_no": "3925",
      "source": " Sunan Ibn Majah ",
      "chapter": "Interpretation of Dreams - كتاب تعبير الرؤيا",
      "chapter_no": "35",
      "text_ar": "حدثنا محمد بن رمح، أنبأنا الليث بن سعد، عن ابن الهاد، عن محمد بن إبراهيم التيمي، عن أبي سلمة بن عبد الرحمن، عن طلحة بن عبيد الله، أن رجلين، من بلي قدما على رسول الله  صلى الله عليه وسلم  وكان إسلامهما جميعا فكان أحدهما أشد اجتهادا من الآخر فغزا المجتهد منهما فاستشهد ثم مكث الآخر بعده سنة ثم توفي ‏.‏ قال طلحة فرأيت في المنام بينا أنا عند باب الجنة إذا أنا بهما فخرج خارج من الجنة فأذن للذي توفي الآخر منهما ثم خرج فأذن للذي استشهد ثم رجع إلى فقال ارجع فإنك لم يأن لك بعد ‏.‏ فأصبح طلحة يحدث به الناس فعجبوا لذلك فبلغ ذلك رسول الله  صلى الله عليه وسلم  ‏.‏ وحدثوه الحديث فقال ‏\"‏ من أى ذلك تعجبون ‏\"‏ فقالوا يا رسول الله هذا كان أشد الرجلين اجتهادا ثم استشهد ودخل هذا الآخر الجنة قبله ‏.‏ فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ أليس قد مكث هذا بعده سنة ‏\"‏ ‏.‏ قالوا بلى ‏.‏ قال ‏\"‏ وأدرك رمضان فصامه وصلى كذا وكذا من سجدة في السنة ‏\"‏ ‏.‏ قالوا بلى قال رسول الله  صلى الله عليه وسلم  ‏\"‏ فما بينهما أبعد مما بين السماء والأرض ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Talhah bin ‘Ubaidullah that two men from Balicame tothe Messenger of Allah (ﷺ). They had become Muslim together,butone of them used to strive harder than the other. The one who usedtostrive harder went out to fight and was martyred. The other onestayed for a year longer, then he passed away. Talhah said:                      “I sawina dream that I was at the gate of Paradise and I saw them (thosetwomen). Someone came out of Paradise and admitted the one who haddiedlast, then he came out and admitted the one who had beenmartyred.Then he came back to me and said: ‘Go back, for your timehas not yetcome.’” The next morning, Talhah told the people ofthat and they wereamazed. News of that reached the Messenger ofAllah (ﷺ) and theytold him the story. He said: “Why are you soamazed at that?” Theysaid: “O Messenger of Allah, the first onewas the one who stroveharder, then he was martyred, but the otherone was admitted toParadise before him. The Messenger of Allah (ﷺ)said: “Did he notstay behind for a year?” They said: “Yes.”He said: “And did notRamadan come and he fasted, and he offeredsuch and such prayersduring that year?” They said: “Yes.” TheMessenger of Allah (ﷺ)said: “The difference between them isgreater than the differencebetween heaven and earth.”",
      "chain": [
        "30490",
        "20023",
        "11234",
        "11213",
        "10567",
        "6"
      ]
    }
  ],
  "total_hadiths": 25
}