{
  "id": "605",
  "name": "'Abdullah bin Zayd Mazni ( عبد الله بن زيد المازني ( رضي الله عنه",
  "full_name": "'Abdullah bin Zayd Mazni ( عبد الله بن زيد المازني ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medinah"
    },
    "death": {
      "date_hijri": "63",
      "date_gregorian": "681",
      "date_display": null,
      "place": "Madinah, al-Harrah",
      "reason": "NA"
    },
    "places_of_stay": [
      "Medinah"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ ع  -  صحابي ]"
    ],
    "tags": [
      "Ansar",
      "Khazraj",
      "B.Mazin B.al-Najjar",
      "Ridwan",
      "Uhud",
      "Yamama"
    ]
  },
  "parents": [
    {
      "id": "602",
      "name": "Zaid bin Asim Mazni ( زيد بن عاصم بن عمرو ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "79",
      "name": "Umm 'Ammarah Nasaybah ( نسيبة بنت كعب ,أم عمارة ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "spouses": [
    {
      "id": "1286",
      "name": "Umm Sahl bint Sahl bin 'Atik ( أم سهل بنت سهل بن عتيك ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "siblings": [
    {
      "id": "604",
      "name": "Habib bin Zaid Mazni ( حبيب بن زيد بن عاصم ( رضي الله عنه",
      "grade": "Comp.(RA)"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "students": [
    {
      "id": "639",
      "name": "'Abbad bin Tameem Mazni ( عباد بن تميم بن غزية الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [3rd Generation]"
    },
    {
      "id": "11002",
      "name": "Sa'id ibn al-Musayyib سعيد بن المسيب بن حزن أبو محمد القرشي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11232",
      "name": "Yahya bin 'Ammara يحيى بن عمارة بن أبي حسن الأنصاري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11451",
      "name": "Abu Sufyan أبو سفيان مولى بن أبي أحمد",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "158",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا حسين بن عيسى، قال حدثنا يونس بن محمد، قال حدثنا فليح بن سليمان، عن عبد الله بن أبي بكر بن عمرو بن حزم، عن عباد بن تميم، عن عبد الله بن زيد، أن النبي صلى الله عليه وسلم توضأ مرتين مرتين‏.‏",
      "text_en": " Narrated `Abdullah bin Zaid:                     The Prophet performed ablution by washing the body parts twice.",
      "chain": [
        "30326",
        "20393",
        "20169",
        "11104",
        "639",
        "605"
      ]
    },
    {
      "hadith_no": "186",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا موسى، قال حدثنا وهيب، عن عمرو، عن أبيه، شهدت عمرو بن أبي حسن سأل عبد الله بن زيد عن وضوء النبي، صلى الله عليه وسلم فدعا بتور من ماء، فتوضأ لهم وضوء النبي صلى الله عليه وسلم فأكفأ على يده من التور، فغسل يديه ثلاثا، ثم أدخل يده في التور، فمضمض واستنشق واستنثر ثلاث غرفات، ثم أدخل يده فغسل وجهه ثلاثا، ثم أدخل يده فغسل يديه مرتين إلى المرفقين مرتين، ثم أدخل يده فمسح رأسه، فأقبل بهما وأدبر مرة واحدة، ثم غسل رجليه إلى الكعبين‏.‏",
      "text_en": " Narrated `Amr:                     My father saw `Amr bin Abi Hasan asking `Abdullah bin Zaid about the ablution of the Prophet. `Abdullah bin Zaid asked for earthenware pot containing water and in front of them performed ablution like that of the Prophet . He poured water from the pot over his hand and washed his hands thrice and then he put his hands in the pot and rinsed his mouth and washed his nose by putting water in it and then blowing it out with three handfuls of water. Again he put his hand in the water and washed his face thrice and washed his forearms up to the elbows twice; and then put his hands in the water and then passed them over his head by bringing them to the front and then to the rear of the head once, and then he washed his feet up to the ankles.",
      "chain": [
        "20040",
        "20299",
        "11210",
        "605"
      ]
    },
    {
      "hadith_no": "191",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا مسدد، قال حدثنا خالد بن عبد الله، قال حدثنا عمرو بن يحيى، عن أبيه، عن عبد الله بن زيد، أنه أفرغ من الإناء على يديه فغسلهما، ثم غسل أو مضمض، واستنشق من كفة واحدة، ففعل ذلك ثلاثا، فغسل يديه إلى المرفقين مرتين مرتين، ومسح برأسه ما أقبل وما أدبر، وغسل رجليه إلى الكعبين، ثم قال هكذا وضوء رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated `Amr bin Yahya:                     (on the authority of his father) `Abdullah bin Zaid poured water on his hands from a utensil containing water and washed them and then with one handful of water he rinsed his mouth and cleaned his nose by putting water in it and then blowing it out. He repeated it thrice. He, then, washed his hands and forearms up to the elbows twice and passed wet hands over his head, both forwards and backwards, and washed his feet up to the ankles and said, \"This is the ablution of Allah's Apostle.\"",
      "chain": [
        "30175",
        "20423",
        "11210",
        "11232",
        "605"
      ]
    },
    {
      "hadith_no": "192",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا وهيب، قال حدثنا عمرو بن يحيى، عن أبيه، قال شهدت عمرو بن أبي حسن سأل عبد الله بن زيد عن وضوء النبي، صلى الله عليه وسلم فدعا بتور من ماء، فتوضأ لهم، فكفأ على يديه فغسلهما ثلاثا، ثم أدخل يده في الإناء، فمضمض واستنشق، واستنثر ثلاثا بثلاث غرفات من ماء، ثم أدخل يده في الإناء، فغسل وجهه ثلاثا، ثم أدخل يده في الإناء، فغسل يديه إلى المرفقين مرتين مرتين، ثم أدخل يده في الإناء، فمسح برأسه فأقبل بيديه وأدبر بهما، ثم أدخل يده في الإناء فغسل رجليه‏.‏ وحدثنا موسى قال حدثنا وهيب قال مسح رأسه مرة‏.‏",
      "text_en": " Narrated `Amr bin Yahya:                     My father said, \"I saw `Amr bin Abi Hasan asking `Abdullah bin Zaid about the ablution of the Prophet. `Abdullah bin Zaid asked for an earthenware pot containing water and performed ablution in front of them. He poured water over his hands and washed them thrice. Then he put his (right) hand in the pot and rinsed his mouth and washed his nose by putting water in it and then blowing it out thrice with three handfuls of water Again he put his hand in the water and washed his face thrice. After that he put his hand in the pot and washed his forearms up to the elbows twice and then again put his hand in the water and passed wet hands over his head by bringing them to the front and then to the back and once more he put his hand in the pot and washed his feet (up to the ankles.)\"Narrated Wuhaib:That he (the Prophet in narration 191 above) had passed his wet hands on the head once only.",
      "chain": [
        "20193",
        "20299",
        "11210",
        "11232",
        "605"
      ]
    },
    {
      "hadith_no": "197",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا أحمد بن يونس، قال حدثنا عبد العزيز بن أبي سلمة، قال حدثنا عمرو بن يحيى، عن أبيه، عن عبد الله بن زيد، قال أتى رسول الله صلى الله عليه وسلم فأخرجنا له ماء في تور من صفر فتوضأ، فغسل وجهه ثلاثا ويديه مرتين مرتين، ومسح برأسه فأقبل به وأدبر، وغسل رجليه‏.‏",
      "text_en": " Narrated `Abdullah bin Zaid:                     Once Allah's Apostle came to us and we brought out water for him in a brass pot. He performed ablution thus: He washed his face thrice, and his forearms to the elbows twice, then passed his wet hands lightly over the head from front to rear and brought them to front again and washed his feet (up to the ankles).",
      "chain": [
        "30184",
        "32017",
        "11210",
        "11232",
        "605"
      ]
    },
    {
      "hadith_no": "1011",
      "source": " Sahih Bukhari ",
      "chapter": "Invoking Allah for Rain (Istisqaa) - كتاب الاستسقاء",
      "chapter_no": "15",
      "text_ar": "حدثنا إسحاق، قال حدثنا وهب، قال أخبرنا شعبة، عن محمد بن أبي بكر، عن عباد بن تميم، عن عبد الله بن زيد، أن النبي صلى الله عليه وسلم استسقى فقلب رداءه‏.‏",
      "text_en": " Narrated `Abdullah bin Zaid:                     The Prophet turned his cloak inside out on Istisqa.",
      "chain": [
        "30312",
        "20298",
        "20020",
        "11214",
        "639",
        "605"
      ]
    },
    {
      "hadith_no": "1012",
      "source": " Sahih Bukhari ",
      "chapter": "Invoking Allah for Rain (Istisqaa) - كتاب الاستسقاء",
      "chapter_no": "15",
      "text_ar": "حدثنا علي بن عبد الله، قال حدثنا سفيان، قال عبد الله بن أبي بكر أنه سمع عباد بن تميم، يحدث أباه عن عمه عبد الله بن زيد، أن النبي صلى الله عليه وسلم خرج إلى المصلى فاستسقى، فاستقبل القبلة، وقلب رداءه، وصلى ركعتين‏.‏ قال أبو عبد الله كان ابن عيينة يقول هو صاحب الأذان، ولكنه وهم، لأن هذا عبد الله بن زيد بن عاصم المازني، مازن الأنصار‏.‏",
      "text_en": " Narrated `Abdullah bin Zaid:                     The Prophet went towards the Musalla and invoked Allah for rain. He faced the Qibla and wore his cloak inside out, and offered two rak`at.",
      "chain": [
        "30026",
        "20005",
        "11104",
        "639",
        "606",
        "605"
      ]
    },
    {
      "hadith_no": "1195",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of Prayer at Masjid Makkah and Madinah - كتاب فضل الصلاة فى مسجد مكة والمدينة",
      "chapter_no": "20",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن عبد الله بن أبي بكر، عن عباد بن تميم، عن عبد الله بن زيد المازني  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ما بين بيتي ومنبري روضة من رياض الجنة ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Zaid Al-Mazini:                     Allah's Apostle said, \"Between my house and the pulpit there is a garden of the gardens of Paradise.\"",
      "chain": [
        "30355",
        "20001",
        "11104",
        "639",
        "605"
      ]
    },
    {
      "hadith_no": "2129",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا موسى، حدثنا وهيب، حدثنا عمرو بن يحيى، عن عباد بن تميم الأنصاري، عن عبد الله بن زيد  رضى الله عنه  عن النبي صلى الله عليه وسلم ‏\"‏ أن إبراهيم حرم مكة، ودعا لها، وحرمت المدينة كما حرم إبراهيم مكة، ودعوت لها في مدها وصاعها، مثل ما دعا إبراهيم  عليه السلام  لمكة ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Zaid:                     The Prophet said, \"The Prophet Abraham made Mecca a sanctuary, and asked for Allah's blessing in it. I made Medina a sanctuary as Abraham made Mecca a sanctuary and I asked for Allah's Blessing in its measures the Mudd and the Sa as Abraham did for Mecca.",
      "chain": [
        "20040",
        "20299",
        "11210",
        "639",
        "605"
      ]
    },
    {
      "hadith_no": "2959",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا وهيب، حدثنا عمرو بن يحيى، عن عباد بن تميم، عن عبد الله بن زيد  رضى الله عنه  قال لما كان زمن الحرة أتاه آت فقال له إن ابن حنظلة يبايع الناس على الموت‏.‏ فقال لا أبايع على هذا أحدا بعد رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated `Abdullah bin Zaid:                     that in the time (of the battle) of Al-Harra a person came to him and said, \"Ibn Hanzala is taking the pledge of allegiance from the people for death.\" He said, \"I will never give a pledge of allegiance for such a thing to anyone after Allah's Apostle.\"",
      "chain": [
        "20040",
        "20299",
        "11210",
        "639",
        "605"
      ]
    },
    {
      "hadith_no": "4374",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا وهيب، حدثنا عمرو بن يحيى، عن عباد بن تميم، عن عبد الله بن زيد بن عاصم، قال لما أفاء الله على رسوله صلى الله عليه وسلم يوم حنين قسم في الناس في المؤلفة قلوبهم، ولم يعط الأنصار شيئا، فكأنهم وجدوا إذ لم يصبهم ما أصاب الناس فخطبهم فقال ‏\"‏ يا معشر الأنصار ألم أجدكم ضلالا فهداكم الله بي، وكنتم متفرقين فألفكم الله بي وعالة، فأغناكم الله بي ‏\"‏‏.‏ كلما قال شيئا قالوا الله ورسوله أمن‏.‏ قال ‏\"‏ ما يمنعكم أن تجيبوا رسول الله صلى الله عليه وسلم ‏\"‏‏.‏ قال كلما قال شيئا قالوا الله ورسوله أمن‏.‏ قال ‏\"‏ لو شئتم قلتم جئتنا كذا وكذا‏.‏ أترضون أن يذهب الناس بالشاة والبعير، وتذهبون بالنبي صلى الله عليه وسلم إلى رحالكم، لولا الهجرة لكنت امرأ من الأنصار، ولو سلك الناس واديا وشعبا لسلكت وادي الأنصار وشعبها، الأنصار شعار والناس دثار، إنكم ستلقون بعدي أثرة فاصبروا حتى تلقوني على الحوض ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Zaid bin `Asim:                     When Allah gave to His Apostle the war booty on the day of Hunain, he distributed that booty amongst those whose hearts have been (recently) reconciled (to Islam), but did not give anything to the Ansar. So they seemed to have felt angry and sad as they did not get the same as other people had got. The Prophet then delivered a sermon before them, saying, \"O, the assembly of Ansar! Didn't I find you astray, and then Allah guided you on the Right Path through me? You were divided into groups, and Allah brought you together through me; you were poor and Allah made you rich through me.\" Whatever the Prophet said , they (i.e. the Ansar) said, \"Allah and his Apostle have more favours to do.\" The Prophet said, \"What stops you from answering the Apostle of Allah?\" But whatever he said to them, they replied, \"Allah and His Apostle have more favours to do.\" The Prophet then said, \"If you wish you could say: 'You came to us in such-and-such state (at Medina).' Wouldn't you be willing to see the people go away with sheep and camels while you go with the Prophet to your homes? But for the migration, I would have been one of the Ansar, and if the people took their way through a valley or mountain pass, I would select the valley or mountain pass of the Ansar. The Ansar are Shiar (i.e. those clothes which are in direct contact with the body and worn inside the other garments), and the people are Dithar (i.e. those clothes which are not in direct contact with the body and are worn over other garments). No doubt, you will see other people favoured over you, so you should be patient till you meet me at the Tank (of Kauthar).",
      "chain": [
        "20040",
        "20299",
        "11210",
        "639",
        "605"
      ]
    },
    {
      "hadith_no": "6417",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا وهيب، حدثنا عمرو بن يحيى، عن عباد بن تميم، عن عبد الله بن زيد، قال خرج النبي صلى الله عليه وسلم إلى هذا المصلى يستسقي، فدعا واستسقى ثم استقبل القبلة وقلب رداءه‏.‏",
      "text_en": " Narrated `Abdullah bin Zaid:                     Allah's Apostle went out to this Musalla (praying place) to offer the prayer of Istisqa.' He invoked Allah for rain and then faced the Qibla and turned his Rida' (upper garment) inside out.",
      "chain": [
        "20040",
        "20299",
        "11210",
        "639",
        "605"
      ]
    },
    {
      "hadith_no": "7332",
      "source": " Sahih Bukhari ",
      "chapter": "Wishes - كتاب التمنى",
      "chapter_no": "95",
      "text_ar": "حدثنا موسى، حدثنا وهيب، عن عمرو بن يحيى، عن عباد بن تميم، عن عبد الله بن زيد، عن النبي صلى الله عليه وسلم قال ‏\"‏ لولا الهجرة لكنت امرأ من الأنصار، ولو سلك الناس واديا أو شعبا، لسلكت وادي الأنصار وشعبها ‏\"‏‏.‏ تابعه أبو التياح عن أنس عن النبي صلى الله عليه وسلم في الشعب‏.‏",
      "text_en": " Narrated `Abdullah bin Zaid:                     The Prophet said, \"But for the emigration, I would have been one of the Ansar; and if the people took their way in a valley (or a mountain pass), I would take Ansar's valley or their mountain pass.\"",
      "chain": [
        "20040",
        "20299",
        "11210",
        "639",
        "605"
      ]
    },
    {
      "hadith_no": "2107",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Rain) - كتاب صلاة الاستسقاء‏",
      "chapter_no": "10",
      "text_ar": "وحدثنا يحيى بن يحيى، قال قرأت على مالك عن عبد الله بن أبي بكر، أنه سمع عباد بن تميم، يقول سمعت عبد الله بن زيد المازني، يقول خرج رسول الله صلى الله عليه وسلم إلى المصلى فاستسقى وحول رداءه حين استقبل القبلة ‏.‏",
      "text_en": " 'Abdullah b. Zaid b. Mazini reported:                      The Messenger of Allah (may peace be upon him) went to the place of prayer and prayed for rain and turned round his mantle while facing the Qibla.",
      "chain": [
        "30399",
        "11104",
        "639",
        "605"
      ]
    },
    {
      "hadith_no": "2493",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا سريج بن يونس، حدثنا إسماعيل بن جعفر، عن عمرو بن يحيى بن عمارة، عن عباد بن تميم، عن عبد الله بن زيد، أن رسول الله صلى الله عليه وسلم لما فتح حنينا قسم الغنائم فأعطى المؤلفة قلوبهم فبلغه أن الأنصار يحبون أن يصيبوا ما أصاب الناس فقام رسول الله صلى الله عليه وسلم فخطبهم فحمد الله وأثنى عليه ثم قال ‏\"‏ يا معشر الأنصار ألم أجدكم ضلالا فهداكم الله بي وعالة فأغناكم الله بي ومتفرقين فجمعكم الله بي ‏\"‏ ‏.‏ ويقولون الله ورسوله أمن ‏.‏ فقال ‏\"‏ ألا تجيبوني ‏\"‏ ‏.‏ فقالوا الله ورسوله أمن ‏.‏ فقال ‏\"‏ أما إنكم لو شئتم أن تقولوا كذا وكذا وكان من الأمر كذا وكذا ‏\"‏ ‏.‏ لأشياء عددها ‏.‏ زعم عمرو أن لا يحفظها فقال ‏\"‏ ألا ترضون أن يذهب الناس بالشاء والإبل وتذهبون برسول الله إلى رحالكم الأنصار شعار والناس دثار ولولا الهجرة لكنت امرأ من الأنصار ولو سلك الناس واديا وشعبا لسلكت وادي الأنصار وشعبهم إنكم ستلقون بعدي أثرة فاصبروا حتى تلقوني على الحوض ‏\"‏ ‏.‏",
      "text_en": " Abdullah b. Zaid reported that when the Messenger of Allah (may peace be upon him) conquered Hunain he distributed the booty, and he bestowed upon those whose hearts it was intended to win. It was conveyed to him (the Holy Prophet) that the Ansar cherished a desire that they should be given (that very portion) which the people (of Quraish) had got. Upon this the Messenger of Allah (may peace be upon him) stood up and, after having praised Allah and lauded Him, addressed them thus:                      0 people of Ansar, did I not find you erring and Allah guided you aright through me, and (in the state of) being destitute and Allah made you free from want through me, and in a state of disunity and Allah united you through me, and they (the Ansar) said: Allah and His Messenger are most benevolent. He (again) said: Why do you not answer me? They said: Allah and His Messenger are the most benevolent. He said, If you wish you should say so and so, and the event (should take) such and such course (and in this connection he made a mention) of so many things. 'Amr is under the impressionthat he has not been able to remember them. He (the Holy Prophet) further said: Don't you feel happy (over this state of affairs) that the people should go away with goats and camels, and you go to your places along with the Messenger of Allah? The Ansar are inner garments (more close to me) and (other) people are outer garments. Had there not been migration, I would have been a man from among the Ansar. If the people were to tread a valley or a narrow path, I would tread the valley (chosen) by the Ansar or narrow path (trodden) by them. And you would soon find after me preferences (over you in getting material benefits). So you should show patience till you meet me at the Haud (Kauthar).",
      "chain": [
        "30251",
        "20155",
        "11210",
        "639",
        "605"
      ]
    },
    {
      "hadith_no": "3379",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا عبد العزيز، - يعني ابن محمد الدراوردي - عن عمرو بن يحيى المازني، عن عباد بن تميم، عن عمه عبد الله بن زيد بن عاصم، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن إبراهيم حرم مكة ودعا لأهلها وإني حرمت المدينة كما حرم إبراهيم مكة وإني دعوت في صاعها ومدها بمثلى ما دعا به إبراهيم لأهل مكة ‏\"‏ ‏.‏",
      "text_en": "  'Abdullah b. Zaid b. 'Asim (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      Verily Ibrahim declared Mecca sacred and supplicated (for blessings to be showered) upon its inhabitants, and I declare Medina to be sacred as lbrahim had declared Mecca to be sacred. I have supplicated (Allah for His blessings to be showered) in its sa' and its mudd (two standards of weight and measurement) twice as did Ibrahim for the inhabitants of Mecca.",
      "chain": [
        "30367",
        "20167",
        "11210",
        "639",
        "605"
      ]
    },
    {
      "hadith_no": "3434",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا قتيبة بن سعيد، عن مالك بن أنس، فيما قرئ عليه عن عبد الله بن أبي، بكر عن عباد بن تميم، عن عبد الله بن زيد المازني، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ما بين بيتي ومنبري روضة من رياض الجنة ‏\"‏ ‏.‏",
      "text_en": " AbduUah b. Zaid al-Mazini (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      That which is between my house\" and my pulpit is a garden from the gardens of Paradise.",
      "chain": [
        "30367",
        "20001",
        "11104",
        "639",
        "605"
      ]
    },
    {
      "hadith_no": "4931",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا إسحاق بن إبراهيم، أخبرنا المخزومي، حدثنا وهيب، حدثنا عمرو بن، يحيى عن عباد بن تميم، عن عبد الله بن زيد، قال أتاه آت فقال هذاك ابن حنظلة يبايع الناس فقال على ماذا قال على الموت قال لا أبايع على هذا أحدا بعد رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " It has been narrated on the authority of Abdullah b. Zaid who said:                      A person came to him and said: Here is Ibn Hanzala who is making people swear allegiance to him. He (, Abdullah) asked: To what effect? He replied: To the effect that they will die for him. 'Abdullah said: I will never swear allegiance to this effect after the Messenger of Allah (may peace be upon him).",
      "chain": [
        "30123",
        "20299",
        "11210",
        "639",
        "605"
      ]
    },
    {
      "hadith_no": "100",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا الحسن بن علي، حدثنا أبو الوليد، وسهل بن حماد، قالا حدثنا عبد العزيز بن عبد الله بن أبي سلمة، عن عمرو بن يحيى، عن أبيه، عن عبد الله بن زيد، قال جاءنا رسول الله صلى الله عليه وسلم فأخرجنا له ماء في تور من صفر فتوضأ ‏.‏",
      "text_en": " Narrated Abdullah ibn Zayd:                     The Messenger of Allah (ﷺ) came upon us. We brought water for him in a brass vessel and he performed ablution.",
      "chain": [
        "30115",
        "20296",
        "20548",
        "20026",
        "11210",
        "11232",
        "605"
      ]
    },
    {
      "hadith_no": "119",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا مسدد، حدثنا خالد، عن عمرو بن يحيى المازني، عن أبيه، عن عبد الله بن زيد بن عاصم، بهذا الحديث قال فمضمض واستنشق من كف واحدة يفعل ذلك ثلاثا ‏.‏ ثم ذكر نحوه ‏.‏",
      "text_en": " ‘Abd Allah b. Zaid b. ‘Asim reported this tradition saying:                      He rinsed his mouth and snuffed up water from one hand, doing that three times.",
      "chain": [
        "30175",
        "20423",
        "11210",
        "11232",
        "605"
      ]
    },
    {
      "hadith_no": "512",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا حماد بن خالد، حدثنا محمد بن عمرو، عن محمد بن عبد الله، عن عمه عبد الله بن زيد، قال أراد النبي صلى الله عليه وسلم في الأذان أشياء لم يصنع منها شيئا قال فأري عبد الله بن زيد الأذان في المنام فأتى النبي صلى الله عليه وسلم فأخبره فقال ‏\"‏ ألقه على بلال ‏\"‏ ‏.‏ فألقاه عليه فأذن بلال فقال عبد الله أنا رأيته وأنا كنت أريده قال ‏\"‏ فأقم أنت ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Zayd:                     The Prophet (ﷺ) intended to do many things for calling (the people) to prayer, but he did not do any of them. Then Abdullah ibn Zayd was taught in a dream how to pronounce the call to prayer. He came to the Prophet (ﷺ) and informed him. He said: Teach it to Bilal. He then taught him, and Bilal made a call to prayer. Abdullah said: I saw it in a dream and I wished to pronounce it, but he (the Prophet) said: You should pronounce iqamah.",
      "chain": [
        "30203",
        "20537",
        "11220",
        "30561",
        "605"
      ]
    },
    {
      "hadith_no": "1161",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book Of The Prayer For Rain (Kitab al-Istisqa') - كتاب الاستسقاء",
      "chapter_no": "3",
      "text_ar": "حدثنا أحمد بن محمد بن ثابت المروزي، حدثنا عبد الرزاق، أخبرنا معمر، عن الزهري، عن عباد بن تميم، عن عمه، أن رسول الله صلى الله عليه وسلم خرج بالناس ليستسقي فصلى بهم ركعتين جهر بالقراءة فيهما وحول رداءه ورفع يديه فدعا واستسقى واستقبل القبلة ‏.‏",
      "text_en": " Abbad b. Tamim (al-Muzini) reported on the authority of his uncle:                      The Messenger of Allah (ﷺ) took the people out (to the place of prayer) and prayed for rain.  He led them in two rak'ahs of prayer in the course of which he recited from the Qur'an in a loud voice.  He turned around his cloak and raised his hands, prayed for rain and faced the qiblah",
      "chain": [
        "30304",
        "20121",
        "20115",
        "11013",
        "639",
        "605"
      ]
    },
    {
      "hadith_no": "1162",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book Of The Prayer For Rain (Kitab al-Istisqa') - كتاب الاستسقاء",
      "chapter_no": "3",
      "text_ar": "حدثنا ابن السرح، وسليمان بن داود، قالا أخبرنا ابن وهب، قال أخبرني ابن أبي ذئب، ويونس، عن ابن شهاب، قال أخبرني عباد بن تميم المازني، أنه سمع عمه، - وكان من أصحاب رسول الله صلى الله عليه وسلم يقول خرج رسول الله صلى الله عليه وسلم يوما يستسقي فحول إلى الناس ظهره يدعو الله عز وجل - قال سليمان بن داود واستقبل القبلة وحول رداءه ثم صلى ركعتين - قال ابن أبي ذئب - وقرأ فيهما زاد ابن السرح يريد الجهر ‏.‏",
      "text_en": " Abbad b. Tamim al Mazini said on the authority of his uncle (Abd Allah b. Zaid b Asim) who was a Companion of the Messenger of Allah (ﷺ):                      One day the Messenger of Allah (ﷺ) went out to make supplication for rain.  He turned his back towards the people praying to Allah, the Exalted.  The narrator Sulaiman b. Dawud said: He faced the qiblah and turned around his cloak and then offered two rak'ahs of prayer.  The narrator Ibn Abi Dhi'b said: He recited from the Qur'an in both of them.  The version of Ibn al-Sarh adds: By it he means in a loud voice.",
      "chain": [
        "30485",
        "30584",
        "20029",
        "20177",
        "20475",
        "11013",
        "639",
        "605"
      ]
    },
    {
      "hadith_no": "1163",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book Of The Prayer For Rain (Kitab al-Istisqa') - كتاب الاستسقاء",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن عوف، قال قرأت في كتاب عمرو بن الحارث - يعني الحمصي - عن عبد الله بن سالم، عن الزبيدي، عن محمد بن مسلم، بهذا الحديث بإسناده لم يذكر الصلاة قال وحول رداءه فجعل عطافه الأيمن على عاتقه الأيسر وجعل عطافه الأيسر على عاتقه الأيمن ثم دعا الله عز وجل ‏.‏",
      "text_en": " The above-mentioned tradition has also been transmitted by Muhammad b. Muslim through a different chain of narrators.  But there is no mention of prayer in this version. The version adds:                      \"He turned around his cloak, putting its right side on his left shoulder and its left side on his right shoulder.  Thereafter he made supplication to Allah.\"",
      "chain": [
        "38566",
        "28443",
        "20432",
        "20459",
        "11013",
        "639",
        "605"
      ]
    },
    {
      "hadith_no": "1164",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book Of The Prayer For Rain (Kitab al-Istisqa') - كتاب الاستسقاء",
      "chapter_no": "3",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا عبد العزيز، عن عمارة بن غزية، عن عباد بن تميم، أن عبد الله بن زيد، قال استسقى رسول الله صلى الله عليه وسلم وعليه خميصة له سوداء فأراد رسول الله صلى الله عليه وسلم أن يأخذ بأسفلها فيجعله أعلاها فلما ثقلت قلبها على عاتقه ‏.‏",
      "text_en": " Abd Allah b. Zaid said:                      The Messenger of Allah (pbuh)prayed for rain wearing a black robe with ornamented border.  The Messenger of Allah (pbuh)wanted to reverse it from bottom to top by holding the bottom.  But when it was too heavy he turned it round on his shoulders.",
      "chain": [
        "30367",
        "20167",
        "11894",
        "639",
        "605"
      ]
    },
    {
      "hadith_no": "1166",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book Of The Prayer For Rain (Kitab al-Istisqa') - كتاب الاستسقاء",
      "chapter_no": "3",
      "text_ar": "حدثنا عبد الله بن مسلمة، حدثنا سليمان، - يعني ابن بلال - عن يحيى، عن أبي بكر بن محمد، عن عباد بن تميم، أن عبد الله بن زيد، أخبره أن رسول الله صلى الله عليه وسلم خرج إلى المصلى يستسقي وأنه لما أراد أن يدعو استقبل القبلة ثم حول رداءه ‏.‏",
      "text_en": " Abd Allah b. Zaid said:                      The Messenger of Allah (pbuh)went out to the place of prayer to pray for rain.  When he wanted to make supplication, he faced the qiblah and turned around his cloak.",
      "chain": [
        "20164",
        "20160",
        "11062",
        "11239",
        "639",
        "605"
      ]
    },
    {
      "hadith_no": "1167",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book Of The Prayer For Rain (Kitab al-Istisqa') - كتاب الاستسقاء",
      "chapter_no": "3",
      "text_ar": "حدثنا القعنبي، عن مالك، عن عبد الله بن أبي بكر، أنه سمع عباد بن تميم، يقول سمعت عبد الله بن زيد المازني، يقول خرج رسول الله صلى الله عليه وسلم إلى المصلى فاستسقى وحول رداءه حين استقبل القبلة ‏.‏",
      "text_en": " Narrated Abd Allah b. Zaid al Mazini:                     Abd Allah b. Zaid al Mazini said: The Messenger of Allah (pbuh) went out to the place of prayer and made supplication or rain, and turned around his cloak when the faced the qiblah.",
      "chain": [
        "20164",
        "20001",
        "11104",
        "639",
        "605"
      ]
    },
    {
      "hadith_no": "28",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا يحيى بن موسى، حدثنا إبراهيم بن موسى الرازي، حدثنا خالد بن عبد الله، عن عمرو بن يحيى، عن أبيه، عن عبد الله بن زيد، قال رأيت النبي صلى الله عليه وسلم مضمض واستنشق من كف واحد فعل ذلك ثلاثا ‏.‏ قال أبو عيسى وفي الباب عن عبد الله بن عباس ‏.‏ قال أبو عيسى وحديث عبد الله بن زيد حسن غريب ‏.‏ وقد روى مالك وابن عيينة وغير واحد هذا الحديث عن عمرو بن يحيى ولم يذكروا هذا الحرف أن النبي صلى الله عليه وسلم مضمض واستنشق من كف واحد ‏.‏ وإنما ذكره خالد بن عبد الله ‏.‏ وخالد بن عبد الله ثقة حافظ عند أهل الحديث ‏.‏ وقال بعض أهل العلم المضمضة والاستنشاق من كف واحد يجزئ وقال بعضهم تفريقهما أحب إلينا ‏.‏ وقال الشافعي إن جمعهما في كف واحد فهو جائز وإن فرقهما فهو أحب إلينا ‏.‏",
      "text_en": " Abdullah bin Zaid said:                     \"1 saw the Prophet rinse his mouth and sniff water in his nose using one hand, he did that thrice,\"",
      "chain": [
        "30221",
        "30309",
        "20423",
        "11210",
        "11232",
        "605"
      ]
    },
    {
      "hadith_no": "32",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا إسحاق بن موسى الأنصاري، حدثنا معن بن عيسى القزاز، حدثنا مالك بن أنس، عن عمرو بن يحيى، عن أبيه، عن عبد الله بن زيد، أن رسول الله صلى الله عليه وسلم مسح رأسه بيديه فأقبل بهما وأدبر بدأ بمقدم رأسه ثم ذهب بهما إلى قفاه ثم ردهما حتى رجع إلى المكان الذي بدأ منه ثم غسل رجليه ‏.‏ قال أبو عيسى وفي الباب عن معاوية والمقدام بن معديكرب وعائشة ‏.‏ قال أبو عيسى حديث عبد الله بن زيد أصح شيء في هذا الباب وأحسن وبه يقول الشافعي وأحمد وإسحاق ‏.‏",
      "text_en": " Abdullah bin Zaid narrated that:                     \"Allah's Messenger wiped over his head with his hands, going over the front with them and the rear. He began with the front of his head until they went to the nape of his neck. Then he brought them back again to the place where he began. Then he washed his feet.\"",
      "chain": [
        "30410",
        "30112",
        "20001",
        "11210",
        "11232",
        "605"
      ]
    },
    {
      "hadith_no": "35",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا علي بن خشرم، أخبرنا عبد الله بن وهب، حدثنا عمرو بن الحارث، عن حبان بن واسع، عن أبيه، عن عبد الله بن زيد، أنه رأى النبي صلى الله عليه وسلم توضأ وأنه مسح رأسه بماء غير فضل يديه ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وروى ابن لهيعة هذا الحديث عن حبان بن واسع عن أبيه عن عبد الله بن زيد أن النبي صلى الله عليه وسلم توضأ وأنه مسح رأسه بماء غبر من فضل يديه ‏\"‏ ‏.‏ ورواية عمرو بن الحارث عن حبان أصح لأنه قد روي من غير وجه هذا الحديث عن عبد الله بن زيد وغيره أن النبي صلى الله عليه وسلم أخذ لرأسه ماء جديدا ‏.‏ والعمل على هذا عند أكثر أهل العلم رأوا أن يأخذ لرأسه ماء جديدا ‏.‏",
      "text_en": " 'Abdullah bin Zaid narrated that :                     he saw the Prophet performing Wudu, and that he wiped his head with water that was not left over from his hands.",
      "chain": [
        "30556",
        "20029",
        "20377",
        "10854",
        "605"
      ]
    },
    {
      "hadith_no": "47",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن أبي عمر، حدثنا سفيان بن عيينة، عن عمرو بن يحيى، عن أبيه، عن عبد الله بن زيد، أن النبي صلى الله عليه وسلم توضأ فغسل وجهه ثلاثا وغسل يديه مرتين مرتين ومسح برأسه وغسل رجليه مرتين ‏.‏ قال أبو عيسى وهذا حديث حسن صحيح ‏.‏ وقد ذكر في غير حديث أن النبي صلى الله عليه وسلم توضأ بعض وضوئه مرة وبعضه ثلاثا ‏.‏ وقد رخص بعض أهل العلم في ذلك لم يروا بأسا أن يتوضأ الرجل بعض وضوئه ثلاثا وبعضه مرتين أو مرة ‏.‏",
      "text_en": " Abdullah bin Zaid narrated that:                     \"The Prophet performed Wudu. So he washed his face three times, and washed his hands two times each, and wiped his head, and washed his feet [two times].\"",
      "chain": [
        "20005",
        "11210",
        "11232",
        "605"
      ]
    },
    {
      "hadith_no": "194",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو سعيد الأشج، حدثنا عقبة بن خالد، عن ابن أبي ليلى، عن عمرو بن مرة، عن عبد الرحمن بن أبي ليلى، عن عبد الله بن زيد، قال كان أذان رسول الله صلى الله عليه وسلم شفعا شفعا في الأذان والإقامة ‏\"‏ ‏.‏ قال أبو عيسى حديث عبد الله بن زيد رواه وكيع عن الأعمش عن عمرو بن مرة عن عبد الرحمن بن أبي ليلى قال حدثنا أصحاب محمد صلى الله عليه وسلم أن عبد الله بن زيد رأى الأذان في المنام ‏.‏ وقال شعبة عن عمرو بن مرة عن عبد الرحمن بن أبي ليلى أن عبد الله بن زيد رأى الأذان في المنام ‏.‏ وهذا أصح من حديث ابن أبي ليلى ‏.‏ وعبد الرحمن بن أبي ليلى لم يسمع من عبد الله بن زيد ‏.‏ وقال بعض أهل العلم الأذان مثنى مثنى والإقامة مثنى مثنى ‏.‏ وبه يقول سفيان الثوري وابن المبارك وأهل الكوفة ‏.‏ قال أبو عيسى ابن أبي ليلى هو محمد بن عبد الرحمن بن أبي ليلى كان قاضي الكوفة ولم يسمع من أبيه شيئا إلا أنه يروي عن رجل عن أبيه ‏.‏",
      "text_en": " Abdullah bin Zaid said:                     \"Allah's Messenger would say each phrase of the call (for prayer) two times, for the Adhan and the Iqamah.\"",
      "chain": [
        "30200",
        "20344",
        "11196",
        "11381",
        "11196",
        "605"
      ]
    },
    {
      "hadith_no": "161",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا قتيبة، عن سفيان، عن الزهري، ح وأخبرني محمد بن منصور، عن سفيان، قال حدثنا الزهري، قال أخبرني سعيد، - يعني ابن المسيب - وعباد بن تميم عن عمه، - وهو عبد الله بن زيد - قال شكي إلى النبي صلى الله عليه وسلم الرجل يجد الشىء في الصلاة قال ‏\"‏ لا ينصرف حتى يجد ريحا أو يسمع صوتا ‏\"‏ ‏.‏",
      "text_en": " Sa'eed - meaning Ibn Al-Musayyab - and 'Abbad bin Tamim narrated that his uncle - 'Abdullah bin Zaid - said:                      \"A man who felt something during Salah complained to the Prophet (ﷺ). He said: 'Do not stop praying unless you notice a smell or hear a sound.'\"",
      "chain": [
        "30367",
        "20005",
        "11013",
        "36658",
        "20005",
        "11013",
        "11002",
        "605"
      ]
    },
    {
      "hadith_no": "695",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Masjids - كتاب المساجد",
      "chapter_no": "8",
      "text_ar": "أخبرنا قتيبة، عن مالك، عن عبد الله بن أبي بكر، عن عباد بن تميم، عن عبد الله بن زيد، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما بين بيتي ومنبري روضة من رياض الجنة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Zaid said:                      \"The Messenger of Allah (ﷺ) said: 'The area between my house and my Minbar is one of the gardens of Paradise.'\"",
      "chain": [
        "30367",
        "20001",
        "11104",
        "639",
        "605"
      ]
    },
    {
      "hadith_no": "1507",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Praying for Rain (Al-Istisqa') - كتاب الاستسقاء",
      "chapter_no": "17",
      "text_ar": "أخبرنا قتيبة، قال حدثنا عبد العزيز، عن عمارة بن غزية، عن عباد بن تميم، عن عبد الله بن زيد، أن رسول الله صلى الله عليه وسلم استسقى وعليه خميصة سوداء ‏.‏",
      "text_en": " It was narrated from Abdullah bin Zaid that:                     The Messenger of Allah (ﷺ) prayed for rain wearing a black khamisah.",
      "chain": [
        "30367",
        "20167",
        "11894",
        "639",
        "605"
      ]
    },
    {
      "hadith_no": "1511",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Praying for Rain (Al-Istisqa') - كتاب الاستسقاء",
      "chapter_no": "17",
      "text_ar": "أخبرنا قتيبة، عن مالك، عن عبد الله بن أبي بكر، أنه سمع عباد بن تميم، يقول سمعت عبد الله بن زيد، يقول خرج رسول الله صلى الله عليه وسلم فاستسقى وحول رداءه حين استقبل القبلة ‏.‏",
      "text_en": " It was narrated from Abdullah bin Abi Bakr that:                     He heard Abbad bin Tamim said: \"The Messenger of Allah (ﷺ) went out and prayed for rain, and he turned his rida' around when he turned to the Qiblah.\"",
      "chain": [
        "30367",
        "20001",
        "11104",
        "639",
        "605"
      ]
    },
    {
      "hadith_no": "1520",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Praying for Rain (Al-Istisqa') - كتاب الاستسقاء",
      "chapter_no": "17",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا يحيى بن سعيد، عن يحيى، عن أبي بكر بن محمد، عن عباد بن تميم، عن عبد الله بن زيد، أن النبي صلى الله عليه وسلم خرج يستسقي فصلى ركعتين واستقبل القبلة ‏.‏",
      "text_en": " It was narrated from Abdullah bin Zaid that:                     The Prophet (ﷺ) went out to pray for rain, and he prayed two rak'ahs facing the Qiblah. (Sahih",
      "chain": [
        "30153",
        "20031",
        "20031",
        "639",
        "605"
      ]
    },
    {
      "hadith_no": "5115",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا محمد بن علي بن ميمون، قال حدثنا القعنبي، قال حدثنا عبد الله بن زيد، عن أبيه، أن ابن عمر، كان يصبغ ثيابه بالزعفران فقيل له فقال كان رسول الله صلى الله عليه وسلم يصبغ ‏.‏",
      "text_en": " 'Abdullah bin Zaid narrated from his father that:                     Ibn 'Umar used to dye his garments with saffron. He was asked about that and he said: \"The Messenger of Allah [SAW] used to dye his clothes (with it).\"",
      "chain": [
        "38556",
        "20164",
        "605",
        "602",
        "18"
      ]
    },
    {
      "hadith_no": "478",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا يحيى بن زكريا بن أبي زائدة، عن شعبة، عن حبيب بن زيد، عن عباد بن تميم، عن عبد الله بن زيد، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ الأذنان من الرأس ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Zaid said:                     \"The Messenger of Allah said: 'The ears are part of the head.'\"",
      "chain": [
        "30547",
        "20366",
        "20020",
        "20700",
        "639",
        "605"
      ]
    }
  ],
  "total_hadiths": 39
}