{
  "id": "606",
  "name": "Tameem bin Zayd/Ghaziya Mazni ( تميم بن غزية/زيد الأنصاري ( رضي الله عنه",
  "full_name": "Tameem bin Zayd/Ghaziya Mazni ( تميم بن غزية/زيد الأنصاري ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medinah"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Madinah",
      "reason": "NA"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Recitation/Quran"
    ],
    "tags": [
      "Ansari",
      "Khazraji",
      "B.Mazin B.al-Najjar",
      "Ridwan"
    ]
  },
  "parents": [
    {
      "id": "603",
      "name": "Ghaziyah bin 'Amr Mazni ( غزية بن عمرو بن عطية ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "79",
      "name": "Umm 'Ammarah Nasaybah ( نسيبة بنت كعب ,أم عمارة ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "spouses": [
    {
      "id": "1351",
      "name": "Umm 'Ubayd bint Suraqa ( أم عبيد بنت سراقة بن الحارث ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "siblings": [
    {
      "id": "607",
      "name": "Khawlah bint Ghaziyah Mazni ( خولة بنت ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "children": [
    {
      "id": "639",
      "name": "'Abbad bin Tameem Mazni ( عباد بن تميم بن غزية الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [3rd Generation]"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "students": [
    {
      "id": "639",
      "name": "'Abbad bin Tameem Mazni ( عباد بن تميم بن غزية الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1012",
      "source": " Sahih Bukhari ",
      "chapter": "Invoking Allah for Rain (Istisqaa) - كتاب الاستسقاء",
      "chapter_no": "15",
      "text_ar": "حدثنا علي بن عبد الله، قال حدثنا سفيان، قال عبد الله بن أبي بكر أنه سمع عباد بن تميم، يحدث أباه عن عمه عبد الله بن زيد، أن النبي صلى الله عليه وسلم خرج إلى المصلى فاستسقى، فاستقبل القبلة، وقلب رداءه، وصلى ركعتين‏.‏ قال أبو عبد الله كان ابن عيينة يقول هو صاحب الأذان، ولكنه وهم، لأن هذا عبد الله بن زيد بن عاصم المازني، مازن الأنصار‏.‏",
      "text_en": " Narrated `Abdullah bin Zaid:                     The Prophet went towards the Musalla and invoked Allah for rain. He faced the Qibla and wore his cloak inside out, and offered two rak`at.",
      "chain": [
        "30026",
        "20005",
        "11104",
        "639",
        "606",
        "605"
      ]
    },
    {
      "hadith_no": "1505",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Praying for Rain (Al-Istisqa') - كتاب الاستسقاء",
      "chapter_no": "17",
      "text_ar": "أخبرني محمد بن منصور، قال حدثنا سفيان، قال حدثنا المسعودي، عن أبي بكر بن عمرو بن حزم، عن عباد بن تميم، - قال سفيان فسألت عبد الله بن أبي بكر فقال سمعته من، عباد بن تميم يحدث أبي - أن عبد الله بن زيد الذي، أري النداء قال إن رسول الله صلى الله عليه وسلم خرج إلى المصلى يستسقي فاستقبل القبلة وقلب رداءه وصلى ركعتين ‏.‏ قال أبو عبد الرحمن هذا غلط من ابن عيينة وعبد الله بن زيد الذي أري النداء هو عبد الله بن زيد بن عبد ربه وهذا عبد الله بن زيد بن عاصم ‏.‏",
      "text_en": " It was narrated from 'Abbad bin Tamim:                     \"Sufyan said: 'I asked 'Abdullah bin Abi Bakr who said: I heard it from Abbad bin Tamim who narrated it from his father, that 'Abdullah bin Zaid, who was shown the call to prayer (in a dream) said: 'The Messenger of Allah (ﷺ) went out to the prayer place to pray for rain. He faced the kiblah and turned his cloak around and prayed two rak'ahs.'\"",
      "chain": [
        "36658",
        "20005",
        "20724",
        "11239",
        "639",
        "606"
      ]
    },
    {
      "hadith_no": "1325",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن الصباح، حدثنا سفيان، عن عبد الله بن أبي بكر، قال سمعت عباد بن تميم، يحدث أبي عن عمه، أنه شهد النبي  صلى الله عليه وسلم  خرج إلى المصلى ليستسقي فاستقبل القبلة وقلب رداءه وصلى ركعتين ‏.‏",
      "text_en": " It wasnarrated that ‘Abdullah bin Abu Bakr said:                      “I heard ‘Abbad binTamim narrating to my father that his paternal uncle had seen theProphet (ﷺ) going out to the prayer place to pray for rain. Hefaced the Qiblah and turned his cloak around, and prayed two Rak’ah.”",
      "chain": [
        "30269",
        "20005",
        "11104",
        "639",
        "606"
      ]
    }
  ],
  "total_hadiths": 3
}