{
  "id": "70",
  "name": "Asma' bint Abi Bakr ( أسماء بنت أبي بكر الصديق ( رضي الله عنها",
  "full_name": "Asma' bint Abi Bakr ( أسماء بنت أبي بكر الصديق ( رضي الله عنها",
  "grade": "Comp.(RA) [1st Generation]",
  "biography": {
    "birth": {
      "date_hijri": "27",
      "date_gregorian": "NA",
      "date_display": [
        "27 BH"
      ],
      "place": "Makkah"
    },
    "death": {
      "date_hijri": "73",
      "date_gregorian": "692",
      "date_display": null,
      "place": "Medinah",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah",
      "Medina"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ ع  -  صحابة ]",
      "Fiqh"
    ],
    "tags": [
      "Female",
      "Quraish",
      "B.Taym"
    ]
  },
  "parents": [
    {
      "id": "2",
      "name": "Abu Bakr Al-Siddique ( أبو بكر الصديق ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "spouses": [
    {
      "id": "7",
      "name": "Zubayr ibn al-Awwam ( الزبير بن العوام بن خويلد ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "siblings": [
    {
      "id": "110",
      "name": "'Abdullah bin Abi Bakr ( عبد الله بن أبي بكر ( رضي الله عنه",
      "grade": "Comp.(RA)"
    }
  ],
  "children": [
    {
      "id": "106",
      "name": "'Abdullah ibn al-Zubayr ( عبد الله بن الزبير بن العوام ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "10510",
      "name": "al-Mundhir bin al-Zubayr المنذر بن الزبير بن العوام القرشي",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "10511",
      "name": "'Urwa ibn al-Zubayr عروة بن الزبير",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10512",
      "name": "''Asim ibn al-Zubayr عاصم بن الزبير بن العوام",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "10513",
      "name": "al-Muhajir ibn al-Zubayr",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "10514",
      "name": "Khadija al-Kubra bint al-Zubayr خديجة الكبرى بنت الزبير بن العوام",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "10515",
      "name": "Ummul Hasan bint al-Zubayr",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "10516",
      "name": "'Aisha bint al-Zubayr",
      "grade": "Follower(Tabi')"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "students": [
    {
      "id": "106",
      "name": "'Abdullah ibn al-Zubayr ( عبد الله بن الزبير بن العوام ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "10511",
      "name": "'Urwa ibn al-Zubayr عروة بن الزبير",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11250",
      "name": "'Aabad bin 'Abdullah bin al-Zubair عباد بن عبد الله بن الزبير بن العوام",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11699",
      "name": "'Abdullah bin 'Urwa عبد الله بن عروة بن الزبير",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10926",
      "name": "'Aabad bin Hamza bin 'Abdullah عباد بن حمزة بن عبد الله بن الزبير",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10526",
      "name": "Fatima bint al-Mundhir bin al-Zubayr فاطمة بنت المنذر بن الزبير",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11188",
      "name": "'Abdullah bin Kysan al-Qurshi عبد الله بن كيسان القرشي التيمي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11231",
      "name": "Wahb bin Kysan al-Quraishi وهب بن كيسان القرشي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "2802",
      "name": "Safiyya bint Shayba bin 'Uthman ( صفية بنت شيبة بن عثمان العبدرية ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "86",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا موسى بن إسماعيل، قال حدثنا وهيب، قال حدثنا هشام، عن فاطمة، عن أسماء، قالت أتيت عائشة وهي تصلي فقلت ما شأن الناس فأشارت إلى السماء، فإذا الناس قيام، فقالت سبحان الله‏.‏ قلت آية فأشارت برأسها، أى نعم، فقمت حتى تجلاني الغشى، فجعلت أصب على رأسي الماء، فحمد الله عز وجل النبي صلى الله عليه وسلم وأثنى عليه، ثم قال ‏\"‏ ما من شىء لم أكن أريته إلا رأيته في مقامي حتى الجنة والنار، فأوحي إلى أنكم تفتنون في قبوركم، مثل  أو قريبا لا أدري أى ذلك قالت أسماء  من فتنة المسيح الدجال، يقال ما علمك بهذا الرجل فأما المؤمن  أو الموقن لا أدري بأيهما قالت أسماء  فيقول هو محمد رسول الله جاءنا بالبينات والهدى، فأجبنا واتبعنا، هو محمد‏.‏ ثلاثا، فيقال نم صالحا، قد علمنا إن كنت لموقنا به، وأما المنافق  أو المرتاب لا أدري أى ذلك قالت أسماء  فيقول لا أدري، سمعت الناس يقولون شيئا فقلته ‏\"‏‏.‏",
      "text_en": " Narrated Asma':                     I came to `Aisha while she was praying, and said to her, \"What has happened to the people?\" She pointed out towards the sky. (I looked towards the mosque), and saw the people offering the prayer. Aisha said, \"Subhan Allah.\" I said to her, \"Is there a sign?\" She nodded with her head meaning, \"Yes.\" I, too, then stood (for the prayer of eclipse) till I became (nearly) unconscious and later on I poured water on my head. After the prayer, the Prophet praised and glorified Allah and then said, \"Just now at this place I have seen what I have never seen before, including Paradise and Hell. No doubt it has been inspired to me that you will be put to trials in your graves and these trials will be like the trials of Masih-ad-Dajjal or nearly like it (the sub narrator is not sure which expression Asma' used). You will be asked, 'What do you know about this man (the Prophet Muhammad)?' Then the faithful believer (or Asma' said a similar word) will reply, 'He is Muhammad Allah's Apostle who had come to us with clear evidences and guidance and so we accepted his teachings and followed him. And he is Muhammad.' And he will repeat it thrice. Then the angels will say to him, 'Sleep in peace as we have come to know that you were a faithful believer.' On the other hand, a hypocrite or a doubtful person will reply, 'I do not know, but I heard the people saying something and so I said it.' (the same). \"",
      "chain": [
        "20040",
        "20299",
        "11065",
        "10526",
        "70"
      ]
    },
    {
      "hadith_no": "184",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا إسماعيل، قال حدثني مالك، عن هشام بن عروة، عن امرأته، فاطمة عن جدتها، أسماء بنت أبي بكر أنها قالت أتيت عائشة زوج النبي صلى الله عليه وسلم حين خسفت الشمس، فإذا الناس قيام يصلون، وإذا هي قائمة تصلي فقلت ما للناس فأشارت بيدها نحو السماء وقالت سبحان الله‏.‏ فقلت آية فأشارت أى نعم‏.‏ فقمت حتى تجلاني الغشى، وجعلت أصب فوق رأسي ماء، فلما انصرف رسول الله صلى الله عليه وسلم حمد الله وأثنى عليه، ثم قال ‏\"‏ ما من شىء كنت لم أره إلا قد رأيته في مقامي هذا حتى الجنة والنار، ولقد أوحي إلى أنكم تفتنون في القبور مثل أو قريبا من فتنة الدجال  لا أدري أى ذلك قالت أسماء  يؤتى أحدكم فيقال ما علمك بهذا الرجل فأما المؤمن  أو الموقن لا أدري أى ذلك قالت أسماء  فيقول هو محمد رسول الله، جاءنا بالبينات والهدى، فأجبنا وآمنا واتبعنا، فيقال نم صالحا، فقد علمنا إن كنت لمؤمنا، وأما المنافق  أو المرتاب لا أدري أى ذلك قالت أسماء  فيقول لا أدري، سمعت الناس يقولون شيئا فقلته ‏\"‏‏.‏",
      "text_en": " Narrated Asma' bint Abu Bakr:                     I came to `Aisha the wife of the Prophet during the solar eclipse. The people were standing and offering the prayer and she was also praying. I asked her, \"What is wrong with the people?\" She beckoned with her hand towards the sky and said, \"Subhan Allah.\" I asked her, \"Is there a sign?\" She pointed out, \"Yes.\" So I, too, stood for the prayer till I fell unconscious and later on I poured water on my head. After the prayer, Allah's Apostle praised and glorified Allah and said, \"Just now I have seen something which I never saw before at this place of mine, including Paradise and Hell. I have been inspired (and have understood) that you will be put to trials in your graves and these trials will be like the trials of Ad-Dajjal, or nearly like it (the sub narrator is not sure of what Asma' said). Angels will come to every one of you and ask, 'What do you know about this man?' A believer will reply, 'He is Muhammad, Allah's Apostle , and he came to us with self-evident truth and guidance. So we accepted his teaching, believed and followed him.' Then the angels will say to him to sleep in peace as they have come to know that he was a believer. On the other hand a hypocrite or a doubtful person will reply, 'I do not know but heard the people saying something and so I said the same.' \"",
      "chain": [
        "30103",
        "20001",
        "11065",
        "70"
      ]
    },
    {
      "hadith_no": "227",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا محمد بن المثنى، قال حدثنا يحيى، عن هشام، قال حدثتني فاطمة، عن أسماء، قالت جاءت امرأة النبي صلى الله عليه وسلم فقالت أرأيت إحدانا تحيض في الثوب كيف تصنع قال ‏\"‏ تحته، ثم تقرصه بالماء، وتنضحه وتصلي فيه ‏\"‏‏.‏",
      "text_en": " Narrated Asma':                     A woman came to the Prophet and said, \"If anyone of us gets menses in her clothes then what should she do?\" He replied, \"She should (take hold of the soiled place), rub it and put it in the water and rub it in order to remove the traces of blood and then pour water over it. Then she can pray in it.\"",
      "chain": [
        "30170",
        "20031",
        "11065",
        "10526",
        "70"
      ]
    },
    {
      "hadith_no": "307",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن هشام، عن فاطمة بنت المنذر، عن أسماء بنت أبي بكر، أنها قالت سألت امرأة رسول الله صلى الله عليه وسلم فقالت يا رسول الله، أرأيت إحدانا إذا أصاب ثوبها الدم من الحيضة، كيف تصنع فقال رسول الله صلى الله عليه وسلم ‏\"‏ إذا أصاب ثوب إحداكن الدم من الحيضة، فلتقرصه ثم لتنضحه بماء، ثم لتصلي فيه ‏\"‏‏.‏",
      "text_en": " Narrated Asma' bint Abi Bakr:                     A woman asked Allah's Apostle, \"O Allah's Apostle! What should we do, if the blood of menses falls on our clothes?\" Allah's Apostle replied, \"If the blood of menses falls on the garment of anyone of you, she must take hold of the blood spot, rub it, and wash it with water and then pray in (with it).",
      "chain": [
        "30355",
        "20001",
        "11065",
        "10526",
        "70"
      ]
    },
    {
      "hadith_no": "745",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا ابن أبي مريم، قال أخبرنا نافع بن عمر، قال حدثني ابن أبي مليكة، عن أسماء بنت أبي بكر، أن النبي صلى الله عليه وسلم صلى صلاة الكسوف، فقام فأطال القيام، ثم ركع فأطال الركوع، ثم قام فأطال القيام، ثم ركع فأطال الركوع ثم رفع، ثم سجد فأطال السجود، ثم رفع، ثم سجد فأطال السجود، ثم قام فأطال القيام ثم ركع فأطال الركوع ثم رفع فأطال القيام ثم ركع فأطال الركوع ثم رفع فسجد فأطال السجود، ثم رفع، ثم سجد فأطال السجود ثم انصرف فقال ‏\"‏ قد دنت مني الجنة حتى لو اجترأت عليها لجئتكم بقطاف من قطافها، ودنت مني النار حتى قلت أى رب وأنا معهم فإذا امرأة  حسبت أنه قال  تخدشها هرة قلت ما شأن هذه قالوا حبستها حتى ماتت جوعا، لا أطعمتها، ولا أرسلتها تأكل ‏\"‏‏.‏ قال نافع حسبت أنه قال ‏\"‏ من خشيش أو خشاش الأرض ‏\"‏‏.‏",
      "text_en": " Narrated Asma' bint Abi Bakr:                     The Prophet once offered the eclipse prayer. He stood for a long time and then did a prolonged bowing. He stood up straight again and kept on standing for a long time, then bowed a long bowing and then stood up straight and then prostrated a prolonged prostration and then lifted his head and prostrated a prolonged prostration. And then he stood up for a long time and then did a prolonged bowing and then stood up straight again and kept on standing for a long time. Then he bowed a long bowing and then stood up straight and then prostrated a prolonged prostration and then lifted his head and went for a prolonged prostration. On completion o the prayer, he said, \"Paradise became s near to me that if I had dared, I would have plucked one of its bunches for you and Hell became so near to me that said, 'O my Lord will I be among those people?' Then suddenly I saw a woman and a cat was lacerating her with it claws. On inquiring, it was said that the woman had imprisoned the cat till it died of starvation and she neither fed it no freed it so that it could feed itself.\"",
      "chain": [
        "30232",
        "20203",
        "11090",
        "70"
      ]
    },
    {
      "hadith_no": "922",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "وقال محمود حدثنا أبو أسامة، قال حدثنا هشام بن عروة، قال أخبرتني فاطمة بنت المنذر، عن أسماء بنت أبي بكر، قالت دخلت على عائشة  رضى الله عنها  والناس يصلون قلت ما شأن الناس فأشارت برأسها إلى السماء‏.‏ فقلت آية فأشارت برأسها أى نعم‏.‏ قالت فأطال رسول الله صلى الله عليه وسلم جدا حتى تجلاني الغشى وإلى جنبي قربة فيها ماء ففتحتها فجعلت أصب منها على رأسي، فانصرف رسول الله صلى الله عليه وسلم وقد تجلت الشمس، فخطب الناس، وحمد الله بما هو أهله ثم قال ‏\"‏ أما بعد ‏\"‏‏.‏ قالت ولغط نسوة من الأنصار، فانكفأت إليهن لأسكتهن فقلت لعائشة ما قال قالت قال ‏\"‏ ما من شىء لم أكن أريته إلا قد رأيته في مقامي هذا حتى الجنة والنار، وإنه قد أوحي إلى أنكم تفتنون في القبور مثل  أو قريب من  فتنة المسيح الدجال، يؤتى أحدكم، فيقال له ما علمك بهذا الرجل فأما المؤمن  أو قال الموقن شك هشام  فيقول هو رسول الله، هو محمد صلى الله عليه وسلم جاءنا بالبينات والهدى فآمنا وأجبنا واتبعنا وصدقنا‏.‏ فيقال له نم صالحا، قد كنا نعلم إن كنت لتؤمن به‏.‏ وأما المنافق  أو قال المرتاب شك هشام  فيقال له ما علمك بهذا الرجل فيقول لا أدري، سمعت الناس يقولون شيئا فقلته ‏\"‏‏.‏ قال هشام فلقد قالت لي فاطمة فأوعيته، غير أنها ذكرت ما يغلظ عليه‏.‏",
      "text_en": " Narrated Fatima bint Al-Mundhir:                     Asma' bint Abi Bakr As-Siddiq said, \"I went to 'Aishah and the people were offering Salat. I asked her, 'What is wrong with the people ?' She pointed towards the sky with her head. I asked her, 'Is there a sign ?' 'Aishah nodded with her head meaning 'Yes'.\" Asma' added, \"Allah's Messenger () prolonged the Salat to such an extent that I fainted. There was a waterskin by my side and I opened it and poured some water on my head. When Allah's Messenger () finished Salat, and the solar eclipse had cleared, the Prophet () addressed the people and praised Allah as He deserves and said, 'Amma ba'du'.\" Asma' further said, \"Some Ansari women started talking, so I turned to them in order to make them quiet. I asked 'Aishah what the Prophet () had said. 'Aishah said: 'He said, 'I have seen things at this place of mine which were never shown to me before; (I have seen) even Paradise and Hell. And, no doubt it has been revealed to me that you (people) will be put in trial in your graves like or nearly like the trial of Masih Ad-Dajjal. (The angels) will come to everyone of you and ask him, 'What do you know about this man (Prophet Muhammad ()) ?\" The faithful believer or firm believer (Hisham was in doubt which word the Prophet () used), will say, 'He is Allah's Messenger () and he is Muhammad () who came to us with clear evidences and guidance. So we believed him, accepted his teachings and followed and trusted his teaching.' Then the angels will tell him to sleep (in peace) as they have come to know that he was a believer. But the hypocrite or a doubtful person (Hisham is not sure as to which word the Prophet () used), will be asked what he knew about this man (Prophet Muhammed ()). He will say, 'I do not know but I heard the people saying something (about him) so I said the same' \" Hisham added, \"Fatima told me that she remembered that narration completely by heart except that she said about the hypocrite or a doubtful person that he will be punished severely.\"",
      "chain": [
        "30277",
        "20318",
        "11065",
        "10526",
        "70"
      ]
    },
    {
      "hadith_no": "1053",
      "source": " Sahih Bukhari ",
      "chapter": "Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن هشام بن عروة، عن امرأته، فاطمة بنت المنذر عن أسماء بنت أبي بكر  رضى الله عنهما  أنها قالت أتيت عائشة  رضى الله عنها  زوج النبي صلى الله عليه وسلم حين خسفت الشمس، فإذا الناس قيام يصلون، وإذا هي قائمة تصلي فقلت ما للناس فأشارت بيدها إلى السماء، وقالت سبحان الله‏.‏ فقلت آية فأشارت أى نعم‏.‏ قالت فقمت حتى تجلاني الغشى، فجعلت أصب فوق رأسي الماء، فلما انصرف رسول الله صلى الله عليه وسلم حمد الله وأثنى عليه ثم قال ‏\"‏ ما من شىء كنت لم أره إلا قد رأيته في مقامي هذا حتى الجنة والنار، ولقد أوحي إلى أنكم تفتنون في القبور مثل  أو قريبا من  فتنة الدجال  لا أدري أيتهما قالت أسماء  يؤتى أحدكم فيقال له ما علمك بهذا الرجل فأما المؤمن  أو الموقن لا أدري أى ذلك قالت أسماء  فيقول محمد رسول الله صلى الله عليه وسلم جاءنا بالبينات والهدى، فأجبنا وآمنا واتبعنا‏.‏ فيقال له نم صالحا، فقد علمنا إن كنت لموقنا‏.‏ وأما المنافق  أو المرتاب لا أدري أيتهما قالت أسماء  فيقول لا أدري، سمعت الناس يقولون شيئا فقلته ‏\"‏‏.‏",
      "text_en": " Narrated Fatima bint Al-Mundhir:                     Asma' bint Al Bakr said, \"I came to `Aisha the wife of the Prophet (p.b.u.h) during the solar eclipse. The people were standing and offering the prayer and she was also praying too. I asked her, 'What has happened to the people?' She pointed out with her hand towards the sky and said, 'Subhan-Allah'. I said, 'Is there a sign?' She pointed out in the affirmative.\" Asma' further said, \"I too then stood up for the prayer till I fainted and then poured water on my head. When Allah's Apostle had finished his prayer, he thanked and praised Allah and said, 'I have seen at this place of mine what I have never seen even Paradise and Hell. No doubt, it has been inspired to me that you will be put to trial in the graves like or nearly like the trial of (Masih) Ad-Dajjal. (I do not know which one of the two Asma' said.) (The angels) will come to everyone of you and will ask what do you know about this man (i.e. Muhammad). The believer or a firm believer (I do not know which word Asma' said) will reply, 'He is Muhammad, Allah's Apostle (p.b.u.h) who came to us with clear evidences and guidance, so we accepted his teachings, believed and followed him.' The angels will then say to him, 'Sleep peacefully as we knew surely that you were a firm believer.' The hypocrite or doubtful person (I do not know which word Asma' said) will say, 'I do not know. I heard the people saying something so I said it (the same).' \"",
      "chain": [
        "30355",
        "20001",
        "11065",
        "70"
      ]
    },
    {
      "hadith_no": "1054",
      "source": " Sahih Bukhari ",
      "chapter": "Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "حدثنا ربيع بن يحيى، قال حدثنا زائدة، عن هشام، عن فاطمة، عن أسماء، قالت لقد أمر النبي صلى الله عليه وسلم بالعتاقة في كسوف الشمس‏.‏",
      "text_en": " Narrated Asma:                     No doubt the Prophet ordered people to manumit slaves during the solar eclipse.",
      "chain": [
        "30133",
        "20320",
        "11065",
        "10526",
        "70"
      ]
    },
    {
      "hadith_no": "1061",
      "source": " Sahih Bukhari ",
      "chapter": "Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "وقال أبو أسامة حدثنا هشام، قال أخبرتني فاطمة بنت المنذر، عن أسماء، قالت فانصرف رسول الله صلى الله عليه وسلم وقد تجلت الشمس فخطب، فحمد الله بما هو أهله ثم قال ‏\"‏ أما بعد ‏\"‏‏.‏",
      "text_en": " And this was narrated by Asma' who said, \"Allah's Messenger () finished the eclipse prayer and by then the sun (eclipse) had cleared. Then he delivered the Khutba (religious talk) and praised Allah as He deserved and then said Amma ba'du.\"",
      "chain": [
        "20318",
        "11065",
        "10526",
        "70"
      ]
    },
    {
      "hadith_no": "1235",
      "source": " Sahih Bukhari ",
      "chapter": "Forgetfulness in Prayer - كتاب السهو",
      "chapter_no": "22",
      "text_ar": "حدثنا يحيى بن سليمان، قال حدثني ابن وهب، حدثنا الثوري، عن هشام، عن فاطمة، عن أسماء، قالت دخلت على عائشة  رضى الله عنها  وهي تصلي قائمة والناس قيام فقلت ما شأن الناس فأشارت برأسها إلى السماء‏.‏ فقلت آية‏.‏ فقالت برأسها أى نعم‏.‏",
      "text_en": " Narrated Asma':                     I went to `Aisha and she was standing praying and the people, too, were standing (praying). So I said, \"What is the matter with the people?\" She beckoned with her head towards the sky. I said, \"(Is there) a sign?\" She nodded intending to say, \"Yes.\"",
      "chain": [
        "30220",
        "20029",
        "20012",
        "11065",
        "10526",
        "70"
      ]
    },
    {
      "hadith_no": "1373",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا يحيى بن سليمان، حدثنا ابن وهب، قال أخبرني يونس، عن ابن شهاب، أخبرني عروة بن الزبير، أنه سمع أسماء بنت أبي بكر  رضى الله عنهما  تقول قام رسول الله صلى الله عليه وسلم خطيبا فذكر فتنة القبر التي يفتتن فيها المرء، فلما ذكر ذلك ضج المسلمون ضجة‏.‏",
      "text_en": " Narrated Asma' bint Abi Bakr:                     Allah's Apostle once stood up delivering a sermon and mentioned the trial which people will face in the grave. When he mentioned that, the Muslims started shouting loudly.",
      "chain": [
        "30220",
        "20029",
        "20475",
        "11013",
        "10511",
        "70"
      ]
    },
    {
      "hadith_no": "1454",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا صدقة بن الفضل، أخبرنا عبدة، عن هشام، عن فاطمة، عن أسماء  رضى الله عنها  قالت قال لي النبي صلى الله عليه وسلم ‏\"‏ لا توكي فيوكى عليك ‏\"‏‏.‏ حدثنا عثمان بن أبي شيبة، عن عبدة، وقال، ‏\"‏ لا تحصي فيحصي الله عليك ‏\"‏",
      "text_en": " Narrated Asma:                     The Prophet said to me, \"Do not withhold your money, (for if you did so) Allah would withhold His blessings from you.\"Narrated `Abda:The Prophet said, \"Do not withhold your money by counting it (i.e. hoarding it), (for if you did so), Allah would also withhold His blessings from you.\"",
      "chain": [
        "30343",
        "20337",
        "11065",
        "10526",
        "70"
      ]
    },
    {
      "hadith_no": "1456",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا أبو عاصم، عن ابن جريج، وحدثني محمد بن عبد الرحيم، عن حجاج بن محمد، عن ابن جريج، قال أخبرني ابن أبي مليكة، عن عباد بن عبد الله بن الزبير، أخبره عن أسماء بنت أبي بكر  رضى الله عنهما  أنها جاءت إلى النبي صلى الله عليه وسلم فقال ‏\"‏ لا توعي فيوعي الله عليك، ارضخي ما استطعت ‏\"‏‏.‏",
      "text_en": " Narrated Asma' bint Abu Bakr:                     that she had gone to the Prophet and he said, \"Do not shut your money bag; otherwise Allah too will withhold His blessings from you. Spend (in Allah's Cause) as much as you can afford. \"",
      "chain": [
        "20241",
        "11070",
        "30272",
        "20381",
        "11070",
        "11090",
        "11250",
        "70"
      ]
    },
    {
      "hadith_no": "1705",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا مسدد، عن يحيى، عن ابن جريج، قال حدثني عبد الله، مولى أسماء عن أسماء، أنها نزلت ليلة جمع عند المزدلفة، فقامت تصلي، فصلت ساعة، ثم قالت يا بنى هل غاب القمر قلت لا‏.‏ فصلت ساعة، ثم قالت هل غاب القمر قلت نعم‏.‏ قالت فارتحلوا‏.‏ فارتحلنا، ومضينا حتى رمت الجمرة، ثم رجعت فصلت الصبح في منزلها‏.‏ فقلت لها يا هنتاه ما أرانا إلا قد غلسنا‏.‏ قالت يا بنى، إن رسول الله صلى الله عليه وسلم أذن للظعن‏.‏",
      "text_en": " Narrated `Abdullah:                     (the slave of Asma') During the night of Jam', Asma' got down at Al-Muzdalifa and stood up for (offering) the prayer and offered the prayer for some time and then asked, \"O my son! Has the moon set?\" I replied in the negative and she again prayed for another period and then asked, \"Has the moon set?\" I replied, \"Yes.\" So she said that we should set out (for Mina), and we departed and went on till she threw pebbles at the Jamra (Jamrat-Al-`Aqaba) and then she returned to her dwelling place and offered the morning prayer. I asked her, \"O you! I think we have come (to Mina) early in the night.\" She replied, \"O my son! Allah's Apostle gave permission to the women to do so.\"",
      "chain": [
        "30175",
        "20031",
        "11070",
        "70"
      ]
    },
    {
      "hadith_no": "1959",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثني عبد الله بن أبي شيبة، حدثنا أبو أسامة، عن هشام بن عروة، عن فاطمة، عن أسماء بنت أبي بكر  رضى الله عنهما  قالت أفطرنا على عهد النبي صلى الله عليه وسلم يوم غيم، ثم طلعت الشمس‏.‏ قيل لهشام فأمروا بالقضاء قال بد من قضاء‏.‏ وقال معمر سمعت هشاما لا أدري أقضوا أم لا‏.‏",
      "text_en": " Narrated Abu Usama from Hisham bin 'Ursa from Fatima:                     Asma bint Abi Bakr said, \"We broke our fast during the lifetime of the Prophet on a cloudy day and then the sun appeared.\" Hisham was asked, \"Were they ordered to fast in lieu of that day?\" He replied, \"It had to be made up for.\" Ma`mar said, \"I heard Hisham saying, \"I don't know whether they fasted in lieu of that day or not.\"",
      "chain": [
        "30201",
        "20318",
        "11065",
        "10526",
        "70"
      ]
    },
    {
      "hadith_no": "2364",
      "source": " Sahih Bukhari ",
      "chapter": "Distribution of Water - كتاب المساقاة",
      "chapter_no": "42",
      "text_ar": "حدثنا ابن أبي مريم، حدثنا نافع بن عمر، عن ابن أبي مليكة، عن أسماء بنت أبي بكر  رضى الله عنهما  أن النبي صلى الله عليه وسلم صلى صلاة الكسوف، فقال ‏\"‏ دنت مني النار حتى قلت أى رب، وأنا معهم فإذا امرأة  حسبت أنه قال  تخدشها هرة قال ما شأن هذه قالوا حبستها حتى ماتت جوعا ‏\"‏‏.‏",
      "text_en": " Narrated Asma' bint Abi Bakr:                     The Prophet prayed the eclipse prayer, and then said, \"Hell was displayed so close that I said, 'O my Lord ! Am I going to be one of its inhabitants?\"' Suddenly he saw a woman. I think he said, who was being scratched by a cat. He said, \"What is wrong with her?\" He was told, \"She had imprisoned it (i.e. the cat) till it died of hunger.\"",
      "chain": [
        "30232",
        "20203",
        "11090",
        "70"
      ]
    },
    {
      "hadith_no": "2519",
      "source": " Sahih Bukhari ",
      "chapter": "Manumission of Slaves - كتاب العتق",
      "chapter_no": "49",
      "text_ar": "حدثنا موسى بن مسعود، حدثنا زائدة بن قدامة، عن هشام بن عروة، عن فاطمة بنت المنذر، عن أسماء بنت أبي بكر  رضى الله عنهما  قالت أمر النبي صلى الله عليه وسلم بالعتاقة في كسوف الشمس‏.‏ تابعه علي عن الدراوردي عن هشام‏.‏",
      "text_en": " Narrated Asma' bint Abu Bakr:                     The Prophet ordered us to free slaves at the time of solar eclipses.",
      "chain": [
        "20290",
        "20320",
        "11065",
        "10526",
        "70"
      ]
    },
    {
      "hadith_no": "2520",
      "source": " Sahih Bukhari ",
      "chapter": "Manumission of Slaves - كتاب العتق",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن أبي بكر، حدثنا عثام، حدثنا هشام، عن فاطمة بنت المنذر، عن أسماء بنت أبي بكر  رضى الله عنهما  قالت كنا نؤمر عند الخسوف بالعتاقة‏.‏",
      "text_en": " Narrated Asma' bint Abu Bakr:                     We were ordered to free slaves at the time of lunar eclipses.",
      "chain": [
        "30161",
        "20295",
        "10526",
        "70"
      ]
    },
    {
      "hadith_no": "2590",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا أبو عاصم، عن ابن جريج، عن ابن أبي مليكة، عن عباد بن عبد الله، عن أسماء  رضى الله عنها  قالت قلت يا رسول الله ما لي مال إلا ما أدخل على الزبير فأتصدق‏.‏ قال ‏\"‏ تصدقي، ولا توعي فيوعى عليك ‏\"‏‏.‏",
      "text_en": " Narrated Asma:                     Once I said, \"O Allah's Apostle! I have no property except what has been given to me by Az-Zubair (i.e. her husband). May I give in charity?\" The Prophet said, \"Give in charity and do not withhold it; otherwise Allah will withhold it back from you . \"",
      "chain": [
        "20241",
        "11070",
        "11090",
        "70"
      ]
    },
    {
      "hadith_no": "2591",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا عبيد الله بن سعيد، حدثنا عبد الله بن نمير، حدثنا هشام بن عروة، عن فاطمة، عن أسماء، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أنفقي ولا تحصي فيحصي الله عليك، ولا توعي فيوعي الله عليك ‏\"‏‏.‏",
      "text_en": " Narrated Asma:                     Allah's Apostle said, \"Give (in charity) and do not give reluctantly lest Allah should give you in a limited amount; and do not withhold your money lest Allah should withhold it from you.\"",
      "chain": [
        "30359",
        "20331",
        "11065",
        "10526",
        "70"
      ]
    },
    {
      "hadith_no": "2620",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا عبيد بن إسماعيل، حدثنا أبو أسامة، عن هشام، عن أبيه، عن أسماء بنت أبي بكر  رضى الله عنهما  قالت قدمت على أمي وهى مشركة، في عهد رسول الله صلى الله عليه وسلم، فاستفتيت رسول الله صلى الله عليه وسلم قلت ‏{‏إن أمي قدمت‏}‏ وهى راغبة، أفأصل أمي قال ‏\"‏ نعم صلي أمك ‏\"‏‏.‏",
      "text_en": " Narrated Asma' bint Abu Bakr:                     My mother came to me during the lifetime of Allah's Apostle and she was a pagan. I said to Allah's Apostle (seeking his verdict), \"My mother has come to me and she desires to receive a reward from me, shall I keep good relations with her?\" The Prophet said, \"Yes, keep good relation with her. \"",
      "chain": [
        "30360",
        "20318",
        "11065",
        "10511",
        "70"
      ]
    },
    {
      "hadith_no": "2979",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عبيد بن إسماعيل، حدثنا أبو أسامة، عن هشام، قال أخبرني أبي و، حدثتني أيضا، فاطمة عن أسماء  رضى الله عنها  قالت صنعت سفرة رسول الله صلى الله عليه وسلم في بيت أبي بكر حين أراد أن يهاجر إلى المدينة، قالت فلم نجد لسفرته ولا لسقائه ما نربطهما به، فقلت لأبي بكر والله ما أجد شيئا أربط به إلا نطاقي‏.‏ قال فشقيه باثنين، فاربطيه بواحد السقاء وبالآخر السفرة‏.‏ ففعلت، فلذلك سميت ذات النطاقين‏.‏",
      "text_en": " Narrated Asma:                     I prepared the journey-food for Allah's Apostle in Abu Bakr's house when he intended to emigrate to Medina. I could not find anything to tie the food-container and the water skin with. So, I said to Abu Bakr, \"By Allah, I do not find anything to tie (these things) with except my waist belt.\" He said, \"Cut it into two pieces and tie the water-skin with one piece and the food-container with the other (the subnarrator added, \"She did accordingly and that was the reason for calling her Dhatun-Nitaqain (i.e. twobelted woman)).",
      "chain": [
        "30360",
        "20318",
        "11065",
        "70"
      ]
    },
    {
      "hadith_no": "3151",
      "source": " Sahih Bukhari ",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو أسامة، حدثنا هشام، قال أخبرني أبي، عن أسماء ابنة أبي بكر  رضى الله عنهما  قالت كنت أنقل النوى من أرض الزبير التي أقطعه رسول الله صلى الله عليه وسلم على رأسي، وهى مني على ثلثى فرسخ‏.‏ وقال أبو ضمرة عن هشام عن أبيه أن النبي صلى الله عليه وسلم أقطع الزبير أرضا من أموال بني النضير‏.‏",
      "text_en": " Narrated Asma bint Abu Bakr:                     I used to carry the date stones on my head from the land of Az-Zubair which Allah's Apostle had given to him, and it was at a distance of 2/3 of a Farsakh from my house. Narrated Hisham's father: The Prophet gave Az-Zubair a piece of land from the property of Bani An- Nadir (gained as war booty).",
      "chain": [
        "30277",
        "20318",
        "11065",
        "10511",
        "70"
      ]
    },
    {
      "hadith_no": "3183",
      "source": " Sahih Bukhari ",
      "chapter": "Jizyah and Mawaada'ah - كتاب الجزية والموادعة",
      "chapter_no": "58",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا حاتم، عن هشام بن عروة، عن أبيه، عن أسماء ابنة أبي بكر  رضى الله عنهما  قالت قدمت على أمي وهى مشركة في عهد قريش، إذ عاهدوا رسول الله صلى الله عليه وسلم ومدتهم، مع أبيها، فاستفتت رسول الله صلى الله عليه وسلم فقالت يا رسول الله، إن أمي قدمت على، وهى راغبة، أفأصلها قال ‏\"‏ نعم، صليها ‏\"‏‏.‏",
      "text_en": " Narrated Asma 'bint Abi Bakr:                     During the period of the peace treaty of Quraish with Allah's Apostle, my mother, accompanied by her father, came to visit me, and she was a pagan. I consulted Allah's Apostle, \"O Allah's Apostle! My mother has come to me and she desires to receive a reward from me, shall I keep good relation with her?\" He said, \"Yes, keep good relation with her.\"",
      "chain": [
        "30367",
        "20159",
        "11065",
        "10511",
        "70"
      ]
    },
    {
      "hadith_no": "3876",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "وقال الليث كتب إلى هشام عن أبيه، عن أسماء بنت أبي بكر  رضى الله عنهما  قالت رأيت زيد بن عمرو بن نفيل قائما مسندا ظهره إلى الكعبة يقول يا معاشر قريش، والله ما منكم على دين إبراهيم غيري، وكان يحيي الموءودة، يقول للرجل إذا أراد أن يقتل ابنته لا تقتلها، أنا أكفيكها مئونتها‏.‏ فيأخذها فإذا ترعرعت قال لأبيها إن شئت دفعتها إليك، وإن شئت كفيتك مئونتها‏.‏",
      "text_en": "    Narrated Asma bint Abi Bakr:                      I saw Zaid bin Amr bin Nufail standing with his back against the Ka'ba and saying, \"O people of Quraish! By Allah, none amongst you is on the religion of Abraham except me.\" He used to preserve the lives of little girls: If somebody wanted to kill his daughter he would say to him, \"Do not kill her for I will feed her on your behalf.\" So he would take her, and when she grew up nicely, he would say to her father, \"Now if you want her, I will give her to you, and if you wish, I will feed her on your behalf.\"",
      "chain": [
        "20023",
        "11065",
        "10511",
        "70"
      ]
    },
    {
      "hadith_no": "3955",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا عبد الله بن أبي شيبة، حدثنا أبو أسامة، حدثنا هشام، عن أبيه، وفاطمة، عن أسماء، رضى الله عنها صنعت سفرة للنبي صلى الله عليه وسلم وأبي بكر حين أرادا المدينة، فقلت لأبي ما أجد شيئا أربطه إلا نطاقي‏.‏ قال فشقيه‏.‏ ففعلت، فسميت ذات النطاقين‏.‏",
      "text_en": " Narrated Asma:                     I prepared the journey food for the Prophet and Abu Bakr when they wanted (to migrate to) Medina. I said to my father (Abu Bakr), \"I do not have anything to tie the container of the journey food with except my waist belt.\" He said, \"Divide it lengthwise into two.\" I did so, and for this reason I was named 'Dhat-un-Nitaqain' (i.e. the owner of two belts). (Ibn `Abbas said, \"Asma', Dhat-un-Nitaq.\")",
      "chain": [
        "30201",
        "20318",
        "11065",
        "10511",
        "10526",
        "70"
      ]
    },
    {
      "hadith_no": "3957",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثني زكرياء بن يحيى، عن أبي أسامة، عن هشام بن عروة، عن أبيه، عن أسماء  رضى الله عنها  أنها حملت بعبد الله بن الزبير، قالت فخرجت وأنا متم، فأتيت المدينة، فنزلت بقباء، فولدته بقباء، ثم أتيت به النبي صلى الله عليه وسلم فوضعته في حجره، ثم دعا بتمرة، فمضغها، ثم تفل في فيه، فكان أول شىء دخل جوفه ريق رسول الله صلى الله عليه وسلم، ثم حنكه بتمرة ثم دعا له وبرك عليه، وكان أول مولود ولد في الإسلام‏.‏ تابعه خالد بن مخلد عن علي بن مسهر عن هشام عن أبيه عن أسماء  رضى الله عنها  أنها هاجرت إلى النبي صلى الله عليه وسلم وهى حبلى‏.‏",
      "text_en": " Narrated Asma:                     That she conceived `Abdullah bin Az-Zubair. She added, \"I migrated to Medina while I was at full term of pregnancy and alighted at Quba where I gave birth to him. Then I brought him to the Prophet and put him in his lap. The Prophet asked for a date, chewed it, and put some of its juice in the child's mouth. So, the first thing that entered the child's stomach was the saliva of Allah's Apostle. Then the Prophet rubbed the child's palate with a date and invoked for Allah's Blessings on him, and he was the first child born amongst the Emigrants in the Islamic Land (i.e. Medina).",
      "chain": [
        "30193",
        "20318",
        "11065",
        "10511",
        "70"
      ]
    },
    {
      "hadith_no": "5274",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن هشام، عن فاطمة، عن أسماء، عن النبي صلى الله عليه وسلم‏.‏ حدثني محمد بن المثنى، حدثنا يحيى، عن هشام، حدثتني فاطمة، عن أسماء، أن امرأة، قالت يا رسول الله إن لي ضرة، فهل على جناح إن تشبعت من زوجي غير الذي يعطيني فقال رسول الله صلى الله عليه وسلم ‏\"‏ المتشبع بما لم يعط كلابس ثوبى زور ‏\"‏‏.‏",
      "text_en": " Narrated Asma:                     Some lady said, \"O Allah's Apostle! My husband has another wife, so it is sinful of me to claim that he has given me what he has not given me (in order to tease her)?\" Allah's Apostle said, The one who pretends that he has been given what he has not been given, is just like the (false) one who wears two garments of falsehood.\"",
      "chain": [
        "20193",
        "20022",
        "11065",
        "10526",
        "70"
      ]
    },
    {
      "hadith_no": "5279",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا محمود، حدثنا أبو أسامة، حدثنا هشام، قال أخبرني أبي، عن أسماء بنت أبي بكر  رضى الله عنهما  قالت تزوجني الزبير، وما له في الأرض من مال، ولا مملوك، ولا شىء غير ناضح، وغير فرسه، فكنت أعلف فرسه، وأستقي الماء، وأخرز غربه وأعجن، ولم أكن أحسن أخبز، وكان يخبز جارات لي من الأنصار وكن نسوة صدق، وكنت أنقل النوى من أرض الزبير التي أقطعه رسول الله صلى الله عليه وسلم على رأسي، وهى مني على ثلثى فرسخ، فجئت يوما والنوى على رأسي فلقيت رسول الله صلى الله عليه وسلم ومعه نفر من الأنصار فدعاني ثم قال ‏\"‏ إخ إخ ‏\"‏‏.‏ ليحملني خلفه، فاستحييت أن أسير مع الرجال، وذكرت الزبير وغيرته، وكان أغير الناس، فعرف رسول الله صلى الله عليه وسلم أني قد استحييت فمضى، فجئت الزبير فقلت لقيني رسول الله صلى الله عليه وسلم وعلى رأسي النوى، ومعه نفر من أصحابه، فأناخ لأركب، فاستحييت منه وعرفت غيرتك‏.‏ فقال والله لحملك النوى كان أشد على من ركوبك معه‏.‏ قالت حتى أرسل إلى أبو بكر بعد ذلك بخادم يكفيني سياسة الفرس، فكأنما أعتقني‏.‏",
      "text_en": " Narrated Asma' bint Abu Bakr:                     When Az-Zubair married me, he had no real property or any slave or anything else except a camel which drew water from the well, and his horse. I used to feed his horse with fodder and drew water and sew the bucket for drawing it, and prepare the dough, but I did not know how to bake bread. So our Ansari neighbors used to bake bread for me, and they were honorable ladies. I used to carry the date stones on my head from Zubair's land given to him by Allah's Apostle and this land was two third Farsakh (about two miles) from my house. One day, while I was coming with the date stones on my head, I met Allah's Apostle along with some Ansari people. He called me and then, (directing his camel to kneel down) said, \"Ikh! Ikh!\" so as to make me ride behind him (on his camel). I felt shy to travel with the men and remembered Az-Zubair and his sense of Ghira, as he was one of those people who had the greatest sense of Ghira. Allah's Apostle noticed that I felt shy, so he proceeded. I came to Az-Zubair and said, \"I met Allah's Apostle while I was carrying a load of date stones on my head, and he had some companions with him. He made his camel kneel down so that I might ride, but I felt shy in his presence and remembered your sense of Ghira (See the glossary). On that Az-Zubair said, \"By Allah, your carrying the date stones (and you being seen by the Prophet in such a state) is more shameful to me than your riding with him.\" (I continued serving in this way) till Abu Bakr sent me a servant to look after the horse, whereupon I felt as if he had set me free.",
      "chain": [
        "30277",
        "20318",
        "11065",
        "10511",
        "70"
      ]
    },
    {
      "hadith_no": "5525",
      "source": " Sahih Bukhari ",
      "chapter": "Sacrifice on Occasion of Birth (`Aqiqa) - كتاب العقيقة",
      "chapter_no": "71",
      "text_ar": "حدثنا إسحاق بن نصر، حدثنا أبو أسامة، حدثنا هشام بن عروة، عن أبيه، عن أسماء بنت أبي بكر  رضى الله عنهما  أنها حملت بعبد الله بن الزبير بمكة قالت فخرجت وأنا متم، فأتيت المدينة فنزلت قباء فولدت بقباء، ثم أتيت به رسول الله صلى الله عليه وسلم فوضعته في حجره، ثم دعا بتمرة فمضغها، ثم تفل في فيه فكان أول شىء دخل جوفه ريق رسول الله صلى الله عليه وسلم ثم حنكه بالتمرة، ثم دعا له فبرك عليه، وكان أول مولود ولد في الإسلام، ففرحوا به فرحا شديدا، لأنهم قيل لهم إن اليهود قد سحرتكم فلا يولد لكم‏.‏",
      "text_en": " Narrated Asma' bint Abu Bakr:                     I conceived `Abdullah bin AzZubair at Mecca and went out (of Mecca) while I was about to give birth. I came to Medina and encamped at Quba', and gave birth at Quba'. Then I brought the child to Allah's Apostle and placed it (on his lap). He asked for a date, chewed it, and put his saliva in the mouth of the child. So the first thing to enter its stomach was the saliva of Allah's Apostle. Then he did its Tahnik with a date, and invoked Allah to bless him. It was the first child born in the Islamic era, therefore they (Muslims) were very happy with its birth, for it had been said to them that the Jews had bewitched them, and so they would not produce any offspring.",
      "chain": [
        "30311",
        "20318",
        "11065",
        "10511",
        "70"
      ]
    },
    {
      "hadith_no": "5568",
      "source": " Sahih Bukhari ",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا خلاد بن يحيى، حدثنا سفيان، عن هشام بن عروة، قال أخبرتني فاطمة بنت المنذر، امرأتي عن أسماء بنت أبي بكر  رضى الله عنهما  قالت نحرنا على عهد النبي صلى الله عليه وسلم فرسا فأكلناه‏.‏",
      "text_en": " Narrated Asma bint Abu Bakr:                     We slaughtered a horse (by Nahr) during the lifetime of the Prophet and ate it.",
      "chain": [
        "20191",
        "20012",
        "11065",
        "10526",
        "70"
      ]
    },
    {
      "hadith_no": "5569",
      "source": " Sahih Bukhari ",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا إسحاق، سمع عبدة، عن هشام، عن فاطمة، عن أسماء، قالت ذبحنا على عهد رسول الله صلى الله عليه وسلم فرسا ونحن بالمدينة فأكلناه‏.‏",
      "text_en": " Narrated Asma':                     We slaughtered a horse (by Dhabh) during the lifetime of Allah's Apostle while we were at Medina, and we ate it.",
      "chain": [
        "30021",
        "20337",
        "11065",
        "10526",
        "70"
      ]
    },
    {
      "hadith_no": "5570",
      "source": " Sahih Bukhari ",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا قتيبة، حدثنا جرير، عن هشام، عن فاطمة بنت المنذر، أن أسماء بنت أبي بكر، قالت نحرنا على عهد رسول الله صلى الله عليه وسلم فرسا فأكلناه‏.‏ تابعه وكيع وابن عيينة عن هشام في النحر‏.‏",
      "text_en": " Narrated Asma' bint Abu Bakr:                     We slaughtered a horse (by Nahr) during the lifetime of Allah's Apostle and ate it.",
      "chain": [
        "30367",
        "20028",
        "20295",
        "10526",
        "70"
      ]
    },
    {
      "hadith_no": "5578",
      "source": " Sahih Bukhari ",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، حدثنا هشام، عن فاطمة، عن أسماء، قالت نحرنا فرسا على عهد رسول الله صلى الله عليه وسلم فأكلناه‏.‏",
      "text_en": " Narrated Asma':                     We slaughtered a horse during the lifetime of Allah's Apostle and ate it.",
      "chain": [
        "30418",
        "20005",
        "11065",
        "10526",
        "70"
      ]
    },
    {
      "hadith_no": "5783",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن هشام، عن فاطمة بنت المنذر، أن أسماء بنت أبي بكر  رضى الله عنهما  كانت إذا أتيت بالمرأة قد حمت تدعو لها، أخذت الماء فصبته بينها وبين جيبها قالت وكان رسول الله صلى الله عليه وسلم يأمرنا أن نبردها بالماء‏.‏",
      "text_en": " Narrated Fatima bint Al-Mundhir:                     Whenever a lady suffering from fever was brought to Asma' bint Abu Bakr, she used to invoke Allah for her and then sprinkle some water on her body, at the chest and say, \"Allah's Apostle used to order us to abate fever with water.\"",
      "chain": [
        "20164",
        "20001",
        "11065",
        "10526",
        "70"
      ]
    },
    {
      "hadith_no": "5998",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثني أحمد بن المقدام، حدثنا فضيل بن سليمان، حدثنا منصور بن عبد الرحمن، قال حدثتني أمي، عن أسماء بنت أبي بكر  رضى الله عنهما  أن امرأة، جاءت إلى رسول الله صلى الله عليه وسلم فقالت إني أنكحت ابنتي، ثم أصابها شكوى فتمرق رأسها، وزوجها يستحثني بها أفأصل رأسها فسب رسول الله صلى الله عليه وسلم الواصلة والمستوصلة‏.‏",
      "text_en": " Narrated Asma:                     (the daughter of Abu' Bakr) A woman came to Allah's Apostle and said, \"I married my daughter to someone, but she became sick and all her hair fell out, and (because of that) her husband does not like her. May I let her use false hair?\" On that the Prophet cursed such a lady as artificially lengthening (her or someone else's) hair or got her hair lengthened artificially.",
      "chain": [
        "30121",
        "20271",
        "11565",
        "2802",
        "70"
      ]
    },
    {
      "hadith_no": "5999",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا آدم، حدثنا شعبة، عن هشام بن عروة، عن امرأته، فاطمة عن أسماء بنت أبي بكر، قالت لعن النبي صلى الله عليه وسلم الواصلة والمستوصلة‏.‏",
      "text_en": " Narrated Asma':                     (the daughter of Abu Bakr) Allah's Apostle has cursed such a lady as artificially lengthening (her or someone else's) hair or gets her hair lengthened.",
      "chain": [
        "20404",
        "20020",
        "11065",
        "70"
      ]
    },
    {
      "hadith_no": "6004",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، حدثنا هشام، أنه سمع فاطمة بنت المنذر، تقول سمعت أسماء، قالت سألت امرأة النبي صلى الله عليه وسلم فقالت يا رسول الله إن ابنتي أصابتها الحصبة، فامرق شعرها، وإني زوجتها أفأصل فيه فقال ‏\"‏ لعن الله الواصلة والموصولة ‏\"‏‏.‏",
      "text_en": " Narrated Asma':                     A woman asked the Prophet saying, \"0 Allah's Apostle! My daughter got measles and her hair fell out. Now that I got her married, may I let her use false hair?\" He said (to her), \"Allah has cursed the lady who lengthens hair artificially and the one who gets her hair lengthened artificially.\"",
      "chain": [
        "30418",
        "20005",
        "11065",
        "10526",
        "70"
      ]
    },
    {
      "hadith_no": "6044",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، حدثنا هشام بن عروة، أخبرني أبي، أخبرتني أسماء ابنة أبي بكر  رضى الله عنهما  قالت أتتني أمي راغبة في عهد النبي صلى الله عليه وسلم فسألت النبي صلى الله عليه وسلم آصلها قال ‏\"‏ نعم ‏\"‏‏.‏ قال ابن عيينة فأنزل الله تعالى فيها ‏{‏لا ينهاكم الله عن الذين لم يقاتلوكم في الدين‏}‏",
      "text_en": " Narrated Asma' bint Abu Bakr:                     My mother came to me, hoping (for my favor) during the lifetime of the Prophet asked the Prophet, \"May I treat her kindly?\" He replied, \"Yes.\" Ibn 'Uyaina said, \"Then Allah revealed: 'Allah forbids you not with regards to those who fought not against you because of religion, and drove you not out from your homes, that you should show them kindness and deal justly with them.'.......(60.8)",
      "chain": [
        "30418",
        "20005",
        "11065",
        "10511",
        "70"
      ]
    },
    {
      "hadith_no": "6045",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "وقال الليث حدثني هشام، عن عروة، عن أسماء، قالت قدمت أمي وهى مشركة في عهد قريش ومدتهم، إذ عاهدوا النبي صلى الله عليه وسلم مع أبيها، فاستفتيت النبي صلى الله عليه وسلم فقلت إن أمي قدمت وهى راغبة ‏{‏أفأصلها‏}‏ قال ‏\"‏ نعم صلي أمك ‏\"‏‏.‏",
      "text_en": "",
      "chain": [
        "20023",
        "11065",
        "10511",
        "70"
      ]
    },
    {
      "hadith_no": "6673",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا سعيد بن أبي مريم، عن نافع بن عمر، قال حدثني ابن أبي مليكة، عن أسماء بنت أبي بكر  رضى الله عنهما  قالت قال النبي صلى الله عليه وسلم ‏\"‏ إني على الحوض حتى أنظر من يرد على منكم، وسيؤخذ ناس دوني فأقول يا رب مني ومن أمتي‏.‏ فيقال هل شعرت ما عملوا بعدك والله ما برحوا يرجعون على أعقابهم ‏\"‏‏.‏ فكان ابن أبي مليكة يقول اللهم إنا نعوذ بك أن نرجع على أعقابنا أو نفتن عن ديننا‏.‏ ‏{‏أعقابكم تنكصون‏}‏ ترجعون على العقب‏.‏",
      "text_en": " Narrated Asma 'bint Abu Bakr:                     The Prophet said, \"I will be standing at the Lake-Fount so that I will see whom among you will come to me; and some people will be taken away from me, and I will say, 'O Lord, (they are) from me and from my followers.' Then it will be said, 'Did you notice what they did after you? By Allah, they kept on turning on their heels (turned as renegades).' \" The sub-narrator, Ibn Abi Mulaika said, \"O Allah, we seek refuge with You from turning on our heels, or being put to trial in our religion.\"",
      "chain": [
        "30232",
        "20203",
        "11090",
        "70"
      ]
    },
    {
      "hadith_no": "7135",
      "source": " Sahih Bukhari ",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا بشر بن السري، حدثنا نافع بن عمر، عن ابن أبي مليكة، قال قالت أسماء عن النبي صلى الله عليه وسلم قال ‏\"‏ أنا على، حوضي أنتظر من يرد على، فيؤخذ بناس من دوني فأقول أمتي‏.‏ فيقول لا تدري، مشوا على القهقرى ‏\"‏‏.‏ قال ابن أبي مليكة اللهم إنا نعوذ بك أن نرجع على أعقابنا أو نفتن‏.‏",
      "text_en": " Narrated Asma':                     The Prophet said, \"I will be at my Lake-Fount (Kauthar) waiting for whoever will come to me. Then some people will be taken away from me whereupon I will say, 'My followers!' It will be said, 'You do not know they turned Apostates as renegades (deserted their religion).'\" (Ibn Abi Mulaika said, \"Allah, we seek refuge with You from turning on our heels from the (Islamic) religion and from being put to trial\").",
      "chain": [
        "30026",
        "20190",
        "20203",
        "11090",
        "70"
      ]
    },
    {
      "hadith_no": "7373",
      "source": " Sahih Bukhari ",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن هشام بن عروة، عن فاطمة بنت المنذر، عن أسماء ابنة أبي بكر  رضى الله عنهما  أنها قالت أتيت عائشة حين خسفت الشمس، والناس قيام وهى قائمة تصلي فقلت ما للناس فأشارت بيدها نحو السماء فقالت سبحان الله‏.‏ فقلت آية‏.‏ قالت برأسها أن نعم‏.‏ فلما انصرف رسول الله صلى الله عليه وسلم حمد الله وأثنى عليه ثم قال ‏\"‏ ما من شىء لم أره إلا وقد رأيته في مقامي، حتى الجنة والنار، وأوحي إلى أنكم تفتنون في القبور قريبا من فتنة الدجال، فأما المؤمن  أو المسلم لا أدري أى ذلك قالت أسماء  فيقول محمد جاءنا بالبينات فأجبنا وآمنا‏.‏ فيقال نم صالحا علمنا أنك موقن‏.‏ وأما المنافق  أو المرتاب لا أدري أى ذلك قالت أسماء  فيقول لا أدري سمعت الناس يقولون شيئا فقلته ‏\"‏‏.‏",
      "text_en": " Narrated Asma' bint Abu Bakr:                     I came to `Aisha during the solar eclipse. The people were standing (offering prayer) and she too, was standing and offering prayer. I asked, \"What is wrong with the people?\" She pointed towards the sky with her hand and said, Subhan Allah!'' I asked her, \"Is there a sign?\" She nodded with her head meaning, yes. When Allah's Apostle finished (the prayer), he glorified and praised Allah and said, \"There is not anything that I have not seen before but I have seen now at this place of mine, even Paradise and Hell. It has been revealed to me that you people will be put to trial nearly like the trial of Ad-Dajjal, in your graves. As for the true believer or a Muslim (the sub-narrator is not sure as to which of the two (words Asma' had said) he will say, 'Muhammad came with clear signs from Allah, and we responded to him (accepted his teachings) and believed (what he said)' It will be said (to him) 'Sleep in peace; we have known that you were a true believer who believed with certainty.' As for a hypocrite or a doubtful person, (the sub-narrator is not sure as to which word Asma' said) he will say, 'I do not know, but I heard the people saying something and so I said the same.' \"",
      "chain": [
        "20164",
        "20001",
        "11065",
        "10526",
        "70"
      ]
    },
    {
      "hadith_no": "291",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، حدثنا هشام بن عروة، ح وحدثني محمد بن حاتم، - واللفظ له - حدثنا يحيى بن سعيد، عن هشام بن عروة، قال حدثتني فاطمة، عن أسماء، قالت جاءت امرأة إلى النبي صلى الله عليه وسلم فقالت إحدانا يصيب ثوبها من دم الحيضة كيف تصنع به قال ‏\"‏ تحته ثم تقرصه بالماء ثم تنضحه ثم تصلي فيه ‏\"‏ ‏.‏",
      "text_en": " Asma (daughter of Abu Bakr) reported:                      A woman came to the Apostle of Allah (may peace be upon him) and said: What should one do if the blood of menses smears the garment of one amongst us? He (the Holy Prophet) replied: She should scrape it, then rub it with water, then pour water over it and then offer prayer in it.",
      "chain": [
        "30201",
        "20032",
        "11065",
        "38487",
        "20031",
        "11065",
        "10526",
        "70"
      ]
    },
    {
      "hadith_no": "332",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثنا محمد بن المثنى، وابن، بشار قال ابن المثنى حدثنا محمد بن جعفر، حدثنا شعبة، عن إبراهيم بن المهاجر، قال سمعت صفية، تحدث عن عائشة، أن أسماء، سألت النبي صلى الله عليه وسلم عن غسل المحيض فقال ‏\"‏ تأخذ إحداكن ماءها وسدرتها فتطهر فتحسن الطهور ثم تصب على رأسها فتدلكه دلكا شديدا حتى تبلغ شئون رأسها ثم تصب عليها الماء ‏.‏ ثم تأخذ فرصة ممسكة فتطهر بها ‏\"‏ ‏.‏ فقالت أسماء وكيف تطهر بها فقال ‏\"‏ سبحان الله تطهرين بها ‏\"‏ ‏.‏ فقالت عائشة كأنها تخفي ذلك تتبعين أثر الدم ‏.‏ وسألته عن غسل الجنابة فقال ‏\"‏ تأخذ ماء فتطهر فتحسن الطهور - أو تبلغ الطهور - ثم تصب على رأسها فتدلكه حتى تبلغ شئون رأسها ثم تفيض عليها الماء ‏\"‏ ‏.‏ فقالت عائشة نعم النساء نساء الأنصار لم يكن يمنعهن الحياء أن يتفقهن في الدين ‏.‏",
      "text_en": " 'A'isha reported:                      Asma (daughter of Shakal) asked the Apostle of Allah (may peace be upon him) about washing after menstruation. He said: Everyone amongst you should use water (mixed with the leaves of) the lote-tree and cleanse herself well, and then pour water on her head and rub it vigorously till it reaches the roots of the hair. Then she should pour water on it. Afterwards she should take a piece of cotton smeared with musk and cleanse herself with it. Asma' said: How should she cleanse herself with the help of that? Upon this he (the Apostle of Allah) observed: Praise be to Allah, she should cleanse herself. 'A'isha said in a subdued tone that she should apply it to the trace of blood. She (Asma) then further asked about bathing after sexual intercourse. He (the Holy Prophet) said: She should take water and cleanse herself well or complete the ablution and then (pour water) on her head and rub it till it reaches the roots of the hair (of her) head and then pour water on her. 'A'isha said: How good are the women of Ansar (helpers) that their shyness does not prevent them from learning religion.",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "53",
        "70"
      ]
    },
    {
      "hadith_no": "2140",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Eclipse) - كتاب الكسوف",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن العلاء الهمداني، حدثنا ابن نمير، حدثنا هشام، عن فاطمة، عن أسماء، قالت خسفت الشمس على عهد رسول الله صلى الله عليه وسلم فدخلت على عائشة وهي تصلي فقلت ما شأن الناس يصلون فأشارت برأسها إلى السماء فقلت آية قالت نعم ‏.‏ فأطال رسول الله صلى الله عليه وسلم القيام جدا حتى تجلاني الغشى فأخذت قربة من ماء إلى جنبي فجعلت أصب على رأسي أو على وجهي من الماء - قالت - فانصرف رسول الله صلى الله عليه وسلم وقد تجلت الشمس فخطب رسول الله صلى الله عليه وسلم الناس فحمد الله وأثنى عليه ثم قال ‏\"‏ أما بعد ما من شىء لم أكن رأيته إلا قد رأيته في مقامي هذا حتى الجنة والنار وإنه قد أوحي إلى أنكم تفتنون في القبور قريبا أو مثل فتنة المسيح الدجال - لا أدري أى ذلك قالت أسماء - فيؤتى أحدكم فيقال ما علمك بهذا الرجل فأما المؤمن أو الموقن - لا أدري أى ذلك قالت أسماء - فيقول هو محمد هو رسول الله جاءنا بالبينات والهدى فأجبنا وأطعنا ‏.‏ ثلاث مرار فيقال له نم قد كنا نعلم إنك لتؤمن به فنم صالحا وأما المنافق أو المرتاب - لا أدري أى ذلك قالت أسماء - فيقول لا أدري سمعت الناس يقولون شيئا فقلت ‏\"‏ ‏.‏",
      "text_en": " Asma' reported:                      The sun eclipsed during the lifetime of the Messenger of Allah (may peace be upon him). As I went to 'A'isha who was busy in prayer. I said: What is the matter with the people that they are praying (a special prayer)? She ('A'isha) pointed towards the sky with her head. I said: Is it (an unusual) sign? She said: Yes. The Messenger of Allah (may peace be upon him) stood up for prayer for such a long time that I was about to faint. I caught hold of a waterskin lying by my side, and began to pour water over my head, or (began to sprinkle water) on my face. The Messenger of Allah (may peace be upon him) then finished and the sun had brightened. The Messenger of Allah (may peace be upon him) then addressed the people, (after) praising Allah and lauding Him, and then said: There was no such thing as I did not see earlier, but I saw it at this very place of mine. I ever saw Paradise and Hell. It was also revealed to me that you would be tried in the graves, as you would he tried something like the turmoil of the Dajjal. Asma' said: I do not know which word he actually used (qariban or mithl), and each one of you would be brought and it would be said: What is your knowledge about this man? If the person is a believer, (Asma' said: I do not know whether it was the word al-Mu'min or al-Mu'qin) he would say: He is Muhammad and he is the Messenger of Allah. He brought to us the clear signs and right guidance. So we responded and obeyed him. (He would repeat this three times), and it would be said to him: You should go to sleep. We already knew that you are a believer in him. So the pious man would go to sleep. So far as the hypocrite or sceptic is concerned (Asma' said: I do not know which word was that: al-Munafiq (hypocrite) or al-Murtad (doubtful) he would say: I do not know. I only uttered whatever I heard people say.",
      "chain": [
        "30216",
        "30212",
        "20295",
        "10526",
        "70"
      ]
    },
    {
      "hadith_no": "2142",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Eclipse) - كتاب الكسوف",
      "chapter_no": "11",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا أبو أسامة، عن هشام، عن فاطمة، عن أسماء، قالت أتيت عائشة فإذا الناس قيام وإذا هي تصلي فقلت ما شأن الناس واقتص الحديث بنحو حديث ابن نمير عن هشام ‏.‏  أخبرنا يحيى بن يحيى، أخبرنا سفيان بن عيينة، عن الزهري، عن عروة، قال لا تقل كسفت الشمس ولكن قل خسفت الشمس ‏.‏",
      "text_en": " Asma' said:                      I came to 'A'isha when the people were standing (in prayer) and she was also praying. I said: What is this excitement of the people for? And the rest of the hadith was narrated like one, (narrated above). 'Urwa said: Do not say Kasafat-ush-Shamsu, but say Khasafat-ush-Shamsu.",
      "chain": [
        "30201",
        "30216",
        "20318",
        "11065",
        "10526",
        "70",
        "30399",
        "20005",
        "11013",
        "10511"
      ]
    },
    {
      "hadith_no": "2144",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Eclipse) - كتاب الكسوف",
      "chapter_no": "11",
      "text_ar": "حدثنا يحيى بن حبيب الحارثي، حدثنا خالد بن الحارث، حدثنا ابن جريج، حدثني منصور بن عبد الرحمن، عن أمه، صفية بنت شيبة عن أسماء بنت أبي بكر، أنها قالت فزع النبي صلى الله عليه وسلم يوما - قالت تعني يوم كسفت الشمس - فأخذ درعا حتى أدرك بردائه فقام للناس قياما طويلا لو أن إنسانا أتى لم يشعر أن النبي صلى الله عليه وسلم ركع ما حدث أنه ركع من طول القيام ‏.‏",
      "text_en": " Asma' bint Abu Bakr said:                      The Apostle of Allah (may peace be upon him) was one day (i. e. on the day when the sun eclipsed) so perturbed that he (in haste) took hold of the outer garment (of a female member of his family) and it was later on that his (own) cloak was sent to him. He stood in prayer along with people for such a long time that if a man came he did not realise that the Apostle of Allah (may peace be upon him) had observed ruku', as it has been narrated about ruku' in connection with long qiyam.",
      "chain": [
        "20226",
        "11070",
        "11565",
        "2802",
        "70"
      ]
    },
    {
      "hadith_no": "2146",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Eclipse) - كتاب الكسوف",
      "chapter_no": "11",
      "text_ar": "وحدثني أحمد بن سعيد الدارمي، حدثنا حبان، حدثنا وهيب، حدثنا منصور، عن أمه، عن أسماء بنت أبي بكر، قالت كسفت الشمس على عهد النبي صلى الله عليه وسلم ففزع فأخطأ بدرع حتى أدرك بردائه بعد ذلك قالت فقضيت حاجتي ثم جئت ودخلت المسجد فرأيت رسول الله صلى الله عليه وسلم قائما فقمت معه فأطال القيام حتى رأيتني أريد أن أجلس ثم ألتفت إلى المرأة الضعيفة فأقول هذه أضعف مني ‏.‏ فأقوم فركع فأطال الركوع ثم رفع رأسه فأطال القيام حتى لو أن رجلا جاء خيل إليه أنه لم يركع ‏.‏",
      "text_en": " Asma' daughter of Abu Bakr reported:                      The sun eclipsed during the lifetime of the Apostle of Allah (may peace be upon him) ; so he felt perturbed and he, by mistake, took hold of the outer garment of a woman till he was given his own cloak. After this I satisfied my need and then came and entered the mosque. I saw the Messenger of Allah (may peace be upon him) standing in prayer. I stood along with him. He prolonged his qiyam till I wished to sit down. Then I cast a glance towards an old woman. So I said: She is older than I. I, therefore, kept standing. He (the Holy Prophet) then observed ruku', and prolonged his ruku'. He then raised his head. He then prolonged his qiyam to such an extent that if a person happened to come he would have thought that he had not observed the ruku'.",
      "chain": [
        "30296",
        "20218",
        "20299",
        "11067",
        "70"
      ]
    },
    {
      "hadith_no": "2371",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن إدريس، عن هشام بن عروة، عن أبيه، عن أسماء، قالت قلت يا رسول الله إن أمي قدمت على وهى راغبة - أو راهبة - أفأصلها قال ‏\"‏ نعم ‏\"‏ ‏.‏",
      "text_en": " Asma' daughter of Abu Bakr reported:                      I said: Messenger of Allah, my mother, who is inclined or scared has come to me. Should I (even An her position of being opposed to Islam) treat her well? He said: Yes.",
      "chain": [
        "30201",
        "20102",
        "11065",
        "10511",
        "70"
      ]
    },
    {
      "hadith_no": "2372",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثنا أبو كريب، محمد بن العلاء حدثنا أبو أسامة، عن هشام، عن أبيه، عن أسماء بنت أبي بكر، قالت قدمت على أمي وهي مشركة في عهد قريش إذ عاهدهم فاستفتيت رسول الله صلى الله عليه وسلم فقلت يا رسول الله قدمت على أمي وهى راغبة أفأصل أمي قال ‏\"‏ نعم صلي أمك ‏\"‏ ‏.‏",
      "text_en": " Asma' bint Abu Bakr reported:                      My mother who was a polytheist came to me when he (the Holy Prophet) entered into treaty with, the Quraish (of Mecca). I inquired from the Messenger of Allah (may peace be upon him) saying: Messenger of Allah, there has come to me my mother and she is inclined; should I (in this state of her mind) show her kindness? He said: Yes, treat her kindly.",
      "chain": [
        "30216",
        "20318",
        "11065",
        "10511",
        "70"
      ]
    },
    {
      "hadith_no": "2422",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا حفص، - يعني ابن غياث - عن هشام، عن فاطمة بنت المنذر، عن أسماء بنت أبي بكر، - رضى الله عنها - قالت قال لي رسول الله صلى الله عليه وسلم ‏\"‏ أنفقي - أو انضحي أو انفحي - ولا تحصي فيحصي الله عليك ‏\"‏ ‏.‏",
      "text_en": " Asma', daughter of Abu Bakr (Allah be pleated with him), reported:                      The Messenger of Allah (may peace be upon him) said to me: Spend, and do not calculate, or otherwise Allah would also calculate in your case.",
      "chain": [
        "30201",
        "20317",
        "11065",
        "10526",
        "70"
      ]
    },
    {
      "hadith_no": "2423",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثنا عمرو الناقد، وزهير بن حرب، وإسحاق بن إبراهيم، جميعا عن أبي، معاوية - قال زهير حدثنا محمد بن خازم، - حدثنا هشام بن عروة، عن عباد بن حمزة، وعن فاطمة بنت المنذر، عن أسماء، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ انفحي - أو انضحي أو أنفقي - ولا تحصي فيحصي الله عليك ولا توعي فيوعي الله عليك ‏\"‏ ‏.‏",
      "text_en": " Asma' reported Allah's Messenger (way peace be upon him) as saying (to her):                      Spend and do not calculate, (for) Allah would calculate in your case; and do not hoard, otherwise Allah would be withholding from you.",
      "chain": [
        "30263",
        "30022",
        "30123",
        "20354",
        "20321",
        "20354",
        "11065",
        "10526",
        "70"
      ]
    },
    {
      "hadith_no": "2424",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثنا ابن نمير، حدثنا محمد بن بشر، حدثنا هشام، عن عباد بن حمزة، عن أسماء، أن النبي صلى الله عليه وسلم قال لها نحو حديثهم ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Asma' through another chain of transmitters.",
      "chain": [
        "30212",
        "20352",
        "11065",
        "70"
      ]
    },
    {
      "hadith_no": "2425",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثني محمد بن حاتم، وهارون بن عبد الله، قالا حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني ابن أبي مليكة، أن عباد بن عبد الله بن الزبير، أخبره عن أسماء، بنت أبي بكر أنها جاءت النبي صلى الله عليه وسلم فقالت يا نبي الله ليس لي شىء إلا ما أدخل على الزبير فهل على جناح أن أرضخ مما يدخل على فقال ‏\"‏ ارضخي ما استطعت ولا توعي فيوعي الله عليك ‏\"‏ ‏.‏",
      "text_en": " Asma', daughter of Abu Bakr, reported that abe came to the Apostle of Allah (may peace he upon him) and said:                      Apostle of Allah, I have nothing with me, but only, that which is given to me by Zubair (for household expenses). Is there any sin for me if I spend out of that which is given to me (by Zabair)? Upon this he (the Holy Prophet) said: Spend according to your means; and do not hoard, for Allah will withhold from you.",
      "chain": [
        "38487",
        "30524",
        "20381",
        "11070",
        "11090",
        "11250",
        "70"
      ]
    },
    {
      "hadith_no": "3061",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا إسحاق بن إبراهيم، أخبرنا محمد بن بكر، أخبرنا ابن جريج، ح وحدثني زهير بن حرب، - واللفظ له - حدثنا روح بن عبادة، حدثنا ابن جريج، حدثني منصور، بن عبد الرحمن عن أمه، صفية بنت شيبة عن أسماء بنت أبي بكر، - رضى الله عنهما - قالت خرجنا محرمين فقال رسول الله صلى الله عليه وسلم ‏\"‏ من كان معه هدى فليقم على إحرامه ومن لم يكن معه هدى فليحلل ‏\"‏ ‏.‏ فلم يكن معي هدى فحللت وكان مع الزبير هدى فلم يحلل ‏.‏ قالت فلبست ثيابي ثم خرجت فجلست إلى الزبير فقال قومي عني ‏.‏ فقلت أتخشى أن أثب عليك.",
      "text_en": " Asma bint Abu Bakr (Allah be pleased with both of them) reported:                      We set out (to Mecca) in a state of Ihram. Allah's Messenger (may peace be upon him) said: He who has the sacrificial animal with him should remain in the state of Ihram, but he who has not the sacrificial animal with him should put off Ihram. As I had not the sacrificial animal with me, I put off Ihram. And since Zubair (her husband) - had the sacrificial animal with him, he did not put off Ihram. She (Asma) said: I put on my clothes and then went out and sat by Zabair, whereupon he said: Go away from me, whereupon I said: Do you fear that I would jump upon you?",
      "chain": [
        "30123",
        "20277",
        "11070",
        "30022",
        "20229",
        "11070",
        "11565",
        "2802",
        "70"
      ]
    },
    {
      "hadith_no": "3062",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني عباس بن عبد العظيم العنبري، حدثنا أبو هشام المغيرة بن سلمة، المخزومي حدثنا وهيب، حدثنا منصور بن عبد الرحمن، عن أمه، عن أسماء بنت أبي بكر، - رضى الله عنهما - قالت قدمنا مع رسول الله صلى الله عليه وسلم مهلين بالحج ‏.‏ ثم ذكر بمثل حديث ابن جريج غير أنه قال فقال استرخي عني استرخي عني ‏.‏ فقلت أتخشى أن أثب عليك .",
      "text_en": " Asma bint Abu Bakr (Allah be pleased with th (m) said:                      We came for Hajj in the state of Ihram with Allah's Messenger (may peace be upon him). The rest of the hadith is the same except (for the words) that he (Zubair) said: Keep away from me, keep away from me, whereupon I said: Do you fear that I will jump upon you?",
      "chain": [
        "30437",
        "20299",
        "11565",
        "2802",
        "70"
      ]
    },
    {
      "hadith_no": "5137",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثنا محمد بن عبد الله بن نمير، حدثنا أبي وحفص بن غياث، ووكيع، عن  هشام، عن فاطمة، عن أسماء، قالت نحرنا فرسا على عهد رسول الله صلى الله عليه وسلم فأكلناه ‏.‏",
      "text_en": " Asma' reported:                      We slaughtered a horse and ate it during the lifetime of Allah's Messenger (may peace be upon him).",
      "chain": [
        "30212",
        "20032",
        "20295",
        "10526",
        "70"
      ]
    },
    {
      "hadith_no": "5687",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا أبو معاوية، عن هشام بن عروة، عن فاطمة بنت، المنذر عن أسماء بنت أبي بكر، قالت جاءت امرأة إلى النبي صلى الله عليه وسلم فقالت يا رسول الله إن لي ابنة عريسا أصابتها حصبة فتمرق شعرها أفأصله فقال ‏\"‏ لعن الله الواصلة والمستوصلة ‏\"‏ ‏.‏",
      "text_en": " Asma', daughter of Abu Bakr, reported that a woman came to Allah's Apostle (may peace be upon him) and said:                      I have a daughter who has been newly wedded. She had an attack of smallpox and thus her hair had fallen; should I add false hair to her head? Thereupon Allah's Messenger (may peace be upon him) said: Allah has cursed the woman who adds some false hair and the woman who asks for it.",
      "chain": [
        "30399",
        "20354",
        "11065",
        "10526",
        "70"
      ]
    },
    {
      "hadith_no": "5689",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "وحدثني أحمد بن سعيد الدارمي، أخبرنا حبان، حدثنا وهيب، حدثنا منصور، عن  أمه، عن أسماء بنت أبي بكر، أن امرأة، أتت النبي صلى الله عليه وسلم فقالت إني زوجت ابنتي فتمرق شعر رأسها وزوجها يستحسنها أفأصل يا رسول الله فنهاها ‏.‏",
      "text_en": " Asma', daughter of Abu Bakr, reported that a woman came to Allah's Apostle (may peace be upon him) and said:                      I have married my daughter (whose) hair of head have fallen. Her spouse likes them (the long hair). Allah's Messenger (may add false hair to her head? He forbade her to do this.",
      "chain": [
        "30296",
        "20218",
        "20299",
        "11067",
        "70"
      ]
    },
    {
      "hadith_no": "5706",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا عبدة، حدثنا هشام، عن فاطمة، عن  أسماء، جاءت امرأة إلى النبي صلى الله عليه وسلم فقالت إن لي ضرة فهل على جناح أن أتشبع من مال زوجي بما لم يعطني فقال رسول الله صلى الله عليه وسلم ‏\"‏ المتشبع بما لم يعط كلابس ثوبى زور ‏\"‏ ‏.‏",
      "text_en": " Asma' reported that a woman came to Allah's Apostle (may peace be upon him) and said:                      I have a co-wife. Is there any harm for me if I give her the false impression (of getting something from my husband which he has not in fact given me)? Thereupon Allah's Messenger (may peace be upon him) said: The one who creates such a (false impression) of receiving what one has not been given is like one who wears the garment of falsehood.",
      "chain": [
        "30212",
        "20337",
        "11065",
        "5706",
        "70"
      ]
    },
    {
      "hadith_no": "5741",
      "source": " Sahih Muslim ",
      "chapter": "The Book on General Behaviour - كتاب الآداب",
      "chapter_no": "39",
      "text_ar": "حدثنا أبو كريب، محمد بن العلاء حدثنا أبو أسامة، عن هشام، عن أبيه، عن  أسماء، أنها حملت بعبد الله بن الزبير بمكة قالت فخرجت وأنا متم، فأتيت المدينة فنزلت بقباء فولدته بقباء ثم أتيت رسول الله صلى الله عليه وسلم فوضعه في حجره ثم دعا بتمرة فمضغها ثم تفل في فيه فكان أول شىء دخل جوفه ريق رسول الله صلى الله عليه وسلم ثم حنكه بالتمرة ثم دعا له وبرك عليه وكان أول مولود ولد في الإسلام ‏.‏",
      "text_en": " Asma' reported that she had become pregnant at Mecca with Abdullah b. Zubair (in her womt) and she (further) said:                      I set out (for migration to Medina) as I was in the advanced stage of pregnancy. I came to Medina and got down at the place known as Quba' and gave birth to a child there. Then I came to Allah's Messenger (may peace he upon him). He placed him (the child) in his lap and then commanded for the dates to be brought. He chewed them and then put the saliva in his mouth. The first thing which went into his stomach was the saliva of Allah's Messenger (may peace be upon him). He then rubbed his palate with dates and then invoked blessings for him and blessed him. He was the first child who was born in Islam (after Migration).",
      "chain": [
        "30216",
        "20318",
        "11065",
        "10511",
        "70"
      ]
    },
    {
      "hadith_no": "5742",
      "source": " Sahih Muslim ",
      "chapter": "The Book on General Behaviour - كتاب الآداب",
      "chapter_no": "39",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا خالد بن مخلد، عن علي بن مسهر، عن هشام، بن عروة عن أبيه، عن أسماء بنت أبي بكر، أنها هاجرت إلى رسول الله صلى الله عليه وسلم وهي حبلى بعبد الله بن الزبير ‏.‏ فذكر نحو حديث أبي أسامة ‏.‏",
      "text_en": " Asma', daughter of Abu Bakr, reported that when she migrated to Allah's Messenger (may peace be upon him) in Medina she was in the family way with Abdullah b. Zubair in her womb.",
      "chain": [
        "30201",
        "30463",
        "20345",
        "11065",
        "10511",
        "70"
      ]
    },
    {
      "hadith_no": "5821",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثنا محمد بن العلاء أبو كريب الهمداني، حدثنا أبو أسامة، عن هشام، أخبرني  أبي، عن أسماء بنت أبي بكر، قالت تزوجني الزبير وما له في الأرض من مال ولا مملوك ولا شىء غير فرسه - قالت - فكنت أعلف فرسه وأكفيه مئونته وأسوسه وأدق النوى لناضحه وأعلفه وأستقي الماء وأخرز غربه وأعجن ولم أكن أحسن أخبز وكان يخبز لي جارات من الأنصار وكن نسوة صدق - قالت - وكنت أنقل النوى من أرض الزبير التي أقطعه رسول الله صلى الله عليه وسلم على رأسي وهى على ثلثى فرسخ - قالت - فجئت يوما والنوى على رأسي فلقيت رسول الله صلى الله عليه وسلم ومعه نفر من أصحابه فدعاني ثم قال ‏\"‏ إخ إخ ‏\"‏ ‏.‏ ليحملني خلفه - قالت - فاستحييت وعرفت غيرتك فقال والله لحملك النوى على رأسك أشد من ركوبك معه ‏.‏ قالت حتى أرسل إلى أبو بكر بعد ذلك بخادم فكفتني سياسة الفرس فكأنما أعتقتني ‏.‏",
      "text_en": " Asma' daughter of Abu Bakr reported that the was married to Zubair. He had neither land nor wealth nor slave nor anything else like it except a bom. She further said:                      I grazed his horse. provided fodder to it and looked after it, and ground dates for his camel. Besides this, I grazed the camel, made arrangements for providing it with water and patched up the leather bucket and kneaded the flour. But I was not proficient in baking the bread, so my female neighbours used to bake bread for me and they were sincere women. She further said: I was carrying on my head the stones of the dates from the land of Zubair which Allah's Messenger (may peace be upon him) had endowed him and it was at a distance of two miles (from Medina). She add: As I was one day carrying the atones of dates upon my head I happened to meet Allah's Messenger (may peace be upon him) along with a group of his Companions. He called me and said (to the camel) to sit down so that he should make cite ride behind hirn. (I told my husband: ) I felt shy and remembered your jealousy, whereupon he said: By Allah. the carrying of the stone dates upon your bead is more severe a burden than riding with him. She said: (I led the life of hardship) until Abu Bakr sent afterwards a female servant who took upon herself the responsibility of looking after the horse and I felt as it she had emancipated me.",
      "chain": [
        "30216",
        "20318",
        "11065",
        "10511",
        "70"
      ]
    },
    {
      "hadith_no": "5822",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثنا محمد بن عبيد الغبري، حدثنا حماد بن زيد، عن أيوب، عن ابن أبي مليكة، أن أسماء، قالت كنت أخدم الزبير خدمة البيت وكان له فرس وكنت أسوسه فلم يكن من الخدمة شىء أشد على من سياسة الفرس كنت أحتش له وأقوم عليه وأسوسه ‏.‏ قال ثم إنها أصابت خادما جاء النبي صلى الله عليه وسلم سبى فأعطاها خادما ‏.‏ قالت كفتني سياسة الفرس فألقت عني مئونته فجاءني رجل فقال يا أم عبد الله إني رجل فقير أردت أن أبيع في ظل دارك ‏.‏ قالت إني إن رخصت لك أبى ذاك الزبير فتعال فاطلب إلى والزبير شاهد فجاء فقال يا أم عبد الله إني رجل فقير أردت أن أبيع في ظل دارك ‏.‏ فقالت ما لك بالمدينة إلا داري فقال لها الزبير ما لك أن تمنعي رجلا فقيرا يبيع فكان يبيع إلى أن كسب فبعته الجارية فدخل على الزبير وثمنها في حجري ‏.‏ فقال هبيها لي ‏.‏ قالت إني قد تصدقت بها ‏.‏",
      "text_en": " Asma' reported:                      I performed the household duties of Zubair and he had a horse; I used to look after it. Nothing was more burdensome for me than looking after the horse I used to bring grass for it and looked after it, then I got a servant as Allah's Apustle (may peace be upon him) had some prisoners of war in his possession. He gave me a female servant. She (the female servant) then began to look after the horse and thus relieved me of this burden. A person came and he said: Mother of 'Abdullah, I am a destitute person and I intend that I should start business under the shadow of your house. I (Asma') said: If I grant you permission, Zubair may not agree to that, so you come and make a demand of it when Zubair is also present there. He came accordingly find said: Mother of 'Abdullah. I am a destitute person. I intend to start t mall business in the shadow of your house. I said: Is there not in Medina (any place for starting the business) except my house? Zubair said: Why is it that you prohibit the destitute man to start business here? So he started business and he (earned so much) that we sold our slave-girl to him There came Zubair to me while the money was in my lap. He said: Give this to me. I said: (I intend) to spend it as charity.",
      "chain": [
        "30213",
        "20022",
        "11015",
        "11090",
        "70"
      ]
    },
    {
      "hadith_no": "5887",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا عبدة بن سليمان، عن هشام، عن فاطمة، عن أسماء، أنها كانت تؤتى بالمرأة الموعوكة فتدعو بالماء فتصبه في جيبها وتقول إن رسول الله صلى الله عليه وسلم قال ‏\"‏ ابردوها بالماء ‏\"‏ ‏.‏ وقال ‏\"‏ إنها من فيح جهنم ‏\"‏ ‏.‏",
      "text_en": " Asma' reported that a woman running high fever was brought to her. She asked water to be brought and then sprinkled it in the opening of a shirt at the uppermost part of the chest and said that Allah's Messenger (may peace be upon him) had said:                      Cool (the fever) with water. for it is because of the vehemence of the beat of Hell.",
      "chain": [
        "30201",
        "20337",
        "11065",
        "10526",
        "70"
      ]
    },
    {
      "hadith_no": "7172",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Repentance and Exhortation to Repentance - كتاب التوبة",
      "chapter_no": "51",
      "text_ar": "قال يحيى وحدثني أبو سلمة، أن عروة بن الزبير، حدثه أن أسماء بنت أبي بكر حدثته أنها، سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ليس شىء أغير من الله عز وجل ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Asma' daughter of Abu Bakr, through another chain of transmitters.",
      "chain": [
        "30020",
        "10567",
        "10511",
        "70"
      ]
    },
    {
      "hadith_no": "7174",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Repentance and Exhortation to Repentance - كتاب التوبة",
      "chapter_no": "51",
      "text_ar": "وحدثنا محمد بن أبي بكر المقدمي، حدثنا بشر بن المفضل، عن هشام، عن يحيى، بن أبي كثير عن أبي سلمة، عن عروة، عن أسماء، عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ لا شىء أغير من الله عز وجل ‏\"‏ ‏.‏",
      "text_en": " Asma' reported that Allah's Apostle (may peace be upon him) said:                      There is none more self-respecting than Allah, the Exalted and Glorious.",
      "chain": [
        "30161",
        "20212",
        "20295",
        "11449",
        "10567",
        "10511",
        "70"
      ]
    },
    {
      "hadith_no": "316",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عبيد الله بن معاذ العنبري، أخبرني أبي، عن شعبة، عن إبراهيم، - يعني ابن مهاجر - عن صفية بنت شيبة، عن عائشة، أن أسماء، سألت النبي صلى الله عليه وسلم بمعناه قال ‏\"‏ فرصة ممسكة ‏\"‏ ‏.‏ قالت كيف أتطهر بها قال ‏\"‏ سبحان الله تطهري بها واستتري بثوب ‏\"‏ ‏.‏ وزاد وسألته عن الغسل من الجنابة فقال ‏\"‏ تأخذين ماءك فتطهرين أحسن الطهور وأبلغه ثم تصبين على رأسك الماء ثم تدلكينه حتى يبلغ شئون رأسك ثم تفيضين عليك الماء ‏\"‏ ‏.‏ قال وقالت عائشة نعم النساء نساء الأنصار لم يكن يمنعهن الحياء أن يسألن عن الدين ويتفقهن فيه ‏.‏",
      "text_en": " 'Aishah said:                      Asma' asked the Prophet (ﷺ) and then narrated the rest of the tradition to the same effect. He (the Prophet) said: \"a musk-scented piece of cloth.\" She (Asma') said: How should I purify with it ? He said: By glory of Allah ! Purify with it, and he covered his face with the cloth. This version also adds: \"She asked about the washing because of sexual defilement.\" He said: Take your water and purify yourself as best as possible. Then pour water over yourself. 'Aishah said: The best of the women are the women of the Ansar. Shyness would not prevent them from inquiring about religion and from acquiring deep understanding in it.",
      "chain": [
        "30150",
        "20286",
        "20020",
        "10739",
        "2802",
        "53",
        "70"
      ]
    },
    {
      "hadith_no": "360",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا محمد بن سلمة، عن محمد بن إسحاق، عن فاطمة بنت المنذر، عن أسماء بنت أبي بكر، قالت سمعت امرأة، تسأل رسول الله صلى الله عليه وسلم كيف تصنع إحدانا بثوبها إذا رأت الطهر أتصلي فيه قال ‏\"‏ تنظر فإن رأت فيه دما فلتقرصه بشىء من ماء ولتنضح ما لم تر ولتصل فيه ‏\"‏ ‏.‏",
      "text_en": " Asma' daughter of Abu Bakr said:                      I heard a woman asking the Messenger of Allah (ﷺ): What should any of us to with her clothe (in which she menstruated) when she becomes purified ? Can she pray in that (clothe) ? He said: She should see; if she finds blood in it, she should scratch it with some water and (in case of doubt) sprinkle upon it (some water) and pray so long as she does not find (any blood).",
      "chain": [
        "30352",
        "20672",
        "11107",
        "10526",
        "70"
      ]
    },
    {
      "hadith_no": "361",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن هشام بن عروة، عن فاطمة بنت المنذر، عن أسماء بنت أبي بكر، أنها قالت سألت امرأة رسول الله صلى الله عليه وسلم فقالت يا رسول الله أرأيت إحدانا إذا أصاب ثوبها الدم من الحيضة كيف تصنع قال ‏\"‏ إذا أصاب إحداكن الدم من الحيض فلتقرصه ثم لتنضحه بالماء ثم لتصلي ‏\"‏ ‏.‏",
      "text_en": " Asma' daughter of Abu Bakr said:                      A woman asked the Messenger of Allah (ﷺ): Messenger of Allah, what do you think if the clothe of any of us smeared with the blood of menstruation; what should she do ? He said: If (the clothe of) any of you is smeared with blood of menstruation, she should scratch it; then she should sprinkle water upon it and then she may pray.",
      "chain": [
        "20164",
        "20001",
        "11065",
        "10526",
        "70"
      ]
    },
    {
      "hadith_no": "851",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن المتوكل العسقلاني، حدثنا عبد الرزاق، أنبأنا معمر، عن عبد الله بن مسلم، أخي الزهري عن مولى، لأسماء ابنة أبي بكر عن أسماء بنت أبي بكر، قالت سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من كان منكن يؤمن بالله واليوم الآخر فلا ترفع رأسها حتى يرفع الرجال رءوسهم ‏\"‏ ‏.‏ كراهة أن يرين من عورات الرجال ‏.‏",
      "text_en": " Narrated Asma' daughter of AbuBakr:                     I heard the Messenger of Allah (ﷺ) say: One of you who believes in Allah and in the Last Day should not raise her head until the men raise their heads (after prostration) lest they should see the private parts of men.",
      "chain": [
        "38581",
        "20121",
        "20115",
        "70"
      ]
    },
    {
      "hadith_no": "1192",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book Of The Prayer For Rain (Kitab al-Istisqa') - كتاب الاستسقاء",
      "chapter_no": "3",
      "text_ar": "حدثنا زهير بن حرب، حدثنا معاوية بن عمرو، حدثنا زائدة، عن هشام، عن فاطمة، عن أسماء، قالت كان النبي صلى الله عليه وسلم يأمر بالعتاقة في صلاة الكسوف ‏.‏",
      "text_en": " Narrated Asma:                     The Prophet (peace be upon him) used to command us to free slaves on the occasion of an eclipse",
      "chain": [
        "30022",
        "20389",
        "20320",
        "11065",
        "10526",
        "70"
      ]
    },
    {
      "hadith_no": "1668",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا أحمد بن أبي شعيب الحراني، حدثنا عيسى بن يونس، حدثنا هشام بن عروة، عن أبيه، عن أسماء، قالت قدمت على أمي راغبة في عهد قريش وهي راغمة مشركة فقلت يا رسول الله إن أمي قدمت على وهي راغمة مشركة أفأصلها قال ‏\"‏ نعم فصلي أمك ‏\"‏ ‏.‏",
      "text_en": " Asma‘ said My mother came to me seeking some act of kindness from me during the treaty of the Quraish (at Hudaibiyyah).  While she hated Islam and she was a polytheist.  I said Messenger of Allah (ﷺ), my mother has come to me while she hates Islam and she is a disbeliever.  May I do an act of kindness to her?  He replied Yes, do an act of kindness to her.",
      "chain": [
        "30301",
        "20347",
        "11065",
        "10511",
        "70"
      ]
    },
    {
      "hadith_no": "1699",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا مسدد، حدثنا إسماعيل، أخبرنا أيوب، حدثنا عبد الله بن أبي مليكة، حدثتني أسماء بنت أبي بكر، قالت قلت يا رسول الله ما لي شىء إلا ما أدخل على الزبير بيته أفأعطي منه قال ‏\"‏ أعطي ولا توكي فيوكي عليك ‏\"‏ ‏.‏",
      "text_en": " Asma, daughter of Abu Bakr, said :                      I said : Messenger of Allah(SAWS), I have nothing of my own except what al-Zubair (her husband) brings to me in his house: should I spend out of it?  He said : Give and do not hoard so your sustenance will be hoarded.",
      "chain": [
        "30175",
        "20208",
        "11015",
        "11090",
        "70"
      ]
    },
    {
      "hadith_no": "1818",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن حنبل، ومحمد بن عبد العزيز بن أبي رزمة، أخبرنا عبد الله بن إدريس، أخبرنا ابن إسحاق، عن يحيى بن عباد بن عبد الله بن الزبير، عن أبيه، عن أسماء بنت أبي بكر، قالت خرجنا مع رسول الله صلى الله عليه وسلم حجاجا حتى إذا كنا بالعرج نزل رسول الله صلى الله عليه وسلم ونزلنا فجلست عائشة - رضى الله عنها - إلى جنب رسول الله صلى الله عليه وسلم وجلست إلى جنب أبي وكانت زمالة أبي بكر وزمالة رسول الله صلى الله عليه وسلم واحدة مع غلام لأبي بكر فجلس أبو بكر ينتظر أن يطلع عليه فطلع وليس معه بعيره قال أين بعيرك قال أضللته البارحة ‏.‏ قال فقال أبو بكر بعير واحد تضله قال فطفق يضربه ورسول الله صلى الله عليه وسلم يتبسم ويقول ‏\"‏ انظروا إلى هذا المحرم ما يصنع ‏\"‏ ‏.‏ قال ابن أبي رزمة فما يزيد رسول الله صلى الله عليه وسلم على أن يقول ‏\"‏ انظروا إلى هذا المحرم ما يصنع ‏\"‏ ‏.‏ ويتبسم ‏.‏",
      "text_en": " Narrated Asma' bint AbuBakr:                     We came out for performing hajj along with the Messenger of Allah (ﷺ). When we reached al-Araj, the Messenger of Allah (ﷺ) alighted and we also alighted. Aisha sat beside the Messenger of Allah (ﷺ) and I sat beside my father (AbuBakr). The equipment and personal effects of AbuBakr and of the Messenger of Allah (ﷺ) were placed with AbuBakr's slave on a camel. AbuBakr was sitting and waiting for his arrival. He arrived but he had no camel with him. He asked:  Where is your camel?  He replied: I lost it last night.  AbuBakr said: There was only one camel, even that you have lost.  He then began to beat him while the Messenger of Allah (ﷺ) was smiling and saying: Look at this man who is in the sacred state (putting on ihram), what is he doing?  Ibn AbuRizmah said: The Messenger of Allah (ﷺ) spoke nothing except the words: Look at this man who is in the sacred state (wearing ihram), what is he doing? He was smiling (when he uttered these words).",
      "chain": [
        "30007",
        "30379",
        "20102",
        "11107",
        "19826",
        "11250",
        "70"
      ]
    },
    {
      "hadith_no": "1943",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن خلاد الباهلي، حدثنا يحيى، عن ابن جريج، أخبرني عطاء، أخبرني مخبر، عن أسماء، أنها رمت الجمرة قلت إنا رمينا الجمرة بليل ‏.‏ قالت إنا كنا نصنع هذا على عهد رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Ata' said:                      A reporter reported to me about Asma' that she threw pebbles at the jamrah at night. I said: We threw pebbles (at the jamrah) at night. She said: We used to do so in the lifetime of the Messenger of Allah (ﷺ).",
      "chain": [
        "30020",
        "11070",
        "11029",
        "70"
      ]
    },
    {
      "hadith_no": "2359",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا هارون بن عبد الله، ومحمد بن العلاء، - المعنى - قالا حدثنا أبو أسامة، حدثنا هشام بن عروة، عن فاطمة بنت المنذر، عن أسماء بنت أبي بكر، قالت أفطرنا يوما في رمضان في غيم في عهد رسول الله صلى الله عليه وسلم ثم طلعت الشمس قال أبو أسامة قلت لهشام أمروا بالقضاء قال وبد من ذلك",
      "text_en": " Narrated Asma' daughter of Abu Bakr :                     We broke the fast one during Ramadan when it was cloudy in the lifetime of the Messenger of Allah (ﷺ) ; then the sun rose. Abu Usamah said: I said to Hisham: Were they commanded to atone for it ? He replied: That was inevitable.",
      "chain": [
        "30524",
        "30216",
        "20318",
        "11065",
        "10526",
        "70"
      ]
    },
    {
      "hadith_no": "3069",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا حسين بن علي، حدثنا يحيى، - يعني ابن آدم - حدثنا أبو بكر بن عياش، عن هشام بن عروة، عن أبيه، عن أسماء بنت أبي بكر، أن رسول الله صلى الله عليه وسلم أقطع الزبير نخلا ‏.‏",
      "text_en": " Narrated Asma' daughter of AbuBakr:                     The Messenger of Allah (ﷺ) assigned to az-Zubayr palm-trees as a fief.",
      "chain": [
        "20315",
        "20364",
        "20373",
        "11065",
        "10511",
        "70"
      ]
    },
    {
      "hadith_no": "4997",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن هشام بن عروة، عن فاطمة بنت المنذر، عن أسماء بنت أبي بكر، أن امرأة، قالت يا رسول الله إن لي جارة - تعني ضرة - هل على جناح إن تشبعت لها بما لم يعط زوجي قال ‏\"‏ المتشبع بما لم يعط كلابس ثوبى زور ‏\"‏ ‏.‏",
      "text_en": " Asma’, daughter of Abu Bakr, told of a woman who said :                      Messenger of Allah! I have a fellow-wife; will it be wrong for me to boast of receiving from my husband what he does not give me? He replied: the one who boasts of receiving what he has not been given is like him who has put on two garments of falsehood.",
      "chain": [
        "20193",
        "20022",
        "11065",
        "10526",
        "70"
      ]
    },
    {
      "hadith_no": "138",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان بن عيينة، عن هشام بن عروة، عن فاطمة بنت المنذر، عن أسماء بنت أبي بكر، أن امرأة، سألت النبي صلى الله عليه وسلم عن الثوب يصيبه الدم من الحيضة فقال رسول الله صلى الله عليه وسلم ‏\"‏ حتيه ثم اقرصيه بالماء ثم رشيه وصلي فيه ‏\"‏ ‏.‏ قال وفي الباب عن أبي هريرة وأم قيس بنت محصن ‏.‏ قال أبو عيسى حديث أسماء في غسل الدم حديث حسن صحيح ‏.‏ وقد اختلف أهل العلم في الدم يكون على الثوب فيصلي فيه قبل أن يغسله قال بعض أهل العلم من التابعين إذا كان الدم مقدار الدرهم فلم يغسله وصلى فيه أعاد الصلاة ‏.‏ وقال بعضهم إذا كان الدم أكثر من قدر الدرهم أعاد الصلاة ‏.‏ وهو قول سفيان الثوري وابن المبارك ‏.‏ ولم يوجب بعض أهل العلم من التابعين وغيرهم عليه الإعادة وإن كان أكثر من قدر الدرهم ‏.‏ وبه يقول أحمد وإسحاق ‏.‏ وقال الشافعي يجب عليه الغسل وإن كان أقل من قدر الدرهم وشدد في ذلك ‏.‏",
      "text_en": " Asma' bint Abu Bakr narrated that :                     a woman asked the Prophet about a garment that was touched by some menstrual blood. So Allah's Messenger said: \"Remove it, and scrub it, then rinse it and pray in it\"",
      "chain": [
        "30421",
        "20005",
        "11065",
        "10526",
        "70"
      ]
    },
    {
      "hadith_no": "2087",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا أبو الخطاب، زياد بن يحيى البصري حدثنا حاتم بن وردان، حدثنا أيوب، عن ابن أبي مليكة، عن أسماء بنت أبي بكر، قالت قلت يا رسول الله إنه ليس لي من شيء إلا ما أدخل على الزبير أفأعطي قال ‏\"‏ نعم ولا توكي فيوكى عليك ‏\"‏ ‏.‏ يقول لا تحصي فيحصى عليك ‏.‏ وفي الباب عن عائشة وأبي هريرة ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وروى بعضهم هذا الحديث بهذا الإسناد عن ابن أبي مليكة عن عباد بن عبد الله بن الزبير عن أسماء بنت أبي بكر رضى الله عنهما وروى غير واحد هذا عن أيوب ولم يذكروا فيه عن عباد بن عبد الله بن الزبير ‏.‏",
      "text_en": " Asma bint Abi Bakr  said:                     \" O the Messenger of Allah! I have nothing except what was given to me by (my husband) Az-Zubair, shall I give it (in charity)?'\" It was said: \"Do not hold (your wealth) so that Allah will hold against you.\"",
      "chain": [
        "11015",
        "11090",
        "70"
      ]
    },
    {
      "hadith_no": "2218",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Medicine - كتاب الطب عن رسول اللَّهِ صلى الله عليه وسلم",
      "chapter_no": "28",
      "text_ar": "حدثنا هارون بن إسحاق، حدثنا عبدة، عن هشام بن عروة، عن فاطمة بنت المنذر، عن أسماء بنت أبي بكر، عن النبي صلى الله عليه وسلم نحوه ‏.‏ قال أبو عيسى وفي حديث أسماء كلام أكثر من هذا وكلا الحديثين صحيح ‏.‏",
      "text_en": "",
      "chain": [
        "35158",
        "20337",
        "11065",
        "10526",
        "70"
      ]
    },
    {
      "hadith_no": "2737",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of Paradise - كتاب صفة الجنة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "38",
      "text_ar": "حدثنا أبو كريب، حدثنا يونس بن بكير، عن محمد بن إسحاق، عن يحيى بن عباد بن عبد الله بن الزبير، عن أبيه، عن أسماء بنت أبي بكر، قالت سمعت رسول الله صلى الله عليه وسلم يقول وذكر له سدرة المنتهى قال ‏\"‏ يسير الراكب في ظل الفنن منها مائة سنة أو يستظل بظلها مائة راكب شك يحيى فيها فراش الذهب كأن ثمرها القلال ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " 'Aishah narrated from Asma' bint Abi Bakr that she said:                     \"I heard the Messenger of Allah (s.a.w) while mentioning the Lote-Tree of the Utmost Boundary, saying: 'A rider will travel in the shade of one of its branches for a hundred years,' or 'a hundred riders will seek to shade themselves with its shade'-(lne of the narrators) Yahya' was in doubt- 'in it are butterflies of gold, it is as if its fruits are Qilal.\"",
      "chain": [
        "30216",
        "20118",
        "11107",
        "19826",
        "11250",
        "70"
      ]
    },
    {
      "hadith_no": "295",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا يحيى بن حبيب بن عربي، عن حماد بن زيد، عن هشام بن عروة، عن فاطمة بنت المنذر، عن أسماء بنت أبي بكر، وكانت، تكون في حجرها أن امرأة استفتت النبي صلى الله عليه وسلم عن دم الحيض يصيب الثوب فقال ‏\"‏ حتيه ثم اقرصيه بالماء ثم انضحيه وصلي فيه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Asma' bint Abi Bakr taht a woman asked the Messenger of Allah (ﷺ) about menstrual blood that gets on clothes. He said:                      \"Scratch it, then rub it with water, then sprinkle water over it, and pray in it.\"",
      "chain": [
        "30459",
        "20022",
        "11065",
        "10526",
        "70"
      ]
    },
    {
      "hadith_no": "1498",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "أخبرني إبراهيم بن يعقوب، قال حدثنا موسى بن داود، قال حدثنا نافع بن عمر، عن ابن أبي مليكة، عن أسماء بنت أبي بكر، قالت صلى رسول الله صلى الله عليه وسلم في الكسوف فقام فأطال القيام ثم ركع فأطال الركوع ثم رفع فأطال القيام ثم ركع فأطال الركوع ثم رفع ثم سجد فأطال السجود ثم رفع ثم سجد فأطال السجود ثم قام فأطال القيام ثم ركع فأطال الركوع ثم رفع فأطال القيام ثم ركع فأطال الركوع ثم رفع ثم سجد فأطال السجود ثم رفع ثم سجد فأطال السجود ثم رفع ثم انصرف ‏.‏",
      "text_en": " It was narrated that Asma' bint Abi Bakr said:                     The Messenger of Allah (ﷺ) prayed during an eclipse. He stood for a long time, then he bowed for a long time, then he stood up and (remained standing) for a long time, then he bowed for a long time, then he stood up, then he prostrated for a long time, then he stood up and (remained standing) for a long time, then he bowed for a long time, then he stood up, then he prostrated for a long time, then he sat up, then he prostrated for a long time, then he sat up and then he finished.\"",
      "chain": [
        "38088",
        "20636",
        "20203",
        "11090",
        "70"
      ]
    },
    {
      "hadith_no": "2550",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا محمد بن آدم، عن عبدة، عن هشام بن عروة، عن فاطمة، عن أسماء بنت أبي بكر، أن النبي صلى الله عليه وسلم قال لها ‏\"‏ لا تحصي فيحصي الله عز وجل عليك ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Asma' bint Abi Bakr that the Prophet said to her:                     \"Do not count what you give, otherwise Allah, the Mighty and Sublime, will count what He gives to you.\"",
      "chain": [
        "20337",
        "11065",
        "63",
        "70"
      ]
    },
    {
      "hadith_no": "2551",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا الحسن بن محمد، عن حجاج، قال قال ابن جريج أخبرني ابن أبي مليكة، عن عباد بن عبد الله بن الزبير، عن أسماء بنت أبي بكر، أنها جاءت النبي صلى الله عليه وسلم فقالت يا نبي الله ليس لي شىء إلا ما أدخل على الزبير فهل على جناح في أن أرضخ مما يدخل على فقال ‏\"‏ ارضخي ما استطعت ولا توكي فيوكي الله عز وجل عليك ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Asma' bint Abi Bakr that she came to the Prophet and said:                     \"O Prophet of Allah, I do not have anything but that which Az-Zubair brings to me. Is there any sin on me if I give a small amount of that which he brings to me?\" He said: Give whatever you can, and do not withhold what you have, lest Allah withhold provision from you.\"",
      "chain": [
        "30245",
        "20219",
        "11070",
        "11090",
        "11250",
        "70"
      ]
    },
    {
      "hadith_no": "2992",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن عبد الله بن المبارك، قال حدثنا أبو هشام، قال حدثنا وهيب بن خالد، عن منصور بن عبد الرحمن، عن أمه، عن أسماء بنت أبي بكر، قالت قدمنا مع رسول الله صلى الله عليه وسلم مهلين بالحج فلما دنونا من مكة قال رسول الله صلى الله عليه وسلم ‏\"‏ من لم يكن معه هدى فليحلل ومن كان معه هدى فليقم على إحرامه ‏\"‏ ‏.‏ قالت وكان مع الزبير هدى فأقام على إحرامه ولم يكن معي هدى فأحللت فلبست ثيابي وتطيبت من طيبي ثم جلست إلى الزبير فقال استأخري عني ‏.‏ فقلت أتخشى أن أثب عليك",
      "text_en": " It was narrated from Asma bint Abi Bakr who said:                     \"We came with the Messenger of Allah reciting the Talbiyah for Hajj. When we drew close to Makkah, the Messenger of Alla said: 'Whoever does not have a Hadi with him, let him exit Ihram. Whoever has a Hadi with him, let him remain in Ihram.' Az-Zubair had a Hadi with him so he remained in Ihram, but I did not have a Hadi with me so I exited Ihram, put on my some of my perfume. Then I sat down with As-Zubair and he said: \"Go away from me.' I said: 'Are you afraid that I am going to jump on you?'\"",
      "chain": [
        "20299",
        "11565",
        "2802",
        "70"
      ]
    },
    {
      "hadith_no": "4406",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا عيسى بن أحمد العسقلاني، - عسقلان بلخ - قال حدثنا ابن وهب، قال حدثني سفيان، عن هشام بن عروة، حدثه عن فاطمة بنت المنذر، عن أسماء بنت أبي بكر، قالت نحرنا فرسا على عهد رسول الله صلى الله عليه وسلم فأكلناه ‏.‏",
      "text_en": " It was narrated that Asma bint Abi Bakr said:                     \"We slaughtered (Naharna) a horse during the time of the Messenger of Allah and ate it\". (Sahih )",
      "chain": [
        "20029",
        "20012",
        "11065",
        "10526",
        "70"
      ]
    },
    {
      "hadith_no": "4420",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا قتيبة، ومحمد بن عبد الله بن يزيد، قالا حدثنا سفيان، عن هشام بن عروة، عن فاطمة، عن أسماء، قالت نحرنا فرسا على عهد رسول الله صلى الله عليه وسلم فأكلناه ‏.‏ وقال قتيبة في حديثه فأكلنا لحمه ‏.‏ خالفه عبدة بن سليمان ‏.‏",
      "text_en": " It was narrated that Asma said:                     \"We slaughtered (Naharna) a horse during the time of Messenger of Allah and ate it.\" In his hadith Qutaibah (one of the narrators) said: \"And we ate its meat.\" (Sahih )'Abdah bin sulaiman contradicted him.",
      "chain": [
        "30367",
        "20005",
        "11065",
        "63",
        "70"
      ]
    },
    {
      "hadith_no": "4421",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرني محمد بن آدم، قال حدثنا عبدة، عن هشام بن عروة، عن فاطمة، عن أسماء، قالت ذبحنا على عهد رسول الله صلى الله عليه وسلم فرسا ونحن بالمدينة فأكلناه ‏.‏",
      "text_en": " It was narrated that Asma said:                     \"We slaughtered (naharna) a horse during the time of the Messenger of Allah while we were in Al-Madinah, and we ate it.\" (Sahih )",
      "chain": [
        "20337",
        "11065",
        "63",
        "70"
      ]
    },
    {
      "hadith_no": "5094",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرني محمد بن إسماعيل بن إبراهيم، قال حدثنا أبو النضر، قال حدثنا شعبة، عن هشام بن عروة، عن امرأته، فاطمة عن أسماء بنت أبي بكر، أن رسول الله صلى الله عليه وسلم لعن الواصلة والمستوصلة ‏.‏",
      "text_en": " It was narrated from Hisham bin 'Urwah, from his wife Fatimah, from Asma' bint Abi Bakr, that:                     The Messenger of Allah [SAW] cursed the woman who affixes hair extensions and the woman who has that done.",
      "chain": [
        "34188",
        "20390",
        "20020",
        "11065",
        "70"
      ]
    },
    {
      "hadith_no": "5250",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا محمد بن المثنى، قال حدثنا يحيى، عن هشام، قال حدثتني فاطمة، عن أسماء، أن امرأة، جاءت إلى رسول الله صلى الله عليه وسلم فقالت يا رسول الله إن بنتا لي عروس وإنها اشتكت فتمزق شعرها فهل على جناح إن وصلت لها فيه فقال ‏\"‏ لعن الله الواصلة والمستوصلة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Asma' that:                     A woman came to the Messenger of Allah [SAW] and said: \"O Messenger of Allah [SAW], a daughter of mine is going to get married. She got sick and her hair fell out. Is there any sin on me if I give her hair extensions?\" He said: \"Allah has cursed the woman who affixes hair extensions and the one who has that done.\"",
      "chain": [
        "30170",
        "20031",
        "11065",
        "63",
        "70"
      ]
    },
    {
      "hadith_no": "672",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو خالد الأحمر، عن هشام بن عروة، عن فاطمة بنت المنذر، عن أسماء بنت أبي بكر الصديق، قالت سئل رسول الله  صلى الله عليه وسلم  عن دم الحيض يكون في الثوب قال ‏\"‏ اقرصيه واغسليه وصلي فيه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Asma' bint Abi Bakr said:                     \"The Messenger of Allah was asked about menstrual blood that gets on clothing. He said: 'Rub it off, wash it and perform prayer in (the garment).'\"",
      "chain": [
        "30201",
        "20326",
        "11065",
        "10526",
        "70"
      ]
    },
    {
      "hadith_no": "685",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن إبراهيم بن مهاجر، قال سمعت صفية، تحدث عن عائشة، أن أسماء، سألت رسول الله  صلى الله عليه وسلم  عن الغسل من المحيض فقال ‏\"‏ تأخذ إحداكن ماءها وسدرها فتطهر فتحسن الطهور أو تبلغ في الطهور ثم تصب على رأسها فتدلكه دلكا شديدا حتى تبلغ شئون رأسها ثم تصب عليها الماء ثم تأخذ فرصة ممسكة فتطهر بها ‏\"‏ ‏.‏ قالت أسماء كيف أتطهر بها قال ‏\"‏ سبحان الله تطهري بها ‏\"‏ ‏.‏ قالت عائشة - كأنها تخفي ذلك - تتبعي بها أثر الدم ‏.‏ قالت وسألته عن الغسل من الجنابة ‏.‏ فقال ‏\"‏ تأخذ إحداكن ماءها فتطهر فتحسن الطهور أو تبلغ في الطهور حتى تصب الماء على رأسها فتدلكه حتى تبلغ شئون رأسها ثم تفيض الماء على جسدها ‏.‏ فقالت عائشة نعم النساء نساء الأنصار لم يمنعهن الحياء أن يتفقهن في الدين ‏.‏",
      "text_en": " It was narrated from 'Aishah that:                     Asma asked the Messenger of Allah about bathing after ones's period. He said: \"One of you should take her water and lote leaves, and purify herself well, or thoroughly. Then she should pour water over her head and rub it vigorously so that the water reaches the roots of her hair. Then she should take a piece of cotton perfumed with musk and purify herself with it.\" Asma said: \"How should I purify myself with it?\" He said: \"Subhan Allah! Purify yourself with it!\" 'Aishah said, as if whispering to her: \"Wipe away the traces of blood with it.\" Then she (Asma) asked him about bathing to cleanse oneself from sexual impurity. He said: \"One of you should take her water, and purify herself, and purify herself well, or thoroughly. She should pour water over her head and rub it so that the water reaches the roots of her hair, then she should pour water over her body.\" 'Aishah said: \"How good were the women of the Ansar! For they did not let shyness keep them from understanding their religion properly.\"",
      "chain": [
        "30160",
        "20173",
        "20020",
        "10739",
        "53",
        "70"
      ]
    },
    {
      "hadith_no": "1323",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محرز بن سلمة العدني، حدثنا نافع بن عمر الجمحي، عن ابن أبي مليكة، عن أسماء بنت أبي بكر، قالت صلى رسول الله  صلى الله عليه وسلم  صلاة الكسوف فقام فأطال القيام ثم ركع فأطال الركوع ثم رفع فقام فأطال القيام ثم ركع فأطال الركوع ثم رفع ثم سجد فأطال السجود ثم رفع ثم سجد فأطال السجود ثم رفع فقام فأطال القيام ثم ركع فأطال الركوع ثم رفع فقام فأطال القيام ثم ركع فأطال الركوع ثم رفع ثم سجد فأطال السجود ثم رفع ثم سجد فأطال السجود ثم انصرف فقال ‏\"‏ لقد دنت مني الجنة حتى لو اجترأت عليها لجئتكم بقطاف من قطافها ودنت مني النار حتى قلت أى رب وأنا فيهم ‏\"‏ ‏.‏ قال نافع حسبت أنه قال ‏\"‏ ورأيت امرأة تخدشها هرة لها فقلت ما شأن هذه قالوا حبستها حتى ماتت جوعا لا هي أطعمتها ولا هي أرسلتها تأكل من خشاش الأرض ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Asma’ bint Abu Bakr said:                      “The Messenger ofAllah(ﷺ) performed the eclipse prayer. He stood for a long time,then hebowed for a long time, then he stood up for a long time, thenhebowed for a long time, then he stood up, then he prostrated for along time, then he sat up, then he prostrated for a long time. Hestood for a long time, then he bowed for a long time, then he stoodupfor a long time, then he bowed for a long time, then he stood upfor along times, then he bowed for a long time, then he stood up,then heprostrated for a long time, then he sat up, then heprostrated for along time. Then he finished and said: ‘Paradisewas brought close tome, so that if I had dared, I could have broughtyou some of itsfruits. And Hell was brought near to me, until Isaid: “O Lord, am, Ione of them?” Nafi’ said: “I think thathe said: ‘And i saw a womanbeing scratched by a cat that belongedto her. I said: “What is wrongwith this woman?” They said: “Shedetained it until it died of hunger;she did not feed it and she didnot let it loose to eat of the verminof the earth.”",
      "chain": [
        "20203",
        "11090",
        "70"
      ]
    },
    {
      "hadith_no": "1744",
      "source": " Sunan Ibn Majah ",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعلي بن محمد، قالا حدثنا أبو أسامة، عن هشام بن عروة، عن فاطمة بنت المنذر، عن أسماء بنت أبي بكر، قالت أفطرنا على عهد رسول الله  صلى الله عليه وسلم  في يوم غيم ثم طلعت الشمس ‏.‏ قلت لهشام أمروا بالقضاء قال لا بد من ذلك ‏.‏",
      "text_en": " It wasnarrated that Asma’ bint Abu Bakr said:                      “We broke our fast onacloudy day at the time of the Messenger of Allah (ﷺ), then the sunappeared.”",
      "chain": [
        "30201",
        "38409",
        "20318",
        "11065",
        "10526",
        "70"
      ]
    },
    {
      "hadith_no": "2065",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبدة بن سليمان، عن هشام بن عروة، عن فاطمة، عن أسماء، قالت جاءت امرأة إلى النبي  صلى الله عليه وسلم  فقالت إن ابنتي عريس وقد أصابتها الحصبة فتمرق شعرها ‏.‏ فأصل لها فيه فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ لعن الله الواصلة والمستوصلة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Asma' said:                     \"A woman came to the Prophet and said:, My daughter is going to get married, and she had the measles and her hair has fallen out. Can I put extensions in her hair?, The Messenger of Allah said: ‘Allah has cursed the one who does hair extensions and the one who has that done.'\"",
      "chain": [
        "30201",
        "20337",
        "11065",
        "63",
        "70"
      ]
    },
    {
      "hadith_no": "2926",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الرحيم بن سليمان، عن حجاج، عن أبي عمر، - مولى أسماء - عن أسماء بنت أبي بكر، أنها أخرجت جبة مزررة بالديباج فقالت كان النبي صلى الله عليه وسلم يلبس هذه إذا لقي العدو ‏.‏",
      "text_en": " It wasnarrated from Abu ‘Umar, the freed slave of Asma’, from Asma’bint Abi Bakr, that she brought out a cloak edged with brocade andsaid:                      “The Prophet (ﷺ) used to wear this when he met the enemy.”",
      "chain": [
        "30201",
        "20334",
        "20219",
        "70"
      ]
    },
    {
      "hadith_no": "3045",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن إدريس، عن محمد بن إسحاق، عن يحيى بن عباد بن عبد الله بن الزبير، عن أبيه، عن أسماء بنت أبي بكر، قالت خرجنا مع رسول الله  صلى الله عليه وسلم  حتى إذا كنا بالعرج نزلنا فجلس رسول الله  صلى الله عليه وسلم  وعائشة إلى جنبه وأنا إلى جنب أبي بكر وكانت زمالتنا وزمالة أبي بكر واحدة مع غلام أبي بكر قال فطلع الغلام وليس معه بعيره فقال له أين بعيرك قال أضللته البارحة ‏.‏ قال معك بعير واحد تضله قال فطفق يضربه ورسول الله  صلى الله عليه وسلم  يقول ‏\"‏ انظروا إلى هذا المحرم ما يصنع ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Asma’ bint Abu Bakr said:                      “We went out with theMessenger of Allah (ﷺ) until, when we were in ‘Arj, we stopped tocamp. The Messenger of Allah (ﷺ) sat, with ‘Aishah by his side,andI was sitting beside Abu Bakr. Our mount* and the mount of AbuBakrwas one, under the care of the slave of Abu Bakr. The slavelooked andhis camel was not with him, so he said to him: ‘Where isyour camel?’He said: ‘I lost it yesterday.’ He said: ‘Youhave one camel with youand you lost it?’ He started to beat him,and the Messenger of Allah(ﷺ) said: ‘Look at what this Muhrim isdoing!’”",
      "chain": [
        "30201",
        "20102",
        "11107",
        "19826",
        "11250",
        "70"
      ]
    },
    {
      "hadith_no": "3097",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا بكر بن خلف أبو بشر، حدثنا أبو عاصم، أنبأنا ابن جريج، أخبرني منصور بن عبد الرحمن، عن أمه، صفية عن أسماء بنت أبي بكر، قالت خرجنا مع رسول الله  صلى الله عليه وسلم  محرمين فقال النبي  صلى الله عليه وسلم  ‏\"‏ من كان معه هدى فليقم على إحرامه ومن لم يكن معه هدى فليحلل ‏\"‏ ‏.‏ قالت ولم يكن معي هدى فأحللت وكان مع الزبير هدى فلم يحل فلبست ثيابي وجئت إلى الزبير فقال قومي عني ‏.‏ فقلت أتخشى أن أثب عليك ‏.‏",
      "text_en": " It wasnarrated that Asma’ bint Abi Bakr said:                      “We went out with theMessenger of Allah (ﷺ) in Ihram. The Prophet (ﷺ) said: ‘Whoeverhas a sacrificial animal with him, let him remain in Ihram. Whoeverdoes not have a sacrificial animal with him, let him exit Ihram.’Shesaid: ‘I did not have a sacrificial animal with me, so I exitedIhram,but Zubair had a sacrificial animal with him, so he did notexitIhram. So I put on my regular clothes and came to Zubair, and hesaid:‘Go away from me.’ I said: ‘Are you afraid I am going tojump onyou?!’”",
      "chain": [
        "34043",
        "20241",
        "11070",
        "11565",
        "70"
      ]
    },
    {
      "hadith_no": "3311",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Slaughtering - كتاب الذبائح",
      "chapter_no": "27",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن هشام بن عروة، عن فاطمة بنت المنذر، عن أسماء بنت أبي بكر، قالت نحرنا فرسا فأكلنا من لحمه على عهد رسول الله  صلى الله عليه وسلم  ‏.‏",
      "text_en": " It wasnarrated that Asm’a bint Abu Bakr said:                      “We slaughtered ahorseand ate its meat during the time of the Messenger of Allah(ﷺ).”",
      "chain": [
        "30201",
        "20032",
        "11065",
        "10526",
        "70"
      ]
    },
    {
      "hadith_no": "3603",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبدة بن سليمان، عن هشام بن عروة، عن فاطمة بنت المنذر، عن أسماء بنت أبي بكر، أنها كانت تؤتى بالمرأة الموعوكة فتدعو بالماء فتصبه في جيبها وتقول إن النبي  صلى الله عليه وسلم  قال ‏\"‏ ابردوها بالماء ‏\"‏ ‏.‏ وقال ‏\"‏ إنها من فيح جهنم ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Asma’ bint Abu Bakr that a woman suffering fromfeverwould be brought to her, and she would call for water and pouritonto the neck of her garment. She said:                      The Prophet (ﷺ) said:“Coolit down with water,” and he said: “It is from the heat ofHell-fire.”",
      "chain": [
        "30201",
        "20337",
        "11065",
        "10526",
        "70"
      ]
    }
  ],
  "total_hadiths": 104
}