{
  "id": "709",
  "name": "'Abdullah bin 'Amir bin Rabi'a ( عبد الله بن عامر بن ربيعة ( رضي الله عنه",
  "full_name": "'Abdullah bin 'Amir bin Rabi'a ( عبد الله بن عامر بن ربيعة ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Makkah"
    },
    "death": {
      "date_hijri": "85",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Medinah",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medinah"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ ع  -  صحبة ]"
    ],
    "tags": [
      "al-'Anzi",
      "Ally Quraish",
      "Ally b.'Adi",
      "Born Muslim"
    ]
  },
  "parents": [
    {
      "id": "708",
      "name": "'Amir bin Rabi'a bin Malik ( عامر بن ربيعة بن مالك ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "64",
      "name": "Liala bint Abi Hathmah ( ليلى بنت أبي خثمة بن حذيفة ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "708",
      "name": "'Amir bin Rabi'a bin Malik ( عامر بن ربيعة بن مالك ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3",
      "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4",
      "name": "'Uthman ibn 'Affaan ( عثمان بن عفان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "8",
      "name": "'Abdur Rahman Ibn 'Awf ( عبد الرحمن بن عوف ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "333",
      "name": "Haritha bin al-Nu'man ( حارثة بن النعمان بن نفع ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "34",
      "name": "Jabir ibn 'Abdullah ( جابر بن عبد الله بن عمرو السلمي الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11062",
      "name": "Yahya bin Sa'id al-Ansari يحيى بن سعيد الأنصاري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "13501",
      "name": "Umayya bin Hind al-Mazni أمية بن هند المزني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10614",
      "name": "Muhammad bin Zayd bin al-Mhajr محمد بن زيد بن المهاجر بن قنفذ",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-1097",
      "hadith_no": "1097",
      "source": "Sahih Bukhari",
      "chapter": "Shortening the Prayers (At-Taqseer) - كتاب التقصير",
      "chapter_no": "18",
      "text_ar": "حدثنا يحيى بن بكير، قال حدثنا الليث، عن عقيل، عن ابن شهاب، عن عبد الله بن عامر بن ربيعة، أن عامر بن ربيعة، أخبره قال رأيت رسول الله صلى الله عليه وسلم وهو على الراحلة يسبح، يومئ برأسه قبل أى وجه توجه، ولم يكن رسول الله صلى الله عليه وسلم يصنع ذلك في الصلاة المكتوبة‏.‏",
      "text_en": " Narrated 'Amir bin Rabi`a:                     I saw the Prophet on his Mount praying Nawafil by nodding his head, whatever direction he faced, but Allah's Apostle never did the same in offering the compulsory prayers.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20023",
        "11207",
        "11013",
        "709",
        "708"
      ]
    },
    {
      "id": "sahih-bukhari-2885",
      "hadith_no": "2885",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا إسماعيل بن خليل، أخبرنا علي بن مسهر، أخبرنا يحيى بن سعيد، أخبرنا عبد الله بن عامر بن ربيعة، قال سمعت عائشة  رضى الله عنها  تقول كان النبي صلى الله عليه وسلم سهر فلما قدم المدينة قال ‏\"‏ ليت رجلا من أصحابي صالحا يحرسني الليلة ‏\"‏‏.‏ إذ سمعنا صوت سلاح فقال ‏\"‏ من هذا ‏\"‏‏.‏ فقال أنا سعد بن أبي وقاص، جئت لأحرسك‏.‏ ونام النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet was vigilant one night and when he reached Medina, he said, \"Would that a pious man from my companions guard me tonight!\" Suddenly we heard the clatter of arms. He said, \"Who is that? \" He (The new comer) replied, \" I am Sa`d bin Abi Waqqas and have come to guard you.\" So, the Prophet slept (that night).",
      "usc_msa_ref": "136",
      "chain": [
        "30186",
        "20345",
        "11062",
        "709",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-4061",
      "hadith_no": "4061",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، قال أخبرني عبد الله بن عامر بن ربيعة، وكان، من أكبر بني عدي وكان أبوه شهد بدرا مع النبي صلى الله عليه وسلم أن عمر استعمل قدامة بن مظعون على البحرين، وكان شهد بدرا، وهو خال عبد الله بن عمر وحفصة رضى الله عنهم‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr bin Rabi`a:                     who was one of the leaders of Bani `Adi and his father participated in the battle of Badr in the company of the Prophet. `Umar appointed Qudama bin Maz'un as ruler of Bahrain, Qudama was one of the warriors of the battle of Badr and was the maternal uncle of `Abdullah bin `Umar and Hafsa.",
      "usc_msa_ref": "348",
      "chain": [
        "30330",
        "20428",
        "11013",
        "709"
      ]
    },
    {
      "id": "sahih-bukhari-7059",
      "hadith_no": "7059",
      "source": "Sahih Bukhari",
      "chapter": "Tricks - كتاب الحيل",
      "chapter_no": "91",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن ابن شهاب، عن عبد الله بن عامر بن ربيعة، أن عمر بن الخطاب  رضى الله عنه  خرج إلى الشأم، فلما جاء بسرغ بلغه أن الوباء وقع بالشأم فأخبره عبد الرحمن بن عوف أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا سمعتم بأرض فلا تقدموا عليه، وإذا وقع بأرض وأنتم بها فلا تخرجوا فرارا منه ‏\"‏‏.‏ فرجع عمر من سرغ‏.‏ وعن ابن شهاب عن سالم بن عبد الله أن عمر إنما انصرف من حديث عبد الرحمن‏.‏",
      "text_en": " Narrated `Abdullah bin 'Amir bin Rabi`a:                     `Umar bin Al-Khattab left for Sham, and when he reached a placed called Sargh, he came to know that there was an outbreak of an epidemic (of plague) in Sham. Then `AbdurRahman bin `Auf told him that Allah's Apostle said, \"If you hear the news of an outbreak of an epidemic (plague) in a certain place, do not enter that place: and if the epidemic falls in a place while you are present in it, do not leave that place to escape from the epidemic.\" So `Umar returned from Sargh.",
      "usc_msa_ref": "103",
      "chain": [
        "20164",
        "20001",
        "11013",
        "709",
        "3"
      ]
    },
    {
      "id": "sahih-bukhari-7316",
      "hadith_no": "7316",
      "source": "Sahih Bukhari",
      "chapter": "Wishes - كتاب التمنى",
      "chapter_no": "95",
      "text_ar": "حدثنا خالد بن مخلد، حدثنا سليمان بن بلال، حدثني يحيى بن سعيد، سمعت عبد الله بن عامر بن ربيعة، قال قالت عائشة أرق النبي صلى الله عليه وسلم ذات ليلة فقال ‏\"‏ ليت رجلا صالحا من أصحابي يحرسني الليلة ‏\"‏‏.‏ إذ سمعنا صوت السلاح قال ‏\"‏ من هذا ‏\"‏‏.‏ قيل سعد يا رسول الله جئت أحرسك‏.‏ فنام النبي صلى الله عليه وسلم حتى سمعنا غطيطه‏.‏ قال أبو عبد الله وقالت عائشة قال بلال ألا ليت شعري هل أبيتن ليلة بواد وحولي إذخر وجليل فأخبرت النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Aisha:                     One night the Prophet was unable to sleep and said, \"Would that a righteous man from my companions guarded me tonight.\" Suddenly we heard the clatter of arms, whereupon the Prophet said, \"Who is it?\" It was said, \"I am Sa`d, O Allah's Apostle! I have come to guard you.\" The Prophet then slept so soundly that we heard him snoring. Abu `Abdullah said: `Aisha said: Bilal said, \"Would that I but stayed overnight in a valley with Idhkhir and Jalil (two kinds of grass) around me (i.e., in Mecca).\" Then I told that to the Prophet .",
      "usc_msa_ref": "337",
      "chain": [
        "30463",
        "20160",
        "11062",
        "709"
      ]
    },
    {
      "id": "sahih-muslim-1653",
      "hadith_no": "1653",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا عمرو بن سواد، وحرملة، قالا أخبرنا ابن وهب، أخبرني يونس، عن ابن شهاب، عن عبد الله بن عامر بن ربيعة، أخبره أن أباه أخبره أنه، رأى رسول الله صلى الله عليه وسلم يصلي السبحة بالليل في السفر على ظهر راحلته حيث توجهت ‏.‏",
      "text_en": " 'Abdullah b. 'Amir b. Rabi'a has reported on the authority of his father that he had seen the Messenger of Allah (may peace be upon him) observing Nafl player at night on a journey on the back of his ride in whichever direction it turned its face.",
      "usc_msa_ref": "",
      "chain": [
        "30443",
        "30487",
        "20029",
        "20475",
        "11013",
        "709",
        "708"
      ]
    },
    {
      "id": "sahih-muslim-5918",
      "hadith_no": "5918",
      "source": "Sahih Muslim",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "وحدثنا يحيى بن يحيى، قال قرأت على مالك عن ابن شهاب، عن عبد الله بن، عامر بن ربيعة أن عمر، خرج إلى الشام فلما جاء سرغ بلغه أن الوباء قد وقع بالشام ‏.‏ فأخبره عبد الرحمن بن عوف أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا سمعتم به بأرض فلا تقدموا عليه ‏.‏ وإذا وقع بأرض وأنتم بها فلا تخرجوا فرارا منه ‏\"‏ ‏.‏ فرجع عمر بن الخطاب من سرغ ‏.‏ وعن ابن شهاب عن سالم بن عبد الله أن عمر إنما انصرف بالناس من حديث عبد الرحمن بن عوف ‏.‏",
      "text_en": " 'Amir b. Rabi'ah reported:                      'Umar went to Syria and as he came to Sargh, information was given to him that an epidemic had broken out in Syria. 'Abd al-Rahman b. 'Auf narrated to him that Allah's Messenger (may peace be upon him) had said: When you hear of its presence in a land, don't move towards it, and when it breaks out in a land and you are therein, then don't run away from it. So 'Umar b. Khattab came back from Sargh. Salim b. 'Abdullah reported that 'Umar went back, along with people on hearing the hadith reported on the authority of 'Abd al-Rahman b. 'Auf.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "11013",
        "709"
      ]
    },
    {
      "id": "sahih-muslim-6383",
      "hadith_no": "6383",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا عبد الله بن مسلمة بن قعنب، حدثنا سليمان بن بلال، عن يحيى بن سعيد، عن عبد الله بن عامر بن ربيعة، عن عائشة، قالت أرق رسول الله صلى الله عليه وسلم ذات ليلة فقال ليت رجلا صالحا من أصحابي يحرسني الليلة ‏.‏ قالت وسمعنا صوت السلاح فقال رسول الله صلى الله عليه وسلم ‏\"‏ من هذا ‏\"‏ ‏.‏ قال سعد بن أبي وقاص يا رسول الله جئت أحرسك ‏.‏ قالت عائشة فنام رسول الله صلى الله عليه وسلم حتى سمعت غطيطه ‏.‏",
      "text_en": " 'A'isha reported that Allah's Messenger (may peace he upon him) lay on bed during one night and said:                      Were there a pious person from amongst my companions who should keep a watch for me during the nightt? She said: We heard the noise of arms, whereupon Allah's Messenger (may peace be upon him) said: Who is it? And Sa'd b. Abi Waqqas said: Allah's MesseDger. I have come to serve as your sentinel. 'A'isha said: Allah' s Messenger (may peace be upon him) slept (such a sound sleep) that I heard the noise of his snoring.",
      "usc_msa_ref": "",
      "chain": [
        "20160",
        "11062",
        "709",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-6384",
      "hadith_no": "6384",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا ليث، ح وحدثنا محمد بن رمح، أخبرنا الليث، عن  يحيى بن سعيد، عن عبد الله بن عامر بن ربيعة، أن عائشة، قالت سهر رسول الله صلى الله عليه وسلم مقدمه المدينة ليلة فقال ‏\"‏ ليت رجلا صالحا من أصحابي يحرسني الليلة ‏\"‏ ‏.‏ قالت فبينا نحن كذلك سمعنا خشخشة سلاح فقال ‏\"‏ من هذا ‏\"‏ ‏.‏ قال سعد بن أبي وقاص ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ ما جاء بك ‏\"‏ ‏.‏ قال وقع في نفسي خوف على رسول الله صلى الله عليه وسلم فجئت أحرسه ‏.‏ فدعا له رسول الله صلى الله عليه وسلم ثم نام ‏.‏ وفي رواية ابن رمح فقلنا من هذا",
      "text_en": " 'A'isha reported that Allah's Messenger (may peace he upon him) laid down on bed during one night on his arrival at Medina and said:                      Were there a pious person from amongst my Companions who should keep a watch for me durin. the night? She (A'isha) reported: We were in this state that we heard the clanging noise of arms. lie (the Holy Prophet) said: Who is it? He said: This is Sa'd b. Abi Waqqas. Allah's Messenger (may peace be upon him) said to him: What brings you here? Thereupon he said: I harboured fear (lest any harm should come to) Allah's Messenger (may peace be upon him), so I came to serve as your sentinel. Allah's Messenger (may peace be upon him) invoked blessings upon him. He then slept. This hadith has been transmitted on the authority of Ibn Rumh with a slight variation of wording.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "30490",
        "20023",
        "11062",
        "709",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-6385",
      "hadith_no": "6385",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثناه محمد بن المثنى، حدثنا عبد الوهاب، سمعت يحيى بن سعيد، يقول سمعت  عبد الله بن عامر بن ربيعة، يقول قالت عائشة أرق رسول الله صلى الله عليه وسلم ذات ليلة ‏.‏ بمثل حديث سليمان بن بلال ‏.‏",
      "text_en": " 'Abdullah b. 'Amir b. Rabi reported A'isha as saying:                      Allah's Messenger (may peace be upon him) went to bed one night; the rest of the hadith is the same.",
      "usc_msa_ref": "",
      "chain": [
        "20259",
        "11062",
        "709"
      ]
    },
    {
      "id": "sunan-abi-daud-774",
      "hadith_no": "774",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا العباس بن عبد العظيم، حدثنا يزيد بن هارون، أخبرنا شريك، عن عاصم بن عبيد الله، عن عبد الله بن عامر بن ربيعة، عن أبيه، قال عطس شاب من الأنصار خلف رسول الله صلى الله عليه وسلم وهو في الصلاة فقال الحمد لله حمدا كثيرا طيبا مباركا فيه حتى يرضى ربنا وبعد ما يرضى من أمر الدنيا والآخرة فلما انصرف رسول الله صلى الله عليه وسلم قال ‏\"‏ من القائل الكلمة ‏\"‏ ‏.‏ قال فسكت الشاب ثم قال ‏\"‏ من القائل الكلمة فإنه لم يقل بأسا ‏\"‏ ‏.‏ فقال يا رسول الله أنا قلتها لم أرد بها إلا خيرا ‏.‏ قال ‏\"‏ ما تناهت دون عرش الرحمن تبارك وتعالى ‏\"‏ ‏.‏",
      "text_en": " Rabi’ah said:                      A young man from the Ansar sneezed behind the Messenger of Allah (ﷺ) while he was praying. He then said: Praise be to Allah, much, good, blessed, till our Lord is pleased (with us) in the affairs relating to this world and to the other world. When the Messenger of Allah (ﷺ) finished his prayer, he said: Who was the speaker of these words (in prayer)? The young man kept silence. He again asked: Who was the speaker of these words? He did not say wrong. He said: Messenger of Allah, I said these (words). I did not intend by them but good. He said: These words did not stay below the Throne of the Compassionate (Allah).",
      "usc_msa_ref": "",
      "chain": [
        "30437",
        "20472",
        "20587",
        "19808",
        "709",
        "708"
      ]
    },
    {
      "id": "jami-al-tirmidhi-345",
      "hadith_no": "345",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا وكيع، حدثنا أشعث بن سعيد السمان، عن عاصم بن عبيد الله، عن عبد الله بن عامر بن ربيعة، عن أبيه، قال كنا مع النبي صلى الله عليه وسلم في سفر في ليلة مظلمة فلم ندر أين القبلة فصلى كل رجل منا على حياله فلما أصبحنا ذكرنا ذلك للنبي صلى الله عليه وسلم فنزل‏:‏ ‏(‏فأينما تولوا فثم وجه الله‏)‏ ‏.‏ قال أبو عيسى هذا حديث ليس إسناده بذاك لا نعرفه إلا من حديث أشعث السمان ‏.‏ وأشعث بن سعيد أبو الربيع السمان يضعف في الحديث ‏.‏ وقد ذهب أكثر أهل العلم إلى هذا ‏.‏ قالوا إذا صلى في الغيم لغير القبلة ثم استبان له بعد ما صلى أنه صلى لغير القبلة فإن صلاته جائزة ‏.‏ وبه يقول سفيان الثوري وابن المبارك وأحمد وإسحاق ‏.‏",
      "text_en": " Abdullah bin Amir bin Rabi'ah narrated from his father who said:                     \"We were with the Prophet on a journey on a very dark night and we did not know the direction of the Qiblah. So each man among us prayed in his own direction. In the morning when we mentioned that to the Prophet, then the following was revealed: So where ever you turn, there is the Face of Allah.\"",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20032",
        "19808",
        "709",
        "708"
      ]
    },
    {
      "id": "jami-al-tirmidhi-725",
      "hadith_no": "725",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، حدثنا سفيان، عن عاصم بن عبيد الله، عن عبد الله بن عامر بن ربيعة، عن أبيه، قال رأيت النبي صلى الله عليه وسلم ما لا أحصي يتسوك وهو صائم ‏.‏ قال وفي الباب عن عائشة ‏.‏ قال أبو عيسى حديث عامر بن ربيعة حديث حسن ‏.‏ والعمل على هذا عند أهل العلم لا يرون بالسواك للصائم بأسا إلا أن بعض أهل العلم كرهوا السواك للصائم بالعود الرطب وكرهوا له السواك آخر النهار ولم ير الشافعي بالسواك بأسا أول النهار ولا آخره وكره أحمد وإسحاق السواك آخر النهار ‏.‏",
      "text_en": " Abdullah bin Amir bin Rabi'ah narrated from his father who said:                     \"I saw the Prophet - (a number of times) such that I was not able to count - using the Siwak while he was fasting.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20033",
        "20012",
        "19808",
        "709",
        "708"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1113",
      "hadith_no": "1113",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Marriage - كتاب النكاح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، وعبد الرحمن بن مهدي، ومحمد بن جعفر، قالوا حدثنا شعبة، عن عاصم بن عبيد الله، قال سمعت عبد الله بن عامر بن ربيعة، عن أبيه، أن امرأة، من بني فزارة تزوجت على نعلين فقال رسول الله صلى الله عليه وسلم ‏\"‏ أرضيت من نفسك ومالك بنعلين ‏\"‏ ‏.‏ قالت نعم ‏.‏ قال فأجازه ‏.‏ قال وفي الباب عن عمر وأبي هريرة وسهل بن سعد وأبي سعيد وأنس وعائشة وجابر وأبي حدرد الأسلمي ‏.‏ قال أبو عيسى حديث عامر بن ربيعة حديث حسن صحيح ‏.‏ واختلف أهل العلم في المهر فقال بعض أهل العلم المهر على ما تراضوا عليه ‏.‏ وهو قول سفيان الثوري والشافعي وأحمد وإسحاق ‏.‏ وقال مالك بن أنس لا يكون المهر أقل من ربع دينار ‏.‏ وقال بعض أهل الكوفة لا يكون المهر أقل من عشرة دراهم ‏.‏",
      "text_en": " Abdullah bin Amr bin Rabi'ah narrated from his father:                     \"A woman from Banu Fazarah was married for (the dowry of) two sandals. So the Messenger of Allah said to her: 'Do you approve of (exchanging) yourself and your wealth for two sandals?' She said: 'Yes.'\" He said: \"So he permitted it.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20031",
        "20033",
        "20173",
        "20020",
        "19808",
        "709",
        "708"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3216",
      "hadith_no": "3216",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا وكيع، حدثنا أشعث السمان، عن عاصم بن عبيد الله، عن عبد الله بن عامر بن ربيعة، عن أبيه، قال كنا مع النبي صلى الله عليه وسلم في سفره في ليلة مظلمة فلم ندر أين القبلة فصلى كل رجل منا على حياله فلما أصبحنا ذكرنا ذلك للنبي صلى الله عليه وسلم فنزلت ‏:‏ ‏(‏أينما تولوا فثم وجه الله ‏)‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من حديث أشعث السمان أبي الربيع عن عاصم بن عبيد الله ‏.‏ وأشعث يضعف في الحديث ‏.‏",
      "text_en": " Narrated 'Abdullah bin 'Amir bin Rabi'ah:                     from his father who said: \"We were with the Messenger of Allah (ﷺ) on a journey on a very dark night and we did not know where the Qiblah was. So each man among us prayed in his own direction. In the morning when we mentioned that to the Messenger of Allah (ﷺ), then the following was revealed: \"So wherever you turn, there is the Face of Allah. (2:115)\"",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20032",
        "19808",
        "709",
        "708"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4122",
      "hadith_no": "4122",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا قتيبة، حدثنا الليث، عن يحيى بن سعيد، عن عبد الله بن عامر بن ربيعة، أن عائشة، قالت سهر رسول الله صلى الله عليه وسلم مقدمه المدينة ليلة قال ‏\"‏ ليت رجلا صالحا يحرسني الليلة ‏\"‏ ‏.‏ قالت فبينا نحن كذلك إذ سمعنا خشخشة السلاح فقال ‏\"‏ من هذا ‏\"‏ ‏.‏ فقال سعد بن أبي وقاص ‏.‏ فقال له رسول الله صلى الله عليه وسلم ‏\"‏ ما جاء بك ‏\"‏ ‏.‏ فقال سعد وقع في نفسي خوف على رسول الله صلى الله عليه وسلم فجئت أحرسه ‏.‏ فدعا له رسول الله صلى الله عليه وسلم ثم نام ‏.‏ قال هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated 'Aishah:                     \"The Messenger of Allah (ﷺ) did not sleep one night upon arriving in Al-Madinah. So he said: 'If only a righteous man would guard me tonight.'\" She said: \"So we were like that, when we heard the clanging of weapons. He said: 'Who is this?' So he said: 'Sa'd bin Abi Waqqas.' So the Messenger of Allah (ﷺ) said: 'What has brought you?' Sa'd said: 'Fear for the Messenger of Allah (ﷺ) came upon me, so I came to protect him.' So the Messenger of Allah (ﷺ) supplicated for him, then slept.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "11062",
        "709",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-3965",
      "hadith_no": "3965",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Kind Treatment of Women - كتاب عشرة النساء",
      "chapter_no": "36",
      "text_ar": "أخبرنا علي بن حجر، قال أنبأنا شريك، عن عاصم، عن عبد الله بن عامر بن ربيعة، عن عائشة، قالت فقدته من الليل وساق الحديث ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                      \"I noticed that he was not there one night\" and he quoted the rest of the Hadith.",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20587",
        "11080",
        "709",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-4019",
      "hadith_no": "4019",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرني إبراهيم بن يعقوب، قال حدثنا محمد بن عيسى، قال حدثنا حماد بن زيد، قال حدثنا يحيى بن سعيد، قال حدثني أبو أمامة بن سهل، وعبد الله بن عامر بن ربيعة، قالا كنا مع عثمان وهو محصور - وكنا إذا دخلنا مدخلا نسمع كلام من بالبلاط - فدخل عثمان يوما ثم خرج فقال إنهم ليتواعدوني بالقتل ‏.‏ قلنا يكفيكهم الله ‏.‏ قال فلم يقتلوني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يحل دم امرئ مسلم إلا بإحدى ثلاث رجل كفر بعد إسلامه أو زنى بعد إحصانه أو قتل نفسا بغير نفس ‏\"‏ ‏.‏ فوالله ما زنيت في جاهلية ولا إسلام ولا تمنيت أن لي بديني بدلا منذ هداني الله ولا قتلت نفسا فلم يقتلونني",
      "text_en": " Abu Umamah bin Sahl and 'Abdullah bin 'Amir bin Rabi'ah said:                     \"We were with 'Uthman when he was under siege and we could hear what was said from Al-Balat. 'Uthman came in one day, then he came out, and said: 'They are threatening to kill me.' We said: 'Allah will suffice you against them.' He said: 'Why would they kill me? I heard the Messenger of Allah [SAW] say: It is not permissible to shed the blood of a Muslim except in one of three cases: A man who reverts to Kufr after becoming Muslim, or commits adultery after being married, or one who kills a soul unlawfully. By Allah, I did not commit adultery during Jahiliyyah or in Islam, I never wished to follow any other religion since Allah guided me, and I have never killed anyone, so why do they want to kill me?'\"",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "31167",
        "20022",
        "11062",
        "15659",
        "709"
      ]
    },
    {
      "id": "sunan-ibn-majah-960",
      "hadith_no": "960",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا بكر بن خلف أبو بشر، حدثنا خالد بن الحارث، عن شعبة، عن عاصم بن عبيد الله، قال سمعت عبد الله بن عامر بن ربيعة، عن أبيه، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ ما من مسلم يصلي على إلا صلت عليه الملائكة ما صلى على فليقل العبد من ذلك أو ليكثر ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Asim bin ‘Ubaidullah said:                      “I heard ‘Abdullahbin ‘Amir bin Rabi’ah narrating from his father that the Prophet(ﷺ)said: “There is no Muslim who sends peace and blessings uponme, butthe angels will send peace and blessings upon him as long ashe sendspeace and blessings upon me. So let a person do a little ofthat or alot.”",
      "usc_msa_ref": "",
      "chain": [
        "34043",
        "20226",
        "20020",
        "19808",
        "709",
        "708"
      ]
    },
    {
      "id": "sunan-ibn-majah-1073",
      "hadith_no": "1073",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا يحيى بن حكيم، حدثنا أبو داود، حدثنا أشعث بن سعيد أبو الربيع السمان، عن عاصم بن عبيد الله، عن عبد الله بن عامر بن ربيعة، عن أبيه، قال كنا مع رسول الله  صلى الله عليه وسلم  في سفر فتغيمت السماء وأشكلت علينا القبلة فصلينا وأعلمنا فلما طلعت الشمس إذا نحن قد صلينا لغير القبلة فذكرنا ذلك للنبي  صلى الله عليه وسلم  فأنزل الله ‏{فأينما تولوا فثم وجه الله}‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Abdullah bin ‘Amir bin Rabi’ah that his fathersaid:                      “We were with the Messenger of Allah (ﷺ) on a journey, andthesky was overcast so it was difficult for us to determine theQiblah.So we performed prayer, and we marked the location.* Later,when thesun reappeared, we realized that we had prayed facing adirectionother than the Qiblah. We mentioned that to the Prophet(ﷺ), thenthe Words were revealed: ‘So wherever you turn there isthe Face ofAllah.’” [2:115]",
      "usc_msa_ref": "",
      "chain": [
        "34280",
        "30002",
        "19808",
        "709",
        "708"
      ]
    },
    {
      "id": "sunan-ibn-majah-1596",
      "hadith_no": "1596",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا عبد العزيز بن محمد الدراوردي، عن محمد بن زيد بن المهاجر بن قنفذ، عن عبد الله بن عامر بن ربيعة، عن أبيه، أن امرأة، سوداء ماتت لم يؤذن بها النبي  صلى الله عليه وسلم  فأخبر بذلك فقال ‏\"‏ هلا آذنتموني بها ‏\"‏ ‏.‏ ثم قال لأصحابه ‏\"‏ صفوا عليها ‏\"‏ ‏.‏ فصلى عليها ‏.‏",
      "text_en": " It wasnarrated from ‘Abdullah bin ‘Amir bin Rabi’ah, from hisfather,that a black woman died and the Prophet (ﷺ) was not toldaboutthat. Then he was informed of it, and he said:                      “Why did you nottell me?” Then he said to his Companions: “Line up in rows topray forher,” and he offered the funeral prayer for her.",
      "usc_msa_ref": "",
      "chain": [
        "32048",
        "20167",
        "10614",
        "709",
        "708"
      ]
    },
    {
      "id": "sunan-ibn-majah-1613",
      "hadith_no": "1613",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا إسماعيل بن موسى، حدثنا شريك بن عبد الله، عن عاصم بن عبيد الله، عن عبد الله بن عامر بن ربيعة، عن عائشة، قالت فقدته - تعني النبي  صلى الله عليه وسلم  - فإذا هو بالبقيع فقال ‏\"‏ السلام عليكم دار قوم مؤمنين أنتم لنا فرط وإنا بكم لاحقون اللهم لا تحرمنا أجرهم ولا تفتنا بعدهم ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Aishah said:                      “I could not find him, meaning theProphet (ﷺ), and he was in Al-Baqi’. He said: “As-salamu‘alaykumdara qawmin mu’minin. Antum lana faratun wa inna bikumlahiqun.Allahumma la tahrimna ajrahum wa la taftinna ba’dahum.(Peace be uponyou, O abode of believing people. You have gone aheadof us and verilywe will join you soon. O Allah, do not deprive us oftheir reward anddo not put us to trial after them).”",
      "usc_msa_ref": "",
      "chain": [
        "35016",
        "20587",
        "19808",
        "709",
        "53"
      ]
    },
    {
      "id": "sunan-ibn-majah-1962",
      "hadith_no": "1962",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو عمر الضرير، وهناد بن السري، قالا حدثنا وكيع، عن سفيان، عن عاصم بن عبيد الله، عن عبد الله بن عامر بن ربيعة، عن أبيه، أن رجلا، من بني فزارة تزوج على نعلين فأجاز النبي  صلى الله عليه وسلم  نكاحه ‏.‏",
      "text_en": " It was narrated that:                     Abu Ajfa As-Sulami said: “Umar bin Khattab said: 'Do not go to extremes with regard to the dowries of women, for it that were a sign of honor and dignity in this world or a sign of Taqwa before Allah, then Muhammas would have done that before you. But he did not give any of his wives and none of his daughters were given more than twelve uqiyyah. A man may increase dowry until he feels resentment against her and says: “You cost me everything I own,” or , “You caused me a great deal of hardship. ” ' ”(Hassan)",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20032",
        "20012",
        "19808",
        "709",
        "708"
      ]
    },
    {
      "id": "sunan-ibn-majah-2999",
      "hadith_no": "2999",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، حدثنا عبيد الله بن عمر، عن عاصم بن عبيد الله، عن عبد الله بن عامر بن ربيعة، عن أبيه، عن عمر بن الخطاب، عن النبي  صلى الله عليه وسلم  نحوه ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20352",
        "11201",
        "19808",
        "709",
        "708",
        "3"
      ]
    },
    {
      "id": "sunan-ibn-majah-3037",
      "hadith_no": "3037",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا إبراهيم بن المنذر الحزامي، حدثنا عبد الله بن نافع، وعبد الله بن وهب، ومحمد بن فليح، قالوا حدثنا عاصم بن عمر بن حفص، عن عاصم بن عبيد الله، عن عبد الله بن عامر بن ربيعة، عن جابر بن عبد الله، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ ما من محرم يضحى لله يومه يلبي حتى تغيب الشمس إلا غابت بذنوبه فعاد كما ولدته أمه ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Jabir bin ‘Abdullah that the Messenger of Allah(ﷺ)said:                      “There is no Muhrim (pilgrim in Ihram) who exposes himselftothe sun all day for the sake of Allah, reciting the Talbiyah untilthe sun goes down, but his sins will disappear and he will go backlike on the day his mother bore him.”",
      "usc_msa_ref": "",
      "chain": [
        "30308",
        "30411",
        "20029",
        "20178",
        "19808",
        "709",
        "34"
      ]
    },
    {
      "id": "sunan-ibn-majah-3635",
      "hadith_no": "3635",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا معاوية بن هشام، حدثنا عمار بن رزيق، عن عبد الله بن عيسى، عن أمية بن هند، عن عبد الله بن عامر بن ربيعة، عن أبيه، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ العين حق ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Abdullah bin ‘Amir bin Rabi’ah, from hisfather,that the Prophet (ﷺ) said:                      “The evil eye is real.”",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20609",
        "20595",
        "11361",
        "13501",
        "709",
        "708"
      ]
    }
  ],
  "total_hadiths": 26
}