{
  "id": "740",
  "name": "Umm Khalid bin Khalid ibn Sa'id ( أم خالد بنت خالد بن سعيد بن العاص ( رضي الله عنها",
  "full_name": "Umm Khalid bin Khalid ibn Sa'id ( أم خالد بنت خالد بن سعيد بن العاص ( رضي الله عنها",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Abyssinia"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Abyssinia",
      "Medinah"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ خ  د  س  -  صحابة ]"
    ],
    "tags": [
      "Female",
      "Quraish",
      "B.Umayya",
      "B.'Abd Shams",
      "Born Muslim",
      "Abyssinia 2"
    ]
  },
  "parents": [
    {
      "id": "150",
      "name": "Khalid bin Sa`id ibn al-'As ( خالد بن سعيد بن العاص بن أمية ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "737",
      "name": "Umayna bint Khalaf ( أميمة/همينة بنت خلف بن أسعد ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "spouses": [
    {
      "id": "7",
      "name": "Zubayr ibn al-Awwam ( الزبير بن العوام بن خويلد ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "siblings": [
    {
      "id": "739",
      "name": "Sa'id bin Khalid ibn Sa'id ( سعيد بن خالد بن سعيد بن العاص بن أمية ( رضي الله عنه",
      "grade": "Comp.(RA)"
    }
  ],
  "children": [
    {
      "id": "10548",
      "name": "Khalid bin al-Zubayr خالد بن الزبير بن العوام",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "10549",
      "name": "'Amr bin al-Zubayr عمرو بن الزبير بن العوام",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "10550",
      "name": "Habibah bint al-Zubayr حبيبة بنت الزبير بن العوام",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "10551",
      "name": "Sawda bint al-Zubayr سودة بنت الزبير بن العوام",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "10552",
      "name": "Hind bint al-Zubayr هند بنت الزبير بن العوام",
      "grade": "Follower(Tabi')"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "students": [
    {
      "id": "11509",
      "name": "Sa'id bin 'Amr bin Sa'id bin al-Aas سعيد بن عمرو بن سعيد بن العاص",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "3071",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا حبان بن موسى، أخبرنا عبد الله، عن خالد بن سعيد، عن أبيه، عن أم خالد بنت خالد بن سعيد، قالت أتيت رسول الله صلى الله عليه وسلم مع أبي وعلى قميص أصفر، قال رسول الله صلى الله عليه وسلم ‏\"‏ سنه سنه ‏\"‏‏.‏ قال عبد الله وهى بالحبشية حسنة‏.‏ قالت فذهبت ألعب بخاتم النبوة، فزبرني أبي قال رسول الله صلى الله عليه وسلم ‏\"‏ دعها ‏\"‏‏.‏ ثم قال رسول الله ‏\"‏ أبلي وأخلفي، ثم أبلي وأخلفي، ثم أبلي وأخلفي ‏\"‏‏.‏ قال عبد الله فبقيت حتى ذكر‏.‏",
      "text_en": " Narrated Um Khalid:                     (the daughter of Khalid bin Sa`id) I went to Allah's Apostle with my father and I was Nearing a yellow shirt. Allah's Apostle said, \"Sanah, Sanah!\" (`Abdullah, the narrator, said that 'Sanah' meant 'good' in the Ethiopian language). I then started playing with the seal of Prophethood (in between the Prophet's shoulders) and my father rebuked me harshly for that. Allah's Apostle said. \"Leave her,\" and then Allah's Apostle (invoked Allah to grant me a long life) by saying (thrice), \"Wear this dress till it is worn out and then wear it till it is worn out, and then wear it till it is worn out.\" (The narrator adds, \"It is said that she lived for a long period, wearing that (yellow) dress till its color became dark because of long wear.\")",
      "chain": [
        "30322",
        "20025",
        "20422",
        "11509",
        "740"
      ]
    },
    {
      "hadith_no": "3922",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، حدثنا إسحاق بن سعيد السعيدي، عن أبيه، عن أم خالد بنت خالد، قالت قدمت من أرض الحبشة وأنا جويرية، فكساني رسول الله صلى الله عليه وسلم خميصة لها أعلام، فجعل رسول الله صلى الله عليه وسلم يمسح الأعلام بيده ويقول ‏\"‏ سناه، سناه ‏\"‏‏.‏ قال الحميدي يعني حسن حسن‏.‏",
      "text_en": " Narrated Um Khalid bint Khalid:                     When I came from Ethiopia (to Medina), I was a young girl. Allah's Apostle made me wear a sheet having marks on it. Allah's Apostle was rubbing those marks with his hands saying, \"Sanah! Sanah!\" (i.e. good, good).",
      "chain": [
        "30418",
        "20005",
        "20309",
        "11509",
        "740"
      ]
    },
    {
      "hadith_no": "5906",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا أبو الوليد، حدثنا إسحاق بن سعيد بن عمرو بن سعيد بن العاص، قال حدثني أبي قال، حدثتني أم خالد بنت خالد، قالت أتي رسول الله صلى الله عليه وسلم بثياب فيها خميصة سوداء قال ‏\"‏ من ترون نكسوها هذه الخميصة ‏\"‏‏.‏ فأسكت القوم‏.‏ قال ‏\"‏ ائتوني بأم خالد ‏\"‏‏.‏ فأتي بي النبي صلى الله عليه وسلم فألبسها بيده وقال ‏\"‏ أبلي وأخلقي ‏\"‏‏.‏ مرتين فجعل ينظر إلى علم الخميصة، ويشير بيده إلى ويقول ‏\"‏ يا أم خالد هذا سنا ‏\"‏‏.‏ والسنا بلسان الحبشية الحسن‏.‏ قال إسحاق حدثتني امرأة من أهلي أنها رأته على أم خالد‏.‏",
      "text_en": " Narrated Um Khalid bint Khalid:                     Some clothes were presented to Allah's Apostle as a gift and there was a black Khamisa with it. The Prophet asked (his companions), \"To whom do you suggest we give this Khamisa?\" The people kept quiet. Then he said, \"Bring me Um Khalid,\" So I was brought to him and he dressed me with it with his own hands and said twice, \"May you live so long that you will wear out many garments.\" He then started looking at the embroidery of that Khamisa and said, \"O Um Khalid! This is Sana!\" (Sana in Ethiopian language means beautiful.) 'Is-haq, a sub-narrator, said: A woman of my family had told me that she had seen the Khamisa worn by Um Khalid.",
      "chain": [
        "20296",
        "20309",
        "11509",
        "740"
      ]
    },
    {
      "hadith_no": "6059",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا حبان، أخبرنا عبد الله، عن خالد بن سعيد، عن أبيه، عن أم خالد بنت خالد بن سعيد، قالت أتيت رسول الله صلى الله عليه وسلم مع أبي وعلى قميص أصفر، قال رسول الله صلى الله عليه وسلم ‏\"‏ سنه سنه ‏\"‏‏.‏ قال عبد الله وهى بالحبشية حسنة‏.‏ قالت فذهبت ألعب بخاتم النبوة، فزجرني أبي‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ دعها ‏\"‏‏.‏ ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ أبلي وأخلقي، ثم أبلي وأخلقي، ثم أبلي وأخلقي ‏\"‏‏.‏ قال عبد الله فبقيت حتى ذكر‏.‏ يعني من بقائها‏.‏",
      "text_en": " Narrated Sa`id:                     Um Khalid bint Khalid bin Sa`id said, \"I came to Allah's Apostle along with my father and I was wearing a yellow shirt. Allah's Apostle said, \"Sanah Sanah!\" (`Abdullah, the sub-narrator said, \"It means, 'Nice, nice!' in the Ethiopian language.\") Um Khalid added, \"Then I started playing with the seal of Prophethood. My father admonished me. But Allah's Apostle said (to my father), \"Leave her,\" Allah's Apostle (then addressing me) said, \"May you live so long that your dress gets worn out, and you will mend it many times, and then wear another till it gets worn out (i.e. May Allah prolong your life).\" (The sub-narrator, `Abdullah aid, \"That garment (which she was wearing remained usable for a long period.\").",
      "chain": [
        "20218",
        "20025",
        "20422",
        "11509",
        "740"
      ]
    },
    {
      "hadith_no": "6438",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، حدثنا موسى بن عقبة، قال سمعت أم خالد بنت خالد  قال ولم أسمع أحدا سمع من النبي، صلى الله عليه وسلم غيرها  قالت سمعت النبي صلى الله عليه وسلم يتعوذ من عذاب القبر‏.‏",
      "text_en": " Narrated Um Khalid bint Khalid:                     I heard the Prophet seeking refuge with Allah from the punishment of the grave.",
      "chain": [
        "30418",
        "20005",
        "11106",
        "740"
      ]
    },
    {
      "hadith_no": "4024",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا إسحاق بن الجراح الأذني، حدثنا أبو النضر، حدثنا إسحاق بن سعيد، عن أبيه، عن أم خالد بنت خالد بن سعيد بن العاص، أن رسول الله صلى الله عليه وسلم أتي بكسوة فيها خميصة صغيرة فقال ‏\"‏ من ترون أحق بهذه ‏\"‏ ‏.‏ فسكت القوم فقال ‏\"‏ ائتوني بأم خالد ‏\"‏ ‏.‏ فأتي بها فألبسها إياها ثم قال ‏\"‏ أبلي وأخلقي ‏\"‏ ‏.‏ مرتين وجعل ينظر إلى علم في الخميصة أحمر أو أصفر ويقول ‏\"‏ سناه سناه يا أم خالد ‏\"‏ ‏.‏ وسناه في كلام الحبشة الحسن ‏.‏",
      "text_en": " Narrated Umm Khalid, daughter of Sa'd b. al-'As:                     Once the Messenger of Allah (ﷺ) was brought some garments among which was a small cloak with a border and black stripes. He said: Whom do you think to be more deserving for it ? The people kept silence. He said: Bring Umm Khalid. The she was carried to him and he put it on her, saying: Wear it out and make it ragged twice. Then he went on looking at red or yellow marks on it, and said: This is sanah, sanah, Umm Khalid. It means \"beautiful\" in the language of the Abyssinians.",
      "chain": [
        "20390",
        "20309",
        "11509",
        "740"
      ]
    }
  ],
  "total_hadiths": 6
}