{
  "id": "76",
  "name": "Khawlah bint Hakim ( خولة بنت حكيم بن أمية ( رضي الله عنها",
  "full_name": "Khawlah bint Hakim ( خولة بنت حكيم بن أمية ( رضي الله عنها",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Makkah"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Madinah",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah",
      "Medina"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ عخ  م  ت  س  ق  -  صحابي ]"
    ],
    "tags": [
      "Female",
      "B.Sulaym",
      "Early Muslim"
    ]
  },
  "parents": [],
  "spouses": [
    {
      "id": "121",
      "name": "'Uthman bin Maz'un ( عثمان بن مظعون ( رضي الله عنه",
      "grade": "Comp.(RA)"
    }
  ],
  "siblings": [],
  "children": [
    {
      "id": "444",
      "name": "'Abdur Rahman ibn Uthman bin Maz'un ( عبد الرحمن بن عثمان بن مظعون الجمحي ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "474",
      "name": "al-Sa'ib ibn Uthman bin Maz'un ( السائب بن عثمان بن مظعون الجمحي ( رضي الله عنه",
      "grade": "Comp.(RA)"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "students": [
    {
      "id": "9",
      "name": "Sa'd ibn Abi Waqqas ( سعد بن أبي وقاص ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11002",
      "name": "Sa'id ibn al-Musayyib سعيد بن المسيب بن حزن أبو محمد القرشي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "10511",
      "name": "'Urwa ibn al-Zubayr عروة بن الزبير",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11010",
      "name": "'Umar bin ‘Abdul-‘Aziz عمر بن عبد العزيز",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11222",
      "name": "Muhammad bin Yahya bin Hiban محمد بن يحيى بن حبان",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "7053",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا ليث، ح وحدثنا محمد بن رمح، واللفظ، له أخبرنا  الليث، عن يزيد بن أبي حبيب، عن الحارث بن يعقوب، أن يعقوب بن عبد الله، حدثه أنه، سمع بسر بن سعيد، يقول سمعت سعد بن أبي وقاص، يقول سمعت خولة بنت حكيم السلمية، تقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من نزل منزلا ثم قال أعوذ بكلمات الله التامات من شر ما خلق ‏.‏ لم يضره شىء حتى يرتحل من منزله ذلك ‏\"‏ ‏.‏",
      "text_en": " Khaula bint Hakim Sulamiyya reported:                      I heard Allah's Messenger (may peace be upon him) as saying: When anyone lands at a place, and then says:\" I seek refuge in the Perfect Word of Allah from the evil of what He has created,\" nothing would harm him until he marches from that stopping place.",
      "chain": [
        "30367",
        "20023",
        "30490",
        "20023",
        "11411",
        "10854",
        "11153",
        "9",
        "76"
      ]
    },
    {
      "hadith_no": "7054",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "وحدثنا هارون بن معروف، وأبو الطاهر، كلاهما عن ابن وهب، - واللفظ لهارون - حدثنا عبد الله بن وهب، قال وأخبرنا عمرو، - وهو ابن الحارث - أن يزيد بن أبي، حبيب والحارث بن يعقوب حدثاه عن يعقوب بن عبد الله بن الأشج، عن بسر بن سعيد، عن سعد بن أبي وقاص، عن خولة بنت حكيم السلمية، أنها سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إذا نزل أحدكم منزلا فليقل أعوذ بكلمات الله التامات من شر ما خلق ‏.‏ فإنه لا يضره شىء حتى يرتحل منه ‏\"‏ ‏.‏  قال يعقوب وقال القعقاع بن حكيم عن ذكوان أبي صالح، عن أبي هريرة، أنه قال جاء رجل إلى النبي صلى الله عليه وسلم فقال يا رسول الله ما لقيت من عقرب لدغتني البارحة قال ‏\"‏ أما لو قلت حين أمسيت أعوذ بكلمات الله التامات من شر ما خلق لم تضرك ‏\"‏ ‏.‏",
      "text_en": " Khaula bint Hakim Sulamiyya reported:                      I heard Allah's Messenger (may peace be upon him) as saying: When any one of you stays at a place, he should say:\" I seek refuge in the Perfect Word of Allah from the evil of that He created.\" Nothing would then do him any harm until he moves from that place. Abu Huraira reported that a person came to Allah's Messenger (may peace be upon him) and said:\" Allah's Messenger, I was stung by a scorpion during the night. Thereupon he said: Had you recited these words in the evening:\" I seek refuge in the Perfect Word of Allah from the evil of what He created,\" it would not have done any harm to you.",
      "chain": [
        "30280",
        "20029",
        "10629",
        "11153",
        "9",
        "76"
      ]
    },
    {
      "hadith_no": "3437",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا قتيبة، حدثنا الليث، عن يزيد بن أبي حبيب، عن الحارث بن يعقوب، عن يعقوب بن عبد الله بن الأشج، عن بسر بن سعيد، عن سعد بن أبي وقاص، عن خولة بنت حكيم السلمية، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ من نزل منزلا ثم قال أعوذ بكلمات الله التامات من شر ما خلق لم يضره شيء حتى يرتحل من منزله ذلك ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح غريب ‏.‏ وروى مالك بن أنس هذا الحديث أنه بلغه عن يعقوب بن عبد الله بن الأشج فذكر نحو هذا الحديث ‏.‏ وروي عن ابن عجلان هذا الحديث عن يعقوب بن عبد الله بن الأشج ويقول عن سعيد بن المسيب عن خولة ‏.‏ قال وحديث الليث أصح من رواية ابن عجلان ‏.‏",
      "text_en": " Sa’d bin Abi Waqqas narrated:                     From Khawlah bint Al Hakim As-Sulamiyyah, that the Messenger of Allah said: “Whoever stops at a stopping place and then says: ‘I seek refuge in Allah’s Perfect Words from the evil of what He has created, (A’udhu Bi-Kalimatillahit-Tammati Min Sharri Ma Khalaq)’ nothing shall harm him until he departs from that stopping place of his.”",
      "chain": [
        "30367",
        "20023",
        "11411",
        "10854",
        "10629",
        "11153",
        "9",
        "76"
      ]
    },
    {
      "hadith_no": "199",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا يوسف بن سعيد، قال حدثنا حجاج، عن شعبة، قال سمعت عطاء الخراساني، عن سعيد بن المسيب، عن خولة بنت حكيم، قالت سألت رسول الله صلى الله عليه وسلم عن المرأة تحتلم في منامها فقال ‏\"‏ إذا رأت الماء فلتغتسل ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Khawlah bin Hakim said:                      \"I asked the Messenger of Allah (ﷺ) about a woman who has a wet dream and he said: 'If she sees water, let her perform Ghusl.'\"",
      "chain": [
        "20219",
        "20020",
        "10947",
        "11002",
        "76"
      ]
    },
    {
      "hadith_no": "645",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعلي بن محمد، قالا حدثنا وكيع، عن سفيان، عن علي بن زيد، عن سعيد بن المسيب، عن خولة بنت حكيم، أنها سألت رسول الله  صلى الله عليه وسلم  عن المرأة ترى في منامها ما يرى الرجل فقال ‏\"‏ ليس عليها غسل حتى تنزل كما أنه ليس على الرجل غسل حتى ينزل ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Khawlah bint Hakim that:                     She asked the Messenger of Allah about a woman who sees in her dream that which a man sees. He said: \"She does not have to take a bath unless she has an orgasm, just as man does not have to take a bath unless he has an orgasm.\"",
      "chain": [
        "30201",
        "38409",
        "20032",
        "20012",
        "10664",
        "11002",
        "76"
      ]
    },
    {
      "hadith_no": "3676",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عفان، حدثنا وهيب، حدثنا محمد بن عجلان، عن يعقوب بن عبد الله بن الأشج، عن سعيد بن المسيب، عن سعد بن مالك، عن خولة بنت حكيم، أن النبي  صلى الله عليه وسلم  قال ‏\"‏ لو أن أحدكم إذا نزل منزلا قال أعوذ بكلمات الله التامة من شر ما خلق - لم يضره في ذلك المنزل شىء حتى يرتحل منه ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Khawlah bint Hakim that the Prophet (ﷺ) said:                     “Ifanyone of you, when he stops to camp (while on a journey), saysA’udhu bi kalimatil-lahit-tammati min sharri ma khalaq (I seekrefugein the Perfect Words of Allah from the evil of that which Hehascreated), then nothing will harm him in that place until he moveson.”",
      "chain": [
        "30201",
        "30106",
        "20299",
        "10616",
        "10629",
        "11002",
        "76"
      ]
    }
  ],
  "total_hadiths": 6
}