{
  "id": "8",
  "name": "'Abdur Rahman Ibn 'Awf ( عبد الرحمن بن عوف ( رضي الله عنه",
  "full_name": "'Abdur Rahman Ibn 'Awf ( عبد الرحمن بن عوف ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "43",
      "date_gregorian": "580",
      "date_display": [
        "43 BH",
        "580 CE"
      ],
      "place": "est., Makkah"
    },
    "death": {
      "date_hijri": "32",
      "date_gregorian": "654",
      "date_display": null,
      "place": "Medianh",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah",
      "Abyssinia",
      "Medinah"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ ع  -  صحابة ]",
      "Commander"
    ],
    "tags": [
      "Quraish",
      "B.Zuhrah",
      "Early Muslim",
      "Abyssinia 1",
      "Abyssinia 2",
      "Emigrant",
      "Badr",
      "Promised Paradise",
      "Baqi'"
    ]
  },
  "parents": [
    {
      "id": "589",
      "name": "al-Shifa' bint 'Awf ( الشفاء بنت عوف بن عبد بن الحارث ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "spouses": [
    {
      "id": "962",
      "name": "Umm Kulthum bint 'Utba b. Rabi'a ( أم كلثوم بنت عتبة بن ربيعة بن عبد شمس ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "95",
      "name": "Umm Kulthum bint 'Uqba ( أم كلثوم بنت عقبة بن أبي معيط ( رضي الله عنها",
      "grade": "Comp.(RA) [3rd Generation]"
    },
    {
      "id": "595",
      "name": "Sahla bint 'Asim bin 'Ady ( سهلة بنت عاصم بن عدي الأنصارية ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "65",
      "name": "Sehlah bint Suhayl ( سهلة بنت سهيل بن عمرو ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "596",
      "name": "Umm Hakim bint Qariz bin Khalid ( أم حكيم بنت قارظ بن خالد ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "593",
      "name": "Tumadir bint al-Asbagh Kalbia ( تماضر بنت الأصبغ الكلبية ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "777",
      "name": "Asma' bint Salama/Makhrabah ( أسماء بنت سلامة ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "3258",
      "name": "Badiyya bint Ghilan al-Thaqafi ( بادية بنت غيلان بن سلمة الثقفي ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "siblings": [
    {
      "id": "590",
      "name": "'Atika bint 'Awf ( عاتكة بنت عوف بن عبد عوف ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "591",
      "name": "al-Shifa' bint 'Awf ( الشفاء بنت عوف بن عبد عوف ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "592",
      "name": "'Abdullah Ibn 'Awf ( عبد الله بن عوف الزهري ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "594",
      "name": "Halah bint 'Awf ( هالة بنت عوف الزهرية ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "children": [
    {
      "id": "588",
      "name": "Muhammad bin 'Abdur-Rahman ( محمد بن عبد الرحمن بن عوف الزهرى ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "584",
      "name": "Ibrahim bin 'Abdur Rahman ( إبراهيم بن عبد الرحمن بن عوف الزهرى ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "10561",
      "name": "Humaid bin 'Abdur Rahman حميد بن عبد الرحمن بن عوف الزهرى",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "10560",
      "name": "'Umar bin 'Abdur Rahman bin Awf عمر بن عبد الرحمن بن عوف",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10562",
      "name": "Zayd bin 'Abdur Rahman زيد بن عبد الرحمن بن عوف الزهرى",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "10563",
      "name": "'Urwa bin 'Abdur Rahman عروة الأكبر بن عبد الرحمن بن عوف الزهرى",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "10564",
      "name": "Salim bin 'Abdur Rahman سالم الأصغر بن عبد الرحمن بن عوف الزهرى",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "10566",
      "name": "Abu Bakr bin 'Abdur Rahman أبو بكر بن عبد الرحمن بن عوف الزهرى",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "10565",
      "name": "'Abdullah bin 'Abdur Rahman عبد الله بن عبد الرحمن بن عوف الزهرى",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "10567",
      "name": "Abu Salama bin 'Abdur Rahman أبو سلمة بن عبد الرحمن بن عوف",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10568",
      "name": "'Abdur Rahman bin 'Abdur Rahman عبد الرحمن بن عبد الرحمن بن عوف الزهرى",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "10569",
      "name": "Mus'ub bin 'Abdur Rahman مصعب بن عبد الرحمن بن عوف",
      "grade": "Follower(Tabi')"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "3",
      "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "584",
      "name": "Ibrahim bin 'Abdur Rahman ( إبراهيم بن عبد الرحمن بن عوف الزهرى ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "10561",
      "name": "Humaid bin 'Abdur Rahman حميد بن عبد الرحمن بن عوف الزهرى",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "10560",
      "name": "'Umar bin 'Abdur Rahman bin Awf عمر بن عبد الرحمن بن عوف",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10569",
      "name": "Mus'ub bin 'Abdur Rahman مصعب بن عبد الرحمن بن عوف",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "10567",
      "name": "Abu Salama bin 'Abdur Rahman أبو سلمة بن عبد الرحمن بن عوف",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "18999",
      "name": "al-Maswar bin Ibrahim المسور بن إبراهيم بن عبد الرحمن",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "2201",
      "name": "al-Miswar bin Makhrama bin Nawfal ( المسور بن مخرمة بن نوفل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "34",
      "name": "Jabir ibn 'Abdullah ( جابر بن عبد الله بن عمرو السلمي الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "871",
      "name": "Jubayr bin Mut'im ( جبير بن مطعم ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11577",
      "name": "Bjalh bin Abd'h al-Tmymy al-Nbry بجالة بن عبدة",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "5030",
      "name": "Malik bin Aws bin al-Hadathan ( مالك بن أوس بن الحدثان النصري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "12551",
      "name": "Nawful bin Iyas al-Hdhly نوفل بن إياس الهذلي المدني",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "13510",
      "name": "Rdad al-Lythy Wqal B'd'hm Abu رداد الليثي وقال",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "709",
      "name": "'Abdullah bin 'Amir bin Rabi'a ( عبد الله بن عامر بن ربيعة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11058",
      "name": "Muhammad bin Jubayr bin Mut'im محمد بن جبير بن مطعم بن عدي",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1275",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن مقاتل، أخبرنا عبد الله، أخبرنا شعبة، عن سعد بن إبراهيم، عن أبيه، إبراهيم أن عبد الرحمن بن عوف  رضى الله عنه  أتي بطعام وكان صائما فقال قتل مصعب بن عمير وهو خير مني، كفن في بردة، إن غطي رأسه بدت رجلاه، وإن غطي رجلاه بدا رأسه  وأراه قال  وقتل حمزة وهو خير مني، ثم بسط لنا من الدنيا ما بسط  أو قال أعطينا من الدنيا ما أعطينا  وقد خشينا أن تكون حسناتنا عجلت لنا، ثم جعل يبكي حتى ترك الطعام‏.‏",
      "text_en": " Narrated Ibrahim:                     Once a meal was brought to `Abdur-Rahman bin `Auf and he was fasting. He said, \"Mustab bin `Umar was martyred and he was better than I and was shrouded in his Burd and when his head was covered with it, his legs became bare, and when his legs were covered his head got uncovered. Hamza was martyred and was better than I. Now the worldly wealth have been bestowed upon us (or said a similar thing). No doubt, I fear that the rewards of my deeds might have been given earlier in this world.\" Then he started weeping and left his food.",
      "chain": [
        "30118",
        "20025",
        "20020",
        "11063",
        "8"
      ]
    },
    {
      "hadith_no": "2048",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا إبراهيم بن سعد، عن أبيه، عن جده، قال قال عبد الرحمن بن عوف  رضى الله عنه  لما قدمنا المدينة آخى رسول الله صلى الله عليه وسلم بيني وبين سعد بن الربيع فقال سعد بن الربيع إني أكثر الأنصار مالا، فأقسم لك نصف مالي، وانظر أى زوجتى هويت نزلت لك عنها، فإذا حلت تزوجتها‏.‏ قال فقال عبد الرحمن لا حاجة لي في ذلك، هل من سوق فيه تجارة قال سوق قينقاع‏.‏ قال فغدا إليه عبد الرحمن، فأتى بأقط وسمن  قال  ثم تابع الغدو، فما لبث أن جاء عبد الرحمن عليه أثر صفرة، فقال رسول الله صلى الله عليه وسلم ‏\"‏ تزوجت ‏\"‏‏.‏ قال نعم‏.‏ قال ‏\"‏ ومن ‏\"‏‏.‏ قال امرأة من الأنصار‏.‏ قال ‏\"‏ كم سقت ‏\"‏‏.‏ قال زنة نواة من ذهب أو نواة من ذهب‏.‏ فقال له النبي صلى الله عليه وسلم ‏\"‏ أولم ولو بشاة ‏\"‏‏.‏",
      "text_en": " Narrated Ibrahim bin Sa`d from his father from his grandfather:                     `Abdur Rahman bin `Auf said, \"When we came to Medina as emigrants, Allah's Apostle established a bond of brotherhood between me and Sa`d bin Ar-Rabi`. Sa`d bin Ar-Rabi` said (to me), 'I am the richest among the Ansar, so I will give you half of my wealth and you may look at my two wives and whichever of the two you may choose I will divorce her, and when she has completed the prescribed period (before marriage) you may marry her.' `Abdur-Rahman replied, \"I am not in need of all that. Is there any marketplace where trade is practiced?' He replied, \"The market of Qainuqa.\" `Abdur- Rahman went to that market the following day and brought some dried buttermilk (yogurt) and butter, and then he continued going there regularly. Few days later, `Abdur-Rahman came having traces of yellow (scent) on his body. Allah's Apostle asked him whether he had got married. He replied in the affirmative. The Prophet said, 'Whom have you married?' He replied, 'A woman from the Ansar.' Then the Prophet asked, 'How much did you pay her?' He replied, '(I gave her) a gold piece equal in weigh to a date stone (or a date stone of gold)! The Prophet said, 'Give a Walima (wedding banquet) even if with one sheep .' \"",
      "chain": [
        "30105",
        "20150",
        "11063",
        "8"
      ]
    },
    {
      "hadith_no": "2219",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن سعد، عن أبيه، قال عبد الرحمن بن عوف  رضى الله عنه  لصهيب اتق الله ولا تدع إلى غير أبيك‏.‏ فقال صهيب ما يسرني أن لي كذا وكذا، وأني قلت ذلك، ولكني سرقت وأنا صبي‏.‏",
      "text_en": " Narrated Sa`d that his father said:                     `Abdur-Rahman bin `Auf said to Suhaib, 'Fear Allah and do not ascribe yourself to somebody other than your father.' Suhaib replied, 'I would not like to say it even if I were given large amounts of money, but I say I was kidnapped in my childhood.' \"",
      "chain": [
        "30160",
        "20278",
        "20020",
        "9",
        "8"
      ]
    },
    {
      "hadith_no": "2301",
      "source": " Sahih Bukhari ",
      "chapter": "Representation; Authorization; Business by Proxy - كتاب الوكالة",
      "chapter_no": "40",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، قال حدثني يوسف بن الماجشون، عن صالح بن إبراهيم بن عبد الرحمن بن عوف، عن أبيه، عن جده عبد الرحمن بن عوف  رضى الله عنه  قال كاتبت أمية بن خلف كتابا بأن يحفظني في صاغيتي بمكة، وأحفظه في صاغيته بالمدينة، فلما ذكرت الرحمن قال لا أعرف الرحمن، كاتبني باسمك الذي كان في الجاهلية‏.‏ فكاتبته عبد عمرو فلما كان في يوم بدر خرجت إلى جبل لأحرزه حين نام الناس فأبصره بلال فخرج حتى وقف على مجلس من الأنصار فقال أمية بن خلف، لا نجوت إن نجا أمية‏.‏ فخرج معه فريق من الأنصار في آثارنا، فلما خشيت أن يلحقونا خلفت لهم ابنه، لأشغلهم فقتلوه ثم أبوا حتى يتبعونا، وكان رجلا ثقيلا، فلما أدركونا قلت له ابرك‏.‏ فبرك، فألقيت عليه نفسي لأمنعه، فتخللوه بالسيوف من تحتي، حتى قتلوه، وأصاب أحدهم رجلي بسيفه، وكان عبد الرحمن بن عوف يرينا ذلك الأثر في ظهر قدمه‏.‏ قال أبو عبد الله سمع يوسف صالحا وإبراهيم أباه",
      "text_en": " Narrated `Abdur-Rahman bin `Auf:                     I got an agreement written between me and Umaiya bin Khalaf that Umaiya would look after my property (or family) in Mecca and I would look after his in Medina. When I mentioned the word 'Ar64 Rahman' in the documents, Umaiya said, \"I do not know 'Ar-Rahman.' Write down to me your name, (with which you called yourself) in the Pre-Islamic Period of Ignorance.\" So, I wrote my name ' `Abdu `Amr'. On the day (of the battle) of Badr, when all the people went to sleep, I went up the hill to protect him. Bilal(1) saw him (i.e. Umaiya) and went to a gathering of Ansar and said, \"(Here is) Umaiya bin Khalaf! Woe to me if he escapes!\" So, a group of Ansar went out with Bilal to follow us (`Abdur-Rahman and Umaiya). Being afraid that they would catch us, I left Umaiya's son for them to keep them busy but the Ansar killed the son and insisted on following us. Umaiya was a fat man, and when they approached us, I told him to kneel down, and he knelt, and I laid myself on him to protect him, but the Ansar killed him by passing their swords underneath me, and one of them injured my foot with his sword. (The sub narrator said, \" `Abdur-Rahman used to show us the trace of the wound on the back of his foot.\")",
      "chain": [
        "30105",
        "20027",
        "11064",
        "584",
        "8"
      ]
    },
    {
      "hadith_no": "4668",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا يحيى بن يحيى التميمي، أخبرنا يوسف بن الماجشون، عن صالح بن إبراهيم، بن عبد الرحمن بن عوف عن أبيه، عن عبد الرحمن بن عوف، أنه قال بينا أنا واقف، في الصف يوم بدر نظرت عن يميني، وشمالي، فإذا أنا بين، غلامين من الأنصار حديثة أسنانهما تمنيت لو كنت بين أضلع منهما فغمزني أحدهما ‏.‏ فقال يا عم هل تعرف أبا جهل قال قلت نعم وما حاجتك إليه يا ابن أخي قال أخبرت أنه يسب رسول الله صلى الله عليه وسلم والذي نفسي بيده لئن رأيته لا يفارق سوادي سواده حتى يموت الأعجل منا ‏.‏ قال فتعجبت لذلك فغمزني الآخر فقال مثلها - قال - فلم أنشب أن نظرت إلى أبي جهل يزول في الناس فقلت ألا تريان هذا صاحبكما الذي تسألان عنه قال فابتدراه فضرباه بسيفيهما حتى قتلاه ثم انصرفا إلى رسول الله صلى الله عليه وسلم فأخبراه ‏.‏ فقال ‏\"‏ أيكما قتله ‏\"‏ ‏.‏ فقال كل واحد منهما أنا قتلت ‏.‏ فقال ‏\"‏ هل مسحتما سيفيكما ‏\"‏ ‏.‏ قالا لا ‏.‏ فنظر في السيفين فقال ‏\"‏ كلاكما قتله ‏\"‏ ‏.‏ وقضى بسلبه لمعاذ بن عمرو بن الجموح والرجلان معاذ بن عمرو بن الجموح ومعاذ ابن عفراء ‏.‏",
      "text_en": " It has been narrated on the authority of 'Abd al-Rahman b. Auf who said:                      While I was standing in the battle array on the Day of Badr, I looked towards my right and my left, and found myself between two boys from the Ansar quite young in age. I wished I were between stronger persons. One of them made a sign to me and. said: Uncle, do you recognise Abu Jahl? 1 said: Yes. What do you want to do with him, O my nephew? He said: I have been told that he abuses the Messenger of Allah (may peace be upon him). By Allah, in Whose Hand is my life, if I see him (I will grapple with him) and will not leave him until one of us who is destined to die earlier is killed. The narrator said: I wondered at this. Then the other made a sign to me and said similar words. Soon after I saw Abu Jahl. He was moving about among men. I said to the two boys: Don't you see? He is the man you were inquiring about. (As soon as they heard this), they dashed towards him, struck him with their swords until he was killed. Then they returned to the Messenger of Allah (may peace be upon him) and informed him (to this effect). He asked: Which of you has killed him? Each one of them said: I have killed him. He said: Have you wiped your swords? They said: No. He examined their swords and said: Both of you have killed him. He then decided that the belongings of Abu Jahl he handed over to Mu'adh b. Amr b. al-Jamuh. And the two boys were Mu'adh b. Amr b. Jawth and Mu'adh b. Afra.",
      "chain": [
        "30399",
        "20027",
        "11064",
        "584",
        "8"
      ]
    },
    {
      "hadith_no": "1694",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا مسدد، وأبو بكر بن أبي شيبة قالا حدثنا سفيان، عن الزهري، عن أبي سلمة، عن عبد الرحمن بن عوف، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ قال الله أنا الرحمن وهي الرحم شققت لها اسما من اسمي من وصلها وصلته ومن قطعها بتته ‏\"‏ ‏.‏",
      "text_en": " Narrated AbdurRahman ibn Awf:                     I heard the Messenger of Allah (ﷺ) say: Allah the Exalted has said: I am Compassionate, and this has been derived from mercy. I have derived its name from My name. If anyone joins it, I shall join him, and if anyone cuts it off, I shall cut him off.",
      "chain": [
        "30175",
        "30201",
        "20005",
        "11013",
        "10567",
        "8"
      ]
    },
    {
      "hadith_no": "1695",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن المتوكل العسقلاني، حدثنا عبد الرزاق، أخبرنا معمر، عن الزهري، حدثني أبو سلمة، أن الرداد الليثي، أخبره عن عبد الرحمن بن عوف، أنه سمع رسول الله صلى الله عليه وسلم بمعناه ‏.‏",
      "text_en": " The above mentioned tradition has also been narrated by `Abd al-Rahman bin ‘Awf from the Messenger of Allah (SWAS) through a  different chain of narrators to the same effect.",
      "chain": [
        "38581",
        "20121",
        "20115",
        "11013",
        "10567",
        "8"
      ]
    },
    {
      "hadith_no": "3103",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا القعنبي، عن مالك، عن ابن شهاب، عن عبد الحميد بن عبد الرحمن بن زيد بن الخطاب، عن عبد الله بن عبد الله بن الحارث بن نوفل، عن عبد الله بن عباس، قال قال عبد الرحمن بن عوف سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إذا سمعتم به بأرض فلا تقدموا عليه وإذا وقع بأرض وأنتم بها فلا تخرجوا فرارا منه ‏\"‏ ‏.‏ يعني الطاعون ‏.‏",
      "text_en": " Narrated 'Abd Allah b. 'Abbas:                     That 'Abd al-Rahman b.'Awf said: I heard the Messenger of Allah (ﷺ) say: When you hear that it is breaking out in a certain territory, do not go there. It it breaks out in the territory you are in, do not go out flying away from it. By it he referred to plague.",
      "chain": [
        "20164",
        "20001",
        "11013",
        "11190",
        "11513",
        "17",
        "8"
      ]
    },
    {
      "hadith_no": "4079",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد بن إسماعيل، مولى بني هاشم حدثنا عثمان بن عثمان الغطفاني، حدثنا سليمان بن خربوذ، حدثني شيخ، من أهل المدينة قال سمعت عبد الرحمن بن عوف، يقول عممني رسول الله صلى الله عليه وسلم فسدلها بين يدى ومن خلفي ‏.‏",
      "text_en": " Narrated AbdurRahman ibn Awf:                     The Messenger of Allah (ﷺ) put a turban on me and let the ends hang in front of him and behind me.",
      "chain": [
        "34188",
        "20559",
        "18382",
        "8"
      ]
    },
    {
      "hadith_no": "4360",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا حميد بن عبد الرحمن، عن أبيه، عن أبي إسحاق، عن الشعبي، عن جرير، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ إذا أبق العبد إلى الشرك فقد حل دمه ‏\"‏ ‏.‏",
      "text_en": " Jarir reported the prophet (ﷺ) as saying:                      When a slave runs away and reverts to polytheism, he may lawfully be killed.",
      "chain": [
        "30367",
        "10561",
        "8",
        "11049",
        "11052",
        "4057"
      ]
    },
    {
      "hadith_no": "398",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن خالد ابن عثمة البصري، حدثنا إبراهيم بن سعد، قال حدثني محمد بن إسحاق، عن مكحول، عن كريب، عن ابن عباس، عن عبد الرحمن بن عوف، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ إذا سها أحدكم في صلاته فلم يدر واحدة صلى أو ثنتين فليبن على واحدة فإن لم يدر ثنتين صلى أو ثلاثا فليبن على ثنتين فإن لم يدر ثلاثا صلى أو أربعا فليبن على ثلاث وليسجد سجدتين قبل أن يسلم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وقد روي هذا الحديث عن عبد الرحمن بن عوف من غير هذا الوجه رواه الزهري عن عبيد الله بن عبد الله بن عتبة عن ابن عباس عن عبد الرحمن بن عوف عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Abdur-Rahman bi Awf narrated that he heard the Prophet (S) saying:                     \"When one of you becomes forgetful in his Salat so that he does not know if he prayed one or two, then let him consider it one. When he does not know if he prayed three or four, then let him consider it three, and let him perform two prostrations before he says the Taslim.\"",
      "chain": [
        "30160",
        "38496",
        "20150",
        "11107",
        "11066",
        "11211",
        "17",
        "8"
      ]
    },
    {
      "hadith_no": "1587",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Military Expeditions - كتاب السير عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "21",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان بن عيينة، عن عمرو بن دينار، عن بجالة، أن عمر، كان لا يأخذ الجزية من المجوس حتى أخبره عبد الرحمن بن عوف أن النبي صلى الله عليه وسلم أخذ الجزية من مجوس هجر ‏.‏ وفي الحديث كلام أكثر من هذا ‏.‏ هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Bajalah:                     That 'Umar would not take the Jizyah from the Zoroastrians until 'Abdur-Rahman bin 'Awf informed him that the Prophet (ﷺ) took Jizyah from the Zoroastrians of Hajar.\"There is more dialogue in the Hadith than this. And this Hadith is Hasan Sahih.",
      "chain": [
        "30421",
        "20005",
        "11081",
        "3",
        "8"
      ]
    },
    {
      "hadith_no": "1677",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jihad - كتاب الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن حميد الرازي، حدثنا سلمة بن الفضل، عن محمد بن إسحاق، عن عكرمة، عن ابن عباس، عن عبد الرحمن بن عوف، قال عبأنا النبي صلى الله عليه وسلم ببدر ليلا ‏.‏ قال أبو عيسى وفي الباب عن أبي أيوب ‏.‏ وهذا حديث غريب لا نعرفه إلا من هذا الوجه ‏.‏ وسألت محمد بن إسماعيل عن هذا الحديث فلم يعرفه وقال محمد بن إسحاق سمع من عكرمة ‏.‏ وحين رأيته كان حسن الرأى في محمد بن حميد الرازي ثم ضعفه بعد ‏.‏",
      "text_en": " Narrated 'Abdur-Rahman bin 'Awf:                     \"The Messenger of Allah (ﷺ) positioned us during the night at Badr.\"[Abu 'Eisa said:] There is something on this topic from Abu Ayyub.This Hadith is Gharib, we do not know of it except from this route. I asked Muhammad bin Isma'il about this Hadith, but he did not know it, and he said: \"Muhammad bin Ishaq heard from 'Ikrimah.\" And when I saw him, he had a good opinion about Muhammad bin Humaid Ar-Razi, then he considered him weak later.",
      "chain": [
        "38495",
        "28221",
        "11107",
        "11023",
        "17",
        "8"
      ]
    },
    {
      "hadith_no": "1722",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Clothing - كتاب اللباس",
      "chapter_no": "24",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا عبد الصمد بن عبد الوارث، حدثنا همام، حدثنا قتادة، عن أنس بن مالك، أن عبد الرحمن بن عوف، والزبير بن العوام، شكيا القمل إلى النبي صلى الله عليه وسلم في غزاة لهما فرخص لهما في قمص الحرير قال ورأيته عليهما ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Anas bin Malik:                     That 'Abdur Rahman bin 'Awf and Az-Zubair bin Al-'Awwam complained of lice to the Prophet (ﷺ) during a battle that they participated in. So he permitted them to wear silk shirts. He  (Anas) said: \"I saw them wearing them.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih",
      "chain": [
        "30277",
        "20250",
        "20297",
        "11019",
        "19",
        "8"
      ]
    },
    {
      "hadith_no": "2652",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا قتيبة، حدثنا أبو صفوان، عن يونس، عن الزهري، عن حميد بن عبد الرحمن، عن عبد الرحمن بن عوف، قال ابتلينا مع رسول الله صلى الله عليه وسلم بالضراء فصبرنا ثم ابتلينا بالسراء بعده فلم نصبر ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏",
      "text_en": " 'Abdur-Rahman bin 'Awf said:                     \"We were tested along with the Messenger of Allah(s.a.w) by adversity, so we were patient, then we were tested after him with prosperity, but we were not patient.\"",
      "chain": [
        "30367",
        "20525",
        "20475",
        "11013",
        "10561",
        "8"
      ]
    },
    {
      "hadith_no": "4112",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا قتيبة، حدثنا عبد العزيز بن محمد، عن عبد الرحمن بن حميد، عن أبيه، عن عبد الرحمن بن عوف، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أبو بكر في الجنة وعمر في الجنة وعثمان في الجنة وعلي في الجنة وطلحة في الجنة والزبير في الجنة وعبد الرحمن بن عوف في الجنة وسعد في الجنة وسعيد في الجنة وأبو عبيدة بن الجراح في الجنة ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Abdur-Rahman bin 'Awf:                     that the Messenger of Allah (ﷺ) said: \"Abu Bakr is in Paradise, 'Umar is in Paradise, 'Uthman is in Paradise, 'Ali is in Paradise, Talhah is in Paradise, Az-Zubair is in Paradise, 'Abdur-Rahman bin 'Awf is in Paradise, Sa'd bin Abi Waqqas is in Paradise, and Abu 'Ubaidah bin Al-Jarrah is in Paradise.\"",
      "chain": [
        "30367",
        "20167",
        "11193",
        "10561",
        "8"
      ]
    },
    {
      "hadith_no": "2208",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال حدثنا الفضل بن دكين، قال حدثنا نصر بن علي، قال حدثني النضر بن شيبان، أنه لقي أبا سلمة بن عبد الرحمن فقال له حدثني بأفضل، شىء سمعته يذكر، في شهر رمضان ‏.‏ فقال أبو سلمة حدثني عبد الرحمن بن عوف، عن رسول الله صلى الله عليه وسلم أنه ذكر شهر رمضان ففضله على الشهور وقال ‏\"‏ من قام رمضان إيمانا واحتسابا خرج من ذنوبه كيوم ولدته أمه ‏\"‏ ‏.‏ قال أبو عبد الرحمن هذا خطأ والصواب أبو سلمة عن أبي هريرة ‏.‏",
      "text_en": " An-Nadr bin Shaiban narrated that he met Abu Salamah bin 'Abdur-Rahman and said to him:                     \"Tell me of the best thing you heard about the month of Ramadan.\" Abu Salamah said: \"Abdur-Rahman bin 'Awf told me that the Messenger of Allah mentioned Ramadan and said that it is superior to other months, and he said: 'Whoever spends the nights of Ramadan in prayer (Qiyam) out of faith and in the hope of reward, he will emerge from his sins as on the day his mother bore him.\"'(Daif)Abu 'Abdur-Rahman (An-Nasai) said: This is a mistake, and what is correct is \"Abu Salamah, from Abu Hurairah.\"",
      "chain": [
        "30123",
        "20348",
        "30395",
        "19079",
        "8"
      ]
    },
    {
      "hadith_no": "2284",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن أبان البلخي، قال حدثنا معن، عن ابن أبي ذئب، عن الزهري، عن أبي سلمة بن عبد الرحمن، عن عبد الرحمن بن عوف، قال يقال الصيام في السفر كالإفطار في الحضر ‏.‏",
      "text_en": " It was narrated that 'Abdur-Rahman bin 'Awf said:                     \"It is said that fasting while traveling is like not fasting while a resident.\" (Daif)",
      "chain": [
        "30369",
        "30112",
        "20177",
        "11013",
        "10567",
        "8"
      ]
    },
    {
      "hadith_no": "2285",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن يحيى بن أيوب، قال حدثنا حماد بن الخياط، وأبو عامر قالا حدثنا ابن أبي ذئب، عن الزهري، عن أبي سلمة، عن عبد الرحمن بن عوف، قال الصائم في السفر كالمفطر في الحضر ‏.‏",
      "text_en": " It was narrated that 'Abdur-Rahman bin 'Awf said:                     \"The one who fasts while traveling is like one who does not fast while a resident.\" (Daif)",
      "chain": [
        "38617",
        "20443",
        "20177",
        "11013",
        "10567",
        "8"
      ]
    },
    {
      "hadith_no": "2286",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرني محمد بن يحيى بن أيوب، قال حدثنا أبو معاوية، قال حدثنا ابن أبي ذئب، عن الزهري، عن حميد بن عبد الرحمن بن عوف، عن أبيه، قال الصائم في السفر كالمفطر في الحضر ‏.‏",
      "text_en": " It was narrated from Humaid bin 'Abdur-Rahman bin 'Awf that his father said:                     \"The one who fasts while traveling is like one who does not fast while a resident.'   (Daif)",
      "chain": [
        "38617",
        "20354",
        "20177",
        "11013",
        "10561",
        "8"
      ]
    },
    {
      "hadith_no": "3086",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا محمد بن علي بن الحسن بن شقيق، قال أنبأنا أبي قال، أنبأنا الحسين بن واقد، عن عمرو بن دينار، عن عكرمة، عن ابن عباس، أن عبد الرحمن بن عوف، وأصحابا، له أتوا النبي صلى الله عليه وسلم بمكة فقالوا يا رسول الله إنا كنا في عز ونحن مشركون فلما آمنا صرنا أذلة ‏.‏ فقال ‏\"‏ إني أمرت بالعفو فلا تقاتلوا ‏\"‏ ‏.‏ فلما حولنا الله إلى المدينة أمرنا بالقتال فكفوا فأنزل الله عز وجل ‏{‏ ألم تر إلى الذين قيل لهم كفوا أيديكم وأقيموا الصلاة ‏}‏ ‏.‏",
      "text_en": " Narrated It was narrated from Ibn Abbas:                     that Abdur-Rahman bin Awf and some of his companions came to the Prophet in Makkah and said: “O Messenger of Allah! We were respected when we were idolaters and when we believed, we were humiliated.” He said: “I have been commanded to pardon, so do not fight.” Then, when Allah caused us to move to Al-Madinah, He commanded us to fight, but they refrained. Then Allah, the Mighty and Sublime, revealed: Have you not seen those who were told to hold back their hands (from fighting) and perform As-Salah”",
      "chain": [
        "38554",
        "30362",
        "20648",
        "11081",
        "11023",
        "17",
        "8"
      ]
    },
    {
      "hadith_no": "4052",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا قتيبة، قال حدثنا حميد بن عبد الرحمن، عن أبيه، عن أبي إسحاق، عن الشعبي، عن جرير، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا أبق العبد إلى أرض الشرك فقد حل دمه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Jarir said:                     \"The Messenger of Allah [SAW] said: 'If a slave runs away to the land of Shirk, it becomes permissible to shed his blood.'\"",
      "chain": [
        "30367",
        "10561",
        "8",
        "11049",
        "11052",
        "4057"
      ]
    },
    {
      "hadith_no": "4984",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرني عمرو بن منصور، قال حدثنا حسان بن عبد الله، قال حدثنا المفضل بن فضالة، عن يونس بن يزيد، قال سمعت سعد بن إبراهيم، يحدث عن المسور بن إبراهيم، عن عبد الرحمن بن عوف، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يغرم صاحب سرقة إذا أقيم عليه الحد ‏\"‏ ‏.‏ قال أبو عبد الرحمن وهذا مرسل وليس بثابت ‏.‏",
      "text_en": " It was narrated from 'Abdur-Rahman bin 'Awf that the Messenger of Allah said:                     \"The thief is not to be penalized (financially) if the Hadd punishment is carried out on him.\" (Daif)Abu 'Abdur-Rahman (An-Nasai) said: This is Mursal and it is not confirmed.",
      "chain": [
        "38433",
        "20378",
        "20475",
        "11063",
        "8"
      ]
    },
    {
      "hadith_no": "752",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book On The Mosques And The Congregations - كتاب المساجد والجماعات",
      "chapter_no": "4",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا الحسن بن موسى، حدثنا شيبان بن عبد الرحمن، عن يحيى بن أبي كثير، عن أبي سلمة بن عبد الرحمن، أن يعيش بن قيس بن طخفة، حدثه عن أبيه، وكان، من أصحاب الصفة قال قال لنا رسول الله  صلى الله عليه وسلم  ‏\"‏ انطلقوا ‏\"‏ ‏.‏ فانطلقنا إلى بيت عائشة وأكلنا وشربنا فقال لنا رسول الله  صلى الله عليه وسلم  ‏\"‏ إن شئتم نمتم هاهنا وإن شئتم انطلقتم إلى المسجد ‏\"‏ ‏.‏ قال فقلنا بل ننطلق إلى المسجد ‏.‏",
      "text_en": " Ya'ish bin Qais bin Tikhfah narrated that his father, who was one of the people of Suffah, said:                     \"The Messenger of Allah said to us: 'Come with me.' So we went to the house of 'Aishah, where we ate and drank. Then the Messenger of Allah said to us: 'If you want, you can sleep here, or if you want you can go out to the mosque.' We said: 'We will go out to the mosque.'\"",
      "chain": [
        "30201",
        "20383",
        "20240",
        "11449",
        "10567",
        "8"
      ]
    },
    {
      "hadith_no": "1052",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن المصفى الحمصي، حدثنا أنس بن عياض، حدثنا محمد بن عمرو بن علقمة، عن إبراهيم بن عبد الرحمن بن عوف، عن أبيه، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن الله وملائكته يصلون على الصف الأول ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Ibrahim bin ‘Abdur-Rahman bin ‘Awf that hisfathersaid:                      “The Messenger of Allah (ﷺ) said: ‘Allah and the angelssend blessings upon the first row.’”",
      "chain": [
        "20157",
        "11220",
        "584",
        "8"
      ]
    },
    {
      "hadith_no": "1266",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو يوسف الرقي، محمد بن أحمد الصيدلاني حدثنا محمد بن سلمة، عن محمد بن إسحاق، عن مكحول، عن كريب، عن ابن عباس، عن عبد الرحمن بن عوف، قال سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ إذا شك أحدكم في الثنتين والواحدة فليجعلها واحدة وإذا شك في الثنتين والثلاث فليجعلها ثنتين وإذا شك في الثلاث والأربع فليجعلها ثلاثا ثم ليتم ما بقي من صلاته حتى يكون الوهم في الزيادة ثم يسجد سجدتين وهو جالس قبل أن يسلم ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Abdur-Rahman bin ‘Awf said:                      “I heard theMessenger of Allah (ﷺ) say: ‘If anyone of you is uncertain as towhether he has prayed one or two Rak’ah, let him assume it is one.Ifhe is uncertain as to whether he has prayed two or three, let himassume it is two. If he is uncertain as to whether he has prayedthreeor four, let him assume it is three. Then let him complete whatisleft of his prayer, so that the doubt will be about what is more.Thenlet him prostrate twice while he is sitting, before the Taslim(sayingthe Salam).’”",
      "chain": [
        "20672",
        "11107",
        "11066",
        "11211",
        "17",
        "8"
      ]
    },
    {
      "hadith_no": "2690",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا محمد بن عاصم بن جعفر المصري، حدثنا المفضل بن فضالة، عن يونس بن يزيد، عن ابن شهاب، عن إبراهيم بن عبد الرحمن بن عوف، عن أبيه، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ليس على المختلس قطع ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibrahim bin Abdur-Rahman bin Awf that his father said:                     “I heard the Messenger of Allah (ﷺ) say: 'The hand of the pilferer is not to be cut off”.",
      "chain": [
        "11222",
        "38520",
        "20378",
        "20475",
        "11013",
        "584",
        "8"
      ]
    }
  ],
  "total_hadiths": 27
}