{
  "id": "84",
  "name": "Asma' bint Yazid bin al-Sakan ( أسماء بنت يزيد بن السكن ( رضي الله عنها",
  "full_name": "Asma' bint Yazid bin al-Sakan ( أسماء بنت يزيد بن السكن ( رضي الله عنها",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medinah"
    },
    "death": {
      "date_hijri": "63",
      "date_gregorian": "683",
      "date_display": null,
      "place": "Damascus, Syria",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina",
      "Damascus"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ م  -  صحابي ]"
    ],
    "tags": [
      "Female",
      "Ansar",
      "Aws",
      "B.'Abdul Ashhal",
      "Ridhwan",
      "Yarmuk",
      "Warrior"
    ]
  },
  "parents": [
    {
      "id": "1840",
      "name": "Yazid bin al-Sakan ( يزيد بن السكن بن رافع بن امرئ القيس ( رضي الله عنه",
      "grade": "Comp.(RA)"
    }
  ],
  "spouses": [
    {
      "id": "1844",
      "name": "Abu Sa'id al-Zrqy al-Ansari ( أبو سعيد الزرقي الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "siblings": [
    {
      "id": "1864",
      "name": "'Amira bint Yazid bin al-Sakan ( عميرة بنت يزيد بن السكن ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "1842",
      "name": "'Amr bin Yazid bin al-Sakan ( عمرو بن يزيد بن السكن ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "1843",
      "name": "'Amir bin Yazid bin al-Sakan ( عامر بن يزيد بن السكن ( رضي الله عنه",
      "grade": "Comp.(RA)"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "students": [
    {
      "id": "12498",
      "name": "Mahmud bin 'Amr bin Yazid bin al-Sakan محمود بن عمرو بن يزيد بن السكن",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11044",
      "name": "Shar bin Hushab al-Asha'ri شهر بن حوشب الأشعري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "17066",
      "name": "Muhajir bin Abi Muslim مهاجر بن أبي مسلم",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sunan-abi-daud-1496",
      "hadith_no": "1496",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا مسدد، حدثنا عيسى بن يونس، حدثنا عبيد الله بن أبي زياد، عن شهر بن حوشب، عن أسماء بنت يزيد، أن النبي صلى الله عليه وسلم قال ‏\"‏ اسم الله الأعظم في هاتين الآيتين ‏{‏ وإلهكم إله واحد لا إله إلا هو الرحمن الرحيم ‏}‏ وفاتحة سورة آل عمران ‏{‏ الم * الله لا إله إلا هو الحى القيوم ‏}‏ ‏.‏",
      "text_en": " 'Asma daughter of Yazid reported the Prophet (ﷺ) as saying:                      \"Allah's Greatest Names is in these two verses: \"And your Ilaah (God) is One Ilaah (God), none has the right to be worshipped but He, the Ever-Merciful, the Mercy-Giving' and the beginning of Surah Al 'Imran, \"A.L.M Allah, there is no deity but He, the Living, the Eternal.\"",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20347",
        "11044",
        "84"
      ]
    },
    {
      "id": "sunan-abi-daud-2281",
      "hadith_no": "2281",
      "source": "Sunan Abi Da'ud",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا سليمان بن عبد الحميد البهراني، حدثني يحيى بن صالح، حدثنا إسماعيل بن عياش، حدثني عمرو بن مهاجر، عن أبيه، عن أسماء بنت يزيد بن السكن الأنصارية، أنها طلقت على عهد رسول الله صلى الله عليه وسلم ولم يكن للمطلقة عدة فأنزل الله عز وجل حين طلقت أسماء بالعدة للطلاق فكانت أول من أنزلت فيها العدة للمطلقات ‏.‏",
      "text_en": " Amr ibn Muhajir reported on the authority of his father:                      Asma', daughter of Yazid ibn as-Sakan al-Ansariyyah, was divorced in the time of the Messenger of Allah (ﷺ). No waiting period was prescribed for a divorced woman (at that time). When Asma' was divorced, Allah, the Exalted, sent down the injunction of waiting period for divorce. She is the first of the divorced women about whom the verse relating to waiting period was sent down.",
      "usc_msa_ref": "",
      "chain": [
        "20470",
        "20736",
        "17532",
        "17066",
        "84"
      ]
    },
    {
      "id": "sunan-abi-daud-3881",
      "hadith_no": "3881",
      "source": "Sunan Abi Da'ud",
      "chapter": "Medicine (Kitab Al-Tibb) - كتاب الطب",
      "chapter_no": "29",
      "text_ar": "حدثنا الربيع بن نافع أبو توبة، حدثنا محمد بن مهاجر، عن أبيه، عن أسماء بنت يزيد بن السكن، قالت سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا تقتلوا أولادكم سرا فإن الغيل يدرك الفارس فيدعثره عن فرسه ‏\"‏ ‏.‏",
      "text_en": " Narrated Asma', daughter of Yazid ibn as-Sakan,:                     I heard the Messenger of Allah (ﷺ) as saying: Do not kill your children secretly, for the milk, with which a child is suckled while his mother is pregnant, overtakes the horseman and throws him from his horse.",
      "usc_msa_ref": "",
      "chain": [
        "30335",
        "20637",
        "17066",
        "84"
      ]
    },
    {
      "id": "sunan-abi-daud-3982",
      "hadith_no": "3982",
      "source": "Sunan Abi Da'ud",
      "chapter": "Dialects and Readings of the Qur'an (Kitab Al-Huruf Wa Al-Qira'at) - كتاب الحروف والقراءات",
      "chapter_no": "32",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، أخبرنا ثابت، عن شهر بن حوشب، عن أسماء بنت يزيد، أنها سمعت النبي صلى الله عليه وسلم يقرأ ‏{‏ إنه عمل غير صالح ‏}‏ ‏.‏",
      "text_en": " Narrated Asma' daughter of Yazid:                     She heard the Prophet (ﷺ) read the verse: \"He acted unrighteously.\" (innahu 'amila ghayra salih).",
      "usc_msa_ref": "",
      "chain": [
        "20040",
        "20022",
        "11269",
        "11044",
        "84"
      ]
    },
    {
      "id": "sunan-abi-daud-4027",
      "hadith_no": "4027",
      "source": "Sunan Abi Da'ud",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا إسحاق بن إبراهيم الحنظلي، حدثنا معاذ بن هشام، عن أبيه، عن بديل بن ميسرة، عن شهر بن حوشب، عن أسماء بنت يزيد، قالت كانت يد كم قميص رسول الله صلى الله عليه وسلم إلى الرصغ ‏.‏",
      "text_en": " Narrated Asma', daughter of Yazid,:                     The sleeve of the shirt of the Messenger of Allah (ﷺ) came to the wrist.",
      "usc_msa_ref": "",
      "chain": [
        "30021",
        "20287",
        "20295",
        "10672",
        "11044",
        "84"
      ]
    },
    {
      "id": "sunan-abi-daud-4238",
      "hadith_no": "4238",
      "source": "Sunan Abi Da'ud",
      "chapter": "Signet-Rings (Kitab Al-Khatam) - كتاب الخاتم",
      "chapter_no": "36",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا أبان بن يزيد العطار، حدثنا يحيى، أن محمود بن عمرو الأنصاري، حدثه أن أسماء بنت يزيد حدثته أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أيما امرأة تقلدت قلادة من ذهب قلدت في عنقها مثله من النار يوم القيامة وأيما امرأة جعلت في أذنها خرصا من ذهب جعل في أذنها مثله من النار يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " Narrated Asma' daughter of Yazid:                     The Prophet (ﷺ) as saying: Any woman who wears a gold necklace will have a similar one of fire put on her neck on the Day of Resurrection, and any woman who puts a gold earring in her ear will have a similar one of fire put in her ear on the Day of Resurrection.",
      "usc_msa_ref": "",
      "chain": [
        "20040",
        "20205",
        "11449",
        "12498",
        "84"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2064",
      "hadith_no": "2064",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو أحمد الزبيري، حدثنا سفيان، ح قال وحدثنا محمود بن غيلان، حدثنا بشر بن السري، وأبو أحمد قالا حدثنا سفيان، عن عبد الله بن عثمان بن خثيم، عن شهر بن حوشب، عن أسماء بنت يزيد، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يحل الكذب إلا في ثلاث يحدث الرجل امرأته ليرضيها والكذب في الحرب والكذب ليصلح بين الناس ‏\"‏ ‏.‏ وقال محمود في حديثه ‏\"‏ لا يصلح الكذب إلا في ثلاث ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن لا نعرفه من حديث أسماء إلا من حديث ابن خثيم ‏.‏",
      "text_en": " Asma bint Yazid  narrated that the  Messenger of Allah said:                     \"it is not lawful to lie except in three cases: Something the man tells his wife to please her, to lie during war, and to lie in order to bring peace between the people.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20355",
        "20012",
        "30277",
        "20190",
        "20355",
        "20012",
        "10644",
        "11044",
        "84"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2697-2",
      "hadith_no": "2697",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Seeking Permission - كتاب الاستئذان والآداب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "42",
      "text_ar": "حدثنا سويد، أخبرنا عبد الله بن المبارك، أخبرنا عبد الحميد بن بهرام، أنه سمع شهر بن حوشب، يقول سمعت أسماء بنت يزيد، تحدث أن رسول الله صلى الله عليه وسلم مر في المسجد يوما وعصبة من النساء قعود فألوى بيده بالتسليم وأشار عبد الحميد بيده ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ قال أحمد بن حنبل لا بأس بحديث عبد الحميد بن بهرام عن شهر بن حوشب ‏.‏ وقال محمد بن إسماعيل شهر حسن الحديث وقوى أمره وقال إنما تكلم فيه ابن عون ثم روى عن هلال بن أبي زينب عن شهر بن حوشب ‏.‏ أنبأنا أبو داود المصاحفي بلخي أخبرنا النضر بن شميل عن ابن عون قال إن شهرا نزكوه ‏.‏ قال أبو داود قال النضر تركوه أى طعنوا فيه وإنما طعنوا فيه لأنه ولي أمر السلطان ‏.‏",
      "text_en": " Narrated Asma bint Yazid:                     that the Messenger of Allah (ﷺ) passed through the Masjid one day, and a group of women were sitting, so he motioned his hand with the Salam - 'Abdul-Hamid (one of the narrators) gestured with his hand.",
      "usc_msa_ref": "",
      "chain": [
        "20025",
        "18598",
        "11044",
        "84"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3545",
      "hadith_no": "3545",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، حدثنا حبان بن هلال، وسليمان بن حرب، وحجاج بن منهال، قالوا حدثنا حماد بن سلمة، عن ثابت، عن شهر بن حوشب، عن أسماء بنت يزيد، قالت سمعت رسول الله صلى الله عليه وسلم يقرأ ‏:‏ ‏(‏يا عبادي الذين أسرفوا على أنفسهم لا تقنطوا من رحمة الله إن الله يغفر الذنوب جميعا ‏)‏ ولا يبالي ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من حديث ثابت عن شهر بن حوشب ‏.‏ قال وشهر بن حوشب يروي عن أم سلمة الأنصارية وأم سلمة الأنصارية هي أسماء بنت يزيد ‏.‏",
      "text_en": " Narrated Asma bint Yazid:                     \"I heard the Messenger of Allah (ﷺ) reciting: 'Say: \"O My slaves who have transgressed against themselves! Despair not of the mercy of Allah, verily, Allah forgives all sins and I do not mind (referring to 39:53).\"",
      "usc_msa_ref": "",
      "chain": [
        "30553",
        "20218",
        "20193",
        "20219",
        "20021",
        "11269",
        "11044",
        "84"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3478-2",
      "hadith_no": "3478",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا علي بن خشرم، حدثنا عيسى بن يونس، عن عبيد الله بن أبي زياد القداح، كذا قال عن شهر بن حوشب، عن أسماء بنت يزيد، أن النبي صلى الله عليه وسلم قال ‏\"‏ اسم الله الأعظم في هاتين الآيتين ‏:‏ ‏(‏ وإلهكم إله واحد لا إله إلا هو الرحمن الرحيم ‏)‏ وفاتحة آل عمران ‏(‏الم * الله لا إله إلا هو الحى القيوم ‏)‏ ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Asma bin Yazid narrated that the Prophet said:                     “Allah's greatest name is in these two Ayah: And your deity is One diety, there is none who has the right to be worshipped but He, Ar-Rahman, Ar-Rahim. And the Opening  of Al-Imran: Alif. Lam. Mim. Allah, None has the right to be worshipped but He, the Ever living, the Sustainer.",
      "usc_msa_ref": "",
      "chain": [
        "30556",
        "20347",
        "11044",
        "84"
      ]
    },
    {
      "id": "sunan-an-nasai-5139",
      "hadith_no": "5139",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا معاذ بن هشام، قال حدثني أبي، عن يحيى بن أبي كثير، قال حدثني محمود بن عمرو، أن أسماء بنت يزيد، حدثته أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أيما امرأة تحلت - يعني - بقلادة من ذهب جعل في عنقها مثلها من النار وأيما امرأة جعلت في أذنها خرصا من ذهب جعل الله عز وجل في أذنها مثله خرصا من النار يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " Asma' bint Yazid narrated that:                     The Messenger of Allah [SAW] said: \"Any woman who puts on a necklace of gold, Allah will put something similar of fire around her neck. Any woman who puts earrings of gold on her ears, Allah, the Mighty and Sublime, will put earrings of fire on her ears on the Day of Resurrection.\"",
      "usc_msa_ref": "",
      "chain": [
        "30359",
        "20287",
        "20295",
        "11449",
        "84"
      ]
    },
    {
      "id": "sunan-an-nasai-5644",
      "hadith_no": "5644",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا سويد، قال أنبأنا عبد الله، عن سليمان التيمي، عن أسماء بنت يزيد، عن ابن عم، لها يقال له أنس قال قال ابن عباس ألم يقل الله عز وجل ‏{‏ ما آتاكم الرسول فخذوه وما نهاكم عنه فانتهوا ‏}‏ قلت بلى ‏.‏ قال ألم يقل الله ‏{‏ وما كان لمؤمن ولا مؤمنة إذا قضى الله ورسوله أمرا أن يكون لهم الخيرة من أمرهم ‏}‏ قلت بلى ‏.‏ قال فإني أشهد أن نبي الله صلى الله عليه وسلم نهى عن النقير والمقير والدباء والحنتم ‏.‏",
      "text_en": " It was narrated from Asma' bint Yazid that:                     A paternal uncle of hers whose name was Anas said: \"Ibn 'Abbas said: Does not Allah say: \"And whatsoever the Messenger (Muhammad) gives you, take it; and whatsoever he forbids you, abstain (from it).'? He said: 'Yes.' He said: 'Does not Allah say: 'It is not for a believer, man or woman, when Allah and His Messenger have decreed a matter that they should have any option in their decision?' I said: 'Yes.' He said: 'I bear witness that the Prophet of Allah [SAW] forbade An-Naqir, Al-Muqayyar, Ad-Dubba', and Al-Hantam.'\"",
      "usc_msa_ref": "",
      "chain": [
        "16",
        "11289",
        "84"
      ]
    },
    {
      "id": "sunan-ibn-majah-1657",
      "hadith_no": "1657",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا يحيى بن سليم، عن ابن خثيم، عن شهر بن حوشب، عن أسماء بنت يزيد، قالت لما توفي ابن رسول الله  صلى الله عليه وسلم  إبراهيم بكى رسول الله  صلى الله عليه وسلم  فقال له المعزي - إما أبو بكر وإما عمر - أنت أحق من عظم الله حقه ‏.‏ قال رسول الله  صلى الله عليه وسلم  ‏\"‏ تدمع العين ويحزن القلب ولا نقول ما يسخط الرب لولا أنه وعد صادق وموعود جامع وأن الآخر تابع للأول لوجدنا عليك يا إبراهيم أفضل مما وجدنا وإنا بك لمحزونون ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Asma’ bint Yazid said:                      “When Ibrahim, the son ofthe Messenger of Allah (ﷺ), died, the Messenger of Allah (ﷺ)wept.The one who was consoling him, either Abu Bakr or ‘Umar, saidto him:‘You are indeed the best of those who glorify Allah withwhat is dueto him.’ The Messenger of Allah (ﷺ) said: ‘The eyeweeps and theheart grieves, but we do not say anything that angersthe Lord. Wereit not that death is something that inevitably comesto all, and thatthe latter will surely join the former, then wewould have been morethan we are, verily we grieve for you.’”",
      "usc_msa_ref": "",
      "chain": [
        "30547",
        "20204",
        "11044",
        "84"
      ]
    },
    {
      "id": "sunan-ibn-majah-2090",
      "hadith_no": "2090",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا هشام بن عمار، حدثنا يحيى بن حمزة، عن عمرو بن مهاجر، أنه سمع أباه المهاجر بن أبي مسلم، يحدث عن أسماء بنت يزيد بن السكن، وكانت، مولاته أنها سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ لا تقتلوا أولادكم سرا فوالذي نفسي بيده إن الغيل ليدرك الفارس على ظهر فرسه حتى يصرعه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Muhajir bin Abu Muslim, from Asma' bint Yazid bin Sakary who was his freed slave womary that:                     she heard the Messenger of Allah say: \"Do not kill your children secretly, for by the One in Whose Hand is my soul, intercourse with a breastfeeding woman catches up with people when they are riding their horses (in battle) and wrestles them to the ground.\"",
      "usc_msa_ref": "",
      "chain": [
        "30288",
        "20402",
        "17532",
        "84"
      ]
    },
    {
      "id": "sunan-ibn-majah-2532",
      "hadith_no": "2532",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Pawning - كتاب الرهون",
      "chapter_no": "16",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن عبد الحميد بن بهرام، عن شهر بن حوشب، عن أسماء بنت يزيد، أن النبي صلى الله عليه وسلم توفي ودرعه مرهونة عند يهودي بطعام ‏.‏",
      "text_en": " It was narrated from Asma' bin Yazid that:                     the Prophet (ﷺ) died while his armor was pawned to a Jew for food.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20032",
        "18598",
        "11044",
        "84"
      ]
    },
    {
      "id": "sunan-ibn-majah-3423",
      "hadith_no": "3423",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعلي بن محمد، قالا حد ثنا وكيع، عن سفيان، عن ابن أبي حسين، عن شهر بن حوشب، عن أسماء بنت يزيد، قالت أتي النبي  صلى الله عليه وسلم  بطعام فعرض علينا فقلنا لا نشتهيه ‏.‏ فقال ‏\"‏ لا تجمعن جوعا وكذبا ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Asma’ bint Yazid said:                      “Some food was brought tothe Prophet (ﷺ) and it was offered to us. We said: ‘We do nothaveany appetite for it.’ He said: ‘Do not combine hunger andlies.’”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "38409",
        "20005",
        "11044",
        "84"
      ]
    },
    {
      "id": "sunan-ibn-majah-3701-2",
      "hadith_no": "3701",
      "source": "Sunan Ibn Majah",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر، حدثنا سفيان بن عيينة، عن ابن أبي حسين، سمعه من، شهر بن حوشب يقول أخبرته أسماء بنت يزيد، قالت مر علينا رسول الله  صلى الله عليه وسلم  في نسوة فسلم علينا ‏.‏",
      "text_en": " Asma bint Yazid said:                     \"The Messenger of Allah(ﷺ) passed by us, among (a group of) women, and he greeted us with (the greeting of) peace.\"",
      "usc_msa_ref": "",
      "chain": [
        "20436",
        "20005",
        "84"
      ]
    },
    {
      "id": "sunan-ibn-majah-3855",
      "hadith_no": "3855",
      "source": "Sunan Ibn Majah",
      "chapter": "Supplication - كتاب الدعاء",
      "chapter_no": "34",
      "text_ar": "حدثنا أبو بكر، حدثنا عيسى بن يونس، عن عبيد الله بن أبي زياد، عن شهر بن حوشب، عن أسماء بنت يزيد، قالت قال رسول الله  صلى الله عليه وسلم  ‏\"‏ اسم الله الأعظم في هاتين الآيتين ‏{وإلهكم إله واحد لا إله إلا هو الرحمن الرحيم}‏ وفاتحة سورة آل عمران ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Asma' bint Yazid that :                     the Messenger of Allah (saas) said: \"The Greatest Name of Allah is in these two Verses: And your Ilah (God) is One Ilah (God - Allah), La Ilaha Illa Huwa (none has the right to be worshipped but He), the Most Gracious, the Most Merciful.' And at the beginning of Surah Al 'Imran.\"",
      "usc_msa_ref": "",
      "chain": [
        "20436",
        "20347",
        "11044",
        "84"
      ]
    }
  ],
  "total_hadiths": 18
}