{
  "id": "880",
  "name": "'Ubaidullah bin 'Ady bin al-Khayyar ( عبيد الله بن عدي بن الخيار ( رضي الله عنه",
  "full_name": "'Ubaidullah bin 'Ady bin al-Khayyar ( عبيد الله بن عدي بن الخيار ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Makkah"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Medina",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah",
      "Medina"
    ],
    "area_of_interest": [
      "Narrator [ خ  م  د  س  -  صحابة ]"
    ],
    "tags": [
      "Quraish",
      "B.Nawfal",
      "Child"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [
    {
      "id": "881",
      "name": "'Abdur Rahman bin 'Ady bin al-Khayyar ( عبد الرحمن بن عدي بن الخيار ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "882",
      "name": "'Abdullah bin 'Ady bin al-Khayyar ( عبد الله بن عدي بن الخيار ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "883",
      "name": "'Iyyad bin 'Ady bin al-Khayyar ( عياض بن عدي بن الخيار ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "884",
      "name": "al-Walid bin 'Ady bin al-Khayyar ( الوليد بن عدي بن الخيار ( رضي الله عنه",
      "grade": "Comp.(RA)"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "3",
      "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4",
      "name": "'Uthman ibn 'Affaan ( عثمان بن عفان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5",
      "name": "Ali ibn Abi Talib ( علي بن أبي طالب بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "2206",
      "name": "'Abdur Rahman bin al-Aswad ( عبد الرحمن بن الأسود بن عبد يغوث القرشي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "163",
      "name": "al-Miqdad ibn al-Aswad ( المقداد بن الأسود الكندي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "242",
      "name": "Wahshy ibn Harb ( وحشي بن حرب الحبشي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "2201",
      "name": "al-Miswar bin Makhrama bin Nawfal ( المسور بن مخرمة بن نوفل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4058",
      "name": "Ka'b al-Ahbar ( كعب الأحبار ,كعب بن ماتع الحميري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "10511",
      "name": "'Urwa ibn al-Zubayr عروة بن الزبير",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11206",
      "name": "Ata'a bin Yazid al-Laithi al-Junda'i عطاء بن يزيد الليثي الجندعي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10561",
      "name": "Humaid bin 'Abdur Rahman حميد بن عبد الرحمن بن عوف الزهرى",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11501",
      "name": "Ja'far bin 'Amr bin Umayya جعفر بن عمرو بن أمية",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "18689",
      "name": "'Ubaidullah bin al-Mughira عبيد الله بن المغيرة بن معيقيب",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10650",
      "name": "'Urwa bin Ayad عروة بن عياض",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "19022",
      "name": "Ma'mar bin ABi Habiba معمر بن أبي حبيبة",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "695",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "قال أبو عبد الله وقال لنا محمد بن يوسف حدثنا الأوزاعي، حدثنا الزهري، عن حميد بن عبد الرحمن، عن عبيد الله بن عدي بن خيار، أنه دخل على عثمان بن عفان  رضى الله عنه  وهو محصور فقال إنك إمام عامة، ونزل بك ما ترى ويصلي لنا إمام فتنة ونتحرج‏.‏ فقال الصلاة أحسن ما يعمل الناس، فإذا أحسن الناس فأحسن معهم، وإذا أساءوا فاجتنب إساءتهم‏.‏ وقال الزبيدي قال الزهري لا نرى أن يصلى خلف المخنث إلا من ضرورة لا بد منها‏.‏",
      "text_en": " Narrated 'Ubaid-Ullah bin Adi bin Khiyar:                      I went to 'Uthman bin Affan while he was besieged, and said to him, \"You are the chief of all Muslims in general and you see what has befallen you. We are led in the Salat (prayer) by a leader of Al-Fitan (trials and afflictions etc.) and we are afraid of being sinful in following him.\" 'Uthman said. \"As-Salat (the prayers) is the best of all deeds so when the people do good deeds do the same with them and when they do bad deeds, avoid those bad deeds.\" Az-Zuhri said, \"In our opinion one should not offer Salat behind an effeminate person unless there is no alternative.\"",
      "chain": [
        "30184",
        "30388",
        "20024",
        "11013",
        "10561",
        "880"
      ]
    },
    {
      "hadith_no": "3743",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثني أحمد بن شبيب بن سعيد، قال حدثني أبي، عن يونس، قال ابن شهاب أخبرني عروة، أن عبيد الله بن عدي بن الخيار، أخبره أن المسور بن مخرمة وعبد الرحمن بن الأسود بن عبد يغوث قالا ما يمنعك أن تكلم عثمان لأخيه الوليد فقد أكثر الناس فيه‏.‏ فقصدت لعثمان حتى خرج إلى الصلاة، قلت إن لي إليك حاجة، وهي نصيحة لك‏.‏ قال يا أيها المرء  قال معمر أراه قال  أعوذ بالله منك‏.‏ فانصرفت، فرجعت إليهم إذ جاء رسول عثمان فأتيته، فقال ما نصيحتك فقلت إن الله سبحانه بعث محمدا صلى الله عليه وسلم بالحق، وأنزل عليه الكتاب، وكنت ممن استجاب لله ولرسوله، فهاجرت الهجرتين، وصحبت رسول الله صلى الله عليه وسلم ورأيت هديه، وقد أكثر الناس في شأن الوليد‏.‏ قال أدركت رسول الله صلى الله عليه وسلم قلت لا ولكن خلص إلى من علمه ما يخلص إلى العذراء في سترها‏.‏ قال أما بعد فإن الله بعث محمدا صلى الله عليه وسلم بالحق، فكنت ممن استجاب لله ولرسوله وآمنت بما بعث به، وهاجرت الهجرتين كما قلت، وصحبت رسول الله صلى الله عليه وسلم وبايعته، فوالله ما عصيته ولا غششته حتى توفاه الله، ثم أبو بكر مثله، ثم عمر مثله، ثم استخلفت، أفليس لي من الحق مثل الذي لهم قلت بلى‏.‏ قال فما هذه الأحاديث التي تبلغني عنكم أما ما ذكرت من شأن الوليد، فسنأخذ فيه بالحق إن شاء الله، ثم دعا عليا فأمره أن يجلده فجلده ثمانين‏.‏",
      "text_en": " Narrated 'Ubaidullah bin `Adi bin Al-Khiyar:                     Al-Miswar bin Makhrama and `Abdur-Rahman bin Al-Aswad bin 'Abu Yaghuth said (to me), \"What forbids you to talk to `Uthman about his brother Al-Walid because people have talked much about him?\" So I went to `Uthman and when he went out for prayer I said (to him), \"I have something to say to you and it is a piece of advice for you \" `Uthman said, \"O man, from you.\" (`Umar said: I see that he said, \"I seek Refuge with Allah from you.\") So I left him and went to them. Then the messenger of `Uthman came and I went to him (i.e. `Uthman), `Uthman asked, \"What is your advice?\" I replied, \"Allah sent Muhammad with the Truth, and revealed the Divine Book (i.e. Qur'an) to him; and you were amongst those who followed Allah and His Apostle, and you participated in the two migrations (to Ethiopia and to Medina) and enjoyed the company of Allah's Apostle and saw his way. No doubt, the people are talking much about Al-Walid.\" `Uthman said, \"Did you receive your knowledge directly from Allah's Apostle ?\" I said, \"No, but his knowledge did reach me and it reached (even) to a virgin in her seclusion.\" `Uthman said, \"And then Allah sent Muhammad with the Truth and I was amongst those who followed Allah and His Apostle and I believed in what ever he (i.e. the Prophet) was sent with, and participated in two migrations, as you have said, and I enjoyed the company of Allah's Apostle and gave the pledge of allegiance him. By Allah! I never disobeyed him, nor did I cheat him till Allah took him unto Him. Then I treated Abu Bakr and then `Umar similarly and then I was made Caliph. So, don't I have rights similar to theirs?\" I said, \"Yes.\" He said, \"Then what are these talks reaching me from you people? Now, concerning what you mentioned about the question of Al-Walid, Allah willing, I shall deal with him according to what is right.\" Then he called `Ali and ordered him to flog him, and `Ali flogged him (i.e. Al-Walid) eighty lashes.",
      "chain": [
        "30120",
        "20238",
        "20475",
        "11013",
        "10511",
        "880",
        "2201"
      ]
    },
    {
      "hadith_no": "3920",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا عبد الله بن محمد الجعفي، حدثنا هشام، أخبرنا معمر، عن الزهري، حدثنا عروة بن الزبير، أن عبيد الله بن عدي بن الخيار، أخبره أن المسور بن مخرمة وعبد الرحمن بن الأسود بن عبد يغوث قالا له ما يمنعك أن تكلم خالك عثمان في أخيه الوليد بن عقبة وكان أكثر الناس فيما فعل به‏.‏ قال عبيد الله فانتصبت لعثمان حين خرج إلى الصلاة فقلت له إن لي إليك حاجة وهى نصيحة‏.‏ فقال أيها المرء، أعوذ بالله منك، فانصرفت، فلما قضيت الصلاة جلست إلى المسور وإلى ابن عبد يغوث، فحدثتهما بالذي قلت لعثمان وقال لي‏.‏ فقالا قد قضيت الذي كان عليك‏.‏ فبينما أنا جالس معهما، إذ جاءني رسول عثمان، فقالا لي قد ابتلاك الله‏.‏ فانطلقت حتى دخلت عليه، فقال ما نصيحتك التي ذكرت آنفا قال فتشهدت ثم قلت إن الله بعث محمدا صلى الله عليه وسلم وأنزل عليه الكتاب، وكنت ممن استجاب لله ورسوله صلى الله عليه وسلم وآمنت به، وهاجرت الهجرتين الأوليين، وصحبت رسول الله صلى الله عليه وسلم ورأيت هديه، وقد أكثر الناس في شأن الوليد بن عقبة، فحق عليك أن تقيم عليه الحد‏.‏ فقال لي يا ابن أخي أدركت رسول الله صلى الله عليه وسلم قال قلت لا، ولكن قد خلص إلى من علمه ما خلص إلى العذراء في سترها‏.‏ قال فتشهد عثمان فقال إن الله قد بعث محمدا صلى الله عليه وسلم بالحق وأنزل عليه الكتاب، وكنت ممن استجاب لله ورسوله صلى الله عليه وسلم وآمنت بما بعث به محمد صلى الله عليه وسلم‏.‏ وهاجرت الهجرتين الأوليين كما قلت، وصحبت رسول الله صلى الله عليه وسلم وبايعته، والله ما عصيته ولا غششته حتى توفاه الله، ثم استخلف الله أبا بكر فوالله ما عصيته ولا غششته، ثم استخلف عمر، فوالله ما عصيته ولا غششته، ثم استخلفت، أفليس لي عليكم مثل الذي كان لهم على قال بلى‏.‏ قال فما هذه الأحاديث التي تبلغني عنكم فأما ما ذكرت من شأن الوليد بن عقبة، فسنأخذ فيه إن شاء الله بالحق قال فجلد الوليد أربعين جلدة، وأمر عليا أن يجلده، وكان هو يجلده‏.‏ وقال يونس وابن أخي الزهري عن الزهري أفليس لي عليكم من الحق مثل الذي كان لهم‏.‏",
      "text_en": " Narrated 'Ubaidullah bin `Adi bin Al-Khiyar:                     That Al-Miswar bin Makhrama and `Abdur-Rahman bin Al-Aswad bin 'Abu Yaghuth had said to him, \"What prevents you from speaking to your uncle `Uthman regarding his brother Al-Walid bin `Uqba?\" The people were speaking against the latter for what he had done. 'Ubaidullah said, \"So I kept waiting for `Uthman, and when he went out for the prayer, I said to him, 'I have got something to say to you as a piece of advice.' `Uthman said, 'O man! I seek Refuge with Allah from you. So I went away. When I finished my prayer, I sat with Al-Miswar and Ibn 'Abu Yaghutb and talked to both of them of what I had said to `Uthman and what he had said to me. They said, 'You have done your duty.' So while I was sitting with them. `Uthman's Messenger came to me. They said, 'Allah has put you to trial.\" I set out and when I reached `Uthman, he said, 'What is your advice which you mentioned a while ago?' I recited Tashahhud and added, 'Allah has sent Muhammad and has revealed the Holy Book (i.e. Qur'an) to him. You (O `Uthman!) were amongst those who responded to the call of Allah and His Apostle and had faith in him. And you took part in the first two migrations (to Ethiopia and to Medina), and you enjoyed the company of Allah's Apostle and learned his traditions and advice. Now the people are talking much about Al-Walid bin `Uqba and so it is your duty to impose on him the legal punishment.' `Uthman then said to me, 'O my nephew! Did you ever meet Allah's Apostle ?' I said, 'No, but his knowledge has reached me as it has reached the virgin in her seclusion.' `Uthman then recited Tashahhud and said, 'No doubt, Allah has sent Muhammad with the Truth and has revealed to him His Holy Book (i.e. Qur'an) and I was amongst those who responded to the call of Allah and His Apostle and I had faith in Muhammad's Mission, and I had performed the first two migrations as you have said, and I enjoyed the company of Allah's Apostle and gave the pledge of allegiance to him. By Allah, I never disobeyed him and never cheated him till Allah caused him to die. Then Allah made Abu Bakr Caliph, and by Allah, I was never disobedient to him, nor did I cheat him. Then `Umar became Caliph, and by Allah, I was never disobedient to him, nor did I cheat him. Then I became Caliph. Have I not then the same rights over you as they had over me?' I replied in the affirmative. `Uthman further said, 'The what are these talks which are reaching me from you? As for what you ha mentioned about Al-Walid bin 'Uqb; Allah willing, I shall give him the leg; punishment justly. Then `Uthman ordered that Al-Walid be flogged fort lashes. He ordered `Ali to flog him an he himself flogged him as well.\"",
      "chain": [
        "30351",
        "20295",
        "20115",
        "11013",
        "10511",
        "880",
        "2201"
      ]
    },
    {
      "hadith_no": "4068",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا أبو عاصم، عن ابن جريج، عن الزهري، عن عطاء بن يزيد، عن عبيد الله بن عدي، عن المقداد بن الأسود، حدثني إسحاق، حدثنا يعقوب بن إبراهيم بن سعد، حدثنا ابن أخي ابن شهاب، عن عمه، قال أخبرني عطاء بن يزيد الليثي، ثم الجندعي أن عبيد، الله بن عدي بن الخيار أخبره أن المقداد بن عمرو الكندي، وكان حليفا لبني زهرة، وكان ممن شهد بدرا مع رسول الله صلى الله عليه وسلم أخبره أنه قال لرسول الله صلى الله عليه وسلم أرأيت إن لقيت رجلا من الكفار فاقتتلنا، فضرب إحدى يدى بالسيف فقطعها، ثم لاذ مني بشجرة فقال أسلمت لله‏.‏ آأقتله يا رسول الله بعد أن قالها فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تقتله ‏\"‏‏.‏ فقال يا رسول الله، إنه قطع إحدى يدى، ثم قال ذلك بعد ما قطعها‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تقتله، فإن قتلته فإنه بمنزلتك قبل أن تقتله، وإنك بمنزلته قبل أن يقول كلمته التي قال ‏\"‏‏.‏",
      "text_en": " Narrated 'Ubaidullah bin `Adi bin Al-Khiyar:                     That Al-Miqdad bin `Amr Al-Kindi, who was an ally of Bani Zuhra and one of those who fought the battle of Badr together with Allah's Apostle told him that he said to Allah's Apostle, \"Suppose I met one of the infidels and we fought, and he struck one of my hands with his sword and cut it off and then took refuge in a tree and said, \"I surrender to Allah (i.e. I have become a Muslim),' could I kill him, O Allah's Apostle, after he had said this?\" Allah's Apostle said, \"You should not kill him.\" Al- Miqdad said, \"O Allah's Apostle! But he had cut off one of my two hands, and then he had uttered those words?\" Allah's Apostle replied, \"You should not kill him, for if you kill him, he would be in your position where you had been before killing him, and you would be in his position where he had been before uttering those words.\"",
      "chain": [
        "20241",
        "11070",
        "11013",
        "11206",
        "163",
        "30312",
        "20184",
        "20176",
        "11206",
        "880"
      ]
    },
    {
      "hadith_no": "284",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا ليث، ح وحدثنا محمد بن رمح، - واللفظ متقارب - أخبرنا الليث، عن ابن شهاب، عن عطاء بن يزيد الليثي، عن عبيد الله بن عدي بن الخيار، عن المقداد بن الأسود، أنه أخبره أنه، قال يا رسول الله أرأيت إن لقيت رجلا من الكفار فقاتلني فضرب إحدى يدى بالسيف فقطعها ‏.‏ ثم لاذ مني بشجرة فقال أسلمت لله ‏.‏ أفأقتله يا رسول الله بعد أن قالها قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تقتله ‏\"‏ ‏.‏ قال فقلت يا رسول الله إنه قد قطع يدي ثم قال ذلك بعد أن قطعها أفأقتله قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تقتله فإن قتلته فإنه بمنزلتك قبل أن تقتله وإنك بمنزلته قبل أن يقول كلمته التي قال ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Miqdad b. Aswad that he said. Messenger of Allah, you just see (here is a point):                      If I encountered a person amongst the infidels (in the battlefield) and he attacked me and struck me and cut off one of my hands with the sword. Then he (in order to protect himself from me) took shelter of a tree and said: I become Muslim for Allah's sake. Messenger of Allah, can I kill him after he had uttered this? The Messenger of Allah (may peace be upon him) said: Do not kill him. I (the narrator) said: Messenger of Allah, he cut off my hand and uttered this after amputating it; should I then kill him? The Messenger of Allah (may peace be upon him) said: Don't kill him, for I you kill him, verily he would be in a position where you had been before killing him and verily you would be in a position where he had been before uttering (kalima).",
      "chain": [
        "30367",
        "20023",
        "30490",
        "20023",
        "11013",
        "11206",
        "880",
        "163"
      ]
    },
    {
      "hadith_no": "286",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني حرملة بن يحيى، أخبرنا ابن وهب، قال أخبرني يونس، عن ابن شهاب، قال حدثني عطاء بن يزيد الليثي، ثم الجندعي أن عبيد، الله بن عدي بن الخيار أخبره أن المقداد بن عمرو بن الأسود الكندي - وكان حليفا لبني زهرة وكان ممن شهد بدرا مع رسول الله صلى الله عليه وسلم - أنه قال يا رسول الله أرأيت إن لقيت رجلا من الكفار ثم ذكر بمثل حديث الليث ‏.‏",
      "text_en": " It is narrated by Miqdad, and he was an ally of B. Zuhra and was of those who participated in the Battle of Badr along with the Messenger of Allah, that he said:                      Messenger of Allah, here is a point: If I happened to encounter a person amongst the infidels (in the battle). Then he narrated a hadith similar to the one transmitted by Laith.",
      "chain": [
        "30487",
        "20029",
        "20475",
        "11013",
        "11206",
        "880"
      ]
    },
    {
      "hadith_no": "1633",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا مسدد، حدثنا عيسى بن يونس، حدثنا هشام بن عروة، عن أبيه، عن عبيد الله بن عدي بن الخيار، قال أخبرني رجلان، أنهما أتيا النبي صلى الله عليه وسلم في حجة الوداع وهو يقسم الصدقة فسألاه منها فرفع فينا البصر وخفضه فرآنا جلدين فقال ‏\"‏ إن شئتما أعطيتكما ولا حظ فيها لغني ولا لقوي مكتسب ‏\"‏ ‏.‏",
      "text_en": " Narrated Ubaydullah ibn Adl ibn al-Khiyar:                     Two men informed me that they went to the Prophet (ﷺ) when he was at the Farewell Pilgrimage while he was distributing the sadaqah and asked him for some of it. He looked us up and down, and seeing that we were robust, he said: If you wish, I shall give you something, but there is nothing spare in it for a rich man or for one who is strong and able to earn a living.",
      "chain": [
        "30175",
        "20347",
        "11065",
        "10511",
        "880"
      ]
    },
    {
      "hadith_no": "2644",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا قتيبة بن سعيد، عن الليث، عن ابن شهاب، عن عطاء بن يزيد الليثي، عن عبيد الله بن عدي بن الخيار، عن المقداد بن الأسود، أنه أخبره أنه، قال يا رسول الله أرأيت إن لقيت رجلا من الكفار فقاتلني فضرب إحدى يدى بالسيف ثم لاذ مني بشجرة فقال أسلمت لله ‏.‏ أفأقتله يا رسول الله بعد أن قالها قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تقتله ‏\"‏ ‏.‏ فقلت يا رسول الله إنه قطع يدي ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تقتله فإن قتلته فإنه بمنزلتك قبل أن تقتله وأنت بمنزلته قبل أن يقول كلمته التي قال ‏\"‏ ‏.‏",
      "text_en": " Al Miqdad bin Al Aswad reported that he said “Apostle of Allaah(ﷺ) tell me if I meet a man who is a disbeliever and he fights with me and cuts off one hand of mine with the sword and then takes refuge by a tree and says “I embraced Islam for Allah’s sake. Should I kill him, Apostle of Allaah(ﷺ) after he uttered it (the credo of Islam)? The Apostle of Allaah(ﷺ) said “Do not kill him”. I said “Apostle of Allaah(ﷺ), he cut off my hand. The Apostle of Allaah(ﷺ) said, Do not kill him. I f you kill him, he will become like you before you kill him and you will become like him before he uttered his credo which he has uttered now.",
      "chain": [
        "30367",
        "20023",
        "11013",
        "11206",
        "880",
        "163"
      ]
    }
  ],
  "total_hadiths": 8
}