{
  "id": "9",
  "name": "Sa'd ibn Abi Waqqas ( سعد بن أبي وقاص ( رضي الله عنه",
  "full_name": "Sa'd ibn Abi Waqqas ( سعد بن أبي وقاص ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "biography": {
    "birth": {
      "date_hijri": "39",
      "date_gregorian": "584",
      "date_display": [
        "39 BH",
        "584 CE"
      ],
      "place": "Makkah"
    },
    "death": {
      "date_hijri": "55",
      "date_gregorian": "664",
      "date_display": null,
      "place": "(Al-'Atiq",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah",
      "Medina",
      "Kufa"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ ع  -  صحابة ]",
      "Fiqh",
      "Commander"
    ],
    "tags": [
      "Quraish",
      "B.Zuhrah",
      "Early Muslim",
      "Emigrant",
      "Badr",
      "Uhud",
      "Khandaq",
      "Baqi'",
      "Promised Paradise"
    ]
  },
  "parents": [],
  "spouses": [
    {
      "id": "596",
      "name": "Umm Hakim bint Qariz bin Khalid ( أم حكيم بنت قارظ بن خالد ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "siblings": [
    {
      "id": "175",
      "name": "'Amir ibn Abi Waqqas ( عامر بن أبي وقاص ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "822",
      "name": "'Umayr ibn Abi Waqqas ( عمير بن أبي وقاص ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "2240",
      "name": "'Utba ibn Abi Waqqas ( عتبة بن أبي وقاص ( رضي الله عنه",
      "grade": "Comp.(RA)"
    }
  ],
  "children": [
    {
      "id": "597",
      "name": "Ishaq bin Sa'd ibn Abi Waqqas ( إسحاق بن سعد بن أبي وقاص ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "598",
      "name": "'Umar bin Sa'd ibn Abi Waqqas ( عمر بن سعد بن أبي وقاص ( رضي الله عنه",
      "grade": "Comp.(RA) [3rd Generation]"
    },
    {
      "id": "10553",
      "name": "Muhammad bin Sa'd ibn Abi Waqqas محمد بن سعد بن أبي وقاص",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10554",
      "name": "'Amir bin Sa'd ibn Abi Waqqas عامر بن سعد بن أبي وقاص",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10555",
      "name": "Isma'il bin Sa'd ibn Abi Waqqas إسماعيل بن سعد بن أبي وقاص",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "10556",
      "name": "Mus'ub bin Sa'd ibn Abi Waqqas مصعب بن سعد بن أبى وقاص الزهرى",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10557",
      "name": "Ibrahim bin Sa'd ibn Abi Waqqas إبراهيم بن سعد بن أبى وقاص الزهرى",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10558",
      "name": "Ya'qub bin Sa'd ibn Abi Waqqas يعقوب بن سعد بن أبى وقاص الزهرى",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "10559",
      "name": "'Aisha bint Sa'd ibn Abi Waqqas عائشة بنت سعد بن أبي وقاص الزهرية",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10537",
      "name": "Yahya bin Sa'd ibn Abi Waqqas يحيى بن سعد بن أبي وقاص الزهرى",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "10534",
      "name": "'Abdullah bin Sa'd ibn Abi Waqqas عبد الله بن سعد بن أبي وقاص الزهرى",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "10538",
      "name": "'Umayr bin Sa'd ibn Abi Waqqas عمير بن سعد بن أبي وقاص الزهرى",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "10539",
      "name": "'Amr bin Sa'd ibn Abi Waqqas عمرو بن سعد بن أبي وقاص الزهرى",
      "grade": "Follower(Tabi')"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "76",
      "name": "Khawlah bint Hakim ( خولة بنت حكيم بن أمية ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "598",
      "name": "'Umar bin Sa'd ibn Abi Waqqas ( عمر بن سعد بن أبي وقاص ( رضي الله عنه",
      "grade": "Comp.(RA) [3rd Generation]"
    },
    {
      "id": "10553",
      "name": "Muhammad bin Sa'd ibn Abi Waqqas محمد بن سعد بن أبي وقاص",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10554",
      "name": "'Amir bin Sa'd ibn Abi Waqqas عامر بن سعد بن أبي وقاص",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10555",
      "name": "Isma'il bin Sa'd ibn Abi Waqqas إسماعيل بن سعد بن أبي وقاص",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "10556",
      "name": "Mus'ub bin Sa'd ibn Abi Waqqas مصعب بن سعد بن أبى وقاص الزهرى",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10557",
      "name": "Ibrahim bin Sa'd ibn Abi Waqqas إبراهيم بن سعد بن أبى وقاص الزهرى",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10558",
      "name": "Ya'qub bin Sa'd ibn Abi Waqqas يعقوب بن سعد بن أبى وقاص الزهرى",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "10559",
      "name": "'Aisha bint Sa'd ibn Abi Waqqas عائشة بنت سعد بن أبي وقاص الزهرية",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "393",
      "name": "Jabir bin Samra ( جابر بن سمرة السوائي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3048",
      "name": "al-Sa'ib bin Yazid bin Akht Namr ( السائب بن يزيد بن أخت النمر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5003",
      "name": "Tha'laba bin Sa'ayr ( ثعلبة بن صعير ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5030",
      "name": "Malik bin Aws bin al-Hadathan ( مالك بن أوس بن الحدثان النصري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "584",
      "name": "Ibrahim bin 'Abdur Rahman ( إبراهيم بن عبد الرحمن بن عوف الزهرى ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11113",
      "name": "Abu 'Uthman al-Nahdi عبد الرحمن بن مل - أبو عثمان النهدي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11359",
      "name": "Abu 'Abdur Rahman al-Salmi أبو عبد الرحمن السلمي",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "11017",
      "name": "'Alqama bin Qays علقمة بن قيس بن عبد الله",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11153",
      "name": "Basr bin Sa'id al-Madni بسر بن سعيد المدني العابد",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11112",
      "name": "al-Ahnaf bin Qays الأحنف بن قيس بن معاوية",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "10774",
      "name": "Sharih bin Hani' al-Harithi شريح بن هانئ",
      "grade": "Follower(Tabi') [8th generation]"
    },
    {
      "id": "11382",
      "name": "'Amr bin Maymun al-Aw'di عمرو بن ميمون الأودي أبو عبد الله",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11028",
      "name": "Mujahid bin Jabir مجاهد بن جبر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11846",
      "name": "Dinar Abu 'Abdullah al-Qaraz دينار أبو عبد الله القراظ",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10710",
      "name": "Ghnym bin Qays al-Mazny غنيم بن قيس المازني",
      "grade": "Follower(Tabi') [1st Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "27",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو اليمان، قال أخبرنا شعيب، عن الزهري، قال أخبرني عامر بن سعد بن أبي وقاص، عن سعد، رضى الله عنه أن رسول الله صلى الله عليه وسلم أعطى رهطا وسعد جالس، فترك رسول الله صلى الله عليه وسلم رجلا هو أعجبهم إلى فقلت يا رسول الله ما لك عن فلان فوالله إني لأراه مؤمنا‏.‏ فقال ‏\"‏ أو مسلما ‏\"‏‏.‏ فسكت قليلا، ثم غلبني ما أعلم منه فعدت لمقالتي فقلت ما لك عن فلان فوالله إني لأراه مؤمنا فقال ‏\"‏ أو مسلما ‏\"‏‏.‏ ثم غلبني ما أعلم منه فعدت لمقالتي وعاد رسول الله صلى الله عليه وسلم ثم قال ‏\"‏ يا سعد، إني لأعطي الرجل وغيره أحب إلى منه، خشية أن يكبه الله في النار ‏\"‏‏.‏ ورواه يونس وصالح ومعمر وابن أخي الزهري عن الزهري‏.‏",
      "text_en": "      Narrated Sa'd:                          Allah's Apostle distributed (Zakat) amongst (a group of) people while      I was sitting there but Allah's Apostle left a man whom I thought the      best of the lot. I asked, \"O Allah's Apostle! Why have you left that      person? By Allah I regard him as a faithful believer.\" The Prophet      commented: \"Or merely a Muslim.\" I remained quiet for a while, but      could not help repeating my question because of what I knew about him.     And then asked Allah's Apostle, \"Why have you left so and so? By      Allah! He is a faithful believer.\" The Prophet again said, \"Or merely      a Muslim.\" And I could not help repeating my question because of what      I knew about him. Then the Prophet said, \"O Sa'd! I give to a person      while another is dearer to me, for fear that he might be thrown on his     face in the Fire by Allah.\"",
      "chain": [
        "30330",
        "20428",
        "11013",
        "10554",
        "9"
      ]
    },
    {
      "hadith_no": "56",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا الحكم بن نافع قال أخبرنا شعيب عن الزهري قال حدثني عامر بن سعد عن سعد بن أبي وقاص أنه أخبره  أن رسول الله صلى الله عليه وسلم قال \"إنك لن تنفق نفقة تبتغي بها وجه الله إلا أجرت عليها حتى ما تجعل في فم امرأتك\"",
      "text_en": "      Narrated Sa'd bin Abi Waqqas:                          Allah's Apostle said, \"You will be rewarded for whatever you spend for     Allah's sake even if it were a morsel which you put in your wife's      mouth.\"",
      "chain": [
        "30330",
        "20428",
        "11013",
        "10554",
        "9"
      ]
    },
    {
      "hadith_no": "202",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا أصبغ بن الفرج المصري، عن ابن وهب، قال حدثني عمرو، حدثني أبو النضر، عن أبي سلمة بن عبد الرحمن، عن عبد الله بن عمر، عن سعد بن أبي وقاص، عن النبي صلى الله عليه وسلم أنه مسح على الخفين‏.‏ وأن عبد الله بن عمر سأل عمر عن ذلك فقال نعم إذا حدثك شيئا سعد عن النبي صلى الله عليه وسلم فلا تسأل عنه غيره‏.‏ وقال موسى بن عقبة أخبرني أبو النضر أن أبا سلمة أخبره أن سعدا حدثه فقال عمر لعبد الله‏.‏ نحوه‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     Sa`d bin Abi Waqqas said, \"The Prophet passed wet hands over his Khuffs (socks made from thick fabric or leather).\" `Abdullah bin `Umar asked `Umar about it. `Umar replied in the affirmative and added, \"Whenever Sa`d narrates a Hadith from the Prophet, there is no need to ask anyone else about it.\"",
      "chain": [
        "30228",
        "20029",
        "20377",
        "20390",
        "10567",
        "18",
        "9"
      ]
    },
    {
      "hadith_no": "560",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن بشار، قال حدثنا محمد بن جعفر، قال حدثنا شعبة، عن سعد، عن محمد بن عمرو بن الحسن بن علي، قال قدم الحجاج فسألنا جابر بن عبد الله فقال كان النبي صلى الله عليه وسلم يصلي الظهر بالهاجرة، والعصر والشمس نقية، والمغرب إذا وجبت، والعشاء أحيانا وأحيانا، إذا رآهم اجتمعوا عجل، وإذا رآهم أبطوا أخر، والصبح كانوا  أو كان النبي صلى الله عليه وسلم يصليها بغلس‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     The Prophet used to pray the Zuhr at midday, and the `Asr at a time when the sun was still bright, the Maghrib after sunset (at its stated time) and the `Isha at a variable time. Whenever he saw the people assembled (for `Isha' prayer) he would pray earlier and if the people delayed, he would delay the prayer. And they or the Prophet used to offer the Fajr Prayers when it still dark.",
      "chain": [
        "30160",
        "20173",
        "20020",
        "9",
        "11220"
      ]
    },
    {
      "hadith_no": "1295",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا مالك، عن ابن شهاب، عن عامر بن سعد بن أبي وقاص، عن أبيه  رضى الله عنه  قال كان رسول الله صلى الله عليه وسلم يعودني عام حجة الوداع من وجع اشتد بي فقلت إني قد بلغ بي من الوجع وأنا ذو مال، ولا يرثني إلا ابنة، أفأتصدق بثلثى مالي قال ‏\"‏ لا ‏\"‏‏.‏ فقلت بالشطر فقال ‏\"‏ لا ‏\"‏ ثم قال ‏\"‏ الثلث والثلث كبير  أو كثير  إنك أن تذر ورثتك أغنياء خير من أن تذرهم عالة يتكففون الناس، وإنك لن تنفق نفقة تبتغي بها وجه الله إلا أجرت بها، حتى ما تجعل في في امرأتك ‏\"‏‏.‏ فقلت يا رسول الله، أخلف بعد أصحابي قال ‏\"‏ إنك لن تخلف فتعمل عملا صالحا إلا ازددت به درجة ورفعة، ثم لعلك أن تخلف حتى ينتفع بك أقوام ويضر بك آخرون، اللهم أمض لأصحابي هجرتهم، ولا تردهم على أعقابهم، لكن البائس سعد ابن خولة، يرثي له رسول الله صلى الله عليه وسلم أن مات بمكة ‏\"‏‏.‏",
      "text_en": " Narrated 'Amir bin Sa`d bin Abi Waqqas:                     That his father said, \"In the year of the last Hajj of the Prophet I became seriously ill and the Prophet used to visit me inquiring about my health. I told him, 'I am reduced to this state because of illness and I am wealthy and have no inheritors except a daughter, (In this narration the name of 'Amir bin Sa`d is mentioned and in fact it is a mistake; the narrator is `Aisha bint Sa`d bin Abi Waqqas). Should I give two-thirds of my property in charity?' He said, 'No.' I asked, 'Half?' He said, 'No.' then he added, 'Onethird, and even one-third is much. You'd better leave your inheritors wealthy rather than leaving them poor, begging others. You will get a reward for whatever you spend for Allah's sake, even for what you put in your wife's mouth.' I said, 'O Allah's Apostle! Will I be left alone after my companions have gone?' He said, 'If you are left behind, whatever good deeds you will do will upgrade you and raise you high. And perhaps you will have a long life so that some people will be benefited by you while others will be harmed by you. O Allah! Complete the emigration of my companions and do not turn them renegades.' But Allah's Apostle felt sorry for poor Sa`d bin Khaula as he died in Mecca.\" (but Sa`d bin Abi Waqqas lived long after the Prophet (p.b.u.h).)",
      "chain": [
        "30355",
        "20001",
        "11013",
        "10554",
        "9"
      ]
    },
    {
      "hadith_no": "1335",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن سعد، عن طلحة، قال صليت خلف ابن عباس  رضى الله عنهما ‏.‏ حدثنا محمد بن كثير، أخبرنا سفيان، عن سعد بن إبراهيم، عن طلحة بن عبد الله بن عوف، قال صليت خلف ابن عباس  رضى الله عنهما  على جنازة فقرأ بفاتحة الكتاب قال ليعلموا أنها سنة‏.‏",
      "text_en": " Narrated Talha bin `Abdullah bin `Auf:                     I offered the funeral prayer behind Ibn `Abbas and he recited Al-Fatiha and said, \"You should know that it (i.e. recitation of Al-Fatiha) is the tradition of the Prophet Muhammad.",
      "chain": [
        "30160",
        "20278",
        "20020",
        "9",
        "11356"
      ]
    },
    {
      "hadith_no": "1502",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن غرير الزهري، حدثنا يعقوب بن إبراهيم، عن أبيه، عن صالح بن كيسان، عن ابن شهاب، قال أخبرني عامر بن سعد، عن أبيه، قال أعطى رسول الله صلى الله عليه وسلم رهطا وأنا جالس فيهم قال فترك رسول الله صلى الله عليه وسلم منهم رجلا لم يعطه، وهو أعجبهم إلى، فقمت إلى رسول الله صلى الله عليه وسلم فساررته فقلت ما لك عن فلان والله إني لأراه مؤمنا‏.‏ قال ‏\"‏ أو مسلما ‏\"‏ قال فسكت قليلا ثم غلبني ما أعلم فيه فقلت يا رسول الله‏.‏ ما لك عن فلان والله إني لأراه مؤمنا‏.‏ قال ‏\"‏ أو مسلما ‏\"‏‏.‏ قال فسكت قليلا ثم غلبني ما أعلم فيه فقلت يا رسول الله ما لك عن فلان والله إني لأراه مؤمنا‏.‏ قال ‏\"‏ أو مسلما  يعني فقال  إني لأعطي الرجل وغيره أحب إلى منه، خشية أن يكب في النار على وجهه ‏\"‏‏.‏ وعن أبيه عن صالح عن إسماعيل بن محمد أنه قال سمعت أبي يحدث هذا فقال في حديثه فضرب رسول الله صلى الله عليه وسلم بيده فجمع بين عنقي وكتفي ثم قال ‏\"‏ أقبل أى سعد إني لأعطي الرجل ‏\"‏‏.‏ قال أبو عبد الله ‏{‏فكبكبوا‏}‏ قلبوا ‏{‏مكبا‏}‏ أكب الرجل إذا كان فعله غير واقع على أحد، فإذا وقع الفعل قلت كبه الله لوجهه، وكببته أنا‏.‏",
      "text_en": " Narrated Sa`d (bin Abi Waqqas):                     Allah's Apostle distributed something (from the resources of Zakat) amongst a group of people while I was sitting amongst them, but he left a man whom I considered the best of the lot. So, I went up to Allah's Apostle and asked him secretly, \"Why have you left that person? By Allah! I consider him a believer.\" The Prophet said, \"Or merely a Muslim (Who surrender to Allah).\" I remained quiet for a while but could not help repeating my question because of what I knew about him. I said, \"O Allah's Apostle! Why have you left that person? By Allah! I consider him a believer. \" The Prophet said, \"Or merely a Muslim.\" I remained quiet for a while but could not help repeating my question because of what I knew about him. I said, \"O Allah's Apostle! Why have you left that person? By Allah! I consider him a believer.\" The Prophet said, \"Or merely a Muslim.\" Then Allah's Apostle (p.b.u.h) said, \"I give to a person while another is dearer to me, for fear that he may be thrown in the Hell-fire on his face (by reneging from Islam).\"",
      "chain": [
        "30109",
        "20184",
        "20150",
        "11176",
        "11013",
        "10554",
        "9"
      ]
    },
    {
      "hadith_no": "1910",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of Madinah - كتاب فضائل المدينة",
      "chapter_no": "29",
      "text_ar": "حدثنا حسين بن حريث، أخبرنا الفضل، عن جعيد، عن عائشة، قالت سمعت سعدا  رضى الله عنه  قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ لا يكيد أهل المدينة أحد إلا انماع كما ينماع الملح في الماء ‏\"‏‏.‏",
      "text_en": " Narrated Sa`d:                     I heard the Prophet saying, \"None plots against the people of Medina but that he will be dissolved (destroyed) like the salt is dissolved in water.\"",
      "chain": [
        "30325",
        "20452",
        "11679",
        "53",
        "9"
      ]
    },
    {
      "hadith_no": "2219",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن سعد، عن أبيه، قال عبد الرحمن بن عوف  رضى الله عنه  لصهيب اتق الله ولا تدع إلى غير أبيك‏.‏ فقال صهيب ما يسرني أن لي كذا وكذا، وأني قلت ذلك، ولكني سرقت وأنا صبي‏.‏",
      "text_en": " Narrated Sa`d that his father said:                     `Abdur-Rahman bin `Auf said to Suhaib, 'Fear Allah and do not ascribe yourself to somebody other than your father.' Suhaib replied, 'I would not like to say it even if I were given large amounts of money, but I say I was kidnapped in my childhood.' \"",
      "chain": [
        "30160",
        "20278",
        "20020",
        "9",
        "8"
      ]
    },
    {
      "hadith_no": "2324",
      "source": " Sahih Bukhari ",
      "chapter": "Agriculture - كتاب المزارعة",
      "chapter_no": "41",
      "text_ar": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن سعد، سمعت أبا سلمة، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ بينما رجل راكب على بقرة التفتت إليه‏.‏ فقالت لم أخلق لهذا، خلقت للحراثة، قال آمنت به أنا وأبو بكر وعمر، وأخذ الذئب شاة فتبعها الراعي، فقال الذئب من لها يوم السبع، يوم لا راعي لها غيري‏.‏ قال آمنت به أنا وأبو بكر وعمر ‏\"‏‏.‏ قال أبو سلمة ما هما يومئذ في القوم‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"While a man was riding a cow, it turned towards him and said, 'I have not been created for this purpose (i.e. carrying), I have been created for sloughing.\" The Prophet added, \"I, Abu Bakr and `Umar believe in the story.\" The Prophet went on, \"A wolf caught a sheep, and when the shepherd chased it, the wolf said, 'Who will be its guard on the day of wild beasts, when there will be no shepherd for it except me?' \"After narrating it, the Prophet said, \"I, Abu Bakr and `Umar too believe it.\" Abu Salama (a sub-narrator) said, \"Abu Bakr and `Umar were not present then.\"",
      "chain": [
        "30160",
        "20278",
        "20020",
        "9",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "2742",
      "source": " Sahih Bukhari ",
      "chapter": "Wills and Testaments (Wasaayaa) - كتاب الوصايا",
      "chapter_no": "55",
      "text_ar": "حدثنا أبو نعيم، حدثنا سفيان، عن سعد بن إبراهيم، عن عامر بن سعد، عن سعد بن أبي وقاص  رضى الله عنه  قال جاء النبي صلى الله عليه وسلم يعودني وأنا بمكة، وهو يكره أن يموت بالأرض التي هاجر منها قال ‏\"‏ يرحم الله ابن عفراء ‏\"‏‏.‏ قلت يا رسول الله، أوصي بمالي كله قال ‏\"‏ لا ‏\"‏‏.‏ قلت فالشطر قال ‏\"‏ لا ‏\"‏‏.‏ قلت الثلث‏.‏ قال ‏\"‏ فالثلث، والثلث كثير، إنك أن تدع ورثتك أغنياء خير من أن تدعهم عالة يتكففون الناس في أيديهم، وإنك مهما أنفقت من نفقة فإنها صدقة، حتى اللقمة التي ترفعها إلى في امرأتك، وعسى الله أن يرفعك فينتفع بك ناس ويضر بك آخرون ‏\"‏‏.‏ ولم يكن له يومئذ إلا ابنة‏.‏",
      "text_en": " Narrated Sa`d bin Abu Waqqas:                     The Prophet came visiting me while I was (sick) in Mecca, ('Amir the sub-narrator said, and he disliked to die in the land, whence he had already migrated). He (i.e. the Prophet) said, \"May Allah bestow His Mercy on Ibn Afra (Sa`d bin Khaula).\" I said, \"O Allah's Apostle! May I will all my property (in charity)?\" He said, \"No.\" I said, \"Then may I will half of it?\" He said, \"No\". I said, \"One third?\" He said: \"Yes, one third, yet even one third is too much. It is better for you to leave your inheritors wealthy than to leave them poor begging others, and whatever you spend for Allah's sake will be considered as a charitable deed even the handful of food you put in your wife's mouth. Allah may lengthen your age so that some people may benefit by you, and some others be harmed by you.\" At that time Sa`d had only one daughter.",
      "chain": [
        "20348",
        "20012",
        "11063",
        "10554",
        "9"
      ]
    },
    {
      "hadith_no": "2744",
      "source": " Sahih Bukhari ",
      "chapter": "Wills and Testaments (Wasaayaa) - كتاب الوصايا",
      "chapter_no": "55",
      "text_ar": "حدثنا محمد بن عبد الرحيم، حدثنا زكرياء بن عدي، حدثنا مروان، عن هاشم بن هاشم، عن عامر بن سعد، عن أبيه  رضى الله عنه  قال مرضت فعادني النبي صلى الله عليه وسلم فقلت يا رسول الله ادع الله أن لا يردني على عقبي‏.‏ قال ‏\"‏ لعل الله يرفعك وينفع بك ناسا ‏\"‏‏.‏ قلت أريد أن أوصي، وإنما لي ابنة  قلت  أوصي بالنصف قال ‏\"‏ النصف كثير ‏\"‏‏.‏ قلت فالثلث‏.‏ قال ‏\"‏ الثلث، والثلث كثير أو كبير ‏\"‏‏.‏ قال فأوصى الناس بالثلث، وجاز ذلك لهم‏.‏",
      "text_en": " Narrated Sa`d:                     I fell sick and the Prophet paid me a visit. I said to him, \"O Allah's Apostle! I invoke Allah that He may not let me expire in the land whence I migrated (i.e. Mecca).\" He said, \"May Allah give you health and let the people benefit by you.\" I said, \"I want to will my property, and I have only one daughter and I want to will half of my property (to be given in charity).\" He said,\" Half is too much.\" I said, \"Then I will one third.\" He said, \"One-third, yet even one-third is too much.\" (The narrator added, \"So the people started to will one third of their property and that was Permitted for them.\")",
      "chain": [
        "30272",
        "30464",
        "20201",
        "11227",
        "10554",
        "9"
      ]
    },
    {
      "hadith_no": "3473",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، قال حدثني مالك، عن محمد بن المنكدر، وعن أبي النضر، مولى عمر بن عبيد الله عن عامر بن سعد بن أبي وقاص، عن أبيه، أنه سمعه يسأل، أسامة بن زيد ماذا سمعت من، رسول الله صلى الله عليه وسلم في الطاعون فقال أسامة قال رسول الله صلى الله عليه وسلم ‏\"‏ الطاعون رجس أرسل على طائفة من بني إسرائيل أو على من كان قبلكم، فإذا سمعتم به بأرض فلا تقدموا عليه، وإذا وقع بأرض وأنتم بها فلا تخرجوا فرارا منه ‏\"‏‏.‏ قال أبو النضر ‏\"‏ لا يخرجكم إلا فرارا منه ‏\"‏‏.‏",
      "text_en": " Narrated Usama bin Zaid:                     Allah's Apostle said, \"Plague was a means of torture sent on a group of Israelis (or on some people before you). So if you hear of its spread in a land, don't approach it, and if a plague should appear in a land where you are present, then don't leave that land in order to run away from it (i.e. plague).",
      "chain": [
        "30105",
        "20001",
        "11048",
        "11164",
        "10554",
        "9"
      ]
    },
    {
      "hadith_no": "3544",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا أبو نعيم، حدثنا سفيان، عن سعد، ح قال يعقوب بن إبراهيم حدثنا أبي، عن أبيه، قال حدثني عبد الرحمن بن هرمز الأعرج، عن أبي هريرة  رضى الله عنه  قال رسول الله صلى الله عليه وسلم ‏\"‏ قريش والأنصار وجهينة ومزينة وأسلم وأشجع وغفار موالي ليس لهم مولى، دون الله ورسوله ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"The tribe of Quraish, the Ansar, the (people of the tribe of) Julhaina, Muzaina, Aslam, Ashja', and Ghifar are my disciples and have no protectors except Allah and His Apostle.\"",
      "chain": [
        "20348",
        "20012",
        "9",
        "20184",
        "20150",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "3552",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا أبو نعيم، حدثنا سفيان، عن سعد، عن عبد الرحمن بن هرمز، عن أبي هريرة  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ قريش والأنصار وجهينة ومزينة وأسلم وغفار وأشجع موالي، ليس لهم مولى دون الله ورسوله ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"The tribes of Quraish, Al-Ansar, Juhaina, Muzaina, Aslam, Ghifar and Ashja' are my helpers, and they have no protector (i.e. Master) except Allah and His Apostle.\"",
      "chain": [
        "20348",
        "20012",
        "9",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "3734",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "زاد زكرياء بن أبي زائدة عن سعد، عن أبي سلمة، عن أبي هريرة، قال قال النبي صلى الله عليه وسلم ‏\"‏ لقد كان فيمن كان قبلكم من بني إسرائيل رجال يكلمون من غير أن يكونوا أنبياء، فإن يكن من أمتي منهم أحد فعمر ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                      The Prophet said, \"Among the nation of Bani Israel who lived before you, there were men who used to be inspired with guidance though they were not prophets, and if there is any of such persons amongst my followers, it is 'Umar.\"",
      "chain": [
        "9",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "3753",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثني محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن سعد، قال سمعت إبراهيم بن سعد، عن أبيه، قال النبي صلى الله عليه وسلم لعلي ‏\"‏ أما ترضى أن تكون مني بمنزلة هارون من موسى ‏\"‏‏.‏",
      "text_en": "  And narrated Sad   that the Prophet said to 'Ali, \"Will you not be pleased from this that you are to me like Aaron was to Moses?\"",
      "chain": [
        "30160",
        "20278",
        "20020",
        "9",
        "20150",
        "11063"
      ]
    },
    {
      "hadith_no": "3771",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثني محمد بن المثنى، حدثنا عبد الوهاب، قال سمعت يحيى، قال سمعت سعيد بن المسيب، قال سمعت سعدا، يقول جمع لي النبي صلى الله عليه وسلم أبويه يوم أحد‏.‏",
      "text_en": " Narrated Sa`d:                     On the day of the battle of Uhud the Prophet mentioned for me both his parents (i.e. saying, \"Let my parents be sacrificed for you.\").",
      "chain": [
        "30170",
        "20259",
        "20031",
        "11002",
        "9"
      ]
    },
    {
      "hadith_no": "3772",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا مكي بن إبراهيم، حدثنا هاشم بن هاشم، عن عامر بن سعد، عن أبيه، قال لقد رأيتني وأنا ثلث الإسلام،‏.‏",
      "text_en": " Narrated Sa`d:                     No doubt, (for some time) I stood for one-third of the Muslims.",
      "chain": [
        "20202",
        "11227",
        "10554",
        "9"
      ]
    },
    {
      "hadith_no": "3773",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثني إبراهيم بن موسى، أخبرنا ابن أبي زائدة، حدثنا هاشم بن هاشم بن عتبة بن أبي وقاص، قال سمعت سعيد بن المسيب، يقول سمعت سعد بن أبي وقاص، يقول ما أسلم أحد إلا في اليوم الذي أسلمت فيه، ولقد مكثت سبعة أيام وإني لثلث الإسلام‏.‏ تابعه أبو أسامة حدثنا هاشم‏.‏",
      "text_en": " Narrated Sa`d bin Abi Waqqas:                     No man embraced Islam before the day on which I embraced Islam, and no doubt, I remained for seven days as one third of the then extant Muslims.",
      "chain": [
        "30309",
        "20366",
        "11227",
        "11002",
        "9"
      ]
    },
    {
      "hadith_no": "3774",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا عمرو بن عون، حدثنا خالد بن عبد الله، عن إسماعيل، عن قيس، قال سمعت سعدا  رضى الله عنه  يقول إني لأول العرب رمى بسهم في سبيل الله، وكنا نغزو مع النبي صلى الله عليه وسلم وما لنا طعام إلا ورق الشجر، حتى إن أحدنا ليضع كما يضع البعير أو الشاة، ما له خلط، ثم أصبحت بنو أسد تعزرني على الإسلام، لقد خبت إذا وضل عملي‏.‏ وكانوا وشوا به إلى عمر، قالوا لا يحسن يصلي‏.‏",
      "text_en": " Narrated Qais:                     I heard Sa`d saying, \"I was the first amongst the 'Arabs who shot an arrow for Allah's Cause. We used to fight along with the Prophets, while we had nothing to eat except the leaves of trees so that one's excrete would look like the excrete balls of camel or a sheep, containing nothing to mix them together. Today Banu Asad tribe blame me for not having understood Islam. I would be a loser if my deeds were in vain.\" Those people complained about Sa`d to `Umar, claiming that he did not offer his prayers perfectly.",
      "chain": [
        "30154",
        "20423",
        "11418",
        "11046",
        "9"
      ]
    },
    {
      "hadith_no": "3859",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا عبد الله بن يوسف، قال سمعت مالكا، يحدث عن أبي النضر، مولى عمر بن عبيد الله عن عامر بن سعد بن أبي وقاص، عن أبيه، قال ما سمعت النبي صلى الله عليه وسلم يقول لأحد يمشي على الأرض إنه من أهل الجنة‏.‏ إلا لعبد الله بن سلام قال وفيه نزلت هذه الآية ‏{‏وشهد شاهد من بني إسرائيل‏}‏ الآية‏.‏ قال لا أدري قال مالك الآية أو في الحديث‏.‏",
      "text_en": " Narrated Sa`d bin Abi Waqqas:                     I have never heard the Prophet saying about anybody walking on the earth that he is from the people of Paradise except `Abdullah bin Salam. The following Verse was revealed concerning him: \"And a witness from the children of Israel testifies that this Qur'an is true\" (46.10)",
      "chain": [
        "30355",
        "20001",
        "11164",
        "10554",
        "9"
      ]
    },
    {
      "hadith_no": "3984",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا يحيى بن قزعة، حدثنا إبراهيم، عن الزهري، عن عامر بن سعد بن مالك، عن أبيه، قال عادني النبي صلى الله عليه وسلم عام حجة الوداع من مرض أشفيت منه على الموت، فقلت يا رسول الله، بلغ بي من الوجع ما ترى، وأنا ذو مال ولا يرثني إلا ابنة لي واحدة، أفأتصدق بثلثى مالي قال ‏\"‏ لا ‏\"‏‏.‏ قال فأتصدق بشطره قال ‏\"‏ الثلث يا سعد، والثلث كثير، إنك أن تذر ذريتك أغنياء خير من أن تذرهم عالة يتكففون الناس ‏\"‏‏.‏ قال أحمد بن يونس عن إبراهيم ‏\"‏ أن تذر ذريتك، ولست بنافق نفقة تبتغي بها وجه الله إلا آجرك الله بها، حتى اللقمة تجعلها في في امرأتك ‏\"‏‏.‏ قلت يا رسول الله، أخلف بعد أصحابي قال ‏\"‏ إنك لن تخلف فتعمل عملا تبتغي به وجه الله إلا ازددت به درجة ورفعة، ولعلك تخلف حتى ينتفع بك أقوام، ويضر بك آخرون، اللهم أمض لأصحابي هجرتهم، ولا تردهم على أعقابهم، لكن البائس سعد ابن خولة يرثي له رسول الله صلى الله عليه وسلم أن توفي بمكة ‏\"‏‏.‏ وقال أحمد بن يونس وموسى عن إبراهيم ‏\"‏ أن تذر ورثتك ‏\"‏‏.‏",
      "text_en": " Narrated Sa`d bin Malik:                     In the year of Hajjat-ul-Wada` the Prophet visited me when I fell ill and was about to die because of that illness. I said, \"O Allah's Apostle! I am very ill as you see, and I am a rich man and have no heir except my only daughter. Shall I give 2/3 of my property in charity?\" He said, \"No.\" I said, \"Shall I then give one half of it in charity?\" He said, \"O Sa`d! Give 1/3 (in charity) and even 1/3 is too much. No doubt, it is better to leave your children rich than to leave them poor, reduced to begging from others. And Allah will reward you for whatever you spend with the intention of gaining Allah's Pleasure even if it were a mouthful of food you put into your wives mouth.\" I said, \"O Allah's Apostle! Am I to be left behind (in Mecca) after my companions have gone?\" He said, \"If you should be left behind, you will be upgraded and elevated for every deed you will do with a desire to achieve Allah's Pleasure. I hope that you will live long so that some people will benefit by you while others will be harmed. O Allah! Please fulfill the migration of my companions and do not make them turn back on their heels. But (we feel sorry for) the unlucky Sa`d bin Khaulah.\" Allah's Apostle lamented his death in Mecca.",
      "chain": [
        "30119",
        "20150",
        "11013",
        "10554",
        "9"
      ]
    },
    {
      "hadith_no": "4104",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا إبراهيم بن سعد، عن أبيه، عن جده، عن سعد بن أبي وقاص  رضى الله عنه  قال رأيت رسول الله صلى الله عليه وسلم يوم أحد، ومعه رجلان يقاتلان عنه، عليهما ثياب بيض، كأشد القتال، ما رأيتهما قبل ولا بعد‏.‏",
      "text_en": " Narrated Sa`d bin Abi Waqqas:                     I saw Allah's Apostle on the day of the battle of Uhud accompanied by two men fighting on his behalf. They were dressed in white and were fighting as bravely as possible. I had never seen them before, nor did I see them later on.",
      "chain": [
        "30105",
        "20150",
        "11063",
        "9"
      ]
    },
    {
      "hadith_no": "4105",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني عبد الله بن محمد، حدثنا مروان بن معاوية، حدثنا هاشم بن هاشم السعدي، قال سمعت سعيد بن المسيب، يقول سمعت سعد بن أبي وقاص، يقول نثل لي النبي صلى الله عليه وسلم كنانته يوم أحد فقال ‏\"‏ ارم فداك أبي وأمي ‏\"‏‏.‏",
      "text_en": " Narrated Sa`d bin Abi Waqqas:                     The Prophet took out a quiver (of arrows) for me on the day of Uhud and said, \"Throw (arrows); let my father and mother be sacrificed for you.\"",
      "chain": [
        "30351",
        "20201",
        "11227",
        "11002",
        "9"
      ]
    },
    {
      "hadith_no": "4106",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن يحيى بن سعيد، قال سمعت سعيد بن المسيب، قال سمعت سعدا، يقول جمع لي النبي صلى الله عليه وسلم أبويه يوم أحد‏.‏",
      "text_en": " Narrated Sa`d:                     Allah's Apostle mentioned both his father and mother for me on the day of the battle of Uhud.",
      "chain": [
        "30175",
        "20031",
        "11062",
        "11002",
        "9"
      ]
    },
    {
      "hadith_no": "4107",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا قتيبة، حدثنا ليث، عن يحيى، عن ابن المسيب، أنه قال قال سعد بن أبي وقاص  رضى الله عنه  لقد جمع لي رسول الله صلى الله عليه وسلم يوم أحد أبويه كليهما‏.‏ يريد حين قال ‏\"‏ فداك أبي وأمي ‏\"‏‏.‏ وهو يقاتل‏.‏",
      "text_en": " Narrated Ibn Al Musaiyab:                     Sa`d bin Abi Waqqas said, \"Allah's Apostle mentioned both his father and mother for me on the day of the battle of Uhud.\" He meant when the Prophet said (to Sa`d) while the latter was fighting. \"Let my father and mother be sacrificed for you!\"",
      "chain": [
        "30367",
        "20023",
        "20031",
        "11002",
        "9"
      ]
    },
    {
      "hadith_no": "4108",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا أبو نعيم، حدثنا مسعر، عن سعد، عن ابن شداد، قال سمعت عليا  رضى الله عنه  يقول ما سمعت النبي صلى الله عليه وسلم يجمع أبويه لأحد غير سعد‏.‏",
      "text_en": " Narrated `Ali:                     I have never heard the Prophet mentioning both his father and mother for anybody other than Sa`d.",
      "chain": [
        "20348",
        "20359",
        "9",
        "5"
      ]
    },
    {
      "hadith_no": "4171",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن سعد، قال سمعت أبا أمامة، قال سمعت أبا سعيد الخدري  رضى الله عنه  يقول نزل أهل قريظة على حكم سعد بن معاذ، فأرسل النبي صلى الله عليه وسلم إلى سعد، فأتى على حمار، فلما دنا من المسجد قال للأنصار ‏\"‏ قوموا إلى سيدكم  أو  خيركم ‏\"‏‏.‏ فقال ‏\"‏ هؤلاء نزلوا على حكمك ‏\"‏‏.‏ فقال تقتل مقاتلتهم وتسبي ذراريهم‏.‏ قال ‏\"‏ قضيت بحكم الله ‏\"‏‏.‏ وربما قال ‏\"‏ بحكم الملك ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     The people of (Banu) Quraiza agreed to accept the verdict of Sa`d bin Mu`adh. So the Prophet sent for Sa`d, and the latter came (riding) a donkey and when he approached the Mosque, the Prophet said to the Ansar, \"Get up for your chief or for the best among you.\" Then the Prophet said (to Sa`d).\" These (i.e. Banu Quraiza) have agreed to accept your verdict.\" Sa`d said, \"Kill their (men) warriors and take their offspring as captives, \"On that the Prophet said, \"You have judged according to Allah's Judgment,\" or said, \"according to the King's judgment.\"",
      "chain": [
        "30160",
        "20278",
        "20020",
        "9",
        "4048",
        "38"
      ]
    },
    {
      "hadith_no": "4371",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "وقال هشام وأخبرنا معمر، عن عاصم، عن أبي العالية، أو أبي عثمان النهدي قال سمعت سعدا، وأبا، بكرة عن النبي صلى الله عليه وسلم‏.‏ قال عاصم قلت لقد شهد عندك رجلان حسبك بهما‏.‏ قال أجل أما أحدهما فأول من رمى بسهم في سبيل الله، وأما الآخر فنزل إلى النبي صلى الله عليه وسلم ثالث ثلاثة وعشرين من الطائف‏.‏",
      "text_en": "",
      "chain": [
        "11080",
        "9",
        "3229"
      ]
    },
    {
      "hadith_no": "4453",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا إبراهيم  هو ابن سعد  حدثنا ابن شهاب، عن عامر بن سعد، عن أبيه، قال عادني النبي صلى الله عليه وسلم في حجة الوداع من وجع، أشفيت منه على الموت، فقلت يا رسول الله بلغ بي من الوجع ما ترى، وأنا ذو مال ولا يرثني إلا ابنة لي واحدة أفأتصدق بثلثى مالي قال ‏\"‏ لا ‏\"‏‏.‏ قلت أفأتصدق بشطره قال ‏\"‏ لا ‏\"‏‏.‏ قلت فالثلث قال ‏\"‏ والثلث كثير، إنك أن تذر ورثتك أغنياء خير من أن تذرهم عالة يتكففون الناس، ولست تنفق نفقة تبتغي بها وجه الله إلا أجرت بها، حتى اللقمة تجعلها في في امرأتك ‏\"‏‏.‏ قلت يا رسول الله آأخلف بعد أصحابي قال ‏\"‏ إنك لن تخلف فتعمل عملا تبتغي به وجه الله إلا ازددت به درجة ورفعة، ولعلك تخلف حتى ينتفع بك أقوام ويضر بك آخرون، اللهم أمض لأصحابي هجرتهم، ولا تردهم على أعقابهم‏.‏ لكن البائس سعد ابن خولة رثى له رسول الله صلى الله عليه وسلم أن توفي بمكة ‏\"‏‏.‏",
      "text_en": " Narrated Sa`d:                     The Prophet visited me during Hajjat ul-Wada` while I was suffering from a disease which brought me to the verge of death. I said, \"O Allah's Apostle! My ailment has reached such a (bad) state as you see, and I have much wealth, but I have no-one to inherit from me except my only daughter. Shall I give 2/3 of my property as alms (in charity)?\" The Prophet said, \"No,\" I said, \"Shall I give half of my property as alms?\" He said, \"No.\" I said, \"(Shall I give) 1/3 of it? \" He replied, \" 1/3, and even 1/3 is too much. It is better for you to leave your inheritors wealthy rather than to leave them poor, begging people (for their sustenance); and whatever you spend for Allah's Sake, you will get reward for it even for the morsel of food which you put in your wives mouth.\" I said, \"O Allah's Apostle! Should I remain (in Mecca) behind my companions (who are going with you to Medina)?\" The Prophet said, \"If you remain behind, any good deed which you will do for Allah's Sake, will upgrade and elevate you. May be you will live longer so that some people may benefit by you and some other (i.e. infidels) may get harmed by you.\" The Prophet then added, \"O Allah! Complete the Migration of my companions and do not turn them on their heels. But the poor Sa`d bin Khaula (not the above mentioned Sa`d) (died in Mecca) .\" Allah's Apostle pitied Sa`d for he died in Mecca.",
      "chain": [
        "30184",
        "20150",
        "11013",
        "10554",
        "9"
      ]
    },
    {
      "hadith_no": "4460",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن شعبة، عن الحكم، عن مصعب بن سعد، عن أبيه، أن رسول الله صلى الله عليه وسلم خرج إلى تبوك، واستخلف عليا فقال أتخلفني في الصبيان والنساء قال ‏\"‏ ألا ترضى أن تكون مني بمنزلة هارون من موسى إلا أنه ليس نبي بعدي ‏\"‏‏.‏ وقال أبو داود حدثنا شعبة عن الحكم سمعت مصعبا‏.‏",
      "text_en": " Narrated Sa`d:                     Allah's Apostle set out for Tabuk. appointing `Ali as his deputy (in Medina). `Ali said, \"Do you want to leave me with the children and women?\" The Prophet said, \"Will you not be pleased that you will be to me like Aaron to Moses? But there will be no prophet after me.\"",
      "chain": [
        "30175",
        "20031",
        "20020",
        "11069",
        "10556",
        "9"
      ]
    },
    {
      "hadith_no": "4479",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن سعد، عن عروة، عن عائشة، قالت كنت أسمع أنه لا يموت نبي حتى يخير بين الدنيا والآخرة، فسمعت النبي صلى الله عليه وسلم يقول في مرضه الذي مات فيه وأخذته بحة يقول ‏{‏مع الذين أنعم الله عليهم‏}‏ الآية، فظننت أنه خير‏.‏",
      "text_en": " Narrated `Aisha:                     Used to hear (from the Prophet) that no Prophet dies till he is given the option to select either the worldly life or the life of the Hereafter. I heard the Prophet in his fatal disease, with his voice becoming hoarse, saying, \"In the company of those on whom is the grace of Allah ..( to the end of the Verse ).\" (4.69) Thereupon I thought that the Prophet had been given the option.",
      "chain": [
        "30160",
        "20278",
        "20020",
        "9",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "4480",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا مسلم، حدثنا شعبة، عن سعد، عن عروة، عن عائشة، قالت لما مرض النبي صلى الله عليه وسلم المرض الذي مات فيه جعل يقول ‏\"‏ في الرفيق الأعلى ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     When the Prophet fell ill in his fatal illness, he started saying, \"With the highest companion.\"",
      "chain": [
        "20285",
        "20020",
        "9",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "5129",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا إبراهيم بن سعد، أخبرنا ابن شهاب، سمع سعيد بن المسيب، يقول سمعت سعد بن أبي وقاص، يقول رد رسول الله صلى الله عليه وسلم على عثمان بن مظعون التبتل، ولو أذن له لاختصينا‏.‏",
      "text_en": " Narrated Sa`d bin Abi Waqqas:                     Allah's Apostle forbade `Uthman bin Maz'un to abstain from marrying (and other pleasures) and if he had allowed him, we would have gotten ourselves castrated.",
      "chain": [
        "30184",
        "20150",
        "11013",
        "11002",
        "9"
      ]
    },
    {
      "hadith_no": "5130",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، قال أخبرني سعيد بن المسيب، أنه سمع سعد بن أبي وقاص، يقول لقد رد ذلك  يعني النبي صلى الله عليه وسلم  على عثمان، ولو أجاز له التبتل لاختصينا‏.‏",
      "text_en": " Narrated Sa`d bin Abi Waqqas:                     The Prophet prevented `Uthman bin Mazun from that (not marrying), and had he allowed him, we would have got ourselves castrated.",
      "chain": [
        "30330",
        "20428",
        "11013",
        "11002",
        "9"
      ]
    },
    {
      "hadith_no": "5408",
      "source": " Sahih Bukhari ",
      "chapter": "Supporting the Family - كتاب النفقات",
      "chapter_no": "69",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، عن سعد بن إبراهيم، عن عامر بن سعد، عن سعد   رضى الله عنه  قال كان النبي صلى الله عليه وسلم يعودني وأنا مريض بمكة، فقلت لي مال أوصي بمالي كله قال ‏\"‏ لا ‏\"‏‏.‏ قلت فالشطر قال ‏\"‏ لا ‏\"‏‏.‏ قلت فالثلث قال ‏\"‏ الثلث، والثلث كثير، أن تدع ورثتك أغنياء خير من أن تدعهم عالة، يتكففون الناس في أيديهم، ومهما أنفقت فهو لك صدقة حتى اللقمة ترفعها في في امرأتك، ولعل الله يرفعك، ينتفع بك ناس ويضر بك آخرون ‏\"‏‏.‏",
      "text_en": " Narrated Sa`d:                     The Prophet visited me at Mecca while I was ill. I said (to him), \"I have property; May I bequeath all my property in Allah's Cause?\" He said, \"No.\" I said, \"Half of it?\" He said, \"No.\" I said, \"One third of it?\" He said, \"One-third (is alright), yet it is still too much, for you'd better leave your inheritors wealthy than leave them poor, begging of others. Whatever you spend will be considered a Sadaqa for you, even the mouthful of food you put in the mouth of your wife. Anyhow Allah may let you recover, so that some people may benefit by you and others be harmed by you.\"",
      "chain": [
        "28531",
        "20012",
        "11063",
        "10554",
        "9"
      ]
    },
    {
      "hadith_no": "5467",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا وهب بن جرير، حدثنا شعبة، عن إسماعيل، عن قيس، عن سعد، قال رأيتني سابع سبعة مع النبي صلى الله عليه وسلم ما لنا طعام إلا ورق الحبلة  أو الحبلة  حتى يضع أحدنا ما تضع الشاة، ثم أصبحت بنو أسد تعزرني على الإسلام، خسرت إذا وضل سعيي‏.‏",
      "text_en": " Narrated Sa`d:                     I was one of (the first) seven (who had embraced Islam) with Allah's Apostle and we had nothing to eat then, except the leaves of the Habala or Hubula tree, so that our stool used to be similar to that of sheep. Now the tribe of Bani Asad wants to teach me Islam; I would be a loser and all my efforts would be in vain (if I learn Islam anew from them).",
      "chain": [
        "30351",
        "20298",
        "20020",
        "20208",
        "11046",
        "9"
      ]
    },
    {
      "hadith_no": "5501",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا جمعة بن عبد الله، حدثنا مروان، أخبرنا هاشم بن هاشم، أخبرنا عامر بن سعد، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من تصبح كل يوم سبع تمرات عجوة لم يضره في ذلك اليوم سم ولا سحر ‏\"‏‏.‏",
      "text_en": " Narrated Sa`d:                     Allah's Apostle said, \"He who eats seven 'Ajwa dates every morning, will not be affected by poison or magic on the day he eats them.\"",
      "chain": [
        "20201",
        "11227",
        "10554",
        "9"
      ]
    },
    {
      "hadith_no": "5702",
      "source": " Sahih Bukhari ",
      "chapter": "Patients - كتاب المرضى",
      "chapter_no": "75",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن سفيان، عن سعد، عن عبد الله بن كعب، عن أبيه، عن النبي صلى الله عليه وسلم قال ‏\"‏ مثل المؤمن كالخامة من الزرع تفيئها الريح مرة، وتعدلها مرة، ومثل المنافق كالأرزة لا تزال حتى يكون انجعافها مرة واحدة ‏\"‏‏.‏ وقال زكرياء حدثني سعد، حدثنا ابن كعب، عن أبيه، كعب عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Ka`b:                     The Prophet said, \"The example of a believer is that of a fresh tender plant, which the wind bends lt sometimes and some other time it makes it straight. And the example of a hypocrite is that of a pine tree which keeps straight till once it is uprooted suddenly.",
      "chain": [
        "30175",
        "20031",
        "20012",
        "9",
        "1131",
        "390"
      ]
    },
    {
      "hadith_no": "5721",
      "source": " Sahih Bukhari ",
      "chapter": "Patients - كتاب المرضى",
      "chapter_no": "75",
      "text_ar": "حدثنا المكي بن إبراهيم، أخبرنا الجعيد، عن عائشة بنت سعد، أن أباها، قال تشكيت بمكة شكوا شديدا، فجاءني النبي صلى الله عليه وسلم يعودني، فقلت يا نبي الله إني أترك مالا وإني لم أترك إلا ابنة واحدة، فأوصي بثلثى مالي وأترك الثلث فقال ‏\"‏ لا ‏\"‏‏.‏ قلت فأوصي بالنصف وأترك النصف قال ‏\"‏ لا ‏\"‏‏.‏ قلت فأوصي بالثلث وأترك لها الثلثين قال ‏\"‏ الثلث والثلث كثير ‏\"‏‏.‏ ثم وضع يده على جبهته، ثم مسح يده على وجهي وبطني ثم قال ‏\"‏ اللهم اشف سعدا وأتمم له هجرته ‏\"‏‏.‏ فما زلت أجد برده على كبدي فيما يخال إلى حتى الساعة‏.‏",
      "text_en": " Narrated Sa`d:                     I became seriously ill at Mecca and the Prophet came to visit me. I said, \"O Allah's Apostle! I shall leave behind me a good fortune, but my heir is my only daughter; shall I bequeath two third of my property to be spent in charity and leave one third (for my heir)?\" He said, \"No.\" I said, \"Shall I bequeath half and leave half?\" He said, \"No.\" I said, \"Shall I bequeath one third and leave two thirds?\" He said, \"One third is alright, though even one third is too much.\" Then he placed his hand on his forehead and passed it over my face and `Abdomen and said, \"O Allah! Cure Sa`d and complete his emigration.\" I feel as if I have been feeling the coldness of his hand on my liver ever since.",
      "chain": [
        "20202",
        "11679",
        "10559",
        "9"
      ]
    },
    {
      "hadith_no": "5730",
      "source": " Sahih Bukhari ",
      "chapter": "Patients - كتاب المرضى",
      "chapter_no": "75",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا عبد العزيز بن عبد الله بن أبي سلمة، أخبرنا الزهري، عن عامر بن سعد، عن أبيه، قال جاءنا رسول الله صلى الله عليه وسلم يعودني من وجع اشتد بي زمن حجة الوداع فقلت بلغ بي ما ترى وأنا ذو مال ولا يرثني إلا ابنة لي أفأتصدق بثلثى مالي قال ‏\"‏ لا ‏\"‏‏.‏ قلت بالشطر قال ‏\"‏ لا ‏\"‏‏.‏ قلت الثلث قال ‏\"‏ الثلث كثير، أن تدع ورثتك أغنياء خير من أن تذرهم عالة يتكففون الناس ولن تنفق نفقة تبتغي بها وجه الله إلا أجرت عليها حتى ما تجعل في في امرأتك ‏\"‏‏.‏",
      "text_en": " Narrated Sa`d:                     Allah's Apostle came to visit me during my ailment which had been aggravated during Hajjat-al- Wada`. I said to him, \"You see how sick I am. I have much property but have no heir except my only daughter May I give two thirds of my property in charity?\"! He said, \"No.\" I said, \"Half of it?\" He said, \"No.\" I said \"One third?\" He said, \"One third is too much, for to leave your heirs rich is better than to leave them poor, begging of others. Nothing you spend seeking Allah's pleasure but you shall get a reward for it, even for what you put in the mouth of your wife.\"",
      "chain": [
        "20040",
        "20026",
        "11013",
        "10554",
        "9"
      ]
    },
    {
      "hadith_no": "5787",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، قال أخبرني حبيب بن أبي ثابت، قال سمعت إبراهيم بن سعد، قال سمعت أسامة بن زيد، يحدث سعدا عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا سمعتم بالطاعون بأرض فلا تدخلوها، وإذا وقع بأرض وأنتم بها فلا تخرجوا منها ‏\"‏‏.‏ فقلت أنت سمعته يحدث سعدا ولا ينكره قال نعم‏.‏",
      "text_en": " Narrated Saud:                     The Prophet said, \"If you hear of an outbreak of plague in a land, do not enter it; but if the plague breaks out in a place while you are in it, do not leave that place.\"",
      "chain": [
        "30329",
        "20020",
        "11331",
        "20150",
        "50",
        "9"
      ]
    },
    {
      "hadith_no": "5827",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا علي، حدثنا مروان، أخبرنا هاشم، أخبرنا عامر بن سعد، عن أبيه  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ من اصطبح كل يوم تمرات عجوة، لم يضره سم ولا سحر ذلك اليوم إلى الليل ‏\"‏‏.‏ وقال غيره ‏\"‏ سبع تمرات ‏\"‏‏.‏",
      "text_en": " Narrated Saud:                     The Prophet said, \"If somebody takes some 'Ajwa dates every morning, he will not be effected by poison or magic on that day till night.\" (Another narrator said seven dates).",
      "chain": [
        "5",
        "20201",
        "10554",
        "9"
      ]
    },
    {
      "hadith_no": "5828",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا إسحاق بن منصور، أخبرنا أبو أسامة، حدثنا هاشم بن هاشم، قال سمعت عامر بن سعد، سمعت سعدا  رضى الله عنه  يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من تصبح سبع تمرات عجوة، لم يضره ذلك اليوم سم ولا سحر ‏\"‏‏.‏",
      "text_en": " Narrated Saud:                     I heard Allah's Apostle saying, \"If Somebody takes seven 'Ajwa dates in the morning, neither magic nor poison will hurt him that day.\"",
      "chain": [
        "30313",
        "20318",
        "11227",
        "10554",
        "9"
      ]
    },
    {
      "hadith_no": "5838",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا محمد، أخبرنا أحمد بن بشير أبو بكر، أخبرنا هاشم بن هاشم، قال أخبرني عامر بن سعد، قال سمعت أبي يقول، سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من اصطبح بسبع تمرات عجوة لم يضره ذلك اليوم سم ولا سحر ‏\"‏‏.‏",
      "text_en": " Narrated Sa`d:                     I heard Allah's Apostle saying, \"Whoever takes seven 'Ajwa dates in the morning will not be effected by magic or poison on that day.\"",
      "chain": [
        "30213",
        "11227",
        "10554",
        "9"
      ]
    },
    {
      "hadith_no": "5885",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا إسحاق بن إبراهيم الحنظلي، أخبرنا محمد بن بشر، حدثنا مسعر، عن سعد بن إبراهيم، عن أبيه، عن سعد، قال رأيت بشمال النبي صلى الله عليه وسلم وبيمينه رجلين عليهما ثياب بيض يوم أحد، ما رأيتهما قبل ولا بعد‏.‏",
      "text_en": " Narrated Sa`d:                     On the day of the battle of Uhud, on the right and on the left of the Prophet were two men wearing white clothes, and I had neither seen them before, nor did I see them afterwards.",
      "chain": [
        "30021",
        "20352",
        "20359",
        "11063",
        "584",
        "9"
      ]
    },
    {
      "hadith_no": "6444",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا محمد بن المثنى، حدثني غندر، حدثنا شعبة، عن عبد الملك بن عمير، عن مصعب بن سعد، عن سعد بن أبي وقاص  رضى الله عنه  كان يأمر بهؤلاء الخمس، ويحدثهن عن النبي صلى الله عليه وسلم ‏\"‏ اللهم إني أعوذ بك من البخل، وأعوذ بك من الجبن، وأعوذ بك أن أرد إلى أرذل العمر، وأعوذ بك من فتنة الدنيا، وأعوذ بك من عذاب القبر ‏\"‏‏.‏",
      "text_en": " Narrated Mus`ab bin Sa`d:                     Sa`d bin Abi Waqqas used to recommend these five (statements) and say that the Prophet said so (and they are): \"O Allah! I seek refuge with You from miserliness, and seek refuge with You from cowardice, and seek refuge with You from being brought back to geriatric old age, and seek refuge with You from the afflictions of the world, and seek refuge with You from the punishment of the grave.\"",
      "chain": [
        "30170",
        "20278",
        "20020",
        "11368",
        "10556",
        "9"
      ]
    },
    {
      "hadith_no": "6447",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا إبراهيم بن سعد، أخبرنا ابن شهاب، عن عامر بن سعد، أن أباه، قال عادني رسول الله صلى الله عليه وسلم في حجة الوداع من شكوى، أشفيت منها على الموت، فقلت يا رسول الله بلغ بي ما ترى من الوجع، وأنا ذو مال، ولا يرثني إلا ابنة لي واحدة، أفأتصدق بثلثى مالي قال ‏\"‏ لا ‏\"‏‏.‏ قلت فبشطره قال ‏\"‏ الثلث كثير، إنك أن تذر ورثتك أغنياء، خير من أن تذرهم عالة يتكففون الناس، وإنك لن تنفق نفقة تبتغي بها وجه الله، إلا أجرت، حتى ما تجعل في في امرأتك ‏\"‏‏.‏ قلت أأخلف بعد أصحابي قال ‏\"‏ إنك لن تخلف فتعمل عملا تبتغي به وجه الله، إلا ازددت درجة ورفعة ولعلك تخلف حتى ينتفع بك أقوام، ويضر بك آخرون، اللهم أمض لأصحابي هجرتهم، ولا تردهم على أعقابهم، لكن البائس سعد ابن خولة ‏\"‏‏.‏ قال سعد رثى له النبي صلى الله عليه وسلم من أن توفي بمكة‏.‏",
      "text_en": " Narrated 'Amir bin Sa`d:                     that his father said, \"In the year of Hajjatal-Wada`, the Prophet paid me a visit while I was suffering from an ailment that had brought me to the verge of death. I said, 'O Allah's Apostle! My sickness has reduced me to the (bad) state as you see, and I am a rich man, but have no heirs except one daughter. Shall I give 2/3 of my property in charity?' He said, 'No.' I said, 'Then 1/2 of it?' He said, 'Even 1/3 is too much, for, to leave your inheritors wealthy is better than to leave them in poverty, begging from people. And (know that) whatever you spend in Allah's Cause, you will get reward for it, even for the morsel of food which you put in your wife's mouth.' I said, 'O Allah's Apostle! Will I be left behind my companions (in Mecca)?' He said, 'If you remain behind, whatever good deed you will do for Allah's Sake, will raise and upgrade you to a higher position (in Allah's Sight). May be you will live longer so that some people may benefit by you, and some e others (pagans) may get harmed by you. O Allah! Complete the migration of my companions and do not turn them on their heels; But (we pity) the poor Sa`d bin Khaula (not the above mentioned Sa`d) (died in Mecca)\" Allah's Apostle lamented (or pitied) for him as he died in Mecca. (See Hadith No. 693, Vol. 5)",
      "chain": [
        "20040",
        "20150",
        "11013",
        "10554",
        "9"
      ]
    },
    {
      "hadith_no": "6448",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا إسحاق بن إبراهيم، أخبرنا الحسين، عن زائدة، عن عبد الملك، عن مصعب، عن أبيه، قال تعوذوا بكلمات كان النبي صلى الله عليه وسلم يتعوذ بهن ‏\"‏ اللهم إني أعوذ بك من الجبن، وأعوذ بك من البخل، وأعوذ بك من أن أرد إلى أرذل العمر، وأعوذ بك من فتنة الدنيا، وعذاب القبر ‏\"‏‏.‏",
      "text_en": " Narrated Sa`d:                     Seek refuge with Allah by saying the words which the Prophet used to say while seeking refuge with Allah, \"0 Allah! I seek refuge with You from cowardice, and seek refuge with You from miserliness, and seek refuge with You from reaching a degraded geriatric old age, and seek refuge with You from the afflictions of the world and from the punishment in the grave.\"",
      "chain": [
        "30123",
        "11278",
        "20320",
        "11368",
        "10556",
        "9"
      ]
    }
  ],
  "total_hadiths": 208
}