{
  "id": "906",
  "name": "'Abd al-Muttalib b. Rabi'ah b. al-Harith ( عبد المطلب بن ربيعة بن الحارث ( رضي الله عنه",
  "full_name": "'Abd al-Muttalib b. Rabi'ah b. al-Harith ( عبد المطلب بن ربيعة بن الحارث ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Makkah"
    },
    "death": {
      "date_hijri": "62",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Syria",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah",
      "Medinah",
      "Syria"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ م  د  س  -  صحابي ]"
    ],
    "tags": [
      "Quraish",
      "B.Hashim",
      "Nephew",
      "Child"
    ]
  },
  "parents": [
    {
      "id": "174",
      "name": "Rabi'ah ibn al-Harith ( ربيعة بن الحارث بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "249",
      "name": "Umm al-Hakam bint Az-Zubair ( أم الحكم بنت الزبير بن عبد المطلب ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "900",
      "name": "Adam bin Rabi'ah ibn al-Harith ( آدم بن ربيعة بن الحارث بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "901",
      "name": "Muhammad bin Rabi'ah ibn al-Harith ( محمد بن ربيعة بن الحارث بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "902",
      "name": "'Abdullah bin Rabi'ah ibn al-Harith ( عبد الله بن ربيعة بن الحارث بن عبدالمطلب ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "903",
      "name": "'Abbas ibn Rabi'ah ibn al-Harith ( عباس بن ربيعة بن الحارث بن عبدالمطلب ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "904",
      "name": "al-Harith ibn Rabi'ah ibn al-Harith ( الحارث بن ربيعة بن الحارث بن عبدالمطلب ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "905",
      "name": "'Abd Shams ibn Rabi'ah ibn al-Harith ( عبد شمس بن ربيعة بن الحارث بن عبدالمطلب ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "907",
      "name": "Arwa bint Rabi'ah b. al-Harith ( أروى بنت ربيعة بن الحارث ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "908",
      "name": "Hind bint Rabi'ah b. al-Harith ( هند بنت ربيعة بن الحارث ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "909",
      "name": "Umima bint Rabi'ah b. al-Harith ( أميمة/ أمامة بنت ربيعة بن الحارث ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "5",
      "name": "Ali ibn Abi Talib ( علي بن أبي طالب بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "912",
      "name": "'Abdullah ibn al-Harith ibn Nawfal ( عبد الله بن الحارث بن نوفل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "4125",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا قتيبة، حدثنا أبو عوانة، عن يزيد بن أبي زياد، عن عبد الله بن الحارث، حدثني عبد المطلب بن ربيعة بن الحارث بن عبد المطلب، أن العباس بن عبد المطلب، دخل على رسول الله صلى الله عليه وسلم مغضبا وأنا عنده فقال ‏\"‏ ما أغضبك ‏\"‏ ‏.‏ قال يا رسول الله ما لنا ولقريش إذا تلاقوا بينهم تلاقوا بوجوه مبشرة وإذا لقونا لقونا بغير ذلك ‏.‏ قال فغضب رسول الله صلى الله عليه وسلم حتى احمر وجهه ثم قال ‏\"‏ والذي نفسي بيده لا يدخل قلب رجل الإيمان حتى يحبكم لله ولرسوله ‏\"‏ ‏.‏ ثم قال ‏\"‏ يا أيها الناس من آذى عمي فقد آذاني فإنما عم الرجل صنو أبيه ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated 'Abdul-Muttalib bin Rabi'ah bin Al-Harith bin 'Abdul-Muttalib:                     \"Al-'Abbas bin 'Abdul-Muttalib entered upon the Messenger of Allah (ﷺ) in a state of anger while I was with him, so he said: 'What has angered you?' He said: 'O Messenger of Allah, what is it with us and the Quraish, whenever they meet one another it is with glad faces, and when they meet us they meet us with other than that?'\" He said: \"So the Messenger of Allah (ﷺ) became angry, until his face reddened, then he said: 'By the One in Whose Hand is my soul! Faith does not enter a man's heart until he loves you for the sake of Allah, and for the sake of His Messenger.' Then he said: 'O people! Whoever harms my uncle, he has harmed me, for indeed, a man's uncle is not but the Sinw (two or three palm trees will come from a single root, so each is called a Sinw. A man's uncle is like that to his father. That is, he is like his father) of his father.\"",
      "chain": [
        "30367",
        "20469",
        "10844",
        "912",
        "906"
      ]
    },
    {
      "hadith_no": "2609",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا عمرو بن سواد بن الأسود بن عمرو، عن ابن وهب، قال حدثنا يونس، عن ابن شهاب، عن عبد الله بن الحارث بن نوفل الهاشمي، أن عبد المطلب بن ربيعة بن الحارث بن عبد المطلب، أخبره أن أباه ربيعة بن الحارث قال لعبد المطلب بن ربيعة بن الحارث والفضل بن العباس بن عبد المطلب ائتيا رسول الله صلى الله عليه وسلم فقولا له استعملنا يا رسول الله على الصدقات ‏.‏ فأتى علي بن أبي طالب ونحن على تلك الحال فقال لهما إن رسول الله صلى الله عليه وسلم لا يستعمل منكم أحدا على الصدقة قال عبد المطلب فانطلقت أنا والفضل حتى أتينا رسول الله صلى الله عليه وسلم فقال لنا ‏\"‏ إن هذه الصدقة إنما هي أوساخ الناس وإنها لا تحل لمحمد ولا لآل محمد صلى الله عليه وسلم ‏\"‏ ‏.‏",
      "text_en": " Abu Rabiah binAl-Harith said to 'Abdul-Muttalib bin Rabi'ah bin Al-Harith and Al-Fadl bin 'Abbas bin 'Abdul-Muttalib:                     \"Go to the Messenger of Allah and say to him:  'O Messenger of Allah, appoint us to collect the Sadaqat!' 'Ali bin Abi Talib came along when we were like that, and he said to them: \"The Messenger of Allah will not appoint any of you to collect the Sadaqah.\"' 'Abdul-Muttalib said: \"So I went with Al-Fadl until we came to the Messenger of Allah and he said to us: \"This Zakah is the dirt of the people, and it is not permissible for Muhammad or for the family of Muhammad.\"'",
      "chain": [
        "30443",
        "20029",
        "20475",
        "11013",
        "906"
      ]
    }
  ],
  "total_hadiths": 2
}