{
  "id": "930",
  "name": "Muhammad bin Qays bin Makhrama ( محمد بن قيس بن مخرمة بن المطلب ( رضي الله عنه",
  "full_name": "Muhammad bin Qays bin Makhrama ( محمد بن قيس بن مخرمة بن المطلب ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Makkah"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Medina",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah",
      "Medinah"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ م  ت  س  -  صحابي ]"
    ],
    "tags": [
      "Quraish",
      "B.al-Muttalib",
      "Child",
      "Hijazi",
      "Makki"
    ]
  },
  "parents": [
    {
      "id": "928",
      "name": "Qays bin Makhrama ( قيس بن مخرمة بن المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "1861",
      "name": "Wadda bint 'Uqba b. Rafi ( ودة بنت عقبة بن رافع بن امرئ القيس ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "929",
      "name": "'Abdullah bin Qays bin Makhrama ( عبد الله بن قيس بن مخرمة بن المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "931",
      "name": "Zaynab bint Qays bin Makhrama ( زينب بنت قيس بن مخرمة بن المطلب ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11090",
      "name": "'Abdullah bin 'Ubaidullah b. Abi Mulayka عبد الله بن عبيد الله بن أبي مليكة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10936",
      "name": "'Abdullah bin Kathir bin al-Mtlb عبد الله بن كثير بن المطلب",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10616",
      "name": "Muhammad bin Ajlan al-Madni محمد بن عجلان المدني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11107",
      "name": "Ibn Ishaq محمد بن إسحاق بن يسار‎",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10653",
      "name": "'Umar bin 'Abdur Rahman عمر بن عبد الرحمن بن محيصن",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "6734",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا قتيبة بن سعيد، وأبو بكر بن أبي شيبة كلاهما عن ابن عيينة، - واللفظ لقتيبة - حدثنا سفيان، عن ابن محيصن، شيخ من قريش سمع محمد بن قيس بن مخرمة، يحدث عن أبي هريرة، قال لما نزلت ‏{‏ من يعمل سوءا يجز به‏}‏ بلغت من المسلمين مبلغا شديدا فقال رسول الله صلى الله عليه وسلم ‏\"‏ قاربوا وسددوا ففي كل ما يصاب به المسلم كفارة حتى النكبة ينكبها أو الشوكة يشاكها ‏\"‏ ‏.‏ قال مسلم هو عمر بن عبد الرحمن بن محيصن من أهل مكة ‏.‏",
      "text_en": " Abu Huraira reported that when this verse was revealed:                     \" Whoever does evil will be requited for it\", and when this was conveyed to the Muslims they were greatly perturbed. Thereupon Allah's Messenger (may peace be upon him) said: Be moderate and stand firm in trouble that falls to the lot of a Muslim (as that) is an expiation for him; even stumbling on the path or the prickin of a thorn (are an expiation for him). Muslim said that 'Umar b. Abd al-Rahman Muhaisin was from amongst the people of Mecca.",
      "chain": [
        "30367",
        "20005",
        "930",
        "13"
      ]
    },
    {
      "hadith_no": "3312",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمد بن يحيى بن أبي عمر، وعبد الله بن أبي زياد المعنى، واحد، قالا حدثنا سفيان بن عيينة، عن ابن محيصن، عن محمد بن قيس بن مخرمة، عن أبي هريرة، قال لما نزلت ‏:‏ ‏(‏من يعمل سوءا يجز به ‏)‏ شق ذلك على المسلمين فشكوا ذلك إلى النبي صلى الله عليه وسلم فقال ‏\"‏ قاربوا وسددوا وفي كل ما يصيب المؤمن كفارة حتى الشوكة يشاكها أو النكبة ينكبها ‏\"‏ ‏.‏ ابن محيصن هو عمر بن عبد الرحمن بن محيصن ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     \"When the following was revealed: 'Whoever works evil will have the recompense of it... (4:123)' That worried the Muslims, so they complained about that to the Messenger of Allah (ﷺ) and he said: \"Seek closeness and be steadfast, and in all that afflicts the believer there is atonement, even a thorn that pricks him, and the hardship he suffers.\"",
      "chain": [
        "30421",
        "20005",
        "930",
        "13"
      ]
    },
    {
      "hadith_no": "2037",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا يوسف بن سعيد، قال حدثنا حجاج، عن ابن جريج، قال أخبرني عبد الله بن أبي مليكة، أنه سمع محمد بن قيس بن مخرمة، يقول سمعت عائشة، تحدث قالت ‏:‏ ألا أحدثكم عني وعن النبي صلى الله عليه وسلم قلنا ‏:‏ بلى ‏.‏ قالت ‏:‏ لما كانت ليلتي التي هو عندي تعني النبي صلى الله عليه وسلم انقلب فوضع نعليه عند رجليه، وبسط طرف إزاره على فراشه، فلم يلبث إلا ريثما ظن أني قد رقدت، ثم انتعل رويدا وأخذ رداءه رويدا، ثم فتح الباب رويدا وخرج رويدا وجعلت درعي في رأسي واختمرت وتقنعت إزاري، وانطلقت في إثره حتى جاء البقيع، فرفع يديه ثلاث مرات فأطال، ثم انحرف فانحرفت، فأسرع فأسرعت، فهرول فهرولت، فأحضر فأحضرت وسبقته فدخلت، فليس إلا أن اضطجعت فدخل فقال ‏:‏ ‏\"‏ ما لك يا عائشة حشيا رابية ‏\"‏ ‏.‏ قالت ‏:‏ لا ‏.‏ قال ‏:‏ ‏\"‏ لتخبرني أو ليخبرني اللطيف الخبير ‏\"‏ ‏.‏ قلت ‏:‏ يا رسول الله بأبي أنت وأمي، فأخبرته الخبر ‏.‏ قال ‏:‏ ‏\"‏ فأنت السواد الذي رأيت أمامي ‏\"‏ ‏.‏ قالت ‏:‏ نعم، فلهزني في صدري لهزة أوجعتني، ثم قال ‏:‏ ‏\"‏ أظننت أن يحيف الله عليك ورسوله ‏\"‏ ‏.‏ قلت ‏:‏ مهما يكتم الناس فقد علمه الله ‏.‏ قال ‏:‏ ‏\"‏ فإن جبريل أتاني حين رأيت ولم يدخل على وقد وضعت ثيابك فناداني، فأخفى منك فأجبته فأخفيته منك، فظننت أن قد رقدت وكرهت أن أوقظك، وخشيت أن تستوحشي، فأمرني أن آتي البقيع فأستغفر لهم ‏\"‏ ‏.‏ قلت ‏:‏ كيف أقول يا رسول الله قال ‏:‏ ‏\"‏ قولي السلام على أهل الديار من المؤمنين والمسلمين، يرحم الله المستقدمين منا والمستأخرين، وإنا إن شاء الله بكم لاحقون ‏\"‏ ‏.‏",
      "text_en": " Muhammad bin Qais bin Makhramah said:                     \"Aishah said: 'Shall I not tell you about me and about the Prophet?' We said: 'Yes.' She said: 'When it was my night when he was with me' - meaning the Prophet -'He came back (from 'Isha' prayer), put his sandals by his feet and spread the edge of his Izar on his bed. He stayed until he thought that I had gone to sleep. Then he put his sandals on slowly, picked up his cloak slowly, then opened the door slowly and went out slowly. I covered my head, put on my vie and tightened my waist wrapper, then I followed his steps until he came to Al-Baqi'. He raised his hands three times, and stood there for a long time, then he left and I left. He hastened and I also hastened; he ran and I also ran. He came (to the house) and I also came, but I got there first and entered, and as I lay down he came in. He said: \"Tell me, or the Subtle, the All-Aware will tell me.' I said: 'O Messenger of Allah, may my father and mother be ransomed for you,' and I told him (the whole story). He said: 'So you were the black shape that I saw in front of me?' I said, 'Yes.' He gave me a nudge on the chest which I felt, then he said: 'Did you think that Allah and His Messenger would deal unjustly with you?' I said: 'Whatever the people conceal, Allah knows it.' He said: Jibril came to me when I saw you, but he did not enter upon me because you where not fully dressed. He called me but he concealed that from you, and I answered him, but I concealed that from  you too. I thought that you had gone to sleep and I did not want to wake you up, and I was afraid that you would be frightened. He told me to go to Al-Baqi' and pray for forgiveness for them.' I said: 'What should I say, O Messenger of Allah?' He said: 'Say\" Peace be upon the inhabitants of this place among the believers and Muslims. May Allah have mercy upon those who have gone on ahead of us and those who come later on, and we will join you, if Allah wills.\"'",
      "chain": [
        "20219",
        "11070",
        "11090",
        "930"
      ]
    },
    {
      "hadith_no": "3964",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Kind Treatment of Women - كتاب عشرة النساء",
      "chapter_no": "36",
      "text_ar": "حدثنا يوسف بن سعيد بن مسلم المصيصي، قال حدثنا حجاج، عن ابن جريج، أخبرني عبد الله بن أبي مليكة، أنه سمع محمد بن قيس بن مخرمة، يقول سمعت عائشة، تحدث قالت ألا أحدثكم عني وعن النبي صلى الله عليه وسلم قلنا بلى ‏.‏ قالت لما كانت ليلتي التي هو عندي تعني النبي صلى الله عليه وسلم انقلب فوضع نعليه عند رجليه ووضع رداءه وبسط طرف إزاره على فراشه فلم يلبث إلا ريثما ظن أني قد رقدت ثم انتعل رويدا وأخذ رداءه رويدا ثم فتح الباب رويدا وخرج وأجافه رويدا وجعلت درعي في رأسي واختمرت وتقنعت إزاري فانطلقت في إثره حتى جاء البقيع فرفع يديه ثلاث مرات وأطال القيام ثم انحرف فانحرفت فأسرع فأسرعت فهرول فهرولت فأحضر فأحضرت وسبقته فدخلت فليس إلا أن اضطجعت فدخل فقال ‏\"‏ ما لك يا عائشة حشيا رابية ‏\"‏ ‏.‏ قالت لا ‏.‏ قال ‏\"‏ لتخبرني أو ليخبرني اللطيف الخبير ‏\"‏ ‏.‏ قلت يا رسول الله بأبي أنت وأمي فأخبرته الخبر ‏.‏ قال ‏\"‏ فأنت السواد الذي رأيته أمامي ‏\"‏ ‏.‏ قالت نعم - قالت - فلهدني في صدري لهدة أوجعتني ثم قال ‏\"‏ أظننت أن يحيف الله عليك ورسوله ‏\"‏ ‏.‏ قالت مهما يكتم الناس فقد علمه الله ‏.‏ قال ‏\"‏ نعم - قال - فإن جبريل عليه السلام أتاني حين رأيت ولم يكن يدخل عليك وقد وضعت ثيابك فناداني فأخفى منك فأجبته فأخفيت منك فظننت أن قد رقدت وخشيت أن تستوحشي فأمرني أن آتي أهل البقيع فأستغفر لهم ‏\"‏ ‏.‏ رواه عاصم عن عبد الله بن عامر عن عائشة على غير هذا اللفظ ‏.‏",
      "text_en": " 'Aishah said:                      \"Shall I not tell you about the Prophet and I?\" We said: \"Yes.\" She said: \"When it was my night when he\" -meaning the Prophet- \"was with me, he came in, placed his shoes by his feet, lay down his Rida' (upper garment), and spread the edge of his Izar (lower garment) on his bed. As soon as he thought that I had gone to sleep, he put his shoes on slowly, and picked up his Rida' slowly. Then he opened the door slowly, went out and shut it slowly. I put my garment over my head, covered myself and put on my Izar (lower garment), and I set out after him until he came to Al-Baqi', raised his hands three times and stood there for a long time. Then he left and I left, he hurried and I hurried, he ran and I ran, and I got there before him and entered (the house). I had only just laid down when he came in and said: 'O 'Aishah, why are you out of breath?' She said: 'No.' He said: 'Either you tell me or Allah, the All-Aware, All-Knowing, will tell me.' I said: 'O Messenger of Allah, may my father and mother be sacrificed for you;' and I told him the story. He said: 'You were the black shape I saw in front of me?' I said: 'Yes.'\" She said: \"He gave me a shove in the chest that hurt me and said: 'You thought that Allah and His Messenger would be unfair to you.' She said: 'Whatever people conceal, Allah knows it.' He said: 'Yes.' He said: 'Jibril came to me when you saw (me leave) but he did not enter upon you because you have taken off your garments. So he called me but he concealed himself from you, and I answered him, but I concealed it from you. I thought that you had gone to sleep and I did not want to wake you, and I was afraid that you would feel lonely. He told me to go to Al-Baqi' and pray for forgiveness for them.'\" 'Asim reported it from 'Abdullah bin 'Amir, from 'Aishah, with a wording different from this.",
      "chain": [
        "20219",
        "11070",
        "11090",
        "930"
      ]
    }
  ],
  "total_hadiths": 4
}