{
  "id": "994",
  "name": "'Attab bin Usayd bin Abi al-'Is ( عتاب بن اسيد بن أبي العيص بن أمية ( رضي الله عنه",
  "full_name": "'Attab bin Usayd bin Abi al-'Is ( عتاب بن اسيد بن أبي العيص بن أمية ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Makkah"
    },
    "death": {
      "date_hijri": "13",
      "date_gregorian": "634",
      "date_display": null,
      "place": "Jamadi II, Makkah",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Qadhi(Judge)"
    ],
    "tags": [
      "Quraish",
      "B.Umayya",
      "B.'Abd Shams",
      "Late Muslim"
    ]
  },
  "parents": [],
  "spouses": [
    {
      "id": "421",
      "name": "Juwayriyya bint Abi Jahl ( جويرية/العوراء بنت أبي جهل ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "siblings": [
    {
      "id": "993",
      "name": "'Atika bint Usayd bin Abi al-'Is ( عاتكة بنت أسيد بن أبي العيص بن أمية ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "990",
      "name": "Khalid bin Usayd bin Abi al-'Is ( خالد بن أسيد بن أبي العيص بن أمية ( رضي الله عنه",
      "grade": "Comp.(RA)"
    }
  ],
  "children": [
    {
      "id": "995",
      "name": "'Abdur Rahman bin 'Attab bin Usayd ( عبد الرحمن بن عتاب بن اسيد بن أبي العيص ( رضي الله عنه",
      "grade": "Comp.(RA)"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "students": [
    {
      "id": "11002",
      "name": "Sa'id ibn al-Musayyib سعيد بن المسيب بن حزن أبو محمد القرشي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11029",
      "name": "'Ata' bin Abi Rabah عطاء بن أبي رباح",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1603",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا عبد العزيز بن السري الناقط، حدثنا بشر بن منصور، عن عبد الرحمن بن إسحاق، عن الزهري، عن سعيد بن المسيب، عن عتاب بن أسيد، قال أمر رسول الله صلى الله عليه وسلم أن يخرص العنب كما يخرص النخل وتؤخذ زكاته زبيبا كما تؤخذ زكاة النخل تمرا ‏.‏",
      "text_en": " Narrated Attab ibn Usayd:                     The Messenger of Allah (ﷺ) commanded to estimate vines (for collecting zakat) as palm-trees are estimated. The zakat is to be paid in raisins as the zakat on palm trees is paid in dried dates.",
      "chain": [
        "20531",
        "11876",
        "11013",
        "11002",
        "994"
      ]
    },
    {
      "hadith_no": "644",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Zakat - كتاب الزكاة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "7",
      "text_ar": "حدثنا أبو عمرو، مسلم بن عمرو الحذاء المدني حدثنا عبد الله بن نافع الصائغ، عن محمد بن صالح التمار، عن ابن شهاب، عن سعيد بن المسيب، عن عتاب بن أسيد، أن النبي صلى الله عليه وسلم كان يبعث على الناس من يخرص عليهم كرومهم وثمارهم ‏.‏  وبهذا الإسناد أن النبي صلى الله عليه وسلم قال في زكاة الكروم ‏\"‏ إنها تخرص كما يخرص النخل ثم تؤدى زكاته زبيبا كما تؤدى زكاة النخل تمرا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ وقد روى ابن جريج هذا الحديث عن ابن شهاب عن عروة عن عائشة ‏.‏ وسألت محمدا عن هذا الحديث فقال حديث ابن جريج غير محفوظ وحديث ابن المسيب عن عتاب بن أسيد أثبت وأصح ‏.‏",
      "text_en": " Attab bin Asid narrated that :                     the Prophet said about Zakat on grapevines: \"They are to be assessed just as the date-palm is assessed. Then its Zakat is paid in raisins just as the Zakat for the date-palm is paid in dried dates.\"",
      "chain": [
        "30411",
        "20703",
        "11013",
        "11002",
        "994"
      ]
    },
    {
      "hadith_no": "1891",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters Regarding Zakat - كتاب الزكاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الرحمن بن إبراهيم الدمشقي، والزبير بن بكار، قالا حدثنا ابن نافع، حدثنا محمد بن صالح التمار، عن الزهري، عن سعيد بن المسيب، عن عتاب بن أسيد، أن النبي  صلى الله عليه وسلم  كان يبعث على الناس من يخرص عليهم كرومهم وثمارهم ‏.‏",
      "text_en": " Attab bin Asid narrated that:                     the Prophet used to send to the people one who would assess their vineyards and fruits.",
      "chain": [
        "30285",
        "32009",
        "20703",
        "11013",
        "11002",
        "994"
      ]
    },
    {
      "hadith_no": "2273",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا محمد بن الفضيل، عن ليث، عن عطاء، عن عتاب بن أسيد، قال لما بعثه رسول الله  صلى الله عليه وسلم  إلى مكة نهاه عن شف ما لم يضمن ‏.‏",
      "text_en": " It was narrated from 'Ata that 'Attab bin Asid said that :                     when the Messenger of Allah (ﷺ) sent him to Makkah, he forbade him from profiting off of what he did not possess.",
      "chain": [
        "30203",
        "20023",
        "11029",
        "994"
      ]
    }
  ],
  "total_hadiths": 4
}